{"Jack Straw was one of the few remaining links between the Labour governments led by Blair and Brown and the party's previous incarnation under Tony Benn, John Smith and Neil Kinnock.": [{"url": "https://www.britannica.com/biography/Jack-Straw", "page_content": "Jack Straw, in full John Whitaker Straw, (born August 3, 1946, Essex, England), British Labour Party politician who held numerous government posts, including home secretary (1997–2001), foreign minister (2001–06), leader of the House of Commons (2006–07), and lord chancellor and secretary of state for justice (2007–10).\n\nStraw studied law at the University of Leeds and then received training as a barrister in London at the Inns of Court School of Law (now The City Law School, part of City University London). He served (1971–74) on the Inner London Education Authority and was its chair in 1973, before working as a special adviser to Labour Party cabinet ministers Barbara Castle (1974–76) and Peter Shore (1976–77). After a brief stint as a television researcher, Straw entered Parliament in 1979 as MP for Castle’s former seat of Blackburn, Lancashire. He rose steadily through Labour’s ranks and was elected to the party’s opposition shadow cabinet in 1987. During the party’s internal ideological conflict in the 1980s, he moved from being a traditional left-winger to becoming a more centrist modernizer. He was the first leading member of the Labour Party to propose that it repeal its socialist commitment—Clause IV of the party’s constitution—to the state control of industry. In 1994 Straw managed Tony Blair’s successful campaign to be elected party leader, and one of Blair’s first acts on becoming leader was to win the party’s agreement to rewrite Clause IV.\n\nFollowing Labour’s election victory in 1997, Straw was appointed home secretary. He quickly established his progressive credentials by setting up an inquiry into charges of racism in the London police force, promoting the incorporation of the European Convention on Human Rights into British law, and refusing to allow the former Chilean head of state, Augusto Pinochet, to return home following Pinochet’s October 1998 arrest in London. (The arrest followed a request by the Spanish government that Pinochet be extradited to Spain to face charges of murder. He was allowed to return to Chile in March 2000 when a panel of doctors advised that he was unfit to face trial.) Straw upset many progressives, however, by initiating legislation to withdraw the right of some defendants to be tried by a jury, introducing stricter requirements for people seeking political asylum in Great Britain, diluting Labour’s pre-1997 election promise to establish a freedom of information law, and resisting calls to decriminalize the consumption of so-called “soft” drugs, such as marijuana.\n\nIn a 2001 cabinet reshuffle, Straw received the foreign and Commonwealth affairs portfolio. As foreign minister, Straw supported the invasion of Iraq as well as the expansion of the European Union (EU). Despite the latter position, however, Straw was a known skeptic of the euro, the EU’s single currency. Shortly after Labour’s poor showing in the May 2006 local elections, Blair overhauled his cabinet, and Straw was removed as foreign minister and made leader of the House of Commons. Later that year he caused controversy when he stated that Muslim women should not wear full veils. After Gordon Brown became prime minister in 2007, Straw was named justice secretary and lord chancellor, thereby becoming the first member of the House of Commons to take up the latter post. The following year he outlined potential reforms to the House of Lords, which included the election of a certain percentage of members and a reduction in the number of lords. In 2009 he sparked debate after stating that oil deals with Libya had played a “very big part” in the decision to release Abdelbaset Ali Mohmed al-Megrahi—a Libyan convicted of bombing Pan Am flight 103 in 1988—from a Scottish prison. In the general election of 2010 Straw easily retained his Blackburn constituency but lost his cabinet position when Labour was ousted from office. In February 2015 Straw temporarily resigned from the Labour Party after allegations surfaced of his involvement in an influence-peddling scandal that resulted from a sting investigation conducted by Channel Four and The Daily Telegraph. Having already announced in 2013 that he would not stand for reelection, Straw retired from the House of Commons in 2015."}, {"url": "https://www.theguardian.com/politics/2016/feb/09/jack-straw-denied-knighthood-peerage-jeremy-corbyn", "page_content": "Jack Straw, who was a cabinet minister throughout the 13 years of the last Labour government, is to be denied a knighthood and a peerage under the current party leader, Jeremy Corbyn.\n\nHaving served as home secretary, foreign secretary and then lord chancellor, Straw is understood to have been lined up for a seat in the Lords during the final days of Ed Miliband’s period as party leader. But he suspended himself from party membership last February after being secretly filmed by undercover reporters while apparently offering his services to a private company for cash. This prevented an offer of a peerage at the time.\n\nAlthough Straw was subsequently cleared of misconduct by the parliamentary standards watchdog, his chances of a seat in the Lords are said to have disappeared after Corbyn’s election as leader in September.\n\n“The chances of Jeremy awarding him with either a knighthood or a peerage are close to zero,” said one senior party source, before adding: “Actually, they are zero.”\n\nStraw, who stood down as MP at the last general election, did not respond to requests for comment. He is currently serving on a panel that is reviewing the Freedom of Information Act, although his appointment was criticised by some, as he has been a vocal opponent of the act.\n\nOn Monday, the Guardian reported that Straw led two of the Whitehall departments most likely to reject public requests for information. Straw’s ministries never ranked higher than 15 out of 21 government departments in terms of releasing information in full, according to a Guardian analysis of government-wide figures.\n\nAccording to party sources, there are several reasons for the decision not to nominate the former minister for a peerage: his support for the 2003 invasion of Iraq; a damages claim that is being brought against him by a Libyan couple who were “rendered” to one of Muammar Gaddafi’s prisons; an ongoing inquiry by Westminster’s intelligence and security committee (ISC) into that and other rendition allegations; and the words that were captured by the undercover reporter.\n\nIt appears Straw’s support for the war in Iraq counts most heavily against him among the Labour leader and his closest supporters.\n\nBoth Straw and the Tory MP Sir Malcolm Rifkind, the then chair of the ISC, were caught in a sting mounted by the Daily Telegraph and Channel 4 in February last year. The transcript of the exchanges indicated that Straw hoped for a seat in the Lords.\n\n\n\nThe two men were filmed as they offered to use their positions as politicians in return for payments of thousands of pounds from a fictitious Chinese company.\n\nAt one point, one of the reporters asked Straw about the implications of his leaving the House of Commons. Straw replied: “Well, the implications are that I can do a lot more for you.”\n\nA Telegraph reporter then asked: “Ah ha, in what way?”\n\nJS: “Well, it’s not subject to regulation. Obviously ... I’m still the same person – I mean, if you are a member of parliament and you have commercial interests, you have to be so careful ... if I was ever to stand up in the House of Commons and talk about sugar, I could end up being disqualified … Because there are very strict rules against advocating on behalf of companies who are paying you.”\n\nTel: “Right.”\n\nJS: “ ... Well obviously if I’m not in the House of Commons, I’m not in that position. I could end up in the House of Lords, so you’re aware ... you may have seen that ...”\n\nTel: “That’d be good. You mentioned.”\n\nJS: “ ... I mean there’s speculation in the paper at the moment – no one has said anything to me officially. But the rules there are different and plenty of people have commercial interests there.”\n\nTel: “Ah great, so you’ll be able to help us a lot more potentially?”\n\nJS: “I’ll be able to help you more, Claire, I’ll be able to help you more.”\n\nBoth politicians denied any wrongdoing, and said that they had acted in accordance with parliamentary rules. Rifkind was suspended from his parliamentary party while Straw suspended himself. Senior Labour sources say Straw had been in line for a peerage until this point.\n\nIn September, Conservative sources briefed journalists that Rifkind would be “near the top of the list” the next time David Cameron proposed a list of new political peers.\n\nThe parliamentary standards commissioner, Kathryn Hudson, and the House of Commons standards committee cleared both of any wrongdoing and criticised the way the exchanges had been reported.\n\n\n\nBoth the Telegraph and Channel 4 were angered by the commissioner’s conclusions. The Telegraph published a leader which condemned them as “deeply troubling” and “shameful”, while Channel 4 reported itself to the regulator, Ofcom.\n\nIn December, Ofcom found that the reporting was of significant public interest and did not unfairly represent the two politicians. It also concluded that the undercover filming was “proportionate and warranted”.\n\nA damages claim is being brought against Straw by Abdel Hakim Belhaj, who was abducted in Thailand and flown to Tripoli along with his pregnant wife, Fatima Bouchar, in March 2004, with the assistance of MI6. Straw was foreign secretary at the time.\n\nA cache of secret documents that detailed the involvement of MI6’s then head of counter-terrorism, Mark Allen, in that rendition was discovered during the 2011 Libyan revolution. After Straw gave an interview to the BBC in which he said that “no foreign secretary can know all the details of what its intelligence agencies are doing at any one time”, well-placed sources told the Guardian that the rendition operations were “ministerially authorised government policy”.\n\nGovernment lawyers are arguing that the claim should be thrown out on the grounds that the case will involve the acts of other countries. A decision is expected from the supreme court in the next few months.\n\nMeanwhile, a Scotland Yard investigation, Operation Lydd, has been examining the Libyan rendition operation. A police file is currently with Alison Saunders, the director of public prosecutions.\n\nThe treatment of Belhaj and Bouchar is also being investigated by the ISC, after an interim inquiry by Sir Peter Gibson, a retired appeal court judge, reported that there were “serious allegations of UK involvement” which “plainly require investigation”.\n\nWhen asked about the Libyan renditions in the past, Straw has said: “At all times I was scrupulous in seeking to carry out my duties in accordance with the law, and I hope to be able to say more about this at an appropriate stage in the future.”"}, {"url": "https://www.theguardian.com/politics/2015/apr/26/jack-straw-wanted-labour-leader-enough", "page_content": "\n\n\n\nStraw, 68, was Labour MP for Blackburn from 1979, home secretary (1997-2001) and foreign secretary (2001-6). He was suspended from the party in February after being filmed in meetings discussing consultancy work\n\nWhy are you standing down now?\n\nI’ll be 69 in a couple of months and I wasn’t certain that I had the energy to meet my constituents’ needs throughout the five years. I had a pretty big operation 20 months ago for the removal of a thyroglossal duct cyst, which got me thinking. Although I’ve made a complete recovery, it concentrated my mind and it coincided with my mother’s death. I don’t know how I’ll feel on 7 May, except I will feel some sense of loss, because I love the place.\n\nYou’ve vigorously defended your actions in Channel 4’s ‘cash for access’ sting. Does it sadden you that it could overshadow 36 years as an MP?\n\nThe discussions I held were all about what I might do after I had finished as an MP. There is nothing whatsoever improper in discussing one’s retirement plans. I was not anticipating, nor would I have wished, that my last few weeks in the Commons should in part have been taken up with dealing with a sting. But I’ve been hugely moved by the many messages from my constituents, from members of the public and from colleagues on all sides of the house, showing that they certainly do not consider that recent events overshadow my 36 years in parliament.\n\nDo you wish you’d been Labour leader?\n\nNot really. If I’d wanted to be Labour leader enough then I would have stood for it. Whether I would have got elected is another matter. Tony used to talk to me about standing from time to time… The irony is that if someone had said, “Mr Straw, by some strange process a decision has been made that you are the next leader, will you sign here?” I would have signed there and I would have done the job, I think, reasonably satisfactorily. But the people who become leaders are people who really, really want to be. I ain’t complaining.\n\nPersonal fitness was always very important to you – why is that?\n\nYes, I’m a regular in the House of Commons gym. I was absolutely determined to keep it up all the way through being a minister. It was one of the keys to my physical but also mental survival. You can really work things out if you’re on the spinning bike, or in a body blast class, or upside down in a yoga class, wondering how you got there.\n\nHas the scrutiny of yourself and your family been draining?\n\nYou get used to it, but sometimes it can be tough and sometimes it can be very personal. Most of the stuff people try to raise about my family you could knock on the head, but sometimes you couldn’t, and when members of your family get embroiled in stuff just because they are related to you, it’s very unpleasant. But tant pis.\n\nYour son, Will, is now standing as a Labour MP for Rossendale and Darwen, a very tight, ‘bellwether’ seat. Do you think he’ll win? What about the Labour party?\n\nI am the most pessimistic campaigner, but I think Will has got a very good chance. To use a sailing analogy, it partly depends on the wind and it partly depends on his own helmsmanship. But he’s working very hard. Do I think we can win? Yes, I do actually. Despite all that has been piled on the party in general and the leader, Ed Miliband, in particular, our arguments are getting through. So inshallah, as they say."}, {"url": "https://www.britannica.com/place/United-Kingdom/The-Tony-Blair-government-1997-2007", "page_content": "The Tony Blair government (1997–2007)\n\nThe struggle for control of Labour Tony Blair During its years out of power, the Labour Party had undergone a gradual transformation as it attempted to distance itself from the power of the unions on the one hand and the power of the membership on the other, in the guise of the traditional role of the Labour Party Conference. This process had been started before 1992 by Neil Kinnock, who led the party from 1983 to 1992, and it was continued by his successors, first John Smith and then Blair. The need for fundamental reappraisal had been urged as early as 1981, with the founding of the Social Democratic Party, when prominent Labour Party politicians, led by Roy Jenkins, seceded from the party in an attempt to “break the mould” of British politics. Divisions not only between the right and left in the party but also within the left of the party itself added to the chaos that was the British left in the 1980s; the insistence of the radical leftist and former Labour minister Tony Benn on running against the former Labour chancellor Denis Healey in the party election for deputy leadership in 1981 effectively split the radical democratic left and disabled the possibility of an early riposte to Thatcher. It also, ironically enough, contributed to what became known as “New Labour,” rather than a more left-wing variant of labourism eventually replacing the Conservatives.\n\nNew Labour, the repeal of Clause IV, and the “third way” The understanding that the party would have to rethink the market (not only in economic but in social terms), embracing it in a way foreign to many of the unions and the traditional Labour left, grew increasingly after 1992, until, after the Labour victory of 1997, there was a clearly marked path for New Labour. The most symbolically important marker of the change from old to New Labour was the repeal of the party’s Clause IV, engineered by Blair in 1995. The replacement of old Clause IV, which had committed the party to the “common ownership of the means of production,” ended almost 80 years of dedication to that goal. The new path of the party was to be a middle one, in the phraseology of New Labour, a “third way,” supposedly embracing both social justice and the market. Not only in rhetoric but in reality, New Labour was to be different from the old. There was also to be increasing attention to the importance of the media, an attention that the Tories had developed into something of a fine art under Thatcher, with her press secretary Bernard Ingham. Given the increasing role of the media in the presentation of politics and indeed the almost wholesale integration of political substance and political style through the media, this mastery of the art of “spin” was to become a political necessity. Therefore, art for art’s sake (spin for spin’s sake) was to become a feature of Labour government after 1997. This approach was ultimately to rebound upon the party and, indeed, upon the political process in general during the next decade with the emergence of widespread disillusionment with politics in British society, especially among young people.\n\nNavigating the European monetary system and the EU Social Chapter Labour’s landslide victory in 1997, which undoubtedly benefited from the inspirational leadership Blair seemed to offer, nevertheless may have been less the result of an unbounded belief in New Labour than of the discrediting of the Conservative Party. It is certain that Blair was helped into power by the parlous state into which the Conservative Party had fallen under Major after 1992. Promising that “we ran for office as New Labour, and we shall govern as New Labour,” the Blair government in fact began in a rather conservative fashion, by accepting existing government spending limitations. Nonetheless, the difficult and what came to be the increasingly troubled task of combining aspects of Thatcherism with the idea of a “social market” gathered momentum. Certainly, through much of Blair’s tenure a buoyant economy, well managed by Chancellor of the Exchequer Gordon Brown, did a great deal to ease the passage of New Labour and the third way. In his first major initiative and one of his boldest moves, Blair, abetted by Brown, granted the Bank of England the power to determine interest rate policy without government consultation. This was a major move in the disengagement of financial markets from the state. Blair’s government was also more and more taken up with the question of whether Britain should stay in or remain outside the European monetary union. At stake were fundamental ideas about British sovereignty and whether, in a progressively globalized world in which some claimed that the individual nation-state was becoming unviable, sovereignty in its existing forms could remain intact. For the Conservative Party, ever more hostile to the EU, this question was central to its attempts to fight back against the Labour Party. Blair’s government did sign the Treaty on European Union’s Social Chapter—which sought to harmonize European social policies on issues such as working conditions, equality in the workplace, and worker health and safety—despite Major’s earlier negotiation of an “opt out” mechanism to placate the treaty’s Conservative opponents. However, the Labour Party’s implementation of the Social Chapter was at best halfhearted, and its goal became to influence as much as possible the EU itself to moderate the operations of the chapter. As with financial deregulation, the emphasis in labour affairs was on the market.\n\nThe Good Friday Agreement Conspicuous progress was also made in solving the problem of Northern Ireland. Under Major, in 1994, the IRA declared a cease-fire, the Protestant paramilitaries followed suit soon after, and talks between the British government, the Irish government, and Sinn Féin began. The IRA cease-fire secured a long and involved series of negotiations, in which the Good Friday Agreement (Belfast Agreement) of 1998 seemed to have at last brought peace to Northern Ireland. Unionist suspicion and concern about fundamental reforms to the traditional power structure of the province meant, however, that the implementation of the agreement became a tortuous business. Indeed, it took almost another decade to arrive at what looked like a final resolution, when in 2007 the Northern Ireland Assembly was restored on the basis of power sharing between what had erstwhile been bitter enemies, Sinn Féin and the Ian Paisley-led Democratic Unionist Party.\n\nLondon’s local government, House of Lords reform, and devolution for Scotland and Wales In May 1998 voters in London overwhelmingly approved the government’s plan for a new assembly for the city and for its first directly elected mayor, resulting in the capital’s first citywide government since the abolition of the Greater London Council by Thatcher in 1986. However, the precedent of an elected mayor in London was not subsequently followed by similar action in other major British cities. In the late 1990s the Labour government also carried out several other constitutional reforms. The House of Lords, previously dominated by hereditary peers (nobles), was reconstituted as an assembly composed primarily of appointive life peers, with only limited representation of hereditary peers. Nonetheless, the striking contradiction of an unelected legislative assembly in a country that prided itself on its traditions of liberal democracy was apparent. Following referenda in Wales and Scotland, the National Assembly for Wales and the Scottish Parliament were established in 1999 and granted powers previously reserved for the central government. Yet, with the exception of political devolution to the component states of the United Kingdom, the Labour Party remained reluctant to reform the constitution, so that at the beginning of the 21st century it was still the revered mysteries of the uncodified British constitution by which the British were governed.\n\nThe royal family’s “annus horribilis,” the death of Princess Diana, and the Millennium Dome The 1990s were a period of transition and controversy for the monarchy. In 1992, during what Queen Elizabeth II referred to as the royal family’s “annus horribilis,” Charles, prince of Wales, heir to the British throne, and his wife, Diana, princess of Wales, separated, as did Elizabeth’s son Andrew, duke of York, and his wife, Sarah, duchess of York. Moreover, Elizabeth’s daughter, Anne, divorced, and a fire gutted the royal residence of Windsor Castle. After details of extramarital affairs by Charles and Diana surfaced and the couple divorced, observers openly questioned Charles’s fitness to succeed his mother as sovereign, and public support for the monarchy ebbed. The immensely popular Diana (dubbed the “People’s Princess”) died in an automobile accident in Paris in 1997, prompting an outpouring of grief, or at least hysteria, throughout the world. The British royal family came under scrutiny for its handling of the matter—especially the queen’s reluctance, because of tradition, to allow the national flag to fly at half-staff over Buckingham Palace. With the queen celebrating her 50th wedding anniversary, the queen mother, Elizabeth, celebrating her 100th birthday, and Charles working hard to improve his public image, the fortunes of the monarchy improved by the end of the 1990s. Nevertheless, the established institutions of the British state had been called into question in an unprecedented way. If the popularity of the monarchy survived, it was largely the result of the queen’s persona; the royal family as a whole—itself the idealized media creation of late Victorian times—frequently had become the object of ridicule. The transformation of the monarchy was indeed emblematic of the very unevenly progressing severance of the British from the long-lived institutions and culture of the 19th century. To celebrate the new millennium, the monumental Millennium Dome, the largest structure of its kind in the world, and the Millennium Bridge were opened in London. It was perhaps symbolic of the contradictions of this modernity that the dome was dogged by controversy regarding its cost and design and the bridge by the fiasco of its opening, when it was found to move alarmingly above the waters of the Thames when in public use.\n\nThe battle for the soul of the Conservative Party In June 2001 Blair’s government was reelected with a 167-seat majority in the House of Commons—the largest majority ever won by a second-term British government. With the question of European integration continuing to be of great significance in British politics, the new Labour administration chose not to adopt the common European currency, the euro, partly because of a fear of popular response. However, it was on the Conservative side that Britain’s relationship with Europe was most urgently a party issue. It continued to divide a party riven by differences, a party that looked more and more like the Labour Party of the 1980s and early ’90s. Indeed, there is a direct parallel between the recent histories of the two parties: the traditional left of the Labour Party corresponded to the traditional right of the Conservative Party, as both fought hard to stem the tide of party modernization. The battle for the soul of the Conservative Party was joined with growing fervour with the election of David Cameron in December 2005 as its modernizing leader. His subsequent attempt to steer the party back to the political centre, and away from the old order of the Thatcherite legacy, was every bit as difficult as the redirection undertaken by Labour modernizers. In addition to Europe and economic policy, the issue of increased levels of immigration into Britain after 2000 further divided the Conservatives. Indeed, Britain as a whole became divided on this issue. Large bodies of opinion, stirred up by xenophobia in the popular press, responded with fear and anxiety to increased levels of immigration from central and eastern Europe that were a consequence of European integration. In a more globalized and war-ridden world, the burgeoning flow of asylum seekers into Britain added to this climate, as did the “war on terror.” Asian Muslims, many of them long-standing British citizens and British-born, were nonetheless frequently lumped with immigrants and asylum seekers as part of an undifferentiated external threat to Britishness.\n\nResponse to the September 11 attacks Following the September 11 attacks on the United States in 2001, global terrorism dominated the political agenda in Britain, and Blair closely allied himself with the administration of U.S. Pres. George W. Bush. Britain contributed troops to the military effort to oust Afghanistan’s Taliban regime, which was charged with harbouring Osama bin Laden, who had founded al-Qaeda, the terrorist organization linked to the September 11 attacks. Although Blair received strong support for his antiterrorist strategy from the Conservatives and Liberal Democrats in the House of Commons, a small minority of Labour members of Parliament opposed military action. The Blair government also faced a slowing economy and a widespread perception that public services such as health, education, and transportation had not improved. Although large amounts of public money had been spent, particularly on the health service, much of this went into elaborating the new and highly evolved structures of management that came to characterize Labour administration of the state. However, it was the subject of the Iraq War, and Britain’s support for the U.S. position on it, that did most to undermine the standing of Blair."}, {"url": "https://www.theguardian.com/politics/2001/mar/20/jackstraw", "page_content": "Is Jack Straw a widely-popular and successful home secretary? Or is he an authoritarian opponent of freedom of information and trial by jury, as painted by civil libertarians? The answer to these questions may decide whether he is a contender for the top job if Tony Blair stands down and Gordon Brown fails to unite the cabinet behind him.\n\nThe real answer is that Mr Straw, widely seen as a decent man in politics, is a sure-footed, practical improver and cunning tactician. Nowhere was this clearer than in his handling of the Pinochet imbroglio from October 1998 onwards. The Tory right were seeking to canonise the Chilean ex-dictator while leftwing MPs hoped to crucify him. Mr Straw successfully got Pinochet off his hands and handed him back to Chile.\n\nPart of his reputation as an authoritarian is hardly his fault. The short-lived Cabinet Office minister David Clark's liberating freedom of information white paper, published in 1998 and subsequently watered down, could never have got by the restrictive lord chancellor, Derry Irvine. But Mr Straw took the blame. He also brought in his own much more restrictive version, getting it on the statute books in 2000.\n\nMr Straw has shown similar determination in his effort to limit trial by jury for petty criminals who, he argues, are \"playing the system\" very expensively. He sees this as a practical reform, not a betrayal of principle. He took the same view about legislation allowing the security services to intercept private emails.\n\nMr Straw has been just as pragmatic in accepting cabinet decisions which run against his sympathies. Nobody who knows him doubts he still fervently supports first-past-the-post and had doubts about the closed list system of proportional representation. But he accepted this in Scotland and Wales as part of Tony Blair's \"project\" to cosy up with the Liberal Democrats, for whom he himself has no time.\n\nHe is not in the Blairites inner-circle but bides his time on its outer soft-left fringe. His views derive from a practical, pragmatic examination of his own experience and those of his constituents.\n\nWhen Gordon Brown was worrying about the danger of a skills shortage, as made fashionable by US president Bill Clinton's adviser Robert Reich, Mr Straw privately pointed to the tens of thousands of skilled workers sacked in two recessions.\n\nHis ability to identify with his Blackburn constituents troubled by \"neighbours from hell\" on their council estates came from his own experience as a child on a council estate in Loughton, Essex. His father, Arthur, was an insurance clerk and conscientious objector who had met his mother, a teacher, in the peace pledge union. They were divorced when he was ten and he was brought up by a single mother. \"We had very little money. There were five children and no father but we didn't get into trouble.\"\n\nIf he is strong on anti-racism, announcing an immediate inquiry into the Stephen Lawrence case, it is partly because of his experience at Brentwood school where he became deputy head boy but was bullied.\n\nAn Aldermaston marcher at 12, a Labour party member by 15, he started on the sensible left as president of Leeds student union and the national union of students. His ambition for political office was whetted on Islington borough council.\n\nHe gave up the bar to become, at 27, special adviser to Barbara Castle at the Department of Social Security. He also met his wife Alice Perkins during his time there. She was a high flying junior civil servant, and is currently deputy to Richard Wilson, the cabinet secretary. The Straws are the most formidable power couple in Whitehall.\n\nHis time with Barbara Castle left him not only with a wife but also a deep-rooted Euroscepticism. This continued when she was sacked by James Callaghan in 1976. Mr Straw swiftly became adviser to Peter Shore, the Europhobe environment secretary.\n\nWith Mr Shore, he helped found the Labour common market safeguards committee, urging withdrawal from the EEC at Labour's 1980 Wembley conference. He was on Mr Shore's leadership campaign team too in 1980 and again in 1983.\n\nWhen Barbara Castle decided to retire from safe Blackburn, she recommended Jack Straw, who had already contested hopeless Tonbridge, as her parliamentary successor, which he became in 1979.\n\nHis party loyalism is of long standing. He tried to dissuade Tony Benn from contesting the deputy leadership against Denis Healey in 1981. He attacked both the SDP deserters and the radicals who provoked them into deserting. When Militant tried to unseat him at Blackburn, he secured 70% backing for the long procedure to expel the Blackburn Six. After Labour's 1983 defeat he warned that a majority of voters opposed its anti-nuclear defence policies. He later advised that London's loony-left councils were making the party unelectable.\n\nAs Labour's education spokesman 1987-92, Mr Straw increasingly fought a two-front war against Kenneth Baker and the Tories facing him and against the Bennite hard-left \"flat earthers\" behind him. It was then that he formed an alliance with Gordon Brown and Tony Blair in opposition to a joint slate for the shadow cabinet linking the soft-left Tribune group and the hard-left Campaign group of Tony Benn.\n\nAs education spokesman, he kept the teachers' unions at arms' length and insisted on frequent testing, high educational standards, quality control and consumer choice. He was, after all, a teacher's son.\n\nHe was the first in the \"reform Clause IV\" field with his 1993 pamphlet, 'Policy and Ideology', angering Labour's leader, John Smith, who thought it was a dead issue. He also advocated downgrading the monarchy to Scandinavian proportions.\n\nWhen Tony Blair succeeded to the leadership in 1994, he handed over to Jack Straw his portfolio of shadow home secretary. Famously, Mr Straw attacked aggressive beggars and squeegee merchants. But he failed to make an expected triumph over home secretary Michael Howard's sacking of Derek Lewis, the prison services chief, because of Tory heckling and his own tinnitus. To his embarrassment Mr Blair even took to the despatch box to challenge Mr Howard. Yet only months later, Mr Straw was doing Mr Howard's job.\n\nHe has done it ever since, a reassuring figure in the New Labour pantheon: confident, able and modestly ambitious. These are traits which may yet put him in the running to enter Number 10.\n\nAsk Aristotle about Jack Straw"}, {"url": "https://www.theguardian.com/politics/1999/jul/24/labour.jackstraw", "page_content": "Most members of the cabinet will spend this weekend in various states of alarm and anticipation. Frank Dobson and Mo Mowlam have even dared to go public with their anxieties about the looming end-of-term reshuffle. One cabinet member, though, will not waste a moment fretting about what next week may bring: Jack Straw. Not because he is immune to the ups and downs of political life far from it. He won't be worrying about his personal position because it simply isn't in his nature.\n\nIn the few months after Labour's May '97 election victory, Straw was riding high. Every other commentator was touting him as the discreetly rising star, the man whom the prime minister saw as the very epitome of New Labour's modernising competence. He had, by every account, quietly stepped up into the cabinet's super league and been anointed one of the big five, along with Blair himself, Gordon Brown, Robin Cook and John Prescott .\n\nBy contrast, Straw has spent the past few months, and particularly the most recent weeks, either grappling with administrative balls-ups, or sparking off political firestorms. First he U-turned on private prisons. Then he removed the right to jury trials in some criminal cases. Then he woke up to discover that someone in his department had failed to notice a chunk of the prevention of terrorism act was no longer in force. The hitherto quiescent liberal left broke out in righteous apoplexy over his plans for handling asylum seekers. Next minute he provoked outrage, not least at the Guardian, by publishing a frankly illiberal freedom of information bill. And, to cap it all, the passport agency was compelled to admit that its new computer system couldn't cope with the summer rush holidaymakers were hopping about in fury at the end of lengthening queues.\n\nIs he ruffled? Hardly. Straw says he knew that, just as his reputation had risen impossibly high, so it would inevitably fall. Consequently, he's relaxed about it. In fact, it's impossible to imagine any other senior Labour politician being quite so self-assured. 'There was all this high praise, which was very nice at the time. But I always said it wouldn't last, and I knew it wasn't going to last for two reasons,' says Straw. 'One, there is a natural and understandable tendency for fashion in politics you're the flavour of the month. And two, some things were bound to go wrong. Political reputations are like shares. People invest in you, your share price goes over the top, and there's a natural market reaction.'\n\nThe home office, he says, is also different because everything ends up on the boss's desk. The home secretary is more directly blameable than most other secretaries of state, and virtually every area of his responsibility immediately affects people's life and liberty. So the job is especially prone to unpredictable catastrophe: 'One of my predecessors, who was in one of the Thatcher cabinets, said to me, 'What you have to understand about being home secretary, Jack, is that at any one time there'll be 50 sets of officials working on projects which will undermine the government and destroy your political career. And the worst is, not only do you not know who they are, they don't know either.' That puts it exactly. You almost run up the wall here, because people have just not understood what they've been doing.' In a characteristic gesture of exasperation Straw holds up both palms, rolls his eyes to the ceiling, and lets out a strangled sound, half laugh, half sigh.\n\nFor all those reasons, though, the job fits him like a tailored suit. Why? Because Straw's defining public quality is that he is an administrative politician. 'I'm very interested in how organisations operate I'm fascinated by the difference that one individual at the top of an organisation can make, and what that individual can do to change the relationship between people, and free up things though I know there are also limits to it.' It is no coincidence that Bob Ayling, the head of British Airways, is one of Straw's closest personal friends: born on the same day, they had a joint 50th birthday party three years ago, and often compare notes on managing their very different enterprises.\n\nIt's not merely an intellectual interest, either. If you see Straw out and about, it feels more like observing a modern manager than watching a politician. On one day recently, for example, visiting Liverpool passport office at the height of the agency's troubles, Straw sat with staff noting down their concerns, and then carefully walked the queues, treating the public more like customers whose problems he needed to hear than as voters whom he needed to charm. Michael Goodman, who was Straw's pupil master when he read for the bar, says the 'one quality that you notice about Jack over all the years is that of being a good listener'.\n\nStraw's straightforward directness comes, according to friends, from an inbuilt self-confidence. Straw himself is fond of pointing out that people's egos get in the way of their ability. A good manager makes headway because his colleagues trust him, and self-inflating fanfare, in Straw's book, is a sure sign of an unsure manager. Ben Lucas, a political consultant who was Straw's adviser between 1992 and 1996, says: 'Jack's great advantage is that he is emotionally and politically secure.'\n\nWherever that sense of security came from, it certainly wasn't from an easy background. Straw's parents split up when he was 10, so the five children (Jack is the second eldest) were brought up in a council maisonette in considerably poorer surroundings than they might have expected, given that their mother, Joan, was a teacher and their father , Walter, an insurance salesman as conventionally lower middle class as you can get. Nor was the separation amicable: the couple rowed for several years before the break-up, and Jack's youngest sister was only three months old when his dad left. Jack's brother, Ed, who now runs the marriage guidance service Relate, was so angry at their father 's desertion that he refused to speak to him for more than 30 years.\n\nJack won't talk about it publicly, because both parents are still alive and he doesn't want to offend either of them. But it's clear that the need to battle their way through in reduced circumstances strongly affected the Straw children. In Jack's case, it bred a man with an independent cast of mind, protective of family and committed to traditional values. Because his mother went to work, Jack learned how to cook, look after the home, and (as the eldest boy) to shield his mother and siblings.\n\nOne reason Straw engages with ordinary people so successfully is that he readily introduces his private life into conversation. The habit gives a kind of rootedness to Straw's politics that many of his colleagues conspicuously lack, but it also gets him into trouble. On one occasion, for example, he underlined a speech on nuisance families by referring to some neighbours who lived nearby when he was a child. Straw said Mrs Swindell once stormed into their kitchen and clouted his mother on the nose after Joan had told off one of the Swindell children Jack stepped in to stop the neighbour from doing worse damage. The row ended with private prosecutions at Epping magistrates court, where 13-year-old Jack gave evidence, and Mrs Swindell was bound over and fined £1. But when the Daily Mail hunted Mrs Swindell down for her side of the story, the paper was gratified to report her recollection of Jack as 'a toffee-nosed boy nobody wanted to play with' who told off the ice-cream man for playing his chimes after 7pm.\n\nStraw went to board at Brentwood, a direct grant school. Later, talking about bullying, he once confessed that he had both bullied and been bullied there, triggering a hacks' hunt for Straw's victim. He also, more poignantly, spoke at the time of the vote on reducing the age of homosexual consent about how appalled he had been when a gay schoolmate gassed himself in desperation.\n\nAlthough both his parents were themselves scholarship kids (his dad hailed from Barnsley, his mother from Essex), there was no tradition of boarding school life still, Straw says he took a lot from Brentwood. Last year he went back to deliver the prize-giving speech, and was struck by how many people came up afterwards to agree with his remarks about how he had come to realise that the school, while intensely traditional in style, 'encouraged you to argue, to challenge', which he believes is a particularly Essex trait.\n\nStrands of radicalism ran through the family. Walter was a conscientious objector. Joan was an active party member (she became an Islington councillor in her 70s). She is descended from the Gilbey gin family: her maternal grandfather was famed for opposing enclosure, and her father (a German Jewish emigre) served as a T& G shop steward on the London buses and worked alongside Ernie Bevin.\n\nSue, his elder sister, took him to his first Young Socialists meeting, but after that Jack made his own precocious way. 'My first memory of working for the Labour Party was in 1955, standing on the porch of St John's parish church hall, collecting numbers in an urban district council election. I remember a police officer pouring out his heart to me about how he'd been stopped from promotion because he'd been caught smoking on duty at two o'clock in the morning. I was eight at the time.'\n\nAt the 1959 election 'the local party thought it would be a good wheeze to have this young man who's interested in politics making a speech at the adoption meeting, so I did that, when I was 13.' Later in the same campaign came the moment when Straw first contemplated a political career. 'I'd spent an afternoon in the rain delivering election literature and I was soaked. I came back, and I'd been reading one of the leaflets, and I remember looking up at our block of flats thinking 'there must be better ways of working for the Labour party, I think I fancy being an MP'.' Not exactly fate's blinding light he later realised that if you really want to be an MP, the best thing is not to set out to do it.\n\nHe racked up 10 O-levels by the time he was 14 and was made deputy head boy, a mainstreamer through and through whose only stroke of adolescent exhibitionism was to call himself Jack in honour of a peasants' revolt leader who happened to bear that name (the family have always called him John, and still do). Studying law at Leeds, he discovered that he loved debating, and remains a gleeful verbal duellist, always happy to launch into a hearty argument. Straw relishes the company of friends who disagree with him. One recalls recently becoming quite heated at the Straws' lunch table, and telling the home secretary that he was fed up with his autocratic policies. Straw just beamed, utterly unoffended, and shot back: 'Good you're supposed to be, because those policies are not for you.' He particularly enjoys his own children taking him on and giving as good as they get.\n\nStraw took only a 2:2 in law from Leeds university, because his energies were diverted into student union activism. There his real metier emerged: 'I discovered I was a good administrative politician.' That puts it mildly, and modestly. Straw went on from the presidency of the Leeds Union to presidency of the National Union of Students, and converted it, in the course of a two-year tenure, from an introverted sideshow into an influential and effective campaigning organisation. He was the first NUS president to have a powerful national profile, because he set about transforming it into a proper union, negotiating recognition agreements at campuses all over the country, recruiting members, and conducting successful battles with government. He fought off, for example, Margaret Thatcher's early attempt to abandon student grants.\n\nHe was no long-haired hippy leftie, much less a clipped-voice Trot. Straw was elected on the Broad Left platform, pragmatists who spent much of their energy fighting off the revolutionary fan tasists. His election slogan was 'respect, but not respectability', and his favourite quotation was Stalin's dry epigram: 'Once the political line has been settled, organisation counts for all.' He wore a tie, campaigned against cannabis use, and declared that the students' union should be 'unalterably opposed to violence'.\n\nBy the time he was 22, Straw already had experience of running a national organisation with 200 full-time staff, and had built up a potent public image: he could have embarked immediately on a political career. Instead, he returned to learning. 'The best decision I ever made in my life, when I'd finished at the NUS, was to go back and do my bar finals. I was being offered jobs in the trade union movement, television, journalism, and it would have been very easy to go down that path. I thought, no, I owe it to myself, I want to go to the bar. Really I wanted to do it for myself.'\n\nThis time he did work hard, and proved his academic and legal talent by coming third in the country in bar finals. Michael Goodman says: 'Jack was recommended to me, and I had no hesitation in taking him on. He appealed to me as someone who was quite obviously enthusiastic about the law, had a very clear, analytical brain, and was very friendly, with a good sense of humour. As it turned out, he was the most outstanding of all my pupils. He had all the qualities necessary to make a very successful barrister.' Straw made tenancy in his chambers, and his name is still up on the board. He practised as a criminal law junior, and was outside the Old Bailey when the IRA bombed it in 1973: Straw got a sliver of glass in his buttock, and has ever since taken a hard, cold view of terrorism.\n\nStraw kept up his politics, first by sitting as an Islington councillor (which he remained till 1978), then becoming deputy leader of the inner London education authority (aged 26), and standing as parliamentary candidate in the February 1974 election in Tonbridge, a total no-hoper for Labour. 'I had a side bet with the Liberal, each of us betting that we'd come third. I took a bit of money off him for that I came third by 18 votes.'\n\nWhen Straw sought advice on which way to steer his life Goodman said stick with the law, you're good at it, you'll do well. But he also suggested that Straw go to see their head of chambers, Edward Gardner QC, who was a Tory MP. 'Ted said to him, 'I've only one question to ask you. In 20 years, where would you rather be, on the high court bench, or in the British cabinet?' Jack knew then that his heart was in politics. As it happened it took him 23 years to arrive in cabinet.'\n\nStraw was introduced to Barbara Castle by her husband Ted (who was an Islington alderman) she asked Straw to become her special adviser, giving him about the best education in Labour government anyone could wish for. She was one of the most determined, individualistic politicians of her time, outspoken, courageous, and with more knowledge of the Labour movement in her small frame than a whole barful of beer-bellied union officials.\n\nNorman Warner, who was Castle's principal private secretary at the time, says Straw learned a lot from her. 'She had very strong convictions, certainly, but she was also a consummate operator within government she knew that you wouldn't make progress if you didn't tie up the prime minister and the chancellor in support of your policy.'\n\nThe other personal story Straw won't easily discuss is his first marriage, to Anthea Weston. They wed in 1968, two weeks before Straw's 22nd birthday, but his immersion in work and politics left little time for the relationship. In March 1976, when the couple's relationship was already strained, Anthea gave birth to a daughter. The baby had a congenital heart defect and died after only five days: Jack and Anthea separated before the year's end. Straw once said, 'without any question . . . those were the worst days of my life'. Following his single-parent upbringing, the divorce gave Straw an acute sense of his own and other people's fallibility which is why, though a practising Christian, he strives not to climb preachily into the political pulpit. He can present policy pitches from anti-social behaviour orders and parent counselling through to zero tolerance of squeegee merchants and winos with unusual sincerity. And, perhaps more importantly, the collapse of his first marriage taught another lesson: Straw was determined, when he remarried, to give the necessary time to his wife and family.\n\nIn 1977 he quit politics to spend a couple of years on World in Action as a researcher and producer while he cast around for a parliamentary opening. Then the plum fell ripe from its branch. Castle stood down from her Blackburn seat, and handed it to her protege on a platter. Blackburn is almost the perfect town for a Labour stalwart to represent in fact, you have to go there to grasp why Straw is so opposed to any form of proportional representation that breaks the link between a single member and their constituency.\n\nIn Blackburn the town is the constituency, the constituency is the town. You can more or less stand in the middle and look up to the surrounding hills, and know that this is it, the whole patch. Straw devotes tremendous energy to maintaining an intimate relationship with the town and its people. Adam Patel, a local Asian community leader and party activist who has known Straw since he started visiting Blackburn with Barbara Castle, says that even she stopped holding regular surgeries when she became a cabinet minister. 'Jack keeps them up, he still comes up every other week.'\n\nHe's a tough fighter, too. Castle once said she hired him for his 'guile and low cunning'. When, in 1982, a defecting Militant activist within the Blackburn party came to him privately and spilled the Mils' plans, Straw told his informant to stay in place and continue feeding him information. He used the knowledge to discredit Militant, and eliminate them locally. That experience, quite early on in his parliamentary career, placed him clearly on the modernising, Kinnockite wing of the Tribunite soft left. Even today he is not above a little subterfuge. Straw holds regular open-air meetings in Blackburn town centre where anyone can turn up and harangue him. Sometimes, if the day looks like being a bit dull, he will place agitators in the crowd not to toss him easy questions, but to stir things up.\n\nOn the kitchen wall of his small constituency flat, Straw has pasted up an essay written by his daughter that tells you everything you need to know about the care he has put into his second marriage. Charlotte, now 16, wrote about how she and her elder brother William would catch the train up north on a Friday night to be met by their dad at the station, and he would take them on the Saturday afternoon to watch Blackburn Rovers, three precious season tickets clutched in his hand. It's clear from the way she writes that, even at that early age, Straw's daughter could see how important that time was to all of them.\n\nStraw met his second wife, Alice, in Whitehall. She is absolutely his equal, within and beyond the marriage a strong-minded senior civil servant, currently director of resources at the department of health, and universally tipped to make permanent secretary before long. The couple honeymooned in Gujarat, staying at Patel's house, and he remembers their curiosity at the strangeness of India. It was a valuable visit for Straw, given that his constituency has a huge Asian population.\n\nSince then the couple have been meticulous about taking time together, setting aside weekends far in advance and making sure that nothing diverts them from whatever they've planned a two-day trip to Paris or the south of France. Alice's family are Oxfordshire upper middle class, and she has inherited their thatched cottage in Minster Lovell, called The Rosery, where they and the children escape at non-constituency weekends. At Alice's 50th birthday party this year, held in the barn of the nearby big house, more than one guest noted that not a single politician was among those invited: the Straws have a full cast list of intimates beyond the ingrown Westminster world.\n\nStraw works off his frustrations by cross-country running, which clears his head and keeps him fit (he's always been asthmatic, and has worn glasses since he was four). At home he enjoys cooking, he goes to the theatre with his wife, and reads light novels (Dick Francis is a favourite).\n\nThrough the 80s, when many left-of-centre Labourites were exhausted and dispirited by the combination of successive Thatcher defeats and their own internal feuds, Straw purposefully applied himself to the opposition task, first working under Jack Cunningham in local government, and then in his own right as the party's education spokesman. He never scored high in shadow cabinet elections, largely because he has always steered clear of Commons cliques. Most ambitious politicians take it as axiomatic that you must either create your own coterie, or join someone else's. As Ben Lucas points out, that has never been Straw's style: 'Jack works with people he respects and gets on with, wherever they come from politically. So, for example, he has good relations with Bernie Grant, just as he does with Chris Mullin. He doesn't join other people's bands, and doesn't expect them to join his. Whilst that may have been a problem for him in opposition, where an organised group within the parliamentary party can help you score better in shadow cabinet elections, in government it's been an advantage because it means he doesn't have many enemies.'\n\nThe opposition job Straw most enjoyed was education, where he typically set about trying to challenge entrenched teacher union interests and steer Labour on to the standards agenda. He went a long way to shifting his own party's position, but was widely felt to have failed to land punches on the Tories. As in environment and home affairs later, Straw was most eager to answer the demands of the people he grew up among, those middle-of-the-road working people who want their estates cleared of crime, who aspire to see their children succeed in school, and are deeply unimpressed by the kind of posture politics which gave the local government left a bad name.\n\nOnly once in those 18 long opposition years did Straw come close to packing it all in when, in spite of all the policy changes to which he contributed during the 80s, Labour still lost in 1992. It is hard to recall now, but many observers, and many politicians, began to doubt whether Labour would ever win again. Even worse, although he admired and respected John Smith, Straw began to fear that the even more profound change he knew Labour needed would not be possible under Kinnock's successor.\n\nStraw says that he found himself some six months after the 1992 defeat weeping with frustration on a station platform. He remembered a group of women he had met during the campaign: 'It was the Friday before polling day. I had lunch with them, one of the most depressing half hours I've ever spent. They were being pleasant, but just by their body language, what they weren't saying, I could feel their lack of confidence in Labour. And then they started talking about nationalisation, and I realised that if I asked any of them to join the party it would have Clause Four written on it.'\n\nGalvanised, he set about arguing for the abandonment of the party's constitutional commitment to nationalisation. But Smith gave him no support, saying it was merely a sentimental symbol, best left alone. When Smith died, however, Straw's campaigning had laid the ground for Blair to make the great symbolic shift that had such a huge impact on winning trust and persuading voters that Labour really had changed.\n\nBen Lucas says: 'It was a frustrating period for him, after '92, but it also emboldened him, freed him to propose more innovative policies. It wasn't just Clause Four. He also called for a more streamlined monarchy, and advocated the 'reinventing government' agenda, with elected mayors radical modernising policies that are now happening. He'd always been seen before as a party loyalist, and during that time he showed he was much more than that.'\n\nNo one was surprised when Straw managed Blair's leadership campaign, nor when he subsequently jumped up the shadow cabinet hierarchy to take over Blair's own home affairs brief: no other frontbencher could repeat Blair's 'tough on crime, tough on the causes' mantra with such complete conviction as Straw. But even there he suffered setbacks, again failing to land the killer punch, this time on Michael Howard in the Labour-triggered debate on the dismissal of Derek Lewis, head of the prison service. Straw later told an interviewer that he had never believed there was enough evidence to hang Howard, adding that he had also been suffering badly from tinnitus. The maddening affliction, caused by a viral infection, left him deaf in his right ear.\n\nStraw's directness is his greatest blessing, personally and politically. Lord Warner says: 'He's always straight with people. When he goes on the radio or television he doesn't try to pretend black is white. If he's done something wrong, or changed his mind, he admits it. Nor does he ever brief against colleagues.' Even when he lets slip a casually unwise remark, as he did in April this year when he said that Scousers are always 'up to something', most people take his words in their intended spirit. When he berates people for 'walking on by', he means it he has tackled three criminals in his time, once chasing, rugby-tackling, and then frogmarching to the police station a burglar he surprised at the Blackburn Nalgo club.\n\nThe next time he had to deliver a criminal to a police station, though, it was his own son. When William was snared into trying to sell dope to a Daily Mirror reporter at a Pimlico pub, Straw's patently genuine fatherly reaction, so far from imperilling his political career, thoroughly enhanced it. He didn't have to play the part it was obviously deeply felt. Straw accepted that William had been 'a bloody idiot, to say the least', but he also blamed, in some measure, the strains he had himself imposed on his children by choosing to be a public figure. The police gave William a formal warning, and Straw's son has gone on to pick up three As and a B at A-level, enough to seal a place at New College, Oxford, to study PPE.\n\nIn Straw's view, one of the great advances that Neil Kinnock and then Tony Blair secured is the freedom for frontbenchers to challenge the party without having to worry about left-right labels. That's why he huffs at questions about whether or not he's a liberal. 'Take the crime agenda. The party is very happy with what I'm doing. The problem with the small-L liberal agenda was that it sold out on our traditional supporters and members.' He believes he is making the asylum system more humane, and points out that he has shown more concern about rehabilitating prisoners than most of his predecessors. And there's the Pinochet decision.\n\nAbove all, this home secretary wants to be judged according to his ability. 'What I'm interested in is doing a proper job. I'm interested in people turning round when I've finished and saying, 'Yeah, he was willing to take some pretty difficult decisions and see them through, and also he managed the home office, and managed the process of reform, successfully.'\n\nBut if he could choose one clear legacy? Fascinatingly, the real Jack Straw turns out to be the one who prompted the report into Stephen Lawrence's death. Adam Patel, his Blackburn friend, says: 'Jack is making more progress on the race issue than anyone ever before.' Straw himself says: 'If the only thing that could be said for me was that I made a difference on race, then I'd die a happy man.'\n\nLife at a glance\n\nJohn Whitaker (Jack) Straw\n\nBorn:\n\n3 August 1946 in Buckhurst Hill, Essex.\n\nParents:\n\nJoan Sylvia Gilbey, teacher Walter Straw, insurance clerk and conscientious objector.\n\nMarried:\n\n1st 1968 Anthea Weston (teacher), divorced 1978\n\n2nd 1978 Alice Perkins (civil servant), son William and daughter Charlotte.\n\nEducation:\n\nStaples Road County primary, Loughton Brentwood school, Essex\n\nLeeds university (president of union 1967-68).\n\nCareer:\n\nPresident NUS 1969-71\n\nCalled to bar, Inner Temple 1972\n\nMember of Islington borough council 1971-78\n\nPolitical adviser to secretary of state for social services 1974-76\n\nSpecial adviser to secretary of state for the environment 1976-77\n\nWorked for World in Action 1977-79\n\nMP for Blackburn since 1979\n\nOpposition spokesman:\n\nTreasury 1980-83\n\nEnvironment 1983-87\n\nEducation 1987-92\n\nLocal government 1992-94\n\nHome affairs 1994-97\n\nGovernment:\n\nHome secretary since 1997\n\nPublications:\n\nPolicy and Ideology (1993)"}, {"url": "https://www.wsws.org/en/articles/2004/11/stra-n29.html", "page_content": "UK Foreign Secretary Jack Straw sent an extraordinary letter to the Independent newspaper on November 16. It was in reply to an article by Robert Fisk the previous Saturday. In a description of Yassir Arafat’s funeral, Fisk had disparagingly referred to Straw, who attended on behalf of the British government, as a former Trotskyist or “an old Trot.”\n\nStraw responded to Fisk’s factually incorrect aside like a man accused of a heinous crime, stating that to call him a Trotskyist was “a malicious libel.” Far from being a former Trotskyist, Straw indicated that his political sympathies and training could be traced back to Stalinism.\n\nNo leading British politician has ever made a similar statement, and it is extraordinary that a foreign secretary who has worked so closely with the United States feels free to do so. The reader is left wondering whether Straw has taken leave of his senses, or whether he has become so arrogant since the invasion of Iraq that he thinks he can get away with saying anything.\n\nStraw addressed the letter cynically to “Dear Comrade Editor,” before explaining, “I have been consistent in my opposition to Trotskyism and the false consciousness it engenders. I was first taught to spot a Trot at 50 yards in 1965 by Mr. Bert Ramelson, Yorkshire industrial organiser of the Communist Party.”\n\nApparently unable to resist the urge to show off the lessons he had learnt under the tutelage of Ramelson, he added, “PS. Further reading Isaac Deutscher: Trotsky (3 vols). Left Wing Communism, an Infantile Disorder, V. I. Lenin 1919.” This latter book was, he claimed, “a prescient warning about Trotskyist adventurism.”\n\nA week later, Straw was back in the letters column of the Independent on the same subject, responding to a number of letters attacking him. This time he accused Trotskyists of “revanchism, false consciousness and objectively counter-revolutionary tendencies.” He had, he said, been reading Lenin’s Collected Works in the Foreign Office library and found in Volume 17 an article Lenin wrote in 1914 entitled “Disruption of Unity under the Cover of Outcries for Unity.” Mixing this article together with a reference to Lenin’s article “Left Wing Communism” Straw accused Trotsky of “factionalism,” “splittism,” “ultra-leftism,” and “wider infantile disorders.”\n\nIn a failed attempt at wit, he added, “PS Quiz question: Name a successful Trotskyist government (or revolution, for that matter).”\n\nAs a reader shot back the next day, October 1917 was just such a revolution. Trotsky led the Russian Revolution along with Lenin, on a programme based on Trotsky’s theory of Permanent Revolution, and the only people who have ever attempted to deny it are the Stalinists. The accusations that Straw makes in fact go back not to Lenin in 1919 or even to 1914, but to the 1930s, when Stalinists created a lie machine to pervert history and justify a series of political show trials at which all the old Bolsheviks were framed up and murdered.\n\nThe books Ramelson taught Straw to refer to do not say anything even remotely like what he attributes to them. Deutscher’s biography of Trotsky, whatever its failings, has convinced more than one person to join the Trotskyist movement because the events it details reflect so well on Trotsky as a great revolutionary leader—and so badly on Stalin. (The 1914 article that Straw refers to was written when there were sharp political differences between Lenin and Trotsky, because Trotsky was still trying to achieve unity between the Bolsheviks and the Mensheviks.)\n\nThere is no reason for anyone to dwell overlong of Straw’s attacks on Trotsky. History has settled beyond doubt the question of which tendency, Trotskyism or Stalinism, was “objectively counter-revolutionary.” Straw may write as if he is still in a period where the Communist Party of Great Britain and its fellow travelers could attempt to silence their critics by referring to “actually existing socialism” and the power and might of the Soviet Union. But contemporary political reality is a world in which the USSR was destroyed and capitalism restored by Stalin’s heirs, as the final political crime of a bureaucratic tendency whose only lasting legacy has been to disorient the working class through its crimes against socialism and communism.\n\nMoreover, an attack by the likes of Straw, who is even now presiding over Britain’s occupation of Iraq, must be worn like a badge of honour by anyone who fights for a socialist alternative to capitalism, colonial conquest and military barbarism. Indeed, far from being, “a prescient warning about Trotskyist adventurism,” “Left-Wing Communism” offers a startlingly accurate portrait of Labour functionaries like Jack Straw. Lenin might almost have met the man who as British Foreign Secretary has sent troops to seal off Fallujah while US forces lay waste the city and massacre its inhabitants when he wrote that he wanted workers to learn “from their own bitter experience the absolute impotence and spinelessness, the absolute helplessness and servility to the bourgeoisie and the utter vileness of the government of the paladins of the Second International.” [V.I. Lenin, “Left Wing Communism,” in Selected Works, vol. 3, Progress Publishers, Moscow, 1967, p. 399]\n\nNevertheless, Straw’s response is significant in two respects:\n\nFirstly, it draws attention to the usually unacknowledged contribution made by Stalinism to the training of a significant layer of bureaucrats within the Labour Party in a ferocious brand of anti-communism masquerading as anti-Trotskyism.\n\nSecondly, it indicates a fear and hatred that is usually unstated within the highest echelons of the Labour government of the threat posed by the socialist and internationalist programme of Trotskyism to themselves and the exploitative system they defend.\n\nThe slanders Straw makes against Trotsky were the stock references that Communist Party organisers used as they fought to prevent Trotskyists gaining a hearing in the student movement and trade unions in the 1960s. This was at the time when the CP was building up a body of trade union officials and student leaders who, while often nominally in the Labour Party, took their line from Ramelson. Arthur Scargill, who eventually became president of the National Union of Mineworkers, is perhaps the best known of these, but there were many others.\n\nAs aspiring careerists in the Labour and trade union bureaucracy, they knew that the best way to preserve their positions and the privileges that went with them was to use the virulent anti-Trotskyism of the CP to prevent the working class members of their organisations from developing an independent political consciousness. This was at a time when a broad-based radicalisation was taking place amongst workers and students alike, and when the Trotskyist Socialist Labour League was winning growing support—to the point where it had taken control of the Labour Party’s youth movement and had a substantial presence in many trade union branches.\n\nStraw came under Ramelson's influence when he was a leader of the National Union of Students in Leeds. He was clearly grateful to Ramelson for providing him with weapons to use against his Trotskyist opponents from the arsenal of Stalinist slanders.\n\nStraw’s foray into anti-Trotskyism is not a return to the haunts of his youth, but reflects fundamental lessons that he learned from Ramelson and that have stayed with him throughout his political life as a Labourite. There is an essential consistency in Straw’s life between his later political career as a Labour politician and his earlier relationship with Ramelson. And it says much about the fundamental character of Stalinism that Ramelson’s heir is someone like Straw.\n\nRamelson worked for the Communist Party in Yorkshire until 1966 when he became the national industrial organiser. He was number two in the Communist Party hierarchy and the public face of the organisation. Labour Prime Minister Harold Wilson named him as one of the “tight knit group of politically motivated men” who, he claimed, were behind the seamen’s strike of 1966. He retired in 1978 and died in 1994. His reputation as an industrial organiser rests on the wave of militancy that defeated the Wilson Labour government’s attempt to introduce legislation against the right to strike and to limit wage rises and defeated the Heath Tory government’s attempt to do the same.\n\nBut his real achievement was that he and the union leaders he trained managed to contain an upsurge in the class struggle that lasted from the middle of the 1960s to the mid-1970s to the level of industrial militancy and prevented it from taking a political form. In these years, Britain entered a profound political crisis, and the only ones kept in the dark about it were the workers themselves. Sections of the ruling elite were fully conscious of the extent of the crisis and, when the Heath government fell in 1974, considered declaring a state of emergency and overthrowing parliamentary rule. Ramelson and those he had trained were instrumental in returning a Labour government and averting an open political confrontation. Ultimately, therefore, Ramelson can claim a large measure of the credit for saving British capitalism in those years.\n\nLike many others of his generation, Ramelson joined the Communist Party because of the mass unemployment he saw around him, the rise of fascism and anti-Semitism, and the drive to war. But unlike others, he stayed loyal to the party long after it had degenerated and become a vast bureaucratic apparatus that saw revolutionary struggles as a threat to its position and privileges. Trotskyism was a threat to the Kremlin bureaucracy because it represented the continuation of the revolutionary Marxist perspective, and as a result they waged an unrelenting struggle to physically liquidate Trotskyists, to slander Trotsky, to manufacture lies about his record as a revolutionary and to prevent his ideas reaching the working class.\n\nRamelson’s commitment to this perspective was unwavering. When he visited the Soviet Union in 1956 after Krushchev’s speech had partially acknowledged some of Stalin’s crimes, he was reunited with his sister who had stayed in the Ukraine. He had sent her a telegram in 1945 to tell her that he was still alive and received a reply that appeared to come from her, saying that she was well and would write more fully later. When they met face to face, he discovered that she had spent the last 20 years in a Stalinist labour camp, where her husband had died. She had been arrested at the height of the Stalinist purges, one of the many thousands of workers and intellectuals who were imprisoned as the Stalinists tried to destroy the best elements in the younger generation who were increasingly responding to Trotsky’s perspective during the 1930s.\n\nRamelson’s loyalty to the Communist Party was not shaken even by this direct personal evidence of the nature of the bureaucratic regime in the Soviet Union. He had long since committed himself to the anti-Trotskyist perspective of the Kremlin bureaucracy. Some speculated whether he worked for Stalin’s secret police—the GPU. There is no evidence that he did. But what is clear is that he had the mentality of a secret policeman, who devoted himself to suppressing the socialist political development of the working class.\n\nThat was a task that met not only the needs of the Kremlin bureaucracy, but also those of the British ruling class. Which is why Straw never had to make a break with this essential aspect of his past, even after he had long abandoned the pretence of supporting the socialist transformation of society. And his past associations must be well known to the British state security services and have been no obstacle to his political career.\n\nThe Kremlin bureaucracy treated the Communist Parties outside the Soviet Union as tools of its foreign policy, rather than as potential leaders of revolutions. For Stalinists working in Britain, the Labour Party became central to their strategy during the Cold War period because it seemed to offer the best prospect of a government sympathetic to the Soviet Union. A generation of factory militants was trained in this perspective, so that instead of fighting for working people to overthrow capitalism and take power into their own hands, they restricted the class struggle to issues of wages. Ramelson had built up such a structure of bureaucrats in the trade union movement by the 1970s that he believed the Communist Party had only to “float an idea early in the year and it will be official Labour Party policy by the Autumn.” [Francis Beckett, The Enemy Within: The Rise and Fall of the British Communist Party, John Murray, London, 1995, p. 174]\n\nWhat remains of this work today? Straw is by no means the only member of Blair’s team that has a background in Stalinism and its periphery. John Reid, the health secretary, is a former member of the Communist Party, according to Derek Simpson, leader of the trade union Amicus, himself a former Communist. Kim Howells, MP for Neath in South Wales, is a former Communist Party member. He was responsible for helping end the 1984-1985 miners’ strike by organising a return to work in the South Wales coalfield that created a snowball effect in the rest of the country.\n\nPerhaps the most high-profile is Peter Mandelson, now a European Union commissioner, and one of the architects of New Labour, who was a member of the Young Communist League. Mandelson worked as an adviser to Neil Kinnock, John Smith, who succeeded him as leader, and Tony Blair.\n\nThe links between the formation of New Labour and the Communist Party are also expressed quite explicitly in the close relationship that developed between Kinnock and the group associated with Marxism Today, which included Martin Jacques, Stuart Hall, Eric Hobsbawm and Geoff Mulgan. Marxism Today began life as the theoretical organ of the Communist Party, and later became identified with the Euro-communist faction of the party. During the 1980s, it argued that “Thatcherism” could not be challenged unless the Labour Party accepted that class struggle had been superseded by consumerism and identity politics.\n\nThey argued that it was necessary to junk the old Keynesian perspective of minimal welfare state reforms and embrace the free market in an appeal to aspiring sections of the middle class. What became Blair’s Third Way can be traced to these ideas first developed in Marxism Today.\n\nStraw’s letters have unintentionally drawn attention to this vital contribution made by the Communist Party to the Labour Party and Labour governments in the post-war period. But this is a history that is not usually made available for public consumption, since it contradicts the official view that there was an unbridgeable divide between the two and that Trotskyism was an insignificant political tendency.\n\nWhy then does Straw break the silence? It is the case that political crises often emerge in political parties in unexpected ways, because of the strain they put on the individual psyche.\n\nStraw sits at the top table of a government now seeking its third term in office and apparently without a serious political opponent in sight. But he knows that he is pursuing a foreign policy that makes him hated by the majority of the population. Sensing a threat from below, he turns to the lessons he learned 40 years ago from Ramelson in order to attack Trotskyism—because he recognises that it was then and remains today the tendency that expresses the objective interests of the vast majority of the population. It shows that the lessons he learned went very deep indeed, precisely because they became an essential part of not just his own persona but the social being of an entire bureaucracy—animated as it is by visceral hatred for, and fear of, the prospect of a politically independent movement of the working class."}, {"url": "https://www.economist.com/europe/2001/06/14/jack-straw", "page_content": "TO BRITAIN'S progressives these past four years he has been Mr Nasty Guy: the home secretary—in plain European, minister of the interior—who loved to keep out asylum-seekers; who smothered dreams of a genuine freedom-of-information law and brought in a phoney one; who wanted to limit the right to trial by jury and was already pushing up prisons like mushrooms to hold the startling number of Britons who are sent there anyway. He was also the minister who handled the incorporation of the European Convention of Human Rights into British law. But he got little credit for that; it merely damned him in the eyes of conservatives who see the convention as a foreign plot to let crooks go free and give IRA gunmen compensation for not being arrested with kid gloves. And now, hey presto, Jack Straw has changed hats: out, a week ago, went the bug-eyed but Europhile Robin Cook, and in came Mr Straw to speak for Britain to the world. In particular, to the EU—a union for which, until now, he has expressed no visible enthusiasm whatever.\n\nSo what does Tony Blair's new foreign secretary bring to the council table? Could his appointment be a heavy hint to other EU countries that their recalcitrant British partners plan to be even more stroppy than before? No. Whatever Mr Blair's reasons for shifting Mr Cook—the latter's friends and enemies will offer you quite a menu—this was not one of them. In Britain's general election on June 7th, Mr Blair has just ground into the dust a Conservative Party whose slogan was “In Europe, not run by Europe”, and even that by the end of the campaign had begun to sound almost Europhiliac, set against the off-message hostility of many Tories, not least Margaret Thatcher. In contrast, the EU-ardent Liberal Democrats are riding high, whereas the United Kingdom Independence Party, although it has three members in the European Parliament, is not even visible in the dust. At this moment, Mr Blair no more needs to pander to Britain's Eurosceptics than to the Grand Cham of Tartary.\n\nMr Blair, however, was not born yesterday. He knows that moments pass, and that the British public, little as it loves the Tories, loves the EU's single currency even less. And he is sworn, at some unspecified date, to a referendum on that issue. There is also one force that he need not pander to, but cannot ignore: his finance minister (and rival) Gordon Brown, who will accept membership of the euro-zone when the Treasury's five economic tests for doing so are met, maybe, but not a day before. Who better to put in charge of Britain's European policy than a loyal ally, and one who cannot be accused of letting any private passion for the EU outweigh his duty to the public interest?\n\nNot that Mr Straw's career, on the face of it, reveals any passion for foreign affairs, in any direction. Twenty years ago, it is true, he was a stalwart of Labour's anti-European wing. Yet in the string of posts as spokesman on this and that which he held from soon after he entered Parliament in 1979 until he won high office in 1997, none looked out to the wide world. Here, however, is an adaptable man. Born in 1946, as a schoolboy he was a marcher against Britain's nuclear weapons, in the 1970s a councillor in a London borough widely known as “the Socialist Republic of Islington”. By the mid-1980s he was, accurately, denouncing his party's then anti-nuclear stance and its “loony-left” local councils as making it unelectable. As home secretary, he let Britain's police arrest Augusto Pinochet in 1998, but he was happy later, on grounds of health, to let the general go.\n\nAnd whatever his lack of passion, ignorant of the EU Mr Straw is not. When its interior ministers have met, there for four years he has been—“co-operative, innovative, constructive, better prepared than almost any other British minister,” says a British Euro-addict. A “formidable” member of the ministerial council, says an EU commissioner. For a senior politician, Mr Straw is unusually ready to listen. Few doubt that, having listened, he will be rapidly in command of his wider briefs— though it will take some doing to match Mr Cook's grasp of the Balkans—before deciding, firmly, what's best for Britain and (how could there be a difference?) for Labour and Jack Straw.\n\nDown-to-earth, up from Essex\n\nDo not mock: that happy coincidence of interests might be a real one. Britain's voters may be right or wrong about what is best for them, but they and Mr Straw think much alike. They do not want asylum-seekers in their country or liberalism in their interior ministry. They value the jury system, but they value a “guilty” verdict on the guilty more. The all-informed press that most of them want is the tabloids. Likewise, they do not want to be run from Brussels, but they are not mad keen on Whitehall either. And though they prefer the pound to the euro, few of them, witness the election, would go to the barricades to save it.\n\nNot by chance does Mr Straw share this down-to-earth outlook. He is that rarity in the first Blair government, a very English Englishman: son of a clerk and a teacher, pacifists both; council-estate childhood just outside London, the Essex side, the one where the nobs do not live; parental divorce; then the usual path upward for the unusual cut-above-working-class youth of the 1960s—state-aided independent school, red-brick (Leeds) university, student politics, the Bar, political aide in 1974 to flaming-red Barbara Castle at the mud-grey department of social services. Divorced and remarried himself by 32, Mr Straw knows how the real world lives. If there is a whiff of “old Labour” about him, it is that of practical social betterment, not the dream-world leftism that (as Islington must have taught him) seldom achieves it.\n\nOrganised betterment, that is: Mr Straw is a manager, a man of performing government. (“Freedom of information? That's for oppositions,” as one watcher quotes him.) How high he may hope, at 54, to manage himself, who knows? He keeps his cards close to his chest. Still, for what is visible, says this watcher, “with Jack Straw, what you see is what you get.”"}, {"url": "https://www.gov.uk/government/people/jack-straw", "page_content": "Rt Hon Jack Straw was appointed in July 2015 as a Member of the Independent Commission on Freedom of Information. He was Foreign Secretary 2001 to 2006, Home Secretary 1997 to 2001, and Leader of the Commons 2006 to 2007 under Prime Minister Tony Blair. He was Lord Chancellor and Justice Secretary 2007 to 2010 under Prime Minister Gordon Brown. He served from 1979 to 2015 as Member of Parliament for Blackburn.\n\nAfter having been called to the Bar and practiced there, he worked as a Special Advisor. In the Commons Jack was appointed to the Front Bench in 1980 and in 1987 he he became the Opposition spokesman on Education, then on the Environment, and from 1994 to 1997 he was Shadow Home Secretary.\n\nAs Home Secretary Jack oversaw the introduction of the Freedom of Information Act and the incorporation of the European Convention on Human Rights into British law. As Foreign Secretary he played a leading role in the foreign policy problems arising from the 9/11 terrorist attacks in New York and the resulting interventions in Afghanistan and Iraq. He was also closely involved with many major European decisions such as the negotiation of the EU Budget deal in 2005.\n\nHe is a Visiting Professor at the University College London School of Public Policy and Vice President of Blackburn Rovers Football Club. He is a Governor of Blackburn College, and from May 2015 has been Chairman of the Blackburn Youth Zone. He is co-Chairman of the government-sponsored British-Turkish Forum, and the Tatlidil conference that takes place annually between the UK and Turkey. He was given the Order of the Republic of Turkey by President Abdullah Gül in 2012."}, {"url": "https://simple.wikipedia.org/wiki/Jack_Straw", "page_content": "John Whitaker 'Jack' Straw (born 3 August 1946 in Buckhurst Hill, Essex, England) is a British politician. He held several Cabinet posts in the Labour government under Tony Blair and Gordon Brown.[1] He is the Member of Parliament (MP) for the constituency of Blackburn.\n\nJack Straw became a Labour Party MP at the 1979 General Election for the constituency of Blackburn. He was promoted to the shadow cabinet in 1987 and became the Home Secretary when Labour returned to power in 1997.[2] His other cabinet posts included: Foreign Secretary (2001-2006), Leader of the House of Commons (2006-2007) and Justice Secretary (2007-2010). He did not choose to become a member of Ed Miliband's shadow cabinet.\n\nPersonal life [ change | change source ]\n\nStraw's first marriage, in 1968, to teacher Anthea Weston ended in divorce in 1977. They had a daughter, Rachel, born on 24 February 1976.[3] She died after five days because of a heart defect.\n\nStraw is of Jewish descent (his maternal great-grandmother was from an Eastern-European Jewish family). He himself is Christian.[4][5]\n\nOn 10 November 1978 he married Alice Perkins, a senior civil servant.[6] They have two adult children, William and Charlotte.[7]\n\nHe supports his local football club Blackburn Rovers.[8] He was made an Honorary Vice President of Blackburn Rovers in 1998 by Jack Walker.[9]\n\nStraw has tinnitus.[10]"}], "Jack Straw was a former chair of the Labour Party.": [{"url": "https://www.britannica.com/biography/Jack-Straw", "page_content": "Jack Straw, in full John Whitaker Straw, (born August 3, 1946, Essex, England), British Labour Party politician who held numerous government posts, including home secretary (1997–2001), foreign minister (2001–06), leader of the House of Commons (2006–07), and lord chancellor and secretary of state for justice (2007–10).\n\nStraw studied law at the University of Leeds and then received training as a barrister in London at the Inns of Court School of Law (now The City Law School, part of City University London). He served (1971–74) on the Inner London Education Authority and was its chair in 1973, before working as a special adviser to Labour Party cabinet ministers Barbara Castle (1974–76) and Peter Shore (1976–77). After a brief stint as a television researcher, Straw entered Parliament in 1979 as MP for Castle’s former seat of Blackburn, Lancashire. He rose steadily through Labour’s ranks and was elected to the party’s opposition shadow cabinet in 1987. During the party’s internal ideological conflict in the 1980s, he moved from being a traditional left-winger to becoming a more centrist modernizer. He was the first leading member of the Labour Party to propose that it repeal its socialist commitment—Clause IV of the party’s constitution—to the state control of industry. In 1994 Straw managed Tony Blair’s successful campaign to be elected party leader, and one of Blair’s first acts on becoming leader was to win the party’s agreement to rewrite Clause IV.\n\nFollowing Labour’s election victory in 1997, Straw was appointed home secretary. He quickly established his progressive credentials by setting up an inquiry into charges of racism in the London police force, promoting the incorporation of the European Convention on Human Rights into British law, and refusing to allow the former Chilean head of state, Augusto Pinochet, to return home following Pinochet’s October 1998 arrest in London. (The arrest followed a request by the Spanish government that Pinochet be extradited to Spain to face charges of murder. He was allowed to return to Chile in March 2000 when a panel of doctors advised that he was unfit to face trial.) Straw upset many progressives, however, by initiating legislation to withdraw the right of some defendants to be tried by a jury, introducing stricter requirements for people seeking political asylum in Great Britain, diluting Labour’s pre-1997 election promise to establish a freedom of information law, and resisting calls to decriminalize the consumption of so-called “soft” drugs, such as marijuana.\n\nIn a 2001 cabinet reshuffle, Straw received the foreign and Commonwealth affairs portfolio. As foreign minister, Straw supported the invasion of Iraq as well as the expansion of the European Union (EU). Despite the latter position, however, Straw was a known skeptic of the euro, the EU’s single currency. Shortly after Labour’s poor showing in the May 2006 local elections, Blair overhauled his cabinet, and Straw was removed as foreign minister and made leader of the House of Commons. Later that year he caused controversy when he stated that Muslim women should not wear full veils. After Gordon Brown became prime minister in 2007, Straw was named justice secretary and lord chancellor, thereby becoming the first member of the House of Commons to take up the latter post. The following year he outlined potential reforms to the House of Lords, which included the election of a certain percentage of members and a reduction in the number of lords. In 2009 he sparked debate after stating that oil deals with Libya had played a “very big part” in the decision to release Abdelbaset Ali Mohmed al-Megrahi—a Libyan convicted of bombing Pan Am flight 103 in 1988—from a Scottish prison. In the general election of 2010 Straw easily retained his Blackburn constituency but lost his cabinet position when Labour was ousted from office. In February 2015 Straw temporarily resigned from the Labour Party after allegations surfaced of his involvement in an influence-peddling scandal that resulted from a sting investigation conducted by Channel Four and The Daily Telegraph. Having already announced in 2013 that he would not stand for reelection, Straw retired from the House of Commons in 2015."}, {"url": "https://apnews.com/article/37c796bc4f9f4a48b4f5b15687888cfb", "page_content": "LONDON (AP) — Jack Straw, a former British foreign secretary and an elder statesman of the opposition Labour Party, said Friday that he will not seek re-election to Parliament.\n\nStraw, 67, has been a legislator in Britain’s House of Commons for 34 years and also served as home secretary and justice secretary. But he is probably best known for his role as foreign secretary between 2001 and 2006 in the Labour government of Prime Minister Tony Blair and for backing the leader’s decision to go to war in Iraq.\n\nBritain’s next general election is expected to take place in May 2015, beyond which Straw said he would not serve as a member of parliament.\n\nStraw said that while it would be a “terrible wrench” to leave the House of Commons, he doesn’t want to “push his luck” by being a lawmaker in his 70s.\n\nHe told constituents in the northwestern town of Blackburn that he decided to stand down after a great deal of thought and consultation.\n\n“Labour is part of my soul, and so is this town,” he told constituents, insisting that his “love affair” with Blackburn will not end after the next general election.\n\nLabour leader Ed Miliband said Straw will be “sorely missed” in the Commons, praising his service as foreign secretary in the aftermath of the Sept. 11, 2011, terrorist attacks in the United States, and his loyalty and support to the party.\n\nStraw worked briefly in journalism and law before taking a seat in Parliament in 1979. He occupied a variety of shadow Cabinet roles and was appointed home secretary in 1997, pushing Blair’s “tough on crime” approach.\n\nAfter becoming foreign secretary in 2001, Straw staunchly backed Blair’s decision join the U.S.-led invasion of Iraq, a decision that was unpopular with many Britons.\n\nStraw later said it was one of the most difficult choices he had ever faced and that he recognized the invasion had made many people “very angry.” His role in that chapter of British history has made him a frequent target of anti-war activists.\n\nStraw also has been dogged by persistent questions over his role in the CIA’s so-called extraordinary renditions programs and faced legal action over what role he may have played in authorizing the rendition of a Libyan military commander.\n\n___\n\nFollow Cassandra Vinograd at http://twitter.com/CassVinograd"}, {"url": "https://www.dailyrecord.co.uk/news/politics/tony-blairs-first-1997-labour-24642594", "page_content": "We have more newsletters\n\nSomething went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest Scottish politics news sent straight to your inbox with our daily newsletter\n\nTony Blair's emphatic election victory in 1997 heralded in a new era in British politics and many new faces as well.\n\nThe Labour leader defeated Tory Prime Minister John Major by winning 418 seats in the House of Commons after securing 145 more MPs than in the 1992 General Election.\n\nMany of the 24 members were not known outside the so-called 'Westminster bubble', however some soon became household names across the United Kingdom.\n\nBlair was the youngest Prime Minister in the twentieth century and the youngest since Lord Liverpool in 1812.\n\nHe promised to breathe new life into politics and attempt to restore trust at the same time.\n\n(Image: AFP via Getty Images)\n\nSo, what has happened to the people who sat in Blair's first cabinet in 1997:\n\nTony Blair - Prime Minister\n\nNo better place to start than the man in charge of the Cabinet.\n\nTony Blair stepped down as Prime Minister in 2007 which allowed Gordon Brown to take over in the lead up to the general election in 2010.\n\nAfter leaving office Blair was confirmed as the Middle East envoy for the UN, EU, US and Russia. He remained in that post until 2015.\n\nA year later he created the Tony Blair Institute which aims to promote global outlooks by governments and organisations.\n\n(Image: AFP via Getty Images)\n\nBlair has appeared a number of times during the covid pandemic to speak about getting as many people across the world vaccinated.\n\nHe also criticised Boris Johnson over his decision to cut international bid by 0.2 per cent from 0.7 to 0.5 per cent.\n\nJohn Prescott - Deputy Prime Minister/Environment, Transport and Regions secretary\n\nJohn Prescott served as the MP for Kingston upon Hull East from 1970 to 2010 when he retired from the House of Commons.\n\nAfter leaving the Commons he entered the House of Lords as a life peer.\n\nThe Welsh-born politician now goes by the name of Baron Prescott of Kingston-upon-Hull.\n\n(Image: Getty Images)\n\nIn 2012 he failed to be elected the Police and Crime Commissioner for Humberside Police, he lost out to a Tory.\n\nAfter a stint as adviser to Ed Miliband in 2015 he headed back to the Lords.\n\nGordon Brown - Chancellor\n\nGordon Brown succeed Tony Blair as Prime Minister in 2007 and remained in post until 2010 when the Tories, under David Cameron, won the most seats.\n\nThe Scot remained in parliament until he stepped down in 2015, however he played a prominent role in the Scottish Independence referendum in 2014.\n\n(Image: PA)\n\nIn 2019, Brown set up the campaign group 'Our Scottish Future' which aims to keep the Union together.\n\nHe recently published the book 'Seven Ways to Change the World'. Brown also appeared on stage to back Scottish Labour leader Anas Sarwar during the election earlier this year.\n\nClare Short - International Development Secretary\n\nLike John Prescott, Clare Short stepped down from the Commons in 2010.\n\nShe served as the MP for Birmingham Ladywood from 1983.\n\nThe 75-year-old was criticised in 2019 when she dismissed allegations the Labour party has a problem with 'Jew-hate'.\n\nSince then she has written a number of articles about the Labour party.\n\nMo Mowlam - Northern Ireland Secretary\n\nThe Watford-born MP held a couple of roles in Tony Blair's cabinet over the years.\n\nShe was the Northern Ireland secretary when the historic Good Friday Agreement was signed back in 1998.\n\nMowlam retired from politics in 2001 after announcing her decision a year earlier.\n\n(Image: PA)\n\nSadly she passed away on August 19, 2005 after she was moved from to Pilgrims Hospice in Kent a week earlier.\n\nIt was announced in 2010 a brain tumour she was first diagnosed with in 1997 was the cause of her death.\n\nChris Smith - Culture Secretary\n\nBritain's first openly gay Cabinet minister had a troubled time as Culture Secretary due to a lack of money. He eventually left the Cabinet in 2001.\n\nIn 2005, he announced that he would be stepping down at the general election. He also revealed in the same year that he was HIV positive.\n\nSince leaving the Commons he has become a life peer in the House of Lords.\n\nLord Smith of Finsbury now campaigns for LGBTQ+ rights in the UK and across the world.\n\nFrank Dobson - Health Secretary\n\nDobson was the Health Secretary for the first two years of Tony Blair's time in government.\n\nIn 2000, he was Labour's candidate to be London Mayor however he finished behind the Tory candidate and winner Ken Livingstone who was an independent politician at the time.\n\nDobson stepped down from the Commons at the 2015 General Election.\n\n(Image: PA)\n\nHe sadly passed away in 2019 at the age of 79. Tributes were paid to the former health secretary from across the political divide.\n\nCurrent Mayor Sadiq Khan said he was a \"hero of the London Labour movement\".\n\nAnn Taylor - Commons Leader\n\nAnn Taylor was the member of parliament for Dewsbury from 1987 to 2005 when she decided to step down from parliament.\n\nDuring Labour's time in office from 1997 to 2010 she held a number of ministerial roles, including being the Minister of State for International Defence and Security.\n\nIn 2005 she was given a life peerage and now goes by the name of Baroness Taylor of Bolton.\n\nHarriet Harman - Social Security Secretary\n\nThe 70-year-old held a number of roles in government throughout the time Labour under Blair and then Brown were in office.\n\nA high profile name in the Labour movement Harman is still an MP to this day.\n\n(Image: Handout)\n\nShe has represented the Camberwell and Peckham constituency since 1982.\n\nRon Davies - Wales Secretary\n\nRon Davies served as Welsh secretary in Tony Blair's government for over a year. He was in post from May 2, 1997 to October 27, 1998.\n\nHe was elected into the Welsh Assembly in May 1999 and two years later stepped away from the UK parliament in 2001.\n\nHis relationship with the Labour Party came to an end in 2004 when he resigned over his opposition to the Iraq War.\n\n(Image: Mirrorpix)\n\nSince leaving Labour Davies has stood for election for nationalist party Plaid Cymru, however he has been failed to be elected.\n\nLord Ivor Richard - Leader of Lords\n\nLord Richard had a long and distinguished career in politics before his death in March 2018 at the age of 85.\n\nDuring his time in Tony Blair's Cabinet he failed in his attempts to introduce election for part membership of the Lords.\n\nAfter failing to persuade Blair he was sacked after just 14 months in post.\n\nFollowing his sacking he was invited to chair a commission on the future powers of the Welsh Assembly.\n\nThe report was published in March 2004.\n\nGavin Strang - Transport Secretary\n\nThe Scottish politician was a member of the House of Commons from 1970 to 2010 when he retired.\n\nBy the time of his retirement from politics he was the longest serving Scottish MP.\n\nDuring his career he served as a minister in Harold Wilson and James Callaghan's governments.\n\n(Image: Twitter)\n\nHis last appearance in public was in 2018 when he was snapped with then Scottish Labour leader Richard Leonard.\n\nSir Robin Butler - Cabinet Secretary\n\nSir Robin Butler had a long career in the civil service.\n\nDuring his time at the heart of Westminster he was the Private Secretary to Edward Heath and Harold Wilson.\n\nHe was the Principal Private Secretary to Margaret Thatcher.\n\n(Image: UGC)\n\nHe was also the Cabinet Secretary to Thatcher and John Major.\n\nFollowing his retirement he took up a post as a cross-bench peer in the House of Lords.\n\nMargaret Beckett - Trade and Industry Secretary\n\nAfter her role in the Trade and Industry department in Tony Blair's government she was promoted to be the Foreign Secretary in 2006. She was the first woman to hold the role.\n\nWhen Gordon Brown replaced Blair she told him she wouldn't carry on in the Foreign Secretary role. She was replaced by David Milliband.\n\n(Image: Derby Telegraph)\n\nIn 2015 she nominated Jeremy Corbyn during the Labour leadership election.\n\nThe 78-year-old is still the member of parliament for Derby South.\n\nJack Straw - Home Secretary\n\nStraw remained as the Home Secretary in Blair's government till 2001 when he was moved to the Foreign Office.\n\nHe replaced Robin Cook in 2001 just months before the terrorist attacks on September 11.\n\nThe 74-year-old remained as Foreign Secretary till 2006. During the Iraq Inquiry he said the invasion by British troops \"haunted him\".\n\n(Image: Corbis via Getty Images)\n\nHe stepped down from frontline politics in 2010 following the election that year.\n\nIn 2015, he was given the Freedom of the Borough of his hometown Blackburn with Darwen.\n\nRobin Cook - Foreign Secretary\n\nThe Belshill born MP served as Foreign Secretary from 1997 to 2001. After the 2001 General Election he was moved department and took up the role of the Leader of the House of Commons.\n\nHe served in the role for two years when he famously quit government over his opposition to the British and American invasion of Saddam Hussein's Iraq.\n\nIn his statement, he said: \"I can't accept collective responsibility for the decision to commit Britain now to military action in Iraq without international agreement or domestic support.\"\n\n(Image: Press Association)\n\nCook held his Livingston seat in the 2005 General Election, however he died just months later of a heart disease.\n\nDavid Blunkett - Education Secretary\n\nDuring Labour's time in government from 1997 to 2010 Blunkett held a number of ministerial roles including Work and Pensions Secretary.\n\nHe decided to step down from the House of Commons in 2015, by then he had been the MP for Sheffield Brightside and Hillsborough for 28 years.\n\nThe 74-year-old now sits in the House of Lords.\n\nHe still appears on political shows to speak out against the Tory government.\n\nJack Cunningham - Agriculture Minister\n\nJack Cunningham was a Labour member of parliament for more than 30 years.\n\nHe represented the Whitehaven seat from 1970 to 1983, then from 1983 to 2005 he served the people of Copeland.\n\nCunningham was moved from the Agriculture brief in 1998. He took up the Duchy of Lancaster role on July 27, 1998 till October 1999.\n\nSign up to our Politics newsletter Get all the top Scottish politics news sent straight to your Inbox by signing up to our Politics newsletter. We cover Holyrood, Westminster and local councils, with a current focus on how our governments are handling the coronavirus pandemic. To sign up, simply enter your email address into the pink box near the top of this article. Alternatively, you can visit our newsletter sign up-centre. Once you are there, enter your email address and select Politics and any other Daily Record newsletters that are of interest.\n\nThe 81-year-old stepped down from the Commons in 2005, however took up a seat in the Lords the same year.\n\nIn 2017-18 he claimed over £75k for 154 days of attendance in the Lords.\n\nIt was the largest claim for attendance and travel expenses of any sitting member.\n\nGeorge Robertson - Defence Secretary\n\nThe Scot, born in Port Ellen, served as the MP for Hamilton from 1978 to 1997, then for Hamilton South from 1997 to 1999.\n\nIn 1999, he was appointed as the 10th Secretary General of Nato. He succeeded Javier Solana.\n\nRobertson was given a life peerage, he is now know as Baron Robertson of Port Ellen.\n\nHe made a number of interventions during the Scottish Independence referendum in 2014.\n\nDuring the campaign he wrote for the Washington post saying: \"The residual United Kingdom would still be a major player in the world, but upon losing a third of its land mass, 5 million of its population and a huge amount of credibility, its global standing would inevitably diminish.\"\n\nLord Irvine of Lairg - Lord High Chancellor\n\nInverness born Andrew Irvine held the role of Lord High Chancellor for six years in Tony Blair's government from 1997 to 2003.\n\nHe was replaced by Lord Falconer.\n\n(Image: PA)\n\nThe Lord was appointed to the Sub-Committee on Lords' Conduct where he remains today.\n\nNick Brown - Chief Whip\n\nBrown has been the member of parliament for Newcastle-upon-Tyne East since 1983. He is currently the fifth longest serving MP in the House of Commons.\n\nUnder Tony Blair he served as his chief whip from 1997 to 1998. When Gordon Brown took office he made Brown the Minister for the North East from 2007 to 2010.\n\n(Image: newcastle chronicle)\n\nFollowing the 2010 General Election he was made the opposition chief whip. He remained in position till May this year when Keir Starmer replaced him.\n\nHe was replaced by Sir Alan Campbell.\n\nAlistair Darling - Chief Treasury Secretary\n\nAlistair Darling held a number of roles while Labour were in power from 1997 to 2010, including Secretary of State for Scotland from 2003 to 2006.\n\nHe was appointed the Chancellor in May 2010 and held the role for a number of months until October 2010.\n\n(Image: Daily Record)\n\nDarling played a huge role during the Scottish Independence referendum when he led the Better Together group in 2014.\n\nHe decided to step down from parliament in 2015. The SNP's Joanna Cherry replaced Darling in Edinburgh South West.\n\nDavid Clark - Duchy of Lancaster\n\nClark who was born in Castle Douglas in Scotland served as the Duchy of Lancaster for a year until 1998.\n\nIn 2001 he was replaced as the Labour candidate for the South Shields constituency by David Miliband who went on to become the Foreign Secretary.\n\nFollowing the election he was made a life peer.\n\nLord Clark of Windermere is a director of Carlisle United football club and Professor in History and Politics at the University of Huddersfield."}, {"url": "https://www.economist.com/britain/1998/12/03/jack-straw-and-general-pinochet", "page_content": "WANTED—but also very much unwanted. The people of Chile put up with General Augusto Pinochet for 17 years—and even after he stepped down as head of state he arranged for himself to stay on, above the law, as senator for life. The managers of Grovelands Priory, a psychiatric hospital in north London, were able to put him up for less than a month before concluding that the former dictator was a fussy and difficult patient they would sooner be rid of. Now the general has had to move to a luxury house in Surrey, where he will stay, at the expense of the Chilean taxpayer, until Britain decides what to do with him.\n\nIt says something about grown-up politics that the man who must now make that decision may be no keener than Grovelands Priory was to have the general on his plate. In the early 1970s, Jack Straw was president of the National Union of Students. It would not have been outlandish for him to fantasise at that time of going on to become home secretary. But it would surely have exceeded his wildest imaginings to think that a happy sequence of accidents would one day make him master of General Pinochet's fate. Blood-drenched Latin caudillo delivered to the Bow Street magistrates: it would be hard to devise more perfect wish-fulfilment for a left-wing student of Mr Straw's generation.\n\nBe careful what you wish for. The present Labour government is awash with ministers who, like Mr Straw, started their careers in the leftist student politics of the 1970s. As chairman of Edinburgh University's Labour Club, Gordon Brown worked hard for the Chile Solidarity Campaign after the murder in 1973 of the country's elected president, Salvador Allende. Peter Mandelson learnt his spin doctoring on a junket to Cuba a few years later. For Labour MPs now in their early 40s, who were just too young to campaign against the Vietnam war, the horrors of Chile's dictatorship were the next worst thing.\n\nHaving greeted Allende's election as a sign that “true” socialism could be introduced by peaceful means, these people came to hate the general who crushed their hopes. The Labour government elected in Britain five months later let in many Chilean refugees. They and their cause established a strong presence in the London left throughout the 1970s. Every September there would be a march to Trafalgar Square to hear poignant speeches from Allende's widow, and rousing ones from Labour heroes like Michael Foot. Labour people in Britain found it easier to identify with Chile's left, which had been based, like Britain's, on trade unions and miners, than with other Latin Americans. The later and worse dictatorship in Argentina attracted far less attention than the Pinochet regime.\n\nGratifying, then, for a Labour home secretary to find himself, entirely by chance, with the general in his power? Perhaps not. Spain's extradition request was an unwelcome surprise. And Labour's passion on Chile puts Mr Straw in a trap of his own. Now that the Law Lords have said the general enjoys no immunity as a former head of state, Mr Straw must decide by December 11th whether to let the Bow Street magistrates allow the extradition. It may be assumed that all his old instincts—like the Labour backbenchers on Parliament's human-rights group—are telling him to do so. But Mr Straw is a grown-up politician these days. He must think about timing, consequences, relations with foreign powers, his next career move. He knows that it could take months and even years before the courts work through the general's inevitable appeals. Already 83, the former dictator could die while trapped in Britain in a legal limbo. Relations with Chile, perhaps Chilean democracy itself (see article), are said to be at risk. Chile's foreign minister suggests, pretty implausibly, that the general will now be tried at home, if only Britain were to let him return. Even the Americans hint that Mr Straw should let the general go. But if he does—especially on “compassionate” grounds—there will be hell to pay in the party. What is a fellow to do?\n\nThe only intelligent thing: take refuge in the law. Soon after General Pinochet's arrest, Mr Mandelson blurted out that it would be “gut-wrenching” to set him free. Since then, however, the government has calmed its gastric juices. Even the rumblings of the Commons have been muted by a ruling that the issue is sub judice. From the start, Mr Straw has had the wit to pull his neck like a turtle into the non-political, quasi-judicial role into which home secretaries are sometimes obliged, and often grateful, to retreat. He is taking representations, but also taking care to put it about that he will not even consult the cabinet or prime minister. Mixing politics with Pinochet? Perish the thought.\n\nSome Labour firebrands are mortified by this studied show of legalism. But the dispassionate application of law happens, in this case, to be the right policy as well as the shrewd one. The alternative—to treat the serious business of human rights as partisan party politics—would be much worse. This, regrettably, has so far been the approach of the Tories.\n\nOnce Margaret Thatcher had written to the Times declaring that the general had been Britain's friend in the Falklands, and should be allowed home at once, it may have been inevitable that William Hague, still in thrall to his mentor, would meekly parrot her line. Unfortunately, there has been nothing meek about it. Mr Hague seems genuinely to think he can score party points by portraying it all as a Labour foreign-policy fiasco. “It has gone on long enough,” he intones in bluff Yorkshire, as if Mr Straw could at a stroke ignore the Law Lords, and all due process, and all the general's crimes. The arrest of General Pinochet seems set to become a landmark in the history of human rights. Neither of Britain's parties deserves much credit for it."}, {"url": "https://www.ncr-iran.org/en/news/iran-a-world/jack-straw-iran-regime-lobby-suspended-from-labour-party/", "page_content": "Facebook Twitter LinkedIn Pinterest Reddit Email Print\n\nJack Straw, Britain’s former Foreign Secretary, with long history of working with the Iranian regime who was involved in negotiating a deal in the run-up to 2003 Iraq war for bombing Iranian opposition members in that country that killed dozens of PMOI (MEK) members, has been suspended from Labour Party in a ‘cash for access’ scandal.\n\nJack Straw accused of being a ‘politician for hire’ was one of the members of the British Parliament that was secretly filmed by the Daily Telegraph in a joint investigation with Channel 4’s Dispatches programme apparently offering to use their influence in return for money.\n\nUndercover reporters claiming to represent a Hong Kong-based communications agency contacted two MPs including Jack Straw to say they were seeking to hire senior British politicians to join the company’s advisory board.\n\nAt one meeting, Straw is alleged to have described how he operated “under the radar” to use his influence to change EU rules for a commodity company which paid him £60,000 a year.\n\nJack Straw has a long history of working with the Iranian regime.\n\nAccording to the Wall Street Journal, in run-up 2003 Iraq war, Jack Straw and the Britain’s Ambassador to Tehran, Richard Dalton, negotiated a deal with Iran, in which coalition forces would bomb Iranian dissidents living in Iraq in return for a promise by Tehran not to interfere with the U.S.-British invasion of Iraq.\n\nOn the part of Iranian regime Hassan Rouhani, the current president and then head of Supreme National Security Council, and Kamal Kharrazi, then Foreign Minister were involved.\n\n“The coalition’s bombing of non-combatant Iranian dissidents killed fifty people,” and the regime did not keep the promise, according to Gatestone Institute.\n\n“Most recently, in September 2014, Straw wrote an article for the Daily Telegraph in which he praised the Rouhani government; advocated that Iran should be allowed to continue its research of nuclear technology, and encouraged the West to work with Iran to achieve ‘stability in Syria, northern Iraq and the Lebanon’ — a remarkable statement, given that Iran is the source of the instability.”\n\nJack straw’s lobbing on the part of the Iranian regime has continued since then.\n\nFollowing a trip to Iran paid by the regime in 2014 Jack Straw told Radio 4’s Today programme how he and four other MPs had been visiting Tehran to see for themselves what grounds for hope were now being opened up by the new Iranian regime under President Hassan Rouhani.\n\nChristopher Booker, prominent British commentator, wrote in article on January 14: “Straw admitted that of course he hadn’t spoken to any “dissidents”, who might have told him about the 600 Iranians hanged this year, two-thirds of them since the “moderate reformer” Mr Rouhani took office.”\n\n“It was Jack Straw who admitted, when he was home secretary in 2001, that it was “at the behest” of Tehran that he had proscribed the People’s Mujahideen of Iran (PMOI), part of the main Iranian dissident movement, as “terrorists” – a ruling the government only reluctantly withdrew on the orders of Chief Justice Phillips, when he ruled that it had not been able to produce a shred of evidence to support Mr Straw’s actions.”"}, {"url": "https://www.lbc.co.uk/radio/presenters/shelagh-fogarty/former-home-secretary-jack-straw-hits-out-at-cult/", "page_content": "Former Home Secretary Jack Straw hits out at \"cult\" takeover of Labour\n\nA former Labour Home Secretary has hit out at the \"cult\" which surrounds the party's leadership and says supporter Len McCluskey, the powerful trade union leader, should explain his responsibility in this \"catastrophe.\"\n\nJack Straw told LBC he was concerned how members of the Labour Party were defending the unpopular leadership of Jeremy Corbyn and John McDonnell.\n\nThe Labour veteran criticised campaign group Momentum and the Unite union boss Len McCluskey for their support of Mr Corbyn.\n\n\"The problem is that the party has been taken over, to use Alan Johnson's phrase, by a cult of Jeremy Corbyn and McDonnell.\n\n\"Behind all this the figure Len McClusky, the leader of Britain's most powerful trade union. Len Cluskey is normally the first out of traps to appear on the media - you kept hearing him - but I understand from your colleagues in other media organisations that nobody can get hold of him.\n\n\"Where's he gone? Why is he not out explaining his responsibility this catastrophe that has befallen the party?\"\n\nJack Straw asked of McCluskey: \"Why is he not out explaining his responsibility this catastrophe that has befallen the party?\". Picture: PA\n\nUnite are the largest donors to the Labour Party and hold significant influence within the organisation - having a say in the party's policy process.\n\nThe union added £3million to Labour's funds ahead of the general election and many of its members assisted the party during the campaign - many of them supporters of the leader Jeremy Corbyn.\n\nCommenting on the future of the Labour Party, Mr Straw claimed it \"could be 20 years\" before the party is elected into government.\n\nHe said: \"Were we to get a really good leadership - one that was inclusive, where the culture was changed so you ended this abuse, this intolerance, this vile antisemitism that has infected part of the party and got back to tolerant, decent values which informed the party in the past.\n\n\"And with a leader who understood the importance of connecting with the British people - whether it's in the South or the North - that's what Tony Blair was able to do.\""}, {"url": "https://www.theguardian.com/politics/2010/mar/23/ex-ministers-suspended-lobbying-allegations", "page_content": "Labour ex-ministers Geoff Hoon and Stephen Byers declare an interest in taking money from a fictitious lobbying firm to influence legislation Channel 4 Dispatches\n\nThree former cabinet ministers, Geoff Hoon, Stephen Byers and Patricia Hewitt, were suspended from the Parliamentary Labour party last night in an unprecedented crackdown on sleaze.\n\nThe move was implemented by the party's chief whip, Nick Brown, and fuelled by backbench revulsion at claims that the trio had been using their ministerial experience to seek profitable lobbying consultancies.\n\nThe decision was taken by No 10 after party officials watched a Channel 4 programme that secretly recorded the former ministers expressing a desire to work for a consultancy firm at a fee of up to £5,000 a day. Byers, the former transport secretary, described himself as a \"cab for hire\".\n\nLater, a Labour spokesman said that Margaret Moran, the MP for Luton South, had also been suspended after featuring in the Dispatches programme.\n\nIt is extremely rare for three senior figures to be suspended, especially as it is not clear that any of the former ministers have broken parliamentary rules on lobbying, but in the current pre-election climate there is anger that they have damaged Labour's election chances by allegedly trading on their political influence for profit.\n\nToday, Jack Straw, the justice secretary, said the MPs had been suspended under a Labour standing order against bringing the party into disrepute.\n\n\"It's my view certainly, having seen what I have seen, that their behaviour, prima facie, does indeed bring the parliamentary Labour party, as well as parliament, into disrepute, because it appears that former cabinet ministers are more interested in making money than they are in properly representing their constituents,\" he told BBC Radio 4's Today programme.\n\n\"That's why there is such anger in the parliamentary Labour party, as well as I may say incredulity, about their stupidity in allowing themselves to be suckered in a sting like this.\"\n\nStraw said an investigation into any potential impropriety by ministers or officials – as called for by the Tories – had been carried out.\n\n\"There is not a shred of evidence – not a single scintilla of evidence – of any impropriety whatsoever; that's why it's been swift,\" he said.\n\nHe also insisted the MPs' treatment had nothing to do with their reputations for being staunch Blairites. Hoon and Hewitt led a failed coup against Gordon Brown earlier this year.\n\nStraw said: \"None of the action is anything to do with 'they are Blairites'. I may tell you, I was around the House of Commons last night. The anger, as well as the incredulity, from former close allies of Tony Blair about the alleged behaviour of these three former colleagues is as strong if not stronger than that of people who were in the past on a different wing of the party.\n\n\"I was talking last night to a close friend of mine, who was and is extremely close to Mr Blair, and I can tell you their anger is incendiary.\"\n\nLord Mandelson, the business secretary, said: \"What is so ghastly about this is that somebody like Stephen Byers feels it necessary to make completely untrue, unfounded boasts to these people in order to get himself future business,\" he told BBC2's Newsnight last night.\n\n\"It is extremely disappointing and it is very sad and rather grubby.\"\n\nThe dramatic disciplinary action to suspend the MPs was taken by the chief whip and the party's general secretary, Ray Collins.\n\nThe measures were partly brought forward by Labour whips after a scheduled weekly meeting of Labour MPs revealed the huge depth of feeling against the former ministers' behaviour, and the belief that they will have damaged Labour's chances of clawing itself back into the election race. In the Commons yesterday all the former ministers were rounded on by a succession of Labour MPs claiming the moment marked the death knell of New Labour.\n\nAll three are standing down at the next election and were looking for work after the election, but No 10 owes no loyalty to them since they have, at various times, all called for Gordon Brown to stand down as prime minister.\n\nThe leader of the Commons, Harriet Harman, said ministers would respond by making lobbying companies subject to a statutory code. She also suggested that the government would tighten the rules on former ministers seeking jobs in the private sector.\n\nThe three former ministers were being suspended pending an inquiry by the parliamentary standards commissioner into whether they had broken parliamentary rules on paid advocacy. Byers referred himself yesterday to standards commissioner insisting he had broken no parliamentary rule.\n\nThe trio claim they have not been allowed access to the full transcripts of the secretly recorded conversations they separately held with the journalists posing as a new US lobbying company.\n\nThey privately acknowledge they were foolish in taking the bait, but argue they have broken no rules since they were offered no jobs, and therefore have no commercial interests to declare in the MPs' register.\n\nSimilarly there was no requirement for them to seek the permission of the advisory committee on ministerial appointments, the body responsible for sanctioning former ministers and civil servants taking jobs in the private sector.\n\nBut Labour officials believe the impression conveyed that former ministers were trying to profit from their knowledge as former public servants will anger voters already alienated by the expenses scandal.\n\nEarlier both Mandelson and Lord Adonis, the transport secretary, denied the suggestions made by Byers in the Channel 4 programme that he had persuaded them to change key ministerial decisions. Byers claimed he had persuaded Adonis to go easy on National Express after it prematurely forfeited its East Coast mainline franchise. Adonis said he had discussed the issue with Byers, but said the claim he had gone easy on National Express was fantasy.\n\nHe told peers: \"I have no idea why Stephen Byers said what he did to this undercover reporter, but I notice he has withdrawn his claims.\"\n\nByers has said he made up his claims.\n\nIn a letter to shadow Cabinet Office minister Francis Maude, Sir Gus O'Donnell, the cabinet secretary, said that he and the prime minister had taken steps to ensure the claims that serving ministers and officials had been lobbied were \"immediately investigated\".\n\n\"Permanent secretaries in the relevant departments have looked into these issues as a matter of urgency, as they would with any such serious allegations,\" he said.\n\n\"The permanent secretaries have assured themselves and advised the prime minister and me that there was no impropriety by current ministers or officials.\"\n\nFollowing the reports, Hoon said he had made clear during an \"informal chat\" with what he assumed was \"a reputable American company\" that he would not lobby government or \"attempt to sell confidential or privileged information arising from my time in government\". He said he had not broken any rules.\n\nHewitt, the former health secretary, said she \"completely rejected\" the suggestion she helped obtain a key seat on a government advisory group for a client paying her £3,000 a day. She said the role she had been discussing would only have been taken up after she stepped down as an MP.\n\nThe Tory MP John Butterfill, who was also filmed by the Dispatches team, was said by Conservative party sources to have referred himself to the standards commissioner last night. Mandelson said \"What is so ghastly about this is that he [Byers] feels it is necessary to make these claims. It is extremely disappointing very sad and rather grubby."}, {"url": "https://labourlist.org/2015/02/jack-straw-suspended-from-parliamentary-labour-party-over-cash-for-access-scandal/", "page_content": "Jack Straw – the former Foreign Secretary and Labour’s longest serving Cabinet Minister – has been suspended from the Parliamentary Labour Party over a new ‘cash for access’ scandal. Straw was filmed by the Telegraph and Channel 4’s Dispatches talking to a fictitious Chinese firm about future work he might do with them. Speaking of his previous work in Ukraine with a commodities firm, he said that he worked “under the radar” and used “charm and menace” to influence the then Ukranian PM. He was also recorded saying “So normally, if I’m doing a speech or something, it’s £5,000 a day, that’s what I charge”, when asked what his daily rate might be for such work.\n\nStraw said last night that he was “mortified” that he had fallen into the trap set by reporters, but denied doing anything “improper”:\n\n“Since I ceased to be a minister in 2010, I have taken on a number of outside activities, including writing, speaking engagements, and one consultancy – with the long-established commodity suppliers, ED&F Man (Holdings) Ltd,” he said.\n\n“All of this has been undertaken fully in accordance with the MPs’ Code of Conduct.”\n\n“The bogus company were told at the outset that any discussions with them were about what I might do once I left the Commons, not whilst I was still a serving MP.”\n\nA Labour spokesman confirmed that Straw has referred himself to the Parliamentary Standards Commissioner, and would be suspended from the Parliamentary Labour Party:\n\n“We have seen the disturbing allegations against Jack Straw in the Daily Telegraph. The Chief Whip has spoken to Jack Straw. He has agreed to refer himself to the Parliamentary Commissioner for Standards and in the meantime he has agreed the best course of action is to suspend himself from the Parliamentary Labour Party.”\n\nFormer Tory Foreign Secretary Malcolm Rifkind has been implicated in the same story – yet Rifkind (who unlike Straw is not stepping down as an MP in May) has not been suspended from the Tory Party, and plans to continue serving as Chair of Parliament’s Intelligence and Security committee. Rifkind – who like Straw denies any wrongdoing – has referred himself to the Parliamentary Commissioner for Standards.\n\nUpdate: Ed Miliband has commented on the Telegraph/Channel 4 allegations surrounding Straw and Rifkind:\n\n“These are disturbing allegations. That is why it’s right that Jack Straw has referred himself to the Parliamentary Commissioner for Standards, and he has been suspended from the Parliamentary Labour Party.\n\n“We need a proper investigation of this, but I believe we need to go further.\n\n“Labour candidates standing at the next election will be banned from taking paid directorships or consultancies.\n\n“Today I’m writing to David Cameron saying he should do the same for his Members of Parliament. We’ve got to settle this issue of second jobs once and for all so we remove any suspicion that MPs are working not for their constituents’ interests but someone else’s interests.”"}, {"url": "https://www.theguardian.com/politics/2016/feb/09/jack-straw-denied-knighthood-peerage-jeremy-corbyn", "page_content": "Jack Straw, who was a cabinet minister throughout the 13 years of the last Labour government, is to be denied a knighthood and a peerage under the current party leader, Jeremy Corbyn.\n\nHaving served as home secretary, foreign secretary and then lord chancellor, Straw is understood to have been lined up for a seat in the Lords during the final days of Ed Miliband’s period as party leader. But he suspended himself from party membership last February after being secretly filmed by undercover reporters while apparently offering his services to a private company for cash. This prevented an offer of a peerage at the time.\n\nAlthough Straw was subsequently cleared of misconduct by the parliamentary standards watchdog, his chances of a seat in the Lords are said to have disappeared after Corbyn’s election as leader in September.\n\n“The chances of Jeremy awarding him with either a knighthood or a peerage are close to zero,” said one senior party source, before adding: “Actually, they are zero.”\n\nStraw, who stood down as MP at the last general election, did not respond to requests for comment. He is currently serving on a panel that is reviewing the Freedom of Information Act, although his appointment was criticised by some, as he has been a vocal opponent of the act.\n\nOn Monday, the Guardian reported that Straw led two of the Whitehall departments most likely to reject public requests for information. Straw’s ministries never ranked higher than 15 out of 21 government departments in terms of releasing information in full, according to a Guardian analysis of government-wide figures.\n\nAccording to party sources, there are several reasons for the decision not to nominate the former minister for a peerage: his support for the 2003 invasion of Iraq; a damages claim that is being brought against him by a Libyan couple who were “rendered” to one of Muammar Gaddafi’s prisons; an ongoing inquiry by Westminster’s intelligence and security committee (ISC) into that and other rendition allegations; and the words that were captured by the undercover reporter.\n\nIt appears Straw’s support for the war in Iraq counts most heavily against him among the Labour leader and his closest supporters.\n\nBoth Straw and the Tory MP Sir Malcolm Rifkind, the then chair of the ISC, were caught in a sting mounted by the Daily Telegraph and Channel 4 in February last year. The transcript of the exchanges indicated that Straw hoped for a seat in the Lords.\n\n\n\nThe two men were filmed as they offered to use their positions as politicians in return for payments of thousands of pounds from a fictitious Chinese company.\n\nAt one point, one of the reporters asked Straw about the implications of his leaving the House of Commons. Straw replied: “Well, the implications are that I can do a lot more for you.”\n\nA Telegraph reporter then asked: “Ah ha, in what way?”\n\nJS: “Well, it’s not subject to regulation. Obviously ... I’m still the same person – I mean, if you are a member of parliament and you have commercial interests, you have to be so careful ... if I was ever to stand up in the House of Commons and talk about sugar, I could end up being disqualified … Because there are very strict rules against advocating on behalf of companies who are paying you.”\n\nTel: “Right.”\n\nJS: “ ... Well obviously if I’m not in the House of Commons, I’m not in that position. I could end up in the House of Lords, so you’re aware ... you may have seen that ...”\n\nTel: “That’d be good. You mentioned.”\n\nJS: “ ... I mean there’s speculation in the paper at the moment – no one has said anything to me officially. But the rules there are different and plenty of people have commercial interests there.”\n\nTel: “Ah great, so you’ll be able to help us a lot more potentially?”\n\nJS: “I’ll be able to help you more, Claire, I’ll be able to help you more.”\n\nBoth politicians denied any wrongdoing, and said that they had acted in accordance with parliamentary rules. Rifkind was suspended from his parliamentary party while Straw suspended himself. Senior Labour sources say Straw had been in line for a peerage until this point.\n\nIn September, Conservative sources briefed journalists that Rifkind would be “near the top of the list” the next time David Cameron proposed a list of new political peers.\n\nThe parliamentary standards commissioner, Kathryn Hudson, and the House of Commons standards committee cleared both of any wrongdoing and criticised the way the exchanges had been reported.\n\n\n\nBoth the Telegraph and Channel 4 were angered by the commissioner’s conclusions. The Telegraph published a leader which condemned them as “deeply troubling” and “shameful”, while Channel 4 reported itself to the regulator, Ofcom.\n\nIn December, Ofcom found that the reporting was of significant public interest and did not unfairly represent the two politicians. It also concluded that the undercover filming was “proportionate and warranted”.\n\nA damages claim is being brought against Straw by Abdel Hakim Belhaj, who was abducted in Thailand and flown to Tripoli along with his pregnant wife, Fatima Bouchar, in March 2004, with the assistance of MI6. Straw was foreign secretary at the time.\n\nA cache of secret documents that detailed the involvement of MI6’s then head of counter-terrorism, Mark Allen, in that rendition was discovered during the 2011 Libyan revolution. After Straw gave an interview to the BBC in which he said that “no foreign secretary can know all the details of what its intelligence agencies are doing at any one time”, well-placed sources told the Guardian that the rendition operations were “ministerially authorised government policy”.\n\nGovernment lawyers are arguing that the claim should be thrown out on the grounds that the case will involve the acts of other countries. A decision is expected from the supreme court in the next few months.\n\nMeanwhile, a Scotland Yard investigation, Operation Lydd, has been examining the Libyan rendition operation. A police file is currently with Alison Saunders, the director of public prosecutions.\n\nThe treatment of Belhaj and Bouchar is also being investigated by the ISC, after an interim inquiry by Sir Peter Gibson, a retired appeal court judge, reported that there were “serious allegations of UK involvement” which “plainly require investigation”.\n\nWhen asked about the Libyan renditions in the past, Straw has said: “At all times I was scrupulous in seeking to carry out my duties in accordance with the law, and I hope to be able to say more about this at an appropriate stage in the future.”"}, {"url": "https://www.nytimes.com/2015/02/24/world/europe/malcolm-rifkind-jack-straw-deny-wrongdoing.html", "page_content": "LONDON — After falling for an embarrassing media sting, two British former foreign secretaries were on Monday facing investigations into whether they broke rules prohibiting lawmakers from trading influence for money.\n\nMalcolm Rifkind, a member of the governing Conservative Party and head of a parliamentary panel that oversees British intelligence agencies, and Jack Straw, of the opposition Labour Party, were both caught by an undercover reporter posing as the representative of a Hong Kong-based company that purportedly sought to hire them.\n\nThe episode reopened a fractious debate over the probity of lawmakers, whose reputation with the British electorate has suffered from a series of scandals. With a general election on May 7, both parties moved quickly to try to limit the damage.\n\nThe episode is particularly problematic for Mr. Rifkind, whose responsibilities give him high visibility and access to highly sensitive information. He stressed that the allegations against him were not related to intelligence or security issues."}]}