{"Syd Rapson was elected to the House of Commons at the 1997 general election, and held the seat until he stood down at the 2010 general election.": [{"url": "https://simple.wikipedia.org/wiki/1997_United_Kingdom_general_election", "page_content": "The UK general election, 1997 was an election held on 1 May 1997 to elect 659 members to the House of Commons of the United Kingdom. The three main candidates to become Prime Minister are shown to the right:\n\nThe Labour Party and its leader Tony Blair gained the majority of seats and created the first Labour government since 1979. The Labour Party won 418 seats which was the highest majority of seats for any party since the Conservatives in the 1931 General Election. The Conservative Party suffered it's lowest number of seats since 1906 and lost all of its seats in Scotland and Wales. Several prominent Conservative politicians lost their seats such as Defence Secretary Michael Portillo, Foreign Secretary Malcolm Rifkind, Scottish Secretary Michael Forsyth as well as Edwina Currie, David Mellor and Ian Lang.\n\nThe Liberal Democrats won 46 seats, which was the highest number of seats for a third party since 1929. The Referendum Party ran on the single issue of taking Britain out of the European Union and won 2.6% of the vote but no seats.\n\nThe final results of the election were:"}, {"url": "https://academickids.com/encyclopedia/index.php/Syd_Rapson", "page_content": "From Academic Kids\n\nSydney Norman John Rapson (born 17 April 1942) is a politician in the United Kingdom. He was Labour member of Parliament for Portsmouth North from 1997 until he stood down at the 2005 general election.\n\nTemplate:UK-politician-stub\n\nSyd Rapson was first elected to the Commons in 1997, after a long career in Portsmouth's local government, including stints as deputy leader of the council and as Lord Mayor.\n\nHe had stronger union credentials than many of his intake, having spent many years as an AEEU activist and convenor. In Portsmouth a previously Tory (Conservative) strong hold, Syd Rapson represented the real Labour party of the South and his victory marked the end of not only the Conservative but also the Liberal parties belief that the South was a Labour free zone. Syd Rapson, the man from an 'old school tradition' destroyed the belief touted by the Lib-Dem and Conservative Party that Labour was unelectable in south of England. The Labour party enjoyed healthy majorities in the three major economic, intellectual and industrial hubs (Portsmouth, Southampton and Brighton) of the south coast of England during his time in parliment.\n\nHis union links came from his career as an aircraft fitter, which also gave him the strong interest in defence which has been the hallmark of his parliamentary career.\n\nHe joined the Commons defence select committee after the 2001 election.\n\nHe generally has a very low profile around Parliament; he rarely contributes to debates and sat for four years on the low-key accommodation and works committee.\n\nHis moments of public prominence have all been connected to the anti-paedophile protests on the Paulsgrove Estate where he continues to live.\n\nHe caused controversy by describing the events as \"democracy in action\"."}, {"url": "https://en-academic.com/dic.nsf/enwiki/251803", "page_content": "Sydney Norman John Rapson, known as Syd Rapson, a politician in the United Kingdom , was born on 17 April 1942 in the Isle of Wight and moved to the Paulsgrove area of Portsmouth as a young child [He attended Paulsgrove Modern (now King Richard School): Garlick,M: Memories of Wymering and Paulsgrove(1998, Hampshire WEA) HAM 30108] . After leaving school he worked in the aeronautical industry for nearly forty years until becoming Labour Member of Parliament (MP) for Portsmouth North from 1997 until he stood down at the 2005 general election. A former long serving councillor [\"Deputy Leader\" of the Council and Lord Mayor of the City: Voices from Paulsgrove: Lee,S & Stedman, J (Ed) (1992,Portsmouth City Council Leisure Department) ISBN 187041215X ] , he was succeeded by Sarah McCarthy-Fry MP.\n\nHe had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convenor. In Portsmouth, previously a Conservative Party stronghold, Rapson, a man from an \"old school\" tradition, disproved the claim of the Lib-Dem and Conservative parties that Labour was unelectable in the south of England. During his time in Parliament, the Labour party enjoyed healthy majorities in the three major economic hubs of the south coast of England: Portsmouth, Southampton and Brighton .\n\nHis union links came from his career as an aircraft fitter, which also gave him the strong interest in defence which has been the hallmark of his parliamentary career.\n\nHe joined the Commons Defence Select Committee after the 2001 election. He generally had a very low profile around Parliament; he rarely contributed to debates and sat for four years on the low-key Accommodation and Works Committee.\n\nRapson appeared in the controversial TV show Brass Eye , in which he was duped into presenting a segment on \"trust-me trousers\", supposedly worn by paedophiles and inflated to hide an erection.\n\nNotes\n\nExternal links"}, {"url": "https://www.howold.co/person/syd-rapson/biography", "page_content": "Syd Rapson Biography\n\nBritish politician (born 1942)\n\nSydney Norman John Rapson (born 17 April 1942) is a British former Labour politician who served as the MP for Portsmouth North from 1997 to 2005.\n\nEarly life\n\nRapson moved with his family to the Paulsgrove area of Portsmouth as a young child, where he attended Paulsgrove Modern (now King Richard School). After leaving school he worked in the aeronautical industry for nearly forty years and became a long serving councillor, serving as Lord Mayor of Portsmouth in 1990.\n\nPolitical career\n\nRapson was elected as the Labour Member of Parliament (MP) for Portsmouth North at the 1997 general election until he retired in 2005. He was succeeded by Sarah McCarthy-Fry.\n\nRapson stood for union improvement. He had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He sat for four years on the Accommodation and Works Committee.\n\nOther work\n\nIn 2001, Rapson was one of a number of MPs stung by the satirical Channel 4 do*entary series Br* Eye, which filmed him for its controversial \"Paedogeddon!\" episode. He was filmed describing \"trust-me trousers\", which were supposedly worn by paedophiles and inflated to hide an erection. The programme-makers also persuaded him to say that paedophiles were using \"an area of internet the size of Ireland\". The MP complained to the Broadcasting Standards Commission that he had been duped into appearing on the show and that it had infringed his privacy. The BSC ruled against him, saying the means used to deceive the MPs \"were justified in the context of the serious issues raised by the programme\" and in particular \"the dangers of people in the public eye speaking with apparent authority about matters they do not understand\".\n\nRapson led the team that headed the development of Portsmouth City's Gunwharf Quays, a large leisure and retail center located near the famous Portsmouth docks and the district of Portsea. The 'Quays' saw huge success, becoming the tourist capital of the city.\n\nIn 2018, Rapson was awarded the key of the city for his contributions and accomplishments in regard to representation and contributions for the city. This award was last given in 2008 and is only held by 32 others over a century of Portsmouth's history.\n\nRapson retired in 2005 and still lives in Portchester and Portsmouth to this day, with his wife Phyllis. He has two children and four grandchildren.\n\nReferences\n\nExternal links"}, {"url": "https://prabook.com/web/syd.rapson/2235234", "page_content": "Syd Rapson\n\nApril 17, 1942 Isle of Wight, South East England, United Kingdom\n\nAfter leaving school he worked in the aeronautical industry for nearly forty years, and became a long serving councillor. He was succeeded by Sarah McCarthy-Fry Member of Parliament. He had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He generally maintained a low profile around Parliament. He rarely contributed to debates and sat for four years on the low-key Accommodation and Works Committee. Rapson appeared in the controversial television programme Brass Eye, in which he was duped into presenting a segment on \"trust-me trousers\", supposedly worn by paedophiles and inflated to hide an erection. Rapson was also recorded stating: \"using an area of the Internet the size of Ireland, paedophiles can make your keyboard release toxic vapours that can make you more suggestible\"."}, {"url": "https://www.studysmarter.co.uk/explanations/history/modern-britain/1997-general-election/", "page_content": "The 1997 General Election result saw Tony Blair become the Labour Prime Minister in a landslide victory after 18 years of Conservative leadership. But what led to this rise of the Labour Party and the simultaneous catastrophic fall of the Conservatives? 1997 General Election Date and Summary The 1997 General Election was held on 1st May 1997 and saw a landslide victory for the Labour party. They managed to secure 418 seats while the Conservatives gained only 165. Around 10.2% of the electorate shifted their vote from Conservative to Labour in this election compared to the 1992 General Election.\n\nNew Labour New Labour was an ideological shift of the Labour party, first led by Tony Blair and comprised several key elements: the abandonment of nationalisation, legal restrictions on unions, and no mention of socialism. 1997 General Election Map Let's look at the results in more detail - below, we see a map showing the distribution of Conservative and Labour support across the United Kingdom, as well as other parties. Fig. 1: Map of the 1997 UK general election.Blue = Conservative, Red= Labour 1997 General Election Results Table Party Seats won Gain/loss Percentage of vote Labour 418 +145 43.2 Conservative 165 -178 30.7 Liberal Democrat 46 +28 16.8 Scottish National 6 +3 2.0 Ulster Unionist 10 +1 0.8 SDLP 3 -1 0.6 Plaid Cymru 4 0 0.5 Sinn Féin 2 +2 0.4 Democratic Unionist 2 -1 0.3 Independent 1 +1 0.1 Speaker 1 0 0.1 UK Unionist 1 +1 0 Source: House of Commons research paper 01/38 1997 General Election Demographics Source: House of Commons research paper 01/38 Here is a brief breakdown of how people from different demographics voted for the two main parties in the election. Demographics are the characteristics of the population, such as income or race\n\nDemographic Labour Conservative Gender 45% of men voted Labour\n\n44% of women voted Labour 31% of men voted Conservative\n\n32% of women voted Conservative Age Gained more votes than the Conservatives in every age group Those aged 55 and above were most likely to vote Conservative Region Labour gained the highest proportion of votes in the North with 62% The Conservatives gained the highest proportion of votes in the South East at 41% Ethnicity 70% of non-white voters voted Labour, as well as the majority of white voters 18% of non-white voters voted Conservative Occupation Manual and lower-paid workers were more likely to vote for Labour Those in higher-paid careers were more likely to vote Conservative 1997 General Election Analysis Before this election, the Conservative Party had been in power for 18 consecutive years. However, by 1997, many people had become increasingly disillusioned with the Conservative party and began to distrust the party, whilst Labour's modernisation and reforms gained them more popularity.\n\nModernisation To modernise the means to bring it in line with the global frontiers of capitalist expansion. Increased globalisation is one example of modernisation. The fall of the Conservative party As much as the 1997 election was a victory for Labour, it was more so a defeat for the Conservatives - let's find out why the Conservative party lost so much popularity. Thatcherism Europe Economic decline Tory 'sleaze' During the 1980s, the policies of Margaret Thatcher had divided the Conservative party. This meant that the party struggled to unify behind Thatcher, making it difficult to stand up to their opposition. The Conservative party was increasingly divided over Britain's position in Europe, split into pro-Europeans and Eurosceptics. This divide severely weakened the party. Britain experienced a recession at the beginning of both the 80s and the 90s. Thatcher's policies increased unemployment whilst tackling inflation. Economic hardship made the Conservatives unpopular. During John Major's government, several Conservative MPs were involved in scandals of corruption and illicit sexual affairs. This made the public lose faith in the party. Reputation of leaders During an election, people are not only influenced by the party as a whole but by the leader - the potential Prime Minister - let's look at the Conservative and Labour leaders' reputations. Margaret Thatcher (1979-90) John Major (1990-97) Tony Blair (1997-2007) Her brand of conservatism was still strongly remembered by the British public.\n\nThe Conservative defeat in 1997 was a rejection of Thatcherite conservatism as well as support for the Labour party. Major was a likeable, but bland and uninspiring character.\n\nThis was a pleasant change of pace after Thatcher's abrasive character. Tony Blair had a great impression on the British public.\n\nCompared to Major, Blair was younger, and captured the public's attention, spearheading the campaign of 'New Labour' in 1997.\n\nNew Labour After years out of power, many Labour politicians began to see the need for a radical restructuring of the party. The restructure attempted to shift the party's focus towards the political centre, which was becoming more popular with the electorate. The outcome of this restructuring was 'New Labour' - what did this involve? Economic Policy : Anti-inflationary, limited government spending. Kept restrictions on trade unions, and made little effort to undo the privatisation of industry. Desire to create a 'stakeholder society', where everyone had government-protected investments and pensions.\n\n: Anti-inflationary, limited government spending. Kept restrictions on trade unions, and made little effort to undo the privatisation of industry. Desire to create a 'stakeholder society', where everyone had government-protected investments and pensions. Foreign Policy : Closer ties with Europe as well as maintaining a 'special relationship' with the USA.\n\n: Closer ties with Europe as well as maintaining a 'special relationship' with the USA. Domestic policy: Committed to Devolution for Scotland and Wales Devolution The diversion of central or singular power to local and regional governments Cool Britannia A large part of 'New Labour' was the way that the Labour party presented itself to the public. They adopted the phrase 'Cool Britannia' to reflect the new direction of the party. What was new about their image? Labour MPs avoided using the term 'socialist' about the Labour party in order not to scare away voters.\n\nLabour promised businesses that capitalism would be safe under New Labour.\n\nLabour stopped presenting its policies in terms of a class struggle. Tony Blair helped this image a lot. He was youthful and presented himself as a down to earth, 'normal' man, which the public loved. He also attacked John Major's government, leaning into the image of a 'tired' Conservative party that needed to be replaced by something fresh and new.\n\n1997 General Election Campaigns\n\nThe 1997 election campaign was one of the longest in British history. Parliament was dissolved on 8th April 1997, and the date of the 1997 general election was set for 1st May 1997. Conservative campaign\n\nAction Explanation Impact 'You can only be sure with the Conservatives.' This aimed to present the Conservatives as the safe choice for Britain. It was ineffectual against a background of Thatcherism, economic decline and scandals. Voter Appeal The campaign targeted white, middle-class, white-collar workers, age 35+ - their usual voter base. The highest proportion of the party's votes was from these groups, but this did not outweigh their overall loss in popularity. Conservative values Major promised a return to traditional values, such as a tax break for married couples when one partner stayed at home. Whilst it was traditional, by 1997 these ideas were outdated. Europe The Conservatives promised to keep Europe at arm's length. This promise did not have much credibility given the division over Europe in the party. Devolution The Conservatives attacked Labour's plans for Welsh and Scottish devolution, warning that it would break up the union. This alienated potential voters in Scotland and Wales who supported devolution. 'New Labour, New Danger' The Conservatives used this slogan to imply that Labour would be dangerous for Britain. Despite posters depicting Tony Blair with devil eyes, the Conservatives did not actually state the dangers - this failed to sway voters. 'Stealing Tory Clothes' The Conservatives accused Labour of stealing Conservative policies and ideas. This created a contradiction - if Labour was stealing Conservative ideas, why was Labour dangerous? Labour's Façade Major attacked Labour by saying that 'New Labour' was a façade and they would revert to their old policies when in power. This was ineffective for two reasons: The shadow Chancellor Gordon Brown promised this would not happen. In the 1992 campaign, John Major had promised to cut VAT but then had not done so - this seemed hypocritical.\n\nLabour campaign Unlike the Conservatives, Labour ran a very organised campaign. Labour's campaign demonstrated that the nation needed more centrist leadership due to the major splits in the Conservative party. Action Explanation Impact 'New Labour, New Life for Britain' This was used as a way to promote Labour's new centrist approach. It had reinvented itself as a modern party that would sweep away the Conservatives who were holding Britain back. This campaign was quite effective- people were desperate for change after 18 years of a Conservative government, and the image Labour and Tony Blair presented was enticing. Voter appeal The campaign focused on the middle and lower-middle classes, which had become a large majority of British people, as well as maintaining their traditional working-class support. This was very effective - the Labour party gained more votes than the Conservative party in every age, gender, and ethnic group and most regions of the UK. Spin doctors A key element of Blair's campaign was his use of spin doctors - their job was to judge the public mood and present government policies to the public in a favourable light - essentially 'spinning' a story. Spin doctors were controversial. At their best, they were simply a form of public relations, but at their worst, they were a method of lying to the public. Taxes Tony Blair promised that there would be no income tax rises and that VAT would be cut. These promises were enticing, but they became believable as Labour explained how these goals would be funded and achieved. Unemployment Labour emphasised reducing unemployment, especially among young people. This was looked on favourably as unemployment was high, largely thanks to the recessions in the early 1980s and 1990s, as well as Thatcher's policies. Welfare Labour vowed to reduce the size of infant school classes and cut waiting times for the NHS. This was effective as the Labour party explained how these policies would be put in place. Crime Labour promised to tackle crime rates, especially among young people. This was one of the policies that helped to entice the middle-class voters who might have normally voted Conservative. The Impact of the 1997 Election The impact of the 1997 election can be summarised in the five points listed below:\n\nTony Blair won 418 seats in the House of Commons, the most in the history of the Labour Party, and the highest proportion of seats won by any party since 1935.\n\nThe political landscape of British politics shifted to a more centrist stance.\n\nThere was a 71% voter turnout- the most recent national election with over 70% turnout until the 2016 EU referendum.\n\nNew Labour's successes spanned over 13 years and continued up until 2010 under Gordon Brown.\n\nThe 1997 general election saw the Conservative party struggle to modernise its image for the next 13 years."}, {"url": "https://www.politics.co.uk/reference/elections/", "page_content": "Overview\n\nThe House of Commons is made up of 650 elected Members of Parliament, known as MPs. Each Member of Parliament represents a specific geographic area within the United Kingdom. These areas are known as Parliamentary constituencies.\n\nParliamentary Constituencies\n\nIn 2017, the average constituency was comprised of 56,000 voters in Wales, 68,300 voters in Northern Ireland, 67,200 voters in Scotland, and 72,200 votes in England. The largest constituency by population was the Isle of Wight (110,683).\n\nThe Boundary Commission is currently working on proposals to better standardise the electoral numbers within the UK’s 650 constituencies.\n\nBy area, the largest constituency is Ross, Skye and Lochaber in North West Scotland (918,319 hectares). The smallest by area is Islington North in London (727 hectares).\n\nWithin each constituency, Members of Parliament are elected by the first-past-the-post system, which is also known as the plural majority system. Simply put, this means the candidate with the highest number of votes wins.\n\nWho can stand for election\n\nAnyone over the age of 18, who is a British, Irish or Commonwealth citizen can stand for election to Parliament. The only exceptions are Peers, Bishops, undischarged bankrupts, prisoners and certain officeholders including judges, military personnel, police officers and other civil servants (persons holding offices of profit under the Crown).\n\nPeople convicted of certain corruption offences and members of non-Commonwealth legislatures may not stand.\n\nElection Cycles\n\nParliamentary elections must be held at least every five years. Unless they have lost a vote of no confidence in the House of Commons, the date for post war British elections within that period has typically been chosen by the Prime Minister. The sitting Prime Minister asks the Monarch to dissolve Parliament.\n\nThis convention was briefly interrupted by the introduction of the Fixed Term Parliament’s Act in 2010, albeit in both 2017 and 2019, the Parliament’s did not last the planed five year term. This has led to the Fixed Term Parliament’s Act coming under review.\n\nThe word ‘Parliament’ is used to refer to the time between two general elections.\n\nEach Parliament is made up of Sessions, which normally last about a year from November to October. A Session runs from the State Opening of Parliament (the Queen’s Speech) until prorogation or dissolution.\n\nAfter an election, the Monarch opens Parliament in the normal way through the State Opening of Parliament. Typically, the first Session after an election is normally longer than a year, running through to the October of the following year.\n\nElection Length\n\nThere are certain rules governing the timetable for elections themselves.\n\nA session of Parliament is prorogued on the day scheduled and dissolution normally follows on the same day, although it does not have to. It is normally accompanied by the proclamation calling a new Parliament. The election must normally then take place 17 days after this proclamation (not including weekends and public or bank holidays).\n\nElection campaigns – the time between dissolution and the election – normally last about three or four weeks.\n\nWhat is a by-election\n\nIf a Member of Parliament resigns or dies, then a by-election is held to elect a replacement in that constituency.\n\nThe date for the by-election is chosen by the Government but it is announced by the Speaker of House of Commons."}, {"url": "https://wiki2.org/en/Syd_Rapson", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish politician (born 1942)\n\nSydney Norman John Rapson (born 17 April 1942) is a British former Labour politician who served as the MP for Portsmouth North from 1997 to 2005.\n\nEarly life\n\nRapson moved with his family to the Paulsgrove area of Portsmouth as a young child, where he attended Paulsgrove Modern (now King Richard School). After leaving school he worked in the aeronautical industry for nearly forty years and became a long serving councillor,[1] serving as Lord Mayor of Portsmouth in 1990.[2]\n\nPolitical career\n\nRapson was elected as the Labour Member of Parliament (MP) for Portsmouth North at the 1997 general election until he retired in 2005. He was succeeded by Sarah McCarthy-Fry.\n\nRapson stood for union improvement. He had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He sat for four years on the Accommodation and Works Committee.[citation needed]\n\nOther work\n\nIn 2001, Rapson was one of a number of MPs stung by the satirical Channel 4 documentary series Brass Eye, which filmed him for its controversial \"Paedogeddon!\" episode. He was filmed describing \"trust-me trousers\", which were supposedly worn by paedophiles and inflated to hide an erection. The programme-makers also persuaded him to say that paedophiles were using \"an area of internet the size of Ireland\". The MP complained to the Broadcasting Standards Commission that he had been duped into appearing on the show and that it had infringed his privacy. The BSC ruled against him, saying the means used to deceive the MPs \"were justified in the context of the serious issues raised by the programme\" and in particular \"the dangers of people in the public eye speaking with apparent authority about matters they do not understand\".[3]\n\nRapson led the team that headed the development of Portsmouth City's Gunwharf Quays, a large leisure and retail center located near the famous Portsmouth docks and the district of Portsea. The 'Quays' saw huge success, becoming the tourist capital of the city.\n\nIn 2018, Rapson was awarded the key of the city for his contributions and accomplishments in regard to representation and contributions for the city. This award was last given in 2008 and is only held by 32 others over a century of Portsmouth's history.\n\nRapson retired in 2005 and still lives in Portchester and Portsmouth to this day, with his wife Phyllis. He has two children and four grandchildren.\n\nReferences"}, {"url": "https://www.liquisearch.com/syd_rapson", "page_content": "Sydney Norman John Rapson, a politician in the United Kingdom, was born on 17 April 1942 in the Isle of Wight and moved to the Paulsgrove area of Portsmouth as a young child. After leaving school he worked in the aeronautical industry for nearly forty years until becoming Labour Member of Parliament (MP) for Portsmouth North from 1997 until he stood down at the 2005 general election. A former long serving councillor, he was succeeded by Sarah McCarthy-Fry MP. He has two children and also has four grand children.\n\nHe had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career.\n\nHe joined the Commons Defence Select Committee after the 2001 election. He generally had a very low profile around Parliament; he rarely contributed to debates and sat for four years on the low-key Accommodation and Works Committee.\n\nRapson appeared in the controversial TV show Brass Eye, in which he was duped into presenting a segment on \"trust-me trousers\", supposedly worn by paedophiles and inflated to hide an erection. Rapson was also recorded stating: \"using an area of the Internet the size of Ireland, pedophiles can make your keyboard release toxic vapors that can make you more suggestible\"."}, {"url": "https://www.britannica.com/topic/House-of-Commons-British-government", "page_content": "House of Commons , also called Commons , popularly elected legislative body of the bicameral British Parliament . Although it is technically the lower house, the House of Commons is predominant over the House of Lords , and the name “Parliament” is often used to refer to the House of Commons alone.\n\nappeals to political theorists, enables every individual or group to move round the centre, adopting various shades of pink according as the weather changes.…A chamber formed on the lines of the House of Commons should not be big enough to contain all its members at once without overcrowding, and there should be no question of every member having a separate seat reserved for him. If the House is big enough for all its members, nine-tenths of its debates will be conducted in the depressing atmosphere of an almost empty or half-empty Chamber.…[T]here should be on great occasions a sense of crowd and urgency.\n\nDespite its large membership, the chamber of the House of Commons seats only 427 persons. After it was destroyed by a German bomb during World War II , there was considerable discussion about enlarging the chamber and replacing its traditional rectangular structure with a semicircular design. Among those who argued against this proposal was Winston Churchill , who maintained that a semicircular chamber\n\nThe membership of the House of Commons stood at 658 from 1801—when Great Britain and Ireland were united by the Act of Union to form the United Kingdom—until 1885, when it was increased to 670. In 1918 it was increased to 707. It was also changed under subsequent acts. At the general election in May 2010, 650 members were returned—533 from England, 59 from Scotland, 40 from Wales, and 18 from Northern Ireland . Each constituency returns a single member.\n\nThe House of Lords was initially the more powerful of the two houses, but over the centuries its powers gradually diminished . By the late 17th century, the House of Commons had gained the sole right to initiate taxation measures. The House of Lords retained its veto power over bills passed by the Commons, however, and in 1832 the only recourse of the Liberal Party government was to threaten to flood the House of Lords with new Liberal peers in order to prevent it from rejecting that government’s Reform Bill . Eighty years later the same threat was used, again by a Liberal government, to compel the Lords to approve the Parliament Act of 1911 , which enabled a majority of the House of Commons to override the Lords’ rejection of a bill. Under this act, the House of Lords lost the power to delay legislation passed by the Commons for the raising and spending of revenue; it also lost the power to delay other legislation for a period beyond two years (reduced in 1949 to one year). The act also reduced the maximum duration of a parliamentary session to five years.\n\nThe origins of the House of Commons date from the second half of the 13th century, when landholders and other property owners in the counties and towns began sending representatives to Parliament to present grievances and petitions to the king and to accept commitments to the payment of taxes. In the 14th century the knights and burgesses chosen as representatives (i.e., the commons) began sitting in a separate chamber, or “house,” from that used by the nobles and high clergy (i.e., the lords).\n\nFunctions and operation\n\nLearn about the history and traditions of the House of Commons Chamber, also the functions of its members See all videos for this article\n\nThe House of Commons is the effective legislative authority in Great Britain. It alone has the right to impose taxes and to vote money to, or withhold it from, the various public departments and services. The House of Lords has only infrequently held up major legislation passed by the Commons, and the British sovereign almost automatically provides the Royal Assent to any bill passed. Indeed, the last bill to be rejected by a monarch was the Scottish Militia Bill of 1707, which was vetoed by Queen Anne. Acts of Parliament are not subject to judicial review.\n\nThe passage of legislation is the House of Commons’ primary function. Almost all legislation proceeds from the majority party in the Commons, which forms the government and the cabinet; the latter is composed of senior ministers chosen by, and belonging to the party of, the prime minister, nearly all of whom serve in the House of Commons. The government’s main work in the Commons is to implement the legislative program on which it fought and won the last general election.\n\nAt the beginning of each new session of Parliament, the House elects from its members the speaker, who presides over and regulates debates and rules on points of order and members’ conduct. The speaker does not participate in debates and votes only in order to break a tie, a case that compels the speaker to vote in favour of the status quo. The calling of members to speak in debate is entirely in the speaker’s hands, the main concern being to ensure that a variety of points of view is heard. By a convention of the constitution not established until the 20th century, the prime minister is always a member of the House of Commons, instead of a member of either house. The government party appoints the leader of the House of Commons, who manages the party’s legislative program. Except for occasional independents, members of both the government and opposition parties are under the control of party management within the Commons, whose discipline—particularly over voting—is exercised by members called “whips.”\n\nThe tradition that a bill must be read three times in the Commons (and also in the Lords) before it can be voted on is based on the need to allow members adequate time to investigate the principles on which the bill is based and the details of its provisions. The first reading is purely formal, but the second reading provides the occasion for debate on the principles involved. The bill then goes into committee, where it is examined clause by clause. Most bills are sent to standing committees, each of which deals with bills belonging to a particular range of topics, with the committees reflecting in their makeup the respective strength of parties in the House. Having examined the bill, the committee then reports back to the House, and after further amendments may have been proposed in the course of more debate, the bill is read a third time and is then voted on. In addition to bills proposed by the government, a limited number of bills sponsored by individual members are considered by the House each session.\n\nBeginning in 1999, power over a number of matters—including health, education, housing, transportation, the environment, and agriculture—was devolved from the British Parliament to the newly established Scottish Parliament, National Assembly of Wales, and (somewhat later) Northern Ireland Assembly. That reallocation of legislative responsibilities raised the issue of whether MPs from Scotland, Wales, and Northern Ireland should continue to vote on measures directed at England only. This so-called West Lothian question (so named because it was first posed in 1977 by the anti-devolutionist MP from West Lothian, Tam Dalyell) was addressed in 2015 by controversial legislation that established a new set of procedures known as English Votes for English Laws (EVEL). New stages were introduced into the standard lawmaking procedure during which legislation that was determined to affect England only was to be considered and voted upon by MPs from English constituencies (who were effectively granted veto power) before moving on to consideration by the House of Commons as a whole. (Similarly, legislation aimed at England and Wales only was to be addressed first by English and Welsh MPs only.) When it was not clear whether a measure was an England-only matter, the speaker of the House of Commons was tasked with making that determination.\n\nAside from passing legislation, the most important business of the full House is the question period, which is held on a regular basis. During this period, members can require government ministers to answer questions regarding their departments; it thus provides the opposition with an opportunity to attack government policy and to raise issues on which the government may be thought to have been negligent. It also generates regular policy debates between the prime minister and the leader of the opposition. These exchanges have been made more important by their public broadcast, first by radio in 1978, and then by television in 1989.\n\nMembers of the House of Commons must be 18 years of age or older. Peers of England, Scotland, or the United Kingdom may not be elected to the House of Commons, though Irish peers may be. Certain clergy, judicial officers, members of the armed forces, police officers, and civil servants are also ineligible for election. Women became eligible under an act of 1918. Members were paid beginning in 1911."}]}