{"Syd Rapson was educated at Portsmouth Grammar School and the University of Southampton.": [{"url": "https://www.howold.co/person/syd-rapson/biography", "page_content": "Syd Rapson Biography\n\nBritish politician (born 1942)\n\nSydney Norman John Rapson (born 17 April 1942) is a British former Labour politician who served as the MP for Portsmouth North from 1997 to 2005.\n\nEarly life\n\nRapson moved with his family to the Paulsgrove area of Portsmouth as a young child, where he attended Paulsgrove Modern (now King Richard School). After leaving school he worked in the aeronautical industry for nearly forty years and became a long serving councillor, serving as Lord Mayor of Portsmouth in 1990.\n\nPolitical career\n\nRapson was elected as the Labour Member of Parliament (MP) for Portsmouth North at the 1997 general election until he retired in 2005. He was succeeded by Sarah McCarthy-Fry.\n\nRapson stood for union improvement. He had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He sat for four years on the Accommodation and Works Committee.\n\nOther work\n\nIn 2001, Rapson was one of a number of MPs stung by the satirical Channel 4 do*entary series Br* Eye, which filmed him for its controversial \"Paedogeddon!\" episode. He was filmed describing \"trust-me trousers\", which were supposedly worn by paedophiles and inflated to hide an erection. The programme-makers also persuaded him to say that paedophiles were using \"an area of internet the size of Ireland\". The MP complained to the Broadcasting Standards Commission that he had been duped into appearing on the show and that it had infringed his privacy. The BSC ruled against him, saying the means used to deceive the MPs \"were justified in the context of the serious issues raised by the programme\" and in particular \"the dangers of people in the public eye speaking with apparent authority about matters they do not understand\".\n\nRapson led the team that headed the development of Portsmouth City's Gunwharf Quays, a large leisure and retail center located near the famous Portsmouth docks and the district of Portsea. The 'Quays' saw huge success, becoming the tourist capital of the city.\n\nIn 2018, Rapson was awarded the key of the city for his contributions and accomplishments in regard to representation and contributions for the city. This award was last given in 2008 and is only held by 32 others over a century of Portsmouth's history.\n\nRapson retired in 2005 and still lives in Portchester and Portsmouth to this day, with his wife Phyllis. He has two children and four grandchildren.\n\nReferences\n\nExternal links"}, {"url": "https://prabook.com/web/syd.rapson/2235234", "page_content": "Syd Rapson\n\nApril 17, 1942 Isle of Wight, South East England, United Kingdom\n\nAfter leaving school he worked in the aeronautical industry for nearly forty years, and became a long serving councillor. He was succeeded by Sarah McCarthy-Fry Member of Parliament. He had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He generally maintained a low profile around Parliament. He rarely contributed to debates and sat for four years on the low-key Accommodation and Works Committee. Rapson appeared in the controversial television programme Brass Eye, in which he was duped into presenting a segment on \"trust-me trousers\", supposedly worn by paedophiles and inflated to hide an erection. Rapson was also recorded stating: \"using an area of the Internet the size of Ireland, paedophiles can make your keyboard release toxic vapours that can make you more suggestible\"."}, {"url": "https://wiki2.org/en/Syd_Rapson", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish politician (born 1942)\n\nSydney Norman John Rapson (born 17 April 1942) is a British former Labour politician who served as the MP for Portsmouth North from 1997 to 2005.\n\nEarly life\n\nRapson moved with his family to the Paulsgrove area of Portsmouth as a young child, where he attended Paulsgrove Modern (now King Richard School). After leaving school he worked in the aeronautical industry for nearly forty years and became a long serving councillor,[1] serving as Lord Mayor of Portsmouth in 1990.[2]\n\nPolitical career\n\nRapson was elected as the Labour Member of Parliament (MP) for Portsmouth North at the 1997 general election until he retired in 2005. He was succeeded by Sarah McCarthy-Fry.\n\nRapson stood for union improvement. He had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He sat for four years on the Accommodation and Works Committee.[citation needed]\n\nOther work\n\nIn 2001, Rapson was one of a number of MPs stung by the satirical Channel 4 documentary series Brass Eye, which filmed him for its controversial \"Paedogeddon!\" episode. He was filmed describing \"trust-me trousers\", which were supposedly worn by paedophiles and inflated to hide an erection. The programme-makers also persuaded him to say that paedophiles were using \"an area of internet the size of Ireland\". The MP complained to the Broadcasting Standards Commission that he had been duped into appearing on the show and that it had infringed his privacy. The BSC ruled against him, saying the means used to deceive the MPs \"were justified in the context of the serious issues raised by the programme\" and in particular \"the dangers of people in the public eye speaking with apparent authority about matters they do not understand\".[3]\n\nRapson led the team that headed the development of Portsmouth City's Gunwharf Quays, a large leisure and retail center located near the famous Portsmouth docks and the district of Portsea. The 'Quays' saw huge success, becoming the tourist capital of the city.\n\nIn 2018, Rapson was awarded the key of the city for his contributions and accomplishments in regard to representation and contributions for the city. This award was last given in 2008 and is only held by 32 others over a century of Portsmouth's history.\n\nRapson retired in 2005 and still lives in Portchester and Portsmouth to this day, with his wife Phyllis. He has two children and four grandchildren.\n\nReferences"}, {"url": "https://dbpedia.org/page/Syd_Rapson", "page_content": "dbo: abstract Sydney Norman John Rapson (born 17 April 1942, Isle of Wight) is a former Labour MP for Portsmouth North. (en)\n\ndbo: birthName Sydney Norman John Rapson (en)\n\ndbp: birthPlace Isle of Wight, England, UK (en)\n\ndbp: birthname Sydney Norman John Rapson (en)\n\ndbp: name Syd Rapson (en)\n\ndbp: title Member of Parliament for Portsmouth North (en)\n\nrdfs: comment Sydney Norman John Rapson (born 17 April 1942, Isle of Wight) is a former Labour MP for Portsmouth North. (en)\n\nrdfs: label Syd Rapson (en)"}, {"url": "https://peoplepill.com/people/syd-rapson/", "page_content": "Sydney Norman John Rapson (born 17 April 1942, Isle of Wight) is a British former politician. He moved with his family to the Paulsgrove area of Portsmouth as a young child, where he attended Paulsgrove Modern (now King Richard School). After leaving school he worked in the aeronautical industry for nearly forty years, and became a long serving councillor. He was elected as the Labour Member of Parliament (MP) for Portsmouth North at the 1997 general election until he retired in 2005. He was succeeded by Sarah McCarthy-Fry.\n\nHe had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He generally maintained a low profile around Parliament; he rarely contributed to debates and sat for four years on the low-key Accommodation and Works Committee.\n\nRapson appeared in the controversial TV programme Brass Eye, in which he was duped into presenting a segment on \"trust-me trousers\", supposedly worn by paedophiles and inflated to hide an erection. Rapson was also recorded stating: \"using an area of the Internet the size of Ireland, paedophiles can make your keyboard release toxic vapours that can make you more suggestible\". His complaints, and those of fellow MP Barbara Follett, that they had been duped into appearing on the programme, were thrown out by the Broadcasting Standards Commission in January 2002.\n\nRapson has two children and four grandchildren."}, {"url": "https://academickids.com/encyclopedia/index.php/Syd_Rapson", "page_content": "From Academic Kids\n\nSydney Norman John Rapson (born 17 April 1942) is a politician in the United Kingdom. He was Labour member of Parliament for Portsmouth North from 1997 until he stood down at the 2005 general election.\n\nTemplate:UK-politician-stub\n\nSyd Rapson was first elected to the Commons in 1997, after a long career in Portsmouth's local government, including stints as deputy leader of the council and as Lord Mayor.\n\nHe had stronger union credentials than many of his intake, having spent many years as an AEEU activist and convenor. In Portsmouth a previously Tory (Conservative) strong hold, Syd Rapson represented the real Labour party of the South and his victory marked the end of not only the Conservative but also the Liberal parties belief that the South was a Labour free zone. Syd Rapson, the man from an 'old school tradition' destroyed the belief touted by the Lib-Dem and Conservative Party that Labour was unelectable in south of England. The Labour party enjoyed healthy majorities in the three major economic, intellectual and industrial hubs (Portsmouth, Southampton and Brighton) of the south coast of England during his time in parliment.\n\nHis union links came from his career as an aircraft fitter, which also gave him the strong interest in defence which has been the hallmark of his parliamentary career.\n\nHe joined the Commons defence select committee after the 2001 election.\n\nHe generally has a very low profile around Parliament; he rarely contributes to debates and sat for four years on the low-key accommodation and works committee.\n\nHis moments of public prominence have all been connected to the anti-paedophile protests on the Paulsgrove Estate where he continues to live.\n\nHe caused controversy by describing the events as \"democracy in action\"."}, {"url": "https://www.liquisearch.com/syd_rapson", "page_content": "Sydney Norman John Rapson, a politician in the United Kingdom, was born on 17 April 1942 in the Isle of Wight and moved to the Paulsgrove area of Portsmouth as a young child. After leaving school he worked in the aeronautical industry for nearly forty years until becoming Labour Member of Parliament (MP) for Portsmouth North from 1997 until he stood down at the 2005 general election. A former long serving councillor, he was succeeded by Sarah McCarthy-Fry MP. He has two children and also has four grand children.\n\nHe had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career.\n\nHe joined the Commons Defence Select Committee after the 2001 election. He generally had a very low profile around Parliament; he rarely contributed to debates and sat for four years on the low-key Accommodation and Works Committee.\n\nRapson appeared in the controversial TV show Brass Eye, in which he was duped into presenting a segment on \"trust-me trousers\", supposedly worn by paedophiles and inflated to hide an erection. Rapson was also recorded stating: \"using an area of the Internet the size of Ireland, pedophiles can make your keyboard release toxic vapors that can make you more suggestible\"."}, {"url": "https://www.theyworkforyou.com/mp/10497/syd_rapson/portsmouth_north", "page_content": "We have lots more plain English analysis of Mr Syd Rapson’s voting record on issues like health, welfare, taxation and more. Visit Mr Syd Rapson’s full vote analysis page for more.\n\nLeft the House of Commons on 11 April 2005 — did not stand for re-election\n\nEntered the House of Commons on 1 May 1997 — General election\n\n9-12 March 2005, to Cape Canaveral, USA , to attend the launch of Inmarsat 4 Communications Satellite . My travel and hotel costs were paid by EADS Space, which controls Astrium which is situated in my constituency\n\n8-12 October 2004, to Cyprus to participate in the annual Morphou Rally. My travel and accommodation were paid by the Mayor of Morphou. (Registered 1 November 2004)\n\nNote for journalists and researchers: The data on this page may be used freely, on condition that TheyWorkForYou.com is cited as the source.\n\nThis data was produced by TheyWorkForYou from a variety of sources. Voting information from Public Whip."}, {"url": "https://www.rumi.org.uk/translations/", "page_content": "RTHUR JOHN ARBERRY (1905-1969 )born at Portsmouth, was educated at Portsmouth Grammar School and Pembroke College, Cambidge, where he read classics and oriental languages. After spending three years in Egypt, he was a civil servant from 1934 to 1944. During the 1939-45 was he worked in the Postal Censhorship (Uncommon Languages Department) and the Ministry of Information. In 1944 he was elected Professor of Persian in the University of London, in 1946 Professor of Arabic there, and in 1947 Professor of Arabic at Cambridge. He was a Fellow of Pembroke College, Member of the Egyptian, Syrian, and Persian Academies.\n\nWILLIAM C. CHITTICK is a professor in the Department of Comparative Studies at the State University of New York, Stony Brook. Prof. Chittick specializes in Islamic intellectual history, especially the philosophical and mystical theology of the twelfth and thirteenth centuries as reflected in Arabic and Persian texts. He has also investigated the manner in which texts have been put into practice in the Sufi orders, which have dominated much of popular Islam down to the present. He received his Ph.D degree from University of Tehran, Iran, in 1974.\n\nIBRAHIM GAMARD (1947 -) is an American amateur Rumi scholar. Dr. Gamard is a licensed psychologist in California (Ph.D., Psychology, 1986). But his passion is translating Rumi’s poetry inhis spare time. He taught himself classical Persian (starting in 1981) for the sole purpose of reading Rumi in the original language. In 1985, he began collaborating with an Afghan scholar in a translation of Rumi’s quatrains (unpublished).He has been active on the Internet (translation issues concerrning the popular versions of Rumi’s poetry, since 12/97; translations of selections from the Masnavi, with commentary and transliterationof the Persian text, since 6/99).Presently (9/01), he has nearly completed a website (dar-al-masnavi.org) containing all his translated Masnavi selections.\n\nREYNOLD ALLEYNE NICHOLSON (1868-1945), son of Henry Alleyne Nicholson, F.R.S., was educated at Edinburgh, Aberdeen, and Trinity College, Cambrdige, where he read for the Classical Tripos and the Inidan Language Tripos, being elected to a fellowship in 1893. In 1901 he was appointed Professor of Persian at University College, London, but two years later returned to Cambridge as lecturer in Persian. He succeeded E.G. Browne in 1926 as Sir Thomas Adams’s Professor of Arabic, and retired in 1933. He was a most prolific author, editor, and translator, specializing in literature and mysticism. His best-known works are his Literary History of the Arabs and his great edition and translation of Rumi.\n\nANNEMARIE SCHIMMEL (1922 – ), is former Professor of the History of Religion in the Faculty of Islamic Theology at Ankara University (1954-1959) teaching religion in Turkish, former Associate Professor of Arabic and Islamic Studies at the University of Bonn (1961-1966), and former Professor of Indo-Muslim Culture at Harvard University (1969-1992) where she taught until her retirement. She then returned to Bonn and became an honorary Professor at the University. She has written more than 80 books and essays. Her main scholarly fields have been Islamic literatures, Islamic mysticism and Sufism. Her books on ‘Mystical Dimensions of Islam’, on Maulana Jalal-ud-din Rumi, and ‘Deciphering the Signs of God’ have made a major contribution towards understanding the very essence of Islam."}, {"url": "https://en-academic.com/dic.nsf/enwiki/251803", "page_content": "Sydney Norman John Rapson, known as Syd Rapson, a politician in the United Kingdom , was born on 17 April 1942 in the Isle of Wight and moved to the Paulsgrove area of Portsmouth as a young child [He attended Paulsgrove Modern (now King Richard School): Garlick,M: Memories of Wymering and Paulsgrove(1998, Hampshire WEA) HAM 30108] . After leaving school he worked in the aeronautical industry for nearly forty years until becoming Labour Member of Parliament (MP) for Portsmouth North from 1997 until he stood down at the 2005 general election. A former long serving councillor [\"Deputy Leader\" of the Council and Lord Mayor of the City: Voices from Paulsgrove: Lee,S & Stedman, J (Ed) (1992,Portsmouth City Council Leisure Department) ISBN 187041215X ] , he was succeeded by Sarah McCarthy-Fry MP.\n\nHe had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convenor. In Portsmouth, previously a Conservative Party stronghold, Rapson, a man from an \"old school\" tradition, disproved the claim of the Lib-Dem and Conservative parties that Labour was unelectable in the south of England. During his time in Parliament, the Labour party enjoyed healthy majorities in the three major economic hubs of the south coast of England: Portsmouth, Southampton and Brighton .\n\nHis union links came from his career as an aircraft fitter, which also gave him the strong interest in defence which has been the hallmark of his parliamentary career.\n\nHe joined the Commons Defence Select Committee after the 2001 election. He generally had a very low profile around Parliament; he rarely contributed to debates and sat for four years on the low-key Accommodation and Works Committee.\n\nRapson appeared in the controversial TV show Brass Eye , in which he was duped into presenting a segment on \"trust-me trousers\", supposedly worn by paedophiles and inflated to hide an erection.\n\nNotes\n\nExternal links"}], "Syd Rapson was born in Portsmouth": [{"url": "https://www.howold.co/person/syd-rapson/biography", "page_content": "Syd Rapson Biography\n\nBritish politician (born 1942)\n\nSydney Norman John Rapson (born 17 April 1942) is a British former Labour politician who served as the MP for Portsmouth North from 1997 to 2005.\n\nEarly life\n\nRapson moved with his family to the Paulsgrove area of Portsmouth as a young child, where he attended Paulsgrove Modern (now King Richard School). After leaving school he worked in the aeronautical industry for nearly forty years and became a long serving councillor, serving as Lord Mayor of Portsmouth in 1990.\n\nPolitical career\n\nRapson was elected as the Labour Member of Parliament (MP) for Portsmouth North at the 1997 general election until he retired in 2005. He was succeeded by Sarah McCarthy-Fry.\n\nRapson stood for union improvement. He had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He sat for four years on the Accommodation and Works Committee.\n\nOther work\n\nIn 2001, Rapson was one of a number of MPs stung by the satirical Channel 4 do*entary series Br* Eye, which filmed him for its controversial \"Paedogeddon!\" episode. He was filmed describing \"trust-me trousers\", which were supposedly worn by paedophiles and inflated to hide an erection. The programme-makers also persuaded him to say that paedophiles were using \"an area of internet the size of Ireland\". The MP complained to the Broadcasting Standards Commission that he had been duped into appearing on the show and that it had infringed his privacy. The BSC ruled against him, saying the means used to deceive the MPs \"were justified in the context of the serious issues raised by the programme\" and in particular \"the dangers of people in the public eye speaking with apparent authority about matters they do not understand\".\n\nRapson led the team that headed the development of Portsmouth City's Gunwharf Quays, a large leisure and retail center located near the famous Portsmouth docks and the district of Portsea. The 'Quays' saw huge success, becoming the tourist capital of the city.\n\nIn 2018, Rapson was awarded the key of the city for his contributions and accomplishments in regard to representation and contributions for the city. This award was last given in 2008 and is only held by 32 others over a century of Portsmouth's history.\n\nRapson retired in 2005 and still lives in Portchester and Portsmouth to this day, with his wife Phyllis. He has two children and four grandchildren.\n\nReferences\n\nExternal links"}, {"url": "https://prabook.com/web/syd.rapson/2235234", "page_content": "Syd Rapson\n\nApril 17, 1942 Isle of Wight, South East England, United Kingdom\n\nAfter leaving school he worked in the aeronautical industry for nearly forty years, and became a long serving councillor. He was succeeded by Sarah McCarthy-Fry Member of Parliament. He had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He generally maintained a low profile around Parliament. He rarely contributed to debates and sat for four years on the low-key Accommodation and Works Committee. Rapson appeared in the controversial television programme Brass Eye, in which he was duped into presenting a segment on \"trust-me trousers\", supposedly worn by paedophiles and inflated to hide an erection. Rapson was also recorded stating: \"using an area of the Internet the size of Ireland, paedophiles can make your keyboard release toxic vapours that can make you more suggestible\"."}, {"url": "https://dbpedia.org/page/Syd_Rapson", "page_content": "dbo: abstract Sydney Norman John Rapson (born 17 April 1942, Isle of Wight) is a former Labour MP for Portsmouth North. (en)\n\ndbo: birthName Sydney Norman John Rapson (en)\n\ndbp: birthPlace Isle of Wight, England, UK (en)\n\ndbp: birthname Sydney Norman John Rapson (en)\n\ndbp: name Syd Rapson (en)\n\ndbp: title Member of Parliament for Portsmouth North (en)\n\nrdfs: comment Sydney Norman John Rapson (born 17 April 1942, Isle of Wight) is a former Labour MP for Portsmouth North. (en)\n\nrdfs: label Syd Rapson (en)"}, {"url": "https://peoplepill.com/people/syd-rapson/", "page_content": "Sydney Norman John Rapson (born 17 April 1942, Isle of Wight) is a British former politician. He moved with his family to the Paulsgrove area of Portsmouth as a young child, where he attended Paulsgrove Modern (now King Richard School). After leaving school he worked in the aeronautical industry for nearly forty years, and became a long serving councillor. He was elected as the Labour Member of Parliament (MP) for Portsmouth North at the 1997 general election until he retired in 2005. He was succeeded by Sarah McCarthy-Fry.\n\nHe had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He generally maintained a low profile around Parliament; he rarely contributed to debates and sat for four years on the low-key Accommodation and Works Committee.\n\nRapson appeared in the controversial TV programme Brass Eye, in which he was duped into presenting a segment on \"trust-me trousers\", supposedly worn by paedophiles and inflated to hide an erection. Rapson was also recorded stating: \"using an area of the Internet the size of Ireland, paedophiles can make your keyboard release toxic vapours that can make you more suggestible\". His complaints, and those of fellow MP Barbara Follett, that they had been duped into appearing on the programme, were thrown out by the Broadcasting Standards Commission in January 2002.\n\nRapson has two children and four grandchildren."}, {"url": "https://www.portsmouth.co.uk/news/politics/freedom-of-the-city-awarded-to-devoted-syd-1238735", "page_content": "And now former Portsmouth North MP Syd Rapson, pictured, can count himself among the honoured few to have been presented with the Freedom of the City.\n\nThe accolade, which was last handed to former Pompey boss Harry Redknapp and the side who won the FA Cup in 2008, is in recognition of Mr Rapson’s community work and outstanding conduct since leaving office.\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad\n\nCity council boss Donna Jones praised the him for his devotion to city life, saying Mr Rapson came to every council meeting even after retiring.\n\nSpeaking of Syd’s character, Cllr Jones added: ‘His heart is right in the centre of this city. He cares about Portsmouth.’\n\nThe award is the highest civic accolade that can be presented.\n\nIt arises from a medieval practice granting respected citizens freedom from slavery – and while the title does not come with special privileges today, the tradition of crowning someone a freeman or an organisation of freemen lives on.\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad\n\nMr Rapson is a life-long member of the Labour Party and was first elected to the city council in 1971.\n\nDuring his time on the council played a key role in supporting Portsmouth.\n\nLabour leader John Ferret said Mr Rapson had been ‘instrumental’ in saving the ferry port from being sold off.\n\n‘That decision has resulted in millions of pounds year on year being fed back into the city’s coffers,’ he added."}, {"url": "https://academickids.com/encyclopedia/index.php/Syd_Rapson", "page_content": "From Academic Kids\n\nSydney Norman John Rapson (born 17 April 1942) is a politician in the United Kingdom. He was Labour member of Parliament for Portsmouth North from 1997 until he stood down at the 2005 general election.\n\nTemplate:UK-politician-stub\n\nSyd Rapson was first elected to the Commons in 1997, after a long career in Portsmouth's local government, including stints as deputy leader of the council and as Lord Mayor.\n\nHe had stronger union credentials than many of his intake, having spent many years as an AEEU activist and convenor. In Portsmouth a previously Tory (Conservative) strong hold, Syd Rapson represented the real Labour party of the South and his victory marked the end of not only the Conservative but also the Liberal parties belief that the South was a Labour free zone. Syd Rapson, the man from an 'old school tradition' destroyed the belief touted by the Lib-Dem and Conservative Party that Labour was unelectable in south of England. The Labour party enjoyed healthy majorities in the three major economic, intellectual and industrial hubs (Portsmouth, Southampton and Brighton) of the south coast of England during his time in parliment.\n\nHis union links came from his career as an aircraft fitter, which also gave him the strong interest in defence which has been the hallmark of his parliamentary career.\n\nHe joined the Commons defence select committee after the 2001 election.\n\nHe generally has a very low profile around Parliament; he rarely contributes to debates and sat for four years on the low-key accommodation and works committee.\n\nHis moments of public prominence have all been connected to the anti-paedophile protests on the Paulsgrove Estate where he continues to live.\n\nHe caused controversy by describing the events as \"democracy in action\"."}, {"url": "https://www.liquisearch.com/syd_rapson", "page_content": "Sydney Norman John Rapson, a politician in the United Kingdom, was born on 17 April 1942 in the Isle of Wight and moved to the Paulsgrove area of Portsmouth as a young child. After leaving school he worked in the aeronautical industry for nearly forty years until becoming Labour Member of Parliament (MP) for Portsmouth North from 1997 until he stood down at the 2005 general election. A former long serving councillor, he was succeeded by Sarah McCarthy-Fry MP. He has two children and also has four grand children.\n\nHe had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career.\n\nHe joined the Commons Defence Select Committee after the 2001 election. He generally had a very low profile around Parliament; he rarely contributed to debates and sat for four years on the low-key Accommodation and Works Committee.\n\nRapson appeared in the controversial TV show Brass Eye, in which he was duped into presenting a segment on \"trust-me trousers\", supposedly worn by paedophiles and inflated to hide an erection. Rapson was also recorded stating: \"using an area of the Internet the size of Ireland, pedophiles can make your keyboard release toxic vapors that can make you more suggestible\"."}, {"url": "https://wikizero.com/www///Syd_Rapson", "page_content": "British politician (born 1942)\n\nSydney Norman John Rapson (born 17 April 1942) is a British former Labour politician who served as the MP for Portsmouth North from 1997 to 2005.\n\nEarly life [ edit ]\n\nRapson moved with his family to the Paulsgrove area of Portsmouth as a young child, where he attended Paulsgrove Modern (now King Richard School). After leaving school he worked in the aeronautical industry for nearly forty years and became a long serving councillor,[1] serving as Lord Mayor of Portsmouth in 1990.[2]\n\nPolitical career [ edit ]\n\nRapson was elected as the Labour Member of Parliament (MP) for Portsmouth North at the 1997 general election until he retired in 2005. He was succeeded by Sarah McCarthy-Fry.\n\nRapson stood for union improvement. He had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He sat for four years on the Accommodation and Works Committee.[citation needed]\n\nOther work [ edit ]\n\nIn 2001, Rapson was one of a number of MPs stung by the satirical Channel 4 documentary series Brass Eye, which filmed him for its controversial \"Paedogeddon!\" episode. He was filmed describing \"trust-me trousers\", which were supposedly worn by paedophiles and inflated to hide an erection. The programme-makers also persuaded him to say that paedophiles were using \"an area of internet the size of Ireland\". The MP complained to the Broadcasting Standards Commission that he had been duped into appearing on the show and that it had infringed his privacy. The BSC ruled against him, saying the means used to deceive the MPs \"were justified in the context of the serious issues raised by the programme\" and in particular \"the dangers of people in the public eye speaking with apparent authority about matters they do not understand\".[3]\n\nRapson led the team that headed the development of Portsmouth City's Gunwharf Quays, a large leisure and retail center located near the famous Portsmouth docks and the district of Portsea. The 'Quays' saw huge success, becoming the tourist capital of the city.\n\nIn 2018, Rapson was awarded the key of the city for his contributions and accomplishments in regard to representation and contributions for the city. This award was last given in 2008 and is only held by 32 others over a century of Portsmouth's history.\n\nRapson retired in 2005 and still lives in Portchester and Portsmouth to this day, with his wife Phyllis. He has two children and four grandchildren."}, {"url": "https://en-academic.com/dic.nsf/enwiki/251803", "page_content": "Sydney Norman John Rapson, known as Syd Rapson, a politician in the United Kingdom , was born on 17 April 1942 in the Isle of Wight and moved to the Paulsgrove area of Portsmouth as a young child [He attended Paulsgrove Modern (now King Richard School): Garlick,M: Memories of Wymering and Paulsgrove(1998, Hampshire WEA) HAM 30108] . After leaving school he worked in the aeronautical industry for nearly forty years until becoming Labour Member of Parliament (MP) for Portsmouth North from 1997 until he stood down at the 2005 general election. A former long serving councillor [\"Deputy Leader\" of the Council and Lord Mayor of the City: Voices from Paulsgrove: Lee,S & Stedman, J (Ed) (1992,Portsmouth City Council Leisure Department) ISBN 187041215X ] , he was succeeded by Sarah McCarthy-Fry MP.\n\nHe had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convenor. In Portsmouth, previously a Conservative Party stronghold, Rapson, a man from an \"old school\" tradition, disproved the claim of the Lib-Dem and Conservative parties that Labour was unelectable in the south of England. During his time in Parliament, the Labour party enjoyed healthy majorities in the three major economic hubs of the south coast of England: Portsmouth, Southampton and Brighton .\n\nHis union links came from his career as an aircraft fitter, which also gave him the strong interest in defence which has been the hallmark of his parliamentary career.\n\nHe joined the Commons Defence Select Committee after the 2001 election. He generally had a very low profile around Parliament; he rarely contributed to debates and sat for four years on the low-key Accommodation and Works Committee.\n\nRapson appeared in the controversial TV show Brass Eye , in which he was duped into presenting a segment on \"trust-me trousers\", supposedly worn by paedophiles and inflated to hide an erection.\n\nNotes\n\nExternal links"}, {"url": "https://wiki2.org/en/Syd_Rapson", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish politician (born 1942)\n\nSydney Norman John Rapson (born 17 April 1942) is a British former Labour politician who served as the MP for Portsmouth North from 1997 to 2005.\n\nEarly life\n\nRapson moved with his family to the Paulsgrove area of Portsmouth as a young child, where he attended Paulsgrove Modern (now King Richard School). After leaving school he worked in the aeronautical industry for nearly forty years and became a long serving councillor,[1] serving as Lord Mayor of Portsmouth in 1990.[2]\n\nPolitical career\n\nRapson was elected as the Labour Member of Parliament (MP) for Portsmouth North at the 1997 general election until he retired in 2005. He was succeeded by Sarah McCarthy-Fry.\n\nRapson stood for union improvement. He had stronger trade union credentials than many of the 1997 intake, having spent many years as an Amalgamated Engineering and Electrical Union activist and convener, which also gave him the strong interest in defence, the hallmark of his parliamentary career. He joined the Commons Defence Select Committee after the 2001 election. He sat for four years on the Accommodation and Works Committee.[citation needed]\n\nOther work\n\nIn 2001, Rapson was one of a number of MPs stung by the satirical Channel 4 documentary series Brass Eye, which filmed him for its controversial \"Paedogeddon!\" episode. He was filmed describing \"trust-me trousers\", which were supposedly worn by paedophiles and inflated to hide an erection. The programme-makers also persuaded him to say that paedophiles were using \"an area of internet the size of Ireland\". The MP complained to the Broadcasting Standards Commission that he had been duped into appearing on the show and that it had infringed his privacy. The BSC ruled against him, saying the means used to deceive the MPs \"were justified in the context of the serious issues raised by the programme\" and in particular \"the dangers of people in the public eye speaking with apparent authority about matters they do not understand\".[3]\n\nRapson led the team that headed the development of Portsmouth City's Gunwharf Quays, a large leisure and retail center located near the famous Portsmouth docks and the district of Portsea. The 'Quays' saw huge success, becoming the tourist capital of the city.\n\nIn 2018, Rapson was awarded the key of the city for his contributions and accomplishments in regard to representation and contributions for the city. This award was last given in 2008 and is only held by 32 others over a century of Portsmouth's history.\n\nRapson retired in 2005 and still lives in Portchester and Portsmouth to this day, with his wife Phyllis. He has two children and four grandchildren.\n\nReferences"}]}