{"Billy Barnie played as a catcher.": [{"url": "https://www.baseball-reference.com/bullpen/Billy_Barnie", "page_content": "William Harrison Barnie\n\n(Baid Billy)\n\nBats Unknown, Throws Unknown\n\nUnknown, Unknown Height 5' 7\", Weight 157 lb.\n\nBR page\n\nBiographical Information [ edit ]\n\n\"There was a standing remark that, like the lamented Harry Wright, Barnie was too good for professional base ball and too honest for his own good. . . But there was compensation better than dollars and cents in the universal respect which Barnie, like Harry Wright, enjoyed in the base ball world.\" - from Sporting Life's obituary of Billy Barnie\n\nBilly Barnie played four seasons in the majors and managed 14 years. His playing seasons were in 1874-1875, 1883, and 1886. During his playing days, his appearances were split about equally between catcher and outfield. As a catcher, he made 76 errors in 53 games, while as an outfielder he made 23 errors in 46 games. His batting average was .171. He began managing in 1882 and spent 9 years with the Baltimore Orioles in the American Association. He then managed three teams in the National League. None of his teams finished higher than 3rd. When he wasn't managing in the AA or the NL, Barnie managed the Scranton Coal Heavers in the Eastern League in 1895, the Hartford Bluebirds in the Atlantic League in 1896, and the Hartford Indians in the EL from 1899 until mid-1900. He also was an umpire in the National League and American Association between 1882 and 1892.\n\nSporting Life of July 21, 1900 carried his lengthy obituary, calling him \"one of the best known base ball men in the country\". It stated that he started in amateur ball at a very young age in 1865. He was primarily a catcher during his playing career, but when he became \"crippled in one hand\" he started to manage. In addition to a long career as a manager, he was also the organizer and part owner of the Hartford club. He was given credit for discovering a number of famous major leaguers, including King Kelly. He served on the rules and scheduling committees of the American Association and is responsible for at least one rule change that endures to this day, the creation of the Coaches box, down the two base lines. He made the suggestion to confine coaches to such a box after a number of team had taken to the habit of having their third base coach interfere in the play by running down with a baserunner in order to draw a throw, and do various other unsporting gestures; Arlie Latham of the St. Louis Browns was a particularly enthusiastic offender. The rule was adopted at his suggestion in the middle of the 1886 season.\n\n\n\n\n\nYear-by-Year Managerial Record [ edit ]\n\nFurther Reading [ edit ]\n\nMarty Payne: \"Beer Tanks and Barbed Wire: Bill Barnie and Baltimore\", in The Baseball Research Journal, SABR, Volume 42, Number 1 (Spring 2013), pp. 25-29."}, {"url": "https://ripbaseball.com/2018/12/06/grave-story-billy-barnie-1853-1900/", "page_content": "Here lies “Bald Billy” Barnie, a catcher/outfielder who went on to manage until the day he died. Literally. He played for the Hartford Dark Blues (1874), Keokuk Westerns (1875) and New York Mutuals (1875) of the National Assn. and the Baltimore Orioles (1883, 1886) of the American Assn. He also managed the Orioles (1883-91), Washington Senators (1892), Louisville Colonels (1893-4) and Brooklyn Bridegrooms (1897-8).\n\nA New York native, Barnie started playing on local teams in 1870 before turning pro. He joined Hartford in 1874 and, as a rookie, led the league… in strikeouts (with 13). He also had a .184/.188./.226 slash line. The following season, he played in 10 games for the Keokuk (Iowa) Westerns, hitting .111. The Westerns folded after going 1-12 in their first 13 games, and Barnie signed on with the Mutuals as a backup to catcher/manager Nat Hicks. He had 5 hits in 34 at-bats for New York, bringing his 1875 batting average up to .129. Barnie would go on to insert himself into a few games when he was managing the Orioles and even had a .200 average in 17 games in 1883. All total, he hit .171 in 83 career games, with 55 hits, 23 RBIs and 32 runs scored.\n\nBarnie finished his full-time playing career in independent leagues. While nursing a hand injury in 1877 while playing for Buffalo of the League Alliance in 1877, the 24-year-old was given his first change to manage a ballclub. He’d play a few seasons more, including the San Francisco Knickerbockers of the Pacific League, but his future in baseball would lie in managing.\n\nBarnie was a part of The Baseball Convention of 1881, which gave rise to the American Association as a competitor to the National League. Earlier that year, he’d helped organize the Eastern Championship Association and ran the Brooklyn Atlantics team, so he was already familiar with getting a new league off the ground. He wanted a team of his own, but his financial backing was lacking. He and his partner A.J. Houck did get the Baltimore franchise in late 1882, and Barnie would spend the next 9 years as its manager.\n\nThe Orioles didn’t see that much success under Barnie’s tenure as part owner and manager, finishing as high as third just once. The Baltimore Sun said, “…his kind-hearted and easy-going ways causing players to impose on him and preventing him from making changes at times that would have been of benefit.” He was succeeded by Ned Hanlon who, in his quietly ruthless way, made the changes that needed to be made for the good of the team. The Orioles would go on to win the AA championship three times under Hanlon.\n\nBarnie agreed to helm the NL’s Senators in 1892. That arrangement lasted just 2 games. It seems like there was a power struggle between Barnie and the new owner. The Boston Globe reported on January 7 that Washington’s shareholders put Barnie in charge of the club. Ten days later, though, it was reported that George Wagner had acquired 26 of the 29 shares, giving him absolute power. The Senators started the season with two losses, and Barnie, though he said he was given the change to manage for the whole season, was let go. No reason was given for his termination, he said.\n\nBarnie spent the rest of his life bouncing between managerial assignments in the National League and independent leagues. His time in Louisville ended when the 1895 Colonels won just 35 games while losing 95. His final run in the National League with the Bridegrooms lasted until 1898, when he was fired by Brooklyn as one of Charles Ebbets’ first moves as the new owner. In 14 years as a pro manager, he went 470-548 for a .462 win %. He was credited with mentoring stars like King Kelly, Matt Kilroy and Mike Griffin. Ironically, Griffin would eventually be Barnie’s replacement as the Brooklyn manager, following Ebbets’ short-lived attempt at managing his own team.\n\nBarnie kept managing in the Eastern League, first in Springfield and then, until his death, in Hartford. Though he was said to be the “picture of health” when he went to attend an Elks meeting in Atlantic City in early July 1900, he took ill. He returned to Hartford and died there on July 15 of pneumonia. He was 47 years old. Barnie is buried in the Paterson Family plot in Green-Wood Cemetery in Brooklyn, N.Y.\n\nOddly, it was the second time that an Elks meeting in Atlantic City proved to be disastrous to his health. Barnie, along with several others, was injured in a stage collapse at an Elks meeting in 1896. He had been entertaining the crowd by singing when the accident occurred. His obituary stated that he never fully recovered from his unspecified injuries.\n\nAdvertisement"}, {"url": "http://www.members.tripod.com/bb_catchers/catchers/mg_barnie.htm", "page_content": "TM/L\n\nG\n\nW\n\nL\n\nPCT\n\nM/Y\n\n\n\n\n\nW-EXP\n\n\n\nA-E\n\n\n\nStanding\n\nTeam and League\n\nGames managed (including ties)\n\nWins\n\nLosses\n\nPercentage of games won\n\nManager/Year (The latter number indicates how many managers the team employed that year, while the former indicates the chronological position of the manager [i.e. 1-2 would mean this manager was the first of two managers during that year]).\n\nExpected Wins. Calculated for the team based on its actual runs scored and allowed. A team that allows exactly as many runs as it scores is predicted to play .500 ball.\n\nActual Wins Minus Expected Wins (A measure of the extent to which a team outperformed (or underperformed) its talent. (Over time this reflects good/bad managing).\n\nTeam's final standing for the season or, in the case of multiple managers, the standings at the time the manager departed."}, {"url": "https://prabook.com/web/billy.barnie/1752102", "page_content": "Billy Barnie\n\nbaseball player\n\nJanuary 26, 1853 (age 47) New York City\n\nBorn in New York City, he played as a right fielder in the National Association in 1874-1875. In 1883 he became manager of the Baltimore Orioles of the American Association. He appeared as a backup catcher that season, and also played two games in 1886, but otherwise did not take the field After leaving the Orioles following the 1891 season, he managed the Washington Senators (1892), Louisville Colonels (1893-1894) and Brooklyn Bridegrooms (1897-1898). His career managerial record consists of 632 wins and 810 losses. His best finish was third place with the 1887 Orioles. Barnie died in Hartford, Connecticut at the age of 47, of pneumonia complicated by asthmatic bronchitis, and was buried at Green-Wood Cemetery in Brooklyn, New New York"}, {"url": "https://www.baseball-reference.com/players/b/barnibi01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Billy Barnie born?\n\nBilly Barnie was born on January 26, 1853.\n\nWhere was Billy Barnie born?\n\nBilly Barnie was born in New York, NY.\n\nHow tall was Billy Barnie?\n\nBilly Barnie was 5-7 (170 cm) tall.\n\nHow much did Billy Barnie weigh when playing?\n\nBilly Barnie weighed 157 lbs (71 kg) when playing.\n\nHow many seasons did Billy Barnie play?\n\nBilly Barnie played 4 seasons.\n\nIs Billy Barnie in the Hall of Fame?\n\nBilly Barnie has not been elected into the Hall of Fame.\n\nWhat position did Billy Barnie play?\n\nBilly Barnie was a Catcher and Rightfielder.\n\nHow many hits did Billy Barnie have?\n\nBilly Barnie had 55 hits over his career.\n\nHow many home runs did Billy Barnie have?\n\nBilly Barnie had home runs over his career.\n\nWhat was Billy Barnie's average?\n\nBilly Barnie had a .171 average over his career.\n\nHow many teams has Billy Barnie played for?\n\nBilly Barnie played for 4 teams; the Hartford Dark Blues, New York Mutuals, Keokuk Westerns and Baltimore Orioles.\n\nWhen did Billy Barnie retire?\n\nBilly Barnie last played in 1886.\n\nWhat are Billy Barnie's nicknames?\n\nBald Billy is a nickname for Billy Barnie."}, {"url": "http://bb_catchers.tripod.com/catchers/barnie.htm", "page_content": "Full Name: William Harrison \"Bald Billy\" Barnie\n\nBats: Not Available Throws: Not Available\n\nHeight: 5'7\"\n\nWeight: 157 lbs.\n\nBorn: Jan 26, 1853 in New York, NY\n\nMajor League Debut: May 07, 1874\n\nDied: Jul 15, 1900 in Hartford, CT\n\n"}, {"url": "https://baseballhistorian.com/players.cfm?lookie_player=barnibi01", "page_content": "Baseball History\n\nAlthough best known as a long-time major league manager mainly with the Baltimore Orioles, Billy Barnie started as an early pioneer player in professional baseball history. He broke into pro ball with Hartfords of the National Association in 1874 under manager Lip Pike during the dead ball era. In that season Billy Barnie batted .184 in 184 at bats spanning 45 games. Defensively he played 23 games as a catcher, 21 in RF and 1 game at shortstop.\n\nThe next year, 1875, Billy Barnie played 10 games with the New York Mutuals and 10 games with the Keokuk Westerns, splitting his time equally defensively with 10 games in the outfield and 10 games as a catcher. After the National Association folded at season’s end, he played locally.\n\nManaging during the Dead Ball Era:\n\nIn 1883 with the start of a new major league, the American Association, AA, Bald Billy Barnie started managing the Baltimore Orioles and managed the team until 1889. Then managed the following teams: Buffalo/Brooklyn AA 1890… Philadelphia Athletics AA 1891… Bal Orioles AA 1891… Washington Nationals of the National League 1892… Louisville NL 1893-94… Brooklyn 1897-98. He posted his best records as a manager with the 1884 Baltimore Orioles, 63-43, and the 1887 Orioles with a 77-58 record."}, {"url": "http://arslongaartcards.com/cards/beginnings-1880s/billy-barnie/", "page_content": "Card series: Beginnings: 1880's\n\nBeginnings: 1880's City: Baltimore\n\nBaltimore Team: Orioles\n\nOrioles League: American Association\n\nWilliam Harrison Barnie (1853-1900) played catcher/OF for three National Association teams in the 1870s prior to beginning an extensive career as manager. Nicknamed “Bald Billy,” Barnie struck a distinguished pose for the Old Judge photographer during his days with the Orioles, the club he led for nine years. Billy left Baltimore following the 1891 season for a very brief turn with the Senators before managing Louisville and Brooklyn for two years each. Barnie’s frail health felled him a mere two years after his final campaign with the Bridegrooms, dying of pneumonia at age 47."}, {"url": "https://www.liquisearch.com/billy_barnie", "page_content": "As Player\n\nHartford Dark Blues - (1874)\n\nKeokuk Westerns - (1875)\n\nNew York Mutuals - (1875)\n\nBaltimore Orioles - (1883), (1886)\n\nAs Manager\n\nBaltimore Orioles - (1883–1891)\n\nWashington Senators - (1892)\n\nLouisville Colonels - (1893–1894)\n\nBrooklyn Bridegrooms - (1897–1898)\n\nWilliam Harrison Barnie (January 26, 1853 – July 15, 1900), nicknamed \"Bald Billy,\" was an American manager and catcher in Major League Baseball. Born in New York City, he played as a right fielder in the National Association in 1874-1875. In 1883 he became manager of the Baltimore Orioles of the American Association; he appeared as a backup catcher that season, and also played two games in 1886, but otherwise did not take the field. After leaving the Orioles following the 1891 season, he managed the Washington Senators (1892), Louisville Colonels (1893–1894) and Brooklyn Bridegrooms (1897–1898). His career managerial record consists of 632 wins and 810 losses. His best finish was third place with the 1887 Orioles.\n\nBarnie died in Hartford, Connecticut at the age of 47, of pneumonia complicated by asthmatic bronchitis, and was buried at Green-Wood Cemetery in Brooklyn, New York."}, {"url": "https://hos-new.herokuapp.com/player/barnibi01", "page_content": "Over the course of his career, Billy Barnie made 326 plate appearances. Barnie was worth -2.7 Wins Above Replacement and -3.7 Wins Above Average.\n\nAfter adjusting for length of schedule, catchers, and relief pitchers, the -2.7 WAR becomes -6.5 adjWAR. Then, WAA is adjusted by ignoring negative seasons (thus, truly capturing a player’s peak seasons) and making similar adjustments for catchers and relief pitchers. After these adjustments, the -3.7 WAA becomes 0.0 adjWAA.\n\nThen, the adjWAR and adjWAA are combined, but with extra weighting given to adjWAA. This gives Barnie -6.5 wWAR. wWAR is then converted to Hall Rating. A Hall Rating of 100 represents the Hall of Stats borderline (similar to OPS+ or wRC+, where 100 represents league average).\n\nBilly Barnie has a Hall Rating of -6, leaving him nowhere close to induction to the Hall of Stats.\n\nWant even more detail about the formula? See the About page."}], "Billy Barnie played as a third baseman.": [{"url": "https://prabook.com/web/billy.barnie/1752102", "page_content": "Billy Barnie\n\nbaseball player\n\nJanuary 26, 1853 (age 47) New York City\n\nBorn in New York City, he played as a right fielder in the National Association in 1874-1875. In 1883 he became manager of the Baltimore Orioles of the American Association. He appeared as a backup catcher that season, and also played two games in 1886, but otherwise did not take the field After leaving the Orioles following the 1891 season, he managed the Washington Senators (1892), Louisville Colonels (1893-1894) and Brooklyn Bridegrooms (1897-1898). His career managerial record consists of 632 wins and 810 losses. His best finish was third place with the 1887 Orioles. Barnie died in Hartford, Connecticut at the age of 47, of pneumonia complicated by asthmatic bronchitis, and was buried at Green-Wood Cemetery in Brooklyn, New New York"}, {"url": "https://www.espn.com/mlb/story/_/page/mlbrank_top10thirdbasemen/ranking-top-10-third-basemen-ever", "page_content": "Do you want big names? Big numbers? Big personalities? Welcome to All-Time #MLBRank, our ranking of the top 100 players in baseball history.\n\nTo create our list, an ESPN expert panel voted on thousands of head-to-head matchups of 162 players, based on both peak performance and career value.\n\nThe top 100 will roll out next week. This week, we bring you the top 10 at each position. Thursday brings the top 10 infielders by position of all time, followed by pitchers and catchers on Friday.\n\nHave fun!\n\nTOP 10 THIRD BASEMEN\n\nJoin the discussion by using the #MLBRank hashtag, and follow along @BBTN and on Facebook.\n\n10. Ron Santo\n\nFocus on Sport/Getty Images\n\nTeams\n\nChicago Cubs (1960-73), Chicago White Sox ('74)\n\nHonors\n\nNine-time NL All-Star (1963-66, '68-69, '71-73), five Gold Gloves ('64-68), Hall of Fame (2012)\n\nChampionships\n\nNone\n\nCareer stats\n\n.277/.362/.464, OPS -- .826, Hits -- 2,254, HRs -- 342, RBIs -- 1,331\n\nThe player\n\nHis Hall of Fame case was a heated debate for years until the Veterans Committee finally elected him, after he had passed away. He should have gone in much sooner as the National League's premier third baseman of the 1960s, a player with power, on-base ability and Gold Glove defense. -- David Schoenfield, ESPN.com senior writer\n\nOne of the victims of the Hall of Fame's frequently clueless processes for recognizing its best, Santo ranks ninth all time among third basemen in WAR, sixth all time in offensive WAR and fourth all time in WAR across his best seven seasons. That the electorate missed everything he was doing on the field is an indictment of them, not him. -- Christina Kahrl, ESPN.com MLB writer\n\n9. Edgar Martinez\n\nSporting News/Getty Images\n\nTeams\n\nSeattle Mariners (1987-2004)\n\nHonors\n\nFive Silver Sluggers (1992, '95, '97, 2001, '03), seven-time All-Star ('92, '95-97, '00-01, '03)\n\nChampionships\n\nNone\n\nCareer stats\n\n.312/.418/.515, OPS -- .933, Hits -- 2,247, HRs -- 309, RBIs -- 1,261\n\nThe player\n\nMartinez gets a bum rap for being a designated hitter for most of his career, because he should really be celebrated for his accomplishments with the bat. He batted .312/.418/.515 in a career of 2,055 games. Only Jimmie Foxx, Lou Gehrig, Rogers Hornsby, Babe Ruth and Ted Williams had better numbers than Martinez in all three triple-slash categories while appearing in at least as many games in their careers, and all of them are in the Hall of Fame. -- Tristan Cockcroft, ESPN.com senior writer\n\nYes, he's really a DH more than a third baseman, although he did play more than 500 games there and was moved only because of injuries and not an inability to play the position. His peers regarded him as maybe the best right-handed hitter in the game while active, a doubles machine who hit .312 lifetime with an OBP over .400. The greatest DH of all time? Well, his career WAR is significantly higher than David Ortiz's. Just sayin'. -- Schoenfield\n\n8. Adrian Beltre\n\nRonald Martinez/Getty Images\n\nTeams\n\nLos Angeles Dodgers (1998-2004), Seattle Mariners ('05-09), Boston Red Sox ('10), Texas Rangers ('11-present)\n\nHonors\n\nNL Silver Slugger ('04), three AL Silver Sluggers ('10-11, '14), four AL Gold Gloves ('07-08, '11-12), four-time AL All-Star (2010-12, '14)\n\nChampionships\n\nNone\n\nCareer stats*\n\n285/.337/.476, OPS -- .813, Hits -- 2,856, HRs -- 425, RBIs -- 1,522\n\n*Stats through July 10, 2016\n\nThe player\n\nBeltre has always received recognition for his glove, but I don't know that people realize how good a hitter he is. He has 11 seasons of at least 250 total bases, tied with Mike Schmidt and Eddie Mathews for the lead at the position, eight seasons of at least 25 home runs, and his 404 career homers hit while playing third base trail only Schmidt (509) and Mathews (461). -- Cockcroft\n\nLate in his career, everyone has come around to appreciate his greatness, and he's now widely considered a future Hall of Famer. He's going to reach 3,000 hits -- he's already over 2,800 -- and will come close to 500 home runs, a credit to his durability and aging well as he enters his late 30s. In his prime, he was a gifted third baseman, one of the best ever at charging bunts. -- Schoenfield\n\nIf he's elected to the Hall of Fame -- and his candidacy grows exponentially with each passing year -- maybe he finally will allow someone to pat him on the head. Have you ever seen a player look more impressive making flat-footed, sometimes-sidearm throws from third base? -- Scott Lauber, ESPN.com Red Sox reporter\n\n7. Paul Molitor\n\nRonald C. Modra/Sports Imagery/Getty Images\n\nTeams\n\nMilwaukee Brewers (1978-92), Toronto Blue Jays ('93-95), Minnesota Twins ('96-98)\n\nHonors\n\nSeven-time All-Star (1980, '85, '88, '91-94), four Silver Sluggers ('87-88, '93, '96), World Series MVP (1993), Hall of Fame (2004)\n\nChampionships\n\n1 -- Toronto (1993)\n\nCareer stats\n\n.306/.369/.448, OPS -- .817, Hits -- 3,319, HRs -- 234, RBIs -- 1,307\n\nThe player\n\nThe first time I saw Paul Molitor play, he had two hits. Or at least I assume he did. Because Molly always had two hits. Unless he had more. Some might downgrade him for his time as a designated hitter, but they're missing the point -- hitter is the only word that should come to mind when you are talking about Molitor. His 3,319 career hits say that loud and clear. -- Dan Mullen, ESPN.com senior MLB editor\n\nDavid Ortiz was all ears when the Twins called him up to play with Molitor in 1997. It's no wonder. Molitor is the only player in the post-integration era with at least 3,000 hits, a .300 lifetime average and 500 steals. -- Lauber\n\nHe could have played shortstop for the Brewers, but there was a guy named Robin Yount there. On offense, he had the shortest swing, the fastest hands and was one of the best baserunners in baseball history. His 39-game hitting streak for Team Streak in 1987 captured the nation's attention. Ted Williams once praised Molitor's swing as the closest thing he'd seen to Joe DiMaggio's. If it was good enough for Teddy Ballgame, it's good enough for me -- and should be for you, too. -- Rob Peterson, ESPN.com senior MLB editor\n\n6. Wade Boggs\n\nAP Photo/Elise Amendola\n\nTeams\n\nBoston Red Sox (1982-92), New York Yankees ('93-97), Tampa Bay Rays ('98-99)\n\nHonors\n\nEight Silver Sluggers (1983, '86-89, '91, '93-94), 12-time All Star ('85-96), two Gold Gloves ('94-95), Hall of Fame (2005)\n\nChampionships\n\n1 -- New York (1996)\n\nCareer stats\n\n.328/.415/.443, OPS -- .858, Hits -- 3,010, HRs -- 118, RBIs -- 1,014\n\nThe player\n\nIn his day, Boggs was actually underrated, as people focused on the lack of home runs and ignored the high OBPs in that generally pre-sabermetric era. But he won five batting titles -- since 1960, only Tony Gwynn topped Boggs' five .350 seasons -- six OBP crowns and topped 3,000 career hits even though he didn't reach the majors until he was 24 and drew all those walks. -- Schoenfield\n\nWhen Rich Donnelly was a coach with the Rangers, and Wade Boggs was hitting the ball all over the field every year, 200 hits a year, Donnelly devised a strategy to stop Boggs: \"All nine fielders should line up behind the pitcher's mound, and when the ball is released, they should just scatter. It would work better than it has been working.'' -- Tim Kurkjian, ESPN senior writer\n\n5. Brooks Robinson\n\nFocus on Sport/Getty Images\n\nTeams\n\nBaltimore Orioles (1955-77)\n\nHonors\n\n18-time All-Star (1960-74*), 16 Gold Gloves ('60-75), MVP (1964), All-Star MVP ('66), World Series MVP ('70), Hall of Fame ('83)\n\n*Played in two All-Star Games in '60, '61 and '62\n\nChampionships\n\n2 -- Baltimore (1966, '70)\n\nCareer stats\n\n.267/.322/.401, OPS -- .723, Hits -- 2,848, HRs -- 268, RBIs -- 1,357\n\nThe player\n\nThe all-time leader at third base in value generated on defense with 38.8 WAR on defense alone, Robinson is sort of like Bill Mazeroski at second base -- a big postseason performance or two plus best-ever defense plus a bat that's good enough gets you to Cooperstown. His '64 and '68 seasons are inner-circle awesome. -- Kahrl\n\nBrooks Robinson came before my time. I've seen the highlights, but I've never seen the man play live. But I know just how good he was at baseball's hot corner -- and you do, too -- because I have seen some pretty good third basemen play the game, and every time one of them makes an incredible play -- every time -- someone who has seen Robinson play says the EXACT same thing: \"Shades of Brooks Robinson.\" And there's no way they could all be wrong. -- Mullen\n\nBrooks Robinson drove in the only run in 10 1-0 victories in his career, a major league record. He is the nicest, unassuming great player ever. After Robinson's retirement, a Baltimore sportswriter said at a banquet, \"In New York, they named a candy bar after Reggie Jackson. Here in Baltimore, we name our children after Brooks Robinson.'' -- Kurkjian\n\n4. Chipper Jones\n\nAP Photo/Matt Sayles\n\nTeams\n\nAtlanta Braves (1993, 1995-2012)\n\nHonors\n\nEight-time All-Star (1996-98, 2000-01, '08, '11-12), MVP ('99), two Silver Sluggers ('99-00)\n\nChampionships\n\n1 -- Atlanta (1995)\n\nCareer stats\n\n.303/.401/.529, OPS -- .930, Hits -- 2,726, HRs -- 468, RBIs -- 1,623"}, {"url": "https://www.baseball-reference.com/players/b/barnibi01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Billy Barnie born?\n\nBilly Barnie was born on January 26, 1853.\n\nWhere was Billy Barnie born?\n\nBilly Barnie was born in New York, NY.\n\nHow tall was Billy Barnie?\n\nBilly Barnie was 5-7 (170 cm) tall.\n\nHow much did Billy Barnie weigh when playing?\n\nBilly Barnie weighed 157 lbs (71 kg) when playing.\n\nHow many seasons did Billy Barnie play?\n\nBilly Barnie played 4 seasons.\n\nIs Billy Barnie in the Hall of Fame?\n\nBilly Barnie has not been elected into the Hall of Fame.\n\nWhat position did Billy Barnie play?\n\nBilly Barnie was a Catcher and Rightfielder.\n\nHow many hits did Billy Barnie have?\n\nBilly Barnie had 55 hits over his career.\n\nHow many home runs did Billy Barnie have?\n\nBilly Barnie had home runs over his career.\n\nWhat was Billy Barnie's average?\n\nBilly Barnie had a .171 average over his career.\n\nHow many teams has Billy Barnie played for?\n\nBilly Barnie played for 4 teams; the Hartford Dark Blues, New York Mutuals, Keokuk Westerns and Baltimore Orioles.\n\nWhen did Billy Barnie retire?\n\nBilly Barnie last played in 1886.\n\nWhat are Billy Barnie's nicknames?\n\nBald Billy is a nickname for Billy Barnie."}, {"url": "https://bleacherreport.com/articles/10056495-ranking-the-top-25-third-basemen-of-the-2022-mlb-season", "page_content": "0 of 13\n\nAP Photo/Jeff Roberson\n\nIt's time to put a bow on the 2022 MLB season with Bleacher Report's final positional rankings.\n\nThroughout the year, we released monthly updates to our position-by-position rankings, selecting the top 10 players at each spot. Now we'll finalize those rankings while expanding the list to the 25 best at each position.\n\nJust like the regular-season rankings, past production and future expectations played no part in deciding the order—this is a rundown of the best and brightest of 2022.\n\nTo qualify for inclusion, a player had to have at least 200 plate appearances. Each player was only included at the position where he played the most innings. That notably excluded Bobby Witt Jr. (more innings at SS), Gunnar Henderson (132 PA), Mike Brosseau (160 PA), David Villar (181 PA) and Anthony Rendon (193 PA)\n\nLet's dive into the top 25 third basemen of the 2022 season.\n\nCatch up on the Top 25 in 2022 series: Catchers, First Basemen, Second Basemen, Shortstops"}, {"url": "https://ripbaseball.com/2018/12/06/grave-story-billy-barnie-1853-1900/", "page_content": "Here lies “Bald Billy” Barnie, a catcher/outfielder who went on to manage until the day he died. Literally. He played for the Hartford Dark Blues (1874), Keokuk Westerns (1875) and New York Mutuals (1875) of the National Assn. and the Baltimore Orioles (1883, 1886) of the American Assn. He also managed the Orioles (1883-91), Washington Senators (1892), Louisville Colonels (1893-4) and Brooklyn Bridegrooms (1897-8).\n\nA New York native, Barnie started playing on local teams in 1870 before turning pro. He joined Hartford in 1874 and, as a rookie, led the league… in strikeouts (with 13). He also had a .184/.188./.226 slash line. The following season, he played in 10 games for the Keokuk (Iowa) Westerns, hitting .111. The Westerns folded after going 1-12 in their first 13 games, and Barnie signed on with the Mutuals as a backup to catcher/manager Nat Hicks. He had 5 hits in 34 at-bats for New York, bringing his 1875 batting average up to .129. Barnie would go on to insert himself into a few games when he was managing the Orioles and even had a .200 average in 17 games in 1883. All total, he hit .171 in 83 career games, with 55 hits, 23 RBIs and 32 runs scored.\n\nBarnie finished his full-time playing career in independent leagues. While nursing a hand injury in 1877 while playing for Buffalo of the League Alliance in 1877, the 24-year-old was given his first change to manage a ballclub. He’d play a few seasons more, including the San Francisco Knickerbockers of the Pacific League, but his future in baseball would lie in managing.\n\nBarnie was a part of The Baseball Convention of 1881, which gave rise to the American Association as a competitor to the National League. Earlier that year, he’d helped organize the Eastern Championship Association and ran the Brooklyn Atlantics team, so he was already familiar with getting a new league off the ground. He wanted a team of his own, but his financial backing was lacking. He and his partner A.J. Houck did get the Baltimore franchise in late 1882, and Barnie would spend the next 9 years as its manager.\n\nThe Orioles didn’t see that much success under Barnie’s tenure as part owner and manager, finishing as high as third just once. The Baltimore Sun said, “…his kind-hearted and easy-going ways causing players to impose on him and preventing him from making changes at times that would have been of benefit.” He was succeeded by Ned Hanlon who, in his quietly ruthless way, made the changes that needed to be made for the good of the team. The Orioles would go on to win the AA championship three times under Hanlon.\n\nBarnie agreed to helm the NL’s Senators in 1892. That arrangement lasted just 2 games. It seems like there was a power struggle between Barnie and the new owner. The Boston Globe reported on January 7 that Washington’s shareholders put Barnie in charge of the club. Ten days later, though, it was reported that George Wagner had acquired 26 of the 29 shares, giving him absolute power. The Senators started the season with two losses, and Barnie, though he said he was given the change to manage for the whole season, was let go. No reason was given for his termination, he said.\n\nBarnie spent the rest of his life bouncing between managerial assignments in the National League and independent leagues. His time in Louisville ended when the 1895 Colonels won just 35 games while losing 95. His final run in the National League with the Bridegrooms lasted until 1898, when he was fired by Brooklyn as one of Charles Ebbets’ first moves as the new owner. In 14 years as a pro manager, he went 470-548 for a .462 win %. He was credited with mentoring stars like King Kelly, Matt Kilroy and Mike Griffin. Ironically, Griffin would eventually be Barnie’s replacement as the Brooklyn manager, following Ebbets’ short-lived attempt at managing his own team.\n\nBarnie kept managing in the Eastern League, first in Springfield and then, until his death, in Hartford. Though he was said to be the “picture of health” when he went to attend an Elks meeting in Atlantic City in early July 1900, he took ill. He returned to Hartford and died there on July 15 of pneumonia. He was 47 years old. Barnie is buried in the Paterson Family plot in Green-Wood Cemetery in Brooklyn, N.Y.\n\nOddly, it was the second time that an Elks meeting in Atlantic City proved to be disastrous to his health. Barnie, along with several others, was injured in a stage collapse at an Elks meeting in 1896. He had been entertaining the crowd by singing when the accident occurred. His obituary stated that he never fully recovered from his unspecified injuries.\n\nAdvertisement"}, {"url": "https://www.nytimes.com/1978/04/01/archives/billy-cox-58-a-dodger-standout-as-third-baseman-in-early-50s-born.html", "page_content": "Third base is known as the “hot corner” because it is one of the most dangerous positions and balls are generally hit sharply that way. A third baseman has to be exceptionally quick and agile and gifted with sharp eyesight so that he can follow the ball's movement from the bat into his glove. Always there is the danger of a freakish hop that can injure any part of the face or body.\n\nCox could field the hot grounder from any direction, with gloved or bare hand. The other difficulty in playing third base is the ability to throw, swiftly and accurately, to first base. Cox made that long throw with a strong arm.\n\nCox helped the Dodgers win three pennants and he was especially outstanding, at the plate and at third base, in the 1952 World Series. George Kell, a third baseman with the Boston Red Sox, said “I never dreamed third base could be played with such artistry until I saw Cox in that Series.”\n\nStrangely, for all his ability with the glove, Cox once tied the National League record of three errors in one inning. It happened in the eighth inning of a game on Aug. 6, 1949, at Cincinnati, where the Dodgers lost to the Reds, 5‐2.\n\nHis first mistake was a high throw to Gil Hodges at first. Next, on a force play, he fumbled the grounder so many times he could not get his man. Finally, he dropped a throw for another force at his base."}, {"url": "https://en-academic.com/dic.nsf/enwiki/4731948", "page_content": "Infobox MLB retired\n\nbgcolor1=#ba0021\n\nbgcolor2=#0f437c\n\ntextcolor1=white\n\ntextcolor2=white\n\n\n\n\n\nname=Billy Barnie\n\nposition=Manager/ Catcher / Right fielder\n\nbats=Unknown\n\nthrows=Right\n\nbirthdate= January 26 1853\n\ncity-state|New York|New York\n\ndeathdate= death date and age|1900|7|15|1853|1|26\n\ncity-state|Hartford|Connecticut\n\ndebutdate= May 7\n\ndebutyear= by|1874\n\ndebutteam= Hartford Dark Blues\n\nfinaldate= June 28\n\nfinalyear= by|1886\n\nfinalteam=Baltimore Orioles\n\nstat1label= Batting average\n\nstat1value=.171\n\nstat2label= Home run s\n\nstat2value=0\n\nstat3label=Runs Batted In\n\nstat3value=23\n\nteams= As Player\n\n* Hartford Dark Blues - ( by|1874 )\n\n* Keokuk Westerns - ( by|1875 )\n\n* New York Mutuals - ( by|1875 )\n\n*Baltimore Orioles - ( by|1883 ), ( by|1886 )As Manager\n\n*Baltimore Orioles - ( by|1883 – by|1891 )\n\n* Washington Senators - ( by|1892 )\n\n* Louisville Colonels - ( by|1893 – by|1894 )\n\n*Brooklyn Bridegrooms - ( by|1897 – by|1898 )\n\nhighlights=\n\nWilliam Harrison Barnie ( January 26 1853 – July 15 1900 ), nicknamed \"Bald Billy,\" was an American manager and catcher in Major League Baseball . Born in New York City , he played as a right fielder in the National Association in 1874-1875. In 1883 he became manager of the Baltimore Orioles of the American Association; he appeared as a backup catcher that season, and also played two games in 1886, but otherwise did not take the field. After leaving the Orioles following the 1891 season, he managed the Washington Senators (1892), Louisville Colonels (1893-1894) and Brooklyn Bridegrooms (1897-1898). His career managerial record consists of 632 wins and 810 losses. His best finish was third place with the 1887 Orioles. [ [ http://www.baseball-reference.com/managers/barnibi01.shtml Baseball Reference manager page ] ]\n\nBarnie died in Hartford, Connecticut at the age of 47, of pneumonia complicated by asthmatic bronchitis [ [ http://www.thedeadballera.com/tooyoung.html The Dead Ball Era ] ] , and was laid to rest at Green-Wood Cemetery in Brooklyn , New York . [ [ http://www.baseball-almanac.com/players/player.php?p=barnibi01 Baseball Almanac ] ]\n\nReferences\n\nExternal links\n\n* [ http://www.baseball-reference.com/managers/barnibi01.shtml Baseball-Reference.com ] - career managing record and playing statistics"}, {"url": "https://www.baseball-reference.com/bullpen/Billy_Barnie", "page_content": "William Harrison Barnie\n\n(Baid Billy)\n\nBats Unknown, Throws Unknown\n\nUnknown, Unknown Height 5' 7\", Weight 157 lb.\n\nBR page\n\nBiographical Information [ edit ]\n\n\"There was a standing remark that, like the lamented Harry Wright, Barnie was too good for professional base ball and too honest for his own good. . . But there was compensation better than dollars and cents in the universal respect which Barnie, like Harry Wright, enjoyed in the base ball world.\" - from Sporting Life's obituary of Billy Barnie\n\nBilly Barnie played four seasons in the majors and managed 14 years. His playing seasons were in 1874-1875, 1883, and 1886. During his playing days, his appearances were split about equally between catcher and outfield. As a catcher, he made 76 errors in 53 games, while as an outfielder he made 23 errors in 46 games. His batting average was .171. He began managing in 1882 and spent 9 years with the Baltimore Orioles in the American Association. He then managed three teams in the National League. None of his teams finished higher than 3rd. When he wasn't managing in the AA or the NL, Barnie managed the Scranton Coal Heavers in the Eastern League in 1895, the Hartford Bluebirds in the Atlantic League in 1896, and the Hartford Indians in the EL from 1899 until mid-1900. He also was an umpire in the National League and American Association between 1882 and 1892.\n\nSporting Life of July 21, 1900 carried his lengthy obituary, calling him \"one of the best known base ball men in the country\". It stated that he started in amateur ball at a very young age in 1865. He was primarily a catcher during his playing career, but when he became \"crippled in one hand\" he started to manage. In addition to a long career as a manager, he was also the organizer and part owner of the Hartford club. He was given credit for discovering a number of famous major leaguers, including King Kelly. He served on the rules and scheduling committees of the American Association and is responsible for at least one rule change that endures to this day, the creation of the Coaches box, down the two base lines. He made the suggestion to confine coaches to such a box after a number of team had taken to the habit of having their third base coach interfere in the play by running down with a baserunner in order to draw a throw, and do various other unsporting gestures; Arlie Latham of the St. Louis Browns was a particularly enthusiastic offender. The rule was adopted at his suggestion in the middle of the 1886 season.\n\n\n\n\n\nYear-by-Year Managerial Record [ edit ]\n\nFurther Reading [ edit ]\n\nMarty Payne: \"Beer Tanks and Barbed Wire: Bill Barnie and Baltimore\", in The Baseball Research Journal, SABR, Volume 42, Number 1 (Spring 2013), pp. 25-29."}, {"url": "https://ladodgertalk.com/2019/10/23/dodgers-third-baseman-and-his-playmaker/", "page_content": "Last Wednesday, I wrote an article on Rube Walker – the Father of the Five-Man Rotation – which drew some comments for which I was grateful. Presently, I am not in mourning over the Dodgers untimely exit from post-season play. It happened, it is over, and life goes on. With my ninth decade now staring me in the face each year without one more WS victory is a bit problematic, but gifted with excellent health I plan to be around for a few more attempts to snatch the brass ring. I look forward to those attempts rather than looking back to a failed one.\n\nIn the meantime, my enthusiasm for baseball has not diminished because of a loss. The game, the Dodgers, my favorite players have given me so much over the years that there is always something to fall back on when things don’t go as well as I had hoped. For me, I often fall back to the Boys of Summer but I also look ahead to the youngsters on the horizon in the minor leagues. Both of those venues are safe and still provide enjoyment.\n\nI love the game of baseball, I expect because I played some as a youngster and later played some fastball as a young man. It is an individual game played as a team. I was never much of a hitter but I could if you will permit some bragging, “go get ‘em” with the best players. That is, I was an excellent defender and loved playing in the field, especially leftfield as there were very few left-handed batters.\n\nBecause of my ability to play in the field, I reveled in Vin’s descriptions as the Dodgers in the fifties made plays behind their pitchers. And, plays they did make. Duke scaling the wall at Ebbets Field or climbing the vines at Wrigley Field or hearing Vin describe Carl Furillo, the “Reading Rifle”, taking caroms off the rightfield wall almost as a virtuoso uses the keys on a piano. I remember him describing Pee Wee and Jackie ranging wide and making double plays and his description of former catcher Gil Hodges at first base with hands “as soft as silk”. Oh yes, and Campy blocking balls in the dirt before blocking balls in the dirt was cool and throwing out 57 percent of all would-be base stealers.\n\nI also have another recollection, brought forward by some comments in response to the Rube Walker article on October 16.\n\nDodgerBlueMom wrote: “And AC. You and I share something in common, Brooks Robinson. He is my favorite 3rd baseman. I called him “the vacuum cleaner at third”! I was fortunate to see him play as a minor league player with the Mounties in BC. I followed his career with Baltimore along with being an avid Dodger fan and loved the antics of Earl Weaver.”\n\n59inarow replied: “Brooks was a little before my time. I always thought that Graig Nettles was the Gold Standard at the hot corner, but Ron Cey was my favorite Dodger growing up as a kid.”\n\nAlways Compete added: “As DBMom said, Brooks is the one that everyone else is compared to.”\n\nThose comments took me back to the little known and perhaps under appreciated complement to the Roy Campanella, Gil Hodges, Jackie Robinson, Pee Wee Reese infield. He definitely was not underappreciated by his teammates. How many remember or have even heard of the third baseman that complemented that infield?\n\nMany of the LADT readers are too young to have witnessed him play or to have heard about him because he never achieved all-star status, even once, as all of his infield teammates have done. Three of them – Jackie, Pee Wee, and Campy – are in the HOF and Gil Hodges should be, at least in my opinion.\n\nFor those who are not familiar with the invisible infielder, let me introduce you to Newport, Pennsylvania’s favorite son, Billy Cox, who was the complement to that revered infield. He attended high school in his hometown and following graduation from high school he played with Harrisburg of the Interstate League and achieved All-Star status as a shortstop.\n\nIn 1941 Cox led the Interstate League in batting, hits, doubles and total bases for Harrisburg. He had a 22-game hitting streak, hit .368 and set a league record for most assists as a shortstop. He was called up to Pittsburgh and debuted on September 20 and hit .270 in 10 games with the Pirates.\n\nThat was all the professional baseball he would play until the spring of 1946, with one exception. In February of 1942, he had entered the military service and spent four years with the 814th Signal Corps. The one exception was an exhibition game on May 28, 1942, between the Pittsburgh Pirates and the Harrisburg Senators of the Inter-State League. Billy Cox was given a special dispensation to play with the Pirates on that day and registered four runs in their 14-5 win.\n\nFor the next four years, he served his country seeing action in North Africa, Europe, and Guadalcanal. Dealing with the sands of North Africa and the swamps and mud of Europe, along with contracting Malaria, his weight fell to 132 pounds on his 5’9” frame. His health never really fully recovered following the war.\n\nIntent on resuming his baseball career, the 26-year-old Cox never complained: “I lost a good part of my career,” he told The Sporting News on May 2, 1946, “but I’m not kicking. I went through four years of the war and came out whole, so I guess I am lucky.”\n\nHe returned to active duty as an MLB player with the Pirates in 1946 and played two seasons with them, as a shortstop, hitting a combined .280. In December of 1947, he was traded to the Dodgers, along with right-hander Preacher Roe, in a deal that sent Dodger’s favorite, 37- year- old Dixie Walker, to Pittsburgh. Many Dodger fans were incensed to lose Walker known affectionately as, “The People’s Choice”. Walker apparently had demanded a trade because he did not want to play on a team that included Jackie Robinson.\n\nHowever, those same fans soon came to believe it was one of the greatest trades ever made by Branch Rickey. Both Billy Cox and Preacher Roe went on to have seven-year careers with the Dodgers. Dixie Walker had two with the Pirates before retiring.\n\nCox, a shortstop with the Pirates, came over to the Dodgers with Pee Wee Reese firmly entrenched as the shortstop. Reese would go on to play 16 years with the Dodgers, missing three war years, and with 2014 games played at short.\n\nInitially assigned to third base by manager Leo Durocher, and to a position he had never played, Cox quickly took over and played defense at the hot corner like no other third baseman at that time.\n\nCox later acknowledged that he didn’t know anything about playing third base: “They just expected me to play it by ear.” Like Carl Furrilo playing the caroms off the rightfield wall, Billy Cox was a virtuoso at third base snagging line drives and smothering ground balls most third baseman could only dream of corralling.\n\nWalter O’Malley, then president of the Dodgers, said, “We regard Cox as the greatest gloveman Brooklyn ever had.” That was not just the greatest third baseman but the greatest, “gloveman.”\n\nHis most productive year offensively with the Dodgers was 1953. During the regular season, he hit .291 in 100 games played and followed that up with a .304 average in the World Series against the Yankees and had a team-leading six runs batted in.\n\nDuring those seven years with the Dodgers, Billy Cox and his war-ravaged body only once was able to play more than 119 games in a single season. He struggled to maintain his weight and suffered from what we call PTSD nowadays. Cox didn’t really talk about it but at times it did show. Harold Burr of the Brooklyn Daily Eagle wrote about one incident when the Pirates were playing in Boston, and a ballpark fireworks display sent Cox plunging for cover in the dugout. The roar of the crowd could also trigger a moment of terror. Cox told his teammates he was never wounded in action, though his helmet was once blown off by an explosion.\n\nIn 1955 he was traded to the Orioles and played his last 53 games with Baltimore. Unfortunately, his trade to the Orioles meant he missed the Dodgers 1955 World Series victory over the New York Yankees.\n\nBilly Cox is not listed on any list of the Top 100 MLB third baseman and perhaps would not be among the top 150 or more. The shortness of his career pretty much excludes him and corner infielders are supposed to have thunder in their bats. The 5’10”/150-pound right-handed hitter did not have thunder in his bat. What made him special was the lightening in his glove as testified by his teammates and opponents.\n\nHis teammate Duke Snider – on a Montreal Expo broadcast – commented on Billy Cox and his glove following Cox’s death in 1978 at the age of 58. “If there was ever a better third baseman I’d like to have seen him. The thing I remember about Billy was that little three-fingered glove he used. They called it the ‘playmaker.’ There would be a ball that looked like it was by him and somehow, he’d come up with it. Then he’d seem to look at it for a minute before throwing the runner out.”\n\nFormer Dodger manager, Chuck Dressen, agreed with Duke Snider: “It’s almost as if he’s counting the stitches. But he never seems to get in trouble because he has such quick hands.”\n\nA fan remembered a member of the Dodger announcing team describing Cox’s hesitation with the ball: “He checks to see if it’s broken, and throws to first for the out.\n\nHis hesitation in throwing to first just about drove Pee Wee Reese out of his mind. On more than one occasion he would shout, “Throw the damn ball, Billy.”, upon which Cox would deliver a strike to first base.\n\nBilly Cox was nicknamed, “Hoss”, because of his long and perhaps somewhat appearing sad face. However, this was not a sad man, but a grateful man, one who loved the game and his teammates and one whose teammates and opponents marveled at his glovework with his little three-fingered glove.\n\nA story is told about the iconic Casey Stengel who had observed the third baseman at work from 1910 until 1975. You might say Casey knew something about third basemen. During a spring training game, one year Stengel in his gruff voice shouted out to Baltimore third baseman Brooks Robinson: “You’re the second greatest third baseman of all time!”\n\nPuzzled at the out of the blue comment Robinson naturally asked who was the best ever to play the position. Stengel replied: “Number three over there in Brooklyn. He was the best of all time.” Number three happened to be Billy Cox.\n\nCasey Stengel also said when Cox was taking the Professor and his Yankees to school with his glove: “He’s not a third baseman. He’s a blankety-blank acrobat.”\n\nGeorge Kell, a third baseman with the Boston Red Sox and not a slouch as a third baseman, supported Stengel’s assessment of Cox: “I never dreamed third base could be played with such artistry until I saw Cox in that series.”\n\nWhen a statue of Brooks Robinson was unveiled at Camden Yards in 2012, Robinson told the Baltimore Sun that he was sorry he never got to meet Billy Cox in person. Robinson was signed the same summer Cox retired, and the former Dodger was one of only four or five men to wear the Orioles uniform whom the Baltimore third base magician has never met.\n\nWilliam Richard “Billy” Cox died on March 30, 1978, and was laid to rest in his hometown of Newport, Pennsylvania. He has not been forgotten as Newport’s youth baseball complex is known as Billy Cox Field."}, {"url": "https://www.espn.com/mlb/story/_/id/7542963/there-easy-playing-third-base", "page_content": "Lou: What's the fellow's name on third base?\n\nBud: What is the fellow's name on second base.\n\nLou: I'm not askin' ya who's on second.\n\nBud: Who's on first?\n\nLou: I don't know.\n\nBud and Lou: Third base!\n\nOn the mythical St. Louis Wolves team in Abbott and Costello's famed routine, the third baseman's name is I Don't Know. Bud and Lou could not have used a more appropriate moniker for the poor fellow. In the history of Major League Baseball, third base has been the most misunderstood, misrepresented and underappreciated position on the diamond.\n\nAfter being the Marlins' shortstop for the past six seasons, Hanley Ramirez will move to third base for the 2012 season. Nick Laham/Getty Images\n\nNo other position has been more difficult to scout or been home to a wider spectrum of ability; after all, it is where the great Brooks Robinson and, for a while, Dave Kingman played. Third baseman is a place of contradiction, an orphan position, a lonely station where few players want to play but where many have, briefly and often, poorly. It is a position about which many questions are asked, and so often the answer is: I Don't Know.\n\nThis is relevant again because the Tigers are planning to play Miguel Cabrera at third base in 2012, and the Marlins will play shortstop Hanley Ramirez at third. This is not a story on whether Cabrera or Ramirez can play third, it is a story about the position and its understated degree of difficulty because it requires so much: offensive production, great hands, quick reactions and quicker feet, a strong arm and a very large dose of courage.\n\nI was there for the first game in spring training that Alex Rodriguez played at third base after his trade to the Yankees before the 2004 season. Rodriguez had moved from shortstop, a position he had played his entire career, a position that he was on his way toward becoming the best ever to play, someday replacing Honus Wagner. But Rodriguez moved to third in order to play for the Yankees. In his first game at third base, the second batter of the game, the Phillies' Jason Michaels, whistled a one-hopper past A-Rod's left ear. A-Rod never even moved.\n\n\"That was quite an introduction to third base,\" I said to him after the game.\n\n\"I never saw that ball,\" he said.\n\n\"Did that ever happen at shortstop?\" I asked.\n\n\"Never,\" he said.\n\nCal Ripken began his career as a third baseman, moved to shortstop for 15 years, then moved back to third. \"I used to get hit in the cup at third, then I moved to shortstop, and I never got hit in the cup,\" he said. \"Then I moved back to third, and got hit in the cup again.\"\n\nThat is what Ramirez is in for. That is what Cabrera is in for again in his move back to third base after four years away from playing the position. When Chipper Jones moved back to third base after a year in left field, the first chance he got was one of those diabolical, top-spin, in-between-hop smashes to his left. Miraculously, he handled it cleanly for the out, and later said, \"I'm glad I got a ball like that in the first game. The position was saying, 'Welcome back.'\"\n\nJones is an example of the lack of respect the position has received in baseball history. He is, by any definition, one of the five greatest third basemen of all time, and yet, it is amazing how many people question whether he is a Hall of Famer. That is not even a debate; he unquestionably is a first-ballot Hall of Famer, his numbers compare favorably to those of George Brett and no third baseman in history has a higher OPS than Jones. And yet, partly because of the position, people aren't sure what to do with those who play third base. That explains, in part, why there are fewer third basemen in the Hall of Fame than any position.\n\nJones was signed as a shortstop but was moved to third base after suffering a serious knee injury. Matt Williams was signed as a shortstop and was moved to third, as were Troy Glaus and many others. It is a difficult switch, especially late in a career. Just ask Rico Petrocelli and Jim Fregosi, who said it took a great deal of time getting used to being so close to the hitter. Doug Rader, a five-time Gold Glover at third, also was signed as a shortstop but was moved to third because of his size. He said playing third base \"was like recovering a fumble.\"\n\n\"I concentrated every pitch at shortstop, but you have to do it more at third,\" Ripken once said. \"You have to make yourself ready for your own safety. On a ball hit to third, you can't afford to take a step back. You have to be like a hockey goalie. There's some fear. And there is no comfort zone. You're on edge. It's a highly stressful, anxious position.\"\n\nNo one played it better than Robinson, who won 16 Gold Gloves. He had great hands, and his body was seemingly relaxed at all times. He often took ground balls from his knees to get himself ready, and he was semi-ambidextrous: He writes and eats with his left hand.\n\n\"It's much more difficult for a shortstop or second baseman to move to third than vice versa,\" said Robinson, who was signed as a second baseman and moved to third. \"At second and shortstop, you can position yourself after the ball is hit. You just don't have time at third.\"\n\nRon Santo, recently elected to the Hall of Fame as a third baseman, remembered playing deep at third one day in spring training in 1959 when the Dodgers' Frank Howard came to the plate. \"He was the biggest person I'd ever seen in my life,\" Santo said. \"He hit a one-hopper that hit me in the stomach and knocked me out. When I woke up in the hospital, there he was again, standing over me. I said, 'Am I in heaven? Who is this giant?'\"\n\nMiguel Cabrera will move from first base to third base to make room for Prince Fielder in the Tigers' lineup for the coming season. Tim Fuller/US Presswire\n\nAll sorts of players in major league history have tried to play third. For some, it didn't work as well as they hoped, so they moved to another position: Harmon Killebrew, Steve Garvey, Tony Perez and Richie Allen started at third and ended up at first. Near the end of his career, the Red Sox briefly put Carl Yastrzemski at third; it didn't go well, and Yaz desperately asked former Red Sox third baseman Frank Malzone, \"Can you help me?\"\n\nIn the late '80s, Yankees manager Billy Martin played Don Mattingly a few games at third; Mattingly throws left-handed. Ryan Braun, the Most Valuable Player of the National League in 2011, started his major league career at third but was moved to left field, where he has become very good defensively.\n\nIt's a cyclical thing, but the game has a number of very good third basemen these days, including Jones, Rodriguez, David Wright, Ryan Zimmerman, Evan Longoria, Adrian Beltre, Scott Rolen, Kevin Youkilis, Pablo Sandoval and Aramis Ramirez. The Blue Jays have perhaps a new young star at third in Brett Lawrie. The Phillies have Placido Polanco, who didn't wear a cup as a second baseman because it slowed him down making the double play, \"but I definitely wear one now that I'm playing third,\" he said with a smile. And the Cardinals have David Freese, who won the MVP of the 2011 NLCS and World Series.\n\nAnd now, two more stars will move to third base -- Ramirez and Cabrera. Will Ramirez adjust to being so much closer to home plate? Will Cabrera move well enough to play the position? Will they continue to hit at the same rate they did at their previous positions?\n\nI don't know.\n\nThat's third base.\n\nTim Kurkjian is a senior writer for ESPN The Magazine. His book \"Is This a Great Game, or What?\" was published by St. Martin's Press and is available in paperback. Click here to order a copy.\n\nFollow Tim Kurkjian on Twitter: @Kurkjian_ESPN"}], "Billy Barnie played from 1875 to 1892.": [{"url": "https://www.baseball-reference.com/bullpen/Billy_Barnie", "page_content": "William Harrison Barnie\n\n(Baid Billy)\n\nBats Unknown, Throws Unknown\n\nUnknown, Unknown Height 5' 7\", Weight 157 lb.\n\nBR page\n\nBiographical Information [ edit ]\n\n\"There was a standing remark that, like the lamented Harry Wright, Barnie was too good for professional base ball and too honest for his own good. . . But there was compensation better than dollars and cents in the universal respect which Barnie, like Harry Wright, enjoyed in the base ball world.\" - from Sporting Life's obituary of Billy Barnie\n\nBilly Barnie played four seasons in the majors and managed 14 years. His playing seasons were in 1874-1875, 1883, and 1886. During his playing days, his appearances were split about equally between catcher and outfield. As a catcher, he made 76 errors in 53 games, while as an outfielder he made 23 errors in 46 games. His batting average was .171. He began managing in 1882 and spent 9 years with the Baltimore Orioles in the American Association. He then managed three teams in the National League. None of his teams finished higher than 3rd. When he wasn't managing in the AA or the NL, Barnie managed the Scranton Coal Heavers in the Eastern League in 1895, the Hartford Bluebirds in the Atlantic League in 1896, and the Hartford Indians in the EL from 1899 until mid-1900. He also was an umpire in the National League and American Association between 1882 and 1892.\n\nSporting Life of July 21, 1900 carried his lengthy obituary, calling him \"one of the best known base ball men in the country\". It stated that he started in amateur ball at a very young age in 1865. He was primarily a catcher during his playing career, but when he became \"crippled in one hand\" he started to manage. In addition to a long career as a manager, he was also the organizer and part owner of the Hartford club. He was given credit for discovering a number of famous major leaguers, including King Kelly. He served on the rules and scheduling committees of the American Association and is responsible for at least one rule change that endures to this day, the creation of the Coaches box, down the two base lines. He made the suggestion to confine coaches to such a box after a number of team had taken to the habit of having their third base coach interfere in the play by running down with a baserunner in order to draw a throw, and do various other unsporting gestures; Arlie Latham of the St. Louis Browns was a particularly enthusiastic offender. The rule was adopted at his suggestion in the middle of the 1886 season.\n\n\n\n\n\nYear-by-Year Managerial Record [ edit ]\n\nFurther Reading [ edit ]\n\nMarty Payne: \"Beer Tanks and Barbed Wire: Bill Barnie and Baltimore\", in The Baseball Research Journal, SABR, Volume 42, Number 1 (Spring 2013), pp. 25-29."}, {"url": "https://sabr.org/journal/article/prelude-to-the-formation-of-the-american-association/", "page_content": "This article was written by Brock Helander\n\nThis article was published in The National Pastime: From Swampoodle to South Philly (Philadelphia, 2013)\n\nSix of the eight most populous cities in the United States were not represented in the National League for the baseball season of 1881. New York, Philadelphia, Brooklyn, St. Louis, Baltimore, and Cincinnati were not members of the League, which included only two charter members (Chicago and Boston) and teams from the smaller cities of Cleveland, Buffalo, Detroit, Providence, Worcester, and Troy. Nonetheless, independent teams throughout the United States enjoyed both popularity and financial success and the need for a second major league became obvious. The prelude to the formation of the American Association in November 1881 is herein examined in the context of the September Western tours of the interregnum Atlantics and Athletics and the principals supposedly involved in a preliminary meeting in October.\n\nThe Atlantics of Brooklyn was a venerated name in the early history of baseball. The club, organized on August 14, 1855,1 was a member of the National Association of Base Ball Players (NABBP) from 1858 to 1870, playing professionally in 1869 and 1870.2 An Atlantic club was also a member of the National Association of Professional Base Ball Players (NAPBBP) from 1872 through September 1875 when it disbanded. An entirely new Atlantic nine formed to play on the Capitoline Grounds in April 1878, but in less than two weeks, most of the team, including Candy Cummings and Bill Barnie, were spirited away to New Haven by Ben Douglas for his International Association team.3 Another Atlantic team, initially attributed to Barnie, was organized in April 1879 by manager Jack Chapman, but by the end of May he had left to manage an International Association team in Holyoke.4 Eventually, Barnie, in April 1881, organized yet another Atlantic team to play at the Union Grounds, joining the short-lived Eastern Championship Association.5\n\nThe Athletics of Philadelphia originally formed as a town ball club on May 31, 1859, and reorganized as a base ball club on April 7, 1860.6 The Athletics were members of the NABBP from 1861 to 1870, playing professionally in 1869 and 1870, in the NAPBBP from 1871 to 1875, and in the National League of Professional Base Ball Clubs in 1876.7 After being expelled from the NL for failing to complete their final Western trip, an independent Athletics team organized in 1877 as a stock company under new president Charles H. Downing and joined the League Alliance in order to protect the club from player raids by National League clubs.8 The Athletics reorganized for 1878 under manager Alfred H. Wright, utilizing 40 players en route to a 45–16–1 record as an independent team.9 Yet another Athletic club formed in 1879 under William W. Hincken and reorganized for 1880 with William Sharsig as president.10 With Sharsig as nominal president through 1883, the 1881 Athletics joined the Eastern Championship Association under manager Horace Phillips.11\n\nThe Westerners\n\nO.P. Caylor and Justus Thorner. Oliver Perry Caylor, born in Dayton, Ohio, on December 14, 1849, was admitted to the bar in Cincinnati in 1872, but opted for a journalistic career with the Cincinnati Enquirer in November 1874. Ascending to the position of sports editor, Caylor garnered a reputation for his clever, humorous, and often acerbic reporting.12\n\nJustus Thorner, a manager for local breweries, was president of the semi-professional Star Club of Cincinnati in 1879.13 After President J. Wayne Neff of the rival Cincinnati National League club announced that his players would be released on October 1, 1879, and forwarded the club’s resignation from the League, Thorner met with National League president William Hulbert in Chicago, formally applying for membership in the League.14 At the annual meeting of the National League, held in December in Buffalo, New York, rather than Cincinnati, as originally scheduled, the organization’s Board of Directors admitted the Star Club to membership and Thorner was elected to the Board of Directors.15 On December 22, the stockholders of the new Cincinnati club elected directors and officers, including Thorner as president.16 Thorner and Caylor represented the club at a special meeting of the National League on February 26, 1880, in Rochester, New York.17\n\nIn early July, the directors of the club requested and received the resignation of Thorner as president, and W.C. Kennett represented Cincinnati at the special meeting of the League on October 4 at Rochester, New York. Henry Root, president of the Providence club, proposed an amendment to the League constitution that would prohibit the sale of alcoholic beverages on club grounds and the use of such grounds for Sunday baseball, both of which the Cincinnati club depended on. All except Kennett pledged to vote in favor of the amendment at the League’s December meeting.18 On October 6, the membership of Cincinnati in the League was declared vacant.19\n\nBy late April 1881, a new baseball club had been formed in Cincinnati. It began play in St. Louis May 28, with Caylor reporting on the games.20 Only days earlier, the leasehold and grounds of the Cincinnati club had been sold to “four prominent Cincinnati gentlemen,” later revealed to be Caylor, Thorner, Victor Long, and John Price.21 Caylor resigned his position with the Cincinnati Enquirer in August, ostensibly to return to the practice of law. Nonetheless, Caylor soon joined the staff of the Cincinnati Commercial Gazette.22\n\nAlfred Spink. Alfred Henry Spink was born on August 24, 1854, in Quebec, Canada. Moving with his family to Chicago after the Civil War, he moved in 1875 to St. Louis, Missouri, where his brother Billy was sports editor for the St. Louis Globe-Democrat. Soon thereafter, Alfred began covering baseball for the Missouri Republican, subsequently becoming sporting editor for a number of St. Louis newspapers, including the St. Louis Post-Dispatch. Becoming acquainted with saloon owner Chris Von der Ahe, vice president of the Grand Avenue Base Ball Club in 1877, Alfred and Billy began organizing semi-professional baseball teams in 1878. Their 1879 team, called the Browns or Brown Stockings, won 20 of 21 games.23\n\nBecause dates and sources conflict, the baseball situation in St. Louis becomes convoluted beginning in 1880. Most likely Al Spink, with veteran player Ned Cuthbert, organized the co-operative St. Louis Browns and, with a number of local men, organized the St. Louis Base Ball Association.24 In May, another team using the Brown Stockings name was organized under the presidency of Chris Von der Ahe.25 By the end of May, the St. Louis Globe-Democrat was referring to Cuthbert’s club as the Reds or Red Stockings and Von der Ahe’s club as the Browns or Brown Stockings.26\n\nIn October, Von der Ahe and others formed the Sportsman’s Park and Club Association, with Spink as secretary, and secured the lease on Grand Avenue Park, which was to be enlarged and improved and would be known as Sportsman’s Park.27 In March 1881 the Sportsman’s Park and Club Association incorporated.28 The Brown Stockings were organized in April, formally opening Sportsman’s Park on May 22 with a defeat of the rival St. Louis Red Stockings before at least 2,500 people.29 Five of the Browns players had been members of the Reds in 1880, most significantly Bill and Jack Gleason.\n\nThe Easterners\n\nHorace B. Phillips. Horace B. Phillips was born in Salem, Ohio, most likely on May 14, 1853, yet earlier reported as May 20, 1856.30 Growing up in Philadelphia, he began his baseball playing career with local amateur teams in 1870. Securing his first professional engagement with the Philadelphia club in 1877, Phillips soon succeeded Fergy Malone as manager. A baseball vagabond in his early career, he subsequently played for and managed clubs in Hornellsville and Syracuse, New York, before managing clubs in Troy and Baltimore in 1879 and Baltimore and Rochester, New York in 1880. Returning to Philadelphia in 1881, Phillips was reported managing the independent professional Athletics team by the end of May.31\n\nBilly Barnie. William Harrison Barnie, born in New York City on January 26, 1853, began playing for amateur baseball clubs in Brooklyn at an early age, manning the Nassau club for three years beginning in 1870 and the Atlantics of Brooklyn in 1873. He initiated his professional career with Hartford in 1874, playing with the Buckeye club of Columbus, Ohio, in 1876 and managing it in 1877. Barnie played for and managed the Buffalo club later in 1877 and was a member of the Atlantics team that moved to New Haven, then Hartford, in 1878. After playing for the Knickerbocker club of San Francisco in 1879 and 1880, he returned to Brooklyn and organized an independent professional Atlantics club in April 1881, becoming its secretary.32\n\nThe Pittsburghers\n\nAl Pratt. Albert G. Pratt was born on November 19, 1848, in Allegheny, Pennsylvania, and joined the Union Army at the age of 15, serving in the infantry. He helped form the Enterprise Base Ball Club of Pittsburgh in 1866 and later joined the Allegheny Club. After a season with the Riverside Club of Portsmouth, Ohio, Pratt pitched for the famous Forest City Club of Cleveland from 1869 to 1872. He returned to Pittsburgh and pitched for the Enterprise club from 1873 to 1875 and played with the Xantha club from 1876 to 1879.33 Pratt then served as a National League umpire in 1879 and substitute umpire in 1880.34\n\nH.D. “Denny” McKnight. Harmar Denny McKnight was born in 1847 in Pittsburgh and graduated from Lafayette College in 1869. Pursuing a business career, he became director of an iron manufacturing company in 1876. That year he helped organize the independent Allegheny baseball club, serving as one of its directors. The following year McKnight was instrumental in the formation of the International Association of Professional Base Ball Players and served as its president after Candy Cummings resigned. However, the Allegheny club disbanded in June 1878.35\n\nOut West\n\nAs Alfred Spink stated in his book The National Game: “I wrote to O.P. Caylor, then the sporting editor of the Cincinnati Enquirer and I suggested to him the idea of picking up all that was left in Cincinnati of the old professional players, forming them into a nine, christening them the Cincinnati Reds and bringing them here to play three games on a Saturday, Sunday and Monday with my reconstructed St Louis Browns.” Spink continued: “Mr. Caylor, accepting my suggestion, quickly got together a team of semi-professionals, called it the Cincinnati Reds and brought it here to help open the reconstructed St. Louis baseball grounds, which my brother William had named Sportsman’s Park.”36 Their Sunday, May 29 game, won by the Browns 16–2, drew an estimated four thousand spectators, making it a substantial success.37\n\nMore Spink: “The Dubuques, the Cincinnati Reds and the Chicago prairie teams came to St. Louis and the games drew such crowds, especially on Sundays, that soon news of the prosperity wave reached the East.”38 Among the well-attended Sunday games in St. Louis were the July 3 game against the Eckfords of Chicago (4,000), the July 17 game against Dubuque (nearly 5,000), and the August 14 game against the Buckeyes of Cincinnati (over 5,000).39\n\nSpink: “Later I wrote to Horace B. Phillips, then managing the Athletics of Philadelphia, and to William Barnie, then operating the Atlantics of Brooklyn. Both the Athletics and the Atlantics were free lances outside the pale of the National League and were willing to come all the way to St. Louis to meet the St. Louis Browns for a division of the gate receipts.”40 Barnie later reminisced: “Horace Phillips of the Athletics and myself then formed the idea of organizing a big league. We learned through the papers that large audiences were being attracted by base ball teams in Cincinnati, Louisville and St. Louis and began negotiating for a trip to those cities. The Western clubs guaranteed us more than enough to pay our expenses on the round trip. We accepted and both the Atlantics and Athletics took the journey.”41\n\nIn late July, Cincinnati applied for admission to the National League for 1882.42 In mid-August Phillips was reported to be in Chicago, meeting with National League President William Hulbert to request admission for the Athletics, who withdrew the application within two weeks and released Phillips only days before the October meeting.43\n\nThe Atlantics of Brooklyn and the Athletics of Philadelphia formed one of the most intense rivalries during baseball’s pioneer era. This graphic depicts a match between the clubs at Philadelphia from 1865.\n\nThe Tours\n\nThe Athletics were the first to embark on a Western tour. On September 2 in Louisville the Athletics defeated the Eclipse of Louisville, with manager Phillips playing in center field. The next day in St. Louis, the St. Louis Browns beat the Athletics. On Sunday, September 4, before an astounding 7,000 fans, the Browns proved victorious. The final game in St. Louis September 5 was won by the Athletics. Returning to Louisville, the Athletics on September 8 lost to the Eclipse morning and afternoon games. On September 9 the Athletics defeated an ad hoc team in Cincinnati.44 According to one source, Thorner found out about the game and joined the crowd of 200 in the eighth inning.45 Later, in a letter to the Cincinnati Commercial Gazette, Phillips stated that he did indeed consult Caylor on this occasion.46 The next day on their way home, the Athletics lost to the Detroit National League club in Allegheny (near Pittsburgh) before 2,000 fans, with Al Pratt serving as umpire.47\n\nAfter defeating the Athletics in Philadelphia on September 14 and 15, the Atlantics arrived in Louisville on September 17 and bested the Eclipse. The next day the Eclipse prevailed and again on September 19. On September 22 the Eclipse again won. Heading to St. Louis, the Atlantics prevailed over the Browns on September 24, scoring the winning run in the top of the ninth. On Sunday, September 25, the Browns were victorious. The game scheduled for September 26 was canceled due to the death of President Garfield. The third game, postponed due to rain, was played September 28, but was suspended due to darkness with the score Atlantics 13, Browns 12. The following day, the Atlantics beat the St. Louis Reds by the identical score. As the St. Louis Browns devolved into chaos at the beginning of October, the Atlantics defeated one of the clubs claiming the Browns’ name on October 9. On their way home to Brooklyn, the Atlantics stopped over in Philadelphia and defeated the Athletics.48\n\nPhillips, upon his return to Philadelphia, stated that “the movement [to form a new league] was meeting with great favor in St. Louis, Pittsburgh, Louisville, and Cincinnati….”49 The Cincinnati Enquirer, probably Frank Wright, agreed: “The outlook is very promising. (A) scheme is on foot to organize a new association, to include St. Louis, Louisville, Philadelphia, Baltimore, Washington, Cincinnati, Pittsburgh, and New York. Already the proposition has been entertained in St. Louis and Louisville, and a meeting will be held in Pittsburgh, October 10, to perfect arrangements.”50 The Clipper reported: “THE NEW ASSOCIATION will hold a meeting Oct. 10 in Pittsburgh. Clubs who intend sending representatives will please communicate with H.B. Phillips, Great Western Hotel, Philadelphia Pa.”51\n\nOne of the most enigmatic figures of nineteenth-century baseball, president Chris Von der Ahe led the St. Louis Browns to four consecutive pennants during the ten-year existence of the American Association.\n\nThe Meetings\n\nWho was actually at the meeting is a matter of conjecture. Justus Thorner’s 1889 account of the meeting erroneously stated that Phillips was there. Later, Caylor stated: “The Association was christened at the Pittsburgh meeting, and neither Mr. Phillips nor Mr. Von der Ahe was present.”52 Nonetheless Thorner recalled: “We called another meeting at the St. Clair Hotel, Pittsburgh and I brought on with me O.P. Caylor from Cincinnati and another reporter named Wright. These two, Mr. Phillips and myself were all the people who showed up…. Phillips and I took a stroll into Diamond Street and there learned that a baseball crank named Al Pratt was working in one of the mills and we found him. He told us of Denny McKnight and he was also secured. [W]e organized for all practical purposes, and I suggested that we have baseball representatives at Louisville, Washington, Philadelphia, New York, and St. Louis to send me their proxy as to where the next meeting should be held. We led everyone wired to believe that he was the only one absent from the meeting, and that caused an immediate reply.”53 In another account by Thorner from 1894, he stated: “It was during the latter part of 1881 that I read in some paper of a call for a meeting, at a Pittsburg hotel, of all those favoring a new baseball organization. In company with O.P. Caylor I took a run down to Pittsburg and…found the call to be on the order of a hoax, as no one showed up outside Caylor and myself. I inquired of the hotel keeper whether any one in town was fond of baseball, and was referred to Denny McKnight and Al Pratt. We called on these gentlemen…. We then declared the meeting adjourned to Cincinnati, November 2, and Caylor and I returned home.”54\n\nThe day after the meeting, numerous newspapers published virtually identical accounts. Possibly authored by Frank Wright of the Cincinnati Enquirer, the report was replete with misspellings and name-dropping, perhaps in an effort to impress prospective league members. It stated, with the correct names in parentheses, that temporary officers chosen were M.F. Day (John B. Day), of the Metropolitan club, Christ Van Derahe (Von der Ahe), James J. Williams (James A. Williams), and H.D. McKnight. Justus Thorner and Charles Fulmer were appointed to a committee to draft a constitution and by-laws.55 John B. Day was owner of the highly-successful independent professional New York-based Metropolitan club and James A. Williams was a former pitcher and the secretary, treasurer, and main driving force behind the recently defunct (Inter)National Association.56 Charles Fulmer was a prominent Philadelphia baseball player who accompanied the Athletics on their Western tour.57 Despite the supposed selection of officers, none of the accounts specifically stated who was actually present at the meeting.\n\nThe New York Clipper was more circumspect: “An informal meeting was held Oct. 10 in Pittsburg in the place of the proposed convention of clubs to organize a new Association, at which there were but two or three of the representatives of the clubs present who were to have sent delegates. After some talk together it was resolved to hold a meeting for permanent organization at the Gibson House, Cincinnati, Nov. 2.”58\n\nDespite numerous unanswered questions, conventional wisdom holds to Harold Seymour’s account. That is, that Phillips instigated the meeting but dropped out; that Justus Thorner, Caylor, and Frank Wright went to Pittsburgh and met with Al Pratt and Denny McKnight; and that they sent to prominent non-National League clubs telegrams worded so as to give the impression that each absentee was the only one not present at the meeting.59\n\nThe American Association of Professional Base Ball Clubs formed on November 2, 1881, at the Gibson House in Cincinnati, Ohio, with six charter members; the Athletics of Philadelphia, the Atlantics of Brooklyn, St. Louis, Cincinnati, the Alleghenys of Pittsburgh, and the Eclipse of Louisville. Delegates to the convention included O.P. Caylor and Justus Thorner, Chris Von der Ahe, Billy Barnie, and Denny McKnight. Charles Fulmer represented the Athletics, and Horace Phillips represented the Philadelphia club of Al Reach. After some talk of consolidation, Fulmer was admitted as the representative of the Athletics, and Phillips was excluded. McKnight was made temporary chairman and Jimmy Williams was chosen temporary secretary.60 At the March 1882 meeting of the American Association, the Atlantic Club of Brooklyn resigned, to be replaced by a club from Baltimore.61\n\nThis 1865 photograph of the Atlantics of Brooklyn by Charles H. Williamson depicts the “Champion Nine” of 1864 and was given to opposing teams who played The Atlantic Club. In September and October of 1882 the club undertook a tour, making stops for multiple games in Philadelphia, Louisville, and St. Louis, with a second stop in Philadelphia on the way home. Such tours were part of the basis of formation of the league known as the American Association.\n\nAfterword\n\nWho should receive credit for the formation of the American Association? Alfred Spink and O.P. Caylor had been reporting baseball since 1875. Justus Thorner had been involved in Cincinnati baseball since 1879. Veterans Billy Barnie and Horace Phillips had faced each other on the field for years, including 1881, when their teams were members of the Eastern Championship Association. Spink helped form an independent team in St. Louis and encouraged Caylor to do the same in Cincinnati. Spink wrote to Philips and Barnie, inviting their teams west. Barnie and Phillips noted the success of teams in St. Louis, Cincinnati and Louisville. Caylor and Phillips met in September. Soon thereafter, Phillips issued the call for the first meeting. All these men deserve a measure of credit in this enterprise.\n\nBROCK HELANDER is the author of “The Rock Who’s Who” (1982), “The Rock Who’s Who Second Edition” (1996), “The Rockin’ ’50s” (1998), and “The Rockin’ ’60s” (1999). Since joining SABR, he has been researching nineteenth century baseball, focusing on the history of baseball in cities that were represented in the major leagues exclusively in the nineteenth century.\n\nNotes\n\n1. Preston D. Orem, Baseball (1845–1881) from the Newspaper Accounts. (Altadena, California: Preston D. Orem, 1961), 14.\n\n2. Marshall D. Wright, The National Association of Base Ball Players, 1857–1870 (Jefferson, North Carolina; McFarland & Co., Inc., 2000).\n\n3. New York Clipper; April 27, 1878; New York Clipper, May 4, 1878\n\n4. New York Clipper; April 12, 1879, Brooklyn Eagle; April 13, 1879, 4; New York Clipper. May 31, 1879.\n\n5. Brooklyn Eagle, March 25, 1881, 1; New York Clipper, April 2, 1881; New York Times, April 12, 1881 8.\n\n6. New York Clipper, October 13, 1883.\n\n7. Wright.\n\n8. New York Clipper, January 6, 1877; Chicago Tribune, March 4, 1877, 7; New York Clipper, March 10, 1877.\n\n9. New York Clipper, April 6, 1878; New York Clipper, November 23, 1878.\n\n10. New York Clipper, May 10, 1879; New York Clipper, May 8, 1880; New York Clipper, March 24, 1883.\n\n11. New York Clipper, March 19, 1881; Brooklyn Eagle, April 17, 1881, 6; (Philadelphia) North American, May 16, 1881.\n\n12. David L. Porter, Biographical Dictionary of American Sports: Baseball (Westport, Connecticut: Greenwood Press, 2000), 235–236; Frank V. Phelps, “Oliver Perry Caylor (O.P.),” Baseball’s First Stars (Cleveland: Society for American Baseball Research, 1996), 25; Sporting Life, October 23, 1897; New York Clipper, October 30, 1897.\n\n13. Cincinnati Commercial Tribune, November 17, 1881, 4; Harold Seymour, Baseball: The Early Years (New York: Oxford University Press, 1960), 137.\n\n14. Chicago Tribune, September 25, 1879, 5; The New York Times, October 25, 1879, 2; Chicago Tribune, October 28, 1879, 7; Chicago Tribune, November 16, 1879, 11.\n\n15. New York Clipper, December 14, 1878; Brooklyn Eagle, November 17, 1879, 3; New York Clipper, December 13, 1879.\n\n16. New York Clipper, January 3, 1880\n\n17. New York Clipper, February 27, 1880.\n\n18. St. Louis Globe-Democrat, October 5, 1880, 3; Chicago Tribune, October 5, 1880, 3.\n\n19. Chicago Tribune, October 7, 1880, 5.\n\n20. New York Sun, April 21, 1881; St. Louis Globe-Democrat, April 27, 1881, 6; Chicago Tribune, May 31, 1881, 6.\n\n21. New York Clipper, July 2, 1881; Rocky Mountain News, October 2, 1882, 2; Cincinnati Commercial Gazette, December 31,\n\n22. (Chicago) Daily InterOcean, August 28, 1881 3, citing the Buffalo Courier; Brooklyn Eagle, September 1, 1881, 3; Cincinnati Commercial Tribune, October 8, 1882, 7; Frank V. Phelps, “Oliver Perry Caylor (O.P.),” Baseball’s First Stars, 25.\n\n23. Ray Schmidt, “Alfred Henry Spink,” Baseball’s First Stars, 156; William A. Kelsoe, St. Louis Reference Record: A Newspaper Man’s Motion Picture of the City (St. Louis: Von Hoffman Press, 1926), 14; Alfred H. Spink, The National Game (Carbondale and Edwardsville, Illinois: Southern Illinois University Press, 2000), 46; St. Louis Globe-Democrat, March 11, 1877, 6; New York Clipper, November 22, 1879.\n\n24. St. Louis Globe-Democrat, April 12, 1880, 7; Washington Post, January 6, 1898, 8; The Sporting News, June 12, 1913, 4; Sporting Life, June 14, 1913, Vol. 61, Number 15, 9.\n\n25. St. Louis Globe-Democrat, May 9, 1880, 12.\n\n26. St. Louis Globe-Democrat, May 30, 1880, 13.\n\n27. St. Louis Globe-Democrat, October 17, 1880, 2; St. Louis Globe-Democrat, October 31, 1880, 12; Spink, 46.\n\n28. St. Louis Globe-Democrat, March 17, 1881 3; St. Louis Globe-Democrat, March 27, 1881, 11.\n\n29. St. Louis Globe-Democrat, April 7, 1881, 7; St. Louis Globe-Democrat, 25 April 1881, 3; St. Louis Globe-Democrat, May 23, 1881, 7.\n\n30. Hy Turkin and S.C. Thompson, The Official Encyclopedia of Baseball (New York: A.S. Barnes and Company, Inc, Third Edition, 1963), 309; Peter Palmer and Gary Gillette, ed., The 2005 ESPN Baseball Encyclopedia (New York: Sterling Publishing Co., 2005), 1294; New York Clipper, July 26, 1884.\n\n31. New York Clipper, July 26, 1884; New York Clipper, May 28, 1881.\n\n32. Brooklyn Eagle, March 25, 1881, 1; Brooklyn Eagle, April 26, 1896 16; Jack Kavanagh, “William Harrison Barnie (Bald Bill),” Baseball’s First Stars, 6.\n\n33. New York Times, 23 November, 1937, 23; Daniel E. Ginsburg, “Albert George Pratt (Uncle Al),” Baseball’s First Stars, 128.\n\n34. Peter Palmer and Gary Gillette, ed., 2489, 2492.\n\n35. The Sporting News, 19 May, 1900, 1; Frank V. Phelps, “Henry Dennis McKnight (Denny),” Baseball’s First Stars, 109.\n\n36. Spink, 47, 48.\n\n37. St. Louis Globe-Democrat, May 30, 1881, 3.\n\n38. Spink, 48.\n\n39. St. Louis Globe-Democrat, July 4, 1881, 7; St. Louis Globe-Democrat, July 18, 1881, 8; New York Clipper, August 20, 1881.\n\n40. Spink, 48, 50.\n\n41. Brooklyn Eagle, January 30, 1898, 9.\n\n42. New York Tribune, July 28, 1881, 8.\n\n43. Cleveland Herald, August 16, 1881; New York Clipper, September 10, 1881; New York Clipper, October 18, 1881.\n\n44. Cleveland Herald, September 3, 1881, 4; St. Louis Globe-Democrat, September 4, 1881, 3; St. Louis Globe-Democrat, September 5, 1881, 5; Cleveland Herald, September 6, 1881; St. Louis Globe-Democrat, September 9, 1881, 7; Cincinnati Commercial Tribune, September 9, 1881, 5; Cincinnati Daily Gazette, September 9, 1881, 2; New York Clipper, September 17, 1881.\n\n45. Cincinnati Daily Gazette, September 10, 1881, 8.\n\n46. Cincinnati Commercial Gazette, November 18, 1882.\n\n47. New York Clipper, September 17, 1881.\n\n48. Philadelphia Inquirer, September 15, 1881 3; Philadelphia Inquirer, September 16, 1881. 2; Cleveland Herald, September 19, 1881, 3; St. Louis Globe-Democrat, September 9, 1881, 5; New York Clipper, September 24, 1881; New York Clipper, October 1, 1881; St. Louis Globe-Democrat, September 25, 1881, 7; St. Louis Globe-Democrat, September 26, 1881, 3; St. Louis Globe-Democrat, September 27, 1881, 7; St. Louis Globe-Democrat, September 28, 1881, 5; St. Louis Globe-Democrat, September 29, 1881, 6; St. Louis Globe-Democrat, September 30, 1881, 6; St. Louis Globe-Democrat, October 2, 1881, 3; St. Louis Globe-Democrat, October 4, 1881, 2; St. Louis Globe-Democrat, October 9, 1881, 6; St. Louis Globe-Democrat, October 22, 1881; New York Clipper, October 10, 1881.\n\n49. Buffalo Express, citing the Philadelphia Times, September 14, 1881.\n\n50. Cleveland Herald, citing the Cincinnati Enquirer, September 17, 1881.\n\n51. New York Clipper, September 24, 1881.\n\n52. Cincinnati Commercial Gazette, November 18, 1882.\n\n53. Pittsburgh Dispatch, November 9, 1889, 6.\n\n54. Washington Post, March 11, 1894, 6.\n\n55. Cincinnati Enquirer, October 11, 1881; Cincinnati Daily Gazette, October 11, 1881, 9; Chicago Tribune, October 11, 1881, 7; (Chicago) Daily InterOcean, October 11, 1881, 7; Cleveland Herald, October 11, 1881; St. Louis Globe-Democrat, October 11, 1881, 6.\n\n56. David Pietrusza, “John B. Day,” Baseball’s First Stars, 49; New York Clipper, March 19, 1892.\n\n57. New York Clipper, February 23, 1879; Joseph M. Overfield, “Charles John Fulmer (Chick),” Nineteenth Century Stars (Society for American Baseball Research. Manhattan, Kansas: Ag Press, 1989), 49.\n\n58. New York Clipper, October 22, 1881.\n\n59. Seymour, 137–138.\n\n60. New York Clipper, November 12, 1881.\n\n61. New York Clipper, March 18, 1882."}, {"url": "https://ripbaseball.com/2018/12/06/grave-story-billy-barnie-1853-1900/", "page_content": "Here lies “Bald Billy” Barnie, a catcher/outfielder who went on to manage until the day he died. Literally. He played for the Hartford Dark Blues (1874), Keokuk Westerns (1875) and New York Mutuals (1875) of the National Assn. and the Baltimore Orioles (1883, 1886) of the American Assn. He also managed the Orioles (1883-91), Washington Senators (1892), Louisville Colonels (1893-4) and Brooklyn Bridegrooms (1897-8).\n\nA New York native, Barnie started playing on local teams in 1870 before turning pro. He joined Hartford in 1874 and, as a rookie, led the league… in strikeouts (with 13). He also had a .184/.188./.226 slash line. The following season, he played in 10 games for the Keokuk (Iowa) Westerns, hitting .111. The Westerns folded after going 1-12 in their first 13 games, and Barnie signed on with the Mutuals as a backup to catcher/manager Nat Hicks. He had 5 hits in 34 at-bats for New York, bringing his 1875 batting average up to .129. Barnie would go on to insert himself into a few games when he was managing the Orioles and even had a .200 average in 17 games in 1883. All total, he hit .171 in 83 career games, with 55 hits, 23 RBIs and 32 runs scored.\n\nBarnie finished his full-time playing career in independent leagues. While nursing a hand injury in 1877 while playing for Buffalo of the League Alliance in 1877, the 24-year-old was given his first change to manage a ballclub. He’d play a few seasons more, including the San Francisco Knickerbockers of the Pacific League, but his future in baseball would lie in managing.\n\nBarnie was a part of The Baseball Convention of 1881, which gave rise to the American Association as a competitor to the National League. Earlier that year, he’d helped organize the Eastern Championship Association and ran the Brooklyn Atlantics team, so he was already familiar with getting a new league off the ground. He wanted a team of his own, but his financial backing was lacking. He and his partner A.J. Houck did get the Baltimore franchise in late 1882, and Barnie would spend the next 9 years as its manager.\n\nThe Orioles didn’t see that much success under Barnie’s tenure as part owner and manager, finishing as high as third just once. The Baltimore Sun said, “…his kind-hearted and easy-going ways causing players to impose on him and preventing him from making changes at times that would have been of benefit.” He was succeeded by Ned Hanlon who, in his quietly ruthless way, made the changes that needed to be made for the good of the team. The Orioles would go on to win the AA championship three times under Hanlon.\n\nBarnie agreed to helm the NL’s Senators in 1892. That arrangement lasted just 2 games. It seems like there was a power struggle between Barnie and the new owner. The Boston Globe reported on January 7 that Washington’s shareholders put Barnie in charge of the club. Ten days later, though, it was reported that George Wagner had acquired 26 of the 29 shares, giving him absolute power. The Senators started the season with two losses, and Barnie, though he said he was given the change to manage for the whole season, was let go. No reason was given for his termination, he said.\n\nBarnie spent the rest of his life bouncing between managerial assignments in the National League and independent leagues. His time in Louisville ended when the 1895 Colonels won just 35 games while losing 95. His final run in the National League with the Bridegrooms lasted until 1898, when he was fired by Brooklyn as one of Charles Ebbets’ first moves as the new owner. In 14 years as a pro manager, he went 470-548 for a .462 win %. He was credited with mentoring stars like King Kelly, Matt Kilroy and Mike Griffin. Ironically, Griffin would eventually be Barnie’s replacement as the Brooklyn manager, following Ebbets’ short-lived attempt at managing his own team.\n\nBarnie kept managing in the Eastern League, first in Springfield and then, until his death, in Hartford. Though he was said to be the “picture of health” when he went to attend an Elks meeting in Atlantic City in early July 1900, he took ill. He returned to Hartford and died there on July 15 of pneumonia. He was 47 years old. Barnie is buried in the Paterson Family plot in Green-Wood Cemetery in Brooklyn, N.Y.\n\nOddly, it was the second time that an Elks meeting in Atlantic City proved to be disastrous to his health. Barnie, along with several others, was injured in a stage collapse at an Elks meeting in 1896. He had been entertaining the crowd by singing when the accident occurred. His obituary stated that he never fully recovered from his unspecified injuries.\n\nAdvertisement"}, {"url": "https://researchworks.oclc.org/archivegrid/collection/data/56024769", "page_content": "Details\n\n1 folder\n\nPlayer file includes material documenting his baseball career and personal life. These items may include newspaper and magazine articles, biographical material, press releases, copies of original documents, and other sundry items. Some player files may not contain any material due to the brevity of his career and/or the time period which he played. File contents: folder 1 (1874- )\n\nBilly Barnie played for the Hartford Dark Blues of the National Association (1874), Keokuk Westerns of the National Association (1875), New York Mutuals of the National Association (1875), and the Baltimore Orioles of the American Association (1883, 1886, 1883 as player-manager). After his playing career, Barnie managed in the minor leagues, managed Baltimore of the American Association (1884-1891), Washington Senators of the National League (1892), Louisville Colonels of the National League (1893-1894), and the Brooklyn Bridegrooms of the National League (1897-1898)\n\nRelated Resources"}, {"url": "https://prabook.com/web/billy.barnie/1752102", "page_content": "Billy Barnie\n\nbaseball player\n\nJanuary 26, 1853 (age 47) New York City\n\nBorn in New York City, he played as a right fielder in the National Association in 1874-1875. In 1883 he became manager of the Baltimore Orioles of the American Association. He appeared as a backup catcher that season, and also played two games in 1886, but otherwise did not take the field After leaving the Orioles following the 1891 season, he managed the Washington Senators (1892), Louisville Colonels (1893-1894) and Brooklyn Bridegrooms (1897-1898). His career managerial record consists of 632 wins and 810 losses. His best finish was third place with the 1887 Orioles. Barnie died in Hartford, Connecticut at the age of 47, of pneumonia complicated by asthmatic bronchitis, and was buried at Green-Wood Cemetery in Brooklyn, New New York"}, {"url": "https://www.statscrew.com/baseball/stats/p-barnibi01", "page_content": "Billy Barnie\n\nWilliam Harrison Barnie\n\nBorn: January 26, 1853\n\nNew York, NY USA\n\nDeceased: 1900\n\nHartford, CT USA\n\nPrimary Position: C\n\nAll Position(s) Played: C, SS, RF, CF, OF\n\nBats:\n\nThrows: R\n\nHeight: 5'7\"\n\nWeight: 157\n\nCareer: 1874-1886\n\nMinor League Statistics\n\n\n\nBilly Barnie compiled a career batting average of .171 with 0 home runs and 23 RBI in his 83-game career with the Hartford Dark Blues, New York Mutuals, Keokuk Westerns and Baltimore Orioles. He began playing during the 1874 season and last took the field during the 1886 campaign.\n\nClick on column headings to sort.\n\nBatting:\n\nFielding:\n\nStatistical data from Baseball Databank, made available under the Creative Commons Attribution-ShareAlike 3.0 Unported License"}, {"url": "https://en-academic.com/dic.nsf/enwiki/4731948", "page_content": "Infobox MLB retired\n\nbgcolor1=#ba0021\n\nbgcolor2=#0f437c\n\ntextcolor1=white\n\ntextcolor2=white\n\n\n\n\n\nname=Billy Barnie\n\nposition=Manager/ Catcher / Right fielder\n\nbats=Unknown\n\nthrows=Right\n\nbirthdate= January 26 1853\n\ncity-state|New York|New York\n\ndeathdate= death date and age|1900|7|15|1853|1|26\n\ncity-state|Hartford|Connecticut\n\ndebutdate= May 7\n\ndebutyear= by|1874\n\ndebutteam= Hartford Dark Blues\n\nfinaldate= June 28\n\nfinalyear= by|1886\n\nfinalteam=Baltimore Orioles\n\nstat1label= Batting average\n\nstat1value=.171\n\nstat2label= Home run s\n\nstat2value=0\n\nstat3label=Runs Batted In\n\nstat3value=23\n\nteams= As Player\n\n* Hartford Dark Blues - ( by|1874 )\n\n* Keokuk Westerns - ( by|1875 )\n\n* New York Mutuals - ( by|1875 )\n\n*Baltimore Orioles - ( by|1883 ), ( by|1886 )As Manager\n\n*Baltimore Orioles - ( by|1883 – by|1891 )\n\n* Washington Senators - ( by|1892 )\n\n* Louisville Colonels - ( by|1893 – by|1894 )\n\n*Brooklyn Bridegrooms - ( by|1897 – by|1898 )\n\nhighlights=\n\nWilliam Harrison Barnie ( January 26 1853 – July 15 1900 ), nicknamed \"Bald Billy,\" was an American manager and catcher in Major League Baseball . Born in New York City , he played as a right fielder in the National Association in 1874-1875. In 1883 he became manager of the Baltimore Orioles of the American Association; he appeared as a backup catcher that season, and also played two games in 1886, but otherwise did not take the field. After leaving the Orioles following the 1891 season, he managed the Washington Senators (1892), Louisville Colonels (1893-1894) and Brooklyn Bridegrooms (1897-1898). His career managerial record consists of 632 wins and 810 losses. His best finish was third place with the 1887 Orioles. [ [ http://www.baseball-reference.com/managers/barnibi01.shtml Baseball Reference manager page ] ]\n\nBarnie died in Hartford, Connecticut at the age of 47, of pneumonia complicated by asthmatic bronchitis [ [ http://www.thedeadballera.com/tooyoung.html The Dead Ball Era ] ] , and was laid to rest at Green-Wood Cemetery in Brooklyn , New York . [ [ http://www.baseball-almanac.com/players/player.php?p=barnibi01 Baseball Almanac ] ]\n\nReferences\n\nExternal links\n\n* [ http://www.baseball-reference.com/managers/barnibi01.shtml Baseball-Reference.com ] - career managing record and playing statistics"}, {"url": "https://www.liquisearch.com/billy_barnie", "page_content": "As Player\n\nHartford Dark Blues - (1874)\n\nKeokuk Westerns - (1875)\n\nNew York Mutuals - (1875)\n\nBaltimore Orioles - (1883), (1886)\n\nAs Manager\n\nBaltimore Orioles - (1883–1891)\n\nWashington Senators - (1892)\n\nLouisville Colonels - (1893–1894)\n\nBrooklyn Bridegrooms - (1897–1898)\n\nWilliam Harrison Barnie (January 26, 1853 – July 15, 1900), nicknamed \"Bald Billy,\" was an American manager and catcher in Major League Baseball. Born in New York City, he played as a right fielder in the National Association in 1874-1875. In 1883 he became manager of the Baltimore Orioles of the American Association; he appeared as a backup catcher that season, and also played two games in 1886, but otherwise did not take the field. After leaving the Orioles following the 1891 season, he managed the Washington Senators (1892), Louisville Colonels (1893–1894) and Brooklyn Bridegrooms (1897–1898). His career managerial record consists of 632 wins and 810 losses. His best finish was third place with the 1887 Orioles.\n\nBarnie died in Hartford, Connecticut at the age of 47, of pneumonia complicated by asthmatic bronchitis, and was buried at Green-Wood Cemetery in Brooklyn, New York."}, {"url": "https://www.statscrew.com/baseball/stats/c-barnibi01", "page_content": "Billy Barnie\n\nWilliam Harrison Barnie\n\nBorn: January 26, 1853\n\nNew York, NY USA\n\nDeceased: July 15, 1900\n\nHartford, CT USA\n\nCoaching Career: 1883-1898\n\nPlaying Statistics\n\n\n\nBilly Barnie compiled a record of 632 wins and 810 losses in his managing career with the Baltimore Orioles, Washington Senators, Louisville Colonels and Brooklyn Bridegrooms. He began managing during the 1883 season and last managed during the 1898 campaign.\n\nCoaching Record:\n\nStatistical data from Baseball Databank, made available under the Creative Commons Attribution-ShareAlike 3.0 Unported License"}, {"url": "https://baseballhistorian.com/players.cfm?lookie_player=barnibi01", "page_content": "Baseball History\n\nAlthough best known as a long-time major league manager mainly with the Baltimore Orioles, Billy Barnie started as an early pioneer player in professional baseball history. He broke into pro ball with Hartfords of the National Association in 1874 under manager Lip Pike during the dead ball era. In that season Billy Barnie batted .184 in 184 at bats spanning 45 games. Defensively he played 23 games as a catcher, 21 in RF and 1 game at shortstop.\n\nThe next year, 1875, Billy Barnie played 10 games with the New York Mutuals and 10 games with the Keokuk Westerns, splitting his time equally defensively with 10 games in the outfield and 10 games as a catcher. After the National Association folded at season’s end, he played locally.\n\nManaging during the Dead Ball Era:\n\nIn 1883 with the start of a new major league, the American Association, AA, Bald Billy Barnie started managing the Baltimore Orioles and managed the team until 1889. Then managed the following teams: Buffalo/Brooklyn AA 1890… Philadelphia Athletics AA 1891… Bal Orioles AA 1891… Washington Nationals of the National League 1892… Louisville NL 1893-94… Brooklyn 1897-98. He posted his best records as a manager with the 1884 Baltimore Orioles, 63-43, and the 1887 Orioles with a 77-58 record."}]}