{"Catherine Johnson is best known for writing the book for the musical Mamma Mia!, which has been seen by over 60 million people worldwide.": [{"url": "https://alchetron.com/Catherine-Johnson-(playwright)", "page_content": "Catherine Johnson (born 14 October 1957) is a British playwright, producing works for stage and television. She is best known for her book for the musical Mamma Mia! and screenplay for the film of the same name, which became the highest-grossing film of all time in the UK and the biggest selling UK DVD of all time in January 2009.\n\nContents\n\nJohnson grew up in Wickwar near Wotton-under-Edge and attended Katharine Lady Berkeley's School in Wotton. She was expelled from school at 16, married at 18 and divorced by the age of 24. She moved to Bristol and finding herself unemployed and with one child to support and another on the way she spotted a notice in the local paper for the Bristol Old Vic/HTV West playwriting competition. She wrote Rag Doll, using the pseudonym Maxwell Smart, a play about incest and child abuse, which won the competition and was staged by the Bristol Old Vic. Further plays for the Bush Theatre in London, Bristol Old Vic and Show of Strength followed along with work on television series including Casualty, Love Hurts and Byker Grove. Johnson lives in Bristol and also owns a house in Pimlico, London.\n\nIn 2007 Johnson instituted The Catherine Johnson Award for Best Play written by the five Pearson Playwrights' Scheme bursary winners from the previous year. Catherine won a bursary from the scheme in 1991. Catherine is a patron of the Wotton Electric Picture House in Wotton-under-Edge, Bristol's Myrtle Theatre Company and Arts and Community in Thornbury."}, {"url": "https://www.londontheatre1.com/theatre-news/shang-a-lang-a-new-play-by-catherine-johnson-writer-of-mamma-mia/", "page_content": "Signal Theatre Company presents: Shang-a-Lang: a play about the Bay City Rollers, youthful nostalgia, friendship and hitting forty from Catherine Johnson, writer of international stage and screen smash Mamma Mia!\n\nBring out the tartan scarves for this feelgood play from the writer of the highest grossing UK film of all time, recalling a time when androgynous style, Ziggy Stardust and Oxford bags were all the passion. Including ‘the rollers’ best-selling hits such as Bye Bye Baby and Give a Little Love, Shang-a-Lang follows a trio of forty-something women as they try to recapture their youth at a seventies weekend at Butlins. Political correctness, manners, decorum and possibly clothes go out the window as the increasingly disillusioned women try to cling to the dreams of bygone years to try to deny disappointment.\n\nCatherine Johnson is best known as the scriptwriter of Mamma Mia!, winner of Best Musical at the UK National Film Awards (2008) and nominated for Best New Musical at the Oliviers (2000), Best Motion Picture – Musical or Comedy at the Golden Globe Awards (2008) and Outstanding British Film award at the BAFTAS (2008). Catherine has previously been the recipient of the Thames Television Writer-in-Residence and Best Plays award (1991) the Bristol Old Vic/HTV Playwriting Award (1987). Shang-a-Lang was first seen at the Bush Theatre in 1998.\n\nSignal Theatre Company was established by actress/producer Kellie Batchelor and director/producer Robert Wolstenholme. They aim to produce revivals of modern comedies both obscure and well-known with sharp attention to contemporary resonance, and emphasis on shows that are both fun to make and fun to watch. Past productions include A Place at the Table (Tristan Bates), The Night Before Christmas (Hen and Chickens/Bike Shed), Here (Tristan Bates) and Private Lives (Canal Café).\n\nRobert said “This play attracted us for the simple reason it’s really, really funny. We love to entertain and make people laugh, and think this show will do that. We’ve chosen to do it now partly because it’s about turning forty and the Bay City Rollers released Shang-a-Lang as a single in 1974, so that’s forty too.”\n\nThe Financial Times said Catherine’s writing ‘has the rare knack of making you roar with laughter at the same time as punching you in the solar plexus’ (Dead Sheep) which pretty much sums up why it’s a good fit for us – our primary concern is always to make theatre that’s fun, but if we can sneakily make you think and feel at the same time, then so much the better!”\n\nCompany Information\n\nWritten by Catherine Johnson, Directed by Robert Wolstenholme, Designed by Christopher Hone, Lighting design by Seth Rook Williams.\n\nBay City Rollers – Shang-A-Lang from the 1970s\n\n\n\nCast: To be confirmed\n\nBook Mamma Mia! musical tickets for the Novello Theatre in London’s West End.\n\nListings information\n\nKings Head Theatre, 115 Upper Street, Islington, London N1 1QN\n\n22nd Jan – 15th Feb, Tues to Sat at 7.15pm, Sun at 3pm\n\n£25-£15 (previews £10)\n\nwww.kingsheadtheatre.com\n\nBox Office: 0207 478 0160\n\nsignaltheatre.com\n\n@SignalTC #shangalang"}, {"url": "https://phdessay.com/mamma-mia-the-musical-history-and-music/", "page_content": "Mamma Mia! is hit Broadway musical that celebrates the music of ABBA, a 1970’s Swedish pop group. It includes over 20 original ABBA songs, the most famous of which is Mamma Mia, which lends itself to the title of the musical. The musical is based on a book written by British author Catherine Johnson, and the music was primarily written by Benny Andersson and Björn Ulvaeus of ABBA.\n\nABBA began in the 1970’s in Sweden, and became famous when the group won the 1974 Eurovision song writing contest. It consisted of four members: Benny Andersson, Björn Ulvaeus, Ani-Frid Lyngstad, and Agnetha Faltskog. It is from their first names that the group’s name came. They wrote songs that became extremely popular world-wide, including Dancing Queen (which was number one on charts across the world, including the US. It was only song to become number one in the US), Waterloo (the song that won the Eurovision contest), and of course, Mamma Mia. All of these popular songs, and more, are included in the show that became Mamma Mia! (Mamma Mia official site).\n\nCatherine Johnson’s book tells a story about a daughter (Sophie) who is about to get married, but she doesn’t know who her own father is. She is living on a Greek island paradise, and invites the three potential candidates to the island to see her – the first time they’ve all set foot on the island in 20 years (Harry, Bill, and Sam). She tries to figure out which one of these men is her father while hiding this from her mother, Donna, who won’t talk about her past. Her goal is to have her real father walk her down the aisle.\n\nOrder custom essay Mamma Mia! the Musical: History and Music with free plagiarism report GET ORIGINAL PAPER\n\nUltimately, her mother walks her down the aisle because everyone realizes that they don’t know who her real father is, but that it doesn’t matter – they will all be a part of her life. She also realizes she doesn’t actually want to get married, so her mother ends up marrying one of the three men (Sam) instead, and Sophie and her fiancé go off to travel the world (Wikipedia).\n\nThe musical is interspersed with songs like Does Your Mother Know, Super-Trouper, Lay All Your Love on Me, and more. Many of the songs are not used in their original context, but are used in key parts of the musical. For example, the original lyrics in Does Your Mother Know are sung by a man who is asking his underage date if her mother know she’s seeing him. In the musical, it is sung by women and used to ask Sophie if her mother knows she’s invited these men to the island (Wikipedia).\n\nThe original idea for the musical was conceived in 1989 by Judy Craymer, and was to use popular ABBA songs in the new context of a musical. Björn and Benny had attempted to write their own musical in the 70’s, consisting of songs like Thank You for the Music (now used in Mamma Mia!) and others, but it was never completed. Lending songs to a musical that was completed and performed was obviously something they were interested in. In May 1999, 10 years after the original idea, Mamma Mia! was born, and made its debut in London theaters. While the creators and producers were initially worried about audience reception, it was an instant success, and went on to play all over Britain, and then in the United States on Broadway.\n\nThe U.S. debut was in 2000, and has since played in many Broadway and off-Broadway theaters throughout the country. It is playing simultaneously in more theaters than any other musical. Today, it is estimated that over 20 million people have seen the show (Mamma Mia official website). The show has toured all major US cities and many minor ones as well, and continues to play on Broadway. There are several casts that are performing the show at any given time.\n\nThe show is now playing world-wide, including in Japan, Sweden, and other European countries. It is estimated that 1.3 million people have seen the show in one of these countries. The show has swept not only the English-speaking countries, but the entire world. The soundtrack is also available in different languages for the diverse audience members.\n\nTypical advertising lines include “People are singing in their seats and dancing in the aisles” when they see the musical. Also, audience members are encouraged to sing along during the encore, which consists of three songs sung earlier in the musical; there are 22 unique songs in all. Audiences consist of people of all ages, as the musical is family friendly and the music is loved not only by the older generation that grew up with it, but also by the younger generation becoming familiar with it for the first time (Mamma Mia! official site).\n\nThe combination of familiar, well-loved songs with a new, exciting story is what makes Mamma Mia! what it is. Many of the adults in world were growing up during the 1970’s and spent a lot of time listening to ABBA music. Their songs topped charts around the world from their debut in 1974 straight through the mid-80’s. They produced several greatest hits CDs, include ABBA Gold and More Gold, which together include over 40 songs. ABBA continues to play on “oldies” radios today, and their music has been passed down to younger generations.\n\nThe music is so upbeat and exciting and perfect for the stage that when it was combined with the cute and interesting story by Catherine Johnson, it was well-received and well-loved. Mamma Mia! will likely continue to play in theaters throughout the country for several more years, as it continues to be an exciting, fun show for all to enjoy.\n\nBibliography\n\n“Mamma Mia!” Wikipedia, the free encyclopedia. Modified Dec. 8, 2006. Accessed December 12, 2006. Website: http://en.wikipedia.org/wiki/Mamma_Mia!\n\n“Mamma-Mia Official Website.” Accessed December 12, 2006. Website: http://www.mamma-mia.com/\n\nThis essay was written by a fellow student. You can use it as an example when writing your own essay or use it as a source, but you need cite it.\n\nGet professional help and free up your time for more important courses Starting from 3 hours delivery 450+ experts on 30 subjects get essay help 124 experts online\n\nDid you know that we have over 70,000 essays on 3,000 topics in our database?"}, {"url": "https://www.howold.co/person/catherine-johnson", "page_content": "Catherine Johnson British playwright\n\nCatherine Johnson is a 65 years old British playwright from Suffolk. She was born on October 14, 1957 in Suffolk.\n\nAbout\n\nBiography\n\nCatherine Johnson is a British playwright producing works for stage and television. She is best known for her script for the musical Mamma Mia! and screenplay for the film of the same name which became the highest grossing UK film of all time and the biggest selling UK DVD of all time in January 2009. Johnson grew up in Wickwar near Wotton-under-Edge and attended Katharine Lady Berkeley's School in Wotton.\n\nRead full biography\n\nYes, Catherine Johnson is still alive Last check: 1 year ago\n\nFamily\n\nChildren\n\nShe has four children, Jessie , Arthur (44, British politician) , Jimmie (47, American stock car racing driver) and Jarit (44, American racing driver) .\n\nWorks\n\nCatherine Johnson Movies (8)\n\nThere are 8 movies of Catherine Johnson.\n\nHer first feature film was Mamma Mia! (2008). She was 50 when she starred in this movie. Since 2008, she has appeared in 8 feature films. The last one is Guard Dog (2017). In this movie, she played the character Abba .\n\nCatherine Johnson movie characters\n\nView all Catherine Johnson movies\n\nThe names of the characters/jobs in the films she starred in are as follows:\n\nCatherine Johnson TV Shows (1)\n\nHer first TV Show was Casualty (1986).\n\nEducation\n\nShe graduated from Katharine Lady Berkeley's School\n\nCatherine Johnson zodiac sign is libra.\n\nWhen is Johnson's next birthday?\n\nCatherine Johnson was born on the 14th of October 1957 , which was a Monday. She will be turning 66 in only 127 days from today (09 June, 2023).\n\nOther facts about Catherine Johnson"}, {"url": "https://literature.britishcouncil.org/writer/catherine-johnson", "page_content": "Catherine Johnson is a novelist and screenwriter who lives in London.\n\nShe was born in 1962 and studied film at St Martin’s School of Art.\n\nShe is the author of several books for children and young adults, including A Nest of Vipers (2008), the story of Cato Hopkins, the youngest member of a ‘family’ of skilled fraudsters, and several novels set in Wales and in London. Arctic Hero was also published in 2008, and tells the true story of Matthew Henson, an African-American explorer who was written out of history despite being one of the first men to reach the North Pole in 1909.\n\nHer other books for young people include Landlocked (1999); Stella (2002); The Dying Game (2007); Con Men (2009); The Nightmare Card (2011); Brave New Girl (2011); and Sawbones (2013).\n\nShe is also the co-writer of the film Bullet Boy, directed by Saul Dibb and starring Ashley Waters.\n\nCatherine Johnson undertakes work in schools, was Royal Literary Fund Fellow at the London Institute, Writer in Residence at Holloway Prison and Reader in Residence at the Royal Festival Hall’s Imagine Children’s Literature Festival."}, {"url": "https://www.celebsagewiki.com/catherine-johnson-playwright", "page_content": "Age, Biography and Wiki\n\nCatherine Johnson was born on 14 October, 1957 in British, is a playwright, screenwriter. Discover Catherine Johnson's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 65 years old?\n\nPopular As N/A Occupation playwright, screenwriter Age 65 years old Zodiac Sign Libra Born 14 October 1957 Birthday 14 October Birthplace N/A Nationality British\n\nWe recommend you to check the complete list of Famous People born on 14 October. She is a member of famous Playwright with the age 65 years old group.\n\nCatherine Johnson Height, Weight & Measurements\n\nAt 65 years old, Catherine Johnson height not available right now. We will update Catherine Johnson's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nCatherine Johnson Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Catherine Johnson worth at the age of 65 years old? Catherine Johnson’s income source is mostly from being a successful Playwright. She is from British. We have estimated Catherine Johnson's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Playwright\n\nCatherine Johnson Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Catherine Johnson Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.britannica.com/biography/Katherine-Johnson-mathematician", "page_content": "Katherine Johnson’s maiden name was Coleman. From 1939 to 1956 she was Katherine Goble, having married James Goble. Three years after his death, she married James Johnson.\n\nIn 1939 Johnson was selected to be one of the first three African American students to enroll in a graduate program at West Virginia University. Later she was a member of a group of NASA employees called \"computers,\" made up of African American women who excelled in mathematics and problem-solving.\n\nKatherine Johnson, née Katherine Coleman, also known as (1939–56) Katherine Goble, (born August 26, 1918, White Sulphur Springs, West Virginia, U.S.—died February 24, 2020, Newport News, Virginia), American mathematician who calculated and analyzed the flight paths of many spacecraft during her more than three decades with the U.S. space program. Her work helped send astronauts to the Moon.\n\nColeman’s intelligence and skill with numbers became apparent when she was a child; by the time she was 10 years old, she had started attending high school. In 1937, at age 18, Coleman graduated with highest honours from West Virginia State College (now West Virginia State University), earning bachelor’s degrees in mathematics and French. She subsequently moved to Virginia to take a teaching job. In 1939, however, she was selected to be one of the first three African American students to enroll in a graduate program at West Virginia University. She studied math there but soon left after marrying James Goble and deciding to start a family. He died in 1956, and three years later she married James Johnson.\n\nBritannica Quiz Numbers and Mathematics\n\nIn 1953 she began working at the National Advisory Committee for Aeronautics (NACA)’s West Area Computing unit, a group of African American women who manually performed complex mathematical calculations for the program’s engineers. The women, known as the West Computers, analyzed test data and provided mathematical computations that were essential to the success of the early U.S. space program. During this time, NACA was segregated, and the West Computers had to use separate bathrooms and dining facilities. That changed in 1958 when NACA was incorporated into the newly formed National Aeronautics and Space Administration (NASA), which banned segregation.\n\nAt NASA Johnson was a member of the Space Task Group. In 1960 she coauthored a paper with one of the group’s engineers about calculations for placing a spacecraft into orbit. It was the first time a woman in her division received credit as an author of a research report. Johnson authored or coauthored 26 research reports during her career.\n\nJohnson also played an important role in NASA’s Mercury program (1961–63) of crewed spaceflights. In 1961 she calculated the path for Freedom 7, the spacecraft that put the first U.S astronaut in space, Alan B. Shepard, Jr. The following year, at the request of John Glenn, Johnson verified that the electronic computer had planned his flight correctly. Glenn subsequently made history aboard Friendship 7, becoming the first U.S. astronaut to orbit Earth. Johnson was also part of the team that calculated where and when to launch the rocket for the Apollo 11 mission of 1969, which sent the first three men to the Moon. Johnson later worked on the space shuttle program. She retired from NASA in 1986.\n\nJohnson received numerous awards and honours for her work, including the Presidential Medal of Freedom (2015). In 2016 NASA named a building, the Katherine G. Johnson Computational Research Facility, after her. That year Margot Lee Shetterly published Hidden Figures: The American Dream and the Untold Story of the Black Women Mathematicians Who Helped Win the Space Race, about the West Computers, including Johnson, Dorothy Vaughan, and Mary Jackson. A film based on the book was also released in 2016. Johnson’s memoir, My Remarkable Journey (2021; written with Joylette Hylick and Katherine Moore), was published posthumously."}, {"url": "https://www.scripts.com/writer/catherine_johnson/8416", "page_content": "Catherine Johnson\n\nCatherine Johnson is a British playwright, producing works for stage and television. She is best known for her book for the ABBA-inspired musical Mamma Mia! and screenplay for the film of the same name.\n\nUpdate this biography »\n\nComplete biography of Catherine Johnson »"}, {"url": "https://www.mtishows.com/show-history/1757", "page_content": "History\n\nInspiration\n\nMamma Mia!, with a book by Catherine Johnson and music and lyrics from Benny Andersson and Bjrn Ulvaeus, is a musical based around the music from the band, ABBA, of which, Andersson and Ulvaeus were both members. Active between 1972 and 1982, the Swedish pop/dance group is one of the most popular international groups of all time, with hits that spanned the charts of Europe, North America and Australia.\n\nThe musical came to fruition under the idea of theatre producer, Judy Craymer. After seeing the 1983 musical, Chess, for which, Andersson and Ulvaeus also wrote the music, she asked to sit down with them and talk about future plans. When she heard their song \"The Winner Takes It All,\" she realized the theatrical potential of the group's pop songs. Although the composers were initially not enthusiastic about the idea, they commissioned her to go forward with their work. Craymer then recruited playwright, Catherine Johnson, to write the book and took on Phyllida Lloyd as the director of the original London production.\n\nMamma Mia! premiered in the West End at the Prince Edward Theatre on April 6, 1999. It has been extremely successful and underwent two different location transfers (to the Prince of Wales Theatre in June 2004 and to the Novello Theatre in September 2012); it continues to play to full houses to this day. Toronto was the first city to produce the show after premiering in London, with a production that ran from May 22, 2000, to May 22, 2005.\n\nThe musical made its debut in the United States at the Orpheum Theatre in San Francisco, California, on November 17, 2000. On February 26, 2001, the production moved to the Shubert Theatre in Los Angeles and then to the Cadillac Palace Theatre in Chicago on May 13 of the same year. Mamma Mia! moved further east to open on Broadway at the Winter Garden Theatre on October 18, 2001, and then transferred to the Broadhurst Theatre on November 2, 2013. It remained one of the most popular shows on the Great White Way throughout its almost fifteen-year run.\n\nThe first North American tour started in Providence, Rhode Island, in February 2002, and then premiered in Las Vegas at the Mandelay Bay in February 2003.\n\nMamma Mia! has been performed in more than 40 countries and across five continents, including: Belgium, Greece, Japan, New Zealand, South Africa and the United Arab Emirates. The first non-English production started in Hamburg, Germany, on November 3, 2002. Many international tours have run over the past several years, but the current one started off in Dublin on September 9, 2004.\n\nCultural Influence\n\nMamma Mia! has grossed $2 billion worldwide since premiering in 1999.\n\nOver 54 million people have seen the musical in 40 different countries.\n\nIt is said that, on any given day, there are at least seven performances of the musical being performed around the world.\n\nAt the time of this writing, the Broadway production was ranked the tenth-longest running musical in Broadway history.\n\nMamma Mia! has brought a renaissance to ABBA's music. Following the London premiere in 1999, the album, ABBA Gold, topped charts in the United Kingdom for the second time in fifteen years.\n\nThe London production of the musical was one of the first times that three women (producer, Judy Craymer; book writer, Catherine Johnson; and director, Phyllida Lloyd) collaborated as a creative team. Its immense commercial success has been significant to the image of female creators in musical theatre.\n\nIn June 2005, the Las Vegas production played its 1000th performance, becoming the longest-running West End or Broadway musical to ever play in Vegas.\n\nMamma Mia! has premiered in more cities faster than any musical in history.\n\nMamma Mia! has been translated into fourteen languages, including: German, Japanese, Spanish, Danish, French, and Chinese.\n\nThe show is the first major musical to play concurrently in three German cities, with productions in Hamburg, Stuttgart and Essen all running in 2007.\n\nThe Chinese premiere at the Shanghai Grand Theatre on July 11, 2011, was the first time a contemporary Western musical was presented in Chinese in Shanghai."}, {"url": "https://www.classicpopmag.com/2021/09/abba-mamma-mia/", "page_content": "Adored the world over, the global reach of ABBA now extends to a box office record-breaking musical and movie. Classic Pop looks at the twin phenomenon that is Mamma Mia!\n\nOn any given day, numerous different productions of ABBA: Mamma Mia! – the musical inspired by ABBA’s mammoth hits – plays somewhere round the globe. Its subsequent silver screen spin-off, Mamma Mia! The Movie, is now the most successful film musical ever. Not for nothing are songwriting partners Benny and Björn, cited as fourth best-selling artists of all time.\n\nIt was while the pair were working on the West End to Broadway musical, Chess with Tim Rice, in around 1983, that they first met theatrical producer Judy Craymer. The determined 20-something had risen through the ranks from stage manager of the original production of Cats, to Tim Rice’s production assistant and onto his executive producer of Chess.\n\nInspired by the drama of The Winner Takes It All – Björn’s ultimate break-up hit song – Craymer had the lightbulb idea of setting ABBA’s best-loved songs in a stage context.\n\nInitially, the guys were not overly keen on the concept, and it took the would-be impresario 10 years to persuade them to give her the rights to their most treasured works. However, once in agreement, they were artistically involved from the start, along with ABBA’s Anni-Frid in a financial capacity.\n\nABBA: Mamma Mia! – trailer\n\nSaid to have sealed the deal was the pitching of a top-notch creative team – Andersson and Ulvaeus were already on good working terms with Craymer as proposed producer.\n\nThe script by ‘savvy writer’, Brit playwright Catherine Johnson was promptly sanctioned; while director Phyllida Lloyd impressed with her previous high-end output of Brecht and Shakespeare. Firing on all fronts, Craymer put everything on the line to make it all happen, selling her flat and giving up her day job in the process.\n\nBy 1997, the musical juggernaut was well and truly on its way. It lived up to its billing: ‘The storytelling magic of ABBA’s timeless songs with an enchanting tale of family and friendship unfolding on a Greek island paradise.’\n\nIt was a surprisingly modern narrative centred round the wedding of a girl who had invited her three possible biological fathers to her important event. On the fictional Greek island of Kalokairi, Sophie aches for her father to walk her down the aisle – but does not know his identity. Discovering her mother’s old diary by chance, she finds entries recording romantic dates with three men in swift succession.\n\nThinking one of these may well be her father, ahead of the wedding she sends an invite out to each in the guise of her unsuspecting mother, Donna. As Donna is caught up with meeting guests at her taverna including old best friends (and ex-bandmates) Tanya and Rosie, in turn Sophie secretly meets each of her mother’s ex-lovers.\n\nShocked to see the men after all this time, Donna exits overcome with emotion. Soon confusion reigns for both mother and daughter, with all three men wanting to escort Sophie on her big day.\n\nThe somewhat soap-opera story breezes by ably abetted by a string of ABBA pearls including Super Trouper, Lay All Your Love On Me, Dancing Queen, Knowing Me, Knowing You, Take A Chance On Me, Thank You For The Music, Money, Money Money, The Winner Takes It All, Voulez Vous, and of course, Mamma Mia! – the title track taken from the band’s 1975 smash.\n\nVarious plot twists and turns later, it all resolves with a giant ‘sing’ in the tale via I Do, I Do, I Do, I Do, I Do, and I Have A Dream, before a lively audience interacting finale and reprise of Mamma Mia and Dancing Queen.\n\nThe non-stop ABBA jukebox musical proved to mesmerise an audience like no other production before or (so far) since. Currently entering its 18th year, the London production has now been seen by more than 10 per cent of the population.\n\nFollowing its London premiere in 1999, the album ABBA Gold notably topped the UK charts again. By 2001, the musical opened on Broadway, and has now played in more than 40 countries in all six continents – to a worldwide audience of more than 60 million.\n\nNot surprisingly, Hollywood soon came calling. As Craymer later related, after all her hard slog: “There was no way I was going to sell the rights and have someone else do it.” True to what would become her indomitable reputation as “the greatest showbiz impresario of the 21st century”, she wisely insisted on refusing all Tinseltown offers until reaching an agreement to helm the film herself along with the original key team: Catherine Johnson as writer, and Phyllida Lloyd, directing. She fought suggestions for other experienced directors (such as Steven Spielberg) to take over.\n\nEqually, insistence was made that the musical’s central middle-aged, hippie mother character remained just so. Politely declined were mentions of casting younger glamour girls like Kylie Minogue, and favoured from the start, was Meryl Streep. Self declared ‘lifelong ABBA fan’ Streep stated: “I am Mamma Mia!” on being cast, and said it was one of the happiest roles of her life.\n\nShe explained she’d found watching the 2001 Broadway musical version ‘life-affirming’ in the wake of the 9/11 Twin Towers tragedy, and thus made contact via a congratulations note, with Craymer.\n\nFinally, actor Tom Hanks offered to make it on the Brit producer’s strict terms with his production company, and soon a useful ‘ABBA-mad’ high-up at Universal Pictures got things moving.\n\nBesides Streep – as spirited, single mother Donna – the stellar cast boasted Amanda Seyfried as her daughter Sophie, Julie Walters and Christine Baranski as her best friends, and as the trio of love interests, Swedish actor Stellan Skarsgard, ex ‘Mr Darcy’ Colin Firth and former 007, Pierce Brosnan.\n\nIronically, as well as the main film location of the gorgeous Greek island of Skiathos, Donna’s villa in the film was in reality a set shot on the 007 stage at Pinewood Studios.\n\nMost external shots, with the exception of the seaside hamlet of Damouchari in the Pelion region, were filmed on Kastani beach, on the small island of Skopelos. The beach bar and jetty were temporarily built for showcase song and dance numbers: who can forget the highlight of the cast strutting their collective stuff to Dancing Queen with such joy on the jetty? – all to that ABBA soundtrack.\n\nEagle-eyed ABBA fans may have spotted cameos by Benny Andersson as the Dancing Queen piano player, while more uncharacteristically, Björn Ulvaeus played a ‘blink and he’s gone’ Greek god!\n\nCast-wise, most naturally attuned to the ABBA repertoire, and known for their singing ability, was Meryl Streep. Having taken opera singing lessons as a child, she had previously performed in films including Postcards From the Edge, Silkwood, and most recently, Florence – about opera singer Florence Foster Jenkins.\n\nConsequently among the movie’s many awards, she was Golden Globe nominated for best actress. The fact that some of the cast had not been chosen for their vocalising led to some mixed reviews from critics. Most especially Pierce Brosnan, who may have looked the part but somehow didn’t quite sound it – and as a result, won the Golden Raspberry award for worst supporting actor.\n\nAt least he had a great time making the film – “one of the best jobs ever”, he said. “The Mamma Mia! experience that has been created and given people so much joy on the stage has bled into this film.” The cast certainly looked like they were having a ball and allegedly, were whooping it up after hours, as contrary to usual film-making stipulations, producer Judy kept the party mood going with beers all-round for cast and crew.\n\nComing up to a decade after the movie was made, fans still make pilgrimages to the locations, particularly the picturesque – but admittedly petite – Ioannis white chapel used in the wedding scene. Beyond the likes of Grease and Dirty Dancing, Mamma Mia! instantly became the song and dance hit of the decade.\n\nPacking in a cracking 24 ABBA hits, as a feel-good escape, it more than hit the mark. As Meryl Streep summed up: “It’s about dreams, your hopes, your happiness.” Opening in 2008, it opened at No. 1 in 35 countries.\n\nCraymer had staked all on its success. In the 90s money had been so tight that on the verge of bankruptcy, she had had to sell her house. In interviews in the British press, she later related: “All my friends thought I was crazy. They said ABBA was so passe and I should get over it. But I knew everyone would want to see the musical. I had to make people believe in what I was doing and it became a complete obsession.”\n\nHer choice to, in effect, ‘take a chance’ on ABBA paid dividends to an astounding degree: overall from her Mamma Mia! concepts, she is reported to have made a reported £90 million.\n\nAwarded an MBE, she went on to produce Viva Forever!, the 2012 musical based on the Spice Girls’ hits, and now spends much of her off-duty time fund-raising for Mamma Mia!-linked charities such as Breast Cancer Research.\n\nIn much the same way, Bristol writer Catherine Johnson shares a similar ‘roughing it to riches’ backstory. Her colourful life could itself create a compelling screenplay. Expelled from school at 16, married at 18, divorced at 24, she was a hard-up single mum with another child on the way when entering – and winning – a newspaper playwriting competition changed her life.\n\nHer hard-hitting play, Rag Doll was staged by the Bristol Old Vic, and penning further plays followed – including Bay City Rollers-based Shang-A-Lang – before stints on popular UK TV series such as Casualty, Band Of Gold and Byker Grove.\n\nABBA: Mamma Mia! – Here We Go Again trailer\n\nRecommended to producer Judy Craymer by a mentor friend, she found the idea of the ABBA project entertaining but over-familiar with financial hardship, did not take its commercial chances seriously. For that matter, neither did ABBA’s Björn: “I didn’t have a clue that Mamma Mia! would be a worldwide success,” he later admitted.\n\nFor the two years it took to write the book, it was a ‘scary-ish time’ for Johnson. “I couldn’t afford for things to go wrong,” she said, looking back on the time. It’s now well-known that Johnson deliberately wrote the plot about a single mother – notably one ‘who wasn’t as the press often liked to paint, a drain on the state… a working single mother who had got her life together and the relationship she had with her daughter.’\n\nAs she told The Guardian: “I’ve had less years of being a success than I had of being a failure. For a lot of my life, I felt a complete letdown”.\n\nConsequently, though she has gone onto create other plays, she is happy if Mamma Mia! is fated to remain her career’s masterwork. Having initially given the musical a lifespan of three months, it’s now going strong in its second decade, having amassed over an eye-watering £2 billion worldwide.\n\nBankrolling nearly $610 million on a $52 million budget, Mamma Mia! is the highest grossing musical film of all time in the UK. Such was its unprecedented success that co-chairman of Universal Studios David Linde, made a press statement that in years to come, there could be a sequel – adding he would be delighted if the creative quintet of Craymer, Johnson, Lloyd, Andersson and Ulvaeus reunited to create a follow-up based round other ABBA songs.\n\nThe world’s premiere may have taken place elsewhere, but on 4 July 2008, all eyes were on the Swedish film screening. In attending this, all four members of ABBA were photographed together for the first time in 22 years. It was aptly held on ABBA’s home turf in Stockholm, and at the Rival theatre – part of the boutique hotel owned by Benny, where each room has a copy of ABBA Gold – the album that spawned both memorable musical to movie productions. Agnetha and Anni-Frid arrived dancing with star of the movie Meryl Streep, before joining the ABBA boys and rest of the cast, on the balcony.\n\nA show of solidarity between the former band members, marking the next chapter in ABBA’s enduring success: from international stage to screen, in 2021, their perfectly crafted pop legacy lives on."}]}