{"Catherine Johnson has written plays for the Royal Court Theatre, the National Theatre, and the Royal Shakespeare Company.": [{"url": "https://royalcourttheatre.com/about/history/", "page_content": "‘The most important theatre in Europe’ — New York Times\n\nOn 8 May 1956, John Osborne’s Look Back in Anger opened at the Royal Court on Sloane Square. It was the third production of the new English Stage Company, under Artistic Director George Devine, and is now considered the play that marks the beginning of modern British drama.\n\nGeorge Devine aimed to discover ‘hard-hitting, uncompromising writers’, and create a company that would challenge and stimulate British theatre. In January 1956, he placed an advert in The Stage calling for scripts and received over 700 submissions. The one that stood out was Look Back in Anger, a play already rejected by Laurence Olivier, Terence Rattigan and Binkie Beaumont. Look Back in Anger opened to empty houses and mostly terrible reviews (with the exception of Kenneth Tynan in the Observer), but Devine stood by both the playwright and the play, which expressed the anger and frustration of the younger generation in the 1950s.\n\nThe Royal Court was Britain’s first national theatre company, and has held firm to its vision of being a writers theatre. Its plays have challenged the artistic, social and political orthodoxy of the day, pushing back the boundaries of what was possible or acceptable. Throughout the 1960s the Royal Court regularly came into conflict with the Lord Chamberlain Office (the official censors of the London stage). Three plays were refused a license to be performed at all (Osborne’s A Patriot for Me and Edward Bond’s Saved and Early Morning). These battles led to the abolition of the Lord Chamberlain Office in 1968.\n\n‘Absolute proof of the power of live theatre’ — Observer\n\nIn 1969, the Royal Court opened the 60-seat Theatre Upstairs, one of the first black box studios opened by a mainstream theatre. Early productions included The Rocky Horror Show by Richard O’ Brien and Owners by a new writer for the stage, Caryl Churchill, who went on to write 17 plays for the Royal Court.\n\nThe 1960s and 1970s expanded and consolidated the Royal Court’s reputation. Writers such as Peter Gill, Christopher Hampton, Athol Fugard, Howard Brenton, David Hare, David Storey, Joe Orton, Ann Jellicoe, Wole Soyinka, David Edgar, Sam Shepard and Mary O’ Malley all cut their teeth at the Royal Court. Plays such as Saved by Edward Bond, The Philanthropist by Christopher Hampton and The Kitchen by Arnold Wesker are now staples of the British stage.\n\nThe Young People’s Theatre was set up in 1966 to develop and produce the best new writing by young people under 25, encouraging writers from all sections of society to find their voice. This led to the first Young Writers Festival in 1973, which was a regular event for the next two decades.\n\n‘The undisputed epicentre of new writing in this country’ — Time Out\n\nMax Stafford-Clark became Artistic Director in 1979 and steered the Royal Court through the turbulent 1980s. In a period of funding cuts and rising costs, he nurtured a new group of emerging playwrights such as Andrea Dunbar, Hanif Kureishi, Sarah Daniels and Jim Cartwright and presented seminal productions including Victory by Howard Barker, Insignificance by Terry Johnson, Our Country’s Good by Timberlake Wertenbaker and Rat in the Skull by Ron Hutchinson.\n\nThe heart of George Devine’s vision was to bring the nation to the stage and to produce plays that examined the challenges and possibilities of the time. One play that realised this vision was Top Girls by Caryl Churchill, which opened in 1982 and captured the spirit of the age. Throughout the 1980s, the Royal Court swam against the tide of lavish West End musicals and comfortable comedies, staging writers who questioned and challenged.\n\nThe 1990s recaptured the fury of the 1950s. Stephen Daldry’s Royal Court was young, angry and noisy. Sarah Kane, Joe Penhall, Jez Butterworth, Anthony Neilson, Martin McDonagh and Mark Ravenhill wrote visceral plays, which confronted audiences with an increasingly violent and isolated society.\n\nHowever, by the early 1990s, the theatre was on the brink of contravening health and safety regulations and guidelines. In 1995, the Court was told that, within eighteen months, the building would be forced to close. In the same week as the New York Times described the Royal Court as the most important theatre in Europe, The Times called the building a ‘dump’.\n\n‘It’s hard not to rave about the Royal Court’ — Guardian\n\nThe theatre’s lighting system was old and untrustworthy with an increasing number of sockets becoming dangerous; two similar wooden grids, at the Haymarket and Strand theatres, had recently broken, thus leaving the Court’s at the top of the danger list. The job of putting on shows had become more difficult and more and more costly. Moreover the drains, which Granville Barker hated in the early 1900s, still flooded the stalls and understage; the creak of the seats which Bernard Shaw got irate over in 1906 infuriated Harold Pinter in 1994 and the dressing rooms which Laurence Olivier said were ‘slightly worse than Blackpool’s were in 1932’, were all in a sorry state. The office space had ceased to be functional. Audience facilities had become unacceptable.\n\nIn 1995, with the advent of the National Lottery, the Royal Court had a once in a lifetime opportunity to restore its crumbling stage and make safe the structure of the building. However, it also realised that there was a rare opportunity to address the wider issues of accessibility and the theatre’s position within the community. Therefore, it undertook a feasibility study of the entire building, its operation and the structure and management of company. Subsequently, a bid was submitted to the Arts Council of England for capital development. In the first wave of grant awards, the Court was awarded £16.2 million.\n\nRedevelopment work began on the Royal Court Theatre on 24 March 1996. The building work touched all parts of the original building; however, the major features of the facade and the intimate auditorium have been preserved. The new theatre has significantly improved the quality of the building’s facilities for performers and theatre-goers. In particular, the theatre includes facilities for people with disabilities and, for the first time in its history, is fully accessible for audience members, performers and staff.\n\nWhile the Royal Court was forced to close for rebuilding, it took its message to the heart of the West End, taking over two theatres; the Theatre Downstairs found a home at the Duke of York’s on St Martin’s Lane and the Theatre Upstairs moved into an adapted Ambassadors on West Street. From these two theatres, the English Stage Company expanded its work, staging more and more plays not only from Britain, but from around the world. Continuing Devine’s vision of a truly international theatre, the International Programme was founded to find new voices in other countries and bring their work back to London. The renamed Young Writers Programme continues to discover new writers in communities up and down the country.\n\n‘The most stylish, welcoming & imaginatively designed theatre in town’ — Daily Telegraph\n\nThe new Royal Court, which opened its doors in February 2000, was a powerhouse: a confident, vigorous company still committed to its founding ideals.\n\nAnd today, after 60 years, writers, directors, actors and audiences still look to the Royal Court for the classics of the future. Plays that were once considered subversive, immoral or blasphemous are now studied in schools and performed all over the world. George Devine wanted to create a ‘vital, modern theatre of experiment’. 60 years on, that theatre stands at the centre of a vigorous, renewed culture of playwriting.\n\nARTISTIC DIRECTORS\n\n2013 to present Vicky Featherstone\n\n2007 – 2013: Dominic Cooke\n\n1998 – 2006: Ian Rickson\n\n1992 – 1998: Stephen Daldry\n\n1979 – 1992: Max Stafford-Clark\n\n1977 – 1979: Stuart Burge\n\n1975 – 1977: Robert Kidd and Nicholas Wright\n\n1972 – 1975: Oscar Lewenstein\n\n1969 – 1972: William Gaskill, Lindsay Anderson and Anthony Page\n\n1965 – 1969: William Gaskill\n\n1956 – 1965: George Devine"}, {"url": "https://www.economist.com/prospero/2021/01/12/the-royal-court-takes-inspiration-from-the-federal-theatre-project", "page_content": "IN A RECENT newspaper interview Vicky Featherstone, the artistic director of the Royal Court Theatre in London, discussed the problem covid-19 poses to playhouses: “How do we get 500 people through the door, to the toilet, to get a drink and sit down at the same time?” It’s a prosaic question, but an urgent one. More than most businesses, theatre depends on getting bodies into buildings. Livestreamed digital performances are a poor substitute, and socially distanced productions are the worst of both worlds: busy enough that every cough in the audience sets the teeth on edge, but too empty to hear ripples of laughter or collective gasps of shock. In Britain, successive lockdowns have ruled out even those attenuated forms of drama.\n\nThe loss is significant. Especially at moments of crisis, theatrical storytelling allows societies to process events collectively. The “purpose of playing,” as William Shakespeare put it, is to “hold the mirror up to nature”. That is not to mention the extensive ecosystem of actors, writers, designers, stage managers, technicians and choreographers who have been left out of a job. Many are freelancers without access to the pandemic relief funds doled out to institutions.\n\nIn response to this predicament, the Royal Court has turned to an American precedent for inspiration: the Federal Theatre Project (FTP), a programme of stage and radio plays set up during the Depression of the 1930s as part of the New Deal. The causes of theatre’s problems were different back then. Economic disaster brought to a head decades of artistic stagnation, partly caused by the need to compete with cheap movies and radio. Directors were paralysed, self-defeatingly clinging to tired formats with dwindling appeal, such as vaudeville. Yet the resulting problems were familiar: lots of unemployed theatre workers and the diminishment of cultural life.\n\nThe FTP was designed to solve the first of these problems. It was explicitly a relief measure, never aiming at commercial success; tickets to two-thirds of its productions were free. But it ended up tackling the second issue, too. The FTP drew on the talents of Orson Welles, Marlon Brando and Arthur Miller, staging forward-thinking productions influenced by the European avant-garde. Its plays squarely addressed the issues of the day, often in the form of openly political left-wing invective. “Living Newspapers”, from which the new Royal Court show takes direct inspiration, adapted newspaper clippings about unequal housing or agricultural policy into polemical drama, informing audiences and critiquing those in power.\n\nThe FTP also stridently pushed for racial equality and diversity, funding branches for black theatre-makers and kicking out managers who attempted to segregate workers. For its trouble—and despite considerable critical success—the FTP was defunded in 1939 by the Un-American Activities Committee of the House of Representatives, on the grounds that it promoted racial integration and a communist agenda.\n\nThe Royal Court’s “Living Newspaper” is not on the same scale as the FTP’s, which cost $46m at the time—hundreds of millions in present-day terms. But its stated aims are consistent with its predecessor: “to give as many people as possible work, to bring our theatre back to life and to create something which is urgent, dynamic, political and disruptive”. The theatre estimates that more than 200 freelance artists will work on the programme. Made up of sketches, monologues, installations and dance sequences staged around the Royal Court’s building in Sloane Square, the “Living Newspaper” was meant to be created and performed weekly, before the latest lockdown paused the schedule.\n\nThe second edition, recorded and streamed online, upholds the tradition of racial inclusivity in its diverse cast and writers, as well as in its content. One playlet features Cantonese aunties teaching protest strategies developed on the streets of Hong Kong; another rails against lurid media coverage of police violence against black people. As for political invective, the opening performance is a grime protest song by Jammz, a rapper, who is accompanied by singers belting out a chorus riff of “Tory scum”. Regrettably, despite targeting everything from ambulance waiting times to the mendacity of Brexit campaigners (hardly a hot-off-the-press political issue), the song fails to land truly meaningful blows. Instead, with the closing shouts of “you will not survive the revolution!” it comes to feel a bit silly.\n\nVastly more successful are the scenes which approach politics obliquely. The best is a monologue by Emteaz Hussain, a playwright, told from the perspective of a newly homeless mother of young children. The drudgery of grinding poverty is laid bare: tortuous household calculations over tins of beans or nappies and rehearsals of times-tables in cramped emergency accommodation. A monologue directly addressing the audience isn’t a new theatrical format. But in the hands of a talented writer, it can still be an extraordinarily powerful one.\n\nThe first two editions of “Living Newspaper: A Counter Narrative” had their premiere in December 2020. The project will continue after the current national lockdown"}, {"url": "https://www.vam.ac.uk/blog/museum-life/discovering-the-royal-court-theatre-archive", "page_content": "Volunteer, Julia Rank, shares some of her discoveries while working on the Royal Court Theatre Archive in the Department of Theatre and Performance.\n\nAs a student on the V&A and Royal College of Art’s History of Design MA (taking the specialist Performance Pathway) and a volunteer in the Theatre and Performance department, my first project, alongside my classmate Dorothy Hill, has been the task of sorting through boxes donated by the English Stage Company of the Royal Court Theatre. We’ve filled over 120 archive boxes so far and that’s only the first stage of the process! Among the financial records, building maintenance documents and varied correspondence, a few items in particular have caught our attention.\n\nFirst night telegrams\n\nRoyal Shakespeare Company chief Peter Hall and his then-wife Leslie Caron sent this first night telegram in January 1962, when Tony Richardson’s production of A Midsummer Night’s Dream took place. This design seems to have been the standard festive telegram of the early 1960s. This production was something of a family affair, featuring Richardson’s then-brother and sister-in-law Corin and Lynn Redgrave as Lysander and Helena (the bit when the spell makes Lysander fall for Helena must have been a bit awkward…). Sketches of Jocelyn Herbert’s fairy costumes for the production held by the V&A can be found here. Peter Hall staged his own Dream a few months later, starring Judi Dench as Titania.\n\nScripts, scripts, scripts\n\nThe Royal Court is known as the ‘Writers’ Theatre’, organising numerous events, workshops and mentoring schemes. In 1984. Billy Connolly (pictured) was a mentor on the Young Writers’ Programme. Alumni of this programme have included Laura Wade (Posh), Lucy Prebble (Enron) and Polly Stenham (That Face). A large part of the recent addition to the archive came from the Royal Court’s literary department and includes many scripts, some of which are annotated, and others show a sequence of revisions.\n\nCalling Mark Rylance\n\nThis mobile phone is one of the only objects in the donation, and was used in Jez Butterworth’s multi award-winning play Jerusalem, one of the Royal Court’s biggest hits of recent years. It’s probably the one featured in the scene in which Mark Rylance’s Johnny Byron’s ex, Dawn, asks to borrow his phone to call her new partner. This Nokia device appears charmingly retro now and was probably on its way to obsolescence in 2009, two years after the first iPhone was released.\n\nThe Royal Court’s favourite actor?\n\nIt’s exciting to find names such as Benedict Cumberbatch, Daniel Craig and Sally Hawkins pre-film stardom. However, amongst production cast lists, one name appears repeatedly: Linda Bassett. I must admit that it probably wouldn’t have been so obvious to me if I didn’t absolutely adore her marvellous performance as the no-nonsense and golden-hearted Nurse Crane on Call the Midwife, prior to which she was probably best known for her role as Ella Khan in East is East, which she originated at the Royal Court in 1996 and then reprised on film (for which she was nominated for a BAFTA). A regular performer in the plays of Caryl Churchill, Bassett was hailed by Susannah Clapp in the Observer as ‘one of our greatest and least anointed actors’ for her performance in Churchill’s Escaped Alone (2016).\n\nDisillusioned of Twickenham\n\nThe Royal Court isn’t a theatre that tends to offer ‘a fun night out’ in the traditional sense. I Licked a Slag’s Deodorant (Jim Cartwright) is probably the least appealing title I’ve ever heard; the show reports for Shopping and Fucking (Mark Ravenhill) suggest that there was scarcely a performance without a walk-out, and Sarah Kane’s Blasted made a number of critics sympathise with Disgusted of Tunbridge Wells. When David Storey’s play Home (1970) starring Sir Ralph Richardson and Sir John Gielgud failed to deliver the ‘exhilarating entertainment’ that Mrs Alice Palmer expected, she wrote directly to Sir Ralph to request a refund for this ‘technical presentation of a most distressing theme’. In spite of Mrs Palmer’s ‘shattering disillusionment’, Home went on to win the New York Drama Critics’ Circle Award for Best Play, and was nominated for a Tony award.\n\nThe catalogue to the Royal Court Archive can be viewed online here and recent additions to the archive will be added to this listing in due course. For more information on the V&A Theatre and Performance Archives please visit the archive webpages."}, {"url": "https://www.nytimes.com/2013/07/24/arts/24iht-lon24.html", "page_content": "LONDON — Regime change in the theater, as elsewhere, can be tricky. What happens if the newly arrived leader of a particular playhouse lacks the sparkle or élan of the person who came before? One’s sympathies, for instance, go out to whoever ends up following Nicholas Hytner as head of the National Theatre. His tenure, still some way from finished, will be a tough act to follow.\n\nBut the National is scarcely the only game in a town that — far more than New York — all but demands turnover at the top as a way of allowing a succession of voices their place at the cultural table. And so it is that Vicky Featherstone has taken over the leadership of the Royal Court Theatre, London’s defining address for new writing. Let’s just say for now that her tenure already feels hot for reasons that go well beyond the recent soaring temperatures.\n\nMs. Featherstone, who is 46, doesn’t begin her first full season until September and so could have been forgiven for easing herself into a position whose ripple effects are felt far and wide.\n\nIt has long been axiomatic that the Court’s embrace of the new has sent its plays, and playwrights, out into the culture at large. A short list of dramatists who owe a sizable debt to the two-auditorium playhouse includes Conor McPherson, Polly Stenham, Laura Wade and Nick Payne, alongside a hefty American contingent that numbers Wallace Shawn, Bruce Norris and Christopher Shinn among its ranks."}, {"url": "https://books.google.com/books/about/National_Theatre_Connections_2014.html?id=VPoqAwAAQBAJ", "page_content": "Anthony Banks (editor) is Associate Director for the National Theatre Discover Programme, where he commissions scripts for the Connections seasons, the Primary Theatre programme and Shakespeare Schools Festival, and curates a variety of projects and events for lifelong learning.\n\n\n\nDeborah Bruce, a theatre director for over twenty years, has in more recent years embarked on a writing career. Her first stage play, Godchild, was written in 2010, while her 2012 play, The Distance, earned her a place as a finalist in the 2012/13 Susan Smith Blackburn Prize. She is currently under commission to the National Theatre and the Royal Court Theatre, London.\n\n\n\nMatt Hartley won the inaugural Bruntwood Award for his play Sixty Five Miles (2007), which was produced by Paines Plough and Hull Truck. He was also a member of the Paines Plough/Channel 4 Future Perfect Scheme, before going on in 2012 to become writer on attachment at the Royal Court, London. Currently under commission by the RSC, his previous theatre includes Punch, The Bee, Microcosm, Burning Cars and Sentenced.\n\n\n\nSam Holcroft is currently Writer-in-Residence at the National Theatre Studio, London, having been Pearson Playwright in Residence at the Traverse Theatre, Edinburgh, in 2009-10. She also won the 2009 Tom Erhardt Award for new writers. Theatre plays include Edgar and Annabel, Dancing Bears, While You Lie, Pink, Vanya, and Cockroach.\n\n\n\nDafydd James is an award-winning writer, composer and performer. His works include Driving Home for Christmas, Peter Pan, Llwyth, The Village Social and My Name is Sue.\n\n\n\nCatherine Johnson's work for stage and television includes the script for the musical Mamma Mia! and screenplay for the film, Rag Doll (Bristol Old Vic - winner BOV/HTV Playwriting Award, 1988), Dead Sheep (Bush), Little Baby Nothing (Bush Theatre), among many others. In 2007, she instituted The Catherine Johnson Award for Best Play.\n\n\n\nSabrina Mahfouz is a poet, prose writer and playwright. Her play That Boy was performed at the Soho Theatre in 2010 and won a Westminster Prize for New Playwrights. Since then, she has won a UK Young Artists Award (2011) for poetry; an IdeasTap Innovator Award for theatre and one for poetry; and she won a place on the Old Vic's TS Eliot Exchange 2011 to New York. She is currently Creative in Residence for Theatre & Poetry at The Hospital Club and she will be the 2012 Leverhulme Trust Associate Playwright at the Bush Theatre. Her recent solo show about a young stripper, Dry Ice, won widespread critical acclaim at the Edinburgh Fringe 2011. Sabrina Mahfouz has been part of the writers programmes at the Royal Opera House and the Royal Court, as well a playwright-on-attachment with Tamasha.\n\n\n\nPauline McLynn is an actor and author. Perhaps best-known for her role as Mrs Doyle in the sitcom Father Ted and Libby Croker in Shameless, she is also a prolific writer. Her novels include Something for the Weekend; Better Than a Rest; Right on Time; The Woman on the Bus and Summer in the City.\n\n\n\nLuke Norris is a playwright an actor. His work has been performed at the Edinburgh Fringe Festival and the Royal Court. His play Goodbye to All That premiered at the Royal Court Young Writer's Festival in 2012.\n\n\n\nEvan Placey is an award-winning playwright. His play Girls Like That premiered in summer 2013 at Birmingham Rep, Theatre Royal Plymouth, and West Yorkshire Playhouse. Mother of Him, his debut full-length play, won the King's Cross Award for New Writing, Canada's RBC National Playwriting Competition, and the Samuel French Canadian Play Contest, and was shortlisted for the Meyer Whitworth Award and the Rod Hall Memorial Award. It was produced at the Courtyard Theatre in London. Other plays include Banana Boys, Suicide(s) in Vegas, Holloway Jones, Scarberia, and How Was it for You?\n\n\n\nSimon Vinnicombe was a Pearson Playwright in Residence at the Finborough Theatre. Previous plays produced at the Finborough Theatre include Cradle Me and Year 10. He won a Peggy Ramsay Pearson Award in 2010 and was a member of the BBC Continuing Drama Writers Academy. Theatre includes Untitled (Brit School commission), Wisdom (Manhattan Theatre Club), Turf (Bush Theatre), The Old Vic 24 Hour Plays (The Old Vic), A Night with the Apathists (Union Theatre) and Wilde Tales (Southwark Playhouse). Radio includes Mary Cherry and Hard Road (both for BBC Radio 4)."}, {"url": "https://link.springer.com/chapter/10.1007/978-3-030-39427-1_2", "page_content": "With cuts in arts subsidies continuing throughout the 90s, Daldry’s aptitude for securing funding from alternative means allowed for new sources of income to support the production of new plays. Although still dependent on the Arts Council for its core funding, during this time, a significant amount of sponsorship for the Court across this period was received from American donors. Importantly, the National Theatre (NT) Studio also provided vital opportunities and space, particularly during the rehearsal period, to support the programming of new plays at the Court. Under Sue Higginson’s leadership, the NT Studio, which was housed in the Old Vic Annex, continued to develop new plays both at the National and through co-productions with other theaters. It was through a co-production with the NT Studio that the Royal Court was able to produce six of the plays by new writers programmed in the Theatre Upstairs between the autumn of 1994 and early 1995. The studio provided the rehearsal space and covered the cost of the actors, director and stage manager for the entirety of the rehearsal period, which effectively halved the cost of production for the Royal Court.Footnote 27\n\nIn addition to the NT Studio collaboration, further financial aid was acquired through the establishment of a new scheme for emerging playwrights. In a partnership between the Jerwood Charitable Foundation and the Royal Court that continues today, Jerwood New Playwrights (JNP) was launched in 1994 to support the production of work by early-career playwrights.Footnote 28 JNP continues to contribute to the annual production of three plays produced across the Royal Court’s two stages, but, in its inaugural year, the scheme supported five of the six young writers programmed as part of the 1994–1995 season of new plays. Penhall’s Some Voices, which opened the season in September 1994, was the first play to benefit from the JNP initiative. Other JNP beneficiaries for the 1994–1995 season were Upton for Ashes and Sand along with Kane’s debut play Blasted. Two of the plays to feature in the 1994 Young Writers’ Festival were also awarded JNP funding, with Grosso’s Peaches and Wynne’s The Knocky completing the inaugural cohort of JNP recipients. The collaboration between the Royal Court, NT Studio and Jerwood Foundation during this time, therefore, can be regarded as a valuable alliance that allowed for Daldry’s ambitious plans for the Court to reach fruition.\n\nThe regional attention in the eighteen-month build-up to the 1994 Young Writers’ Festival had focused on young playwrights based in the London area and, for the first time, in Northern Ireland. There, playwriting workshops were conducted in Derry, Coleraine and Belfast. The decision to take the work of the Young Writers’ Festival to Northern Ireland in 1993–1994, at the beginning of the Peace Process which aimed to put an end to almost twenty-five years of the Troubles, presents an underlying political motivation to the Festival’s work. In a report to the English Stage Company Council, Tickell writes how he is “particularly excited about the range of young people who have attended our workshops,” and that “a very wide range of ages, cultural and ethnic backgrounds and levels of experience” had been involved in the process.Footnote 29 The director further states how it was the responsibility of the Young Peoples’ Theatre “to ensure that the Festival was able to accommodate and celebrate this diversity in the productions” as it prepared for performances in both the Theatre Upstairs in October and in Northern Ireland the following month.Footnote 30 The emphasis on diversity here is a feature that has been inherent in the YPT’s work for some time: the commitment to staging work by young writers of diverse age, race, ethnicity, class and sexuality had been carefully considered by each of the YPT’s directors since the scheme’s inception.\n\nThe autumn of 1994 to the spring of 1995 marked a season that brought an influx of young writers to the Royal Court stage. Reflecting on the program of work produced over this period in the 1994 Young Writers’ Festival’s accompanying play text, Daldry notes “the huge success of the season,” stating that “it pays testimony to the fact that there is a growing urgency in young people to express themselves through dramatic writing.”Footnote 31 The Artistic Director concludes his preface to the Coming on Strong published play text by crediting the important work of the Young Peoples’ Theatre for its role in producing young playwrights, writing:\n\nI am delighted that the writers who have emerged through the Young Peoples’ Theatre, and in particular the Young Writers’ Festival, are now being published. I sincerely hope that you share our enthusiasm for these plays and, just as importantly, appreciate the process by which they have emerged.Footnote 32\n\nThere is an element of irony in the fact that Daldry has chosen to highlight his appreciation for the Young Writers’ Festival’s process in his foreword. Indeed, Rebecca Prichard has noted the benefit of having “access to the writing workshops” and how this allowed for time to “experiment with ideas and see what was working dramatically.”Footnote 33 But as has been alluded to throughout this chapter, the Festival’s process-led methods are at direct odds with the Daldry/Whybrow mantra of producing work “without a process.”Footnote 34 What’s more, the plays that evolved from the Festival follow a recognizable pattern of development that was also visible, during the same period, in the Court’s acquisition of work by other previously identified writers such as Kane, Ravenhill and Kahn-Din. The YPT’s methods of developing aspiring playwrights through the use of process, therefore, can be seen as a continuing influence on the Court’s ability to successfully and consistently produce young writers during this day. However, as the notion of process became increasingly suppressed in the broader narrative of the Royal Court in the 1990s, the idea that many of their plays were staged without the need for prior dramaturgical support or without sustained engagement with the writers has evolved to become one of many falsehoods that has perpetuated the mythology that surrounded the Court during this decade.\n\nBefore their plays were selected for production, Wynne and Prichard had been part of the London workshops, while Coyle had participated in the Festival’s workshops in Derry. London-born Grosso was a member of the YPT’s writers’ group and his play Peaches had been developed under the tutelage of Andrew Alty. Prior to Peaches , Grosso’s first piece, a monologue titled Mam Don’t, had been produced by the Young Peoples’ Theatre and performed at the Commonwealth Institute in 1993. Elaine Aston characterizes the four plays produced as part of Coming on Strong as being linked “by a dramatic world in which people struggle to make sense and purpose out of difficult times or empty lives.”Footnote 35 Out of these works emerged the early signs of individual styles and original voices that, in the case of Prichard, Wynne and Grosso, would go on to feature on both the Royal Court and British stages in the future. Each of the plays expresses a “politics of the individual” theme, described by Daldry as a central feature of many of the plays that emerged across the decade.Footnote 36 Evidence of this can been seen through ideas of sexuality as explored through Grosso’s Peaches and Coyle’s Corner Boys and in the sharp comedy and dialogue of Prichard’s Essex Girls , a portrayal of teenage girls approaching adulthood. Wynne’s The Knocky owes a debt to Chekhovian tradition and to Daldry’s production of J. B. Priestley’s An Inspector Calls in 1992 with its vivid perception of growing up on a council estate in England. These plays were programmed alongside other plays by young, unknown writers, which focused on mental illness, violence and the effects of war. Both Jacqueline Bolton and Aleks Sierz have previously suggested links between the 1950s and the 1990s Royal Court,Footnote 37 and echoes of the 1950s Royal Court plays ring within these works too, as “sceptical, frustrated and disempowered” voices once again occupied the theater’s stages.Footnote 38\n\nJoe Penhall had also come through the writers’ group at the Young Peoples’ Theatre in the late 1980s. His short play Wild Turkey was produced at the Old Red Lion as part of the 1993 London New Play Festival while he was still a member of the YPT, after which he wrote Some Voices:\n\nI wrote a long play, which was Some Voices. I offered it to the Bush, and they didn’t want it, and I offered it to the National Theatre and they didn’t want it, and I offered it to Hampstead and they didn’t want it, and I offered it to the Royal Court and Stephen Daldry rang me up at work and said: “come in and talk to me.”Footnote 39\n\nDuring his involvement with the YPT, Penhall’s writing potential had first been spotted by the writers’ group’s tutor April De Angelis, who, in turn, forwarded a sample of his work to the literary department at the Royal Court: “I said, ‘look I just think this person has really got something.’”Footnote 40 Although the Court had initially overlooked Penhall’s talent—as De Angelis recalls “we just got a no back”—the writer’s potential was recognized again by Daldry, who, after an initial reading of the play at Battersea Arts Centre in 1993, selected Some Voices to open the new season at the Royal Court.Footnote 41 As a young writer, Penhall’s experience within the YPT and his reception at the Royal Court by two artistic directors is illustrative of wider change within the structures of the theater. According to Whybrow, the Royal Court prior to Daldry’s appointment had been regarded by emerging writers as a “fortress” impenetrable to new writers.Footnote 42 Penhall’s initial rejection was transmuted within a matter of months to full production—an indication of the shift in attitudes taking place at the theater. Where Penhall had emerged through the YPT writers’ group, Judy Upton had been “encouraged to write for the stage” during her participation in the workshop phases of the Young Writers’ Festival held in Sussex in 1990.Footnote 43 Like Penhall, Upton’s first play, Everlasting Rose, premiered at the Old Red Lion in 1992, also as part of the London New Play Festival for that year. Through their involvement in the initiatives offered by the Young Peoples’ Theatre, both Penhall and Upton are likely to have been known by the Royal Court. Indeed, that their plays were produced as part of the London New Play Festival in the two years prior to their programming by the Royal Court is further evidence of the “strategic tracking” of new writers carried out by Daldry and Whybrow in the early 1990s.Footnote 44\n\nIn the aftermath of Coming on Strong , three writers, Prichard, Grosso and Wynne, were commissioned to write a second full-length play for the Royal Court. For Grosso, this commission materialized as Sweetheart (1996), but neither Wynne’s nor Prichard’s second plays were produced on a Royal Court stage. Wynne did not return to the Royal Court until 2002, when his play The People Are Friendly was produced in the Theatre Downstairs.Footnote 45 Prichard’s return was more prompt, as Fair Game , her third play, opened at the Duke of York’s, where the Court’s Theatre Upstairs had been relocated as part of an ongoing reconstruction project of the theater on Sloane Square, in October 1997. The play was deemed particularly contentious as it featured the gang rape of a thirteen-year-old girl and the Court’s decision to cast the play using actors all under the age of seventeen fueled outrage from some audience members.Footnote 46 Carl Miller, who had succeeded Dominic Tickell as the YPT director, states that in order “to deal with the flack of putting this on with young performers [it was] produced by the Young Peoples’ Theatre.”Footnote 47 Although it was a professional production in which the actors were paid, Fair Game is regarded by Ola Animashawun, the then current YPT’s youth drama worker, as the “last public act of the youth theatre.”Footnote 48 Within a year, the YPT had been reconceived to offer a complete focus on playwriting, and the Young Writers’ Programme was born.\n\nComing on Strong represents a significant turning point in the history of the Young Peoples’ Theatre, which demonstrates its own substantial contribution to a defining moment in British theater. It is important to note here that another YPT alumni Jonathan Harvey and his third play for the Royal Court, Babies, occupied the Theatre Downstairs at the same time that Penhall’s Some Voices opened in the Theatre Upstairs, illustrating, for the first time, two Young Peoples’ Theatre playwrights on both stages of the Royal Court.Footnote 49 What emerged at the end of 1994, therefore, was a consistent contribution by the Young Peoples’ Theatre, as a result of their work with young writers, to seasons of work at the Royal Court. This outcome confirms that the process-led Young Writers’ Festival, which aimed to allow for the extended support of young writers across the country, along with the YPT writers’ group offered a significant contribution toward the production of a new generation of playwrights in the mid-1990s and proved to be an invaluable platform in the provision of young writers to the Court at this time."}, {"url": "https://www.spectator.co.uk/article/royal-court-theatre/", "page_content": "If there were an Eddie the Eagle award for theatre — to recognise large reputations built on minuscule achievements — it would go to the Royal Court. Sixty years ago the English Stage Company arrived at ‘the Court’ determined to amaze the world with a new generation of thrusting young geniuses.\n\nIt won instant notoriety with John Osborne’s Look Back in Anger. This sour bedsit melodrama earned the noisy support of a cabal of reviewers led by Kenneth Tynan who used it to advertise their powers of artistic foresight. Osborne’s next play, The Entertainer, was a cheerless and cumbersome allegory of Britain’s imperial decline, which lacked even the merit of prophecy. It was just a dramatised rehash of the previous decade’s headlines. But the critics were not about to surrender their new-won status as oracles and they hailed it as an entirely original dramatic form, the state-of-the-nation play.\n\nMost popular Brendan O’Neill Prince Harry the Tyrannical\n\nThe Court has been looking for new specimens ever since. The idea rests on the assumption that the ‘nation’ is a doddery, half-deaf old patriarch who needs to have his sins recounted to him by smart alecs shouting a bit too loud. In the 1950s that may have been true but by the 1960s the old dodderer had been reborn as a hip young groover leading a worldwide revolution in music and fashion. At this point the state-of-the-nation play should have expired but for literary scribblers it was too valuable a theory to abandon altogether so they just plugged the old boy into a life-support machine and kept him going. The motor wheezes on to this day.\n\nOver the decades the Court has blooded countless young writers who are celebrated by the theatrical elite but whose names mean zilch to the general public. And it continues to ape the stale conventions laid down six decades ago. The Court favours fashionable controversy and it adores plays that set out to ‘provoke debate’ at the restaurant afterwards even though, as we all know, this merely licenses the gobbiest member of the party to bore the rest with his garden-shed perspective on history.\n\nThe current leadership doggedly pursues this arid ritual but on a worldwide canvas. The boss, Vicky Featherstone, stages dramas that illuminate neglected injustices in every corner of the globe, and her artistic programme reads like a commissioning long-list for Dispatches or Panorama. There is no tyranny, no epidemic, no atrocity and no genocide so remote or obscure that it cannot be transformed into a two-hour wrist-slasher to keep the angst-ridden billionaires of Belgravia awake at night.\n\nThe best things in life are free (for a month) Unlock a month’s worth of unlimited online and app access by subscribing today for free. After that, it’s just £1 a week – saving more than 50% off the usual rate. SUBSCRIBE\n\nBut the Court’s commitment to box-office poison has, on one famous occasion, been circumvented successfully. The Rocky Horror Show premièred in the studio space in 1973. This camp slice of mock-Gothic escapism is probably the Court’s least characteristic production. It’s eccentric, irreverent, very silly, great fun and wildly popular. It promotes no cause, it rallies no activists, and it has never inspired a New Statesman thinkpiece or an exchange of letters in the Guardian. Nor is it ever associated with the Royal Court. That says it all."}, {"url": "https://finboroughtheatre.co.uk/production/the-catherine-johnson-award-for-best-play-2007/", "page_content": "The Pearson Playwrights’ Scheme is delighted to announce the winner of the first Catherine Johnson Award for Best Play 2007. He is James Graham whose play Eden’s Empire was written whilst attached to the Finborough Theatre.\n\nThe Pearson Playwrights’ Scheme, formerly known as the Thames Television Theatre Writers’ Scheme, is one of the most prestigious awards for new writing in British theatre. It awards up to five bursaries a year, each worth £7,000, to writers of outstanding promise and allows the playwright a twelve-month attachment to a theatre and commissions the writers for a new play. Recipients of the bursaries for 2008 will be announced later this month.\n\nThe Scheme also offers an award for the Best Play written by the five bursary winners from the previous year. This new award, worth £10,000, has been generously donated by Catherine Johnson, a graduate of the Scheme and herself the winner of the Best Play written in 1991. Catherine, who is a member of the judging panel for new bursaries and author of Mamma Mia, has been looking for a way to give something back to the Scheme which helped and encouraged her in the early days of her career.\n\nJudges of the Pearson Award include Sir John Mortimer CBE QC, Dame Beryl Bainbridge, Catherine Johnson, Sue Summers, Thelma Holt CBE, Michael Billington, John Tydeman OBE and Jack Andrews MBE.\n\nPrevious recipients of the Pearson bursary over the last thirty years include Richard Bean, Alan Bleasdale, Gregory Burke, David Edgar, David Eldridge, Lee Hall, Jacqueline Holborough, Catherine Johnson, Charlotte Jones, Fin Kennedy, Hanif Kureshi, Nick Leather, Martin McDonagh, Gary Mitchell, Chloe Moss, Gary Owen, Joe Penhall, Winsome Pinnock, Billy Roche, Simon Stephens, Sue Townsend and Timberlake Wertenbaker.\n\nPrevious winners for the Pearson Award for the Finborough Theatre include Chris Lee in 2000, Laura Wade in 2005 for Colder Than Here which also won the Pearson Award for the Best Play, James Graham in 2006 and Al Smith in 2007. For three years running, the Finborough Theatre has been the only unfunded theatre to win a Pearson Bursary.\n\nJames Graham is Playwright-in-Residence at the Finborough Theatre. He has written three plays – commissioned by Artistic Director Neil McPherson for the Finborough Theatre – Albert’s Boy (2005), starring Victor Spinetti, which earned James a prestigious Pearson Award bursary, Eden’s Empire (2006) and Little Madam (2007). James was the Finborough Theatre’s nomination to the BBC and Royal Court’s programme for young writers, ‘The 50’, celebrating the Royal Court’s 50th anniversary. His original television comedy-drama, Caught in a Trap has been commissioned by producers Greenlit.\n\nand…\n\nWinner – The George Devine Award for Playwright-in-Residence and former Literary Manager Alexandra Wood 2007\n\nWinner – The Pearson Award bursary for Playwright-in-Residence Al Smith 2007\n\nShortlisted for The Empty Space Peter Brook Award for Studio Theatres, and The Empty Space Peter Brook Mark Marvin Award."}, {"url": "https://www.cambridge.org/core/books/royal-court-theatre-and-the-modern-stage/socialist-theatre-19651969/D2AC375C1A88828D992FBF39152296C3", "page_content": "I think it is a fact that isn't generally appreciated about the Court that there really were, after George and Tony, two very distinct kinds of tradition at the Court. One was Bill, together with Peter Gill. The other was Anthony and myself. (Lindsay Anderson, interview with the author, 5 December 1984).\n\nAll of them seemed to me to be non-political animals. The Court had a name for being a radical theatre but it was radical in a rather vague sort of way. It wasn't radical in any sort of way that connects with political philosophy. (Oscar Lewenstein, interview with the author, 14 December 1983)\n\nBefore he officially took over as Artistic Director, Gaskill produced on 26 March a position paper in which he reviewed the current state of the theatre. Some important things had changed. These included:\n\nThe emergence of the two large-scale permanent companies – The National Theatre and the Royal Shakespeare, playing in repertoire modern as well as classical plays. The decline of the West End Theatre as a home for straight plays. The death of weekly rep and the growth of two or three weekly rep companies and the raising of the standard of plays (though not necessarily of the performance) in the provinces'.\n\nThe theatre world had moved on since Devine began the venture, and the Court needed to reassess its position. The danger was that of innovator being overtaken. In particular, the question of ‘classic plays’ was to recur."}, {"url": "https://www.theguardian.com/stage/2021/nov/06/antisemitism-row-forces-royal-court-theatre-to-change-name-of-character", "page_content": "Al Smith may not be the first British playwright to ask “What’s in a name?”, but this weekend he had cause to ponder Shakespeare’s famous line.\n\nSmith, the author of a new play coming to the Royal Court theatre this week, had given a lead character the name of Hershel Fink. But publicity for the production prompted angry complaints about Jewish stereotyping. In response, the famous venue on Sloane Square in London has now apologised and agreed to change the name, admitting that it was “unconscious bias” that had led to the Silicon Valley billionaire in the work being given this identity.\n\nIn an official statement, the theatre management added that the character in Smith’s play, Rare Earth Mettle, which stars former Doctor Who actor Arthur Darvill, is not Jewish and that there is no reference to his faith or Jewishness in the show.\n\nAmong those to question the planned use of the name Hershel Fink were Adam Lenson, the director and producer, and David Baddiel, the writer and comedian.\n\n“The Royal Court claims they didn’t realise ‘Hershel Fink’ was a Jewish name. Hmmm. Somehow it just sounded so right for a world-conquering billionaire,” Baddiel posted on Twitter. This February, Baddiel’s new book, Jews Don’t Count, argued that antisemitic bias is the one prejudice that remains largely unpoliced in the “culture wars”.\n\nLenson was also critical on Twitter about the Royal Court taking “a character so clearly based on Elon Musk” and giving him “an obviously Jewish name”. He added: “Casually making a Silicon Valley billionaire Jewish perpetuates antisemitic stereotypes and will cause ideological harm.”\n\nLaura McGrady, who is a writer, questioned the venue’s claim to be unaware of the connotations of the name. “If I’m believing that no one noticed the problem here … which, I’m not. I’m not believing that at all. Then am I supposed to believe that writers give characters names from specific cultures or origins without even noticing? Seems a reach to me.”\n\nSet on a salt flat in South America, Rare Earth Mettle is a campaigning piece about the damage inflicted by powerful tech industries. The original Fink character was the chief executive of an electric car company and has been compared to Elon Musk in interviews with Smith.\n\nThe Royal Court said: “We are grateful to the members of the Jewish community who got in touch with the Royal Court to communicate the name of one of the characters in Rare Earth Mettle is antisemitic.\n\n“For clarification, the character is not Jewish and there is no reference to being Jewish in the play. We acknowledge that this is an example of unconscious bias and we will reflect deeply on how this has happened in the coming days. We and the writer are deeply sorry for harm caused. In response to our learning the writer has changed the name, as of last night.”\n\nSmith, who has written for Holby City and EastEnders, as well as for radio, penned the recent acclaimed ambulance service-based series of dramas, Life Lines, for BBC Radio 4. He said that he had deliberately aimed at a wide array of targets while writing Rare Earth Mettle, covering racism as well as many of the challenges facing both the global economy and ecology.\n\nBaddiel ironically paraphrased Smith’s ambition on Twitter: “I’ve written a play. Everything – particularly now and particularly about ethnicity – gets relentlessly discussed. Except as regards one ethnicity apparently.” And he commented: “It’s still a very instructive Jews Don’t Count episode.”\n\nBut Baddiel later recognised that the theatre and playwright had subsequently done the correct thing in responding to public dismay and changing the name."}]}