{"Catherine Johnson has been awarded the TMA Award for Best New Play.": [{"url": "https://finboroughtheatre.co.uk/production/the-catherine-johnson-award-for-best-play-2007/", "page_content": "The Pearson Playwrights’ Scheme is delighted to announce the winner of the first Catherine Johnson Award for Best Play 2007. He is James Graham whose play Eden’s Empire was written whilst attached to the Finborough Theatre.\n\nThe Pearson Playwrights’ Scheme, formerly known as the Thames Television Theatre Writers’ Scheme, is one of the most prestigious awards for new writing in British theatre. It awards up to five bursaries a year, each worth £7,000, to writers of outstanding promise and allows the playwright a twelve-month attachment to a theatre and commissions the writers for a new play. Recipients of the bursaries for 2008 will be announced later this month.\n\nThe Scheme also offers an award for the Best Play written by the five bursary winners from the previous year. This new award, worth £10,000, has been generously donated by Catherine Johnson, a graduate of the Scheme and herself the winner of the Best Play written in 1991. Catherine, who is a member of the judging panel for new bursaries and author of Mamma Mia, has been looking for a way to give something back to the Scheme which helped and encouraged her in the early days of her career.\n\nJudges of the Pearson Award include Sir John Mortimer CBE QC, Dame Beryl Bainbridge, Catherine Johnson, Sue Summers, Thelma Holt CBE, Michael Billington, John Tydeman OBE and Jack Andrews MBE.\n\nPrevious recipients of the Pearson bursary over the last thirty years include Richard Bean, Alan Bleasdale, Gregory Burke, David Edgar, David Eldridge, Lee Hall, Jacqueline Holborough, Catherine Johnson, Charlotte Jones, Fin Kennedy, Hanif Kureshi, Nick Leather, Martin McDonagh, Gary Mitchell, Chloe Moss, Gary Owen, Joe Penhall, Winsome Pinnock, Billy Roche, Simon Stephens, Sue Townsend and Timberlake Wertenbaker.\n\nPrevious winners for the Pearson Award for the Finborough Theatre include Chris Lee in 2000, Laura Wade in 2005 for Colder Than Here which also won the Pearson Award for the Best Play, James Graham in 2006 and Al Smith in 2007. For three years running, the Finborough Theatre has been the only unfunded theatre to win a Pearson Bursary.\n\nJames Graham is Playwright-in-Residence at the Finborough Theatre. He has written three plays – commissioned by Artistic Director Neil McPherson for the Finborough Theatre – Albert’s Boy (2005), starring Victor Spinetti, which earned James a prestigious Pearson Award bursary, Eden’s Empire (2006) and Little Madam (2007). James was the Finborough Theatre’s nomination to the BBC and Royal Court’s programme for young writers, ‘The 50’, celebrating the Royal Court’s 50th anniversary. His original television comedy-drama, Caught in a Trap has been commissioned by producers Greenlit.\n\nand…\n\nWinner – The George Devine Award for Playwright-in-Residence and former Literary Manager Alexandra Wood 2007\n\nWinner – The Pearson Award bursary for Playwright-in-Residence Al Smith 2007\n\nShortlisted for The Empty Space Peter Brook Award for Studio Theatres, and The Empty Space Peter Brook Mark Marvin Award."}, {"url": "https://www.nationalgeographic.com/history/article/katherine-johnson-mathematician-sent-apollo-moon-wins-hubbard-medal", "page_content": "Long before today’s technology was invented, Katherine Johnson was known as a computer. She calculated flight trajectories, by hand, for the United States space program.\n\nWithout the brilliance of a mind like Johnson’s, it’s uncertain whether John Glenn would have pioneered space missions and doubtful Neil Armstrong would have been the first human to step onto the surface of the moon.\n\nHer precise calculations ensured the astronauts made it to space safely and back.\n\nFor her contributions to space exploration, Katherine Johnson, who died in February 2020 at the age of 101, was selected as the 2020 recipient of the National Geographic Society Hubbard Medal, awarded for achievement in research, discovery, and exploration. Though she herself wasn’t physically exploring space, without her there might not have been any exploration at all.\n\nIn 1969, the Apollo astronauts were awarded the same prize. Now, the excellent work that made the mission possible is being celebrated.\n\n5:07\n\n\"We are honored to present Katherine Johnson the Hubbard Medal, the National Geographic Society's highest recognition, for her extraordinary contributions in the fields of science and exploration,” National Geographic Society CEO Jill Tiefenthaler said this week. “Fifty years ago, the Apollo 11 astronauts were awarded with the medal, and we’re honored to recognize the mathematician whose precise calculations made those flights possible. Katherine's legacy of exploration, innovation and inspiration lives on, and we are in awe of her remarkable achievements.\"\n\nThat legacy of inspiration lives on in Kavita Gupta, a chemistry teacher at Monta Vista High School, in Cupertino, California. Gupta says Johnson is her hero. “Katherine Johnson, the human computer, the third African-American woman to get a Ph.D., who helped NASA put an astronaut into orbit and then help put a man on the moon, inspires me with her pioneering legacy to break barriers and to challenge norms as a teacher and as a woman of color,” Gupta says.\n\nAs seen in the 2016 Academy Award-nominated film Hidden Figures, Johnson was among a group of Black women described as “human computers” who worked at NASA, then called the National Advisory Committee for Aeronautics, calculating space flight trajectories by hand. (Historic pictures show the hidden women of the space race.)\n\nHer exceptional work as a mathematician guided the 1961 mission on which Alan B. Shepherd became the first American in space. A year later, her calculating skills helped John Glenn to become the first American to orbit the Earth. Most notably, in 1969 she calculated trajectories that led the Apollo 11 to the moon, one of America’s greatest scientific feats.\n\nJohnson has been called a math genius. She entered high school when she was 10 and graduated four years later. She then entered West Virginia State College, a historically Black College and University, and finished her undergraduate degree by the age of 18.\n\nJohnson was fortunate to have had access to schools and education beyond the reach of most African Americans at the time. In her hometown of White Sulfur Springs, West Virginia, Black students in the segregated education system could go no further than sixth grade. Because of this, Johnson’s father, Joshua Coleman, moved the family 125 miles to the town of Institute, also in West Virginia, where she and her siblings could receive a full education.\n\nIn 1939, Johnson was selected to become the first Black woman to integrate West Virginia University’s graduate school, where she pursued a master’s degree in mathematics.\n\nIn 1952 Johnson joined NASA and its cohort of Black women mathematicians.\n\nPlease be respectful of copyright. Unauthorized use is prohibited.\n\nIt wasn’t Johnson’s intention to break down barriers, says Kathy Moore, the youngest of her three daughters.\n\n“She was a mathematician bar none, but she didn't wear it,” Moore says. “You know, she just did it.”\n\nBoth Johnson’s living daughters followed in their mother’s footsteps to became mathematicians. Joylette Hylick began working for NASA after she graduated from Hampton University in 1962. Moore had a 33-year career as math teacher and counselor. Both are now retired. A third daughter, Constance Goble Garcia, died in 2010.\n\n‘She was fearless’\n\nMoore says her mother was a model of fearlessness when she and her sisters were growing up.\n\n“You can just imagine in the 30s, 40s, and 50s,” Moore says. “It was kind of hard for females to be in the workforce number one, and then to be in a field like research, and mathematics, she sort of had to feel her way. What she had that I think got her through was, she was fearless.”\n\nHylick remembers her mother telling her and her sisters to do what you have to do to get the job done. “My mom said, be assertive, not aggressive. You know, you don't have to make too much noise, just do what you have to do.”\n\n“People ask if John Glenn, or the astronauts, knew mom,” Hylick says. “I think they knew of her. They knew her reputation, but there probably was no more respect than that because when the day was over, they went into their white world. We went into our world,” she says, adding, “we had everything we needed except money and opportunity.”\n\nJohnson’s efforts opened doors for others, and she laid the groundwork for women astronauts such as Christina Koch, who held the record for the longest single space flight by a woman after completing her first mission on board the International Space Station in March 2019. On the following mission, in October, Koch and crewmate Jessica Meir made the first all-female space walk.\n\nPlease be respectful of copyright. Unauthorized use is prohibited. Please be respectful of copyright. Unauthorized use is prohibited. Please be respectful of copyright. Unauthorized use is prohibited. Please be respectful of copyright. Unauthorized use is prohibited. Please be respectful of copyright. Unauthorized use is prohibited. Please be respectful of copyright. Unauthorized use is prohibited. Please be respectful of copyright. Unauthorized use is prohibited. Please be respectful of copyright. Unauthorized use is prohibited. 1 / 8 1 / 8 <p>Apollo 17 mission Commander Eugene Cernan checks out the lunar roving vehicle (LRV) at the Taurus-Littrow landing site in December 1972. LRVs, also called moon buggies, are electric vehicles designed to expand astronauts' range of exploration on the low-gravity surface of the moon. The east end of the moon's South Massif rises in the background at right.</p> Moon Buggy Apollo 17 mission Commander Eugene Cernan checks out the lunar roving vehicle (LRV) at the Taurus-Littrow landing site in December 1972. LRVs, also called moon buggies, are electric vehicles designed to expand astronauts' range of exploration on the low-gravity surface of the moon. The east end of the moon's South Massif rises in the background at right. Photograph courtesy NASA\n\n“When I think about my experiences and those of Katherine Johnson, I am completely in awe,” Koch says. “She overcame so much more overt prejudice, so many more challenges than I was ever faced with. But what I see as similarities is that we were both motivated by a true love for what we saw as our calling.” (Remembering Katherine Johnson for her love of numbers.)\n\nIn 2016, NASA named a $30 million, 40,000-square-foot Computational Research Facility in her honor.\n\nFormer NASA administrator and astronaut Charlie F. Bolden says he hadn’t heard about Katherine Johnson while he was growing up or even later during his career.\n\n“When president Obama decided to give her the Presidential Medal of Freedom, I said, I have to be there.’ I was literally in tears throughout the entire ceremony, because this was an iconic figure that I was finally having an opportunity to meet.”\n\nInfluencing Black students today\n\nJohnson’s work and legacy influences Black children aspiring to be scientists or to enter the fields of Science, Technology, Engineering, and Math, known as STEM. (Meet history's most brilliant female coders.)\n\nPlease be respectful of copyright. Unauthorized use is prohibited.\n\nMorgan Wellons, 12, from Atlanta, Georgia, sees Johnson as inspirational. She and sisters Madison, 10, and Monroe, 7, dressed up as the women featured in the Hidden Figures movie. “What made her so special was how she did all of those things with people around her doubting what she said and did,” Wellon says. “Katherine Johnson has taught me to believe in myself and not look for approval from other people, especially men.”\n\nMadison Wellons says Johnson gives her the confidence that she too can achieve anything. “Katherine Johnson was special because she was the most brilliant and smartest person in the room, and she knew it, but she was also humble about it,” Madison says. “Katherine Johnson taught me not to let anyone bring me down and that women are capable of doing anything they want to do.”\n\nWhen asked about what the Hubbard Medal means to the Johnson family, daughters Moore and Hylick say their mother would have been gratified to be recognized with such a prestigious award.\n\n“I just think that award, you know, it's gone to the astronauts, it's gone to deGrasse Tyson, it's gone to people that have been recognized as innovators,” Moore says. “She was an exciting, quiet thunder who managed to open up the world of space, but I think in terms of the medal, she would say, ‘I can't believe it.’ I think she would be quite honored to be in the presence of, or on the list with, those people.”\n\nMeet the 2020 National Geographic Award recipients For more than 130 years, the National Geographic Society has invested in and elevated the work of explorers, educators and storytellers. On Thursday, eight other inspiring pioneers were honored with National Geographic Awards, given annually to the world’s most innovative trailblazers who have made incredible contributions in science, education, technology, storytelling, and conservation. Rolex National Geographic Explorer of the Year: Corey Jaskolski Engineer Corey Jaskolski, recipient of the explorer of the year award, was honored for his innovative imaging techniques which have helped redefine exploration and conservation. A National Geographic Fellow, engineer and inventor, Jaskolski designs, builds and deploys technologies for exploration and conservation missions in some of the world’s most unique and unforgiving environments. Eliza Scidmore Award for Outstanding Science Media: Erika Larsen As an award-winning photographer and storyteller, Larsen creates intimate essays about cultures that maintain close ties with nature. The Eliza Scidmore Award recognizes her inclusive, visionary, and conservation-focused storytelling. Further Award: Jimmy Chin & Elizabeth Chai Vasarhelyi Through their daring and captivating work, Jimmy Chin and Elizabeth Chai Vasarhelyi have given us a front-row seat to astonishing physical feats and triumphs and a spellbinding look at hard-to-reach places that few have seen in person. Among their groundbreaking films is the award-winning Free Solo, which follows climber Alex Honnold as he becomes the first person to ascend Yosemite’s El Capitan without a rope. They received the Further Award for their achievements as boundary-pushing filmmakers and storytellers. Gilbert M. Grosvenor Educator of the Year: Jennifer Chavez-Miller As a full-time educator at Central New Mexico Community College, Jennifer Chavez-Miller creates unique opportunities for her students to develop global competence and connect with the world. Her commitment to inspiring a new generation of empowered, curious, and engaged lifelong learners and global citizens is the reason educator Jennifer Chavez-Miller was selected for the Gilbert M. Grosvenor Educator of the Year award. National Geographic Society/Buffett Awards for Leadership in Conservation: Jeannie Raharimampionona & Angela Maldonado Conservationist Jeannie Raharimampionona was awarded the National Geographic Society/Buffett Award for Leadership in Conservation in Africa for her dedication over the last two decades to protecting and bringing awareness to the massive destruction of the Malagasy flora. Through her work, Jeannie has created 11 — soon to be 12 — protected areas that will help conserve the extraordinary diversity of plants only found in Madagascar. Conservationist Angela Maldonado was awarded the National Geographic Society/Buffett Award for Leadership in Conservation in Latin America for her dedication to reducing the illegal wildlife trade in the Colombian and Peruvian Amazon. Her efforts have resulted in a hunting ban on night monkeys and an open investigation into this illegal market, dramatically reducing the trafficking of night monkeys captured and sold for use in laboratory experiments. Planetary Leadership Award: Justin Trudeau Justin Trudeau, the prime minister of Canada, received the Planetary Leadership Award in recognition of his efforts to protect Canada’s land and waters. Trudeau has increased Canada’s protected marine areas from less than one percent in 2015 to 14 percent today. Though the award is being given to the Prime Minister, it also recognizes Canada’s partnership with the Qikiqtani Inuit Association and the Government of Nunavut to invest almost $200 million to establish Tallurutiup Imanga National Marine Conservation Area and Tuvaijuittuq Marine Protected Area. This transformative partnership with Indigenous peoples will help protect more than 425,000 square kilometers of ocean."}, {"url": "https://www.britannica.com/biography/Katherine-Johnson-mathematician", "page_content": "Katherine Johnson’s maiden name was Coleman. From 1939 to 1956 she was Katherine Goble, having married James Goble. Three years after his death, she married James Johnson.\n\nIn 1939 Johnson was selected to be one of the first three African American students to enroll in a graduate program at West Virginia University. Later she was a member of a group of NASA employees called \"computers,\" made up of African American women who excelled in mathematics and problem-solving.\n\nKatherine Johnson, née Katherine Coleman, also known as (1939–56) Katherine Goble, (born August 26, 1918, White Sulphur Springs, West Virginia, U.S.—died February 24, 2020, Newport News, Virginia), American mathematician who calculated and analyzed the flight paths of many spacecraft during her more than three decades with the U.S. space program. Her work helped send astronauts to the Moon.\n\nColeman’s intelligence and skill with numbers became apparent when she was a child; by the time she was 10 years old, she had started attending high school. In 1937, at age 18, Coleman graduated with highest honours from West Virginia State College (now West Virginia State University), earning bachelor’s degrees in mathematics and French. She subsequently moved to Virginia to take a teaching job. In 1939, however, she was selected to be one of the first three African American students to enroll in a graduate program at West Virginia University. She studied math there but soon left after marrying James Goble and deciding to start a family. He died in 1956, and three years later she married James Johnson.\n\nBritannica Quiz Numbers and Mathematics\n\nIn 1953 she began working at the National Advisory Committee for Aeronautics (NACA)’s West Area Computing unit, a group of African American women who manually performed complex mathematical calculations for the program’s engineers. The women, known as the West Computers, analyzed test data and provided mathematical computations that were essential to the success of the early U.S. space program. During this time, NACA was segregated, and the West Computers had to use separate bathrooms and dining facilities. That changed in 1958 when NACA was incorporated into the newly formed National Aeronautics and Space Administration (NASA), which banned segregation.\n\nAt NASA Johnson was a member of the Space Task Group. In 1960 she coauthored a paper with one of the group’s engineers about calculations for placing a spacecraft into orbit. It was the first time a woman in her division received credit as an author of a research report. Johnson authored or coauthored 26 research reports during her career.\n\nJohnson also played an important role in NASA’s Mercury program (1961–63) of crewed spaceflights. In 1961 she calculated the path for Freedom 7, the spacecraft that put the first U.S astronaut in space, Alan B. Shepard, Jr. The following year, at the request of John Glenn, Johnson verified that the electronic computer had planned his flight correctly. Glenn subsequently made history aboard Friendship 7, becoming the first U.S. astronaut to orbit Earth. Johnson was also part of the team that calculated where and when to launch the rocket for the Apollo 11 mission of 1969, which sent the first three men to the Moon. Johnson later worked on the space shuttle program. She retired from NASA in 1986.\n\nJohnson received numerous awards and honours for her work, including the Presidential Medal of Freedom (2015). In 2016 NASA named a building, the Katherine G. Johnson Computational Research Facility, after her. That year Margot Lee Shetterly published Hidden Figures: The American Dream and the Untold Story of the Black Women Mathematicians Who Helped Win the Space Race, about the West Computers, including Johnson, Dorothy Vaughan, and Mary Jackson. A film based on the book was also released in 2016. Johnson’s memoir, My Remarkable Journey (2021; written with Joylette Hylick and Katherine Moore), was published posthumously."}, {"url": "https://study.com/academy/lesson/katherine-johnson-facts-accomplishments.html", "page_content": "Kimberly Slifer has a bachelor’s degree in biology with a minor in chemistry. Additionally, she has two master’s degrees. One in biology education and one in educational leadership. She has eight years of experience teaching high school Biology and Anatomy as well as Dual Enrollment Biology.\n\nWho was Katherine Johnson?\n\nKatherine Johnson (maiden name Coleman) was best known for her work at NASA to support America in the space race in the 1950s. She is famous for being awarded the Presidential Medal of Honor, having a building named after her at NASA, and having her life legacy depicted in the book and subsequent movie, \"Hidden Figures.\" However, her journey to NASA was not an easy one. The 1950s were a time of racism and segregation which created constant roadblocks for people of color. Johnson greatly contributed to America's first human spaceflight, conducting the mathematical trajectory for that mission. Johnson then became a contributor to Glenn's Friendship 7 Mission, performing the math work to ensure the computers were correct. Because of these projects and her work, America was able to enter the space race with the Soviet Union.\n\nIn 1952, Katherine Johnson moved her family to Virginia to work in aeronautics. Johnson began work with NACA (National Advisory Committee for Aeronautics) which eventually became NASA (National Aeronautics and Space Administration). This was a challenging journey as she was only one of three Black women who were working at NASA. The other two women were Mary Jackson and Dorothy Vaughan. Johnson was also groundbreaking in other ways outside of the aeronautical world. Johnson was a pioneer for people of color as well as women during a time of segregation and women's suffrage. In her youth, she was also one of three Black students that were the first to study at the previously all-white West Virginia State University graduate program.\n\n\n\n\n\nKatherine Johnson\n\n\n\n\n\nFamily and Early Life\n\nKatherine Coleman was born in 1918 in White Sulfur Springs, West Virginia, to Joylette, a teacher, and Joshua, a farmer and janitor. Because this was before Brown vs. Board of education, segregation in schools was still common. Sulfur Springs in particular did not have a school that Black students were able to attend. To get away from an area of extreme segregation and nourish her desire to learn, Johnson's family moved to Institute, West Virginia. There she attended West Virginia State High School, where she graduated at the age of fourteen. It was at this high school that Katherine found her love for and talents in both mathematics and astronomy.\n\nAfter earning her high school diploma, she attended West Virginia State University (then known as West Virginia State College) and earned a BS in both French and mathematics in 1937. College was a difficult time for Katherine as she had to work harder to prove that not only people of color, but women could be successful in college, specifically in mathematics. Katherine was so successful at mathematics that a special course was created just for her called \"analytic geometry.\"\n\nLife After College\n\nAfter college, Katherine married James Goble and began attending graduate school. However, when she became pregnant, she left college to focus on her family and became a school teacher of mathematics. She taught mathematics in both elementary and high school. She and James had three daughters: Constance, Joylette, and Katherine. Unfortunately, in 1956, James died from a brain tumor. In 1959, Katherine married Colonel James A. Johnson.\n\nIn 1953, Katherine missed the laboratory setting and moved her family to Newport News, Virginia to work at NACA. During the 1950s, computers were very new and not trustworthy. However, few people understood the complex mathematics required for space travel. This was how Katherine was able to achieve her position as the only woman on the team, despite the hurdles of segregation and sexism. She was exceptional in her ability to calculate trajectories necessary for space flights. Her skills were so important to the success of the mission that she was a high priority at the meetings, which were up until then only open to men. If it were not for her ability to perform calculations better than the computers of that time, the astronauts' safety would have been at risk. In 1958, NACA became NASA and Johnson joined the Spacecraft Controls Branch to help calculate the trajectories for the mission to bring the first American into space, Alan Shepherd."}, {"url": "https://officiallondontheatre.com/news/tma-award-winners-announced-102664/", "page_content": "Black Watch, the RSC’s Histories cycle and The Pitmen Painters were among several shows seen in London recently which were honoured at the Theatrical Management Association Awards held at Hampstead theatre yesterday. Manchester’s Royal Exchange, Chichester Festival Theatre and the Liverpool Playhouse also received awards in the annual ceremony which recognises the best in UK regional theatre.\n\nMichael Boyd, Artistic Director of the Royal Shakespeare Company, received the Best Director award for his staging of Shakespeare’s Histories cycle, which came to the Roundhouse in April. Best New Play went to Lee Hall’s play The Pitmen Painters, which premiered at Live Theatre, Newcastle, before playing at the National Theatre, where it will return next year. The National Theatre of Scotland’s production of Gregory Burke’s Black Watch, which played at the Barbican this June, collected Best Touring Production.\n\nAlso among the winners were Marcus Romer’s stage adaptation of Anne Cassidy’s novel Looking For JJ (Best Show for Children and Young People), which played at the Unicorn in the autumn of 2007, and Mischief (Achievement in Dance), a production commissioned by Sadler’s Wells from Theatre Rites and Arthur Pita.\n\nIn the performance categories, Brenda Blethyn received Best Performance in a Play for the Royal Exchange’s production of The Glass Menagerie; while Kate O’Flynn picked up Best Supporting Performance in a Play for another Royal Exchange production, The Children’s Hour, which also won Best Lighting Design. Brian Conley collected Best Performance in a Musical for The Music Man at Chichester Festival Theatre, and Martin Ball received Best Supporting Performance in a Musical for the national tour of Mary Poppins.\n\nTheatre impresario Bill Kenwright was honoured with the association’s Special Award for Individual Achievement.\n\nThe TMA Awards kick off an awards season that will also include the Evening Standard, Critics’ Circle, Theatregoers’ Choice and Laurence Olivier Awards.\n\nCB\n\nFull list of TMA Award winners:\n\nBEST PERFORMANCE IN A PLAY\n\nBrenda Blethyn for the Royal Exchange Theatre Company’s The Glass Menagerie\n\n\n\nBEST SUPPORTING PERFORMANCE IN A PLAY\n\nKate O’Flynn for the Royal Exchange Theatre Company’s The Children’s Hour\n\n\n\nBEST PERFORMANCE IN A MUSICAL\n\nBrian Conley for The Music Man at Chichester Festival Theatre\n\nBEST SUPPORTING PERFORMANCE IN A MUSICAL\n\nMartin Ball for Mary Poppins on tour\n\nBEST DIRECTOR\n\nMichael Boyd for The Histories at the Royal Shakespeare Company in Stratford-Upon-Avon\n\nBEST TOURING PRODUCTION\n\nNational Theatre of Scotland’s Black Watch\n\nBEST MUSICAL PRODUCTION\n\nOnce Upon A Time At The Adelphi at the Playhouse, Liverpool\n\nBEST NEW PLAY\n\nThe Pitmen Painters by Lee Hall at Live Theatre, Newcastle\n\nBEST SET DESIGN\n\n\n\nMike Britton for Lady From The Sea at Birmingham Rep\n\nBEST LIGHTING DESIGN\n\nThe Royal Exchange Theatre Company’s The Children’s Hour designed by Mick Hughes\n\nBEST SHOW FOR CHILDREN AND YOUNG PEOPLE\n\nLooking For JJ, adapted from Anne Cassidy’s novel by Marcus Romer, Pilot Theatre in association with York Theatre Royal and Unicorn Theatre on tour\n\nACHIEVEMENT IN DANCE\n\nTheatre-Rites & Arthur Pita for Mischief, an enormously playful collage of movement, music and visual arts designed to delight the whole family.\n\nACHIEVEMENT IN OPERA\n\nOpera North for its summer Shakespeare season of Macbeth, A Midsummer Night’s Dream and Romeo Et Juliette\n\nTHE STAGE AWARD FOR SPECIAL ACHIEVEMENT IN REGIONAL THEATRE\n\nLatitude Festival\n\n\n\nTHE SPECIAL AWARD FOR INDIVIDUAL ACHIEVEMENT\n\nBill Kenwright\n\n"}, {"url": "https://www.eoas.ubc.ca/news-events/news/1648537200", "page_content": "The Department is pleased to announce that Professor Catherine Johnson has been awarded the Killam Research Prize, an award which recognizes the outstanding research contributions of faculty from across all disciplines. Prize recipients are celebrated for creating and disseminating knowledge that has a global impact.\n\nDr. Johnson’s work is more than global, and focuses on the history and evolution of terrestrial planets – namely, Mercury, Mars and Venus. She uses remotely-sensed geophysical data to better understand the history and evolution of terrestrial planets, and has worked on several NASA planetary missions, including the Mars InSight mission and the Mercury MESSENGER mission. Her current work aims to understand the magnetic fields of Mercury and Mars, including when and why they formed, their current state, and how the fields interact with the solar wind. “A huge unknown” she explains, “is the level to which magnetic fields protect a planet’s atmosphere from space weather”, a question with implications for human space exploration and habitability in this solar system and beyond.\n\nHer work also focuses on planetary evolution and internal structure, and what that means for current planetary seismic and volcanic activity. Dr. Johnson works with a wide range of remotely sensed data, including altimetry, radar and gravity measurements. Data is collected by lightweight, low-power, instruments specifically designed to resist the challenges of operating in space.\n\n“You’re required to be very creative, in a responsible way” she says of the intrinsic limitations on data quality and availability. Leaps and bounds in instrument technology between missions means that new data can improve on in resolution by an order of magnitude or more, revealing in detail features that may have previously taken up only a handful of pixels. “I love it; with each new mission to a planet or moon or asteroid you almost always see something unexpected.”\n\nLooking forward, Professor Johnson is excited for multiple upcoming missions to Venus which will collect data on the composition and structure of the planet’s atmosphere and surface. She plans to answer questions about Venus’ suspected volcanic and tectonic activity using data previously shrouded from view by the planet’s thick, toxic atmosphere. “Venus was my first planet” she says, referring to the geophysical work she did on the planet during her PhD and postdoctoral studies. “It is so different from the Earth in so many ways, but would look equally habitable to our planet from a galaxy away – why is that?”\n\nThough not directly involved in the upcoming missions, Dr. Johnson will have access to the resulting publicly available data. With datasets so sparse and expensive to obtain, collaboration is a driving force in propelling the field of planetary science forward. She stresses the key role it has played in her research group’s success: “this award is an honour, and it’s not about me; its about the people who I’ve had the privilege to work and collaborate with.”\n\nProfessor Johnson (2nd from right) and recent research group members Megan Russell, Anna Mittelholz, Anna Grau, and Georgia Peterson at the Lunar and Planetary Sciences Conference"}, {"url": "https://www.broadwayworld.com/people/Catherine-Johnson/", "page_content": "Catherine Johnson BIO\n\nTheatre: Rag Doll and Renegades (Bristol Old Vic), Too Much Too Young (Bristol Old Vic and London Bubble), Boys Mean Business, Dead Sheep, Little Baby Nothing (Bush Theatre, London), Shang-a-Lang (Bush Theatre and national tour) and MAMMA MIA! (worldwide). Her plays have been produced in Germany, Denmark and Sweden. Through the Wire, a musical for NT/Shell Connections.\n\n\n\nTelevision: Episodes of \"Casualty\", \"Byker Grove\", \"Love Hurts\", \"Gold\", \"Linda Green\", the screenplays of \"Rag Dol\"l and \"Where’s Willy?\" (HTV) and \"Sin Bin\" (BBC), the series \"Love in the 21st Century\" (Channel 4).\n\n\n\nAwards: Catherine has won the Bristol Old Vic/HTV Playwrighting Award, Thames Television’s Writer-in-Residence Award and Thames Television’s Best Play Award and was nominated in 2002 for a Tony Award for Best Musical Book for MAMMA MIA!\n\n\n\nFILM: Catherine has written the screenplay for the MAMMA MIA! movie released July 2008."}, {"url": "https://www.aip.org/fyi/2015/former-nasa-mathematician-katherine-johnson-awarded-presidential-medal-freedom", "page_content": "Former NASA mathematician and physicist Katherine Johnson, known for calculating historic space launch trajectories by hand and shattering gender and racial barriers in science, received the nation’s highest civilian award\n\nPhysicist and mathematician Katherine Johnson, a former NASA “computer” who calculated by hand the flight trajectories for Alan Shepard’s historic first American flight to space, John Glenn’s first American orbit around the Earth, and the Apollo 11 moon shot, is one of 17 recipients of the Presidential Medal of Freedom this year. President Obama awarded the nation’s highest civilian honor to her in person in a ceremony held at the White House on Nov. 24.\n\n“Katherine G. Johnson is a pioneer in American space history. A NASA mathematician, Johnson’s computations have influenced every major space program from Mercury through the Shuttle program,” read the White House press release. Johnson’s contributions are all the more remarkable given that she is a female African-American who grew up at the height of tensions around racial segregation in the nation. Said NASA Administrator Charles Bolden in a statement:\n\nKatherine Johnson once remarked that even though she grew up in the height of segregation, she didn’t think much about it because ‘I didn’t have time for that… don’t have a feeling of inferiority. Never had. I’m as good as anybody, but no better.’\n\nThe truth in fact, is that Katherine is indeed better. She’s one of the greatest minds ever to grace our agency or our country, and because of the trail she blazed, young Americans like my granddaughters can pursue their own dreams without a feeling of inferiority.\n\nJohnson’s remarkable talent in mathematics was coupled with a boldness of character\n\nBolden continued:\n\nBorn in 1918, Johnson was drawn to math from a young age, leaving her West Virginia hometown to enroll in high school at the age of 10. She continued on to a mathematics major program at West Virginia State College by the age of 15, graduated summa cum laude at the age of 18, and taught math for a number of years. In 1953, when the predecessor to NASA, the National Advisory Committee for Aeronautics, opened up hiring to African-Americans and women for the first time, Johnson was hired as a research mathematician.\n\nJohnson had a reputation at NASA for bucking the expectations that women were to do what they were told. Instead, Johnson showed confidence among men and boldly took initiative in her work. “I asked questions. I wanted to know why,” said Johnson in an interview with NASA. In calculating the trajectories of capsules along a parabola, “I said, ‘Let me do it. You tell me when you want it and where you want it to land, and I’ll do it backwards and tell you when to take off.’ That was my forte.”\n\nSaid NASA Deputy Administrator Dava Newman in a statement:\n\nWe are all so fortunate that Katherine insisted on asking questions, and insisted on relentlessly pursuing answers. We are fortunate that when faced with the adversity of racial and gender barriers, she found the courage to say ‘tell them I’m coming.’ We are also fortunate that Katherine has chosen to take a leading role in encouraging young people to pursue education in the STEM disciplines of science, technology, engineering, and math.\n\nPhysics and mathematics continue to be central to Johnson’s world\n\nCurrently a resident of Hampton, Virginia, Johnson often speaks to students about pursuing careers in STEM. At the age of 97, physics and mathematics remains the center of her world. “There will always, always be mathematics. Everything is physics and math,” said Johnson.\n\nThe Presidential Medal of Freedom is presented to “individuals who have made especially meritorious contributions to the security or national interests of the United States, to world peace, or to cultural or other significant public or private endeavors.” The President himself selects the recipients with the assistance of senior White House staff, and his picks have been described as a very personal decision. Other awardees this year include former baseball player Yogi Berra, former representative Shirley Chisholm, pop music artists Gloria and Emilio Estefan, Senator Barbara Mikulski (D-MD), violinist Itzhak Perlman, theater composer Stephen Sondheim, movie director Steven Spielberg, actor and singer Barbra Streisand, and singer-songwriter James Taylor."}, {"url": "https://inews.co.uk/news/new-years-honours-list-2022-full-who-mbe-obe-cbe-knight-dame-difference-explained-1378053", "page_content": "The 2022 New Year’s Honours list has been revealed, with recognition for everyone from Covid medical heroes and sports stars to James Bond.\n\nChris Whitty, England’s chief medical officer (CMO), and his deputy Jonathan Van-Tam both received knighthoods, as did Scotland’s CMOs Frank Atherton and Dr Gregor Smith.\n\nJason and Laura Kenny received a knighthood and damehood respectively, and are thought to be the first married couple recognised on the same honours list.\n\nAside from Team GB’s Olympic heroes, US Open-winning tennis ace Emma Raducanu was awarded an MBE, while Daniel Craig was given a special diplomatic honour after his final outing as Bond.\n\nAs always, though, beyond the famous faces were countless ordinary people recognised for their extraordinary contribution – here’s the list in full, and what the different awards mean.\n\nWhat are the different types of honour?\n\nCompanions of Honour (CH)\n\nThe Order of the Companions of Honour was founded on June 4 1917 by George V and it limited to just 65 members at any one time. Appointments go to those who have made a long-standing contribution to arts, science, medicine or government.\n\nOrder of the Bath (DCB/KCB/CB)\n\nThis recognises the work of senior military officials and civil servants. England’s chief medical officer Professor Chris Whitty (KCB) and chief scientific adviser Sir Patrick Vallance (KCB) were honoured in the New Year Honours list.\n\nOrder of St Michael and St George (Knight/GCMG/KCMG/DCMG/CMG)\n\nThis recognises service in a foreign country, or in relation to foreign and Commonwealth affairs, such as the work of diplomats overseas.\n\nKnighthood and damehood (Knight/DBE)\n\nThese are usually bestowed on people who have made a major contribution at national level, who can use the titles Dame and Sir.\n\nCommanders of the Order of the British Empire (CBE)\n\nPeople are recognised under this honour if they have have a prominent but lesser role at national level, or a leading role at regional level. It also goes to those who make a distinguished, innovative contribution to any area.\n\nOfficer of the Order of the British Empire (OBE)\n\nPeople are made an Officer of the Order of the British Empire if they have a major local role in any activity, including people whose work has made them known nationally.\n\nMember of the Order of the British Empire (MBE)\n\nThis rank recognises outstanding achievements or service to the community which have had a long-term significant impact.\n\nBritish Empire Medal (BEM)\n\nThe BEM was reintroduced in 2012 by then prime minister David Cameron as part of his bid to make the honours system “classless”, saying too few people making a difference in their areas were made MBEs.\n\nThe medal went to 361 people in the New Year Honours.\n\nThe 2022 New Year’s Honours List in full\n\nORDER OF THE COMPANIONS OF HONOUR\n\nMembers of the Order of the Companions of Honour (CH)\n\nLord Frank Field Of Birkenhead DL. For Public and Political Service. (London, Greater London)\n\nSir Paul Maxime Nurse. For services to Science and Medicine in the UK and Abroad. (Oxford, Oxfordshire)\n\nKNIGHTS COMMANDER OF THE ORDER OF THE BATH (KCB)\n\nKnights Commander of the Order of the Bath (KCB)\n\nSir Patrick John Thompson Vallance. Government Chief Scientific Adviser, Government Office for Science. For services to Science in Government. (London, Greater London)\n\nProfessor Christopher John MacRae Whitty CB. Chief Medical Officer for England. For services to Public Health. (London, Greater London)\n\nORDER OF THE BRITISH EMPIRE\n\nDames Commander of the Order of the British Empire (DBE)\n\nDr Vivienne Cox CBE. Independent Non-Executive Director and Workforce Engagement Director, GSK and Chair, Rosalind Franklin Institute. For services to Sustainability, and to Diversity and Inclusion in Business. (Hemel Hempstead, Hertfordshire)\n\nDr Jennifer Margaret Harries OBE. Chief Executive, UK Health Security Agency. For services to Health. (Monmouth, Monmouthshire)\n\nSylvia Lloyd Heal. For Political and Public Service. (Egham, Surrey)\n\nLaura Rebecca Kenny CBE. For services to Cycling. (Marton, Cheshire)\n\nSara Khan. Lately Lead Commissioner, Commission for Countering Extremism. For services to Human Rights and Counter Extremism. (Watford, Hertfordshire)\n\nEmily Lawson. Lately Chief Commercial Officer, NHS England and NHS Improvement. For services to the NHS, particularly during Covid-19. (Henley on Thames, Oxfordshire)\n\nDiane Elizabeth Lees CBE. Director General, Imperial War Museum. For services to Museums and Cultural Heritage. (Nottingham, Nottinghamshire)\n\nJoanna Lumley OBE. For services to Drama, to Entertainment and to Charitable Causes. (London, Greater London)\n\nProfessor Julie Elspeth Lydon OBE. Lately Vice-Chancellor, University of South Wales. For services to Higher Education. (Stroud, Gloucestershire)\n\nDr June Munro Raine CBE. Chief Executive, Medicines and Healthcare products Regulatory Agency. For services to Healthcare and the Covid-19 Response. (Bishops Stortford, Hertfordshire)\n\nVanessa Redgrave CBE. Actress. For services to Drama. (London, Greater London)\n\nProfessor Sarah Marcella Springman CBE. Rector and Professor of Geotechnical Engineering, ETH Zurich. For services to Engineering and to International Sports Administration. (Egham, Surrey)\n\nProfessor Helen Jayne Stokes-Lampard. Chair, Academy of Medical Royal Colleges and Chair, National Academy of Social Prescribing. For services to General Practice. (Tamworth, Staffordshire)\n\nKnights Commander of the Order of the British Empire (KBE)\n\nThe Right Honourable Professor Ajay Kumar Lord Kakkar. For services to Healthcare and Public Service. (London, Greater London)\n\nThe Rt. Hon. The Lord Thomas McLaughlin McAvoy. For Political and Public Services. (Rutherglen, Lanarkshire)\n\nKNIGHTS BACHELOR\n\nDr Francis Atherton. Chief Medical Officer, Welsh Government. For services to Public Health. (Penarth, Vale of Glamorgan)\n\nThe Rt. Hon. John Dominic Battle. For Political and Public Service. (Leeds, West Yorkshire)\n\nJohn Boorman CBE. Film Director. For services to Film. (Abroad)\n\nJan Petrus du Plessis. Executive Chairman, BT Group. For services to Telecommunications and Business. (Penn, Buckinghamshire)\n\nProfessor Anthony Finkelstein CBE. Lately Chief Scientific Adviser, National Security. For Public Service. (London, Greater London)\n\nThe Rt. Hon. Robert Goodwill MP. Member of Parliament for Scarborough and Whitby. For Political and Public service. (York, North Yorkshire)\n\nProfessor Robin William Grimes FRS FREng. Lately Chief Scientific Adviser, Ministry of Defence Nuclear. For services to UK Resilience and International Science Relationships. (London, Greater London)\n\nDavid Winton Harding. For services to Philanthropy. (London, Greater London)\n\nProfessor John Anthony Hardy FRS. Chair of the Molecular Biology of Neurological Disease, University College London. For services to Human Health in Improving Understanding of Dementia and Neurodegenerative Diseases. (London, Greater London)\n\nJason Francis Kenny CBE. For services to Cycling. (Marton, Cheshire)\n\nIan Livingstone CBE. For services to the Online Gaming Industry. (London, Greater London)\n\nPeter Edward Murray CBE. Founding and Executive Director, Yorkshire Sculpture Park. For services to the Arts. (Huddersfield, West Yorkshire)\n\nProfessor Jonathan Stafford Nguyen-Van-Tam MBE. Deputy Chief Medical Officer. For services to Public Health. (Lincolnshire)\n\nDr Douglas Edwin Oakervee FrEng CBE. Chair, Independent Review of HS2. For services to Transport and Infrastructure Delivery. (Newmarket, Suffolk)\n\nHorace Shango Ove CBE. Film Maker and Photographer. For services to Media. (London, Greater London)\n\nMark Trevor Phillips OBE. For services to Equality and Human Rights. (London, Greater London)\n\nProfessor Shakeel Ahmed Qureshi. Professor of Paediatric Cardiology, Guy’s and St Thomas’ Hospitals Foundation Trust. For services to Paediatric Cardiology and Charity. (London, Greater London)\n\nThe Rt. Hon. Peter John Robert Riddell CBE. Lately Commissioner for Public Appointments. For Public Service. (London, Greater London)\n\nWilliam Anthony Bowater Russell. Lately Lord Mayor of London. For services to Financial Innovation, Culture, and Wellbeing in the City of London particularly during Covid-19. (Thriplow, Cambridgeshire)\n\nProfessor Gregor Ian Smith. Chief Medical Officer, Scottish Government. For services to Public Health. (Hamilton, Lanarkshire)\n\nAlistair Spalding CBE. Artistic Director and Chief Executive, Sadler’s Wells Theatre. For services to Dance. (London, Greater London)\n\nWilliam David Wiggin (Bill Wiggin) MP. Member of Parliament for North Herefordshire. For Political and Public service. (Upton Bishop, Herefordshire)\n\nDr Nigel David Wilson. Chief Executive, Legal and General. For services to the Finance Industry and Regional Development. (London, Greater London)\n\nORDER OF THE BATH\n\nCompanions of the Order of the Bath (CB)\n\nRuth Bailey. Lately Director of Human Resources, Department for Levelling Up, Housing and Communities. For services to Human Resources. (London, Greater London)\n\nGareth Neil Davies. Director General, Aviation, Maritime, International and Security Group, Department for Transport. For Public Service. (London, Greater London)\n\nElizabeth Jean Ditchburn. Director General, Economy, Scottish Government. For services to the Scottish Economy. (Stonehouse, Lanarkshire)\n\nCatherine Megan Frances. Director General, Local Government and Public Services, Department for Levelling Up, Housing and Communities. For services to Local Government. (London, Greater London)\n\nBrian Mark Hutton. Lately Clerk of the Journals, House of Commons. For services to Parliament. (Lewes, East Sussex)\n\nJohn-Paul Marks. Director General, Work and Health, Department for Work and Pensions. For services to Welfare Reform. (London, Greater London)\n\nMadelaine McTernan. Director General, Vaccine Taskforce. For services to the Covid-19 Response. (London, Greater London)\n\nRichard James Pengelly. Chief Executive, Northern Ireland Health and Social Care Service and Permanent Secretary, Department of Health Northern Ireland. For services to Health and to the Government. (Belfast, City of Belfast)\n\nJoanna Susan Rowland. Director General, HM Revenue and Customs. For services to the Economy during Covid-19. (Fareham, Hampshire)\n\nElizabeth Jane Russell. Director General, Tax and Welfare, HM Treasury. For services to the Economy during Covid-19. (Northallerton, North Yorkshire)\n\nORDER OF THE BRITISH EMPIRE\n\nCommanders of the Order of the British Empire (CBE)\n\nAdesola Olumide Adetosoye OBE. Chief Executive, Bromley Council. For services to Children’s Welfare. (London, Greater London)\n\nCharles Edward Alexander. Chair, Opera Rara, Chair of the Board, Royal Marsden NHS Foundation Trust and lately Lead Non-Executive Board Member, Department for Digital, Culture, Media and Sport. For voluntary and charitable services to the Arts, to Culture and to Health. (London, Greater London)\n\nTimothy Edward Douglas Allan. For services to Business, Charity and the Arts. (Muckhart, Clackmannanshire)\n\nProfessor Myles Robert Allen. Professor of Geosystem Science, University of Oxford. For services to Climate Change Attribution and Prediction and Net-Zero. (Oxford, Oxfordshire)\n\nEdmund John Seward Anderson. Chairman and Independent Non-Executive Director, National Savings and Investments. For services to the Financial Sector and Public Life in Yorkshire. (Leeds, West Yorkshire)\n\nProfessor Jonathan Richard Benger. Chief Medical Officer, NHS Digital. For services to the NHS. (Bristol, City of Bristol)\n\nProfessor Phillip Thomas Blythe FREng. Chief Scientific Adviser, Department for Transport. For services to Science and Engineering in Transport and Government. (Whitley Bay, Tyne and Wear)\n\nSandra May Bowker (Sandra Wallace). Co-Chair, Social Mobility Commission. For services to Law, Professional Services and Social Mobility. (Sutton Coldfield, West Midlands)\n\nBarbara Dana Broccoli OBE. Film Producer. For services to Film, to Drama, to Philanthropy and to Skills. (London, Greater London)\n\nJonathan Broomfield. Director, Department for Environment, Food and Rural Affairs. For Public Service. (Grantham, Lincolnshire)\n\nLinda Brown. Chief Executive Officer, Criminal Injuries Compensation Authority. For services to Justice and the Victims of Crime. (Kirkcaldy, Fife)\n\nLisa Jane Burger. Executive Director and Joint Chief Executive, National Theatre. For services to the Arts. (London, Greater London)\n\nRoger Burnley. Chief Executive, Asda Stores Ltd. For services to the Food Supply Chain. (Mirfield, West Yorkshire)\n\nKirsty Johnstone Bushell. National Vice Chairman SSAFA. For voluntary service to the Armed Forces. (Marshfield, Gloucestershire)\n\nDr Elizabeth Kelly Cameron OBE. Director and Chief Executive, Scottish Chambers of Commerce. For services to the Promotion of Scotland and UK International Trade. (Gourock, Renfrewshire)\n\nJulia Charles (Julie Jaye Charles). For services to Equality, to Intersectionality and to People with Disabilities. (London, Greater London)\n\nMartin John Coles. Chief Executive, Marine Society and Sea Cadets. For services to Young People and Maritime Education. (Beaconsfield, Buckinghamshire)\n\nJenny Coles. Director of Children’s Services, Hertfordshire County Council. For services to Children’s Social Care. (Dunstable, Bedfordshire)\n\nSteven Martin Cooper. Co-Chair, Social Mobility Commission. For services to Banking and Social Mobility. (London, Greater London)\n\nAndrew Peter Cosslett. Lately Chairman, Rugby Football Union. For services to the Rugby Football Union. (London, Greater London)\n\nLeora Anne Cruddas. Chief Executive, Confederation of School Trusts, London. For services to Education. (Leicester, Leicestershire)\n\nJody Alan Cundy OBE. For services to Cycling. (Manchester, Greater Manchester)\n\nJohn Andrew Dawson. Chief Executive Officer, Oxford BioMedica. For services to UK Life Science. (Leatherhead, Surrey)\n\nCountess Sally Jean De la Bedoyere. Lately Chief Executive Officer, Blue Cross. For services to Animal Welfare. (Horsham, West Sussex)\n\nJohn Stephen Denholm. Chairman, J & J Denholm Ltd. For services to the Maritime Sector and Charities. (Balfron, Stirling and Falkirk)\n\nEsmeralda Devlin OBE. For services to Design. (London, Greater London)\n\nProfessor James Diggle. Emeritus Professor of Greek and Latin, University of Cambridge. For services to Classical Scholarship. (Cambridge, Cambridgeshire)\n\nAlison Jane Duckles. Head, Learning and Development, Laing O’Rourke. For services to Education. (Wellingborough, Northamptonshire)\n\nRebecca Ann Ellis. Director, Northern Ireland and Ireland, Cabinet Office. For Public Service. (London, Greater London)\n\nMartin MacLean Fairbairn. Lately Chief Operating Officer, Scottish Funding Council. For services to Education. (Larbert, Stirling and Falkirk)\n\nProfessor Kevin Andrew Fenton. Regional Director, Office for Health Improvement and Disparities, Department for Health and Social Care, and Regional Director, Public Health, NHS London. For services to Public Health. (London, Greater London)\n\nDr John Anthony Fingleton. Founder and Chief Executive Officer, Fingleton Ltd. For services to the Economy and to Innovation. (London, Greater London)\n\nProfessor Wendy Sue Fox (Wendy Barclay). Action Medical Research Chair Virology, Imperial College. For services to Virology. (Reading, Berkshire)\n\nProfessor Lynne Elizabeth Frostick. Board Member, Environment Agency. For services to Flood Risk and Coastal Erosion Management. (Kilnwick, East Riding of Yorkshire)\n\nProfessor Graham Harold Galbraith. Vice-Chancellor University of Portsmouth. For services to Higher Education. (Southsea, Hampshire)\n\nDr Steven John Gamblin FRS. Director of Scientific Platforms, The Francis Crick Institute. For services to Scientific Research. (Radlett, Hertfordshire)\n\nJohn Gilhooly OBE. Artistic and Executive Director, Wigmore Hall. For services to Music. (London, Greater London)\n\nDaniel Paul Greaves. Crime Director, Home Office. For services to Law and Order. (London, Greater London)\n\nPaul Greengrass. Film Director. For services to the Arts. (Henley, Oxfordshire)\n\nKathleen Grussing. Managing Director, Sapphire Partners Executive Search. For services to Business. (London, Greater London)\n\nAlbert Lawrence Heaney. Chief Social Care Officer for Wales. For services to Social Care. (Cardiff, South Glamorgan)\n\nRussell Keith Hobby. Lately General Secretary, National Association of Head Teachers, West Sussex. For services to Education. (London, Greater London)\n\nAnthony John Horowitz OBE. Novelist. For services to Literature. (London, Greater London)\n\nProfessor Nicola Jane Horsley (Nicola Spence). Deputy Director, Plant and Bee Health and Chief Plant Health Officer, Department for Environment, Food and Rural Affairs. For services to Plant Health. (Huggate, East Riding of Yorkshire)\n\nTanweer Ikram. Deputy Senior District Judge, Magistrates’ Court. For services to Judicial Diversity. (Farnham Common, Buckinghamshire)\n\nAlistair James Bradbury Jarvis. Chief Executive, Universities UK. For services to Higher Education, particularly during Covid-19. (London, Greater London)\n\nJohn Johnston. Deputy Secretary, Healthcare Policy Group, Department of Health. For services to Healthcare in Northern Ireland. (Belfast, City of Belfast)\n\nRobert Jones. Director, Threat Leadership, National Crime Agency. For services to Prevention of Serious and Organised Crime. (London, Greater London)\n\nProfessor Louise Clare Kenny. Pro Vice-Chancellor Health and Life Sciences, University of Liverpool. For services to Research in the NHS. (Liverpool, Merseyside)\n\nDavid Arnold Kerfoot MBE DL. Lately Chair, York, North Yorkshire Local Enterprise Partnership. For services to Rural Businesses and the Voluntary and Community Sector. (Northallerton, North Yorkshire)\n\nShalini Khemka. For services to Entrepreneurship and to the Economy. (London, Greater London)\n\nProfessor Kamlesh Khunti. Professor of Primary Care Diabetes and Vascular Medicine, University of Leicester and General Practitioner, Hockley Farm Medical Practice, Leicester. For services to Health. (Leicester, Leicestershire)\n\nLouise Anne Kingham OBE. lately Chief Executive, Energy Institute. For services to the Energy Industry. (Great Missenden, Buckinghamshire)\n\nProfessor Martin Richard John Knapp. Director, NIHR School for Social Care Research and Professor, Health and Social Care Policy, London School of Economics. For services to Social Care Research. (Canterbury, Kent)\n\nProfessor Nicholas Robert Lemoine. National Medical Director, Clinical Research Network, National Institute for Health Research. For services to Clinical Research particularly during Covid-19. (London, Greater London)\n\nMartin Steven Lewis OBE. Founder, MoneySavingExpert. For services to Broadcasting and Consumer Rights. (London, Greater London)\n\nDr David George Llewellyn. Lately Vice-Chancellor, Harper Adams University. For services to Higher Education, to the Agri-Food Chain and to Rural Industries. (Leyburn, North Yorkshire)\n\nMark Richard Lloyd. Chief Executive, Local Government Association. For services to Local Government and to Charity. (Cambridge, Cambridgeshire)\n\nSir Laurence Henry Philip Magnus Bt. Chair, Historic England and Member, Culture Recovery Board. For services to Heritage particularly during Covid-19. (Bungay, Suffolk)\n\nProfessor Anne Elizabeth Magurran FRSE. Professor of Ecology and Evolution, Centre for Biological Diversity and the Scottish Oceans Institute, University of St Andrews. For services to Biodiversity. (St. Andrews, Fife)\n\nProfessor Ravi Prakash Mahajan. Lately President, Royal College of Anaesthetists. For services to Anaesthesia. (Alfreton, Derbyshire)\n\nAndrew Leslie Marr DL. Chairman, Andrew Marr International Ltd. For services to the UK Fishing Industry. (Beverley, East Riding of Yorkshire)\n\nKatherine Lyndsay Mavor. Chief Executive, English Heritage Trust. For services to Heritage. (Crickhowell, Powys)\n\nRobert Chad McCracken MBE. Performance Director, British Amateur Boxing Association. For services to Boxing. (Brentwood, Essex)\n\nAnthea Elizabeth Joy McIntyre. Lately Member, European Parliament, West Midlands. For Political and Public Service. (Ross-on-Wye, Herefordshire)\n\nRichard Henry Meddings. Lately Chairman, TSB Banks. For services to the Financial Sector. (Burwash, East Sussex)\n\nDr John Ruthven Mitchell. Principal Medical Officer, Scottish Government. For services to Improving Mental Health in Scotland. (Edinburgh, Edinburgh)\n\nProfessor Kathryn Mary Mitchell. Vice Chancellor, University of Derby. For services to Higher Education. (Belper, Derbyshire)\n\nLeslie Montgomery. For services to the Water Industry, the Environment and Overseas Aid. (Falkirk, Stirling and Falkirk)\n\nProfessor Tavi Murray. Professor of Glaciology, Swansea University. For services to Glaciology and Climate Change Research. (Swansea, West Glamorgan)\n\nNorman Loch Murray FRSE. Lately Chairman, Scottish Ballet. For services to the Arts. (Edinburgh, Edinburgh)\n\nSteven Geoffrey Murrells. Chief Executive Officer, Co-op Group. For services to the Food Supply Chain. (Mottram St Andrew, Cheshire)\n\nProfessor Peter Openshaw. Professor of Experimental Medicine and Proconsul, Imperial College London. For services to Medicine and Immunology. (London, Greater London)\n\nNicholas Robson Owen. Lately UK Chair, Deloitte LLP. For services to the Professional Services Sector. (Haslemere, Surrey)\n\nStephen Mackenzie Park OBE. Performance Director, British Cycling. For services to Cycling. (Fareham, Hampshire)\n\nProfessor Malcolm Colin Press. Vice-Chancellor, Manchester Metropolitan University. For services to Higher and Technical Education. (Alderley Edge, Cheshire)\n\nProfessor Mark Radford. Chief Nurse, Health Education England and Deputy Chief Nursing Officer, NHS England and NHS Improvement. For services to Nursing. (Sutton Coldfield, West Midlands)\n\nDavid Thomas Raw. Deputy Director, HM Treasury. For services to the Covid-19 Response. (London, Greater London)\n\nStephen Michael Reese. Solicitor and Partner, Clifford Chance LLP. For services to the Covid-19 Response. (London, Greater London)\n\nBenjamin Rimmington. Lately Co-Director, Road Safety Standards and Services, Department for Transport. For services to Transport during Covid-19. (Ilkley, West Yorkshire)\n\nMichael Roy Roberts. Style Director, Vanity Fair Magazine. For services to Fashion. (Abroad)\n\nClaudia Roden. Cookery Author. For services to Literature. (London, Greater London)\n\nFrancis Rogers. Chief Executive, Liverpool City Region Combined Authority and Director General, Merseytravel. For services to Local Government Reform in the Liverpool City Region. (Sale, Greater Manchester)\n\nPhilippa Claire Rouse. Director, Future Border and Immigration System, Home Office. For Public Service. (Oxted, Surrey)\n\nLaura Manning Shoaf. Lately Managing Director, Transport for the West Midlands. For services to Economic Regeneration in the West Midlands. (Kinver, Staffordshire)\n\nSusannah Kate Simon. Director, UK-EU Trade Partnership, EU Secretariat, Cabinet Office. For Public Service. (London, Greater London)\n\nProfessor Iqbal Singh OBE. Chair, Centre of Excellence in Safety for Older People. For services to Equality and Inclusion in Healthcare. (Blackburn, Lancashire)\n\nRachel Susan Skinner FREng. Executive Director, WSP. For services to Infrastructure. (West Molesey, Surrey)\n\nGrahame Thomas Smith. For services to the Trade Union Movement and the Promotion of Fair Work in Scotland. (Bishopbriggs, Lanarkshire)\n\nDr Liane Margaret Smith FREng. Founder and Director, Larkton Ltd. For service to Engineering and Materials Science. (Malpas, Cheshire)\n\nTimothy John Smith. Chair, Trade and Agriculture Commission. For services to Agriculture, Food, and Drink Trade Policy. (London, Greater London)\n\nDr John Frederick Stageman OBE. Chairman, LifeArc. For services to the Translation of Medical Research. (Tonbridge, Kent)\n\nMoira Clare Ruby Stuart OBE. Presenter and Broadcaster. For services to Media. (London, Greater London)\n\nProfessor Irene Mary Tracey. Professor of Anaesthetic Neuroscience and Warden of Merton College, University of Oxford. For services to Medical Research. (Oxford, Oxfordshire)\n\nJanine Lesley Tregelles. Chief Executive, Revitalise Respite Holidays and lately Chief Executive, Mencap. For services to People with Learning Disabilities. (London, Greater London)\n\nThomas Peter Usborne MBE. Founder and Managing Director, Usborne Publishing. For services to Literature. (London, Greater London)\n\nProfessor Russell Mardon Viner. Professor in Adolescent Health, University College London. For services to Child and Adolescent Health, particularly during Covid-19. (Harpenden, Hertfordshire)\n\nAdrian Charles Vinken OBE DL. Chief Executive Officer, Theatre Royal Plymouth. For services to Theatre. (Plymouth, Devon)\n\nDonna Ward Sanderson. Director, Poverty, Families and Disadvantage, Department for Work and Pensions. For Public Service. (London, Greater London)\n\nSusie Warran-Smith (Susan Jane Nelson). Chair, Produced in Kent. For services to Small Businesses in the UK Food Industry. (Hythe, Kent)\n\nProfessor Nick Anthony David John Webborn OBE. Chair, British Paralympic Association. For services to Sport and Sports Medicine. (Eastbourne, East Sussex)\n\nElizabeth Jane Whittaker. Director of Knowledge, Analysis and Information, HM Revenue and Customs. For services to the Covid-19 Response. (London, Greater London)\n\nMichael Gregg Wilson OBE. For services to Film, to Drama, to Philanthropy and to Skills. (London, Greater London)\n\nDr Neil Rhys Wooding. For services to Social Justice, to Equality and to the community in Wales. (Newport, Newport)\n\nOfficers of the Order of the British Empire (OBE)\n\nOwen Abbott. Head, Census and Population Statistics Methodology, Office for National Statistics. For services to Census and Population Statistics. (Fareham, Hampshire)\n\nSyed Viqar Ahmed. Founder and Chair, Community Energy London. For services to Community Energy, Decarbonisation and Community Benefit in London. (London, Greater London)\n\nDr Syed Ahmed. Clinical Director, Health Protection Scotland. For services to the Covid-19 Vaccination Programme. (Glasgow, Glasgow)\n\nAmir Ali. Lately Chair, Civil Court Users Association. For services to Court Users and the Law. (Walsall, West Midlands)\n\nAndrew Edward Anson. Chief Executive Officer, British Olympic Association. For services to Sport, particularly during Covid-19. (Wilmslow, Cheshire)\n\nColonel (Rtd) Christopher Lee Argent QVRM TD DL. Chair, United Kingdom Reserve Forces’ Association. For voluntary service to Reserve Forces in the UK and NATO. (Birchington, Kent)\n\nLisa Armstrong. Fashion Director, The Telegraph. For services to Fashion. (London, Greater London)\n\nProfessor Anthony John Avery. Professor of Primary Health Care, University of Nottingham. For services to General Practice. (Nottingham, Nottinghamshire)\n\nMohammed Asif Aziz. Director, Healthcare Services, Boots UK Ltd. For services to Pharmacy, especially Testing for Covid-19. (London, Greater London)\n\nClark Samuel Bailie. For services to Housing and Public Management in Northern Ireland. (Bangor, County Down)\n\nYvonne Dawn Baker. Chief Executive, STEM Learning. For services to STEM Education. (Rushden, Northamptonshire)\n\nNatasha Louise Baker MBE. For services to Equestrianism. (London, Greater London)\n\nDr Austin Howard Ball. Lately Technical Coordinator, Compact Muon Solenoid Experiment, CERN. For services to Physics and Engineering. (Abroad)\n\nRichard Edward Ballantyne. Chief Executive Officer, British Ports Association. For services to the Maritime Sector. (London, Greater London)\n\nElizabeth Barrett. Principal, Academy Transformation Trust for Further Education. For services to Education. (Sutton-in-Ashfield, Nottinghamshire)\n\nAngela Barry. School Improvement Partner and Leadership Development Consultant. For services to Education. (Harwell, Oxfordshire)\n\nThomas Bennett. Director and Founder, researchEd, and Behaviour Adviser, Department for Education. For services to Education. (Dollar, Clackmannanshire)\n\nDr David Bentley. Vice-President and Chief Scientist, Illumina Cambridge Ltd. For services to Expertise and Leadership in Human Medical Genomics. (Harpenden, Hertfordshire)\n\nDr Hindpal Singh Bhui. Inspection Team Leader, HM Inspectorate of Prisons. For services to Custody Facilities during Covid-19. (London, Greater London)\n\nPauline Black. Singer, Actress and Author. For services to Entertainment. (Coventry, West Midlands)\n\nSharon Blyfield. Head, Early Careers and Apprenticeships, Coca-Cola Europacific Partners. For services to Apprenticeships and Skills. (Malmesbury, Wiltshire)\n\nProfessor John Robert Fyfe Bolton. Lately Visiting Professor, Institute of Public Care, Oxford Brookes University. For services to Social Care. (Coventry, West Midlands)\n\nJulia Nonie Bouverat. For Political service. (Deal, Kent)\n\nEvelyn Jane Bowman JP. Senior Complaints Manager, Ministerial Complaints Team, HM Revenue and Customs. For Public Service. (Prestwick, Ayrshire and Arran)\n\nProfessor Veronica Elizabeth Bowman. Statistics and Data Science Fellow, Defence Science and Technology Laboratory. For services to Defence and the Covid-19 Response. (Salisbury, Wiltshire)\n\nAntony John Peter Bowring. Lately Secretary and Ship Organiser, Transglobe Expedition Trust. For services to Charity. (Saxmundham, Suffolk)\n\nKathryn Emma Boyd. Lately Deputy Director, EU Secretariat, Cabinet Office. For Public Service. (London, Greater London)\n\nAlan Brace. Director of Finance, NHS Wales. For services to the NHS and the Covid-19 Response in Wales. (Bridgend, Bridgend)\n\nAnthony Thomas Andrew Braddon. Philanthropist. For voluntary and charitable services to Homeless People and Underprivileged Children in London and the South East. (Penshurst, Kent)\n\nDr Elizabeth Ann Breeze. Director, Centre for Philanthropy and Director, University of Kent. For services to Philanthropic Research and Fundraising. (Canterbury, Kent)\n\nAmanda Bringans. Lately Director of Fundraising, British Heart Foundation. For services to Charity. (London, Greater London)\n\nLeslie William Brotherston. Theatrical Designer. For services to Dance and Theatre. (Nutbourne, West Sussex)\n\nGeoffrey Stewart Brown. Lately Chairman, St Johnstone Football Club. For services to Scottish Football and to the community in Perth. (Perth, Perth and Kinross)\n\nKathryn Anne Brown. Lately Head of Climate Adaptation, Committee on Climate Change. For services to Climate Change Research. (Bracknell, Berkshire)\n\nJoy Michelle Brown. Lately Senior District Crown Prosecutor, East of England, Crown Prosecution Service. For services to Law and Order. (Chelmsford, Essex)\n\nJune Muriel Brown MBE. For services to Drama and to Charity. (Chipstead, Surrey)\n\nHenrietta Brown. Business Operations Lead, Office for National Statistics. For services to the Census of England and Wales. (Swanwick, Hampshire)\n\nAlexander Mark Burns. Chief Executive Officer, Robert Harter Ltd. For services to the UK Automotive Industry. (Leafield, Oxfordshire)\n\nFrancis Butterfill. Head of Integrated Services, Marshall Aerospace and Defence Group. For services to the Royal Air Force. (Cambridge, Cambridgeshire)\n\nRobin William Caley. Senior Lawyer, HM Revenue and Customs. For services to Tax and Pandemic Support. (Exeter, Devon)\n\nDr Ian William Campbell. Lately Interim Executive Chair, Innovate UK. For services to Innovation. (Spaldwick, Cambridgeshire)\n\nDr Nira Cyril Chamberlain. President, Institute of Mathematics and its Applications. For services to Mathematical Sciences. (Birmingham, West Midlands)\n\nPhilippa Minshall Charles. Director, The Garfield Weston Foundation. For services to Arts, Culture and Community Recovery. (Reigate, Surrey)\n\nAlpesh Chauhan. Music Director, Birmingham Opera Company. For services to the Arts. (Coventry, West Midlands)\n\nGregory Stuart Childs. Co-Founder, Children’s Media Conference and Director, Children’s Media Foundation. For services to International Trade and to the Children’s Media Sector. (London, Greater London)\n\nJeanette Chippington MBE. For services to Canoeing. (Maidenhead, Berkshire)\n\nJaine Louise Chisholm Caunt. Director General, Grain and Feed Trade Association. For services to the Promotion of International Free Trade. (London, Greater London)\n\nLorraine Anne Clarke. Regional Director and Executive Principal, ARK Schools Academy Trust, Hastings. For services to Education. (Hastings, East Sussex)\n\nAnn Cleeves. Author. For services to Reading and Libraries. (Whitley Bay, Tyne and Wear)\n\nValerie Cockerell. Lately, Chief Officer, Official Seed Testing Station for Scotland, Science and Advice for Scottish Agriculture. For services to Scottish Agriculture. (Dunfermline, Fife)\n\nHannah Lucy Cockroft MBE. For services to Athletics. (Halifax, West Yorkshire)\n\nEvelyn Margaret Cosgrove. Lately Principal, St Mary’s High School, Newry. For services to Education. (County Down)\n\nKadeena Cox MBE. For services to Athletics and Cycling. (Leeds, West Yorkshire)\n\nProfessor Paul Croney. Vice-Chancellor and Chief Executive, Teesside University. For services to Higher Education and to Economic Regeneration. (Newcastle Upon Tyne, Tyne and Wear)\n\nReverend James Alan Cruddas FRSA. Deputy Director, Department for Environment, Food and Rural Affairs. For Public Service. (Bicester, Oxfordshire)\n\nThomas Robert Daley. For services to Diving, to LGBTQ+ Rights and Charity. (London, Greater London)\n\nBarclay John Davies. For services to Public Transport and to the Government. (Treorchy, Rhondda Cynon Taff)\n\nSharon Tracey Davies. Chief Executive, Hertfordshire Care Providers Association. For services to Social Care in Hertfordshire. (Stevenage, Hertfordshire)\n\nAled Sion Davies MBE. For services to Athletics. (Peterstone Wentlooge, Newport)\n\nProfessor Helen Davis. Head, Division of Ophthalmology and Orthoptics, Health Sciences School, University of Sheffield. For services to Orthoptics. (Sheffield, South Yorkshire)\n\nHelene Dearn. West Midlands Group Director, Work and Health Services, Department for Work and Pensions. For Public Service. (Wolverhampton, West Midlands)\n\nDavid Deaves. Founder, Dewsbury Ambulance Charities. For voluntary and charitable services to the community in Wakefield, West Yorkshire. (Wakefield, West Yorkshire)\n\nSally Debonnaire. Director of Production, ITV. For services to Television and voluntary service to Skills through ScreenSkills. (Berkhamstead, Hertfordshire)\n\nMadeleine Frances Desforges. Chief Executive Officer, National Association for Voluntary and Community Action. For services to Volunteering and to Charity. (Sheffield, South Yorkshire)\n\nDr Japinder Dhesi. Lately Team Leader, Cabinet Office. For Public Service. (London, Greater London)\n\nDavinder Singh Dhillon. Chair, The Chattri Memorial Group. For services to the Commemoration of Indian Forces’ Contribution in the First World War. (Hove, East Sussex)\n\nDr Grainne Doran. General Practitioner, Northern Ireland and lately Chair, Royal College of General Practitioners Northern Ireland Council. For services to General Practice. (Bangor, County Down)\n\nPaul Durrant. Director, UK Games Talent and Finance CIC. For services to the Games Industry and Education. (Broughty Ferry, City of Dundee)\n\nCarol Dutch. Scotland Employer, Partnership and Devolution Strategic Lead, Department for Work and Pensions. For services to Vulnerable people in Glasgow. (Eaglesham, Renfrewshire)\n\nBrenda Sophia Edmenson-Mcleish. Chief Executive Officer, The Learning Curve Group, For services to Further Education. (Hartlepool, County Durham)\n\nGraham Winston Edwards. Chief Executive, Wales and West Utilities. For services to Business and to the Community in Wales. (Cardiff, South Glamorgan)\n\nDr David Stuart Edwards. Lately Chair, Governing Body, Morley College London. For services to Adult and Further Education. (Shaftesbury, Dorset)\n\nObumneke Ndudirim Ekeke. For services to Computing and Artificial Intelligence Education, and to Championing Diversity and Inclusion in the Technology Sector. (Chelmsford, Essex)\n\nRichard George Evans MBE. For services to Charitable Fundraising particularly during Covid-19. (London, Greater London)\n\nMohammed Shabir Fazal. Headteacher, Eden Boys’ Leadership Academy, Manchester. For services to Education. (Accrington, Lancashire)\n\nJeremy Michael Dyer Field. For services to the Funeral Industry. (West Hoathly, West Sussex)\n\nDr Bethany Charlotte Firth MBE. For services to Swimming. (Newtownards, County Down)\n\nHis Eminence Michael Fitzgerald. Cardinal, Roman Catholic Church. For services to Interfaith and Interchurch Partnerships. (Liverpool, Merseyside)\n\nDeborah Mary Fleming. Chief Executive, University Hospitals Dorset NHS Foundation Trust. For services to the NHS. (Wimborne, Dorset)\n\nJulie Kim Anne Foley. Director, Flood Risk Management Strategy and National Adaptation, Environment Agency. For services to Managing Flood Risk. (West Malling, Kent)\n\nProfessor John Leslie Robert Forsythe. Medical Director, Organ Donation and Transplantation, NHS Blood and Transplant. For services to Transplant Surgery and Covid-19. (Perth, Perth and Kinross)\n\nMark James Fowles. Lately Managing Director, Nottingham Transport. For services to Public Transport and to Charity. (Worksop, Nottinghamshire)\n\nSimon Edward French. Chief Inspector of the Rail Accident Investigation Branch. For services to Railway Safety. (Fleet, Hampshire)\n\nRaymond Francis Friel. Lately Chief Executive Officer, Plymouth CAST Trust. For services to Education. (Frome, Somerset)\n\nNitin Ganatra. Actor. For services to Drama. (London, Greater London)\n\nSajdah Perveen Ghafoor. For services to Cultural Awareness and Integration in Cumbria. (Carlisle, Cumbria)\n\nJulian Mark Lythel Gibbs. Lately Head of Extradition, Home Office. For services to International Legal and Judicial Co-operation. (London, Greater London)\n\nNicholas Edward Giles. Managing Director of Consumer, Ordnance Survey. For services to the Health of the Nation. (Bournemouth, Dorset)\n\nJagtar Singh Gill. For services to the British Sikh and Interfaith Communities. (Kenilworth, Warwickshire)\n\nAonghus Coinn Huntly Gordon. Founding Trustee, Ruskin Mill Trust. For services to Cultural Heritage and Education. (Stroud, Gloucestershire)\n\nProfessor Ailsa Jane Hall. Director of the Sea Mammal Research Unit, and Professor of Biology, University of St Andrews. For services to Environmental Protection and Epidemiology. (St Andrews, Fife)\n\nDeborah Harrison. Joint Managing Director, Pricecheck Toiletries Ltd. For services to International Trade. (Sheffield, South Yorkshire)\n\nAngela Maria Hartnett MBE. Chef. For services to the Hospitality Industry and to the NHS during the Covid-19 Response. (London, Greater London)\n\nLianne Hawkes. Team Leader, Ministry of Defence. For services to Defence. (London, Greater London)\n\nOliver James Haydon. Deputy Director, HM Treasury. For services to European Negotiations. (London, Greater London)\n\nDaniel Hayes. Chief Executive, The Orders of St John Care Trust. For services to Social Care. (Thame, Oxfordshire)\n\nEmma Carol Hayes MBE. Manager, Chelsea Women. For services to Association Football. (Cobham, Surrey)\n\nMartyn John Henderson. Chief Executive, Sports Grounds Safety Authority. For services to Sports Safety during Covid-19. (London, Greater London)\n\nDr Clive Hickman. Chief Executive Officer, The Manufacturing Technology Centre Ltd. For services to Engineering Manufacturing and Technology Development. (Chipping Campden, Gloucestershire)\n\nDr Roger Ronald Highfield. Science Director, Science Museum Group. For services to Public Engagement with Science. (London, Greater London)\n\nVictoria Jane Hornby. Chief Executive Officer, Mental Health Innovations. For services to the Charitable Sector during Covid-19. (London, Greater London)\n\nSally Colette Hunt. Council Member, ACAS. For services to Industrial Relations. (Brighton, East Sussex)\n\nRaymond Hutchinson. Managing Director, Gilbert-Ash. For services to the Construction Industry and to Diversity and Inclusion. (Dromore, County Down)\n\nPamela Susan Hutchinson. For services to Diversity and Inclusion in the Financial Sector. (London, Greater London)\n\nRobin Hutson. For services to the Hospitality Industry and Philanthropy. (Winchester, Hampshire)\n\nDr Andre Jan Imich. Special Educational Needs and Disabilities Professional Advisor, Department for Education. For services to Children and Young People. (Leigh-on-Sea, Essex)\n\nDeborah Mary Inskip DL. For services to the community in Bedfordshire particularly during Covid-19. (Bedford, Bedfordshire)\n\nTimothy Drysdale Jackson. Lately Principal, Sparsholt College and Andover College. For services to Further Education. (Nr Winchester, Hampshire)\n\nJames Jamieson. Chairman, Local Government Association. For services to Local Government. (Bedford, Bedfordshire)\n\nProfessor Ali Sadiq Mohammad Jawad. Professor of Rheumatology, Barts and the London School of Medicine and Consultant Rheumatologist, Barts Health NHS Trust. For services to Healthcare. (London, Greater London)\n\nSharath Kumar Jeevan. Lately Chief Executive Officer, STiR Education. For services to Education. (London, Greater London)\n\nDavid Hugh Johnston. Head, Digital Trust and Evidence Group. For services to Law Enforcement. (Letchworth Garden City, Hertfordshire)\n\nMatthew Leon Jones. Executive Principal, ARK Globe Academy, London. For services to Education. (South Woodham Ferrers, Essex)\n\nHanif Mohamed Kara. Design Director and Co-Founder, AKT II and Professor in Practice of Architectural Technology, Harvard Graduate School of Design. For services to Architecture, to Engineering and to Education. (London, Greater London)\n\nZoe Elizabeth Keeton. Head, Regulatory Affairs UK and Ireland, RWE Renewables. For services to the Renewable Energy Sector. (Malmesbury, Wiltshire)\n\nMillie Kendall MBE. Chief Executive Officer, British Beauty Council. For services to the Hair and Beauty Industry. (London, Greater London)\n\nAlison Kilbane-Griffiths. Corporate Customer Relationship Manager, Driver and Vehicle Licensing Agency. For services to Transport. (Llanelli, Carmarthenshire)\n\nCatherine Margaret Kitchen. Chief Executive Officer, Skylark Partnership Academy Trust and Chair, National Association of Hospital Education. For services to Children and Young People. (Daventry, Northamptonshire)\n\nJohn Andrew Kneen. HR Manager, Shell Energy, Shell Human Resources. For services to Diversity and Inclusion. (London, Greater London)\n\nCarol Lake. Member, Cultural Recovery Board. For services to the Arts during Covid-19. (London, Greater London)\n\nDr Alexander Geoffrey Lambert. Deputy Director, Covid Infection Survey Operations, Office for National Statistics. For services to Statistics and Public Health. (Southampton, Hampshire)\n\nMatthew James Lanham. Chief Executive, Neuro Muscular Centre. For services to People Affected by Neuro Muscular Conditions in the UK. (Whitchurch, Shropshire)\n\nClive Anthony Lawrence. Lately Executive Headteacher, St Giles’ School, Derby. For services to Education. (Derby, Derbyshire)\n\nNeil Leitch. Chief Executive Officer, Early Years Alliance. For services to Education. (Tadworth, Surrey)\n\nDr Katharine Helen Liddell. Officer, National Crime Agency. For services to Law Enforcement and Ecology. (London, Greater London)\n\nJulie Lindsay. Chief Operating Officer, Office of the Public Guardian. For services to Vulnerable People and the Community. (Alcester, Warwickshire)\n\nAndrew Ian Lovett. Chair, Association of Independent Museums. For services to Cultural Heritage particularly during Covid-19. (Birmingham, West Midlands)\n\nAlison Natalie Kay Lowe. Lately Chief Executive Officer, Touchstone. For services to Mental Health and Wellbeing during Covid-19. (Batley, West Yorkshire)\n\nAmritpal Singh Maan. Philanthropist. For services to the Sikh Community and to Charity. (London, Greater London)\n\nDr Joanna Macrae. Co-Head, International Forests and Land Use, Department for Environment, Food and Rural Affairs. For services to the Environment. (London, Greater London)\n\nDrusilla Maizey. Chair, NHS Business Services Authority. For services to the NHS. (Aylesbury, Buckinghamshire)\n\nMarie Alea Mary Greenwood Mallon MBE. Chair, Labour Relations Agency. For services to Industrial and Employment Relations in Northern Ireland, particularly during Covid-19. (Belfast, City of Belfast)\n\nChristopher John Justin Manson. Interim Chief Executive, UK Government Investments. For services to Business and the Economy. (Abroad)\n\nDr Ruth Eleanor March. Senior Vice President, Precision Medicine and Biosamples, AstraZeneca. For services to UK Science and the COVID-19 response. (Cambridge, Cambridgeshire)\n\nWilliam Marks. Senior Policy Liaison, Analysis and Civil Contingencies Secretariat Dashboard, Cabinet Office and Office of National Statistics. For Public Service. (London, Greater London)\n\nHelene Alexandra Marshall. For services to Maternity Education in Scotland. (Airdrie, Lanarkshire)\n\nIan James Marshall. For Public and Political Service. (Armagh, County Armagh)\n\nSimon Peter Anthony Massarella JP. National Digital Lead for the Magistracy. For services to the Administration of Justice. (Nottingham, Nottinghamshire)\n\nJeremy Paul Mayhew. Member, Court of Common Council and Lately Chairman, Finance Committee, City of London. For Public and Voluntary Service. (London, Greater London)\n\nRussell Warren McCallion. Group Human Resource Director, PD Ports. For services to Business and to the community in the Tees Valley. (Northallerton, North Yorkshire)\n\nSean McCarry. Regional Commander, Community Rescue Service. For services to the community in Northern Ireland. (Portstewart, County Londonderry)\n\nDavid McCarthy. Team Leader, Ministry of Defence. For services to Defence. (London, Greater London)\n\nDr Catherine Isabel McClay. Lately Head of Futures, National Grid. For services to the Energy Sector and the Promotion of Decarbonisation. (Warwick, Warwickshire)\n\nCatherine Lynne McClure. Director, Cambridge Mathematics. For services to Education. (Cambridge, Cambridgeshire)\n\nHorace Michael McEvoy MBE. For services to the community in North Wales. (Prestatyn, Denbighshire)\n\nKevin Paul McGee. Joint Chief Executive, East Lancashire Hospitals NHS Trust and Blackpool Teaching Hospitals NHS Foundation Trust. For services to the NHS. (Warrington, Cheshire)\n\nKeith Andrew Meade. Assistant Head, Physical Security Policy, Ministry of Defence. For services to Defence and to Diversity. (Harlow, Essex)\n\nProfessor Jonathan Michie. Professor, Innovation and Knowledge Exchange and President, Kellogg College, University of Oxford. For services to Education. (Oxford, Oxfordshire)\n\nHannah Mills MBE. For services to Sailing and the Environment. (Poole, Dorset)\n\nProfessor Robert Minge Mokaya. Professor of Materials Chemistry and Pro-Vice-Chancellor for Global Engagement, University of Nottingham. For services to the Chemical Sciences. (Nottingham, Nottinghamshire)\n\nDonna Charlotte Molloy. Director, Policy and Practice, Early Intervention Foundation. For services to Vulnerable Children and Young People. (London, Greater London)\n\nBridget Isabella Mongan. Director, Adult Services and Prison Healthcare, South Eastern Health and Social Care Trust. For services to Prison Health Care and Social Work in Northern Ireland. (Downpatrick, County Down)\n\nProfessor Hugh Edward Montgomery. Professor of Intensive Care Medicine, University College London. For services to Intensive Care Medicine and Climate Change. (London, Greater London)\n\nLesley Moody MBE. President, North East England Chamber of Commerce. For services to Business and to the community in North East England. (Morpeth, Northumberland)\n\nNeil Moore. Leader, Vale of Glamorgan Council. For services to the community in the Vale of Glamorgan. (Barry, Vale of Glamorgan)\n\nStephanie Susan Moore MBE. Founder, The Bobby Moore Fund. For services to Bowel Cancer Research Funding. (London, Greater London)\n\nLynne Elizabeth Morris JP. Chief Executive Officer, The Toybox Charity. For services to Children in the UK and Abroad. (Milton Keynes, Buckinghamshire)\n\nLieutenant Colonel Roderick Edmund Forbes Morriss TD DL. Representative Deputy Lieutenant, London Borough of Hackney. For Public Service. (Dalbeattie, Kirkcudbrightshire)\n\nKathryn Munson. Head, Probation Services, Hull and East Riding, National Probation Service. For services to the Criminal Justice System. (North Ferriby, East Riding of Yorkshire)\n\nHeather Catherine Murray. Senior Partnership Manager, Department for Work and Pensions. For services to Vulnerable People and Social Justice. (Nelson, Lancashire)\n\nFigen Ayse Murray. Campaigner and Educator. For services to Counter Terrorism. (Poynton, Cheshire)\n\nAmanda Naylor. For services to Vulnerable Children and Young People. (Darwen, Lancashire)\n\nDavid Peter Newton. Policy Manager, Energy, Consumers and Engagement, Department for Business, Energy and Industrial Strategy. For services to People Experiencing Fuel Poverty. (Uckfield, East Sussex)\n\nDavid Laurence Nicholson MBE. Chair, Radio Tyneside. For services to Hospital Radio Broadcasting and to the community in Newcastle upon Tyne. (Newcastle upon Tyne, Tyne and Wear)\n\nAmanda Nicholson. Chief Executive Officer, King’s Academy Trust and Executive Principal, Oakwood Academy, Manchester. For services to Education. (Warrington, Cheshire)\n\nWilliam John Oakes. Lately Headteacher, Dartford Grammar School, Kent. For services to Education. (Bromley, Kent)\n\nJennifer Roselyn Ogole. Chief Executive Officer, Bang Edutainment. For services to Young People. (London, Greater London)\n\nMelanie Oldham. Chief Executive, Bob’s Business. For services to Business and Cybersecurity. (Holmfirth, West Yorkshire)\n\nStephen Orr. Chief Executive, Catalyst. For services to Innovation. (Holywood, County Down)\n\nSteven George McNeil Osborne. Pianist. For services to Music. (Edinburgh, Edinburgh)\n\nIsabelle Amanda Parasram. Barrister, England and Wales, Chief Executive Officer, Social Value UK and lately Vice President, Liberal Democrats. For Political and Public Service. (London, Greater London)\n\nDonald Parker. Lately Chief Executive Officer, Yorkshire Collaborative Academy Trust. For services to Education in North Yorkshire. (Knaresborough, North Yorkshire)\n\nAmanda Lin Parry. Deputy Chief Executive Officer, HISP MAT and Executive Director, LEARN Teaching School Alliance, Hampshire. For services to Education. (Eastleigh, Hampshire)\n\nProfessor Mahendra Gulabbhai Patel. Pharmacist. For services to Pharmacy. (Wakefield, West Yorkshire)\n\nRizwan Patel. Founder, Lint Group. For services to the Disadvantaged Communities in the UK and Abroad, particularly during Covid-19. (London, Greater London)\n\nMatthew Richard Patey. Chief Executive Officer, British Skin Foundation and Managing Director, Skin Health Alliance. For services to Dermatological Research. (London, Greater London)\n\nDan Pearson. Landscape Designer, Gardener and Horticulturalist. For services to Horticulture. (Bath, Somerset)\n\nAdam George Peaty MBE. For services to Swimming. (Kegworth, Leicestershire)\n\nMark William Pemberton. Director, Association of British Orchestras. For services to Music. (London, Greater London)\n\nDavid Leslie Peppiatt. Director, Humanitarian Cash Assistance, British Red Cross. For services to the Red Cross’ International Humanitarian Programme. (London, Greater London)\n\nRonald Phillips (Charlie Phillips). Photographer. For services to Photography and the Arts. (Mitcham, Surrey)\n\nStephen Piper. Team Leader, Ministry of Defence. For services to Defence. (London, Greater London)\n\nVivienne Porritt. Co-Founder and Global Strategic Leader, WomensEd and Co-Founder, DisabilityEd UK. For services to Education. (Esher, Surrey)\n\nAntony Paul Porter QPM. Lately Commissioner, Office of the Surveillance Camera Commissioner. For services to Security and to Human Rights. (Wilmslow, Cheshire)\n\nArti Prashar. Artist, Director and Consultant. For charitable services to People Living with Dementia. (London, Greater London)\n\nJonathan Rea MBE. For services to Motorcycle Racing. (Dunadry, County Antrim)\n\nPaul Robert Reddish. Chief Executive, Volunteering Matters and Chief Executive, ProjectScotland. For services to the Voluntary and Community Sector during Covid-19. (Edinburgh, Edinburgh)\n\nAlastair James Reid. Probation National Security Lead, H.M. Prison and Probation Service. For services to Public Protection in England and Wales. (London, Greater London)\n\nKeith David Richards. Chair, Disabled Persons Transport Advisory Committee. For services to Accessible Transport. (London, Greater London)\n\nWilliam Patrick Roache MBE. For services to Drama and Charity. (Wilmslow, Cheshire)\n\nSusan Robertson (Sue Mountstevens). Lately Police and Crime Commissioner, Avon and Somerset. For services to the community in Bristol, Somerset and South Gloucestershire. (Abbots Leigh, Somerset)\n\nMichael William Robinson. Chief Executive Officer, Prior’s Court, Thatcham. For services to Children and Young People with Autism. (Bridgwater, Somerset)\n\nDr Russell David Rook. Founding Partner, Good Faith Partnership. For services to Social Action. (London, Greater London)\n\nHannah Russell MBE. For services to Swimming. (Chertsey, Surrey)\n\nThomas James Rutherford. Lately Head, Encryption and Online Safety, Home Office. For services to Public Safety. (Farnham, Surrey)\n\nChristopher Ryan. Head, Cash Desk, UK Debt Management Office. For Public Service. (Weybridge, Surrey)\n\nCharles Edward Sabine. Global Campaigner, Huntington’s Disease. For Charitable and Voluntary services. (Tetbury, Gloucestershire)\n\nMargaret Patricia Saxton. Chair, North East Learning Trust and Apollo Schools Trust, Durham. For services to Education. (Carrville, County Durham)\n\nWilliam John Graham Scott (John Scott). Lately Member, Scottish Parliament, Ayr. For Political and Public Service. (Ayr, Ayrshire and Arran)\n\nMark Sealy MBE. Curator and Cultural Historian. For services to Art. (London, Greater London)\n\nJonathon Mark Sesnan. Co-Founder and Chief Executive Officer, Greenwich Leisure Ltd. For services to the UK Leisure Industry, particularly during Covid-19. (Dartford, Kent)\n\nImran Faisal Shafi. For Public Service. (London, Greater London)\n\nRohini Sharma Joshi. Lately Equality, Diversity and Inclusion Manager, Trust Housing Association, Edinburgh. For services to Equality, Diversity and Inclusion. (Bonnyrigg, Midlothian)\n\nFay Angela Sharpe. Founder, Fast Forward 15. For services to Mentoring Women, Gender Equality and to Charitable Fundraising. (Loxhill, Surrey)\n\nMichael John Sharrock. Chief Executive, British Paralympic Association. For services to Athletes with Disabilities. (Checkendon, Oxfordshire)\n\nProfessor Eleanor Shaw. Associate Principal Entrepreneurship and Education, University of Strathclyde. For services to Entrepreneurship and to Education. (Netherlee, Renfrewshire)\n\nProfessor Zoe Kai Shipton. Professor of Geological Engineering, University of Strathclyde. For services to Geoscience and Climate Change Mitigation. (Glasgow, Glasgow)\n\nHilary Ann Margaret Singleton. Board Member, International Fund for Ireland. For services to the Community Sector. (Markethill, County Armagh)\n\nSindy Skeldon. Deputy Director, Universal Credit National Services, Work and Health Services, Department for Work and Pensions. For Public Service. (Wallsend, Tyne and Wear)\n\nDavid John Rivers Sleath. Chief Executive Officer, SEGRO plc. For services to Charity and Business. (Warwick,, Warwickshire)\n\nSusan Louise Smith. Lately Director, Science and Technology Facilities Council’s Accelerator Science and Technology Centre. For services to Science and Technology. (Warrington, Cheshire)\n\nAndrew Mark Smith. Director, Corporate Affairs, Pinewood Group Limited and Chair, Buckinghamshire Local Enterprise Partnership. For services to Business and the to British Film Industry. (Stoke Poges, Buckinghamshire)\n\nMichael John Smith. Digital Media Manager, Metropolitan Police Service. For services to Law Enforcement. (Scarborough, North Yorkshire)\n\nDr Faye Catherine Smith. Materials Specialist, Department for International Trade and Independent Consultant. For Public Service. (Newbury, Berkshire)\n\nLouise Natalie Smith. Deputy Director, Arts and Libraries Team, Department for Digital, Culture, Media and Sport. For services to the Arts during Covid-19. (London, Greater London)\n\nAdrian Paul Smith. Chief Executive, Reclaim Fund Ltd. For services to Financial Sector. (Swindon, Wiltshire)\n\nDavid John Smith MBE. For services to the sport of Boccia. (Swansea, West Glamorgan)\n\nThomas Spedding. Transport Manager, Nuclear Transport Solutions. For services to the UK Nuclear and Transport Industries. (Manchester, Greater Manchester)\n\nChris Spice. National Performance Director, British Swimming. For services to Swimming and High Performance Sport. (London, Greater London)\n\nDr Julian Francis Stair. Potter and Historian. For services to Ceramics. (London, Greater London)\n\nScott William Stevenson. Deputy Director, Covid-19 Taskforce, Cabinet Office. For Public Service. (London, Greater London)\n\nErika Jane Stoddart. Chair, TEC Partnership. For services to Education. (Scunthorpe, Lincolnshire)\n\nDr Malur Sudhanva. Consultant Virologist, South London Specialist Virology Centre, King’s College Hospital, NHS Foundation Trust. For services to Healthcare Science particularly during Covid-19. (London, Greater London)\n\nProfessor Ann Sutton MBE. For services to the Arts. (Arundel, West Sussex)\n\nKate Elizabeth Sutton (Katie Piper). Founder, The Katie Piper Foundation. For services to charity and Victims of Burns and other Disfigurement Injuries. (Buckinghamshire)\n\nAnthony David Swallow. Philanthropist and Joint Founder, Cre8 Macclesfield Youth and Community Programme. For services to Young People and to the community in Cheshire and Abroad. (Macclesfield, Cheshire)\n\nDr Kevin Francis Sweeney. Lately Head, Central Survey Unit, Northern Ireland Statistics and Research Agency. For Public Service, particularly during Covid-19. (Belfast, City of Belfast)\n\nJulie Christina Bingham Taggart. Principal, Nendrum College, Comber, Northern Ireland. For services to Education. (Ballynahinch, County Down)\n\nSelina Maureen Taylor. Deputy Chief Engineer, Submarine Combat Systems, Submarine Delivery Agency. For services to Defence and to St John Ambulance during Covid-19. (Lydney, Gloucestershire)\n\nRekha Thawrani. Global Head, NEC Contracts, Thomas Telford Ltd. For services to Infrastructure and British Exports. (London, Greater London)\n\nDr Julia Elizabeth Thompson. Senior Director R&D, AstraZeneca. For services to the COVID-19 response. (Thriplow, Hertfordshire)\n\nJohn Gerard Timpson. Disability and Access Ambassador. For voluntary services to People with Disabilities and to the Financial Sector. (North Berwick, East Lothian)\n\nSanjiv Vedi. Assistant Director, Head, Office of the Chief Social Care Officer for Wales. For Public, Charitable and Voluntary Service. (Cardiff, South Glamorgan)\n\nPeter James Vernon. International Liaison Officer, National Crime Agency. For services to International Law Enforcement. (London, Greater London)\n\nDr Stuart Wainwright. Director, Government Office for Science. For services to Contingency Planning and Response. (Dorking, Surrey)\n\nLady Rachel Elizabeth Waller. Co-Founder and lately Head of Fundraising, Charlie Waller Trust. For services to Mental Health in Young People. (Reading, Berkshire)\n\nJanet Mary Wallsgrove. Director, H.M. Prison and Young Offender Institution Parc, G4S Care and Justice Services Limited. For services to the Prison Service. (Peterston-super-Ely, Vale of Glamorgan)\n\nSonia Walsh. Governor, H.M. Prison Wayland. For services to H.M. Prison and Probation Service. (Ely, Cambridgeshire)\n\nJohn Selwyn Ward. Lately Deputy Director, Department for Work and Pensions Legal Advisers, Government Legal Department. For Public Service. (London, Greater London)\n\nEdward James Watson-O’Neill. Chief Executive Officer, SignHealth. For services to People with Hearing Impairments. (London, Greater London)\n\nClaire Waxman. Independent Victims’ Commissioner for London, Mayor’s Office for Policing and Crime. For services to Victims of Crime. (London, Greater London)\n\nDavid Wells. Chief Executive Officer, Logistics UK. For services to Transport and Logistics during Covid-19. (Eastbourne, East Sussex)\n\nSophie Wells MBE. For services to Equestrianism. (Newark, Nottinghamshire)\n\nDavid Robert Wheldon. For services to Advertising and Marketing. (London, Greater London)\n\nSandra Jane White. Lately National Lead for Dental Public Health, Public Health England. For services to Dental Public Health and Covid-19. (Northampton, Northamptonshire)\n\nMax Antony Whitlock MBE. For services to Gymnastics. (Bulphan, Essex)\n\nKatrina Joan Williams. Head, Office and Travel Solutions, Crown Commercial Service. For Public Service. (Mansfield, Nottinghamshire)\n\nDr Douglas Andrew Wilson. Chief Scientist, Environment Agency. For services to Environmental Research and the Covid-19 Response. (Wotton-under-Edge, Gloucestershire)\n\nPeter Wilson. For services to Classical Ballet. (London, Greater London)\n\nJulius Peregrine Harold Shepherd Wolff-Ingham. Head of Marketing and Fundraising, The Salvation Army, UK and Republic of Ireland. For services to Charitable Fundraising. (London, Greater London)\n\nDerek Andrew Wood. Head, Retirement Services Assurance, Department for Work and Pensions. For services to Pensioners. (Ashington, Northumberland)\n\nHeather Jean Wood. Registrar, House of Commons. For services to the House of Commons. (London, Greater London)\n\nSarah Jane Wren MBE. Chief Executive Officer, Hertfordshire Independent Living Service. For services to Older and Disabled People in Hertfordshire. (Hitchin, Hertfordshire)\n\nMembers of the Order of the British Empire (MBE)\n\nMarie Addison. Regional Community and Sustainability Manager, Northern Trains Ltd. For services to the community in Northumberland. (Newcastle upon Tyne, Tyne and Wear)\n\nOyebanji Adeyemi Adewumi. Lately Associate Director of Inclusion, Barts Health NHS Trust. For services to the NHS and to Diversity. (London, Greater London)\n\nDoreen Muriel Kinbarra Agutter. For services to the History of Meriden and Warwickshire. (Balsall Common, West Midlands)\n\nAbigail Adwoa Boatemaa Agyei. Lately Senior Policy Adviser, People, Places and Communities, Department for Levelling Up, Housing and Communities. For Public Service. (London, Greater London)\n\nZulkifl Ahmed. Lately Special Educational Needs and Disability Group Manager, Worcestershire County Council. For services to Education and to Young People. (Walsall, West Midlands)\n\nMorenike Olubukunola Ajayi. Founder, Career Nuggets. For services to Race Equality and Inclusion. (Gravesend, Kent)\n\nJayne Elizabeth Aldridge. Director for the Student Experience, University of Sussex and lately Chair, AMOSSHE. For services to Students in Higher Education. (Horsham, West Sussex)\n\nDr Rhoda Allison. Associate Director of Nursing and Professional Practice, Torbay and South Devon NHS Foundation Trust. For services to Physiotherapy. (Torbay, Devon)\n\nKaren Jane Almond. For services to Women’s Rugby Union Football. (Abroad)\n\nGraeme Anderson. Lately Lead Events Planning Officer, Tayside Division, Police Scotland. For services to Event Planning and to Law and Order in Dundee. (Monifieth, Angus)\n\nProfessor Diana Anderson. Professor of Biomedical Sciences, University of Bradford. For services to Genetic and Reproductive Toxicology. (Bradford, West Yorkshire)\n\nDr Wendy Jane Anne Anderson. Respiratory Consultant, Northern Health and Social Care Trust. For services to Healthcare, particularly during Covid-19. (Bangor, County Down)\n\nSamantha Kate Anderson. Senior Policy Adviser, Pensions and Savings Tax, H.M. Treasury. For Public Service. (London, Greater London)\n\nFreya Anderson. For services to Swimming. (Wirral, Merseyside)\n\nJohn Linden Archibald. Hall Porter, Old College, Royal Military Academy Sandhurst. For services to Defence. (Crowthorne, Berkshire)\n\nDr Seema Safia Arif. For services to Health Care amongst the Black, Asian and Minority Ethnic Community. (Cardiff, South Glamorgan)\n\nRoger Colin Armstrong. For services to Storytelling in Northern Ireland. (London, Greater London)\n\nMichael Frederick Asante. Co-founder, Boy Blue. For services to Hip-Hop Dance and Music. (London, Greater London)\n\nGregory Antonio Ashby. Director of Operations, Money A&E. For services to Disadvantaged People and Social Enterprise. (London, Greater London)\n\nSyima Aslam. Founder, Chief Executive Officer and Artistic Director, Bradford Literature Festival. For services to Literature. (Bradford, West Yorkshire)\n\nDavid Gwynne Backhouse. Chair of Governors, Grove Primary School, Mayfield School, Barley Lane Primary School, and Redbridge Primary School, London Borough of Redbridge. For services to Education. (London, Greater London)\n\nMargaret Po Ling Bailey. Occupational Psychologist, Royal Air Force Recruitment and Selection. For services to Aircrew Assessment and Aptitude Testing. (Oasby, Grantham, Lincolnshire)\n\nMatthew James Baker. Trustee, Children in Need. For charitable and voluntary services to Fundraising. (Buckland Common, Buckinghamshire)\n\nDr Subramaniam Balachandran. Doctor and Lead, Cross Infection, Cardiff and Vale University Health Board. For services to the NHS during Covid-19. (Cardiff, South Glamorgan)\n\nAshley Banjo. For services to Dance. (Bicknacre, Essex)\n\nDarren Barker. Principal Conservation Officer, Great Yarmouth Borough Council and Managing Director, Great Yarmouth Preservation Trust. For services to Heritage. (Catfield, Norfolk)\n\nJuliette Barker. Business Readiness Lead, Leicester, HM Revenue and Customs. For Public Service. (Countesthorpe, Leicestershire)\n\nDennis Morris Barnett. For services to Vulnerable People in Essex. (Colchester, Essex)\n\nGareth John Batty. Chief Executive Officer, FareShare, Yorkshire. For services to the Charity Sector. (Eckington, Derbyshire)\n\nLaura Catherine Baxter. For services to the Special Olympics. (Perth, Perth and Kinross)\n\nProfessor Laura Charlotte Bear. Professor and Head, Department of Anthropology, London School of Economics. For services to Anthropology during Covid-19. (London, Greater London)\n\nMalcolm Ellis Bell. Chief Executive, Visit Cornwall. For services to Tourism in South West England, particularly during Covid-19. (Truro, Cornwall)\n\nGary Bennett. Patron, Show Racism The Red Card. For services to Anti-Racism in Football. (Houghton-le-Spring, Tyne and Wear)\n\nAlan Richard Benson. Chair, Transport for All. For services to Public Transport for People with Disabilities. (London, Greater London)\n\nSushma Bhanot. For services to Wellbeing and the community in Chigwell, Essex, particularly during Covid-19. (Chigwell, Essex)\n\nAyaz Mazeed Bhuta. For services to Wheelchair Rugby. (Bolton, Greater Manchester)\n\nSharman Birtles JP DL. For services to Charity and the community in Greater Manchester. (Manchester, Greater Manchester)\n\nStuart Bithell. For services to Sailing. (Poole, Dorset)\n\nJoe Blackman. For services to the Economy and Charity. (London, Greater London)\n\nMichelle Dawn Blanchard. Lately Executive Principal, Dixons Academies Trust, Bradford. For services to Education. (Bingley, West Yorkshire)\n\nMatthew Philip Bolshaw. Member, Secretariat for the General Aviation, All-Party Parliamentary Group. For services to Aviation Safety. (Letchmore Heath, Hertfordshire)\n\nAntoine-Philippe Boo. First Secretary Migration and Borders, British Embassy Paris. For services to UK Border Security. (Whitstable, Kent)\n\nSarah Boyle. Team Leader, Ministry of Defence. For services to Defence. (London, Greater London)\n\nAnthony Ross Bradley. For services to the community in Newtown Linford and Birstall, Leicestershire. (Newtown Linford, Leicestershire)\n\nJane Rosalind Bradshaw. For services to Charity in North East England. (Stockton-on-Tees, County Durham)\n\nMargaret Emma Bravo. Manager, St Peter’s Pre-School, Carlisle. For services to Education. (Carlisle, Cumbria)\n\nDr Peter Richard Briggs. For services to Judo. (Portstewart, County Londonderry)\n\nFrank Bright. For services to Holocaust Education. (Ipswich, Suffolk)\n\nEzechi David Michael Britton. Co-Founder and Chief Executive Officer, Code Untapped. For services to Diversity and to Young People. (London, Greater London)\n\nPeter Broadbent. Director and Conductor, Joyful Company of Singers. For services to Music. (Enfield, Greater London)\n\nMichael Tom Bromby. Boxing Coach. For services to Boxing and the community in Hull. (London, East Riding of Yorkshire)\n\nPawlet Brookes. Founder and Artistic Director, Serendipity Arts UK Ltd. For services to the Arts. (St. Mawes, Cornwall)\n\nJonathan Broom-Edwards. For services to Athletics. (Loughborough, Leicestershire)\n\nMelanie Janine Brown. Patron, Women’s Aid. For services to Charitable Causes and Vulnerable Women. (Leeds, West Yorkshire)\n\nJonathan Brownlee. For services to Triathlon. (Bramhope, West Yorkshire)\n\nElizabeth Mary Buchanan. Ward Manager, Respiratory Ward, Altnagelvin Hospital. For services to Nursing in Northern Ireland, particularly during Covid-19. (Londonderry, County Londonderry)\n\nDr Robert Franklin Bud. Keeper Emeritus and Museologist, The Science Museum. For services to The Science Museum and Northern Industrial Heritage. (London, Greater London)\n\nSofia Buncy. Founder, Muslim Women in Prison Project. For services to Prisoners and the community in Bradford, West Yorkshire. (Huddersfield, West Yorkshire)\n\nReverend Steven Leo Bunting. For charitable services to the community in Swansea. (Swansea, West Glamorgan)\n\nRobert James Burrows. Lately Branch Staff Member, Nationwide. For services to the Financial Sector and to the community in Bath during Covid-19. (Stonehouse, Gloucestershire)\n\nArjmund Jabeen Butt. For services to HM Revenue and Customs and the BAME Community. (Bradford, West Yorkshire)\n\nEllen Frances Buttrick. For services to Rowing. (Henley-on-Thames, Oxfordshire)\n\nJohn Frederick Leonard Caiger. Cadet Executive Officer, Essex Army Cadet Force. For services to Young People in Essex. (Colchester, Essex)\n\nHilda Campbell. Chief Executive, COPE Scotland. For services to Mental Health and Wellbeing in the Community in Scotland during Covid-19. (Glasgow, Glasgow)\n\nProfessor Lucy Jane Carpenter. Professor of Atmospheric Chemistry, University of York. For services to Atmospheric Chemistry. (York, North Yorkshire)\n\nAndrew Carwood. Founder Director, The Cardinall’s Musick, and Director of Music, St Paul’s Cathedral. For services to Choral Music. (London, Greater London)\n\nJulian MacLeod Paul Cash. Chair, Community Furniture Aid. For services to Homeless People in Bridgend. (Bridgend, Bridgend)\n\nWendy Casson. Lately Head Teacher, Educational Diversity, Blackpool. For services to Education. (Thornton Cleveleys, Lancashire)\n\nJordan Michael Catchpole. For services to Swimming. (Beccles, Suffolk)\n\nLouis Cayer. Tennis Coach. For services to Tennis. (London, Greater London)\n\nRabbi Albert Sebastian Chait. For services to the Jewish Community and to Charity in West Yorkshire, particularly during Covid-19. (Leeds, West Yorkshire)\n\nProfessor Iain Leslie Campbell Chapple. Professor, Periodontology and Head of Research, Institute of Clinical Sciences, College of Medical and Dental Studies, University of Birmingham and Consultant, Restorative Dentistry, Birmingham Community Healthcare Foundation NHS Trust. For services to Oral and Dental Health. (Shelfield, Warwickshire)\n\nBrian Chenier. Support Officer, Prosthetics, Blesma. For services to Disabled Veterans. (Colchester, Essex)\n\nJane Heather Chiodini. Travel Health Specialist Nurse. For services to Training and Development in Travel Medicine. (London, Greater London)\n\nChristine Rutherford Chisholm. Founder Trustee, New Jumbulance Travel Trust. For services to Philanthropy and Charitable Causes. (Romsey, Hampshire)\n\nJoseph Choong. For services to Modern Pentathlon. (Bath, Somerset)\n\nAnita Choudhrie. Founder, Path to Success. For services to Disability Sports. (London, Greater London)\n\nMatthew John Clark. Lately Chief of Staff, Scottish Liberal Democrats, Scottish Parliament. For services to Politics. (Ladybank, Fife)\n\nWilliam John Clarke. Leader, Gedling Borough Council. For services to Local Government in Nottinghamshire. (Carlton, Nottinghamshire)\n\nHoward Morgan Clarke. Research Director, Morgan Innovation and Technology. For services to Business and Entrepreneurship. (Liss, Hampshire)\n\nSusan Elizabeth Clarke. Managing Director, Morgan Innovation and Technology. For services to Business and Engineering. (Liss, Hampshire)\n\nPeter Roland Henry Clifford TD. For services to Sport, to Charity and to the community in Frampton on Severn, Gloucestershire. (Frampton on Severn, Gloucestershire)\n\nAlan Clifton. Virtual School Head, National Association of Virtual School Heads. For services to Children in Care. (Yarm, North Yorkshire)\n\nVictoria Laura Elizabeth Cochrane. Director of Midwifery, Chelsea and Westminster Hospital NHS Foundation Trust. For services to Midwifery. (London, Greater London)\n\nJonathan Coggan. For services to Wheelchair Rugby. (Hertford, Hertfordshire)\n\nPaulette Cohen. Head, Diversity and Inclusion, Barclays. For services to Business, and to Diversity and Inclusion. (London, Greater London)\n\nRoger George Cohen. Lifeboat Operations Manager, Brighton Lifeboat Station and Newhaven Lifeboat Station. For services to the RNLI and to Charity. (Brighton, East Sussex)\n\nLuke Berenger Collet-Fenson. Senior Private Secretary to the Chief Medical Officer, Department of Health and Social Care. For Public Service during Covid-19. (Ely, Cambridgeshire)\n\nLaura Collett. For services to Equestrianism. (Cheltenham, Gloucestershire)\n\nMichaela Collins. For services to the community in Glasgow during Covid-19. (Glasgow, Glasgow)\n\nNicola Catherine Colson. Head of Dose Sharing, Vaccine Taskforce, Department for Business, Energy and Industrial Strategy. For services to Global Health. (London, Greater London)\n\nBernadette Conlon. President and lately Chief Executive, START. For services to Mental Health and to Disadvantaged Communities in Salford, Greater Manchester. (Manchester, Greater Manchester)\n\nJohn Arthur Cooke. Board Secretary, English National Opera. For services to Opera. (London, Greater London)\n\nChristopher Cookson. Customer Delivery Hub Technician, John Lewis and Partners. For Voluntary and Charitable Services. (South Shields, Tyne and Wear)\n\nThomas Richard Cookson. Chairman, Physics Partners, Kent. For services to Education. (Wrotham, Kent)\n\nLieutenant Colonel (Rtd) Timothy Brian Jackson Coombe. For services to the community in Brampton, Cumbria. (Roweltown, Carlisle, Cumbria)\n\nBarbara Anne Cooper. Corporate Director Growth, Environment and Transport, Kent County Council. For services to Transport and to the Covid-19 Response. (Crundale, Kent)\n\nLee Shane Cooper. Forest Research Worker, Forest Research. For services to Forestry. (Scarborough, North Yorkshire)\n\nYvonne Lucy Copley. Chief Executive, Kyra’s Women’s Project. For services to Women and to the community in York. (Easingwold, North Yorkshire)\n\nProfessor Alan Michael Cottenden. Emeritus Professor of Incontinence Technology, University College London. For services to Sufferers of Incontinence. (Bedford, Bedfordshire)\n\nDr Alan Charles Cotton. For services to the Arts in South West England. (Sidmouth, Devon)\n\nDavid Ryan Cowling. For services to Wheelchair Rugby. (Matlock, Derbyshire)\n\nPhilippa Mary Cramer. Co-Founder, The Daily Hope. For services to Older and Vulnerable People, particularly during Covid-19. (Esher, Surrey)\n\nPaul Samuel Creelman. Foster Carer and Support Worker, North Yorkshire. For services to Fostering and Youth Work. (Scarborough, North Yorkshire)\n\nBrian Richard Crosby. Intelligence Manager, Home Office. For Public Service. (Abroad)\n\nBrian Crosby. Chief Executive Officer, Coast and Vale Learning Trust. For services to Education in Yorkshire. (York, North Yorkshire)\n\nNicholas Cummins. For services to Wheelchair Rugby. (Leicester, Leicestershire)\n\nHilda May Dalziel. For services to Young People in the East End of Glasgow. (Clydebank, Dunbartonshire)\n\nSimon Peter Darby. Social Worker, Young Lives vs Cancer. For services to Teenagers and Young Adults with Cancer in Northern Ireland. (Belfast, City of Belfast)\n\nEdward Norman Darke. Councillor, Longbenton Ward, North Tyneside Council. For services to the community in North Tyneside. (Longbenton, Tyne and Wear)\n\nMargaret Davenport. For services to Arts in the community in Suffolk. (Stowmarket, Suffolk)\n\nIan Alexander Davidson. Principal Teacher, Guidance, Elgin Academy. For services to Education in Moray. (Elgin, Moray)\n\nJohn Iestyn Davies. Co-Founder and Chair, Cyber Wales. For services to the UK Cyber Ecosystem. (Brecon, Powys)\n\nSharon Louise Davies. Vice President, Regulatory and Public Affairs, DHL Express Europe. For services to Logistics. (Hurstpierpoint, West Sussex)\n\nAlan George Davis. Lately Director, Human Resources, Organisational Development and Estates, South West Yorkshire Partnership NHS Foundation Trust. For services to the NHS, particularly during Covid-19. (Wakefield, West Yorkshire)\n\nPhillip Dawe. Team Leader, Sir Keith Park Building Restoration Project, RAF Northolt. For voluntary service to Military Aviation Heritage. (London, Greater London)\n\nKathleen Mary Dawson. For services to Swimming and Women in Sport. (Stirling, Stirling and Falkirk)\n\nThomas William Darnton Dean. For services to Swimming. (Maidenhead, Berkshire)\n\nJohn David Vernon Dent. For services to Veterans, Students and People with Disabilities. (Carluke, Lanarkshire)\n\nAndrew Keith Gordon Denton. Lately Head, Hotel Services, Best Western Hotels. For charitable services to the NHS and to Vulnerable People during Covid-19. (Wetherby, West Yorkshire)\n\nDr Baljinder Singh Dhanda. Co-Chair, UK Cyber Security Council Formation Project. For services to Cyber Security. (Amersham, Buckinghamshire)\n\nNarinderjit Dhandwar. Business Relationship Manager, Barclays. For services to the Business and Financial Sectors in the West Midlands during Covid-19. (Walsall, West Midlands)\n\nJeremy Dick. Woodland Officer, Forest Services. For services to Forestry. (York, North Yorkshire)\n\nClare Dickens. Senior Lecturer, Nursing Studies, Mental Health, University of Wolverhampton. For services to Education and Improving Suicide Awareness. (Wolverhampton, West Midlands)\n\nKevin Francis Dickens. Director of Resources, The Abbey School, Faversham, Kent. For services to Education. (Tankerton, Kent)\n\nEzekiel Graham Dodds. For Public Service to Communities across Northern Ireland. (Omagh, County Tyrone)\n\nDavid Robert Martin Donaldson. For services to Charity and to the community in Northern Ireland. (Enniskillen, County Fermanagh)\n\nKenneth Ross Donaldson. Director of Services, South East Fermanagh Foundation. For services to the community in Northern Ireland. (Fivemiletown, County Tyrone)\n\nMichael Brian Donegan. Founder and Chief Executive Officer, SpecialEffect. For services to Technology for the Disabled. (Chipping Norton, Oxfordshire)\n\nJill Alison Douglas (Jill Douglas Hogg). Sport Presenter. For services to Sport and Charity. (Cheltenham, Gloucestershire)\n\nKathryn Mary Draper Garraway. For services to Broadcasting, Journalism and Charity. (London, Greater London)\n\nHeather Drysdale. Lately Returns Engagement Team Leader, Home Office. For Public Service. (Horley, West Sussex)\n\nJohn William Murray Duncan. For Political Service. (Drumoak, Aberdeenshire)\n\nMaureen Elizabeth Dunn. For services to Drama and the Performing Arts in Northern Ireland. (Newtownabbey, County Antrim)\n\nThomas Gerard Dunn. Lately Founder and Chairman, Aeros Holdings Ltd. For services to Aviation. (Henley in Arden, Warwickshire)\n\nReece Dunn. For services to Swimming. (Plymouth, Devon)\n\nJeremond Emric During. Chief Executive Officer, Money A&E. For services to Disadvantaged People and Social Enterprise. (London, Greater London)\n\nJacqueline Anne Eason. Chair of Trustees, Leading Edge Academies Partnership, Cornwall. For services to Education. (Wadebridge, Cornwall)\n\nSamia Claire Edmonds. For services to the Covid-19 response. (Penarth, Vale of Glamorgan)\n\nAntonis Eleftheriou. Contract Director, Sovereign Base Areas, Sodexo. For services to Facilities Management in support of British Forces Cyprus. (Abroad)\n\nJohnny Elford. Officer, National Crime Agency. For services to Law Enforcement. (London, Greater London)\n\nIan Martin Elgeti. Forensic Manager, Thames Valley Police. For Services to Policing. (Great Missenden, Buckinghamshire)\n\nDr Margaret Patricia Ellis. For services to Dementia Care and to the community in St Andrews, Fife. (Monifieth, Angus)\n\nSally Elizabeth Embree. Head, Technical Conservation Team, Historic England. For services to Heritage. (Bath, Somerset)\n\nMark Abayomi Esho. Director, Easy Internet Services Ltd and Easy Internet Solutions. For services to Business. (Leicester, Leicestershire)\n\nMaxine Elisabeth Helen Joyce Espley. Executive Director, Care and Support, Green Square Accord. For services to Health and Social Care. (Sutton Coldfield, West Midlands)\n\nWilliam Delwyn Evans. Head, Enforcement Transformation, Driver and Vehicle Standards Agency. For services to Road Safety during Covid-19. (Woking, Surrey)\n\nMichael Norman Gwynne Evans. Trustee, Wood Street Mission. For services to Charity and to Disadvantaged People in Manchester and Salford. (Cheadle Hulme, Greater Manchester)\n\nAnna Vanda Laura Fairchild. For services to Women’s Martial Arts and to the NHS. (Leeds, West Yorkshire)\n\nPaul John Fairie. Head of Operations, Lighthouse Laboratory Glasgow. For services to the NHS during Covid-19. (Renfrew, Renfrewshire)\n\nHedley Rhodes Featherstone. Centenary Delivery Executive, Civil Service Sports Council. For services to Civil Service Sport and Volunteering. (London, Greater London)\n\nMonica Mary Fitzpatrick (She/Her). Deputy Principal, Equality and LGBT Policy Unit, Department for Communities, Northern Ireland Executive. For services to Equality and LGBT Rights and voluntary services to Law and Order. (Belfast, City of Belfast)\n\nEdith Mary Adelaide Fleck. For services to the Community in Northern Ireland. (Lisburn, County Antrim)\n\nSusan Deborah Fleet. Managing Director, Lea Graham Associates. For services to Music, to Charity and to Fundraising. (Burgess Hill, West Sussex)\n\nLucy Fletcher. Senior Trial Manager, University of Oxford. For services to Clinical Trials. (Abingdon, Oxfordshire)\n\nDylan James Fletcher-Scott. For services to Sailing. (Portland, Dorset)\n\nAnya Francis. For services to Young People in Durham through Swimming. (Hetton Le Hole, Northumberland)\n\nKatherine Elizabeth French. For services to Modern Pentathlon. (Chapmanslade, Wiltshire)\n\nTara Chand Garlo. Paralegal Assistant, Crown Prosecution Service. For Public Service. (London, Greater London)\n\nImelda Gavin. Compliance Officer, HM Revenue and Customs. For services to the Excise Compliance Strategy. (Belfast, City of Belfast)\n\nSeamus Patrick Gaynor. Company Secretary, The Birmingham Children’s Trust. For services to Children’s Social Care and to Education. (Sutton Coldfield, West Midlands)\n\nHelen Elizabeth Gibson. Managing Director, Agencia Consulting Ltd. For services to International Trade. (Hessle, East Riding of Yorkshire)\n\nKenneth Gibson. National Head of Safeguarding, NHS England and NHS Improvement. For services to Leadership in Healthcare. (London, Greater London)\n\nPiers Alexander Gilliver. For services to Fencing. (Gloucester, Gloucestershire)\n\nCharles Peter Meredith Girling. For services to the Housing Sector and to Charity. (Honiton, Devon)\n\nMarcia Glanvill. Administrative Support, HM Revenue and Customs. For services to Workplace Wellness and to the community in Merseyside. (Lydiate, Merseyside)\n\nTabitha Goldstaub. Chair, AI Council and Co-Founder CogX. For services to the Artificial Intelligence sector. (London, Greater London)\n\nHannah Rebecca Goldthorpe. For services to Vulnerable People and to the community in Blackburn, Lancashire. (Blackburn, Lancashire)\n\nBarry Macdonald Graham. Senior Rail Adviser, Northern Trains. For services to the Rail Industry. (Pontefract, North Yorkshire)\n\nReverend Dr Samuel Grant. For services to the community in Carrickfergus, County Antrim. (Carrickfergus, County Antrim)\n\nDr Allison Josephine Gray. For services to St John Ambulance in Northern Ireland. (Newtownabbey, County Antrim)\n\nIan Green. Section Manager, Nissan Training, Global Training Centre and Nissan Skills Foundation. For services to Apprenticeships and to STEM skills. (Houghton le Spring, Tyne and Wear)\n\nRichard Terence Greer. Forensic Case Manager, Police Service of Northern Ireland. For services to Policing and to the community in Northern Ireland. (Belfast, City of Belfast)\n\nProfessor Simon David Gregory DL. Deputy Medical Director, Primary and Integrated Care, Health Education England and General Practitioner, King Edward Road Surgery, Northampton. For services to General Practice. (Northampton, Northamptonshire)\n\nWilliam John Griffiths. Director, Milton Keynes Museum. For services to Museums and to the community in Milton Keynes, Buckinghamshire. (Milton Keynes, Buckinghamshire)\n\nKylie Grimes. For services to Wheelchair Rugby. (Farnham, Surrey)\n\nHelena Grzesk. Chief Operating Officer, British Beauty Council. For services to the Beauty Industry. (Manchester, Greater Manchester)\n\nJames Guy. For services to Swimming. (Bath, Somerset)\n\nMax Arthur Secret Hacon. Lately Deputy Director, Covid-19 Response Programme, HM Revenue and Customs. For services to the Covid-19 Response. (Whitley Bay, Tyne and Wear)\n\nAndrew Michael Haigh. For services to the Arts. (Stamford, Rutland)\n\nProfessor Euan Jonathan Hails. For services to Children and Young People’s Mental Health in Wales. (Swansea, West Glamorgan)\n\nGraeme Morris Hamilton. Deputy UK Chief Commissioner, Scouts. For services to Young People. (Rutherglen, Lanarkshire)\n\nProfessor Steven Paul Hams. Chief Nurse, Gloucestershire Hospitals NHS Foundation Trust. For services to Nursing. (Lechlade on Thames, Gloucestershire)\n\nProfessor Simon Peter Harding. Chair Professor, Clinical Ophthalmology, University of Liverpool. For services to the Prevention of Blindness. (Liverpool, Merseyside)\n\nGeoffrey Hardwicke. Team Leader, Hydrometry and Telemetry, Environment Agency. For services to Hydrometry. (Wimborne, Dorset)\n\nSister Margaret Catherine Harlock. Chair of Governors, St Brendan’s Sixth Form College, Bristol. For services to Further Education. (Bristol, Somerset)\n\nSydney Robert Harris. Chairman, Festival of Brass and Voices. For services to Community Music in Scotland and to Cancer Research UK. (Buckie, Banffshire)\n\nJohn Sampson Harris. Chair, British Shooting. For services to Sport. (Reading, Berkshire)\n\nNeil Harris. Senior Officer, Counterfeit Currency, National Crime Agency. For services to Law Enforcement. (London, Greater London)\n\nKarime Hassan. Chief Executive and Growth Director, Exeter City Council. For services to Local Government. (Devon, Devon)\n\nProfessor Richard John Haynes. Professor of Renal Medicine and Clinical Trials, University of Oxford. For services to Global Health. (Oxford, Oxfordshire)\n\nDeena Heaney. Dementia Care Specialist, Derby. For services to Dementia Care. (Derby, Derbyshire)\n\nCharlotte Sarah Henshaw. For services to Canoeing. (Sutton in Ashfield, Nottinghamshire)\n\nGareth Robert Armstrong Hetherington. Temporary Chair, Governing Body, SERC. For services to Further Education. (Belfast, City of Belfast)\n\nChristopher David Hickford. Founder and Chief Executive Officer, The Eikon Charity. For services to Vulnerable Young People and to Charity in Surrey. (Addlestone, Surrey)\n\nAdam Christopher Hills. Presenter and Comedian. For services to Paralympic Sport and Disability Awareness. (London, Greater London)\n\nAngela Holdsworth. Chief Executive Officer, The Sea View Trust, Lancashire. For services to Children and Young People with Special Educational Needs. (Rossendale, Lancashire)\n\nStephen Anthony Holland. Assistant Manager, England National Football Team. For services to Association Football. (Leatherhead, Surrey)\n\nDr Helen Brewster Holman. Lately Headteacher, Orchard School, Bristol. For services to Education. (Wotton under Edge, Gloucestershire)\n\nPaul Mayo Holt. For services to International Trade, to Education, and to the UK’s PPE Supply Chain. (Ayston, Rutland)\n\nAnna Hopkin. For services to Swimming. (Loughborough, Leicestershire)\n\nBarry Horne. Chief Executive Officer, Activity Alliance. For services to Inclusivity in Sport. (Nottingham, Nottinghamshire)\n\nHeather Sara Houston. Lecturer, Belfast Metropolitan College. For services to Further Education and Older People in Northern Ireland. (Newtownards, County Down)\n\nCherylee Houston. Actress. For services to Drama and to People with Disabilities. (Manchester, Greater Manchester)\n\nMichael Peter Howes-Roberts. For services to Government Technology, particularly during the Covid-19 Response. (Otley, Tyne and Wear)\n\nMarilyn Hubbard. Chair of Trustees, Inspiring Futures through Learning Multi-Academy Trust, Milton Keynes. For services to Education. (Olney, Buckinghamshire)\n\nPaul Clifford Hugill. Owner and Head Chef, The Priory Hotel, Louth. For services to People with Learning Difficulties. (Louth, Lincolnshire)\n\nCharlene Patricia Hunter. Founder and Chief Executive Officer, Coding Black Females. For services to Technology and Diversity. (London, Greater London)\n\nSonja Ute Huxham. Basic Skills Development Manager, Army Training Regiment. For services to Military Education. (Winchester, Hampshire)\n\nTony Hyland. Senior National Account Manager, Department for Work and Pensions. For services to Disadvantaged People. (London, Greater London)\n\nDr Adaeze Ifezulike. General Practitioner. For services to Health Inequalities in Black, Asian and Minority Ethnic Communities in Scotland. (Aberdeen, Aberdeen)\n\nRashid Tahir Iqbal. Chief Executive Officer, The Winch. For services to Young People. (London, Greater London)\n\nJayne Elizabeth Jardine. Chief Executive Officer, The Rise Partnership, London. For services to Education and SEND. (London, Greater London)\n\nCalum George Jarvis. For services to Swimming. (Bath, Somerset)\n\nOliver Brendan Jeffers. Author and Illustrator. For services to the Arts. (Holywood, County Down)\n\nAngela Johnson. Supply Chain Manager, Wm Morrison Supermarkets PLC. For services to the Food Supply Chain. (Leeds, West Yorkshire)\n\nClaudette Elaine Johnson. Co-founder, BLK Art Group. For services to Art. (London, Greater London)\n\nPaul Mark Johnston. Head Coach and Project Manager, Monkstown Amateur Boxing Club. For services to Sport and to the community in County Antrim. (Newtownabbey, County Antrim)\n\nDavid Jonathan. Director, Grassroots Programme, Luton Council of Faiths and Near Neighbours Programme. For services to Community Cohesion and Interfaith Relations in Luton, Bedfordshire. (Luton, Bedfordshire)\n\nHelen Jones. Chief Executive, MindOut. For services to LGBTQ+ Mental Health. (Seaford, East Sussex)\n\nJamie Daniel Peter Jones-Buchanan. For services to Rugby League Football and the community in Leeds. (Leeds, West Yorkshire)\n\nGary Michael Jordan. Chair, Mansfield and Ashfield 2020 Business Club and Executive Business Coach. For services to the Economy and to the Community in Mansfield and Ashfield, Nottinghamshire. (Mansfield Woodhouse, Nottinghamshire)\n\nAnnette Constance Joseph. Founder, Diverse and Equal. For services to Technology. (Eccles, Greater Manchester)\n\nDr Agnes Aranka Kaposi FREng. For services to Holocaust Education and Awareness. (London, Greater London)\n\nProfessor Nazira Karodia. Lately Professor of Science Education, University of Wolverhampton. For services to the Chemical Sciences. (Edinburgh, Edinburgh)\n\nTully Alicia Jacqueline Kearney. For services to Swimming. (Walsall, West Midlands)\n\nDior Adelle Kelly. Relationship Manager, Virgin Money. For services to the Financial Sector during Covid-19. (Glasgow, Glasgow)\n\nNeil Emile Elias Kenlock. Co-Founder, Choice FM. For services to Media. (London, Greater London)\n\nErin Kennedy. For services to Rowing. (Henley-on-Thames, Oxfordshire)\n\nSiobhan Mary Kenny. Chief Executive, Radiocentre. For services to Commercial Radio and Young People. (London, Greater London)\n\nRebecca Ann Kershaw. For services to the community in Oldham. (Todmorden, West Yorkshire)\n\nMumtaz Khan. For services to tackling Food Poverty in the UK and Abroad. (London, Greater London)\n\nQamar Mahmood Khan. Professor of Paediatric Cardiology, Guy’s and St Thomas’ Hospitals Foundation Trust. For services to Paediatric Cardiology and Charity. (London, Greater London)\n\nKaneez Khan. Coordinator, Near Neighbours, West Yorkshire. For services to Interfaith Relations, particularly during Covid-19. (Bingley, West Yorkshire)\n\nBibi Rabbiyah Khan. President, London Islamic Cultural Society. For services to Local Government and Community Cohesion. (London, Greater London)\n\nReynold James Kirk. For services to the North Irish Horse Regimental Association and to the Carrickfergus Community Heritage Project. (Bangor, County Down)\n\nPravesh Kumar. For services to Theatre. (Slough, Berkshire)\n\nEdwina Jayne Langley. Lead Attendance Officer, Birmingham City Council. For services to Education. (Telford, Shropshire)\n\nJoanne Mary Lappin. Chief Executive of Cumbria LEP. For services to the Economy in Cumbria. (Warrington, Cheshire)\n\nHardip Parkesh Singh Lawana. Senior Officer, Border Force, Home Office. For services to Border Security and to Workplace Wellbeing. (London, Greater London)\n\nTimothy John Lawler. Chief Executive, Sports Aid. For services to Sport for Young People. (Tadworth, Surrey)\n\nAlan Leslie Laws. Vice President, British Canoeing. For services to Canoeing. (Coningsby, Lincolnshire)\n\nJessica Learmonth. For services to Triathlon. (Leeds, West Yorkshire)\n\nSimon Norris Lee. Group Chief Executive, Civil Service Sports Council. For services to Sport and Wellbeing. (Crickhowell, Powys)\n\nMatthew Lee. For services to Diving. (London, Greater London)\n\nJanet Belinda Lefley. Community Manager, The Romsey School, Hampshire. For services to Education. (Lifton, Devon)\n\nDr Vivienne Catherine Lennox. Chair of Governors, Suffield Park Infant and Nursery School, Norfolk. For services to Education. (Cromer, Norfolk)\n\nHenry Lewis. Honorary Vice President, The Magic Circle. For services to Fundraising and Charitable Causes. (London, Greater London)\n\nEmma Ruth Lindley. Co-Founder, Women in Identity. For services to promoting Diversity and Inclusion in the Digital Identity Sector in the UK and Abroad. (High Wycombe, Buckinghamshire)\n\nBeverley Little (Mark Little). For services to Victims of Modern Slavery. (Norwich, Norfolk)\n\nCynthia Lloyd (Cyndy Lloyd). For services to Young People in Cheshire. (Northwich, Cheshire)\n\nSanjay Lobo. Chief Executive Officer and Founder, OnHand. For services to Older People, particularly during Covid-19. (London, Greater London)\n\nTrevor William Lockhart. Chief Executive, Fane Valley Co-Operative Society Limited. For services to the Agri-Food Industry and to the Economy in Northern Ireland. (Markethill, County Armagh)\n\nJames Lovett. Team Leader, Ministry of Defence. For services to Defence. (London, Greater London)\n\nTracy Luke. Chair of Governors, Turner Free School, Folkestone, Kent. For services to Education. (Hawkinge, Kent)\n\nFiona Louise Mackenzie. Founder, We Can’t Consent to This. For services to Raising Awareness of Sexual Violence Against Women. (London, Greater London)\n\nJames Mackie JP. Chair, Lifeboat Management Group, Southend-on-Sea Lifeboat Station. For services to the RNLI and to Charity. (Southend-on-Sea, Essex)\n\nPaul Francis John Mackin. Town Councillor and Mayor, Shefford Town, Bedfordshire. For services to Local Government. (Shefford, Bedfordshire)\n\nMairead Mackle. Founder and Chief Executive Officer, Tarasis Enterprises. For services to Economic Development in Northern Ireland. (Armagh, County Armagh)\n\nFrederick George Magee. For services to Association Football in East Belfast. (Belfast, City of Belfast)\n\nAnne Mairead Maguire. Lately Project Lead Digital Admissions, Education Authority Northern Ireland. For services to Education. (Portadown, County Armagh)\n\nMunir Faizal Mamujee. Managing Director, m2r Education, For services to Education and Exports. (Wakefield, West Yorkshire)\n\nSusan Lesley Manns. Director, Sue Manns Associates. For services to Planning. (Church Stretton, Shropshire)\n\nGeorge Lennox Marcar. Driver Policy Implementation Manager, Transport for London. For services to Transport in London. (Rochester, Kent)\n\nPatricia Ann Marchiori. Lately Chair of Trustees, Ambitions Academy Trust, Poole. For services to Education. (Bournemouth, Dorset)\n\nNicholas Peter Marsh. Consultant Forensic Imaging Practitioner, Metropolitan Police Service. For services to Policing. (Farnham, Surrey)\n\nDr Marie Eileen Marshall. Nurse Consultant for Transition, Manchester University NHS Foundation Trust. For services to Children and Young People’s Health. (Stockport, Greater Manchester)\n\nDaniel William Munro Martin. For services to Libraries and to Heritage in Scotland. (Kirkintilloch, Dunbartonshire)\n\nSelby William Martin. Chair and Trustee, Shropshire Branch, Council for the Protection of Rural England. For services to the community in Shropshire. (Shrewsbury, Shropshire)\n\nMarc William Masey. Senior Private Secretary to the Chief Medical Officer, Department for Health and Social Care. For Public Service during Covid-19. (London, Greater London)\n\nSusan Jabeena Maslin. For services to Modern Pentathlon. (Beaminster, Dorset)\n\nArron John Maspero. Programme Delivery Manager, Census Field Devices, Office for National Statistics. For services to Census 2021 Field Operations. (Fareham, Hampshire)\n\nJacqueline Maxwell. Head, Customer Relations, SSE. For services to the Energy Supply Industry. (Broughty Ferry, City of Dundee)\n\nJanet McAlister. Lately Lead Officer, School Catering Service, Education Authority Northern Ireland. For services to Education in Northern Ireland. (Banbridge, County Down)\n\nLaurence McBreen. For services to the Social Work Sector in South Wales. (Cardiff, South Glamorgan)\n\nMargaret Pearl McBride. Vice Principal, Bangor Academy and Sixth Form College, Northern Ireland. For services to Education. (Downpatrick, County Down)\n\nProfessor Jackie McCoy. Professor, Management Development and Associate Dean for Global Engagement, Ulster University. For services to Higher Education, to Business and to the Arts. (Belfast, City of Belfast)\n\nJanet Marjorie McDermott. Lately Head of Membership, Women’s Aid Federation, England. For services to the Prevention of Violence against Women and Girls. (Sheffield, South Yorkshire)\n\nStuart Rainey McDonald. Head of Demographic Assumptions and Methodology, Lloyds Banking Group. For services to Public Health. (London, Greater London)\n\nThomas Bruce McEwen. For services to Equestrianism. (Tetbury, Gloucestershire)\n\nRoger Colin McFarland. For services to the community in Chelmsford, Essex. (Chelmsford, Essex)\n\nAngela Mary Veronica McIntyre DL. For services to the Foyle Hospice and the community in County Londonderry. (Londonderry, County Londonderry)\n\nKay McIntyre. Youth Support and Participation, Young People Manager, East Cheshire Council. For services to Children and Young People. (Bidulph, Staffordshire)\n\nEilidh Jane McIntyre. For services to Sailing. (Portland, Dorset)\n\nNorman McKinley. Executive Director, UK Operations, British Red Cross. For services to the Covid-19 Response. (Belfast, City of Belfast)\n\nWilliam James McLarnin. For services to Scouting and Voluntary Service in County Down. (Hillsborough, County Down)\n\nLynne McLeod-Finch (Lynne Baird). Founder, Daniel Baird Foundation. For charitable service. (Birmingham, West Midlands)\n\nKamini Harshadbhai Mehta (Bina Mehta). Chair, KPMG UK. For services to Trade and Investments in the UK and Female Entrepreneurs. (London, Greater London)\n\nValerie Metcalfe."}, {"url": "https://www.space.com/35841-oscars-honor-nasa-katherine-johnson-hidden-figures.html", "page_content": "NASA mathematician Katherine Johnson (second left) is honored onstage with actors (left to right) Janelle Monae, Taraji P. Henson and Octavia Spencer - the stars of \"Hidden Figures,\" which focuses on Johnson's work with NASA's Mercury program - during the 89th Annual Academy Awards at Hollywood & Highland Center on February 26, 2017 in Hollywood, California. NASA astronaut Yvonne Cagle is seen standing behind Johnson\n\nThe stars of \"Hidden Figures,\" the 20th Century Fox film about NASA's early African American mathematicians, took to the stage at the Academy Awards Sunday night (Feb. 26), not to accept an Oscar, but to pay homage to the real-life \"human computer\" Katherine Johnson, who received a standing ovation.\n\n\"Movies about the lives of men and women in the history books have long been a staple of storytellers. Sometimes, the names and deeds are the heroes and their names are known to all,\" said actress Janelle Monae. [NASA's Real \"Hidden Figures\"]\n\n\"And then there are those films that shine the spotlight on those whose names are known to only a few, but whose stories are deserved to be told,\" added Octavia Spencer, who was nominated but did not win for Best Supporting Actress for her role as manager Dorothy Vaughan in \"Hidden Figures.\"\n\nWe were honored to be in an inspiring film about three such women,\" continued actress Taraji P. Henson, \"whose brilliance made our nation's achievements in space possible.\"\n\nHenson then introduced Johnson, the mathematician she portrayed, as a \"true NASA and American hero.\"\n\n\"Thank you all,\" said Johnson, 98, after being escorted to the stage by NASA astronaut Yvonne Cagle.\n\nSee more\n\n\"Katherine Johnson on the Oscars!\" tweeted NASA's Langley Research Center in Hampton, Virginia, where Johnson and her fellow women mathematicians supported the early Mercury spaceflights and where \"Hidden Figures\" is set. \"What a wonderful moment.\"\n\nThe segment was the space highlight of the night, which was few on awards for the nominated space-themed movies.\n\nDespite being the top grossing film nominated for Best Picture, \"Hidden Figures\" lost in all three categories for which it was a contender. In addition to Best Picture and Best Supporting Actress (for Spencer), \"Hidden Figures\" was also passed over for Best Adapted Screenplay. The movie was based on the book of the same title by author Margot Lee Shetterly.\n\n\"Passengers,\" the Morten Tyldum-directed science fiction film about two people (Jennifer Lawrence and Chris Pratt) who are awoken early on an interstellar trip to an exoplanet, had been nominated for Best Production Design and Best Original Score, but like \"Hidden Figures\" did not win.\n\n\"Arrival,\" the second highest-grossing Best Picture nominee, came away from the night having fared slightly better. The sci-fi film about Earth's first contact with an alien race was nominated for eight Oscars and won for Best Sound Editing (Sylvain Bellemare).\n\nAnousheh Ansari, who funded her own trip to the International Space Station in September 2006, and Firouz Naderi, the former director for solar system exploration at NASA's Jet Propulsion Laboratory, accepted the Academy Award for Best Foreign Language Film for \"The Salesman,\" on behalf of Iranian director Asghar Farhadi, who did not attend in protest of the travel ban put into place by President Donald Trump. Ansari was the first Iranian and first Muslim woman in space.\n\nFormer NASA scientist Firouz Naderi (left) and engineer/astronaut Anousheh Ansari pose with the Best Foreign Language Film award for 'The Salesman' on behalf of director Asghar Farhadi in the press room during the 89th Annual Academy Awards at Hollywood & Highland Center on Feb. 26, 2017 in Hollywood, California. (Image credit: Frazer Harrison/Getty Images)\n\nMahershala Ali, who portrayed Katherine Johnson's husband, Jim Johnson, in \"Hidden Figures,\" won the Oscar for Best Supporting Actor for his performance as Juan in \"Moonlight.\"\n\nDamien Chazelle, who won Best Director for \"La La Land,\" will next helm Universal Studios' \"First Man,\" based on historian James Hansen's biography of Apollo 11 commander Neil Armstrong.\n\nRobert Pearlman is a Space.com contributing writer and the editor of collectSPACE.com, a Space.com partner site and the leading space history news publication. Follow collectSPACE on Facebook and on Twitter at @collectSPACE. Follow us @Spacedotcom, Facebook and Google+. Original article on Space.com."}], "Catherine Johnson has been awarded the Evening Standard Award for Most Promising Playwright.": [{"url": "https://www.standard.co.uk/culture/theatre/evening-standard-theatre-awards-2019-charles-wintour-award-most-promising-playwright-a4288461.html", "page_content": "T here's more to the buzz around a brilliant new playwright than a memorable evening at the theatre.\n\nExciting new voices offer fresh perspectives on the world around us, making us sit up and pay attention to what they have to say.\n\nThe Charles Wintour Award for Most Promising Playwright has a long history of celebrating those writers, with past winners including Jez Butterworth, Lolita Chakrabarti, Tarell Alvin McCraney, Polly Stenham and Martin McDonagh.\n\nThe winner of this year's award will be announced at the 65th Evening Standard Theatre Awards, which take place on November 24. Here, meet the bright talents on this year's shortlist.\n\nZoe Cooper\n\nOut of Water, Orange Tree Theatre\n\nThe Other Richard\n\nWhat inspired you to write Out of Water?\n\nMy wife works in education. She told me about an incident at school, when Stonewall came to give a talk about homophobic bullying. The school were very enthusiastic about the talk, but later that day a pregnant head of department warned the staff who had attended not to tell anyone that she herself was in a same-sex partnership. I could understand why a teacher would feel this way, especially a woman who might already feel vulnerable because she was pregnant, and especially given her senior position. I decided to write about a teacher who lies about the gender of her partner when she starts a new job, and then can’t find a way out of that lie. The consequences for her and her students.\n\nWhat’s your best memory from the production at the Orange Tree?\n\nLots of the people involved in making the show were queer themselves, and so it was a lovely feeling to all be making a show together which centred some of our shared stories. My best memories come from these collaborator's contributions, a moment when an actor saw something of themselves in a character and in so doing helped me to see that character more clearly, or a stage manager questioned whether I had got the detail of the script right. Like lots of other minorities, queer women and non-binary people in particular rarely get to see ourselves on stage or screen, and when we do it is even rarer that we get to see ourselves in the role of the protagonist. I felt really privileged to be telling the story with all of them.\n\nWho are your biggest influences and inspirations?\n\nI have really diverse tastes in terms of theatre and playwrights, some of my favourites are Lucy Kirkwood, David Grieg, Tom Wells, Winsome Pinnock , Caroline Horton, Alan Ayckbourn, Annie Baker . Maybe what they have in common is that they are all tender writers, who are united in trying to understand why their characters do what they do, with compassion.\n\nWhat’s the best thing you’ve seen this year?\n\nI was completely blown away by It’s True, It’s True, It’s True by Breach Theatre. The story was so urgent, so beautifully staged and the performances were three of the best I have seen all year. I also absolutely loved Charley Miles play, There Are No Beginnings at Leeds Playhouse and Danusia Samal’s Out of Sorts at Theatre503. All three plays tell really specific stories meticulously and again with compassion, and in doing so reveal bigger truths.\n\nWhat would you like to write about next?\n\nI want to write plays that are about the church, about women and poverty and pain, about elder care and the environment. I’ve got lots of ideas, and some of them feel like they belong on bigger stages. Historically those bigger stages have been dominated by the of work canonical writers, who are more often than not white and male. This, in turn, has created its own assumptions: that white male work is ‘bigger’, or that ‘bigger work’ looks like things that white men write. However, I am hopeful that this is changing and that I and other writers like me (and not like me!) will get the chance to occupy those stages more frequently soon!\n\nYasmin Joseph\n\nJ'Ouvert, Theatre503\n\nHelen Murray\n\nWhat inspired you to write J’Ouvert?\n\nJ'Ouvert is the official start of Caribbean carnival at dawn, and when I moved to New York in 2015 for an internship at the New York Theatre Workshop, it was the night before Labor Day - the city's annual West Indian Parade. The sound of soca music outside my building made me instantly feel at home and let me know that my community was nearby, so I went out to explore. A year later in 2016, I learned of a woman called Tiarah Poyau, shot and killed during J'Ouvert celebrations in Brooklyn, for declining the advances of a man she didn't want to dance with. I was really angry and thought a lot about what carnival means to me in this country, as a space to lay claim to my heritage, as a vital act of resistance and a way of pushing back against erasure. For me, black women are an integral part of the tradition, and I think J'Ouvert was my way of reconciling with how we're mistreated in the spaces that we pioneer.\n\nWhat’s your best memory from the production at the Theatre503?\n\nCarnival itself is inherently theatrical, the energy is electric, literally millions of people pouring into the streets, dancing, releasing and presenting a heightened version of themselves. The audience felt like the final character in my play, the biggest test was how to effectively mirror this energy on stage. On the opening night I was terrified, but hearing the laughter, people singing, the nods and hums of agreement from elders, the call and response with people finishing off old Jamaican proverbs. I felt really proud and privileged to be documenting such a vital part of my history. Throughout the run it was generally just so special having chats with people after the show and hearing them say they felt celebrated and seen.\n\nWho are your biggest influences and inspirations?\n\nI draw inspiration from so many places and people. My family is full of storytellers, my best friends are riotous and some of the wittiest, sharpest women in the world. I listen to lots of music and can get ideas from anything from Headie One to Nina Simone. In terms of theatre artists, a uni tutor once highlighted that the way Arthur Miller uses language is really economical, nothing is wasted. That's why A View From A Bridge is one of my favourite plays. Almost every line in isolation packs a punch. debbie tucker green inspires me to trust my audiences, she uses words in a way that feels so intentional and specific, she dares us to keep up. Some other great minds that have influenced me this year have been Rebekah Murrell, Ross Willis, Lisa Spirling, Lucy Morrison, Milli Bhatia, Jane Fallowfield, Leo Butler and Gill Greer.\n\nWhat’s the best thing you’ve seen this year?\n\nThis question's a bit impossible because there have been so many amazing shows - and also because I find it hard to remember stuff. Clean Break’s [BLANK] by Alice Birch had a profound impact on me. It was so harrowing and humane. It just felt like a visceral portrayal of our flawed criminal justice system and the women that this country continues to fail. I always say that her work finds me exactly when I need it. It made me want to be a better human, it also reminded me how much I love my mum. Jesus Hopped the 'A' Train by Stephen Adly Guirgis was also incredible. I love work that pushes audiences to challenge their own concept of morality.\n\nWhat would you like to write about next?\n\nThe things that scare me and the things that give me hope. Things that examine the human condition and make us think and laugh. Stories that are political, timely and centre the experiences of black people, particularly in this country.\n\nJasmine Lee-Jones\n\nseven methods of killing kylie jenner, Royal Court\n\nHelen Murray\n\nWhat inspired you to write seven methods of killing kylie jenner?\n\nTo be honest, all of the young black womxn I’ve grown up with. I was really fascinated by the spaces black womxn of my generation have carved out and curated on social media and how we have used the tangled web of the internet to create platforms to amplify our voices. Those two things combined made me want to write something with the onus on black womxn - particularly black womxn who are prominent on social media. Having the opportunity to hold up a mirror to their lives as a dramatist and, in doing so, pay homage to them has been a tremendous privilege.\n\nWhat’s your best memory from the production at the Royal Court?\n\nThere are too many to pick from! What I remember distinctly is the sensation of relief - I went from a very intense, stressful period being at drama school and trying to stay up at night and write the play, to the warmth, calm and unity of our rehearsal room: it felt like stepping into heaven! There was a lot of laughter - it’s a very silly play so Milli Bhatia (the director) did an amazing job of making sure we had lots of space to be silly in rehearsal. If I were to pick one memory from the production that was significant it would probably be when the young womxn from Treasure Tress’ Teen Experience came to watch the play - talking to them after and hearing how boldly they lived in their truths moved me to tears. Treasure Tress are such an incredible organisation that offers spaces for young black womxn to congregate and communicate - everyone spread the word about them!\n\nWho are your biggest influences and inspirations?\n\nI have loads! I love the African-American artist Carrie Mae Weems - the political act of her placing her body in her art has really influenced my practice as an artist - I always like to place myself in my work in some way or another. In terms of people in my medium I have to say Michaela Coel, Phoebe Waller-Bridge and debbie tucker green - they all have incredible voices and talents whilst simultaneously having massive artistic integrity and not compromising their visions or instincts. My parents put me on to a lot of fantastic irreverent comedy from the 80’s when I was younger like The Real McCoy and Oliver at Large, the latter of which starred Jamaican comic genius Oliver Samuels. Both of those shows’ ingenuity and bravery has profoundly influenced the way I view humour and risk-taking as an actor and writer.\n\nWhat’s the best thing you’ve seen this year?\n\nThis is cheating slightly because it’s not theatre but let’s just say I don’t believe in the hierarchy of mediums! I think the thing that’s moved me the most this year is Rocks at London Film Festival. It is a beautiful, beautiful film about coming-of-age and it’s the first time I’ve seen a young British Black woman of secondary school age represented authentically on the big screen. The film brought out raw, truthful performances from a cast of generous actors. What a feat! I think all creators should aim to achieve that level of authenticity and genuine ensemble in their work.\n\nWhat would you like to write about next?\n\nThe next thing I write will be for myself to perform in. I’m in the process of researching, writing and developing stories that I feel connected to as both an actor and a writer. Speaking more generally, I’m keen to keep telling stories with black womxn as the protagonists and not necessarily in the ways we have been represented previously. While the confluence of our race and gender identity are factors in our lives and there should be space where those two factors are the centralised themes, I’m really interested in telling stories where our race and gender identities are leitmotifs and our images and experiences can exist as the default. I feel like a lot of the time, even when I see us depicted on stage or on screen, we are still being othered because the centrality of whiteness and maleness is still being implied in the work. I want to use my voice to counter that.\n\n(Editor's note: The term 'womxn' is used as alternative word for 'woman' or 'women' to explicitly include transgender women and women of colour)\n\nRoss Willis\n\nWolfie, Theatre503\n\nHelen Murray\n\nWhat inspired you to write Wolfie?\n\nI wanted to write about how life during and after the care system feels. How it affects your sense of self at your very core and how those feelings of loneliness and isolation affect your transition into adulthood. Formally I didn’t want Wolfie to feel domestic because I think there’s nothing domestic about the care system at all.\n\nWhat’s your best memory from the production at the Theatre503?\n\nI think anyone who watched the play on its own terms and just took it for what it was trying to do. Sometimes I find as an audience member it’s a surprisingly hard thing to do.\n\nWho are your biggest influences and inspirations?\n\nDennis Kelly, Lisa Spirling, Lucy Morrison, Yasmin Joseph and Jules Haworth.\n\nWhat’s the best thing you’ve seen this year?\n\nTristan Fynn-Aiduenu’s production of Little Baby Jesus. It was a big f*** off maelstrom of electricity and fire which you felt in your bones. I hadn’t seen a director create something like that in a long time. He filled every moment with a sense of wit and play. His energy as an artist is incredible. I’m obsessed.\n\nWhat would you like to write about next?\n\nI’m writing a play about queer history told through the eyes of STIs. Something which feels like Greek theatre featuring old beasts, myth, monsters and magic.\n\nThe 65th Evening Standard Theatre Awards, in association with Michael Kors, take place on November 24. standard.co.uk/theatreawards #ESTheatreAwards"}, {"url": "https://www.vogue.com/slideshow/inside-the-2019-evening-standard-awards", "page_content": "If all the world’s a stage, does the reverse apply? In the traditionally exclusive milieu of London theater—for decades overwhelmingly privileged and white—what audiences see on the stage has not always fully reflected the world beyond it. At last night’s Evening Standard Theatre Awards, however, an eclectic and diverse audience saw a cast of presenters, nominees, and winners who together comprised an ensemble emblematic of progress, positivity, and pluralism.\n\nLondon is (arguably) the greatest theater capital of all, in terms of both depth of history and consistency in innovation. Yet at last night’s awards, cohosted by E.S. proprietor Evgeny Lebedev and Anna Wintour, one of the most rapturously applauded winners was a Brooklyn import. Double Pulitzer winner Lynn Nottage added the Chanel-sponsored Evening Standard best-play award to her roster of accolades thanks to the Lynette Linton–directed Donmar Warehouse production of Sweat. Accepting her award from Olivia Colman, Nottage said, “This is such a glorious moment for me. Because I remember coming to London when I was 20 years old because I wanted to be a theater artist, and I survived on ramen bowls and porridge and I didn’t starve to death. So to all of you up there…” At this point, wild cheering washed over Nottage’s salute. Its source was the hundreds of drama students who filled the dress circle, upper circle, and balcony of the Coliseum, and who injected wave after wave of raw enthusiasm into the evening.\n\nFrom the start, master of ceremonies Cush Jumbo had us laughing, but also made a serious point when she observed that last night she became the first person of color to host these awards in its 64-year history. More positively, presenting the Charles Wintour Award for most-promising playwright, the super-producer Sonia Friedman noted, “In [the last] 10 years, nine women have won this award.” The run continued when Friedman announced Jasmine Lee-Jones as this year’s winner for her produced play Seven Methods of Killing Kylie Jenner. Accepting her award, Lee-Jones paid tribute to Lorraine Hansberry and added, “I think plays should be dangerous…I want to urge the audience…to allow artists to be dangerous. Especially those who have existed, like myself, outside the definitions of normality…Seriously, I didn’t think [my play] was going to happen. If I’d walked into most theaters to say I wanted to write a play about two black women, half on the internet, half in real-life, with warring identities, speaking deep South London slang, most people would have laughed in my face.” Happily, she added, the Royal Court Theatre’s artistic director, Vicky Featherstone, embraced her pitch with gusto."}, {"url": "https://www.standard.co.uk/culture/theatre/evening-standard-theatre-awards-winners-2019-a4294246.html", "page_content": "T he winners of the 65th Evening Standard Theatre Awards have been announced, with Maggie Smith and Andrew Scott given the top acting prizes.\n\nScott was awarded for his role in Noel Coward’s Present Laughter at the Old Vic, while Smith took the trophy for one-woman play A German Life at the Bridge. Lynn Nottage’s Sweat was named Best Play, following a successful run at the Donmar and in the West End.\n\nThe star-studded ceremony, co-hosted by Damian Lewis, Helen McCrory, Evgeny Lebedev and Anna Wintour, took place at the London Coliseum, with The Good Fight actress Cush Jumbo as the evening’s presenter.\n\nScott was presented with the Best Actor Award, in partnership with Ambassador Theatre Group, by His Dark Materials star Ruth Wilson. His “glorious” performance saw him beat Tom Hiddleston, K. Todd Freeman, Francis Guinan and Wendell Pierce.\n\n65th Evening Standard Theatre Awards 2019: Winners - In pictures 1 / 36 65th Evening Standard Theatre Awards 2019: Winners - In pictures Ruth Wilson and Andrew Scott, winner of Best Actor Award in partnership with Ambassador Theatre Group for Present Laughter pose in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Leanne Best, Martha Plimpton, Lynn Nottage, Clare Perkins, winners of Best Play Award in partnership with Chanel for 'Sweat' presented by Olivia Colman pose in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Anne-Marie Duff, winner of Best Musical Performance for 'Sweet Charity' presented by Lashana Lynch pose in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Michael Kors, Bunny Christie, winner of Best Design in partnership with Michael Kors for 'A Midsummer Nights Dream' and Gugu Mbatha-Raw pose in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Andrew Scott, winner of Best Actor Award in partnership with Ambassador Theatre Group Dave Benett Ruth Wilson and Andrew Scott, winner of Best Actor Award in partnership with Ambassador Theatre Group Dave Benett Dame Maggie Smith, winner of Natasha Richardson Award for Best Actress Award in partnership with Christian Louboutin for 'A German Life' poses in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Jasmine Lee-Jones, winner of Charles Wintour Award for most promising playright for seven methods of killing kylie jenner poses in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Helen McCrory and Damian Lewis pose in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Sir Ian McKellen, winner of the Editors Award poses in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Sir Ian McKellen, winner of the Editors Award Dave Benett Bunny Christie, winner of Best Design in partnership with Michael Kors for 'A Midsummer Nights Dream' poses in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Naomi Scott and Laurie Kynaston, winner of Emerging Talent Award in partnership with Access Entertainment for 'The Son' pose in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Taron Egerton and Jamie Lloyd, collects award for Best Musical 'Evita' Regents Park Open Air Theatre pose in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Lynn Nottage, winner of Best Play Award in partnership with Chanel for 'Sweat' presented by Olivia Colman pose in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Anne-Marie Duff poses in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Glenda Jackson and Irina Brook, on behalf of Peter Brook, winner of Lebedev Award for contribution to theatre award pose in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Robert Icke, winner of the Milton Shulman Award for Best Director for 'The Doctor' and Helen McCrory pose in the winners room at the 65th Evening Standard Theatre Awards Dave Benett Dame Maggie Smith, winner of Natasha Richardson Award for Best Actress Award Dave Benett Helen McCrory and Andrew Scott Dave Benett Sir Ian McKellen, winner of the Editors Award Dave Benett Anne-Marie Duff, winner of Best Musical Performance for 'Sweet Charity' Dave Benett Bunny Christie, accepting the Best Design award in partnership with Michael Kors Dave Benett Jamie Lloyd, winner of the award for Best Musical 'Evita' Regents Park Open Air Theatre Dave Benett Taron Egerton presents an award to Jamie Lloyd, winner of the award for Best Musical 'Evita' Regents Park Open Air Theatre Dave Benett Dame Maggie Smith, winner of Natasha Richardson Award for Best Actress Award Dame Maggie Smith, winner of Natasha Richardson Award for Best Actress Award in partnership with Christian Louboutin for 'A German Life', attends the 65th Evening Standard Theatre Awards Dave Benett\n\nDamian Lewis presented Smith with the Natasha Richardson Award for Best Actress in partnership with Christian Louboutin for her “triumphant” performance in A German Life. She was up against Hayley Atwell, Cecilia Noble, Juliet Stevenson and Anjana Vasan.\n\nThe Regent’s Park Open Air Theatre revival of Andrew Lloyd Webber and Tim Rice’s musical Evita took home the gong for Best Musical, presented by Rocketman star Taron Egerton, and Anne-Marie Duff won the award for Best Musical Performance for her turn in Sweet Charity at the Donmar Warehouse.\n\nTwo awards celebrated new talent. The Charles Wintour Award for Most Promising Playwright was given to Jasmine Lee-Jones for seven methods of killing kylie jenner, which ran at the Royal Court in the summer. Laurie Kynaston won the Emerging Talent Award in partnership with Access Entertainment, for his part in The Son.\n\nAndrew Scott, Best Actor | Evening Standard Theatre Awards 2019\n\nMichael Kors and Gugu Mbatha-Raw presented the award for Best Design, in partnership with Michael Kors, to Bunny Christie for her work on the Bridge Theatre’s promenade production of A Midsummer Night’s Dream.\n\nSir Trevor Nunn presented Ian McKellen with the Editor’s Award for his On Stage tour, while director Peter Brook was honoured for his contribution to British theatre with the Lebedev Award, given to his daughter Irina Brook by Glenda Jackson.\n\nJumbo opened the ceremony with ten Brit School students in a rendition of Windy City, which also featured some performances from two of the West End’s brand new musicals.\n\nDear Evan Hansen’s star Sam Tutty sang Waving Through A Window, while Miriam-Teak Lee and the cast of & Juliet performed Roar.\n\n65th Evening Standard Theatre Awards 2019: Red Carpet - In pictures 1 / 84 65th Evening Standard Theatre Awards 2019: Red Carpet - In pictures Cush Jumbo PA Cherrelle Skeete and Shiloh Coke Dave Benett Poppy Delevingne Getty Images Christopher Kane and Tammy Kane PA Ellie Bamber PA Andrew Scott arrives in an Audi, the Official Car Partner of the Evening Standard Theatre Awards Dave Benett Ruth Wilson arrives in an Audi, the Official Car Partner of the Evening Standard Theatre Awards Dave Benett Florence Welch Getty Images Damian Lewis and Helen McCrory Dave Benett Naomi Scott PA Miriam-Teak Lee PA Poppy Delevingne and James Cook Dave Benett Laura Carmichael Dave Benett Anne-Marie Duff Getty Images Sean Mathias and Sir Ian McKellen Getty Images Ella Balinska Dave Benett Dame Maggie Smith PA Immy Waterhouse Getty Images Edward Enninful PA Bee Shaffer PA Sope Dirisu, Sharon D. Clarke and Wendell Pierce Getty Images Ellie Bamber arrives in an Audi, the Official Car Partner of the Evening Standard Theatre Awards Dave Benett Jasmine Lee-Jones Dave Benett Juliet Stevenson PA Hayley Atwell arrives in an Audi, the Official Car Partner of the Evening Standard Theatre Awards Dave Benett Arthur Darvill PA Elena Perminova Getty Images Gugu Mbatha-Raw Getty Images Andrew Scott Getty Images Joely Richardson Getty Images Sam Tutty PA Jourdan Dunn Getty Images Poppy Jamie Dave Benett/Getty Images Amuka-Bird Getty Images Lady Emma Weymouth Dave Benett Grayson Perry and Philippa Perry Dave Benett Stefanie Martini Getty Images Jamie Lloyd Getty Images Ophelia Lovibond PA Sian Clifford Getty Images Yasmin Joseph Dave Benett Martha Plimpton PA Douglas Booth PA Lionel Larner and Glenda Jackson Dave Benett Tom Scutt Dave Benett Cush Jumbo Getty Images Jack Guinness PA Anne-Marie Duff arrives in an Audi, the Official Car Partner of the Evening Standard Theatre Awards Dave Benett Laurie Kynaston PA Frances Barber PA Lucy Moss and Toby Marlow PA Arlene Phillips Getty Images Cecilia Noble Getty Images Susan Wokoma Getty Images Layton Williams Getty Images Louise Delamere and Stephen Mangan Getty Images Betty Bachz Dave Benett Phoebe Fox and guest Dave Benett Sally Scott and Bertie Carvel Dave Benett Sophia Brown Dave Benett Emily Candy and Christian Candy Dave Benett Gala Gordon Dave Benett Roksanda Ilini and Lauren Cuthbertson Dave Benett\n\nEvening Standard Theatre Awards 2019: The winners in full\n\nBest Actor, in partnership with Ambassador Theatre Group\n\nAndrew Scott Present Laughter (Old Vic)\n\nNatasha Richardson Award for Best Actress, in partnership with Christian Louboutin\n\nDame Maggie Smith A German Life (Bridge Theatre)\n\nBest Play, in partnership with Chanel\n\nSweat by Lynn Nottage (Donmar Warehouse & Gielgud Theatre)\n\nMilton Shulman Award for Best Director\n\nRobert Icke The Doctor & The Wild Duck (Almeida Theatre)\n\nBest Musical\n\nEvita (Regent’s Park Open Air Theatre)\n\nBest Musical Performance\n\nAnne-Marie Duff Sweet Charity (Donmar Warehouse)\n\nBest Design, in partnership with Michael Kors\n\nBunny Christie A Midsummer Night’s Dream (Bridge Theatre)\n\nCharles Wintour Award for Most Promising Playwright\n\nJasmine Lee-Jones seven methods of killing kylie jennner (Royal Court)\n\nEmerging Talent Award, in partnership with Access Entertainment\n\nLaurie Kynaston The Son (Kiln Theatre & Duke of York’s)\n\nEditor’s Award\n\nSir Ian McKellen For his “On Stage” tour\n\nLebedev Award\n\nPeter Brook For his contribution to theatre\n\nThe 65th Evening Standard Theatre Awards, in association with Michael Kors, took place on November 24 standard.co.uk/theatreawards #ESTheatreAwards​"}, {"url": "https://www.standard.co.uk/news/london/jodie-comer-james-mcavoy-winners-evening-standard-theatre-awards-2022-b1046245.html", "page_content": "J odie Comer and James McAvoy took home the top acting prizes at the 2022 Evening Standard Theatre Awards.\n\nThe winners at the event celebrating the best of London theatre, in association with Garrard, were revealed at a dinner on Sunday evening at The Ivy in the West End.\n\nThe awards were hosted by Evening Standard proprietor Lord Lebedev with actress Sheridan Smith compering the ceremony.\n\nComer was awarded the Natasha Richardson Award for Best Actress for her West End debut in Prima Facie. It was presented to the Killing Eve star by her close friend and mentor Stephen Graham.\n\nMcAvoy won the Best Actor award for his performance in Cyrano de Bergerac. The His Dark Materials star was unable to attend the event, so compere Smith picked up the award on his behalf.\n\nPlay of the Year was awarded to Best of Enemies, James Graham’s fictionalised retelling of the 1968 US political TV debates between William F Buckley and Gore Vidal. Stars Zachary Quinto and David Harewood joined Graham in accepting the award.\n\nPearl Cleage’s Blues For An Alabama Sky won Lynette Linton the Milton Shulman Award for Best Director, presented by Josie Rourke and Martha Plimpton. Nica Burns, co-owner of the Nimax Theatres group, accepted a Special Award in recognition of her support of London theatre during the pandemic.\n\nOne of the first producers to reopen playhouses in a time of critical uncertainty, Burns also launched @sohoplace, the West End’s first new purpose-built theatre in 50 years this summer.\n\nThe Winners Best Actor James McAvoy, Cyrano de Bergerac Natasha Richardson Award for Best Actress Jodie Comer, Prima Facie Best Play Best of Enemies by James Graham Milton Shulman Award for Best Director Lynette Linton, Blues for an Alabama Sky Best Musical Oklahoma! Best Musical Performance Patrick Vaill, Oklahoma! Best Design Tom Scutt, Cabaret at the Kit Kat Club Charles Wintour Award for Most Promising Playwright Tyrell Williams, Red Pitch Emerging Talent Award Isobel McArthur, Pride & Prejudice* (*sort of) Special Awards Nica Burns and Dame Vanessa Redgrave for their outstanding contribution to London theatre\n\nThe second Special Award of the evening went to stage legend Dame Vanessa Redgrave, one of the strongest campaigners for financial support to the arts during lockdown.\n\nTom Scutt was awarded Best Design for his inventive Cabaret set at the Playhouse Theatre, while Isobel McArthur was presented with the Emerging Talent Award for Pride & Prejudice*(*sort of), her pop music-inspired adaptation of Jane Austen’s classic novel.\n\nRed Pitch, a coming-of-age story about gentrification and community, earned Tyrell Williams the Charles Wintour Award for Most Promising Playwright.\n\nThe award comes with a generous donation from Dame Anna Wintour, editor-in-chief of American Vogue, artistic director and global content adviser of Condé Nast.\n\nLord Lebedev said: “I am delighted to celebrate the best of London theatre together with the talented writers, actors, directors and producers who brought the West End back to life.\n\n“I am also glad to rekindle one of the paper’s greatest traditions, one I have sorely missed these past pandemic years.”\n\nThe awards, which considered productions on the London stage between May 20 last year and October 13 this year, were the first held since 2019 due to the pandemic."}, {"url": "https://www.standard.co.uk/culture/theatre/evening-standard-theatre-awards-who-won-and-why-a3120701.html", "page_content": "Natasha Richardson Award for Best Actress\n\nNicole Kidman in Photograph 51\n\nNicole Kidman captured the brilliant though often irascible nature of molecular biologist Rosalind Franklin, who was one of the pioneers in decoding the structure of DNA. In Anna Ziegler’s new play, Photograph 51, directed by Michael Grandage at the Noël Coward Theatre, Franklin was depicted as a woman who prided herself on always being right, her task made all the more difficult at being belittled by male colleagues and rivals who were for the most part arrogant and misogynistic.\n\nKidman’s portrayal was without vanity or sentimentality, striding on stage in a white lab coat and brown lace-up shoes with sensible soles. Yet there was a glow behind her eyes when Franklin was getting close to discovering the secret of life.\n\nSeventeen years after she last appeared on the London stage, Kidman gave life and luminosity to a woman who had been overlooked by history.\n\nBaz Bamigboye\n\nBest Actor\n\nA virtuoso performance: James McAvoy in The Ruling Class Johan Persson / Johan Persson\n\nJames McAvoy in The Ruling Class\n\nWatching James McAvoy in The Ruling Class by Peter Barnes is rather like watching Liszt. It is a virtuoso performance. McAvoy plays a paranoid schizophrenic who thinks he is Jesus. He is both charming and alarming and his responses are quicksilver. As one of the judges put it: some of the great actors in this category were within their comfort range — McAvoy far exceeded his. This satire on the Establishment, exuberantly directed by Jamie Lloyd at Trafalgar Studios, with an unforgettable chorus of the Eton Boating Song, could be music hall, but McAvoy infuses it with Hamlet.\n\nSarah Sands\n\nBest Play\n\nMorally charged and ultimately hopeful: The Motherf**ker With the Hat Mark Douet / Mark Douet\n\nThe Motherf**ker with the Hat by Stephen Adly Guirgis\n\nThe title of Stephen Adly Guirgis’s play has provoked plenty of discussion. But those two coy asterisks can’t conceal the rowdy vitality of this New York story of poor judgments and blistering insults. Guirgis focuses on the struggles of Jackie, a former drug dealer just out of prison and trying hard to get his life back on track. The profound flaws of everyone he knows combine to make this a challenging process.\n\nGuirgis’s writing has a lovely vibrancy, and he has serious things to say about infidelity, honour, friendship and addiction. In Indhu Rubasingham’s impressive production at the National Theatre, this expletive-laden drama proved touching, morally charged and ultimately hopeful.\n\nHenry Hitchings\n\nBest Musical Performance\n\nMagnificently funny: Imelda Staunton Johan Persson / Johan Persson\n\nImelda Staunton in Gypsy\n\nImelda Staunton’s Olivier-winning Sondheim triumph was as Mrs Lovett in Sweeney Todd in 2013. But this tops it. She hurtles at Mama Rose’s crazed stage ambition for her children — furious, flirtatious, filling the Savoy’s stage as if she was standing a foot in front of each of us, bending us to her will. She is magnificently funny at times, from the first eruption through the stalls clutching a lapdog, yet beneath the fizzing energy her consummate acting reveals Rose’s vulnerability, envy, frustration and fear. Her stillness as she reads the letter telling her that Baby June has escaped her grip makes us hold our breath: when, like a heat-seeking missile, she turns to her dowdier daughter, crying, “I made her — I will make you!”, audiences audibly squeak with shock. It’s a King Lear for musical actresses: nobody has done it better.\n\nLibby Purves\n\nHighlights from the ES Theatre Awards 2015\n\nEditor’s Award in Partnership with The Ivy\n\nWinner: Vanessa Redgrave, who won Editor's Award in partnership with The Ivy with presenters Joely Richardson (L) and Ralph Fiennes Dave Benett / Dave Benett\n\nVanessa Redgrave\n\nIn a career spanning almost 60 years, Vanessa Redgrave has always been a fearless and passionate performer. She has proved an energetic Shakespearean, a mesmerising star of Ibsen and Chekhov and an emotionally shattering interpreter of Eugene O’Neill, but has also injected playful humanity into more populist fare such as Driving Miss Daisy.\n\nOnstage, her style is fervently individual, and she has brought the same fiery urgency to her film roles and her work as a political campaigner. The result has been a remarkable haul of tributes, including an Oscar, a Tony, an Emmy, an Olivier and, with this year’s trophy, five Evening Standard Theatre Awards. Acting is in her blood, yet she manages to seem at once an essential part of theatre royalty and a genuine outsider.\n\nHenry Hitchings\n\nBest Design\n\nA complete understanding of the play’s tone: Anna Fleischle’s design for Hangmen Simon Annand​\n\nAnna Fleischle for Hangmen\n\nAnna Fleischle’s inventive design for Martin McDonagh’s Royal Court play about the last purveyors of capital punishment in Britain appropriately consisted of sets that were themselves measured for the drop, suddenly disappearing through a trapdoor to become somewhere else. The death-row cell of an English prison is instantly replaced by a period-perfect Lancashire pub in the Sixties, which, in turn, becomes the frame for a seaside café hanging at the top of the stage.\n\nFaced with the demanding brief of creating three very different and detailed locations, Fleischle produced visual coups while showing a complete understanding of the play’s tone of flamboyantly exaggerated realism.\n\nMark Lawson\n\nLebedev Award\n\nGenius: Stephen Sondheim Walter McBride/Getty Images / Walter McBride/Getty Images\n\nStephen Sondheim\n\nThis year alone we’ve been able to witness Stephen Sondheim’s genius in major productions of Sweeney Todd, Assassins and Gypsy. But any such sampling of his work fails to do justice to its variety. He is a witty and sophisticated lyricist who revels in subtext and irony. His scores are haunting and unpredictable, repeatedly challenging received ideas about the nature of musical theatre.\n\nA master craftsman who combines a talent for absorbingly dramatic songwriting with an appetite for grown-up ideas, he has won eight Grammy awards, eight Tony awards and even a Pulitzer Prize. To quote a popular joke: “Has anyone ever seen God and Stephen Sondheim in the same room?”\n\nHenry Hitchings\n\nEmerging Talent Award in Partnership with Burberry\n\nCrack comic timing: David Moorst Helen Maybanks / Helen Maybanks\n\nDavid Moorst for his performance in Violence and Son\n\nDavid Moorst made his stage debut at Hampstead Theatre last year in Wonderland, but it was as the teenage Liam in the Royal Court production of Gary Owen’s Violence and Son that the recent Lamda graduate made an enduring impression.\n\nA bow tie-wearer with a fondness for Doctor Who and an uncommon articulacy that acts as both refuge and downfall, Liam remains a richly drawn character, and Moorst brought to rending life the contradictions of a man-child alive to both language and wit but as yet untutored in romance and the hard realities of life with a drunken, often violent father who goes by the telling nickname “Vile”.\n\nBlessed with crack comic timing and the ability almost simultaneously to break your heart, Moorst’s career-making performance here put me in mind of a young Eddie Redmayne while signalling a singular talent.\n\nMatt Wolf\n\nBeyond Theatre\n\nDazzling: Alexander McQueen retrospective, Savage Beauty Anthony Harvey/Getty Images / Anthony Harvey/Getty Images\n\nAlexander McQueen: Savage Beauty\n\nAnna Wintour, of American Vogue, famously said that fashion is theatre. It was never truer than of Alexander McQueen. The retrospective exhibition of his work first shown in New York was more potently understood in its staging at the V&A. McQueen was a London boy. As the show’s curator, Professor Claire Wilcox, put it: “London was at the heart of McQueen’s world … his radical and fearless vision changed the way we look at fashion.” McQueen’s clothes became ever more recklessly dazzling and the designer’s suicide inevitable. It could not have lasted but what a show.\n\nSarah Sands\n\nThe Evening Standard Theatre Awards 2015 1 / 60 The Evening Standard Theatre Awards 2015 Nicole Kidman, winner of Best Actress for \"Photograph 51\" at The London Evening Standard Theatre Awards in partnership with The Ivy at The Old Vic Theatre Dave Benett James McAvoy, winner of Best Actor for \"The Ruling Class\", and Gillian Anderson pose in front of the Winners Boards at The London Evening Standard Theatre Awards Dave Benett Nicole Kidman kisses husband Keith Urban as she celebrates winning the Best Actress award for \"Photograph 51\" Dave Benett Imelda Staunton stumbles as she collects her award for Best Musical Performance presented by Dame Shirley Bassey Dave Benett Kelly Brook attends the Evening Standard Theatre Awards at The Old Vic WireImage Pixie Lott David Fisher/Rex Gemma Arterton winner of the Newcomer in a Musical award, poses with presenters Jeremy Irvine and Gemma Chan i Dave Benett Award winners Sam Gainsbury, Nicholas Coleridge, Sarah Burton, Indhu Rubasingham, Vanessa Redgrave, Killian Donnelly, Nicole Kidman, Amy Lennox, Stephen Sondheim, Imelda Staunton, Gemma Arterton, (front L-R) Robert Icke, David Moorst, James McAvoy, Matt Henry and Evgeny Lebedev, Owner of The London Evening Standard, pose onstage at The London Evening Standard Theatre Awards Dave Benett Rob Brydon and Gillian Anderson attend a champagne reception at The London Evening Standard Theatre Awards Dave Benett Best Actress winner Nicole Kidman (L) and Best Actor winner James McAvoy Dave Benett Gemma Arterton and Ruth Wilson attend The London Evening Standard Theatre Awards after party Dave Benett Vanessa Redgrave and Joely Richardson attend The London Evening Standard Theatre Awards after party Dave Benett Evgeny Lebedev, Owner of The London Evening Standard and Nicole Kidman Dave Benett Party girl: Pixie Lott attends The London Evening Standard Theatre Awards after party Dave Benett Gillian Anderson poses on the red carpet as she arrives to attend the 61st London Evening Standard Theatre Awards AFP/Getty Images Kate Beckinsale arrives at The London Evening Standard Theatre Awards Dave Benett Salma Hayek David Fisher/Rex Pretty in Pink: Gemma Arterton David Fisher/Rex Richard E. Grant and daughter Olivia Grant arrive at The London Evening Standard Theatre Awards in partnership with The Ivy at The Old Vic Theatre Dave Benett Suited and booted: Jeremy Irvine on the red carpet David Fisher/Rex Elegant: Joely Richardson arrives for the ceremony David Fisher/Rex Smiling stars: Meera Syal and Sanjeev Bhaskar on the red carpet David Fisher/Rex Keith Urban and Nicole Kidman arrive at The London Evening Standard Theatre Awards Dave Benett Ruth Wilson David Fisher/Rex Kelly Brook arrives at The London Evening Standard Theatre Awards Dave Benett Josie Rourke and Kate Pakenham arrive Dave Benett Michael Grandage and Christopher Oram Dave Benett Lenny Henry, Zoe Wanamaker and Gawn Grainger Thigh's the limit: Immy Waterhouse David Fisher/Rex Evgeny Lebedev, Owner of The London Evening Standard, Dame Judi Dench and Sir Ian McKellen arrive at The London Evening Standard Theatre Awards in partnership with The Ivy at The Old Vic Theatre Dave Benett Looking cool on the red carpet: Gemma Chan James McAvoy and Anne-Marie Duff sparkle at The London Evening Standard Theatre Awards Dave Benett Gugu Mbatha-Raw dresses to impress Dave Benett No jacket required?: Ralph Fiennes Dave Benett Dominic West and Catherine Fitzgerald pose for the cameras Dave Benett Diamonds are forever: Dame Shirley Bassey attends the Evening Standard Theatre Awards at The Old Vic Theatre Jeff Spicer/Getty Images Fashion sense: Anna Wintour attends the Evening Standard Theatre Awards at The Old Vic Theatre Karwai Tang/WireImage Jessica Brown Findlay arrives at The London Evening Standard Theatre Awards Dave Benett Rock styling: Brian May and Anita Dobson arrive at The London Evening Standard Theatre Awards Dave Benett Balletic moves: Isaac Hernandez and Tamara Rojo Dave Benett Emerging talent: David Moorst Dave Benett Imelda Staunton winner of the Best Musical Performance award with presenter Dame Shirley Bassey Dave Benett Vanessa Redgrave winner of the Editor's Award in partnership with The Ivy with presenters Joely Richardson (L) and Ralph Fiennes at The London Evening Standard Theatre Awards Dave Benett Dame Judi Dench, Stephen Sondheim, winner of the Lebedev Award, and Sir Ian McKellen Dave Benett Cast members Matt Henry, Amy Lennox and Killian Donnelly, accepting the Evening Standard Radio 2 Audience Award for Best Musical Newcomer In A Musical for \"Kinky Boots\", Dave Benett\n\nMilton Shulman Award for Best Director\n\nUnexpectedly thrilling: Oresteia Manuel Harlan\n\nRobert Icke for Oresteia\n\nThe Almeida’s Greek season has been one of this year’s abiding glories, not least its marathon, day-long readings of The Odyssey and, especially, The Iliad that continued well into the night. But no production was as unexpectedly thrilling as a new Oresteia from the director and adapter Robert Icke that transformed Aeschylus’s time-honoured theatrical triptych into a compulsive, deeply contemporary meditation on humankind’s ongoing thirst for retribution and vengeance.\n\nAn associate director at the Almeida, Icke saw his production transfer from Islington against the odds to an extended run in the West End — an unlikely destination on the face of it for a show running three-and-a-half hours. But time in the theatre is an ever-elastic entity, and rarely has an ostensibly long evening felt so sure-footed and fleet as a classic text leapt the centuries to reassert its bruising primacy entirely afresh.\n\nMatt Wolf\n\nCharles Wintour Award for Most Promising Playwright\n\nA sort of Lord of the Flies for the modern education system: Molly Davies's play God Bless the Child Manuel Harlan / Manuel Harlan\n\nMolly Davies for God Bless the Child\n\nA classroom of eight-year-olds is testing out, with possibly lucrative benefits to their school, a new government-approved teaching scheme, “Badger Do Best”, which aims to instil morality and discipline through fables about cartoon creatures. When one pupil leads a rebellion, the scheme’s creator arrives to help the head to restore the new order.\n\nIn God Bless the Child at the Royal Court, Molly Davies created, through an atmosphere of ominous comedy and sharp characterisation of children and adults, a sort of Lord of the Flies for the modern education system in a play that also has broader relevance to other professions and institutions in which questionable new methods have been imposed from top-down. Whereas some dramatists are most comfortable with either words or images, Davies can vividly do both.\n\nMark Lawson\n\nNewcomer in a Musical\n\nCompelling viewing: Gemma Arterton Manuel Harlan / Manuel Harlan\n\nGemma Arterton for Made in Dagenham\n\nIn the song-and-dance adaptation of the Brit flick about the machinists at the Ford car plant who became heroines of the 1968 fight for equal pay, Gemma Arterton was faced with a difficult job description: proving her musical credentials in a big-budget production at the Adelphi while playing a woman who, at the start, lacks charisma and confidence.\n\nBut as Rita O’Grady the actress succeeded in making a downtrodden wife and mother compelling viewing and listening before revealing the vocal and visual power of a full-blown diva in Rita’s transformation at the Trade Unions Congress into a housewife superstar. Arterton’s performance suggested that, like Sheridan Smith, she has the ability to take command of a stage whether speaking, singing or silently reacting.\n\nMark Lawson\n\nAnd your winner…\n\nEvening Standard Radio 2 Audience Award for Best Musical\n\nAudience favourite: Kinky Boots Matt Crocke / Matt Crocke\n\nKinky Boots\n\nWhere to see the winners\n\nGypsy is at the Savoy until Saturday and will be screened on BBC4 over the Christmas season. Hangmen is at Wyndham’s from Dec 1 to March 5, and Kinky Boots is at the Adelphi, booking to May 28.\n\nThe judges\n\nThis year’s advisory judging panel comprised Daily Mail columnist Baz Bamigboye; London Evening Standard chief theatre critic, Henry Hitchings; Guardian culture writer and broadcaster Mark Lawson; Libby Purves, Times columnist and broadcaster; and Matt Wolf, London theatre critic of the International New York Times; alongside the London Evening Standard’s editor, Sarah Sands.\n\nFollow Going Out on Facebook and on Twitter @ESgoingout"}, {"url": "https://www.eoas.ubc.ca/news-events/news/1648537200", "page_content": "The Department is pleased to announce that Professor Catherine Johnson has been awarded the Killam Research Prize, an award which recognizes the outstanding research contributions of faculty from across all disciplines. Prize recipients are celebrated for creating and disseminating knowledge that has a global impact.\n\nDr. Johnson’s work is more than global, and focuses on the history and evolution of terrestrial planets – namely, Mercury, Mars and Venus. She uses remotely-sensed geophysical data to better understand the history and evolution of terrestrial planets, and has worked on several NASA planetary missions, including the Mars InSight mission and the Mercury MESSENGER mission. Her current work aims to understand the magnetic fields of Mercury and Mars, including when and why they formed, their current state, and how the fields interact with the solar wind. “A huge unknown” she explains, “is the level to which magnetic fields protect a planet’s atmosphere from space weather”, a question with implications for human space exploration and habitability in this solar system and beyond.\n\nHer work also focuses on planetary evolution and internal structure, and what that means for current planetary seismic and volcanic activity. Dr. Johnson works with a wide range of remotely sensed data, including altimetry, radar and gravity measurements. Data is collected by lightweight, low-power, instruments specifically designed to resist the challenges of operating in space.\n\n“You’re required to be very creative, in a responsible way” she says of the intrinsic limitations on data quality and availability. Leaps and bounds in instrument technology between missions means that new data can improve on in resolution by an order of magnitude or more, revealing in detail features that may have previously taken up only a handful of pixels. “I love it; with each new mission to a planet or moon or asteroid you almost always see something unexpected.”\n\nLooking forward, Professor Johnson is excited for multiple upcoming missions to Venus which will collect data on the composition and structure of the planet’s atmosphere and surface. She plans to answer questions about Venus’ suspected volcanic and tectonic activity using data previously shrouded from view by the planet’s thick, toxic atmosphere. “Venus was my first planet” she says, referring to the geophysical work she did on the planet during her PhD and postdoctoral studies. “It is so different from the Earth in so many ways, but would look equally habitable to our planet from a galaxy away – why is that?”\n\nThough not directly involved in the upcoming missions, Dr. Johnson will have access to the resulting publicly available data. With datasets so sparse and expensive to obtain, collaboration is a driving force in propelling the field of planetary science forward. She stresses the key role it has played in her research group’s success: “this award is an honour, and it’s not about me; its about the people who I’ve had the privilege to work and collaborate with.”\n\nProfessor Johnson (2nd from right) and recent research group members Megan Russell, Anna Mittelholz, Anna Grau, and Georgia Peterson at the Lunar and Planetary Sciences Conference"}, {"url": "https://finboroughtheatre.co.uk/production/the-catherine-johnson-award-for-best-play-2007/", "page_content": "The Pearson Playwrights’ Scheme is delighted to announce the winner of the first Catherine Johnson Award for Best Play 2007. He is James Graham whose play Eden’s Empire was written whilst attached to the Finborough Theatre.\n\nThe Pearson Playwrights’ Scheme, formerly known as the Thames Television Theatre Writers’ Scheme, is one of the most prestigious awards for new writing in British theatre. It awards up to five bursaries a year, each worth £7,000, to writers of outstanding promise and allows the playwright a twelve-month attachment to a theatre and commissions the writers for a new play. Recipients of the bursaries for 2008 will be announced later this month.\n\nThe Scheme also offers an award for the Best Play written by the five bursary winners from the previous year. This new award, worth £10,000, has been generously donated by Catherine Johnson, a graduate of the Scheme and herself the winner of the Best Play written in 1991. Catherine, who is a member of the judging panel for new bursaries and author of Mamma Mia, has been looking for a way to give something back to the Scheme which helped and encouraged her in the early days of her career.\n\nJudges of the Pearson Award include Sir John Mortimer CBE QC, Dame Beryl Bainbridge, Catherine Johnson, Sue Summers, Thelma Holt CBE, Michael Billington, John Tydeman OBE and Jack Andrews MBE.\n\nPrevious recipients of the Pearson bursary over the last thirty years include Richard Bean, Alan Bleasdale, Gregory Burke, David Edgar, David Eldridge, Lee Hall, Jacqueline Holborough, Catherine Johnson, Charlotte Jones, Fin Kennedy, Hanif Kureshi, Nick Leather, Martin McDonagh, Gary Mitchell, Chloe Moss, Gary Owen, Joe Penhall, Winsome Pinnock, Billy Roche, Simon Stephens, Sue Townsend and Timberlake Wertenbaker.\n\nPrevious winners for the Pearson Award for the Finborough Theatre include Chris Lee in 2000, Laura Wade in 2005 for Colder Than Here which also won the Pearson Award for the Best Play, James Graham in 2006 and Al Smith in 2007. For three years running, the Finborough Theatre has been the only unfunded theatre to win a Pearson Bursary.\n\nJames Graham is Playwright-in-Residence at the Finborough Theatre. He has written three plays – commissioned by Artistic Director Neil McPherson for the Finborough Theatre – Albert’s Boy (2005), starring Victor Spinetti, which earned James a prestigious Pearson Award bursary, Eden’s Empire (2006) and Little Madam (2007). James was the Finborough Theatre’s nomination to the BBC and Royal Court’s programme for young writers, ‘The 50’, celebrating the Royal Court’s 50th anniversary. His original television comedy-drama, Caught in a Trap has been commissioned by producers Greenlit.\n\nand…\n\nWinner – The George Devine Award for Playwright-in-Residence and former Literary Manager Alexandra Wood 2007\n\nWinner – The Pearson Award bursary for Playwright-in-Residence Al Smith 2007\n\nShortlisted for The Empty Space Peter Brook Award for Studio Theatres, and The Empty Space Peter Brook Mark Marvin Award."}, {"url": "https://www.standard.co.uk/culture/theatre/london-evening-standard-theatre-awards-2014-shortlist-announced-9864526.html", "page_content": "S EE THE LIST OF WINNERS\n\nKristin Scott Thomas, Gillian Anderson, Billie Piper and Tom Hiddleston are among the stars who will vie for honours at the 60th London Evening Standard Theatre Awards.\n\nThe ceremony, to be presented by Steve Coogan and Rob Brydon at the London Palladium, will see some of the biggest names in Britain battle it out with newcomers and other unsung heroes and heroines of the stage.\n\nHeadline-grabbing performances by Scott Thomas in Electra and Piper in Richard Bean’s hacking scandal drama, Great Britain, are joined by Helen McCrory in Medea and Gillian Anderson in A Streetcar Named Desire for the coveted best actress award.\n\nBut performances in newer and smaller venues are not overlooked as the big names are joined by Tanya Moodie for Lynn Nottage’s Intimate Apparel — which is also in the running for the Nook award for best play — at the Park Theatre in Finsbury Park.\n\nHiddleston, who swapped comic hero fame in Thor for Shakespeare’s Coriolanus, faces competition for best actor from Ben Miles as Thomas Cromwell in the epic double bill of Tudor life, Wolf Hall and Bring Up The Bodies, and Mark Strong, whose portrayal of Eddie Carbone in Arthur Miller’s A View From The Bridge at the Young Vic is being reprised in the West End next year.\n\nDogfight, from the Southwark Playhouse hit factory, is in the running for best musical against Here Lies Love, by David Byrne, Sunny Afternoon, based on the songs of The Kinks, and The Scottsboro Boys, the daring show inspired by a miscarriage of justice.\n\nDogfight’s star, Laura Jane Matthewson, and John Dagleish, who plays Kinks founder Ray Davies in Sunny Afternoon, are contenders for the emerging talent award, presented in partnership with Burberry. The other nominees are Robert Hastie, director of My Night With Reg, and Matthew Beard, who appeared in Skylight with Stephen Daldry, who is up for best director.\n\nThe best play category includes two royal epics, The James Plays trilogy and King Charles III, alongside one of the year’s most disturbing productions in Jennifer Haley’s dystopian drama exploring paedophilia, The Nether, a Royal Court production also getting a commercial transfer.\n\nThere will be four further Evening Standard awards on the night. Evgeny Lebedev, owner of the Evening Standard, Anna Wintour, Condé Nast artistic director, and Christopher Bailey, Burberry chief creative and chief executive officer, will co-host the awards on November 30, with live coverage on the night at standard.co.uk/showbiz and full coverage in the paper the next day.\n\nThe Evening Standard’s Get Reading campaign partner NOOK is supporting the awards to underline the importance of literacy in developing the next generation of dramatic talent by sponsoring the NOOK Award for Best Play.\n\nThe shortlist\n\nBEST ACTOR\n\nTom Hiddleston, Coriolanus, Donmar Warehouse\n\nBen Miles, Wolf Hall and Bring Up The Bodies, RSC Swan and Aldwych\n\nMark Strong, A View From The Bridge, Young Vic\n\nNATASHA RICHARDSON AWARD FOR BEST ACTRESS\n\nGillian Anderson, A Streetcar Named Desire, Young Vic\n\nHelen McCrory, Medea, National Theatre’s Olivier\n\nTanya Moodie, Intimate Apparel, Ustinov Bath and Park Theatre\n\nBillie Piper, Great Britain, National Theatre’s Lyttelton\n\nKristin Scott Thomas, Electra, Old Vic\n\nNOOK AWARD FOR BEST PLAY\n\nIntimate Apparel, Lynn Nottage, Ustinov Bath and Park Theatre\n\nThe James Plays, Rona Munro, Edinburgh Festival Theatre and National Theatre’s Olivier\n\nKing Charles III, Mike Bartlett, Almeida and Wyndham’s\n\nThe Nether, Jennifer Haley, Royal Court\n\nMILTON SHULMAN AWARD FOR BEST DIRECTOR\n\nStephen Daldry, Skylight, Wyndham’s\n\nYaël Farber, The Crucible, Old Vic\n\nJeremy Herrin, Wolf Hall and Bring Up The Bodies, RSC Swan and Aldwych\n\nIvo van Hove, A View From The Bridge, Young Vic\n\nCHARLES WINTOUR AWARD FOR MOST PROMISING PLAYWRIGHT\n\nBarney Norris, Visitors, Arcola\n\nDan O’Brien, The Body Of An American, Northampton Royal & Derngate and Gate Notting Hill\n\nBeth Steel, Wonderland, Hampstead\n\nNED SHERRIN AWARD FOR BEST MUSICAL\n\nDogfight, Southwark Playhouse\n\nHere Lies Love, National Theatre’s Dorfman\n\nThe Scottsboro Boys, Young Vic and Garrick\n\nSunny Afternoon, Hampstead and Harold Pinter Theatre\n\nBEST DESIGN, IN PARTNERSHIP WITH HEAL’S\n\nBunny Christie, Emil And The Detectives, National Theatre’s Olivier\n\nEs Devlin, American Psycho, Almeida\n\nMark Henderson, (lighting), Kate Bush’s Before The Dawn, Eventim Apollo\n\nAshley Martin-Davis, Wonderland, Hampstead\n\nEMERGING TALENT AWARD, IN PARTNERSHIP WITH BURBERRY\n\nMatthew Beard for his performance in Skylight, Wyndham’s\n\nJohn Dagleish for his performance in Sunny Afternoon, Hampstead and Harold Pinter Theatre\n\nRobert Hastie for his direction of My Night With Reg, Donmar Warehouse\n\nLaura Jane Matthewson for her performance in Dogfight, Southwark Playhousestandard.co.uk/showbiz"}, {"url": "https://www.bbc.co.uk/mediacentre/latestnews/2015/last-hours-of-laura-k", "page_content": "The project [...] challenges the traditional conventions of storytelling, and questions how we live our lives now. — Kate Rowland, Creative Director, BBC Writersroom\n\nThe Last Hours of Laura K is a ground-breaking digital experience placing the audience at the heart of the story. Using 24 hours of footage from the fictional surveillance programme SATURNEYE, this is a disconcertingly intimate, unfiltered and impartial look into Laura’s last hours before her death.\n\nThe 24-hour video file is only half of the story. To find the killer, users will have to immerse themselves in the characters’ digital lives via their Facebook, Twitter, and Instagram profiles, looking for clues and motives seeded by our writers over months to help them identify the killer.\n\nKate Rowland, BBC Writersroom Creative Director, says: \"The project inspired by the Edward Snowden quote, 'I don’t want to live in a world where everything that I say, everything I do, everyone I talk to, every expression of creativity, love or friendship, is recorded' challenges the traditional conventions of storytelling, and questions how we live our lives now.\"\n\nWith BBC development and support, this ambitious project has been a labour of love for the creative team behind it. The writers include Gabriel Bisset Smith, who also directs; Rachel Delahey, who plays Laura Kitchens; Kenny Emson; and Ed Sellek, working closely with producer Jon Davenport and Kate Rowland.\n\nThe Last Hours of Laura K will officially launch on 30 March. It’s on this day that Saturneye’s prototype media player is released to the world - it’s on this day the hunt for 23 year-old Laura’s killer truly begins.\n\nWith over 40 character profiles already live on social media, as well as an alternative newsblog SP117, the narrative threads are already there to be discovered. When and how the users consume and share the content is up to them.\n\nThe 24 hours of Laura’s life was filmed over an extraordinary 16 days across London, from the Southbank to St Martins at Kings Cross, from Farringdon to Dalston by a small, dedicated team working with a set of step ladders and a bag of Go pros.\n\n#LasthoursofLK\n\nBiographies\n\nGabriel Bisset-Smith\n\nGabriel Bisset-Smith is an award-winning writer/actor/director/comedian. As an actor, he has worked for the RSC, The Royal Court, Young Vic, Old Vic, The Bill. He's had plays produced at the Hampstead Theatre, York Theatre Royal and for BBC Radio Four. He's been on attachment at the Soho Theatre, the Royal Court and was a story contributor on the C4 series Skins. His short film Thrush won the Rushes Soho Shorts award, the 2010 Vimeo award and the Grand Jury Prize at the Disposable Film Festival. He has just been named one of Dazed & Confused magazines Dazed Visionaries. He is one half of comedy double act GUILT & SHAME who tour the country regularly to sold out shows. He has also been nominated for the Off West End Most Promising Playwright award and has three feature films in development.\n\nRachel De-lahay\n\nRachel’s most recent play CIRCLES (Birmingham Rep) has just been announced winner of the Catherine Johnson Award for Channel 4. Her last play ROUTES (Royal Court) earned her the Evening Standard Award for most promising playwright 2013, and THE WESTBRIDGE (Royal Court) won best play at the Writers Guild Awards, 2012. Last year Rachel was named Screen Star of Tomorrow by Screen Daily for her work on her feature PRETTY with Film Four.\n\nKenny Emson\n\nKenny Emson is an award-winning playwright who has written extensively for the stage. He was selected as part of the BBC Writersroom 10 and BBC Writers Academy in 2011 and has gone on to write episodes of Doctors and EastEnders. In 2013 he took part in the Kudos/Bush Initiative. He is currently developing original series ideas with BBC Wales and Company pictures, his first feature film ‘BAI’ with Creative England/BFI, and adapting ‘The Mr Quin Mysteries’ by Agatha Christie for Acorn Productions.\n\nEd Sellek\n\nEd Sellek has been writing for TV for some six years or so. He started out as a Storyliner on Hollyoaks, putting all his experience as a romantically inept misfit teenager to good use. As Senior Storyliner, he helped run a few of their big event weeks, including 'Who Shot Calvin?'. From there, he joined the Story Office on EastEnders. He lent a hand to killing Hev, and blowing up a B&B on Boxing Day. From EastEnders he finally graduated to script-writing, joining the daytime drama Doctors as one of their Core Writers in 2013. Somewhere in all this, he also managed to co-create and write 'Who Killed Laura Kitchens?'. He's currently on the Holby City Shadow Scheme and is writing his eighth episode of Doctors. He lives in Lewisham with his fat dog, Ripley.\n\nKate Rowland\n\nKate is the BBC’s Creative Director, New Writing. She founded the pioneering Writersroom, created R3's ground-breaking strand of new writing The Wire, where she first commissioned writers such as Dennis Kelly, Jack Thorne and Debbie Tucker Green and created the BBC's TV Drama Writer's Festival. Kate leads development from innovation lab to external partnerships. A multi-award-winning producer and director, she has been a champion of new voices with projects such as BBC Four’s Bollywood Shorts, Cineast and the Original Drama Shorts for BBC iPlayer. She has developed talent such as Lee Hall, Sarah Phelps and Stephen Butchard. Work developed through Writersroom includes In The Flesh, Wolfblood, Boy Meets Girl, and From Darkness. Kate was Head of Radio Drama, and won awards for her radical work with writers; previously she was a director at the Liverpool Everyman and Playhouse, Young Vic, Soho Theatres and was founder of Altered States Theatre Co. She is a school governor.\n\nJon Davenport\n\nJon is a BAFTA-nominated digital producer and exec with over 15 years' experience in the UK broadcasting industry. For seven years, Jon ran Hat Trick's award-winning Digital Department, devising and overseeing ground-breaking productions such as BBC Three's Bryony Makes A Zombie Movie, BBC Switch's Chartjackers, the Broadcast Digital Award-winning app for Channel 4's Facejacker, and Google Silver Medal Award-winning comedy YouTube channel Bad Teeth. Jon is now a freelancer working in the digital field for clients including IMG, Epic TV, Wall To Wall, and the BBC.\n\nCI2"}, {"url": "https://www.theguardian.com/stage/2011/nov/20/evening-standard-theatre-awards-frankenstein", "page_content": "After alternating playing Victor Frankenstein and the Creature for each performance of a three-month run at the National Theatre, Benedict Cumberbatch and Jonny Lee Miller have been rewarded jointly with the best actor prize at the UK's longest-running theatre awards.\n\nThe judges for the 2011 London Evening Standard awards said it would have been \"invidious not to recognise both actors\" for what were memorable performances in Frankenstein, the Danny Boyle-directed production.\n\nOne role involved two hours in makeup and getting naked on stage to play Frankenstein's creation; the other, that of the egomaniac scientist himself, did not.\n\nAlthough the awards have been running since 1955, Cumberbatch and Miller are among the few to share the best actor award, jointly following in some illustrious footsteps – the first recipient was Richard Burton for Henry V, followed by Paul Scofield, Laurence Olivier and Michael Redgrave. The duo won from a shortlist which also included Bertie Carvel for Matilda the Musical and Charles Edwards for Much Ado About Nothing at Shakespeare's Globe.\n\nThe ceremony at London's Savoy Hotel on Sunday night, hosted by Dame Edna Everage, proved a successful one for the National, which received the most nominations and some significant wins.\n\nThey included Mike Leigh, who was named best director for Grief, his heartbreaking 1950s story of unhappiness and loneliness which was staged in the Cottesloe, the National's smallest auditorium.\n\nRichard Bean won the award for best play for two plays: One Man, Two Guvnors which was a huge success at the National and is now playing in the West End ahead of a transfer to Broadway in the spring; and The Heretic, which explored climate change, at the Royal Court last February.\n\nSheridan Smith was named best actress for her hugely moving performance as a brassy ex-barmaid waiting for her Polish count husband to return from wartime pilot duties in Terence Rattigan's Flare Path, directed by Trevor Nunn at the Theatre Royal Haymarket. The award adds to the Olivier she won earlier this year for her lead performance in the musical Legally Blonde. Smith won from a strong shortlist that also included Samantha Spiro, for Chicken Soup with Barley at the Royal Court, and Kristin Scott Thomas, for Betrayal at the Comedy.\n\nThomas was able to take some consolation after being given the Lebedev special award named after the Standard's Russian chairman Evgeny Lebedev. Stephen Fry presented the award, given \"in recognition that her appearance immediately turns a production into an event\".\n\nThe Milton Shulman prize for most promising newcomer provided something of a domestic drama as the shortlist included husband and wife Kyle Soller and Phoebe Fox, who met at RADA.\n\nSoller, an American, pipped it, winning for three performances in The Faith Machine at the Royal Court and The Glass Menagerie and Government Inspector, both at the Young Vic.\n\nThe Charles Wintour award for most promising playwright was won by Penelope Skinner for her play The Village Bike at the Royal Court, which starred Romala Garai as Becky, a pregnant wife desperate for sex.\n\nIt has been a mixed year for musicals with one of the shortlisted productions, Betty Blue Eyes, forced to close early because it couldn't get big enough audiences. The list also included the National's London Road and the winner, the Royal Shakespeare Company's Matilda the Musical, an adaptation of Roald Dahl's story by Dennis Kelly and comedian Tim Minchin which has transferred from Stratford-upon-Avon to the West End.\n\nThe best design prize went to a sound designer, Adam Cork, for his work on the Donmar Warehouse productions Anna Christie and King Lear.\n\nA new prize called the Beyond Theatre award was won by the collaboration between the band, the Pet Shop Boys, and Venezuelan choreographer Javier de Frutos for The Most Incredible Thing – a full length dance adaptation of the Hans Christian Andersen story – at Sadler's Wells.\n\nThere were two other special awards, one given to Michael Grandage who is stepping down after nine successful years at the Donmar Warehouse in London's Covent Garden, having extended what is a small theatre's reach into the West End and Broadway. Josie Rourke has taken over while Grandage is concentrating on a freelance career with his production of Evita opening on Broadway in the spring.\n\nAnd Tom Stoppard, whose adaptation of Anna Karenina is one of the most anticipated 2012 drama films, was given the Moscow Art Theatre's Golden Seagull for \"his contribution to Russian theatre and the international stage.\"\n\nThe Oliviers – to be held next April at the Royal Opera House – are regarded as the main event when it comes to UK theatre awards but the Evening Standard awards hold an important place in the calendar, not least through longevity, with Sunday night's ceremony being the 57th."}], "Catherine Johnson has been awarded the Critics' Circle Award for Most Promising Playwright.": [{"url": "https://playbill.com/article/2022-new-york-drama-critics-circle-awards-presented-may-20", "page_content": "This year's winners include Off-Broadway's A Case for the Existence of God and Kimberly Akimbo.\n\nWinners of this year's New York Drama Critics' Circle Awards will be honored in a private ceremony May 20 in Manhattan. The organization previously named Samuel D. Hunter’s A Case for the Existence of God Best Play of the 2021-2022 season, while David Lindsay-Abaire and Jeanine Tesori’s Broadway-bound Kimberly Akimbo was named Best Musical.\n\nSpecial citations were awarded to actor and director Austin Pendleton and for emerging talent to Sanaz Toossi for her plays English and Wish You Were Here. The selections were made at the organization’s 86th annual voting meeting.\n\nThe awards include a cash prize of $2,500 for Best Play.\n\nA Case for the Existence of God, written by Hunter and directed by David Cromer, had its world premiere May 2 at Signature Theatre Company, where its engagement was recently again extended. Kimberly Akimbo, with a book and lyrics by Lindsay-Abaire, music by Tesori, and direction by Jessica Stone, had its world premiere at Atlantic Theater Company December 8, 2021. The production will open on Broadway in the fall.\n\nThe New York Drama Critics’ Circle comprises 22 drama critics from daily newspapers, magazines, wire services, and websites based in the New York metropolitan area. The New York Drama Critics' Circle Award has been awarded every year since 1936 to the best new play of the season (with optional awards for foreign or American plays, musicals, and special achievements).\n\nAdam Feldman has served as president of the NYDCC since 2005. Joe Dziemianowicz serves as vice president; Zachary Stewart is treasurer.\n\nVisit DramaCritics.org."}, {"url": "https://thefutureoftheforce.com/2023/04/17/winners-announced-for-the-32nd-critics-circle-theatre-awards/", "page_content": "The most inclusive year ever, with a broad collection of acting talent recognized at the 32nd Critics’ Circle Awards.\n\nThe winners at this year’s Critics’ Circle Theatre Awards are more inclusive than ever as, in a historic first, two of the acting gongs were awarded to performers with disabilities. The Trewin Award for Best Shakespearean Performance went to Arthur Hughes, whose magnetic turn as the eponymous hero in Richard III marked the first time the Royal Shakespeare Company has cast a disabled actor to play the character in its history.\n\nLIZZIE ANNIS\n\nLizzie Annis received the Jack Tinker Award for Most Promising Newcomer for her astonishing performance opposite Amy Adams in The Glass Menagerie as Laura, the painfully shy daughter of Adams’ troubled matriarch. Annis, who has cerebral palsy, was praised by critics for the subtlety and sensitivity she brought to the role.\n\nSHOCK TWIST\n\nIn a shock twist, Jodie Comer – who has won every major acting prize this season for her heartrending performance in Suzie Miller’s Prima Facie – was pipped to the post by Patsy Ferran, whose astonishing turn as Blanche DuBois in Rebecca Frecknall’s A Streetcar Named Desire netted her the award for Best Actress. Ferran, who stepped into the role only four days before the first performance, blew critics away with her compassionate performance and potent chemistry with co-stars Paul Mescal and Anjana Vasan. The prize for Best Actor went to Hamilton alum Giles Terera, who delivered not one but two masterful performances this year in Othello at the National Theatre, and as Guy in Blues for an Alabama Sky. The director of the latter, Lynette Linton, won Best Director, her lyrical and light-footed staging of Pearl Cleage’s play, a riveting rendition of the Harlem Renaissance’s dying days. Peter Morgan’s Patriots won The Michael Billington Award for Best New Play, a crowning achievement atop what has been a triumphant return to the stage for The Crown showrunner. Patriots – an incisive study of Russian dissidence via Putin’s friend-turned-foe, Boris Berezovsky – is the first new play penned by Morgan in almost a decade and has been widely applauded by critics for its breakneck pace and political timeliness.\n\nPLAYWRIGHT, MUSICAL, AND DESIGNER AWARDS\n\nTyrell Williams won the prize for Most Promising Playwright, his debut Red Pitch a deft exploration of football, friendship, and gentrification. Williams, who was also honored this year with the 53rd George Devine Award, was recognized by critics for his playful and poetic use of language, and his centering of experiences that have been historically underrepresented on stage. The Most Promising Playwright award is sponsored by Finito, The Employability Experts. The Peter Hepple Award for Best Musical went to Oklahoma!, an invigorating interpretation of Rogers & Hammerstein’s classic re-orchestrated and reimagined for the 21st century. The musical was honored for its 2022 run at the Young Vic but has recently transferred to Wyndham’s Theatre in London. Tom Pye was named Best Designer for his work on My Neighbour Totoro, his whimsical production design able to summon all the magic of the source material, and even deliver fresh delights. This continues the awards season success of the RSC’s adaption of the Ghibli animation classic, which won six Oliviers earlier this month. Webber Phillips sponsors the Best Designer award.\n\nEMPTY SPACE PETER BROOK AWARD, ATTENDEES, JOSS STONE AND DAVE STEWART\n\nThe 2023 Empty Space Peter Brook Award went to the New Diorama. Originally founded by critic and producer Blanche Marvin MBE, who ran these awards from 1989-2017, the Empty Space Peter Brook Award has been newly revived by the Critics’ Circle to mark the passing last year of radical theatre director Peter Brook. It is the only UK theatre award named in Brook’s memory, with the approval of his estate, and recognizes a theatre that best embodies Brook’s concept of “the empty space”. In attendance at the ceremony were many of this year’s winners, among them Peter Morgan (The Crown), Giles Terera (Hamilton), and Patsy Ferran (A Streetcar Named Desire). They celebrated alongside awards presenters and guests including actors Paul Mescal (Normal People), Gethin Anthony (Game of Thrones), Juliet Stevenson (Truly, Madly, Deeply), Tracey-Ann Oberman (It’s A Sin), Joanna Vanderham (Crime), and leading directors such as Rufus Norris (the National Theatre). Attendees were also treated to a surprise preview of the latest work from singer-songwriter Joss Stone and Eurythmics star Dave Stewart. The two are collaborating on a new musical, The Time Traveller’s Wife, which will open at the Apollo Theatre in October 2023. Attendees enjoyed a performance of ‘This Time’, performed by actress Joanna Woodward. This song articulates the adoration and frustration of her love of her now-husband Henry, as well as her famous line from the beloved novel: “‘It’s hard to be the one who stays behind.”\n\nTHE CRITICS’ CIRCLE\n\nThe Critics’ Circle is grateful for the continuing support of lead sponsors Nyman Libson Paul, the creative industry accountants. Anthony Pins, Managing Partner of Nyman Libson Paul, said “As leading accountants and tax advisers to the theatre industry, we are delighted to continue our long association with the Critics’ Circle Theatre Awards, which are highly respected and valued by the recipients. The Circle also acknowledges the generosity of Finito, Webber Phillips, and Theatre of Wine. “Young people leaving school, college and university increasingly want a career in the Arts and Creative Industries. The Critics’ Circle Theatre Awards shows them what is possible,” said Ronel Lehmann, Founder and Chief Executive of Finito, the employability experts.\n\nLIST OF WINNERS\n\nBest New Play (The Michael Billington Award) Peter Morgan, Patriots Best Musical (The Peter Hepple Award) Oklahoma!, Young Vic, Bard SummerScape & associates Best Actor Giles Terera, Othello and Blues For An Alabama Sky Best Actress Patsy Ferran, A Streetcar Named Desire Best Shakespearean Performance (The Trewin Award) Arthur Hughes, Richard III Best Director Lynette Linton, Blues For An Alabama Sky Best Designer Tom Pye, My Neighbour Totoro Most Promising Playwright Tyrell Williams, Red Pitch Most Promising Newcomer (The Jack Tinker Award) Lizzie Annis, The Glass Menagerie The Empty Space Peter Brook Award New Diorama\n\nCarl Roberts is the News Editor for The Future of the Force. Aside from being our horror genre aficionado, he is also passionate about Star Wars, Marvel, DC, and the Indiana Jones movies. Follow him on Twitter where he uses the force frequently!\n\nLike this: Like Loading...\n\nRelated"}, {"url": "https://theatrevibe.co.uk/2022/04/04/news-31st-critics-circle-theatre-awards-winners/", "page_content": "The awards come one week before London’s Olivier Awards, in which Jessie Buckley, Cush Jumbo and Ben Daniels are all nominated for major acting awards. They now are even likelier prospects to triumph at next weekend’s ceremony.\n\nZadie Smith and Igor Memic were named joint-winners of the Most Promising Playwright award. Although a household name as a best-selling novelist, Smith counted as a ‘newcomer’ for the Critics’ Circle because The Wife of Willesden, a reimaging of Chaucer’s Wife of Bath, is her debut play. Smith now adds her Critics’ Circle Theatre Award to an Orange Prize for Fiction, the Whitbread First Novel Award, and the James Tait Memorial Prize, amongst others. Igor Memic also won for a debut play, his heart-wrenching romance Old Bridge drawing upon Memic’s personal history in its depiction of war- torn Bosnia.\n\nJames Graham’s brilliant drama Best of Enemies won the Michael Billington award for Best New Play, an award renamed last year to mark the retirement of longstanding Guardian critic Michael Billington. Together with Jumbo’s prize for Hamlet, this meant two prizes for London’s Young Vic theatre.\n\nThe in-person ceremony marked the return of the Critics’ Circle Theatre Awards after the pandemic forced the organisation to skip a year’s ceremony for the first time in its history. To mark this hiatus, the Critics’ Circle created a one-off category of commendations for those “who went above and beyond to keep theatre alive” during this period. The National Theatre was celebrated, with critics citing its effort to broadcast theatre to the nation through the NT Live screenings, and the excellence of its filmed production of Romeo & Juliet, which also starred Jessie Buckley. Elsewhere, the Critics’ Circle commended Jermyn Street Theatre for 15 Heroines, a series of filmed monologues using up-to- the-minute-tech to reimagine ancient poems by the Roman poet Ovid. The Old Vic was commended for its IN CAMERA season and the Original Theatre Company was commended as a pioneer in building new theatre steaming platforms. The Critics’ Circle gave an individual award to Nimax CEO Nica Burns, who pioneered new forms of socially distanced theatre in her venues around the world.\n\nIn attendance at the ceremony were many of this year’s winners, among them novelist and essayist Zadie Smith (The Wife of Willesden), actor Ben Daniels (The Normal Heart, The Exorcist), British actress and writer Cush Jumbo (Hamlet, The Good Wife), and British playwright and screenwriter James Graham (Best of Enemies, This House). They celebrated alongside awards presenters and guests, including actors Gethin Anthony (Game of Thrones; Aquarius), Tom Felton (Harry Potter), Kerry Fox(Shallow Grave), Harry Lloyd (Game of Thrones) and leading directors such as Rufus Norris (the National Theatre), Rupert Goold (the Almeida Theatre) and Lynette Linton (the Bush Theatre).\n\nAbout the Critics’ Circle Theatre Awards\n\nThe Critics’ Circle Theatre Awards, founded in 1989, are run by Drama Section of The Critics’ Circle, which has existed since 1913 to protect and promote cultural criticism in the UK.\n\nSince the Awards’ inception, the organisation’s membership of professional theatre critics have prided themselves on offering something unique on the theatre awards circuit. Each member of the Drama Section independently casts their vote based on personal choice, free of any discussion or industry influence, ensuring a highly democratic voting process. These are the only awards judged exclusively by working theatre critics, whose job is to see everything that UK theatre has to offer."}, {"url": "https://www.theatre-news.com/news/UK/92936/Winners-announced-for-The-31st-Critics-Circle-Theatre-Awards", "page_content": "NEWS Winners announced for The 31st Critics’ Circle Theatre Awards Newsdesk Share with :\n\n\n\n\n\nRebecca Frecknall’s electric Cabaret revival led the list of winners at the 31st Annual Critics’ Circle Theatre Awards, taking home three major awards at the Ham Yard Hotel ceremony on Sunday. Frecknall’s acclaimed new staging of the 1966 musical – which stars Eddie Redmayne as the Emcee in his first role on the London stage in nearly a decade – won her the Best Director award. One week after attending the Academy Awards ceremony as a nominee, Redmayne’s co-star Jessie Buckley was awarded Best Actress at the Critics’ Circle for her astonishing performance as Sally Bowles, Cabaret’s tuneless chanteuse. Tom Scutt’s subtly sinister stage design won him the Best Designer award for the second year running, after he oversaw the Playhouse Theatre’s transformation – auditorium and all – into Cabaret’s Kit Kat Klub.\n\n\n\nBut in a shock twist at the end of the night, Rupert Goold’s Spring Awakening revival scooped Cabaret to the final award, Best Musical. Between the two shows, it was a banner year for musicals, with Spring Awakening winning a pair of awards to become the Critics’ Circle’s second-most celebrated production of the night. Stuart Thompson was a joint winner of the Jack Tinker Award for Most Promising Newcomerfor his poignant performance as Moritz. He shared the award with Samuel Creasy, making his stage debut as the hero of the Bridge Theatre’s adaptation of Phillip Pullman’s cult novel, The Book of Dust - La Belle Sauvage.\n\n\n\nFor her fierce performance as the eponymous hero of Hamlet, directed by her long-term collaborator Greg Hersov, the Critics’ Circle awarded Cush Jumbo the Trewin Award for Best Shakespearean Performance. The final prize for performance was awarded to Ben Daniels, who was named Best Actorfor his role as the defiant Ned Weeks in Dominic Cooke’s new staging of Larry Kramer’s The Normal Heart. A largely autobiographical account of Kramer’s own experiences as the co-founder of an HIV advocacy group operating in the early years of the AIDs crisis, Cooke’s revival marked 35 years since its UK premiere.\n\n\n\nThe awards come one week before London’s Olivier Awards, in which Jessie Buckley, Cush Jumbo and Ben Daniels are all nominated for major acting awards. They now are even likelier prospects to triumph at next weekend’s ceremony.\n\n\n\nZadie Smith and Igor Memic were named joint-winners of the Most Promising Playwright award. Although a household name as a best-selling novelist, Smith counted as a ‘newcomer’ for the Critics’ Circle because The Wife of Willesden, a reimaging of Chaucer’s Wife of Bath, is her debut play. Smith now adds her Critics’ Circle Theatre Award to an Orange Prize for Fiction, the Whitbread First Novel Award, and the James Tait Memorial Prize, amongst others. Igor Memic also won for a debut play, his heart-wrenching romance Old Bridge drawing upon Memic’s personal history in its depiction of war-torn Bosnia.\n\n\n\nJames Graham’s brilliant drama Best of Enemies won the Michael Billington award for Best New Play, an award renamed last year to mark the retirement of longstanding Guardian critic Michael Billington. Together with Jumbo’s prize for Hamlet, this meant two prizes for London’s Young Vic theatre.\n\n\n\nThe in-person ceremony marked the return of the Critics’ Circle Theatre Awards after the pandemic forced the organisation to skip a year’s ceremony for the first time in its history. To mark this hiatus, the Critics’ Circle created a one-off category of commendations for those “who went above and beyond to keep theatre alive” during this period. The National Theatre was celebrated, with critics citing its effort to broadcast theatre to the nation through the NT Live screenings, and the excellence of its filmed production of Romeo & Juliet, which also starred Jessie Buckley. Elsewhere, the Critics’ Circle commended Jermyn Street Theatre for 15 Heroines, a series of filmed monologues using up-to-the-minute-tech to reimagine ancient poems by the Roman poet Ovid. The Old Vic was commended for its IN CAMERA season and the Original Theatre Company was commended as a pioneer in building new theatre steaming platforms. The Critics’ Circle gave an individual award to Nimax CEO Nica Burns, who pioneered new forms of socially distanced theatre in her venues around the world.\n\n\n\nIn attendance at the ceremony were many of this year’s winners, among them novelist and essayist Zadie Smith (The Wife of Willesden), actor Ben Daniels (The Normal Heart, The Exorcist), British actress and writer Cush Jumbo (Hamlet, The Good Wife), and British playwright and screenwriter James Graham (Best of Enemies, This House). They celebrated alongside awards presenters and guests, including actors Gethin Anthony (Game of Thrones; Aquarius), Tom Felton (Harry Potter), Kerry Fox (Shallow Grave), Harry Lloyd(Game of Thrones) and leading directors such as Rufus Norris (the National Theatre), Rupert Goold (the Almeida Theatre) and Lynette Linton (the Bush Theatre).\n\n\n\nLIST OF WINNERS\n\nBest New Play (The Michael Billington Award) Best of Enemies\n\nBest Musical (The Peter Hepple Award) Spring Awakening\n\nBest Actor Ben Daniels (The Normal Heart)\n\nBest Actress Jessie Buckley (Cabaret)\n\nBest Shakespearean Performance (The Trewin Award) Cush Jumbo (Hamlet)\n\nBest Director Rebecca Frecknall (Cabaret)\n\nBest Designer Tom Scutt (Cabaret)\n\nMost Promising Playwright Zadie Smith (The Wife of Willesden)\n\nIgor Memic (Old Bridge)\n\nMost Promising Newcomer (The Jack Tinker Award) Stuart Thompson (Spring Awakening)\n\nSamuel Creasy (The Book of Dust: La Belle Sauvage)\n\n\n\nCommendations for Exceptional Theatre Making During Lockdown\n\nNational Theatre\n\nJermyn Street Theatre\n\nOriginal Theatre Company\n\nOld Vic\n\nNica Burns"}, {"url": "https://criticscircle.org.uk/the-critics-circle-theatre-awards-return/", "page_content": "The Critics’ Circle Theatre Awards Return\n\nThe Critics’ Circle Theatre Awards took a hiatus during the lockdowns of 2021, but returned on 3 April 2022 with a ceremony at the Ham Yard Hotel, honouring work made in the calendar year 2021.\n\nThe decision not to hold an awards, even virtually, in 2021 had been a difficult one, but in the end the overwhelming view of the members was that it would be wrong to celebrate or define parameters of excellence at a time when our friends in the industry were undergoing an existential trauma. Nonetheless, we wanted to acknowledge that many people had nonetheless managed extraordinary creative work in new forms during the lockdown periods, which is why this year we also included five commendations for organisations and individuals who went above and beyond to keep theatre alive during lockdown.\n\nSamuel Creasey (Most Promising Newcomer) Zadie Smith (Most Promising Playwright), Emma Keith and David Sabel (Exceptional Theatre Making During Lockdown), Igor Memic (Most Promising Playwright), Ben Daniels (Best Actor), Joanna Down and Harriet Mackie (Exceptional Theatre Making During Lockdown), Alastair Whatley (Exceptional Theatre Making During Lockdown), Rebecca Frecknall (Best Director), Nica Burns (Exceptional Theatre Making During Lockdown), James Graham (Best New Play), Cush Jumbo (Best Shakespearean Performance), Tom Littler, (Exceptional Theatre Making During Lockdown), Stuart Thompson (Most Promising Newcomer) and Rupert Goold (Best Musical) with Kate Maltby (Chair, Drama Section, Critics’ Circle) at The Critics Circle Theatre Awards at The Ham Yard Hotel, London on 03 April 2022\n\nIt was clearly a year for musicals – Cabaret and Spring Awakening garnered the most awards, with Cabaret winning Best Director (Rebecca Frecknall), Best Director (Tom Scutt) and Best Actress (Jessie Buckley), but Spring Awakening pipping it to the post for Best Musical, as well as winning Stuart Thompson one of the day’s two shared ‘Most Promising Newcomer Awards’.\n\nRupert Goold accepts the award for Best Musical for ‘Spring Awakening’ with Amara Okereke, Laurie Kynaston, Lynne Page, Stuart Thompson at The Critics Circle Theatre Awards at The Ham Yard Hotel, London on 03 April 2022\n\nVeteran novelist Zadie Smith also won her first drama award, as her debut play ‘The Wife of Willesden’ made her eligible for the Most Promising Playwright award. She shared it with Igor Memic, who was recognised for his memory play Old Bridge and gave a moving speech about the impact of war on his Bosnian family, urging us to ‘make space’ for the children of Odese and Mariopul to tell their own stories in theatre. Completing our set of playwrights was James Graham, awarded the Michael Billington Award for Best New Play for the Headlong/Young Vic production of Best of Enemies – an award presented by the Critics’ Circle’s own Michael Billington in person.\n\nJames Graham with Michael Billington award for Best New Play ‘Best of Enemies’ , Zadie Smith with her award for ‘Most Promising Playwright’ for The Wife of Willesden and Igor Memic with his award for ‘Most Promising Playwright’ for Old Bridge at The Critics Circle Theatre Awards at The Ham Yard Hotel, London on 03 April 2022\n\nCush Jumbo took the Trewin Award for Best Shakespearian Performance for Hamlet and Ben Daniels won Best Actor for The Normal Heart. In an exact tie with Stuart Thompson, Samuel Creasey was also awarded a Most Promising Newcomer award, for his role in The Book of Dust: La Belle Sauvage.\n\nWe awarded Commendations for Exceptional Theatre Making During Lockdown to Jermyn Street Theatre, Original Theatre Company, the National Theatre (particularly citing its NT Live screenings, the development of NT at Home, and the artistic excellence of Romeo & Juliet), OLD VIC: IN CAMERA. We also awarded an individual Commendation to Nica Burns, with the following citation;\n\nWhen the coronavirus pandemic first hit, most people in British theatre spent sleepless nights trying to work out how to save their own livelihoods. Our final Commendation today goes to someone who has made it her mission, from Day One, to invest in the survival of the rest of the industry, not merely the interests of her own businesses.\n\nFew people would have thought this the time to finance a ‘Rising Stars’ festival, but this person went ahead and gave 24 young producers their West End debuts, backing newcomers in the midst of a financial crisis. She was a pioneer of the creative thinking needed to stage socially distanced theatre, with trials across the world for her productions of Everyone’s Talking About Jamie. She’s been unafraid to put pressure on government in public and indefatigable in lobbying in private.\n\nSo, for her commitment to our industry, and her investment in the next generation\n\nThis Commendation for Exceptional Theatre Making During Lockdown goes to Nica Burns.\n\nWe were delighted that Joanne Davidson worked with us to take the beautiful photographs you see on this page."}, {"url": "https://www.bookcritics.org/awards/", "page_content": "Kelly Lytle Hernández Bad Mexicans: Race, Empire, and Revolution in the Borderlands Norton\n\nJoseph Osmundson Virology: Essays for the Living, the Dead, and the Small Things in Between Norton\n\nAnnie Proulx Fen, Bog, & Swamp: A Short History of Peatland Destruction and Its Role in the Climate Crisis Scribner"}, {"url": "https://royalcourttheatre.com/jasmine-lee-jones-awarded-this-years-critics-circle-award-for-most-promising-playwright-for-seven-methods-of-killing-kylie-jenner/", "page_content": "Jasmine Lee-Jones has been awarded the 2019 Critics’ Circle Theatre Award for Most Promising Playwright for her play seven methods of killing kylie jenner.\n\nseven methods of killing kylie jenner originally ran in the Royal Court Jerwood Theatre Upstairs Thursday 4 July 2019 – Saturday 27 July 2019. It was directed by Milli Bhatia and performed by Tia Bannon and Danielle Vitalis.\n\nJasmine has also been awarded the Alfred Fagon Award and the Evening Standard Theatre Award for Most Promising Playwright for seven methods of killing kylie jenner.\n\nFor the full list of winners at this year’s awards click here."}, {"url": "https://www.bookcritics.org/2022/01/20/announcing-the-finalists-for-the-national-book-critics-circle-awards/", "page_content": "NATIONAL BOOK CRITICS CIRCLE ANNOUNCES ITS FINALISTS FOR PUBLISHING YEAR 2021\n\nNona Balakian Citation is given to Merve Emre\n\n\n\nHudson, NY (January 20, 2022)—Tonight, in a virtual event produced by Wildbound Live, the National Book Critics Circle announced its 30 finalists in six categories—autobiography, biography, criticism, fiction, general nonfiction, and poetry—for the best books of 2021. Finalists for the Leonard Prize for best first book were also announced, determined by nominations from hundreds of the organization’s regular members. Other announcements included the winner of the annual prize for a working book critic, a lifetime achievement award, and the inaugural Toni Morrison Achievement award for an institution.\n\n\n\nThe announcements, made by special guests Carlos Lozada, Morgan Parker, and Patrick Radden Keefe, followed a 30th anniversary celebration of the Nona Balakian Citation for Excellence in Reviewing. The program featured a discussion about the standards and craft of literary criticism with Balakian laureates Jo Livingstone, Daniel Mendelsohn, Parul Sehgal, and Katy Waldman, moderated by NBCC president David Varno. Nona Balakian (1918–1991) was a founder of the NBCC and an editor at the New York Times Sunday Book Review. Her nephew, poet Peter Balakian, noted in his remarks that his aunt “fought for women writers at a time when women were often marginalized,” noting her support for Virginia Woolf, Eudora Welty, Gwendolyn Brooks, Natalie Saurraute, and many others.\n\nThe National Book Critics Circle Awards, founded in 1974 at the Algonquin Hotel and considered among the most prestigious in American letters, are the sole prizes bestowed by a jury of working critics and book review editors. The awards for publishing year 2021 will be presented on March 17, 2022 via Wildbound Live, in a virtual ceremony that will be free and open to the public.\n\n\n\nThe recipient of the 2020 2021 Nona Balakian Citation for Excellence in Reviewing is Merve Emre. “In Emre’s elegantly written essay about Leonora Carrington’s The Hearing Trumpet,” says prize committee chair Colette Bancroft, “she offers rich context about the life and times of the Surrealist author and artist, always weaving the biography into her insightful consideration of Carrington’s novel.”\n\n\n\nThe recipient of the Ivan Sandrof Lifetime Achievement Award is Percival Everett. “The Sandrof Life Achievement Award generally honors a literary figure who has either had a transformative impact upon book culture or who has contributed to book culture in ways that deserve more attention and recognition,” says prize committee chair Jacob Appel. “Percival Everett is the rare figure who merits the prize for both reasons. Profound and prolific, Everett isn’t just brilliant—but he is brilliant over and over and over again, novel after novel, story after story, each successively more original and thought-provoking. There are two kinds of readers in America: those who are reading Percival Everett and those who are missing out.”\n\nThe Toni Morrison Achievement Award was established by the NBCC in 2021 to honor institutions that have made lasting and meaningful contributions to book culture, and it kicks off by honoring the Cave Canem Foundation. “It is fitting that the award is named after Morrison, herself an NBCC Award winner for fiction, who did so much to inspire and champion writers during her unparalleled career as an editor and Nobel Prize-winning author,” says Appel, who also chaired this prize committee. “In naming Cave Canem as the first Morrison honoree, the NBCC has chosen an organization that embodies the deep commitment to literary and social justice, equity in publishing and excellence in writing that distinguished Morrison’s career. Since its founding by Cornelius Eady and Toi Derricotte twenty-five years ago, Cave Canem has become both the premier body for cultivating and promoting Black poetic voices and has left a truly indelible mark on the broader literary landscape. No institution has played such a definitive role in shaping the poetry of the 21st century. Cave Canem consistently represents the best that the literary world has to offer.”\n\nAUTOBIOGRAPHY\n\nHanif Abdurraqib, A Little Devil in America: Notes In Praise Of Black Performance (Random House)\n\nJeremy Atherton Lin, Gay Bar: Why We Went Out (Little, Brown)\n\nRodrigo Garcia, A Farewell To Gabo And Mercedes: A Son’s Memoir (HarperVia)\n\nDoireann Ní Ghríofa, A Ghost In the Throat (Biblioasis)\n\nAlbert Samaha, Concepcion: An Immigrant Family’s Fortunes (Riverhead)\n\nBIOGRAPHY\n\nSusan Bernofsky, Clairvoyant of the Small: The Life of Robert Walser (Yale University Press)\n\nKeisha N. Blain, Until I Am Free: Fannie Lou Hamer’s Enduring Message to America (Beacon Press)\n\nRebecca Donner, All the Frequent Troubles of Our Days: The True Story of the American Woman at the Heart of the German Resistance to Hitler (Little, Brown)\n\nMark Harris, Mike Nichols: A Life (Penguin Press)\n\nAlexander Nemerov, Fierce Poise: Helen Frankenthaler and 1950s New York (Penguin Press)\n\nCRITICISM\n\nMelissa Febos, Girlhood (Bloomsbury)\n\nJenny Diski, Why Didn’t You Just Do What You Were Told? (Bloomsbury)\n\nJesse McCarthy, Who Will Pay Reparations On My Soul? (Liveright)\n\nMark McGurl, Everything and Less: The Novel in the Age of Amazon (Verso)\n\nAmia Srinivasan, The Right To Sex (FSG)\n\nFICTION\n\nJoshua Cohen, The Netanyahus (NYRB)\n\nRachel Cusk, Second Place (FSG)\n\nSarah Hall, Burntcoat (Custom House)\n\nHonorée Fanonne Jeffers, The Love Songs of W.E.B. DuBois (Harper)\n\nColson Whitehead, Harlem Shuffle (Doubleday)\n\nNONFICTION\n\nPatrick Radden Keefe, Empire of Pain: The Secret History of the Sackler Dynasty (Doubleday)\n\nJoshua Prager, The Family Roe: An American Story (Norton)\n\nSam Quinones, The Least of Us: True Tales of America and Hope in the Time of Fentanyl and Meth (Bloomsbury)\n\nClint Smith, How the Word Is Passed (Little, Brown)\n\nRebecca Solnit, Orwell’s Roses (Viking)\n\nPOETRY\n\nB.K. Fischer, Ceive (BOA)\n\nDonika Kelly, The Renunciations (Graywolf)\n\nRajiv Mohabir, Cutlish (Four Way)\n\nCheswayo Mphanza, The Rinehart Frames (Univ. of Nebraska)\n\nDiane Seuss, frank: sonnets (Graywolf)\n\nJOHN LEONARD PRIZE\n\nAshley C. Ford, Somebody’s Daughter (Flatiron Books)\n\nJocelyn Nicole Johnson, My Monticello (Henry Holt)\n\nTorrey Peters, Detransition, Baby (One World)\n\nLarissa Pham, Pop Song (Catapult)\n\nAnthony Veasna So, Afterparties (Ecco)\n\nDevon Walker-Figueroa, Philomath (Milkweed Editions)\n\n\n\nNONA BALAKIAN CITATION FOR EXCELLENCE IN REVIEWING\n\nMerve Emre\n\n\n\nFinalists\n\nChristoph Irmscher\n\nJulian Lucas\n\nJeremy Lybarger\n\nJennifer Wilson\n\nTONI MORRISON ACHIEVEMENT AWARD\n\nCave Canem Foundation\n\n\n\nIVAN SANDROF LIFETIME ACHIEVEMENT AWARD\n\nPercival Everett\n\n\n\nABOUT THE NATIONAL BOOK CRITICS CIRCLE\n\nThe National Book Critics Circle was founded in 1974 at New York’s legendary Algonquin Hotel by a group of the most influential critics of the day, and awarded its first set of honors the following year. Comprising more than 600 working critics and book-review editors throughout the country, the NBCC annually bestows its awards in six categories, honoring the best books published in the past year in the United States. It is considered one of the most prestigious awards in the publishing industry. The finalists for the NBCC awards are nominated, evaluated, and selected by the 24-member board of directors, which consists of critics and editors from some of the country’s leading print and online publications, as well as critics whose works appear in these publications. For more information about the history and activities of the National Book Critics Circle and to learn how to become a supporter, visit www.bookcritics.org. You can follow the NBCC on Facebook, Twitter and Instagram."}, {"url": "https://britishtheatre.com/critics-circle-theatre-awards-2020-winners-announced/", "page_content": "Last Updated on 11th February 2020\n\nThe Critics’ Circle Theatre Awards 2020 were held today with Come From Away, A Very Expensive Poison, Dear Evan Hansen’s Sam Tutty and director Jamie Lloyd amongst the winners.\n\nThe winners have been announced in this year’s Critics’ Circle Theatre Awards.\n\nBest musical went to Come From Away at London’s Phoenix Theatre while the award for best play went to A Very Expensive Poison by Lucy Prebble at London’s Old Vic Theatre.\n\nOther winners included actors Andrew Scott, Sharon D Clarke, Juliet Stevenson, Hammed Animashaun and Sam Tutty as well as behind-the-scenes creatives Jamie Lloyd, Tom Scutt, Paule Constable and Jasmine Lee-Jones.\n\nThe awards for productions in 2019 were announced this afternoon (11 February) at the Prince of Wales Theatre in London. Founded in 1989, they are run each year by the drama section of The Critics’ Circle, the organisation for professional theatre critics.\n\nFull list of winners (all productions in London)\n\nMichael Billington Award for Best Play\n\nA Very Expensive Poison, Old Vic\n\nBest Musical\n\nCome From Away, Phoenix Theatre\n\nBest Actress\n\nSharon D Clarke, Death of a Salesman, Young Vic and Piccadilly Theatre\n\nJuliet Stevenson, The Doctor, Almeida Theatre and Duke of York’s\n\nBest Actor\n\nAndrew Scott, Present Laughter, Old Vic\n\nBest Director\n\nJamie Lloyd, Evita at Regent’s Park Open Air Theatre, Betrayal at Harold Pinter Theatre and Cyrano de Bergerac at Playhouse Theatre\n\nMost Promising Newcomer\n\nSam Tutty, Dear Evan Hansen, Noël Coward Theatre\n\nTrewin Award for Best Shakespearean Performance\n\nHammed Animashaun, A Midsummer Night’s Dream, Bridge Theatre\n\nMost Promising Playwright\n\nJasmine Lee-Jones, Seven Methods of Killing Kylie Jenner, Royal Court\n\nBest Designer\n\nTom Scutt, A Very Expensive Poison, Old Vic\n\nSpecial Award for Services to Theatre\n\nPaule Constable, lighting designer"}, {"url": "https://criticscircle.org.uk/2014-critics-circle-theatre-awards/", "page_content": "Jane Edwardes\n\nOnce again, the Critics’ Circle Theatre Awards, held at the Prince of Wales Theatre, were a very different affair from other award ceremonies, partly because they are so much more informal, and partly because we have Arthur Smith as our warm-up. Much missed was his joke about the taxman which has become like an old friend. Instead, there was a good new one about a Russian critic (why Russian?) who went to see a play that started at 7pm and went on to 11. About halfway through, he looked at his watch and was dismayed to see it was 7.20pm.\n\nThis ceremony is, of course, about celebrating those occasions when time flies rather than crawls. As the Standard awards increasingly chase glitz and glamour, it’s these awards, voted for by the critics themselves, that give a truer picture of where the most exciting theatre can be found. Happily, a number of this year’s winners have recently transferred to the West End and so can still be seen. Once again the Young Vic was dominant. Mark Strong, winner of the Best Actor award for ‘A View from the Bridge’ at the Young Vic, described how the play pulled him back into the theatre after so many years away, and also how discomforting it was to be told that they would perform in bare feet with no props. The director, Ivo van Hove, who denied Mark his shoes, was also a winner.\n\nHelen McCrory, winner of the Best Actress award for ‘Medea’, and Antony Sher, winner of the John and Wendy Trewin Award for Best Shakespearean Performance, both claimed they had to be persuaded to take on their roles. Helen told presenter Georgina Brown that she had been terrified of the role and was only convinced by her husband, Damian Lewis, that she could play a woman who murdered her children. Antony Sher said that he had never ever thought that he would be right for Falstaff. ‘I realised I was being offered the greatest challenge for a character actor that there is, because I would have to change my body, voice, my whole inner energy to become him. So it became a great journey.’\n\nPatsy Ferran, winner of the Jack Tinker Award for Most Promising Newcomer (other than a playwright) couldn’t attend as she was performing in a matinee of ‘Treasure Island’ at the National, but Michael Coveney memorably described her as having ‘witty elbows’ when she appeared in ‘Blithe Spriti’, something not seen, claimed Michael, since Maggie Smith. Jonathan Kent, winner of the Peter Hepple Award for Best Musical for ‘Gypsy’, was surprised to discover a member of his cast serving drinks in the foyer.\n\nOut of all those either presenting or accepting awards, it was Dominic Cavendish who sprang the biggest surprise when he delivered a speech written entirely in iambic pentameters as a tribute to Mike Bartlett’s ‘King Charless lll’. Not surprisingly, it left the playwright speechless. Here are Dominic’s final verses:\n\nAt times a light capering jest and then\n\nAgain, some thought to sting the mind awake.\n\nWith craft and guile and insight he did ask:\n\nWhat will Britain be when Queen’s reign will end\n\nAnd does the state a constitution need?\n\nTough questions wrapped in entertainment’s garb.\n\nHe brought to utterance what deep lies hid.\n\nThose who have not yet seen this Charles the Third\n\nMust fly forthwith to Wyndhams here hard by.\n\nApplaud they will Tim Pigott-Smith et al\n\nAnd Rupert Goold, director most regal.\n\nPerformances sublime and without spite!\n\nBut lest you fear I almost did forget\n\nGood gentles all, I prithee clap Bartlett.\n\nFor Mike I would invite upon this stage\n\nTo take his due – he has amazed the age;\n\nAt least the Critics Circle, near as good.\n\nTush, tush, let us whoop a new writing god.\n\nIt made a terrific finish to the ceremony.\n\nMany thanks to our loyal sponsors Nyman Libson Paul and to the support given by Delfont Mackintosh Theatres. Thanks also to Catherine Cooper for organizing the event.\n\nWinners 2014\n\nPlaywright Mike Bartlett, with Tim Pigott-Smith who starred in the title role of King Charles lll. © Piers Allardyce\n\nBest New Play\n\nKing Charles lll by Mike Bartlett\n\nAlmeida Theatre, London, followed by transfer to Wyndham’s Theatre, London\n\nThe Peter Hepple Award for Best Musical (new or revival)\n\nGypsy\n\nFestival Theatre, Chichester, to be followed by 2015 transfer to Savoy Theatre, London\n\nBest Actor\n\nMark Strong in A View from the Bridge\n\nYoung Vic Theatre, London, followed by 2015 transfer to Wyndham’s Theatre, London\n\nBest Actress\n\nHelen McCrory in Medea\n\nNational Theatre, Olivier\n\nThe John and Wendy Trewin Award for Best Shakespearean Performance\n\nAntony Sher in Henry IV Parts l & ll\n\nRSC at Royal Shakespeare Theatre, Stratford-upon-Avon, regional tour & Barbican Theatre, London\n\nBest Shakespearean Performance: Antony Sher © Piers Allardyce\n\nBest Director\n\nIvo van Hove for A View from the Bridge\n\nYoung Vic Theatre, London, followed by 2015 transfer to Wyndham’s Theatre, London\n\nBest Designer\n\n= awarded jointly\n\nPaul Barritt for Golem\n\n1927 at Young Vic\n\nBest Designer\n\n= awarded jointly\n\nEs Devlin for The Nether\n\nHeadlong Theatre at Royal Court Theatre, London,\n\nBest Designer (awarded jointly): Es Devlin. © Piers Allardyce\n\nMost Promising Playwright\n\nBarney Norris for Visitors\n\nUp in Arms regional tour & Arcola Theatre, London, followed by transfer to Bush Theatre, London\n\nMost Promising Newcomer and Most Promising Playwright: Patsy Ferran and Barney Norris. © Piers Allardyce\n\nThe Jack Tinker Award for Most Promising Newcomer (other than a playwright)\n\nPatsy Ferran in Blithe Spirit & Treasure island\n\nGielgud Theatre, London & National Theatre, Olivier, London"}]}