{"Sara Montiel died in Madrid in 2013 at the age of 85.": [{"url": "https://english.elpais.com/elpais/2013/04/08/inenglish/1365431074_044961.html", "page_content": "Sara Montiel in 'El último cuplé' (1957), directed by Juan de Orduña.\n\nSara Montiel, the first major Spanish star to make it to Hollywood, died at her home in Madrid on Monday at the age of 85.\n\nHer US credits include western Vera Cruz (1954), in which she appeared alongside Gary Cooper and Burt Lancaster, and Mario Lanza in the drama Serenade, directed by her one-time husband Anthony Mann.\n\nAt home, she starred in films such as El último cuplé (1957) and performed memorable interpretations of songs such as Fumando espero and Bésame mucho. One of the country’s most gossiped-about actresses, she was an unmistakable metaphor of the real Spain of the 1950s, 1960s and 1970s.\n\nAfter the success of El último cuplé she began to star in a series of musical melodramas – and to name her price: “A million dollars a movie.” She also chose all her own songs, costumes and even her timetable: “Because I refused to get up early again. In Mexico and the US I had to get up at 5.30 and six in the morning. Never again!”\n\nMontiel was born María Antonia Abad Fernández in 1928 in Campo de Criptana, Ciudad Real province, a humble agricultural town. At the outbreak of the Civil War in 1936, she moved with her family to Orihuela in Alicante and attended a convent school where Sister Leocadia taught her to sing.\n\nThey love me a lot everywhere Spain. I’m on stage for two hours and they leave delighted\"\n\nShe made her film debut in Empezó en boda in 1944, alongside the great Fernando Fernán-Gómez: “He was the first man who kissed me. I was 16 years old and I didn’t know how. And he explained to me how they did it in the movies. I thought it was done how it looked: from start to finish.”\n\nHer stage name came from illustrator Enrique Herreros who thought she needed a “forceful surname,” like Montiel. The first part she chose herself, after her great-grandmother.\n\nFeeling her career wasn’t taking off in Spain, she moved to Mexico to make Furia roja for the Hispamex production company in 1950, on the recommendation of the playwright Miguel Mihura - “my first love.” “Ah, what a country Mexico was,” she remembered. “A very professional film industry, in the middle of its golden age. And people could get divorced. A reality that contrasted with the crummy one we had in Spain. […] And I became Mexican, of course. I still have my nationality card in the safe. When I married Tony Mann, in Los Angeles, I got married with my other passport, the Mexican one.”\n\nIn total she married four times and is survived by her two adopted children.\n\nShe died suddenly in her home in the Salamanca neighborhood of Madrid, having celebrated her 85th birthday barely three weeks before. Although Montiel retired from films in 1974, she never thought about giving up performing and continued to give concerts. “Last year I did six galas. They love me a lot everywhere Spain. I’m on stage for two hours and they all leave delighted. And I do nothing to look after my voice,” she said in her final interview, given to EL PAÍS last October."}, {"url": "https://www.reuters.com/article/uk-spain-montiel-idUKBRE9370KF20130408", "page_content": "Spanish singer and actress Sara Montiel (L) embraces Jose Ortega Cano, husband of late Spanish singer Rocio Jurado, during Jurado's wake at a temporary funeral chapel in central Madrid, June 1, 2006. REUTERS/Ballesteros/Pool\n\nMADRID (Reuters) - Spanish film legend Sara Montiel, who featured in 1950s Hollywood films with the likes of Gary Cooper and smoked cigars with Ernest Hemingway, died on Monday at 85.\n\nMontiel, born Maria Antonia Abad, died at home in Madrid, according to Spanish actors’ union AISGE.\n\nAmong her best-known English-language films were “Vera Cruz”, a 1954 film that starred Gary Cooper, and 1957 Western “Run of the Arrow”, released as “Yuma” in Spanish, a Sam Fuller movie that also featured Charles Bronson and Rod Steiger.\n\nMontiel, married three times, starred in films in Mexico and Spain and also had a long singing career.\n\nCelebrated for her beauty, Montiel was often photographed at bullfights and puffing on a cigar. She wrote two memoirs - “Life is a Pleasure” and “Sara and Sex”."}, {"url": "https://www.thelocal.es/index.php/20130408/sara-montiel", "page_content": "Advertisement\n\nOne of Spain's most loved actresses, Montiel made her on-screen debut in her mid-teens after winning a beauty contest whose prize was a film role in 'Te quiero para mi'.\n\nThis led to a three-decade long movie career where she featured in nearly 50 films.\n\nBorn to a farmer and a beautician as Maria Antonia Abad Fernandez in the central Spanish village of Campo de Criptana in 1928, Montiel was known for her great natural beauty and starred in more than 14 films between 1950 and 1954.\n\nShe rose to international fame after starring alongside Gary Cooper and Burt Lancaster in the 1954 western Vera Cruz, and enjoyed a near mega-star status in both her homeland and Europe after her part in the 'El ultimo cuple' in 1957.\n\nIn an interview with Spanish radio station Onda Cero in March, she talked about her life, reminiscing about the many Hollywood encounters her career had blessed her with, including that with Marlon Brando in 1951.\n\n\"I was an idiot. I didn't pay attention to him. He was filming Guys and Dolls with Frank Sinatra and I spent an afternoon chatting with him.\n\n\"I didn't get to know Frank Sinatra that day because he wasn't working,\" she said, adding she did however get to know Sinatra at a later stage.\n\nShe also recounted the time when, one morning, she stumbled upon Greta Garbo in her garden.\n\n\"She was in my home. I had woken up around noon, because I was still living my life like a Spaniard\" and rising late, she said.\n\n\"I went out into the garden. My husband was there playing tennis with a woman. They were just finishing playing and came over to me. My husband said to me: 'Antonia, look, I want you to meet Greta Garbo'. I almost fainted.\"\n\nMontiel was married four times in her life, including to the late Spanish industrial magnate Pepe Tous, with whom she adopted two children, Thais and Zeus. Tous died in 1992.\n\nAlso a talented singer, Montiel, who once described herself as \"very calm, very modest\", dedicated herself to her music career after retiring from the film industry in 1975."}, {"url": "https://apnews.com/article/172b623f240e495ba0604d4cca22a2f7", "page_content": "MADRID (AP) — Sara Montiel, a famed, sultry-voiced Spanish actress who became the first to also achieve Hollywood stardom, died Monday. She was 85.\n\nHer biographer, Peter Villora, said Montiel died at her home in Madrid after passing out. “She was both an actress and singer, but mainly an actress, fulfilling the dream of her life,” Villora said.\n\nMontiel was born Maria Antonia Abad in Campo de Criptana in the central region of La Mancha. An acknowledged beauty with an almost husky singing voice, Montiel starred in more than 50 films, many of which were musicals.\n\nShe married Anthony Mann, an American actor and film director, in 1957. But press reports, which Montiel never denied, claimed she had turbulent affairs with author Ernest Hemingway and actor James Dean.\n\nShe became known for smoking Havana cigars on stage while singing, something that was at the time associated mostly with men. Montiel said it was Hemingway who taught her to smoke.\n\nAfter limited success in Spain, her career took off in Mexico in the late 1940s where she featured in successful Spanish language films such as “Carcel de Mujeres” (Women’s Prison).\n\nFrom there she made the leap to Hollywood, where she soon attracted the attention of actors and directors. She played a supporting role in the legendary 1955 western “Vera Cruz” alongside actors Gary Cooper and Burt Lancaster.\n\nHer second U.S. film was the musical “Serenade,” with tenor Mario Lanza and Joan Fontaine and Vincent Price as stars.\n\n“She was the Spanish star with the greatest international impact until the arrival of Javier (Bardem) and Penelope (Cruz),” Spanish actor Jose Sacristan said.\n\nHaving found success in Mexico and the U.S., Montiel then earned star status in her native Spain with 1957′s “El Ultimo Cuple” (The Last Couplet), which became one of the highest grossing movies in Spanish cinema history.\n\nThe fee for her next film, “La Violetera” (The Violet Seller) netted Montiel more than $1 million, something unheard of for a Spanish star in those days.\n\nIn the mid-1970s, Montiel gave up film work and dedicated herself to live musicals on stage and television.\n\nMontiel is survived by her daughter Thais and son Zeus.\n\n___\n\nJorge Sainz in Madrid contributed to this obituary."}, {"url": "https://www.findagrave.com/memorial/108022555/sara-montiel", "page_content": "Spanish Movie Star and Singer. Born María Antonia Abad Fernández in Campo de Criptana (Ciudad Real), she began her career at young age in cinema in 1946, but her first noted role was in the movie \"Locura de Amor\" (1948). In the 50s, she moved to Mexico and later to Hollywood, plenty of beauty and youth, appearing in films such as \"Yuma\" and \"Veracruz\". There, she was married with motion picture director Anthony Mann from 1957 to 1963. After her return to Spain, she obtained a personal success with the film \"El Último Cuplé\", becoming a myth of Spanish cinema and an international star. In her long career, she also appeared in \"La Violetera\", \"Serenade\" or \"Cinco Almohadas para una noche\". She also was known as Saritísima. She will be buried along with her mother and her sister.∼Family links:\n\n\n\nSpouse:\n\n\n\nAnthony Mann\n\nJose Vicente Ramirez Olalla\n\nJose Tous\n\nAntonio Hernandez\n\n\n\nChildren:\n\n\n\nThais Tous\n\nZeus Tous\n\n\n\nOn April 8th, 2013, Sara Montiel, one of the most beautiful and charismatic film stars to ever grace the silver screen, died suddenly of cardiac arrest in her Madrid penthouse. She had recently celebrated her 85th birthday and had assured family, friends, and media that \"she would never consider retirement.\" Unfortunately fate had different plans. The news of her passing and her obituary ran in every major newspaper in the world in sixteen different languages, witnessing her enormous popularity and widespread appeal. She left behind a legacy of films and recordings that had already turned her into a legend even during her life.\n\n\n\nSara Montiel was born on March 10th, 1928 in the village of Campo de Criptana, province of Ciudad Real, in the Castile-La Mancha region of Spain and was christened Maria Antonia Alejandra Abad Fernandez. Barely in her teens, she won a beauty and talent contest and was signed to a movie contract making her film debut in 1944. The young actress caught the attention of producers and directors who realized her enormous potential and in the next four years Sarita (\"Little Sara, as she was affectionately nick named) appeared in 14 films including her first international success \"Locura de Amor\" (1948) which led to a contract in Mexico where she established herself as one of the most popular film actors of the decade making a total of 13 films between 1950 and 1955. Due to her popularity in Mexico, Hollywood producers showed interest and she was formally introduced to American moviegoers in \"Vera Cruz\" (1954) starring Gary Cooper and Burt Lancaster. Later she filmed for Warner Bros. \"Serenade\" (1955) with Mario Lanza, Joan Fontaine and Vincent Price directed by Anthony Mann who became her first husband two years later.\n\n\n\nAfter starring in Samuel Fuller's \"Run Of The Arrow\" (1957) with Rod Steiger, Brian Keith and Charles Bronson, Sarita went to Spain to film \"El Último Cuplé\" (The Last Song), a musical production which became the biggest box-office success in Spain's film history. It played for a year in the same theaters in which it opened becoming a sociological event of major proportions. A similar reaction followed in Western Europe and Latin America. Sarita Montiel had become the most popular actress-singer of 1957 and a national treasure for Spain. The unprecedented success of \"El Último Cuplé\" threw a wrench into her Hollywood career as she was offered a multimillion dollar contract to film in Spain and Europe. Her next vehicle \"La Violetera\" (The Violet Peddler) was an international blockbuster that confirmed Sara's popularity and the theme song from the film became Montiel's signature song. The soundtrack albums from both films reportedly outsold Presley and Sinatra in the world market. From then on, Sarita would combine the making of films with the recording of highly successful albums and live concerts.\n\n\n\nThe next films .ratified her screen image and mass appeal: \"Carmen, la de Ronda\" (1959), \"Mi Último Tango\" (1960), \"Pecado de Amor\" (1961) were all outstanding commercial successes and proved that the Montiel phenomenon had arrived to stay. By 1962 she had become a legend to millions worldwide and continued enchanting her public with films such as \"La Bella Lola\" (1962), \"La Reina del Chantecler\" (1963), \"Noches de Casablanca\" (1963) \"Samba\" (1964), \"La Dama de Beirut\" (1965), \"La Mujer Perdida\" (1966), \"Tuset Street\" (1967), \"Esa Mujer\" (1968), \"Varietés\" (1971) and more record-breaking concert tours around the world. After starring in the 1974 film \"Cinco Almohadas Para Una Noche\", Montiel announced her retirement from movies complaining about the almost pornographic turn taken by the film industry after censorship was abolished in Spain. For a long time she concentrated on stage musicals which were highly successful and by the 1990s she was appearing on her own television shows. As with all major celebrities, her career and her personal life kept making headlines for decades.\n\n\n\nIn December 2000, Sara Montiel published her long awaited \"memoirs\" titled \"Vivir es un placer\" (To live is a pleasure) in which she candidly told her remarkable story... Upon release the book became a best seller reaching its fifth printing in a few weeks. A follow-up titled \"Sara & Sex\" was quickly published to satisfy the demand for more of Sara's literary output. The star kept on working, living fast and adding experiences that could have filled many more volumes. It is quite impossible to cover here all the awards she won in her long successful career but we must mention the \"Gold Medal\", a life achievement recognition given rarely by Spain's Academy of Arts and Sciences . In 2008 Sara returned to her hometown to unveil a sculpture with her image at the new Sara Montiel Park. A nearby avenue was also named after her and there was a the same time a dedication ceremony of her newly renovated museum located inside a 16th century windmill.\n\n\n\nUndaunted by the passage of time, Sara Montiel continued living and working at a hectic pace. She kept touring with her one woman show and making guests appearances on television. In 2009 she won a new generation of fans with her recording of \"Absolutamente,\" an outrageous duet with vocalist Alaska of the rock-pop act Fangoria. Both the record and the promotional video reached the top of the popularity charts and remained there for weeks. Next Sara recorded some love duets with baritone José Antonio Román Marcos and traveled to the United States for a short tour sponsored by New York's Cervantes Institute and the universities of Chicago and Cincinnati. In every city she charmed the audiences with her charismatic presence and sense of humor. Back in Spain she continued her activities which now included supporting the singing career of her son Zeus. She caused quite a stir when she appeared in his 2011 \"Sex Dance\" video. In February 2013 Sara Montiel became the subject of a made-for-TV documentary titled \"Sara's Dream\" which aired in Spain to high ratings and great reviews. It was a fitting celebration of her fantastic life and career which came at the right time.\n\n\n\nA couple of months later, the star who had seemed eternal, passed away suddenly and quietly in her Madrid penthouse. By her family's request, funeral services were private but the funeral procession, organized officially by the city of Madrid, was a very moving event attended by thousands who showed up at Plaza Callao to bid farewell to their beloved Sara. She was buried in the San Justo cemetery family plot but since then there have been dozens of tributes in Spain and all over the world. It doesn't seem like this remarkable woman and artist will be forgotten soon. One thing is for sure: there'll never be another like her.\n\n\n\n\n\n\n\n\n\n\n\nSpanish Movie Star and Singer. Born María Antonia Abad Fernández in Campo de Criptana (Ciudad Real), she began her career at young age in cinema in 1946, but her first noted role was in the movie \"Locura de Amor\" (1948). In the 50s, she moved to Mexico and later to Hollywood, plenty of beauty and youth, appearing in films such as \"Yuma\" and \"Veracruz\". There, she was married with motion picture director Anthony Mann from 1957 to 1963. After her return to Spain, she obtained a personal success with the film \"El Último Cuplé\", becoming a myth of Spanish cinema and an international star. In her long career, she also appeared in \"La Violetera\", \"Serenade\" or \"Cinco Almohadas para una noche\". She also was known as Saritísima. She will be buried along with her mother and her sister.∼Family links:\n\n\n\nSpouse:\n\n\n\nAnthony Mann\n\nJose Vicente Ramirez Olalla\n\nJose Tous\n\nAntonio Hernandez\n\n\n\nChildren:\n\n\n\nThais Tous\n\nZeus Tous\n\n\n\nOn April 8th, 2013, Sara Montiel, one of the most beautiful and charismatic film stars to ever grace the silver screen, died suddenly of cardiac arrest in her Madrid penthouse. She had recently celebrated her 85th birthday and had assured family, friends, and media that \"she would never consider retirement.\" Unfortunately fate had different plans. The news of her passing and her obituary ran in every major newspaper in the world in sixteen different languages, witnessing her enormous popularity and widespread appeal. She left behind a legacy of films and recordings that had already turned her into a legend even during her life.\n\n\n\nSara Montiel was born on March 10th, 1928 in the village of Campo de Criptana, province of Ciudad Real, in the Castile-La Mancha region of Spain and was christened Maria Antonia Alejandra Abad Fernandez. Barely in her teens, she won a beauty and talent contest and was signed to a movie contract making her film debut in 1944. The young actress caught the attention of producers and directors who realized her enormous potential and in the next four years Sarita (\"Little Sara, as she was affectionately nick named) appeared in 14 films including her first international success \"Locura de Amor\" (1948) which led to a contract in Mexico where she established herself as one of the most popular film actors of the decade making a total of 13 films between 1950 and 1955. Due to her popularity in Mexico, Hollywood producers showed interest and she was formally introduced to American moviegoers in \"Vera Cruz\" (1954) starring Gary Cooper and Burt Lancaster. Later she filmed for Warner Bros. \"Serenade\" (1955) with Mario Lanza, Joan Fontaine and Vincent Price directed by Anthony Mann who became her first husband two years later.\n\n\n\nAfter starring in Samuel Fuller's \"Run Of The Arrow\" (1957) with Rod Steiger, Brian Keith and Charles Bronson, Sarita went to Spain to film \"El Último Cuplé\" (The Last Song), a musical production which became the biggest box-office success in Spain's film history. It played for a year in the same theaters in which it opened becoming a sociological event of major proportions. A similar reaction followed in Western Europe and Latin America. Sarita Montiel had become the most popular actress-singer of 1957 and a national treasure for Spain. The unprecedented success of \"El Último Cuplé\" threw a wrench into her Hollywood career as she was offered a multimillion dollar contract to film in Spain and Europe. Her next vehicle \"La Violetera\" (The Violet Peddler) was an international blockbuster that confirmed Sara's popularity and the theme song from the film became Montiel's signature song. The soundtrack albums from both films reportedly outsold Presley and Sinatra in the world market. From then on, Sarita would combine the making of films with the recording of highly successful albums and live concerts.\n\n\n\nThe next films .ratified her screen image and mass appeal: \"Carmen, la de Ronda\" (1959), \"Mi Último Tango\" (1960), \"Pecado de Amor\" (1961) were all outstanding commercial successes and proved that the Montiel phenomenon had arrived to stay. By 1962 she had become a legend to millions worldwide and continued enchanting her public with films such as \"La Bella Lola\" (1962), \"La Reina del Chantecler\" (1963), \"Noches de Casablanca\" (1963) \"Samba\" (1964), \"La Dama de Beirut\" (1965), \"La Mujer Perdida\" (1966), \"Tuset Street\" (1967), \"Esa Mujer\" (1968), \"Varietés\" (1971) and more record-breaking concert tours around the world. After starring in the 1974 film \"Cinco Almohadas Para Una Noche\", Montiel announced her retirement from movies complaining about the almost pornographic turn taken by the film industry after censorship was abolished in Spain. For a long time she concentrated on stage musicals which were highly successful and by the 1990s she was appearing on her own television shows. As with all major celebrities, her career and her personal life kept making headlines for decades.\n\n\n\nIn December 2000, Sara Montiel published her long awaited \"memoirs\" titled \"Vivir es un placer\" (To live is a pleasure) in which she candidly told her remarkable story... Upon release the book became a best seller reaching its fifth printing in a few weeks. A follow-up titled \"Sara & Sex\" was quickly published to satisfy the demand for more of Sara's literary output. The star kept on working, living fast and adding experiences that could have filled many more volumes. It is quite impossible to cover here all the awards she won in her long successful career but we must mention the \"Gold Medal\", a life achievement recognition given rarely by Spain's Academy of Arts and Sciences . In 2008 Sara returned to her hometown to unveil a sculpture with her image at the new Sara Montiel Park. A nearby avenue was also named after her and there was a the same time a dedication ceremony of her newly renovated museum located inside a 16th century windmill.\n\n\n\nUndaunted by the passage of time, Sara Montiel continued living and working at a hectic pace. She kept touring with her one woman show and making guests appearances on television. In 2009 she won a new generation of fans with her recording of \"Absolutamente,\" an outrageous duet with vocalist Alaska of the rock-pop act Fangoria. Both the record and the promotional video reached the top of the popularity charts and remained there for weeks. Next Sara recorded some love duets with baritone José Antonio Román Marcos and traveled to the United States for a short tour sponsored by New York's Cervantes Institute and the universities of Chicago and Cincinnati. In every city she charmed the audiences with her charismatic presence and sense of humor. Back in Spain she continued her activities which now included supporting the singing career of her son Zeus. She caused quite a stir when she appeared in his 2011 \"Sex Dance\" video. In February 2013 Sara Montiel became the subject of a made-for-TV documentary titled \"Sara's Dream\" which aired in Spain to high ratings and great reviews. It was a fitting celebration of her fantastic life and career which came at the right time.\n\n\n\nA couple of months later, the star who had seemed eternal, passed away suddenly and quietly in her Madrid penthouse. By her family's request, funeral services were private but the funeral procession, organized officially by the city of Madrid, was a very moving event attended by thousands who showed up at Plaza Callao to bid farewell to their beloved Sara. She was buried in the San Justo cemetery family plot but since then there have been dozens of tributes in Spain and all over the world. It doesn't seem like this remarkable woman and artist will be forgotten soon. One thing is for sure: there'll never be another like her.\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://aldianews.com/en/culture/heritage-and-history/remembering-sara-montiel", "page_content": "Sara Montiel was her stage name and with it she toured the world, making history in the film industry in Spain, Mexico, and Hollywood. The artist, who started acting at age 16, appeared in about fifty films and recorded nearly 500 songs.\n\n\"Sara was a woman who did what she wanted. Nobody could with beat her: neither Mexico, nor the United States nor the Franco regime [in Spain],\" says Israel Rolón-Barada, a Spanish professor at Drexel University and a friend of Montiel during her last years of life.\n\nRolón-Barada refers to the indomitable character of the Iberian superstar. To fully understand and value Montiel’s legacy,he says, her career must be viewed in terms of its four key stages.\n\nThe first was as a novice actress in the Spain of the 1940s, an impoverished country that had taken a step back in women’s civil rights under the dictatorship of General Francisco Franco.\n\nAccording to Rolón-Barada, Montiel was ahead of her time, a post-war woman who had to fight to be a protagonist in a society that had relegated her to play the role the Catholic Church commanded: a good mother, a good wife, a good housewife.\n\nMontiel managed to make 14 films in Spain before age 21, barely knowing how to read and write. To professor Rolón-Barada, \"the lack of academic training can explain why Sara didn’t have an automatic success during that first phase. She was very young and very weak facing seasoned actresses like Imperio Argentina or Amparo Rivelles.”\n\nThe second moment of her career began in 1950, when the actress and her mother moved to Mexico in search of better opportunities. Mexico was the mecca of the Latin American film industry and was in the middle of its golden age.\n\nThere, Montiel got in touch with a circle of exiled Spanish intellectuals and improved her literacy skills with the help of poet León Felipe.\n\nRolón-Barada affirms that it is in Mexico where Sara's innate talent fused with her good luck — “an incredible luck because there she gets to work directly with Pedro Infante, who is at the peak of his career, and with Agustín Lara, the number one composer of Latin American music.\"\n\nNext to Infante, Montiel starred in films like Necesito Dinero, Ahí viene Martín Corona (Little Love of my Life), and El Enamorado (all in 1952). \"She represented a challenge — she was the woman who broke the molds of that time and challenged her husband, a challenge to the Mexican “macho” and the Hispanic male,\" says the professor.\n\nIn Mexico, she learned and evolved until she starred in Piel Canela (1953), a role that was made for her and film made to fit her and that leveraged Sara towards what would be, according to Rolón-Barada, the third stage of her career: Hollywood.\n\n\"She does not go to Hollywood to look for a job or to knock on doors, but Hollywood comes to her to offer her contracts,\" he affirmed.\n\nMontiel debuted without knowing English in American film industry in 1954, playing the role of Nina in Vera Cruz, a western starring Gary Cooper and Burt Lancaster. The film was followed by blockbusters such as Serenade (1956) and Run of the Arrow (1957).\n\nIt was in the mecca of American film industry –and consolidated as a world star– when Montiel's career began to stagnate.\n\n\"She fell into the same problem that many others experienced: she had two possibilities, she was being offered roles as Mexican or as American Indian,\" says Rolón-Barada. “Because that stereotype existed, once they labeled her that way, they continued to see her as only that.\"\n\nSeven years after having left her mother country, Montiel returned to Spain and it was at that time —the fourth stage in her career —that the artist established herself as one of the most important actresses in the history of Spain.\n\nThere, she starred in El Último Cuplé (The Last Torch Song, 1957), a film that according to Rolón-Barada \"changed her life because[with it] she achieves total success with a minimal budget and [also] brings back the musical, a genre from the 1920s.”\n\nEl Último Cuplé was followed by blockbusters like La Violetera (1958), Mi Último Tango (1960), La Bella Lola (1962), White House Nights (1963) and La Mujer Perdida (1966).\n\nA life to discover\n\nSara Montiel died in Madrid on April 8, 2013, at 85 years of age and with a public life known A to Z by her followers and the media.\n\nHowever, three years ago a biography that promises to \"reveal the hardest and difficult aspects of life that she had to face in order to become Sara Montiel,\" began to be “cooked over a slow fire” in Philadelphia, where Dr. Israel Rolón-Barada lives and teaches. Rolón-Barada was an admirer of Sara during his adolescence, a friend of the superstar during her last years of life, and has now become her biographer.\n\nThe goal of the book, with a preliminary title of \"The Cost of Being Sara Montiel,” is in the author’s words \"to explain her real life trajectory: we all know how beautiful she was, the immense volume of her cinematographic and musical legacy, but we don’t know the difficulties and very hard things that this woman had to go through to achieve her goal of being a professional actress.\"\n\nRolón-Barada recalls that his interest in Sara began very early in his life during his teenage years in San Juan, Puerto Rico. There, every day after school, he went with almost religious discipline to the daily appointment he had with Hispanic cinema at his house.\n\nThe TV show was called “Cine de la tarde con Pilar Arenas,” broadcasted on Channel 2.\n\n\"We used to watch the movies and then the next day we commented and sang the songs. That's how my admiration for Sara Montiel began,\" Rolón-Barada remembers.\n\nIn 2001, while doing a Ph.D. in Málaga, Spain, he met her in person during a presentation and signing of her autobiography, Memorias, Vivir es un Placer.\n\nIn 2011, the Modern Language Association of America organized its annual conference in Seattle, which included- a panel called “From Conchita Piquer to Isabel Pantoja: Divas and the Spanish Cultural Imaginary.”\n\nBefore the panel, Rolón-Barada managed a two-day interview with Sara Montiel on the island of Tabarca, a situation that, according to the professor, amused the diva because it came only 48 hours after their first talk on the phone, after which Rolón-Barada flew from Philadelphia to Spain to meet her in the middle of the Mediterranean Sea.\n\nRolón-Barada says that this biography differs from others that have come out about Montiel because his approach to documenting her life is as an academic and cultural historian, resulting in a tone and content distinct from the commercial or sensationalist elements of other publications.\n\nFor now, the professor needs to work on a couple of details and conduct a few additional interviews in Mexico and Spain before finishing his version of Montiel's life, which he expects to publish at the beginning of next spring."}, {"url": "https://deadorkicking.com/sara-montiel-dead-or-alive/", "page_content": "Sara Montiel Death\n\nSara passed away on April 8, 2013 at the age of 85 in Madrid, Madrid Spain. Sara's cause of death was congestive heart failure.\n\nSara Montiel death quick facts: When did Sara Montiel die? April 8, 2013\n\nHow did Sara Montiel die? What was the cause of death? Congestive heart failure\n\nHow old was Sara Montiel when died? 85\n\nWhere did Sara Montiel die? What was the location of death? Madrid, Madrid Spain\n\nSara Montiel Birthday and Date of Death\n\nSara Montiel was born on March 10, 1928 and died on April 8, 2013. Sara was 85 years old at the time of death.\n\nBirthday: March 10, 1928\n\nDate of Death: April 8, 2013\n\nAge at Death: 85\n\nSara Montiel - Biography\n\nMaría Antonia Abad Fernández (10 March 1928 – 8 April 2013) known professionally as Sara Montiel (also Sarita Montiel or Saritísima) was a Spanish singer and actress.Montiel was born in Campo de Criptana in the region of Castile–La Mancha in 1928 as María Antonia Abad (complete name María Antonia Alejandra Vicenta Elpidia Isidora Abad Fernández). She worked in Europe, Latin America and United States. Her films The Last Torch Song and The Violet Seller netted the highest gross revenues ever recorded for films made in the Spanish-speaking movie industry during the 1950s/60s. Montiel's film Variety was banned in Beijing in 1973. She played the role of Antonia, the niece of Don Quixote, in the 1947 Spanish film version of Cervantes's great novel.She was portrayed in the Pedro Almodóvar film Bad Education by a male actor in drag (Gael García Bernal) as the cross-dressing character Zahara, and a film clip from one of her movies was used, as well.Acting careerMontiel started in movies at 15 in her native Spain where she filmed her first movie playing an Islamic princess in the 1948 film Madness for Love, released in the U.S. as The Mad Queen. Later worked in Mexico, starring in a dozen films in less than five years. Hollywood came calling afterwards, and she was introduced to United States moviegoers in the film Vera Cruz (1954) co-starring Gary Cooper and Burt Lancaster, and directed by Robert Aldrich. She was offered the standard seven-year contract at Columbia Pictures, which she refused, afraid of Hollywood's typecasting policies for Hispanics. Instead she freelanced at Warner Bros. with Mario Lanza and Joan Fontaine in Serenade (1956), directed by Anthony Mann, and at RKO in Samuel Fuller's Run of the Arrow (1957), opposite Rod Steiger and Charles Bronson.From The Last Torch Song (1957) on she combined filming, recording songs in five languages and performing live. Almost all of her films earned high box office results. Among the films during the 1960s and early 1970s were The Violet Seller (1958), Carmen. la de Ronda (1959), Mi Último Tango (1960), Pecado de Amor (1961), La Bella Lola (a 1962 version of Camille), Casablanca, Nid d'espions (1963), Samba (1964), La Femme Perdue (1966), Tuset Street (1967), Esa Mujer (1969), Varietes (1971) and others. By then she had become dissatisfied with the movie industry when producers started offering her erotic roles in comedy films. In 1974 Montiel announced her retirement from movies but continued performing live, recording and starring on her own variety television shows in Spain.In November 2009, Alaska from the Spanish pop group Fangoria invited Montiel to record a track sharing vocals with her for the re-release of the band's album Absolutamente. They recorded the title track \"Absolutamente\" as a duet. The music video for the song was released in early 2010. She had no plans to retire, and, in May 2011, after almost 40 years without making a movie, she accepted to perform in a feature film directed by Óscar Parra de Carrizosa. The film title is Abrázame and was shot on location in La Mancha.Personal informationMontiel was born María Antonia Alejandra Abad Fernández in 1928 in Campo de Criptana, Ciudad Real, Spain. She entered films after winning a beauty and talent contest at age 15. In her first movie she was credited as \"María Alejandra\" a shortened version of her real name. For her next film she changed her name to Sara, after her grandmother, and Montiel after the Montiel fields in the Castile–La Mancha region of her birth. She has been married four timesSpouseAnthony Mann (American actor, film director); 1957-1963 (divorced)José Vicente Ramírez Olalla (attorney); 1964-1978 (annulled)José Tous Barberán (attorney, journalist); 1979-1992 (Tous's death); this union produced two adopted children: Thais (born 1979) and José Zeus (born 1983)Antonio Hernández (Cuban videotape operator); 2002-2005 (divorced)MemoirsIn 2000, Montiel published her autobiography Memories: To Live Is A Pleasure, an instant best seller with ten editions to date. A sequel Sara and Sex followed in 2003. In these books Montiel revealed other relationships in her past including one-night stands with writer Ernest Hemingway as well as actor James Dean. She also claimed a long-term affair in the 1940s with playwright Miguel Mihura and mentioned that science wizard Severo Ochoa, a Nobel Prize winner, was the true love of her life.Montiel died in 2013 at her home in Madrid, Madrid Spain at the age of 85 from congestive heart failure."}, {"url": "https://www.14news.com/story/21913791/singer-actress-sara-montiel-dies-at-age-85/", "page_content": "photo: Wikicommons Images\n\nSara Montiel, one of Spain's most important film actresses and the first to have crossed the Atlantic to also become a Hollywood star, has died. She was 85.\n\nHer biographer Peter Villora says Montiel died at her home in Madrid after passing out on Monday.\n\nMontiel was born Maria Antonia Abad in Campo de Criptana in the central region of La Mancha. An acknowledged beauty with a sultry, almost husky singing voice, Montiel starred in more than 50 films, many of which were musicals.\n\nShe married Anthony Mann, an American actor and film director, in 1957, but had a tempestuous love life.\n\n(Copyright 2013 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.)"}, {"url": "https://www.huffpost.com/entry/sara-montiel-dead-star-wh_n_3037235", "page_content": "The Spanish actress Sara Montiel at the premiere of her movie 'La Bella Lola 1963, Madrid, Castilla La Mancha, Spain.(Photo by Gianni Ferrari/Cover/Getty Images).\n\nActress Sara Montiel, one of the great stars of Spanish film, died Monday in her home in Madrid, Spanish newswire EFE reports. She was 85.\n\nThe cause of death was not yet clear from Spanish news reports, though Montiel likely died from natural causes, according to ABC.\n\nAdvertisement\n\nBorn in 1928 in the town of Campo de Criptana with the name María Antonia Abad Fernández, Montiel was among the first Spaniards to cross into Hollywood, where she shared the screen with legends like Gary Cooper, Charles Bronson and Burt Lancaster before returning to conquer the world of Spanish cinema.\n\n“In Mexico and the United States I had to get up at 5:30 or 6:00 in the morning,” the actress said in an interview with Spanish daily El País, recalling the days before she returned to the country of her birth. “Never again!”\n\nMontiel is perhaps best known in Spain for her role in the classic 1957 film “El ultimo cuplé” (“The Last Torch Song”), a musical drama. She also built her career on the strength of her voice, becoming famous for her renditions of songs like “Bésame mucho” and “Fumando espero.”\n\nShe continued to sing well into old age, even after abandoning film in 1974, according to Spanish daily El País.\n\nAdvertisement\n\n“They love me all over Spain,” Montiel told El País last year. “I spend two hours on the stage and they all leave happy. And I don’t do anything to take care of my voice.\n\nThe actress married four times in her life and adopted two children, named Thais and Zeus."}, {"url": "https://www.npr.org/sections/codeswitch/2013/04/08/176592042/la-gran-diva-remembering-sara-montiel", "page_content": "\"Her eyes are still the kind of dark chocolate that cannot be refused.\n\nThey have melted for a legion of leading men. They have silently begged countless big-screen kisses, shot mortal daggers at endless vampy rivals, drenched a few poor wretches in ice water.\n\nThey have lost none of their luster.\n\nSara Montiel, the movie queen and songstress from La Mancha who rose to legendary fame in the '50s, the so-called Elizabeth Taylor of the Spanish-speaking world, still has a way of saying a thousand words with one glance.\n\nShe is draped on a white leather couch, at the Miami Beach home of a friend, recounting her exploits. The romantic kind.\n\n\"You don't have enough paper to print them all,\" says Montiel, 63, letting a flash of her penciled eyes provide the exclamation she does not allow with her cool morning-after throatiness.\""}]}