{"Sara Montiel was a recording artist and released several albums throughout her career.": [{"url": "https://www.allmusic.com/artist/sara-montiel-mn0000249063/discography", "page_content": "Discography Sara Montiel Follow Artist +\n\nTalented actress and popular music singer Sara Montiel (born Maria Antonia Alejandra Abad Fernández), better known as Sarita Montiel, became one of the first sex symbols from Spain to attract Hollywood's…\n\nRead Full Biography"}, {"url": "https://www.allmusic.com/artist/sara-montiel-mn0000249063", "page_content": "Sara Montiel Follow Artist +\n\nTalented actress and popular music singer Sara Montiel (born Maria Antonia Alejandra Abad Fernández), better known as Sarita Montiel, became one of the first sex symbols from Spain to attract Hollywood's…\n\nRead Full Biography"}, {"url": "https://hellomusictheory.com/learn/famous-female-spanish-singers/", "page_content": "Spain is not a country primarily famous for its musicians, but like any other country, it has produced some incredibly talented people over the years. Many of these singers made it to the international stage, while others stayed famous within the country.\n\nSpain has many talented men and women, but the singers on this list will highlight the female talent from the European country. Spanish female singers show their talent through different genres and avenues, but all hail from one country. These Spanish singers are strong, beautiful, and proud of their Spanish heritage.\n\nLet’s dive into our list of 19 of the greatest and most famous female Spanish singers of all time!\n\n1. Charo\n\nMaria Rosario Pilar Martinez Molina Baeza, who is more popularly known as Charo, is an icon in Spanish music, classical guitar, and television. She’s an actress and comedienne, as well as a singer.\n\nCharo started playing guitar when she was nine years old, training under the world’s best classical guitarist Andres Segovia. She has released guitar and vocal tracks since 1968, ranging from disco to flamenco.\n\nCharo’s 1994 flamenco album, Guitar Passion, shot her to musical fame, although her years on American television had already cemented her place as a celebrity.\n\nShe is still active in the music world and is known for much more than her stint on American television.\n\n2. Sara Montiel\n\nBorn María Antonia Abad Fernández, Sara Montiel was one of Spain’s most popular actresses and singer. Montiel was also considered the highest-paid star of Spanish cinema and made over 50 movies.\n\nShe began her acting career early, starring in her first movie at only 16 years old. She also made several films in Spain, America, and Mexico, shooting her to fame.\n\nHowever, Montiel is also known for her angelic voice. At the end of her movie career, she used the musical movies she starred in to create a stage presence for herself. Using the songs she sang in these movies, Montiel performed live and recorded over 500 songs.\n\nAt one point being the highest-paid Spanish movie star, Montiel was fiercely independent and turned down an American movie contract because of stereotypical casting.\n\nShe was incredibly successful and a savvy businesswoman, creating her legacy as she acted and sang.\n\n3. Belinda\n\nBelinda Peregrín Schüll, more known as her stage name Belinda, is another musician who got her start acting.\n\nBorn in Madrid, Spain, she and her mother moved to Mexico City when she was very young. At the age of ten, Belinda was cast as a child actress in a telenovela, “Amigos x Siempre.” S. She used this money and childhood fame to springboard her musical career.\n\nWhen she was 21, Belinda released a self-named album, which shot her to popularity and earned her the moniker “Princess of Latin Pop.”\n\nSince then, she has also released several very successful singles and provided the soundtrack for some of Mexico’s most popular telenovelas. Her second album, Utopia, made platinum and won her two Latin Grammy nominations.\n\n4. Lola Flores\n\nBorn María Dolores Flores Ruiz, Lola Flores was one of the most famous singers and actresses of her time.\n\nShe had a strong personality and used it to her advantage, in a time when women weren’t given many options. Eventually, Flores became the matriarch of a dynasty of well-known Spanish musicians.\n\nFlores started performing young and was soon spotted by a Spanish film director. After that, Flores’s career took off and she starred in over 35 Spanish films. Most of these films depicted the Andalusian culture, and their popularity brought the culture into the limelight.\n\nLola Flores was a pioneer in music, dance, and film. She paved the way for other Spanish dancers and singers, including her daughters, to rise to fame.\n\n5. Melody\n\nMelodia Ruiz Gutiérrez, better known as Melody, has been a famous Spanish singer since the age of 10.\n\nIn 2001, she released “El Baile Del Gorilla,” which became one of the biggest hits of the year. Since then, Melody has released six different albums, varying from dance music to hip-hop.\n\nMelody has been on Spanish reality television, participated in singing contests, and released multiple singles in addition to her albums. She has been nominated for two Latin Grammys and continues to release music and stay active on social media.\n\n6. Rosario Flores\n\nFollowing in the footsteps of her famous mother, Rosario Flores is another well-known female Spanish singer who made a made for herself. She is one of Lola Flores’s daughters, and she inherited her mother’s musical talent and strong personality.\n\nFlores was born in Madrid in 1963 and was introduced to music through her mother. She has released albums in various genres, including jazz, flamenco, rock, and bossa nova music.\n\nShe has also won two Latin Grammys and has been nominated for seven altogether. Throughout her career, Flores has released 12 albums.\n\nHer sister Lolita and her brother Antonio were also part of the musical dynasty of the Flores family.\n\n7. Natalia Jiminez\n\nNatalia Altea Jiménez Sarmento, simply known as Natalia Jiminez, is one of the greatest female Spanish singers working today.\n\nJiminez started performing at age 15, busking near the subway lines of her native Madrid. Her big break came when Sony offered her a deal, allowing her to join a singing group.\n\nAfter becoming the lead singer of a band for eight years, Jiminez released her first solo album in 2011. Since then, she’s jumped to fame, winning multiple Latin Grammys and Grammys.\n\nJiminez has worked with some of the biggest names in Spanish music, from Marc Anthony to Ricky Martin.\n\n8. Rosalia\n\nRosalia Vila Tobella, known internationally as Rosalia, has reached fame for her collaborations with American artists like Bad Bunny and Travis Scott. However, she is a worthy musician in her own right, having graduated with honors from Catalonia College of Music.\n\nRosalia rose to fame with her first album, Los Ángeles, a collaboration with Spanish musician Raul Refree. She is famous for flamenco pop, and her Urbano music has become internationally famous with a reggae-based track.\n\nShe continues to release albums and just recently put out her third solo album in March of 2022.\n\n9. Marta Sanchez\n\nThe daughter of opera singer Antonio Sánchez Camporro, Marta Sanchez was one of the most popular Spanish female singers of the 1980s.\n\nAfter being discovered and asked to join the Spanish pop band, Ole Ole, Sanchez rose to stardom and became a national sweetheart. Not soon after, Sanchez decided to leave the band and pursue a solo career.\n\nThanks to her success with Ole Ole, her first solo album had three incredibly popular hits: “Desesperada,” “Tal Vez,” and “De Mujer A Mujer.” She hit the top ten in Spain and Latin America, and her solo career took off.\n\nSince then, Sanchez has collaborated with artists like Sting and DJ Sammy. She’s recorded a song for a Quentin Tarantino movie, released several more albums, and remains popular to this day.\n\n10. Lolita Flores\n\nBorn from a family of musicians, Lolita Flores is the younger sister of Spanish singer Rosario Flores and the daughter of yet another famous singer Lola Flores. With her brother, singer Antonio Flores, she completes the Flores family dynasty.\n\nWhile she has not been as prolific as her mother and sister, Flores has created her own musical and acting legacy. Many of Flores’ albums accompany her telenovelas and movies. Some of these songs include “Si La Vida Son Dos Días,” “Sarandonga,” and “Lo Voy A Dividir.”\n\nIn 2002, she even won a Goya award for Best New Actress and wrote some songs on the soundtrack.\n\nHer daughter, Elena, carries on the tradition and is also a Spanish actress.\n\n11. Montserrat Caballe\n\nOf course, not everyone on this list is famous for being a Spanish pop star. Montserrat Caballe is one of the most famous female opera singers of all time, and her specialty was opera.\n\nCaballe was born in Barcelona and rose to fame as a Verdi performer. She was already a famous soprano when asked to perform the 1992 Olympic theme, “Barcelona,” with superstar Freddie Mercury.\n\nCaballe won multiple awards and Grammys throughout her career. By the time of her death in 2018, she was proclaimed one of the greatest singers in Spanish history. Her voice remains a legacy for Spain and the entire world.\n\n12. Isabel Pantoja\n\nBorn to a family of artists in Seville, Spain, Isabel Pantoja is another big name in the Spanish music industry.\n\nShe began singing early in her life. By age 7, she was performing with her cousins, and at age 17, she released her first song. From there, her fame only increased, and she is now known in Spain as “La Pantoja.”\n\nPantoja rejuvenated a dying Spanish music genre called “Copia.” Focused on stories of marginalized characters and love gone wrong, these ballads represent the less-talked-about side of Spanish culture.\n\nBecause of her popularity, Pantoja has become an icon of Copia and Spanish pop. She paved the way for younger female artists to sing Copia and has released more than a dozen albums over the years.\n\n13. Monica Naranjo\n\nHaving one of the most powerful vocals in both Spain and Latin America, Monica Naranjo knew from a very early age that she loved music.\n\nShe was gifted with a voice recorder at age 14 and enrolled in music school. From that moment on, Naranjo started composing and recording her songs.\n\nThis talent didn’t go to waste, because when she was just 20 years old, Naranjo released her first album. It was a hit in Mexico, featuring songs that ranked on the charts such as “Fuego De Pasión,” “El Amor Coloca,” and “Sola.”\n\nThis eventually enabled her to release more albums that met commercial success. Palabra de Mujer, her second album, also became popular not just in Spain but also in North America, cementing Naranjo’s fame.\n\nMonica Naranjo is still working and has collaborated with famous singers such as Luciano Pavarotti and Mina Mazzini.\n\n14. Bebe\n\nMaria Nieves Rebolledo Vila is better known by her stage name, Bebe. Born in Valencia, Spain, Bebe’s parents were folk singers her entire childhood. She follows in her parents’ legacy but puts her spin on it with her Latin pop music.\n\nBebe started singing early and has released two albums and multiple singles. She’s been nominated for a Grammy and won a Latin Grammy.\n\nHer two most famous solos “Malo” and “Ella” are what brought her from a local celebrity to an international star.\n\nBebe’s two albums came several years apart due to her intentional break. She wanted to focus on touring and promoting her album well before releasing a new one.\n\n15. Raquel del Rosario\n\nKnown as the lead singer for the Spanish band El Sueño de Morfeo, Raquel del Rosario didn’t get her start by knowing anyone famous.\n\nInstead, she was a self-taught musician, writing her songs by age 14. When she was 17, she met professional singer David Feito and joined his group. It was this move that vaulted Rosario into fame and made her a household name in Spain.\n\nAlthough Rosario had her start, she grew even more famous when she competed in several band competitions and reality singing competitions. She is still a member of the band El Sueño de Morfeo as of this writing.\n\n16. Edurne\n\nEdurne García Almagro, more well-known as simply Edurne, is a Spanish pop and dance singer who got her start by singing in televised competitions.\n\nShe was a child actress on soap operas and telenovelas throughout her youth and auditioned for multiple television shows. She didn’t start a musical career until 2006.\n\nEdurne took part in the Eurovision Song Contest in 2015, representing Spain. Her solo albums have done pretty well in her home country and abroad, with her first single “Despierta” becoming more popular in Mexico than it was in Spain.\n\nEdurne has released 7 albums to date and continues to make music and tour.\n\n17. Aitana\n\nThe youngest singer on this list, Aitana Ocaña Morales came to fame through a television singing contest. More known simply as Aitana, she was the runner-up, but her song “Lo Malo” became a number one hit in Spain for several weeks.\n\n“Lo Malo” was not the only one of Aitana’s songs to hit #1. Her next hit, “Telefono” broke many records and was the #1 song streamed in Spain in 2018.\n\nAitana continues to release music through her contract with Universal Music. Her most recent album has included the top five singles on the charts.\n\n18. Carmen Sevilla\n\nA trailblazer for women in film and on stage, María del Carmen García Galisteo is more popularly known as Carmen Sevilla.\n\nShe was one of the most popular Spanish actresses and female singers in the 1960s and is the image of a classic starlet. Her career has spanned movies, television, stage shows, dancing, and of course, singing. Sevilla has truly done it all in her long career.\n\nAlthough Sevilla is mostly famous for acting, she used her television and film career as a springboard for dancing and singing. The musical films she acted in were part of how Sevilla was able to release her records.\n\nThrough this fame, she released several records, toured, and performed on live television many times.\n\n19. Bad Gyal\n\nBorn Alba Farelo I Solé, Bad Gyal has chosen a stage name that reflects her anti-establishment, pop-trap music style. She became famous after releasing a cover of Rihanna’s “Work” in her native language of Catalan.\n\nSince then, Bad Gyal has become a fixture in the hip-hop, EDM, and dance hall scene. Her catchy tunes and danceable beats make her music popular in clubs and dance halls all over Spain.\n\nShe does more than write music and perform it; Bad Gyal is also an established DJ and model.\n\nFinal Thoughts On Our List Of Popular Spanish Female Singers\n\nFrom opera to hip-hop, these women have risen to fame because of their musical talent. The younger generation builds off the hard work and trailblazing of the older generation to create a lasting legacy of Spanish female musicians.\n\nIt’s exciting to see what talent will emerge next!"}, {"url": "https://www.allmusic.com/artist/sara-montiel-mn0000249063/credits", "page_content": "Credits Sara Montiel Follow Artist +\n\nTalented actress and popular music singer Sara Montiel (born Maria Antonia Alejandra Abad Fernández), better known as Sarita Montiel, became one of the first sex symbols from Spain to attract Hollywood's…\n\nRead Full Biography"}, {"url": "https://alchetron.com/Sara-Montiel", "page_content": "María Antonia Abad Fernández (10 March 1928 – 8 April 2013) known professionally as Sara Montiel (also Sarita Montiel or Saritísima) was a Spanish singer and actress.\n\nMontiel was born in Campo de Criptana in the region of Castile–La Mancha in 1928. She worked in Europe, Latin America and United States. Her films The Last Torch Song and The Violet Seller netted the highest gross revenues ever recorded for films made in the Spanish-speaking movie industry during the 1950s/60s. Montiel's film Variety was banned in Beijing in 1973. She played the role of Antonia, the niece of Don Quixote, in the 1947 Spanish film version of Cervantes's great novel.\n\nShe was portrayed in the Pedro Almodóvar film Bad Education by a male actor in drag (Gael García Bernal) as the cross-dressing character Zahara, and a film clip from one of her movies was used, as well.\n\nActing career\n\nMontiel started in movies at 15 in her native Spain where she filmed her first movie playing an Islamic princess in the 1948 film Madness for Love, released in the U.S. as The Mad Queen. Later worked in Mexico, starring in a dozen films in less than five years. Hollywood came calling afterwards, and she was introduced to United States moviegoers in the film Vera Cruz (1954) co-starring Gary Cooper and Burt Lancaster, and directed by Robert Aldrich. She was offered the standard seven-year contract at Columbia Pictures, which she refused, afraid of Hollywood's typecasting policies for Hispanics. Instead she freelanced at Warner Bros. with Mario Lanza and Joan Fontaine in Serenade (1956), directed by Anthony Mann, and at RKO in Samuel Fuller's Run of the Arrow (1957), opposite Rod Steiger and Charles Bronson.\n\nFrom The Last Torch Song (1957) on she combined filming, recording songs in five languages and performing live. Almost all of her films earned high box office results. Among the films during the 1960s and early 1970s were The Violet Seller (1958), Carmen, la de Ronda (1959), Mi Último Tango (1960), Pecado de Amor (1961), La Bella Lola (a 1962 version of Camille), Casablanca, Nid d'espions (1963), Samba (1964), La Femme Perdue (1966), Tuset Street (1967), Esa Mujer (1969), Varietes (1971) and others. By then she had become dissatisfied with the movie industry when producers started offering her erotic roles in comedy films. In 1974 Montiel announced her retirement from movies but continued performing live, recording and starring on her own variety television shows in Spain.\n\nIn November 2009, Alaska from the Spanish pop group Fangoria invited Montiel to record a track sharing vocals with her for the re-release of the band's album Absolutamente. They recorded the title track \"Absolutamente\" as a duet. The music video for the song was released in early 2010. She had no plans to retire, and, in May 2011, after almost 40 years without making a movie, she accepted to perform in a feature film directed by Óscar Parra de Carrizosa. The film title is Abrázame and was shot on location in La Mancha.\n\nPersonal information\n\nMontiel was born María Antonia Abad Fernández (complete name María Antonia Alejandra Vicenta Elpidia Isidora Abad Fernández) in 1928 in Campo de Criptana (Ciudad Real), Spain. She entered films after winning a beauty and talent contest at age 15. In her first movie she was credited as \"María Alejandra\" a shortened version of her real name. For her next film she changed her name to Sara, after her grandmother, and Montiel after the Montiel fields in the Castile–La Mancha region of her birth. She has been married four times:\n\nAnthony Mann (American actor, film director); 1957-1963 (divorced)\n\nJosé Vicente Ramírez Olalla (attorney); 1964-1978 (annulled)\n\nJosé Tous Barberán (attorney, journalist); 1979-1992 (Tous's death); this union produced two adopted children: Thais (born 1979) and José Zeus (born 1983)\n\nAntonio Hernández (Cuban videotape operator); 2002-2005 (divorced)\n\nIn 2000, Montiel published her autobiography Memories: To Live Is A Pleasure, an instant best seller with ten editions to date. A sequel Sara and Sex followed in 2003. In these books Montiel revealed other relationships in her past including one-night stands with writer Ernest Hemingway as well as actor James Dean. She also claimed a long-term affair in the 1940s with playwright Miguel Mihura and mentioned that science wizard Severo Ochoa, a Nobel Prize winner, was the true love of her life.\n\nMontiel died in 2013 at her home in Madrid at the age of 85 from congestive heart failure.\n\nDiscography\n\nSara Montiel en Mexico\n\nCanciones de la Película \"El Último Cuple\" - London 5409\n\nLa Violetera - Columbia - EX 5056\n\nBaile con Sara Montiel\n\nCarmen la de Ronda - Columbia EX 5020\n\nBesos de Fuego\n\nMi Último Tango - Columbia EX 5048\n\nEl Tango\n\nPecado de Amor - Columbia EX 5092\n\nLa Bella Lola\n\nNoches De Casablanca\n\nLa Dama de Beirut\n\nCanta Sarita Montiel\n\nEsa Mujer\n\nSara\n\nVarietés\n\nSara... Hoy\n\nSaritisima\n\nAnoche con Sara\n\nPurisimo Sara\n\nSara De Cine\n\nSara A Flor de Piel\n\nAmados Mios\n\nTodas Las Noches A Las Once\n\nSara Montiel La Diva\n\nSara Montiel La Leyenda\n\nBesame - Columbia EX 5077 (1962)\n\nSongs From The Film Besame - Columbia EX 5135\n\nAwards\n\n2012 - \"Reina de la Belleza Honorífica\"."}, {"url": "https://everything.explained.today/Sara_Montiel/", "page_content": "Sara Montiel Explained\n\nMaría Antonia Abad Fernández MML (10 March 1928 – 8 April 2013), known professionally as Sara Montiel, also Sarita Montiel, was a Spanish actress and singer, who also held Mexican citizenship since 1951.[1] [2] [3] She began her career in the 1940s and became the most internationally popular and highest paid star of Spanish cinema in the 1960s. She appeared in nearly fifty films and recorded around 500 songs in five different languages.\n\nMontiel was born in Campo de Criptana in the region of La Mancha in 1928. She began her acting career in Spain starring in films such as Don Quixote (1947) and Madness for Love (1948). She moved to Mexico where she starred in films such as Women's Prison (1951) and Red Fury (1951). She then moved to the United States and worked in three Hollywood English-language films Vera Cruz (1954), Serenade (1956) and Run of the Arrow (1957). She returned to Spain to star in the musical films The Last Torch Song (1957) and The Violet Seller (1958). These two films netted the highest gross revenues ever recorded internationally for films made in the Spanish-speaking movie industry during the 1950s/60s and made her immensely popular.[4] She then established herself also as a singer thanks to the songs she performed in her films and combined filming new musical films, recording songs and performing live.\n\nThroughout her career, Montiel's personal life was the subject of constant media attention in the Spanish-speaking world. She was married four times and adopted two children.\n\nCareer\n\nMontiel started in movies at sixteen[5] in her native Spain, where she appeared in a secondary role in her first movie, Te quiero para mí (I want you for myself) in 1944,[6] immediately followed by a leading role in Empezó en boda (It Began with a Wedding) also in 1944.[7] [8] They were followed by roles in films such as Mariona Rebull (1946), Don Quixote (1947) and Madness for Love (1948). In April 1950, accompanied by her mother, she moved to Mexico and starred in a dozen films there in less than five years, including Women's Prison (1951), Red Fury (1951) and Cinnamon Skin (1953).[9] Hollywood came calling afterwards, and she was introduced to United States moviegoers in the film Vera Cruz (1954), directed by Robert Aldrich. She was offered the standard seven-year contract at Columbia Pictures, which she refused, afraid of Hollywood's typecasting policies for Hispanics. Instead she freelanced at Warner Bros. in Serenade (1956), directed by Anthony Mann, whom she married in 1957, and at RKO in Samuel Fuller's Run of the Arrow (1957).\n\nBetween November 1956 and January 1957, before filming Run of the Arrow, she filmed in Barcelona the musical film The Last Torch Song during a vacation in Spain and as a deference to its director Juan de Orduña. The film, that was filmed with a very low budget, became unexpectedly a worldwide megahit. Initially, the songs in the film were going to be sung by a professional singer who would dub Montiel, but due to the low budget, she eventually sang the songs herself.[10] The film soundtrack album also became a hit.\n\nFollowing this success, in June 1957 she signed with producer Benito Perojo a lavish contract to make four films in three years,[11] being the first of them The Violet Seller, a 1958 large-budget international co-production musical film.[12] The economic agreement was ten million pesetas (US$240,000 as of 1957) for four films,[13] which means that she was to receive 2.5 million pesetas (US$60,000) per film, making her the highest-paid Spanish star at a time when the highest-paid stars were netting one million pesetas (US$24,000) per film.[14] The success of The Violet Seller surpassed that of The Last Torch Song, and in a contractual dispute for the next film, A Girl Against Napoleon (1959), the agreement was improved on her benefit.[15] She also signed a contract with Hispavox to record and release the soundtrack albums of her films for which she netted the 10% of the records sale as royalties.[16] The Violet Seller soundtrack album, the first with them, topped sales in Spain and in Latin America and, in July 1959, Hispavox served a Golden Disk award to her for the number of records sold there.[17]\n\nAll this made her a film and singing international superstar.[18] Almost all of her next films earned high box office results and she combined filming, recording songs and performing live. She was the highest paid star of Spanish cinema, but many years later, she began to say that she had been paid more than US$1 million for each film,[19] and the press widely spread it, but this amount is far from what was published back then. Among the next films during the 1960s and early 1970s were My Last Tango (1960), Pecado de amor (1961), The Lovely Lola (a 1962 version of La Dame aux Camélias), Casablanca, Nest of Spies (1963), Samba (1964), The Lost Woman (1966), Tuset Street (1967), Esa Mujer (1969) and Variety (1971). The film Variety was banned in Beijing in 1973.\n\nIn 1974, she announced her retirement from movies, as she become dissatisfied with the movie industry and the overt nudity in films, but continued performing live, recording and starring on her own variety television shows in Spain. In 2002 she was the advertising image of the MTV Europe Music Awards held in Barcelona.[20] [21] [22]\n\nIn November 2009, singer Alaska who forms the Spanish pop group Fangoria with Nacho Canut, invited Montiel to record a track sharing vocals with her for the re-release of the band's album Absolutamente. They recorded the title track \"Absolutamente\" as a duet. The music video for the song was released on 18 December 2009. Well into her eighties, she had no plans to retire, and continued working in various projects. In May 2011, after almost forty years without making a movie, she performed in a feature film directed by Óscar Parra de Carrizosa. The film title is Abrázame and was shot on location in La Mancha.\n\nShe is considered \"one of the most important actresses in the history of Spain\", and has been described by Spain's press as a \"myth of Spanish cinema.\"[23] She has also been characterized as \"the most beautiful woman of twentieth century Spain.\"[24] She has also been called a \"sexual, feminist, and gay icon for Francoist Spain.\"[25]\n\nPersonal information\n\nMontiel, whose complete name was María Antonia Alejandra Vicenta Elpidia Isidora Abad Fernández, was born in 1928 in Campo de Criptana (Ciudad Real), Spain. She entered films after winning a talent contest at age fifteen.[26] In her first movie, she was credited as \"María Alejandra\" a shortened version of her real name. For her next film, she changed her name to Sara, after her grandmother, and Montiel after the Montiel fields in La Mancha region of her birth. It was in Mexico where she first learned how to read and write, taught by the poet León Felipe, and in 1951 she acquired Mexican dual nationality. She was married four times,[27] and was ex-communicated by the Catholic Church in Spain for the civil-wedding ceremony of her first marriage:\n\nAnthony Mann (American actor, film director); 1957–63 (divorced)\n\nJosé Vicente Ramírez Olalla (attorney); 1964–70 (divorced)\n\nJosé Tous Barberán (attorney, journalist); 1979–92 (Tous's death); this union produced two adopted children: Thais (born 1979) and José Zeus (born 1983) [28]\n\nAntonio Hernández (Cuban videotape operator); 2002–05 (divorced)\n\nIn 2000, Montiel published her autobiography Memories: To Live Is a Pleasure, an instant best seller with ten editions to date. A sequel Sara and Sex followed in 2003. In these books, she revealed other relationships in her past, including one-night stands with writer Ernest Hemingway as well as actor James Dean.[29] She also claimed a long-term affair in the 1940s with playwright Miguel Mihura and mentioned that science wizard Severo Ochoa, a Nobel Prize winner, was the true love of her life.[30]\n\nIn her later years, she became an iconic figure to the gay community, and noted \"Cuando voy a actuar a alguna ciudad de EE UU allí están todos los gays de la ciudad\" (Whenever I perform in any city in the US, all the gays from that city show up).[31] Montiel died in 2013 at her home in Madrid at the age of eighty-five from congestive heart failure,[32] [26] and was buried in the San Justo Cemetery in Madrid.\n\nFilmography\n\nDiscography\n\nSara Montiel en Mexico\n\nCanciones de la Película \"El Último Cuple\" - Spain: Columbia. UK: London 5409\n\n- Spain: Columbia. UK: London 5409 La Violetera - Spain: Hispavox. US: Columbia - EX 5056\n\n- Spain: Hispavox. US: Columbia - EX 5056 Baile con Sara Montiel\n\nCarmen la de Ronda - Spain: Hispavox. US: Columbia EX 5020\n\n- Spain: Hispavox. US: Columbia EX 5020 Besos de Fuego\n\nMi Último Tango - Spain: Hispavox. US: Columbia EX 5048\n\n- Spain: Hispavox. US: Columbia EX 5048 El Tango\n\nPecado de Amor - Spain: Hispavox. US: Columbia EX 5092\n\n- Spain: Hispavox. US: Columbia EX 5092 La Bella Lola\n\nNoches De Casablanca\n\nSamba\n\nLa Dama de Beirut\n\nCanta Sarita Montiel\n\nEsa Mujer\n\nSara\n\nVarietés\n\nSara... Hoy\n\nSaritisima\n\nAnoche con Sara\n\nPurisimo Sara\n\nSara De Cine\n\nSara A Flor de Piel\n\nAmados Mios\n\nTodas Las Noches A Las Once\n\nSara Montiel La Diva\n\nSara Montiel La Leyenda\n\nBesame - Spain: Hispavox. US: Columbia EX 5077 (1962)\n\n- Spain: Hispavox. US: Columbia EX 5077 (1962) Songs From The Film Besame - Spain: Hispavox. US: Columbia EX 5135\n\nAwards\n\nYear Award Category Work Result Ref 1957 Circle of Cinematographic Writers Awards Best Main Actress The Last Torch Song [33] 1958 Circle of Cinematographic Writers Awards Best Main Actress The Violet Seller [34] 1959 National Syndicate of Spectacle Awards Best Actress The Violet Seller [35] 1999 Circle of Cinematographic Writers Awards Tribute Award - [36]\n\nHonours\n\nLegacy\n\nMuseum\n\nThe Sara Montiel Museum, opened in 1991, is a museum in Campo de Criptana dedicated to her. It is housed in a sixteenth century windmill and displays photographs, wardrobe and personal belongings of the actress as well as posters of her films. In May 2021 it reopened after undergoing a restoration and modernization.[41]\n\nIn popular culture\n\nCorreos, the Spanish postal service, issued in 2014 a sheet of stamps in tribute to three recently deceased famous Spanish cinema artists: Sara Montiel, Alfredo Landa and Manolo Escobar. The stamp that pays tribute to Montiel depicts her in a scene from The Violet Seller.[42]\n\nShe was portrayed in the Pedro Almodóvar film Bad Education (2004) by a male actor in drag (Gael García Bernal) as the cross-dressing character Zahara, and a film clip from one of her movies was used, as well.\n\nNotes\n\na. In Spain, ten million pesetas (€60,101) in 1957, adjusted for inflation using the consumer price index, in 2022 would be approximately €3 million,[43] while its purchasing power would be €10–16 million.[44]\n\nb. The exchange rate in June 1957 was of forty-two pesetas to the United States dollar.[45]\n\nExternal links\n\nNotes and References"}, {"url": "https://www.howold.co/person/sara-montiel/biography", "page_content": "Sara Montiel Biography\n\nSpanish-Mexican actress and singer (1928–2013)In this Spanish name, the first or paternal surname isand the second or maternal family name is\n\nMaría Antonia Abad Fernández MML (10 March 1928 – 8 April 2013), known professionally as Sara Montiel, also Sarita Montiel, was a Spanish actress and singer. She began her career in the 1940s and became the most internationally popular and highest paid star of Spanish cinema in the 1960s. She appeared in nearly fifty films and recorded around 500 songs in five different languages.\n\nMontiel was born in Campo de Criptana in the region of La Mancha in 1928. She began her acting career in Spain starring in films such as Don Quixote (1947) and Madness for Love (1948). She moved to Mexico where she starred in films such as Women's Prison (1951) and Red Fury (1951). She then moved to the United States and worked in three Hollywood English-language films Vera Cruz (1954), Serenade (1956) and Run of the Arrow (1957). She returned to Spain to star in the musical films The Last Torch Song (1957) and The Violet Seller (1958). These two films netted the highest gross revenues ever recorded internationally for films made in the Spanish-speaking movie industry during the 1950s/60s and made her immensely popular. She then established herself also as a singer thanks to the songs she performed in her films and combined filming new musical films, recording songs and performing live.\n\nThroughout her career, Montiel's personal life was the subject of constant media attention in the Spanish-speaking world. She was married four times and adopted two children.\n\nCareer\n\nMontiel started in movies at sixteen in her native Spain, where she appeared in a secondary role in her first movie, Te quiero para mí (I want you for myself) in 1944, immediately followed by a leading role in Empezó en boda (It Began with a Wedding) also in 1944. They were followed by roles in films such as Mariona Rebull (1946), Don Quixote (1947) and Madness for Love (1948). In April 1950, accompanied by her mother, she moved to Mexico and starred in a dozen films there in less than five years, including Women's Prison (1951), Red Fury (1951) and Cinnamon Skin (1953).\n\nSara Montiel attending the San Sebastián International Film Week in 1956.\n\nHollywood came calling afterwards, and she was introduced to United States moviegoers in the film Vera Cruz (1954), directed by Robert Aldrich. She was offered the standard seven-year contract at Columbia Pictures, which she refused, afraid of Hollywood's typecasting policies for Hispanics. Instead she freelanced at Warner Bros. in Serenade (1956), directed by Anthony Mann, whom she married in 1957, and at RKO in Samuel Fuller's Run of the Arrow (1957).\n\nBetween November 1956 and January 1957, before filming Run of the Arrow, she filmed in Barcelona the musical film The Last Torch Song during a vacation in Spain and as a deference to its director Juan de Orduña. The film, that was filmed with a very low budget, became unexpectedly a worldwide megahit. Initially, the songs in the film were going to be sung by a professional singer who would dub Montiel, but due to the low budget, she eventually sang the songs herself. The film soundtrack album also became a hit.\n\nFollowing this success, in June 1957 she signed with producer Benito Perojo a lavish contract to make four films in three years, being the first of them The Violet Seller, a 1958 large-budget international co-production musical film. The economic agreement was ten million pesetas (US$240,000 as of 1957) for four films, which means that she was to receive 2.5 million pesetas (US$60,000) per film, making her the highest-paid Spanish star at a time when the highest-paid stars were netting one million pesetas (US$24,000) per film. The success of The Violet Seller surp*ed that of The Last Torch Song, and in a contractual dispute for the next film, A Girl Against Napoleon (1959), the agreement was improved by securing for her the twenty per cent of the producer's net revenue. She also signed a contract with Hispavox to record and release the soundtrack albums of her films for which she netted the ten per cent of the records sale as royalties. The Violet Seller soundtrack album, the first with them, topped sales in Spain and in Latin America and, in July 1959, Hispavox served a Golden Disk award to her for the number of records sold there.\n\nAll this made her a film and singing international superstar. Almost all of her next films earned high box office results and she combined filming, recording songs and performing live. She was the highest paid star of Spanish cinema, and many years later, she began to say that she had been paid more than US$1 million for each of these films, something that the press widely reported as the actual figure. Among the next films during the 1960s and early 1970s were My Last Tango (1960), Pecado de amor (1961), The Lovely Lola (a 1962 version of La Dame aux Camélias), Casablanca, Nest of Spies (1963), Samba (1964), The Lost Woman (1966), Tuset Street (1967), Esa Mujer (1969) and Variety (1971). The film Variety was banned in Beijing in 1973.\n\nIn 1974, she announced her retirement from movies, as she become dissatisfied with the movie industry and the overt nudity in films, but continued performing live, recording and starring on her own variety television shows in Spain. In 2002 she was the advertising image of the MTV Europe Music Awards held in Barcelona.\n\nIn November 2009, singer Alaska who forms the Spanish pop group Fangoria with Nacho Canut, invited Montiel to record a track sharing vocals with her for the re-release of the band's album Absolutamente. They recorded the *le track \"Absolutamente\" as a duet. The music video for the song was released on 18 December 2009. Well into her eighties, she had no plans to retire, and continued working in various projects. In May 2011, after almost forty years without making a movie, she performed in a feature film directed by Óscar Parra de Carrizosa. The film *le is Abrázame and was shot on location in La Mancha.\n\nShe is considered \"one of the most important actresses in the history of Spain\", and has been described by Spain's press as a \"myth of Spanish cinema.\" She has also been characterized as \"the most beautiful woman of twentieth century Spain.\" She has also been called a \"sexual, feminist, and gay icon for Francoist Spain.\"\n\nPersonal information\n\nMonument to Montiel in Campo de Criptana.\n\nMontiel, whose complete name was María Antonia Alejandra Vicenta Elpidia Isidora Abad Fernández, was born in 1928 in Campo de Criptana (Ciudad Real), Spain. She entered films after winning a talent contest at age fifteen. In her first movie, she was credited as \"María Alejandra\" a shortened version of her real name. For her next film, she changed her name to Sara, after her grandmother, and Montiel after the Montiel fields in La Mancha region of her birth. It was in Mexico where she first learned how to read and write, taught by the poet León Felipe, and in 1951 she acquired Mexican dual nationality. She was married four times, and was ex-communicated by the Catholic Church in Spain for the civil-wedding ceremony of her first marriage:\n\nAnthony Mann (American actor, film director); 1957–63 (divorced)\n\nJosé Vicente Ramírez Olalla (attorney); 1964–70 (divorced)\n\nJosé Tous Barberán (attorney, journalist); 1979–92 (Tous's death); this union produced two adopted children: Thais (born 1979) and José Zeus (born 1983)\n\nAntonio Hernández (Cuban videotape operator); 2002–05 (divorced)\n\nIn 2000, Montiel published her autobiography Memories: To Live Is a Pleasure, an instant best seller with ten editions to date. A sequel Sara and Sex followed in 2003. In these books, she revealed other relationships in her past, including one-night stands with writer Ernest Hemingway as well as actor James Dean. She also claimed a long-term affair in the 1940s with playwright Miguel Mihura and mentioned that science wizard Severo Ochoa, a Nobel Prize winner, was the true love of her life.\n\nIn her later years, she became an iconic figure to the gay community, and noted \"Cuando voy a actuar a alguna ciudad de EE UU allí están todos los gays de la ciudad\" (Whenever I perform in any city in the US, all the gays from that city show up). Montiel died in 2013 at her home in Madrid at the age of eighty-five from congestive heart failure, and was buried in the San Justo Cemetery in Madrid.\n\nFilmography\n\nDiscography\n\nSara Montiel en Mexico\n\nCanciones de la Película \"El Último Cuple\" - Spain: Columbia. UK: London 5409\n\n- Spain: Columbia. UK: London 5409 La Violetera - Spain: Hispavox. US: Columbia - EX 5056\n\n- Spain: Hispavox. US: Columbia - EX 5056 Baile con Sara Montiel\n\nCarmen la de Ronda - Spain: Hispavox. US: Columbia EX 5020\n\n- Spain: Hispavox. US: Columbia EX 5020 Besos de Fuego\n\nMi Último Tango - Spain: Hispavox. US: Columbia EX 5048\n\n- Spain: Hispavox. US: Columbia EX 5048 El Tango\n\nPecado de Amor - Spain: Hispavox. US: Columbia EX 5092\n\n- Spain: Hispavox. US: Columbia EX 5092 La Bella Lola\n\nNoches De Casablanca\n\nSamba\n\nLa Dama de Beirut\n\nCanta Sarita Montiel\n\nEsa Mujer\n\nSara\n\nVarietés\n\nSara... Hoy\n\nSaritisima\n\nAnoche con Sara\n\nPurisimo Sara\n\nSara De Cine\n\nSara A Flor de Piel\n\nAmados Mios\n\nTodas Las Noches A Las Once\n\nSara Montiel La Diva\n\nSara Montiel La Leyenda\n\nBesame - Spain: Hispavox. US: Columbia EX 5077 (1962)\n\n- Spain: Hispavox. US: Columbia EX 5077 (1962) Songs From The Film Besame - Spain: Hispavox. US: Columbia EX 5135\n\nAwards\n\nHonours\n\n1997 - Gold Medal of the Academy of Cinematographic Arts and Sciences of Spain.\n\n2001 - Rita Moreno HOLA Award for Excellence.\n\n2008 - Gold Medal of Merit in Labour (Kingdom of Spain, 5 December 2008).\n\n2012 - \"Reina de la Belleza Honorífica\".\n\nLegacy\n\nMuseum\n\nThe Sara Montiel Museum, opened in 1991, is a museum in Campo de Criptana dedicated to her. It is housed in a sixteenth century windmill and displays photographs, wardrobe and personal belongings of the actress as well as posters of her films. In May 2021 it reopened after undergoing a restoration and modernization.\n\nIn popular culture\n\nCorreos, the Spanish postal service, issued in 2014 a sheet of stamps in tribute to three recently deceased famous Spanish cinema artists: Sara Montiel, Alfredo Landa and Manolo Escobar. The stamp that pays tribute to Montiel depicts her in a scene from The Violet Seller.\n\nShe was portrayed in the Pedro Almodóvar film Bad Education (2004) by a male actor in drag (Gael García Bernal) as the cross-dressing character Zahara, and a film clip from one of her movies was used, as well.\n\nNotes\n\nReferences\n\nExternal links\n\nSara Montiel at IMDb\n\nSara Montiel's InfoMontiel USA\n\nVideo of Sara Montiel singing \"La Violetera\"\n\na. In Spain, ten million pesetas (€60,101) in 1957, adjusted for inflation using the consumer price index, in 2022 would be approximately €3 million, while its purchasing power would be €10–16 million.b. The exchange rate in June 1957 was of forty-two pesetas to the United States dollar."}, {"url": "https://infogalactic.com/info/Sara_Montiel", "page_content": "From Infogalactic: the planetary knowledge core\n\nSara Montiel (also Sarita Montiel or Saritísima; 10 March 1928 – 8 April 2013) was a Spanish singer and actress.[1] She was a naturalized citizen of Mexico.[1] Montiel was born in Campo de Criptana in the region of Castile–La Mancha in 1928 as María Antonia Abad (complete name María Antonia Alejandra Vicenta Elpidia Isidora Abad Fernández). After her work in Juan de Orduña's El Último Cuplé in 1957, Montiel worked in Europe and Latin America. Montiel's film Varietes was banned in Beijing in 1973. Her films El Último Cuple and La Violetera netted the highest gross revenues ever recorded for films made in the Spanish speaking movie industry during the 1950s/60s[citation needed]. She played the role of Antonia, the niece of Don Quixote, in the 1947 Spanish film version of Cervantes's great novel.\n\nShe was portrayed in the Pedro Almodóvar film Bad Education by a male actor in drag (Gael García Bernal) as the cross-dressing character Zahara, and a film clip from one of her movies was used as well.\n\nActing career\n\nMontiel started in movies at 15 in her native Spain where she filmed her first movie playing an Islamic princess in the 1948 film Locura de Amor, released in the US as The Mad Queen. Later worked in Mexico, starring in a dozen films in less than five years. Hollywood came calling afterwards, and she was introduced to United States moviegoers in the film Vera Cruz (1954) co-starring with Gary Cooper and Burt Lancaster, and directed by Robert Aldrich. She was offered the standard seven-year contract at Columbia Pictures, which she refused, afraid of Hollywood's typecasting policies for Hispanics[citation needed]. Instead she free-lanced at Warner Bros. with Mario Lanza and Joan Fontaine in Serenade (1956), directed by Anthony Mann, and at RKO in Samuel Fuller's Run of the Arrow (1957), opposite Rod Steiger and Charles Bronson.\n\nFrom El Ultimo Cuple (1957) on she combined filming, recording songs in five languages and performing live. Among the films during the 1960s and early 1970s were La Violetera (1958), Carmen, la de Ronda (1959), Mi Ultimo Tango (1960), Pecado de Amor (1961), La Bella Lola (a 1962 version of Camille), Casablanca, Nid d'espions(1963), Samba (1964), La Femme Perdue (1966), Tuset Street (1967), Esa Mujer (1969), Varietes (1971) and others. By then she had become dissatisfied with the movie industry when producers started offering her roles in soft core porno films[citation needed]. In 1974 Montiel announced her retirement from movies but continued performing live, recording and starring on her own variety television shows in Spain.[2]\n\nIn November 2009, Alaska from the pop group Fangoria invited Montiel to record a track sharing vocals with her for the re-release of the band's album Absolutamente. They recorded the title track \"Absolutamente\" as a duet. The music video for the song was released in early 2010.[3] She had no plans to retire[citation needed], and, in May 2011, after almost 40 years without making a movie, she accepted to perform in a feature film directed by Óscar Parra de Carrizosa. The film title is Abrázame and was shot on location in La Mancha.\n\nPersonal information\n\nMontiel was born María Antonia Alejandra Abad Fernández in 1928 in Campo de Criptana[citation needed], Ciudad Real, Spain. She entered films after winning a beauty and talent contest at age 15[citation needed]. In her first movie she was credited as \"María Alejandra\" a shortened version of her real name. For her next film she changed her name to Sara, after her grandmother, and Montiel after the Montiel fields in the Castile–La Mancha region of her birth. She has been married four times[citation needed]:\n\nAnthony Mann (American actor, film director); 1957-1963 (divorced)\n\nJosé Vicente Ramírez Olalla (attorney); 1964-1978 (annulled)\n\nJosé Tous Barberán (attorney, journalist); 1979-1992 (Tous's death); this union produced two adopted children: Thais (born 1979) and José Zeus (born 1983) [4]\n\nAntonio Hernández (Cuban videotape operator); 2002-2005 (divorced)\n\nIn 2000, Montiel published her autobiography Memories: To Live Is A Pleasure, an instant best seller with ten editions to date. A sequel Sara and Sex followed in 2003. In these books Montiel revealed other relationships in her past including one-night stands with writer Ernest Hemingway as well as actor James Dean. She also claimed a long term affair in the 1940s with playwright Miguel Mihura and mentioned that science wizard Severo Ochoa, a Nobel Prize winner, was the true love of her life.\n\nDeath\n\nMontiel died in 2013 at her home in Madrid, Spain at the age of 85 from undisclosed causes[5]\n\nFilmography\n\nDiscography\n\nSara Montiel en Mexico\n\nCanciones de la Película \"El Último Cuple\" - London 5409\n\n- London 5409 La Violetera - Columbia - EX 5056\n\n- Columbia - EX 5056 Baile con Sara Montiel\n\nCarmen la de Ronda - Columbia EX 5020\n\n- Columbia EX 5020 Besos de Fuego\n\nMi Último Tango - Columbia EX 5048\n\n- Columbia EX 5048 El Tango\n\nPecado de Amor - Columbia EX 5092\n\n- Columbia EX 5092 La Bella Lola\n\nNoches De Casablanca\n\nSamba\n\nLa Dama de Beirut\n\nCanta Sarita Montiel\n\nEsa Mujer\n\nSara\n\nVarietés\n\nSara... Hoy\n\nSaritisima\n\nAnoche con Sara\n\nPurisimo Sara\n\nSara De Cine\n\nSara A Flor de Piel\n\nAmados Mios\n\nTodas Las Noches A Las Once\n\nSara Montiel La Diva\n\nSara Montiel La Leyenda\n\nBesame - Columbia EX 5077 (1962)\n\n- Columbia EX 5077 (1962) Songs From The Film Besame - Columbia EX 5135\n\nAwards\n\n2012 - \"Reina de la Belleza Honorífica\".[6]"}, {"url": "https://www.europopmusic.eu/Spain_pages/Montiel.html", "page_content": "I\n\nSara Montiel\n\nAbout:\n\n10 March 1928 - 8 april 2013\n\nSara Montiel (also Sarita Montiel or Saritísima) was born in Campo de Criptana in the region of New Castile in 1928 as María Antonia Abad (complete name María Antonia Alejandra Vicenta Elpidia Isidora Abad Fernández).\n\nMontiel started as an actress at 16 in Spanish movies where she filmed her first international success playing an Islamic princess in the 1948 film 'Locura de amor'. Later she conquered Mexico starring in a dozen films in less than five years. Hollywood came calling after and she was introduced to US moviegoers in the film 'Vera Cruz' (1954) co-starring with Gary Cooper and Burt Lancaster and directed by Robert Aldrich. She was offered the standard seven-year contract at Columbia Pictures which she quickly refused, afraid of Hollywood's typecasting policies for Hispanics. Instead she free-lanced at Warner Bros. with Mario Lanza and Joan Fontaine in 'Serenade' (1956) directed by Anthony Mann and at RKO in Samuel Fuller's 'Run of the arrow' (1957), opposite Rod Steiger and Charles Bronson.\n\nThat same year she married Anthony Mann but returned briefly to Spain to star in a low budget film musical 'El ultimo cuplé' as a favor to producer-director Juan de Orduña who had helped her career in the early days. In the movie she was the first woman to display a low cleavage openly in Spanish cinema at a time when even a low cut dress was not acceptable. The cover for the album of the same title was censored. This film made her unexpectedly the number one actress-singer of that year in Europe and Latin America and she accepted a multi-million dollar offer for more films and recordings in Europe. Fifteen films followed her Cuplé success, including 'La violetera' (1958), 'Mi ultimo tango' (1960), 'Noches de Casablanca' (a 1963 tribute to Hollywood's 'Casablanca'), 'Esa mujer' (1969) and 'Varietés' (1971). Her films 'El ultimo cuple' and 'La violetera' netted the highest gross revenues ever recorded for films made in the Spanish speaking movie industry during the 50s and 60s.\n\nMost of the movies were accompanied by a soundtrack album which also pushed her career as a singer. During these years she recorded over 30 albums and appeared on stage and television all over the world. In 1974 Montiel announced her retirement from movies and continued non-stop performing live, recording and starring on her own variety television shows in Spain. She continued at that pace well into the 1990s. In 2000 she released her autobiography Memories: 'To live is a pleasure' followed by a second book called 'Sara and sex', which highlighted her love life. In 2005 Montiel was portrayed in the Pedro Almodóvar film 'La mala educación' by actor Gael García Bernal as the character Zahara. In 2006 Montiel temporarily put aside her career in order to help her adopted son Zeus with his first recordings. Sarita died at the age of 85 on april 8, 2013.\n\nOn the web:\n\n- http://infomontiel.tripod.com/id17.htm\n\n- http://www.visitingsaramontiel.com\n\nIf you like this, you probably like... / european counterparts:\n\n\n\nWhat do we think:\n\nPR: Sarita Montiel is more actress than singer. But with an oeuvre of more than 30 albums since the late fifties, she is definitely one of Spain's most popular musical artists of the 20th century. And - whatever you may think of her - she still succeeds in claiming a spot in the limelights with her writings. Her material is mostly very traditional Hollywood-with-Spanish-lyrics and her singing is not tremendous. On the other hand, she sung a few beautiful songs that became international classics ('La violetra'). Her latest releases (eigthies & nineties) are over-the-top synthesiser disco albums, probably recorded for the gay-disco's and her die-hard fans.\n\nDB: Everyone who has seen Almodovár's 'La mala educación' will remember transvestite Sahara miming a warmblooded song in the microphone. Well, i do, and it was my first encounter with the music of Sarita, the singer Sahara is impersonating. While in Barcelona I tried to find as much of her orginal material i could lay my hands on including an autographed copy of Ulitmo Cuple (no, not the one with the revealing cover). Sarita made some great music but maybe suffers from some over confidence. Who else would record the track 'Supersara'.\n\nRecommended albums:\n\n♪♪♪ - El Último Cuple - 1957\n\n♪♪♪♪ - La Violetera - 1958\n\n♪♪♪ - Carmen la de Ronda - 1959\n\n♪♪ - Besos de Fuego - 1960\n\n♪♪ - Mi Último Tango - 1960\n\n♪♪♪ - Pecado de Amor - 1961\n\n♪♪ - La Bella Lola - 1962\n\n♪♪ - Noches De Casablanca - 1963\n\n♪♪ - Samba - 1964\n\n♪♪ - La Dama de Beirut - 1965\n\n♪♪♪ - Esa Mujer - 1970\n\nSara - 1971\n\nSara... Hoy - 1973\n\nSaritisima - 1977\n\nAnoche con Sara - 1978\n\n♪♪♪ - Purisimo Sara - 1988\n\n♪♪ - Sara a Flor de Piel - 1991\n\n♪♪ - Amados Mios - 1995\n\n------------------------------------------------------------------------\n\n♪♪♪♪♪ = outstanding album, an absolute must-have\n\n♪♪♪♪ = great album, highly recomended\n\n♪♪♪ = nice album\n\n♪♪ = be careful, requires listening before buying\n\n♪ = best to be avoided"}]}