{"Sara Montiel was known for her flamboyant style and her signature song, 'Amor de Mis Amores'.": [{"url": "https://www.thecut.com/2023/05/tina-turner-fashion-moments.html", "page_content": "Expand Photo In 1963, then–husband-and-wife R&B duo Ike & Tina Turner posed for a portrait. At the time she wore demure looks, like this white dress, and m... more In 1963, then–husband-and-wife R&B duo Ike & Tina Turner posed for a portrait. At the time she wore demure looks, like this white dress, and mostly matched her husband. She would later divorce him and reveal that Ike was abusive and that she attempted suicide in 1968 during a low point in their relationship. Photo: Michael Ochs Archives/Getty Images\n\nExpand Photo In 1964. Photo: A.B. Bell/ Michael Ochs Archives/Getty Images\n\nExpand Photo Performing with Ike in 1966. Photo: David Redfern/Redferns/Getty Images\n\nExpand Photo With Ike in 1969.\n\n\n\nPhoto: Len Trievnor/Getty Images\n\nExpand Photo In 1975.\n\n\n\nPhoto: David Redfern/Redferns/Getty Images\n\nExpand Photo That same year.\n\n\n\nPhoto: Anwar Hussein/Getty Images\n\nExpand Photo In 1976, Turner started to debut her more flamboyant style, here with a jumpsuit and knee-high boots. Photo: Michael Ochs Archives//Getty Images\n\nExpand Photo An airport look in 1976. Photo: Hulton Deutsch/Corbis via Getty Images\n\nExpand Photo During Turner’s years with Ike, she didn’t have the money for bespoke fashion, so she would tweak items she found while touring. “She’d go to these li... more Photo: Harry Langdon/Getty Images During Turner’s years with Ike, she didn’t have the money for bespoke fashion, so she would tweak items she found while touring. “She’d go to these little French dress boutiques and she would buy something and then she’d try to screw around with it and make it into a costume,” Bob Mackie, her longtime fashion collaborator, said. One of Mackie’s flashiest outfits for Turner featured pleated lamé wings and fringe that had to be constructed from chain because he knew beaded trimming would fall apart after a few of Turner’s notoriously kinetic shows. When she dashed across the stage in 1977, the wings fanned out behind her. “I looked like I was about to take flight and soar — which was exactly how I felt about being on my own for the first time,” she wrote in her memoir That’s My Life.\n\nExpand Photo In 1977, wearing a suit.\n\n\n\nPhoto: Harry Langdon/Getty Images\n\nExpand Photo In 1978 at her first solo concert in London since splitting up with her partner, Ike, Turner debuted a noticeably more liberated look, setting the ton... more In 1978 at her first solo concert in London since splitting up with her partner, Ike, Turner debuted a noticeably more liberated look, setting the tone for her style in later years. Photo: Gary Merrin/Getty Images\n\nExpand Photo By 1984, Turner had become known for her hair. Photo: Gary Gershoff/Getty Images\n\nExpand Photo Performing later that year, she continued her theme of wearing suits, here with a blouse and tie: a power look. Photo: Michael Ochs Archives//Getty Im... more Performing later that year, she continued her theme of wearing suits, here with a blouse and tie: a power look. Photo: Michael Ochs Archives//Getty Images\n\nExpand Photo That same year, she posed for a portrait in her Los Angeles home.\n\n\n\nPhoto: Aaron Rapoport/Getty Images\n\nExpand Photo She started wearing leather in 1984, a look that would come back again throughout the decades. Photo: Michael Ochs Archives/Getty Images\n\nExpand Photo She wore a red dress and belt in 1985, a year that stood out as a peak style moment for Turner. Photo: Steve Rapport/Getty Images\n\nExpand Photo Her \"Private Dancer Tour\" defined her new look and helped establish Turner as a major solo artist and live performer. It is often considered... more Her \"Private Dancer Tour\" defined her new look and helped establish Turner as a major solo artist and live performer. It is often considered one of the best comebacks in music history. Photo: Ross Marino/Icon and Image/Getty Images\n\nExpand Photo This flame look, which she worked with Bob Mackie for her tour, would come to showcase her attention-grabbing era: one that married her disco and rock... more Photo: Richard Young/Shutterstock This flame look, which she worked with Bob Mackie for her tour, would come to showcase her attention-grabbing era: one that married her disco and rock-and-roll personas onstage. When Beyoncé performed a tribute to Turner at the Kennedy Center Honors in 2005, she wore a version of the dress.\n\nExpand Photo Turner wears another leather dress while on tour at the ​​Wembley Arena in 1985. Photo: Solomon NJie/Getty Images\n\nExpand Photo More leather in Brussels, Belgium, during her tour.\n\n\n\nPhoto: Gie Knaeps/Getty Images\n\nExpand Photo Turner and Lionel Richie in 1985.\n\n\n\nPhoto: Images Press/Getty Images\n\nExpand Photo Turner and Cher in 1985. Photo: Robin Platzer/Images Press/Getty Images\n\nExpand Photo Red became one of Turner's defining colors throughout her fashion career, shown here in 1987. Photo: Paul Natkin/Getty Images\n\nExpand Photo More red in Rio in 1988. Photo: Dave Hogan/Getty Images\n\nExpand Photo Silver was another one of her signature colors, showing the boldness of her style throughout the ’90s. Photo: Rob Verhorst/Redferns/Getty Images\n\nExpand Photo A gold dress in 1990, her fabulous era. Photo: Dave Hogan/Getty Images\n\nExpand Photo In 1991. Photo: United Archives/ZIK Images/United Archives via Getty Images\n\nExpand Photo Backstage ahead of her show at New York's Radio City Music Hall in 1993. Photo: Dave Hogan/Getty Images\n\nExpand Photo In 1995, Turner sang the theme song for the Bond film GoldenEye and wore this billowy dress to match. Photo: Dave Hogan/Hulton Archive/Getty Images\n\nExpand Photo Here in 1997, Turner showcased her famous assets: her legs. Three years prior, she had ensured them for 3.2 million. Photo: Tim Mosenfelder/Getty Imag... more Here in 1997, Turner showcased her famous assets: her legs. Three years prior, she had ensured them for 3.2 million. Photo: Tim Mosenfelder/Getty Images\n\nExpand Photo In 2000 during a performance in Chicago. Photo: Paul Natkin/Getty Images\n\nExpand Photo Turner leaned into her love of leather when she performed at the 2000 Super Bowl. Photo: JEFF HAYNES/AFP via Getty Images\n\nExpand Photo In 2002 at a party in Paris for Cartier. Turner would later rewear this dress when she was honored by the Kennedy Center in 2005. Photo: Bertrand Rind... more In 2002 at a party in Paris for Cartier. Turner would later rewear this dress when she was honored by the Kennedy Center in 2005. Photo: Bertrand Rindoff Petroff/Getty Images\n\nExpand Photo Turner lended her voice to the Brother Bear soundtrack in 2003, gifting us with a leather miniskirt moment at the film’s New York premiere. Photo: M. ... more Turner lended her voice to the Brother Bear soundtrack in 2003, gifting us with a leather miniskirt moment at the film’s New York premiere. Photo: M. Von Holden/FilmMagic/Getty Images\n\nExpand Photo In one of her favorite labels, Armani, at the house’s Milan ready-to-wear fashion show in 2007. Notably, this was also when she started to change her ... more In one of her favorite labels, Armani, at the house’s Milan ready-to-wear fashion show in 2007. Notably, this was also when she started to change her hair. Photo: Giuseppe Cacace/Getty Images\n\nExpand Photo In 2008, Turner and Beyoncé performed in matching silver looks at the Grammys. Turner was fond of capri-length pants. Photo: Kevin Mazur/WireImage/Get... more In 2008, Turner and Beyoncé performed in matching silver looks at the Grammys. Turner was fond of capri-length pants. Photo: Kevin Mazur/WireImage/Getty Images\n\nExpand Photo Kicking off her European tour in Cologne in sequins and rhinestones in 2009. And legs. Photo: Dave Hogan/Getty Images\n\nExpand Photo In 2010 in a killer cape during Paris Couture Fashion Week at the Giorgio Armani Privé fashion show, a consistent favorite label of hers. Photo: Richa... more In 2010 in a killer cape during Paris Couture Fashion Week at the Giorgio Armani Privé fashion show, a consistent favorite label of hers. Photo: Richard Bord/WireImage/Getty Images\n\nExpand Photo Wearing a spiderweb dress while presenting at the Netherlands Music Awards in 2016. Photo: KOEN VAN WEEL/AFP via Getty Images\n\nExpand Photo In 2018 in delicate gloves while seated front row at one of her final Giorgio Armani Privé shows during Paris Couture Fashion Week. Photo: Swan Gallet... more In 2018 in delicate gloves while seated front row at one of her final Giorgio Armani Privé shows during Paris Couture Fashion Week. Photo: Swan Gallet/WWD/Penske Media via Getty Images\n\nExpand Photo In 2019 in a fabulous hat at the premiere of Tina — Das Tina Turner Musical in Hamburg. Photo: Franziska Krug/Getty Images"}, {"url": "https://jwa.org/encyclopedia/article/jewish-women-in-contemporary-popular-music", "page_content": "In the 1960s, a generation of Jewish women musicians who were the children of World War II veterans or Holocaust survivors, or who were even child Holocaust survivors themselves, began to come of age. They became part of the rock and punk scenes, performing for audiences consisting of other children of Holocaust survivors. However, many of these performers, and the generation that followed them, were known more as women artists than as Jewish artists.\n\nThe first all-female rock band to be signed to a major label was Goldie and the Gingerbreads, led by Goldie Zelkowitz (Genyusha Zelkowicz, b. 1940). Born in Łódź, Poland, Zelkowitz had survived both the Holocaust and the DP camps as a small child before immigrating to New York. As a teenager, she rebelled by seeking out danger and countercultural expression. Zelkowitz formed Goldie and the Gingerbreads in 1962. The band was signed to Decca in 1963, and then to Atlantic in 1964. Goldie and the Gingerbreads lasted until 1967.\n\nZelkowitz went on to form the band Ten Wheel Drive in 1968, changing her stage name to Genya Ravan and working increasingly as a solo artist after 1974. Around the same time, she began to work as a record producer, becoming the first woman to produce major male bands. She worked for several major labels, including Sire Records, Polydor, and her own label, Polish Records.\n\nHelen Wheels (Helen Robbins, 1949 – 2000) made a name for herself in punk during the same era when Ravan was working in rock. Wheels was the Reform Jewish daughter of a housewife who later became a feminist. In 1967, as a student at CUNY, she met Albert Bouchard and began to design costumes for his band Soft White Underbelly, which became Blue Öyster Cult in 1971. Wheels also contributed lyrics to five of the group’s records, earning two gold albums and one platinum album. Her own punk band, called the Helen Wheels Band, performed largely on the East Coast of the United States between 1977 and 1987. She won the ASCAP award for Best New Writer and Publisher in 1978, and in 1986 the Helen Wheels Band was nominated for “Best Heavy Metal Band” in the inaugural New York City Music Awards. Wheels took up bodybuilding in 1981 and established a small-press imprint, Fort Tryon Press Ltd., in 1995.\n\nAlthough Ravan and Wheels were not overwhelmingly successful as performers, they opened space for other Jewish women to perform in rock and punk. The space they created was largely one of outsiderness. Many Jewish rock and punk artists either did not highlight or actively downplayed their Jewishness, and indeed a strong thread of antisemitism characterized the punk scene of the 1980s and 1990s. A powerful culture of sexism existed, too, and women musicians responded to this sexism through the Riot Grrrl movement.\n\nRiot Grrrl began in the Pacific Northwest in the 1990s. The movement blended female anger and the fight against male-dominated power structures with a playful approach to the signs and signals of femininity and a do-it-yourself aesthetic inherited from punk. Although Jewish women, including Carrie Brownstein (b. 1974) and Janet Weiss (b. 1965) of the band Sleater-Kinney, and women of at least partial Jewish descent, including Courtney Love (b. 1964), participated in Riot Grrrl bands, the movement was primarily concerned with feminism rather than Jewishness.\n\nMore recently, the New York-based rock band The Shondes, founded in 2006, has blended Riot Grrrl-influenced feminist punk with Jewish political and cultural statements and LGBT perspectives. Its lead singer and bassist, Louisa Rachel Solomon (b. 1982), former drummer Temim Fruchter (b. 1979), and other largely Jewish and LGBT musicians combined punk and klezmer elements and played for organizations that upheld their political advocacy for peace through justice between Palestine and Israel. The Shondes’ radical political activism has caused controversy with Jewish audiences. However, many Jewish radical arts organizations and news outlets have praised the group’s musical achievements in bringing an audible sense of Jewish cultural identity to Riot Grrrl-style pop music.\n\nIn the United Kingdom, the most notable Jewish female performer was singer-songwriter Amy Winehouse (1983 – 2011). Winehouse’s music blended soul with rhythm and blues, and she was known for her contralto voice and beehive hairstyle. Although much of her work was in live performance, she produced two albums. Her 2003 debut album, Frank, was nominated for a Mercury Prize, and her 2006 album Back to Black won five Grammy Awards in 2008. Winehouse also won three Ivor Novello awards, of which she was particularly proud, and the 2007 Brit Award for Best British Female Artist. Like her American counterparts, Winehouse’s Jewish identity played almost no role in her musical performance; although she sometimes performed wearing a large Magen David medallion, she was not religiously observant, occasionally attending her family’s Passover seder and going to the synagogue once a year, at Yom Kippur. Nevertheless, two years after her death, the Jewish Museum in London staged an exhibition about Winehouse that has bolstered her posthumous identity as a Jewish popular musician."}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SignatureSong", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SignatureSong\n\nThis is a music trope for the (usually) one song by an artist that everyone knows. It doesn't matter how people know the song — maybe it was all over the radio, maybe it was used in a movie, maybe it was used in a TV show, maybe it was used for an ad that got played over and over and over again — but people know it.\n\nThese songs tend to be songs with an Epic Riff; they can also be Black Sheep Hits. It's also possible for an artist to have more than one Signature Song, especially one for two or more distinct phases of their career. Whatever the case, these songs are very likely to be awesome.\n\nSome of the more rabid members of the artist's fandom may accuse one of not being a true fan for disliking the artist's Signature Song, even if said person may like every other song that the artist has recorded — or, inversely, liking the Signature Song more than what Fanon considers the artist's \"real best work\".\n\nSometimes the signature song isn't the artist's biggest hit (see Chart Displacement). It also doesn't necessarily run in line with their Signature Style (see Black Sheep Hit).\n\nThe song can also be famous due to its inclusion in a certain work. The songs that are potholed are examples of these.\n\nIf they made an appearance in Guitar Hero or Rock Band, it's probably this song. If the artist was a composer of Classical Music, the song is probably a Standard Snippet now.\n\nIn earlier times, such as the 1930s and 1940s, it was not uncommon for a band or singer to open their set with their signature song or at least a few bars of it, especially when they appeared on radio. With the advent of television talk shows, it also became common for the studio band to play a few bars from the artist's signature song as he or she walked onstage.\n\nTo stop people from leaving at gigs after they've heard the song,note as what happened a lot to Radiohead with their song \"Creep\" from Pablo Honey before they developed a larger fandom these songs are normally played live either at the end of the main set or during the encore. Not performing it at all may result in an Iconic Song Request. Some artists or bands will actually avert playing their signature at all. Be it because they consider it an Old Shame, a target of Misaimed Fandom, because they would rather try out some deep cuts on that tour, or any other reason.\n\nSome musicians arguably avert this by having several equally famous hit songs; The Beatles, Michael Jackson and Elvis Presley being three prominent examples. As such, if they'd left off one of their hits from a show it wouldn't have been such an obvious oversight. That said, certainly some of their songs are more identified with them than others. A Black Sheep Hit is somewhat more likely to fall victim to this, for obvious reasons.\n\nOccasionally, an artist can have a signature song that is eventually usurped by another song (although this could be temporary). It's also possible for an artist to have different signature songs in different countries. Additionally, one could have different signatures songs for different audiences. Though a rare occurrence, it's possible for two different artists to have the same signature song.\n\nSignature songs may be slightly different from region to region, as well.\n\nSee One-Hit Wonder for an extreme case of this trope. Not to be confused with Leitmotif or Character Signature Song, which is about signature songs sang by fictional characters.\n\n<!—index—>\n\n!—/index—>\n\nopen/close all folders\n\nAdvertising\n\nSix Flags — Vengaboys' \"We Like to Party\" has become synonymous with the franchise due to its usage in the memorable and highly memetic \"It's Playtime\" commercial from 2004.\n\nAnime and Manga\n\nAsian Animation\n\nPleasant Goat and Big Big Wolf has had a lot of different theme songs over its run, but the original theme from season 1 is still the most popular song from the show. The original theme song is still associated with Pleasant Goat several years after the show began using different theme songs. This might be because the original theme song is still used here and there, just in the closing instead of the opening.\n\nComic Books\n\nComic Strips\n\nFan Works\n\nFilms — Animation\n\nThe Super Mario Bros. Movie at one point features a scene where Bowser sings a Villain Love Song called \"Peaches\", about his crush Princess Peach. The song quickly became regarded as a highlight of the film, with many \"'Peaches', but every time he says 'Peaches', X happens\" memes being made out of it shortly after the film released.\n\nFor Turning Red, FINNEAS and Billie Eilish wrote \"U Know What’s Up\" to be this for 4*Town. The producer, Lindsey Collins describes it as being written to be, In-Universe, \"a hit song that everybody knows\".\n\nLive-Action TV\n\nWandaVision has plenty of musical themes, but the most notable one is \"Agatha All Along\" since it is the only song from the show to top the iTunes charts as well as the fact that the song has received a large amount of Memetic Mutation.\n\nMusic\n\nVideo Games\n\nWeb Comics"}, {"url": "https://www.homesandgardens.com/advice/kelly-wearstler-reveals-how-she-mixes-vintage-and-contemporary-styles", "page_content": "We are big fans of the flamboyant, eclectic style of Kelly Wearstler – from her sculptural furniture designs to her expressive, liveable interiors and her colorful collaborations.\n\nIn an exclusive interview with Homes & Gardens, she reveals how she achieves that Kelly Wearstler look, mixing vintage and contemporary pieces for a balanced scheme.\n\n1. Don't stick to one-era design\n\n(Image credit: Kelly Wearstler/The Ingalls)\n\n'I am a firm believer in that in every era there is incredible design and I pull from lots of different periods – I love mixing deco, Bauhaus, mid-century; sticking to one era can be a bit one note,' says Kelly.\n\n'If you buy all your furniture new it’s going to start to look dated quickly, but if you take the time to curate and shop in a variety of places, you end up with a much more timeless room.'\n\n2. Find a balance between vintage and contemporary\n\n(Image credit: Kelly Wearstler)\n\n'I start sourcing furniture early on in projects, and taking time to find the right pieces makes all the difference. I’m always looking for a balance between vintage and contemporary. If I buy a new sofa maybe I’ll look for a vintage coffee table, so they offset one another.'\n\n3. Don't be afraid of the fade\n\nKelly Wearstler's Malibu beach house perfectly demonstrates her use of vintage and contemporary styles (Image credit: Kelly Wearstler)\n\n'There’s nothing I wouldn’t buy vintage – I’ve even installed 1960s carpets before. Vintage carpets can be so beautiful, the fading of the colors and the patina of the rug.'\n\n4. Check online vintage buys carefully\n\n(Image credit: Kelly Wearstler)\n\n'I always look at quality when buying vintage and how something’s put together. When sourcing online, you have to make sure you know what you’re getting. Ask for a condition report and photos of everywhere even the underside of a table.\n\n'Checking if there are any labels is important, too – if it’s a classic piece, make sure the label or insignia is attached or intact. And don’t be afraid to bargain and cost reference what you’re buying.\n\n'When buying chairs online, I ask the vendor to have somebody sit in the chair and take photos at all angles. Or if I’m buying a credenza, I ask them to put a lamp on it, and a chair next to it, because it helps with understanding the scale.'\n\n5. Where I shop for vintage\n\n'I visit lots of flea markets and vintage stores. I always go to Round Top in Austin for a big shop! I also love 1stDibs, Brimfield Market, JF Chen, The Future Perfect, Holster Burrows and Pamono.\n\n'The auction houses I go to are Cambi and Piasa. I love finding pieces by Pierre Paulin, Augusto Bozzi, Gae Aulenti, Tito Angoli and Franco Albini."}, {"url": "https://www.ft.lk/columns/Singer-Actress-Doris-Day-s-evergreen-signature-song-Que-Sera-Sera/4-682760", "page_content": "Doris Day\n\nWhen I was just a little kid enrolled at the Santa Maria Montessori school in Wattala, a song we sang without knowing its meaning then was ‘Que Sera Sera’; when I was a boy studying at S. Thomas’ Preparatory School in Kollupitiya, a song we were taught the meaning of and sang loudly in our singing class period was ‘Que Sera Sera’; when I was growing up, passing through various phases of adolescence, a song we frequently sang and heard being sung was ‘Que Sera Sera’; when I entered adulthood and participated in many a high-spirited sing-song session, one song that was sung repeatedly at such gatherings was ‘Que Sera Sera’; when I departed from Sri Lanka and relocated to Canada, a favourite number regularly sung at parties organised by nostalgic Sri Lankans was ‘Que Sera Sera’.\n\n\n\n‘Que Sera Sera’ pronounced ‘Kay Sera Sera’ means “Whatever will be, will be” or “What will be, will be”. It is one of the most popular songs to be featured in an English film. It was the well-known singing actress Doris Day who sang it in the film ‘The Man Who Knew Too Much’ released in 1956. The film was directed by the legendary Alfred Hitchcock. It was a revised version of a film, by the same name, made in 1934 by Hitchcock. The song written and composed by the American duo Jay Livingston and Ray Evans became an instant hit.\n\n\n\nAs the years progressed in Toronto, I acquired a DVD of Alfred Hitchcock’s movie ‘The Man Who Knew Too Much’ as well as a CD of Doris Day numbers and occasionally watched the film or listened to the ever-popular ‘Que Sera Sera’. When Doris Day died last May at the age of 97, I watched DVDs of the actress-singer’s films and listened to her CDs. ‘The Man Who Knew Too Much’ and ‘Que Sera Sera’ figured prominently in that binge of nostalgia. The ‘Spotlight’ column appearing after several weeks focuses therefore on this remarkable song and singer this week.\n\n\n\nDoris Day was born on 3 April 1922 as Doris Mary Kappelhoff in Cincinnati, Ohio, USA. Both her parents were of German origin. She adopted the stage name Doris Day and commenced a career in singing. Starting out as a singer on radio and at restaurants, Doris joined popular bands and began recording singles.\n\n\n\nThe Director Michael Curtiz gave her a break in acting by casting her in the film ‘Romance in the High Seas’. Curtiz felt she had that “all-American girl look”. Doris Day became rapidly popular and was voted favourite star by US servicemen stationed in Korea. She acted in a number of romantic musical comedies. Doris acted with a number of leading Hollywood actors including Rock Hudson with whom she paired off best.\n\n\n\nDoris Day was a successful singer cum actress who was the top star of her day in the late fifties and early sixties of the 20th century. She passed away on 13 May 2019. Many of her songs remain as perennial favourites but the widely-popular evergreen number ‘Que Sera Sera’ is adjudged by many as Doris Day’s signature song.\n\n‘Que Sera Sera’\n\nThe song ‘Que Sera Sera’ is sung in the first person by a woman in a reflective, pensive frame of mind. It has four verses denoting four phases of her life in progressive order. She is a child, young adult, lover and mother respectively. (In some versions there are only three verses, with the one relating to the teacher being left out.)\n\n\n\nIn the first three verses she is concerned about her future and asks pointed questions. First as a child she asks her mother, “What will I be?” Next as a student she asks her teacher, “What will I try?” Then as a lover she asks her sweetheart, “What lies ahead?” Finally as a mother she is now asked by her children the same question she once asked her mother, “What will I be?”\n\n\n\nThere is only one answer to all these questions at various levels – “Whatever will be, will be; the future’s not ours to see. Que sera, sera; what will be, will be,” sung as a chorus.\n\n\n\nIn the film it is sung twice in parts by Doris Day who plays Josephine Conway a popular singer now married to a medical doctor Benjamin Mckenna played by James Stewart. In an early sequence she sings some verses of the song along with her son. We also see the son Hank whistle the tune loudly. This is of significance later on. These scenes portray the Mackennas as a typical all-American family.\n\n\n\nIn the climax sequences the song are sung by her again in a tense, suspense-ridden atmosphere. Josephine and Benjamin are honoured guests at the London Embassy of a foreign country while their son is being held prisoner in the same embassy premises. In a melodramatic twist Josephine or Jo gets to sing ‘Que Sera Sera,’ which is heard by the son who whistles the tune loudly, thereby alerting the father, who then manages to rescue him. The song in the film therefore is in two parts. Both have to be combined as one song.\n\nA huge success\n\n‘The Man Who Knew Too Much’ was a huge commercial success in 1956. The film was produced on a budget of $ 1.2 million but US box office earnings alone amounted to $ 11.2 million. It was also well-received internationally.\n\n\n\nThe chief attraction of the film was the song ‘Que Sera Sera’. The song won for Jay Livingston and Ray Evans an Oscar for Best Original Song in 1956. The singles record released by Columbia records boomed in sales and topped the charts that year in the UK. In the USA it was No. 2 on ‘Billboard 100’. In 2004 the American Film Institute ranked ‘Que Sera Sera’ as No. 48 among the 100 best songs in American cinema.\n\n\n\n‘Que Sera Sera’ gave Ray Evans and Jay Livingston their third Oscar for best original songs in films. The earlier ones were for ‘Buttons and Bows’ in ‘The Paleface’ and ‘Mona Lisa’ in ‘Captain Carey, USA’. Usually Ray Evans wrote the words and Jay Livingston composed the tunes in their collaborative efforts. But in this case much of the lyrics were also written by Jay. How they came to work on the song and how they chose the words ‘Que Sera Sera’ is an interesting tale.\n\n\n\n\n\nHow it came to be\n\nIn the book ‘Songwriters on Songwriting’ by Paul Zollo, Ray and Jay state as follows – “We got a call from Alfred Hitchcock. And he told us that he had Doris Day in his picture, whom he didn’t want. But MCA (Music Corporation of America), the agency, was so powerful that they said if he wanted Jimmy Stewart he would also have to take Doris Day and Livingston and Evans. It was the only time an agent got us a job that I can remember. Hitchcock said that since Doris Day was a singer, they needed a song for her. He said, ‘I can tell you what it should be about. She sings it to a boy. It should have a foreign title because Jimmy Stewart is a roving ambassador and he goes all over the world.’”\n\n\n\nThough Ray and Jay say Doris Day was imposed upon Hitchcock, the film’s Associate Producer Herbert Coleman was quoted differently in the documentary ‘The Making of The Man Who Knew Too Much’. According to Coleman, Hitchcock had seen the film ‘Storm Warning’ starring Ronald Reagan (US President 1981-’88) and Doris Day and wanted to cast her as his leading lady. It was Coleman who protested and suggested other actresses like Lana Turner, Kim Novak, Jane Russell or Ava Gardner instead. Finally Hitchcock had his way and Doris Day was chosen. This was entirely Hitchcock’s decision. There was no pressure.\n\n\n\nA clearer picture of how the song came to be written and picturised in the film is provided in the book ‘Hitchcock’s Music’ by Jack Sullivan. Apparently Paramount Pictures which was to distribute the film had insisted that a song by Doris Day should be included in the film as fans would definitely expect one from the popular singer-actress. Paramount also wanted the song to be written and composed by the Livingston-Evans duo with whom they had a 10-year contract. Hitchcock though reluctant was compelled to agree.\n\n\n\nThe music score for the film was by Bernard Hermann who was a favourite of Hitchcock, having composed music for several of the director’s movies. It was Hermann who was responsible for the Back Ground Music (BGM) in this film too though Jay and Ray were tasked with the Doris Day number. The renowned director, famous for the suspense in his movies, thought of a sequence where the song on screen would be an integral component of a thrilling climax scene.\n\n\n\nHitchcock told Livingston and Evans: “I don’t know what kind of song I want. But Jimmy Stewart is a roving ambassador and it would be nice if the song had some foreign words in the title. Also, in the picture, I have it set up so that Doris sings to their little boy.”\n\n\n\nAs stated earlier it was Livingston who generally composed the music while Evans wrote the words. But in this film the order was reversed. It was Jay Livingston who wrote most of the words as well as the tune. What had happened was that in 1954, Livingston had seen the film ‘The Barefoot Contessa’ starring Ava Gardner, Humphrey Bogart and Edmond O’Brien. It was directed by Joseph L. Manckiewicz. In the film the fictional Italian aristocratic family has the motto ‘Che Sara Sara’ carved in stone at their ancestral villa. It is also engraved on the Contessa’s tombstone.\n\n\n\nJay Livingston, struck by the three words ‘Che Sara Sara,’ had written it down – in the darkness of the cinema theatre – in his notebook. He had thought the words were suitable for a song. So when Hitchcock wanted a song title with foreign words, Livingston suggested ‘Che Sara Sara’. It was later changed from Italian to the Spanish ‘Que Sera Sera’. Thereafter the duo plunged zestfully into writing the song with the “inspired” Jay Livingston contributing the most. It was over in three days but Jay and Ray delayed it for two weeks before submitting to Hitchcock.\n\n\n\nThe director was delighted and so was Paramount but there was a hitch. Paramount Pictures recognised immediately that the song possessed Oscar-winning potential. However the Academy of Motion Picture Arts and Sciences (AMPAS) awarding Oscars would not approve of a song with a ‘foreign’ title. So the title of the song was modified into ‘Whatever Will Be, Will Be (Que Sera Sera)’ in the film and nominated for the Oscars where it struck gold.\n\nHow wrong she was!\n\nDoris Day, however, did not like the song and described it as a “kiddie song”. As she later recollected in an interview to the NPR radio, “I thought I’m not crazy about that. Where are they going to put it? You know, for what? Is it when I put him in bed sometime and I sing that to him or something? I did that in another film. And I thought maybe that’s what it’s going to be. And I just, I didn’t think it was a good song.”\n\nHowever Alfred Hitchcock and her husband Martin Melcher persuaded Doris Day to record it. Martin, her third husband, was also her manager. So a reluctant Doris Day went through with it and recorded the song in one take. And then she said, “That’s the last you’re going to hear of this song.’”\n\n\n\nHow wrong she was! Not only did the song win an Oscar but it was also a chart-buster. Furthermore, the song proved to be the greatest hit ever sung by Doris Day.\n\n\n\nHowever in the same NPR interview cited earlier, Doris Day half-heartedly accepted the popularity of the song. She reportedly said: “So maybe it isn’t a favourite song of mine, but people loved it. And kids loved it. And it was perfect for the film. So, you know, I can’t say that it’s a favourite song of mine and I think it’s fabulous but, boy, it sure did something. It came out and it was loved.” How true!\n\nUniversal appeal\n\nThe song beginning “When I was just a little girl, I asked my mother what will I be” had a universal appeal. The song became widely popular within a few years in many different countries. In Sri Lanka, known then as Ceylon, the song – like those of Jim Reeves – became very popular with Western music listeners. Many lips chanted “Que Sera Sera”.\n\n\n\nThe song was picked up by other linguistic cultures too. Songs with modified variations of the melody and words have appeared in 35 different languages. Among these are French, German, Hungarian, Swedish, Italian, Spanish, Estonian, Polish, Latvian, Yiddish, Japanese, Cantonese and Mandarin versions of the song.\n\n\n\nThe words ‘Que Sera Sera’ soon acquired a unique appeal of its own. The three memorable words were adopted and adapted in different ways. For instance the Indian film ‘Pukar’ released in Hindi has a dance sequence featuring Madhuri Dixit and Prabhu Deva. The song they danced to was ‘Kay Sera Sera’. The singers were Shankar Mahaevan, Kavita Krishnamurthy and Swarnalatha. The lyricists were Javed Akthar and Majrooh Sultanpuri.\n\n\n\nA.R. Rahman composed the music. What Rahman did was to re-utilise the melody of the song ‘Kaadhal Niagara’ from an earlier Tamil film ‘En Swaasak Kaatre’ for the popular Hindi song. Though the tune and words were totally different, the chorus and title of the song was ‘Kay Sera Sera’ derived from the English ‘Que Sera Sera’.\n\n\n\nEven the Tamil film ‘Aaravalli’ produced by Modern Theatres in 1957 had a spinoff from ‘Que Sera Sera’. The Tamil song ‘Chinnap Pennaana Poathiley’ sung by the real-life husband and wife pair Jikki-A.M. Rajah remains a perennial favourite. The words were written by Pattukkoattai Kalyanasundaram and music composed by G. Ramanathan. The substitute for ‘Que Sera Sera’ in Tamil were the words ‘Vennilaa, Nilaa’ (Silver Moon, Oh Moon). The versatile Indian actress-singer Dr. Bhanumati Ramakrishna sang verses from the song in English for the Telugu film ‘Thodu Needa’.\n\nSignature song\n\nThough Doris Day sang many songs on screen and stage and released several records and albums ‘Que Sera Sera’ is regarded as her signature song. When the singer-actress launched her own ‘Doris Day Show’ from 1968 to 1973 on TV, the theme song was ‘Que Sera Sera’. She also sang snippets from the song in some other films she acted in. She sang the song to her co-star David Niven in the film ‘Please Don’t Eat Daisies’. In the film ‘The Glass Bottom Boat,’ she sings to the accompaniment on ukulele by her co-star Arthur Godfrey.\n\n\n\nA very interesting aspect of the song’s popularity has been its adaptation into a rousing football chant by the robust soccer fans of Britain. The prestigious FA cup finals in England have been played in Wembley Stadium since 1923. When clubs play each other, partisan fans treat each success as a significant milepost on the road to Wembley or ultimate victory. So when their favourite team triumphs, British fans celebrate by chanting lustily, “Que Sera Sera, Whatever will be will be, We’re going to Wembley, Que sera sera.”\n\n\n\nThe magical words ‘Que Sera Sera’ are by themselves somewhat fatalistic. What is destined to happen will happen. It cannot be foreseen. Yet the song imbues one with a sense of confidence and courage. Instead of forebodings about an uncertain future, the song instils optimistic hopes. It also says indirectly that there is nothing new in life and that the cycle of life will keep turning – from daughter to mother and mother to daughter. ‘Que Sera Sera’ has been described by some as a song of “cheerful fatalism”.\n\n‘Whatever Will Be, Will Be (Que Sera Sera)’\n\nWhen I was just a little girl,\n\n\n\nI asked my mother, “What will I be?\n\n\n\nWill I be pretty?\n\n\n\nWill I be rich?”\n\n\n\nHere’s what she said to me:\n\n\n\n“Que sera, sera,\n\n\n\nWhatever will be, will be;\n\n\n\nThe future’s not ours to see.\n\n\n\nQue sera, sera,\n\n\n\nWhat will be, will be.”\n\n\n\nWhen I was just a child in school,\n\n\n\nI asked my teacher, “What will I try?\n\n\n\nShould I paint pictures,”\n\n\n\nShould I sing songs?”\n\n\n\nThis was her wise reply:\n\n\n\n“Que sera, sera,\n\n\n\nWhatever will be,\n\n\n\nwill be;\n\n\n\nThe future’s not\n\n\n\nours to see.\n\n\n\nQue sera, sera,\n\n\n\nWhat will be, will be.”\n\n\n\nWhen I grew up and fell in love.\n\n\n\nI asked my sweetheart, “What lies ahead?\n\n\n\nWill we have rainbows\n\n\n\nDay after day?”\n\n\n\nHere’s what my sweetheart said:\n\n\n\n“Que sera, sera,\n\n\n\nWhatever will be, will be;\n\n\n\nThe future’s not ours to see.\n\n\n\nQue sera, sera,\n\n\n\nWhat will be, will be.”\n\n\n\nNow I have children of my own.\n\n\n\nThey ask their mother, “What will I be?”\n\n\n\nWill I be handsome?\n\n\n\nWill I be rich?”\n\n\n\nI tell them tenderly:\n\n\n\n“Que sera, sera,\n\n\n\nWhatever will be, will be;\n\n\n\nThe future’s not ours to see.\n\n\n\nQue sera, sera,\n\n\n\nWhat will be, will be.\n\n\n\nQue Sera, Sera!\n\n(D.B.S. Jeyaraj can be reached at [email protected])\n\nRecent columns"}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/CharacterSignatureSong", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CharacterSignatureSong\n\nKisarah referencing her ending theme from Aggressors of Dark Kombat, NeoGeo Battle Coliseum \"I'm bathed in the rainbow. The city's my paradise. What? You don't know this song?\"\n\nA subtrope of Signature Song. While the article Signature Song is devoted to the most famous and recognizable songs by real life musicians, this article is devoted to the signature songs of specific individuals and fictional characters.\n\nAs a Running Gag some characters tend to be singing or humming the same kind of song whenever they appear in view, on screen or within earshot. The song might not have been written by them personally, but they like singing it anyway. In this sense it becomes one of their characteristic trademarks. Sometimes other characters might get annoyed.\n\nNot to be confused with an actual Signature Song (the most well known song by a musician) or a Leitmotif (an introductory melody heard whenever a specific character appears).\n\nExamples:\n\nopen/close all folders\n\nAnime\n\nComic Books\n\nSuske en Wiske: Tante Sidonia often sings or hums the song \"Ons Hutje Bij De Zee\" (The Dutch translation of the song \"Our Cottage By The Sea\")\n\nTintin: Bianca Castafiore is usually seen and heard performing the Jewel aria from Charles Gounod's opera Faust.\n\nComic Strips\n\nPeanuts: Schröder has no specific signature song, but he is always playing some piece by Ludwig van Beethoven on his piano whenever he is in frame.\n\nFilms — Live-Action\n\nLiterature\n\nNanny Ogg of Discworld has \"The Hedgehog Can Never Be Buggered At All\". She's also been known to sing \"A Wizard's Staff Has a Knob On the End\", but she's the only person who sings the Hedgehog Song, and the other characters live in constant fear that she might be about to do so.\n\nLive-Action TV\n\nMusic\n\nPuppet Shows\n\nSesame Street: Almost every main muppet character on the show has one: \"C Is For Cookie\" by Cookie Monster. \"I Love Trash\" by Oscar the Grouch \"Rubber Duckie\" by Ernie \"Elmo's Song\" by Elmo \"Doin' the Pigeon\" by Bert \"ABC-DEF-GHI\" by Big Bird \"Batty Bat\" sung by The Count For the humans, \"People in Your Neighborhood\" by Bob\n\nThe Muppets: Kermit's \"It's Not Easy Being Green\". The Swedish Chef is also seen and heard humming the same melody whenever he is cooking. Kermit's own nephew, Robin, is forever associated with his put-to-music version of the A. A. Milne poem \"Half Way Down the Stairs\".\n\nBarney & Friends: Barney's \"I Love You,\" which doubles as the show's ending song. For the other dinos, Baby Bop has \"My Yellow Blankey\", BJ has \"BJ’s Song\", and Riff has \"I Hear Music Everywhere\".\n\nWestern Animation"}, {"url": "https://www.britannica.com/biography/Elsa-Schiaparelli", "page_content": "Elsa Schiaparelli, (born Sept. 10, 1890, Rome, Italy—died Nov. 13, 1973, Paris, France), Italian-born fashion designer who established an important couture house in Paris. She was famous for her Surrealist fashions of the 1930s and for her witty accessories, such as a purse in the shape of a telephone.\n\nSchiaparelli ran away from her upper-class family and worked in the United States briefly as a translator. Then in the late 1920s she settled in Paris, where she opened her couture house. By 1935 she was a leader in haute couture and was quickly expanding into jewelry, perfume, cosmetics, lingerie, and swimsuits. Her designs were noted for combining eccentricity with simplicity and a trim neatness with flamboyant colour. In 1947 Schiaparelli’s new colour, “shocking pink,” was the sensation of the fashion world.\n\nShe escaped to New York during World War II and opened a branch in 1949 to mass-produce suits, dresses, and coats of her design. Along with designer Christian Dior, she was instrumental in the worldwide commercialization of Parisian fashion."}, {"url": "https://www.schoolofrock.com/resources/music-education/celebrating-black-artists-part-1", "page_content": "In this article, we will celebrate some of Rock music's earliest artists and influencers. Many of these artists were inspired by musicians that came from other genres, such as Blues, Folk, Jazz, and Gospel. You will find these inspirations in most of the artists listed below. In addition to their biographies, be sure to check out their notable songs and what popular artists or bands they are known to have directly influenced. Don’t forget to review all of our other artist lists.\n\nInstruments Vocals, guitar (especially the 12-string guitar), accordion, mandolin, piano Genres Folk, Blues Notable Songs Midnight Special, Goodnight Irene, Where Did You Sleep Last Night, Boll Weevil, Cotton Fields, Rock Island Line Associated Artists/Acts Josh White, Sonny Terry, Brownie McGhee, Woody Guthrie, The Lead Belly Foundation Biography Huddie William Ledbetter, better known as Lead Belly, King of the 12-String Guitar, was born in Mooringsport, Louisiana, and showed his interest in music from the first years of life. However, it was through his uncle Terrell Ledbetter that he had his first contact with the guitar. As Lead Belly’s passion for music began to grow along with his talent he also learned to sing and play the accordion, mandolin, piano and the 12-string guitar (which he called “Stella”). In 1930, Lead Belly was taken to New York by the folklorists John and Alan Lomax after being found imprisoned in an Angola Farm prison plantation because of a fight. With this move from Louisiana to New York, Lead Belly began to play on college campuses in front of larger audiences. He would eventually begin to work for labels (e.g. Capitol Records) and radio stations (Back Where I Come From / Folk Music of America). During his musical career, Lead Belly composed more than 500 songs (which can be found in the Library of Congress), won recognition across the country and toured Europe. He passed away in December 1949 due to ALS, also known as Lou Gehrig's disease. In 1988, Lead Belly was inducted into the Rock and Roll Hall of Fame. His songs, guitar picking style, big voice, and melding of Folk and Blues have influenced countless musicians over the decades, including many of the pioneers of Rock and Roll. His compositions have been covered by such bands and artists as Nirvana, Bob Dylan, Elvis, ABBA, Johnny Cash, Tom Petty, Grateful Dead, The Beach Boys, White Stripes, Red Hot Chili Peppers, Aerosmith, Creedence Clearwater Revival, Led Zeppelin, and many others. Historical or Cultural Context Early pioneer of Folk and Blues music, inspiration for countless Rock and Roll artists Artists/Acts They Influenced Bob Dylan, The Beatles, The Rolling Stones, Eric Clapton, Little Richard, Nirvana, Creedence Clearwater Revival, Grateful Dead\n\nPictorial Press Ltd / Alamy Stock Photo\n\nInstruments Vocals, guitar Genres Gospel, Jazz , Blues and R&B Notable Songs Strange Things Are Happening Everyday, Rock Me, That’s All, My Man and I, Lonesome Road Associated Artists/Acts Cab Calloway, Muddy Waters, Duke Ellington Biography Sister Rosetta Tharpe is universally considered to be the Godmother and inventor of Rock and Roll. She was the first gospel artist to successfully make the crossover to wider audiences, popularizing spiritual music and introducing the use of the electric guitar into mainstream music. Memphis Minnie, Bessie Smith and Ma Rainey, along with hymns and spirituals were all influential in shaping Rosetta’s musical style. The Great Migration of the 1920s brought Rosetta and her mother from rural Arkansas to Chicago. A better life and opportunities were greater for Blacks in bigger cities. Rosetta brought her roots in Gospel music and the soulful, Black sounds of the Blues. She was known for her incredible vocal range, her stunning full-bodied vibrato, and her impressive vocal agility. Her vocal phrasing captured her beefy sound that leaned into her heavy Blues influences. She was a foundational artist who precedes those we commonly think of today as cornerstone, Rock and Roll pioneers. She influenced artists such as Little Richard, Chuck Berry, Elvis Presley, Johnny Cash, as well as many 1960s British guitarists. Her song “Strange Things Are Happening Everyday” was recorded in 1945. It became the first Gospel record to cross over to the “Race Records” Billboards chart, and is considered by some to be the first Rock and Roll record. It was revolutionary for Tharpe, a Black woman, to straddle the fence in playing at both churches and nightclubs. However, this caused her to receive a great deal of criticism from disapproving church members. She was not only one of the first artists to perform with an electric guitar but she spiced things up by being the first female artist playing it during its debut in the 1930s. This was an unheard of accomplishment during this time in American society. It can be said that Tharpe’s flamboyant style, rebellious nature, and stage theatrics shaped the rawness of the earliest rock and rollers. In the 1960s, Tharpe’s celebrity status grew as well overseas in Europe. Muddy Waters was one of the artists she toured with in Europe. In 1964, British television filmed the “Blues and Gospel Train” that included her performance at Wilbraham Road train station in Whalley Range, a performance which is legendary in the influence it had on many of the British rock musicians who saw it. Sister Rosetta Tharpe was inducted into the Rock and Roll Hall of Fame in 2018. Technical Innovations Electric guitar pioneer Artists/Acts They Influenced Elvis Presley, Chuck Berry, Little Richard, Johnny Cash\n\nInstruments Guitar, vocals Notable Songs Cross Road Blues, Hell Hound On My Trail Genres Delta Blues Associated Artists/Acts Son House, Muddy Waters, Honeyboy Edwards Biography Robert Leroy Johnson was an American singer, songwriter and guitarist. He was born in Hazlehurst, Mississippi on May 8, 1911. His biological father was forced to dress up like a woman and leave town to avoid lynching before Robert was born. As there were few performance opportunities in Mississippi for young Black artists, Robert played mostly at Juke Joints and on street corners in front of bars. He was known to be persistent in trying to get opportunities to play with bands that came through town while he was still a developing guitarist. He was not yet good and was chased off the stage quite often. When Robert moved to Robinsonville in 1919, he found his mentor in Son House. It’s said that Robert went off with Son to learn how to play guitar by sitting in graveyards. He disappeared for about 2 years and when he returned, he’d mastered the guitar. He’d gone from being a notoriously bad guitarist to being able to outplay anyone. Some speculate it was 2 years of intense practice that helped him accomplish this and others said he’d sold his soul to the devil for the ability to play the way he did. Other guitarists of the time said it sounded as if 3 men were playing the guitar when Robert played. This myth is furthered by the lyrics of some of his most famous songs “Cross Road Blues” and “Hell Hound On My Trail.” Johnson’s career was short as he only participated in 2 recordings during his lifetime. He was inducted into the Rock and Roll Hall of Fame in 1986 as an early influence on Rock and Roll. He was also given a Grammy Hall of Fame Lifetime Achievement Award in 1998. He is widely known as the King of the Delta Blues. Artists/Acts They Influenced Rolling Stones, Eric Clapton, Muddy Waters, Red Hot Chili Peppers\n\nInstruments Vocals Genres Jazz, Bossa Nova, Opera Notable Songs A-Tisket A-Tasket, Into Each Life Some Rain Must Fall Associated Artists/Acts Benny Goodman, Louis Armstrong, Duke Ellington, The Mills Brothers, Ink Spots, Dizzie Gillespie, Cole Porter, George Gershwin, Irving Berlin, Johnny Mercer Biography Ella Fitzgerald was an American Jazz vocalist frequently referred to as the First Lady of Song. Born in Newport News, Virginia, Ella’s life got off to a rough start. Ella’s father left the family when she was 3 years old, and when she was fifteen her mother died from injuries sustained in a car accident, leaving her stepfather to care for her. It was widely believed that he abused Ella. She later went to live with her Aunt in New York but her behavior landed her in a reform school and the “Colored Orphan Asylum” in the Bronx. Ella got her musical start singing in church, but between the ages of 15 and 18, Ella was homeless and made money by singing on the streets of Harlem. Ella got her break when Chuck Webb, a young band leader in Harlem, decided that his band needed a female vocalist. He asked Charles Linton, the band’s lead singer, to find him one. Charles Webb did not initially want to listen to Ella because she was not the thin white lead vocalist that he had in mind. Linton had to threaten to quit in order to get Charles Webb to listen to her. Charles gave in and agreed to give her a two week trial period. Ella of course got the gig. Ella was known for her three-octave range, superb diction, effortless swing, and her ability to scat. She was also known to have “one of the best ears in the business,” resulting in the interesting melodic choices she made and her ability to quickly memorize songs. Ella made a name for herself in the face of discrimination against women and racism. She also started her career during the Great Depression. She was the first African-American woman to win multiple Grammy Awards. Finally, she was one of the first stars to perform during the Super Bowl Halftime Show in 1972. Ella has won 14 Grammy Awards, including one for lifetime achievement, as well as a Kennedy Center Honor for lifetime achievement (1979) and the National Medal of Arts (1987). She has influenced countless artists from numerous styles and genres - everyone from Odetta to Adele, from Frank Sinatra to Stevie Wonder. In 2007, the United States Postal Service issued a stamp commemorating Ella Fitzgerald’s contributions to American music and culture. Artists/Acts They Influenced Lady Gaga, Amy Winehouse, KT Tunstall, Adele\n\nInstruments Upright bass (double bass), vocals Notable Songs I’m Your Hoochie Coochie Man, I’m Ready, Little Red Rooster, Back Door Man, My Babe, Bring It on Home, The Seventh Son, Wang Dang Doodle Genre Blues Associated Artists/Acts Founder of the Blues Heaven Foundation, Big Three Trio, Muddy Waters, Howlin' Wolf Biography William James Dixon was born in Vicksburg, Mississippi. Dixon started singing in a gospel quartet (Union Jubilee Singers) on WQBC radio. Later he dedicated himself to boxing and went professional, but started playing bass three years later and formed the band “The Five Breezes.” Years later, he formed the group “The Four Jumps of Jive” and later the “Big Three Trio.” Willie worked as a composer and producer on the Chess Records and Cobra labels, and wrote songs for Muddy Waters, Howlin 'Wolf, and Little Walter. He wrote over 500 songs, including many hits that became Blues standards, such as “My Babe,” “Spoonful,” “Little Red Rooster,” “Wang Dang Doodle,” and “Hoochie Coochie Man.” In the late 1960s he formed the Chicago Blues All Stars. Willie Dixon formed The Chicago Blues Festival in America and The American Folk Blues Festival in Europe, and in 1981 he created The Blues Heaven Foundation, which is still in operation in the historic Chess Records building on Chicago’s south side. The foundation promotes Blues music and the legacy of the Chess Records artists. Dixon is widely recognized as one of the most influential artists who helped to create the Chicago Blues sound. He also played an important role in connecting Blues to Rock and Roll music through his work with Chuck Berry and Bo Diddley. He is one of the most covered songwriters in recorded music, and his songs have been covered by such legendary Rock bands as Led Zeppelin, The Doors, the Allman Brothers Band, and the Rolling Stones. Dixon joined the Blues Hall of Fame in 1980 and, fourteen years later, was inducted into the Rock and Roll Hall of Fame in the Early Influence category. He died of heart illness in California in January 1992. Artists/Acts They Influenced Jimi Hendrix, Muddy Waters, Chuck Berry, Bo Diddley, Led Zeppelin, Allman Brothers Band, The Doors\n\nInstruments Vocals, guitar, harmonica Genres Blues, Chicago Blues, Delta Blues Notable Songs Mannish Boy, Hoochie Coochie Man, I Just Want to Make Love to You, Rollin’ Stone, Trouble No More, Got My Mojo Working Associated Artists/Acts Little Walter, Willie Dixon, Big Bill Broonzy, Jimmy Rogers, Otis Spann, B.B. King Biography Muddy Waters was born as McKinley Morganfield in Mississippi in 1913. As a teenager, he began playing guitar steeped in the local tradition of the Delta Blues and influenced by local legends like Robert Johnson and Son House. He chose the stage name Muddy Waters from a nickname given to him by his grandmother. In the early 1940s, Waters was inspired to pursue music full time when he was recorded by the ethnomusicologist Alan Lomax. He moved to Chicago in 1943, where he was taken under wing by Big Bill Broonzy. Waters quickly gained popularity in Chicago’s burgeoning electric Blues scene and was one of the first acts signed to the new Chess Records. Where Blues music to that point had traditionally been performed on acoustic instruments, Chicago Blues was characterized by the addition of electric instruments and drum kit. Waters’ guitar style adapted the Delta Blues of his youth to the electric guitar and he was renowned for his expressive and aggressive slide playing. At Chess, Muddy Waters assembled a legendary backing band and produced numerous hits throughout the 1950s that would become Blues standards. Bassist and songwriter Willie Dixon was a frequent collaborator, and many of Waters’ backing musicians from that era became stars in their own right, including Otis Spann, Little Walter, Jimmy Rogers, and Buddy Guy. Muddy Waters and Howlin’ Wolf became the leading ambassadors for electric Blues through heavy international touring, and influenced countless young musicians in both America and England who would form the next generation of Blues and Rock and Roll players. In the late 1960s and throughout the 1970s, Waters would occasionally collaborate with musicians who grew up idolizing him, such as Johnny Winter, The Band, Paul Butterfield, and The Rolling Stones (who got their name from his signature song “Rollin’ Stone”). Muddy Waters died in 1983 but his artistry and influence changed the course of modern music. Rock and Roll simply wouldn’t have been the same without him, and Waters was inducted into the Rock and Roll Hall of Fame in 1987. Artists/Acts They Influenced Rolling Stones, Led Zeppelin, Jimi Hendrix, The Allman Brothers Band, Cream, Eric Clapton, Johnny Winter, The Band, ZZ Top, AC/DC, Paul Butterfield, Michael Bloomfield, Jack White\n\nNeil Lupin/Redferns/Getty Images\n\nInstruments Vocals, guitar Genres Blues, R&B Notable Songs Bo Diddley, Roadrunner, Who Do You Love, Pretty Thing, Can’t Judge a Book Biography Ellas McDaniel, better known to the world as Bo Diddley, created not only a unique sound, but his own signature beat. Born in Mississippi, Bo was raised in Chicago by his mother’s cousin who adopted him. Bridging the gap between Blues and creation of Rock and Roll, Bo Diddley is known as “the Originator”. Bo began playing professionally in the mid '40s and worked his way up from West Side street corners to the South Side clubs. In 1955, he recorded his first hit “Bo Diddley” for Checker Records (subsidiary of Chess Records). Bo followed that up with two more hits, “Pretty Thing”, and “Mona.” In the '60s Bo continued to tour and release additional hits such as “Can’t Judge a Book” and “Roadrunner”. Bo was incredibly popular in England where he was a major influence on the British Invasion bands, especially the Rolling Stones and the Pretty Things, who took their name from Bo’s hit single. The Bo Diddley beat is one of the most recognizable rhythms in Rock and Roll. Influenced by African percussion patterns, it’s essentially a variation of the 5 note clave beat. While it existed in Rhythm and Blues music previously as a type of Rhumba beat, the Bo Diddley beat was featured on many of Bo’s tunes. It also has roots in an African American tradition known as “hambone” which combines dancing or stomping with rhythmic drumming on the body. This West African tradition was carried on by slaves when they were not allowed to play or possess instruments. In many ways Bo Diddley represents an archetypal, larger than life mythical figure. His self proclamations and boasts are proto-Rap. In “Who Do You Love”, Bo stakes his claim as a powerful and dangerous young man: \"Tombstone hand and a graveyard mind, just 22 and I don't mind dying.\" The song “Say Man” featured Bo and Jerome Green trading insults with each other in the African American tradition of “the dozens,” a game where the participants try to outdo each other with elaborate putdowns. Bo was also known for his non-traditional guitars, including his square custom Gretsch. Bo Diddley also had a unique sound due to the instrumentation of his bands. They featured Bo’s tremolo-drenched guitar and Jerome Green’s insistent maracas. Many of Bo’s biggest songs only employed one chord, placing the emphasis on the beat and rhythm. Bo is also credited with having women in his band, including female lead guitarist Lady Bo (Peggy Jones). Bo was inducted into the second class of the Rock and Roll Hall of Fame in 1987. In 1989 Bo, along with athlete Bo Jackson, starred in Nike's “Bo Knows” ad campaign. Bo continued to perform until he suffered a stroke in 2007, and he passed away in 2009. Bo Diddley was a true American original whose influence can be heard in hundreds of songs, from Buddy Holly’s “Not Fade Away” to U2’s “Desire”. Technical Innovations The Bo Diddley Beat Artists/Acts They Influenced Pretty Things, Rolling Stones, Buddy Holly, U2, George Michael\n\nInstruments Vocals, harmonica Genres Blues, R&B, Soul Notable Songs Hound Dog, Ball and Chain Associated Artists/Acts Johnny Otis, Muddy Waters, Lightnin' Hopkins, John Lee Hooker, Buddy Guy, Mississippi Fred McDowell Biography Big Mama Thornton was a vocalist and Blues songwriter who has been largely under appreciated for her important role in the birth and development of Rock and Roll music. She was born in Alabama as Willie Mae Thornton and grew up singing in her father’s church. Thornton was nicknamed “Big Mama” at the beginning of her career by a manager of The Apollo Theater who was impressed by her immensely powerful voice and her larger-than-life personality. Thornton’s career took off in 1952 when she recorded the song “Hound Dog”, which was written specifically for her. While Elvis Presley’s later version of this song is more widely known, Big Mama Thornton’s version is hailed as a seminal Rock and Roll performance due to her unbridled and soulful vocals which draw as much from her early Gospel influences as from the Blues. Thornton later worked with Blues legends such as Buddy Guy, Muddy Waters, and John Lee Hooker, though she never duplicated the popular success of “Hound Dog.” Her career enjoyed a resurgence in the late 1960s when Janis Joplin, a huge admirer, covered Thornton’s original Blues song “Ball and Chain” and offered her an opening slot on tour. Big Mama Thornton’s career stalled in the late 1970s and early 1980s, as her talents and contributions were overlooked by white audiences and she suffered through health complications brought on by alcohol abuse. She died in 1984. In recent years, more and more music fans have become aware of her work and her legacy as a Blues singer and one of the early pioneers of Rock and Roll music. Aside from her incredible voice, as powerful as anyone’s in popular music history, Thornton was greatly admired by her contemporaries for her unyielding non-conformity and her celebration of body-positivity. Artists/Acts They Influenced Elvis Presley, Janis Joplin, Etta James, Koko Taylor"}, {"url": "https://www.britannica.com/biography/Nicki-Minaj", "page_content": "Nicki Minaj, original name Onika Tanya Maraj, (born December 8, 1982, St. James, Trinidad and Tobago), Trinidadian-born singer, songwriter, television personality, and actress who was known for her flowing quick-spoken rap style and for her provocative lyrics. She complemented her music with a bold persona that included colourful wigs and risqué clothing.\n\nMaraj was about five years old when her family moved to Queens, New York, from Trinidad and Tobago. Her childhood was dominated by a violent drug-addicted father, and she spent time creating fantasies for herself that would allow her an escape from her tumultuous life. She adopted a new name, Nicki Minaj, from that practice. Other creative outlets included writing her first rap song when she was 12 years old and pursuing acting at New York City’s Fiorello H. LaGuardia High School of Music & Art and Performing Arts.\n\nBritannica Quiz 2010s Music Quiz\n\nMinaj entered the music business as a backup singer for local aspiring rap singers in New York City. She included videos of her work on her Myspace page, which was seen by a local record label. Minaj eventually came to the attention of rapper Lil Wayne, and the two worked on some mixtapes (recordings), the first of which, Playtime Is Over, appeared in 2007. As other mixtapes were released, Minaj’s exposure grew, and the next year she was named Female Artist of the Year at the Underground Music Awards. In 2009 she signed with Young Money Entertainment, the label founded by Wayne; the label would release numerous hits by Wayne, Minaj, and Drake. Her first album for Young Money, Pink Friday (2010), made it to the top of the Billboard 200 chart. It featured sexually explicit lyrics—which were common in her recordings—and Minaj embraced the shock value of her work. The title also reflected her preference for the colour pink, a predilection that she used in branding her albums and such later consumer items as her Pink Friday perfume and Pink Pill speakers.\n\nIn 2012 Minaj released her second album, Pink Friday: Roman Reloaded, which featured a number of pop songs, notably the hit single “Starships.” The following year Minaj became a judge on the reality TV singing competition American Idol. She caused controversy with her blunt opinionated judging style and with her frequent disputes with fellow judge Mariah Carey. After one season Minaj left the program. Also in 2013 she claimed title to a record 44 appearances—the most by a female rapper—on the Billboard Hot 100 chart. Her third studio album, The Pinkprint, was released in 2014. It notably contained several breakup songs as well as “Anaconda,” which was a return to her earlier rap style. Queen (2018) featured collaborations with such performers as Eminem and the Weeknd.\n\nMinaj also occasionally acted, and her movie credits included The Other Woman (2014) and Barbershop: The Next Cut (2016). She lent her voice to the animated comedies Ice Age: Continental Drift (2012) and The Angry Birds Movie 2 (2019)."}, {"url": "https://middermusic.com/american-singers/", "page_content": "We’re dedicating today’s article to the best American singers of all time.\n\nFrom Bob Dylan to Beyoncé, the US really has a lot of legendary musicians, so making a list of the top American singers wasn’t an easy task.\n\nBut we managed to make a selection of all the singers who Americans are very proud of.\n\nKeep reading to check if you’re familiar with all of them!\n\n1. Frank Sinatra\n\nWell, you’re surely familiar with our first artist – he is, after all, one of the most iconic singers of all time.\n\nFrank Sinatra was really one of a kind.\n\nHis music was inspired by easy-listening tunes, jazz standards, and swing era – but he also added his own touch and brought jazz into the sphere of popular music.\n\nIn fact, Sinatra called himself a saloon singer – nevertheless, many of his tunes became timeless classics.\n\nSinatra’s greatest hits include “My Way”, “New York, New York”, and “Fly Me To The Moon”, just to name a few.\n\n2. Bruce Springsteen\n\nBruce Springsteen is by far the most famous American singer in the world right now.\n\nHis career spans six decades, which means his music is familiar to all generations.\n\nSpringsteen’s impact on music, especially the rock genre, is undeniable – he released many successful albums and hits.\n\n“Born To Run”, “Dancing In The Dark”, and “My Way” are considered to be American classics.\n\nAnd Rolling Stones magazine described him as “the embodiment of rock & roll.”\n\n3. Aretha Franklin\n\nKnown as the Queen of Soul, Aretha Franklin is widely regarded as one of the greatest American singers of all time.\n\nShe was a real creative force, especially in the 1970s, and many of her songs are considered classics, including “Respect”, “Chain of Fools”, and “Natural Woman.”\n\nAretha won 18 Grammy Awards, and she was also the first woman to be listed in the Rock and Roll Hall of Fame in 1987.\n\nAnd she is also noted for her activism for civil and women’s rights.\n\nAretha Franklin was a skilled, hard-working, and conscious artist, and she inspired many singers that came after her.\n\n4. Michael Jackson\n\nIt’s time to celebrate another American music legend – Michael Jackson.\n\nThe King of Pop was definitely a unique and innovative artist, and his contribution to music and culture in general was immense.\n\nHis music videos such as “Beat It”, “Billie Jean”, and “Thriller” are credited with breaking racial barriers.\n\nHis iconic album Thriller became the best-selling album of all time.\n\nAnd, of course, he popularized moonwalk.\n\nAll in all, Michael Jackson really changed music history, and he will always be remembered as one of the most influential American musicians.\n\n5. Mariah Carey\n\nWithout a doubt, Mariah Carey is one of the most famous American singers in the world.\n\nWith a five-octave vocal range, she is also regarded as one of the best vocalists of her generation.\n\nMoreover, Mariah was the first artist to have five singles rank number one on the Billboard Hot 100 chart.\n\nAnd her Christmas hit “All I Want For Christmas Is You” is literally everywhere during holidays – every single year.\n\nMariah Carey’s other big hits include “Hero” and “Always Be My Baby.”\n\n6. Elvis Presley\n\nThe King of Rock and Roll is, of course, among the top 10 most famous American singers in music history.\n\nHis voice and singing style were truly unique, and his live performances and unmatched energy made him a rock icon.\n\nSo it comes as no surprise that he was proclaimed the second best ‘Voice of the Century’ by BBC.\n\nHis songs “Suspicious Minds”, “Hound Dog”, and “Pretty Woman” are all-time classics.\n\nAll things considered, Elvis truly had a natural talent – and his superstar look was a cherry on the top.\n\n7. Bob Dylan\n\nRegarded as one of the greatest songwriters of all time, Bob Dylan definitely deserves a spot on this list.\n\nHe changed the meaning of popular music, and he influenced many artists who came after him.\n\nMost of his best work originates in the 60s, and some of these songs became civil rights and anti-war anthems.\n\nSince 1994, he has also published eight books of drawings and paintings.\n\nThat being said, Dylan is surely an innovative and versatile artist and a true living music legend.\n\nDylan’s most recognizable songs include “Mr. Tambourine Man”, “Hurricane”, and “Don’t Think Twice, It’s Alright.”\n\n8. Whitney Houston\n\nNicknamed The Voice, Whitney Houston is another American music icon.\n\nShe had one of the most powerful voices, and with more than 200 million records sold worldwide, she is one of the best-selling artists of all time.\n\nShe is best-known for her masterful performance of Dolly Parton’s “I Will Always Love You.”\n\nAlthough she didn’t originally write the song, her rendition inspired many singers to use it as an audition song and follow their dreams.\n\nHer other famous hits include “I Wanna Dance With Somebody” and “I Have Nothing.”\n\n9. Stevie Wonder\n\nWhen it comes to most popular US singers, Stevie Wonder is definitely high on the list.\n\nHe has been a creative force for nearly six decades now – in other words, he is a true living legend.\n\nStevie Wonder was just a kid when he started his musical career in the 1960s – he became known as a child musical prodigy, and at the age of 13, he became the youngest artist ever to top the chart.\n\nThroughout his career, Wonder recorded many critically acclaimed albums and received 25 Grammy Awards.\n\nHe also became one of the best-selling music artists of all time.\n\nWonder’s most famous songs include “Superstition” and “I Just Called To Say I Love You.”\n\n10. Marvin Gaye\n\nMarvin Gaye is hands down one of the most famous American singers in history.\n\nHe had an unforgettable silky voice that accompanied his songs brilliantly.\n\nGaye started out as an in-house session player and then began his music solo career.\n\nEventually, he became one of the most influential artists of his era.\n\nHe helped to shape the sound of Motown in the 1960s, and his music influenced several contemporary subgenres such as neo soul.\n\n“Sexual Healing”, “Heard It Through The Grapevine”, and “What’s Going On” are just some of Marvin Gaye’s classics.\n\n11. Prince\n\nIn short, Prince was a musical genius.\n\nAnd with his unique style, moves, and incredible stage presence, he was a superstar.\n\nHe was also a skilled multi-instrumentalist, and he often played most of the instruments on his recordings.\n\nIn fact, he played all the instruments for his first album For You, and all tracks on the album were produced, arranged, composed, and performed by Prince.\n\nBesides his impressive vocal range and creativity, he was also known for his flamboyant, androgynous persona.\n\nAll in all, Prince was one of a kind, and his contribution to music and culture will never be forgotten.\n\n12. James Brown\n\nDubbed the Godfather of Soul, James Brown is another iconic US singer who made his mark on American culture.\n\nBrown was a leading figure in the funk genre and 20th century music in general, and he was one of the first 10 inductees into the Rock and Roll Hall of Fame.\n\nHe was known for his hard work and unique vocal abilities, and many of his songs turned out to be timeless classics – “I Feel Good” and “Sex Machine”, to name a few.\n\nHis music was covered and sampled by many other famous musicians, including Madonna, Public Enemy, Run-D.M.C., Britney Spears, and George Michael.\n\nFinally, Brown received numerous accolades and awards during his lifetime, and his work will be celebrated for many years to come.\n\n13. Ella Fitzgerald\n\nKnown as the First Lady of Song and Queen of Jazz, Ella Fitzgerald is regarded as one of the most influential American singers in history.\n\nFitzgerald was known for her scat singing, vocal improvisation with wordless vocables.\n\nShe is responsible for countless hits, and she collaborated with Duke Ellington, Louis Armstrong, and other music legends.\n\nHer most recognizable songs include “A-Tisket, A-Tasket”, “Dream A Little Dream”, and “It Don’t Mean a Thing.”\n\nThere’s no doubt about it – Ella Fitzgerald changed the music scene of her era, and her contribution to the jazz genre is immense.\n\n14. Tina Turner\n\nTina Turner is often referred to as the “Queen of Rock ‘n’ Roll”, although she also wrote in genres like R&B and soul.\n\nEither way, she was a real creative force and hands down one of the most popular singers in America.\n\nBefore becoming a global superstar, Tina started out as the lead singer of the Ike and Tina Turner Revue.\n\nAnd she eventually became one of the best-selling recording artists of all time.\n\nHer biggest hits include “What’s Love Got To Do With It” and “The Best.”\n\n15. Steven Tyler\n\nAlthough he also had a solo career, Steven Tyler is mostly associated with Aerosmith.\n\nAnd it’s hard to imagine Aerosmith’s music without Steven Tyler’s voice.\n\nHe has one of the most powerful voices in the music industry.\n\nBut he is also known for his energetic live performance and even stage acrobatics.\n\nAll in all, he is an incredible performer, and one of the best rock singers of his generation.\n\n16. Ray Charles\n\nRay Charles is among the top American singers in history for a reason – he had incredible vocals as well as an impactful music career.\n\nPlus, he made some iconic tunes such as “Hit The Road Jack” and “What I’d Say.”\n\nRay Charles truly had a golden voice, and his performances were full of surprises.\n\nHe influenced many famous artists such as Elvis Presley, Aretha Franklin, and Stevie Wonder.\n\nAnd he left the world a substantial musical legacy – over the course of his career, he recorded more than 50 albums.\n\n17. Steve Perry\n\nDubbed The Voice, Steve Perry is widely known for his incredible singing skills.\n\nHe was the lead singer of the legendary rock band Journey, and he was inducted into the Rock and Roll Hall of Fame as a member of the band.\n\nAnd he ranked No. 76 on Rolling Stone’s 100 Greatest Singers of All Time.\n\nPerry also had a successful solo career between the mid-1980s and mid-1990s.\n\nNevertheless, his voice is mainly associated with Journey and their hits such as “Don’t Stop Believin’” and “Separate Ways.”\n\n18. Eddie Vedder\n\nEddie Vedder is hands down one of the best vocalists in the music industry.\n\nHis incredible voice is an essential part of every Pearl Jam song.\n\nBut he also released multiple solo albums, including this year’s Earthling.\n\nHe also appeared as a guest vocalist in Temple of the Dog, a band formed by another great vocalist Chris Cornell.\n\nAll in all, Vedder contributed to the rock genre a lot, both as a Pearl Jam’s member and a solo artist.\n\n19. Sam Cooke\n\n“A Change Is Gonna Come,” “Bring It on Home to Me,” “You Send Me”… Sam Cooke recorded so many timeless songs during his lifetime.\n\nHe was a pioneer and one of the most influential American soul singers.\n\nSo although his life and career were cut too short, he managed to make his mark.\n\nBut he made a difference in other ways too – he took part in civil rights movements, and he used his influence and popularity to fight for racial equality.\n\n20. Janis Joplin\n\nJanis Joplin is one of the most iconic American rock stars of the 20th century.\n\nShe was widely known for her incredible vocal abilities and distinctive vocals.\n\nJoplin’s death was also premature, but she managed to make a huge impact on popular culture and her music still keeps inspiring new generations of musicians.\n\n“Me & Bobby McGee” is one of her biggest hits, although it was originally written by Kris Kristofferson – she changed the lyrics a little bit though.\n\nBut she made the song her own, and along with “Piece Of My Heart” and “Summertime”, it’s considered her signature song.\n\n21. Otis Redding\n\nOtis Redding is one of the best American singers of all time and a seminal artist in soul music.\n\nHe was a talented songwriter and singer, and his live performances were always mesmerizing.\n\nHis singing style influenced many soul artists of the 1960s.\n\nSome of Reddin’s most memorable songs include “I’ve Got Dreams To Remember” and “Try a Little Tenderness.”\n\nAnd shortly before his tragic death in a plane crash, Redding wrote and recorded his most iconic song “(Sittin’ On) The Dock of the Bay.”\n\n22. Stevie Nicks\n\nStevie Nicks joined Fleetwood Mac in 1975, and helped it become one of the greatest bands in music history.\n\nBut she also produced music as a solo artist, and her song “Edge Of Seventeen” is an iconic rock hit.\n\nRolling Stone named her the “Reigning Queen of Rock and Roll” – because that’s what she really is.\n\nNicks has incredible vocal power, and that’s one of the reasons she has a well-deserved spot on this list.\n\n23. Dolly Parton\n\nBorn in Tennessee, Dolly Parton started singing when she was 7, and eventually became a country star.\n\nWith a career that spans nearly five decades, she is arguably one of the most famous American singers of all time.\n\nHer greatest hits include “Jolene”, “9 To 5”, and “I Will Always Love You” (popularized by Whitney Houston.)\n\nParton is also a successful businesswoman – she owns a record label and an entertainment company.\n\nAll things considered, she is a talented and versatile artist who worked hard to get where she is now.\n\n24. Al Green\n\nAl Green is another US-born singer who made an impact on the music scene, especially the soul genre.\n\nHe is best known for his series of soul hit singles in the early 1970s, including “Let’s Stay Together” and “Love And Happiness.”\n\nAnd he remains one of the best vocalists in the music industry.\n\nHe has great control of his voice, but his singing also sounds so smooth and effortless.\n\nGreen won 11 Grammy Awards so far, including the Grammy Lifetime Achievement Award.\n\n25. Willie Nelson\n\nWith a career spanning 7 decades, Willie Nelson is a living legend.\n\nAs one of the main figures of outlaw country, he made a huge impact on the country genre.\n\nHe started off as a songwriter though – he wrote Patsy Cline’s “Crazy”, for example.\n\nNelson’s albums Shotgun Willie (1973), Redheaded Stranger (1975) and Stardust (1978) brought him commercial success, and he maintained his popularity in the following decades.\n\nHe is responsible for many iconic songs such as “Always On My Mind” and “On The Road Again.”\n\n26. Johnny Cash\n\nJohnny Cash is widely regarded as one of the best country singers of all time, even though he also worked in other music genres.\n\nThe Man in Black was known for his deep baritone voice and memorable music characterized by percussive guitar.\n\nHe achieved a lot with his Tennessee Three backing band, and in a way, he created a subgenre of his own.\n\nCash released many successful albums and songs throughout his long career, but his 1968 album Johnny at Folsom Prison is arguably his most popular album.\n\n27. Barbra Streisand\n\nWith a career spanning over six decades, Barbra Streisand is a legendary diva.\n\nShe is one of the stars of the Golden Age of Hollywood, so it’s incredible that she is still active and touring.\n\nStreisand is generally one of the best-selling artists of all time, and a receiver of many awards – she is among the few artists awarded an Emmy, Grammy, Oscar, and Tony.\n\nAnd she is still loved by millions for her distinctive voice and endless energy.\n\nBarbra Streisand’s greatest hits include “Memory”, “Somewhere”, and “The Way We Were.”\n\n28. Etta James\n\nJamesetta Hawkins, known professionally as Etta James, was one of the most influential and versatile singers in her time.\n\nShe started her career in 1954, and she performed in various genres including soul, rock and roll, gospel, and R&B.\n\nHer vocal performances were enchanting, and her earthy voice left no one indifferent.\n\nEtta James’ best-known song is “At Last”, but she also achieved great success with “I’d Rather Go Blind” and “Something’s Got A Hold On Me.”\n\n29. Billie Holiday\n\nNicknamed “Lady Day”, Billie Holiday was an innovative jazz and swing music singer known for her hauntingly beautiful voice and impressive improvisational skills.\n\nShe also introduced new ways of manipulating phrasing and tempo, and she influenced many jazz musicians that came after her.\n\nBillie Holiday had a short career and life, but she managed to create a substantial musical legacy.\n\nHer most notable songs include “Solitude”, “Strange Fruit”, and “Blue Moon.”\n\n30. Billy Joel\n\nBilly Joel is an American singer, songwriter, and pianist who rose to fame in the 1970s.\n\nHe is nicknamed the “Piano Man”, after his album and signature song.\n\nJoel is also one of the best-selling music artists of all time, and many of his 80s songs remain popular to this day, including “Uptown Girl” and “We Didn’t Start The Fire.”\n\nAll things considered, he is without a doubt one of the most successful American singers.\n\n31. Beyoncé\n\nSpeaking of successful American singers… This list wouldn’t be complete without Beyoncé.\n\nShe rose to fame as a member of the iconic group Destiny’s Child, but she became even more popular after embarking on a solo career.\n\nThanks to her incredible vocal abilities, performance skills, and endless creativity, Beyoncé established herself as one of the most important singers in the music industry.\n\nThroughout her career, she recorded many chart-topping hits – “Crazy In Love”, “Halo”, “Break My Soul”, just to name a few.\n\n32. Karen Carpenter\n\nKaren Carpenter is a legendary American singer best known for her work with her brother Richard – together they performed as the Carpenters.\n\nThe Carpenters were one of the biggest-selling American pop groups of all time, and their music wouldn’t be the same without Karen.\n\nShe was a great vocalist, but she was also an amazing drummer.\n\nUnfortunately, her life was cut short due to anorexia.\n\nHowever, her talent and music legacy will never be forgotten.\n\n33. Madonna\n\nOf course, we didn’t forget about the Queen of Pop.\n\nMadonna is definitely one of the most famous singers in American history, with a career now spanning over three decades.\n\nShe moved from Michigan to New York at the age of 20, and eventually became the best-selling female recording artist of all time.\n\nFrom 80s hits like “Material Girl” and “La Isla Bonita” to modern pop songs like “Hung Up” and “Living For Love”, Madonna really created an impressive catalog of hits.\n\nAnd she doesn’t seem to be running out of inspiration and energy.\n\n34. Kurt Cobain\n\nWhen it comes to the best American rock singers in history, Kurt Cobain is hard to forget.\n\nAs the lead vocalist, guitarist and primary songwriter of Nirvana, Cobain was definitely the most influential musician of his generation.\n\nHe committed suicide when he was 27, but he managed to make his longlasting mark on the rock genre.\n\nSome of Nirvana’s most iconic songs include “Smells Like Teen Spirit”, “Come As You Are”, and “Lithium.”\n\n35. Nat King Cole\n\nLet’s finish this list with one of the most iconic American jazz artists in history: the one and only, Nat King Cole.\n\nOver the course of his career, Cole recorded a large number of successful hits, and he was generally one of the most popular entertainers in the 50s and the 60s.\n\nBesides making popular hits and performing with his trio, Cole also acted in films and performed on Broadway, so he was also a cultural icon.\n\nBest American Singers – Final Thoughts\n\nThere are many other famous singers from the U.S.A. who deserve to be on this list, so it wasn’t easy to make the final cut.\n\nOn the other hand, all of the artists we included made a significant impact on the American music scene and culture in general.\n\nSimilar Articles:\n\nBest Singers of All Time\n\nBest Gay Singers"}]}