{"Akhurst was born in London, England.": [{"url": "https://d.lib.rochester.edu/camelot/creator/william-akhurst", "page_content": "William Mower Akhurst was born in London in 1822. By the time he emigrated to Australia in his mid-twenties, he had already staged two plays at Cremorne Gardens (a London music hall in operation 1845-77). In Australia, he worked for both The Herald and Argus newspapers as a journalist and as their music and drama critic, but he is best remembered for his work as a playwright. Theatre was a popular form of entertainment in the Austrailian colonies. In The Pattern of Australian Culture, A. L. McLeod writes that \"[t]he outstanding feature of Australian theatre in the 1860's was the apparently insatiable appetite for Shakespeare . . . But coeval with this was its antithesis – crude melodrama and vaudeville. Lavishly staged but devoid of art\" (322). These lavish performances were well attended by the predominantly male population, and audience participation was expected. The Argus review of Akhurst's 1855 play about their gold rush reported \"pungent allusions to passing events, the greater part of which were heartily taken up by the audience\" (quoted in Serle 60). Another feature of these presentations is suggested in The Cambridge Encyclopedia of Australia:\n\nWilliam Mower Akhurst was born in London in 1822. By the time he emigrated to Australia in his mid-twenties, he had already staged two plays at Cremorne Gardens (a London music hall in operation 1845-77). In Australia, he worked for both The Herald and Argus newspapers as a journalist and as their music and drama critic, but he is best remembered for his work as a playwright.\n\n\n\nTheatre was a popular form of entertainment in the Austrailian colonies. In The Pattern of Australian Culture, A. L. McLeod writes that \"[t]he outstanding feature of Australian theatre in the 1860's was the apparently insatiable appetite for Shakespeare . . . But coeval with this was its antithesis – crude melodrama and vaudeville. Lavishly staged but devoid of art\" (322). These lavish performances were well attended by the predominantly male population, and audience participation was expected. The Argus review of Akhurst's 1855 play about their gold rush reported \"pungent allusions to passing events, the greater part of which were heartily taken up by the audience\" (quoted in Serle 60). Another feature of these presentations is suggested in The Cambridge Encyclopedia of Australia:\n\nthe most popular way of avoiding censorship restrictions – and even baiting the censor – was with pantomime and burlesque, some adapting English pantomimes with local reference. ... The best-known authors of this genre were the British playwright and critic William Mower Akhurst … and Garnet Walch. (Bambrick 317)\n\n[t]he problem that besets so much delving into early Australian drama – that the texts have long since vanished – does not apply here, since the pantomime was usually printed in full as part of the theatre programme, with italics emphasizing the excruciating puns in which such pieces abounded, so that if one didn't see the joke at once, it could be worked out later at home. (Williams 64)\n\nAdd to that historian Geoffrey Serle's comment that \"[t]he theatre in the early fifties was little more than a branch of the liquor industry\" (362), and one gets the idea that these productions must have been raucous events!Akhurst was central to the growth of the theater during the tumultuous years leading up to Australian independence. The Oxford Companion to Australian Literature says \"[d]uring the 1860s he was the life-force of Melbourne’s pantomime productions\" (Wilde 20). And, fortunately for us,Two of Akhurst's plays deal with the Arthurian legend, and they are very similar. King Arthur, or, Launcelot the Loose, Gin-ever the Square, and the Knights of the Round Table, and other Furniture (performed in Australia in 1868) and Arthur the King, or, The Knights of the Round Table and Other Funny-ture (performed in England in 1871) have the same plot and characters, and even the same dialogue. Both mention Lord Tennyson's Idylls and Gustave Doré's Arthurian images. The same \" excruciating puns\" (Elaine on the barge is \"a gal on a bier\") appear in both. The essential difference is that the Australian version is heavily laden with references to local politicians and other characters. A political system in its infancy, a gold rush, and Akhurst's connection to the two major newspapers were all grist for the mill. An extreme example is given in this reference to Edward Langton, who had been appointed Treasurer of the newly formed government:Sir K. That trash! Some who such trash have soldHave risen to the trasherer, I'm told.Arthur. That's la'n'g't on thickAkhurst returned to London in 1871, where \"he produced another sixteen pieces, including nine pantomimes and four dramas\" (Wilde 20). He was returning Australia in 1878, but died at sea.Dr. Clay Djubal, founding contributor to the wonderful website The Australian Variety Theatre Archive, has written much about Austrailian theatre. He has also written a wonderful biography of Akhurst: http://ozvta.files.wordpress.com/2011/02/akhurst-wm-23122012.pdf . I appreciate his help with my research."}, {"url": "https://www.wallofcelebrities.com/celebrities/lucy-akhurst/biography.html", "page_content": "Lucy Akhurst - Biography\n\nLucy Akhurst was born Lucy Akhurst-Webster in London, England. A few years later, her family moved to the northeast of England and she attended school (which she hated) there. She left her drama school (which she also loathed) early, having been discovered by the BBC and cast in a lead role in the convention-breaking drama All Quiet on the Preston Front (1994). Since then she has worked steadily in television and on such films as Trois Anglaises en campagne (1998) and Trinity (2003), a British/Canadian co-production, and the horror/comedy hit Shaun of the Dead (2004).\n\n"}, {"url": "https://www.wikitree.com/wiki/Akhurst-24", "page_content": "Alfred John Akhurst\n\nabout Sep 1864 in North Woolwich, London, England Bornin\n\nAncestors\n\n[children unknown]\n\nabout Dec 1943 at about age 79 in Romford registration district, Essex, London, England Diedin\n\nProfile last modified 19 Mar 2023 | Created 30 Jun 2015\n\nThis page has been accessed 84 times.\n\nBiography\n\nAlfred John Akhurst was born in the September quarter of 1864 in the Greenwich registration district of London, England. His parents were William Thomas Akhurst and Jane (Saunders) Akhurst,\n\nHe was baptized aged 7 years old at St. Mark’s Church, Victoria Docks, London on 7 Jul 1872 along with some of his siblings.\n\nAlfred married a widow, Elizabeth Fardon nee Patterson in the June quarter of 1900 in the West Ham registration district of London.\n\nAlfred died aged 79 in the December quarter of 1943 in the Romford Registration District, London.\n\n1871 Census\n\nResidence: Silvertown, Essex, England\n\n\n\nHousehold Role Gen Age Birthplace Occupation William Akhurst Head M 41 Broxted, Kent Wire Welder telegraph Jane Akhurst Wife F 41 Mitcham, Surrey Jane Akhurst Dau F 18 Mitcham, Surrey Eliza Akhurst Dau F 15 Woolwich, Kent Emilia Akhurst Dau F 13 Woolwich, Kent Mary Ann Akhurst Dau F 11 Woolwich, Kent Charles W Akhurst Son M 8 Woolwich, Kent Alfred Akhurst Son M 7 Woolwich, Kent Alice Akhurst Dau F 4 Woolwich, Kent Arthur W Akhurst Son M 2 West Ham, Essex\n\n1881 Census\n\nResidence: Grey St. West Ham, Essex, England\n\n\n\nHousehold Role Gen Age Birthplace Occupation Jane Akhurst Head F 50 Mitcham, Surrey Needlewoman Emily Akhurst Dau F 23 Woolwich, Kent Factory woman Charles W Akhurst Son M 18 Woolwich, Kent Labourer in factory Alfred J Akhurst Son M 16 Woolwich, Kent Labourer in factory Alice Akhurst Dau F 14 North Woolwich, Kent factory girl Arthur W Akhurst Son M 12 Kent William T Akhurst Son M 9 Silvertown, Essex Cable maker\n\n1891 Census\n\nResidence: Grey St. West Ham, Essex, England\n\n\n\nHousehold Role Gen Age Birthplace Occupation Jane Akhurst Head F 61 Surrey Alfred J Akhurst Son M 26 Woolwich, Kent Dock Labourer Alice Akhurst Dau F 24 North Woolwich, Kent Steam packing maker Arthur W Akhurst Son M 22 Kent Electric cable joiner William T Akhurst Son M 19 Essex Cable maker\n\n1901 Census\n\nResidence: Amelia St. West Ham, Essex, England\n\n\n\nHousehold Role Gen Age Birthplace Occupation Alfred J Akhurst Head M 36 Woolwich, Kent General Labourer Elizabeth M Akhurst Wife F 33 Silvertown, Kent Alice V Akhurst Dau F 0 Silvertown, Kent Francis Fardon Step Son M 14 Silvertown Van boy Joshua Fardon Step Son M 2 Silvertown Annie E Fardon Step Dau F 12 Silvertown, Kent Ellen L Fardon Step Dau F 9 Silvertown, Kent Elizabeth R Fardon Step Dau F 8 Silvertown, Kent Arthur Hyde Boarder M 35 Silvertown General Labourer Elizabeth Hyde Boarder F 29 Silvertown Alice Hyde Boarder F 0 Silvertown\n\n1911 Census\n\nResidence: West Ham, Essex, England\n\n\n\nHousehold Role Gen Age Birthplace Occupation Alfred J Akhurst Head M 47 Woolwich, Kent Fitter’s labourer Elizabeth M Akhurst Wife F 42 Bethnal Green Alice Akhurst Dau F 10 Silvertown, Kent William Akhurst Son F 8 Silvertown, Kent Caroline Akhurst Dau F 6 Silvertown, Kent Alfred Akhurst Son F 4 Silvertown, Kent Frank Fardon Step Son M 24 Silvertown Rubber works Annie Fardon Step Dau F 22 Silvertown, Kent Rubber worker Joshua Fardon Step Son M 12 Silvertown\n\nSources\n\nBirth\n\nEngland & Wales General Register Office, GRO Online Index – Birth (https://www.gro.gov.uk/gro/content: accessed [8 Jul 2021], database entry for Akhurst, Alfred John (Mother’s maiden name SANDERS) GRO Reference: 1864 S Quarter in GREENWICH Volume 01D Page 708\n\nMarriage\n\n\"Marriage Index\" (https://www.freebmd.org.uk/cgi/districts.pl?r=103991300:9576&d=bmd_1624925507: accessed [8 Jul 2021]) FreeBMD, database online for Alfred John Ackhurst and Elizabeth Fardon, Marriages 1900 Jun Quarter District: West Ham: Vol. 4A Page 233.\n\nCensus 1871\n\n\"England and Wales Census, 1871\", database with images, FamilySearch (https://familysearch.org/ark:/61903/1:1:VFFK-4B8 : 19 February 2021), Alfred Akhurst in entry for William Akhurst, 1871.\n\nCensus 1881\n\n\"England and Wales Census, 1881,\" database with images, FamilySearch (https://familysearch.org/ark:/61903/1:1:Q27C-Y1SR : 11 December 2017), Alfred J Akhurst in household of Jane Akhurst, West Ham, Essex, England; from \"1881 England, Scotland and Wales Census,\" database and images, findmypast (http://www.findmypast.com : n.d.); citing p. 32, Piece/Folio 1716/142, The National Archives, Kew, Surrey; FHL microfilm 101,774,512.\n\nCensus 1891\n\n\"England and Wales Census, 1891,\" database with images, FamilySearch (https://familysearch.org/ark:/61903/1:1:Q2RD-P2M : 22 February 2021), Alfred J Akhurst in household of Jane Akhurst, West Ham, Essex, England, United Kingdom; from \"1891 England, Scotland and Wales census,\" database and images, findmypast (http://www.findmypast.com : n.d.); citing PRO RG 12, Essex county, subdistrict, The National Archives of the UK, Kew, Surrey.\n\nCensus 1901\n\n\"England and Wales Census, 1901,\" database, FamilySearch (https://familysearch.org/ark:/61903/1:1:X9NC-S1M : 20 May 2019), Alfred J Akhurst, West Ham, Essex, England, United Kingdom; from \"1901 England, Scotland and Wales census,\" database and images, findmypast (http://www.findmypast.com : n.d.); citing Canning Town subdistrict, PRO RG 13, The National Archives, Kew, Surrey.\n\nCensus 1911\n\n\"England and Wales Census, 1911,\" database, FamilySearch (https://familysearch.org/ark:/61903/1:1:XWFS-ZPR : 22 June 2019), Alfred John Akhurst, West Ham, Essex, England, United Kingdom; from \"1911 England and Wales census,\" database and images, findmypast (http://www.findmypast.com : n.d.); citing PRO RG 14, The National Archives of the UK, Kew, Surrey.\n\nDeath\n\nEngland & Wales General Register Office, GRO Online Index - Death (https://www.gro.gov.uk/gro/content : accessed [8 Jul 2021]), database entry for Akhurst, Alfred J (Age at death: 79) GRO Reference: 1943 D Quarter in Romford Volume 4A Page 670"}, {"url": "https://www.idolbirthdays.net/lucy-akhurst", "page_content": "Does Lucy Akhurst Dead or Alive?\n\nAs per our current Database, Lucy Akhurst is still alive (as per Wikipedia, Last update: May 10, 2020).\n\n🎂 Lucy Akhurst - Age, Bio, Faces and Birthday\n\nCurrently, Lucy Akhurst is 47 years, 6 months and 22 days old. Lucy Akhurst will celebrate 48rd birthday on a Saturday 18th of November 2023. Below we countdown to Lucy Akhurst upcoming birthday.\n\nDays Hours Minutes Seconds\n\nPopular As Lucy Akhurst Occupation Actress Age 47 years old Zodiac Sign Sagittarius Born November 18, 1975 ( London, England, United Kingdom) Birthday November 18 Town/City London, England, United Kingdom Nationality United Kingdom\n\n🌙 Zodiac\n\nLucy Akhurst’s zodiac sign is Sagittarius. According to astrologers, Sagittarius is curious and energetic, it is one of the biggest travelers among all zodiac signs. Their open mind and philosophical view motivates them to wander around the world in search of the meaning of life. Sagittarius is extrovert, optimistic and enthusiastic, and likes changes. Sagittarius-born are able to transform their thoughts into concrete actions and they will do anything to achieve their goals.\n\n🌙 Chinese Zodiac Signs\n\nLucy Akhurst was born in the Year of the Rabbit. Those born under the Chinese Zodiac sign of the Rabbit enjoy being surrounded by family and friends. They’re popular, compassionate, sincere, and they like to avoid conflict and are sometimes seen as pushovers. Rabbits enjoy home and entertaining at home. Compatible with Goat or Pig.\n\nSome Lucy Akhurst images\n\nBiography/Timeline\n\nShe also appeared in the 2004 series of the BBC's Monarch of the Glen. Akhurst provided the voiceovers for EastEnders in March 2009 for the Mitchell family storyline.\n\nLucy Akhurst trend"}, {"url": "https://www.wikitree.com/wiki/Akhurst-26", "page_content": "Arthur William Akhurst\n\nabout Mar 1869 in North Woolwich, London, England Bornin\n\nAncestors\n\n[spouse(s) unknown]\n\n[children unknown]\n\nabout Mar 1931 at about age 62 in Woolwich registration district, London, England Diedin\n\nProfile last modified 9 Jul 2021 | Created 30 Jun 2015\n\nThis page has been accessed 112 times.\n\nBiography\n\nArthur William Akhurst was born in the March quarter of 1869 in North Woolwich, London, England. His parents were William Thomas Akhurst and Jane (Saunders) Akhurst,\n\nHee was baptized aged 3 years old at St. Mark’s Church, Victoria Docks, London on 7 Jul 1872 along with some of his siblings.\n\nArthur married Charlotte Eleanor Lavender in the Dec quarter of 1891 in the West Ham registration district of Kent.\n\nAbout 1905 the family moved from West Ham to Netley in Hampshire.\n\nArthur died aged 62 in the Mar quarter of 1931 in the Woolwich Registration District, London.\n\n1871 Census\n\nResidence: Silvertown, Essex, England\n\n\n\nHousehold Role Gen Age Birthplace Occupation William Akhurst Head M 41 Broxted, Kent Wire Welder telegraph Jane Akhurst Wife F 41 Mitcham, Surrey Jane Akhurst Dau F 18 Mitcham, Surrey Eliza Akhurst Dau F 15 Woolwich, Kent Emilia Akhurst Dau F 13 Woolwich, Kent Mary Ann Akhurst Dau F 11 Woolwich, Kent Charles W Akhurst Son M 8 Woolwich, Kent Alfred Akhurst Son M 7 Woolwich, Kent Alice Akhurst Dau F 4 Woolwich, Kent Arthur W Akhurst Son M 2 West Ham, Essex\n\n1881 Census\n\nResidence: Grey St. West Ham, Essex, England\n\n\n\nHousehold Role Gen Age Birthplace Occupation Jane Akhurst Head F 50 Mitcham, Surrey Needlewoman Emily Akhurst Dau F 23 Woolwich, Kent Factory woman Charles W Akhurst Son M 18 Woolwich, Kent Labourer in factory Alfred J Akhurst Son M 16 Woolwich, Kent Labourer in factory Alice Akhurst Dau F 14 North Woolwich, Kent factory girl Arthur W Akhurst Son M 12 Kent William T Akhurst Son M 9 Silvertown, Essex Cable maker\n\n1891 Census\n\nResidence: Grey St. West Ham, Essex, England\n\n\n\nHousehold Role Gen Age Birthplace Occupation Jane Akhurst Head F 61 Surrey Alfred J Akhurst Son M 26 Woolwich, Kent Dock Labourer Alice Akhurst Dau F 24 North Woolwich, Kent Steam packing maker Arthur W Akhurst Son M 22 Kent Electric cable joiner William T Akhurst Son M 19 Essex Cable maker\n\n1901 Census\n\nResidence: West Ham, Essex, England\n\n\n\nHousehold Role Gen Age Birthplace Occupation Arthur Akhurst Head M 32 Silvertown, Essex Electrical Engineer Charlotte E Akhurst Wife F 27 Chelsea Maud E Akhurst Dau F 8 Silvertown, Essex Arthur J Akhurst Son M 5 Silvertown, Essex Alice M Akhurst Dau F 2 Custom House, Essex Florence M Akhurst Dau F 0 Custom House, Essex\n\n1911 Census\n\nResidence: Netley Abbey, Hampshire, England\n\n\n\nHousehold Role Gen Age Birthplace Occupation Arthur Akhurst Head M 42 Silvertown, Essex Electrician Charlotte Akhurst Wife F 36 Chelsea, London Arthur Akhurst Son M 15 Silvertown, Essex Alice Akhurst Dau F 12 Custom House, Essex Florence Akhurst Dau F 10 Custom House, Essex Florence Akhurst Dau F 10 Custom House, Essex Winifred Akhurst Dau F 6 Netley, Hampshire Grace Akhurst Dau F 3 Netley, Hampshire Victor Akhurst Son M 1 Netley, Hampshire\n\nSources\n\nBirth\n\nEngland & Wales General Register Office, GRO Online Index – Birth (https://www.gro.gov.uk/gro/content: accessed [8 Jul 2021], database entry for Akhurst, Arthur William (Mother’s maiden name SAUNDERS) GRO Reference: 1869 M Quarter in WOOLWICH Volume 01D Page 921\n\nMarriage\n\n\"Marriage Index\" (https://www.freebmd.org.uk/cgi/districts.pl?r=108582966:3945&d=bmd_1624925507: accessed [8 Jul 2021]) FreeBMD, database online for Arthur William Akhurst and Charlotte Elenor Leavender, Marriages 1891 Dec Quarter District: West Ham: Vol. 4A Page 197.\n\nCensus 1871\n\n\"England and Wales Census, 1871\", database with images, FamilySearch (https://familysearch.org/ark:/61903/1:1:VFFK-4B6 : 19 February 2021), Arthur W Akhurst in entry for William Akhurst, 1871.\n\nCensus 1881\n\n\"England and Wales Census, 1881,\" database with images, FamilySearch (https://familysearch.org/ark:/61903/1:1:Q27C-Y1QD : 11 December 2017), Arthur Akhurst in household of Jane Akhurst, West Ham, Essex, England; from \"1881 England, Scotland and Wales Census,\" database and images, findmypast (http://www.findmypast.com : n.d.); citing p. 32, Piece/Folio 1716/142, The National Archives, Kew, Surrey; FHL microfilm 101,774,512.\n\nCensus 1891\n\n\"England and Wales Census, 1891,\" database with images, FamilySearch (https://familysearch.org/ark:/61903/1:1:Q2RD-5PZ : 22 February 2021), Arthur W Akhurst in household of Jane Akhurst, West Ham, Essex, England, United Kingdom; from \"1891 England, Scotland and Wales census,\" database and images, findmypast (http://www.findmypast.com : n.d.); citing PRO RG 12, Essex county, subdistrict, The National Archives of the UK, Kew, Surrey.\n\nCensus 1901\n\n\"England and Wales Census, 1901,\" database, FamilySearch (https://familysearch.org/ark:/61903/1:1:X9NC-8MR : 20 May 2019), Arthur Akhurst, West Ham, Essex, England, United Kingdom; from \"1901 England, Scotland and Wales census,\" database and images, findmypast (http://www.findmypast.com : n.d.); citing Canning Town subdistrict, PRO RG 13, The National Archives, Kew, Surrey.\n\nCensus 1911\n\n\"England and Wales Census, 1911,\" database, FamilySearch (https://familysearch.org/ark:/61903/1:1:XWQK-N2S : 4 July 2019), Arthur Akhurst, Netley Abbey, Hampshire, England, United Kingdom; from \"1911 England and Wales census,\" database and images, findmypast (http://www.findmypast.com : n.d.); citing PRO RG 14, The National Archives of the UK, Kew, Surrey.\n\nDeath\n\nEngland & Wales General Register Office, GRO Online Index - Death (https://www.gro.gov.uk/gro/content : accessed [8 Jul 2021]), database entry for Akhurst, Arthur William (Age at death: 62) GRO Reference: 1931 M Quarter in Woolwich Volume 1D Page 35"}, {"url": "https://www.wikitree.com/wiki/Akhurst-106", "page_content": "William Mower Akhurst\n\n2 Dec 1822 in Hammersmith, London, England Bornin\n\nSon of [father unknown] and [mother unknown]\n\n[sibling(s) unknown]\n\n[spouse(s) unknown]\n\nDescendants\n\n6 Jun 1878 at age 55 in At Sea Diedin\n\nProfile last modified 8 Aug 2021\n\nThis page has been accessed 119 times.\n\nBiography\n\nWilliam was born in December 1822 and was baptised at St George Hanover Square on 24 January 1823.[1] He was the eldest son of William Akhurst and Harriet (Dickinson) Akhurst.\n\nHe married Ellen Tully at St George's in Bloomsbury on 26 October 1845. He gave his occupation as merchant and she was an actor.[2][3]\n\nThey had children: Ellen (1846), Francis (1847), Adrian (1848), Arthur (1851), Sidney (1852), Walter (1854), William (1854), Ellen (1856), William (1858), Sophia (1859), Thomas (1861), Victor (1863), Oscar (1864).\n\nWilliam and Ellen, with their eldest (surviving) child Adrian, emigrated to Australia aboard the 'Posthumous' landing in Adelaide in June 1849.[4][5]\n\nHe initially worked as a reporter for the Adelaide Times. He was briefly editor of the Free Press before moving on to work as a sub-editor and music critic for the Melbourne Argus. At the same time writing several plays and more than a dozen pantomimes.\n\nWilliam sailed back to England on the 'Kent' in February 1870.[6] In 1871 he and wife Ellen were living in Finsbury with daughter Ellen aged 14.[7]\n\nHe passed away in June 1878, at the age of 55, while returning to Australia from England aboard the ship 'Patriarch'.[8][9][10]\n\nSources\n\n↑ Bishops Transcripts, St George Hanover Square, Westminster; (Image on Ancestry$) ↑ St George Bloomsbury Parish Register; London Metropolitan Archives; London, England; London Church of England Parish Registers; Reference Number: P82/GEO1/030 ↑ FreeBMD. England & Wales, Civil Registration Marriage Index, 1837-1915; William Mower Akhurst and Ellen Tully, Oct-Dec qtr 1845, St Giles, Vol 1, pg 84 ↑ South Australian Register, 23 Jun 1849, pg 2 [1] ↑ Passenger List https://bound-for-south-australia.collections.slsa.sa.gov.au/1849Posthumous.htm ↑ Kent Passenger List - image [2] ↑ 1871 UK Census - RG10; Piece: 348; Folio: 54; Page: 7; GSU roll: 824607 ↑ The National Archives of the UK; Kew, Surrey, England; Registers of Births, Deaths and Marriages; Class: BT 158; Piece: 4 ↑ Obituary - The Herald, 23 Nov 1878, pg 3 [3] ↑ 'Death of William Mower Akhurst' [4]\n\nhttps://en.wikipedia.org/wiki/William_Akhurst\n\nClay Djubal. \"W.M. Akhurst.\" Australian Variety Theatre Archive, Practitioners: A.[5]\n\nWorks of W M Akhurst [6]\n\nArticle - W.M. Akhurst Portrait: is it or isn’t it? [7]"}, {"url": "https://celebs.filmifeed.com/wiki/lucy-akhurst/", "page_content": "Lucy Akhurst is a British actress, writer, and director, who won ”2004 Atlantic City Film Festival Awards” for her work in Every Seven Years (2004). Her first on-screen role was in The Cinder Path as Polly Benton in 1994. From 2000 to 2016, Lucy executed the role of Liz Jameson / Keeley Carson in ‘Holby City’. Born on November 18, 1975, Lucy Akhurst hails from London, United Kingdom. As in 2023, Lucy Akhurst's age is 47 years. Check below for more deets about Lucy Akhurst. This page will put a light upon the Lucy Akhurst bio, wiki, age, birthday, family details, affairs, controversies, caste, height, weight, rumors, lesser-known facts, and more.\n\nLucy Akhurst Biography:\n\nLucy Akhurst Age and Birthday Lucy Akhurst was born on November 18, 1975 in London, United Kingdom.\n\nLucy Akhurst Wiki:\n\nEdit Profile\n\nLucy Akhurst Family Details Lucy Akhurst‘ father’s name is N/A and Lucy Akhurst‘ mother’s name is N/A. Her father\u0092s name and her mother\u0092s name are not known. There is no data accessible with respect to family background and siblings.\n\nLucy Akhurst Trivia Lucy Akhurst was born in London, United Kingdom.\n\nLucy Akhurst‘s birth sign is Scorpio.\n\nHer alternate name is Lucy Ackhurst.\n\nShe won ”2004 Atlantic City Film Festival Awards” for her work in Every Seven Years (2004).\n\nHer first on-screen role was in The Cinder Path as Polly Benton in 1994.\n\nFrom 2000 to 2016, Lucy executed the role of Liz Jameson / Keeley Carson in ‘Holby City’.\n\nHer recent television roles have included Julia Drummond-Ward in ‘Hotel Portofino’ and Elizabeth Elliott in ‘A Spy Among Friends’. ((Lucy Akhurst – Wikipedia)) ((Lucy Akhurst – IMDb))\n\nGoogle Search Trends of Lucy Akhurst Lucy Akhurst‘s search trend from the last 12 months (The below graph report is directly fetched from the ‘Google Trends’):\n\nFAQs\n\nLucy Akhurst was born on November 18, 1975.\n\nAs in 2023, Lucy Akhurst's age is 47 years.\n\nLucy Akhurst‘s birth sign is Scorpio.\n\nLucy Akhurst was born in London, United Kingdom.\n\nAs per the report, Lucy Akhurst lives in London, England, United Kingdom.\n\nLucy Akhurst‘s hobbies are Reading, photography, learning, traveling, internet surfing and to name a few.\n\nLucy Akhurst holds British nationality.\n\nLucy Akhurst‘s Instagram profile link read as .\n\nMost searched terms about Lucy Akhurst on the Internet are Lucy Akhurst age, Lucy Akhurst wiki, Lucy Akhurst photos, Lucy Akhurst lover, Lucy Akhurst instagram, Lucy Akhurst facebook, Lucy Akhurst family, Lucy Akhurst salary, Lucy Akhurst height, Lucy Akhurst bio, Lucy Akhurst income, Lucy Akhurst house, Lucy Akhurst latest news, Lucy Akhurst tiktok, Lucy Akhurst dating, Lucy Akhurst musically.\n\nFact Check:\n\nWe strive for accuracy and fairness. If you see something that doesn’t look right, Contact Us."}, {"url": "https://www.wikiwand.com/en/William_Akhurst", "page_content": "William Mower Akhurst (29 December 1822 – 6/7 June 1878) was an actor, journalist and playwright in Australia.\n\nAkhurst was born in Hammersmith, London or Brook Street, Grosvenor Square, London, a son of William Akhurst (1793–1866) and Harriet Akhurst, née Dickinson (c. 1788–1869), who married in 1845. From age 14 to 26 he worked for a firm of merchants in the manchester goods, but his real interest was in performing and writing for the theatre. In 1847 he wrote two pieces for Greenwood, the manager of the Cremorne Gardens theatre: A Barber's Blunders and The Bosjemans (Bosjesmen?), both of which were successfully staged that year.[1]\n\nHe emigrated to Australia, arriving in Adelaide by the barque Posthumous, in June 1849.[2] and found employment as reporter and sub-editor for James \"Dismal Jemmy\" Allen's newly launched Adelaide Times.\n\nHe came to public attention when he assisted the widow and orphan children of a fellow journalist, who died at sea after a long illness, leaving her destitute.[3] He gave the theatre-going public a taste of his play-writing talents with musical sketches or plays: Quite Colonial, and Romance and Reality at several of the concerts given by the Nelson family[4] while that troupe was in Adelaide May–August 1853. A third, The Rights of a Woman, would be performed in Melbourne 24 July 1854. The songs were written by Akhurst to fit recognised tunes as played on the piano by Sidney Nelson.[lower-alpha 1]\n\nOn 15 October 1853 he launched a newspaper, South Australian Free Press, which failed to thrive and ceased publication with the issue of 1 April 1854. This was the era of gold fever, when much of South Australia's population had left for the goldfields of Victoria and New South Wales, to the detriment of their home colony's economy. Akhurst collected what outstanding subscriptions he could,[5] and joined the \"rush\". Melbourne was in its boom years, and Akhurst had no trouble finding employment; he joined the Melbourne Argus as sub-editor and music critic. Subsequently, he wrote fourteen pantomimes; one of his burlesques, the Siege of Troy, running for sixty nights, and Knights of the Round Table also popular, both starring Richard Stewart and H. R. Harwood with scene painting (in those days as much a drawcard as the acting) by John Hennings. In February 1870 he returned to England, and wrote pantomimes for Astley's, the Pavilion, and the Elephant and Castle theatres. He died on board the Patriarch, on the return voyage to Sydney.[6][7]"}, {"url": "https://www.findagrave.com/memorial/236190993/william-mower-akhurst", "page_content": "William was a son to Harriet nee Dickenson and William Akhurst. He was an actor, composer, journalist and playwright. His wife was an actor too.\n\n\n\nHe married Ellen Tully in England in 1845 and they were both aged around 23 at that time. After starting a family in London, they and their surviving children all moved to Adelaide in 1849 on board a ship called 'Posthumous'. One of the children, Adrian, was a newborn. Ellen and William would have been around 27 years of age when they moved. They had children in Australia too, with some born first in Adelaide, then Melbourne and then Sydney. Some of their children are yet to be located:\n\n\n\n1. Ellen Florence Sep Q 1846 Holborn Union, England-Holborn Union 1847 Sep Q BDM UK says aged zero\n\n2. Francis William Dec Q 1847 Holborn Union-Holborn Union Dec Q 1848 aged one\n\n3. Arthur William 1851 Adelaide-1907 Wycombe, England aged 56\n\n4. Ellen Florence 1856 East Melbourne-\n\n5. Victor Hugo 1863 Fitzroy-\n\n\n\nTwo of their children who were born and died young in Melbourne, Sophia Maria and William James, are buried in the same common public ground area in Melbourne cemetery. Including William and Sophia, a total of five of their children that we are aware of died in childhood, so this excludes children #4 and #5 in the list above.\n\n\n\nWilliam died at sea on board a ship called 'Patriarch' on a return trip from England to Sydney.\n\n\n\nSources:\n\nhttps://www.austlit.edu.au/austlit/page/A41794\n\nhttps://en.wikipedia.org/wiki/William_Akhurst#cite_note-2\n\n-----\n\n\n\nDEATH OF WILLIAM MOWER AKHURST.\n\nTO THE EDITOR.\n\nSir—The death of this gentleman once well known in the literary circles of Adelaide and Melbourne deserves a passing notice. Mr. Akhurst was a pioneer of this colony, and in the older times was reporter and sub editor of the Adelaide Times when James Allen, better known as \"Dismal Jimmy\" on account of his doleful aspect and lugubrious articles, was the proprietor of that journal, and whose dullness was only relieved by Akhurst's racy leaders.\n\n\n\nMr. Akhurst was subsequently editor of the Free Press, which existed only about six months. Shortly after the decease of that journal Mr. Akhurst repaired with his family to Melbourne during the feverish height of the gold digging times, where his gifted powers soon obtained him employment on the staff of the Argus, where as journalist and burlesque writer for the stage he remained a popular man for some years.\n\n\n\nLatterly in England his witty and ludicrous pantomimes delighted crowded audiences at several of the leading theatres in London.\n\n\n\nHe was again on his return to these colonies, but died on board the Patriarch, sailing vessel, on June 6th last, during her voyage from London to Sydney, somewhere about the age of 55 or 56.\n\n\n\nOld colonists will well remember his genial social qualities, amiable disposition, and kindly nature, that never made an enemy; his infinite jest and ready humor,that used to \"set the table in a roar;\"and they will give a sigh to the memory of \"Poor Akhurst,\" to whom glad life seemed so sweet and joyous a boon.\n\n\n\nJ. BOND PHIPSON.\n\nAugust 19th, 1878.\n\nFrom The Express and Telegraph 21/8/1878 page 2\n\nWilliam was a son to Harriet nee Dickenson and William Akhurst. He was an actor, composer, journalist and playwright. His wife was an actor too.\n\n\n\nHe married Ellen Tully in England in 1845 and they were both aged around 23 at that time. After starting a family in London, they and their surviving children all moved to Adelaide in 1849 on board a ship called 'Posthumous'. One of the children, Adrian, was a newborn. Ellen and William would have been around 27 years of age when they moved. They had children in Australia too, with some born first in Adelaide, then Melbourne and then Sydney. Some of their children are yet to be located:\n\n\n\n1. Ellen Florence Sep Q 1846 Holborn Union, England-Holborn Union 1847 Sep Q BDM UK says aged zero\n\n2. Francis William Dec Q 1847 Holborn Union-Holborn Union Dec Q 1848 aged one\n\n3. Arthur William 1851 Adelaide-1907 Wycombe, England aged 56\n\n4. Ellen Florence 1856 East Melbourne-\n\n5. Victor Hugo 1863 Fitzroy-\n\n\n\nTwo of their children who were born and died young in Melbourne, Sophia Maria and William James, are buried in the same common public ground area in Melbourne cemetery. Including William and Sophia, a total of five of their children that we are aware of died in childhood, so this excludes children #4 and #5 in the list above.\n\n\n\nWilliam died at sea on board a ship called 'Patriarch' on a return trip from England to Sydney.\n\n\n\nSources:\n\nhttps://www.austlit.edu.au/austlit/page/A41794\n\nhttps://en.wikipedia.org/wiki/William_Akhurst#cite_note-2\n\n-----\n\n\n\nDEATH OF WILLIAM MOWER AKHURST.\n\nTO THE EDITOR.\n\nSir—The death of this gentleman once well known in the literary circles of Adelaide and Melbourne deserves a passing notice. Mr. Akhurst was a pioneer of this colony, and in the older times was reporter and sub editor of the Adelaide Times when James Allen, better known as \"Dismal Jimmy\" on account of his doleful aspect and lugubrious articles, was the proprietor of that journal, and whose dullness was only relieved by Akhurst's racy leaders.\n\n\n\nMr. Akhurst was subsequently editor of the Free Press, which existed only about six months. Shortly after the decease of that journal Mr. Akhurst repaired with his family to Melbourne during the feverish height of the gold digging times, where his gifted powers soon obtained him employment on the staff of the Argus, where as journalist and burlesque writer for the stage he remained a popular man for some years.\n\n\n\nLatterly in England his witty and ludicrous pantomimes delighted crowded audiences at several of the leading theatres in London.\n\n\n\nHe was again on his return to these colonies, but died on board the Patriarch, sailing vessel, on June 6th last, during her voyage from London to Sydney, somewhere about the age of 55 or 56.\n\n\n\nOld colonists will well remember his genial social qualities, amiable disposition, and kindly nature, that never made an enemy; his infinite jest and ready humor,that used to \"set the table in a roar;\"and they will give a sigh to the memory of \"Poor Akhurst,\" to whom glad life seemed so sweet and joyous a boon.\n\n\n\nJ. BOND PHIPSON.\n\nAugust 19th, 1878.\n\nFrom The Express and Telegraph 21/8/1878 page 2"}]}