{"Lucy Akhurst has also appeared in the films The Mummy Returns (2001), The Libertine (2004), and The Descent (2005).": [{"url": "https://www.insider.com/mummy-movie-brendan-fraser-cast-photos-where-are-they-now-2021-11", "page_content": "Fraser is currently enjoying a career renaissance.\n\nBrendan Fraser on Busy Philipps' show \"Busy Tonight\" in 2019. Jordin Althaus/E! Entertainment/NBCU Photo Bank/NBCUniversal via Getty Images\n\nFollowing his star turn as O'Connell (a role he reprised for the 2001 sequel \"The Mummy Returns\"), Fraser continued to act, playing lead roles in films including \"Bedazzled,\" \"Journey to the Center of the Earth,\" \"Inkheart,\" and \"The Mummy: Tomb of the Dragon Emperor.\"\n\nThe actor also appeared on numerous TV shows, voicing characters on \"King of the Hill\" and \"Fairly Oddparents,\" and guest-starring on \"Scrubs\" and \"Titans.\" He also had recurring roles on \"Texas Rising,\" \"The Affair,\" and \"Doom Patrol.\"\n\nFraser has kept a lower profile in recent years, but is currently enjoying a new phase of his career, which some fans have dubbed the \"Brenaissance.\"\n\nIn 2021, for example, he starred in Steven Soderbergh's crime drama \"No Sudden Move,\" and is set to appear opposite Leonardo DiCaprio and Robert De Niro in Martin Scorsese's upcoming drama \"Killers of the Flower Moon.\"\n\nFraser will also play the villain in an upcoming \"Batgirl\" film."}, {"url": "https://www.republicworld.com/entertainment-news/hollywood-news/the-mummy-returns-cast-list-of-actors-and-the-characters-they-play-in-this-2001-classic.html", "page_content": "The Mummy Returns is a 2001 movie that has been very popular over the years. Various Mummy movies have come out since the 90s and The Mummy Returns is one of the most popular ones. Perhaps, it is because of the cast of The Mummy Returns and also the characters which are interesting enough to make the audience of today also want to watch the movie. Even after about two decades, people remember this movie. Know about the details of The Mummy Returns cast members.\n\nREAD MORE: My Christmas Love Cast: List All The Actors And The Characters They Play In The Movie\n\nThe Mummy Returns cast: List of all the actors and the characters they play\n\nBrendan Fraser as Rick O'Connell\n\nFraser plays the role of Rick O'Connell, an important character to the Mummy franchise. He leads an expedition to the city of the dead priest, Imhotep. The adventure takes some surprising turns later in the movie. He was recently seen in, Trust and Doom Patrol.\n\nRachel Weisz as Evelyn Carnahan\n\nRachel plays the role of Evelyn Carnahan, a British Librarian. She mistakenly wakes up Imhotep and has to fight for her life when he tries to sacrifice her. She was recently seen in The Constant Gardener, The Light Between Oceans and The Lobster.\n\nREAD MORE: 'City Slickers' Cast: Read The List Of Actors And Characters They Play In This 90s Comedy\n\nJohn Hannah as Jonathan Carnahan\n\nJonathan Carnahan is Evelyn's sister in the movie, he gives the map of Hamunaptra city which he stole from Rick. Played by John Hannah the two siblings set off to rescue Rick. He was recently seen on the marvel series, Agents of S.H.E.I.L.D.\n\nREAD MORE: 'The Christmas Train' Cast: See Details About Actors In This Hallmark Original\n\nPatricia Velasquez as Anck-su-namun\n\nActor Patricia Velasquez plays the role of Anck-su-namun. She is Imhotep's lady love and also Pharaoh Seti's mistress in the movie. She was seen in series like Arrested Development, The L Word and American Family.\n\nArnold Vosloo as Imhotep\n\nArnold plays the role of Imhotep the dead priest and is absolutely terrifying. Imhotep is the mummy who brings back plagues and clears out a group of treasure hunters and is scary to the bones. The actor was a major part of the G.I Joe franchise as well and played in various other movies and TV shows.\n\nREAD MORE: 'Vegas Vacation' Cast: List Of Actors And Characters They Play In This 1997 Comedy\n\nIMAGE CREDITS: @bex_disney IG"}, {"url": "https://www.rogerebert.com/reviews/the-mummy-returns-2001", "page_content": "1. The ads give the Rock, the World Wrestling Federation star, equal billing with Fraser. This is bait-and-switch. To call his appearance a \"cameo\" would be stretching it. He appears briefly at the beginning of the movie, is transmuted into a kind of transparent skeletal wraith and disappears until the end of the film, when he comes back as the dreaded Scorpion King. I am not sure, at the end, if we see the real Rock or merely his face, connected to computer-generated effects (his scorpion is blown up to giant size, which has the unfortunate effect of making him look more like a lobster tail than a scorpion). I continue to believe the Rock has an acting career ahead of him, and after seeing this movie I believe it is still ahead of him.\n\n2. Alex, the kid, adds a lot to the movie by acting just like a kid. I particularly enjoyed it when he was kidnapped by a fearsome adversary of his parents, chained and taken on a long journey, during which he drove his captor crazy by incessantly asking, \"Are we there yet?\"\n\n3. The dialogue \"You have started a chain reaction that could bring about the next Apocalypse\" is fascinating. Apparently we missed the first Apocalypse, which does not speak well for it.\n\n4. I have written before of the ability of movie characters to outrun fireballs. In \"The Mummy Returns,\" there is a more amazing feat. If the rising sun touches little Alex while he is wearing the magical bracelet, he will die (it is written). But Rick, carrying Alex in his arms, is able to outrace the sunrise; we see the line of sunlight moving on the ground right behind them. It is written by Eratosthenes that the Earth is about 25,000 miles around, and since there are 24 hours in a day, Rick was running approximately 1,041 miles an hour.\n\n5. One of the big action sequences involves a battle between two vast armies, which stretch as far as computer-generated effects can see. One army is human. The other army is made of countless creatures named Anubis that look like giant savage dogs that stand upright and run on their hind legs (it is not done well, but one is surprised to find it done at all). These armies clash in bloody swordplay. Each dog-creature, as it is killed, reverts to the desert sand from whence it sprang. Finally all the creatures are destroyed, and we see the victors standing around feeling victorious and wishing that high-fives had been invented. And we notice that not one single member of the victorious army is dead or even wounded. Pathetic, that thousands of years of ancient curses and spells could engender such an incompetent army of dog-sand-creatures."}, {"url": "https://www.looper.com/234931/what-the-cast-of-the-mummy-is-doing-today/", "page_content": "Brendan Fraser plays the adventurous Rick O'Connell, who leads an expedition to Hamunaptra, the city of the dead where the high priest Imhotep's corpse resides. When it turns out that the fearsome legends about this mysterious city are true, his travels take a deadly turn.\n\nAfter starring in The Mummy, Fraser returned to play Rick in The Mummy Returns and The Mummy: Tomb of the Dragon Emperor. He was also part of the ensemble cast of the Academy Award-winning film Crash, coincidentally playing another character named Rick, and had an impactful guest role on Scrubs as Ben Sullivan.\n\nFraser was sexually assaulted in 2003, and has discussed the deep depression he endured in the years following. The death of his mother and a bitter divorce added to the pressures upon him, and he felt that he needed to disappear from the public eye. \"I bought into the pressure that comes ... with a professional life that's being molded and shaped and guided and managed,\" Fraser said in a 2018 interview with GQ. \"That requires what they call thick skin ... I just felt I couldn't be a part of it. I didn't feel that I belonged.\"\n\nHappily, Fraser has enjoyed a career rebirth in recent years. You may have spotted him in Trust, Condor, or Doom Patrol, where he provides a particularly delightful take on the DC Comics hero Robotman."}, {"url": "https://www.metacritic.com/redirectcritic?m=mummyreturns", "page_content": "Clearly 'The Mummy Retourns' doesn't lie about being a lame sequel of the first movie. There are several metajokes about it in here. So don't expect the scenario to be different. I had no expectation for it but still got pretty surprised.\n\n\n\nSpecial effects seem to be a big deal in this movie. Clearly 'The Mummy Retourns' doesn't lie about being a lame sequel of the first movie. There are several metajokes about it in here. So don't expect the scenario to be different. I had no expectation for it but still got pretty surprised.\n\n\n\nSpecial effects seem to be a big deal in this movie. I found they were very good at the beginning but yeah, not far from becoming more and more disgusting as the plot moves on. The more we get to the end, the more we witness surrealistic scenes. And there are numerous false connections. Characters don't stop to fast-travel even when they are in the same room. These facts tend to make me dislike 'The Mummy Returns'.\n\n\n\nDialogues remains as dumb and lifeless as in the first opus. Characters spend their time explaining the plot, reminding us who each protagonist is, trying to problematize the movie, emphazing the ridiculous drama of the situation. The kid specially is awful: his presence is the reason to showcase silly situations and lines. The couple Rick + Evelyn is terrible. They tried to make them seem like accomplices but it doesn't match at all. They spend their onscreen time kissing and licking each other. Each and every Evelyn appearance seems to be an occasion to make her look and sound hot and horny. At this point it is pretty lear to me that Sommers had some major fantasies about hot female archaeologists. His movie jus was not the best place to underline it. Evy's brother which I found terrific in the first movie is here one of the silliest and repelling character of all. He is just so one-dimensional, and his jokes always fall apart.\n\n\n\nI have to admit though that this movie was highly entertaining. There are some fast-paced action scenes, some characters are well developped, and it becomes funny to see until which point were Sommers ready to go in order to surprise the spectator. It however felt endless. Let's watch it as a historical event of our times: it is the very first appearance of Dwayne Johnson in a movie. (At this point he iss still very close to be the most over-paid actor in the industry... Funny to witness him making his debut as CGI poorly-animated scorpion king heh !) … Expand"}, {"url": "https://celebs.filmifeed.com/wiki/lucy-akhurst/", "page_content": "Lucy Akhurst is a British actress, writer, and director, who won ”2004 Atlantic City Film Festival Awards” for her work in Every Seven Years (2004). Her first on-screen role was in The Cinder Path as Polly Benton in 1994. From 2000 to 2016, Lucy executed the role of Liz Jameson / Keeley Carson in ‘Holby City’. Born on November 18, 1975, Lucy Akhurst hails from London, United Kingdom. As in 2023, Lucy Akhurst's age is 47 years. Check below for more deets about Lucy Akhurst. This page will put a light upon the Lucy Akhurst bio, wiki, age, birthday, family details, affairs, controversies, caste, height, weight, rumors, lesser-known facts, and more.\n\nLucy Akhurst Biography:\n\nLucy Akhurst Age and Birthday Lucy Akhurst was born on November 18, 1975 in London, United Kingdom.\n\nLucy Akhurst Wiki:\n\nEdit Profile\n\nLucy Akhurst Family Details Lucy Akhurst‘ father’s name is N/A and Lucy Akhurst‘ mother’s name is N/A. Her father\u0092s name and her mother\u0092s name are not known. There is no data accessible with respect to family background and siblings.\n\nLucy Akhurst Trivia Lucy Akhurst was born in London, United Kingdom.\n\nLucy Akhurst‘s birth sign is Scorpio.\n\nHer alternate name is Lucy Ackhurst.\n\nShe won ”2004 Atlantic City Film Festival Awards” for her work in Every Seven Years (2004).\n\nHer first on-screen role was in The Cinder Path as Polly Benton in 1994.\n\nFrom 2000 to 2016, Lucy executed the role of Liz Jameson / Keeley Carson in ‘Holby City’.\n\nHer recent television roles have included Julia Drummond-Ward in ‘Hotel Portofino’ and Elizabeth Elliott in ‘A Spy Among Friends’. ((Lucy Akhurst – Wikipedia)) ((Lucy Akhurst – IMDb))\n\nGoogle Search Trends of Lucy Akhurst Lucy Akhurst‘s search trend from the last 12 months (The below graph report is directly fetched from the ‘Google Trends’):\n\nFAQs\n\nLucy Akhurst was born on November 18, 1975.\n\nAs in 2023, Lucy Akhurst's age is 47 years.\n\nLucy Akhurst‘s birth sign is Scorpio.\n\nLucy Akhurst was born in London, United Kingdom.\n\nAs per the report, Lucy Akhurst lives in London, England, United Kingdom.\n\nLucy Akhurst‘s hobbies are Reading, photography, learning, traveling, internet surfing and to name a few.\n\nLucy Akhurst holds British nationality.\n\nLucy Akhurst‘s Instagram profile link read as .\n\nMost searched terms about Lucy Akhurst on the Internet are Lucy Akhurst age, Lucy Akhurst wiki, Lucy Akhurst photos, Lucy Akhurst lover, Lucy Akhurst instagram, Lucy Akhurst facebook, Lucy Akhurst family, Lucy Akhurst salary, Lucy Akhurst height, Lucy Akhurst bio, Lucy Akhurst income, Lucy Akhurst house, Lucy Akhurst latest news, Lucy Akhurst tiktok, Lucy Akhurst dating, Lucy Akhurst musically.\n\nFact Check:\n\nWe strive for accuracy and fairness. If you see something that doesn’t look right, Contact Us."}, {"url": "https://www.moviefone.com/movie/the-mummy-returns/9001/main/", "page_content": "The Mummy Returns (2001) \"The most powerful force on earth is about to be unleashed by the two people who should know better.\"\n\nAudience Score 63 PG-13 2 hr 10 min Fantasy, Action, Adventure\n\nRick and Evelyn O’Connell, along with their 8-year-old son Alex, discover the key to the legendary Scorpion King’s might: the fabled Bracelet of Anubis. Unfortunately, a newly resurrected Imhotep has designs on the bracelet as well, and isn’t above kidnapping its new bearer, Alex, to gain control of Anubis’s otherworldly army.\n\nShow More"}, {"url": "https://www.metacritic.com/redirectcritic?m=mummyreturns", "page_content": "Clearly 'The Mummy Retourns' doesn't lie about being a lame sequel of the first movie. There are several metajokes about it in here. So don't expect the scenario to be different. I had no expectation for it but still got pretty surprised.\n\n\n\nSpecial effects seem to be a big deal in this movie. Clearly 'The Mummy Retourns' doesn't lie about being a lame sequel of the first movie. There are several metajokes about it in here. So don't expect the scenario to be different. I had no expectation for it but still got pretty surprised.\n\n\n\nSpecial effects seem to be a big deal in this movie. I found they were very good at the beginning but yeah, not far from becoming more and more disgusting as the plot moves on. The more we get to the end, the more we witness surrealistic scenes. And there are numerous false connections. Characters don't stop to fast-travel even when they are in the same room. These facts tend to make me dislike 'The Mummy Returns'.\n\n\n\nDialogues remains as dumb and lifeless as in the first opus. Characters spend their time explaining the plot, reminding us who each protagonist is, trying to problematize the movie, emphazing the ridiculous drama of the situation. The kid specially is awful: his presence is the reason to showcase silly situations and lines. The couple Rick + Evelyn is terrible. They tried to make them seem like accomplices but it doesn't match at all. They spend their onscreen time kissing and licking each other. Each and every Evelyn appearance seems to be an occasion to make her look and sound hot and horny. At this point it is pretty lear to me that Sommers had some major fantasies about hot female archaeologists. His movie jus was not the best place to underline it. Evy's brother which I found terrific in the first movie is here one of the silliest and repelling character of all. He is just so one-dimensional, and his jokes always fall apart.\n\n\n\nI have to admit though that this movie was highly entertaining. There are some fast-paced action scenes, some characters are well developped, and it becomes funny to see until which point were Sommers ready to go in order to surprise the spectator. It however felt endless. Let's watch it as a historical event of our times: it is the very first appearance of Dwayne Johnson in a movie. (At this point he iss still very close to be the most over-paid actor in the industry... Funny to witness him making his debut as CGI poorly-animated scorpion king heh !) … Expand"}, {"url": "https://www.imdb.com/list/ls068935256/", "page_content": "IIB | 124 min | Action, Adventure, Fantasy\n\n48 Metascore\n\nAt an archaeological dig in the ancient city of Hamunaptra, an American serving in the French Foreign Legion accidentally awakens a mummy who begins to wreak havoc as he searches for the reincarnation of his long-lost love.\n\nDirector: Stephen Sommers | Stars: Brendan Fraser, Rachel Weisz, John Hannah, Arnold Vosloo\n\nVotes: 444,230 | Gross: $155.25M"}, {"url": "https://www.joblo.com/fo-face-off-the-mummy-vs-the-mummy-returns/", "page_content": "Come hither, come hither, enthusiasts of the surreal and profane! If it is thrills and mayhem you seek, then I am happy to welcome you to The Face Off – a trial to the death between two worthy foes. Those who remember last session will recall the titans DEADPOOL and LOGAN squaring off, with the clawed hero standing tall. But that was last time, and we have no time to dwell in the past. This week we have a dozy for you, as it takes us all the way back to ancient Egypt, and then fast forwards to early 20th century Egypt, which is still super old. Yes, prepare for a duel fit for pharaohs and gods between the adventure juggernauts – THE MUMMY and THE MUMMY RETURNS in honor of the Tom Cruise-led reboot hitting this weekend. Both films were directed by Stephen Sommers and starred a recurring cast including Brendan Fraser, Rachel Weisz, Arnold Vosloo and more. Given both movies are virtually identical in the director and cast field (the only difference being some extra characters rounding out RETURNS), we shall instead jump right into the nitty-gritty details, meaning these foes will have to strike each other harder and faster to get the win. Which will succeed? Loser is mummified on the spot.\n\nSTORY\n\nGenerations after high priest Imhotep ( Arnold Vosloo ) was mummified for having an affair with the Pharaoh’s mistress, a young egyptologist, Evelyn “Evie” Gardner ( Rachel Weisz ), enlists the help of dashing adventurer Rick O’Connell ( Brendan Fraser ) to help lead her to the ancient city of Hamunaptra. However, their quest for knowledge and glory unlocks the monstrous Imhotep, who wants to take over the world with his magic mummy powers out of revenge. An adventure across Egypt ensues, and plenty of mummies are killed in the name of saving the day and remaking a beloved horror classic into an INDIANA JONES-style adventure. That’s a good thing, right? The O’Connells are living a life of tomb raiding, exploring and domestic bliss, but once the story really kicks in it takes similar story elements from the first and goes all crazy with it. This time a resurrected Imhotep says, “ [email protected] it, I’ll just use some other guy’s army instead,” leading him to hunt for the Bracelet of Anubus which will lead him to the tomb of the Scorpion King ( Dwayne “Still at this point ‘The Rock'” Johnson ). The bracelet finds its way into the hands of the O’Connell’s and onto the wrist of their son, who is then kidnapped. Adventure across Egypt…mummy killings…save the day.\n\nNOTABLE BITS & LINES\n\nAncient Egypt Eaten by beetles!\n\n\n\nOpening raid on Hamunaptra\n\n\n\nRachel Weisz: Sexy, clusmsy egyptologist\n\n\n\nRiver boat assault.\n\n\n\n“Hey, Benny! It looks to me like you’re on the wrong side of the river!”\n\n\n\nRace to Hamunaptra\n\n\n\nBeetle crawls up the body.\n\n\n\nIt’s a Trap!\n\n\n\nThe Mummy Returns.\n\n\n\nLocusts!\n\n\n\nMummy screams, Fraser screams, we all scream.\n\n\n\n“This creature is the bringer of death. He will never eat, he will never sleep. He will never stop.”\n\n\n\nThe Mummy’s Kiss\n\n\n\nBecoming whole again.\n\n\n\nSand Attack!\n\n\n\nThe Mummy’s thugs.\n\n\n\nThe final fight Tale of the Scorpion King Escape from the Tomb\n\n\n\nRumble at O’Connell Manor\n\n\n\nThe beetles are back!\n\n\n\nThe Mummy Returns…again\n\n\n\nThe Mummy’s Thugs Return…again!\n\n\n\nMagic Balloon Ride\n\n\n\nGirl Fight!\n\n\n\nDon’t Go Getting Chased By Waterfalls\n\n\n\nMonkey Mummies!\n\n\n\nGoodbye, Rachel Weisz!\n\n\n\nFraser v. The Mummy Round 2\n\n\n\nHello, Rachel Weisz\n\n\n\nMutant CGI Scorpion-Dwayne Johnson\n\n\n\nBattle against Anubus’ Army\n\n\n\n“Go to Hell, and take your friends with you!”\n\n\n\nEscape from the Tomb 2\n\nEGYPTIAN ADVENTURE\n\nTHE MUMMY feels about as realistic as a movie like this can be, in terms of how an actual archeological adventure involving demon mummies would play out. There’s plenty of riding across the scenic desert, digging for treasure, feuding with other hunters, dealing with passionate locals and travailing through tombs. Much of it feels condensed into one location, but the thrills are still packed on and given a practical feel. The mummy henchmen designs still hold up, which is especially amazing given the movie is almost 20 years old. One thing THE MUMMY RETURNS certainly does is up the action and adventure. Whereas the first movie seemed to revolve around more intimate locations, the sequel is given much more room to play, and the breadth of the action scenes (particularly when armies are fighting). We see so much more of the landscape and Sommers sure tried his damnedest to kick up the spectacle. Sure, the VFX look like something ripped out of a PS2 game, but who cares? So much of it is so fun you kind of start to buy into the Johnson-Scorpion baby.\n\nCHARACTER DYNAMICS\n\nWith THE MUMMY director Stephen Sommers wanted to tell a classic adventure story fit with all the thrills and sweeping romance. At the heart of this are the debonair Rick and the intellectual Evie and their budding romance. A classic “opposites attract” story with Fraser handling the quips and heroism with vigor and Weisz counter-acting with a tenderness and smarts. There’s also Oded Fehr as Ardeth Bay, the leader of the Madji sworn to protect Hamunaptra. He acts as a different kind of foil for the main heroes, one that illuminates the cultural divide of the people who want to harvest Egypt for it’s historical artifacts, and the lifelong residents who want to protect its beauty and majesty (and the evil curses that may or may not be in them). There’s some solid characterization in this adventure flick, and it enriches what could’ve just been a mindless action blockbuster. Like many sequels, the action may be ramped-up but the characters feel somewhat left out. Fraser and Weisz are still good as Rick and Evie, but neither has the same infectious energy and spirit as they did in the first, spending a lot of time looking sullen over their kidnapped son (something to be sad over, no doubt). As well, there are other characters taking up time, like John Hannah as Evie’s brother, and the O’Connell kid (Freddie Boath) who is about as tolerable as any child actor in a blockbuster film. Most of the characters just seem to mesh into the scenario with many of the characteristics that made them interesting in the first film evaporated like the sand.\n\nTHE MUMMY\n\nThe one recurring element of this movie that feels drastically different in the films is that of the villain, Imhotep. We may not see him for a good chunk of this movie, but when we do his presence is heavy and often horrifying. The CGI holds up somewhat, and his fixation on Evie feels very Dracula-esuqe, with the kiss he gives her – his face still partially mummifed – remaining one of the film’s more notable moments. He goes through the transition from gnarly creature to human badass with malice, making him a fun villain to watch. In the sequel, however, he feels somewhat neutered. He spends more time confessing his love for Meela/ Anck-Su-Namun (Patricia Velasquez) and lifting people up with his telekinetic mummy powers. He just doesn’t have the same aggression as he did in the first film. I know it was all probably in the name of exploring a deeper side of the character, but the emo, love-stricken-teen angle is never a good side.\n\nAWARDS, PRAISE & MONEY\n\nThe Mummy"}]}