{"Lucy Akhurst has appeared in numerous television series, including The Bill, Casualty, and Holby City.": [{"url": "https://www.wikiwand.com/en/Lucy_Akhurst", "page_content": "Lucy Akhurst (born 18 November 1970) is an English actress, writer and director who has been working mainly in television since the 1990s. She starred alongside Neil Morrissey in The Vanishing Man and then came to prominence in a lead role in 1999's ITV seven-part drama Wonderful You.\n\nEnglish actress, writer and director\n\nQuick facts: Lucy Akhurst, Born, Occupation, Spouse... ▼\n\nShe appeared as Tim's (Simon Pegg) girlfriend for four episodes of UK comedy Spaced and also guest-starred as a zombie in Simon Pegg and Edgar Wright's comedy film Shaun of the Dead.\n\nShe also appeared in the 2004 series of the BBC's Monarch of the Glen.\n\nMore recently she wrote, produced and starred in Every Seven Years a short film that has won several awards. She also directed, co-produced and had a small part in the independent British film Morris: A Life with Bells On, written, co-produced by and starring her husband Chaz Oldham.[1][2]\n\nAkhurst provided the voiceovers for EastEnders in March 2009 for the Mitchell family storyline."}, {"url": "https://www.imdb.com/filmosearch/?role=nm0015300", "page_content": "Comedy\n\n7.4 Rate this 1 2 3 4 5 6 7 8 9 10 7.4 / 10 X\n\nSpock is tasked with looking after Dieter, a German exchange teacher who is coming to Roker Bridge. Dieter is joined by the beautiful Ingrid who he is desperate to impress by attempting to be cool but instead it become dangerous.\n\nStars: Caroline Catz, Alistair McGowan, Lucy Akhurst, Colin Buchanan\n\nVotes: 8"}, {"url": "https://www.rottentomatoes.com/celebrity/lucy_akhurst", "page_content": "Highest Rated: 61% The Land Girls (1998)\n\nLowest Rated: 9% Circus (2000)\n\nBirthday: Nov 18, 1975\n\nBirthplace: London, England, UK\n\nActress Lucy Akhurst was widely known for her presence on the silver screen. At the beginning of her acting career, Akhurst landed roles in action flicks like the Val Kilmer film \"The Saint\" (1997). She had an early role on the television special \"The Cinder Path\" (PBS, 1994-95). She worked in television in her early acting career as well, including a part on \"Midsomer Murders\" (ITV 1, 1996). She also landed a role in the miniseries \"Longitude\" (1999-2000). More recently, she earned a role in the action film \"Circus\" (2000) with John Hannah. She also worked in television around this time, including a part on \"Monarch of the Glen\" (BBC Scotland, 1999-2006). She also was featured in the TV movie \"Eroica\" (2003-04). Most recently, Akhurst acted on \"Spotless\" (Esquire Network, 2015-)."}, {"url": "https://www.amazon.co.uk/prime-video/actor/Lucy-Akhurst/amzn1.dv.gti.c132c851-ed22-4b33-953a-6df7c06e5f4a/", "page_content": "Select Your Cookie Preferences\n\nWe use cookies and similar tools that are necessary to enable you to make purchases, to enhance your shopping experiences and to provide our services, as detailed in our Cookie Notice. We also use these cookies to understand how customers use our services (for example, by measuring site visits) so we can make improvements.\n\nIf you agree, we’ll also use cookies to complement your shopping experience across the Amazon stores as described in our Cookie Notice. This includes using first- and third-party cookies, which store or access standard device information such as a unique identifier. Third parties use cookies for their purposes of displaying and measuring personalised ads, generating audience insights, and developing and improving products. Click ‘Customise Cookies’ to decline these cookies, make more detailed choices, or learn more. You can change your choices at any time by visiting Cookie Preferences, as described in the Cookie Notice. To learn more about how and for what purposes Amazon uses personal information (such as Amazon Store order history), please visit our Privacy Notice."}, {"url": "https://www.celebsagewiki.com/lucy-akhurst", "page_content": "Age, Biography and Wiki\n\nLucy Akhurst (Lucy Akhurst-Webster) was born on 18 November, 1975 in London, United Kingdom, is an Actress. Discover Lucy Akhurst's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 47 years old?\n\nPopular As Lucy Akhurst-Webster Occupation Actress Age 47 years old Zodiac Sign Scorpio Born 18 November 1975 Birthday 18 November Birthplace London, United Kingdom Nationality United Kingdom\n\nWe recommend you to check the complete list of Famous People born on 18 November. She is a member of famous Actress with the age 47 years old group.\n\nLucy Akhurst Height, Weight & Measurements\n\nAt 47 years old, Lucy Akhurst height not available right now. We will update Lucy Akhurst's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Lucy Akhurst's Husband?\n\nHer husband is Charles Thomas Oldham\n\nFamily Parents Not Available Husband Charles Thomas Oldham Sibling Not Available Children Not Available\n\nLucy Akhurst Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Lucy Akhurst worth at the age of 47 years old? Lucy Akhurst’s income source is mostly from being a successful Actress. She is from United Kingdom. We have estimated Lucy Akhurst's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actress\n\nLucy Akhurst Social Network\n\nInstagram Lucy Akhurst Instagram Linkedin Twitter Facebook Wikipedia Lucy Akhurst Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.liquisearch.com/lucy_akhurst", "page_content": "Lucy Akhurst (b. 18 November 1975 in London) is an English actress, writer and director who has been working mainly in television since the 1990s. She starred alongside Neil Morrisey in The Vanishing Man and then came to prominence in a lead role in 1999's ITV seven-part drama Wonderful you.\n\nShe appeared as Tim's (Simon Pegg) girlfriend for 4 episodes of UK comedy Spaced and also guest-starred as a zombie in Simon Pegg and Edgar Wright's comedy film Shaun of the Dead.\n\nShe also appeared in the 2004 series of the BBC's Monarch of the Glen.\n\nMore recently she wrote, produced and starred in Every Seven Years a short film that has won several awards. She also directed, co-produced and had a small part in the independent British film Morris: A Life with Bells On, written, co-produced by and starring her husband Chaz Oldham. She wrote an article in The Daily Mail about her experiences in making the film.\n\nAkhurst provided the voiceovers for EastEnders in March 2009 for the Mitchell family storyline."}, {"url": "https://www.kentlive.news/news/bill-holby-city-casualty-stars-5832494", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nSign up to our daily newsletter for all the latest Kent stories and breaking news delivered straight to your inbox.\n\nWe all love the thrill of an emergency service drama and they don’t come much better than Holby City, The Bill and Casualty.\n\nThe familiar faces of the hit TV shows have graced our screens for nearly three decades, but not everyone who starred in our favourite police and medical dramas has found fortune and fame.\n\nWhat happened to the actors who went from household names to distant memories?\n\nRead more: EastEnders, Coronation Street and Emmerdale soap stars who have fallen on hard times\n\nKentLive took a wander down memory lane and looked up what some of our favourite characters from the hit ITV and BBC dramas are up to now.\n\nVOTE FOR YOUR FAVOURITE PLACE IN THE WHOLE COUNTRY BELOW\n\nDebbie Roza - Casualty\n\n(Image: BBC)\n\nDebbie Roza played receptionist Susie Mercier in BBC One's hit drama Casualty.\n\nShe was actually the very first person to speak on the show and graced our screens for a year before departing.\n\nAfter Casualty, Susie took a very different career path, leaving acting behind.\n\nThe former actress has over 20 years of experience in Theatre and Museum marketing and now lives in Canada, where she is the owner of Lakewood Market Garden and is a Fund and Community Development Coordinator at VON Canada.\n\nSam Callis - The Bill\n\n(Image: TALKBACK THAMES)\n\nSam Callis is best known for playing both Callum Stone in The Bill and Adam Benjamin in London’s Burning.\n\nHe also starred in hit TV show Game of Thrones in 2012, but these days he spends more time behind the camera than in front of it.\n\nCallis’ most recent venture was producing a ten-minute short film called Whisper which was both shot and set along the coast on the Isle of Sheppey.\n\nMichael French - Holby City and Casualty\n\n(Image: BBC)\n\nMichael French played the cardiothoracic surgical registrar Nick Jordan.\n\nHe had roles in both Casualty and Holby City and even appeared in a Christmas crossover special in 2005.\n\nNick was known for rubbing his co-workers up the wrong way, which explained his many departures as he was transferred between hospitals.\n\nAfter leaving Casualty and Holby City he moved over to Albert Square, playing David Wicks in Eastenders up until 2014.\n\nHe made an appearance in the Sound of Music on stage in 2014, but that was the last he was seen on the acting scene.\n\nHe seems to have disappeared off the radar since.\n\nJeff Stewart - The Bill\n\n(Image: Talkback Thames)\n\nThe Bill’s Jeff Stewart was hit hard after being told his contract would not be renewed in 2008.\n\nAfter surviving a suicide attempt he spent much of his time at the Hotel Chelsea in New York City, befriending the building’s permanent residents.\n\nHe was staying at the hotel in 2011 when it changed ownership and closed to short-term guests, he refused to leave and called in the police to assist him .\n\nBrenda Fricker - Casualty\n\n(Image: Film Magic)\n\nBrenda Fricker might be an award-winning actress but that doesn't mean she's immune to falling on hard times.\n\nThe actress, who played nurse Megan Roach for four years until 1990, retired from acting in 2014.\n\nHer nine-year marriage to director Barry Davies ended in 1988 and she has not remarried since.\n\nShe went on to appear in several high profile films following her departure from Casualty, including So I Married an Axe Murderer, Angels in the Outfield and A Time to Kill.\n\nHowever, Brenda recently revealed she will be spending this Christmas alone in Ireland.\n\nThe Dublin-based actress explained: \"I’m 75 now, and I would be lying if I said it would be a nice and happy Christmas because I’m old and I live alone. It can be very dark.\n\n\"I turn the phone off and put the blinds down. I do pre-record some good programmes and I have my dog and I get myself through it that way.\"\n\nBruce Byron - The Bill\n\n(Image: ITV)\n\nThe Bill’s Bruce Byron, who played the role of DC Terry Perkins, has turned his hand to writing since leaving television.\n\n62-year-old Byron released a weight-loss guide for men, ‘Fat Bloke Slims’ , after shedding three stone in 2008.\n\nHe began a fortnightly column in Good Health documenting his struggle with weight.\n\nDawn McDaniel - Holby City\n\n(Image: BBC)\n\nActress Dawn played flirty cardiology registrar Kirstie Collins.\n\nDawn's character had several major storylines in the soap but departed from the show in series three when her father came back on the scene, after being estranged from his daughter for six years.\n\nDawn has since appeared in Soldier, Soldier as well as Thin Blue Line and London Bridge, but the star has not been seen on-screen since a 2008 episode of Hotel Babylon.\n\nShe doesn't appear to have any active social media profiles, suggesting she may have given up on stardom for good.\n\nChris Ellison - The Bill\n\n(Image: ITV)\n\nBruce Byron isn’t the only one who turned his hand to writing after The Bill was axed.\n\nChris Ellison, who played DCI Frank Burnside, released a memoir last year about his time on the show.\n\nWitness Statements features interviews with over 40 cast members and crew.\n\nAngela Griffin - Holby City\n\n(Image: WalesOnline)\n\nAngela Griffin is best known for her role as Fiona Middleton in Coronation Street, but she also appeared as ward sister Jasmine Hopkins in Holby City.\n\nJasmine had a turbulent stint on the show after being stabbed and suffering a miscarriage, but she didn't depart until series three after having an affair with another nurse.\n\nSince leaving Holby City, Angela is known for her voice acting in Postman Pat as well as her role in Waterloo Road.\n\nDespite maintaining a career in showbiz, the actress said she was snubbed by the profession for more than a year after taking on TV presenting roles.\n\nThe star said she was left “petrified and terrified” after the industry turned against her, leaving her out of work for 15 months.\n\nShe explained: “I did Angela and Friends, I did Emergency with Angela Griffin, I presented on the red carpet at the Oscars and the Golden Globes.\n\n“I did not think it would have an impact on my career as I thought, ‘Why? What difference does it make?’\n\n“But it did make a difference and I was out of work for 15 months. I was petrified and terrified.”\n\nJulia Watson - Casualty\n\n(Image: BBC)\n\nJulia Watson played doctor Baz Wilder who was best known for being romantically involved with Charlie.\n\nAfter leaving, she returned to the hospital in 1995 and had an affair with Charlie behind her husband's back.\n\nThe pair went on to have a son called Louis and got married in 1997, continuing their relationship long-distance when Baz left.\n\nHowever the couple split and when she returned in 2003 she was married to Dan Wilder, although the pair fell in love again until Baz was killed in a car crash in 2004.\n\nActress Julia Watson has appeared in Doctors, Not Going Out and Midsomer Murders, but mainly edits anthologies of poetry and readings for weddings and funerals these days.\n\nLuke Mably - Holby City\n\n(Image: YorkshireLive)\n\nLuke appeared in just three episodes of Holby City as ward clerk Paul Ripley before his character was fired for misconduct after he was seen kissing an unconscious girl in the high dependency unit.\n\nLuke has since gone on to appear in EastEnders, but has chosen to stick mainly to small, independent productions such as 'Break', an indie film that premiered in 2020.\n\nHis Instagram bio states that he is still an actor, but his feed suggests he spends most of his time enjoying country walks with his partner and dog."}, {"url": "https://en-academic.com/dic.nsf/enwiki/1224718", "page_content": "Infobox actor\n\nname = Lucy Akhurst\n\n\n\n\n\nimagesize = 200px\n\ncaption =\n\nbirthname =\n\nbirthdate = birth date and age|1975|11|18|df=yes\n\nbirthplace = London , England\n\nothername =\n\noccupation = Actress\n\nyearsactive =\n\nspouse =\n\ninfluences =\n\ninfluenced =\n\nwebsite =\n\nawards =\n\nLucy Akhurst (b. 18 November 1975 in London ) is an English actress who has been working mainly in television since the 1990s. She starred alongside Neil Morrisey in \" Vanishing Man \" and then came to prominence in a lead role in 1999's ITV seven-part drama \"Wonderful You\".\n\nShe appeared as Tim's ( Simon Pegg 's) girlfriend for 4 episodes of UK comedy \" Spaced \" and also guest-starred as a zombie in Simon Pegg and Edgar Wright 's critically acclaimed \" Shaun of the Dead \".\n\nShe also appeared in the 2004 series of the BBC 's \" Monarch of the Glen \".\n\nMore recently she wrote, produced and starred in \" Every Seven Years \" a short film that has won several awards.\n\nFilmography\n\n*\" The Cinder Path \" (1994)\n\n*\" The Vanishing Man \" (1996)\n\n*\" All Quiet on the Preston Front \" (1997)\n\n*\"The Saint\" (1997)\n\n*\"The Land Girls\" (1998)\n\n*\" The Vanishing Man \" (1998)\n\n*\" Wonderful You \" (1999)\n\n*\" Peak Practice \" (1999)\n\n*\" Holby City \" (2000)\n\n*\"\" (2000)\n\n*\" Longitude \" (2000)\n\n*\"Beast\" (2000)\n\n*\" Circus \" (2000)\n\n*\"Trinity\" (2001)\n\n*\" Spaced \" (2001)\n\n*\" In Deep \" (2002)\n\n*\" Eroica \" (2003)\n\n*\" Ultimate Force \" (2003)... as MI5 Liaison Officer Pru Banks\n\n*\" Shaun of the Dead \" (2004)\n\n*\" Every Seven Years \" (2004)\n\n*\" Monarch of the Glen \" (2004)\n\n*\" Every Seven Years \" (2004)\n\nExternal links"}, {"url": "https://everything.explained.today/%5C/Lucy_Akhurst/", "page_content": "Lucy Akhurst Explained\n\nLucy Akhurst Birthname: Lucy Akhurst-Webster Birth Date: 18 November 1970 Birth Place: London, England Occupation: Actress Spouse: Charles Thomas Oldham\n\nLucy Akhurst (born 18 November 1970) is an English actress, writer and director who has been working mainly in television since the 1990s. She starred alongside Neil Morrissey in The Vanishing Man and then came to prominence in a lead role in 1999's ITV seven-part drama Wonderful You.\n\nShe appeared as Tim's (Simon Pegg) girlfriend for four episodes of UK comedy Spaced and also guest-starred as a zombie in Simon Pegg and Edgar Wright's comedy film Shaun of the Dead.\n\nShe also appeared in the 2004 series of the BBC's Monarch of the Glen.\n\nMore recently she wrote, produced and starred in Every Seven Years a short film that has won several awards. She also directed, co-produced and had a small part in the independent British film , written, co-produced by and starring her husband Chaz Oldham.[1] [2]\n\nAkhurst provided the voiceovers for EastEnders in March 2009 for the Mitchell family storyline.\n\nSelected filmography\n\nNotes and References"}, {"url": "https://www.digitalspy.com/tv/a829621/footballers-wives-where-now-zoe-lucker-gillian-taylforth-gary-lucy/", "page_content": "Footballers' Wives was a ridiculously bombastic and saucy drama that perfectly captured the rising world of the \"WAGs\" (wives and girlfriends) in the early 2000s.\n\nIf anything, it was ahead of its time. Take a snapshot of most footballers and their partners these days, and you'll find real life versions of Jason Turner or Chardonnay Lane-Pascoe.\n\nThe series was incredibly raunchy for a primetime ITV drama (how they got away with this scene is anyone's guess – EXTREMELY NSFW), and got the nation hooked over the exploits behind the scenes of Earls Park FC. It ran for five series from 2002, and spawned an even racier spin-off Extra Time on ITV2 for two series.\n\nWhile we campaign for ITV to bring it back, let's take a look at what most of the core cast have been up to since then:\n\n1. Zoe Lucker (Tanya Turner)\n\nShed\n\nTanya Turner was the unofficial queen and all-round super-bitch of Footballers' Wives, and it was Zoe's breakout role. After making a crossover appearance as Tanya in ITV's Bad Girls, she quit the show in series 4, and it soon saw a dip in ratings because of it. She returned in series 5 to face off against Joan Collins, obviously.\n\nSince then, Zoe has gone on to have leading roles in various dramas and soaps, including playing Max Branning's scorned lover Vanessa Gold in EastEnders from 2010 to 2011 (we'll never forget \"bubbly's in the fridge\"), crime family boss Carol Barry in Waterloo Road and Reenie McQueen in Hollyoaks from 2015.\n\nShe has also had various presenting gigs, and she took part in 2009's edition of Strictly Come Dancing, finishing 10th.\n\n2. Gillian Taylforth (Jackie Pascoe-Webb)\n\nShed\n\nGillian was already a tabloid star and soap icon thanks to playing Kathy Beale in EastEnders, but she found her second big TV smash as matriarch Jackie in Footballers' Wives, with a penchant for romps on snooker tables.\n\nAppearing in all five series, after it ended she soon joined The Bill as Sgt Nikki Wright. Later, she was second to leave the sixth series of Strictly, appeared regularly on Loose Women, became a Celebrity Big Brother housemate in 2013, and joined the cast of Hollyoaks as Sandy Roscoe.\n\nDespite Kathy being 'dead' for 10 years, she rejoined the EastEnders family in 2015, and remains on the soap two years later.\n\n3. Alison Newman (Hazel Bailey)\n\nShed\n\nAlison played ruthless agent and later club chairman Hazel in Footballers' Wives, and later had various one-off roles on TV, including episodes of Holby City and Casualty.\n\nHer next famous role was as DI Keeble, who famously investigated the \"Who killed Lucy Beale?\" case in EastEnders in 2014 (having previously appeared back in 2008). Since then, she's featured in New Tricks, Whitechapel and Call the Midwife. She has also had many roles on stage.\n\nIn an amazing moment in 2015, she had a Twitter spat with US rapper Azealia Banks of all people, in an argument about the treatment of gay people and women. We never saw that one coming.\n\n4. Gary Lucy (Kyle Pascoe)\n\nShed\n\nGary had already made a name for himself in the world of TV by the time FW came along. He had already been in a football-based drama in the shape of 1997's Dream Team, and later became a pin-up thanks to playing Luke Morgan in Hollyoaks, a role he will reprise in late 2017.\n\nFrom 2005 to 2010, he played Will Fletcher in The Bill, and he has since taken part in Dancing on Ice twice, finishing second in 2010. He played charmer Danny Pennant in EastEnders in 2012, and went on tour in the lead role in The Full Monty in 2014.\n\n5. Susie Amy (Chardonnay Lane-Pascoe)\n\nShed\n\nSusie became a household name and a lads' mags' favourite in the early 2000s thanks to FW. After leaving the show, she played the lead role of Valentine D'Artagnan in the Hallmark Channel's one-off movie La Femme Musketeer opposite Michael York and Gerard Depardieu. Remember that?\n\nShe has had movie roles in the likes of Dennis Hopper's House of 9 and Andy Garcia's Modigliani, and episode appearances in Hotel Babylon and Coronation Street. She also starred in 2008's Echo Beach, but it was axed after one series. More recently, she has popped up in episodes of Death in Paradise and Casualty.\n\n6. Cristian Solimeno (Jason Turner)\n\nShed\n\nCristian played the bit o' ruff Jason in FW, the philandering husband of Tanya. Since then, he featured as The Guardian in Highlander: The Source and has had small roles in The IT Crowd (as Juan the Barista), Arturo Merzario in Rush, and Executioner #3 in Fantastic Beasts and Where to Find Them.\n\nIn 2013, he had a recurring role as Ray McCormick in Hollyoaks, until he was killed off by the hands of Grace Black. He has also directed a number of projects, including 2011's The Glass Man starring Andy Nyman and James Cosmo.\n\n7. Daniel Schutzmann (Salvatore Biagi)\n\nShed\n\nFlamboyant star Salvatore remains actor Daniel's biggest role, but he went on to have a recurring role as Pete Gartside in Neighbours back in 2007.\n\nHe appeared in a couple of episodes of Coronation Street in 2008, and featured in nearly 50 episodes of Doctors as Dr Franc Christophe until 2015.\n\n8. Nathan Constance (Ian Walmsley)\n\nShed\n\nHaving already had roles in Dream Team and Bad Girls, Nathan's biggest role yet arrived in FW. Soon after leaving the show, he had a recurring part in The Bill, and later featured in Noel Clarke's movie Adulthood.\n\nAfter various other TV roles, he has more recently concentrated on video game voice parts, including Titanfall and Battlefield 1.\n\n9. Katherine Monaghan (Donna Walmsley)\n\nShed\n\nFW was Katherine's first role, and she has only had a handful of TV parts since then. These have included two episodes of Judge John Deed in 2007 and Holby City in 2014.\n\nShe has also worked as a voiceover artist, and has appeared in various plays at London's Theatre 503 and Live Theatre Company in her native Newcastle.\n\n10. Peter Ash (Darius Fry)\n\nShed\n\nPeter made the jump to the late-night Extra Time series as Darius, but this has remained his most high-profile role to date.\n\nHe appeared in an episode of The Royal in 2008 and will feature in the upcoming Michelle Keegan movie Strangeways Here We Come. He has remained active in the theatre world, including a 2013 tour of War Horse.\n\n11. Laila Rouass (Amber Gates)\n\nShed/Getty Images\n\nLaila found fame as Bollywood star Amber in FW, having joined in series 3. In 2009, she had a recurring role in ITV's Primeval, and went on to feature in The Sarah Jane Adventures, Spooks, Holby City and The Lodge. She also appeared in the dodgy 2011 remake of Conan the Barbarian.\n\nAway from acting, she had a child with businessman Nasir Khan in 2007, and later got engaged to snooker icon Ronnie O'Sullivan in 2013.\n\n12. Jesse Birdsall (Roger Webb)\n\nShed\n\nJesse was already a familiar face thanks to 1990s thriller Bugs and guilty pleasure soap Eldorado, and he found a new lease of life as manager Roger in FW.\n\nSince then, he has continued to act on stage and screen in various projects, most famously as serial killer Fraser Black in Hollyoaks (reuniting with Gillian Taylforth).\n\nHe married Only Fools and Horses star Gwyneth Strong (Cassandra!) in 2000, and they have two kids together.\n\n13. Sarah Barrand (Shannon Donnelly-Lawson)\n\nShed\n\nSarah joined the cast in series 3 as Shannon, apparently a parody of Wayne Rooney's then-girlfriend Coleen. She has only had a small amount of low-profile roles since then, however.\n\nIn 2006, she co-hosted a two-part documentary for ITV with Zoe Lucker, in which they met the Dalai Lama. Because why not? She has since worked as a voiceover artist for TV and radio.\n\n14. Ben Price (Conrad Gates)\n\nShed/Rex Shutterstock\n\nBen joined the cast in series 3 as new signing Conrad, and most famously had a ridiculously explicit scene with Tanya on a plane (see above). After leaving the show in series 4, he joined the cast of Casualty as Nathan Spencer from 2005 to 2007.\n\nTwo years later, he joined Coronation Street as Nick Tilsley, a role he has kept to this day.\n\nAlso, we've only just realised that he played the poor bloke who had to put up with shit from his horrible girlfriend in that Old El Paso advert in 2002:\n\n15. Jamie Davis (Harley Lawson)\n\nShed\n\nWhile playing Harley in FW and its ITV2 spin-off, Jamie appeared in the Sky One supernatural drama Hex for two series before it was axed.\n\nHe had regular roles in TV and film over the years, including Lacey Turner's ITV2 comedy Switch and Death in Paradise. In 2013, he joined Casualty as regular character Max Walker.\n\n16. Ben Richards (Bruno Milligan)\n\nShed\n\nAfter a successful West End career, Ben joined FW in the fourth series as Bruno, and two years later signed up for Holby City for a four-month stint. In 2015, he joined Hollyoaks as regular Ben Bradley before leaving a year later.\n\nHe has continued to appear in various theatre and musical roles, including 9 to 5, The Bodyguard, and Peter Pan.\n\nIn 2012, he revealed that he had been diagnosed with bowel cancer, but went into remission the following year. He has been a patron for various charities in recent years.\n\n17. Charles Venn (Tremaine Gidigbi)\n\nShed\n\nAlso known as Chucky Venice and Chucky Venn, Charles joined FW in the final series, having already been a regular on Dream Team.\n\nAfter scoring small roles in Hollywood movies such as The Bourne Ultimatum and The Dark Knight, he starred as Ray Dixon in EastEnders from 2012 to 2013. Two years later, he joined Casualty as Jacob Masters.\n\nWant up-to-the-minute entertainment news and features? Just hit 'Like' on our Digital Spy Facebook page and 'Follow' on our @digitalspy Twitter account and you're all set."}]}