{"William Allan Neilson established the Smith College School for Social Work.": [{"url": "https://libex.smith.edu/omeka/exhibits/show/neilson/william-allan-neilson", "page_content": "For 37 years the building which was geographically and intellectually the heart of the campus was called simply “The Library.” When President William Allan Neilson died in 1946, the Trustees named it as a memorial tribute to him.\n\nWilliam Allan Neilson, Smith’s third president, died on February 13 at the College Infirmary. He was visiting Northampton to research a history of Smith College that had been commissioned by the Trustees when he became ill. The next morning there was a memorial chapel service; he lay in the Little Chapel until the funeral service in John M. Greene Hall on February 16; he was cremated and later buried in the Botanic Garden.\n\nPresident Neilson's accomplishments at Smith were many. At a time when a majority of Smith students lived off campus, he set about the task of purchasing and building new residences so that all Smith students could live together on campus. After building the Great Quadrangle, purchasing Capen House, Talbot House, Sessions House, and many others, his goal was completed. During Neilson's 22-year term as president, the campus also saw the additions of Sage Music Hall, Scott Gymnasium, Tryon Art Gallery, the Alumnae House, the Infirmary, and the President's house.\n\n\n\nNeilson also established the Junior Year in France, Junior Year in Italy, and the Junior Year in Spain Programs. Special Honors, the Smith College Day School, and the School for Social Work were additions that Neilson made to the college.\n\nTo learn more about President Neilson, follow this link to read the text of a lecture on the life and legacy of Smith’s third president by Peter I. Rose, Sophia Smith Professor Emeritus of Sociology and Anthropology, Smith College. You may also listen to the talk by clicking on the play button symbol below. Professor Rose gave this lecture as part of the Libraries' centennial celebration events on February 18, 2010."}, {"url": "https://blogs.smith.edu/blog/smithipedia/administration/president-william-allan-neilson/", "page_content": "President William Allan Neilson\n\nPresident William Allan Neilson\n\nWilliam Allan Neilson was born March 28, 1869, in Doune, Pertshire Scotland. He attended Edinburgh University where he studied philosophy, graduating with honors in 1891. In order to join his brother who emigrated to Canada, Neilson crossed the Atlantic and began teaching in Upper Canada College in Toronto which was a boarding school for young boys.\n\nDeciding that he would prefer to be a scholar than a school master, Neilson went on to Harvard Graduate School in Cambridge, MA where he received his Ph.D. in English in 1898. Upon receiving his Ph.D., Neilson accepted a position as an Associate in English Literature at Bryn Mawr College in Bryn Mawr, PA. Neilson taught at many other fine institutions before settling into the work of an administrator. Harvard, Radcliffe, the Sorbonne, Columbia, Barnard, and the University of California all made use of Neilson’s talents at one time or another.\n\nIt was during his years as a professor that Neilson distinguished himself as the sort of scholar that an academic institution would wish to guide it. Before coming to Smith, Neilson made a name for himself both as a professor devoted to his students’ learning (he was the only instructor of Helen Keller’s who learned the manual sign language she used for communication) but also as a writer and an editor. Among his writings were Essentials of Poetry (1912) and The Facts about Shakespeare (1913). He also was the editor of Milton’s Minor Poems (1899) and Shakespeare’s Complete Works (1906). In 1917, Neilson was offered the Presidency of Smith College. He accepted on the conditions that he would not be obligated to raise money, and that a president’s house would be built, with which the trustees complied.\n\nWhen Neilson arrived at Smith in 1917 perhaps one of the best assets that Neilson brought to Smith was his quick wit that endeared him to student, staff, faculty, and alumnae alike. At Neilson’s final commencement in 1939 Cynthia Walsh recalled one particular instance: The seniors will especially recall that on May Day when they went to serenade him, his new collie puppy began to bark, not realizing what sweet voices were vying with the birds so early in the morning. When the president stepped out he said, “My dog thinks you’re sheep,” and the volleys of laughter which greeted this remark quite drowned out the rest: ”-but I think you’re lambs!”\n\nNeilson’s accomplishments at Smith were many. When Neilson noticed that a majority of Smith students lived off campus he set about the task of purchasing and building new residences so that all Smith students would live on campus. After building the Great Quadrangle, purchasing Chapin House, Talbot House, Sessions House, and many others his goal was completed. During Neilson’s 22-year term as president, the campus also saw the additions of Sage Music Hall, Scott Gymnasium, Tryon Art Gallery, the Alumnae House, the Infirmary, and the President’s house.\n\nNeilson also established the Junior Year in France, Junior Year in Italy, and the Junior Year in Spain Programs. Special Honors, the Smith College Day School, and the School for Social Work were additions that Neilson made to the college. Never one to rest on his laurels, Neilson continued writing and editing while looking after the well being of 2,000 students. In 1920 he wrote History of English Literature and in 1922 he edited Roads to Knowledge. He also was the editor-in-chief of Webster’s New International Dictionary, 2nd edition, 1934.\n\nWilliam A. Neilson died on February 13, 1946.\n\nFor further information please see: http://asteria.fivecolleges.edu/findaids/smitharchives/manosca13.html\n\nThorp, Margaret Farrand, Neilson of Smith (NY: Oxford University Press), 1956"}, {"url": "https://sites.smith.edu/ssw100-history/nielson-report-1919/", "page_content": "[et_pb_section bb_built=”1″ admin_label=”section” background_image=”https://sites.smith.edu/ssw100-history/wp-content/uploads/sites/256/2018/05/Untitled.png” background_color=”rgba(0,62,81,0.55)” parallax_method=”off” next_background_color=”#ffffff” custom_padding_tablet=”50px|0|50px|0″ custom_padding_last_edited=”on|desktop” _builder_version=”3.2.2″ background_position=”top_center” background_blend=”overlay”][et_pb_row admin_label=”row” background_position=”top_left” background_repeat=”repeat” background_size=”initial”][et_pb_column type=”1_3″][/et_pb_column][et_pb_column type=”2_3″][et_pb_divider color=”#ffffff” show_divider=”off” height=”200″ divider_style=”solid” divider_position=”top” hide_on_mobile=”on” disabled_on=”on|on|off” _builder_version=”3.2.2″ /][et_pb_post_title _builder_version=”3.2.2″ meta=”off” featured_image=”off” text_color=”light” title_font_size=”50px” title_line_height=”1.2em” /][/et_pb_column][/et_pb_row][/et_pb_section][et_pb_section bb_built=”1″ specialty=”off” parallax_method=”off” prev_background_color=”rgba(0,62,81,0.55)” custom_padding_tablet=”50px|0|50px|0″ custom_padding_last_edited=”on|desktop” _builder_version=”3.2.2″][et_pb_row admin_label=”row” make_fullwidth=”off” use_custom_width=”off” width_unit=”on” use_custom_gutter=”off” custom_padding=”0px|||” padding_mobile=”on” allow_player_pause=”off” parallax=”off” parallax_method=”off” make_equal=”off” parallax_1=”off” parallax_method_1=”off” parallax_2=”off” parallax_method_2=”off” column_padding_mobile=”on” background_position=”top_left” background_repeat=”repeat” background_size=”initial”][et_pb_column type=”1_3″][et_pb_post_title admin_label=”Categories” _builder_version=”3.2.2″ title=”off” author=”off” date=”off” comments=”off” featured_image=”off” meta_text_color=”#6fbee5″ /][et_pb_code admin_label=”Tags” _builder_version=”3.2.2″][tags][/et_pb_code][/et_pb_column][et_pb_column type=”2_3″][et_pb_text max_width=”620px” text_font_size=”20″ text_text_color=”#363636″ use_border_color=”off” custom_margin=”10px||0px|” text_line_height=”1.4em” text_font_size_last_edited=”on|desktop” background_position=”top_left” background_repeat=”repeat” background_size=”initial” _builder_version=”3.2.2″]\n\nPresident William Neilson reported the outcome of the 1918 summer experiment, the “Training School for Psychiatric Social Work” in this essay.\n\n[/et_pb_text][et_pb_text max_width=”620px” text_font_size=”20″ text_text_color=”#363636″ use_border_color=”off” custom_margin=”30px||0px|” text_line_height=”1.5em” text_font_size_last_edited=”on|tablet” background_position=”top_left” background_repeat=”repeat” background_size=”initial” _builder_version=”3.2.2″ /][/et_pb_column][/et_pb_row][et_pb_row make_fullwidth=”off” use_custom_width=”off” width_unit=”on” use_custom_gutter=”off” custom_padding=”50px|||” padding_mobile=”on” allow_player_pause=”off” parallax=”off” parallax_method=”off” make_equal=”off” parallax_1=”off” parallax_method_1=”off” column_padding_mobile=”on” custom_padding_tablet=”17px|||” custom_padding_last_edited=”on|tablet” background_position=”top_left” background_repeat=”repeat” background_size=”initial”][et_pb_column type=”1_3″][/et_pb_column][et_pb_column type=”2_3″][et_pb_text admin_label=”pdf” _builder_version=”3.2.2″]\n\n[/et_pb_text][et_pb_text admin_label=”Caption” _builder_version=”3.2.2″ module_class=”caption” saved_tabs=”all”]\n\nWilliam Neilson “Smith College Experiment in Training for Psychiatric Social Work,” School for Social Work Records, RG 60, College Archives, Smith College, Northampton, MA.\n\n[/et_pb_text][/et_pb_column][/et_pb_row][et_pb_row][et_pb_column type=”4_4″][et_pb_text _builder_version=”3.2.2″]\n\n[/et_pb_text][/et_pb_column][/et_pb_row][/et_pb_section]"}, {"url": "https://www.smith.edu/about-smith/presidents", "page_content": "Kathleen McCartney\n\n2013–Present\n\nSmith’s 11th president, Kathleen McCartney, took office in 2013. McCartney, former dean of the Harvard Graduate School of Education (HGSE), is an internationally recognized authority on child development and early education. The first in her family to go to college, she graduated summa cum laude from Tufts University with a bachelor of science in psychology and later earned a doctorate in psychology from Yale University. A signature accomplishment of her tenure at HGSE was the creation of a three-year doctorate in educational leadership developed in collaboration with the Harvard Business School and the Kennedy School of Government.\n\nSince assuming the presidency, McCartney has led a strategic planning effort that is resulting in important new academic and co-curricular programs that expand opportunities for women. She has forged partnerships with leading organizations, including the Harvard/MIT online education platform known as edX; the MassMutual Life Insurance Company, a supporter of data science initiatives; and the Posse Foundation. Under her leadership, Smith engaged noted architectural designer Maya Lin to re-envision its historic Neilson Library, in the context of its renowned Frederick Law Olmsted–designed campus, and to create a modern intellectual learning common. The $110 million project opened its doors in 2021. Women for the World: The Campaign for Smith, which McCartney led to its culmination in 2016, raised $486 million, setting a record for the largest and most successful campaign ever undertaken by a women’s college. Notably, the campaign raised close to $130 million for financial aid, including 103 new endowed scholarships. A central focus of McCartney’s presidency has been increasing access for every student who wants to study at Smith. In October 2021, McCartney announced that the college will eliminate loans from its undergraduate financial aid packages, beginning in fall 2022, replacing them with college grants.\n\nCarol T. Christ\n\n2002–13\n\nA widely respected scholar of Victorian literature, Carol T. Christ took up her duties as Smith’s 10th president in June 2002. In her first years at Smith, Christ launched an energetic program of outreach, innovation and long-range planning, including capital planning. She encouraged the development of coursework emphasizing fluency in American cultures and the diversity of experience of American ethnic groups and launched a review, conducted by members of the Smith faculty and outside scholars, to determine the distinctive intellectual traditions of the Smith curriculum and areas on which to build. Issued in 2007, The Smith Design for Learning: A Plan to Reimagine a Liberal Arts Education builds upon Smith’s history of pedagogical innovation, identifying priority areas—among them, international studies, environmental sustainability, and community engagement—for significant investment over the coming decade.\n\nIn the area of capital planning, a number of major building projects came to fruition during Christ’s tenure: the renovation and expansion of the Brown Fine Arts Center; a dramatic new campus center; a renovated Lyman Conservatory; the impressive Olin Fitness Center; new homes for the Poetry Center and the Mwangi Cultural Center; the renovation of Lilly Hall, home of the college’s School for Social Work; and the construction of Conway House, an apartment building for Ada Comstock Scholars with children. Ford Hall, a state-of-the-art, sustainably designed classroom and laboratory facility named in recognition of its lead donor, the Ford Motor Company Fund, opened in fall 2009; it serves as home to the college’s pioneering Picker Engineering Program as well as the departments of molecular biology, chemistry, biochemistry and computer science. Under Christ’s leadership, Smith made significant commitments to environmental sustainability in its curriculum and campus operations, including the construction of a co-generation facility for power and heat and the dedication of the MacLeish Field Station, a 200-acre woodland tract in Whately, Mass., for environmental education and research.\n\nRuth Simmons\n\n1995–2001\n\nIn December 1994 Ruth Simmons was chosen as Smith’s ninth president. With a long and distinguished career in higher education behind her, Simmons was the first African-American woman to head any top-ranked American college or university. Simmons galvanized the campus through an ambitious campus-wide self-study process that resulted in a number of landmark initiatives, including Praxis, a program that allows every Smith student the opportunity to elect an internship funded by the college; an engineering program, the first at a women’s college; programs in the humanities that include the establishment of a poetry center and a peer-reviewed journal devoted to publishing scholarly works by and about women of color; and curricular innovations that include intensive seminars for first-year students and programs to encourage students’ speaking and writing skills.\n\nA number of building projects were launched during Simmons’ administration; most significant was the Brown Fine Arts Center, a $35-million expansion and renovation of the Smith College Museum of Art, art department and art library. Ground was broken in 2002 for a campus center, and renovation and expansion of the Lyman Conservatory was completed in 2003.\n\nSimmons left Smith in June 2001, assuming the presidency of Brown University. John M. Connolly, Smith’s first provost, served as acting president for one year, skillfully guiding the college through the trauma of September 11, 2001, and its aftermath.\n\nMary Maples Dunn\n\n1985–95\n\nThe college that President Conway left to her successor was in some ways very different from the college served by Presidents Seelye, Burton and Neilson. When Mary Maples Dunn came to Smith in 1985 after many years as a professor of history and then as dean of Bryn Mawr College, Smith’s student body had diversified. During its early decades the student body had been overwhelmingly Protestant, but by the 1970s, Roman Catholic and Jewish college chaplains served alongside the Protestant chaplain, reflecting the students' religious and ethnic variety. All racial, ethnic and religious groups are now well represented on campus, evidence of Smith’s continuing moral and intellectual commitment to diversity.\n\nIn her decade as president, Mary Maples Dunn led the college through exciting and challenging times. During her tenure, the college raised more than $300 million, constructed two major buildings and renovated many more, enhanced communication on and off campus, attracted record numbers of applicants (while holding the quality of those applicants steady) and doubled the value of its endowment. Computer technology transformed the way Smith conducted its business. And the curriculum became broader in scope, with five new majors and increased course offerings in non-Western and neglected American cultures.\n\nJill Ker Conway\n\n1975–85\n\nIn the late 1960s and early 1970s another important movement—the women’s movement—was gathering momentum. This was to have a profound effect on American society and to confirm the original purpose of Smith College. The college began its second century in 1975 by inaugurating its first woman president, Jill Ker Conway, who came to Smith from Australia by way of Harvard and the University of Toronto. She was a charismatic and energetic leader with a vision for women's education, and her administration was marked by three major accomplishments: a large-scale renovation and expansion of Neilson Library, evidence of Smith’s undiminished concern for the heart of the liberal arts; the rapid growth of the Ada Comstock Scholars Program, through which women beyond the traditional college age could earn a Smith degree; and exceptionally successful fund-raising efforts. Also during President Conway’s administration, the Career Development Office was expanded to better counsel Smith students and alumnae about career opportunities and graduate training for women. Recognizing the rapidly growing emphasis on fitness and athletics for women, Smith built the Ainsworth Gymnasium and broke ground for new indoor and outdoor track and tennis facilities. President Conway’s contributions underscored her commitment to women’s colleges and a liberal arts education in today's society. Since leaving Smith, Conway has written an acclaimed series of memoirs; her 2001 book, A Woman's Education, concerns her Smith years.\n\nThomas Corwin Mendenhall\n\n1959–75\n\nWhen Thomas Corwin Mendenhall came from Yale in 1959 to become Smith’s sixth president, both the college and the country at large were enjoying peace and prosperity. During the 1960s, social and cultural changes stirred the college profoundly, and a series of powerful movements influenced the larger society and the academic world alike. In response to the needs of increasingly independent and ambitious students, the curriculum was thoroughly revised. College-wide requirements were set aside and independent study encouraged. The college made more varied educational experiences available to Smith undergraduates by extending cooperation with its neighbors—Amherst, Hampshire and Mount Holyoke colleges and the University of Massachusetts. And Smith joined other private colleges in the Northeast to develop the Twelve College Exchange Program. The college added buildings with the most modern facilities for the study of the natural sciences, performing arts and fine arts. The new Fine Arts Center included the Smith College Museum of Art, now one of the most distinguished college museums in the country.\n\nThe 1960s saw the civil rights movement, the students’ rights movement and the anti-war movement take root and grow at many of the country’s universities and colleges, including Smith. Thanks to these movements and to the wisdom, tact and humor of President Mendenhall, the college emerged from the 1960s with a more precise awareness of student needs and an active, practical sense of social responsibility.\n\nMeanwhile, life in the college houses was changing. The old rules governing late evenings out and male visitors were relaxed, then abandoned. Not surprisingly, when Vassar began to accept men, and Yale, Princeton and Dartmouth to accept women as candidates for degrees, some members of the college community wondered whether Smith should also become coeducational. In 1971, a committee of trustees, faculty, administration, students and alumnae studied the question in detail. The committee concluded that admitting men as candidates for the Smith degree would detract from the founding purpose of the college, the best possible education for women.\n\nBenjamin Fletcher Wright\n\n1949–59\n\nBenjamin Fletcher Wright came from Harvard to become Smith’s fifth president in 1949. The college had by then resumed its regular calendar and completed several much-needed building projects, including a new heating plant and a student recreation center named for retiring President Davis. The most memorable achievements of President Wright’s administration were the strengthening of Smith's financial position and the defense of academic freedom during the 1950s.\n\nIn 1950, the $7 Million Fund Drive was triumphantly completed, enabling the college to improve facilities and increase faculty salaries. In 1955, the Helen Hills Hills Chapel was completed, giving Smith its own place of worship. The early 1950s were not, though, easy years for colleges; McCarthyism bred a widespread suspicion of any writing or teaching that might seem left of center. In defending his faculty members' right to political and intellectual independence, President Wright showed great courage and statesmanship. Complementing his achievements was the financial and moral support of Smith’s Alumnae Association, by now the most devoted and active group of its kind in the country. Before President Wright’s term ended, the college received a large gift for constructing a new faculty office and classroom building to be named for him.\n\nHerbert Davis\n\n1940–49\n\nPresident Neilson retired in 1939, just before the outbreak of World War II, and for one year Elizabeth Cutter Morrow, an alumna trustee, served as acting president. Herbert Davis took office as Smith’s fourth president in 1940 and reaffirmed the contributions that a liberal arts college could make to a troubled world. Already during World War I a group of Smith alumnae had gone to France to do relief work in the town of Grécourt; a replica of Grécourt’s chateau gates is now emblematic of the college.\n\nSoon after the 1941 bombing of Pearl Harbor, the college agreed to provide facilities on its campus for the first Officers’ Training Unit of the Women’s Reserve, or WAVES. The college added a summer term from 1942 to 1945 so some students could graduate more quickly and go on to government, hospital or military service. Though physically isolated by travel restrictions, the college retained its cosmopolitan character as refugees came to lecture, teach and study. And foreign films were shown regularly in Sage Hall—a practice that would give generations of students their sensitivity both to other cultures and to an important new art. President Davis' administration was marked by intensified academic life, reflecting his belief that serious study was a way of confronting the global threat to civilization.\n\nWilliam Allan Neilson\n\n1917–39\n\nWhen William Allan Neilson became president in 1917, Smith was already one of the largest women’s colleges in the world. President Neilson shrewdly developed the advantages of large academic institutions while maintaining the benefits of a small one. Under his leadership, the size of the faculty continued to increase while the number of students remained at about 2,000. The curriculum was revised to provide a pattern still followed in many American colleges—a broad foundation in various fields of knowledge, later complemented by the more intensive study of a major subject. The college expanded honors programs and initiated interdepartmental majors in science, landscape architecture and theatre. The School for Social Work, a coeducational graduate program, was founded. And more college houses were built, mainly in the Georgian complex called “the Quad,” so that every student could live on campus.\n\nNot only did President Neilson help make Smith one of the leading colleges in the United States, whether for men or women, but he also developed it into an institution of international distinction and concerns. President Neilson, himself a Scotsman, married to a well-educated German woman, transformed the college from a high-minded but provincial community in the hinterland of Massachusetts into a cosmopolitan center constantly animated by ideas from abroad. Between the two world wars, he brought many important exiled or endangered foreign teachers, scholars, lecturers and artists to the college. Meanwhile, as long as peace lasted, Smith students went to study in France, Italy and Spain on the Junior Year Abroad Program instituted by the college in 1924.\n\nMarion LeRoy Burton\n\n1910–17\n\nSmith’s second president, Marion LeRoy Burton, took office in 1910. President Burton, a graduate of Yale Divinity School, was a gifted public speaker with an especially acute business sense. He used these talents to help the college raise the amazing sum of $1,000,000—a huge endowment campaign for any college at that time. With the college’s increased endowment, President Burton was able to increase faculty salaries substantially and improve the faculty-to-student ratio. President Burton's fund drive also invigorated the alumnae, bringing them closer to the college than ever before and increasing their representation on the board of trustees.\n\nAlong with improving the financial state and business methods of the college, President Burton also contributed to a revision of the curriculum and initiated college honors programs to recognize outstanding students. He also helped to organize a cooperative admission system among Smith, Mount Holyoke, Wellesley and Vassar, the finest women’s colleges of the day. President Burton’s accomplishments are commemorated today by Burton Hall, the science building that his fund drive helped to finance.\n\nLaurenus Clark Seelye\n\n1873–1910\n\nSmith College opened in the fall of 1875 with 14 students and six faculty under the presidency of Laurenus Clark Seelye. Its small campus was planned to make the college part of what John M. Greene called “the real practical life” of a New England town, rather than a sequestered academic preserve. College Hall, the Victorian Gothic administrative and classroom building, dominated the head of Northampton’s Main Street. For study and worship, students used the town’s well-endowed public library and various churches. Instead of a dormitory, students lived in a “cottage,” where life was more familial than institutional. Thus began the \"house\" system that, with some modifications, the college still employs today. The main lines of Smith’s founding educational policy, laid down in President Seelye’s inaugural address, remain valid today: then as now, the standards for admission were as high as those of the best colleges for men; then as now, a truly liberal education was fostered by a broad curriculum of the humanities, the fine arts and the natural and social sciences.\n\nDuring the 35 years of President Seelye’s administration, the college prospered mightily. Its assets grew from Sophia Smith’s original bequest of about $400,000 to more than $3,000,000; its faculty to 122; its student body to 1,635; its buildings to 35. These buildings included Alumnae Gymnasium, site of the first women’s basketball game, and William Allan Neilson Library, one of the best-stocked undergraduate libraries in the country."}, {"url": "https://findingaids.smith.edu/repositories/4/resources/35", "page_content": "William Allan Neilson served as president of Smithh College for 22 years. Born March 28, 1869, in Doune, Pertshire Scotland, he attended Edinburgh University where he studied philosophy, graduating with honors in 1891. In order to join his brother who emigrated to Canada, Neilson crossed the Atlantic and began teaching in Upper Canada College in Toronto which was a boarding school for young boys.\n\n\n\nDeciding that he would prefer to be a scholar than a school master, Neilson went on to Harvard Graduate School in Cambridge, MA where he received his Ph.D. in English in 1898. Upon receiving his Ph.D., Neilson accepted a position as an Associate in English Literature at Bryn Mawr College in Bryn Mawr, PA. Neilson taught at many other fine institutions before settling into the work of an administrator. Harvard, Radcliffe, the Sorbonne, Columbia, Barnard, and the University of California all made use of Neilson's talents at one time or another.\n\n\n\nIt was during his years as a professor that Neilson distinguished himself as the sort of scholar that an academic institution would wish to guide it. Before coming to Smith, Neilson made a name for himself as a professor devoted to his students' learning. He was the only instructor of Helen Keller's who learned the manual sign language she used for communication. He was also an accomplished writer and editor. Among his writings were Essentials of Poetry (1912)and The Facts about Shakespeare (1913). He also was the editor of Milton's Minor Poems (1899) and Shakespeare's Complete Works (1906).\n\n\n\nIn 1917, Neilson was offered the Presidency of Smith College. He accepted on the conditions that he would not be obligated to raise money, and that a president's house would be built, conditions the trustees complied with.\n\n\n\nNeilson's quick wit that endeared him to student, staff, faculty, and alumnae. At Neilson's final commencement in 1939 Cynthia Walsh recalled one particular instance:\n\n\n\nThe seniors will especially recall that on May Day when they went to serenade him, his new collie puppy began to bark, not realizing what sweet voices were vying with the birds so early in the morning. When the president stepped out he said, \"My dog thinks you're sheep,\" and the volleys of laughter which greeted this remark quite drowned out the rest: \"-but I think you're lambs!\"\n\n\n\nNeilson's accomplishments included purchasing and building new residences so that all Smith students would live on campus. He was responsible for the building of the Great Quadrangle, purchasing Chapin House, Talbot House, Sessions House, and many others. During Neilson's 22-year term as president, the campus also saw the additions of Sage Music Hall, Scott Gymnasium, Tryon Art Gallery, the Alumnae House, the Infirmary, and the President's house.\n\n\n\nNeilson also established the Junior Year in France, Junior Year in Italy, and the Junior Year in Spain Programs. Special Honors, the Smith College Day School, and the School for Social Work were additions that Neilson made to the college.\n\n\n\nNeilson continued writing and editing while looking after the well being of 2,000 students. In 1920 he wrote History of English Literature and in 1922 he edited Roads to Knowledge. He also was the editor-in-chief of Webster's New International Dictionary, 2nd edition, 1934."}, {"url": "https://snaccooperative.org/view/25680249", "page_content": "Educator, editor and author. President of Smith College, 1917-1939; editor of Webster's New International Dictionary 2nd edition; author of \"Essentials of poetry\" and \"Facts about Shakespeare.\"\n\nFrom the description of Letters of W.A. Neilson, 1907-1917. (University of Virginia). WorldCat record id: 76968306\n\nSmith College President (3rd), 1917-1939. Ph. D., Harvard, 1898. Prof. of English at Bryn Mawr, Harvard, the Sorbonne and Columbia.\n\nFrom the description of William Allan Neilson personal papers, 1852-1946. (Smith College). WorldCat record id: 51171634\n\nNeilson graduated from Harvard in 1896 and taught English at Harvard.\n\nFrom the description of Papers of William Allan Neilson, 1912. (Harvard University). WorldCat record id: 76973143\n\nSmith College President (3rd), 1917-1939.\n\nFrom the description of Office of the President William Allan Neilson files, 1917-1939. (Smith College). WorldCat record id: 51231676\n\nWilliam Allan Neilson was born March 28, 1869, in Doune, Pertshire Scotland. He attended Edinburgh University where he studied philosophy, graduating with honors in 1891. In order to join his brother who emigrated to Canada, Neilson crossed the Atlantic and began teaching in Upper Canada College in Toronto which was a boarding school for young boys.\n\nDeciding that he would prefer to be a scholar than a school master, Neilson went on to Harvard Graduate School in Cambridge, MA where he received his Ph.D. in English in 1898. Upon receiving his Ph.D., Neilson accepted a position as an Associate in English Literature at Bryn Mawr College in Bryn Mawr, PA. Neilson taught at many other fine institutions before settling into the work of an administrator. Harvard, Radcliffe, the Sorbonne, Columbia, Barnard, and the University of California all made use of Neilson's talents at one time or another.\n\nIt was during his years as a professor that Neilson distinguished himself as the sort of scholar that an academic institution would wish to guide it. Before coming to Smith, Neilson made a name for himself both as a professor devoted to his students' learning (he was the only instructor of Helen Keller's who learned the manual sign language she used for communication) but also as a writer and an editor. Among his writings were Essentials of Poetry (1912)and The Facts about Shakespeare (1913). He also was the editor of Milton's Minor Poems (1899) and Shakespeare's Complete Works (1906).\n\nIn 1917, Neilson was offered the Presidency of Smith College. He accepted on the conditions that he would not be obligated to raise money, and that a president's house would be built, with which the trustees complied.\n\nPerhaps one of the best assets that Neilson brought to Smith was his quick wit that endeared him to student, staff, faculty, and alumnae alike. At Neilson's final commencement in 1939 Cynthia Walsh recalled one particular instance:\n\nThe seniors will especially recall that on May Day when they went to serenade him, his new collie puppy began to bark, not realizing what sweet voices were vying with the birds so early in the morning. When the president stepped out he said, \"My dog thinks you're sheep,\" and the volleys of laughter which greeted this remark quite drowned out the rest: \"-but I think you're lambs!\"\n\nNeilson's accomplishments at Smith were many. When Neilson noticed that a majority of Smith students lived off campus he set about the task of purchasing and building new residences so that all Smith students would live on campus. After building the Great Quadrangle, purchasing Chapin House, Talbot House, Sessions House, and many others his goal was completed. During Neilson's 22-year term as president, the campus also saw the additions of Sage Music Hall, Scott Gymnasium, Tryon Art Gallery, the Alumnae House, the Infirmary, and the President's house.\n\nNeilson also established the Junior Year in France, Junior Year in Italy, and the Junior Year in Spain Programs. Special Honors, the Smith College Day School, and the School for Social Work were additions that Neilson made to the college.\n\nNever one to rest on his laurels, Neilson continued writing and editing while looking after the well being of 2,000 students. In 1920 he wrote History of English Literature and in 1922 he edited Roads to Knowledge. He also was the editor-in-chief of Webster's New International Dictionary, 2nd edition, 1934.\n\nFrom the guide to the Office of President William Allan Neilson Files RG 32., 1917-1939, (Smith College Archives)\n\n: Born in Doune, Perthshire, Scotland, March 28\n\n: Attended Montrose Academy\n\n: Studied at the University of Edinburgh, received M.A.\n\n: Immigrated with family to Canada\n\n: Resident English Master, Upper Canada College, Toronto\n\n: Graduate work in English, Harvard University, M.A. (1897), Ph.D. (1898)\n\n: Associate Professor of English Literature, Bryn Mawr College\n\n: Instructor of English, Harvard University\n\n: Professor of English, Columbia University\n\n: Became American citizen\n\n: Professor of English, Harvard University\n\n: Married Elisabeth Muser in Offenburg, Germany, June 25\n\n: Exchange Professor, University of Paris\n\n: President of Smith College\n\n: Trustee, Carnegie Foundation for the Advancement of Education Served intermittently on the College Entrance Examination Board\n\n: Initiated Special Honors program at Smith College\n\n: President, Modern Language Association\n\n: Editorial Board of G.C. Merriam and Company\n\n: Started Junior Year Abroad program at Smith College\n\n: Advisory Council, the Open Road, Inc.\n\n: Board of Directors, National Association for the Advancement of Colored People\n\n: Board of Directors, National Refugee Service\n\n: Chair, Executive Committee, Commission to Study the Organization of Peace\n\n: Presided over the International Student Service Summer Student Leadership Institute at Campobello, New Brunswick\n\n: Board of Overseers, Harvard University\n\n: Chair,\n\n: Died in Northampton, Massachusetts, February 13\n\nFrom the guide to the William Allan Neilson Personal Papers RG 32 ., 1852-1946, (Smith College Archives)"}, {"url": "https://findingaids.smith.edu/repositories/4/resources/25", "page_content": "The William Allan Neilson Papers consist of 21.75 linear feet of correspondence, newspaper clippings, manuscripts, press releases, lecture notes, texts of speeches, photographs, and miscellaneous papers which document Neilson's life and career. While these papers contain material dating from Neilson's years at Smith College (1917-1939), his official correspondence as president of the college is stored separately in the College Archives' holdings of records of the Office of the President.\n\n\n\nThe papers document Neilson's personal life with extensive family material. His letters to his brother and sisters are particularly valuable. Among other things these letters present Neilson's view of life at Bryn Mawr College under M. Carey Thomas, his strong opinions on world politics, his experiences tutoring Helen Keller at Radcliffe College, and his first impressions of Smith College. This series of letters is especially strong for the years between Neilson's arrival at Harvard University for graduate study in 1895 and his marriage in 1905. In addition to the Neilson family correspondence there is extensive correspondence between the Neilson and Muser families plus diaries and writings of Elisabeth Muser Neilson, her parents, and her sister. Much of the Muser family material is in German.\n\n\n\nOther personal material such as photographs, correspondence, class notes, and student essays document Neilson's youth and education. His love of his native Scotland and his study of its language and literature are clearly in evidence in his University of Edinburgh essays.\n\n\n\nCorrespondence and miscellaneous papers, 1917-1946, document such day-to-day concerns as finances, family health, the running of the household, and travel arrangements.\n\n\n\nNeilson's career as professor and scholar of English and Scottish literature is represented by class notes and correspondence with students and colleagues which date primarily from his years at Harvard and Radcliffe. Smith College material includes a few notes for courses Neilson taught in the English department but consists primarily of documentation of the events and celebrations of his presidency such as his appointment, inauguration, tenth and twentieth anniversaries, and retirement. Other material documents Neilson's affiliation with scholarly organizations such as the Modern Language Association, the Scottish Text Society, and the Shakespeare Association of America. There are also texts and notes for speeches on Shakespeare and Burns. Neilson's scholarly publications are represented by a number of articles, an unfinished manuscript for a book on allegory, and proofs for a 1942 edition of Shakespeare's plays and poems. Correspondence and news clippings document other writing and editorial projects in different stages of the work. Two such projects of particular interest are the 'five foot shelf' series of Harvard Classics, which Neilson edited with Charles W. Eliot, and the second edition of Webster's New International Dictionary, for which Neilson was editor-in-chief.\n\n\n\nIn addition to his work as professor, administrator, and scholar, Neilson was much in demand for committee work. As a respected educator and administrator, his advice and support was continually sought by educational institutions and organizations. Correspondence documents Neilson's work as a member of various committees for Harvard University, his suggestions on the planning of the campus and curriculum of Bennington College, and his advice and endorsements for the New School for Social Research and a variety of organizations promoting adult education such as the Affiliated Schools for Workers, the Eliot Foundation for Adult Education, and the Committee on University Extension in the Connecticut Valley.\n\n\n\nNeilson was also well-known for his vigorous support of liberal causes of the day. His political activities are reflected in his involvement with a large number of organizations most of which worked for civil liberties, peace, aid to refugees, or improved foreign relations. This work is documented by correspondence with such organizations as the American Civil Liberties Union, the Foreign Policy Association, the American Society for Cultural Relations with Russia, the National Refugee Service, various League of Nations organizations, and the Commission to Study the Organization of Peace.\n\n\n\nAll of Neilson's interests and concerns are in evidence in his speeches and writings. Texts contained in the papers are a rich source for the study of life at Smith College, and trends in education and politics during Neilson's term as president of Smith (1917-1939). News clippings document the quite considerable attention paid to his views.\n\n\n\nNeilson was a renowned speaker who seldom prepared a text, preferring to talk from cursory notes made shortly before the speech was to be delivered. Because of this process the texts contained in the papers are almost exclusively transcriptions. Some of them were edited for publication, others remain more or less as they were delivered. The papers also contain some of Neilson's handwritten notes for speeches.\n\n\n\nCorrespondence, citations, and news clippings document Neilson's many awards and honors and a group of biographical articles gives an overview of Neilson's life and work. The papers also contain notes, typescripts, and correspondence for Margaret Farrand Thorp's 1956 biography Nelson of Smith."}, {"url": "https://www.goodreads.com/author/show/1022290.William_Allan_Neilson", "page_content": "William Allan Neilson\n\nBorn\n\nWilliam Allan Neilson (28 March 1869 – 1946) was a Scottish-American educator, writer and lexicographer, graduated in the University of Edinburgh in 1891 and became a Ph.D. in Harvard University in 1898. He was president of Smith College between 1917 and 1939.\n\n\n\nNeilson was born in Doune, Scotland and he emigrated to the United States in 1895, being naturalised 3 August 1905. He taught at Bryn Mawr College from 1898 to 1900, Harvard from 1900 to 1904, Columbia from 1904 to 1906, and Harvard again from 1906 to 1917. Neilson was author of a number of critical works on William Shakespeare, Robert Burns and the Elizabethan theatre, editor of the Cambridge and Tudor editions of Shakespeare (1906, 1911) and editor of Webster's New International Dict\n\nWilliam Allan Neilson (28 March 1869 – 1946) was a Scottish-American educator, writer and lexicographer, graduated in the University of Edinburgh in 1891 and became a Ph.D. in Harvard University in 1898. He was president of Smith College between 1917 and 1939.\n\n\n\nNeilson was born in Doune, Scotland and he emigrated to the United States in 1895, being naturalised 3 August 1905. He taught at Bryn Mawr College from 1898 to 1900, Harvard from 1900 to 1904, Columbia from 1904 to 1906, and Harvard again from 1906 to 1917. Neilson was author of a number of critical works on William Shakespeare, Robert Burns and the Elizabethan theatre, editor of the Cambridge and Tudor editions of Shakespeare (1906, 1911) and editor of Webster's New International Dictionary, Second Edition (1934). Less known is his translation of the famous late 14th century Middle English alliterative chivalric romance Sir Gawain and the Green Knight.\n\n\n\n- Wikipedia"}, {"url": "https://campus-school.smith.edu/history", "page_content": "Our History\n\nIn 1926, Smith College President William Allan Neilson established The Smith College Day School, which was created to serve as a learning environment for Smith College students in education and psychology and to offer a unique educational choice for the local community. Opening day enrollment stood at 24 children.\n\nThe school’s impact can be measured by its growing size, which reached 87 students in 1947 and 124 in 1962. Needing more space, in 1965 a wing was added to Gill Hall. Another expansion, converting the college’s former laundry building, was completed in 1996, with seven new classrooms added to the school’s facility to accommodate growing enrollment.\n\nThe school has always provided a unique and special educational experience for students, for it is the only school in the region to connect the learning resources of a world class college to an elementary school program. Campus School also serves as a lab school where Smith College student teachers learn their craft and Campus School teachers and professors from the college engage in research and pursue best practices in teaching and learning. Students are the clear beneficiaries of this energizing and engaging environment, and this is as true today as it was in 1926.\n\nFrom humble beginnings, the Campus School has embraced its mission to be a center for best practices in education, serving children from kindergarten to sixth grade and advancing the study and practice of education through the 20 th and early 21 st centuries. While much has changed in education over the past 90 years, Campus School of Smith College remains a place where children are at the center of our work and excellence is pursued with passion and purpose."}, {"url": "https://www.smith.edu/news/100-years-psychology", "page_content": "Why was it bold for Smith to be among the first colleges to declare psychology as its own department?\n\nAs early as 1872—even before one brick of College Hall had been laid—the college prospectus promised the study of psychology and described it as the “science” of the mind rather than a “philosophy,” as most scholars thought at the time. We owe a debt to the forward-thinking individuals who correctly perceived the importance of developing psychology into an independent discipline.\n\nWhy is the major particularly meaningful for a liberal arts women’s college?\n\nLike almost every profession in the 1920s, psychology was a male-dominated field. It was extremely rare for women to be hired into long-term, tenure-track positions. Mary Henle ’34, M.A. ’35, referred to the field for herself and her female colleagues as the “migratory profession.” However, alums from women’s colleges sometimes broke through. The first edition of A.N. O’Connell and N.F. Russo’s Models of Achievement: Reflections of Eminent Women in Psychology, published in 1983, contained profiles of 15 women psychologists. Three of them were affiliated with Smith: Eugenia Hanfmann, Molly Harrower, Ph.D. ’34, and Mary Henle ’34, M.A. ’35. Without a doubt, the decision to create an independent department at Smith cleared the way for more young women to become psychologists.\n\nHow has the major evolved over the past 100 years?\n\nThe major started as a curriculum of seven basic courses with a focus on consciousness as studied in adult white males. We now offer dozens of courses in three main tracks: Mind and Brain, Health and Illness, and Person and Society—each of which has introductory, intermediate, and advanced levels. Child development has emerged as its own subfield. Thanks to advances in neuroimaging techniques, we have a greater understanding of the neural underpinnings of many psychological phenomena. Researchers also study the influence of social and cultural forces, and there’s a better understanding of the importance of including more diverse populations in studies. One theme that has remained constant, however, is the department’s emphasis on experimental psychology, which provides students with hands-on experience in conducting experiments.\n\nWhat were some of the milestone moments that stood out for you in researching this anniversary?\n\nMary Whiton Calkins, who was the first female president of the American Psychological Association, among many other great achievements, graduated from Smith in 1885.\n\nIn 1927, German Gestalt psychologist Kurt Koffka was hired as the first William Allan Neilson Chair of Research to celebrate Neilson’s 10th anniversary as president of the college. His hiring ushered in the department’s golden era. Smith began to attract many established and up-and-coming scholars from the United States and abroad—some of whom visited, some of whom stayed. This period lasted about 15 years, until the advent of World War II.\n\n“Psychology professors were very supportive of students, creating a natural pull to the major.”\n\nIn the 1970s, clinical research opportunities for students interested in neuroatypical populations shifted from the use of projective techniques, such as the Rorschach test, to the experimental study of clinical populations.\n\nIn the 1990s, the department moved into its current building, Bass Hall. Several faculty members consulted with members of the then–Department of Biology to create the neuroscience program.\n\nWhy does psychology continue to be among the most popular majors?\n\nThere are several reasons. First, the level of analysis—individual human beings—studied by psychologists appeals to many of our students. Second, several alums I’ve interviewed told me that psychology professors were very supportive of students, creating a natural pull to the major for many. The most important reason, I believe, is that through both coursework and research opportunities we offer our students hands-on experience in conducting psychological research in a manner that reflects the current standards of the field.\n\nLooking forward, what excites you about the future of the department?\n\nWe’ve been thinking hard about the department’s future. In the near term, new faculty hires have been researchers with an applied focus on topics that attempt to solve real-world problems and whose work includes more diverse populations. As for the far term, we look forward to continuing technological and experimental advances that allow psychologists to gain a better understanding of the neural circuits underlying cognitive, clinical, and social phenomena and how environmental and cultural factors may influence them.\n\nNotable Faculty\n\nNAME YEARS SPECIALTY RESEARCH FOCUS Margaret Wooster Curti 1922–37 Developmental psychology Child psychology, intelligence William Sentman Taylor 1926–62 Clinical psychology Abnormal psychology Kurt Koffka 1927–41 Experimental psychology Human perception/ Gestalt psychology James Gibson 1928–49 Cognitive psychology Human perception Elsa Siipola 1933–72 Experimental psychology Personality Dilman John Doland 1953–82 Clinical psychology Child clinical psychology Robert Teghtsoonian 1963–96 Experimental psychology Psychophysics Randy Frost 1977–2020 Clinical psychology Obsessive-compulsive disorder, perfectionism, hoarding disorder Jill de Villiers 1979–2022 Developmental psychology Language acquisition Faye Crosby 1984–98 Social psychology Social justice, affirmative action, gender equality\n\nThis story appears in the Winter 2023 issue of the Smith Alumnae Quarterly."}], "William Allan Neilson established the Smith College Summer School for Women Workers in Industry.": [{"url": "https://www.smith.edu/about-smith/presidents", "page_content": "Kathleen McCartney\n\n2013–Present\n\nSmith’s 11th president, Kathleen McCartney, took office in 2013. McCartney, former dean of the Harvard Graduate School of Education (HGSE), is an internationally recognized authority on child development and early education. The first in her family to go to college, she graduated summa cum laude from Tufts University with a bachelor of science in psychology and later earned a doctorate in psychology from Yale University. A signature accomplishment of her tenure at HGSE was the creation of a three-year doctorate in educational leadership developed in collaboration with the Harvard Business School and the Kennedy School of Government.\n\nSince assuming the presidency, McCartney has led a strategic planning effort that is resulting in important new academic and co-curricular programs that expand opportunities for women. She has forged partnerships with leading organizations, including the Harvard/MIT online education platform known as edX; the MassMutual Life Insurance Company, a supporter of data science initiatives; and the Posse Foundation. Under her leadership, Smith engaged noted architectural designer Maya Lin to re-envision its historic Neilson Library, in the context of its renowned Frederick Law Olmsted–designed campus, and to create a modern intellectual learning common. The $110 million project opened its doors in 2021. Women for the World: The Campaign for Smith, which McCartney led to its culmination in 2016, raised $486 million, setting a record for the largest and most successful campaign ever undertaken by a women’s college. Notably, the campaign raised close to $130 million for financial aid, including 103 new endowed scholarships. A central focus of McCartney’s presidency has been increasing access for every student who wants to study at Smith. In October 2021, McCartney announced that the college will eliminate loans from its undergraduate financial aid packages, beginning in fall 2022, replacing them with college grants.\n\nCarol T. Christ\n\n2002–13\n\nA widely respected scholar of Victorian literature, Carol T. Christ took up her duties as Smith’s 10th president in June 2002. In her first years at Smith, Christ launched an energetic program of outreach, innovation and long-range planning, including capital planning. She encouraged the development of coursework emphasizing fluency in American cultures and the diversity of experience of American ethnic groups and launched a review, conducted by members of the Smith faculty and outside scholars, to determine the distinctive intellectual traditions of the Smith curriculum and areas on which to build. Issued in 2007, The Smith Design for Learning: A Plan to Reimagine a Liberal Arts Education builds upon Smith’s history of pedagogical innovation, identifying priority areas—among them, international studies, environmental sustainability, and community engagement—for significant investment over the coming decade.\n\nIn the area of capital planning, a number of major building projects came to fruition during Christ’s tenure: the renovation and expansion of the Brown Fine Arts Center; a dramatic new campus center; a renovated Lyman Conservatory; the impressive Olin Fitness Center; new homes for the Poetry Center and the Mwangi Cultural Center; the renovation of Lilly Hall, home of the college’s School for Social Work; and the construction of Conway House, an apartment building for Ada Comstock Scholars with children. Ford Hall, a state-of-the-art, sustainably designed classroom and laboratory facility named in recognition of its lead donor, the Ford Motor Company Fund, opened in fall 2009; it serves as home to the college’s pioneering Picker Engineering Program as well as the departments of molecular biology, chemistry, biochemistry and computer science. Under Christ’s leadership, Smith made significant commitments to environmental sustainability in its curriculum and campus operations, including the construction of a co-generation facility for power and heat and the dedication of the MacLeish Field Station, a 200-acre woodland tract in Whately, Mass., for environmental education and research.\n\nRuth Simmons\n\n1995–2001\n\nIn December 1994 Ruth Simmons was chosen as Smith’s ninth president. With a long and distinguished career in higher education behind her, Simmons was the first African-American woman to head any top-ranked American college or university. Simmons galvanized the campus through an ambitious campus-wide self-study process that resulted in a number of landmark initiatives, including Praxis, a program that allows every Smith student the opportunity to elect an internship funded by the college; an engineering program, the first at a women’s college; programs in the humanities that include the establishment of a poetry center and a peer-reviewed journal devoted to publishing scholarly works by and about women of color; and curricular innovations that include intensive seminars for first-year students and programs to encourage students’ speaking and writing skills.\n\nA number of building projects were launched during Simmons’ administration; most significant was the Brown Fine Arts Center, a $35-million expansion and renovation of the Smith College Museum of Art, art department and art library. Ground was broken in 2002 for a campus center, and renovation and expansion of the Lyman Conservatory was completed in 2003.\n\nSimmons left Smith in June 2001, assuming the presidency of Brown University. John M. Connolly, Smith’s first provost, served as acting president for one year, skillfully guiding the college through the trauma of September 11, 2001, and its aftermath.\n\nMary Maples Dunn\n\n1985–95\n\nThe college that President Conway left to her successor was in some ways very different from the college served by Presidents Seelye, Burton and Neilson. When Mary Maples Dunn came to Smith in 1985 after many years as a professor of history and then as dean of Bryn Mawr College, Smith’s student body had diversified. During its early decades the student body had been overwhelmingly Protestant, but by the 1970s, Roman Catholic and Jewish college chaplains served alongside the Protestant chaplain, reflecting the students' religious and ethnic variety. All racial, ethnic and religious groups are now well represented on campus, evidence of Smith’s continuing moral and intellectual commitment to diversity.\n\nIn her decade as president, Mary Maples Dunn led the college through exciting and challenging times. During her tenure, the college raised more than $300 million, constructed two major buildings and renovated many more, enhanced communication on and off campus, attracted record numbers of applicants (while holding the quality of those applicants steady) and doubled the value of its endowment. Computer technology transformed the way Smith conducted its business. And the curriculum became broader in scope, with five new majors and increased course offerings in non-Western and neglected American cultures.\n\nJill Ker Conway\n\n1975–85\n\nIn the late 1960s and early 1970s another important movement—the women’s movement—was gathering momentum. This was to have a profound effect on American society and to confirm the original purpose of Smith College. The college began its second century in 1975 by inaugurating its first woman president, Jill Ker Conway, who came to Smith from Australia by way of Harvard and the University of Toronto. She was a charismatic and energetic leader with a vision for women's education, and her administration was marked by three major accomplishments: a large-scale renovation and expansion of Neilson Library, evidence of Smith’s undiminished concern for the heart of the liberal arts; the rapid growth of the Ada Comstock Scholars Program, through which women beyond the traditional college age could earn a Smith degree; and exceptionally successful fund-raising efforts. Also during President Conway’s administration, the Career Development Office was expanded to better counsel Smith students and alumnae about career opportunities and graduate training for women. Recognizing the rapidly growing emphasis on fitness and athletics for women, Smith built the Ainsworth Gymnasium and broke ground for new indoor and outdoor track and tennis facilities. President Conway’s contributions underscored her commitment to women’s colleges and a liberal arts education in today's society. Since leaving Smith, Conway has written an acclaimed series of memoirs; her 2001 book, A Woman's Education, concerns her Smith years.\n\nThomas Corwin Mendenhall\n\n1959–75\n\nWhen Thomas Corwin Mendenhall came from Yale in 1959 to become Smith’s sixth president, both the college and the country at large were enjoying peace and prosperity. During the 1960s, social and cultural changes stirred the college profoundly, and a series of powerful movements influenced the larger society and the academic world alike. In response to the needs of increasingly independent and ambitious students, the curriculum was thoroughly revised. College-wide requirements were set aside and independent study encouraged. The college made more varied educational experiences available to Smith undergraduates by extending cooperation with its neighbors—Amherst, Hampshire and Mount Holyoke colleges and the University of Massachusetts. And Smith joined other private colleges in the Northeast to develop the Twelve College Exchange Program. The college added buildings with the most modern facilities for the study of the natural sciences, performing arts and fine arts. The new Fine Arts Center included the Smith College Museum of Art, now one of the most distinguished college museums in the country.\n\nThe 1960s saw the civil rights movement, the students’ rights movement and the anti-war movement take root and grow at many of the country’s universities and colleges, including Smith. Thanks to these movements and to the wisdom, tact and humor of President Mendenhall, the college emerged from the 1960s with a more precise awareness of student needs and an active, practical sense of social responsibility.\n\nMeanwhile, life in the college houses was changing. The old rules governing late evenings out and male visitors were relaxed, then abandoned. Not surprisingly, when Vassar began to accept men, and Yale, Princeton and Dartmouth to accept women as candidates for degrees, some members of the college community wondered whether Smith should also become coeducational. In 1971, a committee of trustees, faculty, administration, students and alumnae studied the question in detail. The committee concluded that admitting men as candidates for the Smith degree would detract from the founding purpose of the college, the best possible education for women.\n\nBenjamin Fletcher Wright\n\n1949–59\n\nBenjamin Fletcher Wright came from Harvard to become Smith’s fifth president in 1949. The college had by then resumed its regular calendar and completed several much-needed building projects, including a new heating plant and a student recreation center named for retiring President Davis. The most memorable achievements of President Wright’s administration were the strengthening of Smith's financial position and the defense of academic freedom during the 1950s.\n\nIn 1950, the $7 Million Fund Drive was triumphantly completed, enabling the college to improve facilities and increase faculty salaries. In 1955, the Helen Hills Hills Chapel was completed, giving Smith its own place of worship. The early 1950s were not, though, easy years for colleges; McCarthyism bred a widespread suspicion of any writing or teaching that might seem left of center. In defending his faculty members' right to political and intellectual independence, President Wright showed great courage and statesmanship. Complementing his achievements was the financial and moral support of Smith’s Alumnae Association, by now the most devoted and active group of its kind in the country. Before President Wright’s term ended, the college received a large gift for constructing a new faculty office and classroom building to be named for him.\n\nHerbert Davis\n\n1940–49\n\nPresident Neilson retired in 1939, just before the outbreak of World War II, and for one year Elizabeth Cutter Morrow, an alumna trustee, served as acting president. Herbert Davis took office as Smith’s fourth president in 1940 and reaffirmed the contributions that a liberal arts college could make to a troubled world. Already during World War I a group of Smith alumnae had gone to France to do relief work in the town of Grécourt; a replica of Grécourt’s chateau gates is now emblematic of the college.\n\nSoon after the 1941 bombing of Pearl Harbor, the college agreed to provide facilities on its campus for the first Officers’ Training Unit of the Women’s Reserve, or WAVES. The college added a summer term from 1942 to 1945 so some students could graduate more quickly and go on to government, hospital or military service. Though physically isolated by travel restrictions, the college retained its cosmopolitan character as refugees came to lecture, teach and study. And foreign films were shown regularly in Sage Hall—a practice that would give generations of students their sensitivity both to other cultures and to an important new art. President Davis' administration was marked by intensified academic life, reflecting his belief that serious study was a way of confronting the global threat to civilization.\n\nWilliam Allan Neilson\n\n1917–39\n\nWhen William Allan Neilson became president in 1917, Smith was already one of the largest women’s colleges in the world. President Neilson shrewdly developed the advantages of large academic institutions while maintaining the benefits of a small one. Under his leadership, the size of the faculty continued to increase while the number of students remained at about 2,000. The curriculum was revised to provide a pattern still followed in many American colleges—a broad foundation in various fields of knowledge, later complemented by the more intensive study of a major subject. The college expanded honors programs and initiated interdepartmental majors in science, landscape architecture and theatre. The School for Social Work, a coeducational graduate program, was founded. And more college houses were built, mainly in the Georgian complex called “the Quad,” so that every student could live on campus.\n\nNot only did President Neilson help make Smith one of the leading colleges in the United States, whether for men or women, but he also developed it into an institution of international distinction and concerns. President Neilson, himself a Scotsman, married to a well-educated German woman, transformed the college from a high-minded but provincial community in the hinterland of Massachusetts into a cosmopolitan center constantly animated by ideas from abroad. Between the two world wars, he brought many important exiled or endangered foreign teachers, scholars, lecturers and artists to the college. Meanwhile, as long as peace lasted, Smith students went to study in France, Italy and Spain on the Junior Year Abroad Program instituted by the college in 1924.\n\nMarion LeRoy Burton\n\n1910–17\n\nSmith’s second president, Marion LeRoy Burton, took office in 1910. President Burton, a graduate of Yale Divinity School, was a gifted public speaker with an especially acute business sense. He used these talents to help the college raise the amazing sum of $1,000,000—a huge endowment campaign for any college at that time. With the college’s increased endowment, President Burton was able to increase faculty salaries substantially and improve the faculty-to-student ratio. President Burton's fund drive also invigorated the alumnae, bringing them closer to the college than ever before and increasing their representation on the board of trustees.\n\nAlong with improving the financial state and business methods of the college, President Burton also contributed to a revision of the curriculum and initiated college honors programs to recognize outstanding students. He also helped to organize a cooperative admission system among Smith, Mount Holyoke, Wellesley and Vassar, the finest women’s colleges of the day. President Burton’s accomplishments are commemorated today by Burton Hall, the science building that his fund drive helped to finance.\n\nLaurenus Clark Seelye\n\n1873–1910\n\nSmith College opened in the fall of 1875 with 14 students and six faculty under the presidency of Laurenus Clark Seelye. Its small campus was planned to make the college part of what John M. Greene called “the real practical life” of a New England town, rather than a sequestered academic preserve. College Hall, the Victorian Gothic administrative and classroom building, dominated the head of Northampton’s Main Street. For study and worship, students used the town’s well-endowed public library and various churches. Instead of a dormitory, students lived in a “cottage,” where life was more familial than institutional. Thus began the \"house\" system that, with some modifications, the college still employs today. The main lines of Smith’s founding educational policy, laid down in President Seelye’s inaugural address, remain valid today: then as now, the standards for admission were as high as those of the best colleges for men; then as now, a truly liberal education was fostered by a broad curriculum of the humanities, the fine arts and the natural and social sciences.\n\nDuring the 35 years of President Seelye’s administration, the college prospered mightily. Its assets grew from Sophia Smith’s original bequest of about $400,000 to more than $3,000,000; its faculty to 122; its student body to 1,635; its buildings to 35. These buildings included Alumnae Gymnasium, site of the first women’s basketball game, and William Allan Neilson Library, one of the best-stocked undergraduate libraries in the country."}, {"url": "https://blogs.smith.edu/blog/smithipedia/administration/president-william-allan-neilson/", "page_content": "President William Allan Neilson\n\nPresident William Allan Neilson\n\nWilliam Allan Neilson was born March 28, 1869, in Doune, Pertshire Scotland. He attended Edinburgh University where he studied philosophy, graduating with honors in 1891. In order to join his brother who emigrated to Canada, Neilson crossed the Atlantic and began teaching in Upper Canada College in Toronto which was a boarding school for young boys.\n\nDeciding that he would prefer to be a scholar than a school master, Neilson went on to Harvard Graduate School in Cambridge, MA where he received his Ph.D. in English in 1898. Upon receiving his Ph.D., Neilson accepted a position as an Associate in English Literature at Bryn Mawr College in Bryn Mawr, PA. Neilson taught at many other fine institutions before settling into the work of an administrator. Harvard, Radcliffe, the Sorbonne, Columbia, Barnard, and the University of California all made use of Neilson’s talents at one time or another.\n\nIt was during his years as a professor that Neilson distinguished himself as the sort of scholar that an academic institution would wish to guide it. Before coming to Smith, Neilson made a name for himself both as a professor devoted to his students’ learning (he was the only instructor of Helen Keller’s who learned the manual sign language she used for communication) but also as a writer and an editor. Among his writings were Essentials of Poetry (1912) and The Facts about Shakespeare (1913). He also was the editor of Milton’s Minor Poems (1899) and Shakespeare’s Complete Works (1906). In 1917, Neilson was offered the Presidency of Smith College. He accepted on the conditions that he would not be obligated to raise money, and that a president’s house would be built, with which the trustees complied.\n\nWhen Neilson arrived at Smith in 1917 perhaps one of the best assets that Neilson brought to Smith was his quick wit that endeared him to student, staff, faculty, and alumnae alike. At Neilson’s final commencement in 1939 Cynthia Walsh recalled one particular instance: The seniors will especially recall that on May Day when they went to serenade him, his new collie puppy began to bark, not realizing what sweet voices were vying with the birds so early in the morning. When the president stepped out he said, “My dog thinks you’re sheep,” and the volleys of laughter which greeted this remark quite drowned out the rest: ”-but I think you’re lambs!”\n\nNeilson’s accomplishments at Smith were many. When Neilson noticed that a majority of Smith students lived off campus he set about the task of purchasing and building new residences so that all Smith students would live on campus. After building the Great Quadrangle, purchasing Chapin House, Talbot House, Sessions House, and many others his goal was completed. During Neilson’s 22-year term as president, the campus also saw the additions of Sage Music Hall, Scott Gymnasium, Tryon Art Gallery, the Alumnae House, the Infirmary, and the President’s house.\n\nNeilson also established the Junior Year in France, Junior Year in Italy, and the Junior Year in Spain Programs. Special Honors, the Smith College Day School, and the School for Social Work were additions that Neilson made to the college. Never one to rest on his laurels, Neilson continued writing and editing while looking after the well being of 2,000 students. In 1920 he wrote History of English Literature and in 1922 he edited Roads to Knowledge. He also was the editor-in-chief of Webster’s New International Dictionary, 2nd edition, 1934.\n\nWilliam A. Neilson died on February 13, 1946.\n\nFor further information please see: http://asteria.fivecolleges.edu/findaids/smitharchives/manosca13.html\n\nThorp, Margaret Farrand, Neilson of Smith (NY: Oxford University Press), 1956"}, {"url": "https://libex.smith.edu/omeka/exhibits/show/neilson/william-allan-neilson", "page_content": "For 37 years the building which was geographically and intellectually the heart of the campus was called simply “The Library.” When President William Allan Neilson died in 1946, the Trustees named it as a memorial tribute to him.\n\nWilliam Allan Neilson, Smith’s third president, died on February 13 at the College Infirmary. He was visiting Northampton to research a history of Smith College that had been commissioned by the Trustees when he became ill. The next morning there was a memorial chapel service; he lay in the Little Chapel until the funeral service in John M. Greene Hall on February 16; he was cremated and later buried in the Botanic Garden.\n\nPresident Neilson's accomplishments at Smith were many. At a time when a majority of Smith students lived off campus, he set about the task of purchasing and building new residences so that all Smith students could live together on campus. After building the Great Quadrangle, purchasing Capen House, Talbot House, Sessions House, and many others, his goal was completed. During Neilson's 22-year term as president, the campus also saw the additions of Sage Music Hall, Scott Gymnasium, Tryon Art Gallery, the Alumnae House, the Infirmary, and the President's house.\n\n\n\nNeilson also established the Junior Year in France, Junior Year in Italy, and the Junior Year in Spain Programs. Special Honors, the Smith College Day School, and the School for Social Work were additions that Neilson made to the college.\n\nTo learn more about President Neilson, follow this link to read the text of a lecture on the life and legacy of Smith’s third president by Peter I. Rose, Sophia Smith Professor Emeritus of Sociology and Anthropology, Smith College. You may also listen to the talk by clicking on the play button symbol below. Professor Rose gave this lecture as part of the Libraries' centennial celebration events on February 18, 2010."}, {"url": "https://campus-school.smith.edu/history", "page_content": "Our History\n\nIn 1926, Smith College President William Allan Neilson established The Smith College Day School, which was created to serve as a learning environment for Smith College students in education and psychology and to offer a unique educational choice for the local community. Opening day enrollment stood at 24 children.\n\nThe school’s impact can be measured by its growing size, which reached 87 students in 1947 and 124 in 1962. Needing more space, in 1965 a wing was added to Gill Hall. Another expansion, converting the college’s former laundry building, was completed in 1996, with seven new classrooms added to the school’s facility to accommodate growing enrollment.\n\nThe school has always provided a unique and special educational experience for students, for it is the only school in the region to connect the learning resources of a world class college to an elementary school program. Campus School also serves as a lab school where Smith College student teachers learn their craft and Campus School teachers and professors from the college engage in research and pursue best practices in teaching and learning. Students are the clear beneficiaries of this energizing and engaging environment, and this is as true today as it was in 1926.\n\nFrom humble beginnings, the Campus School has embraced its mission to be a center for best practices in education, serving children from kindergarten to sixth grade and advancing the study and practice of education through the 20 th and early 21 st centuries. While much has changed in education over the past 90 years, Campus School of Smith College remains a place where children are at the center of our work and excellence is pursued with passion and purpose."}, {"url": "https://findingaids.smith.edu/repositories/4/resources/25", "page_content": "The William Allan Neilson Papers consist of 21.75 linear feet of correspondence, newspaper clippings, manuscripts, press releases, lecture notes, texts of speeches, photographs, and miscellaneous papers which document Neilson's life and career. While these papers contain material dating from Neilson's years at Smith College (1917-1939), his official correspondence as president of the college is stored separately in the College Archives' holdings of records of the Office of the President.\n\n\n\nThe papers document Neilson's personal life with extensive family material. His letters to his brother and sisters are particularly valuable. Among other things these letters present Neilson's view of life at Bryn Mawr College under M. Carey Thomas, his strong opinions on world politics, his experiences tutoring Helen Keller at Radcliffe College, and his first impressions of Smith College. This series of letters is especially strong for the years between Neilson's arrival at Harvard University for graduate study in 1895 and his marriage in 1905. In addition to the Neilson family correspondence there is extensive correspondence between the Neilson and Muser families plus diaries and writings of Elisabeth Muser Neilson, her parents, and her sister. Much of the Muser family material is in German.\n\n\n\nOther personal material such as photographs, correspondence, class notes, and student essays document Neilson's youth and education. His love of his native Scotland and his study of its language and literature are clearly in evidence in his University of Edinburgh essays.\n\n\n\nCorrespondence and miscellaneous papers, 1917-1946, document such day-to-day concerns as finances, family health, the running of the household, and travel arrangements.\n\n\n\nNeilson's career as professor and scholar of English and Scottish literature is represented by class notes and correspondence with students and colleagues which date primarily from his years at Harvard and Radcliffe. Smith College material includes a few notes for courses Neilson taught in the English department but consists primarily of documentation of the events and celebrations of his presidency such as his appointment, inauguration, tenth and twentieth anniversaries, and retirement. Other material documents Neilson's affiliation with scholarly organizations such as the Modern Language Association, the Scottish Text Society, and the Shakespeare Association of America. There are also texts and notes for speeches on Shakespeare and Burns. Neilson's scholarly publications are represented by a number of articles, an unfinished manuscript for a book on allegory, and proofs for a 1942 edition of Shakespeare's plays and poems. Correspondence and news clippings document other writing and editorial projects in different stages of the work. Two such projects of particular interest are the 'five foot shelf' series of Harvard Classics, which Neilson edited with Charles W. Eliot, and the second edition of Webster's New International Dictionary, for which Neilson was editor-in-chief.\n\n\n\nIn addition to his work as professor, administrator, and scholar, Neilson was much in demand for committee work. As a respected educator and administrator, his advice and support was continually sought by educational institutions and organizations. Correspondence documents Neilson's work as a member of various committees for Harvard University, his suggestions on the planning of the campus and curriculum of Bennington College, and his advice and endorsements for the New School for Social Research and a variety of organizations promoting adult education such as the Affiliated Schools for Workers, the Eliot Foundation for Adult Education, and the Committee on University Extension in the Connecticut Valley.\n\n\n\nNeilson was also well-known for his vigorous support of liberal causes of the day. His political activities are reflected in his involvement with a large number of organizations most of which worked for civil liberties, peace, aid to refugees, or improved foreign relations. This work is documented by correspondence with such organizations as the American Civil Liberties Union, the Foreign Policy Association, the American Society for Cultural Relations with Russia, the National Refugee Service, various League of Nations organizations, and the Commission to Study the Organization of Peace.\n\n\n\nAll of Neilson's interests and concerns are in evidence in his speeches and writings. Texts contained in the papers are a rich source for the study of life at Smith College, and trends in education and politics during Neilson's term as president of Smith (1917-1939). News clippings document the quite considerable attention paid to his views.\n\n\n\nNeilson was a renowned speaker who seldom prepared a text, preferring to talk from cursory notes made shortly before the speech was to be delivered. Because of this process the texts contained in the papers are almost exclusively transcriptions. Some of them were edited for publication, others remain more or less as they were delivered. The papers also contain some of Neilson's handwritten notes for speeches.\n\n\n\nCorrespondence, citations, and news clippings document Neilson's many awards and honors and a group of biographical articles gives an overview of Neilson's life and work. The papers also contain notes, typescripts, and correspondence for Margaret Farrand Thorp's 1956 biography Nelson of Smith."}, {"url": "https://www.smith.edu/news/maya-lin-new-neilson-news-release", "page_content": "Now, as the redesigned library opens to members of the on-campus community, the new Neilson offers, McCartney says, “a reenvisioning of a building that has been at the heart not just of our campus but also of the educational experiences of generations of students, staff and faculty.\n\n“This state-of-the-art library houses the new and the old: our archives and special collections, digital design studios, the Jill Ker Conway Center for Innovation and Entrepreneurship, and so much more,“ McCartney said. “It is a place of learning, connection, discovery and beauty—a place that invites us to explore the world in all its wonder.”\n\nArchitectural designer Maya Lin’s re-imagined Neilson Library is an innovative, contemporary structure that presents a compelling vision for the modern library while respecting the building’s historic significance.\n\nWith an emphasis on natural light, sustainable environmental design principles, and flexible interior space that can be used for a variety of purposes, Lin’s design re-imagines the library as a space for collaboration and reflection. It also reconnects the college’s science quadrangle with the campus’ historic center, restoring integrity to Frederick Law Olmsted’s 1893 campus plan.\n\nMaya Lin Studio developed the design in partnership with colleague William Bialosky and the firm of Shepley Bulfinch. Landscape architecture is by Lin with landscape designer Edwina von Gal (in collaboration with Ryan Associates).\n\nBegun in 2018, the five-story, 153,865 gross-square-foot project is Lin’s first college library and one of the most significant capital projects in Smith College’s history.\n\nIn an artist’s statement, Lin says she envisioned the new Neilson as “a dialogue between old and new.”\n\n“By preserving the original, historic Neilson foundations and exterior, the new library retains the memory of the original structure. But completely rethinking and reconstructing the interior speaks to the needs of students today—with more room for collaborating and socializing. And of course the book is still central to the space,” Lin says. “When you’re in Neilson, you’ll know that you are in a house of books.”\n\nThe new Neilson retains the original 1909 structure, including the venerable Neilson Browsing Room, but replaces the 1962 and 1982 additions with “jewel box” wings—constructed of masonry, wood and glass—that offer open, inviting, light-filled spaces designed to support research, teaching and learning in a variety of styles. Featuring gracious entryways on each side of the building, the new library draws people in from every direction.\n\nInside, books are abundant and visible. Visitors will also notice that all five floors are connected by an eye-catching central “oculus,” an open core designed to capture and disseminate ethereal light throughout the space.\n\nTwo curved, “jewel box” wings (recently named for Smith presidents emeritae Ruth Simmons and Mary Maples Dunn) create comfortable space for reading (in the South wing) and socializing (in the North Wing). These striking, curved additions to the building’s original 1909 core replace outmoded wings that divided the heart of Smith’s campus, uniting Smith’s historic quadrangle with its science quadrangle. “The two curved, organically shaped jewel boxes are a contrast to the original, orthogonal design, and speak to my aesthetic, which introduces a more hand drawn and organic shape,” says Lin.\n\nThe primary purpose of Smith’s library redesign was not to expand space for existing collections, which are among the strongest of any liberal arts college, but to think creatively and intentionally about what a forward-looking library should be, how it should function, and what scholarly and social goals it might serve.\n\nIn particular, Smith sought to develop a library that reflects and conveys the nature of a Smith education, which is global in scope and based on learning across disciplines.\n\nThe project cost for the new Neilson Library was $120 million, of which $42.8 million has been funded through philanthropy.\n\nReflecting the purpose of a contemporary library\n\nThe new Neilson places a premium on flexible space that blends traditional collections with new technologies and an intentional focus on collaborative learning.\n\nA “learning hub” for the campus—offering classrooms, quiet study and reading rooms, as well as expanded space for collaboration, socializing and high-tech work—the new Neilson features a Digital Media Hub with multimedia equipment and studio space for recording digital content; GIS and gaming labs; and a large, multifunctional Learning Commons where students can work with research librarians, instructional technologists and writing and quantitative learning specialists.\n\nThe Jill Ker Conway Innovation and Entrepreneurship Center, named for Smith’s first woman president, is housed in a prominent place within the central core of the library, just to the left of the entrance from Seelye Lawn. Across from the Conway Center, the Neilson Browsing Room—a longstanding and beloved home for readings, lectures and other events—has been restored and updated.\n\nOn the top floor, the Skyline Reading Room provides large, open space for meetings, classes, events or individual study. A rooftop patio offers expansive views of the Holyoke Range.\n\nProvost and dean of the faculty Michael Thurston says, “What’s especially exciting to me is the way the shape and flow of spaces emphasize collaborative inquiry. It really emblematizes and enacts the ancient and vital identity of a library as the place where a community of scholars engages both the preserved thought of the past and the ongoing conversation that looks to renew and enrich our understanding.”\n\nLeading in sustainability\n\nThe new Neilson is intentionally designed as one of the greenest, most energy-efficient libraries in the U.S., using 50 percent less energy than a typical library and contributing significantly to the college’s goal of reaching carbon neutrality by 2030. Maximizing the use of natural light through the central, light-catching “oculus” and expansive windows (laced with an ultraviolet webbing pattern that prevents bird collisions), Smith’s new Neilson Library unites the indoors and outdoors with an exterior courtyard and an outdoor amphitheater that can be used for performances and classroom instruction. Throughout, the structure emphasizes the use of locally sourced materials, including limestone.\n\nLin said, “My approach was to create a new, state-of-the-art, sustainable building that creates a dialogue with the historic Neilson and opens up and restores the Olmsted master plan, expanding the possibilities of the library while reducing the overall footprint of the building and restoring the heart of the campus.”\n\nHistory of the project\n\nSmith’s library redesign began in 2010, when the college engaged Shepley Bulfinch to partner on a master plan for all of the college’s libraries. Soon after, the college worked with Shepley Bulfinch on several studies to assess what could feasibly be accomplished with current library space. In 2014, the trustees approved the concept of a redesign of Neilson and the hiring of an architect.\n\nMaya Lin and Shepley Bulfinch were hired in April 2015. They approached the Smith library redesign as a creative exploration and an active partnership with members of the Smith community. During the process, nearly 1,900 students, faculty, staff, alums and members of the Northampton community participated in more than 30 “engagement sessions” designed to help re-imagine Neilson for the 21st century.\n\nThe library’s interior design reflects priorities identified during those sessions, including:\n\na strong desire for natural light\n\nflexible space that can easily be rearranged to suit a variety of teaching, learning and research purposes\n\na cafe where students can be “alone together,” studying in solitude while surrounded by their peers\n\nstudy spaces, where students and faculty can work in solitude\n\na variety of spaces that support quiet reflection as well as task-oriented scholarship\n\nintegrated space for Smith’s outstanding special collections—one of the world’s largest and best collections of materials related to women’s history.\n\nNamed for Smith’s third president, William Allan Neilson, Neilson Library serves as the sciences, social sciences and humanities library and includes the library administration offices. Neilson also is home to Smith’s extraordinary Special Collections—including the Smith College Archives, the Mortimer Rare Book Room, and the Sophia Smith Collection—one of the world’s largest and most important archives of women’s history.\n\nAbout the Location\n\nBuilt in 1909 and expanded in 1962 and in 1982, Neilson Library holds pride of place on the Smith College campus, sitting between the science quad and the arts and humanities quad.\n\nWorking within Frederick Law Olmsted’s 1939 plan for the Smith campus, Lin’s design for the new Neilson eliminates the architectural barrier created by the previous building, unifying the campus and opening the view—and the paths for travel—from the Smith College Museum of Art to the science quad, and from Green Street to Chapin Lawn.\n\nThe new Neilson highlights significant improvements to the surrounding landscape, recalling Olmsted’s original campus plan, which Lin describes as “not formal, but very organic. Our goal,” Lin says, “was to restore the heart of the Smith Campus—creating a landscape that welcomes you to sit, read and gather outside as well as bringing back the flow around the building.”\n\nThe revised landscaping effectively reveals and incorporates the 16-foot elevation change between Neilson’s east and west sides, and will also preserve several heritage trees that surround the original 1909 structure.\n\nAbout Maya Lin\n\nKnown for her large-scale environmental installations, memorials and architectural works, Maya Lin is an American artist, architectural designer and environmentalist whose many mould-breaking projects defy explicit categories. Always trying to find a balance between opposing forces, she says, “My work originates from a simple desire to make people aware of their surroundings.”\n\nNature and the environment have long been central concerns for Lin, who attended Yale University, where she earned a bachelor’s degree in 1981 and a Master of Architecture degree in 1986. Lin was thrust into the spotlight when, as a senior at Yale, she submitted the winning design in a national competition for the Vietnam Veterans Memorial to be built in Washington, D.C. She has gone on to a remarkable career in both art and architecture, while still being committed to memory works that focus on some of the critical historical issues of our time.\n\nLin’s art explores how we experience and relate to landscape, setting up a systematic ordering of the land that is tied to history, memory, time and language. Her interest in landscape has led to works influenced by topographies and geographic phenomena.\n\nHer architectural projects are largely undertaken at the request of non-profit institutions and include the newly renovated Neilson Library (2021) at Smith College, the Museum for Chinese in America (2009) in New York City, the Riggio-Lynch Interfaith Chapel (2004), the Langston Hughes Library (1999) in Clinton, Tennessee, and the Novartis Institutes for Biomedical Research: Cambridge Campus (2015).\n\nHer designs create a close dialogue between the landscape and built environment, and she is committed to advocating sustainable design solutions in all her works.\n\nIn 2009, Maya Lin started work on her last memorial, “What is Missing?”, an ongoing, multi-sited multimedia installation that raises awareness about habitat loss and biodiversity and emphasizes how protecting and restoring habitats can help protect species and significantly reduce climate change emissions.\n\nLin, who operates Maya Lin Studio in New York, has received many honors, among them the National Medal of Arts (2009) and the Presidential Medal of Freedom (2016), both conferred by President Barack Obama, and the Gish Prize (2014). The film “Maya Lin: A Strong Clear Vision” won the 1994 Oscar for Best Documentary.\n\nAbout Julia Chang Lin, Class of 1951\n\nThe new Neilson’s sunken courtyard is named for Maya Lin’s mother, Julia Chang Lin, who led an extraordinary life.\n\nBorn in Shanghai in 1928, she grew up in a small coastal town in South China, attended private schools, and in 1947 enrolled at St. John’s University in Shanghai.\n\nIn May 1949, on the same day that the Communists marched into Shanghai, Lin received a telegram from Smith, notifying her that she’d been accepted as a transfer student and awarding her a $1,000 scholarship. The family housekeeper, Liu Ma, sewed the telegram and two $10 bills into the collars of Lin’s Chinese dress. As the Nationalist government bombed the coast, Lin was smuggled to the United States on a fishing boat with her best friend. Detained for weeks on an island held by the Nationalists, Lin arrived at Smith one month after the semester had started, in October 1949.\n\nAfter graduating from Smith and earning graduate degrees from the University of Washington, Julia Chang Lin taught for nearly 30 years in the English Department at Ohio University, where she also helped establish the university’s Chinese language courses. The author of four books, she was influential in bringing generations of Chinese women poets to a western audience. In 1999, Lin was one of 29 “remarkable women” honored by Smith for “achievements representing the accomplishments of generations of Smith alumnae.”\n\nJulia Chang Lin died of cancer in New York in 2013, at age 85. At the time of her death, she was writing an autobiography. The sunken courtyard at the center of the new Neilson has been named for Julia Chang Lin.\n\nAbout Smith: Founded in 1871, Smith College opened in 1875 with 14 students. Today, it is one of the largest women’s liberal arts colleges in the United States, educating women of promise for lives of distinction and purpose. Smith enrolls 2,600 students from nearly every state and more than 50 other countries to cultivate leaders able to address the complex, urgent problems of today. As a community of scholars, entrepreneurs, scientists, activists and humanitarians, Smith is changing the world. More information at smith.edu."}, {"url": "https://findingaids.smith.edu/repositories/4/resources/35", "page_content": "William Allan Neilson served as president of Smithh College for 22 years. Born March 28, 1869, in Doune, Pertshire Scotland, he attended Edinburgh University where he studied philosophy, graduating with honors in 1891. In order to join his brother who emigrated to Canada, Neilson crossed the Atlantic and began teaching in Upper Canada College in Toronto which was a boarding school for young boys.\n\n\n\nDeciding that he would prefer to be a scholar than a school master, Neilson went on to Harvard Graduate School in Cambridge, MA where he received his Ph.D. in English in 1898. Upon receiving his Ph.D., Neilson accepted a position as an Associate in English Literature at Bryn Mawr College in Bryn Mawr, PA. Neilson taught at many other fine institutions before settling into the work of an administrator. Harvard, Radcliffe, the Sorbonne, Columbia, Barnard, and the University of California all made use of Neilson's talents at one time or another.\n\n\n\nIt was during his years as a professor that Neilson distinguished himself as the sort of scholar that an academic institution would wish to guide it. Before coming to Smith, Neilson made a name for himself as a professor devoted to his students' learning. He was the only instructor of Helen Keller's who learned the manual sign language she used for communication. He was also an accomplished writer and editor. Among his writings were Essentials of Poetry (1912)and The Facts about Shakespeare (1913). He also was the editor of Milton's Minor Poems (1899) and Shakespeare's Complete Works (1906).\n\n\n\nIn 1917, Neilson was offered the Presidency of Smith College. He accepted on the conditions that he would not be obligated to raise money, and that a president's house would be built, conditions the trustees complied with.\n\n\n\nNeilson's quick wit that endeared him to student, staff, faculty, and alumnae. At Neilson's final commencement in 1939 Cynthia Walsh recalled one particular instance:\n\n\n\nThe seniors will especially recall that on May Day when they went to serenade him, his new collie puppy began to bark, not realizing what sweet voices were vying with the birds so early in the morning. When the president stepped out he said, \"My dog thinks you're sheep,\" and the volleys of laughter which greeted this remark quite drowned out the rest: \"-but I think you're lambs!\"\n\n\n\nNeilson's accomplishments included purchasing and building new residences so that all Smith students would live on campus. He was responsible for the building of the Great Quadrangle, purchasing Chapin House, Talbot House, Sessions House, and many others. During Neilson's 22-year term as president, the campus also saw the additions of Sage Music Hall, Scott Gymnasium, Tryon Art Gallery, the Alumnae House, the Infirmary, and the President's house.\n\n\n\nNeilson also established the Junior Year in France, Junior Year in Italy, and the Junior Year in Spain Programs. Special Honors, the Smith College Day School, and the School for Social Work were additions that Neilson made to the college.\n\n\n\nNeilson continued writing and editing while looking after the well being of 2,000 students. In 1920 he wrote History of English Literature and in 1922 he edited Roads to Knowledge. He also was the editor-in-chief of Webster's New International Dictionary, 2nd edition, 1934."}, {"url": "https://www.smith.edu/news/100-years-psychology", "page_content": "Why was it bold for Smith to be among the first colleges to declare psychology as its own department?\n\nAs early as 1872—even before one brick of College Hall had been laid—the college prospectus promised the study of psychology and described it as the “science” of the mind rather than a “philosophy,” as most scholars thought at the time. We owe a debt to the forward-thinking individuals who correctly perceived the importance of developing psychology into an independent discipline.\n\nWhy is the major particularly meaningful for a liberal arts women’s college?\n\nLike almost every profession in the 1920s, psychology was a male-dominated field. It was extremely rare for women to be hired into long-term, tenure-track positions. Mary Henle ’34, M.A. ’35, referred to the field for herself and her female colleagues as the “migratory profession.” However, alums from women’s colleges sometimes broke through. The first edition of A.N. O’Connell and N.F. Russo’s Models of Achievement: Reflections of Eminent Women in Psychology, published in 1983, contained profiles of 15 women psychologists. Three of them were affiliated with Smith: Eugenia Hanfmann, Molly Harrower, Ph.D. ’34, and Mary Henle ’34, M.A. ’35. Without a doubt, the decision to create an independent department at Smith cleared the way for more young women to become psychologists.\n\nHow has the major evolved over the past 100 years?\n\nThe major started as a curriculum of seven basic courses with a focus on consciousness as studied in adult white males. We now offer dozens of courses in three main tracks: Mind and Brain, Health and Illness, and Person and Society—each of which has introductory, intermediate, and advanced levels. Child development has emerged as its own subfield. Thanks to advances in neuroimaging techniques, we have a greater understanding of the neural underpinnings of many psychological phenomena. Researchers also study the influence of social and cultural forces, and there’s a better understanding of the importance of including more diverse populations in studies. One theme that has remained constant, however, is the department’s emphasis on experimental psychology, which provides students with hands-on experience in conducting experiments.\n\nWhat were some of the milestone moments that stood out for you in researching this anniversary?\n\nMary Whiton Calkins, who was the first female president of the American Psychological Association, among many other great achievements, graduated from Smith in 1885.\n\nIn 1927, German Gestalt psychologist Kurt Koffka was hired as the first William Allan Neilson Chair of Research to celebrate Neilson’s 10th anniversary as president of the college. His hiring ushered in the department’s golden era. Smith began to attract many established and up-and-coming scholars from the United States and abroad—some of whom visited, some of whom stayed. This period lasted about 15 years, until the advent of World War II.\n\n“Psychology professors were very supportive of students, creating a natural pull to the major.”\n\nIn the 1970s, clinical research opportunities for students interested in neuroatypical populations shifted from the use of projective techniques, such as the Rorschach test, to the experimental study of clinical populations.\n\nIn the 1990s, the department moved into its current building, Bass Hall. Several faculty members consulted with members of the then–Department of Biology to create the neuroscience program.\n\nWhy does psychology continue to be among the most popular majors?\n\nThere are several reasons. First, the level of analysis—individual human beings—studied by psychologists appeals to many of our students. Second, several alums I’ve interviewed told me that psychology professors were very supportive of students, creating a natural pull to the major for many. The most important reason, I believe, is that through both coursework and research opportunities we offer our students hands-on experience in conducting psychological research in a manner that reflects the current standards of the field.\n\nLooking forward, what excites you about the future of the department?\n\nWe’ve been thinking hard about the department’s future. In the near term, new faculty hires have been researchers with an applied focus on topics that attempt to solve real-world problems and whose work includes more diverse populations. As for the far term, we look forward to continuing technological and experimental advances that allow psychologists to gain a better understanding of the neural circuits underlying cognitive, clinical, and social phenomena and how environmental and cultural factors may influence them.\n\nNotable Faculty\n\nNAME YEARS SPECIALTY RESEARCH FOCUS Margaret Wooster Curti 1922–37 Developmental psychology Child psychology, intelligence William Sentman Taylor 1926–62 Clinical psychology Abnormal psychology Kurt Koffka 1927–41 Experimental psychology Human perception/ Gestalt psychology James Gibson 1928–49 Cognitive psychology Human perception Elsa Siipola 1933–72 Experimental psychology Personality Dilman John Doland 1953–82 Clinical psychology Child clinical psychology Robert Teghtsoonian 1963–96 Experimental psychology Psychophysics Randy Frost 1977–2020 Clinical psychology Obsessive-compulsive disorder, perfectionism, hoarding disorder Jill de Villiers 1979–2022 Developmental psychology Language acquisition Faye Crosby 1984–98 Social psychology Social justice, affirmative action, gender equality\n\nThis story appears in the Winter 2023 issue of the Smith Alumnae Quarterly."}, {"url": "https://www.smith.edu/about-smith/fort-hill/about/history", "page_content": "The Center for Early Childhood Education developed from separate preschool, infant/toddler and extended-day programs. The preschool program began in 1926 when Smith College President William Allan Neilson established the Smith College Nursery School as a cooperative school to provide educational opportunities for Smith graduate students. The preschool program was a half-day program until the early 1990s when an afternoon “extended-day” program was established to accommodate the increasing need for child care services. An infant/toddler program was developed in 1992 to provide childcare services for Smith faculty and staff.\n\nIn 2003, in response to a campus-wide Child Care Study Committee report, the Preschool Program, the Infant/Toddler Program and the Extended-Day Program formed the Smith College Center for Early Childhood Education to provide continuity for children, families, and staff.\n\nThe program currently enrolls about 80 children, infants through preschoolers, in seven classrooms. The mission of the program is to provide exemplary early education and care for young children, to offer a laboratory for research and fieldwork for college students and faculty, and to support the child care needs of families.\n\nThe program has been located on Lyman Road since 1964. Fort Hill refers to the land where English settlers offered shelter to the local Nonotuck Indians when the latter were attacked by Mohawk Iroquois Indians from the West in 1664, a decade after the English town was founded. No archaeological evidence of the fort has ever been found.\n\nThe estate home on the property was built by Samuel Whitmarsh in 1838. Whitmarsh was a merchant tailor from New York who founded the Northampton Silk Company and introduced silk manufacturing to Northampton. Silk manufacturing was a successful commercial venture in Northampton for many years. Whitmarsh built a large cocoonery and surrounded the property with gardens, shrubbery, trees, walks and a greenhouse. The 27-acre Whitmarsh homestead was one of the most beautiful places in the Connecticut River Valley and was featured in mid-century tourists’ guides as the perfect place for a carriage ride. The brick carriage house remains on the property.\n\nFinancial difficulties eventually resulted in Whitmarsh relinquishing his home and the property changed hands several times before Catherine and Edward Lyman bought it in 1866 to use as a summer home. Mr. Lyman was a native of Northampton and had moved to Brooklyn to work as an importer of tea and silk. He is well known in the city as the benefactor of the Academy of Music.\n\nThe estate remained in the Lyman family until 1946, when Smith College purchased the property. The main house has been renovated several times, most recently in 1999 by Dietz and Company Architects. The gracious estate home has served a variety of functions—as a private home, a dormitory and most recently as a school for young children.\n\nThe early childhood program moved from the historic home to a new facility on the site in August 2005. The program operates year-round, with options for full- or part-time enrollment, and is open to all families in the surrounding communities. Smith-affiliated families receive priority for admission and are eligible for tuition grants."}, {"url": "https://libraries.smith.edu/about/history-smith-college-libraries", "page_content": "William Allan Neilson Library\n\nFrom 1875 to 1909, Smith College relied primarily on the private Clarke Library and the public Forbes Library (dedicated in 1894). The first college reference library was formed with a $4,000 allocation in 1878 and housed in various rooms in College Hall; it was moved to Seelye Hall when that building opened in 1900.\n\nThe core of the present main building was erected in 1909, funded by a gift from Andrew Carnegie and matching gifts from alumnae and friends. It was enlarged in 1937 and, in 1946, named the William Allan Neilson Library in honor of the College's third president. In 1962, two wings were added and extensive interior rearrangements made. The last major expansion and renovation began in 1978 and was completed with the rededication of Neilson Library in November 1982 and of the converted Alumnae Gymnasium in May 1983.\n\nIn the fall of 1987, the libraries acquired their millionth volume. This watershed was celebrated by the acquisition of the Epistole Devotissime of St. Catherine of Siena in an Aldine edition of 1500 to be designated officially as volume 1,000,000. The Smith College Libraries now hold over 1.4 million items including books, periodicals, microforms, maps, scores, recordings, manuscripts, archives, film and video, computer-readable materials, graphic arts, memorabilia and cuneiform tablets.\n\nIn 2010, the college engaged Shepley Bulfinch to partner on a master plan for all of the college’s libraries. Soon after, the college worked with Shepley Bulfinch on several studies to assess what could feasibly be accomplished with current library space. In 2014, the trustees approved the concept of a redesign of Neilson and the hiring of an architect. Construction for the project began in 2017 and the new Neilson Library opened on March 29, 2021. It retains the original 1909 building while restoring the campus flow disrupted by a series of later additions. Learn more about the New Neilson Library renovation project.\n\nBranch Libraries\n\nWerner Josten Performing Arts Library\n\nThe Music Department began its collection in 1911 and hired the first music librarian in 1922. The library was transferred administratively to the college Libraries in 1968. That same year it was moved to new quarters in the Mendenhall Performing Arts Center and named for Werner Josten (a professor in the Music Department).\n\nYoung Science Library\n\nStarted in 1888, the science department libraries originally included Chemistry in Stoddard Hall, Physics in Lilly Hall, Geology in Seelye Hall, Botany, Zoology and Bacteriology in Burton Hall. Other collections, now merged with the Neilson Library or Science Library collections, were located in Scott Gymnasium (Physical Education) and the Plant House (Horticulture). In 1937, some thought was given to starting a psychology library in Pierce Hall, but the plan was never realized.\n\nThe science libraries were consolidated and became part of the Smith College Libraries in 1965 when they were moved into the Science Library in Sabin-Reed Hall. In 1991, the Science Library moved to Bass Hall and was named the Anita O'K. and Robert R. Young Science Library. In December 2016, Young Science Library was closed so that the building could be used as the main campus library (the Young Library) during the construction of the New Neilson Library (2017-2021). Materials from Young Library were moved to Neilson Library and the Young Library closed in 2021.\n\nHillyer Art Library\n\nThe Art Department started a collection of books and other materials as early as 1876. The Hillyer library was transferred administratively from the Art Department to the college Libraries in 1968.\n\nThe Hillyer Art Library, after a few years in Stoddard Hall during the construction of the new Fine Arts Center, occupied its present facility in 1972.\n\nDuring the renovation of the Fine Arts Center from 2000 to 2002, art library collections were divided between temporary art library facilities in Bell Hall at the Clarke School for the Deaf and the Smith College Libraries storage facility at 126 West Street. With reconstruction of the Brown Fine Arts Center complete, Hillyer Art Library reopened its new facilities in August 2002.\n\nSpecial Collections\n\nMortimer Rare Book Collection\n\nAs a part of the 1962 addition to the Neilson Library, the paneled Rare Book Room was created with its own secure stacks.\n\nThe collection of rare books had been started by its first curator, Marion Brown, sometime in the early 1940s with items culled from the general collection. In January 1994 the Board of Trustees voted to name it the Mortimer Rare Book Room, in honor of Ruth Mortimer Lancaster '53, curator and assistant librarian since 1975. Following her death on January 31, 1994, the room was dedicated in April of 1994 amidst an outpouring of special funds and gifts. In summer 2017 the Mortimer Rare Book Room, together with the rest of the Smith College Special Collections, was temporarily relocated to the Young Library in order to make way for the construction of the New Neilson Library (2017-2021). The Mortimer Rare Book Collection moved to its permanent home in Neilson Library in 2021.\n\nView a history of the Mortimer Rare Book Room, written by Barbara Blumenthal '75, who was the Rare Book Specialist from 1993-2017.\n\nSmith College Archives & the Sophia Smith Collection\n\nThe College formally established the Smith College Archives in 1921 when, after years of unofficial collecting, Nina Browne, class of 1882, was appointed archivist of the College.\n\nThe Sophia Smith Collection, one of the two principal repositories for primary sources in U.S. women's history, was founded in 1942 by the Friends of the Libraries.\n\nThese collections were administratively separate from the College Library until 1984, when they became library departments. From the 1960's, they occupied space in Neilson Library, and in 1982 moved to the renovated and now-adjoining Alumnae Gymnasium. In summer 2017 the Sophia Smith Collection and College Archives, together with the Mortimer Rare Book Room, were temporarily relocated to the Young Library in order to make way for the construction of the New Neilson Library (2017-2021). Both the College Archives and Sophia Smith Collection moved to their permanent home in Neilson Library in 2021.\n\nEarly Automation and Library Practice\n\nDuring the first seventy-two years of its existence, the Library used its own adaptation of the Dewey Decimal classification to organize its collections. As these collections grew larger and more complex, the numbering became long and difficult to interpret. In July 1971 it was decided to abandon decimal classification and use the Library of Congress classification. The Mortimer Rare Book Room decided to continue use of the decimal classification for that collection until 1996 when it adopted the Library of Congress classification system. A local system was devised for classifying Smith College theses by teaching departments, and government documents were classed by GPO and UN numbers.\n\nThe Smith College Libraries' first automation efforts were in 1974 when the department joined the New England Library Information Network (NELINET). Participation in NELINET provided the Libraries access via interactive terminals to the international shared bibliographic data of OCLC, Inc. New techniques for both cataloging and interlibrary loans were introduced. By 1981, all of the Five College libraries signed a contract with OCLC to develop a local integrated library system with union catalog, acquisitions, serials control, cataloging and circulation components. In 1985, all five libraries began using the LS2000 system for cataloging. The Circulation department in the Neilson Library started using the system for loans in January 1988. The card catalogue in the Neilson Library was frozen (left in place but no longer maintained) in July 1988, with Online Public Access Catalog (OPAC) terminals replacing it. The Young Science Library automated its circulation through LS2000 in 1990. Also that year, the Smith College Libraries purchased a stand-alone automated serials and acquisitions system from Innovative Interfaces, Inc.\n\nIn 1992, given various ongoing difficulties with the LS2000 system, the Five College libraries began planning for a replacement system; administrators and computing staffs from each campus were involved. In 1993, a contract was signed with Innovative Interfaces, Inc., and in early 1994 the Five College Online Library System was brought up with all campuses employing modules for circulation, public access, and cataloging. Serials and acquisitions were added to the system that spring and Smith folded in its stand-alone operation. This was the first library automated system for Smith and the Five Colleges that integrated all functions across campuses, and the first time that all Smith's branch libraries are automated for circulation, reserves and serials management.\n\nIn 1992, with funding from the Keck and Davis foundations, a LAN-based system of locally mounted CD-ROM databases was brought up at Smith in the Young and Neilson Libraries. The following year, Neilson was completely rewired for computer networking; in 1994 when Innovative Interfaces was launched, the Libraries moved all administrative computing to a networked file-server configuration. Access to e-mail, word processing, and library systems and databases was combined and extended. In the fall of 1994, the CD-ROM network was expanded, and a new menu interface introduced on public-access computers. Entitled the \"Smith Libraries Gateway,\" the menu provided a single-point of access to the OPAC, the CD-ROM network, licensed databases and Internet resources. The libraries and the Information Systems Department began active collaboration in designing menu interfaces and in training faculty and students in the use of the Internet.\n\nThe “Electronic Classroom,” located on Level 1 of the Neilson Library, opened in February 2000. The room contained twenty student and one instructor computers, a printers and projection and accommodated classes of up to forty students. The primary purpose of this classroom was to offer library instruction to classes. When not in use for classes, the room was used for student study and other activities requiring computers.\n\nAlumnae Gymnasium\n\nIn 1890, the Alumnae Gymnasium (Alumnae Gym) was built using funds raised by the Alumnae Association. The building of the Gymnasium was the association’s first major achievement and continues to be a visual testament of alumnae devotion.\n\nAlumnae Gymnasium is the work of distinguished architect William C. Brocklesby. The prominent feature in the central bay of the gymnasium - the rusticated round-headed arch - as well as the broad planes of the roofs and the central tower all show the responsive nature of Brocklesby to the Romanesque Revival style of Henry Hobson Richardson, a powerful influence on the American architecture during the 19th century.\n\nIn 1924, Alumnae Gymnasium became an adjunct to the new Scott Gymnasium after it was over-burdened by the increased number of sports and activities that followed the College’s expansion. Alumnae Gym was a space for individual sports and recreation, parties and celebrations. It was also used as a theater when the Students’ Building was demolished to make way for the Science Center.\n\nIn 1974-1975, a plan was made to demolish Alumnae Gymnasium due to a proposed expansion made to the Neilson Library, but this plan failed to be realized due to mounting Alumnae protests. An alternative plan was made to incorporate the old building into the new part of the Neilson Library, and an Alumnae rallied to raise money. Alumnae Gym was adapted to become a center for the most advanced techniques in library service as well as house the College Archives and the Sophia Smith Collection.\n\nIn 1984, the Nonprint Resources Center (NPRC) was opened in the lower level of the Alumnae Gymnasium and its first Director was appointed in 1987. In 1991, the former Electronics Department of the College was incorporated into the NPRC. In 1999, the NPRC split from the Libraries and became an administrative unit of Information Technology Services called Media Services. At that time, the collection of videotapes, films and other media materials became a unit of the Public Services Division of the Libraries. In 2001, the nonprint materials were moved to the circulation department of Neilson Library. In 2005, the Center was renamed the Center for Media Production (CMP) under the auspices of Educational Technology Services, a unit of Information Technology Services. In 2017, the Center for Media Production relocated to the Henshaw Complex to make way for the construction of the New Neilson Library (2017-2021).\n\nIn May 2017, Alumnae Gymnasium closed for renovation, with the College Archives and the Sophia Smith Collection moving temporarily to the Young Library, and then permanently to the renovated Neilson Library in 2021. The Alumnae Gym renovation was also concluded in 2021, and now houses additional Smith College Libraries spaces, services, and staff.\n\nNonprint Resources\n\nThe Nonprint Resources Center (NPRC) was opened in 1984 in the lower level of the Alumnae Gym and its first Director appointed in 1987. In 1991, the former Electronics Department of the College was incorporated into the NPRC. In 1999 the Center split from the Libraries and became an administrative unit of Information Technology Services called Media Services. At that time, the collection of videotapes, films and other media materials became a unit of the Public Services Division of the Libraries. In 2001, the nonprint materials were moved to the circulation department of Neilson Library. In 2005 the Center was renamed the Center for Media Production (CMP) under the auspices of Educational Technology Services, a unit of Information Technology Services. In 2017 the Center for Media Production relocated to the Henshaw Complex to make way for the construction of the new Neilson Library (2017-2021).\n\nClarke School for the Deaf\n\nSmith College and the Clarke School for the Deaf jointly maintain on the Clarke campus, the Rogers Hall Professional Library which was renovated and enlarged in 1977. Holdings of this library are now integrated into the Smith College Libraries' online catalog and the staffs of the libraries cooperate to facilitate cataloging, acquisitions and other services. The Library at 47 Round Hill Rd. was closed in June 2012. Materials were transferred to the Smith libraries collections.\n\nFive College Consortium\n\nIn 1951 Smith joined the University of Massachusetts, Amherst College and Mount Holyoke College to form the Hampshire Inter-Library Center (HILC). This consortium was the first instance of cooperation among the four schools (and one of the earliest library consortia in the United States). The Center was intended as a depository for less frequently used research materials, primarily serials and large sets, from the collections of the four libraries and jointly owned by all four. Hampshire College, which opened in 1970, joined HILC as its fifth member. HILC later came under the administrative umbrella of Five Colleges, Inc., and its collections were distributed among the member libraries.\n\nToday Five Colleges, Inc. is a nonprofit educational consortium to promote the broad educational and cultural objectives of its member institutions. The Dean of Smith College Libraries is part of the Five College Librarians Council and a series of staff committees facilitates communication and collaboration.\n\nKahn Institute\n\nIn September 2000, The Louise W. and Edmund J. Kahn Liberal Arts Institute occupied permanent quarters on the third floor, south wing, of Neilson Library. Developed during the college's 1997 self study, the Kahn Institute provides a setting--outside the curriculum but creatively linked to it--in which faculty, together with students and visiting scholars, writers and performers, work together intensively on projects of broad scope. In 2017 the Kahn Institute relocated to 21 Henshaw Avenue to make way for the construction of the new Neilson Library (2017-2021).\n\nOnline Exhibitions"}]}