{"William Allan Neilson was a professor of English literature at Harvard.": [{"url": "https://www.encyclopedia.com/reference/encyclopedias-almanacs-transcripts-and-maps/neilson-william-allan", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://www.goodreads.com/author/show/1022290.William_Allan_Neilson", "page_content": "William Allan Neilson\n\nBorn\n\nWilliam Allan Neilson (28 March 1869 – 1946) was a Scottish-American educator, writer and lexicographer, graduated in the University of Edinburgh in 1891 and became a Ph.D. in Harvard University in 1898. He was president of Smith College between 1917 and 1939.\n\n\n\nNeilson was born in Doune, Scotland and he emigrated to the United States in 1895, being naturalised 3 August 1905. He taught at Bryn Mawr College from 1898 to 1900, Harvard from 1900 to 1904, Columbia from 1904 to 1906, and Harvard again from 1906 to 1917. Neilson was author of a number of critical works on William Shakespeare, Robert Burns and the Elizabethan theatre, editor of the Cambridge and Tudor editions of Shakespeare (1906, 1911) and editor of Webster's New International Dict\n\nWilliam Allan Neilson (28 March 1869 – 1946) was a Scottish-American educator, writer and lexicographer, graduated in the University of Edinburgh in 1891 and became a Ph.D. in Harvard University in 1898. He was president of Smith College between 1917 and 1939.\n\n\n\nNeilson was born in Doune, Scotland and he emigrated to the United States in 1895, being naturalised 3 August 1905. He taught at Bryn Mawr College from 1898 to 1900, Harvard from 1900 to 1904, Columbia from 1904 to 1906, and Harvard again from 1906 to 1917. Neilson was author of a number of critical works on William Shakespeare, Robert Burns and the Elizabethan theatre, editor of the Cambridge and Tudor editions of Shakespeare (1906, 1911) and editor of Webster's New International Dictionary, Second Edition (1934). Less known is his translation of the famous late 14th century Middle English alliterative chivalric romance Sir Gawain and the Green Knight.\n\n\n\n- Wikipedia"}, {"url": "https://blogs.smith.edu/blog/smithipedia/administration/president-william-allan-neilson/", "page_content": "President William Allan Neilson\n\nPresident William Allan Neilson\n\nWilliam Allan Neilson was born March 28, 1869, in Doune, Pertshire Scotland. He attended Edinburgh University where he studied philosophy, graduating with honors in 1891. In order to join his brother who emigrated to Canada, Neilson crossed the Atlantic and began teaching in Upper Canada College in Toronto which was a boarding school for young boys.\n\nDeciding that he would prefer to be a scholar than a school master, Neilson went on to Harvard Graduate School in Cambridge, MA where he received his Ph.D. in English in 1898. Upon receiving his Ph.D., Neilson accepted a position as an Associate in English Literature at Bryn Mawr College in Bryn Mawr, PA. Neilson taught at many other fine institutions before settling into the work of an administrator. Harvard, Radcliffe, the Sorbonne, Columbia, Barnard, and the University of California all made use of Neilson’s talents at one time or another.\n\nIt was during his years as a professor that Neilson distinguished himself as the sort of scholar that an academic institution would wish to guide it. Before coming to Smith, Neilson made a name for himself both as a professor devoted to his students’ learning (he was the only instructor of Helen Keller’s who learned the manual sign language she used for communication) but also as a writer and an editor. Among his writings were Essentials of Poetry (1912) and The Facts about Shakespeare (1913). He also was the editor of Milton’s Minor Poems (1899) and Shakespeare’s Complete Works (1906). In 1917, Neilson was offered the Presidency of Smith College. He accepted on the conditions that he would not be obligated to raise money, and that a president’s house would be built, with which the trustees complied.\n\nWhen Neilson arrived at Smith in 1917 perhaps one of the best assets that Neilson brought to Smith was his quick wit that endeared him to student, staff, faculty, and alumnae alike. At Neilson’s final commencement in 1939 Cynthia Walsh recalled one particular instance: The seniors will especially recall that on May Day when they went to serenade him, his new collie puppy began to bark, not realizing what sweet voices were vying with the birds so early in the morning. When the president stepped out he said, “My dog thinks you’re sheep,” and the volleys of laughter which greeted this remark quite drowned out the rest: ”-but I think you’re lambs!”\n\nNeilson’s accomplishments at Smith were many. When Neilson noticed that a majority of Smith students lived off campus he set about the task of purchasing and building new residences so that all Smith students would live on campus. After building the Great Quadrangle, purchasing Chapin House, Talbot House, Sessions House, and many others his goal was completed. During Neilson’s 22-year term as president, the campus also saw the additions of Sage Music Hall, Scott Gymnasium, Tryon Art Gallery, the Alumnae House, the Infirmary, and the President’s house.\n\nNeilson also established the Junior Year in France, Junior Year in Italy, and the Junior Year in Spain Programs. Special Honors, the Smith College Day School, and the School for Social Work were additions that Neilson made to the college. Never one to rest on his laurels, Neilson continued writing and editing while looking after the well being of 2,000 students. In 1920 he wrote History of English Literature and in 1922 he edited Roads to Knowledge. He also was the editor-in-chief of Webster’s New International Dictionary, 2nd edition, 1934.\n\nWilliam A. Neilson died on February 13, 1946.\n\nFor further information please see: http://asteria.fivecolleges.edu/findaids/smitharchives/manosca13.html\n\nThorp, Margaret Farrand, Neilson of Smith (NY: Oxford University Press), 1956"}, {"url": "https://prabook.com/web/william.neilson/1746853", "page_content": "William Neilson\n\neducator\n\nMarch 28, 1869 (age 76) Doune, Perthshire, Scotland\n\nAt his father's death, when William was eleven, he became a monitor in the school, and at thirteen, a pupil teacher. He worked at the University Settlement, teaching the poor of Edinburgh's slums. In 1891 Neilson immigrated with his family to Canada, where his brother had settled. After brief periods of teaching at Bryn Mawr College (1898 - 1900), Harvard (1900 - 1904), and Columbia (1904 - 1906), he was in 1906 appointed professor of English at Harvard, where he remained until 1917, when he accepted the presidency of Smith College. In 1904 he spent the summer in Offenburg in the family of Oskar Muser, a lawyer and member of the Landtag of the Duchy of Baden. Neilson became an American citizen in 1905. At Harvard, Neilson won distinction as both teacher and scholar. He taught Chaucer, Shakespeare and other Elizabethan dramatists, Milton, and various nineteenth-century authors. He joined President Charles W. Eliot as associate editor of the Harvard Classics (the 50-volume \"Five-Foot Bookshelf, \" 1909-1910), writing the notes and introductions. His edition of Shakespeare's Complete Dramatic and Poetic Works, revised with Prof. Charles J. Hill in 1942, is a standard and important one. During his career at Smith, he served as editor-in-chief of the second edition of Webster's New International Dictionary, which appeared in 1934. Neilson hesitated for some time before accepting the Smith presidency. His two predecessors, L. Clark Seelye and Marion Le Roy Burton, had both been clergymen. Neilson had no desire to increase the size of the student body of Smith, fixed at 2, 000. He was, however, determined to provide college residences for all students, many of whom were living in private dormitories, a practice felt to be undemocratic. In the course of adding ten new dormitories he greatly enlarged the physical college and built two brick quadrangles on a tract adjacent to the old campus, which preserved the college's tradition of small dormitory units. He beautified the campus by planting and landscaping. In spite of his insistence that fund raising was not his province, Neilson not only balanced the budget, even during the depression, but through his great personal popularity brought sizable gifts to the college that significantly increased the endowment. He maintained a balanced faculty of men and women. Himself a teacher during the early years of his presidency, he brought to Smith many distinguished scholars and teachers from abroad as well as from the United States, with the result that he left the college well on a par with leading universities. He won the respect and loyalty of the faculty for his fairmindedness and devotion to academic freedom. Always a fighter for liberal causes, Neilson was violently opposed by the local community and by some of the Smith faculty for his defense of Nicola Sacco and Bartolomeo Vanzetti. His compassion for the victims of Nazism led him to become a director of the National Refugee Service and co-chairman of the Committee for the Protection of the Foreign Born. As the national and international situation grew more tense through the 1930's, he devoted his Monday chapel talks to attempts to make students more aware of the issues in national and international affairs. After his retirement in 1939, Neilson settled in Falls Village, Connecticut, where he had bought a remodeled farmhouse. He continued to spend part of the winters in Northampton, working on a history of Smith College, and he died there in 1946 of a coronary thrombosis. His ashes were buried on the Smith campus, appropriately in the midst of a natural garden he had planned on a hillside."}, {"url": "https://snaccooperative.org/view/25680249", "page_content": "Educator, editor and author. President of Smith College, 1917-1939; editor of Webster's New International Dictionary 2nd edition; author of \"Essentials of poetry\" and \"Facts about Shakespeare.\"\n\nFrom the description of Letters of W.A. Neilson, 1907-1917. (University of Virginia). WorldCat record id: 76968306\n\nSmith College President (3rd), 1917-1939. Ph. D., Harvard, 1898. Prof. of English at Bryn Mawr, Harvard, the Sorbonne and Columbia.\n\nFrom the description of William Allan Neilson personal papers, 1852-1946. (Smith College). WorldCat record id: 51171634\n\nNeilson graduated from Harvard in 1896 and taught English at Harvard.\n\nFrom the description of Papers of William Allan Neilson, 1912. (Harvard University). WorldCat record id: 76973143\n\nSmith College President (3rd), 1917-1939.\n\nFrom the description of Office of the President William Allan Neilson files, 1917-1939. (Smith College). WorldCat record id: 51231676\n\nWilliam Allan Neilson was born March 28, 1869, in Doune, Pertshire Scotland. He attended Edinburgh University where he studied philosophy, graduating with honors in 1891. In order to join his brother who emigrated to Canada, Neilson crossed the Atlantic and began teaching in Upper Canada College in Toronto which was a boarding school for young boys.\n\nDeciding that he would prefer to be a scholar than a school master, Neilson went on to Harvard Graduate School in Cambridge, MA where he received his Ph.D. in English in 1898. Upon receiving his Ph.D., Neilson accepted a position as an Associate in English Literature at Bryn Mawr College in Bryn Mawr, PA. Neilson taught at many other fine institutions before settling into the work of an administrator. Harvard, Radcliffe, the Sorbonne, Columbia, Barnard, and the University of California all made use of Neilson's talents at one time or another.\n\nIt was during his years as a professor that Neilson distinguished himself as the sort of scholar that an academic institution would wish to guide it. Before coming to Smith, Neilson made a name for himself both as a professor devoted to his students' learning (he was the only instructor of Helen Keller's who learned the manual sign language she used for communication) but also as a writer and an editor. Among his writings were Essentials of Poetry (1912)and The Facts about Shakespeare (1913). He also was the editor of Milton's Minor Poems (1899) and Shakespeare's Complete Works (1906).\n\nIn 1917, Neilson was offered the Presidency of Smith College. He accepted on the conditions that he would not be obligated to raise money, and that a president's house would be built, with which the trustees complied.\n\nPerhaps one of the best assets that Neilson brought to Smith was his quick wit that endeared him to student, staff, faculty, and alumnae alike. At Neilson's final commencement in 1939 Cynthia Walsh recalled one particular instance:\n\nThe seniors will especially recall that on May Day when they went to serenade him, his new collie puppy began to bark, not realizing what sweet voices were vying with the birds so early in the morning. When the president stepped out he said, \"My dog thinks you're sheep,\" and the volleys of laughter which greeted this remark quite drowned out the rest: \"-but I think you're lambs!\"\n\nNeilson's accomplishments at Smith were many. When Neilson noticed that a majority of Smith students lived off campus he set about the task of purchasing and building new residences so that all Smith students would live on campus. After building the Great Quadrangle, purchasing Chapin House, Talbot House, Sessions House, and many others his goal was completed. During Neilson's 22-year term as president, the campus also saw the additions of Sage Music Hall, Scott Gymnasium, Tryon Art Gallery, the Alumnae House, the Infirmary, and the President's house.\n\nNeilson also established the Junior Year in France, Junior Year in Italy, and the Junior Year in Spain Programs. Special Honors, the Smith College Day School, and the School for Social Work were additions that Neilson made to the college.\n\nNever one to rest on his laurels, Neilson continued writing and editing while looking after the well being of 2,000 students. In 1920 he wrote History of English Literature and in 1922 he edited Roads to Knowledge. He also was the editor-in-chief of Webster's New International Dictionary, 2nd edition, 1934.\n\nFrom the guide to the Office of President William Allan Neilson Files RG 32., 1917-1939, (Smith College Archives)\n\n: Born in Doune, Perthshire, Scotland, March 28\n\n: Attended Montrose Academy\n\n: Studied at the University of Edinburgh, received M.A.\n\n: Immigrated with family to Canada\n\n: Resident English Master, Upper Canada College, Toronto\n\n: Graduate work in English, Harvard University, M.A. (1897), Ph.D. (1898)\n\n: Associate Professor of English Literature, Bryn Mawr College\n\n: Instructor of English, Harvard University\n\n: Professor of English, Columbia University\n\n: Became American citizen\n\n: Professor of English, Harvard University\n\n: Married Elisabeth Muser in Offenburg, Germany, June 25\n\n: Exchange Professor, University of Paris\n\n: President of Smith College\n\n: Trustee, Carnegie Foundation for the Advancement of Education Served intermittently on the College Entrance Examination Board\n\n: Initiated Special Honors program at Smith College\n\n: President, Modern Language Association\n\n: Editorial Board of G.C. Merriam and Company\n\n: Started Junior Year Abroad program at Smith College\n\n: Advisory Council, the Open Road, Inc.\n\n: Board of Directors, National Association for the Advancement of Colored People\n\n: Board of Directors, National Refugee Service\n\n: Chair, Executive Committee, Commission to Study the Organization of Peace\n\n: Presided over the International Student Service Summer Student Leadership Institute at Campobello, New Brunswick\n\n: Board of Overseers, Harvard University\n\n: Chair,\n\n: Died in Northampton, Massachusetts, February 13\n\nFrom the guide to the William Allan Neilson Personal Papers RG 32 ., 1852-1946, (Smith College Archives)"}, {"url": "https://findingaids.smith.edu/repositories/4/resources/35", "page_content": "William Allan Neilson served as president of Smithh College for 22 years. Born March 28, 1869, in Doune, Pertshire Scotland, he attended Edinburgh University where he studied philosophy, graduating with honors in 1891. In order to join his brother who emigrated to Canada, Neilson crossed the Atlantic and began teaching in Upper Canada College in Toronto which was a boarding school for young boys.\n\n\n\nDeciding that he would prefer to be a scholar than a school master, Neilson went on to Harvard Graduate School in Cambridge, MA where he received his Ph.D. in English in 1898. Upon receiving his Ph.D., Neilson accepted a position as an Associate in English Literature at Bryn Mawr College in Bryn Mawr, PA. Neilson taught at many other fine institutions before settling into the work of an administrator. Harvard, Radcliffe, the Sorbonne, Columbia, Barnard, and the University of California all made use of Neilson's talents at one time or another.\n\n\n\nIt was during his years as a professor that Neilson distinguished himself as the sort of scholar that an academic institution would wish to guide it. Before coming to Smith, Neilson made a name for himself as a professor devoted to his students' learning. He was the only instructor of Helen Keller's who learned the manual sign language she used for communication. He was also an accomplished writer and editor. Among his writings were Essentials of Poetry (1912)and The Facts about Shakespeare (1913). He also was the editor of Milton's Minor Poems (1899) and Shakespeare's Complete Works (1906).\n\n\n\nIn 1917, Neilson was offered the Presidency of Smith College. He accepted on the conditions that he would not be obligated to raise money, and that a president's house would be built, conditions the trustees complied with.\n\n\n\nNeilson's quick wit that endeared him to student, staff, faculty, and alumnae. At Neilson's final commencement in 1939 Cynthia Walsh recalled one particular instance:\n\n\n\nThe seniors will especially recall that on May Day when they went to serenade him, his new collie puppy began to bark, not realizing what sweet voices were vying with the birds so early in the morning. When the president stepped out he said, \"My dog thinks you're sheep,\" and the volleys of laughter which greeted this remark quite drowned out the rest: \"-but I think you're lambs!\"\n\n\n\nNeilson's accomplishments included purchasing and building new residences so that all Smith students would live on campus. He was responsible for the building of the Great Quadrangle, purchasing Chapin House, Talbot House, Sessions House, and many others. During Neilson's 22-year term as president, the campus also saw the additions of Sage Music Hall, Scott Gymnasium, Tryon Art Gallery, the Alumnae House, the Infirmary, and the President's house.\n\n\n\nNeilson also established the Junior Year in France, Junior Year in Italy, and the Junior Year in Spain Programs. Special Honors, the Smith College Day School, and the School for Social Work were additions that Neilson made to the college.\n\n\n\nNeilson continued writing and editing while looking after the well being of 2,000 students. In 1920 he wrote History of English Literature and in 1922 he edited Roads to Knowledge. He also was the editor-in-chief of Webster's New International Dictionary, 2nd edition, 1934."}, {"url": "https://findingaids.smith.edu/repositories/4/resources/25", "page_content": "The William Allan Neilson Papers consist of 21.75 linear feet of correspondence, newspaper clippings, manuscripts, press releases, lecture notes, texts of speeches, photographs, and miscellaneous papers which document Neilson's life and career. While these papers contain material dating from Neilson's years at Smith College (1917-1939), his official correspondence as president of the college is stored separately in the College Archives' holdings of records of the Office of the President.\n\n\n\nThe papers document Neilson's personal life with extensive family material. His letters to his brother and sisters are particularly valuable. Among other things these letters present Neilson's view of life at Bryn Mawr College under M. Carey Thomas, his strong opinions on world politics, his experiences tutoring Helen Keller at Radcliffe College, and his first impressions of Smith College. This series of letters is especially strong for the years between Neilson's arrival at Harvard University for graduate study in 1895 and his marriage in 1905. In addition to the Neilson family correspondence there is extensive correspondence between the Neilson and Muser families plus diaries and writings of Elisabeth Muser Neilson, her parents, and her sister. Much of the Muser family material is in German.\n\n\n\nOther personal material such as photographs, correspondence, class notes, and student essays document Neilson's youth and education. His love of his native Scotland and his study of its language and literature are clearly in evidence in his University of Edinburgh essays.\n\n\n\nCorrespondence and miscellaneous papers, 1917-1946, document such day-to-day concerns as finances, family health, the running of the household, and travel arrangements.\n\n\n\nNeilson's career as professor and scholar of English and Scottish literature is represented by class notes and correspondence with students and colleagues which date primarily from his years at Harvard and Radcliffe. Smith College material includes a few notes for courses Neilson taught in the English department but consists primarily of documentation of the events and celebrations of his presidency such as his appointment, inauguration, tenth and twentieth anniversaries, and retirement. Other material documents Neilson's affiliation with scholarly organizations such as the Modern Language Association, the Scottish Text Society, and the Shakespeare Association of America. There are also texts and notes for speeches on Shakespeare and Burns. Neilson's scholarly publications are represented by a number of articles, an unfinished manuscript for a book on allegory, and proofs for a 1942 edition of Shakespeare's plays and poems. Correspondence and news clippings document other writing and editorial projects in different stages of the work. Two such projects of particular interest are the 'five foot shelf' series of Harvard Classics, which Neilson edited with Charles W. Eliot, and the second edition of Webster's New International Dictionary, for which Neilson was editor-in-chief.\n\n\n\nIn addition to his work as professor, administrator, and scholar, Neilson was much in demand for committee work. As a respected educator and administrator, his advice and support was continually sought by educational institutions and organizations. Correspondence documents Neilson's work as a member of various committees for Harvard University, his suggestions on the planning of the campus and curriculum of Bennington College, and his advice and endorsements for the New School for Social Research and a variety of organizations promoting adult education such as the Affiliated Schools for Workers, the Eliot Foundation for Adult Education, and the Committee on University Extension in the Connecticut Valley.\n\n\n\nNeilson was also well-known for his vigorous support of liberal causes of the day. His political activities are reflected in his involvement with a large number of organizations most of which worked for civil liberties, peace, aid to refugees, or improved foreign relations. This work is documented by correspondence with such organizations as the American Civil Liberties Union, the Foreign Policy Association, the American Society for Cultural Relations with Russia, the National Refugee Service, various League of Nations organizations, and the Commission to Study the Organization of Peace.\n\n\n\nAll of Neilson's interests and concerns are in evidence in his speeches and writings. Texts contained in the papers are a rich source for the study of life at Smith College, and trends in education and politics during Neilson's term as president of Smith (1917-1939). News clippings document the quite considerable attention paid to his views.\n\n\n\nNeilson was a renowned speaker who seldom prepared a text, preferring to talk from cursory notes made shortly before the speech was to be delivered. Because of this process the texts contained in the papers are almost exclusively transcriptions. Some of them were edited for publication, others remain more or less as they were delivered. The papers also contain some of Neilson's handwritten notes for speeches.\n\n\n\nCorrespondence, citations, and news clippings document Neilson's many awards and honors and a group of biographical articles gives an overview of Neilson's life and work. The papers also contain notes, typescripts, and correspondence for Margaret Farrand Thorp's 1956 biography Nelson of Smith."}, {"url": "https://books.google.com/books/about/A_History_of_English_Literature.html?id=0186jgEACAAJ", "page_content": "William Allan Neilson Creative Media Partners, LLC , 11 Aug 2015 - 64 pages 0 Reviews Reviews aren't verified, but Google checks for and removes fake content when it's identified\n\nThis work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most important libraries around the world), and other notations in the work.\n\n\n\nThis work is in the public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work.\n\n\n\nAs a reproduction of a historical artifact, this work may contain missing or blurred pages, poor pictures, errant marks, etc. Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant.\n\n\n\n"}, {"url": "https://www.infoplease.com/encyclopedia/people/social-science/education/neilson-william-allan", "page_content": "See M. F. Thorp, Neilson of Smith (1956).\n\n, 1869–1946, American educator, b. Scotland, M.A. Univ. of Edinburgh, 1891, Ph.D. Harvard, 1898. He taught English in Scotland and Canada and at Bryn Mawr and Columbia and served (1906–17) as professor of English at Harvard. From 1917 until his retirement in 1939 he was president of Smith. He was author of a number of critical works, editor of the Cambridge and Tudor editions of Shakespeare (1906, 1911), and editor in chief of the second edition (1934) of\n\nThe Columbia Electronic Encyclopedia, 6th ed. Copyright © 2023, Columbia University Press. All rights reserved.\n\nSee more Encyclopedia articles on: Education: Biographies"}, {"url": "https://encyclopedia2.thefreedictionary.com/Neilson%2c+William+Allan", "page_content": "Neilson, William Allan\n\nNeilson, William Allan (nēlˈsən) , 1869–1946, American educator, b. Scotland, M.A. Univ. of Edinburgh, 1891, Ph.D. Harvard, 1898. He taught English in Scotland and Canada and at Bryn Mawr and Columbia and served (1906–17) as professor of English at Harvard. From 1917 until his retirement in 1939 he was president of Smith. He was author of a number of critical works, editor of the Cambridge and Tudor editions of Shakespeare (1906, 1911), and editor in chief of the second edition (1934) of Webster's New International Dictionary.\n\nBibliography\n\nSee M. F. Thorp, Neilson of Smith (1956).\n\nThe Columbia Electronic Encyclopedia™ Copyright © 2022, Columbia University Press. Licensed from Columbia University Press. All rights reserved."}]}