{"Elisha Brown Jr. (1776-1852) was an American farmer, soldier, and politician from Rhode Island.": [{"url": "https://www.daysoftheyear.com/days/cheeseball-day/", "page_content": "Quick facts When is it? Every Tagged as Cheese\n\nFood & Drink Have we missed something?\n\nThey can be found in the supermarket, they are often a common appearance during the holidays, and if you’re like many people, you may be wondering precisely what purpose they serve?! That’s right, this is all about that mysterious, delicious party food called the Cheeseball!\n\nFor those who are considering just how many occasions really call for a bit of cheddar cheese rolled in roasted almond slices, the people who support National Cheeseball Day believe that the answer is ALL of them!\n\nAlso, don’t forget that cheeseballs can also be those little, round, shockingly orange corn puffs that are covered with powdered cheese! Definitely a younger person’s idea of what a cheese ball is, this is still a legitimate snack to appreciate.\n\nWhichever style is chosen or preferred, National Cheeseball Day celebrates these odd little culinary mainstays and encourages everyone to explore the history behind them and how they came to be what they are today.\n\nWho knows? National Cheeseball Day may even find a lot of unlikely people creating their own cheeseballs and adding them to their regular fare!\n\nHistory of National Cheeseball Day\n\nThe background of National Cheeseball Day starts at an unusual point in history–when the first cheese ball appeared at, perhaps one of the most unexpected of places, the White House.\n\nIn the early 1800s, there was a farmer by the name of Elisha Brown, Jr. who was seeking to present an unusual gift to then President of the United States, Thomas Jefferson. So it was this desire that allowed an unbelievably massive ball of cheese to wind up on the White House lawn.\n\nHow massive? 1,235 pounds to be exact! Now that is a huge ball of cheese. It’s a little wonder that it eventually became known as “The Mammoth Cheese”.\n\nFrom that point, the cheese ball seemed to have disappeared into culinary history for nearly 150 years. It then had the good fortune to resurface in 1944 in a book by Virginia Safford called Food of My Friends. In this book, a recipe was included for the Cheese Ball, and it wasn’t long after that it found itself a staple of cuisine.\n\nCan it truly be considered a cuisine, though? Well, that description does seem to require that there is more than one variation, doesn’t it? And the experience of most people, is that they have probably only seen the variety that’s rolled in toasted almonds. Believe it or not, though, there are hundreds of varieties of cheese balls available for every imaginable occasion!\n\nCheeseballs can be made of almost any kind of cheese, and then rolled in almost anything that can be imagined! Perhaps there isn’t even an “almost” to be said here. Some people have made cheese balls rolled in crushed Oreos, sparkly confetti topping, diced onions, peppers and garlic.\n\nAnything that goes well with cheese (and perhaps a few things, like Oreos, that wouldn’t normally be thought of as ‘good with cheese’?) can be repurposed into the coating for a cheese ball.\n\nGetting creative and exploring new tastes, while also offering a nod to the classics, is what Cheese Ball Day is all about!\n\nHow to Celebrate National Cheeseball Day\n\nCelebrating National Cheeseball Day means not only eating cheeseballs, but also enjoying other ‘cheesy’ things as well! Try out these ideas:\n\nEnjoy Eating a Cheese Ball\n\nThe best way to celebrate National Cheeseball Day is simply to indulge in the delicious treat that is the cheeseball. Get your favorite dipping implement, whether that’s crackers, bread, or even bits of meat, and go to town with a cheese ball.\n\nOther delectable items that can be dipped into a cheeseball include:\n\nSlices of apple or pear\n\nPretzel sticks or pretzel twists\n\nToasted mini bagel chips\n\nPita triangles\n\nFresh vegetables (carrot sticks, celery sticks, cauliflower)\n\nGraham Crackers (for the sweeter cheese balls)\n\nMake a Cheese Ball at Home\n\nDo a little bit of research and create a unique, culinary cheeseball creation at home to share it with friends, family, neighbors or coworkers. Remember, little events like this are always popular at the office, and imagine how many types of cheese balls can be discovered then! (Or… maybe there will just be a lot of almond covered ones.)\n\nA traditional cheese ball appetizer includes ingredients such as cream cheese, cheddar cheese, brie, sour cream, garlic powder and other spices. Some people like to create a spicy version that uses hot pepper sauce. Other people like to include a splash of Worcester sauce. Add Thai Sweet Chili sauce and serve with wontons!\n\nThrow a Cheeseball Party\n\nFor those people who have a collection of friends who enjoy a ‘fortified blog of cream cheese’, the only option is to grab a friend and host a fun and exciting cheese ball party!\n\nOf course the main food that is served must be cheeseballs, but that doesn’t’ have to be boring. There can be cheeseballs made in the normal way, but other options include an Asian theme, Pepper Jack, Hawaiian theme (with pineapple, of course), Cranberry Pecan and even dessert cheeseballs made with Oreo cookies!\n\nAt this party, feel free to watch Alvin and the Chipmunks 2 film, which features an excellent scene where Alvin converts the song “Stayin’ Alive” into an entire montage about being a Cheese Ball Man!\n\nSince the theme of the party is everything cheese, have guests wear their ‘cheesiest’ clothes, and don’t forget to play ‘cheesy’ music! In addition to Alvin’s Cheese Ball song, try a variety of songs such as these:"}, {"url": "http://www.celebrateboston.com/sites/granary-burying-ground-elisha-brown.htm", "page_content": "Elisha Brown Grave\n\nIn 1769, Elisha Brown and his family performed one of the earliest American acts of defiance against the British Empire. Brown was ordered to surrender his home by British forces so it could be converted into a barracks:\n\n\"Elisha Brown was an inhabitant of the southerly part of Boston, where he owned an estate of considerable value. In the year 1769, when the British soldiers held possession of the town, his house, a very commodious mansion, was selected as remarkably well adapted for the use of barracks, and he was peremptorily ordered to vacate the premises for their convenience.\n\nElisha Brown Marker\n\nOn refusing to comply with the demand of the soldiers, the house was surrounded by the troops, and kept in a state of siege.\n\nIt is said that for seventeen days he prevented the troops from gaining their wishes, he having barred all the windows and doors on the inside of the house, and relying for sustenance on the usual family stores which he had provided for family use, and upon the supplies which his friends from without, from time to time found opportunities to convey to him.\"\n\nBrown died in 1785 at the age of 65. He was a true Son of Liberty. His marker can be found in the cemetery off the walkway to the left of the Franklin obelisk. The sign there can direct you to the marker's location. His marker states the following:\n\nELISHA BROWN,\n\nOF BOSTON,\n\nWHO,\n\nIN OCT'R, 1769, DURING 17 DAYS, INSPIRED WITH A GENEROUS ZEAL\n\nFOR THE LAWS,\n\nBRAVELY AND SUCCESSFULLY\n\nOPPOSED A WHOLE BRITISH REG'T.\n\nIN THEIR VIOLENT ATTEMPTS\n\nTO FORCE HIM\n\nFROM HIS LEGAL HABITATION.\n\nHAPPY CITIZEN, WHEN CALL'D SINGLEY\n\nTO BE A BARRIER\n\nTO\n\nTHE LIBERTYS OF A CONTINENT.\n\nContact Information & Address:\n\nGranary Burying Ground\n\nTremont & Bromfield Streets, Boston, MA\n\n617.635.4505\n\ncityofboston.gov"}, {"url": "https://www.findagrave.com/memorial/29668116/elisha-brown", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.wikitree.com/wiki/Brown-87393", "page_content": "Is Elisha your ancestor? Please Login to collaborate or comment the profile manager, ask our community of genealogists a question.\n\nDNA\n\nNo known carriers of Elisha's DNA have taken a DNA test\n\nHave you taken a DNA test? If so, login to add it. If not, see our friends at Ancestry DNA."}, {"url": "https://www.findagrave.com/memorial/122195457/elisha-brown", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.wikitree.com/wiki/Brown-26077", "page_content": "Elisha Brown\n\n12 Dec 1715 in Reading, Middlesex, Massachusetts Bornin\n\nAncestors\n\n[sibling(s) unknown]\n\nElizabeth (Davis) Brooks Husband of— married 17 May 1744 (to about 1756) in Concord, Middlesex, Massachusetts\n\nDescendants\n\nSamuel Brown Father of\n\nabout 1756 at about age 40 in Acton, Middlesex, Massachusetts [uncertain] Diedin [uncertain]\n\nProfile last modified 17 Sep 2022 | Created 18 Feb 2014\n\nThis page has been accessed 269 times.\n\nBiography\n\nSamuel Brown, born Sept. 18, 1675; died 1722, a native of Reading was a gentleman of high standing who at the time of his death was wealthy for those days. His wife Mary, who died in 1778, took charge of the estate which she successfully managed during a widowhood of more than fifty years. Elisha, their son, born Dec. 12, 1715; died 1756 in Acton; married May 17, 1744, Elizabeth, born March 8 1720; died Sept. 9, 1818, daughter of Simon and Hannah (Potter) Davis. Elisha Brown moved to Cambridge in 1744 where he married Elizabeth Davis. They were the parents of four children:\n\nHannah, Mary, Samuel, and Elisha.(p. 177)\n\nTheir son: Samuel was born Oct. 12, 1749, probably in Cambridge but enlisted from Acton in the American Revolution in which he held the rank of 2nd lieutenant, Capt Patch's Company; Col. William Prescott's regiment. He participated in the engagements at Bunker Hill and Concord and was at the siege of Boston. He was also in the Arnold expedition to Quebec where he was wounded and taken prisoner but paroled in Sept. 1776, and sent home. In 1800 when 51 years of age Samuel Brown removed to St. Clairsville, Ohio where he died in 1828 and was buried with military honors. (p. 177)[1]\n\nConcord Births\n\nDAVIS, Elisabeth, d. Simon and Hannah, Mar. 8, 1719-20. (p. 107)\n\nConcord Marriages\n\nDAVIS, Elisabeth, and Elisha Brown, of Cambridge, May 17, 1744. (p. 161)[2]\n\nReading Births\n\nBROWN, Elisha, s. Samuel and Mary, Dec. 12, 1715. (p. 37)[3]\n\nCambridge Marriages\n\nBROWN, Elisha and Elizabeth Davis (Davies. int.) of Concord, in Concord, May 17, 1744.\n\nCambirdge Births\n\nChildren: BROWN Samuel, s. Elisha, bp. Oct. 15, 1749. CR1 (p. 97)]\n\n[4]\n\n[Notes: Unconfirmed Lineage Cambridge Births: BROWN: Elizabeth, d. Elisha, bp. Mar. 3, 1744-5. CR1 9p. 94) Hannah, d. Elisha, bp. Mar. 30, 1746. CR1 (p. 95) Mary, d. Elisha, bp. Aug. 23, 1747. CR1 (p. 97)\n\n\n\n\n\nSources\n\n↑ Sketches of Colorado: being an analytical summary and biographical history of the State of Colorado as portrayed in the lives of the pioneers, the founders, the builders, the statesmen, and the prominent and progressive citizens who helped in the development and history making of Colorado, Volume 1 by William Columbus Ferril, Western Press Bureau Company ↑ Vital Records of Concord Massachusetts to the Year 1850 ↑ Vital Records of Reading Massachusetts to the Year 1850 ↑ Entered by Chris Hoyt, 7 February 2014."}, {"url": "https://www.wikitree.com/wiki/Lawrence-2420", "page_content": "Brig-Gen. Elisha Lawrence\n\nBorn about 1746 [location unknown]\n\nAncestors\n\nMary (Ashfield) Lawrence Husband of— married 6 Mar 1776 (to 14 Apr 1779) in Shrewsbury, Monmouth County, Province of New Jersey\n\n23 Jul 1799 at about age 53 in Freehold, Monmouth County, New Jersey Diedin\n\nProblems/Questions\n\nProfile last modified 11 Mar 2023 | Created 1 Aug 2012\n\nThis page has been accessed 1,279 times.\n\nBiography\n\nPreceded by\n\n1st Governor\n\nWilliam Livingston Elisha Lawrence\n\nActing Governor\n\nof New Jersey Succeeded by\n\n2nd Governor\n\nWilliam Paterson\n\nBrigadier General Elisha Lawrence served with Monmouth County Militia, New Jersey Militia during the American Revolution.\n\nElisha Lawrence is Notable.\n\nHe was born about 1746 and his parents were Elizabeth (Brown) and Elisha Lawrence, Jr. (1701-1791).\n\nIn 1766 he was a Monmouth County Sheriff.\n\nElisha Lawrence, III first married in early 1776 at Shrewsbury, Monmouth County, New Jersey Province to Mary Ashfield, [1] eldest daughter of the late Lewis Morris Ashfield. [2]\n\nHe served as a patriot in the military from 23 May 1777 to the close of the American Revolutionary War. He was a Lieutenant-Colonel in the Second Regiment of the Infantry, a Quartermaster and Brigadier-General of the Monmouth Brigade of the Monmouth County, New Jersey Militia.\n\nHis wife Mary died on 14 Apr 1779 and she was buried the following day at the Ashfield Family Buying Ground, Trinity Churchyard, New York City, New York. [3] [2]\n\nElisha Lawrence, III married secondly on 13 Dec 1779 at Christ Church and Saint Peters in Philadelphia, Philadelphia County, Pennsylvania, USA to Rebecca Redman, [4] [5] [6] [2] daughter of the late Joseph Redman.\n\nTheir daughter Elizabeth Lawrence was baptized on 30 June 1781 at Christ Church and Saint Peters, Philadelphia, Philadelphia County, Pennsylvania. [7]\n\nHe was was a soldier and politician from Upper Freehold, Monmouth County, New Jersey, USA. He held several offices there such as assessor, town clerk and committeeman.\n\nFor several years between 1780-1795, he was a member of the Legislative Council from Monmouth County, New Jersey.\n\nBetween 1789-1795 he was Vice President of New Jersey.\n\nWhen William Livingston, the first Governor of the State of New Jersey died, Elisha Lawrence succeeded him as Acting Governor of the State of New Jersey from 25 July 1790 through 30 Oct 1790, with the election of William Paterson as Governor of the State of New Jersey.\n\nBetween 1798-1799 Elisha Lawrence was \"President\" (this may mean mayor) of Upper Freehold.\n\nHe died in 1799 and was buried at the Yellow Meeting House Cemetery, Red Valley, Monmouth County, New Jersey, USA. [8] His comrades erected a monument in 1800. His daughter is buried at the feet of her father. There is also an upright stone to the right and a foot stone for General Lawrence with inscription ...\n\nSacred to the Memory of Gen. Elishia Lawrence who died July 23\"1. 1799 Aged 53 Years A stranger to all ambition but that of being useful He was twice Vice President of NJ for several years Presiding Judge of the Pleas And after a series of faithful and gallant services In the Revolutionary War He was appointed by his Country Brigadier General of the Monmouth Militia Oft he surveyed the blazing line When wars loud conflict racked the brain Now sheltered in the realms divine He treads heavens every peaceful plain Lead on by softer, mercy's mildest ray While fellow warriors hail him on his way. His Companion in Arms Gave this tribute of affection This 1st. day of January 1800.\n\nAt the feet of her father ...\n\nBeneath this stone are the remains of Miss Mary Redman Lawrence Suddenly snatched from life in the bloom of health, on the 5th day of October 1802 in the 20th year of her age Her form was lovely, but her mind the abode of every virtue\n\nSources\n\n↑ 1776/Mar/06 New York Gazette ↑ 2.0 2.1 2.2 This Old Monmouth [New Jersey of Ours] p136 by William S. Hornor & Moreau Brothers of Freehold, New Jersey in 1932; reprinted on 01 June 2009 by Clearfield Company Inc. & Genealogical Publishing Company of Baltimore, Maryland; purchase ↑ 1779/Apr/19 New York Gazette obituary; Text: Mary Ashfield Lawrence died in her 27th year, wife of Lieutenant Colonel Elisha Lawrence of Brigadier General Skinner's Brigade, and daughter of the late Honorable Lewis Ashfield, Esquire of Monmouth County, New Jersey. On April 15, 1779 Thursday Mary Ashfield Lawrence's remains were deposited in the Ashfield Family Buying Ground, Trinity Churchyard, New York City, New York. ↑ Philadelphia, Pennsylvania marriage license of 09 Dec 1779 ↑ Pennsylvania Marriages 1709-1940 on FamilySearch database citing FHL#1,490,579; m: 13 Dec 1779 Elisha Lawrence and Rebecca Ridman {sic} married at Christ Church and Saint Peters, Philadelphia, Philadelphia County, Pennsylvania ↑ 1779/Dec/15 Pennsylvania Gazette marriage notice; Text: Colonel Elisha Lawrence of New Jersey and Rebecca \"Becky\" Redman married at Philadelphia, Pennsylvania. \"Becky\" Redman was the second daughter of the late Joseph Redman, Esquire. ↑ Pennsylvania Births and Christenings 1709-1950 on FamilySearch database citing FHL#1,490,578; Elisha Lawrence in entry for Elizabeth Lawrence ↑ Find A Grave for Elisha Lawrence\n\n\"New Jersey Biographical and Genealogical Notes\" by William Nelson & New Jersey Archives in Newark, New Jersey in 1916\n\n\"Stout and Allied Families\" by Herald F. Stout of San Diego, California in 1986; Monmouth County Historical Association of Freehold, New Jersey, USA\n\nAcknowledgements\n\nWikiTree profile Lawrence-2420 was created on Jul 31, 2012 by Bob Worcester through the import of WORCESTER_2012-07-31.ged. See the Changes page for the details of edits by Bob and others.\n\n\n\n"}, {"url": "https://www.ancestry.com/search/collections/4282/", "page_content": "This database is a collection of records kept by the National Archives listing men who fought for the colonies in the American Revolutionary War. Record types contained in this collection include:\n\nMuster rolls\n\nPayrolls\n\nStrength returns\n\nMisc., personnel, pay, and supply records of American Army units\n\nManuscript register of the series (roll 1)\n\nWho is Included?\n\nRevolutionary War American Forces included various organizations formed by the Continental Congress as well as individual states, counties, and towns. Regular military units created by the Continental Congress comprised the Continental Army. Often this Army was reinforced with units created by individual states. The records contained in this database regard only the Continental Army, and state and other units that served with them. Therefore, not all individuals who served in the Revolutionary War will be found in this database.\n\nHow to use this Database:\n\nAn index to the names of individuals contained in these records was created by Direct Data Capture. You can search this index by using the search template above. Information available in the index includes:\n\nSoldier’s name\n\nCategory (explained below)\n\nRank\n\nNARA microfilm roll number\n\nUse this information to then find the corresponding image of the record on which the soldier appears. Clicking on the “View Image” icon on the search results or record level pages will take you to the first image of the roll that the individual is on. You will then need to “scroll” through the images until you find the correct image. It is important to view the image of the original record as additional information about the individual will likely be listed.\n\nArrangement of Records:\n\nRecords in this collection are arranged into three categories –\n\nIndividual states (Connecticut, Delaware, Georgia, Maryland, Massachusetts, New Hampshire, New Jersey, New York, North Carolina, Pennsylvania, Rhode Island, South Carolina, Vermont, and Virginia) – includes records for Continental Army units raised in the state; state militia and volunteer units\n\nContinental Troops - includes records for Continental Congress specialized units; Continental Congress infantry regiments organized from resolutions of 1776; Continental Army units raised in multiple states\n\nMiscellaneous – includes records for units larger than a regiment; special returns not easily classified into another category\n\nWithin each category the records are arranged as follows:\n\nStates:\n\nNumbered units (arranged numerically)\n\nNamed units (arranged alphabetically)\n\nContinental Troops:\n\nCalvary, artillery, and artificer units\n\nNumbered units (arranged numerically)\n\nNamed units (arranged alphabetically)\n\nInfantry regiments of 1776\n\nNumbered units (arranged numerically)\n\nAdditional regiments\n\nNamed units (arranged alphabetically)\n\nMiscellaneous units\n\nNamed units (arranged alphabetically)\n\nMiscellaneous:"}, {"url": "https://www.ncpedia.org/biography/battle-elisha", "page_content": "Battle, Elisha\n\nby R. Hargus Taylor, 1979\n\n9 Jan. 1723–6 Mar. 1799\n\nElisha Battle, planter, revolutionary patriot, and state legislator, was born in Nansemond County, Va. He was the fifth child and third son of William and Sarah Hunter Battle. Earlier paternal and maternal ancestors had emigrated from Yorkshire, England, in the mid-seventeenth century, his grandfather, John Battle, settling on a two-hundred-acre estate on the west bank of Nansemond River in Nansemond County, Va. In 1663 this same John Battle obtained a royal patent for 640 acres of land on Pasquotank River in North Carolina. Here Elisha Battle's father, William, was born in 1682. In 1690, upon the death of his father, William returned to Nansemond County, where he continued to reside until his death in 1749.\n\nBy deed of record dated 17 Aug. 1747, Elisha Battle purchased four hundred acres on the north side of Tar River, in Edgecombe County, from Samuel Holliman. This purchase formed the nucleus of Cool Spring Plantation, near the present town limits of Rocky Mount, to which Battle moved with his family in late 1747 or early 1748. Subsequent purchases made Battle a large and prosperous landholder. He soon gained a reputation as a man of honest conviction, sound judgment, and considerable native ability.\n\nAccording to an early biographer, Battle was appointed justice of the peace in about 1756, retaining this position until the infirmities of old age forced him to relinquish it in 1795. By 1759 he was serving as a justice for Edgecombe county court (later the inferior court of pleas and quarter sessions). He was one of five commissioners appointed in 1760 to \"found and lay out\" the town of Tarboro.\n\nThe same early biographer indicates that Battle was elected to represent Edgecombe in the colonial House of Commons as early as 1771, though his first recorded appearance there is during the assembly that convened in New Bern, 4–21 Dec. 1773. With the threat of impending warfare, Battle was named chairman of Edgecombe's committee of safety (1774–75). He also represented his county in the provincial congresses that met in Halifax in April 1776 and in November 1776.\n\nWith the establishment of an independent state government, Elisha Battle was elected to represent Edgecombe County in the state senate, 1777–81, 1783, and 1785–87. He served as chairman of the committee of the whole during much of the session of the constitutional convention, convened in Hillsborough in July 1788. With the majority of the delegates, Battle held that it would be too dangerous to adopt the proposed federal constitution without amendments to reserve and secure certain rights to the individual states. Accordingly, he voted to postpone adoption until such amendments were effected.\n\nIn 1742, Battle married Elizabeth Sumner, a first cousin to Brigadier General Jethro Sumner, who served in the Continental Army under Washington. To their union were born eight children: Sarah, who married Jacob Hilliard and, afterward, Henry Horn; John, who married Frances Davis; Elizabeth, who married Josiah Crudup, Jr.; Elisha, who married Sarah Bunn; William, who married Charity Horn; Dempsey, who married Jane Andrews; Jacob, who married Penelope Edwards; and Jethro, who married Martha Lane.\n\nBattle united with the Falls of Tar River Baptist Church in 1764, attaining prominence in the affairs of his local congregation and the larger denomination. He served as a deacon and as a clerk at Falls of Tar River. He was also instrumental in the organization of the Kehukee Baptist Association in 1769, serving that body occasionally as moderator and as clerk. He was buried on the family plantation."}, {"url": "https://www.geni.com/people/Elisha-Warfield-Jr-M-D/4844238263470092903", "page_content": "About Elisha Warfield, Jr., M.D.\n\nhttp://en.wikipedia.org/wiki/Elisha_Warfield\n\nElisha Warfield, Jr. (February 5, 1781 - May 15, 1859) was an American physician and a Thoroughbred racehorse owner and breeder whom Thoroughbred Heritage calls \"one of the most important early figures in Kentucky racing and breeding.\"\n\nEarly life and education\n\nBorn in Maryland, Elisha, Jr. moved with his family to Lexington, Kentucky when he was nine years old. He was tutored privately and obtained a degree in medicine from Transylvania University.\n\nOn January 15, 1805, he married Maria Barr, with whom he had ten children. Their daughter Mary Jane Warfield married Cassius Marcellus Clay, who became a prominent politician and abolitionist in Kentucky.\n\nWarfield became a very successful medical practitioner in Lexington. He was selected as the first Professor of Surgery and Obstetrics at the newly established medical school at Transylvania University.\n\nActive in community development, in 1830 Elisha Warfield was a founding shareholder of the Lexington & Ohio Railway Company. In 1834 it connected Lexington to the state capital of Frankfort, Kentucky.\n\nThoroughbred horses\n\nAround the time of his marriage, Elisha Warfield began racing and breeding Thoroughbred horses. In 1809 he was one of the founding members of the Lexington Jockey Club, consisting of owners of the racehorses and breeding farms.\n\nIn 1821 Warfield decided to devote his energies to breeding, training and racing Thoroughbreds full time. In 1826, he was one of the founders of the Kentucky Association, which built a horse racetrack on land adjacent to his stud farm.\n\nKnown as The Meadows, Warfield's stud farm was located on Winchester Pike on the Northeast side of Lexington. It was where he bred Lexington, a U.S. Racing Hall of Fame Thoroughbred stallion. Foaled at The Meadows on March 29, 1850, and originally named Darley, the colt was very successful on the racetrack, winning six of his seven starts. As a breeding stallion, he is considered one of the greatest in United States history. Between 1861 and 1878, Lexington was ranked as the leading sire in North America a record sixteen times, of which fourteen were consecutive years. As of 2008, Lexington's record remains intact.\n\nWarfield and his brother Benjamin, an attorney, were members of the group that founded Lexington Cemetery in 1849. Elisha Warfield was buried here following his 1859 death at his Lexington home.\n\nThe Meadows stud farm was eventually sold, with portions of the property parceled off. Prominent Kentucky horseman Daniel Swigert owned the stud for a time before selling it in August 1888. Increased population in the city put pressure on surrounding real estate. Developers acquired the property in 1945 and subdivided it for residential use as The Meadows."}]}