{"Elisha Brown Jr. was a veteran of the American Revolutionary War, and served in the Rhode Island General Assembly.": [{"url": "https://www.archives.gov/research/military/american-revolution", "page_content": "Compiled Military Service Records\n\nPre-World War I U.S. Army Pension and Bounty Land Applications\n\nRevolutionary War Service, 1775–1783, a reference report\n\nRegular and Volunteer United States Military Service Between the Revolutionary War and the War of 1812, a reference report\n\nSearch Online\n\nRevolutionary War Rolls, 1775-1783 (Microfilm Roll #M246 , Record Group 93)\n\nCompiled Service Records of American Naval Personnel and Members of the Departments of the Quartermaster General and the Commissary General of Military Stores Who Served During the Revolutionary War (Microfilm Roll #M880, Record Group 93)\n\nCompiled Service Records of Soldiers who Served in the American Army During the Revolutionary War (Microfilm Roll #M881, Record Group 93)\n\nCarded Records Showing Military Service of Soldiers Who Served in Volunteer Units During the Post-Revolutionary War Period, Compiled 1899 - 1927, documenting the period 1784 - 1811 (Microfilm Roll #M905, Record Group 94)\n\nAncestry.com (free from NARA computers) | Ancestry.com ($ - by subscription)\n\nNumbered Records Books Concerning Military Operations and Service, Pay and Settlement of Accounts, and Supplies in the War Department Collection of Revolutionary War Records (Microfilm Roll #M853, Record Group 93)\n\nMiscellaneous Numbered Records (The Manuscript File) in the War Department Collection of Revolutionary War Records, 1775-1790's (Microfilm Roll #M859, Record Group 93)"}, {"url": "https://www.ancestry.com/search/collections/4282/", "page_content": "This database is a collection of records kept by the National Archives listing men who fought for the colonies in the American Revolutionary War. Record types contained in this collection include:\n\nMuster rolls\n\nPayrolls\n\nStrength returns\n\nMisc., personnel, pay, and supply records of American Army units\n\nManuscript register of the series (roll 1)\n\nWho is Included?\n\nRevolutionary War American Forces included various organizations formed by the Continental Congress as well as individual states, counties, and towns. Regular military units created by the Continental Congress comprised the Continental Army. Often this Army was reinforced with units created by individual states. The records contained in this database regard only the Continental Army, and state and other units that served with them. Therefore, not all individuals who served in the Revolutionary War will be found in this database.\n\nHow to use this Database:\n\nAn index to the names of individuals contained in these records was created by Direct Data Capture. You can search this index by using the search template above. Information available in the index includes:\n\nSoldier’s name\n\nCategory (explained below)\n\nRank\n\nNARA microfilm roll number\n\nUse this information to then find the corresponding image of the record on which the soldier appears. Clicking on the “View Image” icon on the search results or record level pages will take you to the first image of the roll that the individual is on. You will then need to “scroll” through the images until you find the correct image. It is important to view the image of the original record as additional information about the individual will likely be listed.\n\nArrangement of Records:\n\nRecords in this collection are arranged into three categories –\n\nIndividual states (Connecticut, Delaware, Georgia, Maryland, Massachusetts, New Hampshire, New Jersey, New York, North Carolina, Pennsylvania, Rhode Island, South Carolina, Vermont, and Virginia) – includes records for Continental Army units raised in the state; state militia and volunteer units\n\nContinental Troops - includes records for Continental Congress specialized units; Continental Congress infantry regiments organized from resolutions of 1776; Continental Army units raised in multiple states\n\nMiscellaneous – includes records for units larger than a regiment; special returns not easily classified into another category\n\nWithin each category the records are arranged as follows:\n\nStates:\n\nNumbered units (arranged numerically)\n\nNamed units (arranged alphabetically)\n\nContinental Troops:\n\nCalvary, artillery, and artificer units\n\nNumbered units (arranged numerically)\n\nNamed units (arranged alphabetically)\n\nInfantry regiments of 1776\n\nNumbered units (arranged numerically)\n\nAdditional regiments\n\nNamed units (arranged alphabetically)\n\nMiscellaneous units\n\nNamed units (arranged alphabetically)\n\nMiscellaneous:"}, {"url": "https://revolutionarywar.us/records/", "page_content": "From 1775, with the first shots in Lexington, to the Treaty of Paris in 1783, the Revolutionary War secured independence for the United States of America. Ancestry has 33 collections with millions of records spanning the length of the war and beyond. Find the patriots in your family who helped give birth to a new nation.\n\nU.S. Revolutionary War Rolls, 1775–1783\n\nA collection of more than 425,000 records documenting men who fought for the colonies in the American Revolutionary War.\n\nAbstracts of Graves of Revolutionary War Patriots\n\nRevolutionary War graves found between 1900 and 1987, which include the name of the patriot and the cemetery in which the headstone is found.\n\nU.S. Compiled Revolutionary War Military Service Records, 1775–1783\n\nRecords of regular soldiers, militia volunteers, Navy personnel and members of auxiliary.\n\nRevolutionary War Pension and Bounty-Land Warrant Application Files, 1800–1900\n\nA detail-rich collection of more than 80,000 files from applications by officers and enlisted men who served in the Revolutionary War.\n\nMassachusetts Soldiers and Sailors in the Revolutionary War\n\nCompilation of more than 850,000 records of Massachusetts soldiers and sailors serving in the Army or Navy during the Revolutionary War.\n\nDaughters of the American Revolution Lineage Books\n\nA collection of 152 volumes containing nearly 2.4 million names.\n\nU.S., Sons of the American Revolution Membership Applications, 1889–1970\n\nThis database contains applications for membership in the National Society of the Sons of the American Revolution approved between 1889 and 31 December 1970. These records can be an excellent source for names, dates, locations, and family relationships."}, {"url": "https://www.dar.org/national-society/accepted-revolutionary-war-service", "page_content": "County and Town Officials (Town Clerk, Selectman, Juror, Town Treasurer, Judge, Sheriff, Constable, Jailer, Surveyor of Highways, Justice of the Peace, etc.)\n\nMembers of the Continental Congress, State Conventions, and Assemblies\n\nMembership in committees made necessary by the War, including service on committees which furthered the cause of the Colonies from April 1774, such as Committees of Correspondence, Inspection, and Safety, committees to care for soldier's families, etc.\n\nSigner of Oath of Fidelity and Support, Oath of Allegiance, etc.\n\nMembers of the Boston Tea Party\n\nSigners of Petitions acknowledge the right of the new provincial and/or state government to represent the people. In addition, the content and wording of the petition must clearly demonstrate loyalty to the cause of American independence. Petitions regarding religious issues do not qualify.\n\nDefenders of Forts and Stations: Individuals who lived on the frontier, from the Great Northern Lakes to Georgia, who are documented as having actively defended the western frontiers against British forces and their allies, the Indians.\n\nDoctors, nurses, and others rendering aid to the wounded (other than their immediate families)\n\nMinisters who gave patriotic sermons and encouraged patriotic activity\n\nFurnishing a substitute for military service\n\nPrisoners of war or refugees from occupying forces\n\nPrisoners on the British ship Old Jersey or other prison ships\n\nService in the Spanish Troops under Galvez or the Louisiana Militia after 24 December 1776\n\nService performed by French nationals within the colonies or in Europe in support of the American cause\n\nThose who rendered material aid, in Spanish America, by supplying cattle for Galvez's forces after 24 December 1776\n\nThose who applied in Virginia for Certificates of Rights to land for settlement and those who were entitled to and were granted preemption rights\n\nThose who took the Oath of Fidelity to the Commonwealth of Virginia from October 1779 to 26 November 1783\n\nThose who rendered material aid and supported the cause of American Independence by furnishing supplies, with or without remuneration, loaning money and/or providing munitions. Some states enacted special tax laws to raise money for supplies. Payment of these “supply” taxes is considered patriotic service."}, {"url": "https://www.archives.gov/publications/prologue/2015/summer/rev-war-pensions.html", "page_content": "Using Revolutionary War Pension Files to Find Family Information\n\nSummer 2015, Vol. 47, No. 2 | Genealogy Notes\n\nBy Jean Nudd\n\nThe Revolutionary War pension and bounty-land application file for Philip Sell of North Carolina contains the birth and baptismal record of Dorothea Garecht Sell. (National Archives Identifier 300222) View in National Archives Catalog\n\nRevolutionary War pension files can be a gold mine of information for genealogists searching for ancestors from the era of the nation's birth.\n\nTake, for example, Daniel Ide, a member of the prolific Ide family of Massachusetts.\n\nDaniel Ide was born in Westminster, Vermont, in 1783.1 A published genealogy of the Ide family lists an Ichabod Ide who lived in Westminster, Vermont, in the mid-1700s. Ichabod had many sons who could have fathered Daniel, but there is no Daniel listed in any of the family groups for Ichabod's children.2 A search of the Vermont vital records microfilm also failed to find a Daniel Ide other than his death record and birth records of his children.\n\nThere are quite a few pension files for the Ide family of Massachusetts, and fortunately for our search for Daniel, there is one for Israel Ide, one of Ichabod’s sons. At first glance, a researcher might not consider this pension file because Israel served from Massachusetts. The pages within, however, show that Israel came from Westminster, Vermont, to Cambridge, Massachusetts, where he signed on with Captain Wood's Regiment. Israel's brother Ichabod and several cousins were already serving in Wood's regiment. Almost at the end of the file is an affidavit from one Daniel Ide, who stated:\n\nI, Daniel Ide of Coventry in the County of Orleans and State of Vermont aged fifty six years depose and say that I am a Son to Israel and Martha Ide who formerly lived in Westminster in this State and afterwards lived in Coventry aforesaid—I further State my Father the said Israel Ide died on the 9th day of October 1822 since which my Mother the said Martha Ide has ever continued a Widow.3\n\nDaniel swore to the affidavit on March 1, 1839. His age of 56 years at the time gives us a birth year of 1783, which matches the age listed on his death record. With the connection made between Daniel and Israel, it is now possible to trace the Ide family back to the original immigrant, Nicholas Ide, who was born about 1620 in Ide, England, and died in Rehoboth, Massachusetts, in 1690.4\n\nNot every Revolutionary War soldier received a pension. And the pension and bounty-land warrant application files contain mostly the records of enlisted men, not officers. The first pension act, enacted on August 26, 1776, allowed pensions for soldiers and sailors who had been injured in the service of the colonies and were therefore incapable of earning a living.\n\nLearn more about: Revolutionary War Pension and Bounty-Land Warrant Application Files on Ancestry.com.\n\nStrategies for researching Revolutionary War service.\n\nFamily samplers submitted to support pension applications.\n\nCongress Offers Incentives to Stay in Until War's End\n\nTo encourage officers and enlisted men to serve for the duration of the conflict, the Continental Congress passed a resolution on May 15, 1778, allowing half-pay for all officers and a set gratuity of $80 to all enlisted men who remained in service to the end of the war. On August 24, 1780, the Continental Congress passed the first act offering pensions to widows and orphans of Revolutionary War soldiers.\n\nDuring the war, pensions were used to encourage enlistment and acceptance of commissions and to prevent desertion and resignation. After the war, they became a form of reward for services rendered. States as well as the federal government offered and awarded pensions based on participation in the Revolutionary War. However, the Revolutionary War Pension and Bounty-Land Warrant Application Files in the National Archives (Microfilm Publication M804) contain only the records of pensions granted or paid by the U.S. federal government.\n\nNot until 1818 did Congress pass a pension law granting pensions to Revolutionary War veterans who had not been disabled. These pensions, based on financial need, were granted for life. When a larger-than-anticipated number of applicants led to financial difficulties for the young nation, Congress amended the 1818 law in 1820 and again in 1822. The most liberal pension legislation, enacted in 1832, gave full pay for life to officers and enlisted men who had served for two or more years and partial pay for service of six months to two years.5\n\nA fire in the War Department on November 8, 1800, apparently destroyed all Revolutionary War pension and bounty land warrant applications and related papers submitted before that date.6 The pension files now in the National Archives were filed after 1800 and contain either a 10-by-14-inch envelope (if the pension paperwork still exists) or a 10-by-14-inch card summarizing the information about a claimant (if the pension no longer exists). An envelope may contain from 1 to 200 (or more) pages of records. A typical file contains around 30 pages of records, consisting of an application or applications of one or more claimants (veteran [designated the survivor], widow, orphan, etc.); other documents submitted as evidence of identity and service; and papers showing actions taken by the government concerning the claim(s).7\n\nDifferent types of pensions contain some of the same records, such as applications or affidavits, as well as different types of records, such as marriage records. There are basically three types of pensions: survivor (the veteran himself), widow, or invalid.\n\nPension Files of Survivors Yield Much Information\n\nSurvivors' pension envelopes have headings containing the name of the state or organization in which the veteran served, his name, other names he was known by, and the letter S (for survivor) followed by a file number.\n\nThe file may contain affidavits testifying to the veteran's service or claimed disability; documentary evidence of service submitted by the applicant, such as a commission or discharge certificate; printed briefs summarizing the claimed service; property schedules; certified copies from state officials verifying the applicant's service record; letters from attorneys, congressmen, and other interested parties relating to the progress of the application; and letters from genealogists and researchers seeking information with responses from the Pension Office, the Bureau of Pensions, or the Veterans Administration.8\n\nWilliam Nudd's declaration at age 69 listed his war service, with enlistment at Greenland, NH, and several six-month enlistments and stations in Rhode Island, New Jersey, and New York. (National Archives, Records of the Department of Veterans Affairs)\n\nAn example of a survivor’s pension is that of William Nudd, pension number S11151. His file contains a card that notes the pension roll where his pension was recorded and includes information on his service as a private in Colonel Mooney's Company, in the New Hampshire line. According to the card, he received a pension of $35.44 per annum, and his certificate of pension was issued on November 12, 1832, and sent to S. I. Tibbets, of Ossipee, Strafford County, New Hampshire. The file also includes a Declaration in Order to Obtain the Benefit of the Act of Congress passed July 7, 1832, which lists William's age as 69, and specific information on his Revolutionary War service: enlistment at Greenland, New Hampshire, and several six-month enlistments and stations in Rhode Island, New Jersey, and New York. The file also contains a preprinted form, \"Brief in the Case of, \" which asks questions about the veteran's age and in what battles he was engaged. Affidavits from William's long-time acquaintances giving support for his case are also present. By pension standards, his file, at around a dozen pages, is quite a small one.9\n\nWidows' pension application files envelopes have headings for the state or organizations in which the veteran served; his name and his widow's name; and the letter W (for widow) followed by the file number. Only the widow's given name will appear on the envelope unless she remarried, in which case her new surname will be included with the notation \"Former Widow.\" The file may contain records normally found in the survivor's file, especially if the file consolidates both the survivor's application and the widow’s application.\n\nA veteran's pension application normally gives his age or date of birth, his residence, and sometimes his birthplace. Property schedules often give names and ages of a veteran’s wife and children. The application of a widow seeking a pension or a bounty-land warrant may give her age, residence, maiden name, date and place of marriage, and the date and place of her husband's death. In some widows' pension application files is a copy of a marriage record from the town clerk, a clergyman, or a justice of the peace as proof of marriage. Sometimes family-record pages from Bibles and other books were also submitted by a widow as proof of marriage.10\n\nRevolutionary War Files Among Easiest to Use\n\nRosilla Hill, widow of Jonathan Hill, filed for a pension (application number W16291) based on her husband's service. While his service was from Massachusetts, Rosilla filed for a pension in Winchester, New Hampshire. The file includes a card listing the state roll where Rosilla was recorded with the annual payment of $99.55.\n\nLydia Coombs's affidavit provides information about her brother, Jonathan Hill, stating that he was married to Rosilla and that they had 12 children. (National Archives Identifier 54876474) View in National Archives Catalog\n\nAffidavits in the folder include one from Lydia Coombs, who stated that she was the sister of Jonathan Hill; that she lived in Douglas, Massachusetts, at the same time Jonathan and Rosilla were married, although she did not attend the ceremony; that Rosilla and Jonathan had lived together until his death; and that they had 12 children. Rosilla's declaration states that she is a resident of Winchester, New Hampshire; that Jonathan was a soldier in the first eight months of 1775; that they were married in May 1775 at Douglas, Massachusetts, by Elder Adam Stracter; that Jonathan was a substitute for Benjamin Robbins of Douglas and a one-month substitute for George Brown of Colcester, Rhode Island; and lastly that Jonathan died in Winchester, New Hampshire, on November 26, 1830.\n\nAn affidavit from William Dudley, town clerk of Douglas, Massachusetts, states that he was unable to locate in the town records any evidence of a marriage between Jonathan Hill and Rosillah Combs. However, he did find the intention of marriage for them published in Douglas on July 15, 1776. There are several letters of inquiry in the file and responses from the War Department. The file also states that Rosilla was 80 years old when she received her pension in 1839 and that Jonathan received a Bounty Land Warrant #4339, issued February 23, 1797, and given to William Blanchard.11\n\nRevolutionary War pension files are among the easier types of federal records to use because they are arranged alphabetically by surname of the veteran. Within surnames, the files are arranged alphabetically by given name and then alphabetically by state of service. The pension application files reproduced in Microfilm Publication M804 are also available online at www.ancestry.com.\n\nThe Revolutionary War pension and bounty-land warrant application files contain many 18th-century documents such as commissions, discharges, deeds, wills, diaries, journals, muster rolls, newspaper clippings, letters, marriage certificates, and family bible pages. These documents are too numerous for the National Archives to inventory and describe them all. Approximately 70 journals, diaries, and account books in the records have been inventoried, however, and a detailed descriptive list was compiled and printed in the descriptive pamphlet for Microfilm Publication M804.12\n\nMost of the inventoried items were written by the veteran, but some were written by fathers, wives, daughters, or sons of veterans. The time span of these items is from as early as 1685 and as late as 1853, but most items date from 1774 to 1781. The value of these items is more for the soldiers' perspectives than for genealogical information. The veterans included in this inventory are from 10 states:\n\nConnecticut: Thomas Bradford, Aaron Hart, Matthew Jackson, Simeon Lyman, Ephraim Lyon, John McCall, James Morris, Thomas Pierpoint, William Stevens, Lemuel Storrs, Jonathan Todd, and Robert Treat\n\nMassachusetts: Elijah Baker, Phinehas Bemis, Reuben Childs, Isaiah Eaton, William Farnsworth, Hezekiah Fay, Thomas Grafton, William Hamilton, Rufus Houghton, Andrew Kettell, Jonathan Libby, Benjamin Lock, George Mason, Joshua Mason, David Northey, Nahum Parker, Benjamin Pond, Joseph Roundey, Levi Stedman, Jehiel Stewart, Nathan Stickney, Josiah Stone, Abner Weston, Ammi White, Joseph White, and Joseph Wilder\n\nNew Hampshire: Samuel Chase, Daniel Kimball, Enoch Long, and John Spafford\n\nNew Jersey: Anthony Swain\n\nNew York:Henry Beckman Livingston and Samuel Millington\n\nNorth Carolina:Daniel Teachey\n\nPennsylvania: Daniel Deall, David Denny, Abner Everett, and Jacob Ritter\n\nRhode Island: Jabez Whipple\n\nSouth Carolina: Arthur Fairies\n\nVirginia: Zachariah Mills, Alvin Montjoy, Robert Scott, Anthony Tinsley, and George Toombs.13\n\nRevolutionary War pension application files have much to offer genealogists. If you have lost track of a family around the Revolutionary War, like the Ide family in Vermont, these records might connect your line as it connected Daniel and Israel. The Hill file also connected Jonathan Hill and Rosilla Coombs to Douglas, Massachusetts, and provided the information needed to find their parents. The amount of material in each file varies, but if you are lucky, you can find valuable insights into the veteran's life and his family.\n\nJean Nudd is an archivist with the National Archives. She is an avid genealogist and lectures frequently on using federal records and doing genealogy. She has given presentations to the Federation of Genealogical Societies in Boston, New England Regional Genealogical Conferences, and the Ohio Genealogical Society's annual conference, among many others.\n\nNotes\n\n1. Vermont Vital Records microfilm, roll 140, Berkshire Athenaeum, Pittsfield, MA.\n\n2. Louis W. Flanders and Edith Flanders Dunbar, Simeon Ide; Yeoman, Freeman, Pioneer Printer with a Genealogy of the Ide Family (Rutland, VT: Tuttle Co., 1931), pp. 195–209.\n\n3. Martha Ide, widow's pension application #W21431, Revolutionary War Pension and Bounty-Land Warrant Application Files (National Archives Microfilm Publication M804, roll 1389), Records of the Department of Veterans Affairs, Record Group 15, National Archives at Washington, D.C.\n\n4. Flanders, Simeon Ide, p. 180.\n\n5. National Archives and Records Administration, Descriptive Pamphlet for Revolutionary War Pension and Bounty-Land Warrant Application Files, M804 (Washington, DC: NARA, 1974), pp. 1–3.\n\n6. Ibid., p. 7.\n\n7. Ibid., p. 6.\n\n8. Ibid., p. 7.\n\n9. William Nudd, survivor's pension application file #S11151, M804, roll 1833.\n\n10. Descriptive Pamphlet for M804, p. 7, www.archives.gov/research/microfilm/m804.pdf.\n\n11. Rosilla Hill, widow's pension application file #W16291, and Jonathan Hill, Bounty Land Warrant Card, warrant number 4339, M804, roll 1277.\n\n12. Descriptive Pamphlet for M804, p. 14, www.archives.gov/research/microfilm/m804.pdf.\n\n13. Ibid., pp. 14–25.\n\nArticles published in Prologue do not necessarily represent the views of NARA or of any other agency of the United States Government."}, {"url": "https://historyofmassachusetts.org/massachusetts-revolutionary-war-soldiers/", "page_content": "Massachusetts colonists were the first to fight in the Revolutionary War and they also made up the majority of the soldiers in the war. They served as militiamen, minutemen and soldiers in the Continental Army.\n\nMassachusetts Militiamen & Minutemen:\n\nThe first minutemen of the American Revolution were organized in Worcester county, Mass in September of 1774 when officials at the Worcester County Convention decided to weed out loyalists in the militia by requiring the resignation of all officers and then reconstituting the militia into seven regiments with new officers.\n\nOfficials then called for each regiment to put aside one-third of its regiment to form into new, special companies called minutemen. These men were expected to keep their arms and equipment with them at all times and be ready to march at a minute’s warning.\n\nA handful of other counties voluntarily adopted this policy and when the Massachusetts Provincial Congress met in Salem in October of 1774 it urged all counties to adopt the policy.\n\nThe first test of the minutemen was at the Battle of Concord and the Battle of Lexington on April 19, 1775, during which hundreds of minutemen battled British troops on the Lexington Green and at the Old North Bridge in Concord.\n\nAlthough the minutemen lost the Battle of Lexington, they won the Battle of Concord and drove the British troops back to Boston where the state militia blockaded the troops in Boston, in what later became known as the Siege of Boston.\n\nThe minuteman units were later abandoned when the Continental Army was established in June of 1775 but the state militia continued.\n\nNotable Massachusetts militiamen and minutemen in the Revolutionary War:\n\nColonel John Allan\n\nAaron Bancroft\n\nSupply Belcher\n\nSergeant William Berry\n\nThaddeus Bowman\n\nColonel Roger Brown\n\nJohn Brown of Pittsfield\n\nStephen Bullock\n\nJohn Buttrick\n\nThomas Carpenter III\n\nGeorge Claghorn\n\nElijah Crane\n\nPhelix Cuff, an African-American man from Waltham\n\nTimothy Danielson\n\nIsaac Davis\n\nThomas Dawes\n\nWilliam Dawes\n\nPrince Estabrook, an African-American from Lexington\n\nChristian Febiger\n\nBrigadier General Nathaniel Freeman\n\nJoseph Frye\n\nThomas Gardner\n\nToby Gilmore\n\nBaxter Hall\n\nJohn Hancock\n\nJohn Hannum III\n\nLemuel Haynes\n\nGeorge Robert Twelves Hewes\n\nSamuel Hildreth\n\nCyprian Howe\n\nRufus King\n\nJoseph Leavitt\n\nBarzillai Lew\n\nBenjamin Lincoln\n\nLevi Lincoln Sr.\n\nMoses Little\n\nSolomon Lovell\n\nGeorge Middleton\n\nWilliam Munroe\n\nJohn Nixon\n\nSamuel Osgood\n\nJoseph Palmer\n\nJohn Parker\n\nTimothy Pickering\n\nAsa Pollard\n\nSeth Pomeroy\n\nSalem Poor, an African-American from Andover\n\nSeth Read\n\nPaul Revere\n\nCaleb Rich\n\nDeborah Sampson, a woman from Plympton who disguised herself as a man\n\nJob Shattuck\n\nDavid Shepard\n\nThomson J. Skinner\n\nAbraham Somes\n\nWilliam Stacy\n\nRussell Sturgis\n\nBezaleel Taft Sr\n\nSamuel Taft\n\nEbeneezer Thayer\n\nAnselm Tupper\n\nBenjamin Tupper\n\nRoyall Tyler\n\nJoseph Bradley Varnum\n\nPeleg Wadsworth\n\nJames Warren\n\nJoseph Warren\n\nSimeon Wheelock\n\nSamuel Willard\n\nBenjamin Ruggles Woodbridge\n\nWas Paul Revere a Minuteman?\n\nContrary to popular opinion, Paul Revere was not a minuteman but he did warn the minutemen, during his famous Midnight Ride, that the British troops were approaching Concord on the night of April 18/19 in 1775.\n\nPaul Revere later served as a Lieutenant Colonel in the Massachusetts Militia but was court-martialed in 1779 for disobey orders during the failed Penobscot Expedition in Maine. Revere was later cleared of all charges in 1782.\n\nMassachusetts Continental Army Soldiers:\n\nWhen the Continental Army was first established in June of 1775, out of the 37,363 soldiers who enlisted in the first year, about 16,449 were from Massachusetts.\n\nThis is not that surprising though since the American Revolution began in Massachusetts and it was the first colony to be occupied by the British.\n\nHowever, in almost every year of the Revolutionary War, the majority of soldiers in the Continental Army were from Massachusetts, according to Ainsworth Rand Spofford in his book Massachusetts In The American Revolution:\n\n“Thus, in 1777, long after the evacuation of Massachusetts by the enemy, we find that 12,591, out of 68,720 troops enlisted, were from Massachusetts; being a larger number than any other state contributed. The same lead was maintained throughout the war, except in 1779 and 1780, when Virginia’s soldiers and military actually in the field exceeded those of Massachusetts by a few hundred, while in 1782 (which witnessed the virtual close of the struggle), Massachusetts put 4,423 men in the field, out of a total of 18,006 in the Continental Army, Virginia having only 2,204 at the same period…Other regions witnessed more decisive battles, and continued for a much longer time, the immediate theatre of war; but Massachusetts soldiers marched or sailed to every colony, and bore their part in every important battle, from Bunker Hill down to Yorktown.”\n\nAmong these 68,720 Massachusetts soldiers, about 1,700 were African American and Native American men. These soldiers fought in the some of the most important battles of the Revolutionary War, such as Battle of Bunker Hill in June of 1775 where 150 African-American soldiers served.\n\nWhen George Washington later prohibited the enlistment of African-American men in the Continental Army, in November of 1775, the matter was taken up by Congress who declared on January 15, 1776:\n\n“That the free negroes who have served faithfully in the army at Cambridge may be reenlisted therein, but no others.”\n\nThat year Massachusetts set its own criteria for the enlistment of African Americans by passing two acts in 1776. The first was passed on January 26 and the second of November 14 which specifically exempted “Negroes, Indians and mulattoes” from military service in the Massachusetts militia.\n\nThis didn’t seem to stop Massachusetts African-Americans from enlisting though, according to the book Forgotten Patriots: African-American and American Indian Patriots in the Revolutionary War by Eric G. Grundset:\n\n“It is evident that in spite of the resolutions passed in 1776, Massachusetts African Americans were already serving in the army. A June 1, 1777 muster roll of Captain Charles Colton’s 2nd Company in Colonel John Greaton’s 3rd Massachusetts Regiment included the names of eleven African American men, most of who had enlisted prior to the January 27 act. The Baroness von Riedesel, who was among a group of American-held prisoners being escorted through western Massachusetts in the fall of 1777, wrote in a letter, ‘…you do not see a regiment in which there is not a large number of blacks…’”\n\nWhen Massachusetts began having a hard time meeting the State’s quota for the army set by Congress, the legislature passed another act on January 27, 1777, that exempted only Quakers.\n\nFinally, on April 28, 1778, the Massachusetts legislature passed a law officially allowing the enlistment of African-Americans.\n\nSome Massachusetts African-Americans who served in the Continental Army were:\n\nPeter Salem of Framingham\n\nPomp Jackson of Newburyport\n\nCato Prince of Marblehead\n\nFelix Cuff of Waltham\n\nPrimus Jackall of Palmer\n\nPelatiah McGoldsmith of Palmer\n\nWhat Type of Uniforms Did Massachusetts Soldiers Wear?\n\nMinutemen were citizen soldiers and didn’t have an official uniform so they instead wore regular clothing, which consisted of waistcoats, linen hunting shirts and breeches.\n\nAmerican soldiers early in the war wore long, brown coats. When the Continental Army’s uniforms were standardized in 1779, each regiment was assigned a blue coat with facings of a particular color to indicate their regiment. The New England states of Massachusetts, New Hampshire, Connecticut, and Rhode Island wore blue coats with white facings.\n\nFor more information on this topic, check out the following article What Type of Uniforms Did Revolutionary War Soldiers Wear?\n\nLists of Massachusetts Revolutionary War Soldiers:\n\nThe names of all of the Massachusetts soldiers who served in the Continental Army are too numerous to list here but the following books and websites have partial and/or complete lists:\n\n♦ Massachusetts Sailors and Soldiers in the Revolutionary War: Volume 1-17.\n\n♦ A List of the Soldiers in the War of the Revolution, from Worcester, Mass: With a Record of their Death and Place of Burial. Worcester by Mary Cochran Dodge\n\n♦ Soldiers of Oakham, Massachusetts in the Revolutionary War, the War of 1812, the Civil War by Henry Parks Wright\n\n♦ “Massachusetts Revolutionary War Soldiers 1775-1783.” ma-roots.org. Kathy Leigh.\n\nwww.ma-roots.org/military/revwar\n\nSources:\n\nNell, William Cooper. The Colored Patriots of the American Revolution. Boston, Robert F. Wallcut, 1855.\n\nGrundset, Eric G. Forgotten Patriots: African-American and American Indian Patriots in the Revolutionary War. National Society Daughters of the American Revolution, 2008.\n\nHartgrove, W. B. “The Negro Soldier in the American Revolution.” The Journal of Negro History, vol. 1, no. 2, 1916, pp. 110–131, www.jstor.org/stable/3035634.\n\nBell, J.L. “The Massachusetts Militia, and Its Exceptional Men.” Boston 1775, 4 Aug. 2017, boston1775.blogspot.com/2017/08/the-massachusetts-militia-and-its.html\n\n“The Battle of Bunker Hill Has a Diverse History.” African American Registry, www.aaregistry.org/historic_events/view/battle-bunker-hill-has-diverse-history\n\n“African Americans and the End of Slavery in Massachusetts – Revolutionary Participation.” Massachusetts Historical Society, www.masshist.org/endofslavery/index.php?id=56\n\nOdle, Cliff. “Brothers in Arms: African American Soldiers in the American Revolution.” The Freedom Trail Foundation, www.thefreedomtrail.org/educational-resources/article-brothers-in-arms.shtml\n\nCollins, Elizabeth M. “Black Soldiers in the Revolutionary War.” U.S. Army, 27 Feb. 2013, www.army.mil/article/97705/Black_Soldiers_in_the_Revolutionary_War\n\nGrundset, Eric G. “African-Americans of Massachusetts in the Revolution.” Massachusetts Society Sons of the American Revolution, 20 June. 2013, www.massar.org/african-americans-of-massachusetts-in-the-revolution/\n\n“African Americans During the Revolutionar War – Teacher Reference Sheet.” The Colonial Williamsburg Foundation, 2006, www.history.org/history/teaching/enewsletter/volume5/images/reference_sheet.pdf\n\nLeigh, Kathy. “Massachusetts Revolutionary War Soldiers 1775-1783.” Massachusetts Roots, Feb. 2002, www.ma-roots.org/military/revwar/\n\n“Minutemen.” Encyclopedia Britannica, www.britannica.com/topic/minuteman\n\n“Who Were the Minutemen?” National Park Service, www.nps.gov/mima/learn/education/who-were-the-minute-men.htm\n\nSpofford, Ainsworth R. Massachusetts In The American Revolution. Washington D.C.: District of Columbia Society of the Sons of the American Revolution, 1895."}, {"url": "https://www.americanrevolutioninstitute.org/exhibition/americas-first-veterans/", "page_content": "Our commitment to the veterans of our time is a legacy of the American Revolution and our commitment, two hundred years ago, to honor and care for America’s first veterans. Over a quarter of a million American men served in the armed forces that won our independence. Between eighty and ninety thousand of them served in the Continental Army, an all volunteer army of citizens. All of these men risked their lives. Those who survived the war became America’s first veterans—the world’s first veterans of an army of free men.\n\nThe American republic owed its existence to them, but in the first years after the Revolutionary War, Americans found it difficult to acknowledge that debt, much less honor their service. Most American soldiers returned from their service in the Revolutionary War with nothing more than the personal satisfaction of duty faithfully performed. Following British practice, Congress provided small pensions for men disabled in service. Most men discharged in good health received nothing. The generals who had led them were celebrated as heroes, but ordinary soldiers were rarely honored in the first decades after the war.\n\nIt took decades, but Americans gradually realized that the common soldiers of our Revolutionary War were heroes, too. Those who lived to be old men were finally recognized as honored veterans of a revolution that had created the first great republic of modern times. In 1818 Congress decided to award pensions to veterans in financial need, and in 1832 Congress voted to extend pensions to nearly all of the surviving soldiers and sailors of the Revolution. These were the first pensions paid to veterans without regard to rank, financial distress, or physical disability. They reflected the gratitude of a free people for the brave Americans who secured their freedom.\n\nAmerica’s First Veterans brings together paintings, artifacts, prints and documents to address the post-war experiences of the men who won the Revolutionary War—not the famous generals and leading officers whose names appear in histories of the war, but rather the junior officers and enlisted men whose stories are less often told. A centerpiece of the show is John Neagle’s arresting portrait of a destitute veteran of the Revolution, painted in 1830 in the midst of the fight for comprehensive federal pensions for the remaining Revolutionary War veterans. The exhibition also includes one of two reputed examples of the Badge of Military Merit, the Revolutionary War precursor to the modern Purple Heart, on loan from the American Independence Museum, Exeter, NH and the Society of the Cincinnati in the State of New Hampshire.\n\nThis exhibition is supported in part by a generous gift from CACI International.\n\nThe companion book to this exhibition, America’s First Veterans, is available in hardcover. Order your copy today."}, {"url": "https://www.findagrave.com/memorial/71508537/elisha-brown", "page_content": "The Daughters of American have his service as follows:\n\nSource: JOHNSON, CT MEN IN THE REV, PP45, 50\n\nService: CAPT LEVI WELLS, COL JOSEPH SPENCER, 2ND RGET, CT LINE\n\n\n\nPaula E Robinson-DeGraff\n\nDAR member in NYS and NH\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nAbstract of Graves of Revolutionary Patriots --Name: Elisha Brown -- Cemetery: Cem. on Old Warren Rd -- Location: Swansea MA\n\n~~\n\nElisha was the son of Nathaniel Brown and Anna Haynes. He married Content Leeds on 28 Nov 1754 in Groton. In his will he says, \"it is my wish that the burying yard where my wife is buried be well --- and kept for a burying place for all my family and my children and their families and all our friends.\"\n\n~~\n\nElisha served his country during the Revolutionary War.\n\nConnecticut Revolutionary War Military Lists, 1775-83 about Elisha Brown\n\nName: Elisha Brown\n\nLocation: Colchester\n\nPage #: 58\n\nRegiment: Third\n\nRegiment Command: Wyllys, Samuel Col.\n\nCompany: Champion's\n\nCompany Command: Champion, Henry Capt.\n\nRemarks: The Conn.Historical Society contains a collection of some two hundred interesting documents relating to this regiment; including lists of clothes issues to each soldier. The men signed receipts for each article of clothing received, therefore, the autograph of almost every man in the regiment appears on record.\n\nThe Daughters of American have his service as follows:\n\nSource: JOHNSON, CT MEN IN THE REV, PP45, 50\n\nService: CAPT LEVI WELLS, COL JOSEPH SPENCER, 2ND RGET, CT LINE\n\n\n\nPaula E Robinson-DeGraff\n\nDAR member in NYS and NH\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nAbstract of Graves of Revolutionary Patriots --Name: Elisha Brown -- Cemetery: Cem. on Old Warren Rd -- Location: Swansea MA\n\n~~\n\nElisha was the son of Nathaniel Brown and Anna Haynes. He married Content Leeds on 28 Nov 1754 in Groton. In his will he says, \"it is my wish that the burying yard where my wife is buried be well --- and kept for a burying place for all my family and my children and their families and all our friends.\"\n\n~~\n\nElisha served his country during the Revolutionary War.\n\nConnecticut Revolutionary War Military Lists, 1775-83 about Elisha Brown\n\nName: Elisha Brown\n\nLocation: Colchester\n\nPage #: 58\n\nRegiment: Third\n\nRegiment Command: Wyllys, Samuel Col.\n\nCompany: Champion's\n\nCompany Command: Champion, Henry Capt.\n\nRemarks: The Conn.Historical Society contains a collection of some two hundred interesting documents relating to this regiment; including lists of clothes issues to each soldier. The men signed receipts for each article of clothing received, therefore, the autograph of almost every man in the regiment appears on record."}, {"url": "https://www.wikitree.com/wiki/Walker-24335", "page_content": "Is Elisha your ancestor? Please Login to collaborate or comment the profile manager, ask our community of genealogists a question.\n\nDNA Connections\n\nIt may be possible to confirm family relationships with Elisha by comparing test results with other carriers of his Y-chromosome or his mother's mitochondrial DNA. However, there are no known yDNA or mtDNA test-takers in his direct paternal or maternal line. It is likely that these autosomal DNA test-takers will share some percentage of DNA with Elisha:\n\nHave you taken a DNA test? If so, login to add it. If not, see our friends at Ancestry DNA."}, {"url": "https://www.americanrevolutioninstitute.org/lesson-plans/legacies-of-the-revolution/revolutionary-war-veterans/", "page_content": "The Revolutionary War was won by thousands of ordinary soldiers. Congress made promises to them—of land grants, bounties, and routine pay—that it was very slow to fulfill, if it fulfilled them at all. Revolutionary War veterans resumed their civilian lives with no help from the free governments they had fought to create. Many struggled. For decades, Congress and the public seemed indifferent to them. That started to change in the years following the War of 1812, as the generation that had fought and won the Revolutionary War began to grow old.\n\nThe Legacy of America’s First Veterans asks students to consider the experience of Revolutionary War veterans in the early nineteenth century, how ideas about veterans changed between 1815 and 1835, and how that change reflected and shaped the development of an increasingly democratic culture. The lesson invites students to examine and interpret primary source evidence documenting the lives of ordinary veterans and the public debate about granting pensions to Revolutionary War veterans. That debate concluded with the adoption of the Pension Act of 1832, which created the first wide-reaching military pension program in American history. Like the G.I. Bill of the twentieth century, pensions provided to Revolutionary War veterans shaped the lives of thousands of veterans and expressed the nation’s commitment to the interests of ordinary Americans.\n\nSuggested Grade Level\n\nMiddle or High School\n\nRecommended Time\n\n\n\nTwo +/- fifty-minute sessions\n\nObjectives and Essential Questions\n\nStudents will learn:\n\nhow Americans learned to appreciate and honor the contributions and sacrifices of the common soldiers of the Revolutionary War;\n\nhow to use primary source documents to reconstruct the experiences of common solders of the Revolutionary War, using pension records to learn about their service and their post-war lives; and\n\nhow the treatment of Revolutionary War veterans in the 1820s and 1830s reflected and shaped the development of a more democratic society.\n\nMaterials and Resources\n\n\n\nBackground on Revolutionary War Veterans\n\n\n\nOver a quarter of a million American men served in the armed forces that won our independence. Between eighty and ninety thousand of them served in the Continental Army, an all volunteer army of citizens. All of these men risked their lives. About seven thousand were killed in battle. At least seventeen thousand soldiers died of disease or in accidents. The total number of soldiers who died from disease may exceed fifty thousand. Records are too fragmentary for us to be sure. As many as twenty-five thousand men were disabled by disease, wounds, or injuries sustained in service.\n\nThose who survived the war became America’s first veterans—the world’s first veterans of an army of free men. The American republic owed its existence to them, but Americans found it difficult to acknowledge that debt, much less honor their service. Cultural traditions inherited from Britain, where common soldiers were held in low regard, shaped the way many post-war Americans thought about veterans. Officers, in their view, might have been motivated by enlightened patriotism, but enlisted men had served for pay. Little else was owed to common soldiers—not even honor.\n\nFollowing British practice, Congress provided modest pensions for men disabled in service. Some states provided modest benefits to disabled soldiers and a few gave discharged soldiers land grants in lieu of back pay, but most men discharged in good health received nothing. The generals who led them were celebrated as heroes, but ordinary soldiers were rarely honored in the first decades after the war’s end.\n\nTheir fellow citizens came slowly to the realization that the common soldiers of the Revolutionary War were heroes, too. Those who lived to be old men were finally recognized as honored veterans of a revolution that had created the first great republic of modern times. Prompted by President James Monroe, a veteran of the Continental Army, Congress adopted the Pension Act of 1818, calling for pensions for Continental Army and Navy veterans in financial need.\n\nThis was a first step, but in spirit and practice it was much more like poor relief—or what we call today welfare payments—than a modern military pension. Today we think of military pensions as a reflection of our gratitude for those who serve in our defense and as a benefit veterans have earned. This way of thinking about military pensions and the veterans who qualify for them was shaped by the national discussion about providing for Revolutionary War veterans that took place between 1818 and 1832. In 1832 Congress decided to award pensions to the surviving veterans of the Revolutionary War. These were the first pensions paid to American veterans without regard to rank, financial distress, or physical disability. They reflected the gratitude of a free people for the soldiers who secured their freedom.\n\nSequence and Procedure\n\nWe recommend engaging students with three very different but related exercises involving three different kinds of primary sources—a series of documents relating to a single veteran, a contemporary portrait of a homeless veteran, and a speech in favor of pensions for nearly all surviving Revolutionary War veterans, delivered in the U.S. House of Representatives in 1832. These sources span the years from 1818, when Congress passed a law providing pensions to impoverished Revolutionary War veterans, to 1832, when Congress adopted a new pension law that provided financial support to nearly all surviving Revolutionary War veterans, regardless of financial need.\n\nTeachers should feel free to adapt these exercises or use one or two but not all three, as their goals and circumstances dictate. The strategy suggested here is to present the background and the first two exercises in class, and assign the third exercise as an assessment to be completed as homework. All three exercises can be readily adapted for asynchronous learning.\n\nPart One: Reconstructing the Life of Chatham Freeman, an African American Revolutionary War Veteran\n\n\n\nThis exercise challenges students to extract facts from a set of five short primary source documents to reconstruct the Revolutionary War service and later life of a Revolutionary War veteran. This exercise reinforces the background information on the Pension Act of 1818 by using the case of an actual Revolutionary War veteran’s application for a pension under the law. It also brings students face-to-face with reconstructing the life of an ordinary American from primary sources. The exercise has the added benefit of encouraging students to understand and appreciate the role of African American soldiers in the Revolutionary War, because the pension file under examination is the file of an African American named Chatham Freeman, one of thousands of African Americans who served in the armed forces that won American independence. We chose his file because of this fact, though in most respects his file is similar to that of thousands of white veterans who were successful in securing a pension under the 1818 law. Chatham Freeman’s file has the additional benefit of being relatively easy to read in its original manuscript form (they are reproduced in the image gallery below), if you choose to ask students to try. If not, they can use the transcripts supplied with the Materials and Resources. The questions suggested below are provided in worksheet form supplied with the Materials and Resources.\n\nLike thousands of other Revolutionary War veterans’ pension files, the pension file of Chatham Freeman is now in the National Archives in Washington, D.C. The file documents his application for a pension under the Pension Act of 1818. This selection consists of five one-page documents. You should guide the students through an overview of the purpose of each document before starting the exercise.\n\nCOVER: The first document is the cover, which is a partially printed form filled in with his name and other information. The cover was folded with the contents of the file inside. Early pension files like this one were tied with a thin piece of red ribbon to keep the pages all together. This ribbon, which was referred to as tape in the nineteenth century, is the source of the phrase “red tape,” used to refer to bureaucratic requirements. The pension system was the first federal bureaucracy that touched the lives of many thousands of ordinary civilians, who were usually anxious to “get through the red tape,” which means get through all the government requirements to secure a pension.\n\nPENSION DECLARATION: The second document is the pension declaration. The Pension Act of 1818 required that Revolutionary War veterans applying for pensions go to a local court and provide a statement to a judge swearing to a set of facts about their military service in the Revolutionary War, including the dates of their enlistment, the units in which they served, the names of their commanding officer, and the dates of their discharge. The law required each veteran to produce his written discharge from service if he had it, but most Revolutionary War veterans, including Chatham Freeman, had long since lost their discharge papers. The pension declaration was usually written up by a court clerk or an attorney from a statement given orally by the veteran, but some pension declarations were written by the veteran himself. In either case, the veteran had to sign the pension declaration, swearing to the truth of what he reported. If a veteran was unable to sign his name, he wrote an X on the document and someone wrote his name on either side of the X, sometimes adding the words “his mark” to indicate that the veteran had made an X in place of a signature.\n\nAFFIDAVITS: The third document is perhaps the most complicated to understand, but it is important and contains useful information. This is the affidavits. These always include a short statement written and signed by the judge who heard the pension declaration, affirming that that he had heard the statement of the applicant. The affidavits also usually include the signed statement of someone who knew the applicant, attesting to the applicant’s truthfulness and financial need, and additional statements by the judge, one indicating that the applicant believes that the applicant served in the Revolutionary War as he described, and another that the veteran is in financial need and so qualified for a pension under the law. Sometimes the last two were combined with the initial statement of the judge that the applicant had appeared before him to make his declaration.\n\nPROPERTY INVENTORY: The fourth document is a list of the veteran’s property along with an estimate of the value of each item, added up to give the value of everything on the list. This property inventory, or property “schedule” as it was called, is recorded on a partially printed form filled out by a court clerk. The applicant signed it or “made his mark” in place of his signature. For pensions awarded under the Pension Act of 1818, these property inventories are dated 1820 or later. What had happened is that in 1818, 1819, and 1820, many more Revolutionary War veterans were awarded pensions than Congress had predicted. An additional, or supplemental, law was passed in 1820 requiring every pensioner, and every new applicant, to appear in court and provide an inventory or “schedule” (in this case, “schedule” simply means a list and has nothing to do with time) of his property. The purpose of this document was to prove financial need. The federal officials in charge of pensions reviewed these inventories and decided whether the pensioner or new applicant was truly poor. If the reviewer decided a pensioner was not poor, he would be “dropped from the rolls,” that is, taken off the pension list and no longer sent a pension. These property inventories are very useful documents for understanding how people lived at the time, since they were required to list everything they had of any financial value except for their clothes, beds, sheets, and blankets. These inventories tell us about the applicant’s house and land (if he owned either), and usually includes his furniture, cooking equipment, tools, and any horses, cattle, pigs, or other livestock he owned. These documents help us picture how Revolutionary War veterans and others of their age or neighborhood lived.\n\nSWORN STATEMENT: The fifth document is a sworn statement required of all Revolutionary War veterans awarded pensions between 1818 and 1820, repeating the basic facts presented in their original pension declarations, documenting the number of their pension certificate (all pensioners were given a pension certificate with a unique number, something like a modern social security number), and swearing that they had not given away their property since being awarded a pension, in order to appear poor. The pensioner was required to state his occupation, name anyone who lived with him, and sign or “make his mark.” A court official signed the document as well, indicating the total value of the property in the attached property inventory. This document was sent to the federal government which used it, long with the property inventory, to determine whether a veteran who had been given a pension between 1818 and 1820 would continue to receive it.\n\nNow that the class is acquainted with the purpose of each of the five documents in Chatham Freeman’s file, we can pose questions about his life and circumstances that the students can answer by using these five documents.\n\nThese five documents do not tell us much about Chatham Freeman before he joined the Continental Army, but we know a little bit from other sources that the teacher can share with the class. We do not know where Chatham Freeman was born, but it is possible that he was born in Africa and brought to America by slave traders when he was a child or a young man. When the Revolutionary War began in 1775, he was a slave to Noah Yale (1723-1803) of Wallingford, Connecticut. He was probably known simply as “Chatham” before the war, with no last name, although if he was born in Africa he undoubtedly had a name in his African language. The name “Chatham” probably refers to William Pitt, earl of Chatham, the most important leader in the British Parliament during the French and Indian War. William Pitt was given the title earl of Chatham in 1766, so we can imagine our “Chatham” was given that name then or sometime shortly after. We do not have any direct evidence of the work he did, but we can guess he was a farm laborer.\n\nNoah Yale was a farmer. He and his wife, Anna, had ten children between 1745 and 1768—seven boys and three girls. Three of the boys and one of the girls died before the Revolutionary War, leaving the Noah and Anna with four sons and two daughters. The eldest surviving son, named Noah after his father, died in December 1776, while serving as soldier. He was twenty-seven when he died. His three surviving brothers were Thomas (age twenty), Joel (age seventeen) and Asahel (age twelve). Thomas served in the Connecticut militia from August to December 1776, returning home when his elder brother died.\n\nWhen the militia was called out in the spring of 1777, Noah Yale offered Chatham as a substitute for one of his sons—either Thomas or Joel—to spare the son from militia service. Under Connecticut law, young white men were required to serve in the militia, but enslaved men like Chatham were not required. Their enslavers could offer them as substitutes. We can imagine—this is an interpretive judgment about something we do not know for sure—that the death of the younger Noah Yale in December 1776 shook the family and made Noah and Anna reluctant to have Thomas return to military service or to have Joel serve at all.\n\nChatham enlisted in the Continental Army based on a promise from Noah Yale that he would be freed at the end of his service. We know this because at the end of the war Noah Yale went before the local court and officially released Chatham from slavery. A record of that action survives. No mention of this background appears in Chatham Freeman’s pension file, and there is no reason it should, since in 1818 he had been a free man for decades. Like many free African Americans, he used the last name “Freeman,” probably from the time he was released from enslavement. It might have been given to him by the court, or he might have chosen this last name himself. We do not know for sure. Freeman was a common name among free African Americans in the late eighteenth and nineteenth century and it remains a common name among African Americans today.\n\nUsing the five pension documents as primary source evidence, answer the following questions to reconstruct the life of Chatham Freeman:\n\nIn what year was Chatham Freeman born? This is a good question to start with, because finding the answer isn’t simple and the student will wind up going over all the documents to find the answer. At the beginning of the sworn statement (Document 5), Freeman says he is seventy years old. This document is dated 1820, which means that he was born about 1750. In what year did Chatham Freeman enlist in the Continental Army? In his pension declaration (Document 2), Freeman says he enlisted on June 2, 1777. In his sworn statement (Document 5), he says June 1777. What regiment did Chatham Freeman serve in? In his pension declaration (Document 2) he says he served in the “fourth Regiment, Connecticut Line,” commanded by Colonel Meigs. In his later sworn statement (Document 5), he says he served “Col. Meigs Regiment.” This is actually a good example of how people can misremember fairly important facts. Col. Return Jonathan Meigs (yes, Return is an unusual first name) was the colonel of the Sixth Regiment of the Connecticut Continental Line. Students can confirm this by doing a simple Google search for “Colonel Meigs Connecticut Revolutionary War.” Remind the class that Chatham Freeman was sixty-eight years old in 1818, and he had enlisted forty-one years before. People forget things. How long did Chatham Freeman serve in the Continental Army? When was he discharged? In his pension declaration (Document 2) he says he served three years. In his sworn statement (Document 5) he says he was honorably discharged in June 1780. What was the name of Chatham Freeman’s wife? When was she born? In his sworn statement (Document 5), which was made in 1820, he identifies his wife (near the end of the document) as Maria Freeman, and says she is “in her Eighty first year,” which is a way of saying she was over eighty but not yet eighty-one. If she was eighty in July 1820, she was born about 1740. She was about ten years older than her husband. Could Chatham Freeman read and write? How do we know? He couldn’t write his name, so he probably couldn’t read or write. He “made his mark” on his pension declaration (Document 2), his property inventory (Document 4) and his sworn statement (Document 5), signing his name with an X. Is there anything in Chatham Freeman’s pension file that indicates he was an African American? If so, what? This information is only found in the affidavits (Document 3), where it appears in two places. The second affidavit, signed by a man named Samuel Paddock, Jr., says that “I well know the above named Chatham Freeman that he is a free Negro man of good character.” This statement is dated April 6, 1818. At the bottom of the same document, Judge Simeon Baldwin wrote on August 21, 1818: “I certify that it appears to my satisfaction that the applicant Chatham Freeman is an old, infirm, poor negro man who needs the assistance of his Country for support.” In 1820, Chatham Freeman was required to list all his property to prove that he was poor. Did he own his own house? In his property inventory (Document 4), Chatham Freeman reported that he owned “One Old House & barn” sitting on one-fourth of an acre of land. What other land did he own and what was it like? In his property inventory (Document 4) he says he owned four acres of “Boggy Swamps,” two acres of “Plough land,” and four acres of “bush land.” In other words, he owned ten acres plus his house lot. Only two of the ten acres was suitable for farming—the “Plough” or plow land. The rest was “bush,” which means land covered with bushes and small trees, and swamp, which might be made into farmland if it were property drained. Two acres of farmland was plenty to grow fruits and vegetables to sustain two people. What was Chatham Freeman’s house like? How was it furnished? The property inventory (Document 4) says that he didn’t have to list his bedding, so we can assume he had a bed and didn’t list it. The only furniture listed is three old chairs worth seventy-five cents, a table worth fifty cents, and a chest worth fifty cents. It seems from this description that it might have been a one- or two-room house, consisting of a sleeping room or space and a place for table and chairs where the couple ate. The rest of their property consisted of one iron pot worth fifty cents and one pail, or bucket, worth twenty-five cents. What was all of Chatham Freeman’s property worth in 1820? Did he have any debts? The property inventory (Document 4) gives the total value of his house, land, and furnishings as $106.50. He reported that he owed a man named Amos White $65, meaning that what we now call the total net worth of his property, with debts subtracted, was $41.50 (we know from other sources that the man who had loaned him money, Amos White, was the local silversmith and was born in 1746, so he was a little older than Chatham Freeman). The sworn statement (Document 5) gives the $106.50 figure as the value of all of Chatham Freeman’s property. When he worked, what kind of work did Chatham Freeman do? Was he or his wife able to work in 1820? How do we know? According to the sworn statement (Document 5), Chatham Freeman said his occupation “is that of a labourer but I am so infirm as to be unable to labour.” He reported that his wife was “quite infirm & able to do but very little.” An attentive student might notice that on the property inventory (Document 4), Freeman did not include a plow, shovel, hoe, or any other farming tools, nor anything else to suggest that Freeman or his wife were doing any kind of work. They were both too old to do much manual labor.\n\nChatham Freeman was able to prove he was poor and so received a pension under the Pension Act of 1818. How much did he receive? The cover (Document 1) says that Freeman received a pension of eight dollars a month, or ninety-six dollars a year. Thus his yearly pension was worth twice as much as the net worth of his property. Using the Table of Retail Prices provided, consider what Chatham Freeman and his wife, Maria, could buy with eight dollars a month. Considering the fact that they owned their house and the land they lived on and did not have to pay rent, was eight dollars a month enough to live on? Explain your answer, describing how they might have spent the money. When did Chatham Freeman die? The cover (Document 1) says that he died on February 13, 1834. He was about eighty-four years old.\n\nPart Two: Examining the First Portrait of a Homeless Veteran\n\nDuring the 1820s, the federal pension office dropped thousands of veterans from the pension list because they failed to appear in court to provide an inventory of their property or the property inventories they provided suggested to the pension office that they were not poor enough to qualify for a pension under the act of 1818. This effort to cut costs disappointed the veterans who lost their pensions, and it brought widespread public attention ro the fact that pension law only applied to Revolutionary War veterans who had served in the Continental Army. Most Revolutionary War veterans had served in state regiments or in the militia. By the late 1820s, as most of the surviving Revolutionary War veterans were past seventy years old and few of them were able to work any longer, their distress became a subject of public debate. Did the people, acting through the federal government, owe all surviving Revolutionary War veterans a pension to help support them in their old age?\n\nThis question became a political issue in the presidential election of 1828, in which Andrew Jackson, who had served with the militia as a boy during the Revolutionary War, defeated John Quincy Adams. Jackson supported extending pensions to many more Revolutionary War veterans, but Congress took no action on the idea in 1829, the first year of Jackson’s presidency. The issue remained a subject of public discussion.\n\nOn a snowy night in December 1829, a successful young Philadelphia painter named John Neagle was walking to visit a friend when he noticed an elderly man huddling under a makeshift shelter. His clothes were ragged and the man was having trouble keeping warm. Neagle spoke to him, and then invited the man back to his home, where he gave him something to eat and a chair beside the fireplace.\n\nThe man told Neagle that his name was Joseph Winter, and that he had served in the Revolutionary War. After the war he had worked as a weaver, but he was too old to work and his wife and children were all dead. He had no one to help care for him in his old age.\n\nNeagle painted a portrait of the old veteran, who stayed with the artist for several days before setting off to find friends in another town. In 1831 an engraver made a print of the portrait, which was sold to the public under the title Patriotism and Age.\n\nAsk the class to examine the portrait, which is the oldest known portrait of a homeless American veteran. Unlike many portraits painted in the eighteenth and early nineteenth century, Neagle made no effort to portray Joseph Winter as a handsome gentlemen. In a class discussion, ask the students to describe their reaction to the painting. Most of these are subjective questions, which is inevitable, because the painting was clearly intended to appeal to the emotions of its viewers.\n\nWhat words would you use to describe Joseph Winter’s appearance? Students may suggest old, tired, sick, sad, ragged, sorrow, worn-out, and ideas of a similar sort. Do you think John Neagle intended people who saw the painting to react in the same way? Why? Neagle seems to have been moved by his encounter with Joseph Winter, and the portrait seems to have been intended to produce similar emotions in his audience. Why do you think John Neagle painted this portrait? Was he motivated by profit or something else? If so, what? Although Neagle probably shared in the profits from the sale of the engraving and ultimately sold the painting, he surely didn’t paint it to make money. He was in demand as a portrait painter and could earn money painting portraits of wealthy men and their families. He probably painted Joseph Winter to startle people into supporting the push to provide pensions to more Revolutionary War veterans. When people saw the engraving of the portrait for sale, with the title Patriotism and Age, do you think they recognized that it was a portrait of a Revolutionary War veteran? Why or why not? People probably did recognize the subject as a Revolutionary War veteran, because by 1831, when the engraving was sold, pensions for Revolutionary War veterans had become a major political issue.\n\nWhy would someone have bought an engraving of an elderly man they didn’t know? Many people collected engravings, which was one of the few ways people could enjoy fine art before art museums and generously illustrated art books became common. This engraving would have appealed to people who felt strongly about the pension issue and people whose fathers or grandfathers were Revolutionary War veterans. Do you think Joseph Winter received a pension under the Pension Act of 1818? Why or why not? If Winter had been receiving a pension under the 1818 law, he probably wouldn’t have been homeless. While we don’t know for sure, he was probably a veteran of the militia or the Pennsylvania Associators—private, voluntary military units formed during the Revolutionary War. Such veterans were not eligible for pensions under the act of 1818. Also, if Winter had received a pension under the act of 1818, he would have a pension file in the National Archives like Chatham Freeman. He does not.\n\nAssessment and Demonstration of Student Learning\n\nOn De­cember 28, 1831, Representative Henry Hubbard of New Hampshire introduced a bill in the House of Representatives to extend pensions to all surviving Revolutionary War veterans who had served for at least six months, regardless of whether they served in the Continental Army or Navy, with state regiments, or in the militia. The bill called for each enlisted man who had served for nine months or more to receive ninety-six dollars a year, and those who served six to nine months to receive sixty-four dollars a year. The bill also called for ending the condition imposed by the Pension Act of 1818 that veterans prove their poverty to qualify for a pension. Under the proposed law, financial need was no longer a consideration.\n\nOpponents worried that such a pension system would be too costly. Others thought that the federal government would end up paying pensions to men who were perfectly able to take care of themselves, and those who had been enrolled in their local militia during the Revolutionary War but never marched away from home or risked their lives in the common cause. The highlight of debate was Hubbard’s speech introducing the measure. After debate, the bill passed the House of Representatives 126-48 and the Senate 24-19. President Jackson signed the bill into law on June 7, 1832.\n\nAsk students to read the selections from Hubbard’s speech included with the Materials and Resources, and then write a brief paper, summarizing Hubbard’s arguments on the following points:\n\nRevolutionary War veterans of state regiments and militia are just as deserving of our gratitude as Continental Army; Revolutionary War veterans should not be required to show financial need to qualify for a pension; and Providing pensions to Revolutionary War veterans is not an act of charity. It is, in fact, the payment of a just debt.\n\nAfter summarizing Hubbard’s arguments, explain in brief how the Pension Act of 1832 reflected changing attitudes toward ordinary people and the the increasingly democratic character of American life in the 1820s and 1830s.\n\nRevolutionary Achievements Category\n\nNational Identity, Our Highest Ideals\n\nExploring the Revolutions Category\n\nThe Legacy of the Revolution\n\nRead More about Revolutionary War Veterans\n\n\n\nRead about other African American Revolutionary War veterans in The Elusive Peter Hunter and The Heroic Jeffrey Brace. These essays make excellent class reading assignments, especially in connection with this lesson’s work on the pension application of Chatham Freeman.\n\nRead more about homeless veteran Joseph Winter in Joseph Winter, Lone Wanderer.\n\nThis lesson is based on our exhibition America’s First Veterans, and on the book America’s First Veterans, published by the American Revolution Institute in November 2020."}]}