{"Dawn Landes collaborated with Sufjan Stevens.": [{"url": "https://www.pastemagazine.com/music/dawn-landes/dawn-landes-meet-me-at-the-river-review", "page_content": "As someone whose past musical collaborations have included Sufjan Stevens, Norah Jones and Bon Iver, a straight-ahead, retro-country sound would appear to be an interesting turn for TED-talk giving, Brooklyn-living, Dawn Landes. But Kentucky roots, a move from her longtime home of New York to Nashville and the impressive coup of luring Country Music Hall of Fame producer Fred Foster (Dolly Parton, Merle Haggard, Kris Kristofferson) out of retirement give some bonafide credo to Landes’ fifth LP, Meet Me At The River.\n\nEven with Foster at the helm and an impressive line-up of veteran country session men, the more eclectic pockets of Landes sound comes through on the opening cuts. “Meet Me At The River” is more folk-country with its ambling, pastoral quality, before “Traveling” eases us into what’s to come. Even with slightly eye-roll lyrics like “I’m not looking for a pot of gold / Not needing a hand to hold,” the introduction of the familiar country soundscape—twangy pedal steel and production infused with all the warmth of southern hospitality—carries Landes through.\n\nShe has a clear, bright and gentle voice—that classic country, bluebird tone—which lilts delicately over the music, even when she’s delivering a heartier tune like “Why They Name Whiskey After Men.” A jaunty, achy-breaky-type tune delivered with a wink and a stiff pour, lines like “Comes on strong and keeps you warm / Before it starts to do you in,” transporting you to a friendly, 70s honky-tonk.\n\nIt’s here that things take a dip. “Old Memories” is a semi-forgettable ballad, and “Wind and Rain” for all it’s heart is a song for Nashville moms in nice SUVS—soothing, not unpleasant, but nothing exceptional here. It’s not until “Southern Girl” (though it’s all about troublesome, Southern men) that Landes wins your attention back with some of her best writing. “Bad boys / handsome as sin / Think I gotta stay away / Lord please / Send me a man / Who’s not too proud to pray,” she sings over a stomping rhythm, sound doubtful as she adds, “Do you still make them that way?”\n\n“My Church” and “What Is The Color Of The Soul Of Man” round out the album with some political conscience. The first, a very kumbaya, all-inclusive, love-your-neighbor country-waltz that sounds exactly like what some forward-thinking countrypolitan who heard his first Bob Dylan tune would write back in the late ‘60s. The second is the only track of the album with some real fire behind it, the vengeful strings and hard-drive backing up the song’s anti-prejudice message.\n\n“I Don’t Dance,” a track featuring vocals from octogenarian country legend Bobby Bare, attempts to end things on a charming and light-hearted note, but winds up sound forced and silly. A fitting end to what proves to be an uneven album. While Landes’ is lovely at best and boring at worst, the real disappointment here is the excitement caused by Foster’s production work, which, sadly, doesn’t quite deliver.\n\nWatch Dawn Landes’ 2018 Paste studio session below:"}, {"url": "https://www.sagamusic.com/artists/dawn-landes/", "page_content": "Dawn Landes (born December 5, 1980) is an American singer-songwriter and musician. She is originally from around Louisville, Kentucky but spent many years living and performing in Brooklyn, New York. As a recording artist she has released five full-length albums: dawn’s music (2005), Fireproof (2008), Sweetheart Rodeo (2010), Bluebird (2014) and Meet Me At The River (2018) as well as five EPs: Straight Lines (2006), Two Three Four (2006), Mal Habillée (2012), Covers EP (2014) and Desert Songs (2015). In support of her releases, Landes has toured extensively in the US, Europe and around the world, often sharing the stage with artists such as Ray Lamontagne, Feist, Andrew Bird, José González, The Weakerthans, Midlake, Suzanne Vega, and Sufjan Stevens.\n\nAs an instrumentalist, she has toured as part of New York City American roots music band Hem. and Sufjan Stevens’ touring band (2015-2016). A producer and engineer, she worked at Stratosphere Sound in New York City and at Philip Glass’ own personal recording studio. In 2007 Landes helped found Saltlands Studio in Brooklyn, NY. She has collaborated with contemporaries like Justin Townes Earle, Will Oldham and Josh Ritter in the studio. Her songs have been featured in popular films and TV shows, including The Good Wife, Bored to Death, Skins, House, Gossip Girl and United States of Tara. She composed original scores for two feature films Blackbird and Familiar Strangers and wrote the end credit song for Savage Grace starring Julianne Moore. Landes has appeared with The American Songbook Series, Boston Pops, TED and in 2012 with the NYC Ballet at the Lincoln Center for the Benjamin Millepied ballet “Two Hearts” singing a ballad entitled “The Brown Girl” as part of composer Nico Muhly’s score.\n\nIn June 2012, she released Mal Habillée, a collection of original French songs in the style of Ye-Ye. It features guest vocals by Matthew Caws (Nada Surf) and Tunde Adebimpe (TV on the Radio) and an interactive ebook with illustrations by the artist Danica Novgorodoff to accompany the text. In February 2014, she released Bluebird which features guest appearances by Norah Jones and others Bluebird won the 2015 14th Annual Independent Music Awards for ‘”Folk/Singer-Songwriter Album of the Year”.\n\nLandes is at work on a musical called ROW with book-writer Daniel Goldstein, under commission from New York Voices. In 2015 she presented a Ted Talk on the musical subject, transatlantic rower, Tori Murden McClure. Landes also performs as a member of all-girl trio The Bandana Splits. Landes was once married to musician Josh Ritter, with whom she also toured."}, {"url": "https://playbookartists.com/artists/dawn-landes", "page_content": "Dawn Landes is a Nashville based singer-songwriter whose music you might have heard if you watch The Good Wife, House or Gossip Girl. Along with releasing six albums since 2005 (and an EP inspired by yé-yé, ‘60s French pop music), she’s a frequent collaborator with contemporaries such as Sufjan Stevens, Norah Jones and composer Nico Muhly. She has appeared with the Boston Pops, the NYC Ballet and on the TED main stage.\n\nPerhaps best-known for her precise songwriting and textured vocals on her previous five albums and five EPs that meld elements of indie rock, alt-country, and folk. Songs such as “Try to Make a Fire Burn Again”, “Bodyguard”, and “Straight Lines” have built her reputation as one of our best independent singer-songwriters.\n\nIn October 2020 Landes released her new album ROW, a collection of songs from the anticipated musical that tells the incredible true story of Tori Murden McClure, the first woman to row solo across the Atlantic Ocean, featuring a collection of songs from her musical ROW and features cameos from Will Oldham, Ben Sollee, Rachel Grimes and other Kentucky-based artists.\n\nThe theatrical recording of ROW was released on Audible in April 2021 and the show will have it’s world premiere on stage summer 2021 at the prestigious Williamstown Theatre Festival."}, {"url": "https://www.yorkpress.co.uk/news/16983916.new-dawn-landes-records-nashville-legend-fred-foster/", "page_content": "Country Music Hall of Fame alumnus Foster, now 86, had produced Dolly Parton’s debut album, Roy Orbison’s biggest hits and some of Landes’ favourite Kris Kristofferson songs.\n\nLatterly, Foster had produced records only sporadically for friends such as Willie Nelson, Merle Haggard and Ray Price.\n\n“He had never heard of me and was surprised that it was going to be my fifth album, though he does keep in touch with music, mainly at the Grammys, so it was kind of fun, a challenge, that I had to win him over,” says 37-year-old Dawn.\n\nYou can hear Landes’ new songs from the resulting Meet Me At The River album at The Basement, City Screen, tomorrow night when she plays York for the first time since 2015.\n\nLandes, a Kentucky-born singer-songwriter long resident in New York, cold-called Foster from a tour with singer-songwriter Sufjan Stevens in New Zealand. Initially, she was concerned that it might feel like “an invasion of privacy, but I think he was delighted by it, and didn’t say ‘No’ outright! I think his exact words were, ‘send me some music and I’ll see if there’s something I can contribute, which was his way of saying ‘maybe’,” Dawn recalls.\n\n“It took a lot of phone calls and snail mail and even driving. I was living in New York at the time [Landes has since re-located to Nashville] and had to drive the 14 hours to Nashville...and that must have impressed him.”\n\nThey duly spent hours in Foster’s Tennessee home; listening to Hank Williams and trading stories as Landes showed off heart-wrenching vocals and expressive songwriting. Foster's semi-retirement was at an end.\n\nLandes arrived for the recording sessions with a set of what she considered to be complete songs. Not so, according to Mr Foster. “He’d say, ‘That one has potential’; ‘this is a possibility’,” she recalls.\n\n“I’ve been thinking about it, and the only other time that something like this happened was when I showed people my lyrics before recording them, and that was when I was at college and every Monday at the Fast Folk songwriters’ exchange everyone would read the Iyrics while I sang the song.\n\n“That was a vulnerable feeling, but I did that when I was 20, at the Fast Folk gatherings at Jack Hardy’s house in Greenwich Village, so that was a good experience to call on.\n\n\"I made sure not to talk politics,\" says Dawn Landes, recalling her recording sessions with legendary producer Fred Foster\n\n“It was in the era ten years after Dylan. Townes Van Zandt, Suzanne Vega, passed through Fast Folk, but by the time I did it, it had morphed into being at Jack’s house.”\n\nShe saw the opportunity to work with Foster as a learning experience. “I learnt so much from him and his sense of judgement,” says Dawn.\n\n\"He'd produced Dolly Parton's first album, but she was much younger than me, a teenager, when she made it, but I was also thinking about Joan Baez's album recorded with Fred in Nashville, working with some great Nashville musicians.\n\n\"He'd worked with her because she'd sung on Kris Kristofferson's recordings – though he didn't like her politics, so I made sure not to talk politics.\"\n\nBrought together largely by Kyle Lehning, Landes recorded Meet Me At River at the Sound Emporium studio with \"the heaviest hitters around\", as she called harmonica player Charlie McCoy, guitarist Steve Gibson, drummer Eddie Bayers, Elvis In Memphis guitarist Bobby Wood, steel guitr player Russ Pahl and bassist Larry Paxton.\n\n\"It was also Kyle's suggestion I should sing a duet [I Don't Dance] with Bobby Bare [the Ohio country singer, now aged 83], but you just had to mention Fred Foster and all these musicians were so excited to work with him again,\" says Dawn.\n\nAlong with her own songs on \"the big themes of life\", from heartbreak and wanderlust to reckoning with youth, she recorded two Jimmy Driftwood covers, The Church and What Is The Color Of The Soul Of Man, as recommended by Foster, who had produced Driftwood's records in the Sixties.\n\n\"Fred introduced me to a whole bunch of older music, mostly from the Monument label, including Jimmy's albums, and I just fell in love with his music,\" says Dawn. \"I think of him as a humanist, a very open soul to the human condition, very sympathetic.\"\n\nReflecting on the experience of recording with Foster, Dawn says: \"I just connected with him and he just seemed like a friend, like my first friend in Nashville, though we were never going to hang out!\"\n\nPlease Please You presents Dawn Landes at The Basement, City Screen, York, tomorrow night (October 16), supported by JF Robitaille & Lail Arad at 8pm. Box office: pleasepleaseyou.com.\n\nDanw Landes: singer, songwriter, producer, engineer, composer of musicals\n\nDid you know?\n\nDawn Landes has recorded five studio albums and five EPs to date. In support of these releases, she has toured extensively in the United States, Europe and around the world, often sharing the stage with artists such as Ray Lamontagne, Feist, Andrew Bird, José González, The Weakerthans, Midlake, Suzanne Vega and Sufjan Stevens.\n\n\n\nAs an instrumentalist, she has toured as part of New York City American roots band Hem and Sufjan Stevens' touring band.\n\nAs a producer and engineer, she has worked at Stratosphere Sound in New York City and at Philip Glass's recording studio. In 2007, she helped to found Saltlands Studio in Brooklyn, New YorkY. She has collaborated with contemporaries Justin Townes Earle, Will Oldham and Josh Ritter in the studio.\n\n\n\nLandes' songs have featured in commercials, ﬁlms and televison shows, such as The Good Wife and House. She has performed with The Boston Pops, NYC Ballet and at a TED Conference in Vancouver, British Columbia, highlighting her forthcoming musical Row.\n\nIf you have never heard her bluegrass cover of Peter Bjorn And John's Young Folks, hurry along to YouTube now.\n\nAlbum review\n\nDawn Landes, Meet Me At The River (Yep Roc) ****\n\nDAWN Landes' journey has taken her from Louisville, Kentucky, to Brooklyn, New York, and now to Nashville, as the 37-year-old singer heads to the Tennessee country capital for a new dawn.\n\nThe big talking point is not so much Dawn's move – she was already a superlative country artist – but her successful request to Country Hall of Fame producer and Monument Records founder Fred Foster to come out of (semi-) retirement in his mid-80s to add to a CV that boasts Dolly Parton's debut, Willie Nelson, Kris Kristofferson, Merle Haggard and Roy Orbison.\n\nWhat's more, this has brought access to Nashville session alumni, such as Elvis's pianist Bobby Wood and even Seventies' country star Bobby Bare for a playful duet on the closing I Don't Dance.\n\nMeet Me At The River and Why They Name Whiskey After Men are instant country classics and two Jimmy Driftwood covers suggested by Foster wholly suit Landes's pure, pure voice. Catch her at The Basement, City Screen, on October 17.\n\nCharles Hutchinson"}, {"url": "https://www.heymanchester.com/dawn-landes", "page_content": "When: 7.30pm on Friday 12 October 2018\n\nWhere: The Eagle Inn, 19 Collier Street, Salford, M3 7DW\n\nWe’re delighted to be working with Dawn Landes for the first time!\n\nDawn Landes is a Kentucky born singer-songwriter now living in Brooklyn, NY. Her fourth and newest album Bluebird features guest appearances by Norah Jones and members of Bon Iver.\n\nShe has toured extensively in the US, Europe and around the world, often supporting artists such as Ray Lamontagne and Bryan Ferry. In the studio she has collaborated with Bonnie “Prince” Billy, Justin Townes Earle and composer Nico Muhly.\n\nHer songs have been featured in commercials, popular ?lms and TV shows, including The Good Wife and House. Landes has performed with The Boston Pops, NYC Ballet and recently at the TED Conference in Vancouver, BC, highlighting her forthcoming musical ROW. In 2015 she was invited to join Sufjan Stevens in his touring band.\n\nDawn recently announced that she has signed with Yep Roc (Grant-Lee Phillips, Josh Rouse, The Sadies, Robyn Hitchcock), who will release her fifth album later this year.\n\nTour support comes from F Robitaille & Lail Arad. A musical correspondence between London’s Lail Arad and Montreal’s JF Robitaille led to a tour of Italy, which led to some co-writing, which led to recording, which led to international radio-play, which led to 42 dates across the UK, Europe and India, which led right back to the studio, which led to The Photograph — the stunning new single from the highly acclaimed songwriters’ forthcoming duo album. In other words, they’re rolling with it.\n\nBuy tickets now. Tickets are available from Vinyl Exchange, WeGotTickets.com, Ticketline.co.uk and on 0871 220 0260.\n\nAttend on: Facebook"}, {"url": "https://www.theguardian.com/music/2020/sep/25/sufjan-stevens-interview-the-ascension", "page_content": "The Oscars were an ordeal for Sufjan Stevens. “Honestly, one of the most traumatising experiences of my entire life,” the songwriter half-laughs, half-groans. The event was, he says, “a horrifying Scientology end-of-year prom” representative of “everything I hate about America and popular culture”.\n\nHe had never paid much attention to them before being nominated in 2018. Mystery of Love – his bittersweet folk ballad, written for Luca Guadagnino’s Call Me By Your Name – was up for best original song and Stevens had been invited to perform. His devoted fans celebrated this appearance as a moment of long-overdue mainstream recognition for the spotlight-shy then-42-year-old; 26 million viewers were watching at home, after all. But for the artist himself, shrinking into his pink-and-black striped blazer as Hollywood A-listers schmoozed around him, there was not much to celebrate. “I didn’t want to have anything to do with that world and that culture,” he says. “I don’t want to be part of any room full of adults hemming and hawing over plastic trophies.”\n\nStevens has spent his career adjusting his work to help avoid such rooms. The Detroit-born composer is an indie household name, with St Vincent, Moses Sumney (both of whom joined him onstage at the Oscars) and the National among his peers. He has fans in hip-hop, too: Kendrick Lamar and Mac Miller have both sampled him, while in 2011, Donald Glover proclaimed himself “the only black kid at the Sufjan concert” in a verse from Fire Fly telegraphing his sensitivity.\n\nFor your consideration … Stevens performs at the Oscars with St Vincent. Photograph: Chris Pizzello/Invision/AP\n\nBut every time Stevens has edged too close to the precipice of mainstream success, he has reacted by releasing something challenging or fogged in darkness. After his 2003 breakthrough Michigan, full of bouncy chamber-pop, came an album of sparse folk meditations (2004’s Seven Swans) themed to his Christian faith. When 2005’s Illinois topped many publications’ album-of-the-year lists, propelled by its anthemic single Chicago, he swerved again, releasing an avant-garde multimedia work about a graffiti-splattered highway (2009’s The BQE) and a paranoid electronic opera (2010’s The Age of Adz). “It’s never a rebellious thing; I’m always just ready to do something new,” he says cheerily, sporting a salt-and-pepper beard of late, but with the same boyish, scout-leader good looks he emerged with for his woodsy, self-recorded 1999 debut A Sun Came. “I don’t need to be famous or sell millions of records. There’s never a conversation with myself about how I’m advancing my profile.”\n\nStevens’s latest and perhaps boldest work, The Ascension, is another exercise in changing direction after a brief flirtation with fame. His 2015 album Carrie and Lowell was a bare-bones exploration of grief, inspired by the death of his mother, and hailed as Stevens’s greatest achievement yet. Rather than more of the same, its follow-up is a beautiful, scuffed electropop album that swaps Carrie and Lowell’s introspection for outward-looking lyrics, grappling with an American culture he perceives as up in flames. “I wanted to respond to changes in the political climate and changes in human engagement, influenced by the internet and technology,” he says.\n\nOn The Ascension’s lead single, America – pointedly released on Independence Day – Stevens sings solemnly: “I’m ashamed to admit I no longer believe.” It is a far cry from the artist who once famously planned to write an album about every state in America – an intention later abandoned and written off as a joke. It was believable at the time because his songs frequently resembled celebrations of Americana, constantly invoking its landmarks and former leaders. Since then, his patriotism has become complicated by the advent of “Donald Duck”, as he occasionally calls the current occupant of the Oval Office. “Christ would be ashamed of us all,” he wrote on Tumblr in 2017, after Trump signed an executive order banning people from seven Muslim-majority countries from entering the US. “America, there really is no such thing as an illegal immigrant,” the letter continued. “We are all immigrants and refugees in a wildly changing world, dominated by superfluous boundaries built by blood and war.”\n\nToday, his frustration is even greater, and his perspective somewhat broader: Trump is “a symptom, not the problem” whose presidency is evidence of a deep, foundational rot, he rages. “Remember that ridiculous Hillary Clinton memoir that came out after she lost the [2016 election] race? It was called What Happened. What happened? Shit happened! For centuries and centuries, people were forcibly removed from one continent and shipped to another, where they were forced into free labour, for 400 years!”\n\nExperience makes fools of us all … You start to lose faith in the structures of society as you get older Sufjan Stevens\n\nHe is not sure of the answers: “I’m not a politician or a civil servant or a scientist, I’m just a songwriter.” He is also unsure of how optimistic to be as November’s crucial presidential election approaches: “What gives me hope? Oh God. Diazepam! Lithium!” But Stevens is certain that a Biden win “won’t solve America’s problems alone”, and that the nation’s ills, from police brutality to institutional racism, first require some uncomfortable conversations. “It’s difficult,” he says. “This is many generations’ worth of questions and answers that have stacked up. But we need to show up and do the work.”\n\nThat desire is writ large across Stevens’s recent output. In June 2019, the songwriter released Love Yourself, an EP of songs about “love without conflict, anxiety or self-deprecation” to mark 2019’s Pride month, after decades of what has been interpreted as queer subtext in his songs. On Seven Swans’ To Be Alone With You, Stevens detailed a man who “gave up a wife and family … to be alone with me”. A year later on the Illinois song The Predatory Wasp of the Palisades is Out to Get Us!, his narrator sang of a swim in a lake with a male friend, ending in a gay embrace.\n\nNow 45, Stevens has declined ever to discuss his romantic life publicly, nor this theme in his work, and it is possible these references are non-autobiographical. Regardless, he has amassed a large LGBTQ+ fanbase who celebrated that EP as his most pronounced acknowledgement of gay rights yet, at a time when those rights have been brought dangerously under threat.\n\nIt is this troubled state of the world – coupled with a sense of “having exorcised all my personal grief” on Carrie and Lowell – that has given Stevens this new outlook. “I have a sense of urgency I don’t know I had before,” he says, pointing to The Ascension’s heavy use of declarations and imperatives. Where previously his lyrics were abstract and poetic, his new album is threaded with demands: “Run away with me”; “Make me an offer I cannot refuse”; “Don’t do to me what you did to America”.\n\nThere is a line in America that feels especially poignant. “I have traded my life for a picture of the scenery,” he sings through sorrow, as if repenting for his previous positive mythologising of the US; he claims to feel “disassociated” from his old music today. Does he feel he painted postcards of the US on those tracks, ignoring the darkness? A long sigh floats down the phone line. “Experience makes fools of us all,” he says. “In experiencing so much and growing older, I’ve realised there was definitely a naivety to my former self. There was a hopefulness, joyfulness and playfulness to a lot of those early records that’s been slowly receding over the years. It’s hard for me to speak for it because it’s happened so gradually, like watching a tree grow. But you start to lose faith in the structures of society as you get older, and I think that’s coming to the surface now.”\n\nA picture-postcard America nevertheless played a big part in the actual making of The Ascension. Stevens is today sequestered in the mountains upstate from New York, having moved here 18 months ago after 20 years in the city. “I’ve been coming up here to think and work for the last decade,” he says. “Making the permanent move was a total transformation of my life, my mental health and perspective. I think deep down I’m more of a naturalist. My soul belongs in the wilderness.”\n\nWe’re expected to look good, feel good, do good all the time but insecurity, instability and disorder are built in, too Sufjan Stevens\n\nStevens spent a lot of time in nature as a kid: although he was born in the city, he spent much of his childhood in rural north Michigan, where his “hippy, eccentric” father and stepmother did their best to shield Stevens and his six siblings from what he has described previously as constant looming “domestic and financial disaster”. During these years, the outdoors often beckoned. “It made creating a life in New York when I was older actually quite hard,” he says. “I had to learn to be an urban dweller. It was unnatural to me.”\n\nHe relocated last year, but the uprooting began in 2016 after touring Carrie and Lowell. Kicked out of his Brooklyn studio “for various shitty landlord reasons”, he could only access a drum machine and computer after putting his belongings in storage. “That’s why the nature of this record is so simple: I could only use things I could plug into a computer. My mind was not really in the folk idiom any more. I’d packed my guitars in the storage and I think mentally I’d packed away that aesthetic, too.”\n\nHe does not know whether it was the instruments that led him to the socio-political subject matter of The Ascension or vice versa, but he was aware that the “cold, impersonal, synthetic” sounds he was playing around with and the anxieties swirling around his brain were aligning. “For me, the folk idiom is a great platform for storytelling and narrative,” he says. “There’s something about the mechanics, the ergonomics of the instrument, that’s very personal. It’s very physical, very intimate. So when I write on the guitar or banjo, it feels natural to tell a story. The beats I was constructing when working on my laptop on the other hand felt parallel to a lot of the things I was thinking.”\n\nOne topic on his mind was social media, a technology he says has rewired our interactions as well our democracy. “People start to feel anxiety about who they are and who they feel they ought to be,” he says, “and there becomes a real tension between those things. We’re expected to look good, feel good, do good all the time but insecurity, instability and disorder are built into its system.”\n\nAngelic upstart … Sufjan Stevens performs at the Outside Lands festival in San Francisco, 2016. Photograph: FilmMagic\n\nSocial media has exacerbated “celebrity culture and idol worship”, he says, and “it monetises us, it commodifies human instinct. There’s a loss of identity within that transaction.” Moreover, “systemic racism is nothing new. Corporate greed is nothing new. Political corruption is old as the hills. It’s just now that we’ve built a system in which all of these social diseases are visible and exposed. In some cases, they’re being celebrated and it’s pretty ugly.”\n\nSince completing The Ascension, Stevens has spent lockdown working on new music, which he hints will be another left turn in a career full of them (“I’d love to make another folk album,” he teases). He is not planning a pop crossover like his friend Aaron Dessner of the National, who worked with Taylor Swift on her latest album: “I don’t have the constitution for something like that. If Kanye calls, I’m not home, OK?”\n\nInstead, Stevens’s priority is more music that encourages listeners to “ask questions. I’m actually feeling really good right now because we’re in a moment of crisis and have an incredible opportunity,” he says, nodding to the coronavirus pandemic. “Business as usual was not sustainable. Now’s the moment to get rid of our former consciousness and work on something better. It’s like a rebirth. We need a total born-again experience as a world and society.” Aiming higher than a plastic trophy, then.\n\nThe Ascension is out now on Asthmatic Kitty"}, {"url": "https://www.yeproc.com/yep-roc-records-announces-signing-dawn-landes/", "page_content": ".........................................................\n\nYep Roc Records is excited to announce the signing of Nashville singer-songwriter Dawn Landes. She will release her fifth full length album later this year.\n\nWith roots in both Louisville, Kentucky, and Branson, Missouri, Landes has been attracting ardent fans and critical acclaim since entering New York’s music scene in 2000. Along the way, she has collaborated and toured with Sufjan Stevens, Justin Townes Earle, Feist, Andrew Bird and Norah Jones. Dawn is known for creating music for albums, movies, and television that crosses folk, rock, and alternative genres. She put roots down in her new home of Nashville in the spring of 2017.\n\nHer latest album, 2014’s Bluebird, won the 2015 14th Annual Independent Music Award for ‘Folk/Singer-Songwriter Album of the Year’\n\nBe the first to know about what’s coming next by joining Dawn’s mailing list HERE!"}, {"url": "https://lpr.com/lpr_artists/dawn-landes/", "page_content": "Dawn Landes is a Kentucky born singer-songwriter now living in Brooklyn, NY. Her songs have been featured in commercials, popular films and TV shows (The Good Wife, House, Gossip Girl). Landes tours internationally and has shared the stage with Ray LaMontagne, Bryan Ferry and Suzanne Vega. She has also performed with The Boston Pops, NYC Ballet and recently at TED. Her album “Bluebird” won the 2015 IMA award for Folk/Singer-Songwriter Album of the Year and features guest appearances by Norah Jones and others.\n\n\n\nIn 2015 Landes toured in Sufjan Steven’s band and was a featured artist in Lincoln Center’s American Songbook Series. She is currently at work on “ROW” a new musical under commission from NY Voices and Joe’s Pub/The Public Theater. “ROW” tells the story of Tori Murden McClure’s quest to become the first woman to row across the Atlantic Ocean in 1999.\n\n\n\nHer latest release, the EP Desert Songs is a collaboration with British songwriter Piers Faccini.\n\nOut Jan 15, 2016 (Six Degrees/ Beating Drum).\n\n\n\nThomas Bartlett, piano\n\nTony Scherr , bass\n\nRay Rizzo, drums\n\n\n\nDawn Landes official site\n\nDawn Landes on Facebook\n\nDawn Landes on Twitter\n\nDawn Landes on Youtube\n\nDawn Landes on Instagram"}, {"url": "https://www.meltingvinyl.co.uk/event/dawn-landes/", "page_content": "JF Robitaille & Lail Arad At The Greys Doors 8:00 pm Price £10 + booking fee / £14\n\nWith roots in both Louisville, Kentucky, and Branson, Missouri, Dawn Landes has been attracting ardent fans and critical acclaim since entering New York’s music scene in 2000. Along the way, she has collaborated and toured with Sufjan Stevens, Justin Townes Earle, Feist, Andrew Bird and Norah Jones. Dawn is known for creating music for albums, movies, and television that crosses folk, rock, and alternative genres. She put roots down in her new home of Nashville in the spring of 2017.\n\nThrough four full-length albums, Dawn Landes has blazed her own path with songs that\n\nare as fresh as they are timeless. Still, there’s no mistaking that strains of Nashville\n\nreside in her voice and in her musical soul, and now, with her fifth album, Landes is\n\nfinally bringing them to centre stage.\n\n“Meet Me At The River” is Landes’ self-described “Nashville record,” and she has\n\nassured its pedigree by enlisting the production skills of Fred Foster, the Country Music\n\nHall of Fame member who played a pivotal role in the careers of Dolly Parton, Roy\n\nOrbison, and Kris Kristofferson.\n\n“emotionally raw, delicately crafted songs.” – All Music\n\n“It’s hard not to feel transported.” – Uncut\n\nSupport comes from:\n\nJF Robitaille & Lail Arad\n\nA new collaboration between London-based singer-songwriter Lail Arad and Montreal’s JF Robitaille. After striking up a musical correspondence they went on a tour of Italy, which led to some co-writing, which led to recording, which led to international radio-play, which led to 42 dates across the UK, Europe and India, which led right back to the studio, which led to The Photograph — which will feature on their forthcoming duo album.\n\n"}, {"url": "https://dawnlandesofficial.bandcamp.com/album/meet-me-at-the-river", "page_content": "or more\n\n$16 USD or more\n\nships out within 3 days\n\nIncludes unlimited streaming of Meet Me at the River via the free Bandcamp app, plus high-quality download in MP3, FLAC and more.\n\nDigital Album Streaming + Download\n\nIncludes unlimited streaming via the free Bandcamp app, plus high-quality download in MP3, FLAC and more.\n\nPurchasable with gift card"}], "Dawn Landes collaborated with Will Oldham.": [{"url": "https://genius.com/albums/Dawn-landes/Row", "page_content": "About “ROW”\n\nROW is a concept album about the true-life journey of Tori Murden McClure, the first woman to row solo across the Atlantic Ocean.\n\nLandes teamed up with Broadway veterans Daniel Goldstein, Mary-Mitchell Campbell and Tyne Rafaeli to create ROW, a piece of musical theater seven years in the making that was scheduled to premiere summer 2020 at Williamstown Theater Festival but was postponed due to the pandemic. Based on Tori Murden McClure’s bestselling memoir, “A Pearl in the Storm”, the concept album ROW features eight singers from Louisville, KY (Will Oldham, Ben Sollee and more) – the hometown of both Landes and McClure."}, {"url": "https://www.dawnlandes.com/download-press-pack/", "page_content": "Dawn Landes is an American singer-songwriter and musician originally from Louisville, Kentucky. As a recording artist she has released three full-length albums and toured extensively in the US, Europe and around the world. Performing solo and with her trio, Landes has often shared the stage with artists like Ray Lamontagne, Feist, Andrew Bird and Suzanne Vega. In the studio, she has collaborated with songwriters such as Justin Townes Earle, Will Oldham and Josh Ritter.\n\nHer songs have been featured in popular films and TV shows including Bored to Death, Skins, House, Gossip Girl and United States of Tara. She composed original scores for two feature films Blackbird and Familiar Strangers and wrote the end credit song for Savage Grace starring Julianne Moore.\n\nLandes has appeared with The American Songbook Series, The Boston Pops and in 2012 with the NYC Ballet at Lincoln Center singing a balled entitled “The Brown Girl” as part of composer Nico Muhly’s score. A skilled producer and engineer, she has worked at Stratosphere Sound in New York City and at Philip Glass’ own personal recording studio. In 2009 Landes helped found Saltlands Studio in Brooklyn, NY.\n\nDiscography (Highlights)\n\nYear Artist Album Contribution 2004 Hem Evening Land vocals, engineer 2004 Joseph Arthur Our Shadows Will Remain engineer 2005 Dawn Landes Dawn’s Music writer, producer, singer, engineer 2006 Hem No Word from Tom vocals, glockenspiel, engineer 2006 Hem Funnel Cloud group member, vocals, percussion 2006 Joseph Arthur Nuclear Daydream vocals, engineer 2007 The Earlies The Enemy Chorus vocals 2007 Ben Weaver Paper Sky vocals, production 2008 Dawn Landes Fireproof writer, producer, singer, engineer 2008 Apollo Sunshine Shall Noice Upon the Earth vocals 2009 Doveman The Conformist vocals 2009 Adam Acaragi I Am Become Joy vocals 2009 Dawn Landes Gossip Girl Soundtrack writer, producer, singer, engineer 2010 Dawn Landes Bored to Death Soundtrack writer, producer, singer, engineer 2010 Turner Cody Gangbusters vocals 2010 Josh Ritter So Runs the World Away vocals 2010 Justin Townes Earle Do I Ever Cross Your Mind vocals 2010 Dawn Landes Sweetheart Rodeo writer, producer, singer, engineer 2011 Jolie Holland Pint of Blood engineer 2011 Sondre Lerche Sondre Lerche vocals, engineer 2011 The Bandana Splits Meet the Bandana Splits writer, producer, singer, engineer 2011 Alexi Murdoch Towards the Sun vocals 2012 Dawn Landes Mal Habillée writer, producer, singer, engineer\n\nSongs in Other Media\n\n2005 “Kissing Song” and “You Alone” featured in the film Winter Passing, starring Will Ferrell and Zoey Deschanel.\n\n2007 original musical score for feature film Blackbird starring Gillian Jacobs.\n\n2008 co-written score for feature film Familiar Strangers starring Nikki Reed.\n\n2008 Song “Straight Lines” used in television advertisement for Axe Body spray, and Transport for London in the UK.\n\n2008 “Lullaby for Tony” written for the closing credits of the film Savage Grace, starring Julianne Moore.\n\n2009 “Straight Lines” used in a commercial for Chrysler Town & Country.\n\n2009 “Straight Lines” and “toy piano” used in Showtime series United States of Tara.\n\n2009 The song “Drive” was used in the “Under My Skin” episode of the fifth season of the Fox series House M.D.\n\n2009 The hidden track “I Won’t Back Down”, a cover of Tom Petty, was used for the Human Rights Campaign\n\n2009 The track “Toy Piano” from the album Fireproof was used in an episode of Showtime series Californication\n\n2009 The songs “Romeo” and “Toy Piano” featured in the HBO series Bored to Death.\n\n2010 The track “Twilight” was used in an episode of Holby City.\n\n2010 The track “Mud and Stars” was used in the Australian mini-series Underbelly: A Tale of Two Cities.\n\n2010 “All Dressed in White” was used in the series four premiere of Skins.\n\n2011 co-written song “Sometimes” by The Bandana Splits featured in an episode of HBO series Bored to Death\n\n2011 “Straight Lines” featured at the end of the documentary “When Harry Left Hogwarts” released as special feature in the Blu-ray version of Harry Potter and the Deathly Hallows Part 2."}, {"url": "https://pierredegaillande.com/blogs/pierre-pressure-podcast-5feb3f1b-234f-44a1-ae0e-9c26fb36b781/posts/5534377/ppp-9-dawn-landes", "page_content": "Guest Dawn Landes is talented multi-instrumentalist, singer-songwriter, and producer living in Nashville. We talk about climbing trees with Will Oldham, her touring with Sufjan Stevens, recording with Nashville A-listers, and why bow-hunters are more macho. She performs her original song \"Keep on Moving.\"\n\nOpening music: \"Merchandise\" by Fugazi, performed by Pierre de Gaillande with James Fletcher, drums. \"Keep on Moving\" by Dawn Landes, guitar and vocals. Other songs: \"Sleigh Ride\" by Bandana Splits. \"Toutes Les Belles Inconues\" and \"For What it's Worth\" by Dawn Landes. \"Dark Eyes\" by Will Oldham and Dawn Landes. \"No Shade in the Shadow of The Cross (Live)\" by Sufjan Stevens. End music: \"Lazy Southern Song\" by Melomane.\n\ndawnlandes.com"}, {"url": "https://www.starkult.de/de/artists/landes-dawn", "page_content": "Band: Dawn Landes\n\nAlbum: Meet Me At The River\n\nVÖ: 14.09..2018\n\nLabel: Yep Roc / Bertus Musikvertrieb GmbH\n\nWebsite: www.dawnlandes.com\n\nThrough four full-length albums, singer-songwriter Dawn Landes has blazed her own path with songs that are as fresh as they are timeless. Still, there’s no mistaking that strains of Nashville reside in her voice and in her musical soul, and now, with her fifth album, Landes is finally bringing them to center stage.\n\nMeet Me At The River is Landes’ self-described “Nashville record,” and she has assured its pedigree by enlisting the production skills of Fred Foster, the Country Music Hall of Fame member who played a pivotal role in the careers of Dolly Parton, Roy Orbison, and Kris Kristofferson.\n\n“I knew I wanted to make a record in Nashville,” says Landes, who has been based in New York for most of her music career. “I had this idea of what the sound of Nashville was to me – the countrypolitan sound of the ’50s and ’60s – I thought it would be great to work with someone who was actually a part of that scene, so I went straight to the source.”\n\nBut how does a New York-based artist attract the attention of a Nashville studio icon, now in his eighties, who is keenly selective about any new project? (His most recent production credits, after all, were on albums by Hall of Famers Willie Nelson, Ray Price, and Merle Haggard.)\n\nTwo years ago, Landes first reached out to Foster by phone while she was on tour in New Zealand. Intrigued by her exotic location, Foster recounted “Willie Nelson told me Christ Church, NZ is the most beautiful place on Earth.” He then asked Landes to send him some of her music. “If there’s something I can contribute,” he said, “I’ll let you know.”\n\nWhat Foster encountered was a library of music that has been attracting ardent fans and critical acclaim since Landes entered New York’s music scene in 1999. Raised in Louisville, Kentucky, and Branson, Missouri, Landes cultivated her musical gifts not only through performing and songwriting, but also through learn-by-doing production work that eventually led her to co-owning a recording studio for a time. Over the years, she has collaborated with such contemporaries as Will Oldham, Justin Townes Earle, and Norah Jones, creating music for albums, movies, and television that crosses folk, rock, and alternative genres.\n\nFoster, of course, liked what he heard and soon invited Landes to his Nashville home – a four-hour visit that convinced both they were kindred musical spirits.\n\n“It wasn’t about finding the right studio or finding the right musicians,” she says. “It was about finding somebody who got me and got the music and who I trusted.”\n\nFoster sent Landes off to “study the Hanks” – songwriting legends Hank Williams and Hank Cochran – and she also found inspiration in two other favorites, Dolly Parton and Lucinda Williams. Over the next several months, Landes began to compile original compositions, adding to a songlist she’d already banked in trips to Nashville for co- writing sessions.\n\nThe next step for Landes was to sit down with Foster for lengthy get-togethers that he called “woodshedding” – hours of listening to music, discussing ideas, and finetuning lyrics, all with a side of Foster’s favorite fried pies.\n\n“Artistically, I feel I had a great editor,” Landes says. Foster, she adds, often alluded to Hank Williams’ publisher Fred Rose as the great “song doctor,” and “I feel like that’s what Fred did to my songs. He tuned them, and they’re better for it.”\n\nTen songs written or co-written by Landes made the cut for the album, offering a range of musical moods and attitudes. “How to Say ‘I Love You’” and “I Don’t Dance” (a duet with Bobby Bare) show off Landes’ light touch with melody and lyrics, while “Wind and Rain” and “Southern Girl” are searing testimonies to heartbreak. Landes takes inspiration from classic country themes with “Why They Name Whiskey After Men,” a done-me- wrong song; “Traveling,” an ode to restless wandering; and “Old Memories,” which addresses the bittersweetness of lost love.\n\nFor the title track, “Meet Me at the River,” Landes expresses wistful longings. Turning more inward, she takes on eternal questions with the simple, and simply exquisite, “What Will I Do?” And with “Keep on Moving,” she embraces the tradition of music as political expression, paying tribute to activists and crusaders.\n\nDuring their meetings, Foster also introduced Landes to the work of Jimmy Driftwood, the late American folk singer, songwriter and activist whom Foster produced in the 1960s.\n\nAt one point, Foster simply began reciting the lyrics to Driftwood’s “My Church”: “My church is under the tree/My church is over the sea/and deep in my mind may I always find/My church in the heart of me.”\n\n“It was so moving to me,” she recalls. “I hadn’t even heard what the song sounded like, and I was just floored by the words.”\n\nUltimately, Landes decided to round out the album with “My Church,” as well as Driftwood’s anthem to racial equality, “What Is the Color of the Soul of Man?”\n\nThough Driftwood passed away in 1998, “his music feels very present,” Landes says. “Woody Guthrie and Hank Williams both had that same gift.”\n\nWhen Landes was finally ready to record, Foster recruited Kyle Lehning, who produced Randy Travis’ library of hits, to serve as the album’s sound engineer. Together, they made sure Landes had access to Nashville’s musical riches and its heritage.\n\nMost of the sessions took place at Sound Emporium Studios, the “house” that Hall of Famer “Cowboy” Jack Clement built; over the years, it’s been the home to hits by artists ranging from Merle Haggard and Keith Whitley to Alabama Shakes and Jason Isbell.\n\nFoster and Lehning also called up the cream of Nashville’s “A” list of studio musicians: Country Music Hall of Fame member Charlie McCoy (harmonica); Eddie Bayers, 13- time Academy of Country Music drummer of the year; pianist Bobby Wood, who recorded with Elvis Presley and has played keyboards on all of Garth Brooks’ hits; mandolinist-acoustic guitarist Bobby Terry (Willie Nelson, Dolly Parton, Alison Krauss); acoustic guitarist John Willis (Jason Aldean, Brooks & Dunn, Johnny Mathis); fiddler Larry Franklin (Kenny Rogers, Randy Travis, Shania Twain); pedal steel guitarist Russ Pahl (Blake Shelton, Taylor Swift, Eric Church); pianist Steve Nathan (Tim McGraw, George Strait, Little Big Town). Bass player Larry Paxton (Reba McEntire, Kenny Chesney, Alabama) also served as band leader.\n\nDespite years of working with seasoned New York musicians, Landes was astonished by Nashville’s level of musicianship. “I got together with Larry Paxton one day and played him all the songs once, and he charted them out and we went into the studio,” she recalls. “I sang each song and played acoustic guitar while all the musicians stood in a circle all around me and looked at the charts. Then we played it two, maybe three times and it was done.”\n\nFrom her own years as a producer, she says, “I know how hard that is. It was astonishing. It was magic.”\n\nAll the while, Foster assumed quiet command, sitting in the control booth alongside Lehning. “I felt completely at ease with Fred at the helm,” Landes says. “We rarely disagreed. A few times he asked for a tempo change that seemed extremely slow to me in the moment but felt perfect on playback. Listening back, he’d crack a slight smile or give me a thumbs up, and I knew we were on the right path.”\n\nThe musicians, in turn, “were in awe of Fred,” Landes says. “They obviously revered him and wanted the sessions to go well.” And with so much history in the room, she recalls, “there were so many stories!”\n\nPerhaps the most memorable day of recording came when country legend Bobby Bare arrived to sing their duet, “I Won’t Dance.” Bare, another member of the Country Music Hall of Fame, was Lehning’s choice, but Landes was the one who had to persuade him to participate.\n\n“I drove to his house by myself to play him the song,” she says. “I was just so nervous about that. He was kind of like Fred when I first met him. Bobby had lots of questions, like who are you, and why are you here, and what do you want from me? I sang him the song, and then he said, ‘Play me something else that you wrote.’ I kind of froze, and he said, ‘Well, play me the song you played last at your last show.’ Which means, what’s your best song? So I played him ‘Twilight’ from my album from 2008, and he liked it. And then I played him recordings of a couple of the songs on the new album, and he said, ‘I’m in.’”\n\nOnce in the studio, Bare, Foster and Lehning took their time shooting the breeze and regaling each other with old stories. Once they got down to business, Landes was amazed that Bare joined her in the recording booth with a wad of chewing tobacco in his mouth – definitely not a habit among New York artists. The dialogue song is sprinkled with witty spoken asides by both singers, and Landes guarantees “they were all off the cuff. It was fun, really fun.”\n\nThe album was recorded in two series of sessions about six months apart, and in that time, Nashville had worked its wiles on Landes: She and her husband, composer Creighton Irons, decided to leave New York behind and move to Music City. They put down roots just a couple of months before their daughter, Callan, was born in the spring of 2017.\n\nOriginally determined to make a “Nashville record,” Landes has now become a part of Nashville’s music scene, and she is eager to share the new album, which is set for release in 2018.\n\nLandes set out to create an album with Nashville “authenticity” – and the people she surrounded herself with assured her of that. In the process, they also helped her achieve what has been her goal throughout her music career: her own authentic voice.\n\n“It just feels real,” Landes says of the new music. Yes, it has a country vibe, but is it country? Landes takes her cue from Foster when she talks about genre.\n\nDespite his place in Nashville’s country music history, Foster “doesn’t consider himself country,” Landes says. “He has a unique taste that I think I identify with somehow. He likes all music as long as it’s good music.”\n\nAs she played her music for Foster, she kept asking, “Is it country?” And Foster, ever enigmatic, kept answering, “What country?”"}, {"url": "https://acousticguitar.com/acoustic-guitar-sessions-presents-dawn-landes/", "page_content": "The Brooklyn-based singer-songwriter performs the title track from her latest album and shares how to position a microphone when recording an acoustic guitar.\n\nBrooklyn-based singer/songwriter Dawn Landes performs the title track from her latest album, Bluebird, and shares tips on how to position a microphone when recording an acoustic guitar.\n\nLandes, who grew up in Kentucky and has since relocated to New York, has proven to be one of the more intriguing songwriters of her generation, releasing five full-length albums and two EPs since 2005.\n\nADVERTISEMENT\n\nHaving collaborated with the likes of Justin Townes Earle, Will Oldham, and Josh Ritter, her gorgeous new record, Bluebird, features vocal and piano cameos by Norah Jones.\n\nLook for an upcoming feature on Landes in Acoustic Guitar magazine, and for more information on this talented guitarist and singer, including her current tour schedule, check out her website.\n\nFor more Acoustic Guitar Sessions, check out the archive."}, {"url": "https://www.sagamusic.com/artists/dawn-landes/", "page_content": "Dawn Landes (born December 5, 1980) is an American singer-songwriter and musician. She is originally from around Louisville, Kentucky but spent many years living and performing in Brooklyn, New York. As a recording artist she has released five full-length albums: dawn’s music (2005), Fireproof (2008), Sweetheart Rodeo (2010), Bluebird (2014) and Meet Me At The River (2018) as well as five EPs: Straight Lines (2006), Two Three Four (2006), Mal Habillée (2012), Covers EP (2014) and Desert Songs (2015). In support of her releases, Landes has toured extensively in the US, Europe and around the world, often sharing the stage with artists such as Ray Lamontagne, Feist, Andrew Bird, José González, The Weakerthans, Midlake, Suzanne Vega, and Sufjan Stevens.\n\nAs an instrumentalist, she has toured as part of New York City American roots music band Hem. and Sufjan Stevens’ touring band (2015-2016). A producer and engineer, she worked at Stratosphere Sound in New York City and at Philip Glass’ own personal recording studio. In 2007 Landes helped found Saltlands Studio in Brooklyn, NY. She has collaborated with contemporaries like Justin Townes Earle, Will Oldham and Josh Ritter in the studio. Her songs have been featured in popular films and TV shows, including The Good Wife, Bored to Death, Skins, House, Gossip Girl and United States of Tara. She composed original scores for two feature films Blackbird and Familiar Strangers and wrote the end credit song for Savage Grace starring Julianne Moore. Landes has appeared with The American Songbook Series, Boston Pops, TED and in 2012 with the NYC Ballet at the Lincoln Center for the Benjamin Millepied ballet “Two Hearts” singing a ballad entitled “The Brown Girl” as part of composer Nico Muhly’s score.\n\nIn June 2012, she released Mal Habillée, a collection of original French songs in the style of Ye-Ye. It features guest vocals by Matthew Caws (Nada Surf) and Tunde Adebimpe (TV on the Radio) and an interactive ebook with illustrations by the artist Danica Novgorodoff to accompany the text. In February 2014, she released Bluebird which features guest appearances by Norah Jones and others Bluebird won the 2015 14th Annual Independent Music Awards for ‘”Folk/Singer-Songwriter Album of the Year”.\n\nLandes is at work on a musical called ROW with book-writer Daniel Goldstein, under commission from New York Voices. In 2015 she presented a Ted Talk on the musical subject, transatlantic rower, Tori Murden McClure. Landes also performs as a member of all-girl trio The Bandana Splits. Landes was once married to musician Josh Ritter, with whom she also toured."}, {"url": "https://www.celebsagewiki.com/dawn-landes", "page_content": "Age, Biography and Wiki\n\nDawn Landes was born on 5 December, 1980 in Louisville, Kentucky, United States, is an American singer-songwriter and musician. Discover Dawn Landes's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 42 years old?\n\nPopular As N/A Occupation N/A Age 42 years old Zodiac Sign Sagittarius Born 5 December 1980 Birthday 5 December Birthplace Louisville, Kentucky, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 5 December. She is a member of famous Songwriter with the age 42 years old group.\n\nDawn Landes Height, Weight & Measurements\n\nAt 42 years old, Dawn Landes height not available right now. We will update Dawn Landes's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Dawn Landes's Husband?\n\nHer husband is Josh Ritter (m. 2009–2011)\n\nFamily Parents Not Available Husband Josh Ritter (m. 2009–2011) Sibling Not Available Children Not Available\n\nDawn Landes Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Dawn Landes worth at the age of 42 years old? Dawn Landes’s income source is mostly from being a successful Songwriter. She is from United States. We have estimated Dawn Landes's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Songwriter\n\nDawn Landes Social Network\n\nTimeline"}, {"url": "https://www.howold.co/person/dawn-landes/biography", "page_content": "Dawn Landes Biography\n\nAmerican singer-songwriter\n\nMusical artist\n\nDawn Landes (born December 5, 1980) is an American singer-songwriter and musician. She is originally from around Louisville, Kentucky but spent many years living and performing in Brooklyn, New York. As a recording artist she has released five full-length albums: dawn's music (2005), Fireproof (2008), Sweetheart Rodeo (2010), Bluebird (2014) and Meet Me At The River (2018) as well as five EPs: Straight Lines (2006), Two Three Four (2006), Mal Habillée (2012), Covers EP (2014) and Desert Songs (2015). In support of her releases, Landes has toured extensively in the US, Europe and around the world, often sharing the stage with artists such as Ray Lamontagne, Feist, Andrew Bird, José González, The Weakerthans, Midlake, Suzanne Vega, and Sufjan Stevens.\n\nAs an instrumentalist, she has toured as part of New York City American roots music band Hem. and Sufjan Stevens' touring band (2015-2016). A producer and engineer, she worked at Stratosphere Sound in New York City and at Philip Gl*' own personal recording studio. In 2007 Landes helped found Saltlands Studio in Brooklyn, NY. She has collaborated with contemporaries like Justin Townes Earle, Will Oldham and Josh Ritter in the studio. Her songs have been featured in popular films and TV shows, including The Good Wife, Bored to Death, Skins, House, Gossip Girl and United States of Tara. She composed original scores for two feature films Blackbird and Familiar Strangers and wrote the end credit song for Savage Grace starring Julianne Moore. Landes has appeared with The American Songbook Series, Boston Pops, TED and in 2012 with the NYC Ballet at the Lincoln Center for the Benjamin Millepied ballet \"Two Hearts\" singing a ballad en*led \"The Brown Girl\" as part of composer Nico Muhly's score.\n\nIn June 2012, she released Mal Habillée, a collection of original French songs in the style of Ye-Ye. It features guest vocals by Matthew Caws (Nada Surf) and Tunde Adebimpe (TV on the Radio) and an interactive ebook with illustrations by the artist Danica Novgorodoff to accompany the text. In February 2014, she released Bluebird which features guest appearances by Norah Jones and others Bluebird won the 2015 14th Annual Independent Music Awards for '\"Folk/Singer-Songwriter Album of the Year\".\n\nOn October 2, 2020, Landes released her latest album,:ROW, featuring the music from the upcoming musical of the same name, written with book-writer Daniel Goldstein, under commission from New York Voices. The album project began with a Ted Talk Landes presented in 2015 on the musical's subject, transatlantic rower, Tori Murden McClure. The album features Will Oldham, Rachel Grimes, and Ben Sollee. The show was originally set to premiere in the summer of 2020 at the Williamstown Theatre Festival but was postponed due to the COVID-19 pandemic. The Williamstown Theatre Festival announced a partnership with Audible to release all seven of the productions originally expected to be performed during the 2020 festival.\n\nLandes also performs as a member of all-girl trio The Bandana Splits. Landes was once married to musician Josh Ritter, with whom she also toured. She is now married to songwriter and musician Creighton Irons, with whom she has a daughter, Callan.\n\nDiscography\n\ndawn's music (2005)\n\n(2005) Fireproof (2008)\n\n(2008) Sweetheart Rodeo (2010)\n\n(2010) Bluebird (2014)\n\n(2014) Meet Me at the River (2018)\n\n(2018) ROW (2020)\n\nStraight Lines (2005)\n\n(2005) Two Three Four (2006)\n\n(2006) Mal Habillée (2012)\n\n(2012) Covers EP featuring Jim James (My Morning Jacket) (2014)\n\nfeaturing Jim James (My Morning Jacket) (2014) Desert Songs EP with Piers Faccini (2016)\n\nwith Piers Faccini (2016) My Tiny Twilight (2019)\n\nSongs in other media\n\nTwo of her songs, \"Kissing Song\" and \"You Alone\", are featured in the 2005 film Winter P*ing . \"Kissing Song\" was played during the ending credit.\n\n. \"Kissing Song\" was played during the ending credit. She also contributed a song (Lullaby for Tony) for the closing credits of the 2007 film Savage Grace .\n\n. The song \"Straight Lines\" was used in an episode of the Showtime series United States of Tara . It was also used in a commercial for the Chrysler Town and Country.\n\n. It was also used in a commercial for the Chrysler Town and Country. \"Straight Lines\" was also used in a television adverti*t for Transport for London in the UK.\n\n\"Straight Lines\" was also used at the end of the do*ental \"When Harry Left Hogwarts\" released as special feature in the Blu-ray version of Harry Potter and the Deathly Hallows – Part 2 .\n\n. The song \"Drive\" was used in the \"Under My Skin\" episode of the fifth season of the Fox series House M.D.\n\nThe hidden track \"Won't Back Down\", a cover of Tom Petty, was used for a Human Rights Campaign video supporting the repeal of Proposition 8.\n\nThe track \"Toy Piano\" from the album Fireproof was used in an episode of Californication and Bored to Death .\n\nwas used in an episode of and . The track \"Twilight\" from the album Fireproof was used as incidental music in an episode of Holby City .\n\nwas used as incidental music in an episode of . The track \"Mud and Stars\" was used in the fifth episode of the Australian mini-series Underbelly: A Tale of Two Cities .\n\n. \"All Dressed in White\" was used in the series four premiere of Skins .\n\n. Landes has scored two feature films, Blackbird (2007) and Familiar Strangers (2008).\n\n(2007) and (2008). The song \"Home\" was featured on the CBS series The Good Wife.\n\nReferences\n\nExternal links\n\nOfficial homepage\n\nOfficial MySpace page\n\nNo Depression Town and Country Featured Artist\n\nThe Bandana Splits Facebook Page\n\nDawn Landes at TED\n\ndawn Landes discography at Discogs\n\n\n\nAlbumsEPsLandes on stage accompanied by Justin Townes Earle in Nashville, Tennessee in 2010Landes in September 2014, posing in Chicago after the debut concert of Bryan Ferry's North American stop of his World Tour 2014, for which she was the special guest (opening act)"}, {"url": "https://taisawards.com/inpage/dawn-landes-434/", "page_content": "Dawn Landes — Meet Me at the River (August 10, 2018)\n\nDawn Landes — Meet Me at the River (August 10, 2018)\n\n♠ Missouri~born, Louisville, Kentucky~raised singer and songwriter who is also an in~demand sound engineer. Dawn Landes is a singer~songwriter now living in Nashville, TN. She has released multiple albums and her songs have been featured in commercials, popular films, and TV shows. Landes tours internationally and has performed with The Boston Pops, NYC Ballet, and at TED.\n\nBorn: December 5, 1980 in Branson, MO\n\nGenre: Americana\n\nStyles: Contemporary Singer~Songwriter, Americana, Bluegrass\n\nLocation: Nashville, TN\n\nAlbum release: August 10, 2018\n\nRecord Label: Yep Roc Records\n\nDuration: 36:46\n\nTracks:\n\n01. Meet Me at the River 3:36\n\n02. Traveling 3:16\n\n03. Why They Name Whiskey After Men 3:28\n\n04. Old Memories 3:21\n\n05. Wind and Rain 3:27\n\n06. What Will I Do 2:49\n\n07. Southern Girl 2:22\n\n08. How to Say ‘I Love You’ 2:28\n\n09. Keep On Moving 3:09\n\n10. My Church 3:06\n\n11. What Is the Color of the Soul of Man 2:36\n\n12. I Don’t Dance (feat. Bobby Bare) 3:08\n\n℗ 2018 Yep Roc Records\n\n• Kolekce dvanácti skladeb vychází z nečekaného partnerství s legendou Nashville Fredem Fosterem, jehož seznam producentských kreditů zahrnuje „Hey Pretty Woman“ od Roy Orbisona, debutové album Dolly Parton a Kris Kristoffersonovo #1 ‘Jesus Was A Capricorn’. Spolupráce s Country Music Hall of Famer nebyla pro Landes daleko od předvídatelného kroku, jejíž předchozími spolupracovníky byli Sufjan Stevens, Nico Muhly, Norah Jones, Will Oldham a Andrew Bird. Navzdory tomu, že se Landes a Foster vynořili jako hudebně nesourodý pár, přinesli to nejlepší ze svých příslušných světů. A tak došlo na setkání v Meet Me at the River, čímž vytvořili něco, čeho by se konvenční umělecké partnerství snad ani nikdy nedotklo. Na tomto albu Landes oživila pár ztracených drahokamů od písničkáře Jimmyho Driftwooda, Fosterova spolupracovníka z 60. let 20. století. Jeho politicky nabitá „What Is The Color Of The Soul of a Man“ pookřála v rukou Landes obzvláště hmatatelně, dokonce i navzdory 55 let od jejího prvního vydání.\n\n• Meet Me At The River is Landes’ self~described „Nashville record“, and she has assured its pedigree by enlisting the production skills of Fred Foster, the Country Music Hall of Fame member who played a pivotal role in the careers of Dolly Parton, Roy Orbison, and Kris Kristofferson. Two years ago, Landes reached out to Foster, and a four~hour visit to his Nashville home convinced both they were musical kindred spirits. With roots in both Louisville, Kentucky, and Branson, Missouri, Landes has been attracting ardent fans and critical acclaim since entering New York’s music scene in 2000. Along the way, she has collaborated with such contemporaries as Sufjan Stevens, Justin Townes Earle, and Norah Jones, creating music for albums, movies, and television that crosses folk, rock, and alternative genres.\n\n• In Her Words: „I was lucky enough to work with the legendary producer Fred Foster for my new record. Fred has been making hits for most of his 87 years. Merle Haggard once said, 'he lives in the songs.’ He does, he’s there in ‘Pretty Woman’ and ‘Me and Bobby McGee’ and Dolly Parton’s first hit, ‘Dumb Blonde.’ I learned so much working with Fred on this record and I’m really proud of it. Some of my favorite lessons were: * ‘Keep it conversational.’ If you can speak the lyric and it reads, it’s all the morepowerful. * ‘A great song can be sung by anyone in any style and any meter.’ He learned this from the great publisher Fred Rose, who sat at a piano and played him Hoagy Carmichael’s „Starlight“ in its popular form, then in 3/4 time, then in a Western swing style. They all worked. * ‘The feel is the thing. If you’re in the wrong tempo you won’t have the feel.’ The drummer Eddie Bayers who played on the album has said that Fred sets the best tempos of anybody. I believe it. We recorded everything in Nashville with the heaviest hitters around: Kyle Lehning, Charlie McCoy, Steve Gibson, Bobby Wood, Eddie Bayers, Russ Pahl, Larry Paxton, Larry Franklin and more.“ — Dawn Landes\n\nAlbums:\n\n♠♠ dawn’s Music (2005)\n\n♠♠ Two Three Four (2006)\n\n♠♠ Fireproof (2008)\n\n♠♠ Sweetheart Rodeo (2010)\n\n♠♠ Bluebird (2014)\n\n♠♠ Meet Me at the River (2018)\n\nEP:\n\n♠♠ Straight Lines (2005)\n\n♠♠ Mal Habillée (2012)\n\nReview\n\nBy Josh Weinberg, Published Aug 07, 2018. Score: 8\n\n• Good storytelling and country music are meant to go together. For singer~songwriter Dawn Landes, the results make for one impressive collection on Meet Me at the River. Her teaming with legendary Nashville producer Fred Foster may seem unorthodox, but it works to perfection. Plenty of slide guitar and clap~along beats soundtrack Landes’s beautiful delivery.\n\n• Landes chronicles a much~needed excursion on „Traveling“ — wanting to see the sun rise over Graceland and explore wherever the road of life takes her. The opening harmonica solo and organ breakdown on „Why They Name Whiskey After Men“ spices up a song comparing men to alcohol (because it’s true, they can both taste good and leave a lot of pain afterwards).\n\n• Providing backup for Landes on this record is an absolute A~team of musicians, from the stomp~clap rhythm of „Keep On Moving“ to an excellent acoustic guitar line to the superb cover of Johnny Driftwood’s „What Is the Color of the Soul of a Man.“ It’s the closest to blues this record gets, and worth every second.\n\n• The best example of what this album does, however, is on „What Will I Do,“ a beautiful song, complete with harmonious backing vocals. A song about pondering risk v. reward, but „only the moon and stars can know“ what is right. It’s clear that Dawn’s songwriting is one of her many strengths, as Meet Me at the River is only too proud to showcase.\n\n• https://exclaim.ca/\n\nWebsite: http://www.dawnlandes.com\n\nLabel: http://westernvinyl.com/\n\nMySpace: https://myspace.com/dawnlandes\n\nFacebook: https://www.facebook.com/dawnlandes\n\nInstagram: https://www.instagram.com/dawnlandes/\n\nYouTube: https://www.youtube.com/user/FunMachineMusic\n\n_____________________________________________________________"}, {"url": "https://circuitsweet.co.uk/2014/03/dawn-landes-announces-uk-tour-dates%E2%80%8F/", "page_content": "“… it’s hard not to feel transported” Uncut 8/10\n\n“This is deceptively simple music that packs a real punch” Evening Standard 4/5\n\n“this is the sound of a woman getting clear and moving on, and letting everyone know she’s in a better place for living it, and for singing it” The Line Of Best Fit\n\nDawn Landes\n\n\n\nUK live dates announced for May 2014\n\nNew album Bluebird out now via Western Vinyl\n\nBrooklyn based artist Dawn Landes will return to the UK in May in support of her recently released, critically acclaimed new album Bluebird. Dawn will perform two shows in Manchester and London this May, before a full UK tour later this year.\n\nFollowing tours with the likes of Midlake, Ray Lamontagne, Feist and ex-husband Josh Ritter, Dawn will perform tracks from her back-catalogue with a full band at these headline shows, beginning on May 30th.\n\nAn emotional journey, Bluebird (out now via Western Vinyl) is perhaps Dawn’s most personal album yet. Often heart-wrenching, yet full of reflection and hope, it has thus far seen fantastic reviews from the likes of the Sunday Times, Evening Standard and Uncut, as well as tracks being supported by BBC 6Music.\n\nLandes has previously collaborated in the studio with contemporaries like Will Oldham, Justin Townes Earle and Bonnie “Prince” Billy, while also appearing with The American Songbook Series, Boston Pops and with the NYC Ballet at Lincoln Center, singing as part of composer Nico Muhly’s score.\n\nStream ‘Try To Make A Fire Burn Again’\n\nTickets are now on sale for the following shows:\n\nFri May 30th The Lexington, London TICKETS\n\nSat May 31st Soup Kitchen, Manchester TICKETS"}], "Dawn Landes collaborated with Iron & Wine.": [{"url": "https://www.ted.com/speakers/dawn_landes", "page_content": "Dawn Landes, with her bright, supple voice and her restless imagination, is drawn to create and collaborate. A master of singer-songwriter pop, she is now writing a musical called \"Row.\"\n\nWhy you should listen Dawn Landes is a singer-songwriter whose thoughtful music you might have heard if you watch Bored to Death, House, Gossip Girl or The Good Wife. Along with releasing five albums since 2005 (and an EP inspired by yé-yé, ‘60s French pop music), she’s a frequent collaborator with contemporaries such as Bonnie “Prince” Billy, Norah Jones and composer Nico Muhly.\n\n\n\nShe has appeared with the Boston Pops and the NYC Ballet and in Lincoln Center’s prestigious American Songbook Series, and spent the summer of 2014 working on a musical about fellow Louisville native Tori Murden McClure’s quest to become the first woman to row across the Atlantic Ocean."}, {"url": "https://music.douban.com/musician/101658/", "page_content": "Samuel Beam，艺名Iron & Wine，独立民谣时代的都市乡愁。美国民谣摇滚原创歌手。他已经发行了4张录音专辑，若干密纹唱片和单曲，以及一些网络下载作品。其中还包括一张其在2005年波纳罗音乐节上表演的现场版录音。Beam在南加州长大，之后移居到福罗里达上学，但现居德州奥斯丁郊外。这个大器晚成的男人成名之前是一名电影老师。Iron & Wine其实是Samuel Beam一个人的乐队，或者说，只不过是他的艺名。这个名字源自于他在拍摄一部电影时在一家杂货店发现的饮食补充剂“Beef Iro... (展开全部) Samuel Beam，艺名Iron & Wine，独立民谣时代的都市乡愁。美国民谣摇滚原创歌手。他已经发行了4张录音专辑，若干密纹唱片和单曲，以及一些网络下载作品。其中还包括一张其在2005年波纳罗音乐节上表演的现场版录音。\n\n\n\nBeam在南加州长大，之后移居到福罗里达上学，但现居德州奥斯丁郊外。这个大器晚成的男人成名之前是一名电影老师。Iron & Wine其实是Samuel Beam一个人的乐队，或者说，只不过是他的艺名。这个名字源自于他在拍摄一部电影时在一家杂货店发现的饮食补充剂“Beef Iron & Wine”。\n\n\n\nIron and Wine的音乐风格包括蓝草和另类乡村的根基，田园牧歌般的沉思默想，从某种程度上与Nick Drake、Sparklehorse遥相呼应。以诗意隽永的语言表达极为个人化的生活感受，思想的内向性、深刻性让人想起Conor Oberst和Elliot Smith的都市民谣。\n\n\n\n“在我大量接受采访之前，我从来没有考虑过如何给我的音乐归类”，Beam说道，“我想我喜欢‘民谣’这个标签。我最近意识到民谣是除了古典音乐之外的一切音乐，无论说唱还是摇滚乐都一样，民谣就是来自民间的音乐。”"}, {"url": "https://acousticguitar.com/acoustic-guitar-sessions-presents-dawn-landes/", "page_content": "The Brooklyn-based singer-songwriter performs the title track from her latest album and shares how to position a microphone when recording an acoustic guitar.\n\nBrooklyn-based singer/songwriter Dawn Landes performs the title track from her latest album, Bluebird, and shares tips on how to position a microphone when recording an acoustic guitar.\n\nLandes, who grew up in Kentucky and has since relocated to New York, has proven to be one of the more intriguing songwriters of her generation, releasing five full-length albums and two EPs since 2005.\n\nADVERTISEMENT\n\nHaving collaborated with the likes of Justin Townes Earle, Will Oldham, and Josh Ritter, her gorgeous new record, Bluebird, features vocal and piano cameos by Norah Jones.\n\nLook for an upcoming feature on Landes in Acoustic Guitar magazine, and for more information on this talented guitarist and singer, including her current tour schedule, check out her website.\n\nFor more Acoustic Guitar Sessions, check out the archive."}, {"url": "https://www.sagamusic.com/artists/dawn-landes/", "page_content": "Dawn Landes (born December 5, 1980) is an American singer-songwriter and musician. She is originally from around Louisville, Kentucky but spent many years living and performing in Brooklyn, New York. As a recording artist she has released five full-length albums: dawn’s music (2005), Fireproof (2008), Sweetheart Rodeo (2010), Bluebird (2014) and Meet Me At The River (2018) as well as five EPs: Straight Lines (2006), Two Three Four (2006), Mal Habillée (2012), Covers EP (2014) and Desert Songs (2015). In support of her releases, Landes has toured extensively in the US, Europe and around the world, often sharing the stage with artists such as Ray Lamontagne, Feist, Andrew Bird, José González, The Weakerthans, Midlake, Suzanne Vega, and Sufjan Stevens.\n\nAs an instrumentalist, she has toured as part of New York City American roots music band Hem. and Sufjan Stevens’ touring band (2015-2016). A producer and engineer, she worked at Stratosphere Sound in New York City and at Philip Glass’ own personal recording studio. In 2007 Landes helped found Saltlands Studio in Brooklyn, NY. She has collaborated with contemporaries like Justin Townes Earle, Will Oldham and Josh Ritter in the studio. Her songs have been featured in popular films and TV shows, including The Good Wife, Bored to Death, Skins, House, Gossip Girl and United States of Tara. She composed original scores for two feature films Blackbird and Familiar Strangers and wrote the end credit song for Savage Grace starring Julianne Moore. Landes has appeared with The American Songbook Series, Boston Pops, TED and in 2012 with the NYC Ballet at the Lincoln Center for the Benjamin Millepied ballet “Two Hearts” singing a ballad entitled “The Brown Girl” as part of composer Nico Muhly’s score.\n\nIn June 2012, she released Mal Habillée, a collection of original French songs in the style of Ye-Ye. It features guest vocals by Matthew Caws (Nada Surf) and Tunde Adebimpe (TV on the Radio) and an interactive ebook with illustrations by the artist Danica Novgorodoff to accompany the text. In February 2014, she released Bluebird which features guest appearances by Norah Jones and others Bluebird won the 2015 14th Annual Independent Music Awards for ‘”Folk/Singer-Songwriter Album of the Year”.\n\nLandes is at work on a musical called ROW with book-writer Daniel Goldstein, under commission from New York Voices. In 2015 she presented a Ted Talk on the musical subject, transatlantic rower, Tori Murden McClure. Landes also performs as a member of all-girl trio The Bandana Splits. Landes was once married to musician Josh Ritter, with whom she also toured."}, {"url": "https://dawnlandesofficial.bandcamp.com/album/meet-me-at-the-river", "page_content": "or more\n\n$16 USD or more\n\nships out within 3 days\n\nIncludes unlimited streaming of Meet Me at the River via the free Bandcamp app, plus high-quality download in MP3, FLAC and more.\n\nDigital Album Streaming + Download\n\nIncludes unlimited streaming via the free Bandcamp app, plus high-quality download in MP3, FLAC and more.\n\nPurchasable with gift card"}, {"url": "https://www.forcefieldpr.com/2021/11/01/rosie-thomas-announces-new-series-lullabies-for-parents-featuring-guest-vocalists-sufjan-stevens-the-shins-the-head-and-the-heart-iron-wine-dawn-landes-david-bazan-alexi-murdoch-an/", "page_content": "Rosie Thomas’ latest endeavor is truly a project, in the truest sense of the word. A labor of love. An attempt to reach out to parents and help them self-sooth. So, what is Lullabies For Parents?\n\n– Lullabies For Parents is a multimedia series of resources, entertainment, and encouragement for parents of all ages featuring music, podcast, videos, essays, assorted content and community that promotes finding common ground, connection, and comfort. -The music portion will be a series of singles – some of Rosie’s strongest, most inspired work to date, with a slew of guest vocalists. Rosie has a LOT of musician friends, and almost all of them will appear on this series, including but not limited to: Sufjan Stevens, James Mercer, Sam Beam, The Head and the Heart, Alexi Murdoch, Dawn Landes, David Bazan, William Fitzsimmons and tons more! -The podcast will finally give a vehicle to some of Rosie’s greatest, and as yet underutilized strengths: her unique ability to quickly disarm, relate to, and encourage people in their struggles, even as they’re entertained by her razor-sharp wit, and engaging, loveable personality. (more on that soon). -There will be videos, essays, books, and a merch line for both parents and kids alike. -Most of all, it will be a community of support, and it’s only just beginning.\n\n***\n\nIt’s never been enough for Rosie Thomas. Not in shallow terms of success or fame, but in her own deeper personal sense of making the most of her life, what she has to offer, and what she wants to lend. Years of following the same well-worn formula of releasing albums (through Sub Pop, Nettwerk, and her own SINGALONG imprint), doing interviews, and going on tour to play those same songs again increasingly left her unsatisfied, bored, and yearning for more.\n\nSo, she began throwing wrenches in the works to see what might shake loose. She first tried opening her own somber, emotionally serious concerts disguised as an unannounced, awkward, neck-braced, coke-bottle-bespeckled comedian named Sheila Saputo, but over time as people became wise to the “alter ego” identity, and the Kaufman-Clifton mystery faded, so did her interest in keeping it up. And while Rosie has always enjoyed making people laugh, dabbling in stand up, opening for Mitch Hedberg, acting opposite Steve Zahn, performing on the UCB stage, or making zany videos to promote a Sufjan Christmas album, she quickly found comedy alone didn’t allow for the earnest emotional connection she began to desire most of all.\n\nAs her years of self-work and personal growth took her from a 20-something with a lot of questions to a more seasoned, more confident grown-up with more to actually lend, she found she had much more desire to talk with people at shows than just sing – thinking, “You can listen to these songs at home. We’re together now. Let’s go further!” But creating an extended break in the set to talk to the crowd, or a handful of one-on-ones after at the merch table just didn’t cut it either.\n\nOnce relocated to NYC, a place where career is pretty much everyone’s sole focus, she wound up spending most of her time in between tours having people over to listen to them, and encourage them in whatever they were going through. But it didn’t stop with friends and acquaintances. When she did phone interviews, she’d spend an hour of a scheduled 30 min call talking about the interviewer’s life, asking them questions, and building them up without even discussing her new album. What an eavesdropper might assume to be a heart-to-heart phone call with an old dear friend would turn on a dime to a billing question, revealing she had been going deep with a random customer service agent the whole time. People at parties, clerks at stores, strangers on the street; it didn’t matter. Rosie had to talk to people. Not just talk, but really connect on a meaningful level, and not waste any time. She wants to find common ground; she wants people to feel understood, to feel less alone, to feel encouraged, and to feel comforted. Even as you read this, she’s bummed somewhere that she can’t ask you questions, and see how you’re doing. How you’re really doing.\n\nRosie has always pulled on heart strings, always made people laugh, always entertained, and always made a unique impact on others – in a way that only she could. Renowned publicist Carla Sacks, once said that Rosie had “one of the most singular voices” she had encountered, and yet Thomas was still searching for how to incorporate all these parts of herself in just the right way.\n\nHaving tried a few tours singing in other people’s bands (Iron & Wine, Sufjan Stevens) and one more solo tour of her last record, Rosie was pretty over it all, and it was clear she needed a change, new inspiration, and a new direction.\n\nThough not necessarily the change she had in mind, change most certainly came.\n\nShe got pregnant, had a baby, left NY, and got busy being a parent. Then she had another one, and got busier still. This continued until she and her husband and creative partner, Jeff Shoop, were outnumbered, and then the inspiration fell into their laps… Or out of her lap, I guess?\n\nHaving been a purveyor of some admittedly sleepy music, it initially seemed an obvious time to make a lullaby album for kids. But as the newly overwhelmed and under-slept mother began writing, she soon realized the songs coming out were ultimately to comfort and soothe herself – the parent. As she’d always done before, Rosie wrote about what was in front of her, processing what she was going through, and what she needed to hear – and so parents themselves became the focus. She figured parents are the ones that need the soothing after all. Help the parents first, so that they can help their own kids. Like putting on your oxygen mask first, before helping those that need assistance – ya know… basically.\n\nAt that point the inspiration floodgates opened wide, and a clarity of vision that Rosie had long sought began to take shape. Through music, videos, a podcast, essays, books, clothing, on and on, there was no shortage of material. Available time to actually work on it? No, yeah, there was a shortage there. They had lots of little kids, and not lots of help, so the two parents would work comically late into the night, or for a highly concentrated week when they could coax grandparents to town. The work was her most inspired and well crafted, but with so many interruptions, also frustratingly slow, snuck in between playtime, playgrounds, nap times, nursing, diaper changes, and then… the pandemic hit – slowing the in-house operation even further while increasing the pressure to get it out to the parents who would need it now more than ever.\n\nSo now at long last, Rosie returns with Lullabies For Parents, a multimedia series of resources, entertainment, and encouragement for parents of all ages featuring music, podcast, videos, essays, assorted content and community that promotes finding common ground, connection, and comfort. Musical contributions throughout the series include Sufjan Stevens, The Shins, Iron & Wine, Alexi Murdoch, Audrey Assad, William Fitzsimmons, Charity Theilen of The Head & The Heart, Kanene Pipkin of The Lone Bellow, Leigh Nash, Denison Witmer, Dawn Landes, Kyshona Armstrong, and more to come.\n\nIn a social media age of putting our best foot forward, presenting the impression of having it together, and perpetuating a false facade that others mistake as some unrealistic standard to aspire to, Rosie wants poop her pants, so everyone knows it’s okay if/when they do – metaphorically or not. That’s closer to a realistic portrayal of actual life than the baloney we see every day. We all have hardships, struggles, and insecurities, but we’re not sure we’re allowed to admit it and show them. But as Rosie often says, “if you don’t say it, who will?”\n\nWell, Rosie is here to say it!\n\nShe’s here to comfort you, to cheer you on, and to remind you It’ll Be Alright.\n\nPress photos by Lindsey Patkos"}, {"url": "https://www.networthlist.org/dawn-landes-net-worth-138723", "page_content": "💰 Dawn Landes Net worth: 13 Million\n\nSome Dawn Landes images\n\nAbout\n\nFolk rock musician who has collaborated with the likes of Andrew Bird, Jose Gonzalez, and Midlake.\n\nBefore Fame\n\nShe moved to New York to study music at New York University.\n\nTrivia\n\nShe frequently played on New York-area college campuses.\n\nFamily Life\n\nShe married and toured with the musician Josh Ritter.\n\nAssociated With\n\nShe has toured with the singer Suzanne Vega."}, {"url": "https://www.famousbirthdays.com/people/dawn-landes.html", "page_content": "About\n\nFolk rock musician who has collaborated with the likes of Andrew Bird, Jose Gonzalez, and Midlake.\n\nBefore Fame\n\nShe moved to New York to study music at New York University.\n\nTrivia\n\nShe frequently played on New York-area college campuses.\n\nFamily Life\n\nShe married and toured with the musician Josh Ritter.\n\nAssociated With\n\nShe has toured with the singer Suzanne Vega."}, {"url": "https://itsbiography.com/Dawn-Landes/", "page_content": "Dawn Landes Wiki – Dawn Landes Biography\n\nDawn Landes is a well-known celebrity from United States of America. So let’s check out Dawn Landes’s personal and public life facts, Wikipedia, bio, spouse, net worth, and career details. Dawn Landes was born in the Louisville, Kentucky in 1980.\n\nBirthName, Nickname, and Profession\n\nSo first, let’s take a look at some personal details of Dawn, like name, nickname, and profession.\n\nReal Name Dawn Landes Nickname Dawn Profession Singer\n\nIt may be possible she has some more nicknames and if you know, make sure you mention them in the comment box.\n\nIf you may want to know more about Dawn, so we also cover other personal details.\n\nThis section will get Dawn’s age, birthday, religion, hometown, food habits, and birthplace details.\n\nAge (2021) 40 Years Birthplace Louisville Date Of Birth December 5, 1980 Sunsign Sagittarius Hometown Louisville Food Habits Not Available Nationality American\n\nDawn Landes was born on December 5, 1980 in Louisville. Dawn age is 40 years as of in 2021 and his birthplace is Louisville.\n\nCurrently, She is living in Louisville, and working as Singer.\n\nBy nationality, She is American, and currently, her food habit is mix vegetarian & non-vegetarian.\n\nShe also worships all the Gods and goddesses and also celebrates all the festivals.\n\nHis hobby is acting. She loves doing acting in movies and shows.\n\nHeight, Weight, And Body Measurements\n\nDawn’s height is Not Available tall and she looks tall when standing with her friends. Though she is a little tall as compared to her friends still she manages to maintain her weight.\n\nHis weight is around Not Available and she always exercises to maintain that. She loves to do exercises regularly and also tells others to do that.\n\nAccording to Dawn, you must have to do exercise regularly to stay fit. her body measurements are not available currently, but we will update them very soon."}, {"url": "https://www.audible.com/pd/Row-Audiobook/B091QFC366", "page_content": "Tori (Grace McLean) aims to be the first woman to row solo across the Atlantic. As a child, she raised her younger brother Lamar (John McGinty), defending him against discrimination and neighborhood bullies. Now, with nothing but her body and a hand-built boat, she squares off with her own tormentor: the ocean. Inspired by A Pearl in the Storm by Tori Murden McClure, this uplifting world premiere musical, directed by Tyne Rafaeli with a book by Daniel Goldstein and music and lyrics by Dawn Landes, interrogates and reveals the resilience, fear, and ambition inside one individual undeterred by the odds.\n\nFor over six decades, Williamstown Theatre Festival, recipient of the Tony Award for Outstanding Regional Theatre and the Commonwealth Award for Achievement, has brought emerging and professional theatre artists together to create a thrilling summer festival of premiere work alongside fresh, new productions of the western canon, accompanying cultural events including COMMUNITY WORKS and Late-Night Cabarets, and readings and workshops of new plays. Under Artistic Director Mandy Greenfield, WTF launched the Andrew Martin-Weber New Play and Musical Commissioning Program, through which theatre artists, including Jocelyn Bioh, Nathan Alan Davis, Halley Feiffer, Justin Levine, Matthew Lopez, Jiehae Park, Benjamin Scheuer, and many others, create new work supported by a year-round play development program. WTF runs unmatched training programs for new generations of theatre talent, and artists and productions shaped at WTF fill theatres in New York, London, and around the country each season. Williamstown Theatre Festival’s productions of The Bridges of Madison County, The Elephant Man, Fool for Love, Living on Love, and The Visit enjoyed critically acclaimed runs on Broadway, with The Elephant Man and The Visit receiving Tony Award nominations for Best Revival of a Play and Best Revival of a Musical, respectively. WTF's world premiere productions of Cost of Living (winner of the 2018 Pulitzer Prize for Drama), Actually, Paradise Blue, and Moscow Moscow Moscow Moscow Moscow Moscow played acclaimed Off-Broadway runs. In the abbreviated 2019-20 theatrical season, Williamstown Theatre Festival was represented or scheduled to be represented on Broadway, Off-Broadway, and regionally by The Sound Inside and Grand Horizons, both of which received Tony Award nominations for Best Play, The Rose Tattoo, Seared, Selling Kabul, Unknown Soldier, and Lempicka. Visit us at www.wtfestival.org.\n\nWilliamstown Theatre Festival would like to thank 321 Theatrical Management, Telsey & Company and DKC/O&M."}]}