{"Joe Walsh joined Warrington in 2019.": [{"url": "https://www.businessinsider.com/who-is-joe-walsh-bio-age-family-key-positions-republican-2019-9", "page_content": "Update: Joe Walsh ended his presidential campaign on February 7, 2020.\n\nWho is Joe Walsh?\n\nCurrent job: Conservative talk radio host.\n\nAge: 57\n\nFamily: Walsh has been married twice. He is currently married to Helene Walsh, who served in the Illinois House of Representatives from 2018 to 2019. Walsh has three children and two step-children.\n\nHometown: North Barrington, Illinois\n\nPolitical party: Republican\n\nPrevious jobs: Congressman, history teacher, political consultant.\n\nCould Joe Walsh win the Republican nomination?\n\nWalsh is running against President Donald Trump and former Massachusetts Gov. Bill Weld for the Republican nomination for president.\n\nNot to put too fine a point on it, but the reality is that Walsh is probably not going to be the Republican nominee for the presidency in 2020. As leader of the Republican Party a candidate like Trump has considerable home-field advantage when it comes to orchestrating the primary process, and the presidency offers unparalleled awareness numbers that Walsh and his rival Weld will not share.\n\nNevertheless, Trump would be remiss to simply dismiss this duo of competitors out of hand. Insider conducted a national SurveyMonkey Audience poll in late April that asked Republicans \"What best describes your view about the prospects for a Republican primary in 2020?\"\n\nAmong respondents who identified as at least slightly conservative, 13% said, \"I would absolutely support a qualified candidate who challenged President Trump in the Republican primary,\" 11% said, \"I would probably support a qualified Republican candidate who challenged President Trump in the primary,\" and 18% said, \"I support the president, however I am open to other qualified Republican primary challengers.\"\n\nPotentially, Walsh or Weld could tap into that 42%. More likely, neither will be able to leverage that into a winning constituency.\n\nWhat are Joe Walsh's policy positions?\n\nOn healthcare: Walsh is a staunch opponent of the Affordable Care Act, known as \"Obamacare,\" and supports repealing the law in favor of a free market system. In 2013, Walsh suggested breaking the law and to \"engage in civil disobedience\" to defy Obamacare in Chicago. While in Congress, Walsh supported several bills that aimed to either repeal Obamacare in its entirety or to strip key aspects of the law. After he was sworn in, Walsh said he would not accept congressional healthcare benefits because it went against his opposition to government-sponsored healthcare. Back in 2010, Walsh opposed government-sponsored health insurance in a Chicago Tribune questionnaire. \"I am opposed to a government sponsored health care system. We need only look to the health care systems in Canada or Great Britain to see evidence of this. I support Republican proposals such as allowing insurance companies to compete across state lines, tort reform, and Medical Savings Accounts to reduce costs. Allowing competition across state lines and eliminating these costly mandates will reduce costs for most people,\" Walsh wrote.\n\nOn immigration: Walsh has long said that immigration is a key issue that he and his listeners care about. Speaking to PBS Newshour's Judy Woodruff in August, Walsh said he would end the Trump administration policy of separating migrant children from their families at the southern border. Walsh also said he would be \"tougher\" on people who try to illegally enter the US, but added that he would allocate more resources toward dealing with asylum cases because those represent legal border crossings. \"It's our responsibility to hear those claims,\" he said.\n\nOn climate change: Walsh previously said the science behind climate change is \"not definitive\" and that the US's economic interests should precede any discussion on combatting climate change. But last month, Walsh criticized Trump for skipping a key G7 meeting about addressing climate change. Walsh told Woodruff he believes human activity impacts climate change. He also criticized the Republican Party for its relative lack of action on the matter, telling Woodruff, \"The Republican Party has to acknowledge it's a problem. This president won't.\"\n\nOn campaign finance/election reform: Walsh has not spoken publicly about his views on campaign finance and election reform.\n\nOn abortion: When he first ran for Congress in 1996, Walsh campaigned on a more liberal platform and said he was in favor of abortion rights. But in 2010, when he ran for a congressional seat as part of the ultra-conservative Tea Party movement, Walsh came out firmly against abortion. In October 2012, Walsh ignited controversy when he said abortion is never medically necessary to save the life of the mother and therefore, such an exception should not exist in abortion laws.\n\nOn LGBTQ rights: Walsh said he is a strong supporter of \"traditional marriage\" and believes \"a marriage can only exist between one man and one woman.\" While he was in Congress, Walsh voted to prevent federal funds from being used in ways that would counteract the Defense of Marriage Act (DOMA). Walsh has called LGBTQ activists \"constitutional terrorists\" and once said that a \"transgender 'man' is a woman.\" He also said Christian vendors should be allowed to turn away LGBTQ customers. Walsh opposes Trump's ban on transgender troops in the military.\n\nOn education: Walsh's congressional campaign website said he advocated for \"market-based solutions to education reform and urban poverty.\" He also ran the Daniel Murphy Scholarship Fund, a privately-funded program in Chicago that gave scholarships to low-income students to help them attend private high schools. He's also raised money for the American Education Reform Council and the Milton and Rose Friedman Foundation, both of which advocate for school choice. Walsh is staunchly opposed to Common Core.\n\nOn guns: When he ran for Congress in 1996, Walsh said he was in favor of gun control. But when he ran as a Republican in 2010, Walsh came out in strong support of the Second Amendment. He co-sponsored the Firearms Interstate Commerce Reform Act, which would have loosened restrictions on interstate gun purchases. In 2018, Walsh said on Sacha Baron Cohen's comedy show, \"Who Is America?\" that he supported a program that would arm children from ages 4 to 12. He later denied he said that, but video footage showed Walsh repeatedly endorsed the program. Walsh supports arming school employees to prevent school shootings, and ending gun-free zones in schools and military bases. The former Illinois congressman lauded gun rights at Business Insider's Republican debate in September. \"I'm a big gun guy. I believe in the Second Amendment, plain and simple. There's no silver bullet to this issue.\"\n\nOn criminal justice reform: Walsh said he supports reforming the criminal justice system but has not detailed any specifics on how he would do it.\n\nOn trade: Walsh supports a free trade system and came out strongly against Trump's trade war with China and his decision to raise tariffs. Walsh has also said Trump is \"clueless\" on trade. At Business Insider's Republican debate, Walsh blasted Trump's trade war and tariffs on China as damaging to the American economy. \"The uncertainty, the hour-by-hour 'where is this president going?' has everybody in the business community on edge. They're not investing, they're not hiring. This is where your slowdown is coming from.\" He also vowed to undo the tariffs if he were elected.\n\nOn foreign policy: Walsh holds strong pro-Israel views. He opposes a \"two-state solution\" and called the idea \"insanity.\" He's advocated for Israel to annex Palestinian territory and for Palestinians to have \"limited voting power\" in the Jewish state. Walsh also once said that American Jews tend to skew liberal and side with Palestine instead of Israel. Walsh has endorsed far-right leaders around the globe, including France's Marine Le Pen, who is notorious for her Islamophobic views. He's also a strong supporter of Indian prime minister Narendra Modi, whom he once referred to as being \"kind of like a Tea Party free market guy in India, which I found very appealing.\" Walsh has harshly criticized Trump for being deferential to Russia and not holding the country accountable for interfering in the 2016 US election. He also frequently spoke out in support of the former special counsel Robert Mueller's Russia investigation.\n\nOn taxes: Walsh is in favor of extending the Bush era tax cuts and abolishing the estate tax. He also favors cutting the capital gains tax and the corporate tax rate.\n\nOn jobs and the economy: Walsh said while he was in Congress that the reluctance of small businesses to hire and an uncertainty on tax policy was what led to joblessness. He's sharply criticized the Occupy movement — which was prominent in 2011 and 2012 — as being made up of \"generally spoiled, pampered, unfocused, clueless young people and a smattering of other people who don't understand this country and are advocating anti-American solutions.\" Walsh also said that anyone who would \"advocate socialist solutions to certain problems in this country ... they don't understand this country.\"\n\n\n\nWhat are Joe Walsh's political successes?\n\nWalsh won a congressional seat in 2010 after an uphill battle facing off against a six-person Republican primary field.\n\nHe's garnered strong support from younger Republicans because of his opposition to the Republican establishment.\n\nHow much money has Joe Walsh raised?\n\nWalsh announced his primary challenge against Trump late last month, so there isn't enough publicly available information on his fundraising. This page will be updated when his campaign releases its numbers for this quarter.\n\nCould Walsh beat the Democratic nominee?\n\nA situation in which Walsh bests sitting president Trump in the primary would doubtless reveal a political talent heretofore invisible in the former congressman. Were he to pull that off, a Democratic contender would certainly have cause for concern. Still, this possibility is fairly remote.\n\nRead more of our stories on Joe Walsh:"}, {"url": "https://www.vox.com/2019/8/27/20833259/walsh-weld-sanford-trump-primary-gop", "page_content": "In April, former Massachusetts Gov. Bill Weld (R) announced his intention to run for the White House and primary President Trump. On Sunday, former Republican legislator (and conspiracy theorist) Joe Walsh announced his plans to do the same, telling George Stephanopoulos, “I’m running because [Trump is] unfit; somebody needs to step up and there needs to be an alternative.” Former South Carolina lawmaker Mark Sanford is widely expected to enter the race as well.\n\nThe three candidates are very different, but they are united by a common theme: Not only do they want to defeat Trump, but they want to defeat the idea of Trump.\n\nSubscribe to Today, Explained Looking for a quick way to keep up with the never-ending news cycle? Host Sean Rameswaram will guide you through the most important stories at the end of each day. Subscribe on Apple Podcasts, Spotify, Overcast, or wherever you listen to podcasts.\n\nWhen we spoke a few weeks ago, Weld said that while he was a “normal” Republican, Trump was a “RINO” — a Republican in name only, a term that at one time was a devastating rejoinder in conservatives circles. Walsh, once an enthusiastic Trump supporter, has since renounced Trump, saying that while “I helped create Trump, there’s no doubt about that,” Trump “represents the absolute worst of us” and must be defeated before he does more damage to the American psyche. And Sanford has decried the Trumpian “cult of personality,” saying that conservative thinkers have long warned against personality-driven politics.\n\nThe problem the two men (and perhaps three, if Sanford jumps in) will face is that Trump is incredibly popular within the Republican Party, no matter his lack of “conservative” bona fides or “normalcy.” In fact, perhaps because of it. The Republican Party these men are dreaming of — of deficit hawks and “normal” conservatism — no longer exists.\n\nThe Joe Walsh strategy: reformed Trumpism\n\nAs detailed by the Washington Examiner, former Illinois Republican legislator Joe Walsh has had a series of political conversions over the past couple of decades:\n\nWalsh, 57, a former one-term Illinois congressman elected as a Republican in the Tea Party wave of 2010, underwent a political evolution over the years, from failed pro-choice congressional and statehouse runs in the 1990s to running as a pro-lifer with no exceptions when losing his seat in 2012. Now, he has completed the journey from exclaiming he would be “grabbing my musket” if Hillary Clinton defeated Donald Trump in 2016 to challenging the president in 2020.\n\nAnd it wasn’t actually all that long ago that Walsh was saying things that now seem markedly Trumpian — and far worse. As others have noted, the period of Walsh’s political life during which he contemplated extraconstitutional violence if Hillary Clinton won the presidency corresponded with the time when Walsh engaged in rank racism and bigotry, particularly on Twitter. As recently as February 2018 — which was, for the record, just 18 months ago — Walsh was promoting conspiracy theories about Barack Obama’s religious persuasion, saying repeatedly and without evidence that Obama was a Muslim.\n\nAfter the horrific events of the Unite the Right rally in August 2017, Walsh hosted white nationalist and failed politician Paul Nehlen on his radio show and voiced support for Nehlen’s efforts to primary Paul Ryan.\n\nHere’s a pic of @WalshFreedom with Paul Nehlen. Walsh supported Nehlen’s primary campaign again Paul Ryan and had him as a guest on his show shortly after Charlottesville. You can listen at the link.https://t.co/WZSX8LT42h pic.twitter.com/7sceisEAwC — Luke Thompson (@ltthompso) August 25, 2019\n\nIn fact, before his sudden and, some would say, cynical disavowal of Trump and Trumpism, Walsh was tweeting very much like the president and some of his supporters, describing Stevie Wonder as “ungrateful” for the wonders of American life after the singer took a symbolic knee at a concert in early 2017 and even complaining about the lack of a Congressional White Caucus.\n\nI object to protests over something that doesn't exist, police killing black men. They should protest what does. Blacks killing blacks. https://t.co/qXtidnfWcU — Joe Walsh (@WalshFreedom) September 28, 2016\n\nBut that’s all changed now, says Walsh, who has said he turned away from Trump after the debacle that was Trump’s meeting with Vladimir Putin in Helsinki — in which Trump sided with Putin over American intelligence regarding interference in the 2016 election — and told Stephanopoulos, “The beauty of what President Trump has done is he’s made me reflect on some of the things I’ve said in the past. I had strong policy disagreements with Barack Obama, and too often I’ve let those policy disagreements get personal.” Walsh appears to be running as a true believer of Trumpism turned chastened opponent, a prodigal son of sorts and definitely not a “real racist.”\n\nFollow up questions:\n\n\n\n1. Are you saying you just pretended to be a racist to whip up support from racist voters?\n\n\n\n2. Is this common practice among Republicans?\n\n\n\n3. Do you think this is what Trump is doing?\n\n\n\n4. What does that say about your/Trump's view of the GOP electorate? https://t.co/YE2F672sGc — Damon Linker (@DamonLinker) August 26, 2019\n\nBut Walsh’s appeal to Republican voters, as I wrote this past weekend, is difficult to parse out:\n\nIt’s not exactly clear which Republican constituency would find Walsh appealing: Republican voters turned off by Trump’s own conspiracy theorizing and racism are unlikely to support another Republican prone to the same, his current disavowals of such behavior notwithstanding, and Republican voters who don’t find Trump’s invective unappealing will simply vote for him again.\n\nThe Bill Weld and Mark Sanford strategy: make Republicans “normal” again\n\nBill Weld — who served as the Republican governor of Massachusetts from 1991 to 1997 and was one of Mitt Romney’s biggest boosters in the 2008 GOP primary (even chairing his election committee in New York) before ultimately voting for Obama in the general election — firmly believes that what Republicans (and some Democrats) want is a return to normalcy, and normal Republicans who care about the deficit and espouse economic views more akin to Paul Ryan than Donald Trump.\n\n“I’m a supply-sider on economics,” he told me when we spoke a few weeks ago. “I believe in dynamic scoring of tax cuts. I thought the 2017 tax cut was pretty good. Maybe it made the rich a little bit too rich and didn’t do enough for the bottom 25 percent, the bottom quartile, but it had some things in it I’ve been contending for for years.”\n\nDuring our conversation, I asked Weld what his affirmative appeal to Republicans would be, and he said he’d tell them, “I’m a real Republican. I believe in balancing the budget and then some.” He added later, “I consider myself a person of some compassion, but I never saw any layer of government, federal, state, or local, that couldn’t be pruned 10 percent or 20 percent without any loss in delivery of government services whatsoever.”\n\nBut while Weld is hopeful that everyday Republicans are longing to return to Paul Ryan-style economics, everyday Republicans themselves aren’t so sure. A 2018 poll found that 79 percent of Republicans approve of how the GOP and the Trump administration have handled the deficit, and in July, White House Chief of Staff Mick Mulvaney, himself an avowed budget hawk, argued on Face the Nation that the White House’s priorities were more important than cutting spending.\n\nThis also poses a risk for the prospective candidacy of former South Carolina governor and House member Mark Sanford, who told my colleague Tara Golshan that he wanted to refocus the Republican Party and talk more (and with more fervor) about government spending, though it might be unpopular “medicine” to do so:\n\nIt’s this sort of nuclear swirl with Trump in the center of it in Republican circles, and in the process, we’re not talking about issues like the debt and the deficit that I think really are going to impact people’s lives in profound ways. I would rather you get a little more excited about debt, deficit, and government spending than the tone I hear in your voice. I want passion. I want passion on this subject.\n\nSanford has not decided whether or not he’ll enter the race, though he told Time’s Lissandra Villa that he is in the “final throes” of the process and will make a decision soon.\n\nMark Sanford to me on phone this a.m. about deciding whether to run for president: “It’s daunting, and it’s intimidating, and it’s overwhelming in human terms. Nobody wants to be a human piñata … [for] the president who seems to come up with a nickname for anyone.\" — Lissandra Villa (@LissandraVilla) August 27, 2019\n\nBut the problem Sanford, Weld, and Walsh all have is that they are facing a president who is far more popular with Republicans than they, or their ideas, are. Trump currently enjoys 88 percent approval within the GOP, and that number has remained remarkably stable since the end of 2017, the last time his approval rating dropped below 80 percent.\n\nWhether or not Trump is a “normal Republican” or a real conservative, Republican voters don’t particularly seem to care. So an effort to primary Trump on that basis — promising to return to the era of “real Republicans” who touted trickle-down economics and “compassionate conservatism” and the deep and abiding importance of norms — seems doomed to fail."}, {"url": "https://abcnews.go.com/Politics/joe-walsh-2020-presidential-candidate/story?id=67447229", "page_content": "Joe Walsh, a former Illinois congressman and syndicated conservative talk radio host, announced his run as a Republican candidate for president in August 2019, telling ABC News Chief Anchor George Stephanopoulos in an exclusive interview on \"This Week\" that he was making a moral case against the man he once supported.\n\nOut of the running: Three days after the Iowa caucuses, Walsh ended his long-shot bid to challenge President Donald Trump for the Republican presidential nomination.\n\n\"I’ve suspended my campaign because I’ve concluded that no one can beat Trump in a Republican nomination -- not me, not anyone,\" Walsh said in a statement. \"That was crystal clear to me this week when I stood in front of 3,000 Iowa Republicans and was booed and jeered at for saying we deserve a president who is honest, decent and puts the country first. The Republican party has become a cult.\"\n\nName: William Joseph Walsh\n\nParty: Republican\n\nDate of birth: Dec. 27, 1961\n\nAge: 58\n\nHometown: North Barrington, Illinois\n\nFamily: Walsh is married to Helene Walsh, a former Republican member of the Illinois House of Representatives. He was previously married to Laura Walsh. He has three children and two step-children.\n\nEducation: Walsh received his bachelor's degree in English from the University of Iowa and his master's in public policy from the University of Chicago.\n\nJoe Walsh speaks at a debate in N.Y., Sept. 24, 2019. Mark Kauzlarich/Reuters, FILE\n\nWhat he does now: He was the host of \"The Joe Walsh Show\" until national distribution of his show was canceled after he launched his presidential campaign.\n\nWhat he used to do: Walsh served a single term in the House, representing the 8th Congressional District of Illinois from 2011 to 2013. He was defeated in his reelection bid by Tammy Duckworth, who now serves as a U.S. senator. After leaving office, he launched the Grow and Be Free Super PAC to back conservative candidates and act as an alternative to Republican super PACs who were backing establishment candidates. The group shut down in 2015, according to the Center for Public Integrity.\n\nKey life/career moments:\n\nWalsh was elected to the House in 2010 amid a wave of tea party support.\n\nAfter leaving Washington, Walsh began hosting a Chicago-based conservative radio talk show in 2013. Salem Media Group began distributing the show nationally in 2017.\n\nWalsh has long history of incendiary and controversial statements ranging from using racist slurs on Twitter to promoting falsehoods around former President Barack Obama's birth certificate and religion. When Stephanopoulos asked him in August if he really believed that Obama is Muslim, Walsh replied, \"God no. And I have apologized for that.\" Walsh has been apologetic about his past statements since announcing his presidential bid.\n\nAs recently as 2017, he tweeted about Sen. Kamala Harris: \"Senator Kamala Harris said something really dumb. Meh. If you're black and a woman, you can say dumb things. Lowered bar.\"\n\n\"That is kind of textbook racism and sexism,\" Stephanopoulos told Walsh on \"This Week\" in August. The former congressman responded by saying Trump's time in office has made him \"reflect on some of the things I have said in the past.\"\n\nWhere he stands on some of the issues:\n\nOn his campaign website, he writes that he is a conservative and then, as he lists his position on the issues, he compares himself to President Donald Trump. For example, he wrote that he believes in the power of the Second Amendment but hates to see \"that right being abused by violent people, some who have stated Trump was an inspiration for their violence.\" He added that he supports universal background checks.\n\nHe wrote that he was appalled when Obama separated families at the border and is \"repulsed that Trump has expanded our immigration policy to include inhumanely separating children from their parents and locking people in cages.\"\n\nWalsh also said on his campaign site that he believes in the benefits of free trade and that \"we should not be putting in tariffs that punish American industries, builders, consumers, and families.\"\n\nWalsh has acknowledged there's little chance his candidacy will result in Trump losing the party nomination and he has focused on offering Republican voters an alternative vision for the party.\n\nFundraising:\n\nSince the start of his campaign in August, Walsh has raised almost $235,000 and has spent a little over half of that -- nearly $120,000 -- on operating expenditures, according to Federal Election Commission data. By comparison, Trump has raised over $165 million since officially registering as a candidate in 2017.\n\nWhat you might not know about him:\n\nIn 2018, actor Sacha Baron Cohen, posing as a fake Israeli \"anti-terror expert\" on Showtime's \"Who Is America?,\" fooled Walsh and other conservative figures to voice support for arming children as a solution to school shootings.\n\nWalsh said that during his term in Congress he refused his congressional health benefits and pension. He was also known for living in his office rather than moving into a Washington-area residence.\n\nIn 2012, another Joe Walsh -- the Eagles' guitarist -- endorsed Duckworth for Congress when she ran against the incumbent Walsh to represent the 8th Congressional District of Illinois."}, {"url": "https://publicintegrity.org/politics/elections/presidential-profiles-2020/joe-walsh-president-republican/", "page_content": "Reading Time: 3 minutes\n\nUpdate, Feb. 7, 2020: Joe Walsh has ended his presidential campaign.\n\nFormer Rep. Joe Walsh of Illinois, now a conservative talk radio host, will challenge incumbent President Donald Trump for the Republican presidential nomination.\n\n\n\nWalsh, 57, narrowly defeated a three-term Democrat in the Tea Party wave election of 2010. He served a single term in Congress before losing his seat.\n\n\n\n“We can’t take four more years of Donald Trump. And that’s why I’m running for President,” Walsh tweeted the morning of Aug. 25. “It won’t be easy, but bravery is never easy. But together, we can do it.”\n\nIn 2016, Walsh, known for inflammatory language, was a vocal backer of Trump’s first presidential bid. “On November 8th, I’m voting for Trump. On November 9th, if Trump loses, I’m grabbing my musket. You in?” he tweeted shortly before the election.\n\n\n\nWalsh subsequently turned into a persistent critic of the president and apologized for “the role I played in helping to put an unfit con man in the White House.”\n\n\n\nTrump boasts high approval ratings from Republicans and has been raising money for his re-election bid since the moment he took office, making any primary challenge a long-shot. But Walsh sees it differently: the president is “ripe for a primary challenger,” Walsh wrote in a New York Times opinion piece earlier this month. Walsh is joined in the Republican primary by former Massachusetts Gov. Bill Weld, who himself announced a challenge to Trump in February but has earned little interest among prospective GOP voters.\n\n\n\nHere’s more on Walsh’s political and financial history:\n\n\n\nIn 2012, outside groups such as FreedomWorks for America collectively spent roughly eight times more — more than $5.2 million — to boost Walsh’s congressional campaign as they did to support his opponent, Democrat Tammy Duckworth. But she won.\n\nWalsh raised a little more than $2 million for his 2012 bid, with the biggest chunk of the money — about $860,000 — coming from Illinois donors.\n\nIn 2011, Walsh’s ex-wife sued him, alleging he owed more than $117,000 in back child support payments, and said he had failed to pay what he owed even as he loaned money to his own campaign. The former couple later settled the dispute and issued a joint statement saying they “now agree that Joe is not and was not a ‘deadbeat dad’ and does not owe child support.”\n\nIn 2014, Walsh was taken off the radio for using racist slurs on the air, something he said he did in an attempt to have an “honest discussion” about them. He has also been asked to account for past tweets when he said, among other things, that he believed former President Barack Obama is a Muslim (he is not) and accused Obama of “hatred toward Israel.”\n\nWalsh’s personal finances have been tumultuous in other ways, according to a 2011 Chicago Tribune investigation. The newspaper reported Walsh’s driver’s license had been suspended after he allowed his high-risk car insurance to lapse. It also said he had previously been subject to state and federal tax liens and lost a condo to foreclosure.\n\nU.S. Rep. Joe Walsh, R-Ill., waits for the start of a televised debate against then-challenger Democrat Tammy Duckworth at the WTTW studios Thursday, Oct. 18, 2012, in Chicago. (AP file/Charles Rex Arbogast)\n\nWalsh’s most recent personal financial disclosure form, filed in 2013 at the end of his time in Congress, showed he owed between $50,000 and $100,000 in legal fees and $10,000 and $15,000 in student loan debt.\n\nAfter leaving office, Walsh launched the Grow and Be Free Super PAC, which he said would back conservative candidates and act as an alternative to Republican super PACs backing more establishment candidates. The group raised nearly $30,000 in 2013, including $5,000 from GOP megadonor Richard Uihlein, and then fizzled, officially shutting down in 2015.\n\nWalsh at one point worked for the libertarian Heartland Institute, which amplifies questions about scientific consensus on climate change, and has been prominently featured at Heartland Institute events since leaving Congress.\n\nWhen Politico asked Walsh if he could raise enough money for a primary challenge to Trump, Walsh’s response: “Abso-freaking-lutely.”\n\nSources: The Center for Responsive Politics, Federal Election Commission records, the Chicago Sun-Times, the Chicago Tribune, the Huffington Post, POLITICO and Salon.\n\n\n\nRelated\n\nHelp support this work"}, {"url": "https://www.cnbc.com/2019/08/25/joe-walsh-becomes-second-republican-to-challenge-trump-for-white-house.html", "page_content": "Joe Walsh, a conservative former U.S. congressman announces his intention to challenge President Donald Trump for the Republican party's 2020 White House nomination, in Washington D.C. U.S., in a still image taken from his campaign video obtained by Reuters on August 25, 2019.\n\nJoe Walsh, a former Illinois congressman and tea party favorite turned radio talk show host, announced a challenge Sunday to President Donald Trump for the Republican nomination in 2020, saying the incumbent is unfit for office and must be denied a second term.\n\n\"He's nuts. He's erratic. He's cruel. He stokes bigotry. He's incompetent. He doesn't know what he's doing,\" Walsh told ABC's \"This Week.\" The longshot portrayed himself as a legitimate alternative in party where he said many are opposed to Trump but are \"scared to death\" of saying so publicly.\n\nHis campaign slogan: \"Be brave.\"\n\nPolls shows Trump is backed by most Republican voters, and the lone rival already in the race is former Massachusetts Gov. Bill Weld, the 2016 Libertarian Party vice presidential nominee who is regarded as fiscally conservative but socially liberal.\n\nUndeterred from pressing ahead with his candidacy, Walsh said, \"I think this thing ... will catch on like wildfire.\" The former Trump booster added: \"I'm a conservative. And I think there's a decent chance to present to Republican voters a conservative without all the baggage.\"\n\nWalsh narrowly won a House seat from suburban Chicago in the 2010 tea party wave but lost a 2012 reelection bid and has since hosted a radio talk show. He has a history of inflammatory statements regarding Muslims and others and declared just before the 2016 election that if Trump lost, \"I'm grabbing my musket.\"\n\nBut he has since soured on Trump, criticizing the president over growth of the federal deficit and writing in a New York Times column that the president was \"a racial arsonist who encourages bigotry and xenophobia to rouse his base.\"\n\nThe road ahead for any Republican primary challenger will be difficult.\n\nIn recent months, Trump's allies have taken over state parties that control primary elections in Iowa, New Hampshire, South Carolina and elsewhere. State party leaders sometimes pay lip service to the notion that they would welcome a primary challenger, as their state party rules usually require, but they are already working to ensure Trump's reelection.\n\nSouth Carolina Republicans have gone so far as to discuss canceling their state's GOP primary altogether if a legitimate primary challenge emerges to eliminate the threat.\n\nAt the same time, polling consistently shows that Trump has the solid backing of an overwhelming majority of Republican voters. An Associated Press-NORC poll conducted this month found that 78% of Republicans approve of Trump's job performance. That number has been hovering around 80% even as repeated scandals have rocked his presidency.\n\n\"Look, this isn't easy to do. ... I'm opening up my life to tweets and attacks. Everything I've said and tweeted now, Trump's going to go after, and his bullies are going to go after,\" Walsh said.\n\n\n\nAsked whether he was prepared for that, Walsh replied: \"Yes, I'm ready for it.\"\n\nWeld, in an interview on NBC's \"Meet the Press,\" said he was \"thrilled\" that Walsh was in the race and that Mark Sanford, a former South Carolina governor and congressman, was considering joining them, leading to a \"more robust conversation.\"\n\n\"Who knows? The networks might even cover Republican primary debates,\" Weld said.\n\nWalsh, 57, rode a wave of anti-President Barack Obama sentiment to a 300-vote victory over a Democratic incumbent in the 2010 election. He made a name for himself in Washington as a cable news fixture who was highly disparaging of Obama.\n\nWalsh was criticized for saying that the Democratic Party's \"game\" is to make Latinos dependent on government just like \"they got African Americans dependent upon government.\" At another point, he said radical Muslims are in the U.S. \"trying to kill Americans every week,\" including in Chicago's suburbs.\n\nHe lost his 2012 reelection bid by more than 20,000 votes to Democrat Tammy Duckworth, who was elected to the U.S. Senate four years later.\n\nWalsh told Obama to \"watch out\" on Twitter in July 2016 after five police officers were killed in Dallas. Just days before Trump's 2016 win over Hillary Clinton, Walsh tweeted: \"On November 8th, I'm voting for Trump. On November 9th, if Trump loses, I'm grabbing my musket. You in?\" Walsh later said on Twitter that he was referring to \"acts of civil disobedience.\"\n\nOn Sunday, Walsh said he apologized for past divisive comments.\n\n\"I helped create Trump. There's no doubt about that, the personal, ugly politics. I regret that. And I'm sorry for that,\" he said."}, {"url": "https://www.grunge.com/439605/the-untold-truth-of-joe-walsh/", "page_content": "Notice the quotes above, and take note that we're not referring to the James Gang, which would come a few years later. Back in the mid-'60s, the Measles (we're guessing they chose the name because it rhymes with \"Beatles\") was a band of Kent State University students that featured Joe Walsh on vocals and guitar. After developing a reputation in the area as an up-and-coming bar band, they started working on original songs, including the Walsh-penned \"I Find I Think of You\" and \"And It's True,\" the latter of which was composed by bassist Bobby Sepulveda, according to Buckeye Beat.\n\nWhat makes this interesting is the fact that those two songs appeared on the Ohio Express' 1967 debut album \"Beg, Borrow and Steal,\" whose title track peaked at No. 29 on the Billboard Hot 100 that same year, per Songfacts. The Ohio Express was not as much a traditional band as it was the name producers Jerry Kasenetz and Jeff Katz used for the songs they released from various bands and musicians, the Measles included. In fact, the song \"Beg, Borrow and Steal\" was actually performed by a group called the Rare Breed, while Kasenetz and Katz had a totally different band go on tour as the Ohio Express and record at least some of the other songs on the album.\n\nThe Ohio Express' history is a confusing one, to be sure, but for a brief moment, that history included a future guitar legend and one of his first-ever compositions."}, {"url": "https://music.douban.com/musician/118893/", "page_content": "简介 · · · · · ·\n\n\n\nJoe Walsh\n\n命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《都市牛郎》... 1947年11月20日出生于肯萨斯州。1969年加入摇滚团James Gang，1975年12月加入老鹰合唱团，是最先发行个人专辑与拥有畅销单曲的团员。1973年Bill Szymczyk就是靠Walsh的推荐才接替原制作人Glyn Johns。Walsh刚加入时，Szymczyk还曾替他担心会影响个人演唱生涯，结果证明Walsh不仅为乐团注入了摇滚的新生Joe Walsh命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《都市牛郎》... (展开全部)\n\n1947年11月20日出生于肯萨斯州。1969年加入摇滚团James Gang，1975年12月加入老鹰合唱团，是最先发行个人专辑与拥有畅销单曲的团员。1973年Bill Szymczyk就是靠Walsh的推荐才接替原制作人Glyn Johns。Walsh刚加入时，Szymczyk还曾替他担心会影响个人演唱生涯，结果证明Walsh不仅为乐团注入了摇滚的新生\n\nJoe Walsh\n\n命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《都市牛郎》插曲\"All Night Long\"都是个人代表作，老鹰合唱团解散期间Walsh仍然有新作陆续推出。\n\n有道是合久必分，分久必合，果然，老鹰乐队于1994年又宣告东山再起，几位元老再次重聚。重组后的老鹰立刻马不停蹄地开始全美巡回演\n\nJoe Walsh\n\n出，并于该年推出一张新歌+精选《炼狱之上》(Hell Freeze Over ).专辑精选部分是演唱会的实况，鼎沸的人群、流畅的旋律又一次在耳边回荡。到底“姜是老的辣”，在演唱会上唐·亨利身着一件格子绒衬衣，在万众瞩目下又唱起那首脍炙人口的《加州旅店》，而唐·弗尔德和乔·沃什的吉他技艺更件炉火纯青，开篇大段的吉他 华彩奏得畅快淋漓，重重的鼓点仿佛击在人们的心房，亨利沙亚的嗓音坚实而富磁性，而乐队成员鬓际的白发尤见苍凉。\n\n04年老鹰乐队在墨尔本的演出，walsh的状态依然保持的相当完美。\n\n2011年，老鹰乐队中国之行，walsh让中国观众大呼：这老头声音真有质感。六十岁的年纪唱出了三十岁的味道。"}, {"url": "https://ultimateclassicrock.com/joe-walsh-so-what/", "page_content": "Joe Walsh had already decided to make a more serious album when fate intervened. \"I know this album's going to be an important one for me, but it's not easy to just crank them out anymore,\" he told Rolling Stone, a couple of months before So What arrived on Dec. 14, 1974.\n\n\"I don't want the next album to sound like a bunch of outtakes from [1973's The] Smoker [You Drink, the Player You Get],\" he added. \"I want it to be the difference between [the Beatles'] Revolver and Sgt. Pepper. I've held back until that development was there, even though the record company's been screaming for it. I want it to be a big, big step – in thoughts, vocals, playing and maturity.\"\n\nThen Walsh was struck by an unspeakable tragedy, and his marriage fell apart. A darkness shot through the sessions, which had lasted from December 1973 into April 1974 – the same month that Walsh's wife, Stefany Rhodes, was smashed into while driving their daughter Emma to a playdate in their adopted hometown of Boulder, Colo.\n\nSomeone ran a stop sign at the corner of Ninth and Spruce, and the passenger-side impact spun the Walshes' green Porsche into a fence across the street. Emma, then just weeks away from turning 3, sustained massive head trauma. She was taken off life support later that night, and her corneas and kidneys were donated to others.\n\n\"The accident kind of did us in,\" Rhodes told the Daily Camera in 2010. \"We divorced shortly afterward.\"\n\nWalsh returned to the studio, trying to shape his feelings while barely fighting off deep despair. Even if he'd never admitted it, So What telegraphs his pain. There are titles like \"Falling Down\" and \"Help Me Through the Night,\" his moody synth-driven instrumental interpretation of \"The Pavane of the Sleeping Beauty\" from Ravel's Mother Goose Suite and, of course, the devastating album-closing tribute simply titled \"Song for Emma.\"\n\nBut Walsh was always brutally honest about the impact of his daughter's death, from his lingering anguish to his slide into alcoholism. \"To help with closure, I wrote this song for her,\" Walsh told Rolling Stone in 2016. \"And over the process of the next year, my wife and I, we just weren't strong enough to get through the grief and so we separated and eventually got divorced.\n\n\"But I met a girl in Los Angeles, and my song 'Help Me Through the Night' was to her about being there for me – because I was a wreck,\" Walsh added. \"But she was there so that I could grieve Emma.\"\n\nListen to Joe Walsh Perform 'Help Me Through the Night'\n\nA certain hardness defines the rest of So What, from the opening \"Welcome to the Club\" to his remake of \"Turn to Stone\" from 1972's Barnstorm. Walsh tries to lighten things up with the field-holler \"All Night Laundry Mat Blues,\" but it only lasts a moment. \"County Fair\" tries to round itself into a romp, but a sad reverie keeps elbowing in.\n\nEverything coalesces around the cover, which finds Walsh peering out in an empty-eyed stare. The album title itself was a shocking moment of nihilism from someone often thought of as rock's clown prince.\n\n\"I called it that because I had this 'so what' attitude,\" Walsh added. \"I was angry. I was really mad at God – and I felt that was a great reason to drink: 'Poor me. God took my daughter away.' And so I got an attitude, like, 'This is the worst thing that's ever happened. I don't care about anything' – just to justify that it was okay to get screwed up.\"\n\nA plaque was dedicated in memory of Emma on May 25, 1976 at her favorite playground in Boulder. It reads: \"This fountain is given in loving memory of Emma Walsh, April 29, 1971-April 1, 1974.\" Her mother told the Daily Camera that \"the fountain was all Joe's doing, really.\"\n\nWalsh says he still thinks of Emma often, and he's tried to leverage his sense of loss into something constructive. \"Having had that experience, sometimes I am in a position to be able to comfort people,\" Walsh told Interview in 2012. \"I'm in a position to put an arm around them and tell them they are not alone.\n\n\"I've talked to several parents whose sons were killed in Iraq or Afghanistan, and they know about my daughter,\" he added. \"Sometimes, they'll contact me to let me know their kids were killed in the war and that they were fans, or that my music really helped them deal with their grief. That's a good thing that came out of it.\"\n\nIt wasn't the only thing. So What became a gold-selling No. 11 hit, while also hinting at his next career move: Several members of the Eagles joined in the sessions, after recently hiring Walsh's producer, Bill Szymczyk. They'd also shared stages, and had the same manager in Irving Azoff.\n\nListen to Joe Walsh Perform 'Song For Emma'\n\nDon Henley ended up co-writing \"Falling Down,\" and singing on \"Time Out.\" Henley was also joined by bandmates Glenn Frey and Randy Meisner on backing vocals for \"Turn to Stone\" and \"Help Me Through the Night.\"\n\nSomething clicked. Within a year and a half, Walsh had replaced founding member Bernie Leadon in advance of the Eagles' biggest album ever. \"So, when Bernie decided that he just wasn't interested very much in continuing,\" Walsh told Guitar World in 2012, \"Don and Glenn thought I would plug in really well with where the Eagles were eventually going to go.\n\nWalsh admitted that \"at the time I was going, 'Aw fuck, it's time to do another solo album. Oh shit. Anybody got any ideas?' You know? So, it all just kind of came together, I joined the Eagles – and the result, of course, was Hotel California.”\n\nIt took some time, but Walsh was finally able to put sudden turns of events like that in perspective, quoting a storyteller best known for PBS's The Power of Myth.\n\nJoseph Campbell said \"something profound,\" Walsh told students at his old high school in 2015. \"As you go through life, it appears to be a series of unrelated events colliding, smashing into each other, creating chaos and destroying your plan for what's going to happen. It's really hard to know what is going on on a daily basis. In retrospect when you look back on your life, it looks like a finely crafted novel.\"\n\nYears after her passing, Stevie Nicks' impromptu visit to the fountain honoring Emma Walsh inspired \"Has Anyone Ever Written Anything for You,\" from 1985's Rock a Little.\n\nEagles Solo Albums Ranked Here's a look back at studio projects recorded away from the band.\n\nSix Little-Known Eagles 'Hotel California' Facts"}, {"url": "https://ecelebrityfacts.com/joe-walsh-doing-now-world-tour-eagles-net-worth/", "page_content": "Rock and Roll Hall of Famer Joe Walsh is 71 and is still rocking. Finding stardom as the guitarist and keyboardist of the rock band Eagles, Walsh has enjoyed a long-spanning career as a musician both in bands and as a solo artist. Initially, Joe was part of The Measles, a garage band he formed with three fellow students at Kent State University in 1965. He remained as the frontman of the band until 1967. That same year, Joe applied as a replacement for James Gang guitarist Glenn Schwartz. He was accepted and worked with the band until he left in 1971 to form Barnstorm, which became another brief stint for Joe. Walsh played slide guitar under the tutelage of Duane Allman for former Barnstorm bandmate, Joe Vitale’s debut album, Roller Coaster Weekend before the biggest break in his career.\n\nIn 1975, Walsh was invited to join The Eagles as the replacement for founding member Bernie Leadon. Initially, drummer Don Henley, who was often criticized for being too serious, had reservations about Walsh and considered him to be far too ‘wild’ for the band. However, the bandmates clearly moved on from their differences and came up with the iconic Hotel California album in 1976, which took a year and a half to complete. After the song, Life in the First Lane, based on a riff by Walsh made it to No.11 on the charts, it helped cement his position in the band. He remained one of the fan-favorite members till the band broke up in 1980. Walsh and his Eagles bandmates were inducted into the Rock and Roll Hall of Fame in 1998.\n\n10 Most Popular Band Break-Ups! Pink Floyd, The Beatles and More\n\nWalsh has also joined Ringo Starr & His All-Star band, a rock supergroup for many performances and has been good friends with many other rock musicians of the 20th century, including Jimmy Page and Steve Perry. After his brief stint with Barnstorm, Walsh started a solo career and has released 12 solo albums, some of which contain contributions from his Eagles bandmates. From his career spanning over five decades, Walsh has amassed a net worth of $75 million. He has not been actively involved in the mainstream media for quite a while now.\n\n#. Service to Humanity\n\nFor Walsh, giving is the greatest art of grace. He has been extremely active in charities for various causes, especially supporting army veterans. He founded VetsAid, a recurring music festival to raise fund for veteran service groups across America. He has been visiting military bases throughout the country and is even offering free guitar lessons for wounded veterans. He lost his father, a pilot instructor for the first US operational jet-powered aircraft, the Lockheed F-80 Shooting Star, during active duty in Okinawa, when Walsh was just 20 months old. So, he is personally invested in the well-being of the veterans providing them appropriate financial, emotional, mental and physical support. He said,\n\n“War is hell for everyone involved. I lost my father when I was a baby, before I could even make a memory of him. I stopped counting the number of friends I lost in the Vietnam War or that came home forever scarred mentally or physically or both. I had to do something and seeing as though rock-and-roll seems to be what I do best, it’s the least I could do for those who have served and continue to serve our country.”\n\nIn addition to that, Walsh has also been fighting against drug addiction. Recently, in October 2018, he along with his wife Marjorie Walsh were honored by the nonprofit Facing Addiction with NCADD for their support of the recovery movement and their endeavour to raise awareness about drug and alcohol abuse. Walsh, who has been sober for 25 years now, has been open about his struggle with addiction. He also encourages fans to donate $10 to FacingAddiction, which he co-founded with his wife in 2015, to win a chance to dine with him and exclusive access to Eagles concerts.\n\nWhat Is Pearl Jam Vocalist Eddie Vedder Net Worth in 2018? Tour Dates\n\n#. Reunion with Eagles\n\nThe Eagles were one of the most influential musical acts in the 1970s and that influence still lingers. With sold out shows everytime they tour, the Eagles are still rocking across the globe and grabbing headlines left and right. Joe, 71, shows no signs of slowing down as he still nails every single Hotel California solo. We sure hope Walsh continues to tour and bring the magic of Eagles music across the world. Walsh and his bandmates are already announcing dates for tours in 2019 that include shows in the US, Australia, New Zealand, Britain and several countries throughout Europe. Recently, Joe showed up on the Howard Stern show to talk about his upcoming tour, where he was joined by fellow musician Ringo Starr as they discussed their respective crafts and the passion behind it.\n\nLed Zeppelin Reunion: Reasons why they won’t reconcile again!\n\n#. Efforts to Protect the Environment\n\nWalsh has often expressed his love for the Santa Cruz Islands, where he has been going to for 40 years. He has been actively involved in protecting the islands and even served as the President of the Santa Cruz Islands Foundation. He helps out in the Feast of the Holy Cross by performing his songs and has been a force of change and awareness. All in all, Joe Walsh is still as busy as his earlier days as he balances world tours, personal life, and his never-dying passion for music. We wish him the best for all his future endeavors and thank him for the music he has created over the years.\n\nReferences\n\nNet worth of Radiohead vocalist Thom Yorke | Suspiria and Albums!\n\nQueen Guitarist Brian May Guitar Collection\n\nPink Floyd vocalist David Gilmour Guitar Collection\n\nRock and Roll Hall of Famer Joe Walsh is 71 and is still rocking. Finding stardom as the guitarist and keyboardist of the rock band Eagles, Walsh has enjoyed a long-spanning career as a musician both in bands and as a solo artist. Initially, Joe was part of The Measles, a garage band he formed with three fellow students at Kent State University in 1965. He remained as the frontman of the band until 1967. That same year, Joe applied as a replacement for James Gang guitarist Glenn Schwartz. He was accepted and worked with the band until he left in 1971 to form Barnstorm, which became another brief stint for Joe. Walsh played slide guitar under the tutelage of Duane Allman for former Barnstorm bandmate, Joe Vitale’s debut album, Roller Coaster Weekend before the biggest break in his career.\n\nIn 1975, Walsh was invited to join The Eagles as the replacement for founding member Bernie Leadon. Initially, drummer Don Henley, who was often criticized for being too serious, had reservations about Walsh and considered him to be far too ‘wild’ for the band. However, the bandmates clearly moved on from their differences and came up with the iconic Hotel California album in 1976, which took a year and a half to complete. After the song, Life in the First Lane, based on a riff by Walsh made it to No.11 on the charts, it helped cement his position in the band. He remained one of the fan-favorite members till the band broke up in 1980. Walsh and his Eagles bandmates were inducted into the Rock and Roll Hall of Fame in 1998.\n\n10 Most Popular Band Break-Ups! Pink Floyd, The Beatles and More\n\nWalsh has also joined Ringo Starr & His All-Star band, a rock supergroup for many performances and has been good friends with many other rock musicians of the 20th century, including Jimmy Page and Steve Perry. After his brief stint with Barnstorm, Walsh started a solo career and has released 12 solo albums, some of which contain contributions from his Eagles bandmates. From his career spanning over five decades, Walsh has amassed a net worth of $75 million. He has not been actively involved in the mainstream media for quite a while now.\n\n#. Service to Humanity\n\nFor Walsh, giving is the greatest art of grace. He has been extremely active in charities for various causes, especially supporting army veterans. He founded VetsAid, a recurring music festival to raise fund for veteran service groups across America. He has been visiting military bases throughout the country and is even offering free guitar lessons for wounded veterans. He lost his father, a pilot instructor for the first US operational jet-powered aircraft, the Lockheed F-80 Shooting Star, during active duty in Okinawa, when Walsh was just 20 months old. So, he is personally invested in the well-being of the veterans providing them appropriate financial, emotional, mental and physical support. He said,\n\n“War is hell for everyone involved. I lost my father when I was a baby, before I could even make a memory of him. I stopped counting the number of friends I lost in the Vietnam War or that came home forever scarred mentally or physically or both. I had to do something and seeing as though rock-and-roll seems to be what I do best, it’s the least I could do for those who have served and continue to serve our country.”\n\nIn addition to that, Walsh has also been fighting against drug addiction. Recently, in October 2018, he along with his wife Marjorie Walsh were honored by the nonprofit Facing Addiction with NCADD for their support of the recovery movement and their endeavour to raise awareness about drug and alcohol abuse. Walsh, who has been sober for 25 years now, has been open about his struggle with addiction. He also encourages fans to donate $10 to FacingAddiction, which he co-founded with his wife in 2015, to win a chance to dine with him and exclusive access to Eagles concerts.\n\nWhat Is Pearl Jam Vocalist Eddie Vedder Net Worth in 2018? Tour Dates\n\n#. Reunion with Eagles\n\nThe Eagles were one of the most influential musical acts in the 1970s and that influence still lingers. With sold out shows everytime they tour, the Eagles are still rocking across the globe and grabbing headlines left and right. Joe, 71, shows no signs of slowing down as he still nails every single Hotel California solo. We sure hope Walsh continues to tour and bring the magic of Eagles music across the world. Walsh and his bandmates are already announcing dates for tours in 2019 that include shows in the US, Australia, New Zealand, Britain and several countries throughout Europe. Recently, Joe showed up on the Howard Stern show to talk about his upcoming tour, where he was joined by fellow musician Ringo Starr as they discussed their respective crafts and the passion behind it.\n\nLed Zeppelin Reunion: Reasons why they won’t reconcile again!\n\n#. Efforts to Protect the Environment\n\nWalsh has often expressed his love for the Santa Cruz Islands, where he has been going to for 40 years. He has been actively involved in protecting the islands and even served as the President of the Santa Cruz Islands Foundation. He helps out in the Feast of the Holy Cross by performing his songs and has been a force of change and awareness. All in all, Joe Walsh is still as busy as his earlier days as he balances world tours, personal life, and his never-dying passion for music. We wish him the best for all his future endeavors and thank him for the music he has created over the years.\n\nReferences\n\nNet worth of Radiohead vocalist Thom Yorke | Suspiria and Albums!\n\nQueen Guitarist Brian May Guitar Collection\n\nPink Floyd vocalist David Gilmour Guitar Collection"}, {"url": "https://usveteransmagazine.com/2019/08/joe-walsh-vetsaid-2019/", "page_content": "By Kellie Speed\n\nWhen New York City Firefighter Stephen Siller was killed during the terrorist attacks on the World Trade Center on 9/11, he could never have imagined the tremendous legacy his family would create in his memory.\n\nThe Tunnel to Towers Foundation was born as a result of that tragic day to honor and remember Stephen’s heroism as he ran through the Brooklyn Battery Tunnel with 60 lbs. of gear on his back to the South Tower to serve in the rescue efforts. The foundation honors America’s greatest heroes and their families.\n\nWe caught up with the Tunnel to Towers Foundation Chairman and CEO Frank Siller to discuss the incredible work the foundation continues to do in the loving memory of his little brother.\n\nWhy was it so important for you personally to create a program to help our wounded warriors?\n\nWe know we went to war because of what happened on September 11, 2001, and my brother was a New York City firefighter who died that day. I fully appreciated that we didn’t want this to happen again on our soil, and we went into Iraq, Afghanistan and other places to ensure that it did not happen again. While doing so, many men and women sacrificed tremendously for our country to protect us here in America.\n\nThe first ever quadruple amputee to survive any war was years after 9/11; to be precise, it was in 2009 when SGT Brendan Marrocco lost all four limbs for our country. I went down with a group from the Tunnel to Towers Foundation. I saw the sacrifice Marrocco made for us as a country and those 9/11 families who lost somebody — that’s when we decided to start building mortgage-free smart homes for our country’s most catastrophically injured service members. Not just injured, but catastrophically injured — those who have given up two, three or four limbs, or those who are quadriplegic, paraplegic or suffered a traumatic brain injury where they can hardly function, and other injuries along those lines. We want to give back some of the independence they gave away protecting us.\n\nCan you tell us about the smart home program?\n\nWe have built over 100 smart homes across the country, but we have 73 new names that we just added for this coming year or two. It will be close to 200 by the time we are done in two years, but there are still more out there. Many have waited for years because I didn’t have the funds, resources or ability to build all these homes at once. Each home is a tremendous expense. Just to buy the land for these great heroes is $200 to $300 thousand. Then, we are into the construction side for $600 to $700 thousand.\n\nThe recipients need the space inside their homes to maneuver comfortably, and that’s the idea behind it all to give them back some of the comfort and independence that was taken away from them because they were protecting us. By no means is our work done. I don’t believe it will ever be done.\n\nWe have men and women who are still protecting us, and Gold Star families, those who have lost a loved one protecting our country. If they have young families left behind, if they don’t have a house, we build them a house; and if they do have a house, we pay off their mortgage. It’s a promise we made at the Tunnel to Towers Foundation that when their loved ones give them a kiss goodbye and they don’t come home, we are going to be there for the families because they gave their life for our country, so we have got to take care of them. That’s the promise the Tunnel to Towers Foundation has made.\n\nHow did it feel when you were able to hand over the keys to the first home recipient, Army SGT Brendan Marrocco?\n\nIt was a feeling that was inexplicable. It’s an emotion; sad to say that a lot of people don’t have that experience. They have great joy in their lives, and everybody should, but this is different. This is a blessing that we are able to give to a patriot who was willing to give their body for our country.\n\nWe delivered over 200 mortgage-free homes in 2021 and again in 2022, and the pace is picking up. We have got to do more and more every year. We do it for fallen first responders as well. If you die in the line of duty, we are going to pay off your mortgage, so we have our work cut out for us. I know there is no other foundation in America that has taken on this responsibility, and we are proud that we are. It’s more than just giving a mortgage-free house away; it’s creating a relationship with these beautiful families.\n\nDid you ever envision Tunnel to Towers becoming what it is today?\n\nNo, this foundation was started in honor of my youngest brother Stephen. Stephen was the youngest of seven, so the six remaining siblings wanted to honor what he did and, for that matter, what all first responders did on 9/11. Stephen is only symbolic of the heroism demonstrated that day, and we want to make sure we never forget. That is our first obligation to make sure we never forget.\n\nThe beautiful thing about the Tunnel to Towers run that we have every year on the last Sunday in September is that we carry pictures of all 7,072 men and women who have given their lives for our country since 9/11. I think the legacy of my brother and the legacy of the foundation is the good work we are doing for all of these families.\n\nWhat do you have planned for 2023?\n\nWe are going to try to eradicate homelessness amongst our veterans. The numbers I have given you are just for smart homes, Gold Star and fallen first responders. The foundation will have close to 1,000 homeless vets off the street in 2022, and I don’t talk about it too much. I want people to start realizing that we deliver. When we say we are going to do something, we deliver. When people donate $11 a month, and that’s what we ask Americans to do, they know where their money is going.\n\nWhen you asked about plans for 2023, I am going to say that among smart homes, Gold Star, fallen first responders and catastrophically injured, we will do about 250 mortgage-free homes. Then for our homeless veterans, we will have 1,500 to 2,500 veterans off the streets in 2023. The beautiful thing is we are building these comfort homes for these homeless veterans, and then we are going to give them comprehensive services to be able to stay in the homes. We have a tremendous program we have rolled out that we are so proud of where we are doing all these things.\n\nFor more information about the Tunnel to Towers Foundation, visit t2t.org."}]}