{"Joe Walsh was born on 28 April 1988.": [{"url": "https://nationaltoday.com/birthday/joe-walsh/", "page_content": "Background\n\nJoseph Fidler Walsh was born on November 20, 1947, in Wichita, Kansas. He was born to Lt. Robert Newton Fidler, a flight instructor for the U.S. Air Force who died in a plane crash in 1949. His mother was a classical pianist. He was adopted at five years old by his stepfather and given the surname, although he kept Fidler as his middle name. He lived for several years in Columbus, Ohio, and then moved to New York City. He also went to Montclair, New Jersey, where he attended Montclair High School and played oboe. He got his first guitar at 10 years old. He began his career by replacing Bruce Hoffman as the bass player in the Nomads. After high school, he went to Kent State University, where he played for several bands. He majored in English and minored in music. He eventually dropped out of college to pursue music full-time.\n\nHe played for The Measles between 1965 and 1967 and then for James Gang between 1968 and 1971. Their debut album, “Yer’ Album,” came out in 1969. He also played for Barnstorm from 1971 to 1975, shifting to Colorado. He joined the Eagles in 1975, replacing Bernie Leadon. The fifth studio album, “Hotel California,” was released in 1976 and was a success globally. The ‘Hotel California’ song topped all charts by May 1977 and became one of the band’s most iconic songs. The album “Life in the Fast Lane,” released in 1977, with a riff by Walsh, became a success and was followed by “The Long Run” in 1979. Walsh’s first solo album was “So What” in 1974. His live album, “You Can’t Argue with a Sick Mind,” was released in 1976. In 1978, “But Seriously, Folks” marked his career high. One of his most popular songs was ‘A Life of Illusion.’ His last album was “Songs for a Dying Planet” in 1992, although he later released a solo album, “One Day at a Time,” in 2012. The Eagles came together again in 1994 for a performance and subsequent tour along with “Hell Freezes Over,” which had several successful tracks. They performed again in 1999 and 2001, with several recordings released. Their “The Very Best Of” was released in 2003, while the tour line-up was released in 2005, titled “Farewell 1 Tour-Live from Melbourne,” with two new tracks. The group’s album “Long Road Out of Eden” came out in 2007 and then a world tour was launched in 2008.\n\nWalsh has performed in several concerts to raise money for charitable causes. He also funded a scholarship at Kent State University in 2008. He has been active in conserving Santa Cruz Island. He has been married five times, namely to Margie Walsh, Stefanie Rhodes, Juanita Boyer, Denise Driscoll, and currently to Marjorie Bach (sister of Barbara Bach and sister-in-law to Ringo Starr) in 2008. His daughter, Lucy Walsh, is a musician. Emma Kristen, his eldest daughter, died at three years old due to an automobile accident."}, {"url": "https://biog.com/biography/joe-walsh", "page_content": "Joe Walsh is known as an American singer, guitarist, and songwriter. He is most famous for being in legendary bands like the Eagles.\n\nFame\n\nBackground\n\nJoseph Fidler Walsh was born on November 20, 1947 in Wichita, Kansas. During his childhood he lived in Columbus, Ohio and after that later New York City and Montclair, New Jersey. He went to school at Ohio's Kent State University, where he joined a band called the James Gang in 1968. Around then, the James Gang comprised of Walsh on guitar and vocals, Jim Fox on drums, and Tom Kriss on bass in a power trio structure.\n\nCareer\n\nAs a solo artist, Joe Walsh released a live album collection called You Can't Argue with a Sick Mind in 1976, yet at that point he was burnt out on working alone and was searching for a band to join. He discovered it in the Eagles, who had quite recently lost their guitarist Bernie Leadon to creative contrasts. Once ready, he helped the Eagles make their most well known album collection Hotel California which was released soon thereafter. Including a more rock edge to the Eagles in the spot of Leadon's more country enhanced style, his commitments to the guitar work of the title track and the popular riffs of Life in the Fast Lane are particularly popular.\n\nIn June 2019, he released a song with pop star, Sheryl Crow.\n\nPersonal Life\n\nRelationships\n\nOne of Walsh's songs was inspired by his move to Colorado with his wife Stephanie and little kid Emma Kristen. Sadly, Emma was killed in an auto collision in 1974 while on her drive to nursery school. He had a little water fountain created in her memory in her favorite park in Boulder.\n\nIn the eighties, Walsh got married a third time and fathered a little girl, Lucy, who has entered the music business herself as a singer. After that marriage fizzled, he was involved with Stevie Nicks for a short period. Stevie wrote \"Has Anyone Ever Written Anything for You\" to dedicate to Walsh. Walsh married a fourth time to a woman named Denise. Even though the marriage ended, she gave him two children.\n\nEven with the busy timetable of the Eagles, Walsh discovered time for tasks of his own. In 2006, his old band the James Gang rejoined for a short tour. Walsh also directed a short solo tour in 2007. On a personal note, he married his present spouse Marjorie Bac. She is the sister-in-law to Ringo Starr.\n\nDate modified: Aug 9, 2020\n\nWe seek for an accuracy and correctness in our content. In case you spot any mistake, please contact us"}, {"url": "https://news.amomama.com/301349-joe-walshs-spouse-is-part-him-that-was-m.html", "page_content": "Joe Walsh and Marjorie Bach. | Source: Getty Images\n\nMusician Joe Walsh, best known for his work in the iconic 70s band the Eagles, finally found his soulmate after four failed marriages and a struggle with health issues.\n\nAdvertisement\n\nGuitarist, singer, and songwriter Joe Walsh made music history as a member of three iconic bands: the James Gang, the Eagles, and Ringo Starr & His All-Starr Band. But while his professional life flourished, his personal life wasn't as successful.\n\nJoe Walsh was married four times, suffered unbearable loss, and battled dependence and health issues before he found the love of his life. Joe Walsh's spouse is Marjorie Bach, who is also intimately connected to music.\n\nJoe Walsh and Marjorie Bach at the Lynda and Stewart Resnick Exhibition Pavilion Opening Gala in Los Angeles, in 2010. | Source: Getty Images\n\nAdvertisement\n\nBorn on November 20, 1947, in Wichita, Kansas, Rock'n Roll Hall of Famer Joe Walsh inherited his flair for music from his mother, a classically trained pianist who played for the New York Ballet. He started playing guitar at ten, setting aside his first instrument, the oboe. He confessed:\n\n\"I discovered I wasn't going to get any girls playing oboe, so I decided that maybe I should play guitar. And I didn't really get any girls playing guitar either, but I had a lot more fun.\"\n\nInspired by The Beatles, he decided to become a musician, never imagining he would one day play with Ringo Starr. As a guitarist, songwriter, and singer, Walsh couldn't have asked for more, but his personal life didn't match his professional success.\n\nAdvertisement\n\nWalch has been married five times and welcomed four children. His first buried marriage was in the 60s to Marge Walsh. He married Stefany Amaro in 1971, Juanita Boyer in 1980, and Denise Driscoll in 1999 before he finally found the woman who completed him, Marjorie Bach.\n\nJoe Walsh and Marjorie Bach at the 50th Annual GRAMMY Awards in 2008, in Los Angeles, California. | Source: Getty Images\n\nAdvertisement\n\nMarjorie Bach Is 'The One' for Joe Walsh\n\nThe musician admits that he was lost in a haze of drugs and alcohol for years until he hit rock bottom. His failed marriages accentuated his loneliness and isolation until he met Marjorie Bach. Walsh confessed:\n\n\"My wife was the part of me that was missing. And I got that whole family that came along with her in the deal. It's an extended family, and they're very close, and it's a dynamic that's never been around me before.\"\n\nWalsh and Marjorie married in 2008, and the musician is devoted to her. He speaks of her son Christian, an opera tenor, as his own, and the family is dedicated to raising money for Vets Aid.\n\nAdvertisement\n\nTo help others achieve sobriety, Walsh, who has been sober for over 30 years, broke anonymity. He and Marjorie were honored bt the non-profit organization Facing Addiction for their example for alcoholics and their families in coping with the illness.\n\nJoe Walsh and Marjorie Bach at the Grammy Foundation's Annual Signature Starry Night Gala in 2008, in Los Angeles, California. | Source: Getty Images\n\nAdvertisement\n\nMarjorie Has Family Ties to Ringo Starr\n\nThough they have never shared the story of how they met, it was likely through Walsh's friendship with Ringo Starr. Marjorie is the sister of Starr's wife, Bond Girl, and model Barbara Bach.\n\nMarjorie is a college graduate who attended Rome and UCLA in the States. She was a senior executive in the high-tech industry and now serves on the Simms/Mann – UCLA Center for Integrative Oncology board.\n\nWildman Joe Walsh, who once rivaled Keith Moon in hotel room mayhem is now a happily married man.\n\nMarjorie's first contact with the Simms/Mann – UCLA Center for Integrative Oncology was as a patient. In 2013 she was diagnosed with breast cancer. With Walsh's unconditional love and support, Marjorie fought cancer.\n\nAdvertisement\n\nShe beat the aggressive disease and felt compelled to give back and help others make the same journey. Marjorie draws on her many contacts in the entertainment and business world to raise money to help cancer patients.\n\nAdvertisement\n\nJoe Walsh Lost His First Child\n\nIn 1971 Walsh married Stefany Amaro, and their daughter Emma was born that same year. But the couple's happiness was destroyed by an unthinkable tragedy. In 1974 Emma died in a car accident. Walsh revealed:\n\n\"My wife was taking our four-year-old daughter to school, and some lady ran a stop sign and creamed our car. And I lost my daughter.\"\n\nWalsh's pain at Emma's loss inspired \"Song for Emma,\" but their grief tore the couple apart. The musician and Amaro would separate four years after Emma's death, unable to overcome their tragic loss. Years after their divorce, Amaro remarried.\n\nAdvertisement\n\nIn tribute to their daughter, Walsh and Amaro built a fountain in Emma's favorite North Boulder Park in Boulder, Colorado. A visit to little Emma's fountain inspired Stevie Nick to write \"Has Anyone Ever Written Anything for You.\"\n\nAdvertisement\n\nJoe Walsh's Marriage to Juanita Boyer\n\nWalsh married Juanita Boyer in 1980, and on December 3, 1982, they welcomed their only child, Lucy Walsh. The 80s were when Walsh's addictions were at their height, and the relationship did not survive the strain.\n\nThe couple divorced in 1988, and the only relic of their marriage seems to be a check for $75 signed by the couple on December 17, 1982, two weeks after Lucy's birth. The check was up for auction by a company specializing in Rock'n Roll and sports memorabilia.\n\nTheir daughter Lucy is a talented actress, a gifted pianist, a classically trained singer, and a composer. As a stage actress, Lucy has starred in several Shakespearean productions and guested on TV series like \"NCIS\" and \"Criminal Minds.\"\n\nAdvertisement\n\nJoe Walsh and Marjorie Bach, with musician Adam Gaynor at the 3rd Annual Comedy Celebration For The Peter Boyle Memorial Fund in 2009, in Los Angeles, California. | Source: Getty Images. | Source: Getty Images\n\nAdvertisement\n\nJoe Walsh Lived a Private Life with Denise Driscoll\n\nJoe Walsh's fourth wife was Denise Driscoll. The couple married in 1999 and welcomed two sons, Alden and Emerson. During his marriage to Driscoll, Walsh lived a quiet life in Encinitas, California. The musician revealed:\n\n\"Some people recognized me in Encinitas, and that was nice. Fifteen years down the line, I can see I had the really good fortune (of anonymity) in Encinitas.\"\n\nThe two divorced in 2006, and Walsh confessed that he missed his sons. During the divorce, Driscoll claimed that Walsh had asked her to buy a $3 million home in Encinitas so they could attempt a reconciliation. According to Driscoll, he promised to refund her but never did.\n\nAdvertisement\n\nTwo years after the split from Driscoll, Walsh married Marjorie Bach, with whom he seems to live a tranquil life. Marjorie encouraged Walsh to relaunch his solo career and to tour with the Eagles.\n\nAdvertisement\n\nThe couple seems remarkably close to Starr and Marjorie's sister Barbara. Starr and Walsh had long been best friends and work colleagues; now, they are brothers-in-law.\n\nWalsh's children call Starr \"Uncle Ringo,\" and the musician has confessed that Marjorie brought him into a loving, supportive family, something he'd never had before. Marjorie actively supports Walsh's work with Vets Aid and uses her business know-how and contacts to raise money for the cause.\n\nWildman Joe Walsh, who once rivaled Keith Moon in hotel room mayhem, is now a happily married man. He has stated that Marjorie completes him, that she is the missing half of his soul.\n\nAfter decades of unhappy relationships, he has finally found the woman of his dreams in Marjorie and built the life he always longed for. The Bach sisters seem to have a talent for making musicians happy."}, {"url": "https://www.joewalshonline.com/biography.htm", "page_content": "Joe Walsh Biography\n\nJoseph Fidler Walsh was born on November 20, 1947 in Wichita, Kansas, but in his youth he lived in Columbus, Ohio and then later New York City and Montclair, New Jersey. He attended college at Ohio's Kent State University, where he first joined the group the James Gang in 1968. At that time, the James Gang consisted of Walsh on guitar and vocals, Jim Fox on drums, and Tom Kriss on bass in a power trio form. They released their first album, Yer' Album, in 1969. Afterwards, Kriss left the band and was replaced by Dale Peters, creating the most successful incarnation of the James Gang. Walsh's dynamic and creative playing featuring his famously catchy guitar riffs made the band memorable. Their next two albums, James Gang Rides Again (1970) and Thirds (1971), produced such classics as Funk #49 and Walk Away. While the power trio format worked well for the James Gang, Walsh was beginning to become dissatisfied with its limitations. After the release of James Gang Live in Concert in 1971, Walsh left the band to pursue a solo career.\n\nNot quite ready to leave the band format entirely, however, he called himself and his two core backing band members Kenny Passarelli and Joe Vitale \"Barnstorm\" and released an album of the same name. Passerelli and Vitale would also be the core backing band members for The Smoker You Drink, the Player You Get (1973). While the albums were categorized by many as solo efforts, the three men functioned as a unit, and even played together on Friends and Legends by Michael Stanley. Even after Barnstorm broke up, Vitale continued to be a collaborator and friend of Walsh. Their most famous collaboration is the magnificent Pretty Maids All in a Row which appeared on the Eagles' Hotel California (1976).\n\nWalsh made a name for himself as a solo artist with the hit Rocky Mountain Way off of The Smoker You Drink, the Player You Get (1973). The song was inspired by Walsh's move to Colorado with his wife Stephanie and small child Emma Kristen. Tragically, Emma was killed in a car accident in 1974 while on her way to nursery school, an event which haunts Walsh to this day. He had a small drinking fountain built in her memory in her favorite park in Boulder, denoted by a simple plaque. His next album, So What (1974), contained a tribute to her entitled Song for Emma. He has said that even the album name was a result of Emma's death - that nothing else seemed meaningful or important in the months that followed. The strain would eventually contribute to Walsh's divorce from his second wife Stephanie (Walsh had already been briefly married in the sixties to a lady named Margie).\n\nUnable to enjoy Colorado anymore, he moved back to L.A. He released a live album called You Can't Argue with a Sick Mind in 1976, but by that time he was tired of working alone and was looking for a band to join. He found it in the Eagles, who had just lost their main guitarist Bernie Leadon to creative differences. Once on board, he helped the Eagles craft their most famous album Hotel California which was released later that year. Adding a more rock-oriented edge to the Eagles in the place of Leadon's more country-flavored style, his contributions to the guitarwork of the title track and the famous riffs of Life in the Fast Lane are especially notable.\n\nWalsh's tenure with the Eagles did not preclude him from releasing more work as a solo artist at the same time. The Eagles' slow pace making The Long Run (1979) was convenient in this aspect. He had time to release But Seriously Folks (1978) which produced his famous satire on rock stars, Life's Been Good. He also wrote In the City for the Warriors soundtrack, a song which would later appear on The Long Run.\n\nAll was not well within the ranks of the Eagles, however. Walsh's dissatisfaction with the heavy-handedness of Glenn Frey and Don Henley when it came to creative decisions led him to go so far as to discuss forming another band with bassist Randy Meisner and co-lead guitarist Don Felder (his seriousness here is debatable; when Meisner left and tried to pursue the idea, Walsh definitely wanted to stay with the Eagles). Regardless, the discord in the band led to tensions and hostility so pronounced that Henley was to call Walsh an \"insidious troublemaker.\" The amount of alcohol and drugs circulating didn't help much either; Walsh had developed a drinking problem that he wouldn't be able to shake until the nineties, and the amount of money that some of the band members were snorting up their noses would have been enough to buy a small country.\n\nIt reached the breaking point when Felder and Frey got into a confrontation at a benefit show in 1980. Frey called it quits and the band broke up. Interestingly enough, Walsh seemed to think they were only on hiatus. He told an interviewer in 1981 that they weren't broken up but were just taking a break for solo careers. He stated that the band would no doubt get together again in a bit to record once more. While his hopes were dashed by the official announcement of the Eagles' breakup in 1982, ironically, he turned out to be right in the long run!\n\nIn the eighties, Walsh released the solo albums There Goes the Neighborhood (1981), You Bought It - You Name It (1983), The Confessor (1985), and Got Any Gum (1987). He also got married a third time and fathered a daughter, Lucy, who has entered the music business herself as a singer/pianist/songwriter. After that marriage failed, he was involved with Stevie Nicks for a brief period; Stevie wrote \"Has Anyone Ever Written Anything for You\" for Walsh.\n\nIn 1989, he went on tour as a member of Ringo Starr's All-Starr Band, a collection of former solo musicians that toured together, each one playing a couple songs. These \"all-starrs\" included musicians like Nils Lofgren and Billy Preston. (He was to tour with the band again in 1992, this time joined by former and future Eagles bandmate Timothy B. Schmit). He also recorded an MTV Unplugged in 1989. Despite these positives, a brief attempt to reunite the Eagles in 1990 failed largely due to Frey's disapproval of the lifestyles of Walsh as well as Henley, and Walsh became discouraged. By 1991, he was even telling interviewers that he didn't care about his albums anymore when \"promoting\" Ordinary Average Guy (1991). His alcoholism was just as bad as ever, if not worse, and it had gotten to the point where he couldn't even remember the words to his songs half the time in his 1991 concerts opening for the Doobie Brothers. His 1992 album Songs for a Dying Planet quickly slid into obscurity.\n\nIn 1993, though, things started looking up. Walsh and Frey mended fences and toured together briefly as the \"Party of Two.\" To this day, the Party of Two occasionally resurfaces for corporate gigs and even a public gig once in a blue moon.\n\nThen, the Travis Tritt video for Take It Easy that same year sparked the famous Hell Freezes Over reunion in 1994. The reunion had a condition that Walsh couldn't ignore: Frey demanded that everyone be sober. Finally, Walsh was able to kick the habit that had plagued him for so many years. (In 2005, Walsh's struggle was the inspiration for his song One Day at a Time, and he has appeared at functions to inspire recovering alchoholics many times. Walsh has speculated that his addiction may have been triggered by \"self-medicating\" for his ADD). The MTV special, album, and tour were wildly successful, thrusting Walsh into the spotlight once again as he proved to audiences that he had not lost it - that he was in fact better than ever.\n\nThe upswing continued when a few years later, Walsh married a fourth time to a lady named Denise. While the marriage is now over, she gave him two sons. Additionally, in 1998, he joined the rest of the Eagles as an inductee into the Rock'n'Roll Hall of Fame, and in 2001 he received an honorary doctorate from Kent State University.\n\nThe Eagles toured off and on from 1999-2006, promoting greatest hits packages and a live DVD called Farewell 1 (2005), before releasing what was to be their last new album.\n\nIn 2007, they released the long-awaited Long Road Out of Eden. This album included the Walsh/JD Souther song \"Last Good Time in Town,\" as well as Walsh's cover of the Frankie Miller song \"Guilty of the Crime.\" They toured extensively for this as well.\n\nDespite the busy schedule of the Eagles, Walsh found time for projects of his own. In 2006, his old band the James Gang reunited for a short tour. Walsh also conducted a brief solo tour in the summer of 2007. On a personal note, he married once again; his current wife is Marjorie Bach, sister-in-law to Ringo Starr. With her encouragement, he released his first solo album in twenty years: Analog Man (2012). He engaged in a tour to promote the album, including filming a special CMT Crossroads, in between Eagles tour stops.\n\nIn 2013, the Eagles releaed a documentary called History of the Eagles and toured for two years, playing all over the world. Then, in 2016, Glenn Frey tragically died at the age of 67. Everyone thought the Eagles were finished without their leader and co-founded. Even Don Henley said so.\n\nHowever, Henley changed his mind, and in 2017 Joe Walsh was called upon to join a new Eagles which would now find Glenn's son Deacon and Vince Gill on stage beside him. How long the band will continue like this remains to be seen.\n\nLast updated July 19, 2017\n\nSources\n\n\"Joe Walsh - Child of the Silent Majority.\" Rolling Stone (1975).\n\n\"Joe Walsh: Lonely in the Spotlight.\" Creem (1975).\n\n\"Hell is for Heroes.\" Rolling Stone (1979).\n\n\"Joe Walsh.\" BBC Publications (1983).\n\n\"Joe Walsh: Solo or Not, Joe Walsh Has Stayed in Style.\" Arkansas Democrat-Gazette (1988).\n\n\"Apathetic? Joe Walsh Could Care Less.\" AP (1991).\n\n\"Walsh Enjoys Regrouping of the Eagles.\" Cleveland Plain Dealer (1994).\n\n\"Joe Walsh Is Still Soaring Like an Eagle.\" St. Louis Post-Dispatch (1998).\n\n\"KSU to Honor Dropout Rocker Joe Walsh.\" Cleveland Plain Dealer (2001).\n\n\"Walsh Exits Fast Lane.\" Tampa Tribute (2003).\n\n\"Walsh Helps Eagles Soar Again.\" Ottawa Citizen (2003).\n\n\"Eagles' Walsh Found His Rocky Mountain Way.\" Denver Post (2003).\n\n\"Star Joe Walsh Helping Fight Against P in Hawke's Bay.\" New Zealand Financial Times (2004).\n\n\"Eagles Star Walsh Takes It to the Limit.\" Herald Sun (2004)."}, {"url": "https://articlebio.com/joe-walsh", "page_content": "Joseph Fidler Walsh was born on 1947 20th November in Wichita, Kansas, United States. He is an American record producer, composer, singer, songwriter, and multi-instrumentalist. During his career, he has been a member of five successful rock bands named Ringo Starr & His All-Starr Band, Eagles, Barnstorm, James Gang, and The Party Boys.\n\nJoseph Walsh's father was Robert Newton Filder. His father was killed in a plane crash. He was adopted by his stepfather when he was five years old. His mother was a classically trained pianist. Joe spent his entire childhood in Columbus Ohio.\n\nEducation and career\n\nWhen Joseph Walsh was twelve years old, his family moved to New York City. Then in New York, he went to Montclair High School.\n\nAfter high school, he attended Kent State University. In the university, he spent his time with various bands and after one term, Joseph dropped out of university to follow a career in music.\n\nWanna know where is Joe Walsh as of 2020? Well open the video given below:\n\nFamous Albums\n\nIn the year 1965, The Measles band was formed by four Kent State University students, among them one band member was Joseph Walsh. He was a member of the band from 1965 to 1967. After that, he joined the band named James Gang in 1968.\n\nIn the same year, they played a concert in Detroit for the opening of Cream. In the year 1969, the band released their debut album named ï¿½Yerï¿½ Albumï¿½. The band's other two albums were released in 1970 and 1971 named ï¿½James Gang Rides Againï¿½ and ï¿½Thirdsï¿½ respectively. in the year 1973, he interviewed that things did not work musically as he hoped and he left the band.\n\nFormed A Band Barnstorm\n\nAfter leaving the band, Joseph Walsh moved to Colorado, where he formed a band called Barnstorm. The band had Joe Vitale as the drummer and multi-instrumentalist and Kenny Passarelli as ba s sist. The debut album of the Barnstorm and Walsh was released in 1972 named ï¿½Barnstormï¿½. The album was a critical success but commercially moderate success.\n\nIn the year 1975, Joseph Walsh was invited to join the band named Eagles. The album named ï¿½Hotel Californiaï¿½ was released in the year 1976 December, was the first album by Joseph in the band and the fifth album of the band. Their other album named ï¿½The Long Runï¿½ took two years to complete and was released on 24th September 1979. The album had critically failed but was commercially hit.\n\nWife And Children\n\nJoseph Walsh has been married five times. His first marriage was to Margie Walsh from 1967 to 1970. His other wife includes Stefany Rhodes, Juanita Boyer, and Denise Driscoll. Marjorie Bach is his fifth wife to whom he got married on 13th December 2008.\n\nJoseph Walsh's daughter from his third wife is a musician named Lucy Walsh. His eldest daughter named Emma Kristen died when she was only three years old from 1971-1974. His estimated net worth is $65 million."}, {"url": "https://movie.douban.com/celebrity/1161505/", "page_content": "影人简介 · · · · · ·\n\n\n\nJoe Walsh\n\n命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《... 1947年11月20日出生于肯萨斯州。1969年加入摇滚团James Gang，1975年12月加入老鹰合唱团，是最先发行个人专辑与拥有畅销单曲的团员。1973年Bill Szymczyk就是靠Walsh的推荐才接替原制作人Glyn Johns。Walsh刚加入时，Szymczyk还曾替他担心会影响个人演唱生涯，结果证明Walsh不仅为乐团注入了摇滚的新生Joe Walsh命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《... (展开全部)\n\n1947年11月20日出生于肯萨斯州。1969年加入摇滚团James Gang，1975年12月加入老鹰合唱团，是最先发行个人专辑与拥有畅销单曲的团员。1973年Bill Szymczyk就是靠Walsh的推荐才接替原制作人Glyn Johns。Walsh刚加入时，Szymczyk还曾替他担心会影响个人演唱生涯，结果证明Walsh不仅为乐团注入了摇滚的新生\n\nJoe Walsh\n\n命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《都市牛郎》插曲\"All Night Long\"都是个人代表作，老鹰合唱团解散期间Walsh仍然有新作陆续推出。\n\n有道是合久必分，分久必合，果然，老鹰乐队于1994年又宣告东山再起，几位元老再次重聚。重组后的老鹰立刻马不停蹄地开始全美巡回演\n\nJoe Walsh\n\n出，并于该年推出一张新歌+精选《炼狱之上》(Hell Freeze Over ).专辑精选部分是演唱会的实况，鼎沸的人群、流畅的旋律又一次在耳边回荡。到底“姜是老的辣”，在演唱会上唐·亨利身着一件格子绒衬衣，在万众瞩目下又唱起那首脍炙人口的《加州旅店》，而唐·弗尔德和乔·沃什的吉他技艺更件炉火纯青，开篇大段的吉他 华彩奏得畅快淋漓，重重的鼓点仿佛击在人们的心房，亨利沙亚的嗓音坚实而富磁性，而乐队成员鬓际的白发尤见苍凉。\n\n04年老鹰乐队在墨尔本的演出，walsh的状态依然保持的相当完美。\n\n2011年，老鹰乐队中国之行，walsh让中国观众大呼：这老头声音真有质感。六十岁的年纪唱出了三十岁的味道。"}, {"url": "https://liferampup.com/joe-walsh/", "page_content": "Updated On April 16, 2023\n\nJoe Walsh is a singer. He has received multiple awards and is regarded as one of the world’s greatest guitarists.\n\nWiki, Bio, Family, Siblings, Childhood & Education\n\nDora Jay Fidler and Robert Newton Fidler are the parents of Joseph Fidler Walsh. He was born on November 20, 1947, in Wichita, Kansas. He was raised in Columbus.\n\nJoe finished his education at Montclair High School. He used to play the oboe in the school band. Walsh attended Kent State University but left soon after to pursue music. He was involved with bands while still a student.\n\nJoe Walsh’s Age, Height, Weight, and Body Dimensions\n\nJoe Walsh, born on November 20, 1947, is 74 years old today, July 21, 2022. His height is 1.77 meters, and his weight is 72 kilograms.\n\nJoe Walsh’s Profession & Career\n\nIn 1965, while still a student, Joe Walsh formed the band Measles. He was a member of the James Gang from 1968 to 1971. He released the albums ‘Yer’ Album, ‘James Gang Rides Again,’ ‘Thirds,’ and ‘James Gang Live in Concert’.\n\nFollowing his departure from James Gang, Walsh joined Barnstorm. He contributed to their self-titled debut album and ‘The Smoker You Drink, the Player You Get.’ He also collaborated with REO Speedwagon on the album ‘Ridin’ The Storm Out.’\n\nHe was a member of the Eagles from 1975 to 1980. Their hugely successful album ‘Hotel California’ was released in December 1976. The songs ‘The Long Run’ and ‘Eagles’ followed. Following their reunion, they released two albums, ‘Hell Freezes Over’ and ‘Long Road Out of Eden.’\n\nIn 1973, he released his first solo album. ‘So What,’ ‘But Seriously, Folks,’ ‘There Goes the Neighborhood,’ and ‘You Bought It, You Name It’s followed.\n\nJoe Walsh’s other solo albums include ‘Analog Man,’ ‘Songs for a Dying Planet,’ ‘Ordinary Average Guy,’ ‘Got Any Gum?,’ ‘The Confessor,’ and ‘You Can’t Argue with a Sick Mind.’\n\nAchievements and Awards\n\nJoe Walsh was inducted into the Rock and Roll Hall of Fame in 1998. He has five Grammy Awards from his time with the Eagles. In 2001, he was inducted into the Vocal Group Hall of Fame. In 2011, he was named one of the “100 Greatest Guitarists of All Time” by Rolling Stone.\n\nJoe Walsh’s Wife, Marriage & Relationship\n\nJoes Walsh’s first wife was Margie Walsh. In 1971, he married Stefany Rhodes. He married Juanita Boyer in 1980 after their divorce. In 1988, they divorced. Denise Driscoll was his fourth wife from 1999 to 2006. He married Marjorie Bach in 2008. Lucy, Alden, Emma, and Emerson are his children.\n\nWalsh is also involved in several charitable activities. He has raised funds through a variety of concerts. Several guitarists and bands influenced him musically.\n\nJoe Walsh’s Salary and Net Worth\n\nJoe Walsh’s net worth is estimated to be more than $85 million as of July 2022. He can make this fortune because of his connections with many top brands. He has also released several solo albums and performed with several other artists. He’s also the author of several songs, including the hit “Hotel California.” Walsh has also appeared in films and television shows such as “Better Things,” “Criminal Minds,” “The Blues Brothers,” “Zachariah,” “The Drew Carey Show,” and “Wicked City.”\n\nQuick Facts"}, {"url": "https://biogossip.com/joe-walsh-wife/", "page_content": "American guitarist, Joe Walsh is one of the most experienced and famous musicians. He is five times Grammy award winner and he was considered to be the 54th among 100 greatest of all time.\n\nJoe has married five times in his life. Let’s find out why his four marriage did not last long, how many children does he have, and so on.\n\nIs Joe Walsh still married to Marjorie Bach?\n\nYes, Joe Walsh is still married to his wife, Marjorie Bach. Marjorie is the sister of Barbara Bach who is an American actress and model. They dated for a couple of years before they exchanged wedding vows on 12th December 2008, in Los Angeles which was attended by close friends and family. Since their marriage, the couple has been inseparable as there is not even a single rumor about their divorce.\n\nThey can be often seen attending several events together and is often spotted strolling the street of Los Angeles, holding each other’s hand. Marjorie was previously married to Lord Alexander Rufus Issacs from 1993 to 2008.\n\nHow many wives does Joe Walsh have?\n\nAs we have already mentioned above, Joe has married five times in his life. Among them, his four marriages came to an end through divorces. At first, he tied the wedding knot to Margie Walsh in the 1960s. He again married Stefany Rhodes in the year 1971, but they divorced in 1978.\n\nFor the third time, he tied the wedding knot to Juanita Boyer on 10th April 1980. Unfortunately, their marriage ended in 1988. After that, he married for the fourth time Denis Driscoll on 15th May 1999 and divorced in the year 2006.\n\nDoes Joe Walsh have a Child?\n\nJoe is blessed with four children, two sons, and two daughters from his marriages. He had a daughter, Emma Kristen in 1971 with his second wife but she unexpectedly passed away in a bus accident in 1974.\n\nHis other daughter, Lucy Walsh was born on 3rd December 1982 with his third wife, Juanita. His daughter, Lucy is an American actress. With his fourth wife, Joe welcomed two sons, Emerson Walsh, and Alden Walsh.\n\nPrevious Relationship of Joe Walsh\n\nJoe was previously in a romantic relationship with an American singer, Stevie Nicks in 1983. However, their relationship did not last long so they ended it and parted ways in 1986.\n\nBesides, he had encounters with other celebrities, Connie Hamzy (1975) and Lisa Pritchett-Johnson. Joe also had a relationship with Kristin Casey, an American stripper.\n\nFamily of Joe Walsh\n\nJoe was born to Robert Newton Fidler (father) but his mother’s name is still unavailable. His father was a flight instructor while his mother was a classically trained pianist.\n\nHis stepfather adopted him at the age of five years old. When he was twelve years old, his family moved to New York City, the United States.\n\nWhat college did Joe Walsh go to?\n\nJoe attended Montclair High School in Montclair, New Jersey, and Wichita East High School in Wichita, Kansas. He joined Kent State University, in Kent, Ohio, and graduated from there. He went to Berklee College of Music in Boston, Massachusetts, and learned music.\n\nQuick Facts of Joe Walsh"}, {"url": "https://wiki2.org/en/Joe_Walsh", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican rock musician\n\nMusical artist\n\nJoseph Fidler Walsh (born November 20, 1947)[2] is an American guitarist, singer, and songwriter. Best known as a member of the rock band the Eagles, his five-decade career has also included solo work and stints in two other successful rock bands: James Gang and Ringo Starr & His All-Starr Band. He was also part of the New Zealand band Herbs. In the 1990s, he was a member of the short-lived supergroup The Best.\n\nWalsh has also experienced success both as a solo artist and as a prolific session musician, being featured on a wide array of other artists' recordings. In 2011, Rolling Stone placed him at the No. 54 spot on its list of \"100 Greatest Guitarists of All Time\".[3]\n\nIn the mid-1960s, after attending Kent State University, Walsh played with several local Ohio-based bands before reaching a national audience as a member of the James Gang, whose hit song \"Funk #49\" highlighted his skill as both a guitarist and singer. Roger Abramson, a concert producer and artist manager, signed the James Gang to a management agreement with BPI in Cleveland. After leaving the James Gang in 1972, he formed Barnstorm with Joe Vitale, a college friend from Ohio, and Kenny Passarelli, a bassist from Colorado, where Walsh had moved after leaving Ohio. While the band stayed together for three albums over three years, its works were marketed as Walsh solo projects. The last Barnstorm album, 1974's So What contained significant guest contributions from several members of the Eagles, a group that had recently hired Walsh's producer, Bill Szymczyk.\n\nAt Szymczyk's suggestion, Walsh joined the Eagles in 1975 as the band's guitarist and keyboardist following the departure of their founding member Bernie Leadon, with Hotel California being his first album with the band.[4] In 1998, a reader's poll conducted by Guitarist magazine selected the guitar solos on the track \"Hotel California\" by Walsh and Don Felder as the best guitar solos of all time.[5] Guitar World magazine listed it at eighth of the Top 100 Guitar Solos.[6]\n\nBesides his work with his several bands, he has released 12 solo studio albums, six compilation albums, and two live albums. His solo hits include \"Rocky Mountain Way\", \"Life's Been Good\", \"All Night Long\", \"A Life of Illusion\", and \"Ordinary Average Guy\".\n\nAs a member of the Eagles, Walsh was inducted into the Rock and Roll Hall of Fame in 1998, and into the Vocal Group Hall of Fame in 2001. The Eagles are considered to be one of the most influential bands of the 1970s, and they remain one of the best-selling American bands in the history of popular music.[7] His creative contribution to music has received praise from many of the best rock guitarists, including Led Zeppelin's Jimmy Page, who said, \"He has a tremendous feel for the instrument. I've loved his style since the early James Gang.\"[8] Eric Clapton said that \"He's one of the best guitarists to surface in some time. I don't listen to many records, but I listen to his.\"[8] The Who's guitarist, Pete Townshend, said \"Joe Walsh is a fluid and intelligent player. There're not many like that around.\"[3][8]\n\nYouTube Encyclopedic\n\n1 / 5 Views: 3 926 596 5 239 284 3 656 677 1 501 740 140 520\n\nJoe Walsh - One Day At A Time (Official Video)\n\nJoe Walsh - Life's Been Good (Live Spoken Word Version)\n\nSheryl Crow & Joe Walsh Perform 'Still the Good Old Days' & 'Walk Away' | CMT Crossroads\n\nJoe Walsh \"Funk #49\" Guitar Center Sessions on DIRECTV\n\nJoe Walsh \"Lucky That Way\" Guitar Center Sessions on DIRECTV Transcription\n\nEarly life and education\n\nWalsh was born on November 20, 1947, in Wichita, Kansas. His father, Lt. Robert Newton Fidler, was a flight instructor for the Lockheed F-80 Shooting Star in the United States Air Force and died in a plane crash in Okinawa on July 22, 1949. Walsh's mother was a classically trained pianist of Scottish and German ancestry.\n\nWalsh was adopted by his stepfather at the age of five and given his stepfather's surname, but retained Fidler as his middle name. In the 1950s, it was common practice for children to take the name of their stepfather for Social Security, school registration, and health records.[9] Walsh and his family lived in Columbus, Ohio, for a number of years during his youth. When he was twelve, his family moved to New York City. Later, Walsh moved to Montclair, New Jersey and attended Montclair High School, where he played oboe in the school band.\n\nWalsh acquired his first guitar at the age of 10, and upon learning The Ventures' \"Walk Don't Run\", decided that he wanted to pursue a career as a guitarist.[10] Inspired by the success of the Beatles, he replaced Bruce Hoffman as the bass player in the locally popular group, the Nomads in Madison, New Jersey, beginning his career as a rock musician.\n\nAfter high school, Walsh briefly attended Kent State University, where he spent time in various bands playing around the Cleveland, Ohio, area, including the Measles. The Measles recorded for Super K Productions' Ohio Express the songs \"I Find I Think of You\", \"And It's True\", and \"Maybe\" (an instrumental version of \"And It's True\"). He planned to major in English and minor in music. Walsh has also stated he was present during the Kent State massacre in 1970. Walsh commented in 2012: \"Being at the shootings really affected me profoundly. I decided that maybe I don't need a degree that bad.\"[11] After one term, he dropped out of college to pursue his musical career.[8]\n\nMusical career\n\n1965–1967: The Measles (Joe Walsh years)\n\nThe Measles, an Ohio garage bar band, were formed in 1965 by four Kent State University students, one of whom was Joe Walsh. Two tracks on the Ohio Express's Beg Borrow and Steal album, \"I Find I Think Of You\" and \"And It's True\" (both featuring Joe Walsh vocals), were actually recorded by the Measles, led by Walsh. Additionally, an instrumental version of \"And It's True\" was recorded by the Measles, re-titled \"Maybe\" and released as the B-side of the \"Beg Borrow and Steal\" single.\n\n1968–1971: James Gang\n\nWalsh (left) with the James Gang, 1970\n\nAround Christmas 1967, James Gang guitarist Glenn Schwartz, who turned out to be AWOL from the army and was breaking up with his wife, decided to leave the band to move to California, where he ended up forming the band Pacific Gas & Electric.[12] Days later, Walsh, a friend of Schwartz's, knocked on Jim Fox's door and asked to be given a tryout as Schwartz's replacement. Walsh was accepted and the band continued as a five piece for a short time until Phil Giallombardo, who was still in high school at the time, left. Bill Jeric and Walsh worked together on guitar parts, but Jeric left as well in the spring of 1968. He was replaced by a returning Ronnie Silverman, who had been discharged from the military.\n\nIn May 1968, the group played a concert in Detroit at the Grande Ballroom, opening for Cream. At the last minute, Silverman told the others that he would not join them at the show. The band, desperately in need of the money, took to the stage as a trio. They liked their sound as a threesome and decided to remain that way.\n\nIn 1968, the band signed with manager Mark Barger, who was handling the career of fellow Ohio outfit the Lemon Pipers, who had just scored a big hit with \"Green Tambourine.\" Barger put the Gang in touch with ABC Records staff producer Bill Szymczyk, who signed them to ABC's new Bluesway Records subsidiary in January 1969.[12]\n\nThey released their debut album, Yer' Album, in 1969. In November 1969, bassist Tom Kriss decided he was no longer into the music and left to be replaced by Dale Peters, who was brought in from a group called The Case of E.T. Hooley. The addition of Peters created the most successful incarnation of the James Gang. Walsh proved to be the band's star attraction, noted for his innovative rhythm playing and creative guitar riffs. In particular he was known for hot-wiring the pick-ups on his electric guitars to create his trademark \"attack\" sound.[13] The James Gang had several minor hits and became an early album-oriented rock staple for the next two years. It was during 1969 that Walsh sold his Les Paul Guitar to Jimmy Page.[14] Later in 1969, the group's record producer, Szymczyk, arranged for the band to appear in the \"electric Western\" film Zachariah, with two James Gang songs, \"Laguna Salada\" and \"Country Fever,\" also being used. For the recording of these two songs, vocalist Kenny Weiss was brought in to allow Walsh to focus on his guitar playing; he was gone by the time the group arrived in Mexico to shoot their movie scenes. \"Laguna Salada\" and \"Country Fever\" later reappeared as bonus tracks on the 2000 re-release of The James Gang Greatest Hits.[15]\n\nShortly before the release of their second album James Gang Rides Again, they opened a show for the Who in Pittsburgh. Their guitarist Pete Townshend met with the James Gang before they left, impressed enough to invite them on the Who's subsequent European tour. When Walsh was asked about it, he said, \"Pete's a very melodic player and so am I. He told me that he appreciated my playing. I was flattered beyond belief because I didn't think I was that good.\"[8]\n\nThe James Gang's next two albums, James Gang Rides Again (1970) and Thirds (1971), produced such classics as \"Funk #49\" and \"Walk Away\". The album James Gang Live at Carnegie Hall was Walsh's last album with them, as he became dissatisfied with the band's limitations.\n\nThe two remaining members, Peters and Fox, carried on with lead vocalist Roy Kenner and guitarist Domenic Troiano (both ex-members of the Canadian band Bush) for two albums, Straight Shooter and Passin' Thru, both released in 1972. But in recent interviews, Fox stated that things did not work out musically with Troiano as hoped, so Troiano left the band in 1973 and later, in late 1974, joined the Guess Who.\n\n1971–1975: Barnstorm\n\nIn December 1971, Walsh left the James Gang. Steve Marriott, frontman guitarist of Humble Pie, invited him to move to England and join his band, which Peter Frampton had left, but Walsh declined.[8] Instead he moved to Colorado and formed a band called Barnstorm, with drummer and multi-instrumentalist Joe Vitale, and bassist Kenny Passarelli, although both of their albums credited Walsh as a solo artist. They started recording their debut album immediately after forming, but at the time there were only Walsh and Vitale on these sessions. Chuck Rainey did the first bass tracks on the album but these were soon replaced by Passarelli. Walsh and Barnstorm released their debut album, the eponymous Barnstorm, in October 1972. After taking a cue from Townshend, Walsh utilized the ARP Odyssey synthesizer to great effect on such songs as \"Mother Says\" and \"Here We Go\". Walsh also experimented with acoustic guitar, slide guitar, effects pedals, fuzzbox, talk box, and keyboards as well as running his guitar straight into a Leslie speaker 122 to get swirly, organ-like guitar tones. The album was a critical success, but had only moderate commercial success. The follow-up, The Smoker You Drink, the Player You Get, released in June 1973, was marketed under Walsh's name (although officially a Barnstorm album) and was their commercial breakthrough. It peaked at No. 6 on the US Billboard chart. The first and leading single, \"Rocky Mountain Way\", received heavy airplay and reached No. 23 on the US Top 40 chart.[16] It featured new member, keyboardist Rocke Grace, and Walsh shared the vocals and songwriting with the other three members of the band. As a result, a variety of styles are explored on this album. There are elements of blues, jazz, folk, pop, and Caribbean music. In 1974, Barnstorm disbanded and Walsh continued as a solo artist.[17]\n\nIn late 1974, Walsh played slide guitar on Vitale's debut solo album Roller Coaster Weekend. Walsh was taught the slide technique by Duane Allman, who played on Eric Clapton's Layla of Derek and the Dominos.[18]\n\nBarnstorm's last tour was in the spring of 1975, shortly after Joe joined Eagles.\n\n1975–1980: Eagles\n\nIn 1975, Walsh was invited to join the Eagles as founding member Bernie Leadon's replacement. There was some initial concern as to Walsh's ability to fit in with the band, as he was considered far too \"wild\" for the Eagles, especially by their drummer and co-lead vocalist, Don Henley.[19]\n\nReleased on December 8, 1976, Hotel California was the band's fifth studio album and the first to feature Walsh. The album took a year and a half to complete, a process which, along with touring, drained the band.\n\nThe second single from the album was the eponymous title track, which topped the charts in May 1977 and became one of the Eagles' signature songs next to \"Take It Easy\" and \"Desperado\". It features Henley on lead vocals, with a guitar duet performed by Felder and Walsh.\n\nThe hard rock \"Life in the Fast Lane\", released on May 3, 1977, was based on a riff by Walsh. It reached No. 11 on the charts and helped establish Walsh's position in the band.\n\nHotel California was the last album to feature founding member Randy Meisner, who abruptly left the band after the 1977 tour. He was replaced by the same musician who had succeeded him in Poco: Timothy B. Schmit.\n\nIn 1977, the band, minus Don Felder, performed instrumental work and backing vocals for Randy Newman's album Little Criminals, including \"Short People,\" which has backing vocals by Frey and Schmit.\n\nThe Eagles went into the recording studio in 1977 to begin work on their next album, The Long Run. The album took two years to complete. The Long Run was released on September 24, 1979. Considered a disappointment by some music critics for failing to live up to Hotel California, it proved a huge commercial hit nonetheless; the album topped the charts and sold 7 million copies. In addition, it included three Top 10 singles—\"Heartache Tonight\", the title track and \"I Can't Tell You Why\". \"In the City\" by Walsh also received considerable airplay. The band also recorded two Christmas songs during these sessions, \"Funky New Year\"[21] and \"Please Come Home for Christmas\" which was released as a single in 1978 and reached No. 18 on the charts. In 1980, the band broke up.[22]\n\n1973–2012: solo career\n\nWalsh has released twelve solo studio albums.\n\nIn December 1974, Walsh released his first solo album that was not considered a Barnstorm project, So What, which contained more introspective material such as \"Help Me Through the Night\" and \"Song for Emma\", a tribute to Walsh's daughter who had been killed in a car accident that April. On a few tracks, Don Henley, Glenn Frey and Randy Meisner of the Eagles contributed backing vocals.\n\nIn March 1976, Walsh released a live album, You Can't Argue with a Sick Mind, which also featured the Eagles.\n\nAs the Eagles struggled to record their follow-up to Hotel California, Walsh re-ignited his solo career with the critically well-received album, But Seriously, Folks... in May 1978. It contained the single \"Life's Been Good\", his comedic depiction of rock stardom, which peaked at No. 12 on the Billboard Hot 100[23] and remains to date his biggest solo hit. Walsh also contributed \"In the City\" to The Warriors soundtrack in 1979, a song penned and sung by Walsh that was later rerecorded for the Eagles' studio album, The Long Run.[24]\n\nFollowing the breakup of the Eagles in July 1980, Walsh continued to release solo albums throughout the 1980s, but sales did not meet the same level of his earlier successes.[25]\n\nThere Goes the Neighborhood was Walsh's first album since the demise of the Eagles, and it peaked at No. 20 on the Billboard 200. The album only spawned one single, \"A Life of Illusion\", which became one of Walsh's most popular songs. The single also topped the Hot Mainstream Rock Tracks chart, in 1981.\n\n\"A Life of Illusion\" was recorded in 1973 with Walsh's first solo band Barnstorm but was not completed. The overdubs and final mixes were completed during the There Goes the Neighborhood sessions and released on the album. The promotional video for the track shows the making of the album's cover. This song also appeared in the opening credits of The 40-Year-Old Virgin and appears as the first song on its soundtrack.\n\nIn May 1983, Walsh released You Bought It – You Name It; the album was received negatively by the majority of music critics, while other reviewers noted good points to the album. It was also not as successful as Walsh's previous albums, peaking at No. 48 on the Billboard 200. Walsh found moderate success with the single \"Space Age Whiz Kids\", about the pinnacle of the 1980s video arcade craze. The album contains hard rock songs such as \"I Can Play That Rock & Roll\" and a cover of the Dick Haymes track, \"Love Letters\". It also contains more introspective material such as \"Class of '65\", and contains a song titled \"I.L.B.T.s\", an acronym for \"I Like Big Tits\".\n\nWalsh's new girlfriend Stevie Nicks was involved in his next album, The Confessor. Her old friend Keith Olsen was hired to produce the album and the musicians were prolific LA session musicians including Jim Keltner, Mike Porcaro, Waddy Wachtel, Randy Newman, Alan Pasqua, and many other musicians with whom Walsh had never worked.[26]\n\nIn 1987, Walsh released his final solo album of the 1980s, Got Any Gum?, which was produced by Terry Manning, and features vocal contributions from J. D. Souther and Survivor's lead vocalist Jimi Jamison, but the album was a commercial disappointment.\n\nIn 1991, Ordinary Average Guy, his ninth solo studio album, and its title track single, were released on the Epic label. The album features Ringo Starr, Jimi Jamison, and drummer Joe Vitale from Walsh's former band Barnstorm. Vitale also sings the lead vocals on the final track of the album, \"School Days\".\n\nIn 1992, Walsh released what appeared to be his final album (until 2012), Songs for a Dying Planet, his tenth solo studio album. Like its predecessor, it was released on the Epic label. Keen to re-establish himself after receiving some poor reviews for his previous album, Walsh enlisted his former producer Bill Szymczyk. His song \"Vote for Me\" was a minor success, peaking at No. 10 on the Hot Mainstream Rock Tracks chart.\n\nWalsh's song \"One Day at a Time\" was released in 2012 and details his struggles with alcohol and drug abuse earlier in his career. The song appeared on Walsh's album Analog Man, which was released on June 5, 2012. The album was co-produced by Jeff Lynne, with Tommy Lee James co-writing some of the album's tracks.[27]\n\nEagles reunion\n\nWalsh performing with the Eagles, 2008\n\nAn Eagles country tribute album titled Common Thread: The Songs of the Eagles was released in 1993, thirteen years after the split. Travis Tritt insisted on having the Long Run-era Eagles in his video for \"Take It Easy\" and they agreed. Following years of public speculation, the band formally reunited the following year. The line-up comprised the five Long Run-era members—Frey, Henley, Walsh, Felder, and Schmit—supplemented by Scott Crago (drums), John Corey (keyboards, guitar, backing vocals), Timothy Drury (keyboards, guitar, backing vocals), and Al Garth (saxophone, violin) on stage.\n\n\"For the record, we never broke up, we just took a 14-year vacation,\" announced Frey at their first live performance in April 1994. The ensuing tour spawned a live album titled Hell Freezes Over (named for Henley's recurring statement that the band would get back together \"when hell freezes over\"), which debuted at No. 1 on the Billboard album chart. It included four new studio songs, with \"Get Over It\" and \"Love Will Keep Us Alive\" both becoming Top 40 hits. The album proved as successful as the tour, selling 6 million copies in the U.S. The tour was interrupted in September 1994 because of Frey's serious recurrence of diverticulitis, but it resumed in 1995 and continued into 1996.[28] In 1998, the Eagles were inducted into the Rock and Roll Hall of Fame. For the induction ceremony, all seven Eagles members (Frey, Henley, Leadon, Meisner, Felder, Walsh, and Schmit) played together for two songs, \"Take It Easy\" and \"Hotel California\". Several subsequent reunion tours followed (without Leadon or Meisner), notable for their record-setting ticket prices.[29][30]\n\nThe Eagles performed at the Mandalay Bay Events Center in Paradise, Nevada on December 28 and 29, 1999, followed by a concert at the Staples Center in Los Angeles on December 31. These concerts marked the last time Felder played with the band and these shows (including a planned video release) later formed part of a lawsuit filed by Felder against his former bandmates.\n\nThe concert recordings were released on CD as part of the four-disc Selected Works: 1972–1999 box set in November 2000. Along with the millennium concert, this set included the band's hit singles, album tracks and outtakes from The Long Run sessions. Selected Works received platinum certification from the RIAA in 2002.[31]\n\nThe band resumed touring in 2001, with a line-up consisting of Frey, Henley, Walsh and Schmit, along with Steuart Smith (guitars, mandolin, keyboards, backing vocals; essentially taking over Felder's role), Michael Thompson (keyboards, trombone), Will Hollis (keyboards, backing vocals), Scott Crago (drums, percussion), Bill Armstrong (horns), Al Garth (saxophone, violin), Christian Mostert (saxophone), and Greg Smith (saxophone, percussion).\n\nIn 2003, the Eagles released a greatest hits album, The Very Best Of.[32] The two-disc compilation was the first that encompassed their entire career, from Eagles to Hell Freezes Over. It debuted at No. 3 on the chart and eventually gained triple platinum status. The album included a new single, the September 11 attacks-themed \"Hole in the World\". Also in 2003, Warren Zevon, a longtime Eagles friend, began work on his final album, The Wind, with the assistance of Henley, Walsh, and Schmit.\n\nOn June 14, 2005, the Eagles released a new 2-DVD set titled Farewell 1 Tour-Live from Melbourne, featuring two new songs: Frey's \"No More Cloudy Days\" and Walsh's \"One Day at a Time\". A special edition 2006 release exclusive to Walmart and affiliated stores includes a bonus audio CD with three new songs: a studio version of \"No More Cloudy Days\", \"Fast Company\", and \"Do Something\".[33]\n\nIn 2007, the Eagles consisted of Frey, Henley, Walsh, and Schmit. On August 20, 2007, \"How Long\", written by J. D. Souther, was released as a single to radio with an accompanying online video at Yahoo! Music. It debuted on television on Country Music Television during the Top 20 Countdown on August 23, 2007. The band had performed the song as part of their live sets in the early to mid-1970s, but did not record it at the time because Souther wanted to reserve it for use on his first solo album. Souther had previously worked with the Eagles, co-writing some of their biggest hits, including \"Best of My Love\", \"Victim of Love\", \"Heartache Tonight\", and \"New Kid in Town\".\n\nOn October 30, 2007, the Eagles released Long Road Out of Eden, their first album of all-new material since 1979. For the first year after the album's release, it was available in the U.S. only via the band's website and at Walmart and Sam's Club stores.[34] It was commercially available through traditional retail outlets in other countries. The album debuted at number 1 in the U.S.,[35] the UK, Australia, New Zealand, the Netherlands, and Norway. It became their third studio album and seventh release overall to be certified at least seven times platinum by RIAA. Henley told CNN, \"This is probably the last Eagles album that we'll ever make.\"[36] The Eagles made their awards show debut on November 7, 2007, when they performed \"How Long\" live at the Country Music Association Awards.[37]\n\nOn January 28, 2008, the second single of Long Road Out of Eden was released. \"Busy Being Fabulous\" peaked at No. 28 on the Billboard Hot Country Songs chart[38] and at No. 12 on the Billboard Hot Adult Contemporary Tracks chart.[38] The Eagles won their fifth Grammy in 2007, in the category Grammy Award for Best Country Performance by a Duo or Group with Vocal for \"How Long\".\n\nOn March 20, 2008, the Eagles launched their world tour in support of Long Road Out of Eden at The O2 Arena in London. The Long Road Out of Eden Tour concluded the American portion of the tour at Rio Tinto Stadium (now known as America First Field) in Sandy, Utah on May 9, 2009. It was the first concert ever held in the new soccer stadium. The tour traveled to Europe, with its final concert date on July 22, 2009, in Lisbon. The band spent the summer of 2010 touring North American stadiums with the Dixie Chicks and Keith Urban. The tour expanded to England as the headline act of the Hop Farm Festival on July 1, 2011.\n\nAsked in November 2010 whether the Eagles were planning a follow-up to Long Road Out of Eden, Schmit replied, \"My first reaction would be: no way. But I said that before the last one, so you never really know. Bands are a fragile entity and you never know what's going to happen. It took a long time to do that last album, over a span of years, really, and it took a lot out of us. We took a year off at one point. I'm not sure if we're able to do that again. I wouldn't close the door on it, but I don't know.\"[39] Walsh said in 2010 that there might be one more album before the band \"wraps it up\".[40]\n\nIn February 2013, the Eagles released a career spanning documentary called History of the Eagles and kicked off the supporting tour with 11 arena dates from July 6 to 25.[41] Henley said that the tour, which would continue until 2015,[42] \"could very well be our last... we're gonna include at least one former band member in this tour and kinda go back to the roots, and how we created some of these songs. We're gonna break it down to the fundamentals and then take it up to where it is now.\"[43]\n\nOriginal Eagles guitarist Bernie Leadon also appeared on the tour. Walsh stated, \"Bernie's brilliant, I never really got a chance to play with him, but we've been in contact. We see him from time to time, and I'm really glad he's coming because it's going to take the show up a notch, and I'm really looking forward to playing with him, finally.\"[44] It has been reported that former members Randy Meisner and Don Felder will not appear.[42] Meisner had been invited but could not participate due to health problems, while Felder was reportedly not invited due to ongoing legal disputes with the band.[42]\n\nOther bands\n\nIn late 1984, Walsh was contacted by Australian musician Paul Christie, the former bassist for Mondo Rock. Christie invited him to come to Australia to perform with the Party Boys, an all-star band with a floating membership of well-known Australian rock musicians, including the critically acclaimed guitarist Kevin Borich, with whom Walsh became good friends. Walsh accepted and performed with the Party Boys on their late-1984–early-1985 Australian tour and appeared on their live album, You Need Professional Help. He remained in Australia for some time after the tour, putting together the short-lived touring band \"Creatures From America\", with Waddy Wachtel (guitar), Rick Rosas (bass guitar), and Australian drummer Richard Harvey (Divinyls, the Party Boys)[25] In 1987, Walsh returned to the United States to work on his album Got Any Gum?, which was produced by Terry Manning and features vocal contributions from J. D. Souther and Survivor's lead singer Jimi Jamison. After the album's commercial disappointment, Walsh decided to return to Australia in 1989 to tour with another incarnation of the Party Boys. Walsh also toured with Ringo Starr & His All-Starr Band in 1989 and 1992, alternating a handful of his best-known songs with Starr's and tunes by other members of the All-Starr Band.[45] In 1989, Walsh recorded an MTV Unplugged with the R&B musician Dr. John. Also in 1989 Walsh filmed a live concert from the Wiltern Theater in Los Angeles with Etta James and Albert Collins, called Jazzvisions: Jump the Blues Away.[46] While producing their Homegrown album in 1989, Walsh briefly joined New Zealand reggae band Herbs. Although he had left by the time of its 1990 release, he still appears as lead singer on two tracks, \"Up All Night\" and \"It's Alright\". The album includes the first recording of his \"Ordinary Average Guys\" (sung by late Herbs and Be Bop Deluxe bassist Charlie Tumahai), which subsequently became a solo hit for Walsh as \"Ordinary Average Guy\".[47]\n\nIn late 1990, Walsh was part of a band called the Best, along with keyboardist Keith Emerson, bassist John Entwistle, guitarist Jeff \"Skunk\" Baxter and drummer Simon Phillips. The band performed several shows in Hawaii and Japan, with a live video resulting.[48]\n\nIn 1993, Walsh teamed up with Glenn Frey for the \"Party of Two\" tour in the United States. Also in 1993, Walsh, Terry Reid, Nicky Hopkins, Rick Rosas, and Phil Jones put together an informal group called The Flew. They played one show at The Coach House in San Juan Capistrano. This was Nicky Hopkins' last public performance before his passing.[49][50]\n\nIn 1996, James Gang did a reunion for President Bill Clinton. The band consisted of their \"classic\" line-up (Walsh, Peters, Fox); they performed at the Cleveland State University Convocation Center on November 4, 1996.\n\nIn 1998, ABC wanted to use a classic rock song rock for Monday Night Football that year, so they asked Walsh to rewrite the lyrics to \"Rocky Mountain Way\" for the quarterback John Elway of the Denver Broncos. \"Rocky Mountain Elway\" was the new title of the song and Walsh appeared in a video that ABC showed on Monday Night Football.\n\n2000s and 2010s\n\nIn June 2004, Walsh performed at Eric Clapton's Crossroads Guitar Festival in Dallas, Texas. He was also featured in September 2004 at the Strat Pack, a concert held in London, England, to mark the 50th anniversary of the Fender Stratocaster guitar. In 2006, Walsh reunited with Jim Fox and Dale Peters of the James Gang for new recordings and a 15-date summer reunion tour.[51] The tour lasted into the fall.\n\nIn 2008, Walsh appeared on the Carvin 60th Anniversary Celebration DVD as a celebrity endorser. In the recorded interview, he highly praised Carvin Guitars and claims that the bridge design is \"just like the first Les Paul models. I can't even get Gibson to reissue it.\"[25]\n\nKent State University awarded Walsh an honorary degree in music in December 2001.[52] In May 2012, the Berklee College of Music awarded Walsh, along with other members of the Eagles, an honorary doctorate for his accomplishments in the field of music.[53]\n\nNotable appearances\n\nWalsh performing with the Eagles in 2009\n\nIn 1974, Walsh produced Dan Fogelberg's Souvenirs album and played the guitar, electric guitar, 12 string guitar, ARP bass and provided backing vocals. He also contacted Graham Nash to sing harmony vocals on \"Part of the Plan\", which helped send the album to No. 17 on the 1975 Billboard album chart.[54]\n\nIn 1973 Walsh supplied the slide guitar solo on Michael Stanley's song \"Rosewood Bitters\". Walsh later lifted part of that solo and used it prominently in the Eagles' hit \"Life in the Fast Lane\".\n\nIn 1981, Walsh and former Barnstorm bandmate, Joe Vitale, went to work on old friend John Entwistle's fifth solo album Too Late the Hero, whenever they were free to work on it. The album turned out to become John Entwistle's best-charting solo album, with hit singles \"Talk Dirty\" and \"Too Late the Hero\".[55]\n\nWalsh was a background musician (1st guitar solo) on Eagles bandmember Don Henley's 1982 hit \"Dirty Laundry\" (listed as such in the liner notes of I Can't Stand Still and Actual Miles: Henley's Greatest Hits). Walsh has also contributed to albums by Ringo Starr; America; REO Speedwagon; Jay Ferguson; Andy Gibb; Wilson Phillips; Emerson, Lake & Palmer; and Steve Winwood; and to the Richard Marx hit single \"Don't Mean Nothing\".[56]\n\nWalsh was a regular guest DJ on Los Angeles radio station KLOS during the mid-1980s. They had a Saturday evening feature, with celebrity guest-hosts taking over the microphone (Walsh was the guest host far more frequently than any other). He was also a frequent guest and guest-host of Detroit and Chicago radio personality Steve Dahl.[57]\n\nOnscreen, Walsh has appeared in The Blues Brothers, Promised Land, The Drew Carey Show, Duckman, MADtv, Live from Daryl's House, Rock the Cradle, Zachariah.,[57] and The Conners\n\nIn October 2004, Walsh undertook speaking engagements in New Zealand to warn against the dangers of substance abuse. He said the visit was a \"thank you\" to people who took him to Otatara Pa when he toured New Zealand with reggae band Herbs while under heavy alcohol and cocaine addictions in 1989, an experience he has cited as the beginning of a long journey back to good health.[58] At Otatara Pa in 2004 Walsh said, \"This is a special place, and it is very special to me. It was here on a visit many years ago, up on the hills, that I had a moment of clarity. I don't understand it, but I reconnected with my soul, and I remembered who I used to be. I admitted I had problems and I had to do something about it. It was the beginning of my recovery from my addiction to alcohol and drugs, and when I got back to America it gave me the courage to seek help.\"[59]\n\nOn February 12, 2012, Walsh appeared on stage with Paul McCartney, Bruce Springsteen, Dave Grohl, and McCartney's band at the Staples Center in Los Angeles to close out the Grammy Awards.[57] Walsh also appeared on the 60th Episode of Live from Daryl's House with Daryl Hall, which premiered on November 15, 2012.[60]\n\nOn February 9, 2014, Walsh was featured in several songs on the CBS special The Night That Changed America: A Grammy Salute to The Beatles.[61]\n\nIn 2014, Walsh made a guest appearance on Foo Fighters' eighth studio album Sonic Highways.[62]\n\nOn May 24, 2016, Walsh appeared on NBC's The Voice in which he played slide guitar, talk box and performed Rocky Mountain Way with contestant Laith Al-Sall\n\nJames Gang at 2022 VetsAid concert\n\nOn September 3, 2022, Walsh appeared in London, with recently reunited James Gang, at the Taylor Hawkins Tribute Concert at Wembley Stadium which was simulcasted live and worldwide on the web, television and streaming platforms; notably, on streaming service Paramount + which aired a live complete/full version of the 339 minute concert that was uncut without commercials. For their final song, Dave Grohl played with James Gang on 'Funk #49' as a 2nd/backup drummer. Walsh sang lead vocals and played lead guitar (a PRS), including slide guitar, for 3 songs.\n\nWalsh also appeared with the James Gang at the September 27, 2022 Taylor Hawkins Tribute Concert at the Kia Forum in Inglewood, California, near Los Angeles[63] As in London, their three song set consisted of \"Walk Away,\" \"The Bomber: Closet Queen / Boléro / Cast Your Fate to the Wind\" and \"Funk #49\" with Dave Grohl as the second drummer on the latter.[64]\n\nAt the 2022 VetsAid benefit, Joe Walsh did double duty, performing a nine song set with the James Gang[65] then returning for a four song finale backed by Nathan East, Joe Vitale and Tom Bukovac. Walsh was joined by Dave Grohl, who played guitar on \"Life's Been Good.\" On \"Rocky Mountain Way,\" Dave Grohl played drums, the Breeders sang backing vocals and Roy Orbison III, godson of Walsh and grandson of Roy Orbison, played guitar.[66][67][68]\n\nInfluences\n\nWalsh cites influences from rock and pop bands and guitarists, many of whom he has encountered on concert tours: Les Paul, Jimi Hendrix, B.B. King, Chuck Berry, Little Richard, Eric Clapton, the Rolling Stones, the Beach Boys, Jeff Beck, the Beatles, Jimmy Page and Led Zeppelin, Ritchie Blackmore and Deep Purple, Manfred Mann, Duane Allman and The Allman Brothers, Ronnie Wood and The Faces, Pete Townshend and The Who, and The Ventures. In turn, he has influenced Dan Fogelberg, Maroon 5, Kenny Chesney, Jonny Lang, Blitzen Trapper, the Fabulous Thunderbirds, and George Thorogood.[69] Duane Allman of the Allman Brothers Band taught Walsh how to play the slide guitar.[70]\n\nPublic service\n\nWalsh is active in charity work and has performed in a number of concerts to raise money for charitable causes. He has also been a personal contributor to a number of charity causes including halfway houses for displaced adult women in Wichita, Kansas. Walsh funded the first talent-based scholarship at Kent State University in 2008.[71]\n\nWalsh's love of Santa Cruz Island grew into a lifelong commitment to conserve the environment there, and he has been active in preserving the island's parks. He is President of the Santa Cruz Island Foundation, and has served on the Foundation's board since the 1980s.\n\nWalsh had often joked about running for office, announcing a mock presidential campaign in 1980 and a vice presidential campaign in 1992. Walsh ran for President of the United States in 1980, promising to make \"Life's Been Good\" the new national anthem if he won, and ran on a platform of \"Free Gas For Everyone\".[72] Though Walsh was only 32 at the time of the election and thus would not have met the 35-year-old requirement to actually assume office, he said that he wanted to raise public awareness of the election.[73] In 1992 Walsh ran for vice president with Rev. Goat Carson under the slogan \"We Want Our Money Back!\"[74]\n\nIn an interview to promote his album Analog Man in 2012, Walsh revealed he was considering a serious bid for political office. \"I think I would run seriously, and I think I would run for Congress,\" Walsh told WASH in Washington, D.C. \"The root of the problem is that Congress is so dysfunctional. We're dead in the water until Congress gets to work and passes some new legislation to change things.\"[74]\n\nIn 2017, Walsh contacted others in the music industry, including the Zac Brown Band, Gary Clark Jr., and Keith Urban, to try to organize and perform what became VetsAid[75] – a concert series along the lines of Willie Nelson's Farm Aid.\n\nPersonal life\n\nJoe Walsh, WB6ACU, on ham radio\n\nWalsh has been married five times.[76] He was married briefly to Margie Walsh in the 1960s, to Stefany Rhodes from 1971 to 1978, to Juanita Boyer from 1980 to 1988, and to Denise Driscoll from 1999 to 2006. Walsh married Marjorie Bach (sister of Barbara Bach and sister-in-law of Ringo Starr)[45] in Los Angeles on December 13, 2008.[77] His sister-in-law, Susan Walsh, has been a missing person since 1996.[78]\n\nWalsh's daughter Lucy Walsh is a musician who has worked with Ashlee Simpson and others. She released her debut solo album, Lost in the Lights, in 2007.[79]\n\nWalsh's eldest daughter, Emma Kristen, was born in 1971 and died in 1974 at 3 years of age as a result of injuries suffered in an automobile accident on her way to nursery school. Her story inspired the track \"Song for Emma\" on Walsh's solo album So What released later that year. In her memory, he had a fountain and memorial plaque placed in a park in which she played, North Boulder Park in Boulder, Colorado. He has said that the album name So What was a result of Emma's death, that nothing else seemed meaningful or important in the months that followed. The strain eventually contributed to Walsh's divorce from his second wife Stefany.[76][80] While touring with singer Stevie Nicks in 1984, Walsh took Nicks to the park's fountain; Nicks subsequently immortalized this story in her song \"Has Anyone Ever Written Anything for You?\" on her 1985 album Rock A Little. Nicks told the UK's The Daily Telegraph in 2007 that Walsh had been \"the great love of my life.\"[81] \"Joe and I broke up because of the coke,\" she elaborated to Q. \"He told my friend and singer Sharon [Celani], 'I'm leaving Stevie, because I'm afraid that one of us is going to die. And the other one won't be able to save the other person, because our cocaine habit has become so over the top now that neither of us can live through this. So the only way to save both of us is for me to leave.'\"[82]\n\nHealth issues\n\nWalsh has mentioned having attention deficit hyperactivity disorder, obsessive-compulsive disorder and Asperger syndrome.[83]\n\nAlcohol and drug addiction\n\nWalsh admits to struggling with alcohol and drug addictions for most of his early career and has been in recovery since 1993.[84] In 1989, while touring with New Zealand band Herbs, Walsh experienced an \"epiphany\" during a visit to Otatara Pa, an ancient Māori pā site in the Hawke's Bay region. In 2004, on a return visit to New Zealand, Walsh described the experience and hailed it as the beginning of his recovery from his addiction.[59][85] Walsh related the story that in 1994, he woke up after blacking out on an airplane to Paris. When he arrived, he had his passport, but did not remember getting on the plane. That was his turning point, and he has been sober ever since.[86]\n\nAmateur radio\n\nWhile living in New York City, Walsh began a lifelong interest in amateur radio. He holds an Amateur Extra Class Amateur Radio License, and his station callsign is WB6ACU.[87] In 2006, he donated an autographed guitar to the ARRL in Newington, Connecticut, for its charity auction. He has also been involved with the group's \"Big Project\", which brings amateur radio into schools. Walsh has included Morse Code messages in his albums on two occasions: on the album Barnstorm, (\"Register and Vote\"); and on Songs for a Dying Planet, (\"Register and Vote for Me\").[88] Walsh provides the theme song (which includes Morse code) for the TWiT podcast Ham Nation (debuting in 2011), and he appeared as a guest in the first podcast,[89] as well as episode 400.[90]\n\nInstruments\n\nJimmy Page's sunburst 1959 Gibson Les Paul, better known as his \"Number 1\" was originally owned by Walsh and was sold to Page in 1969.[91]\n\nIn 1970, Walsh gave a 1959 Gretsch 6120 to the Who's lead guitarist Pete Townshend. Townshend used the Gretsch in the studio to record tracks on albums such as Who's Next and Quadrophenia.[92]\n\nSelect other guitars\n\nAmplifiers\n\nMarshall 50 watt Plexi[93]\n\nDiscography\n\nSolo\n\nJames Gang\n\nBarnstorm\n\nEagles\n\nEagles lead vocals and writing\n\nLead vocals\n\nYear Song Album 1976 \"Pretty Maids All in a Row\" Hotel California 1979 \"In the City\" The Long Run 2007 \"Guilty of the Crime\" Long Road Out Of Eden \"Last Good Time in Town\"\n\nOriginal songs\n\nNote: Other songs in the Eagles catalog that were sung and written by Walsh include \"Life's Been Good\" and \"All Night Long\", from Walsh's solo career, which were included on Eagles Live, and \"Funk #49\", from Walsh's days in the James Gang, was included on the fourth \"Millennium Concert\" disc of the Eagles box set Selected Works: 1972-1999. The band has also been known to play \"Rocky Mountain Way,\" as seen on the Farewell Tour I DVD. These are not Eagles songs however, since the studio tracks did not originate under the Eagles name.\n\nFilmography\n\nFilm\n\n1971: Zachariah Film de George Englund. With Don Johnson: Himself with The James Gang.\n\nFilm de George Englund. With Don Johnson: Himself with The James Gang. 1980: The Blues Brothers: A prisoner dancing on a table.\n\n1990: The Best - DVD With Keith Emerson, Jeff Baxter, Joe Walsh, John Entwistle, Simon Phillips: Himself.\n\nTelevision\n\nMad TV , as himself, in Episode 1.2 (1995)\n\n, as himself, in Episode 1.2 (1995) Promised land , as R.J., \"The Prodigy\" (1996)\n\n, as R.J., \"The Prodigy\" (1996) Duckman: Private Dick/Family Man , voicing himself, \"They Craved Duckman's Brain!\" (1996) and \"Love! Anger! Kvetching!\" (1997)\n\n, voicing himself, \"They Craved Duckman's Brain!\" (1996) and \"Love! Anger! Kvetching!\" (1997) The Drew Carey Show , 7 episodes as Ed (\"Drewstock\" (1997), \"In Ramada Da Vida\" (1998), \"Golden Boy\" (1998), \"Drew Between the Rock and a Hard Place\" (1998), \"Boy Party/Girl Party\" (1999), \"Steve and Mimi Get Married\" (1999), \"Drew's in a Coma\" (2001))\n\n, 7 episodes as Ed (\"Drewstock\" (1997), \"In Ramada Da Vida\" (1998), \"Golden Boy\" (1998), \"Drew Between the Rock and a Hard Place\" (1998), \"Boy Party/Girl Party\" (1999), \"Steve and Mimi Get Married\" (1999), \"Drew's in a Coma\" (2001)) Drew Carey's Improv All-Stars , guest (2001)\n\n, guest (2001) Rock the Cradle (2008), a reality show, the father of contestant Lucy Walsh\n\n(2008), a reality show, the father of contestant Lucy Walsh Wicked City , as a director, \"Running With the Devil\" (2015)\n\n, as a director, \"Running With the Devil\" (2015) Criminal Minds , as himself, \"The Sandman\" (2016)\n\n, as himself, \"The Sandman\" (2016) Better Things , as himself \"Hair of the Dog\" (2016)\n\n, as himself \"Hair of the Dog\" (2016) The Conners, as Jesse, \"Patriarchs and Goddesses\" (2022), \"A Judge and A Priest Walk Into A Living Room...\" (2022)\n\nAwards\n\nSee also\n\nFurther reading\n\nWalsh, Joe (1996). Look What I Did! And Then Some ... . Hal Leonard Corporation. ISBN 978-0793544714\n\n. Hal Leonard Corporation. ISBN 978-0793544714 Lemco, Steve (2011). Joe & Me. CreateSpace Independent Publishing Platform. ISBN 978-1463612276\n\nReferences"}], "Joe Walsh is English professional rugby league footballer.": [{"url": "https://prabook.com/web/joe.walsh/2214971", "page_content": "Joe Walsh\n\nDecember 25, 1988 Saddleworth, Oldham\n\nHe recently left Huddersfield Giants by mutual consent, and is currently attracting a lot of attention from rugby union, which he played as a youngster, gaining representative honours. He is regarded by many as a highly talented youngster, with a great future in prospect, and has represented England at all ages from U15s to U18s, and was an integral part of the England academies in 2007 and 2008, as a result of some outstanding performances, went on to make his super league debut at the age of 17. He is a ball-playing loose forward who can also slot into the second row. After a great start to the 2009 season, he was struck down with a bad shoulder injury, and was ruled out for the majority of the campaign. He has previously been with the Bradford Bulls, Leeds Rhinos and a two-year loan spell with Harlequins RL."}, {"url": "https://www.itsrugby.co.uk/players/joe-walsh-24562.html", "page_content": "Joe WALSH is a english rugby player at the centre position.\n\nPlus de détail Le but des abonnements est d'améliorer la visibilité des joueurs et de mettre à la disposition des visiteurs plus d'informations pour augmenter les opportunités. It's Rugby propose dorénavant 2 abonnements à 10 € ou 50 €/an pour bénéficier de nouvelles fonctionnalités comme : l'intégration de vidéos\n\ndes statistiques sur les performances de chaque joueur\n\n+ de divisions de match avec les fédérales 1,2 et 3\n\nPublication de l'actualité des joueurs\n\nDiffusion des CV professionnels des joueurs amateurs Ces nouvelles fonctionnalités sont ou vont être possible grâce au renforcement des équipes it's rugby, expliquant la mise en place des abonnements pour fournir un service plus performant et plus qualitatif.\n\nSubscriptions can now be taken out for access to all player files. Find the subscriptions page ( Link ) for all the details.\n\nTeam career By year My videos Biography / My CV My calendars My standings\n\nTeam career By year My videos Biography / My CV My calendars My standings\n\nPractical information For the full stats of a player, click the corresponding number !\n\nYear Teams Competitions Pts Played Start. Try Pen. Dp. Tr. Min. 11/12 Boulogne-Billancourt Federale 1 Requires subscription with an It's rugby pass"}, {"url": "https://www.itsrugby.co.uk/players/joe-walsh-10794.html", "page_content": "Joe WALSH is a english rugby player at the centre position.He was born on 25/12/1988. He measures 1 m 90 for 97 kg.\n\nPlus de détail Le but des abonnements est d'améliorer la visibilité des joueurs et de mettre à la disposition des visiteurs plus d'informations pour augmenter les opportunités. It's Rugby propose dorénavant 2 abonnements à 10 € ou 50 €/an pour bénéficier de nouvelles fonctionnalités comme : l'intégration de vidéos\n\ndes statistiques sur les performances de chaque joueur\n\n+ de divisions de match avec les fédérales 1,2 et 3\n\nPublication de l'actualité des joueurs\n\nDiffusion des CV professionnels des joueurs amateurs Ces nouvelles fonctionnalités sont ou vont être possible grâce au renforcement des équipes it's rugby, expliquant la mise en place des abonnements pour fournir un service plus performant et plus qualitatif.\n\nSubscriptions can now be taken out for access to all player files. Find the subscriptions page ( Link ) for all the details.\n\nTeam career By year Prize list My videos Biography / My CV My calendars My standings\n\nTeam career By year Prize list My videos Biography / My CV My calendars My standings\n\nPractical information For the full stats of a player, click the corresponding number !\n\nYear Teams Competitions Pts Played Start. Try Pen. Dp. Tr. Min. 13/14 Vienne Federale 1 Requires subscription with an It's rugby pass 2009 Huddersfield Giants England Cup 4 1 - 1 - - - - - - Super League 4 2 1 1 - - - - - - 2008 London Broncos Super League - 3 - - - - - - - - 2007 London Broncos Super League - 3 1 - - - - - - - Competitions Pts Played Start. Try Pen. Dp. Tr. Min. Federale 1 Requires subscription with an It's rugby pass1 England Cup Requires subscription with an It's rugby pass1 Super League Requires subscription with an It's rugby pass1"}, {"url": "https://www.itsrugby.co.uk/players/joe-walsh-33090.html", "page_content": "Joe WALSH is a new-zealand rugby player at the prop position.He was born on 23/07/1993. He measures 1 m 90 for 125 kg.\n\nPlus de détail Le but des abonnements est d'améliorer la visibilité des joueurs et de mettre à la disposition des visiteurs plus d'informations pour augmenter les opportunités. It's Rugby propose dorénavant 2 abonnements à 10 € ou 50 €/an pour bénéficier de nouvelles fonctionnalités comme : l'intégration de vidéos\n\ndes statistiques sur les performances de chaque joueur\n\n+ de divisions de match avec les fédérales 1,2 et 3\n\nPublication de l'actualité des joueurs\n\nDiffusion des CV professionnels des joueurs amateurs Ces nouvelles fonctionnalités sont ou vont être possible grâce au renforcement des équipes it's rugby, expliquant la mise en place des abonnements pour fournir un service plus performant et plus qualitatif.\n\nSubscriptions can now be taken out for access to all player files. Find the subscriptions page ( Link ) for all the details.\n\nTeam career By year My videos Biography / My CV My calendars My standings\n\nTeam career By year My videos Biography / My CV My calendars My standings\n\nPractical information For the full stats of a player, click the corresponding number !"}, {"url": "https://en.unionpedia.org/Joseph_Walsh_(rugby_league)", "page_content": "Joseph Walsh (rugby league) Joseph Walsh (c. 1944 - 24 December 2008) was an English professional rugby league footballer of the 1960s and 1970s. [1]\n\n44 relations: Australia national rugby league team, BBC2 Floodlit Trophy, Cap (sport), Castleford Tigers, Central Park (Wigan), Challenge Cup, Great Britain national rugby league team, Headingley Rugby Stadium, Hilton Park (stadium), Hospice, Lancashire, Leeds, Leeds Rhinos, Leigh Centurions, Leigh, Greater Manchester, List of Leigh Centurions players, List of Warrington Wolves players, London, North Lincolnshire, RFL Lancashire Cup, Rugby league, Rugby league county cups, Scunthorpe, St Helens R.F.C., Station Road, Swinton, The Jungle (Wheldon Road), Try, Warrington, Warrington Wolves, Wembley Stadium (1923), Widnes, Wigan, Wigan Warriors, Wilderspool Stadium, 1967 BBC2 Floodlit Trophy, 1967–68 Northern Rugby Football League season, 1969 BBC2 Floodlit Trophy, 1969–70 Northern Rugby Football League season, 1970–71 Challenge Cup, 1970–71 Lancashire Cup, 1970–71 Northern Rugby Football League season, 1976 BBC2 Floodlit Trophy, 1976–77 Northern Rugby Football League season, 1978 Kangaroo tour of Great Britain and France.\n\nThe Australian national rugby league team (or the Kangaroos) have represented Australia in senior men's rugby league football competition since the establishment of the 'Northern Union game' in Australia in 1908.\n\nNew!!: Joseph Walsh (rugby league) and Australia national rugby league team · See more »\n\nThe BBC 2 Floodlit Trophy (also known as the BBC 2 Television Trophy) was a competition for British rugby league clubs held between 1965 and 1980.\n\nNew!!: Joseph Walsh (rugby league) and BBC2 Floodlit Trophy · See more »\n\nIn sport, a cap is a metaphorical term for a player's appearance in a game at international level.\n\nNew!!: Joseph Walsh (rugby league) and Cap (sport) · See more »\n\nThe Castleford Tigers are a rugby league club in Castleford, West Yorkshire, England, that competes in the Super League, the top-level professional rugby league club competition in the Northern Hemisphere.\n\nNew!!: Joseph Walsh (rugby league) and Castleford Tigers · See more »\n\nCentral Park was a rugby league stadium in Wigan, England, which was the home of Wigan RLFC before the club moved to the JJB Stadium in 1999.\n\nNew!!: Joseph Walsh (rugby league) and Central Park (Wigan) · See more »\n\nThe Challenge Cup (also known as the Ladbrokes Challenge Cup due to sponsorship by Ladbrokes) is a knockout rugby league cup competition organised by the Rugby Football League, held annually since 1896, with the exception of 1915–1919 and 1939–1940.\n\nNew!!: Joseph Walsh (rugby league) and Challenge Cup · See more »\n\nThe Great Britain national rugby league team represents Great Britain in rugby league.\n\nNew!!: Joseph Walsh (rugby league) and Great Britain national rugby league team · See more »\n\nHeadingley Rugby Stadium, (known as Emerald Headingley Stadium due to sponsorship), shares the same site as Headingley Cricket Ground and is home to both Leeds Rhinos and Yorkshire Carnegie rugby teams.\n\nNew!!: Joseph Walsh (rugby league) and Headingley Rugby Stadium · See more »\n\nHilton Park was a multi-purpose stadium in Leigh, Greater Manchester, England.\n\nNew!!: Joseph Walsh (rugby league) and Hilton Park (stadium) · See more »\n\nHospice care is a type of care and philosophy of care that focuses on the palliation of a chronically ill, terminally ill or seriously ill patient's pain and symptoms, and attending to their emotional and spiritual needs.\n\nNew!!: Joseph Walsh (rugby league) and Hospice · See more »\n\nLancashire (abbreviated Lancs.) is a county in north west England.\n\nNew!!: Joseph Walsh (rugby league) and Lancashire · See more »\n\nLeeds is a city in the metropolitan borough of Leeds, in the county of West Yorkshire, England.\n\nNew!!: Joseph Walsh (rugby league) and Leeds · See more »\n\nThe Leeds Rhinos are a professional rugby league club based in Leeds, West Yorkshire, England.\n\nNew!!: Joseph Walsh (rugby league) and Leeds Rhinos · See more »\n\nLeigh Centurions are a professional rugby league club in Leigh, Greater Manchester, England, who compete in the Championship.\n\nNew!!: Joseph Walsh (rugby league) and Leigh Centurions · See more »\n\nLeigh is a town in the Metropolitan Borough of Wigan, Greater Manchester, England, southeast of Wigan and west of Manchester, on low-lying land northwest of Chat Moss.\n\nNew!!: Joseph Walsh (rugby league) and Leigh, Greater Manchester · See more »\n\nThe following is a list of rugby league players who have made 100 or more appearances for Leigh Centurions since they joined the Northern Union in 1895.\n\nNew!!: Joseph Walsh (rugby league) and List of Leigh Centurions players · See more »\n\nWarrington Wolves (named Warrington Zingari in 1876, and just Warrington from 1877 to 1996) are an English rugby league club who have had numerous notable players throughout their history.\n\nNew!!: Joseph Walsh (rugby league) and List of Warrington Wolves players · See more »\n\nLondon is the capital and most populous city of England and the United Kingdom.\n\nNew!!: Joseph Walsh (rugby league) and London · See more »\n\nNorth Lincolnshire is a unitary authority area in Lincolnshire, England, with a population of 167,446 at the 2011 census.\n\nNew!!: Joseph Walsh (rugby league) and North Lincolnshire · See more »\n\nThe RFL Lancashire Cup was a county cup competition for teams in Lancashire that took place between 1905–06 and 1992–93 when it folded due to teams complaining about the number of fixtures being too much.\n\nNew!!: Joseph Walsh (rugby league) and RFL Lancashire Cup · See more »\n\nRugby league football is a full-contact sport played by two teams of thirteen players on a rectangular field.\n\nNew!!: Joseph Walsh (rugby league) and Rugby league · See more »\n\nHistorically, English rugby league clubs competed for the Lancashire Cup and the Yorkshire Cup, known collectively as the county cups.\n\nNew!!: Joseph Walsh (rugby league) and Rugby league county cups · See more »\n\nScunthorpe is a large industrial town in North Lincolnshire, England.\n\nNew!!: Joseph Walsh (rugby league) and Scunthorpe · See more »\n\nSt Helens R.F.C. is a professional rugby league club in St Helens, Merseyside currently competing in the Super League, the top tier of competition for rugby league in Europe.\n\nNew!!: Joseph Walsh (rugby league) and St Helens R.F.C. · See more »\n\nStation Road was a stadium in Pendlebury, near Manchester, England.\n\nNew!!: Joseph Walsh (rugby league) and Station Road, Swinton · See more »\n\nWheldon Road (known as the Mend-A-Hose Jungle for sponsorship purposes) is the home ground of Castleford Tigers Rugby League Club in Castleford, West Yorkshire, England.\n\nNew!!: Joseph Walsh (rugby league) and The Jungle (Wheldon Road) · See more »\n\nA try is a way of scoring points in rugby union and rugby league football.\n\nNew!!: Joseph Walsh (rugby league) and Try · See more »\n\nWarrington is a large town and unitary authority area in Cheshire, England, on the banks of the River Mersey, east of Liverpool, and west of Manchester.\n\nNew!!: Joseph Walsh (rugby league) and Warrington · See more »\n\nWarrington Wolves are a professional rugby league club in Warrington, England, that competes in Super League.\n\nNew!!: Joseph Walsh (rugby league) and Warrington Wolves · See more »\n\nThe original Wembley Stadium (formerly known as the Empire Stadium) was a football stadium in Wembley Park, London, which stood on the same site now occupied by its successor, the new Wembley Stadium.\n\nNew!!: Joseph Walsh (rugby league) and Wembley Stadium (1923) · See more »\n\nWidnes is an industrial town in Halton, Cheshire, Northwest England.\n\nNew!!: Joseph Walsh (rugby league) and Widnes · See more »\n\nWigan is a town in Greater Manchester, England, on the River Douglas, south-west of Bolton, north of Warrington and west-northwest of Manchester.\n\nNew!!: Joseph Walsh (rugby league) and Wigan · See more »\n\nWigan Warriors is a professional Rugby League club based in Wigan, England.\n\nNew!!: Joseph Walsh (rugby league) and Wigan Warriors · See more »\n\nWilderspool Stadium was a rugby league stadium in Warrington, England.\n\nNew!!: Joseph Walsh (rugby league) and Wilderspool Stadium · See more »\n\n1967 was the third occasion on which the BBC2 Floodlit Trophy competition had been held.\n\nNew!!: Joseph Walsh (rugby league) and 1967 BBC2 Floodlit Trophy · See more »\n\nThe 1967–68 Rugby Football League season was the 73rd season of rugby league football.\n\nNew!!: Joseph Walsh (rugby league) and 1967–68 Northern Rugby Football League season · See more »\n\n1969 was the fifth occasion on which the BBC2 Floodlit Trophy competition had been held.\n\nNew!!: Joseph Walsh (rugby league) and 1969 BBC2 Floodlit Trophy · See more »\n\nThe 1969–70 Northern Rugby Football League season was the 75th season of rugby league football in Britain.\n\nNew!!: Joseph Walsh (rugby league) and 1969–70 Northern Rugby Football League season · See more »\n\nThe 1970–71 Challenge Cup was the 70th staging of rugby league's oldest knockout competition, the Challenge Cup.\n\nNew!!: Joseph Walsh (rugby league) and 1970–71 Challenge Cup · See more »\n\nThe 1970 Rugby League Lancashire Cup competition The 1970–71 Lancashire Cup was the fifty-eighth staging of the tournament.\n\nNew!!: Joseph Walsh (rugby league) and 1970–71 Lancashire Cup · See more »\n\nThe 1970–71 Rugby Football League season was the 76th season of rugby league football.\n\nNew!!: Joseph Walsh (rugby league) and 1970–71 Northern Rugby Football League season · See more »\n\n1976 was the twelfth occasion on which the BBC2 Floodlit Trophy competition had been held.\n\nNew!!: Joseph Walsh (rugby league) and 1976 BBC2 Floodlit Trophy · See more »\n\nThe 1976–77 Northern Rugby Football League season was the 82nd season of rugby league football.\n\nNew!!: Joseph Walsh (rugby league) and 1976–77 Northern Rugby Football League season · See more »\n\nThe 1978 Kangaroo tour of Great Britain and France comprised the Australia national rugby league team's fourteenth tour of Great Britain and ninth tour of France, and took place from September to December 1978.\n\nNew!!: Joseph Walsh (rugby league) and 1978 Kangaroo tour of Great Britain and France · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Joseph_Walsh_(rugby_league)"}, {"url": "https://all.rugby/player/joe-walsh", "page_content": "Joe WALSH 29 years, Prop\n\nBio Joe WALSH (Joseph Walsh) is a 29-year-old New Zealander rugby player standing at 1.9 m tall (6 ft 3 in) and weighing in at 120 kg (18 st 12.55 lb; 264.55 lb) , who currently plays for Southland Rugby Football Union in New Zealand as prop.\n\nOccupied positions by Joe on start team : Career Southland Rugby Football Union (2018 - 2019)\n\nBlues (2019 - 2019)\n\nSouthland Rugby Football Union (2019 - 2019)\n\nBlues (2020 - 2020)\n\nSouthland Rugby Football Union (2020 - 2020)\n\nFor all datasheets below, keep in mind that we may not have all datas yet and some stats may be empty, incomplete or missing. But we are working on it. Thank you for your understanding.\n\n19/20\n\nOverall\n\nOverall Stats for Joe WALSH Season Team Tournament Matches W/D/L Starter T D P C Points YC RC Min 19/20 Blues Super Rugby 1 1 0 0 0 20' TOURNAMENT Matches W/D/L Starter T D P C Points YC RC Min Super Rugby 1 1 0 0 0\n\n(0%) 20'\n\n(Avg : 20') TEAM Matches W/D/L Starter T D P C Points YC RC Min Blues 1 1 0 0 0\n\n(0%) 20'\n\n(Avg : 20')"}, {"url": "https://www.rugbypass.com/players/joe-walsh/", "page_content": "FEATURED\n\nUnbeaten Leinster come from behind to see off Ospreys\n\nOspreys pushed leaders Leinster all the way but two late tries saw the Dubliners maintain their unbeaten record in this compelling URC clash."}, {"url": "https://latestinbollywood.com/reece-walsh-parents/", "page_content": "Reece Walsh Parents & Ethnicity:-Reece Walsh is an Australian professional rugby league footballer. He is playing for the New Zealand Warriors in the NRL and plays as a fullback. He has represented the Queensland Murrie Under-16 and Queensland Under-16 sides in 2018.\n\nHere you can get all details about Reece Walsh’s Parents. Who are Reece Walsh’s Parents? What is Reece Walsh’s ethnicity?\n\nReece Walsh’s Parents (Father, Mother), Sibling\n\nNow we are talking about his parents, His father’s name is Roney Walsh. His mother’s name is Jodie. We are not sure about his siblings.\n\nReece Walsh’s Ethnicity, Nationality\n\nWe have talked about Reece Walsh‘s parents so now is the time to talk about his ethnic background and nationality, we want to tell you that his ethnicity is not known. He holds Australian nationality.\n\nIn this blog, you read all the details of Reece Walsh’s Parents, Ethnicity, Wiki, Biography, Age, Girlfriend, Career, Net Worth & More.\n\nReece Walsh Wiki, Biography, Age\n\nReece Walsh was born on 10 July 2002. He took birth in Gold Coast, Queensland, Australia. His birth name is Reece Walsh as known Reece Walsh. Reece went to one of the Keebra Park State High Schools to complete his high school study. His college details are not known.\n\nReece Walsh is 19 years old as of 2022. If we talked about his zodiac sign then because of taking birth on 10 July, his zodiac sign is cancer. Now we tell you about his religion is not mentioned yet.\n\nReece Walsh Girlfriend\n\nIf we talk about Reece Walsh’s marital status then we want to tell you that he is unmarried. He is in a relationship with Freda Puru. They have a baby daughter named Leila Arohamauroa.\n\n\n\nReece Walsh Height, Weight\n\nIf we talk about Reece Walsh’s physical measurement then we can say that his 5 feet 10 inches and his weight is 88kg.\n\nReece Walsh’s Net Worth\n\nNow we are going to about Reece Walsh’s net worth. So we want to tell you he is an Australian professional rugby league footballer. Sean’s net worth is approx $2 million.\n\nRead also: Joe Ramsay Parents & Nationality\n\nReece Walsh Instagram, Twitter, Facebook, Linkedin\n\nInstagram\n\nTwitter\n\nFacebook\n\nLinkedin\n\nYouTube\n\nFAQ About Reece Walsh\n\nQ.1 Who is Reece Walsh?\n\nAns. Reece Walsh is an Australian professional rugby league footballer.\n\nQ.2 Who are Reece Walsh’s parents?\n\nAns. Reece Walsh’s father’s name is Roney Walsh. His mother’s name is Jodie.\n\nQ.3 Who is Reece Walsh’s Girlfriend?\n\nAns. His Girlfriend’s name is Freda Puru.\n\nQ.4 What is Reece Walsh ‘s Nationality?\n\nAns. Reece Walsh’s Nationality is Australian."}, {"url": "https://www.wikiwand.com/en/Joe_Walsh_(footballer,_born_1992)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Joe Walsh (footballer, born 1992)?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.bbc.co.uk/sport/football/55848433", "page_content": "Last updated on .From the section QPR\n\nJoe Walsh came through Gillingham's youth academy and made a total of eight first-team appearances for the Kent club\n\nChampionship club Queens Park Rangers have signed goalkeeper Joe Walsh from Gillingham for an undisclosed fee.\n\nThe 18-year-old has signed a three-and-a-half-year deal with the R's and will initially join their under-23 squad.\n\nWalsh has featured five times in all competitions for the Gills this season, making his League One debut as a substitute in October.\n\n\"Joe is a bright prospect,\" Rangers director of football Les Ferdinand told the club website. external-link\n\nFind all the latest football transfers on our dedicated page."}], "Joe Walsh plays as a prop for the Warrington Wolves in the Super League.": [{"url": "https://www.skysports.com/rugby-league/news/12209/12669822/super-league-whats-gone-wrong-for-warrington-wolves-in-2022", "page_content": "Warrington have endured some tough times in 2022\n\nHeading into Thursday’s Betfred Super League game at home to Toulouse Olympique, live on Sky Sports, Warrington Wolves sit 10th in the table.\n\nThey are four points above the relegation place currently occupied by their Round 23 opponents and a 32-6 defeat away to Wigan Warriors last week means they have now won just two of their last 12 matches.\n\nThis was not how 2022 was supposed to be for the Wolves. A star-studded squad headed up by a man regarded as one of the best coaches in the competition in Daryl Powell was expected to challenge for a long-sought Super League Grand Final win.\n\nInstead, Warrington find themselves six points adrift of the play-off places and in danger of being drawn into the relegation battle with four games of the regular season to go. The question is though, what has gone wrong for the club this year?\n\nBrown: They're mentally broken\n\nOne of the most damning statistics for Warrington this year has been that they did not concede more than 30 points in a game during 2021 yet have done so 10 times this year and lost all of those matches in the process.\n\nThey have been particularly prone to conceding tries in the final quarter of matches too and former Wolves half-back Kevin Brown sees that as a sign the team are feeling the burden of the expectation which has been placed on them this year.\n\nBrown, who spent three seasons at the Halliwell Jones Stadium, believes problems finding the right combination in the halves plus England international George Williams not playing at his instinctive best are behind their woes too.\n\nFormer Warrington player Kevin Brown gave his views on why his former side are struggling\n\n\"First of all, I think they're mentally broken,\" Brown told Sky Sports as a guest pundit during the defeat to Wigan. \"The expectation has been a burden all year.\n\n\"They're looking for a magic formula. They've not found that in the halves; they've moved Stefan Ratchford there, Peter Mata'utia has played there. George Williams, for me he plays on instinct.\n\n\"I remember [former Huddersfield Giants head coach] Nathan Brown telling me, it's not when you do a bad pass or a bad that affects the team it's when you drop out of the game, and I think he's not playing his instinct.\n\n\"He's thinking too much about it, he's taking too long, and I've thought it about this Warrington side all year - I don't think they've got a big enough and strong enough pack to have the firepower to go after people down the middle.\"\n\nJJB: It's a multitude of reasons\n\nThe Wolves have not been helped by injuries, especially one which saw full-back or half-back Gareth Widdop expected to be ruled out for the remainder of the campaign with a shoulder injury suffered while scoring a try in the Magic Weekend victory over Catalans Dragons.\n\nHaving to replace off-season signing Billy Magoulias, who returned to Australia for compassionate reasons in June, prolific try-scorer Josh Charnley and England international prop Mike Cooper to Wigan mid-season has not helped matters either.\n\nFormer Leeds Rhinos player and now assistant coach Jamie Jones-Buchanan, whose team beat Warrington 40-4 at the Halliwell Jones Stadium at the start of June, believes it is difficult to pinpoint a single reason for their troubles.\n\n\"We've looked at that squad [at the start of the season] and said 'look at all the stars on offer there' and a great coach in Daryl Powell who has won coach of the year multiple times, he'll pull that together and create a hybrid of the success he had [at Castleford Tigers],\" Jones-Buchanan told Sky Sports during the defeat to Wigan.\n\nPlease use Chrome browser for a more accessible video player Highlights of the Betfred Super League match between Wigan Warriors and Warrington Wolves. Highlights of the Betfred Super League match between Wigan Warriors and Warrington Wolves.\n\n\"It's not manifested, it's not come together and that's for a multitude of reasons. It could be technical, tactical, spiritual, environmental. There are a lot of questions to be asked.\"\n\nJones-Buchanan also baulked at suggestions the Wolves have just been plain unlucky at times too when it comes to making the most of some of the opportunities created with games still in the balance.\n\n\"I don't believe in luck,\" Jones-Buchanan said. \"You make your own luck and good performances turning opportunities into points is really important for any team.\"\n\nPowell: Some unfair criticism\n\nFor his part, head coach Powell has repeatedly defended his squad and could not have been happier with the work-rate shown by his side in the derby loss away to Wigan.\n\nPlease use Chrome browser for a more accessible video player Warrington head coach Daryl Powell reflects on a disappointing defeat to Wigan in the Befred Superleague. Warrington head coach Daryl Powell reflects on a disappointing defeat to Wigan in the Befred Superleague.\n\nIt was another difficult night for the Wolves' travelling fans as well, although the Warrington boss was full of praise for the way they stuck behind the team.\n\nHis focus is now on ensuring they get back to winning ways for the first time since overcoming Toulouse's fellow French club Catalans 36-10 in Newcastle last month and took aim at what he felt was some unfair criticism of his side.\n\n\"There is a lot of rubbish being spoken at the minute, I thought the boys worked really hard [against Wigan] and battled through everything,\" Powell told Sky Sports.\n\n\"I was really happy with the effort and commitment; I thought the fans really got behind the boys there and they need to keep doing that because you can see they're really working hard.\n\nPlease use Chrome browser for a more accessible video player Highlights of Warrington Wolves' 32-18 win over Toulouse Olympique in Round 3 of the Betfred Super League season. Highlights of Warrington Wolves' 32-18 win over Toulouse Olympique in Round 3 of the Betfred Super League season.\n\n\"We just need to win the game [against Toulouse]. I think there is some unfair criticism; we're in a tough spot, there is some criticism which is fair, but we're looking to the future and building something special.\"\n\nNamed squads\n\nWarrington Wolves: Kyle Amor, Matty Ashton, Joe Bullock, Daryl Clark, Jason Clark, Ben Currie, Matt Davis, Matt Dufty, James Harrison, Oliver Holmes, Peter Mata'utia, Tom Mikaele, Greg Minikin, Robbie Mulhern, Matty Nicholson, Stefan Ratchford, Josh Thewlis, Danny Walker, Jake Wardle, George Williams, Connor Wrench.\n\nToulouse Olympique: Latrell Schaumkel, Mathieu Jussaume, Paul Marcon, Corey Norman, Lucas Albert, Romain Navarrette, Harrison Hansen, Dominique Peyroux, Anthony Marion, Eloi Pelissier, Maxime Puech, Joe Bretherton, Chris Hankinson, Justin Sangare, Matty Russell, Olly Ashall-Bott, Nathan Peats, Lambert Belmas, Maxime Stefani, Tony Gigot, Daniel Alvaro.\n\nWatch Warrington Wolves take on Toulouse Olympique in an all-important Betfred Super League showdown live on Sky Sports Arena from 7.30pm on Thursday (8pm kick-off)."}, {"url": "https://www.superleague.co.uk/article/3251/2023-season-preview-warrington-wolves", "page_content": "The end of the 2022 Betfred Super League season could not come quick enough for Warrington Wolves. A disastrous first year in charge for Daryl Powell saw his side finish eleventh in the league table - one spot above relegation - and the clubs worst ever finish to a Super League season.\n\nPowell has made wholesale changes to his squad during the off-season - particularly in the forward pack - in a bid to amend last year's failings. Those reinforcements will provide plenty of grunt through the middle and give the likes of George Williams and Matt Dufty more opportunity to showcase their impressive running games. Pressure will be on the Wolves in 2023 as we wait to see whether they can bounce back from a horror year.\n\nIns & outs\n\nIns\n\nSam Kasiano (Catalans Dragons), Paul Vaughan (Canterbury Bulldogs), Josh McGuire (St George Illawarra Dragons), Gil Dudson (Catalans Dragons), Josh Drinkwater (Catalans Dragons), Matty Russell (Toulouse Olympique)\n\nFormer Australia and Queensland representative Josh McGuire joins the Wolves for 2023\n\nOuts\n\nJack Hughes (Leigh Leopards), Gareth Widdop (Castleford Tigers), Matt Davis (Leigh Leopards), Robbie Mulhern (Leigh Leopards), Jason Clark (Limoux Grizzlies), Toby King (Wigan Warriors, loan), Ellis Longstaff (Salford Red Devils, loan), Riley Dean (Featherstone Rovers, loan)\n\nOnes to watch\n\n2023 stars\n\nGeorge Williams silenced his critics after a stellar World Cup campaign for England. The Warrington Wolves half-back received some undue criticism during the 2022 Super League season, but his effort could never be faltered. Williams was central to the Wolves attacking threat last season and finished with a club high 21 try assists - in fact, he was the only player in the Warrington squad to reach double figures for try assists in 2022.\n\nThe arrival of Josh Drinkwater should take some of the weight off Williams' shoulders and give him more freedom to play off the cuff, as well as playing behind a much-improved forward pack. If the Wolves find their feet in 2023, expect Williams to thrive.\n\nThe arrival of Matt Dufty mid-way through the 2022 Super League season ignited a spark in Warrington's side. Although the results didn't always reflect it, Dufty lifted his side and showed in just six games the potential he has to be one of the most devastating players in the competition.\n\nIn those six appearances, Dufty crossed for five tries, assisted three more, carried on average over 100 metres per game and made a whopping 33 tackle busts. With a full pre-season under his belt and extra artillery in the Wolves side, Dufty will only get better in 2023.\n\nNext generation\n\nIt may be hard to believe that Josh Thewlis is still just 20 years old. He made his Warrington debut in 2019 and featured 19 times last season. This year, he?s been handed the number two shirt and is likely to cement a regular starting spot on the wing. Just like his opposite winger Matty Ashton did last season, Thewlis can make a wing spot his own and come of age in the Wolves squad this year. He has all the attributes to be a star and could be a contender for the 2023 Young Player of the Year award.\n\nDefining dates\n\nAll eyes will again be on Daryl Powell's side at the start of 2023 and fans will be expecting an immediate response. It's important they start the season well and build momentum early on, with nothing less than a top six finish being the mark of a successful year.\n\nThe Wolves' season gets underway against the Rhinos and Daryl Powell will be hoping to emulate his sides 2022 Round 1 win against the same opposition. That's followed by a trip to the John Smith's Stadium to face the Giants - the Wolves failed to beat Huddersfield twice away from home in 2022. They then welcome 2022 Play-Off Semi-Finalists Salford Red Devils to the Halliwell Jones Stadium in Round 3 - a game that always delivers an absorbing contest.\n\nSquad list\n\n1. Matt Dufty, 2. Josh Thewlis, 3. Pete Mata'utia, 4. Stefan Ratchford, 5. Matty Ashton, 6. George Williams, 7. Josh Drinkwater, 8. James Harrison, 9. Daryl Clark, 10. Paul Vaughan, 11. Ben Currie, 12. Matty Nicholson, 13. Josh McGuire, 14. Sam Kasiano, 15. Joe Philbin, 16. Danny Walker, 17. Gil Dudson, 18. Tom Mikaele, 19. Joe Bullock, 20. Connor Wrench, 21. Greg Minikin, 22. Riley Dean, 23. Tom Whitehead, 24. Luke Thomas, 25. Leon Hayes, 26. Adam Holroyd, 27. Aiden Doolan, 28. Jack Darbyshire, 29. Josh Lynch, 30. Jake Thewlis, 31. Jamie Reddecliff, 32. Bobby Schingler, 33. Ellis Longstaff."}, {"url": "https://www.bbc.co.uk/sport/rugby-league/63889576", "page_content": "Last updated on .From the section Rugby League\n\nJosh McGuire can play back-row and prop, adding to Daryl Powell's pack options at Warrington\n\nWarrington signing Josh McGuire believes he still has plenty to offer following his move from the Australian National Rugby League to Super League.\n\nThe back-rower, now 32, has played for Australia, Samoa and Queensland at representative level.\n\nMcGuire also played 259 NRL games for Brisbane Broncos, North Queensland Cowboys and St George Illawarra.\n\n\"I didn't want to come over here too late in my career and make up numbers,\" McGuire told BBC Radio Merseyside.\n\n\"I wanted to be in the physical shape to provide a service to the club and the fans and play to a good level, and coming in here I feel really fit.\n\n\"I love rugby league and I've always wanted to play and experience the opportunity.\"\n\nAs a self-confessed rugby league fan McGuire watched plenty of Super League before his impending move to the Wire, and kept in touch with chief executive Karl Fitzpatrick during the tough 2022 campaign.\n\nHe turned down the chance to remain in Australia to make the trip to the northern hemisphere, with the opportunity of a new life experience for him, his partner and children.\n\n\"I had opportunities, I could have gone back home to Queensland or stayed with the Dragons,\" McGuire added.\n\n\"I was at the age where I had to make a decision. If I hadn't have done this, this year, I probably wouldn't [ever] have done it.\n\n\"It was a good time for me, I have three children - eight, six and two. I didn't want to leave it too late that my eldest would be starting high school.\""}, {"url": "https://www.bbc.co.uk/sport/rugby-league/65189717", "page_content": "Last updated on .From the section Rugby League\n\nJosh Thewlis scored twice as Warrington clung on to maintain their 100% record in Super League\n\nBetfred Super League Catalans (10) 14 Tries: McMeeken, Penalty try, Romano Goals: Keighran Warrington (8) 20 Tries: Thewlis 2, Dufty, Williams Goals: Ratchford 2\n\nWarrington Wolves maintained their 100% record with an eighth straight Super League win despite being reduced to 12 men away to Catalans Dragons.\n\nIn a seesaw opening half, Wire scores from Josh Thewlis and Matt Dufty came either side of Mike McMeeken's touchdown and a Catalans penalty try.\n\nGeorge Williams went in for Wolves, Arthur Romano dragged Catalans level and ex-Dragons prop Gil Dudson saw red.\n\nThewlis' second edged Warrington ahead, and Catalans had a late try ruled out.\n\nDaryl Powell's side were the only Super League team with a 100% record from their opening seven games and showed some guts to keep pulling away from their hosts in the Perpignan sunshine.\n\nWhile their forward pack did not enjoy quite the same supremacy they have for much of the campaign, they laid enough of a platform to overcome an equally gutsy Dragons.\n\nMagic was provided by Dufty's fizzing pass to put Thewlis over out wide, and the former St George Illawarra full-back left the Dragons defence for dead in sprinting 90 metres for his try.\n\nEx-Dragon Sam Kasiano combined to tee up Williams to coast in after Josh Drinkwater's testing bomb forced a drop-out, while Williams turned provider with the crucial pass for Thewlis' second.\n\nNot even Dudson's red card late on for striking Tom Johnstone could derail the Wolves as they repelled Catalans' desperate raids.\n\nSteve McNamara's Dragons had only lost once themselves, in an off-colour performance at Leeds last month, and despite this loss, which came without a clutch of senior players such as Sam Tomkins and Mitchell Pearce, there were reasons for optimism.\n\nAfter a shaky start, Adam Keighran found his radar with the boot to create opportunities, such as the kick which led to McMeeken grounding a loose ball.\n\nPaul Seguier's little hack inside after a gallop down the line seemed to have been grounded by Warrington's Ben Currie in a try-saver, but the video referee deemed his intervention was worthy of a penalty try with Keighran lurking.\n\nJohnstone intercepted a Wire attack and almost went the length, and debutant Tanguy Zenon was deemed to have grounded short on the back of the territory.\n\nThe late score chalked off when Romano went over proved telling as the Dragons slipped to only their second loss.\n\nCatalans: Zenon; Davies, Whitley, Romano, Johnstone; Keighan, Mourgue; Navarette, Da Costa, Bousquet, McMeeken, Seguier, Garcia\n\nInterchanges: Goudemand, Taukieaho, Dezaria, Tison\n\nWarrington: Dufty; Thewlis, Mata'utia, Ratchford, Ashton; Williams, Drinkwater; Dudson, Walker, Vaughan, Currie, Nicholson, McGuire\n\nInterchanges: Kasiano, Philbin, Minikin, Green\n\nReferee: Chris Kendall."}, {"url": "https://www.bbc.co.uk/sport/rugby-league/65139062", "page_content": "Last updated on .From the section Rugby League\n\nThomas Mikaele has scored four tries in 17 appearances for Warrington\n\nWarrington Wolves prop Thomas Mikaele is to return to Australia and join Gold Coast Titans.\n\nThe 25-year-old has been allowed to leave Wire on compassionate grounds.\n\nHe joined Warrington from Wests Tigers in May 2022 and will make his last appearance for the club in Saturday's Super League game against Hull FC.\n\n\"I've had a wonderful time since coming over here, the boys, the club and the fans have all been great with me and my family,\" he told the club website. external-link\n\n\"I'm sorry it didn't work out as originally planned but family comes first for me and I'm sure that's something that people can understand.\""}, {"url": "https://www.bbc.co.uk/sport/rugby-league/65113967", "page_content": "Last updated on .From the section Rugby League\n\nPaul Vaughan: Warrington prop loving life after leaving NRL\n\nWarrington Wolves have to make the most of their potential to win silverware this season given the quality of the squad, says prop Paul Vaughan.\n\nThe 31-year-old arrived in Super League from the Canterbury-Bankstown Bulldogs, having played Tests for Australia and in Origin with New South Wales.\n\nHe has already been impressed with the quality of Daryl Powell's squad.\n\n\"These years don't come around too often,\" Canberra-born Vaughan told the BBC's Super League Show.\n\n\"I think it's a really good opportunity to do something really special, where you have such a great squad.\n\n\"You have to make the most of it because you don't know in a couple of years time whether the boys will still be together or not.\n\n\"Hopefully we can get the best out of ourselves and have a positive year.\"\n\nVaughan's arrival, along with former team-mate and friend Josh McGuire, and Catalans front-row giants Gil Dudson and Sam Kasiano, has added much-needed bulk to the Warrington pack.\n\nEven with the loss of Thomas Mikaele, who is set to return to Australia on compassionate grounds, the Wire have the personnel to challenge - particularly playing off the back of that 'go-forward'.\n\n\"One of the biggest things is the hooker rotation we have with Daryl Clark and Danny Walker,\" Vaughan added.\n\n\"The dynamic areas are really strong, if you look across the whole squad there is a lot of talent there and it's really well balanced.\"\n\nLeaving the beaches of Shellharbour for the north west of England and Warrington has seen Vaughan tread the same path as Australian stars such as Brian Bevan, Les Boyd, Alfie Langer, Andrew Johns, the Monaghan brothers and, most recently, Matt Dufty and McGuire.\n\nHaving familiar faces about is useful, not just for the players themselves but also for family.\n\n\"It's been an easy transition,\" Vaughan added. \"It's good for our partners too, they've got a strong relationship there too so they can duck off for a coffee. Moosey's [Josh McGuire] got three kids, and I've got two girls.\n\n\"We were pretty settled in Australia, we had a good lifestyle and all that kind of stuff, but for my family I thought it would be a good life experience for the girls to come over and experience something new.\n\n\"We haven't looked back to be fair and hopefully we can stay a few years longer.\""}, {"url": "https://www.bbc.co.uk/sport/rugby-league/58810396", "page_content": "Last updated on .From the section Rugby League\n\nJoe Bullock made 18 Super League appearances for Wigan in 2021\n\nWarrington Wolves have signed Wigan Warriors prop Joe Bullock on a three-year deal.\n\nThe 28-year-old has spent the past three seasons with the Warriors after joining from Barrow Raiders.\n\n\"I'm really happy to be joining the club. It's a great opportunity for me to come here and I think it's a good progression in my career,\" he told the club website. external-link\n\n\"I'm looking forward to what we can do in the years ahead.\""}, {"url": "https://www.bbc.co.uk/sport/rugby-league/56576998", "page_content": "Last updated on .From the section Rugby League\n\nJake Mamo's stylish score in the corner put Warrington 16-0 up after 26 minutes\n\nBetfred Super League Warrington (22) 44 Tries: Lineham 2, King 2, Mamo, Widdop 2, Currie Goals: Ratchford 6 Leigh (0) 12 Try: Sidlow, Brierley Goals: Reynolds 2\n\nGareth Widdop starred as Warrington Wolves ran in eight tries to completely outclass newly promoted Leigh Centurions at Totally Wicked Stadium.\n\nTom Lineham, Toby King, Jake Mamo and Widdop all crossed as Leigh failed to cope with Warrington's superior pace and creativity before the interval.\n\nScores by King, Lineham, Widdop and Ben Currie's smart try added to the lead.\n\nAdam Sidlow and Ryan Brierley did cross for a spirited away side, but they never looked like staging a recovery.\n\nLeigh's second loss in two Super League games was in stark contrast to an encouraging display against Wigan in their season opener, which saw them edged out 20-18.\n\nBut worryingly, however, they have now conceded 64 points and scored just 12 in one and a half games having been 18-0 up at the break against the Warriors.\n\nLeigh showed some early promise and had good field position on a couple of occasions after Lineham's score's in the corner, but a couple of sloppy kicks surrendered possession and Warrington soon seized control.\n\nTwo tries in four minutes as good as settled the contest, some slick passing freeing up King for a simple score on the left and Josh Charnley then running inside to create space wide on the right for Mamo to cleverly touch down.\n\nMore slick handling enabled King to race away down the left and tee up Widdop for the fourth try and Warrington, who were convincingly beaten by Castleford Tigers last weekend, continued to dominate on the resumption.\n\nCurrie spun over the line after Widdop's cute kick for the fifth score and although Sidlow's astute close-range try and Brierley's effort brought some cheer, Wire were clinical in the closing stages.\n\nKing grabbed his second try of the day, as did Lineham after more smart work by Widdop.\n\nAnd Widdop's classy performance and impressive support play was also rewarded with a second try - and his team's eighth score - as Wire passed the 40-point mark, with Ratchford slotting his sixth kick off the day to round off the scoring.\n\nAll round two fixtures of the Super League are taking place at St Helens' Totally Wicked Stadium because of coronavirus restrictions, while this week's round of games have been dedicated to former Hull KR prop Mose Masoe, who is continuing his recovery from a spinal injury.\n\nWarrington coach Steve Price: \"Gaz [Widdop] came up with some very big plays on that left-hand side. He's feeling really good about himself. He's a fantastic guy and a fantastic rugby league player.\n\n\"I was looking for a good response [following loss against Castleford] and we got that. It was a big improvement. Defensively we were a lot more solid as a collective and I thought our left side looked potent.\n\n\"Scoring eight tries to two is very pleasing, we'll build off that. There's lots of positive stuff and that's the standard as a group, we want to keep improving.\"\n\nLeigh head coach John Duffy: \"We didn't throw anything at them like we practised in the week and I've got to take that on my shoulders.\n\n\"When we did in bits in the second half, we created some problems, but we didn't put enough pressure on their pivots.\n\n\"The mood is a bit sombre but we've got to stick together. We knew how tough it is going to be this year. It's only round two so there's a long way to go.\"\n\nWarrington: Ratchford, Lineham, Mamo, King, Charnley, Austin, Widdop, Hill, D. Clark, Cooper, Currie, Hughes, Philbin.\n\nInterchanges: J. Clark, Walker, Mulhern, Butler.\n\nLeigh: Brierley, Tierney, Brand, Thornley, Russell, Reynolds, Wallace, Ioane, Hood, Sidlow, Hellewell, Gee, Thompson.\n\nInterchanges: Wildie, Gerrard, Peteru, McCarthy.\n\nReferee: James Child."}, {"url": "https://www.rollingstone.com/music/music-lists/joe-walsh-my-life-in-15-songs-66390/", "page_content": "I start the riot in the final scene of The Blues Brothers. [Ed. Note: Walsh plays a prison inmate who begins dancing on a table while the band plays \"Jailhouse Rock.\"] The part of the movie they were filming in L.A., there were hours between set changes. And John [Belushi] would call me up and say, \"I can't sit here. I have nothing to do. Can you come over and hang out?\" So I did. I hung out in the trailer with Danny [Aykroyd] and Belushi and they decided they had a scene for me in the movie. So that's how that happened.\n\nBy that time, John and I had been friends for a while. I met Belushi on the road in Chicago. He came to an Eagles concert. He showed up in my room and didn't leave for two days. He wanted to show me how cool Chicago was, and he took me out to the finest restaurant. There's a whole story with that with how they wouldn't let us in because of the way we were dressed. So we went and spray painted our jeans black and went back. Then we did about $28,000 worth of damage to my hotel room.\n\nWhen the Eagles stopped in 1980 … I kept going. I didn't really want to admit it had ended, so I just kept the same mentality and lifestyle. And the way I wound up was that the only thing that mattered to me was not running out of cocaine. And also vodka. Vodka, cocaine and Camel Light cigarettes. Those three things.\n\nGradually, I stopped writing music and I stopped taking care of myself. I burned bridges. I was not dependable. I didn't make any sense a lot of the time. Musicians didn't really care to work with me anymore. I had an \"I don't care about anything\" attitude. My day – and it was really hard work – was spent trying to find a dealer who would front me some cocaine when I still owed him for the last batch. And if I was awake, I was drinking. I was just empty. I was godless and I took it about as far as a I could go. And I'd seen buddies go away. Keith Moon took it all the way. Belushi, he had gotten sober. And I helped him do it. He said, \"Look, I gotta quit. Do you know a sober companion?\" I said, \"Yeah, I know somebody. But you're gonna hate me for getting him for you and you're gonna hate him. But he'll get you clean.\" And John was doing great. Then he fell off the wagon, and on and on."}, {"url": "https://www.grunge.com/439605/the-untold-truth-of-joe-walsh/", "page_content": "Notice the quotes above, and take note that we're not referring to the James Gang, which would come a few years later. Back in the mid-'60s, the Measles (we're guessing they chose the name because it rhymes with \"Beatles\") was a band of Kent State University students that featured Joe Walsh on vocals and guitar. After developing a reputation in the area as an up-and-coming bar band, they started working on original songs, including the Walsh-penned \"I Find I Think of You\" and \"And It's True,\" the latter of which was composed by bassist Bobby Sepulveda, according to Buckeye Beat.\n\nWhat makes this interesting is the fact that those two songs appeared on the Ohio Express' 1967 debut album \"Beg, Borrow and Steal,\" whose title track peaked at No. 29 on the Billboard Hot 100 that same year, per Songfacts. The Ohio Express was not as much a traditional band as it was the name producers Jerry Kasenetz and Jeff Katz used for the songs they released from various bands and musicians, the Measles included. In fact, the song \"Beg, Borrow and Steal\" was actually performed by a group called the Rare Breed, while Kasenetz and Katz had a totally different band go on tour as the Ohio Express and record at least some of the other songs on the album.\n\nThe Ohio Express' history is a confusing one, to be sure, but for a brief moment, that history included a future guitar legend and one of his first-ever compositions."}]}