{"Joe Walsh made his Super League début for Widnes in 2008.": [{"url": "https://au.sports.yahoo.com/nrl-2021-rugby-league-rocked-death-liam-walsh-23-205329427.html", "page_content": "Liam Walsh has died at the age of 23. Images: Twitter\n\nThe rugby league community is mourning the tragic death of former Super League player Liam Walsh.\n\nThe 23-year-old was fatally struck by a car while walking in Widnes this week.\n\nWalsh was transferred to hospital but later died from his injuries.\n\nBANNED: Ugly new fallout in Penrith-Parramatta finals furore\n\n'MIND-BLOWING': Tigers great savages club over Michael Maguire\n\nThe Widnes Vikings, who Walsh represented in the Super League, announced the shocking news.\n\n“I am devastated to hear the news of Liam's passing this morning,\" Widnes CEO Phil Finney said.\n\n“Liam was a very special person and a very important part of our club for a number of years.\n\n“He made a lasting impression on everyone he met with his sense of humour and contagious personality.\n\n“He was a one-off and will be remembered with great fondness by all at the club who had the pleasure of knowing him.\n\n“We are all thinking about his family and friends at this really sad time.”\n\nWidnes Vikings are deeply saddened to hear the news of the tragic passing of former player Liam Walsh at the age of 23.\n\n\n\nIn honour of Liam, our players will be observing a minutes silence today.\n\n\n\nOur thoughts are with his family at this difficult time.https://t.co/XxQHT4un5l pic.twitter.com/KY5hAgvzQc — Widnes Vikings (@WidnesRL) September 19, 2021\n\nRugby league world rocked by terrible tragedy\n\nMike Smith, vice-president of the Rugby Football League, said: “This is a terrible tragedy and our hearts go out to Liam's family and friends.\n\n“From what I hear of Liam, it is clear that he was a very popular young man of whom his family can be extremely proud.\n\n“He'll be greatly missed and we will offer the club and the family whatever support we can.”\n\nWalsh made his Super League debut for Widnes in 2017, playing six games across a two-year period.\n\nHis former club wore black armbands and held a minute's silence for Walsh before their game against Swinton Lions.\n\nPlayers also laid out a jersey with Walsh's name and the number 23.\n\nA spokesperson for Cheshire Police said they are still appealing for witnesses and video footage following the fatal crash.\n\nNo arrests have been made but police are asking anyone with information to contact them.\n\nTributes have been flowing in for Walsh on social media.\n\nEveryone at the Hornets is devastated at the tragic passing of our player and friend Liam Walsh at the age of 23 💔\n\n\n\nOur thoughts are with his family and friends as we mourn the loss of this beautiful young man 💔💚 pic.twitter.com/DmDQZcI43I — Halton Farnworth Hornets (@hfharl) September 19, 2021\n\nWe are heartbroken to learn of the news that former Widnes Vikings player and England Academy star Liam Walsh has sadly passed away at the age of 23.\n\n\n\nThe thoughts of everyone at the Rugby Football League are with Liam’s family, friends and loved ones at this difficult time. pic.twitter.com/Hd6ovcluz4 — Rugby Football League (@TheRFL) September 19, 2021\n\nLytham Town are saddened to hear of the passing of Liam Walsh, aged just 23😔\n\n\n\nBoth our first team and reserve team will be observing a minutes silence for Liam on Saturday\n\n\n\nMay he rest in peace ❤️ pic.twitter.com/oAOASE6edZ — LYTHAM TOWN FC (@lythamfc) September 20, 2021\n\nEveryone at North Wales Crusaders is devastated to hear that Liam Walsh, who featured for us on dual registration in 2019, has sadly passed away.\n\n\n\nOur condolences go out to Liam’s family and friends at this sad time.\n\n\n\nRIP, Liam https://t.co/KSicHS4T2L — North Wales Crusaders (@NWCrusaders) September 19, 2021\n\nForever a Viking and Widnes legend in the hearts of the vikings hearts, taken too soon for a young, promising and sound lad, swept away from widnes and the RL community but never forgotten, RIP Liam Walsh. https://t.co/pgST0UxY1B — Lewis Cornes⚫️⚪️ (@LewisWooly) September 21, 2021\n\nIf you can, please support @WidnesRL and visit Liam Walsh’s @gofundme page.\n\n\n\nOr simply comment on the attached post.#RugbyLeague https://t.co/7aM3owZPET — Oldham RLFC (@Roughyeds) September 21, 2021\n\n📖 🕯 A Celebration of Life book will be available for people to write in from 7pm this evening in the Hornets Nest for those wishing to pay their respects to Liam Walsh 💔💚🖤\n\n\n\nYou can also still donate to give him the best send off - https://t.co/yK55GziwYM pic.twitter.com/RBByV5KL3H — Halton Farnworth Hornets (@hfharl) September 21, 2021\n\nClick here to sign up to our newsletter for all the latest and breaking stories from Australia and around the world.\n\nundefined"}, {"url": "https://nz.news.yahoo.com/nrl-2021-rugby-league-rocked-death-liam-walsh-23-205329427.html", "page_content": "Liam Walsh has died at the age of 23. Images: Twitter\n\nThe rugby league community is mourning the tragic death of former Super League player Liam Walsh.\n\nThe 23-year-old was fatally struck by a car while walking in Widnes this week.\n\nWalsh was transferred to hospital but later died from his injuries.\n\nBANNED: Ugly new fallout in Penrith-Parramatta finals furore\n\n'MIND-BLOWING': Tigers great savages club over Michael Maguire\n\nThe Widnes Vikings, who Walsh represented in the Super League, announced the shocking news.\n\n“I am devastated to hear the news of Liam's passing this morning,\" Widnes CEO Phil Finney said.\n\n“Liam was a very special person and a very important part of our club for a number of years.\n\n“He made a lasting impression on everyone he met with his sense of humour and contagious personality.\n\n“He was a one-off and will be remembered with great fondness by all at the club who had the pleasure of knowing him.\n\n“We are all thinking about his family and friends at this really sad time.”\n\nWidnes Vikings are deeply saddened to hear the news of the tragic passing of former player Liam Walsh at the age of 23.\n\n\n\nIn honour of Liam, our players will be observing a minutes silence today.\n\n\n\nOur thoughts are with his family at this difficult time.https://t.co/XxQHT4un5l pic.twitter.com/KY5hAgvzQc — Widnes Vikings (@WidnesRL) September 19, 2021\n\nRugby league world rocked by terrible tragedy\n\nMike Smith, vice-president of the Rugby Football League, said: “This is a terrible tragedy and our hearts go out to Liam's family and friends.\n\n“From what I hear of Liam, it is clear that he was a very popular young man of whom his family can be extremely proud.\n\n“He'll be greatly missed and we will offer the club and the family whatever support we can.”\n\nWalsh made his Super League debut for Widnes in 2017, playing six games across a two-year period.\n\nHis former club wore black armbands and held a minute's silence for Walsh before their game against Swinton Lions.\n\nPlayers also laid out a jersey with Walsh's name and the number 23.\n\nA spokesperson for Cheshire Police said they are still appealing for witnesses and video footage following the fatal crash.\n\nNo arrests have been made but police are asking anyone with information to contact them.\n\nTributes have been flowing in for Walsh on social media.\n\nEveryone at the Hornets is devastated at the tragic passing of our player and friend Liam Walsh at the age of 23 💔\n\n\n\nOur thoughts are with his family and friends as we mourn the loss of this beautiful young man 💔💚 pic.twitter.com/DmDQZcI43I — Halton Farnworth Hornets (@hfharl) September 19, 2021\n\nWe are heartbroken to learn of the news that former Widnes Vikings player and England Academy star Liam Walsh has sadly passed away at the age of 23.\n\n\n\nThe thoughts of everyone at the Rugby Football League are with Liam’s family, friends and loved ones at this difficult time. pic.twitter.com/Hd6ovcluz4 — Rugby Football League (@TheRFL) September 19, 2021\n\nLytham Town are saddened to hear of the passing of Liam Walsh, aged just 23😔\n\n\n\nBoth our first team and reserve team will be observing a minutes silence for Liam on Saturday\n\n\n\nMay he rest in peace ❤️ pic.twitter.com/oAOASE6edZ — LYTHAM TOWN FC (@lythamfc) September 20, 2021\n\nEveryone at North Wales Crusaders is devastated to hear that Liam Walsh, who featured for us on dual registration in 2019, has sadly passed away.\n\n\n\nOur condolences go out to Liam’s family and friends at this sad time.\n\n\n\nRIP, Liam https://t.co/KSicHS4T2L — North Wales Crusaders (@NWCrusaders) September 19, 2021\n\nForever a Viking and Widnes legend in the hearts of the vikings hearts, taken too soon for a young, promising and sound lad, swept away from widnes and the RL community but never forgotten, RIP Liam Walsh. https://t.co/pgST0UxY1B — Lewis Cornes⚫️⚪️ (@LewisWooly) September 21, 2021\n\nIf you can, please support @WidnesRL and visit Liam Walsh’s @gofundme page.\n\n\n\nOr simply comment on the attached post.#RugbyLeague https://t.co/7aM3owZPET — Oldham RLFC (@Roughyeds) September 21, 2021\n\n📖 🕯 A Celebration of Life book will be available for people to write in from 7pm this evening in the Hornets Nest for those wishing to pay their respects to Liam Walsh 💔💚🖤\n\n\n\nYou can also still donate to give him the best send off - https://t.co/yK55GziwYM pic.twitter.com/RBByV5KL3H — Halton Farnworth Hornets (@hfharl) September 21, 2021\n\nClick here to sign up to our newsletter for all the latest and breaking stories from Australia and around the world.\n\nundefined"}, {"url": "https://wiki.kidzsearch.com/wiki/Liam_Walsh_(rugby_league)", "page_content": "Liam Walsh (12 September 1998 – 19 September 2021[3]) was a professional rugby league footballer who played as a second-row forward for the Widnes Vikings in the Betfred Championship.\n\nIn 2017 he made his Super League début for Widnes against the Leeds Rhinos.\n\nReferences"}, {"url": "https://www.mirror.co.uk/sport/rugby-league/liam-walsh-widnes-rugby-league-25024659", "page_content": "Widnes Vikings held a minute's silence ahead of Sunday's meeting with Swinton after confirming the death of academy graduate Liam Walsh, who was hit by a car in Cheshire on Saturday\n\nWidnes Vikings have announced the tragic death of former rugby league player Liam Walsh, aged 23.\n\nWalsh was a product of the Vikings youth set-up and had since impressed with Halton Hornets, having also spent time in the England Academy as a youngster.\n\nThe back-row prospect earned his Super League debut for Widnes in a clash against Leeds Rhinos in 2017, making a total of six appearances for the club before leaving two years later.\n\nCheshire police are appealing for witnesses after a 23-year-old man was killed following a car collision on the A5080 Cronton Lane, close to the College Fields in Widnes, shortly before midnight on Saturday.\n\nIt's since been confirmed the victim in question was Walsh, who was taken to Whiston Hospital with serious injuries but later died.\n\nImage: Paul Currie/SWpix.com) Paul Currie/SWpix.com)\n\nA Cheshire Police statement read: \"Sadly, despite the best efforts of all those involved, he passed away a short time later. His next of kin have been informed and they are being supported by specialist officers.\n\n\"The driver of the car was uninjured.\n\n\"Enquiries in relation to the collision are ongoing and no arrests have been made at this time.\n\nThe Vikings paid tribute to their former star by wearing black armbands and holding a minute's silence before Sunday's fixture against Swinton Lions.\n\n\"I am devastated to hear the news of Liam's passing this morning,\" said Widnes chief executive Phil Finney.\n\n\"Liam was a very special person and a very important part of our club for a number of years.\n\nImage: Chris Mangnall/SWpix.com) Chris Mangnall/SWpix.com)\n\n\"He made a lasting impression on everyone he met with his sense of humour and contagious personality. He was a one-off and will be remembered with great fondness by all at the club who had the pleasure of knowing him.\n\n\"We are all thinking about his family and friends at this really sad time.\"\n\nAhead of their Betfred Championship clash, the Vikings players laid out a jersey bearing Walsh's name and the number 23 ahead of their meeting with Swinton.\n\nWalsh maintained his rugby league connections despite leaving Widnes in 2019, continuing to play for the Hornets, who are also based in the Cheshire town.\n\nRugby Football League vice-president Mike Smith said: \"This is a terrible tragedy and our hearts go out to Liam's family and friends.\n\n\"From what I hear of Liam, it is clear that he was a very popular young man of whom his family can be extremely proud. He'll be greatly missed and we will offer the club and the family whatever support we can.\""}, {"url": "https://www.wikiwand.com/en/Joe_Walsh_(footballer,_born_1992)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Joe Walsh (footballer, born 1992)?\n\nSummarize this article for a 10 years old"}, {"url": "https://alchetron.com/Joseph-Walsh-(rugby-league)", "page_content": "Joseph \"Joe\" Walsh (circa-1944 - 23 December 2008) was an English professional rugby league footballer who played in the 1960s, and 1970s, playing at representative level for Great Britain, and at club level for Leigh, and Warrington, as a wing, i.e. number 2 or 5.\n\nInternational honours\n\nJoe Walsh won a cap, and scored a try, for Great Britain while at Leigh in 1971 against New Zealand at Wheldon Road, Castleford.\n\nChallenge Cup Final appearances\n\nJoe Walsh played left wing, i.e. number 5, in Leigh's 21-7 victory over Leeds in the 1971 Challenge Cup Final during the 1970–71 season at Wembley Stadium, London on Saturday 15 May 1971, in front of a crowd of 85,514.\n\nCounty Cup Final appearances\n\nJoe Walsh played left wing, i.e. number 5, in Leigh's 7-4 victory over St. Helens in the 1970 Lancashire County Cup Final during the 1970–71 season at Station Road, Swinton on Saturday 28 November 1970.\n\nBBC2 Floodlit Trophy Final appearances\n\nJoe Walsh played left wing, i.e. number 5, in Leigh's 5-8 defeat by Castleford in the 1967 BBC2 Floodlit Trophy Final during the 1967–68 season at Headingley Rugby Stadium, Leeds on Saturday 16 January 1968, played left wing in the 11-6 victory over Wigan in the 1969 BBC2 Floodlit Trophy Final during the 1969–70 season at Central Park, Wigan on Tuesday 16 December 1969, and played left wing in the 4-12 defeat by Castleford in the 1976 BBC2 Floodlit Trophy Final during the 1976–77 season at Hilton Park, Leigh on Tuesday 14 December 1976.\n\nNotable tour matches\n\nJoe Walsh made his full (starting) début for Warrington, and played left wing, i.e. number 5, in Warrington's 15-12 victory over Australia at Wilderspool Stadium, Warrington on Wednesday 11 October 1978.\n\nClub career\n\nJoe Walsh made début for Leigh, and scored a try in the 17-7 victory over Leeds at Hilton Park, Leigh, Lancashire, the first-ever player to score a try when the first professional matches were allowed to take place Sundays in 1967."}, {"url": "https://www.loverugbyleague.com/post/rip-liam-walsh-tributes-pour-in-for-former-widnes-and-england-academy-player", "page_content": "Tributes have poured in on social media for former Widnes player Liam Walsh, who has tragically passed away aged 23.\n\nWalsh worked his way through every stage of the system at hometown club Widnes and gained international honours for England Academy before making his first team debut in Super League in 2017.\n\nWalsh went on to make another five appearances for the Vikings before departing the club in 2019.\n\nWidnes chief executive Phil Finney, who worked closely with Walsh through the academy, said: “I am devastated to hear the news of Liam’s passing this morning. Liam was a very special person and a very important part of our club for a number of years.\n\n“He made a lasting impression on everyone he met with his sense of humour and contagious personality, he was a one off and will be remembered with great fondness by all at the club who had the pleasure of knowing him.\n\n“We are all thinking about his family and friends at this really sad time.”\n\nTributes poured in on social media for Walsh…\n\nThat one was for you brother. Rest in peace Walshy, one of a kind❤️❤️❤️ https://t.co/XVx5gkPAxc — Joe Lyons (@JoeLyons6) September 19, 2021\n\nThis is heartbreaking news. RIP walshy lad.💔 — Aaron heremaia (@Azaheremaia) September 19, 2021\n\nSo many memories to share and remember. See you on the other side brother shine bright ❤️ https://t.co/cKEwTruu5V — Danny (@dannyjoewalker) September 19, 2021\n\nAwful news this, was always a top lad when I’ve played with and against him RIP walshy https://t.co/TjXOGqiG3f — Harvey Whiteley (@harveywhiteley9) September 19, 2021\n\nSo sad RIP mate ❤️ https://t.co/DwMyO7gC1J — Jez Litten (@JezLitten) September 19, 2021\n\nRIP liam a great lad and talented https://t.co/QgNXEqj89e thoughts and prayers are with his family gone far to soon — steve ganson (@GansonSteve) September 19, 2021\n\nSending all my love and strength to Liam’s family and friends ❤️ Another taken too soon 😢 https://t.co/e6e4tHqFyF — Lizzie Jones MBE (@LizzieJonesuk) September 19, 2021\n\nSo sad. One of the toughest I’ve played with and against. RIP Walshy ❤️ https://t.co/tcmHr1b0Bp — Joe Brown (@Joe_Brown87) September 19, 2021\n\nRIP Liam. Thoughts go out to his family, friends and former teammates. https://t.co/x155RBhsDV — Chris Thorman (@Chris_Thorman6) September 19, 2021\n\nJust heard the news💔 Prayers going up Walshy and his family. Rest in peace brother 🙏🏽 — Anthony Gelling (@AnthonyGelling) September 19, 2021\n\nRIP Liam💔 thoughts are with his friends and family x https://t.co/iOPFIcTouC — Brad Oneill (@BradOneill17) September 19, 2021\n\nRest in peace Liam. My thoughts are with his family and friends ❤️ https://t.co/uOu8v144JC — Willie Isa (@ISA_Willie) September 19, 2021\n\nWidnes observed a minute’s silence prior to Sunday’s match against Swinton, with the players wearing black armbands in honour of Walsh."}, {"url": "https://www.the-sun.com/sport/3694845/liam-walsh-death-widnes-vikings-rugby-league/", "page_content": "WIDNES VIKINGS have announced the shock news that former rugby league player Liam Walsh has died aged 23.\n\nThe late star was a product of their youth set-up and went on to shine at Halton Hornets.\n\n4 Widnes Vikings have announced former star Liam Walsh has died aged 23 Credit: SWpix.com\n\n4 Vikings players laid out a jersey bearing his name and the number 23 prior to Sunday’s clash with Swinton Lions Credit: Widnes Vikings\n\nHe also spent time with the England Academy as a youngster.\n\nHis cause of death has yet to be revealed.\n\nWidnes chief executive Phil Finney confirmed the news, saying: “I am devastated to hear the news of Liam's passing this morning.\n\n“Liam was a very special person and a very important part of our club for a number of years.\n\n“He made a lasting impression on everyone he met with his sense of humour and contagious personality.\n\n“He was a one-off and will be remembered with great fondness by all at the club who had the pleasure of knowing him.\n\n“We are all thinking about his family and friends at this really sad time.”\n\nRugby Football League vice-president Mike Smith said: “This is a terrible tragedy and our hearts go out to Liam's family and friends.\n\n“From what I hear of Liam, it is clear that he was a very popular young man of whom his family can be extremely proud.\n\n“He'll be greatly missed and we will offer the club and the family whatever support we can.”\n\nFormer back-row prospect Walsh made his Super League debut for Widnes against Leeds Rhinos in 2017.\n\nHe made six appearances in total for them before leaving two years later.\n\nThe Vikings paid tribute to him yesterday by wearing black armbands and holding a minute's silence before Sunday's fixture against Swinton Lions.\n\nTheir players also laid out a jersey bearing his name and the number 23 prior to the Betfred Championship clash.\n\n4 The former back-row prospect made his Super League debut for Widnes against Leeds Rhinos in 2017 Credit: SWpix.com"}, {"url": "https://www.dailystar.co.uk/sport/rugby-league/liam-walsh-widnes-vikings-died-25027198", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nEx-rugby league player Liam Walsh has been identified as the 23-year-old man who died after being hit by a car.\n\nWalsh was involved in a collision late on Saturday night and was taken to hospital after suffering serious injuries, but medics were unable to save him.\n\nHis former club, Widnes Vikings, held a minute's silence before their game with Swinton Lions on Sunday and wore black armbands in his memory.\n\nHe made his Super League debut for the club in 2017 against Leeds Rhinos and went on to make a further five appearances before he left in 2019, reports LiverpoolEcho.\n\nVikings chief executive Phil Finney issued a statement on their website which reads: “I am devastated to hear the news of Liam’s passing this morning. Liam was a very special person and a very important part of our club for a number of years.\n\n“He made a lasting impression on everyone he met with his sense of humour and contagious personality, he was a one off and will be remembered with great fondness by all at the club who had the pleasure of knowing him.\n\n“We are all thinking about his family and friends at this really sad time.”\n\nWalsh had worked his way up through the ranks in the academy system at his hometown club and CEO Finney had worked closely with him during his progression.\n\nHe achieved his dream of making the first team against the Rhinos aged just 18 and also achieved international call-ups during his career.\n\nAfter his departure from the club he remained in close contact with some of those who he'd journeyed through the academy with and those who remained in the first team set-up.\n\nRugby Football League vice-president Mike Smith said: \"This is a terrible tragedy and our hearts go out to Liam's family and friends.\n\n\"From what I hear of Liam, it is clear that he was a very popular young man of whom his family can be extremely proud.\n\n\"He'll be greatly missed and we will offer the club and the family whatever support we can.\""}, {"url": "https://wiki2.org/en/Joseph_Walsh_(rugby_league)", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nGB international rugby league footballer\n\nJoseph Walsh ( c. 1944 – 24 December 2008) was an English professional rugby league footballer who played in the 1960s and 1970s. He played at representative level for Great Britain, and at club level for Leigh,[4] and Warrington, as a wing.[3]\n\nYouTube Encyclopedic\n\n1 / 3 Views: 3 198 6 872 8 625\n\nUSA vs Jamaica - Game 2 of Rugby League Americas Championship\n\nTommy Walsh individual match highlights NAB cup\n\nDamien Comer Player Profile (Galway/NUIG) Transcription\n\nBackground\n\nWalsh was born in Widnes, Lancashire, England, and he died aged 64 in Lindsey Lodge Hospice in Scunthorpe, North Lincolnshire.\n\nPlaying career\n\nInternational honours\n\nWalsh won a cap, and scored a try, for Great Britain while at Leigh in 1971 against New Zealand at Wheldon Road, Castleford.[3]\n\nChallenge Cup Final appearances\n\nWalsh played left wing in Leigh's 24–7 victory over Leeds in the 1971 Challenge Cup Final during the 1970–71 season at Wembley Stadium, London on Saturday 15 May 1971, in front of a crowd of 85,514.\n\nCounty Cup Final appearances\n\nWalsh played left wing in Leigh's 7–4 victory over St. Helens in the 1970 Lancashire Cup Final during the 1970–71 season at Station Road, Swinton on Saturday 28 November 1970.\n\nBBC2 Floodlit Trophy Final appearances\n\nWalsh played left wing in Leigh's 5–8 defeat by Castleford in the 1967 BBC2 Floodlit Trophy Final during the 1967–68 season at Headingley, Leeds on Saturday 16 January 1968, played left wing in the 11–6 victory over Wigan in the 1969 BBC2 Floodlit Trophy Final during the 1969–70 season at Central Park, Wigan on Tuesday 16 December 1969, and played left wing in the 4–12 defeat by Castleford in the 1976 BBC2 Floodlit Trophy Final during the 1976–77 season at Hilton Park, Leigh on Tuesday 14 December 1976.\n\nNotable tour matches\n\nWalsh made his full (starting) début for Warrington, and played left wing in Warrington's 15–12 victory over Australia in the 1978 Kangaroo tour of Great Britain and France match at Wilderspool Stadium, Warrington on Wednesday 11 October 1978.\n\nClub career\n\nWalsh made début for Leigh, and scored a try in the 17–7 victory over Leeds at Hilton Park, Leigh, Lancashire, the first-ever player to score a try when the first professional matches were allowed to take place Sundays in 1967,[6] and he made his début for Warrington on Sunday 8 October 1978, and he played his last match for Warrington Friday 13 April 1979.\n\nReferences"}], "Joe Walsh went on to make over 100 appearances for Widnes.": [{"url": "https://www.rollingstone.com/music/music-lists/joe-walsh-my-life-in-15-songs-66390/", "page_content": "I start the riot in the final scene of The Blues Brothers. [Ed. Note: Walsh plays a prison inmate who begins dancing on a table while the band plays \"Jailhouse Rock.\"] The part of the movie they were filming in L.A., there were hours between set changes. And John [Belushi] would call me up and say, \"I can't sit here. I have nothing to do. Can you come over and hang out?\" So I did. I hung out in the trailer with Danny [Aykroyd] and Belushi and they decided they had a scene for me in the movie. So that's how that happened.\n\nBy that time, John and I had been friends for a while. I met Belushi on the road in Chicago. He came to an Eagles concert. He showed up in my room and didn't leave for two days. He wanted to show me how cool Chicago was, and he took me out to the finest restaurant. There's a whole story with that with how they wouldn't let us in because of the way we were dressed. So we went and spray painted our jeans black and went back. Then we did about $28,000 worth of damage to my hotel room.\n\nWhen the Eagles stopped in 1980 … I kept going. I didn't really want to admit it had ended, so I just kept the same mentality and lifestyle. And the way I wound up was that the only thing that mattered to me was not running out of cocaine. And also vodka. Vodka, cocaine and Camel Light cigarettes. Those three things.\n\nGradually, I stopped writing music and I stopped taking care of myself. I burned bridges. I was not dependable. I didn't make any sense a lot of the time. Musicians didn't really care to work with me anymore. I had an \"I don't care about anything\" attitude. My day – and it was really hard work – was spent trying to find a dealer who would front me some cocaine when I still owed him for the last batch. And if I was awake, I was drinking. I was just empty. I was godless and I took it about as far as a I could go. And I'd seen buddies go away. Keith Moon took it all the way. Belushi, he had gotten sober. And I helped him do it. He said, \"Look, I gotta quit. Do you know a sober companion?\" I said, \"Yeah, I know somebody. But you're gonna hate me for getting him for you and you're gonna hate him. But he'll get you clean.\" And John was doing great. Then he fell off the wagon, and on and on."}, {"url": "https://ultimateclassicrock.com/joe-walsh-but-seriously-folks/", "page_content": "Joe Walsh's fourth album, ... But Seriously Folks, is best known for producing the hit single \"Life's Been Good.\" But that's just the most obvious starting point of a record that proved to be one of Walsh's most durable LPs.\n\nComparisons to the Eagles for the album came early and often – and not just because this was the first stand-alone project Walsh released after he joined the group before 1976's Hotel California. All four of his bandmates appeared on ... But Seriously Folks, though they're mere footnotes on an album that strikes a more considered balance of introspection and biting wit, and of smart balladry and tough rockers, than the reconstituted Eagles' deflating finale The Long Run.\n\nWalsh moves with cunning and verve through the expected joys of country rockers like \"Second Hand Store\" and the surprising reggae rhythms of \"Over and Over,\" from the incisive nostalgia of \"Indian Summer\" to the fully realized instrumental wit of \"Theme From Boat Weirdos.\"\n\nEven casual fans will notice signature elements of the Eagles sound throughout, from the soaring background vocals of Glenn Frey, Don Henley and Timothy B. Schmit on \"Tomorrow\" to Don Felder's pedal steel on \"Second Hand Store.\" Walsh and Felder then reanimate their twin-guitar \"Hotel California\" entanglement on \"At the Station.\"\n\nListen to Joe Walsh's 'Life's Been Good'\n\nStill, ... But Seriously Folks arrived on May 16, 1978, as a Walsh record at its core, dominated not by the Eagles but by his vision. Don't let the winks and nudges fool you. As with Walsh's other must-buy solo album, The Smoker You Drink, the Player You Get, he's in complete command of his muse, something that becomes utterly clear on the hilarious album closer \"Life's Been Good.\"\n\nA comic depiction of the \"hardships\" of rock stardom, the song appeared on ... But Seriously Folks not in the zippy four-minute version that went to No. 12 on the pop chart but as an extended anthem of double that length.\n\nAlong the way, it earned fame separate from the charts when Walsh ran for president in 1980 as a lark. He suggested, tongue firmly in cheek, that \"The Star-Spangled Banner\" be replaced by \"Life's Been Good.\" That didn't happen. But it certainly became Walsh's personal good-time anthem – and a staple of his concerts, with and without the Eagles.\n\nMany fans understandably listen to ... But Seriously Folks decades later to relive that moment in time. But there's an entire album's worth of Walsh to enjoy here.\n\nEagles Solo Albums Ranked Here's a look back at studio projects recorded away from the band.\n\nHow a Drug Dealer Inspired Eagles' 'Life in the Fast Lane'"}, {"url": "https://www.grunge.com/439605/the-untold-truth-of-joe-walsh/", "page_content": "Notice the quotes above, and take note that we're not referring to the James Gang, which would come a few years later. Back in the mid-'60s, the Measles (we're guessing they chose the name because it rhymes with \"Beatles\") was a band of Kent State University students that featured Joe Walsh on vocals and guitar. After developing a reputation in the area as an up-and-coming bar band, they started working on original songs, including the Walsh-penned \"I Find I Think of You\" and \"And It's True,\" the latter of which was composed by bassist Bobby Sepulveda, according to Buckeye Beat.\n\nWhat makes this interesting is the fact that those two songs appeared on the Ohio Express' 1967 debut album \"Beg, Borrow and Steal,\" whose title track peaked at No. 29 on the Billboard Hot 100 that same year, per Songfacts. The Ohio Express was not as much a traditional band as it was the name producers Jerry Kasenetz and Jeff Katz used for the songs they released from various bands and musicians, the Measles included. In fact, the song \"Beg, Borrow and Steal\" was actually performed by a group called the Rare Breed, while Kasenetz and Katz had a totally different band go on tour as the Ohio Express and record at least some of the other songs on the album.\n\nThe Ohio Express' history is a confusing one, to be sure, but for a brief moment, that history included a future guitar legend and one of his first-ever compositions."}, {"url": "https://ultimateclassicrock.com/joe-walsh-got-any-gum/", "page_content": "The late '80s were a challenging period for classic rockers: Could they remain relevant and maintain their levels of success, born of moments six or eight or 10 years before, when they were topping the charts and regularly packing arenas? Many were staring down their 40s, if not meekly entering them, crossing a threshold that at one time was impossible to fathom. Rock was a young person's game, a music of rebellion and reaction to those of a certain, older set.\n\nJoe Walsh was among this aging rock-star demographic, turning 40 in 1987. He dealt with his age and the expectations of a rock audience by both indulging in a debilitating drinking habit, while embracing then-current keyboard-heavy sounds on the solo album he released that year, Got Any Gum?\n\nThe bulk of the project was recorded at Memphis' renowned Ardent Studios, where producer Terry Manning preferred to work. Walsh liked Studio A in the facility, according to studio manager Jody Stephens, who initially rose to fame as Big Star's drummer. The room \"has huge baffles so that you can really damp things down to where it's almost a '70s studio,\" Stephens later told Goldmine. Others who have made albums there include the Allman Brothers Band, Lynyrd Skynyrd and Robert Cray.\n\nDrummer Chad Cromwell, a session musician and would go on to play with everyone from Neil Young and Mark Knopfler to Michael Bolton and Jessica Simpson, remembers how he got asked to play on Got Any Gum? It all started, in typical fashion, during a messy gig with Walsh.\n\n\"I met Joe at a recording studio in Memphis where I worked a lot and did a lot of sessions,\" Cromwell told Rolling Stone. \"When Joe came into town, he just came over and there was some sort of party going on. I was introduced to Joe. That was one of the strangest things because we just stayed up all night, acting like idiots, as everyone would do in the mid-'80s.\"\n\nWalsh asked Cromwell to accompany him to Dallas, where they would rehearse for a week with bassist Rick Rosas before playing a radio station-sponsored festival concert in Los Angeles. Cromwell agreed, but the week went by and no rehearsals happened. \"We get on a plane [at the end of the week] and fly to L.A.,\" Cromwell recalled. \"We get off the plane and literally get in a car and drive out to [the venue]. There are 20,000 people at this venue and I am shitting myself since I still haven't rehearsed with Joe and Rick.\n\n\"I remember walking onstage,\" he added, \"going, 'Okay! I'm probably going to be put on a plane home after this is over with, but fuck it. If he doesn't want to rehearse, I'm just going with it, with him. I'll see what happens.'\"\n\nListen to Joe Walsh Perform 'In My Car'\n\nA few missteps aside, the gig went well, and Cromwell became Walsh's first-call drummer when he went back to Memphis to record Got Any Gum? at Ardent. Cromwell was intrigued by working with Manning, who had provided the drum programming and synthesizer work on Eliminator – the 1983 LP that brought the rough-edged ZZ Top a whole new sound, and a big hit record.\n\n\"Terry was pretty big on whatever the latest, coolest piece of gear would be at the time,\" Cromwell told Rolling Stone. \"There was a company called AMS – they made a gated reverb box and then a delay box that probably is most well known as the drum sound on 'In the Air Tonight' by Phil Collins. Same gear, same box.\n\n\"If you listen to Got Any Gum?, you're going to hear the same thing,\" Cromwell added. \"I remember thinking at the time, 'This is the most incredible drum sound I've ever heard in my life.' I wasn't really thinking about how dated that would sound 10 years later.\"\n\nThe drum work wasn't the only quintessentially '80s sound on Got Any Gum? as the preponderance of synthesizers and compression led to an overall thin audio quality. That was, of course, somewhat typical for the era – but not for Walsh. For perhaps the first time, it sounded like his guitar was fighting to be heard over the patches and plastic. Got Any Gum? was about as far as one could imagine Walsh getting from the sound he'd all but patented since the first James Gang record decades earlier.\n\nWalsh saw it differently. \"What I'm really trying to do is get back to that young, aggressive feeling,\" he told the Sun-Sentinel while on a supporting tour. \"I'm full circle from being young and curious in the James Gang, going through development as an artist in the Eagles. I want to get back to what it was.\"\n\nOpinions are split on whether Walsh's curiosity actually resulted in a good record. There are certainly some intriguing songs to pick through, dated production and all.\n\n\"In My Car\" was co-written with Ringo Starr and originally appeared on Starr's 1983 album Old Wave, with Walsh co-producing and playing lead guitar. The big keyboard sound on Walsh's cover sounds like it should be on a soundtrack to an '80s high-school movie – though the keyboards are underpinned by an acoustic guitar, and Walsh plays a tasty solo in the middle of the song.\n\nListen to Joe Walsh Perform 'The Radio Song'\n\nOne of the few tracks on Got Any Gum? that got any traction was \"The Radio Song,\" which was a minor hit at rock radio, hitting No. 8 on the Billboard Mainstream Rock Tracks chart. It's a pretty simple song about the pleasures of listening to music, with a chorus that's a winner, and some insistent guitar work that cuts through the atmospheric synthesizers, however briefly.\n\nComing in late on the record is \"Memory Lane,\" a touching ballad cut from a similar fabric as \"Pretty Maids All in a Row,\" Walsh's contribution to the Eagles' Hotel California. It's a heavy sentiment, on the power of looking back, and how memories can pull us out into \"faraway places and long ago names.\"\n\n\"Fun\" is perhaps the cut that sounds most like classic Joe Walsh from Got Any Gum? It's got a guitar sound right out of \"Rocky Mountain Way\" and \"Funk #49,\" with cannon-shot drums and an unfettered Walsh vocal. All the hard-rock noise is given purpose as he implores the listener to have a good time – while also noting how good a time Walsh is also having. How this didn't crack rock radio like \"The Radio Song\" did is a mystery.\n\nUnfortunately, few people embraced Got Any Gum? Released on Oct. 29, 1987, the LP was a critical dud. (The Los Angeles Times, in a typical comment, described it as a \"monumental flop.\"). Got Any Gum? was a commercial disappointment as well, topping out at No. 113 on the Billboard album chart.\n\nWalsh was still a sizable live draw, but his physical condition was becoming a concern. Supporting the record at the end of 1987 and into 1988, Walsh began to show the effects of his issues with alcohol. Carter Alan, a writer and longtime disc jockey in the New England area, saw it firsthand when he served as emcee at a Walsh show in New Hampshire.\n\n\"What was tragic,\" Alan said in his book Decibel Diaries: A Story of Rock in 50 Concerts, \"was the extent to which Joe Walsh's drinking had crippled his ability to play. I almost cried as he fumbled the solo to 'Life in the Fast Lane,' unable to replicate or even approach the mastery of his original studio performance. While Walsh's fingers responded clumsily, as if operated by an inept puppeteer hidden in the rafters above, several extended episodes of slurry rhetoric at the microphone replaced much of the music.\"\n\nListen to Joe Walsh Perform 'Fun'\n\nWalsh's promotional appearances on television shows like Late Night with David Letterman and The Arsenio Hall Show were shambolic, with sloppy performances followed by uncomfortable interview segments between the hosts and a visibly impaired Walsh.\n\nOn Hall's show, Walsh accused the host (a fellow Cleveland native) of stealing his hubcaps, before degenerating even further into a drunken announcement of his candidacy for president. He'd also done so in 1980, to great comic effect, but repeating the joke while slurring his words on national television in 1987 was not so funny.\n\nIt took the 1994 Eagles reunion to get Walsh to rehab – and he says he's remained sober to this day. Chad Cromwell remembers the circumstances that led Walsh to get help. Cromwell was having dinner with a friend in a restaurant in Hollywood when Walsh, fresh from a meeting with his Eagles bandmates, showed up and approached their table.\n\n\"He looked straight at us and said, 'They won't let me in the band if I don't go to rehab. I gotta go to rehab,'\" Cromwell told Rolling Stone. \"He was just a wreck. It was heartbreaking. He was in such bad shape. The next morning, he went to rehab. He has been sober ever since.\"\n\nWalsh's fortitude is the likeliest reason he has remained sober, but Cromwell also credits others for compelling him to get in that condition. \"The Eagles definitely saved his life,\" Cromwell added. \"No question about it.\"\n\nCombining sobriety and the life of a working musician was no easy task, Walsh admitted in a 2012 talk with Interview. \"It wasn't like you flick a switch, and you're sober,\" he said. \"It takes a while. You have to learn how to do everything all over again. You can measure how long that takes in terms of years.\n\n\"What I didn't know at the time was how to write music and do rock 'n' roll and live rock 'n' roll and record sober,\" Walsh added. \"I didn't try to do that at first. I learned how to take care of myself and then play in front of people. I didn't tackle going back to rock 'n' roll until I had some sobriety under my belt.\"\n\nThe Most Awesome Live Album From Every Rock Legend Some of these concert recordings sold millions of copies, while others received little fanfare. Still, they remain the best of the best.\n\nHow a Drug Dealer Inspired Eagles' 'Life in the Fast Lane'"}, {"url": "https://www.ranker.com/list/best-joe-walsh-albums-list/reference", "page_content": "Longtime Eagles guitar player Joe Walsh is one of the best guitarists of all time. Here, you'll find a complete list of the best Joe Walsh albums, including pictures of the album covers when available. This Joe Walsh discography is ranked from best to worst, so the top Joe Walsh albums can be found at the top of the list. To make it easy for you, we haven't included Joe Walsh singles, EPs, or compilations, so everything you see here should only be studio albums. If you think the greatest Joe Walsh album isn't high enough on the list, then be sure to vote for it so it receives the credit it deserves. Make sure you don't just vote for critically acclaimed albums; if you have a favorite Joe Walsh album, then vote it up, even if it's not necessarily the most popular.\n\nIf you want to know, \"What is the Best Joe Walsh album of all time?\" or \"What are the top Joe Walsh albums?\" then this list will answer your questions. The former Eagles member also played in James Gang, as well as Barnstorm prior to the Eagles, then went on to have a successful solo career. Some of his solo albums were even certified gold and platinum. Some albums from his solo discography include But Seriously, Folks... and Barnstorm, among many others.\n\nThis list of popular Joe Walsh albums has been voted on by music fans around the world, so the order of this list isn't just one person's opinion. You can share your own opinion by voting up your favorite albums below, and voting down any albums you feel should be lower on the list."}, {"url": "https://www.liquisearch.com/joe_walsh/notable_appearances", "page_content": "Notable Appearances\n\nWalsh has produced albums for artists such as Dan Fogelberg and Ringo Starr. He was a background musician (1st guitar solo) on Eagles bandmate Don Henley's 1982 hit \"Dirty Laundry\" (listed as such in the liner notes of I Can't Stand Still and Actual Miles: Henley's Greatest Hits). Walsh played guitar throughout Who bassist John Entwistle's 1981 solo album Too Late The Hero. Walsh has also contributed to albums by: America, REO Speedwagon, Andy Gibb, Emerson, Lake & Palmer and Steve Winwood, and on the Richard Marx hit \"Don't Mean Nothing\".\n\nOnscreen Walsh has appeared in: The Blues Brothers, RoboCop, Promised Land, The Drew Carey Show, Duckman, MADtv, Rock the Cradle and Zachariah.\n\nOn February 12, 2012, Walsh appeared on stage with Paul McCartney, Bruce Springsteen, Dave Grohl, and McCartney's band at the Staples Center in Los Angeles to close out the Grammy Awards show.\n\nWalsh was a regular guest deejay on the Los Angeles radio station, KLOS during the mid-1980s. They had a Saturday evening feature, with celebrity guest-hosts taking over the mic (Walsh was the guest host far more frequently than any other). He was also a frequent guest and guest-host of Detroit & Chicago radio personality Steve Dahl."}, {"url": "https://www.rollingstone.com/music/music-news/joe-walsh-rs-interview-special-edition-1098225/", "page_content": "Joe Walsh doesn’t cook much in quarantine — “You don’t want me to go there!” he cracks — but the rocker has kept busy as a ham radio operator. “That’s obsolete,” he admits. “We’re dinosaurs because of the internet. That’s pretty fun, because I’m not a rock star, I’m just Joe when I do that. So that keeps me grounded.”\n\nFor the most part though, Walsh’s days are just fine. “It’s kind of a blur at this point,” he tells Rolling Stone in the latest episode of the Rolling Stone Interview: Special Edition video series. “If I can get into the drama of it all and the fear and the anger…just enables negative thinking. If you just keep it simple and take it one day at a time, it’s a lot like early recovery. I get along pretty good.”\n\nNext week, Walsh will host his fourth annual VetsAid charity concert, held virtually on December 12th. The livestream will feature archival performances from the last three years — including Don Henley, Haim, the Doobie Brothers, and Sheryl Crow — as well as new appearances by Eddie Vedder, Alice Cooper, the Killers’ Brandon Flowers, and more.\n\n“When you have a charity event, what you do is you humbly ask everybody you can think of,” Walsh says. “And you hope that three or four of them won’t be on tour or won’t be in the studio and they sign on. I asked 30 people, and they all said yes.”\n\nWalsh himself is part of a Gold Star family: his father died in the Army Air Corps when he was just two years old. “I just always wondered if my dad approved of me,” he says. “I just miss my dad. I didn’t have anybody to throw a ball with or pick up as a role model. When a loved one doesn’t come back from the war, it’s an awful feeling.”\n\nThis year also marked the 50th anniversary of the Kent State shootings, where Walsh was enrolled as a student at the time. “I see parallels to the division in the country,” he says of 2020. “It’s the same kind of tension and lack of understanding and refusing to bend, refusing to come into the middle and at least agree on stuff so you can get stuff done. And it makes me uneasy, because that’s back. And I thought we were over that.”\n\nEditor’s picks\n\nWalsh famously ran for President of the United States in 1980, when he pledged to make his hit “Life’s Been Good” the national anthem. “Wouldn’t that be good before a football game?” he jokes. “I would have had a lot more fun than Trump. With Wednesday, I would have just said ‘We’re gonna cancel Wednesday.’ We’re gonna do Tuesday right to Thursday to get to the weekend closer.”\n\nWhich begs the question: What percentage of the crazy rock star antics in “Life’s Been Good” are real? “I used to completely trash hotel rooms,” Walsh says. “I never had a Maserati. I finally got one, because everyone was making me feel really guilty. The look of sadness on their face…so I went and got a Maserati. I don’t know if it does 185. I chickened out at 140.”\n\nElsewhere during the interview, Walsh discussed his friendship with the late Who drummer Keith Moon. “Hanging out with Keith Moon was one of the highlights of my life,” he says. “It was absolutely terrifying at the time. Now, it’s funny.”\n\nThis is the latest installment of Rolling Stone’s latest new video series, RS Interview: Special Edition, featuring in-depth conversations with notable figures in music, entertainment and politics. Episodes premiere every Thursday afternoon on Rolling Stone’s YouTube channel."}, {"url": "https://www.tvguide.com/celebrities/joe-walsh/credits/3030538398/", "page_content": "Join or Sign In\n\nSign in to customize your TV listings\n\nContinue with Facebook\n\nContinue with email\n\nBy joining TV Guide, you agree to our Terms of Use and acknowledge the data practices in our Privacy Policy."}, {"url": "https://music.douban.com/musician/118893/", "page_content": "简介 · · · · · ·\n\n\n\nJoe Walsh\n\n命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《都市牛郎》... 1947年11月20日出生于肯萨斯州。1969年加入摇滚团James Gang，1975年12月加入老鹰合唱团，是最先发行个人专辑与拥有畅销单曲的团员。1973年Bill Szymczyk就是靠Walsh的推荐才接替原制作人Glyn Johns。Walsh刚加入时，Szymczyk还曾替他担心会影响个人演唱生涯，结果证明Walsh不仅为乐团注入了摇滚的新生Joe Walsh命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《都市牛郎》... (展开全部)\n\n1947年11月20日出生于肯萨斯州。1969年加入摇滚团James Gang，1975年12月加入老鹰合唱团，是最先发行个人专辑与拥有畅销单曲的团员。1973年Bill Szymczyk就是靠Walsh的推荐才接替原制作人Glyn Johns。Walsh刚加入时，Szymczyk还曾替他担心会影响个人演唱生涯，结果证明Walsh不仅为乐团注入了摇滚的新生\n\nJoe Walsh\n\n命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《都市牛郎》插曲\"All Night Long\"都是个人代表作，老鹰合唱团解散期间Walsh仍然有新作陆续推出。\n\n有道是合久必分，分久必合，果然，老鹰乐队于1994年又宣告东山再起，几位元老再次重聚。重组后的老鹰立刻马不停蹄地开始全美巡回演\n\nJoe Walsh\n\n出，并于该年推出一张新歌+精选《炼狱之上》(Hell Freeze Over ).专辑精选部分是演唱会的实况，鼎沸的人群、流畅的旋律又一次在耳边回荡。到底“姜是老的辣”，在演唱会上唐·亨利身着一件格子绒衬衣，在万众瞩目下又唱起那首脍炙人口的《加州旅店》，而唐·弗尔德和乔·沃什的吉他技艺更件炉火纯青，开篇大段的吉他 华彩奏得畅快淋漓，重重的鼓点仿佛击在人们的心房，亨利沙亚的嗓音坚实而富磁性，而乐队成员鬓际的白发尤见苍凉。\n\n04年老鹰乐队在墨尔本的演出，walsh的状态依然保持的相当完美。\n\n2011年，老鹰乐队中国之行，walsh让中国观众大呼：这老头声音真有质感。六十岁的年纪唱出了三十岁的味道。"}, {"url": "https://movie.douban.com/celebrity/1161505/", "page_content": "影人简介 · · · · · ·\n\n\n\nJoe Walsh\n\n命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《... 1947年11月20日出生于肯萨斯州。1969年加入摇滚团James Gang，1975年12月加入老鹰合唱团，是最先发行个人专辑与拥有畅销单曲的团员。1973年Bill Szymczyk就是靠Walsh的推荐才接替原制作人Glyn Johns。Walsh刚加入时，Szymczyk还曾替他担心会影响个人演唱生涯，结果证明Walsh不仅为乐团注入了摇滚的新生Joe Walsh命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《... (展开全部)\n\n1947年11月20日出生于肯萨斯州。1969年加入摇滚团James Gang，1975年12月加入老鹰合唱团，是最先发行个人专辑与拥有畅销单曲的团员。1973年Bill Szymczyk就是靠Walsh的推荐才接替原制作人Glyn Johns。Walsh刚加入时，Szymczyk还曾替他担心会影响个人演唱生涯，结果证明Walsh不仅为乐团注入了摇滚的新生\n\nJoe Walsh\n\n命，同时Walsh个人发展亦相得益彰。1975年进入老鹰乐队，为乐队带来新的活力。1978年的专辑《But Seriously, Folks…》、单曲\"Life's Been Good\"电影《都市牛郎》插曲\"All Night Long\"都是个人代表作，老鹰合唱团解散期间Walsh仍然有新作陆续推出。\n\n有道是合久必分，分久必合，果然，老鹰乐队于1994年又宣告东山再起，几位元老再次重聚。重组后的老鹰立刻马不停蹄地开始全美巡回演\n\nJoe Walsh\n\n出，并于该年推出一张新歌+精选《炼狱之上》(Hell Freeze Over ).专辑精选部分是演唱会的实况，鼎沸的人群、流畅的旋律又一次在耳边回荡。到底“姜是老的辣”，在演唱会上唐·亨利身着一件格子绒衬衣，在万众瞩目下又唱起那首脍炙人口的《加州旅店》，而唐·弗尔德和乔·沃什的吉他技艺更件炉火纯青，开篇大段的吉他 华彩奏得畅快淋漓，重重的鼓点仿佛击在人们的心房，亨利沙亚的嗓音坚实而富磁性，而乐队成员鬓际的白发尤见苍凉。\n\n04年老鹰乐队在墨尔本的演出，walsh的状态依然保持的相当完美。\n\n2011年，老鹰乐队中国之行，walsh让中国观众大呼：这老头声音真有质感。六十岁的年纪唱出了三十岁的味道。"}]}