{"Josiah Mason was an English industrialist and philanthropist.": [{"url": "https://www.britishmuseum.org/collection/term/BIOG249899", "page_content": "Also known as Josiah Mason primary name: Mason, Josiah other name: Sir Josiah Mason\n\nDetails individual; merchant/tradesman; English; Male\n\nLife dates 1795-1881\n\nAddress Birmingham"}, {"url": "https://discovery.nationalarchives.gov.uk/details/c/F71867", "page_content": "This website uses cookies\n\nWe place some essential cookies on your device to make this website work.\n\n\n\nWe'd like to use additional cookies to remember your settings and understand how you use our services.\n\n\n\nThis information will help us make improvements to the website."}, {"url": "https://acearchive.org/josiah-mason", "page_content": "Sir Josiah Mason was a visionary industrialist and philanthropist whose legacy is still felt in the modern world. He was a man of many trades, manufacturing dip pens and other goods, but his true gift was his ability to see beyond the present and into the future. Mason's foresight allowed him to establish the Mason Science College in 1875, which would eventually become the prestigious University of Birmingham.\n\nMason's journey began in 1795 in the charming town of Kidderminster, where he was born into a working-class family. Despite his humble beginnings, Mason's natural curiosity and entrepreneurial spirit set him on a path of success. He became an accomplished businessman, and his pen manufacturing business quickly rose to become one of the most successful in England. But Mason's ambition was not limited to profit; he recognized the importance of education and the role it played in shaping society.\n\nMason's belief in education was not only evident in his philanthropic endeavors, but also in his personal life. He was an avid reader and collector of books, and his extensive library was a testament to his love for knowledge. Mason's passion for learning was infectious, and he inspired those around him to strive for academic excellence.\n\nBut Mason's legacy extended far beyond his personal interests. His commitment to education and philanthropy was unparalleled, and he used his wealth to make a difference in the world. He established the Mason Orphanage in 1869, which provided housing, education, and support for disadvantaged children. Mason also donated generously to medical research and was a strong advocate for public health.\n\nMason's vision and philanthropy were recognized during his lifetime, and he was knighted by Queen Victoria in 1872. His impact on society continued even after his death in 1881. The statue created in his honor by Francis John Williamson in 1885 may have been destroyed, but the memory of his legacy lives on in the Mason Science College, the University of Birmingham, and the countless lives he touched.\n\nIn conclusion, Sir Josiah Mason was a remarkable man who embodied the spirit of innovation, philanthropy, and commitment to education. His legacy serves as a shining example of what can be accomplished through hard work, determination, and a commitment to making the world a better place.\n\nBiography\n\nJosiah Mason's life began in humble beginnings, as the son of a carpet-weaver, born in Mill Street, Kidderminster. He was a man of many talents, trying his hand at various trades such as shoemaking, baking, carpentering, blacksmithing, house-painting, and carpet-weaving in his hometown. However, his thirst for success led him to move to the bustling city of Birmingham in 1816, where he found employment in the gilt-toy trade.\n\nAfter eight years of hard work, Mason set up his own business in 1824 as a manufacturer of split-rings by machinery, later adding the production of steel pens. Though he was the largest producer of steel pens in England, his name was not as well known as other makers due to his pens being marketed through James Perry, founder of Perry & Co., the London stationer whose name they bore.\n\nApart from his steel-pen trade, Mason carried on with other businesses such as electro-plating, copper-smelting, and India-rubber ring making in partnership with George Elkington. Despite his commercial successes, Mason felt keenly aware of his lack of formal education, having taught himself to write when he was a shoemaker's apprentice.\n\nIn 1860, he founded a great orphanage in Erdington, near Sutton Coldfield, about 6 miles from Birmingham, which he funded with about £300,000. His munificent endowment led to him being knighted in 1872. Before this, he had already given a dispensary to his hometown and an almshouse to Erdington.\n\nMason's philanthropy did not end with the orphanage. In 1880, he opened Mason College, which was later incorporated into the University of Birmingham. The total value of his endowment was about £250,000.\n\nMason's accomplishments were celebrated even after his death. His bust, made by William Bloye from a marble statue by Francis John Williamson in 1885, stands at the center of a roundabout at the junction of Chester Road and Orphanage Road in Erdington. Though the marble statue has been destroyed, the bronze bust is still adorned with festive decorations during special occasions and seasonal holidays.\n\nIn conclusion, Josiah Mason's life is an inspiring story of a man who rose from being a street hawker to becoming a successful businessman and philanthropist. He lived a life of purpose, leaving a lasting legacy that has continued to inspire generations."}, {"url": "https://prabook.com/web/josiah.mason/3731303", "page_content": "Josiah Mason\n\nIndustrialist philanthropist\n\nFebruary 23, 1795 (age 86) Mill Street, Kidderminster, England, United Kingdom\n\nHe founded Mason Science College in 1875, which later became the University of Birmingham. He began life as a street hawker of cakes, fruits and vegetables. After trying his hand in his native town at shoemaking, baking, carpentering, blacksmithing, house-painting and carpet-weaving, he moved in 1816 to Birmingham. Here he found employment in the gilt-toy trade. In 1824 he set up on his own account as a manufacturer of split-rings by machinery, to which he subsequently added the making of steel pens. Owing to the circumstance of his pens being supplied through James Perry, the London stationer whose name they bore, he was less well known than Joseph Gillott and other makers, although he was really the largest producer in England, contributing heavily to the Birmingham pen trade. In 1874 the business was converted into a limited liability company. Besides his steel-pen trade Mason carried on for many years the business of electro-plating, copper-smelting, and India-rubber ring making, in conjunction with George Elkington. Mason was almost entirely self-educated, having taught himself to write when a shoemaker\"s apprentice, and in later life he felt his deficiencies keenly. lieutenant was this which led him in 1860 to establish his great orphanage at Erdington, near Birmingham. Upon it he expended about £300,000, and for this munificent endowment he was knighted in 1872. He had previously given a dispensary to his native town and an almshouse to Erdington. In 1880 Mason College, since incorporated in the University of Birmingham, was opened. The total value of the endowment was about £250,000. In commemoration of him, his bust stands at the centre of the roundabout at the junction of Chester Road & Orphanage Road in Erdington (52531556°North 1825128°West﻿ / 52531556. -1825128). This bronze bust was cast in 1951 by William Bloye from a marble statue by Francis John Williamson in 1885, which stood opposite Mason Science College in Edmund Street, but has since been destroyed. The bust is often \"dressed\" on special occasions and seasonal holidays."}, {"url": "https://peoplepill.com/people/josiah-mason/", "page_content": "Sir Josiah Mason (23 February 1795 – 16 June 1881) was an English industrialist, engaged in pen manufacture and other trades, and a philanthropist. He founded Mason Science College in 1875, which later became the University of Birmingham.\n\nHe was the son of a carpet-weaver, and was born in Mill Street, Kidderminster. He began life as a street hawker of cakes, fruits and vegetables. After trying his hand in his native town at shoemaking, baking, carpentering, blacksmithing, house-painting and carpet-weaving, he moved in 1816 to Birmingham. Here he found employment in the gilt-toy trade. In 1824 he set up on his own account as a manufacturer of split-rings by machinery, to which he subsequently added the making of steel pens. Owing to the circumstance of his pens being supplied through James Perry, the London stationer whose name they bore, he was less well known than Joseph Gillott and other makers, although he was really the largest producer in England, contributing heavily to the Birmingham pen trade. In 1874 the business was converted into a limited liability company. Besides his steel-pen trade Mason carried on for many years the business of electro-plating, copper-smelting, and India-rubber ring making, in conjunction with George Elkington.\n\nMason was almost entirely self-educated, having taught himself to write when a shoemaker's apprentice, and in later life he felt his deficiencies keenly. It was this which led him in 1860 to establish his great orphanage at Erdington, near Birmingham. Upon it he expended about £300,000, and for this munificent endowment he was knighted in 1872. He had previously given a dispensary to his native town and an almshouse to Erdington. In 1880 Mason College, since incorporated in the University of Birmingham, was opened. The total value of the endowment was about £250,000.\n\n\n\n\n\nStatue\n\nJosiah Mason’s Jubilee 2012 'outfit' Josiah Mason’s Jubilee 2012 'outfit'\n\nIn commemoration of him, his bust stands at the centre of the roundabout at the junction of Chester Road & Orphanage Road in Erdington ( ). This bronze bust was cast in 1951 by William Bloye from a marble statue by Francis John Williamson in 1885, which stood opposite Mason Science College in Edmund Street, but has since been destroyed. The bust is often \"dressed\" on special occasions and seasonal holidays."}, {"url": "https://www.sueyounghistories.com/2009-11-12-josiah-mason-1795-1881/", "page_content": "November 12, 2009\n\nSir Josiah Mason 1795 - 1881 was an English pen manufacturer, Philanthropist, Trustee and member of the Management Committee, and major sponsor of the Birmingham Homeopathic Hospital, and the Co-founder of the Mason Science College in Birmingham, which evolved into the University of Birmingham,\n\nJosiah Mason was a close friend and homeopathic patient of James Gibbs Blake and Edward Wynne Thomas, Josiah Mason was also a close friend of Alexander Parkes, Joseph Priestley,\n\nat the end, James Gibbs Blake ’watched him day and night’)… The procession, which left Norwood House, the residence of the deceased, consisted of James Gibbs Blake and Dr. J C Huxley, who attended Sir Josiah during his illness; the coffin, borne by eight servants and workpeople; and the following mourners…\n\nOn 12.12.1870, James Gibbs Blake, Josiah Mason and George James Johnson executed the Foundation Deed of the University of Birmingham:\n\nFrom http://en.wikipedia.org/wiki/University_of_Birmingham#History On February 23, 1875, Josiah Mason, the Birmingham industrialist and philanthropist, who made his fortune in making key rings, pens, pen nibs and electroplating, founded Mason Science College. It was this institution that would eventually form the nucleus of the University of Birmingham.\n\nIn 1882, the Departments of Chemistry, Botany and Physiology were transferred to Josiah Mason Science College, soon followed by the Departments of Physics and Comparative Anatomy.\n\nThe transfer of the Medical School to Mason Science College gave considerable impetus to the growing importance of that college and in 1896 a move to incorporate it as a university college was made.\n\nAs the result of the Mason University College Act 1897 it became incorporated as Mason University College on January 1, 1898, with the Right Honourable Joseph Chamberlain MP becoming the President of its Court of Governors.\n\nFrom http://bobmiles.bulldoghome.com/pages/bobmiles_bulldoghome_com/morejmason.htm As you might imagine, Josiah Mason became extremely wealthy and in the 1850s he turned his thoughts to philanthropy. In 1858 he opened almshouses in Station Road, Erdington, Birmingham, for spinsters and widows over 50 and orphan girls, providing accommodation in furnished rooms 14ft x 11ft with coal, gas and a small annual income provided.\n\nThis huge, Italianate building, dominated by three tall towers, cost £60,000 to build and was endowed to the tune of £200,000. After differences of opinion with Anglican supporters, who were less keen than Josiah Mason on helping poor children, Josiah Mason decided to go it alone and found all this money, which amounted to a huge fortune in those days, himself. Later a new wing was added to enable a total of 500 children to be accommodated…\n\nIn 1870 Josiah Mason embarked upon his greatest charitable project, drawing up trust deeds for a college of science. This being intended to equip its graduates to serve local industry, the curriculum was confined to maths, physics, chemistry, natural sciences, physiology and engineering. Literature and theology were specifically excluded.\n\nThe college, which was situated in Paradise Street in the city centre, cost Mason £170,000 in building costs and endowments. It was opened in Two of its earliest alumni - Stanley Baldwin and Arthur Neville Chamberlain were to become prime ministers.\n\nIn 1882 Mason’s College absorbed the medical faculty of the older Queen’s College, and in 1888 it became Mason’s University College. This institution in turn became the University of Birmingham in 1900. The university having been established on a site at Edgbaston, in 1964 the old Mason’s College buildings were knocked down to make way for the new central library…\n\nEven after he had given almost £500,000 to his various charitable projects, his estate was still worth £56,000. These were, of course, vast sums of money at the time.\n\nThe Sir Josiah Mason Trust is still active today.\n\nHere he found employment in the gilt toy trade. In 1824 he set up on his own account as a manufacturer of split rings by machinery, to which he subsequently added the making of steel pens.\n\nOwing to the circumstance of his pens being supplied through James Perry, the London stationer whose name they bore, he was less well known than Joseph Gillott and other makers, although he was really the largest producer in England, contributing heavily to the Birmingham pen trade.\n\nIn 1874 the business was converted into a limited liability company. Besides his steel pen trade Mason carried on for many years the business of electro plating, copper smelting, and India rubber ring making, in conjunction with George Elkington.\n\nMason was almost entirely self educated, having taught himself to write when a shoemaker’s apprentice, and in later life he felt his deficiencies keenly. It was this which led him in 1860 to establish his great orphanage at Erdington, near Birmingham.\n\nUpon it he expended about £300,000, and for this munificent endowment he was knighted in 1872.\n\nHe had previously given a dispensary to his native town and an almshouse to Erdington. In 1880 Mason College, since incorporated in the University of Birmingham, was opened. The total value of the endowment was about £250,000.\n\nIn commemoration of him, his bust stands at the centre of the roundabout at the junction of Chester Road & Orphanage Road in Erdington. This bronze bust, erected in 1951, was cast by William Bloye from a marble statue by Francis G Williamson in 1885, which stood opposite Mason Science College in Edmund Street.\n\nOf interest:\n\nRobert Martineau (1798-1870) (Mayor of Birmingham 1846-7) brother of Harriet Martineau, father of Robert Francis Martineau, and Patron of the Birmingham Homeopathic Hospital and Dispensary (John Ryan (Ed.), The Monthly Homeopathic Review, (1863). Page 758).\n\nRobert Francis Martineau (1831-1909) was a town councillor in Birmingham, secretary of the Birmingham and Midland Institute, chairman of the Technical School committee, trustee to Mason Science College, and then a member of the council of the University of Birmingham when it evolved from Mason College).\n\nJosiah Mason had a debilitating illness (?did he meet Samuel Hahnemann there?):"}, {"url": "https://www.sjmt.org.uk/sir-josiah-mason-trust", "page_content": "Sir Josiah Mason Trust was found in 1868 by Josiah Mason, a Victorian industrialist and philanthropist.\n\n​\n\nSir Josiah was born in 1795 in Kidderminster, a 'self-made man with no advantages of birth, or connections, or education, or means'. Born 17 years before Charles Dickens began to write about the poverty of the Victorian era, Josiah taught himself to write and joined a unitarian Sunday School as they could provide him with a basic education. He went on to build a vast fortune from self taught engineering skills and astute business knowledge.\n\n​\n\nFrom an early age, Josiah showed an entrepreneurial flare and tried his hand at many inventions, trades and business ventures before moving to Birmingham in 1816. By 1824, he invested the savings he had earned into a business which manufactured split rings. It was here that he improved the machinery that made the rings so that it was bevelled, hence the modern day key ring. He later went on to become the largest manufacturer of steel pens and pen nibs in the World and contributed heavily to the Birmingham pen trade. He also improved the machinery to make the split pen nib.\n\n​\n\nJosiah, most likely influenced by his childhood experiences was an extremely caring and generous man who went on to do many charitable works, including the founding of schools, a dispensary and Mason Science College, the forerunner of the University of Birmingham. He was knighted for his good works in November 1872.\n\n​\n\nThe Trust\n\nIn 1858, Josiah built the first Almshouses in Station Road, Erdington for 30 'spinsters and widows' over 50 years old and rooms for 20 orphan girls. These Almshouses were demolished in 1974.\n\n​\n\nIt was 10 years later that the Trust was officially founded on the 29th July 1868, in readiness for the opening of a second, larger orphanage in Bell Lane (now Orphanage Road), Erdington, with rooms for 26 women and dormitories for 300 children. It cost £60,000 to build and was endowed to the sum of £200,000. All of this was financed by Sir Josiah and it amounted to a huge fortune at this time. Later a new wing was added to enable a total of 500 children to be accommodated. The orphanage was eventually re-designated as a school, but by the 1960's the cost of upkeep had become prohibitive, leading the Trustees to close it in 1960.\n\nThe Trust retained ownership of a small part of the Orphanage site which contained 36 Almshouses built in the 1920's and which are now called Mason Cottages. It then went on to build further Almshouses on our sites in Shirley in 1974 and Olton in 1979 and started providing care services in the 1980's.\n\n​\n\nThe Trust has continued to grow and evolve over the years and the need for the Trust is as real today as it was 150 years ago. We now enter an exciting and ambitious new phase of development in which we aim to improve the lives of many more people living in Birmingham and Solihull."}, {"url": "https://www.sjmt.org.uk/our-history", "page_content": "Our history\n\nSJMT (Sir Josiah Mason Trust) was founded in 1868 by Josiah Mason, a Victorian industrialist and philanthropist.\n\n​\n\nAfter many changes to our legal structure over a 150 year period, in 2018, we become a Limited Company and Charity. This new legal entity offers us greater protection and flexibility and enabled us to became the corporate Trustee of our 3 charities: Sir Josiah Mason's Almshouse Charity, Sir Josiah Mason's Care Charity and Sir Josiah Mason's Relief in Need and Educational Charity.\n\n​\n\nIn July 2019, we welcomed Holy Trinity Heath Town Almshouse Charity and Holte & Bracebridge Charity to our family. These were followed by Thomas Banks Almshouses in 2021 & Oak Tree House Trust in 2022. These fantastic, historic charities had all struggled to attract new Trustees to continue and under our management and trusteeship, they can continue to operate in their original name.\n\n​\n\nRead more about each of these charities here by clicking on the name...\n\n​\n\n​\n\n​\n\n​"}, {"url": "https://everything.explained.today/%5C/Josiah_Mason/", "page_content": "Josiah Mason Explained\n\nSir Josiah Mason Birth Date: 23 February 1795 Birth Place: Mill Street, Kidderminster, England Occupation: Industrialist Known For: Philanthropy\n\nSir Josiah Mason (23 February 1795 – 16 June 1881) was an English industrialist, engaged in pen manufacture and other trades, and a philanthropist. He founded Mason Science College in 1875,[1] [2] which later became the University of Birmingham.[3]\n\nBiography\n\nHe was the son of a carpet-weaver, and was born in Mill Street, Kidderminster. He began life as a street hawker of cakes, fruits and vegetables. After trying his hand in his native town at shoemaking, baking, carpentering, blacksmithing, house-painting and carpet-weaving, he moved in 1816 to Birmingham. Here he found employment in the gilt-toy trade. In 1824 he set up on his own account as a manufacturer of split-rings by machinery, to which he subsequently added the making of steel pens.[4] Owing to the circumstance of his pens being marketed through James Perry (founder of Perry & Co., the London stationer whose name they bore, he was less well known than Joseph Gillott and other makers, although he was really the largest producer in England, contributing heavily to the Birmingham pen trade.\n\nIn 1874 the business was converted into a limited liability company. Besides his steel-pen trade, Mason carried on for many years the business of electro-plating, copper-smelting, and India-rubber ring making, in conjunction with George Elkington.\n\nMason was almost entirely self-educated, having taught himself to write when a shoemaker's apprentice, and in later life he felt his deficiencies keenly. It was this which led him in 1860 to establish his great orphanage at Erdington, near Sutton Coldfield, some 6 miles from Birmingham. Upon it he expended about £300,000, and for this munificent endowment he was knighted in 1872. He had previously given a dispensary to his native town and an almshouse to Erdington. In 1880 Mason College, since incorporated in the University of Birmingham, was opened. The total value of the endowment was about £250,000.\n\nIn commemoration of him, his bust stands at the centre of the roundabout at the junction of Chester Road & Orphanage Road in Erdington . This bronze bust was cast in 1951 by William Bloye from a marble statue by Francis John Williamson in 1885, which stood opposite Mason Science College in Edmund Street, but which has since been destroyed.[5] Williamson's statue was erected posthumously, Mason having vetoed its creation during his lifetime.[6] The bust is often \"dressed\" on special occasions and seasonal holidays.\n\nReferences\n\nJosiah Mason: A Biography , John Thackray Bunce, 1882\n\n, John Thackray Bunce, 1882 A History of Kidderminster , Rev. John Richard Burton, 1890\n\n, Rev. John Richard Burton, 1890 Solid Citizens – Statues in Birmingham, Bridget Pugh, 1983,\n\nNotes and References"}, {"url": "https://www.calendarz.com/on-this-day/june/16/josiah-mason", "page_content": "Death\n\nJun, 16\n\nJosiah Mason\n\nJosiah Mason, English businessman and philanthropist (b. 1795)\n\nSir Josiah Mason (23 February 1795 – 16 June 1881) was an English industrialist, engaged in pen manufacture and other trades, and a philanthropist. He founded Mason Science College in 1875, which later became the University of Birmingham."}]}