{"Balbir Singh Kullar was a member of the All India Congress Committee from 1952 to 1956.": [{"url": "https://www.loc.gov/item/lcwaN0002840/", "page_content": "The Library of Congress is making its Web Archives Collection available for educational and research purposes. The Library has obtained permission for the use of many materials in the Collection, and presents additional materials for educational and research purposes in accordance with fair use under United States copyright law.\n\nMany, if not all, of the websites in the collection and elements incorporated into the websites (e.g., photographs, articles, graphical representations) are protected by copyright. You are responsible for deciding whether your use of the items in this collection is legal. You are also responsible for securing any permissions needed to use the items. You will need written permission from the copyright owners of materials not in the public domain for distribution, reproduction, or other use of protected items beyond that allowed by fair use or other statutory exemptions. Some content may be protected under international law. You may also need permission from holders of other rights, such as publicity and/or privacy rights.\n\nResearchers should consult the sites themselves for information about rights, contacts, and permissions. The catalog record for each archived website contains the specific information about the site known to the Library. Some sites in this collection may be restricted to onsite access only; see the Access Condition statement in each item record for more information.\n\nThe Library of Congress would like to hear from any copyright owners who are not properly identified on this website so that we may make the necessary corrections. In addition, if you are a copyright owner or otherwise have exclusive control over materials presently available through this collection and do not wish your materials to be available through this website, please let us know. To make a takedown request, please contact us via this contact form.\n\nContent Embargo\n\nNot all content that the Library has archives for is currently available through the Library’s website. Limitations affecting access to the archived content include a one-year embargo period for all content in the archive. Content outside of the embargo period is updated and made available regularly. For more information visit the Web Archiving Program | For Researchers page.\n\n\n\nCiting Resources in the Web Archive\n\nCitations should indicate: Archived in the Library of Congress Web Archives at www.loc.gov. When citing a particular website include the archived website's Citation ID (e.g., /item/lcwa00010240). Researchers are advised to follow standard citation guidelines for websites, pages, and articles. Researchers are reminded that many of the materials in this web archive are copyrighted and that citations must credit the authors/creators and publishers of the works. For guidance about compiling full citations consult Citing Primary Sources.\n\nMore about Copyright and Other Restrictions"}, {"url": "https://scroll.in/field/994344/pause-rewind-play-1928-1956-a-brief-history-of-indian-hockeys-golden-era-at-the-olympics", "page_content": "Field hockey is one of the near-constant features in the Summer Olympic Games and it is a sport that India dominated like no other country has managed to.\n\nAfter a first appearance at the 1908 Games in London, hockey became a firm fixture on the Olympic programme at 1920 Antwerp Games. It was not until 1980 that women made their entrance in this sport and India are yet to win a medal in that discipline. The men, however, sit atop the gold medal standings despite not winning a medal since the Moscow Games in 1980.\n\nThe Indian men’s team won six consecutive titles between 1928 and 1956. In that period, they scored a total of 178 goals and conceded just seven, winning every single out of the 25 matches they played. Till their defeat in the 1960 Rome final against Pakistan, India were unbeaten in 30 consecutive matches, and scored 197 goals, giving away only eight.\n\nThose are records that are unlikely to be matched in the Olympic Games history.\n\nPlay\n\nIndia's field hockey medals at Olympic Games Venue Year Medal Captain Amsterdam 1928 Gold Jaipal Singh Los Angeles 1932 Gold Lal Shah Bokhari Berlin 1936 Gold Dhyan Chand London 1948 Gold Kishan Lal Helsinki 1952 Gold KD Singh ‘Babu’ Melbourne 1956 Gold Balbir Singh Sr Rome 1960 Silver Leslie Claudius Tokyo 1964 Gold Charanjit Singh Mexico 1968 Bronze Prithipal Singh\n\nGurbux Singh\n\nMunich 1972 Bronze Harmik Singh Moscow 1980 Gold Vasudevan Baskaran Tokyo 2021 Bronze Manpreet Singh\n\nMost gold medals at Olympics field hockey (men) India 8 (1928, 1932, 1936, 1948, 1952, 1956, 1964, 1980) Germany* 4 (1972, 1992, 2008, 2012) Pakistan 3 (1960, 1968, 1984) Great Britain 3 (1908*, 1920, 1988) Netherlands 2 (1996, 2000) Australia 1 (2004) New Zealand 1 (1976) Argentina 1 (2016) Includes West Germany in 1972\n\nIndian hockey’s golden streak at the Olympics Games: 1928: Played 5, won 5 (29 scored, 0 conceded)\n\n1932: Played 2, won 2 (35 scored, 2 conceded)\n\n1936: Played 5, won 5 (38 scored, 1 conceded)\n\n1948: Played 5, won 5 (25 scored, 2 conceded)\n\n1952: Played 3, won 3 (13 scored, 2 conceded)\n\n1956: Played 5, won 5 (38 scored, 0 conceded)\n\nHere, we take a look back at the six consecutive gold medals that India won from 1928 Amsterdam to 1956 Melbourne:\n\n1928 Amsterdam\n\nThe world was introduced to the magic of Dhyan Chand. In India’s first appearance in field hockey at the Olympic Games (as part of the British Raj back then), the team went undefeated over the four Division A games and then beat host Netherlands in the final. India went that Olympic tournament in Amsterdam without conceding a goal, while scoring 29 themselves. And at the center of it all was Chand, who finished the tournament with a total of 14 goals including two in the final.\n\nAccording to a report in Olympics.com, “Legend has it that the Dutch officials took his stick apart to see if there was a magnet hidden inside it! One newspaper report described it thus: ‘This is not a game of hockey, but magic. Dhyan Chand is, in fact, the magician of hockey’.”\n\nIndia squad: Jaipal Singh (C), Richard Allen, Dhyan Chand, Maurice Gateley, William Goodsir-Cullen, Leslie Hammond, Feroz Khan, George Marthins, Rex Norris, Broome Penniger (VC), Michael Rocque, Frederic Seaman, Ali Shaukat, Sayed Yusuf, Kher Singh Gill and Nawab of Pataudi.\n\nThe 1928 Olympics where India began their domination of hockey. Fascinating to note that India played five forwards in the final against Holland. Screenshots from the official report of the event. pic.twitter.com/0pstBobJAy — Ashish Magotra (@clutchplay) June 23, 2021\n\n1932 Los Angeles\n\nIt was once again the Dhyan Chand show as his exploits saw Los Angeles Times name him best athlete of the Olympic Games. It was just a mini tournament with just three teams and the Europeans missing from the field. India notched a record 24-1 win against the hosts USA where Chand and brother Roop Singh scoring 18 between then and they drubbed Japan 11-1 to win their second Olympic gold medal. The tournament was marred in the lead-up by reports of groupism as well as travel-related issues but once they took to the field there were only one winners.\n\nIndia squad: Lal Shah Bokhari (C), Richard Allen, Muhammad Aslam, Frank Brewin, Richard Carr, Dhyan Chand, Leslie Hammond, Arthur Hind, Sayed Jaffar, Masud Minhas, Broome Penniger, Gurmit Singh Kullar, Roop Singh, William Sullivan and Carlyle Tapsell.\n\n1936 Berlin\n\nThere are said to be posters all over the German capital proclaiming: ‘Visit the hockey stadium to watch the Indian magician Dhyan Chand in action.’ That was the magnetic quality of the Indian star, now the captain of the side.\n\nConsidered by some as the greatest Indian hockey squad, the Dhyan Chand-led Indians did not have the best of build-ups to the tournament. There were a couple of concerning defeats pre tournament but once the Games began, there was no stopping them. The crowning moment of the tournament was a win in the final against the hosts.\n\nAccording to a report on Olympics.com, “Dhyan Chand scored in six goals in the 1936 Berlin Olympic final. This despite losing a tooth after a collision with German goalkeeper Tito Warnholtz. Dhyan Chand returned to the field after seeking medical attention and in the second half, he reportedly played barefoot to run faster.”\n\nIndia squad: Dhyan Chand (C), Richard Allen, Ali Dara, Lionel Emmett, Peter Fernandes, Joseph Galibardy, Earnest Goodsir-Cullen, Mohammed Hussain, Sayed Jaffar (VC), Ahmed Sher Khan, Ahsan Khan, Mirza Masood, Cyril Michie, Baboo Nimal, Joseph Phillips, Shabban Shahab-ud-Din, G.S. Garewal, Roop Singh and Carlyle Tapsell.\n\nPlay\n\nIndian Men's Hockey team reached finals of the Berlin 1936 #OlympicGames unbeaten, losing only a practice game to Germany.#OnThisDay India's Hockey prowess and stick work triumphed, as captain Dhyan Chand won #TeamIndia its third Olympic🥇medal defeating the German side 8-1! pic.twitter.com/KA0UinnFIM — Team India (@WeAreTeamIndia) August 15, 2019\n\nFrom the official report of 1936 Olympic Games\n\n1948 London\n\nSimply put, one of India’s greatest ever moments at the Olympic Games.\n\nDespite the hat-trick of gold medals at the Games before, the 1948 campaign was special because, for the first time, the team was to march under the tri-colour and not the British-India flag. More importantly, it was considered to be a difficult campaign as the once all-conquering unit was now divided into two separate teams – India and Pakistan.\n\nModern India’s most decorated hockey legend Balbir Singh Sr. scored a brace as India hammered their former colonial masters on their own home turf 4-0 to clinch the gold medal.\n\n“As our national anthem was being played and the tri-colour was going up, I felt that I too was flying with the flag. The sense of patriotism that I felt was beyond any other feeling in the world,” the late Balbir Singh had recalled at the Chandigarh Press Club.\n\nBalbir Singh Sr’s proudest moment: Independent India’s first hockey Olympic gold in 1948\n\n‘Beyond any other feeling in the world’: Balbir Singh recalls historic 1948 hockey Olympics gold\n\nIndia squad: Kishan Lal (C), Leslie Claudius, Keshav Dutt, Walter D’Souza, Lawrie Fernandes, Ranganathan Francis, Gerry Glacken, Akhtar Hussain, Patrick Jansen, Amir Kumar, Leo Pinto, Jaswant Singh Rajput, Latif-ur-Rehman, Reginald Rodrigues, Balbir Singh Sr., Randhir Singh Gentle, Grahanandan Singh, K. D. Singh Babu (VC), Trilochan Singh and Maxie Vaz.\n\nPlay\n\nToday, in 1948, India won her 1st @Olympics Hockey gold as an independent nation, beating her colonial masters in the final, on their soil.\n\nWhat a proud moment for us and the team of legends.\n\nEnjoy this rare video clip of the final.\n\nJai Hind!@TheHockeyIndia @IndianOlympians pic.twitter.com/SXWP8IDByu — Rajesh Kalra (@rajeshkalra) August 12, 2020\n\nExcerpt from a Scroll.in article: No team from Great Britain or its constituent parts (i.e. England, Scotland, Ireland and Wales) took part in the Olympics between 1928 and 1936. It remained one of Chand’s biggest regrets in life that he did not get the opportunity to beat the rulers at their own game. But there was a sense of poetic justice to it as well. When India reached the final of the 1948 Olympics hockey tournament, their opponents were Great Britain, making a comeback to the world event. And revenge was sweet, one year after they achieved independence from their former colonial rulers, India thrashed Britain 4-0.\n\n1952 Helsinki\n\nEvidently, not for the first time, the build-up to the Olympic Games was marred by administrative controversies for the Indian hockey team. KD Singh Babu-led squad also had trouble with adapting to the conditions in Finland.\n\n“Nanaji (grandpa) told me that the team would draw the curtains at all times and even used bedsheets to block out the light and make an entirely dark room to be able to get some sleep,” Kabir Singh, Balbir Singh Sr’s grandson, is quoted as telling the Olympic Channel.\n\nThe start of the tournament was iffy, but they peaked — as the cliche goes — at the right time to claim their fifth consecutive gold medal. India defeated Great Britain 3-1 in the semi-final with Balbir Singh Sr. scoring the second of his three Olympic hat-tricks. Saving the best for last, Balbir scored five goals on the day of the final, a record in the final of a men’s Olympic field hockey tournament that stands to this day. India stunned Netherlands 6-1 to win their fifth consecutive medal. The unbeaten streak continued.\n\nIndia squad: K. D. Singh Babu (C), Leslie Claudius, Meldric Daluz, Keshav Dutt, Chinadorai Deshmutu, Ranganathan Francis, Raghbir Lal, Govind Perumal, Muniswamy Rajgopal, Balbir Singh Sr., Randhir Singh Gentle, Udham Singh, Swarup Singh, Jaswant Singh, C.S. Dubey, C.S. Gurung, Dharam Singh and Grahanandan Singh.\n\nPlay\n\nPlay\n\n1956 Melbourne\n\nAlready established as a great of the game, Balbir Singh Sr got the chance to lead India. The overwhelming favourites made it six gold medals on the trot and once again went unbeaten at the event. India did not concede a single goal in the entire tournament for the second time after 1928 Olympics.\n\nLeslie Claudius, Randhir Singh Gentle, and Ranganathan Francis were playing their third Olympic Games along with Balbir who further cemented his status in the pantheon of legends in the game. But the contingent was dealt a blow as their leader got injured in the opening match. Reaching the final was largely straightforward, with Udham Singh stepping up.\n\nWith history about to be made when India took on Pakistan in the final, to mark the start of an epic rivalry, a call had to be made about their talisman. Balbir Singh Sr. had not played in any of the Indian hockey team’s matches since his injury. He led the team out on the field first and then on to the top of podium after a 1-0 win.\n\n“That day when I led my team out to the victory rostrum, I swelled with pride. The crowd cheered us and it was a thrilling experience to acknowledge their applause,” the captain recounted about the experience at MCG.\n\n“It was a very happy moment for us. We won all the matches in the 1956 Olympics,” former Indian hockey forward Gurdev Singh told Hockey India.\n\n“This was only the second time that no team had scored against India in the entire Olympics campaign. Our captain Balbir Singh Sr’s finger was broken during the tournament, but he still played for the team. At that time, wherever the Indian hockey team went, it always won.”\n\nAlso read: When Balbir Singh faced Pakistan in 1956 Olympic final with a fractured hand\n\nIndia squad: Balbir Singh Sr.(C), Leslie Claudius, Ranganathan Francis, Haripal Kaushik, Amir Kumar, Raghbir Lal, Shankar Lakshman, Govind Perumal, Amit Singh Bakshi, Raghbir Singh Bhola, Hardyal Singh Garchey, Randhir Singh Gentle, Balkishan Singh Grewal, Gurdev Singh Kullar, Udham Singh Kullar, Bakshish Singh, O.P. Malhotra and Charles Stephen.\n\nUndisputed champions: The story of India’s rise as a hockey giant in the pre-Independence erahttps://t.co/sub7GLpZNR (via @thefield_in) — scroll.in (@scroll_in) May 21, 2021\n\nFull squad lists courtesy Hockey India."}, {"url": "https://www.thehindu.com/sport/hockey/1956-olympics-india-pips-pakistan-to-win-gold/article3627897.ece", "page_content": "July 11, 2012 06:27 pm | Updated July 05, 2016 12:04 pm IST\n\nThe discerning reckon the hockey team to the 1956 Melbourne Olympics, led by centre-forward Balbir Singh, was one of the best ever to leave Indian shores. The squad was brimming with experience and youth besides tremendous firepower. It was hardly a surprise then that the team came away with another gold medal, the sixth in a row.\n\nFour of the team — Balbir Singh, Randhir Singh Gentle, Leslie Claudius and Ranganathan Francis — were playing their third Olympics, while for Govind Perumal, Udham Singh, Raghubir Lal and Amit Kumar it was their second Games. There were some young guns too in the squad that had an aura of invincibility and so it turned out to be.\n\nThe team played four warm-up games in Ambala and Bombay, winning all, but some players stayed out citing injuries. The Indian Hockey Federation ordered fitness tests and Gursevak Singh (PEPSU) was ruled unfit with a dodgy knee and was replaced by Amit Singh Bakshi of the Services on the eve of the team’s departure.\n\nThe Games were marred by boycotts as some of the nations from Middle East stayed away in the wake of the Suez Canal imbroglio while a couple of European nations, including Spain and the Netherlands, dropped out protesting the Russian handling of the Hungarian revolution.\n\nConsequently, only 12 teams took part. The teams were split into three groups of four each. India (Group A), Great Britain (Group B), and Pakistan and Germany (Group C) advanced to the semifinals.\n\nFor India, the league phase was a relatively easy affair as they hammered Afghanistan 14-0, the United States 16-0 and Singapore 6-0, but they lost skipper Balbir Singh, who suffered a fractured finger in the first game. Balbir’s injury provided Udham Singh a great opportunity to showcase his scoring ability, which he did with seven against the U.S., two versus Singapore and then the match-winner in India’s 1-0 win against Germany in the semifinals. Gentle converted a second-half short corner for India who beat Pakistan 1-0 in the final.\n\nIncidentally, India did not concede a single goal in the entire tournament to match their 1928 Olympics record, but then there were enough indications that other teams were catching up and so it proved to be. India’s reign was to end four years hence and though they regained the gold in 1964 and again in 1980, the King had lost his crown.\n\nIndian team: Balbir Singh Dosanjh (captain), Shankar Laxman, Ranganadhan Francis, Bakshish Singh, Randhir Singh Gentle, Leslie Walter Claudius, Amir Kumar, Charles Stephen, Govind Perumal, Gurdev Singh Kullar, Udham Singh Kullar, Raguhbir Singh Bhola, Balkrishan Singh Grewal, Haripal Kaushik, Raghbir Lall Sharma, OP Malhotra, Hardayal Singh Garchey and Amit Singh Bakshi.\n\nResults:\n\nLeague — India beat Afganistan 14-0 (Balbir Singh Dosanjh 5; Udham Singh Kullar 4; Randhir Singh Gentle 3; Gurdev Singh Kullar 2).\n\nIndia beat USA 16-0 (Udham Singh Kullar 7; Hardyal Singh Garchey 5; Gurdev Singh Kullar 3; Leslie Claudius 1).\n\nIndia beat Singapore 6-0 (Udham Singh Kullar 2; Charles Stephen 2; Randhir Singh Gentle 1; Hardyal Singh Garchey 1).\n\nSemifinal: India beat East Germany 1-0 (Udham Singh Kullar 1).\n\nFinal: India beat Pakistan 1-0 (Randhir Singh Gentle 1).\n\nPositions: India 1; Pakistan 2; Germany 3; Great Britain 4; Australia 5; New Zealand 6; Belgium 7; Singapore 8; Malaya 9; Kenya 10; USA 11; Afghanistan 12.\n\nRelated stories India's dominance in hockey"}, {"url": "https://olympics.com/en/news/melbourne-1956-olympics-indian-hockey-team-gold-medal-balbir-singh-sr-pakistan", "page_content": "In the early days of the Olympic Games, the **Indian hockey team’**s dominance was the stuff of folklore. Not only were India unbeatable tactically, the players’ skills meant that they outplayed opponents and scored loads of goals, often winning matches by margins of more than 10 goals. It was, therefore, no surprise that they had won five consecutive Olympic gold medals, including a hat-trick in 1928, 1932, 1936. The Indian hockey team won golds when the Olympics returned after World War II in 1948 and 1952 and were overwhelming title favourites for the 1956 Games, held in Melbourne. On December 6, 1956, India did live up to that tag, beating Pakistan 1-0 to win a second hat-trick of Olympic golds, this time as an independent nation.\n\nThe perfect hockey team After starring in the previous two Olympics for India, legend Balbir Singh Sr. had blossomed into one of the best players in the world and was unsurprisingly named captain for Melbourne 1956. Accompanying him in India’s pursuit of a second Olympic hat-trick were Leslie Claudius, Randhir Singh Gentle, and Ranganathan Francis – all of whom were playing their third Olympics. Udham Singh, Govind Perumal and Raghubir Lal were playing their second Olympics while the Indian hockey team also brought in exciting youngsters like Shankar Laxman, Gurdev Singh Kullar, and Haripal Kaushik. For the Melbourne Games, India had a great blend of experience – serial winners who knew what it took to come out on top – and young blood – who would provide the nonchalance in a title run. Prior to leaving for Melbourne, the Indian hockey team played four practice matches in Ambala and Bombay, winning all of them as expected. Though there were some injury concerns, much of the squad passed fitness tests with the only exception being Gursevak Singh, whose troublesome knee meant that he could not make his Olympic debut in Melbourne. Instead, that opportunity went to Amit Singh Bakshi. It may have been a minor injury blip in India’s Olympic sojourn, but they were about to be hit by a major one. A bittersweet group stage experience With only 12 teams taking part in the 1956 Olympics - the first edition to be held in the southern hemisphere - they were divided into three groups of four teams each. India were drawn in Group A, along with Singapore, Afghanistan and the United States, opponents who were thought to be no match for the five-time champions. The group stage matches were played at the Olympic Park Stadium while the semi-finals and the final was played at the Melbourne Cricket Ground (MCG), which was also the venue for the opening and closing ceremonies for the 1956 Olympic Games. India opened their Olympic campaign against Afghanistan, and sounded out their intentions early, putting 14 goals past their Asian counterparts. The huge victory came at a cost though. Captain Balbir Singh Sr, who had scored five goals in the game, had suffered a fractured finger and would be forced to sit out the upcoming games. It could have been a big blow for the Indian hockey team, who were robbed of their star and main creative attacking outlet. However a champion side often comes out on the other side of adversity with their heads held high and India did just that. In the absence of Balbir Singh Sr, they unearthed a gem in forward Udham Singh.\n\nUdham, who had scored four goals in the opening game, followed that effort up with seven goals in a 16-0 victory against the USA and then scored a brace in the Indian hockey team’s relatively sedate 6-0 win against Singapore in the final group game. The island nation was alert to India’s attacking prowess and set up in a defensive shape, putting several bodies behind the ball. The Indian hockey team were unable to penetrate the Singapore defence until the 23rd minute, the longest India had taken to score their opening goal in Olympic history. The Indian hockey team did gather momentum after that opening goal to run Singapore ragged and end the group stage with 36 goals in total, but strangely, the media and other experts were unconvinced about India being firm favourites. The fears proved to be partly true in the semi-finals as India could only beat Germany 1-0, with Udham Singh extending his scoring record. Nevertheless, they had set up a pulsating title showdown with Pakistan, who had beaten Great Britain in the other semi-final. An emotional India vs Pakistan final The Melbourne 1956 Olympic hockey final was the beginning of the storied India-Pakistan hockey rivalry. It was the first time that India would be playing hockey against Pakistan on the global stage since the partition in 1947 and was an emotional occasion for much of the Indian hockey team, with Balbir Singh Sr even admitting in his memoirs that he was unable to sleep the night before. But it was also time for the star to return. Captain Balbir Singh Sr had not played in any of the Indian hockey team’s matches since his injury in the first game and had been unable to recover by the time the final rolled around. However, head coach Harbail Singh insisted that the team’s talisman take the field, if only to send a message to Pakistan. He told me that even if I wasn’t able to play my best hockey, my reputation was such that the opponent would use two players to mark me and it would free up space for my other forwards. - Balbir Singh Sr. “My injury was kept a secret for the opposition and that I didn’t shake hands with anyone. Just waved. I took pain-killing injections at the start of the game and at half time and managed to play.” The final proved anything but easy for the Indian hockey team. Pakistan matched them stride for stride and ensured a goalless first half. However, India would soon take the lead. A few minutes into the second half, the Indian hockey team earned a penalty corner which was pushed through by Udham Singh. Raghubir Lal trapped the ball perfectly for Randhir Singh Gentle, who swept his shot into the Pakistan goal, past the last defender. Olympic debutant goalkeeper Shankar Laxman then kept Pakistan at bay, thwarting many attempts at his goal. India held on to win a historic sixth-consecutive Olympic gold, securing their second hat-trick and first as an independent nation. Moreover, India scored an Olympic record 38 goals in five matches, a tally unmatched to this date, and remarkably, conceded none. Forward Udham Singh ended with 15 goals, the most number of goals in an Olympic campaign."}, {"url": "https://olympics.com/en/news/helsinki-1952-olympics-indian-hockey-team-gold-medal-balbir-singh-sr-result", "page_content": "When the Indian hockey team won a second hat-trick of Olympic gold medals (1948, 1952, 1956) as an independent nation, it created a legacy that would be talked about for decades to come. Those were the days of Balbir Singh Sr, KD Singh Babu, Leslie Claudius and Keshav Dutt.\n\nJuly 24, 1952 was another red-letter day in Indian hockey. They reigned supreme over the Netherlands in the final of the Helsinki 1952 Olympics to clinch the gold medal for the fifth time overall.\n\nHowever, the journey to Finland was anything but ideal for a team that was considered as a runaway favourite.\n\nThe tumultuous back-story\n\nA month prior to the 1952 Olympics, the Indian hockey team for the Summer Games had been finalized with KD Singh Babu named captain and Balbir Singh Sr his deputy.\n\nHowever, the Indian Olympic Association (IOA) faced pressure from the Uttar Pradesh and Bengal state hockey associations to include centre-half OP Malhotra and striker CS Gurung in the team, respectively. This interference seemingly impacted the team’s combination.\n\nThe Indian hockey team suffered an unexpected defeat against a local team in one of their practice matches in Madras. Worse, KD Singh Babu was injured, losing a few of his front teeth after colliding with a Madras XI player.\n\nIt led to some questions on the preparedness of the Indian hockey team that went to Copenhagen, Denmark for a preparatory camp. The main idea was to get acclimatized to the cold Nordic weather and the alien conditions they would encounter in Helsinki.\n\nFinland, known as the ‘Land of the Midnight Sun’, would experience daylight for 24 hours a day for almost 70 days after the summer solstice on June 21, and the period coincided with the 1952 Olympics.\n\nIt was a phenomenon that the Indian hockey team, with 10 out of 18 members making their Olympics debut, was not familiar with. The time difference and those additional hours of sunlight were playing havoc with the team’s sleeping pattern.\n\n“Nanaji (grandpa) told me that the team would draw the curtains at all times and even used bedsheets to block out the light and make an entirely dark room to be able to get some sleep,” Kabir Singh, Balbir Singh Sr’s grandson, told Olympics.com."}, {"url": "https://www.inc.in/congress-working-committee/members", "page_content": "Dr A. Chella Kumar, MP\n\nMember\n\nNew No. 25, Old No. 12, 8th Cross Street, Shenoy Nagar, Chennai-600030 (TN)\n\nTel:(O)23019080 23063047\n\nMobile:9444071574\n\nEmail:[email protected]"}, {"url": "https://news.boringnews.co/story/2021-06-27-0c-when-india-won-its-6th-consecutive-hockey-gold-at-1956-olympics", "page_content": "Sixth gold: With less than one month to go for the Tokyo Olympics, let us relive one of the gold medal-winning moments of the Indian men’s hockey team at the quadrennial Games. Here, let us look back at the 1956 Olympics where India won hockey gold in Melbourne, Australia. This was India’s sixth consecutive gold, a streak that began in 1928. Between 1928 and 1956, the team was unbeaten in 30 consecutive matches, and scored 197 goals, and conceded only eight.\n\nUnbeaten: India, led by Balbir Singh Dosanjh (Balbir Singh Senior), went undefeated through the tournament at the 1956 Olympics. Also, the side did not concede even a single goal and scored 38 goals. The team, which was in Group A, opened the campaign with a 14-0 victory over Afghanistan. That was followed by a 16-0 success against the US. Then, India defeated Singapore 6-0. In the semi-final, India got the better of Germany 1-0. Udham Singh Kullar scored the winner. Udham scored 14 goals in the tournament.\n\nIndia-Pakistan final: The gold medal match was between India and Pakistan. Here too, just like the last four contest, India prevailed over its opponent by a solitary goal. Randhir Singh Gentle struck the winning goal in the second half of the final. This was the first time after the partition in 1947 that India and Pakistan had faced off in hockey.\n\nChampion speaks: Recently, Gurdev Singh Kullar, who was part of the victorious team at the 1956 Olympics, reminisced playing alongside Balbir. The 87-year-old recounted that if Balbir got into the ‘D’, he would definitely find the back of the net, \"We played with five forwards in that tournament. I scored 5 goals in the Olympics. We all used to practice a lot, but Balbir Singh Sr used to practice much more. Whenever he got into the ‘D’, he never missed the goal. He was a really good scorer.\"\n\nPlaying with injury: When asked about his memories from the Melbourne Games, Gurdev said, \"It was a very happy moment for us. We won all the matches in the 1956 Olympics. This was only the second time that no team had scored against India in the entire Olympics campaign. Our Captain Balbir Singh Sr’s finger was broken during the tournament, but he still played for the team. At that time, wherever the Indian Hockey Team went, it always won.\"\n\nNo big welcome: The Indian team didn’t receive a big reception once it returned home from the 1956 Olympics. \"When we came back from Melbourne with the gold medal, there were only three-four persons to receive us at the airport. Everyone expected us to win as it was quite normal for us to win gold medals in the Olympics,\" Gurdev said.\n\nIndian hockey team at 1956 Olympics: Balbir Singh Dosanjh (captain), Shankar Laxman, Ranganadhan Francis, Bakshish Singh, Randhir Singh Gentle, Leslie Walter Claudius, Amir Kumar, Charles Stephen, Govind Perumal, Gurdev Singh Kullar, Udham Singh Kullar, Raguhbir Singh Bhola, Balkrishan Singh Grewal, Haripal Kaushik, Raghbir Lall Sharma, O P Malhotra, Hardayal Singh Garchey and Amit Singh Bakshi."}, {"url": "https://www.sportskeeda.com/hockey/1956-olympics-indias-dominance-continues", "page_content": "The discerning reckon the hockey team to the 1956 Melbourne Olympics, led by centre-forward Balbir Singh, was one of the best ever to leave Indian shores. The squad was brimming with experience and youth besides tremendous firepower. It was hardly a surprise then that the team came away with another gold medal, the sixth in a row.\n\nFour of the team – Balbir Singh, Randhir Singh Gentle, Leslie Claudius and Ranganathan Francis – were playing their third Olympics, while for Govind Perumal, Udham Singh, Raghubir Lal and Amit Kumar it was their second Games. There were some young guns too in the squad that had an aura of invincibility and so it turned out to be.\n\nThe team played four warm-up games in Ambala and Bombay, winning all, but some players stayed out citing injuries. The Indian Hockey Federation ordered fitness tests and Gursevak Singh (PEPSU) was ruled unfit with a dodgy knee and was replaced by Amit Singh Bakshi of the Services on the eve of the team’s departure.\n\nThe Games were marred by boycotts as some of the nations from Middle East stayed away in the wake of the Suez Canal imbroglio while a couple of European nations, including Spain and the Netherlands, dropped out protesting the Russian handling of the Hungarian revolution.\n\nConsequently, only 12 teams took part. The teams were split into three groups of four each. India (Group A), Great Britain (Group B), and Pakistan and Germany (Group C) advanced to the semifinals.\n\nFor India, the league phase was a relatively easy affair as they hammered Afghanistan 14-0, the United States 16-0 and Singapore 6-0, but they lost skipper Balbir Singh who suffered a fractured finger in the first game. Balbir’s injury provided Udham Singh a great opportunity to showcase his scoring ability which he did with seven against the US, two versus Singapore and then the match-winner in India’s 1-0 win against Germany in the semifinals. Gentle converted a second-half short corner for India who beat Pakistan 1-0 in the final.\n\nIncidentally, India did not concede a single goal in the entire tournament to match their 1928 Olympics record, but then there were enough indications that other teams were catching up and so it proved to be. India’s reign was to end four years hence and though they regained the gold in 1964 and again in 1980, the King had lost his crown.\n\nIndian team: Balbir Singh Dosanjh (captain), Shankar Laxman, Ranganadhan Francis, Bakshish Singh, Randhir Singh Gentle, Leslie Walter Claudius, Amir Kumar, Charles Stephen, Govind Perumal, Gurdev Singh Kullar, Udham Singh Kullar, Raguhbir Singh Bhola, Balkrishan Singh Grewal, Haripal Kaushik, Raghbir Lall Sharma, OP Malhotra, Hardayal Singh Garchey and Amit Singh Bakshi.\n\nResults:\n\nLeague – India beat Afganistan 14-0 (Balbir Singh Dosanjh 5; Udham Singh Kullar 4; Randhir Singh Gentle 3; Gurdev Singh Kullar 2).\n\nIndia beat USA 16-0 (Udham Singh Kullar 7; Hardyal Singh Garchey 5; Gurdev Singh Kullar 3; Leslie Claudius 1).\n\nIndia beat Singapore 6-0 (Udham Singh Kullar 2; Charles Stephen 2; Randhir Singh Gentle 1; Hardyal Singh Garchey 1).\n\nSemi-final: India beat East Germany 1-0 (Udham Singh Kullar 1).\n\nFinal: India beat Pakistan 1-0 (Randhir Singh Gentle 1).\n\nPositions: India 1; Pakistan 2; Germany 3; Great Britain 4; Australia 5; New Zealand 6; Belgium 7; Singapore 8; Malaya 9; Kenya 10; USA 11; Afghanistan 12.\n\nAlso check out previous glory years:\n\n1952 Olympics\n\n1948 Olympics\n\n1936 Olympics\n\n1932 Olympics\n\n1928 Olympics\n\nPoll : 0 votes"}, {"url": "https://www.hockeyindia.org/hall-of-fame/padma-shri-award", "page_content": "Balbir Singh Sr.\n\nIntroduced in 1954 for outstanding civilians\n\nBalbir Singh Dosanjh, popularly known as Balbir Singh Sr. represented India in three Olympic Games getting the Gold Medal on each occasion. In the year 1957, he became the first recipient of the Padma Shri award in Sports category.\n\nHe made his Olympics debut at London in 1948 against Argentina where India won the match 9-1. He scored six goals including a hat-trick. In the final against Britain, India won 4-0 with Balbir scoring twice.\n\nAt the Helsinki Olympics 1952, he was the Vice-Captain and in the semi-final against Britain he scored all the three goals. In the final India beat Holland 6-1 with Balbir scoring five including a hat-trick He was made the Captain for the Melbourne Olympics in 1956.\n\nHe was the Manager of the Indian team that won the World Cup in 1975 in Kuala Lumpur."}, {"url": "https://olympics.com/en/news/balbir-singh-dosanjh-sr-senior-indian-national-hockey-team-olympics-gold-medal", "page_content": "Any discussion on Indian hockey invariably steers towards the glory years of yore when the Indian men’s hockey team seemed like indefatigable winners, triumphing in six consecutive Olympics from 1928 to 1956. While it was ‘The Wizard’ Dhyan Chand who played a starring role in the Indian national hockey team’s first three Olympic golds pre-independence, the architect of the other three was none other than Balbir Singh Dosanjh. Balbir Singh Senior, a three-time Olympic gold medallist, still stands as one of India’s most revered hockey legends and probably the only player whose name is uttered in the same breath as Dhyan Chand’s in the Indian hockey folklore. “It was destiny which helped me to achieve all I did during my career,” Balbir Singh Sr. had summed up his accolades in an interview with The Hindu. Finding gold amidst the partition chaos Born in Punjab’s Jalandhar district on December 31, 1923, Balbir Singh’s fascination with hockey took root early. After watching India win its third Olympic gold at Berlin 1936, Balbir Singh, then just 12-years-old, decided that hockey was the sport he wanted to make his mark in. Six years later, Balbir Singh moved to Amritsar where Harbail Singh, the Indian hockey team coach at the 1952 and 1956 Olympics, spotted him and thus began his hockey journey.\n\nIn Their Own Words: Excellence is not an art but a habit\n\nAs a 20-year-old, he was ‘arrested’ by the Punjab Police, not because he was involved in illegal activities but because they wanted Balbir Singh to play for them. “My father and uncle were revolutionaries, the police were loyal to the British. How could I have joined them?” he told The Times of India years later. Balbir Singh witnessed first-hand the horrors of India’s partition as the state of Punjab was divided and poverty and violence engulfed its villages. Post-independence, most of his team-mates became citizens of Pakistan overnight. He faced multiple obstacles to get to the London Olympics in 1948. The striker was not included in the original 39-man squad list as the authorities ‘forgot’ about him and made it there only on the insistence of Dickie Carr, a member of the 1932 Olympic gold medal-winning team. Once in the reckoning, Balbir Singh made it to the final 20-man Indian hockey squad for the Olympics, but inter-team dynamics saw him banished from the playing XI in the first match. Only an injury to Ronnie Rodrigues saw him take the field against Argentina and he stepped up in style with six goals in a 9-1 win. However, Balbir Singh was again axed in the third game and had almost entered the field for the semi-final before he was informed that he would not be playing. A few medical students took offence to this and their protest to the Indian high commissioner in London is what got him into the team for the Olympics final. Balbir Singh scored two more goals in the final at the Wembley Stadium, against Great Britain no less, to help the Indian hockey team secure a 4-0 victory and their fourth Olympic gold. The win, and more importantly, the pride gave him an unprecedented high. “For the first time in 1948, the tricolour was hoisted at the top of the world. As the flag was going up, I felt as if I was going up too. Then I realised, no, I am on the ground. I still remember how it felt, as if I was going up as well. I felt as if I was flying,” Balbir Singh had told ESPN.\n\nBalbir Singh in action during the hockey semi-final of the Helsinki 1952 Olympics.\n\nBalbir SIngh's Olympic final record By the time the next Olympics rolled around in 1952, Balbir Singh had become an integral part of the Indian hockey team and was named vice-captain to KD Babu for the Helsinki Olympics. He was also the flag-bearer for the Indian contingent. “Finland is the land of the midsummer nights. The first night was terrible for us; the glare in the open window would not give us sleep. We adjusted to the odd sight of the sun shining in the night by downing our shutters and darkening our rooms with heavy curtains,\" Balbir Singh wrote in his memoir, The Golden Hat Trick. A disturbed sleep cycle aside, the 1952 Olympics was where Balbir Singh was truly recognised as the heart of the Indian hockey team as he scored nine goals, including a hat-trick each in the semi-final and final. In fact, Balbir Singh’s five goals in the 6-1 win in the final against the Netherlands broke a 44-year record for most goals in an Olympic final and it still stands almost seven decades later.\n\nIn Melbourne 1956, Balbir Singh was named captain. He was not as prolific as before -- Udham Singh took the top scorer’s honours with 15 goals - but the brave forward soldiered through a fracture in his right hand to help India win the final and secure a sixth Olympic gold. It also completed India’s second hat-trick of Olympic gold medals in hockey and the first as an independent nation.\n\nBalbir Singh's love affair with hockey Balbir Singh became the first sportsperson to receive the Padma Shri, India’s fourth-highest civilian honour, in 1957 and went on to win silver at the 1958 Asian Games, only conceding the gold to Pakistan on goal difference. Though he did not play another Olympics, Balbir Singh’s love for hockey saw him take up coaching after retirement. He guided the Indian hockey team as the sport expanded beyond the Olympics. He managed the Indian hockey team to bronze in the 1971 Hockey World Cup and then was at the helm for their only Hockey World Cup win to date in 1975. In between, he also came to be known as Balbir Singh Sr. after three other Balbir Singhs were part of the bronze-winning team at the 1968 Olympics. Balbir Singh Sr. breathed his last aged 96 on 25th May 2020 but is survived by a doting family and an insatiable desire that one day Indian hockey will reclaim the lofty heights to which he once guided it."}], "Balbir Singh Kullar was elected to the Punjab Legislative Assembly in 1957.": [{"url": "https://organiser.org/2023/03/27/166591/bharat/punjab-aap-minister-balbir-singh-convicted-for-3-years-in-2022-in-assault-case-but-was-not-disqualified-by-mann-govt/", "page_content": "Punjab: On March 24, the Lok Sabha Secretariat issued the notification of former Congress MP Rahul Gandhi’s disqualification from Lok Sabha following his conviction in the ‘Modi’ surname defamation case. It is pertinent to note that u/s 8(3) of the Representation of the People Act, 1951, “a person convicted of any offence and sentenced to imprisonment for no less than two years shall be disqualified from the date of such conviction and shall continue to be disqualified for a period of six years since his release,” provides for automatic disqualification of an MP, MLA or MLC from the date of conviction when an elected representative is convicted for not less than two years.\n\nHowever, Aam Aadmi Party (AAP) MLA Dr Balbir Singh and three other persons were sentenced to 3 years of rigorous imprisonment in a 2011 assault case on May 23, 2022. However, the AAP-led Punjab Government did not disqualify him u/s 8(3) of the Representation of the People Act, 1951. Furthermore, Dr Balbir Singh was sworn in as Punjab’s Cabinet Minister for Health after Fauja Singh Sarari resigned as Cabinet Minister following his controversial audio tape discussing ways to ‘trap’ contractors for extortion surfaced on social media on January 7.\n\nThe complainant, Wing Commander Mewa Singh, is Dr Balbir Singh’s brother-in-law. The complainant alleged that Dr Balbir Singh assaulted him and his wife, Paramjit Saini, over a land dispute. The Trial Court observed that Dr Balbir Singh and other accused persons were the aggressor and said, “justification given by the respective parties for their presence at the spot, nature of injuries and medical evidence as well as the time of registration of FIR and the cross- version clearly indicate that it was the accused in the present case viz. Dr. Balbir Singh etc. who were the aggressor.”\n\nThe Trial Court held that the allegations against Dr Balbir Singh and other accused were proved beyond a reasonable doubt. Accordingly, the Trial Court convicted Dr Balbir Singh and other accused u/s 323 r/w section 34, 324, 325 and 506 r/w section 34 of the Indian Penal Code (IPC).\n\nFurthermore, the Trial Court observed that “while taking into consideration the plea of the convict and their age (convict Dr. Balbir Singh aged 66 years, convict Rupinderjit Saini aged 60 years, convict Rahul Saini aged 34 years and convict Parwinder Singh @ Parminder Singh aged 32 years) cannot lose sight of the fact that both the injured and the complainant in the present case were also aged about 68 and 60 years respectively, at the time when they were given merciless beatings by the present convict causing grievous injury to Paramjit Saini.”\n\n“Therefore, in the considered view of this Court, this is not a fit case to grant benefit of probation to the convict,” the Trial Court added while sentencing Dr Balbir Singh and the other three accused to 3 years of rigorous imprisonment.\n\nHowever, Dr Balbir Singh was not disqualified from Punjab’s Legislative Assembly after his conviction in the 2011 assault case. It is pertinent to note that Dr Balbir Singh is an MLA from the ruling party and forms part of the ruling Punjab Government.\n\nFurthermore, Dr Balbir Singh alleged that he was falsely implicated in the case and said, “I will file an appeal against the judgment.” Dr Balbir Singh and Speaker Kultar Singh Sandhwan later held a meeting with Vidhan Sabha Secretary Surinder Pal to discuss the implications of the conviction on his MLA membership, The Tribune reported.\n\nDr Balbir Singh appealed to Sessions Court against his conviction. Dr Balbir Singh’s counsel submitted to the Court that “The appellant had contested the recent assembly elections in the year 2022. There is a gap of 11 years in the date of occurrence and in the date of elections. The appellant was elected as a member of State Legislature, (Punjab) and was convicted by the learned Trial Court subsequently.”\n\nThe complainant’s counsel submitted that “it is not the first case, where the FIR has been registered against the appellant. There are other cases as well where the appellant has been cited as an accused in the FIR registered against him and said cases are pending Trial. The accused/appellant cannot seek the stay of conviction as a matter or right, as previous cases registered against him shows his character, antecedents and mental propensity.”\n\nThe Court observed that the “appellant was elected as member of State Legislature in the general elections which were conducted in February 2022. As per section 8(3) of Representation of the People Act, 1951, provides for the disqualification of the member of the Legislature in case he is convicted and sentenced to imprisonment for more than two years.”\n\nThe Court noted that “the special circumstances are attracted in this case as the disqualification of the appellant from the State Legislature would also make the people of his constituency unrepresented. In case the conviction is not stayed and the appellant is disqualified, the fresh elections would be required to be conducted for electing a representative from the assembly constituency represented by the appellant.”\n\nOn May 30, 2022, the Court stayed the Dr Balbir Singh’s conviction during the pendency of the appeal and said, “In case the conviction is not stayed, then it would also result into heavy burden on the State exchequer as the appellant would be disqualified with the present conviction and the State would be required to conduct the elections for electing a member from the said assembly constituency.”"}, {"url": "https://uca.edu/politicalscience/dadm-project/asiapacific-region/indiapunjab-1947-present/", "page_content": "Pre-Crisis Phase (August 15, 1947-February 16, 1980): Punjab (originally East Punjab) became a state within the Union of India on August 15, 1947. Dr. Gopi Chand Bhargava of the Indian National Congress (INC) formed a government as Chief Minister in the state of Punjab on August 15, 1947. Bhim Sen Sachar of the Indian National Congress (INC) formed a government as Chief Minister in the state of Punjab on April 13, 1949. Dr. Gopi Chand Bhargava of the Indian National Congress (INC) formed a second government as Chief Minister in the state of Punjab on October 18, 1949. Chief Minister\n\nGopi Chand Bhargava submitted his resignation on June 16, 1951, and the state of Punjab was placed under presidential rule by the Indian government on June 20, 1951. Elections were held in the state of Punjab from October 25, 1951 to February 21, 1952, and the Indian National Congress (INC) won 98 out of 126 seats in the Legislative Assembly. The Akali Dal (Akali Party) won 13 seats in the Legislative Assembly. Presidential rule in the state of Punjab ended on April 17, 1952, and Bhim Sen Sachar of the Indian National Congress (INC) formed a second government as Chief Minister in the state of Punjab. Chief Minister Bhim Sen Sachar submitted his resignation on January 7, 1956. Pratap Singh Kairon of the Indian National Congress (INC) formed a government as Chief Minister in the state of Punjab on January 23, 1956. Elections were held in the state of Punjab in March 1957, and the Indian National Congress (INC) won 120 out of 154 seats in the Legislative Assembly. Elections were held in the state of Punjab on February 24, 1962, and the Indian National Congress (INC) won 90 out of 154 seats in the Legislative Assembly. The Akali Dal (Akali Party) won 19 seats in the Legislative Assembly. Chief Minister Pratap Singh Kairon was formed to resign by the Indian government on June 21, 1964. Ram Kishan of the Indian National Congress (INC) was elected as Chief Minister in the state of Punjab on July 7, 1964. The state of Punjab was placed under presidential rule by the state of Punjab on July 5, 1966. The state of Punjab was formally reorganized by the Indian government on November 1, 1966, resulting in the new state of Punjab with a Sikh majority. Giani Gurmukh Singh Mussafir was elected as the Chief Minister of the state of Punjab on November 1, 1966. Elections were held in the state of Punjab on February 19, 1967, and the Indian National Congress (INC) won 47 out of 104 seats in the Legislative Assembly. The Akali Dal (Akali Party) won 26 seats in the Legislative Assembly. Gurnam Singh, representing the United Front (including the Akali Dal and the Communist Party of India), was elected as Chief Minister of the state of Punjab on March 8, 1967.\n\nFollowing defections from the United Front, the government of Chief Minister Gurnam Singh resigned on November 22, 1967. With the support of the Indian National Congress (INC), Lachhman Singh Gill of the United Front formed a government as Chief Minister of the state of Punjab on November 25, 1967. After the Indian National Congress (INC) withdrew its support for the government of Chief Minister Lachhman Singh Gill on August 20, 1968, the state of Punjab was placed under presidential rule by the Indian government on August 23, 1968. Elections were held in the state of Punjab on February 9, 1969, and the Shiromani Akali Dal (Supreme Akali Party) won 43 out of 104 seats (56% of the vote) in the Legislative Assembly. The Indian National Congress (INC) won 38 seats in the Legislative Assembly. Gurnam Singh of the Shiromani Akali Dal (Supreme Akali Party) formed a coalition government as Chief Minister of the state of Punjab on February 17, 1969. Chief Minister Gurnam Singh resigned on March 27, 1970, and Parkash Singh Badal of the Shiromani Akali Dal (Supreme Akali Party) formed a coalition government as Chief Minister. Chief Minister Parkash Singh Badal resigned, and the state of Punjab was placed under presidential rule by the Indian government on June 15, 1971. Elections were held in the state of Punjab on March 11, 1972, and the Indian National Congress (INC) won 66 out of 104 seats (45% of the vote) in the Legislative Assembly. The Shiromani Akali Dal (Supreme Akali Party) won 24 seats in the Legislative Assembly. Giani Zail Singh of the INC formed a government as Chief Minister on March 17, 1972. The Akali Dal (Akali Party) demanded autonomy for the state of Punjab on October 17, 1973. The National Council of Khalistan (NCK) headed by Jagjit Singh Chauhan was established in the state of Punjab in December 1972. The state of Punjab was placed under presidential rule on April 30, 1977. Elections were held in the state of Punjab on June 12, 1977, and the Shiromani Akali Dal (Supreme Akali Party) won 58 out of 104 seats (55% of the vote) in the Legislative Assembly. The Janata Party (JP) won 25 seats in the Legislative Assembly. Parkash Singh Badal of the Shiromani Akali Dal (Supreme Akali Party) formed a coalition government as Chief Minister on June 20, 1977. Some 13 Sikh demonstrators were killed in the state of Punjab on April 13, 1978.\n\nCrisis Phase (February 17, 1980-February 28, 1993): The Legislative Assembly of the state of Punjab was dissolved and the state of Punjab was placed under presidential rule by the Indian government on February 17, 1980. Elections were held in the state of Punjab on May 30, 1980, and the Indian National Congress (INC) won 63 out of 117 seats in the Legislative Assembly. The Shiromani Akali Dal (Supreme Akali Party) won 37 seats on the Legislative Assembly. Darbara Singh of the INC formed a government as Chief Minister on June 6, 1980. Lala Jagat Narrain, a Hindu journalist and publisher, was assassinated in the city of Ludhiana in the state of Punjab on September 9, 1981. Sant Jarnail Singh Bhindranwale, a Sikh leader, surrendered to government police on September 20, 1981. Following more than three weeks of riots, Sant Jarnail Singh Bhindranwale was released from detention on October 15, 1981. Hindus and Sikhs clashed in the city of Amritsar on April 27, 1982. On May 1, 1982, the Indian government broke off negotiations with Akali Dal, a Sikh youth group, and banned Dal Khalsa, National Council of Khalistan (NCK), and several other Sikh organizations. Giani Zail Singh, former Chief Minister of the state of Punjab, was elected president of India by the parliament on July 15, 1982. On August 4, 1982, Akali Dal launched a civil disobedience campaign, resulting in the arrests of some 36,000 individuals in the following two months. Sikh militants led by Sant Jarnail Singh Bhindranwale launched an insurgency in the state of Punjab beginning in September 1982. Sikhs militants attacked the Indian parliament on October 11, 1982, resulting in the deaths of four individuals. Balbir Singh Sandu, leader of the NCK, announced the beginning of the Sikh rebellion against the government on April 28, 1983. Some 219 individuals were killed in a Sikh terrorist incident in Dilwan on October 6, 1983. The Indian government declared a state-of-emergency and presidential rule in the state of Punjab on October 10, 1983. The government banned the militant Sikh youth group (Akali Dal) on March 19, 1984. Sikh militants killed Ramesh Chandler, a Hindu newspaper editor, on May 12, 1984. Eleven Sikhs were killed by government troops in the Golden Temple in Amritsar in the state of Punjab on June 1, 1984, and government troops were deployed in Amritsar on June 2, 1984. Government troops attacked and overran the Golden Temple on June 3-10, 1984. Some 433 Sikh militants, including Sant Jarnail Singh Bhindranwale, and 83 government troops were killed in Operation Bluestar. Some 492 civilians were also killed in Operation Bluestar. On June 13, 1984, the government accused Pakistan of training Sikh extremists in the state of Punjab. Eight bus passengers were killed by Sikh militants in Batala on September 12, 1984. Government troops completed their withdrawal from the Golden Temple on September 29, 1984. Prime Minister Indira Gandhi ordered the closure of the border between the state of Punjab and Pakistan on October 16, 1984. Prime Minister Indira Gandhi was assassinated by two Sikh security observers in New Delhi on October 31, 1984, and some 3,000 Sikhs were killed in violence in Delhi and other cities following the assassination. Some 100,000 Sikhs fled as refugees from Delhi to the state of Punjab. The Indian government and moderate Sikhs led by Sant Harchand Singh Longowal signed an 11-point peace agreement on July 24, 1985, but Sant Harchand Singh Longowal was assassinated by Sikh extremists on August 20, 1985. Elections were held in the state of Punjab on September 25, 1985, and the Shiromani Akali Dal (Supreme Akali Party) won 73 out of 117 seats in the Legislative Assembly. The Indian National Congress (INC) won 32 seats in the Legislative Assembly. Surjit Singh Barnala of the Shiromani Akali Dal (Supreme Akali Party) formed a government as Chief Minister on September 29, 1985. The Indian government lifted the state-of-emergency and presidential rule in the state of Punjab on September 29, 1985. On January 22, 1986, three Sikhs were sentenced to death for their involvement in the assassination of Prime Minister Indira Gandhi. Sikh militants killed 20 laborers in Mallian in Jalandhar District on March 29, 1986. Sikh militants killed six government policemen on April 6, 1986. Khalistan Liberation Force (KLF) militants killed 22 bus passengers in Khudda on November 30, 1986. Chief Minister Surjit Singh Barnala of the state of Punjab was removed from office by the Indian government on May 11, 1987, and the state of Punjab was placed under presidential rule by the Indian government on June 11, 1987. Members of the Khalistan Commando Force (KCF) killed 34 Hindus in northeast Punjab state on March 3, 1988, and KCF rebels killed another 17 individuals in the state of Punjab on March 29, 1988. Government troops launched a military offensive (Operation Black Thunder) against KCF rebels in Amritsar in May 1988, resulting in the deaths of some 40 rebels. Sikh militants killed some 80 individuals, mostly Hindus, in Ludhiana District in the state of Punjab on June 15, 1991. The Indian government deployed 120,000 government troops in the state of Punjab in November 1991. Sikh militants killed 49 individuals, mostly Hindus, on a passenger train in the village of Sohian in the state of Punjab on December 27, 1991. Some 5,000 individuals, including 3,300 civilians, were killed in violence in the state of Punjab in 1991. Elections were held in the state of Punjab on February 19, 1992, and the Indian National Congress (INC) won 87 out of 117 seats in the Legislative Assembly. The Bahujan Samaj Party (BSP) won nine seats in the Legislative Assembly. The Shiromani Akali Dal (Supreme Akali Party) boycotted the elections. Presidential rule was ended in the state of Punjab, and Beant Singh of the Indian National Congress (INC) formed a government as Chief Minister on February 25, 1992. Gurbachan Singh Manochahal, the leader of the Bhindranwale Tiger Force for Khalistan, was killed by government police in the village of Rattaul on February 28, 1993. Some 25,000 individuals were killed, and some 100,000 individuals were displaced during the crisis.\n\nPost-Crisis Phase (March 1, 1993-present): Chief Minister Beant Singh was assassinated by a Sikh militant in Chandigarh, and Harcharan Singh Brar of the Indian National Congress (INC) formed a government as Chief Minister on August 31, 1995. Rajinder Kaur Bhattal of the Indian National Congress (INC) formed a government as Chief Minister on January 21, 1996. Elections were held in the state of Punjab in February 1997, and the Shiromani Akali Dal (Supreme Akali Party) won 75 out of 117 seats in the Legislative Assembly. The Bhartiya Janta Party (BJP) won 18 seats in the Legislative Assembly. Parkash Singh Badal of the Shiromani Akali Dal (Supreme Akali Party) formed a government as Chief Minister on February 12, 1997. Government police arrested Wassan Singh Zaffarwal, leader of thew Khalistan Commando Force (KCF), in Amritsar on April 12, 2001. Two individuals were killed in a bus bombing in Hoshiapur District in the state of Punjab on January 31, 2002. Elections were held in the state of Punjab on February 13, 2002, and the Indian National Congress (INC) won 62 out of 117 seats in the Legislative Assembly. The Shiromani Akali Dal (Supreme Akali Party) won 41 seats in the Legislative Assembly. Amarinder Singh of the Indian National Congress (INC) formed a government as Chief Minister on February 26, 2002. Three individuals were killed in a train bombing near the town of Doraha in the state of Punjab on March 14, 2002. Manmohan Singh, a Sikh from the state of Punjab, was sworn in as Indian prime minister on May 22, 2004. Elections were held in the state of Punjab on February 11, 2007, and the Shiromani Akali Dal (Supreme Akali Party) won 48 out of 116 seats in the Legislative Assembly. The Indian National Congress (INC) won 44 seats in the Legislative Assembly. Parkash Singh Badal of the Shiromani Akali Dal (Supreme Akali Party) formed a government as Chief Minister on March 1, 2007. Jagjit Singh Chauhan, a Sikh separatist leader, died in the village of Tanda in Hoshiarpur District on April 4, 2007. Elections were held in the state of Punjab on January 30, 2012, and the Shiromani Akali Dal (Supreme Akali Party) won 56 out of 117 seats in the Legislative Assembly. The Indian National Congress (INC) won 46 seats in the Legislative Assembly. Parkash Singh Badal of the Shiromani Akali Dal (Supreme Akali Party) formed a government as Chief Minister on March 6, 2012.\n\n[Sources: Arnold et al., 1991, 133-136, 139-143; Associated Press (AP), February 28, 1993; Banks and Muller, 1998, 409-422; British Broadcasting Corporation (BBC), April 12, 2001, January 31, 2002, February 12, 2002, February 13, 2002, March 14, 2002, May 22, 2004, November 11, 2004; March 16, 2005, April 4, 2012; Brogan, 1992, 193-198; Christian Science Monitor (CSM), June 12, 1984; Degenhardt, 1988, 152-154; India Today, March 12, 2007; Jessup, 1998, 301-307; New York Times (NYT), June 16, 1991, December 27, 1991, October 26, 1993.]\n\nSelected Bibliography\n\nFair, C. Christian. 2009. “Lessons from India’s Experience in the Punjab, 1978-1993, In Sumit Ganguly and David P. Fidler, editors. India and Counterinsurgency: Lessons Learned. London and New York: Routledge, pp. 107-126.\n\nSingh, Gopal. “Socio-Economic Bases of the Punjab Crisis,” Economic and Political Weekly, January 7, 1984, pp.42-47."}, {"url": "https://wiki2.org/en/Balbir_Singh_Kular", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nIndian field hockey player\n\nColonel Balbir Singh Kular, VSM (born 5 April 1945) is an Indian field hockey player (half-back). He is also known as Balbir Singh Kullar/Khullar, or simply as Balbir Singh.[2]\n\nBalbir Singh was born in the Sansarpur village of the Jalandhar district, and later settled in the Jalandhar city. As part of the Indian Universities Hockey Team, he played in Afghanistan in 1962. In 1964, he represented the Punjab state in the National Hockey Championship at Delhi.\n\nIn 1965, Balbir Singh joined the Indian Army and later, rose to the rank of Colonel. As a member of the national hockey team, he toured Europe (1966–1968), Japan (1966), Kenya (1967) and Uganda (1968).\n\nBalbir Singh was part of the India hockey teams that won the Asian Games Gold in 1966 and the Olympic Bronze in 1968.[3] He scored three goals in the 1968 Olympics.\n\nDuring 1965–1974, Balbir Singh represented the Services team in the National Hockey Championship of India. He was the captain of the Services team that won the Bombay Gold Cup in 1971.\n\nBalbir Singh retired from active play in the 1970s due to knee problems. He coached the ASC hockey team during 1970–1980. He then coached the Central Zone team (1981), the Indian men's hockey team (1982) and the women's hockey team (1995–98). With him as the coach in 1982, the Indian men's team won Bronze at the Champions Trophy in Amsterdam, Silver at the Asian Games in Delhi and Silver at the 1982 Esanda World Hockey Championship in Melbourne. He also served as a selector for the Indian national hockey team from March 1987 to July 1987, and as its manager for during the Indo-Pan American Hockey Championship (Chandigarh) in 1995.\n\nBalbir Singh later served as the president of Sansarpur Hockey Association. His autobiography Sansarpur to London Olympics was launched by the Indian Army General V K Singh in 2012.[4]\n\nAwards and recognition\n\nVishisht Seva Medal\n\nArjuna Award (1968); as \"Cadet Balbir Singh\"\n\nChief of Army Staff Commendation Card\n\nLifetime Achievement award (1999)\n\nBalbir Singh was one of the four players to be featured on the special commemorative stamp released on 31 December 1966 by India Post, as a tribute to the Gold medal win at the 1966 Asian Games; the other three were Vinood Kumar, John Victor Peter and Mukhbain Singh.[5]\n\nReferences"}, {"url": "https://www.britannica.com/biography/Parkash-Singh-Badal", "page_content": "Parkash Singh Badal, original name Parkash Singh Dhillon, (born December 8, 1927, near Faridkot, India), Indian politician and government official who rose to become president (1996–2008) of the Shiromani Akali Dal (SAD), a Sikh-focused regional political party in Punjab state, northwestern India. He also served five terms as the chief minister (head of government) of Punjab (1970–71, 1977–80, 1997–2002, 2007–12, and 2012–17).\n\nBadal was born into a family of landowning farmers in what is now western Punjab state and earned a B.A. degree from Forman Christian College in Lahore (now in Pakistan). His first foray into politics was in 1947 when he was elected the leader in his village. In 1957 he was elected to the Punjab legislative assembly as a member of the Indian National Congress (Congress Party). He left the party a few years later over differences with the chief minister of Punjab and joined the SAD.\n\nBadal left office after he was defeated in the 1967 state assembly elections, but he returned after winning in 1969 and joined the state’s SAD-led government. A year later he was named the chief minister. His term lasted for only a year, however, as the party was beset by infighting and the government was dissolved by and transferred to the central authorities in New Delhi.\n\nBadal was reelected to the Punjab legislative assembly repeatedly from 1969 until 2012—the only exception being in 1992, when the SAD boycotted state elections—although there were periods during those years when he was out of office because the state was under the rule of New Delhi. In addition, Badal was imprisoned at various times, including a stretch during the 1975–77 emergency that had been decreed by Prime Minister Indira Gandhi. In early 1977 he was elected to the Lok Sabha (lower chamber of the parliament) and was tapped to serve in the administration of Prime Minister Morarji Desai. Badal’s tenure in national office was brief, however, as the SAD insisted that he return to Punjab state politics. Shortly thereafter he began his second term as chief minister.\n\nMore jail time followed in the 1980s during the period of Sikh agitation for greater autonomy. Badal was arrested in conjunction with protests against a plan to divert river water from Punjab to neighbouring Haryana state. Another time he tore pages of the constitution of India during a protest event, though he later made an apology for having done that. He won back his seat in the 1985 state assembly elections, which were dominated by the SAD, but one of his fellow party members, Surjit Singh Barnala, was named chief minister.\n\nBadal maintained a relatively low public profile politically during another period of central-government rule (1987–92) and after the SAD boycott of the 1992 state assembly elections. He remained one of the top officials of the party, however, and in 1996 he was elected party president. The following year the SAD secured a large majority of seats in state assembly elections, and Badal was chosen for the third time to be chief minister. He served out his full five-year term for the first time, but after the party lost to the Congress Party in the 2002 assembly elections, he left office.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nFor the 2007 state elections, the SAD allied itself with the Bharatiya Janata Party and won a comfortable majority of assembly seats; Badal was again named chief minister and once more served his full term. The two parties remained allied for the 2012 assembly polls and again secured a majority. Badal, retaining his post, became the first person to serve two consecutive terms as chief minister in Punjab. He also became the country’s oldest chief minister—this after having been the youngest in that post when in 1970 he took office for the first time. In 2008, however, he had stepped down from the party presidency and had been succeeded by his son, Sukhbir Singh Badal. During the 2012 campaign, the senior Badal announced that it would be his final election.\n\nThroughout his long political career, Badal was seen as a moderate, even-tempered, and liberal leader, and both his public life and his private life had been generally noncontroversial. In 2003, however, corruption charges were filed against him and his family. They were finally acquitted of the charges in 2010."}, {"url": "https://punjabassembly.nic.in/index.php/ministers/knowyourminister/22", "page_content": "Elected to the Punjab Vidhan Sabha in 2007, 2012 and now again in 2017. Remained President, District Congress Committee, Member of Committee on Government Assurances, Questions and References, Estimate Committee and Committee on Welfare of SCs, STs and BCs of Punjab Vidhan Sabha. Helped under privileged people and working for the overall development of the constituency. Presently, Cabinet Minister, Animal Husbandry, Dairy Development and Labour, Government of Punjab.\n\nELECTION RESULT\n\nTotal Electors: 209473\n\nVotes Polled: 139664"}, {"url": "https://alchetron.com/Balbir-Singh-Kullar", "page_content": "Balbir Singh Kular (born 8 August 1942) is an Indian field hockey player and a Punjab Police officer. Alternative spellings of his last name include Kullar and Khullar.\n\nBalbir Singh was born in the Sansarpur village of the Jalandhar district. He was the captain of the All India Schools during 1957–1960, and also played as part of the Combined University Team. At the national-level, he represented the hockey teams of Punjab State, Indian Railways and Punjab Police. For a brief time, he also played for the little-known hockey team of Mohun Bagan. Balbir Singh joined the Punjab Armed Police in 1962, and became an Assistant Sub-Inspector of the Punjab Police in 1963.\n\nAs part of the Indian national men's hockey team, he played his first international game in 1963 at Lyons in France. He gained reputation as an inside forward in the Indian team, and toured Belgium, East Africa, East Germany, England, the Netherlands, Italy, Kenya, New Zealand and West Germany. He was a member of the Indian team that won the Asian Games Gold in 1966 (Bangkok) and the Olympic Bronze in 1968 (Mexico).\n\nDuring 1968–1975, Balbir Singh was a part of the All India Police team, and also served as its captain for some time. He became the Deputy Superintendent of Police in 1981, became an Indian Police Service officer in 1987. He retired as a Deputy Inspector General (DIG) in February 2001."}, {"url": "https://www.jagranjosh.com/current-affairs/olympic-bronze-medalist-balbir-singh-kullar-passes-away-1583134441-1", "page_content": "Balbir Singh Kullar, former Indian hockey player and Olympic Bronze medalist passed away on February 28, 2020 after suffering a cardiac arrest at his residence in Punjab. He was 77.\n\nHockey India condoled Balbir Singh Kullar’s passing with a tweet that read, “We are deeply saddened by the demise of our former hockey player and Olympic medallist, Balbir Singh Kullar.”\n\nHe is survived by his wife Manjeet Kaur, son and two daughters. His cremation will be carried out today, March 2.\n\nWho is Balbir Singh Kullar?\n\n• Born in Jalandhar, Punjab on August 8, 1942, Balbir Singh Kullar is a former Indian hockey player and Punjab Police officer.\n\n• He made his international debut in the Indian national Hockey team in 1963 in Lyon, France. He became renowned as an inside forward in the Indian team. He toured several nations including the Netherlands, West Germany, Belgium, England and New Zealand.\n\n• He was a part of the Indian team that won the Olympic Bronze medal in 1968 in Mexico and the Asian Games gold in 1966 at Bangkok.\n\n• He had later served as a national team selector for the Indian national hockey team.\n\n• Balbir Singh Kullar’s stint with hockey began at school level itself when he captained the All India Schools during 1957–1960 and also played for the Combined University Team.\n\n• He also represented the hockey teams of Punjab, Indian Railways and Punjab Police at the national level.\n\n• He joined the Punjab Armed Police in 1962 and was appointed as an Assistant Sub-Inspector of the Punjab Police in 1963.\n\n• He was appointed as the Deputy Superintendent of Police in 1981 and became an Indian Police Service officer in 1987.\n\n• He retired from Police service as the Deputy Inspector General (DIG) in February 2001.\n\nAwards\n\nBalbir Singh Kullar was awarded the fourth highest civilian honour, Padma Shri in 2009.\n\nHe was honoured with the Arjuna Award in 1999 to recognize his outstanding achievement in hockey."}, {"url": "https://www.tribuneindia.com/news/punjab/1968-olympic-medallist-balbir-singh-passes-away-at-77-49567", "page_content": "Chandigarh, March 1\n\nBalbir Singh Kullar, Olympics and Asian Games medallist with the Indian hockey team, has passed away at the age of 77. Known as ‘Balbir Singh (Punjab)’ to distinguish him from his two namesakes in the India team, Kullar was a member of the Indian team that won gold in the 1966 Asian Games and bronze in the 1968 Olympics.\n\nHe succumbed to a heart attack at his home on Friday. Kullar is survived by his wife, a son and two daughters.\n\nKullar, who hailed from the famous hockey village of Sansarpur in Jalandhar district, made his India debut in 1963 in France. Playing in the forward-line as a right-in, Kullar was part of a relatively young Indian team that won the 1966 Asian Games title in Bangkok. India beat Pakistan 1-0 in the final. At the 1968 Olympic Games in Mexico City, Kullar played in the bronze medal match, which India won 2-1 against West Germany.\n\nKullar, who also served as a national team selector, retired as a Deputy Inspector General (DIG) in the Punjab Police. He received the Arjuna Award in 1999 and the Padma Shri in 2009.\n\n“We are deeply saddened by the demise of our former hockey player and... Olympic medallist, Balbir Singh Kullar,” Hockey India said on its official Twitter handle. “Our thoughts and prayers are with Mr Balbir Singh Kullar’s family and friends at this time of grief.”\n\nAthletics coach Saini dead\n\nJoginder Singh Saini, who groomed some of India’s finest track and field stars right from the 1960s, died on Sunday in Patiala. He was 90. Saini, the chief national athletics coach from the 1970s to 1990s, was not keeping well for the past few days.\n\n“I am truly sad to hear of the passing away of our colleague, my chief coach and mentor, Mr JS Saini,” said former athlete Adille Sumariwalla, the Athletics Federation of India president. “He was my friend, philosopher and guide and helped me immensely in my role as AFI president with his sound advice.” — TNS"}, {"url": "https://alchetron.com/Balbir-Singh-Kular", "page_content": "\n\n\n\nColonel Balbir Singh Kular (VSM, born 5 April 1945) is an Indian field hockey player (half-back). He is also known as Balbir Singh Kullar/Khullar, or simply as Balbir Singh.\n\nBalbir Singh was born in the Sansarpur village of the Jalandhar district, and later settled in the Jalandhar city. As part of the Indian Universities Hockey Team, he played in Afghanistan in 1962. In 1964, he represented the Punjab state in the National Hockey Championship at Delhi.\n\nIn 1965, Balbir Singh joined the Indian Army and later, rose to the rank of Colonel. As a member of the national hockey team, he toured Europe (1966–1968), Japan (1966), Kenya (1967) and Uganda (1968).\n\nBalbir Singh was part of the India hockey teams that won the Asian Games Gold in 1966 and the Olympic Bronze in 1968. He scored three goals in the 1968 Olympics.\n\nDuring 1965–1974, Balbir Singh represented the Services team in the National Hockey Championship of India. He was the captain of the Services team that won the Bombay Gold Cup in 1971.\n\nBalbir Singh retired from active play in the 1970s due to knee problems. He coached the ASC hockey team during 1970–1980. He then coached the Central Zone team (1981), the Indian men's hockey team (1982) and the women's hockey team (1995–98). With him as the coach in 1982, the Indian men's team won Bronze at the Champions Trophy in Amsterdam, Silver at the Asian Games in Delhi and Silver at the 1982 Esanda World Hockey Championship in Melbourne. He also served as a selector for the Indian national hockey team from March 1987 to July 1987, and as its manager for during the Indo-Pan American Hockey Championship (Chandigarh) in 1995.\n\nBalbir Singh later served as the President of Sansarpur Hockey Association. His autobiography Sansarpur to London Olympics was launched by the Indian Army General V K Singh in 2012."}, {"url": "https://www.ndtv.com/india-news/bjp-fields-former-congress-leader-for-lok-sabha-by-polls-in-punjab-3042038", "page_content": "Mr Dhillon was a member of the Punjab Legislative Assembly (2012-17) for the constituency of Barnala.\n\nThe Bharatiya Janata Party on Monday fielded former Congress leader Kewal Singh Dhillon as its candidate for Lok Sabha by-elections in Punjab's Sangrur.\n\nAAP has fielded Gurmail Singh from the seat.\n\nThe seat fell vacant after Bhagwant Mann won the assembly election from the Dhuri constituency in the Sangrur district.\n\nIn the recently concluded Punjab Assembly elections, Mr Dhillon contested as a Congress candidate against AAP's Bhagwant Mann. He had secured 3,03,350 votes.\n\nA loyalist of former Punjab Chief Minister Captain Amarinder Singh, Mr Dhillon was a member of the Punjab Legislative Assembly (2012-17) for the constituency of Barnala.\n\nNotably, Mr Dhillon was among the eight leaders the security cover of whom was revoked by the Aam Admi Party government on May 11, citing \"no specific threat\".\n\nMr Dhillon joined the BJP on June 4 with six others.\n\nApart from Mr Dhillon, former ministers Raj Kumar Verka, Balbir Singh Sidhu, Gurpreet Singh Kangar, and Sundar Sham Arora were among the seven Congress leaders who joined the BJP on June 4. Congress leader Kamaljeet S Dhillon and the sitting Mayor of Congress in Mohali, Amarjeet S Sidhu also joined the BJP then.\n\nToday is the last day for the candidates to file nominations for the bye-election. The filing of nominations began on May 30, the scrutiny of nominations would be done on June 7 and the last date of withdrawal of candidature is June 9. The polling will take place on June 26.\n\nThe Aam Aadmi Party (AAP) registered a landslide victory in the Punjab polls with 92 seats, pushing most of its rivals to the margins. Congress won 18 seats in the 117-member Assembly.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}]}