{"George Bovell III has won three Olympic medals.": [{"url": "https://olympics.com/en/athletes/george-bovell-iii", "page_content": "Year of Birth\n\nYear of Birth 1983\n\nFirst Olympic Games\n\nFirst Olympic Games Sydney 2000\n\nTrinidad and Tobago\n\nTeam Trinidad and Tobago"}, {"url": "https://www.ttoc.org/index.php/latest-news/3166-bovell-iii-lands-3rd-50m-free-gold", "page_content": "T&T’s George Bovell swam to his third gold medal in his sixth men’s 50-metre freestyle final, making it his fifth in 12 finals, strengthening his claim for the US$100,000 winners prize, on the final night of eighth leg of the FINA/Arena Swimming Short Course World Cup. This was at the National Aquatic Centre, Beijing, China, yesterday.\n\nA silver medallist in the 100-metre individual medley on Thursday night, the 29-year-old Bovell, a four-time Olympian, went one better in the 50m freestyle splash when he raced home in 20.98 seconds from lane four, his fourth straight sub-21 clocking to take gold and the US$1,500 winners prize to up his World Cup earnings to US$14,500.\n\nHis main rival, USA’s 2000 Olympic champion, Anthony Ervin and winner of the three other 50m freestyle finals, got silver from lane three in 21.19 while Australian Cameron Mc Evoy took bronze in 21.46 from lane five.\n\nSpeaking after his win, the T&T swimmer said, “I fought back tonight (yesterday) with another sub-21 effort to win the 50m free. The American Anthony Ervin wasn’t able to match my speed as I answered his challenge from Berlin.\n\nThe score of the rivalry now stands at 3-3 with two stops to go. “It wasn’t quite as fast as I had been in Stockholm as there were a few minor errors but anytime I can swim below 21, I will take it and be thankful. It’s not easy, but my consistency is paying off here”, said Bovell III.\n\nThe 2004 Athens Greece bronze medallist now has 12 medals (five gold, seven silver). He also won gold in the 50m freestyle in Sweden (20.82), a new national record and Moscow (20.90) in back-to-back meets while his other sub-21 clocking came in Berlin last month, 20.97, in a silver swim.\n\nHis time of 20.82 also puts him as the second fastest swimmer in the 50m freestyle behind 2008 Olympic champion, Brazilian Cesar Cielo. The other finishers in the gold medal splash were Finland’s Ari-Pekka Liukkonen (21.63), Aussie duo Kyle Richardson (21.73) and Tomasso D’Orgogna (21.80), and Chinese swimmers, Zhiwu Lu (22.00) and Yang Shi (22.16).\n\nEarlier on in the morning heats, the USA-based top T&T swimmer and seventh placed finisher in the men’s 50m freestyle final at the London Olympic Games, won the fifth and final heat 21.55 ahead of Mc Evoy (21.57), D’Orgogna (21.71), Chinese Taipei’s Kuo-Chi Chang (22.43), China’s Tengfei Shi (22.55), Russian, Viacheslav Prudnikov (22.92) and home town duo, Zhaochen Liu (23.09) and Enjian Zhang (23.33).\n\nBovell III’s time was also the top qualifier for the finals ahead of Mc Evoy while D’Orgogna has the fourth fastest time. Ervin won heat three in 21.68 for the third best time while Richardson was second in the heat in 21.80 and fifth best overall, and Shi, third in 22.22 for the eight and final top qualifying time. Liukkonen (21.83) and Lu (22.10) were the top two swimmers from heat three.\n\nPrior to the meet in China, Bovell had 92 points to trail To (110) while Japan’s Daiya Seto was next with 81 and with his gold and silver swim, the T&T swimmer was expected to close the gap at the top even more with two more legs to come in Tokyo, Japan, on Tuesday and Wednesday followed by Singapore on Saturday and Sunday, after which the top ranked swimmer will get US$100,000, second US$50,000 and third, US$30,000.\n\nBy Nigel Simon\n\nSource: www.guardian.co.tt"}, {"url": "https://peoplepill.com/people/george-bovell/", "page_content": "George Richard Lytcott Bovell (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago. Bovell is also a two-time World Championship bronze medalist, a record five-time Olympian and is the Caribbean region's most successful swimmer.\n\nBovell is also respected for his voluntary philanthropic initiatives such as \"The World Swim Against Malaria and Drowning\" in Uganda, 2013, with his friend, Ugandan swimmer, Max Kanyarezi. He is known for organizing and conducting the annual \"George Bovell Dive In Free Swim Clinics\", that are free for the youth of Trinidad and Tobago who enjoy the privilege of being coached and mentored by renowned Olympic Medalist Swimmers from around the world. Bovell has been the writer of the popular inspirational newspaper column in the Trinidad Guardian entitled \"Reflections Off The Water\". He is also one of the World Economic Forum's Global Shapers from the Port of Spain hub. In addition to being a swimmer, Bovell is also a renowned freediving specialist, and enjoys under water wildlife videography and spearfishing.\n\nOlympic career\n\nGeorge Bovell represented Trinidad and Tobago at the 2000, 2004, 2008, 2012, and 2016 Olympics. At the 2004 Olympics, he won a bronze medal in the men's 200 IM: the 9th medalist in the country's history and 12th medal overall. It was also the first-ever Olympic swimming medal for the country, and T&T's only medal from the 2004 Olympics. Bovell also made it to the Finals of the 50m Freestyle in London where he placed 7th in the fastest field ever assembled after returning from a forced hiatus due to a brain injury earlier in the season. Bovell carried the T&T flag at the opening ceremony of the Beijing Olympics in 2008, the 20th Central American and Caribbean Games in Cartagena, Colombia and in the closing ceremonies of the 2000, 2004 and 2012 Olympic Games.\n\nWorld Championships\n\nIn 2013 Bovell won the Bronze Medal in the 50m freestyle at the FINA World Long Course Championships in Barcelona against the fastest field ever assembled in the sport, one in which every competitor in the final was an Olympic Medalist. His Bronze Medal time of 21.51 seconds would have won the silver in the London Olympic Final a year earlier.\n\nIn 2012 Bovell won the Bronze Medal in the 100m Individual Medley at the Fina World Short Course Championships in Istanbul, a testament to his versatility.\n\nBovell has been in 10 World Championship finals since his first in 2001.\n\nSwimming Career Highlights\n\nOlympic Bronze Medallist\n\nFormer World Record Holder\n\nTwo-time World Championship Bronze Medallist\n\nSix-time Pan Am Games Medallist (2 Gold, 2 Silver, 2 Bronze)\n\nTen-time World Championship Finalist\n\n2nd Place Overall in the 2012 FINA World Cup (7 gold, 9 silver)\n\nFive-time Individual NCAA Champion\n\nEight-time Individual SEC Champion\n\nCaribbean and Central American Champion of three consecutive games and record holder, also 3 silver, 2 bronze\n\nFormer NCAA Record Holder\n\nMost All American Honours in Auburn History with 25\n\nMultiple Caribbean and Central American record holder\n\nFour-time NCAA Team Champion\n\nUndefeated in NCAA team Division 1 swimming career\n\nTrinidad and Tobago National Awards\n\nChaconia Gold\n\nHumming Bird Gold\n\nTrinidad and Tobago Sportsman Of The Year 2004 & 2014\n\nTTOC Athlete of the year\n\n2012 CCN TV6 Viewers Choice Sports Personality of the Year\n\n2013 Trinidad Express Personality of the Year\n\n2014 CCN TV6 Viewers Choice Sports Personality of the Year\n\n2014 Trinidad Guardian Sportsman of the Year\n\n2014 Trinidad Tobago Olympic Committee Sports Personality of the Year\n\nMain Events\n\nYear Event Race Position 2000 Summer Olympics 50m Freestyle Heats 2000 Summer Olympics 200m Ind Medley Heats 2000 Summer Olympics 400m Ind Medley Heats 2001 World Championship 200m Freestyle Heats 2001 World Championship 200m Ind Medley Finals 4th 2001 World Championship 400m Ind Medley Heats 2002 Short Course World Championship 200m Freestyle Semifinal 2002 Short Course World Championship 100m Ind Medley Semifinal 2002 Short Course World Championship 200m Ind Medley 7° 2003 World Championship 200m Freestyle Semifinal 2003 World Championship 200m Ind Medley 5° 2004 Summer Olympics 100m Freestyle Semifinal 2004 Summer Olympics 200m Freestyle Semifinal 2004 Summer Olympics 200m Ind Medley 03 ! 2006 Pan Pacific Championship 50m Freestyle 8° 2006 Pan Pacific Championship 100m Freestyle B Final 2007 World Championship 50m Freestyle Heats 2007 World Championship 100m Freestyle Heats 2008 Summer Olympics 50m Freestyle Semifinal 2008 Summer Olympics 100m Freestyle Heats 2008 Short Course World Championship 50m Freestyle Semifinal 2008 Short Course World Championship 100m Ind Medley 8° 2009 World Championship 50m Freestyle Finals 7th 2009 World Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Freestyle B Final 2010 Pan Pacific Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Backstroke B Final 2010 Short Course World Championship 50m Freestyle Semifinal 2010 Short Course World Championship 100m Ind Medley 4° 2011 World Championship 50m Freestyle 7° 2012 Summer Olympics 50m Freestyle 7° 2012 Summer Olympics 100m Backstroke Heats 2012 Short Course World Championship 50m Freestyle 4° 2012 Short Course World Championship 100m Ind Medley 03 ! 2013 World Championship 50m Freestyle 03 !\n\nBest Times"}, {"url": "https://www.nalis.gov.tt/Resources/Subject-Guide/Olympic-Games", "page_content": "SYMBOLS OF THE OLYMPIC GAMES\n\nTHE OLYMPIC RINGS\n\nThe Olympic rings were designed by Baron Pierre de Coubertin. They comprise five intertwined rings in the colors blue, yellow, black, green, and red, set upon a white background. These intertwined rings represent the unity of the five continents. The rings were introduced at the Antwerp Games in 1920.\n\nThe rings are also featured on the Olympic flag which is hoisted at the start of each celebration of the Olympics. The flag is three meters long and two meters wide.\n\nTHE OLYMPIC CREED\n\nThe Olympic Creed states: \"The most important thing in the Olympic Games is not to win but to take part, just as the most important thing in life is not the triumph but the struggle. The essential thing is not to have conquered but to have fought well.\"\n\nTHE OLYMPIC FLAME\n\nThe Olympic Flame or Olympic Fire is a symbol of the Olympic Games. It commemorates the theft of fire from the Greek god Zeus by Prometheus. In Ancient Greece a fire was kept burning throughout the celebration of the ancient Olympics. The fire was reintroduced at the Olympics in 1928. As with the Ancient Olympics, once the flame has been lit, it is kept burning throughout the celebration of the Olympics, and is extinguished at end of the closing ceremony of the Games.\n\nTHE OLYMPIC TORCH RELAY\n\nThe Olympic Torch Relay, which culminates in the lighting of the Olympic cauldron at the Opening Ceremony of each Games, was introduced in 1936 at the Berlin Games. It was created to symbolize the link between the ancient and modern Olympic Games.\n\nThe Torch is lighted in Olympia several months before the opening celebration of the Olympic Games at the site of the ancient Olympics in Olympia, Greece, and brought to the host city by runners carrying the torch in relay. The Olympic Torch Relay ends on the day of the opening ceremony in the central stadium of the Games. The final torch bearer runs to the cauldron and, using the torch, starts the flame in the stadium.\n\nOPENING CEREMONY\n\nThe traditional part of the ceremony starts with a parade of nations, during which most participating athletes march into the stadium country by country. One athlete from each country carries the flag of his or her nation, leading the entourage of other athletes from that country. After all nations have entered, the organizing country's head of state formally opens the Olympics.\n\nThe Olympic Anthem is then played, and the Olympic flag is hoisted in the stadium. The runner before the last in the Olympic Flame Relay brings the torch into the stadium, passing the flame to the last carrier. The last torch bearer then lights the fire in the stadium's cauldron. This is followed by the release of doves, symbolising peace. Finally, the flag bearers of all countries circle a rostrum, where one athlete and one referee will give the Olympic Oath, stating that they will compete and judge according to the rules.\n\nTHE CLOSING CEREMONY\n\nThe athletes march around the stadium randomly, instead of nation by nation. The Olympic fire is then extinguished, and the Olympic flag is lowered, folded, and presented to the mayor of the host city of the next Olympic Games. The IOC president ends the ceremonies by declaring the Games closed.\n\nTHE MEDALS\n\nOlympic medals are awarded to those individuals or teams placing first, second, and third in each event. The first place winner receives a gold-plated medal of silver, which is commonly referred to as the \"gold medal.\" Second and third places receive medals of silver and bronze respectively. The silver used in the first and second place medals must be at least 92.5% pure. The \"gold\" medals must be gilded with at least six grams of pure gold. Medals also carry the name of the sport contested.\n\nThe medals given at the Olympic Winter Games differ from the traditional medals given at the Summer Games. Each Organizing Committee designs its own medals that must be approved by the IOC.\n\nCompetitors who finish in the 1st through 8th places in an Olympic event receive an award diploma. The IOC awards commemorative pins to each athlete who participates in the Olympic Games."}, {"url": "https://www.guardian.co.tt/sports/bovell-iii-honoured-to-be-in-hall-of-fame-6.2.1110968.fb06ed4383", "page_content": "T&T Olympic Games bronze medal swim­mer (2004 Athens), and for­mer world record hold­er, George Bovell III says he is ho­n­oured to have been in­duct­ed to the First Cit­i­zens Sports Foun­da­tion Hall of Fame.\n\nThe 36-year-old Bovell, who now re­sides in Cana­da fol­low­ing his re­tire­ment from the sport al­most four years ago was in­duct­ed on Sun­day, April 11, along with for­mer out­stand­ing T&T ath­letes Claude Noel (box­ing), and Cheryl Ann Sankar (taek­won­do), Dex­ter St Louis (ta­ble ten­nis/posthu­mous) as well as coach­es Bertille St Clair (foot­ball), Lester Os­ouna (ath­let­ics), crick­et um­pire Ralph Go­sein (posthu­mous) and ad­min­is­tra­tors Rev Dr Iva Gloudon, David Far­rell, and sports jour­nal­ist Dave Lamy (posthu­mous).\n\nOver his out­stand­ing swim­ming ca­reer which spanned al­most more than 20 years, Bovell rep­re­sent­ed T&T at 2000, 2004, 2008, 2012, and 2016 Olympics.\n\nAt the 2004 Olympics, he won a bronze medal in the men's 200 IM, the ninth medal­ist in the coun­try's his­to­ry and 12th medal over­all.\n\nIt was al­so the first-ever Olympic swim­ming medal for the coun­try and T&T's on­ly medal from the 2004 Olympics.\n\nBovell al­so made it to the fi­nals of the 50m Freestyle in Lon­don where he placed sev­enth in the fastest field ever as­sem­bled af­ter re­turn­ing from a forced hia­tus due to a brain in­jury ear­li­er in the sea­son.\n\nHe was T&T's flag bear­er at the open­ing cer­e­mo­ny of the Bei­jing Olympics in 2008, the 20th Cen­tral Amer­i­can and Caribbean (CAC) Games in Carta­ge­na, Colom­bia and in the clos­ing cer­e­monies of 2000, 2004 and 2012 Olympic Games.\n\nAt FI­NA World Cham­pi­onships events, Bovell won the bronze in 2013 in the 50m Long Course freestyle fi­nal in (21.51 sec­onds) at Barcelona against the fastest field ever as­sem­bled in the sport, one in which every com­peti­tor in the fi­nal was an Olympic medal­ist.\n\nA year ear­li­er he al­so se­cured bronze in the 100m in­di­vid­ual med­ley at the World Short Course Cham­pi­onships in Is­tan­bul, a tes­ta­ment to his ver­sa­til­i­ty.\n\nOver­all, he has been in ten World Cham­pi­onship fi­nals since his first in 2001 and has won six Pan Amer­i­can Games medals (two gold, two sil­ver and two bronze) along with eight CAC Games medals (three gold, two sil­ver and three bronze), both over three edi­tions of the events.\n\nBovell who was sec­ond over­all on the 2012 FI­NA World Cup medals list with 16 (sev­en gold and nine sil­ver) and a five-time NCAA in­di­vid­ual cham­pi­on said it’s a great ho­n­our to be in­duct­ed in­to our na­tion­al sport­ing Hall of Fame said, \"I was in Coim­bat­ore, South In­dia, study­ing Ayurve­da, when they told me about it, and had planned to re­turn to the jun­gle in Pe­ru for a few weeks to learn more about tra­di­tion­al Ama­zon­ian med­i­cine. But even if he wasn't in Cana­da, Bovell who has changed his fo­cus away from the sport ad­mit­ted that re­turn­ing home for the cer­e­mo­ny was not amongst his plans, even though it may be con­sid­ered a ma­jor achieve­ment.\"\n\nHe said, \"I will be hon­est here, re­turn­ing home to at­tend the event was ini­tial­ly not a big pri­or­i­ty for me. You see, I had al­ready closed that chap­ter of my life back in Rio af­ter my last Olympic race.\"\n\nThe hold­er of most All-Amer­i­can Ho­n­ours in Auburn Uni­ver­si­ty His­to­ry with 25, Bovell said his swim­ming ca­reer was not an easy one as it may have seemed to those on the out­side, look­ing in.\n\nThe four-time NCAA Team cham­pi­on ad­mit­ted, \"You may think it was glam­orous, but look­ing back, my swim­ming ca­reer was like a harsh form of “men­tal and phys­i­cal slav­ery” as I suf­fered a lot.\"\n\n\" It was a lone­ly feat of en­durance, and a con­stant up­hill strug­gle full of heart-break­ing sac­ri­fice and fa­nat­i­cal ded­i­ca­tion.\n\n\"How­ev­er, as dif­fi­cult as it was, it was ul­ti­mate­ly nec­es­sary on my path to self-mas­tery.\n\nThe eight-time SEC cham­pi­on was quick to point out that de­spite the strug­gles he al­so learnt a lot of life lessons dur­ing his swim­ming ca­reer.\n\n\"It taught me to lose with­out be­ing de­feat­ed and to win with­out pride. Full com­mit­ment through many in­creas­ing­ly ex­treme chal­lenges even­tu­al­ly re­ward­ed me with con­trol over my body, and more im­por­tant­ly, my mind. Now, I con­trol my­self in­side, so In­stead of sim­ply re­act­ing to what's hap­pen­ing ex­ter­nal­ly, I con­scious­ly re­spond in­ten­tion­al­ly.\"\n\nHe added, \"My fa­ther helped me to see that my at­ten­dance at the in­duc­tion was not about me, but was for the peo­ple who helped me along my way, and for those who will as­pire to fol­low in my foot­steps.\""}, {"url": "https://newsday.co.tt/2021/07/07/kelly-ann-baptiste-joins-george-bovell-iii-as-most-capped-trinidad-and-tobago-olympian/", "page_content": "Kelly-Ann Baptiste joins George Bovell III as most capped Trinidad and Tobago Olympian\n\nKelly Ann Baptiste -\n\nWOMEN’S track and field sprinter Kelly-Ann Baptiste will join legendary swimmer George Bovell III as the most capped TT Olympian, as she is set to make her fifth appearance at the 2020 Tokyo Games, from July 23-August 8.\n\nA media release by the TT Olympic Committee (TTOC) on Wednesday, said, “Bovell made five consecutive appearances starting with the 2000 Sydney Olympics followed by his historic bronze medal effort at the 2004 Athens Games (in the 200-metre individual medley), team TTO’s sole medal for that edition of the Olympics.”\n\nBovell III did not let an injury deter him from continuing his swimming career as he switched focus to another event.\n\n“After an ACL (anterior cruciate ligament) injury in September 2004, Bovell was forced to change his specialty from the endurance-testing 200m individual medley to the 50m freestyle dash. He still qualified and splashed into action in the 2008 Beijing Games (semi-final) and 2012 London Games (seventh) before hanging up his goggles and cap following a first round exit at the 2016 Rio Olympics.”\n\nReflecting on Baptiste’s Olympic career the release said, “Baptiste will also be making five consecutive appearances in a record that saw her making her Olympic debut as part of the women’s 4x100m relay team at the 2004 Athens Games when the powerful Tobago-native led off the relay team that failed to carry the baton all-the way round and were disqualified in the first round.\n\n“Four years later at the 2008 Beijing edition, she reached the second round in the individual event while another baton mishap saw another disqualification in the women’s 4x100m relay.”\n\nShe had her best showing at the 2012 Games. “Baptiste’s best Olympic performance came at the 2012 London Games where she finished sixth in the final but Team TTO’s women’s relay woes continued with another failed trip, and in 2016 Rio, she exited at the second round.”\n\nBaptiste, 34, will again line up in the women's 100m dash and women's 4x100m relay team.\n\nBaptiste is being described as the “stateswoman” of the TT Olympic contingent.\n\nOn Tuesday, the TTOC announced the full TT team that covers seven sporting disciplines including track and field, boxing, cycling, judo, rowing, sailing and swimming. TTOC president Brian Lewis hinted that TT may make history by naming its first women’s flag-bearer for the opening ceremony.\n\n\"To date, the TTOC has never had a female flag-bearer at the opening ceremony of a Summer Olympic Games,\" Lewis said.\n\n\"It is my sincere hope that a female athlete will be chosen by the chef de mission Lovie Santana to carry the TT flag during the opening ceremony in Tokyo 2020.\"\n\nTT will have Santana, the experienced TTOC senior administrative officer, at the helm while TTOC project officer, athletes services and programmes, Rheeza Grant will serve as TT's covid19 liaison officer. TT will also rely on a strong medical staff of nine led by Dr Rudranath Ramsawak.\n\nAfter the Games were rescheduled due to the pandemic, Lewis said, \"The TTOC acknowledges the perseverance, dedication and determination of every athlete who tried their best to qualify for the covid19 pandemic impacted games, the first Olympic Games in history to be postponed.\"\n\nThis year's Olympic Games also hold special significance for the TTOC as it coincides with its 75-year anniversary."}, {"url": "https://newsday.co.tt/2020/04/08/bovell-relies-on-the-hammer-of-justice/", "page_content": "Bovell relies on the ‘hammer of justice’\n\nGeorge Bovell III, showing off the 'hammer of justice' -\n\nGEORGE BOVELL III was TT’s lone Olympic medallist at the 2004 Olympic Games in Athens, Greece.\n\nBovell III, then 21 years of age, copped bronze in the men’s 200-metre individual medley, becoming the first, and only, TT swimmer, to medal at the Games.\n\nRecently, Bovell III and his coach Anil Roberts spoke about the journey they both shared – leading up to the 2004 Games, as well as the event itself.\n\nHere is Part Two of the journey…\n\nAnil Roberts (AR): We moved on to the 200IM a few days later. We were a little bit short of training, so I didn’t want him to overdo and overpush. In the heats, we had a strategy of just doing the first 100 at about 75-80 percent, get a lead, then cool it and make sure he’s in the top 16 for the semi-finals. I told him that, in the semi-final, the key is still to conserve energy because we are not as fit as we want to be. So (he’ll) swim through and, in the last 20-25 metres, shut it down and make sure that you qualify for the final.\n\nCome second (and) let Laszlo Cseh from Hungary pass you. I had to insist that there was no medal in the semi-final. It was more important that he saved every bit of energy for the final. He listened and he did everything to perfection. George Bovell III (GB): I was preparing myself for the struggle of my life coming up, the 200 (metre) IM. I want to give you a quote, to describe how the 200m IM is. It’s about holding up a heavy weight that gets heavier and heavier with every passing second, and it crushes you.\n\nYou’re maintaining that impossible rhythm of exertion while executing mastery of technique, not one but all four strokes, and the transitions between the strokes. Total exhaustion must come long before the end of the race. You must have a really strong mind to force the body to hold on that rhythm and survive, to keep going, without drowning. That’s what the 200m IM is all about.\n\nIn the heats, I really played it cool. In the semi-final, I’m stacked up against a man I expect to beat to get a medal. Swimming is not only about physical condition, there is a lot of mind games that happen. I could have pushed and beat him. In the home leg, I slowed down and gave him a false sense of power over me, for him to feel like he broke (my spirit). I had to pull out all of the tricks in my book because my body was like 60 percent, because of my shoulder. That was a tactic that paid off well in the final.\n\nBovell III finished third in the second semi-final, in a time of two minutes 0.31 seconds, trailing Cseh (1:59.65) and Brazil’s Thiago Pereira (2:00.07).\n\nAR: George qualified for the final, to be in lane two. We were going against Michael Phelps, (Ryan) Lochte and Cseh. In swimming, you have 25 minutes before the final where they’ll go into a ‘ready’ room. Just before I was to send him down into the room, I was seeing nervousness. I tried different things but I had to be careful because, in a high-pressure situation, you don’t want to add too much pressure because it will bring negative results. I just wasn’t getting it.\n\n(Roberts called Bahamian swimmer Jeremy Knowles, his teammate at Auburn University). I said, ‘I want you to talk to George, I need you to get him ready, he’s looking a little nervous’. Jeremy took aside and I went out of earshot. I saw Jeremy take out a marker that he had in his pocket and he drew something on the inside of his right bicep.\n\nWhatever he did, I saw this look of confidence, of self-esteem, of relaxation. George looked at me and I said, ‘let’s go’. He went and had the swim of a lifetime.\n\nGB: This is everything that you wanted. You have a little voice that comes up in the back of your mind that tells you ‘don’t mess this up’. Before the final, everyone must go into a room, a very small room where you wait about 20 minutes. It’s very intense in this room. I was preparing myself since I had the injury, to lay my life on the line. A friend of mine came up to me and drew this hammer on my bicep.\n\nI had a reputation (and was) called the ‘hammer of justice’. If you’re racing against somebody and you are very tired, and you know the other person is very tired too, and you speed up, even though you cannot sustain that acceleration, eventually what starts to happen is that the person you’re racing against, who’s looking over at you, they say ‘whey boy, George he’s fresh’ and they eventually give up, and you break their spirit.\n\nWhen they have given up and drop back, then you can relax the pace. When you break somebody’s spirit like that, in practice, that’s called ‘dropping the hammer of justice’. I used to do this to people.\n\nAR: His normal freestyle split could have 28.16, it was 29.0, but it was still good enough to give him that bronze medal. Guess who he beat for the bronze medal? The very said Laszlo Cseh who, the day before, he had allowed him to pass. George made history, it was a proud effort. It was the hammer of justice which was drawn on his bicep by Knowles which brought him into the mental state of readiness, to perform. The hammer of justice represented how George used to train with his teammates when they were under pressure. George’s father was the manager and I was the coach, we fell down in the pool deck, hugging up. All the countries were so happy because they love when small countries get on the podium because, in swimming, it’s very rare. It was a great time and it still goes down in history as the greatest swimming moment for TT. I was so proud of George.\n\nGB: Even though my body was physically weak, I had competed in six races already. I had doubts about my physical strength. When (Knowles) drew that marker on me, it reminded me (that) my soul is strong, I am a warrior. I was ready to lay it all out. I had to pace it, I was physically weak, I was seventh after the first (part). In the backstroke I started to dig, started to put some energy and make up some ground.\n\nI felt so weak at the end of that backstroke and I couldn’t believe this was happening in the final. I had a moment of weakness. In that moment of weakness comes the perfect excuse – the exhaustion, the injury. I was so tempted to take that excuse and just slow down. I didn’t feel like how I hoped to feel in the Olympics final. I pushed through the pain and I kept accelerating.\n\n(Bovell III admitted that, during the turn and push-off for the breaststroke, he gained a lot of ground on his rivals).\n\nI started to push the breaststroke like a fire burning in my heart. I kept accelerating as if the end of the breaststroke was the end of the race.\n\nI moved up into second at the end of the breaststroke. Laszlo Cseh, the man next to me, I think he expected me to break. I kept my rhythm and it caused him to panic a little bit and lose his composure. I think it’s because of the tactic I played in the semi-final gave me a psychological advantage over him.\n\nMy freestyle was not a strong as usual, so I kept pushing and pushing. An interesting thing happened, when I touched the wall, it showed me in second place and then the clock had me in third place, it switched places with Lochte and myself.\n\nSome people say America owns it because NBC has the tv rights, and a one-two America finish is good for the ratings. I came out of the ball with a headache, but a great sense of relief."}, {"url": "https://www.3wiresports.com/articles/tag/George+Bovell", "page_content": "BARCELONA -- If the men's 100 freestyle is the equivalent of a heavyweight fight, the 50 free is completely damn simple to understand. One lap. Raw power and speed. First one to the other side is the man. Thirteen years ago, two Americans, Anthony Ervin and Gary Hall Jr., tied for the gold medal at the Sydney Olympics in the 50 free, in a time of 21.8 seconds.\n\nIn what may have been the most loaded 50 free field ever, Brazil's Cesar's Cielo rocked it Saturday night at the Palau Sant Jordi in 21.32 seconds. Afterward, he cried -- and cried -- on the medals stand, the tears redemption after knee surgery and validation of his standing as one of the all-time sprint greats. The crowd roared.\n\nThe time, the field, the race, all of it underscored how swimming keeps getting better and better. Indeed, this 50 free produced a new star, Russia's Vlad Morozov, who won silver, in 21.47, even as it re-charged the career of one of the sport's leading lights, George Bovell of Trinidad & Tobago, who won bronze in 21.51, the island nation's first-ever world-championships medal.\n\nThe 50 free highlighted a day and night of extraordinary racing.\n\nAmerican Katie Ledecky, for instance, set another world-record, her second here, in winning the women's 800, in 8:13.86. She is so good that runner-up Lotte Friis of Denmark applauded as Ledecky got out of the pool.\n\nLedecky's 800 marked her fourth gold here in Barcelona. She also won the 400, 1500 and took part in the 4x200 relay. She took six seconds off the world-record in the 1500. Her 400 time was an American record.\n\nWhen she gets home, she hopes to get her driver's license.\n\n\"I am thrilled,\" she said. \"I exceeded my expectations for this year.\"\n\nHer roommate at these worlds, Simone Manuel, who turned 17 on Friday, grabbed the final spot in the women's 50 free final Sunday by swimming 24.91; she is the first 18-and-under swimmer in U.S. history to break 25 seconds.\n\nMissy Franklin won her fifth gold medal Saturday, in the 200 backstroke, her signature event, in 2:04.76. She is the first woman since Australia's Libby Trickett to win five gold medals at a world championships, and swims Sunday in the medley relay for a sixth.\n\nNo female swimmer has ever won six gold medals at a world championships. Franklin could join Michael Phelps, Mark Spitz and Kristin Otto of East Germany as the only swimmers to win as many as six golds at the worlds or the Olympics. Otto won six golds at the 1988 Seoul Games.\n\nAsked about six, Franklin said it would \"mean so much to me\" but cautioned about the medley, \"Like every single race here, we are going to have very tough competition.\"\n\nIn the morning heats, Russia's Yulia Efimova set a world record in the women's 50 breaststroke, 29.78. The record lasted until the evening -- when Lithuania's Ruta Meilutyte went 29.48 in the semifinals.\n\nThe world records in the women's 50, 100 and 200 have all fallen at these 2013 championships -- stunning, because the plastic suits from 2008-09 were said to have helped the breaststroke most of all. The women's 50 breaststroke final is set for Sunday evening.\n\nRyan Lochte, the day after winning two medals and setting a personal best in the 100 fly semifinals, finished sixth in the men's 100 fly. South Africa's Chad le Clos, closing in the second lap just the way Phelps used to, won in 51.06.\n\n\"I don't know if it had an effect, the triple last night, but I just didn't have it,\" Lochte said.\n\nCielo for sure had it.\n\nHe won his third straight world championships title in the 50 free -- this despite surgery on both knees after the Olympics, and not even racing the 100 free.\n\nThe eight lanes of this 50 free final held three Olympic champions: Ervin, from 2000; Cielo, 2008; France's Florent Manaudou, 2012.\n\nAll eight guys had an Olympic medal. In all, there were 14 medals among the group -- seven gold, four silver, four bronze. Five of the eight had an individual medal.\n\nTo illustrate how the race has developed -- owing to advances in strength-training, straight-arm freestyle technique, a change in the racing blocks themselves and other factors -- Ervin finished Saturday in 21.65.\n\nHe took sixth.\n\n\"It happens,\" he said, adding, \"I just felt incredible yesterday. Things were a little bit apart from that when I was going through my routine today. So, you know, I don't attribute it to much other than things didn't line up perfectly. I didn't get the strike. I got the spare. Whatever.\"\n\nNathan Adrian, the London 100 gold medalist, finished fourth, in 21.6.\n\nHe said, \"21.6 would medal at most international competitions but the 50 was really fast this year,\" adding, \"I have been saying this all week: training has become so specific for every single event. Vlad and I were the only ones who swam the 100 and the 50. Look at the results from 2000, and that's not going to be the same. It has become so specific. The more you specialize, the better you can become at any particular event.\"\n\nIn the semis, Manaudou had gone 21.37. He looked like the man to beat.\n\nInstead, the race was all about Lanes 6, 7 and 8 -- Cielo, Morozov and Bovell.\n\nCielo had gone 21.76 in the prelims, then 21.6 in the semis.\n\nBut, as Cielo said late Saturday, there's a big difference between swimming the 50 and sprinting the 50. He reminded himself to swim \"fast and long, fast and long,\" and that's what he did, keeping his head down. his stroke long: \"When I saw the scoreboard, I was ecstatic. I had no idea where I was.\"\n\nMorozov, 21, moved to Southern California from Siberia when he was 14. He ripped up the NCAA championships this year swimming for USC, taking down no less than Cielo's record in the 100-yard sprint, then turned pro. He turned in a 47.62 in the 100 at the Summer University Games a few weeks back.\n\nHere, in the 100, he went out in the first 50 in 21.94 -- the first sub-22 split, ever, in any major international final. He finished fifth, in 48.01. \"I wish I didn't go out as fast,\" he said ruefully.\n\nIn the 50 prelims, he went 21.95. The semis, 21.63.\n\nIn this race, there was no back half to worry about. Just 50 meters.\n\nMorozov's 21.47 is a new national record -- beating the mark he set in the semis. He set it in front of Alex Popov, the former Russian sprint star -- who gave out the medals Saturday night.\n\n\"I'm really stoked with these medals,\" Morozov said, proving that seven years in SoCal is plenty long enough to learn to talk like a native. He also won a bronze medal as part of the 4x100 relay.\n\nMorozov, noting that this was his first long-course championships at which he was swimming individual events, added a moment later, \"To come here and get a silver medal already with guys who were in my heat -- they were already Olympic champions, world champions … I am really stoked with that. In 2016 I will do my best so that no one will be close to me.\"\n\nSprinters, it must be noted, do not as a general rule lack for confidence.\n\n\"He's going to give us a lot of trouble in the next years,\" Cielo said of Morozov, smiling.\n\nBovell, meanwhile, won a bronze medal in the 200 IM -- behind Phelps and Lochte -- in Athens in 2004. After that, he hurt his knee and could no longer swim the breaststroke.\n\nHe re-made himself into a sprinter. He turned 30 two weeks ago and, as he said, \"To be honest, when you get to be my age, there is some pressure to grow up, so to speak.\" A trip to these worlds without a medal, he said, would have put pressure on him to stop swimming competitively.\n\nNow, he said, he intends to keep on through Rio. \"I love swimming,\" he said. \"I did not want to give it up.\""}, {"url": "https://teamtto.org/index.php/tto-athletes/rio-2016-team-tto/202-rio-2016-olympic-games-team-tto-delegation/swimming-men/2666-george-bovell-swimming", "page_content": "Historic 5th Olympic Games, Olympic Bronze Medalist, Greece, 2004; Former World Record Holder; Two-time World Championship Bronze Medalist; Six-time Pan Am Games Medalist (2 Gold, 2 Silver, 2 Bronze); Ten-time World Championship Finalist; 2nd Place Overall, 2012 FINA World Cup (7 gold, 9 silver); Five-time Individual NCAA Champion;\n\nSport: Swimming\n\nEvent: 50m Freestyle\n\nAge: 32\n\nD.O.B: 18/7/83\n\nHeight: 196m\n\nWeight: 93kg\n\nSocial Media: Twitter: @GeorgeBovell; FB: George Bovell"}, {"url": "https://www.guardian.co.tt/article-6.2.445209.7ac7a4f9a1", "page_content": "The name George Bovell III is one that is syn­ony­mous with ded­i­ca­tion, pa­tri­o­tism and suc­cess. He is by far one of the most re­spect­ed and ad­mired men in sport in this coun­try. Bovell put this very twin is­land state on the map when he be­came an Olympic medal­list. Hav­ing won a bronze medal for Trinidad and To­ba­go in Athens in 2004, Bovell has de­cid­ed to once again make his coun­try proud by par­tic­i­pat­ing in the 2012 Olympics. When asked about his ex­pec­ta­tions for the 2012 Olympic Games, the uni­ver­si­ty grad­u­ate dis­closed that he hopes to come out vic­to­ri­ous in the 50m freestyle event. He added, \"Stand­ing on the podi­um is my ul­ti­mate goal.\"\n\nSwim­ming is tru­ly Bovell's call­ing. He told gieMAGAZINE that he start­ed swim­ming in his grand­moth­er's pool be­fore he could even walk. As a young man he played foot­ball, crick­et and ten­nis and par­tic­i­pat­ed in sail­ing and gym­nas­tics, still his heart was with the wa­ter and as a re­sult he grav­i­tat­ed to­wards swim­ming. He stat­ed \"Swim­ming chose me.\" Where does his in­spi­ra­tion come? Posed with this ques­tion the Olympic medal­list in­sist­ed \"My in­spi­ra­tion comes from with­in. This is where I be­lieve it should come from. You have to be able to mo­ti­vate your­self. That's the dif­fer­ence be­tween in­spi­ra­tion which lasts a life­time and mo­ti­va­tion which is tem­po­rary. Deep down in­side I want to be the best that I can be, so that when I am on my deathbed I can look back with sat­is­fac­tion know­ing that I played the cards that I was dealt by the uni­verse bold­ly like a true cham­pi­on.\"\n\nHow­ev­er, Bovell has a favourite swim­mer. Er­ic Shanteau, Bovell in­di­cat­ed, is in­deed his favourite. Shanteau pos­sess­es one of the most in­spi­ra­tional sto­ries and Bovell stressed that he ad­mires Shanteau great­ly for this. A good friend, for­mer room­mate and team­mate of Bovell, Shanteau is a Unit­ed States Olympian who bat­tled with can­cer and swam Olympic tri­als. Bovell said that he \"be­lieves that he (Shanteau) is one of the tough­est hu­man be­ings on the plan­et.\" In­deed this is an ad­mirable feat.\n\nNow that Bovell is train­ing for the 2012 Olympics he has quite a hec­tic sched­ule. The de­ter­mined swim­mer swims twice on Mon­days, Wednes­days and Fri­days and lifts weights on those days. On Tues­days, Thurs­days and Sat­ur­days he swims once but ex­treme­ly hard.\n\nIn his lit­tle spare time, he reads, does free div­ing, hangs out with friends and just tries to break out of the rou­tine. His di­et in­cludes nat­ur­al whole foods that are un­processed and lots of fish; it is an over­all healthy di­et. But how does this Olympic 2012 par­tic­i­pant cope with such a hec­tic sched­ule and main­tain­ing prop­er re­la­tion­ships with fam­i­ly and friends? To this he stat­ed, \"There is time for every­thing if you make time. This is one of the im­por­tant life skills along with dis­ci­pline and goal set­ting that sport teach­es you.\" Asked if there are any prob­lems he sees with swim­ming as a sport in this coun­try, Bovell in­sist­ed that train­ing fa­cil­i­ties need to be up­grad­ed. How­ev­er he ac­knowl­edged that things are chang­ing - \"We have some lim­i­ta­tions but things are chang­ing for the bet­ter with the pro­grammes the new gov­ern­ment is putting in place and the fa­cil­i­ties they are con­struct­ing. Where there is a will there is way.\"\n\nWhat ad­vice does he have to of­fer as­pir­ing sports­men? \"Good is not great! Al­so you don't have to be great every­day just con­stant­ly good. Be grate­ful for what you have even when you think it isn't much. There are al­ways peo­ple who are much worse off and who are suf­fer­ing\" he said. The ath­lete wished to thank God, his par­ents, his coach, Anil Roberts, his friend, Mike Bot­tom and his spon­sors Mal­abar Farms, First Cit­i­zens Bank and US­ANA Vi­t­a­mins. Where will Bovell be af­ter the 2012 Olympics? To this ques­tion he stat­ed \"Af­ter the Olympics I will re­assess my po­si­tion and de­cide how long I hope to con­tin­ue in the sport.\" All the best to you Bovell! Make our coun­try proud.\n\nStephanie Seenath\n\nSe­nior Press Pass Cor­re­spon­dent\n\nShi­va Boys' Hin­du Col­lege"}], "George Bovell III has won two world championships.": [{"url": "https://olympics.com/en/athletes/george-bovell-iii", "page_content": "Year of Birth\n\nYear of Birth 1983\n\nFirst Olympic Games\n\nFirst Olympic Games Sydney 2000\n\nTrinidad and Tobago\n\nTeam Trinidad and Tobago"}, {"url": "https://ttaquatics.org/2022/02/08/george-bovell-iii-again-recognized-as-one-of-the-fastest-men-ever-by-swimswam-and-swimmingstats/", "page_content": "As we head to yet another CARIFTA Championships we remember one of our own the greatest sprinter of all time from the region the Legendary \" King\" George Bovell III of Trinidad and Tobago.\n\nHe is ranked as the seventh fastest man of all time in the 50 metre freestyle in the Olympic sized pool with his 2009 Rome World Championships blast of of 21.20.That time also stood as a Championship record\n\nHis speed is also unmatched in the region for the 25 yards pool and the 25 metre pool."}, {"url": "https://peoplepill.com/people/george-bovell/", "page_content": "George Richard Lytcott Bovell (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago. Bovell is also a two-time World Championship bronze medalist, a record five-time Olympian and is the Caribbean region's most successful swimmer.\n\nBovell is also respected for his voluntary philanthropic initiatives such as \"The World Swim Against Malaria and Drowning\" in Uganda, 2013, with his friend, Ugandan swimmer, Max Kanyarezi. He is known for organizing and conducting the annual \"George Bovell Dive In Free Swim Clinics\", that are free for the youth of Trinidad and Tobago who enjoy the privilege of being coached and mentored by renowned Olympic Medalist Swimmers from around the world. Bovell has been the writer of the popular inspirational newspaper column in the Trinidad Guardian entitled \"Reflections Off The Water\". He is also one of the World Economic Forum's Global Shapers from the Port of Spain hub. In addition to being a swimmer, Bovell is also a renowned freediving specialist, and enjoys under water wildlife videography and spearfishing.\n\nOlympic career\n\nGeorge Bovell represented Trinidad and Tobago at the 2000, 2004, 2008, 2012, and 2016 Olympics. At the 2004 Olympics, he won a bronze medal in the men's 200 IM: the 9th medalist in the country's history and 12th medal overall. It was also the first-ever Olympic swimming medal for the country, and T&T's only medal from the 2004 Olympics. Bovell also made it to the Finals of the 50m Freestyle in London where he placed 7th in the fastest field ever assembled after returning from a forced hiatus due to a brain injury earlier in the season. Bovell carried the T&T flag at the opening ceremony of the Beijing Olympics in 2008, the 20th Central American and Caribbean Games in Cartagena, Colombia and in the closing ceremonies of the 2000, 2004 and 2012 Olympic Games.\n\nWorld Championships\n\nIn 2013 Bovell won the Bronze Medal in the 50m freestyle at the FINA World Long Course Championships in Barcelona against the fastest field ever assembled in the sport, one in which every competitor in the final was an Olympic Medalist. His Bronze Medal time of 21.51 seconds would have won the silver in the London Olympic Final a year earlier.\n\nIn 2012 Bovell won the Bronze Medal in the 100m Individual Medley at the Fina World Short Course Championships in Istanbul, a testament to his versatility.\n\nBovell has been in 10 World Championship finals since his first in 2001.\n\nSwimming Career Highlights\n\nOlympic Bronze Medallist\n\nFormer World Record Holder\n\nTwo-time World Championship Bronze Medallist\n\nSix-time Pan Am Games Medallist (2 Gold, 2 Silver, 2 Bronze)\n\nTen-time World Championship Finalist\n\n2nd Place Overall in the 2012 FINA World Cup (7 gold, 9 silver)\n\nFive-time Individual NCAA Champion\n\nEight-time Individual SEC Champion\n\nCaribbean and Central American Champion of three consecutive games and record holder, also 3 silver, 2 bronze\n\nFormer NCAA Record Holder\n\nMost All American Honours in Auburn History with 25\n\nMultiple Caribbean and Central American record holder\n\nFour-time NCAA Team Champion\n\nUndefeated in NCAA team Division 1 swimming career\n\nTrinidad and Tobago National Awards\n\nChaconia Gold\n\nHumming Bird Gold\n\nTrinidad and Tobago Sportsman Of The Year 2004 & 2014\n\nTTOC Athlete of the year\n\n2012 CCN TV6 Viewers Choice Sports Personality of the Year\n\n2013 Trinidad Express Personality of the Year\n\n2014 CCN TV6 Viewers Choice Sports Personality of the Year\n\n2014 Trinidad Guardian Sportsman of the Year\n\n2014 Trinidad Tobago Olympic Committee Sports Personality of the Year\n\nMain Events\n\nYear Event Race Position 2000 Summer Olympics 50m Freestyle Heats 2000 Summer Olympics 200m Ind Medley Heats 2000 Summer Olympics 400m Ind Medley Heats 2001 World Championship 200m Freestyle Heats 2001 World Championship 200m Ind Medley Finals 4th 2001 World Championship 400m Ind Medley Heats 2002 Short Course World Championship 200m Freestyle Semifinal 2002 Short Course World Championship 100m Ind Medley Semifinal 2002 Short Course World Championship 200m Ind Medley 7° 2003 World Championship 200m Freestyle Semifinal 2003 World Championship 200m Ind Medley 5° 2004 Summer Olympics 100m Freestyle Semifinal 2004 Summer Olympics 200m Freestyle Semifinal 2004 Summer Olympics 200m Ind Medley 03 ! 2006 Pan Pacific Championship 50m Freestyle 8° 2006 Pan Pacific Championship 100m Freestyle B Final 2007 World Championship 50m Freestyle Heats 2007 World Championship 100m Freestyle Heats 2008 Summer Olympics 50m Freestyle Semifinal 2008 Summer Olympics 100m Freestyle Heats 2008 Short Course World Championship 50m Freestyle Semifinal 2008 Short Course World Championship 100m Ind Medley 8° 2009 World Championship 50m Freestyle Finals 7th 2009 World Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Freestyle B Final 2010 Pan Pacific Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Backstroke B Final 2010 Short Course World Championship 50m Freestyle Semifinal 2010 Short Course World Championship 100m Ind Medley 4° 2011 World Championship 50m Freestyle 7° 2012 Summer Olympics 50m Freestyle 7° 2012 Summer Olympics 100m Backstroke Heats 2012 Short Course World Championship 50m Freestyle 4° 2012 Short Course World Championship 100m Ind Medley 03 ! 2013 World Championship 50m Freestyle 03 !\n\nBest Times"}, {"url": "https://www.guardian.co.tt/sports/bovell-iii-honoured-to-be-in-hall-of-fame-6.2.1110968.fb06ed4383", "page_content": "T&T Olympic Games bronze medal swim­mer (2004 Athens), and for­mer world record hold­er, George Bovell III says he is ho­n­oured to have been in­duct­ed to the First Cit­i­zens Sports Foun­da­tion Hall of Fame.\n\nThe 36-year-old Bovell, who now re­sides in Cana­da fol­low­ing his re­tire­ment from the sport al­most four years ago was in­duct­ed on Sun­day, April 11, along with for­mer out­stand­ing T&T ath­letes Claude Noel (box­ing), and Cheryl Ann Sankar (taek­won­do), Dex­ter St Louis (ta­ble ten­nis/posthu­mous) as well as coach­es Bertille St Clair (foot­ball), Lester Os­ouna (ath­let­ics), crick­et um­pire Ralph Go­sein (posthu­mous) and ad­min­is­tra­tors Rev Dr Iva Gloudon, David Far­rell, and sports jour­nal­ist Dave Lamy (posthu­mous).\n\nOver his out­stand­ing swim­ming ca­reer which spanned al­most more than 20 years, Bovell rep­re­sent­ed T&T at 2000, 2004, 2008, 2012, and 2016 Olympics.\n\nAt the 2004 Olympics, he won a bronze medal in the men's 200 IM, the ninth medal­ist in the coun­try's his­to­ry and 12th medal over­all.\n\nIt was al­so the first-ever Olympic swim­ming medal for the coun­try and T&T's on­ly medal from the 2004 Olympics.\n\nBovell al­so made it to the fi­nals of the 50m Freestyle in Lon­don where he placed sev­enth in the fastest field ever as­sem­bled af­ter re­turn­ing from a forced hia­tus due to a brain in­jury ear­li­er in the sea­son.\n\nHe was T&T's flag bear­er at the open­ing cer­e­mo­ny of the Bei­jing Olympics in 2008, the 20th Cen­tral Amer­i­can and Caribbean (CAC) Games in Carta­ge­na, Colom­bia and in the clos­ing cer­e­monies of 2000, 2004 and 2012 Olympic Games.\n\nAt FI­NA World Cham­pi­onships events, Bovell won the bronze in 2013 in the 50m Long Course freestyle fi­nal in (21.51 sec­onds) at Barcelona against the fastest field ever as­sem­bled in the sport, one in which every com­peti­tor in the fi­nal was an Olympic medal­ist.\n\nA year ear­li­er he al­so se­cured bronze in the 100m in­di­vid­ual med­ley at the World Short Course Cham­pi­onships in Is­tan­bul, a tes­ta­ment to his ver­sa­til­i­ty.\n\nOver­all, he has been in ten World Cham­pi­onship fi­nals since his first in 2001 and has won six Pan Amer­i­can Games medals (two gold, two sil­ver and two bronze) along with eight CAC Games medals (three gold, two sil­ver and three bronze), both over three edi­tions of the events.\n\nBovell who was sec­ond over­all on the 2012 FI­NA World Cup medals list with 16 (sev­en gold and nine sil­ver) and a five-time NCAA in­di­vid­ual cham­pi­on said it’s a great ho­n­our to be in­duct­ed in­to our na­tion­al sport­ing Hall of Fame said, \"I was in Coim­bat­ore, South In­dia, study­ing Ayurve­da, when they told me about it, and had planned to re­turn to the jun­gle in Pe­ru for a few weeks to learn more about tra­di­tion­al Ama­zon­ian med­i­cine. But even if he wasn't in Cana­da, Bovell who has changed his fo­cus away from the sport ad­mit­ted that re­turn­ing home for the cer­e­mo­ny was not amongst his plans, even though it may be con­sid­ered a ma­jor achieve­ment.\"\n\nHe said, \"I will be hon­est here, re­turn­ing home to at­tend the event was ini­tial­ly not a big pri­or­i­ty for me. You see, I had al­ready closed that chap­ter of my life back in Rio af­ter my last Olympic race.\"\n\nThe hold­er of most All-Amer­i­can Ho­n­ours in Auburn Uni­ver­si­ty His­to­ry with 25, Bovell said his swim­ming ca­reer was not an easy one as it may have seemed to those on the out­side, look­ing in.\n\nThe four-time NCAA Team cham­pi­on ad­mit­ted, \"You may think it was glam­orous, but look­ing back, my swim­ming ca­reer was like a harsh form of “men­tal and phys­i­cal slav­ery” as I suf­fered a lot.\"\n\n\" It was a lone­ly feat of en­durance, and a con­stant up­hill strug­gle full of heart-break­ing sac­ri­fice and fa­nat­i­cal ded­i­ca­tion.\n\n\"How­ev­er, as dif­fi­cult as it was, it was ul­ti­mate­ly nec­es­sary on my path to self-mas­tery.\n\nThe eight-time SEC cham­pi­on was quick to point out that de­spite the strug­gles he al­so learnt a lot of life lessons dur­ing his swim­ming ca­reer.\n\n\"It taught me to lose with­out be­ing de­feat­ed and to win with­out pride. Full com­mit­ment through many in­creas­ing­ly ex­treme chal­lenges even­tu­al­ly re­ward­ed me with con­trol over my body, and more im­por­tant­ly, my mind. Now, I con­trol my­self in­side, so In­stead of sim­ply re­act­ing to what's hap­pen­ing ex­ter­nal­ly, I con­scious­ly re­spond in­ten­tion­al­ly.\"\n\nHe added, \"My fa­ther helped me to see that my at­ten­dance at the in­duc­tion was not about me, but was for the peo­ple who helped me along my way, and for those who will as­pire to fol­low in my foot­steps.\""}, {"url": "https://wiki2.org/en/George_Bovell", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nTrinidad and Tobago swimmer\n\nGeorge Richard Lycott Bovell (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago. Bovell is also a two-time World Championship bronze medalist.\n\nYouTube Encyclopedic\n\n1 / 5 Views: 7 488 24 782 595 1 144 587\n\nFina/Arena Swimming World Cup 2012 Singapore Men's 100m Individual Medley\n\n2012 Fina/Arena Swimming World Cup Berlin Men's 100m Individual Medley\n\nNSATTGeorge BovellIII\n\nGeorge Bovell (T&T) returns home after FINA World Championships\n\nGeorge Bovell discusses the 200 IM from 2004 Athens Olympics Transcription\n\nOlympic career\n\nGeorge Bovell represented Trinidad and Tobago at the 2000, 2004, 2008, 2012, and 2016 Olympics. At the 2004 Olympics, he won a bronze medal in the men's 200 IM: the 9th medalist in the country's history and 12th medal overall.[7]\n\nWorld Championships\n\nIn 2013 Bovell won the bronze medal in the 50m freestyle at the FINA World Long Course Championships in Barcelona. His Bronze Medal time of 21.51 seconds would have won the silver in the London Olympic Final a year earlier.[citation needed]\n\nIn 2012 Bovell won the bronze medal in the 100m Individual Medley at the Fina World Short Course Championships in Istanbul.[citation needed]\n\nBovell has been in 10 World Championship finals since 2001.[citation needed]\n\nMain Events\n\nYear Event Race Position 2000 Summer Olympics 50m Freestyle Heats 2000 Summer Olympics 200m Ind Medley Heats 2000 Summer Olympics 400m Ind Medley Heats 2001 World Championship 200m Freestyle Heats 2001 World Championship 200m Ind Medley Finals 4th 2001 World Championship 400m Ind Medley Heats 2002 Short Course World Championship 200m Freestyle Semifinal 2002 Short Course World Championship 100m Ind Medley Semifinal 2002 Short Course World Championship 200m Ind Medley 7° 2003 World Championship 200m Freestyle Semifinal 2003 World Championship 200m Ind Medley 5° 2004 Summer Olympics 100m Freestyle Semifinal 2004 Summer Olympics 200m Freestyle Semifinal 2004 Summer Olympics 200m Ind Medley 2006 Pan Pacific Championship 50m Freestyle 8° 2006 Pan Pacific Championship 100m Freestyle B Final 2007 World Championship 50m Freestyle Heats 2007 World Championship 100m Freestyle Heats 2008 Summer Olympics 50m Freestyle Semifinal 2008 Summer Olympics 100m Freestyle Heats 2008 Short Course World Championship 50m Freestyle Semifinal 2008 Short Course World Championship 100m Ind Medley 8° 2009 World Championship 50m Freestyle Finals 7th 2009 World Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Freestyle B Final 2010 Pan Pacific Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Backstroke B Final 2010 Short Course World Championship 50m Freestyle Semifinal 2010 Short Course World Championship 100m Ind Medley 4° 2011 World Championship 50m Freestyle 7° 2012 Summer Olympics 50m Freestyle 7° 2012 Summer Olympics 100m Backstroke Heats 2012 Short Course World Championship 50m Freestyle 4° 2012 Short Course World Championship 100m Ind Medley 2013 World Championship 50m Freestyle\n\nReferences"}, {"url": "https://www.openwaterpedia.com/index.php?title=George_Bovell", "page_content": "Error creating thumbnail: Unable to save thumbnail to destination Inside with Brett Hawke logo, a podcast hosted by Australian Olympic swimmer and Coach of the Year Brett Hawke\n\nGeorge Bovell (born 18 July 1983) is a competitive swimmer, freediver, and underwater videographer from Trinidad & Tobago.\n\nSwimming Career Highlights\n\nHe is an Olympic bronze medalist swimmer, competing in 5 Olympic Games.\n\nHe is former world record holder.\n\nHe is a two-time FINA World Championship bronze medalist\n\nHe is the Caribbean region's most successful competitive swimmer.\n\nHe has started voluntary philanthropic initiatives such as The World Swim Against Malaria and Drowning in Uganda, 2013 with Ugandan swimmer Max Kanyarezi.\n\nHe organizes the annual George Bovell Dive in Free Swim Clinics that are free for the youth of Trinidad & Tobago who enjoy the privilege of being coached and mentored by renowned Olympic medalist swimmers from around the world.\n\nHe writes a popular inspirational newspaper column in the Trinidad Guardian entitled Reflections Off The Water.\n\nHe is one of the World Economic Forum's Global Shapers from the Port of Spain hub.\n\nIn 2013, he won the bronze medal in the 50m freestyle at the FINA World Championships in Barcelona.\n\nIn 2012, he won the bronze medal in the 100m individual medley at the FINA World Short Course Championships in Istanbul.\n\nHe has been in 10 FINA World Championship finals since his first in 2001.\n\nInside with Brett Hawke\n\n\n\nGeorge Bovell on Inside with Brett Hawke episode #111\n\n200 IM Final at 2004 Olympic Games\n\n\n\n\n\n"}, {"url": "https://www.openwaterpedia.com/wiki/George_Bovell", "page_content": "Error creating thumbnail: Unable to save thumbnail to destination Inside with Brett Hawke logo, a podcast hosted by Australian Olympic swimmer and Coach of the Year Brett Hawke\n\nGeorge Bovell (born 18 July 1983) is a competitive swimmer, freediver, and underwater videographer from Trinidad & Tobago.\n\nSwimming Career Highlights\n\nHe is an Olympic bronze medalist swimmer, competing in 5 Olympic Games.\n\nHe is former world record holder.\n\nHe is a two-time FINA World Championship bronze medalist\n\nHe is the Caribbean region's most successful competitive swimmer.\n\nHe has started voluntary philanthropic initiatives such as The World Swim Against Malaria and Drowning in Uganda, 2013 with Ugandan swimmer Max Kanyarezi.\n\nHe organizes the annual George Bovell Dive in Free Swim Clinics that are free for the youth of Trinidad & Tobago who enjoy the privilege of being coached and mentored by renowned Olympic medalist swimmers from around the world.\n\nHe writes a popular inspirational newspaper column in the Trinidad Guardian entitled Reflections Off The Water.\n\nHe is one of the World Economic Forum's Global Shapers from the Port of Spain hub.\n\nIn 2013, he won the bronze medal in the 50m freestyle at the FINA World Championships in Barcelona.\n\nIn 2012, he won the bronze medal in the 100m individual medley at the FINA World Short Course Championships in Istanbul.\n\nHe has been in 10 FINA World Championship finals since his first in 2001.\n\nInside with Brett Hawke\n\n\n\nGeorge Bovell on Inside with Brett Hawke episode #111\n\n200 IM Final at 2004 Olympic Games\n\n\n\n\n\n"}, {"url": "https://wiki.alquds.edu/?query=George_Bovell", "page_content": "Trinidad and Tobago swimmer\n\nGeorge Richard Lycott Bovell (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago. Bovell is also a two-time World Championship bronze medalist.\n\nOlympic career [ edit ]\n\nGeorge Bovell represented Trinidad and Tobago at the 2000, 2004, 2008, 2012, and 2016 Olympics. At the 2004 Olympics, he won a bronze medal in the men's 200 IM: the 9th medalist in the country's history and 12th medal overall.[7]\n\nWorld Championships [ edit ]\n\nIn 2013 Bovell won the bronze medal in the 50m freestyle at the FINA World Long Course Championships in Barcelona. His Bronze Medal time of 21.51 seconds would have won the silver in the London Olympic Final a year earlier.[citation needed]\n\nIn 2012 Bovell won the bronze medal in the 100m Individual Medley at the Fina World Short Course Championships in Istanbul.[citation needed]\n\nBovell has been in 10 World Championship finals since 2001.[citation needed]\n\nMain Events [ edit ]\n\nYear Event Race Position 2000 Summer Olympics 50m Freestyle Heats 2000 Summer Olympics 200m Ind Medley Heats 2000 Summer Olympics 400m Ind Medley Heats 2001 World Championship 200m Freestyle Heats 2001 World Championship 200m Ind Medley Finals 4th 2001 World Championship 400m Ind Medley Heats 2002 Short Course World Championship 200m Freestyle Semifinal 2002 Short Course World Championship 100m Ind Medley Semifinal 2002 Short Course World Championship 200m Ind Medley 7° 2003 World Championship 200m Freestyle Semifinal 2003 World Championship 200m Ind Medley 5° 2004 Summer Olympics 100m Freestyle Semifinal 2004 Summer Olympics 200m Freestyle Semifinal 2004 Summer Olympics 200m Ind Medley 2006 Pan Pacific Championship 50m Freestyle 8° 2006 Pan Pacific Championship 100m Freestyle B Final 2007 World Championship 50m Freestyle Heats 2007 World Championship 100m Freestyle Heats 2008 Summer Olympics 50m Freestyle Semifinal 2008 Summer Olympics 100m Freestyle Heats 2008 Short Course World Championship 50m Freestyle Semifinal 2008 Short Course World Championship 100m Ind Medley 8° 2009 World Championship 50m Freestyle Finals 7th 2009 World Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Freestyle B Final 2010 Pan Pacific Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Backstroke B Final 2010 Short Course World Championship 50m Freestyle Semifinal 2010 Short Course World Championship 100m Ind Medley 4° 2011 World Championship 50m Freestyle 7° 2012 Summer Olympics 50m Freestyle 7° 2012 Summer Olympics 100m Backstroke Heats 2012 Short Course World Championship 50m Freestyle 4° 2012 Short Course World Championship 100m Ind Medley 2013 World Championship 50m Freestyle"}, {"url": "https://swimswam.com/george-bovell-visionary-sport/", "page_content": "George Bovell, a name synonymous with Trinidadian swimming, recently enlisted the help of some elite friends in his quest to help inspire a younger generation of swimmers in his home region. Two-time Olympic bronze medalist for Russia, Arkady Vyatchanin (now most likely representing Serbia), Olympic gold medalist for South Africa Roland Schoeman, and World Champion New Zealander Moss Burmester joined the 2004-Olympic bronze medalist in the Caribbean for a series of free clinics using swimming as a platform to both benefit and excite young athletes.\n\nThe “George Bovell Dive In Free Swim Clinics 2015” were held at facilities in St. James, Macoya and San Fernando over January 15-17th, with the prestigious athletes teaching training methods, skills and drills with the purpose of not only encouraging the young attendees within the sport of swimming, but by also offering up hope and inspiration as they interacted and collaborated with the participants.\n\nBovell tells SwimSwam that, “the clinics were a huge success; you all can’t imagine what it meant to those kids. It’s an initiative that I try to put on every year to give back to and hopefully grow the sport here. It also serves to get the youth ‘thinking big’ and to help them understand that, through hard work, anything is possible.”\n\nTo that end, while in the midst of ramping up his own training en route to this year’s Pan American Games and World Championships, Bovell is monitoring the construction of the George Bovell Aquatic Center* taking shape in Couva, Trinidad (*name is not yet official). With the building’s completion targeted for June 2015, Bovell hopes the country can offer the facility to Olympic teams to use for their Rio 2016 staging camps, especially with Trinidad’s temperatures and time zone not far off Rio’s mark.\n\nThis vision falls directly in line with what Bovell describes as his short- and long-term mission for the sport of swimming in Trinidad and Tobago. “In the next five years, I would love to see Trinidad and Tobago hosting regional and international swimming events and have all schools offer learn-to-swim classes as part of their curriculum so that the number of unnecessary drowning deaths annually will be significantly reduced.”\n\nGrowing up in the 90’s and pushing through the age group ranks with what Bovell has previously described as limited knowledge, resources and opportunities, he now feels compelled to contribute to the overall improvement of swimming on all levels. Bovell feels confident that, “with access to world-class facilities, world-class Trinidad swimmers will become the norm and not the exception.”"}, {"url": "https://fampeople.com/cat-george-bovell", "page_content": "George Bovell : biography\n\nGeorge Bovell III (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago. He is a four-time Olympian and the Caribbean region’s most successful swimmer. Bovell also recently won a Bonze Medal at the 2012 World Championships in Istanbul. He is currently ranked 2nd, 4th and 8th in the FINA World Rankings for 2012 in the 100m IM, 50m freestyle SCM, and the 50m freestyle LCM respectively. http://www.bolles.org/s/864/currentsp/indexNoRot.aspx?sid=864&gid=1&pgid=1757&cid=2777&ecid=2777&crid=0&calpgid=860&calcid=1633\n\nSwimming accomplishments\n\nOlympic Bronze Medalist\n\nFormer World Record Holder\n\nWorld Championship Bronze Medalist\n\nFive-time Pan Am Games Medalist (2 Gold, 2 Silver, 1 Bronze)\n\nNine-time World Championship Finalist\n\n2nd Place Overall in the 2012 FINA World Cup (7 gold, 9 silver)\n\nFive-time Individual NCAA Champion\n\nEight-time Individual SEC Champion\n\n2-time Caribbean and Central American Champion and record holder, also 2 silver, 2 bronze\n\nFormer NCAA Record Holder\n\nMost All American Honors in Auburn History with 25\n\nMultiple Caribbean and Central American record holder\n\nFour-time NCAA Team Champion\n\nUndefeated in college swimming career\n\nTrinidad and Tobago National Awards\n\nChaconia Gold\n\nHumming Bird Gold\n\nSportsman of the year\n\nTTOC Athlete of the year\n\n2012 CCN Sports Personality of the year\n\nOlympic career\n\nGeorge Bovell represented Trinidad and Tobago at the 2000, 2004, 2008 and 2012 Olympics. At the 2004 Olympics, he won a bronze medal in the men’s 200 IM: the 9th medalist in the country’s history and 12th medal overall. It was also the first-ever Olympic swimming medal for the country, and T&T’s only medal from the 2004 Olympics. Bovell also made it to the Finals of the 50m Freestyle in London where he placed 7th in the fastest field ever assembled.\n\nBovell is also a 5 time Pan American Games Medalist, with 2 gold, 2 silver and 1 bronze, the most of any Trinidad and Tobago Athlete.\n\nBovell carried the T&T flag at the opening ceremony of the Beijing Olympics in 2008 and at the 20th Central American and Caribbean Games in Cartagena, Colombia.\n\nBovell is currently the fourth fastest performer of all time in the 50m Freestyle. This is different from the 200 IM, the event in which he won his Olympic Medal and in which he has held the world record. He is also the second fastest performer ever in textile in the 100m Individual Medley.\n\nHe was voted the CCN TV6 Sports Personality of The Year for 2012 by the public of Trinidad and Tobago.\n\nMain events"}], "George Bovell III is a former world record holder in the 50-meter freestyle.": [{"url": "https://olympics.com/en/athletes/george-bovell-iii", "page_content": "Year of Birth\n\nYear of Birth 1983\n\nFirst Olympic Games\n\nFirst Olympic Games Sydney 2000\n\nTrinidad and Tobago\n\nTeam Trinidad and Tobago"}, {"url": "https://www.openwaterpedia.com/wiki/George_Bovell", "page_content": "Error creating thumbnail: Unable to save thumbnail to destination Inside with Brett Hawke logo, a podcast hosted by Australian Olympic swimmer and Coach of the Year Brett Hawke\n\nGeorge Bovell (born 18 July 1983) is a competitive swimmer, freediver, and underwater videographer from Trinidad & Tobago.\n\nSwimming Career Highlights\n\nHe is an Olympic bronze medalist swimmer, competing in 5 Olympic Games.\n\nHe is former world record holder.\n\nHe is a two-time FINA World Championship bronze medalist\n\nHe is the Caribbean region's most successful competitive swimmer.\n\nHe has started voluntary philanthropic initiatives such as The World Swim Against Malaria and Drowning in Uganda, 2013 with Ugandan swimmer Max Kanyarezi.\n\nHe organizes the annual George Bovell Dive in Free Swim Clinics that are free for the youth of Trinidad & Tobago who enjoy the privilege of being coached and mentored by renowned Olympic medalist swimmers from around the world.\n\nHe writes a popular inspirational newspaper column in the Trinidad Guardian entitled Reflections Off The Water.\n\nHe is one of the World Economic Forum's Global Shapers from the Port of Spain hub.\n\nIn 2013, he won the bronze medal in the 50m freestyle at the FINA World Championships in Barcelona.\n\nIn 2012, he won the bronze medal in the 100m individual medley at the FINA World Short Course Championships in Istanbul.\n\nHe has been in 10 FINA World Championship finals since his first in 2001.\n\nInside with Brett Hawke\n\n\n\nGeorge Bovell on Inside with Brett Hawke episode #111\n\n200 IM Final at 2004 Olympic Games\n\n\n\n\n\n"}, {"url": "https://pantheon.world/profile/person/George_Bovell/", "page_content": "George Bovell\n\nGeorge Richard Lycott Bovell (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of George Bovell has received more than 98,024 page views. His biography is available in 18 different languages on Wikipedia . George Bovell is the 18,687th most popular politician (down from 15,599th in 2019), the 1,297th most popular biography from Canada (down from 54th in 2019) and the 91st most popular Canadian Politician."}, {"url": "https://wikimili.com/en/George_Bovell", "page_content": "The men's 100 metre freestyle event at the 2004 Summer Olympics was contested at the Olympic Aquatic Centre of the Athens Olympic Sports Complex in Athens, Greece on August 17 and 18. There were 69 competitors from 62 nations. Nations had been limited to two swimmers each since the 1984 Games.\n\nThe men's 200 metre individual medley event at the 2004 Olympic Games was contested at the Olympic Aquatic Centre of the Athens Olympic Sports Complex in Athens, Greece on August 18 and 19.\n\nTrinidad and Tobago competed at the 2004 Summer Olympics in Athens, Greece, from 13 to 29 August 2004. This was the nation's sixteenth appearance at the Summer Olympics as an independent nation, although it had previously appeared in four editions as part of the British colony and the West Indies Federation. Trinidad and Tobago Olympic Committee sent a total of nineteen athletes to the Games, ten men and nine women, to compete only in track and field, shooting, swimming, and taekwondo, which made its Olympic debut; the nation's team size was relatively similar to the record in Sydney four years earlier.\n\nOussama \"Ous\" Mellouli is a Tunisian swimmer who competes in the freestyle and medley events. He is a three-time Olympic medalist, is an African record holder, and trains with the USC Trojans team based at the University of Southern California, where he studied as a computer science undergraduate and swam collegiately.\n\nBronte Amelia Arnold Barratt, OAM is a retired Australian competitive swimmer and Olympic gold medallist.\n\nBrenton Scott Rickard is a retired breaststroke swimmer from Australia. He emerged at the international level in 2006, swimming at the Commonwealth games. He has captured multiple Olympic and World Championship medals, as well as world and Commonwealth records. During this period he was coached by Vince Raleigh.\n\nTrinidad and Tobago sent a delegation to compete at the 2008 Summer Olympics in Beijing, China. Its participation in the Beijing games marked its eighteenth Olympic appearance and fifteenth Summer Olympic appearance since its debut at the 1948 Summer Olympics in London, excluding its joint participation with Jamaica and Barbados in 1960 as the West Indies Federation. With 28 athletes, more Trinidadians had competed at the Olympics than in any other single Olympic Games in its history before Beijing. Athletes representing Trinidad and Tobago advanced past the preliminary or qualification rounds in twelve events and reached the final rounds in four of those events. Of those four events, silver medals were won in the men's 100 meters and in the men's 4x100 meters relay. The latter was upgraded to gold due to one member of the quartet that crossed the line first, Nesta Carter, testing positive for a banned substance, resulting in their disqualification. The nation's flag bearer at the opening ceremony that year was swimmer and Athens medalist George Bovell.\n\nChristian David Sprenger is an Australian former breaststroke swimmer. He trains at the Commercial Swimming Club under Simon Cusack.\n\nAlia Shanee Atkinson, OD is a Jamaican five-time Olympian and a former competitive swimmer whose international competition career spanned 19 years, 2003 to 2021 inclusive, at the senior level. At short course World Swimming Championships, she is a ten-time medalist in individual events, including four gold medals, four silver medals, and two bronze medals. She won a total of 124 medals, of which 74 were gold medals, at Swimming World Cup circuits over the course of her career. She won 14 total medals in individual events, 11 gold, 1 silver, and 2 bronze, from her first three Central American and Caribbean Games, in 2006, 2010, and 2018.\n\nSharntelle Sharon Tamika Cyren McLean is a 2-time Olympic swimmer from Trinidad and Tobago. She swam for Trinidad and Tobago at the 2004 and 2008 Olympics. Beginning in 2005, she has attended and swam for the United States' University of South Carolina.\n\nChad Guy Bertrand le Clos, OIS is a South African competitive swimmer who is an Olympic, World and Commonwealth Games champion. He is the African record, Commonwealth record, and South African record holder in the short course and long course 200-metre butterfly and the short course 100-metre butterfly. He also holds the African records and South African records in the long course 200-metre freestyle and 100-metre butterfly, and the short course 100-metre freestyle. Formerly, he was a world record holder in the short course 100-metre butterfly and 200-metre butterfly.\n\nTrinidad and Tobago competed at the 2012 Summer Olympics in London, United Kingdom from 27 July to 12 August 2012. This was Trinidad and Tobago's most successful Summer Olympics. It was the nation's largest ever delegation sent to the Olympics, with a total of 30 athletes, 21 men and 9 women, in 6 sports. Trinidad and Tobago's participation in these games marked its sixteenth Olympic appearance as an independent nation, although it had previously competed in four other games as a British colony, and as part of the West Indies Federation. The nation was awarded four Olympic medals based on the efforts by the athletes who competed in the track and field. Javelin thrower Keshorn Walcott became the first Trinidadian athlete to win an Olympic gold medal since the 1976 Summer Olympics in Montreal, where Hasely Crawford won for the sprint event. Marc Burns, a four-time Olympic athlete and a relay sprinter who led his team by winning the silver medal in Beijing, was the nation's flag bearer at the opening ceremony.\n\nBronte Campbell is a Malawian-born Australian competitive swimmer, a dual Olympic gold-medal winner and world champion. Her older sister, Cate, is also a competitive swimmer, and once held world records in both the short and long course 100 metre individual freestyle events. Bronte and Cate are the first Australian siblings on the same Olympic swimming team since the 1972 Olympics and the first Australian sisters ever to compete within the same swimming event at the Olympics. Bronte Campbell won three gold medals at the 2015 World Championships, including the 50 and 100 metre freestyle events.\n\nPark Seon-Kwan is a South Korean swimmer, who specialized in backstroke events. He won a bronze medal, as a member of the South Korean swimming team, in the 400 m freestyle relay at the 2010 Asian Games in Guangzhou, China. He also collected two silver medals in the 100 and 200 m backstroke at the 2009 East Asian Games in Hong Kong, China. Park is a member of the swimming team at Korea National Sports University in Seoul.\n\nDaniel Goodfellow is a British diver, two-time Commonwealth champion and Olympic bronze medalist. He first represented Great Britain as a senior at the 2013 European Diving Championships in the 10 m platform event and the 2013 World Aquatics Championships in the same event. Goodfellow won a bronze medal in the Men's 10m Synchronised Platform event with his diving partner Tom Daley at the 2016 Summer Olympics in Rio de Janeiro. He has also won a gold with Daley in the same event at the Commonwealth Games, and a silver at the European Championships. In 2022 he won his first major title as a solo diver, winning gold in the men's 3 metre springboard at the 2022 Commonwealth Games\n\nEmma Jennifer McKeon, is an Australian competitive swimmer. She is a seven-time world record holder, three current and four former, in relays. Her total career haul of 11 Olympic medals following the 2020 Olympic Games made her Australia's most decorated Olympian and included one gold medal from the 2016 Summer Olympics in Rio de Janeiro and four gold medals from the 2020 Summer Olympics in Tokyo. With four gold and three bronze medals she was the most decorated athlete across all sports at the 2020 Summer Olympics, and tied for the most medals won by a woman in a single Olympic Games. She has also won 17 medals, including four gold medals, at the World Aquatics Championships; and a record 20 medals, including 14 gold, at the Commonwealth Games.\n\nTrinidad and Tobago competed at the 2016 Summer Olympics in Rio de Janeiro, from August 5 to 21, 2016. This was the nation's seventeenth appearance at the Summer Olympics, although it previously competed in four other editions as a British colony, and as part of the West Indies Federation.\n\nLuke Greenbank is an English professional swimmer who specialises in backstroke. A medalist in the 200 metre backstroke at the Olympic Games and the World and European championships, he also swam the first leg in the 2019 World and 2020 European Championship gold medal-winning Great Britain medley relay teams. He won a silver medal as lead-off for Great Britain in the 4 x 100 metre medley relay for men at the 2020 Summer Olympics. He won a gold medal as lead-off for England in the heats of the 4 x 100 metre medley relay for men at the 2022 Commonwealth Games.\n\nKyle Chalmers, is an Australian competitive swimmer. He is a world record holder in the short course 100 metre freestyle, 4×100 metre medley relay, and long course 4×100 metre mixed freestyle relay. He is the Oceanian and Australian record holder in the short course 50 metre butterfly and 50 metre freestyle."}, {"url": "https://www.openwaterpedia.com/index.php?title=George_Bovell", "page_content": "Error creating thumbnail: Unable to save thumbnail to destination Inside with Brett Hawke logo, a podcast hosted by Australian Olympic swimmer and Coach of the Year Brett Hawke\n\nGeorge Bovell (born 18 July 1983) is a competitive swimmer, freediver, and underwater videographer from Trinidad & Tobago.\n\nSwimming Career Highlights\n\nHe is an Olympic bronze medalist swimmer, competing in 5 Olympic Games.\n\nHe is former world record holder.\n\nHe is a two-time FINA World Championship bronze medalist\n\nHe is the Caribbean region's most successful competitive swimmer.\n\nHe has started voluntary philanthropic initiatives such as The World Swim Against Malaria and Drowning in Uganda, 2013 with Ugandan swimmer Max Kanyarezi.\n\nHe organizes the annual George Bovell Dive in Free Swim Clinics that are free for the youth of Trinidad & Tobago who enjoy the privilege of being coached and mentored by renowned Olympic medalist swimmers from around the world.\n\nHe writes a popular inspirational newspaper column in the Trinidad Guardian entitled Reflections Off The Water.\n\nHe is one of the World Economic Forum's Global Shapers from the Port of Spain hub.\n\nIn 2013, he won the bronze medal in the 50m freestyle at the FINA World Championships in Barcelona.\n\nIn 2012, he won the bronze medal in the 100m individual medley at the FINA World Short Course Championships in Istanbul.\n\nHe has been in 10 FINA World Championship finals since his first in 2001.\n\nInside with Brett Hawke\n\n\n\nGeorge Bovell on Inside with Brett Hawke episode #111\n\n200 IM Final at 2004 Olympic Games\n\n\n\n\n\n"}, {"url": "https://wiki2.org/en/George_Bovell", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nTrinidad and Tobago swimmer\n\nGeorge Richard Lycott Bovell (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago. Bovell is also a two-time World Championship bronze medalist.\n\nYouTube Encyclopedic\n\n1 / 5 Views: 7 488 24 782 595 1 144 587\n\nFina/Arena Swimming World Cup 2012 Singapore Men's 100m Individual Medley\n\n2012 Fina/Arena Swimming World Cup Berlin Men's 100m Individual Medley\n\nNSATTGeorge BovellIII\n\nGeorge Bovell (T&T) returns home after FINA World Championships\n\nGeorge Bovell discusses the 200 IM from 2004 Athens Olympics Transcription\n\nOlympic career\n\nGeorge Bovell represented Trinidad and Tobago at the 2000, 2004, 2008, 2012, and 2016 Olympics. At the 2004 Olympics, he won a bronze medal in the men's 200 IM: the 9th medalist in the country's history and 12th medal overall.[7]\n\nWorld Championships\n\nIn 2013 Bovell won the bronze medal in the 50m freestyle at the FINA World Long Course Championships in Barcelona. His Bronze Medal time of 21.51 seconds would have won the silver in the London Olympic Final a year earlier.[citation needed]\n\nIn 2012 Bovell won the bronze medal in the 100m Individual Medley at the Fina World Short Course Championships in Istanbul.[citation needed]\n\nBovell has been in 10 World Championship finals since 2001.[citation needed]\n\nMain Events\n\nYear Event Race Position 2000 Summer Olympics 50m Freestyle Heats 2000 Summer Olympics 200m Ind Medley Heats 2000 Summer Olympics 400m Ind Medley Heats 2001 World Championship 200m Freestyle Heats 2001 World Championship 200m Ind Medley Finals 4th 2001 World Championship 400m Ind Medley Heats 2002 Short Course World Championship 200m Freestyle Semifinal 2002 Short Course World Championship 100m Ind Medley Semifinal 2002 Short Course World Championship 200m Ind Medley 7° 2003 World Championship 200m Freestyle Semifinal 2003 World Championship 200m Ind Medley 5° 2004 Summer Olympics 100m Freestyle Semifinal 2004 Summer Olympics 200m Freestyle Semifinal 2004 Summer Olympics 200m Ind Medley 2006 Pan Pacific Championship 50m Freestyle 8° 2006 Pan Pacific Championship 100m Freestyle B Final 2007 World Championship 50m Freestyle Heats 2007 World Championship 100m Freestyle Heats 2008 Summer Olympics 50m Freestyle Semifinal 2008 Summer Olympics 100m Freestyle Heats 2008 Short Course World Championship 50m Freestyle Semifinal 2008 Short Course World Championship 100m Ind Medley 8° 2009 World Championship 50m Freestyle Finals 7th 2009 World Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Freestyle B Final 2010 Pan Pacific Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Backstroke B Final 2010 Short Course World Championship 50m Freestyle Semifinal 2010 Short Course World Championship 100m Ind Medley 4° 2011 World Championship 50m Freestyle 7° 2012 Summer Olympics 50m Freestyle 7° 2012 Summer Olympics 100m Backstroke Heats 2012 Short Course World Championship 50m Freestyle 4° 2012 Short Course World Championship 100m Ind Medley 2013 World Championship 50m Freestyle\n\nReferences"}, {"url": "https://fampeople.com/cat-george-bovell", "page_content": "George Bovell : biography\n\nGeorge Bovell III (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago. He is a four-time Olympian and the Caribbean region’s most successful swimmer. Bovell also recently won a Bonze Medal at the 2012 World Championships in Istanbul. He is currently ranked 2nd, 4th and 8th in the FINA World Rankings for 2012 in the 100m IM, 50m freestyle SCM, and the 50m freestyle LCM respectively. http://www.bolles.org/s/864/currentsp/indexNoRot.aspx?sid=864&gid=1&pgid=1757&cid=2777&ecid=2777&crid=0&calpgid=860&calcid=1633\n\nSwimming accomplishments\n\nOlympic Bronze Medalist\n\nFormer World Record Holder\n\nWorld Championship Bronze Medalist\n\nFive-time Pan Am Games Medalist (2 Gold, 2 Silver, 1 Bronze)\n\nNine-time World Championship Finalist\n\n2nd Place Overall in the 2012 FINA World Cup (7 gold, 9 silver)\n\nFive-time Individual NCAA Champion\n\nEight-time Individual SEC Champion\n\n2-time Caribbean and Central American Champion and record holder, also 2 silver, 2 bronze\n\nFormer NCAA Record Holder\n\nMost All American Honors in Auburn History with 25\n\nMultiple Caribbean and Central American record holder\n\nFour-time NCAA Team Champion\n\nUndefeated in college swimming career\n\nTrinidad and Tobago National Awards\n\nChaconia Gold\n\nHumming Bird Gold\n\nSportsman of the year\n\nTTOC Athlete of the year\n\n2012 CCN Sports Personality of the year\n\nOlympic career\n\nGeorge Bovell represented Trinidad and Tobago at the 2000, 2004, 2008 and 2012 Olympics. At the 2004 Olympics, he won a bronze medal in the men’s 200 IM: the 9th medalist in the country’s history and 12th medal overall. It was also the first-ever Olympic swimming medal for the country, and T&T’s only medal from the 2004 Olympics. Bovell also made it to the Finals of the 50m Freestyle in London where he placed 7th in the fastest field ever assembled.\n\nBovell is also a 5 time Pan American Games Medalist, with 2 gold, 2 silver and 1 bronze, the most of any Trinidad and Tobago Athlete.\n\nBovell carried the T&T flag at the opening ceremony of the Beijing Olympics in 2008 and at the 20th Central American and Caribbean Games in Cartagena, Colombia.\n\nBovell is currently the fourth fastest performer of all time in the 50m Freestyle. This is different from the 200 IM, the event in which he won his Olympic Medal and in which he has held the world record. He is also the second fastest performer ever in textile in the 100m Individual Medley.\n\nHe was voted the CCN TV6 Sports Personality of The Year for 2012 by the public of Trinidad and Tobago.\n\nMain events"}, {"url": "https://wiki.alquds.edu/?query=George_Bovell", "page_content": "Trinidad and Tobago swimmer\n\nGeorge Richard Lycott Bovell (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago. Bovell is also a two-time World Championship bronze medalist.\n\nOlympic career [ edit ]\n\nGeorge Bovell represented Trinidad and Tobago at the 2000, 2004, 2008, 2012, and 2016 Olympics. At the 2004 Olympics, he won a bronze medal in the men's 200 IM: the 9th medalist in the country's history and 12th medal overall.[7]\n\nWorld Championships [ edit ]\n\nIn 2013 Bovell won the bronze medal in the 50m freestyle at the FINA World Long Course Championships in Barcelona. His Bronze Medal time of 21.51 seconds would have won the silver in the London Olympic Final a year earlier.[citation needed]\n\nIn 2012 Bovell won the bronze medal in the 100m Individual Medley at the Fina World Short Course Championships in Istanbul.[citation needed]\n\nBovell has been in 10 World Championship finals since 2001.[citation needed]\n\nMain Events [ edit ]\n\nYear Event Race Position 2000 Summer Olympics 50m Freestyle Heats 2000 Summer Olympics 200m Ind Medley Heats 2000 Summer Olympics 400m Ind Medley Heats 2001 World Championship 200m Freestyle Heats 2001 World Championship 200m Ind Medley Finals 4th 2001 World Championship 400m Ind Medley Heats 2002 Short Course World Championship 200m Freestyle Semifinal 2002 Short Course World Championship 100m Ind Medley Semifinal 2002 Short Course World Championship 200m Ind Medley 7° 2003 World Championship 200m Freestyle Semifinal 2003 World Championship 200m Ind Medley 5° 2004 Summer Olympics 100m Freestyle Semifinal 2004 Summer Olympics 200m Freestyle Semifinal 2004 Summer Olympics 200m Ind Medley 2006 Pan Pacific Championship 50m Freestyle 8° 2006 Pan Pacific Championship 100m Freestyle B Final 2007 World Championship 50m Freestyle Heats 2007 World Championship 100m Freestyle Heats 2008 Summer Olympics 50m Freestyle Semifinal 2008 Summer Olympics 100m Freestyle Heats 2008 Short Course World Championship 50m Freestyle Semifinal 2008 Short Course World Championship 100m Ind Medley 8° 2009 World Championship 50m Freestyle Finals 7th 2009 World Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Freestyle B Final 2010 Pan Pacific Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Backstroke B Final 2010 Short Course World Championship 50m Freestyle Semifinal 2010 Short Course World Championship 100m Ind Medley 4° 2011 World Championship 50m Freestyle 7° 2012 Summer Olympics 50m Freestyle 7° 2012 Summer Olympics 100m Backstroke Heats 2012 Short Course World Championship 50m Freestyle 4° 2012 Short Course World Championship 100m Ind Medley 2013 World Championship 50m Freestyle"}, {"url": "https://archive.org/details/zn3wpzxagvorzok8kmlk5pgu1vbw9xkzq53x1ltz", "page_content": "There Is No Preview Available For This Item\n\nThis item does not appear to have any files that can be experienced on Archive.org.\n\nPlease download files in this item to interact with them on your computer.\n\nShow all files"}, {"url": "https://dbpedia.org/page/George_Bovell", "page_content": "George Bovell (* 18. Juli 1983 in Port of Spain, Trinidad) ist ein Schwimmer aus Trinidad und Tobago. Er gewann für sein Land im Jahr 2004 eine olympische Bronzemedaille und ist damit bis heute der erfolgreichste karibische Schwimmsportler. Sein Schwimmtalent wurde ihm offenbar in die Wiege gelegt, sein Vater George war College-Schwimmer und seine Mutter eine Langstrecken-Läuferin, die bei den Olympischen Spielen 1972 und 1976 für Barbados und Kanada startete. Sein Bruder nahm als Schwimmer bei den Olympischen Spielen 2008 teil. Seinen ersten großen internationalen Erfolg konnte George Bovell bei den Schwimmweltmeisterschaften 2001 in Fukuoka feiern, wo er über seine Spezialstrecke 200 m Lagen in 2:01,50 Minuten den vierten Platz erreichte. Zwei Jahre später bei den Schwimmweltmeisterschaften 2003 in Barcelona konnte er zwar seine Zeit über diese Strecke auf 2:00,06 Minuten verbessern, dennoch reichte es dort nur für einen fünften Platz. Bei den Panamerikanischen Spielen 2003 in Santo Domingo konnte er dann zweimal Gold über 200 m Freistil und 200 m Lagen sowie zweimal Silber über 100 m Freistil und 100 m Rücken erringen. Damit erlangte er allein vier der sieben Medaillen für Trinidad und Tobago bei den Spielen und dabei die einzigen beiden Goldmedaillen. Bei den Olympischen Spielen 2004 in Athen holte er dann völlig überraschend mit einer Zeit von 1:58,80 Minuten die Bronzemedaille über 200 m Lagen hinter den beiden US-Amerikanern Michael Phelps und Ryan Lochte. Von der Silbermedaille trennten ihn dabei gerade mal zwei Hundertstel Sekunden. Seine Medaille war für die Karibik die erste Medaille im Schwimmen bei Olympischen Spielen überhaupt und die einzige für sein Land in Athen. Insgesamt war er der neunte Athlet, der für Trinidad und Tobago eine Medaille bei Olympischen Spielen holen konnte, die weiteren Medaillengewinner waren in der Leichtathletik und im Gewichtheben erfolgreich. Mit einer Zeit von 1:53,93 Minuten konnte er am 25. März 2004 bei den NCAA-Meisterschaften 2004 in einen neuen Kurzbahn-Weltrekord über 200 m Lagen aufstellen. Damit war Bovell der erste Schwimmer aus Trinidad und Tobago, der einen Weltrekord verbessern konnte. Der Rekord hielt etwa 20 Monate, bis er von dem Ungarn László Cseh bei den Kurzbahneuropameisterschaften 2005 in Triest um 47 Hundertstel Sekunden unterboten wurde. Bei den Karibikspielen 2006 in Cartagena trug George Bovell bei der Eröffnungszeremonie die Fahne für sein Land. Bovell studierte Sport an der Auburn University in den USA. (de)\n\nGeorge Richard Lycott Bovell (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago. Bovell is also a two-time World Championship bronze medalist. (en)\n\nGeorge Richard Bovell (18 de julio de 1983) es un deportista de Trinidad y Tobago de la especialidad de natación​ que obtuvo una medalla de bronce en 200 m combinado en los Juegos Olímpicos de Atenas 2004.​ Bovell también ha obtenido medallas en el Campeonato Mundial de Natación, Juegos Panamericanos y fue campeón de Centroamérica y del Caribe en los 50 m libre en Cartagena 2006 y Mayagüez 2010.​​ (es)\n\nGeorge Richard Bovell III, né le 18 juillet 1983 à Port-d'Espagne, est un nageur trinidadien. (fr)\n\nジョージ・ボベル（George Bovell, 1983年7月18日 - ）は、トリニダード・トバゴの競泳選手。 2004年アテネ五輪の水泳男子個人メドレー200メートルの銅メダリスト。彼はトリニダード・トバゴ人で9人目のオリンピックメダリスト。彼がもたらした銅メダルはトリニダード・トバゴにとって12個目のオリンピックメダルとなった。また、この銅メダルはトリニダード・トバゴにとって2004年アテネ五輪の唯一のメダルだった。 2004年アテネ五輪の水泳男子個人メドレー200メートル決勝の1位はマイケル・フェルプス（アメリカ）、2位はライアン・ロクテ（アメリカ）。ジョージ・ボベルは彼らに次ぐ3位だった。彼らのタイムはそれぞれ、1分57秒14、1分58秒78、1分58秒80だった。 2008年北京オリンピックの開会式では、トリニダード・トバゴ選手団の旗手を務めた。 (ja)\n\nGeorge Richard Lycott Bovell III (Port of Spain, 18 juli 1983) is een zwemmer uit Trinidad en Tobago. Hij vertegenwoordigde zijn vaderland op de Olympische Zomerspelen 2000 in Sydney, op de Olympische Zomerspelen 2004 in Athene, op de Olympische Zomerspelen 2008 in Peking en op de Olympische Zomerspelen 2012 in Londen. Bovells moeder, , nam namens Barbados deel aan het atletiektoernooi van de Olympische Zomerspelen 1972 in München, zijn broer nam als zwemmer deel aan de Olympische Zomerspelen van 2008. (nl)\n\nGeorge Richard Lycott Bovell III (ur. 18 lipca 1983) – trynidadzko-tobagijski pływak, specjalizujący się w stylu zmiennym, brązowy medalista igrzysk olimpijskich i mistrzostw świata, były rekordzista globu na krótkim basenie, pięciokrotny olimpijczyk. W 2004 roku na igrzyskach olimpijskich w Atenach zdobył brązowy medal na dystansie 200 m stylem zmiennym. Jest synem (wcześniej Bishop), pochodzącej z Barbadosu lekkoatletki, która w wieku 16 lat zadebiutowała na Letnich Igrzyskach Olimpijskich 1972 w Monachium. Biegała na dystansie 400 m.Jego bratem jest , również pływak. (pl)\n\nGeorge Bovell III (Port of Spain, 18 luglio 1983) è un ex nuotatore trinidadiano. Ai Giochi della XXVIII Olimpiade del 2004, all' di Atene, ha vinto la medaglia di bronzo nei 200 m misti, dietro alla coppia statunitense formata da Michael Phelps, che in quella gara fece il record olimpico della disciplina, e Ryan Lochte, ma escludendo dal podio un futuro primatista del mondo, l'ungherese László Cseh. Tale medaglia è stata la dodicesima di Trinidad e Tobago ai Giochi, per lo Stato caraibico la prima nel nuoto in una competizione internazionale e l'unica della rassegna olimpica in tutte le discipline presenti a tali Giochi. Bovell ha anche fatto da portabandiera di Trinidad e Tobago alla cerimonia d'apertura dei ventesimi a Cartagena (Colombia). (it)\n\nGeorge Richard Lycott Bovell, född 18 juli 1983, är en trinidadisk simmare. Han har tävlat vid de olympiska spelen fem gånger och har ett brons på 200 meter medley från Aten 2004. (sv)\n\nGeorge Richard Lytcott Bovell III (Guelph, 18 de julho de 1983) é um nadador de Trindad e Tobago. Um dos principais nadadores do país conquistando medalhas importantes nos Jogos Pan-Americanos de 2003 em quatro modalidades, uma medalha nos Jogos Pan-Americanos de 2007, uma medalha nos Jogos Olímpicos de Verão de 2004 e medalhas nos Jogos Centro-Americanos e do Caribe. No Pan-Americano de 2007, Bovell foi o porta bandeira de sua delegação. (pt)\n\nДжо́рдж Ри́чард Ла́йкотт Бо́велл (англ. George Richard Lycott Bovell, род. 18 августа 1983 года, Порт-оф-Спейн) — тринидадский пловец. Участник четырёх Олимпийских игр, призёр Олимпийских игр и чемпионатов мира. (ru)\n\nДжордж Річард Лайкотт Бовелл (англ. George Richard Lycott Bovell, нар. 18 серпня 1983, Порт-оф-Спейн) — тринідадський плавець. Учасник чотирьох Олімпійських ігор, призер Олімпійських ігор і чемпіонатів світу. (uk)\n\n乔治·博弗尔三世（George Bovell III，1983年7月18日－），特立尼达和多巴哥游泳运动员。曾在2004年雅典奥运收获男子200米个人混合泳铜牌，这是特立尼达和多巴哥在奥运游泳项目上的首枚奖牌。 (zh)"}], "George Bovell III set a world record in the 50-meter freestyle.": [{"url": "https://ttaquatics.org/2022/02/08/george-bovell-iii-again-recognized-as-one-of-the-fastest-men-ever-by-swimswam-and-swimmingstats/", "page_content": "As we head to yet another CARIFTA Championships we remember one of our own the greatest sprinter of all time from the region the Legendary \" King\" George Bovell III of Trinidad and Tobago.\n\nHe is ranked as the seventh fastest man of all time in the 50 metre freestyle in the Olympic sized pool with his 2009 Rome World Championships blast of of 21.20.That time also stood as a Championship record\n\nHis speed is also unmatched in the region for the 25 yards pool and the 25 metre pool."}, {"url": "https://olympics.com/en/athletes/george-bovell-iii", "page_content": "Year of Birth\n\nYear of Birth 1983\n\nFirst Olympic Games\n\nFirst Olympic Games Sydney 2000\n\nTrinidad and Tobago\n\nTeam Trinidad and Tobago"}, {"url": "https://www.meppublishers.com/george-bovell-iii-outswims-old-olympic-record-but-ends-2008-run-without-medal/", "page_content": "25-year-old Trinidadian swimmer, George Bovell III, beat his own personal best and the Olympic record (at the time) for the 50m freestyle in his swims in the heat and semifinals. Bovell fell short of a berth in the finals after finishing sixth in his semifinal tonight, which was eventually won by Cesar Cielo Filho (21.34) of Brazil.\n\nEarlier this week, Bovell competed in the 100m freestyle semi-final, breaking the T&T national record, but did not qualify for the finals.\n\nDue to injury, Bovell was unable to compete in the event which won him a historic bronze medal in 2004: the 200m individual medley (IM). His 22-year-old younger brother, Nicholas, did compete in the 200m IM heats, clocking 2:03.90 and placing 36th overall. George clocked 1:58.80 in his medal-winning swim in Athens.\n\nIn a post on his Facebook Fan Page, George gave his take on his 2008 Olympic experience:\n\nThanks everyone so much for the support. I have swum out of my mind here best times and bettering the old olympic record which is something that I will cherish forever. It is crazy to think that I would have won any olympic in history with that time. Unfortunately times change and I am left with the opinion that this olympics is the greatest show in history and not the greatest sporting event.\n\nMeanwhile, Trinidad & Tobago’s medal hopes continue tonight and tomorrow as Olympic Track and Field events commence."}, {"url": "https://www.3wiresports.com/articles/tag/George+Bovell", "page_content": "BARCELONA -- If the men's 100 freestyle is the equivalent of a heavyweight fight, the 50 free is completely damn simple to understand. One lap. Raw power and speed. First one to the other side is the man. Thirteen years ago, two Americans, Anthony Ervin and Gary Hall Jr., tied for the gold medal at the Sydney Olympics in the 50 free, in a time of 21.8 seconds.\n\nIn what may have been the most loaded 50 free field ever, Brazil's Cesar's Cielo rocked it Saturday night at the Palau Sant Jordi in 21.32 seconds. Afterward, he cried -- and cried -- on the medals stand, the tears redemption after knee surgery and validation of his standing as one of the all-time sprint greats. The crowd roared.\n\nThe time, the field, the race, all of it underscored how swimming keeps getting better and better. Indeed, this 50 free produced a new star, Russia's Vlad Morozov, who won silver, in 21.47, even as it re-charged the career of one of the sport's leading lights, George Bovell of Trinidad & Tobago, who won bronze in 21.51, the island nation's first-ever world-championships medal.\n\nThe 50 free highlighted a day and night of extraordinary racing.\n\nAmerican Katie Ledecky, for instance, set another world-record, her second here, in winning the women's 800, in 8:13.86. She is so good that runner-up Lotte Friis of Denmark applauded as Ledecky got out of the pool.\n\nLedecky's 800 marked her fourth gold here in Barcelona. She also won the 400, 1500 and took part in the 4x200 relay. She took six seconds off the world-record in the 1500. Her 400 time was an American record.\n\nWhen she gets home, she hopes to get her driver's license.\n\n\"I am thrilled,\" she said. \"I exceeded my expectations for this year.\"\n\nHer roommate at these worlds, Simone Manuel, who turned 17 on Friday, grabbed the final spot in the women's 50 free final Sunday by swimming 24.91; she is the first 18-and-under swimmer in U.S. history to break 25 seconds.\n\nMissy Franklin won her fifth gold medal Saturday, in the 200 backstroke, her signature event, in 2:04.76. She is the first woman since Australia's Libby Trickett to win five gold medals at a world championships, and swims Sunday in the medley relay for a sixth.\n\nNo female swimmer has ever won six gold medals at a world championships. Franklin could join Michael Phelps, Mark Spitz and Kristin Otto of East Germany as the only swimmers to win as many as six golds at the worlds or the Olympics. Otto won six golds at the 1988 Seoul Games.\n\nAsked about six, Franklin said it would \"mean so much to me\" but cautioned about the medley, \"Like every single race here, we are going to have very tough competition.\"\n\nIn the morning heats, Russia's Yulia Efimova set a world record in the women's 50 breaststroke, 29.78. The record lasted until the evening -- when Lithuania's Ruta Meilutyte went 29.48 in the semifinals.\n\nThe world records in the women's 50, 100 and 200 have all fallen at these 2013 championships -- stunning, because the plastic suits from 2008-09 were said to have helped the breaststroke most of all. The women's 50 breaststroke final is set for Sunday evening.\n\nRyan Lochte, the day after winning two medals and setting a personal best in the 100 fly semifinals, finished sixth in the men's 100 fly. South Africa's Chad le Clos, closing in the second lap just the way Phelps used to, won in 51.06.\n\n\"I don't know if it had an effect, the triple last night, but I just didn't have it,\" Lochte said.\n\nCielo for sure had it.\n\nHe won his third straight world championships title in the 50 free -- this despite surgery on both knees after the Olympics, and not even racing the 100 free.\n\nThe eight lanes of this 50 free final held three Olympic champions: Ervin, from 2000; Cielo, 2008; France's Florent Manaudou, 2012.\n\nAll eight guys had an Olympic medal. In all, there were 14 medals among the group -- seven gold, four silver, four bronze. Five of the eight had an individual medal.\n\nTo illustrate how the race has developed -- owing to advances in strength-training, straight-arm freestyle technique, a change in the racing blocks themselves and other factors -- Ervin finished Saturday in 21.65.\n\nHe took sixth.\n\n\"It happens,\" he said, adding, \"I just felt incredible yesterday. Things were a little bit apart from that when I was going through my routine today. So, you know, I don't attribute it to much other than things didn't line up perfectly. I didn't get the strike. I got the spare. Whatever.\"\n\nNathan Adrian, the London 100 gold medalist, finished fourth, in 21.6.\n\nHe said, \"21.6 would medal at most international competitions but the 50 was really fast this year,\" adding, \"I have been saying this all week: training has become so specific for every single event. Vlad and I were the only ones who swam the 100 and the 50. Look at the results from 2000, and that's not going to be the same. It has become so specific. The more you specialize, the better you can become at any particular event.\"\n\nIn the semis, Manaudou had gone 21.37. He looked like the man to beat.\n\nInstead, the race was all about Lanes 6, 7 and 8 -- Cielo, Morozov and Bovell.\n\nCielo had gone 21.76 in the prelims, then 21.6 in the semis.\n\nBut, as Cielo said late Saturday, there's a big difference between swimming the 50 and sprinting the 50. He reminded himself to swim \"fast and long, fast and long,\" and that's what he did, keeping his head down. his stroke long: \"When I saw the scoreboard, I was ecstatic. I had no idea where I was.\"\n\nMorozov, 21, moved to Southern California from Siberia when he was 14. He ripped up the NCAA championships this year swimming for USC, taking down no less than Cielo's record in the 100-yard sprint, then turned pro. He turned in a 47.62 in the 100 at the Summer University Games a few weeks back.\n\nHere, in the 100, he went out in the first 50 in 21.94 -- the first sub-22 split, ever, in any major international final. He finished fifth, in 48.01. \"I wish I didn't go out as fast,\" he said ruefully.\n\nIn the 50 prelims, he went 21.95. The semis, 21.63.\n\nIn this race, there was no back half to worry about. Just 50 meters.\n\nMorozov's 21.47 is a new national record -- beating the mark he set in the semis. He set it in front of Alex Popov, the former Russian sprint star -- who gave out the medals Saturday night.\n\n\"I'm really stoked with these medals,\" Morozov said, proving that seven years in SoCal is plenty long enough to learn to talk like a native. He also won a bronze medal as part of the 4x100 relay.\n\nMorozov, noting that this was his first long-course championships at which he was swimming individual events, added a moment later, \"To come here and get a silver medal already with guys who were in my heat -- they were already Olympic champions, world champions … I am really stoked with that. In 2016 I will do my best so that no one will be close to me.\"\n\nSprinters, it must be noted, do not as a general rule lack for confidence.\n\n\"He's going to give us a lot of trouble in the next years,\" Cielo said of Morozov, smiling.\n\nBovell, meanwhile, won a bronze medal in the 200 IM -- behind Phelps and Lochte -- in Athens in 2004. After that, he hurt his knee and could no longer swim the breaststroke.\n\nHe re-made himself into a sprinter. He turned 30 two weeks ago and, as he said, \"To be honest, when you get to be my age, there is some pressure to grow up, so to speak.\" A trip to these worlds without a medal, he said, would have put pressure on him to stop swimming competitively.\n\nNow, he said, he intends to keep on through Rio. \"I love swimming,\" he said. \"I did not want to give it up.\""}, {"url": "https://swimswam.com/george-bovell-lowers-50-breast-national-record-at-belgian-open-championships/", "page_content": "The 2015 Belgian Open Championships are underway in Antwerp, Belgium, and Trinidad & Tobago’s George Bovell is making head lines.\n\nThe 31 year old is currently training in Italy and it is paying off. He qualified second in the men’s 5o breaststroke yesterday, breaking the Trinidad & Tobago national record with his time of 28.10. He set the previous record in 2013 at 28.22. Ioannis Karpouzlis of Greece earned the top seed in the event with his time of 27.36.\n\nLater in finals, Bovell lowered his record again, breaking 28 for the first time with a 27.69. Karpouzlis wasn’t as fast as he was during prelims, but he did win the event with a final time of 27.61.\n\nTo view full results from the first day of the meet, click here."}, {"url": "https://wiki2.org/en/George_Bovell", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nTrinidad and Tobago swimmer\n\nGeorge Richard Lycott Bovell (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago. Bovell is also a two-time World Championship bronze medalist.\n\nYouTube Encyclopedic\n\n1 / 5 Views: 7 488 24 782 595 1 144 587\n\nFina/Arena Swimming World Cup 2012 Singapore Men's 100m Individual Medley\n\n2012 Fina/Arena Swimming World Cup Berlin Men's 100m Individual Medley\n\nNSATTGeorge BovellIII\n\nGeorge Bovell (T&T) returns home after FINA World Championships\n\nGeorge Bovell discusses the 200 IM from 2004 Athens Olympics Transcription\n\nOlympic career\n\nGeorge Bovell represented Trinidad and Tobago at the 2000, 2004, 2008, 2012, and 2016 Olympics. At the 2004 Olympics, he won a bronze medal in the men's 200 IM: the 9th medalist in the country's history and 12th medal overall.[7]\n\nWorld Championships\n\nIn 2013 Bovell won the bronze medal in the 50m freestyle at the FINA World Long Course Championships in Barcelona. His Bronze Medal time of 21.51 seconds would have won the silver in the London Olympic Final a year earlier.[citation needed]\n\nIn 2012 Bovell won the bronze medal in the 100m Individual Medley at the Fina World Short Course Championships in Istanbul.[citation needed]\n\nBovell has been in 10 World Championship finals since 2001.[citation needed]\n\nMain Events\n\nYear Event Race Position 2000 Summer Olympics 50m Freestyle Heats 2000 Summer Olympics 200m Ind Medley Heats 2000 Summer Olympics 400m Ind Medley Heats 2001 World Championship 200m Freestyle Heats 2001 World Championship 200m Ind Medley Finals 4th 2001 World Championship 400m Ind Medley Heats 2002 Short Course World Championship 200m Freestyle Semifinal 2002 Short Course World Championship 100m Ind Medley Semifinal 2002 Short Course World Championship 200m Ind Medley 7° 2003 World Championship 200m Freestyle Semifinal 2003 World Championship 200m Ind Medley 5° 2004 Summer Olympics 100m Freestyle Semifinal 2004 Summer Olympics 200m Freestyle Semifinal 2004 Summer Olympics 200m Ind Medley 2006 Pan Pacific Championship 50m Freestyle 8° 2006 Pan Pacific Championship 100m Freestyle B Final 2007 World Championship 50m Freestyle Heats 2007 World Championship 100m Freestyle Heats 2008 Summer Olympics 50m Freestyle Semifinal 2008 Summer Olympics 100m Freestyle Heats 2008 Short Course World Championship 50m Freestyle Semifinal 2008 Short Course World Championship 100m Ind Medley 8° 2009 World Championship 50m Freestyle Finals 7th 2009 World Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Freestyle B Final 2010 Pan Pacific Championship 100m Freestyle Heats 2010 Pan Pacific Championship 50m Backstroke B Final 2010 Short Course World Championship 50m Freestyle Semifinal 2010 Short Course World Championship 100m Ind Medley 4° 2011 World Championship 50m Freestyle 7° 2012 Summer Olympics 50m Freestyle 7° 2012 Summer Olympics 100m Backstroke Heats 2012 Short Course World Championship 50m Freestyle 4° 2012 Short Course World Championship 100m Ind Medley 2013 World Championship 50m Freestyle\n\nReferences"}, {"url": "https://pantheon.world/profile/person/George_Bovell/", "page_content": "George Bovell\n\nGeorge Richard Lycott Bovell (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of George Bovell has received more than 98,024 page views. His biography is available in 18 different languages on Wikipedia . George Bovell is the 18,687th most popular politician (down from 15,599th in 2019), the 1,297th most popular biography from Canada (down from 54th in 2019) and the 91st most popular Canadian Politician."}, {"url": "https://nypost.com/2012/08/02/ervin-jones-compete-in-50-meter-freestyle-preliminaries/", "page_content": "LONDON — George Bovell of Trinidad and Tobago qualified fastest in the 50-meter freestyle preliminaries at the London Olympics on Thursday, with defending champion Cesar Cielo of Brazil right behind.\n\nBovell touched in 21.77 seconds to win the sixth of eight heats in swimming’s glamour event. The 29-year-old four-time Olympian is solely focused on the 50 at these games after winning his country’s first swimming medal at the 2004 Athens Olympics in the 200 individual medley. The former Auburn swimmer once owned the 200 IM world record.\n\nCielo finished the furious one-lap sprint in 21.80, with teammate Bruno Fratus third at 21.82. Cielo had a quick turnaround after finishing sixth in the 100 free a night earlier.\n\nPOST’S OLYMPIC COVERAGE\n\n“It was hard to sleep last night after the race because the final was so late,” Cielo said. “This morning I was more concerned about making enough of an effort to get back. It’s a matter of resting now to make sure I get a spot in the final.”\n\nAnthony Ervin of the U.S. was fourth at 21.83 in his return to the Olympics after a 12-year absence. He tied American Gary Hall Jr. for the gold at the 2000 Sydney Games before leaving the sport. He traveled, promoted concerts, played guitar in a band and taught swimming lessons to pay his bills. He sold his gold for $17,100 to help victims of the Indian Ocean tsunami.\n\n“I definitely had some first-race jitters,” Ervin said. “It didn’t feel like that was everything coming together, so hopefully I can make that happen in the next two swims.”\n\nHe still had his warmups on when his rivals had taken theirs off and were waiting behind the blocks.\n\n“I felt like I was a little rushed,” Ervin said. “When they blew the whistle I was still taking off my shoes. I was like, ‘Ahhhh.’ Twelve years ago was a long time ago. Maybe it’s the same kind of venue, working within the same kind of institution, but I have grown a lot over the last 12 years.”\n\nErvin trains at California with 100 free champion Nathan Adrian, who out-touched James “The Missile” Magnussen of Australia for the gold on Wednesday. Adrian didn’t qualify for the 50 at the U.S. trials.\n\n“Nathan just dug in. He was like ‘Uhhh!'” Ervin said. “He just wanted it. He fought for it in that last stroke. He took it.”\n\nMagnussen, who settled for silver, moved on to the evening semifinals in 10th at 22.11 after a sleepless night thinking about how close he came to winning Australia’s first swimming gold of these games.\n\n“The last thing I wanted to do was to get up and swim again,” he said. “I don’t think I’ve really had the chance to come to grips with it yet.”\n\nTeammate Eamon Sullivan, the 2008 silver medalist in the 100 free, claimed the 16th and last spot for the semis.\n\n“I just lost it on the start, which is probably the most crucial part of the race in the 50,” he said. “I’ve been swimming great in the warmup so I was expecting to go faster than that.”\n\nBrent Hayden, who won Canada’s first medal in the 100 free with a bronze, was 13th-quickest in the 50.\n\nRoland Schoeman of South Africa, the 2004 bronze medalist in the 50, qualified fifth at 21.91. The 32-year-old sprinter was the oldest of the 16 semifinalists.\n\nCullen Jones of the U.S. also moved on. He was sixth at 21.95 in pursuit of his first individual Olympic medal after failing to make the 100 free final.\n\n“I hate swimming in the morning, but I’m going to be ready for tonight,” he said."}, {"url": "https://auburntigers.com/news/2004/8/19/Bovell_Wins_Bronze_Medal_in_200m_IM_at_2004_Olympics.aspx", "page_content": "Bovell Wins Bronze Medal in 200m IM at 2004 Olympics\n\nAug. 19, 2004\n\nGeorge Bovell\n\nATHENS, Greece -- George Bovell captured a bronze medal in the men's 200-meter individual medley at the XXVIII Olympic Games on Thursday night as the Trinidad and Tobago native clocked a 1:58.80.\n\n\"I dived in and felt my stroke fly,\" Bovell said afterward. \"I felt it would be an easy, smooth race. I had doubts in the backstroke, but I pushed through the pain and just looked to bring it home.\"\n\nBovell's leadoff butterfly stroke was a 26.22, which put him in sixth at the first turn. He then turned over to clock a 29.94 in the backstroke, which moved him into third behind eventual gold-medalist and world record holder Michael Phelps of the United States and silver-medalist Ryan Lochte, also an American.\n\nWith 100-meter to go, Bovell registered a 33.95 in the breaststroke leg, the best split in the field, before clocking a 28.64 to out-touch Laszlo Cseh of Hungary by .04 seconds.\n\n\"George did this in a meet where he was struggling. He wasn't performing up to his or our (the Auburn coaches) standards up to this point,\" Auburn coach David Marsh said. \"But he stepped up tonight and got the job done. He was fighting tooth and nail with Cseh and was able to out-touch him at the wall.\"\n\n\"I hope this success will improve swimming in Trinidad and Tobago and I hope it will encourage the government to improve the swimming facilities,\" Bovell said.\n\nThe medal is Trinidad and Tobago's first in international swimming competition.\n\n\"George is really relieved right now,\" Marsh said. \"The weight that he and his nation put on his shoulders is now gone.\"\n\nJust prior to his swim, the contingent of Auburn swimmers and divers in Athens surrounded Bovell and reminded him to think like it was a SEC or NCAA meet and that he was in Athens as a part of the Auburn team.\n\nPhelps won the event with an Olympic record time of 1:57.14 while Lochte took the silver with a 1:58.78.\n\nAlso on Thursday, Kirsty Coventry and Margaret Hoelzer advanced into the finals of the women's 200-meter backstroke. Coventry, who has already captured two medals at the Olympics, is seeded second with a time if 2:10.04 while Hoelzer is fifth with a 2:11.68.\n\n\"Yesterday, I had a rest day and tonight I just wanted to go out and have fun,\" Coventry said.\n\nShould Coventry win a medal in Friday's finals, she we join Rowdy Gaines as the only Auburn swimmers to ever capture three medals at a single Olympics.\n\nCoventry and Hoelzer had qualified third and fourth, respectively, in the prelims going 2:12.49 and 2:12.55, respectively.\n\n\"I'm like everyone else here, I want to win a gold medal,\" Hoelzer said. Everything is going to plan so far, so I'm OK.\"\n\nAlso moving onto a Friday night final was former Tiger and Australian native Brett Hawke, who holds the second-best time coming out of the semi-finals of the men's 50-meter freestyle with a new Australian record of 22.07. He had qualified for the semis with a 22.42, which placed him tenth.\n\n\"I wanted to come here it and make it to the final, so I'm very happy,\" Hawke said.\n\nCurrent Tiger Fred Bousquet failed to make the finals of the 50m free as his 22.29 in the semis was only 12th-best, that after qualifying second in the prelims with a 22.24.\n\n\"I'm not sad, I'm just disappointed,\" Bousquet said. \"This was one of the fastest 50m (freestyle races) in history. There is just something small missing.\"\n\nBousquet also swam in the prelims of the 100-meter butterfly, clocking a 53.63 to place 25th.\n\nThe individual qualifying will come to an end on Friday. Panamanian Eileen Coparropa will swim the women's 50-meter freestyle while Romain Barnier and Bousquet, both of France, and Matt Kidd of England are all scheduled to swim the prelims of the men's 4x100-meter medley relay. The prelims will be shown from 11:30 a.m. * 3 p.m. CT on NBC while the semi-finals and finals will be shown from 7-11 p.m.\n\n2004 Olympic Swimming * Auburn Finishes\n\nMen's 50-meter Freestyle * prelims\n\n2. Fred Bousquet 22.24\n\n10. Brett Hawke 22.42\n\nMen's 100-meter Butterfly * prelims\n\n25. Fred Bousquet 53.63\n\nWomen's 200-meter Backstroke * prelims\n\n3. Kirsty Coventry 2:12.49\n\n4. Margaret Hoelzer 2:12.55\n\nMen's 50-meter Freestyle * semi-finals\n\n2. Brett Hawke 22.07\n\n12. Fred Bousquet 22.29\n\nMen's 200-meter Individual Medley * finals\n\n3. George Bovell 1:58.80\n\nWomen's 200-meter Backstroke * semi-finals\n\n2. Kirsty Coventry 2:10.04\n\n5. Margaret Hoelzer 2:11.68"}, {"url": "https://www.famousbirthdays.com/people/george-bovell.html", "page_content": "About\n\nSwimmer who won Trinidad and Tobago's first Olympic swimming medal when he took bronze at the 2004 games in the 200M individual medley.\n\nBefore Fame\n\nHe attended Auburn University, where he set a school record earning 25 All-American honors.\n\nTrivia\n\nOn March 25, 2004, he set a 200M IM world record, which lasted for more than a year and a half.\n\nFamily Life\n\nHis brother, Nicholas Bovell, also competed at the 2008 Olympics.\n\nAssociated With\n\nWhen he won bronze at the 2004 Olympics, he finished behind silver-medalist Ryan Lochte, and gold-medalist Michael Phelps."}]}