{"George Bovell III won a bronze medal in the 200-meter individual medley at the 2004 Summer Olympics in Athens, Greece.": [{"url": "https://auburntigers.com/news/2004/8/19/Bovell_Wins_Bronze_Medal_in_200m_IM_at_2004_Olympics.aspx", "page_content": "Bovell Wins Bronze Medal in 200m IM at 2004 Olympics\n\nAug. 19, 2004\n\nGeorge Bovell\n\nATHENS, Greece -- George Bovell captured a bronze medal in the men's 200-meter individual medley at the XXVIII Olympic Games on Thursday night as the Trinidad and Tobago native clocked a 1:58.80.\n\n\"I dived in and felt my stroke fly,\" Bovell said afterward. \"I felt it would be an easy, smooth race. I had doubts in the backstroke, but I pushed through the pain and just looked to bring it home.\"\n\nBovell's leadoff butterfly stroke was a 26.22, which put him in sixth at the first turn. He then turned over to clock a 29.94 in the backstroke, which moved him into third behind eventual gold-medalist and world record holder Michael Phelps of the United States and silver-medalist Ryan Lochte, also an American.\n\nWith 100-meter to go, Bovell registered a 33.95 in the breaststroke leg, the best split in the field, before clocking a 28.64 to out-touch Laszlo Cseh of Hungary by .04 seconds.\n\n\"George did this in a meet where he was struggling. He wasn't performing up to his or our (the Auburn coaches) standards up to this point,\" Auburn coach David Marsh said. \"But he stepped up tonight and got the job done. He was fighting tooth and nail with Cseh and was able to out-touch him at the wall.\"\n\n\"I hope this success will improve swimming in Trinidad and Tobago and I hope it will encourage the government to improve the swimming facilities,\" Bovell said.\n\nThe medal is Trinidad and Tobago's first in international swimming competition.\n\n\"George is really relieved right now,\" Marsh said. \"The weight that he and his nation put on his shoulders is now gone.\"\n\nJust prior to his swim, the contingent of Auburn swimmers and divers in Athens surrounded Bovell and reminded him to think like it was a SEC or NCAA meet and that he was in Athens as a part of the Auburn team.\n\nPhelps won the event with an Olympic record time of 1:57.14 while Lochte took the silver with a 1:58.78.\n\nAlso on Thursday, Kirsty Coventry and Margaret Hoelzer advanced into the finals of the women's 200-meter backstroke. Coventry, who has already captured two medals at the Olympics, is seeded second with a time if 2:10.04 while Hoelzer is fifth with a 2:11.68.\n\n\"Yesterday, I had a rest day and tonight I just wanted to go out and have fun,\" Coventry said.\n\nShould Coventry win a medal in Friday's finals, she we join Rowdy Gaines as the only Auburn swimmers to ever capture three medals at a single Olympics.\n\nCoventry and Hoelzer had qualified third and fourth, respectively, in the prelims going 2:12.49 and 2:12.55, respectively.\n\n\"I'm like everyone else here, I want to win a gold medal,\" Hoelzer said. Everything is going to plan so far, so I'm OK.\"\n\nAlso moving onto a Friday night final was former Tiger and Australian native Brett Hawke, who holds the second-best time coming out of the semi-finals of the men's 50-meter freestyle with a new Australian record of 22.07. He had qualified for the semis with a 22.42, which placed him tenth.\n\n\"I wanted to come here it and make it to the final, so I'm very happy,\" Hawke said.\n\nCurrent Tiger Fred Bousquet failed to make the finals of the 50m free as his 22.29 in the semis was only 12th-best, that after qualifying second in the prelims with a 22.24.\n\n\"I'm not sad, I'm just disappointed,\" Bousquet said. \"This was one of the fastest 50m (freestyle races) in history. There is just something small missing.\"\n\nBousquet also swam in the prelims of the 100-meter butterfly, clocking a 53.63 to place 25th.\n\nThe individual qualifying will come to an end on Friday. Panamanian Eileen Coparropa will swim the women's 50-meter freestyle while Romain Barnier and Bousquet, both of France, and Matt Kidd of England are all scheduled to swim the prelims of the men's 4x100-meter medley relay. The prelims will be shown from 11:30 a.m. * 3 p.m. CT on NBC while the semi-finals and finals will be shown from 7-11 p.m.\n\n2004 Olympic Swimming * Auburn Finishes\n\nMen's 50-meter Freestyle * prelims\n\n2. Fred Bousquet 22.24\n\n10. Brett Hawke 22.42\n\nMen's 100-meter Butterfly * prelims\n\n25. Fred Bousquet 53.63\n\nWomen's 200-meter Backstroke * prelims\n\n3. Kirsty Coventry 2:12.49\n\n4. Margaret Hoelzer 2:12.55\n\nMen's 50-meter Freestyle * semi-finals\n\n2. Brett Hawke 22.07\n\n12. Fred Bousquet 22.29\n\nMen's 200-meter Individual Medley * finals\n\n3. George Bovell 1:58.80\n\nWomen's 200-meter Backstroke * semi-finals\n\n2. Kirsty Coventry 2:10.04\n\n5. Margaret Hoelzer 2:11.68"}, {"url": "https://newsday.co.tt/2022/07/07/a-celebration-of-trinidad-and-tobagos-olympic-medallists/", "page_content": "A celebration of Trinidad and Tobago’s Olympic medallists\n\nTrinidad and Tobago's Keshorn Walcott competes to win the gold medal in the men's javelin throw final at the athletics event of the 2012 Olympic Games on August 11, 2012 in London, England. (AFP PHOTO) -\n\nTRINIDAD AND Tobago have made their mark on the Olympic stage, bringing joy to the people of this country. Weightlifter Rodney Wilkes got the ball rolling at the 1948 London Games which was followed by some memorable performances. Sprinter Hasely Crawford, javelin thrower Keshorn Walcott and a men’s 4x100-metre team all reached the top of the podium and the efforts of swimmer George Bovell and sprinter Ato Boldon will never be forgotten.\n\nOn Tuesday, TT added a third gold medal to this country’s tally as the men’s 4x100m relay team were upgraded to gold, 14 years after earning a silver medal at the 2008 Beijing Olympics.\n\nThis reporter takes a look back at the 19 medals (three gold, five silver and 11 bronze) this country won in the history of the Olympic Games.\n\nTT have picked up medals in three sports at the Olympics – track and field, weightlifting and swimming.\n\nGOLD\n\nCrawford won TT’s first gold medal at the 1976 Montreal Games.\n\nCrawford had stiff competition heading into the Games as the event included 1972 gold medallist Valeriy Borzov of Soviet Union and the highly favoured Donald Quarrie of Jamaica.\n\nIn the second semifinal, Crawford sealed a place in the final by winning in 10.22 seconds. Quarrie was second in 10.26.\n\nIn the final, Crawford became a household name in TT when crossed the finish line in 10.06. Quarrie was second in 10.08 and Borzov had to settle for bronze in 10.14.\n\nAt the 2008 Beijing Olympics, Jamaica won the men’s 4x100m event, led by legendary sprinter Usain Bolt.\n\nJamaica won the event in 37.10 in a then Olympic and world record.\n\nTT finished second in 38.06.\n\nHowever, in 2017, the International Olympic Committee revealed that Jamaica team member Nesta Carter had violated the anti-doping code by testing positive for methylhexaneamine. Jamaica were disqualified and TT were announced as the new winners.\n\nThe TT team of Richard Thompson, Marc Burns, Keston Bledman, Emmanuel Callender and Aaron Armstrong received their medals in a short Olympic medal reallocation ceremony at the Olympic Museum in Lausanne, Switzerland, on Tuesday.\n\nNot much was expected of Walcott heading into the 2012 London Games. By the end of the Games, Walcott was considered one of this country’s greatest Olympians.\n\nWalcott, only 19 at the time, was still a national junior athlete.\n\nIn the qualifying round, he sealed a place in the final by throwing 81.75m on his third and final throw. Walcott had the tenth best throw among the 12 finalists.\n\nIn the final, Walcott broke the national record with a throw of 84.58m to cop gold.\n\nIt was Walcott’s day as Vitezslav Vesely of Czech Republic, who threw a massive 88.34m in the qualifying round, could only manage an 83.34m throw in the final to snatch bronze.\n\nAntti Ruuskanen of Finland took silver with an 84.12m effort.\n\nSILVER\n\nTT made their Olympic debut at the 1948 London Games with five athletes.\n\nWeightlifter Wilkes became this country’s first Olympic medallist after finishing second in the men’s featherweight.\n\nWilkes, nicknamed the Mighty Midget, died in 2014 at age 89.\n\nWendell Mottley was one of many formidable 400m runners this country produced in the 1960s. At the 1964 Tokyo Olympics, Mottley grabbed a silver medal in the men’s 400m event. It was a memorable Games for TT as it was the first Olympics that this country claimed medals in track and field.\n\nTT had to wait 36 years before earning another silver medal. During the 2000 Sydney Games, TT fans had to set their alarms to wake up in the wee hours of the morning to watch Ato Boldon in action because of the 14-hour time difference.\n\nIt was worth it in the end as Boldon finished second in the men’s 100m event. From the mid 1990s to early 2000s TT’s track and field medal hopes relied almost entirely on Boldon’s shoulders.\n\nBoldon inspired a new wave of sprinters and at the 2008 Beijing Games, Richard Thompson announced himself.\n\nThompson was in the form of his life heading into the Beijing Games.\n\nRunning for Louisiana State University, Thompson won the NCAA Men's Outdoor Track Athlete of the Year award and the SEC Men's Outdoor Track Athlete of the Year award.\n\nThompson copped silver in the men’s 100m final behind Bolt, who set a world record of 9.69.\n\nFour years later at the 2012 London Olympics, the quartet of Thompson, Bledman, Callender and Burns took silver in the men’s 4x100m event. It was the most successful Olympics for TT as the team left London with four medals.\n\nBRONZE\n\nEleven of TT’s 19 medals are bronze with Wilkes grabbing the first one at the 1952 Helsinki Games. Following up his silver medal four years earlier, Wilkes took bronze in the men’s featherweight.\n\nWilkes was not the only TT weightlifter to earn a medal at the games as Lennox Kilgour was third in the men’s middle-heavyweight division.\n\nAt the 1964 Tokyo Games, Edwin Roberts became the first TT track and field athlete to cop a sprint medal with his bronze in the men’s 200m event.\n\nRoberts was joined by Mottley, Kent Bernard and Edwin Skinner in the men’s 4x400m race. They did not leave empty-handed, ending third.\n\nIt was a dry period for TT between 1964 and 1996 as during that time Crawford’s gold medal in 1976 was the lone podium finish.\n\nAt the 1996 Atlanta Olympics, Boldon ended TT’s drought by copping bronze medals in both the 100m and 200m.\n\nThe 100m final was drama-filled. Linford Christie of Great Britain, the former Olympic champion, false started to add more tension to the race.\n\nBoldon then false started and on the third attempt to start the race Christie false started again and was disqualified.\n\nChristie was reluctant to leave the track but, when he eventually left, the race began.\n\nBoldon led at the 60m mark, but Frankie Fredericks of Namibia and Donovan Bailey of Canada surged to the front. Bailey grabbed gold in a new world record of 9.84, Fredericks was second in 9.89 and Boldon had to settle for bronze in 9.90.\n\nIn the men’s 200m final, Boldon copped his second bronze medal of the Games when he stopped the clock in 19.80.\n\nAmerican Michael Johnson broke the world record on his way to gold in 19.32 and Fredericks was second in 19.68.\n\nBoldon snatched his third bronze medal of his illustrious Olympic career in the men’s 200m event at the 2000 Sydney Games.\n\nBovell was the next athlete to get bronze for TT becoming the first swimmer to earn an Olympic medal at the 2004 Athens Games. A few TT swimmers competed at the Olympics before Bovell.\n\nBovell’s achievement was celebrated as it was TT’s only medal at the 2004 Games.\n\nBovell, competing in the men’s 200m individual medley, touched the wall in one minute, 58.80 seconds (1:58.80) in a new national record.\n\nAmerican swim legend Michael Phelps won in an Olympic record of 1:57.14 and countryman Ryan Lochte was second in 1:58.78.\n\nAt the 2012 London Games, TT, as they did in 1964, showed their prowess in the men’s 400m event.\n\nLalonde Gordon earned bronze in the men’s 400m event and the men’s 4x400m team also took bronze. The TT relay contingent included Gordon, the late Deon Lendore, Jarrin Solomon, Renny Quow, Machel Cedenio and Ade Alleyne-Forte.\n\nTT could not continue their prolific form at the 2016 Rio Olympics as a bronze medal by Walcott in the closing stages of the meet was the only medal earned. It was his second medal after winning gold four years earlier."}, {"url": "https://newsday.co.tt/2020/04/14/olympics-not-life-or-death/", "page_content": "Olympics not life or death\n\nIn this Aug 19,2004 file photo, TT’s George Bovell adjusts his crown after winning the men’s 200m individual medley bronze medal, at the 2004 Olympic Games at the Olympic Aquatic Center in Athens. AFP PHOTO -\n\nOLYMPIC 2004 bronze medallist George Bovell III feels sorry for the athletes who had to delay either their 2020 Tokyo Olympics dreams or participation by a year, due to the coronavirus pandemic.\n\nHowever, the 36-year-old legendary swimmer made it clear that this episode can be a reality check for a number of athletes since there is more to life than the Olympics.\n\nThe Tokyo Games, which were originally carded from July 24 to August 9, 2020, will now take place from July 23 to August 8, 2021.\n\nBovell III finished third in the men’s 200-metre individual medley at the Athens Olympics, becoming the lone TT Olympic swimming medallist.\n\nDuring a recent interview, Bovell III, who competed in five Olympics (2000 in Melbourne, Australia; 2004; 2008 in Beijing, China; 2012 in London, England and 2016 in Rio de Janeiro, Brazil), said, “It’s very unfortunate. I feel sorry for all those athletes who sacrificed so much, trained so hard and some of them who take on lots of debts and spend years after the Olympics paying off.\n\n“It’s very sad to see their hopes and dreams crushed like that, and have to postpone everything by a year.\n\nHowever, Bovell III said, “A lot of athletes after the Olympics, experience something called ‘post-Olympics depression’. It’s where after the Olympics, they’re lost, they don’t know what to do next. They cannot even see beyond the Olympics.\n\n“They’re not even living in reality. They’re living in illusions, this kind of collective psychosis as Olympics being the most important thing in the universe. I think this is a reality check. If you fail to live with reality, reality would come and live with you, and you’re not ready for it.”\n\nThe former men’s 200m IM short-course world record holder added, “I think this, for a lot of athletes who have very unhappy lifestyles, mentally unhealthy, very unhappy people, it puts things in perspective. The Olympics is not life or death, it’s just sports and something (we) do because (we) love it. If you need to (get) a medal in the Olympics to prove that you are a champion, if you need that external validation then, deep down inside, you are a loser.\n\n“If you are secure with yourself, you understand who you are and you understand your limitations, you wouldn’t need any external validation. You don’t need anybody else to tell you you’re great. There are a lot of Olympic gold medallists who, deep down inside, still feel like losers.”\n\nBovell III, who was inducted into the First Citizens Sports Foundation’s Hall of Fame on Sunday, continued, “You need to be secure with yourself and say are you really doing it for the Olympic status and can show off on social media, because that is a big illusion, or are you doing it because you love it, because it’s a path to self-mastery.\n\n“When you control your mind, you control how you think, you have control over yourself. Instead of your environment and your life dictating how you should feel, you choose how you should feel.”"}, {"url": "https://panamericanworld.com/en/magazine/sports/ten-sports-legends-in-trinidad-tobago/", "page_content": "Trinidad & Tobago is a small Caribbean country, but its sports talent is huge. Cricket is the most popular sport in the country and that is why Brian “Prince” Lara is described as a local legend; although this nation’s most outstanding results in international events have delivered by athletics. Who have been the best Trinitarian athletes of all time?\n\nDWIGHT YORKE\n\nThe best moment for one of Trinidad & Tobago’s collective sports was lived back in 2005, when the national soccer team qualified for FIFA World Cup, organized by Germany in 2006. Dwight Yorke was one of the main stars in that team and the most successful Trinitarian soccer player of all time.\n\nHe began his career with Aston Villa club, from the British Premier League, where he scored 97 goals in 231 games. He later took a quality jump by signing with Manchester United, which was managed by Sir Alex Fergusson.\n\nDuring the time he spent playing with 4 clubs, Dwight Yorke conquered 9 titles, 6 with “The Red Devils”, including three leagues, one FA Cup and one Champions. Yorke wore Trinidad & Tobago’s uniform 72 times and scored 19 goals, won a Caribbean Cup in 1989, and was the captain of the team in the 2006 World Championship.\n\nRelated Article: The 10 Best Colombian Athletes of All Time\n\nBRIAN “PRINCE” LARA\n\nCricket is the most popular sport in Trinidad & Tobago and, among all players born in that country, Brian Lara has been the most acclaimed athlete, also called the “Prince of Port of Spain”. This great athlete, who is already retired, has been labeled as one of the finest batsmen of all time. He holds a record with the highest number of runs scored, both in Test and First Class game: 501, in 1994. Lara is one of the three cricket players that have been given the Foreign Figure of the Year award by BBC and, in 2012, he was included in the cricket Hall of Fame.\n\nATO BOLDON\n\nAto Boldon is the Trinitarian athlete that has won the highest number of medals in Olympic Games, one of the most outstanding Caribbean sprinters in the 1990s, who was on the podium four times in two editions of these Games.\n\nIn Atlanta Games, back in 1996, he finished third in 100-200 meter dash. Four years later, in Sidney, he conquered the silver medal in 100 meter dash, only surpassed by U.S. Maurice Greene, and he repeated the bronze in 200 meter dash. As for IAAF World Championships, Boldon won the title in 200 meter dash, Athens 1997, and he was the runner-up in 100 meter dash in Gothenburg 1995 and Edmonton 2001. The Trinitarian athlete retired in 2005 and he still holds his country’s record in 200 meter dash, with 19.77 seconds.\n\nHASELY CRAWFORD\n\nHasely Crawford was another great Trinitarian sprinter, who wrote his name in record books by becoming the first Caribbean athlete to be an Olympic champion in 100 meter dash. In Montreal Games, 1976, Crawford was the first man to cross the finish line, with 10.06 seconds, barely 0.02 seconds before Jamaican Donald Quarrie.\n\nIn that edition of the Olympic Games, he also qualified for the final of 200 meter dash, but he could not finish the race because of an injury. Crawford also competed in the Moscow Games, 1980, and Los Angeles, 1984, although he was far from his best results.\n\nCrawford got three medals in the British Commonwealth Games: two bronzes in 100 meter dash, in 1970 and 1978, and one silver medal in 4×100 meter relay, in 1978. That very year, he was also given the highest distinction of the country, the Order of Trinidad & Tobago Republic, and a stadium was named after him. In 2000, he was chosen Best Athlete of the 20th Century in that nation.\n\nKESHORN WALCOTT\n\nThis javelin thrower has made history. In 2012, he stood out as junior world champion, in Barcelona, and conquered the Olympic title some months later, during London Games, with 84.58 meters, thus becoming the first Caribbean javelin thrower to be on top of the podium in an Olympic edition.\n\nThis spectacular win turned him into a local hero and, when he returned to his country, the authorities declared a festive day for the Trinitarian people to celebrate with the champion. Both a lighthouse located in the northeast region of Trinidad and a high school in Toco (his hometown) were named after him.\n\nFour years later, in Rio Olympic Games, Walcott finished third with 85.38 meters. Moreover, Walcott got the title in Toronto Pan-American Games, in 2015, and won the silver medal in the British Commonwealth Games, Glasgow 2014.\n\nRICHARD THOMPSON\n\nThe “Torpedo” Thompson has been one of the best Caribbean sprinters of all time. His 9.82 seconds in 100 meter dash, clocked in Port of Spain 2014, is the ninth fastest mark in history. His curriculum includes an Olympic title in Beijing Games 2008, as a member of the 4×100 meter relay (second position), right behind Jamaica; but, years later, this team, including Usain Bolt, was disqualified because of Nesta Carter’s doping and, therefore, Thompson changed the color of his medal.\n\nIn that very Olympic edition, the Trinitarian athlete won the silver in 100 meter dash, where he was only left behind by Bolt. In London 2012, the Trinitarian relay team did it great again and Thompson was the closer of the team that finished second. In World Championships, the “Torpedo” collected a silver medal, in 4×100 relay, in Berlin 2009.\n\nRODNEY WILKES\n\nThis weightlifter was the first athlete to conquer an Olympic medal for Trinidad & Tobago. His name made headlines when he won the Central American and Caribbean Games, in Barranquilla, 1946. In London Olympic Games, 1948, he won the silver medal by lifting 317.5 kilograms, only surpassed by Egyptian Mahmoud Fayad.\n\nIn the Helsinki Olympic Games, 1952, Wilkes was once again on the podium, in the third position. The Trinitarian athlete was strong enough to compete in his third Olympic Games, in Rome 1960, where he finished fourth. Furthermore, Wilkes was the champion in the first edition of Pan-American Games, hosted by Buenos Aires in 1951, and got the title in the British Commonwealth Games, in 1954. Wilkes died of prostate cancer at a San Fernando hospital in 2014, aged 89.\n\nGEORGE BOVELL\n\nBovell can be described as the best Caribbean swimmer of all time. He holds a bronze medal in 200 meters combined, in Athens Olympic Games 2004, as well as two world medals, one in the short event (Istanbul, 2012, bronze in 100 meters combined) and another one in the normal event (Barcelona, 2013, bronze in 50 meters free style). Moreover, Bovell has obtained six medals in Pan-American Games, 2003-2015: 2 gold medals (both in Santo Domingo, 2003), 2 silvers and 2 bronze medals. His curriculum also includes 8 medals in Central American and Caribbean Games (3 gold, 2 silver and 3 bronze medals).\n\nKELLY-ANN BAPTISTE\n\nAlthough this runner has been marked by doping, she can be considered one of the best athletes of her country. In IAAF World Championships, she has obtained two medals: bronze in Daegu 2011, in 100 meter dash, and bronze in Beijing 2015, as a member of her country’s short relay team. She participated in London Olympic Games, 2012, but she didn’t make it to the final in 100 meter dash. This year, she competed in the World Championship hosted by the British capital, where she finished eighth in 100 meter dash.\n\nLALONDE GORDON\n\nGordon has obtained very good results in 400 meter dash and as a member of his country’s 4×400 relay team. As for Olympic Games, Gordon has won two bronze medals, both in London 2012, and he conquered the title in London 2017, 4×400 relay. His career also includes a silver medal, in Beijing 2015. He has conquered two medals in indoor World Championships: bronze in long relay in 2012 and 2016."}, {"url": "https://www.meppublishers.com/trinidad-tobagos-olympic-hopefuls-for-london-2012/", "page_content": "As the London 2012 Olympic Games opened Friday night, the hopes of a nation were stirred once again as the 31-member Trinidad & Tobago contingent paraded into the Olympic stadium led by flag-bearer Marc Burns.\n\nDespite the islands’ small size, Trinidad & Tobago has won a number of Olympic medals – 14 overall – since competing for the first time in 1948. And ironically enough, we at MEP are more closely connected to some of them than we even realised!\n\nOur financial director Joanne Mendes’ recently deceased father, Herbert “Freddie” Mendes, was one of the trainers for 1948 and 1952 medallists Rodney Wilkes and Lennox Kilgour – the latter of whom is my grandmother’s half brother.\n\nTrack & Field\n\n(1 gold, 4 silver, 5 bronze)\n\nWendell Mottley\n\nEdwin Roberts – bronze in 200m (1964)\n\nWendell Mottley, Edwin Robert, Edwin Skinner & Kent Bernard – bronze in men’s 4x400m relay\n\nEdwin Robert, Edwin Skinner & Kent Bernard – bronze in men’s 4x400m relay Hasely Crawford – gold in 100m (1976)\n\n– gold in 100m (1976) Ato Boldon – bronze in 100m & 200m (1996), silver in 100m and bronze in 200m (2000)\n\n– bronze in 100m & 200m (1996), silver in 100m and bronze in 200m (2000) Richard Thompson – silver in 100m (2008)\n\nRichard Thompson, Marc Burns, Aaron Armstrong, Keston Bledman, Emmanuel Callendar – silver in 4×100 men’s relay (2008)\n\nWeightlighting\n\n1 silver, 2 bronze\n\nRodney Wilkes – silver (1948), bronze (1952)\n\n– silver (1948), bronze (1952) Lennox Kilgour – bronze in heavyweight division (1952)\n\nSwimming\n\n1 bronze\n\nGeorge Bovell III – bronze in 200m individual medley (2004)\n\nLooking back, but looking forward\n\nThe last edition of the Summer Olympics, Beijing 2008, was a good one for the Caribbean, and T&T. Trinidad and Tobago sprinter Richard Thompson was second to Bolt in the Beijing 100 and anchored his country to silver in the sprint relay. Based in Los Angeles, Thompson is hoping to return to the podium in London.\n\nBrian Lewis, secretary general of the Trinidad and Tobago Olympic Committee, says it is “very possible” the region will surpass its Beijing performance in London. “The Caribbean will dominate, especially in track, in particular the sprints, both in men and women.”\n\nSo who are some of the athletes with the greatest chance of taking up a spot on the medal podium this year? As in many previous years, Trinidad & Tobago’s best chances lie in Track & Field.\n\nIt was at at the World Junior (under-20) Championships in Moncton, Canada that a young Trinidad and Tobago sprinter, Jehue Gordon, romped home in the men’s 400 hurdles. He had drawn attention a year earlier with a fourth-place finish at the World Championships in Berlin. That championship run was one of the best performances I have ever seen by a Trinidad and Tobago athlete. I stood in awe at the Olympic Stadium in Berlin as the 17-year-old matched strides with the best one-lap hurdlers on the planet. He got home in 48.26 seconds, just three-hundredths of a second slower than bronze medallist Bershawn Jackson of the United States.\n\nIn Berlin, this teenager from Maraval, Port of Spain, became the youngest-ever World Championship finalist in an individual sprint event. Now 20, Gordon is hoping to turn his potential into precious metal in London.\n\nKelly-Ann Baptiste, from Plymouth, Tobago, is another Caribbean woman who could shine in London. In Daegu last year, she became the first female Trinidad and Tobago sprinter to earn a medal at a major senior global meet, taking bronze in the women’s 100.\n\nCycling, Sailing & Swimming\n\nThe 21-year-old Trinidad and Tobago cyclist Njisane Phillip will make his Olympic debut in London: he will not be the favourite for sprint gold, but he should acquit himself well. His compatriot George Bovell, on the other hand, is a veteran swimmer who won a bronze medal in 2004 for the 200 metres individual medley. He will be 29 by the time he dives into the Olympic pool this year. London will be his fourth Olympic Games, and quite possibly his last; but he is determined to make an impression in the 50 metres free.\n\nAndrew Lewisis the first sailor from Trinidad and Tobago to achieve the Olympic qualifying standard in the Laser Class and will be one of only 12 sailors from around the world to compete in that class in London.\n\nIn a nutshell: the Trinidad & Tobago stars to watch\n\nKelly-Ann Baptiste Born October 14, 1986\n\nMain events 100m, 200m\n\nPersonal best 10.84, 22.60\n\nOlympic medals 0 Andrew Lewis Born November 30, 1989\n\nEvent Sailing (Laser standard)\n\nPersonal best National Champion\n\nOlympic medals 0 George Bovell Born July 18, 1983\n\nMain events Swimming: individual medley, freestyle\n\nPersonal best 200m medley 1:58.80, 50m freestyle 21.20\n\nOlympic medals 1 bronze Njisane Phillip Main event Cycling\n\nOlympic medals 0 Jehue Gordon Born December 15, 1991\n\nMain event 400m hurdles\n\nPersonal best 48.26\n\nOlympic medals 0 Richard Thompson Born June 7, 1985\n\nMain events 100m, 200m\n\nPersonal best 9.85, 20.18\n\nOlympic medals 2 silver\n\nAdapted with permission from Caribbean Beat magazine’s Olympic coverage by Kwame Lawrence"}, {"url": "https://olympics.sporting99.com/track-field/mens-200-meter-individual-medley.html", "page_content": "List of all Olympics Men's 200 Meter Individual Medley winners including gold, silver and bronze medalists.\n\nMen's 200 Meter Individual Medley\n\nMen's 200 Meter Individual Medley swimming found a place for the first time at Olympic Games in 1968. It missed two Olympics in 1976 and 1980 but thereafter it has remained a regular at every Olympic Games. The following table lists all medal winners in Men's 200 Meter Individual Medley swimming at Olympic Games.\n\nMen's 200 Meter Individual Medley Winners at Olympics"}, {"url": "https://www.discovertnt.com/welcome/national-icons/", "page_content": "Ian “Bunji Garlin” Alvarez: winner of the 2013 Soul Train Award for Best International Performance. First soca artists (along with band-mate and wife Fay-Ann Lyons Alvarez) to perform at the Glastonbury Music Festival\n\nStephen Ames: world top 25 golfer with four major PGA titles, including historic victory over all-star field with Tiger Woods at the Players Championship (2006)\n\nAnya Ayoung-Chee: former Miss T&T Universe and fashion designer who won the US reality/competition television series Project Runway\n\nKelly-Ann Baptiste: sprinter who won the bronze medal in the 100m World Championships 2011\n\nAto Boldon: four-time Olympic medallist (2 silver, 2 bronze for 100m and 200m, 1996 and 2000), and 200m World Championship gold medallist (1997). Current broadcaster for NBC in the USA\n\nCleopatra Borel Brown: shot putter who won NACA Championship gold (2007), multiple Central American & Caribbean Championships gold medallist, and Pan Am Games gold medallist (2015)\n\nGeorge Bovell III: nation’s first Olympic medallist in swimming, winning Olympic bronze in the 200m individual medley (2004). He is also a two-time World Championship bronze Medalist, five-time Pan Am Games Medalist (2 Gold, 2 Silver, 1 Bronze), multiple Caribbean and Central American medalist and record holder, among other accolades\n\nMachel Cedenio: gold (men’s 4×400 relay) and silver (men’s 400m) medalist in the 2015 Pan Am Games; gold medal in the men’s 400m at the 2015 IAAF Diamond League Grand Prix\n\nJanelle Penny Commissiong: Miss Universe 1977\n\nHasely Crawford: nation’s first Olympic gold medallist, winning the men’s 100m (1976)\n\nWendy Fitzwilliam: Miss Universe 1998\n\nJehue Gordon: hold medallist, 400m hurdles at the 2013 World Championships (2013)\n\nLalonde Gordon: Tobagonian 2017 World Championship gold medallist (4x400m relay); 2012 Olympic bronze (men’s 400m) and silver (men’s 4x400m relay) medallist\n\nHeather Headley: Trinidad-born Tony Award and Grammy-winning singer and actress\n\nCLR James: prolific writer, historian, cultural and political figure, and leading voice in Pan-Africanist movement\n\nGeoffrey Holder: Trinidad-born, Tony Award-winning (1975) theatre and film actor, dancer, painter, director, and designer. Best known on film for roles in Dr. Dolittle (1967) and Annie (1982)\n\nAngela Hunte: US-based, Grammy Award winner (for co-writing “Empire State of Mind”, performed by Jay Z featuring Alicia Keys)\n\nGiselle Laronde-West: Miss World 1986\n\nChavez Lamy: swimming 2015 Special Olympic Games\n\nLennox Kilgour: Olympic bronze medallist in weightlifting (1952)\n\nNicholas Knight: four time medalist (1 silver, 3 bronze) for powerlifting at the 2015 Special Olympics Games\n\nBrian Lara: multiple record-holding cricketer with two test match score records (375 runs not out in 1994 and 400 not out in 2004); highest first class score (501 not out, also in 1994); all-time leading run scorer in test cricket\n\nJosanne Lucas: Tobago-born sprinter, and the island’s first female World Championship medallist (400m hurdles in 2009)\n\nNicki Minaj: Trinidad-born, US-based Platinum Record-holding hip-hop star. She is the third artist to have seven singles on the Billboard Hot 100 at the same time, and the first female artist to be included on MTV’s Annual Hottest MC List. Her awards include: several BET Awards, a UK Asian Music Award, a NARM Award for Breakthrough Artist of the Year, Teen Choice Award, and MTV Video Music Award, among several other nominations\n\nPeter Minshall: mas designer, multiple winner of Band of the Year titles, winner of T&T’s first Emmy Award for costuming of the 2002 Winter Olympics opening ceremony. He also invented the dancing mobile and co-creator of the air dancer (aka the Tall Boy or the inflatable men); dancing mobiles featured prominently at the opening ceremonies for the 1992 Olympics in Barcelona and the 1996 Games in Atlanta, as well as the 1994 World Cup. Minshall’s dancing mobiles and other characters appeared at Bastille Day celebrations in 1990 before an audience of two million, and at the 1995 UNESCO Concert for Tolerance at the Eiffel Tower, where 1.5 million attended.\n\nMachel Montano: winner of the 2014 Soul Train Award for Best International Performance, and a trailblazer for soca music internationally, performing several tracks with international stars like Pitbull, Shaggy, and many more\n\nMarionettes Chorale: winners of the Ruth Railton Prize for the most outstanding contribution by a visiting group at the Cork International Choral and Dance Festival (Ireland, 1984) — the only local choral group to hold an international prize for choral singing\n\nVS Naipaul: Trinidad-born, knighted (UK, 1990) Nobel Prize winner (Literature, 2000)\n\nClaude Noel: Roxborough (Tobago) native and nation’s first boxing World Champion, lifting the WBA’s World Lightweight title in 1981\n\nBilly Ocean: born Leslie Charles in Trinidad, international pop star with hits like “Caribbean Queen” (1984)\n\nNjisane Phillips: cyclist who won gold and silver at the 2010 Central American & Caribbean Games, bronze in the 2011 Pan American Games, and silver at the 2015 Pan Am Games\n\nJoanna Piango: equestrian gold medalist at the 2015 Special Olympic Games\n\nJean Pierre: scored the most goals in the 1979 World Netball Championships to lead T&T to victory, the first country to host and win the championships\n\nRenny Quow: Tobago-born sprinter, winning the island’s first medal (bronze) in the men’s 400m at the World Championships (2009)\n\nRia Ramnarine: nation’s first female World Champion (2005), and WIBA Mini Flyweight title holder\n\nJereem Richards: winner of 4x400m relay bronze at 2012 IAAF World Indoor Championships; bronze in the 200m at the 2017 IAAF World Championships; and gold in 4×400 men’s relay at the same event\n\nArthur NR Robinson: former President of the republic, launched UN General Assembly resolution for the establishment of the International Criminal Court\n\nGiselle Salandy: won her first junior WBA and WBC World Light Middleweight titles in 2006, adding IWBF and WIBA titles by 2007. Died tragically in 2009 at 21 years old. (Also known as Jezelle, Jizelle and Jiselle Salandy)\n\nLinda McCartha Sandy-Lewis (Calypso Rose): born in Bethel, the first woman to win the national Road March title in 1977 (“Tempo”) and 1978 (“Soca Jam”), forcing the Calypso King competition to be renamed Calypso Monarch when she danced away with the 1978 crown. In 2016, she was named Artist of the Year at the prestigious World Music Expo (WOMEX) in Spain, and in 2017 won the Victoire de la Musique (or ‘French Grammy’) for Album of the Year in France. A documentary film has been made about her: Calypso Rose: Lioness of the Jungle\n\nAkeem Stewart: Tobagonian double 2017 World Para Athletics gold medallist (shot put and javelin), 2016 Paralympic gold (javelin) and silver (discus) medallist; and world record holder for javelin F44 and shot put F43\n\nLeslie “Tiger” Stewart: renowned boxer lifted the 1986 WBA Light Heavyweight belt; islands’ second World Champion\n\nRichard Thompson: double 2008 Olympic silver medallist (men’s 100m and men’s 4x100m relay), and World Championship silver medalist (men’s 4×100 relay)\n\nKwame Ture: born Stokely Carmichael in Trinidad, former prime minister of the Black Panthers, leader of the All-African People’s Revolutionary Party\n\nKeshorn Walcott: two-time Olympic medallist (gold in 2012, bronze in 2016). He’s the youngest male athlete (and the first black one) to win a gold medal in javelin; the first individual track and field athlete ever to win World Junior and Olympic titles in the same year; and he holds the North, Central American and Caribbean junior record\n\nJariah Walker: swimming gold medalist 2015 Special Olympic Games\n\nRodney Wilkes: nation’s first Olympic medallist for weightlifting (silver in 1948, bronze in 1952)\n\nDwight Yorke: Tobago-born football star and leading striker for UK teams like Manchester United and Aston Villa. He was an integral part of Trinidad & Tobago’s heartbreaking World Cup campaign in 1989, falling just one game short of qualification. 17 years later, he captained the national team to an impressive debut at the 2006 World Cup in Germany, where the islands made history as the smallest country ever to qualify."}, {"url": "https://www.meppublishers.com/george-bovell-iii-outswims-old-olympic-record-but-ends-2008-run-without-medal/", "page_content": "25-year-old Trinidadian swimmer, George Bovell III, beat his own personal best and the Olympic record (at the time) for the 50m freestyle in his swims in the heat and semifinals. Bovell fell short of a berth in the finals after finishing sixth in his semifinal tonight, which was eventually won by Cesar Cielo Filho (21.34) of Brazil.\n\nEarlier this week, Bovell competed in the 100m freestyle semi-final, breaking the T&T national record, but did not qualify for the finals.\n\nDue to injury, Bovell was unable to compete in the event which won him a historic bronze medal in 2004: the 200m individual medley (IM). His 22-year-old younger brother, Nicholas, did compete in the 200m IM heats, clocking 2:03.90 and placing 36th overall. George clocked 1:58.80 in his medal-winning swim in Athens.\n\nIn a post on his Facebook Fan Page, George gave his take on his 2008 Olympic experience:\n\nThanks everyone so much for the support. I have swum out of my mind here best times and bettering the old olympic record which is something that I will cherish forever. It is crazy to think that I would have won any olympic in history with that time. Unfortunately times change and I am left with the opinion that this olympics is the greatest show in history and not the greatest sporting event.\n\nMeanwhile, Trinidad & Tobago’s medal hopes continue tonight and tomorrow as Olympic Track and Field events commence."}, {"url": "https://alumni.msu.edu/stay-informed/alumni-stories/cover-story-msus-olympic-heritage", "page_content": "Cover Story: MSU's Olympic Heritage\n\nJuly 1, 2008\n\nMSU Olympians have established a long, competitive record that will be honored during Homecoming festivities this fall.\n\nAt the pinnacle of world athletic competition—the Olympic Games—Michigan State Spartans have forged 13 gold medals, 12 silver, and 5 bronze with their spirited performances.\n\nAnother 5 gold medals and 3 bronze medals have been produced by Spartans serving as Olympic coaches.\n\nThis fall, MSU will honor its 107 Olympians during Homecoming weekend, Oct. 3-4.\n\nMSU has been represented at every quadrennial Summer Olympiad from 1924 through 2004—18 consecutive Olympics—with the exception of the 1980 Moscow Games, which were boycotted by 65 nations protesting the Soviet Union’s invasion of Afghanistan. Spartan athletes also have competed in 10 winter Olympics—including seven consecutive games from 1984 through 2006.\n\nIn all, 107 MSU athletes, coaches, an emergency medical director, athletic trainers, press liaisons, and Olympic officials have earned their way to compete or serve at 29 Olympic Games in 22 different sports. Six Spartans qualified for the 1980 Moscow Games but did not attend because of the boycott.\n\nGiven MSU’s longtime leadership in international education and outreach, it’s no surprise that Spartans have represented the Olympic teams of 13 countries besides the U.S.—Australia (two silver medals), Bahamas (one gold, one silver medal), Barbados, Belgium, Britain, Canada (one silver, one bronze medal), Germany, Italy, Japan, Nigeria, Norway, Puerto Rico, and South Africa.\n\nThe Beijing Summer Olympics will open on August 8, 2008 at the 91,000-seat Beijing National Stadium (“Bird’s Nest”) and close on August 24. Some 10,500 athletes from 206 nations are expected to participate in 302 events in 28 sports. A record number of media representatives is expected to descend upon the Beijing Games, and they will operate under the direction of Spartan Olympian Kevan Gosper, ’55, head of the International Olympic Committee (IOC) Press Commission and an IOC vice president (see profile).\n\nLike Gosper, other Spartans have played key Olympic roles, organizing at the regional and national levels, producing telecasts, outfitting various teams, and developing the modular turfgrass fields for Olympic stadiums in Beijing and Athens.\n\nSpartan Olympic Presence: Leadership to Uniforms to Turf\n\nClaire Waters Ferguson, ’57—As president of the U.S. Figure Skating Association from 1992-95, the first woman to hold that position, Ferguson had oversight of all operations related to the U.S. figure skating team when the Olympics were at Lillehammer, Norway. She presided over one of the most notorious scandals ever in her sport—Tonya Harding’s conspiracy to injure rival Nancy Kerrigan to oust her from competition.\n\nLloyd Ward, ’70—Served as CEO of the U.S. Olympic Committee (USOC) from 2002-2003. Ward was captain of the MSU basketball team his senior year. He was an executive with Proctor & Gamble and Pepsico, and later CEO of Maytag Appliances, prior to his USOC leadership role.\n\nSoichiro Yoshida, MBA ’69—Led a multi-year campaign to win the 1998 Winter Olympics for his hometown of Nagano, Japan. Yoshida built a chain of service stations and Kentucky Fried Chicken (KFC) franchises in Japan, as well as a bio-diesel plant that converts KFC oil into automotive fuel.\n\nDennis Lewin, ’65—As vice president for ABC Sports Television, led TV production at eight Olympics—the 1968 Summer Games at Mexico City; 1972-Munich; 1976-Montreal; and 1984-Los Angeles; as well as the 1968 Winter Games at Grenoble, France; 1980-Lake Placid, NY; 1984-Sarajevo, Yugoslavia; and 1988-Calgary, Canada. Lewin produced many memorable telecasts, including figure skater Peggy Fleming’s “gold” performance in 1968; swimmer Mark Spitz’s seven gold medals in 1972; and the USA “Miracle on Ice” victory over Russia in 1980. He was studio producer for all 99 hours of daytime coverage of the 1984 Los Angeles Summer Games.\n\nMichael Budman, ‘68, and Donald Green – Founders of Roots Canada Ltd., Toronto, designed and provided the uniforms for the U.S. Olympic teams in the 2002 Salt Lake City Winter Games; the 2006 Winter Torino, Italy Olympics; and the 2004 Athens Summer Olympics. Their U.S. team berets became the “must have” item at the 2002 Salt Lake City Winter Games. They also have outfitted Canadian and British Olympic teams.\n\nMSU turfgrass experts John “Trey” Rogers, III, professor of crop and soil sciences, and doctoral student Alec Kowalewski spearheaded the construction of the modular turfgrass field for the Beijing National Stadium.\n\nMSU Olympic Gold Medal Winners\n\n1928—The first Spartan to win Olympic gold was sprinter Frederick P. Alderman at the 1928 Summer Games in Amsterdam, Holland, who helped set the world record in the 4x400-meter relay (3:14.2).\n\nAlderman was MSU’s first individual NCAA champion in any sport. He blazed to NCAA titles in the 100-yard and 220-yard dashes at the 1927 NCAA track & field championships in Chicago’s Soldier Field. Along with fellow Spartan sprinters Bohn Grim, Forrest Lang, and Henry Henson, they tied the world record in the 4x110-yard relay at 41.6 seconds in 1927. In 1996, Alderman, then 91, helped carry the Olympic torch to the Atlanta Summer Games.\n\n1952—Clarke C. Scholes, ’52, won Olympic gold in the 100-meter freestyle at the 1952 Summer Games in Helsinki (see profile), setting the Olympic record (57.10) in a preliminary heat.\n\n1960—Doug Blubaugh, MSU assistant wrestling coach, won a gold medal in freestyle wrestling at the Rome Summer Games.\n\n1960—Eugene W. Grazia, ’60,andWeldon H. Olson, ’56, each won gold medals as members of the USA hockey team in the 1960 Winter Olympics at Squaw Valley, CA (see profiles).\n\n1968—Linda Gustavson (McGuire), ’72, won a gold medal in the 4x100 meter freestyle swimming relay in Mexico City.\n\n1968—Harry Kendrick, ’70, and Marvin Knight, ’70, M.A. ’80, were members of the gold medalist U.S. baseball team; MSU legend Danny Litwhiler was the team’s co-head coach. Baseball was a demonstration sport in 1968, but was elevated to official Olympic sport in the five Olympiads from Barcelona 1992 to Beijing 2008.\n\n1968—Kenneth M. Walsh, ’67, won two gold medals at the Mexico City Summer Games—in the 4x100 freestyle relay and the 4x100 medley relay (see profile).\n\n1992—Earvin “Magic” Johnson won gold at the 1992 Barcelona Games as a member of the U.S. men’s basketball team (see profile).\n\n2000—Sevatheda Fynes, ’98,member of the Bahamian women’s track team, won a gold medal in the 4x100-meter relay at the Sydney Summer Games (see profile).\n\n2000—Steve Smith won gold at the 2000 Sydney Games as a member of the U.S. men’s basketball team (see profile).\n\nMSU Silver Medal Winners\n\n1956—Sprinters Kevan Gosper, ’56, and David Lean, ’58, M.A. ’59, won silver medals as members of the Australian 4x400-meter relay team at the 1956 Melbourne Summer Games (see profiles).\n\n1956—Weldon H. Olson, ’55,won a silver medal on the runner-up USA hockey team at the Cortina d’Ampezzo Winter Olympics (see profile).\n\n1964—Gary J. Dilley, ’67, won swimming silver in the 200-meter backstroke at the Tokyo Summer Olympics (see profile).\n\n1968—Donald R. Behm, ’68, M.A. ’80,won wrestling silver in the bantamweight class at the Mexico City Summer Olympics (see profile).\n\n1968—Linda Gustavson (McGuire), ’72, won a silver medal in 400-meter freestyle swimming at the Mexico City Summer Games. She set a world record in the 200-meter freestyle (2:07.9).\n\n1968—Pamela Kruse, ’73, Ph.D. ’79 won a silver medal in 800-meter freestyle swimming at the Mexico City Summer Games (see profile). In 1967, she had set world records in the 400-meter freestyle (4:36.8 and 4:36.4) and in the 200-meter freestyle (2:09.7).\n\n1968–Kenneth M. Walsh, ’67—Swimming--Silver in the 100-meter freestyle at the Mexico City Summer Olympics. He was the world record-holder of the event at the time (see profile).\n\n1984–Judi Brown-Clarke, ’83, M.S. ’95,won track silver in the 400-meter hurdles at the Los Angeles Summer Olympics (see profile).\n\n1994—Dwayne Norris won a Silver Medal as a member of Canada’s ice hockey team in Lillehammer, Norway. In 1991-92 he scored 40 goals in 41 games for the Spartans and was named first-team All-CCHA and an NCAA West first-team All-American.\n\n1996—Sevatheda Fynes, ’98,won track silver with the women’s Bahamian 4x100-meter relay team.\n\n2002—Mike York won hockey silver on Team U.S.A. at the Salt Lake City Winter Olympics (see profile).\n\nMSU Bronze Medal Winners\n\n1948–Leland G. Merrill won wrestling bronze in the 160.5 pound class at the London Summer Olympics. In the same year, Merrill won the National AAU wrestling title at 160 pounds.\n\n1964–Marcia Jones Smoke, ’64, won the bronze medal in kayak at the1964 Tokyo Summer Games (see profile).\n\n1968—Linda Gustavson (McGuire), ’72,won the bronze medal in 100-meter freestyle swimming at the Mexico City Summer Games.\n\n1968—Marilyn Corson Whitney, ’72, M.A. ‘74—Swimming (4x100-meter freestyle relay)—Canada—Bronze Medal—Mexico City Summer Games.\n\n1976—Stan Dziedzic, M.A. ’77—MSU assistant wrestling coach—Wrestling (freestyle)—Bronze Medal—Montreal Summer Games.\n\nEarning a Position on the U.S. Olympic Team: A High Honor\n\nWinning a position on U.S. Olympic teams is a high honor, stamping an athlete as one of the elite performers in the nation, and the world.\n\nQualifying for Olympic teams differs for almost every sport. Qualifying for team sports, such as soccer or basketball, usually means surviving the cut at team selection camps. For individual events, such as track and swimming, athletes must earn a position in Olympic Trials that often serve as national championships. In track, for example, the top three athletes in head-to-head competition qualify for an event such as the 100-meter dash.\n\nMSU’s Three-Time Olympians\n\nSix Spartans have participated in three different Olympics.\n\nChris-Carol Bremer, MSU swimmer in 1993-94, competed as a member of the German swimming team in 1992 and 1996, and made Germany’s 2000 Olympic team as captain. Bremer holds the MSU record in the 200-yard butterfly (1:45.71) and ranks in MSU’s top ten in 200-, 500-, 1,000- and 1,650-yard freestyle and in the 400-yard individual medley.\n\nErnest Crosbie represented the U.S. in the 50 kilometer race walk at the 1932 Los Angeles Summer Olympics; the 1936 Berlin Summer Olympics; and the 1948 London Summer Olympics. It’s remarkable that the span of time between Crosbie’s second and third Olympics was 12 years. This resulted from cancellation of the 1940 and 1944 Olympiads due to World War II. Crosbie’s race walking event was not an NCAA track event.\n\nDr. Adolf Weinacker, ’51,participated in the 50 kilometer race walk at the 1948 London Summer Olympics; the 1952 Helsinki Summer Olympics; and the 1956 Melbourne Summer Olympics.\n\nAllan S. Kwartler was a fencer on the U.S. team at the 1952 Helsinki Summer Olympics, the 1956 Melbourne Summer Olympics and the 1960 Rome Summer Olympics.\n\nMarcia Jones Smoke, ’64, participated in three Olympics, winning the bronze medal in the 1964 Tokyo Summer Games in the 500-meter single kayak event. She finished fourth in the 1968 Mexico City games and seventh in the 1972 Munich games.\n\nFred Lowe, ’70, was a U.S. weightlifter at the 1968 Mexico City Summer Olympics; 1972 Munich Summer Olympics; and the 1976 Montreal Summer Olympics. Weightlifting is not an NCAA sport.\n\nMSU’s Two-Time Olympians\n\nSixteen Spartans have participated in two Olympiads each.\n\nRalph H. Young–MSU Athletic Director—associate U.S. track coach–1932 Los Angeles Summer Olympics; and assistant treasurer U.S. Olympic team–1952 Helsinki Summer Olympics. Under Young, MSU athletic director (1923-1954), MSU became a national sports power. During the five-year span 1950-1954, MSU had no fewer than five sports teams ranked in the top ten nationally every year. Young initiated the annual NCAA cross country meet, which was held on the MSU campus every year from 1938 through 1964.\n\nMSU’s outdoor track and field facility is named in Young’s honor, as is the athletic fund that helps underwrite MSU’s 25 sports—12 men’s and 13 women’s.\n\nCharles W. Speiser–Boxing–1948 London Summer Games; 1952 Helsinki Summer Games. Speiser won NCAA boxing titles in 1951 at 175 pounds; and in 1952 at 178 pounds.\n\nKevan Gosper, ‘55– Australian track team–1956 Melbourne, and 1960 Rome Summer Olympics (see profile).\n\nVirginia Baxter McKendrick–Figure Skating–1956 Cortina d’Ampezzo, Italy Winter Olympics; 1960 Squaw Valley Winter Olympics.\n\nWeldon H. Olson, ‘55–Ice Hockey–1956 Cortina d’Ampezzo, Italy Winter Olympics; 1960 Squaw Valley Winter Olympics.\n\nErnestine Russell Weaver, ‘60—Canadian gymnastics team–1956 Melbourne Summer Olympics; 1960 Rome Summer Olympics. Russell was inducted into the U.S. National Gymnastics Hall of Fame in 1986. She was the University of Florida gymnastics coach and led the Gators to three national team titles, and posted a record of 140 dual meet victories versus just eight losses. In 1955 Russell won a National Amateur Athletic Union title.\n\nJudy K. Goodrich Walker, ‘61–Fencing–1956 Melbourne, and 1960 Rome Summer Olympics.\n\nJoe Puleo, ‘66—Weightlifting—1968 Mexico City, and a member of the 1980 Moscow team. He didn't medal in the Olympics but won five national weightlifting championships (at 165 and 181 pounds) along with gold medals at the Pan American Games of 1963 and 1967. Because of the 65-nation boycott of the 1980 Moscow Summer Games, Puleo competed in a substitute championship held in China and thus became the U.S. weightlifter with the longest international career.\n\nMarilyn Corson Whitney, ’72, M.A. ‘74—Swimming (4x100-meter freestyle relay)—Canada—Bronze Medal—1968 Mexico City and 1972 Munich Games. From 1970-72, Whitney, one of MSU’s most accomplished swimmers, won 9 Big Ten swimming championships and two national championships (200 yard individual medley, 1970 and 1972).\n\nTom Minkel—1980 Moscow, wrestling, and 1992, U.S. Greco-Roman Wrestling coach, bronze medal.\n\nSally Nogle, Ph.D ‘01–Athletic Trainer–Volleyball–1984 Los Angeles Summer Games; and Athletic Trainer–Rowing–1988–Seoul Summer Olympics.\n\nEric Zemper, ’67, M.S. ’77, Ph. D. ‘82–Track Official–1984 Los Angeles, and 1996 Atlanta Summer Olympics.\n\nMark Konopacke, ‘89—Ski Jumping—1988 Calgary Winter Olympics, 1992 Albertville, France, Winter Olympics. Konopacke was a two-time national ski jumping champion—1988 (Ishpeming, MI) and 1991 (Steamboat Springs, CO—tie with Jim Holland).\n\nDave Carrier–Athletic Trainer–Ice Hockey–1988 Calgary Winter Olympics; and Athletic Trainer–Ski Jumping, Nordic Combined–1992 Albertville, France Winter Olympics.\n\nGeir Hoff, ‘92–Ice Hockey Norway–1988 Calgary, and 1994 Lillehammer, Norway Winter Olympics.\n\nSevatheda Fynes, ‘98–Track–Bahamas–1996 Atlanta, and 2000 Sydney Summer Olympics.\n\nMSU Olympic Coaches\n\n1932—Ralph H. Young, associate track coach, USA, Los Angeles Summer Games.\n\n1960—Pete Newell, MSU men’s basketball coach from 1950-54, was head coach of the 1960 U.S. men’s basketball team—a powerful squad that some later called the “original Dream Team.” Newell led players like Oscar Robertson, Jerry Lucas, Walt Bellamy and Jerry West to an undefeated Olympics, averaging 102 points and a 42.4-point winning margin per game. A “Hall of Fame” coach, Newell is one of only three coaches to have won an N.I.T. championship, an NCAA championship, and Olympic gold.\n\n1968—Danny Litwhiler, MSU baseball coach from 1964-82 and a member of the American Baseball Coaches Hall of Fame, led the U.S. baseball team to a gold medal in the 1968 Mexico City Games. Baseball was then a demonstration sport.\n\n1988, 1992—Tom Minkel, MSU wrestling coach since 1991, was assistant coach of the U.S. Greco-Roman wrestling team at the 1988 Seoul Summer Games and head Greco-Roman coach at the 1992 Barcelona Summer Games, where he led his team to a bronze medal, the highest finish ever by a U.S. team in Greco-Roman wrestling.\n\n1996—Michele Madison, assistant coach, USA field hockey, Atlanta Summer Games.\n\n2000—Karen Dennis, ’77, M.A. ’79, was the U.S. Olympic Women’s Track Coach in 2000, leading the team to five gold and three bronze medals at the Sydney Summer Olympics. Dennis was a national champion sprinter at MSU, winning the women’s 1975 AIAW outdoor track 220-yard dash in 24.9 seconds and setting a world record as part of a 4-x160-yard relay team. Dennis now serves as women’s track coach at The Ohio State University.\n\n2004—Manabu “Manny” Noguchi, Barbadosswimming coach at the Athens Summer Games.\n\nThe Ancient Olympic Games\n\n“The Ancient Olympic Games were initiated in 776 BC in Greece, and were held on the plain of Olympia in Peloponnesos. At the first Olympics, a short sprint was the only event, run by men competing in the nude. The Games were held every four years. The period between Games became known as an ‘Olympiad’. The Greeks used Olympiads as one of their methods to count years.”\n\n“The Games declined in importance as the Romans gained power in Greece. When Christianity became the official religion of the Roman Empire, the Games were seen as a pagan festival and in discord with Christian ethics. In 394 AD emperor Theodosius I outlawed the Olympics...ending a 1,170-year tradition.” (Wikipedia).\n\nHistory And Magnitude of the Modern Olympics\n\nThe first modern Olympics—designated the Games of First Olympiad—were staged in Athens, Greece in April 1896. Opening ceremonies drew 80,000 spectators, including King George I of Greece and his wife Olga, to Panathenaic Stadium. Two hundred forty-one athletes from 14 nations competed in 43 events in 9 sports. Olympic sports then included athletics (track & field), cycling, fencing, gymnastics, shooting, swimming, tennis, weightlifting, and wrestling.\n\nAt the 2004 Athens Summer Olympics, there were 10,625 competitors from 201 countries. There were 301 medal events in 28 different sports. Swimming, diving, synchronized swimming, and water polo are classified as disciplines within the sport of aquatics. For the first time, women’s wrestling was featured.\n\nThe 28 Olympic summer sports are archery, aquatics, badminton, baseball, basketball, boxing, canoeing, cycling, equestrian, fencing, field hockey, football/soccer, gymnastics, handball, judo, modern pentathlon, rowing, sailing, shooting, softball, table tennis, taekwondo, tennis, triathlon, volleyball, weightlifting, wheelchair racing (demonstration event), and wrestling.\n\nU.S. Olympians dominated the 2004 Athens Summer Olympics, winning 102 medals—36 gold, 39 silver, and 27 bronze. Other top ten medal winning nations were: Russia-92, China-63, Australia-49, Germany-49, Japan-37, France-33, Italy-32, Great Britain-30, and South Korea-30.\n\nThe 2006 Turin, Italy Winter Olympics featured 2,508 athletes from 80 nations. They competed in 84 events in 15 different disciplines—ice hockey, figure skating, speed skating, snowboarding, luge, bobsled, skeleton (a type of sledding), curling, cross-country skiing, freestyle skiing, slalom, downhill (Alpine) skiing, ski jumping, Nordic combined (skiing plus ski jumping), and biathlon (skiing and shooting).\n\nThe top 11 medal winning nations were—Germany-29, United States-25, Canada-24, Austria-23, Russia-22, Sweden-14, Switzerland-14, South Korea-11, Italy-11, France-9, Netherlands-9.\n\nThe 2010 XXI Winter Olympics will be held in Vancouver, British Columbia, Canada at the Whistler Olympic Park. Competition will be held in 86 events in 8 sports.\n\nThree Olympic Games were cancelled: in 1916 due to World War I; and in 1940 and 1944 due to World War II.\n\nOlympics: Great Media Events\n\nThe Olympics have become one the world’s great news media events. At the 2000 Sydney Summer Olympics, more than 16,000 journalists and broadcasters were present to report on the Games. An estimated 3.8 billion viewers watched the Games on television. A record number of journalists is expected to attend the Beijing Olympics and Spartan Kevan Gosper, ’55, heads up the IOC Press Commission.\n\nThe Olympic Flame\n\n“At the Ancient Olympic Games—held in Greece 2,700 years ago—the tradition of an Olympic flame was ignited, and it burned throughout the games every four years. It symbolized the death and rebirth of Greek heroes.\n\n“The first torch relay was launched at the 1936 Berlin Summer Olympics. A new flame is lit for every Olympiad in the ancient Olympic stadium in Olympia, Elis, Greece, using a parabolic mirror to focus the rays of the sun.\n\n“The Olympic Torch Relay begins by touring Greece. The flame is then transported (usually by air) to the nation where the Games will be held. After traversing the nation of the Games, carried by runners, walkers, riding horses, and even camels, the last runner lights the large torch in the Olympic stadium where it burns for the duration of the Games.” (Enchanted Learning.com).\n\nThe Olympic Flag\n\n“The flag of the Olympic Games has five interlocking rings–blue, yellow, black, green, and red–on a white background. The rings represent the five sections of the world joined together in the Olympic movement: Africa, the Americas, Asia, Australia, and Europe.\n\n“Baron de Couberin (1863-1937), a French educator, designed the flag in 1913-1914. It was first used at the 1920 Antwerp, Belgium Summer Olympics.\n\n“The flag is paraded during the opening ceremonies of each Olympics and flown during the Games. At the closing ceremonies of each Olympics, the mayor of the host-city presents the flag to the mayor of the next host-city. The flag then remains in the city hall of the next host-city until the opening ceremonies of the Games.” (Enchanted Learning.com)\n\nAs the 2008 Beijing Summer Olympics approach—August 8-24—the Michigan State family will be pulling for a dozen Spartans to earn positions on U.S. Olympic teams: Jamie Krzyminski in the women's marathon; Christen Brown in rowing; Nicole Bush in track; Sevatheda Fynes in track; Jolene Crooks Moore and Kristen Furseth-Mullaney in racewalking; Jeremy Orr in track; Marcus Poteete in swimming; Nick Simmons in wrestling; and Paul Terek in the decathlon. Spartans will also be pulling for two Canadian athletes—MSU junior Danielle Williams, who is vying to make the Canadian team in three-meter diving, and MSU graduate student Nicole Forrester, Canada’s top-ranked high jumper, who has a great chance to compete for her country in Beijing. If one or all succeed, it will sustain MSU's record of participating in every Summer Olympics from 1924 to 2008—19 consecutive—with the exception of the boycotted 1980 Moscow Games.\n\nMSU OLYMPIANS BY YEAR\n\n1924–Colonel William D. Frazer, Paris, France–Pistol.\n\n1928–Frederick P. Alderman–Amsterdam—Track—Gold Medal–4x400-Meter Relay–World Record: 3 minutes, 14.2 seconds.\n\n1932–Ernest Crosbie–50 Kilometer Race Walk.\n\n1932–Thomas C. Ottey–Track.\n\n1932–Ralph H. Young–MSU Athletic Director–Associate Track Coach–USA.\n\n1936–Ernest Crosbie–50 Kilometer Race Walk.\n\n1936–Albert Mangan–Track.\n\n1940 & 1944–Olympic Games cancelled due to World War II.\n\n1948–Ernest Crosbie–50 Kilometer Race Walk.\n\n1948–Charles P. Davey–Boxing.\n\n1948–Lyle E. Garbe–Canada–10 Kilometer Race Walk.\n\n1948–John G. “Jack” Heppinstall–Athletic Trainer.\n\n1948—Dr. Bill Heusner—MSU faculty, Swimming.\n\n1948–George A. Hoogerhyde–Swimming.\n\n1948–Robert G. Maldegan–Wrestling.\n\n1948–Leland G. Merrill–Wrestling–Bronze Medal (160.5 pounds).\n\n1948–Howard F. Patterson–Swimming.\n\n1948–Charles W. Speiser–Boxing.\n\n1948–Dale O. Thomas—MSU physical education staff—Wrestling.\n\n1948–Dr. Adolf Weinacker–50 Kilometer Race Walk.\n\n1952–Warren O. Druetzler–Track.\n\n1952–Allan S. Kwartler–Fencing.\n\n1952–Clarke C. Scholes–Swimming–100-Meter Freestyle–Gold Medal—Olympic Record: 57.4 seconds.\n\n1952–Charles W. Speiser–Boxing.\n\n1952–Dr. Adolf Weinacker–50 Kilometer Race Walk.\n\n1952–Ralph H. Young–MSU Athletic Director–Assistant Treasurer–Team USA.\n\n1956–Virginia D. Baxter McKendrick–Figure Skating.\n\n1956–Judy K. Goodrich Walker–Fencing.\n\n1956–Kevan Gosper–Track–Silver Medal–4 x 400 Meter Relay–Australia.\n\n1956–David Lean–Track–Silver Medal–4 x 400 Meter Relay–Australia.\n\n1956–Allan S. Kwartler–Fencing.\n\n1956–Pearce A. Lane–Boxing.\n\n1956–Choken Maekawa–Boxing.\n\n1956–Weldon H. Olson–Ice Hockey–Silver Medal.\n\n1956–Ernestine Russell Weaver–Gymnastics–Canada.\n\n1956–William Steuart–Swimming–South Africa.\n\n1956–Dr. Adolf Weinacker–50 Kilometer Race Walk.\n\n1960–Virginia D. Baxter McKendrick–Figure Skating.\n\n1960—Doug Blubaugh—MSU assistant wrestling coach—Wrestling (Freestyle)—Gold Medal.\n\n1960–Judy K. Goodrich Walker–Fencing.\n\n1960–Kevan Gosper–Track–Captain, Australian team.\n\n1960–Eugene W. Grazia–Ice Hockey–Gold Medal.\n\n1960–Allan S. Kwartler–Fencing.\n\n1960—Pete Newell—Head coach, U.S. men’s basketball—Gold Medal\n\n1960–Weldon H. Olson–Ice Hockey–Gold Medal.\n\n1960–Ernestine Russell Weaver –Gymnastics–Canada.\n\n1964–Solomon Akpata–Track—Nigeria.\n\n1964–Fendley Collins–MSU Wrestling Coach–Manager, U.S. Wrestling Team.\n\n1964–Gary J. Dilley–Swimming–Silver Medal–200 Meter Backstroke.\n\n1964–Marcia I. Jones Smoke–Canoeing—Bronze Medal, 500-meter singles in kayaking.\n\n1964–William A. Smoke–Canoeing.\n\n1968–Donald R. Behm–Wrestling (Freestyle)–Silver Medal.\n\n1968–George Gonzalez–Swimming–Puerto Rico.\n\n1968—Linda (Gustavson) McGuire—Swimming—Gold Medal (4x100 meter freestyle relay); Silver Medal (400 meter freestyle); Bronze Medal (100 meter freestyle)\n\n1968—Harry Kendrick—Baseball—Gold Medal.\n\n1968—Marvin Knight—Baseball—Gold Medal.\n\n1968—Pamela Kruse—Swimming—Silver Medal (800 meter freestyle)\n\n1968—Danny Litwhiler—Coach, U.S. baseball team—Gold Medal.\n\n1968–Fred Lowe–Weightlifting.\n\n1968—Joe Puleo—Weightlifting.\n\n1968–David B. Thor—Gymnastics.\n\n1968–Ernie Tuchscherer—Soccer.\n\n1968–Douglas Volmer–Hockey.\n\n1968–Kenneth M. Walsh–Swimming–Gold Medals (4x100 meter freestyle and 4x100 meter medley relay); Silver Medal (100 meter freestyle).\n\n1968—Marilyn Corson Whitney—Swimming—Canada—Bronze Medal—4x100 meter freestyle relay.\n\n1968–Peter E. Williams–Swimming.\n\n1968–Marcia Jones Smoke–Singles Kayaking.\n\n1968–Art “Buzz” Demling–Soccer.\n\n1972–Fred Lowe–Weightlifting.\n\n1972–Charles “Mac” McCaffree, Jr.–MSU Swimming Coach–Assistant Manager, USA Swimming Team.\n\n1972–Gayle Robinson–Athletic Trainer–Swimming.\n\n1972—Marilyn Corson Whitney—Swimming—Canada.\n\n1972–Marcia Jones Smoke–Singles Kayaking.\n\n1972–Roger Young–Cycling.\n\n1976—Stanley Dziedzic, Jr.—Wrestling (Freestyle)—Bronze Medal\n\n1976–Fred Lowe–Weightlifting.\n\n1980–Dave Burgering–Diving.\n\n1980–Kevin Machemer–Diving.\n\n1980—Tom Minkel—Wrestling (Freestyle).\n\n1980—Joe Puleo—Weightlifting.\n\n1980–Fred W. Stabley, Sr.–MSU Sports Information Director–Press Liaison.\n\n1980–Diane Williams–Track.\n\n1984–Dr. Roy T. Bergman–MSU Staff Member–Doctor for U.S. Olympic Committee.\n\n1984–Judi Brown–Track–Silver Medal (400 Meter Hurdles).\n\n1984–Gary Haight–Ice Hockey.\n\n1984–Sally Nogle–Athletic Trainer–Volleyball.\n\n1984–Nick Vista–MSU Sports Information Director–Press Liaison.\n\n1984–Dr. Eric Zemper–Track Official.\n\n1988–Sidney Appelboom–Swimming–Belgium.\n\n1988–Dave Carrier–Athletic Trainer–Ice Hockey.\n\n1988–Michael Green–Swimming–Great Britain.\n\n1988–Geir Hoff–Ice Hockey–Norway.\n\n1988-Mark Konopacke—Ski Jumping\n\n1988–Kevin Miller–Ice Hockey.\n\n1988—Tom Minkel—MSU wrestling coach—Assistant coach, U.S. wrestling team (Greco-Roman).\n\n1988–Sally Nogle–Athletic Trainer–Rowing.\n\n1992—Chris Carol-Bremer—Swimming—Germany.\n\n1992–Dave Carrier–Athletic Trainer–Ski Jumping, Nordic Combined.\n\n1992--Mark Konopacke--Ski Jumping\n\n1992—Tom Minkel—Coach, Wrestling (Greco-Roman)—Bronze Medal\n\n1992—Jennifer O’Donnell—Archery.\n\n1992—Ilaria Sciorelli—Swimming—Italy\n\n1992–Jason Woolley–Ice Hockey–Canada.\n\n1992–Julie Farrell-Ovenhouse–Diving.\n\n1992–Earvin “Magic” Johnson—Men’s Basketball–Gold Medal–“Dream Team I.”\n\n1994–Jason Dungjen–Figure Skating.\n\n1994–Dwayne Norris–Ice Hockey—Silver Medal–Canada.\n\n1994–Geir Hoff–Ice Hockey–Norway.\n\n1994—Claire Waters Ferguson—President of U.S. Figure Skating Association, which ran the U.S. Olympic Figure Skating Team.\n\n1996—Chris Carol-Bremer—Swimming—Germany.\n\n1996–Pam Bustin–Field Hockey.\n\n1996–Dr. Eric Deal–Emergency Medical Director of the Atlanta Olympic Games.\n\n1996–Sevatheda Fynes–Track-Bahamas–Silver Medal–4x400 Meter Relay.\n\n1996–Michele Madison–Assistant Coach–Field Hockey.\n\n1996–Ken Hoffman–MSU Sports Information Director–Press Room Manager.\n\n1996–Dr. Eric Zemper–Track Official.\n\n1998—Soichiro Yoshida—MSU MBA ’69—Led multi-year campaign to win the Winter Olympic Games for his hometown of Nagano, Japan.\n\n1998–Rod Brind’amour–Ice Hockey–Team Canada.\n\n2000—Dr. Norman Graham, associate dean of MSU’s James Madison College and coach of MSU’s archery team, was head of the U.S. Archery Team Olympics delegation\n\n2000—Chris Carol-Bremer—Swimming—Captain, German Olympic swimming team.\n\n2000—Jessica Carlson—Archery\n\n2000–Karen Dennis–Coach, USWomen’s Track Team (Four Gold and three Bronze Medals).\n\n2000–Sevatheda Fynes–Track–Gold Medal–Bahamian 4x100 Meter Relay.\n\n2000–Steve Smith–Basketball–Gold Medal–“Dream Team-III.”\n\n2002–Mike York–Ice Hockey–Silver Medal.\n\n2002—Lloyd Ward—CEO of U.S. Olympic Committee.\n\n2004–Paul Terek–Track–Decathlon.\n\n2004–Manabu “Manny” Noguchi–Swimming Coach–Barbados.\n\n2006–John Liles–Ice Hockey.\n\n2006—Jason Muzzatti–Ice Hockey–Italy.\n\n2006–-Tony Tuzzolino–Ice Hockey–Italy.\n\nAuthor: J. Bruce McCristal, ’54 (business-economics). As an MSU student, he was a four-year aide to legendary sports information director, Fred W. Stabley, Sr. In the U.S. Air Force, he was a pilot and public information officer. McCristal served General Motors for 30 years—heading public relations operations at Cadillac, GM Hughes Electronics, and Delco Electronics-Milwaukee, and directed GM’s worldwide employee communications. He has served as chairman of MSU’s Development Fund, and on the MSUAA national board. In 2004, he authored The Spirit of Michigan State (spiritofmichiganstate.com), the first comprehensive MSU history published in 50 years (all profits to MSU). He was elected a Distinguished Alumni in 2005. He originated, edited and produced Spartan Champions (by Jack Ebling)—the story of MSU’s 1987 Big Ten football championship year and 1988 Rose Bowl victory.\n\nDr. Eric Zemper, B.S. ’67, M.S. ’77, Ph.D. ’82, assisted with research for this article. He ran cross country and track for MSU from 1962-67 and was a member of Big Ten championship teams in both sports. He held several MSU course records, including the Ralph Young Field record for the mile. He is a research professor at MSU’s College of Osteopathic Medicine and the University of Michigan Medical School. He officiated at the 1984 Los Angeles and 1996 Atlanta Summer Games.\n\nRobert Bao\n\nSpartan Magazine\n\nAuthor:"}, {"url": "https://olympics.com/en/news/olympics-200m-winners-list-men-women-gold-medals-champions", "page_content": "Andre de Grasse of Canada, the Rio 2016 men’s 200m silver medallist behind Usain Bolt, took over from the Jamaican, winning the men’s 200m gold at Tokyo 2020.\n\nAt Tokyo 2020, it was Bolt’s fellow Jamaican Elaine Thompson-Herah, who became the first woman to successfully defend the 100 metres and 200 metres titles at an Olympics.\n\nThe Tokyo Olympics saw a 100m-200m double even in the absence of the retired Usain Bolt , who had achieved the feat three consecutive times - at Beijing 2008, London 2012 and Rio 2016.\n\nAfter the 100m, the 200m is considered to be one of the most prestigious events at the Olympics. Barring the inaugural modern Games at Athens 1896, the men’s 200m has seen a permanent presence at the Olympics from Paris 1900. The women’s event has been held since London 1948.\n\nThe USA have been the most successful nation in the 200m, winning 17 out of the 28 gold medals in the men’s 200m and six out of 19 in the women’s 200m. Jamaica have won as many overall medals as the USA in women’s 200m – 13.\n\nAmerican men have swept all three 200m medals at the Olympics on as many as six occasions: St Louis 1904, Los Angeles 1932, Helsinki 1952, Melbourne 1956, Los Angeles 1984 and Athens 2004. No country has swept the three 200m medals in the women’s event so far, although there have been quite a few doubles.\n\nUsain Bolt is the most successful athlete in the 200m with three gold medals, while another Jamaican Merlene Ottey has won the most medals – four (one silver, three bronze).\n\nNo man apart from Usain Bolt has won multiple 200m gold medals. Three women - Bärbel Wöckel of East Germany (Montreal 1976 and Moscow 1980), Veronica Campbell-Brown of Jamaica (Athens 2004 and Beijing 2008), Elaine Thompson-Herah also of Jamaica (Rio 2016 and Tokyo 2020) – have won two 200m gold medals.\n\nUsain Bolt holds the world (19.19 seconds) as well as the Olympic records (19.3 seconds) in the men’s 200m. Florence Griffith-Joyner’s 21.34 seconds en route to the Seoul 1988 gold still remains the world and Olympic best in women’s 200m."}], "George Bovell III won a silver medal in the 200-meter individual medley at the 2008 Summer Olympics in Beijing, China.": [{"url": "https://newsday.co.tt/2022/07/07/a-celebration-of-trinidad-and-tobagos-olympic-medallists/", "page_content": "A celebration of Trinidad and Tobago’s Olympic medallists\n\nTrinidad and Tobago's Keshorn Walcott competes to win the gold medal in the men's javelin throw final at the athletics event of the 2012 Olympic Games on August 11, 2012 in London, England. (AFP PHOTO) -\n\nTRINIDAD AND Tobago have made their mark on the Olympic stage, bringing joy to the people of this country. Weightlifter Rodney Wilkes got the ball rolling at the 1948 London Games which was followed by some memorable performances. Sprinter Hasely Crawford, javelin thrower Keshorn Walcott and a men’s 4x100-metre team all reached the top of the podium and the efforts of swimmer George Bovell and sprinter Ato Boldon will never be forgotten.\n\nOn Tuesday, TT added a third gold medal to this country’s tally as the men’s 4x100m relay team were upgraded to gold, 14 years after earning a silver medal at the 2008 Beijing Olympics.\n\nThis reporter takes a look back at the 19 medals (three gold, five silver and 11 bronze) this country won in the history of the Olympic Games.\n\nTT have picked up medals in three sports at the Olympics – track and field, weightlifting and swimming.\n\nGOLD\n\nCrawford won TT’s first gold medal at the 1976 Montreal Games.\n\nCrawford had stiff competition heading into the Games as the event included 1972 gold medallist Valeriy Borzov of Soviet Union and the highly favoured Donald Quarrie of Jamaica.\n\nIn the second semifinal, Crawford sealed a place in the final by winning in 10.22 seconds. Quarrie was second in 10.26.\n\nIn the final, Crawford became a household name in TT when crossed the finish line in 10.06. Quarrie was second in 10.08 and Borzov had to settle for bronze in 10.14.\n\nAt the 2008 Beijing Olympics, Jamaica won the men’s 4x100m event, led by legendary sprinter Usain Bolt.\n\nJamaica won the event in 37.10 in a then Olympic and world record.\n\nTT finished second in 38.06.\n\nHowever, in 2017, the International Olympic Committee revealed that Jamaica team member Nesta Carter had violated the anti-doping code by testing positive for methylhexaneamine. Jamaica were disqualified and TT were announced as the new winners.\n\nThe TT team of Richard Thompson, Marc Burns, Keston Bledman, Emmanuel Callender and Aaron Armstrong received their medals in a short Olympic medal reallocation ceremony at the Olympic Museum in Lausanne, Switzerland, on Tuesday.\n\nNot much was expected of Walcott heading into the 2012 London Games. By the end of the Games, Walcott was considered one of this country’s greatest Olympians.\n\nWalcott, only 19 at the time, was still a national junior athlete.\n\nIn the qualifying round, he sealed a place in the final by throwing 81.75m on his third and final throw. Walcott had the tenth best throw among the 12 finalists.\n\nIn the final, Walcott broke the national record with a throw of 84.58m to cop gold.\n\nIt was Walcott’s day as Vitezslav Vesely of Czech Republic, who threw a massive 88.34m in the qualifying round, could only manage an 83.34m throw in the final to snatch bronze.\n\nAntti Ruuskanen of Finland took silver with an 84.12m effort.\n\nSILVER\n\nTT made their Olympic debut at the 1948 London Games with five athletes.\n\nWeightlifter Wilkes became this country’s first Olympic medallist after finishing second in the men’s featherweight.\n\nWilkes, nicknamed the Mighty Midget, died in 2014 at age 89.\n\nWendell Mottley was one of many formidable 400m runners this country produced in the 1960s. At the 1964 Tokyo Olympics, Mottley grabbed a silver medal in the men’s 400m event. It was a memorable Games for TT as it was the first Olympics that this country claimed medals in track and field.\n\nTT had to wait 36 years before earning another silver medal. During the 2000 Sydney Games, TT fans had to set their alarms to wake up in the wee hours of the morning to watch Ato Boldon in action because of the 14-hour time difference.\n\nIt was worth it in the end as Boldon finished second in the men’s 100m event. From the mid 1990s to early 2000s TT’s track and field medal hopes relied almost entirely on Boldon’s shoulders.\n\nBoldon inspired a new wave of sprinters and at the 2008 Beijing Games, Richard Thompson announced himself.\n\nThompson was in the form of his life heading into the Beijing Games.\n\nRunning for Louisiana State University, Thompson won the NCAA Men's Outdoor Track Athlete of the Year award and the SEC Men's Outdoor Track Athlete of the Year award.\n\nThompson copped silver in the men’s 100m final behind Bolt, who set a world record of 9.69.\n\nFour years later at the 2012 London Olympics, the quartet of Thompson, Bledman, Callender and Burns took silver in the men’s 4x100m event. It was the most successful Olympics for TT as the team left London with four medals.\n\nBRONZE\n\nEleven of TT’s 19 medals are bronze with Wilkes grabbing the first one at the 1952 Helsinki Games. Following up his silver medal four years earlier, Wilkes took bronze in the men’s featherweight.\n\nWilkes was not the only TT weightlifter to earn a medal at the games as Lennox Kilgour was third in the men’s middle-heavyweight division.\n\nAt the 1964 Tokyo Games, Edwin Roberts became the first TT track and field athlete to cop a sprint medal with his bronze in the men’s 200m event.\n\nRoberts was joined by Mottley, Kent Bernard and Edwin Skinner in the men’s 4x400m race. They did not leave empty-handed, ending third.\n\nIt was a dry period for TT between 1964 and 1996 as during that time Crawford’s gold medal in 1976 was the lone podium finish.\n\nAt the 1996 Atlanta Olympics, Boldon ended TT’s drought by copping bronze medals in both the 100m and 200m.\n\nThe 100m final was drama-filled. Linford Christie of Great Britain, the former Olympic champion, false started to add more tension to the race.\n\nBoldon then false started and on the third attempt to start the race Christie false started again and was disqualified.\n\nChristie was reluctant to leave the track but, when he eventually left, the race began.\n\nBoldon led at the 60m mark, but Frankie Fredericks of Namibia and Donovan Bailey of Canada surged to the front. Bailey grabbed gold in a new world record of 9.84, Fredericks was second in 9.89 and Boldon had to settle for bronze in 9.90.\n\nIn the men’s 200m final, Boldon copped his second bronze medal of the Games when he stopped the clock in 19.80.\n\nAmerican Michael Johnson broke the world record on his way to gold in 19.32 and Fredericks was second in 19.68.\n\nBoldon snatched his third bronze medal of his illustrious Olympic career in the men’s 200m event at the 2000 Sydney Games.\n\nBovell was the next athlete to get bronze for TT becoming the first swimmer to earn an Olympic medal at the 2004 Athens Games. A few TT swimmers competed at the Olympics before Bovell.\n\nBovell’s achievement was celebrated as it was TT’s only medal at the 2004 Games.\n\nBovell, competing in the men’s 200m individual medley, touched the wall in one minute, 58.80 seconds (1:58.80) in a new national record.\n\nAmerican swim legend Michael Phelps won in an Olympic record of 1:57.14 and countryman Ryan Lochte was second in 1:58.78.\n\nAt the 2012 London Games, TT, as they did in 1964, showed their prowess in the men’s 400m event.\n\nLalonde Gordon earned bronze in the men’s 400m event and the men’s 4x400m team also took bronze. The TT relay contingent included Gordon, the late Deon Lendore, Jarrin Solomon, Renny Quow, Machel Cedenio and Ade Alleyne-Forte.\n\nTT could not continue their prolific form at the 2016 Rio Olympics as a bronze medal by Walcott in the closing stages of the meet was the only medal earned. It was his second medal after winning gold four years earlier."}, {"url": "https://auburntigers.com/news/2004/8/19/Bovell_Wins_Bronze_Medal_in_200m_IM_at_2004_Olympics.aspx", "page_content": "Bovell Wins Bronze Medal in 200m IM at 2004 Olympics\n\nAug. 19, 2004\n\nGeorge Bovell\n\nATHENS, Greece -- George Bovell captured a bronze medal in the men's 200-meter individual medley at the XXVIII Olympic Games on Thursday night as the Trinidad and Tobago native clocked a 1:58.80.\n\n\"I dived in and felt my stroke fly,\" Bovell said afterward. \"I felt it would be an easy, smooth race. I had doubts in the backstroke, but I pushed through the pain and just looked to bring it home.\"\n\nBovell's leadoff butterfly stroke was a 26.22, which put him in sixth at the first turn. He then turned over to clock a 29.94 in the backstroke, which moved him into third behind eventual gold-medalist and world record holder Michael Phelps of the United States and silver-medalist Ryan Lochte, also an American.\n\nWith 100-meter to go, Bovell registered a 33.95 in the breaststroke leg, the best split in the field, before clocking a 28.64 to out-touch Laszlo Cseh of Hungary by .04 seconds.\n\n\"George did this in a meet where he was struggling. He wasn't performing up to his or our (the Auburn coaches) standards up to this point,\" Auburn coach David Marsh said. \"But he stepped up tonight and got the job done. He was fighting tooth and nail with Cseh and was able to out-touch him at the wall.\"\n\n\"I hope this success will improve swimming in Trinidad and Tobago and I hope it will encourage the government to improve the swimming facilities,\" Bovell said.\n\nThe medal is Trinidad and Tobago's first in international swimming competition.\n\n\"George is really relieved right now,\" Marsh said. \"The weight that he and his nation put on his shoulders is now gone.\"\n\nJust prior to his swim, the contingent of Auburn swimmers and divers in Athens surrounded Bovell and reminded him to think like it was a SEC or NCAA meet and that he was in Athens as a part of the Auburn team.\n\nPhelps won the event with an Olympic record time of 1:57.14 while Lochte took the silver with a 1:58.78.\n\nAlso on Thursday, Kirsty Coventry and Margaret Hoelzer advanced into the finals of the women's 200-meter backstroke. Coventry, who has already captured two medals at the Olympics, is seeded second with a time if 2:10.04 while Hoelzer is fifth with a 2:11.68.\n\n\"Yesterday, I had a rest day and tonight I just wanted to go out and have fun,\" Coventry said.\n\nShould Coventry win a medal in Friday's finals, she we join Rowdy Gaines as the only Auburn swimmers to ever capture three medals at a single Olympics.\n\nCoventry and Hoelzer had qualified third and fourth, respectively, in the prelims going 2:12.49 and 2:12.55, respectively.\n\n\"I'm like everyone else here, I want to win a gold medal,\" Hoelzer said. Everything is going to plan so far, so I'm OK.\"\n\nAlso moving onto a Friday night final was former Tiger and Australian native Brett Hawke, who holds the second-best time coming out of the semi-finals of the men's 50-meter freestyle with a new Australian record of 22.07. He had qualified for the semis with a 22.42, which placed him tenth.\n\n\"I wanted to come here it and make it to the final, so I'm very happy,\" Hawke said.\n\nCurrent Tiger Fred Bousquet failed to make the finals of the 50m free as his 22.29 in the semis was only 12th-best, that after qualifying second in the prelims with a 22.24.\n\n\"I'm not sad, I'm just disappointed,\" Bousquet said. \"This was one of the fastest 50m (freestyle races) in history. There is just something small missing.\"\n\nBousquet also swam in the prelims of the 100-meter butterfly, clocking a 53.63 to place 25th.\n\nThe individual qualifying will come to an end on Friday. Panamanian Eileen Coparropa will swim the women's 50-meter freestyle while Romain Barnier and Bousquet, both of France, and Matt Kidd of England are all scheduled to swim the prelims of the men's 4x100-meter medley relay. The prelims will be shown from 11:30 a.m. * 3 p.m. CT on NBC while the semi-finals and finals will be shown from 7-11 p.m.\n\n2004 Olympic Swimming * Auburn Finishes\n\nMen's 50-meter Freestyle * prelims\n\n2. Fred Bousquet 22.24\n\n10. Brett Hawke 22.42\n\nMen's 100-meter Butterfly * prelims\n\n25. Fred Bousquet 53.63\n\nWomen's 200-meter Backstroke * prelims\n\n3. Kirsty Coventry 2:12.49\n\n4. Margaret Hoelzer 2:12.55\n\nMen's 50-meter Freestyle * semi-finals\n\n2. Brett Hawke 22.07\n\n12. Fred Bousquet 22.29\n\nMen's 200-meter Individual Medley * finals\n\n3. George Bovell 1:58.80\n\nWomen's 200-meter Backstroke * semi-finals\n\n2. Kirsty Coventry 2:10.04\n\n5. Margaret Hoelzer 2:11.68"}, {"url": "https://newsday.co.tt/2020/04/14/olympics-not-life-or-death/", "page_content": "Olympics not life or death\n\nIn this Aug 19,2004 file photo, TT’s George Bovell adjusts his crown after winning the men’s 200m individual medley bronze medal, at the 2004 Olympic Games at the Olympic Aquatic Center in Athens. AFP PHOTO -\n\nOLYMPIC 2004 bronze medallist George Bovell III feels sorry for the athletes who had to delay either their 2020 Tokyo Olympics dreams or participation by a year, due to the coronavirus pandemic.\n\nHowever, the 36-year-old legendary swimmer made it clear that this episode can be a reality check for a number of athletes since there is more to life than the Olympics.\n\nThe Tokyo Games, which were originally carded from July 24 to August 9, 2020, will now take place from July 23 to August 8, 2021.\n\nBovell III finished third in the men’s 200-metre individual medley at the Athens Olympics, becoming the lone TT Olympic swimming medallist.\n\nDuring a recent interview, Bovell III, who competed in five Olympics (2000 in Melbourne, Australia; 2004; 2008 in Beijing, China; 2012 in London, England and 2016 in Rio de Janeiro, Brazil), said, “It’s very unfortunate. I feel sorry for all those athletes who sacrificed so much, trained so hard and some of them who take on lots of debts and spend years after the Olympics paying off.\n\n“It’s very sad to see their hopes and dreams crushed like that, and have to postpone everything by a year.\n\nHowever, Bovell III said, “A lot of athletes after the Olympics, experience something called ‘post-Olympics depression’. It’s where after the Olympics, they’re lost, they don’t know what to do next. They cannot even see beyond the Olympics.\n\n“They’re not even living in reality. They’re living in illusions, this kind of collective psychosis as Olympics being the most important thing in the universe. I think this is a reality check. If you fail to live with reality, reality would come and live with you, and you’re not ready for it.”\n\nThe former men’s 200m IM short-course world record holder added, “I think this, for a lot of athletes who have very unhappy lifestyles, mentally unhealthy, very unhappy people, it puts things in perspective. The Olympics is not life or death, it’s just sports and something (we) do because (we) love it. If you need to (get) a medal in the Olympics to prove that you are a champion, if you need that external validation then, deep down inside, you are a loser.\n\n“If you are secure with yourself, you understand who you are and you understand your limitations, you wouldn’t need any external validation. You don’t need anybody else to tell you you’re great. There are a lot of Olympic gold medallists who, deep down inside, still feel like losers.”\n\nBovell III, who was inducted into the First Citizens Sports Foundation’s Hall of Fame on Sunday, continued, “You need to be secure with yourself and say are you really doing it for the Olympic status and can show off on social media, because that is a big illusion, or are you doing it because you love it, because it’s a path to self-mastery.\n\n“When you control your mind, you control how you think, you have control over yourself. Instead of your environment and your life dictating how you should feel, you choose how you should feel.”"}, {"url": "https://olympics.sporting99.com/track-field/mens-200-meter-individual-medley.html", "page_content": "List of all Olympics Men's 200 Meter Individual Medley winners including gold, silver and bronze medalists.\n\nMen's 200 Meter Individual Medley\n\nMen's 200 Meter Individual Medley swimming found a place for the first time at Olympic Games in 1968. It missed two Olympics in 1976 and 1980 but thereafter it has remained a regular at every Olympic Games. The following table lists all medal winners in Men's 200 Meter Individual Medley swimming at Olympic Games.\n\nMen's 200 Meter Individual Medley Winners at Olympics"}, {"url": "https://swimswam.com/bio/wang-shun/", "page_content": "Wang Shun is a versatile Chinese swimmer, specializing in the medley events. He is a 3x Olmypian and Olympic champion in the 200 IM.\n\nWang began swimming at the age of six and 10 years later he represented China for the first time at the Asian Games where he earned a silver medal in the 200 meter individual medley.\n\nHe currently trains under Zhu Zhigen at the Zhejiang swimming team while studying Business Administration at Shanghai Jiao Tong University.\n\n2012 London Olympic Games\n\nIn his Olympic debut at 18-years-old, Wang finished 22nd in the 200 meter individual medley in 2:00.85.\n\n2013-2014 Season\n\nAt the 2013 Chinese Nationals, Wang broke the national record in the 400 meter individual medley in 4:09.10. A year later at his second Asian Games, he won a bronze medal in the 200 meter individual medley in 1:59.10.\n\n2015 FINA World Championships\n\nIn Kazan, Wang won his first World Championship medal when he finished third in the 200 meter individual medley. He finished behind USA’s Ryan Lochte and Brazil’s Thiago Pereira in a personal best time and Chinese Record of 1:56.81.\n\n2016 Rio Olympic Games\n\nIn Rio, Wang became the first Chinese swimmer to earn an Olympic medal in the 200 meter individual medley when he won a bronze medal. He finished in 1:57.05 behind USA’s Michael Phelps and Japan’s Kosuke Hagino. He also swam the 400 meter medley were he finished 10th in 4:14.46.\n\n2017 World Championships\n\nWang picked up a bronze in the 200 IM again touching in 1:56.28 behind USA’s Chase Kalisz and Japan’s Kosuke Hagino. He stormed back in 27.89, the fastest freestyle split in the field.\n\n2018 Asian Games\n\nWang won a hat trick of medals on Jakarta, including gold in the 200 IM (1:56.52), bronze in the 400 IM (4:12.31), and silver in the men’s 4×200 free relay, where he split 1:46.53 on the third leg.\n\n2018 Short Course World Championships\n\nWang won the gold medal in the 200 IM (personal best 1:51.01) and finished seventh in the 100 IM (51.95).\n\nWang picked up a bronze medal as a part of the 4×200 freestyle relay.\n\n2020 Olympic Games\n\nAfter moving through the prelims and semi-finals as the top seed in the 200 IM, Wang Shun made the most of his position in lane 4. Swimming a strategic race through all 4 strokes, Shun asserted himself on the last 50 to touch first, winning Olympic gold in 1:55.00."}, {"url": "https://bleacherreport.com/articles/1446844-fina-world-swimming-championships-2012-full-results-and-recap", "page_content": "Clive Rose/Getty Images\n\nRyan Lochte and the United States rode their momentum from the 2012 London Summer Olympics to success at the FINA World Swimming Championships.\n\nMichael Phelps didn't join his teammates in the pool, but the U.S. dominated regardless. The Americans have now finished first in the FINA World Championships medal count by an overwhelming margin of victory in back-to-back competitions.\n\nBack in 2006, Australia actually topped the United States and it almost knocked the U.S. off in 2008 as well. But since then, it's been no contest.\n\nStandout performers for the Americans included Lochte, Matt Grevers, Tom Shields, Allison Schmitt and Megan Romano.\n\nHere's the medal count, results and recap of all the swimming action.\n\nMedal Count\n\nRank Nation Gold Silver Bronze Total 1 United States 8 5 7 20 2 Hungary 3 2 3 8 3 China 2 4 3 9 4 Germany 2 1 1 4 5 Lithuania 2 1 0 3 6 Australia 1 3 2 6 7 Denmark 1 2 4 7 8 Russia 1 2 2 5 9 Great Britain 1 1 2 4 10 Italy 1 1 0 2 10 Japan 1 1 0 2 10 South Africa 1 1 0 2\n\nFull medal count can also be found at fina.org.\n\n\n\n\n\nMen's Results\n\nEvent Gold Silver Bronze 50m Freestyle Vladimir Morozov (Russia) Florent Manaudou (France) Anthony Ervin (United States) 100m Freestyle Vladimir Morozov (Russia) Tommaso D'Orsogna (Australia) Yevgeny Lagunov (Russia) 200m Freestyle Ryan Lochte (United States) Paul Biedermann (Germany) Conor Dwyer (United States) 400m Freestyle Paul Biedermann (Germany)\n\nHao Yun (China) Mads Glaesner (Denmark) 1500m Freestyle Mads Glaesner (Denmark)\n\nGregorio Paltrinieri (Italy) Pal Joensen (Faroe Islands) 50m Backstroke Robert Hurley (Australia) Matt Grevers (United States) Stanislav Donets (Russia) 100m Backstroke Matt Grevers (United States) Stanislav Donets (Russia)\n\nGuilherme Guido (Brazil) 200m Backstroke Radoslaw Kawecki (Poland) Ryan Lochte (United States)\n\nRyan Murphy (United States) 50m Breaststroke Aleksander Hetland (Norway) Damir Dugonjic (Slovenia) Florent Manaudou (France) 100m Breaststroke Fabio Scozzoli (Italy) Damir Dugonjic (Slovenia) Kevin Cordes (United States) 200m Breaststroke Daniel Gyurta (Hungary) Michael Jamieson (Great Britain) Viatcheslav Sinkevich (Russia) 50m Butterfly Nicholas Santos (Brazil) Chad le Clos (South Africa) Tom Shields (United States) 100 Butterfly Chad le Clos (South Africa) Tom Shields (United States) Ryan Lochte (United States) 200m Butterfly Kazuya Kaneda (Japan) Laszlo Cseh (Hungary) Nikolay Skvortsov (Russia) 100m Individual Medley Ryan Lochte (United States) Kenneth To (Australia) George Bovell (Trinidad and Tobago) 200m Individual Medley Ryan Lochte (United States) Daiya Seto (Japan)\n\nLaszlo Cseh (Hungary) 400m Individual Medley Daiya Seto (Japan) Laszlo Cseh (Hungary) David Verraszto (Hungary) 4x100m Freestyle Relay United States Italy Australia 4x300m Freestyle Relay United States Australia Germany 4x100m Medley Relay United States Russia Australia\n\nFull results can also be found at fina.org.\n\nBest Male Performer: Ryan Lochte\n\nLochte has gotten quite comfortable at the FINA World Championships.\n\nIn 2008, he left the games with four gold medals and in 2010, he took home six. This year, he’ll return with six golds around his neck and eight medals total.\n\nApparently Lochte is getting so used to winning medals, that he’s giving them away now.\n\nRyan Lochte gives his medal away into a scrum of kids, keeps hold of his shoes though #Istanbul2012 #scworlds — Speed Endurance (@speed_endurance) December 16, 2012\n\nLochte’s greatest moments at the games came when he set the world record in the 100-meter and 200-meter individual medley with a time of 50.71 seconds and 1:49.63. In the 200 IM, no one had ever swum the distance under 1:50 prior to his performance.\n\nWomen's Results\n\nEvent Gold Silver Bronze 50m Freestyle Aleksandra Gerasimenya (Belarus) Francesca (Great Britain) Jeanette Ottesen (Denmark) 100m Freestyle Britta Steffen (Germany) Megan Romano (United States) Yang Yi (China) 200m Freestyle Allison Schmitt (United States) Katinka Hosszu (Hungary) Melanie Costa (Spain) 400m Freestyle Melanie Costa (Spain) Chloe Sutton (United States) Lauren Boyle (New Zealand) 800m Freestyle Lauren Boyle (New Zealand) Lotte Friis (Denmark) Chloe Sutton (United States)\n\n50m Backstroke Zhao Jing (China) Olivia Smoliga (United States) Aleksandra Urbanczyk (Poland) 100m Backstroke Olivia Smoliga (United States) Mie Nielsen (Denmark) Simona Baumrtova (Czech Republic) 200m Backstroke Daryna Zevina (Ukraine) Bonnie Brandon (United States) Duane Da Rocha (Spain) 50m Breaststroke Ruta Meilutyte (Lithuania) Alia Atkinson (Jamaica) Sarah Katsoulis (Australia) 100m Breaststroke Ruta Meilutyte (Lithuania) Alia Atkinson (Jamaica) Rikke Moller Pedersen (Denmark) 200m Breaststroke Rikke Moller Pedersen (Denmark) Laura Sogar (United States) Kanako Watanabe (Japan) 50m Butterfly Lu Ying (China) Jiao Liuyang (China) Jeanette Ottesen (Denmark) 100 Butterfly Ilaria Bianchi (Italy) Liu Zige (China) Jemma Lowe (Great Britain) 200m Butterfly Katinka Hosszu (Hungary) Jiao Liuyang (China) Jemma Lowe (Great Britain) 100m Individual Medley Katinka Hosszu (Hungary) Ruta Meilutyte (Lithuania) Zhao Jing (China) 200m Individual Medley Ye Shiwen (China) Katinka Hosszu (Hungary) Hannah Miley (Great Britain) 400m Individual Medley Hannah Miley (Great Britain) Ye Shiwen (China) Katinka Hosszu (Hungary) 4x100m Freestyle Relay United States Australia Denmark 4x200m Freestyle Relay United States Russia China 4x100m Medley Relay Denmark Australia United States\n\nFull results can also be found at fina.org.\n\n\n\n\n\nBest Female Performer: Katinka Hosszu\n\nUnlike Lochte, Hosszu didn’t have sky-high expectations in Istanbul stemming from Olympic success, but that didn’t stop her from earning a collection of medals for Hungary.\n\nShe won gold in the 200-meter butterfly finishing with a time of 2:02.20, gold in the 100-meter individual medley with a time of 58.49 seconds, silver in the 200-meter freestyle with a 1:54.31, silver in the 200 IM with a 2:04.72 and bronze in the 400 IM with a 4:25.95.\n\nHosszu is only 23 years old. She’s a fairly new face to the swimming world, but it won’t be long before her name is well-recognized.\n\nHer performance single-handedly pushed Hungary into the medal count top 10. And combined with the success of her teammates, the nation finished second only behind the U.S.\n\nDavid Daniels is a featured columnist at Bleacher Report and a syndicated writer.\n\nFollow @TheRealDDaniels"}, {"url": "https://www.meppublishers.com/george-bovell-iii-outswims-old-olympic-record-but-ends-2008-run-without-medal/", "page_content": "25-year-old Trinidadian swimmer, George Bovell III, beat his own personal best and the Olympic record (at the time) for the 50m freestyle in his swims in the heat and semifinals. Bovell fell short of a berth in the finals after finishing sixth in his semifinal tonight, which was eventually won by Cesar Cielo Filho (21.34) of Brazil.\n\nEarlier this week, Bovell competed in the 100m freestyle semi-final, breaking the T&T national record, but did not qualify for the finals.\n\nDue to injury, Bovell was unable to compete in the event which won him a historic bronze medal in 2004: the 200m individual medley (IM). His 22-year-old younger brother, Nicholas, did compete in the 200m IM heats, clocking 2:03.90 and placing 36th overall. George clocked 1:58.80 in his medal-winning swim in Athens.\n\nIn a post on his Facebook Fan Page, George gave his take on his 2008 Olympic experience:\n\nThanks everyone so much for the support. I have swum out of my mind here best times and bettering the old olympic record which is something that I will cherish forever. It is crazy to think that I would have won any olympic in history with that time. Unfortunately times change and I am left with the opinion that this olympics is the greatest show in history and not the greatest sporting event.\n\nMeanwhile, Trinidad & Tobago’s medal hopes continue tonight and tomorrow as Olympic Track and Field events commence."}, {"url": "https://www.al.com/sports/2021/08/alabama-athletes-win-16-olympic-medals-in-tokyo.html", "page_content": "Alabama athletes won six gold medals, six silver medals and four bronze medals in the Tokyo Olympics.\n\nIncoming Auburn freshman Suni Lee won three of the medals, earning gold in the women’s all-around, silver in the women’s team competition and bronze in the women’s uneven bars while competing for the United States in artistic gymnastics.\n\nFormer Auburn swimmer Zach Apple won two gold medals as he handled the anchor leg for the United States’ winning teams in the men’s 4-by-100 freestyle relay and the men’s 4-by-100 medley relay.\n\nFor Troy graduate Vincent Hancock his gold medal in men’s skeet was the third of his Olympic career after he finished first in the event at the 2008 Beijing Games and the 2012 London Games.\n\nA look at how Alabama’s Olympic roster fared in Tokyo:\n\nARGENTINA\n\nSwimming\n\n· Santiago Grassi (Auburn): Won a heat of men’s 100-meter butterfly, but his time of 52.07 seconds did not place in the top 16, which was needed to advance to the semifinals. Grassi also finished sixth in a heat of the men’s 50-meter freestyle in 22.67 seconds.\n\nBAHAMAS\n\nTrack and field\n\n· Donald Thomas (Auburn): Cleared 2.21 meters in the qualifying round of the men’s high jump, which did not advance him to the medal round.\n\nBRAZIL\n\nSwimming\n\n· Marcelo Chierighini (Auburn): Swam the anchor leg as Brazil finished eighth in the men’s 4-by-100-meter freestyle relay in 3:13.41 after qualifying with a 3:12.59 for a third-place heat finish. Chierighini also was on the men’s 4-by-100 medley relay, but Brazil was disqualified in its heat before he got his turn in the water.\n\nBULGARIA\n\nSwimming\n\n· Diana Petkova (Alabama): Finished eighth in a heat of the women’s 50-meter breaststroke in 1:10.6 and eighth in a heat of the 200-meter individual medley in 2:16.70.\n\nCANADA\n\nArtistic gymnastics\n\n· Shallon Olsen (Alabama): Finished seventh in the women’s vault final with a 14.550 average on two attempts.\n\nTrack and field\n\n· Natassha McDonald (Alabama): Finished seventh in a heat of the women’s 400-meter dash in 53.54.\n\nCYPRUS\n\nSwimming\n\n· Kalia Antoniou (Alabama): Finished fourth in a heat of the women’s 50-meter freestyle in 25.41 and first in a heat of the women’s 100-meter freestyle in 55.38, but the time did not rank among the top 16 needed to reach the semifinals.\n\nGERMANY\n\nSwimming\n\n· Leonie Kullman (Alabama): Finished eighth in a heat of the women’s 400-meter freestyle in 4:10.25 and swam the second leg of the women’s 4-by-200 freestyle relay for Germany, which finished sixth in the medal race in 7:53.89. Kullman also swam the second leg as Germany qualified for the medal race with a third-place heat finish in 7:52.06.\n\nTennis\n\n· Tim Puetz (Auburn): Won a first-round match in men’s doubles with partner Kevin Krawietz 6-2, 6-1 over Argentina’s Facundo Bagnis and Diego Schwartzman before being eliminated by Great Britain’s Andy Murray and Joe Salisbury 6-2, 7-6(2) in the second round.\n\nGREECE\n\nSwimming\n\n· Kristian Gkolomeev (Alabama): Finished sixth in the men’s 50-meter freestyle in 21.72 after swimming 21.66 in a heat victory and 21.60 in a second-place semifinal showing to eventual gold-medalist Caeleb Dressel of the United State. Gkolomeev also swam the anchor leg for Greece in its eighth-place heat finish in the men’s 4-by-100 freestyle relay in 3:15.29.\n\nGRENADA\n\nTrack and field\n\n· Kirani James (Alabama): Won the bronze medal in the men’s 400-meter dash to become the first athlete with three Olympic medals in the events. James won the gold medal at the 2012 London Games and the silver medal at the 2016 Rio de Janeiro Games. In the final, James ran 44.19 to finish behind the 43.85 of Steven Gardiner from the Bahamas and 44.08 of Anthony Jose Zambrano of Colombia. James had the fastest time in the 400 semifinals in 43.88 after advancing with a 45.09 heat run.\n\nGUATEMALA\n\nSwimming\n\n· Luis Martinez (Auburn): Finished seventh in the men’s 100-meter butterfly in 51.09. Martinez reached the medal race with a 51.29 for a second-place heat finish and a 51.30 in the semifinals.\n\nICELAND\n\nSwimming\n\n· Anton McKee (Alabama): Finished second in a heat race of the men’s 200-meter breaststroke in 2:11.64, but that was not among the 16 fastest times needed to advance to the semifinals.\n\nIRELAND\n\nGolf\n\n· Stephanie Meadow (Alabama): Finished seventh in the women’s tournament with a 12-under-par 272. Meadow’s four rounds were 72, 66, 68 and 66 on the par-71 course.\n\nITALY\n\nSoftball\n\n· Emily Carosone (Auburn): Batted 0-for-10 as the designated player in Italy’s five opening-round games, which were all losses.\n\nJAMAICA\n\nTrack and field\n\n· Nathon Allen (Auburn): Ran the anchor leg as Jamaica finished sixth in the men’s 4-by-100 relay in 2:58.76. He also ran the anchor leg in the qualifying heat as Jamaica finished second to Poland in 2:59.29. Allen finished fourth in a heat of the men’s 400-meter dash in 46.12, which was not fast enough to reach the semifinals.\n\n· Remona Burchell (Alabama): Won a gold medal in the women’s 4-by-100 relay, although she did not run in the medal race. Burchell helped Jamaica qualify for the finals by running the third leg in a third-place showing in the qualifying heat.\n\nKUWAIT\n\nSwimming\n\n· Abbas Qali (Alabama): Finished fourth in a heat of the men’s 100-meter butterfly in 53.62.\n\nLUXEMBOURG\n\nSwimming\n\n· Julie Meynen (Auburn): Finished third in a heat of the women’s 50-meter freestyle in 25.36 and seventh in a heat of the women’s 100-meter freestyle in 55.69. Neither time was fast enough to advance.\n\nNETHERLANDS\n\nWomen’s soccer\n\n· Merel van Dongen (Alabama): Played the entire way as a midfielder in the Netherlands’ 10-3 victory over Zambia and 8-2 victory over China in Group F play. She not play in a 3-3 Group F tie with Brazil or a penalty-kick loss to the United States in the women’s quarterfinals.\n\nSERBIA\n\nWomen’s basketball\n\n· Yvonne Anderson (Hoover): Scored 24 points in Serbia’s 91-76 loss to France in the bronze-medal game after netting 15 in a 79-59 loss to the United States in the semifinals. Anderson scored 55 points as Serbia defeated Canada, Korea and China and lost to Spain in Group A play.\n\nTRINIDAD AND TOBAGO\n\nTrack and field\n\n· Kai Selvon (Auburn): Ran the third leg as Trinidad and Tobago finished eighth in a heat race of the women’s 4-by-100 relay in 43.62.\n\n· Jereem Richards (Alabama): Finished eighth in the gold-medal race of the men’s 200-meter dash in 20.39 after advancing with a heat victory in 20.52 and a third-place 20.10 in the semifinals. Richards also ran the second leg as Trinidad and Tobago finished eighth in the men’s 4-by-400 relay gold-medal race in 3:00.85. He handled that same leg in the qualifying heat, when Trinidad and Tobago placed third in 2:58.60.\n\n· Portious Warren (Alabama): Finished 11th in the women’s shot put at 18.32 meters after qualifying with a personal best of 18.75.\n\nUNITED STATES\n\nArtistic gymnastics\n\n· Suni Lee (Auburn): Won the gold medal in women’s all-around with a score of 57.433. Lee also won a silver medal in the women’s team final and a bronze medal in the women’s uneven bars. She finished fifth in the women’s balance beam. In the women’s team final, Lee competed in uneven bars, balance beam and floor exercise and posted the best score in each for the United States. She tied for the best score overall on uneven bars and was second-best on balance beam.\n\nBaseball\n\n· Brandon Dickson (Marbury High School in Deatsville, Central Alabama Community College): Won a silver medal after the United States lost to Japan 2-0 in the gold-medal game. Dickson made three appearances out of the bullpen in the United States’ six games.\n\n· David Robertson (Paul Bryant High School in Cottondale, Alabama): Won a silver medal after the United States lost to Japan 2-0 in the gold-medal game. Robertson made three appearances out of the bullpen in the United States’ six games, and he picked up saves in a 4-2 victory over Korea and a 3-1 victory over the Dominican Republic.\n\nGolf\n\n· Justin Thomas (Alabama): Finished tied for 22nd in the men’s tournament at 10-under-par 274. Thomas recorded rounds of 71, 70, 68 and 65.\n\nShooting\n\n· Amber English (Phenix City resident): Won the gold medal in women’s skeet by hitting an Olympic record 56 of 60 shots.\n\n· James Hall (Jacksonville State): Finished 10th in qualifying in 10-meter men’s air pistol at 577, one out of the top eight, which advanced to the final. Hall also placed 10th shooting with Sandra Uptagrafft in the qualification stage for the 10-meter air pistol mixed team event.\n\n· Vincent Hancock (Troy): Won the gold medal in men’s skeet by hitting an Olympic record 59 of 60 shots. Hancock also won the gold medal in men’s skeet at the 2008 Beijing Games and 2012 London Games.\n\n· Sandra Uptagrafft (Troy): Finished 49th in qualifying for the women’s 10-meter air pistol, 24th in women’s 25-meter pistol precision qualification and 33rd in women’s 25-meter pistol rapid qualification. Uptagrafft also placed 10th shooting with James Hall in the qualification stage for the 10-meter air pistol mixed team event.\n\nSoftball\n\n· Haylie McCleney (Mortimer Jordan High School in Kimberly, Alabama): Won a silver medal after the United States lost to Japan 2-0 in the gold-medal game. McCleney finished second in the tournament with a .529 batting average and had the most hits with nine. The center fielder was selected for the all-tournament team.\n\nSwimming\n\n· Zach Apple (Auburn): Won gold medals by swimming the anchor legs for the United States’ victories in the men’s 4-by-100 freestyle relay and men’s 4-by-100 medley relay. The U.S. team won the former in 3:08.97 and the latter in a world-record time of 3:26.78. Apple swam the third leg in the gold-medal race in the men’s 4-by-200 freestyle relay, in which the United States placed fourth in 7:02.43. Apple reached the semifinals of the men’s 100-meter freestyle, where he posted a sixth-place finish in 48.04.\n\n· Zach Harting (Bob Jones High School in Madison): Finished fourth in a semifinal race in the men’s 200-meter butterfly in 1:55.35, but that time did not advance to the final race. Harting had finished second in his opening heat in 1:54.92.\n\n· Annie Lazor (Auburn): Won the bronze medal in the women’s 200-meter breaststroke with a time of 2:20.84. Lazor had advanced by swimming 2:22.76 in her heat and 2:21.94 in the semifinals.\n\n· Paige Madden (UMS-Wright in Mobile): Won a silver medal in the women’s 4-by-200 freestyle relay. Madden swam the second leg as the United States set a national record with a 7:40.73, which bettered the Olympic record but was 0.4 seconds behind China in the gold-medal race. Madden also finished seventh in the women’s 400-meter freestyle gold-medal race in 4:06.81. She reached the final with a 4:03.98 in qualifying.\n\n· Rhyan White (Alabama): Won a silver medal in the women’s 4-by-100 medley relay, even though she did not swim in the medal race. White had helped the United States qualify for the finals by swimming the backstroke leg in qualifying. White also finished fourth in the women’s 100-meter backstroke final in 58.43 and fourth in the women’s 200-meter backstroke final in 2:06.39. She missed a medal in the latter race by 0.22 seconds.\n\nTrack and field\n\n· Quanesha Burks (Hartselle High School, Alabama): Cleared 6.56 meters in qualifying for the women’s long jump, which was 13th-best. The top 12 advanced to the finals.\n\n· Rachel Dincoff (Auburn): Had a best throw of 56.22 meters in the women’s discus, which did not qualify for the medal round.\n\n· JuVaughn Harrison (Columbia High School in Huntsville): Finished fifth in the men’s long jump with an 8.15-meter showing and seventh in the men’s high jump by clearing 2.33 meters.\n\n· Daniel Haugh (Alabama): Finished 11th in the gold medal round of the men’s hammer throw with a toss of 76.22 meters.\n\n· Shelby McEwen (Alabama): Finished 12th in the medal round of the men’s high jump by clearing 2.27 meters. He had come out of qualifying thanks to a 2.28-meter jump.\n\nWeightlifting\n\n· Sarah Robles (Alabama): Won a bronze medal in the women’s +87kg competition with a snatch of 128 kilograms and a clean and jerk of 154 kilograms for a 282 total. That made her the first U.S. woman with two Olympic weightlifting medals. Robles won a bronze medal in women’s +75kg at the 2016 Rio de Janeiro Games.\n\nU.S. VIRGIN ISLANDS\n\nSwimming\n\n· Adriel Sanes (Auburn): Finished third in a heat of the men’s 100-meter breaststroke in 1:02.43 and eighth in a heat of the men’s 200-meter breaststroke in 2:16.87. Neither time advanced.\n\nVincent Hancock of the United States shoots on his way to winning the Olympic gold medal in men’s skeet on July 26, 2021, at the Asaka Shooting Range in Tokyo.AP Photo/Alex Brandon\n\nMark Inabinett is a sports reporter for Alabama Media Group. Follow him on Twitter at @AMarkG1."}, {"url": "https://olympics.com/en/news/michael-phelps-olympic-medals-record-how-many-gold-swimmer-world-record", "page_content": "It is a name that resonates around the world, even among people who may not be fans of sport. Michael Phelps, arguably the best swimmer in history, is regarded as one of the greatest athletes of all time, not just due to his record-breaking feats, but also due to the longevity of his career. Born on June 30, 1985, in Baltimore, Maryland, Phelps took to swimming at the age of seven. He trained with coach Bob Bowman at the North Baltimore Aquatic Club and quickly broke multiple age-group records. His large frame, broad shoulders and big feet, which act like fins in the water, made his body the perfect fit for swimming. So much that Phelps won the highest number of medals in the entire Olympics - 28 medals across five Summer Games. Michael Phelps’ Olympics medals tally consists of 23 gold medals – the most Olympic gold medals ever won - three silver and two bronze medals. Here, we take a look at Michael Phelps’ medal performances in each of the Olympics he took part in: Athens 2004 Michael Phelps was only 15 when he made the American swimming Olympics team for Sydney 2000. He finished just fifth in the 200-metre butterfly final but he would win golds four years later. The 400m individual medley at Athens 2004 gave Phelps his first Olympic gold medal and his time of 4:08.26 made him the then-world record holder, which was three seconds faster than his second-placed compatriot Erik Vendt.\n\nMichael Phelps celebrates his first Olympic gold medal at Athens 2004.\n\nBronze in the 4x100 m freestyle and 200m freestyle followed in the next two days before Phelps reached the top step again in the 200-metre butterfly in an Olympic record time of 1:54.04. In the 4x200m freestyle relay, his second team event, Phelps, Ryan Lochte, Peter Vanderkaay and Klete Keller became gold medallists before Phelps won two more golds - the 200-metre individual medley and 100-metre butterfly. He then opted out of swimming in the 4x100m medley final, instead allowing Ian Crocker to swim. The American team duly won gold with a world record time of 3:30.68 but since Phelps had swum in the heats, he was also handed a gold medal. Over the course of a week, the 19-year-old Phelps had won five golds and two bronze, his seven-medal haul making it the second biggest in Olympic history behind Mark Spitz, who had won seven golds at Munich 1972. Phelps would go on to beat that in four years’ time. Athens 2004 Medal Haul: Five golds, two bronze Beijing 2008 The swimming pools at the Beijing National Aquatics Centre played host to the American swimming legend’s consummate Olympic performance. How many gold medals did Michael Phelps win you ask? Well, the answer is eight, each of them in either world or Olympic record time, and it also broke Mark Spitz’s 36-year record for most gold medals in a single Olympics. He ended up winning gold medals in the 400-metre individual medley, 200-metre freestyle, 100-metre butterfly, 200-metre butterfly, 200-metre medley, 4x100m freestyle, 4x200m freestyle and 4x100m medley. He broke his own world records in the first categories while setting new ones in every other category except the 100-metre butterfly. However, Phelps swam the 100-metre butterfly in an Olympic record time to become the first swimmer to defend an Olympic butterfly title. It also brought his seventh gold at Beijing 2008, which took him level with Mark Spitz then. Phelps went on to break that long-standing record with an incredible eighth gold medal of the Olympics in the 4x100m medley relay as teammates Brendan Hansen, Aaron Peirsol and Jason Lezak helped deliver it in a world record time of 3:29.34, breaking their existing record by more than a second. Michael Phelps, already a great after the 2004 Olympics, had now truly etched his name in the annals of history. Beijing 2008 Medal Haul: Eight golds\n\nPhelps conquers all in Beijing\n\nLondon 2012 In contrast to his other Olympics appearances, London 2012 did not start off with a medal for Phelps. In fact, his first gold medal came in the fourth event he participated in. He finished fourth in the 400-metre individual medley, the first time he had missed out on any medal since 2000. He was consigned to silver medals in the 200-metre butterfly by South African swimmer Chad le Clos and 4x100m freestyle relay by the French team. The American swimmer won his first gold at the 2012 Olympics in the 4x200m freestyle relay and followed it up with another in the 200-metre individual medley, beating compatriot Ryan Lochte. At this point, Michael Phelps' medals tally at the Olympics was 19, one more than gymnast Larisa Latynina, and became the all-time record holder of most Olympic medals won.\n\nMichael Phelps’ gold in the 200-metre individual medley made him the most successful athlete in Olympic history.\n\nHe wasn’t done yet. Phelps returned to the pool to win two more golds – in the 100-metre butterfly and 4x100m medley to end with six medals at the event, making him the most successful swimmer for the third Olympics in a row. He announced his retirement after the 2012 Olympics, claiming that he was ‘done with the sport’. There was one final twist in the tale for the decorated Olympian though. London 2012 Medal Haul: Four golds, two silvers Rio 2016 The allure of the water proved too tempting for Phelps and the American legend announced in April 2014 that he would make a return to the pool. The motivation now was to just swim for himself and not train specifically for any glory. However, you cannot quite keep Phelps away from medals, as was proved at the 2016 Olympics in Rio de Janeiro. The 4x100m freestyle relay brought Phelps his first gold medal at Rio 2016. The 200-meter butterfly and 200-metre individual medley brought two more solo gold medals. Conor Dwyer, Townley Haas and Ryan Lochte played their part in delivering yet another gold medal for Phelps in the 4x200m freestyle relay. Phelps’ final individual event at the Olympics did not end with a customary gold, as he was beaten in the 100-meter butterfly by Singapore’s Joseph Schooling to end up with silver.\n\nMichael Phelps ended his career with team gold in the 4x100m medley relay at Rio 2016.\n\nHowever, in quite the perfect way to end his swimming career, Michael Phelps won gold in the 4x100m medley along with Ryan Murphy, Cody Miller and Nathan Adrian with the American team breaking the Olympic record with a 3:27.95. It brought the curtains on a terrific career for Michael Phelps, who had won six more medals at 31 years old, when most swimmers are well into retirement. Phelps is undoubtedly one of the greatest Olympians of all time. Rio 2016 Medal haul: Five golds, one silver Michael Phelps' Olympic medals"}, {"url": "https://alumni.msu.edu/stay-informed/alumni-stories/cover-story-msus-olympic-heritage", "page_content": "Cover Story: MSU's Olympic Heritage\n\nJuly 1, 2008\n\nMSU Olympians have established a long, competitive record that will be honored during Homecoming festivities this fall.\n\nAt the pinnacle of world athletic competition—the Olympic Games—Michigan State Spartans have forged 13 gold medals, 12 silver, and 5 bronze with their spirited performances.\n\nAnother 5 gold medals and 3 bronze medals have been produced by Spartans serving as Olympic coaches.\n\nThis fall, MSU will honor its 107 Olympians during Homecoming weekend, Oct. 3-4.\n\nMSU has been represented at every quadrennial Summer Olympiad from 1924 through 2004—18 consecutive Olympics—with the exception of the 1980 Moscow Games, which were boycotted by 65 nations protesting the Soviet Union’s invasion of Afghanistan. Spartan athletes also have competed in 10 winter Olympics—including seven consecutive games from 1984 through 2006.\n\nIn all, 107 MSU athletes, coaches, an emergency medical director, athletic trainers, press liaisons, and Olympic officials have earned their way to compete or serve at 29 Olympic Games in 22 different sports. Six Spartans qualified for the 1980 Moscow Games but did not attend because of the boycott.\n\nGiven MSU’s longtime leadership in international education and outreach, it’s no surprise that Spartans have represented the Olympic teams of 13 countries besides the U.S.—Australia (two silver medals), Bahamas (one gold, one silver medal), Barbados, Belgium, Britain, Canada (one silver, one bronze medal), Germany, Italy, Japan, Nigeria, Norway, Puerto Rico, and South Africa.\n\nThe Beijing Summer Olympics will open on August 8, 2008 at the 91,000-seat Beijing National Stadium (“Bird’s Nest”) and close on August 24. Some 10,500 athletes from 206 nations are expected to participate in 302 events in 28 sports. A record number of media representatives is expected to descend upon the Beijing Games, and they will operate under the direction of Spartan Olympian Kevan Gosper, ’55, head of the International Olympic Committee (IOC) Press Commission and an IOC vice president (see profile).\n\nLike Gosper, other Spartans have played key Olympic roles, organizing at the regional and national levels, producing telecasts, outfitting various teams, and developing the modular turfgrass fields for Olympic stadiums in Beijing and Athens.\n\nSpartan Olympic Presence: Leadership to Uniforms to Turf\n\nClaire Waters Ferguson, ’57—As president of the U.S. Figure Skating Association from 1992-95, the first woman to hold that position, Ferguson had oversight of all operations related to the U.S. figure skating team when the Olympics were at Lillehammer, Norway. She presided over one of the most notorious scandals ever in her sport—Tonya Harding’s conspiracy to injure rival Nancy Kerrigan to oust her from competition.\n\nLloyd Ward, ’70—Served as CEO of the U.S. Olympic Committee (USOC) from 2002-2003. Ward was captain of the MSU basketball team his senior year. He was an executive with Proctor & Gamble and Pepsico, and later CEO of Maytag Appliances, prior to his USOC leadership role.\n\nSoichiro Yoshida, MBA ’69—Led a multi-year campaign to win the 1998 Winter Olympics for his hometown of Nagano, Japan. Yoshida built a chain of service stations and Kentucky Fried Chicken (KFC) franchises in Japan, as well as a bio-diesel plant that converts KFC oil into automotive fuel.\n\nDennis Lewin, ’65—As vice president for ABC Sports Television, led TV production at eight Olympics—the 1968 Summer Games at Mexico City; 1972-Munich; 1976-Montreal; and 1984-Los Angeles; as well as the 1968 Winter Games at Grenoble, France; 1980-Lake Placid, NY; 1984-Sarajevo, Yugoslavia; and 1988-Calgary, Canada. Lewin produced many memorable telecasts, including figure skater Peggy Fleming’s “gold” performance in 1968; swimmer Mark Spitz’s seven gold medals in 1972; and the USA “Miracle on Ice” victory over Russia in 1980. He was studio producer for all 99 hours of daytime coverage of the 1984 Los Angeles Summer Games.\n\nMichael Budman, ‘68, and Donald Green – Founders of Roots Canada Ltd., Toronto, designed and provided the uniforms for the U.S. Olympic teams in the 2002 Salt Lake City Winter Games; the 2006 Winter Torino, Italy Olympics; and the 2004 Athens Summer Olympics. Their U.S. team berets became the “must have” item at the 2002 Salt Lake City Winter Games. They also have outfitted Canadian and British Olympic teams.\n\nMSU turfgrass experts John “Trey” Rogers, III, professor of crop and soil sciences, and doctoral student Alec Kowalewski spearheaded the construction of the modular turfgrass field for the Beijing National Stadium.\n\nMSU Olympic Gold Medal Winners\n\n1928—The first Spartan to win Olympic gold was sprinter Frederick P. Alderman at the 1928 Summer Games in Amsterdam, Holland, who helped set the world record in the 4x400-meter relay (3:14.2).\n\nAlderman was MSU’s first individual NCAA champion in any sport. He blazed to NCAA titles in the 100-yard and 220-yard dashes at the 1927 NCAA track & field championships in Chicago’s Soldier Field. Along with fellow Spartan sprinters Bohn Grim, Forrest Lang, and Henry Henson, they tied the world record in the 4x110-yard relay at 41.6 seconds in 1927. In 1996, Alderman, then 91, helped carry the Olympic torch to the Atlanta Summer Games.\n\n1952—Clarke C. Scholes, ’52, won Olympic gold in the 100-meter freestyle at the 1952 Summer Games in Helsinki (see profile), setting the Olympic record (57.10) in a preliminary heat.\n\n1960—Doug Blubaugh, MSU assistant wrestling coach, won a gold medal in freestyle wrestling at the Rome Summer Games.\n\n1960—Eugene W. Grazia, ’60,andWeldon H. Olson, ’56, each won gold medals as members of the USA hockey team in the 1960 Winter Olympics at Squaw Valley, CA (see profiles).\n\n1968—Linda Gustavson (McGuire), ’72, won a gold medal in the 4x100 meter freestyle swimming relay in Mexico City.\n\n1968—Harry Kendrick, ’70, and Marvin Knight, ’70, M.A. ’80, were members of the gold medalist U.S. baseball team; MSU legend Danny Litwhiler was the team’s co-head coach. Baseball was a demonstration sport in 1968, but was elevated to official Olympic sport in the five Olympiads from Barcelona 1992 to Beijing 2008.\n\n1968—Kenneth M. Walsh, ’67, won two gold medals at the Mexico City Summer Games—in the 4x100 freestyle relay and the 4x100 medley relay (see profile).\n\n1992—Earvin “Magic” Johnson won gold at the 1992 Barcelona Games as a member of the U.S. men’s basketball team (see profile).\n\n2000—Sevatheda Fynes, ’98,member of the Bahamian women’s track team, won a gold medal in the 4x100-meter relay at the Sydney Summer Games (see profile).\n\n2000—Steve Smith won gold at the 2000 Sydney Games as a member of the U.S. men’s basketball team (see profile).\n\nMSU Silver Medal Winners\n\n1956—Sprinters Kevan Gosper, ’56, and David Lean, ’58, M.A. ’59, won silver medals as members of the Australian 4x400-meter relay team at the 1956 Melbourne Summer Games (see profiles).\n\n1956—Weldon H. Olson, ’55,won a silver medal on the runner-up USA hockey team at the Cortina d’Ampezzo Winter Olympics (see profile).\n\n1964—Gary J. Dilley, ’67, won swimming silver in the 200-meter backstroke at the Tokyo Summer Olympics (see profile).\n\n1968—Donald R. Behm, ’68, M.A. ’80,won wrestling silver in the bantamweight class at the Mexico City Summer Olympics (see profile).\n\n1968—Linda Gustavson (McGuire), ’72, won a silver medal in 400-meter freestyle swimming at the Mexico City Summer Games. She set a world record in the 200-meter freestyle (2:07.9).\n\n1968—Pamela Kruse, ’73, Ph.D. ’79 won a silver medal in 800-meter freestyle swimming at the Mexico City Summer Games (see profile). In 1967, she had set world records in the 400-meter freestyle (4:36.8 and 4:36.4) and in the 200-meter freestyle (2:09.7).\n\n1968–Kenneth M. Walsh, ’67—Swimming--Silver in the 100-meter freestyle at the Mexico City Summer Olympics. He was the world record-holder of the event at the time (see profile).\n\n1984–Judi Brown-Clarke, ’83, M.S. ’95,won track silver in the 400-meter hurdles at the Los Angeles Summer Olympics (see profile).\n\n1994—Dwayne Norris won a Silver Medal as a member of Canada’s ice hockey team in Lillehammer, Norway. In 1991-92 he scored 40 goals in 41 games for the Spartans and was named first-team All-CCHA and an NCAA West first-team All-American.\n\n1996—Sevatheda Fynes, ’98,won track silver with the women’s Bahamian 4x100-meter relay team.\n\n2002—Mike York won hockey silver on Team U.S.A. at the Salt Lake City Winter Olympics (see profile).\n\nMSU Bronze Medal Winners\n\n1948–Leland G. Merrill won wrestling bronze in the 160.5 pound class at the London Summer Olympics. In the same year, Merrill won the National AAU wrestling title at 160 pounds.\n\n1964–Marcia Jones Smoke, ’64, won the bronze medal in kayak at the1964 Tokyo Summer Games (see profile).\n\n1968—Linda Gustavson (McGuire), ’72,won the bronze medal in 100-meter freestyle swimming at the Mexico City Summer Games.\n\n1968—Marilyn Corson Whitney, ’72, M.A. ‘74—Swimming (4x100-meter freestyle relay)—Canada—Bronze Medal—Mexico City Summer Games.\n\n1976—Stan Dziedzic, M.A. ’77—MSU assistant wrestling coach—Wrestling (freestyle)—Bronze Medal—Montreal Summer Games.\n\nEarning a Position on the U.S. Olympic Team: A High Honor\n\nWinning a position on U.S. Olympic teams is a high honor, stamping an athlete as one of the elite performers in the nation, and the world.\n\nQualifying for Olympic teams differs for almost every sport. Qualifying for team sports, such as soccer or basketball, usually means surviving the cut at team selection camps. For individual events, such as track and swimming, athletes must earn a position in Olympic Trials that often serve as national championships. In track, for example, the top three athletes in head-to-head competition qualify for an event such as the 100-meter dash.\n\nMSU’s Three-Time Olympians\n\nSix Spartans have participated in three different Olympics.\n\nChris-Carol Bremer, MSU swimmer in 1993-94, competed as a member of the German swimming team in 1992 and 1996, and made Germany’s 2000 Olympic team as captain. Bremer holds the MSU record in the 200-yard butterfly (1:45.71) and ranks in MSU’s top ten in 200-, 500-, 1,000- and 1,650-yard freestyle and in the 400-yard individual medley.\n\nErnest Crosbie represented the U.S. in the 50 kilometer race walk at the 1932 Los Angeles Summer Olympics; the 1936 Berlin Summer Olympics; and the 1948 London Summer Olympics. It’s remarkable that the span of time between Crosbie’s second and third Olympics was 12 years. This resulted from cancellation of the 1940 and 1944 Olympiads due to World War II. Crosbie’s race walking event was not an NCAA track event.\n\nDr. Adolf Weinacker, ’51,participated in the 50 kilometer race walk at the 1948 London Summer Olympics; the 1952 Helsinki Summer Olympics; and the 1956 Melbourne Summer Olympics.\n\nAllan S. Kwartler was a fencer on the U.S. team at the 1952 Helsinki Summer Olympics, the 1956 Melbourne Summer Olympics and the 1960 Rome Summer Olympics.\n\nMarcia Jones Smoke, ’64, participated in three Olympics, winning the bronze medal in the 1964 Tokyo Summer Games in the 500-meter single kayak event. She finished fourth in the 1968 Mexico City games and seventh in the 1972 Munich games.\n\nFred Lowe, ’70, was a U.S. weightlifter at the 1968 Mexico City Summer Olympics; 1972 Munich Summer Olympics; and the 1976 Montreal Summer Olympics. Weightlifting is not an NCAA sport.\n\nMSU’s Two-Time Olympians\n\nSixteen Spartans have participated in two Olympiads each.\n\nRalph H. Young–MSU Athletic Director—associate U.S. track coach–1932 Los Angeles Summer Olympics; and assistant treasurer U.S. Olympic team–1952 Helsinki Summer Olympics. Under Young, MSU athletic director (1923-1954), MSU became a national sports power. During the five-year span 1950-1954, MSU had no fewer than five sports teams ranked in the top ten nationally every year. Young initiated the annual NCAA cross country meet, which was held on the MSU campus every year from 1938 through 1964.\n\nMSU’s outdoor track and field facility is named in Young’s honor, as is the athletic fund that helps underwrite MSU’s 25 sports—12 men’s and 13 women’s.\n\nCharles W. Speiser–Boxing–1948 London Summer Games; 1952 Helsinki Summer Games. Speiser won NCAA boxing titles in 1951 at 175 pounds; and in 1952 at 178 pounds.\n\nKevan Gosper, ‘55– Australian track team–1956 Melbourne, and 1960 Rome Summer Olympics (see profile).\n\nVirginia Baxter McKendrick–Figure Skating–1956 Cortina d’Ampezzo, Italy Winter Olympics; 1960 Squaw Valley Winter Olympics.\n\nWeldon H. Olson, ‘55–Ice Hockey–1956 Cortina d’Ampezzo, Italy Winter Olympics; 1960 Squaw Valley Winter Olympics.\n\nErnestine Russell Weaver, ‘60—Canadian gymnastics team–1956 Melbourne Summer Olympics; 1960 Rome Summer Olympics. Russell was inducted into the U.S. National Gymnastics Hall of Fame in 1986. She was the University of Florida gymnastics coach and led the Gators to three national team titles, and posted a record of 140 dual meet victories versus just eight losses. In 1955 Russell won a National Amateur Athletic Union title.\n\nJudy K. Goodrich Walker, ‘61–Fencing–1956 Melbourne, and 1960 Rome Summer Olympics.\n\nJoe Puleo, ‘66—Weightlifting—1968 Mexico City, and a member of the 1980 Moscow team. He didn't medal in the Olympics but won five national weightlifting championships (at 165 and 181 pounds) along with gold medals at the Pan American Games of 1963 and 1967. Because of the 65-nation boycott of the 1980 Moscow Summer Games, Puleo competed in a substitute championship held in China and thus became the U.S. weightlifter with the longest international career.\n\nMarilyn Corson Whitney, ’72, M.A. ‘74—Swimming (4x100-meter freestyle relay)—Canada—Bronze Medal—1968 Mexico City and 1972 Munich Games. From 1970-72, Whitney, one of MSU’s most accomplished swimmers, won 9 Big Ten swimming championships and two national championships (200 yard individual medley, 1970 and 1972).\n\nTom Minkel—1980 Moscow, wrestling, and 1992, U.S. Greco-Roman Wrestling coach, bronze medal.\n\nSally Nogle, Ph.D ‘01–Athletic Trainer–Volleyball–1984 Los Angeles Summer Games; and Athletic Trainer–Rowing–1988–Seoul Summer Olympics.\n\nEric Zemper, ’67, M.S. ’77, Ph. D. ‘82–Track Official–1984 Los Angeles, and 1996 Atlanta Summer Olympics.\n\nMark Konopacke, ‘89—Ski Jumping—1988 Calgary Winter Olympics, 1992 Albertville, France, Winter Olympics. Konopacke was a two-time national ski jumping champion—1988 (Ishpeming, MI) and 1991 (Steamboat Springs, CO—tie with Jim Holland).\n\nDave Carrier–Athletic Trainer–Ice Hockey–1988 Calgary Winter Olympics; and Athletic Trainer–Ski Jumping, Nordic Combined–1992 Albertville, France Winter Olympics.\n\nGeir Hoff, ‘92–Ice Hockey Norway–1988 Calgary, and 1994 Lillehammer, Norway Winter Olympics.\n\nSevatheda Fynes, ‘98–Track–Bahamas–1996 Atlanta, and 2000 Sydney Summer Olympics.\n\nMSU Olympic Coaches\n\n1932—Ralph H. Young, associate track coach, USA, Los Angeles Summer Games.\n\n1960—Pete Newell, MSU men’s basketball coach from 1950-54, was head coach of the 1960 U.S. men’s basketball team—a powerful squad that some later called the “original Dream Team.” Newell led players like Oscar Robertson, Jerry Lucas, Walt Bellamy and Jerry West to an undefeated Olympics, averaging 102 points and a 42.4-point winning margin per game. A “Hall of Fame” coach, Newell is one of only three coaches to have won an N.I.T. championship, an NCAA championship, and Olympic gold.\n\n1968—Danny Litwhiler, MSU baseball coach from 1964-82 and a member of the American Baseball Coaches Hall of Fame, led the U.S. baseball team to a gold medal in the 1968 Mexico City Games. Baseball was then a demonstration sport.\n\n1988, 1992—Tom Minkel, MSU wrestling coach since 1991, was assistant coach of the U.S. Greco-Roman wrestling team at the 1988 Seoul Summer Games and head Greco-Roman coach at the 1992 Barcelona Summer Games, where he led his team to a bronze medal, the highest finish ever by a U.S. team in Greco-Roman wrestling.\n\n1996—Michele Madison, assistant coach, USA field hockey, Atlanta Summer Games.\n\n2000—Karen Dennis, ’77, M.A. ’79, was the U.S. Olympic Women’s Track Coach in 2000, leading the team to five gold and three bronze medals at the Sydney Summer Olympics. Dennis was a national champion sprinter at MSU, winning the women’s 1975 AIAW outdoor track 220-yard dash in 24.9 seconds and setting a world record as part of a 4-x160-yard relay team. Dennis now serves as women’s track coach at The Ohio State University.\n\n2004—Manabu “Manny” Noguchi, Barbadosswimming coach at the Athens Summer Games.\n\nThe Ancient Olympic Games\n\n“The Ancient Olympic Games were initiated in 776 BC in Greece, and were held on the plain of Olympia in Peloponnesos. At the first Olympics, a short sprint was the only event, run by men competing in the nude. The Games were held every four years. The period between Games became known as an ‘Olympiad’. The Greeks used Olympiads as one of their methods to count years.”\n\n“The Games declined in importance as the Romans gained power in Greece. When Christianity became the official religion of the Roman Empire, the Games were seen as a pagan festival and in discord with Christian ethics. In 394 AD emperor Theodosius I outlawed the Olympics...ending a 1,170-year tradition.” (Wikipedia).\n\nHistory And Magnitude of the Modern Olympics\n\nThe first modern Olympics—designated the Games of First Olympiad—were staged in Athens, Greece in April 1896. Opening ceremonies drew 80,000 spectators, including King George I of Greece and his wife Olga, to Panathenaic Stadium. Two hundred forty-one athletes from 14 nations competed in 43 events in 9 sports. Olympic sports then included athletics (track & field), cycling, fencing, gymnastics, shooting, swimming, tennis, weightlifting, and wrestling.\n\nAt the 2004 Athens Summer Olympics, there were 10,625 competitors from 201 countries. There were 301 medal events in 28 different sports. Swimming, diving, synchronized swimming, and water polo are classified as disciplines within the sport of aquatics. For the first time, women’s wrestling was featured.\n\nThe 28 Olympic summer sports are archery, aquatics, badminton, baseball, basketball, boxing, canoeing, cycling, equestrian, fencing, field hockey, football/soccer, gymnastics, handball, judo, modern pentathlon, rowing, sailing, shooting, softball, table tennis, taekwondo, tennis, triathlon, volleyball, weightlifting, wheelchair racing (demonstration event), and wrestling.\n\nU.S. Olympians dominated the 2004 Athens Summer Olympics, winning 102 medals—36 gold, 39 silver, and 27 bronze. Other top ten medal winning nations were: Russia-92, China-63, Australia-49, Germany-49, Japan-37, France-33, Italy-32, Great Britain-30, and South Korea-30.\n\nThe 2006 Turin, Italy Winter Olympics featured 2,508 athletes from 80 nations. They competed in 84 events in 15 different disciplines—ice hockey, figure skating, speed skating, snowboarding, luge, bobsled, skeleton (a type of sledding), curling, cross-country skiing, freestyle skiing, slalom, downhill (Alpine) skiing, ski jumping, Nordic combined (skiing plus ski jumping), and biathlon (skiing and shooting).\n\nThe top 11 medal winning nations were—Germany-29, United States-25, Canada-24, Austria-23, Russia-22, Sweden-14, Switzerland-14, South Korea-11, Italy-11, France-9, Netherlands-9.\n\nThe 2010 XXI Winter Olympics will be held in Vancouver, British Columbia, Canada at the Whistler Olympic Park. Competition will be held in 86 events in 8 sports.\n\nThree Olympic Games were cancelled: in 1916 due to World War I; and in 1940 and 1944 due to World War II.\n\nOlympics: Great Media Events\n\nThe Olympics have become one the world’s great news media events. At the 2000 Sydney Summer Olympics, more than 16,000 journalists and broadcasters were present to report on the Games. An estimated 3.8 billion viewers watched the Games on television. A record number of journalists is expected to attend the Beijing Olympics and Spartan Kevan Gosper, ’55, heads up the IOC Press Commission.\n\nThe Olympic Flame\n\n“At the Ancient Olympic Games—held in Greece 2,700 years ago—the tradition of an Olympic flame was ignited, and it burned throughout the games every four years. It symbolized the death and rebirth of Greek heroes.\n\n“The first torch relay was launched at the 1936 Berlin Summer Olympics. A new flame is lit for every Olympiad in the ancient Olympic stadium in Olympia, Elis, Greece, using a parabolic mirror to focus the rays of the sun.\n\n“The Olympic Torch Relay begins by touring Greece. The flame is then transported (usually by air) to the nation where the Games will be held. After traversing the nation of the Games, carried by runners, walkers, riding horses, and even camels, the last runner lights the large torch in the Olympic stadium where it burns for the duration of the Games.” (Enchanted Learning.com).\n\nThe Olympic Flag\n\n“The flag of the Olympic Games has five interlocking rings–blue, yellow, black, green, and red–on a white background. The rings represent the five sections of the world joined together in the Olympic movement: Africa, the Americas, Asia, Australia, and Europe.\n\n“Baron de Couberin (1863-1937), a French educator, designed the flag in 1913-1914. It was first used at the 1920 Antwerp, Belgium Summer Olympics.\n\n“The flag is paraded during the opening ceremonies of each Olympics and flown during the Games. At the closing ceremonies of each Olympics, the mayor of the host-city presents the flag to the mayor of the next host-city. The flag then remains in the city hall of the next host-city until the opening ceremonies of the Games.” (Enchanted Learning.com)\n\nAs the 2008 Beijing Summer Olympics approach—August 8-24—the Michigan State family will be pulling for a dozen Spartans to earn positions on U.S. Olympic teams: Jamie Krzyminski in the women's marathon; Christen Brown in rowing; Nicole Bush in track; Sevatheda Fynes in track; Jolene Crooks Moore and Kristen Furseth-Mullaney in racewalking; Jeremy Orr in track; Marcus Poteete in swimming; Nick Simmons in wrestling; and Paul Terek in the decathlon. Spartans will also be pulling for two Canadian athletes—MSU junior Danielle Williams, who is vying to make the Canadian team in three-meter diving, and MSU graduate student Nicole Forrester, Canada’s top-ranked high jumper, who has a great chance to compete for her country in Beijing. If one or all succeed, it will sustain MSU's record of participating in every Summer Olympics from 1924 to 2008—19 consecutive—with the exception of the boycotted 1980 Moscow Games.\n\nMSU OLYMPIANS BY YEAR\n\n1924–Colonel William D. Frazer, Paris, France–Pistol.\n\n1928–Frederick P. Alderman–Amsterdam—Track—Gold Medal–4x400-Meter Relay–World Record: 3 minutes, 14.2 seconds.\n\n1932–Ernest Crosbie–50 Kilometer Race Walk.\n\n1932–Thomas C. Ottey–Track.\n\n1932–Ralph H. Young–MSU Athletic Director–Associate Track Coach–USA.\n\n1936–Ernest Crosbie–50 Kilometer Race Walk.\n\n1936–Albert Mangan–Track.\n\n1940 & 1944–Olympic Games cancelled due to World War II.\n\n1948–Ernest Crosbie–50 Kilometer Race Walk.\n\n1948–Charles P. Davey–Boxing.\n\n1948–Lyle E. Garbe–Canada–10 Kilometer Race Walk.\n\n1948–John G. “Jack” Heppinstall–Athletic Trainer.\n\n1948—Dr. Bill Heusner—MSU faculty, Swimming.\n\n1948–George A. Hoogerhyde–Swimming.\n\n1948–Robert G. Maldegan–Wrestling.\n\n1948–Leland G. Merrill–Wrestling–Bronze Medal (160.5 pounds).\n\n1948–Howard F. Patterson–Swimming.\n\n1948–Charles W. Speiser–Boxing.\n\n1948–Dale O. Thomas—MSU physical education staff—Wrestling.\n\n1948–Dr. Adolf Weinacker–50 Kilometer Race Walk.\n\n1952–Warren O. Druetzler–Track.\n\n1952–Allan S. Kwartler–Fencing.\n\n1952–Clarke C. Scholes–Swimming–100-Meter Freestyle–Gold Medal—Olympic Record: 57.4 seconds.\n\n1952–Charles W. Speiser–Boxing.\n\n1952–Dr. Adolf Weinacker–50 Kilometer Race Walk.\n\n1952–Ralph H. Young–MSU Athletic Director–Assistant Treasurer–Team USA.\n\n1956–Virginia D. Baxter McKendrick–Figure Skating.\n\n1956–Judy K. Goodrich Walker–Fencing.\n\n1956–Kevan Gosper–Track–Silver Medal–4 x 400 Meter Relay–Australia.\n\n1956–David Lean–Track–Silver Medal–4 x 400 Meter Relay–Australia.\n\n1956–Allan S. Kwartler–Fencing.\n\n1956–Pearce A. Lane–Boxing.\n\n1956–Choken Maekawa–Boxing.\n\n1956–Weldon H. Olson–Ice Hockey–Silver Medal.\n\n1956–Ernestine Russell Weaver–Gymnastics–Canada.\n\n1956–William Steuart–Swimming–South Africa.\n\n1956–Dr. Adolf Weinacker–50 Kilometer Race Walk.\n\n1960–Virginia D. Baxter McKendrick–Figure Skating.\n\n1960—Doug Blubaugh—MSU assistant wrestling coach—Wrestling (Freestyle)—Gold Medal.\n\n1960–Judy K. Goodrich Walker–Fencing.\n\n1960–Kevan Gosper–Track–Captain, Australian team.\n\n1960–Eugene W. Grazia–Ice Hockey–Gold Medal.\n\n1960–Allan S. Kwartler–Fencing.\n\n1960—Pete Newell—Head coach, U.S. men’s basketball—Gold Medal\n\n1960–Weldon H. Olson–Ice Hockey–Gold Medal.\n\n1960–Ernestine Russell Weaver –Gymnastics–Canada.\n\n1964–Solomon Akpata–Track—Nigeria.\n\n1964–Fendley Collins–MSU Wrestling Coach–Manager, U.S. Wrestling Team.\n\n1964–Gary J. Dilley–Swimming–Silver Medal–200 Meter Backstroke.\n\n1964–Marcia I. Jones Smoke–Canoeing—Bronze Medal, 500-meter singles in kayaking.\n\n1964–William A. Smoke–Canoeing.\n\n1968–Donald R. Behm–Wrestling (Freestyle)–Silver Medal.\n\n1968–George Gonzalez–Swimming–Puerto Rico.\n\n1968—Linda (Gustavson) McGuire—Swimming—Gold Medal (4x100 meter freestyle relay); Silver Medal (400 meter freestyle); Bronze Medal (100 meter freestyle)\n\n1968—Harry Kendrick—Baseball—Gold Medal.\n\n1968—Marvin Knight—Baseball—Gold Medal.\n\n1968—Pamela Kruse—Swimming—Silver Medal (800 meter freestyle)\n\n1968—Danny Litwhiler—Coach, U.S. baseball team—Gold Medal.\n\n1968–Fred Lowe–Weightlifting.\n\n1968—Joe Puleo—Weightlifting.\n\n1968–David B. Thor—Gymnastics.\n\n1968–Ernie Tuchscherer—Soccer.\n\n1968–Douglas Volmer–Hockey.\n\n1968–Kenneth M. Walsh–Swimming–Gold Medals (4x100 meter freestyle and 4x100 meter medley relay); Silver Medal (100 meter freestyle).\n\n1968—Marilyn Corson Whitney—Swimming—Canada—Bronze Medal—4x100 meter freestyle relay.\n\n1968–Peter E. Williams–Swimming.\n\n1968–Marcia Jones Smoke–Singles Kayaking.\n\n1968–Art “Buzz” Demling–Soccer.\n\n1972–Fred Lowe–Weightlifting.\n\n1972–Charles “Mac” McCaffree, Jr.–MSU Swimming Coach–Assistant Manager, USA Swimming Team.\n\n1972–Gayle Robinson–Athletic Trainer–Swimming.\n\n1972—Marilyn Corson Whitney—Swimming—Canada.\n\n1972–Marcia Jones Smoke–Singles Kayaking.\n\n1972–Roger Young–Cycling.\n\n1976—Stanley Dziedzic, Jr.—Wrestling (Freestyle)—Bronze Medal\n\n1976–Fred Lowe–Weightlifting.\n\n1980–Dave Burgering–Diving.\n\n1980–Kevin Machemer–Diving.\n\n1980—Tom Minkel—Wrestling (Freestyle).\n\n1980—Joe Puleo—Weightlifting.\n\n1980–Fred W. Stabley, Sr.–MSU Sports Information Director–Press Liaison.\n\n1980–Diane Williams–Track.\n\n1984–Dr. Roy T. Bergman–MSU Staff Member–Doctor for U.S. Olympic Committee.\n\n1984–Judi Brown–Track–Silver Medal (400 Meter Hurdles).\n\n1984–Gary Haight–Ice Hockey.\n\n1984–Sally Nogle–Athletic Trainer–Volleyball.\n\n1984–Nick Vista–MSU Sports Information Director–Press Liaison.\n\n1984–Dr. Eric Zemper–Track Official.\n\n1988–Sidney Appelboom–Swimming–Belgium.\n\n1988–Dave Carrier–Athletic Trainer–Ice Hockey.\n\n1988–Michael Green–Swimming–Great Britain.\n\n1988–Geir Hoff–Ice Hockey–Norway.\n\n1988-Mark Konopacke—Ski Jumping\n\n1988–Kevin Miller–Ice Hockey.\n\n1988—Tom Minkel—MSU wrestling coach—Assistant coach, U.S. wrestling team (Greco-Roman).\n\n1988–Sally Nogle–Athletic Trainer–Rowing.\n\n1992—Chris Carol-Bremer—Swimming—Germany.\n\n1992–Dave Carrier–Athletic Trainer–Ski Jumping, Nordic Combined.\n\n1992--Mark Konopacke--Ski Jumping\n\n1992—Tom Minkel—Coach, Wrestling (Greco-Roman)—Bronze Medal\n\n1992—Jennifer O’Donnell—Archery.\n\n1992—Ilaria Sciorelli—Swimming—Italy\n\n1992–Jason Woolley–Ice Hockey–Canada.\n\n1992–Julie Farrell-Ovenhouse–Diving.\n\n1992–Earvin “Magic” Johnson—Men’s Basketball–Gold Medal–“Dream Team I.”\n\n1994–Jason Dungjen–Figure Skating.\n\n1994–Dwayne Norris–Ice Hockey—Silver Medal–Canada.\n\n1994–Geir Hoff–Ice Hockey–Norway.\n\n1994—Claire Waters Ferguson—President of U.S. Figure Skating Association, which ran the U.S. Olympic Figure Skating Team.\n\n1996—Chris Carol-Bremer—Swimming—Germany.\n\n1996–Pam Bustin–Field Hockey.\n\n1996–Dr. Eric Deal–Emergency Medical Director of the Atlanta Olympic Games.\n\n1996–Sevatheda Fynes–Track-Bahamas–Silver Medal–4x400 Meter Relay.\n\n1996–Michele Madison–Assistant Coach–Field Hockey.\n\n1996–Ken Hoffman–MSU Sports Information Director–Press Room Manager.\n\n1996–Dr. Eric Zemper–Track Official.\n\n1998—Soichiro Yoshida—MSU MBA ’69—Led multi-year campaign to win the Winter Olympic Games for his hometown of Nagano, Japan.\n\n1998–Rod Brind’amour–Ice Hockey–Team Canada.\n\n2000—Dr. Norman Graham, associate dean of MSU’s James Madison College and coach of MSU’s archery team, was head of the U.S. Archery Team Olympics delegation\n\n2000—Chris Carol-Bremer—Swimming—Captain, German Olympic swimming team.\n\n2000—Jessica Carlson—Archery\n\n2000–Karen Dennis–Coach, USWomen’s Track Team (Four Gold and three Bronze Medals).\n\n2000–Sevatheda Fynes–Track–Gold Medal–Bahamian 4x100 Meter Relay.\n\n2000–Steve Smith–Basketball–Gold Medal–“Dream Team-III.”\n\n2002–Mike York–Ice Hockey–Silver Medal.\n\n2002—Lloyd Ward—CEO of U.S. Olympic Committee.\n\n2004–Paul Terek–Track–Decathlon.\n\n2004–Manabu “Manny” Noguchi–Swimming Coach–Barbados.\n\n2006–John Liles–Ice Hockey.\n\n2006—Jason Muzzatti–Ice Hockey–Italy.\n\n2006–-Tony Tuzzolino–Ice Hockey–Italy.\n\nAuthor: J. Bruce McCristal, ’54 (business-economics). As an MSU student, he was a four-year aide to legendary sports information director, Fred W. Stabley, Sr. In the U.S. Air Force, he was a pilot and public information officer. McCristal served General Motors for 30 years—heading public relations operations at Cadillac, GM Hughes Electronics, and Delco Electronics-Milwaukee, and directed GM’s worldwide employee communications. He has served as chairman of MSU’s Development Fund, and on the MSUAA national board. In 2004, he authored The Spirit of Michigan State (spiritofmichiganstate.com), the first comprehensive MSU history published in 50 years (all profits to MSU). He was elected a Distinguished Alumni in 2005. He originated, edited and produced Spartan Champions (by Jack Ebling)—the story of MSU’s 1987 Big Ten football championship year and 1988 Rose Bowl victory.\n\nDr. Eric Zemper, B.S. ’67, M.S. ’77, Ph.D. ’82, assisted with research for this article. He ran cross country and track for MSU from 1962-67 and was a member of Big Ten championship teams in both sports. He held several MSU course records, including the Ralph Young Field record for the mile. He is a research professor at MSU’s College of Osteopathic Medicine and the University of Michigan Medical School. He officiated at the 1984 Los Angeles and 1996 Atlanta Summer Games.\n\nRobert Bao\n\nSpartan Magazine\n\nAuthor:"}]}