{"\"George Bovell III also set a world record in the 50-": [{"url": "https://ttaquatics.org/2022/02/08/george-bovell-iii-again-recognized-as-one-of-the-fastest-men-ever-by-swimswam-and-swimmingstats/", "page_content": "As we head to yet another CARIFTA Championships we remember one of our own the greatest sprinter of all time from the region the Legendary \" King\" George Bovell III of Trinidad and Tobago.\n\nHe is ranked as the seventh fastest man of all time in the 50 metre freestyle in the Olympic sized pool with his 2009 Rome World Championships blast of of 21.20.That time also stood as a Championship record\n\nHis speed is also unmatched in the region for the 25 yards pool and the 25 metre pool."}, {"url": "https://olympics.com/en/athletes/george-bovell-iii", "page_content": "Year of Birth\n\nYear of Birth 1983\n\nFirst Olympic Games\n\nFirst Olympic Games Sydney 2000\n\nTrinidad and Tobago\n\nTeam Trinidad and Tobago"}, {"url": "https://swimswam.com/george-bovell-visionary-sport/", "page_content": "George Bovell, a name synonymous with Trinidadian swimming, recently enlisted the help of some elite friends in his quest to help inspire a younger generation of swimmers in his home region. Two-time Olympic bronze medalist for Russia, Arkady Vyatchanin (now most likely representing Serbia), Olympic gold medalist for South Africa Roland Schoeman, and World Champion New Zealander Moss Burmester joined the 2004-Olympic bronze medalist in the Caribbean for a series of free clinics using swimming as a platform to both benefit and excite young athletes.\n\nThe “George Bovell Dive In Free Swim Clinics 2015” were held at facilities in St. James, Macoya and San Fernando over January 15-17th, with the prestigious athletes teaching training methods, skills and drills with the purpose of not only encouraging the young attendees within the sport of swimming, but by also offering up hope and inspiration as they interacted and collaborated with the participants.\n\nBovell tells SwimSwam that, “the clinics were a huge success; you all can’t imagine what it meant to those kids. It’s an initiative that I try to put on every year to give back to and hopefully grow the sport here. It also serves to get the youth ‘thinking big’ and to help them understand that, through hard work, anything is possible.”\n\nTo that end, while in the midst of ramping up his own training en route to this year’s Pan American Games and World Championships, Bovell is monitoring the construction of the George Bovell Aquatic Center* taking shape in Couva, Trinidad (*name is not yet official). With the building’s completion targeted for June 2015, Bovell hopes the country can offer the facility to Olympic teams to use for their Rio 2016 staging camps, especially with Trinidad’s temperatures and time zone not far off Rio’s mark.\n\nThis vision falls directly in line with what Bovell describes as his short- and long-term mission for the sport of swimming in Trinidad and Tobago. “In the next five years, I would love to see Trinidad and Tobago hosting regional and international swimming events and have all schools offer learn-to-swim classes as part of their curriculum so that the number of unnecessary drowning deaths annually will be significantly reduced.”\n\nGrowing up in the 90’s and pushing through the age group ranks with what Bovell has previously described as limited knowledge, resources and opportunities, he now feels compelled to contribute to the overall improvement of swimming on all levels. Bovell feels confident that, “with access to world-class facilities, world-class Trinidad swimmers will become the norm and not the exception.”"}, {"url": "https://swimswam.com/george-bovell-lowers-50-breast-national-record-at-belgian-open-championships/", "page_content": "The 2015 Belgian Open Championships are underway in Antwerp, Belgium, and Trinidad & Tobago’s George Bovell is making head lines.\n\nThe 31 year old is currently training in Italy and it is paying off. He qualified second in the men’s 5o breaststroke yesterday, breaking the Trinidad & Tobago national record with his time of 28.10. He set the previous record in 2013 at 28.22. Ioannis Karpouzlis of Greece earned the top seed in the event with his time of 27.36.\n\nLater in finals, Bovell lowered his record again, breaking 28 for the first time with a 27.69. Karpouzlis wasn’t as fast as he was during prelims, but he did win the event with a final time of 27.61.\n\nTo view full results from the first day of the meet, click here."}, {"url": "https://www.sportsintegrityinitiative.com/invasion-of-the-testers/", "page_content": "8 April 2015\n\nBy George Bovell III (pictured), a former world record holding swimmer from Trinidad & Tobago who specialises in freestyle and the individual medley. He intends to compete in a record fifth Olympiad in Rio 2016, and gives his opinion on sport’s drug testing regime.\n\nThe eerie light of the full moon shines through my window blinds as I lay my exhausted body down to sleep. I wonder if they will come to roust me awake again before the sun rises, come for my blood and demand me to do their irrefutable bidding. The banging on my door that heralds the arrival of these strangers of whom I can’t refuse entry, has left me conditioned to sleep lightly and to assume that any early morning noise is them.\n\nI am not alone is suffering from this visiting affliction. It’s the price that we must pay to compete at the top level of international Olympic sports. We submit ourselves to the random, out-of-competition drug testing of our blood and urine in the naive hope that we will be able to compete in a sport that is fair, and doping free.\n\nThe privilege of representing your country comes with great responsibility. In addition to the constant vigilance over the legal status of medications and supplements that are consumed (with many common ones being banned), an online database must be carefully kept up to date with our whereabouts, specifying where we can be found for one hour in each 24 as the spontaneity of life happens and our plans change from day to day.\n\nFor most of us, the hours of the early morning are our safest bet at predicting where we will be at that set time; at home in bed. However constant amends must be made for late nights out and expeditions that start in the early in the morning as the stakes are high. If the drug testers come looking for you and you are not at the stated location for the specified hour, and this happens three times in 18 months, it is considered a positive doping test result, requiring a minimum of a two-year ban.\n\nI have been subjected to constant random out of competition drug testing since 2001 as a result of being ranked among the World’s top ten consistently for 14 years. Being randomly drug tested is both impersonal and uncomfortably intimate at the same time.\n\nOnce, I awoke horrified, into adrenaline fuelled survival mode instantly at the sight of a shadowy figure standing over over my girlfriend and I as we lay asleep early one morning. On that occasion, my roommate had answered the door and one creepy tester crept rudely into my room refusing to let me leave his sight, even to dress, horrifying my then girlfriend as he inquisitively stared around the room as I turned on the lamp. I felt violated!\n\nDrug testers are not supposed to get to know you, nor accept food or drink and must keep eyes on you at all times in order to make sure you don’t consume any sort of masking agent before providing the necessary samples. Juxtaposed with how impersonal the random drug testers are is the fact that the tester collecting the sample must actually see the urine sample leave your naked body. That is easier to get used to than the needles in the veins that go with providing a blood sample.\n\nWe willingly submit to and endure the random, out-of-competition drug testing program’s many inconveniences because we sincerely want to compete in a sport that’s free from the cheaters who would steal our hard earned fruits of labour. However it’s hard not to be cynical, especially for those fourth and ninth place finishers who have been robbed; and wonder if it’s really even worth it when updating our whereabouts or providing our next sample. Cynicism is due to the common knowledge that Lance Amstrong, the reputed “most tested athlete ever” and Marion Jones, the winner of 12 Olympic and World Championship medals, were doping for years yet never caught. And when doping athletes are actually caught but receive significantly reduced bans for co-operating or are deemed not responsible for the circumstances surrounding their doping and are handed down warnings instead, thus continuing to rob us.\n\n• This article originally appeared in George Bovell’s regular column for the Trinidad & Tobago Guardian, ‘Reflections off the water’, on 7 April 2015. You can access the original article by clicking here."}, {"url": "https://www.3wiresports.com/articles/tag/George+Bovell", "page_content": "BARCELONA -- If the men's 100 freestyle is the equivalent of a heavyweight fight, the 50 free is completely damn simple to understand. One lap. Raw power and speed. First one to the other side is the man. Thirteen years ago, two Americans, Anthony Ervin and Gary Hall Jr., tied for the gold medal at the Sydney Olympics in the 50 free, in a time of 21.8 seconds.\n\nIn what may have been the most loaded 50 free field ever, Brazil's Cesar's Cielo rocked it Saturday night at the Palau Sant Jordi in 21.32 seconds. Afterward, he cried -- and cried -- on the medals stand, the tears redemption after knee surgery and validation of his standing as one of the all-time sprint greats. The crowd roared.\n\nThe time, the field, the race, all of it underscored how swimming keeps getting better and better. Indeed, this 50 free produced a new star, Russia's Vlad Morozov, who won silver, in 21.47, even as it re-charged the career of one of the sport's leading lights, George Bovell of Trinidad & Tobago, who won bronze in 21.51, the island nation's first-ever world-championships medal.\n\nThe 50 free highlighted a day and night of extraordinary racing.\n\nAmerican Katie Ledecky, for instance, set another world-record, her second here, in winning the women's 800, in 8:13.86. She is so good that runner-up Lotte Friis of Denmark applauded as Ledecky got out of the pool.\n\nLedecky's 800 marked her fourth gold here in Barcelona. She also won the 400, 1500 and took part in the 4x200 relay. She took six seconds off the world-record in the 1500. Her 400 time was an American record.\n\nWhen she gets home, she hopes to get her driver's license.\n\n\"I am thrilled,\" she said. \"I exceeded my expectations for this year.\"\n\nHer roommate at these worlds, Simone Manuel, who turned 17 on Friday, grabbed the final spot in the women's 50 free final Sunday by swimming 24.91; she is the first 18-and-under swimmer in U.S. history to break 25 seconds.\n\nMissy Franklin won her fifth gold medal Saturday, in the 200 backstroke, her signature event, in 2:04.76. She is the first woman since Australia's Libby Trickett to win five gold medals at a world championships, and swims Sunday in the medley relay for a sixth.\n\nNo female swimmer has ever won six gold medals at a world championships. Franklin could join Michael Phelps, Mark Spitz and Kristin Otto of East Germany as the only swimmers to win as many as six golds at the worlds or the Olympics. Otto won six golds at the 1988 Seoul Games.\n\nAsked about six, Franklin said it would \"mean so much to me\" but cautioned about the medley, \"Like every single race here, we are going to have very tough competition.\"\n\nIn the morning heats, Russia's Yulia Efimova set a world record in the women's 50 breaststroke, 29.78. The record lasted until the evening -- when Lithuania's Ruta Meilutyte went 29.48 in the semifinals.\n\nThe world records in the women's 50, 100 and 200 have all fallen at these 2013 championships -- stunning, because the plastic suits from 2008-09 were said to have helped the breaststroke most of all. The women's 50 breaststroke final is set for Sunday evening.\n\nRyan Lochte, the day after winning two medals and setting a personal best in the 100 fly semifinals, finished sixth in the men's 100 fly. South Africa's Chad le Clos, closing in the second lap just the way Phelps used to, won in 51.06.\n\n\"I don't know if it had an effect, the triple last night, but I just didn't have it,\" Lochte said.\n\nCielo for sure had it.\n\nHe won his third straight world championships title in the 50 free -- this despite surgery on both knees after the Olympics, and not even racing the 100 free.\n\nThe eight lanes of this 50 free final held three Olympic champions: Ervin, from 2000; Cielo, 2008; France's Florent Manaudou, 2012.\n\nAll eight guys had an Olympic medal. In all, there were 14 medals among the group -- seven gold, four silver, four bronze. Five of the eight had an individual medal.\n\nTo illustrate how the race has developed -- owing to advances in strength-training, straight-arm freestyle technique, a change in the racing blocks themselves and other factors -- Ervin finished Saturday in 21.65.\n\nHe took sixth.\n\n\"It happens,\" he said, adding, \"I just felt incredible yesterday. Things were a little bit apart from that when I was going through my routine today. So, you know, I don't attribute it to much other than things didn't line up perfectly. I didn't get the strike. I got the spare. Whatever.\"\n\nNathan Adrian, the London 100 gold medalist, finished fourth, in 21.6.\n\nHe said, \"21.6 would medal at most international competitions but the 50 was really fast this year,\" adding, \"I have been saying this all week: training has become so specific for every single event. Vlad and I were the only ones who swam the 100 and the 50. Look at the results from 2000, and that's not going to be the same. It has become so specific. The more you specialize, the better you can become at any particular event.\"\n\nIn the semis, Manaudou had gone 21.37. He looked like the man to beat.\n\nInstead, the race was all about Lanes 6, 7 and 8 -- Cielo, Morozov and Bovell.\n\nCielo had gone 21.76 in the prelims, then 21.6 in the semis.\n\nBut, as Cielo said late Saturday, there's a big difference between swimming the 50 and sprinting the 50. He reminded himself to swim \"fast and long, fast and long,\" and that's what he did, keeping his head down. his stroke long: \"When I saw the scoreboard, I was ecstatic. I had no idea where I was.\"\n\nMorozov, 21, moved to Southern California from Siberia when he was 14. He ripped up the NCAA championships this year swimming for USC, taking down no less than Cielo's record in the 100-yard sprint, then turned pro. He turned in a 47.62 in the 100 at the Summer University Games a few weeks back.\n\nHere, in the 100, he went out in the first 50 in 21.94 -- the first sub-22 split, ever, in any major international final. He finished fifth, in 48.01. \"I wish I didn't go out as fast,\" he said ruefully.\n\nIn the 50 prelims, he went 21.95. The semis, 21.63.\n\nIn this race, there was no back half to worry about. Just 50 meters.\n\nMorozov's 21.47 is a new national record -- beating the mark he set in the semis. He set it in front of Alex Popov, the former Russian sprint star -- who gave out the medals Saturday night.\n\n\"I'm really stoked with these medals,\" Morozov said, proving that seven years in SoCal is plenty long enough to learn to talk like a native. He also won a bronze medal as part of the 4x100 relay.\n\nMorozov, noting that this was his first long-course championships at which he was swimming individual events, added a moment later, \"To come here and get a silver medal already with guys who were in my heat -- they were already Olympic champions, world champions … I am really stoked with that. In 2016 I will do my best so that no one will be close to me.\"\n\nSprinters, it must be noted, do not as a general rule lack for confidence.\n\n\"He's going to give us a lot of trouble in the next years,\" Cielo said of Morozov, smiling.\n\nBovell, meanwhile, won a bronze medal in the 200 IM -- behind Phelps and Lochte -- in Athens in 2004. After that, he hurt his knee and could no longer swim the breaststroke.\n\nHe re-made himself into a sprinter. He turned 30 two weeks ago and, as he said, \"To be honest, when you get to be my age, there is some pressure to grow up, so to speak.\" A trip to these worlds without a medal, he said, would have put pressure on him to stop swimming competitively.\n\nNow, he said, he intends to keep on through Rio. \"I love swimming,\" he said. \"I did not want to give it up.\""}, {"url": "https://newsday.co.tt/2021/07/07/kelly-ann-baptiste-joins-george-bovell-iii-as-most-capped-trinidad-and-tobago-olympian/", "page_content": "Kelly-Ann Baptiste joins George Bovell III as most capped Trinidad and Tobago Olympian\n\nKelly Ann Baptiste -\n\nWOMEN’S track and field sprinter Kelly-Ann Baptiste will join legendary swimmer George Bovell III as the most capped TT Olympian, as she is set to make her fifth appearance at the 2020 Tokyo Games, from July 23-August 8.\n\nA media release by the TT Olympic Committee (TTOC) on Wednesday, said, “Bovell made five consecutive appearances starting with the 2000 Sydney Olympics followed by his historic bronze medal effort at the 2004 Athens Games (in the 200-metre individual medley), team TTO’s sole medal for that edition of the Olympics.”\n\nBovell III did not let an injury deter him from continuing his swimming career as he switched focus to another event.\n\n“After an ACL (anterior cruciate ligament) injury in September 2004, Bovell was forced to change his specialty from the endurance-testing 200m individual medley to the 50m freestyle dash. He still qualified and splashed into action in the 2008 Beijing Games (semi-final) and 2012 London Games (seventh) before hanging up his goggles and cap following a first round exit at the 2016 Rio Olympics.”\n\nReflecting on Baptiste’s Olympic career the release said, “Baptiste will also be making five consecutive appearances in a record that saw her making her Olympic debut as part of the women’s 4x100m relay team at the 2004 Athens Games when the powerful Tobago-native led off the relay team that failed to carry the baton all-the way round and were disqualified in the first round.\n\n“Four years later at the 2008 Beijing edition, she reached the second round in the individual event while another baton mishap saw another disqualification in the women’s 4x100m relay.”\n\nShe had her best showing at the 2012 Games. “Baptiste’s best Olympic performance came at the 2012 London Games where she finished sixth in the final but Team TTO’s women’s relay woes continued with another failed trip, and in 2016 Rio, she exited at the second round.”\n\nBaptiste, 34, will again line up in the women's 100m dash and women's 4x100m relay team.\n\nBaptiste is being described as the “stateswoman” of the TT Olympic contingent.\n\nOn Tuesday, the TTOC announced the full TT team that covers seven sporting disciplines including track and field, boxing, cycling, judo, rowing, sailing and swimming. TTOC president Brian Lewis hinted that TT may make history by naming its first women’s flag-bearer for the opening ceremony.\n\n\"To date, the TTOC has never had a female flag-bearer at the opening ceremony of a Summer Olympic Games,\" Lewis said.\n\n\"It is my sincere hope that a female athlete will be chosen by the chef de mission Lovie Santana to carry the TT flag during the opening ceremony in Tokyo 2020.\"\n\nTT will have Santana, the experienced TTOC senior administrative officer, at the helm while TTOC project officer, athletes services and programmes, Rheeza Grant will serve as TT's covid19 liaison officer. TT will also rely on a strong medical staff of nine led by Dr Rudranath Ramsawak.\n\nAfter the Games were rescheduled due to the pandemic, Lewis said, \"The TTOC acknowledges the perseverance, dedication and determination of every athlete who tried their best to qualify for the covid19 pandemic impacted games, the first Olympic Games in history to be postponed.\"\n\nThis year's Olympic Games also hold special significance for the TTOC as it coincides with its 75-year anniversary."}, {"url": "https://dbpedia.org/page/George_Bovell", "page_content": "George Bovell (* 18. Juli 1983 in Port of Spain, Trinidad) ist ein Schwimmer aus Trinidad und Tobago. Er gewann für sein Land im Jahr 2004 eine olympische Bronzemedaille und ist damit bis heute der erfolgreichste karibische Schwimmsportler. Sein Schwimmtalent wurde ihm offenbar in die Wiege gelegt, sein Vater George war College-Schwimmer und seine Mutter eine Langstrecken-Läuferin, die bei den Olympischen Spielen 1972 und 1976 für Barbados und Kanada startete. Sein Bruder nahm als Schwimmer bei den Olympischen Spielen 2008 teil. Seinen ersten großen internationalen Erfolg konnte George Bovell bei den Schwimmweltmeisterschaften 2001 in Fukuoka feiern, wo er über seine Spezialstrecke 200 m Lagen in 2:01,50 Minuten den vierten Platz erreichte. Zwei Jahre später bei den Schwimmweltmeisterschaften 2003 in Barcelona konnte er zwar seine Zeit über diese Strecke auf 2:00,06 Minuten verbessern, dennoch reichte es dort nur für einen fünften Platz. Bei den Panamerikanischen Spielen 2003 in Santo Domingo konnte er dann zweimal Gold über 200 m Freistil und 200 m Lagen sowie zweimal Silber über 100 m Freistil und 100 m Rücken erringen. Damit erlangte er allein vier der sieben Medaillen für Trinidad und Tobago bei den Spielen und dabei die einzigen beiden Goldmedaillen. Bei den Olympischen Spielen 2004 in Athen holte er dann völlig überraschend mit einer Zeit von 1:58,80 Minuten die Bronzemedaille über 200 m Lagen hinter den beiden US-Amerikanern Michael Phelps und Ryan Lochte. Von der Silbermedaille trennten ihn dabei gerade mal zwei Hundertstel Sekunden. Seine Medaille war für die Karibik die erste Medaille im Schwimmen bei Olympischen Spielen überhaupt und die einzige für sein Land in Athen. Insgesamt war er der neunte Athlet, der für Trinidad und Tobago eine Medaille bei Olympischen Spielen holen konnte, die weiteren Medaillengewinner waren in der Leichtathletik und im Gewichtheben erfolgreich. Mit einer Zeit von 1:53,93 Minuten konnte er am 25. März 2004 bei den NCAA-Meisterschaften 2004 in einen neuen Kurzbahn-Weltrekord über 200 m Lagen aufstellen. Damit war Bovell der erste Schwimmer aus Trinidad und Tobago, der einen Weltrekord verbessern konnte. Der Rekord hielt etwa 20 Monate, bis er von dem Ungarn László Cseh bei den Kurzbahneuropameisterschaften 2005 in Triest um 47 Hundertstel Sekunden unterboten wurde. Bei den Karibikspielen 2006 in Cartagena trug George Bovell bei der Eröffnungszeremonie die Fahne für sein Land. Bovell studierte Sport an der Auburn University in den USA. (de)\n\nGeorge Richard Lycott Bovell (born 18 July 1983) is an Olympic bronze medalist swimmer and former world record holder from Trinidad and Tobago. Bovell is also a two-time World Championship bronze medalist. (en)\n\nGeorge Richard Bovell (18 de julio de 1983) es un deportista de Trinidad y Tobago de la especialidad de natación​ que obtuvo una medalla de bronce en 200 m combinado en los Juegos Olímpicos de Atenas 2004.​ Bovell también ha obtenido medallas en el Campeonato Mundial de Natación, Juegos Panamericanos y fue campeón de Centroamérica y del Caribe en los 50 m libre en Cartagena 2006 y Mayagüez 2010.​​ (es)\n\nGeorge Richard Bovell III, né le 18 juillet 1983 à Port-d'Espagne, est un nageur trinidadien. (fr)\n\nジョージ・ボベル（George Bovell, 1983年7月18日 - ）は、トリニダード・トバゴの競泳選手。 2004年アテネ五輪の水泳男子個人メドレー200メートルの銅メダリスト。彼はトリニダード・トバゴ人で9人目のオリンピックメダリスト。彼がもたらした銅メダルはトリニダード・トバゴにとって12個目のオリンピックメダルとなった。また、この銅メダルはトリニダード・トバゴにとって2004年アテネ五輪の唯一のメダルだった。 2004年アテネ五輪の水泳男子個人メドレー200メートル決勝の1位はマイケル・フェルプス（アメリカ）、2位はライアン・ロクテ（アメリカ）。ジョージ・ボベルは彼らに次ぐ3位だった。彼らのタイムはそれぞれ、1分57秒14、1分58秒78、1分58秒80だった。 2008年北京オリンピックの開会式では、トリニダード・トバゴ選手団の旗手を務めた。 (ja)\n\nGeorge Richard Lycott Bovell III (Port of Spain, 18 juli 1983) is een zwemmer uit Trinidad en Tobago. Hij vertegenwoordigde zijn vaderland op de Olympische Zomerspelen 2000 in Sydney, op de Olympische Zomerspelen 2004 in Athene, op de Olympische Zomerspelen 2008 in Peking en op de Olympische Zomerspelen 2012 in Londen. Bovells moeder, , nam namens Barbados deel aan het atletiektoernooi van de Olympische Zomerspelen 1972 in München, zijn broer nam als zwemmer deel aan de Olympische Zomerspelen van 2008. (nl)\n\nGeorge Richard Lycott Bovell III (ur. 18 lipca 1983) – trynidadzko-tobagijski pływak, specjalizujący się w stylu zmiennym, brązowy medalista igrzysk olimpijskich i mistrzostw świata, były rekordzista globu na krótkim basenie, pięciokrotny olimpijczyk. W 2004 roku na igrzyskach olimpijskich w Atenach zdobył brązowy medal na dystansie 200 m stylem zmiennym. Jest synem (wcześniej Bishop), pochodzącej z Barbadosu lekkoatletki, która w wieku 16 lat zadebiutowała na Letnich Igrzyskach Olimpijskich 1972 w Monachium. Biegała na dystansie 400 m.Jego bratem jest , również pływak. (pl)\n\nGeorge Bovell III (Port of Spain, 18 luglio 1983) è un ex nuotatore trinidadiano. Ai Giochi della XXVIII Olimpiade del 2004, all' di Atene, ha vinto la medaglia di bronzo nei 200 m misti, dietro alla coppia statunitense formata da Michael Phelps, che in quella gara fece il record olimpico della disciplina, e Ryan Lochte, ma escludendo dal podio un futuro primatista del mondo, l'ungherese László Cseh. Tale medaglia è stata la dodicesima di Trinidad e Tobago ai Giochi, per lo Stato caraibico la prima nel nuoto in una competizione internazionale e l'unica della rassegna olimpica in tutte le discipline presenti a tali Giochi. Bovell ha anche fatto da portabandiera di Trinidad e Tobago alla cerimonia d'apertura dei ventesimi a Cartagena (Colombia). (it)\n\nGeorge Richard Lycott Bovell, född 18 juli 1983, är en trinidadisk simmare. Han har tävlat vid de olympiska spelen fem gånger och har ett brons på 200 meter medley från Aten 2004. (sv)\n\nGeorge Richard Lytcott Bovell III (Guelph, 18 de julho de 1983) é um nadador de Trindad e Tobago. Um dos principais nadadores do país conquistando medalhas importantes nos Jogos Pan-Americanos de 2003 em quatro modalidades, uma medalha nos Jogos Pan-Americanos de 2007, uma medalha nos Jogos Olímpicos de Verão de 2004 e medalhas nos Jogos Centro-Americanos e do Caribe. No Pan-Americano de 2007, Bovell foi o porta bandeira de sua delegação. (pt)\n\nДжо́рдж Ри́чард Ла́йкотт Бо́велл (англ. George Richard Lycott Bovell, род. 18 августа 1983 года, Порт-оф-Спейн) — тринидадский пловец. Участник четырёх Олимпийских игр, призёр Олимпийских игр и чемпионатов мира. (ru)\n\nДжордж Річард Лайкотт Бовелл (англ. George Richard Lycott Bovell, нар. 18 серпня 1983, Порт-оф-Спейн) — тринідадський плавець. Учасник чотирьох Олімпійських ігор, призер Олімпійських ігор і чемпіонатів світу. (uk)\n\n乔治·博弗尔三世（George Bovell III，1983年7月18日－），特立尼达和多巴哥游泳运动员。曾在2004年雅典奥运收获男子200米个人混合泳铜牌，这是特立尼达和多巴哥在奥运游泳项目上的首枚奖牌。 (zh)"}, {"url": "https://www.celebsages.com/george-bovell/", "page_content": "Birth Name: George Bovell Occupation: Swimmer Born In: Trinidad And Tobago Birthdate: July 18, 1983 Age: 39 years old (as of 2023) Ethnicity: Unknown Nationality: Trinidadian Sexuality: N/A\n\nGeorge Bovell was born on the 18th of July, 1983. He is popular for being a Swimmer. When he won bronze at the 2004 Olympics, he finished behind silver-medalist Ryan Lochte, and gold-medalist Michael Phelps. George Bovell’s age is 39. Swimmer who won Trinidad and Tobago’s first Olympic swimming medal when he took bronze at the 2004 games in the 200M individual medley. The 39-year-old swimmer was born in Trinidad And Tobago. He attended Auburn University, where he set a school record earning 25 All-American honors. On March 25, 2004, he set a 200M IM world record, which lasted for more than a year and a half.\n\nCountdown to George’s next birthday.\n\nGeorge Bovell is a Cancer and his 40th birthday is in .\n\nJUMP TO: George Bovell’s biography , facts , family , personal life , zodiac , videos , net worth , and popularity .\n\nChildhood\n\nGeorge Bovell was born in 1980s. The 1980s was the decade of big hair, big phones, pastel suits, Cabbage Patch Kids, Rubik’s cubes, Yuppies, Air Jordans, shoulder pads and Pac Man. During the Eighties, conservative politics and Reaganomics held sway as the Berlin Wall crumbled, new computer technologies emerged and blockbuster movies and MTV reshaped pop culture. Discover what happened on this day.\n\nGeorge Bovell is part of a Millennial Generation (also known as Generation Y). Millennials is a generation who grew up with computers, internet and social networks. Having been raised under the mantra \"follow your dreams\" and being told they were special, they tend to be confident and tolerant of difference.\n\nYou can also find out who is George Bovell dating now and celebrity dating histories at CelebsCouples.\n\nIt's hard to know George Bovell birth time, but we do know his mother gave birth to his on a Monday. People born on a Monday tend to be a bit sensitive and emotional. They have imagination and don't like planning things in advance. They're flexible and good at improvising.\n\n[fetch instagram=”” display=”posts” ]\n\nThe 39-year-old Trinidadian was born in the Millennials Generation and the Year of the Pig\n\nEducation\n\nThe education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nGeorge Bovell’s mother’s name is unknown at this time and his father’s name is under review. We will continue to update information on George Bovell’s parents.\n\nPersonal Life\n\nLike many famous people and celebrities, George Bovell keeps his personal life private. Once more details are available on who he is dating, we will update this section.\n\nFast Facts\n\nREAL NAME: George Bovell NICKNAME: George\n\nMARTIAL STATUS: Pending RELIGION: Unknown TATTOOS: N/A AGE GENERATION: Millennials Generation BIRTH SIGN: Cancer BIRTH DAY: Monday DAYS SINCE BIRTH:\n\nNet Worth\n\nThe 39-year-old Trinidadian swimmer has done well thus far. Majority of George’s money comes from being a swimmer. CelebsMoney has recently updated George Bovell’s net worth .\n\nVideos\n\nHoroscope\n\nZodiac Sign: George Bovell is a Cancer. People of this zodiac sign like home-based hobbies, relaxing near or in water, helping loved ones, and dislike strangers, revealing of personal life. The strengths of this sign are being loyal, emotional, sympathetic, tenacious, persuasive, while weaknesses can be moody, pessimistic, suspicious, manipulative and insecure. The greatest overall compatibility with Cancer is Capricorn and Taurus.\n\nChinese Zodiac: George Bovell was born in the Year of the Rabbit. People born under this sign are nice and good-mannered. They're always forgiving of other people's mistakes, which at times can translate to naivete and gullibility.\n\n\n\n\n\nRuling Planet: George Bovell has a ruling planet of Moon and has a ruling planet of Moon and by astrological associations Sunday is ruled by moon. The Moon represents one's nurturing and emotional instinct. People who are born with Moon as the ruling planet are sensitive, nurturing, and usually have fluctuating moods.\n\n[fetch instagram=”” display=”posts” show=”2″ ]\n\nGeorge Bovell’s birth sign is Cancer and he has a ruling planet of Moon.\n\nDon’t miss\n\n– Who’s the richest Swimmer in the world?\n\n– George Bovell Net Worth Stats\n\n– When is George Bovell’s birthday?\n\nAssociated with\n\nFans also viewed"}, {"url": "https://www.famousbirthdays.com/people/george-bovell.html", "page_content": "About\n\nSwimmer who won Trinidad and Tobago's first Olympic swimming medal when he took bronze at the 2004 games in the 200M individual medley.\n\nBefore Fame\n\nHe attended Auburn University, where he set a school record earning 25 All-American honors.\n\nTrivia\n\nOn March 25, 2004, he set a 200M IM world record, which lasted for more than a year and a half.\n\nFamily Life\n\nHis brother, Nicholas Bovell, also competed at the 2008 Olympics.\n\nAssociated With\n\nWhen he won bronze at the 2004 Olympics, he finished behind silver-medalist Ryan Lochte, and gold-medalist Michael Phelps."}]}