{"Fei-Ping Hsu was a research scientist at the Jet Propulsion Laboratory from 1991 to 1993.": [{"url": "https://www.nature.com/articles/462735a", "page_content": "Credit: BETTMANN/CORBIS Perhaps no one better embodies the irony of the cold-war era than Qian Xuesen, also known as Tsien Hsue-shen, the Chinese rocket scientist who died on 31 October at the age of 97. Widely acknowledged for his work on rocket propulsion and his contribution to the US missile programme during the Second World War, Qian was deported at the height of the McCarthyism hysteria on dubious charges of being a communist, only to become the driving force behind China's rise to the first rank of space nations.\n\nQian was born in the eastern city of Hangzhou in 1911, as China's 2,000-year-old feudal system was overthrown, and he was destined to encounter both turbulent historic events and social upheaval. After graduating from Shanghai Jiao Tong University as an engineer, in 1935 he went to study aeronautics at the Massachusetts Institute of Technology (MIT) in Cambridge. Theoretically inclined, he was dissatisfied with the practical emphasis that MIT placed on its curricula at the time, and soon moved to the California Institute of Technology (Caltech) in Pasadena. During his time there, he rose to become one of the most prominent rocket scientists in the United States.\n\nAt Caltech, Qian was the protégé of the legendary theoretical aerodynamicist Theodore von Kármán, and became a renowned theoretician in high-speed flight. The two men were the leading members of a group of rocket experimenters known as the Suicide Squad because of the dangerous nature of their work. In 1939, their research attracted the attention of the US Army Air Corps, which tasked Caltech, including Qian, with developing jet-assisted take-off technology — a means of helping heavy aircraft to take off by providing additional thrust in the form of small rockets.\n\nThe 1943 discovery of German rocketry development led to the acceleration of the US missile programme and the creation of the Jet Propulsion Laboratory at Caltech, which appointed Qian as a director. Two years later, Qian received high-grade security clearance from the Pentagon and, as a member of the Scientific Advisory Board, began advising on the latest classified technologies for military development. By 1949, he had laid the theoretical groundwork for a spaceplane with winged rockets, a predecessor of the space shuttle.\n\nMeanwhile, Sino–US relations had deteriorated with the onset of the cold war, and this had devastating consequences for Qian's career. In 1950, he was accused of being a communist spy — allegations that have never been substantiated — and his security clearance was revoked. Deeply hurt by the accusations, and realizing that he was no longer welcome in the United States, Qian attempted to return to China, whereupon he was arrested and imprisoned by the US Immigration Service for two weeks. He spent the next five years living under partial house arrest, enduring constant humiliation and harassment, although he was able to continue teaching and to conduct limited research at Caltech. He was eventually allowed to leave the United States in 1955, as part of the conditions of China's release of eleven American soldiers captured during the Korean War.\n\nQian received a hero's welcome in China, and was soon asked to create a missile programme — a daunting challenge in a country where even telephones were luxuries. He began by retraining Chinese scientists and engineers, attracting Western-trained Chinese researchers to return, and building an efficient education and management system for research and development, all of which were to have lasting effects on the country's rocketry development. He joined the Communist Party in 1958 and became a trusted, high-ranking party official. With access to the top Chinese leaders, including Chairman Mao Zedong, he was able to persuade officials to support whatever measures he felt China needed to progress.\n\nIn 1956, Qian founded the Institute of Mechanics in Beijing, now one of the world's leading aeronautics institutions, and influenced the teaching of engineering at many Chinese universities. Under his leadership, China progressed from copying the intermediate-range Soviet R-2 missile (a version of the V-2 rocket developed by Nazi Germany) to launching Dongfeng-2 in 1964 (a medium-range ballistic missile based on home-grown technology), and successfully tested its first atomic bomb a few months later. China's first nuclear ballistic missile was launched using Dongfeng-2 two years later, and the first Chinese satellite went into orbit using Long March-1, a three-stage space-launch version of Dongfeng-4, in 1970.\n\nQian's endeavours were responsible for the development of the Haiying family of anti-ship missiles, widely known in the West as Silkworms. They also paved the way for a succession of increasingly ambitious space programmes. For example, Shenzhou-5, China's first manned space mission, was launched in 2003, and Chang'e-1, the first Chinese lunar probe, was sent into orbit in 2007, using the Long March family of rockets.\n\nIt is extraordinary that China's missile and space programmes took off against a backdrop of economic and political turmoil. They were postponed several times during the Great Leap Forward — a social and economic plan enacted in 1958 that brought the country's economy to a standstill and triggered widespread famine. In an ironic twist of fate, Qian also endured the Cultural Revolution, an 'anti-revolutionary' witch-hunt launched by Mao in 1966. Some of Qian's friends and colleagues were removed from their positions as a result; Qian himself, although largely unaffected, was forced to write letters of 'confession'.\n\nDespite the grave injustice Qian suffered in the United States, it is clear that his time at Caltech was one of the most enjoyable periods of his life. He revelled in the great relationship he had with von Kármán, enjoying his mentor's jokes and their often heated arguments. He also reminisced, with great affection, about the intellectual ethos and creative spirit fostered at Caltech. He contrasted these with China's academic culture and science infrastructure, which he thought had not, and would not, lead to any real scientific innovation."}, {"url": "https://www.wikiwand.com/en/Fei-Ping_Hsu", "page_content": "Fei-Ping Hsu (Chinese: 许斐平; July 20, 1952[1]–November 27, 2001) was a Chinese-American pianist.\n\nPianist\n\nHsu was born on the island of Gulangyu in southeast China. As the youngest son of a Christian pastor, he grew up singing hymns while his mother played on an upright piano. By the time he was twelve, he played the complete Chopin Etudes and had performed with the Shanghai Philharmonic. Hsu was invited to perform for Queen Elisabeth of Belgium, and she invited him to study and perform in Europe under her sponsorship. He was not allowed to accept because of the advent of the Cultural Revolution during the 1960s. He survived the labor camps and became known in China and toured throughout the Far East as a soloist with the Central Philharmonic.[2]\n\nHe was a Gold Medal winner at the Arthur Rubinstein International Piano Competition. He also garnered top prizes in other competitions. Hsu made his New York recital debut at Alice Tully Hall in 1983 and performed throughout the United States, including appearances at Carnegie Hall, Lincoln Center, and the Kennedy Center in Washington, D.C. He also frequently toured Europe, South America, and the Far East.\n\nIn 1979, Hsu attended the Juilliard School of Music under the tutelage of Sascha Gorodnitzki. He has appeared as a soloist with major orchestras, including the Montreal Symphony Orchestra, the Moscow Philharmonic, and the Finnish Tempere Symphony Orchestraope. Hsu also played with the China National Symphony Orchestra in Beijing, the Shanghai Symphony Orchestra, the Shanghai Radio Symphony Orchestra and the Kyushu Symphony Orchestra in Japan. Since the early 1970s, Hsu had recorded for labels such as the Columbia Records, the RCA Victor Records, the Hugo Records, the ROI Productions, and the MA Recordings in Japan.\n\nHe died in a car accident on a highway from Harbin to Qiqihar while on a concert tour in China on November 27, 2001, aged 51.[3] He is survived by his wife and daughter.[4]"}, {"url": "https://www.britannica.com/biography/Qian-Xuesen", "page_content": "Qian Xuesen, Wade-Giles romanization Ch’ien Hsüeh-sen, also spelled Tsien Hsue-shen, (born December 11, 1911, Shanghai, China—died October 31, 2009, Beijing), Chinese engineer and research scientist widely recognized as the “father of Chinese aerospace” for his role in establishing China’s ballistic missile program.\n\nQian was the only child of an aristocratic Hangzhou family whose recorded lineage of more than a thousand years has been traced to Qian Liu (852–932), the founder of the Wu-Yue kingdom. His grandparents were wealthy merchants. His father, Qian Jiachi, was an educational reformer and administrator, and his mother, Zhang Lanjuan, studied the Confucian classics. Qian’s family history engendered powerful emotional connections to a transforming Chinese culture that would define Qian’s professional life and make him an icon of 20th-century China.\n\nQian placed third in mechanical engineering in the national college entrance examination and won a coveted slot studying railroad engineering at Shanghai’s Jiaotong University, but as the promising young scientist was developing, his homeland collapsed. Failed governments had left China impoverished and weak; Shanghai was bombed and invaded by Japan in 1932. Qian graduated from Jiaotong in 1934, and the following year he left China for graduate study in aeronautical engineering at the Massachusetts Institute of Technology (MIT) on a Boxer Rebellion Indemnity Scholarship from the U.S. government.\n\nThe focus of the MIT program on practical applications was ill-suited to Qian, and in 1936 he left for the California Institute of Technology (Caltech) to study under research engineer Theodore von Kármán. In an age before computers, Qian’s ability to quickly perform complex calculations flawlessly was an invaluable asset to von Kármán and a nascent group of rocket scientists at Caltech, where Qian became a recognized expert in the study of aerodynamics and jet propulsion. He received his doctorate in aeronautics from Caltech in 1939.\n\nIn 1943, during World War II, Qian helped prepare an analysis of the German rocket program for the U.S. Army, and at the war’s end he traveled to Germany as a U.S. Army colonel to debrief captured German rocket scientists, including Wernher von Braun. He helped create and organize the U.S. long-range rocket research program and directed research on the country’s first successful solid-fueled missile, the Private A. In 1947 Qian left Caltech with von Kármán for MIT. He then surrendered his tenured professorship in aeronautics to follow von Kármán back to Caltech in 1949, and that same year he succeeded von Kármán as the Robert H. Goddard Professor of Jet Propulsion and as the director of the Daniel and Florence Guggenheim Jet Propulsion Center.\n\nQian’s difficulty adjusting to American culture and his strong personal attachment to China engendered suspicions during the McCarthy era that abruptly ended his career. In 1950 he was detained on charges of espionage. (It is still undetermined if there was any basis to these charges.) After five years under house arrest, Qian was allowed to return to China with his wife, Jiang Ying, and his two American-born children, son Yonggang and daughter Yongzhen. He received a hero’s welcome from the Chinese government, which had negotiated with the Eisenhower administration for his release in exchange for Americans imprisoned in China.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nQian’s leadership role in the founding of the U.S. rocket program led to his appointment in 1956 as the director, and later deputy director, of the Fifth Academy of the Chinese Ministry of Defense (later reorganized as the Chinese Academy of Space Technology [CAST] with Qian as director in 1968). Qian was not directly responsible for the development of any specific missile, rocket engine, or satellite. He earned the imprimatur “the father of Chinese aerospace” because he personally trained the first generation of revolutionary China’s aerospace engineers. Qian’s loyalty to the Chinese Communist Party and his commitment to the revitalization of his homeland cemented his legacy as a scientific leader. His unquestioned political integrity and patriotic zeal were indispensable in helping the aerospace program acquire critical institutional and financial support throughout the turbulent political struggles of the Maoist era.\n\nQian was a member of the Chinese Academy of Sciences and the Chinese Academy of Engineering. He held several overlapping leadership positions over the years, including the director of the Institute of Mechanics at the Chinese Academy of Sciences, the director of the Chinese Academy of Launch Vehicle Technology, and the vice-minister of the Seventh Ministry of Machine Building.\n\nQian’s career as a scientist was cut short by his administrative duties as well as by China’s international isolation and technological immaturity. After his retirement in 1970, Qian turned to music, the martial arts, and traditional Chinese philosophy for intellectual stimulation. He spent the last two decades of his life in relative isolation, occasionally appearing in public to attend events or make pronouncements in support of government policies."}, {"url": "https://earth.jpl.nasa.gov/news/18/career-profile-how-hui-su-became-an-atmospheric-scientist-at-nasa-jpl/", "page_content": "Hui Su is an earth scientist at NASA's Jet Propulsion Laboratory who studies clouds and storms.\n\nWhat’s your topic of research?\n\nI study any sort of storm where scurrying clouds, strong winds, lightning, thunder, and heavy rain move in an organized way. Hurricanes are an example. I’ve been at JPL since 2005.\n\nWhat did you want to be when you were little?\n\nMy parents were both meteorologists. In fact, they even met and got married at their jobs. So I had an early interest in that, and basically, I’ve been studying weather all my career.\n\nWhen I was young, the meteorologists in China lived with their families in the same complex where the office buildings were. So, I grew up in a complex like that with about 20 other kids who were just my age. We used to all bike together to and from school, stopping to play on the roadside. And when we got back to the complex, we would watch the weather balloons being released. They were huge white hydrogen balloons, and as they rose, they measured temperature, wind, and pressure.\n\nWhat was the weather like in your hometown?\n\nMy hometown, Chengdu, is famous for its clouds. You rarely see blue skies. It’s because we’re in a basin surrounded by mountains, right by the Tibetan Plateau. Because of our location, in the summer, we would get a lot of thunderstorms and flooding, and one time we even had a huge flood in our own meteorology complex that caused a lot of damage.\n\nWhat were your college days like?\n\nI was at Peking University, where doing further studies abroad was very popular. So, I followed in those same footsteps and was admitted to the atmospheric dynamics doctoral program at the University of Washington in Seattle. I really liked Seattle. Like Chengdu, it's also famous for its rainy days, and that reminded me of home. It’s a beautiful city with lots of lakes, and the skyline is just lovely. I’d buy seafood at the famous Pike Place Market, and although I’m not that good at cooking, we’d have potlucks with groups of friends. We did many outdoors activities together, from skiing in the winter to beach trips in the summer, to crab-hunting in the Puget Sound.\n\nHui Su on the campus of the University of Washington in Seattle during her second year there.\n\nHow did you end up at JPL?\n\nI first came to Los Angeles to do research at UCLA. I focused on El Niño, and eventually that led to my job at JPL. I’ve been researching clouds and hurricanes this whole time, often using satellite data to draw conclusions. Hurricanes cause so much damage, and we’re still not very good at predicting how powerful they will be. That’s a big reason I’m drawn to studying them – I want to help improve the forecast.\n\nHow do you like Los Angeles?\n\nInitially, it was a blast, because I felt, wow! I really love all the palm trees and the sunny skies! But now, twenty years later, I really miss the rain. There are too many dry days here, and I really feel the drawback of not having enough water in California. Otherwise, I feel that JPL is a great place. I’m constantly impressed by the missions we launch into space – they are all miracles to me. I’m constantly inspired by what I see happening.\n\nWhat do you do for fun?\n\nI like hiking, and I like dancing – not really on the stage, but as a work-out. I have a group of friends and we all like to exercise to Chinese folk-dancing. Then one time, we performed at the Lunar New Year party at JPL. We made the top news on the JPL internal newsletter, “Universe”!\n\nWhat’s one of the hardest parts of your job?\n\nHui in the cockpit of a DC-8 plane -- a plane used to chase hurricanes.\n\nThere’s a tremendous pressure to always stay at the top. I think that’s a positive thing, but it can also add a lot of stress to always maintain yourself at the forefront of research. I’m worried about being not competitive enough for funding grants. A way to relieve the pressure is to form teams and work together with others. That’s a way to share the burdens. We’re constantly exploring new directions and making our research diversified.\n\nWhat if someone can’t see a clear career path from their childhood like you did?\n\nMy career path was almost too simple! I stayed in my major and have been doing that ever since. But for people with a more winding path, it’s okay. People do change, and I’d advise them to follow their heart and do what they’re passionate about and then stick to it."}, {"url": "https://www.theguardian.com/news/2001/dec/18/guardianobituaries3", "page_content": "The Chinese-American pianist Fei-Ping Hsu, who has died aged 51 in a road accident while on a concert tour of China, had the misfortune to live in \"interesting times\". After surviving the cultural revolution of 1966-76, during which he gave many performances of the Yellow River Concerto, he left to pursue his career in the United States.\n\nA Washington Post review in 1989 reported that he played with \"a commanding athleticism born of grace and agility... His instincts run to big sounds and bold statements.\" Those who heard him at the Rubinstein competition in Israel in 1983, where he won the third gold medal, long remembered his sensational performances of the Tarantella from Liszt's Venezia e Napoli, and Chopin's Sonata No 2 in B flat minor.\n\nHis recordings, including mazurkas by Chopin and Beethoven's Moonlight sonata, reveal a spirited approach with an engaging rhythmic instinct and rich tone. He was small of stature and youthful in appearance; his friends describe him as a relaxed, cheerful and generous person, a \"man of faith\" who had a positive influence on all those around him.\n\nHsu was the son of a pastor on Gulangyu island, off the south-east coast of China. An idyllic enclave much influenced by Jesuit missionaries, the area earned the nickname of \"Piano Island\" because of its extraordinary number of pianos - more than 500 in the early 1950s. Hsu was a child prodigy, and, by the age of 14, had already performed Chopin's 24 Etudes.\n\nHe entered the Shanghai Conservatory, then China's most sought-after musical training ground (thanks to the impact of teachers from the great Russian tradition), but his studies came to an abrupt end when the college was closed down during the cultural revolution. His last teacher died in Hsu's arms after being brutally tortured by Red Guards.\n\nBanished to the countryside, Hsu worked on a rice farm and in a factory; his friend, the pianist Hung-Kuan Chen, who won second prize at the Rubinstein competition when Hsu won third, recalled that Hsu never regained the same flexibility in his fingers after his banishment.\n\nHe was, however, summoned back to the piano to perform the Yellow River Concerto - a hybrid piece, based on the Yellow River Cantata by Hsien Hsing-hai, written by a committee of composers from the Central Philharmonic Society of the People's Republic of China, and promoted by Mao Zedong's wife, Jiang Qing, as a suitable \"revolutionary\" work.\n\nFor two years, Hsu and a group of musicians walked across China behind a three-wheeled vehicle carrying an upright piano, playing the Yellow River Concerto several hundred times to soldiers and farm and factory workers. Although this was an arduous task, he was pleased to have been the first Chinese pianist allowed to return to his instrument.\n\nAfter moving to America, Hsu studied at the Eastman School of Music, and with Sasha Grodnitsky at the Juilliard School of Music; he subsequently became a US citizen and settled in New York. After his success at the Rubinstein competition, he made his New York debut in 1984.\n\nHsu was sustained by his strong Christian faith. According to Hung-Kuan Chen, he had been diagnosed with cancer while still in his teens, but had refused treatment, feeling that \"if it was his time to go, he would\". That time came when the van in which he was travelling hit a stationary tractor on a dark road near Qiqihar, in north-eastern China.\n\nHsu is survived by his wife and daughter.\n\n· Fei-Ping Hsu, pianist, born December 20 1949; died November 27 2001"}, {"url": "https://prabook.com/web/fei-ping.hsu/2433004", "page_content": "Fei-Ping Hsu\n\npianist Christian pastor\n\n1952 (age 49)\n\nThe family realized his tremendous talent and encouraged him to study music When he was eight years old, he had a rare opportunity to meet Professor Ji-sen Fan, the head of the piano department of the Shanghai Conservatory, and was recognized as a child prodigy. By the time he was twelve-years-old, he already played the complete Chopin Etudes and had performed with the Shanghai Philharmonic. Feiping was invited to perform for the Queen Elisabeth of Belgium, who was so impressed with his ability that she personally invited Feiping to study and perform in Europe under her sponsorship. Unfortunately, he was not allowed to accept this invitation because of the advent of the Cultural Revolution during the 1960s. However, he survived the labor camps and became well known in China and toured extensively throughout the Far East as a soloist with the Central Philharmonic which was the foremost leading orchestra. He also garnered top prizes in other international competitions including the Gina Bachauer Memorial Piano Scholarship Competition, the University of Maryland International Competition, and the Paloma O’Shea International Competition (Spain). Mr. Hsu made his New York recital debut at Alice Tully Hall in 1983 and performed throughout the United States, including notable appearances at Carnegie Hall, Lincoln Center, and the Kennedy Center in Washington, District of Columbia He also frequently toured Europe, South America, and the Far East. Mr. Hsu was especially noted for his larger-than-life virtuosic style of Horowitzian pianism. In 1979, Fei-Ping Hsu received permission to study in the United States. Among others he attended the Juilliard School of Music under the tutelage of Sascha Gorodnitzki. He had given numerous concerts in Germany, France, Andorra, Switzerland, and Italy. He has appeared as a soloist with major orchestra including the Montreal Symphony Orchestra under the baton of Maestro Charles Dutoit, the Moscow Philharmonic in Russia, the Finnish Tempere Symphony Orchestra in Europe, as well as numerous orchestra in the United States performing in various concert halls and music festivals. Mr. Hsu was also actively engaged in his native Asia, where his collaborations include appearances with the China National Symphony Orchestra in Beijing, the Shanghai Symphony Orchestra, the Shanghai Radio Symphony Orchestra and the Kyushu Symphony Orchestra in Japan. Since the early 1970s Mr. Hsu had recorded for major labels such as the Columbia Records, the Radio Corporation of America Victor Records, the Hugo Records, the Republic of Ireland Productions, and the Master of Arts Recordings in Japan. His life was cut short in a road accident while on a concert tour in China on November 27, 2001 and is remembered by many to this day."}, {"url": "https://www.wfimc.org/node/459", "page_content": "Born in\n\nFei-Ping Hsu was born on the island of Gulangyu in southeast China. As the youngest son of a Christian pastor, he grew up singing hymns while his mother played on an upright piano. By the time he was twelve, he played the complete Chopin Etudes and had performed with the Shanghai Philharmonic. Hsu was invited to perform for Queen Elisabeth of Belgium and she invited him to study and perform in Europe under her sponsorship. He was not allowed to accept because of the advent of the Cultural Revolution during the 1960s. He survived the labor camps and became known in China and toured throughout the Far East as a soloist with the Central Philharmonic.\n\nA winner at the Rubinstein International Piano Competition, he also garnered top prizes in other competitions. Hsu made his New York recital debut at Alice Tully Hall in 1983 and performed throughout the United States, including appearances at Carnegie Hall, Lincoln Center, and the Kennedy Center in Washington, D.C. He also frequently toured Europe, South America, and the Far East.\n\nIn 1979, Hsu attended the Juilliard School under the tutelage of Sascha Gorodnitzky. He has appeared as a soloist with major orchestras, including the Montreal Symphony Orchestra, the Moscow Philharmonic, and the Finnish Tempere Symphony Orchestraope. Hsu also played with the China National Symphony Orchestra in Beijing, the Shanghai Symphony Orchestra, the Shanghai Radio Symphony Orchestra and the Kyushu Symphony Orchestra in Japan. Since the early 1970s, Hsu had recorded for labels such as the Columbia Records, the RCA Victor Records, the Hugo Records, the ROI Productions, and the MA Recordings in Japan.\n\nHe died in a car accident on a highway from Harbin to Qiqihar while on a concert tour in China on November 27, 2001, aged 51."}, {"url": "https://peoplepill.com/people/fei-ping-hsu/", "page_content": "Fei-Ping Hsu (b. 1952 - d. 2001) is a renowned Chinese American pianist who is known for his sensitive, brilliant, and poetic interpretations.\n\nMr. Hsu was born on the island of Gulangyu in southeast China. As the youngest son of a Christian pastor, he grew up singing hymns while his mother played on an upright piano. One day when his mother was ill, the five-year-old Fei-Ping went to the piano and played the hymns by ear. The family realized his tremendous talent and encouraged him to study music. When he was eight years old, he had a rare opportunity to meet Professor Ji-sen Fan, the head of the piano department of the Shanghai Conservatory, and was recognized as a child prodigy. By the time he was twelve-years-old, he already played the complete Chopin Etudes and had performed with the Shanghai Philharmonic. Feiping was invited to perform for the Queen Elisabeth of Belgium, who was so impressed with his ability that she personally invited Feiping to study and perform in Europe under her sponsorship. Unfortunately, he was not allowed to accept this invitation because of the advent of the Cultural Revolution during the 1960s. However, he survived the labor camps and became well known in China and toured extensively throughout the Far East as a soloist with the Central Philharmonic which was the foremost leading orchestra.\n\nHe was a Gold Medal winner at the Arthur Rubinstein International Piano Competition, the first pianist in the competition’s history from the People’s Republic of China. He also garnered top prizes in other international competitions including the Gina Bachauer Memorial Piano Scholarship Competition, the University of Maryland International Competition, and the Paloma O’Shea International Competition (Spain). Mr. Hsu made his New York recital debut at Alice Tully Hall in 1983 and performed throughout the United States, including notable appearances at Carnegie Hall, Lincoln Center, and the Kennedy Center in Washington, D.C. He also frequently toured Europe, South America, and the Far East. Mr. Hsu was especially noted for his larger-than-life virtuosic style of Horowitzian pianism.\n\nIn 1979, Fei-Ping Hsu received permission to study in the United States. Among others he attended the Juilliard School of Music under the tutelage of Sascha Gorodnitzki. He had given numerous concerts in Germany, France, Andorra, Switzerland, and Italy. He has appeared as a soloist with major orchestra including the Montreal Symphony Orchestra under the baton of Maestro Charles Dutoit, the Moscow Philharmonic in Russia, the Finnish Tempere Symphony Orchestra in Europe, as well as numerous orchestra in the United States performing in various concert halls and music festivals. Mr. Hsu was also actively engaged in his native Asia, where his collaborations include appearances with the China National Symphony Orchestra in Beijing, the Shanghai Symphony Orchestra, the Shanghai Radio Symphony Orchestra and the Kyushu Symphony Orchestra in Japan. Since the early 1970s Mr. Hsu had recorded for major labels such as the Columbia Records, the RCA Victor Records, the Hugo Records, the ROI Productions, and the MA Recordings in Japan.\n\nHighly regarded as one of the foremost pianists of the Western and the Romantic traditions, Hsu is also an early champion of the music of the modern composer Huang An-Lun.\n\nHis life was cut short in a road accident while on a concert tour in China on November 27, 2001 and is remembered by many to this day. He is survived by his wife and daughter."}, {"url": "https://www.jpl.nasa.gov/who-we-are/faces-of-leadership-the-directors-of-jpl", "page_content": "JPL Director, 2001-2016\n\n\n\nCharles Elachi was born in Lebanon and received a bachelor's degree in physics from the University of Grenoble, France, and a diploma in engineering from the Polytechnic Institute, Grenoble (both in 1968). He received a master's degree (1969) and doctorate (1971) in electrical sciences from Caltech. He also earned a master's in business administration (1978) from USC and a master's in geology (1983) from UCLA.\n\n\n\nDr. Elachi taught at Caltech, served in a variety of research and management positions at JPL beginning in 1971, specializing in remote sensing, and became the Director of JPL in May 2001. During his tenure as Director, JPL was involved in more than 20 missions including Cloudsat, Jason 1 and 2, Aquarius, OCO-2, GRACE, SMAP, GRAIL, Mars Odyssey, Mars Reconnaissance Orbiter, Phoenix, Cassini, Deep Impact, Stardust, Dawn, and Juno. Three rovers —Spirit, Opportunity and Curiosity— reached Mars and provided detailed information about the planet.\n\n\n\nAfter retiring from JPL in June 2016 he became professor emeritus at Caltech, allowing him to pursue research interests while continuing to participate as a science investigator on a number of missions. He continues to advocate and be a spokesman for a strong space and Earth science program."}, {"url": "https://www.jpl.nasa.gov/who-we-are", "page_content": "The success of JPL’s first spacecraft, the Explorer I satellite, in 1958 helped lift America into the Space Age. Our spacecraft have flown to every planet in the solar system, the Sun, and into interstellar space in a quest to better understand the origins of the universe, and of life. Our missions honor the relentless pursuit of the seeker: Voyager, Curiosity, Cassini, Galileo.\n\nIt was a camera on Voyager 1 that captured the pale blue dot of Earth from 3.7 billion miles away and corrective optics engineered by JPL that brought the Hubble Space Telescope into focus. JPL helped build and manages one of the four cameras aboard the James Webb Space Telescope. In fact, the image sensors used in modern digital cameras, including your smartphone’s, were developed at JPL, too.\n\nCloser to home, JPL spacecraft, science instruments, and airborne missions help humanity study and track climate change, manage natural resources, and respond to disasters. And the giant dish antennas of NASA’s Deep Space Network – built and managed by JPL – send and receive data from nearly all spacecraft traveling beyond the Moon."}]}