{"Anne de Gaulle was born on 28 October 1928.": [{"url": "https://www.biographies.net/biography/anne-de-gaulle/m/09cjyh", "page_content": "Who was Anne de Gaulle?\n\nAnne de Gaulle was the youngest daughter of General Charles de Gaulle and his wife, Yvonne. She was born in Trier, Germany, where her father was stationed.\n\nYvonne de Gaulle was struck by an automobile shortly before Anne's birth. She was born with Down syndrome and lived with her family until her death. De Gaulle's relatives all testified that the General, who was normally undemonstrative in his affections for his family, was more open and extroverted with Anne. He would entertain her with songs, dances, and pantomimes.\n\nIn October 1945, Yvonne de Gaulle bought the Château de Vert-Cœur at Milon-la-Chapelle, where they installed a private hospital for handicapped young girls: the Fondation Anne de Gaulle.\n\nAnne died of pneumonia on 6 February 1948, aged 20, at Colombey-les-Deux-Églises. Upon her death, her father said: \"Now, she's like the others.\"\n\nOn 22 August 1962, Charles de Gaulle was the victim of an attempted assassination at Petit-Clamart. He later said that the potentially fatal bullet had been stopped by the frame of the photograph of Anne that he always carried with him, placed this particular day on the rear shelf of his car."}, {"url": "https://peoplepill.com/people/anne-de-gaulle/", "page_content": "Anne de Gaulle (1 January 1928 – 6 February 1948) was the youngest daughter of General Charles de Gaulle and his wife, Yvonne. She was born in Trier, Germany, where her father was stationed with the Army of Occupation in the Rhineland.\n\nShe was born with Down syndrome and lived with her family until her death. De Gaulle's relatives all testified that the General, who was normally undemonstrative in his affections for his family, was more open and extroverted with Anne. He would entertain her with songs, dances, and pantomimes.\n\nIn October 1945, Yvonne de Gaulle bought the Château de Vert-Cœur at Milon-la-Chapelle (Yvelines), where they installed a private hospital for handicapped young girls: the Fondation Anne de Gaulle.\n\nAnne died of pneumonia on 6 February 1948, aged 20, at Colombey-les-Deux-Églises. Upon her death, her father said: \"Now, she's like the others.\" (\"Maintenant, elle est comme les autres.\")\n\nOn 22 August 1962, Charles de Gaulle was the victim of an attempted assassination at Petit-Clamart. He later said that the potentially fatal bullet had been stopped by the frame of the photograph of Anne that he always carried with him, placed this particular day on the rear shelf of his car. When he died in 1970, he was buried in the cemetery of Colombey beside his beloved daughter."}, {"url": "https://www.wikitree.com/wiki/De_Gaulle-7", "page_content": "Anne de Gaulle\n\n1 Jan 1928 in Trier, Rheinland-Pfalz, Deutschland Bornin\n\nAncestors\n\n(1920s - unknown) ] and Élisabeth Jacqueline Marie Agnès (de Gaulle) de Boissieu Sister of [private brother] and\n\n6 Feb 1948 at age 20 in Colombey-les-Deux-Églises, Haute-Marne, France Diedin\n\nProfile last modified 4 Jan 2017\n\nThis page has been accessed 585 times.\n\nCette enfant était aussi une grâce, elle m’a aidé à dépasser tous les échecs et tous les hommes, à voir plus haut.\n\nBiography\n\nAnne, born in Trier where her father was in garrison, was the youngest child of the General de Gaulle.\n\nShe had Down syndrome and died at age 20 of bronco-pneumonia.\n\nIn 1945, her mother Yvonne de Gaulle had bought a castle in Milon-la-Chapelle, where she established a home for mentally handicapped girls: the Fondation Anne de Gaulle.\n\nSources"}, {"url": "https://catholicstand.com/anne-de-gaulle/", "page_content": "Charles de Gaulle could be a very frustrating man. Churchill, in reference to de Gaulle, said that the heaviest cross he had to bear during the war was the Cross of Lorraine, the symbol of the Free French forces.\n\nArrogant, autocratic, often completely unreasonable, de Gaulle was all of these. However, there is no denying that he was also a great man. Rallying the Free French forces after the Nazi conquest of France, he boldly proclaimed, “France has lost a battle, France has not lost the war.” For more than a few Frenchmen and women, de Gaulle became the embodiment of France. It is also hard to dispute that De Gaulle is the greatest Frenchman since Clemenceau, “The Tiger”, who led France to victory in World War I. However, de Gaulle was something more than a great man, he was also at bottom a good man, as demonstrated by his youngest daughter Anne de Gaulle.\n\nAnne de Gaulle Had Down Syndrome\n\nCharles and Yvonne de Gaulle were both devout Catholics, so when their youngest daughter Anne was born on New Years Day in 1928, they had a strong faith to fall back on when they learned that Anne had Down Syndrome. She also had birth injuries that meant that she would never walk unaided. There was never any question about Anne being institutionalized. She was a member of their family, and she stayed with the family in all their travels. There was one sacred rule in the de Gaulle household: Anne was never to be made to feel different or less than anyone else.\n\nCharles de Gaulle was noted for his reserve and even with family members he was usually not very demonstrative. Not so with his daughter Anne, who received a warmth that he had seemed to be storing for his entire life just for her. “Papa” was the one word that Anne could say clearly. He would sing to her, read her stories and play with her. She was, he said simply, “My joy”. As de Gaulle said, “She helped me overcome the failures in all men, and to look beyond them.”\n\nThe De Gaulles Were Heartbroken\n\nYvonne de Gaulle, a formidable woman in her own right, as she demonstrated after the collapse of France in 1940 when by herself she traveled across the war-torn country and made sure her family, including Anne, was on the last transport from Brest to England, in October 1945 bought the Château de Vert-Cœur and established a hospital for handicapped girls, the Fondation Anne de Gaulle. The de Gaulles were heartbroken when their beloved daughter died on February 6, 1948, in her father’s arms. After they had buried her, Charles gently told his weeping wife, “Maintenant, elle est comme les autres.” (Now, she’s like all the others.)\n\nOf course , the de Gaulles did not forget their daughter. Charles de Gaulle’s’ life was saved by his love for Anne on August 22, 1962, when an assassin’s bullet was deflected in the car he was riding by the frame of the picture of his daughter which he carried with him at all times. When he died in 1970 he was buried beside his daughter at Colombey-les-Deux-Églises as he requested. Love gives us no guarantees against the tragedies of life, but it does give us the strength to surmount them."}, {"url": "https://journeytofrance.com/facts-about-charles-de-gaulle/", "page_content": "Do you want to know some interesting facts about Charles de Gaulle?\n\nBorn Charles André Joseph Marie de Gaulle in Lille, in northern France, on November 22, 1980, Charles de Gaulle is the last President of the Fourth Republic of France.\n\nIf there was one leader that is best associated with France, it would be Charles de Gaulle. For many people all over the world, the name name “Charles de Gaulle” is synonymous with France. He is widely recognized as one of the greatest and most influential French leaders in history.\n\nRELATED READ:\n\nRead to know more interesting facts about Charles de Gaulle.\n\n12 Interesting Facts About Charles de Gaulle\n\nJourney To France contains affiliate links all throughout the site. If you choose to purchase a product or book services through our affiliate links, this earns us a commission at no extra cost to you. For our complete disclosure, click here\n\n1. The largest and busiest airport in France is named after him\n\nAéroport de Paris-Charles-de-Gaulle or Paris Charles De Gaulle International Airport is recognized as the largest and busiest airport in the country.\n\nLocated in Roissy-en-France, 23 kilometers northeast of the French capital, the Charles de Gaulle Airport also goes by the names Roissy Airport and Paris CDG. It opened in 1974 and spans 32.38 square kilometres of land.\n\nThe Charles de Gaulle Airport is the world’s 9th busiest airport. In Europe, it is second only to London’s Heathrow. Within the EU, it is on the number one spot in terms of passenger numbers.\n\n2. He is known in France simply as “le Général” or “the General”\n\nGen. Charles de Gaulle was a statesman and officer in the French army who headed the Free French movement that fought the Nazis during the Second World War.\n\nDe Gaulle’s interest in the military started when he was a boy. It was not surprising that he decided to attend the Saint-Cyr Military Academy in Guer, France.\n\nIn 1913, de Gaulle, who was then a young second lieutenant, became a member of an infantry regiment that Colonel Philippe Pétain commanded. Pétain who fought in the First World War would later be imprisoned for treason.\n\nAs a soldier, de Gaulle was brilliant, hardworking, and passionate. Throughout his military career that spanned from 1912 to 1944, he had been known to possess outstanding courge and great self-assurance. His rank was brigadier general.\n\n3. He had fought in 8 battles\n\nGeneral de Gaulle had fought in a total of 8 battles, which were the following: Battle of Verdun, Battle of the Somme, Polish – Soviet War, Battle of France, Battle of Montcornet, Battle of Abbeville, Battle of Dakar, and the Liberation of Paris.\n\n4. Charles de Gaulle saved France from several crises\n\nGen. de Gaulle had saved his country from several deep crises.\n\nFirst, he was hugely responsible for the liberation of France from the Nazis during the Second World War. This made “le Général” a war and national hero.\n\nWhen World War II was over, de Gaulle became the leader of the nation during some of France’s tensest periods – from 1944 through 1946 and from 1958 until 1969.\n\nHe is also linked with the founding of the most recent Fifth French Republic as well as the making of a new constitution which strengthened the institution of the presidency.\n\nAs president, Charles de Gaulle worked hard for the French politics to be more nationalist, which reinforced its position in the international scene.\n\n5. Charles de Gaulle married on April 6, 1921\n\nCharles de Gaulle was a military captain who was recently home from a mission in Poland when he met young Yvonne Vendroux.\n\nA year later, on 6 April 1921, the two were married in the Notre-Dame de Calais Church in Calais on the Opal Coast, where the Vendroux family was from.\n\n6. Charles de Gaulle had a daughter with Down syndrome\n\nThe union of Charles de Gaulle and Yvonne Vendroux produced three children: Philippe (born in 1921), Élisabeth (born in 1924), and Anne (born in 1928).\n\nThe youngest child, Anne de Gaulle, was born in the German city of Trier where her soldier father was stationed. She was born with Down syndome, a genetic disorder that is usually associated with distinct facial features, intellectual disability which can be mild to moderate, and delays in physical growth.\n\nSuffice it to say, Anne was his father’s favorite. He would often sing and dance with her, or do pantomimes to entertain her.\n\nIn 1945, the de Gaulles established the Fondation Anne de Gaulle at the Château de Vert-Cœur at Milon-la-Chapelle, in north-central France. It was a private hospital for handicapped girls like Anne, who succumbed to bronchial pneumonia in 1948.\n\n7. Charles de Gaulles was a devout Catholic\n\nCharles de Gaulle was raised in a strictly Catholic family. Henri de Gaulle, Charles’ father, taught history and literature at a Jesuit high school in Paris.\n\nIt was Charles de Gaulle’s religious parents who were responsible for his spiritual and intellectual formation in the Catholic faith. Prior to the military academy, he attended Catholic schools.\n\nWhen he was 16, Charles de Gaulle volunteered to be a stretcher-bearer at Lourdes. There he witnessed a miracle: a paralyzed Italian girl cured during the holy procession.\n\nDe Gaulle frequently attended the Mass and as a student he was one of the few who joined Congregation of the Holy Virgin, a religious organization devoted to prayer and spiritual meditation.\n\n8. De Gaulle became President of the French Republic on 21 December 1958\n\nDe Gaulle was elected President by an electoral college. He was reelected for a second term in 1965. He resigned from presidency in 1969, following the failure of his referendum in which he proposed more decentralization.\n\n9. His First Lady was also a conservative Catholic\n\nYvonne de Gaulle was strictly Catholic just like her husband. Mrs. de Gaulle fought against prostitution, pornography and its sale in newsstands, and the display of sex and nudity on TV.\n\nFor her conservative Catholic views, Yvonne de Gaulle garned the famous nickname “Tante Yvonne,” or “Auntie Yvonne.”\n\n10. Charles de Gaulle survived 30 attempts on his life\n\nIf cats had nine lives, Charles de Gaulle had 30!\n\nThe most prominent of all these attempts was led by Jean Bastien-Thiry, a lieutenant-colonel in the French Air Force and also a military air-weaponry engineer.\n\nBastien-Thiry belonged to the Organisation Armée Secrète, a right-wing organization that opposed President de Gaulle’s decision to sign the independence of Algeria.\n\nHe was the last man in France to be executed by firing squad for his foiled assassination attempt on the president on August 22, 1962.\n\n11. His daughter Anne’s picture saved General de Gaulle’s life\n\nThe 22 August 1962 failed assassination attempt on Charles de Gaulle took place as he was riding his limousine with his wife at Petit-Clamart, a suburb of Paris.\n\nA potentially fatal bullet from the machine gun that ambushed the couple hit the frame of Anne de Gaulle’s picture that her father always carried with him.\n\nThat day, the picture frame was placed on the rear shelf of the de Gaulle’s limo, saving President de Gaulle’s life by stopping the bullet that would have otherwise hit him.\n\n12. Charles de Gaulle died a natural death two weeks shy of his 80th birthday\n\nAfter so many foiled attempts on Charles de Gaulle’s life, he enjoyed a very healthy life until November 9, 1970 – just a couple of weeks shy of his 80th birthday.\n\nHe died of aneurysm in his home in Colombey-les-Deux-Églises, watching TV and playing cards.\n\nThen French President Georges Pompidou announced General de Gaulle’s death the following morning with a simple statement: “Le général de Gaulle est mort; la France est veuve.” Translated to English, it means: “General de Gaulle is dead. France is a widow.”\n\nHi, I’m Christine – a full-time traveler and career woman. Although I’m from the Philippines, my location independent career took me to over 40 countries and lived in 4 continents in the last 10 years, including France. A self-proclaimed Francophile, I love everything France.\n\nSharing is caring!"}, {"url": "https://www.catholicworldreport.com/2017/04/26/a-fathers-love-the-story-of-charles-and-anne/", "page_content": "In World War II, Charles de Gaulle saved France’s honor from the shame of defeat. Few know, however, how much strength he drew from his Down Syndrome daughter.\n\nWhen it comes to failed governments in our time, it’s hard to ignore French President François Hollande’s administration. Hollande’s record on basic issues like unemployment as well as his ineptness in the face of jihadist terrorism is so unimpressive that he declined to run for reelection. This, however, hasn’t stopped his government from making the type of last-minute defiant gesture beloved of administrations whose days are numbered.\n\nIn Hollande’s case, it has taken the form of effectively banning pro-life websites that don’t explicitly identify themselves as pro-life. This follows a 2016 ruling by France’s Conseil d’État endorsing a broadcasting tribunal’s 2014 decision to prohibit a commercial portraying Down Syndrome children as joyful individuals loved by their parents because it might distress those who chose to terminate an unborn disabled child.\n\nReflecting upon these developments, I couldn’t help thinking how much France owes to one particular Down Syndrome child: a young girl who struggled to speak, needed assistance to walk, and who died of pneumonia at the age of 20 cradled in her father’s arms. Anne de Gaulle’s father, however, was no ordinary man.\n\nCharles de Gaulle was surely the twentieth century’s greatest Frenchman. Yet for all his achievements, the ultimate drama of de Gaulle’s life was his helpless daughter. What Anne gave to him, however, was immeasurable. As de Gaulle confided to a priest at the beginning of his lonely crusade in 1940 to save France’s honor, “for me, this child is a grace, she is my joy, she helps me to look beyond all the failures and honors, and always to look higher.”\n\nUn enfant pas comme les autres\n\nCharles de Gaulle was an austere individual, one who consciously cultivated distance from others. 47 years after his death, however, we know much more about the private man. Thanks to the publication of memoirs, especially those of his son Admiral Philippe de Gaulle, the General emerges as a man who, like many French army officers of his background, found solace in his Catholic faith and a closely-knit family. We’re also discovered that de Gaulle had a rich intellectual life which went far beyond politics. This went hand-in-hand with a wicked sense of humor which, in private, de Gaulle wasn’t averse to using against himself.\n\nBy the time he reached his mid-30s, de Gaulle had settled into a milieu in which his faith, family and profession provided many of the certainties required for an ambitious man intent upon shaking up a political and military establishment committed to obsolete ideas. All this was shattered on 1 January 1928 when Charles and Yvonne de Gaulle’s third child was born. Within a few months, it became apparent that Anne was severely disabled.\n\nIt’s important to remember that this was an era in which disabled children were neither seen nor heard in polite company. Down Syndrome children were referred to as “mongols.” Some even speculated that the condition resulted from alcoholism or some form of impropriety on the parents’ part. It wasn’t until 30 years after Anne de Gaulle’s birth that another devout French Catholic, Professor Jerome Lejeune, and his research team discovered that Down Syndrome was caused by an extra copy of chromosome 21.\n\nIn the 1930s, it was common for French families to place disabled children permanently in hospitals that were woefully ill-equipped to care them. Charles and Yvonne de Gaulle, however, refused to send Anne to live with, as he would say, “strangers.” In de Gaulle’s words, “God has given her to us. We must take responsibility for her, wherever she is and whatever she will be.” In a way, de Gaulle’s reaction to Anne’s entry into his life foreshadowed the spirit of resistance expressed in his famous appeal of 18 June 1940 to Frenchmen to continue the war against Germany.\n\nThe de Gaulles worked hard to build a place for, to use de Gaulle’s expression, “a child who is not like the others” in their family. From all accounts, Yvonne de Gaulle adopted a matter-of-fact approach. She focused on the practicalities of caring for a disabled child. Charles de Gaulle’s contribution was to envelop Anne in a web of affection. According to his son, de Gaulle wanted to give Anne the assurance that he loved her just as much as her older brother and sister—that her disability meant nothing to him.\n\nThe tall army officer infamous for his air of haughty disdain as leader of Free France during World War II and later as French President didn’t hesitate to unbend to play on the floor with Anne. De Gaulle sang to Anne, told her stories, and even allowed her to play with one of his most treasured possessions: his officer’s kepi hat. De Gaulle also said prayers with Anne in the evening. Painstakingly, she would repeat each word after her father. “You see,” de Gaulle proudly informed his relatives, “she knows her prayers!”\n\nWhen away on army business, de Gaulle constantly inquired about Anne’s well-being. On one occasion, Anne had an operation while he was absent on maneuvers. De Gaulle telephoned incessantly to ask if she was in pain, whether the procedure had succeeded, what the doctors were saying, etc. Anne seems to have been aware of just how much she meant to her father. Her first governess recalled that Anne adored him and would be visibly upset when his responsibilities took de Gaulle away from his family.\n\nThough the de Gaulles valued their privacy, they didn’t view Anne as an embarrassment. There are pictures of her standing awkwardly with members of the de Gaulles’ extended family. Most striking, however, is a photo of Anne taken at a beach in Brittany in 1933. She is sitting on her father’s lap. He, dressed in a homburg hat and three-piece suit, gently holds her hands as the five year-old girl looks intensely into her father’s eyes. It’s an image of unconditional love.\n\nWhile Anne lived, the de Gaulles took her everywhere with them. That included less-than-hospitable locations such as the French mandate in Syria and Lebanon. De Gaulle was posted there in 1929, partly because some of his superiors wanted to sideline an officer who asked awkward questions about France’s readiness for the next war. There was, however, no question of leaving Anne behind. Instead she went with them, with the de Gaulles hiring a full-time governess to help them care for Anne in a Middle-Eastern country.\n\nFragility—and Resistance—in the face of Evil\n\nThere was, of course, a cost to all this. Though Charles de Gaulle came from a minor aristocratic family and his wife from an upper-middle class background, the de Gaulles were not wealthy. His modest army pay was their main source of income. Hiring full-time help was subsequently an enormous financial liability, but one they didn’t hesitate to assume.\n\nThen there was the psychological burden. As Yvonne de Gaulle’s biographer Frédérique Neau-Dufour observes, Yvonne was an exuberant, even care-free young woman before Anne was born. After Anne’s birth, that woman gradually disappeared. Yvonne became a much quieter, even somewhat withdrawn person who dreaded public appearances. This, however, didn’t stop her from undertaking the extremely difficult task of successfully fleeing France with the profoundly disabled Anne in tow as the German Army swept across the country in May and June 1940.\n\nThis brings into focus another factor of which Charles de Gaulle was undoubtedly aware: how the National Socialist regime treated the disabled. Eugenics was part and parcel of the Nazi view of the world (and most Western liberal opinion for decades). And, as the Nazis made clear right from the beginning, the disabled had no place in a National Socialist world. They were lebensunwertes leben (life unworthy of life).\n\nStarting in September 1939, the Nazi government began removing Down Syndrome children and infants suffering from other disabilities from their parents. These children were taken to “health facilities” and killed by lethal injection or gas poisoning. In the name of “racial health” and other eugenics nonsense, the regime murdered thousands of disabled children. Among them was a 15 year-old Down Syndrome cousin of the future pope, Joseph Ratzinger.\n\nThis would have been Anne de Gaulle’s fate if she had ever fallen into Nazi hands. Although de Gaulle never referenced it specifically, it’s likely that the brutal treatment of the disabled was one of the things he had in mind when referring to the evil of the Nazi regime. When de Gaulle refused to surrender in 1940 and was branded a traitor by France’s political and military elites, it was certainly the act of an intensely patriotic man unwilling to accept his country’s abasement by the Nazis. But de Gaulle’s act of resistance also concerned safeguarding his defenseless daughter from those who viewed her as sub-human.\n\nLife after Death\n\nLike many Down Syndrome children, Anne de Gaulle died at an early age. Her brother Philippe recollects arriving at his parents’ house in 1948 to find the entire residence immersed in silence. Noone, he writes, dared to say anything to his grief-stricken father. Anne was subsequently buried in the cemetery at the de Gaulles’ parish church in Colombey-les-Deux-Églises. After attending their regular Sunday Mass and always on the anniversary of her death, Charles and Yvonne de Gaulle would visit Anne’s grave. 22 years after she died, her father was laid to rest beside Anne. Her mother joined them in 1979.\n\nThat, however, wasn’t the end of the story. Back in October 1945, the de Gaulles raised enough money from private donors to buy the chateau de Vert-Cœur in the department of Yvelines, not far from Paris. They then began creating a home for intellectually disabled girls. A few months after Anne’s death, the Fondation Anne-de-Gaulle opened its doors at the chateau. Staffed by nuns, funded by the considerable royalties generated by de Gaulle’s memoirs, and presided over by Yvonne de Gaulle until her death, the Foundation continues to serve the disabled today.\n\nOne of Charles de Gaulle’s biographers, the late Jean Lacouture, records him as once saying, “Without Anne, I could never perhaps have done what I did. She gave me the heart and the inspiration.” In that sense, the man of June 18 and his beloved pauvre petiteAnne teach us something which we are tempted to forget—that all of us can find strength in weakness and that nothing is more powerful than self-giving love."}, {"url": "https://the-american-catholic.com/2013/08/06/anne-de-gaulle-2/", "page_content": "(I wrote this post back in 2009. I am republishing it now because it has always been one of my favorites and the blog readership is far higher now. Additionally it is one of several posts that I have written that I think, in retrospect, may have been God’s way of preparing me for the loss of my son Larry on May 19 of this year. )\n\nCharles de Gaulle could be a very frustrating man. Churchill, in reference to de Gaulle, said that the heaviest cross he had to bear during the war was the Cross of Lorraine, the symbol of the Free French forces. Arrogant, autocratic, often completely unreasonable, de Gaulle was all of these. However, there is no denying that he was also a great man. Rallying the Free French forces after the Nazi conquest of France, he boldly proclaimed, “France has lost a battle, France has not lost the war.” For more than a few Frenchmen and women, de Gaulle became the embodiment of France. It is also hard to dispute that De Gaulle is the greatest Frenchman since Clemenceau, “The Tiger”, who led France to victory in World War I. However, de Gaulle was something more than a great man, he was also at bottom a good man, as demonstrated by his youngest daughter Anne de Gaulle.\n\nCharles and Yvonne de Gaulle were both devout Catholics, so when their youngest daughter Anne was born on New Years Day in 1928, they had a strong faith to fall back on when they learned that Anne had Down Syndrome. She also had birth injuries that meant that she would never walk unaided. There was never any question about Anne being institutionalized. She was a member of their family, and she stayed with the family in all their travels. There was one sacred rule in the de Gaulle household: Anne was never to be made to feel different or less than anyone else. Charles de Gaulle was noted for his reserve and even with family members he was usually not very demonstrative. Not so with his daughter Anne, who received a warmth that he had seemed to be storing for his entire life just for her. “Papa” was the one word that Anne could say clearly. He would sing to her, read her stories and play with her. She was, he said simply, “My joy”. As de Gaulle said, “She helped me overcome the failures in all men, and to look beyond them.”\n\nYvonne de Gaulle, a formidable woman in her own right, as she demonstrated after the collapse of France in 1940 when by herself she traveled across the war torn country and made sure her family, including Anne, was on the last transport from Brest to England, in October 1945 bought the Château de Vert-Cœur and established a hospital for handicapped girls, the Fondation Anne de Gaulle. The de Gaulles were heart-broken when their beloved daughter died on February 6, 1948 in her father’s arms. After they had buried her, Charles gently told his weeping wife, “Maintenant, elle est comme les autres.” (Now, she’s like all the others.)\n\nOf course the de Gaulles did not forget their daughter. Charles de Gaulles’ life was saved by his love for Anne on August 22, 1962 when an assassin’s bullet was deflected in the car he was riding by the frame of the picture of his daughter which he carried with him at all times. When he died in 1970 he was buried beside his daughter at Colombey-les-Deux-Églises as he requested. Love gives us no guarantees against the tragedies of life, but it does give us the strength to surmount them."}, {"url": "https://historydraft.com/story/charles-de-gaulle/timeline/778", "page_content": "History of Charles de Gaulle\n\nFrance\n\nCharles André Joseph Marie de Gaulle (22 November 1890 – 9 November 1970) was a French army officer and statesman who led Free France against Nazi Germany in World War II and chaired the Provisional Government of the French Republic from 1944 to 1946 to reestablish democracy in France. In 1958, he came out of retirement when appointed President of the Council of Ministers (Prime Minister) by President René Coty. He rewrote the Constitution of France and founded the Fifth Republic after approval by referendum. He was elected President of France later that year, a position to which he was reelected in 1965 and held until his resignation in 1969.\n\nStoryteller Article"}, {"url": "https://wiki2.org/en/Anne_de_Gaulle", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nDaughter of Charles de Gaulle\n\nAnne de Gaulle (1 January 1928 – 6 February 1948) was the youngest daughter of General Charles de Gaulle and his wife, Yvonne. She was born in Trier, Germany, where her father was stationed with the Army of Occupation in the Rhineland.\n\nShe was born with Down syndrome and lived with her family until her death. De Gaulle's relatives all testified that the General, who was normally undemonstrative and stoic in his affections for his family, was more open and extroverted with Anne. De Gaulle would entertain her with songs, dances, and pantomimes.[1]\n\nThe grave of Anne beside her parents\n\nIn October 1945, Yvonne de Gaulle bought the Château de Vert-Cœur at Milon-la-Chapelle (Yvelines), where they installed a private hospital for disabled young girls: the Fondation Anne de Gaulle.\n\nAnne died of pneumonia[2] on 6 February 1948, aged 20, at Colombey-les-Deux-Églises. She could only say one word clearly: \"Papa\". Upon her death, her father said: \"Now, she is like the others.\" (\"Maintenant, elle est comme les autres.\")[1]\n\nOn 22 August 1962, Charles de Gaulle was the victim of an attempted assassination at Petit-Clamart. He later said that the potentially fatal bullet had been stopped by the frame of the photograph of Anne that he always carried with him; placed this particular day on the rear shelf of his car. When he died in 1970, he was buried in the cemetery of Colombey beside his beloved daughter.\n\nShe is portrayed by Clémence Hittin in the 2020 film De Gaulle.\n\nYouTube Encyclopedic\n\n1 / 1 Views: 4 960\n\nPourquoi parle-t-on du porte-avions Charles-de-Gaulle ? - 1 jour, 1 question Transcription\n\nReferences\n\n\n\n"}, {"url": "https://www.answers.com/history-ec/When_was_Anne_de_Gaulle_born", "page_content": "Trending Questions\n\nWhere would you brambles?\n\nAsked By Wiki User\n\nWhat three numbers are between 0.63 and 0.64?\n\nAsked By Mia Johnston\n\nWhat different ways of communicating?\n\nAsked By Wiki User\n\nWhat do you call the number of times a machine multiplies the effort?\n\nAsked By Wiki User\n\nwhat is 1.67 as an integer?\n\nAsked By Keysha Aliu\n\nThe smallest number that rounds 100?\n\nAsked By Ye Mon Aung\n\nDo you need Microsoft products discount price?\n\nAsked By Allen Williams\n\nExample some math/equation that can make my life easy?"}], "Anne de Gaulle died of meningitis on 18 April 1948 at the age of 19.": [{"url": "https://www.nytimes.com/1948/02/08/archives/anne-de-gaulle-dies-generals-daughter.html", "page_content": "Credit... The New York Times Archives\n\nFebruary 8, 1948 , Page 60 Buy Reprints See the article in its original context fromFebruary 8, 1948 , Page 60 View on timesmachine TimesMachine is an exclusive benefit for home delivery and digital subscribers.\n\nFull text is unavailable for this digitized archive article. Subscribers may view the full text of this article in its original form through TimesMachine."}, {"url": "https://www.encyclopedia.com/women/encyclopedias-almanacs-transcripts-and-maps/de-gaulle-yvonne-1900-1979", "page_content": "de Gaulle, Yvonne (1900–1979)\n\nFrench first lady who went into exile with her husband Charles de Gaulle when he headed the Free French resistance during WWII and was, in her later years, affectionately known in France as \"Tante Yvonne\" (Aunt Yvonne). Name variations: Madame de Gaulle. Born Yvonne Charlotte Anne-Marie Vendroux (pronunciation: Vahn-DROO) on May 22, 1900, in the family home in Calais, on the Channel coast of France; died on November 8, 1979, in the military hospital Val-de-Grâce, Paris; daughter of Jacques Vendroux (the head of a biscuit manufacturing company) and Marguerite (Forest) Vendroux; received primary and secondary education largely with private tutors at home; spent several years at a primary school, Notre-Dame in Calais; married Charles de Gaulle, on April 7, 1921 (a civil ceremony took place the previous day but it was the religious ceremony held April 7 that was regarded as their wedding by the de Gaulles); children: Philippe (b. December 28, 1921); Elisabeth de Boissieu (b. May 15, 1924); Anne de Gaulle (January 1, 1928–February 6, 1948).\n\nChildhood years spent in family home in Calais; at age five, began primary education with private tutors (1905); as German forces advanced toward Calais at outset of WWI, Vendroux family took refuge in England (July–August 1914); family returned to Calais (December 1914); cared for war wounded in Calais (1915–16); left Calais, under threat of German bombs, for safety in Paris (1916); as renewed German offensive threatened Paris (March 1918), sent out of harm's way to Mortagne, Brittany, then Perigueux (summer and autumn, 1918); worked with mother among the wounded war veterans in Calais (1919–20); met Charles de Gaulle (October 1920); after marriage, lived together in Paris (1921); moved with Charles, who was promoted to major and placed in charge of 19th Battalion of Light Infantry in Trier, Germany (1927); moved with family to Beirut (then in Syria, a French mandate of the League of Nations, now Lebanon), where Charles was posted (1929); returned to Paris (1931); purchased La Boisserie, an estate in the village of Colombey-les-Deux-Églises, in the Haute-Marne department in eastern France (June 9, 1934); based in Metz where Charles commanded the 507th Tank Regiment (1937); outbreak of WWII (September 1, 1939); Germans entered Paris (June 14, 1940); de Gaulle family left France for London (June 17) where Charles' first BBC radio broadcast back to France called for resistance against Germany (June 18); moved to join Charles in liberated Algiers (July 1943); Allied invasion of Normandy (June 6, 1944); rejoined Charles, now head of the Provisional Government, in Neuilly, near Paris (September 1944); Charles resigned as head of the Provisional Government (January, 1946); moved back into La Boisserie(May 1946); death of daughter Anne, caused by pneumonia (February 6, 1948); returned to Paris with re-call of Charles to power during Algerian crisis (June 1, 1958); became \"first lady\" of France upon the inauguration of Charles as first president of the Fifth Republic (January 8, 1959); narrowly survived an assassination attempt in the company of her husband (August 22, 1962); retired to La Boisserie after referendum defeat of de Gaulle (April 1969); death of Charles de Gaulle (November 9, 1970).\n\nOn August 22, 1962, in the Paris suburb of Petit-Clamart, en route from the Élysée Palace to the town of Villacoublay, the French presidential car was ambushed by a commando who fired some 150 shots from automatic weapons. Fourteen bullets struck the car in which Charles and Yvonne de Gaulle, their son-in-law Alain de Boissieu, and the driver Francis Marroux were riding, on their way for a weekend at the presidential retreat in Colombey-les-Deux-Églises. No one was hit. The Petit-Clamart attack was but the closest call in a series of assassination attempts by groups opposed to Charles de Gaulle's ceding of independence to the rebellious colony of Algeria. The general, at least according to some accounts, had been too proud even to drop to the floor during the fusillade, and, even though a bullet passed between their heads, Yvonne de Gaulle had also remained seated erect during the attack. Upon their arrival at Villacoublay, the general turned to his wife and said: \"Yvonne, you are brave.\"\n\nYvonne de Gaulle's behavior during and after the Petit-Clamart assassination attempt typified the stoicism, courage, and fidelity that characterized her entire adult life and for which she is remembered in France. Years after her death, President Richard Nixon remembered her having said in 1969, \"the presidency is temporary, the family permanent.\" The product of a middle-class Catholic family from Calais, in Normandy, Yvonne de Gaulle exemplified the \"dutiful wife and mother,\" silent in public but influential behind the scenes. Deeply religious and private, she kept to herself whatever complaints she might have had living with the self-assured and frequently cantankerous Charles de Gaulle. She lived so privately that, even as first lady in France during the 1960s, she was able to shop in Parisian stores without being recognized. Although her role came increasingly into question in the France of the 1960s, she nonetheless came to be respected in France as \"Tante Yvonne\" (Aunt Yvonne), during the presidency of her husband.\n\nThe daughter of Jacques and Marguerite Vendroux , Yvonne Vendroux was born on May 22, 1900, in the family home in Calais, on the Channel coast of France. Her father, who had gone into the biscuit-producing business, came from a long line of shipowners and local mayors and was himself vice president of the Chamber of Commerce, a municipal councilor, and the honorary consul of several foreign countries. He was, in French terms, a \"notable,\" or local dignitary. His family, the Van Droog, tobacco producers, had moved in the late 17th century from Delft in Holland to Dunkirk, where the name was changed to Vandroux; later the family moved to Calais, where the name was changed to Vendroux. Yvonne's mother, Marguerite Forest Vendroux, was the granddaughter of a well-known notary of the town of Charleville.\n\nMadame de Gaulle's importance was considerable not for what she said or did but for what she neither did nor said, by her silent presence. —André Malraux\n\nYvonne Vendroux had a happy and stable childhood. Raised amid comfortable circumstances, the second of four children, she spent her early years with her family, in Calais in the winter and in a country estate in the Ardennes during the summer, where she went mountain climbing and developed a lifelong love of nature, especially flowers. Most of her schooling took place in the form of home tutoring. Dubious about the quality of the local schools after the 1905 separation of church and state in France, Yvonne's parents hired a tutor, Mademoiselle Delannoy , for her primary education. After 1907, she was sent for awhile as a day student to the local Notre-Dame boarding school, but her parents retained the tutor to supplement their daughter's education. Her secondary school education took place entirely at home.\n\nYvonne's first communion, in 1911, was followed by three relatively carefree years, broken with the onset of World War I in August 1914. As German forces advanced toward Calais and bombs fell on the town early in the war, the Vendroux family took refuge in Kent, in southern England. By the end of 1914, when it had become clear that the French forces would hold and Calais would be safe from German invasion, the Vendroux family returned. There, Yvonne's activities continued to revolve around the home as her mother cared for wounded war veterans. In 1916, seeking greater security, the family again left Calais for Paris, where Yvonne remained until March 1918, when a renewed German offensive led the family to send her and her sister Suzanne to Brittany. Now 18, Yvonne next went to Perigueux, where she spent the final days of World War I. With the end of the war, the Vendroux family turned to the restoration of their various properties in the Calais and Ardennes areas. Yvonne assumed an increasing role in household management, allowing her mother to continue to work in veterans' hospitals. Her older brother Jacques accompanied her as chaperon to the parties and balls in Paris and Calais. Yvonne soon joined her mother working among the war wounded, widows, and orphans.\n\nIn October 1920, at a tea arranged by family friends, Yvonne met Captain Charles de Gaulle, then on a brief leave from service with the French military mission in Poland. Shortly thereafter, he invited her to a ball at Saint-Cyr, the French military academy. Taken with Charles, Yvonne accepted and went in the company of Jacques. A few days later, asked directly about her feelings toward Charles, Yvonne replied, \"It will be he or no one.\" The families met, and the couple was officially affianced on November 11, 1920. Charles had to return for two additional months' service in Poland, then returned to France in February. He was named professor of history at Saint-Cyr, a post that would keep him in Paris.\n\nYvonne Vendroux and Charles de Gaulle were married in a civil ceremony in Calais on April 6, 1921, and in a religious ceremony the next day at the Notre-Dame Church in that city. Following their marriage, the young couple settled in a modest Paris apartment and lived a relatively quiet life. Their son Philippe was born at the end of 1921. In 1924, their second child, Elizabeth, was born. Charles finished his studies at the War College, published his first book, La Discorde chez l'Ennemi (Discord in the Enemy), and was posted as an officer working with Marshal Philippe Pétain, the hero of World War I, with whose career his own would be dramatically crossed. In 1927, Yvonne de Gaulle joined her husband in a posting in Trier, Germany, where in 1928, their daughter Anne was born. Within months of Anne's birth, it had become clear that she was suffering from Down's syndrome. Anne was never to speak well or eat or dress unaided. Her illness was the great personal tragedy of the de Gaulles who cared for her tenderly.\n\nIn 1929, the de Gaulles were sent to Beirut, Lebanon, then part of French-controlled Syria, where they remained until 1931. In 1932, Yvonne's father died; her mother died the following year. At the end of 1933, Charles de Gaulle was promoted to lieutenant colonel. In June 1934, the de Gaulles bought \"La Boisserie,\" the estate of Yvonne's late parents, located in the village of Colombey-les-Deux-Églises, in the gently rolling hills of the Haute-Marne department about midway between Paris and France's eastern frontier. The year 1934 also saw the publication of Charles' second book, Vers l'armée de métier (The Army of the Future), which argued, to little avail, that the French should adopt new mechanized forms of warfare. In 1937, Charles was given the command of the 507th Tank Regiment based in Metz. Life for the de Gaulle family revolved quietly around Paris, Metz, and La Boisserie.\n\nYvonne's domain was the family home at La Boisserie, her place of refuge from the turbulent political affairs surrounding her husband. She quietly endured the tragedy of Anne's disabilities while living with a man who was very much a lone rebel in political and military circles during the 1930s, and who clearly ruled as master of the household. Known for his arrogance, Charles was said to be a tyrant at home, with Yvonne silently bearing the brunt of his disappointment and frustration. Charles dominated conversations; Yvonne was told plainly, and sometimes publicly, that her opinion did not count. On more than one occasion Charles was observed telling his wife to be silent, that she could not possibly know anything about politics. Years later, an acquaintance said that compared to the cheerful if somewhat reticent young woman who had married Charles in 1921, the Yvonne of the late 1930s was profoundly sad.\n\nThe outbreak of war with Nazi Germany in September 1939 found Charles in command of his tank regiment. Poland was quickly crushed by the Germans, but the war with France involved little actual fighting in what became known as the drôle de guerre, or phony war. This changed with the German thrust westward of May 10, 1940. The force of the German onslaught was such that, within days, Charles was writing from the front to Yvonne at La Boisserie, warning her to be ready for quick flight in the event that the military situation turned disastrous. On June 1, Charles was promoted to brigadier-general. Five days later, he was appointed undersecretary of state for National Defense and War by Premier Paul Reynaud. The Germans entered Paris on June 14. On June 16, the Reynaud government was replaced by one headed by Marshal Pétain, who was committed to seeking peace with the Germans. A day later, Yvonne with her three children and their governess left for England to join her husband, a political exile.\n\nFor the second time in her life, Yvonne de Gaulle experienced wartime exile in England. On June 18, Charles broadcast back to France, calling on the entire nation to resist the Germans and any French authority that supported collaboration with them. In London, their son Philippe, then 18 years old, joined the newly created Free French Navy in July. In addition to the occupation of her homeland, Yvonne had to accept the fact that her husband was now a rebel, standing almost alone against his country's legal government, which was headed by World War I hero and his own former sponsor, Marshal Pétain. Moreover, Pétain sentenced Charles to death in absentia for wartime desertion and treason. Yvonne set up a household in London as he organized what became the Free French resistance to Nazi Germany and the government of Vichy France. Whatever his other activities in wartime London, Charles was invariably present to tell Anne stories at her bedtime and to shield her from the press.\n\nTogether with other Londoners, Yvonne endured the German Blitz or air raids in the summer and fall of 1940, but ultimately her faith in her husband's vision was rewarded; the fortunes of war turned with the entry of the Soviet Union and the United States into combat against the Nazis. Following the liberation of French North Africa, the de Gaulle family returned to Algiers in June 1943. The liberation of metropolitan France, which began with the D-Day landings in Normandy, June 6, 1944, left the country under the Free French, reorganized as a Provisional Government and headed by Charles de Gaulle. In late August, Paris was liberated and by the end of September, almost all of metropolitan France had been cleared of Germans. Yvonne, now the wife of the leader of the Provisional Government, returned home to supervise the reconstruction of La Boisserie, which had been pillaged and partially burned during the Occupation. Charles, however, became increasingly dispirited as the politicians who had dominated prewar politics and, in his view, had brought on the catastrophe of 1940, regained strength, promising to recreate what he called the \"regime of parties.\" On January 3, 1946, a few weeks after the marriage of daughter Elisabeth to Commander Alain de Boissieu, Charles abruptly resigned his position. The family lived until May in an uncomfortable house rented from the government while La Boisserie was being restored and Charles waited restlessly to be recalled to power.\n\nIn 1946, with the help of Georges Pompidou, who later served as one of Charles' prime ministers and was to become his successor as president, the de Gaulles established the Anne de Gaulle Foundation to help handicapped girls. The Foundation was to care for Anne in the event that her parents predeceased her. Supported financially by the income from Charles' books, the Foundation built a house on a wooded hill in the Chevreuse valley. Staffed by six nuns and a mother superior, the house eventually provided for some 40 handicapped girls. Yvonne helped select them.\n\nIn April 1947, Charles created the Rassemblement du Peuple Français (Rally of the French People), a political party that was to serve as a vehicle for his return to power. Then, on February 6, 1948, Anne died of bronchial pneumonia at age 20. With the death of Anne, the Anne de Gaulle Foundation occupied much of Yvonne's attention. She also accompanied Charles throughout France as he campaigned for his new RPF, but by 1952, the party was fading and he ended it the next year. These years were spent, often with their grandchildren, at La Boisserie where Charles worked on his memoirs, with occasional trips abroad where he was received as the hero of the wartime French Resistance. To visitors at La Boisserie, Yvonne occasionally expressed the desire to protect her husband \"for history,\" and keep him out of politics. The tranquil life was interrupted, however, when the government's inability to suppress the Algerian rebellion led to rioting by European Algerians in the streets of Algiers on May 13, 1958. La Boisserie was quickly turned into a command post as Charles and his advisors planned his return to office. On June 1, Charles de Gaulle was voted in as premier by the National Assembly with full powers to write a new constitution for France. The result was France's Fifth Republic, with a much stronger presidency, filled in 1959 by Charles de Gaulle.\n\nOnce again, Yvonne de Gaulle was a reluctant first lady of France. During the early 1960s, Charles survived several assassination attempts by opponents of independence for Algeria. The closest call was the Petit-Clamart fusillade in 1962. Profiting by the wave of sympathy engendered by the assassination attempt, Charles proposed a constitutional change to elect the president by universal suffrage, which was approved by popular referendum in October. In 1965, against Yvonne's will, he stood as a candidate for the presidency. Forced into a runoff with Socialist candidate François Mitterrand, Charles was elected in the second round to a seven-year term.\n\nTo many in 1960s France, \"Aunt Yvonne\" came to represent the wife of a previous era. She accompanied Charles to innumerable Paris Opera galas, where she sat through close to 30 performances of \"Carmen,\" and hosted the Kennedys, Khrushchevs, and many other world leaders. The comparison of the prim and somewhat dowdy Yvonne, who scrupulously supervised the household affairs of France's presidential Élysée Palace, with the youthful and fashionable Jacqueline Kennedy , who accompanied her husband, then president of the United States, on a visit to Paris in 1961, was played out in the international press. Wearing sedate black, gray, or mauve dresses designed by Paris couturier Jacques Heim, Yvonne avoided décolletage and shunned the more up-to-date fashions of Coco Chanel . Yvonne's successor as France's first lady, Claude Pompidou , recalled later that Yvonne's only advice to her had been to wear hats. Yvonne arranged the floral decorations of the palace, and she loved to travel and accompany her husband on all his official trips abroad, but whenever possible, she returned\n\nto La Boisserie and the gardens that were her favorite pastime.\n\nA strict Catholic, Yvonne set an austere tone at the Élysée Palace, making sure the private lives of those in her husband's entourage passed moral muster. Exerting a considerable, if private, influence, she saw to it that divorcees were weeded out of influential positions and excluded from presidential social functions. She was equally severe in her judgments of much of the literature and film of the 1960s and carefully scrutinized the selection of films to be shown in the palace. For her religious devotions, she had a special chapel built inside the Élysée Palace.\n\nYvonne was with Charles when, during the height of the student and worker unrest of May 1968, he traveled to Baden-Baden to consult with French generals about the possibility of his resigning. She shared his disappointment, when, in April 1969, in a referendum he had called on behalf of decentralizing political reforms, he was defeated. Having staked his political prestige on the referendum, Charles immediately resigned. The couple returned to La Boisserie, where on November 9, 1970, Charles died. Yvonne continued to live there, where she cooked, knitted, and tended her garden, visited often by her children and four grandchildren until the fall of 1978, when she withdrew to the Sisters of the Immaculate Conception convent in Paris. In July 1979, she was operated on in Paris for an intestinal obstruction. Readmitted to a Paris military hospital, she died November 8, 1979. She was buried beside Charles and Anne at the church cemetery in Colombey-les-Deux-Églises. Surviving Yvonne, in addition to her son Philippe and daughter Elisabeth, were her grandchildren and one great-grandson. Mourned as the symbol of moral rectitude and marital fidelity of a long gone era, \"Tante Yvonne\" was called the \"minister of common sense\" in the government of General Charles de Gaulle. Following her death, La Boisserie, which remained in the possession of Philippe, was converted into a museum, open to the public, in honor of the de Gaulles.\n\nsources:\n\nBéliard, Jean. \"Entretien avec Richard Nixon,\" in Institut Charles de Gaulle. De Gaulle en son siècle. Vol. 1: Dans la mémoire des hommes et des peuples. Paris: Plon/La Documentation Française, 1991, pp. 78–86.\n\nDulong, Claude. La Vie quotidienne a l'Élysée au temps de Charles de Gaulle. Paris: Hachette, 1974.\n\nJullian, Marcel. Madame de Gaulle. Paris: Stock, 1982 (in French).\n\nLassus, Robert. Le mari de Madame de Gaulle. Paris: J.C. Lattès, 1990.\n\nMeyer-Stabley, Bertrand. Les dames de l'Élysée, Celles d'hier et de demain. Paris: Perrin, 1995.\n\nVendroux, Jacques. Yvonne de Gaulle, ma soeur, l'enfant, la jeune fille, la jeune femme 1900–1932. Paris: Plon, 1980.\n\nsuggested reading:\n\nBehr, Edward. \"The Silent First Lady of France, Yvonne de Gaulle is a lonely woman feared by many, known by few,\" in Saturday Evening Post. Vol. 237, No. 2. January 18, 1964, pp. 64–65.\n\nChapman, Robin. \"Anne's Story,\" a fictional story in which Anne de Gaulle speaks, in Wartimes. London: Sinclair-Stevenson, 1995.\n\nCook, Don. Charles de Gaulle: A Biography. NY: Putnam, 1983.\n\nDe Gaulle, Charles. The Complete War Memoirs of Charles de Gaulle. 3 vols. Translated by Jonathan Griffin (vol. 1), Richard Howard (vols. 2 and 3). NY: Simon and Schuster, 1964.\n\n——. Memoirs of Hope: Renewal and Endeavor. Translated by Terence Kilmartin. NY: Simon and Schuster, 1971.\n\nDuquesne, Jacques. \"De Gaulle Époux d'Yvonne, amant de Marianne,\" in L'Express. July 30, 1998, pp. 50–51.\n\nGordon, Bertram M. \"Charles de Gaulle,\" in Frank W. Thackeray and John E. Findling, eds. Statesmen Who Changed the World: A Bio-Bibliographical Dictionary of Diplomacy. Westport, CT: Greenwood Press, 1993, pp. 157–168.\n\n——. \"Charles de Gaulle,\" in Anne Commire and Deborah Klezmer, eds., Historic World Leaders. Vol. II. Detroit, MI: Gale Research, 1994, pp. 482–487.\n\nLacouture, Jean. De Gaulle. 2 vols. Volume 1: The Rebel, 1890–1944, translated by Patrick O'Brian and II: The Ruler, 1944–1970, translated by Alan Sheridan. NY: Norton, 1991–92.\n\nPrial, Frank P. \"Yvonne de Gaulle, Widow of French Leader, Dead,\" in The New York Times. November 9, 1979, B4.\n\nrelated media\n\nDe Gaulle and France (180 min), portrait of de Gaulle with archival footage and interviews with people who knew him, Films for the Humanities and Sciences, Princeton, N.J., 1992.\n\nDe Gaulle, Republican Monarch (30 min), from the series \"Leaders of the 20th Century,\" documentary, Learning Corporation of America, New York, 1978.\n\nLa Presidence de la Republique (29 min), the French presidency from 1875 through 1980 with emphasis on the presidency of de Gaulle, PICS, Iowa City, Iowa, 1981.\n\nBertram M. Gordon , Frederick A. Rice Professor of History, Mills College, Oakland, California; author of Collaborationism in Europe during the Second World War, and editor of Historical Dictionary of World War II France (Westport, CT: Greenwood Press, 1998)"}, {"url": "https://www.catholicworldreport.com/2017/04/26/a-fathers-love-the-story-of-charles-and-anne/", "page_content": "In World War II, Charles de Gaulle saved France’s honor from the shame of defeat. Few know, however, how much strength he drew from his Down Syndrome daughter.\n\nWhen it comes to failed governments in our time, it’s hard to ignore French President François Hollande’s administration. Hollande’s record on basic issues like unemployment as well as his ineptness in the face of jihadist terrorism is so unimpressive that he declined to run for reelection. This, however, hasn’t stopped his government from making the type of last-minute defiant gesture beloved of administrations whose days are numbered.\n\nIn Hollande’s case, it has taken the form of effectively banning pro-life websites that don’t explicitly identify themselves as pro-life. This follows a 2016 ruling by France’s Conseil d’État endorsing a broadcasting tribunal’s 2014 decision to prohibit a commercial portraying Down Syndrome children as joyful individuals loved by their parents because it might distress those who chose to terminate an unborn disabled child.\n\nReflecting upon these developments, I couldn’t help thinking how much France owes to one particular Down Syndrome child: a young girl who struggled to speak, needed assistance to walk, and who died of pneumonia at the age of 20 cradled in her father’s arms. Anne de Gaulle’s father, however, was no ordinary man.\n\nCharles de Gaulle was surely the twentieth century’s greatest Frenchman. Yet for all his achievements, the ultimate drama of de Gaulle’s life was his helpless daughter. What Anne gave to him, however, was immeasurable. As de Gaulle confided to a priest at the beginning of his lonely crusade in 1940 to save France’s honor, “for me, this child is a grace, she is my joy, she helps me to look beyond all the failures and honors, and always to look higher.”\n\nUn enfant pas comme les autres\n\nCharles de Gaulle was an austere individual, one who consciously cultivated distance from others. 47 years after his death, however, we know much more about the private man. Thanks to the publication of memoirs, especially those of his son Admiral Philippe de Gaulle, the General emerges as a man who, like many French army officers of his background, found solace in his Catholic faith and a closely-knit family. We’re also discovered that de Gaulle had a rich intellectual life which went far beyond politics. This went hand-in-hand with a wicked sense of humor which, in private, de Gaulle wasn’t averse to using against himself.\n\nBy the time he reached his mid-30s, de Gaulle had settled into a milieu in which his faith, family and profession provided many of the certainties required for an ambitious man intent upon shaking up a political and military establishment committed to obsolete ideas. All this was shattered on 1 January 1928 when Charles and Yvonne de Gaulle’s third child was born. Within a few months, it became apparent that Anne was severely disabled.\n\nIt’s important to remember that this was an era in which disabled children were neither seen nor heard in polite company. Down Syndrome children were referred to as “mongols.” Some even speculated that the condition resulted from alcoholism or some form of impropriety on the parents’ part. It wasn’t until 30 years after Anne de Gaulle’s birth that another devout French Catholic, Professor Jerome Lejeune, and his research team discovered that Down Syndrome was caused by an extra copy of chromosome 21.\n\nIn the 1930s, it was common for French families to place disabled children permanently in hospitals that were woefully ill-equipped to care them. Charles and Yvonne de Gaulle, however, refused to send Anne to live with, as he would say, “strangers.” In de Gaulle’s words, “God has given her to us. We must take responsibility for her, wherever she is and whatever she will be.” In a way, de Gaulle’s reaction to Anne’s entry into his life foreshadowed the spirit of resistance expressed in his famous appeal of 18 June 1940 to Frenchmen to continue the war against Germany.\n\nThe de Gaulles worked hard to build a place for, to use de Gaulle’s expression, “a child who is not like the others” in their family. From all accounts, Yvonne de Gaulle adopted a matter-of-fact approach. She focused on the practicalities of caring for a disabled child. Charles de Gaulle’s contribution was to envelop Anne in a web of affection. According to his son, de Gaulle wanted to give Anne the assurance that he loved her just as much as her older brother and sister—that her disability meant nothing to him.\n\nThe tall army officer infamous for his air of haughty disdain as leader of Free France during World War II and later as French President didn’t hesitate to unbend to play on the floor with Anne. De Gaulle sang to Anne, told her stories, and even allowed her to play with one of his most treasured possessions: his officer’s kepi hat. De Gaulle also said prayers with Anne in the evening. Painstakingly, she would repeat each word after her father. “You see,” de Gaulle proudly informed his relatives, “she knows her prayers!”\n\nWhen away on army business, de Gaulle constantly inquired about Anne’s well-being. On one occasion, Anne had an operation while he was absent on maneuvers. De Gaulle telephoned incessantly to ask if she was in pain, whether the procedure had succeeded, what the doctors were saying, etc. Anne seems to have been aware of just how much she meant to her father. Her first governess recalled that Anne adored him and would be visibly upset when his responsibilities took de Gaulle away from his family.\n\nThough the de Gaulles valued their privacy, they didn’t view Anne as an embarrassment. There are pictures of her standing awkwardly with members of the de Gaulles’ extended family. Most striking, however, is a photo of Anne taken at a beach in Brittany in 1933. She is sitting on her father’s lap. He, dressed in a homburg hat and three-piece suit, gently holds her hands as the five year-old girl looks intensely into her father’s eyes. It’s an image of unconditional love.\n\nWhile Anne lived, the de Gaulles took her everywhere with them. That included less-than-hospitable locations such as the French mandate in Syria and Lebanon. De Gaulle was posted there in 1929, partly because some of his superiors wanted to sideline an officer who asked awkward questions about France’s readiness for the next war. There was, however, no question of leaving Anne behind. Instead she went with them, with the de Gaulles hiring a full-time governess to help them care for Anne in a Middle-Eastern country.\n\nFragility—and Resistance—in the face of Evil\n\nThere was, of course, a cost to all this. Though Charles de Gaulle came from a minor aristocratic family and his wife from an upper-middle class background, the de Gaulles were not wealthy. His modest army pay was their main source of income. Hiring full-time help was subsequently an enormous financial liability, but one they didn’t hesitate to assume.\n\nThen there was the psychological burden. As Yvonne de Gaulle’s biographer Frédérique Neau-Dufour observes, Yvonne was an exuberant, even care-free young woman before Anne was born. After Anne’s birth, that woman gradually disappeared. Yvonne became a much quieter, even somewhat withdrawn person who dreaded public appearances. This, however, didn’t stop her from undertaking the extremely difficult task of successfully fleeing France with the profoundly disabled Anne in tow as the German Army swept across the country in May and June 1940.\n\nThis brings into focus another factor of which Charles de Gaulle was undoubtedly aware: how the National Socialist regime treated the disabled. Eugenics was part and parcel of the Nazi view of the world (and most Western liberal opinion for decades). And, as the Nazis made clear right from the beginning, the disabled had no place in a National Socialist world. They were lebensunwertes leben (life unworthy of life).\n\nStarting in September 1939, the Nazi government began removing Down Syndrome children and infants suffering from other disabilities from their parents. These children were taken to “health facilities” and killed by lethal injection or gas poisoning. In the name of “racial health” and other eugenics nonsense, the regime murdered thousands of disabled children. Among them was a 15 year-old Down Syndrome cousin of the future pope, Joseph Ratzinger.\n\nThis would have been Anne de Gaulle’s fate if she had ever fallen into Nazi hands. Although de Gaulle never referenced it specifically, it’s likely that the brutal treatment of the disabled was one of the things he had in mind when referring to the evil of the Nazi regime. When de Gaulle refused to surrender in 1940 and was branded a traitor by France’s political and military elites, it was certainly the act of an intensely patriotic man unwilling to accept his country’s abasement by the Nazis. But de Gaulle’s act of resistance also concerned safeguarding his defenseless daughter from those who viewed her as sub-human.\n\nLife after Death\n\nLike many Down Syndrome children, Anne de Gaulle died at an early age. Her brother Philippe recollects arriving at his parents’ house in 1948 to find the entire residence immersed in silence. Noone, he writes, dared to say anything to his grief-stricken father. Anne was subsequently buried in the cemetery at the de Gaulles’ parish church in Colombey-les-Deux-Églises. After attending their regular Sunday Mass and always on the anniversary of her death, Charles and Yvonne de Gaulle would visit Anne’s grave. 22 years after she died, her father was laid to rest beside Anne. Her mother joined them in 1979.\n\nThat, however, wasn’t the end of the story. Back in October 1945, the de Gaulles raised enough money from private donors to buy the chateau de Vert-Cœur in the department of Yvelines, not far from Paris. They then began creating a home for intellectually disabled girls. A few months after Anne’s death, the Fondation Anne-de-Gaulle opened its doors at the chateau. Staffed by nuns, funded by the considerable royalties generated by de Gaulle’s memoirs, and presided over by Yvonne de Gaulle until her death, the Foundation continues to serve the disabled today.\n\nOne of Charles de Gaulle’s biographers, the late Jean Lacouture, records him as once saying, “Without Anne, I could never perhaps have done what I did. She gave me the heart and the inspiration.” In that sense, the man of June 18 and his beloved pauvre petiteAnne teach us something which we are tempted to forget—that all of us can find strength in weakness and that nothing is more powerful than self-giving love."}, {"url": "https://www.nytimes.com/1970/11/13/archives/de-gaulle-is-buried-with-quiet-simplicity-de-gaulle-buried-in.html", "page_content": "By early afternoon tense of thousands had arrived by car, train and bus, They were of all ages and came from all parts of France. Many of the older ones wore medals and ribbons; among them were a busload of Algerian veterans of World War II.\n\nIt had been a brilliant fall day, but now clouds appeared and a chilly breeze whipped the flags in the square before the little Church of Notre Dame. Lining it were 200 men representing the army, the navy, the air force and St. Cyr, the military academy whose most illustrious cadet was de Gaulle.\n\nAs the bells tolled briefly, the Rev. François de Gaulle, a nephew, presided, in the in timacy of the family at La Boisserie, over the rite of raising the body.\n\nThe gates opened at 2:50 P.M. and a squat, crablike armored‐reconnaissance vehi cle rolled slowly down the leaf‐carpeted driveway. Its right fender bore the number 13. The turret had been re moved and the white oak coffin was in its place, cov ered with the tricolor.\n\nThe six‐wheeled vehicle turned left down the Rue du Général de Gaulle, a country road lined with stone farm houses and barns, from which a cock's crow and the stamp of cattle could occasionally be heard."}, {"url": "https://www.nytimes.com/1979/11/09/archives/yvonne-de-gaulle-widow-of-french-leader-dead-undergoes-operation.html", "page_content": "Mrs. de Gaulle was operated on last July 6 for an intestinal obstruction. It was said at the time that she had suffered so long before disclosing her illness that she had little hope for survival. On Aug. 24, she left the hospital against the advice of her doctors after a photographer, disuised as a nurse, sneaked into her room one nignt ana LOOK pictures of ner in nea.\n\nYvonne Charlotte Anne‐Marie de Gaulle was born in Calais on May 22, 1900, the daughter of Jacques and Marguerite Vendroux. Her father was an industrialist. She first met Charles de Gaulle when he was a young officer, just after World War I. After their second meeting, at ball given at St.‐Cyr, the famous military school, she was said to have remarked, “It will be him or no one.” Four months later, on April 6, 1921, they were married.\n\nWhile she was known for her modesty and retiring nature, Yvonne de Gaulle could show courage too.\n\nA car in which she and her husband were riding in 1962 was ambushed near - Paris and the pair narrowly escaped death in a hail of machine‐gun fire. The bullet‐riddled car, its tires flattened, escaped. When Mrs. de Gaulle was assisted from the car by the police, her first words were, “How are my chickens?” She had bought some chickens in jelly at Fauchon's, the famous Paris food store, that morning and they were in the trunk of the car.\n\nEnjoying the Joke\n\nThe de Gaulles were not unaware of the mild humor they provoked and enjoyed some of the stories themselves. In one, Mrs. de Gaulle enters a room where her husband is waiting. She trips on the rug and involuntarily mutters “Mon Dieu!” He replies: “How many times must I remind you? It is quite sufficient to say `Mon general.’ “\n\nPresident de Gaulle's feelings for his wife were expressed in the dedication of his memoirs. “To Yvonne,” he wrote, “without whom I could have done nothing.”"}, {"url": "https://www.who.int/news-room/fact-sheets/detail/meningitis", "page_content": "Overview\n\nMeningitis is the inflammation of the tissues surrounding the brain and spinal cord. It is usually caused by infection. It can be fatal and requires immediate medical care.\n\nMeningitis can be caused by several species of bacteria, viruses, fungi and parasites. Most infections can be transmitted from person to person. Injuries, cancers and drugs cause a small number of cases.\n\nBacterial meningitis is the most common dangerous type of meningitis and can be fatal within 24 hours.\n\nMeningitis can affect people of any age.\n\nThere are effective treatments and vaccines against some of the main bacterial causes of meningitis. However, meningitis remains a significant threat around the world.\n\nThere are four main causes of acute bacterial meningitis:\n\nNeisseria meningitidis (meningococcus)\n\nStreptococcus pneumoniae (pneumococcus)\n\nHaemophilus influenzae\n\nStreptococcus agalactiae (group B streptococcus)\n\nThese bacteria are responsible for more than half of the deaths from meningitis globally and they cause other severe diseases like sepsis and pneumonia.\n\nOther bacteria e.g., Mycobacterium tuberculosis, Salmonella, Listeria, Streptococcus and Staphylococcus, viruses such as enteroviruses and mumps, fungi, especially Cryptococcus, and parasites like Amoeba are also important causes of meningitis.\n\nWho is at risk?\n\nAlthough meningitis affects all ages, young children are most at risk. Newborn babies are at most risk from Group B streptococcus, young children are at higher risk from meningococcus, pneumococcus and Haemophilus influenzae. Adolescents and young adults are at particular risk of meningococcal disease while the elderly are at particular risk of pneumococcal disease.\n\nPeople all over the world are at risk of meningitis. The highest burden of disease is seen in a region of sub-Saharan Africa, known as the African Meningitis Belt, especially recognised to be at high risk of epidemics of meningococcal but also pneumococcal meningitis.\n\nHigher risk is seen when people are living in close proximity, for example at mass gatherings, in refugee camps, in overcrowded households or in student, military and other occupational settings. Immune deficiencies such as HIV infection or complement deficiency, immunosuppression, and active or passive smoking can also raise the risk of different types of meningitis.\n\nTransmission\n\nThe route of transmission varies by organism. Most bacteria that cause meningitis such as meningococcus, pneumococcus and Haemophilus influenzae are carried in the human nose and throat. They spread from person to person by respiratory droplets or throat secretions. Group B streptococcus is often carried in the human gut or vagina and can spread from mother to child around the time of birth.\n\nCarriage of these organisms is usually harmless and helps build up immunity against infection, but the bacteria occasionally invade the body causing meningitis and sepsis.\n\nSigns and symptoms\n\nClinical features of patients with meningitis vary depending on the cause, disease course (acute, subacute or chronic), brain involvement (meningo-encephalitis) and systemic complications (e.g., sepsis).\n\n\n\nCommon symptoms of meningitis are neck stiffness, fever, confusion or altered mental status, headaches, nausea and vomiting.\n\n\n\nLess frequent symptoms are seizures, coma and neurological deficits (for example hearing or vision loss, cognitive impairment, or weakness of the limbs).\n\nTypes of meningitis caused by viruses or bacteria can have similar symptoms. Symptoms may be stronger in some types of meningitis than in others and require different treatment.\n\nBacterial meningitis pathogens can cause other symptoms as a result of bloodstream infections (septicaemia), which can quickly lead to sepsis, including:\n\ncold hands and feet\n\njoint and muscle pains\n\nbreathing faster than usual\n\ndiarrhoea\n\ndark purple or red rash.\n\nBabies sometimes have different symptoms than adults:\n\nbeing less active and difficult to wake\n\nbeing irritable or inconsolable\n\npoor feeding\n\nstiff or floppy body\n\nswelling in the soft spot in their head (fontanelle).\n\nComplications and sequelae\n\nOne in 5 people surviving an episode of bacterial meningitis may have long lasting after-effects. These after-effects include hearing loss, seizures, limb weakness, difficulties with vision, speech, language, memory, and communication, as well as scarring and limb amputations after sepsis.\n\nPrevention\n\nVaccines offer the best protection against common types of bacterial meningitis.\n\nVaccines can prevent meningitis caused by:\n\nmeningococcus\n\npneumococcus\n\nhaemophilus influenzae type b (Hib).\n\nBacterial and viral meningitis can spread from person to person. If you live with someone who has either type of meningitis, you should:\n\nTalk to your doctor or nurse about taking antibiotics (in case of bacterial meningitis)\n\nWash hands frequently, especially before eating\n\nAvoid close contact and sharing cups, utensils or toothbrushes.\n\nLicensed vaccines against meningococcal, pneumococcal and Haemophilus influenzae disease have been available for many years. These bacteria have several different strains (known as serotypes or serogroups) and vaccines are designed to protect against the most harmful strains. No universal vaccine exists.\n\nIn the African meningitis belt, meningococcus serogroup A accounted for 80–85% of meningitis epidemics before the introduction of a meningococcal A conjugate vaccine through mass preventive campaigns (since 2010) and into routine immunization programmes (since 2016). Continuing introduction into routine immunization programmes and maintaining high coverage is critical to avoid the resurgence of epidemics.\n\n2. Antibiotics for prevention (chemoprophylaxis)\n\nAntibiotics for close contacts of those with meningococcal disease, when given promptly, decreases the risk of transmission. Outside the African meningitis belt, chemoprophylaxis is recommended for close contacts within the household. Within the meningitis belt, chemoprophylaxis for close contacts is recommended in non-epidemic situations. Ciprofloxacin is the antibiotic of choice, and ceftriaxone an alternative.\n\nIdentifying mothers whose babies are at risk of getting Group B streptococcal disease is recommended in many countries. Mothers at risk are offered intravenous penicillin during labour to prevent their babies developing Group B streptococcal infection.\n\nDiagnosis\n\nInitial diagnosis of meningitis can be made by clinical examination followed by a lumbar puncture. The bacteria can sometimes be seen in microscopic examinations of the spinal fluid. The diagnosis is supported or confirmed by growing the bacteria from specimens of cerebrospinal fluid or blood, by rapid diagnostic tests or by polymerase chain reaction (PCR). The identification of the serogroups and susceptibility to antibiotics are important to define control measures. Molecular typing and whole genome sequencing identify more differences between strains and inform public health responses.\n\nTreatment\n\nMeningitis is a medical emergency.\n\nMeningitis is potentially fatal within 24 hours and requires urgent medical attention. It usually cannot be safely cared for at home.\n\nMeningitis caused by viruses or bacteria can have similar symptoms. Meningitis can vary in severity, appropriate treatment and care depending on the cause. Meningitis caused by bacteria requires immediate antibiotic treatment.\n\nAny person who shows signs or symptoms or meningitis should seek immediate care at a hospital or health centre. This will verify if a person has meningitis, confirm the cause of infection and determine the right treatment and care.\n\nMeningitis sequelae can have an enormous impact on individuals, families and communities, both financially and emotionally. Sometimes, complications such as deafness, learning impairment or behavioural problems are not recognized by carers and healthcare workers and therefore go untreated.\n\nThose who have lived through meningitis often have health-care needs requiring long-term medical treatments. The ongoing psychosocial impacts of disability from meningitis can have medical, educational, social and human rights-based implications. Despite the high burden of meningitis sequelae on people with meningitis, their families and the community, access to both services and support for these conditions is often insufficient, especially in low- and middle-income countries. Individuals and families with members disabled by meningitis should be encouraged to seek services and guidance from local and national Organizations of Disabled People (ODPs) and other disability focused organizations, which can provide vital advice about legal rights, economic opportunities and social engagement to ensure people disabled by meningitis are able to live full and rewarding lives.\n\nSurveillance\n\nSurveillance, from case detection to investigation and laboratory confirmation is essential to the control of meningitis. Main objectives include:\n\ndetect and confirm outbreaks;\n\nmonitor the incidence trends, including the distribution and evolution of serogroups and serotypes;\n\nestimate the disease burden;\n\nmonitor the antibiotic resistance profile;\n\nmonitor the circulation, distribution, and evolution of specific strains (clones); and\n\nestimate the impact of meningitis control strategies, particularly preventive vaccination programmes.\n\nWHO response\n\nThe global roadmap Defeating Meningitis by 2030 was developed by WHO with the support of many partners. The strategy was approved in the first ever resolution on meningitis by the World Health Assembly in 2020 and endorsed unanimously by WHO member states.\n\nThe roadmap sets a comprehensive vision “Towards a world free of meningitis” and has 3 visionary goals:\n\nelimination of bacterial meningitis epidemics;\n\nreduction of cases of vaccine-preventable bacterial meningitis by 50% and deaths by 70%; and\n\nreduction of disability and improvement of quality of life after meningitis due to any cause.\n\nWHO is working on the Intersectoral global action plan on epilepsy and other neurological disorders in consultation with Member States to address many challenges and gaps in providing care and services for people with epilepsy and other neurological disorders that exist worldwide."}, {"url": "https://www.mayoclinic.org/diseases-conditions/meningitis/symptoms-causes/syc-20350508", "page_content": "Overview\n\nMeningitis is an infection and inflammation of the fluid and membranes surrounding the brain and spinal cord. These membranes are called meninges.\n\nThe inflammation from meningitis typically triggers symptoms such as headache, fever and a stiff neck.\n\nMost cases of meningitis in the United States are caused by a viral infection. But bacteria, parasites and fungi also can cause it. Some cases of meningitis improve without treatment in a few weeks. Others can cause death and require emergency antibiotic treatment.\n\nSeek immediate medical care if you suspect that you or someone in your family has meningitis. Early treatment of bacterial meningitis can prevent serious complications.\n\nSymptoms\n\nEarly meningitis symptoms may be similar to the flu. Symptoms may develop over several hours or over a few days.\n\nPossible symptoms in anyone older than the age of 2 years include:\n\nSudden high fever.\n\nStiff neck.\n\nSevere headache.\n\nNausea or vomiting.\n\nConfusion or trouble concentrating.\n\nSeizures.\n\nSleepiness or trouble waking.\n\nSensitivity to light.\n\nNo appetite or thirst.\n\nSkin rash in some cases, such as in meningococcal meningitis.\n\nSigns in newborns\n\nNewborns and infants may show these signs:\n\nHigh fever.\n\nConstant crying.\n\nBeing very sleepy or irritable.\n\nTrouble waking from sleep.\n\nBeing inactive or sluggish.\n\nNot waking to eat.\n\nPoor feeding.\n\nVomiting.\n\nA bulge in the soft spot on top of the baby's head.\n\nStiffness in the body and neck.\n\nInfants with meningitis may be hard to comfort. They may even cry harder when held.\n\nWhen to see a doctor\n\nSeek immediate medical care if you or someone in your family has meningitis symptoms, such as:\n\nFever.\n\nSevere headache that doesn't go away.\n\nConfusion.\n\nVomiting.\n\nStiff neck.\n\nBacterial meningitis is serious and can cause death within days without prompt antibiotic treatment. Delayed treatment also increases the risk of permanent brain damage.\n\nIt's also important to talk to your health care provider if you've been exposed to someone with meningitis. That may include a family member or someone you live or work with. You may need to take medicines to prevent getting an infection.\n\nThere is a problem with information submitted for this request. Review/update the information highlighted below and resubmit the form. From Mayo Clinic to your inbox Sign up for free and stay up to date on research advancements, health tips, current health topics, and expertise on managing health. Click here for an email preview. Email ErrorEmail field is required ErrorInclude a valid email address Learn more about Mayo Clinic’s use of data. To provide you with the most relevant and helpful information, and understand which information is beneficial, we may combine your email and website usage information with other information we have about you. If you are a Mayo Clinic patient, this could include protected health information. If we combine this information with your protected health information, we will treat all of that information as protected health information and will only use or disclose that information as set forth in our notice of privacy practices. You may opt-out of email communications at any time by clicking on the unsubscribe link in the e-mail. Subscribe! Thank you for subscribing! You'll soon start receiving the latest Mayo Clinic health information you requested in your inbox. Sorry something went wrong with your subscription Please, try again in a couple of minutes Retry\n\nCauses\n\nMeningitis Enlarge image Close Meningitis Meningitis Meningitis is an infection and inflammation of the fluid and three membranes (meninges) protecting the brain and spinal cord. The tough outer membrane is called the dura mater, and the delicate inner layer is the pia mater.\n\nViral infections are the most common cause of meningitis. That's followed by bacterial infections and, rarely, fungal and parasitic infections. Because bacterial infections can lead to death, learning the cause is essential.\n\nBacterial meningitis\n\nBacteria that enter the bloodstream and travel to the brain and spinal cord cause bacterial meningitis. But bacterial meningitis also can occur when bacteria directly invade the meninges. This may be caused by an ear or sinus infection, a skull fracture, or — rarely — some surgeries.\n\nSeveral strains of bacteria can cause bacterial meningitis, most commonly:\n\nStreptococcus pneumoniae. This bacterium is the most common cause of bacterial meningitis in infants, young children and adults in the United States. It more commonly causes pneumonia or ear or sinus infections. A vaccine can help prevent this infection.\n\nThis bacterium is the most common cause of bacterial meningitis in infants, young children and adults in the United States. It more commonly causes pneumonia or ear or sinus infections. A vaccine can help prevent this infection. Neisseria meningitidis. This bacterium causes a bacterial meningitis called meningococcal meningitis. These bacteria commonly cause an upper respiratory infection but can cause meningococcal meningitis when they enter the bloodstream. This is a highly contagious infection that affects mainly teenagers and young adults. It may cause local epidemics in college dormitories, boarding schools and military bases. A vaccine can help prevent infection. Even if vaccinated, anybody who has been in close contact with a person with meningococcal meningitis should receive an oral antibiotic to prevent the disease.\n\nHaemophilus influenzae. Haemophilus influenzae type b (Hib) bacterium was once the leading cause of bacterial meningitis in children. But new Hib vaccines have greatly reduced the number of cases of this type of meningitis.\n\nHaemophilus influenzae type b (Hib) bacterium was once the leading cause of bacterial meningitis in children. But new vaccines have greatly reduced the number of cases of this type of meningitis. Listeria monocytogenes. These bacteria can be found in unpasteurized cheeses, hot dogs and lunchmeats. People who are pregnant, newborns, older adults and people with weakened immune systems are most susceptible. During pregnancy, listeria can cross the placenta. Infections in late pregnancy may be fatal to the baby.\n\nViral meningitis\n\nViral meningitis is usually mild and often clears on its own. Most cases in the United States are caused by a group of viruses known as enteroviruses. They're most common in late summer and early fall. Viruses such as herpes simplex virus, HIV , mumps virus, West Nile virus and others also can cause viral meningitis.\n\nChronic meningitis\n\nChronic meningitis — one that's long-lasting — can be caused by slow-growing organisms such as fungi and Mycobacterium tuberculosis. They invade the membranes and fluid surrounding the brain. Chronic meningitis develops over two weeks or more. Symptoms are similar to acute meningitis, which is a sudden, new case. They include headache, fever, vomiting and mental cloudiness.\n\nFungal meningitis\n\nFungal meningitis isn't common in the United States. It may mimic acute bacterial meningitis. It's often contracted by breathing in fungal spores that may be found in soil, decaying wood and bird droppings.\n\nFungal meningitis isn't spread from person to person. Cryptococcal meningitis is a common fungal form of the disease. It affects people with weakened immune systems, such as from AIDS . It can cause death if not treated with an antifungal medicine. Even with treatment, fungal meningitis may come back.\n\nParasitic meningitis\n\nParasites can cause a rare type of meningitis called eosinophilic meningitis. Parasitic meningitis also can be caused by a tapeworm infection in the brain or cerebral malaria. Amoebic meningitis is a rare type that is sometimes contracted through swimming in fresh water and can quickly become life-threatening.\n\nThe main parasites that cause meningitis typically infect animals. People are usually infected by eating foods contaminated with these parasites. Parasitic meningitis isn't spread between people.\n\nOther meningitis causes\n\nMeningitis also can result from noninfectious causes. They include chemical reactions, drug allergies, some types of cancer and inflammatory diseases such as sarcoidosis.\n\nRisk factors\n\nRisk factors for meningitis include:\n\nSkipping vaccinations. Risk rises for anyone who hasn't completed the recommended childhood or adult vaccination schedule.\n\nRisk rises for anyone who hasn't completed the recommended childhood or adult vaccination schedule. Age. Most cases of viral meningitis occur in children younger than age 5 years. Bacterial meningitis is common in those under age 20.\n\nMost cases of viral meningitis occur in children younger than age 5 years. Bacterial meningitis is common in those under age 20. Living in a community setting. College students living in dormitories, personnel on military bases, and children in boarding schools and child care facilities are at greater risk of meningococcal meningitis. This is probably because the bacterium is spread through the respiratory route, and spreads quickly through large groups.\n\nCollege students living in dormitories, personnel on military bases, and children in boarding schools and child care facilities are at greater risk of meningococcal meningitis. This is probably because the bacterium is spread through the respiratory route, and spreads quickly through large groups. Pregnancy. Pregnancy increases the risk of an infection caused by listeria bacteria, which also may cause meningitis. The infection increases the risk of miscarriage, stillbirth and premature delivery.\n\nPregnancy increases the risk of an infection caused by listeria bacteria, which also may cause meningitis. The infection increases the risk of miscarriage, stillbirth and premature delivery. Weakened immune system. AIDS , alcohol use disorder, diabetes, use of immunosuppressant drugs and other factors that affect your immune system increase the risk of meningitis. Having a spleen removed also increases risk. People without a spleen should get vaccinated to lower the risk.\n\nComplications\n\nMeningitis complications can be severe. The longer you or your child has the disease without treatment, the greater the risk of seizures and permanent neurological damage, including:\n\nHearing loss.\n\nMemory problems.\n\nLearning disabilities.\n\nBrain damage.\n\nTrouble walking.\n\nSeizures.\n\nKidney failure.\n\nShock.\n\nDeath.\n\nWith prompt treatment, even people with severe meningitis can have good recovery.\n\nPrevention\n\nCommon bacteria or viruses that can cause meningitis can spread through coughing, sneezing, kissing, or sharing eating utensils, a toothbrush or a cigarette.\n\nThese steps can help prevent meningitis:\n\nWash your hands. Careful hand-washing helps prevent the spread of germs. Teach children to wash their hands often, especially before eating and after using the toilet, spending time in a crowded public place or petting animals. Show them how to thoroughly wash and rinse their hands.\n\nCareful hand-washing helps prevent the spread of germs. Teach children to wash their hands often, especially before eating and after using the toilet, spending time in a crowded public place or petting animals. Show them how to thoroughly wash and rinse their hands. Practice good hygiene. Don't share drinks, foods, straws, eating utensils, lip balms or toothbrushes with anyone else. Teach children and teens to avoid sharing these items too.\n\nDon't share drinks, foods, straws, eating utensils, lip balms or toothbrushes with anyone else. Teach children and teens to avoid sharing these items too. Stay healthy. Maintain your immune system by getting enough rest, exercising regularly, and eating a healthy diet with plenty of fresh fruits, vegetables and whole grains.\n\nMaintain your immune system by getting enough rest, exercising regularly, and eating a healthy diet with plenty of fresh fruits, vegetables and whole grains. Cover your mouth. When you need to cough or sneeze, be sure to cover your mouth and nose.\n\nWhen you need to cough or sneeze, be sure to cover your mouth and nose. If you're pregnant, take care with food. Reduce your risk of a listeria infection by cooking meat, including hot dogs and deli meat, to 165 degrees Fahrenheit (74 degrees Celsius). Avoid cheeses made from unpasteurized milk. Choose cheeses that are clearly labeled as being made with pasteurized milk.\n\nVaccinations\n\nSome forms of bacterial meningitis are preventable with the following vaccinations:"}, {"url": "https://www.france24.com/en/france/20201109-france-celebrates-de-gaulle-s-deep-legacy-on-50th-anniversary-of-his-death", "page_content": "Fifty years ago Charles de Gaulle, France's greatest leader since Napoleon, died suddenly in his armchair at the humble home where he had retired to live the quiet life he had always craved.\n\nFrench military jets fly over the memorial to former president Charles de Gaulle in the village of Colombey-les-deux-Eglises where he is buried\n\nAdvertising Read more\n\nFrench President Emmanuel Macron made the well-worn pilgrimage to the northeastern village of Colombey-les-Deux-Eglises on Monday to pay tribute to the man credited with restoring pride to France after the catastrophe of World War II.\n\n\"Will and resilience were what Charles de Gaulle was about,\" Macron tweeted afterwards after paying silent homage at his graveside.\n\n\"And that spirit has left a heritage -- France,\" he added.\n\nEven a half century on, France's fascination with the general -- known as \"the giraffe\" for his towering frame -- shows no sign of abating.\n\nThe country has lapped up a new film and television series charting his stubborn resistance to the Nazis in World War II -- as well as to his allies, the US and Britain -- often against the greatest of odds.\n\nChurchill's frenemy\n\nBritain's wartime prime minister Winston Churchill, who helped de Gaulle set himself up as leader of the Free French, once joked that he constantly had to remind the French general that the enemy was Germany.\n\n\"If he would follow his own inclination, it would be England,\" said Churchill.\n\nBut even Churchill had no doubt that de Gaulle -- whose warrior Irish ancestor Owen McCartan had been hung, drawn and quartered by the English -- was a \"great man\".\n\nNo less than 20 new biographies and studies of de Gaulle's personality have also been published in the run-up to the anniversary.\n\nSome have focused on the sensitive side of the military and political colossus -- he would spend hours playing and singing with his youngest daughter Anne, who suffered from Down's Syndrome.\n\nThis is contrasted with his ruthlessness in steering France out of the bloodbath of the Algerian war of independence and his ability to survive street protests against him in May 1968.\n\n'France is a widow'\n\nIt was at around 7:00 pm on November 9, 1970, at his home in Colombey-les-Deux-Eglises, de Gaulle complained to his wife Yvonne of a painful back.\n\nHe had been writing his memoirs, which he would never complete.\n\nHead in his hands, he collapsed in his armchair. Suffering an abdominal aneurysm, the great statesman was dead.\n\nOnly 18 months earlier he had resigned as president, having served as head of state for a second time from 1958 to 1969, after losing a referendum.\n\nHis death was kept secret all night. Only his children were told.\n\nHis successor, President Georges Pompidou, was told at 7:20 am the next morning.\n\nThere was no official announcement. At 9:41 am, AFP broke the news with a brief line: \"De Gaulle is dead.\"\n\nIn the streets, in offices -- the news spread like wildfire. Around the world, messages of condolence flooded in.\n\n\"France is a widow\", Pompidou said at midday in a televised address to the nation.\n\nSolemn farewell\n\nDe Gaulle's funeral took place on November 12 at Colombey-les-Deux-Eglises. In the crowd, following his wishes, there were no heads of state nor government ministers, just ordinary citizens.\n\nThe funeral procession, trailed by the family, made its way slowly to the village church where de Gaulle had attended Sunday Mass days earlier. A silent crowd watched.\n\nThe coffin was carried by 12 volunteers into the cemetery adjoining the church, where it was buried next to his daughter Anne, who had died aged 20.\n\nA simple engraving marks the white marble of his tombstone: \"Charles de Gaulle 1890-1970.\"\n\n(AFP)\n\nDaily newsletterReceive essential international news every morning Subscribe"}, {"url": "https://www.nytimes.com/1970/07/26/archives/de-gaulle-speaks-through-his-memoirs-of-hope-de-gaulle.html", "page_content": "12‐Year Gap\n\nIt took 12 years to cross it, period that General de Gaulle ap parently feels is not worth re cording, at least not in memoir form, since he had no power and little influence on events. Then another grave event, the upris ing in Algiers, which many of the general's friends helped cre ate, pushed the Fourth Republic over the brink and brought him back into office.\n\nThe first volume, to be pub lished by Plon, is expected to be out toward the end of the year. It will trace General de Gaulle's efforts to build a new reptiblic based on strong executive pow er, end the Algerian War and transform France's colonial rela tions in the rest of Africa. The title, “Memoirs of Hope,” is be lieved to express the general's conviction that what he did gave France hope of again playing her rightfully prominent role in the world.\n\nTo write the book, the general became almost a hermit. He would allow few visits or other interruptions, and those who did, have the opportunity to go to his country house in Colombey les‐deux‐Eglises reported that he was working with relentlessness, even fury, as if the most impor tant thing he could now do was to leave a political testament be hind him.\n\nDe Gaulle\n\nHe would take walks, listen to the radio, watch television and occasionally go for a drive. His wife Yvonne would be seen shop ping in the neighborhood for such things as pastry or breaded pig's feet, for General de Gaulle is a trencherman in a country of trenchermen and, even at the age of 79, his pen is no mightier than his fork.\n\nThe Government furnished the general with a four‐room suite of offices on the Left Bank, but he has never visited them, lest his sudden appearance in Paris after so much isolation be interpreted as a political act. His personal archives are stored there, and once a week documents would be taken to Colombey by an aide for use in preparing the memoirs."}, {"url": "https://www.theguardian.com/world/2020/mar/12/de-gaulle-assassination-plot-leader-executed-at-dawn-1963", "page_content": "Paris, March 10\n\nJean-Marie Bastien-Thiry, the leader of the conspiracy against President de Gaulle on August 22, was executed by a firing squad at 6 42 this morning at Fort d’Ivry, where military executions usually take place.\n\nThe sentences on the other two men who were condemned to death, Alain Bougrenet de la Tocnaye and Jacques Prevost have been commuted by President de Gaulle to life imprisonment.\n\nBastien-Thiry was roused a little before five this morning and told for the first time that his petition to the President to commute his sentence had been rejected, and that the execution was to take place at dawn. He asked about the fate of his two comrades and was told they were not to die.\n\nHe wanted to hear Mass before his execution and also made two new legal objections which he recorded in writing, first that he had again raised the question of the Council of State’s opinion of the legality of the court that judged him, and secondly, that M Bidault’s emergence from secrecy at last made it possible to question him. He had throughout the trial insisted that his orders had come to him from M Bidault’s Council of National Resistance, though he did not say by what route.\n\nHeavily guarded\n\nThe condemned man’s counsel, Maitre Tixier-Vignancour, Maitre Le Coroller and Maitre Dupuy, who were all present, did their best to press these hopeless arguments but after a short consultation, General Gerthoffer, the military prosecutor, insisted that the execution must go forward. This was accepted by Colonel Reboul, who was present to represent the Court – the presiding judge, General Gardy, was not.\n\nA portrait of lieutenant-colonel Jean-Marie Bastien-Thiry on 18 September, 1962. He led the attack at Petit-Clamart against General De Gaulle. Photograph: Gamma-Keystone via Getty Images\n\nAfter hearing Mass and taking communion, Bastien-Thiry was driven through the early morning rain under very strong escort to Ivry. He refused to have his eyes bandaged. He was buried immediately after the execution. His grave, in the part of a neighbouring cemetery reserved for the executed, is heavily guarded by the police today.\n\nThe execution of Bastien-Thiry only six days after he was sentenced has come as a shock to French opinion, accustomed to a much more deliberate pace of justice. In fact after the example of ex-General Jouhaud, whose death sentence was commuted months after the trial, every day’s delay would have been taken as strengthening the hypothesis that there would be no execution. “An inevitable sentence to be followed by inevitable acts of pardon” is the commonest comment on the way the trial had ended. M François Mauriac, one of the great supporters of the regime, had written: “The fact is that the death penalty has been abolished in the minds and hearts of modern Frenchmen.”\n\nThere was no disputing of the validity of the verdict, or question that the trial was essentially fair, whatever objections could be raised in theory to the nature of the Court. The plot was irrefutably established. Bullets had undoubtedly entered the car within a few inches of the President’s head. The court’s anxiety to let every extenuating factor be argued and testified as the days passed had seemed almost pathological, due, no doubt, to the fact that there was no appeal from the military tribunal’s judgment.\n\nThe President’s decision to let the sentence be carried out surprises first of all because, in spite of the OAS’s abominable record of murder, so few of its members have been executed – only three in fact, ex-Captain Degueldre, organiser of a killer commando, and two of his subordinates, deserters from the Foreign Legion.\n\nNot only did Salan save his head, thanks to his judges, but in the case of the only other attempt on the President’s life that actually got as far as action, the chief conspirator was let off with a 20-year sentence by the jury, though he had undoubtedly tried to blow up the Chief-of-State and his wife.\n\nThis lack of severity hitherto may well be one of the President’s principal reasons for severity now, especially after the discovery of yet another conspiracy to remove him by violence (the Ecole Militaire affair), and the still mysterious execution of the banker, M. Henri Lafond.\n\nGrim reminder\n\nThis last incident is the more sinister since the precise motive does not yet seem to have come to light. It is possible, too, that M. Bidault may have been a little too successful in his attempt to conceal the OAS under the more elegant and once so honourable title of the National Council of Resistance. The execution is certainly a grim reminder of the nature of OAS activity and what it leads to.\n\nBastien-Thiry was a man with a brilliant future, aged only 35. He was an engineer at the Air Ministry with the equivalent rank of lieutenant-colonel. He leaves a widow and three small daughters. His defence of his action was as much religious as political – to the considerable distress of the Catholic Church in France.\n\nHe claimed to have sought precedents in “both ancient and sacred history,” and was undoubtedly a man of great devotion. He does not appear to have joined the OAS until last year after the leadership passed into the hands of M Bidault. His speech in his own defence has already appeared as a pamphlet, and was indeed in his hands when the military prosecutor was asking for the death sentence on him."}]}