{"Despite her disability, Anne de Gaulle was a bright and determined young woman.": [{"url": "http://www.cmq.org.uk/CMQ/2022/Aug/Anne_de_Gaulle.html", "page_content": "Catholic Medical Quarterly Volume 72 (3) August 2022\n\nGeneral Charles De Gaulle and a very special person with Down’s Syndrome\n\nAnne de Gaulle was the youngest daughter of General Charles de Gaulle. She was born in 1928 in Trier, Germany, where her father was stationed with the Army of Occupation in the Rhineland. De Gaulle’s wife Yvonnne was struck by a car shortly before Anne’s birth. The doctors said that she was retarded and that she would probably never be able to speak. We hear in a biography of Richard Nixon [1] that “the de Gaulles were devastated.\" Madame De Gaulle wrote to a friend, “Charles and I would give any- thing, health, all our money, advancement, career if only Anne could be an ordinary little girl like the rest”. When someone suggested that they put her in a home, De Gaulle refused. “She did not ask to come into the world” he said, “We should do everything to make her happy”.\n\nAnne was born with Down’s Syndrome [2] and in a time where disabled children were routinely sent to institutions, she lived with her family until her death. There was one sacred rule in the de Gaulle household: Anne was never to be made to feel different or less than anyone else. Charles de Gaulle was a quiet man, noted for his reserve and even with family members. He was usually not very demonstrative. His grandson once said on Radio 4 that his father would never be seen in the morning until he was fully dressed in military uniform.\n\nBut with his daughter Anne this all changed. She generated in him a warmth that he had seemed to be storing for his entire life just for her. He would dance little jigs for with her, do pantomimes, sing popular songs to her. During her brief life, he was the only person who could make her laugh.\n\nOne of de Gaulle’s neighbours recalled how he used to walk with her hand-in-hand around the property, caressing her and talking quietly about the things she understood. She was, he said simply, \"My joy. She helped me overcome the failures in all men, and to look beyond them”.\n\nThe de Gaulles fiercely protected Anne from the press and others. Her father forbade photographers from including any of his children in publicity shots taken at him home during the war years. He knew that the presence or absence of Anne would be sure to elicit comment. Other children teased her because she was different. But her pain was compounded because she did not know why she was different.\n\nIn 1948, Anne died of pneumonia, a month after her 20th birthday and died in her father's arms. At the conclusion of the brief graveside service, de Gaulle took his wife’s hand and said “Come, now she is like the others.\"\n\nOn 22 August 1962, Charles de Gaulle was the victim of an attempted assassination at Petit-Clamart. He later said that the potentially fatal bullet had been stopped by the frame of the photograph of Anne that he always carried with him, placed this particular day on the rear shelf of his car. When he died in 1970, he was buried in the cemetery of Colombey-les-Deux-Églises beside his beloved daughter.\n\nAnne could only say one word clearly in her entire life: 'Papa'"}, {"url": "https://breakpoint.org/breakpoint-france-syndrome/", "page_content": "One of the great men of French history had a daughter with a disability. His faith saw him—and her—through.\n\nLate last year on BreakPoint, I told you about an extraordinary bit of censorship by the French government.\n\nWhat was censored was an ad featuring a smiling, happy child with Down syndrome. The ad, entitled “Dear Future Mom,” told potential mothers about the joy and love that these children can and will bring into their lives.\n\nSo, why was it banned? Because the French government believes that the ad is “likely to disturb the conscience of women” who had aborted their babies after learning that the child had Down syndrome.\n\nNow I’m going to tell you a story about a Frenchman who saw things very differently: Charles de Gaulle.\n\nYou probably weren’t expecting to hear that. To most Americans, de Gaulle was, as one writer put it, “an obnoxious, overly ambitious man who, in the grand French manner, strutted sitting down.”\n\nHe may have been some or all of these things, but there was a side of Charles de Gaulle that few people know about, and that side revolved around his love for his daughter, Anne.\n\nAnne was born on New Year’s Day, 1928, the third of Charles and Yvonne de Gaulle’s three children. In De Gaulle’s words, Anne was “un enfant pas comme les autres,” a child not like the other children.\n\nAs you’ve probably guessed, Anne had Down syndrome. Only it wasn’t called “Down syndrome” back then. The children were called “mongoloids,” and, as a recent story by Samuel Gregg of the Acton Institute in the Catholic World Report told readers, “it was common [back then] for French families to place disabled children permanently in hospitals that were woefully ill-equipped to care for them.”\n\nThat’s not something that de Gaulle and his family did. As de Gaulle put it, “God has given her to us. We must take responsibility for her, wherever she is and whatever she will be.” And so the family worked hard to make a place for Anne.\n\nWhile Yvonne worked on the logistics, Charles worked on the affection. You heard that right: the affection. Anne was the apple of his eye. As the article tells us, “The tall army officer infamous for his air of haughty disdain as leader of Free France during World War II and later as French President didn’t hesitate to unbend to play on the floor with Anne.”\n\nHe sang to her, read her stories, and taught her how to pray. Every night, Anne would “painstakingly . . . repeat each word after her father.” In turn, de Gaulle would proudly tell his relatives that “she knows her prayers!”\n\nAs Gregg tells readers, de Gaulle was well aware of how the Nazis treated children like Anne, and this, in turn, inspired his refusal to surrender to the Nazis. His “act of resistance” was a way of “safeguarding his defenseless daughter from those who viewed her as sub-human.” As he later said, “Without Anne, I could never perhaps have done what I did. She gave me the heart and the inspiration.”\n\nThe contrast between de Gaulle and his successors in the Elysée Palace is almost too painful to contemplate. He refused to surrender to the Nazis to protect children with Down syndrome. After Anne’s death, he and his wife established a foundation, staffed by nuns, to care for people “who are not like the others.”\n\nDe Gaulle was a complicated man—most great men are—but one of his complications was his Catholic faith that enabled him to love Anne. It was a love that, as Gregg put it, helped restore France’s honor, the same honor that was tarnished when, out of fear for hurting people’s feelings, it denied the humanity of the people de Gaulle worked tirelessly to save.\n\nTo read Samuel Gregg’s outstanding article, “A Father’s Love: The Story of Charles and Anne,” please come to BreakPoint.org, click on this commentary, and we’ll link you to it.\n\nFurther Reading and Information\n\nFrance and Down Syndrome: The French Government Should Learn from Charles DeGaulle\n\n\n\nRead the touching account of Charles de Gaulle and his great affection for his daughter Anne, born with Down syndrome. The article, written by Dr. Samuel Gregg, is linked below.\n\nFind a BreakPoint radio station in your area–Click here."}, {"url": "https://www.catholicworldreport.com/2017/04/26/a-fathers-love-the-story-of-charles-and-anne/", "page_content": "In World War II, Charles de Gaulle saved France’s honor from the shame of defeat. Few know, however, how much strength he drew from his Down Syndrome daughter.\n\nWhen it comes to failed governments in our time, it’s hard to ignore French President François Hollande’s administration. Hollande’s record on basic issues like unemployment as well as his ineptness in the face of jihadist terrorism is so unimpressive that he declined to run for reelection. This, however, hasn’t stopped his government from making the type of last-minute defiant gesture beloved of administrations whose days are numbered.\n\nIn Hollande’s case, it has taken the form of effectively banning pro-life websites that don’t explicitly identify themselves as pro-life. This follows a 2016 ruling by France’s Conseil d’État endorsing a broadcasting tribunal’s 2014 decision to prohibit a commercial portraying Down Syndrome children as joyful individuals loved by their parents because it might distress those who chose to terminate an unborn disabled child.\n\nReflecting upon these developments, I couldn’t help thinking how much France owes to one particular Down Syndrome child: a young girl who struggled to speak, needed assistance to walk, and who died of pneumonia at the age of 20 cradled in her father’s arms. Anne de Gaulle’s father, however, was no ordinary man.\n\nCharles de Gaulle was surely the twentieth century’s greatest Frenchman. Yet for all his achievements, the ultimate drama of de Gaulle’s life was his helpless daughter. What Anne gave to him, however, was immeasurable. As de Gaulle confided to a priest at the beginning of his lonely crusade in 1940 to save France’s honor, “for me, this child is a grace, she is my joy, she helps me to look beyond all the failures and honors, and always to look higher.”\n\nUn enfant pas comme les autres\n\nCharles de Gaulle was an austere individual, one who consciously cultivated distance from others. 47 years after his death, however, we know much more about the private man. Thanks to the publication of memoirs, especially those of his son Admiral Philippe de Gaulle, the General emerges as a man who, like many French army officers of his background, found solace in his Catholic faith and a closely-knit family. We’re also discovered that de Gaulle had a rich intellectual life which went far beyond politics. This went hand-in-hand with a wicked sense of humor which, in private, de Gaulle wasn’t averse to using against himself.\n\nBy the time he reached his mid-30s, de Gaulle had settled into a milieu in which his faith, family and profession provided many of the certainties required for an ambitious man intent upon shaking up a political and military establishment committed to obsolete ideas. All this was shattered on 1 January 1928 when Charles and Yvonne de Gaulle’s third child was born. Within a few months, it became apparent that Anne was severely disabled.\n\nIt’s important to remember that this was an era in which disabled children were neither seen nor heard in polite company. Down Syndrome children were referred to as “mongols.” Some even speculated that the condition resulted from alcoholism or some form of impropriety on the parents’ part. It wasn’t until 30 years after Anne de Gaulle’s birth that another devout French Catholic, Professor Jerome Lejeune, and his research team discovered that Down Syndrome was caused by an extra copy of chromosome 21.\n\nIn the 1930s, it was common for French families to place disabled children permanently in hospitals that were woefully ill-equipped to care them. Charles and Yvonne de Gaulle, however, refused to send Anne to live with, as he would say, “strangers.” In de Gaulle’s words, “God has given her to us. We must take responsibility for her, wherever she is and whatever she will be.” In a way, de Gaulle’s reaction to Anne’s entry into his life foreshadowed the spirit of resistance expressed in his famous appeal of 18 June 1940 to Frenchmen to continue the war against Germany.\n\nThe de Gaulles worked hard to build a place for, to use de Gaulle’s expression, “a child who is not like the others” in their family. From all accounts, Yvonne de Gaulle adopted a matter-of-fact approach. She focused on the practicalities of caring for a disabled child. Charles de Gaulle’s contribution was to envelop Anne in a web of affection. According to his son, de Gaulle wanted to give Anne the assurance that he loved her just as much as her older brother and sister—that her disability meant nothing to him.\n\nThe tall army officer infamous for his air of haughty disdain as leader of Free France during World War II and later as French President didn’t hesitate to unbend to play on the floor with Anne. De Gaulle sang to Anne, told her stories, and even allowed her to play with one of his most treasured possessions: his officer’s kepi hat. De Gaulle also said prayers with Anne in the evening. Painstakingly, she would repeat each word after her father. “You see,” de Gaulle proudly informed his relatives, “she knows her prayers!”\n\nWhen away on army business, de Gaulle constantly inquired about Anne’s well-being. On one occasion, Anne had an operation while he was absent on maneuvers. De Gaulle telephoned incessantly to ask if she was in pain, whether the procedure had succeeded, what the doctors were saying, etc. Anne seems to have been aware of just how much she meant to her father. Her first governess recalled that Anne adored him and would be visibly upset when his responsibilities took de Gaulle away from his family.\n\nThough the de Gaulles valued their privacy, they didn’t view Anne as an embarrassment. There are pictures of her standing awkwardly with members of the de Gaulles’ extended family. Most striking, however, is a photo of Anne taken at a beach in Brittany in 1933. She is sitting on her father’s lap. He, dressed in a homburg hat and three-piece suit, gently holds her hands as the five year-old girl looks intensely into her father’s eyes. It’s an image of unconditional love.\n\nWhile Anne lived, the de Gaulles took her everywhere with them. That included less-than-hospitable locations such as the French mandate in Syria and Lebanon. De Gaulle was posted there in 1929, partly because some of his superiors wanted to sideline an officer who asked awkward questions about France’s readiness for the next war. There was, however, no question of leaving Anne behind. Instead she went with them, with the de Gaulles hiring a full-time governess to help them care for Anne in a Middle-Eastern country.\n\nFragility—and Resistance—in the face of Evil\n\nThere was, of course, a cost to all this. Though Charles de Gaulle came from a minor aristocratic family and his wife from an upper-middle class background, the de Gaulles were not wealthy. His modest army pay was their main source of income. Hiring full-time help was subsequently an enormous financial liability, but one they didn’t hesitate to assume.\n\nThen there was the psychological burden. As Yvonne de Gaulle’s biographer Frédérique Neau-Dufour observes, Yvonne was an exuberant, even care-free young woman before Anne was born. After Anne’s birth, that woman gradually disappeared. Yvonne became a much quieter, even somewhat withdrawn person who dreaded public appearances. This, however, didn’t stop her from undertaking the extremely difficult task of successfully fleeing France with the profoundly disabled Anne in tow as the German Army swept across the country in May and June 1940.\n\nThis brings into focus another factor of which Charles de Gaulle was undoubtedly aware: how the National Socialist regime treated the disabled. Eugenics was part and parcel of the Nazi view of the world (and most Western liberal opinion for decades). And, as the Nazis made clear right from the beginning, the disabled had no place in a National Socialist world. They were lebensunwertes leben (life unworthy of life).\n\nStarting in September 1939, the Nazi government began removing Down Syndrome children and infants suffering from other disabilities from their parents. These children were taken to “health facilities” and killed by lethal injection or gas poisoning. In the name of “racial health” and other eugenics nonsense, the regime murdered thousands of disabled children. Among them was a 15 year-old Down Syndrome cousin of the future pope, Joseph Ratzinger.\n\nThis would have been Anne de Gaulle’s fate if she had ever fallen into Nazi hands. Although de Gaulle never referenced it specifically, it’s likely that the brutal treatment of the disabled was one of the things he had in mind when referring to the evil of the Nazi regime. When de Gaulle refused to surrender in 1940 and was branded a traitor by France’s political and military elites, it was certainly the act of an intensely patriotic man unwilling to accept his country’s abasement by the Nazis. But de Gaulle’s act of resistance also concerned safeguarding his defenseless daughter from those who viewed her as sub-human.\n\nLife after Death\n\nLike many Down Syndrome children, Anne de Gaulle died at an early age. Her brother Philippe recollects arriving at his parents’ house in 1948 to find the entire residence immersed in silence. Noone, he writes, dared to say anything to his grief-stricken father. Anne was subsequently buried in the cemetery at the de Gaulles’ parish church in Colombey-les-Deux-Églises. After attending their regular Sunday Mass and always on the anniversary of her death, Charles and Yvonne de Gaulle would visit Anne’s grave. 22 years after she died, her father was laid to rest beside Anne. Her mother joined them in 1979.\n\nThat, however, wasn’t the end of the story. Back in October 1945, the de Gaulles raised enough money from private donors to buy the chateau de Vert-Cœur in the department of Yvelines, not far from Paris. They then began creating a home for intellectually disabled girls. A few months after Anne’s death, the Fondation Anne-de-Gaulle opened its doors at the chateau. Staffed by nuns, funded by the considerable royalties generated by de Gaulle’s memoirs, and presided over by Yvonne de Gaulle until her death, the Foundation continues to serve the disabled today.\n\nOne of Charles de Gaulle’s biographers, the late Jean Lacouture, records him as once saying, “Without Anne, I could never perhaps have done what I did. She gave me the heart and the inspiration.” In that sense, the man of June 18 and his beloved pauvre petiteAnne teach us something which we are tempted to forget—that all of us can find strength in weakness and that nothing is more powerful than self-giving love."}, {"url": "https://www.nytimes.com/1970/11/11/archives/de-gaulle-rallied-france-in-war-and-strove-to-lead-her-to-greatness.html", "page_content": "“Your reply is going to determine the destiny of France,” an intense, solemn yet aged voice told the French people on April 25, 1969, “because if I am disa vowed by the majority of you, my present task as chief of state would obviously become impossible [and] would im mediately stop exercising my functions.”\n\nThat curiously aloof yet, paternal Voiae, which in 1940 had exhorted prostrate nation to rise from defeat and fight still against a merciless and omni present enemy, and which in the years after 1958 had rallied a country to grandeur and glory beyond her size and resources, had now lost the compelling eloquence that, less than a year earlier, had seemed invincible. Thus it was that two days after his appeal for confidence over a relatively minor, issue, Charles de Gaulle was repudiated by 53 per cent of the voters. And within 12 hours he departed the splendorous. Elysee Pal ace on the banks of the Seine in Paris; his residence for almost 11 years, for his plain home in the tiny village of Co lombey‐les‐Deux‐Eglises. More than the end of a singular political reign, it was the end of an era:\n\nThat era started virtually, unobserved on June 18, 1940, when an obscure tem porary brigadier general; having escaped to London from ‘a battered and disorganized France about to capitulate to Nazi Germany, exhorted his country men to continue in a war that he per ceived would evolve into a world con flict.\n\n“But has the last word been said?” the 49‐year‐old officer asked in his pun gent speech in a British Broadcasting Corporation studio. “Must we abandon all hope? Is our, defeat final and irre mediable? To those questions I answer— No!\n\nFor remember this, France is not alone. She is riot‐alone. She is not alone. Behind her a vast empire, and she can make common cause with the Brit ish. Empire, which commands the seas and is continuing the struggle.”"}, {"url": "https://catholiccitizens.org/views/71117/fathers-love-story-charles-anne/", "page_content": "By Dr. Samuel Gregg, April 26, 2017\n\nIn World War II, Charles de Gaulle saved France’s honor from the shame of defeat. Few know, however, how much strength he drew from his Down Syndrome daughter.\n\nWhen it comes to failed governments in our time, it’s hard to ignore French President François Hollande’s administration. Hollande’s record on basic issues like unemployment as well as his ineptness in the face of jihadist terrorism is so unimpressive that he declined to run for reelection. This, however, hasn’t stopped his government from making the type of last-minute defiant gesture beloved of administrations whose days are numbered.\n\nIn Hollande’s case, it has taken the form of effectively banning pro-life websites that don’t explicitly identify themselves as pro-life. This follows a 2016 ruling by France’s Conseil d’État endorsing a broadcasting tribunal’s 2014 decision to prohibit a commercial portraying Down Syndrome children as joyful individuals loved by their parents because it might distress those who chose to terminate an unborn disabled child.\n\nReflecting upon these developments, I couldn’t help thinking how much France owes to one particular Down Syndrome child: a young girl who struggled to speak, needed assistance to walk, and who died of pneumonia at the age of 20 cradled in her father’s arms. Anne de Gaulle’s father, however, was no ordinary man.\n\nCharles de Gaulle was surely the twentieth century’s greatest Frenchman. Yet for all his achievements, the ultimate drama of de Gaulle’s life was his helpless daughter. What Anne gave to him, however, was immeasurable. As de Gaulle confided to a priest at the beginning of his lonely crusade in 1940 to save France’s honor, “for me, this child is a grace, she is my joy, she helps me to look beyond all the failures and honors, and always to look higher.”\n\nUn enfant pas comme les autres\n\nCharles de Gaulle was an austere individual, one who consciously cultivated distance from others. 47 years after his death, however, we know much more about the private man. Thanks to the publication of memoirs, especially those of his son Admiral Philippe de Gaulle, the General emerges as a man who, like many French army officers of his background, found solace in his Catholic faith and a closely-knit family. We’re also discovered that de Gaulle had a rich intellectual life which went far beyond politics. This went hand-in-hand with a wicked sense of humor which, in private, de Gaulle wasn’t averse to using against himself.\n\nBy the time he reached his mid-30s, de Gaulle had settled into a milieu in which his faith, family and profession provided many of the certainties required for an ambitious man intent upon shaking up a political and military establishment committed to obsolete ideas. All this was shattered on 1 January 1928 when Charles and Yvonne de Gaulle’s third child was born. Within a few months, it became apparent that Anne was severely disabled.\n\nIt’s important to remember that this was an era in which disabled children were neither seen nor heard in polite company. Down Syndrome children were referred to as “mongols.” Some even speculated that the condition resulted from alcoholism or some form of impropriety on the parents’ part. It wasn’t until 30 years after Anne de Gaulle’s birth that another devout French Catholic, Professor Jerome Lejeune, and his research team discovered that Down Syndrome was caused by an extra copy of chromosome 21.\n\nIn the 1930s, it was common for French families to place disabled children permanently in hospitals that were woefully ill-equipped to care them. Charles and Yvonne de Gaulle, however, refused to send Anne to live with, as he would say, “strangers.” In de Gaulle’s words, “God has given her to us. We must take responsibility for her, wherever she is and whatever she will be.” In a way, de Gaulle’s reaction to Anne’s entry into his life foreshadowed the spirit of resistance expressed in his famous appeal of 18 June 1940 to Frenchmen to continue the war against Germany.\n\nThe de Gaulles worked hard to build a place for, to use de Gaulle’s expression, “a child who is not like the others” in their family. From all accounts, Yvonne de Gaulle adopted a matter-of-fact approach. She focused on the practicalities of caring for a disabled child. Charles de Gaulle’s contribution was to envelop Anne in a web of affection. According to his son, de Gaulle wanted to give Anne the assurance that he loved her just as much as her older brother and sister—that her disability meant nothing to him.\n\nThe tall army officer infamous for his air of haughty disdain as leader of Free France during World War II and later as French President didn’t hesitate to unbend to play on the floor with Anne. De Gaulle sang to Anne, told her stories, and even allowed her to play with one of his most treasured possessions: his officer’s kepi hat. De Gaulle also said prayers with Anne in the evening. Painstakingly, she would repeat each word after her father. “You see,” de Gaulle proudly informed his relatives, “she knows her prayers!”\n\nWhen away on army business, de Gaulle constantly inquired about Anne’s well-being. On one occasion, Anne had an operation while he was absent on maneuvers. De Gaulle telephoned incessantly to ask if she was in pain, whether the procedure had succeeded, what the doctors were saying, etc. Anne seems to have been aware of just how much she meant to her father. Her first governess recalled that Anne adored him and would be visibly upset when his responsibilities took de Gaulle away from his family.\n\nThough the de Gaulles valued their privacy, they didn’t view Anne as an embarrassment. There are pictures of her standing awkwardly with members of the de Gaulles’ extended family. Most striking, however, is a photo of Anne taken at a beach in Brittany in 1933. She is sitting on her father’s lap. He, dressed in a homburg hat and three-piece suit, gently holds her hands as the five year-old girl looks intensely into her father’s eyes. It’s an image of unconditional love.\n\nWhile Anne lived, the de Gaulles took her everywhere with them. That included less-than-hospitable locations such as the French mandate in Syria and Lebanon. De Gaulle was posted there in 1929, partly because some of his superiors wanted to sideline an officer who asked awkward questions about France’s readiness for the next war. There was, however, no question of leaving Anne behind. Instead she went with them, with the de Gaulles hiring a full-time governess to help them care for Anne in a Middle-Eastern country.\n\nFragility—and Resistance—in the face of Evil\n\nThere was, of course, a cost to all this. Though Charles de Gaulle came from a minor aristocratic family and his wife from an upper-middle class background, the de Gaulles were not wealthy. His modest army pay was their main source of income. Hiring full-time help was subsequently an enormous financial liability, but one they didn’t hesitate to assume.\n\nThen there was the psychological burden. As Yvonne de Gaulle’s biographer Frédérique Neau-Dufour observes, Yvonne was an exuberant, even care-free young woman before Anne was born. After Anne’s birth, that woman gradually disappeared. Yvonne became a much quieter, even somewhat withdrawn person who dreaded public appearances. This, however, didn’t stop her from undertaking the extremely difficult task of successfully fleeing France with the profoundly disabled Anne in tow as the German Army swept across the country in May and June 1940.\n\nThis brings into focus another factor of which Charles de Gaulle was undoubtedly aware: how the National Socialist regime treated the disabled. Eugenics was part and parcel of the Nazi view of the world (and most Western liberal opinion for decades). And, as the Nazis made clear right from the beginning, the disabled had no place in a National Socialist world. They were lebensunwertes leben (life unworthy of life).\n\nStarting in September 1939, the Nazi government began removing Down Syndrome children and infants suffering from other disabilities from their parents. These children were taken to “health facilities” and killed by lethal injection or gas poisoning. In the name of “racial health” and other eugenics nonsense, the regime murdered thousands of disabled children. Among them was a 15 year-old Down Syndrome cousin of the future pope, Joseph Ratzinger.\n\nThis would have been Anne de Gaulle’s fate if she had ever fallen into Nazi hands. Although de Gaulle never referenced it specifically, it’s likely that the brutal treatment of the disabled was one of the things he had in mind when referring to the evil of the Nazi regime. When de Gaulle refused to surrender in 1940 and was branded a traitor by France’s political and military elites, it was certainly the act of an intensely patriotic man unwilling to accept his country’s abasement by the Nazis. But de Gaulle’s act of resistance also concerned safeguarding his defenseless daughter from those who viewed her as sub-human.\n\nLife after Death\n\nLike many Down Syndrome children, Anne de Gaulle died at an early age. Her brother Philippe recollects arriving at his parents’ house in 1948 to find the entire residence immersed in silence. No one, he writes, dared to say anything to his grief-stricken father. Anne was subsequently buried in the cemetery at the de Gaulles’ parish church in Colombey-les-Deux-Églises. After attending their regular Sunday Mass and always on the anniversary of her death, Charles and Yvonne de Gaulle would visit Anne’s grave. 22 years after she died, her father was laid to rest beside Anne. Her mother joined them in 1979.\n\nThat, however, wasn’t the end of the story. Back in October 1945, the de Gaulles raised enough money from private donors to buy the chateau de Vert-Cœur in the department of Yvelines, not far from Paris. They then began creating a home for intellectually disabled girls. A few months after Anne’s death, the Fondation Anne-de-Gaulle opened its doors at the chateau. Staffed by nuns, funded by the considerable royalties generated by de Gaulle’s memoirs, and presided over by Yvonne de Gaulle until her death, the Foundation continues to serve the disabled today.\n\nOne of Charles de Gaulle’s biographers, the late Jean Lacouture, records him as once saying, “Without Anne, I could never perhaps have done what I did. She gave me the heart and the inspiration.” In that sense, the man of June 18 and his beloved pauvre petite Anne teach us something which we are tempted to forget—that all of us can find strength in weakness and that nothing is more powerful than self-giving love.\n\n________________________________\n\nDr. Samuel Gregg is Research Director at the Acton Institute. He has written and spoken extensively on questions of political economy, economic history, ethics in finance, and natural law theory. He is the author of many books, including Becoming Europe (2013) and For God and Profit: How Banking and Finance Can Serve the Common Good (2016).\n\nhttp://www.catholicworldreport.com/Item/5594/A_Fathers_Love_The_Story_of_Charles_and_Anne.aspx"}, {"url": "https://catholicstand.com/anne-de-gaulle/", "page_content": "Charles de Gaulle could be a very frustrating man. Churchill, in reference to de Gaulle, said that the heaviest cross he had to bear during the war was the Cross of Lorraine, the symbol of the Free French forces.\n\nArrogant, autocratic, often completely unreasonable, de Gaulle was all of these. However, there is no denying that he was also a great man. Rallying the Free French forces after the Nazi conquest of France, he boldly proclaimed, “France has lost a battle, France has not lost the war.” For more than a few Frenchmen and women, de Gaulle became the embodiment of France. It is also hard to dispute that De Gaulle is the greatest Frenchman since Clemenceau, “The Tiger”, who led France to victory in World War I. However, de Gaulle was something more than a great man, he was also at bottom a good man, as demonstrated by his youngest daughter Anne de Gaulle.\n\nAnne de Gaulle Had Down Syndrome\n\nCharles and Yvonne de Gaulle were both devout Catholics, so when their youngest daughter Anne was born on New Years Day in 1928, they had a strong faith to fall back on when they learned that Anne had Down Syndrome. She also had birth injuries that meant that she would never walk unaided. There was never any question about Anne being institutionalized. She was a member of their family, and she stayed with the family in all their travels. There was one sacred rule in the de Gaulle household: Anne was never to be made to feel different or less than anyone else.\n\nCharles de Gaulle was noted for his reserve and even with family members he was usually not very demonstrative. Not so with his daughter Anne, who received a warmth that he had seemed to be storing for his entire life just for her. “Papa” was the one word that Anne could say clearly. He would sing to her, read her stories and play with her. She was, he said simply, “My joy”. As de Gaulle said, “She helped me overcome the failures in all men, and to look beyond them.”\n\nThe De Gaulles Were Heartbroken\n\nYvonne de Gaulle, a formidable woman in her own right, as she demonstrated after the collapse of France in 1940 when by herself she traveled across the war-torn country and made sure her family, including Anne, was on the last transport from Brest to England, in October 1945 bought the Château de Vert-Cœur and established a hospital for handicapped girls, the Fondation Anne de Gaulle. The de Gaulles were heartbroken when their beloved daughter died on February 6, 1948, in her father’s arms. After they had buried her, Charles gently told his weeping wife, “Maintenant, elle est comme les autres.” (Now, she’s like all the others.)\n\nOf course , the de Gaulles did not forget their daughter. Charles de Gaulle’s’ life was saved by his love for Anne on August 22, 1962, when an assassin’s bullet was deflected in the car he was riding by the frame of the picture of his daughter which he carried with him at all times. When he died in 1970 he was buried beside his daughter at Colombey-les-Deux-Églises as he requested. Love gives us no guarantees against the tragedies of life, but it does give us the strength to surmount them."}, {"url": "https://www.parisaeroport.fr/en/group/group-news/paris-anne-de-gaulle", "page_content": "From Saturday 3 December to 10 December 2022, Paris-Charles de Gaulle airport gave way to Paris-Anne de Gaulle airport , in tribute to the daughter of Yvonne and General de Gaulle, Anne, who had a disability. Created in 1945 , the Anne de Gaulle Foundation has been welcoming people with neurodevelopmental disorders with or without mental health problems for over 70 years. For Groupe ADP, as for the Foundation, this transformation of the visual identity of Paris-CDG airport aims to raise awareness among travellers of the need to mobilise everyone to guarantee the rights and freedoms of people with disabilities .\n\nFor the International Day of Persons with Disabilities (December 3), Paris-Charles de Gaulle airport changed its name to Paris-Anne de Gaulle from December 3 to 10. Groupe ADP wanted to support the Anne de Gaulle Foundation, which assists people with neurodevelopmental disorders or mental disabilities.\n\nNew and engaging visual immersion\n\n\n\n\n\n\n\nThe new name was visible on the airport's exterior façade at Terminal 2 A and B and inside Terminals 2E and 2F. Information posters were adapted for easy reading and understanding in the areas dedicated to disabled persons with reduced mobility.\n\n\n\n\n\n\n\n\"DuoDay+1\" or sharing skills at all levels\n\n\n\n\n\n\n\ntransferring skills to all the players in society.\n\n\n\nPrior to this event, the Foundation trained Paris Aéroport staff in charge of reception on the basics of Augmented Alternative Communication (AAC) to better understand the diversity of communication needs of the public passing through the airport.\n\n\n\nDuring the launch day on 3 December, a DuoDay+1 was formed between a person from Paris-Airport, a staff member accompanying the Foundation and a person accompanied by the Foundation, in order to enrich each other and enhance the human experience of travellers.\n\n\n\nBeyond the name change, this operation was an opportunity to implement one of the Anne de Gaulle Foundation's priority missions, that ofPrior to this event, the Foundation trained Paris Aéroport staff in charge of reception on the basics of(AAC) to better understand the diversity of communication needs of the public passing through the airport.During the launch day on 3 December, a, in order to enrich each other and enhance the human experience of travellers.\n\n\n\n\n\n"}, {"url": "https://gettotext.com/charles-de-gaulle-what-has-become-of-philippe-elisabeth-and-anne-his-3-children-current-woman-le-mag/", "page_content": "We thought we knew everything about him, we were wrong all the way. History secrets and its issue of Monday June 15 unveil new mysteries about the complex personality of Charles de Gaulle. All the facets of the great French leader are explored and told by Stéphane Bern, from his love for France to his mastery of communication tools, including his devotion to his family. From her marriage to Yvonne Vendroux (April 7, 1921), in fact came from three children: Philippe, Elisabeth and Anne, born respectively in 1921, 1924 and 1928.\n\nThe first, a recognized naval officer, was recently honored by the National Assembly. Modest man, now 98 years old, he had participated in the liberation of the Palais Bourbon in August 1944. There followed a beautiful and long career in the navy (42 years) then a political parenthesis as a senator ( 1986-2004) before spending happy days around history books, walking and television, as he confided in an interview for Paris-Match in 2019. During this interview, this fan of great sporting events had poured out on the fate of the youngest of the brothers, Anne, carrier of a trisomy 21.\n\nAnne, the General's darling daughter\n\nThis child united the De Gaulle couple because, together, they tried to awaken it, to make it progress by adapting to its rhythm, until his death on February 6, 1948 at the age of 20 years. They even installed a nursing home for disabled young girls on a property in the Yvelines, called the Anne De Gaulle foundation, and chaired by their first daughter, Elisabeth. The latter had married on January 3, 1946 Alain de Boissieu, whom she had met in London where this young officer had gone in 1942 after a spectacular escape. She joined her father and her youngest child in the Colombey-les-Deux-Églises cemetery, where she was buried in April 2013.\n\nRead also : When Emmanuel Macron imitates Charles de Gaulle, \"for fun\""}, {"url": "https://gettotext.com/charles-de-gaulle-airport-renamed-anne-de-gaulle-to-raise-awareness-of-disability-situations/", "page_content": "Yasmina Kattou, edited by Laura Laplaud\n\n\n\nOn the occasion of the International Day of Persons with Disabilities, Paris-Charles de Gaulle airport will be renamed “Anne de Gaulle”, in reference to the general’s daughter who was a carrier of trisomy 21. For a week, the Paris airport will raise awareness of the integration of disabled people.\n\nWhen Charles gives way to Anne. From Saturday, the Parisian airport Paris-Charles de Gaulle will be renamed “Anne de Gaulle” on the occasion of the international day of people with disabilities. At the origin of the initiative, the Anne de Gaulle Foundation, the daughter of the general who was a carrier of trisomy 21. For the Paris airport, it is a question of raising awareness of situations of disability for a week. According to the Foundation, this is the first time in the world that an airport has been renamed, because it is not just symbolic… On Saturday, a good part of the panels and signage will be completely renamed.\n\nRoad signs will announce the new name\n\nFrom the motorway, when approaching the airport, illuminated road signs will announce in orange letters: “Welcome to Paris-Anne de Gaulle airport”. So that travelers or taxi drivers understand that this is not an error, the pediments of terminals 2A and 2B will display the new name in blue letters at least two meters high, visible to all motorists. .\n\nInside, the surprise will be reserved for passengers in terminals 2E and 2F where all flight information screens will display “Welcome to Paris-Anne de Gaulle”. Same message on all the billboards in these terminals, both on departure and on arrival. Something to surprise newly arrived tourists.\n\nIn the air, Air France personnel will announce the new temporary name on landing. A disability awareness message will also be communicated to passengers. Operation Anne de Gaulle will last eight days."}, {"url": "https://www.britannica.com/biography/Charles-de-Gaulle-president-of-France", "page_content": "Top Questions What were Charles de Gaulle’s accomplishments? Charles de Gaulle led the Free French forces in resisting capitulation to Germany during World War II and became provisional president of France in the immediate aftermath of the war. Later he was an architect of the Fifth Republic and was president from 1959 to 1969. When did Charles de Gaulle become famous? Charles de Gaulle was undersecretary of state for defense and war when Marshal Philippe Pétain took over the government of France with the intention of signing an armistice with Adolf Hitler. De Gaulle left for London, where, on June 18, 1940, he broadcast an appeal to his countrymen to continue to fight under his leadership. What were Charles de Gaulle’s policies as president of France? Charles de Gaulle was determined that France should be treated as one of the great powers and not fall under the sway of any other country, particularly the United States. To that end, he made France a nuclear power, withdrew France from the military command of NATO, and followed his own views on foreign policy. When did Charles de Gaulle lose power? Charles de Gaulle lost power twice. He resigned as provisional president in 1946 because he opposed political parties forming the Fourth Republic, and, when his own movement failed to gain a majority, he retired from politics in 1953. The second time, voters rejected his proposed reforms, and he resigned as president in 1969.\n\nCharles de Gaulle, in full Charles André Joseph Marie de Gaulle, (born November 22, 1890, Lille, France—died November 9, 1970, Colombey-les-deux-Églises), French soldier, writer, statesman, and architect of France’s Fifth Republic.\n\nEducation and early career De Gaulle was the second son of a Roman Catholic, patriotic, and nationalist upper-middle-class family. The family had produced historians and writers, and his father taught philosophy and literature; but, as a boy, de Gaulle already showed a passionate interest in military matters. He attended the Military Academy of Saint-Cyr, and in 1913, as a young second lieutenant, he joined an infantry regiment commanded by Colonel Philippe Pétain. De Gaulle was an intelligent, hardworking, and zealous young soldier and, in his military career, a man of original mind, great self-assurance, and outstanding courage. In World War I he fought at Verdun, was three times wounded and three times mentioned in dispatches, and spent two years and eight months as a prisoner of war (during which time he made five unsuccessful attempts to escape). After a brief visit to Poland as a member of a military mission, a year’s teaching at Saint-Cyr, and a two-year course of special training in strategy and tactics at the École Supérieure de Guerre (War College), he was promoted by Marshal Pétain in 1925 to the staff of the Supreme War Council. From 1927 to 1929 de Gaulle served as a major in the army occupying the Rhineland and could see for himself both the potential danger of German aggression and the inadequacy of the French defense. He also spent two years in the Middle East and then, having been promoted to lieutenant colonel, spent four years as a member of the secretariat of the National Defense Council. De Gaulle’s writing career began with a study of the relations between the civil and military powers in Germany (La Discorde chez l’ennemi, 1924; “Discord Among the Enemy”), followed by lectures on his conception of leadership, Le Fil de l’épée (1932; The Edge of the Sword). A study on military theory, Vers l’armée de métier (1934; The Army of the Future), defended the idea of a small professional army, highly mechanized and mobile, in preference to the static theories exemplified by the Maginot Line, which was intended to protect France against German attack. He also wrote a memorandum in which he tried, even as late as January 1940, to convert politicians to his way of thinking. His views made him unpopular with his military superiors, and the question of his right to publish under his name a historical study, La France et son armée (1938; France and Her Army), led to a dispute with Marshal Pétain. Britannica Quiz Pop Quiz: 17 Things to Know About World War II\n\nWorld War II At the outbreak of World War II, de Gaulle commanded a tank brigade attached to the French Fifth Army. In May 1940, after assuming command as temporary brigadier general in the 4th Armoured Division—the rank that he retained for the rest of his life—he twice had the opportunity to apply his theories on tank warfare. He was mentioned as “an admirable, energetic, and courageous leader.” On June 6 he entered the government of Paul Reynaud as undersecretary of state for defense and war, and he undertook several missions to England to explore the possibilities of continuing the war. When the Reynaud government was replaced 10 days later by that of Marshal Pétain, who intended to seek an armistice with the Germans, de Gaulle left for England. On June 18 he broadcast from London his first appeal to his compatriots to continue the war under his leadership. On August 2, 1940, a French military court tried and sentenced him in absentia to death, deprivation of military rank, and confiscation of property. De Gaulle entered his wartime career as a political leader with tremendous liabilities. He had only a handful of haphazardly recruited political supporters and volunteers for what were to become the Free French Forces. He had no political status and was virtually unknown in both Britain and France. But he had an absolute belief in his mission and a conviction that he possessed the qualities of leadership. He was totally devoted to France and had the strength of character (or obstinacy, as it often appeared to the British) to fight for French interests as he saw them with all the resources at his disposal. Get a Britannica Premium subscription and gain access to exclusive content. Subscribe Now In his country, to the politicians on the political left, a career officer who was a practicing Roman Catholic was not an immediately acceptable political leader, while to those on the right he was a rebel against Pétain, who was a national hero and France’s only field marshal. Broadcasts from London, the action of the Free French Forces, and the contacts of resistance groups in France either with de Gaulle’s own organization or with those of the British secret services brought national recognition of his leadership; but full recognition by his allies came only after the liberation of Paris in August 1944. Henri Giraud, Franklin D. Roosevelt, Charles de Gaulle, and Winston Churchill; Casablanca Conference In London de Gaulle’s relations with the British government were never easy, and de Gaulle often added to the strain, at times through his own misjudgment or touchiness. In 1943 he moved his headquarters to Algiers, where he became president of the French Committee of National Liberation, at first jointly with General Henri Giraud. De Gaulle’s successful campaign to edge out Giraud gave the world proof of his skill in political maneuvering."}]}