{"Anne de Gaulle was often seen in public with her father and was a frequent guest at the ÉlysÉE Palace.": [{"url": "https://www.annefrank.org/en/anne-frank/main-characters/anne-frank/", "page_content": "Annes first years\n\nAnne spent the first four years of her life in Frankfurt am Main (Germany). She was a cheerful and naughty toddler. Housekeeper Kathi later remembered the time when Anne sat down in a puddle of rain and made Kathi tell her a story there.\n\nAnne never really got to know Germany well, though, and would always struggle with the German language, because the family moved to Amsterdam when she was only four years old.\n\nDuring the first few years in the Netherlands, Anne suffered from health problems. The family called her 'Zärtlein' [delicate puppet]. In November 1937, mother Edith wrote in a letter to an old neighbour in Frankfurt: ‘Anne stays home from school to sleep in the afternoon, which does her well; she is very cheerful, but sensitive and nervous, too.’ ﻿"}, {"url": "https://www.cliffsnotes.com/literature/d/the-diary-of-anne-frank/summary-and-analysis/the-second-year", "page_content": "Summary and Analysis The Second Year\n\nAnne's fourteenth birthday is celebrated with little gifts from the members of her \"family in hiding,\" as she calls them, and she also receives a poem from her father. This was a German tradition, and as Anne's family had originally come from Germany, moving to Holland only after the rise to power of the Nazis in Germany, Anne's father wrote the poem in German. Margot, Anne's sister, translated it \"brilliantly\" into Dutch, and the English translator has also done a good job.\n\nThe Nazis have begun to move quickly; new regulations have been imposed. All civilians are ordered to hand in their radio sets (listening to stations other than those of the Nazis had been forbidden since the beginning of the war, but the Dutch people, nevertheless, listened to the BBC secretly, drawing encouragement from it), and the little group in the \"Secret Annexe\" is reluctantly obliged to forfeit the large set which was in the office downstairs. One of their \"protectors,\" however, promises to provide them with another, substitute radio, and Anne concludes this entry by saying, \"It is really true that as the news from the outside gets worse, so the radio with its miraculous voice helps us to keep up our morale and to say again, 'Chins up, stick it out, better times will come!'\" (June 15, 1943).\n\nAlmost a month passes without an entry in Anne's diary, and then we read that Anne has decided to control her public remarks about the people whom she must be confined with, even if this involves shamming (or fraudulent behavior) \". . . so that the rain of rebukes dies down to a light summer drizzle\" (July 11, 1943). Thus, the routine life of the group goes on, and Anne and Margot are even allowed to help a little with the work of the office downstairs, making them feel quite important. Anne mentions again how very important books are to her, as she is shut up in the \"Secret Annexe\" and has no other amusements.\n\nShe then describes — in a very detailed entry — how she approached her roommate, Mr. Düssel, very politely, after having first discussed the matter with her father. She asks Mr. Düssel if she may use the work table in their room for an extra hour-and-a-half twice a week. She explains that there is too much going on in the common room, and that although she is able to work on the table every day from half-past two until four, while Düssel sleeps, she needs more time to work. She is very disappointed and angry when Düssel absolutely refuses her request without giving any explanation. Yet, Anne keeps her temper and asks him to reconsider. She then recounts Düssel's selfish, melodramatic, and false tirade against her, again describing her own self-restraint and the immense mental effort that this discipline represents for her. Eventually, at her request, her father intervenes on Anne's behalf, and Düssel gives in. Anne concludes: \"Düssel . . . didn't speak to me for two days and still had to go and sit at the table from five till half-past — frightfully childish. A person of fifty-four who is still pedantic and small-minded must be so by nature, and will never improve\" (July 13, 1943).\n\nVarious events occur to alarm the group in the \"Secret Annexe.\" The offices downstairs are burglarized, although this is noticed only after it has occurred sometime during the night (July 16, 1943). The air raids continue by day as well as by night so that there is a constant fear of both fire and discovery. The news that Mussolini has resigned provides some encouragement, but the emotional and physical exhaustion resulting from the sleepless nights of the air raids continues (July 26, 1943).\n\nIn the following entry, Anne describes her efforts to find a neutral topic of conversation while she is doing the dishes with Mrs. Van Daan and Mr. Düssel, and how this tactic not only fails but backfires because of a critical comment that Anne makes of a book which Düssel has recommended. This sets off Düssel and Mrs. Van Daan on a long tirade about how badly brought-up Anne is and how her ideas and opinions are all wrong. Anne comments perceptively: \"I suppose it's their idea of a good upbringing to always try to set me against my parents, because that is what they often do\" (July 29, 1943). Anne then allows herself to note all of her criticisms of Mrs. Van Daan, describing her as \"very pushing, selfish, cunning, and calculating,\" but adds in a postscript: \"Will the reader take into consideration that when this story was written the writer had not cooled down from her fury!\"\n\nAnne begins to give a detailed account of the group's daily routine, starting on August 4, 1943, with an account of their evening and night-time routines, who sleeps where, who washes when and how Anne leaves hairs in the bathroom sink. She also describes the strange noises which the house and its \"inmates\" make during the night. There is also a graphic description of Anne using the potty in the middle of the night, waking up from a dream to the sound of an air raid and scampering into her father's bed in fear. This last episode is illustrated by a verse from the poem which Margot wrote for Anne's birthday. Anne continues her account the following day with a description of lunchtime. Her review of the evening meal becomes an analysis of the characters of the people sitting around the table, their eating habits, their ways of talking, and their general traits. On the whole, these are not very complimentary.\n\nIn the passage for August 18, 1943, Anne manages to give a vivid and entertaining account of a rather mundane task, potato peeling. She has a keen eye, and she carefully observes the little nuances of speech and the physical gestures which characterize the various members of the group. There is also a touching description of what Anne calls \"a little bit of real family life\" (August 23, 1943).\n\nThe members of the group are up before half-past eight, when the workers begin their duties in the warehouse, and even though the office staff has not yet arrived, so that it is necessary for the group to be particularly quiet, Anne and Margot and their parents sit, read, or work in their room until it is time for breakfast, at nine o'clock.\n\nThe news about Italy's capitulation raises everyone's spirits (September 10, 1943), but this is offset by the illness of one of their \"protectors,\" Mr. Koophuis. Another cause for concern is the fact that one of the workers in the warehouse appears to suspect something, and thus the already strained nerves of the members of the group lead them to virtually refrain from speaking to one another because \"whatever is said you either annoy someone or it is misunderstood.\" Anne takes sedatives to calm her nerves (and so presumably do the others), but she notes that \"it doesn't prevent me from being even more miserable the next day. A good hearty laugh would help more than ten Valerian pills, but we've almost forgotten how to laugh\" (September 16, 1943). This remark, \"but we've almost forgotten how to laugh,\" is but one of the many of Anne's comments that suggests that here is a person of a sensitivity, an intelligence, and a maturity far beyond her chronological years.\n\nMrs. Van Daan's birthday is celebrated, and the members of the group, as well as the \"protectors,\" give her presents of things to eat, as well as some food coupons. Anne remarks: \"Such are the times we live in!\" (September 29, 1943). The strained relations between the members of the group continue, and Anne's words, \"Oh, what kind of explosion is hanging over us now? If only I wasn't mixed up so much with all these rows! If I could only get away! They'll drive us crazy before long!\" (September 29, 1943), are desperate cries from her heart.\n\nOne day, Mrs. Van Daan is obliged to sell her fur coat to raise money for food, and this leads to additional quarrels. Anne remarks, ironically: \". . . and now the reconciliation period of 'Oh, darling Putti' and 'precious Kerli' has set in.\" Then she adds: \"I am dazed by all the abusive exchanges that have taken place in this virtuous house during the past month. . . . Quite honestly, I sometimes forget who we are quarreling with and with whom we've made it up. The only way to take one's mind off it all is to study, and I do a lot of that\" (October 17, 1943).\n\nSundays — when there is no one working in the office, and when there is no relief from the tedium of the group — are particularly depressing days for Anne. She describes them with a telling phrase: \"The atmosphere is so oppressive, and sleepy and as heavy as lead\" (October 29, 1943). We can feel her painful desperation at being \"jailed\" for over a year when she writes: \"I wander from one room to another, downstairs and up again, feeling like a songbird whose wings have been clipped and who is hurling himself in utter darkness against the bars of his cage\" (October 29, 1943).\n\nWith an admirable sense of self-awareness, Anne writes, \"If you were to read my pile of letters one after another, you would certainly be struck by the many different moods in which they are written. It annoys me that I am so dependent on the atmosphere here, but I'm certainly not the only one — we all find it the same\" (November 8, 1943). She also gives us a very vivid account of her fears and nightmares, remarking that although she talks about the concept of \"after the war,\" \". . . it is only a castle in the air, something that will never really happen.\" In this, she is being prophetic without even realizing it. Anne's diary entries now begin to show an increasing sense of sadness, desperation, and, occasionally, the loss of hope, although there is an entertaining interlude entitled \"Ode to my Fountain Pen: In Memoriam,\" in which Anne recounts how she received her fountain pen as a gift from her grandmother when she was nine and how it was accidentally burned in the stove that day (November 11, 1943).\n\nOne night, Anne dreams about her best school friend, Lies, and she is shot through with guilt at living in comfort and being unable to help Lies in any way. In her dream, Anne sees Lies \"clothed in rags, her face thin and worn. Her eyes were very big\" (November 27, 1943). This is an accurate description of the appearance of most of the concentration camp inmates, although Anne did not know — and could not have known — Lies' condition (sadly, ironically, Lies really was in a concentration camp).\n\nThe Dutch Festival of Saint Nicholas Day is celebrated with little poems that Anne and her father have written for everybody, and Christmas is marked by the exchange of small gifts. Anne has re-covered from a bad bout of flu and comments that they \"are all getting on well together for a change! There's no quarrelling — we haven't had such peace in the home for at least half a year\" (December 22, 1943).\n\nAnne's account of her feelings is extremely, almost achingly, honest in the entry for December 24, 1943, when she writes at length about her longing to go outside, to walk about freely, to do the things that young people all over the world do and, above all, to simply \"have fun.\" This futile wish leads her once again to the sad topic of what she considers to be the inadequacies of her mother, and Anne vows to behave differently when she has children of her own. Anne seems to have expected too much of her mother, who would probably have functioned well enough in normal circumstances, but here — in this horrible situation — Mrs. Frank appears to be almost unable to under-stand her mercurial daughter, a girl of high intelligence and sensitivity. Remember that these are exceptional and dangerous conditions in which the Franks are trying to survive, and Mrs. Frank is just an ordinary, middle-class person with, perhaps, a limited imagination.\n\nAnne mentions the fact that the mere act of writing her thoughts down in her diary has improved her mood a little. She also refers to her father's phrase \"the love of his youth\" (December 25, 1943), realizing that her father had confided in her concerning this person the previous year, but then she had not been able to understand \"the meaning of his words\" because he had to \"express his own feelings for once\" rather than coping with those of others. Anne adds that her father \"has become very tolerant. I hope that I shall grow a bit like him, without having to go through all that [suffering].\" This entry reveals Anne's sensitive awareness of her own faults and her desire to improve herself, as well as showing us Anne's acute consciousness of the feelings of others.\n\nAnne's moods continue to swing back and forth between grief, compassion, and guilt. She grieves for the past and for loved ones who are gone, and there is also Anne's ever-growing compassion for those Jews whose suffering is greater than hers; in particular, she thinks about her girl friend Lies (December 29, 1943). She also feels guilty for having negative feelings about her mother (January 2, 1944). Anne seems to be becoming more aware of what it is that she believes that her mother lacks (January 5, 1944) — namely, a certain sensitivity to the feelings of her lively, moody adolescent daughter, and although this does not really ease Anne's pain at being misunderstood, it does help her to cope with it.\n\nAnne's longing for a girl friend (January 5, 1944) is partly fulfilled when, on January 6, 1944, Anne decides to go up to Peter Van Daan's room and talk to him. Peter is a rather shy boy, two years older than Anne, and it seems that he is not averse to having Anne come and talk to him. Anne, however, is torn between her need for someone to confide in and her fear of seeming to be \"too forward,\" but she concludes, \"Don't think I'm in love with Peter — not a bit of it! If the Van Daans had had a daughter instead of a son, I should have tried to make friends with her too.\"\n\nThat night, Anne dreams about a former boyfriend, also called Peter, dreaming about him in a rather romantic way, and she feels certain, upon waking, that \"Peter was still the chosen one.\" This leads her, in her next diary entry, on January 7, 1944, to relate the history of all her boyfriends at the various stages of her life. We realize here that her relationship with Peter Van Daan compensates for many of the difficulties of her daily life, for Anne writes, \"What do I care about the lot of them! Peter belongs to me and no one knows anything about it. This way I can get over all the snubs I receive. Who would ever think that so much can go on in the soul of a young girl?\" (January 12, 1944).\n\nAfter writing rather antagonistically about the faults of the Van Daans, Anne comes to realize that the faults which she sees in them might not necessarily be theirs alone. It is a very perceptive and mature Anne who writes, \"Until now I was immovable! I always thought the Van Daans were in the wrong, but we too are partly to blame. We have certainly been right over the subject matter; but handling of others from intelligent people (which we consider ourselves to be!) one expects more insight. I hope that I have acquired a bit of insight and will use it well when the occasion arises\" (January 22, 1944).\n\nAnother milestone of maturity is passed when Anne manages to have a conversation with Peter about sex, when he shows her his cat's male organs. Anne feels strange, but she admires Peter for being able to talk about it in a matter-of-fact way. Other than that, the normal daily routines of the little group continue. Anne is still involved in her studies, but she also occupies herself with compiling the family trees of the royal families of Holland and England, as well as collecting pictures of the various movie stars of the time. The adults continue to annoy her by repeatedly telling the same anecdotes, and, in a telling phrase, she marvels at the fact that \"we are quite as used to the idea of going into hiding, or 'underground,' as in bygone days one was used to Daddy's bedroom slippers warming in front of the fire\" (January 28, 1944). Their \"protectors\" continue to help and encourage them, even though this involves danger for them, and Anne regards this as being on a par with all other acts of heroism performed during the war, vowing never to forget them.\n\nThe probability of an invasion of Europe by the Allies (the forces fighting against the Nazis) increases, and all sorts of rumors and speculations are talked about and considered. The group in the \"Secret Annexe\" is aware of all this through their \"protectors,\" as well as through listening to the BBC. Anne gives examples of the kinds of conversations conducted by the members of the group, concluding rather fatalistically, \"I myself keep very quiet and don't take any notice of all the fuss and excitement. I have now reached the stage that I don't care much whether I live or die. The world will still keep on turning without me; what is going to happen, will happen, and anyway it's no good to resist. I trust to luck and do nothing but work, hoping that all will end well\" (February 3, 1944).\n\nAnne's growing relationship with Peter continues to excite and console her, even though she remains terribly frustrated by having to remain inside — especially now, when spring is beginning, filling her with longings \"to talk, for freedom, for friends, to be alone!\" (February 12, 1944). Peter confides in her about his frustration at being unable to express himself clearly, as he claims she does, and even though she feels that this is not justified, and that she is equally tongue-tied or unnecessarily verbose, she feels glad \"because I sensed a real feeling of fellowship, such as I can only remember having had with my girlfriends\" (February 14, 1944). On another occasion, Peter helps Anne find the smallest and sweetest potatoes, and Anne feels that he is looking at her with \"such a gentle warm look which made a tender glow within me. I could really see that he wanted to please me, and because he couldn't make a long complimentary speech he spoke with his eyes\" (February 16, 1944).\n\nAlthough Anne now feels much happier and is always hoping to see \"him\" when she goes upstairs, she still experiences sudden moods of unhappiness, when the tears simply roll down her cheeks, and she feels uncertain of Peter's affection for her (February 19, 1944). Anne does find some solace, though, in going up to the attic, where Peter works, and from where she can look up through the skylight at \"the bare chestnut tree, on whose branches little raindrops shine, appearing like silver, and at the seagulls and the other birds as they glide on the wind\" (February 23, 1944). From that room, Anne can also look out over Amsterdam, gaze at the roofs, and at the horizon, and in her misery, she finds that this communion with nature, and with the things that seem more permanent than man, bring peace to her soul.\n\nAs her concern with Peter increases steadily, so that she \"hardly does anything else but think of Peter\" (February 27, 1944), Anne realizes that there are a great many similarities between them. Both of them, she feels, have mothers who are inadequate, and both she and Peter wrestle continually with their inner emotions. She notes, however, that whereas her reaction is to be noisy and boisterous, Peter is more likely to sink into silence. In a sad mood, Anne ends this entry for February 28, 1944, with the plaintive cry, \"I'm sentimental — I know. I'm desperate and silly — I know that too. Oh, help me!\"\n\nA burglary in the office downstairs alarms the members of the little group again, although fear does not seem to play such a large part in their lives as it did at the beginning of their period of hiding. Anne, in particular, appears to be less fearful about things than she was before, possibly because she has developed a more fatalistic attitude, as her entry for February 3, 1944, shows. Still, though, she continues to resent the fact that grownups treat her, Margot, and Peter as \"children\" and prevent them from expressing their opinions about such subjects as overcoming depression and feelings of discouragement, which they feel as well-equipped as the adults to discuss.\n\nAnne finally admits to herself that her feelings for Peter are \"pretty near to being in love with him\" (March 3, 1944), and each entry in her diary records another topic of conversation discussed or another meeting between them. Anne realizes that Peter is very shy, and she does not want to appear too eager herself, so both of them seem to be hovering on the brink of declaring their love. She writes, \"Who will be the first to discover and break through this armor?\" And she then adds, \"I'm glad after all that the Van Daans have a son and not a daughter; my conquest could never have been so difficult, so beautiful, so good, if I had not happened to hit on someone of the opposite sex\" (March 6, 1944).\n\nIn one of her more introspective moods, Anne looks back to the girl she was and to the life which she led before she went into hiding, noting that \". . . it all seems so unreal. It was quite a different Anne who enjoyed that heavenly existence from the Anne who has grown wise within these walls\" (March 7, 1944). While recognizing that her life beforehand had been enjoyable, she admits that she was certainly more superficial then, and that she will never again be able to live like that, at least not for long stretches of time. She maintains that even then she felt a certain emptiness, but disguised it with a constant flurry of activities and friends. She also analyzes the various phases which she has gone through after going into hiding. She speaks of her initial confusion, followed by depression and then, as she began to mature, both physically and emotionally, she describes her growing self-awareness, and finally, her discovery of her inward happiness through her close relationship with Peter Van Daan.\n\nThe daily problems of obtaining and preparing food, getting along with the various members of the group, contacts with the outside world and news of the progress of the war still occupy Anne's thoughts to a considerable extent. But some things have changed. Anne's feelings about Peter, for example, cause her to be very reserved with her family, and she says, \". . . the brightest spot of all is that at least I can write down my thoughts and feelings, otherwise I would be absolutely stifled!\" (March 16, 1944).\n\nAs we read, we realize that Anne continues to resent being cooped up with the other members of the group and that she still objects to being treated as a child, for she says, \"Although I'm only fourteen, I know quite well what I want, I know who is right and who is wrong, I have my opinions, my own ideas and principles, and although it may sound pretty mad from an adolescent, I feel more of a person than a child, I feel quite independent of anyone\" (March 17, 1944).\n\nMore and more, Peter and Anne confide in one another, and Anne records their conversations in her diary. As they open their hearts to one another, talking about their initial impressions of one another when the group first went into hiding, they realize that they have even more in common than they had ever imagined. Anne, however, is sad at the thought that Margot is made wretched by Anne's relationship with Peter, since Margot also likes him, but Margot assures Anne, in a letter, that it is not that she herself loves Peter, but, rather, that she regrets not having found anyone for herself yet. This sets off a touching exchange of letters between Margot and Anne, in which each one shows her concern for the other's feelings. It was obviously easier for them both to set their emotions down on paper than to talk about them face-to-face.\n\nBoth Anne and Peter have to take a fair amount of teasing from the adults about the fact that Anne goes up to Peter's room in the evenings, and Anne remarks that \"we don't take much notice of all this parental chatter, their remarks are so feeble. Have the two sets of parents forgotten their own youth? It seems like it, at least they seem to take us seriously, if we make a joke, and laugh at us when we are serious\" (March 23, 1944). In this, she is probably speaking for a great many teenagers who have often felt misunderstood and mistreated by their parents.\n\nAlthough Anne states quite clearly that politics do not interest her, she nevertheless describes the reactions of the various members of the group to the news which they hear over the radio or from their \"protectors.\" For example, she depicts one scene as they all sit around the radio, listening to a speech given by Winston Churchill; yet, following the speech, the heated arguments that ensue horrify and anger her (March 27, 1944).\n\nAnne continues to be more preoccupied with Peter and with the growing closeness between them. She also continues to resent her mother's interference, although she admires her father's restraint at his daughter's obvious interest in Peter.\n\nOne day, one of the BBC broadcasts contains a suggestion by one of the Dutch leaders in exile that after the war the diaries and letters of people who have been through the war should be published. This causes quite a stir among the members of the group in hiding, and Anne starts to entertain serious thoughts of publishing her diary at a later stage, remarking that \"it would seem quite funny ten years after the war if we Jews were to tell how we lived and what we ate and talked about here\" (March 29, 1944). This sentence is strangely prophetic, as Anne's diary is, indeed, one of the most vivid documents — and perhaps the best-known-that has survived from that period, giving us a painfully honest, human \"inside view\" of what it was like to be Jewish and to be hiding in perpetual fear during the war years.\n\nTime and time again, Anne wrestles with depression, struggling to hold back tears when she is with Peter, bravely endeavoring not to sob out loud when she is alone. She tries to reason with herself, and eventually she succeeds, writing, \"It was over!\" (April 4, 1944). On the same occasion, she gives us a far more hopeful and more positive account of what she wants her future to be, so that the gloomy entry which began \"For a long time I haven't had any idea of what I was working for any more; the end of the war is so terribly far away, so unreal, like a fairy tale\" becomes more optimistic: \"I must work, so as not to be a fool, to get on, to become a journalist, because that's what I want! I know that I can write.\"\n\nThis same entry reveals Anne becoming a more mature young woman, one who is able to appraise herself and her surroundings clearly and also critically. She knows that she is the best judge of her own work, and she also realizes that she wants more from life than being just a homemaker, as her mother is, and as the women of her class generally were. Here, too, Anne exhibits an awareness of the position of women, an attitude which is far ahead of her time and her immediate environment.\n\nAnne also expresses her desire to-go on living after her death, and she thanks God for her ability to write, declaring that it is writing that consoles and encourages her. How ironic it is to read Anne's heart-searching entries and her assertions about the future when we know, as she could not, that these hopes of hers were indeed fulfilled, but not in the way she expected, and that the very words which she was writing at that moment were to bring her far greater immortality than she could ever have imagined.\n\nAnother attempt by burglars to break into the warehouse downstairs forces the members of the group to cower almost motionless for hours, afraid that they have finally been discovered. Anne gives us a graphic description of their whispered conversation and the various sights, sounds, and smells of these long hours. The incident causes Anne to wonder at their fates as Jews; again, she states her belief that the suffering which they are undergoing is so that they may emerge stronger. She also affirms her love for the Dutch nation, its people and its language, asserting that she intends to remain in Holland after the war (April 11, 1944).\n\nAnne is, figuratively, \"up in the clouds\" when Peter kisses her for the first time (April 16, 1944), although her doubts regarding the propriety of this, and the probable reactions of her parents and sister if they had known about it strike us as rather odd in this age of permissiveness. Although Peter and Anne would put their arms around one another, and, later on, occasionally kiss, their physical relationship was very innocent, a far different situation from the behavior of many teenagers today. In the space of only a few years, and with the help of medical advances in methods of birth control, sexual morality has changed tremendously. Once again, Anne displays astonishing maturity for a girl of fourteen by refusing to accept completely the extremely strict moral standards of her time, writing, \". . . we are shut up here, shut away from the world, in fear and anxiety, especially just lately. Why, then, should we who love each other remain apart? Why should we wait until we've reached a suitable age? Why should we bother?\" (April 17, 1944).\n\nAnne's happiness with Peter is not overshadowed by the daily trials of life in the \"Secret Annexe.\" But perhaps Anne's awareness of what maturity means has been heightened, for it is a very perceptive, if disenchanted, Anne who writes that the ordinary man in the street is as much to blame for the war as are the politicians, and that there is a destructive urge in everyone, so that unless this changes, bloodshed will always continue. Nevertheless, her irrepressible optimism causes her to write: \"I am young and I possess many buried qualities; I am young and strong and am living a great adventure; I am still in the midst of it and can't grumble the whole day long. I have been given a lot, a happy nature, a great deal of cheerfulness and strength. Every day I feel that I am developing inwardly, that the liberation is drawing nearer and how beautiful nature is, how good the people are about me, how interesting this adventure is! Why, then, should I be in despair?\" (May 3, 1944).\n\nFollowing the advice that Margot has given her, Anne writes a letter to her father, explaining her feelings about him and her mother, the difficulties she has been through during the period they have been in hiding and speaking honestly of her refusal to knuckle under to what she knows has been his silent disapproval of her relationship with Peter (May 5, 1944). Anne's father has a long and emotional talk with her after this letter, and Anne regrets having wounded his feelings, acknowledging that she might have misjudged him.\n\nVarious setbacks — such as the arrest of the man who brought them vegetables, rumors that there is growing anti-Semitism among the Dutch people, and Anne's fears that, having been born in Germany, she and her family will not be able to remain in Holland once the war is over — cause Anne's spirits to fall. She wonders if they might not all be better off dead, but still she clings to her hope that something will happen, and that the war will end soon (May 26, 1944). The news of the Allied invasion of Europe revives the optimism of the group, and Anne's fifteenth birthday is celebrated in a spirit of greater cheerfulness (June 13, 1944).\n\nThe last few entries in Anne's diary are concerned with the various daily events that Anne has written about all along — the moods of the members of the group, their preoccupation with food, the books they read and discuss, Anne's relations with her parents, and her feelings toward Peter.\n\nAnne's last entry, on August 1, 1944, three days before the \"Secret Annexe\" is raided by the police and its occupants are sent to concentration camps, is one in which Anne analyzes herself and her situation, displaying considerable powers of perception. She concludes, after acknowledging that her flippant behavior is just a front to help her cope with the people around her, with the statement that she keeps on \"trying to find a way of becoming what I would so like to be, and what I could be, if . . . there weren't any other people living in the world.\"\n\nAt the end of the period of hiding, Anne is clearly a very different person from the girl who started out to write in the red-checkered diary; especially during the second year, she has matured greatly. Of course, there has been the growing love between her and Peter, and this has certainly left its mark. But in addition to the self-confidence she has acquired, Anne is less quick to judge the other people around her; she has a greater self-awareness now, and she has thought deeply about a great many subjects.\n\nAnne has not wasted her time while she has been in hiding. Under her father's guidance, she has continued studying various subjects, skills, and languages. She has developed her writing, especially, so that the style in her diary has become more varied and vivid. In fact, her diary contains descriptive passages, conversations, character analyses, and honest introspection that we would not expect from such a young girl; this is one of the reasons why it has managed to capture the interest of so many people over such a long period of time; very simply, it is well-written. Anne's ability to analyze people and situations has grown as we watch, so to speak, so that we do not feel that we are reading the maudlin confessions of a \"mixed-up\" teenager; rather, we are eager to find out what this intelligent young woman has to say about the varied subjects which she chooses to write about. Being forced to remain in hiding for two years is obviously too high a price to pay for precocious maturity, but how much poorer our world would have been had we not been granted this glimpse into the inner workings of a young girl's mind in the years that were so fateful for her and for the whole world."}, {"url": "https://www.cliffsnotes.com/literature/d/the-diary-of-anne-frank/summary-and-analysis/the-first-year", "page_content": "Summary and Analysis The First Year\n\nAnne has just turned thirteen, and she lists the birthday presents which she has received, including the diary, which she says is \"possibly the nicest of all.\" She then gives us a brief description of her personal history, mentioning her birth in Frankfurt, Germany, the family, their emigration to Holland after Hitler's rise to power and his persecution of the Jews in Germany, the Nazi occupation of Holland, among the Nazis' occupation of other European countries, plus the various, severe restrictions imposed upon Jews there. Anne describes all this in a very matter-of-fact way, listing the sorts of things that Jews must and must not do: \"Jews must hand in their bicycles, Jews are banned from trains and are forbidden to drive. Jews are only allowed to do their shopping between three and five o'clock, and then only in shops which bear the placard 'Jewish Shop,'\" and so on. She points out, however, that \"life went on in spite of it all,\" and \"things were still bearable\" (June 20, 1942). Thus, in the midst of persecution and restrictions, Anne still describes her feelings about boyfriends and about girl friends, about school and her teachers, and also describes meeting Peter Wessel, a boy whom she apparently was rather fond of (June 30, 1942).\n\nAnne's father tells her that at some future date the family will have to go into hiding in order to avoid being sent to concentration camps; to Anne, this all seems to be vaguely distant. Yet, suddenly, less than one month after the diary begins, the family does suddenly have to go into hiding because Anne's older sister, Margot, has been summoned by the Nazis to be sent to a concentration camp. All Jews knew that the concentration camps were terrible places of imprisonment, although the full extent of what was actually done there was not yet known. And so, the family had no choice; they packed a few basic possessions into shopping bags, put on as many items of clothing as they could, made arrangements for their cat to be looked after, and they set off on foot-in the rain-for the \"hiding place\" that Anne's father had been arranging and preparing for some time.\n\nStraightaway, Anne and her father set about arranging and tidying the place, while Anne's mother and Margot lie down on their beds, too tired and emotionally drained and miserable to help (July 9-10, 1942).\n\nThe process of settling in and arranging a daily routine takes up several pages of the diary. At first, the Franks are alone, and the strange situation strikes Anne as \"more like being on vacation in a very peculiar boardinghouse\" than like being in hiding (July 11, 1942). Fear is an ever-present reality, however, as Anne writes, \"It is the silence that frightens me so in the evenings and at night . . . I can't tell you how oppressive it is never to be able to go outdoors. Also, I'm very afraid that we shall be discovered and be shot\" (July 11, 1942).\n\nAnne then describes her surroundings and the considerable precautions which the family must take not to be seen or heard by anyone other than their \"protectors\" — namely, the workers in the office downstairs.\n\nThe second family, the Van Daans arrive, bringing new faces into the little group but also new sources of irritation and conflict. Anne does not think very highly of young Peter Van Daan, who strikes her as being lazy, a hypochondriac, and boring. She is also shocked by the noisy quarrels between Mr. and Mrs. Van Daan, remarking rather self-righteously: \"Mummy and Daddy would never dream of shouting at each other\" (September 2, 1942).\n\nVery perceptively, Anne describes the Van Daans' foibles and quirks. For example, Mrs. Van Daan is piqued that her dinner service — and not the Franks' — is put into communal use. Secretly, Anne knows, Mrs. Van Daan has removed three of her sheets from the collective linen cupboard. Mrs. Van Daan, who continually scolds Anne for her continuous chatter, also does her best to leave the washing up of the pots and pans for others to do (September 21, 1942). Mr. Van Daan tries to discipline Peter in a particularly overbearing way, but he is not very successful in this.\n\nThese may seem like small matters, but when people are confined within a small space, they get on one another's nerves so much more easily and for smaller causes. It is Anne's father who is always the \"peacemaker\" in the \"Secret Annexe,\" the one who always has to assume the responsibility for \"pouring oil on troubled waters\" and soothing ruffled feelings.\n\nIn fact, Anne's father does his best to keep the younger members of the group busy, assigning them study tasks to do and ensuring that there is a constant supply of books for them to read as well. They all follow events in the outside world on a clandestine radio, and Anne struggles valiantly with French lessons. She also quarrels with her mother and complains to her diary that she cannot understand her mother and that her mother cannot understand her. Anne also resents the interference of the other members of the group. To illustrate this, Anne quotes a \"squabble\" with Mrs. Van Daan during dinner one night, ending with Mrs. Van Daan's saying to Anne's father, \"I wouldn't put up with it if Anne were my daughter.\" According to Anne, these always seem to be Mrs. Van Daan's first and last words: \"if Anne were my daughter.\" Understandably Anne confides to her diary, \"Thank heavens I'm not!\" (September 27, 1942).\n\nAnne suffers a great deal from the constant criticism of the other members of the group in hiding; she is confused herself and unable to understand fully the emotional suffering and horrible fears of both her own family and the Van Daans. In particular, though, Anne feels that her mother is not defending her sufficiently, and Anne resents the fact that she has always to keep so very quiet and restrain her adolescent impulse to \"sass people back.\"\n\nAnne also gives us a fairly detailed description of the washing and lavatory arrangements, which are far from ideal. Again, the stress in her relations with her family is not easy. Clearly, she feels a greater affinity with her father than with her mother, and it appears that there are various \"scenes\" and quarrels because of what her mother perceives as Anne's faults and failings. As always, Mr. Frank attempts to improve the situation and asks Anne to be more helpful in the house, but Anne stubbornly declines, preferring to concentrate her efforts on her schoolwork.\n\nThe war news filtering in from the outside is bad, and the little group in hiding hears that many of their Jewish friends have been taken away, crowded into cattle trucks and sent off to concentration camps, first in Holland, and then farther east, into Poland. Anne asks herself, \"If it is as bad as this in Holland, whatever will it be like in the distant and barbarous regions they are sent to? We assume that most of them are murdered. The English radio speaks of their being gassed\" (October 9, 1942).\n\nAn admirable attempt is made to celebrate the birthdays of the little group, and everyone tries to procure a little gift through the people in the office, who constitute their only link with the outside world. Generally, these gifts consist of items of food, but also they occasionally include such \"luxuries\" as flowers and books — things we take for granted, but which were precious for the little group in the \"Secret Annexe.\"\n\nAnne's relations with her family continue to fluctuate. On October 16, 1942, she writes, \"Mummy, Margot, and I are as thick as thieves again. It's really much better,\" and then she describes how she and Margot squeezed together into bed, letting one another read parts of their diaries — and also, girl-like, discussing their \"looks.\"\n\nThen on November 7, Anne writes: \"Mummy is frightfully irritable and that always seems to herald unpleasantness for me. Is it just a chance that Daddy and Mummy never rebuke Margot and that they always drop on me for everything?\"\n\nClearly, the situation of being in hiding in the midst of a busy city produces many hours of extreme fear and tension — especially for an adolescent girl. When a workman comes to fill the fire extinguishers in the house, his noises terrify the unsuspecting, frightened little group, and they fear that their hiding place has been discovered. Anne writes: \"My hand still shakes, although it's two hours since we had the shock\" (October 20, 1942).\n\nAnne further reveals the turmoil of her feelings about her family with startling frankness. \"I'm not jealous of Margot, never have been. I don't envy her good looks or her beauty. It is only that I long for Daddy's real love: not only as his child, but for me — Anne, myself\" (November 7, 1942). Anne feels again and again that her mother is unfair to her, and occasionally she feels that her mother is inadequate as a mother, yet Anne does try very hard not to pass too severe a judgment on her for this. Her remarks here, however, reveal a very perceptive and sensitive girl of thirteen: \"Mummy and her failings are something I find harder to bear than anything else. I don't know how to keep it all to myself. . . . I have in my mind's eye an image of what a perfect mother and wife should be; and in her whom I must call 'Mother' I find no trace of that image. . . . Sometimes I believe that God wants to try me, both now and later on; I must become good through my own efforts, without examples and without good advice. . . . From whom but myself shall I get comfort? As I need comforting often, I frequently feel weak, and dissatisfied with myself; my short-comings are too great. I know this, and every day I try to improve myself, again and again\" (November 7, 1942).\n\nAnne finds a great deal of solace in her diary; it is, in effect, her best friend, her confidante; she calls it \"Kitty,\" and on its pages she feels absolutely free to complain of her sense of frustration at not being able to give vent to her feelings. But, most of all, she feels frustrated because she has no real person whom she can truly confide in — and receive encouragement from — just through expressing her feelings. Only her diary can do that for her.\n\nUnder normal circumstances, Anne would probably have confided her feelings to a friend, but these were not normal circumstances, and the only outlet for Anne's emotions lay within the pages of the small, red-checkered, cloth-covered diary.\n\nIn addition, Anne also gives factual accounts of some humorous events that occur, such as the splitting of a seam on a sack of beans which Peter was carrying up the stairs, so that \"a positive hailstorm of brown beans came pouring down and rattled down the stairs . . . [I was] standing at the bottom of the stairs, like a little island in the middle of a sea of beans!\" (November 9, 1942). She also recounts the serious discussion which precedes the decision as to whether or not they should take in an eighth person, an elderly dentist, Albert Düssel, who will have to move into Anne's room because of a lack of space.\n\nLiving in such cramped conditions with seven other people is bound to take its toll on anyone, particularly when discovery means almost certain death, yet Anne always tries to accept their situation in a positive way and to keep her spirits up: \"Quite honestly, I'm not so keen that a stranger should use my things, but one must be pre-pared to make some sacrifices for a good cause, so I shall make my little offering with a good will. 'If we can save someone, then everything else is of secondary importance,' says Daddy, and he's absolutely right\" (November 19, 1942).\n\nThat very evening, bad news from outside reaches the group in the \"Secret Annexe,\" and Anne describes it vividly in her diary: \"When it is dark, I often see rows of good, innocent people accompanied by crying children, walking on and on, in charge of a couple of these chaps, bullied and knocked about until they almost drop.\" Despite the difficulties and privations of living in hiding, however, Anne realizes that she is far more fortunate than a great many of her friends: \". . . who have now been delivered into the hands of the cruelest brutes that walk the earth. And all because they are Jews!\" (November 19, 1942).\n\nThe Jewish festival of lights (Hanukah) occurs almost at the same time as the Dutch Festival of Saint Nicholas Day, and the members of the little group exchange gifts and light the traditional candles of the festival, although the group keeps them alight for only ten minutes because of the shortage of candles. Their \"protectors\" give them presents for the Dutch Festival of Saint Nicholas Day, attaching a little poem for each person and trying their best to lighten the tedium of their caged lives. And tedium it is — rarely, but occasionally, relieved. For instance, Anne describes the lengthy, prudent process whereby Mr. Van Daan prepares sausages, and then she tells in hilarious detail how the dentist, Mr. Düssel examines the hysterically nervous Mrs. Van Daan's teeth, reminding Anne of \"a picture from the Middle Ages entitled 'A Quack At Work'\" (December 10, 1942). She also describes the scene which she can see in the street below the window and the joy of the group in hiding at receiving extra rations of butter for Christmas. To divert themselves, they all talk about what they will do \"when the war is over\" although they do not forget to feel sorry for the people outside who are taken away from their homes each day, or are unable to obtain enough food.\n\nAs the weeks grow into months, the little group in the \"Secret Annexe\" has, as might be expected, its ups and downs, quarreling with one another and incessantly criticizing its youngest member, the spirited Anne (who often cries at night because of the group's irritable remarks). The members of the group also talk about their respective childhoods and occasionally laugh at funny remarks made — whether intentionally or not — by one or another of their number. The fact that the building in which they are hiding and which serves as offices is being sold to a new owner (the offices were only leased from the former owner) gives the group some cause for alarm, but the problem is finally overcome.\n\nAnd then more tedium sets in again, and as a diversion Anne and Margot are given card index boxes so that they can keep an account of the books they have read; Anne is also given a little notebook for foreign words she masters. Butter and margarine are distributed carefully and in rationed quantities to each person. At one point, Anne writes, \"Lately Mummy and I have been getting on better together, but we still never confide in each other\" (February 27, 1943). It is sometimes painful to read these intimate confessions.\n\nOn March 10, 1943, Anne mentions the bombing of Amsterdam by the planes of the Allies and the firing of the anti-aircraft guns, which disturb their sleep almost every night while they are in hiding. Although Anne knows that it is childish, she always creeps into her father's bed for comfort, unable to overcome her fears by herself.\n\nThe news from the outside world continues to raise — and then dash — the hopes of the group. On March 18, 1943, Anne writes excitedly that Turkey has entered the war, but the next day, it is announced that this is not, in fact, the case. Anne also describes a visit made by Hitler to wounded soldiers, a visit which is broadcast over the radio. She remarks, \"Listening in to it was pitiful. . . . One of them [the wounded] felt so moved at being able to shake hands with the Führer (that is, if he still had a hand!) that he could hardly get the words out of his mouth\" (March 19, 1943).\n\nBecause of the circumstances of being in strict hiding during the midst of the outside world's \"ordinary life,\" every small noise or sudden suspicion of being discovered is a cause for serious alarm for the group. Although the men of the group try to be chivalrous and protect the women from becoming so anxious, it is not always possible. Since the group is in the habit of using the offices downstairs in order to listen to the radio there, or go to the bathroom after the office and warehouse staff have gone home, they are more exposed to being discovered than if they had remained in their hiding place, behind the false bookcase, all the time. Whether or not the alarms and fears of a burglary which they occasionally experience are genuine or imagined, real terror is struck into the hearts of everyone, causing them all to cower in dread, trying to keep quiet. Anne recounts the effect which this has on them all and how none of them can sleep afterward because they are so afraid (March 25, 1943).\n\nAfter Anne confides to her diary, in a rather contemptuous way, about the real (or imagined) sickness of Mr. Van Daan, she changes the tone of her diary entry, giving the essence of a speech made by one of the German leaders in the Netherlands, declaring that the Nazis have decreed that a new objective within Holland will soon be \"cleaning out\" the various Dutch provinces of Jews. Anne notes that the terms which the \"German big shots\" use are reminiscent of those employed in getting rid of cockroaches, and then she revealingly remarks, \"These wretched people are sent to filthy slaughterhouses like a herd of sick, neglected cattle. But I won't talk about it, I only get nightmares from such thoughts\" (March 27, 1942).\n\nOnce again, the topic of Anne's relationship with her parents is discussed in her diary. She has unintentionally hurt her mother's feelings by refusing to say her prayers with her (because Anne's father cannot do so that night). Anne tries to reason with herself, feeling sorry for her mother, yet she refuses to apologize for saying what she considered to be the truth at the time about how she felt. Anne states quite clearly that her mother has alienated her with her \"tactless remarks and crude jokes, which I don't find at all funny\" (April 2, 1943). Later, that same month, Anne lists her quarrels with her mother as just one of the various clashes going on amongst all the members of the group, adding that \"everyone is angry with everyone else\" (April 27, 1943). At that time, the Allied air raids were increasing in intensity, and Anne writes, \"We don't have a single quiet night. I've got dark rings under my eyes from lack of sleep.\" In addition, the shortage of food is beginning to be even more acute although in her following entry (May 1, 1943), Anne reminds herself: \". . . it is a paradise compared with how other Jews who are not in hiding must be living.\"\n\nNevertheless, despite her realization that their situation is better than that of many other Jews, Anne is horrified by the drastic decline of their own standards. The comfortable life which they had lived beforehand, and even, to some extent, in the \"Secret Annexe\" has declined rapidly. Their former life contrasts starkly with the privations which they are suffering now, ranging from a lack of food, to the inability to change their sheets, or even to renew their diminishing stock of underwear. The nightly air raids continue, and Anne prepares a suitcase with the basic things she would need if she had to escape, though she realizes, at her mother's prompting, that there would be nowhere for her to escape to — absolutely nowhere.\n\nThe last entry before Anne's fourteenth birthday contains news from the outside world relating to an air battle between German and British planes. The group also learns about strict new regulations concerning Dutch university students which have been imposed by the Nazis. Anne also mentions the fact that the group in the \"Secret Annexe\" must burn its vegetable peelings and refuse every other day, even though the weather is quite warm, because they must not put anything in the garbage pails for fear that even this might lead to their discovery. She remarks: \"How easily one could be betrayed by being a little careless!\" (May 18, 1943). This innocent remark is bitterly ironic in view of the group's eventual fate.\n\nThe air raids continue to be as frightening as usual, but Anne and the others find relief in nervous laughter at the comical remarks of Mr. Düssel, especially when Mrs. Van Daan goes downstairs to Mr. Düssel's room, \". . . seeking there the rest which she could not find with her spouse,\" and Düssel receives her with the words, \"Come into my bed, my child!\"\n\nAnne remarks, \"This sent us off into uncontrollable laughter. The gunfire troubled us no longer, our fear was banished!\" (May 18, 1943).\n\nThis first year of Anne's diary has been eventful, to put it mildly. From being a normal Dutch girl going to school and having fun with her' friends, she has been forced to go into hiding and to be shut up with another seven individuals, unable to go outside, and live as other youngsters do. Apart from the problems which she experiences in her relations with her mother and her sister — problems which are fairly normal for any adolescent — she is also obliged to contend with the problems of being confined in a rather small area with a group of people who generally irritate and annoy her.\n\nIn addition to the difficulties of coping with her emotions and the changes in her body — another normal feature of adolescence — Anne has had to come to terms with the privations, the crowded and unsanitary conditions and — most especially — with the ever-constant fear of being discovered and hauled away to one of the Nazi death camps.\n\nThe voice of the somewhat spoiled young girl who begins the diary changes by the end of this first year to the voice of a young girl who is able to analyze situations and characters, find amusement rather than annoyance in the little incidents of daily life, and put them all down on paper in a vivid, graphic way. She decidedly has a way with words, and her delicate irony, the way she records conversations, and her ability to describe scenes all enable us to experience and see and feel what she herself is undergoing."}, {"url": "https://cet4.koolearn.com/20210527/853498.html", "page_content": "英语四级阅读练习及试题解析(十九)\n\nAs she walked round the huge department store,Edith reflected how difficult it was to choose a suitable Christmas present for her father.She wish that he was as easy to please as her mother, who was always delighted with perfume\n\nBesides,shoppong at this time of the year was a most disgreeable experience :people trod on your toes,poked you with their elbows and almost knocked you overin their haste to get to a bargain ahead of you.\n\nPartly to have a rest, Edith paused in front of a counter where some attracive ties were on display. \"They are real silk,\" the assistant assured her, trying to tempt her. \"Worth double the price.\" But edit knew from past experience that her choice of ties hardly ever pleased her father.\n\nShe moved on reluctantly and then quite by chance, stopped where a small crowd of man had gathered round a counter. She found some good quality pipes on sale-----and the prices were very reasonable. Edith did not hesitate for long : although her father only smoked a pipe occasionally, she knew that this was a present which was bund to please him.\n\nWhen she got home,with her small well-chosen present concealed in her handbag, her parents were already at the supper table. Her mother was in an especially cheerful mood, \"Your father has at last to decided to stop smoking.\" She informed her daughter.\n\n1.Edith's father _______.\n\na.did not like present\n\nb.never got present\n\nc.preferred ties\n\nd.was difficult to choose a present for\n\n2.The assistant spoke to Edith because she seemed_______.\n\na.attractive\n\nb.interested in ties\n\nc.tired\n\nd.in need of comfort\n\n3.Edith stopped at the next counter_________.\n\na.purosely\n\nb.suddenly\n\nc.unwillingly\n\nd.accidentally\n\n4.Edith's father smoked a pipe_______.\n\na.when he was obliged\n\nb.on social occasions\n\nc.from time to time\n\nd.when he was delighted\n\n5.Shopping was very disagreeable at that time of the year because_______.\n\na.coustomers trod on each other's toes\n\nb.coustomers poked each other with their elbows\n\nc.customers knocked each other\n\nd.customers were doing their shopping in a great hurry\n\n答案：dbdcd\n\n\n\n"}, {"url": "https://study.com/academy/lesson/anne-franks-diary-of-a-young-girl-themes-analysis.html", "page_content": "Anne's Maturing\n\nAnne started puberty when she went into hiding with her family. As she matured, the frivolous young girl that first went into hiding is replaced with an Anne that realized why her mother behaved as she did. She also realized her old self, her younger self, was too emotional.\n\n'I was furious at Mother (and still am a lot of the time). It's true, she didn't understand me, but I didn't understand her either. Because she loved me, she was tender and affectionate, but because of the difficult situations I put her in, and the sad circumstances in which she found herself, she was nervous and irritable, so I can understand why she was often short with me.'\n\nAnne realized that she has matured and grown. Her growth could be attributed to her constant communication with the adults, or the fact that she is dealing with constant fear and conflict, honing her into handling these situations with more grace.\n\n'When I think back to my life in 1942, it all seems so unreal. The Anne Frank who enjoyed that heavenly existence was completely different from the one who has grown wise within these walls.'\n\nAnne's Love and Sexuality\n\nAs she continued to mature, Anne was also discovering her sexuality and feelings. This resulted in her becoming curious about her body and her evolving feelings for Peter van Pels, a 16-year-old boy who also hid in the Annex. Although she waffled on whether she was actually in love, she did talk passionately about him and their time together.\n\n'Is it right? Is it right for me to yield so soon, for me to be so passionate, to be filled with as much passion and desire as Peter? Can I, a girl, allow myself to go that far?'\n\nThe feelings she had also led her think about sex and her body. She ended up describing her genitalia which has been the reason for a lot of controversy.\n\nAnne's Inner Conflict\n\nAnne frequently discussed the two different sides of her personality (calling them the two Annes); one side was frivolous and a clown for the public, and the other one that was more introspective and gentle. She didn't share the second Anne with anyone but Peter because she feared people's responses to this more mature Anne."}, {"url": "https://www.hellomagazine.com/royalty/20210411110669/princess-anne-special-bond-dad-late-prince-philip/", "page_content": "Prince Philip very sadly passed away on Friday aged 99. The royal was very close to his only daughter, Princess Anne, and had a special place in her father's heart. In honour of her beautiful father-daughter relationship, HELLO! has taken a closer look at Anne's bond with her father.\n\nMORE: Prince Philip's most memorable quotes and witty one-liners\n\nThe Princess Royal was born in 1950, a year after the Queen and the Duke of Edinburgh welcomed Prince Charles into the world. The royal couple went on to have their third and fourth children - Princes Andrew and Edward - almost a decade later.\n\n© Photo: Rex\n\nPrincess Anne was believed to be Prince Philip's favourite child\n\nClose friends and family have previously been open about Philip's relationship with his children - with many claiming that Anne is his favourite child. The Princess has inherited many qualities from her father, showing her love for sports and dedicating her life as a working royal. Eileen Parker, wife of Philip's close friend Mike Parker, previously revealed via Daily Mail: \"[Philip] always had more fun with Anne. Charles is more like the Queen, while Anne is very like Prince Philip.\"\n\nThe pair were very close\n\nOn the day Princess Anne was born - 15 August 1950 - Philip was promoted to the rank of lieutenant-commander in the Royal Navy. After the birth, he allegedly told everyone: \"It's the sweetest girl.\" When she was growing up in the royal household, Anne confessed that she didn't mind that her parents weren't around much.\n\nMORE: How Prince Philip was always the Queen's rock\n\nREAD: Prince Philip's sweetest family pictures with his children and grandchildren\n\n\"They were supportive and never really quibbled about what you wanted to do,\" she said, according to royal biographer Ingrid Seward. \"There were occasional comments like - 'Was that really a good idea?' I don't think that any of us for a second thought that she [the Queen] didn't care for us in the same way as any other mother did.\"\n\n© Photo: Getty Images\n\nPrince Philip and his daughter shared a love of sports\n\nHaving entered the public life at age 18, Anne has dedicated the majority of her time to serving her country. She is often hailed as one of the most hardest-working royals and also topped the list last year carrying out an astonishing 540 official duties both at home and overseas.\n\nIn 2017, Prince Philip announced his retirement at the age of 96 after 65 years of service. When Anne was asked about whether she would ever slow down on her commitments, she told the BBC in 2010: \"Look around at the members of my family who are considerably older than me and tell me whether they have set an example which suggests I might - unlikely.\"\n\nAnne opened up about her father for ITV\n\nIn a pre-recorded interview with ITV, the Princess Royal has admitted life will be difficult without him. \"Without him life will be completely different,\" she said. Of her the late royal's legacy, Prince Anne added: \"But from society's perspective he was able to keep pace with the kind of technological changes that have such an impact… but above all that it's not about the technology it's about the people.\"\n\nAnne was Philip's only daughter\n\nOut of all the Queen's children, Anne has been the most successful in leading an independent identity, both as a professional horsewoman and in her charity work. And in order to lead a relatively normal life, Anne turned down royal titles for her own children, Peter Phillips and Zara Tindall, knowing that her position in the line of succession would be moved down once her brothers had children.\n\nMake sure you never miss a ROYAL story! Sign up to our newsletter to get all of our celebrity, royal and lifestyle news delivered directly to your inbox."}, {"url": "https://www.historyextra.com/period/20th-century/anne-frank-diary-how-edited-hidden-pages-father-otto-what-she-really-wrote/", "page_content": "“I knew that Anne wrote a diary,” he said in a later interview . “But I must say I was very much surprised about the deep thoughts Anne had. It was quite a different Anne than I had known as my daughter. My conclusion is… that most parents don’t know, really, their children.”\n\nOtto Frank sifted through the documents – a chequered autograph book, an exercise book, a sheaf of loose papers. Their author, 15-year-old Anne Frank , had died of typhus in a German concentration camp a few months earlier, in spring 1945. Now Otto, her father, was reading words he had never imagined his daughter could write. As he read, he came to an unnerving conclusion: he had never really known her.\n\nBurdened with the responsibility of stewardship for his daughter’s words, Otto Frank would spend the rest of his life overseeing the publication and dissemination of Anne Frank’s diary. Along the way, though, his editorial decisions would inadvertently cover up the unsuspected depths he had discovered inside.\n\nAnne Frank (second from right) with her sister Margot, father Otto, and mother Edith, in Amsterdam, 1941. (Image by Alamy)\n\nBy the time the Frank family was arrested by the Gestapo in 1944, they had been in hiding in Amsterdam for two years. Anne and her sister, Margot, and their parents, Edith and Otto Frank, sought refuge on Prinsengracht 263 with Hermann van Pels, a business associate of Otto’s, along with his wife, Auguste, and their son, Peter. Fritz Pfeffer, a family friend, completed the group.\n\nTheir hiding place was the back portion of the building where Otto’s business still ran. Only a small group of Otto’s colleagues had any idea the building was also a sanctuary. The cadre of devoted workers risked their lives to provide Otto and his family with food and moral support.\n\nOtto’s editorial decisions would inadvertently cover up the unsuspected depths he had discovered inside\n\nOn 4 August 1944, their luck ran out. Though the identity of their betrayer has never been discovered, someone reported their existence to the Gestapo. During their arrest, the police ransacked their living quarters, taking everything of value. But they left behind a treasure, strewn in pieces along the floor: Anne’s diary.\n\nMore like this\n\nMiep Gies and Bep Voskuijl, two of Otto’s employees, gathered up the papers and stored them in a locked drawer. They planned to give them to Anne when she returned.\n\nShe never did. Less than a year later, the 15-year-old died of typhus at Bergen-Belsen concentration camp. Otto was the only survivor of the eight who had been in hiding. After Otto received news of his daughter’s death, Gies gave him the diary. Initially refusing to read them, he finally dove in.\n\nDid Anne’s father edit her diary?\n\nHe couldn’t stop reading. Anne’s words were a revelation to Otto. He began sharing translated portions of the diary with his mother, then telling others. Eventually, persuaded by a historian and a friend who convinced him the diary was a significant document, he agreed to seek publication.\n\nBut the manuscript that Otto Frank pitched to Dutch editors didn’t contain his daughter’s entire diary. Anne herself had begun editing large swathes of her diary with publication in mind after hearing a radio broadcast that called on Dutch people to preserve diaries and other war documents. Otto respected some of those editorial decisions, but overlooked others ­– for example, he included material about Anne’s crush on annexe dweller Peter van Pels.\n\nOtto made his own cuts, too: he removed passages in which Anne was critical of her parents’ marriage, and expurgated sections about sexuality and her often brutal comments about friends, family members and acquaintances. In an early passage from the diary that Otto eliminated completely from the first editions, Anne describes her classmates as everything from “a detestable, sneaky, stuck-up, two-faced gossip” to “pretty boring.”\n\nAnne's father Otto Frank, photographed c1967. (Image by Alamy)\n\nThe cuts made the book short enough for publication, but publishers were reluctant to release books about the Second World War for fear of alienating war-weary customers. Eventually, though, Otto found a publisher. Het Achterhuis (“The House Behind”) was published in 1947. It was an immediate success in Europe.\n\nBut English-language readers almost missed their chance to read the book. The French-language translation languished in a pile of rejected books at Doubleday in New York until editor Judith Jones chanced upon it. She encouraged her boss to acquire it and – with an English translation by Barbara Mooyaart-Doubleday, a cover that featured Anne’s photograph, and a foreword by former First Lady Eleanor Roosevelt – Anne Frank: The Diary of a Young Girl was published in English in 1952.\n\nIt was an instant success, gaining worldwide fame and soaring to immediate symbolism. It was especially revered for its impact among young readers. “As seen through Anne’s eyes,” wrote Mary Lane for The English Journal in 1956, “the evils of discrimination have made a terrific impact on these young people’s minds.” At the time, the events Anne recounted were so recent that Lane was able to write to Otto Frank and even visit Miep Gies in Amsterdam. But though readers like Lane said the book helped them see adolescents in a new light, they had no idea how much material Otto and his publishers had suppressed.\n\nAnne Frank's diary is displayed in 2016. (Photo by GUILLERMO LEGARIA/AFP via Getty Images)\n\nHoax, fraud or forgery?\n\nMeanwhile, the world wrangled over the Holocaust. As Anne’s diary garnered more and more readers and international fame, it became the target of deniers who argued it was a fraud or forgery. The very writing that had endeared Anne to generations of readers convinced some that the book had been written by an adult; others questioned the day-to-day accounts of life in the hideaway. Otto Frank sued some deniers, but they continued to publicise unfounded theories that he co-authored or even wrote the entire diary himself.\n\nThe excluded material screamed into the public consciousness when the contents of the five ‘suppressed pages’ became public\n\nHolocaust deniers, misinterpreting the results of libel and defamation lawsuits, published books and pamphlets claiming the diary was a hoax. In response to this speculation, the Netherlands Forensic Institute undertook an exhaustive forensic analysis of the diary in the early 1980s that proved the book had been written by Anne. Graphologists and others have reiterated those findings during a variety of analyses over the past six decades.\n\nThose forensic findings were published in 1989 along with new material in a comprehensive critical edition of the diary. The book also contained a tantalising reference to additional material that had been excluded at the Frank family’s request. A decade later, that material screamed into the public consciousness when the contents of the five “suppressed pages” became public.\n\nOtto Frank, who died in 1980, had given Cor Suijk, a former employee of the Anne Frank House, five additional pages of the diary for safekeeping. Suijk had let biographer Melissa Müller read the pages, and she included them in her 1998 book Anne Frank: The Biography. But before the book was published, the Anne Frank Fonds [a charitable foundation founded by Otto] in Switzerland sued Muller to prevent the pages from seeing the light of day. She was forced to paraphrase the pages in her book, and the original pages were only published in 2003 after Suijk gave them to the Netherlands Institute for War Documentation in exchange for a $300,000 donation to Suijk’s foundation.\n\n\n\nSexual anatomy and dirty jokes\n\nA glimpse at the five original pages explained Otto’s reluctance to publish them: they deal with Anne’s impressions of her parents’ marriage, which she characterised as “tepid”. And tiny fragments of new material continue to come to light: in 1995, an expanded version of the diary included Anne’s description of her own genitalia. And in 2016, conservators photographing the diary for preservation purposes realised that brown paper inside the diary was actually pasted over two pages of dirty jokes and information on sex education.\n\nRevelations that Anne Frank wrote about sexual anatomy, masturbation, menstruation, same-sex attraction and scatology [the study of faeces] complicate readers’ image of the teenage author, who spent two formative years in hiding and whose journey to adulthood was cut tragically short. (They have also fuelled censorship attempts, as when a Michigan mother petitioned for the book’s removal from a seventh-grade classroom, and when a Virginia school district began assigning a version of the book that did not include the passage about Anne’s genitalia.)\n\nTwo unknown pages of Anne Frank's diary are presented during a press conference in 2018. (Image by BAS CZERWINSKI/AFP via Getty Images) Two unknown pages of Anne Frank's diary are presented\n\nA legacy misunderstood?\n\nBut perhaps more insidious are the ways in which readers have misinterpreted Anne Frank’s legacy over time. The most well-known quote from her book: “In spite of everything, I still believe that people are really good at heart,” has been upheld as evidence of hope for humanity despite the horrors of the Holocaust. But Anne actually penned the words at the end of a long, introspective entry in which she examines loneliness, fear and the increasing terror of war.\n\n“It’s utterly impossible for me to build my life on a foundation of chaos, suffering and death,” she wrote in the same entry. “I see the world being slowly transformed into a wilderness, I hear the approaching thunder that, one day, will destroy us too, I feel the suffering of millions.”\n\nTwenty days after she penned her most famous words, Anne and her family were arrested. She spent the rest of her brief life on the move, transported between concentration and death camps in Europe and separated from her mother, her father, and friends. She died less than a year later, in circumstances that prove the prescience of her observations about suffering and persecution.\n\nAnne Frank is arguably the Holocaust’s most famous victim, says Erin Blakemore. (Image by Alamy)\n\nToday, Anne Frank is arguably the Holocaust’s most famous victim, but her fame risks overshadowing the up to 1.5 million Jewish children thought to have been murdered during the genocide. Ironically, those who would uphold her as a martyr needn’t look farther than her own diary for proof of how ill-suited she was for the role. Her words – censored or restored – portray a changeable, sly, flawed, curious, restless youth, one who would have denied she stood for all.\n\nAnne Frank’s real diary challenges the sainted image attributed to her by those who would have her symbolise all of those murdered and uprooted by hatred, even as they force readers to acknowledge the depth and nuance of the children in their lives. As she wrote in one of her last entries in 1944, “I haven’t got the reputation of being a ‘little bundle of contradictions’ for nothing!”\n\nAdvertisement\n\nErin Blakemore is a journalist based in the US and the author of The Heroine's Bookshelf (Harper, 2010). Find out more at erinblakemore.com"}, {"url": "https://www.testbig.com/practice/sat-reading-khan-diagnostic-quiz-level-4-reading-2", "page_content": "Questions 1-11 are based on the following\n\npassage.\n\n\n\nThis passage is excerpted from J.D. Beresford, The Looking Glass. Originally published in 1921.\n\n"}, {"url": "https://www.britannica.com/biography/Anne-Frank", "page_content": "On August 4, 1944, Anne Frank’s family’s hiding place was discovered by the Gestapo , and she was taken to Auschwitz in Nazi-occupied Poland before being transferred to Bergen-Belsen in Germany. According to the Dutch government, Anne died during a typhus epidemic in March 1945. Other research suggests she might have perished in February that year.\n\nThrough her diary, Anne Frank is shown to be insightful, humorous, and intelligent. Many entries involve typical adolescent issues—jealousy toward her sister; annoyance with others, especially her mother; and an increasing sexual awareness. Anne also discussed her hopes for the future, which included becoming a journalist or a writer.\n\nAnne Frank, a Jewish teenager, wrote a diary of her family’s two years in hiding (1942–44) during the German occupation of the Netherlands in World War II , and the book—which was first published in 1947, two years after Anne’s death in a concentration camp —became a classic of war literature, personalizing the Holocaust .\n\nAnne Frank, in full Annelies Marie Frank, (born June 12, 1929, Frankfurt am Main, Germany—died February/March 1945, Bergen-Belsen concentration camp, near Hannover), Jewish girl whose diary of her family’s two years in hiding during the German occupation of the Netherlands became a classic of war literature.\n\nEarly in the Nazi regime of Adolf Hitler, Anne’s father, Otto Frank (1889–1980), a German businessman, took his wife and two daughters to live in Amsterdam. In 1941, after German forces occupied the Netherlands, Anne was compelled to transfer from a public school to a Jewish one. On June 12, 1942, she received a red-and-white plaid diary for her 13th birthday. That day she began writing in the book: “I hope I will be able to confide everything to you, as I have never been able to confide in anyone, and I hope you will be a great source of comfort and support.”\n\nWhen Anne’s sister, Margot, was faced with deportation (supposedly to a forced-labour camp), the Franks went into hiding on July 6, 1942, in the backroom office and warehouse of Otto Frank’s food-products business. With the aid of a few non-Jewish friends, among them Miep Gies, who smuggled in food and other supplies, the Frank family and four other Jews—Hermann and Auguste van Pels and their son, Peter, and Fritz Pfeffer—lived confined to the “secret annex.” During this time, Anne wrote faithfully in her diary, recounting day-to-day life in hiding, from ordinary annoyances to the fear of capture. She discussed typical adolescent issues as well as her hopes for the future, which included becoming a journalist or a writer. Anne’s last diary entry was written on August 1, 1944. Three days later the annex was discovered by the Gestapo, which was acting on a tip from Dutch informers.\n\nThe Frank family was transported to Westerbork, a transit camp in the Netherlands, and from there to Auschwitz, in German-occupied Poland, on September 3, 1944, on the last transport to leave Westerbork for Auschwitz. Anne and Margot were transferred to Bergen-Belsen the following month. Anne’s mother died in early January, just before the evacuation of Auschwitz on January 18, 1945. It was established by the Dutch government that both Anne and Margot died in a typhus epidemic in March 1945, only weeks before the liberation of Bergen-Belsen, but scholars in 2015 revealed new research, including analysis of archival data and first-person accounts, indicating that the sisters might have perished in February 1945. Otto Frank was found hospitalized at Auschwitz when it was liberated by Soviet troops on January 27, 1945.\n\nFriends who searched the hiding place after the family’s capture later gave Otto Frank the papers left behind by the Gestapo. Among them he found Anne’s diary, which was published as Anne Frank: The Diary of a Young Girl (originally in Dutch, 1947). Precocious in style and insight, it traces her emotional growth amid adversity. In it she wrote, “I still believe, in spite of everything, that people are really good at heart.”\n\nThe Diary, which has been translated into more than 65 languages, is the most widely read diary of the Holocaust, and Anne is probably the best known of Holocaust victims. The Diary was also made into a play that premiered on Broadway in October 1955, and in 1956 it won both the Tony Award for best play and the Pulitzer Prize for best drama. A film version directed by George Stevens was produced in 1959. The play was controversial: it was challenged by screenwriter Meyer Levin, who wrote an early version of the play (later realized as a 35-minute radio play) and accused Otto Frank and his chosen screenwriters, Frances Goodrich and Albert Hackett, of sanitizing and de-Judaizing the story. The play was often performed in high schools throughout the world and was revived (with additions) on Broadway in 1997–98.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nA new English translation of the Diary, published in 1995, contains material that was edited out of the original version, which makes the revised translation nearly one-third longer than the first. The Frank family’s hiding place on the Prinsengracht, a canal in Amsterdam, became a museum that is consistently among the city’s most-visited tourist sites."}, {"url": "https://study.com/learn/lesson/anne-otto-diary-of-a-young-girl-anne-frank-overview-relationship.html", "page_content": "Additional Info\n\nThe Diary of Anne Frank\n\nIn 1942, Anne Frank and her family were living in the Netherlands, where they immigrated to run from the Nazi threat in Germany. However, even in the Netherlands the Frank family eventually had to go into hiding to escape capture. They manage to hide in the back of the business owned by Otto Frank (Anne's dad). Anne's family, another family of four, and one more man, hid in this Secret Annex for two years. The close proximity and fear created a constant tension between the people, especially for Anne, who was the youngest at 13. Anne wrote of the experience, and of her fears, in her journal. She states at the very beginning of their hiding 'Not being able to go outside upsets me more than I can say, and I'm terrified our hiding place will be discovered and that we'll be shot. That, of course, is a fairly dismal prospect.' The maturity at such a young age is obvious.\n\nA Young Girl in Captivity\n\nAs Anne adjusts to living in captivity, she struggles to adapt to not being with her friends and living in such a quiet place. The inability to make noise, and the terror that making too much noise will result in the family being captured, leaves her constantly worried and stressed. Anne starts to feel separate from her family, especially her mother Edith, and her sister Margot. Margot is treated in a gentler fashion while Anne is picked on incessantly. 'She bawled me out again, and the whole family wound up getting involved. I don't fit in with them, and I've felt that clearly in the last few weeks.' Although there is no other account of this family's time in the Annex, it's clear the stress has made this family struggle.\n\nAnne and Otto's Relationship\n\nAlthough Anne feels disparate from her mother and sister, she still speaks fondly of her father, yet unfortunately you see that there is still a caveat on how even her dad treats her. She writes, 'Daddy's the only one who understands me, now and again, though he usually sides with Mother and Margot.' Anne however also noted something else after this passage, perhaps realizing that she was unfair to the father she loved so much. 'Daddy's always so nice. He understands me perfectly, and I wish we could have a heart-to-heart talk sometime without my bursting instantly into tears.' The challenge of puberty and being so young likely makes Anne incredibly emotional, during a time when emotion is just an added stress to the constant fear."}]}