{"Rusty Stevens is best known for his role as Larry Mondello on the television series Leave It to Beaver.": [{"url": "https://www.goodolddays.com/stories/jerry-mathers-searched-for-decades-to-reunite-with-larry-mondello/", "page_content": "Jerry Mathers Searched For Decades To Reunite With Larry Mondello\n\nsource: IMDB\n\nRusty Stevens is best known for his role as Larry Mondello, the best friend of “The Beaver” on the classic American sitcom “Leave It to Beaver.” However, before his work on that show, Stevens had a successful career as a child actor, appearing in numerous television shows and films in the 1950s and early 1960s.\n\nOne of Stevens’ final roles from this era was on the popular Western series “The Rifleman.” He appeared in the show’s fourth season in an episode titled “The High Country,” which aired in 1962. In the episode, Stevens played a young boy named Billy Gibbs, who befriends the show’s main character, Lucas McCain, played by Chuck Connors.\n\nAfter his work on “The Rifleman,” Stevens largely disappeared from the public eye, and nobody was able to track him down for nearly two decades. It was not until the 1980s, when Jerry Mathers, Stevens’ former co-star on “Leave It to Beaver,” was working on the reunion movie “Still the Beaver,” that he was able to locate Stevens and bring him back into the spotlight.\n\nMathers’ search for Larry was a personal one, as the two had become close friends during their time on “Leave It to Beaver.” They had spent countless hours on set together, playing pranks and goofing around between takes, and they had formed a strong bond that continued even after the show ended.\n\nAs Mathers recalled in an interview with People magazine, “We were always together. He was the guy I did everything with, and we remained friends after the show ended. But then, suddenly, he was gone.” Despite the years that passed, Mathers never gave up hope of finding his friend.\n\nStevens’ return to the world of “Leave It to Beaver” was a welcome one for fans of the show. His portrayal of Larry Mondello had been a key part of the show’s early seasons, and his friendship with Jerry Mathers was an important aspect of the show’s charm.\n\nIn “Still the Beaver,” Stevens reprised his role as Larry Mondello, who had grown up to become a successful businessman. The reunion movie was a hit with fans, and it led to Stevens making three guest appearances on “The New Leave It to Beaver,” which followed the Cleaver family as they navigated life in the 1980s.\n\nFor Stevens, returning to the world of “Leave It to Beaver” was a chance to reconnect with his former co-stars and revisit a beloved character from his past. He later recalled in an interview with the Los Angeles Times, “I had such a good time doing it. We were like a family, and it was great to be back with everyone.”"}, {"url": "https://celebcritics.com/rusty-stevens/", "page_content": "Who is Rusty Stevens?\n\nRusty Stevens is an American former child actor most fondly remembered for his role as “Larry Mondello” in the original Leave It to Beaver TV series.\n\nRusty Stevens appeared in 68 of the show’s 234 episodes between 1957 and 1960 and amassed a great fan base for his hilarious role. However, many fans were disappointed as he left the show in the middle of its fourth season.\n\nThere are so much misinformation and speculations regarding Rusty Stevens whereabouts. Why did Rusty Stevens suddenly leave the show he was doing so good on?\n\nRusty Stevens Biography\n\nAs a Leave It To Beaver fan, we know you have so many questions. So today, we shall try to answer all these questions in this article. So, please make sure that you read the article till the end!\n\nQuick Facts\n\nFull name Robert Rusty Stevens Nickname Rusty Birthday November 25, 1948 Age 74 years old Sun sign Sagittarius Traits Positive- Loving, Energetic, and Adventurous\n\nNegative- Impulsive, Impatient, and Careless Birthplace Boston, Massachusetts, USA Currently Residing New Jersey, USA Marital Status Married Spouse Theresa Marinelli (wife) Profession Actor, Salesman Net Worth USD 2 million Quick Facts\n\nInteresting facts\n\nRusty Stevens hadn’t told his wife he had been a child actor. So, when a detective tracked him down in the ’80s when CBS wanted Stevens for its sequel Leave It to Beaver, his wife assured the detective that he had the wrong house.\n\nRusty served in the U.S. Army in 1969 with a military occupational specialty of armor. Though the Vietnam War was in full swing, he never got orders to serve there. So instead, he served in Daley Barracks, Border Guard Unit, Bad Kissingen, West Germany.\n\nEarly Life and Childhood\n\nRusty Stevens was born in Boston, Massachusetts, on November 25, 1948. He grew up in the loving care and protection of his parents.\n\nStevens was a normal kid who attended school and sold newspapers during his free time. He hadn’t acted in a school play or a church skit. However, as his mother admitted, he loved to watch movies and TV Westerns and act out the parts around the house.\n\nRusty Stevens childhood photo\n\nSo, Rusty had been selling newspapers for ten months without anyone paying attention when a children’s talent scout named Lola Moore noticed him. As Lola mentioned, she liked Rusty’s style. Undoubtedly, Stevens’ parents were shocked. Rusty’s mother even gave an interview to the newspaper The Valley Times in 1957, which was the very newspaper her son had been selling. She said,\n\n“The studio people say he’s a real discovery.”\n\nThat was how Rusty made his TV debut on Leave It to Beaver. He became an instant celebrity as many audiences loved his role as Larry Mondello.\n\nRomantic Affairs and Relationships\n\nTheresa Marinelli (Rusty Stevens’ Wife)\n\nStevens is happily married to Theresa Marinelli. They also have one child together.\n\nCareer\n\nRusty began his career as a child actor in the hit TV series Leave It to Beaver. His role as a mischievous plump boy named Larry Mondello won the heart of many fans. Stevens appeared in 68 of the show’s 234 episodes as Theodore “Beaver” Cleaver’s young friend.\n\nAdditionally, the star child also acted in many TV series. According to IMBD, My Three Sons, Perry Mason, and National Velvet are some of the TV shows played by Rusty.\n\nThere was no doubt that Stevens would have made a name for himself in the movie industry had he continued working in his field. But instead, he suddenly left the show, which had given him celebrity status.\n\nAfter he stopped appearing as Larry Mondello, the latest TV appearance he made was in The Rifleman in 1963. After a long time, Rusty reappeared in the 1983 made-for-television reunion movie Still the Beaver.\n\nJerry Mathers searched for decades to reunite with Rusty Stevens.\n\nAfter Rusty Stevens’s parents ended his contract with the show Leave It to Beaver and left Los Angeles, it seemed like everybody forgot about Rusty. However, his old friend and co-star Jerry Mathers had not forgotten his dear friend.\n\nRusty Stevens and Jerry Mathers from Leave It to Beaver\n\nHe kept searching for his old friend and was deeply frustrated when he couldn’t find him. In an interview with The Pantagraph in 1982, Mathers said,\n\n“Nobody could find him for the longest time. Everybody lost touch with him.”\n\nHowever, Mathers did not lose hope and left no stone unturned to find his old buddy. Finally, he succeeded in finding Stevens, who was in New Jersey, working as a car insurance salesman.\n\nSo, Jerry persuaded Rusty to participate in 1983 Leave It To Beaver reunion movie, and Rusty did three guest spots on episodes of The New Leave It To Beaver, making his final TV role the same as the first. From then on, the pair of best buddies never lost touch again.\n\nRusty Stevens Movies List\n\nMovie Released Year Role The New Leave It To Beaver 1983-1989 Larry Mondello Still the Beaver 1983 Larry Mondello The Rifleman 1963 Melvin Wagon Train 1962 Johnny Perry Mason 1962 Brucie Hillman My Three Sons 1962 Cletus Bleeker National Velvet 1961 Alvy’s Friend The Jim Backus Show 1961 Alexander ‘Sandy’ Cleaver Angel 1957-1969 Leave It to Beaver 1957-1960 Larry Mondello Shirley Temple’s Storybook 1960 Stuffy Cole/ Gypsy Boy 77 Sunset Strip 1960 Max Cimarron City 1958 Boy Reading Script Cat On A Hot Tin Roof 1958 Sonny Telephone Time 1958 Fat Boy Racket Squad 1951 Detective Steve\n\nControversy\n\nRusty Stevens had gained massive popularity for his role as Larry Mondello. Undoubtedly, he would go on to achieve great heights in his acting career. However, things took an unexpected turn when Rusty’s parents suddenly moved from Burbank to Philadelphia.\n\nIt was in the middle of the 4th season when the show’s producers announced that Rusty would no more appear in the show. This left many of his fans surprised, and they couldn’t understand why he left in the middle of the show.\n\nRusty as Larry Mondello from Leave It to Beaver\n\nLater, Barbara Billingsley, who played June Cleaver in the series, said in a TV Archive interview that Stevens was fired because his overbearing mother caused grief for the producers. She said,\n\n“We all loved Rusty so much. He was so good in that role, and unfortunately, they had to let him go because his mother was such a pain in the neck.”\n\nHowever, the former child actor later revealed that it was he who had wanted to leave the show. According to Rusty himself, the truth is that as his character Larry Mondello became more popular on the show, he was signed to a contract by the show producers. At that time, aside from the cast members, he was the only other actor to be under contract.\n\nAt first, Stevens loved spending most of his time at the studio. However, he started missing his everyday life, where he would go to school and spend time with his family. Rusty kept the frustration inside for a while, but later, he told his parents that he couldn’t handle it anymore.\n\nRusty said he didn’t know to what length his mother might have gone to help him. But eventually, the show producers released him from his contract.\n\nRusty Stevens Net Worth\n\nRusty Stevens was one of the most famous child artists of the 1950s. He was one of the most loved and entertaining characters on popular TV shows.\n\nSo, based on all the available facts about the famous actor, his net worth as of 2023 is estimated at USD 2 million.\n\nFAQs"}, {"url": "https://biographyonair.com/rusty-stevens/", "page_content": "Updated on: May 25, 2023\n\nWho is Rusty Stevens?\n\nRusty Stevens is a former child actor. Rusty Stevens is known for his role as Larry Mondello, Theodore “Beaver” Cleaver’s young friend, in the original Leave it to Beaver television series.\n\nStevens first appeared in 1967 of the show’s 234 episodes, between 1957 and 1960.\n\nWhen was Rusty Stevens Born? Age, Birthplace, Parents\n\nSteven was born on November 25, 1948. As of 2023, he is 74 years. He was born in Boston, Suffolk County, Massachusetts, USA. His real name is Robert Stevens.\n\nHis father’s name is Gene Simmons and his mother’s name is Shannon Tweed. He has a sibling, Her name is Sophie Simmons. Speaking of childhood Steven had a normal childhood. According to his mother, he never participated in school play however he really likes to watch dramas and movies on the TV.\n\nWhat ethnicity is Rusty Stevens? Nationality\n\nStevens holds American nationality. There is no information on his ethnicity.\n\nHis zodiac sign is Sagittarius. Speaking of the religion he follows, he has not disclosed any information regarding the belief on which his faith lies.\n\nEducation, Schooling, University\n\nStevens likes to keep his private life secret away from the public eye. He has not shared any information regarding his educational background with the public.\n\nHowever, looking at his achievement, he seems well-educated.\n\nProfessional Life, Career\n\nSpeaking of career, Stevens made his acting debut at the age of three in 1951, in the episode The Case of the Vain Woman of the TV series Racket Squad, alongside Reed Hadley and Christine McIntyre. After a few years, he was seen again in the TV series Telephone Time’s episode The Frying Pan (1957).\n\nSteven began his career as a child actor in the hit TV series Leave It to Beaver. In the series, his character was a mischievous plump boy named Larry Mondello. With this series, he won the hearts of many fans. He appeared in 68 of the show’s 234 episodes as Theodore “Beaver” Cleaver’s young friend.\n\nSimilarly, the actor acted in many other TV series including Angel (1960), My Three Sons (1962), Perry Mason (1962), Wagon Train (1962), and The Rifleman (1963).\n\nEveryone believed that stevens would have made a name for himself in the movie industry had he continued working in his field. However, he suddenly left the show, which had given him a lot of fans. According to Barbara Bilingsley, co-actor, the producer of the series fired him because his overbearing stage mother caused trouble.\n\nAfter the series, in 1963, he made his latest TV appearance in The Rifleman. then after two decades, he appeared in the television reunion movie Still the Beaver.\n\nFun Facts\n\nRusty hadn’t told his wife he’d been a child actor, so when a detective located him in the 1980s when CBS was looking for Steven for the sequel Leave it to Beaver, his wife told the detective that he was at the wrong house.\n\nRusty joined the United States Army in 1969, with the military occupational specialty of armor. He never received orders to serve in Vietnam while the war was in full flow, so he was instead appointed in Daley Barracks, Border Guard Unit, Bad Kissingen, Wet Germany.\n\nWhat is the Networth of Rusty Stevens? Salary, Earnings\n\nRegarding the net worth of Rusty, it is estimated to be 10 million. Not many things are known about Rusty, However, from the assets they possess it seems like he has been living a decent life.\n\nRelationship of Rusty Stevens\n\nStevens has got quite a number of fans and followers. And his fans and followers are curious to know about his love life.\n\nSpeaking of which, Rusty is a married man. He married a lovely lady, her name is Theresa Marinelli. The couple is very happy and living a life full of love.\n\nThe lovely couple has one child. However, the couple has not disclosed any information on their child.\n\nRumors and Controversy of Rusty Stevens\n\nWhen Rusty suddenly left the show, Leave It to Beaver, which had given him a lot of fans. At first, it was rumored that Rusty had to leave the show because they had moved out.\n\nBut later in an interview Barbara Bilingsley, co-actor opened up and told that the producer of the series fired him because his overbearing stage mother caused trouble.\n\nHow Tall is Rusty Stevens? Height, Weight, Hair color, Eye color\n\nRusty is 5 feet 6 inches (1.67m) tall. He has a fit and healthy body, However, there is no information regarding his weight. He has dark brown eyes and grey hair due to old age.\n\nSocial Media Presence\n\nUnfortunately, Rust is not active on any social platforms. It seems like the actor like to keep his private life low-key.\n\nAlso Read: Marc Labelle, John Haack, Matt Nathanson"}, {"url": "https://biographymask.com/rusty-stevens/", "page_content": "Rusty Stevens is a popular actor. Rusty Stevens is an American retired child actor. We recognize him for his role as Larry Mondello, Theodore “Beaver” Cleaver’s young friend, in the original television series ‘Leave It to Beaver’.\n\nEarly Life\n\nRusty Stevens was born on November 25, 1948, in Massachusetts, Boston United States of America. He is 75 years old. Currently, he lives in New Jersey, USA. Stevens grew up in a loving and happy household.\n\nStevens has a younger brother named, Rory Stevens. His parents raised him with great love and support. Despite this, Rusty’s parents’ names are not mentioned yet. However, Stevens is known for his acting and great roles.\n\nSince, when he was a child, his mother said he loved watching movies, and western TV shows. Sometimes he also acts as part of the show in front of his parents.\n\nRegarding his education, he was a regular kid who attend school and did well in his studies. During his free time, he used to sell newspapers.\n\nRusty Stevens – Net Worth 2023\n\nRusty Stevens, was one of the most loved and famous child actors of the 1950s. He was famous for his popular TV show series. However, his net worth is estimated at $5 million.\n\nCareer\n\nSince Rusty had been selling the newspaper, the child’s talent scouts recognized him and likes his style. In the meantime, when she told her parents about Rusty’s style, they were surprised.\n\nAfter some time, his mother gave an interview in the same newspaper, where Stevens has been selling the newspaper. Like this, he made his first debut in Television series.\n\nIn 1951, at 3, Stevens made his acting debut in “The Case of the Vain Woman,” a Racket Squad episode starring Christine McIntyre and Reed Hadley. He reappeared in the 1957 television episode “The Frying Pan” of the Telephone Time series after a brief absence.\n\nRusty portrayed the character of Theodore “Beaver” Cleaver (played by Jerry Mathers). His family moved from Burbank to Philadelphia, so he left the show in 1960.\n\nThey resurrected the sitcom The New Leave It to Beaver, which ran from 1984 to 1985 on the Disney Channel and from 1986 to 1989 on TBS. He was active overseas as well. Armed Forces began in 1969 with armor as a military occupational specialty (tanks).\n\nBrand Endorsements\n\nEveryone likes Rusty Stevens. Over the course of his career, he has produced excellent work. His extraordinary work is admired and inspiring by many people worldwide. His brand endorsement, however, is still being explored. Soon, we’ll inform you.\n\nRusty Stevens is yet to be shortlisted for any of the awards. However, many people love his work and acting.\n\nRelationship Status\n\nRusty Stevens has kept his personal and love life private. However, he is a married man. He married Theresa Marinelli. This beautiful couple has one child. They are living happily however, there is not much information about his family.\n\nScandals\n\nAccording to sources, Rusty Stevens, left the show in 1960 because his family shifted to Philadelphia. Also, many sources stated they fired him because his mother made unreasonable demands to the producer of the TV shows.\n\nPhysical Appearance\n\nStevens has not been open about his height and his health. However, he seems to be the person with gray hair and a wrinkled face, because of his old age. We hope he is living a healthy and happy life.\n\nRusty Stevens – Social Media\n\nRusty Stevens is a very private person. He doesn’t seem to be active on any social media. However, we found his Instagram with the name @rwstevens with 162 followers. Meanwhile, his account is private."}, {"url": "https://www.looper.com/915549/the-only-actors-still-alive-from-the-cast-of-leave-it-to-beaver/", "page_content": "The Only Actors Still Alive From The Cast Of Leave It To Beaver\n\n\"Ward, I'm worried about the Beaver.\" No, there's not an actual beaver involved. \"The Beaver\" is simply the nickname for Theodore Cleaver, the main character of the 1957-1963 family sitcom \"Leave It to Beaver.\" The nickname is derived from Beaver's older brother, Wally, being unable to pronounce \"Theodore\" correctly at the time of Beaver's birth. Whenever Beaver's mom, June (the late Barbara Billingsley), went to her husband, Ward (played by the late Hugh Beaumont), with concerns about their son, viewers knew they were in for some sort of \"golly, gee\" predicament poor Beaver had inevitably gotten himself into — and that dear old Dad would have to fix.\n\nWe can look back on \"Leave It to Beaver\" as a quintessential image of mid-20th-century aesthetics — the good, which changed television forever, and the cringe, which wasn't OK then and isn't now. On the one hand, the show's sitcom format was foundational for the genre in a way countless other shows have emulated since. On the other hand, its rosy-tinted, picture-perfect suburban America was a filtered view, one in which its citizens were overwhelmingly white and gender roles were unwaveringly rigid.\n\nWith \"Leave It to Beaver\" airing in the infancy of television itself, many decades have passed and much of its adult cast has unfortunately passed away. However, since the show focused so prominently on children, many of its cast members were quite young at the time the show aired and are still alive today. Let's take a look at who's still around from the show."}, {"url": "https://prabook.com/web/rusty.stevens/1914666", "page_content": "Rusty Stevens\n\nActor\n\nDecember 25, 1948 Boston, Suffolk County, United States of America\n\nStevens appeared in 68 of the show\"s 235 episodes, between 1957 and 1960. After 1960, Stevens appeared in a handful of television episodes on other shows, including the National Broadcasting Company family drama National Velvet. He was also cast as a schoolboy bully on an episode of American Broadcasting Company\"s The Rifleman. Stevens briefly returned to the screen when he reprised his role as Larry Mondello in the 1983 made-for-television reunion movie, Still the Beaver, and for three episodes of The New Leave lieutenant to Beaver."}, {"url": "https://ecelebrityfacts.com/where-is-larry-mondello-from-leave-it-to-beaver/", "page_content": "American sitcom, Leave It to Beaver chronicled the adventure of a curious and naïve boy, Theodore “The Beaver” Cleaver (Jerry Mathers), in a typical suburban neighborhood. Beaver was accompanied by Wally Cleaver (Tony Dow), Eddie Haskell (Ken Osmond) and Larry Mondello (Robert “Rusty” Stevens).\n\nWhere is Robert “Rusty” Stevens, who played Larry Mondello Now?\n\nStevens portrayed the role of Larry Mondello for the three seasons. He appeared in 68 of the show’s 235 episodes. Larry was not the brightest kid in school, but he was often responsible for getting Beaver into trouble.\n\nStevens was born on November 25, 1948, in Boston. He had appeared in several other shows before appearing on Leave It to Beaver. Robert left Leave It to Beaver in 1960 because his family moved to Philadelphia. And the show he played on was shot in Burbank.\n\nWhere is Eddie Haskell from Leave it to Beavers Now? Ken Osmond’s Net Worth\n\nIn a TV Archive interview, Barbara Billingsley, who portrayed June Cleaver on the show, said that he was dropped because his mother caused grief for the series producers.\n\nHe appeared in a few TV shows after moving to Philadelphia. He reprised his role of Larry in the 1983 TV movie Still the Beaver and for three episodes of The New Leave It to Beaver. Stevens married Theresa Marinelli. The couple share one child.\n\nIn 2000, the 71-year-old worked as an insurance salesman in New Jersey. Later,\n\nWhere is Leave it to Beaver Actor Jerry Mathers Now?"}, {"url": "https://doyouremember.com/153789/jerry-mathers-searched-rusty-stevens", "page_content": "Jerry Mathers is best known for his role as Theodore “Beaver” Cleaver in Leave It to Beaver. Now, Jerry is admitting that he spent decades looking for one of his co-stars. He searched for Rusty Stevens, who played Larry Mondello on Leave It To Beaver for several years in the late ’50s. His final appearance was on The Rifleman‘s Halloween special in 1963.\n\nHe seemingly disappeared after that. Rusty left Los Angeles and everyone lost touch with him. Eventually, Jerry was able to find Rusty. He was working as a car insurance salesman in New Jersey. Jerry convinced him to appear in the Leave It to Beaver reunion movie in 1983 called Still the Beaver.\n\nJerry Mathers searched for years until he found former co-star Rusty Stevens\n\nAccording to Leave It to Beaver star Barbara Billingsley, Rusty was fired from the show because his mother was causing problems on the set! This could be why his parents took him away from Hollywood. Not much is known about his whereabouts these days, but he would be in his 70s now.\n\nRELATED: Tony Dow, Star Of ‘Leave It To Beaver’ Has Been Hospitalized\n\nWhen asked about the show, Jerry said he loved working with his co-stars, including Rusty and shared his favorite episode. He said, “I like the one where I climb up into the soup bowl. That was fun. The show was just a great adventure with a lot of adults around and we just had a good time.”\n\nWhat’s your favorite Leave It to Beaver episode?"}, {"url": "https://www.celebsages.com/rusty-stevens/", "page_content": "Birth Name: Rusty Stevens Occupation: TV Actor Born In: Massachusetts, United States Birthdate: November 25, 1948 Age: 74 years old (as of 2023) Ethnicity: Unknown Nationality: American Sexuality: N/A\n\nRusty Stevens was born on the 25th of November, 1948. He is known for being a TV Actor. He co-starred with Tony Dow on the television series, Leave it to Beaver. Rusty Stevens’s age is 74. American television actor who is best remembered for his child role as Larry Mondello in the television series, Leave it to Beaver. The 74-year-old tv actor was born in Massachusetts, United States. He started his role on Leave it to Beaver in 1957 and stood through 1960 before moving from Burbank to Philadelphia. He reprised his role as Larry Mondello in the 1983 reunion television movie, Still the Beaver.\n\nCountdown to Rusty’s next birthday.\n\nRusty Stevens is a Sagittarius and his 75th birthday is in .\n\nJUMP TO: Rusty Stevens’s biography , facts , family , personal life , zodiac , videos , net worth , and popularity .\n\nChildhood\n\nRusty Stevens was born in 1940s. The early 1940s were dominated by World War II. Following the end of the war, it was the start of the Baby Boomer years and technology advancements such as the jet engine, nuclear fusion, radar, rocket technology and others later became the starting points for Space Exploration and Improved Air Travel. The 40s also brought us the Slinky, Velcro, Jeep, Tupperware and Frisbee. Discover what happened on this day.\n\nRusty Stevens is part of the Baby boomers generation. Also known as \"boomers\", are the result of the end of World War II, when birth rates across the world spiked. They are associated with a rejection of traditional values. These hippie kids protested against the Vietnam War and participated in the civil rights movement.\n\nYou can also find out who is Rusty Stevens dating now and celebrity dating histories at CelebsCouples.\n\nIt's hard to know Rusty Stevens birth time, but we do know his mother gave birth to his on a Thursday. People born on a Thursday are naturally well-meaning and open. Luck is on their side.\n\n[fetch instagram=”” display=”posts” ]\n\nThe 74-year-old American was born in the Baby Boomers Generation and the Year of the Rat\n\nEducation\n\nThe education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nRusty Stevens’s mother’s name is unknown at this time and his father’s name is under review. We will continue to update information on Rusty Stevens’s parents.\n\nPersonal Life\n\nLike many famous people and celebrities, Rusty Stevens keeps his personal life private. Once more details are available on who he is dating, we will update this section.\n\nFast Facts\n\nREAL NAME: Rusty Stevens NICKNAME: Rusty\n\nMARTIAL STATUS: Pending RELIGION: Unknown TATTOOS: N/A AGE GENERATION: Baby Boomers Generation BIRTH SIGN: Sagittarius BIRTH DAY: Thursday DAYS SINCE BIRTH:\n\nNet Worth\n\nThe 74-year-old American tv actor has done well thus far. Majority of Rusty’s money comes from being a tv actor. CelebsMoney has recently updated Rusty Stevens’s net worth .\n\nVideos\n\nHoroscope\n\nZodiac Sign: Rusty Stevens is a Sagittarius. People of this zodiac sign like freedom, travel, philosophy, being outdoors and dislike clingy people, constrained, off-the-wall theories. The strengths of this sign are being generous, idealistic, sense of humor, while weaknesses can be to promise more than can deliver, impatient and say anything no matter how undiplomatic. The greatest overall compatibility with Sagittarius is Gemini and Aries.\n\nChinese Zodiac: Rusty Stevens was born in the Year of the Rabbit. People born under this sign are clever and charming. They're curious, but sometimes too motivated by money.\n\n\n\n\n\nRuling Planet: Rusty Stevens has a ruling planet of Jupiter and has a ruling planet of Jupiter and by astrological associations Thursday is ruled by Jupiter. This planet represents abundance, prosperity and the principle of expansion. People who are born with Jupirer as the ruling planet are optimistic and have a big appetite for life.\n\n[fetch instagram=”” display=”posts” show=”2″ ]\n\nRusty Stevens’s birth sign is Sagittarius and he has a ruling planet of Jupiter.\n\nDon’t miss\n\n– Who’s the richest TV Actor in the world?\n\n– Rusty Stevens Net Worth Stats\n\n– When is Rusty Stevens’s birthday?\n\nAssociated with\n\nFans also viewed"}, {"url": "https://deadorkicking.com/robert-rusty-stevens-dead-or-alive/", "page_content": "How Old Is Robert 'Rusty' Stevens? Robert 'Rusty' Stevens Birthday\n\nRobert 'Rusty' Stevens was born on December 25, 1948 and is 74 years old now.\n\nBirthday: December 25, 1948\n\nHow Old - Age: 74\n\nRobert 'Rusty' Stevens Death Fact Check\n\nRobert is alive and kicking and is currently 74 years old.\n\nPlease ignore rumors and hoaxes.\n\nIf you have any unfortunate news that this page should be update with, please let us know using this form .\n\nRobert 'Rusty' Stevens - Biography\n\nRobert \"Rusty\" Stevens (born November 25, 1948) is an American former child actor best remembered for his role as Larry Mondello, Theodore \"Beaver\" Cleaver's young friend, in the original Leave It to Beaver television series. Stevens appeared in 68 of the show's 235 episodes, between 1957 and 1960.\n\nHe is an actor, known for Leave It to Beaver (1957), Still the Beaver (1983) and 77 Sunset Strip (1958). He is married to Theresa Marinelli. They have one child.\n\nStevens was reported to have left the show in 1960 because his family moved from Burbank to Philadelphia, Pennsylvania, although Barbara Billingsley, who played \"June Cleaver\" on the series, said in a TV Archive interview that Stevens was dropped because his overbearing mother caused grief for the producers of the series.\n\nStevens briefly returned to the screen when he reprised his role as Larry Mondello in the 1983 made-for-television reunion movie Still the Beaver and for three episodes of The New Leave It to Beaver."}], "Rusty Stevens appeared as Larry Mondello in Leave It to Beaver.": [{"url": "https://www.looper.com/915549/the-only-actors-still-alive-from-the-cast-of-leave-it-to-beaver/", "page_content": "The Only Actors Still Alive From The Cast Of Leave It To Beaver\n\n\"Ward, I'm worried about the Beaver.\" No, there's not an actual beaver involved. \"The Beaver\" is simply the nickname for Theodore Cleaver, the main character of the 1957-1963 family sitcom \"Leave It to Beaver.\" The nickname is derived from Beaver's older brother, Wally, being unable to pronounce \"Theodore\" correctly at the time of Beaver's birth. Whenever Beaver's mom, June (the late Barbara Billingsley), went to her husband, Ward (played by the late Hugh Beaumont), with concerns about their son, viewers knew they were in for some sort of \"golly, gee\" predicament poor Beaver had inevitably gotten himself into — and that dear old Dad would have to fix.\n\nWe can look back on \"Leave It to Beaver\" as a quintessential image of mid-20th-century aesthetics — the good, which changed television forever, and the cringe, which wasn't OK then and isn't now. On the one hand, the show's sitcom format was foundational for the genre in a way countless other shows have emulated since. On the other hand, its rosy-tinted, picture-perfect suburban America was a filtered view, one in which its citizens were overwhelmingly white and gender roles were unwaveringly rigid.\n\nWith \"Leave It to Beaver\" airing in the infancy of television itself, many decades have passed and much of its adult cast has unfortunately passed away. However, since the show focused so prominently on children, many of its cast members were quite young at the time the show aired and are still alive today. Let's take a look at who's still around from the show."}, {"url": "https://celebcritics.com/rusty-stevens/", "page_content": "Who is Rusty Stevens?\n\nRusty Stevens is an American former child actor most fondly remembered for his role as “Larry Mondello” in the original Leave It to Beaver TV series.\n\nRusty Stevens appeared in 68 of the show’s 234 episodes between 1957 and 1960 and amassed a great fan base for his hilarious role. However, many fans were disappointed as he left the show in the middle of its fourth season.\n\nThere are so much misinformation and speculations regarding Rusty Stevens whereabouts. Why did Rusty Stevens suddenly leave the show he was doing so good on?\n\nRusty Stevens Biography\n\nAs a Leave It To Beaver fan, we know you have so many questions. So today, we shall try to answer all these questions in this article. So, please make sure that you read the article till the end!\n\nQuick Facts\n\nFull name Robert Rusty Stevens Nickname Rusty Birthday November 25, 1948 Age 74 years old Sun sign Sagittarius Traits Positive- Loving, Energetic, and Adventurous\n\nNegative- Impulsive, Impatient, and Careless Birthplace Boston, Massachusetts, USA Currently Residing New Jersey, USA Marital Status Married Spouse Theresa Marinelli (wife) Profession Actor, Salesman Net Worth USD 2 million Quick Facts\n\nInteresting facts\n\nRusty Stevens hadn’t told his wife he had been a child actor. So, when a detective tracked him down in the ’80s when CBS wanted Stevens for its sequel Leave It to Beaver, his wife assured the detective that he had the wrong house.\n\nRusty served in the U.S. Army in 1969 with a military occupational specialty of armor. Though the Vietnam War was in full swing, he never got orders to serve there. So instead, he served in Daley Barracks, Border Guard Unit, Bad Kissingen, West Germany.\n\nEarly Life and Childhood\n\nRusty Stevens was born in Boston, Massachusetts, on November 25, 1948. He grew up in the loving care and protection of his parents.\n\nStevens was a normal kid who attended school and sold newspapers during his free time. He hadn’t acted in a school play or a church skit. However, as his mother admitted, he loved to watch movies and TV Westerns and act out the parts around the house.\n\nRusty Stevens childhood photo\n\nSo, Rusty had been selling newspapers for ten months without anyone paying attention when a children’s talent scout named Lola Moore noticed him. As Lola mentioned, she liked Rusty’s style. Undoubtedly, Stevens’ parents were shocked. Rusty’s mother even gave an interview to the newspaper The Valley Times in 1957, which was the very newspaper her son had been selling. She said,\n\n“The studio people say he’s a real discovery.”\n\nThat was how Rusty made his TV debut on Leave It to Beaver. He became an instant celebrity as many audiences loved his role as Larry Mondello.\n\nRomantic Affairs and Relationships\n\nTheresa Marinelli (Rusty Stevens’ Wife)\n\nStevens is happily married to Theresa Marinelli. They also have one child together.\n\nCareer\n\nRusty began his career as a child actor in the hit TV series Leave It to Beaver. His role as a mischievous plump boy named Larry Mondello won the heart of many fans. Stevens appeared in 68 of the show’s 234 episodes as Theodore “Beaver” Cleaver’s young friend.\n\nAdditionally, the star child also acted in many TV series. According to IMBD, My Three Sons, Perry Mason, and National Velvet are some of the TV shows played by Rusty.\n\nThere was no doubt that Stevens would have made a name for himself in the movie industry had he continued working in his field. But instead, he suddenly left the show, which had given him celebrity status.\n\nAfter he stopped appearing as Larry Mondello, the latest TV appearance he made was in The Rifleman in 1963. After a long time, Rusty reappeared in the 1983 made-for-television reunion movie Still the Beaver.\n\nJerry Mathers searched for decades to reunite with Rusty Stevens.\n\nAfter Rusty Stevens’s parents ended his contract with the show Leave It to Beaver and left Los Angeles, it seemed like everybody forgot about Rusty. However, his old friend and co-star Jerry Mathers had not forgotten his dear friend.\n\nRusty Stevens and Jerry Mathers from Leave It to Beaver\n\nHe kept searching for his old friend and was deeply frustrated when he couldn’t find him. In an interview with The Pantagraph in 1982, Mathers said,\n\n“Nobody could find him for the longest time. Everybody lost touch with him.”\n\nHowever, Mathers did not lose hope and left no stone unturned to find his old buddy. Finally, he succeeded in finding Stevens, who was in New Jersey, working as a car insurance salesman.\n\nSo, Jerry persuaded Rusty to participate in 1983 Leave It To Beaver reunion movie, and Rusty did three guest spots on episodes of The New Leave It To Beaver, making his final TV role the same as the first. From then on, the pair of best buddies never lost touch again.\n\nRusty Stevens Movies List\n\nMovie Released Year Role The New Leave It To Beaver 1983-1989 Larry Mondello Still the Beaver 1983 Larry Mondello The Rifleman 1963 Melvin Wagon Train 1962 Johnny Perry Mason 1962 Brucie Hillman My Three Sons 1962 Cletus Bleeker National Velvet 1961 Alvy’s Friend The Jim Backus Show 1961 Alexander ‘Sandy’ Cleaver Angel 1957-1969 Leave It to Beaver 1957-1960 Larry Mondello Shirley Temple’s Storybook 1960 Stuffy Cole/ Gypsy Boy 77 Sunset Strip 1960 Max Cimarron City 1958 Boy Reading Script Cat On A Hot Tin Roof 1958 Sonny Telephone Time 1958 Fat Boy Racket Squad 1951 Detective Steve\n\nControversy\n\nRusty Stevens had gained massive popularity for his role as Larry Mondello. Undoubtedly, he would go on to achieve great heights in his acting career. However, things took an unexpected turn when Rusty’s parents suddenly moved from Burbank to Philadelphia.\n\nIt was in the middle of the 4th season when the show’s producers announced that Rusty would no more appear in the show. This left many of his fans surprised, and they couldn’t understand why he left in the middle of the show.\n\nRusty as Larry Mondello from Leave It to Beaver\n\nLater, Barbara Billingsley, who played June Cleaver in the series, said in a TV Archive interview that Stevens was fired because his overbearing mother caused grief for the producers. She said,\n\n“We all loved Rusty so much. He was so good in that role, and unfortunately, they had to let him go because his mother was such a pain in the neck.”\n\nHowever, the former child actor later revealed that it was he who had wanted to leave the show. According to Rusty himself, the truth is that as his character Larry Mondello became more popular on the show, he was signed to a contract by the show producers. At that time, aside from the cast members, he was the only other actor to be under contract.\n\nAt first, Stevens loved spending most of his time at the studio. However, he started missing his everyday life, where he would go to school and spend time with his family. Rusty kept the frustration inside for a while, but later, he told his parents that he couldn’t handle it anymore.\n\nRusty said he didn’t know to what length his mother might have gone to help him. But eventually, the show producers released him from his contract.\n\nRusty Stevens Net Worth\n\nRusty Stevens was one of the most famous child artists of the 1950s. He was one of the most loved and entertaining characters on popular TV shows.\n\nSo, based on all the available facts about the famous actor, his net worth as of 2023 is estimated at USD 2 million.\n\nFAQs"}, {"url": "https://ecelebrityfacts.com/where-is-larry-mondello-from-leave-it-to-beaver/", "page_content": "American sitcom, Leave It to Beaver chronicled the adventure of a curious and naïve boy, Theodore “The Beaver” Cleaver (Jerry Mathers), in a typical suburban neighborhood. Beaver was accompanied by Wally Cleaver (Tony Dow), Eddie Haskell (Ken Osmond) and Larry Mondello (Robert “Rusty” Stevens).\n\nWhere is Robert “Rusty” Stevens, who played Larry Mondello Now?\n\nStevens portrayed the role of Larry Mondello for the three seasons. He appeared in 68 of the show’s 235 episodes. Larry was not the brightest kid in school, but he was often responsible for getting Beaver into trouble.\n\nStevens was born on November 25, 1948, in Boston. He had appeared in several other shows before appearing on Leave It to Beaver. Robert left Leave It to Beaver in 1960 because his family moved to Philadelphia. And the show he played on was shot in Burbank.\n\nWhere is Eddie Haskell from Leave it to Beavers Now? Ken Osmond’s Net Worth\n\nIn a TV Archive interview, Barbara Billingsley, who portrayed June Cleaver on the show, said that he was dropped because his mother caused grief for the series producers.\n\nHe appeared in a few TV shows after moving to Philadelphia. He reprised his role of Larry in the 1983 TV movie Still the Beaver and for three episodes of The New Leave It to Beaver. Stevens married Theresa Marinelli. The couple share one child.\n\nIn 2000, the 71-year-old worked as an insurance salesman in New Jersey. Later,\n\nWhere is Leave it to Beaver Actor Jerry Mathers Now?"}, {"url": "https://gleestreet.com/why-did-larry-mondello-leave-the-leave-it-to-beaver-show/", "page_content": "Leaving in the Middle\n\nThere are many actors and actresses who have left successful television shows in the middle of their runs. One of the biggest we can look at is Shelly Long leaving the series Cheers after the fifth season. Another big example was actor Dick York who played Darrin Stephens on Bewitched being replaced by Dick York. As for 1950s and 1960s situation comedies, the biggest example was when the actor Rusty Stevens left the Leave it to Beaver. Rusty Stevens played a character named Larry Mondello. So, the question arises, why did Larry Mondello leave the Leave it to Beaver show? And before you read any further, we hope you will join our GleeStreet.com facebook group right now. You will be notified about new posts like this one, quizzes and giveaways too.\n\nThe character of Larry Mondello left the show during season four. After the actors who portrayed the Cleaver family and Eddie Haskell, Rusty Stevens’ character of Larry Mondello appeared in the most episodes (67). His last episode was “Beaver’s Big Contest.” You might remember his last appearance. He and Beaver were sitting in a box in the driveway pretending to drive the sports car Beaver had recently won in a raffle for which he was selling tickets. The question as to why Rusty Stevens left the show is up to debate. No one has ever heard Rusty Stevens speak for himself about why he left. Now, there is a Leave it to Beaver Facebook group which had a member in it that said he and Rusty were friends. This person would pass along conversations he had with Rusty.\n\nWhy did Rusty Stevens Leave?\n\nVarious cast members have said different things about Rusty Stevens. Not one of them has said anything ill of the actor who played Larry Mondello. Beginning with Barbara Billingsley, in her Archive of American Television interview she mentions the following about Rusty Stevens leaving Leave it to Beaver: “We all loved Rusty so much. He was so good in that role. Unfortunately….\n\nWe hope you enjoyed this Sneak Preview\n\nThe above sneak preview classic TV article titled, “Why did Larry Mondello Leave the Leave it to Beaver Show?” can be found in full on our Classic TV Substack community. Become a subscriber and find out why Rusty Stevens’ character of Larry Mondello left the Leave it to Beaver show, or at least what some actors from the show who were there when it happened, one of those actors being a good friend of the son of the creator/producer Joe Connelly.\n\nTo become a subscriber with access to bonus content like the full “Why did Larry Mondello Leave the Leave it to Beaver Show?” article, click on over to our Classic TV Substack community and become a paying subscriber for exclusive content like this article and excerpts from my current and future Leave it to Beaver books, a free LITB prize for yearly subscribers, and chances to win additional LITB souvenirs and memorabilia for monthly or yearly subscribers. Each month we also give away (1) lifetime subscription. We hope you’ll be the winner.\n\nIf you’d prefer to join our Classic TV Substack community for free, you can do that too. You won’t have access to the extra bonus content and chances to win prizes, but you’ll still receive new classic TV content in your inbox and updates about new articles. Most of the content is about Leave it to Beaver, but some of your other favorites could be included too.\n\nThanks,\n\nBrian GleeStreet\n\nComments\n\ncomments"}, {"url": "https://doyouremember.com/153789/jerry-mathers-searched-rusty-stevens", "page_content": "Jerry Mathers is best known for his role as Theodore “Beaver” Cleaver in Leave It to Beaver. Now, Jerry is admitting that he spent decades looking for one of his co-stars. He searched for Rusty Stevens, who played Larry Mondello on Leave It To Beaver for several years in the late ’50s. His final appearance was on The Rifleman‘s Halloween special in 1963.\n\nHe seemingly disappeared after that. Rusty left Los Angeles and everyone lost touch with him. Eventually, Jerry was able to find Rusty. He was working as a car insurance salesman in New Jersey. Jerry convinced him to appear in the Leave It to Beaver reunion movie in 1983 called Still the Beaver.\n\nJerry Mathers searched for years until he found former co-star Rusty Stevens\n\nAccording to Leave It to Beaver star Barbara Billingsley, Rusty was fired from the show because his mother was causing problems on the set! This could be why his parents took him away from Hollywood. Not much is known about his whereabouts these days, but he would be in his 70s now.\n\nRELATED: Tony Dow, Star Of ‘Leave It To Beaver’ Has Been Hospitalized\n\nWhen asked about the show, Jerry said he loved working with his co-stars, including Rusty and shared his favorite episode. He said, “I like the one where I climb up into the soup bowl. That was fun. The show was just a great adventure with a lot of adults around and we just had a good time.”\n\nWhat’s your favorite Leave It to Beaver episode?"}, {"url": "https://deadorkicking.com/robert-rusty-stevens-dead-or-alive/", "page_content": "How Old Is Robert 'Rusty' Stevens? Robert 'Rusty' Stevens Birthday\n\nRobert 'Rusty' Stevens was born on December 25, 1948 and is 74 years old now.\n\nBirthday: December 25, 1948\n\nHow Old - Age: 74\n\nRobert 'Rusty' Stevens Death Fact Check\n\nRobert is alive and kicking and is currently 74 years old.\n\nPlease ignore rumors and hoaxes.\n\nIf you have any unfortunate news that this page should be update with, please let us know using this form .\n\nRobert 'Rusty' Stevens - Biography\n\nRobert \"Rusty\" Stevens (born November 25, 1948) is an American former child actor best remembered for his role as Larry Mondello, Theodore \"Beaver\" Cleaver's young friend, in the original Leave It to Beaver television series. Stevens appeared in 68 of the show's 235 episodes, between 1957 and 1960.\n\nHe is an actor, known for Leave It to Beaver (1957), Still the Beaver (1983) and 77 Sunset Strip (1958). He is married to Theresa Marinelli. They have one child.\n\nStevens was reported to have left the show in 1960 because his family moved from Burbank to Philadelphia, Pennsylvania, although Barbara Billingsley, who played \"June Cleaver\" on the series, said in a TV Archive interview that Stevens was dropped because his overbearing mother caused grief for the producers of the series.\n\nStevens briefly returned to the screen when he reprised his role as Larry Mondello in the 1983 made-for-television reunion movie Still the Beaver and for three episodes of The New Leave It to Beaver."}, {"url": "https://ecelebrityfacts.com/leave-it-to-beaver-cast-now-2019/", "page_content": "Television was still relatively young when one of the first American sitcoms, Leave It to Beaver began airing on October 4, 1957. And, like Thanksgiving dinner, apple pie, and baseball, Leave it to Beaver has remained supreme in the pantheon of American culture.\n\nBUY IT HERE\n\nThe show first aired on CBS and after one season moved to ABC, where it ran for six seasons (235 episodes) and ended in June 1963 after reaching its scripted finale. The show has since stayed in our lives through syndications, a reunion TV movie (Still the Beaver, 1983) and a follow-up series, The New Leave It to Beaver, which ran from 1985 to 1989.\n\nAlthough the show is blamed for sugarcoating the “perfect” suburban life of the mid-1950s, it remains one of the best family sitcoms to date. Sadly, some of the principal cast are no longer with us, including Hugh Beaumont and Barbara Billingsley, who played the roles of Ward and June Cleaver, respectively.\n\nStar Trek Cast : Where are They Now?\n\nTheodore “Beaver” Cleaver (Jerry Mathers)\n\nNaive, Theodore “Beaver” Cleaver, who always got himself in trouble was played by Jerry Mathers. Jerry was just nine years old at the time and portrayed the character for six seasons of the show.\n\nAfter the show ended, Jerry guest-starred in many TV shows and movies, including Batman (1968), Lassie (1968), My Three Sons (1970), Flying High (1978), and Back to the Beach (1987). From 1966 to 1969, he served in the Air Force Reserve Command.\n\nFollowing his release from the military, he reprised his role of Beaver in the TV movie; Still the Beaver (1983) and the spin-off show, The New Leave It to Beaver (1983-89). He has since guest-starred in numerous TV shows and movies. Jerry even made his Broadway debut with a starring role of Wilbur Turnblad in the Tony award-winning musical, Hairspray in 2007.\n\nIn 1996, he was diagnosed with Type-2 diabetes for which, he enrolled in a weight loss program and lost over 40lbs in the process. The 71 years old actor currently lives in Santa Carla with his wife, Teresa Modnik. Nowadays, he spends most of his time promoting Leave It To Beaver and other classic TV series on the MeTV network.\n\nSchool of Rock Cast Then and Now | Jack Black, Miranda Cosgrove\n\nEddie Haskell (Ken Osmond)\n\nWhen Eddie Haskell appeared on our TV, he not only became a household name, he fixed a permanent place in the American pop culture. In no time the name became a synonym to trouble in the American society, and even today, every family has a friend or relative that they call Eddie Haskell. Thanks to this amazing portrayal by Ken Osmond.\n\nBefore appearing as Eddie Haskell, Ken had already enjoyed some time in Hollywood as a child actor. He had appeared in movies like Plymouth Adventures (1952), So Big (1953), Good Morning Miss Dove (1955), and Everything But the Truth (1956). From 1957 to 1963, Ken portrayed the role of Eddie Haskell in Leave It to Beaver. During the filming of the final season, Ken was in the U.S. Army Reserve as an armorer but was granted leave to shoot episodes.\n\nFollowing Leave It to Beaver, he guest-starred in a few TV shows. In 1970, after facing a hard time finding other roles than typecast of Eddie Haskell, Ken left acting behind and joined the Los Angeles Police Department as a motorcycle cop. In 1980, he was involved in shootings, twice in the same month. He survived both times because of his bullet-proof vest and left the force for good in 1988.\n\nWhile he was still with the police, Ken reprised his role of Eddie Haskell in the TV movie, Still the Beaver and the sequel show, The New Leave It to Beaver, which ran for four seasons from 1984 to 1989. Since then, he has stepped away from acting and currently resides in Los Angeles County with his wife Sandra Purdy, where he handles rental properties around his neighborhood.\n\nWhat is the cast of The Rifleman doing Now? Where are they?\n\nLarry Modello (Robert “Rusty” Stevens)\n\nAnother troublemaking friend of Beaver, Larry Mondello was played by Robert “Rusty” Stevens for three seasons of the show. He appeared in 68 of the show’s 235 episodes. Though he was not the brightest kid in school, he was often responsible for getting Beaver into difficulties.\n\nHe left the show in 1960 because his family had moved to Philadelphia and the show was shot in Burbank. June Cleaver actress Barbara Billingsley said in a TV Archive interview that he was dropped from the show after his mother caused grief for the producers. He did appear in a few TV shows after relocating to Philadelphia.\n\nHe reprised his role of Larry in the 1983 reunion TV movie, Still the Beaver and for three episodes of the spin-off series, The New Leave It to Beaver.\n\nStevens is married to Theresa Marinelli and has one child. Back in 2000, the 71-year-old was reported to be working as an insurance salesman in New Jersey.\n\nWhere is Agent 99 (Barbara Feldon) Today? Net Worth 2019\n\nWally Cleaver (Tony Dow)\n\nTony Dow portrayed Wally Cleaver, an intelligent and polite teenager, who is trusted by his parents, popular with his peers and adored by his teachers.\n\nAfter the show, he made guest appearances in a few TV shows, including My Three Sons (1964), Dr. Kildare (1963), and Mr. Novak (1963–1965). From 1965 to 1968, he took a break from acting and served in the National Guard, before returning to play guest roles in various shows like Adam-12 (1970), The Mod Squad (1971), and Emergency! (1972).\n\nHe reprised his role as Wally Cleaver in the spin-off, The New Leave It to Beaver. Later, he ventured as a producer in movies like The Adventures of Captain Zoom in Outer Space (1995) and It Came from Outer Space II (1996). He also served as a director in a few episodes of shows like Star Trek: Deep Space 9, Babylon 5, and Get a Life.\n\nWhere is John Astin from The Addams Family Today? Net Worth 2019\n\nAlongside acting, he worked in the construction industry and studied journalism and filmmaking in the 70s. In the 1990s, Dow revealed that he had suffered from clinical depression and cancer. Later, he released self-help videos chronicling this struggle, including Beating the Blues (1998). Dow is also a sculptor, who creates abstract bronze sculptures. One of his pieces was displayed by his TV mother, Barbara Billingsley in her backyard garden.\n\nTalking about his career transition, he said, “I went into directing because I had no control as an actor. I went into art because I have control over everything.”\n\nHe also commented about today’s entertainment industry,\n\n“It is a youth-oriented business and you can tell by the product. My sensibilities are not near what they are for today’s world. In my older age, I have realized what a great show Beaver was, and how lucky I was to be part of it.”\n\nDow was married to Carol Marlow from 1969 to 1978. They share a son, Christopher (born in 1973). He has been married to Lauren Shulkind since June 1980 and has one child with her.\n\nWho was your favorite character in Leave It to Beaver? Mention in the comment section below.\n\nWhat is Deon Richmond from The Cosby Show Doing Now?"}, {"url": "https://prabook.com/web/rusty.stevens/1914666", "page_content": "Rusty Stevens\n\nActor\n\nDecember 25, 1948 Boston, Suffolk County, United States of America\n\nStevens appeared in 68 of the show\"s 235 episodes, between 1957 and 1960. After 1960, Stevens appeared in a handful of television episodes on other shows, including the National Broadcasting Company family drama National Velvet. He was also cast as a schoolboy bully on an episode of American Broadcasting Company\"s The Rifleman. Stevens briefly returned to the screen when he reprised his role as Larry Mondello in the 1983 made-for-television reunion movie, Still the Beaver, and for three episodes of The New Leave lieutenant to Beaver."}, {"url": "https://outsider.com/entertainment/leave-it-to-beaver-star-jerry-mathers-searched-decades-find-co-star-after-dropped-off-map/", "page_content": "Jerry Mathers, who played Theodore “Beaver” Cleaver on Leave It to Beaver, recently revealed that he spend decades trying to find one of his co-stars after they dropped off the map.\n\nAccording to MeTV, the Leave It to Beaver star has been searching for Rusty Stevens. The last time anyone has seen Stevens was in 1963 with his final appearance being on The Rifleman’s Halloween special, “Hostages of Fortune.” Stevens was widely known for playing Larry Mondello on Leave It to Beaver from 1957 to 1960. He notably appeared in 68 of the hit sitcom’s 234 episodes.\n\nFollowing the series finale of Leave It to Beaver, Stevens’ parents decided to end his acting contract and left Los Angeles. No one has seen the child actor since. Mathers reportedly told The Pantagraph in 1982, “Nobody could find [Stevens] for the longest time. Everybody lost touch with him.”\n\nLuckily, Mathers eventually found Stevens, who was working as a car insurance salesman in New Jersey. Mathers even convinced Stevens to participate in the Leave It to Beaver reunion movie in 1983.\n\nJerry Mathers Opens Up About Starring in ‘Leave It to Beaver’\n\nIn a 2019 interview with Classic Film TV Cafe, Jerry Mathers sat down and shared more details about his experience on the Leave It to Beaver set. “\n\n“[We worked for] 39 weeks a year and we’d go out after that for a few weeks of promoting and meeting with advertisers in New York and Chicago,” Mathers recalled. He also said that the cast and crew would come back from a short vacation and start filming a new season. “We did that for six years and 234 episodes.”\n\nWhile also discussing how he and Barbara Billingsley were the only cast members retained from the Leave It to Beaver pilot, Mathers revealed the boy who played Wally had a growth spurt. “When they brought him back several months later, he had gotten really big. And really looked like a big brother. He was almost as tall as Hugh Beaumont, who was 6’1.”\n\nMathers then said that as for Ward Cleaver, there were several screenings for the Leave It to Beaver main cast part. “They’d bring in people from outside as well as people working in other shows on the lot,” the actor recalled. The producers would also administer a questionnaire asking how the actors liked each character. “For some reason, they decided to replace both of the actors who played Wally and Ward in the pilot.”\n\nIn regards to his favorite Leave It to Beaver episodes, Mathers added, “I like the one where I climb up into the soup bowl. That was fun. The show was just a great adventure with a lot of adults around and we just had a good time.”"}, {"url": "https://alchetron.com/Rusty-Stevens", "page_content": "Robert \"Rusty\" Stevens (born November 25, 1948) is an American former child actor best remembered for his role as Larry Mondello, Theodore \"Beaver\" Cleaver's young friend, in the original Leave It to Beaver television series. Stevens appeared in 68 of the show's 235 episodes, between 1957 and 1960. Stevens was reported to have left the show in 1960 because his family moved from Burbank to Philadelphia, Pennsylvania. Barbara Billingsley, who played \"June Cleaver\" on the series, said in a TV Archive interview that Stevens was dropped because his overbearing mother caused grief for the producers of the series.\n\nContents\n\nAfter 1960, Stevens appeared in a handful of television episodes on other shows, including the NBC family drama National Velvet. He was also cast as a schoolboy bully on an episode of ABC's The Rifleman.\n\nStevens briefly returned to the screen when he reprised his role as Larry Mondello in the 1983 made-for-television reunion movie, Still the Beaver, and for three episodes of The New Leave It to Beaver."}]}