{"John Cameron was a Canadian politician.": [{"url": "https://www.wikiwand.com/en/John_Cameron_(Upper_Canada_politician)", "page_content": "John Cameron (1778 – August 7, 1829) was a farmer and political figure in Upper Canada.\n\nUpper Canada politician\n\nHe was born in the Mohawk Valley in New York state, the son of a United Empire Loyalist. He lived on a property he named Fairfield in Charlottenburgh Township, located near the current location of Summerstown, Ontario. He served as a lieutenant in the local militia during the War of 1812. In 1814, he was named justice of the peace in the Eastern District. He represented Glengarry in the 7th Parliament of Upper Canada. He died at Fairfield in 1829.\n\nThe property at Fairfield was later owned by prospector John A. Cameron, known as \"Cariboo Cameron\"."}, {"url": "https://prabook.com/web/john.cameron/2222828", "page_content": "John Cameron\n\nlawyer politician\n\nNovember 29, 1891 (age 84) Morrisburg, Ontario\n\nCameron was first elected to Parliament at the Hastings South riding in the 1935 general election and resigned on 26 March 1940 before the end of the 19th Canadian Parliament. That year, he was appointed a judge at Hastings County and frequently presided in an acting capacity at Ottawa\"s Exchequer Court. In 1946 he was formally appointed to the Exchequer Court."}, {"url": "https://www.peoplepill.com/people/john-charles-alexander-cameron", "page_content": "John Charles Alexander Cameron (29 November 1891 - 24 March 1976) was a Liberal party member of the House of Commons of Canada. He was born in Morrisburg, Ontario and became a barrister and judge.\n\nCameron attended public and secondary school at Morrisburg, then attended Queen's University, the law school at the University of Alberta and Osgoode Hall Law School, attaining a Bachelor of Arts degree.\n\nCameron was first elected to Parliament at the Hastings South riding in the 1935 general election and resigned on 26 March 1940 before the end of the 19th Canadian Parliament. That year, he was appointed a judge at Hastings County and frequently presided in an acting capacity at Ottawa's Exchequer Court. In 1946 he was formally appointed to the Exchequer Court.\n\nCameron died in Ottawa on 24 March 1976, survived by a wife, two sons and four daughters."}, {"url": "https://en-academic.com/dic.nsf/enwiki/2457157", "page_content": "John Cameron (1778 – August 7 1829 ) was a farmer and political figure in Upper Canada .\n\nHe was born in the Mohawk Valley in New York state, the son of a United Empire Loyalist . He lived on a property he named Fairfield in Charlottenburgh Township, located near the current location of Summerstown, Ontario . He served as a lieutenant in the local militia during the War of 1812 . In 1814, he was named justice of the peace in the Eastern District. He represented Glengarry in the 7th Parliament of Upper Canada . He died at Fairfield in 1829.\n\nThe property at Fairfield was later owned by prospector John A. Cameron , known as \"Cariboo Cameron\".\n\nReferences\n\n* \"Becoming Prominent: Regional leadership in Upper Canada, 1791-1841. J.K. Johnson (1989)"}, {"url": "https://www.peoplepill.com/people/john-cameron-1", "page_content": "John Cameron (May 28, 1846 – October 6, 1919) was a merchant and politician in Alberta, Canada and a municipal councillor in Edmonton. He is regarded as one of the city's pioneer citizens.\n\nBorn in Canada West (later Ontario), Cameron worked as a merchant in his birth province and Manitoba before coming to Edmonton in 1881. In Edmonton he continued as a merchant, owning and operating a store for 15 years. In Edmonton he quickly established himself as a prominent citizen, serving on the inaugural Edmonton Board of Trade as president, which he would remain for five years. Cameron also was involved in the development of the Edmonton Public School Board, serving on the board in the 1890s. He was also involved in the town's politics, winning election to Edmonton's first town council in 1892 and serving an additional term when elected in 1895. After this retirement from politics, he worked in the coal and real estate business until his death in 1919, at the age of 73. Upon his death, he was lauded as one of the pioneer citizens of Edmonton; a street, neighbourhood and ravine were named for him.\n\nEarly life and career\n\nJohn Cameron was born at East Hawkesbury, Canada West in 1846, the son of Colin and Anna (née McLaurin) Cameron. His brother was Sir Douglas Cameron, who also went into politics, serving in the Ontario Legislature and as Lieutenant Governor of Manitoba. John attended school in Hawkesbury and Renfrew and in 1871 became a merchant at Vankleek Hill, with a partner in the firm Cameron & Mode General Merchants. In 1876, he went west and relocated to Winnipeg, Manitoba to establish Cameron & Company general merchants, where he remained until 1881.\n\nCareer in Edmonton\n\nEdmonton Board of Trade, 1891. John Cameron is seated in the middle row, third left.\n\nCameron moved from Winnipeg to Edmonton in 1881 by ox-cart, travelling through Carlton and Battleford, bringing with him 96,000 pounds (44,000 kg) of freight on a journey that took three months. Once in Edmonton, he used this freight as the initial inventory of a store, the A. McDonald Company, where he entered into a partnership. In 1891, he would purchase the store from its original owner, A. McDonald. He moved into a new building in 1893, designed by architect William S. Edmiston and constructed by contractor Kenneth McLeod. The building, located on Jasper Avenue, included a cellar, main floor for merchandise and storage, and an upper storey, heated in its entirety by a furnace. He would operate until 1896. After the sale of the store, he entered into the real estate and coal business. In 1914, Cameron was serving as managing director and treasurer of Gainford Colleries Ltd. and as chairman of the provisional directors of the Canada Northwest Loan and Mortgage Company.\n\nHe was elected the first president of the Edmonton Board of Trade upon its founding in 1889. He served until 1894. He also played a vital role in the development of the school system in Edmonton, involving himself in education-related affairs as early as 1881, and serving on the public school board from 1886–87 and 1889 until 1897. In 1881, he was part of a group that provided funds for the first school teacher in the city. In 1886, with the school board, Cameron was responsible for introducing a fee for the parents of students attending schools in the Edmonton Public School District who did not live within the district, as district residents were taxed for the school's services. He would serve as secretary-treasurer from 1882 to 1884 and later as chairman of the school board from 1890 to 1892 and 1894.\n\nJohn Cameron during his time as a school board trustee\n\nCivic politics\n\nCameron was one of six candidates elected as aldermen to Edmonton's first town council in 1892; he received the fifth most votes of the fourteen candidates. He was defeated in his 1893 re-election bid, in which he finished seventh of nine candidates. He briefly returned to the council after being elected again in 1895, but did not seek re-election the following year and remained out of politics thereafter. During his first term on the council, he was involved in an altercation in which the dominion government had made a decision to Dominion Land Office from Edmonton to Strathcona, at the time a separate town, south of the North Saskatchewan River. When news of the decision and crews to execute it arrived in Edmonton, angry citizens descended on the office and tore to pieces the wagon that the officer was packing with records for transportation. Led by mayor Matthew McCauley, Cameron was part of a group of prominent citizens that headed the resistance, eventually leading to the dominion reversing its decision.\n\nPersonal life\n\nAt Vankleek Hill in 1872, he married Jane Vogan. She would die some time afterwards, and John Cameron, aged 29, would remarry Elizabeth Ann McCann on November 8, 1875. They had two sons, John Hilliard and Howard, and four daughters, Mabel, Florence, Alice and Jessie. He was a member of the Edmonton Old Timers' Association as well as the Edmonton Agricultural Society. He was an avid outdoorsman who enjoyed canoeing and hiking in the Edmonton North Saskatchewan River Valley. Along with his wife Elizabeth, he was an early member of the Presbyterian church in Edmonton, attending First Presbyterian Church, where he was an elder. Though he served as an independent on the Edmonton Town Council, he was a Liberal.\n\nDeath and legacy\n\nHe died of heart failure in the morning of October 6, 1919 after a brief illness at his Edmonton home. He was survived by his wife and children. After his funeral at his home on Cameron Avenue, he was buried at the Edmonton Cemetery. At the time of his death, the Edmonton Bulletin praised Cameron for his efforts in establishing the foundations of the city Edmonton, and remarked that \"the city owes much to him because of his strenuous efforts with others in maintaining this as the permanent site for the city\". Elizabeth Cameron died in Edmonton in 1933 at the age of 79.\n\nCameron Street, the neighbourhood of Cameron Heights, and the Cameron Ravine (in the vicinity of Cameron Heights) in Edmonton are named in honour."}, {"url": "https://prabook.com/web/john.cameron/2230272", "page_content": "John Cameron\n\nmagistrate politician\n\nDecember 13, 1876 (age 80) Heatherton, Antigonish\n\nHe represented the electoral district of Queens in the Nova Scotia House of Assembly from 1937 to 1941. Cameron was born in 1876 at Heatherton, Antigonish County, Nova Scotia. He was educated at Saint Francis Xavier University and Dalhousie Law School, and was a lawyer by career. He was the stipendiary magistrate and town solicitor of Liverpool from 1926 to 1957. Cameron entered provincial politics in the 1937 election, winning the Queens riding by 216 votes. He was defeated when he ran for re-election in 1941, losing to Liberal Harry Dennis Madden by 13 votes. Cameron died at Liverpool on August 18, 1957."}, {"url": "https://peoplepill.com/people/john-cameron-9/", "page_content": "John Cameron (1778 – August 7, 1829) was a farmer and political figure in Upper Canada.\n\nHe was born in the Mohawk Valley in New York state, the son of a United Empire Loyalist. He lived on a property he named Fairfield in Charlottenburgh Township, located near the current location of Summerstown, Ontario. He served as a lieutenant in the local militia during the War of 1812. In 1814, he was named justice of the peace in the Eastern District. He represented Glengarry in the 7th Parliament of Upper Canada. He died at Fairfield in 1829.\n\nThe property at Fairfield was later owned by prospector John A. Cameron, known as \"Cariboo Cameron\"."}, {"url": "https://prabook.com/web/john.cameron/2222407", "page_content": "John Cameron\n\npolitician\n\n1778 (age 51) Mohawk Valley in New York\n\nHe lived on a property he named Fairfield in Charlottenburgh Township, located near the current location of Summerstown, Ontario. He served as a lieutenant in the local militia during the War of 1812. In 1814, he was named justice of the peace in the Eastern District. He represented Glengarry in the 7th Parliament of Upper Canada. He died at Fairfield in 1829. The property at Fairfield was later owned by prospector John A. Cameron, known as \"Cariboo Cameron\"."}, {"url": "https://peoplepill.com/people/john-donald-cameron/", "page_content": "John Donald Cameron (September 18, 1858 – March 26, 1923) was a lawyer, judge and political figure in Manitoba. He represented Winnipeg South from 1892 to 1899 in the Legislative Assembly of Manitoba as a Liberal.\n\nHe was born on a farm in East Nissouri, Oxford County, Canada West, the son of John Cameron, and was educated in Woodstock, at the Canadian Literary Institute (later Woodstock College) and at the University of Toronto. Cameron was called to the Ontario bar in 1882. He came to Manitoba later that year, settling in Winnipeg. He was first elected to the provincial assembly in an 1892 by-election held after Isaac Campbell ran for a federal seat. Cameron served in the Manitoba cabinet as Provincial Secretary, as Municipal Commissioner and as Attorney General. In 1908, he was named to the Manitoba Court of King's Bench and, in 1909, to the Manitoba Court of Appeal.\n\nCameron died in St. Paul, Minnesota."}, {"url": "https://en.unionpedia.org/John_Cameron_(Upper_Canada_politician)", "page_content": "John Cameron (Upper Canada politician) John Cameron (1778 – August 7, 1829) was a farmer and political figure in Upper Canada. [1]\n\n12 relations: Eastern District, Upper Canada, Glengarry County, Ontario, John A. Cameron, John Cameron, Justice of the peace, Mohawk Valley, New York (state), South Glengarry, Ontario, United Empire Loyalist, Upper Canada, War of 1812, 7th Parliament of Upper Canada.\n\nEastern District was one of four districts of the Province of Quebec created in 1788 in the western reaches of the Montreal District and partitioned in 1791 to create the new colony of Upper Canada.\n\nNew!!: John Cameron (Upper Canada politician) and Eastern District, Upper Canada · See more »\n\nGlengarry County, an area covering, is a county in the Canadian province of Ontario.\n\nNew!!: John Cameron (Upper Canada politician) and Glengarry County, Ontario · See more »\n\nJohn Angus Cameron (September 1, 1820 – November 7, 1888) was a Canadian prospector, also known as \"Cariboo Cameron\".\n\nNew!!: John Cameron (Upper Canada politician) and John A. Cameron · See more »\n\nJohn Cameron may refer to.\n\nNew!!: John Cameron (Upper Canada politician) and John Cameron · See more »\n\nA justice of the peace (JP) is a judicial officer, of a lower or puisne court, elected or appointed by means of a commission (letters patent) to keep the peace.\n\nNew!!: John Cameron (Upper Canada politician) and Justice of the peace · See more »\n\nThe Mohawk Valley region of the U.S. state of New York is the area surrounding the Mohawk River, sandwiched between the Adirondack Mountains and Catskill Mountains.\n\nNew!!: John Cameron (Upper Canada politician) and Mohawk Valley · See more »\n\nNew York is a state in the northeastern United States.\n\nNew!!: John Cameron (Upper Canada politician) and New York (state) · See more »\n\nSouth Glengarry is a township in eastern Ontario, Canada on the Saint Lawrence River in the United Counties of Stormont, Dundas and Glengarry.\n\nNew!!: John Cameron (Upper Canada politician) and South Glengarry, Ontario · See more »\n\nUnited Empire Loyalists (or Loyalists) is an honorific given in 1799 by Lord Dorchester, the governor of Quebec and Governor-general of British North America, to American Loyalists who resettled in British North America during or after the American Revolution.\n\nNew!!: John Cameron (Upper Canada politician) and United Empire Loyalist · See more »\n\nThe Province of Upper Canada (province du Haut-Canada) was a part of British Canada established in 1791 by the Kingdom of Great Britain, to govern the central third of the lands in British North America and to accommodate Loyalist refugees of the United States after the American Revolution.\n\nNew!!: John Cameron (Upper Canada politician) and Upper Canada · See more »\n\nThe War of 1812 was a conflict fought between the United States, the United Kingdom, and their respective allies from June 1812 to February 1815.\n\nNew!!: John Cameron (Upper Canada politician) and War of 1812 · See more »\n\nThe 7th Parliament of Upper Canada was opened 4 February 1817.\n\nNew!!: John Cameron (Upper Canada politician) and 7th Parliament of Upper Canada · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/John_Cameron_(Upper_Canada_politician)"}], "John Cameron served in the Legislative Assembly of Alberta.": [{"url": "https://www.wikiwand.com/en/John_Cameron_(Alberta_politician)", "page_content": "John Cameron (May 28, 1846 – October 6, 1919) was a merchant and politician in Alberta, Canada and a municipal councillor in Edmonton. He is regarded as one of the city's pioneer citizens.\n\nCanadian politician\n\nQuick facts: John Cameron, Alderman on the Edmonton Town C... ▼\n\nBorn in Canada West (later Ontario), Cameron worked as a merchant in his birth province and Manitoba before coming to Edmonton in 1881. In Edmonton he continued as a merchant, owning and operating a store for 15 years. In Edmonton he quickly established himself as a prominent citizen, serving on the inaugural Edmonton Board of Trade as president, which he would remain for five years. Cameron also was involved in the development of the Edmonton Public School Board, serving on the board in the 1890s. He was also involved in the town's politics, winning election to Edmonton's first town council in 1892 and serving an additional term when elected in 1895. After this retirement from politics, he worked in the coal and real estate business until his death in 1919, at the age of 73. Upon his death, he was lauded as one of the pioneer citizens of Edmonton; a street, neighbourhood and ravine were named for him."}, {"url": "https://www.assembly.ab.ca/learn/the-legislative-assembly", "page_content": "Bills Introduction\n\nMLAs introduce Bills at first reading and then debate them in three stages: second reading, Committee of the Whole and third reading.\n\nOnce a Bill has passed third reading, Royal Assent is given by the Lieutenant Governor, enabling the Bill to become law."}, {"url": "http://assembly.ab.ca/", "page_content": "Live Feed\n\nCheck out the live feed that plays current content as it happens. Session, committees, Speaker-hosted events and retro QP, which are rebroadcasts of past Oral Question Periods shown at 1:30 p.m. and 7:30 p.m., can be seen here or on Assembly TV (Channel 843 (Telus), 930 (Shaw) and 263 (Shaw BlueCurve).\n\nViewers can enjoy seasonal visuals as well as profiles of some of the 87 constituencies in Alberta when there are no live events."}, {"url": "https://www.cbc.ca/news/canada/edmonton/alberta-legislature-matt-piper-adrienne-lamb-grounds-1.5711547", "page_content": "Matt Piper is one of those lucky people who love their job.\n\nThe heritage interpreter at the Legislative Assembly of Alberta gives tours of the iconic building and the extensive grounds at 10800 97th Ave.\n\nHis brisk walking pace is a signal there's a lot to take in.\n\nThe wading pools and fountains remain closed due to COVID-19, but there's still lots to see including the gift shop and theatre. You can even take a tour if you register ahead online.\n\nHere are some of the hidden gems on the grounds that are sure to surprise if you're willing to do a little searching.\n\nHeritage interpreter Matt Piper tours visitors through spots like the Lois Hole Memorial Garden on the grounds of the Alberta Legislature. (Adrienne Lamb/CBC)\n\nPetrified Wood\n\nNot far from the left turn from 97th Avenue onto the High Level Bridge is a stump of petrified wood. Scientists estimate the stump found near Peers, Alta., is between 10 and 20 million years old. Petrified wood, it turns out, is the official stone of Alberta.\n\nPetrified wood found near Peers, Alta., is one of the stops on the tour of the legislature grounds. (Adrienne Lamb/CBC)\n\nFrancophone Monument\n\nNestled between the wading pools and the periscope near the Alberta Legislature Annex building stands a work by Franco-Alberta artist Herman Poulin. The work combines a fleur-de-lis and a wildrose, the official flower of Alberta.\n\n\"The wildrose is designed like an open book, so it represents the importance of Francophone culture, literature and the language in Alberta,\" says Piper, who confesses this is his favourite work on the grounds.\n\nHe points out small impressions on the work, the fingerprints of 1,166 Franco-Alberta children from across the province.\n\n'It's just a great public space' Duration 1:31 Tag along on a tour of some of the highlights to be had on the grounds of the Alberta Legislature in Edmonton.\n\nKwakiutl Totem Pole\n\nRight next to the lawn bowling pitch you'll find this work by Turnour Island First Nations artist Oscar Matilpi. The totem pole was donated to Alberta in 1971 by British Columbia First Nations to mark the 100th anniversary of that province joining confederation.\n\nYou can see more from the grounds of the Alberta Legislature on this week's Our Edmonton Saturday at 10 a.m., Sunday at noon and holiday Monday at 11 a.m. on CBC TV and the CBC GEM.\n\nThe Canada 150 Garden is one of the newest additions to the grounds. (Adrienne Lamb/CBC)\n\nCanada 150 Garden\n\nOne of the newer spaces on the west side of the legislature grounds was unveiled in June 2017. The Canada 150 Garden features 13 bushes representing the ten provinces and three territories, and 4,500 decorative paving stones. Ongoing restoration of the legislature means you may have a tough time taking a picture of the maple leaf in the middle.\n\nUkrainian Centennial Pioneer Monument\n\nErected in 1991, a triptych honouring the three waves of Ukrainian settlers to the province is located on the northwest grounds near the dome fountain. The triptych doubles as a time capsule set to be open in 2091.\n\nHolocaust Memorial\n\nThe sculpture near the south amphitheatre is a cracked kiddush cup with barbed wire around the base. Below the work created by Susan Owen Kagan, an inscription from pastor Martin Niemöller reads, \"When you stand here be silent, when you leave, be not silent.\"\n\nThe Holocaust Memorial, unveiled in 2003, is steeped in symbolism and significance. (Adrienne Lamb/CBC)\n\nCentennial Flame\n\nThe flame directly south of the legislature building commemorates the first 100 years of confederation. Piper and other tour guides will tell you the natural gas flame has never been extinguished by the elements, flickering through snow, rain, wind, even the infamous Edmonton Tornado of 1987."}, {"url": "https://www.ipac-edmonton.ca/board-executive", "page_content": "Dave Ludwick\n\n(Vice Chair , Acting Chair )\n\nDave is the Executive Director of Corporate Services for the Legislative Assembly of Alberta. Prior to that he served as an executive director at two primary care networks in Alberta.\n\nDave graduated from the University of Manitoba as an engineer. He then\n\ncompleted an MBA (Finance and accounting) at uOttawa and later completed a PhD at the University of Alberta in Health Informatics.\n\nDave is a road cyclist and tries to ride about 5,000 km per year. He's a musician (piano and guitar) and he also restores vintage cars."}, {"url": "https://en-academic.com/dic.nsf/enwiki/6514360", "page_content": "Infobox Politician (general)\n\nname= John A. Cameron\n\n\n\n\n\nimagesize=300\n\ntitle= Alderman on the Edmonton Town Council\n\nterm_start= February 10, 1892\n\nterm_end= January 13, 1893\n\nterm_start2= January 14, 1895\n\nterm_end2= January 13, 1896\n\nbirth_date= 1845\n\ndeath_date = October 1919\n\nprofession= Businessman\n\nJohn A. Cameron (born 1845, died October 1919) was a politician in Alberta , Canada and a municipal councillor in Edmonton .\n\nBiography\n\nCameron moved from Winnipeg to Edmonton in 1881 by ox-cart, bringing with him 96000 pounds of freight on a journey that took three months. This freight made up the initial stock of his A McDonald Company, which he managed for fifteen years. He was the first President of Edmonton's Board of Trade when it was founded in 1891, and served on the public school board until 1897.\n\nHe was elected to Edmonton's first town council in 1892, finishing fifth of fourteen candidates (the top six were elected). He was defeated in his 1893 re-election bid, in which he finished seventh of nine candidates. He briefly returned to the council after being elected again in 1895, but did not seek re-election the following year and remained out of politics thereafter.\n\nHe died in October of 1919. Cameron Heights, an Edmonton neighbourhood, is named in his honour.\n\nReferences"}, {"url": "https://www.alberta.ca/how-government-works.aspx", "page_content": "Organization\n\nIn the Province of Alberta the Lieutenant Governor represents the monarch, the King of Canada, in the Crown's role as head of state. Lieutenant Governors are appointed by the Governor General on the advice of the Prime Minister of Canada.\n\nBased on provincial population statistics, Alberta is divided into 87 regions which are known as constituencies. During a provincial election (held by law every 4 years), the candidate in each constituency who wins the highest number of votes becomes the constituency representative as Member of the Legislative Assembly (MLA). The leader of the political party with the most winning candidates becomes the Premier of Alberta. The premier, as head of the elected government, governs the province on a daily basis in the monarch’s name.\n\nLegislative assembly\n\nAll provincial governments in Canada are unicameral, meaning that there is only one body of elected representatives. (Federal or municipal governments are separate). In Alberta, this body is called the Legislative assembly where elected representatives from the 87 constituencies meet to determine and debate government priorities.\n\nThe Speech from the Throne opens each new session of the Legislative assembly and outlines the broad goals and direction for the elected government.\n\nMembers meet for a new legislative session of the assembly each spring and may continue into the fall to introduce the provincial budget and, if desired, pass new laws or update, amend or repeal existing ones.\n\nThe provinces’ areas of responsibility, as defined in the Constitution Act, 1867 (earlier referred to as the British North America Act, 1867), include health, child welfare, municipal government, transportation, labour, property and civil rights and education.\n\nA law can also be called an Act or a Statute. Laws are introduced as bills which have 3 main types:\n\nGovernment-sponsored public policy Bills\n\nPrivate Members’ public non-monetary policy Bills\n\nPrivate Bills relating to specific matters not of general public concern\n\nLegislative process\n\nMembers introduce Bills in the assembly for ‘1st reading’ termed as such from earlier days of the British Parliament when printing was not commonplace. At that time, the entire Bill was read aloud in the House to inform members of its contents.\n\nToday, the Clerk reads only the Bill title aloud, and 1st reading means that the Bill is formally introduced into the assembly process for further scrutiny. A Bill must receive 3 separate readings on different days before being passed.\n\nAfter 1st reading, members study the proposed contents of the Bill and decide whether to support all of it, some parts of it or oppose it altogether when 2nd reading begins.\n\nThe 2nd reading stage is where members debate the principle and purpose of a Bill.\n\nDebate of Bills is sometimes emotional and has to be moderated. This is the Speaker’s duty. The Speaker keeps the debate running as smoothly as possible while giving all members a fair chance to speak before calling for a vote. Voting is by simple majority.\n\nIf passed by a majority of voting members, the Bill is sent to Committee of the Whole, which consists of all MLAs, as the next stage. At committee, a more detailed Bill discussion, clause by clause if necessary, is heard. Amendments may come about here as a result of points raised in debate or concerns expressed by constituents.\n\nThe final stage of a Bill’s journey is 3rd reading. Again members have a chance to comment on, criticize or ask questions about the Bill before voting on it for the final time.\n\nIf a Bill fails to pass any one of these 3 stages, it cannot become law and must be reintroduced, usually not until the next session of the Legislature.\n\nMost government-sponsored Bills pass because the governing party normally has a majority of the members in support. Because they do not enjoy the same degree of backing, most private Members’ Bills do not get past 2nd reading. However, sometimes even government Bills do not reach the final stages. This may be an indication the government did not intend the Bill to pass but was instead trying to gauge public opinion on the issue the Bill addresses. In that case, the Bill may be amended and introduced in a later session or dropped altogether and rewritten. In other instances public opposition to the Bill may cause the government to withdraw it.\n\nIf the Bill is supported by a majority of MLAs, it moves to the next stage, which is Royal Assent.\n\nRoyal Assent is provided by the Lieutenant Governor of Alberta who approves the bill on behalf of the Crown. After Royal Assent the bill becomes law.\n\nThe final step is to set the date it comes into effect or into force. The Lieutenant Governor or the government sets the starting date for the law to come into force, this is called proclamation. Proclamations may be used if a bill is to come into effect at a date after Royal Assent or if different parts of a Bill are to come into effect at different times.\n\nPublished laws\n\nThe law is published as a Statute also known as an Act. Within the Act is the authority to make Regulations. Regulations are rules to address details and practical applications of the law. Ministerial Orders can also make Regulations, some ministerial orders are published by the Alberta King’s Printer.\n\nA Ministerial Order is created by a Minister under a Statute or Regulation. Ministerial Orders are made for a variety of purposes, including program delivery, creating committees, appointing committee members, setting rates and fees, designating positions and vesting Ministerial authority in others.\n\nCodes and codes of practice are rules that must be followed for those operating under an Act to set safe work or environmental practices.\n\nGeneral decisions of government are made by Orders in Council, they are the instrument by which the Lieutenant Governor in Council makes its orders. These orders may or may not be a Regulation, as defined in the Regulations Act.\n\nThe Alberta King’s Printer (known as King's Printer during the reign of a male monarch) has been the official publisher of Alberta’s laws, the Alberta Gazette, the Registrar’s Periodical and official government publications since 1906.\n\nOther assembly roles\n\nExecutive Council Office\n\nThe Executive Council Office provides support to the Premier and the members of Executive Council. It ensures effective strategic planning and coordinated policy development across government, and engagement of Albertans. The office is led by the Deputy Minister of Executive Council.\n\nThe Cabinet\n\nThe Cabinet or Executive Council puts government policies into practice. Cabinet ministers are MLAs in charge of specific government ministries. Beyond approving Orders in Council, Cabinet ratifies policy matters and is the final authority on issues related to the day-to-day operation of government. The Premier chairs Cabinet.\n\nThe Speaker\n\nThe Speaker directs debates and proceedings in the Legislative Assembly. The Speaker is an elected MLA. At the beginning of the first Legislative session after an election, all MLAs vote for the Speaker by secret ballot.\n\nThe Opposition\n\nThe Opposition is made up of MLAs who aren’t part of the governing party. The role of the Opposition is to critique government activity, propose improvements to legislation, and present itself to the public as an alternative to the party in office. The party with the most opposition seats in the Assembly and is called the Official Opposition.\n\nMembers of the Legislative Assembly\n\nMembers of the Legislative Assembly (MLAs) are elected by Albertans to make the laws we live by in this province. Each MLA represents a constituency. MLAs selected by the Premier to represent ministries are referred to as cabinet ministers. Those who aren’t in Cabinet are referred to as private members, or caucus members of their particular political party.\n\nMinistries\n\nSeveral ministries make up the Alberta government. These departments deliver the programs and services mandated by Alberta’s laws. Each ministry is headed by a deputy minister, a member of the Alberta public service who in turn reports to a minister, an elected official and member of Cabinet.\n\nPublic agencies\n\nPublic agencies are boards, commissions, tribunals or other organizations established by government, but not part of a government department. They work alongside ministries to deliver programs and services. The Public Agency Secretariat helps ensure Alberta government agencies are well governed.\n\nGovernment committees\n\nGovernment committees review policy decisions, long-range strategic priorities, legislation and regulations. These committees include Treasury Board, Legislative Review Committee and others.\n\nPublic service\n\nAlberta’s public service is made up of over 25,000 government employees throughout the province. Each works for a ministry, or a public agency. They perform the legal, policy, administrative and practical duties needed to deliver programs and services to Albertans."}, {"url": "https://infogalactic.com/info/List_of_premiers_of_Alberta", "page_content": "From Infogalactic: the planetary knowledge core\n\nThe list of premiers of Alberta consists of the 17 leaders of government of the Canadian province of Alberta since it was created in 1905. Three were Liberal, three were United Farmers of Alberta, three were Social Credit and seven were Progressive Conservative. The currently elected and serving premier is New Democratic.\n\nAlberta uses a unicameral Westminster-style parliamentary government, in which the premier is the leader of the party that controls the most seats in the Legislative Assembly. The premier is Alberta's head of government, while the Queen of Canada in right of Alberta is its head of state and is represented by the Lieutenant Governor of Alberta. The premier picks a cabinet, usually from the elected members of the Legislative Assembly, to form the Executive Council of Alberta, and presides over that body.\n\nMembers are elected to the legislature during general elections or by-elections. Barring special legislation occasioned by a war or an emergency (which has never happened in Alberta's history, although it has federally), general elections must be called by the lieutenant governor, at the Premier's advice, no later than five years after the previous election, but the premier may ask (and almost always has asked) for dissolution of the legislative assembly and a subsequent election earlier than that. Under Alberta's fixed-election legislation of 2011, a general election is to be held on a day (by custom, a Monday) between March 1 and May 31 in the 4th calendar year following the most recent general election, but the premier can bindingly advise the lieutenant governor to call an election earlier than the fixed date.\n\nAn election may also happen if the governing party loses the confidence of the legislature, by the defeat of a supply bill or tabling of a confidence motion, but in Alberta's history of massive majorities in the assembly, this has not happened yet in the province's history. (Although Aberhart's first term as Premier was almost cut short, when a large part of his caucus showed willingness to vote against his government's budget. But when he promised to bring in radical banking reform they were satisfied.)\n\nA leader of a party is chosen by the party, following an internal constitution unique to each party that comprises a framework to elect or appoint a leader. The leader, if he or she does not already have a seat, must then win a seat in a by-election or general election to sit in the Assembly. If a leader of a party does not have a seat, he or she must sit in the legislature gallery. While sitting in the gallery a premier cannot exercise any legislative powers.\n\nPrior to 1905, Alberta was part of the North-West Territories and as part of this jurisdiction was governed by the Legislative Council of the North-West Territories, composed of elected and appointed officials, led by Lieutenant-Governors of the North-West Territories until 1897, and the Premier of the North-West Territories from 1897 to 1905.\n\nSince 1905, Alberta has had only five different parties in power, with only four changes of government.\n\nHistory\n\nLiberal Party 1905–1921\n\nThe Liberal party got its start in power in Alberta when Prime Minister Wilfrid Laurier appointed Alexander Rutherford, a prominent liberal and former elected NWT Assembly member, as interim premier in 1905. He and other Liberals organized the province's first election.\n\nRutherford's Liberal party was elected, with a majority of the popular vote and a majority of seats in the Legislative Assembly in the province's first election, the 1905 Alberta election. The north-central constituency boundaries radiated out from Edmonton and some say this was a case of gerrymandered electoral boundaries.[1] Rutherford emerged from the March 1909 election leading another formidable majority, that clearly reflected the broad popular support he and his government enjoyed. He would resign as premier 14 months later, in May 1910, after his government was implicated in the Alberta and Great Waterways Railway scandal.[2]\n\nArthur Sifton replaced Rutherford as premier. Shortly before the 1913 election Sifton's Liberals jammed through a controversial bill greatly expanding the size of the legislative assembly. The bill was once again said to gerrymander boundaries in Liberals' favor, although the Liberals again received more votes than any other party in the 1913 election.[3][4] The press and opposition would term his reign as premier \"Siftonism\" implying that his reign was a disease on Alberta.[5] Sifton only lasted one term as premier as he left to pursue a career in federal politics.[6]\n\nCharles Stewart replaced Sifton and held the Liberal government through the lackluster 1917 election which 11 MLAs serving in the armed forces were automatically re-elected. The elected opposition was the strongest so far in the province's 12-year history. The Conservatives, which formed the official opposition with 19 seats, slightly more than one-third of the seats in the Assembly, expressed hopes they had the upper hand on the waning Liberal government. Both would be surprised by the United Farmers who routed the Liberals and Conservatives in rural areas to form the government in the 1921 election.\n\nUnited Farmers 1921–1935\n\nAlberta's second dynasty was the United Farmers of Alberta, a farmers' movement organization, formed in 1909 as a lobby group, whose political wing rose from a minor party named the Alberta Non-Partisan League, formed in 1916. Henry Wise Wood led the party at the time of the 1921 election, although he did not run himself. The loosely organized farmer candidates running in rural constituencies captured a majority of the seats. The party was allied with Labour candidates, so it did not contest urban ridings, aside from one in Edmonton. Wood did not want the job as premier so the farmers were forced to shop around. UFA lawyer John Brownlee was asked first but declined. UFA executive member Herbert Greenfield, the second choice, became the new premier, although he too had not run in the election so had to await success in a by-election to take his seat.[7] Greenfield resigned four years later because he was often absent due to illness and lost much of his energy due to the death of his wife shortly after the election.\n\nJohn Brownlee, who had previously been offered the job, succeeded Greenfield. Brownlee's reign as government leader was troubled by the onset of the Great Depression. He resigned in scandal after he was accused of sexual acts with a minor in the Attorney General's office. This and another scandalous divorce by UFA MLA Oran McPherson, speaker of the Legislative Assembly, gave the United Farmers an image of moral decay.[8] In 1934 Richard Reid replaced Brownlee but served as premier for less than two years, leading the United Farmers government into total defeat at the hands of the new Social Credit party.\n\nSocial Credit 1935–1971\n\nAlbertans turned away from the United Farmers government and began to follow evangelical radio preacher William Aberhart, known as Bible Bill. The Social Credit party had been founded in 1932. Voters flocked to the radical monetary reforms proposed by Aberhart and British SC theorist Clifford Douglas, looking for an escape to the Great Depression. Social Credit was elected with a majority (54 percent of the vote) in the 1935 election completely wiping out the United Farmers representation (although the UFA did receive 11 percent of the vote). Aberhart had difficulty implementing the Social Credit theory and his popularity began to decline. His government almost fell during a 1936 caucus rebellion, in which his own MLAs forced him to promise to try to reform the banking system. But it rebounded and in the 1940 election it garnered more votes than any other party and also captured a large majority of the seats.[9] Aberhart died in 1943; he is the only premier to die in office in Alberta's history.\n\nErnest Manning succeeded Aberhart as premier. Under Manning, Social Credit moved away from the monetary theory of Douglas and towards traditional conservatism. Manning lead the party through seven-straight massive majorities, (although in 1955 his government received barely more seats than Aberhart had received in 1940, due to a strong but short-lived Liberal drive). After 24 years as premier, Manning resigned in 1967.\n\nHarry Strom, a long time cabinet minister, replaced Manning and lead the party to defeat in the 1971 election at the hands of the Progressive Conservatives under Peter Lougheed. Strom and his government looked old and tired and out of touch compared to the new Progressive Conservatives.\n\nProgressive Conservative 1971–2015\n\nThe fourth government of Alberta was first led by Peter Lougheed, defeating the 36-year reign of Social Credit in 1971.\n\nPeter Lougheed served as premier, winning four elections, until 1985 when he retired from public office. Some of Lougheed's notable accomplishments were the limited Alberta Bill of Rights, and the Heritage Trust Fund.[10]\n\nDon Getty, one of Lougheed’s long-time cabinet ministers, returned to politics to win the leadership of the party. Getty's premiership was endorsed by a win in the 1986 general election that saw the NDP climb to 16 seats as the official opposition. Getty's reign became very unpopular as he led Alberta into large deficit spending, and marked an era of big government that, some said, the province could not afford. In the 1989 election he was defeated in his Edmonton-Whitemud riding, while his party still won a majority. He sat in the gallery as an unelected Premier until he won a seat in a by-election in Stettler.[11] His refusal to leave as premier helped Laurence Decore's Liberals skyrocket in popularity. Getty resigned and was replaced in a bitter leadership battle by Ralph Klein.[12]\n\nRalph Klein, the former mayor of Calgary, led the party into the 1993 election, promising a new era of debt reduction and fiscal accountability. He walked away with a slim majority. Ralph Klein's folksy appeal helped the Progressive Conservatives renew themselves. He led the party through two elections, gaining in popularity each time. The price of oil rebounded and the government, despite low rates of taxes on the wealthy and corporations, was showing a surplus of $3 billion every year. In early 2004, Klein announced that the Alberta debt had been paid in full.[13] He was rewarded by voters in the 2004 election, despite running a campaign with no new policies. His party lost a number of seats, and during the campaign he stated this would be his last election. In 2006 at a Progressive Conservative convention delegates forced him to pick a retirement date by giving him relatively low numbers in a leadership review.[14]\n\nEd Stelmach succeeded Klein as premier, following his win of the leadership of the Alberta Progressive Conservative party in 2006. He won the 2008 provincial election, but, troubled by dissension within his party, resigned as the party celebrated its 40 years in power in 2011.\n\nAlison Redford subsequently was elected party leader and became the first female Premier of Alberta. Despite strong opposition from the Wildrose Party that most polls and media predicted would end the PC's 41-year dynasty, Redford and the PC party won re-election in April 2012, making Redford Alberta's first elected female premier. Due to a steep decline in approval ratings and a spending controversy,[15] Alison Redford announced her resignation on March 19, 2014, as premier of Alberta, effective March 23.[16]\n\nAlberta Deputy Premier Dave Hancock was selected as interim party leader by the Progressive Conservative caucus on March 20, 2014,[17] and became interim premier on March 23, 2014.\n\nJim Prentice was elected as the permanent leader of the PC Party on September 6, 2014 and succeeded Hancock as premier on September 15, 2014. He turned the government around on a number of crucial issues, cancelling the closure of the Michener Centre, for example. He was elected to a seat in an October 27, 2014 by-election. The Prentice Conservatives won the four by-elections held that day while the rival Wildrose Party did very poorly. Less than two months later, much of the Wildrose Party caucus crossed the floor to sit with the Conservatives.\n\nOn May 5, 2015, Jim Prentice and his party were crushed, losing 60 seats in the Legislature, while the NDP took a large majority of the seats. Prentice resigned as PC Party leader and resigned his seat in the constituency of Calgary-Foothills, leaving the PC Party with only 9 seats.\n\nNDP 2015–present\n\nRachel Notley was appointed and sworn in as premier on May 24, 2015, following her party's having won a majority in the 2015 general election, with 54 out of 87 seats in the Legislature. On May 22, 2015, Notley suspended a caucus member, leaving her party with 53 out of 87 seats, still enough to form a strong majority.\n\nList of premiers\n\nGraphical representation\n\nLongest and shortest terms\n\nErnest Manning is the longest serving Premier at 25 years and 7 months. Dave Hancock served the shortest term with just short of 6 months in office as Premier.\n\nLiving former premiers\n\nAs of May 2015 , four former premiers are alive, the oldest being Don Getty (1985–1992, born 1933). The most recently serving former premier to die was Ralph Klein (1992–2006, 1942–2013), on March 29, 2013.\n\nSee also\n\nReferences"}, {"url": "https://www.cbc.ca/news/canada/edmonton/alberta-hamburger-clarence-copithorne-legislature-1.5066149", "page_content": "Clarence Copithorne came from one of Alberta's most storied ranching families.\n\nSo he knew a good burger when he saw one.\n\nOr bad burger, for that matter.\n\nOne day in 1969, as one of six MLAs for an upstart party called the Progressive Conservatives, Copithorne momentarily calf-roped a lengthy debate in the Alberta legislature when he reached into his desk and pulled out the hamburger he'd been served for lunch in the cafeteria.\n\nWhy is there a hamburger in the legislature library? Duration 0:51 Valerie Footz from the Alberta Legislature library explains why a hamburger from 1969, encased in resin, is available for consultation.\n\nAfter a few choice remarks about proper nourishment, and some barbs aimed at the Social Credit government of then-premier Ernest Manning, the MLA for Banff-Cochrane \"tabled\" the offending burger and handed it to a clerk.\n\nHis remarks were greeted with bipartisan applause and some vigorous desk thumping in the house.\n\nThe clerk had the infamous hamburger encased in glass, and gave it back to the man who went on to become highways minister after Peter Lougheed's Tories swept to power in 1971.\n\nCopithorne died in 1979. Years later, his son found the relic in the garage and gave it back to the legislature, where it has since occupied a place of honour in the library.\n\nThe official certification is encased in the resin along with the burger. (Alberta Legislature Library)\n\nOn Thursday evening, the Legislative Assembly of Alberta will host a party and tour to commemorate the burger's 50th anniversary.\n\nThe sold-out event will be held from 6 p.m. to 8 p.m. and Legislative Assembly of Alberta Visitor Centre at 9820 107th St.\n\nCake will be served.\n\nNo word about hamburgers."}, {"url": "https://www.assembly.ab.ca/about/news-and-announcements/2022/02/07/celebrate-the-platinum-jubilee-with-the-legislative-assembly-of-alberta", "page_content": "February 7, 2022 Celebrate the Platinum Jubilee with the Legislative Assembly of Alberta\n\nCategory: Events News\n\nEDMONTON – “Many Albertans share a deep connection and admiration for the British monarchy,” said Honourable Nathan Cooper, Speaker of the Legislative Assembly of Alberta. “I invite Albertans to join the Legislative Assembly in celebrating the unparalleled 70-year reign of Her Majesty Queen Elizabeth II, Queen of Canada, by sharing congratulatory messages or personal stories and photos of their favourite memories related to the Royal Family.”\n\nAlbertans may join the Platinum Jubilee celebrations by composing congratulatory messages for the Queen and by sharing original artwork, photos, videos or memories related to the Royal Family on the Legislative Assembly’s website at assembly.ab.ca. Messages and images may also be submitted on Facebook, Twitter or Instagram using #ABlegJubilee.\n\nThe Legislative Assembly will feature a selection of submissions online and in a video presentation to be unveiled later this year. Additional initiatives including on-site tours and displays are being planned throughout the year.\n\nThe Platinum Jubilee marks the 70th anniversary of Her Majesty’s service to the United Kingdom and the Commonwealth. For seven decades she has been an enduring symbol of the constitutional monarchy in Canada. She has served as head of state of Canada since 1952 and is royal patron to over 600 charities, associations and organizations, of which 36 are in Canada.\n\nAlberta has historically recognized jubilee milestones. To mark Her Majesty’s Diamond Jubilee, Colonel (Ret'd) the Honourable Donald S. Ethell, Lieutenant Governor of Alberta from 2010 to 2015, hosted a garden party at the Alberta Legislature on June 2, 2012. The free event featured live performances by talented Albertans and Canadians, monarchy-themed tours and children’s games.\n\nIn Canada’s constitutional monarchy the Crown has certain ceremonial and constitutional responsibilities. The Crown is the sovereign authority and an integral part of the legislative, executive and judicial powers, which are exercised by elected federal and provincial governments.\n\n- 30 –\n\nMedia Inquiries:\n\nTracey Sales, Communications Consultant\n\nLegislative Assembly of Alberta\n\nMobile: 780.862.6446\n\ntracey.sales@assembly.ab.ca"}], "John Cameron retired in 1935.": [{"url": "https://www.espncricinfo.com/player/john-cameron-51460", "page_content": "John Hemsley Cameron, the son of Dr J.J. Cameron of the 1906 West Indies team to England, died in Chichester, Sussex on February 13 aged 85. He was a middle-order right-hand bat and versatile bowler of high tossed leg-breaks and off-breaks who sprang to fame when, as a Taunton School pupil, he played for the Rest against Public Schools at Lord's in 1931 and recorded innings figures of 10 for 49 in 19.1 overs. He made his debut for Somerset the following season and played in 47 matches for them until 1947.\n\nHe also won his blue at Cambridge in 1935-37, was vice-captain of the 1939 West Indies team to England, when he played two Tests and took the wicket of Harold Gimblett with his second ball in Test cricket, and in 1946 he turned out for Jamaica. Unfortunately Cameron never quite fulfilled his early promise, losing his ability to spin from leg, and his career record saw him take 184 first-class wickets at 30.77 apiece. His best innings analysis was 7 for 73, for Cambridge against Oxford in the 1935 University match at Lord's, figures which set his side on the road to a comfortable victory.\n\nA valuable batsman, though again inconsistent, Cameron scored 2,772 runs at an average of 18.73, and the highest of his four centuries was 113 for Somerset versus Sussex at Eastbourne in 1937, made five days after scoring a century against Kent.\n\nCameron, whose brother F.J. appeared for West Indies against India in 1948/49 and toured England with the 1954 Canadian team, encountered mixed fortunes off the cricket field and was once found destitute in London.\n\nHe recovered well, however, and after working at Millfield School he became an assistant master at Chigwell School.\n\nRobert Brooke, The Cricketer"}, {"url": "https://www.wikizero.com/www//John_Cameron_(1872-1935)", "page_content": "Scottish footballer and manager\n\nJohn Cameron (13 April 1872 – 20 April 1935) was a Scottish footballer and manager. He played as a forward for Queen's Park, Everton and Scotland and was noted as an effective goal-maker and goalscorer. In 1899 he became player-manager at Tottenham Hotspur and guided them to victory in the 1901 FA Cup. As a result, they became the only club outside the English Football League to win the competition. In 1898 he became the first secretary of the Association Footballers' Union, which was the ill-fated fore-runner of the Professional Footballers' Association. He later coached Dresdner SC and during the First World War he was interned at Ruhleben, a civilian detention camp in Germany. After the war he coached Ayr United for one season and then became a football journalist, author and publisher.[3] He had previously worked as a columnist for various newspapers before the war.\n\nEarly career [ edit ]\n\nBorn in Ayr and educated at Ayr Grammar School, Cameron began his career with local club Ayr Parkhouse, before moving to Queen's Park in early 1895.[4] He made 5 Glasgow Cup appearances and scored one goal for the Spiders (who were not members of the Scottish Football League at the time).[2]\n\nHe worked in a shipping office in Liverpool and joined Everton in September 1895 as an amateur, and then turned fully professional.[5] He switched from a centre-forward to an inside-forward while he was at Everton.[5] He made his senior debut in a 5–0 home League win over Sheffield United in October 1895. Cameron produced some excellent displays for Everton and made 48 appearances and scored 14 goals. This record included 6 games and 2 goals in the FA Cup. Cameron had been one of the highest earning footballers of the day with Everton. He returned to Queen's Park for two short spells in the second half of the 1895–96 season, making four appearances,[2] and also won a cap for Scotland: alongside Robert Smyth McColl, he played in a 3–3 draw with Ireland and helped Scotland win the 1896 British Home Championship.\n\nIn February 1898 while contracted to play for Everton, Cameron became involved in the movement toward unionisation of footballers in defiance of both League directives and club proposals which resulted in the power of players to seek high earnings. As the League were not willing to negotiate on this point Cameron broke contract with Everton and went to play for Tottenham Hotspur in the Southern Football League, directly because that League did not support the proposal to limit earnings.\n\nTottenham Hotspur [ edit ]\n\nOgden's Cigarette card of John Cameron after winning the 1900–01 FA Cup.\n\nIn May 1898 Cameron was signed by Frank Brettell as a player for Tottenham Hotspur. When Brettell was offered a better-paid position at Portsmouth and moved there in February 1899, Cameron succeeded Brettell and became player-manager for Tottenham.[5] He enjoyed instant success when, in his first game in charge, Tottenham became the first lower division club ever to come from behind against top flight opposition to win an FA Cup tie, Cameron himself scoring the winning goal against Sunderland.[6] In 1900 he led Tottenham to the Southern Football League title and a year later led them to victory in the 1901 FA Cup Final: after drawing 2–2 with Sheffield United, Tottenham eventually won the replay with Cameron scoring an equaliser in a 3–1 win. As a result, Spurs became the only club outside the English League to win the competition. Under Cameron, the club also finished as a runners-up in the Southern League in 1902 and 1904. Cameron scored 139 goals in 293 appearances, including 43 goals in 111 appearances in the Southern League. He resigned as Tottenham manager in March 1907.\n\nPrisoner in Germany [ edit ]\n\nAfter Tottenham Hotspur, Cameron worked briefly as a sport journalist, before going to Germany to coach Dresdner SC.[4][5] While there the First World War broke out and he was subsequently interned at Ruhleben, a civilian detention camp in the Spandau district of Berlin.[4] The camp contained between 4,000 and 5,500 prisoners. Gradually a mini-society evolved and football became a popular activity. Cup and league competitions were organised and as many as 1,000 attended the bigger games. Cameron was prominent in organising and playing football within the camp and was secretary of the Ruhleben Football Association.[4] During his time at the camp he was also a member of the Ruhleben Tennis Association.\n\nCameron was one of several former professional footballers at Ruhleben. Others included former England internationals Fred Pentland, Samuel Wolstenholme and Steve Bloomer, a German international Edwin Dutton and one of his former Tottenham players, John Brearley. On 2 May 1915 an England XI featuring Pentland, Wolstenholme, Brearley and Bloomer played a World XI captained by Cameron.[7]\n\nCareer statistics [ edit ]\n\nInternational [ edit ]\n\nAppearances and goals by national team and year National team Year Apps Goals Scotland 1896 1 0 Total 1 0\n\nHonours [ edit ]\n\nPlayer [ edit ]\n\nScotland\n\nTottenham Hotspur\n\nSources [ edit ]\n\nWho's Who of Everton (2004): Tony Matthews\n\n(2004): Tony Matthews Brown, Paul (2020). The Ruhleben Football Association: How Steve Bloomer's Footballers Survived a First World War Prison Camp. Goal Post. ISBN 9780995541238 ."}, {"url": "https://www.ancestry.com/genealogy/records/john-cameron-24-6jcdb4", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://www.ancestry.com/genealogy/records/john-cameron-24-24ft80f", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://www.ancestry.com/genealogy/records/john-cameron-24-4xwk5l", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "http://coldcasecameron.com/john-a-camerons-bio/", "page_content": "John A. Cameron is a 55 year old retired police detective from Great Falls, Montana. His career in law enforcement began in 1979. He retired in 2005 as a sergeant of detectives, working cold cases. He has worked on FBI serial killer task forces, catching ritualistic child cannibal killer, Nathan Bar-Jonah. His cases have been featured on America’s Most Wanted, Dateline NBC, and he helped produce a series known as Most Evil-True TV.\n\nListen to John A Cameron on Coast to Coast AM, May 31, 2014 talk 4 hours about Edward Wayne Edwards\n\nIn 2010, while working as an analyst for the Montana Board of Pardons and Parole in Deer Lodge Prison, Montana, he was in a position to access information that had been kept secret for 55 years, unraveling the most intelligent serial killer ever.\n\nSummary\n\nBorn in Duluth, Minnesota, 1961\n\nGraduate Denfeld High School, 1979\n\nGraduate of Alexandria, Minnesota Law Enforcement Academy, August, 1981\n\nHired by Great Falls Police in 1981 and retired at the rank of Sergeant in 2005\n\nWent to work in 2008 for the Montana Board of Pardons and Parole in Deer Lodge Prison as a parole board analyst. It was in this position that I befriended serial killer Edward Wayne Edwards\n\nEducation\n\n1979-81, August. Graduate Associates Degree in Law Enforcement, Alexandria Vocational Technical Institute, Alexandria, Minnesota\n\nGraduate Associates Degree in Law Enforcement, Alexandria Vocational Technical Institute, Alexandria, Minnesota 1981, October. Graduate Basic Law Enforcement Certificate, Montana Law Enforcement Academy, Bozeman, Montana\n\nGraduate Basic Law Enforcement Certificate, Montana Law Enforcement Academy, Bozeman, Montana 1985, October. Graduate Intermediate Law Enforcement Certificate Montana Law Enforcement Academy, Bozeman, Montana\n\nGraduate Intermediate Law Enforcement Certificate Montana Law Enforcement Academy, Bozeman, Montana 2008, May. Graduate Probation and Parole Officer Academy Montana Law Enforcement Academy, Helena, Montana\n\nHobbies"}, {"url": "https://www.ancientfaces.com/person/john-cameron-birth-1856-death-1935-australia/143353405", "page_content": "Refresh this page to see various historical events that occurred during John's lifetime.\n\nIn 1856, in the year that John Cameron was born, on February 18th, The American Party, also called the \"Know-Nothings\" because they were an anti-Catholic and anti-immigrant movement, assembled in Philadelphia to nominate their first Presidential candidate, former President Millard Fillmore. The party sought to keep the \"purity\" of elections by blocking \"impure\" foreigners.\n\nIn 1868, John was just 12 years old when on January 9th, Great Britain ended the practice of transporting its prisoners to Australia. It ended with the arrival of the convict ship Hougoumont in Western Australia. The trip took 89 days and there were 62 Fenians - people fighting for a free Ireland - among the transportees.\n\nIn 1872, when he was 16 years old, on May 10th, Victoria Woodhull became the first woman to be nominated for President of the United States. She was too young to qualify for President - a year under the minimum age, 35 - and women couldn't vote but she was nominated by the Equal Rights Party, which supported equal rights and suffrage for women. She didn't appear on the official ballot.\n\nIn 1886, by the time he was 30 years old, on January 5th, Scottish novelist Robert Louis Stevenson's book the Strange Case of Dr Jekyll and Mr Hyde was published. Immediately popular, the paperback book was sold for $1 in the U.S. - almost $25 today. Stevenson's stepson said that he wrote the first draft in under 3 days.\n\nIn 1935, in the year of John Cameron's passing, the BOI's name (the Bureau of Investigation) was changed to the FBI (Federal Bureau of Investigation) and it officially became a separate agency with the Department of Justice. J. Edgar Hoover, the Chief of the BOI, continued in his office and became the first Director of the FBI. The FBI's responsibility is to \"detect and prosecute crimes against the United States\"."}, {"url": "https://co-curate.ncl.ac.uk/camerons-brewery/", "page_content": "Camerons Brewery Ltd was founded in 1865 by John William Cameron in Hartlepool . The main brewery building is called the Lion Brewery, built in 1892 . The site has two wells, one of them 250 feet deep, and brewing on the site can be traced back to the 16th century. The brewery has a visitor centre and a Website with a history section.\n\nCamerons Brewery Ltd is a brewery founded in 1865 by John William Cameron in Hartlepool, County Durham, England. It is the largest independent brewer in the North East of England, with a brewery capacity of 1.5 million hectolitres (900,000 hl production in 2012) and a tied estate of 75 houses. It is one of the town's oldest industrial concerns, and has historically been one of the largest employers.\n\nAfter one hundred years of growth through brewery acquisitions, the company had an estate of 750 licensed premises throughout the North East and North Yorkshire by the 1960s. The company subsequently struggled as the economy of its trading heartland suffered, and as it underwent a succession of owners with little experience of running pubs and breweries. Camerons lost its independence to Ellerman Lines in 1974, followed by the Barclay Brothers in 1983 and Brent Walker in 1989. Brent Walker spun off the majority of the tied estate as a separate company called Pubmaster, which was acquired by Punch Taverns in 2003.\n\nCamerons was purchased in 1992 by Wolverhampton & Dudley, which invested heavily in the brewery before selling the company to Castle Eden in 2002, who closed their own site and moved all production to Camerons. The company now has a relatively small tied estate but the ninth largest brewery in the country. As a result, around 80 per cent of its business involves contract brewing for other companies, such as Heineken, which owns 24 per cent of the company, and Carlsberg.\n\nCamerons is known across the United Kingdom for Strongarm, a distinctive ruby red bitter launched in 1955. Total production of Strongarm surpassed one billion pints in 2000. Across the North East it is also known for Castle Eden Ale and Trophy Special, both originally brewed at Castle Eden.\n\nHistory\n\nEarly history\n\nA 250-foot artesian well has been used for brewing on the site since at least 1572. William Waldon (1805 - 1854), a farmer originally from Gainford, founded the Lion Brewery in the village of Stranton (subsequently a part of West Hartlepool) on land he bought from Ralph Walker for £300 in 1852. After Waldon's death in 1854, the brewery passed to his widow, Jane. John William Cameron was enlisted to run the brewery from 1865. In 1872 he took on the brewery and its 16 public houses under a 21-year lease. Henry Wilson, of the Phoenix Works in Stockton-on-Tees, built new brewery facilities for John Cameron in 1875. Further land for expansion of the brewery was purchased in 1876. Between 1885 and 1890 more land was bought and plans were made to build a new brewery. The present brewery building was completed in 1892. When the lease expired in 1893, Cameron purchased the brewery outright from the Waldons for £34,442.\n\nPublic listing and acquisition trail\n\nIn 1894 the company went public, valued at £345,000, and owned 119 public houses. John William Cameron used this juncture to enter into semi-retirement, and managerial responsibility was devolved to his brother, Watson Cameron (died 1920).\n\nNixey, Coleclough & Baxter of the Brunswick Brewery in Hartlepool, was acquired in 1895, along with around 80 public houses. It had been the largest competing brewery in Hartlepool. The newly acquired brewery was closed in 1898, and Nixey and Baxter were both appointed to the Camerons board.\n\nJohn William Cameron died in 1896, by which time the brewery was one of the largest in the North of England.\n\nIn 1897, T E Chapman & Son of Sunderland was acquired with 83 public houses, and its managing director, Abel Chapman, joined the Cameron board of directors. By this time, John Ellerman was vice chairman of Camerons.\n\nThat same year, the Lion Brewery was further extended, to a 70 quarter capacity, capable of producing 130,000 barrels a year. In 1899 Camerons began to bottle mineral water and the company continued to expand. By this time 400 licensed premises were owned, including the majority of Hartlepool's public houses. The company prospered, and by 1907 the share capital of the company was £350,000 with another £350,000 of capital in the form of mortgage debenture stock.\n\nIn 1910, Heslop's Grange Brewery in Stockton was acquired along with 28 licensed houses. John Ellerman was company chairman by 1913. In 1915 the Lion Brewery was damaged by German shellfire. In 1920 Watson Cameron died, and A. J. Morgan and H. J. Hewlett became joint managing directors of the company. Morgan was in charge of organization and the offices, whilst Hewlett was in charge of brewing. Robert Newton Ltd of Newcastle was acquired, with 35 licences, and Plews and Sons Ltd of Darlington, with 100 licensed premises. In 1922, Watson's son, John Watson Cameron joined the company, and in 1935 he was made chairman and managing director.\n\nCameron's ale was sold as far north as Newbiggin-by-the-Sea in Northumberland, as far east as Guisborough, as far west as Hawes and as far south as Thirsk by 1938. Over 400 licensed houses were owned. Directly and indirectly the company employed 1,500 people. Cameron's owned 46 per cent of all public houses within the Borough of Hartlepool by 1939.\n\nIn 1950, John Watson Cameron's wife, Lillian, was appointed to the board, responsible for the furnishings and decoration of Cameron's licensed houses. In 1953, the Stranton bottling facility was opened. In March 1955, Strongarm bitter was introduced, as the industrial workers of West Hartlepool demanded a stronger pint.\n\nIn 1953, a controlling interest was acquired in John J Hunt, which owned the Ebor Brewery in York and Scarborough & Whitby Breweries along with 200 licensed public houses. In 1956 J Fryer & Sons of Brompton-on-Swale was acquired. In 1959 the West Auckland Brewery was acquired with 80 licensed public houses. In 1961 Russell & Wrangham of Malton was acquired with 90 licensed public houses. By 1967 the company had a market capitalization of £6.7 million, or £106 million in 2013 prices. In 1971, John Watson Cameron retired as managing director, although he remained as executive chairman, and his son, John Martin Cameron, became managing director. Camerons introduced its own \"lager\" brand, Icegold, in 1972. Icegold was top fermented and actually a very pale ale rather than an authentic lager.\n\nCorporate ownership\n\nIn January 1974, Ellerman Lines acquired the 25 per cent stake in Camerons previously owned by Sir John Ellerman, 2nd Baronet, who had died. Directors and Cameron family members held a 9 per cent stake and Bass Charrington held 10 per cent.\n\nIn 1975, the company was acquired by Ellerman Lines for £14 million, in an attempt to diversify from its declining shipping business. By this time Cameron's owned 500 pubs and 100 off-licences.\n\nIn 1980 Hansa lager was launched, brewed under licence from Dortmunder Actien Brauerei. Camerons spent £2 million to upgrade their brewing facilities in order to brew bottom fermented lager, in what CAMRA described as \"the most ambitious scheme for a regional brewer yet\". The company had sales of £51 million in 1981, and one per cent of the British beer market. Market share in the Tees Valley area was 25 per cent.\n\nIn 1983, Ellerman Lines was acquired by the Barclay brothers for £45 million. In 1984, the Barclays attempted to sell Camerons to Scottish & Newcastle for £44 million, but the brothers cancelled the negotiations when the government referred the deal to the Monopolies Commission.\n\nIn 1985, Cameron's held five per cent of the UK beer market. In 1985, the maltings building was demolished. Alistair Arkley was appointed managing director in 1985. Arkley split the pub and the brewing sides of the company into separate divisions, and divested the low-margin off-licence business. In 1986, Cameron's acquired 90 pubs from Mansfield Brewery, including 78 northern pubs and clubs, most of which were former North Country Breweries outlets, for £13 million. In 1988, the company expanded into the North West for the first time after it acquired 17 pubs in north Lancashire.\n\nIn 1988, Camerons and Tolly Cobbold were sold to Brent Walker for £248 million. Camerons controlled 480 licensed public houses and 270 hotels and off-licences. In 1989, Camerons Brewery was described as one of the most efficient in the country, with a total annual capacity of over 500,000 barrels and production of 400,000.\n\nIn 1991, the heavily-indebted Brent Walker sold the brewery and 51 pubs to Wolverhampton & Dudley for £18.7 million, beating a rival offer from the management. Brent Walker retained the bulk of the Cameron's estate, which it spun off as a Hartlepool-headquartered pubco called Pubmaster, which controlled 1,600 pubs and was sold to a syndicate of investment groups for £171.3 million in 1996. Meanwhile, the soft drinks arm was spun off under a management buyout called Orchid Drinks, with brands including Purdey's and Amé (acquired by Britvic in 2000 for £67 million).\n\nW&D had acquired a company that was in a \"sorry state\". Initially, brewery staff numbers were reduced from 360 to 120, and part of the brewery was mothballed, after W&D ended a contract to brew Labatt lager at the plant. However, W&D invested heavily in the brewery site and marketing, and the profitability of the brewery greatly improved. By 1995 W&D had doubled the size of the Cameron pub estate they inherited to 101 pubs. It was widely suggested by customers that the Camerons beers greatly improved after being acquired by W&D.\n\nIn 1997, contract brewing returned to the plant, with a licence to brew Foster's lager. By 1997, Cameron's market share in the North East had grown to 10 per cent, supplying pubs from Alnwick to Hull. In 1998, £1 million was spent on a new filtration and fermentation system and a keg plant at the brewery. In 1999, a further £500,000 was invested in the previously mothballed areas of the brewery to bring it to its full capacity of 400,000 barrels after it won a series of contracts to brew Harp Lager, Heineken and Kronenbourg.\n\nTotal production of Strongarm surpassed one billion pints in 2000. The 2002 Good Beer Guide remarked that the Strongarm was \"Now substantially improved and with consistent character\".\n\nIndependence\n\nCastle Eden Brewery, owned by David Soley, took over Camerons in April 2002 for £35 million, moving all operations to Hartlepool and closing down the Castle Eden plant. The Kronenbourg 1664 contract was renewed by Scottish & Newcastle in December 2002. In 2003, £500,000 was spent to build a new bottling line and an on-site microbrewery, The Lion's Den. In 2008, Cameron's spent £4 million expanding its capacity from 375,000 barrels to around 800,000 barrels. This followed the agreement of a contract with Scottish & Newcastle to supply Kronenbourg 1664, Foster's and John Smith's bitter until 2019. Previously the brewery had only produced Kronenbourg 1664.\n\nIn 2013, Camerons acquired the Hexham-based Head of Steam craft beer chain, including seven outlets, in a deal financially backed by Carlsberg.\n\nIn 2015, Gold Bullion joined Strongarm as a year-round beer.\n\nIn July 2016, Camerons acquired Leeds Brewery's estate of seven pubs.\n\nOperations\n\nIn 2011, the brewery had a capacity of over 1.5 million hectolitres (over 1 million barrels) per annum. Production in 2012 was 900,000 hectolitres, with around 40,000 hl in own brand sales. The bulk of the brewery's own production is cask conditioned ale but it also sells bottled and keg ales. The company's most famous beer is Strongarm, a 4% abv bitter introduced in 1955, and other regular beers are IPA, Bullion Gold and Trophy Special. Strongarm is made with 18 per cent crystal malt, which contributes significantly to its distinctive ruby red colour and its roasted, malty flavour.\n\nThe barley comes from Yorkshire and Scotland. Camerons uses up to five different yeast strains for its various brands.\n\nIts arrangements with brewing companies include contracts to produce Foster's, Kronenbourg 1664, John Smith's Magnet, Tetley Imperial, and the keg versions of Tetley Mild and Tetley Dark Mild.\n\nThe company owns 75 public houses.\n\nHeineken holds a 24 percent stake in the company. However it is a silent partner, with no board representation or managerial control.\n\nThe Lion Brewery\n\nThe brewery building is called the Lion Brewery, and the company offers tours of the brewery. Camerons Brewery in Hartlepool has two wells, one of them 250 feet deep. Most of the brewery was built in 1890 when the company had aspirations to supply the whole of the North East. There are still a few reminders of lavish opulence; the floor and walls of the brewhouse are furnished with Italian marble that cost £7,000 in 1970.\n\nIn 2011, the brewery had a capacity of over 1.5 million hectolitres per annum. It is the ninth largest brewery in the UK. It has twelve Yorkshire Squares for brewing ale.\n\nIn 2013, the brewery building was used as a filming location in the \"Prodigal Son\" episode of Vera.\n\nA £700,000 visitor's centre was opened next to the brewery in 2004, in the former Stranton Arms public house.\n\nAdvertising and sponsorship\n\nIn 1996, a £500,000 television and radio campaign saw Cameron's Strongarm advertised across Yorkshire and the Midlands for the first time.\n\nCameron's was one of the first breweries to sponsor football kits, with Middlesbrough FC from 1984–86 and Hartlepool United from 1985-1990 and 1993-2000.\n\nIn 2014, Cameron's began sponsoring BriSCA F1 driver John Downson Jnr, from Thornley. Dowsy, as he is often referred to, is a North East stockcar racer who races under the number 94. John has previously raced BriSCA F2s, where he was the 2012 pole sitter in the BriSCA Formula 2 Stock Cars World Championship race at Barford Raceway, before making the switch to the more powerful V8 powered formula, the BriSCA F1s later in the year. John is the first driver from the area to feature in a BriSCA Formula 1 Stock Cars World Championship title race for almost 20 years, finishing 10th in 2013, narrowly avoiding qualifying for the event in 2014."}]}