{"John Cameron was elected in the 1921 Alberta general election.": [{"url": "https://www.wikiwand.com/en/John_Cameron_(Alberta_politician)", "page_content": "John Cameron (May 28, 1846 – October 6, 1919) was a merchant and politician in Alberta, Canada and a municipal councillor in Edmonton. He is regarded as one of the city's pioneer citizens.\n\nCanadian politician\n\nQuick facts: John Cameron, Alderman on the Edmonton Town C... ▼\n\nBorn in Canada West (later Ontario), Cameron worked as a merchant in his birth province and Manitoba before coming to Edmonton in 1881. In Edmonton he continued as a merchant, owning and operating a store for 15 years. In Edmonton he quickly established himself as a prominent citizen, serving on the inaugural Edmonton Board of Trade as president, which he would remain for five years. Cameron also was involved in the development of the Edmonton Public School Board, serving on the board in the 1890s. He was also involved in the town's politics, winning election to Edmonton's first town council in 1892 and serving an additional term when elected in 1895. After this retirement from politics, he worked in the coal and real estate business until his death in 1919, at the age of 73. Upon his death, he was lauded as one of the pioneer citizens of Edmonton; a street, neighbourhood and ravine were named for him."}, {"url": "https://www.thecanadianencyclopedia.ca/en/timeline/alberta", "page_content": "People\n\nEdmonton Terror Attack\n\nA man drove a car into a routine police roadblock in downtown Edmonton, Alberta, striking Constable Mike Chernyk at high speed. The driver then got out of the car and attacked the officer with a knife before fleeing the scene. He was later stopped in a U-Haul van at a police checkpoint but sped away, hitting four pedestrians before he was arrested by pursuing police officers. (In the days after the attack, the victims were all expected to survive.) A Daesh flag was found in the car of the suspect, who was identified as 30-year-old Abdulahi Hasan Sharif, a Somali refugee who had been interviewed by the RCMP in 2015 for supporting extremist views. (See also Terrorism and Canada.)"}, {"url": "https://wiki2.org/en/Alberta_general_election,_1921", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nThe 1921 Alberta general election was held on July 18, 1921, to elect members to the 5th Alberta Legislative Assembly. It was one of only five times that Alberta has changed governments.\n\nThe Liberal Party, which had governed the province since its creation in 1905, led by Charles Stewart at the time of the election, was defeated by a very-new United Farmers of Alberta political party. The UFA was an agricultural lobby organization that was contesting its first general election. It had previously elected one MLA in a by-election.\n\nUnder the Block Voting system, each voter in Edmonton and Calgary could vote for up to five candidates, while Medicine Hat voters could vote for up to two candidates. All other districts remained one voter – one vote.\n\nNo party ran a full slate of candidates province-wide. The UFA ran candidates in most of the rural constituencies, and one in Edmonton. The Liberal Party ran candidates in almost all the constituencies. The Conservatives ran a bare dozen candidates, mostly in the cities. Labour mostly avoided running against UFA candidates, by running candidates in the cities and in Rocky Mountain, where it counted on coal miners' votes.\n\nThe United Farmers took most of the rural seats, doing particularly well in the heavily Protestant south of the province. A majority of the votes in the constituencies where the UFA ran candidates went to the UFA.\n\nLabour took five seats, two in Calgary. One Labour MLA was named to the UFA government cabinet, in a sort of coalition government.\n\nThe Liberals took all the seats in Edmonton, due to the block-voting system in use. This multiple-vote system also skewed the vote count.\n\nThe campaign\n\nLiberals\n\nThe Liberal Party, which had governed the province since 1905, were led into the election by its third Premier and leader, Charles Stewart.\n\nAGT scandal\n\nThe Alberta Government Telephones scandal broke before the election. It was learned that the Liberals spent AGT money to have telephone poles crated and shipped in big stacks to remote communities in which they had no intention of installing phone lines in an effort to garner support and votes.\n\nUnited Farmers\n\nHerbert Greenfield's Premier portrait\n\nThe United Farmers of Alberta under the leadership of President Henry Wise Wood was contesting its first general election. The UFA's political wing, as a party, had come into being after the organization had decided to no longer be content with being a lobby group. They merged with the Non-Partisan League of Alberta, which had formed before the 1917 general election and had elected a couple members. The Non-Partisan League activists were significant within the political machinery of the United Farmers.\n\nThe merged party experienced a significant amount of growth in the run up to the general election. It won its first victory with the election of candidate Alexander Moore in the electoral district of Cochrane in 1919 and achieved a coup when Conservative leader George Hoadley crossed the floor. The two Non-Partisan League MLAs, despite not changing their affiliation, caucused with the United Farmers.\n\nWise Wood knew midway through the election campaign that his party was going to form government. In a famous speech he gave in Medicine Hat on July 8, 1921, he was quoted as saying \"Farmers may not be ready to take over government, but they are going to do it anyway\". He also said in that speech that he would have preferred that only his 20 best candidates were elected, to form the opposition, but he said he expected there would be a lot more than that elected.[1]\n\nSplit in the Labour forces\n\nThe campaign was contested by two provincial labour parties: a main party named the Dominion Labor and a splinter group in Edmonton named the Independent Labor Party.\n\nDominion Labor ran candidates in primarily urban ridings such as Calgary, Edmonton, Lethbridge and Medicine Hat. Its President Holmes Jowatt declining to seek office himself, instead devoting his energies help other candidates.\n\nAt the beginning of the election Independent Labor offered to nominate Edmonton area candidates at a joint convention with the DLP, to prevent the splitting of the labour vote and use the co-operative good-will to eventually unite the parties. The Dominion Labor declined the offer stating that to do so would divide its own ticket.\n\nAmong the ILP candidates was pioneer photographer Ernest Brown, soon after to lead meetings of the Communist Party.[2][3]\n\nConservatives\n\nThe Conservative Party which has been the primary opposition in the province since it was created in 1905 had seen a split in the ranks under the leadership of George Hoadley. The caucus divided into two separate Conservative caucuses. Hoadley left the Conservative party sitting as an Independent and then won the United Farmers nomination in Okotoks and crossed the floor. The party replaced Hoadley by selecting Albert Ewing an Edmonton area Member of the Legislative Assembly as leader.\n\nThe Conservatives spent the campaign criticizing the wasteful and extravagant spending of the Liberal government. They also reminded Alberta voters of the Alberta Government Telephones, telephone pole scandal. The Conservatives campaign for reforms to the provincial tax code as well as pressing for provincial resource rights and voter list reforms in the election act.[4]\n\nDespite the split in the party the Conservative campaign attracted some high-profile support. Former Liberal Premier Alexander Rutherford a big supporter of Ewing, led the campaign for the five Conservative candidates contesting for seats in Edmonton.[5]\n\nThe Conservative party was a long time recovering from the split in the party. Supporters of Hoadley and their rural base migrated to the United Farmers. The change of amalgamating the districts in Calgary and Edmonton to a block vote did not help Conservative candidates. In Edmonton the strong Liberal block dominated and all five seats were captured by Liberal candidates. The only Conservative to return was Lethbridge MLA John Stewart. Albert Ewing went down to defeat in Edmonton.\n\nSocialist\n\nThe Socialist Party of Alberta had been in decline since O'Brien lost his seat in the 1913 general election. Two Socialist candidates ran in this election, under the banner Labour Socialist, Frank Williams in Calgary and Marie Mellard in Edmonton. Marie Mellard would join the new Communist Party within the year.\n\nCalgary, Edmonton and Medicine Hat voters cast multiple votes\n\nThe Liberals, in fact, won a larger share of the votes cast than the UFA (about 34%, compared to 29% for the UFA).\n\nThe popular vote numbers exaggerate the actual number of Liberal party supporters however. Urban voters in Calgary and Edmonton were allowed to place five votes and Medicine Hat voters 2 votes, as Edmonton and Calgary contained 5 seats each and Medicine Hat 2 seats, while voters in the other constituencies, most of which were contested by the UFA, only had 1 vote each under the first past the post electoral system. The United Farmers did not run in Calgary and only had a single candidate in Edmonton, thus it did not benefit from the higher weighted city vote.\n\nThis over-representation of big-city voters was so significant that there were more than 120,000 more votes counted than there were voters voting—significant as no single party received more than 102,000 votes. The Liberal Party received 28,000 votes in Edmonton and 20,000 votes in Calgary, almost half of their total across the province, under this system where each big-city Liberal voter could lodge five votes for the party. If you give the Liberal Party only one-fifth of their vote tally in Edmonton and Calgary, the Liberal Party total vote count decreases to well below the UFA total. Now it could be that each voter in Edmonton gave one of his/her votes to the Liberals (but not likely), but even so the Liberal candidates in Edmonton received 8,000 more votes in Edmonton than there were voters who voted. This 8,000 is more than half the difference between the Liberal's and the UFA's tallies province-wide. [6]\n\nAs well, in Calgary 17,000 voters cast about 76,000 votes. As none of these went to UFA candidates (none ran in Calgary) this massive multiple voting going elsewhere gave the UFA a lower proportion overall.\n\nIt was also noted by defenders of the government that the UFA percentage of total seats (62 percent) is identical to the percentage of votes it received in the constituencies in which it did run candidates.\n\nAftermath\n\nThe result of the election radically and forever altered the political landscape of the province. The United Farmers won a majority government, mostly with rural MLAs predominantly from the south of the province, while the Liberals, formerly in power, were moved to the opposition side of the Chamber with MLAs in the cities of Calgary and Edmonton and some northern strongholds. The Liberals have never won power again; the closest they have come since then was winning 39 seats and opposition status in 1993. As well starting in 1921 and lasting until 1971, the Alberta provincial government was not the same as either of the two largest parties in the House of Commons.\n\nThe 38 MLAs who attended the first United Farmers caucus meeting voted unanimously for UFA President Henry Wise Wood to lead the government as Premier. Wood, who had opposed the UFA becoming a political party for fear that political in-fighting would break up the movement, declined becoming Premier because he was more interested in operating the machinery of the United Farmers movement rather than crafting government policy. He said he feared that the UFA would repeat what had happened elsewhere when farmers movements engaged in electoral politics, rose to power and quickly destroyed themselves. He wanted to remain focused on the farmers movement as a non-partisan movement and as an economic group instead of as a political party.[7] The UFA vice-president, Percival Baker, had won his riding with a majority of votes, despite being badly injured in a tree-falling accident and was speculated to have a place in the cabinet. He however died the day after the election.[8] The United Farmers caucus finally chose Herbert Greenfield, who had not run in the election, to become Premier.\n\nResults\n\nPopular vote Liberal 34.07% United Farmers 28.92% Dominion Labor 11.40% Conservative 10.98% Others 14.63%\n\nSeats summary United Farmers 62.30% Liberal 24.59% Dominion Labor 6.56% Conservative 1.64% Others 4.92%\n\nMembers elected\n\n\n\n\n\n10 by-elections were held in the months after the election. Some were held to sit several UFA MLAs and one Labour MLA in the new cabinet. Herbert Greenfield after being chosen to serve as premier ran for a seat in a by-election. John Brownlee after being chosen to serve as a cabinet minister ran for a seat in a by-election. Another was held after a Liberal MLA (Andrew Shandro) was thrown down for taking a seat under suspicious circumstances. All were successful for the UFA (and one Labour).\n\nCalgary\n\nEdmonton\n\nNotes\n\n^ turn-out figure not available because the official Report on Alberta Elections does not give turn-out figure and does not give number of eligible voters in Edmonton and Calgary. Also block voting in those cities confuses strict accounting; as does election of one MLA by acclamation, but in 1926 when about the same number of voters turned out in the cities, the turn-outs there were about 50-60 percent. a b Henry Wise Wood was president of the UFA but did not contest a seat himself. Following the election, he declined to become premier, and the UFA caucus selected Herbert Greenfield instead. ^ Vote count skewed by multiple voting in Calgary, Edmonton, and Medicine Hat. ^ Medicine Hat elected two members to the Legislative Assembly\n\nReferences\n\nFurther reading\n\nHopkins, J. Castell (1922). The Canadian Annual Review of Public Affairs, 1921. Toronto: The Annual Review Company."}, {"url": "https://www.elections.ca/content.aspx?section=res&dir=his/chap2&document=index&lang=e", "page_content": "Chapter 2 – A History of the Vote in Canada\n\nUneven Progress 1867–1919\n\nBack to Table of contents, Chapter 2\n\nAt Confederation, the Constitution Act, 1867 stated that control of election law and the federal franchise would remain a provincial matter until Parliament decided otherwise. The provinces were still developing more or less independently, each with its own character rooted in its traditions, demography and geography. Inevitably, these differences were reflected in the provincial electoral laws that were to determine who could vote in federal elections for the first two decades of Confederation.footnote 1\n\nA Federal or a Provincial Matter?\n\nAt Confederation, therefore, no federal election law existed for electing the first Dominion Parliament. Sir John A. Macdonald envisaged the use of provincial election laws as an interim measure for the 1867 election and expected Parliament to adopt its own election law.\n\nIt was 1885 before Parliament took action on the franchise. The Conservatives, under Macdonald, had been unable to reach consensus on a single set of voting eligibility criteria, while the Liberals, who supported a decentralized federation, wanted eligibility to remain under provincial control.\n\nIn 1885, Macdonald's government finally succeeded in having a law passed that gave Parliament control of the right to vote. The provinces regained control 13 years later, however, under a Liberal government led by Sir Wilfrid Laurier. As a result, in 10 of the 13 federal general elections held between 1867 and 1920, the electorate varied from province to province, with eligibility determined by provincial law.\n\nAfter the Elections Appearing first in the Canadian Illustrated News after the Quebec election of May 1, 1878, this cartoon by André Leroux of Montréal was adapted for the cover of the News after Sir John A. Macdonald's Liberal-Conservatives defeated Alexander Mackenzie's government later that year. A. Leroux, Library and Archives Canada, Canadian Illustrated News, September 28, 1878, C-068249\n\nThe original colonies continued to adopt or adjust their electoral laws to meet their needs and circumstances. In addition, not long after Confederation, Canada experienced a huge territorial expansion that produced new provinces and territories, each of which adopted its own electoral legislation, adding further to interjurisdictional diversity in the electorate. Citizens of British Columbia and Manitoba took part in their first federal general election in 1872, Prince Edward Island in 1874, the Northwest Territories in 1887, Yukon in 1904, and Alberta and Saskatchewan in 1908.\n\nManitoba, 1870 An elected provisional government led by Louis Riel took root in the Red River Settlement in the early months of 1870. The Legislative Assembly of Assiniboia played a key role in negotiating the terms of Manitoba's entry into Confederation later that year, as a largely Métis province with four seats in the federal parliament. Library and Archives Canada, e000009388 Angus McKay Angus McKay was one of the first two Métis politicians elected to Parliament in 1871, along with Pierre Delorme (seen in the photo with Louis Riel, top row second from left). Archives of Manitoba, McKay, Angus (A) 1 Personalities, M.L.A. Lake Manitoba, 1870's, N12819\n\nOther factors, both regional and national, affected evolution of the right to vote during this period. These included demographic change, largely the result of massive immigration; urbanization and industrialization, and the accompanying enfranchisement of workers; and the emergence of a number of groups promoting women's suffrage. First Nations people were still effectively denied access to the franchise, either directly or indirectly, at the regional and national levels.\n\nYukon's First Wholly Elected Council, 1908 Voters elected two members for each of the territory's five constituencies. George Black (top row, second from right) also represented Yukon in Parliament from 1921 to 1935 and 1940 to 1949. Martha Louise Black, his wife, held the seat while he was ill (1935–1940) and was Canada's second female member of Parliament. Library and Archives Canada, PA-110153\n\nCanada's geographic expansion in the second half of the 19th century was matched by population growth that continued into the early decades of the 20th century. Between 1871 and 1921, the population more than doubled, from four million to more than eight and a half million. Growth was largely the result of immigration, although not all regions were equally affected. The Prairie provinces and, to a lesser degree, Ontario and Quebec attracted the largest numbers of immigrants. Over this period, the population of the Prairies shot up from 75,000 to almost two million.\n\nAlthough many immigrants were of British origin, a large proportion were from Eastern Europe and Asia. In provinces where immigrants of neither British nor French origin formed a sizable minority, concerns about the electoral effects of the \"ethnic factor\" tended to be reflected in electoral legislation. Conversely, in provinces where the existing population did not feel threatened by the arrival of immigrants of different ethnic origins, ethnicity was not an important factor in voting eligibility.\n\nOver the same period, urbanization and industrialization led to the emergence of workers' groups seeking to broaden the electorate. This is not surprising, given that in almost all provinces, the right to vote in federal elections depended on property ownership or, in some cases, income level. These restrictions remained in force until the beginning of the 20th century and persisted even longer in some provinces.\n\nProperty- or income-based qualifications effectively prevented large segments of the working population from voting. During the last quarter of the 19th century, most workers earned modest if not miserable incomes, and the vast majority were unlikely to own their own homes. In such conditions, any property-based qualification, no matter how minimal, was prohibitive. When the labour movement began to organize in the early 1870s, its representatives demanded that the franchise be extended to lower-income groups. Some 20 years later, they demanded universal suffrage. It is difficult to know to what extent these demands contributed to improving electoral legislation. One thing is certain: starting at the turn of the century, the provinces progressively eliminated property- and income-based restrictions on voting eligibility.\n\nQuestionable Election Practices\n\nIn the early days of Confederation, any individual who met the voting eligibility criteria could, in theory, exercise the right to vote. In fact, because of electoral practices common in those tumultuous times—when each vote carried more weight due to the limited number of electors—many people were deprived of that right or obliged to cast their votes for a candidate selected by someone else.\n\nThe Changing Electorate An expanded franchise brought new participants to politics. The Mechanics and Labourers of Ottawa presented a scroll to Sir John A. Macdonald in 1878 \"in sympathy with Liberal Conservative Rule.\" But a 1900 poll book for Pictou, Nova Scotia, shows that income was still a voting qualification. Library and Archives Canada, MG30-E471, volumes 1 and 4, R2145-0-9-# Ceremonial scroll Library and Archives Canada, MG26-A, Vol 335b, R14424-0-3-E\n\nSome of the rules in effect at that time did nothing to promote fair and equitable polling practices. In all provinces but New Brunswick, which had adopted the secret ballot in 1855, electors voted orally, a polling method manifestly open to blackmail and intimidation.\n\nFurthermore, in all provinces except Nova Scotia and Prince Edward Island, elections were held on different dates in different ridings. The system allowed the party in power to hold elections in a safe riding first, hoping in this way to influence the vote in constituencies less favourable to them. The system even enabled a candidate who lost in one riding to run again in another. In the 1867 general election, the Conservatives stretched the process over six weeks; in the next election (1872), they dragged it out for nearly three months.\n\nLast of the Open Ballots, 1872 Sketches from the Canadian Illustrated News depict one of the last open-ballot elections, this one in Hamilton, Ontario. On the left, a torchlight parade is held to drum up voters. In the centre, successful candidates greet their supporters outside the newspaper office. On the right, the crowd reacts as each man declares his vote from the hustings. Library and Archives Canada, Canadian Illustrated News, August 31, 1872, C-058774\n\nAfter their 1874 victory, the Liberals passed two laws on election procedure. One measure withdrew the right to vote from a number of officials, including federally appointed judges and individuals who worked for candidates during an election (for example, as official agents, clerks or messengers), but this had little effect on the overall composition of the electorate. However, the measures also included several important mechanisms to help clean up questionable election practices: they introduced the secret ballot and stipulated that votes must be cast on the same day in all constituencies, and they transferred hearings on contested election petitions from parliamentary committees to the courts.\n\nOther changes were the result of concerns about the fairness of political competition and worries about donors exercising undue influence over politicians. In 1873, telegraph transcripts had showed Sir John A. Macdonald demanding large campaign contributions from promoters of the Canadian Pacific Railway; the evidence helped topple his Conservative government and prompted the succeeding Liberals to make legislative changes. The 1874 Dominion Elections Act required candidates and their \"agents\" (political parties were not recognized in law until nearly a century later) to disclose how and where campaign funds were spent. This was the first time that such a requirement was put in place. However, the Act's provisions did not limit these expenses, require disclosure of contributions or assign responsibility for administering and enforcing the legislation.\n\nThe reforms cleaned up the electoral process to some extent (for example, by reducing the use of violence to intimidate voters), but they did not eliminate all abuses. The figures on members who lost their seats because of fraud or corrupt electoral practices indicate the extent of the problem. Between 1867 and 1873, when petitions protesting the outcome of an election were presented to a committee of the House of Commons, just 1 of 45 contested elections was invalidated. When the courts began to look impartially at claims following adoption of the Liberal reforms, the number of voided elections soared. Between 1874 and 1878, 49 of the 65 contested elections submitted to the courts were voided, forcing nearly one third of the members of the House of Commons to resign. The rigorous approach of the courts appeared to lower the incidence of fraud, at least temporarily. Between 1878 and 1887, some 25 members were unseated following contested elections. Corruption flared up again, however, between 1887 and 1896, with some 60 members losing their seats after court challenges. By the end of the century, the number of members convicted of election fraud or corrupt practices began to decline again—not because of any improvement in election practices, but because of the political parties' increasing use of \"saw-offs\"—friendly agreements to withdraw equal numbers of contested election petitions before appealing to the courts.\n\nOne must vote in secret\n\nAway from glances:\n\nIf a vote can be bought\n\nWell, then,\n\nIt's done in secret.\n\nYou know what I mean. Is one dumb enough\n\nTo offer gold without knowing\n\nFor whom the patriot will\n\nWell, hum,\n\nCast his vote?\n\nYou know what I mean. — Extract of a satirical song by Rémi Tremblay, songwriter, 1883 (translation)\n\nFraudulent practices took many and varied forms. One of the most common was to purchase votes through \"treating\" (the purchase of food and drink) or compensation. In addition to cash payment for votes, candidates or their agents might hand out alcohol, pork, flour and other foodstuffs. Personation—the illegal practice of voting in the place of another elector—also occurred on a large scale, especially in urban ridings, where population mobility was much more prevalent.\n\nAnother practice was \"importing\" voters from the United States for election day—ferrying in Canadians who had moved to the United States. On March 6, 1891, a Quebec newspaper reported the arrival of two Grand Trunk Railway trains carrying some 2,000 textile workers from the United States who were returning home to vote. (Hamelin et al., 108) A decade later in Ontario, the Lake Superior Corporation used a tugboat to bring in workers from Sault Ste. Marie, Michigan, to vote in the place of absent or deceased miners.\n\nElections cannot be carried without money. Under an open system of voting, you can readily ascertain whether the voter has deceived you. Under vote by ballot, an elector may take your money and vote as he likes without detection. — John H. Cameron, MP House of Commons Debates April 21, 1874\n\nSoon after the adoption of Macdonald's Electoral Franchise Act in 1885, falsification of electoral lists became a common practice. Before that date, the lists, drawn up by municipal employees, had given rise to few complaints. Beginning in 1885, however, the lists were drawn up by persons appointed by the party in power. The name or profession of an elector was often changed, with the result that the person in question was not allowed to vote when he arrived at the polling station. At the same time, many individuals became \"legally qualified\" to vote when false names were added to the lists and the names of persons who had died or moved away were not deleted. To make matters worse, the lists were not updated regularly.\n\nCampaign Literature, 1872 Malcolm Cameron (1808–1896) used the latest technology to produce this colour lithograph supporting his electoral bid, but voters chose another candidate. Cameron founded the Bathurst Courier at Perth, Upper Canada, in 1833 and was Queen's Printer for Canada from 1863 to 1869. Library and Archives Canada, C-120987\n\nThe 1891 election provides an excellent example of the combined effects of falsification of lists and lack of regular updating. In Ontario alone, comparison of the electoral lists updated in 1889 and census data for the year of the election reveals the existence of more than 34,000 \"floaters\"—persons who had died or moved out of the province. Moreover, because the 1891 election was held on the basis of lists revised two years earlier, tens of thousands of new electors were disenfranchised. In the country as a whole, according to contemporary accounts, at least 50,000 and possibly more than 100,000 electors were deprived of the right to vote in that election because the electoral lists had not been updated or, in some cases, had been falsified.\n\nIntimidation was another method used to influence election results. The Catholic clergy, for example, openly supported the Conservative party in pastoral letters and statements from the pulpit. Some parish priests even threatened their parishioners with the fires of hell if they voted Liberal. Although the effects of such intimidation were felt mainly in Quebec, where some elections were even voided because of the \"undue influence\" of the clergy, it was also a factor in the Maritimes, Ontario and Manitoba—until the Roman Catholic Church and the courts reined in these tendencies around the turn of the century.\n\nNominations, 1871-Style Sketch of the nominations in Montreal Centre for the Quebec provincial election held in 1871. Library and Archives Canada, Canadian Illustrated News, July 1, 1871, C-056351\n\nIntimidation by employers, though less widespread than the influence of the clergy, was nonetheless a factor. Employers threatened to reduce the wages of, or even fire, those who did not vote for the \"right\" candidate. The March 10, 1896, edition of La Patrie published the text of a notice posted on the wall of a Montréal manufacturing concern:\n\nWe feel it is only fair to notify employees that, in case of a change in government [Conservative], we will be unable to guarantee the wages you are now being paid; neither will we be able to guarantee work of any kind to all the employees employed by us at this time. — Hamelin et al., 109 (translation)\n\nTo the range of questionable election practices already described must be added the inappropriate use of public funds for election purposes, illegal election expenses, falsification of ballots, and dishonesty, or even incompetence, among election personnel. In 1891, a returning officer in the Algoma riding said that he could distinguish between male and female \"Indians\" only on the basis of their clothing. Organizers for the Conservative candidate seized the opportunity: the men voted first, then loaned their clothing to the women so they could vote.\n\nAs a result of these and other scandals, new provisions were added to the Dominion Elections Act. In 1891, it became an offence to assist a candidate in exchange for money or other valuable consideration. In 1908, corporations were barred from making campaign contributions, while others could make donations only through a candidate's official agent. The lack of an overseeing body, however, made the legislation an ineffective deterrent, and businesses continued to donate campaign funds freely to whomever they wished.\n\n…there is so little likelihood of detection, [and] the price paid for passing false votes is so tempting, that unless severe measures are employed, there will always be persons willing to undertake the business. — Herbert Brown Ames quoted in John English's The Decline of Politics , 1977\n\nThe Electoral Mosaic, 1867–1885\n\nFrom 1867 to 1885, five federal general elections were held, with the electorate varying from province to province under the provincial electoral laws then in force. In all provinces, there were three basic conditions for becoming an elector: being male, having reached the age of 21 and being a British subject by birth or naturalization. The other conditions varied according to the electoral law of each province. Tables 2.1 and 2.2 give an overview of the diversity of conditions in effect.\n\nExcept in British Columbia, the main restrictions on entitlement to vote were property- or income-based qualifications, which established four classes of citizens: those who owned real property of a minimum value, those who leased or occupied a property of a minimum value or paid an annual rent of a minimum value, those who owned personal property or a combination of personal and real property of a minimum combined value, and those who earned a minimum annual income. As Table 2.1 shows, electors were far from being equal across the country on the basis of these criteria.\n\nFor property owners, the required value of real property varied by as much as $300 from one province to another. Conditions for tenants and for those who qualified on the basis of owning a combination of real and/or personal property also varied widely. Finally, two provinces linked the right to vote to a minimum annual income: in Ontario, the minimum was $250; in New Brunswick, it was $400.\n\nTable 2.1\n\nProperty and Income Qualifications: Minimum Conditions Required to Vote in Federal Elections, 1867–1885 Province Property or Income Qualification for Owners and/or Tenants footnote 2 Nova Scotia footnote 3 Value of real property occupied by either owners or tenants: $150 Quebec Value of real property occupied by owners: $300 in urban areas; $200 in rural areas\n\nAmount of annual rent for tenants: $30 in urban areas; $20 in rural areas Ontario footnote 4 Value of real property occupied by either owners or tenants: $200 in urban areas; $100 in rural areas\n\nAnnual income: $250 (urban residents) Manitoba footnote 5 Value of real property occupied by owners: $100\n\nValue of real property occupied by tenants: $200\n\nAmount of annual rent for tenants: $20 New Brunswick footnote 6 Value of real property occupied by owners: $100 footnote 7\n\nAnnual income: $400 Prince Edward Island Those under 60 years of age had to make an annual contribution of four days' work to maintain and build highways or the equivalent in cash; those over age 60 had to own real estate that generated a minimum annual income of $8. British Columbia footnote 8 No property or income qualifications.\n\nTable 2.2\n\nCategories of Citizens Ineligible to Vote, 1867–1885 footnote 9 Nova Scotia Any person who, during the 15 days preceding the election, was remunerated by the government as an employee of one of the following: post office\n\ncustoms\n\nlighthouses\n\nCrown land office\n\npublic works\n\nmines\n\nrailroads\n\ndepartment of revenue Any person in need who received social assistance or assistance in any amount from a charitable organization during the year preceding the election. Quebec Any person remunerated by the government as an employee of one of the following: post office (cities and towns)\n\ncustoms\n\nCrown land office\n\nor holder of one of the following positions: judge of the superior court, court of Queen's bench, vice-admiralty court, sessions court or municipal court district magistrate secretary, undersecretary or clerk of the Crown sheriff or assistant sheriff officer or member of a provincial or municipal police force\n\nAny person who collected federal or provincial duties, including excise duties, in the name of Her Majesty. Ontario Any person of \"Indian\" origin or partly \"Indian blood,\" not enfranchised, who resided on a reserve located in a riding where no electoral list existed and who benefited from amounts paid, in the form of annuities, interest or other funds, to the tribe or band of which the person was a member. Any person who was remunerated by the government as an employee of one of the following: post office (cities and towns)\n\ncustoms\n\nCrown land office\n\nor holder of one of the following positions: judge chancellor or vice-chancellor of the province Crown clerk or assistant clerk registrar general prosecutor in a county court sheriff or assistant sheriff\n\nAny person collecting excise duties on behalf of Her Majesty. Any person acting as returning officer or election clerk (deputy returning officers and poll clerks retained the right to vote). Any person working in any capacity for a candidate before or during an election. Any stipendiary magistrate (i.e. paid by an individual). Manitoba Any person of \"Indian\" origin who received an annuity from the Crown. Any person holding one of the following positions: judge of the court of Queen's bench, a county court or a municipal court\n\nCrown clerk\n\nregistrar general\n\nclerk of a county court\n\nsheriff or assistant sheriff British Columbia Any person of \"Indian\" origin. Any immigrant of Chinese origin. Any person holding one of the following positions: employee of the customs department\n\nemployee of the federal government responsible for collecting excise duties\n\njudge of the Supreme Court or a county court\n\nstipendiary magistrate\n\npolice constable or police officer Any employee of the federal government paid an annual salary (except postal employees). Any employee of the provincial government paid an annual salary. Any teacher paid by the government of the province. Any person previously found guilty of treason, serious crimes or other offences, unless he had been pardoned or served his sentence.\n\nThree provinces—Ontario, Manitoba and British Columbia—imposed racial restrictions. Before Confederation, just one of the colonies had decreed that \"Indians\" could not vote. Nova Scotia explicitly excluded them from the electorate in 1854 when it abolished property-based qualifications; when the province re-established these qualifications in 1863, it repealed the exclusion clause. In practice, in Nova Scotia as elsewhere, First Nations persons were not entitled to vote because, under federal law, virtually none of them held property as individuals.\n\nSoon after Confederation, Ontario decreed that, in places where no electoral lists existed, only \"enfranchised Indians\"—persons who had renounced their \"Indian\" status—could vote. If they wanted to exercise their right to vote, they could not be \"residing among the Indians\" or benefiting from amounts paid to a tribe or band in the form of annuities, interest or other funds. In ridings where electoral lists were drawn up, \"enfranchised Indians\" who did not reside among the \"Indians\" were eligible to vote, even if they received a portion of an amount paid to a tribe or band. In practice, however, this measure affected few people. Between 1867 and 1920, in all of Canada, a mere 250 First Nations persons were enfranchised. There is no record of others who might have been covered by the terms of the legislation and could therefore have voted; their numbers were certainly not legion.\n\nIn Manitoba, First Nations persons who received a benefit from the Crown were not entitled to vote. In British Columbia, neither First Nations persons nor residents of Chinese descent could vote. Although there were very few immigrants of Asian origin in British Columbia at that time, First Nations peoples accounted for more than an estimated two thirds of the province's population in 1871.\n\nAt the same time, all provinces except New Brunswick and Prince Edward Island denied the vote to certain government employees. Here, too, there was considerable inconsistency among the provinces. In Nova Scotia, for example, postal employees did not have the vote; in British Columbia and Manitoba, they did; in Quebec and Ontario, only rural postmasters were eligible to vote. Postmasters were patronage appointments made by the federal government. At a time when the Conservatives dominated the federal government, postmasters could be seen as Conservative supporters. This was one of the reasons that Macdonald wanted the federal government to control the franchise.\n\nAmendments to provincial election laws between 1867 and 1885 did little to increase the number of electors, except in Ontario, where property requirements were reduced significantly, and in Nova Scotia, where the voting privileges of property owners were extended to tenants. At the same time, Nova Scotia, Quebec, Ontario and Manitoba extended the right to vote to co-owners and co-tenants of property assessed at a value that, if divided among the co-owners or co-tenants, fulfilled the property qualifications in effect for each individual. Considering the economic conditions of the period, this measure probably affected only a small number of individuals.\n\nMacdonald Centralizes the Franchise\n\nOn July 27, 1885, Conservative Prime Minister Sir John A. Macdonald wrote to his friend Charles Tupper, \"On the twentieth we closed the most harassing and disagreeable session I have ever witnessed in forty years.\" But he went on to add, \"I consider the passage of the Franchise Bill the greatest triumph of my life.\" (Stewart, 3)\n\nMacdonald's Admission, 1873 The caption below this cartoon, published on September 26, 1873, quoted The Mail of the same date: \"We in Canada seem to have lost all idea of justice, honor and integrity.\" Macdonald's support in the House of Commons declined after revelations that he had accepted campaign donations from Sir Hugh Allan, with whom he was negotiating government railway contracts. His government resigned on November 6. J.W. Bengough, Library and Archives Canada, C-078604\n\nWhy was Macdonald—who had won many other significant victories in his 40-year political career—so pleased with the bill? An ardent centralist, Macdonald had little use for provincial governments; if it had been up to him, they might have been abolished at Confederation. In the years preceding his franchise bill, the struggle between the federal government and the provinces had intensified. Ontario, led by Oliver Mowat's Liberals, had won battles with the federal government on provincial boundaries and alcohol licensing. There seemed to be the risk of a snowball effect: in Nova Scotia, also led by a Liberal government, withdrawal from Confederation was touted as a real possibility. In this context, Macdonald could no longer allow the provinces to control the entitlement to vote in federal elections.\n\nHe tabled a bill giving full control of the franchise to the federal government. The bill led to unprecedented debate in the House of Commons. Between April 16 and July 6, 1885, members engaged in heated discussion of every facet of the legislation, often late into the night. The government finally had to concede a number of amendments. The result was an extremely complex elections act that, instead of producing a uniform Canadian electorate, diversified the electorate even more.\n\nAt a time when Ontario was preparing to expand access to the vote, Macdonald contrived to keep the property-based qualification. Along with most members of his party, he had a profound aversion to universal suffrage, which he considered one of the greatest evils that could befall a country. Perhaps convinced that most women were conservative, Macdonald suggested giving the vote to widows and \"spinsters\" who owned property. He backed down, however, in the face of objections from some of his own members. The suspicion remains that Macdonald had inserted the clause as a sacrificial lamb, never intending it to survive final reading of the bill.\n\nMacdonald's 1885 Electoral Franchise Act retained the three basic conditions common to all the provinces: being male, having reached the age of 21 and being a British subject by birth or naturalization. The property-based qualification differed according to whether an individual lived in an urban or a rural riding. Furthermore, in urban areas, it varied according to whether an elector lived in a city or a town (a distinction based on population size). Table 2.3 summarizes the resulting franchise across the country.\n\nTable 2.3\n\nMinimum Conditions Required to Vote in Federal Elections, 1885 footnote 10 Value of real property, whether occupied by owners or tenants footnote 11 Amount of annual rent for tenants Annual income $300 (cities) footnote 12\n\n$200 (towns)\n\n$150 (rural areas) footnote 13 $2/month or $20/year $300\n\nFor example, to be qualified to vote in a city, a man was required to own real property valued at $300 or more. The occupant in good faith of a property of the same value was also qualified to vote. Tenants who paid a monthly rent of at least $2 or an annual rent of at least $20 could also vote, as could persons whose annual income was at least $300. Sons of owners, or of widows of owners, whose total property value, divided among them, was sufficient to confer the right to vote on each of them were qualified to vote, on the condition that a son had lived with his mother or father for one year with no break longer than four months. Furthermore, all electors except property owners were subject to a one-year residency requirement.\n\nPrince Edward Island and British Columbia, where there had been no property-based qualification, received special treatment. In both provinces, anyone who already had the right to vote when the 1885 act was passed continued to enjoy that right; however, those who reached the age of 21 after that date were subject to the same property or income qualifications as those in effect in the other provinces.\n\nThe property-based qualifications set by the Electoral Franchise Act clearly favoured rural residents over urban dwellers. Furthermore, the qualifications were set higher than they had been before in most provinces. The Act did give the vote to new classes of persons, on certain conditions, including fishermen, property owners' sons and farmers' sons (although they already had the vote in British Columbia and Prince Edward Island). At the same time, however, the Act made it more difficult for small property owners and some tenants to obtain the right to vote.\n\nComparing Tables 2.1 and 2.3 shows that property owners saw the most significant increase in voting qualifications. In New Brunswick and Manitoba, the required value of property tripled for cities and doubled for towns; in rural areas, it rose by 33 percent. In Nova Scotia, it doubled for cities and climbed by 33 percent for towns, but remained the same in rural areas. In Ontario, the property qualification rose by 33 percent for both rural and urban areas. In Quebec, it remained unchanged for urban areas and fell by 25 percent for rural areas.\n\nThe situation with regard to tenants is more difficult to pin down. In the provincial laws that had previously applied, eligibility to vote was related to the value of leased property rather than the annual rent paid, making comparisons difficult. Under the 1885 act, at least some tenants became new members of the electorate. In New Brunswick, where no tenant had had the vote, the new law enfranchised those who paid the minimum required rent. In Manitoba and rural Quebec, the annual rent requirement was unchanged; in Quebec cities, it dropped by one third. Elsewhere, it can be assumed that the new law affected tenants adversely to the extent that the required value of leased property rose significantly.\n\nBecause the number of citizens in each category is unknown, it is impossible to arrive at an accurate figure for the electorate as a whole. It can be assumed, however, that the new electoral law reduced the overall size of the electorate. Residents of two provinces—British Columbia and Prince Edward Island, where universal male suffrage had almost been achieved—were clear losers. In these provinces, those who already had the right to vote kept it. But others reaching voting age were subject to the property-based requirements, which inevitably reduced the relative size of the electorate. The citizens of two other provinces were also clear losers as a result of the changes: Ontario, because it was the most urbanized province and the legislation favoured rural residents, and Nova Scotia. These two provinces, both with Liberal governments in power, were precisely the provinces that had caused the biggest headaches for the Conservative government in Ottawa in the matter of the division of powers. In just one province—Quebec, a Conservative stronghold since 1867—did the size of the electorate appear to have increased.\n\nThe Last Hurrah, 1891 At age 75, Sir John A. Macdonald fought his last election campaign, defending his protectionist National Policy against the idea of \"commercial union\" with the United States. Library and Archives Canada, e010934529\n\nThe 1885 act was more lenient than most of the previous provincial acts in terms of the right to vote of judges and some classes of government employees. Only the chief justice and justices of the Supreme Court of Canada and the chief justices and magistrates of provincial superior courts were prohibited from voting. Furthermore, some election officials (returning officers, poll clerks and the revising officers who updated the lists of electors) were allowed to vote, but only in a riding other than the one where they worked. This rule also applied to all individuals who worked for a candidate in any capacity before or during an election.\n\nThe new election law retained existing racial restrictions and even disenfranchised some First Nations people in Quebec and the Maritimes. Persons of \"Mongolian and Chinese race\" were expressly deprived of the right to vote. According to Sir John A. Macdonald, persons of Chinese origin ought not to have a vote because they had \"no British instincts or British feelings or aspirations.\" (Roy, 152) Furthermore, the First Nations people of Manitoba, British Columbia, the District of Keewatin and the Northwest Territories had no vote, and those living on reserves elsewhere in Canada were required to own and occupy a piece of land that had been improved to a minimum value of $150.\n\nMacdonald was pleased, not only with recovering control of the franchise but also with ensuring that, from then on, the electoral lists would be drawn up by revising officers appointed by the government in power. These lists were the keystone of the electoral system. If an elector's name was missing from the list, he could not exercise his right to vote. Macdonald himself, on the advice of his supporters, appointed the revising officers. Over the years, he established a complex countrywide network of his own appointees, which he controlled completely and effectively.\n\nLaurier Decentralizes the Franchise\n\nFor the Liberals, the 1885 election legislation was a bitter pill to swallow. They had only to wait for the right moment to change track. Macdonald died in June of 1891. Without him at the helm, the Conservatives soon foundered, and the Liberals under Wilfrid Laurier took power in 1896. When Charles Fitzpatrick, the solicitor general, tabled a proposed new electoral law in the House of Commons, he said that since 1885, preparation of the electoral lists had cost the public coffers more than $1,141,000, an enormous sum at that time.\n\nThe new act, which took effect on June 13, 1898, was designed to correct the situation by giving the provinces responsibility for drawing up electoral lists and, once again, control of the right to vote in federal elections. The situation had regressed to the pre-1885 system, including significant inequality among electors in different provinces.\n\nRunning on Their Record, 1904 The Liberals appealed to voters with a wall of achievement—built of bricks that included \"Unjust Franchise Act Repealed\" and \"Gerrymander Wiped Out.\" Says Miss Canada to Wilfrid Laurier, \"Mr. Foreman you have done splendidly so far, I count on you and your men to complete the work.\" Library and Archives Canada, C-122035\n\nTo mitigate these disparities, the new federal law specified that the provinces were not empowered to disqualify voters. More specifically, the provinces were prohibited from excluding a citizen, otherwise qualified to vote, from exercising the right to vote on the grounds that he practised a particular profession or carried on a particular occupation, worked for the federal government or a provincial government, or belonged to any class of persons. As a result, citizens of Chinese or Japanese descent living in British Columbia obtained the right to vote in federal elections (even though they were excluded from provincial elections), as did federal and provincial government employees in Nova Scotia, Prince Edward Island, Quebec, Ontario and Manitoba.\n\nThe situation with regard to First Nations people was less clear-cut. At first glance, the wording of the Act seems to suggest that they were also excluded from disqualification by provinces. There were indications, however, that in the minds of the legislators, \"Indians\" did not belong to \"any class of persons.\" Until that time, the Liberals had always appeared reluctant to give First Nations people the right to vote. At its 1893 convention, the party made a formal statement condemning any measure of this kind. Later, the federal government refused them the right to vote in the Northwest Territories and Yukon, both of which were under direct federal control. It is therefore highly probable that the provisions disqualifying them from voting in provincial elections applied to federal elections as well.\n\nIn 1898, most provinces already applied significant restrictions on First Nations people's right to vote. No First Nations person was allowed to vote in British Columbia or New Brunswick. In Manitoba, the right to vote was reserved for \"Indian\" persons who received no benefit from the Crown and had received no such benefit during the three years preceding an election. In Ontario, the right was given only to \"enfranchised Indians\" or to First Nations persons living outside a reserve, on condition that the latter owned real property assessed at $200 or more in a city or town or $100 or more in a village or township. This last condition was even more discriminatory because Ontario had abolished all property-based qualifications for non-Indigenous electors 10 years earlier.\n\nThe situation did not improve in the years that followed. In 1915, Quebec withdrew the voting rights of First Nations persons living on reserves, and by July 1919, First Nations persons living on reserves anywhere in the country were no longer entitled to vote in federal by-elections.\n\nThe Liberals' 1898 election law excluded other groups as well, among them previously excluded federally appointed judges. Furthermore, three classes of individuals already disqualified from voting in Manitoba, Ontario and New Brunswick—prison inmates as well as residents of lunatic asylums and charitable institutions receiving assistance from a municipality or the government—were now disenfranchised throughout the country. In addition, persons who, before or during an election, were hired by another person and remunerated in any way for working as an agent, clerk, solicitor or legal counsel were also disenfranchised. Electors found guilty of election fraud lost the right to vote for seven years. Finally, returning officers and poll clerks were prohibited from voting in the riding in which they performed their duties. All these exclusions remained in force until at least 1920.\n\nThe 1898 act specified that the conditions that qualified a person to vote in a federal election were the same as those that qualified the individual to vote in provincial elections in his province of residence. This principle was more restrictive than it appeared at first glance. Because statutory disqualification was no longer permitted, the provinces were left with five factors that they could use to control the right to vote: age, gender, citizenship, length of residence and property-based requirements. The first three qualifications were already common to all provinces. From Atlantic to Pacific, only males age 21 or over who were born or naturalized British subjects were qualified to vote. Residency requirements, which varied from province to province, might apply to the province as a whole, to the electoral district or to both.\n\nAfter the Elections, Part 2 The 1878 Quebec provincial election resulted in numerous cartoon depictions of the vanquished and the victor, such as this one from the Canadian Illustrated News. Library and Archives Canada, Canadian Illustrated News, May 4, 1878, C-067823\n\nThe required length of residence in the province was 6 months in British Columbia and 12 months everywhere else; for particular ridings, the provisions ranged from 1 month to 12 months. Ontario, the most urbanized of the provinces, added a specific provision with regard to cities and towns, where changes of domicile were extremely common. The residency requirement was 12 months in the province, 3 months in the town in question and 1 month in the riding. These provisions tightened restrictions on urban electors, who often moved in pursuit of work, without penalizing them too harshly.\n\nBefore 1920, only two provinces changed their residency requirements. In 1907, New Brunswick halved it, from 12 months to 6. The same year, Ontario relaxed its 12-month residency requirement to include residence anywhere in the country, though the additional residency requirements for urban areas remained in place. A few provinces accepted the fact that some individuals (loggers, sailors, students) were occasionally or temporarily absent from their usual residence to carry on their occupation or attend an educational establishment. In 1900, the federal government decreed that military personnel and war correspondents did not lose the right to vote because of absence for reasons of active duty. The measure, which affected all provinces, was adopted to accommodate Canadians serving in the Boer War in South Africa. When the war ended two years later, the privilege granted to Canadian servicemen remained in place.\n\nFamily Connections, 1902 This card urged electors to nominate and vote for T. F. Wallace but did not achieve its goal: Wallace lost the 1902 by-election. He was likely a relative of Nathaniel Clarke Wallace, member of Parliament for West York from 1878 until his death in 1901, and of Thomas George Wallace, who held the seat from 1908 to 1921. Library and Archives Canada, C-976540\n\nBefore adoption of the 1898 act, property-based qualifications were the main curb on expansion of the electorate. At that time, this restriction still existed in only four provinces: Prince Edward Island, New Brunswick, Nova Scotia and Quebec.\n\nIn Prince Edward Island, property-based qualifications affected only persons 60 years of age or over, who were required to own real property assessed at at least $100 or generating a minimum annual income of $6. In 1902, the province achieved universal male suffrage when it abolished the requirement. To qualify to vote in New Brunswick, it was necessary to own real property assessed at $100 or more, or real property and personal property with a combined value of $400. Persons earning an annual income of $400 were also qualified to vote. This threshold was very high; at the turn of the century, a textile worker, for example, earned an average of $240 per year. New Brunswick abolished property- and income-based qualifications in 1916.\n\nIn Nova Scotia, the situation had remained unchanged since 1885. To be qualified to vote in the province in 1898, it was still necessary to own, rent or occupy property assessed at $150 or more. Furthermore, an individual who owned personal property and leased or occupied property whose value, added to that of the personal property, totalled $300 was qualified to vote. Co-owners, co-tenants, sons of men qualified to vote or of widows who owned, occupied or leased property with a value sufficient to confer the right to vote could vote under the same conditions as those that existed before 1885. The province later qualified as electors persons earning an annual income of at least $250 and fishermen who owned real property, boats, nets and fishing tackle with a combined value of $150 or more. Property- and income-based qualifications were eventually eliminated in the province in 1920.\n\nIn Quebec, where urbanization was in full swing, the property-based qualifications in force in 1898 still favoured residents of rural areas. In urban areas, owners or occupants in good faith of premises assessed at $300 could vote; in rural areas, the minimum required value was just $200. A similar disparity existed between tenants in urban areas, where the minimum annual rent was $30, and tenants in rural areas, where it was $20. Persons receiving a minimum annual income of $300 were also qualified to vote. Fishermen could vote if they owned boats, nets, seines and fishing tackle worth a total of $150 or more. Furthermore, retired farmers and property owners (referred to as life annuitants) could also vote if their annuity—in cash or in kind—was $100 or more. Teachers were exempt from any property-based requirement. In 1912, Quebec substantially reduced financial qualifications, a measure that gave the right to vote to the great majority of men in the province.\n\nThe lists used in [the 1908 federal] election were provincial lists which had been compiled two or more years earlier, and contained the names of many dead and absent persons. However, by a custom regarded as common and ordinary, the votes of the dead and absent were not lost but were made good use of by both contesting parties. — Charles G. (\"Chubby\") Power, A Party Politician , 1966\n\nBroadcasting the News, 1911 In the days before mass media, broadcasting an election proclamation required a brush and a bucket of paste (Lambton County, Ontario). John Boyd, Library and Archives Canada, PA-060819\n\nThe 1898 federal legislation certainly expanded the Canadian electorate. To what extent? Because censuses from that era are relatively unreliable, it is impossible to say. One thing is certain: when the legislation was adopted, most provinces, including Ontario (the province with the largest population), had already introduced universal male suffrage. In these provinces, therefore, universal male suffrage also applied to federal elections. This was a significant step forward from Macdonald's 1885 legislation, which not only maintained the principle of property- or income-based qualifications but even raised the eligibility threshold in most areas of the country. Laurier's 1898 law broadened the electorate by prohibiting provincial disqualification based on race or socio-professional characteristics. Nonetheless, two provinces—British Columbia and Manitoba—tried to find ways to get around the federal legislation.\n\nThe 1898 Plebiscite on Prohibition The year 1898 marked the first time the federal government held a referendum—the prohibition plebiscite. Some 44.6 percent of the electorate voted: of those, 51 percent voted in favour of a prohibition on alcohol, and 49 percent voted against. With such a close result, Prime Minister Laurier decided there was not enough support for legislating prohibition.\n\nIn 1901, British Columbia decreed that no one could vote if he was unable to read the provincial election legislation, which was written in English. Naturally, this measure was hostile to the enfranchisement of citizens of Chinese or Japanese origin. The following year, Manitoba adopted a similar strategy: no one was qualified to vote who could not read the Manitoba elections act in English, French, German, Icelandic or a Scandinavian language; this effectively prohibited many immigrants of Polish, Ukrainian and Russian origin from voting in federal elections. The record does not show whether the federal government intervened to counteract these efforts at disenfranchisement.\n\nBoundary Redistribution\n\nFor the democratic process to be truly representative, a system for maintaining the fair and balanced distribution of constituency boundaries is essential. The Fathers of Confederation addressed this requirement in the Constitution Act, 1867 by adopting the basic working principle of \"representation by population\" for the House of Commons. Given that the Act guaranteed Quebec a minimum of 65 seats in the House of Commons, the seat allotment for the rest of the country was determined by dividing the average population in Quebec's 65 ridings into the total population for each of the other provinces—thus making the number of seats per province proportional to their respective populations. The Constitution Act, 1867 furthermore provided a mechanism for maintaining this balance by specifying that a process to review and adjust provincial seat allotments, as well as boundaries of individual ridings, should occur after each 10-year census.\n\nSignificantly, in those early years after Confederation, the responsibility for determining the new boundary placements rested solely with the government. The Representation Act of 1903 sought to rectify the consequent political advantage by conferring the job of boundary readjustment on a bipartisan committee of the House of Commons. Since the governing party still held a majority on the committee, though, the pursuit of balanced democratic representation remained a secondary consideration, and blatant political manoeuvring within the process continued to fuel rancorous debate for another 60 years.\n\nBorden's Strategic Measures\n\nAfter Canada declared war on Germany in August 1914, the country fell victim to a wave of collective hysteria. The commander of the naval yard at Esquimalt, British Columbia, was so fearful of a German invasion that he succumbed to nervous collapse. Fear of spies gave rise to general mistrust of new Canadians, especially those from Germany or Austria-Hungary. At that time, immigrants from these countries accounted for about 5 percent of the population of Canada. In October 1914, the federal government interned foreign nationals identified by government officials as a potential danger to the country. More than 8,500 individuals were sent to closely guarded internment camps.\n\nThree years later, the war dragged on, and volunteers for military service had begun to fall short of requirements. In April 1917, the number of volunteers was only 5,530; in May, it was up slightly at 6,407. But Canadian losses at the front were high: in April alone, 3,600 Canadians were killed and 7,000 wounded at the battle of Vimy Ridge. The Conservative prime minister, Sir Robert Borden, travelled to England and returned shaken by the experience. To him, there was only one solution: in June, he tabled a military service bill authorizing the government to conscript any male person between the ages of 18 and 60.\n\nMaking the Vote Accessible, 1916–1917 Special arrangements for electors unable to vote because of occupation or assignment abroad were introduced gradually to improve access to the vote. For example, in 1915, the postal ballot was introduced. These photos show soldiers voting overseas in the federal election of December 1917 and the British Columbia election of September 1916. Department of National Defence, Library and Archives Canada, PA-002318 Voting overseas during the First World War William Ivor Castle, Canada Department of National Defence, Library and Archives Canada, PA-000554\n\nBorden's government was already in serious trouble, however, and an election was imminent. Could the conscription issue defeat them at the polls? This was what was predicted in the West, where the largely immigrant population already sympathized strongly with Laurier's Liberals, and the conscription issue seemed to be strengthening the trend. Across the country, union leaders got ready to do battle with conscriptionists. In Ontario, the rural population opposed conscription, and Francophone Quebec rejected conscription spontaneously and massively.\n\nBorden and his government, who saw their situation as increasingly desperate, attempted to modify the composition of the electorate by changing the electoral law. Borden confided to his diary, \"Our first duty is to win at any cost the coming election so that we may continue to do our part in winning the war and that Canada be not disgraced.\" On September 20, 1917, Parliament adopted not one, but two election acts, though Borden had to use closure to push them through.\n\nThe first, the Military Voters Act, was designed to increase the number of electors potentially favourable to the government in power. As its title suggests, the law defined a military voter as any British subject, male or female, who was an active or retired member of the Canadian Armed Forces—including First Nations persons and persons under 21 years of age, independent of any residency requirement—as well as any British subject ordinarily resident in Canada who was on active duty in Europe in the Canadian, British or any other allied army. (Thus, some 2,000 military nurses—the \"Bluebirds\"—became the first Canadian women to get the vote; see next section.) Furthermore, military voters could assign their vote to any riding in which they had previously resided, or their vote could be assigned by the party of the military voter's choice to the riding where it would be most useful. Finally, the Act contained a short section that appeared innocuous but was extremely significant: several hundred thousand votes from overseas would be counted only 31 days after an election in Canada.\n\nThe second law, the Wartime Elections Act, had a dual purpose: to increase the number of electors favourable to the government in power and decrease the number of electors unfavourable to it. The law conferred the right to vote on the widows of Canadian Forces members as well as on the spouses, mothers, sisters and daughters of any persons, male or female, living or dead, who were serving or had served in the Canadian Forces, provided they met the age, nationality and residency requirements for electors in their respective provinces or Yukon. It also conferred the right to vote on those who did not own property in accordance with prevailing provincial law but had a son or grandson in the army. (This provision affected only Quebec and Nova Scotia, as the other provinces had already abolished property- and income-based qualifications.)\n\nThe Act also disenfranchised conscientious objectors. This affected Mennonites and Doukhobors, two pacifist groups, even though the federal government had exempted them officially from military service: the former in 1873 and the latter in 1898. Individuals born in an enemy country who became naturalized British subjects after March 31, 1902, were also disenfranchised, with the exception of those born in France, Italy or Denmark who arrived in Canada before the date on which their country of origin was annexed by Germany or Austria. Also included were British subjects naturalized after March 31, 1902, whose mother tongue was that of an enemy country, whether or not the individual's country of origin was an ally of Great Britain. The same rule applied to persons found guilty of an offence under the Military Service Act, 1917. Overall, new Canadians living on the Prairies were the most seriously affected by the Wartime Elections Act, with tens of thousands being disenfranchised.\n\nFinally, the legislation of September 20, 1917, stripped the provinces of the responsibility for drawing up electoral lists and gave the task to enumerators appointed by the federal government—in other words, by the Conservatives as the party in power. The president of the Canadian Suffrage Association remarked that the Act would have been more honest if it had simply disenfranchised everyone who failed to promise to vote for the Conservatives! All Borden had to do now was call an election.\n\nBut the race was not yet won. One week after the two laws were passed, an informant with sources in government circles reported to Laurier that the Conservatives, fearing defeat, were preparing to mobilize English-Canadian opinion against French Canada. Who among Borden's inner circle had devised the strategy? One thing was certain: Borden did not reject it. In the next few months, the English-language press painted a picture of Quebec as a province that was as big a threat to Canada as Germany was to the world.\n\nCases of election fraud soared during the subsequent election campaign. A soldier suspected of intending to vote Liberal was threatened with being sent immediately to the front. Telegrams and letters from the federal cabinet even specified the number of floaters to be entered on the electoral lists to assure election of a given candidate in a given riding. An officer who feared investigation of the irregularities was told that anyone who failed to hold their tongue would be buried in France within six months. Efforts to exercise \"undue influence\" on the election resurfaced on a scale previously unheard of. The Sunday preceding the election, in three out of four Protestant churches across the country, pastors and ministers exhorted the people to look on voting for the government in power as a sacred duty, failing which Canada would be disgraced.\n\nThe election was held on December 17, 1917. As specified in the Military Voters Act, the votes of civilian electors were counted before those of military voters. The military vote was more than 90 percent for Conservative candidates. The Conservatives won at least 14 additional seats by redistributing the military vote to ridings where opposition candidates had a slight lead. Borden won the election. But was Canada less \"disgraced\"? The proposition is doubtful at best. A few days before Canadians went to the polls, Laurier remarked to Sir Allen Aylesworth, one of his oldest friends, \"The racial chasm which is now opening at our feet may perhaps not be overcome for many generations.\"\n\nWomen and the Vote\n\nThe Bluebirds who voted in the 1917 federal election may have been the first Canadian women to do so with the official sanction of the electoral law behind them, but they were not the first women in the colonies of British North America to vote.\n\nA Woman Votes in Lower Canada, 1827 A handwritten record of names, qualifications, challenges and votes for the election of July 25, 1827, shows that Agnes Wilson's vote (left-hand column, fourth name from the bottom) was not challenged. Women in Lower Canada were not bound by the common law convention barring women from the polls. Library and Archives Canada, RG 4-B72, Volume 21, pages 3153-4\n\nAt Confederation, all the original colonies had statutory provisions excluding women from voting;footnote 14 these were entrenched in section 41 of the Constitution Act, 1867:\n\nUntil the Parliament of Canada otherwise provides, all laws in force in the several Provinces of the Union … shall … apply to elections of Members to serve in the House of Commons … [and] every male British Subject, aged Twenty-one Years or upwards, being a householder, shall have a vote. — Constitution Act, 1867, section 41\n\nThe colonies (except for Lower Canada) inherited England's common law tradition, under which women had not exercised the franchise for centuries; this was the result of convention, not statute law. (Garner, 156) In the colonies, the convention seems to have been less influential.\n\nWomen and the Right to Vote, 1867–1900 1867 Constitution Act, 1867 entrenches women's exclusion from the vote. 1873 Female property owners in British Columbia are first \"Canadian\" women to gain the right to vote in municipal elections. 1876 First women's suffrage group set up in Toronto under the guise of a literary society. 1885 Sir John A. Macdonald introduces, then withdraws, an elections act amendment that would have given women the right to vote. 1894 Women's Enfranchisement Association of New Brunswick formed.\n\nManitoba Equal Suffrage Club founded.\n\nHouse of Commons votes down a petition for women's suffrage presented by the Women's Christian Temperance Union. 1900 By this date, most women property owners have the right to vote in municipal elections.\n\nOnly New Brunswick explicitly prohibited voting by women before 1800. There, the council banned women from voting in the colony's inaugural election, held in 1785, but the assembly later failed to include the ban in the colony's first electoral law, passed in 1791.\n\nIn Upper and Lower Canada, the Constitutional Act of 1791 was silent on the issue of women voting, extending the franchise to \"persons\" who owned property of a certain value. Not being subject to the common law, women in Lower Canada turned out to vote at several locations. Madame Rosalie Papineau, mother of Louis-Joseph Papineau, voted for her son at the 1809 election, declaring her choice \"a good and faithful subject.\" The women accompanying her also voted. By the 1820 election the practice had spread, and voting by women was recorded in Bedford County and Trois-Rivières, where a local citizen wrote later that two members had been elected by the \"men and women of Trois-Rivières, for here women vote just as men do, without discrimination.\" In Trois-Rivières, one man was even disenfranchised because he had placed his property in his wife's name. On election day, \"the unhappy man appeared at the polling place, only to find himself doubly humiliated by being refused the franchise and then sent to get his wife to the polls because she was the qualified voter in that family.\" (Cleverdon, 215)\n\nThe Suffragist Movement The Manitoba Political Equality League was founded in 1912 and was instrumental in the movement to enfranchise Canadian women. In 1916, Manitoba women were the first to gain the right to vote in provincial elections. Women across the country gained the same federal voting rights as men in 1918 when gender barriers were removed at the federal level. Cyril Jessop, Library and Archives Canada, e010933901\n\nIn Upper Canada, the common law tradition seems to have prevailed, since there are no written accounts of women voting or records of election-related complaints involving voting by women.\n\nTwo recorded incidents in Nova Scotia make it clear that women voted there. The first involved a disputed election in Amherst Township and the second an 1840 election in Annapolis County, where the Tories made great efforts to use women's votes to save the riding from a Reform landslide and the Reformers countered by transporting their own female supporters to the polls. The Tory effort was in vain. The Reform women did not even have to vote—they turned out at the polls in such large numbers that the Tory women returned home without voting. (Garner, 156)\n\nThe 1840 Act of Union, uniting Upper and Lower Canada in the Province of Canada, contained no prohibition on voting by women, and neither colony had a law against it. At least seven women voted in the 1844 election in Canada West—the first recorded occurrence of a violation of the common law practice. This came to light as a result of a protest by the defeated Reform candidate that seven women had voted for his Tory opponent. When they returned to power in 1849, the Reformers used the occasion of a general consolidation of electoral laws to insert a clause excluding women from the vote.\n\nThe entry of women into politics, even if only by suffrage, would be a misfortune for our province. There is no basis for it, be it natural law or social benefit. Rome will approve our viewpoint, which is that of all our episcopate. — Mgr Bégin , motion tabled at the National Assembly on January 10, 1922 (translation)\n\nThe female franchise had already begun to contract in 1834, when Lower Canada's legislative assembly attached a clause restricting voting by women to an act dealing with controverted elections.footnote 15 The pretext was that polling stations had become too dangerous for women. (Violence during the 1832 election had resulted in three deaths.) The 1830s also saw the rise of ultramontanism, a conservative clergy-led movement that was to affect many aspects of Quebec society. The Imperial Reform Act of 1832, which restricted the franchise in the United Kingdom to men, may also have been influential.\n\nWomen and the Right to Vote, 1912–1921 1912 Manitoba Political Equality League founded in Winnipeg.\n\nMontreal Suffrage Association formed. 1914 Flora MacDonald Denison, suffragist journalist and president of the Canadian Suffrage Association, publishes War and Women . 1915 Edmonton, February. Nellie McClung, heading one of the largest delegations to the Alberta legislature ever assembled, presents a petition demanding the vote for women.\n\nWinnipeg, December. Suffragists present a 45,000-name petition to Premier Tobias C. Norris. 1916 January. Manitoba women are the first in Canada to win the right to vote in provincial elections.\n\nMarch. Saskatchewan women get the right to vote.\n\nApril. The suffrage movement triumphs in Alberta. 1917 February. Ontario women get the vote but still cannot sit in the legislature.\n\nApril. British Columbia women get the right to vote.\n\nServing members of the armed forces (including women) get the federal franchise through the Military Voters Act .\n\n. Female relatives of soldiers at the front get the right to vote through the Wartime Elections Act . 1918 May 24. Royal assent given to a bill giving women the right to vote in federal elections. Eligibility: age 21 or older, not alien-born and meet property requirements in provinces where these exist. 1919 Electoral law amended—women can now stand for federal office. 1920 Federal electoral law amended; changes include universal female (and male) suffrage regardless of provincial law. 1921 First federal election at which women vote under universal franchise.\n\nAnother force was at work as well: cultural politics. The events in Bedford County in 1820 demonstrated that restriction of the franchise may have been less the result of hostility to women voting than of language and cultural tensions. In Bedford, the defeated candidate complained to the assembly that his opponent had been elected in part by the votes of 22 married women—in other words, husbands and wives had exercised the right to vote on the basis of the same pieces of property.\n\nThe assembly responded by resolving that the women's votes had been illegal, but the resolution seems to have been prompted by the fact that the women's votes had elected an English-speaking candidate at the expense of the French-speaking incumbent. This impression is reinforced by an incident eight years later, when in 1828 petitioners contested the election of Andrew Stuart after an English-speaking returning officer in Québec refused to accept one woman's vote for Stuart's French-speaking opponent. (Garner, 157)\n\nWhatever the source of the restriction, and regardless of the fact that the 1834 law was later struck down, increasing social conservatism seems to have done its work, and women in Lower Canada appear to have ceased voting in significant numbers. (Hamel, 227)\n\n[Women's suffrage] is a matter of evolution and evolution is only a working out of God's laws. For this reason, we must not attempt to hurry it on. — James P. Whitney, The Mail and Empire , March 21, 1911\n\nTable 2.4\n\nWomen's Democratic Rights Right to Vote Right to Be a Candidate British Columbia 1917 1917 Alberta 1916 1916 Saskatchewan 1916 1916 Manitoba 1916 1916 Ontario 1917 1919 Quebec 1940 1940 New Brunswick 1919 1934 Prince Edward Island 1922 1922 Nova Scotia 1918 1918 Newfoundland 1925 1925 Northwest Territories 1951 1951 Yukon 1919 1919 Nunavut footnote 16 1999 1999 Canada 1918 1919\n\nBetween that time and Confederation, the female franchise was eroded further. Women were disenfranchised by law in Prince Edward Island in 1836, in New Brunswick in 1843 and in Nova Scotia in 1851. Two years earlier, in 1849, the Reform government of the Province of Canada had gained legislative approval for a law prohibiting women from voting: \"May it be proclaimed and decreed that no woman shall have the right to vote at any election, be it for a county or riding, or for any of the aforesaid towns and cities.\" This ended years of confusion about the validity of the female franchise in the Canadas.\n\nThis was the situation at Confederation: women of property in the various colonies had enjoyed the franchise (or at least had not faced legal restrictions), then lost it over a period of years and for a variety of reasons. Within a decade, however, a women's suffrage movement had begun in almost all the former colonies. The exception was Quebec, where extreme conservatism and the influence of the Roman Catholic Church still held sway in social, political and religious matters. Elsewhere in Canada, the push for women's suffrage had taken hold by the 1870s.\n\nThe first suffrage societies were established by women seeking social, economic and political equality with men. Many were professionals, often pioneers in fields such as medicine, who had encountered discrimination first-hand. (Bacchi, 433) This decade saw the founding of the Toronto Women's Literary Club by Dr. Emily Stowe, Canada's first female doctor, in 1876. The club was in fact a screen for suffrage activity and thus was the country's first suffragist organization, changing its name in 1883 to the Toronto Women's Suffrage Association.\n\nBut soon the suffrage movement took on a different cast, attracting men and women of Protestant Anglo-Saxon origins, most of whom belonged to the educated urban middle class—professionals, clergymen, a few reform-minded businessmen and their wives. (Bacchi, 433) These suffragists had a broad social reform agenda, one that embraced workplace safety, public health, child labour, prohibition of the production and sale of alcohol, prostitution, the \"Canadianization\" of immigrants as well as votes for women. The Women's Christian Temperance Union (WCTU), for example, became a force in the suffrage movement, convinced that if women had the vote, temperance would be assured.footnote 17\n\nSisters in the Struggle, 1916 British suffragette Emmeline Pankhurst was photographed in 1916 at the Edmonton home of Nellie McClung. Mrs. McClung is in the centre, wearing a striped dress; Mrs. Pankhurst is to her left. Also in the group was Emily Murphy (author, suffragist and later a judge), one of the five complainants in the 1929 \"Persons Case,\" in which the British Privy Council determined once and for all that Canadian women were indeed \"persons\" and therefore eligible for appointment to the Senate. Royal BC Museum and Archives, Image B-06786\n\nSimilarly, social reformers intent on combatting the evils of industrialization and the urbanization that accompanied it—abuse of alcohol, prostitution, venereal disease, neglect of children—joined the suffrage movement with the goal of bolstering the social order with what might now be called \"family values.\" Giving women the right to vote would double the family's representation and extend maternal influence into the political sphere.\n\nIn Quebec, the picture was different. As the suffrage movement elsewhere in Canada was taking its first steps, Quebec moved to prohibit women voting in municipal elections and to amend the Civil Code to make women legally \"incapable\"—of owning property, of inheriting an estate and certainly of voting. Advocates of women's rights in that province therefore focused more on gaining legal reforms and equality of opportunity in education than on the vote. It was not until the 1930s that the focus shifted to women's suffrage. Also apparent was the influence of conservative clergy and nationalists who objected to the Anglo-Saxon origins of the suffrage movement.\n\nIn the 1880s, debate about women's suffrage became linked with provincial autonomy issues. Until 1885, under the terms of the Constitution Act, 1867, which provided that existing provincial election laws would continue until Parliament decided otherwise, the provinces determined who was eligible to vote in federal elections. Prime Minister John A. Macdonald changed that with the Electoral Franchise Act of 1885, which consolidated control of the franchise at the federal level. As mentioned earlier, Macdonald even included a clause giving propertied widows and single women the right to vote, though he later withdrew it: apparently it had been a sacrificial lamb never intended to remain in the final version of the law. Sir Wilfrid Laurier's Liberal government returned the federal franchise to provincial control with a new electoral law in 1898. The focus of suffragist activity therefore shifted to provincial governments and legislatures, where it remained for the next two decades.\n\nBy the end of the 19th century, then, the women's suffrage movement was well under way, with organizations active in the western provinces, Ontario and the Maritimes. The municipal franchise was extended gradually; by 1900, most women property owners across the country could vote in municipal elections.\n\nIn addition, bills to give women the right to vote had been introduced in New Brunswick, Nova Scotia, Ontario and British Columbia, though none was successful. Between 1885 and 1893, and again between 1905 and 1916, a bill introduced annually in the Ontario legislature to give women the right to vote provoked laughter and derision. Bills were also introduced in the New Brunswick legislature in 1886, 1894, 1895, 1897, 1899 and 1909; all were defeated (some by only a narrow margin) or allowed to die on the Order Paper. Women presenting petitions at the time the 1909 bill was introduced were greeted by insults, whistles and jeers from members of the legislative assembly in the corridors, who asked the sergeant-at-arms to ring the division bells until the women left the building.\n\nTo counter these attitudes, Canada's suffragists relied on petitions to provincial governments—sometimes containing as many as 100,000 names; on lecture tours and speaking engagements; on meetings with politicians; and on public meetings and events, such as mock parliaments. The confrontational tactics adopted by British and American campaigners for women's suffrage had no counterpart in Canada.\n\nVotes for Men! Women's suffrage groups often staged public events to advocate their cause. In January 1914, a play written by Nellie McClung was staged in Winnipeg, featuring women in the role of legislators listening to a group of men petitioning for the vote. Playing the role of provincial premier, McClung rejected the idea, declaring that \"Man is made for something higher and better than voting. Men were made to support families. What is a home without a bank account!\" McClung mimicked Premier Sir Rodmond Roblin so well that the audience often roared with laughter. Chronicle of Canada, 557 Foote and James, Archives of Manitoba, Events 173, PR1967-43\n\nThe suffragists were well organized, willing to buck social convention and skillful at enlisting the help of influential organizations, particularly in the West, where they gained the support of the United Farmers' Association of Alberta and the Grain Growers Association. As has been the case with other social issues in Canada, the Western provinces led the way in enfranchising women. Manitoba was the first, extending the provincial franchise to women in January 1916. Saskatchewan and Alberta followed suit in March and April respectively. The next year, 1917, Ontario women got the vote in February and British Columbia women in April. Also that year, Louise McKinney of Alberta, a temperance and women's rights advocate, became the first woman elected to a Canadian legislature.\n\nThis broadening of the provincial franchise, coupled with extension of the franchise to propertied women in municipal elections, created pressure for change at the federal level. But the immediate impetus was political, and women's first access to the federal franchise was almost accidental. On the eve of the 1917 general election, the government of Sir Robert Borden faced a complicated situation: women in all provinces from British Columbia to Ontario had the vote by virtue of provincial electoral law; women living east of the Ontario/Quebec border did not. Without some standardization of the franchise, ridings in Ontario and the West would have twice as many electors as those in Quebec and the Maritimes.\n\nThe temporary solution that presented itself had less to do with women's rights than with the pressing political issue facing Borden's government: conscription. As described earlier in this chapter, Parliament extended the franchise through two new laws in a transparent effort to expand the pro-conscription ranks. The Military Voters Act, intended to enfranchise soldiers under the age of 21, inadvertently benefited women as well, so that the Bluebirds—military nurses serving in the war effort—became the first Canadian women to exercise the right to vote in a federal election.\n\nBluebirds at the Ballot Box, 1917 These Canadian military nurses (the \"Bluebirds\"), photographed at a polling station set up at a Canadian field hospital in France in December 1917, were among the first Canadian women to vote in a federal election. William Rider-Rider, Canada Department of National Defence, Library and Archives Canada, PA-002279\n\nThe second law, the Wartime Elections Act, gave the vote to close female relatives of people serving in the armed forces (swelling the electoral lists by some 500,000 names), but it also effectively withdrew the vote from women who would otherwise have had it by virtue of provincial law but did not have a relative in the armed forces. This situation would not be tolerated for long.\n\nThe following year, Borden's re-elected government moved to correct the situation, introducing a bill to provide for universal female suffrage on March 21, 1918. Again, the bill was not universally welcomed. MP Jean-Joseph Denis declared, \"I say that the Holy Scripture, theology, ancient philosophy, Christian philosophy, history, anatomy, physiology, political economy, and feminine psychology all seem to indicate that the place of women in this world is not amid the strife of the political arena, but in her home.\" (Debates, April 11, 1918; 643) Facing strong opposition, Borden compromised by stipulating in the bill that women electors would have to meet the same requirements as men—for example, property requirements where they existed. The compromise worked, and the Act to confer the Electoral Franchise upon Women received royal assent on May 24, 1918. A 1919 law gave women the right to be candidates in federal elections.\n\nWomen's suffrage was \"in the tide,\" as Nellie McClung told Alberta legislators in 1915. The \"fresh wind\" of change felt by McClung would sweep across the land. Women gained the provincial franchise in Nova Scotia in 1918, New Brunswick in 1919, Prince Edward Island in 1922 and Quebec in 1940.\n\nAt the federal level, the Dominion Elections Act of 1920 provided access to the vote without reference to property ownership or gender—age and citizenship remained the only criteria. Provincial control of the federal franchise was now a thing of the past. The general election of 1921 was the first in which nearly all Canadian men and women over the age of 21 could vote. Agnes Macphail won a seat at that election and became the first female member of Parliament."}, {"url": "https://canadaehx.com/2021/08/26/the-elections-1921/", "page_content": "Four years after Canada was nearly torn apart over the 1917 election and the Conscription Crisis, the next election would roll around the bend. For the first time since 1887, the Liberals were not represented by Sir Wilfrid Laurier, who had died in 1919. He was replaced by a new man, William Lyon Mackenzie King. The Conservatives had been led by Sir Robert Borden since 1900, but this election, following his retirement, Arthur Meighen had come in as leader and was now serving as prime minister.\n\nWhile this election would be far less divisive than the previous election, it still had its share of drama.\n\nThe election is notable in the fact that for the first time in Canadian history, neither the Liberals nor Conservatives were the Official Opposition. That role would be filled by a new party that had sprang up in Western Canada, the Progressive Party.\n\nFollowing the war, the Unionist Government would begin to fracture as former Liberals who had supported conscription left that party due to high tariffs on farm products announced in the budget. This group, made up mostly of Western Canada MPs, was led by Thomas Alexander Crerar and they would form into the Progressive Party. Some Liberals would stay with the Conservatives, while others would rejoin the Liberal Party, where they were often seen with suspicion. Arthur Meighen attempted to continue with the Unionist alliance and attempted to rename the Conservatives as the National Liberal and Conservative Party, but this failed. Then, despite still having another year left before an election needed to be called, Meighen called an election. One official would write to him later on the matter, stating quote:\n\n“This fall is the worst possible time you could have chosen for an election.”\n\nOver the previous four years, the war had ended, and the labour movement would begin to rise. In 1919, the Winnipeg General Strike occurred, and it was crushed by the Conservative government, including Meighen, who played a key role in the violent suppression of the strikers. This would hurt him heavily in Manitoba, and among organized labour supporters, for the coming election.\n\nThe three parties would all take different platforms, which appealed to different areas of the country. The Progressives were committed to the removal of protective tariffs, which was a pillar of the Conservative Party since the days of Sir John A. Macdonald. The tariffs were seen as a hinderance to farmers and workers, while only helping the businesses of Ontario and Quebec. The Progressives were okay with a gradual removal, and this was a position that King and the Liberals attached themselves to, in order to sway some Progressive voters over to the Liberals. Meighen was having none of this in the election, choosing to attack the Progressives and labeling them as socialists and a group out to destroy the social order.\n\nIn regard to the removal of tariffs and the dreaded free trade debate that had taken the Liberals out of power in 1911, the Liberal position was, according to the party itself, quote:\n\n“The tariff issue today is not between free trade and protection or between farmers and manufacturers or urban workers. The issue is whether the tariff shall be framed at the dictation of a few great interests or revised in accordance with the will of the people working in stores and offices and factories. Is there to be a real democracy or a sham democracy…It is for the people of Canada to say.”\n\nKing would begin the first of his major campaign tours that he would do for every election until his last in 1945. In a railway car he leased from the CPR, he took two trips, one to the Maritimes and one out to the Canadian West. He would meet with local and regional leaders and made one speech per day. Writing in his diary about these speeches, including those in hockey rinks, he would state, quote:\n\n“At 8 went to meeting in Rideau rink. A cold, cheerless dismal place, spoke with a hat and coat on not to good effect.”\n\nKing and Meighen had known each other since they both attended university together in the 1890s, and both men hated the other. King was no fan of Meighen and would routinely criticize him. Even later in life, when Meighen was attempting to win a seat in a by-election, King did not run a Liberal candidate against him as per custom, but he put resources behind the CCF opponent, who would beat Meighen, ending the man’s political career in the process.\n\nKing would come across Meighen during the campaign tour, and would write quote:\n\n“Went to the train at 2, met Meighen at the station. I was shocked at his appearance and voice. He had hardly any voice left and has a bad cough. He looks to me to be in the advanced stage of tuberculosis. I should not be surprised to see a complete collapse any moment and I shall be surprised if he finished out the campaign. He looks to me done.”\n\nMeighen was seen as stiff and lawyer-like, which did not appeal to the people of the west. The literature given out by the Conservatives was also dry and written in a lawyer manner, and many speculated that Meighen had written the pieces himself.\n\nMeighen was noted for being one of the best orators in the history of the House of Commons, who could easily debate with King and was known for his razor-sharp tongue. During the two-month election campaign, it was estimated that Meighen had made 250 speeches. Despite his skill with speeches, he was not able to convince those in the west of the importance of having protective tariffs. Meighen would receive a telegram from an official in Manitoba that showed the lost cause the west was to the Conservatives, which stated quote:\n\n“I do not know how close you are in touch with Western conditions at the present time, but it seems to me that the election will be won or lost East of the Great Lakes. I do not think you can count on many seats West of there.”\n\nThis election was the first in which the majority of Canadian women could vote, and it would be the first in which women ran for public office. The Conservatives did not waste an opportunity to remind women voters that it was their party that gave women the vote. The Liberals countered that they would have done the same if they were in power at the time, adding that several Liberal provincial governments gave women the vote.\n\nConservative literature touted that it was a woman’s role to keep the traditional society together. The literature stated quote:\n\n“It may well be that the future of the entire race is to be henceforth in women’s hand. If this be so, then there is one thing that the woman voter cannot escape, her responsibility.”\n\nThe Liberals would also court the female vote, and in its pamphlet Women and Politics, it stated quote:\n\n“Every woman will, on that day, determine by her vote what Party or set of men will administer the government of Canada for the next five years. Women are more concerned with the home life of the nation than any other interest. The real question therefore for them are, how can a political party affect the home, the cost of living?”\n\nThe Dominion Elections Act would be passed in 1920 would allow women to run for Parliament, but Indigenous or Asian women were denied this right. The Act also created the Office of the Chief Electoral Officer, and Oliver Biggar, a former army colonel, was chosen as the first person to occupy this position. The chief electoral officer was a deputy minister and the individual’s job were to preside over the election and prepare a report after each election. Biggar would have a massive job ahead of him. He would have 75,000 brand new election officials who supervised the process, which now included women who could now vote, doubling the number of eligible voters in the country.\n\nMany newspapers would turn against the Conservatives in the election, including some that had supported Conservatives in the past. The Gazette would state in a headline, quote:\n\n“Quebec will not have Mr. Meighen”\n\nThe Toronto Star would criticize Meighen for appearing to side with the United States during his brief time as prime minister, rather than the British Empire, stating quote:\n\n“The Prime Minister had a chance to show that a Conservative leader regards it as a duty and a privilege to co-operate with the British Empire in policies which its responsible officials think essential to Imperial safety.”\n\nIn the election, the Liberals came back into power for the first time in a decade, winning 118 seats, the exact amount needed for a majority government. The Progressive Party became the Official Opposition, finishing with 58 seats, while the Conservatives had the worst collapse in Canadian history to that point, falling 104 seats to 49. Even Meighen would lose his seat in Portage la Prairie. Mirroring the collapse of the Liberals 10 years earlier, eight Conservative cabinet ministers lost their seats. Meighen would win his seat in a by-election after the election.\n\nThe Montreal Gazette would write, quote:\n\n“The verdict is decisive. It has been a good fight on the part of the Prime Minister, but a feeble one on the part of his party. A lack of touch between ministers and members on the one hand, and the electorate on the other, has chilled the ardor of the old time Conservatives.”\n\nThe Toronto Mail and Empire would put blame on Quebec for the Conservative loss, stemming from the Conscription Crisis four years earlier. It stated quote:\n\n“Quebec went to the polls yesterday in a frame of mind that was far from judicial, but not farther than at any other time since the beginning of the war. Its people were determined to punish the men in office who had placed on the statute books and enforced the Military Services Act for the purpose of enforcing our defenders at the front.”\n\nEchoing the division created by the conscription crisis, the Liberals won every single seat, 65 in total, in Quebec, as well as all 16 seats in Nova Scotia. Overall, the Liberals carried most of the Maritimes.\n\nThe Conservatives found their strongest support in Ontario, where they won 36 seats, while the Progressive and Liberal Parties won 20 and 21 seats respectively. In the west, the Progressive Party won all eight seats in Alberta, 15 of 16 in Saskatchewan and 11 of 14 in Manitoba. The Conservatives won no seats in the Prairie Provinces.\n\nEven though we were now getting into the modern era of elections, there were still people who were trying to influence the election.\n\nIn Montreal, 15 men were arrested the morning of the election on the charge of being prospective election telegraphers. In their pockets were numerous cards bearing the names of electors. Another five men were arrested as they prepared to telegraph votes. All the men had cards bearing names other than their own. In all, the 20 men had 35 cards that would have allowed them to complete fraudulent votes. The phrase telegrapher at the time meant someone who impersonates a voter.\n\nBets still continued on election results, with large sums being put down, some as high as $10,000, or $146,000 today, at even money.\n\nOn the day he would win the election, King would write in his diary, quote:\n\n“Reached Ottawa at 7 a.m., polled my vote a few minutes after 8. Came to my rooms, oh so glad to see them again, all so peaceful and quiet there knelt in prayer before dear Mother’s picture and thanked God for his protecting providence through all.”\n\nHe would continue, looking at his prospects in the election, stating quote:\n\n“Win or lose, I feel I have fought a good fight, run a good course and kept the faith and I shall be happy and contented whatever the outcome.”\n\nLater in the night, upon winning the election, he would write in his diary, quote:\n\n“I am glad our Party has won. It is a great victory, but my thoughts are mostly of the dear ones gone before and of the work ahead.”\n\nIn his statement to the press, King would highlight that the election result showed that many Canadians agreed with him in his criticism of the Conservative government. He would write, quote:\n\n“The people of Canada, have shown by their overwhelming defeat of the Meighen Administration that they realized the truth of the charges of autocracy and usurpation which I have been making against the Meighen government since the Right Honourable Mr. Meighen took control of the country…The fact that three provinces, Quebec, Nova Scotia and Prince Edward Island, have voted solidly for Liberals is in itself evidence that the Liberal policy has appealed not only to one class or group or race but to all classes.”\n\nAmong the five women who ran for public office, Agnes Macphail of the Progressive Party was elected in this election, becoming the first woman MP in Canadian history. She would remain in the House of Commons until 1940. From 1921 to 1935, she was the only woman in the House of Commons, until Martha Black was elected in 1935.\n\nUpon her election, she would state, quote:\n\n“I shall never forget that I do, in a measure, represent all women of Canada and what I do will strengthen or weaken their cause. My chief aspiration is to be in Ottawa just what I am here. I want really to represent the people, who are sending me, and of whom I am one.”\n\nEarlier in this episode, I stated that the Progressive Party was the official opposition. While they technically were, the party refused the role of Official Opposition, which then fell to the Conservatives, making Meighen the Leader of the Official Opposition.\n\nChief Electoral Officer Mowat would prepare his report after the election, citing difficulties for electors, mostly women, who had been left off voter lists. In his report, he asked that more revision officers be appointed, and advance polls also be established. Parliament would respond to this by reducing the number of voters needed for setting up an advance poll from 50 to 15.\n\nWhile the Liberals won 118 seats, on the line for a majority, resignations would turn his majority in a minority. The Liberals would lose two by-elections but then gain two seats back when two Progressive MPs crossed the floor. By Nov. 25, 1924, until the 1925 election, the Liberals held a two-seat majority in the House of Commons.\n\nKing worked with several Progressive MPs in order to pass legislation throughout the next four years, preventing his government from falling until a confused vote brought it down in 1925 but more on that in the next episode.\n\nInformation from Elections Canada, Wikipedia, Library and Archives, Meighen and the Montreal Tycoons, Dynasties and Interludes, Ottawa Journal,\n\nShare this Facebook Twitter Reddit\n\nLiked it? Take a second to support CraigBaird on Patreon!\n\nShare this: Twitter\n\nFacebook\n\n"}, {"url": "https://canadaehx.com/2021/08/27/the-elections-1925-1926/", "page_content": "For the past 58 years, Canada generally had several years between elections. The shortest time period was between 1872 and 1874 but then 1925 and 1926 came along.\n\nWhy did these elections come so quickly after each other? Well, it all came down to a minority government, a decision by a Governor General, and some crafty political maneuvering.\n\nFor the past four years, the Liberal government of William Lyon Mackenzie King had held onto through an alliance with the Progressives, due to its slim majority. The Conservatives had fallen to third in the 1921 election, but were the Official Opposition after the Progressives turned down the role.\n\nThe next election was not scheduled until December of 1926, but all of that would change when a budget vote was voted down in Parliament in September of 1925. King was not expecting this turn of events, but it would trigger the election one year early.\n\nThe previous four years had been boom years for Canada. There was elation in the decade following the First World War as the Jazz Age began. Not all Canadians enjoyed the good times, with many labourers and farmers dealing with tough times.\n\nAs was the case in 1921, Arthur Meighen and the Conservatives pushed a high tariff policy that was supported by the manufacturing firms of Ontario and Quebec. King, taking a line from the Progressives to court their voters, supported reduced tariffs accomplished over time. Progressives, who represented the Canadian West for the most part, wanted little to no tariffs to help labourers and farmers.\n\nIn the leadup to the election, King promised low tariffs and good relations between English and French Canada, which was a major issue at the time, almost a decade after the Conscription Crisis.\n\nDuring the four years leading up to 1925, Meighen had not sat around doing nothing. He had focused on rebuilding the Conservative Party, which had been decimated in the 1921 election. He especially focused on rebuilding in Quebec, while also focusing on the Maritimes and Ontario. Due to his belief that high tariffs were good for the country, he knew that he had essentially lost the Canadian West before the election was even held.\n\nOn election day, it was expected that it would be the largest amount of voters going to the polls in Canadian history. In places such as Victoria, cars were being loaned to electors to help get people out to vote. Even Premier Oliver loaned his car to party workers after he voted early in the morning. There was also betting that the Liberals would take the election.\n\nIn the election on Oct. 29, 1925, the Conservatives bounced back with a gain of 66 seats to finish with 115, eight short of a majority. This made Arthur Meighen prime minister once again, a role he had from 1920 to 1921. Sorry, I should correct, that, it made him Prime Minister, technically. What do I mean? I will get to that.\n\nKing and the Liberals lost 18 seats to finish with 100, while the Progressives collapsed and lost 36 seats to finish with 22. The Conservatives took the majority of seats in British Columbia, Manitoba, New Brunswick and Nova Scotia. In Ontario, they had 67 seats to the 12 won by the Liberals. The Liberals again ruled Quebec, finishing with 59 seats to the Conservatives four, an improvement considering the Conservatives won zero seats in 1921.\n\nInterestingly, King would write in his diary in the morning of the election and he would predict that his party would gain 59 in Quebec, although he was wrong in his belief he would take half of the votes in the Maritimes. He would write, quote:\n\n“I believe we will have a majority over all of 10 to 15 and with the Progressives a majority of 40 to 50. W should hope we will have in round numbers a majority as good as Liberal of 25 overall…whatever the outcome, I shall regard it as all for the best and shall not murmur in the least, nor rejoice over much.”\n\nKing had lost in his own riding and would write, quote:\n\n“There was just a little feeling of regret at losing a riding and having to face another contest, a little feeling too of relief at not having to keep on nursing a constituency. I find that the greatest anxiety. I shall get a seat somewhere.”\n\nUpon receiving the full election result, King would blame the defeat on money from the big interests who were seeking further protection and a lack of organization on the part of the Liberals. He would write, quote:\n\n“It looks like a heavy road ahead, but the Progressives may come in with us, a few will be foolish enough not to, then if he wins in the House of Commons, it looks like another election or great uncertainty again for awhile.”\n\nThe Windsor Star in bold lettering stated, quote:\n\n“King may keep office. Denies his mind is made up to resign as a result of the vote.”\n\nKing had told the Canadian Press, quote:\n\n“When all the returns are in, I intend to discuss the situation with the Governor General and I shall then make a statement on my intentions.”\n\nKing had met with Byng on Oct. 30, the day after the election, and King would write that Byng said to him, quote:\n\n“There are three alternatives as I see it. The first is dissolution, that I hope you will not ask for, that I would not wish to grant at this stage, the people do not want another election immediately. The next is that Mr. Meighen, having the largest solid group should be called on and the third that you should continue. I shall of course agree to whatever you say as to the last two, but Mr. King, as a friend of yours, may I say that I hope you will consider very carefully the wisdom of the second course.”\n\nThe issue was that despite having fewer seats than the Conservatives, King was able to hold onto power by forming a coalition with the Progressives, who aligned closely with the Liberals and this allowed King to form a minority government. This may seem surprising but as the sitting prime minister, King was able to do this.\n\nMeighen of course was fuming over this turn of events, and he demanded that King resign as prime minister. Governor General Lord Byng agreed that the Conservatives should form the government but despite his objections, there was no valid reason to dismiss King from power.\n\nKing then ran in a by-election in Prince Albert and was elected.\n\nWhile King spoke to the press and helped to guide the public narrative, Meighen stayed relatively silent on the whole matter in public. It would not be until Nov. 5, a week after the election that Meighen would speak. He had been waiting until he knew what King was going to do in regards to staying on in power. Meighen would state, quote:\n\n“The premier’s statement stripped of its sophistry is merely an announcement of his determination to hang on in defiance of a heavily adverse verdict from the people of Canada…Mr. King is now merely the leader of a minority group. There has never been a case in Canada and none for a third of a century in Britain, where the leader of a minority group has waited for the calling of Parliament, or has refused to resign immediately once the will of the people was known.”\n\nKing would look at the path ahead and state in his diary that he felt it was the right thing to do. He would write, quote:\n\n“Regard all power as a trust in the fullest sense. I have had great comfort and help from the spiritual influences about me.”\n\nAs can be expected, this government did not last long and a scandal rocked the government. For a time, King kept the Progressives on his side through the promise of supporting the establishment of Old Age Pensions.\n\nIn the customs department, it was found not only were leading members of the department conducting illicit trade. At the time Jacques Bureau was the Minister of Customs and Excise. King had seen the danger of this affair for his government and he had Bureau resign in September 1925, before the last election, and take a position in the Senate. King would write in his diary, one month earlier, quote:\n\n“Bureau I was saddened and shocked to hear is on another drunken spree. Poor fellow. He is killing himself rapidly, cannot overcome his condition.”\n\nTwo days later, King would write again of Bureau, stating quote:\n\n“Outrageous and disgraceful the manner in which Customs Dept. being run.”\n\nWhen the scandal broke after Conservative MP Henry Stevens had the House pass a motion to create a special committee to investigate the customs department, it was found that Bureau shielded individuals and also benefitted personally through receiving contraband liquor, while his chauffeur received a smuggled vehicle.\n\nKing knew that a vote of censure was coming, so he asked the Governor General to call an election in the hopes of forming government again without the need for a coalition. Instead, Lord Byng refused this request. King would write, quote:\n\n“It was clear from the moment I began to speak that His Excellency’s mind was completely made up and that he did not wish even to argue the constitutional aspect, but to stand in the position already taken.”\n\nOn June 28, 1926, King resigned. The entry in his diary states in simple tone, quote:\n\n“Resigned as Prime Minister of Canada today.”\n\nRather than be crushed by his resignation, King would write quote:\n\n“I feel relief beyond all words in being free of office with a sense of right in every step of the procedure.”\n\nHe would speak in the House of Commons on the day of his resignation, stating quote:\n\n“His Excellency, having declined to accept my advice on the subject of dissolution, to which I believed under British practice I was entitled, I have tendered my resignation, which His Excellency has agreed to accept.”\n\nUpon giving his resignation, King moved the House to adjournment, which Meighen protested should not be allowed and that he should say something as well. Meighen then said that there should be a conference between himself and the prime minister, to which King responded, quote:\n\n“There is no prime minister.”\n\nMeighen was then asked by Byng to form a government.\n\nAt the time, an MP who was appointed to a cabinet post would resign their seat and then seek re-election in a by-election. Meighen did not do this because it would result in several ministers not being in the House of Commons during critical votes when his government was already shaky as it were. He gave up his own seat to become prime minister but he named several men as acting ministers, or ministers without a portfolio, so they did not have to resign. King would argue this was against government policy and the ministers had to resign, then be elected in a by-election. If they did not do so, they would have no right to govern.\n\nA representative for Meighen stated, quote:\n\n“Having in mind the fact that the present session has now continued almost six months and is very near to close, Mr. Meighen believed it to be the first duty of any government he might form to conclude with all dispatch the work of the present session.”\n\nKing was an incredibly smart person when it came to political maneuvering and he would go on the attack, stating that Lord Byng was an official of a foreign power who was interfering with Canadian politics.\n\nThe Meighen government made it through four Parliamentary votes, but they lost on the fifth vote by only one vote.\n\nKing then brought the Progressives to his side and within three days, they had brought down the government in a vote of confidence. With that, Meighen gained the distinction of having the shortest lived government in Canadian history and Lord Byng called an election.\n\nKing would campaign on the message of the Conservatives being corrupt. He also ran on the platform of the constitutional issue, citing interference by the governor general in Canadian affairs. On July 2, 1926, he would write quote:\n\n“I could not believe Byng would deliver himself so completely into my hands.”\n\nKing was smart enough as a politician to know that attacking Byng directly would upset some people in Canada, due to the ties to the Royal Family. He portrayed Meighen as governing illegally. This tactic was spurred on by nationalist feelings in Canada, helping King gain traction.\n\nMeighen, possibly believing that his high tariff talk had helped win the election for him previously, continued on the high tariff platform, while also attacking the Liberals, stating they were corrupt.\n\nIn the Sept. 14, 1926 election, King and the Liberals regained power, with 116 seats, while the Conservatives fell by 24 seats to 91. The Progressives lost another 11 seats, and the United Farmers of Alberta gained nine seats to tie the Progressives with 11 seats total. Meighen would lose his seat in the election and promptly resigned as leader of the Conservative Party.\n\nThe day after winning the election, King would visit the tomb of Sir Wilfrid Laurier and Lady Laurier, where he was joined by the Speaker of the Commons in a private visit, so he could lay a wreath of bay leaves.\n\nTo hold onto power, which he would for four years despite a minority government, King formed an alliance with the Progressives again.\n\nThis election was also notable in that the Liberals agreed to not run candidates in all ridings due to their alliance with the Progressives. This created the unique situation where the Conservatives picked up 40 per cent of the vote in Manitoba, twice what any other party had, but had no seats elected.\n\nThe Liberals once again decimated the Conservatives in Quebec, with 59 seats to their four seats. In Saskatchewan, as well as the aforementioned Manitoba, the Conservatives won no seats. The Conservatives took the balance of seats in British Columbia, New Brunswick, Ontario and Nova Scotia.\n\nThe entire affair, known as the King-Byng Affair, would be brought up at the 1926 Imperial Conference, and at the 1929 Conference on the Operation of Dominion Legislation and the 1930 Imperial Conference. It would eventually result in the Statute of Westminster, which was passed on Dec. 11, 1931. This Statute clarified Dominion parliaments and gave them full legal freedom except in an area where they chose to be subordinate to England. From this point on, the Governor General would follow the advice of the Prime Minister of Canada, not the British Parliament.\n\nByng would say of the whole affair upon his return to England, quote:\n\n“I have to await the verdict of history to prove my having adopted a wrong course, and this I do with an easy conscience that, right or wrong, I have acted in the interests of Canada and implicated no one else in my decision.”\n\nInformation from Canadian Encyclopedia, Wikipedia, Dynasties and Interludes, Biographi, Library and Archives Canada, Victoria Daily Times,\n\nShare this Facebook Twitter Reddit\n\nLiked it? Take a second to support CraigBaird on Patreon!\n\nShare this: Twitter\n\nFacebook\n\n"}, {"url": "https://dictionary.sensagent.com/Alberta%20general%20election,%201921/en-en/", "page_content": "The Alberta general election of 1921 was the fifth general election for the Province of Alberta, Canada. It was held on July 18, 1921 to elect members to the 5th Alberta Legislative Assembly.\n\nThe Liberal Party of Charles Stewart, which had governed the province since its creation in 1905, was defeated by a surging United Farmers of Alberta, an agricultural lobby organization that was contesting its first general election. The UFA was led by president, Henry Wise Wood, who declined to take the leadership of the government and become Premier. The UFA's third choice, its vice president, Herbert Greenfield, agreed to do so, and sought election to the legislature in a by-election.\n\nIn an attempt at proportional voting, each voter in Edmonton and Calgary could choose up to five candidates, while Medicine Hat voters could choose two candidates. All other districts remained one person - one vote. The United Farmers swept most of the rural area while its opposition hung onto seats within the cities. No party ran a full slate of candidates.\n\nThe campaign\n\nLiberals\n\nThe Liberals which had governed the province since 1905 were led into the election by their third Premier and leader Charles Stewart.\n\nAGT Scandal\n\nThe Alberta Government Telephones scandal had broke before the election. It was learned that the Liberals spent money to have telephone polls created and shipped in big stacks to remote communities in which they had no intention of installing phone lines in an effort to garner support and votes.\n\nUnited Farmers\n\nHerbert Greenfield's Premier portrait\n\nThe United Farmers of Alberta under the leadership of President Henry Wise Wood was contesting its first general election. The party had come into being after the organization had decided to no longer be content with being a lobby group (and farmer supply co-operative). They merged with the Non-Partisan League of Alberta who had formed before the 1917 general election and had elected a couple members. The Non-Partisan League activists were significant within the political machinery of the United Farmers.\n\nThe merged party experienced a significant amount of growth in the run up to the general election. It won its first by-election with the election of candidate Alexander Moore in the electoral district of Cochrane in 1919 and achieved a coup when Conservative leader George Hoadley crossed the floor. The Non-Partisan League MLA's despite not changing their affiliation caucused with the United Farmers.\n\nWise Wood knew well before the election was over that his party was going to form government. In a famous speech he gave at Medicine Hat on July 8, 1921 he was quoted as saying \"Farmers may not be ready to take over government, but they are going to do it anyway\". He also said in that speech that he only wanted his 20 best candidates to go to Edmonton to form the opposition, but knew there would be a lot more elected.[1]\n\nSplit in the Labour forces\n\nThe campaign was contested by two provincial labour parties: a main party named the Dominion Labor and a splinter group in Edmonton named Independent Labor.\n\nDominion Labor ran candidates in primarily urban riding's such as Calgary, Edmonton, Lethbridge and Medicine Hat. Its President Holmes Jowatt decided to help his candidates get elected, declining to seek office himself.\n\nAt the beginning of the election Independent Labor offered to nominate Edmonton area candidates at a joint convention to prevent the splitting of the labour vote and use the co-operation to eventually unite the parties. The Dominion Labor declined the offer stating that to do so would divide its own ticket. Among its candidates was pioneer photographer Ernest Brown.[2]\n\nConservatives\n\nThe Conservative Party which has been the primary opposition in the province since it was created in 1905 had seen a split in the ranks under the leadership of George Hoadley. The caucus divided into two separate Conservative caucuses. Hoadley left the Conservative party sitting as an Independent and than won the United Farmers nomination in Okotoks and crossed the floor. The party replaced Hoadley by selecting Albert Ewing an Edmonton area Member of the Legislative Assembly as leader.\n\nThe Conservatives spent the campaign criticizing the wasteful and extravagant spending of the Liberal government. They also reminded Alberta voters of the Alberta Government Telephones, telephone pole scandal. The Conservatives campaign for reforms to the provincial tax code as well as pressing for provincial resource rights and voter list reforms in the election act.[3]\n\nDespite the split in the party the Conservative campaign attracted some high profile support. Former Liberal Premier Alexander Rutherford a big supporter of Ewing, led the campaign for the five Conservative candidates contesting for seats in Edmonton.[4]\n\nThe Conservative party was a long time recovering from the split in the party. Supporters of Hoadley and their rural base migrated to the United Farmers. The change of amalgamating the districts in Calgary and Edmonton to a block vote did not help Conservative candidates. In Edmonton the strong Liberal block dominated and all five seats were captured by liberal candidates. The only Conservative to return was Lethbridge MLA John Stewart. Albert Ewing went down to defeat in Edmonton.\n\nSocialist\n\nThe Socialist Party of Alberta which had been in decline since its leader got defeated in the 1913 general election fielded two candidates. It was opposed to both the Dominion Labor and Independent Labor parties.\n\nCalgary, Edmonton and Medicine Hat\n\nThe Liberals, in fact, won a larger share of the votes cast than the UFA (about 34%, compared to 29% for the UFA). The popular vote numbers do not represent the actual number of voters however as urban voters in Calgary and Edmonton were allowed to place five votes and Medicine Hat voters 2 votes, as the districts contained 5 and 2 seats respectively, while rural voters in other constituencies only had 1 vote under the first past the post electoral system. The United Farmers did not run in Calgary and only had a single candidate in Edmonton, thus it did not benefit from the higher weighted city vote.\n\nThe Aftermath\n\nThe result of the election radically and forever altered the political landscape of the province. The United Farmers walked away with a majority government while the Liberals formed opposition with MLAs in the cities of Calgary and Edmonton and some northern strongholds.\n\nPresident Henry Wise Wood was voted to lead the government as Premier unanimously from the 38 MLAs who attended the first United Farmers caucus meeting. Wood declined becoming Premier because he was more interested in operating the machinery of the United Farmers movement rather than crafting government policy. He felt that based on the past farmers movements in electoral politics had risen to power and destroyed themselves to quickly. He wanted to remain focused on the movement.[5] The United Farmers caucus later chose Herbert Greenfield, who also had not run in the election, to become Premier.\n\nResults\n\nMembers elected\n\nReferences"}, {"url": "https://globalnews.ca/news/9633315/live-alberta-election-results-2023-vote/", "page_content": "The 2023 Alberta election has been decided and Global News has all of the results in the map and features on this page.\n\nWho won your riding? Danielle Smith and Rachel Notley both won their respective ridings handily, but many other races came down to the wire. The map above allows you to navigate every provincial riding and see the full results.\n\nGlobal News compiled the campaign promises of both the UCP and NDP, and fact-checked dubious claims that emerged in the weeks leading up to election day.\n\nThe tool below shows how much of the popular vote the UCP, NDP and all other parties secured and how that has changed since 2019, when the UCP was victorious, claiming 54 per cent of the popular vote.\n\nThe UCP ousted the NDP in dramatic fashion in that election, claiming 63 seats in the legislature to the NDP’s 24, placing Jason Kenney as premier after a single term of Notley leading the province.\n\nBelow, you can review the closest races as well as the ridings where the incumbent was not re-elected.\n\nFollowing the completion of vote tabulation, Global News has projected the UCP won 49 of the 87 seats, compared to 38 for the NDP.\n\nSmith previously announced that, should the UCP candidate in Lacombe-Ponoka prove victorious, she would not be welcome in the caucus and would sit as an independent. Global News has projected that Jennifer Johnson did win the riding."}, {"url": "https://www.wikiwand.com/en/1926_Alberta_general_election", "page_content": "The 1926 Alberta general election was held on June 28, 1926, to elect members of the Legislative Assembly of Alberta. The United Farmers of Alberta government that had first been elected in 1921 was re-elected, taking a majority of the seats in the Alberta Legislature. Herbert Greenfield had resigned as United Farmers leader and premier, and John E. Brownlee led the UFA to this second election victory, increasing the UFA's number of seats.\n\nThe writs of election were issued on May 10, 1926, allowing an election period of 40 days.\n\n1926 was Alberta's first general election where Single transferable voting (STV) was used in the three largest cities and Instant-runoff voting was used everywhere else.A Report on Alberta Elections 1905-1982\n\nCalgary, Edmonton and Medicine Hat continued to be multi member districts. Edmonton elected five members; Calgary elected five members; and Medicine Hat elected two. Previously they had elected members by Plurality block voting. Now they elected members using STV-PR, which at the time was called the Hare Proportional representation system.A Report on Alberta Elections 1905-1982\n\nOutside the large cities, districts were single member districts and MLAs were elected under Alternative Voting system. Rural voters, like their city counterparts, cast preferential ballots and had ability to rank the candidates. The seat was filled by the candidate who received a majority of the votes whether through first-choice votes or a combination of first-choice votes and votes transferred from less-popular candidates.[2] This was the first election in Canada (and in North America) where all the members were elected through non-plurality voting systems.\n\nThis dual system of voting would last until 1956. Medicine Hat after 1926 changed to a single-member constituency, whose MLA was elected through Alternative Voting.\n\nUnder STV in Edmonton, the UFA captured one seat in Edmonton where it had taken no seats in 1921 under the Liberal government's Block Voting system. The Labour party also for the first time elected an MLA in Edmonton. As well, Edmonton voters elected a Liberal and two Conservatives. This mixed crop of representatives was much better balanced than the single-party sweeps that Edmonton had previously elected through other electoral systems.\n\nThe UFA also took a great share of the rural seats, taking 42 of the province's 49 rural seats. It took four rural seats that had been captured by Liberal candidates in 1921 (Beaver River, Leduc, Sedgewick and Whitford), and one that had been won by an Independent in 1921 (Claresholm). The UFA also won the district of Empress formerly known as Redcliffe, which had been won by the UFA in 1921. No UFA candidate ran for re-election to its seat in Medicine Hat. It gained a seat in the newly created next-door Cypress district. It also lost its St. Albert seat.\n\nThe UFA derived no benefit from Alternative Voting - it would have won all but one of the seats it won under Alternative Voting if the contest had been conducted using Plurality voting. And it lost one seat that it would have won if the contest had been held using Plurality voting (in Bow Valley).\n\nConservatives, being a less popular party, had been badly treated under FPTP and Block Voting in 1921 but now did better. It won two seats each in Edmonton and Calgary, where Block Voting had been replaced by STV.\n\nAt the time of the election call, six seats were sitting vacant. They had been vacated by MLAs who had run in the 1925 federal election. MLA C.W. Cross was elected in the federal election. William McCartney Davidson, Calgary Independent MLA, was another one of those who had left. [3]\n\nThe UFA vote share went up 10 percent in this election compared to 1921. This shows effect of the change in voting system - the UFA actually received 15,000 fewer votes in 1926 than in 1921. The Liberals received 54,000 fewer. The change in percentage of UFA support is likely more a result of urban voters not being allowed to cast multiple voters as they had done in 1921. That had artificially raised the Liberal vote count and percentage and had lowered the UFA percentage recorded for the 1921 election.\n\nIn 1926 the UFA vote count outside the cities was 69,000, having gone down from the 81,000 the party's candidates had received outside the cities in 1921. The UFA's vote total was about 50 percent of the first-preference votes cast outside the cities. Through transfers it received a majority of votes in each of the 42 districts where its candidate won.[4]\n\nUnder STV Edmonton elected a mixed bag of representatives. UFA, Liberal, Conservative and Labour MLAs were all elected, which compared well with the total sweep that Liberals made in 1921 under Block Voting.\n\nIn Calgary Conservative supporters found representation under STV where they had been shut out under Block Voting in 1921.\n\nUnder STV in Medicine Hat, a Liberal and a Conservative took the city's two seats - which was fair as the two parties had about equal support there.\n\nUnder Alternative Voting outside the cities, if no candidate took a majority of votes in the first count, votes were transferred until a candidate acceptable to a majority of the voters was determined. In Bow Valley the UFA candidate leading in the first count did not have as much support from Conservative supporters and a Liberal took the seat.\n\nIn four districts only two candidates ran so vote transfers were not needed. Three-way contests would be a feature of most elections from here on in, as Canada had passed the point when only two parties dominated politics. Labour and farmer parties were here to stay to fight it out against the two old-line parties.\n\nIn fifteen of the province's 49 rural districts, three or more candidates ran and vote-splitting meant no one candidate took a majority of the votes on the first count. A UFA candidate was in the top spot in most of these contests. Liberal and Conservative party supporters were split on whether to support the other old-line party or the UFA, if their candidate was eliminated and their ballots able to be transferred to another. In many cases many Conservative and Liberal back-up preferences were marked for the UFA candidate, and in eight of those 15 districts the UFA candidate who had been leading in the first count won the seat, in three the Liberal leading was elected in the end, and in two the Labour candidate was leading and elected in the end.\n\nThe only turn-overs where the candidate leading in the first count was not elected were in Bow Valley and Pincher Creek. In Pincher Creek, back-up preferences on votes at first placed on the Conservative candidate favoured the UFA candidate, who took the seat over the previously-leading Liberal candidate. In Bow Valley, vote transfers from the Conservative candidate went mostly to the Liberal, who passed the UFA candidate in popularity. Overall party-wise the two turn-overs cancelled each other but two different individuals were elected due to the Alternative Voting system than would have been elected under FPTP.\n\nThe UFA's seat majority was due to its victories in the rural areas. Its moral right to power rested on the fact that to be elected in a rural district a candidate had to have support from a majority of a district's voters. The UFA was elected through majority support in 42 of the province's 52 districts, and its candidate in Edmonton was the most popular of all the candidates who ran there as well.[5]"}, {"url": "https://wiki2.org/en/Alberta_general_election,_1921", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nThe 1921 Alberta general election was held on July 18, 1921, to elect members to the 5th Alberta Legislative Assembly. It was one of only five times that Alberta has changed governments.\n\nThe Liberal Party, which had governed the province since its creation in 1905, led by Charles Stewart at the time of the election, was defeated by a very-new United Farmers of Alberta political party. The UFA was an agricultural lobby organization that was contesting its first general election. It had previously elected one MLA in a by-election.\n\nUnder the Block Voting system, each voter in Edmonton and Calgary could vote for up to five candidates, while Medicine Hat voters could vote for up to two candidates. All other districts remained one voter – one vote.\n\nNo party ran a full slate of candidates province-wide. The UFA ran candidates in most of the rural constituencies, and one in Edmonton. The Liberal Party ran candidates in almost all the constituencies. The Conservatives ran a bare dozen candidates, mostly in the cities. Labour mostly avoided running against UFA candidates, by running candidates in the cities and in Rocky Mountain, where it counted on coal miners' votes.\n\nThe United Farmers took most of the rural seats, doing particularly well in the heavily Protestant south of the province. A majority of the votes in the constituencies where the UFA ran candidates went to the UFA.\n\nLabour took five seats, two in Calgary. One Labour MLA was named to the UFA government cabinet, in a sort of coalition government.\n\nThe Liberals took all the seats in Edmonton, due to the block-voting system in use. This multiple-vote system also skewed the vote count.\n\nThe campaign\n\nLiberals\n\nThe Liberal Party, which had governed the province since 1905, were led into the election by its third Premier and leader, Charles Stewart.\n\nAGT scandal\n\nThe Alberta Government Telephones scandal broke before the election. It was learned that the Liberals spent AGT money to have telephone poles crated and shipped in big stacks to remote communities in which they had no intention of installing phone lines in an effort to garner support and votes.\n\nUnited Farmers\n\nHerbert Greenfield's Premier portrait\n\nThe United Farmers of Alberta under the leadership of President Henry Wise Wood was contesting its first general election. The UFA's political wing, as a party, had come into being after the organization had decided to no longer be content with being a lobby group. They merged with the Non-Partisan League of Alberta, which had formed before the 1917 general election and had elected a couple members. The Non-Partisan League activists were significant within the political machinery of the United Farmers.\n\nThe merged party experienced a significant amount of growth in the run up to the general election. It won its first victory with the election of candidate Alexander Moore in the electoral district of Cochrane in 1919 and achieved a coup when Conservative leader George Hoadley crossed the floor. The two Non-Partisan League MLAs, despite not changing their affiliation, caucused with the United Farmers.\n\nWise Wood knew midway through the election campaign that his party was going to form government. In a famous speech he gave in Medicine Hat on July 8, 1921, he was quoted as saying \"Farmers may not be ready to take over government, but they are going to do it anyway\". He also said in that speech that he would have preferred that only his 20 best candidates were elected, to form the opposition, but he said he expected there would be a lot more than that elected.[1]\n\nSplit in the Labour forces\n\nThe campaign was contested by two provincial labour parties: a main party named the Dominion Labor and a splinter group in Edmonton named the Independent Labor Party.\n\nDominion Labor ran candidates in primarily urban ridings such as Calgary, Edmonton, Lethbridge and Medicine Hat. Its President Holmes Jowatt declining to seek office himself, instead devoting his energies help other candidates.\n\nAt the beginning of the election Independent Labor offered to nominate Edmonton area candidates at a joint convention with the DLP, to prevent the splitting of the labour vote and use the co-operative good-will to eventually unite the parties. The Dominion Labor declined the offer stating that to do so would divide its own ticket.\n\nAmong the ILP candidates was pioneer photographer Ernest Brown, soon after to lead meetings of the Communist Party.[2][3]\n\nConservatives\n\nThe Conservative Party which has been the primary opposition in the province since it was created in 1905 had seen a split in the ranks under the leadership of George Hoadley. The caucus divided into two separate Conservative caucuses. Hoadley left the Conservative party sitting as an Independent and then won the United Farmers nomination in Okotoks and crossed the floor. The party replaced Hoadley by selecting Albert Ewing an Edmonton area Member of the Legislative Assembly as leader.\n\nThe Conservatives spent the campaign criticizing the wasteful and extravagant spending of the Liberal government. They also reminded Alberta voters of the Alberta Government Telephones, telephone pole scandal. The Conservatives campaign for reforms to the provincial tax code as well as pressing for provincial resource rights and voter list reforms in the election act.[4]\n\nDespite the split in the party the Conservative campaign attracted some high-profile support. Former Liberal Premier Alexander Rutherford a big supporter of Ewing, led the campaign for the five Conservative candidates contesting for seats in Edmonton.[5]\n\nThe Conservative party was a long time recovering from the split in the party. Supporters of Hoadley and their rural base migrated to the United Farmers. The change of amalgamating the districts in Calgary and Edmonton to a block vote did not help Conservative candidates. In Edmonton the strong Liberal block dominated and all five seats were captured by Liberal candidates. The only Conservative to return was Lethbridge MLA John Stewart. Albert Ewing went down to defeat in Edmonton.\n\nSocialist\n\nThe Socialist Party of Alberta had been in decline since O'Brien lost his seat in the 1913 general election. Two Socialist candidates ran in this election, under the banner Labour Socialist, Frank Williams in Calgary and Marie Mellard in Edmonton. Marie Mellard would join the new Communist Party within the year.\n\nCalgary, Edmonton and Medicine Hat voters cast multiple votes\n\nThe Liberals, in fact, won a larger share of the votes cast than the UFA (about 34%, compared to 29% for the UFA).\n\nThe popular vote numbers exaggerate the actual number of Liberal party supporters however. Urban voters in Calgary and Edmonton were allowed to place five votes and Medicine Hat voters 2 votes, as Edmonton and Calgary contained 5 seats each and Medicine Hat 2 seats, while voters in the other constituencies, most of which were contested by the UFA, only had 1 vote each under the first past the post electoral system. The United Farmers did not run in Calgary and only had a single candidate in Edmonton, thus it did not benefit from the higher weighted city vote.\n\nThis over-representation of big-city voters was so significant that there were more than 120,000 more votes counted than there were voters voting—significant as no single party received more than 102,000 votes. The Liberal Party received 28,000 votes in Edmonton and 20,000 votes in Calgary, almost half of their total across the province, under this system where each big-city Liberal voter could lodge five votes for the party. If you give the Liberal Party only one-fifth of their vote tally in Edmonton and Calgary, the Liberal Party total vote count decreases to well below the UFA total. Now it could be that each voter in Edmonton gave one of his/her votes to the Liberals (but not likely), but even so the Liberal candidates in Edmonton received 8,000 more votes in Edmonton than there were voters who voted. This 8,000 is more than half the difference between the Liberal's and the UFA's tallies province-wide. [6]\n\nAs well, in Calgary 17,000 voters cast about 76,000 votes. As none of these went to UFA candidates (none ran in Calgary) this massive multiple voting going elsewhere gave the UFA a lower proportion overall.\n\nIt was also noted by defenders of the government that the UFA percentage of total seats (62 percent) is identical to the percentage of votes it received in the constituencies in which it did run candidates.\n\nAftermath\n\nThe result of the election radically and forever altered the political landscape of the province. The United Farmers won a majority government, mostly with rural MLAs predominantly from the south of the province, while the Liberals, formerly in power, were moved to the opposition side of the Chamber with MLAs in the cities of Calgary and Edmonton and some northern strongholds. The Liberals have never won power again; the closest they have come since then was winning 39 seats and opposition status in 1993. As well starting in 1921 and lasting until 1971, the Alberta provincial government was not the same as either of the two largest parties in the House of Commons.\n\nThe 38 MLAs who attended the first United Farmers caucus meeting voted unanimously for UFA President Henry Wise Wood to lead the government as Premier. Wood, who had opposed the UFA becoming a political party for fear that political in-fighting would break up the movement, declined becoming Premier because he was more interested in operating the machinery of the United Farmers movement rather than crafting government policy. He said he feared that the UFA would repeat what had happened elsewhere when farmers movements engaged in electoral politics, rose to power and quickly destroyed themselves. He wanted to remain focused on the farmers movement as a non-partisan movement and as an economic group instead of as a political party.[7] The UFA vice-president, Percival Baker, had won his riding with a majority of votes, despite being badly injured in a tree-falling accident and was speculated to have a place in the cabinet. He however died the day after the election.[8] The United Farmers caucus finally chose Herbert Greenfield, who had not run in the election, to become Premier.\n\nResults\n\nPopular vote Liberal 34.07% United Farmers 28.92% Dominion Labor 11.40% Conservative 10.98% Others 14.63%\n\nSeats summary United Farmers 62.30% Liberal 24.59% Dominion Labor 6.56% Conservative 1.64% Others 4.92%\n\nMembers elected\n\n\n\n\n\n10 by-elections were held in the months after the election. Some were held to sit several UFA MLAs and one Labour MLA in the new cabinet. Herbert Greenfield after being chosen to serve as premier ran for a seat in a by-election. John Brownlee after being chosen to serve as a cabinet minister ran for a seat in a by-election. Another was held after a Liberal MLA (Andrew Shandro) was thrown down for taking a seat under suspicious circumstances. All were successful for the UFA (and one Labour).\n\nCalgary\n\nEdmonton\n\nNotes\n\n^ turn-out figure not available because the official Report on Alberta Elections does not give turn-out figure and does not give number of eligible voters in Edmonton and Calgary. Also block voting in those cities confuses strict accounting; as does election of one MLA by acclamation, but in 1926 when about the same number of voters turned out in the cities, the turn-outs there were about 50-60 percent. a b Henry Wise Wood was president of the UFA but did not contest a seat himself. Following the election, he declined to become premier, and the UFA caucus selected Herbert Greenfield instead. ^ Vote count skewed by multiple voting in Calgary, Edmonton, and Medicine Hat. ^ Medicine Hat elected two members to the Legislative Assembly\n\nReferences\n\nFurther reading\n\nHopkins, J. Castell (1922). The Canadian Annual Review of Public Affairs, 1921. Toronto: The Annual Review Company."}]}