{"Carole Gist represented the United States at the Miss Universe 1990 pageant held in Los Angeles, California.": [{"url": "https://www.washingtonpost.com/archive/lifestyle/1990/03/03/detroits-carole-gist-is-miss-usa/6021aefc-c7a7-469f-96be-760d0545d3da/", "page_content": "WICHITA, KAN. -- Miss Michigan, Detroit's Carole Gist, won the Miss USA title last night and will go on to compete in the Miss Universe pageant to be held next month.\n\nGist, 20, a student at Northwood Institute who works for Holiday Inn, said her life's ambition is to establish a performing arts foundation for disadvantaged children.\n\n\"I do believe I have something positive to share with the young people of America, especially young women,\" she said during an interview with the judges before her selection. She said only in America can you achieve your goals if you \"believe in yourself and put God in front of you.\"\n\nThe other semifinalists chosen from the 51 competing at the Century II convention center in Wichita were: first runner-up Gina Tolleson, 20, of Spartanburg, S.C.; second runner-up Karin Hartz, 24, of Voorhees, N.J.; Brenda Leithleiter, 22, Smyrna, Ga.; Tiffany Tenfelde, 22, Lakeside Park, Ky.; and Karin Meyer, 20, Anchorage. and\n\nJudges awarded scores earlier in the week in the gown and swimsuit categories. The other third of the scores used to select 12 quarterfinalists came from personal interviews each contestant had with an 11-judge panel.\n\nJudges for this year's pageant include former Olympian and professional ice skater Robin Cousins, retired astronaut Gordon Cooper, Olympic track star Jackie Joyner-Kersee, music producer Berry Gordy, romance novelist Rebecca Brandewyne and Eileen Fulton, longtime cast member on the soap opera \"As the World Turns.\"\n\nPhotographers covering the pageant picked Miss Mississippi-USA, Stephanie TenEyck, 20, as 1990's most photogenic delegate.\n\nMiss Minnesota-USA, Janet Tveita, 21, was selected by a vote of all of the contestants as the nicest of the women representing all 50 states and the District of Columbia.\n\nThe pageant was founded in 1952 as a promotional event for a swimsuit company."}, {"url": "https://www.blackpast.org/african-american-history/gist-carole-ann-marie-1969/", "page_content": "Carole Anne-Marie Gist, the first African American woman to win the Miss USA title, was born on May 8, 1969 in Detroit, Michigan. Gist, the daughter of Joan Gist and David Turner, is of African American and Cherokee heritage. Her parents divorced when she was a young child. Gist graduated from Cass Technical High School in Detroit in 1987 where she had been an honor student.\n\nGist first won the tile of Miss Michigan USA in 1989 and went on to win the title of Miss USA on March 2, 1990 in Wichita, Kansas. She was the first contestant from Michigan to win the Miss USA (not Miss America) title and she also broke the five year streak of winners from the state of Texas. At 5’11” Gist was also the tallest Miss USA. At the time of her crowning, she was a junior majoring in marketing and management at Northwood University in Midland, Michigan, from which she eventually received her B.A. degree.\n\nWinning the title brought Gist over $200,000 in cash and prizes and automatically earned her the opportunity to represent the United States in the Miss Universe pageant where she placed as first runner up to Miss Norway, Mona Grut.\n\nThroughout her reign as Miss USA, Gist captivated audiences with her stories of being from a single parent home where she had a number of siblings and having to overcome numerous financial and social obstacles. She described the family’s frequent moves in some of the roughest neighborhoods in inner city Detroit and of her homes being frequently burglarized. Gist claimed that money was always scarce in her family and that poverty prevented her from taking dance lessons or learning the piano and violin. Her story contrasted sharply with the middle class backgrounds of most of her competition and of previous Miss USA crown holders.\n\nControversy, however, surrounded Gist’s reign as Miss USA. Her conflicts with pageant officials became well known to the public by 1991. Toward the end of her reign she filed a $20,000,000 lawsuit against the Miss USA Organization for fraud. The lawsuit was eventually dismissed.\n\nFollowing her reign, Gist co-hosted a program on the WORD gospel network. Carol Ann-Marie Gist is currently married with two children. She works for a Detroit area construction company and is a fitness trainer at Wayne State University."}, {"url": "https://www.washingtonpost.com/archive/lifestyle/1990/04/16/norwegian-beauty-wins-miss-universe/183d4166-e7de-4e31-8031-44cc712a19c9/", "page_content": "LOS ANGELES -- Miss Norway, a beautiful woman from a town called Hell, won the Miss Universe crown last night. Miss USA and Miss Colombia took runner-up honors.\n\nMona Grudt, affectionately nicknamed the \"beauty queen from Hell\" for the name of her Norwegian hometown, took the top spot over 70 other contestants in the 1990 pageant at the Shubert Theater in Century City.\n\nJudges chose Carole Gist, a 20-year-old student from Detroit representing the United States, as first runner-up and Liseth Mahecha of Colombia second runner-up.\n\nThe contestants, wearing traditional garb of their homelands, opened the pageant by parading in front of a replica of the \"Hollywood\" sign in a production number done to the strains of \"Dancing in the Streets.\"\n\nThe global glamour parade featured a first-ever entry from the Soviet Union and a prize package to the winner worth $220,000. Two non-finalists in this year's pageant hail from the same town in the Soviet Union. Miss USSR Evia Stalbovska and Miss Israel Yvonna Krugliak are from the city of Liepaja on the Baltic Sea.\n\nJudges for the event included a sampling of international entertainment figures spiced with a dash of European royalty. Among them were comedian Steve Allen and his wife, Jayne Meadows; Latin pop singer Chayanne; \"The Killing Fields\" Oscar-winning actor Haing Ngor; \"Dallas\" co-star Howard Keel; and Princess Maria of Bourbon, fourth in line to the Spanish throne.\n\nThe 39th Miss Universe pageant was broadcast live on CBS. Announcer Dick Clark and Entertainment Tonight correspondent Leeza Gibbons were hosts."}, {"url": "https://www.insider.com/pageant-life-challenge-for-black-women-cheslie-kryst-death-2022-2", "page_content": "Former Black beauty queens told Insider that pageant life has long been difficult for Black women.\n\nlife has long been difficult for Black women. Two former contestants said they received hate mail and death threats after their historic wins.\n\nThe challenges Black pageant contestants face are in the spotlight after the death of former Miss USA Cheslie Kryst.\n\nTop editors give you the stories you want — delivered right to your inbox each weekday. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy\n\nWhen Day Gardner — the first Black woman to place as a top ten semi-finalist at the Miss America pageant in 1977 — first told her mother she wanted to get into pageantry, her mom said to expect to be called the N-word.\n\n\"Your mother is right. They're not going to let you win,\" Gardner's father explained in the early 70s, at a time when US beauty contests were \"only won by white girls\" and \"only white girls participated in them.\"\n\n\"He said, 'Everything your mother said is true — now let's go get your gown,' \" Gardner recalled.\n\nLooking back, Gardner, now 66, told Insider, \"It's hard to believe, but everything that they said happened. And that's what I didn't expect.\"\n\n\"There were ongoing racial slurs and a number of death threats,\" she said, adding, \"Those years were the happiest, scariest, most disturbing, most joyous, years in my life.\"\n\nBlack former beauty queens in the US like Gardner say pageant life has long been a challenge for Black women as the pageantry world continues to reel from the recent suicide of 30-year-old former Miss USA Cheslie Kryst.\n\n\"The pageant itself has progressed. All of these pageants have progressed. The problem is that the rest of the world has not,\" Gardner said.\n\nFormer Miss Delaware Day Gardner. Courtesy of Day Gardner\n\nWhen Gardner became the first Black woman to win Miss Delaware in 1976, the odds were stacked against her.\n\n\"I entered the Miss America pageant system way back when it really wasn't cool to be a Black pageant girl,\" she said, noting, \"There was no internet back then, but the backlash was extreme nonetheless.\"\n\nPageant board members \"were so upset\" when Gardner was crowned Miss Delaware.\n\n\"You're not the type of girl that we would want to represent Delaware,\" Gardner said she was told.\n\nGardner recalls reading a stack of mail addressed to her in her Atlantic City hotel room before the 1977 Miss America pageant.\n\nSome letters \"were well-wishers,\" Gardner said. \"And then you got the other ones with the racial slurs.\"\n\nThere was one \"threatening letter\" that warned if Gardner \"dared\" to get in the car and head to the Miss America pageant \"I wouldn't make it to the end.\"\n\n\"It's hard to believe they were talking about killing me because of a pageant,\" she said.\n\nGardner said she only told her parents about the death threats years later.\n\n\"I didn't want them to know that people would not love me, would not want me,\" Gardner told Insider, choking up.\n\nDetroit-native Carole Gist, 52 — who made history in 1990 by becoming the first Black woman ever to win the Miss USA crown — had a similar experience with hate mail.\n\n\"Social media wasn't around when I won, so there were letters sent and there were calls made, but I was shielded from it,\" Gist told Insider. \"I had death threats, they just didn't tell me about it.\"\n\n\"I thought the security was just regular,\" she said.\n\nGist only later found out about the extent of the racist backlash.\n\n\"I just chose to focus on those who were open and I tried to turn a blind eye to the negative people,\" she said. \"I chose not to give them the power to make me operate in fear or be anything other than my authentic self.\"\n\nFormer Miss USA Carole Gist. Ron Galella, Ltd./Ron Galella Collection via Getty Images\n\nThe former Miss Michigan recalled that a man in a crowd once called out a \"racial slur\" as he shouted she was not the \"ideal\" image of beauty.\n\nRacism \"was there,\" said Gist. \"I just chose to not let it get under my skin. And I'm grateful that I didn't have social media, because I don't know how the women after who did could endure if they got it bad.\"\n\nIn an essay last year for Allure, Kryst — who authorities say died by suicide on Sunday — detailed being the target of internet trolls who ridiculed her looks as she got older.\n\n\"Pageant girls are supposed to be model-tall and slender, don bouffant hair, and have a killer walk,\" wrote Kryst, a lawyer and Emmy-nominated TV reporter who won the Miss USA title in 2019.\n\n\"But my five-foot-six frame won with six-pack abs, earned after years of competing in Division I Track and Field, and a head of natural curls in a time when generations of Black women have been taught that being 'too Black' would cost them wins in the boardroom and on pageant stages,\" she said.\n\nKryst, added, \"My challenge of the status quo certainly caught the attention of the trolls, and I can't tell you how many times I have deleted comments on my social media pages that had vomit emojis and insults telling me I wasn't pretty enough to be Miss USA or that my muscular build was actually a 'man body.'\"\n\nGist told Insider that she understands what Kryst was dealing with.\n\n\"I didn't feel comfortable wearing my hair any other way that I had to straighten it,\" she said. \"I love wearing my hair natural. But I only felt like I would be accepted or looked at as glamorous in that arena if I did that to my hair — like I didn't have a choice.\"\n\nFormer Miss USA Cheslie Kryst. John Lamparski/Getty Images\n\nWhen she found out about Kryst's death, Gist, who connected with Kryst at past pageants, said she was in \"disbelief.\"\n\n\"A lot of my sister queens, we've all had our bout of depression after giving up the crown in various ways,\" Gist said, adding, \"I know I went through it.\"\n\nGist said young Black women who are entering the world of pageantry today should \"be you.\"\n\n\"Do you, you know? Just go and represent yourself to the best of your ability,\" she said. \"You don't have to change to be anybody else's standard.\""}, {"url": "https://fashionchandigarh.com/carole-gist-miss-usa-1990/", "page_content": "Carole Gist is an American TV host, Fitness professional, model, and first African American woman to win the Miss USA title. Gist first won the title of Miss Michigan USA and went on to win the Miss USA crown on March 2, 1990, in Wichita, Kansas.\n\nCarole Gist Wiki | Biography | Family\n\nCarole Gist was born on May 8, 1969, in Detroit, Michigan USA and she is 53 years old as of 2022. Carole’s mother Joan Gist is a Business & Educational Consultant in Detroit.\n\nCarole is the proud mother of 2 adult children: Daughter, Tyler, a professional dancer and dance teacher at Legacy Dance Studio, and Son, Keith, degree holder in computer engineering.\n\nAccording to sources Carole’s husband’s name is Doreonne Stramler but there is not much information whether they are divorced or still married.\n\nReal Name Carole Anne-Marie Gist Profession Fitness and Wellness Professional Date of Birth May 8, 1969 Age 53 years old as of 2022 Nationality American Home Town Detroit, Michigan Parents Mother: Joan Gist Husband Doreonne Stramler Children Daughter: Tyler Spencer\n\nSon: Keith Stramler\n\nCarole Gist Early life and Education\n\nCarole’s mother get involved her in modeling when she was 12 years old to help her feel comfortable about her height. With her mother’s guidance, she participated in many Fashion Runway Shows, Mall Shows, etc from the very childhood. Besides modeling her mother also involved her in Dance as her cousin also did dance.\n\nCarole is a graduate of Cass Technical High School in Detroit. When she turned 18, she began doing Auto shows. She got the opportunity of traveling around while doing the auto show circuit.\n\nAt the time of her coronation, she was junior marketing and management major at Northwood University in Midland, Michigan.\n\nCarole additionally holds a Master’s Degree in Kinesiology. In 2020 she earned a second Master’s Degree in Sports Administration from Wayne State University at the age of 51.\n\nCarole’s Journey to First African American Miss USA\n\nOne of Carole’s childhood friends, who was also modeling for Auto shows, noticed Carole’s long height and persona. She encouraged Carole to participate in Miss Michigan Pageant.\n\nIn 1988 her same friend won Miss Michigan Pageant and also became Miss Congeniality in National Level Miss USA competition. Her friend’s performance gave Carole more confidence that she can also win the title of Miss Michigan.\n\nWhen Carole’s friend came back from the Miss USA event she was more convinced that Carole should participate in this. She started encouraging Carole at every Auto show they attend.\n\nIn 1989 finally, Carole applied for Miss Michigan USA and got an eligibility letter to compete in the event but she didn’t go for the event. In 1990 she applied again and this time not only did she applies, she literally become Miss Michigan USA.\n\nCarole got almost three to four months to prepare for the main event of Miss USA. Finally on 2 March 1990, Carole became the first African American and first Michigan to win Miss USA.\n\nCarole was sent by the USA for competing in Miss Universe 1990. She performed very well and was chosen as 1st Runner-up for Miss Universe 1990. Below is the video clip of her winning moments at the Miss USA 1990 event.\n\nCarole’s Carrier after Miss USA and Miss Universe Pageant\n\nAfter winning Miss USA and 1st Runner-up position in Miss Universe, Carole got high recognition in Media. She actively participated in active runway, print, fashion, and fitness modeling. She also worked as a commercial actress, TV hostess, entrepreneur, and Tri-athlete.\n\nTwo to Three years after becoming Miss USA Carole married and gave birth to her daughter. Four years later she gave birth to another child, her son.\n\nNow at the age of 53, Carole is still active in her profession and is a full-time Fitness Trainer and Fitness Professional. She got invitations for promotions and as a guest for various events and beauty pageants. Carole also provide Pageant Training to young girls and help them to become next beauty queen.\n\nCarole Gist Physical Stats\n\nHeight 6 Feet Body Measurements 36-28-36 Eye Color Black Hair Color Black\n\nCarole Gist Social Accounts\n\nFor social media accounts of Carole Gist’s follow the links below\n\nOverview\n\nMany of us are curious to know about our favorite Celebrity’s biography, height, age, family, affairs, and many more things. This article gives you a glimpse into information related to Carole Gist, Miss USA 1990, Age, Net Worth, Husband, Biography and More. We hope you liked the provided information, and let us know if you did."}, {"url": "https://normannorman.com/tag/miss-universe-1990/", "page_content": "25 years ago, Norway captured its first-ever Miss Universe crown courtesy of Mona Grudt (who eventually went on to become a judge in Miss Universe 1994 held here in Manila). Her First Runner-Up then was the tall Carole Marie Gist who is also looking at celebrating her Silver Anniversary as Miss USA. FYI, she is the first African American woman to ever win the national crown.\n\nLet’s now watch their triumph as the last two women standing during the 1990 Miss Universe held at the Shubert Theater in Los Angeles, California.\n\ncourtesy of Vids for Beauty Pageant Lovers"}, {"url": "https://www.carolegist.com/gettoknowcarole", "page_content": "About Carole\n\n“Pageantry allowed me to rise above very difficult circumstances growing up. It gave me something to strive for and be proud of while building my self-esteem. I embrace the fact that my life is not my own and my historic crowning was not simply about me, it has been a gift to others and I am honored to live my life helping others achieve success.”\n\nCarole has been recognized by the media as a Michigan Woman of Excellence (Award honoree). She is consistently acknowledged for her perpetual grace and elegance, a direct result of her early dance, modeling and pageant experience.\n\nShe has not only continued to bring honor to her crown, she has not stopped achieving. Carole is an active runway, print, fashion and fitness model, as well as, a commercial actress, TV hostess, entrepreneur and Tri-athlete.\n\nCarole Gist is the first African-American to be crowned Miss USA and first runner-up to Miss Universe (1990).\n\nCarole speaks to thousands each year about taking daily steps toward success by becoming the best version of themselves—mentally, emotionally, spiritually and physically. She is a model of her message and upcoming auto-biography “Live life with the Grace of a Queen and the Strength of an Achiever.”\n\nCarole continues to make an impact in her community as an active member of her church volunteering and serving in many capacities. She a regular volunteer with various organizations that help: women and children escaping domestic violence; women in recovery re-enter the job market; families in need of housing, transportation and food; collect and distribute food through distribution centers and provide weekly mobile meal distribution.\n\nCarole loves to empower others to be the best they can be, fulfill their destiny purpose and give themselves and the world the best they can to offer—a purpose driven, healed, whole and loving human being.\n\nCarole teaches these principles as a Wellness, Fitness, and Pageant Coach; as an adjunct faculty lecturer; as a Personal Trainer and as Motivational speaker. She shares how to have the Grace of a Queen and the Strength of an Achiever and teaches Principles of Overcoming Obstacles through varied speaking, teaching and motivational talks. Which she will share in an upcoming biography.\n\nCarole is the proud mother of 2 adult children: Tylar, 26, a professional dancer and dance teacher at Legacy Dance Studio and Keith, 22, a junior at Wayne State University, majoring in computer engineering. Carole additionally holds a Master’s Degree in Kinesiology, is working on a second Master’s in Sport Administration (2020), and a future PhD candidate in Exercise and Sport Science and is the Athletics Department's MHRFC Health and Wellness Coordinator for Wayne State University in Detroit, Michigan.\n\nCarole can be reached at CaroleGistUSA90@gmail.com for more information about speaking engagements, pageant coaching, Health and Wellness seminars, and Motivational Fitness facilitator"}, {"url": "https://blackdoctor.org/carole-ann-marie-gist-first-black-miss-america-turns-50/", "page_content": "Carole Anne-Marie Gist made history nearly 30 years ago on stage when she was crowned Miss USA. It was the first time a Black woman had ever won the title and shattered mainstream myths and biases of African American beauty.\n\nGist first won the title of Miss Michigan USA and went on to win the Miss USA crown on March 2, 1990 in Wichita, Kansas. The 1990 pageant had representatives from Georgia (Brenda Leithleiter), Alaska (Karin Elizabeth Meyer), Kentucky (Tiffany Tenfelde), South Carolina (Gina Tolleson) and Karin Hartz of New Jersey making up with Gist the Top 6 finalists.\n\nGist, a 6-foot in Detroit native, 20 years old at the time, eventually became first runner-up to Mona Grudt of Norway in the Miss Universe pageant of that same year. She was also the first contestant from Michigan to win Miss USA, and broke the five-year streak of winners from Texas.\n\nDuring the time of her crowning, Gist was a junior majoring in marketing at Northwood University in Midland, Michigan, from which she received her bachelor’s degree. Gist received over $200,000 in cash in prizes.\n\nYou May Also Like 9 Ways to Protect Yourself from Breathing Wildfire Smoke\n\nThroughout her reign as Miss USA, Gist captivated audiences with her stories of being from a single parent home where she had a number of siblings and having to overcome numerous financial and social obstacles. She described the family’s frequent moves in some of the roughest neighborhoods in inner-city Detroit and of her homes being frequently burglarized.\n\nGist said that money was always scarce in her family and that poverty prevented her from…"}, {"url": "https://en-academic.com/dic.nsf/enwiki/1257025", "page_content": "Carole Anne-Marie Gist (born c. 1970) was the first African American woman to win the Miss USA title. Gist first won the title of Miss Michigan USA and went on to win the Miss USA crown on March 2 1990 in Wichita, Kansas .\n\nThe 1990 pageant had representatives from Georgia ( Brenda Leithleiter ), Alaska ( Karin Elizabeth Meyer ), Kentucky ( Tiffany Tenfelde ), South Carolina ( Gina Tolleson , who as 1st runner-up then went on to represent the country at the Miss World pageant, winning the title) and the Karin Hartz of New Jersey making up with Gist the Top 6 finalists.\n\nGist, a 5'11 3/4\" (182 cm) Detroit native, 20 years old at the time, eventually became first runner-up to Mona Grudt of Norway in the Miss Universe pageant of that same year.\n\nShe was also the first contestant from Michigan to win Miss USA, and broke the five-year streak of winners from Texas .\n\nGist was a graduate of Cass Technical High School in Detroit. At the time of her coronation, she was a junior marketing and management major at Northwood University at Midland, Michigan . At the time of this entry, she is a professional singer based in Midland. She also co-hosts a gospel show for the WORD network."}, {"url": "https://www.wikiwand.com/en/Miss_USA_1990", "page_content": "Miss USA 1990 was the 39th Miss USA pageant, televised live from the Century II Convention Center in Wichita, Kansas on March 2, 1990. At the conclusion of the final competition, Carole Gist of Michigan was crowned by outgoing titleholder Gretchen Polhemus of Texas. Carole became the first African American winner ever and the first woman from Michigan to be crowned as Miss USA, ending the streak of \"Texas Aces\" from 1985.\n\n39th Miss USA pageant\n\nFor the first time, each judge's score was displayed to every audience, adding transparency to the process.\n\nA major format change in 1990 transformed the Miss USA competition for the next decade: the delegates would face an extra round of elimination on finals night: the top six judges' questions.\n\nInstead of reducing the top twelve to the usual final five, the judges would pick an intermediate top six. Those six finalists would answer questions from the judges and the field was reduced to a final three, who would face the traditional final question, adding unpredictability to the competition after five Texan Miss USA winners from GuyRex Associates, which would lose its Miss Texas USA franchise the next year.\n\nThe pageant was hosted by Dick Clark for the second of five times, with color commentary by Leeza Gibbons and Laura Harring, Miss USA 1985.\n\nThis was the first time the pageant was held in Wichita, where it would be staged for the next three years."}], "Carole Gist placed first runner-up to Mona Grudt of Norway at the Miss Universe 1990 pageant.": [{"url": "https://apnews.com/6237ee83767f647a1c1ec467282c88da", "page_content": "LOS ANGELES (AP) _ Miss Norway, a beautiful woman from a town called Hell, won the Miss Universe crown Sunday night in this capital of glitz. Miss USA and Miss Colombia took runner-up honors.\n\nMona Grudt, affectionately nicknamed the ″beauty queen from Hell″ for the name of her Norwegian hometown, took the top spot over 70 other contestants in the 1990 pageant at the Shubert Theater in Century City.\n\nJudges chose Carole Gist, a 20-year-old student from Detroit representing the United States, as first runner-up and Liseth Mahecha of Colombia second runner-up.\n\nMiss Grudt celebrated her 19th birthday on April 6 while preparing for the pageant. A fan of rock singer Bruce Springsteen and actress Meryl Streep, Miss Grudt said she wants to help children in Africa as a pediatric nurse.\n\nThe contestants, wearing traditional garb of their homelands, opened the pageant by parading in front of a replica of the ″Hollywood″ sign in a production number done to the strains of ″Dancing in the Streets.″\n\nThe global glamour parade featured a first-ever entry from the Soviet Union and a prize package to the winner worth $220,000. Announcer Dick Clark and Entertainment Tonight correspondent Leeza Gibbons were hosts.\n\nThe 39th Miss Universe pageant was televised live in the United States by CBS. An estimated 500 million viewers worldwide were expected to tune in and root for their favorites.\n\nLast year’s event was staged in Cancun, Mexico, where Miss Holland Angela Visser became Miss Universe 1989.\n\nTwo non-finalists in this year’s pageant hail from the same town in the Soviet Union. Miss USSR Evia Stalbovska and Miss Israel Yvonna Krugliak are from the city of Liepaja on the Baltic Sea.\n\nLast week, Mayor Tom Bradley and City Council welcomed the event with a proclamation, but feminists criticized the move, calling the pageant sexist.\n\n---\n\nIn a fitting reward for a Tinseltown victory, Miss Universe 1990 has been promised a Hollywood audition for a major studio film. The winner, who travels extensively during her yearlong reign, also gets a $40,000 personal appearance contract.\n\nOther prizes included $66,000 in cash, a luxury Los Angeles apartment for the duration of her reign, a new convertible car, a mink coat and jacket, a gold and diamond watch, and a selection of evening gowns.\n\nThe winner also gets a 100-inch television set, a complete portable video package, cosmetics, clothing and a still camera.\n\nJudges for the black-tie event included a sampling of international entertainment figures spiced with a dash of European royalty.\n\nAmong them were comedian Steve Allen and his wife, Jayne Meadows; Latin pop singer Chayanne; ″The Killing Fields″ Oscar-winning actor Dr. Haing Ngor; ″Dallas″ co-star Howard Keel; and Princess Maria of Bourbon, fourth in line to the Spanish throne.\n\nOther judges were ″Jagged Edge″ producer Martin Ransohoff, Commodores keyboard player J.D. Nicholas, Elle magazine editor Leonora Langley, winemaker Brooks Firestone, costume designer Deborah Nadoolman and psychologist Susan Forward."}, {"url": "https://www.washingtonpost.com/archive/lifestyle/1990/04/16/norwegian-beauty-wins-miss-universe/183d4166-e7de-4e31-8031-44cc712a19c9/", "page_content": "LOS ANGELES -- Miss Norway, a beautiful woman from a town called Hell, won the Miss Universe crown last night. Miss USA and Miss Colombia took runner-up honors.\n\nMona Grudt, affectionately nicknamed the \"beauty queen from Hell\" for the name of her Norwegian hometown, took the top spot over 70 other contestants in the 1990 pageant at the Shubert Theater in Century City.\n\nJudges chose Carole Gist, a 20-year-old student from Detroit representing the United States, as first runner-up and Liseth Mahecha of Colombia second runner-up.\n\nThe contestants, wearing traditional garb of their homelands, opened the pageant by parading in front of a replica of the \"Hollywood\" sign in a production number done to the strains of \"Dancing in the Streets.\"\n\nThe global glamour parade featured a first-ever entry from the Soviet Union and a prize package to the winner worth $220,000. Two non-finalists in this year's pageant hail from the same town in the Soviet Union. Miss USSR Evia Stalbovska and Miss Israel Yvonna Krugliak are from the city of Liepaja on the Baltic Sea.\n\nJudges for the event included a sampling of international entertainment figures spiced with a dash of European royalty. Among them were comedian Steve Allen and his wife, Jayne Meadows; Latin pop singer Chayanne; \"The Killing Fields\" Oscar-winning actor Haing Ngor; \"Dallas\" co-star Howard Keel; and Princess Maria of Bourbon, fourth in line to the Spanish throne.\n\nThe 39th Miss Universe pageant was broadcast live on CBS. Announcer Dick Clark and Entertainment Tonight correspondent Leeza Gibbons were hosts."}, {"url": "https://prabook.com/web/carole.gist/2489482", "page_content": "Mission United States of America; Mission World\n\nThe Mission United States of America beauty pageant has been held annually since 1952 to select the Americans entrant in the Mission Universe pageant.; The Mission World pageant is the oldest surviving major international beauty pageant.\n\nThe Mission United States of America beauty pageant has been held annually since 1952 to select the Americans entrant in the Mission Universe pageant.; The Mission World pageant is the oldest surviving major international beauty pageant."}, {"url": "https://missuniver.yolasite.com/1990.php#!", "page_content": "Mona Grudt Bittrick a green-eyed redhead, became the first Norwegian to capture the Miss Universe title in 1990. Although she was not a favourite prior to the pageant, she became the clear favorite of the judges, winning the interview and swimsuit preliminaries. During the semi-finals she won all three segments. During the 1990 Miss Universe competition, she listed herself as \"The beauty queen from Hell\" as a publicity stunt (since she was born in Hell, Norway. Apart from that 'hell' also means 'luck' in Norwegian). Her runner-ups were Carole Gist of the U.S. (she is incidentally, the first black woman to ever become Miss USA), and Liseth Mahecha of Colombia.\n\nDuring her reign, she appeared in an episode of Star Trek: The Next Generation as \"Ensign Graham\". Grudt was also the last Miss Universe to accompany Bob Hope on his USO tour.\n\nToday, Grudt is the editor of the Norwegian wedding magazine Ditt Bryllup (en. Your Wedding).\n\nAlso, Mona Grudt came on 2nd place in the Norwegian version of Dancing with the Stars, in Norway called Skal vi danse (Shall we dance).\n\nNow she is married to American Brody Bittrick, and they have 2 children."}, {"url": "https://www.blackpast.org/african-american-history/gist-carole-ann-marie-1969/", "page_content": "Carole Anne-Marie Gist, the first African American woman to win the Miss USA title, was born on May 8, 1969 in Detroit, Michigan. Gist, the daughter of Joan Gist and David Turner, is of African American and Cherokee heritage. Her parents divorced when she was a young child. Gist graduated from Cass Technical High School in Detroit in 1987 where she had been an honor student.\n\nGist first won the tile of Miss Michigan USA in 1989 and went on to win the title of Miss USA on March 2, 1990 in Wichita, Kansas. She was the first contestant from Michigan to win the Miss USA (not Miss America) title and she also broke the five year streak of winners from the state of Texas. At 5’11” Gist was also the tallest Miss USA. At the time of her crowning, she was a junior majoring in marketing and management at Northwood University in Midland, Michigan, from which she eventually received her B.A. degree.\n\nWinning the title brought Gist over $200,000 in cash and prizes and automatically earned her the opportunity to represent the United States in the Miss Universe pageant where she placed as first runner up to Miss Norway, Mona Grut.\n\nThroughout her reign as Miss USA, Gist captivated audiences with her stories of being from a single parent home where she had a number of siblings and having to overcome numerous financial and social obstacles. She described the family’s frequent moves in some of the roughest neighborhoods in inner city Detroit and of her homes being frequently burglarized. Gist claimed that money was always scarce in her family and that poverty prevented her from taking dance lessons or learning the piano and violin. Her story contrasted sharply with the middle class backgrounds of most of her competition and of previous Miss USA crown holders.\n\nControversy, however, surrounded Gist’s reign as Miss USA. Her conflicts with pageant officials became well known to the public by 1991. Toward the end of her reign she filed a $20,000,000 lawsuit against the Miss USA Organization for fraud. The lawsuit was eventually dismissed.\n\nFollowing her reign, Gist co-hosted a program on the WORD gospel network. Carol Ann-Marie Gist is currently married with two children. She works for a Detroit area construction company and is a fitness trainer at Wayne State University."}, {"url": "https://conandaily.com/2021/06/23/5-most-beautiful-miss-norway-2021-finalists/", "page_content": "Nora Emilie Nakken\n\nMiss Norway 2020 Sunniva Frigstad will crown her successor at Åpen Scene in Oslo, Norway on August 14, 2021. It will be the 71st edition of the Norwegian national beauty pageant that selects the official Miss Universe candidate from Norway.\n\nCurrently, Norway has 17 placements at Miss Universe. On April 15, 1990, Mona Grudt won the title at the Shubert Theatre in Los Angeles, California, United States, making her the first and still the only Miss Universe from Norway.\n\nRepresenting Norway, Jorunn Kristjansen was first runner-up in 1959 while Aina Walle was second runner-up in 1973. The most recent Miss Universe placement of the European country was in 2005 when Helene Tråsavik finished in the Top 15.\n\nFrom 21 semi-finalists, only 13 finalists were selected to compete for the Miss Norway 2021 title. If facial beauty is the only criterion, these will be my Top 5 candidates:\n\n.\n\n#5. Guro Bønes Tobiassen\n\nage : 21\n\n: 21 residence : Lillestrøm\n\n: Lillestrøm hometown : Harstad\n\n: Harstad birthplace : Harstad\n\n.\n\n#4. Angelika Catharina D. Kristiansen\n\nage : 28\n\n: 28 residence : Gjøvik og Oslo\n\n: Gjøvik og Oslo hometown : Magnor\n\n: Magnor birthplace : Kongsvinger\n\n.\n\n#3. Nicole H. Leyton\n\nage : 28\n\n: 28 residence : Stjørdal, Norway\n\n: Stjørdal, Norway hometown : Stjørdal, Norway\n\n: Stjørdal, Norway birthplace : Chile\n\n.\n\n#2. Lilly Sødal\n\nage : 18\n\n: 18 residence : Kristiansand, Norway\n\n: Kristiansand, Norway hometown : Kristiansand, Norway\n\n: Kristiansand, Norway birthplace : Oslo, Norway\n\n.\n\n#1. Nora Emilie Nakken\n\nage : 22\n\n: 22 residence : Trondheim, Norway\n\n: Trondheim, Norway hometown : Trondheim, Norway\n\n: Trondheim, Norway birthplace : Trondheim, Norway"}, {"url": "https://people.com/tv/miss-usa-miss-teen-usa-miss-america-all-black-women-first-time/", "page_content": "For the first time ever, Miss USA, Miss America and Miss Teen USA are all black women.\n\nThe historical moment was cemented Thursday evening after Miss North Carolina, Cheslie Kryst, took home the title of Miss USA 2019, when she was crowned by her predecessor, Miss USA 2018, Sarah Rose Summers.\n\nKryst, 28, beat out 50 other contestants including Miss Oklahoma, Triana Browne, who was named second runner-up, and Miss New Mexico, Alejandra Gonzalez, who was named first runner-up.\n\nFour days earlier, Kaliegh Garris was crowned Miss Teen USA, winning over runner-up Miss North Dakota, Kaitlyn Vogel. The 18-year-old Connecticut native showed off her natural curls as she tearfully accepted the crown.\n\nAnd this past September, Cara Mund of North Dakota, ended her run as Miss America 2018 when she crowned Miss New York, Nia Imani Franklin, with the 2019 Miss America tiara.\n\nFrank Micelotta/FOX/PictureGroup/REX/Shutterstock\n\nCheslie Kryst is crowned Miss USA 2019. Frank Micelotta/FOX/PictureGroup/REX/Shutterstock\n\nGarris’ hands shook as she accepted her sash and crown, which was placed atop her voluminous natural curls before she took her first walk as the official Miss Teen USA on April 28.\n\nIn an interview with Refinery29 following the competition, the newly crowned teen said that she prepped her locks herself before the competition.\n\n“The night before, I finger curled every single piece of my hair in the shower, which led to a very long shower, but it was for the greater good,” she shared.\n\nRELATED VIDEO: Kaliegh Garris is Miss Teen USA 2019\n\n\n\n“I know what I look like with straight hair, with extensions, and with my curly hair, and I feel more confident and comfortable with my natural hair,” continued Garris, whose career ambition is to be a nurse.\n\nKryst is “a full-time attorney that is licensed to practice law in two states,” according to her Miss USA bio, while Franklin, according to her Miss America bio, is a “classically trained opera singer and advocate for the arts.”\n\nThe trio’s history-making wins follow that of Vanessa Williams, who became the first black woman to win the Miss America pageant in 1983. The first black Miss USA winner, Carole Gist, took home the title in 1990 (and nabbed first runner-up in Miss Universe), while Janel Bishop was crowned the first black Miss Teen USA the following year."}, {"url": "https://www.celebsagewiki.com/mona-grudt", "page_content": "Age, Biography and Wiki\n\nMona Grudt was born on 6 April, 1971 in Hell. Discover Mona Grudt's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 52 years old?\n\nPopular As N/A Occupation N/A Age 52 years old Zodiac Sign Aries Born 6 April 1971 Birthday 6 April Birthplace Hell Nationality\n\nWe recommend you to check the complete list of Famous People born on 6 April. She is a member of famous with the age 52 years old group.\n\nMona Grudt Height, Weight & Measurements\n\nAt 52 years old, Mona Grudt height is 1.78 m .\n\nPhysical Status Height 1.78 m Weight Not Available Body Measurements Not Available Eye Color Green Hair Color Red\n\nWho Is Mona Grudt's Husband?\n\nHer husband is Brody Bittrick (m. 2005–2012), Lasse Berre (m. 1995–1999)\n\nFamily Parents Not Available Husband Brody Bittrick (m. 2005–2012), Lasse Berre (m. 1995–1999) Sibling Not Available Children Milla Grudt, Oliver Grudt, Bianca Grudt\n\nMona Grudt Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Mona Grudt worth at the age of 52 years old? Mona Grudt’s income source is mostly from being a successful . She is from . We have estimated Mona Grudt's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nMona Grudt Social Network\n\nTimeline"}, {"url": "https://infogalactic.com/info/Miss_Universe_1990", "page_content": "From Infogalactic: the planetary knowledge core\n\nMiss Universe 1990, the 39th Miss Universe pageant, was held on 15 April 1990 at the Shubert Theatre in Los Angeles, California, USA. Mona Grudt of Norway crowned by Angela Visser of Holland. Seventy-one contestants competed in this year.\n\nFor the first time, the judges' individual scores were visible to the viewing audience, adding transparency to the pageant. Also in this year, a major format change that transformed the Miss Universe competition for the next decade was introduced, in which the delegates would face an extra round of elimination on finals night: the Top 6 judges' questions.\n\nIn the Parade of Nations, television viewers got to see each delegate in national costume, as well as her swimsuit, evening gown and interview preliminary scores for the first time. Host Dick Clark also called out each country individually, as compared to the 1980s where all the delegates introduced themselves in rapid succession. This format of Parade of Nations continued until 1997. The presentation of the delegates in continental order, introduced in 1989, also continued until 1997.\n\nAlso, instead of reducing the Top 10 to the usual Final 5, the judges picked a momentary Top 6. Those 6 finalists would answer questions and the field was reduced to a Final 3 who would face the traditional final question. This format was discontinued in 2001.\n\nResults\n\nFile:Miss Universe 1990 Map.PNG Countries and territories which sent delegates and results\n\nPlacements\n\nSpecial awards\n\nAwards Contestant Best National Costume Colombia - Lizeth Mahecha Miss Congeniality Germany - Christiane Stocker Miss Photogenic Thailand - Passaraporn Chaimongkol\n\nSemi-final scores\n\nDelegate Interview Swimsuit Evening Gown Average Norway 8.760 (1) 8.922 (1) 8.989 (1) 8.890 (1) Colombia 8.610 (2) 8.714 (2) 8.840 (2) 8.721 (2) Mexico 8.500 (4) 8.450 (4) 8.707 (4) 8.552 (3) Chile 8.411 (6) 8.410 (6) 8.770 (3) 8.530 (4) Bolivia 8.439 (5) 8.498 (3) 8.600 (6) 8.512 (5) USA 8.509 (3) 8.299 (7) 8.630 (5) 8.479 (6) Venezuela 8.370 (7) 8.450 (4) 8.590 (7) 8.470 (7) India 8.200 (9) 8.233 (8) 8.552 (8) 8.328 (8) Turkey 8.079 (10) 8.139 (9) 8.200 (9) 8.139 (9) Czechoslovakia 8.360 (8) 7.785 (10) 7.970 (10) 8.038 (10) Winner First runner-up Second runner-up Top 6 finalist Top 10 semi-finalist (#) Rank in each round of competition\n\nPreliminary scores\n\nNote: The scores shown during the Parade of Nations were miscategorized later on in the telecast, creating confusion. The Top 3 Preliminary Interview Scores were labeled as Preliminary Swimsuit scores. Similarly, the Top 3 Swimsuit scores were miscategorized as Preliminary Evening Gown scores, a mistake that would not be repeated the following year.\n\nOrder of announcements\n\nTop 10 India Colombia Mexico Turkey Chile Bolivia Czechoslovakia Venezuela USA Norway Top 6 Colombia Bolivia Mexico Norway Chile USA Top 3 USA Norway Colombia\n\nContestants\n\nNotes\n\nCrossovers\n\nInternational broadcasting\n\nThese are some of the networks outside the United States (telecasted on CBS) that showed the 1990 Miss Universe pageant live (or recorded earlier) in their respective countries and territories:"}, {"url": "https://www.angelopedia.com/Beauty-Pageant-Info/Norway/Miss-Universe-Norway-2016/676", "page_content": "Miss Universe Norway 2016 is an annual national beauty pageant held in Norway to select representatives for the Miss Universe pageant. The grand finale Miss Universe Norway 2016 pageant which was held on July 30' 2016 concluded with the crowning of Christina Waage as Miss Universe Norway 2016. She will now represent Norway at the Miss Universe 2016 pageant which is slated to be held in Philippines later this year.\n\nAt the same pageant Camilla Devik was crowned Miss International Norway 2016, and will now represent Norway at the Miss International 2016 pageant, while Yasmin Osee Aakre was titled as first runner up of Miss Universe Norway 2016.\n\nThere were a total of seventeen contestants who competed for the Miss Universe Norway 2016 title this year. The seventeen beautiful delegates were –\n\nAmalie Helene Svendsen Holen\n\nAnna Madelen Karlsen Shahiri\n\nBettina Hofsodegard\n\nCamilla Ellinor De Souza Devik\n\nChristina Waage\n\nChristine Berge\n\nDzenana Alic\n\nEmeriin Jeolina Jorseph\n\nGulsum Tulun\n\nIselin Vatle\n\nJennifer Maria Forfang\n\nLinn Adriana Thomassen\n\nNora Emilie Nakken\n\nSara Hassing Johansen\n\nSelina Ilincic\n\nSeline Solberg\n\nYasmin Osee Aakre\n\nThe first Norwegian woman to win the title of Miss Universe was Mona Grudt, who was crowned Miss Universe in the year 1990. The Miss Universe Norway 2015 was Martine Rodseth Hjorungdal. At the conclusion of the pageant, Martine passed on her crown to her successor Christina Waage."}]}