{"Carole Gist was the first African-American woman to place in the Miss Universe pageant.": [{"url": "https://www.blackpast.org/african-american-history/gist-carole-ann-marie-1969/", "page_content": "Carole Anne-Marie Gist, the first African American woman to win the Miss USA title, was born on May 8, 1969 in Detroit, Michigan. Gist, the daughter of Joan Gist and David Turner, is of African American and Cherokee heritage. Her parents divorced when she was a young child. Gist graduated from Cass Technical High School in Detroit in 1987 where she had been an honor student.\n\nGist first won the tile of Miss Michigan USA in 1989 and went on to win the title of Miss USA on March 2, 1990 in Wichita, Kansas. She was the first contestant from Michigan to win the Miss USA (not Miss America) title and she also broke the five year streak of winners from the state of Texas. At 5’11” Gist was also the tallest Miss USA. At the time of her crowning, she was a junior majoring in marketing and management at Northwood University in Midland, Michigan, from which she eventually received her B.A. degree.\n\nWinning the title brought Gist over $200,000 in cash and prizes and automatically earned her the opportunity to represent the United States in the Miss Universe pageant where she placed as first runner up to Miss Norway, Mona Grut.\n\nThroughout her reign as Miss USA, Gist captivated audiences with her stories of being from a single parent home where she had a number of siblings and having to overcome numerous financial and social obstacles. She described the family’s frequent moves in some of the roughest neighborhoods in inner city Detroit and of her homes being frequently burglarized. Gist claimed that money was always scarce in her family and that poverty prevented her from taking dance lessons or learning the piano and violin. Her story contrasted sharply with the middle class backgrounds of most of her competition and of previous Miss USA crown holders.\n\nControversy, however, surrounded Gist’s reign as Miss USA. Her conflicts with pageant officials became well known to the public by 1991. Toward the end of her reign she filed a $20,000,000 lawsuit against the Miss USA Organization for fraud. The lawsuit was eventually dismissed.\n\nFollowing her reign, Gist co-hosted a program on the WORD gospel network. Carol Ann-Marie Gist is currently married with two children. She works for a Detroit area construction company and is a fitness trainer at Wayne State University."}, {"url": "https://face2faceafrica.com/article/from-the-slums-to-national-fame-in-1990-americas-first-black-miss-usa", "page_content": "Carole Anne-Marie Gist is a Detroit, Michigan native born on May 8, 1969. Raised by her mother, they often moved around the inner city of Detroit to avoid violence. She had aspirations of dancing and singing but was unable to fulfil her dreams due to her family’s financial difficulties.\n\nGist was an honor graduate of Cass Technical High School in 1987. In 1990, Gist joined a group of hopeful women, contesting for the Miss USA title.\n\nOn March 2, 1990, Gist made history; she was crowned the first black Miss USA. A feat she accomplished at the age of 20. At six-feet tall, she was also the tallest Miss USA at the time.\n\nShe won $200,000 worth of gifts as part of the package. She went on to win the title of the first runner-up at the Miss Universe pageant.\n\nHer life wasn’t devoid of challenges. In 1991, she filed a lawsuit against Miss USA officials for unfair labor practices; the case was later dismissed.\n\nGist later married and has two children.\n\nThe owner of Royal Physique Fitness, she is a Michigan-area fitness instructor and advocate."}, {"url": "https://blackdoctor.org/carole-ann-marie-gist-first-black-miss-america-turns-50/", "page_content": "Carole Anne-Marie Gist made history nearly 30 years ago on stage when she was crowned Miss USA. It was the first time a Black woman had ever won the title and shattered mainstream myths and biases of African American beauty.\n\nGist first won the title of Miss Michigan USA and went on to win the Miss USA crown on March 2, 1990 in Wichita, Kansas. The 1990 pageant had representatives from Georgia (Brenda Leithleiter), Alaska (Karin Elizabeth Meyer), Kentucky (Tiffany Tenfelde), South Carolina (Gina Tolleson) and Karin Hartz of New Jersey making up with Gist the Top 6 finalists.\n\nGist, a 6-foot in Detroit native, 20 years old at the time, eventually became first runner-up to Mona Grudt of Norway in the Miss Universe pageant of that same year. She was also the first contestant from Michigan to win Miss USA, and broke the five-year streak of winners from Texas.\n\nDuring the time of her crowning, Gist was a junior majoring in marketing at Northwood University in Midland, Michigan, from which she received her bachelor’s degree. Gist received over $200,000 in cash in prizes.\n\nYou May Also Like 9 Ways to Protect Yourself from Breathing Wildfire Smoke\n\nThroughout her reign as Miss USA, Gist captivated audiences with her stories of being from a single parent home where she had a number of siblings and having to overcome numerous financial and social obstacles. She described the family’s frequent moves in some of the roughest neighborhoods in inner-city Detroit and of her homes being frequently burglarized.\n\nGist said that money was always scarce in her family and that poverty prevented her from…"}, {"url": "https://www.genzher.org/digitalmagazine/carole-anne-marie-gist-the-first-black-miss-usa", "page_content": "Texans had previously won Miss USA 5 years in a row and Miss Gist was able to turn the tide in a time when black people were still known as blacks. The Miss USA pageant has been held for 70 years, since 1952, and for 38 years a Black woman had never won. Miss Gist's win was not just important because she was a Black woman but because her background was not ideal. Miss Gist grew up in Motor City, Detroit, a city where she would jump out of garages in proof of her toughness, and divorced parents. Miss Gist needs to be applauded not only for her beauty and strength but also for her intelligence. Miss Gist attended Cass Technical High School and at the time of her win was a junior at Northwood University studying marketing. Miss Gist presents herself as an extremely hard worker and currently has two associate degrees and a dual bachelor's degree from Northwood, two master's degrees, one in sports admin and one in Kinesiology. In the Thirty-one years since the pageant Miss Gist has worked several jobs all befitting her competitive nature and talents in the arts.\n\nThe pageant life is tough with constant judgment and impact on self-esteem, but Miss Gist is quite known for positivity.\n\nIn an Interview with Jets magazine shortly after her win, Miss Gist stated “Hopefully the Lord’s eyes will be upon me again. I am going there with the attitude that I have a chance because I’m just as qualified as the other girls.” Although both her parents were involved in her life Miss Gist grew up in a single-parent home. Her family struggled financially so she could not do all the things she wanted like singing, dancing, and playing instruments like piano and violin. She did not have as much preparation as the other girls, but she was able to recognize that everyone was equal and worked just as hard as everyone else. She was able to use her resources although limited and create her own legacy.\n\nMiss Gist should be remembered as one of the biggest impacts of Black beauty movements in America."}, {"url": "https://www.fox47news.com/news/black-history-makers/carole-gist-first-african-american-crowned-miss-usa", "page_content": "In 1990, at the young age of 20, Carole Gist became the first African American female to be crowned Miss USA.\n\nIn that same year, she became first runner-up in the Miss Universe pageant.\n\nHer life has been an example of turning dreams into reality. Born in Detroit, Carole went to Cass Tech High, Northwood University and Wayne State University. Carole is dedicated to helping women who have experienced trauma and all forms of abuse.\n\nAs Carole has achieved many goals, today she has many more, including being a patented inventor, an Olympian and being the first at something else!"}, {"url": "https://news.lalate.com/2013/04/08/carole-gist-1st-african-american-miss-usa-dominates-rhoa/", "page_content": "\n\nLOS ANGELES (LALATE) – Who was the first African American Miss USA? Carole Gist was the first African American Miss USA, while Vanessa Williams is the first African American Miss America, RHOA fans were reminded last night. Porsha Stewart tried to create a history debate with Kenya Moore Sunday. But Moore took her fan and blew Porsha’s debate agenda into the wind, fabulously.\n\nCarole Gist has yet to comment about RHOA Reunion 2013 telecast (update below). But Porsha Stewart tried to evoke a history debate in last night’s RHOA reunion. Porsha asked Kenya why she keeps on mentioning Vanessa Williams but not Carole Gist. Porsha then claimed Kenya allegedly said this season that she asserts to be the first Black Miss USA.\n\nKenya Moore, when offered an opportunity to respond to Porsha, declined. But last night, Kenya took to Twitter about the matter. Moore’s fans claimed foul against Porsha.\n\nKenya retweeted one fan’s correct comment “you always said you were the 2nd African American Miss USA but are the FIRST BROWN ONE and that means something.” Kenya also tweeted another fan’s remarks “Porsha must be infatuated with @KenyaMoore. She love arguing with and insulting her.”\n\nDespite Porsha’s poor attempt at a history debate on a reality TV program, one thing is clear. Search results do go back that far, even for persons in the forties, despite Porsha’s age comments this season.\n\nIn 1983, Vanessa Williams became the first African-American Miss America; she is now 50 years old. Carole Gist, now age 43, became the first African American woman to win the Miss USA title in 1990. And Kenya Moore, age 42, won the Miss USA title in 1993. Kenya also finished sixth in the Miss Universe, another massive achievement often not mentioned on RHOA this season as well. UPDATE: See below in the comments section a statement from Ms. Gist to LALATE readers.\n\n\n\nLALATE ABOUT THIS AUTHOR || Editor in Chief: Maria Stabile | Maria in ten years has propelled LALATE to become a leading news authority in sports, entertainment, and national news, LALATE has been cited in countless international newspapers (including the Wall Street Journal, New York Times and LA Times), international television news broadcasts including ABC News, books including The Iraq War: Origins and Consequences, tv programs including MTV News, and magazines. For over a decade, LALATE has been a proud licensed member of the St Louis, MO Press Club. || TO CONTACT THIS AUTHOR | Email Address: mstabile@lalate.com | Telephone: 314-400-8010 | Follow on Twitter: Twitter.com/LALATE | Biography: http://news.lalate.com/author/maria-stabile/ | LALATE Staff & Physical Address: http://news.lalate.com/staff/\n\n\n\n"}, {"url": "https://nationalwomenshistoryalliance.org/resources/commemorations/black-history-month/", "page_content": "February is Black History Month\n\nCelebrating Black History Month Resources\n\nVoices from the Days of Slavery\n\nThe Library of Congress’s American Folklife Center online collection: Voices from the Days of Slavery: Former Slaves Tell Their Stories, available at Library’s American Memory. http://memory.loc.gov/ammem/collections/voices/\n\nMemory Project\n\nStanding on My Sisters’ Shoulders\n\nAn award-winning documentary about courageous women in Mississippi during the Civil Rights Movement. Check out www.sisters-shoulders.org for additional information.\n\nBLACK FEMALE FIRSTS:\n\nRebecca Lee Crumpler was the first Black female physician in the United States in 1864. She graduated from the New England Female Medical College.\n\nMartha Jones of Amelia County, Virginia, is believed by many to be the first black woman to receive a United States patent for “Improvement to the Corn Husker, Sheller” in 1868. Her invention made it possible to husk, shell, cut up, and separate husks from corn in one operation.\n\nEdmonia Lewis was the first sculptor of African American and Native American (Mississauga) descent to achieve international recognition. Her father was Black, and her mother was Chippewa (Ojibwa) Indian. A testament to Lewis’ renown as an artist came in 1877, when former U.S. President Ulysses S. Grant commissioned her to do his portrait. .\n\nMadam C.J. Walker was an African American entrepreneur, philanthropist, and political and social activist. She is recorded as the first female self-made millionaire in America in the Guinness Book of World Records, May 25, 1919.\n\nGo ahead, Miss Bessie Coleman! Bessie Coleman was an early American civil aviator. She was the first African-American woman and first Native American to hold a pilot license. She earned her license from the Fédération Aéronautique Internationale on June 15, 1921, and was the first Black person to earn an international pilot’s license. She died in a plane crash, as a passenger, at 34 years old.\n\nIn 1939, Hattie McDaniel won a Best Supporting Actress Oscar for her role as Mammy in Gone With the Wind.\n\n1946 – Hattie T. Scott Peterson is believed to be the first African-American woman to gain a bachelor’s degree in civil engineering from Howard University.\n\nBorn in Albany, GA, Alice Coachman was the first Black female to win a gold medal for the USA in the 1948 Olympics in London for the high jump. She received her medal from King George VI.\n\nDiahann Carroll won a Best Actress in a Musical Tony Award in 1962, making her the first black female to ever do so. This was for her performance in “No Strings.”\n\nIn 1965, Rev. Dr. Pauli Murray would become the first African American to receive a Doctor of Juridical Science degree from Yale Law School.\n\nIn 1965,Patricia Roberts Harris made history as the first female African American Ambassador when she was appointed Ambassador to Luxembourg. Also, In the 1970s, she worked as a corporate attorney until President Jimmy Carter selected her as Secretary of the Department of Housing and Urban Development. With her confirmation, she became the first African American woman to serve as a cabinet secretary.\n\nShirley Chisolm was the first black female to be elected to Congress 1968.\n\nIn 1973, Taft, Oklahoma would elect the first black female mayor in the U.S., Lelia Foley.\n\nIn 1977, Pauli Murray became the first African American woman to be ordained as an Episcopal priest.\n\nVanessa Williams was the first black Miss America, 1984\n\nJennifer Jones is the first black Rockette, 1987.\n\nCarole Anne-marie Gist was the first black Miss USA – 1990\n\nDoctor, engineer and NASA astronaut Mae Jemison is the first black female in space. In 1992 she would make the journey.\n\nMelissa “M’Lis” Ward – Since graduating from the USC Marshall School of Business, Melissa Ward has achieved two historic firsts: she is the first African-American woman to serve as both a U.S. Air Force flight instructor and commercial airline pilot. In November 1992, she joined United Airlines in Chicago as a second officer on DC-10s.\n\nCarol Moseley Braun broke new ground in 1993, becoming the first African American woman to serve as U.S. senator.\n\nAprille J. Ericsson-Jackson is an American aerospace engineer. Ericsson-Jackson is the first African-American woman to receive a Ph.D. in mechanical engineering from Howard University in 1995 and the first African-American woman to receive a Ph.D. in Engineering at the National Aeronautics and Space Administration (NASA) Goddard Space Flight Center (GSFC).\n\nSheila Crump Johnson – first African-American woman (possibly tied with Oprah) to attain a net worth of at least one billion dollars in 1999.\n\nIn 2002, Halle Berry was the first black female to win an Oscar for Best Actress for her role in Monster’s Ball.\n\nMisty Copeland makes history as the first African American Female Principal Dancer with the prestigious American Ballet Theatre on July 1, 2015. Also, author of children’s book “Bunheads”.\n\nKamala Harris – First African American Vice President, 2020, also in 2017 she had become California’s first African American Senator\n\nOn January 10, 2022 the Maya Angelou quarter was the first in the U.S. Mint’s American Women Quarter’s Program which includes coins featuring prominent women in U.S. history.\n\nOn April 11, 2022, The U.S. Senate confirmed Ketanji Brown Jackson as the first Black woman to serve as a Justice of the U.S. Supreme Court.\n\nIf you know of any other Black Female Firsts, please send it to us at info@nwha1980.org ."}, {"url": "https://www.blac.media/people-places/a-spotlight-on-carol-gist/", "page_content": "Carole Gist sashayed into the homes of America for the first time in 1990. She won the title of Miss USA shortly after winning the title Miss Michigan. She captured the audience with her grace and poise as she became the first black woman to hold the title. She spent the next 31 years reinventing herself time and time again. We took some time to sit down with her and chat about what she has been up to and what’s next. Take a peek into our conversation below.\n\nWhen did you fall in love with the performing arts?\n\nI was seeking attention. I wouldn’t stop singing and dancing around the house and I became my mom’s friend’s entertainment. I remember getting up on the table and singing the song You Are My Starship. My mom saw that in me and got me involved with dance. I danced competitively. When I started to develop muscles not suitable for dance, I had to make the choice to continue dancing or play sports.\n\nHow did you prepare yourself for the Miss USA Pageant?\n\nI took the most unconventional way to get there. I competed in Miss Michigan, so former Miss Michigan wouldn’t ask me to do it anymore. Michigan is not a big pageant state. In other states like Texas and Florida the prize package is significantly larger, almost the same as winning Miss USA. That prize money helps you pay for the car, the trainer, the coach. With the money I got, I could only get coaching for one weekend.\n\nADVERTISEMENT\n\nI had a moment of doubt when I was in the registration area of Miss USA. I knew there were two other black girls but they weren’t there yet and I felt so out of place. At that moment, someone came around like only your mom can do, so I know it was God sent. They grabbed me and said, “aht aht stand up tall, you have a right to be here just like anyone else, you are just as beautiful and talented, you just go out there and let your light shine.”\n\nNegativity and doubt can creep in no matter what you are doing. Don’t let it stay, whatever it is, shut it down and remember who you are.\n\nCarol Gist for the April 2021 BLAC® Spring Fashion Issue\n\nTell us about your time competing for Miss Universe?\n\nThe Miss Universe competition opened up my eyes. Meeting all the women from different countries, we shared things and worked out language barriers with pictures. We learned that we think the same, we have the same hopes and dreams. It wasn’t a race thing or a nationality thing, it was just a woman thing.\n\nYou went to the Historical Detroit Cass Tech for High School. What did you study?\n\nI was a business administration Major with a performing arts minor. My mother had her own business; she was always working and hustling. I knew I would do something with business but I wanted my creative outlet as well so I was in choir.\n\nYou have spent your time wisely in school. How many Degrees did you achieve?\n\nI have two associates degrees and a dual Bachelor’s degree Management and Marketing/International Business from Northwood University. I received my first Masters Degree in 2014, in Kinesiology in Sports Science. In 2020 I finished my second Masters Degree in Sports Administration. Both Master degrees were received at Wayne State University. My last one will be a PHD and I am seeing what it would take to be a Physical Therapist.\n\nI can’t stay in one spot for too long or doing one thing for too long. I look forward to the next chapters.\n\nYou have held many titles over the last 31 years, can you list them for us?\n\nOf course, I was in:\n\nHotel Restaurant Management,\n\nA Host\n\nI sang\n\nVideo DJ Host on BET Network\n\nStay at home Wife and Mother\n\nTrack and Volleyball coach\n\nPersonal Trainer\n\nGroup Fitness Trainer\n\nManaging a staff of trainers\n\nPageant Coaching and Judging\n\nWellness Coaching\n\nTriathloner\n\nMakeup Artist\n\nNail Tech\n\nHair Stylist\n\nArcheress\n\nWhat’s next for Carole Gist?\n\nI am still very competitive. My next thing is archery, I am on an all woman team called the Elite Angels. I am writing a few books. A majority of the content is based on a healing journey. That book will lead me into the next thing I want to do, conference speaking. I also want to travel. I want to unapologetically get up and go. I am focused on doing things because I want to not because I have to. I am pursuing my happiness everyday.\n\nCarol Gist for the April 2021 BLAC® Spring Fashion Issue"}, {"url": "https://abcnews.go.com/Entertainment/broadcast-legend-carole-simpson-reflects-shaping-history/story?id=75746492", "page_content": "In the midst of Black History Month, as the nation celebrates the leaders who helped shape the country, broadcast legend Carole Simpson is opening up about breaking barriers in the broadcast industry.\n\nIn 1988, Simpson made history as the first Black woman to helm a major network newscast when she became the face of ABC News' “World News Tonight” weekend edition, which is a role she held for 15 years.\n\nABC News anchor Carole Simpson, who made history as the first Black woman to helm a major newscast, sits at the anchor desk in New York on April 12, 2002. Virginia Sherwood/ABC\n\nThe three-time Emmy award-winning television journalist spoke to ABC News' Linsey Davis, who now holds the Sunday night anchor slot that Simpson once commanded, about paving the way for others in a male-dominated industry.\n\nSimpson told Davis that she was proud of her for securing the position as she's had high hopes of seeing more African American women follow her lead.\n\n“Women can do the impossible ... if you want something, you’ll do it,” Simpson told ABC News on Sunday.\n\nIn 1992, Simpson became the first minority to moderate a presidential debate, which included President George H.W. Bush, Gov. Bill Clinton, and businessman Ross Perot. She recalls working tirelessly for days prior to the debate in preparation for the historic moment.\n\nABC News anchor Carole Simpson, smiles in a file photo on Oct. 15, 1992, the day she became the first woman of color to moderate a presidential debate in the U.S. Joe Marquette/AP, FILE\n\nIn her memoir titled \"NewsLady,\" she details how she overcame both sexual discrimination and racism before reaching the top ranks of the industry.\n\nThe 79-year-old, who reported during the height of the civil rights movement, which includes covering and meeting Dr. Martin Luther King, Jr., believes that America’s racial reckoning last June following the death of George Floyd at the hands of Minneapolis police was short-lived.\n\n“Just look at where we are now,” Simpson told ABC News. “We are so divided and I think the race question is right back here. ... we’ve had many Black men killed since George Floyd.”\n\nAs someone who reported on politics and frequently worked at the U.S. Capitol building, Simpson says that the deadly riot last month was something that “really shook” her.\n\n“I think the damage that was done by Donald Trump to the nation is not insurmountable, but it’s going to be hard ... to put all the pieces he tried to shatter,” Simpson said.\n\nSimpson, who grew up as a curious child on the South Side of Chicago, said that it took “sheer determination” to carve out her own path and follow her dream of working in news.\n\nAfter attending the University of Michigan, she went to graduate school at the University of Iowa. After college, she quickly went on to leave her mark in her hometown of Chicago by becoming the first woman to broadcast radio news and the first Black woman to anchor a local newscast.\n\nAfter working in the business for 40 years, she retired in 2006 and taught journalism courses at Emerson College in Boston for 13 years.\n\nToday, Simpson is still making a difference in the industry by offering scholarships to journalism students and mentoring youth across the country.\n\nAdditionally, she offers advice to women through her vlog titled W.O.W. (Wise Old Woman) –– a platform where she's become a one-woman production band by producing digital content from her home.\n\n“I want my legacy to be that she made a difference,” Simpson said."}, {"url": "https://www.carolegist.com/gettoknowcarole", "page_content": "About Carole\n\n“Pageantry allowed me to rise above very difficult circumstances growing up. It gave me something to strive for and be proud of while building my self-esteem. I embrace the fact that my life is not my own and my historic crowning was not simply about me, it has been a gift to others and I am honored to live my life helping others achieve success.”\n\nCarole has been recognized by the media as a Michigan Woman of Excellence (Award honoree). She is consistently acknowledged for her perpetual grace and elegance, a direct result of her early dance, modeling and pageant experience.\n\nShe has not only continued to bring honor to her crown, she has not stopped achieving. Carole is an active runway, print, fashion and fitness model, as well as, a commercial actress, TV hostess, entrepreneur and Tri-athlete.\n\nCarole Gist is the first African-American to be crowned Miss USA and first runner-up to Miss Universe (1990).\n\nCarole speaks to thousands each year about taking daily steps toward success by becoming the best version of themselves—mentally, emotionally, spiritually and physically. She is a model of her message and upcoming auto-biography “Live life with the Grace of a Queen and the Strength of an Achiever.”\n\nCarole continues to make an impact in her community as an active member of her church volunteering and serving in many capacities. She a regular volunteer with various organizations that help: women and children escaping domestic violence; women in recovery re-enter the job market; families in need of housing, transportation and food; collect and distribute food through distribution centers and provide weekly mobile meal distribution.\n\nCarole loves to empower others to be the best they can be, fulfill their destiny purpose and give themselves and the world the best they can to offer—a purpose driven, healed, whole and loving human being.\n\nCarole teaches these principles as a Wellness, Fitness, and Pageant Coach; as an adjunct faculty lecturer; as a Personal Trainer and as Motivational speaker. She shares how to have the Grace of a Queen and the Strength of an Achiever and teaches Principles of Overcoming Obstacles through varied speaking, teaching and motivational talks. Which she will share in an upcoming biography.\n\nCarole is the proud mother of 2 adult children: Tylar, 26, a professional dancer and dance teacher at Legacy Dance Studio and Keith, 22, a junior at Wayne State University, majoring in computer engineering. Carole additionally holds a Master’s Degree in Kinesiology, is working on a second Master’s in Sport Administration (2020), and a future PhD candidate in Exercise and Sport Science and is the Athletics Department's MHRFC Health and Wellness Coordinator for Wayne State University in Detroit, Michigan.\n\nCarole can be reached at CaroleGistUSA90@gmail.com for more information about speaking engagements, pageant coaching, Health and Wellness seminars, and Motivational Fitness facilitator"}]}