{"David Collings made his stage debut in 1962.": [{"url": "https://www.theguardian.com/stage/2020/mar/26/david-collings-obituary", "page_content": "After a spectacular start to his television career in the 1960s, when he played leading roles in two classics by Dostoevsky, the actor David Collings, who has died aged 79, became a cult favourite of sci-fi fans with weird appearances in UFO (produced by the Thunderbirds team of Gerry and Sylvia Anderson), three Doctor Who sagas and the 1979 supernatural detective series Sapphire and Steel, co-starring Joanna Lumley and David McCallum.\n\nAlthough he started out on the stage, Collings did not consolidate his reputation there until completing more than a decade of television stardom, after which he was in a string of important roles for the Royal Shakespeare Company.\n\nAt the Open Air theatre in Regent’s Park he was a genuinely funny Polonius opposite newcomer Damian Lewis’s firebrand Hamlet in 1994, directed by Tim Pigott-Smith; he had first played a tetchy but benignly well-meaning Polonius for an RSC touring production with Philip Franks in 1987.\n\nCollings was a fine featured, red-haired actor with sensitive blue eyes who was equally good at playing neurotic and sweet-natured characters. On television he also ran a good line in eminent characters from history: Percy Grainger in Ken Russell’s Song of Summer (1968), Sir Anthony Babington in Elizabeth R (1971), John Ruskin in The Love School (1975), William Wilberforce in The Fight Against Slavery (1975) and William Pitt in Prince Regent (1979).\n\nHe was born in Brighton, East Sussex, to George Collings, a greengrocer, and his wife, Lillian (nee Parsons). At Varndean grammar school he enjoyed acting but had no thoughts of setting out to be a professional actor and, on leaving, started work as a designer in lettering, inheriting that interest from his father, a keen artist. From 1960 he was happily involved in amateur dramatics for the Withdean Players and the Lewes Little theatre, but then was recommended by the actor Freda Dowie to the director David Scase, who had been appointed to run the Liverpool Rep.\n\nAfter six months in rep, Collings found himself pitched into television through another unsolicited recommendation, this time from the actor John Slater, who thought he might be suitable casting in a 1964 Play of the Week presentation of Crime and Punishment. Thus he found himself playing the impoverished tragic hero, Raskolnikov, murderer of an old pawnbroker, in a three-and-a-half hour existential epic alongside Steven Berkoff, Peter Bowles, Julia Foster and Sylvia Coleridge.\n\nFive years later, in 1969, he was in another mighty Dostoevsky production, a BBC version in six episodes of The Possessed, as the charismatic rabble-rouser Pyotr Verkhovensky, alongside Rosalie Crutchley, Joan Hickson and Angela Pleasence. In the same year he was the Clerk in a BBC adaptation in seven long episodes of Chaucer’s Canterbury Tales, with Barbara Jefford as the Wife of Bath and Barry Linehan as the Miller.\n\nHe made a rare feature movie appearance as a lovable Bob Cratchit in the musical Scrooge (1970), with Albert Finney, in the same year as he was captured by aliens and imbued with superhuman powers in UFO. In Doctor Who he was an alien himself, in a rubber mask, with ideas of blowing up the Cybermen with a home-made rocket in 1975; a robot-phobic, Poul, in a 1977 narrative that found him crawling round the floor and sobbing; and in 1983, Peter Davison having succeeded Tom Baker in the title role, he was mistaken for the good doctor before mutating into a mutant with a wild spaghetti hairstyle.\n\nCollings as Bob Cratchit in the 1970 film Scrooge, with Frances Cuka as his wife. Photograph: Allstar/Waterbury\n\nPausing only to play Legolas in Lord of the Rings on BBC Radio 4 in 1981, and a guest appearance in the final wipe-out episode of Blake’s 7, Collings joined the RSC for the first time as Newman Noggs in the 1985 revival of David Edgar’s Nicholas Nickleby on tour and on Broadway. He also appeared in a star-studded chorus in the fine Don Taylor television script of Sophocles’ Oedipus (1986), with Michael Pennington, Claire Bloom and John Gielgud.\n\nFor the RSC subsequently, between 1996 and 2001, he played Thomas Cranmer in Henry VIII, Baron de Charlus in Tennessee Williams’s Camino Real, Count Lerma in Schiller’s Don Carlos, Sir Politic Would-Be in Ben Jonson’s Volpone, Cardinal Pandulph in King John and Sancho in Lope de Vega’s Madness in Valencia. You could not devise a more varied roster of roles, but he discharged them all with a bitter charm and watchful, wary eye.\n\nIn this millennium, he played a neat double of Sir Henry Green and the Duke of Surrey in Kevin Spacey’s Richard II (2005), directed by Trevor Nunn at the Old Vic, and graced a startling revival of Middleton and Rowley’s Jacobean shocker The Changeling (2006) for Declan Donnellan’s Cheek by Jowl company at the Barbican; the cast also included Will Keen, Olivia Williams and an unknown but tremendous Tom Hiddleston.\n\nA favourite “job” was appearing with his son, Samuel, in Toby Frow’s 1950s revival of Marlowe’s Edward II at the Royal Exchange, Manchester, in 2011; he was old Mortimer and Matrevis while Sam doubled as the king’s lover, Piers Gaveston, and his poker-wielding murderer, Lightborn.\n\nCollings was married firstly to Deirdre Bromfield, whom he met at the Lewes Little theatre, in 1962 (they divorced in 1975), and secondly to the actor Karen Archer in 1983, from whom he was separated, although they remained close friends. He is survived by Karen, by their children, Samuel and Eliza, his daughter, Kate, from his first marriage, and his sister, Nola. He was predeceased by Deirdre and two of their children, Matthew and Bethian."}, {"url": "https://www.bafta.org/heritage/in-memory-of/david-collings", "page_content": "BAFTA Guru\n\nBAFTA Guru is BAFTA’s content hub for career starters packed full of inspirational videos, podcasts and interviews. Whether you’ve taken your first steps in the industry or are just starting out, you’ll find plenty here to motivate and help you along the way.\n\nFind out more"}, {"url": "https://wiki2.org/en/David_Collings", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nEnglish actor (1940–2020)\n\nDavid Collings (4 June 1940 – 23 March 2020)[1] was an English actor. In an extensive career he appeared in many roles on stage, television, film and radio, as well as various audio books, voiceovers, concert readings and other work. He garnered a following through his numerous appearances in cult sci-fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as dubbing the titular character in the series Monkey and Legolas in the classic BBC Radio 4 adaptation of Tolkien's The Lord of the Rings.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 2 057 3 089 11 779\n\nVarious - Don't Break Down (David Collings)\n\nMonkey (TV Series) Opening Song, Cast then and now\n\nDavid Ladd discusses his father , Alan Ladd and Shane. Transcription\n\nBiography\n\nCollings was born in Brighton on 4 June 1940.\n\nFilm and television\n\nCollings's screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television).[2] The production was broadcast live. He has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), Richard Simmons in The Shadow of the Tower (1972), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975, he portrayed William Wilberforce in The Fight Against Slavery, and he starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire & Steel TV adventures.[3] He appeared in the TV series Danger Man, Mystery and Imagination, UFO (episode \"The Psychobombs\") and Gideon's Way; in the latter, he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rodgers and others. In 1981 he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series. He voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people. He is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.[4] He has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio\n\nOn radio, he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.[5]\n\nHe was Mr Carlyle in Radio 4's 7-episode serial dramatisation of East Lynne by Mrs Henry Wood, first broadcast in June 1987.[6]\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre\n\nCollings was described by The Stage as a \"stalwart of the National and RSC\".[7] His career on stage began with seasons at the Liverpool Rep and subsequently took him all over the world with leading companies including Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays. He played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nPersonal life\n\nCollings had three children, Samuel, Eliza and Kate.\n\nHe died aged 79, on 23 March 2020.[8][9]\n\nFilmography\n\nReferences"}, {"url": "https://www.telegraph.co.uk/obituaries/2020/05/18/david-collings-actor-made-name-science-fiction-series-doctor/", "page_content": "David Collings, who has died aged 79, was a Doctor Who fans’ favourite after taking three roles in the classic television science fiction series; he first appeared as Vorus, power-mad leader of the guardians of the mines on Voga, the “planet of gold”, in the 1975 adventure “Revenge of the Cybermen”, determined to blow up the Time Lord’s enemies with his Skystriker rocket.\n\n“I was a sort of scientist/politician packed into a rubber mask and thinking, ‘Thank God they can’t see what I look like!’” Collings told the writer Alan Stevens. “In the end, he gets to fire his big rocket but then dies in the process.”\n\nThe actor was back two years later in “The Robots of Death”, his thick mop of red hair clearly visible this time while wearing what he described as a “very butch” costume. The role was Poul, a mining company’s undercover agent who proves useless – it emerges he has a fear of robots. In portraying the character’s breakdown, Collings memorably crawls around the floor sobbing."}, {"url": "https://www.celebsagewiki.com/david-collings", "page_content": "Age, Biography and Wiki\n\nDavid Collings (David Cressy Collings) was born on 4 June, 1940 in Brighton, East Sussex, England, UK, is an Actor, Soundtrack. Discover David Collings's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of David Collings networth?\n\nPopular As David Cressy Collings Occupation actor,soundtrack Age 80 years old Zodiac Sign Gemini Born 4 June 1940 Birthday 4 June Birthplace Brighton, East Sussex, England, UK Date of death 23 March, 2020 Died Place 2020 Nationality UK\n\nWe recommend you to check the complete list of Famous People born on 4 June. He is a member of famous Actor with the age 80 years old group.\n\nDavid Collings Height, Weight & Measurements\n\nAt 80 years old, David Collings height not available right now. We will update David Collings's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is David Collings's Wife?\n\nHis wife is Karen Archer (1983 - 23 March 2020) ( his death) ( 2 children), Deirdre Bromfield (1962 - 1975) ( divorced) ( 3 children)\n\nFamily Parents Not Available Wife Karen Archer (1983 - 23 March 2020) ( his death) ( 2 children), Deirdre Bromfield (1962 - 1975) ( divorced) ( 3 children) Sibling Not Available Children Not Available\n\nDavid Collings Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is David Collings worth at the age of 80 years old? David Collings’s income source is mostly from being a successful Actor. He is from UK. We have estimated David Collings's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nDavid Collings Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.findagrave.com/memorial/240290079/david-collings", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.theguardian.com/stage/2020/apr/26/letters-david-collings-obituary", "page_content": "I was stage manager to David Collings (obituary, 18 April) on five international tours with Cheek by Jowl. Whoever had the official titles, he was our commanding officer. A great actor, unflappable, a total pro and never a man to take a crisis seriously. Win, lose or draw, there was always a vodka and tonic, a cracking meal and lots of laughs. I don’t suppose I will ever work with anybody like him again.\n\nHis memory will live on with everyone who had the privilege of knowing him, a man who could be anywhere from Vladivostok to Tierra del Fuego and have worked out within five minutes where the best bar and restaurant were, and already be best mates with the proprietors and have charmed their wives.\n\nDougie Wilson\n\nMy abiding memory of David Collings is of him talking to a theatre full of schoolchildren, of whom I was one, at the Playhouse, Liverpool in the early 1960s. He spoke of life as a young actor and I was mesmerised. Not long afterwards he played Raskolnikov in the TV adaptation of Crime and Punishment and, to this starstruck teenager, I was thrilled that I had actually seen him in person.\n\nIn Stratford, some 40 years later I was able to speak to him at the stage door and tell him that I had been an ardent fan since Liverpool in the 60s. He was very gracious.\n\nJennifer Henley"}, {"url": "https://www.heraldscotland.com/opinion/18377426.obituary-david-collings-stage-tv-film-actor-took-many-roles-royal-shakespeare-company-productions/", "page_content": "Born: June 4, 1940;\n\nDied: March 23, 2020.\n\nDAVID Collings, who has died of natural causes aged 79, was a fine character actor who could imbue the roles he played with watchful intelligence, prowling intensity, sardonic humour and detached melancholy as required. His soulful eyes could ignite vividly on his striking, yet sometimes doleful, countenance - under a lustrous mane of red hair - giving him an enigmatic, otherworldly quality that made him especially useful to science-fiction productions.\n\nAs Silver in the beguiling series Sapphire and Steel (1981-82) he was an eccentric, mercurial foil to David McCallum and Joanna Lumley. A popular contributor to Doctor Who – memorably guest-starring in three stories between 1975-83 – his powerful yet nuanced performances helped to ground the fantastical with requisite realism. Actor Mark Gatiss has described him as “the greatest Doctor Who we never had”; Collings finally got to play his own incarnation of the Time Lord in an audio adventure for Big Finish (2003), capitalising on his vast experience in radio.\n\nIn BBC Radio 4’s epic and strongly cast version of The Lord of the Rings (1981) he played Legolas, and latterly he was the perfect audiobook reader for the haunting stories of MR James.\n\nHis dusky yet melodic voice, perfectly modulated, also adopted an amusingly boorish bravado for the the title character in Monkey (1979-80),the dubbed English language version of the cult Japanese TV series.\n\nDavid Cressy Collings was born in Brighton, the son of a greengrocer. Upon leaving Varndean Grammar School he worked in retail before becoming an apprentice draughtsman at a design practice.\n\nHe joined the amateur company Lewes Little Theatre, partly to help with a speech impediment, and was spotted by actress Freda Dowie, who recommended him to the Liverpool Repertory Theatre. Whilst there the actor John Slater suggested him for a three-hour, live TV production of Crime and Punishment (1964) - and so, at 24 and with no formal training, he played his first leading television role.\n\nMore notable parts followed, in Ken Russell’s Song of Summer (as an unforgettable Percy Grainger, 1968), Elizabeth R (1971, with Glenda Jackson), the BBC Shakespeare Julius Caesar (an intense Cassius, 1979), The Prince Regent (as William Pitt, 1979), A Tale of Two Cities (1980), Dark Towers (terrifying a generation of children as Lord Dark, 1981), and Press Gang (1989-93).\n\nHe also guest-starred in most popular series from Z-Cars (1965) to Holby City (2015) via UFO (1970), The Professionals (1978) and Blake’s 7 (1981). On film he was an excellent Bob Cratchit to Albert Finney’s eponymous miser in Scrooge (1970).\n\nHe was a gifted classical stage actor - his Mercutio at St George’s Theatre, Tufnell Park (1976) was, according to Kenneth Branagh, who watched it as a schoolboy, “thrilling” and “brilliant”.\n\nHe spent several seasons with the Royal Shakespeare Company, where his insightful character work benefited several good parts over the decades - a favourite engagement was touring with them from Stratford to Broadway in the 1985 revival of Nicholas Nickleby with his wife, Karen Archer, also in the cast, and their infant twins Samuel and Eliza (both destined to be actors themselves) in tow. He and Samuel also shared the stage in the Manchester Royal Exchange’s 2011 production of Edward II.\n\nHe is survived by Karen, Samuel and Eliza, his sister Nola and step-daughter Juliet and daughter Kate from his earlier marriage, to Deirdre Bromfield. Their other two children, Matthew (12) and Bethian (aged just a few months), predeceased him."}, {"url": "https://alchetron.com/David-Collings", "page_content": "David Collings (born 4 June 1940) is an English actor. In an extensive career he has appeared in countless roles on stage, television, film and radio as well as various audio books, voice over, concert readings and other media.\n\nHe has garnered a following due to his numerous appearances in cult Sci-Fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as voicing the titular character in the popular, long-running series Monkey.\n\nBiography\n\nCollings was born in Brighton on 4 June 1940.\n\nFilm and TV\n\nCollings' screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television).The production was recorded live.\n\nHe has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975 he portrayed William Wilberforce in The Fight Against Slavery, and starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire and Steel TV adventures.\n\nHe appeared in the TV series Danger Man, Mystery and Imagination, UFO and Gideon's Way- the latter of which he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rogers and others.\n\nIn 1981, he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series.\n\nHe voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people.\n\nHe is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including as Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.\n\nHe has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio\n\nOn radio he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre\n\nCollings' career on stage began with seasons at the storied Liverpool Rep., and has since taken him all over the world with leading companies including the National Theatre, the Royal Shakespeare Company and Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays.\n\nHe played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nSelected filmography\n\nSong of Summer (1968)\n\nJoanna (1968)\n\nScrooge (1970)\n\nFor the Love of Ada (1972)\n\nMahler (1974)\n\nHennessy (1975)\n\nThe Thirty Nine Steps (1978)\n\nJulius Caesar (1979)\n\nThe Outsider (1980)\n\nTangiers (1982)\n\nPersuasion (1995)\n\nThe Invisible Woman (2013)\n\nPersonal life\n\nCollings has three children, Samuel, Eliza and Kate."}, {"url": "https://nostalgiacentral.com/television/tv-by-decade/tv-shows-1970s/water-margin/", "page_content": "1 9 7 6 – 1 9 7 8 (China/Japan)\n\n30+ x 45 minute episodes\n\nChinese culture was very popular in the 1970s, epitomised in part by the increase in TV shows featuring kung fu and other Asian stylings.\n\nThe Water Margin played to this trend, presenting a sword and magic version of the 13th-century Chinese epic by Shih Nai-an, relating the tale of 108 reborn knights who fight tyranny from their base in the marshlands of the Lian Shan Po.\n\nThe series followed their charismatic leader, Lin Chung, in his struggles against corrupt government official Kao Chiu. As the series progressed, more people fell foul of Kao Chiu and joined Lin Chung to fight against the government.\n\nEpisodes featured numerous fights and battles, humans with apparent superpowers – expert fighters, unbelievable strength, and so on – and captured the hearts and minds of a generation.\n\nThe original Japanese series was made in 1973, but it was the David Weir BBC version in 1976 that brought the show to a western audience.\n\nWeir adapted the Japanese scripts, writing English dialogue to fit the mouth movements of the cast, rather than translating the Japanese scripts word for word.\n\nThis led to the show having near-perfect lip synchronisation, which made it more accessible to the UK audience.\n\nEnglish voices came from Burt Kwouk (who provided the narration), Michael McClain (Lin Chung), Miriam Margolyes (Hu San-Niang), Peter Marinker, Sean Lynch, David Collings and Simon Lack (amongst other).\n\nLin Chung\n\nAtsuo Nakamura\n\nKao Chiu\n\nKei Sato\n\nWu Sung\n\nHajine Hana\n\nHu San-niang\n\nSanae Tschida\n\nHsiao Lan\n\nYoshiyo Matuso\n\nEnglish Voices\n\nBurt Kwouk\n\nMichael McClain\n\nMiriam Margolyes\n\nPeter Marinker\n\nDavid Collings\n\nSimon Lack\n\nSean Lynch\n\nElizabeth Proud\n\nTrevor Martin\n\nLinks\n\nDubbing The Water Margin – Video clip from Nationwide at BBC Archive"}], "David Collings' first television appearance was in the BBC's Play of the Month in 1965.": [{"url": "https://www.theguardian.com/stage/2020/mar/26/david-collings-obituary", "page_content": "After a spectacular start to his television career in the 1960s, when he played leading roles in two classics by Dostoevsky, the actor David Collings, who has died aged 79, became a cult favourite of sci-fi fans with weird appearances in UFO (produced by the Thunderbirds team of Gerry and Sylvia Anderson), three Doctor Who sagas and the 1979 supernatural detective series Sapphire and Steel, co-starring Joanna Lumley and David McCallum.\n\nAlthough he started out on the stage, Collings did not consolidate his reputation there until completing more than a decade of television stardom, after which he was in a string of important roles for the Royal Shakespeare Company.\n\nAt the Open Air theatre in Regent’s Park he was a genuinely funny Polonius opposite newcomer Damian Lewis’s firebrand Hamlet in 1994, directed by Tim Pigott-Smith; he had first played a tetchy but benignly well-meaning Polonius for an RSC touring production with Philip Franks in 1987.\n\nCollings was a fine featured, red-haired actor with sensitive blue eyes who was equally good at playing neurotic and sweet-natured characters. On television he also ran a good line in eminent characters from history: Percy Grainger in Ken Russell’s Song of Summer (1968), Sir Anthony Babington in Elizabeth R (1971), John Ruskin in The Love School (1975), William Wilberforce in The Fight Against Slavery (1975) and William Pitt in Prince Regent (1979).\n\nHe was born in Brighton, East Sussex, to George Collings, a greengrocer, and his wife, Lillian (nee Parsons). At Varndean grammar school he enjoyed acting but had no thoughts of setting out to be a professional actor and, on leaving, started work as a designer in lettering, inheriting that interest from his father, a keen artist. From 1960 he was happily involved in amateur dramatics for the Withdean Players and the Lewes Little theatre, but then was recommended by the actor Freda Dowie to the director David Scase, who had been appointed to run the Liverpool Rep.\n\nAfter six months in rep, Collings found himself pitched into television through another unsolicited recommendation, this time from the actor John Slater, who thought he might be suitable casting in a 1964 Play of the Week presentation of Crime and Punishment. Thus he found himself playing the impoverished tragic hero, Raskolnikov, murderer of an old pawnbroker, in a three-and-a-half hour existential epic alongside Steven Berkoff, Peter Bowles, Julia Foster and Sylvia Coleridge.\n\nFive years later, in 1969, he was in another mighty Dostoevsky production, a BBC version in six episodes of The Possessed, as the charismatic rabble-rouser Pyotr Verkhovensky, alongside Rosalie Crutchley, Joan Hickson and Angela Pleasence. In the same year he was the Clerk in a BBC adaptation in seven long episodes of Chaucer’s Canterbury Tales, with Barbara Jefford as the Wife of Bath and Barry Linehan as the Miller.\n\nHe made a rare feature movie appearance as a lovable Bob Cratchit in the musical Scrooge (1970), with Albert Finney, in the same year as he was captured by aliens and imbued with superhuman powers in UFO. In Doctor Who he was an alien himself, in a rubber mask, with ideas of blowing up the Cybermen with a home-made rocket in 1975; a robot-phobic, Poul, in a 1977 narrative that found him crawling round the floor and sobbing; and in 1983, Peter Davison having succeeded Tom Baker in the title role, he was mistaken for the good doctor before mutating into a mutant with a wild spaghetti hairstyle.\n\nCollings as Bob Cratchit in the 1970 film Scrooge, with Frances Cuka as his wife. Photograph: Allstar/Waterbury\n\nPausing only to play Legolas in Lord of the Rings on BBC Radio 4 in 1981, and a guest appearance in the final wipe-out episode of Blake’s 7, Collings joined the RSC for the first time as Newman Noggs in the 1985 revival of David Edgar’s Nicholas Nickleby on tour and on Broadway. He also appeared in a star-studded chorus in the fine Don Taylor television script of Sophocles’ Oedipus (1986), with Michael Pennington, Claire Bloom and John Gielgud.\n\nFor the RSC subsequently, between 1996 and 2001, he played Thomas Cranmer in Henry VIII, Baron de Charlus in Tennessee Williams’s Camino Real, Count Lerma in Schiller’s Don Carlos, Sir Politic Would-Be in Ben Jonson’s Volpone, Cardinal Pandulph in King John and Sancho in Lope de Vega’s Madness in Valencia. You could not devise a more varied roster of roles, but he discharged them all with a bitter charm and watchful, wary eye.\n\nIn this millennium, he played a neat double of Sir Henry Green and the Duke of Surrey in Kevin Spacey’s Richard II (2005), directed by Trevor Nunn at the Old Vic, and graced a startling revival of Middleton and Rowley’s Jacobean shocker The Changeling (2006) for Declan Donnellan’s Cheek by Jowl company at the Barbican; the cast also included Will Keen, Olivia Williams and an unknown but tremendous Tom Hiddleston.\n\nA favourite “job” was appearing with his son, Samuel, in Toby Frow’s 1950s revival of Marlowe’s Edward II at the Royal Exchange, Manchester, in 2011; he was old Mortimer and Matrevis while Sam doubled as the king’s lover, Piers Gaveston, and his poker-wielding murderer, Lightborn.\n\nCollings was married firstly to Deirdre Bromfield, whom he met at the Lewes Little theatre, in 1962 (they divorced in 1975), and secondly to the actor Karen Archer in 1983, from whom he was separated, although they remained close friends. He is survived by Karen, by their children, Samuel and Eliza, his daughter, Kate, from his first marriage, and his sister, Nola. He was predeceased by Deirdre and two of their children, Matthew and Bethian."}, {"url": "https://timenote.info/en/David-Collings", "page_content": "David Collings (4 June 1940 - 23 March 2020) was an English actor.\n\nIn an extensive career he appeared in countless roles on stage, television, film and radio as well as various audio books, voiceovers, concert readings and other work.\n\nHe garnered a following through his numerous appearances in cult sci-fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as voicing the titular character in the series Monkey and Legolas in the classic BBC Radio 4 adaptation of Tolkien's The Lord of the Rings.\n\nBiography\n\nCollings was born in Brighton on 4 June 1940.\n\nHe died aged 79 on 23 March 2020.\n\nCareer\n\nFilm and television\n\nCollings's screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television). The production was recorded live.\n\nHe has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), Richard Simmons in The Shadow of the Tower (1972), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975, he portrayed William Wilberforce in The Fight Against Slavery, and he starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire & Steel TV adventures.\n\nHe appeared in the TV series Danger Man, Mystery and Imagination, UFO (episode \"The Psychobombs\") and Gideon's Way; in the latter, he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rodgers and others.\n\nIn 1981, he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series.\n\nHe voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people.\n\nHe is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989, he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including as Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.\n\nHe has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio\n\nOn radio, he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre\n\nCollings's career on stage began with seasons at the storied Liverpool Rep., and has since taken him all over the world with leading companies including the National Theatre, the Royal Shakespeare Company and Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays.\n\nHe played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nPersonal life\n\nCollings had three children, Samuel, Eliza and Kate."}, {"url": "https://wiki2.org/en/David_Collings", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nEnglish actor (1940–2020)\n\nDavid Collings (4 June 1940 – 23 March 2020)[1] was an English actor. In an extensive career he appeared in many roles on stage, television, film and radio, as well as various audio books, voiceovers, concert readings and other work. He garnered a following through his numerous appearances in cult sci-fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as dubbing the titular character in the series Monkey and Legolas in the classic BBC Radio 4 adaptation of Tolkien's The Lord of the Rings.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 2 057 3 089 11 779\n\nVarious - Don't Break Down (David Collings)\n\nMonkey (TV Series) Opening Song, Cast then and now\n\nDavid Ladd discusses his father , Alan Ladd and Shane. Transcription\n\nBiography\n\nCollings was born in Brighton on 4 June 1940.\n\nFilm and television\n\nCollings's screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television).[2] The production was broadcast live. He has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), Richard Simmons in The Shadow of the Tower (1972), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975, he portrayed William Wilberforce in The Fight Against Slavery, and he starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire & Steel TV adventures.[3] He appeared in the TV series Danger Man, Mystery and Imagination, UFO (episode \"The Psychobombs\") and Gideon's Way; in the latter, he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rodgers and others. In 1981 he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series. He voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people. He is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.[4] He has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio\n\nOn radio, he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.[5]\n\nHe was Mr Carlyle in Radio 4's 7-episode serial dramatisation of East Lynne by Mrs Henry Wood, first broadcast in June 1987.[6]\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre\n\nCollings was described by The Stage as a \"stalwart of the National and RSC\".[7] His career on stage began with seasons at the Liverpool Rep and subsequently took him all over the world with leading companies including Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays. He played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nPersonal life\n\nCollings had three children, Samuel, Eliza and Kate.\n\nHe died aged 79, on 23 March 2020.[8][9]\n\nFilmography\n\nReferences"}, {"url": "http://www.monkeyheaven.com/dubbing_davidc.html", "page_content": "David Collings\n\nSad news [23 March 2020] David Collings sadly passed away on 23 March 2020, aged 79.\n\nDavid's dubbed English voice for Monkey, not to mention David Weir's faultless English adaptation of the series, was hugely significant in bringing the charm of Monkey to an audience outside Japan.\n\nEven Masaaki Sakai, Monkey himself, was a fan - he reported watched the English-dubbed version of the first episode in 2000 and remarked at how similar David Collings' voice was to Masaaki Sakai's voice of Monkey.\n\nHis contribution to cult television was immense - including other TV shows which I was a huge fan of, such as Doctor Who, and Sapphire & Steel.\n\nI am extremely grateful for getting the chance to meet David Collings in person in 2004, when he reprised his role as the voice of Monkey, for the 13 unseen Monkey episodes.\n\nI would like to pass on my condolences to his family on behalf of Monkey fans all over the world."}, {"url": "https://thedoctorwhocompanion.com/2020/04/08/david-collings-1940-2020/", "page_content": "David Collings, the versatile stage and screen actor, and one of Doctor Who’s most popular guest stars, has died at the age of 79.\n\nHe appeared in no less than three stories spanning the Fourth and Fifth Doctors’ incarnations. In Revenge of the Cybermen, he was hidden behind a mask but still made an impression as Vorus, full of pride and aggression as he sought to defend his people.\n\n1977’s The Robots of Death was perhaps his most memorable Doctor Who appearance, as Poul, an undercover agent who succumbed to a paralysing fear of the robots which were steadily eliminating the crew of the Sandminer.\n\nLater, in 1983’s Mawdryn Undead, he took the title role of the character who begged the Doctor to give up his future lives so that his people may die, and was himself mistaken for the Doctor by Nyssa and Tegan.\n\nIndeed, Collings was one of those actors whose names often came up when fans pondered suitable actors to be cast as the Doctor. He would briefly take on the part in Big Finish’s Full Fathom Five in their Doctor Who: Unbound range. Further Big Finish appearances followed, including a return to the part of Poul for The Robots, a spin-off from The Robots of Death.\n\nThere was, of course, far more to Collings’ acting career than Doctor Who. He was no stranger to distinguished roles in the theatre including in RSC productions of Henry VIII, Don Carlos, Volpone, and King John.\n\nHe was something of a specialist in playing characters from history including Sir Anthony Babington in Elizabeth R, John Ruskin in The Love School, William Wilberforce in The Fight Against Slavery, and William Pitt in Prince Regent.\n\nA regular on television screens, particularly during the 1970s and 1980s, Collings had a number of sci-fi and fantasy drama credits. Appearing alongside Joanna Lumley and David McCallum he played Gold, colleague of the enigmatic Sapphire and Steel. He played Deva in the memorably bloody final episode of Blakes 7 in 1981. And viewers of a certain age will remember his vocal talents as the dubbed voice of the title character in the Chinese folk-tale adaptation, Monkey.\n\nNon-genre TV work included Dr. Finlay’s Casebook, By the Sword Divided, and Miss Marple. On radio, Collings was heard as Legolas in the enduringly popular BBC dramatisation of The Lord of the Rings.\n\nA regular guest at conventions and signings, David Collings was held in high regard by many in the Doctor Who community. He died suddenly in March 2020. Our sympathies to his family and friends.\n\nLike this: Like Loading..."}, {"url": "https://www.telegraph.co.uk/obituaries/2020/05/18/david-collings-actor-made-name-science-fiction-series-doctor/", "page_content": "David Collings, who has died aged 79, was a Doctor Who fans’ favourite after taking three roles in the classic television science fiction series; he first appeared as Vorus, power-mad leader of the guardians of the mines on Voga, the “planet of gold”, in the 1975 adventure “Revenge of the Cybermen”, determined to blow up the Time Lord’s enemies with his Skystriker rocket.\n\n“I was a sort of scientist/politician packed into a rubber mask and thinking, ‘Thank God they can’t see what I look like!’” Collings told the writer Alan Stevens. “In the end, he gets to fire his big rocket but then dies in the process.”\n\nThe actor was back two years later in “The Robots of Death”, his thick mop of red hair clearly visible this time while wearing what he described as a “very butch” costume. The role was Poul, a mining company’s undercover agent who proves useless – it emerges he has a fear of robots. In portraying the character’s breakdown, Collings memorably crawls around the floor sobbing."}, {"url": "http://www.kaldorcity.com/people/dcinterview.html", "page_content": "Silver Jubilee\n\nThis is an extended version of an interview that previously appeared in issue 329 of Doctor Who Magazine, dated 30th April 2003.\n\n25 years on from his first Doctor Who appearance in The Robots of Death, Sapphire and Steel star David Collings is back in the fold for the latest Kaldor City audio drama Hidden Persuaders. The three-times Doctor Who guest artist took time out from recording to talk to Alan Stevens about cities of gold, robot wars and playing undead...\n\n\"You know, I didn’t really set out to become a professional actor at all,\" says David Collings. \"I was invited. Sounds silly, doesn’t it? But it’s true. While appearing in amateur productions during the early 1960s, I was seen by a fine actress called Freda Downing, and she rather kindly recommended me to a director called David Skace. He had recently taken over the Liverpool Repertory Theatre, and he rang me and asked if I would like to turn professional and join his company. I told him to bugger off and put the phone down on him, but fortunately he rang back, and that's really how it all started.\"\n\nDavid pauses for a moment. \"You know, I don’t normally give interviews, because I’m usually asked about things I don’t remember!\"\n\nOne thing David does recall, however, is his first work for television. \"I had been playing at the Liverpool Rep. for about six months when this wonderful actor called John Slater recommended me to Associated Rediffusion Television, who were about to do a three and a half hour version of Crime and Punishment. I went to see them and was offered the part of Raskolnikov. That got me into television, where I was then trapped for many years. Well, I say trapped, but it was actually a delightful place to be. So there you are. I didn’t even go to Drama School, which I suppose is obvious to anyone who sees any of my performances.\"\n\nDavid's first science fiction appearance was in the Gerry Anderson live action series UFO.\n\n\"The episode was called 'Psychobombs', and I played this poor fellow who had been kidnapped by aliens and turned into a human explosive. I don't remember a lot about it, but I do recall that they had built this trick wire fence, and I was supposed to cut my way through it with a karate chop. Anyway, they got a bit upset with me because, although they weren't ready, I thought I heard someone say 'Action,' and chopped away, which then meant they had to build another fence.\"\n\nFor a tall, powerfully built man, who has spent the best part of forty years playing major roles on stage, screen and television, David Collings comes across as surprisingly modest and self-deprecating. In fact, he seems a million light years away from the ranting, power-mad character he played in the 1975 Doctor Who adventure \"Revenge of the Cybermen\". \"Yes, in that story I was a sort of scientist/politician, packed into a rubber mask, and thinking, ‘Thank God they can’t see what I look like!’ We certainly had a lot of laughs while rehearsing for that one. I like to laugh. You can’t take this business too seriously, can you? Now, if I recall, I played an alien [Vorus] from Voga, the Planet of Gold, who wanted to blow up the Cybermen with a rocket he had built called the Skystriker. Anyway, in the end he gets to fire his big rocket, but then dies in the process. Another character shoots him.\" David clutches his back with one hand, and, reaching out with the other, proclaims, \"My Skystriker! My glory!\" Dropping out of character, he continues, \"And then he falls down dead, and that was the end of that. Only it wasn’t, because soon after, and I don’t know why, they asked me back to do 'The Robots of Death'.\"\n\nCould the reason be that both stories were directed by Michael E. Briant?\n\n\"I’d prefer to think that I got the job on merit,\" grins David, \"But, no, I think you’re probably right. I did a lot of things for Michael Briant. Maybe he found me easy to get along with. I worked with him a great deal. He looked about twelve years old at the time, but he was very good, and that of course was the story with those very pretty, but rather murderous robots in.\"\n\nDavid was cast as Chief Mover Poul and was called upon to wear a quite elaborate costume. \"Very butch, wasn’t it?\" David remarks. Did he have any idea what the costume would have looked like before taking on the part? \"Oh, yes, certainly, you get to see drawings of your costumes when you start. The designer brings his or her sketches along, so you get to know roughly what you’re in for. I remember the costume I wore was quite flimsy, but to be fair I thought it matched the story rather well. It had to fit with the style of that particular show and was designed to go with the décor of the set. It was quite a decadent society they were showing, and I think it was put over very well through the general look.\"\n\nHowever, for David, seeing the costume designs wasn’t the most important factor in developing the character of Poul. \"It was of some help, I suppose, but really I’m the sort of actor who likes to work from the inside out with a character. I mainly work from what I find in the script and then plan from that what I intend to do with the part, and the direction in which I want to take it. Sometimes you might get inspired and change certain things in your performance on the day, but you can only rely on inspiration up to a certain point. It’s got to come from the script, not the costume you’re wearing.\"\n\nDuring the story it is revealed that Poul suffers from Robophobia, a morbid dread of robots. As a consequence, David had a number of scenes where he had to crawl around the floor, sobbing. \"I didn’t find that difficult at all,\" smiles David, \"It comes quite naturally to me.\"\n\nAlthough David’s first Doctor Who had been with Tom Baker, it was only on \"The Robots of Death\" that they really got to know each other. \"With the first story, I didn’t have many scenes with Tom, but with the second, that was different, and so we spent a great deal of time together rehearsing up at North Acton. We also spent a lot of time, as I recall, in the pub.\"\n\nBetween this story and his final brush with Doctor Who, David was to play another memorable role, in the supernatural detective series Sapphire & Steel. \"The head of casting sent me a script and asked if I was interested. To be honest, although I read through the script a number of times, I couldn’t make head nor tail of it. All very complex and mysterious. I didn’t understand a word, but it seemed like a great deal of fun to do and it was a nice part to play, so that’s why I agreed to do it.\"\n\nThis was the first time that David was to meet either of the show’s stars. \"I’d never worked with Joanna Lumley or David McCallum before. I got on with Joanna particularly well, and we’ve remained firm friends ever since. The character I played, Silver, was what they called a Specialist. He was a kind of technician who was able to conjure things out of thin air. In fact I invented all of that. All those sort of magic tricks he used to do. Do you remember that glowing doorknob in my first story? That was one of mine. In the last story I had this business with a fruit machine. I had this special device that allowed me to hit the jackpot all the time. ‘I’m not enjoying this game at all,’ says Silver, and Sapphire replies, ‘That’s because most times you’re supposed to lose.’ Lovely stuff. I also remember that on that story, which was my second one, we were underrunning, and so they told me to improvise a scene with Joanna, but they didn’t tell her that this was what we were doing. She thought I’d gone mad I think, but she kept up with the improvising anyway. Very game girl, Joanna.\"\n\nDavid recalls that there were a lot of alterations made to the scripts during recording. \"There was endless rewriting. David McCallum would always insist on rewriting everything, which of course upset the writers. I also think it wasted a lot of time, and it didn’t make any more sense after he had rewritten them then they did before.\"\n\nAt one point, there were even plans for David’s character to become a permanent fixture of the series, making it, perhaps, Sapphire, Silver & Steel? \"I think Silver would have come third, Sapphire, Steel & Silver. The television company were very keen on the idea and they wanted to do another series, but then Joanna and David decided that they’d had enough of it by then, and didn’t want to do any more. The story where they were whirled off into space, that became the last one. I think it was more David McCallum then Joanna really who wanted it over. I was very keen for it to go on because there was a very good relationship developing between Sapphire and my character, which of course might have been part of the problem with David.\"\n\nHaving appeared in the last episode of Sapphire & Steel, David was soon approached to appear in the last episode of Blake’s 7. \"I was sent this script where I had a lot of scenes with Blake, and I thought, ‘This looks promising,’ and then I got to the last page and guess what? Blake and everyone else, including myself, is shot dead! I always try and do a good death,\" quips David. \"For that one I dived into the wall, and almost brought the set down. Oh, yes, you can always rely on me to finish off any series that I’m in.\"\n\nDavid’s final appearance in Doctor Who was as the title role in the 1983 adventure, \"Mawdryn Undead\". \"Well, I had hysterics doing that. I mean we were in hysterics all through rehearsals, including the director. I remember him saying, ‘Look, we’ve all got to take it seriously when the producer comes along to watch,’ but then if it’s not fun to do it’s not worth doing.\"\n\nDuring recording, David had to undergo two extensive make-ups jobs. \"For the first one I had to look as if I had been burnt very badly. In fact so badly, I could be confused with Peter Davison! Sheelagh Wells did the make-up and she was very good. It took several hours to do, but that was all right as you can always read the paper and chat. The problem is when you go to lunch afterward which can be a little embarrassing, walking around pretending to be a burnt Peter Davison. For the second make-up I had to stop being Peter Davison and turn into a mutant instead, with all this spaghetti falling out of my head. Again, as Mawdryn wasn’t in very good health, I had to do a lot of crawling around on the floor. It’s a recurring theme of my career, that!\"\n\nDavid has recently returned to science fiction through his involvement with the thriller audio CD series Kaldor City. \"I have Louise Jameson to thank for that. The BBC had written to me asking if I’d like to attend a Doctor Who convention in Manchester as part of the promotional launch for 'The Robots of Death' DVD. I was going to say no, but then Louise said to me, ‘Come on, I’m doing it, so why don’t you come and do it too.’ So I did, and actually it was quite enjoyable. I had a really nice time, and it was there that I was first approached to come back as Poul, my character from 'The Robots of Death', in Kaldor City. It’s always nice to have somebody ask you back to play the same role, it means they must like you.\"\n\nHow does David think the character of Poul has developed since he last played him?\n\n\"I’m very pleased with what’s been done with the character and I think it’s a very clever twist on what has gone before. No more sobbing and hiding under tables. Poul’s much happier now-- as he’s gone completely mad.\"\n\nFinally, I wondered if David was aware that he was always a hot tip in Doctor Who fan circles to become the next Doctor. \"Well, I’ve never heard that before. Is that why the BBC stopped making it-- because they were afraid I might become the next Doctor Who?\"\n\nI hastily deny that this was the reason.\n\n\"David Collings, the next Doctor Who. Now, would I have done it? Well, if the money was right and--\" David suddenly shakes his head and laughs, \"No, no, of course I would have done it. It would have been delightful.\"\n\nImage copyright Andy Hopkinson 2003"}, {"url": "https://www.heraldscotland.com/opinion/18377426.obituary-david-collings-stage-tv-film-actor-took-many-roles-royal-shakespeare-company-productions/", "page_content": "Born: June 4, 1940;\n\nDied: March 23, 2020.\n\nDAVID Collings, who has died of natural causes aged 79, was a fine character actor who could imbue the roles he played with watchful intelligence, prowling intensity, sardonic humour and detached melancholy as required. His soulful eyes could ignite vividly on his striking, yet sometimes doleful, countenance - under a lustrous mane of red hair - giving him an enigmatic, otherworldly quality that made him especially useful to science-fiction productions.\n\nAs Silver in the beguiling series Sapphire and Steel (1981-82) he was an eccentric, mercurial foil to David McCallum and Joanna Lumley. A popular contributor to Doctor Who – memorably guest-starring in three stories between 1975-83 – his powerful yet nuanced performances helped to ground the fantastical with requisite realism. Actor Mark Gatiss has described him as “the greatest Doctor Who we never had”; Collings finally got to play his own incarnation of the Time Lord in an audio adventure for Big Finish (2003), capitalising on his vast experience in radio.\n\nIn BBC Radio 4’s epic and strongly cast version of The Lord of the Rings (1981) he played Legolas, and latterly he was the perfect audiobook reader for the haunting stories of MR James.\n\nHis dusky yet melodic voice, perfectly modulated, also adopted an amusingly boorish bravado for the the title character in Monkey (1979-80),the dubbed English language version of the cult Japanese TV series.\n\nDavid Cressy Collings was born in Brighton, the son of a greengrocer. Upon leaving Varndean Grammar School he worked in retail before becoming an apprentice draughtsman at a design practice.\n\nHe joined the amateur company Lewes Little Theatre, partly to help with a speech impediment, and was spotted by actress Freda Dowie, who recommended him to the Liverpool Repertory Theatre. Whilst there the actor John Slater suggested him for a three-hour, live TV production of Crime and Punishment (1964) - and so, at 24 and with no formal training, he played his first leading television role.\n\nMore notable parts followed, in Ken Russell’s Song of Summer (as an unforgettable Percy Grainger, 1968), Elizabeth R (1971, with Glenda Jackson), the BBC Shakespeare Julius Caesar (an intense Cassius, 1979), The Prince Regent (as William Pitt, 1979), A Tale of Two Cities (1980), Dark Towers (terrifying a generation of children as Lord Dark, 1981), and Press Gang (1989-93).\n\nHe also guest-starred in most popular series from Z-Cars (1965) to Holby City (2015) via UFO (1970), The Professionals (1978) and Blake’s 7 (1981). On film he was an excellent Bob Cratchit to Albert Finney’s eponymous miser in Scrooge (1970).\n\nHe was a gifted classical stage actor - his Mercutio at St George’s Theatre, Tufnell Park (1976) was, according to Kenneth Branagh, who watched it as a schoolboy, “thrilling” and “brilliant”.\n\nHe spent several seasons with the Royal Shakespeare Company, where his insightful character work benefited several good parts over the decades - a favourite engagement was touring with them from Stratford to Broadway in the 1985 revival of Nicholas Nickleby with his wife, Karen Archer, also in the cast, and their infant twins Samuel and Eliza (both destined to be actors themselves) in tow. He and Samuel also shared the stage in the Manchester Royal Exchange’s 2011 production of Edward II.\n\nHe is survived by Karen, Samuel and Eliza, his sister Nola and step-daughter Juliet and daughter Kate from his earlier marriage, to Deirdre Bromfield. Their other two children, Matthew (12) and Bethian (aged just a few months), predeceased him."}, {"url": "https://www.wikizero.com/en/David_Collings", "page_content": "From Wikipedia the free encyclopedia\n\nEnglish actor (1940–2020)\n\nDavid Collings (4 June 1940 – 23 March 2020)[1] was an English actor. In an extensive career he appeared in many roles on stage, television, film and radio, as well as various audio books, voiceovers, concert readings and other work. He garnered a following through his numerous appearances in cult sci-fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as dubbing the titular character in the series Monkey and Legolas in the classic BBC Radio 4 adaptation of Tolkien's The Lord of the Rings.\n\nBiography [ edit ]\n\nCollings was born in Brighton on 4 June 1940.\n\nFilm and television [ edit ]\n\nCollings's screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television).[2] The production was broadcast live. He has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), Richard Simmons in The Shadow of the Tower (1972), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975, he portrayed William Wilberforce in The Fight Against Slavery, and he starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire & Steel TV adventures.[3] He appeared in the TV series Danger Man, Mystery and Imagination, UFO (episode \"The Psychobombs\") and Gideon's Way; in the latter, he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rodgers and others. In 1981 he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series. He voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people. He is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who [ edit ]\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.[4] He has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio [ edit ]\n\nOn radio, he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.[5]\n\nHe was Mr Carlyle in Radio 4's 7-episode serial dramatisation of East Lynne by Mrs Henry Wood, first broadcast in June 1987.[6]\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre [ edit ]\n\nCollings was described by The Stage as a \"stalwart of the National and RSC\".[7] His career on stage began with seasons at the Liverpool Rep and subsequently took him all over the world with leading companies including Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays. He played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nPersonal life [ edit ]\n\nCollings had three children, Samuel, Eliza and Kate.\n\nHe died aged 79, on 23 March 2020.[8][9]\n\nFilmography [ edit ]"}, {"url": "https://alchetron.com/David-Collings", "page_content": "David Collings (born 4 June 1940) is an English actor. In an extensive career he has appeared in countless roles on stage, television, film and radio as well as various audio books, voice over, concert readings and other media.\n\nHe has garnered a following due to his numerous appearances in cult Sci-Fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as voicing the titular character in the popular, long-running series Monkey.\n\nBiography\n\nCollings was born in Brighton on 4 June 1940.\n\nFilm and TV\n\nCollings' screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television).The production was recorded live.\n\nHe has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975 he portrayed William Wilberforce in The Fight Against Slavery, and starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire and Steel TV adventures.\n\nHe appeared in the TV series Danger Man, Mystery and Imagination, UFO and Gideon's Way- the latter of which he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rogers and others.\n\nIn 1981, he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series.\n\nHe voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people.\n\nHe is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including as Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.\n\nHe has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio\n\nOn radio he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre\n\nCollings' career on stage began with seasons at the storied Liverpool Rep., and has since taken him all over the world with leading companies including the National Theatre, the Royal Shakespeare Company and Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays.\n\nHe played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nSelected filmography\n\nSong of Summer (1968)\n\nJoanna (1968)\n\nScrooge (1970)\n\nFor the Love of Ada (1972)\n\nMahler (1974)\n\nHennessy (1975)\n\nThe Thirty Nine Steps (1978)\n\nJulius Caesar (1979)\n\nThe Outsider (1980)\n\nTangiers (1982)\n\nPersuasion (1995)\n\nThe Invisible Woman (2013)\n\nPersonal life\n\nCollings has three children, Samuel, Eliza and Kate."}]}