{"David Collings played the villainous Vorus in the 1977 serial The Sun Makers of Doctor Who.": [{"url": "https://www.imdb.com/title/tt0562960/reviews", "page_content": "6 /10\n\nWarning: Spoilers\n\nLanding on Pluto in the far flung future the Doctor is amazed that the inhabitants of Earth have colonised the planet . There is a heavy price to his cost and finds that the human race is now under the jackboot of an oppressive elite clique who are taxing the human race to death\n\n\n\nOne of the great things - perhaps the greatest thing - about DOCTOR WHO is you don't know what you're going to get next . The previous story of season 15 was no holds barred horror which was very good at what it as attempting to do . This story is a million miles away from that one . There's no bug eyed monsters , no creeping around dark corridors apprehensive of what unearthly terrors lie ahead . Here we have biting satire with all the subtilties of balloons at a funeral . If nothing else variety is the spice of life and we're getting a feast in season 15 even though it might be an acquired taste\n\n\n\nThe genesis of this story came about because Robert Holmes had a run in with the tax office . The pen is mightier than the sword and Holmes sharpens his rapier to disembowel taxation . That said more of a bludgeon rather that a sharp incisive weapon . \" Does everyone run from the tax man ? \" asks Leela which turns out to be rhetorical question . The more things change the more they stay the same . Just in case someone might have missed the point there's a corridor called p-45 and the fascist police are called \" The Inner Retinue \" . If you want to be cerebral then just misquote Marx and say \" The workers have nothing to lose apart from their claims \" . It's DOCTOR WHO meets Monty Python all the way down to the fate of a villain who suffers an OTT fate by turning in to a mannequin as he's thrown off a roof\n\n\n\nOn its own The Sun Makers is hardly DOCTOR WHO at its best being a rather drab looking story with a BLAKES 7 feel compounded with Michael \" Vila \" Keating in a supporting role . The bare faced cheek of the script will also split the audience down the middle , But viewed in the context of the other 160 or so stories from the classic era it just goes to show the flexibility of the show and why it's still being broadcast 50 years after it first hit the small screen"}, {"url": "https://www.imdb.com/title/tt0811739/reviews", "page_content": "10 /10\n\nReview of all 4 episodes:\n\n\n\nThis story is an adventure which is a political satire of tax, greedy capitalism and bureaucracy. It is full of comedic moments and underlying witty observation. It is written by the great Robert Holmes and this is also very sadly his last story as Script Editor. His time in that role saw the most consistently great quality of any era and his talent as both writer and script editor are second to none. Despite the push to move the series towards lighter, more comedic content and away from horror and darkness, Holmes cleverly manages to make this story comedic whilst maintaining some darkness and intelligent, sharp witted edge.\n\n\n\nI agree with many observations I have read over the years that this story is an attack on greedy capitalist extreme right-wing politics and on bureaucracy. This is shown in the obsequious Gatherer and the clear extreme capitalism of the villainous wealthy overlords with oppressed workers paying taxes to fund the sheer greed of the elite until the downtrodden workers unite against them. It works very well indeed both as sheer fun entertainment and as an amusing satire.\n\n\n\nThe Doctor, Leela and K-9 arrive in a future Pluto colony controlled by wicked tax collectors who control and oppress the hard working population, exploiting them completely and secretly sending the profits to their unknown alien masters. The Doctor shakes things up.\n\n\n\nThere are numerous clever tax linked jokes such as names of corridors being tax form titles and the silliness and cruelty of aspects of the system are successfully made fun of. There is much enjoyment to be had in this adventure and there are some serious points made too. The first two parts are excellent and slightly stronger than the final two parts but it is all high quality and good fun. An example of when humorous stories can work very well. I cannot say the same for the adventure which followed next when the departure of Holmes was made immediately noticeable. It is such a shame he left. Thankfully he wrote stories from time to time but his loss at the helm hurt the series consistency and diminished its grown up qualities.\n\n\n\nParts 1 & 2 - 9.5/10, Parts 3 & 4 - 9/10. Overall - 9.25/10."}, {"url": "https://www.imdb.com/title/tt0811741/reviews", "page_content": "Interesting to read about this serial afterwards, and to understand the context that one of the people behind it had issues with the tax office and made this dig at them as a result. This produces some slightly amusing puns and produces a serial that has comedy as its core while delivering a standard escape/get caught/escape plot. The problem is that this comedy core is really not up to much. Its value is mostly that it is a surprise to find it on the heels of a few serials in the horror vein; Theo Robertson makes the same observation actually – that the variety of the show is a strength, and I suppose in a way that he is right.\n\n\n\nThis is different from saying that variety can carry a weak serial though, and mostly this is quite weak. The comedy is mostly poor puns and satire which is really farce. There is an enjoyable chunk of ham throughout, and I did enjoy the Collector as a silly character, but it probably wasn't enough to carry four episodes. Around this we get plenty that doesn't work, not just in the comedy but also in the plotting, which is not the best in terms of pacing and story. In the end I wanted it to have much more teeth – not to be more punny or exaggerated, but really have some meat behind the farce. It didn't, and dramatically it has no weight to speak of.\n\n\n\nThe cast do their best with it. Baker seems to have fun with it. Jameson is better, although it does seem she is leaner than ever and increasingly skimpy in her outfits. The long flat corridors used frequently in the serial may look dull, but they mean K9 can play a part in the serial, and he is quite fun and has some good comic timing. Woolf and Leech are great fun; the rest of the supporting cast offer less – but then they also have thinner material.\n\n\n\nAll told, it is amusing, and it is different from the previous serials so stands out a bit. However it is nowhere near funny or clever enough to carry such a weak story. Some fun elements do stick in the mind, and it has a cruel bitterness within it, but it isn't up to much once you spread it over the four episodes.\n\nWas this review helpful? Sign in to vote.\n\nPermalink 1 out of 4 found this helpful."}, {"url": "https://www.denofgeek.com/movies/doctor-who-the-sun-makers-dvd-review/", "page_content": "Doctor Who was a contradiction in 1977. On the surface, it appeared to all and sundry that the show was in rude health. Viewing figures were at an all-time high, Tom Baker had done the impossible and replaced the hugely popular Jon Pertwee in the public’s affections, while the programme itself seemed to have an unassailable slot right at the heart of the BBC’s Saturday night schedule.\n\nScratch the surface, however, and the reality was far less rosy.\n\nThanks to the campaigning antics of Mary Whitehouse, the new Doctor Who production team was under orders to curb the violent excesses of the previous few years and replace it with a more whimsical and comedic fantasy tone.\n\nTo this end, the BBC shuffled the behind-the-scenes team around, replacing producer Philip Hinchcliffe with Graham Williams. A less forceful and controversial character than his predecessor, Williams was soon to learn the full enormity of the problems he’d inherited."}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Recap/DoctorWhoS15E4TheSunMakers", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Recap/DoctorWhoS15E4TheSunMakers\n\nDon't you just hate it when you sneeze in the middle of having a picture taken?\n\nCordo: Praise the company!\n\nMandrel: Stuff the company!\n\nThe One With… the offhand bit of Logan's Run.\n\nWritten by Robert Holmes. This four-episode serial first aired from November 26 to December 17, 1977.\n\nDoctor Who goes all political with this thinly-disguised allegory on the evils of income tax. The TARDIS arrives on the planet Pluto, which in the future has six suns' worth of eternal daylight, a breathable atmosphere and a thriving industrial base. \"The Company\" controls the entire planet and exploits the workers mercilessly, paying peanuts and taxing everything. As soon as the Doctor and Leela step out of the TARDIS, they find a worker about to commit suicide — he'd arranged for his ailing dad to have a nice assisted suicide, then got told the price had gone up by a good 30% and he'd have to work 23 hours a day (he's already working 21). They distract him with a jelly ba—er, licorice allsort, and introduce him to the concepts of freedom and darkness.\n\nThe Doctor and Leela are soon captured by La Résistance, led by Mandrel, and learn that the workforce are being kept calm by a gas piped into the atmosphere. While The Company has a human representative in Gatherer Hade, it is in fact run by alien Usurians, noted for keeping planets in economic servitude. The Doctor is captured, sent on a errand, captured again, almost branded in the face, and eventually convinces La Résistance to stop twiddling their thumbs and start actually resisting the government.\n\nThe Doctor succeeds in switching off the paranoia gas and the workers rise up against The Company and ruthlessly kill the hated Gatherer Hade, while the Doctor does some computer jiggery-pokery to bankrupt it. The Usurian \"Collector\" (a very thinly-veiled Denis Healey parody) is powerless to stop The Company going bust and reverts to his natural form — a harmless fungus.\n\nTropes"}, {"url": "http://www.eyeofhorus.org.uk/content/classicseries/04-baker/revengeofthecybermen.html", "page_content": "DOCTOR WHO CLASSIC SERIES 63-89 Classic Series related sections BIG FINISH audioplays EOH GIVEAWAYS FROM HARTNELL TO MCGANN Reviews based upon DVD, VHS and CD releases EPISODE GUIDE Choose a Doctor Select: FIRST DOCTOR 1963-66 SECOND DOCTOR 1966-69 THIRD DOCTOR 1970-74 FOURTH DOCTOR 1974-81 FIFTH DOCTOR 1982-84 SIXTH DOCTOR 1984-86 SEVENTH DOCTOR 1986-89 EIGHTH DOCTOR 1996 TOM BAKER 1974-81 Choose an Episode Select The Season 12 Scripts Book ROBOT THE ARK IN SPACE THE SONTARAN EXPERIMENT GENESIS OF THE DALEKS REVENGE OF THE CYBERMEN TERROR THE ZYGONS PYRAMIDS OF MARS THE ANDROID INVASION THE BRAIN OF MORBIUS THE SEEDS OF DOOM THE MASQUE OF MANDRAGORA THE HAND OF FEAR THE DEADLY ASSASSIN THE FACE OF EVIL THE ROBOTS OF DEATH THE TALONS OF WENG-CHIANG THE HORROR OF FANG ROCK THE INVISIBLE ENEMY IMAGE OF THE FENDAHL THE SUN MAKERS UNDERWORLD THE INVASION OF TIME THE RIBOS OPERATION THE PIRATE PLANET THE STONES OF BLOOD THE ANDROIDS OF TARA THE POWER OF KROLL THE AMAGEDDON FACTOR DESTINY OF THE DALEKS CITY OF DEATH THE CREATURE FROM THE PIT NIGHTMARE OF EDEN THE HORNS OF NIMON SHADA THE LEISURE HIVE THE LEISURE HIVE - THE MUSIC MEGLOS FULL CIRCLE STATE OF DECAY WARRIORS' GATE THE KEEPER OF TRAKEN LOGOPOLIS FOURTH DOCTOR | REVENGE OF THE CYBERMEN \"...Cybermen can survive more efficiently than animal organisms. That is why we will rule the galaxy....\" STORY PLOTLINE The time ring takes the Doctor, Sarah and Harry back to Nerva, but to a period many thousands of years earlier than their previous visit. The station is currently acting as a beacon warning space traffic of the existence of a new asteroid orbiting Jupiter. This is Voga, also known as the planet of gold. DVD EXTRAS THE COMMENTARY TEAM Elisabeth Sladen - Sarah Jane Smith\n\nDavid Collings - Vorus\n\nPhilip Hinchcliffe - Series Producer\n\nRoger Murray-Leach - Set Designer Unsurprisingly, in the absence of Tom Baker, the commentary was more muted than we have come to expect, with Hinchcliffe being the more proactive contributor and Collings contributing nothing of note. Perhaps, less is more. Recollections from production staff, such as Designer, Roger Murray-Leach, may be more considered (aided by visual material - see the excellent new CGI work contribution for Barry Newberry's work for DOCTOR WHO - THE BRAIN OF MORBIUS) as a stand-alone featurette. Nonetheless, taking time to watch (or re-watch) the story with the commentary track active is essential in order to gain a substantive insight to the making of it, and the singular acid-drops or witticisms are sometimes worth the cost of the DVD itself. On the new Doctor, Philip Hinchcliffe to Elisabeth Sladen: Tom was still working out the relations with you.\n\nElisabeth Sladen: But I think we worked it out on SONTARAN (EXPERIMENT)\n\nPhilip Hinchcliffe: Tom hit his performance at this time.\n\nElisabeth: Tom got right for ROBOT scene 1.\n\nPhilip Hinchcliffe: I like the bits of humour written in by Robert Holmes. Note: With the clean up of the print for this DVD release, you will be able to clearly see several window shop mannequins strewn across the set representing dead bodies. On the technology of the time (1975), Roger Murray-Leach: \"Bluescreen\" was cutting edge then. Note: the \"star background\" seen out of the space station's observation windows are clearly electrical lights. In one sequence, they can be seen \"swaying\" in a line against the black drape. On the design of the cybermen, Elisabeth Sladen: At the time I didn't like the cybermen but they look very good now On seeing again the Cybermat attack on Sarah Jane Smith, Elisabeth Sladen: Oh dear! Michael (the Director) was not happy with it. It took forever. Note: DOCTOR WHO - REVENGE OF THE CYBERMEN was the first VHS release following a supposedly influential \"vote\" by fans at the 1983 Longleat 20th anniversary event. This is discussed further in CHEQUES, LIES AND VIDEOTAPE featurette. On mislabelling the Doctor's trusty electronic device, David Collings: Is that the \"singing screwdriver\".\n\nElisabeth Sladen: Sonic Screwdriver! The Fourth Doctor's characterisation as crafted by Tom Baker, Elisabeth Sladen: Tom played with people in a scene like a cat. On seeing the \"circular logo\" (later often titled \"The Seal of Rassilon, and used in the NEW SERIES as \"Gallifreyan Script\"), Elisabeth Sladen: There's you logo, Murray.\n\nRoger Murray-Leach: Yes. I forgot I did that. On the Doctor's line \"You have no home planet, no influence, nothing. You're just a pathetic bunch of tin soldiers skulking about the galaxy in an ancient spaceship\", Philip Hinchcliffe: I love that line. Must be Bob Holmes that one. On the scripting/plotline construction of DOCTOR WHO, Philip Hinchcliffe: My idea for it was to make it work for the intelligent 12 years old and not for the four or five year old. On recalling a \"boat\" stunt that could have gone wrong, Elisabeth Sladen: Terry Walsh stayed until the end of filming every day, dressed head-to-toe in a wet suit just in case. And I'm glad he did. On the costume & make-up of the Vogan alien race, Philip Hinchcliffe: The Vogans look as if they had Mumps.\n\nDavid Collings: One of them looks like Arnold Ridley from DAD'S ARMY. On the cliffhangers, Philip Hinchcliffe: I paid a lot of attention to it (them). On the use of gold dust as a murder weapon, Elisabeth Sladen: That's how some of the Romans committed suicide - gulped down gold. On discussing how there is within the NEW SERIES is a more \"emotional\" relationship shown between the Doctor and Rose, Philip Hinchcliffe: We felt that there was taboo about how much we could do and show. On the development of Doctor's character after Tom Baker, Roger Murray Leach: Tom was the last eccentric to play the Doctor.\n\nPhilip Hinchcliffe: In later Doctor's it became a bit of a pantomime. On seeing the Cyber Leader attacking the Doctor in episode four, David Collings: Looks like a Swedish massage. On the final scene seeing the Doctor entering the TARDIS, glimpsing just inside the door, Philip Hinchcliffe: I said to people that we shouldn't see inside. To keep the mystery. DVD EXTRAS: FEATURETTES THE TIN MAN AND THE WITCH is a elegantly Agatha Christie-esque title for a workman-like \"making of.\" documentary. However, valuable contributions from former CLASSIC SERIES Producer, Barry Letts and the story's Director, Michael E Briant (who, on his website, claims that the Sonic Screwdriver was his idea during the filming of Troughton's FURY FROM THE DEEP). For the 1970s, Letts was the series' \"architect\" with his influence throughout the Pertwee years and, as he states, for then first year of Tom Baker with incoming Producer, Philip Hinchcliffe shadowing Letts (and, in 1980, Letts shadowed incoming Producer, John Nathan-Turner) as part of the transition process. Letts contribution cannot be overstated. Briant admitted that the script he inherited was not as polished as he had expected (REVENGE was his first of three DOCTOR WHO stories that he directed) and requested both Robert Holmes (Script Editor) and Hinchcliffe to revise it (developing the \"Voga mining theme\" and including a new threat to the Doctor (the mobile bombs). In effect, this featurette is an essay of DOCTOR WHO production on the 1970s, and whilst Hinchcliffe admits that the \"story department\" didn't get it quite right the technical presentations was fitting. LOCATION REPORT - Filmed before any of Tom Baker's episode were shown on BBC 1, this BBC news report is a glorious reminder of the magical eccentricity of the lead actor, and proves that you can lead cybermen to the pub and make them drink. CHEQUES, LIES AND VIDEOTAPE is cringingly too close to home for fans of a certain age. It describes the lengths by which DOCTOR WHO fans, in the 1980s, would go to in order to get their WHO-addictive video fix. Across the country (and stretching across continents at time), in covert operations, fans would seek out a copy of a copy of a copy of a black & white broadcast story, say THE ICE WARRIORS, from a fan who knows a fan who knows \"Steve from the North\" and then would either (1) swap chunks of their WHO collection or (2) pay extortionate amounts of hard cash. NEW SERIES fans may think that this featurette is a spoof but, sadly, in a very witty way, it was true. Honestly, it was so true. DOCTOR WHO - REVENGE OF THE CYBERMEN is, strangely, a \"fan favourite\" and whilst the actual plotline is as scrambled as the braid on a Naval Officer's uniform its performances - naturally, Baker is outstanding - and atmospheric location filming are exceptional for its time. Appreciation must be give to the \"clean-up\" of the mastercopy; it is crisp, clear and intense, showing a clarity that has not been seen since the 1975 original broadcast. It is a perfect \"entry level\" CLASSIC SERIES DVD for new fans of the NEW SERIES. EOH CONTRIBUTOR MATTHEW WALTER EOH RATING\n\n\n\n\n\nINFORMATION\n\n\n\nDVD Release 09.08.2010"}, {"url": "https://guide.doctorwhonews.net/person.php?name=DavidCollings", "page_content": "David Collings is an English actor. He has played various roles on television, including the leading dramatic role in Fyodor Dostoyevsky's Crime and Punishment in 1964 (with Associated-Rediffusion Television).\n\nCollings has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975 he portrayed William Wilberforce in the The Fight Against Slavery, and starred as William Pitt in Prince Regent in 1979.\n\nHe appeared three in the long-running British science fiction television series Doctor Who including Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead. He has also played an alternate Doctor in one of the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five.\n\nCollings returned to the role of Poul, now named Paulus, in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nOn radio he portrayed Legolas in the BBC Radio 4 adaptation of The Lord of the Rings.\n\nHe also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the Sapphire and Steel adventures.\n\nHe also appeared in the TV series Danger Man, Mystery and Imagination, UFO and Gideon's Way in which he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the 1970 film musical adaptation of Scrooge.\n\nHe did the voice acting for the Japanese television series Journey to the West, released in English-speaking countries as Monkey.\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nHe is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye and had a recurring role as the headmaster in Press Gang from 1989-1993.\n\nHe played the parts of Mortimer the Elder and Matrevis in the summer 2011 production of Edward II at the Royal Exchange, Manchester, which also featured Sam Collings.\n\nBiography from the wikipedia article, licensed under CC-BY-SA"}, {"url": "https://scifibulletin.com/2020/03/23/rip-david-collings/", "page_content": "Renowned British stage and screen actor David Collings has passed away suddenly.\n\nThe news was announced by his family earlier today on Twitter.\n\nTo genre fans, Collings is known for his role in key Doctor Who stories, Revenge of the Cybermen, The Robots of Death and Mawdryn Undead, and played an alternate Doctor for Big Finish’s Unbound series. He recetly reprised his character from The Robots of Death for Big Finish’s The Robots series.\n\nHe also played Silver in Sapphire & Steel and appeared in the final episode of Blake’s 7. He was Legolas in the BBC Radio 4 version of Lord of the Rings, and voiced Monkey for the BBC 2 adaptation of the series.\n\nHe had a long and varied stage career including time with the National Theatre and the Royal Shakespeare Company.\n\nShare this: Twitter\n\nFacebook\n\nLike this: Like Loading..."}, {"url": "https://kids.kiddle.co/David_Collings", "page_content": "David Collings (4 June 1940 – 23 March 2020) was an English actor. In an extensive career he appeared in many roles on stage, television, film and radio, as well as various audio books, voiceovers, concert readings and other work. He garnered a following through his numerous appearances in cult sci-fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as voicing the titular character in the series Monkey and Legolas in the classic BBC Radio 4 adaptation of Tolkien's The Lord of the Rings.\n\nBiography\n\nCollings was born in Brighton on 4 June 1940.\n\nFilm and television\n\nCollings's screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television). The production was broadcast live. He has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), Richard Simmons in The Shadow of the Tower (1972), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975, he portrayed William Wilberforce in The Fight Against Slavery, and he starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire & Steel TV adventures. He appeared in the TV series Danger Man, Mystery and Imagination, UFO (episode \"The Psychobombs\") and Gideon's Way; in the latter, he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rodgers and others. In 1981 he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series. He voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people. He is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead. He has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio\n\nOn radio, he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.\n\nHe was Mr Carlyle in Radio 4's 7-episode serial dramatisation of East Lynne by Mrs Henry Wood, first broadcast in June 1987.\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre\n\nCollings was described by The Stage as a \"stalwart of the National and RSC\". His career on stage began with seasons at the Liverpool Rep and subsequently took him all over the world with leading companies including Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays. He played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nPersonal life\n\nCollings had three children, Samuel, Eliza and Kate.\n\nHe died aged 79, on 23 March 2020.\n\nFilmography"}, {"url": "https://alchetron.com/David-Collings", "page_content": "David Collings (born 4 June 1940) is an English actor. In an extensive career he has appeared in countless roles on stage, television, film and radio as well as various audio books, voice over, concert readings and other media.\n\nHe has garnered a following due to his numerous appearances in cult Sci-Fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as voicing the titular character in the popular, long-running series Monkey.\n\nBiography\n\nCollings was born in Brighton on 4 June 1940.\n\nFilm and TV\n\nCollings' screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television).The production was recorded live.\n\nHe has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975 he portrayed William Wilberforce in The Fight Against Slavery, and starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire and Steel TV adventures.\n\nHe appeared in the TV series Danger Man, Mystery and Imagination, UFO and Gideon's Way- the latter of which he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rogers and others.\n\nIn 1981, he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series.\n\nHe voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people.\n\nHe is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including as Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.\n\nHe has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio\n\nOn radio he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre\n\nCollings' career on stage began with seasons at the storied Liverpool Rep., and has since taken him all over the world with leading companies including the National Theatre, the Royal Shakespeare Company and Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays.\n\nHe played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nSelected filmography\n\nSong of Summer (1968)\n\nJoanna (1968)\n\nScrooge (1970)\n\nFor the Love of Ada (1972)\n\nMahler (1974)\n\nHennessy (1975)\n\nThe Thirty Nine Steps (1978)\n\nJulius Caesar (1979)\n\nThe Outsider (1980)\n\nTangiers (1982)\n\nPersuasion (1995)\n\nThe Invisible Woman (2013)\n\nPersonal life\n\nCollings has three children, Samuel, Eliza and Kate."}], "David Collings played the android Kamelion in the 1983 serial Planet of Fire of Doctor Who.": [{"url": "https://www.wikiwand.com/en/Planet_of_Fire", "page_content": "Planet of Fire is the fifth serial of the 21st season in the British science fiction television series Doctor Who, which was first broadcast in four twice-weekly parts on BBC1 from 23 February to 2 March 1984.\n\n1984 Doctor Who serial\n\nIn the serial, the Doctor's old enemy, the renegade Time Lord the Master (Anthony Ainley), plots to use the volcanic gases on the planet Sarn to renew his body after accidentally shrinking himself in an experiment.\n\nPeter Davison's penultimate serial as the Doctor, it marks the departure of Mark Strickson as Vislor Turlough (who makes a brief reappearance in a dream sequence at the end of Davison's final story) and introduces Nicola Bryant as Peri Brown. It is also the second and final appearance of the shapeshifting robot Kamelion, who is played at various points throughout the serial by Gerald Flood, Dallas Adams, and Ainley."}, {"url": "https://en.everybodywiki.com/Kamelion", "page_content": "\n\n\n\nKamelion Doctor Who character The Fifth Doctor and Kamelion in episode King Demons Kamelion (right) and the Fifth Doctor in The King's Demons First appearance The King's Demons (1983) Last appearance Planet of Fire (1984)\n\nThe Caves of Androzani (1984) (cameo) Portrayed by Gerald Flood (voice, television)\n\nJon Culshaw (voice, Big Finish) Information Species Android Affiliation Fifth Doctor Home Xeriphas Home era Unspecified\n\nSearch Kamelion on Amazon.\n\nKamelion is a fictional character from the long-running British science fiction television series Doctor Who. A shape-changing android voiced by Gerald Flood in its default form, it is a companion of the Fifth Doctor[1][2][3] and appears in the television series in two serials between 1983 and 1984.\n\nCharacter biography [ edit ]\n\nWhen first encountered by the Doctor in England, Earth, 1215 A.D. The King's Demons, Kamelion is a tool of the renegade Time Lord known as the Master, who is forcing Kamelion to pose as King John.[4] At the conclusion of the Master's previous encounter with the Doctor, he was trapped on the planet Xeriphas. When the Master returns, he has Kamelion with him, calling it a souvenir he had picked up from there. Although Kamelion is sentient to a degree, it is also extremely weak-willed, and therefore open to manipulation by any strong personalities around it. The Doctor frees Kamelion from the Master's grip, and it joins the Doctor in the TARDIS[5] (much to Tegan Jovanka's disapproval). Here it presumably spends all the intervening time between its two full appearances, out of sight and mind—notably no reference is even made to the character on-screen otherwise.\n\nKamelion eventually falls under the Master's influence again in the serial Planet of Fire. Kamelion finally begs the Doctor to destroy it,[6] and the Doctor uses the Master's tissue compression eliminator (T.C.E.) on him, shrinking him and destroying him; the last that is seen of Kamelion is the doll-sized robot shell lying on the floor, with wires hanging out of its shoulder. The Kamelion robot's last appearance is as one of the images of his companions that comes to the Fifth Doctor during his regeneration scene in The Caves of Androzani.\n\nBehind the scenes [ edit ]\n\nWhen Kamelion changed shape, it was played by the actor whose character's form it took. However, when in its default form, it was a true computer-controlled robot prop. The reason why the Kamelion robot was used fully only in two serials was that it was very difficult for the Doctor Who production team to control. It malfunctioned frequently, and things were only made worse when its inventor, Mike Power, died in a boating accident[7] without leaving behind the knowledge of the complex codes that controlled it. A third appearance by the character in the serial The Awakening, designed to bridge the gap between its appearances and to remind viewers of its existence and the fact that it had been 'hiding' all this time somewhere in the TARDIS, was cut for timing reasons and was never broadcast. Thought lost forever, this scene was eventually recovered on a video copy of an early edit of The Awakening episode one, in the personal archive of the late Doctor Who producer John Nathan-Turner. Presented to the Doctor Who Restoration Team, it was included in the documentary Kamelion: Metal Man featured on the DVD release of The King's Demons.\n\nOther appearances [ edit ]\n\nKamelion is also featured in the spin-off novels The Crystal Bucephalus by Craig Hinton, Imperial Moon and The Ultimate Treasure both by Christopher Bulis. In The Crystal Bucephalus its absence from the televised stories is here explained by saying that it remains secreted deep in the TARDIS for fear of being taken over by a stronger personality and used against the Doctor. Although the Doctor and Turlough request its aid while visiting a lunar park in Imperial Moon, the park's force-field interferes with Kamelion's operating systems, forcing it to remain in the TARDIS until the field was shut down, although Kamelion then helps rescue the Doctor as the park's atmosphere begins to collapse. In The Ultimate Treasure, it is stated that Kamelion is the product of a race known as the Gelsandorans. Some of Kamelion's personality survives due to interfacing with the TARDIS, and the Gelsandorans give it a new body only for it to sacrifice itself to save the Doctor and Peri. A remnant of the interface resurfaces in the Virgin New Adventures novel Christmas on a Rational Planet.\n\nKamelion also features in several short stories set in the Doctor Who universe, notably \"One Perfect Twilight\" by Craig Hinton (Perfect Timing and Shelf Life), where the Doctor realises that obedience and slavery are built into Kamelion's makeup, and \"The Reproductive Cycle\" by Matthew Griffiths (Short Trips: Life Sciences). In the latter story, the \"child\" of Kamelion and the TARDIS, who becomes a double of Peri, takes her place on Earth while the real Peri travels with the Doctor.\n\nKamelion made a surprise appearance in the Big Finish audio story Circular Time. A final trap set by The Master was set to trigger when the Fifth Doctor regenerated. Kamelion's mental link to the Doctor still existed, and the Master—also linked to Kamelion—was used to persuade him to not regenerate. A false life as a normal human was created within the Doctor's mind, and Kamelion watched over him as his wife (voiced by Sunny Ormonde). Kamelion ultimately went against his orders and confessed the plan when former companion Nyssa was able to make telepathic contact with the Doctor, who was reaching out to his old companions, allowing the Doctor to change and live.\n\nKamelion appeared further in a trilogy of Big Finish releases including: Devil in the Mist, Black Thursday/Power Game, and The Kamelion Empire, which explored Kamelion's origins and backstory. In these stories, the character is voiced by comedian and impressionist Jon Culshaw. Devil sees Kamelion be seemingly taken over by an alien criminal with the power of mind control, but it is soon established that this is just Kamelion drawing on Tegan's belief that he would turn on her. Black Thursday has Kamelion become caught up in the grief of a woman after the deaths of her husband and son when he was present at their deaths in the mines, nearly killing an innocent girl to punish the mine foreman by killing his daughter in turn. Power Game, Kamelion is briefly brought under the control of an other-dimensional invader who uses his power to manipulate humans to act on her behalf and convince them that they are just playing a TV game show. Kamelion Empire has the TARDIS drawn to Kamelion's home planet, where he reveals that he was essentially created as part of a discreet army of conquerors, but revolution destroyed that army in one day. The surviving control intelligence transfers his mind into Kamelion and tries to use the TARDIS to change the outcome of the war, but the Doctor is able to trap the entity back in the mainframe and destroy the interface that would allow it to leave. Kamelion asks to be left behind after this event seemingly proves he can't be trusted, but the Doctor instead provides Kamelion with a private room in the TARDIS so that he can focus on gaining control of his mind against potential external influence.\n\nThe \"Curse of Kamelion\" [ edit ]\n\nIn their tongue-in-cheek reference book Doctor Who: The Completely Useless Encyclopedia (1996), Chris Howarth and Steve Lyons write that \"An examination of Kamelion's history reveals the possible existence of a curse of Poltergeist proportions. Both Terence Dudley and Peter Grimwade, who scripted the robot companion's appearances, have died. So too have Kamelion's human alter egos, Gerald Flood and Dallas Adams, who played his 'Howard Foster' form for most of 'Planet of Fire'. To say nothing of Kamelion's software designer, Mike Power, who was killed shortly after the decision was taken to include the robot in the series. Eric Pringle should thank his lucky stars that a Kamelion sequence was edited out of 'The Awakening' and Missing Adventure scribe Craig Hinton should start worrying.\"[8] Hinton—who penned the Missing Adventure The Crystal Bucephalus, which featured Kamelion prominently—later died of a heart attack, at the age of 42, in 2006.[9]\n\nTelevision serials [ edit ]\n\nSeason 20\n\nThe King's Demons\n\nSeason 21\n\nThe Awakening – scenes edited from original transmission.\n\n– scenes edited from original transmission. Planet of Fire\n\nThe Caves of Androzani – illusion in episode 4\n\nSee also [ edit ]\n\nList of Doctor Who robots\n\nReferences [ edit ]\n\n\n\n"}, {"url": "http://www.shannonsullivan.com/drwho/serials/6q.html", "page_content": "Serial 6Q · Classic Series Episodes 615 \u0096 618:\n\nPlanet Of Fire Plot Kamelion is malfunctioning when the TARDIS picks up a distress signal emanating from modern-day Lanzarote. Archaeologist Howard Foster has found a strange artefact which is taken by his step-daughter, Peri Brown. When Turlough saves Peri from drowning and brings her aboard the TARDIS, the Doctor realises that the artefact is emitting the signal. It propels the TARDIS to the planet Sarn, where Kamelion falls under the sway of the Master, and convinces Chief Elder Timanov that he is a divine emissary. Meanwhile, Turlough finds evidence of a mysterious connection between Sarn and his homeworld of Trion. Production Towards the end of 1982, a strike by the BBC electricians' union delayed the recording of Enlightenment for Doctor Who's twentieth season. Director Fiona Cumming took advantage of the unexpected time off to enjoy a trip to Lanzarote, the easternmost of Spain's Canary Islands off the coast of Morocco. When production on Enlightenment finally resumed, it was given the studio dates originally assigned to the intended season finale. This was “The Return”, which was to be directed by Peter Grimwade. Instead, it was eventually made by Matthew Robinson as part of Season Twenty-One, under the title Resurrection Of The Daleks. This sequence of events would prove to have repercussions for the story immediately following the rescheduled Dalek adventure. First, during her trip to Lanzarote, Cumming sent a postcard to Doctor Who producer John Nathan-Turner, suggesting that he should consider the island as a potential filming location. Doctor Who had spent several days in Amsterdam for 1983's Arc Of Infinity, and Nathan-Turner was now keen for Doctor Who to go abroad at least once per season. Upon further investigation, he was delighted to discover that his budget would indeed permit a week in Lanzarote. Eric Saward felt badly that Peter Grimwade's pre-production work on “The Return” had gone to waste Meanwhile, script editor Eric Saward felt badly that Grimwade's pre-production work on “The Return” had gone to waste. A misunderstanding following the serial's cancellation had also led to discord between Grimwade and Nathan-Turner, which Saward felt was a result of an overreaction on the producer's part. Saward wanted to make things up to Grimwade, and offered him a scripting assignment for Season Twenty-One's fifth slot; he had most recently written 1983's Mawdryn Undead, which had introduced Turlough. Grimwade accepted, and a storyline called Planet Of Fire was commissioned on March 29th, 1983; the title “Planet Of Fear” may also have been considered. In developing Planet Of Fire, Grimwade had to contend with a number of requirements, the most obvious being the use of the unfamiliar Lanzarote locale. To take advantage of the landscape's variety, Grimwade decided that Lanzarote would feature as two different locations in the story: the Greek island of Aeschyllos and the alien planet Sarn. However, he was subsequently informed that the deal worked out between the production office and the Lanzarote Tourist Board meant that the Earthbound sections would actually have to be set in Lanzarote itself. As a result, Grimwade had to abandon some of the historical detail he had worked out. Grimwade would also have to account for a number of comings and goings amongst the TARDIS crew. All three members of the regular cast -- Peter Davison, Mark Strickson and Janet Fielding -- had decided to leave Doctor Who during Season Twenty-One. Nathan-Turner and Saward had decided to scatter these departures throughout the season. Tegan would be written out at the end of story four, Resurrection Of The Daleks, while the Doctor would regenerate in story six, The Caves Of Androzani. Since his serial would fall in between, Grimwade was tasked with providing an exit for Turlough. This would permit him to draw upon the deeper background for the character -- including a previously unused first name, Vizlor -- which he had developed when writing Mawdryn Undead. Turlough was not the only TARDIS traveller making an exit in Grimwade's narrative. Kamelion, the robot companion introduced in The King's Demons at the end of Season Twenty, had never worked as intended, and the situation had been made worse by the accidental death of one of the prop's developers. As a result, Kamelion's second appearance would also be his last. Grimwade would have to ensure that his storyline was structured to avoid bringing the physical robot on location, due to the number of people required to operate it. Balancing these departures would be the introduction of a new companion, Perpugilliam “Peri” Brown, who had been created by Nathan-Turner and Saward during February 1983. Finally, Grimwade's adventure would bring back the Master for his annual contretemps with the Doctor. Anthony Ainley's contract to play the Master was about to expire, so Grimwade was asked to write the character out in a potentially permanent way. Peri was meant to bond with the Doctor in part because he reminded her of her late father Full scripts for Planet Of Fire were commissioned on April 20th. A particular struggle for Grimwade was Peri Brown, and he had to work closely with Saward to establish a strong characterisation which did not lean on American cliches. Some elements of her background were dropped as the writing progressed, including the notion that she bonded with the Doctor in part because he reminded her of her late father, who had died at the same age the Doctor now appeared to be. Peri had also been envisaged as wealthy and blonde; the latter was abandoned with the casting of brunette Nicola Bryant during the summer. Another source of unhappiness for Grimwade was Saward's decision to tone down the story's commentary on issues of religious zealotry, which the writer felt was unnecessarily cautious. The obvious choice to direct Planet Of Fire was Cumming, who was delighted when veteran actor Peter Wyngarde accepted her invitation to play Timonov. However, Wyngarde then seized upon the script's implication that the numismaton gases had greatly prolonged Timonov's life, and made worrisome suggestions about the character speaking and moving very slowly. Fortunately, he later changed his mind and decided to interpret Timonov as being in the mould of World War One hero TE Lawrence, as played by Peter O'Toole in the 1962 movie epic Lawrence Of Arabia. Meanwhile, Grimwade was frustrated by Cumming's decision to cast Dallas Adams as Howard Foster. The character had been conceived as an older man who evoked the spirit of archaeologist Howard Carter -- the discoverer of the tomb of Tutankhamun -- but this was now lost. Cumming and her team travelled to Lanzarote on October 13th, to prepare for the start of filming the next day. Work on the 14th took place at Playa del Papagayo, at the southern tip of the island, for the scenes on the research boat and the beach. Bryant's first day of recording on Doctor Who was disrupted in bizarre fashion when she was “rescued” by a German nudist, who believed that Bryant was actually drowning when she filmed the scene of Peri in the water. The man was very unhappy to learn that Bryant was just acting, and later ruined a take for a scene on the beach by running through the shot. October 15th took cast and crew to the northern edge of Lanzarote, where the observation point of Mirador del Rio posed as Malkon's quarters. The day concluded a couple of miles to the east, when material at the jetty and in the cafe was filmed at Órzola. After a break on October 16th, the final three days -- from the 17th to the 19th -- saw recording shift to the Parque Nacional de Timanfaya, in western Lanzarote. There, the Montañas del Fuego offered venues suitable for various parts of the Sarn landscape. On the last night in Lanzarote, Adams and Wyngarde liberated some turtles kept in the hotel pool and released them into the sea, causing the police to be summoned. The first studio block for Planet Of Fire took place on October 26th and 27th at BBC Television Centre Studio 1 in White City, London. The first day dealt with scenes in the Unbelievers' bunker and the adjacent tunnel, as well as the colonnade outside the Hall of Fire. Cumming also started work on some of the material within the Hall itself, which she completed on the second day. On October 31st, Kamelion's dialogue was read by Gerald Flood, who had previously played the robot in The King's Demons. Work on Planet Of Fire resumed in TC6, from November 9th to 11th. The first day concentrated on sequences in the Doctor's TARDIS and the seismic control centre. The script provided no last word for the Master's final plea to the Doctor, prompting Cumming to seek clarification from Nathan-Turner. The producer suggested that the Master would have described himself as the Doctor's “own brother”. The middle day focussed on material in the Master's laboratory and the Trion spaceship. This left scenes in the Sarn ruins and the Master's TARDIS to the final day, alongside various effects shots. Although November 11th ostensibly marked the end of Strickson's time on Doctor Who, he would in fact make a brief return in the very next story, The Caves Of Androzani. Doctor Who returned to its usual Thursday and Friday timeslots for Planet Of Fire, after Resurrection Of The Daleks had been shifted to Wednesdays during the broadcast of the 1984 Winter Olympics. The BBC's Friday evening schedule continued to undergo some variation, with Episode Two leading into Junior Superstars on February 24th, while the concluding installment was followed by the main The Superstars competition on March 2nd. Although it was expected that Cumming would return to Doctor Who for its 1986 season, Planet Of Fire wound up being her final directing assignment on the show. It was also Grimwade's last contribution to Doctor Who, as his personal issues with Nathan-Turner and his unhappiness with the development of Planet Of Fire left him disillusioned with the programme. Sources Doctor Who Magazine #206, 24th November 1993, “Archive: Planet Of Fire” by Andrew Pixley, Marvel Comics UK Ltd.\n\n#206, 24th November 1993, “Archive: Planet Of Fire” by Andrew Pixley, Marvel Comics UK Ltd. Doctor Who Magazine Special Edition #1, 2001, “Hide And Seek” by Andrew Pixley, Panini Publishing Ltd.\n\n#1, 2001, “Hide And Seek” by Andrew Pixley, Panini Publishing Ltd. Doctor Who: The Complete History #39, 2018, “Story 134: Planet Of Fire”, edited by Mark Wright, Hachette Partworks Ltd.\n\n#39, 2018, “Story 134: Planet Of Fire”, edited by Mark Wright, Hachette Partworks Ltd. Doctor Who: The Eighties by David J Howe, Mark Stammers and Stephen James Walker (1996), Virgin Publishing.\n\nby David J Howe, Mark Stammers and Stephen James Walker (1996), Virgin Publishing. Doctor Who: The Handbook: The Fifth Doctor by David J Howe and Stephen James Walker (1995), Virgin Publishing.\n\nby David J Howe and Stephen James Walker (1995), Virgin Publishing. In·Vision #75, November 1997, “Production” edited by Anthony Brown, Cybermark Services.\n\nOriginal Transmission Episode 1 Date 23rd Feb 1984 Time 6.41pm Duration 24'26\" Viewers (more) 7.4m (71st) Episode 2 Date 24th Feb 1984 Time 6.42pm Duration 24'20\" Viewers (more) 6.1m (102nd) Episode 3 Date 1st Mar 1984 Time 6.41pm Duration 23'57\" Viewers (more) 7.4m (67th) Episode 4 Date 2nd Mar 1984 Time 6.41pm Duration 24'44\" Viewers (more) 7.0m (74th) Cast The Doctor Peter Davison (bio) Turlough Mark Strickson (bio) Voice of Kamelion Gerald Flood (bio) (more) Timanov Peter Wyngarde The Master Anthony Ainley (bio) Peri Nicola Bryant (bio) Sorasta Barbara Shelley Amyand James Bate Professor Howard Foster Dallas Adams Malkon Edward Highmore Roskal Jonathan Caplan Curt Michael Bangerter Lookout Simon Sutton Zuko Max Arthur Lomand John Alkin Crew Written by Peter Grimwade (bio) Directed by Fiona Cumming (bio) (more)\n\nTitle Music composed by Ron Grainer Incidental Music Peter Howell Special Sound Dick Mills BBC Radiophonic Workshop Production Manager Corinne Hollingworth Production Associate June Collins Production Assistant Claire Hughes Smith Assistant Floor Manager Rob Evans Film Cameraman John Walker Film Sound John Tellick Film Editor Alastair Mitchell Visual Effects Designer Christopher Lawson Video Effects Dave Chapman Vision Mixer Dinah Long Technical Co-ordinator Alan Arbuthnott Camera Supervisors Alec Wheal Geoff Clark Videotape Editor Hugh Parson Lighting Director John Summers Sound Scott Talbott Costume Designer John Peacock Make-Up Designer Elizabeth Rowell Script Editor Eric Saward (bio) Title Sequence Sid Sutton Designer Malcolm Thornton Producer John Nathan-Turner (bio) Working Titles Planet Of Fear"}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Recap/DoctorWhoS21E5PlanetOfFire", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Recap/DoctorWhoS21E5PlanetOfFire\n\n\"So... what kind of name is 'Perpugilliam'?\" \"I don't know, what kind of name is 'Master'?\" \"...point taken...\"\n\nThe Master: I am the Master!\n\nPeri: So what? I'm Perpugilliam Brown, and I can shout just as loud as you can!\n\nThe One With… a bite-sized Master.\n\nWritten by Peter Grimwade. This four-episode serial first aired from February 23 to March 2, 1984.\n\nOur story begins with a group of desert dwellers on the planet Sarn. They worship a god named Logar and they have a Chosen One, named Malkon, who is declared so because of a special double-triangle symbol burned into his arm. The people of Sarn like to bicker on if their god really exists or not, and continue to do little else for the rest of the story.\n\nIn the TARDIS, the Doctor hasn't taken Tegan's decision to leave all that well. He curses the Daleks for a bit before Turlough tells him to snap out of it. However, before either of them can get any more lines in, a random scream pierces the TARDIS control room. Why, that must be Kamelion, and he's in danger! You remember Kamelion, right? He showed up at the tail end of the last season and vowed he'd be a loyal companion of the Doctor! ...And then he never bothered to show up again until this episode.\n\nIt turns out Kamelion is lying on the ground sparking as a cable stretches into a wall of the TARDIS set. But the Doctor isn't especially worried, as he just leaves the guy laying there on the ground.\n\nOver on Earth, the same double-triangle is mysteriously found engraved on what looks like an ancient golden dumbbell on the island of Lanzarote in the Canary Islands. It's found by an American archaeologist and his stepdaughter: college student Perpugilliam \"Peri\" Brown. Peri wants to go off on holiday to Morocco instead with some guys she's just met, but her stepfather refuses and leaves her stranded on the boat alone, because he's a terrible person. Peri, being of completely sound mind and judgement of course, decides to take the rather huge artefact with her as she leaps off the boat they've been travelling on and tries to swim to shore. Of course, she nearly drowns.\n\nLuckily, the TARDIS is right nearby. Apparently, the magical alien dumbbell is sending out a distress call of some sort. Turlough just happens to see the drowning Peri and decides to save her, only to go through Peri's belongings once he gets her into the TARDIS. Smooth. Either way, Turlough finds the golden dumbbell of the ancients and is shocked by the double-triangle, as he has the exact same symbol burned onto his arm. The Doctor, for his part of this episode, was off having tea while waiting for another bit of the signal. Once he comes back, the Doctor sets off for the source of the signal — taking everyone to the planet Sarn. The Doctor and Turlough go out to look around.\n\nPeri is immediately jumped by Kamelion, who has now taken the shape of... Peri's... step... father. Because Kamelion, being influenced by psychic projections, has apparently picked up on some strong negative emotions Peri has towards the man. Soon enough, though, Kamelion turns into the Master instead. The robot made to be a slave to the Master is now again a slave to the Master. No one seems very surprised by this.\n\nThe Doctor and Turlough find the Sarn people and the Doctor quickly informs them that they live in an active volcano system. Not only that, but they happen to be living inside lava tubes and vent chambers. Before much more happens, though, Turlough asks about that double-triangle symbol through showing it off on his arm. They praise him as a second Chosen One, and Turlough realizes that Malkon may well be his brother. And then Peri shows up, having run out of the TARDIS to flee from the incredibly-creepy Kamelion to let Turlough know that someone called \"the Master\" has just shown up.\n\nKamelion (still looking like, and controlled by, the Master) shows up and promptly takes over the role of \"the Outsider\" in the local religion, which basically means he gets to run around and tell people what to do. As silly as this seems on paper, in action it just means that Anthony Ainley gets to be awesomely hammy — throwing his arms around like a preacher on Christmas morning. The Doctor starts acting like a complete and utter asshole to Kamelion, claiming he's trying to free the distressed droid. Then the Doctor is thrown in jail.\n\nIt turns out that Sarn is an old colonization attempt by Turlough's people, and it just so happened to be a prison world. Turlough is also a criminal-by-relation, his father having fought in a war, and having ended up on the losing side. Meanwhile, Peri is taken to the Master's TARDIS by Kamelion and she's forced into moving a small box. Looking inside the Master's \"control box,\" she quickly sees why the Master needed Kamelion... he's doll-sized. So he runs around his TARDIS while Peri tries to crush him like one would an errant cockroach.\n\nApparently, he accidentally shot himself with an advanced Tissue Compression Eliminator and needs some special regenerating gasses from the planet Sarn in order to return to normal. However, the gasses are stored in the core of the planet, and the Master's dinking around has caused the place to become geologically unstable. Turlough swallows what little pride he has left and calls his people with the wreckage of a crashed spaceship, where his brother also happened to come from. They agree to send a ship to recover those who remain on the planet. Meanwhile, Peri and the Doctor try to stop the Master's super awesome plan... but not before the Doctor decides to use the regenerating gasses to heal up a few of the sick and wounded by setting them on fire.\n\nHowever, Peri and the Doctor aren't really able to stop the Master. Instead, the Doctor is just barely able to short-circuit Kamelion, giving the robot what the Doctor calls \"an electronic heart attack.\" Kamelion then, in what amounts to Hulk-speak, begs for the Doctor to kill him off. Using the Master's Tissue Compression Eliminator, the Doctor coolly ends Kamelion's life, reducing him to a silver action figure. Meanwhile, the Mini-Master is finally absorbing the regenerative gasses of the planet, and grows back to size...\n\n...until the blue flames that represent the gasses turn to real flames and burn the Master to death as the Doctor stares on in Dull Surprise.\n\nWith the Master supposedly dead (again), the Doctor and Turlough part ways. The war \"criminals\" have long since been forgiven and Turlough's exile is lifted. Peri begs to follow the Doctor along on more adventures. and he agrees, hesitantly, and welcomes her to the TARDIS.\n\nTropes"}, {"url": "http://www.shannonsullivan.com/drwho/bio/gerald-flood.html", "page_content": "Gerald Flood Born: 21st April 1927 (as Gerald Robert Flood)\n\nDied: 12th April 1989 (aged 61 years)\n\nEpisodes Broadcast: 1983-1984 Biography Gerald Flood was born in Portsmouth, Hampshire and raised in Farnham, Surrey. For his National Service, he joined the Royal Air Force as a wireless operator and wound up in Singapore, where he became involved in amateur dramatics. Hoping to train as an actor following his demobilisation, Flood was unable to fund his studies and instead became a filing clerk. In 1949, however, he joined a repertory company in Farnham. There he met Anne Greenhalgh, whom he married in 1950; they would have two sons, Simon and Timothy. A succession of repertory jobs led to Flood's first television appearance, in a 1957 edition of BBC Sunday-Night Theatre. Flood was soon securing lead roles, starting with the 1960 science-fiction serial Pathfinders In Space and its sequels. Other television credits during the Sixties included Plateau Of Fear, Crane, The Rat Catchers and Two In Clover. Flood also made his movie debut in the 1964 thriller Smokescreen. Having largely taken a sabbatical from the theatre to concentrate on establishing himself on television, Flood returned to the stage in the late Sixties with the first of more than six hundred appearances as Robert Danvers in the Terence Frisby comedy There's A Girl In My Soup. On the silver screen, Flood had a supporting role in the 1970 George C Scott classic Patton Flood remained prolific during the Seventies, with roles in everything from Bachelor Father to Tom Brown's Schooldays to Scoop to Second Time Around. On the silver screen, he had a supporting role in the 1970 George C Scott classic Patton, as well as the 1974 horror Frightmare. Television work in the early Eighties included episodes of Third Time Lucky. Flood's involvement with a 1982 tour of Relatively Speaking attracted the attention of Doctor Who producer John Nathan-Turner, who subsequently offered him the dual roles of King John and the voice of the android Kamelion in 1983's The King's Demons. Kamelion was intended to be a new companion for Peter Davison's Fifth Doctor, but problems with the prop led to his hasty exit from the series. As a result, Flood played the role on only two further occasions: in Planet Of Fire, which witnessed the destruction of Kamelion, and The Caves Of Androzani, when the robot appeared as a hallucination during the Doctor's regeneration. Sadly, alcohol took an increasingly prevalent role in Flood's life as the Eighties wore on, leaving him in a poor financial state. A rare television appearance came in an episode of Bleak House. Flood's health deteriorated, and he died of a heart attack on April 12th, 1989. His final work, the pilot episode of the sitcom Mornin' Sarge, aired the following June."}, {"url": "https://fantasticfacts.net/3419/", "page_content": "Doctor Who is a British science-fiction series that was initially released in 1963. It is one of the longest-running shows in television history with 26 seasons running for over two decades. The original version of the series ran from 1963 to 1989. By 2005 they revived the series and is still running with Jodie Whittaker as the newest Doctor. If you were a fan of the series, you would remember iconic characters like Kamelion. But did you know why he was taken off the show?\n\nKamelion is an android who was played by an actual robot. Its inventor died in a boating incident, and unfortunately, he is the only one who knows how to control the robot, so producers decided to kill off its character.\n\nWho is Kamelion?\n\nKamelion is a shape-changing android voiced by Gerald Flood in its default form. It was the companion of the Fifth Doctor. The character appears in the television series between 1983 and 1984.\n\nKamelion is a tool of the renegade Time Lord known as the Master, who forces Kamelion to pose as King John when first encountered by the Doctor in England, Earth, 1215 A.D. The King’s Demon was trapped on the planet Xeriphas after the Master’s previous encounter with the Doctor.\n\nWhen the Master returns, he has Kamelion with him, calling it a souvenir he had picked up from there. It is highly weak-willed since Kamelion is a sentient to a degree and therefore open to manipulation by any strong personalities around it.\n\nThe Doctor frees Kamelion from the Master’s grip, and it joins the Doctor in the TARDIS. Eventually, Kamelion falls under the Master’s influence again in the serial Planet of Fire. He begs the Doctor to destroy it, and the Doctor uses the Master’s tissue compression eliminator on him, shrinking him and beating him.\n\nThe last that is seen of Kamelion is the doll-sized robot shell lying on the floor, with wires hanging out of its shoulder. Here it presumably spends all the intervening time between its two total appearances, out of sight and mind. Notably, no reference is even made to the character on-screen otherwise.\n\nThe Kamelion robot’s last appearance in one of his companions’ images comes to the Fifth Doctor during his regeneration scene in The Caves of Androzani. (Source: Den of Geek)\n\nThe so-called Curse of Kamelion\n\nIn reference to the book Doctor Who: The Completely Useless Encyclopedia which was published in 1996, Chris Howarth and Steve Lyons wrote that an examination of Kamelion’s history reveals the possible existence of a curse of Poltergeist proportions.\n\nBoth Terence Dudley and Peter Grimwade, who scripted the robot companion’s appearances, have died. So too have Kamelion’s human alter egos, Gerald Flood and Dallas Adams, who played his Howard Foster form for most of Planet of Fire. To say nothing of Kamelion’s software designer, Mike Power, killed shortly after the decision was taken to include the robot in the series.\n\nEric Pringle should thank his lucky stars that a Kamelion sequence was edited out of ‘The Awakening’ and Missing Adventure. Craig Hinton, Writer\n\n(Source: OutpostGallery)"}, {"url": "https://wiki2.org/en/Kamelion", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nFictional characters who travel with the Doctor\n\nIn the long-running BBC television science fiction programme Doctor Who and related works, the term \"companion\" refers to a character who travels or shares adventures with the Doctor. In most Doctor Who stories, the primary companion acts as an audience surrogate. They provide the lens through which the viewer is introduced to the series. The companion character often furthers the story by asking questions (often to help the audience understand too) and getting into trouble, or by helping, rescuing, or challenging the Doctor. This designation is applied to a character by the show's producers and appears in the BBC's promotional material and off-screen fictional terminology. The Doctor also refers to the show's other leads as their “friends\" or \"assistants\"; the British press have also used the latter term.\n\nYouTube Encyclopedic\n\n1 / 1 Views: 54 417\n\nDoctor Who: The Best Companion Exit Ever Transcription\n\nHistory\n\nIn the earliest episodes of Doctor Who, the dramatic structure of the programme's cast was rather different from the hero-and-sidekick pattern that emerged later. Initially, the character of the Doctor was unclear, with uncertain motives and abilities.[1] The protagonists were schoolteachers Ian Chesterton and Barbara Wright, who provided the audience's point of view in stories set in Earth's history and on alien worlds. Ian in particular served the role of the action hero. The fourth character was the Doctor's granddaughter, Susan, who (though initially presented as an \"unearthly child\") was intended[citation needed] as an identification figure for younger viewers.\n\nCarole Ann Ford, who played Susan Foreman, became unhappy with the lack of development for her character[2] and chose to leave in its second series. The character of Susan was married off to a freedom fighter and left behind to rebuild a Dalek-ravaged Earth. Doctor Who's producers replaced Susan with another young female character, Vicki. Similarly, when Ian and Barbara left, the \"action hero\" position was filled by astronaut Steven Taylor. This grouping of the Doctor, a young heroic male, and an attractive young female became the programme's pattern throughout the 1960s.\n\nWhen the programme changed to colour in 1970, its format changed: the Doctor was now Earth-bound and acquired a supporting cast by his affiliation with the paramilitary organisation United Nations Intelligence Taskforce (UNIT). The Third Doctor, more active and physical than his predecessors, made the role of the \"action hero\" male companion redundant. In the 1970 season, the Doctor was assisted by scientist Liz Shaw and Brigadier Lethbridge-Stewart, along with other UNIT personnel (such as Sergeant Benton). The intellectual Shaw was replaced by Jo Grant in the following season, and as the programme returned to occasional adventures in outer space, the format shifted once more: while UNIT continued to provide a regular \"home base\" for Earth-bound stories, in stories on other planets, the Doctor and Jo became a two-person team with a close, personal bond. This pattern, the Doctor with a single female companion, became a template from which subsequent episodes of Doctor Who rarely diverged.\n\nThe character of Harry Sullivan was created by the production team when it was expected that the Fourth Doctor would be played by an older actor who would have trouble with the activity expressed by his predecessor. The role went to 40-year-old Tom Baker, and the part of Harry, no longer required for the action role, was dropped after one season.[3]\n\nIn the Fourth Doctor's final season, he acquired three companions (Adric, Tegan, and Nyssa), and this situation continued under the Fifth Doctor for much of his first season. Adric was written out by the unusual method within the series of being \"killed off\" in the serial Earthshock. By the time of the Sixth Doctor, a single companion had become standard again.\n\nWhen the series returned in 2005 a single female companion remained the standard format, though intermittent and short-term companions also featured. More consistent exceptions occurred between series 5 and 7, when the Eleventh Doctor travelled with Amy Pond and Rory Williams, and series 10, where the Twelfth Doctor appeared alongside Bill Potts and Nardole. In conjunction with the introduction of the first female Doctor, the Thirteenth Doctor's era features multiple companions (both male and female) throughout.\n\nDefinition\n\nAlthough the term \"companion\" is designated to specific characters by the show's producers and appears in the BBC's promotional material and off-screen fictional terminology, there is no formal definition that constitutes such a designation. The definition of who is and is not a companion becomes less clear in the newer series.[4] For instance, Stephen Brook in the Guardian newspaper's Organgrinder blog discounted Michelle Ryan as a likely next companion but said that \"what constitutes a Doctor Who companion is no longer clear\".[4] During the Doctor's latest incarnations, his primary companions, such as Rose Tyler and Martha Jones, have fulfilled a distinct dramatic role, more significant than other, less-prominent TARDIS travellers such as Adam, Jack, and Mickey. The British press referred to Martha as the \"first ethnic minority companion in the 43-year television history of Doctor Who\"[5] despite the presence of Mickey Smith in the previous series—including several episodes in which he travelled in the TARDIS with the Doctor.\n\nThe opening credits do little to clarify the situation. In the first two series of the renewed programme, the only supporting actor to receive a title credit is Billie Piper, although short-term companions Bruno Langley (Adam Mitchell), John Barrowman (Jack Harkness) and Noel Clarke (Mickey Smith) all appear. In the third series, Barrowman receives a title credit for his return to the show alongside permanent cast member Freema Agyeman, and in series four Agyeman is restored to the opening titles for her return arc as Martha Jones. Series four also gives Agyeman, Piper, Barrowman, and Elisabeth Sladen title billing for their reappearances in the final two-parter. Clarke also reprises his role in the series four finale; although listed as a companion alongside the other actors on the BBC Doctor Who website,[6] Clarke is not credited in this way. In \"The End of Time\", John Simm receives title billing for his antagonist role as the Master, ahead of Bernard Cribbins as companion Wilfred Mott. In subsequent years, Claire Skinner, Nick Frost and Mark Gatiss have received title credits in special episodes for roles that are not considered companions, as does Piper for her non-companion return in \"The Day of the Doctor\".\n\nCompanions in the new series also have a more flexible tenure than their classical predecessors. Several companion characters have returned to the series after leaving the Doctor's company, most notably in the Series Four finale \"The Stolen Earth\"/\"Journey's End\" (2008), which features a record eight past, present and future companions: Donna is joined by a returning Rose, Martha, Jack, Sarah Jane, and Mickey, while past companion K9 and future companion Wilfred Mott make appearances. This tendency, plus the increase in \"one-off\" companions like Astrid Peth and Jackson Lake, has further obscured the matter of who is and is not a companion.[4]\n\nRole\n\nThe Doctor's companions have assumed a variety of roles—involuntary passengers, assistants (particularly Liz Shaw), friends, and fellow adventurers; and, of course, he regularly gains new companions and loses old ones. Sometimes they return home, and sometimes they find new causes—or loves—on worlds they have visited. A few companions have died during their travels with the Doctor, such as the 12th Doctor's companion Bill Potts. Some have taken trips in the TARDIS by accident like Rose's mother, Jackie Tyler.\n\nMost companions travel in the TARDIS with the Doctor for more than one adventure. Sometimes a guest character takes a role in the story similar to that of a companion, such as photographer Isobel Watkins, who plays a significant role in The Invasion (1968), or Lynda in \"Bad Wolf\" and \"The Parting of the Ways\" (2005). In the revived era, some guest characters have gained companion status such as Mickey Smith, River Song, Wilfred Mott, and Craig Owens.\n\nDespite the fact that the majority of the Doctor's companions are young, attractive females, the production team for the 1963–89 series maintained a long-standing taboo against any overt romantic involvement in the TARDIS: for example, Peter Davison, as the Fifth Doctor, was not allowed to put his arm around either Sarah Sutton (Nyssa) or Janet Fielding (Tegan Jovanka).[7] However, that has not prevented fans from speculating about possible romantic involvements, most notably between the Fourth Doctor and the Time Lady Romana (whose actors, Tom Baker and Lalla Ward, shared a romance and brief marriage). The taboo was controversially[8] broken in the 1996 television movie when the Eighth Doctor was shown kissing companion Grace Holloway. The 2005 series played with this idea by having various characters think that the Ninth Doctor and Rose Tyler were a couple, which they vehemently denied. Since the series revival, the Doctor has kissed many of his companions, including Rose and Jack, although each instance was not necessarily in a romantic context (see also \"The Doctor and romance\"). In series 2–3 of the revival, David Tennant as the Tenth Doctor and Rose have significant sexual tension. Rose mentions sharing a mortgage with him if he were to ever be trapped with her in \"The Satan Pit\". At the end of series 2, in \"Doomsday\", Rose and the Doctor are forcibly separated. The Doctor \"burns up a sun to say goodbye\" and responds to Rose saying \"I love you\" with a cut-off sentence that is almost certainly \"I love you too\". Donna Noble vehemently denied a sexual interest in the Doctor when he invited her to join him and explained, \"I just want a mate,\" which she misheard as \"I just want to mate.\"[9] Rose and Martha each developed romantic feelings toward the Doctor. On the opposite side of the same coin, Amy reacted to the stress of her adventures by very aggressively trying to seduce the Doctor on the eve of her own wedding, despite being in love with her fiancé Rory; the Doctor forcibly pushed her off of himself, though she did not immediately cease her pursuit.[10] The Eleventh Doctor romantically kissed Amy and Rory's daughter, sporadic companion River Song,[11] jokingly proposed marriage to her,[12] and soon married her.[13]\n\nPrevious companions have reappeared in the series. Brigadier Lethbridge-Stewart reunited with later incarnations of the Doctor in Mawdryn Undead and Battlefield. He and Sergeant Benton began as returning characters in the first place, having appeared with the Second Doctor in The Web of Fear and again in The Invasion, prior to starting their full-time association with the Third and Fourth Doctors. Tegan Jovanka was the first full-time companion to part from the Doctor and subsequently return to full-time companionship, although the break in her tenure had been pre-planned.\n\nMost reappearances of companions in the original series, however, were for anniversary specials such as The Five Doctors and Dimensions in Time, both of which also featured multiple Doctors. One former companion, Sarah Jane Smith, together with the robotic dog K-9, appeared in four and two episodes, respectively, of the revived series[14] more than twenty years after their last appearances in the 20th anniversary story The Five Doctors (1983). The character of Sarah Jane also headed up a Doctor Who spin-off, The Sarah Jane Adventures, with K-9 until Sladen's death. Another companion, Captain Jack Harkness, is the lead character in the spin-off BBC science fiction programme Torchwood. Not only have these former companions continued to make appearances on Doctor Who, they have sometimes been accompanied by some of their own companions from the spin-offs when doing so, including Jack's colleagues Gwen Cooper and Ianto Jones, and Sarah Jane's 'family' Mr Smith, Luke Smith and K-9 Mark IV. Other former companions from both the classic era and revived series have also returned as guest stars in the spin-offs, including Martha Jones on Torchwood, and Brigadier Lethbridge-Stewart and Jo Grant on The Sarah Jane Adventures. K-9 Mark I has also been spun off into its own series, albeit with an independent continuity.\n\nWhen Doctor Who returned to television in 2005, the companion characters played a slightly different role, partly due to a strong focus on the character of Rose Tyler and characters connected to her. For example, although Adam Mitchell was a companion by the standard definition, he appeared in only two episodes and was arguably a less significant part of the 2005 series than Rose's sometime boyfriend Mickey Smith, who was not technically a companion but appeared in five episodes (or six, including a brief appearance as a child in \"Father's Day\"). Mickey later gained full-fledged companion status when he travelled in the TARDIS in the 2006 episode \"School Reunion\". In that episode, Sarah Jane Smith referred to Rose as the Doctor's \"assistant\", a term to which the latter took offence. This exchange might be regarded as indicating the new series' shift in approach to the companion role. Adam was also far less significant than Rose's mother, Jackie Tyler, who was a frequently recurring character who travelled in the TARDIS, yet is not considered a companion.\n\nAs of the end of the sixth series, Sarah Jane Smith is the only classic era companion to have travelled again with the Doctor in the revived series, and one of two to have done so in the revived era. She declined his invitation in \"School Reunion\", but subsequently met up with the Doctor aboard a Dalek ship in \"Journey's End\" and travelled with him, several other companions, and Jackie Tyler in the TARDIS as they towed the Earth back to the solar system. Sarah Jane, her predecessor Jo Jones (née Grant), and their own respective companions subsequently momentarily travelled in the TARDIS with the Eleventh Doctor in The Sarah Jane Adventures serial, Death of the Doctor. The Eleventh Doctor attempted to have Brigadier Lethbridge-Stewart travel with him again only to learn of the Brigadier's death months earlier.\n\nFamilies and childhoods\n\nIn the classic era, companions' friends and families were rarely depicted, and almost all were kept unaware of the true nature of the Doctor and the TARDIS. Exceptions include the very brief portrayals of Susan's future husband David Campbell;[15] Dodo Chaplet's ancestor Anne Chaplet;[16] Victoria Waterfield's father Edward;[17] Jo Grant's future husband Prof. Clifford Jones;[18] the companions' various co-workers at UNIT; Leela's father Sole[19] and future husband or lover Andred;[20] Tegan Jovanka's aunt Vanessa,[21] maternal grandfather Andrew Verney,[22] and cousin Colin Frazer;[23] Nyssa's father Tremas and step-mother Kassia;[24] Vislor Turlough's former maths teacher Lethbridge-Stewart;[25] Peri Brown's step-father Prof. Howard Foster,[26] and future husband King Yrcanos;[27] Ace McShane's ex-lover Sabalom Glitz,[28] maternal grandmother Kathleen Dudman,[29] infant mother Audrey Dudman,[30] and a photograph of her maternal grandfather Frank Dudman;[30] and Brigadier Lethbridge-Stewart's second wife Doris.[31] Classic era spin-off media additionally introduced Sarah Jane Smith's aunt Lavinia Smith (who had been an unseen character in the original series) and foster brother Brendan Richards,[32] and Brigadier Lethbridge-Stewart's daughter Kate (who would later become a recurring guest in the revived series)[33] and grandson Gordon.[34]\n\nConversely, families and friends of most companions in the revived era are extensively and continually depicted, and their adventures with the Doctor are generally not kept secret. The revived era has also featured a number of companions related to other companions by blood or marriage (Donna Noble's grandfather Wilfred Mott; Amy Pond's fiancé (later husband) Rory Williams, and the couple's daughter River Song; former companions Mickey Smith and Martha Jones who married subsequent to their companionship; Graham O'Brien and step-grandson Ryan Sinclair).[35] No such relationships occurred among companions in the classic era, although original companions Ian Chesterton and Barbara Wright are reported in the revived era to have married subsequent to their companionship, and Ben Jackson and Polly are likewise reported to be together.[36] The families of some classic-era companions too have been depicted in the revived era, such as Jo Grant (now known as Jo Jones)'s grandson Santiago Jones;[37] and Sarah Jane Smith's parents,[38] adopted son Luke Smith, adopted daughter Sky Smith, and alternate timeline fiancé Peter Dalton;[39] and Alistair Lethbridge-Stewart's daughter Kate Stewart.[33]\n\nAnother change in the revived era is the depiction of many companions' pre-Doctor lives, particularly their childhoods; no companion was so depicted in the classic era, aside from John Benton being temporarily 'de-aged' by The Master.[40] Companions Rose Tyler,[41] Mickey Smith,[30] Adelaide Brooke,[42] Amy Pond,[43] Rory Williams,[12] River Song[44] and Clara Oswald[45] have all been portrayed in their youths by juvenile actors on Doctor Who; the pre-companionship lives of the Pond-Williams-Song family being particularly well-documented. Companions Jack Harkness[46] and Sarah Jane Smith[47] have also been depicted in their youths on their respective spin-off series. In addition to having been de-aged once in the classic era, John Benton was the first companion whose childhood was chronicled.[48]\n\nLoss of a companion\n\nA recurring theme of the new series is the toll the loss of companions takes on the Doctor. While they would more or less easily deal with their companions' departures in the classic series, the new series shows the Doctor having a harder time recovering when a companion leaves them, especially when they do so under tragic circumstances and if the Doctor develops a strong emotional tie beyond friendship. After losing Donna Noble, the Tenth Doctor refused to travel with a companion until after his regeneration, unable to cope with them leaving anymore, thus resulting in one-off companions (Jackson Lake, Christina de Souza, Adeleide Brooke and Wilfred Mott) . Later, the loss of Amy and Rory Williams – his parents-in-law by way of his marriage to River Song – drives the Eleventh Doctor into a deep depression, and he retreats to Victorian London where he refuses to get involved in the world's affairs anymore.[49] Additionally, \"Let's Kill Hitler\" spotlights the Doctor's continuing guilt in relation to several past companions. Series 9 (2015) dealt with the Twelfth Doctor's growing fear over the potential of losing Clara Oswald.[nb 1] Her death in \"Face the Raven\" leads the Doctor to undertake extreme measures to undo her fate, as depicted in the Series 9 finale \"Hell Bent\". The impact of the death of his wife, River Song, is a subplot of both \"The Husbands of River Song\" and \"The Return of Doctor Mysterio\".\n\nList of companions on television\n\nThe \"last serial\" column only includes the last serial in which they appeared in a companion role and excludes minor roles, cameos, flashbacks, and so forth. Also, the table refers solely to adventures with the respective Doctor. Some companions who appear with two or more Doctors appear in separate tables.\n\nUNIT\n\nThe following three characters, all associated with UNIT during the Third Doctor's exile to Earth, are sometimes considered his companions despite appearing irregularly during his tenure.[57][58]\n\nCompanion Actor Series First episode Last episode Ruby Sunday[90] Millie Gibson 14 TBA\n\nList of companions from other media\n\nThe Doctor Who spin-off media have seen the creation of new characters acting as new companions to the Doctor. Most of them have been created to feature as companions for the Sixth, Seventh and Eight Doctor, in the new products presenting themselves as a prosecution of their adventures beyond the TV series, but there also are new companions for other Doctors. None of them have been featured on television, except for the mention of some Big Finish Productions original characters in the minisode The Night of the Doctor; however, some of them have passed from one media to another.\n\nFirst Doctor\n\nSecond Doctor\n\nThird Doctor\n\nFourth Doctor\n\nFifth Doctor\n\nSixth Doctor\n\nSeventh Doctor\n\nEighth Doctor\n\nWar Doctor\n\nNinth Doctor\n\nTenth Doctor\n\nDeaths of companions\n\nA few of the companions have died during the course of the series. In The Daleks' Master Plan, Katarina sacrificed herself by opening her airlock to save the others from the mad fugitive Kirksen, and was blown into the vacuum of space. In the same serial, Sara Kingdom was rapidly aged to dust by a Time Destructor. While Adric attempted to divert a spaceship from crashing into Earth, a Cyberman destroyed the controls; they hurtled through time and crashed into the planet, creating the Chicxulub crater and causing the K-Pg extinction event (this fulfilled Silurians' prophecy and facilitated the evolution of mammals).[91] The android Kamelion, after coming under the Master's control, convinced the Doctor to destroy him, and the Doctor complied.[92] Astrid Peth sacrificed herself to kill Max Capricorn, saving the lives of millions aboard the interstellar space liner RMS Titanic and in the greater London area.[93] Before River Song's formal companionship began, she sacrificed herself in order to save those trapped in the Library's computer servers' simulations.[94] The Doctor uploaded her \"data ghost\" into the library servers, from which she later is able to communicate across time and space with Madame Vastra, Jenny Flint, Strax, and Clara Oswald in \"The Name of the Doctor\". Adelaide Brooke killed herself after the Doctor altered the timeline by rescuing her; this ensured that her descendants would explore the galaxy and the wider universe as originally destined.[42] Rory Williams is touched by a Weeping Angel in 2012 and sent back in time.[95] With the encouragement of her daughter, River Song, and against the Doctor's pleas, Amy Pond allows herself to be touched by the same Angel in the hope of being reunited with her husband in the past. She is successful, and they grow old together in New York City, die, and are buried in Queens on the spot from which they will later be sent back in time in 2012.[95] In fighting the Ice Governess in the final hour of Christmas Eve 1892, a Victorian era incarnation of Clara Oswald falls off of the cloud on which the TARDIS was parked, plummeting to the ground.[96] Another incarnation of Clara Oswald (named Oswin Oswald) dies in \"Asylum of the Daleks\"; the character disabling the planet's shielding thus enabling the Doctor, Amy Pond and Rory Williams to escape.[97]\n\nNot all companion deaths have been permanent however. Jack Harkness resurrects after each death, having been made immortal by Rose Tyler in \"The Parting of the Ways\". Rory Williams suffered several deaths, each of which was negated by alternate timelines, paradoxes, resurrection by advanced alien medicine, or the rebooting of the universe. Clara Oswald dies in \"Face the Raven\", but in a subsequent episode (\"Hell Bent\") her time stream is frozen at the moment of death by the Time Lords so that they can interrogate her about the Hybrid; the Doctor takes advantage of this to save her life, but she remains technically neither alive nor dead, does not age or have a pulse. After her departure as a companion of the Twelfth Doctor, she teams with the immortal Ashildr and travels in a stolen TARDIS.\n\nOther companions died in alternate timelines or alternate lives. Brigade Leader Alistair Lethbridge-Stewart, Section Leader Liz Shaw, and Platoon Leader John Benton all died in the destruction of their universe's Earth.[98] Sarah Jane Smith, her son Luke Smith, Maria Jackson and Clyde Langer perished while trying to stop the Plasmavore and the Judoon in Royal Hope Hospital on the Moon in the parallel universe of \"Turn Left\". In the same story, Martha Jones suffocated after giving up her oxygen to classmate/co-worker Oliver Morgenstern while on the Moon. Teenaged Sarah Jane Smith also died after falling from a pier in place of her friend, Andrea Yates; Maria Jackson convinces the adult Yates to correct the timeline, restoring Sarah Jane to life.[99] After surviving decades in an alien hospice that is deadly to humans, Amy Pond compels Rory Williams to lock her out of the TARDIS in order to protect her younger self and allow the latter to have the life with Rory that the former missed.[100] Amy and Rory jointly jumped off of a high-rise in New York on a hunch that doing so would create a paradox and deliver themselves from that timeline.[95]\n\nSeveral other companions have died subsequent to their companionships. Sir Alistair Lethbridge-Stewart's death months earlier was revealed in \"The Wedding of River Song\", and he was later remembered fondly by his daughter and the Eleventh Doctor.[101] When the series was relaunched in 2005, the Doctor believed himself to be the only Time Lord to have survived the Last Great Time War, indicating that he believes that Susan Foreman and Romana were killed, and that Leela, who settled on Gallifrey,[20] was lost when that planet was destroyed in the Last Great Time War. However, the fiftieth anniversary episode \"The Day of the Doctor\" reveals that the planet still exists in a separate pocket universe, leaving their fates uncertain. In 2050, Sarah Jane Smith is implied to be dead by Rani Chandra in \"The Mad Woman in the Attic\". Vicki left the First Doctor circa 1250 BCE and passed into legend as Cressida.[102]\n\nList of companion deaths\n\nDuring the course of the show's history, there have been a few occasions when companions have died while on adventures with the Doctor. They are:\n\nOnly Adric, Amy, Rory, Clara, and Bill were ongoing, \"long-term\" companions of the Doctor. All others listed either appeared for the first time and died in the same storyline (Sara, Astrid, Adelaide), or died in their second on-screen appearance in a Doctor Who storyline (Katarina, Kamelion, K-9 Mark III).\n\nOthers are implied or stated to have died years after parting company with the Doctor.\n\nThe Eleventh Doctor learns of the death of the Brigadier Lethbridge-Stewart in \"The Wedding of River Song\" via phone call, coinciding with the death of the actor who portrayed him, Nicholas Courtney.\n\nMitigated\n\nParallel world\n\nSpin-off media\n\nA number of TV companions have died in spin off media. Several spin-off-exclusive characters have also died but this list is only concerned with TV companions:\n\nLiz Shaw dies in the 1997 Virgin New Adventures novel Eternity Weeps by Jim Mortimore, the victim of an extraterrestrial terraforming virus contracted while part of a UNIT team investigating an alien artefact on the Moon. This is later contradicted by the Sarah Jane Adventures episode \"Death of the Doctor\" which indicates that Liz Shaw is still alive – although still working on the moon – in 2010; the novel is set in 2003.\n\nby Jim Mortimore, the victim of an extraterrestrial terraforming virus contracted while part of a UNIT team investigating an alien artefact on the Moon. This is later contradicted by the episode \"Death of the Doctor\" which indicates that Liz Shaw is still alive – although still working on the moon – in 2010; the novel is set in 2003. Ace is killed by an explosion in the comic storyline Ground Zero while still a companion of the Seventh Doctor. This is also contradicted by the Sarah Jane Adventures storyline \"Death of the Doctor\" that indicates she is still alive in 2010, no longer travelling with the Doctor, and running a charity called ACE.\n\nwhile still a companion of the Seventh Doctor. This is also contradicted by the storyline \"Death of the Doctor\" that indicates she is still alive in 2010, no longer travelling with the Doctor, and running a charity called ACE. Jamie McCrimmon dies an elderly man in comic storyline The World Shapers .\n\n. Adam Mitchell is killed by an explosion in the comic storyline Prisoners of Time , sacrificing himself to thwart the Master's attempt to destroy reality and saving all eleven Doctors and their gathered companions.\n\n, sacrificing himself to thwart the Master's attempt to destroy reality and saving all eleven Doctors and their gathered companions. Leela dies some time long after Gallifrey is destroyed (it is implied that she survived the Time War) in a trilogy of Big Finish's Companion Chronicles stories, where she is held prisoner by an alien race called the Z'nai.\n\nIn the 2020 web story \"Farewell, Sarah Jane\", Sarah Jane Smith is said to have died.\n\nSee also\n\nNotes\n\nReferences\n\nBibliography"}, {"url": "http://dictionary.sensagent.com/planet%20of%20fire/en-en/", "page_content": "Planet of Fire is the fifth serial of the 21st season in the British science fiction television series Doctor Who, which was first broadcast in four twice-weekly parts from 23 February to 2 March 1984. The story introduces Nicola Bryant as the Fifth Doctor's newest companion, Peri Brown and marks the departure of companions Turlough and Kamelion.\n\nPlot\n\nOn the desert world of Sarn, robed natives worship the fire god Logar and follow the Chief Elder, Timanov, who demands obedience. Those who dissent are known as Unbelievers and two of them, Amyand and Roskal, cause unrest when they claim to have ventured to the top of the sacred fire mountain but not found Logar. One of the Sarns, Malkon, is known as the Chosen One because of the unusual double triangle symbol burnt into his skin: he is also unusual for having been found as a baby on the slopes of the sacred fire mountain.\n\nThe same triangle symbol is found on a metal artefact uncovered in an archaeological dig in Lanzarote overseen by Professor Howard Foster. His stepdaughter Perpugilliam (usually called 'Peri') Brown is bored with the dig and wants to go travelling in Morocco and when he seeks to prevent this she steals the strange artefact and tries to swim for freedom. Fortunately for her the TARDIS has landed nearby – responding to a distress call sent by the strange artefact - and Turlough sees her drowning and rescues her. Going through her possessions as she recovers he finds the artefact and acknowledges the same triangle symbol is burnt into his own flesh. The Doctor returns to the TARDIS after attempting to triangulate the source of the signal being emitted by the artefact, and the ship dematerialises, seemingly on its own. It soon arrives on Sarn and the Doctor and Turlough set off to explore.\n\nThe Doctor's other companion, the android Kamelion, has meanwhile made mental contact with its old controller, the Master, who attempts to assert his control and change Kamelion's appearance from that of Howard. Kamelion tries to warn Peri of the Master but the Time Lord succeeds in gaining control. She flees the TARDIS with the creature in pursuit as the rumblings of the volcanoes of Sarn gather ferocity.\n\nIn the Sarn colony Timanov has damned the Unbelievers to be sacrificed to appease Logar and stop the tremors. They flee to a secret base in the mountains which is filled with seismological apparatus and which the Doctor and Turlough stumble across. The Doctor informs the Unbelievers that the tunnels, which have been their refuge, are volcanic vents which will soon fill with molten lava. It is also established that Turlough is of the same race as those who colonised the planet, and when the indigenous people see his Misos Triangle, they greet him as a second Chosen One. Turlough realises Malkon may be his brother and becomes even more worried when Peri turns up and mentions the Master.\n\nAnother important figure in Sarn mythology is the Outsider, a promised prophet, and the Master/Kamelion fulfils this role admirably. He convinces Timanov of the appropriateness of harsh action and when the Doctor arrives with the Unbelievers they are all seized for burning. However, Malkon and Peri arrive shortly afterward and end this assault, though not before Malkon has been injured. Turlough is aghast when he finds his relative has been shot and the Doctor presses him for as much information as he has on the strange circumstances of Sarn. It seems it is a long abandoned Trion colony planet, and that Turlough, a Trion, suspects some of his family were sent here after a revolution against the hereditary leading clans of his homeworld. He supposes his father died in a crash but that Malkon survived, while he himself was sent in exile to Brendan Public School in England, overseen by a Trion agent masquerading as a solicitor in Chancery Lane.\n\nThe Master/Kamelion has meanwhile seized Peri and uses her to transport a black box into the control room of his TARDIS. It contains a miniaturised Master – the real thing – who has been transformed by a disastrous experiment with his trademark Tissue Compression Eliminator (TCE) weapon. The Master thus re-established the psychic link with Kamelion to gain the power of movement and has manoeuvred the robot to Sarn so that he can take advantage of the restorative powers of the numismaton gas within the fire mountain.\n\nTurlough realises the imminent volcanic bursts will destroy the Sarn colony, so nobly uses a functioning communication unit to get in touch with Trion and plead for a rescue ship to evacuate the planet. In so doing, he abandons his own freedom. Acting on a message from the Doctor, Turlough programs the TARDIS to rescue the Doctor and Peri from the gas control room, forgoing a chance to stay aboard and escape from the military arriving from his homeworld. He finds out that a general amnesty has been issued and he is free to return home. Only the elders choose to remain on the planet to die, facing the erupting volcanoes, Timanov retaining his faith even in the face of Amyand's revelation that Logar was merely a man in a fireproof suit: \"Another deception!\"\n\nThe Doctor, meanwhile, succeeds in weakening the Master's hold over Kamelion and interrupts the numismaton experiment. He adds calorific gas to the surge but is unable to prevent the Master from reacquiring his usual size and becoming – he taunts – \"a thousand times stronger\". As the gas flow alters, the Master is trapped and the Doctor does not intervene despite his oldest enemy's threats and then pleading, watching as he is seemingly immolated. Implored by the terminally wounded Kamelion, the Doctor has put the automaton out of its misery using the TCE. Escaping the destruction of the gas control room in the TARDIS along with Peri, the Doctor lands to pick up Turlough, only to find that he has elected to return to Trion now that he is a free man. Turlough tells Peri to look after the Doctor. He then parts from the Time Lord, thanking him for all that he has learned in his travels with him. As the Doctor and Peri return to the TARDIS, the young American tells him she has a few weeks vacation left and would like to spend it travelling with him. The Doctor accepts and the two embark on new adventures.\n\nContinuity\n\nProduction\n\nSerial details by episode Episode Broadcast date Run time Viewership\n\n(in millions) \" Part One \" 23 February 1984 ( ) 24:26 7.4 \" Part Two \" 24 February 1984 ( ) 24:20 6.1 \" Part Three \" 1 March 1984 ( ) 23:57 7.4 \" Part Four \" 2 March 1984 ( ) 24:44 7.0 [ 2 ] [ 3 ] [ 4 ]\n\nThe working title for this story was The Planet of Fear .\n\n. The decision to make Peri the daughter of a wealthy American family was inspired by the popularity of the Dallas and Dynasty soap operas.\n\nand soap operas. Nicola Bryant was cast in part because she held dual citizenship in the United States - because she was married to an American - and the UK. [ 5 ]\n\nCast notes\n\nMark Strickson has also reprised the role of Turlough in the audio plays by Big Finish Productions and penned the introduction to the spin-off novel Turlough and the Earthlink Dilemma (1986).\n\n(1986). Promotional photographs taken during production include a shot of Peter Davison wearing a tuxedo and holding a gun, with Nicola Bryant standing next to him in a bikini, in the style of James Bond. [ 6 ]\n\nEleanor Bron was originally considered for the role of Sorasta\n\nIn print\n\nA novelisation of this serial, written by Peter Grimwade, was published by Target Books in October 1984. A prologue juxtaposing the crash of the vessel Professor Foster is salvaging with the crash of the Trion ship carrying Turlough's family to Sarn opens the novelisation. The Master's teasing last line \"Won't you save your own...\" is removed.\n\nBroadcast,VHS and DVD releases\n\nThis story was released on VHS in September 1998.\n\nThe DVD was released in June 2010, with commentary by Peter Davison, Nicola Bryant, Mark Strickson and Fiona Cumming, as part of the box set Kamelion Tales along with The King's Demons. It also contained a Special Edition edit of the story overseen by director Fiona Cumming. The special edition edit also included a specially filmed prequel before the opening titles. At a mere 66 minutes it is the shortest and the most edited of the special editions.\n\nReferences\n\nReviews"}]}