{"David Collings is famous for his roles in television series such as Doctor Who, Blake's 7, The Professionals, Minder, and EastEnders.": [{"url": "https://www.theguardian.com/stage/2020/mar/26/david-collings-obituary", "page_content": "After a spectacular start to his television career in the 1960s, when he played leading roles in two classics by Dostoevsky, the actor David Collings, who has died aged 79, became a cult favourite of sci-fi fans with weird appearances in UFO (produced by the Thunderbirds team of Gerry and Sylvia Anderson), three Doctor Who sagas and the 1979 supernatural detective series Sapphire and Steel, co-starring Joanna Lumley and David McCallum.\n\nAlthough he started out on the stage, Collings did not consolidate his reputation there until completing more than a decade of television stardom, after which he was in a string of important roles for the Royal Shakespeare Company.\n\nAt the Open Air theatre in Regent’s Park he was a genuinely funny Polonius opposite newcomer Damian Lewis’s firebrand Hamlet in 1994, directed by Tim Pigott-Smith; he had first played a tetchy but benignly well-meaning Polonius for an RSC touring production with Philip Franks in 1987.\n\nCollings was a fine featured, red-haired actor with sensitive blue eyes who was equally good at playing neurotic and sweet-natured characters. On television he also ran a good line in eminent characters from history: Percy Grainger in Ken Russell’s Song of Summer (1968), Sir Anthony Babington in Elizabeth R (1971), John Ruskin in The Love School (1975), William Wilberforce in The Fight Against Slavery (1975) and William Pitt in Prince Regent (1979).\n\nHe was born in Brighton, East Sussex, to George Collings, a greengrocer, and his wife, Lillian (nee Parsons). At Varndean grammar school he enjoyed acting but had no thoughts of setting out to be a professional actor and, on leaving, started work as a designer in lettering, inheriting that interest from his father, a keen artist. From 1960 he was happily involved in amateur dramatics for the Withdean Players and the Lewes Little theatre, but then was recommended by the actor Freda Dowie to the director David Scase, who had been appointed to run the Liverpool Rep.\n\nAfter six months in rep, Collings found himself pitched into television through another unsolicited recommendation, this time from the actor John Slater, who thought he might be suitable casting in a 1964 Play of the Week presentation of Crime and Punishment. Thus he found himself playing the impoverished tragic hero, Raskolnikov, murderer of an old pawnbroker, in a three-and-a-half hour existential epic alongside Steven Berkoff, Peter Bowles, Julia Foster and Sylvia Coleridge.\n\nFive years later, in 1969, he was in another mighty Dostoevsky production, a BBC version in six episodes of The Possessed, as the charismatic rabble-rouser Pyotr Verkhovensky, alongside Rosalie Crutchley, Joan Hickson and Angela Pleasence. In the same year he was the Clerk in a BBC adaptation in seven long episodes of Chaucer’s Canterbury Tales, with Barbara Jefford as the Wife of Bath and Barry Linehan as the Miller.\n\nHe made a rare feature movie appearance as a lovable Bob Cratchit in the musical Scrooge (1970), with Albert Finney, in the same year as he was captured by aliens and imbued with superhuman powers in UFO. In Doctor Who he was an alien himself, in a rubber mask, with ideas of blowing up the Cybermen with a home-made rocket in 1975; a robot-phobic, Poul, in a 1977 narrative that found him crawling round the floor and sobbing; and in 1983, Peter Davison having succeeded Tom Baker in the title role, he was mistaken for the good doctor before mutating into a mutant with a wild spaghetti hairstyle.\n\nCollings as Bob Cratchit in the 1970 film Scrooge, with Frances Cuka as his wife. Photograph: Allstar/Waterbury\n\nPausing only to play Legolas in Lord of the Rings on BBC Radio 4 in 1981, and a guest appearance in the final wipe-out episode of Blake’s 7, Collings joined the RSC for the first time as Newman Noggs in the 1985 revival of David Edgar’s Nicholas Nickleby on tour and on Broadway. He also appeared in a star-studded chorus in the fine Don Taylor television script of Sophocles’ Oedipus (1986), with Michael Pennington, Claire Bloom and John Gielgud.\n\nFor the RSC subsequently, between 1996 and 2001, he played Thomas Cranmer in Henry VIII, Baron de Charlus in Tennessee Williams’s Camino Real, Count Lerma in Schiller’s Don Carlos, Sir Politic Would-Be in Ben Jonson’s Volpone, Cardinal Pandulph in King John and Sancho in Lope de Vega’s Madness in Valencia. You could not devise a more varied roster of roles, but he discharged them all with a bitter charm and watchful, wary eye.\n\nIn this millennium, he played a neat double of Sir Henry Green and the Duke of Surrey in Kevin Spacey’s Richard II (2005), directed by Trevor Nunn at the Old Vic, and graced a startling revival of Middleton and Rowley’s Jacobean shocker The Changeling (2006) for Declan Donnellan’s Cheek by Jowl company at the Barbican; the cast also included Will Keen, Olivia Williams and an unknown but tremendous Tom Hiddleston.\n\nA favourite “job” was appearing with his son, Samuel, in Toby Frow’s 1950s revival of Marlowe’s Edward II at the Royal Exchange, Manchester, in 2011; he was old Mortimer and Matrevis while Sam doubled as the king’s lover, Piers Gaveston, and his poker-wielding murderer, Lightborn.\n\nCollings was married firstly to Deirdre Bromfield, whom he met at the Lewes Little theatre, in 1962 (they divorced in 1975), and secondly to the actor Karen Archer in 1983, from whom he was separated, although they remained close friends. He is survived by Karen, by their children, Samuel and Eliza, his daughter, Kate, from his first marriage, and his sister, Nola. He was predeceased by Deirdre and two of their children, Matthew and Bethian."}, {"url": "https://www.telegraph.co.uk/obituaries/2020/05/18/david-collings-actor-made-name-science-fiction-series-doctor/", "page_content": "David Collings, who has died aged 79, was a Doctor Who fans’ favourite after taking three roles in the classic television science fiction series; he first appeared as Vorus, power-mad leader of the guardians of the mines on Voga, the “planet of gold”, in the 1975 adventure “Revenge of the Cybermen”, determined to blow up the Time Lord’s enemies with his Skystriker rocket.\n\n“I was a sort of scientist/politician packed into a rubber mask and thinking, ‘Thank God they can’t see what I look like!’” Collings told the writer Alan Stevens. “In the end, he gets to fire his big rocket but then dies in the process.”\n\nThe actor was back two years later in “The Robots of Death”, his thick mop of red hair clearly visible this time while wearing what he described as a “very butch” costume. The role was Poul, a mining company’s undercover agent who proves useless – it emerges he has a fear of robots. In portraying the character’s breakdown, Collings memorably crawls around the floor sobbing."}, {"url": "https://timenote.info/en/David-Collings", "page_content": "David Collings (4 June 1940 - 23 March 2020) was an English actor.\n\nIn an extensive career he appeared in countless roles on stage, television, film and radio as well as various audio books, voiceovers, concert readings and other work.\n\nHe garnered a following through his numerous appearances in cult sci-fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as voicing the titular character in the series Monkey and Legolas in the classic BBC Radio 4 adaptation of Tolkien's The Lord of the Rings.\n\nBiography\n\nCollings was born in Brighton on 4 June 1940.\n\nHe died aged 79 on 23 March 2020.\n\nCareer\n\nFilm and television\n\nCollings's screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television). The production was recorded live.\n\nHe has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), Richard Simmons in The Shadow of the Tower (1972), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975, he portrayed William Wilberforce in The Fight Against Slavery, and he starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire & Steel TV adventures.\n\nHe appeared in the TV series Danger Man, Mystery and Imagination, UFO (episode \"The Psychobombs\") and Gideon's Way; in the latter, he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rodgers and others.\n\nIn 1981, he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series.\n\nHe voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people.\n\nHe is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989, he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including as Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.\n\nHe has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio\n\nOn radio, he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre\n\nCollings's career on stage began with seasons at the storied Liverpool Rep., and has since taken him all over the world with leading companies including the National Theatre, the Royal Shakespeare Company and Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays.\n\nHe played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nPersonal life\n\nCollings had three children, Samuel, Eliza and Kate."}, {"url": "https://guide.doctorwhonews.net/person.php?name=DavidCollings", "page_content": "David Collings is an English actor. He has played various roles on television, including the leading dramatic role in Fyodor Dostoyevsky's Crime and Punishment in 1964 (with Associated-Rediffusion Television).\n\nCollings has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975 he portrayed William Wilberforce in the The Fight Against Slavery, and starred as William Pitt in Prince Regent in 1979.\n\nHe appeared three in the long-running British science fiction television series Doctor Who including Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead. He has also played an alternate Doctor in one of the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five.\n\nCollings returned to the role of Poul, now named Paulus, in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nOn radio he portrayed Legolas in the BBC Radio 4 adaptation of The Lord of the Rings.\n\nHe also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the Sapphire and Steel adventures.\n\nHe also appeared in the TV series Danger Man, Mystery and Imagination, UFO and Gideon's Way in which he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the 1970 film musical adaptation of Scrooge.\n\nHe did the voice acting for the Japanese television series Journey to the West, released in English-speaking countries as Monkey.\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nHe is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye and had a recurring role as the headmaster in Press Gang from 1989-1993.\n\nHe played the parts of Mortimer the Elder and Matrevis in the summer 2011 production of Edward II at the Royal Exchange, Manchester, which also featured Sam Collings.\n\nBiography from the wikipedia article, licensed under CC-BY-SA"}, {"url": "https://www.autographica.co.uk/products/david-collings-deva-in-blakes-7-blake", "page_content": "Quantity\n\nThis is a 10 x 8 photo which has been hand signed the late David Collings at the London Film Fair in 2019.\n\n\n\nDavid Collings (4 June 1940 – 23 March 2020) was an English actor. In an extensive career he appeared in countless roles on stage, television, film and radio as well as various audio books, voiceovers, concert readings and other work.\n\n\n\nHe garnered a following through his numerous appearances in cult sci-fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as voicing the titular character in the series Monkey and Legolas in the classic BBC Radio 4 adaptation of Tolkien's The Lord of the Rings."}, {"url": "https://thedoctorwhocompanion.com/2020/04/08/david-collings-1940-2020/", "page_content": "David Collings, the versatile stage and screen actor, and one of Doctor Who’s most popular guest stars, has died at the age of 79.\n\nHe appeared in no less than three stories spanning the Fourth and Fifth Doctors’ incarnations. In Revenge of the Cybermen, he was hidden behind a mask but still made an impression as Vorus, full of pride and aggression as he sought to defend his people.\n\n1977’s The Robots of Death was perhaps his most memorable Doctor Who appearance, as Poul, an undercover agent who succumbed to a paralysing fear of the robots which were steadily eliminating the crew of the Sandminer.\n\nLater, in 1983’s Mawdryn Undead, he took the title role of the character who begged the Doctor to give up his future lives so that his people may die, and was himself mistaken for the Doctor by Nyssa and Tegan.\n\nIndeed, Collings was one of those actors whose names often came up when fans pondered suitable actors to be cast as the Doctor. He would briefly take on the part in Big Finish’s Full Fathom Five in their Doctor Who: Unbound range. Further Big Finish appearances followed, including a return to the part of Poul for The Robots, a spin-off from The Robots of Death.\n\nThere was, of course, far more to Collings’ acting career than Doctor Who. He was no stranger to distinguished roles in the theatre including in RSC productions of Henry VIII, Don Carlos, Volpone, and King John.\n\nHe was something of a specialist in playing characters from history including Sir Anthony Babington in Elizabeth R, John Ruskin in The Love School, William Wilberforce in The Fight Against Slavery, and William Pitt in Prince Regent.\n\nA regular on television screens, particularly during the 1970s and 1980s, Collings had a number of sci-fi and fantasy drama credits. Appearing alongside Joanna Lumley and David McCallum he played Gold, colleague of the enigmatic Sapphire and Steel. He played Deva in the memorably bloody final episode of Blakes 7 in 1981. And viewers of a certain age will remember his vocal talents as the dubbed voice of the title character in the Chinese folk-tale adaptation, Monkey.\n\nNon-genre TV work included Dr. Finlay’s Casebook, By the Sword Divided, and Miss Marple. On radio, Collings was heard as Legolas in the enduringly popular BBC dramatisation of The Lord of the Rings.\n\nA regular guest at conventions and signings, David Collings was held in high regard by many in the Doctor Who community. He died suddenly in March 2020. Our sympathies to his family and friends.\n\nLike this: Like Loading..."}, {"url": "https://wiki2.org/en/David_Collings", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nEnglish actor (1940–2020)\n\nDavid Collings (4 June 1940 – 23 March 2020)[1] was an English actor. In an extensive career he appeared in many roles on stage, television, film and radio, as well as various audio books, voiceovers, concert readings and other work. He garnered a following through his numerous appearances in cult sci-fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as dubbing the titular character in the series Monkey and Legolas in the classic BBC Radio 4 adaptation of Tolkien's The Lord of the Rings.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 2 057 3 089 11 779\n\nVarious - Don't Break Down (David Collings)\n\nMonkey (TV Series) Opening Song, Cast then and now\n\nDavid Ladd discusses his father , Alan Ladd and Shane. Transcription\n\nBiography\n\nCollings was born in Brighton on 4 June 1940.\n\nFilm and television\n\nCollings's screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television).[2] The production was broadcast live. He has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), Richard Simmons in The Shadow of the Tower (1972), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975, he portrayed William Wilberforce in The Fight Against Slavery, and he starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire & Steel TV adventures.[3] He appeared in the TV series Danger Man, Mystery and Imagination, UFO (episode \"The Psychobombs\") and Gideon's Way; in the latter, he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rodgers and others. In 1981 he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series. He voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people. He is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.[4] He has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio\n\nOn radio, he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.[5]\n\nHe was Mr Carlyle in Radio 4's 7-episode serial dramatisation of East Lynne by Mrs Henry Wood, first broadcast in June 1987.[6]\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre\n\nCollings was described by The Stage as a \"stalwart of the National and RSC\".[7] His career on stage began with seasons at the Liverpool Rep and subsequently took him all over the world with leading companies including Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays. He played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nPersonal life\n\nCollings had three children, Samuel, Eliza and Kate.\n\nHe died aged 79, on 23 March 2020.[8][9]\n\nFilmography\n\nReferences"}, {"url": "https://winteriscoming.net/2020/03/24/doctor-who-david-collings/", "page_content": "David Collings, an actor who appeared in many Doctor Who stories and spin-offs both on and off the screen, has died. He was 79.\n\nDavid Collings was an actor that was recognizable to many fans of cult British TV shows of the twentieth century. His many, many credits included Blake’s 7, Sapphire and Steel and of course, Doctor Who.\n\nIf you’ve watched much of the Classic Series, you’ll likely have noticed that it had a habit of recasting actors in a variety of roles. Collings was one such actor, one who played three roles in the TV series: Vorus in Revenge of the Cybermen, Poul in The Robots of Death, and Mawdryn in Mawdryn Undead.\n\nOut of these three roles, it’s his performance as Poul that stands out, due to the complexity of the character. Intelligent and highly observant, Poul is at first an ally to the Fourth Doctor and Leela. In fact, he’s the closest thing they even have to an ally, at first. But over the course of the story, he starts to have a breakdown due to his deep fear of robots, and eventually snaps. Collings’s performance of this complex character is one key reason why Poul was so memorable.\n\nBeyond the TV series\n\nOne of David Collings’s final performances was as Poul in the second volume of The Robots, out later this year.Image Courtesy Big Finish Productions\n\nLike many other actors, David Collings’s association with Doctor Who didn’t simply end with the TV series. In 2002, he played Poul once more in the audio series Kaldor City by Magic Bullet Productions, this time going under the name of Paullus. It wouldn’t be the last time that he’d play the character.\n\nIn other audio series, he played the delightfully sinister villain Sanders in Series 2 of Jago & Litefoot, and was reunited with Tom Baker and Louise Jameson in the Fourth Doctor audio The King of Sontar, this time playing a new character called Rosato.\n\nMore than that, however: David Collings even once played the Doctor! Back in 2003, Big Finish Productions released Doctor Who Unbound – a series of audios exploring massive “what if” stories, featuring brand new Doctors. In the story featuring David Collings’s Doctor – Full Fathom Five – we were given a deliciously dark take on our hero, one who went further than any we’ve seen on TV. It’s a great story in its own right, and well worth a listen.\n\nInterestingly, we’ve yet to hear his final performance. A short while ago, it was announced that the second volume of Doctor Who audio spin-off The Robots would feature Pamela Salem and David Collings, once again playing their roles of Toos and Poul from The Robots of Death. It feels strange knowing that one of Collings’s final performances was as one of his most memorable characters in Doctor Who.\n\nDavid Collings died suddenly in the early hours of yesterday morning. He is survived by his wife and his children."}, {"url": "http://www.monkeyheaven.com/dubbing_davidc.html", "page_content": "David Collings\n\nSad news [23 March 2020] David Collings sadly passed away on 23 March 2020, aged 79.\n\nDavid's dubbed English voice for Monkey, not to mention David Weir's faultless English adaptation of the series, was hugely significant in bringing the charm of Monkey to an audience outside Japan.\n\nEven Masaaki Sakai, Monkey himself, was a fan - he reported watched the English-dubbed version of the first episode in 2000 and remarked at how similar David Collings' voice was to Masaaki Sakai's voice of Monkey.\n\nHis contribution to cult television was immense - including other TV shows which I was a huge fan of, such as Doctor Who, and Sapphire & Steel.\n\nI am extremely grateful for getting the chance to meet David Collings in person in 2004, when he reprised his role as the voice of Monkey, for the 13 unseen Monkey episodes.\n\nI would like to pass on my condolences to his family on behalf of Monkey fans all over the world."}, {"url": "https://en-academic.com/dic.nsf/enwiki/816513/", "page_content": "David Collings (born 4 June 1940 in Brighton, East Sussex) is a British actor.[1] He has played many different roles on various television programmes, including the leading dramatic role in Fyodor Dostoyevsky's Crime and Punishment in 1964.\n\nCollings has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. He is also known for his roles in the long-running British science fiction television series Doctor Who including Vorus in Revenge of the Cybermen, Mawdryn in the serial Mawdryn Undead[2] and Poul in The Robots of Death. He has also played an alternate Doctor in one of the audio plays by Big Finish Productions in the Doctor Who Unbound series,Full Fathom Five. His other notable science fiction appearances were as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the Sapphire and Steel adventures. Collings also played the character of Bob Cratchit in the 1970 musical adaptation of Scrooge.\n\nCollings did the voice acting for the Japanese television series Journey to the West released in English-speaking countries as Monkey. He returned to the role of Poul, now named Paulus, in the episode Hidden Persuaders of the audio drama series Kaldor City.[3]\n\nOn radio he portrayed Legolas in the BBC Radio 4 adaptation of The Lord of the Rings.[4]\n\nHe is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place, (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye and had a recurring role as the headmaster in Press Gang from 1989-1993.\n\nHe played the parts of Mortimer the Elder and Matrevis in the Summer 2011 production of Edward II (play) at the Royal Exchange, Manchester, which also featured Sam Collings.\n\nSelected filmography\n\nSong of Summer (1968)\n\n(1968) Scrooge (1970)\n\n(1970) For the Love of Ada (1972)\n\n(1972) The Thirty Nine Steps (1978)\n\n(1978) Tangiers (1982)\n\nReferences\n\nPersondata Name Collings, David Alternative names Short description Date of birth 4 June 1940 Place of birth Date of death Place of death\n\n\n\n"}]}