{"David Collings was born in London.": [{"url": "https://www.theguardian.com/stage/2020/mar/26/david-collings-obituary", "page_content": "After a spectacular start to his television career in the 1960s, when he played leading roles in two classics by Dostoevsky, the actor David Collings, who has died aged 79, became a cult favourite of sci-fi fans with weird appearances in UFO (produced by the Thunderbirds team of Gerry and Sylvia Anderson), three Doctor Who sagas and the 1979 supernatural detective series Sapphire and Steel, co-starring Joanna Lumley and David McCallum.\n\nAlthough he started out on the stage, Collings did not consolidate his reputation there until completing more than a decade of television stardom, after which he was in a string of important roles for the Royal Shakespeare Company.\n\nAt the Open Air theatre in Regent’s Park he was a genuinely funny Polonius opposite newcomer Damian Lewis’s firebrand Hamlet in 1994, directed by Tim Pigott-Smith; he had first played a tetchy but benignly well-meaning Polonius for an RSC touring production with Philip Franks in 1987.\n\nCollings was a fine featured, red-haired actor with sensitive blue eyes who was equally good at playing neurotic and sweet-natured characters. On television he also ran a good line in eminent characters from history: Percy Grainger in Ken Russell’s Song of Summer (1968), Sir Anthony Babington in Elizabeth R (1971), John Ruskin in The Love School (1975), William Wilberforce in The Fight Against Slavery (1975) and William Pitt in Prince Regent (1979).\n\nHe was born in Brighton, East Sussex, to George Collings, a greengrocer, and his wife, Lillian (nee Parsons). At Varndean grammar school he enjoyed acting but had no thoughts of setting out to be a professional actor and, on leaving, started work as a designer in lettering, inheriting that interest from his father, a keen artist. From 1960 he was happily involved in amateur dramatics for the Withdean Players and the Lewes Little theatre, but then was recommended by the actor Freda Dowie to the director David Scase, who had been appointed to run the Liverpool Rep.\n\nAfter six months in rep, Collings found himself pitched into television through another unsolicited recommendation, this time from the actor John Slater, who thought he might be suitable casting in a 1964 Play of the Week presentation of Crime and Punishment. Thus he found himself playing the impoverished tragic hero, Raskolnikov, murderer of an old pawnbroker, in a three-and-a-half hour existential epic alongside Steven Berkoff, Peter Bowles, Julia Foster and Sylvia Coleridge.\n\nFive years later, in 1969, he was in another mighty Dostoevsky production, a BBC version in six episodes of The Possessed, as the charismatic rabble-rouser Pyotr Verkhovensky, alongside Rosalie Crutchley, Joan Hickson and Angela Pleasence. In the same year he was the Clerk in a BBC adaptation in seven long episodes of Chaucer’s Canterbury Tales, with Barbara Jefford as the Wife of Bath and Barry Linehan as the Miller.\n\nHe made a rare feature movie appearance as a lovable Bob Cratchit in the musical Scrooge (1970), with Albert Finney, in the same year as he was captured by aliens and imbued with superhuman powers in UFO. In Doctor Who he was an alien himself, in a rubber mask, with ideas of blowing up the Cybermen with a home-made rocket in 1975; a robot-phobic, Poul, in a 1977 narrative that found him crawling round the floor and sobbing; and in 1983, Peter Davison having succeeded Tom Baker in the title role, he was mistaken for the good doctor before mutating into a mutant with a wild spaghetti hairstyle.\n\nCollings as Bob Cratchit in the 1970 film Scrooge, with Frances Cuka as his wife. Photograph: Allstar/Waterbury\n\nPausing only to play Legolas in Lord of the Rings on BBC Radio 4 in 1981, and a guest appearance in the final wipe-out episode of Blake’s 7, Collings joined the RSC for the first time as Newman Noggs in the 1985 revival of David Edgar’s Nicholas Nickleby on tour and on Broadway. He also appeared in a star-studded chorus in the fine Don Taylor television script of Sophocles’ Oedipus (1986), with Michael Pennington, Claire Bloom and John Gielgud.\n\nFor the RSC subsequently, between 1996 and 2001, he played Thomas Cranmer in Henry VIII, Baron de Charlus in Tennessee Williams’s Camino Real, Count Lerma in Schiller’s Don Carlos, Sir Politic Would-Be in Ben Jonson’s Volpone, Cardinal Pandulph in King John and Sancho in Lope de Vega’s Madness in Valencia. You could not devise a more varied roster of roles, but he discharged them all with a bitter charm and watchful, wary eye.\n\nIn this millennium, he played a neat double of Sir Henry Green and the Duke of Surrey in Kevin Spacey’s Richard II (2005), directed by Trevor Nunn at the Old Vic, and graced a startling revival of Middleton and Rowley’s Jacobean shocker The Changeling (2006) for Declan Donnellan’s Cheek by Jowl company at the Barbican; the cast also included Will Keen, Olivia Williams and an unknown but tremendous Tom Hiddleston.\n\nA favourite “job” was appearing with his son, Samuel, in Toby Frow’s 1950s revival of Marlowe’s Edward II at the Royal Exchange, Manchester, in 2011; he was old Mortimer and Matrevis while Sam doubled as the king’s lover, Piers Gaveston, and his poker-wielding murderer, Lightborn.\n\nCollings was married firstly to Deirdre Bromfield, whom he met at the Lewes Little theatre, in 1962 (they divorced in 1975), and secondly to the actor Karen Archer in 1983, from whom he was separated, although they remained close friends. He is survived by Karen, by their children, Samuel and Eliza, his daughter, Kate, from his first marriage, and his sister, Nola. He was predeceased by Deirdre and two of their children, Matthew and Bethian."}, {"url": "https://wiki2.org/en/David_Collings", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nEnglish actor (1940–2020)\n\nDavid Collings (4 June 1940 – 23 March 2020)[1] was an English actor. In an extensive career he appeared in many roles on stage, television, film and radio, as well as various audio books, voiceovers, concert readings and other work. He garnered a following through his numerous appearances in cult sci-fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as dubbing the titular character in the series Monkey and Legolas in the classic BBC Radio 4 adaptation of Tolkien's The Lord of the Rings.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 2 057 3 089 11 779\n\nVarious - Don't Break Down (David Collings)\n\nMonkey (TV Series) Opening Song, Cast then and now\n\nDavid Ladd discusses his father , Alan Ladd and Shane. Transcription\n\nBiography\n\nCollings was born in Brighton on 4 June 1940.\n\nFilm and television\n\nCollings's screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television).[2] The production was broadcast live. He has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), Richard Simmons in The Shadow of the Tower (1972), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975, he portrayed William Wilberforce in The Fight Against Slavery, and he starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire & Steel TV adventures.[3] He appeared in the TV series Danger Man, Mystery and Imagination, UFO (episode \"The Psychobombs\") and Gideon's Way; in the latter, he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rodgers and others. In 1981 he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series. He voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people. He is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.[4] He has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio\n\nOn radio, he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.[5]\n\nHe was Mr Carlyle in Radio 4's 7-episode serial dramatisation of East Lynne by Mrs Henry Wood, first broadcast in June 1987.[6]\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre\n\nCollings was described by The Stage as a \"stalwart of the National and RSC\".[7] His career on stage began with seasons at the Liverpool Rep and subsequently took him all over the world with leading companies including Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays. He played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nPersonal life\n\nCollings had three children, Samuel, Eliza and Kate.\n\nHe died aged 79, on 23 March 2020.[8][9]\n\nFilmography\n\nReferences"}, {"url": "https://www.celebsagewiki.com/david-collings", "page_content": "Age, Biography and Wiki\n\nDavid Collings (David Cressy Collings) was born on 4 June, 1940 in Brighton, East Sussex, England, UK, is an Actor, Soundtrack. Discover David Collings's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of David Collings networth?\n\nPopular As David Cressy Collings Occupation actor,soundtrack Age 80 years old Zodiac Sign Gemini Born 4 June 1940 Birthday 4 June Birthplace Brighton, East Sussex, England, UK Date of death 23 March, 2020 Died Place 2020 Nationality UK\n\nWe recommend you to check the complete list of Famous People born on 4 June. He is a member of famous Actor with the age 80 years old group.\n\nDavid Collings Height, Weight & Measurements\n\nAt 80 years old, David Collings height not available right now. We will update David Collings's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is David Collings's Wife?\n\nHis wife is Karen Archer (1983 - 23 March 2020) ( his death) ( 2 children), Deirdre Bromfield (1962 - 1975) ( divorced) ( 3 children)\n\nFamily Parents Not Available Wife Karen Archer (1983 - 23 March 2020) ( his death) ( 2 children), Deirdre Bromfield (1962 - 1975) ( divorced) ( 3 children) Sibling Not Available Children Not Available\n\nDavid Collings Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is David Collings worth at the age of 80 years old? David Collings’s income source is mostly from being a successful Actor. He is from UK. We have estimated David Collings's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nDavid Collings Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.telegraph.co.uk/obituaries/2020/05/18/david-collings-actor-made-name-science-fiction-series-doctor/", "page_content": "David Collings, who has died aged 79, was a Doctor Who fans’ favourite after taking three roles in the classic television science fiction series; he first appeared as Vorus, power-mad leader of the guardians of the mines on Voga, the “planet of gold”, in the 1975 adventure “Revenge of the Cybermen”, determined to blow up the Time Lord’s enemies with his Skystriker rocket.\n\n“I was a sort of scientist/politician packed into a rubber mask and thinking, ‘Thank God they can’t see what I look like!’” Collings told the writer Alan Stevens. “In the end, he gets to fire his big rocket but then dies in the process.”\n\nThe actor was back two years later in “The Robots of Death”, his thick mop of red hair clearly visible this time while wearing what he described as a “very butch” costume. The role was Poul, a mining company’s undercover agent who proves useless – it emerges he has a fear of robots. In portraying the character’s breakdown, Collings memorably crawls around the floor sobbing."}, {"url": "https://www.smh.com.au/national/actor-famous-for-multiple-roles-in-cult-series-dr-who-20200519-p54udu.html", "page_content": "David Collings, who has died aged 79, was a Doctor Who fans' favourite after taking three roles in the classic television science fiction series; he first appeared as Vorus, power-mad leader of the guardians of the mines on Voga, the \"planet of gold\", in the 1975 adventure Revenge of the Cybermen, determined to blow up the Time Lord's enemies with his Skystriker rocket.\n\n\"I was a sort of scientist/politician packed into a rubber mask and thinking, 'Thank God they can't see what I look like!'\" Collings told the writer Alan Stevens. \"In the end, he gets to fire his big rocket but then dies in the process.\"\n\nThe actor was back two years later in The Robots of Death, his thick mop of red hair clearly visible this time while wearing what he described as a \"very butch\" costume. The role was Poul, a mining company's undercover agent who proves useless – it emerges he has a fear of robots. In portraying the character's breakdown, Collings memorably crawls around the floor sobbing.\n\nDavid Collings as Egeus and Joan Iyiola in A Midsummer Night's Dream by the RSC, High Wycombe, 2015. Credit: Getty\n\nHe returned to Doctor Who as the mutant scientist of the title in the 1983 adventure Mawdryn Undead, trying to get the ever-regenerating Time Lord to give up his remaining incarnations."}, {"url": "https://www.heraldscotland.com/opinion/18377426.obituary-david-collings-stage-tv-film-actor-took-many-roles-royal-shakespeare-company-productions/", "page_content": "Born: June 4, 1940;\n\nDied: March 23, 2020.\n\nDAVID Collings, who has died of natural causes aged 79, was a fine character actor who could imbue the roles he played with watchful intelligence, prowling intensity, sardonic humour and detached melancholy as required. His soulful eyes could ignite vividly on his striking, yet sometimes doleful, countenance - under a lustrous mane of red hair - giving him an enigmatic, otherworldly quality that made him especially useful to science-fiction productions.\n\nAs Silver in the beguiling series Sapphire and Steel (1981-82) he was an eccentric, mercurial foil to David McCallum and Joanna Lumley. A popular contributor to Doctor Who – memorably guest-starring in three stories between 1975-83 – his powerful yet nuanced performances helped to ground the fantastical with requisite realism. Actor Mark Gatiss has described him as “the greatest Doctor Who we never had”; Collings finally got to play his own incarnation of the Time Lord in an audio adventure for Big Finish (2003), capitalising on his vast experience in radio.\n\nIn BBC Radio 4’s epic and strongly cast version of The Lord of the Rings (1981) he played Legolas, and latterly he was the perfect audiobook reader for the haunting stories of MR James.\n\nHis dusky yet melodic voice, perfectly modulated, also adopted an amusingly boorish bravado for the the title character in Monkey (1979-80),the dubbed English language version of the cult Japanese TV series.\n\nDavid Cressy Collings was born in Brighton, the son of a greengrocer. Upon leaving Varndean Grammar School he worked in retail before becoming an apprentice draughtsman at a design practice.\n\nHe joined the amateur company Lewes Little Theatre, partly to help with a speech impediment, and was spotted by actress Freda Dowie, who recommended him to the Liverpool Repertory Theatre. Whilst there the actor John Slater suggested him for a three-hour, live TV production of Crime and Punishment (1964) - and so, at 24 and with no formal training, he played his first leading television role.\n\nMore notable parts followed, in Ken Russell’s Song of Summer (as an unforgettable Percy Grainger, 1968), Elizabeth R (1971, with Glenda Jackson), the BBC Shakespeare Julius Caesar (an intense Cassius, 1979), The Prince Regent (as William Pitt, 1979), A Tale of Two Cities (1980), Dark Towers (terrifying a generation of children as Lord Dark, 1981), and Press Gang (1989-93).\n\nHe also guest-starred in most popular series from Z-Cars (1965) to Holby City (2015) via UFO (1970), The Professionals (1978) and Blake’s 7 (1981). On film he was an excellent Bob Cratchit to Albert Finney’s eponymous miser in Scrooge (1970).\n\nHe was a gifted classical stage actor - his Mercutio at St George’s Theatre, Tufnell Park (1976) was, according to Kenneth Branagh, who watched it as a schoolboy, “thrilling” and “brilliant”.\n\nHe spent several seasons with the Royal Shakespeare Company, where his insightful character work benefited several good parts over the decades - a favourite engagement was touring with them from Stratford to Broadway in the 1985 revival of Nicholas Nickleby with his wife, Karen Archer, also in the cast, and their infant twins Samuel and Eliza (both destined to be actors themselves) in tow. He and Samuel also shared the stage in the Manchester Royal Exchange’s 2011 production of Edward II.\n\nHe is survived by Karen, Samuel and Eliza, his sister Nola and step-daughter Juliet and daughter Kate from his earlier marriage, to Deirdre Bromfield. Their other two children, Matthew (12) and Bethian (aged just a few months), predeceased him."}, {"url": "https://alchetron.com/David-Collings", "page_content": "David Collings (born 4 June 1940) is an English actor. In an extensive career he has appeared in countless roles on stage, television, film and radio as well as various audio books, voice over, concert readings and other media.\n\nHe has garnered a following due to his numerous appearances in cult Sci-Fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as voicing the titular character in the popular, long-running series Monkey.\n\nBiography\n\nCollings was born in Brighton on 4 June 1940.\n\nFilm and TV\n\nCollings' screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television).The production was recorded live.\n\nHe has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975 he portrayed William Wilberforce in The Fight Against Slavery, and starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire and Steel TV adventures.\n\nHe appeared in the TV series Danger Man, Mystery and Imagination, UFO and Gideon's Way- the latter of which he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rogers and others.\n\nIn 1981, he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series.\n\nHe voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people.\n\nHe is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including as Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.\n\nHe has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio\n\nOn radio he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre\n\nCollings' career on stage began with seasons at the storied Liverpool Rep., and has since taken him all over the world with leading companies including the National Theatre, the Royal Shakespeare Company and Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays.\n\nHe played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nSelected filmography\n\nSong of Summer (1968)\n\nJoanna (1968)\n\nScrooge (1970)\n\nFor the Love of Ada (1972)\n\nMahler (1974)\n\nHennessy (1975)\n\nThe Thirty Nine Steps (1978)\n\nJulius Caesar (1979)\n\nThe Outsider (1980)\n\nTangiers (1982)\n\nPersuasion (1995)\n\nThe Invisible Woman (2013)\n\nPersonal life\n\nCollings has three children, Samuel, Eliza and Kate."}, {"url": "https://www.wikizero.com/en/David_Collings", "page_content": "From Wikipedia the free encyclopedia\n\nEnglish actor (1940–2020)\n\nDavid Collings (4 June 1940 – 23 March 2020)[1] was an English actor. In an extensive career he appeared in many roles on stage, television, film and radio, as well as various audio books, voiceovers, concert readings and other work. He garnered a following through his numerous appearances in cult sci-fi series such as Doctor Who, Sapphire & Steel and Blake's 7, as well as dubbing the titular character in the series Monkey and Legolas in the classic BBC Radio 4 adaptation of Tolkien's The Lord of the Rings.\n\nBiography [ edit ]\n\nCollings was born in Brighton on 4 June 1940.\n\nFilm and television [ edit ]\n\nCollings's screen breakthrough came playing the protagonist Raskolnikov in Fyodor Dostoyevsky's Crime & Punishment (1964 with Associated-Rediffusion Television).[2] The production was broadcast live. He has played historical characters such as Percy Grainger in Ken Russell's Song of Summer (1968), Richard Simmons in The Shadow of the Tower (1972), John Ruskin in The Love School (1975), a BBC series about the Pre-Raphaelites, and Sir Anthony Babington in Elizabeth R. In 1975, he portrayed William Wilberforce in The Fight Against Slavery, and he starred as William Pitt in Prince Regent in 1979.\n\nCollings also appeared as Deva in the final episode of Blake's 7 and as the character of 'Silver' in several of the popular Sapphire & Steel TV adventures.[3] He appeared in the TV series Danger Man, Mystery and Imagination, UFO (episode \"The Psychobombs\") and Gideon's Way; in the latter, he played an emotionally disturbed man attacking young women in the episode The Prowler.\n\nCollings played the character of Bob Cratchit in the classic 1970 film musical, Scrooge, starring alongside Albert Finney, Dame Edith Evans, Sir Alec Guinness, Kenneth More, Anton Rodgers and others. In 1981 he played the dual roles of Lord Dark and The Friendly Ghost in the perennial school-children's favourite Dark Towers, part of the Look and Read series. He voiced the eponymous lead for the long-running hit Japanese television series Journey to the West, released in English-speaking countries as Monkey. The show was a popular hit and had a mass following, particularly with young people. He is also noted for his children's television appearances including the role of Julian Oakapple in Midnight is a Place (1977). In 1989 he played Charn (the villain) in Through The Dragon's Eye, and had a recurring role as the headmaster in Press Gang from 1989 to 1993.\n\nDoctor Who [ edit ]\n\nHe has appeared a number of times in the long-running British science fiction television series Doctor Who, including Vorus in Revenge of the Cybermen, Poul in The Robots of Death and Mawdryn in the serial Mawdryn Undead.[4] He has also played an alternate Doctor in the audio plays by Big Finish Productions in the Doctor Who Unbound series, Full Fathom Five, alongside other Doctor Who audio credits. Collings returned to the role of Poul- now named Paulus- in the episode Hidden Persuaders of the audio drama series Kaldor City.\n\nRadio [ edit ]\n\nOn radio, he portrayed Legolas in the classic BBC Radio 4 adaptation of The Lord of the Rings.[5]\n\nHe was Mr Carlyle in Radio 4's 7-episode serial dramatisation of East Lynne by Mrs Henry Wood, first broadcast in June 1987.[6]\n\nIn 2006, Collings was the reader of the critically acclaimed recordings of The Complete Ghost Stories of M. R. James.\n\nTheatre [ edit ]\n\nCollings was described by The Stage as a \"stalwart of the National and RSC\".[7] His career on stage began with seasons at the Liverpool Rep and subsequently took him all over the world with leading companies including Cheek by Jowl, as well as BAM and the Lincoln Center in New York.\n\nHe has had a long theatre career appearing in various productions in the UK, US and globally, ranging from Shakespeare and his contemporaries, classical works, Restoration dramas and farce, through to contemporary classics and new plays. He played the parts of Mortimer the Elder and Matrevis in a production of Edward II at the Royal Exchange, Manchester, which also featured his son, the actor Samuel Collings. He also appeared as the King of France in Henry V, and most recently Giles Corey in The Crucible at the same venue.\n\nPersonal life [ edit ]\n\nCollings had three children, Samuel, Eliza and Kate.\n\nHe died aged 79, on 23 March 2020.[8][9]\n\nFilmography [ edit ]"}], "David Collings trained at the Royal Academy of Dramatic Art.": [{"url": "https://www.theguardian.com/stage/2020/mar/26/david-collings-obituary", "page_content": "After a spectacular start to his television career in the 1960s, when he played leading roles in two classics by Dostoevsky, the actor David Collings, who has died aged 79, became a cult favourite of sci-fi fans with weird appearances in UFO (produced by the Thunderbirds team of Gerry and Sylvia Anderson), three Doctor Who sagas and the 1979 supernatural detective series Sapphire and Steel, co-starring Joanna Lumley and David McCallum.\n\nAlthough he started out on the stage, Collings did not consolidate his reputation there until completing more than a decade of television stardom, after which he was in a string of important roles for the Royal Shakespeare Company.\n\nAt the Open Air theatre in Regent’s Park he was a genuinely funny Polonius opposite newcomer Damian Lewis’s firebrand Hamlet in 1994, directed by Tim Pigott-Smith; he had first played a tetchy but benignly well-meaning Polonius for an RSC touring production with Philip Franks in 1987.\n\nCollings was a fine featured, red-haired actor with sensitive blue eyes who was equally good at playing neurotic and sweet-natured characters. On television he also ran a good line in eminent characters from history: Percy Grainger in Ken Russell’s Song of Summer (1968), Sir Anthony Babington in Elizabeth R (1971), John Ruskin in The Love School (1975), William Wilberforce in The Fight Against Slavery (1975) and William Pitt in Prince Regent (1979).\n\nHe was born in Brighton, East Sussex, to George Collings, a greengrocer, and his wife, Lillian (nee Parsons). At Varndean grammar school he enjoyed acting but had no thoughts of setting out to be a professional actor and, on leaving, started work as a designer in lettering, inheriting that interest from his father, a keen artist. From 1960 he was happily involved in amateur dramatics for the Withdean Players and the Lewes Little theatre, but then was recommended by the actor Freda Dowie to the director David Scase, who had been appointed to run the Liverpool Rep.\n\nAfter six months in rep, Collings found himself pitched into television through another unsolicited recommendation, this time from the actor John Slater, who thought he might be suitable casting in a 1964 Play of the Week presentation of Crime and Punishment. Thus he found himself playing the impoverished tragic hero, Raskolnikov, murderer of an old pawnbroker, in a three-and-a-half hour existential epic alongside Steven Berkoff, Peter Bowles, Julia Foster and Sylvia Coleridge.\n\nFive years later, in 1969, he was in another mighty Dostoevsky production, a BBC version in six episodes of The Possessed, as the charismatic rabble-rouser Pyotr Verkhovensky, alongside Rosalie Crutchley, Joan Hickson and Angela Pleasence. In the same year he was the Clerk in a BBC adaptation in seven long episodes of Chaucer’s Canterbury Tales, with Barbara Jefford as the Wife of Bath and Barry Linehan as the Miller.\n\nHe made a rare feature movie appearance as a lovable Bob Cratchit in the musical Scrooge (1970), with Albert Finney, in the same year as he was captured by aliens and imbued with superhuman powers in UFO. In Doctor Who he was an alien himself, in a rubber mask, with ideas of blowing up the Cybermen with a home-made rocket in 1975; a robot-phobic, Poul, in a 1977 narrative that found him crawling round the floor and sobbing; and in 1983, Peter Davison having succeeded Tom Baker in the title role, he was mistaken for the good doctor before mutating into a mutant with a wild spaghetti hairstyle.\n\nCollings as Bob Cratchit in the 1970 film Scrooge, with Frances Cuka as his wife. Photograph: Allstar/Waterbury\n\nPausing only to play Legolas in Lord of the Rings on BBC Radio 4 in 1981, and a guest appearance in the final wipe-out episode of Blake’s 7, Collings joined the RSC for the first time as Newman Noggs in the 1985 revival of David Edgar’s Nicholas Nickleby on tour and on Broadway. He also appeared in a star-studded chorus in the fine Don Taylor television script of Sophocles’ Oedipus (1986), with Michael Pennington, Claire Bloom and John Gielgud.\n\nFor the RSC subsequently, between 1996 and 2001, he played Thomas Cranmer in Henry VIII, Baron de Charlus in Tennessee Williams’s Camino Real, Count Lerma in Schiller’s Don Carlos, Sir Politic Would-Be in Ben Jonson’s Volpone, Cardinal Pandulph in King John and Sancho in Lope de Vega’s Madness in Valencia. You could not devise a more varied roster of roles, but he discharged them all with a bitter charm and watchful, wary eye.\n\nIn this millennium, he played a neat double of Sir Henry Green and the Duke of Surrey in Kevin Spacey’s Richard II (2005), directed by Trevor Nunn at the Old Vic, and graced a startling revival of Middleton and Rowley’s Jacobean shocker The Changeling (2006) for Declan Donnellan’s Cheek by Jowl company at the Barbican; the cast also included Will Keen, Olivia Williams and an unknown but tremendous Tom Hiddleston.\n\nA favourite “job” was appearing with his son, Samuel, in Toby Frow’s 1950s revival of Marlowe’s Edward II at the Royal Exchange, Manchester, in 2011; he was old Mortimer and Matrevis while Sam doubled as the king’s lover, Piers Gaveston, and his poker-wielding murderer, Lightborn.\n\nCollings was married firstly to Deirdre Bromfield, whom he met at the Lewes Little theatre, in 1962 (they divorced in 1975), and secondly to the actor Karen Archer in 1983, from whom he was separated, although they remained close friends. He is survived by Karen, by their children, Samuel and Eliza, his daughter, Kate, from his first marriage, and his sister, Nola. He was predeceased by Deirdre and two of their children, Matthew and Bethian."}, {"url": "https://www.rada.ac.uk/", "page_content": "Please help us secure RADA’s future and keep the door open to the next generation of talent.\n\nThe pandemic has had a devastating impact on RADA’s finances and our ability to deliver world-class training. We urgently need to raise £3.2m over the next four years to recover and rebuild, and to support our students. This campaign is Stage Critical.\n\nFind out more"}, {"url": "https://www.ranker.com/list/famous-royal-academy-of-dramatic-art-alumni-and-students/reference", "page_content": "List of famous alumni from Royal Academy of Dramatic Art, with photos when available. Prominent graduates from Royal Academy of Dramatic Art include celebrities, politicians, business people, athletes and more. This list of distinguished Royal Academy of Dramatic Art alumni is loosely ordered by relevance, so the most recognizable celebrities who attended Royal Academy of Dramatic Art are at the top of the list. This directory is not just composed of graduates of this school, as some of the famous people on this list didn't necessarily earn a degree from Royal Academy of Dramatic Art.\n\nGemma Arterton and Mischa Barton are included on this list along with many more.\n\nThis list answers the questions “Which famous people went to Royal Academy of Dramatic Art?” and “Which celebrities are Royal Academy of Dramatic Art alumni?”"}, {"url": "https://simple.wikipedia.org/wiki/Royal_Academy_of_Dramatic_Art", "page_content": "The Royal Academy of Dramatic Art (RADA) is a drama school in London, England. It is one of the oldest drama schools in the United Kingdom. It was founded in 1904 by Herbert Beerbohm Tree. It is thought to be one of the best drama schools in the world.[1] Architect Bryan Avery designed the university.\n\nThe President of RADA is actor Kenneth Branagh since the death of Richard Attenborough in August 2014. The Vice-Chairman is yet to be announced since the last one Alan Rickman died while in position in January 2016.[2] Many famous actors have studied here.\n\nNotable alumni [ change | change source ]\n\nOther websites [ change | change source ]\n\nMedia related to Royal Academy of Dramatic Art at Wikimedia Commons\n\n\n\n"}, {"url": "https://www.royalacademy.org.uk/page/collections-and-research", "page_content": "The Collection began with the foundation of the Royal Academy in 1768, with works of art often being given by the artists themselves. They were intended to show the talents of the British School and provide inspiration for new generations of British artists.\n\nIt now contains about 935 paintings, 350 sculptures, 700 plaster casts, 25,000 prints and drawings and 5,000 historic photographs. The Collection’s central focus is on British art and artists from the 18th century to the present day.\n\nYou will find some of these works on display around the building; ranging from the Michelangelo Tondo and a 16th-century copy of Leonardo Da Vinci’s Last Supper to the most recent additions to the Collection by Royal Academicians. Many of our Collection works are on display in the Collection Gallery, which is open and free to all.\n\nKey features of the Collection are outlined below. Individual objects can be explored through our online search feature."}, {"url": "https://www.ranker.com/list/famous-royal-college-of-art-alumni-and-students/reference", "page_content": "List of famous alumni from Royal College of Art, with photos when available. Prominent graduates from Royal College of Art include celebrities, politicians, business people, athletes and more. This list of distinguished Royal College of Art alumni is loosely ordered by relevance, so the most recognizable celebrities who attended Royal College of Art are at the top of the list. This directory is not just composed of graduates of this school, as some of the famous people on this list didn't necessarily earn a degree from Royal College of Art.\n\nThe list you're viewing has a variety of graduates in it, like Alan Rickman and Ridley Scott.\n\nThis list answers the questions “Which famous people went to Royal College of Art?” and “Which celebrities are Royal College of Art alumni?”"}, {"url": "https://www.cambridgeactingacademy.co.uk/about", "page_content": "About\n\nHelen Strange is lead tutor and founder of the Cambridge Acting Academy. She is a highly experienced acting coach and director who during her 30 years at the Royal Academy of Dramatic Art has trained many of our top actors on stage and screen, as well as the current artistic directors of the Royal National Theatre and The Globe. As well as working at RADA Helen has been on the faculties of the Sorbonne, Middlesex University, Richmond University, and the University of Cambridge and been a visiting lecturer at many others. She has taught at Drama Studio, London Studio Centre, Italia Conti, Webber Douglas Academy, The Royal Central School of Speech and Drama, Manchester Theatre School and Birmingham School of Drama. Her professional work includes The Royal National Theatre, The Royal Court and the Royal Exchange and has taken her to the USA, Canada and Japan. She has worked extensively with dance and physical theatre companies including Transitions, The Phoenix Dance company and the Kosh.\n\n\n\nHer directing credits at RADA include The White Devil, Tis Pity She’s a Whore, Hamlet, The Merchant of Venice, As You Like It, A Midsummer Night’s Dream, Thyestes, Alcestis, Agamemnon, Oedipus, The Women of Troy, The Bacchae, The Family Reunion and Scenes from Moliere.\n\n​\n\nHelen studied French and Drama at Hull University and later trained in Voice at The Central School of Speech and Drama and in Physical Theatre with Jacques Lecoq and Etienne Decroux in Paris. She has an M.Phil from the Shakespeare Institute in Stratford and a PGCE from Goldsmiths College.\n\n\n\nStarting out as an actress in Theatre in Education, she helped form the first professional theatre company in Buckinghamshire.\n\n\n\nShe has worked in schools, youth theatres and community theatre, adapting and directing A Midsummer Nights Dream, The Tempest, Twelfth Night and Macbeth for performance by 7– 14-year olds. Other community theatre directing credits include The Weavers, Spring Awakening, Flies on the Wall, Dream Date, You, Me and Mrs Jones, and Daughters of Venice.\n\n​\n\nPlease get in contact to discuss your next step in acting training."}, {"url": "https://www.thefreedictionary.com/dramatic+art", "page_content": "An honest and natural slum dialect is more tolerable than the attempt of a phonetically untaught person to imitate the vulgar dialect of the golf club; and I am sorry to say that in spite of the efforts of our Academy of Dramatic Art , there is still too much sham golfing English on our stage, and too little of the noble English of Forbes Robertson.\n\nMonsieur de Marquet was beginning to be a \"noble old gentleman.\" Generally he was extremely polite and full of gay humour, and in all his life had had but one passion,--that of dramatic art . Throughout his magisterial career he was interested solely in cases capable of furnishing him with something in the nature of a drama.\n\nEducated in the United Kingdom at Charterhouse School and Oxford University, Suhrawardy attended the Royal Academy of Dramatic Art in London after which he joined the Royal Shakespeare Company.\n\nWe heard there could well be a bright future in store for would-be actress Kaitlyn and would-be rap star Dylan - but the problem is that bright future would seem to involve the capital rather than Redcar (the Royal Academy of Dramatic Art and a London record company).\n\nSummary: The British-born actor trained at the Webber-Douglas School of Dramatic Art and started his career in British films as an extra in 1933\n\nTEESSIDE students are celebrating after receiving a string of offers from top theatre schools, including the world-renowned London Academy of Music and Dramatic Art (LAMDA).\n\nThe classes will be conducted by the Dubai-based Centre Stage Arts, and will offer trainees the chance to receive a certificate from the London Academy of Music and Dramatic Art (LAMDA).\n\nHelen - who has a daughter with Celtic star Scott Sinclair - completed a course at London's Royal Academy for Dramatic Art . She posted a pic on Instagram and told fans: \"Had the most amazing time on my two-week course at RADA.\n\nWhich actor and theatre manager founded the Royal Academy of Dramatic Art ? Who wrote the historical romance Lorna Doone?\n\nCoburn, this two-hander really is a slip of a thing, elevated to dramatic art by captivating Broadway performances from two of the most enchanting actors you'd ever hope to see on the same stage."}, {"url": "https://www.theguardian.com/tv-and-radio/2019/oct/16/leah-bracknell-obituary", "page_content": "The actor Leah Bracknell, who has died of cancer aged 55, made her name on television playing the first lesbian character in a British soap. She joined Emmerdale as the aspiring vet Zoe Tate, whose family moved into Home Farm, in the fictional Yorkshire Dales village of Beckindale, in 1989.\n\nZoe was the daughter of a millionaire haulage firm boss, Frank Tate (Norman Bowler), and stepdaughter of his second wife, Kim (Claire King). Bracknell quickly outgrew life as a satellite character. Zoe took a job at a veterinary practice in the nearby village of Hotton, then left for New Zealand to become a flying vet – giving Bracknell the first of two maternity-leave breaks from the serial.\n\nOn her return, Zoe eventually set up her own practice. By then, the village had changed its name to Emmerdale and the character had realised that she was not attracted to men. Weathering a string of soap-opera dramas, Bracknell steered Zoe through many relationships, schizophrenia, drink problems, the birth of a daughter after a brief encounter with Scott Windsor (Ben Freeman) and, six years apart, acquittals on charges of murder and attempted murder.\n\nIn 2005, after 16 years in Emmerdale, Bracknell announced she was taking a nine-month break to spend more time with her family and qualify as a teacher of yoga – which she found helped her to relax and stay calm during her busy schedule. In the event, she never returned to the soap. “I loved playing Zoe but by the time I left she was an emotional wreck,” Bracknell explained later. “I wasn’t sure where else I could take her.”\n\nZoe’s final scene – in which she blew up her family’s former home after being blackmailed into selling it – was named best exit in the 2006 British Soap awards. More significantly, Bracknell was widely praised for her screen portrayal of an LGBT character – not “having to wear a sign around her neck that constantly reinforced her sexuality,” wrote one observer – although she herself was most proud of the sensitive way in which she tackled Zoe’s mental illness.\n\nIn October 2016, a huge outpouring of generosity followed the actor’s announcement that she had terminal lung cancer. Bracknell launched an appeal to raise £50,000 for treatment in Germany that was not available on the NHS in Britain, and it hit its target within three days. She wrote about her experiences of cancer in a blog, Something Beginning With C.\n\nShe was born in London as Alison Bracknell, the daughter of Li-Er Hwang, a Chinese-Malayan actor, and David Bracknell, an assistant director of feature films. Her father met her mother when he was working on the film The World of Suzie Wong (1960), in which Li-Er appeared as Wednesday Lu. Later, Bracknell adopted the name Leah as an anglicisation of her mother’s name.\n\nShe was brought up in London and Oxford and made her screen debut as a child in four episodes of the Children’s Film Foundation serial The Chiffy Kids (1976-78), directed by her father and screened in cinemas during Saturday matinees.\n\n“I wanted to be an actress from the age of five,” Bracknell told me at the height of her fame in Emmerdale. “I used to hang out with the technicians when my father was making films and inevitably you pick up the whole atmosphere. I spent years bullying him into giving me things to do until he finally let me appear in The Chiffy Kids.”\n\nOn leaving school, Bracknell spent a year in New Zealand during which she visited her father on the set of the 1983 film Savage Islands in Fiji and persuaded him to let her help in the wardrobe department.\n\nBack in Britain, she did modelling and TV commercials, formed a cabaret act with a friend, and trained at the Webber Douglas Academy of Dramatic Art in London (1984-87). Stage roles followed with the Oxford Players, Klaxon and Pandemonium theatre companies, and Eastern Actors’ Studio, and there were small parts on television in Cannon & Ball, The Bill and the 1989 TV movie Dealers.\n\nAfter leaving Emmerdale, Bracknell returned to stage work and had TV guest roles in Judge John Deed (2007), Casualty 1907 (2008), A Touch of Frost (2010), Doctors (three characters, 2007-11) and DCI Banks (2011). She was also a regular in the 2008 daytime hospital soap The Royal Today as Jenny Carrington, the no-nonsense matron who ruled the wards with a rod of iron at the fictional St Aidan’s Royal Free hospital, which was also the setting for the peak-time drama The Royal, set in the 1960s.\n\nAlongside teaching yoga and practising shamanic healing, Bracknell established a jewellery collection of her own designs using materials such as glass beads, coral and lacquer, and named after female Shakespeare characters. She donated a percentage of the profits to Wheatfields hospice, Leeds, and the mental health charity Rethink.\n\nBracknell is survived by her husband, Jez Hughes, whom she married in 2017, and by Lily and Maya, the children from her earlier relationship with the director-turned-writer Lyall Watson.\n\nLeah (Alison Rosalind) Bracknell, actor, born 12 July 1964; died 15 September 2019"}]}