{"William Quinn was born in New York City.": [{"url": "https://www.williamquinnpainter.com/biography", "page_content": "Quinn’s love affair with Europe began as early as 1957 when the University awarded him a Milliken Foreign Travel Scholarship to spend a year painting in Rome. Subsequently he spent sabbaticals in Greece (1963) and Paris (1982), and often painted during summers in Europe. In his work, Quinn uniquely synthesized the elements of the European modernists with the gestural style of “Action Painting” common to certain American Abstract Expressionists.\n\nAfter completing his teaching career in 1991 Quinn moved with his Belgian-born wife Jeannine to Bruges, where he now has his studio. In this ‘European Period’ he has pulled out all the stops. The paintings are spacious and bold, often with surprising color combinations that have always been an engaging aspect of his work.\n\nMany of the recent works have white grounds in tension with aggressive, contrasting planes. Others have linear structures that seem to create a ‘real’ space, but then the lines dart back to surface, asserting the paintings’ two-dimensionality, sometimes suggesting landscape or figurative elements. William Quinn works on one painting at a time, not in a series, as he abhors repeating himself. As a result, each painting is a new experience both for the painter and viewer.\n\nThroughout the years Quinn has exhibited widely in the U.S. and Europe, winning many prizes in competitive exhibitions. Perhaps the strongest validation of the strength and truth of Quinn’s vision is the amazing zest with which he continues to pour forth images that are ever fresh and new and full of the power to enchant.\n\n- Genevieve Linnehan\n\n"}, {"url": "https://www.findagrave.com/memorial/6823124/bill-quinn", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.askart.com/artist/William_Quinn/123978/William_Quinn.aspx", "page_content": "Contribute to Developing the Biography for William Quinn ×\n\nPlease note: Artists not classified as American in our database may have limited biographical data compared to the extensive information about American artists.\n\n\n\nCreating biographies or improving upon them is a work in progress, and we welcome information from our knowledgeable viewers.\n\n\n\nIf you feel you have worthwhile information you would like to contribute, the following means of submission is the most efficient. We welcome your involvement!\n\n\n\n1. For Premier Dealers and museums already registered with askART your best approach is to log in, choose the artist (once he/she is in your list of artists), and submit your biography there. If you are a dealer or museum not currently registered, please click here to register, and then you may select your artist and submit a biography.\n\n\n\n2. For all others who have useful information about this artist, please email the information to registrar@askart.com. Please note: All biographies will be fully viewable on Fridays, but the rest of the week biographies are available only to subscribers.\n\n\n\nBiography Guidelines\n\nWhen submitting biographical information, we appreciate your consideration of the following:\n\n\n\nPlease keep in mind that askART is not a promotional site, and accordingly biographical information should not be worded for purposes of 'advertising' an artist.\n\n\n\nOur site is about PAINTERS, SCULPTORS, and ILLUSTRATORS. If you do not know a great deal about the artist, but have noteworthy information to share, we would welcome you to send it also to registrar@askart.com. It is rewarding for all of us to see artists' files grow, and others may be eager to supplement what you have provided.\n\n\n\nNon-Dealers and Museums:\n\nPlease introduce your information as follows: \"The following biographical information has been provided by Jane Doe, the niece of the artist.\"\n\n\n\nDealers and Museums will be automatically credited with a link to their sites.\n\n\n\nJust the facts, please. Our editors are trained to delete any hype or advertising verbiage such as “most famous,” “internationally renowned,” “extraordinarily beautiful works.”\n\n\n\nIf you do not know a great deal about the artist, answer as many of the following questions as you can. Other persons, seeing your entry, often add to the data. This is how many of the biographies grow.\n\n\n\nPlease include in your biography answers to as many of the following questions as possible:\n\nWhat are the subjects and styles ( and other distinctive characteristics) for which the artist’s work is best known?\n\nand other distinctive characteristics) for which the artist’s work is best known? Is the artist identified with any particular art movements, or artists , who influenced his or her work?\n\n, who influenced his or her work? Where, when, and under whom did the artist receive education and training ?\n\n? Can you provide all relevant personal background information on the artist?\n\non the artist? In which Art Organizations was the artist a member?\n\nwas the artist a member? Can you provide a list of all major museum and artist association exhibitions ? ( excluding commercial art galleries ).\n\n? ( ). What awards or other recognition did the artist win?\n\nor other recognition did the artist win? What museums (name, city, and state) currently hold works by the artist in their permanent collections?\n\n(name, city, and state) currently hold works by the artist in their permanent collections? Required : What are the sources for your information? For books, list title, author, date of publication. (Optional: cite number of pages and yes/no if there are color images.) For magazine articles, cite title of article, author, title of publication, date, and page number if possible.\n\n: What are the for your information? For books, list title, author, date of publication. (Optional: cite number of pages and yes/no if there are color images.) For magazine articles, cite title of article, author, title of publication, date, and page number if possible. Required : the name of the person submitting the information.\n\n\n\nDealer Note: Please enter books, periodicals and museum references in the space provided. Do not combine book information with biography.\n\n\n\nThere are many strong biographies that you may refer to on our website, such as Cecilia Beaux, Edward Hopper, and Paul Sample. Please do not submit biographies with minimal facts or excessively promotional writing such as the following (unusable) wording:\n\n\n\nWhat NOT to send:\n\n\"The artist John Doe is the quintessential master of light, color, and scene. His brilliant canvases are full of feeling, where love can be felt through all the senses. Through his skillful brushwork, and drawing from his life experiences, he creates images where the viewer feels he has truly become one with the subject. Doe's paintings are sure to be sought by the discriminating collector. I/we have numerous spectacular works by Doe available for sale.\"\n\n\n\nWe appreciate your participation in askART. If you have any questions about submitting biographies, please send them to registrar@askart.com\n\nShare an image of the Artist."}, {"url": "https://www.ancientfaces.com/person/william-quinn-birth-1938-death-1983/16220767", "page_content": "Refresh this page to see various historical events that occurred during William's lifetime.\n\nIn 1938, in the year that William Quinn was born, on October 30th, a Sunday, The Mercury Theatre on the Air broadcast Orson Welles' special Halloween show The War of the World's. A clever take on H.G. Wells' novel, the show began with simulated \"breaking news\" of an invasion by Martians. Because of the realistic nature of the \"news,\" there was a public outcry the next day, calling for regulation by the FCC. Although the current story is that many were fooled and panicked, in reality very few people were fooled. But the show made Orson Welles' career.\n\nIn 1947, he was just 9 years old when on November 25th, the Hollywood \"Black List\" was created by the House Un-American Activities Committee (HUAC). Ten Hollywood writers and directors had refused to testify to the Committee regarding \"Communists\" or \"Reds\" in the movie industry. The next day, the blacklist was created and they were fired.\n\nIn 1954, William was 16 years old when on May 17th, the Supreme Court released a decision on Brown v. Board of Education of Topeka. The ruling stated that state laws establishing separate public schools for black and white students was unconstitutional thus paving the way for integration in schools.\n\nIn 1973, by the time he was 35 years old, on January 28th, the Paris Peace Accord was signed - supposedly ending the Vietnam War. Hostilities continued between North and South Vietnam and the U.S. continued to bomb. But by August 15, 1973, 95% of American troops had left Vietnam. The war ended in 1975 with the fall of Saigon.\n\nIn 1983, in the year of William Quinn's passing, on August 30th, the Soviet Union claimed that a South Korean Boeing 747 jetliner (Flight 007), bound for Seoul from New York City, had strayed into Soviet airspace. Saying that they believed it to be a U.S. spy plane, the passenger jet was shot down by a Soviet SU-15 fighter - after it had tracked the airliner for two hours. All 269 passengers (including a U.S. Representative from Georgia) and crew were killed."}, {"url": "https://www.findagrave.com/memorial/171109424/william-francis-quinn", "page_content": "Son of Patrick Quinn and Hannah Maloney, husband of Catherine C. Price, the daughter of Thomas Price and Mary Halloran, whom he married on February 11, 1917 in Brooklyn, NY, and father of Regina M. (married Edward Bernard Carr), William Joseph, Catherine T. (married William James Eberling), and Mary Rose Quinn (married Patrick Joseph Prunty).\n\n\n\nIn 1880, William Quinn, aged 8, born in New York, was living at 258 Prospect Avenue, Brooklyn, NY, in the home of his parents, Patrick Quinn, aged 42, and Hannah Quinn, aged 40, both born in Ireland, with siblings, Edward Quinn, aged 17, Mary Quinn, aged 13, and Thomas Quinn, aged 5, all born in New York. His father was shown to be a laborer.\n\n\n\nIn 1900, William Quinn, aged 17, a day laborer, was living at 244 Prospect avenue, Brooklyn, NY, in the home of his parents, Patrick Quinn, aged 57, a watchman, and Hannah Quinn, aged 54, both born in Ireland and married in 1865, and siblings, Mary Quinn, aged 27, and Thomas Quinn, aged 22, a printer.\n\n\n\nCertificate of Marriage - Church of Holy Family, 205 14th Street, Brooklyn, N.Y. This is to certify that William Francis Quinn and Catherine Price were lawfully married on the 11th day of February, 1917, according to the Rites of the Roman Catholic Church and in conforming with the laws of the State of New York, Rev. John J. Doyle, officiating, in the presence of Joseph J. Anderson, and Clara Price, Witnesses, as appears from the Marriage Register of this Church.\n\nDated November 26, 1937. Rev. Merrill F. Yeager.\n\n\n\nObituary - Quinn - On April 14, 1948, at his residence, 144-20 Farmers Boulevard, William F., beloved husband of Catherine (nee Price) Quinn; beloved father of Mrs. Edward B. Carr, Mrs. William Eberling, Mary Rose Quinn; also one grandchild survives. Funeral from his home Saturday, 9 a.m.; thence to Christ The King R.C. Church, where a Solemn Requiem Mass will be offered.\n\n\n\nDeath Record - William F. Quinn, aged 65, married, of 144-20 Farmers Boulevard, Springfield Gardens, New York, a foreman for the Edison Company, born May 19, 1872 in Brooklyn, New York, the son of Patrick Quinn and Hanna Maloney, both of Ireland, and husband of Catherine, died on April 14, 1948 in New York City, Queens, New York, and was buried on April 17, at Holy Cross Cemetery.\n\n\n\n(1880, 1900 US Federal Census; Wm Francis Quinn in the New York, New York, Extracted Marriage Index, 1866-1937, Certificate Number: 2118; The Brooklyn Daily Eagle (Brooklyn, New York), 15 Apr 1948, Thursday, Page 15; New York, New York City Municipal Deaths, 1795-1949, Reference ID cn 3612, GS Film Number 2194776)\n\nSon of Patrick Quinn and Hannah Maloney, husband of Catherine C. Price, the daughter of Thomas Price and Mary Halloran, whom he married on February 11, 1917 in Brooklyn, NY, and father of Regina M. (married Edward Bernard Carr), William Joseph, Catherine T. (married William James Eberling), and Mary Rose Quinn (married Patrick Joseph Prunty).\n\n\n\nIn 1880, William Quinn, aged 8, born in New York, was living at 258 Prospect Avenue, Brooklyn, NY, in the home of his parents, Patrick Quinn, aged 42, and Hannah Quinn, aged 40, both born in Ireland, with siblings, Edward Quinn, aged 17, Mary Quinn, aged 13, and Thomas Quinn, aged 5, all born in New York. His father was shown to be a laborer.\n\n\n\nIn 1900, William Quinn, aged 17, a day laborer, was living at 244 Prospect avenue, Brooklyn, NY, in the home of his parents, Patrick Quinn, aged 57, a watchman, and Hannah Quinn, aged 54, both born in Ireland and married in 1865, and siblings, Mary Quinn, aged 27, and Thomas Quinn, aged 22, a printer.\n\n\n\nCertificate of Marriage - Church of Holy Family, 205 14th Street, Brooklyn, N.Y. This is to certify that William Francis Quinn and Catherine Price were lawfully married on the 11th day of February, 1917, according to the Rites of the Roman Catholic Church and in conforming with the laws of the State of New York, Rev. John J. Doyle, officiating, in the presence of Joseph J. Anderson, and Clara Price, Witnesses, as appears from the Marriage Register of this Church.\n\nDated November 26, 1937. Rev. Merrill F. Yeager.\n\n\n\nObituary - Quinn - On April 14, 1948, at his residence, 144-20 Farmers Boulevard, William F., beloved husband of Catherine (nee Price) Quinn; beloved father of Mrs. Edward B. Carr, Mrs. William Eberling, Mary Rose Quinn; also one grandchild survives. Funeral from his home Saturday, 9 a.m.; thence to Christ The King R.C. Church, where a Solemn Requiem Mass will be offered.\n\n\n\nDeath Record - William F. Quinn, aged 65, married, of 144-20 Farmers Boulevard, Springfield Gardens, New York, a foreman for the Edison Company, born May 19, 1872 in Brooklyn, New York, the son of Patrick Quinn and Hanna Maloney, both of Ireland, and husband of Catherine, died on April 14, 1948 in New York City, Queens, New York, and was buried on April 17, at Holy Cross Cemetery.\n\n\n\n(1880, 1900 US Federal Census; Wm Francis Quinn in the New York, New York, Extracted Marriage Index, 1866-1937, Certificate Number: 2118; The Brooklyn Daily Eagle (Brooklyn, New York), 15 Apr 1948, Thursday, Page 15; New York, New York City Municipal Deaths, 1795-1949, Reference ID cn 3612, GS Film Number 2194776)"}, {"url": "https://localwiki.org/oakland/William_H._Quinn", "page_content": "William Harry Quinn (b. December 1839) was the first owner of the William H. Quinn House. He worked for Huntington, Hopkins and Company, a hardware and manufacturing company owned by two of The Big Four, Collis Huntington and Mark Hopkins.\n\nQuinn was born in New York, and married Florence A. Quinn (June 1847–1908). They had three children, William H. Quinn, Jr. (November 21, 1870–January 19, 1954), Charles C. Quinn (1872–1920), and Edward Morgan Quinn (October 12, 1878–May 5, 1950). They moved from New York in 1872. William H.’s parents, William J. Quinn (1807–1881) and Frances Quinn (1814–1908), may have lived with them.\n\nWilliam H. Quinn, Jr.'s sister, Marie Frances Quinn (1849-?) married Albert W. Havens (March 4, 1847-?), brother of Frank C. Havens. There are notes on the society page like \"Mrs. W. H. Quinn, assisted by Mrs. A. W. Havens and Mrs. F. C. Havens, will receive at 1217 Castro street\" 3, so clearly the Quinn and Havens families spent time together. They also did business together: \"New Incorporations: The Home Benefit Life Association. Directors — S. , Baker, W..H. Chickering, W. H. Quinn, J. P. Allen and F. C. Havens.\" 4\n\nAccording to the LPAB presentation, Quinn worked his way up from clerk to manager of Huntington, Hopkins and Co.’s San Francisco branch. 1 However, a newspaper article lists him as a director in the 1888 incorporation, along with W. V. Huntington (Collis’ father). 2\n\nEdward served in the army as a pay clerk in WWI, and is buried in the Golden Gate National Cemetery in San Bruno.\n\nDeath and Burial\n\nWilliam H. Quinn’s grave marker (in Mountain View Cemetery, plot 12, lot #85) has sunk, so his date of death is unclear. Florence died in 1908 (the marker says 1907, but the paper reported it in 1908). They are buried along with William, Jr., Charles, Frances, William J., and John C. Quinn (September 1, 1850–October 16, 1875). Note that Florence’s marker says she was born in 1849, but various records indicate 1847. The lot marker has the names “Quinn” and “Havens” on the marble curb, but it's not yet known who all is buried in the lot.\n\nHavens and Quinn Florence A. Quinn’s marker\n\nphoto from Our Oakland William H. Quinn’s marker\n\nphoto from Our Oakland\n\nAdditional links\n\nfrom JL: [ It would appear that William H. Quinn is buried in Mountain View Cemetery … Does anyone have additional information about him? It would appear that in October 30, 1889 he was an attorney witnessing a will; in July 23, 1938 he was the Deputy District Attorney; and in October 22, 1963 the City Attorney … however, given such a vast span of years I’m guessing that the articles refer to a father and son of the same name. There is another reference to Capt. William H. Quinn on April 11, 1944.]\n\nI’m not sure the attorneys were related. After some research, I can safely say that William Quinn was a relatively common name c.1900. Besides clerks, managers, attorneys, sailors, and doctors, I’ve found references to William Quinns in the Bay Area that were plumbers, policemen, and soldiers. Further afield, there were William Quinns that were horse trainers, firemen, and rail employees (gruesome death). - Gene\n\nCould one of the attorneys, (district attorney, city attorney, etc.) mentioned in the Oakland Tribune have been his son, William H. Quinn, Jr., or later on perhaps a grandson? JL\n\nStill searching. Could be related, but in 1938 William H. Jr would have been 68 years old. So more likely a grandson or other relative. But surprisingly little turning up so far. Can you post or email me the PDFs of the Tribune articles? Can’t access them except at library. - Gene"}, {"url": "https://www.ancientfaces.com/person/william-quinn-birth-1938-death-1983/16220767", "page_content": "Refresh this page to see various historical events that occurred during William's lifetime.\n\nIn 1938, in the year that William Quinn was born, on October 30th, a Sunday, The Mercury Theatre on the Air broadcast Orson Welles' special Halloween show The War of the World's. A clever take on H.G. Wells' novel, the show began with simulated \"breaking news\" of an invasion by Martians. Because of the realistic nature of the \"news,\" there was a public outcry the next day, calling for regulation by the FCC. Although the current story is that many were fooled and panicked, in reality very few people were fooled. But the show made Orson Welles' career.\n\nIn 1948, when he was just 10 years old, on May 14th, the State of Israel was proclaimed by David Ben-Gurion, who became Israel's first Premier, and the U.S. officially recognized Israel. That evening, Egypt launched an air assault on Israel.\n\nIn 1959, when he was 21 years old, on August 8th, Hawaii became the 50th state of the United States. The US flag was changed to show 50 stars.\n\nIn 1965, William was 27 years old when from August 11 to 16, riots broke out in Watts, a Black section of Los Angeles. An allegedly drunk African-American driver was stopped by LA police and, after a fight, police brutality was alleged - and the riots began. 34 people died in the rioting and over $40 million in property damage occurred. The National Guard was called in to help the LA police quell rioting.\n\nIn 1983, in the year of William Quinn's passing, \"crack\" cocaine was developed in the Bahamas and spread to the United States. Previously, cocaine had been cut with other substances, diluting it. Crack was 80% pure and therefore was more addictive. It was also cheaper, making it more easily available to low income neighborhoods."}, {"url": "https://www.ancientfaces.com/person/william-d-quinn-birth-1933-death-1989/122389408", "page_content": "Refresh this page to see various historical events that occurred during William's lifetime.\n\nIn 1933, in the year that William D Quinn was born, on December 5th, the Twenty-first Amendment to the United States Constitution was ratified. The 21st Amendment said \"The eighteenth article of amendment to the Constitution of the United States is hereby repealed.\" Alcohol was legal again! It was the only amendment to the Constitution approved for the explicit purpose of repealing a previously existing amendment. South Carolina was the only state to reject the Amendment.\n\nIn 1946, when he was just 13 years old, pediatrician Dr. Benjamin Spock's book \"The Common Sense Book of Baby and Child Care\" was published. It sold half a million copies in the first six months. Aside from the Bible, it became the best selling book of the 20th century. A generation of Baby Boomers were raised by the advice of Dr. Spock.\n\nIn 1957, he was 24 years old when on October 4th, the Soviet Union launched Sputnik I, the first man made earth-orbiting satellite - and triggered the Space Race. Sputnik I was only 23 inches in diameter and had no tracking equipment, only 4 antennas, but it had a big impact.\n\nIn 1976, when he was 43 years old, The United States celebrated the Bicentennial of the adoption of the Declaration of Independence. It was a year long celebration, with the biggest events taking place on July 4th.\n\nIn 1989, in the year of William D Quinn's passing, on March 24th, the Exxon Valdez, an oil tanker, struck a reef in Alaska's Prince William Sound and oil began spilling out of the hold. The oil would eventually contaminate more than a thousand miles of coastline. It is estimated that over 10.8 million gallons of crude oil spilled into the Sound - killing 100,000 to 250,000 seabirds, over 2,800 sea otters, about 12 river otters, 300 harbor seals, 247 bald eagles, and 22 orcas - as well as an unknown number of salmon and herring."}, {"url": "https://www.ancientfaces.com/person/william-k-quinn-birth-1909-death-1968/8255949", "page_content": "Refresh this page to see various historical events that occurred during William's lifetime.\n\nIn 1909, in the year that William K Quinn was born, Polish physician and medical researcher Paul Ehrlich found a cure for syphilis, which was a prevalent (but undiscussed) disease. He found that an arsenic compound completely cured syphilis within 3 weeks.\n\nIn 1914, he was merely 5 years old when in August, the Panama Canal opened to traffic. Begun by the French in the 1880's and abandoned, the United States undertook further construction in 1904. After 10 years, and the elimination of malaria carrying mosquitoes (which caused immense delays for the French and the Americans), the 48 mile long artificial waterway - a series of locks - created a shortcut for ships traveling between the Atlantic and Pacific Oceans.\n\nIn 1920, he was only 11 years old when the National Football League, first called the American Professional Football Association, was created. College football was more popular than pro football and rising player salaries were bankrupting league owners. In response, owners created the NFL, using the pro baseball association as a model. Eleven teams were formed: the Akron Pros, Canton Bulldogs, Cleveland Indians, Dayton Triangles, Decatur Staleys, Hammond Pros, Massillon Tigers, Muncie Flyers, Racine Cardinals, Rochester Jeffersons and Rock Island Independents.\n\nIn 1934, at the age of 25 years old, William was alive when on July 22nd, gangster John Dillinger was killed in Chicago. His gang had robbed banks and police stations, among other charges, and he was being hunted by J. Edgar Hoover, head of the FBI - although many in the public saw him as a \"Robin Hood\". A madam from a brothel in which he was hiding became an informer for the FBI and, after a shootout with FBI agents, Dillinger was shot and died.\n\nIn 1968, in the year of William K Quinn's passing, on April 4th, Dr. Martin Luther King, Jr., the civil rights leader, was shot and killed by an assassin in Memphis. James Earl Ray was apprehended and plead guilty to shooting Dr. King. Ray died in jail in 1998."}, {"url": "https://www.fs.usda.gov/recarea/hoosier/recarea/?recid=81889", "page_content": "William Paul Quinn was born on April 10, 1788 in Calcutta, India, and grew to be a rugged 6’3” tall man. After his introduction to Christianity by an Englishwoman, Mary Wilder, Quinn’s family ostracized him. Seeking refuge in England, Quinn espoused an Anglicized name and later moved to New York in 1806.\n\nUpon arrival in New York, he became a member of the Hicksites, an anti-slavery activist Quaker group. However, in 1808, when Quinn reached Maryland he converted to Methodist. The African Methodist Episcopal Church (AME) ordained Quinn as a Deacon in 1818 and in 1838 he became an elder of the church.\n\nStarting in 1836, Quinn built churches along the Ohio River southwest of the Lick Creek community in today’s Hoosier National Forest. Quinn’s chapels not only brought in several hundred new people into the AME denomination, they also served as a vast network to connect small churches to the larger community. Since there were churches on both sides of the Ohio River – the boundary between a free and slave state – those such as in the Lick Creek Community served as a vital component in the Underground Railroad for the region.\n\nWilliam Paul Quinn’s life’s work centered on spreading the word of his faith and leading anti-slavery activism. In 1844, the church elected him a Bishop after he established several churches in Indiana, Missouri, and Kentucky to oppose the institution of slavery. At the 1849 AME conference, Quinn was named the Senior Bishop. He held this position until his death on February 3, 1873 in his home in Richmond, Indiana where he lived with his wife, Mary Jane.\n\nIn William Paul Quinn’s honor, the AME founded an African American college in Austin, Texas in 1872 – the oldest in the state – to provide an education to newly free African American men and women. The school, Paul Quinn College, moved to Waco, Texas in 1881 and again in 1990 to Dallas.\n\nSources:\n\nAfrican Methodist Episcopal Church 7th District, “AME Pioneers: The Four Horsemen,” http://www.ame7.org/history/pages/4_horsemen.htm\n\n“William Paul Quinn,” http://www.blackpast.org/aah/quinn-william-paul-1788-1873\n\nCheryl LaRoche, Free Black Communities and the Underground Railroad: The Geography of Resistance.\n\nThis information about the Underground Railroad is part of a geo-located multi-forest interpretive program. Please contact the U.S. Forest Service Washington Office Recreation, Heritage, and Volunteer Resources program leadership with any questions or to make changes. SGV – Recreation Data and Information Coordinator."}], "William Quinn began his career in the 1930s as a radio actor.": [{"url": "https://www.britannica.com/topic/radio/The-Golden-Age-of-American-radio", "page_content": "The Golden Age of American radio as a creative medium lasted, at best, from 1930 to 1955, with the true peak period being the 1940s. Writer-producer-director Norman Corwin, one of radio’s brightest talents, ruefully made the point that radio’s most creative era was “the shortest golden age in history.” During its brief heyday, however, dramatic radio thrived and was a vital part of American culture. As would become true with television in later decades, frequently used expressions from popular programs became part of the vernacular, and people arranged their personal schedules, as they later did with television, around their favourite programs.\n\nA new commercial medium\n\nThe need for regulation In the United States, active broadcasting preceded firm government policy. Indeed, as radio became more and more of a business, station owners banded together to seek stronger government licensing regulation. From 1922 to 1925, Herbert Hoover, then secretary of commerce and in charge of radio policy, convened four national conferences, each of which petitioned Congress to replace the only existing (and obsolete) laws regarding broadcasting, which had been established in 1912 to regulate ship-to-shore transmissions. Initially all stations in the United States had to operate on a single frequency, 833 kilohertz (kHz), and stations in the same area were forced to share time so their signals did not interfere with each another. The addition of two more frequencies, 619 kHz in December 1921 and 750 kHz in August 1922, helped somewhat, but most larger cities had far more than three stations and thus continued to use shared-time arrangements. At Hoover’s behest, most frequencies between 550 kHz and 1,350 kHz were turned over for broadcast use in May 1923. The Department of Commerce, however, lacked the discretion to reject license applications or to enforce frequency assignments. Considerable interference resulted as operators shifted station frequency (and sometimes the transmitter location, by mounting it in a truck) in an attempt to obtain a clear signal. This lack of self-regulation and mutual cooperation between station operators resulted in increased pressure on Congress to update radio legislation, which was accomplished with the landmark Radio Act of 1927. This act provided basic assumptions that have continued to underpin broadcasting policy in the United States to this day. Frequencies used for broadcasting were to be held by the government, not owned by licensees. A license would be issued only if “the public interest, convenience or necessity” was served. A new Federal Radio Commission established by the law would define what “the public interest” meant, though broadcasters would be held responsible for the content they provided.\n\nThe role of advertising Sale of advertising time was not widely practiced at early radio stations in the United States. Indeed, many objected to the commercialization of radio, among them Herbert Hoover, who said in 1924, “I believe the quickest way to kill broadcasting would be to use it for direct advertising.” Strong arguments were made opposing the “invasion of people’s homes with commerce” (although newspapers and magazines had done so for more than a century) on the grounds that it would lead to entertainment programs pitched to the mass audience, thereby limiting radio’s potential educational and social benefits. Searching for operating funds, stations sought government support, gifts from the wealthy, voluntary contributions, or an annual fee assessed on listeners (the latter an approach already adopted in some countries). A few cities or states operated stations as government services. The American Telephone and Telegraph Company (AT&T) brought advertising to American radio when their New York City radio station, WEAF, began selling time for “toll broadcasting.” Its first radio commercial, broadcast on August 22, 1922, was a 15-minute real-estate ad offering apartments in Jackson Heights, Queens. But acceptance of radio advertising was slow, as broadcasters did not want to offend listeners. Early ads promoted an institutional image in a style later common to public radio’s “underwriting” announcements. Nevertheless, by the end of the 1920s, radio was firmly established as an advertising medium, which in turn led to air time’s being sold in set blocks, determined by the length of the program. As radio developed, daytime shows such as soap operas and children’s programs generally ran 15 minutes. Dramatic shows and situation comedies, the bulk of prime-time programming, ran 30 minutes each. Hour-long blocks of time were generally reserved for prestigious big-star shows, such as Lux Radio Theatre, or for low-rated but esteemed and experimental shows, such as The Columbia Workshop. Many advertisers made themselves known by eventually adopting the practice of combining their name with the name of the star or the title of the program, as with Camel Caravan, sponsored by the R.J. Reynolds Tobacco Company, or A&P Gypsies, sponsored by the largest American grocery-store chain at the time. Beginning in the 1930s and continuing for more than two decades, a majority of prime-time network programs were actually created by advertising agencies employed by sponsors. For example, during Bing Crosby’s tenure as host of The Kraft Music Hall, the talent and staff were hired by the Kraft food company’s advertising firm, the J. Walter Thompson agency. The networks merely provided the airtime and studio facilities. Some of the more creative radio talents functioned as their own producers, receiving a budget from the agency out of which they paid the supporting actors and crew. Even these artists were under strict supervision of the agencies, which usually had representatives present during the rehearsals and broadcast."}, {"url": "https://www.britannica.com/topic/Golden-Age-of-American-radio", "page_content": "Golden Age of American radio, period lasting roughly from 1930 through the 1940s, when the medium of commercial broadcast radio grew into the fabric of daily life in the United States, providing news and entertainment to a country struggling with economic depression and war.\n\nDuring American radio’s Golden Age, much of the programming heard by listeners was controlled by advertising agencies, which conceived the shows, hired the talent and staff (sometimes drawing performers directly from the old vaudeville theatre circuit), and leased airtime and studio facilities from the radio networks. Programs became fixed in quarter-hour and half-hour blocks and featured a wide variety of formats. Soap operas such as Ma Perkins and The Guiding Light kept housewives company through the afternoon. Children listened to the adventure series Little Orphan Annie and the science-fiction show Flash Gordon. Amos ’n’ Andy, a situation comedy, was the most popular show ever broadcast, lasting more than 30 years. The Shadow, a crime drama, also had a loyal following. “Prestige” anthology shows brought together writers such as Archibald MacLeish and Norman Corwin with actors from the legitimate stage such as Helen Hayes and Orson Welles, and film-based anthology shows such as The Lux Radio Theatre and Academy Award Theater featured movie stars of the day reading live radio versions of their motion-picture roles. In 1938 Welles’s radio adaptation of H.G. Wells’s science-fiction tale The War of the Worlds created panic when listeners failed to hear the disclaimer and believed Martians actually were invading Earth.\n\nMore From Britannica radio: The Golden Age of American radio\n\nOn radio’s musical front, the National Broadcasting Company established its own symphony orchestra, led by Italian conductor Arturo Toscanini. On live “band remotes” carried from ballrooms in New York City and Chicago, big bands led by the likes of Artie Shaw, Benny Goodman, and Tommy Dorsey played popular dance music for listeners around the country. Programming turned political when Pres. Franklin D. Roosevelt used radio to talk directly to Americans in his “fireside chats.” News events such as the Lindbergh baby kidnapping and the Hindenburg disaster captured the nation’s attention.\n\nIn the early 1940s, World War II catalyzed the growth of network news, as local stations depended on the major networks’ overseas correspondents. Young reporters such as Edward R. Murrow, William Shirer, and Walter Cronkite covered breaking news at the front, while commentators such as Walter Winchell analyzed events at home. Some radio programming was used for propaganda purposes, while other programs were aimed at keeping up the morale of the public. The war years clearly raised the profile of radio’s role in society.\n\nNevertheless, the end of World War II in 1945 roughly coincided with the arrival of commercial television, and this new medium—which added the visual element to radio’s tried-and-true formula of sound and immediacy—soon drew creative talent, listener loyalty, and advertising revenue away from radio. Some stars and programs from the last years of American radio’s Golden Age successfully transferred to television—for instance, the comedians George Burns and Gracie Allen, the soap opera The Guiding Light, the situation comedy Father Knows Best, the police drama Dragnet, and the western Gunsmoke. Others, however, disappeared from the airwaves. Live big bands, for instance, were scrapped in favour of recorded rock and roll, which was played on local programs by voluble and irreverent disc jockeys. By the mid-1950s American radio had moved beyond its Golden Age to modern formats such as “Top 40,” “alternative” or “underground” FM, talk shows, and public-service programming.\n\nA selection of shows from American radio’s Golden Age is presented in the table.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now"}, {"url": "https://www.encyclopedia.com/education/news-and-education-magazines/radio-1929-1941", "page_content": "Radio 1929-1941\n\nThe stock market crash and following Great Depression brought economic hard times to many Americans. By 1933, 25 percent of the workforce, or over 12 million people, were out of work. Millions of others saw their paychecks reduced or lived in constant fear that they, too, would finally be hit with economic hardship. Many had more leisure time on their hands, but less money to spend. As the Great Depression deepened in the United States and around the world in the early 1930s, reliance on radio increased. More people owned radios, were listening to radio in increasing numbers, and were listening to radios for an increasing amount of time each day. Radio was an inexpensive way to keep up with news events of the Great Depression and farming news, and provided a ready means for escape from the economic hard times through sports broadcasts and entertainment programs.\n\nPresident Franklin Delano Roosevelt (served 1933–1945) immediately seized on the popularity of radio with his series of Fireside Chats that he conducted beginning in the second week of his presidency. Roosevelt would use radio to not only lobby for public support of his programs, but also to inform the public of important events and perhaps most importantly reassure the public through his unique personal character that faith in the future was warranted. Though only relatively wealthy Americans owned radios a decade earlier, in the 1930s radios became a common appliance owned by the majority of Americans and by a large number of people in other areas of the Western world. Radio was fast becoming a way of life.\n\nRadio became the primary media for entertainment and, increasingly, for information. The number of programs and types of programming for radio grew astonishingly quickly. Old genres of entertainment, such as vaudeville, which was a form of live entertainment consisting of various short acts including songs and comedy routines, were adapted for radio, and new genres were developed for the emerging media. Stars of the stage, including theater stars and musical groups, became the stars of radio, with performers such as Edgar Bergen, Jack Benny, Bob Hope, Kate Smith, Guy Lombardo, Orson Welles, Barbara Stanwyck, Cary Grant, and Humphrey Bogart gracing the airwaves. New stars were also created, as performers discovered the medium and created unique shows. As radio became more sophisticated, new areas of skill and talent emerged, such as sound effects. It was a time of rapid, exciting growth for radio, much like the 1990s were for the growth of the Internet.\n\nBeyond the proliferation of entertainment, radio addressed some more serious issues. The 1930s were a time of profound and lasting changes at home and abroad. Major shifts in the United States' political and policy priorities were happening under President Roosevelt as he sought to lead the nation out of the Depression, and the radio played a key role in reporting these changes. The radio also became a forum for discussion—and promotion—of all aspects of the policy changes. Politicians and critics used the media to comment as well as to convince.\n\nOutside of the United States, the world was in a state of flux. Germany was mobilizing to occupy a large portion of Europe and much of the world was moving towards what would come to be known as World War II (1939–1945). As the world faced changes and challenges, radio was an integral part not only in reporting and commenting on the changes, but in some cases, in instigating them.\n\nRadio of the 1930s provided a blueprint for the understanding and expectations of media for the rest of the century. The genres and stars of the 1930s became the genres and stars of television in the 1950s. Approaches to news, commentary, and political persuasion were established during the early days of radio and were adapted to later media.\n\nChronology:\n\n1895: Guglielmo Marconi first sends radio communication through the air. 1922: William S. Paley buys several small radio stations, which he eventually grows into the Colombia Broadcasting System (CBS). 1926: The Radio Corporation of America (RCA), founded in 1919, establishes the National Broadcasting Company (NBC). 1928: \"Amos 'n' Andy,\" a program that played on racism in America, which increased during the Great Depression, premieres and becomes the most popular radio show of the 1930s. 1930: As the Great Depression sets in, Lowell Thomas begins a nightly radio news program on NBC. 1932: \"The Jack Benny Show,\" a radio comedy featuring a character who is tight with his money, premiers on NBC. His stingy behavior was something everyone affected by the Depression could easily relate to. 1932: \"Buck Rogers in the Twenty-Fifth Century\" premieres on CBS adding to the growing list of programs that provide escape for Americans from the troubles of the Great Depression. 1933: President Roosevelt delivers his first of many radio addresses, known as Fireside Chats. 1934: Congress passes the Communications Act of 1934 and creates the Federal Communications Commission (FCC) to oversee the nation's mass-communications industry. 1938: Orson Welles' Mercury Theatre of the Air broadcasts a radio adaptation of H.G. Wells's 1898 novel The War of the Worlds, causing widespread panic. 1939: Edward R. Murrow broadcasts from London during the Nazi bombing raids on the city shifting public concerns away from domestic economic issues to foreign issues. 1939: The National Association of Broadcasters adopts a code that promotes objectivity in news broadcasts.\n\n1930s radio created an environment for new expressions of cultural identity and cultural criticism. Not only news shows, but also entertainment shows, frequently provided perspective and gentle criticism, helping to break down barriers between communities. Comedies took on issues of race relations, poverty, and cultural misunderstandings, providing a framework to help people make sense of their rapidly changing country and world. Many radio shows were broadcast all over the country, and served to create a community of shared experience for a diverse and widespread world.\n\nThe Golden Age of Radio\n\nFollowing the stock market crash in 1929 life in America changed dramatically. The deepening Depression impacted every aspect of American life and Americans looked for new avenues to escape the dreariness of unemployment, homelessness, and hunger. Besides escape, the radio also brought the news and President Roosevelt's Fireside Chats. With the growth of broadcast news organizations at this time, the public could be informed as never before. Regional differences further melted as national programs brought the same information and advice to everyone with a radio. One bright spot was the exciting explosion of radio programming. Radio itself was not brand new in the 1930s, but it is during this time that it became an integral part of the lives of Americans.\n\nAs increasing poverty made many other forms of entertainment prohibitively expensive, America's reliance on radio grew. In the early 1930s the phonographic record player was a standard appliance in many middle class American households, but as the Depression continued fewer people could afford the steep price of $.75 per record, resulting in the decline of record sales. Attendance at the movie theaters remained strong through the first few years of the Depression, but that also would eventually decline substantially. About $75 could buy a Marconi console, a common reference to a popular type of radio in a wooden cabinet and named after the inventor of radio, Guglielmo Marconi of Italy, who remained active until his death in 1937. The price was a steep, but often worthwhile, investment for families that were foregoing most other forms of paid entertainment. In 1933 alone 3.6 million radio sets were sold.\n\nBy the mid-1930s two-thirds of American homes had radio sets, and by 1939 about 80 percent of Americans—about 25 million people—owned radios. Radios were in almost every house and some Americans even had radios in their cars. Americans were buying radios at a rate of 28 per minute. They were a good investment—after the initial expense, the family was able to enjoy drama, comedy, quiz shows, the news, and more for free in the comfort of their homes.\n\nStudies showed that Americans were listening to radio for an average of five hours a day. Americans were spending so much time listening to radio that some child development specialists worried that children would be harmed from the activity. They warned that children should be running and playing outside, not sitting inside being entertained by a box. Radio use was not confined to economic class. In fact lower income families were most likely to listen to it on a daily basis. Radio became the central communication vehicle of the Depression especially including Roosevelt's Fireside Chats. Radio was how America got its news and how it was entertained. Radio was how America escaped the harsh world outside—as four national and 20 regional networks and hundreds of smaller stations piped programming directly to the listening public.\n\nProgramming was innovative and daring, with pioneers exploring new ways of making the medium of radio captivating. Daily soap operas, mysteries, science fiction, and fantasy programs were performed alongside radio productions of classic plays and live musical performances. The public found these programs a welcomed escape from worries of the Depression and the demand grew for more. News shows and commentary kept everyone informed of the dire situation at home and the deteriorating situation in Europe. Radio provided a shared national experience of entertainment and information. It was \"The Golden Age of Radio.\"\n\nThe Rise of the Networks\n\nThe economic situation during the Depression directly impacted radio. Radio stations consolidated during the Depression, as smaller stations went out of business. In the mid-to late-1920s, networks were formed as companies bought stations all over the country, forming a \"network\" of radio stations. In 1926 NBC (National Broadcasting Company) went on the air nationally, using telephone lines to carry the signal to nineteen stations and ten million listeners. The formation of NBC was followed by the formation of CBS (Columbia Broadcasting System). In 1934 four powerful stations—WOR New York, WGN Chicago, WLW Cincinnati, and WXYZ Detroit—banded together to form \"The Quality Group,\" which later became the Mutual Broadcasting System. The networks encouraged the companies to develop programming to attract more and more listeners. Advertisement, now nationwide with the networks, brought in much more money to support program development, improve production facilities, afford more talented writers and performers, and develop more compelling stories and programs.\n\nEven during the Depression, major radio stations turned a profit. In 1932 NBC posted a profit of $1 million and CBS posted a profit of $1.6 million. As at the start of the twenty-first century advertising paid for most radio programming. In the 1930s advertising agencies shifted their advertising dollars from newspapers to radio as public trust and interest in radio increased. Singing commercials became popular. Programs during the Golden Age of Radio frequently took the name of their sponsors. The A&P Gypsies, an orchestra conducted by Harry Horlick, was sponsored by A&P grocery stores. Live musical groups that played on the radio during the late 1920s and early 1930s included The Sylvania (light bulbs) Foresters, The Champion (spark plugs) Sparkers, and The Planters (peanuts) Pickers. \"The Fleischmann's Yeast Hour\" became the first radio variety show. Variety shows included a range of entertainment including music, singing, dancing, and comedy. \"The Maxwell House Show Boat\" was a variety show that evoked nostalgia for the old-time South, making listeners forget the griminess of Depression-wracked urban America. \"The Chevrolet Chronicles\" were one of many \"transcription shows\"—shows produced for the distribution simply of scripts to stations around the country to be performed locally—and an example of how radio programming was inseparable from its advertisers.\n\nWith the consolidation of radios into networks, the configuration of the radio industry began to look like the major television networks of the late twentieth century. In addition newspapers owned many early radio stations including WGN (named after the \"World's Greatest Newspaper,\" the Chicago Tribune). The U.S. Congress became concerned that one company would control too much of the media in any one town. They felt that if a single company owned all of the radio stations and newspapers in one town, they would not express a variety of views. They feared that the exchange of ideas and clash of opinions essential to democracy would be compromised. Congress soon passed legislation that required diversity of ownership.\n\nAs radio blossomed during the 1930s, network censorship did too. The Great Depression had established a fertile bed for radical politics as many were disillusioned with the capitalist economic system of the United States. In addition the rise of communism and fascism (dictatorships) in Europe was increasingly causing alarm in the United States. As a result there was vigilance to keep off the air anything that might be interpreted as supportive of these politics or in opposition to government efforts to bring about economic recovery. Censorship involved a radio network official reviewing the program material and determining what might be morally or politically objectionable to the public. Some comedians liked to tell what at the time were considered risqué jokes, meaning the jokes were on the edge of being considered indecent. For example Fred Allen sometimes told jokes about the \"Full Moon Nudist Colony.\" As censorship became stricter toward the end of the 1930s, the networks ruled that there could be no more jokes about nudity.\n\nMore About… A Day from the Golden Age of Radio\n\nNearly 60 years ago, WJSV, a radio station located in Washington, DC, recorded their entire broadcast day. Here is their schedule for September 21, 1939 (from Old-Time Radio. Available from the World Wide Web at: http://www.old-time.com/otrlogs/390921.html).\n\n6:00 Sunrise—including technical problems\n\n6:30 Sunrise With Arthur Godfrey\n\n8:30 Certified Magic Carpet\n\n8:45 Bachelor's Children\n\n9:00 Pretty Kitty Kelly\n\n9:15 Story Of Myrt and Marge\n\n9:30 Hilltop House\n\n9:45 Stepmother\n\n10:00 Mary Lee Taylor\n\n10:15 Brenda Curtis\n\n10:30 Big Sister\n\n10:45 Aunt Jenny's True Life Stories\n\n11:00 Jean Abbey\n\n11:15 When A Girl Marries\n\n11:30 The Romance Of Helen Trent\n\n11:45 Our Gal Sunday\n\n12:00 The Goldbergs\n\n12:15 Life Can Be Beautiful\n\n12:30 Road Of Life\n\n12:45 This Day Is Ours\n\n1:00 Sunshine Report\n\n1:15 The Life And Love Of Dr. Susan\n\n1:30 Your Family and Mine\n\n1:45 News\n\n1:50 Albert Warner\n\n2:00 President Roosevelt's Address To Congress\n\n2:40 Premier Daladier\n\n3:00 Address Commentary\n\n3:15 The Career Of Alice Blair\n\n3:30 News\n\n3:42 Rhythm and Romance\n\n3:45 Scattergood Baines\n\n4:00 Baseball: Cleveland Indians at Washington Senators\n\n5:15 The World Dances\n\n5:30 News\n\n5:45 Sports News\n\n6:00 Amos 'n' Andy\n\n6:15 The Parker Family\n\n6:30 Joe E. Brown\n\n7:00 Ask-It-Basket\n\n7:30 Strange As It Seems\n\n8:00 Major Bowes Original Amateur Hour\n\n9:00 The Columbia Workshop\n\n9:30 Americans At Work\n\n10:00 News\n\n10:15 Music\n\n10:30 Albert Warner\n\n10:45 Repeat of President Roosevelt's Address to Congress\n\n11:00 Livingston's Orchestra (joined in progress at 11:20)\n\n11:30 Teddy Powell Band\n\n12:00 Louis Prima Band\n\n12:30 Bob Chester Orchestra\n\nRegulating Radio\n\nEarly efforts to regulate the radio industry were not very effective. The Radio Act of 1927 created a confusing array of federal agencies to oversee the growing industry. President Roosevelt in early 1934 was concerned about service to rural areas, competition in the communications industry, and recent technological advances. In response the Communications Act of 1934, one of the regulatory foundations of Roosevelt's New Deal, which was a group of policies focused on relief and reform, provided for the establishment of the Federal Communications Commission (FCC). The FCC took the place of the Federal Radio Commission and oversaw the telecommunications industry as well as broadcasting. The FCC was created to regulate communication services and rates and license radio stations. Part of its responsibilities was to assign specific radio frequencies and call letters to radio stations. The FCC consisted of seven members appointed by the president and confirmed by the senate.\n\nSome of the key provisions established by the Communications Act of 1934 are still familiar at the first of the twenty-first century. For example candidates for public office must be treated equally and sponsors must be identified. The \"public interest\" will determine whether the FCC should provide a license to broadcast. The New Deal's Communications Act of 1934 survives largely intact.\n\nThere were moves towards self-regulation in the 1930s also. The National Association of Broadcasters created standards of performance and objectivity that spawned discussion and that evolved throughout the rest of the twentieth century. Broadcasting had become a profession in the 1930s and was experiencing the growing pains of becoming an established and accepted part of society.\n\nA World of Listeners\n\nRadio offered Americans a shared common entertainment experience, right in their living rooms. Regional differences in the United States began to diminish as radio, hand-in-hand with mass production and mass consumerism, grew through the decade. Not only would Americans share in the hardship caused by the Depression and in the solutions offered by the New Deal, but also in fads which themselves provided further escape from the Depression. Music led the way onto radio, with the broadcasting of swing and big band music in the 1920s. Music programming was the most prevalent throughout the decade, and despite the growth in news, dramas, and comedies, by 1940 music still provided 50 percent of radio programming. Music was performed live during the early days of radio, so studios were built large enough to accommodate full orchestras. Later recorded music was regularly broadcast, and radio stations had a series of continuing battles with ASCAP (American Society of Composers, Authors, and Publishers) over how to charge fees for playing recorded music that had copyrights.\n\nIn the 1930s music was the foundation of radio and America's favorite escape from the Depression. Audiences were able to hear performances by entertainers that they would never be able to see in person. Networks competed to hire famous conductors, orchestras, and soloists. While classical music was important to the success of early radio, not everyone liked the side effects. Composer Irving Berlin complained that Americans were becoming listeners rather than singers.\n\nThe orchestra of Guy Lombardo and His Royal Canadians were made famous by radio, as was jazz musician Count Basie. Radio provided a huge and attentive audience, but it also provided unique demands. Songwriters were under incredible pressure to produce new material, and many collapsed as a result. The explosion of radio was both exhilarating and exhausting. Music publishing companies hired song pluggers to \"place\" their songs with singers and musicians. The plugger would sell songs, to which the publisher held the recording rights, to popular musicians who would hopefully make the songs famous, which would increase a song's sales and the publisher's profit. Pluggers were named for \"plugging\" or aggressively selling the idea of recording a publisher's music.\n\nGiven the impacts of the Great Depression on the average citizen's entertainment budget, it seemed that everyone in America turned to radio for entertainment in the 1930s. Radio was the best buy for escape and information during hard times. Jack Benny was one of the foremost radio stars of The Golden Age of Radio. The former vaudevillian actor mastered the unique art of radio and created a variety show of immense popularity. The character he created was complex and his characterization was well known and funny. For example he was tight with money, which many in the Depression could relate to. Everyone in America knew Jack Benny and his foibles. At the time it was said that so many households listened to Jack Benny that you could walk the streets of small towns and not miss a word, as the sound of the program drifted through the open windows of each house.\n\nVaudeville performers had a challenge in translating their talent to radio. The performers would have a set of gags—jokes—that they could perform night after night in venues all over the world. As they moved to radio and their show was broadcast all over the world they had the awesome task of creating new material for each show. Jokes could not be reused as they could in live stage acts. Some radio performers had teams of writers preparing jokes for them.\n\nMany of the premier entertainers of the twentieth century got their start first on stage and later in radio. Comedian Bob Hope was an exceptional radio performer who went on to an extraordinary career in television and film. The husband and wife comedy team of George Burns and Gracie Allen became representatives of the desired everyday world in American culture. Singer Bing Crosby provided audiences with decades of entertainment. Bandleader Ozzie Nelson, who later married his vocalist Harriet Hilliard, became a radio phenomenon in the 1930s and went on to become a television phenomenon in \"Ozzie and Harriet.\"\n\nRadio Drama\n\nSoap operas were another area of significant growth in radio programming during the Depression. Eighty-five percent of network daytime programming was soap operas—serial dramas portraying the lives of a varied cast of characters. The dramas were called soap operas because manufacturers of the major brands of soap, including Proctor and Gamble and Lever Brothers, sponsored them. Women were the key listeners during the daytime, so household products such as soap were eager advertisers for those time slots. Since most radio soap operas were only fifteen minutes long, many could run in one day. There were 61 soap operas on the radio in 1939 alone, and some of the soap operas on television today got their start on radio.\n\nMany people—especially women—looked to soap operas for advice on how to deal with the situations life presented to them. The Great Depression especially brought new and troubling problems. Men were often out of work, stressed by their situation, and maybe even on the road for long periods looking for job opportunities. American women considered how their favorite characters dealt with the challenges of life. Popular soap operas received thousands of letters from women asking for help with real-life problems. Many of the production companies employed correspondents who wrote back with suggestions. This constituted yet another form of escape from the daily problems of the Great Depression by becoming temporarily absorbed in the problems of others, and maybe in even gaining some comfort that others besides themselves were facing difficult times.\n\n\"One Man's Family\" was a typical radio drama—the story of a multigenerational family, with ongoing stories that weren't too complicated for listeners just joining the show to understand. \"Against the Storm,\" \"Brighter Day,\" \"City Hospital,\" \"Tale of Today,\" and \"We Love and Learn\" were all popular soap operas. \"Guiding Light\" first aired on radio in 1937 and continued on television into the twenty-first century. Women followed the various sagas as if the characters were their neighbors.\n\nComic strips had long provided a shared form of entertainment in America. Children and adults followed the adventures of their favorite characters and waited for the next installment. Comic strips were transformed into popular radio programs with the debut of shows based on \"Little Orphan Annie,\" \"Buck Rogers in the Twenty-Fifth Century,\" \"Flash Gordon,\" and \"Dick Tracy.\" While some programs were more adult, some programs were specifically designed to appeal to children, such as \"Jack Armstrong, All American Boy.\" Similarly crime dramas were also popular, with shows like \"Sherlock Holmes\" and \"The Green Hornet.\"\n\nMany advertisers formed long-term bonds with these shows, especially as they tried to reach the young audience. The hot drink Ovaltine and \"Little Orphan Annie\" were partners for many years. Advertisers were creative in positioning products. For example they created the character of Dick Tracy, Jr. who encouraged listeners to become Dick Tracy Junior Detectives by sending in box tops from certain cereals.\n\nThere was so much competition for listeners that children's shows offered premiums such as decoder rings and badges to lure their young audience. Decoder rings enabled listeners to decipher messages given in code language during episodes of the program. Mail-in premium offers were very successful on youth shows, and one of the most successful was the decoder ring offered by \"Little Orphan Annie.\" Children would mail in a label and a modest amount of money for the ring. In the 1983 movie A Christmas Story, the advertising partnership with \"Little Orphan Annie\" was lampooned as the message in the long-awaited decoder ring turns out to be \"Be sure to drink your Ovaltine.\" Such fads were a good buy for entertainment during the Depression when budgets were tight.\n\nMany of the comic-strip-based programs that became popular radio shows during the Golden Age of Radio are still part of American culture at the start of the twenty-first century. \"Blondie,\" \"Gasoline Alley,\" and \"Li'l Abner\" were closely followed by both children and adults. The \"Adventures of Superman\" went on to both television and film success. The amount of listening leisure time during the Depression and popularity of radios in this pre-television period provided a golden opportunity for many programs to capture America's imagination.\n\nTheater on the Air\n\nTheater emerged as a popular genre on radio. Onair performances of works by playwrights William Shakespeare and Henrik Ibsen, and author Leo Tolstoy were produced, as well as radio adaptations of some of Hollywood's best films. Many of Hollywood's most glamorous stars appeared on radio. William Powell and Myrna Loy performed \"The Thin Man\" and Clark Gable and Claudette Colbert performed \"It Happened One Night.\" Barbara Stanwyck, Lucille Ball, and Bette Davis were just some of the stars that appeared on radio during the Depression. Radio and film star George Burns claimed that radio was an easier medium than others since the performers could read their lines rather than having to memorize them.\n\nThere were several great radio theater companies during the 1930s including Orson Welles's Mercury Theatre on the Air, the Lux Radio Theatre, Screen Guide Theatre, and Studio One, later known as the Ford Theater. These well-funded productions were high quality with a great deal of planning, classic scripts, and major stars and they attracted large audiences. Productions were often broadcast during \"prime time\" evening hours so families could enjoy the shows together.\n\nOne of Hollywood's greatest celebrities was columnist Louella Parsons. In 1934 Parsons launched a variety hour, \"Hollywood Hotel\" that included interviews with actors and celebrity news. Actors would appear on the show to plug their movies, and sometimes would appear in brief versions of their movies on \"Hollywood Hotel.\" This program provided a key opportunity during the Depression when many could not afford to go to movie theaters. Movie attendance was down in the Depression and this was a popular way for the family to be entertained. Eventually, the Radio Guild protested the actors appearing on \"Hollywood Hotel\" without pay and in 1938 the show was cancelled.\n\nOrson Welles would prove to be one of the more influential performers of theatrical works on the radio. On October 30, 1938 a radio musical performance was interrupted by a reporter. As the reporter broke into the performance several times over the next few minutes, he described strange flying vehicles landing in various parts of the United States and strange creatures emerging from them. Soon the reports made clear that the entire world had been invaded by Martians who planned on taking over the planet.\n\nMillions of radio listeners believed the report of the invasion, which was actually an adaptation of H.G. Wells's novel The War of the Worlds by Orson Welles's Mercury Theatre on the Air. Though an explanation had preceded the performance, many listeners didn't hear it, and thousands panicked. Hysterical people hid in basements, and listeners called the police to volunteer in the fight against evil invaders.\n\nThe performance of \"The War of the Worlds\" became one of the most notorious radio performances ever. The radio had become such an integral part of the lives of Americans that it instigated panic throughout the country. In 1983 a television movie, \"Special Bulletin\" used the broadcast format to tell the fictional story of a nuclear explosion in South Carolina, and, despite regular disclaimers, caused some concern and panic.\n\nWith the plays and movies represented on the radio many engaged with U.S. developments in the arts through the Great Depression. Alienation from American traditions was minimized and a foundation for a later boon in such interests following World War II was established.\n\n\"Good Evening Mr. and Mrs. America\"\n\nRadio was a primary vehicle for the exchange of information and news during the Depression. President Roosevelt used the radio for regular \"fireside chats\" with the American people, explaining the major events of the time and his response to them in a calm and reassuring voice. Having delivered such addresses to the citizens of New York as governor, he delivered 28 fireside chats to the nation during his presidency. The first, delivered on March 12, 1933, only eight days after Roosevelt took office, attracted more 17 million families. All other chats were similarly big draws among the public. A 1939 poll indicated almost one-fourth of the population usually listened to the chats while almost 40 percent sometimes listened, adding up to almost 65 percent of the population. The fireside chats allowed Americans to feel an intimacy with their president that few had felt before—President Roosevelt was in their living room, expressing his concerns, empathizing with their situation. The fireside chats were crucial to unifying the country during a difficult time and set a standard for communications by future presidents.\n\nWith his comfortable style, Roosevelt had the uncanny knack of speaking to the people through the radio as if he was sitting in their living room. The chats were highly popular and pioneered a means for future presidents to communicate directly with the public outside the normal news channels. Even in the 1990s and early twenty-first century presidents Bill Clinton (served 1993–2001) and George W. Bush (served 2001–) used weekly radio broadcasts to remain connected to the public. Other politicians and political pundits, regardless of their agreement or disagreement with what Roosevelt had to say, were generally in awe of his natural ability to make great use of the mass media. The open discussions with the public had a major impact on Roosevelt's presidency, building a high level of trust. Roosevelt believed he needed to keep close contact with the American people given the severe hardships many were suffering through the Great Depression and ensuring as much support as possible for his New Deal programs.\n\nRadio emerged as an important method of disseminating news during the 1930s. Many of the major newscasters of the century got their start in radio during the Depression—including H.V. Kaltenborn, Edward R. Murrow, William L. Shirer, and Eric Severeid. Radio producers experimented with different ways to deliver the news. Sometimes the days' news events were dramatized over the radio, with actors playing the roles of major participants. Radios provided an avenue for information that supplemented local newspaper. National stories including those of the Depression and progress of New Deal programs let people see the problems and success stories unfolding elsewhere by communities experiencing the same Depression-spawned problems as theirs.\n\nRadio not only widened the scope of Americans past their own communities, it brought the events of the world into their homes. The Spanish Civil War (1936–1939) is considered the first radio war. In February of 1936 the Popular Front, a left wing group, opposed by the military, had been elected. In response to the election, the Spanish military formed a military government, exiled the leaders of the group, and attempted to isolate the various local groups that supported the Popular Front. In the past this approach had been successful—the military had been able to convince the people that the rebellion was local and that it was futile to fight against the military, thereby discouraging action.\n\nIn 1936, however, radio transmitters reached most of the population of Spain. There were eight major transmitters and as many as sixty smaller transmitters. The military tried to convince the people of Spain that the insurgency was under control, but was soon countered by broadcasts calling for a general strike. Radio stations in nearby Morocco and the Canary Islands broadcasted in support of the rebels, and rebel resistance grew. The military government tried to capture the main radio stations with little success. The failure of the government to suppress the rebel broadcasts appeared to signal the collapse of the military government. Throughout the war, broadcasts in many languages and sponsored by many groups rallied support and impacted the outcome of the war.\n\nBy the end of the Depression events in Europe as a whole were deteriorating. Germany was invading its neighbors. As the world moved closer to world war, Kaltenborn reported on the invasion of Austria and Czechoslovakia. Murrow provided regular reports on the bombing of London in his \"London After Dark\" series broadcast by shortwave radio. Shirer reported on the dramatic surrender of France to Germany at Compaigne. Americans listened to the radio and heard bombs exploding in background as a reporter explained that London was being attacked. The world was suddenly smaller and as a result, more frightening for many Americans.\n\nOther news events also came into the homes of many Americans. By the time the infant son of national hero Charles Lindbergh was kidnapped and murdered, the role of communication in radio had become so important that the 1935 verdict in the Lindbergh kidnapping trial was broadcast over radio. In 1937 a reporter captured his reaction to the crash of the Hindenburg. On site to report on the Hindenburg's voyage, instead the reporter's response to the tragedy was recorded and later broadcast, bringing the horror into thousands of living rooms. Later when the Japanese attacked Pearl Harbor on December 7, 1941, the tragedy of the attack and the President's response to it was quickly broadcast to Americans around the country. Radio news had reached its maturity.\n\nAnother example of the growth of radio news was the presence of tabloid reporting, which emphasized sensationalized topics. Walter Winchell specialized in publishing gossip and other information that some critics deemed inappropriate. He hosted a celebrity gossip show during much of the Depression that became both very popular and highly criticized.\n\nSports commentary was popular on radio and play-by-play commentary on baseball and other games was popular, though not always what it seemed. The future president Ronald Reagan, a sports announcer at WHO in Des Moines, Iowa during much of the Depression, called play-by-play for the Chicago Cubs. The studio, however, was three hundred miles from the actual game. Skillful sports commentators were able to imagine the details of a game and pass them along to listeners using play-by-play provided in type across the wires. Sports played a major role in the escapism from the Great Depression. Prominent sports figures became larger than life. This also represented the golden age of sportscasters who eloquently described the sporting events and created colorful images of the sports stars. The Depression listening public followed the exploits of \"Babe\" Ruth, Lou Gehrig (\"The Iron Horse\"), the Four Horsemen of Notre Dame football players, female track star Mildred \"Babe\" Didrikson Zaharias, the boxer Joe Louis (\"The Brown Bomber\"), and others.\n\nRadio in the 1930s often contrived events to encourage people to listen. Given the hard times of the Depression they had an eager listening public. Stunt broadcasts were a regular part of programming. KSTP in St. Paul Minnesota covered a wedding in a hot air balloon for its listeners. Radio was a burgeoning and competitive field. Listeners couldn't get enough of it, and innovation flourished. Many of the 1930s programs would set the standard for programming in all media for the rest of the century.\n\n\"Liberty at the Crossroads\"\n\nRadio played an important role in politics during the Depression. Radio was used to communicate political positions, and to show support of, and against, politicians. In the November 1936 election President Roosevelt used the radio much more effectively than opponent Alf Landon, which partially contributed to Roosevelt's victory. In 1940 President Roosevelt's radio skill helped him defeat Wendell Willkie and win an unprecedented third term as President.\n\nPolitical parties made great use of radio during the 1930s, much as they did television later in the century. In 1936 the Republican Party's radio dramatization, \"Liberty at the Crossroads,\" played an important role in the campaign. Critics complained that the use of radio deterred thoughtful analysis of political issues. They also complained that political conventions were organized for the benefit of radio, rather than to facilitate substantive political discussion.\n\nThe power of radio was being exploited in the international arena, also. German Minister of Propaganda Joseph Goebbels was reportedly very sensitive to the enormous impact that radio could have. Two types of music were banned when Adolph Hitler came to power in Germany in 1933: swing and jazz. Swing represented decadent America, and jazz was seen as antithetical to the purity of the Aryan race, which was a term for the non-Jewish white population. Jazz was largely derived by black American musicians and frequently played by Jewish musicians. Such creativity by non-whites and non-Protestants did not mesh well with the racist doctrines of the Nazis who preached the dominance of white society. Later in the 1930s as Spain descended into civil war, radio became pivotal in rallying the forces opposing the military government. As in the United States with Roosevelt's Fireside Chats, other governments in the 1930s clearly recognized the power and potential of radio. Goebbels and other German leaders knew it was the most effective way available to reach the greatest number of people with propaganda and other information.\n\nOne master of the use of radio was Father Charles Edward Coughlin. The Roman Catholic priest from the Detroit, Michigan area was broadcast throughout much of the 1930s. Coughlin was highly popular in the early 1930s with his radio program attracting an estimated 30 to 45 million listeners each week. At first his program was primarily inspirational and welcomed by the Depression-weary public but became increasingly political. Initially a supporter of President Roosevelt and his New Deal programs, Coughlin became disillusioned and turned into a fierce critic. Coughlin was extraordinarily popular, with millions of listeners each Sunday. As his comments became increasingly political, his anti-Semitic (Jewish), pro-Hitler views became clear, and CBS dropped his program when his comments became too inflammatory. As Germany's aggression in Europe became increasingly evident, Coughlin lost some of his popularity, however, for much of the Depression he was a significant voice in American radio.\n\nThe growing war in Europe produced some of the most creative and thoughtful programming on radio. When German planes bombed the Basque town of Guernica in Spain in 1937, it solidified writer and director Norman Corwin's hatred of fascism. In 1939 he wrote \"They Fly through the Air with the Greatest of Ease\" for his \"Words Without Music\" radio series. The program lamented the German military planes flying at will over his native country and wreaking havoc with their bombs. Its premiere was lauded as exceptional, bold radio. Isolationist beliefs, opposition to the United States entering the war, made even the mention of the possibility of war controversial, but the airing of the program resulted in a thousand favorable letters being sent to CBS.\n\nWriter Archibald MacLeish produced \"The Fall of the City,\" which symbolically represented the growing threat of war in 1937. Arch Oboler produced \"Lights Out\" on NBC, and \"Air Raid\" by Archibald MacLeish and \"War of the Worlds\" by writer and performer Orson Welles, which depicted the growing fear of war. Radio had given a voice to Americans' fears about the coming world war.\n\nIn 1895 Guglielmo Marconi became the first person to communicate by sending radio signals through the air. Radio was born. Radio, however, had a rocky start in America. During World War I, most private U.S. radio stations were either shut down or taken over by the government under order of President Woodrow Wilson, and it was illegal for U.S. citizens to possess an operational transmitter or receiver.\n\nIt wasn't until 1920 that radio stations were regularly making commercial broadcasts, beginning with KDKA of Pittsburgh and WWJ of Detroit. Programming began to grow despite the fact that radios were still too pricey for most Americans.\n\nIn 1922, David Sarnoff introduced the Radiola console, which sold for $75—not an insignificant amount but still within the reach of middle class citizens in the 1920s. His plan was to make radios affordable and to bring music into the home by way of wireless technology. His company, RCA—the Radio Corporation of America—grew from $11 million in sales the first year to $60 million three years later. The less expensive radio model made radios a household item.\n\nThe 1920s saw a steady growth in radio ownership and programming, and radios were becoming increasingly popular. The stock market crash of 1929 and the Depression that followed, however, really spurred the growth of radio. Despite an initial decline in radio ownership in the early part of the Depression, children and others started becoming avid radio listeners. Other forms of paid entertainment had become prohibitively expensive in the lean times, and so Americans turned to radio. Eventually, as social workers reported, families would rather part with their icebox or other necessary appliances than with their radio.\n\nRadio technology was still evolving as the country entered the Depression. The conventional, amplitude modulation (AM) form of radio signal proved limiting in broadcasting, producing much static at times. Frequency modulation (FM) was introduced in which static interference was much less. In 1933 Edwin Howard Armstrong produced the first FM transmitter and receiver, although it was six years before an FM station would air. FM was clearly superior in the quality of the broadcast.\n\nPublic Perspectives\n\nThe public found radio to be the most accessible form of entertainment and information available. After the initial expense of purchasing a radio, it was rather cheap to enjoy the programs. Also radio programming could be enjoyed by the entire family who gathered in front of the radio in the comfort of their own home. Radio entertainment played on the imagination of the listeners by creating visions of the action and characters portrayed. In this way radio was an excellent form of escapism during the particularly tough period when the public was greatly affected by the Great Depression. The effects of the Depression—poverty, joblessness, homelessness, and hunger—took a mental toll on Americans. Radio, with its thrillers and mysteries, classical theater and musical performances, and slapstick and silliness, provided a means of escaping the dreariness of life. Not everyone approved of the escapism of radio. Some critics called it \"bread and circuses,\" a narcotic for the masses to keep them from fully comprehending the situation in which they found themselves.\n\nRadio became so popular during the Depression that some psychologists grew concerned over the increasing amount of time and attention spent listening to radio. Child development specialists expressed concern that children were foregoing more wholesome activities, such as studying, reading, playing sports, and outdoor activities in favor of sitting passively inside, next to the radio, listening. These concerns were later mirrored by similar concerns expressed over the effects television and personal computers posed on child development. Some became concerned that America was becoming a land of spectators, rather than a land of participants.\n\nFor artists radio opened up a whole new medium to pursue their craft. Rather than performing on stage in vaudeville or nightclubs requiring steady travel, they could reach the entire nation from a small studio, week after week. They could also employ elaborate sound effects and various other techniques that would play on the listeners' imaginations. Very quickly programs became fairly sophisticated in these techniques. Advertisers also found a new medium for promoting their goods nationwide. Nationally distributed magazines had been the key medium before the rise of radio and national broadcasting networks. Now the mass produced goods could be promoted through the mass media for mass consumption. The fabric of American life would be changed forever. In the age of the Depression with limited expense budgets, radio provided an economical way of reaching millions of people.\n\nNational Perspectives\n\nIt was during the Great Depression that America became a more unified nation and regional differences significantly declined. People in the cities, farms, and suburbs listened to the same programs at the same time. Certainly one factor was the loss of jobs and search for new employment opportunities that led to a great deal of population shifts and movement. The expansion of radio also played a key role in this change of national character. Radio offered a unique communal experience not so readily available in America before. No other media of the time was as pervasive. For example, newspapers were still more a local and regional form of information sharing. Individuals all over America laughed together at Jack Benny and worried together over alien invasion orchestrated in a studio by Orson Welles. There was a new profound sense of community, both in the homes, in which families and friends grouped around the radio, and in the discussion of the programs at work and school. At a time when many could feel isolated in their struggle against the effects of the Depression, radio provided a community of experience.\n\nThere were also concerns during the 1930s, and later, that radio—and indeed all mass media—would be misused. The wide dissemination of incorrect or selectively chosen information could invite or reinforce opinions. President Roosevelt used the radio to communicate his views and interpretations of the events of the day. His critics charged that he was able to use his unique position and access to mass media to support his views. His Fireside Chats have been considered some of the first forms of managed news. Similarly Father Coughlin promoted anti-Semitic and pro-Hitler positions on the radio. As the country came increasingly close to war, his diocese, in Detroit, chose to review his statements prior to broadcast.\n\nInternational Perspectives\n\nThroughout the 1930s, as the world careened toward war, America debated the appropriate response to the emerging conflict. In the beginning of the 1930s most Americans—including President Roosevelt—shared the view that the conflict was someone else's. They believed that America should not get involved. As the 1930s progressed, and as reporters such as Edward R. Murrow, H.V. Kaltenborn, and William Shirer broadcast reports of the bombing of London and the German occupation of continental Europe, the view of many Americans began to change. The world seemed to be a smaller place. Czechoslovakia didn't seem so far away, and the invasion of Poland didn't seem so insignificant to the United States. Isolationism seemed less tenable.\n\nAll over the world the potential of radio was quickly realized. Adolf Hitler in Germany used radio to further his goals. In reaction some countries occupied by German forces in the late 1930s surreptitiously broadcast opposing viewpoints. Radio had become a powerful and influential media for the expression of opinion on an international basis. As more world leaders and their opposition realized that, they were able, increasingly, to take advantage of it to reach millions of prospective supporters for their programs and causes.\n\nThe Golden Age of Radio created a new media environment. At the beginning of the explosion of radio in the 1930s, radio advertising increased while newspaper advertising decreased, though newspapers eventually bounced back. The amazing growth of radio programming during the Depression established all of the major genres in television: dramas, comedies, variety shows, soap operas, talk shows, news commentary, and more. Radio in the 1930s established the framework for broadcasting for the rest of the twentieth century.\n\nMore About… Sound Effects\n\nSound effects are an important part of communicating drama and comedy over the radio. In the 1930s specialists in radio sound effects emerged to provide that critical element of escapism for those many listeners hoping to escape from the daily problems of coping with the Depression. The specialists had to be very creative to discover ways to communicate and support the action—the sound of walking, breaking glass, a door closing, a train whistling. Sound effects were created in the most innovative ways. The sound of the rocket ship in \"Buck Rogers in the Twenty-Fifth Century\" was created by placing paper over the air-conditioning vents and placing a microphone in a small spot in the middle.\n\nRadio writers often wrote their sound requirements into the script, as did Irving Reis in his radio play \"Meridian 7-1212.\" The play takes its name from the phone number that New Yorkers could dial in the 1930s to get the accurate time. Below, a lawyer has beaten up a witness who lied, thereby convicting a man who is scheduled to die at midnight. The witness has just confessed, clearing the condemned man. The condemned man's sister is a telephone operator (from Leonard Maltin. The Great American Broadcast: A Celebration of Radio's Golden Age. New York: Penguin Putnam, Inc., 1997, pp. 33–34).\n\nNEIL: All right, rat. (Sock. Body crumples) There; now he'll be quiet for a minute.\n\nHYLAND: My God, we've got it! We've got it!\n\nNEIL: We'll have to move fast. What time is it?\n\nHYLAND: Quarter to twelve.\n\nNEIL: But you said it what quarter to twelve the last time I asked.\n\nHYLAND: Good lord! My watch stopped… I'll get it. (Picks up phone. Dials ME 7-1212.)\n\nOPERATOR: (On filter) When you hear the signal the time will be eleven fifty-nine. (Tone: Phone drops to floor)\n\nHYLAND: An innocent boy is going to die in one minute.\n\nOPERATOR: (Distant at first, as if coming though receiver on floor) When you hear the signal the time will be eleven fifty-nine and one quarter. (Tone. Dissolve next speech from filter to clear) When you hear the signal the time will be eleven fifty-nine and one half. (Tone) (Her voice starts to break) When you hear the tone the time will be eleven fifty-nine and three-quarters. (Tone) (The sob is audible now) When you hear the signal the time will be… (Pause) twelve o'clock. (Tone) (A high-pitched oscillator whine starts low behind the last call, then is brought up as the full resonance of the Hammond organ and low-frequency oscillator are added. It builds to a crescendo as she screams: 'Tommie! Tommie!' then cuts suddenly into a body fall. Music full, then down and out)\n\nThe exceptional use of radio news broadcasting in the 1930s created the future expectation of immediacy of information. Americans expected to learn about events quickly, and as television gained momentum later in the century, this expectation was carried into television broadcasting: viewers expected to see events virtually as they happened. The immediacy of information had the added impact of making the entire world feel like one's neighborhood. Nothing seemed too far away, and other cultures that once seemed exotic and strange were more familiar.\n\nThe growth in radio provided a large audience for various voices in cultural and political criticism. News programs and commentary provided direct challenges to long-held views, likewise many \"entertainment\" programs provided cultural criticism. Variety shows lampooned racial preconceptions, theater on the air challenged ideas of war and peace, and comedies provided a humorous critique of Middle American values. While not all radio programs reflected the values in tension during the Great Depression, radio was a forum for exploring the many aspects of America that were being challenged by poverty and decay.\n\nThe 1930s were also the genesis of some of the major broadcasting industry conflicts that would continue to be played out throughout the remainder of the twentieth century. Radio companies fought with ASCAP over blanket recording agreements—basically they wanted to be able to play a recording whenever they wanted for a set price. The radio industry wrestled with the government over issues of diversifying ownership and over licensing of AM and FM frequencies. As radio came into its own, it discovered the major issues that would continue to challenge it into the future.\n\nRoosevelt's Fireside Chats set the standard for future presidents to not only use radio to communicate with the public, but the growing mass media of television in the future as well. His successor Harry Truman suffered from his abrupt Midwest behavior before the microphone, which contrasted sharply with Roosevelt's warm wit and charm. The era of television influence came forward in the 1960 presidential campaign between future presidents John F. Kennedy (served 1961–1963) and Richard Nixon (served 1969–1974). Kennedy's good looks and calm demeanor won over many supporters following a live televised debate. Ronald Reagan (served 1981–1989) became another president skilled at using mass media to charm the public and press while seeking to gain support for his programs.\n\nUse of the radio for political purposes by presidents continued into the twenty-first century as President George W. Bush conducted weekly Saturday radio addresses, both in English and Spanish. The shift to television in the 1950s, however, had a major impact on radio. Radio programming shifted away from drama, comedy, and variety shows to other formats including music, talk shows, and news. With these changes radio remained a highly popular medium of entertainment and information for the American public.\n\nJack Benny (1894–1974). Born Benjamin Kubelsky, comedian and musician Jack Benny became an American phenomenon. His career started in vaudeville, and he debuted in 1931 on radio on the Ed Sullivan show, getting his own radio show in 1932. Among the many running jokes on his show were his stinginess, his \"feud\" with Fred Allen, his ancient Maxwell automobile, and the vault in his basement where he kept his money. His character was particularly appealing to the Great Depression audience that was coping with economic hard times. His special comedic style allowed the joke to be at his expense, instead of at the expense of others. His last radio show was in 1955.\n\nGeorge Burns (1896–1996). Born Nathan Birnbaum, comedian George Burns and his wife and comedic partner Gracie Allen, starred in the Burns and Allen Show on radio beginning in 1933. An outstanding comedic duo, the show was a huge success providing many laughs to the American audiences during the Great Depression and later made the transition to television. Though they married in 1926, Burns and Allen did not tell their radio audience for many years. Later a film and television star, Burns contributed greatly to the development of the early sitcom.\n\nJean Colbert (?–1995). Colbert was one of radio's earliest and most prolific soap opera performers, appearing in \"Stella Dallas,\" \"Life Can be Beautiful,\" \"Young Dr. Malone,\" \"Portia Faces Life,\" and \"Aunt Jenny,\" among others. Colbert provided an escape for the women of the nation toiling under difficult economic conditions. She also appeared in prime-time programs including the \"Lux Radio Theater.\"\n\nFather Charles Edward Coughlin (1891–1979). Called the \"Radio Priest,\" Father Coughlin began broadcasting weekly sermons in 1926. By the early 1930s Coughlin's broadcasts shifted to economic and political commentary. He began as a supporter of President Roosevelt and the New Deal social and economic programs, but he eventually changed into a harsh critic. Father Coughlin exerted enormous influence on America during the Great Depression. Millions of Americans listened to his weekly radio broadcast. One study showed that more than 15 million Americans listened to Coughlin each month, and more than half of them approved of what he said. While much of his message regarded a type of economic populism, which emphasized the common person, he regularly attacked prominent Jewish people. These attacks that were so strong that he was sometimes called the father of hate speech.\n\nFreeman Gosden and Charles Correll (1899–1982). (1890–1972). Freeman Fisher Gosden and Charles James Correll created and starred in the popular radio show \"Amos 'n' Andy.\" Originally broadcast as \"Sam 'n' Henry\" in 1926, the show was renamed when it changed networks. Gosden and Correll—both white men—appeared in black face and portrayed two Southern men forced to move to a Northern city. The program played on the increased racism related to the hard times of the Great Depression. The show has subsequently been criticized as racially insensitive and insulting, but some critics contend that it humanized black people.\n\nHave von (H.V.) Kaltenborn (1878–1965). A pioneer in radio, Kaltenborn was first on the air in 1921 and by the 1930s he was a regular newscaster reporting on the Spanish Civil War in 1936. Kaltenborn was close enough to the conflict that listeners could hear gunfire in the background. Kaltenborn also covered the Munich appeasement talks in 1938, reporting—correctly—that Munich was a \"complete victory for Hitler.\" His broadcasts helped lead a shift in public concern away from Great Depression economic problems to foreign policy issues.\n\nEdward R. Murrow (1908–1965). Murrow set the standard for American journalism providing descriptive reports of many of the 1930s and 1940s important events. Murrow reported from Vienna, Austria, in 1938 as the Nazis entered the Austrian capital.\n\nCBS sent Murrow to London in the 1930s and it was from there that he began a series of memorable broadcasts. When war between Germany and the United Kingdom was declared, Murrow reported firsthand. Murrow's broadcasts during the Battle of Britain were often accompanied by air raid sirens or bomb explosions. While in London Murrow brought together several exceptionally talented newsmen, known as \"Murrow's Boys.\"\n\nWilliam S. Paley (1901–1990). Paley developed and ran the CBS radio and television networks. He bought CBS in 1929, building it from a failing network of 22 radio stations into a broadcast empire. Paley and his network worked with many of the major stars of the decade, including Jack Benny, Al Jolson, Kate Smith and Bing Crosby. Paley was responsible for bringing substantial entertainment to the Great Depression audience who could little afford to pursue other forms of entertainment.\n\nDavid Sarnoff (1891–1971). Former wireless operator Sarnoff rose to president of the Radio Corporation of America. As early as 1916, Sarnoff envisioned a radio that would be as standard in homes as a piano or a phonograph. In 1922 he introduced the Radiola, for $75, and made radio a household appliance. These developments proved timely as the radio provided much entertainment and a source of information for the Depression public.\n\nOrson Welles (1915–1985). Between 1936 and 1941 Orson Welles participated in over one hundred radio drama productions as writer, actor, and director. Welles's Mercury Theatre produced Shakespeare and other classic literature, as well as more popular fare such as \"The League of Terror\" and \"Dracula.\" In 1937 Welles became the voice of \"The Shadow.\" Welles's work with radio is best remembered for the show on October 30, 1938, when he aired \"The War of the Worlds,\" a story depicting an alien invasion, which caused widespread panic around the United States. Actor John Houseman said of Welles and \"The War of the Worlds:\" \"The reason that show worked as well as it did was… nerve… the slowness of the show in the beginning.\" The show, which began slowly and calmly at first, steadily built to a frantic pace, giving the impression of hours passing in minutes. Welles went on to a legendary career in film; in his film directing debut, the classic Citizen Kane, he used many of the techniques—and people—he knew from radio. Welles also took part in the New Deal's Federal Theater Project that provided work for many unemployed actors and stagehands.\n\nWalter Winchell (1897–1972). Winchell is sometimes considered the father of tabloid reporting. After tackling various pursuits in his young life, including time as a vaudevillian dancer, Winchell became a famous news commentator and gossipmonger, drawing millions of listeners during the Great Depression. Winchell had many critics of his approach of publicizing activities that many considered inappropriate for public comment.\n\n\"Amos 'n' Andy\"\n\nHardships of the Great Depression increased hatred toward racial minorities by society in general. This was particularly true of the white unemployed who believed jobs, including those created by New Deal work relief programs, should first go to whites before black Americans. Radio programs capitalized on these emotions that were heightened by the Depression. \"Amos 'n' Andy\" creators Freeman Gosden and Charles Corell developed a complex world for their characters—two black, Southern men newly transplanted to a Northern city. This reflected the migration of black Americans from Southern rural areas to Northern industrial centers. Listeners waited impatiently for each new episode to discover what troubles would befall the mishap-prone twosome. The complex drama was both criticized for its racial insensitivity and lauded for showing a humanistic portrait of a particular subset of society (from Charles J. Correll and Freeman F. Gosden. Here They Are—Amos 'n' Andy. New York: Richard R. Smith, Inc., 1931).\n\nAmos: I wuz sittin' yere dreamin' 'bout Chicago an' 'stead o' puttin' de milk in de bucket, I put half of it on de ground. Andy: Dat's whut you git fur not tendin' to yore bizness. If I'd been milin' dat cow, son, I wouldn't of wasted a drop o' milk. Amos: When I tell Mister Hopkins dat I lost half de milk, he goin' git mad wid me. Andy: Let him git mad wid you. You ain't got no bizness shootin' de milk on de ground. Amos: I got tell him though 'cause he known I ought to have mo' milk dan dis. Andy: Instead o' payin' 'tention to whut you was doin', you was sittin' here dreamin'. Amos: Yeah—if I hadn't been thinkin' 'bout goin' to Chicago den, I'd of got de mil in de buck a' right. Andy: Well, it's yore own fault—dat's all I got say. Amos: You know, YOU wuz de one he tol' to milk de COW. Andy: Dat IS right, ain't it? Amos: He tol' you to milk de cow—he didn't tell me to do it. You is de one dat's got take de milk in to him. Andy: On second thought, yere, we better not tell him nothin' 'bout losin' part o' de milk 'cause I don' want him jumpin' all over me. Amos: Well, whut you goin' do 'bout it? We ought to tell him. Dat's de right thing to do. Andy: Wait a minute, yere, son. I got a idea. Amos: Whut you goin' to do now? Andy: Come on over yere wid me. Han' me dat bucket. Amos: Where you goin'? Whut you goin' do wid it? Andy: Yere's de well right yere. We'll fill dat up wid water. Amos: : Wait a minute—you can't do dat wid de stuff. Dat's goin' make Mister Hopkins mad if he ever find dat out. Andy: How he goin' find it out? Amos: He's li'ble to find it out though. We ain't for no bizness puttin' water in de milk. Andy: Now, lissen yere, Amos—don't never try to tell me whut to do or whut not to do. I know whut I'se doin'. Amos: I know, but if Mister Hopkins ever see you goin' dat, he's li'ble to fire both of us. Andy: Hol' dat bucket o' milk dere while I pour some water in it. Amos: I don' wants to git mixed up in dis. I ain't goin' do it. De man don' want no water in his milk.\"\n\nFireside Chats\n\nOn March 9, 1937, President Franklin Roosevelt gave his ninth \"fireside chat\" over the airwaves to the public. Though his topic on this occasion was his proposed reorganization of the Supreme Court, the speech was notable in that he began by reviewing his first fireside chat he made four years earlier. The chat demonstrates Roosevelt's friendly style that many found comforting. Almost one-fourth of the nation normally listened to his fireside chats. They set a new standard for communications between the president and the public (from Franklin Roosevelt. The Public Papers and Addresses of Franklin D. Roosevelt: 1937 Volume. New York: The Macmillan Company, 1941, pp. 122–123).\n\nTonight, sitting at my desk in the White House, I make my first radio report to the people in my second term of office. I am reminded of that evening in March, four years ago, when I made my first radio report to you. We were then in the midst of the great banking crisis. Soon after, with the authority of the Congress, we asked the Nation to turn over all of its privately held gold, dollar for dollar, to the Government of the United States. Today's recovery proves how right that policy was. But when, almost two years later, it came before the Supreme Court its constitutionality was upheld only by a five-to-four vote. The change of one vote would have thrown all the affairs of this great Nation back into hopeless chaos. In effect, four Justices ruled that the right under a private contract to exact a pound of flesh was more sacred than the main objectives of the Constitution to establish an enduring Nation. In 1933 you and I knew that we must never let our economic system get completely out of joint again—that we could not afford to take the risk of another great depression. We also became convinced that the only way to avoid a repetition of those dark days was to have a government with power to prevent and to cure the abuses and the inequalities which had thrown that system out of joint. We then began a program of remedying those abuses and inequalities—to give balance and stability to our economic system—to make it bomb-proof against the causes of 1929. Today we are only part-way through that program—and recovery is speeding up to a point where the dangers of 1929 are gain becoming possible, not this week or month perhaps, but within a year or two. National laws are needed to complete that program. Individual or local or state effort alone cannot protect us in 1937 any better than ten years ago. It will take time—and plenty of time—to work out our remedies administratively even after legislation is passed. To complete our program of protection in time, therefore, we cannot delay one moment in making certain that our National Government has power to carry through. Four yeas ago action did not come until the eleventh hour. It was almost too late … I want to talk with you very simply about the need for present action in this crisis—the need to meet the unanswered challenge of one-third of a Nation ill-nourished, ill clad, ill-housed.\n\nCompare the growth in and uses of radio during the 1930s with the growth and use of the Internet during the 1990s.\n\nDiscuss how radio changed America's response to the war in Europe—the war that would eventually become World War II. How did radio change American's understanding of the people \"over there?\" How was radio used to try to change Americans view of the conflict?\n\nListen to the radio news, watch television news, and read a newspaper all on the same day. Compare coverage of news events in the three media.\n\nSources\n\nBarnouw, Erik. The Golden Web: A History of Broadcasting in the United States, Volume II, 1933 to 1953. New York: Oxford University Press, 1968.\n\n——. A Tower of Babel: A History of Broadcasting in the United States, Volume I, to 1933. New York: Oxford University Press, 1966.\n\nBest, Gary Dean. The Nickel and Dime Decade: American Popular Culture During the 1930s. Westport, CT and London: Praeger, 1993.\n\nBolino, August C. From Depression to War: American Society in Transition—1939. Westport, CT and London: Praeger, 1998.\n\nBrown, Robert J. Manipulating the Ether: The Power of Broadcast Radio in Thirties America. Jefferson, NC: McFarland & Co., 1998.\n\nBruccoli, Mathrew J. and Richard Layman. American Decades: 1930–1939. Detroit, MI: Gale Research, Inc. 1995.\n\nDavies, Alan. \"The First Radio War: Broadcasting in the Spanish Civil War, 1936–1939.\" In Historical Journal of Film, Radio, and Television. October 1999.\n\nDouglas, Susan Jeanne. Inventing American Broadcasting 1899–1922. Baltimore, MD: Johns Hopkins University Press, 1994.\n\nGarner, Joe. We Interrupt This Broadcast. Naperville, IL: Sourcebooks, 1998.\n\nHillard, Robert L and Michael C. Keith. The Broadcast Century and Beyond: A Biography of American Broadcasting. Woburn, MA: Butterworth-Heinemann, 2001.\n\nHilmes, Michele. Radio Voices: American Broadcasting, 1922–1952. Minneapolis, MN: University of Minnesota Press, 1997.\n\nHilmes, Michele and Jason Loviglio. eds. Radio Reader: Essays in the Cultural History of Radio. New York: Routledge, 2001.\n\nLackmann, Ronald. This was Radio. New York: Great American Audio Corporation, 2000.\n\nWatkins, T.H. The Great Depression. Boston, MA: Little, Brown & Co., 1993.\n\nFurther Reading\n\nBergmeier, Horst J. Hitler's Airwaves: The Inside Story of Nazi Radio Broadcasting and Propaganda Swing. New Haven, CT: Yale University Press, 1997.\n\nCarpenter, Ronald H. Father Charles E. Coughlin: Surrogate Spokesman for the Disaffected. Westport, CT: Greenwood, 1998.\n\nDouglas, Susan J. Listening in: Radio and the American Imagination: From Amos 'n' Andy and Edward R. Murrow to Wolfman Jack and Howard Stern. New York: Crown Publishing Croup, 2000.\n\nEly, Melvin Patrick. The Adventures of Amos 'n Andy: A Social History of an American Phenomenon. New York: The Free Press, 1991.\n\nKendrick, Alexander. Prime-Time: The Life of Edward R. Murrow. Boston: Little, Brown, 1969.\n\nNachmann, Gerald. Raised on Radio. New York: Pantheon Books, 1998.\n\nRusso, Alexander. Broadcasting Freedom: Radio, War and the Politics of Race, 1938–1948. London and Chapel Hill, NC: University of North Carolina Press, 1999.\n\nWarren, Donald. Radio Priest: Charles Coughlin, the Father of Hate Radio. New York: Free Press, 1996."}, {"url": "https://www.kennedy-center.org/education/resources-for-educators/classroom-resources/media-and-interactives/media/literary-arts/john-steinbeck--the-grapes-of-wrath/chapters/hollywood-and-radio-in-the-1930s/", "page_content": "It is hard to realize, from the contemporary view of the 21st century, that when the traumas of the Great Depression and the Dust Bowl hit America at the beginning of the 1930’s decade, both Hollywood and radio were newcomers to the entertainment industry. Silent films had captured audiences in the early 1900s, but the first sound movie, The Jazz Singer, was not released until 1924. In fact, it was not until 1927 that sound movies began to dominate the industry. Radio technology, as it came together at the end of the 19th century, had served purposes related to wireless communication, such as aid to navigation at sea and significant support in World War I efforts, but radio shows as home entertainment would not be introduced until 1920.\n\nHollywood film narratives and themes were varied in the days of silent films–mysteries, comedies, cowboy movies, melodramas, love and adventure stories–the main goal being entertainment. And from its inception, Hollywood had increasingly become a shaping force in American culture, influencing such aspects as clothes fashion, hair design, tastes in interior design, manners, and language idioms. Radio, also, focused largely on entertainment and became increasingly an agent of consumer ads and dissemination of news.\n\nThe environmental, economic, social and political disasters of the 1930s, however, would have far-reaching impact on the redefining of roles and the reshaping of the nature of the influences both Hollywood and radio would assume in American life. Social and political themes, interlaced with overt implications and innuendo related to the economic patterns and economic health of the nation, would begin to come to the foreground. The following suggested questions and activities are crafted to help students understand the changes in mission these two cultural forces served, starting in the 1930s."}, {"url": "https://www.findagrave.com/memorial/6823124/bill-quinn", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.grunge.com/751361/the-real-reason-the-1930s-were-considered-the-golden-age-of-radio/", "page_content": "These days, it's pretty common to see cinephiles and TV fanatics bash daytime soap operas. James Franco, who once appeared on \"General Hospital,\" elaborated on this concept in an essay for Lapham's Quarterly (via The Week), citing the \"melodramatic plotlines, constant exposition, unnatural lighting, swelling music, and lack of action.\" Interestingly enough, soap operas have been around for decades, and the familiarity of them keeps fans coming back for more.\n\nIt turns out soap operas got their start during The Golden Age of Radio. According to Classic FM, the term was coined thanks to the soap commercials that would play — the perfect sponsors for the target audience of these radio dramas. As explained by the Old Time Radio Catalog, because children were at school and men were working, the housewife was the primary consumer during these hours, as the radio was her perfect companion while there were chores to be done.\n\nAs the Library of Congress highlights, writers Anne Hummert, Irna Phillips, and Elaine Sterne Carrington are credited for spearheading the development of soap operas, with Phillips, in particular, being a \"pioneer\" responsible for many elements of the soap that are still common today, such as \"cliffhangers, organ-music bridges between scenes, and characters appearing concurrently in different serials.\" In fact, Phillips' legendary soap, \"The Guiding Light,\" is known to be the \"longest running broadcast drama,\" having successfully transitioned to television in 1952 (after 15 years of radio) and ending in 2009 (via Old Time Radio Catalog)."}, {"url": "https://www.williamquinnpainter.com/biography", "page_content": "Quinn’s love affair with Europe began as early as 1957 when the University awarded him a Milliken Foreign Travel Scholarship to spend a year painting in Rome. Subsequently he spent sabbaticals in Greece (1963) and Paris (1982), and often painted during summers in Europe. In his work, Quinn uniquely synthesized the elements of the European modernists with the gestural style of “Action Painting” common to certain American Abstract Expressionists.\n\nAfter completing his teaching career in 1991 Quinn moved with his Belgian-born wife Jeannine to Bruges, where he now has his studio. In this ‘European Period’ he has pulled out all the stops. The paintings are spacious and bold, often with surprising color combinations that have always been an engaging aspect of his work.\n\nMany of the recent works have white grounds in tension with aggressive, contrasting planes. Others have linear structures that seem to create a ‘real’ space, but then the lines dart back to surface, asserting the paintings’ two-dimensionality, sometimes suggesting landscape or figurative elements. William Quinn works on one painting at a time, not in a series, as he abhors repeating himself. As a result, each painting is a new experience both for the painter and viewer.\n\nThroughout the years Quinn has exhibited widely in the U.S. and Europe, winning many prizes in competitive exhibitions. Perhaps the strongest validation of the strength and truth of Quinn’s vision is the amazing zest with which he continues to pour forth images that are ever fresh and new and full of the power to enchant.\n\n- Genevieve Linnehan\n\n"}, {"url": "https://www.tshaonline.org/handbook/entries/quinn-william-russell-bill", "page_content": "William Russell “Bill” Quinn was born in Amesbury, Massachusetts, on January 8, 1904. Founder of Houston-based Gold Star Records and recording studio, Quinn recorded a variety of blues, R&B, country, Cajun, and zydeco artists, including Sam “Lightnin’” Hopkins, Clifton Chenier, Harry Choates, and George Jones. Quinn’s Gold Star Recording Studio, which eventually was renamed SugarHill Recording Studios, is one of the most prolific and historically significant recording facilities in the Southwest.\n\nBill Quinn began his career in the entertainment business working with sound equipment for a carnival company—Royal American Shows out of New Jersey. In 1939 he settled in Houston, where he began experimenting with recording technology and founded the Quinn Radio Service. In 1941 he renamed his enterprise the Quinn Recording Company and started recording radio jingles to be used as ads for nearby businesses. Quinn formed the short-lived Gulf Record Company label in 1944 but dropped it by 1946 when he founded Gold Star Records and began recording local blues and country (or “hillbilly”) artists.\n\nQuinn Recording Company, also home of the Gold Star Records label, was originally located in an old gas station/grocery store at 3104 Telephone Road in Houston. Quinn had begun his enterprise in the recording industry during the days when master recordings had to be produced while the musicians were actually performing. Sound recordings were etched directly onto wax discs. This method prevented any editing or rearranging and only allowed one song per side of each disc. In 1950 Quinn had moved the studio a few blocks away to a two-story residence that already was his family home at 5628 Brock Street. He operated the facility on the first floor, while he, his wife, and son lived upstairs. Gold Star Records scored its first national hit in 1947 with “Jole Blon,” sung by Harry Choates, a Louisiana-born Cajun who had relocated to Port Arthur, Texas, as a child. “Jole Blon” (French for “Pretty Blonde”), which subsequently also became a major hit for Moon Mullican, was a traditional South Louisiana waltz that had long been popular among Cajun audiences.\n\nQuinn continually improved the studio’s technological capability throughout the years. In 1958–59 he expanded the facility to the extent that it received its own separate entrance and address at 5626 Brock Street. Quinn’s studios were also the primary facility used by the Starday and D Records labels owned by Harold “Pappy” Daily.\n\nGold Star Studio recorded numerous country artists, including George Jones, Hank Locklin, Willie Nelson, and Floyd Tillman. It produced such rock-and-roll hits as “Running Bear” by Johnny Preston, “Chantilly Lace” by J.P. “the Big Bopper” Richardson, and “Treat Her Right” by Roy Head and the Traits. In the mid-1960s the studio was leased by J. L. Patterson and subsequently sold to International Artists by 1968. The facility was briefly renamed International Artists Studios. It went into receivership, however, in 1969 when International Artists filed for bankruptcy, and in late 1971 record producer Huey Meaux took over the studio and renamed it SugarHill. Meaux continued Quinn’s tradition of recording a broad variety of musicians. Among Huey Meaux’s many artists were Freddy Fender (who recorded at least twenty-eight hit singles or albums there), Barbara Lynn, Doug Sahm, and Augie Meyers. Over the years, dozens of other prominent Texas musicians, including Marcia Ball, Archie Bell and the Drells, Destiny’s Child, and Selena, recorded in the studios that Bill Quinn founded.\n\nBill Quinn died in Houston on January 4, 1976. He was survived by his wife Wanda Lee Quinn and son Earl Russell Quinn. He was buried in Forest Park Lawndale Cemetery. Quinn’s legacy extends far beyond the studio he started in 1941. As a pioneer in independently recording, reproducing, and distributing Texas music, he became the first successful record producer in Texas to promote such a broad range of artists and musical styles. He played a major role in helping popularize country, blues, R&B, Cajun, gospel, Tejano, and rock–and-roll. As a result, Quinn played a seminal role in helping establish the Texas recording industry and promote the careers of countless Texas musicians."}, {"url": "https://www.britannica.com/biography/John-Williams-American-composer-and-conductor", "page_content": "John Williams, in full John Towner Williams, (born February 8, 1932, Queens, New York, U.S.), American composer who created some of the most iconic film scores of all time. He scored more than a hundred films, many of which were directed by Steven Spielberg.\n\nWilliams was raised in New York, the son of a percussionist in the CBS radio orchestra. He was exposed to music from a young age and began studying piano as a child, later learning trumpet, trombone, and clarinet. He started writing music early, trying to orchestrate his own pieces as a teen. In 1948 Williams moved to Los Angeles with his family, where he studied composition privately and also briefly at the University of California, Los Angeles. In 1951 he was drafted into the U.S. Air Force, and during his service he arranged band music and began conducting.\n\nBritannica Quiz Oscar-Worthy Movie Trivia\n\nAfter leaving the air force in 1954, Williams briefly studied piano at the Juilliard School of Music and worked as a jazz pianist in New York City, both in clubs and for recordings. He later returned to California, where he worked as a Hollywood studio pianist for such films as Some Like It Hot (1959), West Side Story (1961), and To Kill a Mockingbird (1962). During that time he also began composing for television, writing songs for such shows as Wagon Train and Gilligan’s Island.\n\nIn the early 1970s Williams made a name for himself as a composer for big-budget disaster films, including The Poseidon Adventure (1972), and Spielberg, then an aspiring director, asked Williams to score his first feature, The Sugarland Express (1974). Thus began a decades-long partnership between the two, with Williams scoring some of Spielberg’s best-known films, including shark-attack thriller Jaws (1975), sci-fi flicks Close Encounters of the Third Kind (1977) and E.T.: The Extra-Terrestrial (1982), the rollicking Indiana Jones series (1981, 1984, 1989, 2008), dinosaur action movie Jurassic Park (1993) and its sequel The Lost World (1997), Holocaust biopic Schindler’s List (1993), war drama Saving Private Ryan (1998), biopic Lincoln (2012), and many more.\n\nThroughout his extensive career Williams created some of the most memorable music in movie history, including the scores and iconic theme songs for nine of the Star Wars films (1977, 1980, 1983, 1999, 2002, 2005, 2015, 2017, and 2019) and the first three Harry Potter films (2001, 2002, and 2004). He also composed themes for some of the NBC network’s news programs and for the 1984, 1988, 1996, and 2002 Olympic Games. He was known especially for his lush symphonic style, which helped bring symphonic film scores back into vogue after synthesizers had started to become the norm.\n\nIn addition to his film work, Williams was well known as a concert composer and conductor. He composed symphonies as well as concertos for various instruments. In 1980 he became the conductor of the Boston Pops, touring and recording extensively and sometimes leading the orchestra in live renditions of his popular film scores. After his retirement in 1993, Williams remained a laureate conductor for the Pops and guest conducted for such orchestras as the London Symphony and Los Angeles Philharmonic. In 2009 he composed and arranged a song for the inauguration ceremony of U.S. Pres. Barack Obama.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nWilliams received many honours and awards for his work. He was nominated for more than 50 Academy Awards and won 5: for his adaptation of the musical Fiddler on the Roof (1971), for Jaws (1975), for Star Wars (1977), for E.T. The Extra-Terrestrial (1982), and for Schindler’s List (1993). He was also the recipient of 3 Emmy Awards and more than 20 Grammy Awards. In 2004 he was awarded a Kennedy Center Honor, and in 2009 he was awarded the National Medal of Arts, the highest award given to an artist by the U.S. government, for his achievements in symphonic music for motion pictures."}, {"url": "https://www.washingtonpost.com/archive/local/2000/09/12/gen-william-quinn-intelligence-leader-decorated-officer-dies/f42ec17a-6aa2-4e9d-a81f-0070cfd4bd85/", "page_content": "William W. \"Buffalo Bill\" Quinn, 92, a retired Army lieutenant general who was an intelligence officer in Europe in World War II and a frequently decorated regimental commander in the Korean War, died Sept. 11 at Walter Reed Army Medical Center. He had congestive heart failure.\n\nGen. Quinn's peacetime career included a period as director of public information of the Army in Washington. In other assignments, he headed the Army section of the U.S. military advisory mission in Greece in the 1950s and served as deputy director of the Defense Intelligence Agency in the early 1960s. He later commanded an infantry division. In his last post he was commanding general of the U.S. 7th Army in Germany. He retired from active duty in 1966.\n\nHe made his mark as a staff officer in World War II. In March 1944, after serving as a divisional and corps intelligence officer in North Africa and Italy, he was named intelligence officer of the 7th Army.\n\nAlthough he held the relatively junior rank of lieutenant colonel, he was responsible for gathering and coordinating information for the invasion of southern France on Aug. 15, 1944, that was carried out by U.S. and French troops.\n\nFour months later, he gave timely warning of a desperate German offensive near Colmar in northeastern France. For this, he was awarded the Distinguished Service Medal.\n\nAt the end of the war, Gen. Quinn played a role in Washington in the transformation of the Office of Strategic Services, the wartime spy agency, into the Central Intelligence Agency. In late 1945, he was named director of the Strategic Services Unit, which had been set up to preserve OSS intelligence assets. In July 1946, he was named chief of operations of the Central Intelligence Group. He remained in that job until 1947, when the organization became the CIA.\n\nDirector of Central Intelligence George J. Tenet issued a statement after learning of Gen. Quinn's death, hailing him as \"a leader and visionary\" who played an important role in maintaining the nation's intelligence capability between the end of World War II and the onset of the Cold War.\n\nIn 1997, Gen. Quinn was awarded the Agency Seal Medallion.\n\nWhen the Korean War began in 1950, Gen. Quinn, by then a full colonel, was serving on the staff of Gen. Douglas MacArthur in Tokyo. Gen. Quinn was put in charge of intelligence for the amphibious assault at Inchon. The attack, carried out by Marines and joined by Army troops two days later, turned the tide of battle in the first phase of the war. He then served as intelligence officer of the X Corps.\n\nIn January 1951, he was given command of the 17th Infantry Regiment. The unit had just received a new radio call sign--\"Buffalo\"--and he decided to call his troops \"The Buffaloes.\" He also started a publicity campaign aimed at hometown newspapers. Two newspaper correspondents gave him the nickname \"Buffalo Bill,\" and it stuck for the rest of his life.\n\n\"Almost overnight, the Buffaloes became famous,\" wrote Clay Blair in \"The Forgotten War,\" a history of the Korean War. \"Hundreds of GIs requested a transfer to the outfit; some, Gen. Quinn boasted, even went AWOL to join.\"\n\nOver the next eight months, Gen. Quinn was awarded the Silver Star, for personally reorganizing a stalled attack, and the Bronze Star with combat \"V,\" for leading a patrol eight miles into enemy territory. Other decorations included the Legion of Merit and Purple Heart.\n\nIn September 1951, he returned to the United States. In 1953, he went to Greece for two years with the Joint Military Aid Group. His later assignments were in this country and Germany. He was director of public information from 1959 to 1961, and deputy director of the Defense Intelligence Agency from 1961 to 1964, when he took command of the 7th Army in Germany.\n\nWilliam Wilson Quinn, who was born in Crisfield, Md., graduated from the U.S. Military Academy in 1933 and was commissioned in the infantry. He also graduated from the Army Command and General Staff College and the National War College.\n\nAfter retiring from the Army, he was a vice president of the Aerospace Group of the Martin Marietta Corp. until 1972. He then established Quinn Associates, a consulting firm.\n\nGen. Quinn, a resident of Arlington, was honorary colonel of the 17th Infantry, a consultant to the Senate Select Committee on Intelligence, a trustee of the National Historical Intelligence Museum and a member of the Army & Navy and Chevy Chase clubs and the Talbot County (Md.) Historical Society.\n\nSurvivors include his wife, the former Bette Williams, whom he married in 1939, of Arlington; three children, Sally Quinn, the writer who lives in Washington, Donna Quinn Robbins of Oakland, Calif., and William Jr., of Phoenix; and four grandchildren."}]}