{"William Quinn appeared in The Andy Griffith Show, The Untouchables, and The Twilight Zone.": [{"url": "https://www.britannica.com/topic/The-Andy-Griffith-Show", "page_content": "The Andy Griffith Show, American television comedy series that aired on CBS from 1960 to 1968. During its entire run, the show rated no worse than seventh in the seasonal Nielsen ratings and held the number one spot when it ended.\n\nSee the episode “A Wife for Andy” from The Andy Griffith Show, 1963 See all videos for this article\n\nThe Andy Griffith Show takes place in the fictitious Mayberry, North Carolina, a sleepy rural town. Named after its star, the show centres on Sheriff Andy Taylor (played by Andy Griffith), whose prudent and common-sense approach to life and law enforcement never fails to thwart the petty criminals who make mischief in his jurisdiction. Much of the sheriff’s energy is spent protecting the townsfolk from becoming victims of their own follies. The show plays upon popular stereotypes of rural and small-town life; Mayberry is almost entirely populated by simple (sometimes simple-minded) “country” people immortalized by the likes of gas station attendant Gomer Pyle (Jim Nabors) and the town drunk, Otis (Hal Smith), who locks himself in jail after his weekly bender and lets himself out upon sobering up. Taylor’s hapless sidekick is his excitable cousin, Deputy Barney Fife (Don Knotts), whose overly earnest and misguided tactics typically exacerbate the duo’s problems. Knotts excelled at the role, picking up four Emmy Awards before quitting the show in 1965 and being replaced by Jack Burns. Other frequent story lines concerned Taylor’s parenting of his fishing-enthusiast son, Opie (Ron Howard), and worrying about the misadventures of his unmarried aunt and housekeeper, Aunt Bee (Frances Bavier).\n\nBritannica Quiz The Andy Griffith Quiz\n\nThe Andy Griffith Show was part of a larger trend in 1960s television programming that focused on comedic and lighthearted country themes and characters. The series gave rise to two separate spin-offs, Gomer Pyle, U.S.M.C. (1964–69) and Mayberry, R.F.D. (1968–71). Griffith, a one-time comic monologuist who had appeared in motion pictures such as A Face in the Crowd (1957) and No Time for Sergeants (1958), later had another long stay on television as a lawyer in the title role of Matlock (1986–92, 1993–95). Among the others in the cast who had later success were Knotts, who starred in a raft of motion-picture comedies; Nabors, a singer, who headlined the Gomer Pyle spin-off and hosted a television variety show; and Howard, the star of television’s Happy Days (1974–84) before directing motion pictures such as Cocoon (1985) and A Beautiful Mind (2001)."}, {"url": "https://www.cheatsheet.com/entertainment/how-did-the-andy-griffith-show-end.html/", "page_content": "The classic comedy The Andy Griffith Show ran for eight years on CBS, beginning in 1960. Starting out in black-and-white film, by 1965 the show went full-color and had changed significantly. Here’s how the still-popular program starring Griffith and Don Knotts concluded.\n\nActors Andy Griffith and Don Knotts in a scene from ‘The Andy Griffith Show’ | CBS Photo Archive/Getty Images\n\n‘The Andy Griffith Show’ began on another TV show\n\nAndy Griffith’s show began in 1960 on a completely different program, The Danny Thomas Show. Starring producer and actor Danny Thomas, the series focused on entertainer Danny Williams and his family.\n\nThe episode introducing Sheriff Andy Taylor and his young son Opie, played of course by Ron Howard, was titled “Danny Meets Andy Griffith.” In the episode, Danny goes through a stop sign in Mayberry and is jailed by Andy when he refuses to pay a fine.\n\nThe pilot was a success and Griffith and young Howard’s performances led to CBS putting The Andy Griffith Show in their fall lineup that year.\n\nGriffith told The Andy Griffith Show author Richard Kelly about his anxiety before the live performance on The Danny Thomas Show: “I came out [to Los Angeles], did the pilot – and I remember a lot of that, too, because Danny Thomas made me very nervous. I was wooden, very wooden. And as the show progressed, I got looser and looser and when they brought the audience in, I was on top of it. And the show, in fact, did sell.”\n\nThe ‘Griffith Show’ ended with the pilot episode of ‘Mayberry R.F.D.’\n\nAndy Griffith was ready to leave his show and announced he would do so after the eighth season. The show had changed dramatically from the Mayberry of the first season. Don Knotts had left the series in season five, other characters were introduced, and the series was presented in technicolor by its sixth season.\n\nBy the eighth — and final — season, a new show, Mayberry R.F.D., was announced as a spinoff from The Andy Griffith Show. The last episode of Griffith introduced the new comedy and served as its pilot.\n\nIn The Andy Griffith Show finale, farmer Sam (Ken Berry) sponsors his former Army pal Mario to come from Italy and help him on his land. Unfortunately, Mario brings along his father and sister as well, without Sam’s consent.\n\nJust as Sam is about to suggest the family may be better off in a more spacious neighboring town, Andy comes to the rescue and talks Sam into letting them stay. The new arrivals love Mayberry and the town has taken to them as well. They agree to stay, although they’re never seen again on Mayberry R.F.D.\n\nGriffith had very little interest in the spinoff series\n\nGoober Pyle actor George Lindsey wrote in his memoir Goober in a Nutshell that by the time Mayberry R.F.D. aired, Griffith had basically checked out of the show and spent little time on it.\n\nAfter the Griffith Show ended in 1968, Lindsey remained on Mayberry R.F.D. along with Aunt Bee actor Frances Bavier, Hope Summers who played Clara Edwards, Emmett Clark actor Paul Hartman, and Jack Dodson, who portrayed Howard Sprague.\n\n“I never felt that the scripts on Mayberry R.F.D. were as strong as those for The Andy Griffith Show,” Lindsey wrote. “No doubt that had a lot to do with the fact that Andy Griffith, though still executive producer, only appeared in a handful of episodes and was not as directly involved on the set and with the scripts.”\n\nThe quality of the scripts paled to the Griffith Show‘s, he added: “Goober had a lot more lines in Mayberry R.F.D., but in all honesty, they usually didn’t measure up to the razor-sharp standards of the original series.”"}, {"url": "https://www.grunge.com/254417/the-untold-truth-of-the-andy-griffith-show/", "page_content": "The Untold Truth Of The Andy Griffith Show\n\nMost people know The Andy Griffith Show well; it's one of the most famous classic shows in television history. We all know the story of the small, quaint North Carolina town overrun by several colorful characters. And at the center of Mayberry is solid and steady Sheriff Andy Taylor, played by the one and only Andy Griffith. With his wacky deputy, Barney Fife, at his side, Andy Taylor is the voice of sanity and stabilizing force in Mayberry, keeping its zany residents from causing mayhem in their small town.\n\nThe show gave us fantastic actors like Don Knotts, Frances Bavier, George Lindsey, Jim Nabors, and Howard McNear, who played memorable characters that are still well known today. And of course, the renowned director Ron Howard got his big break in show business at the age of six, playing Andy Taylor's son, Opie. These are just the essential details that everyone knows about the celebrated Andy Griffith Show. As it would turn out, there was a lot more going on behind the scenes that audiences would never have known. This is the untold truth of The Andy Griffith Show."}, {"url": "https://www.grunge.com/1227926/stars-that-were-on-the-andy-griffith-show-before-they-were-famous/", "page_content": "Stars That Were On The Andy Griffith Show Before They Were Famous\n\nOver the course of nearly 250 episodes airing across eight years, the producers and writers of \"The Andy Griffith Show\" created an elaborate and detailed fictional universe populated with hundreds of one-of-a-kind and unforgettable characters. Built as a vehicle for folksy comedian and storyteller Andy Griffith, the 1960 to 1968 sitcom set in the small town of Mayberry, North Carolina, was a self-contained world, where everybody knows everybody but there's always a curious new stranger in town. And so, to round out the sprawling cast of characters on \"The Andy Griffith Show,\" producers brought in lots of guest actors, week after week. As it was one of the most popular shows on television for the entirety of its run, it was a plum opportunity when an actor got hired to play a part of \"The Andy Griffith Show.\" For many, it was a stepping stone or a big break that led to fame and fortune.\n\nHere are some actors who popped into Mayberry for only an episode or two early in their careers, before they became household names. These are the biggest future stars to spot the next time you sit down to catch a rerun of \"The Andy Griffith Show.\""}, {"url": "https://www.cheatsheet.com/entertainment/andy-griffith-the-griffith-show-script-didnt-turn-out-good.html/", "page_content": "As with other top-rated television comedies from past and present, The Andy Griffith Show can thank its stellar writing team for the show’s scripts. And, of course, its ensemble cast that transported viewers to the small town of Mayberry.\n\nGriffith himself was very demanding of the show’s scripts and revealed, many years after the show’s last season in 1968, the episode he felt took some work to get right.\n\nActor Andy Griffith in an off-camera moment on ‘The Andy Griffith Show’ | CBS via Getty Images\n\nBarbara Eden appeared on ‘Griffith’ in its second season\n\nBest known for her role as a thousands-year-old genie on the hit 1960s comedy I Dream of Jeannie, Barbara Eden stopped in to Mayberry for one episode called “The Manicurist.”\n\nShe played Ellen Brown, a roaming nail tech who arrives in Mayberry looking for a friendly town to set her table up in. Eden shared her memories of working on the show’s set with Tied Up in Knotts: My Dad and Me author Karen Knotts (daughter of Barney Fife actor Don Knotts).\n\n“It was a very warm and gentle ambience on the set, but there was no time for conversation,” Eden said. “I had a scene with your dad where I was doing his nails. We were talking, and he said, ‘I don’t know what to do about these nails.’ He just started to chat as Don, and I was chatting as Ellen, and next thing I knew we were doing the scene!”\n\nCheck out Barbara Eden’s appearance on ‘The Andy Griffith Show’ at 0:05.\n\nGriffith said ‘The Manicurist’ took some working on\n\nIn his conversation with the Television Academy Foundation (TAF), Griffith revealed that he, the show’s writers, and its creator, Sheldon Leonard, couldn’t agree on a reason for Ellen Brown’s visit to Mayberry. It clearly miffed Griffith to the point that he discussed it in 1998 when he spoke with TAF.\n\n“The script didn’t turn out good,” Griffith said. “It was called ‘The Manicurist.’ The problem was we couldn’t figure out why this beautiful blonde girl would want to settle in Mayberry. Sheldon jumped up and said, ‘I got it! I got it! She’s got a sick baby in the car and that’s as far as she could get.’ I said, ‘Come on, Sheldon!’”\n\nA ‘Griffith Show’ AD gave insight into the episode\n\nBruce Bilson, who served as an assistant director on the comedy, also offered Karen Knotts his backstory regarding the episode’s writing.\n\n“When this script was discussed after the 10 o’clock reading, Sheldon felt she should have more problems, this woman who’s coming to town,” Bilson told Karen. “He said maybe she broke up with her boyfriend, or she lost her job or couldn’t pay her rent.”\n\nHe backed up Griffith’s account of the discussion over the episode: “Andy said, ‘Oh come on, if she had all those troubles, we’d take her home and give her a hot meal.”\n\nEventually, the show’s executive producer Aaron Ruben introduced the idea of having Eden’s character settle in Mayberry to find a friendly town where she could work.\n\nAnd in the end, Andy Griffith was content with the final script, saying it “turned out to be a very good show.”"}, {"url": "https://www.yahoo.com/entertainment/happened-marlene-willis-played-lucy-120921398.html", "page_content": "In 1960, Marlene Willis portrayed Lucy Matthews in a memorable episode of The Andy Griffith Show titled “Stranger in Town.” While it marked her only appearance in the franchise, viewers have long been curious about what happened to the stunning actress. Scroll below for details on her life and career after the show.\n\nWho Was Marlene Willis From ‘The Andy Griffith Show’?\n\nPrior to her appearance on The Andy Griffith Show, Willis, born in 1942, appeared in 1957’s Rockabilly Baby, 1958’s Attack of the Puppet People and made appearances in The Loretta Young Show in 1960. The California native had a musical background, performing in local variety shows and talent competitions throughout her childhood and teen years.\n\nIn high school, she and her classmates performed on the show Rockin’ Rhythm on the local KTTV station as she continued to search for her big break. Willis released several singles under Verve Records in the late ‘50s before landing her role on The Andy Griffith Show at the age of 18.\n\nAndy Griffith Affected on ‘Very Deep Level’ by Son's Death\n\nIn the classic and unforgettable episode, Ed Sawyer, played by William Lanteau, came to Mayberry to profess his love for Lucy, whom he described as the woman of his dreams. As the folks in Mayberry questioned the town’s new stranger and his odd behavior, Sheriff Andy Taylor gave him the benefit of the doubt.\n\nDuring the episode, it was revealed that Ed had never actually met Lucy before, leading to a very awkward exchange with her. He had only heard tales of the town of Mayberry and some of the people that lived there through one of his pals while serving in the U.S. Army.\n\nAs an angry mob tried to run Ed out of town, Andy stepped in to deliver a speech about welcoming people into the neighborhood with open arms despite their quirks and differences. Sharing the screen with Andy Griffith, Ron Howard, Don Knotts and Phil Chambers was a huge career highlight for Willis.\n\nWhat Happened to Marlene Willis After ‘The Andy Griffith Show’?\n\nAfter captivating the audience on the CBS sitcom, Willis appeared in a 1961 episode of Maverick as well as an episode of Laramie that same year. Her last acting appearance came in a 1963 episode of The Dick Powell Theatre. The performer was married to Kerry Hodges from 1966 up until her death in 1982 at age 40 from cancer."}, {"url": "https://www.hollywoodreporter.com/tv/tv-news/pat-rosson-dead-andy-griffith-show-1235193595/", "page_content": "Pat Rosson and Andy Griffith in 1960 on 'The Andy Griffith Show' episode \"Runaway Kid\"\n\nPat Rosson, a son and grandson of cinematographers who appeared on The Andy Griffith Show, The Twilight Zone and the soap opera The Young Marrieds as a child actor in the 1960s, has died. He was 69.\n\nRosson died April 28 of a heart attack in Los Angeles, his daughter, Maria Delilah Rosson, told The Hollywood Reporter.\n\nOn “Runaway Kid,” which premiered in November 1960 as the sixth episode of CBS’ The Andy Griffith Show, Rosson played George “Tex” Foley, whose circumstances teach Opie (Ron Howard) a lesson about trust and keeping promises.\n\nA month later, he appeared on CBS’ The Twilight Zone on the season two episode “The Night of the Meek,” which starred Art Carney as a down-on-his-luck department store Santa Claus.\n\nOn ABC’s The Young Marrieds from 1965-66, Rosson portrayed Jerry Karr, a youngster in the middle of a custody battle between his biological mother, Susan Garrett (Peggy McCay), and his adoptive mother, actress Lena Gilroy (Norma Connolly).\n\nRosson was born in Los Angeles on July 20, 1952. His late younger brother, Eddie Rosson (It’s a Mad Mad Mad Mad World, Camp Runamuck), also was a child actor.\n\nTheir father, Edward Rosson, served as the cinematographer on White Lightning (1973) and Love at First Bite (1979), and their mother, Lili Rosson, was an actress who had small parts in North by Northwest, Some Came Running and The Adventures of Ozzie and Harriet.\n\nTheir grandfather, Harold Rosson, was the five-time Oscar-nominated cinematographer known for his work on The Wizard of Oz (1939) and Singin’ in the Rain (1952).\n\nPat Rosson with another child actor and Art Carney on the 1960 ‘Twilight Zone’ episode “The Night of the Meek” Courtesy Rosson family\n\nPat Rosson also teamed with Frank Sinatra (and a bunch of other kids) to belt out “High Hopes” on television in 1959 and appeared with his godfather, actor Paul Picerni, on The Untouchables in 1962.\n\nHe also was on Dennis the Menace, Ben Casey, My Three Sons, Hazel and The Munsters (with a walkie-talkie on the 1965 episode “If a Martian Answers, Hang Up”) and in the films The Wonderful World of The Brothers Grimm (1962) and Johnny Cool (1963).\n\nHe later attended Notre Dame High School in Sherman Oaks and worked in real estate.\n\nIn addition to his daughter, survivors include his wife, Ruth; sister Christa; nephews Troy and Tobey; and niece Sophie."}, {"url": "https://www.yesteryearretro.com/2022/01/convicts-at-large-my-favorite-episode.html", "page_content": "When I was pretty young, one of the many things I remember fondly was laughing with Mom and Dad at television late into the night. Well, for me at that age, late was about 8pm. In the summertime, the windows would be open, and several times, Granny (who lived next door) would ask what we were laughing so hard at the following day when I went over to play.\n\nFrequently, what we'd be laughing at would be The Andy Griffith Show.\n\nA staple of TBS during its early days, The Andy Griffith Show, or \"Andy\" as we called it, was just pure wholesome fun. As Americana as Aunt Bea's apple pie, the show depicted the widowed Andy Taylor (Andy Griffith), the Sheriff of a fictional small town of about 2500 people called Mayberry, North Carolina. Other characters include Andy's cousin, the well-meaning and enthusiastic deputy, Barney Fife (Don Knotts); Andy's aunt and housekeeper, Bee Taylor (Frances Bavier); and Andy's young son, Opie (Ron Howard).\n\nMy wife rolls her eyes when I put the show on some nights, but just as my Dad watched it because he remembered it fondly from his childhood, so do I. In the crazy world that we live in today in 2022, it's nice to just sit back and picture what I envision the quiet, calm, small-town 1950's America was like. I'm sure it's just Hollywood-level quaintness, but it's nice to dream about what could have been... and what I think still ought to be.\n\nThis one's a long one, so without further ado, please click \"Read More\" and join me on a look back at my favorite episode of The Andy Griffith Show, Convicts at Large.\n\n\n\n\n\nThe 74th episode of the series, Season Three's \"Convicts at Large,\" is my favorite episode of The Andy Griffith Show. Originally airing on December 10, 1962, this episode centers around Barney (Don Knotts) and Floyd the barber (Howard McNear). The two run out of gas while returning from a fishing trip and, while looking for a telephone, are captured by three escaped female convicts.\n\n\n\n\n\nWe open to the iconic opening credits, whistled by music composer Earl Hagen. I always loved this opening and thought it set the mood perfectly for the show to come. While Andy and Opie are walking down to the Mayberry fishing hole, the two are really walking down to the pond in Franklin Canyon Park, near Los Angeles, California. Franklin Canyon Park was also used to film scenes in the 90s kid's sitcom Salute Your Shorts as well as the Bat-Cave exterior scenes in the opening credits to the 1960's Adam West version of Batman. Mayberry's old fishing hole was also used for the creepy lagoon scenes in the original Creature from the Black Lagoon.\n\n\n\n\n\nAfter the credits, we see the outside of a prison at night. Sirens wail and guards rapidly shine spotlights around the yard, searching for someone. We cut to what seems like the following day as three women quietly creep amongst trees in a forest.\n\n\n\n\n\nFirst out of the brush is Big Maude Tyler, played by Reta Shaw. Reta always reminded me of Anne Ramsey, who played Mama Fratelli in The Goonies or Momma in Throw Momma From The Train. Both frequently played strong, working women on the wrong side of the law but Reta may be best known as the cook in Mary Poppins, even though her experience in film and television is quite extensive. Later in The Andy Griffith Show series, she appeared in \"The Song Festers,\" where she played Barney's vocal coach.\n\n\n\n\n\nBig Maude is soon followed by Naomi (Jean Carson) and Sally (Jane Dulo). Jean Carson appears in my favorite episode of The Twilight Zone titled \"A Most Unusual Camera.\" In that episode, she is the girlfriend of a criminal who finds a camera that takes photos of the future. They use the camera to their financial benefit at the race track, but it all ends with deadly consequences. Jean had a full career on film, television, and stage but is likely best known for her role on Andy Griffith... but not from this episode. She appeared later in the series, three times to be exact, as Daphne, one of \"the fun girls\" from Mount Pilot that would come down from the 'big city' to flirt and dance with Andy and Barney.\n\n\n\n\n\nJane Dulo, a character actress that has been in seemingly every sitcom made during the 60s and 70s, only appeared this once on The Andy Griffith Show.\n\n\n\n\n\nThe three escaped convicts discover a vacant hunting cabin and head inside. Through just a few lines of dialogue and body language, we quickly establish Big Maude is the ring leader.\n\n\n\n\n\nMeanwhile, we cut to the Sheriff's Office in Mayberry, where Andy listens to a crime bulletin on the radio about the escaped women. A funny joke lists the aliases of Big Maude: Maude Tyler, Big Maude Tyler, Clarise Tyler, Maude Clarise Tyler, Annabelle Tyler... and Ralph Henderson.\n\n\n\n\n\nAndy mutters to himself that it would be just like Barney to \"be off fishing today,\" establishing that the Deputy is out of town. With that, we see Barney behind the wheel of a sputtering car that has just run out of gas. Seated next to him is Floyd Lawson, the barber. After bickering about a shortcut that made them run out of gas, Barney puts on his police uniform \"just in case\" they need to hitchhike.\n\n\n\n\n\n\n\n\n\nThe two then stumble upon \"the old O'Malley\" place. The lights are on, but Barney mentions that he thought O'Malley was away in Detroit. Naomi spots them walking down the road from inside and calls for Big Maude's help. Big Maude says not to worry, that she has a plan to get rid of them. When Barney calls out for Mr. O'Malley, she yells out, \"NOBODY'S HERE!\"\n\n\n\n\n\nAfter Barney explains their need for gasoline, Maude opens the door to invite them in. Clearly still in her prison uniform with her prisoner number on it, Floyd accepts her explanation the uniform is from the \"Girl Camper's of America\" troop. Barney immediately senses something wrong and screams, \"THEY'RE CONS!\" as the girls jump him and take away his pistol. Big Maude immediately realizes that the gun is unloaded, and questions why a policeman would have an unloaded pistol.\n\n\n\n\n\n\n\n\n\nFloyd spills the beans, however, explaining that Barney is only allowed one bullet in case of emergencies. When Maude demands he hand over the bullet, Floyd goes so far as to tell her that Barney keeps it in his front left shirt pocket. Sally immediately takes a liking to Barney, telling Maude she thinks \"the cop is kind of cute\" and that Barney reminds her of Al from the old Cascade Club in Toledo. The two share \"the same dumb face, weak chin, and round shoulders.\"\n\n\n\n\n\nThe dimwitted Floyd starts anxiously looking at his watch and once again spills the beans that Andy will come looking for Barney if he's not back by a specific time this afternoon. Big Maude decides that \"Al\" can fix that right now by phoning the Sheriff and saying he's spending the night with O'Malley at the cabin. Barney demands to be called by his real name and questions what happens if he refuses to make the call.\n\n\n\n\n\nWhen the girls get intimidatingly close with the gun, Floyd whispers, \"You better call him, Al.\"\n\n\n\n\n\n\n\n\n\nFloyd calling Barney by Sally's ex-boyfriend name several times is probably one of the funniest gags throughout the show, if not the entire series. I don't care how often I've seen this episode; I still laugh whenever Floyd calls him Al.\n\n\n\n\n\nBarney makes the call and tells Andy he won't be home because he and Floyd are too tired, and O'Malley offered for them to spend the night. Andy says he thought O'Malley was in Detroit, but nothing was going on and tells Barney to have a good time. Barney quickly tries to tell Andy that he's being held prisoner by those women speaking in Pig Latin, but Andy had already hung up. Maude warns the deputy if he tries anything like that again, she's gonna let Naomi \"curl his hair\" with the gun. Naomi begs for the chance because, after all, she's a convicted husband beater who hates men.\n\n\n\n\n\nFloyd leans in and says, \"You better watch it, Al.\"\n\n\n\n\n\n\n\n\n\nThe girls soon get cabin fever and turn on the record player. Dancing by herself, Sally reminisces about the Cascade Club in Toledo and asks \"Al\" to dance. Barney refuses but Big Maude forces him at gunpoint. Resigned to dancing, Barney begs to at least be the one who leads.\n\n\n\n\n\nNaomi asks Floyd if he wants to fight while Floyd encourages Al to be \"light on his feet.\" When Sally changes records, Naomi cracks Floyd over the head with a ceramic bowl because her wedding song brought back bad memories.\n\n\n\n\n\nLater on, Floyd is forced to recite a shopping list for groceries. Sally wants to stay and dance with Al, but Maude chases them off. While holding the gun to Barney's head, she reminds Floyd that \"any funny business and Al gets it.\"\n\n\n\n\n\nIn town, Andy sees Floyd loading the groceries into the car and runs over to say hello. Nervously, Floyd says everything is going great, and \"even Al is having a good time,\" before trying to get into the car. The barber quietly points out Sally sitting in the driver's seat, but Andy misunderstands. He thinks O'Malley, Barney, and Floyd are having a romantic weekend in the woods with some ladies. Still trying to make Andy aware of their predicament, he again says it's just O'Malley, himself... and Al.\n\n\n\n\n\nWhen Andy asks who Al is, Floyd only whispers, \"Al dances with Sally.\"\n\n\n\n\n\n\n\n\n\nAndy suggests cutting out of work early and joining him, but Floyd quickly says if Andy were to join them, then it's \"goodbye, Al!\" Andy laughs and agrees that \"eight's company, nine's a crowd\" and wishes him a good time.\n\n\n\n\n\nAs Floyd and Sally drive away, a bus pulls up, and Mr. O'Malley (Willis Bouchey) steps off. He calls out to Andy, who quickly realizes something is fishy somewhere. Andy offers to drive O'Malley out to his cabin, and the two head off to find out what's happening at the cabin.\n\n\n\n\n\nBack at the cabin, Naomi is trying to fistfight with Deputy Fife, but Maude demands her turn to dance with him. Just as they begin, Floyd returns home with arms full of groceries. He happily proclaims, \"We're home!\"\n\n\n\n\n\nSally goes outside to get a bucket of water while Andy and Mr. O'Malley look on from the bushes. When she returns inside, Sally notices Naomi is cooking all of the hamburgers rare.\n\n\n\n\n\nQuestioning Barney, Sally asks: \"Al, honey, Naomi is making them all rare. As I remember, you used to like your burgers well done.\" Barney frustratedly yells back, \"No! Medium rare!\"\n\n\n\n\n\nSally sullenly responds, \"You've changed, Al.\"\n\n\n\n\n\nWhile the exchange over how Al has changed occurs, Andy secretly reaches through the kitchen window and empties the water bucket. Naomi, thinking Sally didn't fill the bucket, takes it and heads outside to fill it herself.\n\n\n\n\n\nWhen she places the bucket under the pump, Andy makes his move. He slaps a pair of handcuffs on her wrist while O'Malley covers her mouth with a handkerchief and drags her off to the waiting police car.\n\n\n\n\n\nInside, Maude sees that the burgers are burning and sends Sally out to see what's keeping Naomi. As she leans over the railing, Andy and Mr. O'Malley replicate the maneuver before dragging her off to the squad car, too.\n\n\n\n\n\nMaude puts Barney in charge of cooking and instructs him to clear the smoke out of the kitchen. While waving a towel towards the window, Andy pops his head up into view. He tells Barney to get \"the big one\" to come outside, but Maude interrupts and sends Barney back to the couch. Floyd is happily eating a banana and gives Al a big dumb smile.\n\n\n\n\n\n\n\n\n\n\n\nMaude changes the record in the player and Barney rises to his feet, offering to dance the tango with her. He keeps trying to take the lead and begs her to relax and let him guide her to the land of \"rhythm and pleasure.\" While dancing, he opens the front door of the cabin bit Maude is immediately suspicious. Asking why he opened the door, Barney nervously says he can't stand crowded ballrooms. Thankfully, she accepts that answer and cracks up laughing.\n\n\n\n\n\n\n\nHe attempts to get her to dance toward the door several times before successfully getting her outside. Andy pounces, and the two finally capture the third escaped convict.\n\n\n\n\n\nWhile Andy gently teases Barney, an exasperated Floyd comes running out of the front door with a line that still slays me:\n\n\n\n\n\n\"Maude, Al... if those hamburgers are ruined, I won't be responsible!\"\n\n\n\n\n\nAs the episode comes to a close, days later, Barney is acting humble while bragging about how he remained cool and calm but poor Floyd didn't know what to do with himself. Andy humors him, saying Floyd probably doesn't realize how lucky he is to have had Barney by his side through the ordeal. Finding the evening paper outside the Sheriff's Office door, Barney is distraught to see the headline that reads \"LOCAL BARBER CAPTURES ESCAPED CONVICTS!\"\n\n\n\n\n\n\n\n\n\nThis episode was written as a satire of the 1953 best-selling book, 1954 Tony award-winning play (starring Paul Newman), and 1955 movie (starring Humphrey Bogart) called \"The Desperate Hours.\" The book, play, and movie cover the well-known real-life prison escape of 3 male convicts and their invasion of a suburban Pennsylvanian home inhabited by the Hill family. The family was treated well while held hostage, and the convicts were caught when they finally left the house. The Andy Griffith Show writers thought the situation would be funnier if the convicts were made into women.\n\n\n\n\n\nThis was also the last appearance of Howard McNear (Floyd the barber), who suffered a stroke and left the show immediately following filming. He would return toward the end of season four, but his character was noticeably different as the actor suffered severe damage by the stroke. He stayed until the end of season 7, but this episode was the last leading role for the character.\n\n\n\n\n\nDuring the episode, Maude uses the phrase \"Acka Backa\" when shooing Sally and Floyd into town for groceries. I was curious, so I did a little googling for you. The phrase \"Acka Backa\" refers to a children's nursery rhyme: \"Acka backa soda cracker, acka backa boo. Acka backa soda cracker, out goes you!\" A reference lost to time, but in context, makes total sense.\n\n\n\n\n\nAnother fun fact I found while researching this episode is that this is one of only three episodes in the entire series where a female is shown smoking.\n\n\n\n\n\nThis episode is my favorite of all 249 episodes of The Andy Griffith Show. I can even remember the first evening my Dad and I sat watching this episode. We were laughing so much at the \"Al\" schtick that my Mom even popped her head into the living room to see what was so funny. Apparently, we aren't the only ones who like this episode so much. It's one of the two highest-rated episodes on IMDb, with a 9.4 based on user ratings. It's tied with \"The Pickle Story,\" an episode that focuses on Aunt Bee's homemade pickle business. The pickles are terrible and Andy and Barney's plan to replace them with store-bought backfires.\n\n\n\n\n\nDo you enjoy this episode as much as I do? Do you have a different favorite episode of \"The Andy Griffith Show?\" Leave a comment below and let me know!"}, {"url": "https://www.grunge.com/1227926/stars-that-were-on-the-andy-griffith-show-before-they-were-famous/", "page_content": "Stars That Were On The Andy Griffith Show Before They Were Famous\n\nOver the course of nearly 250 episodes airing across eight years, the producers and writers of \"The Andy Griffith Show\" created an elaborate and detailed fictional universe populated with hundreds of one-of-a-kind and unforgettable characters. Built as a vehicle for folksy comedian and storyteller Andy Griffith, the 1960 to 1968 sitcom set in the small town of Mayberry, North Carolina, was a self-contained world, where everybody knows everybody but there's always a curious new stranger in town. And so, to round out the sprawling cast of characters on \"The Andy Griffith Show,\" producers brought in lots of guest actors, week after week. As it was one of the most popular shows on television for the entirety of its run, it was a plum opportunity when an actor got hired to play a part of \"The Andy Griffith Show.\" For many, it was a stepping stone or a big break that led to fame and fortune.\n\nHere are some actors who popped into Mayberry for only an episode or two early in their careers, before they became household names. These are the biggest future stars to spot the next time you sit down to catch a rerun of \"The Andy Griffith Show.\""}, {"url": "https://outsider.com/entertainment/the-andy-griffith-show-meet-tom-jacobs-extra-who-appeared-72-episodes/", "page_content": "How does one appear in 72 episodes of The Andy Griffith Show without ever becoming a supporting player? It’s a question we’d love the opportunity to ask the late Tom Jacobs – a man who did exactly that.\n\nBorn just three years into the 20th century, Thomas Yakhoob would enter the world on March 31, 1903 in Monroe, Michigan. Today, film remembers the late actor by his stage name, Tom Jacobs.\n\nFrom The Danny Thomas Show in the early 1950s to The Joey Bishop Show in the next decade, Jacobs would do his best to make a name for himself on the small screen. He even wound up on one of the most beloved television shows of all time: The Andy Griffith Show, starting in 1960. He’d stay until 1965, too.\n\nSo why, then, has no one heard of Tom Jacobs?\n\nIt’s a great question. Before his death on March 3, 1976 in Lucerne, California, Jacobs would amass an astounding 72 episodes of The Andy Griffith Show – and all without ever getting a character name.\n\nInstead, IMDb lists the actor and his 72 credits under the moniker of “Townsman”. For five years, Tom Jacobs would appear on Andy Griffith as a Mayberry “Townsman”. But he would also appear as a “Grocer,” “Audience Member,” and most plainly: “Man”.\n\n‘The Andy Griffith Show’s Disappearing Man: Tom Jacobs\n\nAs such, his filmography is beyond peculiar. Looking at his body of work on The Andy Griffith Show alone shows a smorgasbord of the most beloved episodes in the show’s history… All with Tom Jacobs right there in the cast:\n\nThe Cannon (1965) … Townsman\n\nAunt Bee on TV (1965) … Townsman\n\nOpie and the Carnival (1965) … Townsman\n\nThe Luck of Newton Monroe (1965) … Townsman\n\nThe Arrest of the Fun Girls (1965) … Townsman\n\nBarney Runs for Sheriff (1965) … Grocer\n\nGoober Takes a Car Apart (1965) … Man\n\nOtis Sues the County (1964) … Townsman\n\nThree Wishes for Opie (1964) … Townsman\n\nThe list goes on…\n\nUpon looking at his credits for The Danny Thomas Show and The Joey Bishop Show, it gets even stranger. There, the exact same happenstance occurs, with Tom Jacobs appearing in dozens of episodes – all whilst never garnering any sort of character name or recurring role.\n\nFor The Danny Thomas Show, it looks near identical to his The Andy Griffith Show work:\n\nThe Practical Joke (1959) … Nightclub Worker\n\nGrampa’s Diet (1959) … Man in Delicatessen\n\nTerry’s Girlfriend (1958) … Waiter\n\nTerry, the Breadwinner (1957) … The Waiter\n\nDanny Goes Social (1957) … Cafe Waiter\n\nThe School Teacher (1957) … Band Leader\n\nDanny Strikes Oil (1955) … Band Leader\n\nTerry Takes Charge (1954) … Messenger\n\nDanny Thomas: A Famous Brother?\n\nAnd then it appears. Buried deep in the IMDb history of Tom Jacobs is one key factor: he was the brother of the television star himself, Danny Thomas – who at one point shared the surname Jacobs with his brother.\n\nKnown primarily as a television actor, Thomas starred as the titular nightclub singer on the popular The Danny Thomas Show (1953).\n\nHe would later work on everything from The Dick Van Dyke Show to The Andy Griffith Show – bringing his brother Tom along for the ride.\n\nBy comparison, Thomas’ Hollywood resume is astounding, as are his award-winning turns on television. Thomas won everything from the Bob Hope Humanitarian Award to a “Best Actor Starring in a Regular Series” Primetime Emmy.\n\nNow, at least, we know a part of the story for The Andy Griffith Show‘s most prolific extra."}]}