{"William Quinn was a regular on The Rifleman.": [{"url": "https://www.ranker.com/list/full-cast-of-the-rifleman-cast-list-for-the-show-the-rifleman/reference", "page_content": "The Rifleman cast list, including photos of the actors when available. This list includes all of the The Rifleman main actors and actresses, so if they are an integral part of the show you'll find them below. You can various bits of trivia about these The Rifleman stars, such as where the actor was born and what their year of birth is. This cast list of actors from The Rifleman focuses primarily on the main characters, but there may be a few actors who played smaller roles on The Rifleman that are on here as well.\n\nItems on this list include Chuck Connors and Lee Van Cleef\n\nIf you are wondering, \"Who are the actors from The Rifleman?\" or \"Who starred on The Rifleman?\" then this list will help you answer those questions.\n\nIn most cases you can click on the names of these popular The Rifleman actors and actresses to find out more information about them. If you're looking for a particular The Rifleman actor or actress, then type their name into the \"search\" bar to find them directly."}, {"url": "https://www.therifleman.net/episodes?episode=47", "page_content": "PanicEpisode 47Writer: Albert AleyDirector: Joseph H. LewisOriginal Air Date 11/10/1959Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nLynn Cartier as Mother of Sick Boy\n\nLynn Cartier guest-starred in two episodes of THE RIFLEMAN, portraying Mrs. Porter in \"Panic\" (episode 47) and Alice Bedford in \"The Hero\" (episode 59).\n\nDabbs Greer as Brett\n\nDabbs Greer was an American actor who had a prolific career spanning more than 50 years. A highly recognizable character actor—the quintessential everyman—he played a wide range of supporting roles in film and television. Originally from Missouri, his southern accent lent authenticity to the rural characters he often portrayed, especially in Westerns. Frequently cast as a minister, his most memorable role may have been Reverend Alden in \"Little House on the Prairie\" (1974–1983). Greer made his film debut in the 1938 feature \"Jesse James.\" He appeared in the 1958 film noir \"I Want to Live\" and reprised a similar role in the 1999 film, \"The Green Mile,\" in which he played the Tom Hank's character, Paul Edgecomb, as an elderly man. Greer appeared in several recurring roles in popular television series in the 1950's and 1960's, including THE RIFLEMAN, in which he guest-starred eight times: he portrayed Marcus Trimble in \"Outlaw's Inheritance\" (episode 38), Sam Elder in \"Boomerang\" (episode 39), Brett in \"Panic\" (episode 47), Farley Steele Weaver in \"The Jailbird\" (episode 73), Jack Scully in \"The Promoter\" (episode 87), Finny in \"The Wyoming Story, Parts I and II\" (episodes 96 and 97), and Taylor, a prison guard in \"The Stand-In\" (episode 114). Greer's recurring roles in other popular TV series included \"Hank\" (1965–1966), in which he played track coach Ossie Weiss, The Ghost & Mrs. Muir\" (1968-–1970), as Sheriff Norris \"Norrie\" Coolidge, and in\"Gunsmoke\" (1955–1975) as storekeeper Wilbur Jonas.\n\nEnid Janes/Jaynes as Amy Barker\n\nEnid Janes/Jaynes made six guest appearances in THE RIFLEMAN, twice in two-part stories. She appeared as Amy Barker in \"Panic\" (episode 47), Aggie in \"The Wyoming Story, Parts I and II\" (episodes 96 and 97), as Abbey Striker in \"Quiet Fear\" (episode 127), and the Pregnant Woman in \"Waste, Parts I and II\" (episodes 143 and 144). She later appeared with Chuck Connors in \"Geronimo\" (1962) as Huera. Jaynes was wife of THE RIFLEMAN producer Jules V. Levy.\n\nBill Joyce as Clay Barker\n\nWilliam \"Bill\" Joyce was an American stage, film and television actor. He appeared in more than 40 movies and television shows during a career spanning 45 years. Following his service in the United States Army, Joyce began performing on Broadway, appearing in various productions, including \"Damn Yankees\" and \"Bye Bye Birdie.\" He had several film roles, including the leading role of Tom Harris in the horror B-movie \"I Eat Your Skin\" (1964) and Senator Charles in the thriller \"Parallax View\" (1974), starring Warren Beatty; as well as a minor part in the biographical drama \"The Wings of Eagles\" (1957), starring John Wayne. He also guest-starred in the soap opera \"Days of Our Lives\" (1965– ). He made one appearance in THE RIFLEMAN, portraying Clay Barker in \"Panic\" (episode 47). He also guest-starred in the westerns \"Bat Masterson\" (1958–1961), starring Gene Barry; \"Rawhide\" (1959–1966), starring Clint Eastwood; \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone.\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nFay Roope as Doc Burrage\n\nFay Roope was an American character actor, born Winfield Harding Roope. Beginning in the 1920's he was primarily a stage actor, appearing both off and on Broadway for nearly 30 years. In the 1950's until his death in 1961, he worked primarily in film and television. His film credits include roles in \"From Here To Eternity\" (1953, uncredited), the Gary Cooper comedy \"You're in the Navy Now\" (1951, uncredited), and the original version of the science-fiction classic film \"The Day the Earth Stood Still\" (1951, uncredited) and \"Viva Zapata\" (1952) and \"Ma and Pa Kettle at Waikiki\" (1955). Roope also guest-starred in numerous television series, including \"Mr. & Mrs. North\" (1952–1953), \"Dragnet\" (1958), \"Perry Mason\" (1958) and \"Twilight Zone\" (1960). He also appeared in many of the drama anthology shows during the Golden Age of television. Roope made four appearances in THE RIFLEMAN, portraying Jeff Stacey in \"The Brother-In-Law\" (episode 5), Baynes Barton in \"The Spiked Rifle\" (episode 49), and he was one of six actors to play the recurring character of Doc Burrage—Roope portrayed Doc Burrage in \"Panic\" (episode 47) and \"The Legacy\" (episode 51). He was a recognizable veteran actor in Westerns, including \"The Lone Ranger\" (1954), \"The Life and Legend of Wyatt Earp\" (1955–1958), \"The Adventures of Jim Bowie\" (1957–1958), \"Gunsmoke\" (1959), in which he played the recurring character Mr. Botkin, \"Bonanza\" (1959), \"The Texan\" (1958–1960), \"Rawhide\" (1959) and \"Cheyenne\" (1960).\n\nHope Summers as Hattie Denton, Owner of the General Store\n\nHope Summers was an American actress of the stage, radio, film and television. Her acting career began in the 1930's, when she worked primarily in community and stock theater and radio. Her career was most active in the 1950's and 1960's, when she appeared in numerous films and television shows. Her film credits include \"Zero Hour!\" (1957), \"Inherit the Wind\" (1960), \"Spencer's Mountain\" (1963), \"The Hallelujah Trail\" (1965), \"The Ghost and Mr. Chicken\" (1966), \"The Shakiest Gun in the West\" (1968), \"Rosemary's Baby\" (1968), \"Charley Varrick\" (1973) and her last movie, \"Foul Play\" (1978). Summers began working in television in the 1950's, guest-starring in a wide variety of genres, but especially Westerns. Her television credits include \"The Loretta Young Show\" (1956–1959), \"Maverick\" (1957) and \"Wagon Train\" (1957), \"Gunsmoke\" (1958–1963), \"Dennis the Menace\" (1959), \"Petticoat Junction\" (1963) and \"The Phyllis Diller Show\" (1966). She played numerous memorable recurring roles in many hit television series, including \"Hawkins Falls: A Television Novel\" (1950). Her best-known role was Clara Edwards, Aunt Bee's gossipy neighbor, in \"The Andy Griffith Show\" (1960-1968) and its spin-off, \"Mayberry R.F.D.\" (1968–1971). Summers appeared in 16 episodes of THE RIFLEMAN as Hattie Denton, owner of the General Store. Hattie was first introduced in \"Eight Hours to Die\" (episode 6). Her last regular television role was playing Olive in \"Another Day\" (1978).\n\nCharles Watts as Maury Cass\n\nCharles Watts was an American film and television actor. He appeared in more than 100 movies and television shows in a short but busy acting career of just 15 years. Born in Clarksville, Tennessee in 1912, in his early life Watts was a high-school teacher and worked in local theater and tent shows. He did not embark upon a full-fledged acting career until 1950; however, as a portly character actor, Watts was usually cast in supporting roles, frequently portraying glad-handing politicians, voluble businessmen and salesmen, wily bankers, and alternately avuncular or distrustful family elders. His movie credits include the film adaption of Edna Ferber's \"Giant\" (1956) starring Rock Hudson, James Dean and Elizabeth Taylor, the romantic film classic \"An Affair to Remember\" (1957), starring Cary Grant and Deborah Kerr, the biopic \"The Spirit of St. Louis\" (19557), starring James Stewart, \"The Big Circus\" (1959), starring Victor Mature and Rhonda Fleming, among many others. He guest-starred in many popular shows, including the western \"The Cisco Kid\" (1951–1954), starring Duncan Renaldo, the comic book superhero series \"Adventures of Superman\" (1952–1958), starring George Reeves, the mystery anthology series \"Alfred Hitchcock Presents\" (1957–1968),the crime dramas \"Dragnet\" (1951–1959), starring Jack Webb and Henry Morgan, and \"The Untouchables\" (1959–1963), starring Robert Stack. Watts also appeared in lighter fare, including the family sitcom \"Bachelor Father\" (1959–1962), in which he played the recurring role of Judge Blandon, and the classic family comedy based on the comic strip \"Dennis the Menace\" (1959–1963), starring Jay North in the title role. Watts made three appearances in THE RIFLEMAN, portraying Alvah Kemper in \"The Brother-in-Law\" (episode 5), Maury Cass in \"Panic\" (episode 47) and Joe Beaseley in \"The Mescalero Curse\" (episode 106). In addition to THE RIFLEMAN, Watts guest-starred in a number of other westerns, including \"The Lone Ranger\" (1949–1957), starring Clayton Moore, \"Maverick\" (1957–1962), starring James Garner, \"Rawhide\" (1959–1966), starring Clint Eastwood, \"The Life and Legend of Wyatt Earp\" (1955–1961), starring Hugh O'Brian, \"Gunsmoke\" (1955–1975), starring James Arness, and \"Bonanza\" (1959–1973), starring Lorne Greene, Dan Blocker, Pernell Roberts and Michael Landon.\n\nGuest Cast"}, {"url": "https://www.tvguide.com/tvshows/the-rifleman/cast/1030223317/", "page_content": "Join or Sign In\n\nSign in to customize your TV listings\n\nContinue with Facebook\n\nContinue with email\n\nBy joining TV Guide, you agree to our Terms of Use and acknowledge the data practices in our Privacy Policy."}, {"url": "https://www.therifleman.net/guest-stars/", "page_content": "Directory of Guest Stars A B C D E F G H I J K L M N O P Q R S T U V W X Y Z\n\nA\n\nJohn Abbott, born John Kefford, was an English character actor. He appeared in 150 movies and television shows in a career spanning nearly 50 years. He performed in a wide range of different genres, although several of his early roles were uncredited. Despite being blacklisted in the 1950s, Abbott remained a sought-after performer. He is best remembered for his portrayal of Frederick Fairlie in \"The Woman in White\" (1948). He also provided the voice of the wolf in Walt Disney's \"The Jungle Book\" (1967). Abbott made one appearance in THE RIFLEMAN, portraying Dr. Hennekin in \"The Vision\" (episode 66). In addition to THE RIFLEMAN, he also guest-starred in \"Gunsmoke\" (1955–1975) and \"Bonanza\" (1959–1973).\n\nStanley Adams was an American actor and screenwriter. He appeared in nearly 200 television shows and movies in a career spanning more than 20 years. He wrote for various popular television series, including \"Bonanza\" (1959–1973) and \"Star Trek\" (1966–1969). He had his first film role in \"Death of a Salesman\" (1951), portraying the bartender. He had a recurring role in the comedy series \"The Adventures of Hiram Holliday\" (1956–1957), playing the part of Garreaux. Adams made one appearance in THE RIFLEMAN, portraying Dr. Jay Carter in \"Outlaw's Shoes\" (episode 141). In addition to THE RIFLEMAN, Adams also guest-starred in \"Wagon Train\" (1957–1965) and \"Gunsmoke\" (1955–1975).\n\nClaude Akins was an American actor of stage, film and television. He appeared in over 100 movies and 180 television shows in a career spanning more than 40 years. He served in the US Army Signal Corps during World War II and was stationed in Burma and the Philippines. Prior to his military service, Akins attended Northwestern University where he studied theater and upon returning home from his last deployment, he rekindled his interest in art and drama, appearing in his first film role in \"From Here to Eternity\" (1953). Akins was broad-shouldered and barrel-chested, with a deep baritone voice and dark wavy hair. Gregarious, likeable and friendly, he was never short of work. He was equally adept at playing sneering cowardly villains and portraying hard-nosed cops. Akins is best remembered for his television role as Sheriff Lobo in the 1970's series \"B.J. and the Bear\" and later a spin-off series, \"The Misadventures of Sheriff Lobo.\" He quickly began notching up roles in TV shows, including \"Dragnet,\" \"My Friend Flicka\" and \"Zane Grey Theatre.\" He also turned in several strong cinematic performances, playing Mack in the excellent \"The Defiant Ones\" (1958), gunfighter Joe Burdette in the landmark western \"Rio Bravo\" (1959), Sgt. Kolwicz in \"Merrill's Marauders\" (1962) and Earl Sylvester in the gripping \"The Killers\" (1964). In the early 1970's Akins appeared in several supernatural TV films, playing \"no-nonsense\" sheriffs in both \"The Night Stalker\" and \"The Norliss Tapes.\" He was virtually unrecognizable underneath his simian make-up as war-mongering General Aldo in \"Battle for the Planet of the Apes\" (1973). Akins continued staring in films and television until the time of his death from cancer in 1994. Akins appeared in many classic western series, including \"The Big Valley,\" \"Gunsmoke,\" \"The Virginian\" and \"Rawhide.\" He also appeared in three episodes of THE RIFLEMAN, playing Floyd Doniger in \"The Safe Guard\" (episode 8), Tom Benton in \"Meeting at Midnight\" (episode 74) and Bletch Droshek in \"Strange Town\" (episode 81).\n\nChris Alcaide made ten appearances in THE RIFLEMAN, portraying different characters in each episode. He is best known for his roles in westerns, having appeared in over 400 television western programs. Alcaide, a veteran character actor of great range and talent appeared in a wide variety of projects, including \"The Glass Menagerie,\" \"The Wild One\" with Marlon Brando, \"Assassination\" with Charles Bronson and \"Kid Galahad\" with Elvis Presley. Other movie credits include \"The Miami Story,\" \"Gunslinger,\" \"Miami Expose,\" \"The 49th Man,\" \"Massacre Canyon\" and \"Rock All Night.\"\n\nNorman Alden is an American character actor. He has appeared in more than 200 television shows and movies in a career spanning 50 years. Following his service in World War II, Alden attended Texas Christian University (TCU), where he began developing his skills as an actor. He made several appearances in the comedy series \"Hennesey\" (1959–1962), which starred Jackie Cooper, Abby Dalton and Henry Kulky. In addition to being a guest star, Alden also had a recurring role in the comedic western \"Rango\" (1967), playing the part of Captain Horton. Alden made one appearance in THE RIFLEMAN, portraying Duff in \"The Anvil Chorus\" (episode 154). Alden guest-starred in other westerns, including \"The Adventures of Rin Tin Tin\" (1954–1959), and he had a recurring role in \"The Life and Legend of Wyatt Earp\" (1955–1961), in which he portrayed Johnny Ringo.\n\nVirginia Aldridge appeared as the Waitress in THE RIFLEMAN pilot episode, \"The Sharpshooter.\" She also appeared in several other western series and films of the 1950s and 60s.\n\nRichard Alexander was an American actor who worked in film and television for nearly 50 years. Most of his roles were uncredited, but he appeared in numerous films, including \"All Quiet on the Western Front\" (1930), \"Flash Gordon\" (1936, 1938), \"Zorro Rides Again\" (1937) and \"Requiem for a Gunfighter\" (1965). He also made numerous television appearances, frequently in Westerns, including \"The Lone Ranger\" (1950–1953), \"The Gene Autry Show\" (1950), \"Dick Tracy (1950), \"Hopalong Cassidy\" (1952), \"Death Valley Days\" (1952) and his final role in \"Petrocelli\" (1971). Alexander appeared in four episodes of THE RIFLEMAN and was one of seven actors to play Nels/Nils Swenson/Swensen/Svenson, usually also listed in the credits as the Blacksmith. He appeared in \"The Deserter\" (episode 65), \"Smoke Screen\" (episode 68), \"Meeting at Midnight\" (episode 74) and \"The Martinet\" (episode 83).\n\nMel Allen, born Melvin F. Allen, was an American actor. He appeared in more than 20 movies and television shows during a 25-year career. His first film appearance was an uncredited role in \"The Return of Dracula\" (1958). Allen made one appearance in THE RIFLEMAN, playing the part of Sweeney in \"Miss Bertie\" (episode 90). In addition to THE RIFLEMAN, he also guest-starred in \"The Big Valley\" (1965–1969).\n\nHenry Allin was an American actor. He made one appearance in THE RIFLEMAN, portraying Tom Burroughs in \"The Assailants\" (episode 149). In addition to the RIFLEMAN, Allin also guest-starred in an unsold pilot, \"Call to Danger\" (1968). A second pilot with the same title was made in 1973, starring Peter Graves. The second pilot also went unsold, but it won Graves the leading role in \"Mission Impossible\" (1966–1973).\n\nJean Allison is an American actress who has appeared in nearly 100 movies and television shows in a career spanning more than 20 years. Appearing mostly in the western genre, Allison also made guest appearances in various popular television series, including \"Perry Mason\" (1957–1966) and \"The Dick Van Dyke Show\" (1961–1966). She made one appearance in THE RIFLEMAN, portraying a woman in \"Flowers By the Door\" (episode 92). In addition to THE RIFLEMAN, Allison also guest-starred in \"The Restless Gun\" (1957–1959), \"Bonanza\" (1959–1973) and \"The Life and Legend of Wyatt Earp\" (1955–1961).\n\nJohn Alvin, born John Alvin Hoffstadt, was an American film, stage and television actor. He appeared in nearly 150 movies and television shows during a 50-year career. Alvin demonstrated an interest in acting beginning in high school. He eventually made his way to California to study acting at the Pasadena Playhouse. Despite having formal training, many of Alvin's roles were uncredited. \"The Lone Ranger\" (1949–1957) proved to be a breakthrough for Alvin, who made five guest appearances in the western series. Following \"The Lone Ranger,\" Alvin went on to act in other popular series, including \"Leave It to Beaver\" (1957–1963) and \"Perry Mason\" (1957–1966). He made one appearance in THE RIFLEMAN, portraying Applegate in \"Skull\" (episode 124). In addition to THE RIFLEMAN, Alvin also guest-starred in \"The Texan\" (1958–1960) and \"Cheyenne\" (1955–1963).\n\nHenry Amargo, born Enrique Amargo, was an American television and film actor. He appeared in 11 movies and television shows during a one-decade career as an actor. Several of his roles were uncredited. He made one appearance in THE RIFLEMAN, portraying Juan in \"Baranca\" (episode 82). In addition to THE RIFLEMAN, Amargo also guest-starred in \"Wagon Train\" (1957–1965).\n\nEd Ames, born Edmund Dantes Urick, is an American singer and actor. He has 16 credits as an actor in a career spanning more than 30 years. Despite a modest upbringing, Ames was educated in classical music, as well as opera. He is known for performing in a group called The Ames Brothers, a popular 1950s singing group. As a solo artist, Ames had four top-twenty singles on the national charts. In his television career, Ames is perhaps best-remembered for his recurring role as Mingo in the western series \"Daniel Boone\" (1964–1970). Ames made his first television appearance in THE RIFLEMAN, portraying Lee Coyle in \"Quiet Night, Deadly Night\" (episode 146).\n\nBorn Amanda Foulger, Wallace Earl Sparks was an American film and television actress. She appeared in nearly 40 movies and television shows in a career spanning almost four decades. Her filmography lists credits under various stage names, including Eileen Harley and Amanda Ames. According to Laven's daughter Barbara, she took the stage name Eileen from a childhood friend and put it together with Harley, which was a family name. She borrowed the stage name Amanda from another friend who was a professional dancer and with whom she appeared in several musicals. According to her daughter, Laven thought Amanda sounded well with Ames. She was married to Arnold Laven, late co-founder of Levy-Gardner-Laven Productions and creator, producer and director of THE RIFLEMAN. They sometimes worked together. Harley guest-starred in many popular television shows, especially crime dramas, including \"Arrest and Trial\" (1963–1964), which starred Chuck Connors, Ben Gazarra and Roger Perry; \"Ironside\" (1967–1975), starring Raymond Burr; \"Police Woman\" (1974–1978), starring Angie Dickenson and Earl Holliman; \"The Rockford Files\" (1974–1980), starring James Garner; and \"Hardcastle and McCormick\" (1983–1986), starring Brian Keith; as well as the family comedy \"The Donna Reed Show\" (1958–1966) and the medical dramas \"Dr. Kildare\" (1961–1966), starring Richard Chamberlain, and \"Marcus Welby, M.D.\" (1969–1976), starring Robert Young and James Brolin. Wallace Earl appeared in several films, playing an uncredited part in the dramatic comedy \"Blue Astaire\" (1946), starring Fred Astaire and Bing Crosby; Sally in the sci-fi film \"The Monster That Challenged the World\" (1957), directed by Arnold Laven; an uncredited role in the biographical action film \"Geronimo\" (1962), starring Chuck Connors and directed by Arnold Laven; and Ellie in the musical comedy \"Clambake\" (1967), starring Elvis Presley. Wallace Earl made five appearances (under several different stage names) in THE RIFLEMAN, portraying Clair Wheatley Carney in \"The Retired Gun\" (episode 17), Myrtle in \"The Hangman\" (episode 76) and \"The Silent Knife\" (episode 89), Mrs. Lovering in \"Short Rope for a Tall Man\" (episode 103), and Ruth in \"The Executioner\" (episode 142). She also guest-starred in several other westerns of the 1960s and 70s, including \"The Big Valley\" (1965–1969), starring Barbara Stanwyck, and \"Gunsmoke\" (1955–1975), starring James Arness. Wallace Earl Laven passed away February 27, 2012 after a long illness.\n\nRobert Anacher made one appearance in THE RIFLEMAN, playing the part of the infant, Fancy, in \"The Baby Sitter\" (episode 52).\n\nLuana Anders, born Luana Margo Anderson, was an American television and film actress. Over a 40-year acting career, Anders had more than 30 film and over 300 television credits. She got her start in low-budget B-movies, appearing in mostly forgettable pictures, but a few iconic ones in the genre, including Roger Corman's \"The Pit and the Pendulum\" (1961) and Francis Ford Coppola's \"Dementia 13\" (1962). A contemporary of Jack Nicholson, she co-starred with him in several pictures including \"Easy Rider\" (1969), \"The Last Detail\" (1973), \"Missouri Breaks\" (1976) and \"Goin' South\" (1978). Nicholson later acknowledged her in his Academy Award acceptance speech for Best Actor in \"As Good as it Gets\" (1997). Anders also appeared in the \"Chinatown\" sequel, \"The Two Jakes\" (1990). Anders made one appearance in THE RIFLEMAN, portraying Lisabeth Bishop in \"Shivaree\" (episode 19). In addition to THE RIFLEMAN, she also made appearances in \"The Restless Gun\" (1957–1959), \"Lawman\" (1958–1962) and \"Bonanza\" (1959–1973).\n\nJohn Anderson was an American actor who had a prolific career in both film and television spanning four decades. He appeared in over 500 roles in film and television, frequently appearing in recurring roles, including in \"The Twilight Zone\" (1959–1964). Anderson is perhaps best remembered for his television role as Harry Jackson, MacGyver's grandfather, in the popular Richard Dean Anderson series. Anderson portrayed President Abraham Lincoln twice, in \"The Lincoln Conspiracy\" (1977) and in the series \"The Voyagers!\" (1980), and he portrayed President Franklin Delano Roosevelt in the 1979 mini-series \"Backstairs at the White House.\" Among his many film roles, he appeared in Alfred Hitchcock's 1960 classic horror film, \"Psycho,\" Sam Peckinpah's 1962 iconic western, \"Ride the High Country,\" John Sturges's 1965 western spoof, \"The Hallelujah Trail,\" and John Sayles' 1988 chronicles of baseball's 1919 World Series scandal, \"Eight Men Out.\" Anderson also co-starred with Chuck Connors in the 1962 film, \"Geronimo.\" Anderson made eleven guest appearances in all five seasons of THE RIFLEMAN, playing a different character in each episode. He portrayed Owny in \"The Retired Gun\" (episode 17), Chet Packard in \"Shivaree\" (episode 19), Eli Flack in \"The Hawk\" (episode 29), Sully Hobbs in \"The Patsy\" (episode 41) , Cass Callicott in \"Day of the Hunter\" (episode 55), Jess in \"Mail Order Groom\" (episode 56), John Beaumont in \"Shotgun Man\" (episode 69), Hank Clay in \"Face of Yesterday\" (episode 95), Will Temple in \"The Journey Back\" (episode 115), John Gangling in \"Incident At Line Shack Six\" (episode 156), and Sam Gibbs in \"Old Man Running\" (episode 166).\n\nKeith Andes, born John Charles Andes, was an American television, film, radio and stage actor. He garnered nearly 70 credits as an actor during his nearly 40-year career. He began developing his acting skills in childhood, making his first radio appearance at the age of 12. He was an active performer throughout his high school years and later. Andes was well-educated, first attending Oxford University, then graduating with a bachelor's degree in education from Temple University, Philadelphia, in 1943. He also studied voice at the Philadelphia Conservatory of Music. During his service in the Air Force, in World War II, Andes embarked on a career on Broadway. He was the leading man in the crime drama, \"This Man Dawson\" (1959). He also had a recurring role as Keith Granville in the comedy series \"Glynis\" (1963), starring the famous stage performer Glynis Johns. Andes made one appearance in THE RIFLEMAN, portraying Reynolds in \"The Debt\" (episode 133). He also guest-starred in \"Daniel Boone\" (1964–1970) and \"Gunsmoke\" (1955–1975).\n\nMorris Ankrum, born Morris Nussbaum, was a character actor in American radio, television and film. He appeared in more than 250 roles during a career spanning 30 years. Although he began his career in academia, Ankrum eventually made his way into acting via the drama department at the University of California, Berkeley. He taught drama and acting at the Pasadena Playhouse prior to signing with Paramount Pictures in the 1930s. He is best-remembered for his work in the western and science-fiction genres. He is also recognized for his recurring role as the Judge in the television crime drama \"Perry Mason\" (1957–1966). Ankrum made two appearances in THE RIFLEMAN, portraying Aaron Pelser in \"Shivaree\" (episode 19) and Jacob Black in \"The Actress\" (episode 94). In addition to THE RIFLEMAN, Ankrum appeared in the TV westerns, \"The Adventures of Rin Tin Tin\" (1954–1959), \"Lawman\" (1958–1962) and \"Gunsmoke\" (1955–1975).\n\nMichael Ansara was an American stage, television, film and voice actor, as well as a director and producer. Born in Syria, Ansara immigrated to the United States at the age of two. Originally, he dreamed of becoming a physician, but kindled a passion for performing after taking some acting classes to overcome his natural shyness. He has appeared in nearly 200 films and television shows in a career spanning more than five decades. He appeared in several Bible-era epics, including portraying Judas in \"The Robe\" (1953), starring Victor Mature, Prince Belshazzar in \"Slaves of Babylon\" (1953), the taskmaster in \"The Ten Commandments\" (1956), starring Charleton Heston and Yul Brynner, Herod's commander in \"The Greatest Story Ever Told\" (1965), starring an ensemble cast that included Max von Sydow and Charleton Heston. In 1999, Ansara had the starring role in the dramatic film \"The Long Road Home.\" Despite his Middle Eastern heritage, Ansara was often cast as a Native American in his early career. He is best known for his role as Cochise in the television series \"Broken Arrow\" (1956–1958), which made him a household name. A later generation would recognize him for his portrayal of Commander Kang in three installments of the sci-fi franchise \"Star Trek.\" While working on \"Broken Arrow\" Ansara met Barbara Eden, whom he later married. He appeared in two episodes of Eden's hit comedy show \"I Dream of Jeannie\" (1965–1970), co-starring Larry Hagman. Ansara appeared in many of the most popular TV shows of the 1950s through 80s, guest-starring in every genre from crime dramas, whodunits, sci-fi, comedy and action adventures to westerns. He appeared in THE RIFLEMAN twice, on both occasions playing Deputy U.S. Marshal Sam Buckhart in \"The Indian\" (episode 21) and \"The Raid\" (episode 37). The storyline had Buckhart coming to North Fork in search of Indians suspected of murdering a Texas Ranger and his family. THE RIFLEMAN episodes were spun-off for a new NBC series, \"Law of the Plainsman\" (1959–1960) starring Ansara as Buckhart and co-starring Gina Gillespie and Robert Harland. The series is regarded by some as one of the best television westerns ever made. Although better know for his role in \"Broken Arrow,\" Ansara also thought that \"Plainsman\" was a better show. In his later career, Ansara frequently did voice acting in animated TV shows, movies and video games, including three iterations of the comic superhero in \"Batman\" (1992–1995), \"The New Adventures of Batman\" (1997–1999) and \"Batman Beyond\" (199–2001), playing the villain Mr. Freeze, a character Ansara would reprise in the film adaptation of \"Batman Beyond\" (1999) and in several \"Batman\" video games. He also provided the voice for the recurring character General Warhawk in the animated series \"Rambo\" (1986). Mr. Ansara passed away at his home in Calabasas, California on July 31, 2013 at age 91.\n\nR. G. Armstrong was an American playwright and film and television actor. Trained at the Actors Studio in New York, his filmography lists more than 180 credits spanning 50 years. Armstrong made his first film appearance in \"Garden of Eden\" (1954). While working on the television show \"The Westerner,\" he met writer/director Sam Peckinpah, who cast him in several of his films, including \"Ride the High Country\" (1962), \"Major Dundee\" (1965), \"The Ballad of Cable Hogue\" (1970) and \"Pat Garrett and Billy the Kid\" (1973). Armstrong was also cast in three Warren Beatty films, including \"Heaven Can Wait\" (1978), \"Reds\" (1981) and \"Dick Tracy\" (1990), in which he played the villain Pruneface. Other film credits include the role of Cap'n Dan in \"The Great White Hope\" (1970) and General Phillips \"Predator\" (1987). Armstrong was best-known as a character actor in television Westerns. He appeared in two episodes of THE RIFLEMAN, playing Sheriff Tomlinson in the pilot episode \"The Sharpshooter,\" which was written by Sam Peckinpah, and episode 4, \"The Marshal,\" which was both written and directed by Peckinpah. \"The Marshal\" introduced the title character played by Paul Fix after Armstrong's sheriff was killed by marauding outlaws. Other TV series in which he guest-starred include \"The Texan\" (1958–1959), \"Lawman\" (1959), \"Maverick\" (1959–1960), \"Bonanza\" (1959–1966), \"Cheyenne\" (1960–1961), \"Perry Mason\" (1958–1962), \"Laramie\" (1960–1962), \"Alfred Hitchcock Presents\" (1960–1962), \"Gunsmoke\" (1961–1967), \"Wagon Train\" (1962), \"The Virginian\" (1963–1967), \"The F.B.I.\" (1965–1967), \"T.H.E. Cat\" (1966), \"The Dukes of Hazzard\" (1979–1983), \"Dynasty\" (1982), \"Friday the 13th\" (1987–1989) and \"L. A. Law\" (1992–1993). R. G. Armstrong passed away on July 27, 2012 at age 95.\n\nCharles Arnt appeared in THE RIFLEMAN pilot episode, \"The Sharpshooter,\" as Wes Tippert, uncle of the young sharpshooter played by Dennis Hopper. Arnt was a veteran character actor whose career spanned 30 years.\n\nLarry Asmus was an American child actor. He guest-starred in several popular television shows, including \"Leave It to Beaver\" (1957–1963) and \"My Three Sons\" (1960–1972). He made one appearance in THE RIFLEMAN, portraying one of the boys at the picnic in \"Three-Legged Terror\" (episode 30).\n\nPhyllis Avery was an American television and film actress. She performed in more than 50 movies and television shows in career spanning nearly 50 years. She made her film debut in \"Queen for a Day\" (1951), playing the role of Marjorie. She had her first recurring role as the lead actress in \"The Ray Milland Show: Meet Mr. McNulty\" (1953–1955). Avery made one appearance in THE RIFLEMAN, portraying Leona Bartell in \"The Baby Sitter\" (episode 52). In addition to THE RIFLEMAN, she appeared in \"Laramie\" (1959–1963) and \"The Virginian\" (1962–1971).\n\nB\n\nAlice Backes was an American actress who appeared in 80 movies and television shows in a career spanning nearly 50 years. Her film appearances included roles in \"Up in Central Park\" (1948), the Susan Hayward classic, \"I Want to Live!\" (1958), \"It Started with a Kiss\" (1959), the Doris Day comedy, \"That Touch of Mink\" (1962), \"Half a House\" (1975) and the Disney films, \"Snowball Express\" (1976) and \"The Cat from Outer Space\" (1978). She also portrayed Hedda Hopper in the Jill Clayburgh-James Brolin biopic, \"Gable and Lombard\" (1976). Backes guest-starred in various popular TV series of the 1959s, 70s and 80s, including \"Hennesey\" (1959–1962), \"Leave It to Beaver\" (1957–1963), \"Hazel\" (1961–1962), \"The Alfred Hitchcock Hour\" (1963–1965), \"Bewitched\" (1964–1966), \"Mayberry R.F.D.\" (1970–1971) and \"Columbo\" (1974–1997), among many other shows. She also had a recurring role playing Vickie in the comedy series, \"Bachelor Father\" (1957–1962). Backes made one appearance in THE RIFLEMAN, portraying Isabel Dent in \"Mail Order Groom\" (episode 56). She also guest-starred in numerous iconic westerns, including \"Gunsmoke\" (1955–1975) and \"The Virginian\" (1962–1971) and \"The Big Valley\" (1968).\n\nParley Baer was an American radio, film and television actor. He performed in more than 250 movies and television shows in a career spanning nearly six decades. Baer began his career as a performer with the circus and developed an affinity for animals, both of which became lifelong interests. During fallow periods in his acting career, he returned to performing with circus and animal acts, serving as a ringmaster for Circus Vargas and Barnum & Bailey, a board member of the community L.A. Circus, a docent at the Los Angeles Zoo, publicity writer for Al. G. Barnes Circus, and performing in an act with seven tigers at Jungleland in Thousand Oaks, California. In his early career, Baer also worked in the radio industry, later founding the Pioneer Pacific Broadcasters with Ralph Edwards, who went on to have a long television career. He played the role of Chester in the radio version of \"Gunsmoke\" (1952–1961), a role played by Dennis Weaver in the long-running classic TV western series. Baer had recurring roles in several series, including Darby in \"The Adventures of Ozzie & Harriet\" (1955–1965), Mayor Arthur J. Henson in \"The Addams Family(1964–1966), \"The Dukes of Hazzard\" (1981–1984) and Buck in \"Newhart\" (1984–1987). He also guest-starred in numerous other popular TV series, often making multiple appearances playing different characters in a variety of genres, including the crime drama, \"Perry Mason\" (1957–1966) and numerous comedy series, including \"Hogan's Heroes\" (1965–1969), \"Petticoat Junction\" (1965–1970) and \"Bewitched\" (1966–1972). Baer made two appearances in THE RIFLEMAN, portraying Walter Mathers in \"A Matter of Faith\" (episode 34) and Neff Parker in \"A Friend in Need\" (episode 123). In addition to THE RIFLEMAN, Baer guest-starred in many other western series, including \"Have Gun – Will Travel\" (1957–1963), \"Bonanza\" (1959–1973) and \"The Virginian\" (1962–1971).\n\nRaymond Bailey was an American stage, television and film actor. He performed in nearly 150 different movies, plays and television shows in a career spanning more than three decades. Bailey spent many years trying to get his career off the ground, intermittently active in military services, including joining the Merchant Marine during World War II. He eventually succeeded at breaking into the industry, performing in well-known series such as \"Alfred Hitchcock Presents\" (1955–1965) and \"The Twilight Zone\" (1959–1964). He is best known for his recurring role as Mr. Drysdale in the popular sitcom \"The Beverly Hillbillies\" (1962–1971). Bailey made one appearance in THE RIFLEMAN, playing Colonel Jess Whiteside in \"The Photographer\" (episode 18). In addition to the RIFLEMAN, Bailey also appeared in the Western series \"Gunsmoke\" (1955–1965).\n\nRoy Barcroft was a prolific American character actor. He appeared in more than 350 movies and television shows in a career spanning 40 years. Barcroft accidentally fell into acting after being discovered while acting as a hobby to improve his speaking skills for his job as a salesman. Although most of his early roles were uncredited, Barcroft went on to become one of the most recognizable faces in the western movie genre, often typecast as the villain. He had a recurring role as Colonel Logan in the western series \"The Adventures of Spin and Marty\" (1955). He also made several guest appearances in \"Annie Oakley\" (1954–1956). He had a recurring role as Roy in \"Gunsmoke\" (1955–1975), although he occasionally also played different roles. Barcroft made one appearance in THE RIFLEMAN, portraying Mr. Stevens in \"Outlaw's Shoes\" (episode 141). In addition to THE RIFLEMAN, he guest-starred in numerous other popular western series, including \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Lawman\" (1958–1962), \"Rawhide\" (1961–1965), \"Bonanza\" (1962–1966), and \"Laramie\" (1959–1963).\n\nKatharine Bard was an American actress. She performed in 50 different movies and television shows in a career lasting nearly two decades. She made appearances in various popular television series, including \"Alfred Hitchcock Presents\" (1955–1962) and \"Perry Mason\" (1957–1966). Bard appeared in one episode of THE RIFLEMAN, in which she played Beth Landis in \"The Trade\" (episode 24). In addition to THE RIFLEMAN, Bard also made an appearance in the Western series \"Gunsmoke\" (1955–1975).\n\nBaynes Barron was an American actor. He appeared in more than 100 television shows and movies over a 30–year career. Many of his roles were uncredited. He appeared in many popular western series, including \"The Adventures of Kit Carson\" (1951–1952), \"Death Valley Days\" (1954–1955), \"Annie Oakley\" (1956–1957), \"Lawman\" (1959–1962), \"Bonanza\" (1959–1973) and \"Gunsmoke\" (1955–1975). Barron also performed in several popular series of the 1960s, including \"Alfred Hitchcock Presents\" (1955–1962), \"The Loretta Young Show\" (1953–1961) and \"The Untouchables\" (1959–1963). He made two appearances in THE RIFLEMAN, portraying Gus 'Gustav' Kelso in \"The Spiked Rifle\" (episode 49) and Trooper Kirk in \"The Deserter\" (episode 65). He also appeared in an episode of \"Branded\" (1965–1966), which starred Chuck Connors in his second hit TV western series.\n\nFern Barry was an American film and television actress. She appeared in nearly 50 television shows and movies in a career spanning more than 40 years. Many of her acting roles were uncredited. Working mostly during the 1930s, 50s and 60s, Barry appeared in several popular TV series, including and \"The Donna Reed Show\" (1960) and the popular crime drama series \"Perry Mason\" (1957–1966). She made two appearances in The RIFLEMAN, portraying a townswoman in \"The Woman\" (episode 32) and Callie Sawyer in \"The Horsetraders\" (episode 60). Barry also guest–starred in \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Wagon Train\" (1957–1965) and \"Rawhide\" (1960).\n\nJames Barton was an American vaudevillian, as well as a stage, television and film character actor. He appeared in more than 30 television shows and movies in a career spanning 40 years. Born to a theatrical family, Barton was a song-and-dance man who performed in musical revues and dramatic plays on Broadway from the 1920s through the 1950s. His stage credits include \"Sweet and Low\" (1930–1931), \"Tobacco Road\" (1933–1941), \"The Iceman Cometh\" (1946–1947) and \"Paint Your Wagon\" (1951–1952). His movie career began in the silent film era, and his more memorable film appearances include \"The Time of Your Life\" (1948), \"Here Comes the Groom\" (1951) and \"The Misfits\" (1961). He also made cameo appearances throughout his career, including two episodes of \"The Ed Sullivan Show\" (1950, 1951). Barton guest-starred in one episode of THE RIFLEMAN, portraying Matt 'Pop' Simmons in \"Legacy\" (episode 51).\n\nJoe Bassett, born Joseph George Bassett, was an American film and television actor who appeared in 48 television shows and movies in a 13-year career. Many of his acting roles were in westerns, including \"Tales of the Texas Rangers\" (1955–1959), \"Have Gun – Will Travel\" (1957–1963), \"Gunsmoke\" (1955–1975), \"Wagon Train\" (1957–1965) and \"The Life and Legend of Wyatt Earp\" (1955–1961). Bassett made two appearances in THE RIFLEMAN, portraying Nat Gilkey in \"Duel of Honor\" (episode 7) and Sammy Morody in \"The Grasshopper\" (episode 63).\n\nArthur Batanides, born Joseph George Batanides, was an American actor who worked primarily in television. He appeared in 130 television shows and movies in a career spanning nearly 40 years. He co-starred in a crime drama, \"Johnny Midnight\" (1960) with Edmund O'Brien. He also appeared in numerous other popular series of the 1960s, including \"Twilight Zone\" (1959–1964), \"Perry Mason\" (1957–1966) and \"The Dick Van Dyke Show\" (1961–1966). Batanides remained a familiar face through the 1970s, making several appearances in \"Mission: Impossible\" (1966–1973), \"The Odd Couple\" (1970–1975) and \"Happy Days\" (1974–1984), among many other shows. Despite a short filmography, he is remembered for his portrayal of Mr. Kirkland in several of the \"Police Academy\" films. He also appeared in the Cecil B. DeMille classic, \"The Ten Commandments\" (1956) and the John Wayne film, \"Brannigan\" (1975). Batanides made one appearance in THE RIFLEMAN, portraying Littleboy Sherman in \"Old Man Running\" (episode 166). He also guest-starred in several other westerns, including \"Yancy Derringer\" (1958–1959), \"Bonanza\" (1959–1973), \"Gunsmoke\" (1955–1975) and \"The Wild, Wild West\" (1965–1968).\n\nAlan Baxter was an American television and film actor. He appeared in more than 120 television shows and movies in a career spanning 35 years. He was a guest star in several episodes of popular series from the 1960s, including \"77 Sunset Strip\" (1958–1964), \"The Untouchables\" (1959–1963) and \"Perry Mason\" (1957–1966). Baxter made one appearance in THE RIFLEMAN, portraying Sid Fallon in \"The Boarding House\" (episode 22). In addition to THE RIFLEMAN, he guest-starred in \"Wagon Train\" (1957–1965), \"The Life and Legend of Wyatt Earp\" (1955–1961) and \"Have Gun – Will Travel\" (1957–1963).\n\nHal Baylor was an American television and film actor, as well as a heavyweight boxing champion. He appeared in 500 television shows and 70 movies in a career spanning 40 years. Taking advantage of his athletic abilities, Baylor attended Washington State University on a scholarship. Most of his early film roles were either uncredited or attributed to Hal Fieberling, including \"The Set-Up\" (1949), in which he appeared opposite Robert Ryan. \"The Set-Up\" is still regarded as one of the best boxing films in movie history. Tall and heavy-set, Baylor was dubbed \"the Last of the Bigtime Bad Guys\" and was frequently cast in tough guy roles. He played in a range of genres, from crime dramas, such as \"Perry Mason\" (1957–1966), to superhero, such as \"Batman\" (1967), in which he played the character Mercury, and the science fiction cult classic movie, \"A Boy and His Dog\" (1975). He also appeared in several war movies, including \"The Sands of Iwo Jima\" (1949), starring John Wayne. Baylor was perhaps most familiar in TV westerns, appearing in many of the classic shows of the 1950s and 60s, including \"The Lone Ranger\" (1949–1957), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Gunsmoke\" (1955–1975), \"Cheyenne\" (1956–1960), \"Rawhide\" (1959–1965), \"Bonanza\" (1959–1973), \"The Virginian\" (1963–1967) and \"Death Valley Days\" (1962–1968). Baylor made one appearance in THE RIFLEMAN, portraying Charlie Crown in \"Short Rope for a Tall Man\" (episode 103).\n\nStephen Bekassy, born Istvan Bekassy, was a Hungarian television and film actor. He appeared in nearly 70 television shows and movies in a career spanning more than 30 years. He made guest appearances in several popular series, including \"The Loretta Young Show\" (1953–1961), \"Bat Masterson\" (1959–1960) and \"Perry Mason\" (1957–1966). Bekassy made one appearance in THE RIFLEMAN, portraying Count Brissara in \"The Princess\" (episode 125).\n\nWilliam \"Billy\" Benedict was an American television and film actor. He appeared in 290 television shows and movies in a career spanning more than 50 years. Benedict demonstrated an interest in acting early in life, participating in school productions and eventually making his way to Hollywood. Many of his early film roles were uncredited as he began his career playing a variety of juvenile bit parts. He made guest appearances in many popular series of the 1960s, including \"Perry Mason\" (1957–1966) and \"Twilight Zone\" (1959–1964). Benedict made one appearance in THE RIFLEMAN, portraying Dave Prentice in \"Smokescreen\" (episode 68). Other westerns in which he guest–starred include \"Tales of Wells Fargo\" (1957–1962) and \"Gunsmoke\" (1955–1975).\n\nJoe E. Benson became an actor as a side career. He appeared in a single move, \"Redneck Zombies\" (1989) and guest–starred in one episode of \"Perry Mason\" (1957–1966), portraying the deputy in \"The Case of the Crippled Cougar\" (1962). Benson had known Chuck Connors personally, and according to the producers, they hired him on the star's recommendation. Benson appeared in 34 episodes of THE RIFLEMAN, mostly playing uncredited parts. In a small number of episodes, Benson played credited roles, including Mills in \"The Actress\" (episode 94), Merar in \"The Score is Even\" (episode 105) and a prison guard in \"Requiem at Mission Springs\" (episode 164).\n\nJames Best, born Jules Guy, is an American actor, director, producer, screenwriter, acting coach and musician. He has appeared in more than 180 television shows and movies in a career spanning 60 years. Following his service in the Army, Best performed in small plays and musicals until he was signed to a contract with Universal Pictures. He guest-starred in numerous westerns, including \"Wagon Train\" (1957–1965), \"The Guns of Will Sonnett\" (1967–1969), \"Bonanza\" (1959–1973) and \"Gunsmoke\" (1955–1975). He also guest-starred in many other popular series of the 1960s, including \"The Andy Griffith Show\" (1960–1968), \"Alfred Hitchcock Presents\" (1955–1962) and \"Twilight Zone\" (1959–1964). He is probably best-known for his recurring role as Sheriff Rosco Coltrane in \"The Dukes of Hazzard\" (1979–1985). Best made one appearance in THE RIFLEMAN, portraying Bob Barrett in \"The Day a Town Slept\" (episode 139).\n\nLyle Bettger was an American stage, film and television actor. He attended Dickinson College and graduated from the Academy of Dramatic Arts in 1937. He went on to appear in more than 50 different films, plays and television shows in a career spanning three decades. Typecast as the villain, he is best known for playing the role of the wrathful elephant handler Klaus in the film, \"The Greatest Show on Earth\" (1952). Bettger made two appearances in THE RIFLEMAN, playing Jay Jefferson in \"The Wrong Man\" (episode 27) and Holt in \"Skull\" (episode 124). Handsome, with blond-hair and steely-eyes, Bettger played the villain in many westerns, including \"Denver and Rio Grande\" (1952), \"The Great Sioux Uprising\" (1953), \"Drums Across the River\" (1954) and \"Gunfight at the OK Corral\" (1957).\n\nHelen Beverly was an American actress, working primarily in film. Appearing in just 10 movies, several were uncredited roles, including the classic Biblical drama, \"The Robe\" (1953). She appeared in \"Green Fields\" (1937), her earliest film, and she also appeared in one of the movies in the Charlie Chan franchise, \"Black Magic\" (1944). Beverly made one appearance in The RIFLEMAN, portraying May Sweeney in \"Seven\" (episode 79).\n\nRobert Bice made five guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played Joe Hallager in \"The Mind Reader\" (episode 40), Ben Smith in \"The Coward\" (episode 53), The Warden of New Mexico Territory in \"Seven\" (episode 79), and Len Richards in \"Deadly Image\" (episode 138).\n\nEdward Binns was an American television and film actor. He appeared in more than 160 TV shows and movies over 40 years. He made his acting debut on Broadway and appeared in half dozen plays during his long career, including \"Detective Story\" (1949–1950) and \"Ghosts\" (1982). His film credits include playing Captain Junket in \"North by Northwest\" (1959), Juror #6 in \"Twelve Angry Men\" (1957), Sen. Burkette in \"Judgment at Nuremberg\" (1961) and Maj. Gen. Walter Bedell Smith in \"Patton\" (1970). He guest–starred in many popular series of the late 1950s and early 1960s, including \"Perry Mason\" (1957–1966), \"The Untouchables\" (1959–1963) and \"Twilight Zone\" (1959–1964) and several westerns, including \"Gunsmoke\" (1955–1975), \"Have Gun – Will Travel\" (1957–1963) and \"Bonanza\" (1959–1973). Binns also played the title character in the crime drama series \"Brenner\" (1959). He made one appearance in THE RIFLEMAN, portraying Kealy Thompson in \"The Apprentice Sheriff\" (episode 11).\n\nWilliam Bishop was an American stage, film and television actor who performed in more than 50 different plays, movies and television shows. Raised in New York and New Jersey, his uncle arranged for him to have a summer job working at the theater of Suffern County, New York, where he worked with fellow actors Broderick Crawford, George Tobias, Jose Ferrer and Kent Smith. Following that experience, he decided to leave college and continue acting. Bishop toured with \"Tobacco Road\" and worked briefly at the Mercury Theatre in New York before venturing to Hollywood, where he was signed to a contract with MGM and later Columbia Pictures. Most of his early work went uncredited. Bishop made one appearance in THE RIFLEMAN, playing Dave Stafford in \"Outlaw's Inheritance\" (episode 38). He also appeared in lesser known Western films.\n\nWhit Bissell, born Whitner Nutting Bissell, was a prolific American television and film actor who made his acting debut on Broadway. He appeared in nearly 300 television shows and movies in a career spanning more than 40 years. Although he appeared in several cult horror films of the 1950s, including the classic sci-fi thriller, \"Invasion of the Body Snatchers\" (1956), he is probably best-known for portraying the mad scientist who turned Michael Landon into a beast in \"I Was a Teenage Werewolf\" (1957). Bissell appeared in numerous TV shows of every genre popular in the 1950s through the early 80s, including \"Peyton Place\" (1965), \"Perry Mason\" (1957–1966), \"Marcus Welby, M.D.\" (1970–1973), \"The Incredible Hulk\" (1979–1980), and many western series, including \"The Lone Ranger\" (1947–1959), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Have Gun – Will Travel\" (1957–1963), \"Wagon Train\" (1958–1964), \"Bonanza\" (1959–1973) and \"The Virginian\" (1963–1964). Bissell also had recurring roles as Bert Loomis in the comedy series, \"Bachelor Father\" (1957–1962), and Lt. Gen. Heywood Kirk in the sci-fi series, \"The Time Tunnel\" (1966–1967). Bissell made four appearances in THE RIFLEMAN, portraying Sam Barrows in \"The Patsy\" (episode 41), Gabe Fenway in \"The Flourflusher\" (episode 72), Volney Adams in \"The Hangman\" (episode 76) and Henry Waller in \"The Long Gun from Tucson\" (episode 121). In 1994, Bissell received a lifetime achievement award from the Academy of Science Fiction, Fantasy & Horror Films. He also served on the board of directors of the Screen Actors Guild and represented the actors branch of the Academy of Motion Picture Arts and Sciences board of governors.\n\nSidney Blackmer was an American theater, film and television actor. His career spanned 57 years, beginning in the silent film era. He appeared in an uncredited role in \"Perils of Pauline\" (1914) and went on to spend the 1920s playing on Broadway, eventually debuting in talkies in 1929, in \"The Love Racket.\" In his prolific career, Blackmer appeared in scores of motion pictures—appearing in 12 movies in 1937 alone. His film credits include two Edward G. Robinson classics, \"Little Caesar\" (1931) and \"The Last Gangster\" (1937), \"Duel in the Sun\" (1946), \"High Society\" (1956), \"Tammy and the Bachelor\" (1957) and \"How to Murder Your Wife\"(1965). He co-starred with THE RIFLEMAN's Paul Fix in \"The High and The Mighty\" (1954), playing the gun-toting idiot. His best-remembered film role was playing Roman Castevet in Roman Polanski's \"Rosemary's Baby\" (1968). Beginnning in the 1930's, Blackmer portrayed President Theodore Roosevelt, a historical figure he played seven times in films and teleplays, including \"This Is My Affair\" (1937) , \"The Monroe Doctrine\" (1939), \"Teddy the Rough Rider\" (1940) and \"My Girl Tisa\" (1948). In 1950, Blackmer won a Tony Award as Best Actor in a dramatic role for the Broadway production of \"Come Back, Little Sheba.\" Blackmer appeared in three episodes of THE RIFLEMAN, playing the recurring character of Judge Hanavan, who first appeared in the pilot episode, \"The Sharpshooter.\" He reprised the role of Judge Hanavan in \"The Safe Guard\" (episode 8) and \"The Photographer\" (episode 18). Blackmer's numerous television credits include guest-starring roles in \"The Philco-Goodyear Television Playhouse\" (1949–1951), \"Robert Montgomery Presents\" (1952–1956), \"Hallmark Hall of Fame\" (1952–1956), \"Alfred Hitchcock Presents\" (1955–1962), \"Bonanza\" (1961–1968), \"Dr. Kildare\" (1962–1966), \"Ben Casey\" (1966), \"The Name of the Game\" (1968–1969). Blackmer's last appearance on the Broadway stage was the 1963–64 production of \"A Case of Libel,\" and his last acting role was in \"Do You Take This Stranger? (1971). Blackmer passed away two years later.\n\nPatricia Blair was an American television actress whose career was active primarily in the 1950s and 1960s. The Texas-born beauty began her career as a teenage model who went on to apprentice in summer stock before being discovered by Warner Bros. She began acting in films under the names Patricia Blake and Pat Blake. She appeared in a few films, including \"Jump Into Hell\" (1955), \"Crime Against Joe\" (1956) and \"The Black Sleep\" (1956), which reunited screen icons of the horror film genre Bela Lugosi, Lon Chaney Jr., Basil Rathbone and John Carradine. She also appeared in the suspense thriller \"City of Fear\" (1959), starring Vince Edwards. She portrayed the Fashion Narrator in the Robert Redford romantic western \"The Electric Horseman\" (1979), co-starring Jane Fonda. In 1962, Blair replaced actress Joan Taylor in a semi-regular role as Lou Mallory, Chuck Connor's love interest in the last season of THE RIFLEMAN. Blair played the attractive red-haired, fiery Irish businesswoman, whose character was savvy Landowner and Owner of the General Store and the Madera House Hotel. Blair's character of Lou Mallory appeared in 17 episodes of THE RIFLEMAN; she debuted in the title role of episode 145. Blair also made guest television appearances on \"The Bob Cummings Show\" (1955–1959), \"The Virginian\" (1962–1971), \"Perry Mason\" (1957–1966), \"Bonanza\" (1959–1973), and she co-starred in \"Daniel Boone\" (1964–1970), playing wife Rebecca Boone opposite Fess Parker. She also had a recurring role as Goldy in the western adventure series \"Yancy Derringer\" (1958–1959).\n\nDan Blocker was an American actor born and raised in Texas. He attended Texas Military Institute, played football at Hardin-Simmons University in 1946 and later graduated from Sul Ross State Teacher's College in Alpine, Texas, with a master's degree in drama. Blocker was drafted into the Army and served in the Korean War as a First Sergeant. Later, in Sonora, Texas; Carlsbad, New Mexico; and California, he taught high school English and drama. A tall big bear of a man with a tender heart who played roles true to his character, Blocker appeared in several television shows in the late 1950's before landing the role for which he is best-remembered—Eric \"Hoss\" Cartwright in the long-running NBC western television series \"Bonanza\" (1959–1973). He appeared in one episode of THE RIFLEMAN, playing Pete Snipe in \"The Sister\" (episode 9). In 1968, Blocker appeared with Frank Sinatra in \"Lady in Cement,\" film sequel to \"Tony Rome.\" Director Robert Altman befriended Blocker while directing episodes of \"Bonanza\" and years later, he cast Blocker as Roger Wade in \"The Long Goodbye.\" Sadly, Blocker died before filming commenced and Sterling Hayden stepped into the role. Released in 1973, the film was dedicated to Dan Blocker.\n\nLane Bradford was an American television and film actor. He appeared in more than 250 movies and television shows in a career spanning nearly 35 years. A familiar face in western B movies and television series, many of his film roles in the 1940s and 50s were uncredited. Bradford made his television debut in the crime drama series \"Craig Kennedy, Criminologist\" (1952). He also appeared in \"The Untouchables\" (1959–1963) and \"Perry Mason\" (1957–1966). Bradford guest-starred in most of the major western series of the 1950s and 60s, appearing mulitple times in many of them, including \"The Lone Ranger\" (1949–1957), \"The Adventures of Rin Tin Tin\" (1954–1959), \"Have Gun – Will Travel\" (1957–1963), \"Wagon Train\" (1957–1965), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Cheyenne\" (1955–1963) \"Bonanza\" (1959–1973), and \"Gunsmoke\" (1955–1975). He made one appearance in THE RIFLEMAN, portraying Martin in \"Woman from Hog Ridge\" (episode 78).\n\nJim Brenaman made one appearance in THE RIFLEMAN, portraying a youngster, Dollar Ten, in \"A Case of Identity\" (episode 57). His character was central to the story about a man who comes to North Fork searching for his long-lost son.\n\nGeorge Brenlin, born George Henry Brendlinger, was an American actor who primarily worked in television. He appeared in more than 60 television shows over his 30–year career. Although he appeared mostly in westerns, Brenlin worked in other genres, including the crime drama \"Perry Mason\" (1957–1966), the war–themed \"Combat!\" (1962–1967) and the police drama \"Adam-12\" (1969&@8211;1970). He made one appearance in THE RIFLEMAN, portraying The Kid in \"The Blowout\" (episode 43). He also guest-starred in other iconic westerns of the 50s, 60s and 70s, including \"Gunsmoke\" (1955–1975), \"Tales of Wells Fargo\" (1957–1962), \"Bonanza\" (1959–1973) and \"The Virginian\" (1962–1971).\n\nPatricia Breslin is an American actress who has spent most of her career working in television. She has appeared in more than 50 movies and television shows over her career of 20 years. After graduating from a convent in New Rochelle, New York, Breslin enrolled in the College of New Rochelle where she became trained in the theater department. She made her television debut in the NBC TV production of \"Romeo & Juliet\" (1952), portraying Juliet. She had recurring roles in \"The People's Choice\" (1955–1958) and \"Peyton Place\" (1964–1969), playing the roles of Amanda \"Mandy\" Peoples Miller and Laura Brooks, respectively. Breslin was a popular actress during the 1950s and the 1960s, appearing in \"Alfred Hitchcock Presents\" (1955–1962), \"Perry Mason\" (1957–1966) and \"Twilight Zone\" (1959–1964), playing opposite a young William Shatner in the 1960 episode, \"Nick of Time.\" Breslin went on to play Meg Balwin in the daytime soap opera, \"General Hospial,\" from 1966 to 1969. She made one appearance in THE RIFLEMAN, portraying Cora Severs in \"Flowers by the Door\" (episode 92). Breslin guest-starred in the ther western series, including \"Tales of Wells Fargo\" (1957–1962) and \"Bonanza\" (1959–1973).\n\nDiane Brewster was an American television and film actress. She appeared in more than 60 television shows and movies in a career spanning nearly 35 years. A versatile actress, she worked in a wide range of genres from westerns to crime dramas to family comedies. Brewster had recurring roles in several of the most popular TV series of the 50s and 60s, including Samantha Crawford in \"Maverick\" (1957–1962), Wilhelmina \"Steamboat Willy\" Vanderveer in \"The Islanders\" (1960–1961) and Miss Canfield in the original run of \"Leave It to Beaver\" (1957–1963). In \"The Fugitive\" (1963–1967), an innocent man on the run tries to stay ahead of the law while trying to prove he had not killed his beloved wife—Brewster was cast as Helen Kimble, the title character's murdered wife. Brewster later appeared in a \"Leave It To Beaver\" movie, \"Still the Beaver\" (1983), and also the series reboot, \"The New Leave It to Beaver\" (1983–1989). Brewster made guest appearances in many other popular series of the 50s and 60s, including \"Perry Mason\" (1957–1966) and \"77 Sunset Strip\" (1958–1964). She made one guest appearance in THE RIFLEMAN, portraying Fay Owens in \"The Jealous Man\" (episode 136). Other western series in which she guest–starred include \"Tales of Wells Fargo\" (1957–1962), \"Cheyenne\" (1955–1963) and \"Wagon Train\" (1957–1965).\n\nCharlie Briggs was an American actor who worked primarily in television, particularly in the western genre. He appeared in more than 60 television shows and movies in a career spanning 25 years. He made his debut as an actor in the western series \"Maverick\" (1957–1962), playing the role of Little Jeb Plummer. He appeared in the Disney film, \"The Absent-Minded Professor\" (1963), Clint Eastwood's Civil War Southern Gothic, \"The Beguiled\" (1971), the Charles Bronson crime drama, \"Charley Varrick\" (1973), Natalie Wood's last film, \"Brainstorm\" (1983) and the oscar-winning film, \"Norma Rae\" (1973). Briggs made two appearances in THE RIFLEMAN, portraying Eli Manse in \"The Jailbird\" (episode 73) and Artie Quint in \"Short Rope for a Tall Man\" (episode 103). Other western series in which he guest-starred include \"Gunsmoke\" (1955–1975), \"The Virginian\" (1962–1971) and \"Bonanza\" (1959–1973).\n\nLillian Bronson was an American character actress born in Rockport, New York. She appeared in more than 160 movies and television shows in a career spanning 35 years. She began her career on the Broadway stage, appearing in \"Camille\" with Lillian Gish and \"Lean Harvest\" with Leslie Banks. Most of her early film roles, especially of the 1940s, were uncredited, and she tended to be cast in small roles playing society matrons, influential aides-de-camp or relatives, perhaps most memorably as Clark Gable's secretary in \"The Hucksters\" (1947), Claudette Colbert's sister in \"Family Honeymoon\" (1948) and Henry Fonda's mother in \"Spencer's Mountain\" (1963). After making her way into television, Bronson appeared in many of the popular series of the 50s and 60s, including \"Leave It to Beaver\" (1957–1963), \"77 Sunset Strip\" (1958–1964) and \"Perry Mason\" (1957–1966). Her final television appearance was in \"Happy Days\" (1974–1984). Bronson made two guest appearances in THE RIFLEMAN, portraying Mrs. Adams in \"The Legacy\" (episode 51), an uncredited a role, and Elizabeth Favor in \"The Baby Sitter\" (episode 52). She also guest-starred in other popular westerns, including \"The Adventures of Rin Tin Tin\" (1954–1959), \"Have Gun – Will Travel\" (1957–1963) and \"Tales of Wells Fargo\" (1957–1962). Bronson is probably best-remembered not as an actress, but as a model for a mural painted in 1974 by artist Kent Twitchell. The painting was funded by the National Endowment for the Arts in support of a Los Angeles County art program.\n\nJoe Brown, Jr. was an American actor who worked primarily in television and film. Between 1940 and the mid-1970s he appeared in more than two dozen movies and over a dozen television shows. Most of his film roles were bit parts or uncredited. He guest-starred in several popular series of the 50s and 60s, including \"The Phil Silvers Show\" (1955–1959), \"Highway Patrol\" (1955–1959), \"Tales of Wells Fargo\" (1957–1962) and \"Bat Masterson\" (1958–1961). His last TV role was in the James Garner vehicle, \"Nichols\" (1971–1972). Brown made one guest appearance in THE RIFLEMAN, portraying Jake in \"The Mescalero Curse\" (episode 106).\n\nArgentina Brunetti, born Argentina Ferrau, was an Argentinian film, television, stage and radio actress, as well as a writer. She worked in film and television, frequently cast in ethnic roles in a career spanning 65 years. She grew up in an acting family, and was guided by her famous mother Mimi Aguglia, a stage actress, as they toured together throughout Europe and South America. She signed a contract with MGM pictures in 1937 and was given assignments dubbing voices in Italian. Many of her early film roles were uncredited. Brunetti's first credited film appearance was in the classic Frank Capra film, \"It's a Wonderful Life\" (1946), in which she played the part of Mrs. Martini. Brunetti appeared in many of the popular series of the 1950s and 60s, including \"Alfred Hitchcock Presents\" (1955–1962), \"The Untouchables\" (1969–1963) and \"The Andy Griffith Show\" (1960–1968). She guest-starred in virtually all of the major westerns of her time, including \"The Lone Ranger\" (1949–1957), \"Bonanza\" (1959–1973), \"Tales of Wells Fargo\" (1957–1962) and \"Gunsmoke\" (1955–1975). She was a working actress until her death, including making an appearance in \"Everybody Loves Raymond\" (1996–2005), played the role of Zia Sarina in \"Mia Famiglia.\" Married to Miro Brunetti, a foreign correspondent in Hollywood, she co-founded the Hollywood Foreign Press Association.\n\nWilliam Bryant was an American actor who appeared in over 200 film and television roles in a career spanning 45 years. He made four guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played Sandy in \"The Apprentice Sheriff\" (episode 11), Jerry in \"Shivaree\" (episode 19), Karl Hollis in \"Gunfire\" (episode 126), and Trooper Coley in \"The Assailants\" (episode 149).\n\nEdgar Buchanan was an American character actor who appeared in over 100 films and dozens of television series, including several long-lived sitcoms. In a career spanning four decades, he played grizzled, gravelly-voiced characters and was frequently cast in westerns. His most well-known and lovable character was Uncle Joe Carson, who appeared in all 222 episodes of \"Petticoat Junction,\" (1963-1970), 17 episodes of \"Green Acres\" (1965-1969), and, in 1968, three episodes of \"The Beverly Hillbillies\" (1962-1971). In his last role, the 1974 film \"Benji,\" he co-starred with the dog (Higgins) from his stint on \"Petticoat Junction.\" Buchanan made six appearances in THE RIFLEMAN, portraying Grandpa Fogerty in \"The Long Goodbye\" (Episode 119) and the recurring character of Doc Burrage in five, including \"The Pet\" (episode 15), \"The Second Witness\" (episode 23), \"The Trade\" (episode 24), \"The Deadly Wait\" (episode 26), and \"The Angry Man\" (episode 31).\n\nRobert Burton was an American actor of television and film in the 1950s and early 60s. His first major screen credit was playing Wayne Langmuir in \"Desperate Search\" (1952), starring Howard Keel and featuring Keenan Wynn. Appearing mostly in forgettable pictures such as \"I Was a Teenage Frankenstein\" (1957), \"Invasion of the Animal People\" (1962), \"The Slime People\" (1963), his most noteworthy films include \"The Bad and the Beautiful\" (1952), \"The Big Heat\" (1953), \"Compulsion\" (1959) and \"The Manchurian Candidate\" (1962). He appeared in numerous television shows, including \"You Are There,\" \"The Lone Ranger,\" \"Jane Wyman Presents The Fireside Theatre,\" \"The Californians,\" \"The Texan,\" \"Tales of Wells Fargo,\" \"Dennis the Menace,\" \"Wagon Train,\" \"The Many Loves of Dobie Gillis,\" and \"Walt Disney's Wonderful World of Color.\" Burton was one of six actors to play the semi-regular character Doc Burrage in THE RIFLEMAN. He played the role in just one episode, \"The Princess\" (episode 127).\n\nC\n\nKing Calder was an American actor who primarily worked in television, appearing in more than 60 movies and television shows over 15 years. Calder had a recurring role in the drama series \"Martin Kane\" (1949–1954), playing the role of Lt. Grey. He remained a familiar face in television throughout the 1950s and into the 1960s, making appearances in many of the popular series of that era, including \"The Untouchables\" (1959–1963), \"Hennesey\" (1959–1962), \"Perry Mason\" (1957–1966) and \"Alfred Hitchcock Presents\" (1955–1962). He made one guest appearance in THE RIFLEMAN, portraying King Croxton in \"The Assault\" (episode 102). Calder also guest-starred in other popular TV westerns, including \"Have Gun – Will Travel\" (1957–1963), \"Wanted: Dead or Alive\" (1958–1961), \"Tales of Wells Fargo\" (1957–1962), \"Lawman\" (1958–1962) and \"The Virginian\" (1962–1971).\n\nPhilip Carey, born Eugene Josh Carey, was an American film television and film actor who appeared in nearly 100 movies and television shows in a career spanning almost 60 years. Prior to working in the entertainment industry, he served in the United States Marines during World War II, in which he was injured, and the Korean War. Tall and ruggedly handsome, he also had a deep mellifluous voice, and so, landed many assignments doing narration and voice-over, including the Granny Goose potato chips commercials. His first acting job was a succession of different roles in the popular \"Ford Theater\" TV anthology series of the 1950s. Carey would appear mutiple times or play recurring roles in many TV series, including Lieutenant Michael Rhodes in the adventure series \"Tales of the 77th Bengal Lancers\" (1956–1957), the title role in the crime drama \"Philip Marlowe\" (1959–1960) and Captain Edward Parmalee in the western \"Laredo\" (1965–1967). He also guest-starred in other popular series of the 1950s and the 1960s, including the crime drama \"77 Sunset Strip\" (1958–1964) and numerous westerns, including \"Tales of Wells Fargo\" (1957–1962), \"Lawman\" (1958–1962), \"Cheyenne\" (1955–1963), \"The Virginian\" (1962–1971) and \"Gunsmoke\" (1955–1975). Carey is best-known for his long-running portrayal of tycoon, Asa Buchanan, in the daytime drama \"One Life to Live\" (1968– 2008), which was also his final role. Carey made one appearance in THE RIFLEMAN, portraying Dr. Simon Battle in \"Death Trap\" (episode 109).\n\nHarry Carey, Jr. is a prolific American film and television character actor. He has appeared in more than 150 movies and television shows in a career spanning 65 years. He has been a familiar fixture in westerns, but has appeared in a wide range of genres, from popular series of the 1960s, including the crime drama series \"Perry Mason\" (1957–1966), to cult classic films of the 1980s, including \"Gremlins\" (1984), in which he played Mr. Anderson, and \"Back to the Future Part III\" (1990), in which he made a cameo appearance as a saloon old-timer. Carey and his father both appeared in the classic Howard Hawks western, \"Red River\" (1948); although, they did not share any scenes together. He also was associated with the so-called John Ford Stock Company, appearing in many of the legendary director's films, including \"3 Godfathers\" (1948), \"Wagon Master\" (1950), \"Rio Grande\" (1950), \"The Long Gray Line\" (1955) and \"Cheyenne Autumn\" (1964). Carey appeared in virtually every major western series of his era; although, he is perhaps most often recognized for his recurring role as Bill Burnett in the original, as well as the movie and the various reboots of \"The Adventures of Spin and Marty\" (1955). He appeared in \"Lawman\" (1958–1962), \"Laramie\" (1959–1963), \"Have Gun – Will Travel\" (1957–1963), \"Wagon Train\" (1957–1965), \"Bonanza\" (1959–1973), \"The Virginian\" (1962–1971) and \"Gunsmoke\" (1955–1975). Carey made two guest appearances in THE RIFLEMAN, portraying Lt. Paul Rolfe in \"The Deserter\" (episode 65) and Lieutenant Vaughn in \"The Journey Back\" (episode 115). In 1987, Carey received a Golden Boot for his contributions to the western genre, and in 2003, he was inducted into the Western Performers Hall of Fame at the National Cowboy & Heritage Museum in Oklahoma City, Oklahoma. Carey also has a Star on the Hollywood Walk of Fame.\n\nBenny Carle is an American television and radio personality. He was given the opportunity to make a guest appearance in THE RIFLEMAN while working for WAFF-TV, the ABC affiliate in Birmingham, Alabama. At the time, ABC was working on a publicity campaign in which one on-air personality from each of its affiliate stations was selected to make cameo appearances in various network programs. Carle is remembered for his afternoon kids' show (1965 to 1977) in which Chuck Connors, who offered him the part in THE RIFLEMAN, had appeared several months earlier. Carle portrayed Amos Blaine in \"The Assailants\" (episode 149).\n\nThomas Carney was an American film and television actor. He appeared in more than 50 television shows and movies during his 40-year career. He was a guest star in various popular series of the 1950s and 60s, including \"Dragnet\" (1951–1959), \"The Untouchables\" (1959–1963), \"Perry Mason\" (1957–1966) and \"Barnaby Jones\" (1973–1980). He made one guest appearance in THE RIFLEMAN, portraying Moss Jackman in \"Lou Mallory\" (Episode 145). He also guest-starred in some of the other iconic western series of the era, including \"Gunsmoke\" (1955–1975), \"Have Gun – Will Travel\" (1957–1963) and \"The Life and Legend of Wyatt Earp\" (1955–1961).\n\nCarleton Carpenter is an American stage, film and television actor, as well as a magician, author and songwriter. He has appeared in nearly 40 movies and television shows in a career spanning more than 30 years. Prior to signing to Metro-Goldwyn-Mayer, Carpenter worked on Broadway, both as a magician and an actor. He appeared in many films starring movie and stage legends such as Ray Bolger in \"Three to Make Ready,\" Bert Lahr and Angela Lansbury in \"Hotel Paradiso\" and Judy Garland in the film \"Summer Stock\" (1950). Carpenter had starring roles in \"Fearless Fagan\" (1952), co-starring Janet Leigh, and \"Sky Full of Moon\" (1952), with Jan Sterling. Carpenter appeared in several popular series of the 1950s and 60s, including \"G.E. True Theater\" (1953–1962) and \"Perry Mason\" (1957–1966). He made one guest appearance in THE RIFLEMAN, portraying George Collins in \"The Coward\" (episode 153). Carleton had many talents besides acting; they included composing songs and writing novels. Among his hits compositions were \"Christmas Eve,\" \"Cabin in the Woods\" and \"Ev'ry Other Day.\" During the 1970s and 80s, Carpenter became a best-selling mystery novelist. One of his more popular books, \"Deadhead\" (1974), was adapted to a Broadway musical. He also authored several short stories, which were featured in the Alfred Hitchcock and Ellery Queen mystery magazines.\n\nPaul Carr made four guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played Derek Hanaway in \"Shivaree\" (episode 19), Garth Healey in \"The Woman\" (episode 32), Fred Harris in \"Letter of the Law\" (episode 50), and Doug Carter in \"Smoke Screen\" (episode 68).\n\nJohn Carradine was an American actor who had an extremely prolific film career, while simultaneously maintaining a stage career in classic leading roles. Tall and gaunt, with a distinctive sonorous baritone voice, Carradine became a venerable film icon, with over 300 film credits and more than 100 television credits in a career that spanned 65 years. Born the son of a reporter/artist and surgeon, he grew up in Pougkeepsie, New York. He attended Christ Church School, and studied sculpture at Graphic Art School. As a young man, he roamed the South selling sketches. He made his acting debut in \"Camille\" in New Orleans theater in 1925. Two years later, he went to Los Angeles where he worked in local theater. He applied as scenic designer to Cecil B. DeMille, who rejected his designs but gave him voice work in several films. His film debut was in the role of Peter Richmond in \"To Able David.\" Carradine was the prot ég é and close friend of John Barrymore. Usually cast in supporting roles, he appeared in many movie classics, including 10 John Ford films, among them, \"Stagecoach\" (1939), \"The Grapes of Wrath\" (1940), and \"The Man Who Shot Liberty Valance\" (1962). He also portrayed Aaron in \"The Ten Commandments\" (1956). Carradine was frequently cast in horror and western genre films. He made two guest appearances in THE RIFLEMAN, portraying Abel Gross in \"The Photographer\" (episode 18) and James Barrow McBride in \"The Mind Reader\" (episode 40). Near the end of his life, Carradine claimed to have appeared in more movies than any other actor, surpassing the record set by Donald Crisp, the Oscar winning actor and director who had started in silent films and had appeared in numerous one and two reel films, many of them lost. He was the father of sons Chris, David, Keith and Robert Carradine.\n\nMel Carter made eight guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played an outlaw on \"End of a Young Gun\" (episode 3), Walkerman in \"The Safe Guard\" (episode 8), a cowhand in \"The Challenge\" (episode 28), Jed Healy in \"The Woman\" (episode 32), Arnie Grady in \"The Journey Back\" (episode 115), Jeems in \"Outlaw's Shoes\" (episode 141), George Vale's partner Bo Jackman in \"Lou Mallory\" (episode 145), and Mark Jones in \"Death Never Rides Alone\" (episode 147). Carter appeared in many television shows from the late 1950's through late 1980's. In 1987, he co-starred with Chuck Connors in \"Werewolf,\" an episode of the \"Father Jude\" series.\n\nLynn Cartier guest-starred in two episodes of THE RIFLEMAN, portraying Mrs. Porter in \"Panic\" (episode 47) and Alice Bedford in \"The Hero\" (episode 59).\n\nPenelope Sue Carver guest-starred in one episode of THE RIFLEMAN, portraying the little girl who dies from Anthrax in \"The Pet\" (episode 15).\n\nAllen Case was an American actor who grew up in Dallas, Texas. He attended Southern Methodist University for two years and went on to have a career in television from 1958 to 1982. With more than 30 television credits, he was frequently cast in cowboy roles. His acting career began performing on a local TV variety program. After several months, he moved to New York and successfully tried out for a singing spot on Arthur Godfrey's morning show. His stint on Godfrey's show led to several nightclub engagements and parts in two Broadway-bound musicals, \"Reuben, Reuben\" and \"Pleasure Dome,\" both of which closed out of town. More work followed in nightclubs and on Broadway, as well as an occasional return to the Arthur Godfrey show, as well an appearance on Jack Parr. Case had a small part in the 1958 movie version of \"Damn Yankees,\" which brought him to California and led to roles in a succession of western genre series, including \"Bronco,\" \"Wagon Train,\" \"Gunsmoke,\" \"Have Gun Will Travel\" and \"Sugarfoot\". He appeared in one episode of THE RIFLEMAN, portraying Jeremy Ashford in \"The Young Englishman\" (episode 13). Case returned to New York to appear in an off-Broadway production of \"Once Upon a Mattress,\" and from there went on to co-star with Henry Fonda in the TV series \"The Deputy,\" for which he is best remembered.\n\nMalcolm Cassell is an American film and television actor, who has had a brief career of nine years in which he has appeared in 16 movies and television shows. He had a recurring role as Tommy Walker in the comedy series \"The Real McCoys\" (1957–1963), made several appearances in \"The Loretta Young Show\" (1953–1961), and he portrayed Billy the Kid in the western series, \"The Rebel\" (1959–1961). His final screen appearance was in \"Pirates of Tortuga\" (1961), in which he portrayed Kipper. Cassell made one guest appearance in THE RIFLEMAN, portraying Joey Merrick in \"The Spoiler\" (episode 61). p>\n\nBill Catching, born Jerome P. Catching, was an American film and television actor, and also a stuntman. He appeared in nearly 80 movies and television shows and in a career spanning almost 30 years. He made guest-starred in numerous popular TV series of the 1950s and 60s, including several appearances in the crime drama series \"Boston Blackie\" (1951–1953), the Ann Francis detective series, \"Honey West\" (1966) and the David Carradine series, \"Kung Fu\" (1974). Catching is most recognizable for his many appearances in virtually every major western of the 50s and 60s, frequently making multiple appearances in different roles, including \"The Cisco Kid\" (1950–1956), \"The Roy Rogers Show\" (1951–1957), \"The Adventures of Wild Bill Hickock\" (1951–1958), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Wagon Train\" (1957–1965), \"Bonanza\" (1959–1973), \"Gunsmoke\" (1955–1975) and \"The Wild Wild West\" (1965–1966). He made one guest appearance in THE RIFLEMAN, portraying Tom Williamson in \"The Second Witness\" (episode 23). In 1994, he received the Golden Boot award for his significant contributions to the western genre.\n\nBill Cerone has just two screen credits: he appeared in the dramatic TV series, \"Channing\" (1963–1964) as Bob in the episode, \"The Potato Bash World,\" and in THE RIFLEMAN as Mortimer in \"Guilty Conscience\" (episode 137).\n\nRobert Chadwick was an American film and television actor. He appeared in 10 movies and television shows in a brief career of a little over a decade. He appeared in several popular series of the 1950s and 60s, including \"The Outer Limits\" (1963–1965), \"Perry Mason\" (1957–1966) and \"Rawhide\" (1959–1966). In addition to his work in television, Chadwick played the role of the father in David Lynch's surreal short film, \"The Grandmother\" (1970). He guest-starred in one episode of THE RIFLEMAN, portraying Eskamimzin in \"The Indian\" (episode 21).\n\nLarry Chance was an American film and television actor who appeared in more than 50 films and television shows over a career spanning nearly 30 years. Although many of his film roles were uncredited, he was cast in most of the major western series of the 1950s and 60s, including \"Annie Oakley\" (1954–1956), \"Adventures of Wild Bill Hickock\" (1951–1958), \"The Adventures of Rin Tin Tin\" (1954–1959), \"Bonanza\" (1959–1973), \"Tales of Wells Fargo\" (1957–1962) and \"The Virginian\" (1962–1971). He guest-starred in one episode of THE RIFLEMAN, portraying Lobo in \"The Mescalero Curse\" (episode 106).\n\nJames Chandler was an American film and television actor who appeared in nearly 70 movies and television shows in a career spanning more than 30 years. During the 1950s through the 70s, Chandler guest-starred in various popular crime dramas, including \"77 Sunset Strip\" (1958–1964), \"Bourbon Street Beat\" (1959–1960) and \"Perry Mason\" (1957–1966). He made two guest appearances in THE RIFLEMAN, portraying the rancher in \"The Mind Reader\" (episode 40) and Harvey Andrews in \"The Silent Knife\" (episode 89). Chandler also appeared in many of the other classic western TV series of the period, including \"Wanted: Dead or Alive\" (1958–1961), \"Laramie\" (1959–1963), \"Bonanza\" (1959–1973) and \"Gunsmoke\" (1955–1975).\n\nLon Chaney, Jr., born Creighton Tull Chaney, was an American character actor whose filmography includes nearly 200 acting credits in a career spanning seven decades. He is best-known for being the son of silent film star Lon Chaney and his many roles in monster movies. He is the only actor to have portrayed all of the classic movie monsters: the title role in \"The Wolf Man\" (1941), Frankenstein's monster in \"The Ghost of Frankenstein\" (1942), a mummy in \"The Mummy's Tomb\" (1942) and a vampire in \"Son of Dracula\" (1943). Chaney was memorialized for his most iconic role, the Wolf Man, in a 1997 edition of US postage stamps. Chaney appeared in a small number of television shows in the 1950s, including a recurring role as Chingachgook in \"Hawkeye and the Last of the Mohicans\" (1957). He made one appearance in THE RIFLEMAN, portraying Charlie Gordo in \"Gunfire\" (episode 126).\n\nLonny Chapman was an American character actor of film who appeared in more than 150 movies and television shows, as well as some stage productions, in a career spanning 50 years. He appeared in some of the great film classics, including Elia Kazan's \"East of Eden\" (1955), starring James Dean and Julie Harris; Alfred Hitchcock's \"The Birds\" (1963), starring Tippi Hedren and Sean Connery; and Martin Ritt's award-winning, \"Norma Rae\" (1979), starring Sally Field. Although he performed in a wide range of genres, Chapman is identified with playing parts in mysteries, courtroom and crime dramas in nearly every decade of his career, including \"Perry Mason\" (1957–1966), \"The Defenders\" (1961–1965), \"Judd for the Defense\" (1967–1969), \"Police Story\" (1973–1977), \"Murder, She Wrote\" (1984–1996) and \"NYPD Blue\" (1993–2005). he also played the role of the convict Jake in Woody Allen's comedic crime caper \"Take the Money and Run\" (1969). Chapman made guest appearances in other popular series, including \"Mission: Impossible\" (1966–1973) and \"Walt Disney's Wonderful World of Color\" (1954–1990). He guest-starred in two episodes of THE RIFLEMAN, portraying Stanley in \"Long Trek\" (episode 93) and Scully Potter in \"And the Devil Makes Five\" (episode 161). He also appeared in several other classic TV westerns, including \"Gunsmoke\" (1955–1975) and \"The Virginian\" (1962–1971). In 1972, Chapman received a Bronze Wrangler award for his role in the Mark Rydell western, \"The Cowboys\" (1972), which was adapted from a novel by William Dale Jennings.\n\nLewis Charles, born Lewis Cholost, was an American actor who worked primarily in television. He appeared in more than 140 movies and television shows in a career spanning 30 years. He guest-starred in a wide variety of different genres, making appearances in crime dramas, including \"Richard Diamond, Private Detective\" (1957–1960), \"Peter Gunn\" (1958–1961), \"The Untouchables\" (1959–1963) and \"77 Sunset Strip\" (1958–1964), as well as the popular family series, \"The Andy Griffith Show\" (1960–1968), the live-action \"Batman\" (1966–1968) and the espionage action series \"Mission: Impossible\" (1966–1973). Charles made three guest appearances in THE RIFLEMAN, portraying Slade in \"The Indian\" (episode 21), Eber Tate in \"One Went to Denver\" (episode 25) and Pascal in \"Skull\" (episode 124). He also guest-starred in several other classic westerns, including \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Wanted: Dead or Alive\" (1958–1961) and \"Bonanza\" (1959–1973).\n\nKim Charney is an American film and television actor. He has appeared in more than 30 movies and television shows in a decade-long career. Charney may be best-remembered for his recurring role as Terry Richmond in \"Leave It to Beaver\" (1957–1963). He also appeared in the film-noir \"Suddenly\" (1954), starring Frank Sinatra, in which he played the role of Peter Benson III, or \"Pidge.\" Charney made one guest appearance in THE RIFLEMAN, portraying Carey MacDonald in \"The Angry Man\" (episode 31). In addition to THE RIFLEMAN, he guest-starred in several other classic westerns of the 1950s and 60s, including \"Tales of the Texas Rangers\" (1955–1959), \"Wagon Train\" (1957–1965), \"The Restless Gun\" (1957–1959), \"Lawman\" (1958–1962) and \"Cheyenne\" (1955–1963).\n\nAlden Stephen Chase, born Guy Alden Chase, was an American television and film actor. He appeared in more than 130 movies and television shows during his 34-year career, with many roles uncredited. Among his films roles, he portrayed Dr. T. Hallen in the sci-fi cult classic, \"The Blob\" (1958), starring Steve McQueen. Chase guest-starred in numerous popular programs of the 1950s, 60s and 70s, especially in the crime drama and western genres. He guest-starred in \"Perry Mason\" (1957–1966), \"Richard Diamond, Private Detective\" (1957–1960) and \"77 Sunset Strip\" (1958–1964), as well as the western series, \"The Cisco Kid\" (1950–1956), \"The Roy Rogers Show\" (1951–1957), \"The Lone Ranger\" (1949–1957), \"Gunsmoke\" (1955–1975), \"Tales of Wells Fargo\" (1957–1962), \"Death Valley Days\" (1958–1961) and \"Bonanza\" (1959–1973). He made one guest appearance in THE RIFLEMAN, portraying Colonel Stroud in \"The Sheridan Story\" (episode 16).\n\nVirginia Christine, born Virginia Christine Kraft, was an American film and television actress who appeared in more than 150 movies and television shows in a career spanning 35 years. She attended the University of California, Los Angeles, where she met her acting coach and future husband, Fritz Feld. In 1942, Christine signed an acting contract with Warner Bros. Although primarily a television actress, she appeared in a few high-profile films, including the noir film, \"The Killers\" (1946), starring Burt Lancaster, in which she played the role of Lilly Harmon Lubinsky; and the sci-fi cult classic, \"Invasion of the Body Snatchers\" (1956), in which she portrayed Wilma Lentz. Christine garnered roles in almost every genre in television, appearing in many popular series, including the thrillers, \"Alfred Hitchcock Presents\" (1955–1962) and \"Twilight Zone\" (1959–1964), as well as crime dramas and mystery series, including \"Peter Gunn\" (1958–1961), \"The Untouchables\" (1959–1963), \"77 Sunset Strip\" (1958–1964) and \"Perry Mason\" (1957–1966). She is probably best-remembered as Mrs. Olsen in the Folgers Coffee ads. Christine made two appearances in THE RIFLEMAN, portraying Mrs. Hardy in \"The Spiked Rifle\" (episode 49) and Mrs. Dalrymple in \"The Long Goodbye\" (episode 119). She also guest-starred in numerous westerns, including \"The Lone Ranger\" (1949–1957), \"The Restless Gun\" (1957–1959), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Wanted: Dead or Alive\" (1958–1961) , \"Tales of Wells Fargo\" (1957–1962), in which she had a recurring role as Ovie Swenson, \"Bonanza\" (1959–1973) and \"The Virginian\" (1962–1971).\n\nPat Close was an American film and television actor. He appeared in nine movies and television shows in seven years. Although he had a brief acting career, Close guest-starred in several popular TV series, including \"The Donna Reed Show\" (1958–1966), \"G.E. True Theater\" (1953–1962), \"Twilight Zone\" (1959–1954) and \"Dennis the Menace\" (1959–1963). He also had a starring role as the son in Andy Warhol's \"Imitation of Christ\" (1967). Close made one guest appearance in THE RIFLEMAN, portraying Noah Fergus in \"The Queue\" (episode 110).\n\nJames Coburn was an American actor, producer, director, writer and screenwriter. He studied acting at UCLA, before moving to New York to study at The Stella Adler Studio of Acting His long and versatile 45-year career garnered him more than 150 credits as an actor. He worked with some of Hollywood's most celebrated directors and appeared in several films classics, including John Sturges\" films \"The Magnificent Seven\" (1960) and \"The Great Escape\" (1963), Sam Peckinpah's \"Major Dundee\" (1965), \"Pat Garrett and Billy the Kid\" (1973) and \"Cross of Iron\" (1977). He became a widely recognized star with his James Bond spy spoofs playing the title roles in \"Our Man Flint\" (1966) and \"In Like Flint\" (1967). Coburn received an Academy Award for Best Supporting Actor for his role as Glen Whitehouse in the film \"Affliction\" (1997), in addition to nominations from both the Screen Actors Guild and the Independent Spirit Awards. Coburn made two guest appearances on THE RIFLEMAN, portraying Cy Parker in \"The Young Englishman\" (episode 13) and Ambrose in \"The High Country\" (episode 122). Coburn was already well-established in the western genre prior to his appearances on THE RIFLEMAN, having made his film debut in the western \"Ride Lonesome\" (1959), followed by multiple appearances in both \"The Restless Gun\" (1957–1959) and \"Bonanza\" (1959–1973).\n\nPamela Cole guest-starred in one episode of THE RIFLEMAN, portraying Sally in \"The Schoolmaster\" (episode 86). Cole is Chuck Connor's niece and was recruited to play one of the school children, along with Steven Gardner, the son of THE RIFLEMAN producer Arthur Gardner and Connors' four sons Mike, Steve, Jeff and Kevin.\n\nJohnny Collier is an American film and television actor who has appeared in nine movies and television shows in a little over 40 years. He appeared in the popular family series \"Leave It to Beaver\" (1957–1963) and \"Dennis the Menace\" (1959–1963). Collier guest-starred in one episode of THE RIFLEMAN, portraying Howey in \"Smoke Screen\" (episode 68). He also made guest appearances in the westerns \"Maverick\" (1957–1962) and \"Law of the Plainsman\" (1959).\n\nRussell Collins was an American film and television actor who appeared in nearly 90 movies and television shows in a career spanning more than 30 years. He was a versatile actor who appeared in popular shows from each decade during which he was active. He guest-starred in various early television shows, including the mystery series \"Suspense\" (1949–1954) and the comedy series \"The Real McCoys\" (1957–1963). Collins made guest appearances in several crime dramas, including \"Peter Gunn\" (1958–1961), \"The Untouchables\" (1959–1963) and \"The Fugitive\" (1963–1967), as well as the popular TV series \"Alfred Hitchcock Presents\" (1955–1962), in which he made several guest appearances and also the sci-fi thrillers \"Twilight Zone\" (1959–1964) and \"The Outer Limits\" (1963–1965). In addition to television, Collins made several film appearances. He played the role of Mr. Qua in the Marilyn Monroe noir film \"Niagara\" (1953); he potrayed Mr. Hastings in \"Bad Day at Black Rock\" (1955), starring Spencer Tracy; and he played the part of Knapp in the Sidney Lumet film \"Fail-Safe\" (1964), starring Henry Fonda. Collins guest-starred in two episodes of THE RIFLEMAN, portraying Willard Denton in \"Eight Hours to Die\" (episode 6) and Charlie Willard in \"The Apprentice Sheriff\" (episode 11). Collins made guest appearances in several other iconic westerns, including \"Have Gun – Will Travel\" (1957–1963), \"Bonanza\" (1959–1973) and \"Wagon Train\" (1957–1965).\n\nBooth Colman is an American stage, film and television actor. He began his career as a child performer, appearing in local theater productions and radio. He has made appearances in more than 160 movies and television shows in a career spanning nearly 60 years. Colman guest-starred in many of the most popular series since the 1950s, often cast as a venerable professorial character. Colman attended the Universities of Washington and Michigan, after which he served in the Japanese Language Division of the U.S. Military Intelligence during World War II. Following his service, Colman began acting on the stage in New York, playing leading roles in over a dozen plays, including repeat performances for more than 15 years playing Ebenezer Scrooge in \"A Christmas Carol,\" Sir Thomas More in \"A Man for All Seasons,\" Commander Queeg in \"Caine Mutiny Court Martial,\" Willy Loman in \"Death of a Salesman\" and many other classic plays. He eventually made his way to Hollywood to pursue a career in movies, debuting in Howard Hawks' \"The Big Sky\" (1952) and subsequently appearing in more than 50 feature films. Colman appeared in a variety of genres, including the comedy \"Auntie Mame\" (1958), the John Wayne western \"The Comancheros\" (1961), the Jerry Lewis screwball comedy \"The Errand Boy\" (1961), three Peter Ustinov comedies, among them \"Romanoff and Juliet\" (1961), the Fred MacMurray–Polly Bergen comedy \"Kisses for My President\" (1964), and the labor union drama \"Norma Rae\" (1979), starring Sally Field in the Oscar-winning title role. Colman has guest-starred in numerous TV series in virtually every major genre. Colman made guest appearances in numerous crime dramas, including \"Cavalcade of America\" (1952–1957), \"The Untouchables\" (1959–1963), \"77 Sunset Strip\" (1958–1964), \"Perry Mason\" (1957–1966) and \"Police Story\" (1973–1977). He also appeared in the sci-fi classics \"Thriller\" (1960–1962), starring Boris Karloff, and \"The Outer Limits\" (1963–1965). He has had a few recurring roles, including his portrayals of Dr. Zaius in \"Planet of the Apes\" (1974) and Dr. Felix Burke in the long-running soap opera \"The Young and the Restless\" (1973–present). More recently, he made appearances in the popular comedy series \"My Name is Earl\" (2005–2009) and \"The Suite Life of Zack and Cody\" (2005–2007). Colman made one guest appearance in THE RIFLEMAN, portraying Jeremiah in \"The High Country\" (episode 122). He also guest-starred in many other popular westerns of the 1950s and 60s, including \"Bonanza\" (1959–1973) and \"Daniel Boone\" (1964–1970)—making several appearances in both, as well as \"Yancy Derringer\" (1958–1959), \"Cheyenne\" (1955–1963), \"The Virginian\" (1962–1971) and \"Gunsmoke\" (1955–1975).\n\nMike Connors is one of four sons of THE RIFLEMAN's star, Chuck Connors. He and his three brothers, together with Steven Gardner, son of the show's executive producer Arthur Gardner, appeared in \"The Schoolteacher\" (episode 86) as schoolchildren. Mike also appeared with brother Jeff as two boys going fishing in \"First Wages\" (episode 112).\n\nCharles J. Conrad was an American actor and a politician. He appeared in more than 30 movies and television shows over 16 years. Virtually all of his early roles were uncredited. He made guest appearances in a few popular shows, including \"Sergeant Preston of the Yukon\" (1955–1958) and the crime dramas \"Perry Mason\" (1957–1966) and \"The Lawless Years\" (1959–1961). Conrad guest-starred in one episode of THE RIFLEMAN, portraying Mallory in \"The Spiked Rifle\" (episode 49). He also appeared in the westerns \"Gunsmoke\" (1955–1975) and \"Laramie\" (1959–1963). Conrad spent his political career serving in the California State Assembly from 1947 to 1972 and was the Republican minority leader in the late 1960s.\n\nSteve Conte was an Italian-American actor who worked primarily in television. He had more than 70 acting credits in a career spanning nearly 40 years. He appeared in various low-budget horror films, including \"Teenage Zombies\" (1959), \"Terror of the Bloodhunters\" (1962) and \"Face of the Screaming Werewolf\" (1964). Among the numerous television shows in which he guest-starred, Conte appeared in several westerns, sometimes multiple times, including \"The Gene Autry Show\" (1952–1955), \"Death Valley Days\" (1955–1957) \"Broken Arrow\" (1956–1958) and \"The Adventures of Rin Tin Tin\" (1954–1959). Conte made one appearance in THE RIFLEMAN, portraying Doyle Black in \"Lariat\" (episode 67).\n\nRoberto Contreras was an American film and television actor who appeared in more than 80 movies and television shows in a career spanning nearly 40 years. He acted in a variety of popular shows, including the crime dramas \"77 Sunset Strip\" (1958–1964) and \"Police Story\" (1973–1977), as well as the adventure series \"The Fugitive\" (1963–1967) and the espionage thriller \"Mission: Impossible\" (1966–1973). Contreras guest-starred in one episode of THE RIFLEMAN, portraying Angelo in \"The Vaqueros\" (episode 111). He made guest appearances in numerous other westerns, including \"Maverick\" (1957–1962), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen, \"Tales of Wells Fargo\" (1957–1962) and \"Rawhide\" (1959–1966), starring Clint Eastwood. Contreras also had a recurring role as Pedro in the western series \"The High Chaparral\" (1967–1971).\n\nTommy Cook is an American television and film actor who has appeared in 90 movies and television shows in a career spanning nearly 45 years. He made his acting debut in the western film \"Adventures of Red Ryder\" (1940), portraying Little Beaver. Cook has appeared in various crime dramas, including \"Dragnet\" (1951–1959), \"Richard Diamond, Private Detective\" (1957–1960), \"The Untouchables\" (1959–1963) and \"Perry Mason\" (1957–1966). In addition to television, he has been in a few films, including playing leading roles in the crime dramas \"The Viscious Years\" (1950) and \"Teen-Age Crime Wave\" (1955). Cook also appeared in the noir film \"Panic in the Streets\" (1950), directed by Elia Kazan. Cook guest-starred in one episode of THE RIFLEMAN, portraying Andy Carr in \"Sheer Terror\" (episode 113). He also made guest appearances in other westerns, including \"Adventures of Wild Bill Hickock\" (1951–1958) and \"The Life and Legend of Wyatt Earp\" (1955–1961).\n\nCharles Cooper made four guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played Hank Fulton in \"End of a Young Gun\" (episode 3), Rudy Crofts in \"The Stand-In\" (episode 114), Matt Yordy in \"Honest Abe\" (episode 118), and Larsen, the Bartender in \"I Take This Woman\" (episode 148).\n\nEllen Corby, born Ellen Hansen, was a prolific American film and television actress. She appeared in more than 230 movies and television shows during a career spanning 65 years. Corby was interested in acting beginning in high school, eventually moving to Hollywood, where she took acting lessons for more than a decade. After playing many uncredited roles, Corby eventually became a busy character actress, appearing in movies and television shows in every genre. She was cast in the starring role as Emma Barber in the crime drama \"Caged\" (1950); she played Mrs. Liz Torrey in the Oscar-winning George Stevens' western \"Shane\" (1953); she portrayed Miss McCardle in the romantic comedy \"Sabrina\" (1954), starring Humphry Bogart and Audrey Hepburn; and she played the role of the manager of the McKittrick Hotel in the Alfred Hitchcock classic film \"Vertigo\" (1958). Corby appeared in many TV series, including the crime dramas \"Dragnet\" (1951–1959), \"77 Sunset Strip\" (1958–1964), \"Perry Mason\" (1957–1966) and \"Richard Diamond, Private Detective\" (1957–1960), as well as family comedies, including \"I Love Lucy\" (1951–1957) and \"The Andy Griffith Show\" (1960–1968), and even \"Batman\" (1966–1968), starring Adam West. She is perhaps best-remembered for her portrayal of Grandma Esther Walton in the family drama \"The Waltons\" (1971–1981), for which she received several awards, including three Emmy awards for Outstanding Continuing Performance by a Supporting Actress in a Drama Series and two Golden Globes for Best Supporting Actress in Television. Corby was also awarded a Golden Globe for Best Supporting Actress for her portrayal of Aunt Trina in the film \"I Remember Mama\" (1948). Corby also guest-starred in virtually all of the iconic westerns, including \"The Roy Rogers Show\" (1951–1957), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"The Adventures of Rin Tin Tin\" (1954–1959), \"Trackdown\" (1957–1959), in which she had a recurring role as Henrietta Porter, \"Wagon Train\" (1957–1965), in which she made two appearances as Aunt Em, \"Tales of Wells Fargo\" (1957–1962), \"Cheyenne\" (1955–1963), \"Bonanza\" (1959–1973) and \"The Virginian\" (1962–1971). Corby guest-starred in two episodes of THE RIFLEMAN, portraying Mrs. Avery in \"The Spoiler\" (episode 61) and Mrs. Morgan in \"The High Country\" (episode 122). In 1989, Corby receive the Golden Boot award for her significant contributions to the western genre.\n\nRobert Cornthwaite was a prolific American stage, film and television actor. He appeared in more than 160 movies and television shows during his 55-year career. Cornthwaite became interested in acting after being forced to recite a line for a school production. He attended Long Beach City College and served as an intelligence officer in the Army Air Force during World War II. Following his military service, Cornthwaite earned a degree from the University of Southern California, after which he then moved to Hollywood, where he finally began pursuing his dream of becoming an actor. Despite a somewhat slow start, Cornthwaite was eventually working regularly, type-cast as intellectual characters in movies and television shows until his death in 2006. He was a highly versatile actor, appearing in crime dramas, including \"Cavalcade of America\" (1952–1957); \"The Untouchables\" (1959–1963); \"Perry Mason\" (1957–1966); \"77 Sunset Strip\" (1958–1964) and \"Murder, She Wrote\" (1984–1996); as well as the horror series \"Thriller\" (1960–1962), hosted by Boris Karloff; Rod Serling's sci-fi thriller series, \"Twilight Zone\" (1959–1964); the family comedy \"The Andy Griffith Show\" (1960–1968); the war drama \"Combat!\" (1962–1967), starring Vic Morrow; and the adventure series \"The Fugitive\" (1963–1967), starring David Janssen. Cornthwaite also had a few recurring roles, especially toward the end of his career, including the part of Professor Windish in the Buck Henry spy spoof \"Get Smart\" (1965), Allan A. Dale in \"Batman\" (1966–1968), starring Adam West, Judge Edward P. Langdon in the night-time soap \"Dynasty\" (1981–1989), Hives in the long-running comedy series \"Cheers\" (1982–1993) and Howard Buss in the drama \"Picket Fences\" (1992–1996). Cornthwaite's roles playing intellectual characters followed him from TV to fims, including a several science fiction movies. He portrayed Dr. Arthur Carrington in \"The Thing from Another World\" (1951), starring James Arness from \"Gunsmoke\" ; Dr. Zoldeck in the comedy sci-fi \"Monkey Business\" (1952), starring Marilyn Monroe; Dr. Pryor in the sci-fi classic \"The War of the Worlds\" (1953); and Dr. Shelby in the Oscar-winning thriller \"What Ever Happened to Baby Jane?\" (1962), starring Joan Crawford and Bette Davis. Cornthwaite guest-starred in one episode of THE RIFLEMAN, portraying Major Damler in \"The Deserter\" (episode 65). Cornthwaite made guest appearances in numerous other westerns, including \"Maverick\" (1957–1962), starring Roger Moore, \"Tales of Wells Fargo\" (1957–1962), \"Laramie\" (1959–1963), \"Wagon Train\" (1957–1965), \"Rawhide\" (1959–1966), starring Clint Eastwood, \"The Virginian\" (1962–1971), \"Bonanza\" (1959–1973) and \"Gunsmoke\" (1955–1975).\n\nJerome Courtland is an American actor, producer and director. Between 1944 and 1993 Courtland was involved in the making of more than 70 titles for film and television. Courtland made one appearance on THE RIFLEMAN, playing Johnny Gibbs in \"The Brother-in-Law\" (episode 5).\n\nKay Cousins Johnson, born Kay Levy, was an American actress who worked primarily in television. Over a little more than a decade, Cousins guest-starred in 11 movies and television shows. She made appearances in a few popular shows, including the comedy \"Private Secretary\" (1953–1957), starring Ann Sothern; the crime drama \"M Squad\" (1957–1960), starring Lee Marvin; Rod Serling's iconic sci-fi thriller series, \"Twilight Zone\" (1959–1964); and the spy genre meets western \"The Wild Wild West\" (1965–1969), starring Robert Conrad and Ross Martin. Cousins may be best-known for her marriage to the actor Russell Johnson, who played the professor in Gilligan's Island. Cousins made one guest appearance in THE RIFLEMAN, portraying Flo in \"The Boarding House\" (episode 22).\n\nCarolyn Craig, born Adele Ruth Crago, was an American film and television actress whose promising career was tragically cut short following a fatal gunshot wound in 1970. Although her career lasted just a little over a decade, she appeared in more than 40 movies and television shows. She was a versatile actress, guest-starring in crime dramas, including \"Perry Mason\" (1957–1966), starring Raymond Burr; \"M Squad\" (1957–1960), starring Lee Marvin; and \"77 Sunset Strip\" (1958–1964), starring Efrem Zimbalist, Jr.; as well as the long-running daytime drama \"General Hospital\" (beg. 1963). Craig made one guest appearance in THE RIFLEMAN, portraying Ann Bard in \"End of a Young Gun\" (episode 3). She also guest-starred in the westerns \"Annie Oakley\" (1954–1956), \"Tales of Wells Fargo\" (1957–1962), \"The Life and Legend of Wyatt Earp\" (1955–1961) and \"Laramie\" (1959–1963).\n\nRobert Crawford is an American film and television actor who has appeared in two dozen movies and television shows in a little more than a decade. He has often been credited as \"Bobby\" Crawford. A fairly versatile actor, Crawford has made guest appearances in the Disney family adventure series \"Zorro\" (1957–1959), starring Guy Williams; the crime drama \"Dragnet\" (1951–1959), starring Jack Webb; and the war drama \"Combat!\" (1962–1967), starring Vic Morrow. He also played a few recurring roles, including Andy Sherman in the western \"Laramie\" (1959–1963) and Detective Phil Burns in the crime drama \"Manhunt\" (1959–1961). Crawford guest-starred in three episodes of THE RIFLEMAN, portraying a schoolboy in \"Eight Hours to Die\" (episode 6), Bobby in \"The Gaucho\" (episode 14) and Freddy Toomey in \"The Second Witness\" (episode 23). He also made guest appearances in the westerns \"Rawhide\" (1959–1966), starring Clint Eastwood, \"Cheyenne\" (1955–1963) and \"Gunsmoke\" (1955–1975).\n\nDennis Cross made six appearances in THE RIFLEMAN, portraying Witcherly in \"The Safe Guard\" (episode 8), Ned Dunnell in \"The Gaucho,\" (episode 14), Lafe Oberly in \"The Patsy\" (episode 41), Dorn in \"The Hero\" (episode 59), Fance Degnan in \"The Vision\" (episode 66), and Martin in \"The Quiet Fear\" (episode 127). Cross studied acting on the G. I. bill at the Actors Lab in Hollywood. He later moved to New York, where he appeared in live television programas and commercials. He appeared in the Philco Television Playhouse show, \"A Trip To Bountiful,\" appearing with Lillian Gish, icon of the silent film era.\n\nRobert Culp was an American actor, screenwriter and director who had a prolific career spanning six decades. He also performed voice work. He began his career with the TV western \"Trackdown\" (1957–1959), in which he played Texas Ranger Hoby Gilman. His best-remembered film role was one of the title characters in the 1969 feature \"Bob & Carol & Ted & Alice,\" but he was better known for his work in television, especially for his roles portraying Kelly Robinson in the espionage adventure series \"I Spy\" (1965–1968) co-starring Bill Cosby; FBI agent Bill Maxwell in \"The Greatest American Hero\" (1981–1986); and Warren, Debra's father, in \"Everybody Loves Raymond\" (1996–2004). Culp appeared in two episodes of THE RIFLEMAN, portraying Colly Vane in \"The Hero\" (episode 59) and North Fork town hero Dave Foley in \"The Man from Salinas\" (episode 130). Culp also wr"}, {"url": "https://www.therifleman.net/program-history/", "page_content": "THE RIFLEMAN – Concept and Back Story\n\nWesterns were a popular genre when THE RIFLEMAN premiered in 1958. First telecast on Dick Powell's \"Zane Grey Theatre\" (CBS) on March 7, 1958, the pilot premiered on ABC in the regular television season on September 30 that same year. The show's creator, Arnold Laven, developed customized Winchester rifle, not a six gun, the main protagonist's signature firearm.\n\nThe opening credits showcasing the skill of Chuck Connors as Lucas McCain firing his rapid-action Winchester rifle set the tone for the western action adventure, to be sure, but the show aspired to be more than a vehicle for gratuitous gun-slinging. Heart-warming human relationships, specifically the kinship between father and son, provided balance, and sometimes a paradoxical juxtaposition, to the violent backdrop of life on the frontier. The rifle complemented Lucas McCain's persona as a self-possessed, rugged individualist who had high ethical standards and a cool head. Connors in the title role, with rifle at the ready, portrayed the iconic western hero – a crackerjack marksman and cowboy-turned-single-father and homesteader facing life's challenges with a stoical, reasoned view about social justice and personal responsibility. Uppermost in his mind was being a good role model for his son and a solid citizen in his community. So, when McCain picked up his rifle, he wielded it not only with confidence and competence, but also with rational deliberation and fair-minded determination. He admonished his young son in one episode, \"A man doesn't run from a fight, Mark, but that doesn't mean you go looking to run to one.\"\n\nFamily values and moral principles informed many storylines in THE RIFLEMAN series. Through the McCains' adventures with the townfolk of North Fork and the weekly influx of visitors, THE RIFLEMAN was a series of morality plays examining human nature's rich and varied complexity – with all its foibles and follies, sorrow and humor, venality and virtue. The inspiration for many episodes was drawn from Biblical parables, sometimes recapitulated explicity, such as the story of Job, which was related by Lucas to son Mark in the second episode, \"Home Ranch.\" Second chances – compassion and redemption – was a prominent, recurring theme. It was often elicited in episodes featuring Marshal Micah Torrance, played by Paul Fix, a sometime derelict, recovered alcholic, who was a regular character introduced in the fourth episode, \"The Marshal,\" after R.G. Armstrong, who played the sheriff in the pilot was killed off. The themes were timeless and universal, featuring sympathetic characters grappling with familiar human dilemmas and classic good-versus-evil conflicts.\n\nArnold Laven and series co-producers, Arthur Gardner and Jules V. Levy, presciently anticipated that the show's strength lay in the father-son relationship, and its best asset was the genuine filial affection between actors Chuck Connors as Lucas McCain and Johnny Crawford as Mark McCain. In fact, the depiction of a widowed father grappling with the challenges of raising a son alone in THE RIFLEMAN may have been a television first in its departure from the traditional depiction of a family as mother, father and child. Critics and viewers responded favorably to the novel family portrayal celebrating the father-son bond, and it appears to account for the enduring appeal of the series. In the June 20, 2004 issue of \"TV Guide,\" the character of Lucas McCain was ranked #32 in a list of the \"50 Greatest TV Dads of All Time.\" In 1959, at age 13, Johnny Crawford was nominated for an Emmy for his role in THE RIFLEMAN. Chuck Connors later remarked with admiration how young Johnny Crawford comported himself on THE RIFLEMAN set with deferential respect toward the crew, addressing them as \"sir\" and \"ma'am\" upon arriving to the set on his first day until departing on the last day."}, {"url": "https://aurorasginjoint.com/2016/04/10/the-rifleman-1958-1963/", "page_content": "I don’t remember how or when I first came across “The Rifleman,” but I saw plenty of repeats of the show during my childhood. I vividly remember being charmed by the unique Western with heart at its core and today I revisit it in honor of its star, Chuck Connors, who would have celebrated a birthday.\n\nAs a Western “The Rifleman” features characters and situations true to the genre, as well as what one would deem a typical 1880s frontier setting as depicted in many movies and so forth. The action in the series is also along the lines of standard\n\nWestern fare – gunfights, lawlessness, etc. – all of which is entertaining. But what makes “The Rifleman” a standout is the importance the show places on relationships, particularly the one between Lucas McCain aka The Rifleman and his son, Mark (Johnny Crawford).\n\nLucas McCain (Chuck Connors) is a widower struggling to raise his son amidst the backdrop of the Old West. As a homesteader, McCain lives on a small farm outside the New Mexico town of North Fork, but for all intents and purposes he serves as the town’s moral center and takes every opportunity to teach his son about human nature and its complexities. As such themes of redemption, forgiveness, judgment, character, fairness, sorrow and joy are woven beautifully into each episode of “The Rifleman.”\n\nLucas McCain: “Name callin’s a handy thing for some Mark. They smack a label on somebody or something and that’s it as far as they’re concerned. It’s kind of a special way of hating because they don’t take the trouble to understand.”\n\nMark McCain: “Well you have to put a label on some things, like say a pickle jar!”\n\nLucas McCain: “That’s right! But you be mighty sure there are pickles in that jar first! You see most times snap judgment can be cruel son.”\n\nLessons. Many important lessons. But that’s not to say that there isn’t more than enough action in “The Rifleman” to keep the most ardent fan of shoot-em-ups satisfied. One needs only to see the show’s opening sequence – one of the best – to recognize why McCain is given the famous moniker. Lucas McCain is an imposing figure to begin with Connor’s 6 ft 5 in. frame towering over everyone else in the show making the character’s physique match his strength of purpose. This is a man who walks the proud walk of the righteous. Add to all of that the souped-up rifle he carries around and you have one of the most memorable Western characters in all of television.\n\nLucas McCain: “You want to try your fast gun against my fast rifle?”\n\nIf the bad guys have any brains at all the answer to that question would always be “HELL, NO!” But bad guys are usually too self-centered, blinded by hatred or too power hungry to think clearly so The Rifleman is given ample opportunity to show his skill. We – as in even those of us who are not gun aficionados – are always thrilled when he does. I have to admit that McCain’s style – the firing the rifle from his hip, a position he gets into much faster than the (or my) eye can see – is always exciting. But again, true to the moral fiber of the man, it is a skill used only as a last resort, when absolutely necessary – another unique attribute of “The Rifleman.”\n\nLucas McCain: “A man doesn’t run from a fight, Mark…but that doesn’t mean you should go running *to* one, either.”\n\nThe pilot episode of “The Rifleman” titled “The Sharpshooter” was written by Sam Peckinpah intended as an episode of “Gunsmoke,” but the entry never came to fruition for that program. Instead, it ended up as an installment on CBS’ “Dick Powell’s Zane Grey Theater” in March 1958. In September of that same year “The Sharpshooter” aired on ABC as the inaugural episode of “The Rifleman,” beginning the show’s five-year run on the network.\n\nAnother great thing about this series, which is actually what makes classic TV shows enjoyable in general are the top names in entertainment that were a part of its roster – either as guest stars, recurring characters and/or directors. Names like Ida Lupino, Bud Boetticher, Arthur Hiller and Sam Peckinpah helmed the show throughout its run and a host of familiar faces guest starred. The show’s two main players, Connors and Johnny Crawford as Mark are exceptional. Connor’s McCain is one of TV’s greatest heroes and Crawford shows acting chops well beyond his years. Also enjoyable to watch is Paul Fix who plays Micah Torrance, the Marshall and McCain’s best friend who depends on him consistently to help keep order in North Fork.\n\nLucas McCain: “Everything must be done according to the law.”\n\nThose are just a few of the reasons why “The Rifleman” is likely to charm ya, ma’am. So giddy up and mozy on down and…OK, I’m gonna stop now."}, {"url": "https://www.aveleyman.com/ActorCredit.aspx?ActorID=14199", "page_content": "Mountain Road\n\nColonel Magnusson 1960\n\nAda\n\nTom De Paul - Committee Man 1961\n\nAdvise & Consent\n\nSenator Paul Hendershot\n\n(as William Quinn) 1962\n\nBirds\n\nFarm Hand 1963\n\nIt Happened at the World's Fair\n\nMan Leaving Dispensary 1963\n\nDark Intruder\n\nNeighbor 1965\n\nPenelope\n\nBank Executive (uncredited) 1966\n\nShakiest Gun in the West\n\nU.S. Marshal Arthur Bates 1968\n\nAce Eli and Rodger of the Skies\n\nMortician 1973\n\nSatan's School for Girls\n\nGardener 1973\n\nPsychic Killer\n\nGeorge, Hospital coroner 1975\n\nBustin' Loose\n\nJudge Antonio Runzuli 1981\n\nTwilight Zone\n\nMr Leo Conroy 1983"}, {"url": "https://astreetnearyou.org/person/155526/Rifleman-William-Quinn", "page_content": "× About this map\n\nContinue Latest update\n\nThis site was created in November 2018. In its first three days it saw over 240,000 visits, and to date has had over one million visitors.\n\nPreviously I posted an appeal for additional funds to cover hosting costs and I am hugely grateful to those who donated. If you want to contribute to the ongoing running of the site, I am of course happy to take This site was created in November 2018. In its first three days it saw over 240,000 visits, and to date has had over one million visitors. Read more about how it was created and its subsequent success Previously I posted an appeal for additional funds to cover hosting costs and I am hugely grateful to those who donated. If you want to contribute to the ongoing running of the site, I am of course happy to take donations towards the cost\n\nAbout\n\nWhilst this personal project started simply as an experiment to explore the local legacy of the First World War, but at a global scale, it has struck me that it is much more than that. At the heart of it is the legacy of those who died in the conflict, and especially the scale of the imapct that that would have had on their local communities, it would also never have been possible without the significant legacy created by those who remained, from the families who sent in photographs of their loved ones and which formed the Imperial War Museum's founding Bond of Sacrifice Collection, through the people who diligently compiled official records in the early 1920s and which formed the Commonwealth War Graves Commission's records, right up to the modern-day professionals, volounteers and individuals who have shaped these records, shared them, and also significantly increased and enriched them, especially under the guise of First World War Centenary projects like Lives of the First World War\n\nData and Sources\n\nThis project currently contains records for over one million men and women who died whilst serving in the First World War, with over 600,000 locations worldwide, tens of thousands of images, cemeteries, war memorials and much more. It simply wouldn't exist without the core assets that it draws on, enriched by additional information from and links to countless further sources.\n\nCore data sources - personal records and images\n\nLives of the First World War - IWM's unique project enabling everyone to share their information, stories and images to compile Life Stories \"on nearly 8 million men and women who served in uniform and worked on the home front\".\n\nCommonwealth War Graves Commission - a unique online collection of the details of every serviceman or woman. Many of the locations here are extracted from what they call the 'Additional information' field, which typically contains text such as \"Son of Samuel and Sarah Morley, of Derby; husband of F. M. Morley, of 113, Peel St., Ashbourne Rd., Derby.\". Note that this information was collected sevral years after the end of the war and it does not necessarily represent an address that the person had lived at.\n\nImperial War Museums Collections - one of the richest collections of First World War objects and images, most notably in this context the Bond of Sacrifice Collection and the Women's War Work Collection, togther comprising images of nearly 20,000 individuals who served\n\nCore data sources - war memorials\n\nWar Memorial Register - another unique record set from the Imperial War Museum, comprising records of over 78,000 memorials in the British Isles, together with listings of over one million names that appear on them.\n\nPlaces of Pride, the National Register of War Memorials (Australia) - over 1,000 records from across Australia, almost all having photographs and additional information\n\nNew South Wales War Memorials Register - The register includes over 3,500 memorials in total, with over 2,000 relating to the First World War. Each record has additional information and most have images. Many include lists of those commemorated\n\nNew Zealand Memorials Register - over 1,000 records from across New Zealand, typically with photographs and additional information\n\nCore data sources - portraits\n\nWith specific regards to the portrait images, these are primarliy, but not exclusively, from one of three sources - the incredible Bond of Sacrifice Collection, the Women's War Work Collection (both Imperial War Museums), or uploaded by volunteers and individuals to the Lives of the First World War site (which itself is run by IWM). I am grateful to them for making all these available under a non-commercial license. As an example of an additional image source, the Royal Welch Fusiliers Museum has provided over 2,000 portraits under an open license.\n\nAdditional information and statistics on the depth and breadth of sources\n\nAdditional credits - software and mapping resources\n\nContributing records, reporting errors\n\nThe data currently presented has all been extracted from official records or from user contributions to the Lives of the First World War site. I would strongly encourage anyone who wants to add further details to find the Life Story of the person and add details there, which can then in future be added to this site\n\nThe inherrent nature of historic records and using modern automated tools to extract information means there are bound to be issues. I will shortly be adding a 'report error' link to each record that can be used to flag an issue and will be queued up ready to be investigated and fixed. I'm afraid as this is a personal project created in my own time, I cannot respond to individual requests right now.\n\nContact\n\nFor information, questions and bug reports please contact James Morley @astreetnearyou | [email protected]"}], "William Quinn appeared in all 168 episodes of The Rifleman.": [{"url": "https://www.ranker.com/list/full-cast-of-the-rifleman-cast-list-for-the-show-the-rifleman/reference", "page_content": "The Rifleman cast list, including photos of the actors when available. This list includes all of the The Rifleman main actors and actresses, so if they are an integral part of the show you'll find them below. You can various bits of trivia about these The Rifleman stars, such as where the actor was born and what their year of birth is. This cast list of actors from The Rifleman focuses primarily on the main characters, but there may be a few actors who played smaller roles on The Rifleman that are on here as well.\n\nItems on this list include Chuck Connors and Lee Van Cleef\n\nIf you are wondering, \"Who are the actors from The Rifleman?\" or \"Who starred on The Rifleman?\" then this list will help you answer those questions.\n\nIn most cases you can click on the names of these popular The Rifleman actors and actresses to find out more information about them. If you're looking for a particular The Rifleman actor or actress, then type their name into the \"search\" bar to find them directly."}, {"url": "https://www.therifleman.net/program-history/", "page_content": "THE RIFLEMAN – Concept and Back Story\n\nWesterns were a popular genre when THE RIFLEMAN premiered in 1958. First telecast on Dick Powell's \"Zane Grey Theatre\" (CBS) on March 7, 1958, the pilot premiered on ABC in the regular television season on September 30 that same year. The show's creator, Arnold Laven, developed customized Winchester rifle, not a six gun, the main protagonist's signature firearm.\n\nThe opening credits showcasing the skill of Chuck Connors as Lucas McCain firing his rapid-action Winchester rifle set the tone for the western action adventure, to be sure, but the show aspired to be more than a vehicle for gratuitous gun-slinging. Heart-warming human relationships, specifically the kinship between father and son, provided balance, and sometimes a paradoxical juxtaposition, to the violent backdrop of life on the frontier. The rifle complemented Lucas McCain's persona as a self-possessed, rugged individualist who had high ethical standards and a cool head. Connors in the title role, with rifle at the ready, portrayed the iconic western hero – a crackerjack marksman and cowboy-turned-single-father and homesteader facing life's challenges with a stoical, reasoned view about social justice and personal responsibility. Uppermost in his mind was being a good role model for his son and a solid citizen in his community. So, when McCain picked up his rifle, he wielded it not only with confidence and competence, but also with rational deliberation and fair-minded determination. He admonished his young son in one episode, \"A man doesn't run from a fight, Mark, but that doesn't mean you go looking to run to one.\"\n\nFamily values and moral principles informed many storylines in THE RIFLEMAN series. Through the McCains' adventures with the townfolk of North Fork and the weekly influx of visitors, THE RIFLEMAN was a series of morality plays examining human nature's rich and varied complexity – with all its foibles and follies, sorrow and humor, venality and virtue. The inspiration for many episodes was drawn from Biblical parables, sometimes recapitulated explicity, such as the story of Job, which was related by Lucas to son Mark in the second episode, \"Home Ranch.\" Second chances – compassion and redemption – was a prominent, recurring theme. It was often elicited in episodes featuring Marshal Micah Torrance, played by Paul Fix, a sometime derelict, recovered alcholic, who was a regular character introduced in the fourth episode, \"The Marshal,\" after R.G. Armstrong, who played the sheriff in the pilot was killed off. The themes were timeless and universal, featuring sympathetic characters grappling with familiar human dilemmas and classic good-versus-evil conflicts.\n\nArnold Laven and series co-producers, Arthur Gardner and Jules V. Levy, presciently anticipated that the show's strength lay in the father-son relationship, and its best asset was the genuine filial affection between actors Chuck Connors as Lucas McCain and Johnny Crawford as Mark McCain. In fact, the depiction of a widowed father grappling with the challenges of raising a son alone in THE RIFLEMAN may have been a television first in its departure from the traditional depiction of a family as mother, father and child. Critics and viewers responded favorably to the novel family portrayal celebrating the father-son bond, and it appears to account for the enduring appeal of the series. In the June 20, 2004 issue of \"TV Guide,\" the character of Lucas McCain was ranked #32 in a list of the \"50 Greatest TV Dads of All Time.\" In 1959, at age 13, Johnny Crawford was nominated for an Emmy for his role in THE RIFLEMAN. Chuck Connors later remarked with admiration how young Johnny Crawford comported himself on THE RIFLEMAN set with deferential respect toward the crew, addressing them as \"sir\" and \"ma'am\" upon arriving to the set on his first day until departing on the last day."}, {"url": "https://www.tvguide.com/tvshows/the-rifleman/cast/1030223317/", "page_content": "Join or Sign In\n\nSign in to customize your TV listings\n\nContinue with Facebook\n\nContinue with email\n\nBy joining TV Guide, you agree to our Terms of Use and acknowledge the data practices in our Privacy Policy."}, {"url": "https://www.therifleman.net/episodes?episode=108", "page_content": "The Lonesome BrideEpisode 108Writer: Arthur Browne, Jr.Director: Otto LangOriginal Air Date 05/02/1961Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nLincoln Demyan as Kelly Banner\n\nLincoln Demyan, born George Lincoln Demyan, was an American film and television actor. He appeared in nearly 30 movies and television shows in a little over a decade. He guest-starred in a number of iconic TV shows, including the popular fantasy comedy \"I Dream of Jeannie\" (1965–1970), starring Barbara Eden, Larry Hagman and Bill Daly; Gene Roddenberry's outer space classic \"Star Trek\" (1966–1969), starring William Shatner and Leonard Nemoy; and the action-adventure series \"Kung Fu\" (1972–1975), starring David Carradine as a Shaolin Monk roaming the Old West. Demyan made one guest appearance in THE RIFLEMAN, portraying Kelly Banner in \"The Lonesome Bride\" (episode 108). It was his first television appearance. Demyan guest-starred in several other westerns, including \"Gunsmoke\" (1955–1975), starring James Arness, \"Branded\" (1965–1966), starring THE RIFLEMAN'S own Chuck Connors; \"Bonanza\" (1959–1973), starring Lorne Greene, Pernell Roberts, Dan Blocker and Micahel Landon; \"The Big Valley\" (1965–1969), starring Barbara Stanwyck; and \"The Virginian\" (1962–1971), starring James Drury and Doug McClure.\n\nKay E. Kuter as Charve Banner\n\nKay E. Kuter, born Kay Edwin Emmert Kuter, was an American actor who worked in film, stage and television. His filmography lists more than 120 movies and television credits in a career spanning 50 years. Born into a show business family, his father was pioneer art director Leo \"K\" Kuter and his mother was silent screen actress Evelyn Edler. After he graduated from Carnegie Mellon University, Kuter began acting and directed more than 50 plays. He was typecast as a heavy and was known for his distinctive beard. He guest-starred in many popular shows of the 1950s through the 90s, including the Disney adventure series \"Zorro\" (1957–1959), the family comedy \"Mister Ed\" (1958–1966), the action series \"The Wild Wild West\" (1965–1969), the family comedy \"I Dream of Jeannie\" (1965–1970), the western adventure series \"Kung Fu\" (1972–1975), Rod Serling's iconic anthology series, \"The Twilight Zone\" (1959–1964) and the sci-fi series \"Star Trek: The Next Generation\" (1987–1994). He also had a recurring role as Newt Kiley in the comedy series \"Petticoat Junction\" (1963–1970) and \"Green Acres\" (1965–1970). Kuter also worked as a voice actor, and among his many roles, provided the voices for Grimsby in \"The Little Mermaid II: Return to the Sea\" (2000); Griswold Goodsoup and Dockmaster Velasco in the acclaimed adventure games \"The Curse of Monkey Island\" (1997) and \"Grim Fandango\" (1998), respectively. Kuter made two appearances in THE RIFLEMAN, portraying Rafe Coleman in \"Sins of the Father\" (episode 70) and Charve Banner in \"The Lonesome Bride\" (episode 108). He guest-starred in several other westerns, including \"Tales of Wells Fargo\" (1957–1962), starring Dale Robertson, \"Bonanza\" (1959–1973), starring Lorne Greene, Michael Landon, Dan Blocker and Pernell Roberts, \"The Virginian\" (1962–1971), starring James Drury, and \"Gunsmoke\" (1955–1975), starring James Arness.\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nJoan Shawlee as Mary Woodson\n\nJoan Shawlee, also credited as Joan Fulton, was an American film and television actress. She apppeared in nearly 100 movies and television shows during a career spanning 40 years. She had roles in several memorable films, including Sylvia Hunter in the comedy \"Buck Privates Come Home\" (1947), starring Bud Abbott and Lou Costello; Sweet Sue in the comedy \"Some Like It Hot\" (1959), starring Marilyn Monroe, Tony Curtis and Jack Lemmon; Sylvia in the romantic comedy \"The Apartment\" (1960), starring Jack Lemmon, Shirley MacLaine and Fred MacMurray; and Amazon Annie in the horror film \"Willard\" (1971), starring Bruce Davison, Elsa Lanchester and Sondra Locke; as well as minor parts in the musical drama \"A Star Is Born\" (1954), starring Judy Garland and James Mason, and the crime thriller \"Farewell, My Lovely\" (1975), starring Robert Mitchum, Charlotte Rampling, John Ireland and Sylvia Miles. Shawlee guest-starred in a few popular television shows of the 1950s through the 70s, including the Disney adventure series \"Zorro\" (1957–1959), the comedy \"Hazel\" (1961–1966), the crime drama \"Adam-12\" (1968–1975), the crime drama \"Mannix\" (1967–1975), the crime drama anthology series \"Police Story\" (1973–1977) and the cop thriller \"Starsky and Hutch\" (1975–1979). She made one appearance in THE RIFLEMAN, portraying Mary Woodson in \"Lonesome Bride\" (episode 108). She also guest-starred in the western \"Maverick\" (1957–1962), starring Jack Kelly and James Garner.\n\nJoan Taylor as Milly Scott, Owner of the General Store\n\nJoan Taylor was an American actress born to a family in the entertainment business. Her mother, Amelia Berky, was a vaudeville dancer and singer in the 1920s. Her father operated a movie theater, which inspired in her an abiding interest in the movies from an early age. Taylor came to Hollywood in 1946 and worked on the stage at the Pasadena Playhouse for four years. Discovered by Victor Jory when she played Regina in \"Another Part of the Forest,\" she was contracted to Paramount Studios where she appeared in several Western pictures. She guest-starred in numerous television series in the 1950s and early 60s, retiring from acting in 1962. Taylor appeared in 18 episodes of THE RIFLEMAN between 1960 and 1962, playing Milly Scott, Owner of the General Store, which she bought from Hattie Denton. An attractive young woman who figured as a love interest for Lucas McCain, her character was introduced in \"Miss Milly\" (episode 84).\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=126", "page_content": "GunfireEpisode 126Writer: Arthur Browne, Jr.Director: Richard DonnerOriginal Air Date 01/15/1962Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nWilliam Bryant as Karl Hollis\n\nWilliam Bryant was an American actor who appeared in over 200 film and television roles in a career spanning 45 years. He made four guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played Sandy in \"The Apprentice Sheriff\" (episode 11), Jerry in \"Shivaree\" (episode 19), Karl Hollis in \"Gunfire\" (episode 126), and Trooper Coley in \"The Assailants\" (episode 149).\n\nLon Chaney, Jr. as Charlie Gordo\n\nLon Chaney, Jr., born Creighton Tull Chaney, was an American character actor whose filmography includes nearly 200 acting credits in a career spanning seven decades. He is best-known for being the son of silent film star Lon Chaney and his many roles in monster movies. He is the only actor to have portrayed all of the classic movie monsters: the title role in \"The Wolf Man\" (1941), Frankenstein's monster in \"The Ghost of Frankenstein\" (1942), a mummy in \"The Mummy's Tomb\" (1942) and a vampire in \"Son of Dracula\" (1943). Chaney was memorialized for his most iconic role, the Wolf Man, in a 1997 edition of US postage stamps. Chaney appeared in a small number of television shows in the 1950s, including a recurring role as Chingachgook in \"Hawkeye and the Last of the Mohicans\" (1957). He made one appearance in THE RIFLEMAN, portraying Charlie Gordo in \"Gunfire\" (episode 126).\n\nRoss Elliott as Ben Johnson\n\nRoss Elliott was a prolific American film and television actor. He appeared in more than 200 movies and television shows in a career spanning more than 40 years. Elliott was a remarkably versatile actor, guest-starring in most popular genres, including the classic family comedies \"I Love Lucy\" (1951–1957), \"Leave It to Beaver\" (1957–1963), and \"The Andy Griffith Show\" (1960–1968), in addition to the crime dramas \"Perry Mason\" (1957–1966) and \"Ironside\" (1967–1975) both starring Raymond Burr, \"Richard Diamond: Private Detective\" (1957–1960), starring David Janssen, as well as \"Adventures of Superman\" (1952–1958), starring George Reeves, the gothic horror series \"Thriller\" (1960–1962), starring Boris Karloff, the mystery action series \"Peter Gunn\" (1958–1961), starring Craig Stevens, the nautical action-adventure series, \"Sea Hunt\" (1958–1961), starring Lloyd Bridges as an intrepid scuba diver, Rod Serling's iconic anthology series, \"The Twilight Zone\" (1959–1964), the adventure series \"The Fugitive\" (1963–1967), starring David Janssen, the war drama \"Combat!\" (1962–1967), starring Vic Morrow as Sgt. Saunders, the espionage thriller \"Mission: Impossible\" (1966–1973), starring Peter Graves, and the classic family drama \"Little House on the Prairie\" (1974–1983), directed by Michael Landon and starring Melissa Gilbert. Elliott made one appearance in THE RIFLEMAN, portraying Ben Johnson in \"Gunfire\" (episode 126). In addition to THE RIFLEMAN, he guest-starred in virtually all of the other major westerns, including \"The Lone Ranger\" (1949–1957), starring Clayton Moore, \"The Life and Legend of Wyatt Earp\" (1955–1961), starring Hugh O'Brian, \"Maverick\" (1957–1962), starring James Garner, \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen, \"Cheyenne\" (1955–1963), starring Clint Walker, \"Wagon Train\" (1957–1965), starring Frank McGrath, \"Rawhide\" (1959–1966), starring Clint Eastwood, \"Bonanza\" (1959–1973), starring Lorne Greene, Dan Blocker and Michael Landon, and also \"Gunsmoke\" (1955–1975), starring James Arness.\n\nJoe Higgins as Nils Swenson\n\nJoe Higgins was an American actor working primarily in television and commercials from the 1960's through the 1980's. His acting career began at age nine and while attending the University of Dayton in Ohio, he worked in radio. He became a prolific character actor who often portrayed a sheriff in commercials, public service announcements and in print ads. He won the CLIO award on two occasions for his acting in commercials. His portrayal as a sheriff, \"You in a heap o' trouble, boy!,\" in a series of memorable Dodge car commercials in the 1970's became his iconic signature role. Higgins appeared in four episodes of THE RIFLEMAN playing different characters, and he played the semi-regular character, Nils Swenson, the Blacksmith, in 16 episodes. He played recurring roles on other television series in addition to THE RIFLEMAN, including \"Arrest and Trial\" and later, he co-starred again with Chuck Connors in \"Flipper\" and \"Geronimo.\"\n\nPreston Price as Stagecoach Driver\n\nPreston Price made one appearance in THE RIFLEMAN, portraying the stagecoach driver in \"Gun Fire\" (episode 126).\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nGrant Richards as Dave Chester\n\nGrant Richards was an American actor whose career spanned the 1930's through the early 1960's. He had numerous television credits and was a voice-over regular on the popular 1930's radio series \"Gangbusters,\" which featured weekly episodes based on actual crime incidents. Each program ended with various descriptions of wanted criminals, many of whom were later arrested due to avid listener participation. Richards appeared in three episodes of THE RIFLEMAN, portraying Reed Barns in \"The Apprentice Sheriff\" (episode 11), Dave Chester in \"Gunfire\" (episode 126), and John Keeler in \"Tinhorn\" (episode 134).\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=42", "page_content": "BloodlinesEpisode 42Writer: Arthur Browne, Jr.Director: Arthur HillerOriginal Air Date 10/06/1959Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nChristopher Dark as Ben\n\nChristopher Dark, born Alfred Francis DeLeo, was a prolific American film and television actor. He appeared in 115 movies and television shows in a career spanning more than 20 years. He appeared primarily in westerns and crime dramas, including \"Cavalcade of America\" (1952–1957); the short-lived series \"Code 3\" (1957), in which he had a recurring role as Sgt. Zevala; \"Richard Diamond, Private Detective\" (1957–1960), starring David Janssen; the courtroom drama \"Perry Mason\" (1957–1966), starring Raymond Burr; \"77 Sunset Strip\" (1958–1964); and \"The Untouchables\" (1959–1963), starring Robert Stack. He also appeared in the action-adventure series \"Sea Hunt\" (1959–1961), starring Lloyd Bridges; the war drama \"Combat!\" (1962–1967), starring Vic Morrow; and \"The Green Hornet\" (1966–1967), starring Bruce Lee as Kato. Dark made one guest appearance in THE RIFLEMAN, portraying Ben Malakie in \"Bloodlines\" (episode 42). He also guest-starred in many of the other major westerns, including \"Hopalong Cassidy\" (1952–1954); \"The Long Ranger\" (1949–1957), starring Clayton Moore; \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen; \"Laramie\" (1959–1963), starring John Smith and Robert Fuller; \"Gunsmoke\" (1955–1975), starring James Arness; \"Rawhide\" (1959–1966), starring Clint Eastwood; \"Bonanza\" (1959–1973), starring Lorne Greene, Dan Blocker, Pernell Roberts and Michael Landon; and \"The Virginian\" (1962–1971), starring James Drury and Doug McClure.\n\nJohn Durren as Stump Malakie\n\nJohn Durren is an American film and television actor. He has appeared in more than 50 movies and television shows in a career spanning nearly 40 years. He has guest-starred in many of the popular shows of the 1950s through the 90s, including the courtroom crime drama \"Perry Mason\" (1957–1966), starring Raymond Burr; the family comedy \"Dennis the Menace\" (1959–1963), starring Jay North in the title role; the action-adventure series \"The Fugitive\" (1963–1967), starring David Janssen as a wrongly convicted doctor on the run; the detective drama \"Kojak\" (1973–1978), starring Telly Savalas in the title role; the war satire \"M*A*S*H*\" (1972–1983), starring an ensemble cast led by Alan Alda, Wayne Rogers, Loretta Swit, Larry Linville, Harry Morgan and MacLean Stevenson; and the action-adventure series \"The New Adventures of Wonder Woman\" (1975–1979), starring Lynda Carter as Wonder Woman. Durren made his first television appearance in THE RIFLEMAN, portraying Davey Pardee in \"The Challenge\" (episode 28) and Stump Malakie in \"Bloodlines\" (episode 42). He also guest-starred in the westerns \"Rawhide\" (1959–1966), starring Clint Eastwood, and \"Cheyenne\" (1955–1963), starring Clint Walker.\n\nBuddy Hackett as Daniel Malakie\n\nBuddy Hackett, born Leonard Hacker, was an American stage, film, voice and television actor; however, he is best-remembered for his work as a comedian. He appeared in nearly 50 movies and television shows in a career spanning just over 50 years. Hackett became interested in acting during his high school years, after directing a school production entitled \"What a Life.\" After serving in the army during World War II, he ventured into the entertainment industry as a stand-up comic, playing at venues from the Catskills to Las Vegas and Los Angeles. He and Lenny Bruce are credited with pioneering \"blue\" comedy. Their acts were built around adult humor and off-color jokes that were tame compared against later generations of comics. After a rough start with a string of unsuccessful east coast stints, Hackett went on to become so successful that he could be the headliner at any major nightclub in the US. He became well-known to mainstream America with his many appearances on late night talk shows hosted by Jack Paar, Arthur Godfrey, and later Johnny Carson. He also was a frequent guest on the game shows \"What's My Line\" and \"Hollywood Squares.\" Having a gift for physical humor, with a rubbery face and doughy physique, Hackett was typecast as clownish characters. His performances on stage and in film often were the most memorable feature in otherwise forgettable productions. His performance, for example, portraying a Coney Island soothsayer in the play \"I Had a Ball\" (1964) transformed it from a critical failure into a box office success. Seeing Hackett play serious roles did not resonate with audiences, so most of his movie and TV credits are for comedy-themed productions. His film credits include the racy humor-tinged film adaptation of \"God's Little Acre\" (1958), the animated adventure \"The Wonderful World of the Brothers Grimm\" (1962), the musical comedy \"The Music Man\" (1962), and the madcap action-adventure film \"It's a Mad, Mad, Mad, Mad World\" (1963). He also lent his voice to Scuttle in \"The Little Mermaid\" (1989). In television, Hackett played the title role in the short-lived sitcom \"Stanley\" (1956–1957), co-starring Carol Burnett, and toward the end of his career, he played the recurring role of Uncle Lonnie in the comedy drama \"Action\" (1999–2000), starring Jay Mohr. He made occasional appearances in popular shows over four decades, from the 1950s through the 90s, including the western \"The Big Valley\" (1965–1969), starring Barbara Stanwyck, Richard Long and Lee Majors, the Buck Henry comedy spy spoof \"Get Smart\" (1965–1970), starring Don Adams and Barbara Feldman, the comedy variety show \"Rowan & Martin's Laugh-In\" (1967–1973), the action-adventure \"The Fall Guy\" (1981–1986), starring Lee Majors, the mystery whodunit \"Murder, She Wrote\" (1984–1996), starring Angela Lansbury, and many other shows. Hackett made two appearances in THE RIFLEMAN, portraying Daniel \"Pop\" Malakie in \"BloodLines\" (episode 42) and the title character in \"The Clarence Bibs Story\" (episode 104).\n\nWarren Oates as Jud Malackie\n\nWarren Oates was an American actor who began his acting career in 1957, starring in a live New York production of the television series \"Studio One.\" He moved to Los Angeles and appeared in numerous television western series. Oates made four appearances in THE RIFLEMAN, portraying Andrew Shelton in \"The Marshal\" (episode 4), Jud Malackie in \"Bloodlines\" (episode 42), Santos in \"The Prodigal\" (episode 71), Marty Ryan in \"Miss Milly\" (episode 84), Will Breen in \"Day of Reckoning\" (episode 139). He met Sam Peckinpah working on THE RIFLEMAN, which began a collaborative relationship on later film projects. He was a prolific actor best-known for his roles in the Peckinpah classics, \"The Wild Bunch\" (1969) and \"Bring Me the Head of Alfredo Garcia\" (1974). His most critically acclaimed role was playing GTO in the 1971 Monte Hellman cult classic \"Two-Lane Blacktop.\" Oates passed away in 1983 and a decade later, in 1993, Tom Thurman produced a documentary tribute film honoring his career, \"Warren Oates: Across the Border.\"\n\nDenver Pyle as Henry Trumble\n\nDenver Pyle appeared in five episodes of THE RIFLEMAN, portraying Henry Trumble in \"Bloodlines\" (episode 42), Seth Mitchell in \"Legacy\" (episode 51), Harold Tenner in \"The Hangman\" (episode 76), George Tanner in \"The Clarence Bibs Story\" (episodes 104), and Frank Hazlitt in \"The Decision\" (episode 116). Pyle was a highly recognizable character actor who worked in film and television, mostly in the 1950's through 1970's. Frequently cast in westerns, he appeared in two classic John Ford films,\"The Horse Soldiers,\" with William Holden, and \"The Man Who Shot Liberty Valance.\" Pyle played recurring characters in several television series, including the role of Mad Jack in \"The Life and Times of Grizzly Adams\" (1977-1978; 36 episodes), Buck Webb, Doris Day's father, during the first two seasons of \"The Doris Day Show\" (1968-1970), and Briscoe Darling on The Andy Griffith Show. Pyle's best-known television role may have been the hillbilly, Uncle Jesse Duke, in \"The Dukes of Hazzard\" (1979-1985; 146 episodes). In later life, Pyle made cameo appearances, notably 1994's \"Maverick,\" with Mel Gibson and Jodie Foster, and the original Maverick, James Garner.\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nRhys Williams as Doc Burrage\n\nRhys Williams was a Welsh character actor in movies and television, whose career spanned the 1940's through 1970. He made his film debut in \"How Green Was My Valley\" (1941). Rural Wales was the setting of this John Ford classic film, and it featured a large cast of Welsh characters; although, it was actually filmed in Hollywood with American, Irish and Scottish actors. Williams, who was the only genuine Welshman in the cast, originally was hired as a dialect coach for the other actors, but director John Ford gave Williams a role in the film. Williams is recognizable to fans of the television series \"Adventures of Superman,\" in which he played a sadistic character in one of the show's early episodes, \"The Evil Three.\" Other television appearances included CBS's anthology series, \"The DuPont Show with June Allyson,\" co-starring Steve Allen in the 1960 episode \"Play Acting,\" and five episodes of General Electric Theater between 1956 and 1961. Williams also appeared in \"The Donna Reed Show\" (1958), \"Temple Houston\" (1963), \"77 Sunset Strip\" (1964), \"Twelve O'Clock High\" (1964-1966), \"The F.B.I.\" (1966), \"The Wild Wild West\" (1966), \"Mission Impossible\" (1967), the \"Andy Griffith Show\" (1967), \"Mannix\" (1969), \"Here Comes the Brides\" (1969), among many other shows. Williams appeared in six episodes of THE RIFLEMAN, one of six actors to portray the regular character, Doc Burrage. He appeared in \"Blood Brothers\" (episode 35), \"Bloodlines\" (episode 42), \"Letter of the Law\" (episode 50), \"A Case of Identity\" (episode 57), \"Sins of the Father\" (episode 70), and \"The Prodigal\" (episode 71).\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=153", "page_content": "Gun ShyEpisode 153Writer: Cyril HumeDirector: Arthur NadelOriginal Air Date 12/10/1962Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nPatricia Blair as Lou Mallory, Owner of the General Store and the Madera House Hotel\n\nPatricia Blair was an American television actress whose career was active primarily in the 1950s and 1960s. The Texas-born beauty began her career as a teenage model who went on to apprentice in summer stock before being discovered by Warner Bros. She began acting in films under the names Patricia Blake and Pat Blake. She appeared in a few films, including \"Jump Into Hell\" (1955), \"Crime Against Joe\" (1956) and \"The Black Sleep\" (1956), which reunited screen icons of the horror film genre Bela Lugosi, Lon Chaney Jr., Basil Rathbone and John Carradine. She also appeared in the suspense thriller \"City of Fear\" (1959), starring Vince Edwards. She portrayed the Fashion Narrator in the Robert Redford romantic western \"The Electric Horseman\" (1979), co-starring Jane Fonda. In 1962, Blair replaced actress Joan Taylor in a semi-regular role as Lou Mallory, Chuck Connor's love interest in the last season of THE RIFLEMAN. Blair played the attractive red-haired, fiery Irish businesswoman, whose character was savvy Landowner and Owner of the General Store and the Madera House Hotel. Blair's character of Lou Mallory appeared in 17 episodes of THE RIFLEMAN; she debuted in the title role of episode 145. Blair also made guest television appearances on \"The Bob Cummings Show\" (1955–1959), \"The Virginian\" (1962–1971), \"Perry Mason\" (1957–1966), \"Bonanza\" (1959–1973), and she co-starred in \"Daniel Boone\" (1964–1970), playing wife Rebecca Boone opposite Fess Parker. She also had a recurring role as Goldy in the western adventure series \"Yancy Derringer\" (1958–1959).\n\nJimmy Carter as Charlie\n\nJimmy Carter was an American film and television actor who had a short career of just five years. While attending Mark Keppel High School, he and a friend formed the band \"4 Below Zero,\" and in 1967, the band released the song \"It's Sally's Birthday Today\" on DoubleShot Records. He also did an album with Barry Manilow in the late 70s. During his brief stint as an actor, Jimmy appeared in 12 television shows and one movie, including some of the most popular TV series of the 1950s and 60s. He guest-starred in the crime drama \"The Lawless Years\" (1959–1961), \"Route 66\" (1960–1964), \"Leave It to Beaver\" (1957–1963) and the long-running western series, \"Bonanza\" (1959–1973). He also appeared in the movie \"The Jayhawkers\" (1959), playing the character Paul Dubois. Carter made one guest appearance in THE RIFLEMAN, portraying Charley in \"Gun Shy\" (episode 153).\n\nPat Goldin as Fitch, the Dress Salesman\n\nPat Goldin was a Russian-born television and film actor. He appeared in nearly 50 movies and television shows in a career spanning almost 25 years. Many of his early roles were in films, which were mostly uncredited bit parts. Among his television credits were roles in the crime dramas \"Dragnet\" (1951–1959), starring Jack Webb and \"Perry Mason\" (1957–1966), starring Raymond Burr, and the quirky comedy \"The Many Loves of Dobie Gillis\" (1959–1963), starring Dwayne Hickman and Bob Denver, as well as a handful of other obscure series. Goldin made one appearance in THE RIFLEMAN, portraying Fitch the dress salesman in \"Gun Shy\" (episode 153).\n\nBob Hall as the Minister\n\nBob Hall, sometimes credited as Bob Hull, is an American television and film actor. He has appeared in five movies and television shows in a decade-long career. He guest-starred in one of the last major anthology series, \"Bob Hope Presents the Chrysler Theatre\" (1963–1967). He also portrayed Johnson in the western film \"Shalako\" (1968), starring Sean Connery and Brigitte Bardot. Hall made one appearance in THE RIFLEMAN, portraying the minister in \"Gun Shy\" (episode 153). He also guest-starred in the western \"Branded\" (1965–1966), starring THE RIFLEMAN's Chuck Connors.\n\nJay Nelson as the Stage Owner/Driver\n\nJay Nelson made one appearance in THE RIFLEMAN, portraying the stagecoach driver in \"Gun Shy\" (episode 153).\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nDarryl Richard as Fred\n\nDarryl Richard was an American television actor. He appeared in 14 television shows in just over a decade. He guest-starred in several popular shows, including \"The Phil Silvers Show\" (1956–1959), Rod Serling's anthology series, \"The Twilight Zone\" (1959–1964), and the popular family comedy \"The Donna Reed Show\" (1958–1966), in which he played the recurring role of Smitty. Richard made one appearance in THE RIFLEMAN, portraying Fred in \"Gun Shy\" (episode 153).\n\nPeter Whitney as Vantine\n\nPeter Whitney was an American television and film actor whose large frame and heavy-set, swarthy appearance brought him many roles playing villainous characters in his early career. Later, as a character actor, he made frequent appearances in television series, particularly the western genre. Among his film credits, he appeared in \"In the Heat of the Night\" (1967), \"The Great Bank Robbery\" (1969), and \"The Ballad of Cable Hogue\" (1970). Whitney made nine appearances in THE RIFLEMAN, portraying Tracey Blanch in \"Eddie's Daughter\" (episode 46), John Jupiter in \"Mail Order Groom\" (episode 56), Andrew Bechtel in \"Heller\" (episode 62), Otto Drosheck in \"Strange Town\" (episode 81), Vince Fergus in \"The Queue\" (episode 110), John Holliver in \"Long Gun from Tucson\" (episode 121), Neb Jackman in 'Lou Mallory\" (episode 145) and \"Which Way Did They Go?\" (episode 167), and Vantine in \"Gun Shy\" (episode 153).\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=78", "page_content": "The Woman from Hog RidgeEpisode 78Writer: Calvin J. ClementsDirector: William ClaxtonOriginal Air Date 10/04/1960Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nLane Bradford as Martin\n\nLane Bradford was an American television and film actor. He appeared in more than 250 movies and television shows in a career spanning nearly 35 years. A familiar face in western B movies and television series, many of his film roles in the 1940s and 50s were uncredited. Bradford made his television debut in the crime drama series \"Craig Kennedy, Criminologist\" (1952). He also appeared in \"The Untouchables\" (1959–1963) and \"Perry Mason\" (1957–1966). Bradford guest-starred in most of the major western series of the 1950s and 60s, appearing mulitple times in many of them, including \"The Lone Ranger\" (1949–1957), \"The Adventures of Rin Tin Tin\" (1954–1959), \"Have Gun – Will Travel\" (1957–1963), \"Wagon Train\" (1957–1965), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Cheyenne\" (1955–1963) \"Bonanza\" (1959–1973), and \"Gunsmoke\" (1955–1975). He made one appearance in THE RIFLEMAN, portraying Martin in \"Woman from Hog Ridge\" (episode 78).\n\nRobert F. Hoy as Lester\n\nRobert \"Bobby\" F. Hoy was an American film and television actor, as well as a director and stuntman. He appeared in more than 160 movies and television shows during a career spanning nearly 60 years. After serving in the United States Marines during World War II, Hoy decided to pursue a career in show business. He worked as a stunt double for many acclaimed actors, including Charles Bronson, Tony Curtis, Audie Murphy, Tyrone Power, Jay Silverheels and David Janssen. In 1961, Hoy co-founded the Stuntmen's Association of Motion Pictures. Hoy appeared in numerous films, often playing minor parts or doing stunt work, including the musical drama \"A Star Is Born\" (1954), starring Judy Garland and James Mason; the biographical war drama \"To Hell and Back\" (1955), starring Audie Murphy; Stanley Kubrick's film adaptation of \"Spartacus\" (1960), starring Kirk Douglas, Laurence Olivier and Jean Simmons; the Blake Edwards adventure comedy \"The Great Race\" (1965), starring Tony Curtis, Jack Lemmon and Natalie Wood; the westerns \"Nevada Smith\" (1966), starring Steve McQueen, and \"The Gambler: The Adventure Continues\" (1983), starring Kenny Rogers, as well as William A. Frakers \"The Legend of the Lone Ranger\" (1981). He appeared in several Clint Eastwood pictures, including \"The Outlaw Josey Wales\" and \"The Enforcer\" (both 1976) and \"Bronco Billy\" (1980) Hoy guest-starred in many popular television shows, including the action adventure \"Sea Hunt\" (1958–1961), the anthology series \"Walt Disney's Wonderful World of Color\" (1954–1990), the crime drama \"The Untouchables\" (1959–1963), the war drama \"Combat!\" (1962–1967), the espionage thrillers \"The Man from U.N.C.L.E.\" (1964–1968) and \"Mission: Impossible\" (1966–1973), the science fiction cult classic \"Star Trek\" (1966–1969), the western action adventure \"Kung Fu\" (1972–1975), the police drama \"The Streets of San Francisco\" (1972–1977), the Aaron Spelling fantasy series \"Fantasy Island\" (1977–1984), the medical mystery \"Quincy M.E.\" (1976–1983), the family drama \"Little House on the Prairie\" (1974–1983) and the primetime drama \"Dallas\" (1978–1991). Hoy's most famous role was the recurring character of Joe Butler in the western series \"The High Chaparral\" (1967–1971). He made three appearances in THE RIFLEMAN, portraying Lester in \"Woman from Hog Ridge\" (episode 78), Dabbs in \"The Promoter\" (episode 87) and a member of Wade's gang in \"Which Way Did They Go?\" (episode 167). He guest-starred in many other westerns, the genre for which he was best-known and most fondly remembered, including \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone; \"Zane Grey Theater\" (1956–1961), starring Dick Powell; \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen; \"Bat Masterson\" (1958–1961), starring Gene Barry; \"Branded\" (1965–1966), starring THE RIFLEMAN's Chuck Connors; and \"Bonanza\" (1959–1973), starring Lorne Greene, Michael Landon, Dan Blocker and Pernell Roberts. Toward the end of his life, Hoy was honored with a Golden Boot Award by the Motion Picture and Television Fund for making significant contributions to the western genre. He made his final television appearance in the crime drama \"NCIS\" (2003– ).\n\nJim Hurst as Sylvester\n\nJim Hurst appeared in six television shows in five years. He guest-starred in the private detective series \"77 Sunset Strip\" (1958–1964) and made one appearance in THE RIFLEMAN, portraying Sylvester in \"Woman From Hog Ridge\" (episode 78). He guest-starred in a few other westerns, including \"Bronco\" (1958–1962), starring Ty Hardin; \"Cheyenne\" (1955–1963), starring Clint Walker; \"The Virginian\" (1962–1971), starring James Drury; and \"Branded\" (1965–1966), starring THE RIFLEMAN's Chuck Connors.\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nJan Stine as Johnny\n\nJan Stine, born Jan Russell Stine, was an American actor who primarily worked in television. He appeared in nearly 30 movies and television shows during his brief career. He guest-starred in several popular shows of the 1950s and 60s, including the comedy \"The Real McCoys\" (1957–1963), the family comedy \"The Many Loves of Dobie Gillis\" (1959–1963), the legal drama \"Perry Mason\" (1957–1966) and the long-running family drama \"Lassie\" (1954–1974). Stine made two appearances in THE RIFLEMAN, portraying Johnny in \"Woman from Hog Ridge\" (episode 78) and Gorwin Morgan in \"The High Country\" (episode 122). He guest-starred in a few other westerns, including \"Zane Grey Theater\" (1956–1961), starring Dick Powell; \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen; and \"The Virginian\" (1962–1971), starring James Drury.\n\nCharles Tannen as Josh Moore, Storekeeper at the Hardware Store\n\nCharles Tannen, born Charles David Tannen, was an American television and film actor who appeared in more than 200 movies and television shows during his 30-year career. He had uncredited roles in numerous films, including the romantic drama \"The Dark Angel\" (1935), starring Fredric March and Merle Oberon; the biographical drama \"Young Mr. Lincoln\" (1939), starring Henry Fonda; the crime drama \"The Street with No Name\" (1948), starring Mark Stevens and Richard Widmark; the landmark sci-fi drama \"The Day the Earth Stood Still\" (1951), starring Michael Rennie and Patricia Neal; and the sci-fi horror film \"The Fly\" (1958), starring David Hedison and Vincent Price. Although his uncredited roles outnumber the credited ones, Tannen was cast in significant parts in several Henry Fonda films, including Charles Ford in the westerns \"Jesse James\" (1939) and \"The Return of Frank James\" (1940), and Joe in the film adaptation of John Steinbeck's \"The Grapes of Wrath\" (1940). Tannen guest-starred in many television shows of the 1950s through the 70s, including the family comedy \"Father Knows Best\" (1954–1960), the crime drama \"77 Sunset Strip\" (1958–1964), the mystery action series \"Peter Gunn\" (1958–1961), the family comedy \"Mister Ed\" (1958–1966), the legal drama \"Perry Mason\" (1957–1966), the long-running family drama \"Lassie\" (1954–1974), Rod Serling's iconic anthology series, \"The Twilight Zone\" (1959–1964), and the comedy \"Petticoat Junction\" (1963–1970). Tannen made six guest appearances in THE RIFLEMAN, portraying Barney the barber in \"The Boarding House\" (episode 22), the bartender in \"Sins of the Father\" (episode 70), Josh Moore in \"The Jailbird\" (episode 73) and \"Woman from Hog Ridge\" (episode 78), Mr. Penn in \"Miss Milly\" (episode 84), and Jack Carson in \"The Actress\" (episode 94). He guest-starred in many other westerns, including \"The Roy Rogers Show\" (1951–1957), \"Maverick\" (1957–1962), \"Zane Grey Theater\" (1956–1961), \"Have Gun – Will Travel\" (1957–1963), \"Laramie\" (1959–1963), \"Death Valley Days\" (1952–1975), \"Bonanza\" (1959–1973), \"Tales of Wells Fargo\" (1957–1962), \"Gunsmoke\" (1955–1975), \"Cheyenne\" (1955–1963) and \"Rawhide\" (1959–1966).\n\nDee J. Thompson as Ma Boyle\n\nDee J. Thompson appeared in 35 movies and television shows during a 20-year career. She portrayed Donna in the romantic comedy \"The Glass Bottom Boat\" (1966), starring Doris Day, Rod Taylor and Arthur Godfrey. She guest-starred in several popular television shows of the 1950s and 60s, including the crime drama \"Dragnet\" (1951–1959), the mystery action series \"Peter Gunn\" (1958–1961), the comedy \"Hazel\" (1961–1966), the suspense anthology series \"Alfred Hitchcock Presents\" (1955–1962) and the family comedy \"My Three Sons\" (1960–1972). She had a recurring role playing Agnes in the Imogene Coca comedy \"Grindl\" (1963–1964). Thompson made one appearance in THE RIFLEMAN, portraying Ma Boyle in \"Woman from Hog Ridge\" (episode 78). She also guest-starred in the westerns \"Gunsmoke\" (1955–1975), starring James Arness, and \"The Big Valley\" (1965–1969), starring Barbara Stanwyck.\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=157", "page_content": "SuspicionEpisode 157Writer: Jay SimmsDirector: Joseph H. LewisOriginal Air Date 01/14/1963Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nPatricia Blair as Lou Mallory, Owner of the General Store and the Madera House Hotel\n\nPatricia Blair was an American television actress whose career was active primarily in the 1950s and 1960s. The Texas-born beauty began her career as a teenage model who went on to apprentice in summer stock before being discovered by Warner Bros. She began acting in films under the names Patricia Blake and Pat Blake. She appeared in a few films, including \"Jump Into Hell\" (1955), \"Crime Against Joe\" (1956) and \"The Black Sleep\" (1956), which reunited screen icons of the horror film genre Bela Lugosi, Lon Chaney Jr., Basil Rathbone and John Carradine. She also appeared in the suspense thriller \"City of Fear\" (1959), starring Vince Edwards. She portrayed the Fashion Narrator in the Robert Redford romantic western \"The Electric Horseman\" (1979), co-starring Jane Fonda. In 1962, Blair replaced actress Joan Taylor in a semi-regular role as Lou Mallory, Chuck Connor's love interest in the last season of THE RIFLEMAN. Blair played the attractive red-haired, fiery Irish businesswoman, whose character was savvy Landowner and Owner of the General Store and the Madera House Hotel. Blair's character of Lou Mallory appeared in 17 episodes of THE RIFLEMAN; she debuted in the title role of episode 145. Blair also made guest television appearances on \"The Bob Cummings Show\" (1955–1959), \"The Virginian\" (1962–1971), \"Perry Mason\" (1957–1966), \"Bonanza\" (1959–1973), and she co-starred in \"Daniel Boone\" (1964–1970), playing wife Rebecca Boone opposite Fess Parker. She also had a recurring role as Goldy in the western adventure series \"Yancy Derringer\" (1958–1959).\n\nWilliam Fawcett as Pyrite Rand\n\nWilliam Fawcett, born William Fawcett Thomas, was a prolific American film and television actor. He appeared in more than 50 movies and 200 television shows in a career spanning more than 35 years. Prior to becoming an actor, Fawcett was ordained as a minister, and he obtained a Ph.D. in Elizabethan drama from the University of Nebraska, Lincoln, then went on to become the Professor of Theatre at Michigan State University. In the mid-1940s he embarked on an acting career full-time. He guest-starred in many popular TV shows, including guest-starring roles in the classic family comedy of the 1950s, \"Leave It to Beaver\" (1957–1963), starring Jerry Mathers, the crime dramas \"Dragnet\" (1951–1959), starring Jack Webb, \"77 Sunset Strip\" (1958–1964), starring Efrem Zimbalist, Jr., \"Perry Mason\" (1957–1966) and \"Ironside\" (1967–1975), both starring Raymond Burr, the mystery action series \"Peter Gunn\" (1958–1961), starring Craig Stevens, Rod Serling's iconic anthology series, \"The Twilight Zone\" (1959–1964), and the adventure series \"The Fugitive\" (1963–1967), starring David Janssen. Most of Fawcett's film appearances were uncredited bit parts. Fawcett made two appearances in THE RIFLEMAN, portraying Mr. Newman in \"Lost Treasure of Canyon Town\" (episode 99) and Pyrite Rand in \"Suspicion\" (episode 157). Fawcett guest-starred in dozens of other westerns, often appearing multiple times as different characters. Among the many westerns in which he appeared were \"The Lone Ranger\" (1949–1957), starring Clayton Moore, \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone, \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen, \"The Deputy\" (1959–1961), starring Henry Fonda, \"The Life and Legend of Wyatt Earp\" (1955–1961), starring Hugh O'Brian, \"Cheyenne\" (1955–1963), starring Clint Walker, \"Maverick\" (1957–1962), starring James Garner, \"Rawhide\" (1959–1966), starring Clint Eastwood, \"Wagon Train\" (1957–1965), starring Ward Bond and later John McIntire, \"Daniel Boone\" (1964–1970), starring Fess Parker, \"Bonanza\" (1959–1973), starring Lorne Greene, Dan Blocker, Pernell Roberts and Michael Landon, \"Gunsmoke\" (1955–1975), starring James Arness, and \"The Virginian\" (1962–1971), starring James Drury and Doug McClure.\n\nJoe Higgins as Nils Swenson\n\nJoe Higgins was an American actor working primarily in television and commercials from the 1960's through the 1980's. His acting career began at age nine and while attending the University of Dayton in Ohio, he worked in radio. He became a prolific character actor who often portrayed a sheriff in commercials, public service announcements and in print ads. He won the CLIO award on two occasions for his acting in commercials. His portrayal as a sheriff, \"You in a heap o' trouble, boy!,\" in a series of memorable Dodge car commercials in the 1970's became his iconic signature role. Higgins appeared in four episodes of THE RIFLEMAN playing different characters, and he played the semi-regular character, Nils Swenson, the Blacksmith, in 16 episodes. He played recurring roles on other television series in addition to THE RIFLEMAN, including \"Arrest and Trial\" and later, he co-starred again with Chuck Connors in \"Flipper\" and \"Geronimo.\"\n\nWilliam \"Billy\" Hughes as Gridley Maule\n\nWilliam \"Billy\" Hughes, born William Eugene Hughes, was an American actor who worked primarily in television. Both his father Bill, Sr. and his uncle Whitey were stuntmen. He appeared in 25 movies and television shows during a two-decade career, which began when he was barely ten playing an uncredited role in the Mickey Rooney crime comedy \"The Nice Little Bank That Should Be Robbed\" (1958). He played the leading role as a runaway in the western \"Ole Rex\" (1961) and portrayed the oldest sibling Joe in a family of orphans in the Debbie Reynolds comedy \"My Six Loves (1963). Toward the end of his career, he had an uncredited stunt role in the Sam Peckinpah film \"The Wild Bunch\" (1969), and in his final film role, he appeared in the obscure western drama \"Smoke in the Wind\" (1975). Hughes guest-starred in several popular television shows, including the family comedy \"Leave It to Beaver\" (1957–1963), the medical drama \"Dr. Kildare\" (1961–1966), Rod Serling's iconic anthology series \"The Twilight Zone\" (1959–1964), the crime drama \"Arrest and Trial\" (1963–1964), the private detective series \"77 Sunset Strip\" (1958–1964) and the family drama \"Lassie\" (1954–1974). As a young teenager, Hughes made three appearances in THE RIFLEMAN, portraying Aaron in \"Day of Reckoning\" (episode 71), Jeffrey Waller in \"The Long Gun from Tuscon\" (episode 121) and Gridley Maule in \"The Sidewinder\" (episode 158). Reportedly, the part he played in \"The Sidewinder\" was one of his favorite roles. He guest-starred in several other westerns, sometimes making multiple appearances, including \"Gunsmoke\" (1955–1975), starring James Arness; \"Laramie\" (1959–1963), starring John Smith and Robert Fuller; and \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond.\n\nKevin McCarthy as Winslow Quince\n\nKevin McCarthy was an American stage, film and television actor whose prolific career spanned more than six decades. Brother of renowned author, Mary McCarthy, he made his Broadway debut in 1938 in \"Abe Lincoln in Illinois\" and appeared in 18 theatrical productions throughout his career, notably, portraying Harry S. Truman in \"Give 'Em Hell Harry,\" which toured the United States for two decades. McCarthy appeared in over 200 film and television roles. His portrayal of Biff in the 1951 film adaptation of \"Death of a Salesman\" garnered him an Academy Award nomination for Best Supporting Actor and won him a Golden Globe Award for New Star of the Year, Actor. His best-known role was Dr. Miles Bennell in the 1956 science fiction horror classic \"Invasion of the Body Snatchers.\" The iconic film was selected for the National Film Registry in 1994 and in 2008 was named one of the Top 10 science fiction films of all time by the American Film Institute. In later years, he embraced the cult camp status of the picture and his role in it, even making a cameo appearance in the 1976 remake of the \"Body Snatchers.\" McCarthy made two appearances in THE RIFLEMAN, portraying Mark Twain in \"The Shattered Idol\" (episode 120) and Winslow Quince in \"Suspicion\" (episode 157). He continued to work until the year before his death at age 96—his last screen appearances were in two 2009 releases, the 18th century period film, \"Wesley,\" and the short comedy film \"I Do.\"\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nGuest Cast"}, {"url": "https://wiki2.org/en/The_Rifleman", "page_content": "Main article: List of The Rifleman episodes\n\nThe series centers on Lucas McCain, a Union veteran of the American Civil War and widower. McCain had been a lieutenant in the 11th Indiana Infantry Regiment, and he had received a battlefield commission at the Battle of Five Forks just before the end of the war.[3] (This conflicts with episode 3/25, \"The Prisoner\", in which a former Confederate cavalry major states that he was Lieutenant McCain's prisoner after the Battle of Fort Donelson.[4]) Having previously been a homesteader, McCain buys a ranch outside the fictitious town of North Fork, New Mexico Territory, in the pilot episode. His son Mark and he had come from Enid, Oklahoma, following the death of his wife, Margaret (née Gibbs), when his son was six years old.[citation needed] The citizens of North Fork are sometimes willing to subject themselves to tyranny, showing themselves to be cowards in several episodes.\n\nThe series was set during the 1880s; a wooden plaque next to the McCain home states that the home was rebuilt by Lucas McCain and his son Mark in August 1881.[5]\n\nA common thread in the series is that people deserve a second chance; Marshal Micah Torrance is a recovering alcoholic, and McCain gives a convict a job on his ranch in \"The Marshal\". Royal Dano appeared in \"The Sheridan Story\" as a former Confederate soldier who is given a job on the McCain ranch and encounters General Philip Sheridan, the man who cost him his arm in battle. Learning why the man wants him dead, Sheridan arranges for medical care for his wounded former foe, quoting Abraham Lincoln's last orders to \"... bind up the nation's wounds\".[6]\n\nDespite his status as the series' protagonist, Lucas McCain is not without fault; He has a tendency to be stubborn and bossy, and has a bit of an inflated ego. In \"Death Trap\", an episode with Philip Carey as former gunman (and old adversary) Simon Battles, he is unwilling to believe the man has changed and become a doctor. It takes a gunfight (with Battles fighting alongside him) to make him admit he is wrong. In \"Two Ounces of Tin\", with Sammy Davis Jr. as Tip Corey (a former circus trick-shot artist turned gunman), McCain angrily orders him off the ranch when he finds him demonstrating his skills to Mark. Corey suggests he is a hypocrite, because McCain has an equally deadly reputation in the Indian Territory of Oklahoma, where he first acquired the nickname \"the Rifleman\", and where his wife had died during a smallpox epidemic.[citation needed]\n\nCast\n\nBeverly Englander and Chuck Connors in the 1961 episode \"Lariat\"\n\nMain\n\nChuck Connors as Lucas McCain, a rancher, a Union Army veteran of the American Civil War, father, and widower\n\nJohnny Crawford as Mark McCain, Lucas's son\n\nPaul Fix as Micah Torrance, marshal of North Fork, New Mexico\n\nRecurring\n\nEight actors played the town doctor during the series (usually known as \"Doc Burrage\"): Paul Fix (first episode only; he returned to the cast as Micah), Edgar Buchanan, Fay Roope, Rhys Williams, Jack Kruschen, Robert Burton, Ralph Moody and Bert Stevens. In addition to Joe Higgins, several actors also played blacksmith Nels (sometimes credited as Nils) Swenson, including Richard Alexander, John Dierkes, Henry Rowland and Karl Swenson.\n\nGuest stars\n\nMore than 500 actors made guest appearances in more than 970 credited roles during the five-year run of the series.[7] Guest stars included veteran actors: John Anderson, Richard Anderson, Lyle Bettger, Whit Bissell, Harry Carey Jr., John Carradine, Lon Chaney, Jr., Ellen Corby, John Dehner, Jack Elam, Med Flory, Dabbs Greer, Rodolfo Hoyos, Jr., L.Q. Jones, John Milford, Agnes Moorehead, Denver Pyle, Lee Van Cleef, Royal Dano and Adam West, most appearing multiple times in different roles. Several then-newcomers also appeared in the series, including Claude Akins, James Coburn (credited as \"Jim\"), Mark Goddard, Dan Blocker, James Drury, Dennis Hopper, Michael Landon, Warren Oates, Harry Dean Stanton, Robert Vaughn, Robert Culp (who starred in Four Star Productions' \"Trackdown\" from 1957 to 1959), Martin Landau and Richard Kiel. Other notable guest stars & character actors who made cameo appearances were Sammy Davis, Jr., future baseball Hall of Famers Duke Snider and Don Drysdale, comedian Buddy Hackett, George Macready, Pernell Roberts (who starred on Bonanza at the time), Bobby Crawford Jr. (the brother of series star Johnny Crawford; himself a star on Laramie from 1959-1960) and writer/director/producer Paul Mazursky.[7]\n\nEpisodes\n\nMain article: List of The Rifleman episodes\n\nSeason Episodes Originally aired First aired Last aired 1 40 September 30, 1958 ( ) June 30, 1959 ( 1959-06-30 ) 2 36 September 29, 1959 ( ) May 31, 1960 ( 1960-05-31 ) 3 34 September 27, 1960 ( ) May 16, 1961 ( 1961-05-16 ) 4 32 October 2, 1961 ( ) May 7, 1962 ( 1962-05-07 ) 5 26 October 1, 1962 ( ) April 8, 1963 ( 1963-04-08 )\n\nProduction\n\nThe Rifleman was partially filmed in Wildwood Regional Park in Thousand Oaks, California.[8][9]\n\nDevelopment\n\nThe series was created by Arnold Laven and developed by Sam Peckinpah, who became a director of Western movies. Peckinpah, who wrote and directed many early episodes, based many characters and plots on his own childhood on a ranch. His insistence on violent realism and complex characterizations, as well as his refusal to sugarcoat the lessons he felt the Rifleman's son needed to learn about life, put him at odds with the show's producers at Four Star. Peckinpah left the show and created a short-lived series, The Westerner, with Brian Keith.[citation needed]\n\nOpening credits\n\nThe opening theme at the beginning of each episode depicted McCain walking down the street of a town while rapid-firing his Winchester 44-40 1892 model rifle that had been modified at the trigger and lever. The rifle's modification allowed McCain to fire the rifle only by hand pumping the lever, which had a setscrew imbedded in it to trip the weapon's trigger.[citation needed] At various points during the series, episodes would show McCain deftly handling and shooting the rifle ambidextrously.[10] When Connors auditioned for the show, the director suddenly threw a rifle at him; the former Major League Baseball player caught it and got the job.[11]\n\nRifle\n\nLarge lever firing loop on the Rifleman's rifle\n\nWesterns were popular when The Rifleman premiered, and producers tried to find gimmicks to distinguish one show from another. The Rifleman's gimmick was a modified Winchester Model 1892 rifle, with a large ring lever drilled and tapped for a set screw. The lever design allowed him to cock the rifle by spinning it around his hand. In addition, the screw could be positioned to depress the trigger every time he worked the lever, allowing for rapid fire, emptying the magazine in under six seconds during the opening credits on North Fork's main street.[12]\n\nThe trigger-trip screw pin was used in two configurations: with the screw head turned inside (close to the trigger), or more often, outside the trigger guard with a locknut on the outside (to secure its position). In some episodes, the screw was removed, when rapid-fire action was not required. When properly adjusted, the screw “squeezed” the trigger when the lever was fully closed. The rapid-fire mechanism was originally designed to keep Connors from puncturing his finger with the trigger as he quickly cycled the action of the rifle. With this modification, Connors pulling the trigger for each shot was not necessary, so he did not have to place his finger in harm's way.\n\nThe rifle may have appeared in every episode, but it was not always fired; some plots did not require violent solutions (for example, one involving Mark's rigid new teacher). McCain attempts to solve as many problems as possible without resorting to shooting, yet still manages to kill 120 villains over the show's five-year run. Notably, McCain almost never carried a pistol, although he is a good shot with it, especially when he improvised a crude gunstock from a board, when facing a villain who had stolen his rifle.\n\nThe rifle used on the set of The Rifleman, an 1892 Winchester caliber .44-40 carbine with a standard 20-inch barrel, was an historical anachronism, as the show was set in 1881, 12 years before John Browning had designed the rifle. It appeared with two different types of levers. The backwards, round-D-style loop was used in the early episodes. Sometimes, the rifle McCain uses has a saddle ring. The lever style later changed to a flatter lever (instead of the large loop) with no saddle ring.\n\nMcCain fires 12 shots from his rifle during the opening credits - seven shots in the first close-up and five more as the camera switches to another view. The blank cartridges are shorter than standard cartridges, so the magazine can hold more of the blanks. The soundtrack contained a dubbed 13th shot, to allow the firing to end with a section of the theme music. The rifle was chambered for the .44-40 Winchester center fire cartridge, which was used in both revolvers and rifles.[13] He could supposedly fire off his first round in three-tenths of a second, which certainly helped in a showdown.\n\nRifle replica\n\nGunsmith James S. Stembridge modified two Model 1892s for use in regular and close-up filming.[14] In addition, a Spanish-made Gárate y Anitúa \"El Tigre\" lever action, a near-copy of the Model 1892, was modified for use as a knockabout gun. The El Tigre is seen in scenes where the rifle is in a saddle scabbard and is not drawn, and in stunts where the rifle was thrown to the ground, used as a club, or in any stunt where a possibility of damage to the original Winchester 1892s existed.[15] These three rifles were the only ones used by Connors during the run of the series.\n\nThe now-defunct Stembridge Gun Rentals provided the rifles and ammunition. Ammunition was quarter-load 5-in-1 blank cartridges containing smokeless powder, which did not produce the thick clouds of smoke the genuine black powder cartridges of the 1880s did. Most (if not all) of the sound effects for the rifle shots were dubbed, which is why the rifle sounded so different from the other gunshots on the show.\n\nThe 1892 Winchester is a top-eject rifle (opening the action by pushing the finger-lever forward moves the bolt rearward and thereby opens the top of the receiver). Loaded rounds or empty cases from the chamber eject straight up when the lever is pushed fully open (forward). When Connors cycled the action by spinning the rifle to his side, the cartridge in the action could fall out. Therefore, the rifle was modified with a plunger, which would hold the round in place.\n\nThe Winchester Model 1892 rifle was designed by John Moses Browning, and other than general appearance, it has nothing in common with earlier lever-action rifles using the same class of cartridges. The significant improvement was the addition of vertical lugs that securely lock the bolt and receiver when the gun fires. Winchester originally produced this gun from 1892 to 1941; total production was slightly over 1,000,000; 27 variations in five chamberings were made over the course of production, but the basic design was largely unaltered. As with the earlier Model 1873, the light and handy Model 1892 was chambered for handgun cartridges, favored by many Westerners to simplify ammunition supply problems by using the same cartridge in both a handgun and a rifle. The Model 1892 was replaced by the Browning-designed Model 1894, which also had an impressive manufacturing history, with over 7,000,000 produced; it is still being produced to this day by a successor to Winchester. The Model 94's popularity and long production history may be related to its being the first Winchester to be designed for the then-new \"smokeless\" powder.\n\nDirecting and writing\n\nThe pilot episode, \"The Sharpshooter\", was originally telecast on CBS as part of Dick Powell's Zane Grey Theatre on March 7, 1958; it was repeated (in edited form) as the first episode of the series on ABC. The episode was written by Sam Peckinpah, and guest starred Dennis Hopper.\n\nRegulars on the program included Marshal Micah Torrance (R. G. Armstrong was the original marshal for two episodes, the first and the fourth), Sweeney the bartender (Bill Quinn), and a half-dozen other residents of North Fork (played by Hope Summers, Joan Taylor, Patricia Blair, John Harmon, and Harlan Warde).\n\nFifty-one episodes of the series were directed by Joseph H. Lewis (director of 1950's Gun Crazy and known for his film noir style). Ida Lupino directed one episode, \"The Assault\".\n\nConnors wrote several episodes. Robert Culp (star of CBS's Trackdown, another Four Star production), wrote one two-part episode, and Frank D. Gilroy (creator of ABC's Burke's Law, another Four Star production), wrote \"End of a Young Gun\".[citation needed]\n\nRelease\n\nHome media\n\nMPI Home Video has released The Rifleman on DVD in Region 1 in a number of versions. It has released single-disc DVDs with five episodes; from 2002 to 2006 it released six sets, each with 20 episodes. The releases are random collections of episodes, rather than the original broadcast order. These releases are out of print, since MPI Home Video no longer owns the rights to the series. Levy-Gardner-Laven Productions, the original producer, is again the sole copyright owner of The Rifleman series.[16]\n\nIn late 2013, Levy-Gardner-Laven Productions, Inc. announced it would be the only authorized outlet to offer for the first time all 168 episodes of The Rifleman, the original series, newly restored and assembled in DVD box sets. The episodes were to be released in sequential order, by season, in high-quality boxed sets with exclusive special features. The first boxed set of all Season 1 episodes was made available on December 4, 2013, for $69.95.[17] The second season was released on November 28, 2014.[18] Season 3 was released on December 2, 2015.[19] Season 4 was released on December 4, 2016.[20][21] Season 5 was released on November 27, 2017.[22]\n\nDVD Name Ep # Release Date The Complete First Season 40 December 4, 2013 The Complete Second Season 36 November 28, 2014 The Complete Third Season 34 December 2, 2015 The Complete Fourth Season 32 December 4, 2016 The Complete Fifth Season 26 November 27, 2017\n\nReception\n\nU.S. Nielsen ratings\n\nSeason Episodes Originally aired Rank Rating\n\nSeason premiere Season finale 1 40 September 30, 1958 ( ) June 30, 1959 ( 1959-06-30 ) 4 33.1[23] 2 36 September 29, 1959 ( ) May 31, 1960 ( 1960-05-31 ) 13 27.5[23] 3 34 September 27, 1960 ( ) May 16, 1961 ( 1961-05-16 ) 27 22.1[23] 4 32 October 2, 1961 ( ) May 7, 1962 ( 1962-05-07 ) 28 22.3[23] 5 26 October 1, 1962 ( ) April 8, 1963 ( 1963-04-08 ) Not in the Top 30[23]\n\n\n\n\n\nSpin-offs and remakes\n\nLaw of the Plainsman (1959)\n\nThe February 17, 1959 episode of The Rifleman was a pilot for an NBC series, Law of the Plainsman, starring Michael Ansara as Marshal Sam Buckhart. In the episode \"The Indian\", Buckhart comes to North Fork to look for Indians suspected of murdering a Texas Ranger and his family.[24] He subsequently reappeared in \"The Raid\". Three episodes of \"The Rifleman\" served as pilots for Westerns that never became a series. These were: \"The Lariat\" (March 29, 1960) starring Richard Anderson as a gambler and sharpshooter; \"Death Trap\" (May 9, 1961) featuring Phil Carey as Simon Battle, a gunslinger turned doctor; and \"Which Way'd They Go?\" (April 1, 1963), a comedy-western with Peter Whitney.[25]\n\nThe Gambler Returns (1991)\n\nChuck Connors briefly played the same character again in 1991's The Gambler Returns: The Luck of the Draw, which featured a number of 1950s and 1960s television Western series leads reprising their roles in quick cameo appearances (Gene Barry as Bat Masterson, Hugh O'Brian as Wyatt Earp, Jack Kelly as Bart Maverick, Clint Walker as Cheyenne Bodie, Brian Keith as The Westerner, David Carradine as Kung Fu's Caine).\n\n2011 attempted remake\n\nIn late 2011, CBS announced plans to remake the original Rifleman series.[26] Chris Columbus was slated to be the executive producer and direct, with Robert Levy, Steven Gardner, and Arthur Gardner (related to original producers Levy-Gardner-Laven) as executive producers.[27] The remake project was canceled a few months later, without a pilot episode being made.[28]\n\nMerchandising\n\nThe TV show was also adapted into a comic book by Dan Spiegle, distributed by Dell Comics.[29]\n\nAmerican toymaker Hubley produced a well made toy copy of McCain's Model 1892 known variously as The Rifleman Rifle, the Flip Special, and the Ring Rifle. Marx Toys also marketed a version called the Wild West that was simply the Lone Ranger/Roy Rogers Winchester with the loop lever used by McCain replacing the standard straight lever.[30]\n\nSee also\n\nReferences\n\nFurther reading\n\nChristopher Sharrett, The Rifleman (TV Milestones Series), Wayne State University Press, 2005"}], "William Quinn directed several episodes of The Rifleman.": [{"url": "https://www.therifleman.net/episodes?episode=101", "page_content": "The PrisonerEpisode 101Writer: Arthur Browne, Jr.Director: Joseph H. LewisOriginal Air Date 03/14/1961Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nJohn Dehner as Major Aaron King\n\nJohn Dehner was an American actor of radio, film and television. In a career spanning nearly 50 years he appeared in more than 260 movies and television shows. Often cast as villains, he was tall and distinguished and lent an urbane and droll personae to the characters he played. Dehner made four guest appearances in THE RIFLEMAN, portraying different characters in each episode, including Tom King in \"The Money Gun\" (episode 33), Al Walker in \"The Blowout\" (episode 43), Wood Bartell in \"The Baby Sitter\" (episode 52), and Major Aaron King in \"The Prisoner\" (episode 101).\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nJoan Taylor as Milly Scott, Owner of the General Store\n\nJoan Taylor was an American actress born to a family in the entertainment business. Her mother, Amelia Berky, was a vaudeville dancer and singer in the 1920s. Her father operated a movie theater, which inspired in her an abiding interest in the movies from an early age. Taylor came to Hollywood in 1946 and worked on the stage at the Pasadena Playhouse for four years. Discovered by Victor Jory when she played Regina in \"Another Part of the Forest,\" she was contracted to Paramount Studios where she appeared in several Western pictures. She guest-starred in numerous television series in the 1950s and early 60s, retiring from acting in 1962. Taylor appeared in 18 episodes of THE RIFLEMAN between 1960 and 1962, playing Milly Scott, Owner of the General Store, which she bought from Hattie Denton. An attractive young woman who figured as a love interest for Lucas McCain, her character was introduced in \"Miss Milly\" (episode 84).\n\nAdam Williams as Corporal Troc\n\nAdam Williams was an American actor with over 120 television credits in the 1950s through the 1970s. He made six guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played Jake Pardee in \"The Challenge\" (episode 28), Corporal Troc in \"The Prisoner\" (episode 101), Jax in \"The Score is Even\" (episode 105), Russell Ganaway in \"The Executioner\" (episode 142), which he also wrote, Platt in \"The Anvil Chorus\" (episode 154), and Jeb Sherman in \"Old Man Running\" (episode 166).\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=53", "page_content": "The CowardEpisode 53Writer: Philip Saltzman and Clair HuffakerDirector: James NeilsonOriginal Air Date 12/22/1959Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nRobert Bice as Ben Smith\n\nRobert Bice made five guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played Joe Hallager in \"The Mind Reader\" (episode 40), Ben Smith in \"The Coward\" (episode 53), The Warden of New Mexico Territory in \"Seven\" (episode 79), and Len Richards in \"Deadly Image\" (episode 138).\n\nCarleton Carpenter as George Collins\n\nCarleton Carpenter is an American stage, film and television actor, as well as a magician, author and songwriter. He has appeared in nearly 40 movies and television shows in a career spanning more than 30 years. Prior to signing to Metro-Goldwyn-Mayer, Carpenter worked on Broadway, both as a magician and an actor. He appeared in many films starring movie and stage legends such as Ray Bolger in \"Three to Make Ready,\" Bert Lahr and Angela Lansbury in \"Hotel Paradiso\" and Judy Garland in the film \"Summer Stock\" (1950). Carpenter had starring roles in \"Fearless Fagan\" (1952), co-starring Janet Leigh, and \"Sky Full of Moon\" (1952), with Jan Sterling. Carpenter appeared in several popular series of the 1950s and 60s, including \"G.E. True Theater\" (1953–1962) and \"Perry Mason\" (1957–1966). He made one guest appearance in THE RIFLEMAN, portraying George Collins in \"The Coward\" (episode 153). Carleton had many talents besides acting; they included composing songs and writing novels. Among his hits compositions were \"Christmas Eve,\" \"Cabin in the Woods\" and \"Ev'ry Other Day.\" During the 1970s and 80s, Carpenter became a best-selling mystery novelist. One of his more popular books, \"Deadhead\" (1974), was adapted to a Broadway musical. He also authored several short stories, which were featured in the Alfred Hitchcock and Ellery Queen mystery magazines.\n\nDonald Elson as the Printer\n\nDonald Elson is an American film and television actor. He has appeared in nearly 50 movies and television shows in a career spanning more than 50 years. He has guest-starred in various popular shows, including the gothic horror series \"Thriller\" (1960–1962), starring Boris Karloff, the campy take on the comic book hero \"Batman\" (1966–1968), starring Adam West, the crime drama \"Ironside\" (1967–1975), starring Raymond Burr as a wheelchair-bound detective, the classic family drama \"Little House on the Prairie\" (1974–1983), starring Melissa Gilbert and Michael Landon, who also directed, and the tongue-in-cheek whodunit \"Murder, She Wrote\" (1984–1996), starring Angela Lansbury. Elson made two appearances in THE RIFLEMAN, portraying the printer in \"The Coward\" (episode 53), and Aaron the liveryman in \"Outlaw's Shows\" (episode 141). He also guest-starred in the westerns \"Bonanza\" (1959–1973), starring Lorne Greene, Dan Blocker, Pernell Roberts and Michael Landon, and also \"Gunsmoke\" (1955–1975), starring James Arness.\n\nJohn Milford as Dub\n\nJohn Milford was an American actor, whose long career, primarily in television, included more than 164 acting roles spanning five decades. His first big break came with an uncredited appearance in the 1956 Oscar awarding winning film \"Marty,\" starring Ernest Borgnine. Milford appeared in every television genre, from crime dramas, including \"The F.B.I.\" (1965–1974) and \"Mannix\" (1967–1975), among many others, to sci-fi adventures, including \"The Six Million Dollar Man\" (1974–1978) and its spin-off \"The Bionic Woman\" (1976–1978). He appeared in many of the most popular series of their eras, including the sci-fi thriller \"The Invaders\" (1967–1968), sci-fi mini-series \"The Planet of the Apes (1974), the family dramas \"Little House on the Prairie\" (1974–1983) and \"Highway to Heaven\" (1984–1989), and the sci-fi mystery \"The X-Files\" (1993–2002). Milford played recurring roles in several series, including Ike Clanton for one season in \"The Life and Legend of Wyatt Earp (1955–1961), Sgt. Kagey in \"The Lieutenant\" (1963–1964), Lt. Paul Hewitt in \"The Bold Ones: The Lawyers\" (1969–1972), and a co-starring role as Captain Dempsey in the action comedy \"Enos\" (1980–1981). In addition to the Wyatt Earp series, Milford appeared in many of the most popular western series of the 1950s through '70s, including \"Bonanza\" (1959–1973), \"The Virginian\" (1962–1971) and \"The Big Valley\" (1965–1969). John Milford made eleven appearances in THE RIFLEMAN, portraying Ross Porter in \"The Blowout\" (episode 43), Dub in \"The Coward\" (episode 53), Jonas Winters in \"The Horsetraders\" (episode 60), Bro Hadley in \"A Time for Singing\" (episode 64), Morgan in \"Meeting at Midnight\" (episode 74), Marsh Watson in \"The Pitchman\" (episode 80), Hadley in \"Baranca\" (episode 82), Jack Solby in \"Dark Day at North Fork\" (episode 100), Reade in \"The Clarence Bibs Story\" (episode 104), Jess Grady in \"The Journey Back\" (episode 115) and Lt. Price in \"The Assailants\" (episode 149). Milford also appeared in two episodes of THE RIFLEMAN spin-off \"Law of the Plainsman\" (1959–1960). Milford ran the Chamber Theatre on Cahuenga Blvd. West in Hollywood, where he helped many young actors get a start in the entertainment industry. He is also credited with the original design for the Hollywood Walk of Fame.\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nSteve Rowland as Buddy Link\n\nSteve Rowland, born Stephen Jacob Rowland, is an American television and film actor, in addition to being a singer, columnist and record producer. During the 1960s, Rowland relocated to London, where he produced 13 Top Ten hits for Dave, Dee, Dozy, Beaky, Mick & Tich. He also produced hits for P.J. Proby and The Pretty Things. He received a gold album and an award from the American Society of Composers, Authors and Publishers during the 1970s. While serving as the creative manager for Ariola Records, Rowland discovered and signed The Cure and the Thompson Twins, in addition to handling Boney M and Japan. Rowland had several film roles, including an uncredited role in the romantic western \"The Moonlighter\" (1953), starring Barbara Stanwyck and Fred MacMurray; Glasses in the crime drama \"Crime in the Streets\" (1956), starring John Cassavetes, Sal Mineo and James Whitmore; and Eddy in the war drama \"Battle of the Bulge\" (1965), starring Henry Fonda, Robert Shaw, Robert Ryan and Dana Andrews. Outside of film, Rowland has appeared almost exclusively in westerns, including having a recurring role as Phin Clanton in \"The Life and Legend of Wyatt Earp\" (1955–1961), starring Hugh O'Brian. Rowland made two appearances in THE RIFLEMAN, portraying Billy Lehi in \"Home Ranch\" (episode 2) and Buddy Link in \"The Coward\" (episode 53). He guest-starred in several other westerns, including \"Hopalong Cassidy\" (1952–1954), starring William Boyd; \"Tales of Wells Fargo\" (1957–1962), starring Dale Robertson; \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond; \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen; and \"Bonanza\" (1959–1973), starring Lorne Greene, Michael Landon, Dan Blocker and Pernell Roberts.\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=121", "page_content": "Long Gun from TucsonEpisode 121Writer: Calvin J. ClementsDirector: Joseph H. LewisOriginal Air Date 12/11/1961Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nWhit Bissell as Henry Waller\n\nWhit Bissell, born Whitner Nutting Bissell, was a prolific American television and film actor who made his acting debut on Broadway. He appeared in nearly 300 television shows and movies in a career spanning more than 40 years. Although he appeared in several cult horror films of the 1950s, including the classic sci-fi thriller, \"Invasion of the Body Snatchers\" (1956), he is probably best-known for portraying the mad scientist who turned Michael Landon into a beast in \"I Was a Teenage Werewolf\" (1957). Bissell appeared in numerous TV shows of every genre popular in the 1950s through the early 80s, including \"Peyton Place\" (1965), \"Perry Mason\" (1957–1966), \"Marcus Welby, M.D.\" (1970–1973), \"The Incredible Hulk\" (1979–1980), and many western series, including \"The Lone Ranger\" (1947–1959), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Have Gun – Will Travel\" (1957–1963), \"Wagon Train\" (1958–1964), \"Bonanza\" (1959–1973) and \"The Virginian\" (1963–1964). Bissell also had recurring roles as Bert Loomis in the comedy series, \"Bachelor Father\" (1957–1962), and Lt. Gen. Heywood Kirk in the sci-fi series, \"The Time Tunnel\" (1966–1967). Bissell made four appearances in THE RIFLEMAN, portraying Sam Barrows in \"The Patsy\" (episode 41), Gabe Fenway in \"The Flourflusher\" (episode 72), Volney Adams in \"The Hangman\" (episode 76) and Henry Waller in \"The Long Gun from Tucson\" (episode 121). In 1994, Bissell received a lifetime achievement award from the Academy of Science Fiction, Fantasy & Horror Films. He also served on the board of directors of the Screen Actors Guild and represented the actors branch of the Academy of Motion Picture Arts and Sciences board of governors.\n\nJohn Harmon as Eddie Halstead, Hotel Clerk at the Hotel Madera/California House\n\nJohn Harmon was an American actor who appeared in over 250 roles in film and television from the 1930's through the 1970's. His early roles were mostly uncredited, but he was cast in a wide variety of genres and played many different kinds of characters. Harmon appeared in 15 episodes of THE RIFLEMAN as Eddie Halstead Hotel Clerk at the Hotel Madera. The character of Halstead was first introduced in episode 7, \"Duel of Honor.\"\n\nJoe Higgins as Nils Swenson\n\nJoe Higgins was an American actor working primarily in television and commercials from the 1960's through the 1980's. His acting career began at age nine and while attending the University of Dayton in Ohio, he worked in radio. He became a prolific character actor who often portrayed a sheriff in commercials, public service announcements and in print ads. He won the CLIO award on two occasions for his acting in commercials. His portrayal as a sheriff, \"You in a heap o' trouble, boy!,\" in a series of memorable Dodge car commercials in the 1970's became his iconic signature role. Higgins appeared in four episodes of THE RIFLEMAN playing different characters, and he played the semi-regular character, Nils Swenson, the Blacksmith, in 16 episodes. He played recurring roles on other television series in addition to THE RIFLEMAN, including \"Arrest and Trial\" and later, he co-starred again with Chuck Connors in \"Flipper\" and \"Geronimo.\"\n\nWilliam \"Billy\" Hughes as Jeffrey Waller\n\nWilliam \"Billy\" Hughes, born William Eugene Hughes, was an American actor who worked primarily in television. Both his father Bill, Sr. and his uncle Whitey were stuntmen. He appeared in 25 movies and television shows during a two-decade career, which began when he was barely ten playing an uncredited role in the Mickey Rooney crime comedy \"The Nice Little Bank That Should Be Robbed\" (1958). He played the leading role as a runaway in the western \"Ole Rex\" (1961) and portrayed the oldest sibling Joe in a family of orphans in the Debbie Reynolds comedy \"My Six Loves (1963). Toward the end of his career, he had an uncredited stunt role in the Sam Peckinpah film \"The Wild Bunch\" (1969), and in his final film role, he appeared in the obscure western drama \"Smoke in the Wind\" (1975). Hughes guest-starred in several popular television shows, including the family comedy \"Leave It to Beaver\" (1957–1963), the medical drama \"Dr. Kildare\" (1961–1966), Rod Serling's iconic anthology series \"The Twilight Zone\" (1959–1964), the crime drama \"Arrest and Trial\" (1963–1964), the private detective series \"77 Sunset Strip\" (1958–1964) and the family drama \"Lassie\" (1954–1974). As a young teenager, Hughes made three appearances in THE RIFLEMAN, portraying Aaron in \"Day of Reckoning\" (episode 71), Jeffrey Waller in \"The Long Gun from Tuscon\" (episode 121) and Gridley Maule in \"The Sidewinder\" (episode 158). Reportedly, the part he played in \"The Sidewinder\" was one of his favorite roles. He guest-starred in several other westerns, sometimes making multiple appearances, including \"Gunsmoke\" (1955–1975), starring James Arness; \"Laramie\" (1959–1963), starring John Smith and Robert Fuller; and \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond.\n\nBrian G. Hutton as Deecie\n\nBrian Hutton was an American film and television actor, as well as director. He appeared in more than 30 movies and television shows and directed nine films during a two-decade career. He made his directorial debut with \"The Wild Seed\" (1965), starring Michael Parkins and Celia Kaye. His most notable films include the World War II thriller \"Where the Eagles Dare\" (1968), starring Richard Burton and Clint Eastwood; the war comedy \"Kelly's Heroes\" (1970), starring Clint Eastwood, Telly Savalas, Don Rickles and Carroll O'Connor; the psychological drama about a romantic triangle \"X, Y, and Zee\" (1972) starring Elizabeth Taylor, Michael Caine and Susannah York; and the romantic adventure \"High Road to China\" (1983), starring Tom Selleck and Bess Armstrong. Hutton also had acting roles in a few films, including the western \"Gunfight at the O.K. Corral\" (1957), starring Burt Lancaster and Kirk Douglas, and the western \"Last Train to Gun Hill\" (1959), starring Kirk Douglas, Anthony Quinn and Carolyn Jones. In addition to film, Hutton guest-starred in a few popular television shows, including the legal drama \"Perry Mason\" (1957–1966) and the suspense anthology series \"Alfred Hitchcock Presents\" (1955–1962). Hutton made two appearances in THE RIFLEMAN, portraying Deecie in \"Long Gun from Tuscon\" (episode 121) and Billy Benson in \"Obituary\" (episode 44). He guest-starred in several other westerns, including \"Gunsmoke\" (1955–1975), starring James Arness; \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone; \"Rawhide\" (1959–1966), starring Clint Eastwood; \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond; and \"Laramie\" (1959–1963), starring John Smith and Robert Fuller. He also had an uncredited part in \"Geronimo\" (1962), starring THE RIFLEMAN's Chuck Connors in the title role.\n\nPeter Whitney as John Holliver\n\nPeter Whitney was an American television and film actor whose large frame and heavy-set, swarthy appearance brought him many roles playing villainous characters in his early career. Later, as a character actor, he made frequent appearances in television series, particularly the western genre. Among his film credits, he appeared in \"In the Heat of the Night\" (1967), \"The Great Bank Robbery\" (1969), and \"The Ballad of Cable Hogue\" (1970). Whitney made nine appearances in THE RIFLEMAN, portraying Tracey Blanch in \"Eddie's Daughter\" (episode 46), John Jupiter in \"Mail Order Groom\" (episode 56), Andrew Bechtel in \"Heller\" (episode 62), Otto Drosheck in \"Strange Town\" (episode 81), Vince Fergus in \"The Queue\" (episode 110), John Holliver in \"Long Gun from Tucson\" (episode 121), Neb Jackman in 'Lou Mallory\" (episode 145) and \"Which Way Did They Go?\" (episode 167), and Vantine in \"Gun Shy\" (episode 153).\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=32", "page_content": "The WomanEpisode 32Writer: Pat FielderDirector: Arnold LavenOriginal Air Date 05/05/1959Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nPatricia Barry as Adele Adams\n\nPatricia Barry, born Patricia White, is an American actress who has appeared in more than 130 television shows and movies in a career spanning 50 years. Barry was signed to Columbus Pictures following her graduation from Stephens College, Columbia, MO. She appeared in numerous TV series and soap operas popular in the 1950s through the 90s, including \"Twilight Zone\" (1959–1964), \"Perry Mason\" (1957–1966) \"Dr. Kildaire\" (1962–1965), \"The Bold Ones: The Lawyers\" (1972), \"Columbo\" (1975), \"Charlie's Angels\" (1976), \"Guiding Light\" (1984–1987) and \"Murder, She Wrote\" (1989–1994). Barry also starred in her own TV series, playing the title role of Kate Harris in \"Harris Against the World\" (1965–1965). She also appeared in two critically acclaimed made-for-TV movies, \"First, You Cry\" (1978) and \"Bogie\" (1980). She made three appearances in The RIFLEMAN, portraying Adele Adams in \"Three-Legged Terror\" (episode 30) and \"The Woman\" (episode 32), as well as Laurie Hadley in \"A Time for Singing\" (episode 64). Barry also guest-starred in other TV westerns, including \"The Virginian\" (1962–1971) and \"Gunsmoke\" (1955–1975).\n\nFern Barry as Townswoman\n\nFern Barry was an American film and television actress. She appeared in nearly 50 television shows and movies in a career spanning more than 40 years. Many of her acting roles were uncredited. Working mostly during the 1930s, 50s and 60s, Barry appeared in several popular TV series, including and \"The Donna Reed Show\" (1960) and the popular crime drama series \"Perry Mason\" (1957–1966). She made two appearances in The RIFLEMAN, portraying a townswoman in \"The Woman\" (episode 32) and Callie Sawyer in \"The Horsetraders\" (episode 60). Barry also guest–starred in \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Wagon Train\" (1957–1965) and \"Rawhide\" (1960).\n\nPaul Carr as Garth Healey\n\nPaul Carr made four guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played Derek Hanaway in \"Shivaree\" (episode 19), Garth Healey in \"The Woman\" (episode 32), Fred Harris in \"Letter of the Law\" (episode 50), and Doug Carter in \"Smoke Screen\" (episode 68).\n\nMel Carter as Jed Healy\n\nMel Carter made eight guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played an outlaw on \"End of a Young Gun\" (episode 3), Walkerman in \"The Safe Guard\" (episode 8), a cowhand in \"The Challenge\" (episode 28), Jed Healy in \"The Woman\" (episode 32), Arnie Grady in \"The Journey Back\" (episode 115), Jeems in \"Outlaw's Shoes\" (episode 141), George Vale's partner Bo Jackman in \"Lou Mallory\" (episode 145), and Mark Jones in \"Death Never Rides Alone\" (episode 147). Carter appeared in many television shows from the late 1950's through late 1980's. In 1987, he co-starred with Chuck Connors in \"Werewolf,\" an episode of the \"Father Jude\" series.\n\nDavid Leland as Cousin Healey\n\nDavid Leland was an American actor who worked primarily in television, appearing in 14 TV shows and movies during a decade-long career. He appeared in the crime drama \"M Squad\" (1957–1960) and several westerns, including \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone, \"Zane Grey Theater\" (1956–1961), starring Dick Powell, \"Bronco\" (1958–1962), starring Ty Hardin, \"The Restless Gun\" (1957–1959), starring John Payne, \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen, \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond, and \"Laredo\" (1965–1967), starring Neville Brand, Peter Brown and William Smith. Leland made one appearance in THE RIFLEMAN, portraying Cousin Healey in \"The Woman\" (episode 32).\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nGlenn Strange as Stagecoach Driver\n\nGlenn Strange was an American actor most well known for playing roles in the Western and Horror genres. Growing up in New Mexico, he had been a rancher, cowboy and rodeo performer—a background that lent authenticity to the Western characters he played. In the 1920's he learned to play the fiddle and guitar, and toured the country with a radio singing group, the Arizona Wranglers. He came to Hollywood in 1930 with the ensemble and began landing small parts in \"B\" Westerns. At 6' 5\" tall, he had a large, rugged frame and heavy features—attributes that tended to typecast him as villainous and nefarious characters. Later, a different Western characterization would supplant the archetypal villains he portrayed earlier in his career—Sam Noonan, the bartender on CBS's \"Gunsmoke\" (1961–1973) television series would become his most enduring TV personae. He appeared in 215 episodes of \"Gunsmoke.\" Boris Karloff, the quintessential Horror genre star, portrayed Frankenstein's monster in three films, but in 1944 passed the baton to Strange, who played the monster role in three Universal films, \"House of Frankenstein\" (1944), \"House of Dracula\" (1945) and the camp horror-comedy film, \"Bud Abbott and Lou Costello Meet Frankenstein\" (1948). Ironically, in \"House of Frankenstein\" Karloff was cast as the villainous Dr. Niemann opposite Strange as the monster, formerly Karloff's signature character. Beginning in the late 1940's, Strange segued into television and for the rest of his career appeared in numerous shows, again, frequently appearing in Westerns. He guest-starred in six episodes of THE RIFLEMAN, playing variations of the same character in each outing. He was Cole, the stagecoach driver, in \"Duel of Honor\" (episode 7) and a shotgun guard on the stagecoach in \"The Dead-eye Kid\" (episode 20), then Joey, the stagecoach driver, in \"The Woman\" (episode 32), followed by appearances as an unnamed stagecoach driver in \"The Blowout\" (episode 43), \"The Spiked Rifle\" (episode 49) and \"Miss Bertie\" (episode 90). Among the many television shows in which he appeared, Strange guest-starred in \"Annie Oakley\" (1954–1956), \"Death Valley Days\" (1954 1958), \"The Adventures of Champion\" (1955–1956), \"The Cisco Kid\" (1955–1956) and \"The Life and Legend of Wyatt Earp\" (1955 1960). He passed away in 1973, ending his career playing Sam Noonan, the bartender on \"Gunsmoke,\" whom he played for 12 years.\n\nHope Summers as Hattie Denton, Owner of the General Store\n\nHope Summers was an American actress of the stage, radio, film and television. Her acting career began in the 1930's, when she worked primarily in community and stock theater and radio. Her career was most active in the 1950's and 1960's, when she appeared in numerous films and television shows. Her film credits include \"Zero Hour!\" (1957), \"Inherit the Wind\" (1960), \"Spencer's Mountain\" (1963), \"The Hallelujah Trail\" (1965), \"The Ghost and Mr. Chicken\" (1966), \"The Shakiest Gun in the West\" (1968), \"Rosemary's Baby\" (1968), \"Charley Varrick\" (1973) and her last movie, \"Foul Play\" (1978). Summers began working in television in the 1950's, guest-starring in a wide variety of genres, but especially Westerns. Her television credits include \"The Loretta Young Show\" (1956–1959), \"Maverick\" (1957) and \"Wagon Train\" (1957), \"Gunsmoke\" (1958–1963), \"Dennis the Menace\" (1959), \"Petticoat Junction\" (1963) and \"The Phyllis Diller Show\" (1966). She played numerous memorable recurring roles in many hit television series, including \"Hawkins Falls: A Television Novel\" (1950). Her best-known role was Clara Edwards, Aunt Bee's gossipy neighbor, in \"The Andy Griffith Show\" (1960-1968) and its spin-off, \"Mayberry R.F.D.\" (1968–1971). Summers appeared in 16 episodes of THE RIFLEMAN as Hattie Denton, owner of the General Store. Hattie was first introduced in \"Eight Hours to Die\" (episode 6). Her last regular television role was playing Olive in \"Another Day\" (1978).\n\nJames Westerfield as Old Man Healey\n\nJames Westerfield was a prolific American character actor of stage, film and television, as well as a director and producer. His first love was the stage, and he produced and directed several plays on the summer theater circuit. He appeared in more than 150 movies and television shows during his 35-year career. Typecast as a heavy, Westerfield received two New York Drama Critics awards. Although many of his film roles were uncredited, he appeared in many iconic films, often playing memorable characters, including the traffic cop in the Orson Welles adaptation of Booth Tarkington's \"The Magnificent Ambersons\" (1942), starring Joseph Cotton, Dolores Costello and Anne Baxter and the biographical drama \"The Pride of the Yankees\" (1942), starring Gary Cooper; Henry Gilson in the noir film \"Undercurrent\" (1946), starring Katharine Hepburn, Robert Taylor and Robert Mitchum; Officer Hanson in the Disney comedy \"The Shaggy Dog\" (1959), starring Fred MacMurray, a role that he reprised in the Disney films \"The Absent-Minded Professor\" (1961) and \"Son of Flubber\" (1963), both starring Fred MacMurray; Jess Younger in the biographical drama \"Birdman of Alcatraz\" (1962), starring Burt Lancaster; a prisoner in the action film \"Hang 'Em High\" (1968), starring Clint Eastwood; and Judge Parker in the western \"True Grit\" (1969), starring John Wayne and Kim Darby. Westerfield is best-remembered for his portrayal of Big Mac in Elia Kazan's award-winning crime drama \"On the Waterfront\" (1954), starring Marlon Brando, Karl Malden, Rod Steiger and Eva Marie Saint. Westerfield guest-starred in many popular television shows of the 1950s through the 70s, including the crime dramas \"Richard Diamond: Private Detective\" (1957–1960) and \"Mannix\" (1967–1975), the suspense series \"Alfred Hitchcock Presents\" (1955–1962), Rod Serling's anthology series \"The Twilight Zone\" (1959–1964), the family comedy \"My Three Sons\" (1960–1972), the western action adventure \"The Wild Wild West\" (1965–1969), the long-running family drama \"Lassie\" (1954–1974), and the fantasy comedy \"Bewitched\" (1964–1972). He also had recurring roles playing John Murrel in the western \"The Travels of Jaimie McPheeters\" (1963–1964), starring Dan O'Herlihy and Kurt Russell, and the character Mr. Turner in the comedy \"Hazel\" (1961–1966), starring Shirley Booth. Westerfield made two appearances in THE RIFLEMAN, portraying Pa Healey in \"The Woman\" (episode 32) and Jake Preston in \"The Fourflusher\" (episode 72). He guest-starred in many other westerns, including \"The Lone Ranger\" (1949–1957), \"Zane Grey Theater\" (1956–1961), \"Wagon Train\" (1957–1965), \"The Texan\" (1958–1960), \"Bat Masterson\" (1958–1961), \"Wanted: Dead or Alive\" (1958–1961), \"The Deputy\" (1959–1961), \"Laramie\" (1959–1963), \"Maverick\" (1957–1962), \"Tales of Wells Fargo\" (1957–1962), \"Rawhide\" (1959–1966), \"Daniel Boone\" (1964–1970), \"The Virginian\" (1962–1971), \"Gunsmoke\" (1955–1975), and \"Bonanza\" (1959–1973).\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=147", "page_content": "Death Never Rides AloneEpisode 147Writer: David P. HarmonDirector: Joseph H. LewisOriginal Air Date 10/29/1962Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nPatricia Blair as Lou Mallory, Owner of the General Store and the Madera House Hotel\n\nPatricia Blair was an American television actress whose career was active primarily in the 1950s and 1960s. The Texas-born beauty began her career as a teenage model who went on to apprentice in summer stock before being discovered by Warner Bros. She began acting in films under the names Patricia Blake and Pat Blake. She appeared in a few films, including \"Jump Into Hell\" (1955), \"Crime Against Joe\" (1956) and \"The Black Sleep\" (1956), which reunited screen icons of the horror film genre Bela Lugosi, Lon Chaney Jr., Basil Rathbone and John Carradine. She also appeared in the suspense thriller \"City of Fear\" (1959), starring Vince Edwards. She portrayed the Fashion Narrator in the Robert Redford romantic western \"The Electric Horseman\" (1979), co-starring Jane Fonda. In 1962, Blair replaced actress Joan Taylor in a semi-regular role as Lou Mallory, Chuck Connor's love interest in the last season of THE RIFLEMAN. Blair played the attractive red-haired, fiery Irish businesswoman, whose character was savvy Landowner and Owner of the General Store and the Madera House Hotel. Blair's character of Lou Mallory appeared in 17 episodes of THE RIFLEMAN; she debuted in the title role of episode 145. Blair also made guest television appearances on \"The Bob Cummings Show\" (1955–1959), \"The Virginian\" (1962–1971), \"Perry Mason\" (1957–1966), \"Bonanza\" (1959–1973), and she co-starred in \"Daniel Boone\" (1964–1970), playing wife Rebecca Boone opposite Fess Parker. She also had a recurring role as Goldy in the western adventure series \"Yancy Derringer\" (1958–1959).\n\nMel Carter as Mark Jones\n\nMel Carter made eight guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played an outlaw on \"End of a Young Gun\" (episode 3), Walkerman in \"The Safe Guard\" (episode 8), a cowhand in \"The Challenge\" (episode 28), Jed Healy in \"The Woman\" (episode 32), Arnie Grady in \"The Journey Back\" (episode 115), Jeems in \"Outlaw's Shoes\" (episode 141), George Vale's partner Bo Jackman in \"Lou Mallory\" (episode 145), and Mark Jones in \"Death Never Rides Alone\" (episode 147). Carter appeared in many television shows from the late 1950's through late 1980's. In 1987, he co-starred with Chuck Connors in \"Werewolf,\" an episode of the \"Father Jude\" series.\n\nJoe Higgins as Nils Swenson\n\nJoe Higgins was an American actor working primarily in television and commercials from the 1960's through the 1980's. His acting career began at age nine and while attending the University of Dayton in Ohio, he worked in radio. He became a prolific character actor who often portrayed a sheriff in commercials, public service announcements and in print ads. He won the CLIO award on two occasions for his acting in commercials. His portrayal as a sheriff, \"You in a heap o' trouble, boy!,\" in a series of memorable Dodge car commercials in the 1970's became his iconic signature role. Higgins appeared in four episodes of THE RIFLEMAN playing different characters, and he played the semi-regular character, Nils Swenson, the Blacksmith, in 16 episodes. He played recurring roles on other television series in addition to THE RIFLEMAN, including \"Arrest and Trial\" and later, he co-starred again with Chuck Connors in \"Flipper\" and \"Geronimo.\"\n\nRex Holman as Billy Graves\n\nRex Holman, born Rexford George Holman, is an American actor who has worked primarily in television. He has appeared in nearly 100 movies and television shows during a career spanning 30 years. Among his movie credits were roles in the sci-fi thriller \"Panic in the Year Zero!\" (1962), directed by and starring Ray Milland; the sci-fi adventure \"Star Trek V: The Final Frontier\" (1989), starring William Shatner, Leonard Nimoy and DeForest Kelley; the Disney comedy western \"The Apple Dumpling Gang Rides Again\" (1973); and the historical drama \"The Hindenburg\" (1975), starring George C. Scott. He guest-starred in many popular television shows of the 1960s through the 80s, including Rod Serling's iconic anthology series \"The Twilight Zone\" (1959–1964), the medical drama \"Ben Casey\" (1961–1966), the war drama \"Combat!\" (1962–1967), the anthology series \"The Outer Limits\" (1963–1965), the espionage thriller \"The Man from U.N.C.L.E.\" (1964–1968), the science fiction cult classic \"Star Trek\" (1966–1969), the crime drama \"Mannix\" (1967–1975), the police dramas \"The Mod Squad\" (1968–1973) and \"The Streets of San Francisco\" (1972–1977), and the western action adventure \"Kung Fu\" (1972–1975). Holman made three appearances in THE RIFLEMAN, portraying Simms in \"The Jealous Man\" (episode 136), Billy Graves in \"Death Never Rides Alone\" (episode 147) and Bob Sherman in \"Old Man Running\" (episode 166). He guest-starred in several other westerns, including \"The Deputy\" (1959–1961), starring Henry Fonda; \"Bonanza\" (1959–1973), starring Lorne Greene, Michael Landon, Dan Blocker and Pernell Roberts; \"Rawhide\" (1959–1966), starring Clint Eastwood; \"Death Valley Days\" (1952–1975), hosted by Robert Taylor; \"The Big Valley\" (1965–1969), starring Barbara Stanwyck; and \"The Virginian\" (1962–1971), starring James Drury.\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nJohn Rayborn as Red Evans\n\nJohn Rayborn has appeared in nine television shows during a 20-year career. He served in the U.S. Marines during World War II and was awarded a Purple Heart for injuries sustained during the Battle of Saipan. He guest-starred in the detective drama \"Burke's Law\" (1963–1966), the legal drama \"Perry Mason\" (1957–1966), the private eye series \"Cannon\" (1971–1976) and the crime drama anthology series \"Police Story\" (1973–1977). Rayborn made one appearance in THE RIFLEMAN, portraying Red Evans in \"Death Never Rides Alone\" (episode 147). He also guest-starred in \"The Big Valley\" (1965–1969), starring Barbara Stanwyck.\n\nLee Van Cleef as Johnny Drago\n\nLee Van Cleef was an American actor born in Somerville, New Jersey. He was one of the great movie villains, whose distinctive hawk nose, steely glint in his eyes and perpetual snarl in the turn of his mouth destined him to play the heavy in some of the most memorable Westerns and action pictures of the 1950's and 60's. Van Cleef appeared in 90 films and over 100 television series spanning nearly four decades. Before breaking into films, during World War II, Van Cleef served in the United States Navy aboard minesweepers and subchasers. Later, he had a brief career as an accountant and became involved in amateur theatrics in his spare time. An audition for a professional role led to a touring company job in \"Mr. Roberts.\" His performance was seen by Stanley Kramer, who cast him as henchman Jack Colby in \"High Noon\" (1952), a role that brought him great recognition, despite having no dialogue in the film. Over the next decade, he played a string of memorably villainous characters, primarily in Westerns but also in crime dramas such as \"I Cover the Underworld\" and \"The Big Combo,\" both released in 1955. He played another outlaw henchman in John Ford's \"The Man Who Shot Liberty Valance\" (1962). In 1965, Sergio Leone cast him as the tough but decent Colonel Mortimer opposite Clint Eastwood in the Spaghetti Western, \"For a Few Dollars More.\" The following year, he portrayed the character Sentena/Angel Eyes in Leone's \"The Good, The Bad and The Ugly\" (1966). The roles revitalized his flagging career, but now as a western hero, or at least an anti-hero, and he became an international star. His later films, however, were of lesser quality. In the 1980's he moved into action and martial-arts movies. Lee Van Cleef appeared in four episodes of THE RIFLEMAN, portraying Dan Maury in \"The Deadly Wait\" (episode 26), Stinger in \"The Prodigal\" (episode 71), Wicks in \"The Clarence Bibs Story\" (episode 104), Johnny Drago in \"Death Never Rides Alone\" (episode 147). He also co-starred with Chuck Connors in \"Trial by Fear,\" an episode of \"The DuPont Show with June Allyson\" (1960), and in two episodes of Chuck Connors' later series, \"Branded\" (1965-1966). Of his career, Van Cleef once quipped, \" Being born with a pair of beady eyes was the best thing that ever happened to me.\"\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=157", "page_content": "SuspicionEpisode 157Writer: Jay SimmsDirector: Joseph H. LewisOriginal Air Date 01/14/1963Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nPatricia Blair as Lou Mallory, Owner of the General Store and the Madera House Hotel\n\nPatricia Blair was an American television actress whose career was active primarily in the 1950s and 1960s. The Texas-born beauty began her career as a teenage model who went on to apprentice in summer stock before being discovered by Warner Bros. She began acting in films under the names Patricia Blake and Pat Blake. She appeared in a few films, including \"Jump Into Hell\" (1955), \"Crime Against Joe\" (1956) and \"The Black Sleep\" (1956), which reunited screen icons of the horror film genre Bela Lugosi, Lon Chaney Jr., Basil Rathbone and John Carradine. She also appeared in the suspense thriller \"City of Fear\" (1959), starring Vince Edwards. She portrayed the Fashion Narrator in the Robert Redford romantic western \"The Electric Horseman\" (1979), co-starring Jane Fonda. In 1962, Blair replaced actress Joan Taylor in a semi-regular role as Lou Mallory, Chuck Connor's love interest in the last season of THE RIFLEMAN. Blair played the attractive red-haired, fiery Irish businesswoman, whose character was savvy Landowner and Owner of the General Store and the Madera House Hotel. Blair's character of Lou Mallory appeared in 17 episodes of THE RIFLEMAN; she debuted in the title role of episode 145. Blair also made guest television appearances on \"The Bob Cummings Show\" (1955–1959), \"The Virginian\" (1962–1971), \"Perry Mason\" (1957–1966), \"Bonanza\" (1959–1973), and she co-starred in \"Daniel Boone\" (1964–1970), playing wife Rebecca Boone opposite Fess Parker. She also had a recurring role as Goldy in the western adventure series \"Yancy Derringer\" (1958–1959).\n\nWilliam Fawcett as Pyrite Rand\n\nWilliam Fawcett, born William Fawcett Thomas, was a prolific American film and television actor. He appeared in more than 50 movies and 200 television shows in a career spanning more than 35 years. Prior to becoming an actor, Fawcett was ordained as a minister, and he obtained a Ph.D. in Elizabethan drama from the University of Nebraska, Lincoln, then went on to become the Professor of Theatre at Michigan State University. In the mid-1940s he embarked on an acting career full-time. He guest-starred in many popular TV shows, including guest-starring roles in the classic family comedy of the 1950s, \"Leave It to Beaver\" (1957–1963), starring Jerry Mathers, the crime dramas \"Dragnet\" (1951–1959), starring Jack Webb, \"77 Sunset Strip\" (1958–1964), starring Efrem Zimbalist, Jr., \"Perry Mason\" (1957–1966) and \"Ironside\" (1967–1975), both starring Raymond Burr, the mystery action series \"Peter Gunn\" (1958–1961), starring Craig Stevens, Rod Serling's iconic anthology series, \"The Twilight Zone\" (1959–1964), and the adventure series \"The Fugitive\" (1963–1967), starring David Janssen. Most of Fawcett's film appearances were uncredited bit parts. Fawcett made two appearances in THE RIFLEMAN, portraying Mr. Newman in \"Lost Treasure of Canyon Town\" (episode 99) and Pyrite Rand in \"Suspicion\" (episode 157). Fawcett guest-starred in dozens of other westerns, often appearing multiple times as different characters. Among the many westerns in which he appeared were \"The Lone Ranger\" (1949–1957), starring Clayton Moore, \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone, \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen, \"The Deputy\" (1959–1961), starring Henry Fonda, \"The Life and Legend of Wyatt Earp\" (1955–1961), starring Hugh O'Brian, \"Cheyenne\" (1955–1963), starring Clint Walker, \"Maverick\" (1957–1962), starring James Garner, \"Rawhide\" (1959–1966), starring Clint Eastwood, \"Wagon Train\" (1957–1965), starring Ward Bond and later John McIntire, \"Daniel Boone\" (1964–1970), starring Fess Parker, \"Bonanza\" (1959–1973), starring Lorne Greene, Dan Blocker, Pernell Roberts and Michael Landon, \"Gunsmoke\" (1955–1975), starring James Arness, and \"The Virginian\" (1962–1971), starring James Drury and Doug McClure.\n\nJoe Higgins as Nils Swenson\n\nJoe Higgins was an American actor working primarily in television and commercials from the 1960's through the 1980's. His acting career began at age nine and while attending the University of Dayton in Ohio, he worked in radio. He became a prolific character actor who often portrayed a sheriff in commercials, public service announcements and in print ads. He won the CLIO award on two occasions for his acting in commercials. His portrayal as a sheriff, \"You in a heap o' trouble, boy!,\" in a series of memorable Dodge car commercials in the 1970's became his iconic signature role. Higgins appeared in four episodes of THE RIFLEMAN playing different characters, and he played the semi-regular character, Nils Swenson, the Blacksmith, in 16 episodes. He played recurring roles on other television series in addition to THE RIFLEMAN, including \"Arrest and Trial\" and later, he co-starred again with Chuck Connors in \"Flipper\" and \"Geronimo.\"\n\nWilliam \"Billy\" Hughes as Gridley Maule\n\nWilliam \"Billy\" Hughes, born William Eugene Hughes, was an American actor who worked primarily in television. Both his father Bill, Sr. and his uncle Whitey were stuntmen. He appeared in 25 movies and television shows during a two-decade career, which began when he was barely ten playing an uncredited role in the Mickey Rooney crime comedy \"The Nice Little Bank That Should Be Robbed\" (1958). He played the leading role as a runaway in the western \"Ole Rex\" (1961) and portrayed the oldest sibling Joe in a family of orphans in the Debbie Reynolds comedy \"My Six Loves (1963). Toward the end of his career, he had an uncredited stunt role in the Sam Peckinpah film \"The Wild Bunch\" (1969), and in his final film role, he appeared in the obscure western drama \"Smoke in the Wind\" (1975). Hughes guest-starred in several popular television shows, including the family comedy \"Leave It to Beaver\" (1957–1963), the medical drama \"Dr. Kildare\" (1961–1966), Rod Serling's iconic anthology series \"The Twilight Zone\" (1959–1964), the crime drama \"Arrest and Trial\" (1963–1964), the private detective series \"77 Sunset Strip\" (1958–1964) and the family drama \"Lassie\" (1954–1974). As a young teenager, Hughes made three appearances in THE RIFLEMAN, portraying Aaron in \"Day of Reckoning\" (episode 71), Jeffrey Waller in \"The Long Gun from Tuscon\" (episode 121) and Gridley Maule in \"The Sidewinder\" (episode 158). Reportedly, the part he played in \"The Sidewinder\" was one of his favorite roles. He guest-starred in several other westerns, sometimes making multiple appearances, including \"Gunsmoke\" (1955–1975), starring James Arness; \"Laramie\" (1959–1963), starring John Smith and Robert Fuller; and \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond.\n\nKevin McCarthy as Winslow Quince\n\nKevin McCarthy was an American stage, film and television actor whose prolific career spanned more than six decades. Brother of renowned author, Mary McCarthy, he made his Broadway debut in 1938 in \"Abe Lincoln in Illinois\" and appeared in 18 theatrical productions throughout his career, notably, portraying Harry S. Truman in \"Give 'Em Hell Harry,\" which toured the United States for two decades. McCarthy appeared in over 200 film and television roles. His portrayal of Biff in the 1951 film adaptation of \"Death of a Salesman\" garnered him an Academy Award nomination for Best Supporting Actor and won him a Golden Globe Award for New Star of the Year, Actor. His best-known role was Dr. Miles Bennell in the 1956 science fiction horror classic \"Invasion of the Body Snatchers.\" The iconic film was selected for the National Film Registry in 1994 and in 2008 was named one of the Top 10 science fiction films of all time by the American Film Institute. In later years, he embraced the cult camp status of the picture and his role in it, even making a cameo appearance in the 1976 remake of the \"Body Snatchers.\" McCarthy made two appearances in THE RIFLEMAN, portraying Mark Twain in \"The Shattered Idol\" (episode 120) and Winslow Quince in \"Suspicion\" (episode 157). He continued to work until the year before his death at age 96—his last screen appearances were in two 2009 releases, the 18th century period film, \"Wesley,\" and the short comedy film \"I Do.\"\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=4", "page_content": "The MarshalEpisode 4Writer: Sam PeckinpahDirector: Sam PeckinpahOriginal Air Date 10/21/1958Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nR. G. Armstrong as Sheriff Fred Tomlinson\n\nR. G. Armstrong was an American playwright and film and television actor. Trained at the Actors Studio in New York, his filmography lists more than 180 credits spanning 50 years. Armstrong made his first film appearance in \"Garden of Eden\" (1954). While working on the television show \"The Westerner,\" he met writer/director Sam Peckinpah, who cast him in several of his films, including \"Ride the High Country\" (1962), \"Major Dundee\" (1965), \"The Ballad of Cable Hogue\" (1970) and \"Pat Garrett and Billy the Kid\" (1973). Armstrong was also cast in three Warren Beatty films, including \"Heaven Can Wait\" (1978), \"Reds\" (1981) and \"Dick Tracy\" (1990), in which he played the villain Pruneface. Other film credits include the role of Cap'n Dan in \"The Great White Hope\" (1970) and General Phillips \"Predator\" (1987). Armstrong was best-known as a character actor in television Westerns. He appeared in two episodes of THE RIFLEMAN, playing Sheriff Tomlinson in the pilot episode \"The Sharpshooter,\" which was written by Sam Peckinpah, and episode 4, \"The Marshal,\" which was both written and directed by Peckinpah. \"The Marshal\" introduced the title character played by Paul Fix after Armstrong's sheriff was killed by marauding outlaws. Other TV series in which he guest-starred include \"The Texan\" (1958–1959), \"Lawman\" (1959), \"Maverick\" (1959–1960), \"Bonanza\" (1959–1966), \"Cheyenne\" (1960–1961), \"Perry Mason\" (1958–1962), \"Laramie\" (1960–1962), \"Alfred Hitchcock Presents\" (1960–1962), \"Gunsmoke\" (1961–1967), \"Wagon Train\" (1962), \"The Virginian\" (1963–1967), \"The F.B.I.\" (1965–1967), \"T.H.E. Cat\" (1966), \"The Dukes of Hazzard\" (1979–1983), \"Dynasty\" (1982), \"Friday the 13th\" (1987–1989) and \"L. A. Law\" (1992–1993). R. G. Armstrong passed away on July 27, 2012 at age 95.\n\nAbby Dalton as Nancy Moore\n\nAbby Dalton, born Marlene Wasden, is an American actress who spent most of her 50-year career working in television. She has nearly 50 acting credits and was most prolific in the 1960s, when she appeared in many TV shows and is best-remembered for several shows in which she had a recurring role, including Martha Hale in \"Hennesey\" (1959–1962), Joey Bishop's wife, Ellie Barnes, in \"The Joey Bishop Show\" (1961–1965) and later in her career, Julia Cumson in the drama series \"Falcon Crest\" (1981–1990). Dalton also was a regular panelist on the game shows, \"Match Game\" (1962–1969) and \"Hollywood Squares\" (intermittently aired from 1966–1984). Dalton made one appearance in THE RIFLEMAN, portraying Nancy Moore in \"The Marshall\" (episode 4).\n\nJames Drury as Lloyd Carpenter\n\nJames Drury is an American actor in television and film. He has nearly 70 acting credits in a career spanning 50 years. Frequently cast in westerns, in 1991, he was inducted into the Hall of Great Western Performers at the National Cowboy and Western Heritage Museum, Oklahoma City. Among his more illustrious film credits, Drury appeared in the Sam Peckinpah western, \"Ride the High Country\" (1962). Drury had his first major role in the western series \"The Virginian\" (1962–1971), portraying the title character. In 2000, he reprised the role in a TV movie homage, \"The Virginian,\" to the 1960s series. Drury made two appearances in THE RIFLEMAN, playing the role of Lloyd Carpenter in \"The Marshal\" (episode 4) and Spicer in \"Death Trap\" (episode 109). In addition to THE RIFLEMAN, Drury also appeared in other iconic westerns of the 1950s, 60s, and 70s, including \"Lawman\" (1958–1962), \"Gunsmoke\" (1955–1975) and \"Wagon Train\" (1957–1965).\n\nWarren Oates as Andrew Shelton\n\nWarren Oates was an American actor who began his acting career in 1957, starring in a live New York production of the television series \"Studio One.\" He moved to Los Angeles and appeared in numerous television western series. Oates made four appearances in THE RIFLEMAN, portraying Andrew Shelton in \"The Marshal\" (episode 4), Jud Malackie in \"Bloodlines\" (episode 42), Santos in \"The Prodigal\" (episode 71), Marty Ryan in \"Miss Milly\" (episode 84), Will Breen in \"Day of Reckoning\" (episode 139). He met Sam Peckinpah working on THE RIFLEMAN, which began a collaborative relationship on later film projects. He was a prolific actor best-known for his roles in the Peckinpah classics, \"The Wild Bunch\" (1969) and \"Bring Me the Head of Alfredo Garcia\" (1974). His most critically acclaimed role was playing GTO in the 1971 Monte Hellman cult classic \"Two-Lane Blacktop.\" Oates passed away in 1983 and a decade later, in 1993, Tom Thurman produced a documentary tribute film honoring his career, \"Warren Oates: Across the Border.\"\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nBert Stevens as the Doctor\n\nBert Stevens, born Malcolm Byron Stevens and older brother of Barbara Stanwyck, was a prolific American actor who worked primarily in film. He appeared in more than 270 movies and television shows during a career spanning 30 years. Despite his extensive filmography, virtually all of his roles were uncredited. Among his roles in notable films were the romantic comedy \"Mr. Deeds Goes to Town\" (1936), starring Gary Cooper and Jean Arthur; the Orson Welles' classic \"Citizen Kane\" (1941), starring Orson Welles; the crime comedy \"Monsieur Verdoux\" (1947), starring Charlie Chaplin; the biographical drama \"Houdini\" (1953), starring Tony Curtis and Janet Leigh; the George Stevens drama based on the Edna Ferber novel of the same name, \"Giant\" (1956), starring Elizabeth Taylor, Rock Hudson and James Dean; the crime drama \"Witness for the Prosecution\" (1957), starring Tyrone Power, Marlene Dietrich and Charles Laughton; the Alfred Hitchcock mystery adventure \"North by Northwest\" (1959), starring Cary Grant and Eva Marie Saint; the Billy Wilder comedy \"Some Like It Hot\" (1959), starring Marilyn Monroe, Tony Curtis and Jack Lemmon; the historical drama \"Judgment at Nuremberg\" (1961), starring Spencer Tracy, Burt Lancaster and Richard Widmark; the political thriller \"The Manchurian Candidate\" (1962), starring Frank Sinatra, Laurence Harvey, Angela Lansbury and Janet Leigh; and the musical drama \"The Sound of Music\" (1965), starring Julie Andrews and Christopher Plummer. Stevens guest-starred in a few popular television shows of the 1950s and 60s, including the family comedy \"I Love Lucy\" (1951–1957), the crime drama \"The Untouchables\" (1959–1963) and the legal drama \"Perry Mason\" (1957–1966). Stevens made one appearance in THE RIFLEMAN, portraying the doctor in \"The Marshal\" (episode 4). He guest-starred in many other westerns, including \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen, \"Bat Masterson\" (1958–1961), starring Gene Barry, \"The Life and Legend of Wyatt Earp\" (1955–1961), starring Hugh O'Brian, \"Maverick\" (1957–1962), starring Jack Kelly and James Garner, \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone, \"Bonanza\" (1959–1973), starring Lorne Greene, Michael Landon, Dan Blocker and Pernell Roberts, and \"Gunsmoke\" (1955–1975), starring James Arness.\n\nRobert J. Wilke as Florry Sheldon\n\nRobert J. Wilke was a prolific American film and television actor. He appeared in nearly 300 movies and television shows during a career spanning 35 years, sometimes working as a stuntman. A familiar face in westerns, Wilke was typecast as a heavy. He portrayed Jim Pierce in the western \"High Noon\" (1952), starring Gary Cooper, Grace Kelly and Lloyd Bridges. Following this role, Wilke began garnering roles in more prominent movies and television shows. He had a recurring role as Capt. Mendoza in the Disney adventure series \"Zorro\" (1957–1959). Wilke had many film roles, including Madden in the western \"The Far Country\" (1954), starring James Stewart; the First Mate of the Nautilus in the sci-fi adventure \"20,000 Leagues Under the Sea\" (1954), starring Kirk Douglas, James Mason, Paul Lukas and Peter Lorre; the guard captain in the film adaptation of Howard Fast's \"Spartacus\" (1960), starring Kirk Douglas, Laurence Olivier and Jean Simmons; Wallace in the John Sturges epic western \"The Magnificent Seven\" (1960), starring Yul Brynner, Steve McQueen, Charles Bronson, Eli Wallach, Robert Vaughn, Brad Dexter and James Coburn. He portrayed the farm foreman in the romantic tragedy \"Days of Heaven\" (1978), starring Richard Grace, Brooke Adams and Sam Shepard; and in his final role, he played General Barnicke in the war comedy \"Stripes\" (1981), starring Bill Murray. Wilke guest-starred in many popular television shows of the 1950s through the 70s, including the superhero series \"Adventures of Superman\" (1952–1958), the family drama \"Lassie\" (1954–1974), the crime drama \"The Untouchables\" (1959–1963), the private detective series \"77 Sunset Strip\" (1958–1964), the legal drama \"Perry Mason\" (1957–1966), the family comedy \"My Three Sons\" (1960–1972), the adventure drama \"The Fugitive\" (1963–1967), the western action adventure \"The Wild Wild West\" (1965–1969) and the western action adventure \"Kung Fu\" (1972–1975). Wilke made two appearances in THE RIFLEMAN, portraying Florry Sheldon in \"The Marshal\" (episode 4) and Haskins in \"The Pet\" (episode 15). He guest-starred in many other westerns, including \"The Lone Ranger\" (1949–1957), starring Clayton Moore; The Gene Autry Show (1950–1956), Cheyenne (1955–1963), starring Clint Walker, \"The Deputy\" (1959–1961), starring Henry Fonda; \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen; \"Rawhide\" (1959–1966), starring Clint Eastwood; \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond; \"Death Valley Days\" (1952–1975), hosted by Robert Taylor; \"Gunsmoke\" (1955–1975), starring James Arness; and \"Bonanza\" (1959–1973), starring Lorne Greene, Michael Landon, Dan Blocker and Pernell Roberts. His actor friend Claude Akins, who also guest-starred in THE RIFLEMAN (episodes 8, 74 and 81), quipped that Wilke, who was a passionate golfer, earned more money playing golf than from acting.\n\nGuest Cast"}, {"url": "https://www.tvguide.com/tvshows/the-rifleman/cast/1030223317/", "page_content": "Join or Sign In\n\nSign in to customize your TV listings\n\nContinue with Facebook\n\nContinue with email\n\nBy joining TV Guide, you agree to our Terms of Use and acknowledge the data practices in our Privacy Policy."}, {"url": "https://www.therifleman.net/episodes?episode=78", "page_content": "The Woman from Hog RidgeEpisode 78Writer: Calvin J. ClementsDirector: William ClaxtonOriginal Air Date 10/04/1960Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nLane Bradford as Martin\n\nLane Bradford was an American television and film actor. He appeared in more than 250 movies and television shows in a career spanning nearly 35 years. A familiar face in western B movies and television series, many of his film roles in the 1940s and 50s were uncredited. Bradford made his television debut in the crime drama series \"Craig Kennedy, Criminologist\" (1952). He also appeared in \"The Untouchables\" (1959–1963) and \"Perry Mason\" (1957–1966). Bradford guest-starred in most of the major western series of the 1950s and 60s, appearing mulitple times in many of them, including \"The Lone Ranger\" (1949–1957), \"The Adventures of Rin Tin Tin\" (1954–1959), \"Have Gun – Will Travel\" (1957–1963), \"Wagon Train\" (1957–1965), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Cheyenne\" (1955–1963) \"Bonanza\" (1959–1973), and \"Gunsmoke\" (1955–1975). He made one appearance in THE RIFLEMAN, portraying Martin in \"Woman from Hog Ridge\" (episode 78).\n\nRobert F. Hoy as Lester\n\nRobert \"Bobby\" F. Hoy was an American film and television actor, as well as a director and stuntman. He appeared in more than 160 movies and television shows during a career spanning nearly 60 years. After serving in the United States Marines during World War II, Hoy decided to pursue a career in show business. He worked as a stunt double for many acclaimed actors, including Charles Bronson, Tony Curtis, Audie Murphy, Tyrone Power, Jay Silverheels and David Janssen. In 1961, Hoy co-founded the Stuntmen's Association of Motion Pictures. Hoy appeared in numerous films, often playing minor parts or doing stunt work, including the musical drama \"A Star Is Born\" (1954), starring Judy Garland and James Mason; the biographical war drama \"To Hell and Back\" (1955), starring Audie Murphy; Stanley Kubrick's film adaptation of \"Spartacus\" (1960), starring Kirk Douglas, Laurence Olivier and Jean Simmons; the Blake Edwards adventure comedy \"The Great Race\" (1965), starring Tony Curtis, Jack Lemmon and Natalie Wood; the westerns \"Nevada Smith\" (1966), starring Steve McQueen, and \"The Gambler: The Adventure Continues\" (1983), starring Kenny Rogers, as well as William A. Frakers \"The Legend of the Lone Ranger\" (1981). He appeared in several Clint Eastwood pictures, including \"The Outlaw Josey Wales\" and \"The Enforcer\" (both 1976) and \"Bronco Billy\" (1980) Hoy guest-starred in many popular television shows, including the action adventure \"Sea Hunt\" (1958–1961), the anthology series \"Walt Disney's Wonderful World of Color\" (1954–1990), the crime drama \"The Untouchables\" (1959–1963), the war drama \"Combat!\" (1962–1967), the espionage thrillers \"The Man from U.N.C.L.E.\" (1964–1968) and \"Mission: Impossible\" (1966–1973), the science fiction cult classic \"Star Trek\" (1966–1969), the western action adventure \"Kung Fu\" (1972–1975), the police drama \"The Streets of San Francisco\" (1972–1977), the Aaron Spelling fantasy series \"Fantasy Island\" (1977–1984), the medical mystery \"Quincy M.E.\" (1976–1983), the family drama \"Little House on the Prairie\" (1974–1983) and the primetime drama \"Dallas\" (1978–1991). Hoy's most famous role was the recurring character of Joe Butler in the western series \"The High Chaparral\" (1967–1971). He made three appearances in THE RIFLEMAN, portraying Lester in \"Woman from Hog Ridge\" (episode 78), Dabbs in \"The Promoter\" (episode 87) and a member of Wade's gang in \"Which Way Did They Go?\" (episode 167). He guest-starred in many other westerns, the genre for which he was best-known and most fondly remembered, including \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone; \"Zane Grey Theater\" (1956–1961), starring Dick Powell; \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen; \"Bat Masterson\" (1958–1961), starring Gene Barry; \"Branded\" (1965–1966), starring THE RIFLEMAN's Chuck Connors; and \"Bonanza\" (1959–1973), starring Lorne Greene, Michael Landon, Dan Blocker and Pernell Roberts. Toward the end of his life, Hoy was honored with a Golden Boot Award by the Motion Picture and Television Fund for making significant contributions to the western genre. He made his final television appearance in the crime drama \"NCIS\" (2003– ).\n\nJim Hurst as Sylvester\n\nJim Hurst appeared in six television shows in five years. He guest-starred in the private detective series \"77 Sunset Strip\" (1958–1964) and made one appearance in THE RIFLEMAN, portraying Sylvester in \"Woman From Hog Ridge\" (episode 78). He guest-starred in a few other westerns, including \"Bronco\" (1958–1962), starring Ty Hardin; \"Cheyenne\" (1955–1963), starring Clint Walker; \"The Virginian\" (1962–1971), starring James Drury; and \"Branded\" (1965–1966), starring THE RIFLEMAN's Chuck Connors.\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nJan Stine as Johnny\n\nJan Stine, born Jan Russell Stine, was an American actor who primarily worked in television. He appeared in nearly 30 movies and television shows during his brief career. He guest-starred in several popular shows of the 1950s and 60s, including the comedy \"The Real McCoys\" (1957–1963), the family comedy \"The Many Loves of Dobie Gillis\" (1959–1963), the legal drama \"Perry Mason\" (1957–1966) and the long-running family drama \"Lassie\" (1954–1974). Stine made two appearances in THE RIFLEMAN, portraying Johnny in \"Woman from Hog Ridge\" (episode 78) and Gorwin Morgan in \"The High Country\" (episode 122). He guest-starred in a few other westerns, including \"Zane Grey Theater\" (1956–1961), starring Dick Powell; \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen; and \"The Virginian\" (1962–1971), starring James Drury.\n\nCharles Tannen as Josh Moore, Storekeeper at the Hardware Store\n\nCharles Tannen, born Charles David Tannen, was an American television and film actor who appeared in more than 200 movies and television shows during his 30-year career. He had uncredited roles in numerous films, including the romantic drama \"The Dark Angel\" (1935), starring Fredric March and Merle Oberon; the biographical drama \"Young Mr. Lincoln\" (1939), starring Henry Fonda; the crime drama \"The Street with No Name\" (1948), starring Mark Stevens and Richard Widmark; the landmark sci-fi drama \"The Day the Earth Stood Still\" (1951), starring Michael Rennie and Patricia Neal; and the sci-fi horror film \"The Fly\" (1958), starring David Hedison and Vincent Price. Although his uncredited roles outnumber the credited ones, Tannen was cast in significant parts in several Henry Fonda films, including Charles Ford in the westerns \"Jesse James\" (1939) and \"The Return of Frank James\" (1940), and Joe in the film adaptation of John Steinbeck's \"The Grapes of Wrath\" (1940). Tannen guest-starred in many television shows of the 1950s through the 70s, including the family comedy \"Father Knows Best\" (1954–1960), the crime drama \"77 Sunset Strip\" (1958–1964), the mystery action series \"Peter Gunn\" (1958–1961), the family comedy \"Mister Ed\" (1958–1966), the legal drama \"Perry Mason\" (1957–1966), the long-running family drama \"Lassie\" (1954–1974), Rod Serling's iconic anthology series, \"The Twilight Zone\" (1959–1964), and the comedy \"Petticoat Junction\" (1963–1970). Tannen made six guest appearances in THE RIFLEMAN, portraying Barney the barber in \"The Boarding House\" (episode 22), the bartender in \"Sins of the Father\" (episode 70), Josh Moore in \"The Jailbird\" (episode 73) and \"Woman from Hog Ridge\" (episode 78), Mr. Penn in \"Miss Milly\" (episode 84), and Jack Carson in \"The Actress\" (episode 94). He guest-starred in many other westerns, including \"The Roy Rogers Show\" (1951–1957), \"Maverick\" (1957–1962), \"Zane Grey Theater\" (1956–1961), \"Have Gun – Will Travel\" (1957–1963), \"Laramie\" (1959–1963), \"Death Valley Days\" (1952–1975), \"Bonanza\" (1959–1973), \"Tales of Wells Fargo\" (1957–1962), \"Gunsmoke\" (1955–1975), \"Cheyenne\" (1955–1963) and \"Rawhide\" (1959–1966).\n\nDee J. Thompson as Ma Boyle\n\nDee J. Thompson appeared in 35 movies and television shows during a 20-year career. She portrayed Donna in the romantic comedy \"The Glass Bottom Boat\" (1966), starring Doris Day, Rod Taylor and Arthur Godfrey. She guest-starred in several popular television shows of the 1950s and 60s, including the crime drama \"Dragnet\" (1951–1959), the mystery action series \"Peter Gunn\" (1958–1961), the comedy \"Hazel\" (1961–1966), the suspense anthology series \"Alfred Hitchcock Presents\" (1955–1962) and the family comedy \"My Three Sons\" (1960–1972). She had a recurring role playing Agnes in the Imogene Coca comedy \"Grindl\" (1963–1964). Thompson made one appearance in THE RIFLEMAN, portraying Ma Boyle in \"Woman from Hog Ridge\" (episode 78). She also guest-starred in the westerns \"Gunsmoke\" (1955–1975), starring James Arness, and \"The Big Valley\" (1965–1969), starring Barbara Stanwyck.\n\nGuest Cast"}]}