{"William Quinn directed several episodes of The Rifleman.": [{"url": "https://www.therifleman.net/episodes?episode=53", "page_content": "The CowardEpisode 53Writer: Philip Saltzman and Clair HuffakerDirector: James NeilsonOriginal Air Date 12/22/1959Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nRobert Bice as Ben Smith\n\nRobert Bice made five guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played Joe Hallager in \"The Mind Reader\" (episode 40), Ben Smith in \"The Coward\" (episode 53), The Warden of New Mexico Territory in \"Seven\" (episode 79), and Len Richards in \"Deadly Image\" (episode 138).\n\nCarleton Carpenter as George Collins\n\nCarleton Carpenter is an American stage, film and television actor, as well as a magician, author and songwriter. He has appeared in nearly 40 movies and television shows in a career spanning more than 30 years. Prior to signing to Metro-Goldwyn-Mayer, Carpenter worked on Broadway, both as a magician and an actor. He appeared in many films starring movie and stage legends such as Ray Bolger in \"Three to Make Ready,\" Bert Lahr and Angela Lansbury in \"Hotel Paradiso\" and Judy Garland in the film \"Summer Stock\" (1950). Carpenter had starring roles in \"Fearless Fagan\" (1952), co-starring Janet Leigh, and \"Sky Full of Moon\" (1952), with Jan Sterling. Carpenter appeared in several popular series of the 1950s and 60s, including \"G.E. True Theater\" (1953–1962) and \"Perry Mason\" (1957–1966). He made one guest appearance in THE RIFLEMAN, portraying George Collins in \"The Coward\" (episode 153). Carleton had many talents besides acting; they included composing songs and writing novels. Among his hits compositions were \"Christmas Eve,\" \"Cabin in the Woods\" and \"Ev'ry Other Day.\" During the 1970s and 80s, Carpenter became a best-selling mystery novelist. One of his more popular books, \"Deadhead\" (1974), was adapted to a Broadway musical. He also authored several short stories, which were featured in the Alfred Hitchcock and Ellery Queen mystery magazines.\n\nDonald Elson as the Printer\n\nDonald Elson is an American film and television actor. He has appeared in nearly 50 movies and television shows in a career spanning more than 50 years. He has guest-starred in various popular shows, including the gothic horror series \"Thriller\" (1960–1962), starring Boris Karloff, the campy take on the comic book hero \"Batman\" (1966–1968), starring Adam West, the crime drama \"Ironside\" (1967–1975), starring Raymond Burr as a wheelchair-bound detective, the classic family drama \"Little House on the Prairie\" (1974–1983), starring Melissa Gilbert and Michael Landon, who also directed, and the tongue-in-cheek whodunit \"Murder, She Wrote\" (1984–1996), starring Angela Lansbury. Elson made two appearances in THE RIFLEMAN, portraying the printer in \"The Coward\" (episode 53), and Aaron the liveryman in \"Outlaw's Shows\" (episode 141). He also guest-starred in the westerns \"Bonanza\" (1959–1973), starring Lorne Greene, Dan Blocker, Pernell Roberts and Michael Landon, and also \"Gunsmoke\" (1955–1975), starring James Arness.\n\nJohn Milford as Dub\n\nJohn Milford was an American actor, whose long career, primarily in television, included more than 164 acting roles spanning five decades. His first big break came with an uncredited appearance in the 1956 Oscar awarding winning film \"Marty,\" starring Ernest Borgnine. Milford appeared in every television genre, from crime dramas, including \"The F.B.I.\" (1965–1974) and \"Mannix\" (1967–1975), among many others, to sci-fi adventures, including \"The Six Million Dollar Man\" (1974–1978) and its spin-off \"The Bionic Woman\" (1976–1978). He appeared in many of the most popular series of their eras, including the sci-fi thriller \"The Invaders\" (1967–1968), sci-fi mini-series \"The Planet of the Apes (1974), the family dramas \"Little House on the Prairie\" (1974–1983) and \"Highway to Heaven\" (1984–1989), and the sci-fi mystery \"The X-Files\" (1993–2002). Milford played recurring roles in several series, including Ike Clanton for one season in \"The Life and Legend of Wyatt Earp (1955–1961), Sgt. Kagey in \"The Lieutenant\" (1963–1964), Lt. Paul Hewitt in \"The Bold Ones: The Lawyers\" (1969–1972), and a co-starring role as Captain Dempsey in the action comedy \"Enos\" (1980–1981). In addition to the Wyatt Earp series, Milford appeared in many of the most popular western series of the 1950s through '70s, including \"Bonanza\" (1959–1973), \"The Virginian\" (1962–1971) and \"The Big Valley\" (1965–1969). John Milford made eleven appearances in THE RIFLEMAN, portraying Ross Porter in \"The Blowout\" (episode 43), Dub in \"The Coward\" (episode 53), Jonas Winters in \"The Horsetraders\" (episode 60), Bro Hadley in \"A Time for Singing\" (episode 64), Morgan in \"Meeting at Midnight\" (episode 74), Marsh Watson in \"The Pitchman\" (episode 80), Hadley in \"Baranca\" (episode 82), Jack Solby in \"Dark Day at North Fork\" (episode 100), Reade in \"The Clarence Bibs Story\" (episode 104), Jess Grady in \"The Journey Back\" (episode 115) and Lt. Price in \"The Assailants\" (episode 149). Milford also appeared in two episodes of THE RIFLEMAN spin-off \"Law of the Plainsman\" (1959–1960). Milford ran the Chamber Theatre on Cahuenga Blvd. West in Hollywood, where he helped many young actors get a start in the entertainment industry. He is also credited with the original design for the Hollywood Walk of Fame.\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nSteve Rowland as Buddy Link\n\nSteve Rowland, born Stephen Jacob Rowland, is an American television and film actor, in addition to being a singer, columnist and record producer. During the 1960s, Rowland relocated to London, where he produced 13 Top Ten hits for Dave, Dee, Dozy, Beaky, Mick & Tich. He also produced hits for P.J. Proby and The Pretty Things. He received a gold album and an award from the American Society of Composers, Authors and Publishers during the 1970s. While serving as the creative manager for Ariola Records, Rowland discovered and signed The Cure and the Thompson Twins, in addition to handling Boney M and Japan. Rowland had several film roles, including an uncredited role in the romantic western \"The Moonlighter\" (1953), starring Barbara Stanwyck and Fred MacMurray; Glasses in the crime drama \"Crime in the Streets\" (1956), starring John Cassavetes, Sal Mineo and James Whitmore; and Eddy in the war drama \"Battle of the Bulge\" (1965), starring Henry Fonda, Robert Shaw, Robert Ryan and Dana Andrews. Outside of film, Rowland has appeared almost exclusively in westerns, including having a recurring role as Phin Clanton in \"The Life and Legend of Wyatt Earp\" (1955–1961), starring Hugh O'Brian. Rowland made two appearances in THE RIFLEMAN, portraying Billy Lehi in \"Home Ranch\" (episode 2) and Buddy Link in \"The Coward\" (episode 53). He guest-starred in several other westerns, including \"Hopalong Cassidy\" (1952–1954), starring William Boyd; \"Tales of Wells Fargo\" (1957–1962), starring Dale Robertson; \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond; \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen; and \"Bonanza\" (1959–1973), starring Lorne Greene, Michael Landon, Dan Blocker and Pernell Roberts.\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=121", "page_content": "Long Gun from TucsonEpisode 121Writer: Calvin J. ClementsDirector: Joseph H. LewisOriginal Air Date 12/11/1961Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nWhit Bissell as Henry Waller\n\nWhit Bissell, born Whitner Nutting Bissell, was a prolific American television and film actor who made his acting debut on Broadway. He appeared in nearly 300 television shows and movies in a career spanning more than 40 years. Although he appeared in several cult horror films of the 1950s, including the classic sci-fi thriller, \"Invasion of the Body Snatchers\" (1956), he is probably best-known for portraying the mad scientist who turned Michael Landon into a beast in \"I Was a Teenage Werewolf\" (1957). Bissell appeared in numerous TV shows of every genre popular in the 1950s through the early 80s, including \"Peyton Place\" (1965), \"Perry Mason\" (1957–1966), \"Marcus Welby, M.D.\" (1970–1973), \"The Incredible Hulk\" (1979–1980), and many western series, including \"The Lone Ranger\" (1947–1959), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Have Gun – Will Travel\" (1957–1963), \"Wagon Train\" (1958–1964), \"Bonanza\" (1959–1973) and \"The Virginian\" (1963–1964). Bissell also had recurring roles as Bert Loomis in the comedy series, \"Bachelor Father\" (1957–1962), and Lt. Gen. Heywood Kirk in the sci-fi series, \"The Time Tunnel\" (1966–1967). Bissell made four appearances in THE RIFLEMAN, portraying Sam Barrows in \"The Patsy\" (episode 41), Gabe Fenway in \"The Flourflusher\" (episode 72), Volney Adams in \"The Hangman\" (episode 76) and Henry Waller in \"The Long Gun from Tucson\" (episode 121). In 1994, Bissell received a lifetime achievement award from the Academy of Science Fiction, Fantasy & Horror Films. He also served on the board of directors of the Screen Actors Guild and represented the actors branch of the Academy of Motion Picture Arts and Sciences board of governors.\n\nJohn Harmon as Eddie Halstead, Hotel Clerk at the Hotel Madera/California House\n\nJohn Harmon was an American actor who appeared in over 250 roles in film and television from the 1930's through the 1970's. His early roles were mostly uncredited, but he was cast in a wide variety of genres and played many different kinds of characters. Harmon appeared in 15 episodes of THE RIFLEMAN as Eddie Halstead Hotel Clerk at the Hotel Madera. The character of Halstead was first introduced in episode 7, \"Duel of Honor.\"\n\nJoe Higgins as Nils Swenson\n\nJoe Higgins was an American actor working primarily in television and commercials from the 1960's through the 1980's. His acting career began at age nine and while attending the University of Dayton in Ohio, he worked in radio. He became a prolific character actor who often portrayed a sheriff in commercials, public service announcements and in print ads. He won the CLIO award on two occasions for his acting in commercials. His portrayal as a sheriff, \"You in a heap o' trouble, boy!,\" in a series of memorable Dodge car commercials in the 1970's became his iconic signature role. Higgins appeared in four episodes of THE RIFLEMAN playing different characters, and he played the semi-regular character, Nils Swenson, the Blacksmith, in 16 episodes. He played recurring roles on other television series in addition to THE RIFLEMAN, including \"Arrest and Trial\" and later, he co-starred again with Chuck Connors in \"Flipper\" and \"Geronimo.\"\n\nWilliam \"Billy\" Hughes as Jeffrey Waller\n\nWilliam \"Billy\" Hughes, born William Eugene Hughes, was an American actor who worked primarily in television. Both his father Bill, Sr. and his uncle Whitey were stuntmen. He appeared in 25 movies and television shows during a two-decade career, which began when he was barely ten playing an uncredited role in the Mickey Rooney crime comedy \"The Nice Little Bank That Should Be Robbed\" (1958). He played the leading role as a runaway in the western \"Ole Rex\" (1961) and portrayed the oldest sibling Joe in a family of orphans in the Debbie Reynolds comedy \"My Six Loves (1963). Toward the end of his career, he had an uncredited stunt role in the Sam Peckinpah film \"The Wild Bunch\" (1969), and in his final film role, he appeared in the obscure western drama \"Smoke in the Wind\" (1975). Hughes guest-starred in several popular television shows, including the family comedy \"Leave It to Beaver\" (1957–1963), the medical drama \"Dr. Kildare\" (1961–1966), Rod Serling's iconic anthology series \"The Twilight Zone\" (1959–1964), the crime drama \"Arrest and Trial\" (1963–1964), the private detective series \"77 Sunset Strip\" (1958–1964) and the family drama \"Lassie\" (1954–1974). As a young teenager, Hughes made three appearances in THE RIFLEMAN, portraying Aaron in \"Day of Reckoning\" (episode 71), Jeffrey Waller in \"The Long Gun from Tuscon\" (episode 121) and Gridley Maule in \"The Sidewinder\" (episode 158). Reportedly, the part he played in \"The Sidewinder\" was one of his favorite roles. He guest-starred in several other westerns, sometimes making multiple appearances, including \"Gunsmoke\" (1955–1975), starring James Arness; \"Laramie\" (1959–1963), starring John Smith and Robert Fuller; and \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond.\n\nBrian G. Hutton as Deecie\n\nBrian Hutton was an American film and television actor, as well as director. He appeared in more than 30 movies and television shows and directed nine films during a two-decade career. He made his directorial debut with \"The Wild Seed\" (1965), starring Michael Parkins and Celia Kaye. His most notable films include the World War II thriller \"Where the Eagles Dare\" (1968), starring Richard Burton and Clint Eastwood; the war comedy \"Kelly's Heroes\" (1970), starring Clint Eastwood, Telly Savalas, Don Rickles and Carroll O'Connor; the psychological drama about a romantic triangle \"X, Y, and Zee\" (1972) starring Elizabeth Taylor, Michael Caine and Susannah York; and the romantic adventure \"High Road to China\" (1983), starring Tom Selleck and Bess Armstrong. Hutton also had acting roles in a few films, including the western \"Gunfight at the O.K. Corral\" (1957), starring Burt Lancaster and Kirk Douglas, and the western \"Last Train to Gun Hill\" (1959), starring Kirk Douglas, Anthony Quinn and Carolyn Jones. In addition to film, Hutton guest-starred in a few popular television shows, including the legal drama \"Perry Mason\" (1957–1966) and the suspense anthology series \"Alfred Hitchcock Presents\" (1955–1962). Hutton made two appearances in THE RIFLEMAN, portraying Deecie in \"Long Gun from Tuscon\" (episode 121) and Billy Benson in \"Obituary\" (episode 44). He guest-starred in several other westerns, including \"Gunsmoke\" (1955–1975), starring James Arness; \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone; \"Rawhide\" (1959–1966), starring Clint Eastwood; \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond; and \"Laramie\" (1959–1963), starring John Smith and Robert Fuller. He also had an uncredited part in \"Geronimo\" (1962), starring THE RIFLEMAN's Chuck Connors in the title role.\n\nPeter Whitney as John Holliver\n\nPeter Whitney was an American television and film actor whose large frame and heavy-set, swarthy appearance brought him many roles playing villainous characters in his early career. Later, as a character actor, he made frequent appearances in television series, particularly the western genre. Among his film credits, he appeared in \"In the Heat of the Night\" (1967), \"The Great Bank Robbery\" (1969), and \"The Ballad of Cable Hogue\" (1970). Whitney made nine appearances in THE RIFLEMAN, portraying Tracey Blanch in \"Eddie's Daughter\" (episode 46), John Jupiter in \"Mail Order Groom\" (episode 56), Andrew Bechtel in \"Heller\" (episode 62), Otto Drosheck in \"Strange Town\" (episode 81), Vince Fergus in \"The Queue\" (episode 110), John Holliver in \"Long Gun from Tucson\" (episode 121), Neb Jackman in 'Lou Mallory\" (episode 145) and \"Which Way Did They Go?\" (episode 167), and Vantine in \"Gun Shy\" (episode 153).\n\nGuest Cast"}, {"url": "https://www.tvguide.com/tvshows/the-rifleman/cast/1030223317/", "page_content": "Join or Sign In\n\nSign in to customize your TV listings\n\nContinue with Facebook\n\nContinue with email\n\nBy joining TV Guide, you agree to our Terms of Use and acknowledge the data practices in our Privacy Policy."}, {"url": "https://www.therifleman.net/episodes?episode=147", "page_content": "Death Never Rides AloneEpisode 147Writer: David P. HarmonDirector: Joseph H. LewisOriginal Air Date 10/29/1962Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nPatricia Blair as Lou Mallory, Owner of the General Store and the Madera House Hotel\n\nPatricia Blair was an American television actress whose career was active primarily in the 1950s and 1960s. The Texas-born beauty began her career as a teenage model who went on to apprentice in summer stock before being discovered by Warner Bros. She began acting in films under the names Patricia Blake and Pat Blake. She appeared in a few films, including \"Jump Into Hell\" (1955), \"Crime Against Joe\" (1956) and \"The Black Sleep\" (1956), which reunited screen icons of the horror film genre Bela Lugosi, Lon Chaney Jr., Basil Rathbone and John Carradine. She also appeared in the suspense thriller \"City of Fear\" (1959), starring Vince Edwards. She portrayed the Fashion Narrator in the Robert Redford romantic western \"The Electric Horseman\" (1979), co-starring Jane Fonda. In 1962, Blair replaced actress Joan Taylor in a semi-regular role as Lou Mallory, Chuck Connor's love interest in the last season of THE RIFLEMAN. Blair played the attractive red-haired, fiery Irish businesswoman, whose character was savvy Landowner and Owner of the General Store and the Madera House Hotel. Blair's character of Lou Mallory appeared in 17 episodes of THE RIFLEMAN; she debuted in the title role of episode 145. Blair also made guest television appearances on \"The Bob Cummings Show\" (1955–1959), \"The Virginian\" (1962–1971), \"Perry Mason\" (1957–1966), \"Bonanza\" (1959–1973), and she co-starred in \"Daniel Boone\" (1964–1970), playing wife Rebecca Boone opposite Fess Parker. She also had a recurring role as Goldy in the western adventure series \"Yancy Derringer\" (1958–1959).\n\nMel Carter as Mark Jones\n\nMel Carter made eight guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played an outlaw on \"End of a Young Gun\" (episode 3), Walkerman in \"The Safe Guard\" (episode 8), a cowhand in \"The Challenge\" (episode 28), Jed Healy in \"The Woman\" (episode 32), Arnie Grady in \"The Journey Back\" (episode 115), Jeems in \"Outlaw's Shoes\" (episode 141), George Vale's partner Bo Jackman in \"Lou Mallory\" (episode 145), and Mark Jones in \"Death Never Rides Alone\" (episode 147). Carter appeared in many television shows from the late 1950's through late 1980's. In 1987, he co-starred with Chuck Connors in \"Werewolf,\" an episode of the \"Father Jude\" series.\n\nJoe Higgins as Nils Swenson\n\nJoe Higgins was an American actor working primarily in television and commercials from the 1960's through the 1980's. His acting career began at age nine and while attending the University of Dayton in Ohio, he worked in radio. He became a prolific character actor who often portrayed a sheriff in commercials, public service announcements and in print ads. He won the CLIO award on two occasions for his acting in commercials. His portrayal as a sheriff, \"You in a heap o' trouble, boy!,\" in a series of memorable Dodge car commercials in the 1970's became his iconic signature role. Higgins appeared in four episodes of THE RIFLEMAN playing different characters, and he played the semi-regular character, Nils Swenson, the Blacksmith, in 16 episodes. He played recurring roles on other television series in addition to THE RIFLEMAN, including \"Arrest and Trial\" and later, he co-starred again with Chuck Connors in \"Flipper\" and \"Geronimo.\"\n\nRex Holman as Billy Graves\n\nRex Holman, born Rexford George Holman, is an American actor who has worked primarily in television. He has appeared in nearly 100 movies and television shows during a career spanning 30 years. Among his movie credits were roles in the sci-fi thriller \"Panic in the Year Zero!\" (1962), directed by and starring Ray Milland; the sci-fi adventure \"Star Trek V: The Final Frontier\" (1989), starring William Shatner, Leonard Nimoy and DeForest Kelley; the Disney comedy western \"The Apple Dumpling Gang Rides Again\" (1973); and the historical drama \"The Hindenburg\" (1975), starring George C. Scott. He guest-starred in many popular television shows of the 1960s through the 80s, including Rod Serling's iconic anthology series \"The Twilight Zone\" (1959–1964), the medical drama \"Ben Casey\" (1961–1966), the war drama \"Combat!\" (1962–1967), the anthology series \"The Outer Limits\" (1963–1965), the espionage thriller \"The Man from U.N.C.L.E.\" (1964–1968), the science fiction cult classic \"Star Trek\" (1966–1969), the crime drama \"Mannix\" (1967–1975), the police dramas \"The Mod Squad\" (1968–1973) and \"The Streets of San Francisco\" (1972–1977), and the western action adventure \"Kung Fu\" (1972–1975). Holman made three appearances in THE RIFLEMAN, portraying Simms in \"The Jealous Man\" (episode 136), Billy Graves in \"Death Never Rides Alone\" (episode 147) and Bob Sherman in \"Old Man Running\" (episode 166). He guest-starred in several other westerns, including \"The Deputy\" (1959–1961), starring Henry Fonda; \"Bonanza\" (1959–1973), starring Lorne Greene, Michael Landon, Dan Blocker and Pernell Roberts; \"Rawhide\" (1959–1966), starring Clint Eastwood; \"Death Valley Days\" (1952–1975), hosted by Robert Taylor; \"The Big Valley\" (1965–1969), starring Barbara Stanwyck; and \"The Virginian\" (1962–1971), starring James Drury.\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nJohn Rayborn as Red Evans\n\nJohn Rayborn has appeared in nine television shows during a 20-year career. He served in the U.S. Marines during World War II and was awarded a Purple Heart for injuries sustained during the Battle of Saipan. He guest-starred in the detective drama \"Burke's Law\" (1963–1966), the legal drama \"Perry Mason\" (1957–1966), the private eye series \"Cannon\" (1971–1976) and the crime drama anthology series \"Police Story\" (1973–1977). Rayborn made one appearance in THE RIFLEMAN, portraying Red Evans in \"Death Never Rides Alone\" (episode 147). He also guest-starred in \"The Big Valley\" (1965–1969), starring Barbara Stanwyck.\n\nLee Van Cleef as Johnny Drago\n\nLee Van Cleef was an American actor born in Somerville, New Jersey. He was one of the great movie villains, whose distinctive hawk nose, steely glint in his eyes and perpetual snarl in the turn of his mouth destined him to play the heavy in some of the most memorable Westerns and action pictures of the 1950's and 60's. Van Cleef appeared in 90 films and over 100 television series spanning nearly four decades. Before breaking into films, during World War II, Van Cleef served in the United States Navy aboard minesweepers and subchasers. Later, he had a brief career as an accountant and became involved in amateur theatrics in his spare time. An audition for a professional role led to a touring company job in \"Mr. Roberts.\" His performance was seen by Stanley Kramer, who cast him as henchman Jack Colby in \"High Noon\" (1952), a role that brought him great recognition, despite having no dialogue in the film. Over the next decade, he played a string of memorably villainous characters, primarily in Westerns but also in crime dramas such as \"I Cover the Underworld\" and \"The Big Combo,\" both released in 1955. He played another outlaw henchman in John Ford's \"The Man Who Shot Liberty Valance\" (1962). In 1965, Sergio Leone cast him as the tough but decent Colonel Mortimer opposite Clint Eastwood in the Spaghetti Western, \"For a Few Dollars More.\" The following year, he portrayed the character Sentena/Angel Eyes in Leone's \"The Good, The Bad and The Ugly\" (1966). The roles revitalized his flagging career, but now as a western hero, or at least an anti-hero, and he became an international star. His later films, however, were of lesser quality. In the 1980's he moved into action and martial-arts movies. Lee Van Cleef appeared in four episodes of THE RIFLEMAN, portraying Dan Maury in \"The Deadly Wait\" (episode 26), Stinger in \"The Prodigal\" (episode 71), Wicks in \"The Clarence Bibs Story\" (episode 104), Johnny Drago in \"Death Never Rides Alone\" (episode 147). He also co-starred with Chuck Connors in \"Trial by Fear,\" an episode of \"The DuPont Show with June Allyson\" (1960), and in two episodes of Chuck Connors' later series, \"Branded\" (1965-1966). Of his career, Van Cleef once quipped, \" Being born with a pair of beady eyes was the best thing that ever happened to me.\"\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=32", "page_content": "The WomanEpisode 32Writer: Pat FielderDirector: Arnold LavenOriginal Air Date 05/05/1959Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nPatricia Barry as Adele Adams\n\nPatricia Barry, born Patricia White, is an American actress who has appeared in more than 130 television shows and movies in a career spanning 50 years. Barry was signed to Columbus Pictures following her graduation from Stephens College, Columbia, MO. She appeared in numerous TV series and soap operas popular in the 1950s through the 90s, including \"Twilight Zone\" (1959–1964), \"Perry Mason\" (1957–1966) \"Dr. Kildaire\" (1962–1965), \"The Bold Ones: The Lawyers\" (1972), \"Columbo\" (1975), \"Charlie's Angels\" (1976), \"Guiding Light\" (1984–1987) and \"Murder, She Wrote\" (1989–1994). Barry also starred in her own TV series, playing the title role of Kate Harris in \"Harris Against the World\" (1965–1965). She also appeared in two critically acclaimed made-for-TV movies, \"First, You Cry\" (1978) and \"Bogie\" (1980). She made three appearances in The RIFLEMAN, portraying Adele Adams in \"Three-Legged Terror\" (episode 30) and \"The Woman\" (episode 32), as well as Laurie Hadley in \"A Time for Singing\" (episode 64). Barry also guest-starred in other TV westerns, including \"The Virginian\" (1962–1971) and \"Gunsmoke\" (1955–1975).\n\nFern Barry as Townswoman\n\nFern Barry was an American film and television actress. She appeared in nearly 50 television shows and movies in a career spanning more than 40 years. Many of her acting roles were uncredited. Working mostly during the 1930s, 50s and 60s, Barry appeared in several popular TV series, including and \"The Donna Reed Show\" (1960) and the popular crime drama series \"Perry Mason\" (1957–1966). She made two appearances in The RIFLEMAN, portraying a townswoman in \"The Woman\" (episode 32) and Callie Sawyer in \"The Horsetraders\" (episode 60). Barry also guest–starred in \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Wagon Train\" (1957–1965) and \"Rawhide\" (1960).\n\nPaul Carr as Garth Healey\n\nPaul Carr made four guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played Derek Hanaway in \"Shivaree\" (episode 19), Garth Healey in \"The Woman\" (episode 32), Fred Harris in \"Letter of the Law\" (episode 50), and Doug Carter in \"Smoke Screen\" (episode 68).\n\nMel Carter as Jed Healy\n\nMel Carter made eight guest appearances in THE RIFLEMAN, portraying different characters in each episode. He played an outlaw on \"End of a Young Gun\" (episode 3), Walkerman in \"The Safe Guard\" (episode 8), a cowhand in \"The Challenge\" (episode 28), Jed Healy in \"The Woman\" (episode 32), Arnie Grady in \"The Journey Back\" (episode 115), Jeems in \"Outlaw's Shoes\" (episode 141), George Vale's partner Bo Jackman in \"Lou Mallory\" (episode 145), and Mark Jones in \"Death Never Rides Alone\" (episode 147). Carter appeared in many television shows from the late 1950's through late 1980's. In 1987, he co-starred with Chuck Connors in \"Werewolf,\" an episode of the \"Father Jude\" series.\n\nDavid Leland as Cousin Healey\n\nDavid Leland was an American actor who worked primarily in television, appearing in 14 TV shows and movies during a decade-long career. He appeared in the crime drama \"M Squad\" (1957–1960) and several westerns, including \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone, \"Zane Grey Theater\" (1956–1961), starring Dick Powell, \"Bronco\" (1958–1962), starring Ty Hardin, \"The Restless Gun\" (1957–1959), starring John Payne, \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen, \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond, and \"Laredo\" (1965–1967), starring Neville Brand, Peter Brown and William Smith. Leland made one appearance in THE RIFLEMAN, portraying Cousin Healey in \"The Woman\" (episode 32).\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nGlenn Strange as Stagecoach Driver\n\nGlenn Strange was an American actor most well known for playing roles in the Western and Horror genres. Growing up in New Mexico, he had been a rancher, cowboy and rodeo performer—a background that lent authenticity to the Western characters he played. In the 1920's he learned to play the fiddle and guitar, and toured the country with a radio singing group, the Arizona Wranglers. He came to Hollywood in 1930 with the ensemble and began landing small parts in \"B\" Westerns. At 6' 5\" tall, he had a large, rugged frame and heavy features—attributes that tended to typecast him as villainous and nefarious characters. Later, a different Western characterization would supplant the archetypal villains he portrayed earlier in his career—Sam Noonan, the bartender on CBS's \"Gunsmoke\" (1961–1973) television series would become his most enduring TV personae. He appeared in 215 episodes of \"Gunsmoke.\" Boris Karloff, the quintessential Horror genre star, portrayed Frankenstein's monster in three films, but in 1944 passed the baton to Strange, who played the monster role in three Universal films, \"House of Frankenstein\" (1944), \"House of Dracula\" (1945) and the camp horror-comedy film, \"Bud Abbott and Lou Costello Meet Frankenstein\" (1948). Ironically, in \"House of Frankenstein\" Karloff was cast as the villainous Dr. Niemann opposite Strange as the monster, formerly Karloff's signature character. Beginning in the late 1940's, Strange segued into television and for the rest of his career appeared in numerous shows, again, frequently appearing in Westerns. He guest-starred in six episodes of THE RIFLEMAN, playing variations of the same character in each outing. He was Cole, the stagecoach driver, in \"Duel of Honor\" (episode 7) and a shotgun guard on the stagecoach in \"The Dead-eye Kid\" (episode 20), then Joey, the stagecoach driver, in \"The Woman\" (episode 32), followed by appearances as an unnamed stagecoach driver in \"The Blowout\" (episode 43), \"The Spiked Rifle\" (episode 49) and \"Miss Bertie\" (episode 90). Among the many television shows in which he appeared, Strange guest-starred in \"Annie Oakley\" (1954–1956), \"Death Valley Days\" (1954 1958), \"The Adventures of Champion\" (1955–1956), \"The Cisco Kid\" (1955–1956) and \"The Life and Legend of Wyatt Earp\" (1955 1960). He passed away in 1973, ending his career playing Sam Noonan, the bartender on \"Gunsmoke,\" whom he played for 12 years.\n\nHope Summers as Hattie Denton, Owner of the General Store\n\nHope Summers was an American actress of the stage, radio, film and television. Her acting career began in the 1930's, when she worked primarily in community and stock theater and radio. Her career was most active in the 1950's and 1960's, when she appeared in numerous films and television shows. Her film credits include \"Zero Hour!\" (1957), \"Inherit the Wind\" (1960), \"Spencer's Mountain\" (1963), \"The Hallelujah Trail\" (1965), \"The Ghost and Mr. Chicken\" (1966), \"The Shakiest Gun in the West\" (1968), \"Rosemary's Baby\" (1968), \"Charley Varrick\" (1973) and her last movie, \"Foul Play\" (1978). Summers began working in television in the 1950's, guest-starring in a wide variety of genres, but especially Westerns. Her television credits include \"The Loretta Young Show\" (1956–1959), \"Maverick\" (1957) and \"Wagon Train\" (1957), \"Gunsmoke\" (1958–1963), \"Dennis the Menace\" (1959), \"Petticoat Junction\" (1963) and \"The Phyllis Diller Show\" (1966). She played numerous memorable recurring roles in many hit television series, including \"Hawkins Falls: A Television Novel\" (1950). Her best-known role was Clara Edwards, Aunt Bee's gossipy neighbor, in \"The Andy Griffith Show\" (1960-1968) and its spin-off, \"Mayberry R.F.D.\" (1968–1971). Summers appeared in 16 episodes of THE RIFLEMAN as Hattie Denton, owner of the General Store. Hattie was first introduced in \"Eight Hours to Die\" (episode 6). Her last regular television role was playing Olive in \"Another Day\" (1978).\n\nJames Westerfield as Old Man Healey\n\nJames Westerfield was a prolific American character actor of stage, film and television, as well as a director and producer. His first love was the stage, and he produced and directed several plays on the summer theater circuit. He appeared in more than 150 movies and television shows during his 35-year career. Typecast as a heavy, Westerfield received two New York Drama Critics awards. Although many of his film roles were uncredited, he appeared in many iconic films, often playing memorable characters, including the traffic cop in the Orson Welles adaptation of Booth Tarkington's \"The Magnificent Ambersons\" (1942), starring Joseph Cotton, Dolores Costello and Anne Baxter and the biographical drama \"The Pride of the Yankees\" (1942), starring Gary Cooper; Henry Gilson in the noir film \"Undercurrent\" (1946), starring Katharine Hepburn, Robert Taylor and Robert Mitchum; Officer Hanson in the Disney comedy \"The Shaggy Dog\" (1959), starring Fred MacMurray, a role that he reprised in the Disney films \"The Absent-Minded Professor\" (1961) and \"Son of Flubber\" (1963), both starring Fred MacMurray; Jess Younger in the biographical drama \"Birdman of Alcatraz\" (1962), starring Burt Lancaster; a prisoner in the action film \"Hang 'Em High\" (1968), starring Clint Eastwood; and Judge Parker in the western \"True Grit\" (1969), starring John Wayne and Kim Darby. Westerfield is best-remembered for his portrayal of Big Mac in Elia Kazan's award-winning crime drama \"On the Waterfront\" (1954), starring Marlon Brando, Karl Malden, Rod Steiger and Eva Marie Saint. Westerfield guest-starred in many popular television shows of the 1950s through the 70s, including the crime dramas \"Richard Diamond: Private Detective\" (1957–1960) and \"Mannix\" (1967–1975), the suspense series \"Alfred Hitchcock Presents\" (1955–1962), Rod Serling's anthology series \"The Twilight Zone\" (1959–1964), the family comedy \"My Three Sons\" (1960–1972), the western action adventure \"The Wild Wild West\" (1965–1969), the long-running family drama \"Lassie\" (1954–1974), and the fantasy comedy \"Bewitched\" (1964–1972). He also had recurring roles playing John Murrel in the western \"The Travels of Jaimie McPheeters\" (1963–1964), starring Dan O'Herlihy and Kurt Russell, and the character Mr. Turner in the comedy \"Hazel\" (1961–1966), starring Shirley Booth. Westerfield made two appearances in THE RIFLEMAN, portraying Pa Healey in \"The Woman\" (episode 32) and Jake Preston in \"The Fourflusher\" (episode 72). He guest-starred in many other westerns, including \"The Lone Ranger\" (1949–1957), \"Zane Grey Theater\" (1956–1961), \"Wagon Train\" (1957–1965), \"The Texan\" (1958–1960), \"Bat Masterson\" (1958–1961), \"Wanted: Dead or Alive\" (1958–1961), \"The Deputy\" (1959–1961), \"Laramie\" (1959–1963), \"Maverick\" (1957–1962), \"Tales of Wells Fargo\" (1957–1962), \"Rawhide\" (1959–1966), \"Daniel Boone\" (1964–1970), \"The Virginian\" (1962–1971), \"Gunsmoke\" (1955–1975), and \"Bonanza\" (1959–1973).\n\nGuest Cast"}, {"url": "https://www.therifleman.net/episodes?episode=157", "page_content": "SuspicionEpisode 157Writer: Jay SimmsDirector: Joseph H. LewisOriginal Air Date 01/14/1963Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nPatricia Blair as Lou Mallory, Owner of the General Store and the Madera House Hotel\n\nPatricia Blair was an American television actress whose career was active primarily in the 1950s and 1960s. The Texas-born beauty began her career as a teenage model who went on to apprentice in summer stock before being discovered by Warner Bros. She began acting in films under the names Patricia Blake and Pat Blake. She appeared in a few films, including \"Jump Into Hell\" (1955), \"Crime Against Joe\" (1956) and \"The Black Sleep\" (1956), which reunited screen icons of the horror film genre Bela Lugosi, Lon Chaney Jr., Basil Rathbone and John Carradine. She also appeared in the suspense thriller \"City of Fear\" (1959), starring Vince Edwards. She portrayed the Fashion Narrator in the Robert Redford romantic western \"The Electric Horseman\" (1979), co-starring Jane Fonda. In 1962, Blair replaced actress Joan Taylor in a semi-regular role as Lou Mallory, Chuck Connor's love interest in the last season of THE RIFLEMAN. Blair played the attractive red-haired, fiery Irish businesswoman, whose character was savvy Landowner and Owner of the General Store and the Madera House Hotel. Blair's character of Lou Mallory appeared in 17 episodes of THE RIFLEMAN; she debuted in the title role of episode 145. Blair also made guest television appearances on \"The Bob Cummings Show\" (1955–1959), \"The Virginian\" (1962–1971), \"Perry Mason\" (1957–1966), \"Bonanza\" (1959–1973), and she co-starred in \"Daniel Boone\" (1964–1970), playing wife Rebecca Boone opposite Fess Parker. She also had a recurring role as Goldy in the western adventure series \"Yancy Derringer\" (1958–1959).\n\nWilliam Fawcett as Pyrite Rand\n\nWilliam Fawcett, born William Fawcett Thomas, was a prolific American film and television actor. He appeared in more than 50 movies and 200 television shows in a career spanning more than 35 years. Prior to becoming an actor, Fawcett was ordained as a minister, and he obtained a Ph.D. in Elizabethan drama from the University of Nebraska, Lincoln, then went on to become the Professor of Theatre at Michigan State University. In the mid-1940s he embarked on an acting career full-time. He guest-starred in many popular TV shows, including guest-starring roles in the classic family comedy of the 1950s, \"Leave It to Beaver\" (1957–1963), starring Jerry Mathers, the crime dramas \"Dragnet\" (1951–1959), starring Jack Webb, \"77 Sunset Strip\" (1958–1964), starring Efrem Zimbalist, Jr., \"Perry Mason\" (1957–1966) and \"Ironside\" (1967–1975), both starring Raymond Burr, the mystery action series \"Peter Gunn\" (1958–1961), starring Craig Stevens, Rod Serling's iconic anthology series, \"The Twilight Zone\" (1959–1964), and the adventure series \"The Fugitive\" (1963–1967), starring David Janssen. Most of Fawcett's film appearances were uncredited bit parts. Fawcett made two appearances in THE RIFLEMAN, portraying Mr. Newman in \"Lost Treasure of Canyon Town\" (episode 99) and Pyrite Rand in \"Suspicion\" (episode 157). Fawcett guest-starred in dozens of other westerns, often appearing multiple times as different characters. Among the many westerns in which he appeared were \"The Lone Ranger\" (1949–1957), starring Clayton Moore, \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone, \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen, \"The Deputy\" (1959–1961), starring Henry Fonda, \"The Life and Legend of Wyatt Earp\" (1955–1961), starring Hugh O'Brian, \"Cheyenne\" (1955–1963), starring Clint Walker, \"Maverick\" (1957–1962), starring James Garner, \"Rawhide\" (1959–1966), starring Clint Eastwood, \"Wagon Train\" (1957–1965), starring Ward Bond and later John McIntire, \"Daniel Boone\" (1964–1970), starring Fess Parker, \"Bonanza\" (1959–1973), starring Lorne Greene, Dan Blocker, Pernell Roberts and Michael Landon, \"Gunsmoke\" (1955–1975), starring James Arness, and \"The Virginian\" (1962–1971), starring James Drury and Doug McClure.\n\nJoe Higgins as Nils Swenson\n\nJoe Higgins was an American actor working primarily in television and commercials from the 1960's through the 1980's. His acting career began at age nine and while attending the University of Dayton in Ohio, he worked in radio. He became a prolific character actor who often portrayed a sheriff in commercials, public service announcements and in print ads. He won the CLIO award on two occasions for his acting in commercials. His portrayal as a sheriff, \"You in a heap o' trouble, boy!,\" in a series of memorable Dodge car commercials in the 1970's became his iconic signature role. Higgins appeared in four episodes of THE RIFLEMAN playing different characters, and he played the semi-regular character, Nils Swenson, the Blacksmith, in 16 episodes. He played recurring roles on other television series in addition to THE RIFLEMAN, including \"Arrest and Trial\" and later, he co-starred again with Chuck Connors in \"Flipper\" and \"Geronimo.\"\n\nWilliam \"Billy\" Hughes as Gridley Maule\n\nWilliam \"Billy\" Hughes, born William Eugene Hughes, was an American actor who worked primarily in television. Both his father Bill, Sr. and his uncle Whitey were stuntmen. He appeared in 25 movies and television shows during a two-decade career, which began when he was barely ten playing an uncredited role in the Mickey Rooney crime comedy \"The Nice Little Bank That Should Be Robbed\" (1958). He played the leading role as a runaway in the western \"Ole Rex\" (1961) and portrayed the oldest sibling Joe in a family of orphans in the Debbie Reynolds comedy \"My Six Loves (1963). Toward the end of his career, he had an uncredited stunt role in the Sam Peckinpah film \"The Wild Bunch\" (1969), and in his final film role, he appeared in the obscure western drama \"Smoke in the Wind\" (1975). Hughes guest-starred in several popular television shows, including the family comedy \"Leave It to Beaver\" (1957–1963), the medical drama \"Dr. Kildare\" (1961–1966), Rod Serling's iconic anthology series \"The Twilight Zone\" (1959–1964), the crime drama \"Arrest and Trial\" (1963–1964), the private detective series \"77 Sunset Strip\" (1958–1964) and the family drama \"Lassie\" (1954–1974). As a young teenager, Hughes made three appearances in THE RIFLEMAN, portraying Aaron in \"Day of Reckoning\" (episode 71), Jeffrey Waller in \"The Long Gun from Tuscon\" (episode 121) and Gridley Maule in \"The Sidewinder\" (episode 158). Reportedly, the part he played in \"The Sidewinder\" was one of his favorite roles. He guest-starred in several other westerns, sometimes making multiple appearances, including \"Gunsmoke\" (1955–1975), starring James Arness; \"Laramie\" (1959–1963), starring John Smith and Robert Fuller; and \"Wagon Train\" (1957–1965), starring John McIntyre and Ward Bond.\n\nKevin McCarthy as Winslow Quince\n\nKevin McCarthy was an American stage, film and television actor whose prolific career spanned more than six decades. Brother of renowned author, Mary McCarthy, he made his Broadway debut in 1938 in \"Abe Lincoln in Illinois\" and appeared in 18 theatrical productions throughout his career, notably, portraying Harry S. Truman in \"Give 'Em Hell Harry,\" which toured the United States for two decades. McCarthy appeared in over 200 film and television roles. His portrayal of Biff in the 1951 film adaptation of \"Death of a Salesman\" garnered him an Academy Award nomination for Best Supporting Actor and won him a Golden Globe Award for New Star of the Year, Actor. His best-known role was Dr. Miles Bennell in the 1956 science fiction horror classic \"Invasion of the Body Snatchers.\" The iconic film was selected for the National Film Registry in 1994 and in 2008 was named one of the Top 10 science fiction films of all time by the American Film Institute. In later years, he embraced the cult camp status of the picture and his role in it, even making a cameo appearance in the 1976 remake of the \"Body Snatchers.\" McCarthy made two appearances in THE RIFLEMAN, portraying Mark Twain in \"The Shattered Idol\" (episode 120) and Winslow Quince in \"Suspicion\" (episode 157). He continued to work until the year before his death at age 96—his last screen appearances were in two 2009 releases, the 18th century period film, \"Wesley,\" and the short comedy film \"I Do.\"\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nGuest Cast"}, {"url": "https://www.therifleman.net/program-history/", "page_content": "THE RIFLEMAN – Concept and Back Story\n\nWesterns were a popular genre when THE RIFLEMAN premiered in 1958. First telecast on Dick Powell's \"Zane Grey Theatre\" (CBS) on March 7, 1958, the pilot premiered on ABC in the regular television season on September 30 that same year. The show's creator, Arnold Laven, developed customized Winchester rifle, not a six gun, the main protagonist's signature firearm.\n\nThe opening credits showcasing the skill of Chuck Connors as Lucas McCain firing his rapid-action Winchester rifle set the tone for the western action adventure, to be sure, but the show aspired to be more than a vehicle for gratuitous gun-slinging. Heart-warming human relationships, specifically the kinship between father and son, provided balance, and sometimes a paradoxical juxtaposition, to the violent backdrop of life on the frontier. The rifle complemented Lucas McCain's persona as a self-possessed, rugged individualist who had high ethical standards and a cool head. Connors in the title role, with rifle at the ready, portrayed the iconic western hero – a crackerjack marksman and cowboy-turned-single-father and homesteader facing life's challenges with a stoical, reasoned view about social justice and personal responsibility. Uppermost in his mind was being a good role model for his son and a solid citizen in his community. So, when McCain picked up his rifle, he wielded it not only with confidence and competence, but also with rational deliberation and fair-minded determination. He admonished his young son in one episode, \"A man doesn't run from a fight, Mark, but that doesn't mean you go looking to run to one.\"\n\nFamily values and moral principles informed many storylines in THE RIFLEMAN series. Through the McCains' adventures with the townfolk of North Fork and the weekly influx of visitors, THE RIFLEMAN was a series of morality plays examining human nature's rich and varied complexity – with all its foibles and follies, sorrow and humor, venality and virtue. The inspiration for many episodes was drawn from Biblical parables, sometimes recapitulated explicity, such as the story of Job, which was related by Lucas to son Mark in the second episode, \"Home Ranch.\" Second chances – compassion and redemption – was a prominent, recurring theme. It was often elicited in episodes featuring Marshal Micah Torrance, played by Paul Fix, a sometime derelict, recovered alcholic, who was a regular character introduced in the fourth episode, \"The Marshal,\" after R.G. Armstrong, who played the sheriff in the pilot was killed off. The themes were timeless and universal, featuring sympathetic characters grappling with familiar human dilemmas and classic good-versus-evil conflicts.\n\nArnold Laven and series co-producers, Arthur Gardner and Jules V. Levy, presciently anticipated that the show's strength lay in the father-son relationship, and its best asset was the genuine filial affection between actors Chuck Connors as Lucas McCain and Johnny Crawford as Mark McCain. In fact, the depiction of a widowed father grappling with the challenges of raising a son alone in THE RIFLEMAN may have been a television first in its departure from the traditional depiction of a family as mother, father and child. Critics and viewers responded favorably to the novel family portrayal celebrating the father-son bond, and it appears to account for the enduring appeal of the series. In the June 20, 2004 issue of \"TV Guide,\" the character of Lucas McCain was ranked #32 in a list of the \"50 Greatest TV Dads of All Time.\" In 1959, at age 13, Johnny Crawford was nominated for an Emmy for his role in THE RIFLEMAN. Chuck Connors later remarked with admiration how young Johnny Crawford comported himself on THE RIFLEMAN set with deferential respect toward the crew, addressing them as \"sir\" and \"ma'am\" upon arriving to the set on his first day until departing on the last day."}, {"url": "https://www.therifleman.net/episodes?episode=78", "page_content": "The Woman from Hog RidgeEpisode 78Writer: Calvin J. ClementsDirector: William ClaxtonOriginal Air Date 10/04/1960Cast\n\nChuck Connors as Lucas McCain\n\nJohnny Crawford as Mark McCain\n\nPaul Fix as Marshal Micah Torrance\n\nLane Bradford as Martin\n\nLane Bradford was an American television and film actor. He appeared in more than 250 movies and television shows in a career spanning nearly 35 years. A familiar face in western B movies and television series, many of his film roles in the 1940s and 50s were uncredited. Bradford made his television debut in the crime drama series \"Craig Kennedy, Criminologist\" (1952). He also appeared in \"The Untouchables\" (1959–1963) and \"Perry Mason\" (1957–1966). Bradford guest-starred in most of the major western series of the 1950s and 60s, appearing mulitple times in many of them, including \"The Lone Ranger\" (1949–1957), \"The Adventures of Rin Tin Tin\" (1954–1959), \"Have Gun – Will Travel\" (1957–1963), \"Wagon Train\" (1957–1965), \"The Life and Legend of Wyatt Earp\" (1955–1961), \"Cheyenne\" (1955–1963) \"Bonanza\" (1959–1973), and \"Gunsmoke\" (1955–1975). He made one appearance in THE RIFLEMAN, portraying Martin in \"Woman from Hog Ridge\" (episode 78).\n\nRobert F. Hoy as Lester\n\nRobert \"Bobby\" F. Hoy was an American film and television actor, as well as a director and stuntman. He appeared in more than 160 movies and television shows during a career spanning nearly 60 years. After serving in the United States Marines during World War II, Hoy decided to pursue a career in show business. He worked as a stunt double for many acclaimed actors, including Charles Bronson, Tony Curtis, Audie Murphy, Tyrone Power, Jay Silverheels and David Janssen. In 1961, Hoy co-founded the Stuntmen's Association of Motion Pictures. Hoy appeared in numerous films, often playing minor parts or doing stunt work, including the musical drama \"A Star Is Born\" (1954), starring Judy Garland and James Mason; the biographical war drama \"To Hell and Back\" (1955), starring Audie Murphy; Stanley Kubrick's film adaptation of \"Spartacus\" (1960), starring Kirk Douglas, Laurence Olivier and Jean Simmons; the Blake Edwards adventure comedy \"The Great Race\" (1965), starring Tony Curtis, Jack Lemmon and Natalie Wood; the westerns \"Nevada Smith\" (1966), starring Steve McQueen, and \"The Gambler: The Adventure Continues\" (1983), starring Kenny Rogers, as well as William A. Frakers \"The Legend of the Lone Ranger\" (1981). He appeared in several Clint Eastwood pictures, including \"The Outlaw Josey Wales\" and \"The Enforcer\" (both 1976) and \"Bronco Billy\" (1980) Hoy guest-starred in many popular television shows, including the action adventure \"Sea Hunt\" (1958–1961), the anthology series \"Walt Disney's Wonderful World of Color\" (1954–1990), the crime drama \"The Untouchables\" (1959–1963), the war drama \"Combat!\" (1962–1967), the espionage thrillers \"The Man from U.N.C.L.E.\" (1964–1968) and \"Mission: Impossible\" (1966–1973), the science fiction cult classic \"Star Trek\" (1966–1969), the western action adventure \"Kung Fu\" (1972–1975), the police drama \"The Streets of San Francisco\" (1972–1977), the Aaron Spelling fantasy series \"Fantasy Island\" (1977–1984), the medical mystery \"Quincy M.E.\" (1976–1983), the family drama \"Little House on the Prairie\" (1974–1983) and the primetime drama \"Dallas\" (1978–1991). Hoy's most famous role was the recurring character of Joe Butler in the western series \"The High Chaparral\" (1967–1971). He made three appearances in THE RIFLEMAN, portraying Lester in \"Woman from Hog Ridge\" (episode 78), Dabbs in \"The Promoter\" (episode 87) and a member of Wade's gang in \"Which Way Did They Go?\" (episode 167). He guest-starred in many other westerns, the genre for which he was best-known and most fondly remembered, including \"Have Gun – Will Travel\" (1957–1963), starring Richard Boone; \"Zane Grey Theater\" (1956–1961), starring Dick Powell; \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen; \"Bat Masterson\" (1958–1961), starring Gene Barry; \"Branded\" (1965–1966), starring THE RIFLEMAN's Chuck Connors; and \"Bonanza\" (1959–1973), starring Lorne Greene, Michael Landon, Dan Blocker and Pernell Roberts. Toward the end of his life, Hoy was honored with a Golden Boot Award by the Motion Picture and Television Fund for making significant contributions to the western genre. He made his final television appearance in the crime drama \"NCIS\" (2003– ).\n\nJim Hurst as Sylvester\n\nJim Hurst appeared in six television shows in five years. He guest-starred in the private detective series \"77 Sunset Strip\" (1958–1964) and made one appearance in THE RIFLEMAN, portraying Sylvester in \"Woman From Hog Ridge\" (episode 78). He guest-starred in a few other westerns, including \"Bronco\" (1958–1962), starring Ty Hardin; \"Cheyenne\" (1955–1963), starring Clint Walker; \"The Virginian\" (1962–1971), starring James Drury; and \"Branded\" (1965–1966), starring THE RIFLEMAN's Chuck Connors.\n\nBill Quinn as Sweeney, the Bartender\n\nBill Quinn was an American actor whose early career began in the 1920's in silent films and ended with the 1989 science fiction film, \"Star Trek V: The Final Frontier.\" Perhaps, his best-known role was Mr. Ranseleer, Archie Bunker's blind friend in \"All In The Family\" (1971-1978). He also was a regular character in the Carroll O'Connor spin-off, \"Archie Bunker's Place.\" Quinn's other television credits include roles in \"The Odd Couple\" (1970-1975), \"McHale's Navy\" (1962-1966), and \"The Mary Tyler Moore Show\" (1970-1977), in which he play Mary Richard's father. In 1971, he appeared in Universal Pictures' \"How to Frame a Figg\" starring Don Knotts. Quinn was a regular character in THE RIFLEMAN, appearing in 40 episodes as Sweeney, the Owner/Bartender of the North Fork Saloon.\n\nJan Stine as Johnny\n\nJan Stine, born Jan Russell Stine, was an American actor who primarily worked in television. He appeared in nearly 30 movies and television shows during his brief career. He guest-starred in several popular shows of the 1950s and 60s, including the comedy \"The Real McCoys\" (1957–1963), the family comedy \"The Many Loves of Dobie Gillis\" (1959–1963), the legal drama \"Perry Mason\" (1957–1966) and the long-running family drama \"Lassie\" (1954–1974). Stine made two appearances in THE RIFLEMAN, portraying Johnny in \"Woman from Hog Ridge\" (episode 78) and Gorwin Morgan in \"The High Country\" (episode 122). He guest-starred in a few other westerns, including \"Zane Grey Theater\" (1956–1961), starring Dick Powell; \"Wanted: Dead or Alive\" (1958–1961), starring Steve McQueen; and \"The Virginian\" (1962–1971), starring James Drury.\n\nCharles Tannen as Josh Moore, Storekeeper at the Hardware Store\n\nCharles Tannen, born Charles David Tannen, was an American television and film actor who appeared in more than 200 movies and television shows during his 30-year career. He had uncredited roles in numerous films, including the romantic drama \"The Dark Angel\" (1935), starring Fredric March and Merle Oberon; the biographical drama \"Young Mr. Lincoln\" (1939), starring Henry Fonda; the crime drama \"The Street with No Name\" (1948), starring Mark Stevens and Richard Widmark; the landmark sci-fi drama \"The Day the Earth Stood Still\" (1951), starring Michael Rennie and Patricia Neal; and the sci-fi horror film \"The Fly\" (1958), starring David Hedison and Vincent Price. Although his uncredited roles outnumber the credited ones, Tannen was cast in significant parts in several Henry Fonda films, including Charles Ford in the westerns \"Jesse James\" (1939) and \"The Return of Frank James\" (1940), and Joe in the film adaptation of John Steinbeck's \"The Grapes of Wrath\" (1940). Tannen guest-starred in many television shows of the 1950s through the 70s, including the family comedy \"Father Knows Best\" (1954–1960), the crime drama \"77 Sunset Strip\" (1958–1964), the mystery action series \"Peter Gunn\" (1958–1961), the family comedy \"Mister Ed\" (1958–1966), the legal drama \"Perry Mason\" (1957–1966), the long-running family drama \"Lassie\" (1954–1974), Rod Serling's iconic anthology series, \"The Twilight Zone\" (1959–1964), and the comedy \"Petticoat Junction\" (1963–1970). Tannen made six guest appearances in THE RIFLEMAN, portraying Barney the barber in \"The Boarding House\" (episode 22), the bartender in \"Sins of the Father\" (episode 70), Josh Moore in \"The Jailbird\" (episode 73) and \"Woman from Hog Ridge\" (episode 78), Mr. Penn in \"Miss Milly\" (episode 84), and Jack Carson in \"The Actress\" (episode 94). He guest-starred in many other westerns, including \"The Roy Rogers Show\" (1951–1957), \"Maverick\" (1957–1962), \"Zane Grey Theater\" (1956–1961), \"Have Gun – Will Travel\" (1957–1963), \"Laramie\" (1959–1963), \"Death Valley Days\" (1952–1975), \"Bonanza\" (1959–1973), \"Tales of Wells Fargo\" (1957–1962), \"Gunsmoke\" (1955–1975), \"Cheyenne\" (1955–1963) and \"Rawhide\" (1959–1966).\n\nDee J. Thompson as Ma Boyle\n\nDee J. Thompson appeared in 35 movies and television shows during a 20-year career. She portrayed Donna in the romantic comedy \"The Glass Bottom Boat\" (1966), starring Doris Day, Rod Taylor and Arthur Godfrey. She guest-starred in several popular television shows of the 1950s and 60s, including the crime drama \"Dragnet\" (1951–1959), the mystery action series \"Peter Gunn\" (1958–1961), the comedy \"Hazel\" (1961–1966), the suspense anthology series \"Alfred Hitchcock Presents\" (1955–1962) and the family comedy \"My Three Sons\" (1960–1972). She had a recurring role playing Agnes in the Imogene Coca comedy \"Grindl\" (1963–1964). Thompson made one appearance in THE RIFLEMAN, portraying Ma Boyle in \"Woman from Hog Ridge\" (episode 78). She also guest-starred in the westerns \"Gunsmoke\" (1955–1975), starring James Arness, and \"The Big Valley\" (1965–1969), starring Barbara Stanwyck.\n\nGuest Cast"}]}