{"Matt Striebel was a member of the United States men's national lacrosse team.": [{"url": "https://www.usalaxmagazine.com/pro/pll/pll-announces-inaugural-class-of-professional-lacrosse-hall-of-fame", "page_content": "Tue Feb 15 2022 | Press Release | Pro\n\nPLL\n\nThe first-ever player to reach 300 career points, Mark Millon regularly won matchups against the toughest defenders in the world.\n\nThe Premier Lacrosse League announced the inaugural Pro Lacrosse Hall of Fame class on Tuesday, honoring 11 of the greatest players in lacrosse history.\n\nPlayers are eligible if they meet the following criteria:\n\nMinimum five-year playing career in the PLL and/or MLL Retired from professional play for at least three years Must be nominated by a member of the Hall of Fame Committee and receive a 75-percent majority vote of approval for election\n\nToday we welcome the Inaugural Pro Lacrosse Hall of Fame Class. pic.twitter.com/qROhw6JKuF — Premier Lacrosse League (@PremierLacrosse) February 15, 2022\n\nATTACK\n\nMark Millon\n\nThe first-ever player to reach 300 career points, Mark Millon regularly won matchups against the toughest defenders in the world. His signature exclamation mark dodge and seven-point (five goals, two assists) championship performance led the 2002 Baltimore Bayhawks to their first title. In 2005, Millon won co-MVP honors in the MLL alongside Gary Gait.\n\nCasey Powell\n\nAttack or midfield, it didn’t matter. Casey Powell filled the box score from either position. Powell won three MLL championships (2001 with the Long Island Lizards, 2008 with the Rochester Rattlers and 2013 with the Chesapeake Bayhawks). In 2014, at 38, Powell earned MVP honors, scoring 30 goals and dishing 33 assists for the Florida Launch.\n\nPowell ranks fourth all time in points (523), ninth all time in goals (262) and third all time in assists (256).\n\nJohn Grant Jr.\n\nWhen John Grant Jr. caught the ball, it was not a matter of if he would score, but how he would score. Behind the back. Around the world. Between the legs. Leaners. Fake high, shoot low. Grant Jr. puzzled goalies throughout his career, burying more goals (393) than anyone in pro lacrosse history.\n\nGrant Jr. won five MLL championships as a player (2008 with the Rochester Rattlers, 2009 with the Toronto Nationals, 2012 and 2013 with the Chesapeake Bayhawks and 2014 with the Denver Outlaws) and another as an assistant coach (2018 with the Outlaws).\n\nMIDFIELD\n\nJay Jalbert\n\nKnown for his endline-to-endline play, Jay Jalbert dominated every inch of the lacrosse field. In overtime of the 2003 MLL championship game, Jalbert sprinted in from his faceoff wing, sparked a fast break and dished the game-winning assist — capping a career year and an MVP season.\n\nGary Gait\n\nBritish Columbia native Gary Gait led the 2001 Long Island Lizards to the first-ever MLL championship. After being traded to Baltimore the following year, Gait served as player-coach for the Bayhawks for four years, winning two MLL championships (2002, 2005) and earning co-MVP honors alongside Mark Millon in 2005.\n\nGait scored 169 goals and dished 66 assists in his MLL career.\n\nMatt Streibel\n\nOpposing scouting reports highlighted a capital-L and capital-R next to Matt Striebel’s name. His variety of dodges out of the box made him an impossible assignment to defend. Striebel ranks ninth all time in points (382), third among midfielders.\n\nStriebel won three MLL championships with the Philadelphia Barrage (2004, 2006, 2007) and earned championship game MVP honors in 2007 for his six-point (three goals, three assists) performance."}, {"url": "https://worldlacrosse.sport/article/us-lacrosse-announces-national-lacrosse-hall-of-fames-class-of-2019/", "page_content": "SPARKS, Md. (May 22, 2019) — The National Lacrosse Hall of Fame announces the addition of nine new inductees as the Class of 2019, following approval by US Lacrosse’s Board of Directors. The newest members will be officially inducted in a ceremony on Saturday, October 19, at The Grand Lodge in Hunt Valley, Md.\n\nThe 2019 inductees are: Ryan Boyle, Charlie Coker, Kara Ariza Cooke, Rachael Becker DeCecco, Sarah Forbes, Cathy Nelson Reese, Matt Striebel, Paul Schimoler, and Richard Speckmann.\n\nTickets for the 2019 National Lacrosse Hall of Fame Induction Ceremony, sponsored by RPS Bollinger and the Markel Insurance Company, will be available to the public for purchase beginning August 1. Tickets will be sold online at uslacrosse.org/HOF.\n\nThe National Lacrosse Hall of Fame, a program of US Lacrosse, was established in 1957 to honor men and women who by their deeds as players, coaches, officials and/or contributors, and by the example of their lives, personify the great contribution of lacrosse to our way of life.\n\nThe goal of the men’s and women’s selection committees, chaired by Hall of Fame members Vinnie Sombrotto and Jess Wilk, respectively, is to select the absolute best of the best, within the context of an individual’s era of participation. A nine-person ballot committee develops the list of annual nominees, while a 21-member voting committee finalizes the selections.\n\nThe voting group is comprised of current Hall of Fame members, current or former U.S. National Team players and coaches, elite level high school or college coaches, elite members of the officiating community, and individuals that have contributed to the growth of the sport on a national or international level. A full explanation of the process can be accessed here.\n\nOver 400 lacrosse greats are honored in the National Lacrosse Hall of Fame, which is located alongside the National Lacrosse Museum at the US Lacrosse Headquarters in Sparks, Maryland.\n\nBios for this year’s inductees are listed below:\n\nRyan Boyle\n\nBoyle will be inducted as a truly great player. He enjoyed an All-American career at Princeton University, earning first team honors as an attackman in 2003 and 2004, second team accolades in 2002, and third team status in 2001. Boyle earned All-Ivy honors three times (2002, 2003, 2004) and was named the Ivy League’s Player of the Year in 2002 and 2004. Princeton captured the Ivy title in each of his four seasons, and won the national championship in 2001. Boyle concluded his career with 70 goals, 162 assists, and 232 career points. He ranks second in Princeton history in assists and third in points. Boyle was a member of the 2002, 2006 and 2010 U.S. Men’s National Teams, winning the gold medal twice. He enjoyed an 11-year professional career in Major League Lacrosse, playing for the Philadelphia Barrage and Boston Cannons. Boyle was selected as the MLL’s Rookie of the Year in 2004, and as All-Pro in 2006. He finished his MLL career as the all-time leader in assists (254) and ranked sixth in points (423). A native of Cockeysville, Md., Boyle was inducted into the US Lacrosse Greater Baltimore Chapter’s Hall of Fame in 2015.\n\nCharlie Coker\n\nCoker will be inducted as a truly great player. He was a three-time All-American midfielder at Johns Hopkins University, with first team honors in both 1969 and 1970, and honorable mention status in 1968. Coker played on three USILA national championship teams for the Blue Jays (1968, 1969, 1970), and was selected to play in the USILA’s North-South All-Star Game following his senior season in 1970. He finished his career with 53 goals and 21 assists after leading the team in goals (16) and tying for the team-lead in points (28) as a senior. Coker scored a career-high 23 goals and added five assists as a junior and was named to the All-Time Johns Hopkins Team at the end of his career. An accomplished three-sport athlete who also competed on the football and wrestling teams at Hopkins, he was recognized as both the school’s freshman athlete of the year in 1967 and the outstanding senior in 1970. He earned seven varsity letters as a collegiate athlete. He was inducted to the Johns Hopkins Athletic Hall of Fame in 2008.\n\nKara Ariza Cooke\n\nCooke will be inducted as a truly great player. She was a three-time All-American at the University of Virginia, earning first team honors as a defender in both 1997 and 1998, and second team status in 1996. Cooke helped lead Virginia to the ACC title as a senior in 1998 and was named MVP of the ACC Tournament that year. She earned All-ACC honors in both 1997 & 1998, and was selected to play in the North-South All-Star Game in 1998. In addition, Cooke was selected to ACC’s 50th Anniversary Team in 2002. Cooke was a member of the 2001 and 2005 U.S. World Cup Teams, winning the gold medal in 2001 and the silver in 2005. As a member of the U.S. Women’s National Team Program from 1997-2006, she also played on the U.S. Touring Team against Australia in 2000. She was inducted to the US lacrosse Charlottesville Chapter Hall of Fame in 2015.\n\nRachael Becker DeCecco\n\nDeCecco will be inducted as a truly great player. She was a three-time, first team All-American defender at Princeton University (2001, 2002, 2003) and named as the recipient of the Tewaawaton Trophy in 2003 as the nation’s most outstanding player. DeCecco helped Princeton win the NCAA championship in 2002 & 2003, and was named MVP of the NCAA Tournament in 2003. She was also the national defender of the year in both 2002 and 2003, and the Ivy League’s player of the year as well as the NCAA’s Honda Award winner for lacrosse in 2003. She was named to the NCAA’s 25th Anniversary Team in 2006. DeCecco was a member of the U.S. Women’s National Team Program from 2003-2008, and played on the U.S. World Cup Team in 2005. She has been previously inducted into the Marple Newtown (Pa.) High School Athletic Hall of Fame (2004) and the US lacrosse Philadelphia/Eastern Pennsylvania Chapter’s Hall of Fame (2014).\n\nSarah Forbes\n\nForbes will be inducted as a truly great player. She was a three-time All-American at the University of Maryland, earning first team honors in both 1996 and 1997, and third team honors in 1995. In 1997, Forbes was the national offensive player of the year as well as the ACC’s player of the year, and named winner of the ACC’s Mary Garber Award as its top female athlete. She helped lead the Terps to three straight NCAA titles (1995, 1996, 1997) during her career, as well as the ACC championship in 1997. Forbes was named to the NCAA’s 25th Anniversary Team in 2006. As an international player, Forbes was a member of the Australian World Cup Team four times (1993, 2001, 2005, 2009), helping the Aussies capture the gold medal in 2005, as well as two silver medals and one bronze during her tenure. She earned All-World honors in both 2005 and 2009, and was named tournament MVP in 2005. She also served as team captain for the victorious 2005 World Cup team. Forbes was inducted into the University of Maryland’s Athletics Hall of Fame in 2012.\n\nCathy Nelson Reese\n\nReese will be inducted as a truly great coach. As one of the nation’s most decorated women’s coaches, Reese is a three-time winner of the IWLCA’s national coach of the year award (2010, 2014, 2015) and 10-time conference coach of the year. Through 2018, she has led the University of Maryland to four national championships (2010, 2014, 2015, 2017), 10 final fours, and nine conference championships in the ACC and Big Ten. Including three years as the head coach at University of Denver, Reese had a career record of 279-50 prior to the start of the 2019 season. She ranks as the Terps’ all-time winningest coach, with a 268-22 record at Maryland heading into this weekend’s NCAA national semifinals. Reese has produced seven Tewaaraton Trophy winners and 57 All-Americans. She has been previously inducted into the Howard County (Md.) Women’s Athletic Hall of Fame, the US Lacrosse Potomac Chapter’s Hall of Fame (2009), and the US Lacrosse Greater Baltimore Chapter’s Hall of Fame (2010).\n\nMatt Striebel\n\nStriebel will be inducted as a truly great player. He was a two-time All-American at Princeton University, splitting time during his career between attack and midfield. Striebel helped the Tigers capture two NCAA championships during his career, winning the title in 1998 and 2001. He was also a part of four Ivy League championships, and earned all-Ivy honors three times (1999, 2000, 2001). Striebel played on three U.S. National Teams, helping to claim world championships in 2002 and 2010, and a runner-up finish in 2006. He also enjoyed a 13-year professional career in Major League Lacrosse, earning all-star honors nine times and All-Pro status in 2007 & 2008. He was a part of three MLL championships, and selected as the Championship Game MVP in 2007. He finished his MLL career with 225 goals, 120 assists, and 355 points, ranking among the top 10 all-time in each category. A product of Gill, Mass., Striebel was inducted into the US Lacrosse Western Massachusetts Chapter Hall of Fame in 2014.\n\nPaul Schimoler\n\nSchimoler will be inducted posthumously as a truly great player. He was a four-time All-American goalie at Cornell University, earning second team honors in 1987, third team status in 1989, and honorable mention recognition in 1986 & 1988. He was the first Big Red player to receive national honors four times. Schimoler also earned all-Ivy League honors four times, including first team status in 1987 & 1989. He was the Ivy League’s player of the year in 1989 and its rookie of the year in 1986. He also helped lead Cornell to the Ivy championship in 1987. At the time of graduation, Schimoler was the NCAA’s all-time leader with 787 career saves. He also set the NCAA Tournament record with 85 saves in 1988. Schimoler enjoyed an eight-year post-collegiate club career, and was the USCLA’s Player of the Year (North) in 1990. Internationally, he played for the U.S. National Team in 1990 and 1994, winning the gold both times. Schimoler passed away from cancer in 2013.\n\nRichard Speckmann\n\nSpeckmann will be inducted as a truly great coach. One of the most successful junior college coaches ever, he amassed a 477-158-1 record in 40 years at Nassau (N.Y.) Community College. He retired following the 2010 season with a career winning percentage of over 75 percent. Speckmann led Nassau to 20 NJCAA championships during his tenure, qualifying for the four-team finals in 39 of his 40 seasons. He coached over 200 NJCAA All-Americans during his career, and had over 100 players move on to NCAA All-America status. Speckmann was the NJCAA’s national coach of the year six times (1975, 1978, 1982, 1992, 2000, 2008). He also served twice as president of the NJCAA Coaches Association. A native of Oceanside, N.Y., Speckmann is a graduate of SUNY Cortland, where he lettered three times in both lacrosse and football. He has been inducted previously into the US Lacrosse Long Island Metro Chapter Hall of Fame, the SUNY Cortland Hall of Fame, and the IMLCA Hall of Fame.\n\nAbout US Lacrosse\n\nUS Lacrosse, a 501(c)(3) nonprofit corporation, is the national governing body of lacrosse and the home of the nation’s fastest-growing sport. US Lacrosse has 450,000 members across the country and provides national leadership, structure and resources to fuel the sport’s growth and enrich the experience of participants."}, {"url": "https://3rabica.com/United_States_men%27s_national_lacrosse_team", "page_content": "The United States men's national lacrosse team has won ten of thirteen World Lacrosse Championships, the most recent in 2018. Team USA finished second in the other three field lacrosse tournaments, losing to Canada in 1978, 2006, and 2014.\n\nThe team is organized by US Lacrosse, the national governing body. The roster usually consists of lacrosse players who play in the Premier Lacrosse League.\n\nCompetition achievements\n\nOlympic Games\n\nGames Representative Finish Ref. 1904 St. Louis St. Louis Amateur Athletic Association Silver Silver [1]\n\nWorld Championships\n\nTeam USA vs. MLL All-Stars in 2006.\n\n2018 team\n\nUS Lacrosse announced the final 23-man roster for the 2018 World Lacrosse Championship on January 7, 2018.[2]\n\n2014 team\n\nUS Lacrosse finalized its 23-man roster on June 30, 2014, by cutting eight players that were on the roster for the Team USA versus MLL All Star game on June 26, 2014.[3]\n\nStarting attack\n\nName College Previous US rosters 2014 MLL team Note Ned Crotty Duke 2010 2010 New York Won NCAA championship in 2010, 2010 Tewaaraton Trophy winner, 1st team All-American in 2009 and 2010 Brendan Mundorf UMBC 2006 2010 Chesapeake Played for Australia in the 2006 World Lacrosse Championship, 2012 MLL MVP Rob Pannell Cornell 2013 New York Won Tewaaraton in 2013, will run attack from behind the cage[4]\n\nOther attackmen\n\nName College Previous US rosters 2014 MLL team Note Marcus Holman UNC 2013 Ohio 1st team All-American in 2013 Kevin Leveille Massachusetts 2003 Rochester His younger brother Mike Leveille (Syracuse 2008) was on the 2010 team, alternate on 2010 team Garrett Thul Army 2013 Florida\n\nStarting midfield\n\nName College Previous US rosters 2014 MLL team Note Kevin Buchanan Ohio State 2008 Boston Paul Rabil Johns Hopkins 2008 2010 Boston Won NCAA championship in 2005 and 2007; 1st team All-American in 2006, 2007 and 2008 Max Seibald Cornell 2009 2010 New York Won Tewaaraton in 2009\n\nOther midfielders\n\nName College Previous US rosters 2014 MLL team Note Matt Abbott Syracuse 2009 Chesapeake Won two NCAA championship (2008 and 2009), 1st team All-American in 2009, his father and grandfather played lax at Syracuse,[5] assistant coach with his brother Mike at Colgate,[5] second on USA team with four groundballs in win versus MLL All Starts in on June 26, 2014 Dan Burns Maryland 2011 Chesapeake Walk-on in college[4] Kyle Harrison Johns Hopkins 2005 2006 Ohio Won NCAA championship in 2005, won Tewaaraton in 2005 David Lawson Duke 2013 Rochester Won NCAA championship in 2010 and 2013, 1st team All-American in 2013\n\nFaceoff\n\nName College Previous US rosters 2014 MLL team Note Chris Eck Colgate '08 Boston won 60% of faceoffs in 2014 MLL season[6] Greg Gurenlian Penn State '06 New York\n\nStarting defense\n\nName College Previous US rosters 2014 MLL team Note Tucker Durkin Johns Hopkins 2013 Chesapeake 1st team All-American in 2012 and 2013 Michael Evans Johns Hopkins 2009 Chesapeake Won NCAA championship in 2007, 1st team All-American in 2009 Lee Zink Maryland 2004 Denver Outlaws MLL Defensive Player of the Year in 2012 and 2013,[7] 1st team All-American in 2004, alternate on 2010 team\n\nOther defensemen\n\nName College Previous US rosters 2014 MLL team Note Mitch Belisle (D/LSM/SSDM) Cornell 2007 Boston 1st team All-American in 2007, plays with both a short- and long-stick in the MLL[4] Jesse Bernhardt (D/LSM) Maryland 2013 Chesapeake 1st team All-American in 2013, led USA team with six groundballs versus MLL All Star team on June 26, 2014 Kyle Hartzell (D/LSM) Salisbury 2007 New York\n\nGoalkeepers\n\nName College Previous US rosters 2014 MLL team Note Drew Adams Penn State 2009 New York Played behind 2010 goalie Brian Dougherty as a rookie[8] Jesse Schwartzman Johns Hopkins 2007 Denver Won NCAA championship in 2005 and 2007\n\n2010 team\n\nAttackmen\n\nName College Previous US rosters Note Ryan Boyle Princeton 2004 2002, 2006 Played in 2014 MLL season with Boston. Withdrew from 2014 USA tryout pool.[9] Ned Crotty Duke 2010 Mike Leveille Syracuse 2008 Sat out the 2011, 2012 and 2014 MLL seasons due to full-time job at NBC[10] Brendan Mundorf UMBC 2008 Ryan Powell Syracuse 2000 2006 2010 US team captain, runs Rhino Lacrosse in Portland, Oregon Drew Westervelt USMB 2008 In MLL All-Star game in 2014 versus the US national team, on practice roster for 2014 US team\n\nMidfielders\n\nName College Previous US rosters Note Kevin Cassese Duke 2003 2002, 2006 Lehigh lax coach, assistant coach of 2014 US nat'l team Kyle Dixon Virginia 2006 Stephen Peyser Johns Hopkins 2008 Paul Rabil Johns Hopkins 2008 Chris Schiller Penn State 1999 Max Seibald Cornell 2009 Alex Smith Delaware 2007 Matt Striebel Princeton 2001 2002, 2006 Matt Zash Duke 2006\n\nDefense\n\nName College Previous US rosters Note Joe Cinosky Maryland 2009 Assistant lacrosse coach at Mount St. Mary's, volunteer assistant lax coach at Duke in 2013 DJ Driscoll Notre Dame 2006 Eric Martin Salisbury 2004 Ryan McClay Cornell 2003 2002 Shawn Nadelen Johns Hopkins 2001 Lax head coach at Towson Kyle Sweeney (LSM) Georgetown 2003 2006 In MLL All-Star game in 2014 versus the US national team, on practice roster for 2014 US team\n\nGoalkeepers\n\nName College Previous US rosters Brian Dougherty Maryland 1996 1998 Adam Fullerton Army 2008\n\nFour-time national team members\n\nPlayer Position College US rosters John DeTommaso Defense Johns Hopkins 1986, 1990, 1994, 1998 Vinnie Sombrotto Midfield Hofstra 1982, 1986,\n\nThree-time national team members\n\nPlayers are listed in alphabetical order by last name.\n\nPlayer Position College US rosters Ryan Boyle Attack Princeton 2002, 2006, 2010 Jim Burke Defense Cortland 1982, 1986, 1990 Kevin Cassese Midfield Duke 2002, 2006, 2010 Zack Colburn Defense Pennsylvania 1990, 1994, 1998 Ned Crotty Attack Duke 2010, 2014, 2018 Jim Darcangelo Midfield Towson 1978, 1982, 1986 Norm Engelke Midfield Cornell 1982, 1986, 1990 Sal LoCascio Goalie Massachusetts 1990, 1994, 1998 Larry Quinn Goalie Johns Hopkins 1986, 1990, 1994 Paul Rabil Midfield Johns Hopkins 2010, 2014, 2018 Matt Striebel Midfield Princeton 2002, 2006, 2010\n\nSee also"}, {"url": "https://phillylacrosse.com/2019/former-marple-newtown-great-becker-dececco-to-be-inducted-into-us-lacrosse-hall-of-fame/", "page_content": "Phillylacrosse.com, Posted 5/22/19\n\nFrom US Lacrosse\n\nThe National Lacrosse Hall of Fame announces the addition of nine new inductees as the Class of 2019, following approval by US Lacrosse’s Board of Directors. The newest members will be officially inducted in a ceremony on Saturday, October 19, at The Grand Lodge in Hunt Valley, Md.\n\nThe 2019 inductees are led by former Marple Newtown great Rachael Becker DeCecco, former Penn Wood great Kara Ariza Cooke as well as former Princeton greats Ryan Boyle and Matt Stribel; Charlie Coker, Sarah Forbes, Cathy Nelson Reese, Paul Schimoler, and Richard Speckmann.\n\nRachael Becker DeCecco\n\nTickets for the 2019 National Lacrosse Hall of Fame Induction Ceremony, sponsored by RPS Bollinger and the Markel Insurance Company, will be available to the public for purchase beginning August 1. Tickets will be sold online at uslacrosse.org/HOF.\n\nThe National Lacrosse Hall of Fame, a program of US Lacrosse, was established in 1957 to honor men and women who by their deeds as players, coaches, officials and/or contributors, and by the example of their lives, personify the great contribution of lacrosse to our way of life.\n\nThe goal of the men’s and women’s selection committees, chaired by Hall of Fame members Vinnie Sombrotto and Jess Wilk, respectively, is to select the absolute best of the best, within the context of an individual’s era of participation. A nine-person ballot committee develops the list of annual nominees, while a 21-member voting committee finalizes the selections.\n\nThe voting group is comprised of current Hall of Fame members, current or former U.S. National Team players and coaches, elite level high school or college coaches, elite members of the officiating community, and individuals that have contributed to the growth of the sport on a national or international level. A full explanation of the process can be accessed here.\n\nOver 400 lacrosse greats are honored in the National Lacrosse Hall of Fame, which is located alongside the National Lacrosse Museum at the US Lacrosse Headquarters in Sparks, Maryland.\n\nBios for this year’s inductees are listed below:\n\nRachael Becker DeCecco\n\nDeCecco will be inducted as a truly great player. She was a three-time, first team All-American defender at Princeton University (2001, 2002, 2003) and named as the recipient of the Tewaawaton Trophy in 2003 as the nation’s most outstanding player. DeCecco helped Princeton win the NCAA championship in 2002 & 2003, and was named MVP of the NCAA Tournament in 2003. She was also the national defender of the year in both 2002 and 2003, and the Ivy League’s player of the year as well as the NCAA’s Honda Award winner for lacrosse in 2003. She was named to the NCAA’s 25th Anniversary Team in 2006. DeCecco was a member of the U.S. Women’s National Team Program from 2003-2008, and played on the U.S. World Cup Team in 2005. She has been previously inducted into the Marple Newtown (Pa.) High School Athletic Hall of Fame (2004) and the US lacrosse Philadelphia/Eastern Pennsylvania Chapter’s Hall of Fame (2014).\n\nKara Ariza Cooke\n\nCooke will be inducted as a truly great player. She was a three-time All-American at the University of Virginia, earning first team honors as a defender in both 1997 and 1998, and second team status in 1996. Cooke helped lead Virginia to the ACC title as a senior in 1998 and was named MVP of the ACC Tournament that year. She earned All-ACC honors in both 1997 & 1998, and was selected to play in the North-South All-Star Game in 1998. In addition, Cooke was selected to ACC’s 50th Anniversary Team in 2002. Cooke was a member of the 2001 and 2005 U.S. World Cup Teams, winning the gold medal in 2001 and the silver in 2005. As a member of the U.S. Women’s National Team Program from 1997-2006, she also played on the U.S. Touring Team against Australia in 2000. She was inducted to the US lacrosse Charlottesville Chapter Hall of Fame in 2015. Ariza Cooke was a standout in lacrosse and field hockey at Penn Wood.\n\nRyan Boyle\n\nBoyle will be inducted as a truly great player. He enjoyed an All-American career at Princeton University, earning first team honors as an attackman in 2003 and 2004, second team accolades in 2002, and third team status in 2001. Boyle earned All-Ivy honors three times (2002, 2003, 2004) and was named the Ivy League’s Player of the Year in 2002 and 2004. Princeton captured the Ivy title in each of his four seasons, and won the national championship in 2001. Boyle concluded his career with 70 goals, 162 assists, and 232 career points. He ranks second in Princeton history in assists and third in points. Boyle was a member of the 2002, 2006 and 2010 U.S. Men’s National Teams, winning the gold medal twice. He enjoyed an 11-year professional career in Major League Lacrosse, playing for the Philadelphia Barrage and Boston Cannons. Boyle was selected as the MLL’s Rookie of the Year in 2004, and as All-Pro in 2006. He finished his MLL career as the all-time leader in assists (254) and ranked sixth in points (423). A native of Cockeysville, Md., Boyle was inducted into the US Lacrosse Greater Baltimore Chapter’s Hall of Fame in 2015.\n\nMatt Striebel\n\nStriebel will be inducted as a truly great player. He was a two-time All-American at Princeton University, splitting time during his career between attack and midfield. Striebel helped the Tigers capture two NCAA championships during his career, winning the title in 1998 and 2001. He was also a part of four Ivy League championships, and earned all-Ivy honors three times (1999, 2000, 2001). Striebel played on three U.S. National Teams, helping to claim world championships in 2002 and 2010, and a runner-up finish in 2006. He also enjoyed a 13-year professional career in Major League Lacrosse, earning all-star honors nine times and All-Pro status in 2007 & 2008. He was a part of three MLL championships, and selected as the Championship Game MVP in 2007. He finished his MLL career with 225 goals, 120 assists, and 355 points, ranking among the top 10 all-time in each category. A product of Gill, Mass., Striebel was inducted into the US Lacrosse Western Massachusetts Chapter Hall of Fame in 2014.\n\nCharlie Coker\n\nCoker will be inducted as a truly great player. He was a three-time All-American midfielder at Johns Hopkins University, with first team honors in both 1969 and 1970, and honorable mention status in 1968. Coker played on three USILA national championship teams for the Blue Jays (1968, 1969, 1970), and was selected to play in the USILA’s North-South All-Star Game following his senior season in 1970. He finished his career with 53 goals and 21 assists after leading the team in goals (16) and tying for the team-lead in points (28) as a senior. Coker scored a career-high 23 goals and added five assists as a junior and was named to the All-Time Johns Hopkins Team at the end of his career. An accomplished three-sport athlete who also competed on the football and wrestling teams at Hopkins, he was recognized as both the school’s freshman athlete of the year in 1967 and the outstanding senior in 1970. He earned seven varsity letters as a collegiate athlete. He was inducted to the Johns Hopkins Athletic Hall of Fame in 2008.\n\nSarah Forbes\n\nForbes will be inducted as a truly great player. She was a three-time All-American at the University of Maryland, earning first team honors in both 1996 and 1997, and third team honors in 1995. In 1997, Forbes was the national offensive player of the year as well as the ACC’s player of the year, and named winner of the ACC’s Mary Garber Award as its top female athlete. She helped lead the Terps to three straight NCAA titles (1995, 1996, 1997) during her career, as well as the ACC championship in 1997. Forbes was named to the NCAA’s 25th Anniversary Team in 2006. As an international player, Forbes was a member of the Australian World Cup Team four times (1993, 2001, 2005, 2009), helping the Aussies capture the gold medal in 2005, as well as two silver medals and one bronze during her tenure. She earned All-World honors in both 2005 and 2009, and was named tournament MVP in 2005. She also served as team captain for the victorious 2005 World Cup team. Forbes was inducted into the University of Maryland’s Athletics Hall of Fame in 2012.\n\nCathy Nelson Reese\n\nReese will be inducted as a truly great coach. As one of the nation’s most decorated women’s coaches, Reese is a three-time winner of the IWLCA’s national coach of the year award (2010, 2014, 2015) and 10-time conference coach of the year. Through 2018, she has led the University of Maryland to four national championships (2010, 2014, 2015, 2017), 10 final fours, and nine conference championships in the ACC and Big Ten. Including three years as the head coach at University of Denver, Reese had a career record of 279-50 prior to the start of the 2019 season. She ranks as the Terps’ all-time winningest coach, with a 268-22 record at Maryland heading into this weekend’s NCAA national semifinals. Reese has produced seven Tewaaraton Trophy winners and 57 All-Americans. She has been previously inducted into the Howard County (Md.) Women’s Athletic Hall of Fame, the US Lacrosse Potomac Chapter’s Hall of Fame (2009), and the US Lacrosse Greater Baltimore Chapter’s Hall of Fame (2010).\n\nPaul Schimoler\n\nSchimoler will be inducted posthumously as a truly great player. He was a four-time All-American goalie at Cornell University, earning second team honors in 1987, third team status in 1989, and honorable mention recognition in 1986 & 1988. He was the first Big Red player to receive national honors four times. Schimoler also earned all-Ivy League honors four times, including first team status in 1987 & 1989. He was the Ivy League’s player of the year in 1989 and its rookie of the year in 1986. He also helped lead Cornell to the Ivy championship in 1987. At the time of graduation, Schimoler was the NCAA’s all-time leader with 787 career saves. He also set the NCAA Tournament record with 85 saves in 1988. Schimoler enjoyed an eight-year post-collegiate club career, and was the USCLA’s Player of the Year (North) in 1990. Internationally, he played for the U.S. National Team in 1990 and 1994, winning the gold both times. Schimoler passed away from cancer in 2013.\n\nRichard Speckmann\n\nSpeckmann will be inducted as a truly great coach. One of the most successful junior college coaches ever, he amassed a 477-158-1 record in 40 years at Nassau (N.Y.) Community College. He retired following the 2010 season with a career winning percentage of over 75 percent. Speckmann led Nassau to 20 NJCAA championships during his tenure, qualifying for the four-team finals in 39 of his 40 seasons. He coached over 200 NJCAA All-Americans during his career, and had over 100 players move on to NCAA All-America status. Speckmann was the NJCAA’s national coach of the year six times (1975, 1978, 1982, 1992, 2000, 2008). He also served twice as president of the NJCAA Coaches Association. A native of Oceanside, N.Y., Speckmann is a graduate of SUNY Cortland, where he lettered three times in both lacrosse and football. He has been inducted previously into the US Lacrosse Long Island Metro Chapter Hall of Fame, the SUNY Cortland Hall of Fame, and the IMLCA Hall of Fame."}, {"url": "https://www.usalacrosse.com/news-media-blog/usa-lacrosse-names-final-roster-2023-world-lacrosse-mens-championship", "page_content": "SPARKS, Md. — USA Lacrosse has named the final 23-man roster that will represent the United States in the 2023 World Lacrosse Men’s Championship in San Diego. The United States is the reigning world champion and will be the No. 1 seed for the 30-team event which runs June 21 through July 1.\n\nThe roster was selected following a 50-player training camp in Florida, held in conjunction with the IMLCA Winter Summit, earlier this month. It was the fourth training opportunity head coach John Danowski and his staff have had with the players since June.\n\n“The character of these guys was beyond anything I could have imagined,” said Danowski, who led the U.S. to the world championship in 2018 in Israel. “The way they tried to do the things we asked them to do, it was incredible. At every event they made it hard for us [to make the final roster decisions]. The meeting we had to make the selections was one of the most stressful things in my coaching career and the face-to-face meeting with the players was incredibly difficult. One of our assistant coaches was still shaking after the meeting. That’s how profound the effect they had on us.”\n\nThe roster selected includes six gold medalists from the 2018 U.S. team — Trevor Baptiste, Jesse Bernhardt, Michael Ehrhardt, Jack Kelly, Rob Pannell and Tom Schreiber. Bernhardt and Pannell will both be playing on their third U.S. team after also competing in 2014, but the national team experience doesn’t end there.\n\nRyan Conrad, Brennan O’Neill, Jack Rowlett and Michael Sowers all won gold medals with the U.S. U19/U21 program; Liam Byrnes, Conrad, Zach Goodrich, Kelly and Schreiber all represented the U.S. on the Sixes squad earlier this year at The World Games in Birmingham, Ala.; and Baptiste, Matthew Dunn, Connor Kelly, Kieran McArdle, Matt Rambo, Blaze Riorden and Schreiber have all played for the U.S. box team in the World Indoor Lacrosse Championship.\n\nThe entire roster, with the exception of O’Neill, a junior at Duke, played in the Premier Lacrosse League this past summer and 11 of the players are currently playing box in the National Lacrosse League.\n\nThe 23-man roster includes players that played for 15 different college programs, led by Maryland with five players and Denver and Duke with three each.\n\nThe U.S. has won a record 10 world championships since the first international competition in 1967, but will face numerous challengers, including three-time champion Canada. The U.S. is looking to become the first nation to repeat as champion at this event in more than two decades. The U.S. and Canada have alternated championships since the U.S. won its sixth straight world championship in 2002. Canada won in 2006 and 2014 while the U.S. won in 2010 and 2018.\n\nThe U.S. men’s national team trains and plays using best-in-class products from Nike Lacrosse (apparel and footwear), DJO (sports bracing) and game-changing, high-performance equipment from Cascade Maverik and Warrior.\n\nIn addition to these partners, Gatorade, MedStar Health, National Center for Safety Initiatives and Stryker are official sponsors of the U.S. national team program. Team training is also aided by products from Athletic Republic.\n\nFunding for the national team also comes from generous donors to the USA Lacrosse Foundation. Help support the team on The Journey to San Diego.\n\n2023 U.S. Men's Team\n\nName Position Pro Team(s) College Trevor Baptiste FO Atlas/Philadelphia Denver '18 Jesse Bernhardt D Chrome Maryland '13 Charlie Bertrand A/M Redwoods/Las Vegas Merrimack '20/Virginia (Gr.) Liam Byrnes LSM Waterdogs/Panther City Marquette '16 Ryan Conrad M Waterdogs Virginia '19 Matthew Dunn D Whipsnakes Maryland '16 Michael Ehrhardt LSM Whipsnakes Maryland '14 JT Giles-Harris D Chrome Duke '21 Zach Goodrich SSDM Cannons Towson '19 TD Ierlan FO Redwoods/Toronto Yale '20/Denver (Gr.) Connor Kelly M Waterdogs/Albany Maryland '18 Jack Kelly G Redwoods Brown '16 Danny Logan SSDM Atlas/San Diego Denver '21 Kieran McArdle A Waterdogs/Albany St. John's 14 Brennan O'Neill A/M Duke '24 Rob Pannell A Redwoods Cornell '13 Matt Rambo A Whipsnakes/Philadelphia Maryland '17 Jacob Richard SSDM Atlas Marquette '16 Blaze Riorden G Chaos/Philadelphia Albany '16 Jack Rowlett D Chaos North Carolina '19 Tom Schreiber M Archers/Toronto Princeton '14 Michael Sowers A/M Waterdogs Princeton '20/Duke (Gr.) Ryan Terefenko SSDM Chrome/Halifax Ohio State '21\n\nAbout USA Lacrosse\n\nUSA Lacrosse, a 501(c)(3) nonprofit corporation, is the governing body of men’s and women’s lacrosse in the United States, leads the U.S. National Teams Program and establishes universal standards. With more than 400,000 members across the country, USA Lacrosse unites the community of players, coaches, officials, parents, and program leaders. Working together, we inspire participation, enrich the athlete experience, and support the growth of the sport."}, {"url": "http://worldheritage.org/articles/United_States_men%27s_national_lacrosse_team", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://wiki2.org/en/United_States_men%27s_national_lacrosse_team", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nThe United States men's national lacrosse team has won ten of thirteen World Lacrosse Championships, the most recent in 2018. Team USA finished second in the other three field lacrosse tournaments, losing to Canada in 1978, 2006, and 2014.\n\nThe team is organized by US Lacrosse, the national governing body. The roster usually consists of lacrosse players who play in the Premier Lacrosse League.\n\nYouTube Encyclopedic\n\n1 / 5 Views: 15 582 29 907 90 396 31 073 40 368\n\nReacting to the 2023 Team USA lacrosse roster\n\nWorld Champions - The Vlog\n\nTeam USA vs Canada | 2021 USA Lacrosse Fall Classic | Full Game\n\nThe 2022 Lacrosse World Series Championship- Team 91 LI Machine (2027) v. BBL National (2027)\n\nThe Journey Ep 1 | U19 Men's Lacrosse World Championships Transcription\n\nCompetition achievements\n\nOlympic Games\n\nGames Representative Finish Ref. 1904 St. Louis St. Louis Amateur Athletic Association Silver Silver [1]\n\nWorld Championships\n\nTeam USA vs. MLL All-Stars in 2006.\n\n2023 team\n\nUS Lacrosse announced their 23 man roster for the 2023 World Lacrosse Championship on December 20, 2022.[2]\n\n2018 team\n\nUS Lacrosse announced the final 23-man roster for the 2018 World Lacrosse Championship on January 7, 2018.[3]\n\n2014 team\n\nUS Lacrosse finalized its 23-man roster on June 30, 2014, by cutting eight players that were on the roster for the Team USA versus MLL All Star game on June 26, 2014.[4]\n\nStarting attack\n\nName College Previous US rosters 2014 MLL team Note Ned Crotty Duke 2010 2010 New York Won NCAA championship in 2010, 2010 Tewaaraton Trophy winner, 1st team All-American in 2009 and 2010 Brendan Mundorf UMBC 2006 2010 Chesapeake Played for Australia in the 2006 World Lacrosse Championship, 2012 MLL MVP Rob Pannell Cornell 2013 New York Won Tewaaraton in 2013, will run attack from behind the cage[5]\n\nOther attackmen\n\nName College Previous US rosters 2014 MLL team Note Marcus Holman UNC 2013 Ohio 1st team All-American in 2013 Kevin Leveille Massachusetts 2003 Rochester His younger brother Mike Leveille (Syracuse 2008) was on the 2010 team, alternate on 2010 team Garrett Thul Army 2013 Florida\n\nStarting midfield\n\nName College Previous US rosters 2014 MLL team Note Kevin Buchanan Ohio State 2008 Boston Paul Rabil Johns Hopkins 2008 2010 Boston Won NCAA championship in 2005 and 2007; 1st team All-American in 2006, 2007 and 2008 Max Seibald Cornell 2009 2010 New York Won Tewaaraton in 2009\n\nOther midfielders\n\nName College Previous US rosters 2014 MLL team Note Matt Abbott Syracuse 2009 Chesapeake Won two NCAA championship (2008 and 2009), 1st team All-American in 2009, his father and grandfather played lax at Syracuse,[6] assistant coach with his brother Mike at Colgate,[6] second on USA team with four groundballs in win versus MLL All Starts in on June 26, 2014 Dan Burns Maryland 2011 Chesapeake Walk-on in college[5] Kyle Harrison Johns Hopkins 2005 2006 Ohio Won NCAA championship in 2005, won Tewaaraton in 2005 David Lawson Duke 2013 Rochester Won NCAA championship in 2010 and 2013, 1st team All-American in 2013\n\nFaceoff\n\nName College Previous US rosters 2014 MLL team Note Chris Eck Colgate '08 Boston won 60% of faceoffs in 2014 MLL season[7] Greg Gurenlian Penn State '06 New York\n\nStarting defense\n\nName College Previous US rosters 2014 MLL team Note Tucker Durkin Johns Hopkins 2013 Chesapeake 1st team All-American in 2012 and 2013 Michael Evans Johns Hopkins 2009 Chesapeake Won NCAA championship in 2007, 1st team All-American in 2009 Lee Zink Maryland 2004 Denver Outlaws MLL Defensive Player of the Year in 2012 and 2013,[8] 1st team All-American in 2004, alternate on 2010 team\n\nOther defensemen\n\nName College Previous US rosters 2014 MLL team Note Mitch Belisle (D/LSM/SSDM) Cornell 2007 Boston 1st team All-American in 2007, plays with both a short- and long-stick in the MLL[5] Jesse Bernhardt (D/LSM) Maryland 2013 Chesapeake 1st team All-American in 2013, led USA team with six groundballs versus MLL All Star team on June 26, 2014 Kyle Hartzell (D/LSM) Salisbury 2007 New York\n\nGoalkeepers\n\nName College Previous US rosters 2014 MLL team Note Drew Adams Penn State 2009 New York Played behind 2010 goalie Brian Dougherty as a rookie[9] Jesse Schwartzman Johns Hopkins 2007 Denver Won NCAA championship in 2005 and 2007\n\n2010 team\n\nAttackmen\n\nName College Previous US rosters Note Ryan Boyle Princeton 2004 2002, 2006 Played in 2014 MLL season with Boston. Withdrew from 2014 USA tryout pool.[10] Ned Crotty Duke 2010 Mike Leveille Syracuse 2008 Sat out the 2011, 2012 and 2014 MLL seasons due to full-time job at NBC[11] Brendan Mundorf UMBC 2008 Ryan Powell Syracuse 2000 2006 2010 US team captain, runs Rhino Lacrosse in Portland, Oregon Drew Westervelt USMB 2008 In MLL All-Star game in 2014 versus the US national team, on practice roster for 2014 US team\n\nMidfielders\n\nName College Previous US rosters Note Kevin Cassese Duke 2003 2002, 2006 Lehigh lax coach, assistant coach of 2014 US nat'l team Kyle Dixon Virginia 2006 Stephen Peyser Johns Hopkins 2008 Paul Rabil Johns Hopkins 2008 Chris Schiller Penn State 1999 Max Seibald Cornell 2009 Alex Smith Delaware 2007 Matt Striebel Princeton 2001 2002, 2006 Matt Zash Duke 2006\n\nDefense\n\nName College Previous US rosters Note Joe Cinosky Maryland 2009 Assistant lacrosse coach at Mount St. Mary's, volunteer assistant lax coach at Duke in 2013 DJ Driscoll Notre Dame 2006 Eric Martin Salisbury 2004 Ryan McClay Cornell 2003 2002 Shawn Nadelen Johns Hopkins 2001 Lax head coach at Towson Kyle Sweeney (LSM) Georgetown 2003 2006 In MLL All-Star game in 2014 versus the US national team, on practice roster for 2014 US team\n\nGoalkeepers\n\nName College Previous US rosters Brian Dougherty Maryland 1996 1998 Adam Fullerton Army 2008\n\nFour-time national team members\n\nPlayer Position College US rosters John DeTommaso Defense Johns Hopkins 1986, 1990, 1994, 1998 Vinnie Sombrotto Midfield Hofstra 1982, 1986,\n\nThree-time national team members\n\nPlayers are listed in alphabetical order by last name.\n\nPlayer Position College US rosters Jesse Bernhardt Defense Maryland 2014, 2018, 2023 Ryan Boyle Attack Princeton 2002, 2006, 2010 Jim Burke Defense Cortland 1982, 1986, 1990 Kevin Cassese Midfield Duke 2002, 2006, 2010 Zack Colburn Defense Pennsylvania 1990, 1994, 1998 Ned Crotty Attack Duke 2010, 2014, 2018 Jim Darcangelo Midfield Towson 1978, 1982, 1986 Norm Engelke Midfield Cornell 1982, 1986, 1990 Sal LoCascio Goalie Massachusetts 1990, 1994, 1998 Rob Pannell Attack Cornell 2014, 2018, 2023 Larry Quinn Goalie Johns Hopkins 1986, 1990, 1994 Paul Rabil Midfield Johns Hopkins 2010, 2014, 2018 Matt Striebel Midfield Princeton 2002, 2006, 2010\n\nSee also\n\nReferences"}, {"url": "https://wiki.alquds.edu/?query=United_States_men%27s_national_lacrosse_team", "page_content": "The United States men's national lacrosse team has won ten of thirteen World Lacrosse Championships, the most recent in 2018. Team USA finished second in the other three field lacrosse tournaments, losing to Canada in 1978, 2006, and 2014.\n\nThe team is organized by US Lacrosse, the national governing body. The roster usually consists of lacrosse players who play in the Premier Lacrosse League.\n\nCompetition achievements [ edit ]\n\nOlympic Games [ edit ]\n\nGames Representative Finish Ref. 1904 St. Louis St. Louis Amateur Athletic Association Silver Silver [1]\n\nWorld Championships [ edit ]\n\nTeam USA vs. MLL All-Stars in 2006.\n\n2023 team [ edit ]\n\nUS Lacrosse announced their 23 man roster for the 2023 World Lacrosse Championship on December 20, 2022.[2]\n\n2018 team [ edit ]\n\nUS Lacrosse announced the final 23-man roster for the 2018 World Lacrosse Championship on January 7, 2018.[3]\n\n2014 team [ edit ]\n\nUS Lacrosse finalized its 23-man roster on June 30, 2014, by cutting eight players that were on the roster for the Team USA versus MLL All Star game on June 26, 2014.[4]\n\nStarting attack [ edit ]\n\nName College Previous US rosters 2014 MLL team Note Ned Crotty Duke 2010 2010 New York Won NCAA championship in 2010, 2010 Tewaaraton Trophy winner, 1st team All-American in 2009 and 2010 Brendan Mundorf UMBC 2006 2010 Chesapeake Played for Australia in the 2006 World Lacrosse Championship, 2012 MLL MVP Rob Pannell Cornell 2013 New York Won Tewaaraton in 2013, will run attack from behind the cage[5]\n\nOther attackmen [ edit ]\n\nName College Previous US rosters 2014 MLL team Note Marcus Holman UNC 2013 Ohio 1st team All-American in 2013 Kevin Leveille Massachusetts 2003 Rochester His younger brother Mike Leveille (Syracuse 2008) was on the 2010 team, alternate on 2010 team Garrett Thul Army 2013 Florida\n\nStarting midfield [ edit ]\n\nName College Previous US rosters 2014 MLL team Note Kevin Buchanan Ohio State 2008 Boston Paul Rabil Johns Hopkins 2008 2010 Boston Won NCAA championship in 2005 and 2007; 1st team All-American in 2006, 2007 and 2008 Max Seibald Cornell 2009 2010 New York Won Tewaaraton in 2009\n\nOther midfielders [ edit ]\n\nName College Previous US rosters 2014 MLL team Note Matt Abbott Syracuse 2009 Chesapeake Won two NCAA championship (2008 and 2009), 1st team All-American in 2009, his father and grandfather played lax at Syracuse,[6] assistant coach with his brother Mike at Colgate,[6] second on USA team with four groundballs in win versus MLL All Starts in on June 26, 2014 Dan Burns Maryland 2011 Chesapeake Walk-on in college[5] Kyle Harrison Johns Hopkins 2005 2006 Ohio Won NCAA championship in 2005, won Tewaaraton in 2005 David Lawson Duke 2013 Rochester Won NCAA championship in 2010 and 2013, 1st team All-American in 2013\n\nFaceoff [ edit ]\n\nName College Previous US rosters 2014 MLL team Note Chris Eck Colgate '08 Boston won 60% of faceoffs in 2014 MLL season[7] Greg Gurenlian Penn State '06 New York\n\nStarting defense [ edit ]\n\nName College Previous US rosters 2014 MLL team Note Tucker Durkin Johns Hopkins 2013 Chesapeake 1st team All-American in 2012 and 2013 Michael Evans Johns Hopkins 2009 Chesapeake Won NCAA championship in 2007, 1st team All-American in 2009 Lee Zink Maryland 2004 Denver Outlaws MLL Defensive Player of the Year in 2012 and 2013,[8] 1st team All-American in 2004, alternate on 2010 team\n\nOther defensemen [ edit ]\n\nName College Previous US rosters 2014 MLL team Note Mitch Belisle (D/LSM/SSDM) Cornell 2007 Boston 1st team All-American in 2007, plays with both a short- and long-stick in the MLL[5] Jesse Bernhardt (D/LSM) Maryland 2013 Chesapeake 1st team All-American in 2013, led USA team with six groundballs versus MLL All Star team on June 26, 2014 Kyle Hartzell (D/LSM) Salisbury 2007 New York\n\nGoalkeepers [ edit ]\n\nName College Previous US rosters 2014 MLL team Note Drew Adams Penn State 2009 New York Played behind 2010 goalie Brian Dougherty as a rookie[9] Jesse Schwartzman Johns Hopkins 2007 Denver Won NCAA championship in 2005 and 2007\n\n2010 team [ edit ]\n\nAttackmen [ edit ]\n\nName College Previous US rosters Note Ryan Boyle Princeton 2004 2002, 2006 Played in 2014 MLL season with Boston. Withdrew from 2014 USA tryout pool.[10] Ned Crotty Duke 2010 Mike Leveille Syracuse 2008 Sat out the 2011, 2012 and 2014 MLL seasons due to full-time job at NBC[11] Brendan Mundorf UMBC 2008 Ryan Powell Syracuse 2000 2006 2010 US team captain, runs Rhino Lacrosse in Portland, Oregon Drew Westervelt USMB 2008 In MLL All-Star game in 2014 versus the US national team, on practice roster for 2014 US team\n\nMidfielders [ edit ]\n\nName College Previous US rosters Note Kevin Cassese Duke 2003 2002, 2006 Lehigh lax coach, assistant coach of 2014 US nat'l team Kyle Dixon Virginia 2006 Stephen Peyser Johns Hopkins 2008 Paul Rabil Johns Hopkins 2008 Chris Schiller Penn State 1999 Max Seibald Cornell 2009 Alex Smith Delaware 2007 Matt Striebel Princeton 2001 2002, 2006 Matt Zash Duke 2006\n\nDefense [ edit ]\n\nName College Previous US rosters Note Joe Cinosky Maryland 2009 Assistant lacrosse coach at Mount St. Mary's, volunteer assistant lax coach at Duke in 2013 DJ Driscoll Notre Dame 2006 Eric Martin Salisbury 2004 Ryan McClay Cornell 2003 2002 Shawn Nadelen Johns Hopkins 2001 Lax head coach at Towson Kyle Sweeney (LSM) Georgetown 2003 2006 In MLL All-Star game in 2014 versus the US national team, on practice roster for 2014 US team\n\nGoalkeepers [ edit ]\n\nName College Previous US rosters Brian Dougherty Maryland 1996 1998 Adam Fullerton Army 2008\n\nFour-time national team members [ edit ]\n\nPlayer Position College US rosters John DeTommaso Defense Johns Hopkins 1986, 1990, 1994, 1998 Vinnie Sombrotto Midfield Hofstra 1982, 1986,\n\nThree-time national team members [ edit ]\n\nPlayers are listed in alphabetical order by last name.\n\nPlayer Position College US rosters Jesse Bernhardt Defense Maryland 2014, 2018, 2023 Ryan Boyle Attack Princeton 2002, 2006, 2010 Jim Burke Defense Cortland 1982, 1986, 1990 Kevin Cassese Midfield Duke 2002, 2006, 2010 Zack Colburn Defense Pennsylvania 1990, 1994, 1998 Ned Crotty Attack Duke 2010, 2014, 2018 Jim Darcangelo Midfield Towson 1978, 1982, 1986 Norm Engelke Midfield Cornell 1982, 1986, 1990 Sal LoCascio Goalie Massachusetts 1990, 1994, 1998 Rob Pannell Attack Cornell 2014, 2018, 2023 Larry Quinn Goalie Johns Hopkins 1986, 1990, 1994 Paul Rabil Midfield Johns Hopkins 2010, 2014, 2018 Matt Striebel Midfield Princeton 2002, 2006, 2010\n\nSee also [ edit ]"}], "Matt Striebel won a gold medal at the 2010 FIL World Lacrosse Championship.": [{"url": "https://www.gazettenet.com/Matt-Striebel-will-be-inducted-into-National-Lacrosse-Hall-of-Fame-29390368", "page_content": "Lacrosse began as a hobby for Matt Striebel.\n\nHis sister, Jessica, played first and brought her stick home. He was a baseball fan and dreamed of becoming a major leaguer.\n\n“Like every kid in America,” the Northampton resident said.\n\nIntrigued, the Gill native started playing as a teenager for the Franklin County Lacrosse Club for Jeff Coulson, who now owns Indoor Action Sports in Greenfield.\n\n“Growing up here in western Mass., and I grew up in Gill, which was obviously not a hotbed of lacrosse at the time or really now. It’s such a dynamic combination of other sports you’re familiar growing up with,” Striebel said. “You get the best of all those worlds combined in one Frankenstein sport. For a lot of kids, and I see this all the time at camps, it just grabs you, and once it does you’re hooked for life.”\n\nLacrosse became Striebel’s passion and profession. He won championships at every level and worked to spread the spark lacrosse ignited in him. On Saturday, Striebel, 40, will earn one of the sport’s highest honors with his induction to the National Lacrosse Hall of Fame.\n\n“At a certain point, I’d had a career that was solid enough and significant enough that I had a pretty good idea that I would one day make it to the Hall of Fame. The part that was surprising to me was how quickly I got that call,” Striebel said. “It was a validating honor. It puts your career in a nice, cohesive narrative.”\n\nHe’ll be inducted as part of a nine-member class at the The Grand Lodge in Hunt Valley, Maryland, just outside Baltimore.\n\n“It’s increasingly starting to set in. There’s some behind the scenes getting tickets for people and organizing all that stuff that makes it seem like it’s more in the real world and less something that’s really special and exists as the culmination of a career,” Striebel said. “It’s sitting in a space that’s between about to be real and pretty fantastic.”\n\nStriebel received the call while out to lunch with his family at Green Bean in Northampton. It came from a Philadelphia number he didn’t recognize, so he let it go to voice mail. Rick Lake, the men’s lacrosse director of USA Lacrosse, was on the other end of the call.\n\n“My immediate assumption was they were calling because the annual giving campaigns had started up,” Striebel said. “As a veteran of three U.S. teams, they look to me to give donations every once in a while and I assumed that’s what it was.”\n\nInstead, he found out he was being inducted alongside one of his longtime teammates and best friends Ryan Boyle. Boyle was a freshman at Princeton during Striebel’s senior year in 2001. They both played attack, but Boyle took all of the repetitions during fall practices since Striebel also played soccer for the Tigers.\n\nAs a returning All-American and team captain, Striebel tried to coexist with the freshman.\n\n“It was pretty apparent that Ryan was just better at it than I was, even as a freshman,” said Striebel, who attended The Hotchkiss School before Princeton. “The coaches brought me into their office and said, ‘Striebs you had a great run, we’re going to move you to midfield.’ For about 48 hours, I hated Ryan.”\n\nBut he realized that if the team was going to compete for a title, that would give the Tigers the best chance. Princeton won the national championship for the second time in Striebel’s career.\n\nStriebel began his professional career the next season during the inaugural season of Major League Lacrosse. He played for the Bridgeport Barrage, and three years later after the franchise relocated to Philadelphia, they asked Striebel if Boyle was worth a first-round draft pick.\n\n“I said he was and it would make our team better instantly,” Striebel said.\n\nThe Barrage won the MLL title, one of three in Striebel’s 15-year career. He and Boyle also played together for the USA on three World Lacrosse Championship teams.\n\nBoyle started a company called Trinity Lacrosse in 2005 and brought Striebel on as the program’s national director, which is his full-time job. They run camps and events all over the country.\n\n“The fact that I was able to go in with Ryan, that’s such a poetic bookend to our career and our friendship in the sport,” Striebel said.\n\nStriebel was first called up to the U.S. national team in 2002, less than a year after the September 11 terrorist attacks. The Americans took gold in Perth, Australia.\n\n“To be able to put on a jersey and represent your country playing a sport you love, there aren’t many honors that are more fulfilling than that,” Striebel said.\n\nHe enjoyed teaming up with other elite players in a competitive setting. Unlike All-star games, which Striebel played in eight times, the world championships provided a goal to achieve rather than an exhibition.\n\nWhen the U.S. lost the 2006 final – the first time they hadn’t won gold since 1978 – Striebel and his team left their medals in the dormitories in Ontario.\n\n“It was a really difficult loss to stomach,” he said.\n\nStriebel and the USA redeemed themselves in 2010 in England with the nation’s ninth gold medal.\n\n“I’ve been fortunate enough to win a lot of incredible championships in my career, and those USA championships are definitely up there,” Striebel said. “I’ve had a fortunate career.”\n\nHe recognizes that fortune and works to give others the same opportunity. Striebel coached Northampton High School for seven years before stepping down following the 2018 season.\n\n“I’ve been fortunate enough to go all over the country and around the world spreading the gospel of lacrosse and sharing the sport with people who care about it,” Striebel said. “It has a strong fraternity of followers. It’s been amazing to see that expand to include so many people and so many places.”\n\nTrilogy partners with organizations like Harlem Lacrosse to bring the game to areas and environments that haven’t historically played it.\n\n“For many years it’s been a predominantly white, wealthy, preppy sport, and that’s not sustainable and that’s not the best version of lacrosse that’s going to exist,” Striebel said. “When the sport is available to kids all across the country whether you’re living in an inner city neighborhood or Fairfield County, Connecticut, that’s when the sport is really going to have achieved its peak.”"}, {"url": "https://premierlacrosseleague.com/articles/hall-of-fame-inductee-matt-striebel", "page_content": "A two-sport athlete at Princeton, Matt Striebel played lacrosse like a soccer player. In MLL offseasons, Striebel played three years of professional soccer from 2002-04 for the Western Massachusetts Pioneers of the USL Second Division.\n\n“His fitness level was just off the charts,” said former Philadelphia Barrage head coach Tony Resch. “He could keep going and going. He had great speed. He could shoot it. Unselfish. All the things you look for in a midfielder, he had it.”\n\nWhile Resch and most fans may remember Striebel as a lights-out shooter, that wasn’t always the case. Prior to his senior year at Princeton, Striebel was an X attackman. When freshman Ryan Boyle stepped on campus, Striebel was moved above GLE – where, Boyle jokes, his shot couldn’t break a paper bag.\n\n“He completely reinvented himself, starting with his senior year at Princeton moving from behind the cage out in front to midfield,” said Boyle, who also played with Striebel on the Philadelphia Barrage. “His dedication to his craft is truly remarkable. Going from somebody who didn’t really have much range to speak of at all to being somebody who you had to pick up at 16 yards… he was unguardable.”\n\nThat work ethic led to a 171-game career. Striebel evolved to earn playing time on the ‘04 Barrage midfield unit featuring Blake Miller (46G, 11A), Roy Colsey (25G, 6T, 7A), Mike Mollot (11G, 8A), and Doug Shanahan (12G, 6A).\n\nStriebel stuck the eventual game-winning goal in the ‘04 MLL Championship for that Barrage squad. He did the same in ‘07 on a broken powerplay – Boyle’s favorite shot of Striebel’s 15-year pro career."}, {"url": "https://www.usalacrosse.com/player-profile/matthew-striebel", "page_content": "Striebel was inducted as a truly great player. He was a two-time All-American at Princeton, splitting time during his career between attack and midfield. Striebel helped the Tigers capture two NCAA championships during his career, winning the title in 1998 and 2001. He was also a part of four Ivy League championships, and earned All-Ivy honors three times (1999, 2000, 2001).\n\nStriebel played on three U.S. National Teams, helping to claim world championships in 2002 and 2010, and a runner-up finish in 2006. He also enjoyed a 13-year professional career in Major League Lacrosse, earning all-star honors nine times and All-Pro status in 2007 & 2008. He was a part of three MLL championships and was selected as the Championship Game MVP in 2007. He finished his MLL career with 225 goals, 120 assists, and 355 points, ranking among the top 10 all-time in each category.\n\nA product of Gill, Mass., Striebel was inducted into the US Lacrosse Western Massachusetts Chapter Hall of Fame in 2014."}, {"url": "https://worldlacrosse.sport/events/world-event-history-and-results/", "page_content": "The initial World Championship was a four-team invitational tournament that coincided with Canada’s centennial lacrosse celebration in 1967. The Mt. Washington (Md.) Lacrosse Club represented the United States and won the tournament. Seven years later, Australia celebrated its lacrosse centennial, and the U.S. fielded an all-star team to compete in a similar international invitational tournament with Canada and England again. It was here that the concept of holding a world championship tournament every four years was born and the International Lacrosse Federation (ILF) formed.\n\nIn 2008 the ILF merged with the International Federation of Women’s Lacrosse Associations (IFWLA) to form the Federation of International Lacrosse (FIL)—the present governing body for both men’s and women’s world championship lacrosse.\n\nThe U.S. captured its tenth World Lacrosse Championship at the 2018 FIL Men’s World Championship hosted in Netanya, Israel, beating Canada in the last seconds of the game, 9-8. Canada has captured three championships throughout the history of the event with it’s most recent championship coming in a stunning 8-5 upset of the US at the 2014 World Lacrosse Championship in Denver, Colorado.\n\nUS will defend it’s championship at the 2022 FIL Men’s World Lacrosse Championship in Coquitlam, BC, Canada, 13-24 July 2022."}, {"url": "https://www.atholdailynews.com/Matt-Striebel-will-be-inducted-into-National-Lacrosse-Hall-of-Fame-29457835", "page_content": "Lacrosse began as a hobby for Matt Striebel.\n\nHis sister, Jessica, played first and brought her stick home. He was a baseball fan and dreamed of becoming a major leaguer.\n\n“Like every kid in America,” the Northampton resident said.\n\nIntrigued, the Gill native started playing as a teenager for the Franklin County Lacrosse Club for Jeff Coulson, who now owns Indoor Action Sports in Greenfield.\n\n“Growing up here in western Mass., and I grew up in Gill, which was obviously not a hotbed of lacrosse at the time or really now. It’s such a dynamic combination of other sports you’re familiar growing up with,” Striebel said. “You get the best of all those worlds combined in one Frankenstein sport. For a lot of kids, and I see this all the time at camps, it just grabs you, and once it does you’re hooked for life.”\n\nLacrosse became Striebel’s passion and profession. He won championships at every level and worked to spread the spark lacrosse ignited in him. On Saturday, Striebel, 40, will earn one of the sport’s highest honors with his induction to the National Lacrosse Hall of Fame.\n\n“At a certain point, I’d had a career that was solid enough and significant enough that I had a pretty good idea that I would one day make it to the Hall of Fame. The part that was surprising to me was how quickly I got that call,” Striebel said. “It was a validating honor. It puts your career in a nice, cohesive narrative.”\n\nHe’ll be inducted as part of a nine-member class at the The Grand Lodge in Hunt Valley, Maryland, just outside Baltimore.\n\n“It’s increasingly starting to set in. There’s some behind the scenes getting tickets for people and organizing all that stuff that makes it seem like it’s more in the real world and less something that’s really special and exists as the culmination of a career,” Striebel said. “It’s sitting in a space that’s between about to be real and pretty fantastic.”\n\nStriebel received the call while out to lunch with his family at Green Bean in Northampton. It came from a Philadelphia number he didn’t recognize, so he let it go to voice mail. Rick Lake, the men’s lacrosse director of USA Lacrosse, was on the other end of the call.\n\n“My immediate assumption was they were calling because the annual giving campaigns had started up,” Striebel said. “As a veteran of three U.S. teams, they look to me to give donations every once in a while and I assumed that’s what it was.”\n\nInstead, he found out he was being inducted alongside one of his longtime teammates and best friends Ryan Boyle. Boyle was a freshman at Princeton during Striebel’s senior year in 2001. They both played attack, but Boyle took all of the repetitions during fall practices since Striebel also played soccer for the Tigers.\n\nAs a returning All-American and team captain, Striebel tried to coexist with the freshman.\n\n“It was pretty apparent that Ryan was just better at it than I was, even as a freshman,” said Striebel, who attended The Hotchkiss School before Princeton. “The coaches brought me into their office and said, ‘Striebs you had a great run, we’re going to move you to midfield.’ For about 48 hours, I hated Ryan.”\n\nBut he realized that if the team was going to compete for a title, that would give the Tigers the best chance. Princeton won the national championship for the second time in Striebel’s career.\n\nStriebel began his professional career the next season during the inaugural season of Major League Lacrosse. He played for the Bridgeport Barrage, and three years later after the franchise relocated to Philadelphia, they asked Striebel if Boyle was worth a first-round draft pick.\n\n“I said he was and it would make our team better instantly,” Striebel said.\n\nThe Barrage won the MLL title, one of three in Striebel’s 15-year career. He and Boyle also played together for the USA on three World Lacrosse Championship teams.\n\nBoyle started a company called Trinity Lacrosse in 2005 and brought Striebel on as the program’s national director, which is his full-time job. They run camps and events all over the country.\n\n“The fact that I was able to go in with Ryan, that’s such a poetic bookend to our career and our friendship in the sport,” Striebel said.\n\nStriebel was first called up to the U.S. national team in 2002, less than a year after the September 11 terrorist attacks. The Americans took gold in Perth, Australia.\n\n“To be able to put on a jersey and represent your country playing a sport you love, there aren’t many honors that are more fulfilling than that,” Striebel said.\n\nHe enjoyed teaming up with other elite players in a competitive setting. Unlike All-star games, which Striebel played in eight times, the world championships provided a goal to achieve rather than an exhibition.\n\nWhen the U.S. lost the 2006 final – the first time they hadn’t won gold since 1978 – Striebel and his team left their medals in the dormitories in Ontario.\n\n“It was a really difficult loss to stomach,” he said.\n\nStriebel and the USA redeemed themselves in 2006 in England with the nation’s ninth gold medal.\n\n“I’ve been fortunate enough to win a lot of incredible championships in my career, and those USA championships are definitely up there,” Striebel said. “I’ve had a fortunate career.”\n\nHe recognizes that fortune and works to give others the same opportunity. Striebel coached Northampton High School for seven years before stepping down following the 2018 season.\n\n“I’ve been fortunate enough to go all over the country and around the world spreading the gospel of lacrosse and sharing the sport with people who care about it,” Striebel said. “It has a strong fraternity of followers. It’s been amazing to see that expand to include so many people and so many places.”\n\nTrilogy partners with organizations like Harlem Lacrosse to bring the game to areas and environments that haven’t historically played it.\n\n“For many years it’s been a predominantly white, wealthy, preppy sport, and that’s not sustainable and that’s not the best version of lacrosse that’s going to exist,” Striebel said. “When the sport is available to kids all across the country whether you’re living in an inner city neighborhood or Fairfield County, Connecticut, that’s when the sport is really going to have achieved its peak.”"}, {"url": "https://www.usalaxmagazine.com/usa-insider/senior-men/hall-of-fame-call-a-final-victory-for-the-versatile-matt-striebel", "page_content": "Nine lacrosse legends — Ryan Boyle, Charlie Coker, Kara Ariza Cooke, Rachael Becker DeCecco, Sarah Forbes, Cathy Reese, Paul Schimoler, Richard Speckmann and Matt Striebel — will be inducted into the National Lacrosse Hall of Fame Oct. 19 at The Grand Lodge in Hunt Valley, Md. These are their stories.\n\nMatt Striebel was out to lunch with his wife and two kids, and then he saw his phone ring. He didn’t recognize the number, so he let it go straight to voicemail, as one does.\n\nThe message, he quickly realized, was from US Lacrosse. It was right around the annual giving time for the men’s national team, Striebel said, so he called back to let them know his check was ready to be sent out.\n\nBut on the other line was Rick Lake, men's game senior manager at US Lacrosse. His message was a tad different.\n\n“He goes, ‘Matt, we're actually calling you to let you know made the Hall of Fame,’” the Gill, Mass., native recalled. “It was an amazing moment that was made doubly better that I found out I was going in with Ryan (Boyle). As soon as I hung up that phone call, I called Ryan and was like, ‘This is crazy. Can you believe it?’ It was the perfect, poetic bookend to a journey of our playing careers.”\n\n\"We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?\" — Matt Striebel describing a meeting Bill Tierney his senior year.\n\nStriebel is one of nine set for the National Lacrosse Hall of Fame’s Class of 2019, entering with his close friend, Boyle — a fellow champion at Princeton, with the U.S. national team and in Major League Lacrosse. They now work together at Trilogy Lacrosse, the company Boyle co-founded, though their roots extend back to 2001 at Princeton.\n\nThe Tigers, then coached by fellow Hall of Fame member Bill Tierney, had Boyle entering as a blue-chip recruit down on attack. Striebel, a captain and returning All-American on attack, was excited by playing with a player of his quality. Plans went another direction, though.\n\n“We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?,’” said Striebel, who gave himself 24 hours to sulk before embracing his new role.\n\n“I decided it's my senior year, I really want to win and am here to win a national championship. From a lacrosse standpoint, it's the best thing that could have happened to me, because I am more of a midfielder talent-wise and it made us a better team and opened opportunities on the U.S. team and as a professional.”\n\nThat’s not hyperbole from Striebel, either. That 2001 season marked Striebel’s second national championship while at Princeton, as well as a fourth straight Ivy League championship. On the national stage, he captured gold at the World Lacrosse championships in 2002 (Perth) and 2010 (Manchester), plus silver in 2006 (Ontario).\n\nStriebel also secured three MLL championships (2004, ‘06, ‘07) with the Philadelphia Barrage, earning earning MLL All-Star honors on nine occasions. Boyle was right there at nearly every step.\n\n“I’m far happier for him than I am for myself,” Boyle said.\n\n\n\n\n\n\n\n\n\n\n\n“I often say there are some guys out there who are A-plus in a couple categories. Oh, he's an A-plus shooter or an A-plus dodger,” Striebel began. “For me, I think I just had the versatility to be B-plus, A-minus guy in a lot of different categories. That allowed me to change and adapt my game as I got older.\n\n“The first 10 years I was in the MLL, I think I took one two-point shot and it was on an open goal when we needed goal differential for the playoffs. Then as I got older, like a basketball player who's adding a different aspect, I became more of a shooter so I could develop other parts of my game and maintain relevance as a player.”\n\nBut like most great players, Striebel’s connection with the game didn’t cease once he put away the pads and cleats. He’s spent the last seven years coaching at Northampton High School in Massachusetts, plus working for Trilogy. He’s especially close with coaches in the Colonial Athletic Association, so he’ll often swing by nearby UMass-Amherst to catch games and chat with old friends.\n\nThose experiences also remind Striebel of his time at Hotchkiss, in Lakeville, Conn., during the mid-1990s. He said that was the “dawn of the post-graduate lacrosse era” at New England prep schools, where he played alongside several NHL draft picks.\n\n“You had kids who played multiple sports at a very high level,” Striebel said. “There were great athletes and for better or for worse, lacrosse has become a 365-day endeavor where kids have an opportunity to play every day.”"}, {"url": "https://www.statscrew.com/lacrosse/stats/p-striemat001", "page_content": "Matt Striebel\n\nMatt Striebel\n\nBorn: January 12, 1979\n\nIowa City, IA\n\nPosition: M\n\nHeight: 6'1\"\n\nWeight: 190\n\nCareer: 2001-2015\n\n\n\nMatt Striebel scored 225 goals and recorded 117 assists in his 167-game career with the Bridgeport Barrage, Philadelphia Wings, Philadelphia Barrage, Barrage, Chicago Machine, Rochester Rattlers , New York Lizards, Boston Cannons and Chesapeake BayHawks. He began playing during the 2001 season and last took the field during the 2015 campaign.\n\nClick on column headings to sort.\n\nScoring:\n\nPostseason - Scoring:"}, {"url": "https://www.masslive.com/highschoolsports/article/professional-lacrosse-player-matt-striebel-is-new-coach-of-northampton-high-school-boys-lacrosse-team/", "page_content": "NORTHAMPTON – Matt Striebel is a proven winner, something he’d like to instill in his new position as coach of the Northampton High School boys lacrosse team.\n\nThe 33-year-old Gill native was a two-time NCAA Division I men’s lacrosse national champion at Princeton University, a two-time World Lacrosse Championship gold medalist for Team USA and a three-time Major League Lacrosse champion with the Bridgeport/Philadelphia Barrage.\n\nHe also found time to play professional soccer for the Western Mass. Pioneers for a few years when it didn’t conflict with his MLL schedule.\n\n“I think the reason I’ve been as successful as I have is because of the little things and the details,” Striebel said Tuesday. “But I don’t talk to them a lot about what I do.”\n\nAs the Blue Devils move back to the Valley Wheel – with perennial powerhouses such as South Hadley, Minnechaug Regional and defending Western Massachusetts champion Longmeadow – after five years in the Valley League, it’s helpful to have a coach that has himself mixed it up with the best around.\n\nAfter starting as a youth at Indoor Action Sports in Greenfield, Striebel was a two-time honorable mention All-America at Princeton. His collegiate career, as part of arguably the nation’s best team in the late 1990s and early 2000s under coach Bill Tierney, ended with a victory over Syracuse in the 2001 title game. Striebel also played soccer for the Tigers.\n\nHe won three MLL titles in eight seasons with the Barrage, including the clinching goal against the Boston Cannons in 2004, and will return this spring for another season with the Rochester Rattlers.\n\n“I’m looking forward to it now more than ever,” Striebel said of his 12th MLL season. “Now that I’m coaching, I’m itching to get back out there playing.”\n\nStriebel’s coaching experience includes a stint as an assistant at his alma mater and with the club team at Iowa, from where he received his master’s degree. His coaching style borrows from all the coaches he’s had.\n\n“I’ve had the best coaches in lacrosse,” Striebel said. “The sincerest form of flattery is stealing things, copying things.”\n\nThe Blue Devils (6-12 last year) return one first-team All-Scholastic selection from last season, senior midfielder Colin Sawula. The team captain netted 23 goals and 16 assists a season ago.\n\nSawula and fellow senior captains Jay Messer, Andy Kuon and Justin Golec all see a major difference already in what their new coach has been able to get out of them.”\n\n“Compared to last year, it’s completely different,” said Sawula, who has had three coaches in four years. “We’re out there working hard every day. I’m pretty sure we’ve run more this year than we have last year. I have really high hopes for this season.”\n\nOne of those previous coaches, Bill Metzger, is back as an assistant, giving Northampton some continuity.\n\n“It’s definitely an experience,” Messer said. “We’re definitely prepared.”\n\nStriebel observed the Blue Devils several times last season and noticed a team that just needed a spark to get it to reach its full potential and to change the feeling of mediocrity that the players had.\n\n“I saw a team that could benefit from some coaching, some discipline and some plans,” Striebel said. “The biggest thing is getting over the sense of this (losing) is who we are.”\n\nThe Blue Devils are ready to respond.\n\n“He wants us to work hard, and we come out here every day to work hard,” Kuon said. “We’re determined.”"}, {"url": "https://trilogylacrosse.com/our-staff/matt-striebel/", "page_content": "“I play lacrosse because I love it—the speed, the intensity, the teamwork, the sense of fulfillment and satisfaction that comes when success is achieved over and through adversity. At Trilogy Lacrosse, we approach the teaching and coaching of lacrosse with the same passion and commitment to excellence that we bring to our play. Nowhere else can you find a community of lacrosse players and coaches so dedicated to the singular values of the game.”\n\nDuring his career Matt was among the most elite class of lacrosse players in the world. At his peak he was widely considered the best midfielder in the game. His unique combination of athleticism, versatility, and intelligence set him apart as a dynamic playmaker and offensive force. A champion at every level of the game, Matt set professional records in All Star appearances and games played, while compiling one of the most impressive statistical careers for a midfielder ever. His vast knowledge and passion for the game of lacrosse distinguish him as a Trilogy instructor. His energy is contagious and quickly picked up by his players. When not coaching lacrosse, Matt can be found playing pick-up basketball in high school gyms across America. He earned a BA in English from Princeton University and an MFA in Creative Writing from the University of Iowa.\n\nUS Lacrosse National Hall of Fame Class of 2019"}, {"url": "https://goprincetontigers.com/news/2010/7/14/204967910.aspx", "page_content": "Matt Striebel was a senior at Princeton when Ryan Boyle arrived from Baltimore as one of the most heralded recruits in Princeton men's lacrosse history. They played the same position, so Striebel went from attack to midfield for the 2001 season.\n\nTo say that it's worked out would be a gross understatement.\n\nBoyle and Striebel won an NCAA championship - while both earning All-America honors - in their one season together at Princeton, though that would be far from the last time they'd play together.\n\nThe two are still teammates all these years later, once again on the U.S. national team as it prepares for another chance at a World Championship. Striebel and Boyle will begin the 2010 championships in Manchester, England, this Friday with a game against Austraiia.\n\nIt will be the third time that Striebel and Boyle play together for the U.S., after helping the team to a championship in 2002 in Perth, Australia, and a runner-up finish to Canada in 2006 in London, Ont.\n\nThis time, the U.S. and Canada are again the favorites to meet in the final, which will take place on Saturday, July 24, at 11:30 a.m. Eastern time. The game will be televised live by ESPNU.\n\nThe 30-nation event is broken down into seven groups, with the top group (the Blue Division) to compete for the championship. The other groups are competiing for final placing and advancement in the next event, to be held in 2014 in Denver.\n\nThe U.S. and Canada are in the top group, along with Australia, Japan, the Iriquois nationals and the host English, though the Iriquois are caught in the middle of a diplomatic struggle because they are traveling on their native Haudenosaunee passports (which they have for decades) rather than U.S. or Canadian ones.\n\nPrinceton played the English team during its 2008 trip to Europe, winning two games by scores of 8-7 and 9-7.\n\nAs for Boyle and Striebel, their success hasn't been limited to Princeton and the World Championships. Together, they won three Major League Lacrosse championships in their five years as teammates on the Philadelphia Barrage as well.\n\nBoyle plays attack, while Striebel continues to be a midfielder. Inside Lacrosse, in fact, once had a cover story on Striebel in which it refered to him as the best midfielderin the world.\n\nThe U.S. team plays Canada on Saturday in pool play and then Iriquois, English and Japanese on consecutive days. The semifinals are on July 22, with the final on the 24th.\n\nWorld Lacrosse Championship schedule\n\nWorld Lacrosse Championship team rosters"}]}