{"Matt Striebel was drafted by the Philadelphia Barrage in the first round of the 2002 MLL draft.": [{"url": "https://premierlacrosseleague.com/articles/hall-of-fame-inductee-matt-striebel", "page_content": "A two-sport athlete at Princeton, Matt Striebel played lacrosse like a soccer player. In MLL offseasons, Striebel played three years of professional soccer from 2002-04 for the Western Massachusetts Pioneers of the USL Second Division.\n\n“His fitness level was just off the charts,” said former Philadelphia Barrage head coach Tony Resch. “He could keep going and going. He had great speed. He could shoot it. Unselfish. All the things you look for in a midfielder, he had it.”\n\nWhile Resch and most fans may remember Striebel as a lights-out shooter, that wasn’t always the case. Prior to his senior year at Princeton, Striebel was an X attackman. When freshman Ryan Boyle stepped on campus, Striebel was moved above GLE – where, Boyle jokes, his shot couldn’t break a paper bag.\n\n“He completely reinvented himself, starting with his senior year at Princeton moving from behind the cage out in front to midfield,” said Boyle, who also played with Striebel on the Philadelphia Barrage. “His dedication to his craft is truly remarkable. Going from somebody who didn’t really have much range to speak of at all to being somebody who you had to pick up at 16 yards… he was unguardable.”\n\nThat work ethic led to a 171-game career. Striebel evolved to earn playing time on the ‘04 Barrage midfield unit featuring Blake Miller (46G, 11A), Roy Colsey (25G, 6T, 7A), Mike Mollot (11G, 8A), and Doug Shanahan (12G, 6A).\n\nStriebel stuck the eventual game-winning goal in the ‘04 MLL Championship for that Barrage squad. He did the same in ‘07 on a broken powerplay – Boyle’s favorite shot of Striebel’s 15-year pro career."}, {"url": "https://www.usalaxmagazine.com/usa-insider/senior-men/hall-of-fame-call-a-final-victory-for-the-versatile-matt-striebel", "page_content": "Nine lacrosse legends — Ryan Boyle, Charlie Coker, Kara Ariza Cooke, Rachael Becker DeCecco, Sarah Forbes, Cathy Reese, Paul Schimoler, Richard Speckmann and Matt Striebel — will be inducted into the National Lacrosse Hall of Fame Oct. 19 at The Grand Lodge in Hunt Valley, Md. These are their stories.\n\nMatt Striebel was out to lunch with his wife and two kids, and then he saw his phone ring. He didn’t recognize the number, so he let it go straight to voicemail, as one does.\n\nThe message, he quickly realized, was from US Lacrosse. It was right around the annual giving time for the men’s national team, Striebel said, so he called back to let them know his check was ready to be sent out.\n\nBut on the other line was Rick Lake, men's game senior manager at US Lacrosse. His message was a tad different.\n\n“He goes, ‘Matt, we're actually calling you to let you know made the Hall of Fame,’” the Gill, Mass., native recalled. “It was an amazing moment that was made doubly better that I found out I was going in with Ryan (Boyle). As soon as I hung up that phone call, I called Ryan and was like, ‘This is crazy. Can you believe it?’ It was the perfect, poetic bookend to a journey of our playing careers.”\n\n\"We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?\" — Matt Striebel describing a meeting Bill Tierney his senior year.\n\nStriebel is one of nine set for the National Lacrosse Hall of Fame’s Class of 2019, entering with his close friend, Boyle — a fellow champion at Princeton, with the U.S. national team and in Major League Lacrosse. They now work together at Trilogy Lacrosse, the company Boyle co-founded, though their roots extend back to 2001 at Princeton.\n\nThe Tigers, then coached by fellow Hall of Fame member Bill Tierney, had Boyle entering as a blue-chip recruit down on attack. Striebel, a captain and returning All-American on attack, was excited by playing with a player of his quality. Plans went another direction, though.\n\n“We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?,’” said Striebel, who gave himself 24 hours to sulk before embracing his new role.\n\n“I decided it's my senior year, I really want to win and am here to win a national championship. From a lacrosse standpoint, it's the best thing that could have happened to me, because I am more of a midfielder talent-wise and it made us a better team and opened opportunities on the U.S. team and as a professional.”\n\nThat’s not hyperbole from Striebel, either. That 2001 season marked Striebel’s second national championship while at Princeton, as well as a fourth straight Ivy League championship. On the national stage, he captured gold at the World Lacrosse championships in 2002 (Perth) and 2010 (Manchester), plus silver in 2006 (Ontario).\n\nStriebel also secured three MLL championships (2004, ‘06, ‘07) with the Philadelphia Barrage, earning earning MLL All-Star honors on nine occasions. Boyle was right there at nearly every step.\n\n“I’m far happier for him than I am for myself,” Boyle said.\n\n\n\n\n\n\n\n\n\n\n\n“I often say there are some guys out there who are A-plus in a couple categories. Oh, he's an A-plus shooter or an A-plus dodger,” Striebel began. “For me, I think I just had the versatility to be B-plus, A-minus guy in a lot of different categories. That allowed me to change and adapt my game as I got older.\n\n“The first 10 years I was in the MLL, I think I took one two-point shot and it was on an open goal when we needed goal differential for the playoffs. Then as I got older, like a basketball player who's adding a different aspect, I became more of a shooter so I could develop other parts of my game and maintain relevance as a player.”\n\nBut like most great players, Striebel’s connection with the game didn’t cease once he put away the pads and cleats. He’s spent the last seven years coaching at Northampton High School in Massachusetts, plus working for Trilogy. He’s especially close with coaches in the Colonial Athletic Association, so he’ll often swing by nearby UMass-Amherst to catch games and chat with old friends.\n\nThose experiences also remind Striebel of his time at Hotchkiss, in Lakeville, Conn., during the mid-1990s. He said that was the “dawn of the post-graduate lacrosse era” at New England prep schools, where he played alongside several NHL draft picks.\n\n“You had kids who played multiple sports at a very high level,” Striebel said. “There were great athletes and for better or for worse, lacrosse has become a 365-day endeavor where kids have an opportunity to play every day.”"}, {"url": "https://www.statscrew.com/lacrosse/stats/p-striemat001", "page_content": "Matt Striebel\n\nMatt Striebel\n\nBorn: January 12, 1979\n\nIowa City, IA\n\nPosition: M\n\nHeight: 6'1\"\n\nWeight: 190\n\nCareer: 2001-2015\n\n\n\nMatt Striebel scored 225 goals and recorded 117 assists in his 167-game career with the Bridgeport Barrage, Philadelphia Wings, Philadelphia Barrage, Barrage, Chicago Machine, Rochester Rattlers , Boston Cannons, New York Lizards and Chesapeake BayHawks. He began playing during the 2001 season and last took the field during the 2015 campaign.\n\nClick on column headings to sort.\n\nScoring:\n\nPostseason - Scoring:"}, {"url": "https://www.oursportscentral.com/services/releases/striebel-named-offensive-player-of-the-week/n-3521353", "page_content": "Striebel Named Offensive Player of the Week\n\nAugust 7, 2007 - Major League Lacrosse (MLL) - Philadelphia Barrage News Release\n\n\n\n\n\n\n\nPhiladelphia, PA (August 7, 2007) - The 2006 Major League Lacrosse Champions, the Philadelphia Barrage, announced today that midfielder Matt Striebel received the MLL's Offensive Player of the Week award for the week ending on August 5. Striebel led the Barrage with five points, on four goals and one assist, in a 21-11 victory over the Washington Bayhawks on Saturday evening to clinch a playoff spot for Philadelphia. It is the first time since 2002 that any MLL defending champ has qualified for the postseason the following year.\n\nIn his seventh year with the Barrage, Striebel currently ranks third on the team with 35 points, scoring 22 goals and adding 12 assists on the season. He also ranks fourth in the league among midfielders in scoring. His five-point performance on Saturday against Washington earned him Bud Light Game MVP honors.\n\nThe Barrage will conclude the season with a final home game against the Washington Bayhawks at United Sports Training Center in Downingtown, Pa., on Saturday, August 11. Face off is at 7 p.m. at USTC. Individual tickets are available by calling the Barrage ticket office at 610-355-8999 or visiting www.philadelphiabarrage.com.\n\n• Discuss this story on the Major League Lacrosse message board...\n\n\n\n\n\nMajor League Lacrosse Stories from August 7, 2007\n\nStriebel Named Offensive Player of the Week - Philadelphia Barrage\n\nThe opinions expressed in this release are those of the organization issuing it, and do not necessarily reflect the thoughts or opinions of OurSports Central or its staff."}, {"url": "https://goprincetontigers.com/news/2007/8/26/1178196.aspx", "page_content": "Ryan Boyle '04 started the Philadelphia Barrage in the right direction. Matt Striebel '01 made sure they arrived at their destination, a place he and Boyle had already been together many times before.\n\nBoyle scored the first goal of the game en route to a four-point afternoon and Striebel scored all three of his goals in the fourth quarter to lead the Barrage to a 16-13 win over the Los Angeles Riptide in the Major League Lacrosse championship game Sunday afternoon at PaeTec Park in Rochester. Striebel, who also had three assists on the day, was named the Most Valuable Player.\n\nBoyle finished with two goals and two assists in the title game for the Barrage, who became the first repeat champion in MLL history. The Barrage have now won three of the last four MLL championships, and Boyle and Striebel have now been teammates on Princeton's 2001 NCAA championship team, the United States 2002 World Championship team and the three Barrage championship teams. Striebel also was on the 1998 Princeton NCAA champion.\n\nThis most recent championship for the two did not come easily. The teams were even at 11-11 entering the fourth quarter, and Brown alum Chazz Woodson made it 12-11 Riptide with his second goal of the game and fifth of the playoff weekend with 4:39 gone in the fourth. Striebel, though, completely took over the game from there.\n\nFirst he evened the game 47 seconds after Woodson scored after a long run down the middle, and then, after the teams traded goals to make it 13-13, he scored what proved to be the game-winner on a lefthanded shot in traffic with 5:42 to play. His third goal, a rocket on a feed from Boyle from behind the net, made it a two-goal cushion with 2:02 to play. Jed Prossner sealed it with a goal with 1:06 left.\n\nThe Barrage reached the final with a 13-12 overtime win over the Denver Outlaws on Syracuse grad Roy Colsey's goal Saturday afternoon in the first semifinal, while the Riptide knocked off the Rochester Rattlers 15-14 in the other.\n\nBoyle was shut out for the first three quarters of the semifinal, but he helped rally the Barrage from a 12-9 deficit with a goal and two assists in the fourth quarter, including an assist on a goal by Lehigh head coach Kevin Cassese with 59 seconds left to force OT. Striebel had two goals and an assist in the semifinal.\n\nJosh Sims '00 had two goals and an assist for Denver in the game, while Trevor Tierney '01 made 19 saves for the Outlaws."}, {"url": "https://trilogylacrosse.com/our-staff/matt-striebel/", "page_content": "“I play lacrosse because I love it—the speed, the intensity, the teamwork, the sense of fulfillment and satisfaction that comes when success is achieved over and through adversity. At Trilogy Lacrosse, we approach the teaching and coaching of lacrosse with the same passion and commitment to excellence that we bring to our play. Nowhere else can you find a community of lacrosse players and coaches so dedicated to the singular values of the game.”\n\nDuring his career Matt was among the most elite class of lacrosse players in the world. At his peak he was widely considered the best midfielder in the game. His unique combination of athleticism, versatility, and intelligence set him apart as a dynamic playmaker and offensive force. A champion at every level of the game, Matt set professional records in All Star appearances and games played, while compiling one of the most impressive statistical careers for a midfielder ever. His vast knowledge and passion for the game of lacrosse distinguish him as a Trilogy instructor. His energy is contagious and quickly picked up by his players. When not coaching lacrosse, Matt can be found playing pick-up basketball in high school gyms across America. He earned a BA in English from Princeton University and an MFA in Creative Writing from the University of Iowa.\n\nUS Lacrosse National Hall of Fame Class of 2019"}, {"url": "https://peoplepill.com/people/matt-striebel/", "page_content": "Matt Striebel (born January 12, 1979) is a high school lacrosse coach at Northampton High School and a professional lacrosse midfielder who plays professional field lacrosse in the Major League Lacrosse (MLL) for the New York Lizards and formerly played professional box lacrosse in the National Lacrosse League (NLL). He starred as a member of the Princeton Tigers men's lacrosse team from 1998 through 2001 and the Princeton Tigers men's soccer team from 1997 through 2000.\n\nDuring his time at Princeton, the team qualified for the NCAA Men's Lacrosse Championship all four years, reached the championship game three times, won the championship game twice and won four Ivy League championships. He was a two-time honorable mention United States Intercollegiate Lacrosse Association (USILA) All-American and three-time All-Ivy League selection (once first team, twice second team). He was also an All-Ivy league performer in soccer and earned Princeton co-athlete of the year (all-sport) honors as a senior.\n\nAs a professional, he has earned three MLL championships, a league record eight MLL All-Star recognitions and an MLL championship game MVP award. He is also a three-time Team USA representative and two-time World Lacrosse Championship gold medalist.\n\nBackground\n\nStriebel is a native of Gill, Massachusetts. He first got involved in lacrosse at about the age of 12 or 13 when his sister brought home the Brine Lightning stick that he began to play with. Striebel attended The Hotchkiss School in Lakeville, Connecticut. Striebel first started playing lacrosse when he was a youth for Jeff Coulson, owner of Indoor Action Sports, in Greenfield, Massachusetts.\n\nHe also attended the Writers Workshop at The University of Iowa in Iowa City, Iowa, earning a Master of Fine Arts degree in 2007. He had earned a Bachelor of Arts degree in English at Princeton.\n\nCollege career\n\nAt Princeton he was a two-time honorable mention USILA All-American Team selection in 2000 and 2001. He was a second team All-Ivy League selection in 1999 and 2000 and a first team selection in 2001. He was a 2001 USILA Scholar All-American. During his four-year career, Princeton went undefeated in Ivy League Conference play with consecutive 6–0 records. Princeton was invited to the 1999 tournament, was a finalist in the 2000 tournament and earned championships in both the 1998 and 2001 tournaments, bringing the schools consecutive tournament invitations streak to twelve. In Striebel's 2001 senior season, the arrival of freshman Ryan Boyle necessitated that he move from attack to midfield. The move came the first practice after Princeton's 14–8 loss to Syracuse. Striebel had previously been orchestrating the Princeton offense from behind the goal, but on March 25, 2001, head coach Bill Tierney made the switch. During the 1998 season when Princeton won the NCAA title, Striebel had been playing midfield. Princeton went undefeated for the rest of the 2001 season after the switch.\n\nDuring the 2000 NCAA tournament, Striebel scored two goals in the quarterfinals 10–7 victory against Maryland, and he added another in the 13–7 championship game loss to Syracuse. Striebel was one of the leading scorers on the team that season, and he was the team leader in assists entering the final four weekend. In the quarterfinals of the 2001 NCAA championship tournament, Striebel had an assist in the 8–7 victory over Loyola. In the 12–11 semifinal victory over Towson State, Striebel had a goal and an assist. Striebel scored twice in the 2001 championship game and also added two assists. He was selected to the All-tournament team.\n\nStriebel was also an honorable mention All-Ivy League soccer player in 2000 as well as a 2000 Academic All-Ivy selection in soccer. As a junior, Striebel was a member of the 1999 Ivy League Champion Princeton Soccer team that earned an invitation to the 1999 NCAA Men's Division I Soccer Championship. The team posted a 10–5–2 (5–1–1 Ivy League) record.\n\nAs of 2010, Striebel ranks eighth on the Princeton Lacrosse career assists list and eleventh on the Princeton soccer career assists list. As a senior, he was honored as one of the three athletes of the year on campus (along with Dennis Norman and Scott Denbo)\n\nProfessional career\n\nStriebel began his career in the league's inaugural 2001 MLL season with the Bridgeport Barrage and stayed with the team as it remained in Bridgeport, Connecticut until the 2003 season. Then he moved with the franchise and played with the Philadelphia Barrage from 2004 through 2008. In 2009 MLL season, he joined the Chicago Machine and then became a member of the Rochester Rattlers for the 2011 MLL season. Striebel and Boyle were reunited for five seasons in Philadelphia. Striebel has helped the Barrage to win three Steinfeld Cup championships in 2004, 2006, and 2007. In the 2004 championship game, he scored what the Baltimore Sun described as the clinching goal in the 13–11 victory over the Boston Cannons. In the 2006 game, he had nine points (four goals, including one two-pointer and four assists). He was presented with the 2007 Steinfeld Cup Game Most Valuable Player Award. Striebel appeared in the 2005 & 2007 Major League Lacrosse All-Star Games. In the 2006 All-Star game he represented Team USA by scoring a goal and two assists. Striebel was an MLL All-Pro selection in 2007 and 2008. Striebel was an MLL All-Star in 2011. In 2012, Striebel set the MLL record for most All-Star games with eight (consecutive).\n\nStriebel served as an assistant coach for Princeton Men's Lacrosse in 2005. Striebel also spent time assisting the men's lacrosse team at Iowa during his time there. As of 12 April 2012, Striebel currently coaches the Varsity Boys Lacrosse team at Northampton High School in Northampton, MA which is just south of his hometown. He also played professionally in 2012 and 2013.\n\nIn addition to his field lacrosse career, Striebel played one season in 2003 of box lacrosse with the Philadelphia Wings in the National Lacrosse League. Streibel was traded by the Wings to the New York Saints in February 2003. He never appeared in a game for the Saints. Striebel has also played professional soccer for the Western Massachusetts Pioneers.\n\nStriebel has represented Team USA in the World Lacrosse Championship in 2002, 2006, and 2010. In the 2002 World Lacrosse Championship semifinal match against the Iroquois Nation, Striebel scored a goal in the 18–8 victory. Striebel also serves as a representative of Trilogy Lacrosse.\n\nOn November 11, 2013, Striebel was traded to the New York Lizards.\n\nStatistics\n\nMLL\n\nRegular Season Playoffs Season Team GP G 2ptG A Pts LB PIM GP G 2ptG A Pts LB PIM 2001 Bridgeport 8 4 0 8 12 10 0 -- -- -- -- -- -- -- 2002 Bridgeport 9 10 0 5 15 22 0 2 2 0 1 3 4 0 2003 Bridgeport 12 16 0 2 18 19 0 -- -- -- -- -- -- -- 2004 Philadelphia 12 15 0 12 27 14 0.5 2 2 0 1 3 4 0 2005 Philadelphia 12 22 0 13 35 25 0.5 -- -- -- -- -- -- -- 2006 Philadelphia 11 23 0 12 35 29 0 2 9 1 5 15 2 0 2007 Philadelphia 12 25 1 13 39 22 0 2 5 0 4 9 4 0 2008 Philadelphia 12 31 0 11 42 21 0 1 2 0 0 2 1 0 2009 Chicago 12 13 1 8 22 18 1.5 -- -- -- -- -- -- -- 2010 Chicago 10 12 0 5 17 14 0 -- -- -- -- -- -- -- 2011 Rochester 12 13 4 8 25 16 3.0 -- -- -- -- -- -- -- 2012 Rochester 14 14 8 10 32 13 0.5 -- -- -- -- -- -- -- MLL Totals 122 184 6 97 287 210 2.5 7 18 1 10 29 11 0\n\nPrinceton University"}, {"url": "https://www.gazettenet.com/Matt-Striebel-will-be-inducted-into-National-Lacrosse-Hall-of-Fame-29390368", "page_content": "Lacrosse began as a hobby for Matt Striebel.\n\nHis sister, Jessica, played first and brought her stick home. He was a baseball fan and dreamed of becoming a major leaguer.\n\n“Like every kid in America,” the Northampton resident said.\n\nIntrigued, the Gill native started playing as a teenager for the Franklin County Lacrosse Club for Jeff Coulson, who now owns Indoor Action Sports in Greenfield.\n\n“Growing up here in western Mass., and I grew up in Gill, which was obviously not a hotbed of lacrosse at the time or really now. It’s such a dynamic combination of other sports you’re familiar growing up with,” Striebel said. “You get the best of all those worlds combined in one Frankenstein sport. For a lot of kids, and I see this all the time at camps, it just grabs you, and once it does you’re hooked for life.”\n\nLacrosse became Striebel’s passion and profession. He won championships at every level and worked to spread the spark lacrosse ignited in him. On Saturday, Striebel, 40, will earn one of the sport’s highest honors with his induction to the National Lacrosse Hall of Fame.\n\n“At a certain point, I’d had a career that was solid enough and significant enough that I had a pretty good idea that I would one day make it to the Hall of Fame. The part that was surprising to me was how quickly I got that call,” Striebel said. “It was a validating honor. It puts your career in a nice, cohesive narrative.”\n\nHe’ll be inducted as part of a nine-member class at the The Grand Lodge in Hunt Valley, Maryland, just outside Baltimore.\n\n“It’s increasingly starting to set in. There’s some behind the scenes getting tickets for people and organizing all that stuff that makes it seem like it’s more in the real world and less something that’s really special and exists as the culmination of a career,” Striebel said. “It’s sitting in a space that’s between about to be real and pretty fantastic.”\n\nStriebel received the call while out to lunch with his family at Green Bean in Northampton. It came from a Philadelphia number he didn’t recognize, so he let it go to voice mail. Rick Lake, the men’s lacrosse director of USA Lacrosse, was on the other end of the call.\n\n“My immediate assumption was they were calling because the annual giving campaigns had started up,” Striebel said. “As a veteran of three U.S. teams, they look to me to give donations every once in a while and I assumed that’s what it was.”\n\nInstead, he found out he was being inducted alongside one of his longtime teammates and best friends Ryan Boyle. Boyle was a freshman at Princeton during Striebel’s senior year in 2001. They both played attack, but Boyle took all of the repetitions during fall practices since Striebel also played soccer for the Tigers.\n\nAs a returning All-American and team captain, Striebel tried to coexist with the freshman.\n\n“It was pretty apparent that Ryan was just better at it than I was, even as a freshman,” said Striebel, who attended The Hotchkiss School before Princeton. “The coaches brought me into their office and said, ‘Striebs you had a great run, we’re going to move you to midfield.’ For about 48 hours, I hated Ryan.”\n\nBut he realized that if the team was going to compete for a title, that would give the Tigers the best chance. Princeton won the national championship for the second time in Striebel’s career.\n\nStriebel began his professional career the next season during the inaugural season of Major League Lacrosse. He played for the Bridgeport Barrage, and three years later after the franchise relocated to Philadelphia, they asked Striebel if Boyle was worth a first-round draft pick.\n\n“I said he was and it would make our team better instantly,” Striebel said.\n\nThe Barrage won the MLL title, one of three in Striebel’s 15-year career. He and Boyle also played together for the USA on three World Lacrosse Championship teams.\n\nBoyle started a company called Trinity Lacrosse in 2005 and brought Striebel on as the program’s national director, which is his full-time job. They run camps and events all over the country.\n\n“The fact that I was able to go in with Ryan, that’s such a poetic bookend to our career and our friendship in the sport,” Striebel said.\n\nStriebel was first called up to the U.S. national team in 2002, less than a year after the September 11 terrorist attacks. The Americans took gold in Perth, Australia.\n\n“To be able to put on a jersey and represent your country playing a sport you love, there aren’t many honors that are more fulfilling than that,” Striebel said.\n\nHe enjoyed teaming up with other elite players in a competitive setting. Unlike All-star games, which Striebel played in eight times, the world championships provided a goal to achieve rather than an exhibition.\n\nWhen the U.S. lost the 2006 final – the first time they hadn’t won gold since 1978 – Striebel and his team left their medals in the dormitories in Ontario.\n\n“It was a really difficult loss to stomach,” he said.\n\nStriebel and the USA redeemed themselves in 2010 in England with the nation’s ninth gold medal.\n\n“I’ve been fortunate enough to win a lot of incredible championships in my career, and those USA championships are definitely up there,” Striebel said. “I’ve had a fortunate career.”\n\nHe recognizes that fortune and works to give others the same opportunity. Striebel coached Northampton High School for seven years before stepping down following the 2018 season.\n\n“I’ve been fortunate enough to go all over the country and around the world spreading the gospel of lacrosse and sharing the sport with people who care about it,” Striebel said. “It has a strong fraternity of followers. It’s been amazing to see that expand to include so many people and so many places.”\n\nTrilogy partners with organizations like Harlem Lacrosse to bring the game to areas and environments that haven’t historically played it.\n\n“For many years it’s been a predominantly white, wealthy, preppy sport, and that’s not sustainable and that’s not the best version of lacrosse that’s going to exist,” Striebel said. “When the sport is available to kids all across the country whether you’re living in an inner city neighborhood or Fairfield County, Connecticut, that’s when the sport is really going to have achieved its peak.”"}, {"url": "https://www.usalaxmagazine.com/pro/mll/as-mll-heads-to-california-remembering-the-riptide-years", "page_content": "On Saturday, July 8, the best players in Major League Lacrosse travel to California for the league’s All-Star game. It’s the second consecutive year the Golden State will host the game.\n\nWhile MLL in California is currently a special occasion, it used to be a staple. From 2006 to 2008 the league had two teams based in California: the San Francisco Dragons and the Los Angeles Riptide. Despite the franchise’s absence, the Riptide, in particular, is remembered fondly.\n\n“I’m grateful for all the great players we had,” said former Riptide head coach John Tucker, who is now an assistant coach with the Boston Cannons. “The way I was treated and everybody on the team was first class. I couldn’t be happier with that result of what we did. It was a great time in my life.”\n\nThe Riptide was owned by the Anschutz Entertainment Group, who also owns the Los Angeles Galaxy of Major League Soccer and half of the National Hockey League’s Los Angeles Kings.\n\nLos Angeles was one of four expansion teams in 2006, joining the Dragons, Denver Outlaws, and Chicago Machine, all part of the new Western Conference.\n\nLongtime lacrosse figure G.W. Mix was named the president and general manager, and he was responsible for bringing Tucker on board despite the coach not following the pro league. Tucker admitted he thought putting a team in California was a challenge, but he was open to the opportunity.\n\n“It was new for everyone,” Tucker said. “We saw ourselves as pioneers in certain respects. We didn’t know what to expect in terms of crowd or acceptance from the community. Once we were out there practicing and meeting the local people, we found out there was a larger community that supported the game. There were a lot of transplants from the East Coast that rallied around the team. We had really solid crowds.”\n\nI’d bring my gear in New York to the subway, then hop a flight Friday afternoon to Los Angeles. To catch the sunset in L.A. at practice was a great time, for sure.\n\nIn the mid-2000s, most of the players were still based in the northeast, which made every game, even a home game, an away game for the players. That commonality, however, helped create a strong bond between the players.\n\n“I was working in New York City at the time, so I’d be traveling,” said Greg Downing, a former Riptide midfielder currently playing for the Denver Outlaws. “I’d bring my gear in New York to the subway, then hop a flight Friday afternoon to Los Angeles. To catch the sunset in L.A. at practice was a great time, for sure.”\n\nFormer Riptide defender and current Cannon Mitch Belisle added how getting to see his teammates made the trip worthwhile.\n\n“My favorite memory is I was working in New York my first year and the second year I got laid off and left finance and knew I didn’t want to do that,” he said. “I moved out to L.A. and drove out with (teammate) Wes Green part of the way. I met the team in Denver for a game. That was the first game of the season. I drove out there, played and drove out to California. That whole experience of driving out there, meeting with the team, it was exciting.”\n\nThe bond between Riptide teammates – Downing and Belisle were the team’s first two picks in the 2007 collegiate draft, respectively – made playing for the Riptide a special experience and set the tone for young players to reciprocate down the line.\n\n“We had excellent veteran leadership,” said Downing. “They were great about incorporating everyone. It was a complete team effort and a lot of that stemmed from the older guys: Michael Watson, Jesse Hubbard, a ton of guys that really were great veteran leaders. That’s something I try to take from my days there. It goes a long way to develop a team. College, you’re with each other every day. You can’t help but develop good team chemistry, but only meeting on the weekends… it can be hard to develop team chemistry. Veteran leadership makes it a better experience for everyone.”\n\nBelisle added those relationships carry on today.\n\n“I have an old Riptide sweatshirt,” he said, “and every time I post a picture of it on Instagram, (former teammates) Greg Bice and Anthony Kelly comment on it.”\n\n\n\n\n\n\n\n\n\n\n\nOn the field, the team was successful.\n\nThe team’s worst record came in its first season, going 6-6 but missing the playoffs. The team had records better than .500 the following two seasons, making the playoffs both years.\n\nThe highlight came in 2007, when the team had a franchise-best record of 9-3, finished in first in the Western Conference, and reached the MLL Championship game, losing to the Philadelphia Barrage, 16-13.\n\n“I was just talking to Ryan Boyle and Matt Striebel, who were on the Barrage, who we lost to in the championship,” Belisle said “We were talking about how we were down by one and got a bogus penalty. They scored with the flag down, and Matt Striebel scored again on the man-up.”\n\nAlthough the team’s final season was nine years ago, a look at the roster shows many familiar faces. Members of the 2008 Los Angeles Riptide team include a number of players still playing in the league today: Downing, Belisle, Kevin Buchanan (Boston), Kyle Harrison (Ohio), Anthony Kelly (Atlanta), and Chazz Woodson (Florida). Tucker still coaches in the league, and Spencer Ford, a midfielder for the Riptide, is now the general manager of the Atlanta Blaze.\n\nWhile no one knew how the careers of those players would go, Tucker said he wasn’t surprised by their longevity and admitted the team’s success was partially because of the dedication of those players.\n\n“It just had to do with the research G.W. Mix and I did to find guys committed to the game,” he said. “We really made it a point to find those guys that were lacrosse rats and got them to be part of our roster. It wasn’t easy to fly out on Friday for a four or five-hour flight to L.A. and fly them home. Spencer was a guy we traded for because we knew he wanted to make his life in the game. It was, in some ways, easy. We didn’t have a large pool of talent out west at the time. We could probably do that now, easily. Overall, that was our biggest accomplishment, that we picked the right people to be a part of it.”\n\nThe team fared relatively well at the gate as well.\n\nLos Angeles finished in the top half of attendance in the league each season, never more than 870 people fewer than the league average per game. The team’s best year came in its first, finishing third in the league in average attendance per game with 4,198 fans, only 97 fewer than the league average.\n\n“It was neat to see (the fans) embrace our players,” Tucker said. “By the end of the journey, they really got into it. There was consistent attendance. They were impressed by the athleticism. It was cool to see the connections some of the young kids made with our players.”\n\nThe Riptide finished the 2008 regular season with a loss to the Dragons, then lost to the Outlaws in the playoffs. There would be no bounce-back or chance at redemption, however, as four teams – the Riptide, Dragons, Barrage and New Jersey Pride – all folded prior to the 2009 season. Additionally, the ownership group in Rochester folded, and the players and coaching staff were all moved to Toronto to play for a new team, the Nationals."}, {"url": "https://www.wikiwand.com/en/Matt_Striebel", "page_content": "Matt Striebel (born January 12, 1979) is a former professional lacrosse midfielder who played professional field lacrosse in the Major League Lacrosse (MLL) for the New York Lizards and formerly played professional box lacrosse in the National Lacrosse League (NLL). He starred as a member of the Princeton Tigers men's lacrosse team from 1998 through 2001 and the Princeton Tigers men's soccer team from 1997 through 2000.\n\nAmerican lacrosse player (born 1979)\n\nQuick facts: Born, Nationality, Height, Weight, Position... ▼\n\nDuring his time at Princeton, the team qualified for the NCAA Men's Lacrosse Championship all four years, reached the championship game three times, won the championship game twice and won four Ivy League championships. He was a two-time honorable mention United States Intercollegiate Lacrosse Association (USILA) All-American and three-time All-Ivy League selection (once first team, twice second team). He was also an All-Ivy league performer in soccer and earned Princeton co-athlete of the year (all-sport) honors as a senior.\n\nAs a professional, he has earned three MLL championships, a league record eight MLL All-Star recognitions and an MLL championship game MVP award. He is also a three-time Team USA representative and two-time World Lacrosse Championship gold medalist.\n\nIn 2019, Striebel was elected to the National Lacrosse Hall of Fame.[1]"}], "Matt Striebel played for the Philadelphia Barrage until the team folded in 2008.": [{"url": "https://premierlacrosseleague.com/articles/hall-of-fame-inductee-matt-striebel", "page_content": "A two-sport athlete at Princeton, Matt Striebel played lacrosse like a soccer player. In MLL offseasons, Striebel played three years of professional soccer from 2002-04 for the Western Massachusetts Pioneers of the USL Second Division.\n\n“His fitness level was just off the charts,” said former Philadelphia Barrage head coach Tony Resch. “He could keep going and going. He had great speed. He could shoot it. Unselfish. All the things you look for in a midfielder, he had it.”\n\nWhile Resch and most fans may remember Striebel as a lights-out shooter, that wasn’t always the case. Prior to his senior year at Princeton, Striebel was an X attackman. When freshman Ryan Boyle stepped on campus, Striebel was moved above GLE – where, Boyle jokes, his shot couldn’t break a paper bag.\n\n“He completely reinvented himself, starting with his senior year at Princeton moving from behind the cage out in front to midfield,” said Boyle, who also played with Striebel on the Philadelphia Barrage. “His dedication to his craft is truly remarkable. Going from somebody who didn’t really have much range to speak of at all to being somebody who you had to pick up at 16 yards… he was unguardable.”\n\nThat work ethic led to a 171-game career. Striebel evolved to earn playing time on the ‘04 Barrage midfield unit featuring Blake Miller (46G, 11A), Roy Colsey (25G, 6T, 7A), Mike Mollot (11G, 8A), and Doug Shanahan (12G, 6A).\n\nStriebel stuck the eventual game-winning goal in the ‘04 MLL Championship for that Barrage squad. He did the same in ‘07 on a broken powerplay – Boyle’s favorite shot of Striebel’s 15-year pro career."}, {"url": "https://www.statscrew.com/lacrosse/stats/p-striemat001", "page_content": "Matt Striebel\n\nMatt Striebel\n\nBorn: January 12, 1979\n\nIowa City, IA\n\nPosition: M\n\nHeight: 6'1\"\n\nWeight: 190\n\nCareer: 2001-2015\n\n\n\nMatt Striebel scored 225 goals and recorded 117 assists in his 167-game career with the Bridgeport Barrage, Philadelphia Wings, Philadelphia Barrage, Barrage, Chicago Machine, Rochester Rattlers , Boston Cannons, New York Lizards and Chesapeake BayHawks. He began playing during the 2001 season and last took the field during the 2015 campaign.\n\nClick on column headings to sort.\n\nScoring:\n\nPostseason - Scoring:"}, {"url": "https://www.usalaxmagazine.com/usa-insider/senior-men/hall-of-fame-call-a-final-victory-for-the-versatile-matt-striebel", "page_content": "Nine lacrosse legends — Ryan Boyle, Charlie Coker, Kara Ariza Cooke, Rachael Becker DeCecco, Sarah Forbes, Cathy Reese, Paul Schimoler, Richard Speckmann and Matt Striebel — will be inducted into the National Lacrosse Hall of Fame Oct. 19 at The Grand Lodge in Hunt Valley, Md. These are their stories.\n\nMatt Striebel was out to lunch with his wife and two kids, and then he saw his phone ring. He didn’t recognize the number, so he let it go straight to voicemail, as one does.\n\nThe message, he quickly realized, was from US Lacrosse. It was right around the annual giving time for the men’s national team, Striebel said, so he called back to let them know his check was ready to be sent out.\n\nBut on the other line was Rick Lake, men's game senior manager at US Lacrosse. His message was a tad different.\n\n“He goes, ‘Matt, we're actually calling you to let you know made the Hall of Fame,’” the Gill, Mass., native recalled. “It was an amazing moment that was made doubly better that I found out I was going in with Ryan (Boyle). As soon as I hung up that phone call, I called Ryan and was like, ‘This is crazy. Can you believe it?’ It was the perfect, poetic bookend to a journey of our playing careers.”\n\n\"We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?\" — Matt Striebel describing a meeting Bill Tierney his senior year.\n\nStriebel is one of nine set for the National Lacrosse Hall of Fame’s Class of 2019, entering with his close friend, Boyle — a fellow champion at Princeton, with the U.S. national team and in Major League Lacrosse. They now work together at Trilogy Lacrosse, the company Boyle co-founded, though their roots extend back to 2001 at Princeton.\n\nThe Tigers, then coached by fellow Hall of Fame member Bill Tierney, had Boyle entering as a blue-chip recruit down on attack. Striebel, a captain and returning All-American on attack, was excited by playing with a player of his quality. Plans went another direction, though.\n\n“We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?,’” said Striebel, who gave himself 24 hours to sulk before embracing his new role.\n\n“I decided it's my senior year, I really want to win and am here to win a national championship. From a lacrosse standpoint, it's the best thing that could have happened to me, because I am more of a midfielder talent-wise and it made us a better team and opened opportunities on the U.S. team and as a professional.”\n\nThat’s not hyperbole from Striebel, either. That 2001 season marked Striebel’s second national championship while at Princeton, as well as a fourth straight Ivy League championship. On the national stage, he captured gold at the World Lacrosse championships in 2002 (Perth) and 2010 (Manchester), plus silver in 2006 (Ontario).\n\nStriebel also secured three MLL championships (2004, ‘06, ‘07) with the Philadelphia Barrage, earning earning MLL All-Star honors on nine occasions. Boyle was right there at nearly every step.\n\n“I’m far happier for him than I am for myself,” Boyle said.\n\n\n\n\n\n\n\n\n\n\n\n“I often say there are some guys out there who are A-plus in a couple categories. Oh, he's an A-plus shooter or an A-plus dodger,” Striebel began. “For me, I think I just had the versatility to be B-plus, A-minus guy in a lot of different categories. That allowed me to change and adapt my game as I got older.\n\n“The first 10 years I was in the MLL, I think I took one two-point shot and it was on an open goal when we needed goal differential for the playoffs. Then as I got older, like a basketball player who's adding a different aspect, I became more of a shooter so I could develop other parts of my game and maintain relevance as a player.”\n\nBut like most great players, Striebel’s connection with the game didn’t cease once he put away the pads and cleats. He’s spent the last seven years coaching at Northampton High School in Massachusetts, plus working for Trilogy. He’s especially close with coaches in the Colonial Athletic Association, so he’ll often swing by nearby UMass-Amherst to catch games and chat with old friends.\n\nThose experiences also remind Striebel of his time at Hotchkiss, in Lakeville, Conn., during the mid-1990s. He said that was the “dawn of the post-graduate lacrosse era” at New England prep schools, where he played alongside several NHL draft picks.\n\n“You had kids who played multiple sports at a very high level,” Striebel said. “There were great athletes and for better or for worse, lacrosse has become a 365-day endeavor where kids have an opportunity to play every day.”"}, {"url": "https://phillylacrosse.com/2009/top-stories-of-2008-no-14-barrarge-made-a-run-for-mll-crown-despite-being-homeless/", "page_content": "By Chris Goldberg\n\nPhillylacrosse.com, Posted 1/8/09\n\nThe Philadelphia Barrage were homeless in 2008. But it did not stop them from making another run at a Major League Lacrosse (MLL) championship.\n\nBecause the team’s ownership was taken over by the league, Philadelphia had no home games. But the two-time defending league champions still reached the MLL semifinals before bowing to the eventual champion Rochester Rattlers, 16-15, in a brilliant overtime game at Harvard Stadium.\n\nRattlers attackman Casey Powell scored the game-winning goal just 45 seconds into overtime to give Rochester its first-ever play-off victory. Meanwhile, the loss marked the first-ever postseason loss for the Barrage, who had won six straight playoff games prior to this year.\n\nFor the Barrage, midfielder Matt Striebel (31 goals) and defender Kyle Sweeney(Springfield-Delco) were named to the All-MLL team. Striebel ranked second on the Barrage in scoring with 42 points, scoring a career-best 31 goals with 11 assists. He ranked third among midfielders in both categories. Striebel and Sweeney also were named to represent the Barrage in the MLL All-Star Game.\n\nThere were many other players who made major contributions, including goalie Brian Dougherty (Episcopal Academy), defendersBrett Moyer (Ridley) and Brian Spalina, attackers Ryan Boyle (21 goals, 22 assists), Seth Goldberg (29 goals), Michael Springer (21 goals) and Peter Trombino (15 goals) and midfielders Ray Colsey (13 goals), Justin Smith (14 goals), Andrew Corno and Matt Zash.\n\nDougherty, who later in the year was inducted into the University of Maryland Hall of Fame, won back-to-back Goalkeeper of the Week awards in July. Then, later in the month when Dougherty was out with an illness, backrup Kevin Keenan(Springfield-Delco) excelled in a victory over the Boston Cannons and eanred the Goalkeeper of the Week award.\n\nBarrage fourth-year coach Tony Resch also enjoyed a banner year. He was named the 2008 Brine MLL Coach of the Year and was an assistant in the MLL All-Star Game.\n\nResch, who also won the Brine award in 2006 when he led the Barrage to their first of two titles, became the second coach in MLL history to be named as the Coach of the Year twice.\n\nAlso in 2008, Resch was inducted in the Philadelphia Wings Hall of Fame, was named an assistant for the U.S. National Team and served as an assistant coach at La Salle – thePennsylvania state high school champion.\n\nResch, also the athletic director and assistant coach at La Salle High, has a 30-18 regular-season record in four seasons.\n\nElsewhere in the MLL, rookie coach Tom Slate (Springfield-Delco), a former Barrage assistant, took over atSan Francisco and finished strong following a slow start.\n\nThe Dragons won three of their final five games after a 1-6 start and relied heavily on a host of Philly grads, including midfielder Bill McGlone (Ridley), midfielder Greg Gurenlian (Springfield-Delco), midfielder Ryan Cranston (Henderson), midfielder Mike Podgajny (Ridley), attacker Xander Ritz (Radnor), defender Steve Holmes (Germantown Academy), midfielder Todd Fairlie (Marple Newtown, Widener) and midfielder Matt Ogelsby (Haverford School).\n\nGuerenlian had a memorable performance in July. He was named Defender of the Week by the MLL in a 21-20 victory over the Long Island Lizards as he won 31 of 41 face-offs and nearly tied an MLL record for groundballs with 22. He also had a goal and three assists.\n\nIn Boston, attacker John Christmas (Lower Merion) had his day in the sun. He earned game MVP honors with his game-winning goal with just five seconds left on the clock as the Cannons defeated the Lizards, 13-12, in front of 9,178 fans at Harvard Stadium on a July evening."}, {"url": "https://goprincetontigers.com/news/2007/8/26/1178196.aspx", "page_content": "Ryan Boyle '04 started the Philadelphia Barrage in the right direction. Matt Striebel '01 made sure they arrived at their destination, a place he and Boyle had already been together many times before.\n\nBoyle scored the first goal of the game en route to a four-point afternoon and Striebel scored all three of his goals in the fourth quarter to lead the Barrage to a 16-13 win over the Los Angeles Riptide in the Major League Lacrosse championship game Sunday afternoon at PaeTec Park in Rochester. Striebel, who also had three assists on the day, was named the Most Valuable Player.\n\nBoyle finished with two goals and two assists in the title game for the Barrage, who became the first repeat champion in MLL history. The Barrage have now won three of the last four MLL championships, and Boyle and Striebel have now been teammates on Princeton's 2001 NCAA championship team, the United States 2002 World Championship team and the three Barrage championship teams. Striebel also was on the 1998 Princeton NCAA champion.\n\nThis most recent championship for the two did not come easily. The teams were even at 11-11 entering the fourth quarter, and Brown alum Chazz Woodson made it 12-11 Riptide with his second goal of the game and fifth of the playoff weekend with 4:39 gone in the fourth. Striebel, though, completely took over the game from there.\n\nFirst he evened the game 47 seconds after Woodson scored after a long run down the middle, and then, after the teams traded goals to make it 13-13, he scored what proved to be the game-winner on a lefthanded shot in traffic with 5:42 to play. His third goal, a rocket on a feed from Boyle from behind the net, made it a two-goal cushion with 2:02 to play. Jed Prossner sealed it with a goal with 1:06 left.\n\nThe Barrage reached the final with a 13-12 overtime win over the Denver Outlaws on Syracuse grad Roy Colsey's goal Saturday afternoon in the first semifinal, while the Riptide knocked off the Rochester Rattlers 15-14 in the other.\n\nBoyle was shut out for the first three quarters of the semifinal, but he helped rally the Barrage from a 12-9 deficit with a goal and two assists in the fourth quarter, including an assist on a goal by Lehigh head coach Kevin Cassese with 59 seconds left to force OT. Striebel had two goals and an assist in the semifinal.\n\nJosh Sims '00 had two goals and an assist for Denver in the game, while Trevor Tierney '01 made 19 saves for the Outlaws."}, {"url": "https://trilogylacrosse.com/our-staff/matt-striebel/", "page_content": "“I play lacrosse because I love it—the speed, the intensity, the teamwork, the sense of fulfillment and satisfaction that comes when success is achieved over and through adversity. At Trilogy Lacrosse, we approach the teaching and coaching of lacrosse with the same passion and commitment to excellence that we bring to our play. Nowhere else can you find a community of lacrosse players and coaches so dedicated to the singular values of the game.”\n\nDuring his career Matt was among the most elite class of lacrosse players in the world. At his peak he was widely considered the best midfielder in the game. His unique combination of athleticism, versatility, and intelligence set him apart as a dynamic playmaker and offensive force. A champion at every level of the game, Matt set professional records in All Star appearances and games played, while compiling one of the most impressive statistical careers for a midfielder ever. His vast knowledge and passion for the game of lacrosse distinguish him as a Trilogy instructor. His energy is contagious and quickly picked up by his players. When not coaching lacrosse, Matt can be found playing pick-up basketball in high school gyms across America. He earned a BA in English from Princeton University and an MFA in Creative Writing from the University of Iowa.\n\nUS Lacrosse National Hall of Fame Class of 2019"}, {"url": "https://phillylacrosse.com/2008/barrage-win-third-straight-mll-game-16-11/", "page_content": "Phillylacrosse.com, Posted 7/11/08\n\nPeter Trombino was named game MVP with five goals and Matt Striebel added four tallies as the Philadelphia Barrage claimed its third straight win Thursday, a 16-11 Major League Lacrosse win over host New Jersey at Piscataway.\n\nLed by Brett Moyer (Ridley) and Brian Spallina, the Barrage (6-3) defense limited the Pride to just 41 shots and did not draw a penalty. Merrick Thomson, the league’s leading scorer and a standout for the Philadelphia Wings’ indoor team – was held scoreless for the first time this season and had a nine-game goal-scoring streak snapped.\n\nBarrage goalkeeper Brian Dougherty (Episcopal Academy) made 13 saves for Philadelphia. Matt Baran made 18 saves for New Jersey, who were outshot by a 57-41 margin.\n\nThe win propelled Philadelphia into first place in the Eastern Conference."}, {"url": "https://www.oursportscentral.com/services/releases/riptide-defeated-by-philadelphia-in-championship-game/n-3532332", "page_content": "Riptide Defeated By Philadelphia In Championship Game\n\nAugust 26, 2007 - Major League Lacrosse (MLL) - Los Angeles Riptide News Release\n\n\n\n\n\n\n\nCARSON, CALIFORNIA - Sunday, August 26, 2007 - Bud Light MVP/midfielder Matt Striebel had three goals and three assists for the Philadelphia Barrage as they defeated the Los Angeles Riptide, 16-13, in the NB Zip MLL Championship Game before a crowd of 5,288 at PAETEC Park on Sunday afternoon. Rookie midfielder Greg Downing (Fairfield '07) posted his first career MLL hat trick and added an assist for the Riptide in the effort.\n\nWith the win, the Barrage were named as the MLL Champions for the second consecutive year. The Riptide, who made their first-ever postseason appearance in their second season as a franchise, finished as the second place team in the league.\n\nFor a complete look at the box score from Sunday's game, go to the following Url:\n\nhttp://www.pointstreak.com/prostats/boxscore.html?gameid=535772\n\nThe two teams traded the lead early in the game, with the Barrage striking first. Riptide attackman Michael Watson (Virginia '97), who scored the game-winner for the Riptide in the semifinal game on Saturday against Rochester, tied the game at 1-1 for the Riptide with his goal at 1:30. Midfielder Graham Gill (Navy '05) found the back of the net to give the Riptide a 2-1 lead at 5:00, but the Barrage tied the game 41 seconds later. The Riptide took the lead again with attackman Terry Riordan's (Hopkins '95) tally at 8:17. Attackman Chazz Woodson (Brown '05) earned the assist on Riordan's goal. The Barrage closed out the opening quarter with three goals and took a 5-3 lead into the second frame.\n\nThe Barrage added to their lead with a goal at 3:07 of the second quarter, before the momentum shifted and the Riptide collected three goals to tie the game at 6-6. Woodson collected his first goal of the game at 6:32 and Riordan closed the Barrage's lead to 6-5 with his second goal of the game at 9:31. Midfielder Matt Ogelsby (Duke '95) assisted on Riordan's goal. Downing collected his first goal of the postseason at 10:17 to tie the game at 6-6, with attackman Spencer Ford (Towson '99) earning the assist on the tally. From there, the Barrage went on the offense again and scored three goals to build a 9-6 lead at halftime.\n\nThe Riptide opened the third segment with a pair of goals to close the Barrage lead to 9-8. Midfielder J.J. Morrissey (Virginia '06) collected his first goal of the postseason at 2:06, assisted by Watson, and midfielder Matt Casey (Ithaca '05) also tallied his first of the postseason at 3:41. The Barrage answered back with two goals of their own to increase their lead to 11-8, but the Riptide rallied to tie the game at 11-11 heading into the final quarter. Downing got the rush going with his second goal of the game, assisted by Ford, at 7:06 and Riordan posted his third goal of the game at 8:53 to close the Riptide to within one goal. Gill assisted on Riordan's tally. Earning his first career MLL hat trick, Downing tied the score for the second time in the game with his tally at 13:18. Attackman Wes Green (Adelphi '06) earned the assist on Downing's third goal of the game.\n\nThe Riptide took the lead at 4:39 of the final quarter of the 2007 season with Woodson's second goal of the game, but the Barrage fought back and scored two goals to take a 13-12 lead. Ford's tally at 8:11, assisted by Gill, tied the game at 13-13, but the Riptide couldn't overcome the Barrage, as the defending MLL champions collected three goals to defeat the Riptide by a final score of 16-13.\n\nRiptide goalie Mickey Jarboe made 10 saves on the 26 shots he faced in the contest.\n\nFor more information, visit LARIPTIDE.COM or call 1-866-4-LAX-TIX.\n\n• Discuss this story on the Major League Lacrosse message board...\n\n\n\n\n\nMajor League Lacrosse Stories from August 26, 2007\n\nThe opinions expressed in this release are those of the organization issuing it, and do not necessarily reflect the thoughts or opinions of OurSports Central or its staff."}, {"url": "https://www.gazettenet.com/Amherst-College-senior-Colin-Minicus-gets-drafted-by-Philadelphia-Barrage-of-Major-League-Lacrosse-34255947", "page_content": "Colin Minicus thought his lacrosse career was over.\n\nWith his senior season at Amherst College cut short due to the COVID-19 pandemic, he threw his name into the NCAA transfer portal to see if an opportunity came up.\n\nOne did, just not from the portal. On Monday, the Philadelphia Barrage selected the attackman with the 33rd pick in the Major League Lacrosse draft.\n\n“Growing up I always played lacrosse and I’ve loved playing it,” Minicus said. “It’s been in my family and I never really thought about playing in the professionals. I looked at college as my last go. Unfortunately due to this coronavirus the season was cut short and that stung a lot, for me especially. To get a chance to possible play in the pros is an honor. I love it. It’s a real surprise to be honest.”\n\nMinicus’ father, Kevin, played football and lacrosse at Amherst College (class of 1989). His mother, Maureen (Flaherty), was an All-American in both lacrosse and field hockey at Williams (class of 1990).\n\nColin Minicus grew up in Darien, Connecticut, and it was through a hometown connection how he learned he was getting picked. Jamie Hanford, who was an All-American for Darien High School in the early 1990s, was hired by Barrage head coach Spencer Ford to be the team’s associate head coach. Hanford texted Minicus Monday morning of the draft.\n\nPrior to that text, Minicus had no real indication that the MLL was a possibility. He received a phone call a couple weeks before the draft from a different MLL team probing his interest in returning to college for another year of eligibility. That was until the Barrage reached out on Monday.\n\n“Initially I was interested in” returning to college, Minicus said. “I was very taken back by the season getting canceled and the school year being canceled. I put my name in as a formality. I wanted to see what opportunities were out there and maybe something would come up where I could possibly further my education and play lacrosse as well. Due to the virus there are so many people in the transfer portal and there are only so many spots at grad programs across the country.”\n\nMinicus had 12 goals and nine assists through four games during his senior year. He finished his career with 128 goals and 148 assists (276 points) in 58 games for the Mammoths.\n\n“I’m very excited and very thankful that Philadelphia drafted me and I’m thankful to everyone who helped me get there; youth coaches, my high school coaches and especially my college coaches. They taught me everything I know,” Minicus said. “I wouldn’t be a player at all today without their help.”\n\nMinicus is joining a team with an interesting history. The Barrage moved from Bridgeport to Philly for the 2004 MLL season. From 2004 to 2008, Philly made the playoffs four times, winning three MLL championships. Northampton resident and National Lacrosse Hall of Famer Matt Striebel starred for the Barrage during those seasons.\n\nThe Philly organization folded following the 2008 season. The team returns this year, but with players relocated from the Atlanta Blaze, which folded after the 2019 season.\n\nMinicus is eager to return to the Philadelphia lacrosse scene. In 2019, Amherst College reached the Division III national championship where it lost to Cabrini, 16-12, at Lincoln Financial Field.\n\n“It’s an unbelievable city to be in, just the history and the sports,” Minicus said. “I’m a New York fan though so I can’t love Philly too much, but I’m really excited to be there. It’s great lacrosse history. It should be exciting.”\n\nMike Moran can be reached at mmoran@gazettenet.com. Follow on Twitter @mikemoranDHG."}, {"url": "https://peoplepill.com/people/matt-striebel/", "page_content": "Matt Striebel (born January 12, 1979) is a high school lacrosse coach at Northampton High School and a professional lacrosse midfielder who plays professional field lacrosse in the Major League Lacrosse (MLL) for the New York Lizards and formerly played professional box lacrosse in the National Lacrosse League (NLL). He starred as a member of the Princeton Tigers men's lacrosse team from 1998 through 2001 and the Princeton Tigers men's soccer team from 1997 through 2000.\n\nDuring his time at Princeton, the team qualified for the NCAA Men's Lacrosse Championship all four years, reached the championship game three times, won the championship game twice and won four Ivy League championships. He was a two-time honorable mention United States Intercollegiate Lacrosse Association (USILA) All-American and three-time All-Ivy League selection (once first team, twice second team). He was also an All-Ivy league performer in soccer and earned Princeton co-athlete of the year (all-sport) honors as a senior.\n\nAs a professional, he has earned three MLL championships, a league record eight MLL All-Star recognitions and an MLL championship game MVP award. He is also a three-time Team USA representative and two-time World Lacrosse Championship gold medalist.\n\nBackground\n\nStriebel is a native of Gill, Massachusetts. He first got involved in lacrosse at about the age of 12 or 13 when his sister brought home the Brine Lightning stick that he began to play with. Striebel attended The Hotchkiss School in Lakeville, Connecticut. Striebel first started playing lacrosse when he was a youth for Jeff Coulson, owner of Indoor Action Sports, in Greenfield, Massachusetts.\n\nHe also attended the Writers Workshop at The University of Iowa in Iowa City, Iowa, earning a Master of Fine Arts degree in 2007. He had earned a Bachelor of Arts degree in English at Princeton.\n\nCollege career\n\nAt Princeton he was a two-time honorable mention USILA All-American Team selection in 2000 and 2001. He was a second team All-Ivy League selection in 1999 and 2000 and a first team selection in 2001. He was a 2001 USILA Scholar All-American. During his four-year career, Princeton went undefeated in Ivy League Conference play with consecutive 6–0 records. Princeton was invited to the 1999 tournament, was a finalist in the 2000 tournament and earned championships in both the 1998 and 2001 tournaments, bringing the schools consecutive tournament invitations streak to twelve. In Striebel's 2001 senior season, the arrival of freshman Ryan Boyle necessitated that he move from attack to midfield. The move came the first practice after Princeton's 14–8 loss to Syracuse. Striebel had previously been orchestrating the Princeton offense from behind the goal, but on March 25, 2001, head coach Bill Tierney made the switch. During the 1998 season when Princeton won the NCAA title, Striebel had been playing midfield. Princeton went undefeated for the rest of the 2001 season after the switch.\n\nDuring the 2000 NCAA tournament, Striebel scored two goals in the quarterfinals 10–7 victory against Maryland, and he added another in the 13–7 championship game loss to Syracuse. Striebel was one of the leading scorers on the team that season, and he was the team leader in assists entering the final four weekend. In the quarterfinals of the 2001 NCAA championship tournament, Striebel had an assist in the 8–7 victory over Loyola. In the 12–11 semifinal victory over Towson State, Striebel had a goal and an assist. Striebel scored twice in the 2001 championship game and also added two assists. He was selected to the All-tournament team.\n\nStriebel was also an honorable mention All-Ivy League soccer player in 2000 as well as a 2000 Academic All-Ivy selection in soccer. As a junior, Striebel was a member of the 1999 Ivy League Champion Princeton Soccer team that earned an invitation to the 1999 NCAA Men's Division I Soccer Championship. The team posted a 10–5–2 (5–1–1 Ivy League) record.\n\nAs of 2010, Striebel ranks eighth on the Princeton Lacrosse career assists list and eleventh on the Princeton soccer career assists list. As a senior, he was honored as one of the three athletes of the year on campus (along with Dennis Norman and Scott Denbo)\n\nProfessional career\n\nStriebel began his career in the league's inaugural 2001 MLL season with the Bridgeport Barrage and stayed with the team as it remained in Bridgeport, Connecticut until the 2003 season. Then he moved with the franchise and played with the Philadelphia Barrage from 2004 through 2008. In 2009 MLL season, he joined the Chicago Machine and then became a member of the Rochester Rattlers for the 2011 MLL season. Striebel and Boyle were reunited for five seasons in Philadelphia. Striebel has helped the Barrage to win three Steinfeld Cup championships in 2004, 2006, and 2007. In the 2004 championship game, he scored what the Baltimore Sun described as the clinching goal in the 13–11 victory over the Boston Cannons. In the 2006 game, he had nine points (four goals, including one two-pointer and four assists). He was presented with the 2007 Steinfeld Cup Game Most Valuable Player Award. Striebel appeared in the 2005 & 2007 Major League Lacrosse All-Star Games. In the 2006 All-Star game he represented Team USA by scoring a goal and two assists. Striebel was an MLL All-Pro selection in 2007 and 2008. Striebel was an MLL All-Star in 2011. In 2012, Striebel set the MLL record for most All-Star games with eight (consecutive).\n\nStriebel served as an assistant coach for Princeton Men's Lacrosse in 2005. Striebel also spent time assisting the men's lacrosse team at Iowa during his time there. As of 12 April 2012, Striebel currently coaches the Varsity Boys Lacrosse team at Northampton High School in Northampton, MA which is just south of his hometown. He also played professionally in 2012 and 2013.\n\nIn addition to his field lacrosse career, Striebel played one season in 2003 of box lacrosse with the Philadelphia Wings in the National Lacrosse League. Streibel was traded by the Wings to the New York Saints in February 2003. He never appeared in a game for the Saints. Striebel has also played professional soccer for the Western Massachusetts Pioneers.\n\nStriebel has represented Team USA in the World Lacrosse Championship in 2002, 2006, and 2010. In the 2002 World Lacrosse Championship semifinal match against the Iroquois Nation, Striebel scored a goal in the 18–8 victory. Striebel also serves as a representative of Trilogy Lacrosse.\n\nOn November 11, 2013, Striebel was traded to the New York Lizards.\n\nStatistics\n\nMLL\n\nRegular Season Playoffs Season Team GP G 2ptG A Pts LB PIM GP G 2ptG A Pts LB PIM 2001 Bridgeport 8 4 0 8 12 10 0 -- -- -- -- -- -- -- 2002 Bridgeport 9 10 0 5 15 22 0 2 2 0 1 3 4 0 2003 Bridgeport 12 16 0 2 18 19 0 -- -- -- -- -- -- -- 2004 Philadelphia 12 15 0 12 27 14 0.5 2 2 0 1 3 4 0 2005 Philadelphia 12 22 0 13 35 25 0.5 -- -- -- -- -- -- -- 2006 Philadelphia 11 23 0 12 35 29 0 2 9 1 5 15 2 0 2007 Philadelphia 12 25 1 13 39 22 0 2 5 0 4 9 4 0 2008 Philadelphia 12 31 0 11 42 21 0 1 2 0 0 2 1 0 2009 Chicago 12 13 1 8 22 18 1.5 -- -- -- -- -- -- -- 2010 Chicago 10 12 0 5 17 14 0 -- -- -- -- -- -- -- 2011 Rochester 12 13 4 8 25 16 3.0 -- -- -- -- -- -- -- 2012 Rochester 14 14 8 10 32 13 0.5 -- -- -- -- -- -- -- MLL Totals 122 184 6 97 287 210 2.5 7 18 1 10 29 11 0\n\nPrinceton University"}]}