{"Matt Striebel was born on October 15, 1978.": [{"url": "https://www.usalaxmagazine.com/usa-insider/senior-men/hall-of-fame-call-a-final-victory-for-the-versatile-matt-striebel", "page_content": "Nine lacrosse legends — Ryan Boyle, Charlie Coker, Kara Ariza Cooke, Rachael Becker DeCecco, Sarah Forbes, Cathy Reese, Paul Schimoler, Richard Speckmann and Matt Striebel — will be inducted into the National Lacrosse Hall of Fame Oct. 19 at The Grand Lodge in Hunt Valley, Md. These are their stories.\n\nMatt Striebel was out to lunch with his wife and two kids, and then he saw his phone ring. He didn’t recognize the number, so he let it go straight to voicemail, as one does.\n\nThe message, he quickly realized, was from US Lacrosse. It was right around the annual giving time for the men’s national team, Striebel said, so he called back to let them know his check was ready to be sent out.\n\nBut on the other line was Rick Lake, men's game senior manager at US Lacrosse. His message was a tad different.\n\n“He goes, ‘Matt, we're actually calling you to let you know made the Hall of Fame,’” the Gill, Mass., native recalled. “It was an amazing moment that was made doubly better that I found out I was going in with Ryan (Boyle). As soon as I hung up that phone call, I called Ryan and was like, ‘This is crazy. Can you believe it?’ It was the perfect, poetic bookend to a journey of our playing careers.”\n\n\"We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?\" — Matt Striebel describing a meeting Bill Tierney his senior year.\n\nStriebel is one of nine set for the National Lacrosse Hall of Fame’s Class of 2019, entering with his close friend, Boyle — a fellow champion at Princeton, with the U.S. national team and in Major League Lacrosse. They now work together at Trilogy Lacrosse, the company Boyle co-founded, though their roots extend back to 2001 at Princeton.\n\nThe Tigers, then coached by fellow Hall of Fame member Bill Tierney, had Boyle entering as a blue-chip recruit down on attack. Striebel, a captain and returning All-American on attack, was excited by playing with a player of his quality. Plans went another direction, though.\n\n“We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?,’” said Striebel, who gave himself 24 hours to sulk before embracing his new role.\n\n“I decided it's my senior year, I really want to win and am here to win a national championship. From a lacrosse standpoint, it's the best thing that could have happened to me, because I am more of a midfielder talent-wise and it made us a better team and opened opportunities on the U.S. team and as a professional.”\n\nThat’s not hyperbole from Striebel, either. That 2001 season marked Striebel’s second national championship while at Princeton, as well as a fourth straight Ivy League championship. On the national stage, he captured gold at the World Lacrosse championships in 2002 (Perth) and 2010 (Manchester), plus silver in 2006 (Ontario).\n\nStriebel also secured three MLL championships (2004, ‘06, ‘07) with the Philadelphia Barrage, earning earning MLL All-Star honors on nine occasions. Boyle was right there at nearly every step.\n\n“I’m far happier for him than I am for myself,” Boyle said.\n\n\n\n\n\n\n\n\n\n\n\n“I often say there are some guys out there who are A-plus in a couple categories. Oh, he's an A-plus shooter or an A-plus dodger,” Striebel began. “For me, I think I just had the versatility to be B-plus, A-minus guy in a lot of different categories. That allowed me to change and adapt my game as I got older.\n\n“The first 10 years I was in the MLL, I think I took one two-point shot and it was on an open goal when we needed goal differential for the playoffs. Then as I got older, like a basketball player who's adding a different aspect, I became more of a shooter so I could develop other parts of my game and maintain relevance as a player.”\n\nBut like most great players, Striebel’s connection with the game didn’t cease once he put away the pads and cleats. He’s spent the last seven years coaching at Northampton High School in Massachusetts, plus working for Trilogy. He’s especially close with coaches in the Colonial Athletic Association, so he’ll often swing by nearby UMass-Amherst to catch games and chat with old friends.\n\nThose experiences also remind Striebel of his time at Hotchkiss, in Lakeville, Conn., during the mid-1990s. He said that was the “dawn of the post-graduate lacrosse era” at New England prep schools, where he played alongside several NHL draft picks.\n\n“You had kids who played multiple sports at a very high level,” Striebel said. “There were great athletes and for better or for worse, lacrosse has become a 365-day endeavor where kids have an opportunity to play every day.”"}, {"url": "https://www.gazettenet.com/Matt-Striebel-will-be-inducted-into-National-Lacrosse-Hall-of-Fame-29390368", "page_content": "Lacrosse began as a hobby for Matt Striebel.\n\nHis sister, Jessica, played first and brought her stick home. He was a baseball fan and dreamed of becoming a major leaguer.\n\n“Like every kid in America,” the Northampton resident said.\n\nIntrigued, the Gill native started playing as a teenager for the Franklin County Lacrosse Club for Jeff Coulson, who now owns Indoor Action Sports in Greenfield.\n\n“Growing up here in western Mass., and I grew up in Gill, which was obviously not a hotbed of lacrosse at the time or really now. It’s such a dynamic combination of other sports you’re familiar growing up with,” Striebel said. “You get the best of all those worlds combined in one Frankenstein sport. For a lot of kids, and I see this all the time at camps, it just grabs you, and once it does you’re hooked for life.”\n\nLacrosse became Striebel’s passion and profession. He won championships at every level and worked to spread the spark lacrosse ignited in him. On Saturday, Striebel, 40, will earn one of the sport’s highest honors with his induction to the National Lacrosse Hall of Fame.\n\n“At a certain point, I’d had a career that was solid enough and significant enough that I had a pretty good idea that I would one day make it to the Hall of Fame. The part that was surprising to me was how quickly I got that call,” Striebel said. “It was a validating honor. It puts your career in a nice, cohesive narrative.”\n\nHe’ll be inducted as part of a nine-member class at the The Grand Lodge in Hunt Valley, Maryland, just outside Baltimore.\n\n“It’s increasingly starting to set in. There’s some behind the scenes getting tickets for people and organizing all that stuff that makes it seem like it’s more in the real world and less something that’s really special and exists as the culmination of a career,” Striebel said. “It’s sitting in a space that’s between about to be real and pretty fantastic.”\n\nStriebel received the call while out to lunch with his family at Green Bean in Northampton. It came from a Philadelphia number he didn’t recognize, so he let it go to voice mail. Rick Lake, the men’s lacrosse director of USA Lacrosse, was on the other end of the call.\n\n“My immediate assumption was they were calling because the annual giving campaigns had started up,” Striebel said. “As a veteran of three U.S. teams, they look to me to give donations every once in a while and I assumed that’s what it was.”\n\nInstead, he found out he was being inducted alongside one of his longtime teammates and best friends Ryan Boyle. Boyle was a freshman at Princeton during Striebel’s senior year in 2001. They both played attack, but Boyle took all of the repetitions during fall practices since Striebel also played soccer for the Tigers.\n\nAs a returning All-American and team captain, Striebel tried to coexist with the freshman.\n\n“It was pretty apparent that Ryan was just better at it than I was, even as a freshman,” said Striebel, who attended The Hotchkiss School before Princeton. “The coaches brought me into their office and said, ‘Striebs you had a great run, we’re going to move you to midfield.’ For about 48 hours, I hated Ryan.”\n\nBut he realized that if the team was going to compete for a title, that would give the Tigers the best chance. Princeton won the national championship for the second time in Striebel’s career.\n\nStriebel began his professional career the next season during the inaugural season of Major League Lacrosse. He played for the Bridgeport Barrage, and three years later after the franchise relocated to Philadelphia, they asked Striebel if Boyle was worth a first-round draft pick.\n\n“I said he was and it would make our team better instantly,” Striebel said.\n\nThe Barrage won the MLL title, one of three in Striebel’s 15-year career. He and Boyle also played together for the USA on three World Lacrosse Championship teams.\n\nBoyle started a company called Trinity Lacrosse in 2005 and brought Striebel on as the program’s national director, which is his full-time job. They run camps and events all over the country.\n\n“The fact that I was able to go in with Ryan, that’s such a poetic bookend to our career and our friendship in the sport,” Striebel said.\n\nStriebel was first called up to the U.S. national team in 2002, less than a year after the September 11 terrorist attacks. The Americans took gold in Perth, Australia.\n\n“To be able to put on a jersey and represent your country playing a sport you love, there aren’t many honors that are more fulfilling than that,” Striebel said.\n\nHe enjoyed teaming up with other elite players in a competitive setting. Unlike All-star games, which Striebel played in eight times, the world championships provided a goal to achieve rather than an exhibition.\n\nWhen the U.S. lost the 2006 final – the first time they hadn’t won gold since 1978 – Striebel and his team left their medals in the dormitories in Ontario.\n\n“It was a really difficult loss to stomach,” he said.\n\nStriebel and the USA redeemed themselves in 2010 in England with the nation’s ninth gold medal.\n\n“I’ve been fortunate enough to win a lot of incredible championships in my career, and those USA championships are definitely up there,” Striebel said. “I’ve had a fortunate career.”\n\nHe recognizes that fortune and works to give others the same opportunity. Striebel coached Northampton High School for seven years before stepping down following the 2018 season.\n\n“I’ve been fortunate enough to go all over the country and around the world spreading the gospel of lacrosse and sharing the sport with people who care about it,” Striebel said. “It has a strong fraternity of followers. It’s been amazing to see that expand to include so many people and so many places.”\n\nTrilogy partners with organizations like Harlem Lacrosse to bring the game to areas and environments that haven’t historically played it.\n\n“For many years it’s been a predominantly white, wealthy, preppy sport, and that’s not sustainable and that’s not the best version of lacrosse that’s going to exist,” Striebel said. “When the sport is available to kids all across the country whether you’re living in an inner city neighborhood or Fairfield County, Connecticut, that’s when the sport is really going to have achieved its peak.”"}, {"url": "https://www.usalacrosse.com/player-profile/matthew-striebel", "page_content": "Striebel was inducted as a truly great player. He was a two-time All-American at Princeton, splitting time during his career between attack and midfield. Striebel helped the Tigers capture two NCAA championships during his career, winning the title in 1998 and 2001. He was also a part of four Ivy League championships, and earned All-Ivy honors three times (1999, 2000, 2001).\n\nStriebel played on three U.S. National Teams, helping to claim world championships in 2002 and 2010, and a runner-up finish in 2006. He also enjoyed a 13-year professional career in Major League Lacrosse, earning all-star honors nine times and All-Pro status in 2007 & 2008. He was a part of three MLL championships and was selected as the Championship Game MVP in 2007. He finished his MLL career with 225 goals, 120 assists, and 355 points, ranking among the top 10 all-time in each category.\n\nA product of Gill, Mass., Striebel was inducted into the US Lacrosse Western Massachusetts Chapter Hall of Fame in 2014."}, {"url": "https://premierlacrosseleague.com/articles/hall-of-fame-inductee-matt-striebel", "page_content": "A two-sport athlete at Princeton, Matt Striebel played lacrosse like a soccer player. In MLL offseasons, Striebel played three years of professional soccer from 2002-04 for the Western Massachusetts Pioneers of the USL Second Division.\n\n“His fitness level was just off the charts,” said former Philadelphia Barrage head coach Tony Resch. “He could keep going and going. He had great speed. He could shoot it. Unselfish. All the things you look for in a midfielder, he had it.”\n\nWhile Resch and most fans may remember Striebel as a lights-out shooter, that wasn’t always the case. Prior to his senior year at Princeton, Striebel was an X attackman. When freshman Ryan Boyle stepped on campus, Striebel was moved above GLE – where, Boyle jokes, his shot couldn’t break a paper bag.\n\n“He completely reinvented himself, starting with his senior year at Princeton moving from behind the cage out in front to midfield,” said Boyle, who also played with Striebel on the Philadelphia Barrage. “His dedication to his craft is truly remarkable. Going from somebody who didn’t really have much range to speak of at all to being somebody who you had to pick up at 16 yards… he was unguardable.”\n\nThat work ethic led to a 171-game career. Striebel evolved to earn playing time on the ‘04 Barrage midfield unit featuring Blake Miller (46G, 11A), Roy Colsey (25G, 6T, 7A), Mike Mollot (11G, 8A), and Doug Shanahan (12G, 6A).\n\nStriebel stuck the eventual game-winning goal in the ‘04 MLL Championship for that Barrage squad. He did the same in ‘07 on a broken powerplay – Boyle’s favorite shot of Striebel’s 15-year pro career."}, {"url": "https://www.celebsagewiki.com/matt-striebel", "page_content": "Age, Biography and Wiki\n\nMatt Striebel was born on 12 January, 1979 in Gill, Massachusetts, United States. Discover Matt Striebel's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 44 years old?\n\nPopular As N/A Occupation N/A Age 44 years old Zodiac Sign Capricorn Born 12 January 1979 Birthday 12 January Birthplace Gill, Massachusetts, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 12 January. He is a member of famous with the age 44 years old group.\n\nMatt Striebel Height, Weight & Measurements\n\nAt 44 years old, Matt Striebel height is 6 ft 1 in (1.85 m) and Weight 190 pounds (86 kg).\n\nPhysical Status Height 6 ft 1 in (1.85 m) Weight 190 pounds (86 kg) Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nMatt Striebel Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Matt Striebel worth at the age of 44 years old? Matt Striebel’s income source is mostly from being a successful . He is from United States. We have estimated Matt Striebel's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nMatt Striebel Social Network\n\nInstagram Linkedin Twitter Matt Striebel Twitter Facebook Wikipedia Matt Striebel Wikipedia Imdb\n\nTimeline"}, {"url": "https://peoplepill.com/people/matt-striebel/", "page_content": "Matt Striebel (born January 12, 1979) is a high school lacrosse coach at Northampton High School and a professional lacrosse midfielder who plays professional field lacrosse in the Major League Lacrosse (MLL) for the New York Lizards and formerly played professional box lacrosse in the National Lacrosse League (NLL). He starred as a member of the Princeton Tigers men's lacrosse team from 1998 through 2001 and the Princeton Tigers men's soccer team from 1997 through 2000.\n\nDuring his time at Princeton, the team qualified for the NCAA Men's Lacrosse Championship all four years, reached the championship game three times, won the championship game twice and won four Ivy League championships. He was a two-time honorable mention United States Intercollegiate Lacrosse Association (USILA) All-American and three-time All-Ivy League selection (once first team, twice second team). He was also an All-Ivy league performer in soccer and earned Princeton co-athlete of the year (all-sport) honors as a senior.\n\nAs a professional, he has earned three MLL championships, a league record eight MLL All-Star recognitions and an MLL championship game MVP award. He is also a three-time Team USA representative and two-time World Lacrosse Championship gold medalist.\n\nBackground\n\nStriebel is a native of Gill, Massachusetts. He first got involved in lacrosse at about the age of 12 or 13 when his sister brought home the Brine Lightning stick that he began to play with. Striebel attended The Hotchkiss School in Lakeville, Connecticut. Striebel first started playing lacrosse when he was a youth for Jeff Coulson, owner of Indoor Action Sports, in Greenfield, Massachusetts.\n\nHe also attended the Writers Workshop at The University of Iowa in Iowa City, Iowa, earning a Master of Fine Arts degree in 2007. He had earned a Bachelor of Arts degree in English at Princeton.\n\nCollege career\n\nAt Princeton he was a two-time honorable mention USILA All-American Team selection in 2000 and 2001. He was a second team All-Ivy League selection in 1999 and 2000 and a first team selection in 2001. He was a 2001 USILA Scholar All-American. During his four-year career, Princeton went undefeated in Ivy League Conference play with consecutive 6–0 records. Princeton was invited to the 1999 tournament, was a finalist in the 2000 tournament and earned championships in both the 1998 and 2001 tournaments, bringing the schools consecutive tournament invitations streak to twelve. In Striebel's 2001 senior season, the arrival of freshman Ryan Boyle necessitated that he move from attack to midfield. The move came the first practice after Princeton's 14–8 loss to Syracuse. Striebel had previously been orchestrating the Princeton offense from behind the goal, but on March 25, 2001, head coach Bill Tierney made the switch. During the 1998 season when Princeton won the NCAA title, Striebel had been playing midfield. Princeton went undefeated for the rest of the 2001 season after the switch.\n\nDuring the 2000 NCAA tournament, Striebel scored two goals in the quarterfinals 10–7 victory against Maryland, and he added another in the 13–7 championship game loss to Syracuse. Striebel was one of the leading scorers on the team that season, and he was the team leader in assists entering the final four weekend. In the quarterfinals of the 2001 NCAA championship tournament, Striebel had an assist in the 8–7 victory over Loyola. In the 12–11 semifinal victory over Towson State, Striebel had a goal and an assist. Striebel scored twice in the 2001 championship game and also added two assists. He was selected to the All-tournament team.\n\nStriebel was also an honorable mention All-Ivy League soccer player in 2000 as well as a 2000 Academic All-Ivy selection in soccer. As a junior, Striebel was a member of the 1999 Ivy League Champion Princeton Soccer team that earned an invitation to the 1999 NCAA Men's Division I Soccer Championship. The team posted a 10–5–2 (5–1–1 Ivy League) record.\n\nAs of 2010, Striebel ranks eighth on the Princeton Lacrosse career assists list and eleventh on the Princeton soccer career assists list. As a senior, he was honored as one of the three athletes of the year on campus (along with Dennis Norman and Scott Denbo)\n\nProfessional career\n\nStriebel began his career in the league's inaugural 2001 MLL season with the Bridgeport Barrage and stayed with the team as it remained in Bridgeport, Connecticut until the 2003 season. Then he moved with the franchise and played with the Philadelphia Barrage from 2004 through 2008. In 2009 MLL season, he joined the Chicago Machine and then became a member of the Rochester Rattlers for the 2011 MLL season. Striebel and Boyle were reunited for five seasons in Philadelphia. Striebel has helped the Barrage to win three Steinfeld Cup championships in 2004, 2006, and 2007. In the 2004 championship game, he scored what the Baltimore Sun described as the clinching goal in the 13–11 victory over the Boston Cannons. In the 2006 game, he had nine points (four goals, including one two-pointer and four assists). He was presented with the 2007 Steinfeld Cup Game Most Valuable Player Award. Striebel appeared in the 2005 & 2007 Major League Lacrosse All-Star Games. In the 2006 All-Star game he represented Team USA by scoring a goal and two assists. Striebel was an MLL All-Pro selection in 2007 and 2008. Striebel was an MLL All-Star in 2011. In 2012, Striebel set the MLL record for most All-Star games with eight (consecutive).\n\nStriebel served as an assistant coach for Princeton Men's Lacrosse in 2005. Striebel also spent time assisting the men's lacrosse team at Iowa during his time there. As of 12 April 2012, Striebel currently coaches the Varsity Boys Lacrosse team at Northampton High School in Northampton, MA which is just south of his hometown. He also played professionally in 2012 and 2013.\n\nIn addition to his field lacrosse career, Striebel played one season in 2003 of box lacrosse with the Philadelphia Wings in the National Lacrosse League. Streibel was traded by the Wings to the New York Saints in February 2003. He never appeared in a game for the Saints. Striebel has also played professional soccer for the Western Massachusetts Pioneers.\n\nStriebel has represented Team USA in the World Lacrosse Championship in 2002, 2006, and 2010. In the 2002 World Lacrosse Championship semifinal match against the Iroquois Nation, Striebel scored a goal in the 18–8 victory. Striebel also serves as a representative of Trilogy Lacrosse.\n\nOn November 11, 2013, Striebel was traded to the New York Lizards.\n\nStatistics\n\nMLL\n\nRegular Season Playoffs Season Team GP G 2ptG A Pts LB PIM GP G 2ptG A Pts LB PIM 2001 Bridgeport 8 4 0 8 12 10 0 -- -- -- -- -- -- -- 2002 Bridgeport 9 10 0 5 15 22 0 2 2 0 1 3 4 0 2003 Bridgeport 12 16 0 2 18 19 0 -- -- -- -- -- -- -- 2004 Philadelphia 12 15 0 12 27 14 0.5 2 2 0 1 3 4 0 2005 Philadelphia 12 22 0 13 35 25 0.5 -- -- -- -- -- -- -- 2006 Philadelphia 11 23 0 12 35 29 0 2 9 1 5 15 2 0 2007 Philadelphia 12 25 1 13 39 22 0 2 5 0 4 9 4 0 2008 Philadelphia 12 31 0 11 42 21 0 1 2 0 0 2 1 0 2009 Chicago 12 13 1 8 22 18 1.5 -- -- -- -- -- -- -- 2010 Chicago 10 12 0 5 17 14 0 -- -- -- -- -- -- -- 2011 Rochester 12 13 4 8 25 16 3.0 -- -- -- -- -- -- -- 2012 Rochester 14 14 8 10 32 13 0.5 -- -- -- -- -- -- -- MLL Totals 122 184 6 97 287 210 2.5 7 18 1 10 29 11 0\n\nPrinceton University"}, {"url": "https://trilogylacrosse.com/our-staff/matt-striebel/", "page_content": "“I play lacrosse because I love it—the speed, the intensity, the teamwork, the sense of fulfillment and satisfaction that comes when success is achieved over and through adversity. At Trilogy Lacrosse, we approach the teaching and coaching of lacrosse with the same passion and commitment to excellence that we bring to our play. Nowhere else can you find a community of lacrosse players and coaches so dedicated to the singular values of the game.”\n\nDuring his career Matt was among the most elite class of lacrosse players in the world. At his peak he was widely considered the best midfielder in the game. His unique combination of athleticism, versatility, and intelligence set him apart as a dynamic playmaker and offensive force. A champion at every level of the game, Matt set professional records in All Star appearances and games played, while compiling one of the most impressive statistical careers for a midfielder ever. His vast knowledge and passion for the game of lacrosse distinguish him as a Trilogy instructor. His energy is contagious and quickly picked up by his players. When not coaching lacrosse, Matt can be found playing pick-up basketball in high school gyms across America. He earned a BA in English from Princeton University and an MFA in Creative Writing from the University of Iowa.\n\nUS Lacrosse National Hall of Fame Class of 2019"}, {"url": "https://www.celebheightwiki.com/matt-striebel-height", "page_content": "Matt Striebel height - How tall is Matt Striebel?\n\nMatt Striebel was born on 12 January, 1979 in Gill, Massachusetts, United States. At 41 years old, Matt Striebel height is 6 ft 0 in (185.0 cm).\n\nNow We discover Matt Striebel's Biography, Age, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of net worth at the age of 43 years old?\n\nPopular As N/A Occupation N/A Matt Striebel Age 43 years old Zodiac Sign Capricorn Born 12 January 1979 Birthday 12 January Birthplace Gill, Massachusetts, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 12 January. He is a member of famous with the age 43 years old group.\n\nMatt Striebel Weight & Measurements\n\nPhysical Status Weight 190 pounds (86 kg) Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nMatt Striebel Net Worth\n\nHe net worth has been growing significantly in 2021-22. So, how much is Matt Striebel worth at the age of 43 years old? Matt Striebel’s income source is mostly from being a successful . He is from United States. We have estimated Matt Striebel's net worth , money, salary, income, and assets.\n\nNet Worth in 2022 $1 Million - $5 Million Salary in 2022 Under Review Net Worth in 2021 Pending Salary in 2021 Under Review House Not Available Cars Not Available Source of Income\n\nMatt Striebel Social Network\n\nInstagram Linkedin Twitter Matt Striebel Twitter Facebook Wikipedia Matt Striebel Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.hotchkiss.org/athletics/post/~board/athletics-news/post/striebel-97-inducted-into-lacrosse-hall-of-fame", "page_content": "Striebel ’97 Inducted Into Lacrosse Hall of Fame\n\nMatt Striebel ’97 was inducted into the National Lacrosse Hall of Fame in a ceremony held in Maryland on Oct. 19.\n\nIn attendance was longtime boys lacrosse coach Chris Burchfield, who coached Striebel during his time in Lakeville.\n\n“When [Striebel] enrolled, I knew we had the privilege of working with a true scholar/athlete,” said Burchfield. “He never took his talents for granted while at Hotchkiss, and he remained impressively dedicated to his work, his teammates, and his school.\n\nIn his citation from the committee, Striebel was lauded for his play in college, as a professional, and also as a member of US national teams.\n\n“Striebel will be inducted as a truly great player. He was a two-time All-American at Princeton University, splitting time during his career between attack and midfield. Striebel helped the Tigers capture two NCAA championships during his career, winning the title in 1998 and 2001. He was also a part of four Ivy League championships, and earned all-Ivy honors three times (1999, 2000, 2001).\n\n“Striebel played on three U.S. National Teams, helping to claim world championships in 2002 and 2010, and a runner-up finish in 2006. He also enjoyed a 13-year professional career in Major League Lacrosse, earning all-star honors nine times and All-Pro status in 2007 & 2008. He was a part of three MLL championships, and selected as the Championship Game MVP in 2007. He finished his MLL career with 225 goals, 120 assists, and 355 points, ranking among the top 10 all-time in each category.\n\n“A product of Gill, Mass., Striebel was inducted into the US Lacrosse Western Massachusetts Chapter Hall of Fame in 2014,” according to a release from the Hall of Fame."}, {"url": "https://www.statscrew.com/lacrosse/stats/p-striemat001", "page_content": "Matt Striebel\n\nMatt Striebel\n\nBorn: January 12, 1979\n\nIowa City, IA\n\nPosition: M\n\nHeight: 6'1\"\n\nWeight: 190\n\nCareer: 2001-2015\n\n\n\nMatt Striebel scored 225 goals and recorded 117 assists in his 167-game career with the Bridgeport Barrage, Philadelphia Wings, Philadelphia Barrage, Barrage, Chicago Machine, Rochester Rattlers , Boston Cannons, New York Lizards and Chesapeake BayHawks. He began playing during the 2001 season and last took the field during the 2015 campaign.\n\nClick on column headings to sort.\n\nScoring:\n\nPostseason - Scoring:"}], "Matt Striebel is a lacrosse player.": [{"url": "https://www.usalacrosse.com/player-profile/matthew-striebel", "page_content": "Striebel was inducted as a truly great player. He was a two-time All-American at Princeton, splitting time during his career between attack and midfield. Striebel helped the Tigers capture two NCAA championships during his career, winning the title in 1998 and 2001. He was also a part of four Ivy League championships, and earned All-Ivy honors three times (1999, 2000, 2001).\n\nStriebel played on three U.S. National Teams, helping to claim world championships in 2002 and 2010, and a runner-up finish in 2006. He also enjoyed a 13-year professional career in Major League Lacrosse, earning all-star honors nine times and All-Pro status in 2007 & 2008. He was a part of three MLL championships and was selected as the Championship Game MVP in 2007. He finished his MLL career with 225 goals, 120 assists, and 355 points, ranking among the top 10 all-time in each category.\n\nA product of Gill, Mass., Striebel was inducted into the US Lacrosse Western Massachusetts Chapter Hall of Fame in 2014."}, {"url": "https://premierlacrosseleague.com/articles/hall-of-fame-inductee-matt-striebel", "page_content": "A two-sport athlete at Princeton, Matt Striebel played lacrosse like a soccer player. In MLL offseasons, Striebel played three years of professional soccer from 2002-04 for the Western Massachusetts Pioneers of the USL Second Division.\n\n“His fitness level was just off the charts,” said former Philadelphia Barrage head coach Tony Resch. “He could keep going and going. He had great speed. He could shoot it. Unselfish. All the things you look for in a midfielder, he had it.”\n\nWhile Resch and most fans may remember Striebel as a lights-out shooter, that wasn’t always the case. Prior to his senior year at Princeton, Striebel was an X attackman. When freshman Ryan Boyle stepped on campus, Striebel was moved above GLE – where, Boyle jokes, his shot couldn’t break a paper bag.\n\n“He completely reinvented himself, starting with his senior year at Princeton moving from behind the cage out in front to midfield,” said Boyle, who also played with Striebel on the Philadelphia Barrage. “His dedication to his craft is truly remarkable. Going from somebody who didn’t really have much range to speak of at all to being somebody who you had to pick up at 16 yards… he was unguardable.”\n\nThat work ethic led to a 171-game career. Striebel evolved to earn playing time on the ‘04 Barrage midfield unit featuring Blake Miller (46G, 11A), Roy Colsey (25G, 6T, 7A), Mike Mollot (11G, 8A), and Doug Shanahan (12G, 6A).\n\nStriebel stuck the eventual game-winning goal in the ‘04 MLL Championship for that Barrage squad. He did the same in ‘07 on a broken powerplay – Boyle’s favorite shot of Striebel’s 15-year pro career."}, {"url": "https://www.wikiwand.com/en/Matt_Striebel", "page_content": "Matt Striebel (born January 12, 1979) is a former professional lacrosse midfielder who played professional field lacrosse in the Major League Lacrosse (MLL) for the New York Lizards and formerly played professional box lacrosse in the National Lacrosse League (NLL). He starred as a member of the Princeton Tigers men's lacrosse team from 1998 through 2001 and the Princeton Tigers men's soccer team from 1997 through 2000.\n\nAmerican lacrosse player (born 1979)\n\nQuick facts: Born, Nationality, Height, Weight, Position... ▼\n\nDuring his time at Princeton, the team qualified for the NCAA Men's Lacrosse Championship all four years, reached the championship game three times, won the championship game twice and won four Ivy League championships. He was a two-time honorable mention United States Intercollegiate Lacrosse Association (USILA) All-American and three-time All-Ivy League selection (once first team, twice second team). He was also an All-Ivy league performer in soccer and earned Princeton co-athlete of the year (all-sport) honors as a senior.\n\nAs a professional, he has earned three MLL championships, a league record eight MLL All-Star recognitions and an MLL championship game MVP award. He is also a three-time Team USA representative and two-time World Lacrosse Championship gold medalist.\n\nIn 2019, Striebel was elected to the National Lacrosse Hall of Fame.[1]"}, {"url": "https://www.usalaxmagazine.com/usa-insider/senior-men/hall-of-fame-call-a-final-victory-for-the-versatile-matt-striebel", "page_content": "Nine lacrosse legends — Ryan Boyle, Charlie Coker, Kara Ariza Cooke, Rachael Becker DeCecco, Sarah Forbes, Cathy Reese, Paul Schimoler, Richard Speckmann and Matt Striebel — will be inducted into the National Lacrosse Hall of Fame Oct. 19 at The Grand Lodge in Hunt Valley, Md. These are their stories.\n\nMatt Striebel was out to lunch with his wife and two kids, and then he saw his phone ring. He didn’t recognize the number, so he let it go straight to voicemail, as one does.\n\nThe message, he quickly realized, was from US Lacrosse. It was right around the annual giving time for the men’s national team, Striebel said, so he called back to let them know his check was ready to be sent out.\n\nBut on the other line was Rick Lake, men's game senior manager at US Lacrosse. His message was a tad different.\n\n“He goes, ‘Matt, we're actually calling you to let you know made the Hall of Fame,’” the Gill, Mass., native recalled. “It was an amazing moment that was made doubly better that I found out I was going in with Ryan (Boyle). As soon as I hung up that phone call, I called Ryan and was like, ‘This is crazy. Can you believe it?’ It was the perfect, poetic bookend to a journey of our playing careers.”\n\n\"We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?\" — Matt Striebel describing a meeting Bill Tierney his senior year.\n\nStriebel is one of nine set for the National Lacrosse Hall of Fame’s Class of 2019, entering with his close friend, Boyle — a fellow champion at Princeton, with the U.S. national team and in Major League Lacrosse. They now work together at Trilogy Lacrosse, the company Boyle co-founded, though their roots extend back to 2001 at Princeton.\n\nThe Tigers, then coached by fellow Hall of Fame member Bill Tierney, had Boyle entering as a blue-chip recruit down on attack. Striebel, a captain and returning All-American on attack, was excited by playing with a player of his quality. Plans went another direction, though.\n\n“We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?,’” said Striebel, who gave himself 24 hours to sulk before embracing his new role.\n\n“I decided it's my senior year, I really want to win and am here to win a national championship. From a lacrosse standpoint, it's the best thing that could have happened to me, because I am more of a midfielder talent-wise and it made us a better team and opened opportunities on the U.S. team and as a professional.”\n\nThat’s not hyperbole from Striebel, either. That 2001 season marked Striebel’s second national championship while at Princeton, as well as a fourth straight Ivy League championship. On the national stage, he captured gold at the World Lacrosse championships in 2002 (Perth) and 2010 (Manchester), plus silver in 2006 (Ontario).\n\nStriebel also secured three MLL championships (2004, ‘06, ‘07) with the Philadelphia Barrage, earning earning MLL All-Star honors on nine occasions. Boyle was right there at nearly every step.\n\n“I’m far happier for him than I am for myself,” Boyle said.\n\n\n\n\n\n\n\n\n\n\n\n“I often say there are some guys out there who are A-plus in a couple categories. Oh, he's an A-plus shooter or an A-plus dodger,” Striebel began. “For me, I think I just had the versatility to be B-plus, A-minus guy in a lot of different categories. That allowed me to change and adapt my game as I got older.\n\n“The first 10 years I was in the MLL, I think I took one two-point shot and it was on an open goal when we needed goal differential for the playoffs. Then as I got older, like a basketball player who's adding a different aspect, I became more of a shooter so I could develop other parts of my game and maintain relevance as a player.”\n\nBut like most great players, Striebel’s connection with the game didn’t cease once he put away the pads and cleats. He’s spent the last seven years coaching at Northampton High School in Massachusetts, plus working for Trilogy. He’s especially close with coaches in the Colonial Athletic Association, so he’ll often swing by nearby UMass-Amherst to catch games and chat with old friends.\n\nThose experiences also remind Striebel of his time at Hotchkiss, in Lakeville, Conn., during the mid-1990s. He said that was the “dawn of the post-graduate lacrosse era” at New England prep schools, where he played alongside several NHL draft picks.\n\n“You had kids who played multiple sports at a very high level,” Striebel said. “There were great athletes and for better or for worse, lacrosse has become a 365-day endeavor where kids have an opportunity to play every day.”"}, {"url": "https://www.gazettenet.com/Matt-Striebel-will-be-inducted-into-National-Lacrosse-Hall-of-Fame-29390368", "page_content": "Lacrosse began as a hobby for Matt Striebel.\n\nHis sister, Jessica, played first and brought her stick home. He was a baseball fan and dreamed of becoming a major leaguer.\n\n“Like every kid in America,” the Northampton resident said.\n\nIntrigued, the Gill native started playing as a teenager for the Franklin County Lacrosse Club for Jeff Coulson, who now owns Indoor Action Sports in Greenfield.\n\n“Growing up here in western Mass., and I grew up in Gill, which was obviously not a hotbed of lacrosse at the time or really now. It’s such a dynamic combination of other sports you’re familiar growing up with,” Striebel said. “You get the best of all those worlds combined in one Frankenstein sport. For a lot of kids, and I see this all the time at camps, it just grabs you, and once it does you’re hooked for life.”\n\nLacrosse became Striebel’s passion and profession. He won championships at every level and worked to spread the spark lacrosse ignited in him. On Saturday, Striebel, 40, will earn one of the sport’s highest honors with his induction to the National Lacrosse Hall of Fame.\n\n“At a certain point, I’d had a career that was solid enough and significant enough that I had a pretty good idea that I would one day make it to the Hall of Fame. The part that was surprising to me was how quickly I got that call,” Striebel said. “It was a validating honor. It puts your career in a nice, cohesive narrative.”\n\nHe’ll be inducted as part of a nine-member class at the The Grand Lodge in Hunt Valley, Maryland, just outside Baltimore.\n\n“It’s increasingly starting to set in. There’s some behind the scenes getting tickets for people and organizing all that stuff that makes it seem like it’s more in the real world and less something that’s really special and exists as the culmination of a career,” Striebel said. “It’s sitting in a space that’s between about to be real and pretty fantastic.”\n\nStriebel received the call while out to lunch with his family at Green Bean in Northampton. It came from a Philadelphia number he didn’t recognize, so he let it go to voice mail. Rick Lake, the men’s lacrosse director of USA Lacrosse, was on the other end of the call.\n\n“My immediate assumption was they were calling because the annual giving campaigns had started up,” Striebel said. “As a veteran of three U.S. teams, they look to me to give donations every once in a while and I assumed that’s what it was.”\n\nInstead, he found out he was being inducted alongside one of his longtime teammates and best friends Ryan Boyle. Boyle was a freshman at Princeton during Striebel’s senior year in 2001. They both played attack, but Boyle took all of the repetitions during fall practices since Striebel also played soccer for the Tigers.\n\nAs a returning All-American and team captain, Striebel tried to coexist with the freshman.\n\n“It was pretty apparent that Ryan was just better at it than I was, even as a freshman,” said Striebel, who attended The Hotchkiss School before Princeton. “The coaches brought me into their office and said, ‘Striebs you had a great run, we’re going to move you to midfield.’ For about 48 hours, I hated Ryan.”\n\nBut he realized that if the team was going to compete for a title, that would give the Tigers the best chance. Princeton won the national championship for the second time in Striebel’s career.\n\nStriebel began his professional career the next season during the inaugural season of Major League Lacrosse. He played for the Bridgeport Barrage, and three years later after the franchise relocated to Philadelphia, they asked Striebel if Boyle was worth a first-round draft pick.\n\n“I said he was and it would make our team better instantly,” Striebel said.\n\nThe Barrage won the MLL title, one of three in Striebel’s 15-year career. He and Boyle also played together for the USA on three World Lacrosse Championship teams.\n\nBoyle started a company called Trinity Lacrosse in 2005 and brought Striebel on as the program’s national director, which is his full-time job. They run camps and events all over the country.\n\n“The fact that I was able to go in with Ryan, that’s such a poetic bookend to our career and our friendship in the sport,” Striebel said.\n\nStriebel was first called up to the U.S. national team in 2002, less than a year after the September 11 terrorist attacks. The Americans took gold in Perth, Australia.\n\n“To be able to put on a jersey and represent your country playing a sport you love, there aren’t many honors that are more fulfilling than that,” Striebel said.\n\nHe enjoyed teaming up with other elite players in a competitive setting. Unlike All-star games, which Striebel played in eight times, the world championships provided a goal to achieve rather than an exhibition.\n\nWhen the U.S. lost the 2006 final – the first time they hadn’t won gold since 1978 – Striebel and his team left their medals in the dormitories in Ontario.\n\n“It was a really difficult loss to stomach,” he said.\n\nStriebel and the USA redeemed themselves in 2010 in England with the nation’s ninth gold medal.\n\n“I’ve been fortunate enough to win a lot of incredible championships in my career, and those USA championships are definitely up there,” Striebel said. “I’ve had a fortunate career.”\n\nHe recognizes that fortune and works to give others the same opportunity. Striebel coached Northampton High School for seven years before stepping down following the 2018 season.\n\n“I’ve been fortunate enough to go all over the country and around the world spreading the gospel of lacrosse and sharing the sport with people who care about it,” Striebel said. “It has a strong fraternity of followers. It’s been amazing to see that expand to include so many people and so many places.”\n\nTrilogy partners with organizations like Harlem Lacrosse to bring the game to areas and environments that haven’t historically played it.\n\n“For many years it’s been a predominantly white, wealthy, preppy sport, and that’s not sustainable and that’s not the best version of lacrosse that’s going to exist,” Striebel said. “When the sport is available to kids all across the country whether you’re living in an inner city neighborhood or Fairfield County, Connecticut, that’s when the sport is really going to have achieved its peak.”"}, {"url": "https://peoplepill.com/people/matt-striebel/", "page_content": "Matt Striebel (born January 12, 1979) is a high school lacrosse coach at Northampton High School and a professional lacrosse midfielder who plays professional field lacrosse in the Major League Lacrosse (MLL) for the New York Lizards and formerly played professional box lacrosse in the National Lacrosse League (NLL). He starred as a member of the Princeton Tigers men's lacrosse team from 1998 through 2001 and the Princeton Tigers men's soccer team from 1997 through 2000.\n\nDuring his time at Princeton, the team qualified for the NCAA Men's Lacrosse Championship all four years, reached the championship game three times, won the championship game twice and won four Ivy League championships. He was a two-time honorable mention United States Intercollegiate Lacrosse Association (USILA) All-American and three-time All-Ivy League selection (once first team, twice second team). He was also an All-Ivy league performer in soccer and earned Princeton co-athlete of the year (all-sport) honors as a senior.\n\nAs a professional, he has earned three MLL championships, a league record eight MLL All-Star recognitions and an MLL championship game MVP award. He is also a three-time Team USA representative and two-time World Lacrosse Championship gold medalist.\n\nBackground\n\nStriebel is a native of Gill, Massachusetts. He first got involved in lacrosse at about the age of 12 or 13 when his sister brought home the Brine Lightning stick that he began to play with. Striebel attended The Hotchkiss School in Lakeville, Connecticut. Striebel first started playing lacrosse when he was a youth for Jeff Coulson, owner of Indoor Action Sports, in Greenfield, Massachusetts.\n\nHe also attended the Writers Workshop at The University of Iowa in Iowa City, Iowa, earning a Master of Fine Arts degree in 2007. He had earned a Bachelor of Arts degree in English at Princeton.\n\nCollege career\n\nAt Princeton he was a two-time honorable mention USILA All-American Team selection in 2000 and 2001. He was a second team All-Ivy League selection in 1999 and 2000 and a first team selection in 2001. He was a 2001 USILA Scholar All-American. During his four-year career, Princeton went undefeated in Ivy League Conference play with consecutive 6–0 records. Princeton was invited to the 1999 tournament, was a finalist in the 2000 tournament and earned championships in both the 1998 and 2001 tournaments, bringing the schools consecutive tournament invitations streak to twelve. In Striebel's 2001 senior season, the arrival of freshman Ryan Boyle necessitated that he move from attack to midfield. The move came the first practice after Princeton's 14–8 loss to Syracuse. Striebel had previously been orchestrating the Princeton offense from behind the goal, but on March 25, 2001, head coach Bill Tierney made the switch. During the 1998 season when Princeton won the NCAA title, Striebel had been playing midfield. Princeton went undefeated for the rest of the 2001 season after the switch.\n\nDuring the 2000 NCAA tournament, Striebel scored two goals in the quarterfinals 10–7 victory against Maryland, and he added another in the 13–7 championship game loss to Syracuse. Striebel was one of the leading scorers on the team that season, and he was the team leader in assists entering the final four weekend. In the quarterfinals of the 2001 NCAA championship tournament, Striebel had an assist in the 8–7 victory over Loyola. In the 12–11 semifinal victory over Towson State, Striebel had a goal and an assist. Striebel scored twice in the 2001 championship game and also added two assists. He was selected to the All-tournament team.\n\nStriebel was also an honorable mention All-Ivy League soccer player in 2000 as well as a 2000 Academic All-Ivy selection in soccer. As a junior, Striebel was a member of the 1999 Ivy League Champion Princeton Soccer team that earned an invitation to the 1999 NCAA Men's Division I Soccer Championship. The team posted a 10–5–2 (5–1–1 Ivy League) record.\n\nAs of 2010, Striebel ranks eighth on the Princeton Lacrosse career assists list and eleventh on the Princeton soccer career assists list. As a senior, he was honored as one of the three athletes of the year on campus (along with Dennis Norman and Scott Denbo)\n\nProfessional career\n\nStriebel began his career in the league's inaugural 2001 MLL season with the Bridgeport Barrage and stayed with the team as it remained in Bridgeport, Connecticut until the 2003 season. Then he moved with the franchise and played with the Philadelphia Barrage from 2004 through 2008. In 2009 MLL season, he joined the Chicago Machine and then became a member of the Rochester Rattlers for the 2011 MLL season. Striebel and Boyle were reunited for five seasons in Philadelphia. Striebel has helped the Barrage to win three Steinfeld Cup championships in 2004, 2006, and 2007. In the 2004 championship game, he scored what the Baltimore Sun described as the clinching goal in the 13–11 victory over the Boston Cannons. In the 2006 game, he had nine points (four goals, including one two-pointer and four assists). He was presented with the 2007 Steinfeld Cup Game Most Valuable Player Award. Striebel appeared in the 2005 & 2007 Major League Lacrosse All-Star Games. In the 2006 All-Star game he represented Team USA by scoring a goal and two assists. Striebel was an MLL All-Pro selection in 2007 and 2008. Striebel was an MLL All-Star in 2011. In 2012, Striebel set the MLL record for most All-Star games with eight (consecutive).\n\nStriebel served as an assistant coach for Princeton Men's Lacrosse in 2005. Striebel also spent time assisting the men's lacrosse team at Iowa during his time there. As of 12 April 2012, Striebel currently coaches the Varsity Boys Lacrosse team at Northampton High School in Northampton, MA which is just south of his hometown. He also played professionally in 2012 and 2013.\n\nIn addition to his field lacrosse career, Striebel played one season in 2003 of box lacrosse with the Philadelphia Wings in the National Lacrosse League. Streibel was traded by the Wings to the New York Saints in February 2003. He never appeared in a game for the Saints. Striebel has also played professional soccer for the Western Massachusetts Pioneers.\n\nStriebel has represented Team USA in the World Lacrosse Championship in 2002, 2006, and 2010. In the 2002 World Lacrosse Championship semifinal match against the Iroquois Nation, Striebel scored a goal in the 18–8 victory. Striebel also serves as a representative of Trilogy Lacrosse.\n\nOn November 11, 2013, Striebel was traded to the New York Lizards.\n\nStatistics\n\nMLL\n\nRegular Season Playoffs Season Team GP G 2ptG A Pts LB PIM GP G 2ptG A Pts LB PIM 2001 Bridgeport 8 4 0 8 12 10 0 -- -- -- -- -- -- -- 2002 Bridgeport 9 10 0 5 15 22 0 2 2 0 1 3 4 0 2003 Bridgeport 12 16 0 2 18 19 0 -- -- -- -- -- -- -- 2004 Philadelphia 12 15 0 12 27 14 0.5 2 2 0 1 3 4 0 2005 Philadelphia 12 22 0 13 35 25 0.5 -- -- -- -- -- -- -- 2006 Philadelphia 11 23 0 12 35 29 0 2 9 1 5 15 2 0 2007 Philadelphia 12 25 1 13 39 22 0 2 5 0 4 9 4 0 2008 Philadelphia 12 31 0 11 42 21 0 1 2 0 0 2 1 0 2009 Chicago 12 13 1 8 22 18 1.5 -- -- -- -- -- -- -- 2010 Chicago 10 12 0 5 17 14 0 -- -- -- -- -- -- -- 2011 Rochester 12 13 4 8 25 16 3.0 -- -- -- -- -- -- -- 2012 Rochester 14 14 8 10 32 13 0.5 -- -- -- -- -- -- -- MLL Totals 122 184 6 97 287 210 2.5 7 18 1 10 29 11 0\n\nPrinceton University"}, {"url": "https://trilogylacrosse.com/our-staff/matt-striebel/", "page_content": "“I play lacrosse because I love it—the speed, the intensity, the teamwork, the sense of fulfillment and satisfaction that comes when success is achieved over and through adversity. At Trilogy Lacrosse, we approach the teaching and coaching of lacrosse with the same passion and commitment to excellence that we bring to our play. Nowhere else can you find a community of lacrosse players and coaches so dedicated to the singular values of the game.”\n\nDuring his career Matt was among the most elite class of lacrosse players in the world. At his peak he was widely considered the best midfielder in the game. His unique combination of athleticism, versatility, and intelligence set him apart as a dynamic playmaker and offensive force. A champion at every level of the game, Matt set professional records in All Star appearances and games played, while compiling one of the most impressive statistical careers for a midfielder ever. His vast knowledge and passion for the game of lacrosse distinguish him as a Trilogy instructor. His energy is contagious and quickly picked up by his players. When not coaching lacrosse, Matt can be found playing pick-up basketball in high school gyms across America. He earned a BA in English from Princeton University and an MFA in Creative Writing from the University of Iowa.\n\nUS Lacrosse National Hall of Fame Class of 2019"}, {"url": "https://www.masslive.com/highschoolsports/article/does-lacrosse-have-a-culture-problem-northamptons-matt-striebel-works-with-team-to-counter-games-negative-perceptions/", "page_content": "NORTHAMPTON – Ever since Bryce Wall was in grade school, lacrosse has been part of his life.\n\nThe Northampton goalie and his brother Ryan, a defenseman for the Blue Devils, went to a college game with their family when they were in fifth grade. Although the brothers had little idea of what was happening on the field, they fell in love with the game and have played ever since.\n\nBut the game that’s become one of his life’s passions is likely not a topic Wall brings up much in conversation.\n\n“Whenever I meet someone new, I never tell them I’m a lacrosse player first,” Wall said. “It’s unfortunate it has to be that way, but it is.”\n\nWall is more likely to tell an acquaintance he’s a theatre technician or an artist. He wants to avoid being slapped with the “lax bro” stereotype: the neon-pinnie wearing, cheap-beer drinking meathead image many still attach to the game.\n\nThe Blue Devils’ junior goalie could not be further from that dumb jock character. It wasn’t partying or the lax-bro culture that attracted him to the game. Rather, Wall said both in lacrosse and in art, which he wants to study in college, the “process-oriented” path to success appealed to him.\n\n“One thing that you always struggle with in life is being goal-oriented, worried about where you end up, if you end up with a lot of money, going to a good school, these various things that people will look at you and judge you based on whatever that is,” Wall said. “It’s something I’ve struggled with as well, I’ve had to work really hard to not do that.”\n\n***\n\nWall’s coach at Northampton, Matt Striebel, understands well that instinct to hide the fact that he’s a lacrosse player from others. Striebel is a 14-year veteran of Major League Lacrosse, and his career has taken him to four different franchises from Philadephia to Chicago.\n\nWhen Striebel has travelled for games, he said strangers in airports with no knowledge of the rules or the strategy of the game know two things about lacrosse: They know about Duke, and they know about Yeardley Love.\n\nIn 2006, three members of the Duke lacrosse team were arrested and accused of raping Crystal Mangum, who was hired as a stripper at a team party. The players were ultimately found not guilty, but their behavior in the high profile case brought up questions about class, race relations and the school’s athletic culture.\n\nSix years later, University of Virginia lacrosse player George Huguely was convicted of second-degree murder and sentenced to 23 years in prison for killing his ex-girlfriend, Yeardley Love, in another case that drew international media attention.\n\nThe vast majority of lacrosse players don’t exhibit the behavior that has brought the sport its negative reputation, but the actions of a few have perpetuated the stereotype of the game as a country club sport – a hobby to keep rich, white, entitled kids from getting bored.\n\n“Lacrosse players get negative reputations in a lot of places because of negative behavior,” Striebel said. “Because there are enough kids in our sport that are entitled, it’s hard to get away from that.”\n\nBefore his Major League Lacrosse career, Striebel was a national title-winner in 2001 at Princeton University, where he played for legendary coach Bill Tierney. The culture Striebel described was defined by the work the players put in.\n\n“If you didn’t win a national championship, you were letting down everyone who came before you. We were terrified about not upholding that tradition. There was no room for posturing. There was no room for not putting in the necessary time,” Striebel said.\n\nTierney’s Princeton teams won six national titles in 10 years between 1992 and 2001. Still, even in a program as dominant and serious as Princeton, Striebel said there was a stigma attached to lacrosse athletes off the field.\n\n“I never wore my lacrosse jacket at Princeton, because I knew the minute I walked into a class wearing that jacket I was going to be pigeon-holed as a certain type of person,” he said.\n\nAt a Memorial Day practice at Northampton High School, that type of person was nowhere to be found. Aside from some light banter about girls or prom, the players ran through their drills with a business-like seriousness, stopping only when Striebel wanted to point out a mistake in a defender’s footwork or clean up a sloppy offensive possession.\n\n“They make it out to be something that it’s really not,” said senior Jack Shaughnessy about the sport’s perception. “Lacrosse is a hard sport, and you come out here you realize it’s a lot different that everybody takes it to be.”\n\nThat public perception of lacrosse was not created out of thin air. The game’s roots are as old as America’s. Native Americans first played the game before European settlers arrived. However, the sport’s popularity exploded in the country’s pockets of privilege: suburban Long Island, the Mid-Atlantic states, and New England’s elite prep schools, like the Hotchkiss School where Striebel played.\n\n“I’ve been fortunate to be involved with lacrosse for a long time at every conceivable level and I love the game,” Striebel said. “It pains me that that is the view of the sport in the general public. What pains me is the fact that there isn’t really a great comeback for us yet.”\n\n***\n\nThere’s no great comeback for the lacrosse community, because as a whole, rich and white athletes still make up the vast majority of the game’s athletes. While players in states like Georgia, California and Texas are continuing to pick up lacrosse, its popularity is still concentrated in affluent areas like New England, Long Island and Maryland.\n\nUS Lacrosse, the sports governing body, has reported flagging growth numbers in its annual participation report for the last two years. The reasons behind that slowing growth can easily devolve into a circular argument: To keep growing, the perception that the game is a sport to keep future Wall Street bankers from getting bored needs to change, but for the game’s elitist perception to change, more elite athletes from different areas of the country need to start playing.\n\nOne way to break that cycle, at least in Striebel’s opinion, is for lacrosse players to stop displaying the behavior that, at least in part, gives the game its negative, elitist reputation.\n\nAt his induction into the Western Mass. Lacrosse Hall of Fame this January, Striebel told his players in attendance it was on them to carry the torch to mold a different perception of the game in the future.\n\n“One of the things that absolutely kills me about young men in particular is we give each other (a hard time) when we care about something or we try hard at something,\" he said. “There’s this perception that it’s uncool to (care), which is the most awful message we can give each other.\n\n\"You know where it comes from, you know it comes from a place of insecurity. Any kid who’s making fun of somebody for working hard is somebody who knows they’re doing something they’re not supposed to do.”\n\n***\n\nOn Memorial Day at Northampton High School, the Blue Devils got down to business. They were preparing for Cathedral the next day, a strong league opponent, the team went from drill to drill with a singular focus.\n\nAfter practice, following a quick team huddle to talk about putting together recruiting film, the players filtered out to their cars in the parking lot. A few stayed late to shoot on a net set up off to the side of the field.\n\nThere was no pretentiousness at that practice, no one playing lacrosse because they wanted to embody the culture it represents. In fact, most of the players said they had no idea the game had a negative perception around it when they first picked up a stick.\n\nRyan Wall, Bryce’s brother and a junior defenseman, said the team doesn’t talk that much about the way the game is perceived, or the way they should carry themselves to change that image. The understanding between the coach and his players is mostly unspoken, but in time, Wall hopes attitudes can change.\n\n“It’s a work in progress. The longer we’re around the game and other people are around the game, the more we’re working against that misconception and that idea, the less and less people will start conforming to that idea, and the less people will start applying that idea to lacrosse players in general,” Wall said.\n\nIt’s been nearly 15 years since Striebel played college lacrosse at Princeton. But he still remembers the satisfaction of revealing that he was a lacrosse player after his final grade came in, of undermining the dumb jock stereotype. He says he sees similarities on his team this year.\n\n“That’s what I love about the guys we have on this team. Someone like Bryce or Ryan they’re lacrosse players and they work their ass off to be lacrosse players, but they’re also artists, they’re also interested in other things,” Striebel said. “That’s a way of undermining that dominant theme.“"}, {"url": "https://www.masslive.com/highschoolsports/article/professional-lacrosse-player-matt-striebel-is-new-coach-of-northampton-high-school-boys-lacrosse-team/", "page_content": "NORTHAMPTON – Matt Striebel is a proven winner, something he’d like to instill in his new position as coach of the Northampton High School boys lacrosse team.\n\nThe 33-year-old Gill native was a two-time NCAA Division I men’s lacrosse national champion at Princeton University, a two-time World Lacrosse Championship gold medalist for Team USA and a three-time Major League Lacrosse champion with the Bridgeport/Philadelphia Barrage.\n\nHe also found time to play professional soccer for the Western Mass. Pioneers for a few years when it didn’t conflict with his MLL schedule.\n\n“I think the reason I’ve been as successful as I have is because of the little things and the details,” Striebel said Tuesday. “But I don’t talk to them a lot about what I do.”\n\nAs the Blue Devils move back to the Valley Wheel – with perennial powerhouses such as South Hadley, Minnechaug Regional and defending Western Massachusetts champion Longmeadow – after five years in the Valley League, it’s helpful to have a coach that has himself mixed it up with the best around.\n\nAfter starting as a youth at Indoor Action Sports in Greenfield, Striebel was a two-time honorable mention All-America at Princeton. His collegiate career, as part of arguably the nation’s best team in the late 1990s and early 2000s under coach Bill Tierney, ended with a victory over Syracuse in the 2001 title game. Striebel also played soccer for the Tigers.\n\nHe won three MLL titles in eight seasons with the Barrage, including the clinching goal against the Boston Cannons in 2004, and will return this spring for another season with the Rochester Rattlers.\n\n“I’m looking forward to it now more than ever,” Striebel said of his 12th MLL season. “Now that I’m coaching, I’m itching to get back out there playing.”\n\nStriebel’s coaching experience includes a stint as an assistant at his alma mater and with the club team at Iowa, from where he received his master’s degree. His coaching style borrows from all the coaches he’s had.\n\n“I’ve had the best coaches in lacrosse,” Striebel said. “The sincerest form of flattery is stealing things, copying things.”\n\nThe Blue Devils (6-12 last year) return one first-team All-Scholastic selection from last season, senior midfielder Colin Sawula. The team captain netted 23 goals and 16 assists a season ago.\n\nSawula and fellow senior captains Jay Messer, Andy Kuon and Justin Golec all see a major difference already in what their new coach has been able to get out of them.”\n\n“Compared to last year, it’s completely different,” said Sawula, who has had three coaches in four years. “We’re out there working hard every day. I’m pretty sure we’ve run more this year than we have last year. I have really high hopes for this season.”\n\nOne of those previous coaches, Bill Metzger, is back as an assistant, giving Northampton some continuity.\n\n“It’s definitely an experience,” Messer said. “We’re definitely prepared.”\n\nStriebel observed the Blue Devils several times last season and noticed a team that just needed a spark to get it to reach its full potential and to change the feeling of mediocrity that the players had.\n\n“I saw a team that could benefit from some coaching, some discipline and some plans,” Striebel said. “The biggest thing is getting over the sense of this (losing) is who we are.”\n\nThe Blue Devils are ready to respond.\n\n“He wants us to work hard, and we come out here every day to work hard,” Kuon said. “We’re determined.”"}, {"url": "https://lacrossepal.com/most-famous-lacrosse-players-of-all-time/", "page_content": "Lacrosse is a sport with a long running history. Though its origins can be traced back to Native American tribes, the modern game was first codified in Canada in the 19th century. Since then, it’s grown in popularity.\n\nWhether you’re a casual fan of the sport or a diehard player, everyone can appreciate the skill and athleticism required to play lacrosse at a high level. Though it’s not as widely known as some other sports, lacrosse has created some exceptional athletes. They are skilled, competitive, and inspirational for all the young buds who aspire to be like them today.\n\nSo in this blog post, we will take a look at the most famous lacrosse players of all time.\n\nLooking for the best lacrosse sticks? Check them out here\n\nTop 10 best lacrosse players of all time\n\nJim Brown\n\nWidely considered the greatest lacrosse player of all time, Jim Brown was a star attackman at Syracuse University from 1954 to 1957. He was a two-time All-American at Syracuse University and had a successful professional career. He has also won three national championships with the Rochester Knighthawks.\n\nAfter college, he joined the U.S. National Lacrosse team and helped lead them to a gold medal at the 1958 World Lacrosse Championship. He had a successful career in other sports, including professional football, but he is best remembered for his exploits on the lacrosse field. Brown went on to have a Hall of Fame career with the Cleveland Browns of the National Football League (NFL).\n\nGary Gait\n\nA member of the National Lacrosse Hall of Fame, Gary Gait is one of the most decorated players in the history of the sport. He is one of the most successful lacrosse players in history, earning the first-team All-America honors three times and USILA player of the year twice.\n\nHe led Syracuse to national championships during his tenure with them from 1988-1990. His team also won back-to-back titles! Gary also holds numerous records, including:\n\nGoals scored per game average.\n\nSingle tournament scorers list\n\nCareer tournaments leaderboard passing both Mike95 And Nanu Barnfather\n\nMoreover, Gait also played for Canada in international lacrosse competitions, earning him a spot on the All-World team each year. He also spent 10+ seasons playing professional US Lac Pro League before joining Minor League Lacrosse. As an assistant coach with the University of Maryland women’s teams, he won seven consecutive NCAA championships from 1990 – 2000, and in the early 2000s\n\nPaul Rabil\n\nLacrosse player and founder of the Premier Lacrosse League, Paul Rabil, is an American former professional lacrosse. He played for both Cannons clubs in England as well as at home against other top teams like Boston or New York. With his experience on the field, including 3 World champion titles and 2 Professional MVP awards, this man has done it all when it comes to playing great sports!!\n\nMore than just a lacrosse player, Paul runs a successful YouTube channel which has over 256k subscribers. He7 was a two-time All-American at Johns Hopkins University and won two national championships with the Blue Jays. He has also enjoyed success as a professional, winning three Major League Lacrosse titles with Boston Cannons/New York Lizards franchise.\n\nRead also: How Much Do Professional Laxers Make?\n\nJohn Grant Jr.\n\nWhen you think of lacrosse, John Christopher Grant Jr. is the man who comes to mind. A Hall of Fame professional player and coach in Major League Lacrosse and Ontario league play! Not only John Grant Jr. is also considered one of the greatest lacrosse players, but he also a four-time All-American at the University of Delaware.\n\nBesides that, he has won multiple professional championships with the Rochester Knighthawks and Colorado Mammoth. And he has also served as an offensive coordinator at Johns Hopkins University since 2020.\n\nTom Marechek\n\nMarechek is one of the most decorated players in lacrosse history. He was a four-time All-American at Syracuse, earning first-team honors both years. United States Lacrosse League recognized him with a second-team selection from 1990 to 1992. A six-time league ALL-star and 12-year veteran who played eight seasons for Philadelphia Wings, NLA, MLL, and LaxClassic games.\n\nMoreover, Tom also founded and coached the Team 42 Lacrosse Club, camps held all over America. And he also coached at Friends School of Baltimore in Maryland, where he trained many future lacrosse players that are now attending college across this country!\n\nKelly Amonte Hiller\n\nKelly Amonte Hiller is one of history’s most successful women’s lacrosse coaches. She led Northwestern University to seven NCAA Division I national championships. During her tenure as head coach from 2002-2012 and serving as BC’s guiding light for their program, she has won two titles under iconic figure (in 2014 & 2018). In 2012, she was also inducted into the National Lacross Hall Of Fame.\n\nRead also: Why do women wear lacrosse skirts?\n\nMatt Danowski\n\nMatt Danowski is a former lacrosse player who has played in Major League Lacrosse (MLL) and the Premier Development League. He finished his career with the Chrome steel club, announcing his retirement on February 22nd. Moreover, he also helped lead four different teams, including two NHL affiliates; Colorado Mammoth alongside Rochester Knights back during the 2006-07 season before signing off.\n\nKyle Harrison\n\nKyle Harrison is a retired American professional lacrosse player who currently serves in an official capacity for the PLL. He had 17 years of professional experience playing field hockey and football before transitioning into lacrosse. His skills allowed him to be selected 12 times as captain while achieving success on different levels both nationally & internationally.\n\nHe’s been a visible role model for many other gamers. He has continued being involved with this sport at large through founding Black Lacrosse Alliance which seeks “to push culture forward by creating a more inclusive environment where everyone can be themselves.”\n\nCasey Powell\n\nCasey Powell was an intimidating force on the lacrosse field. During his illustrious career at Syracuse, he secured four USILA All-American citations and one NCAA Division I Most Outstanding Player award. He graduated in 1997 with honors and has also been inducted into the National Lacrosse Hall of Fame!\n\nAfter retirement from professional lacrosse, Powell shifted his focus to other business and philanthropic endeavors. He started the World Lacrosse Foundation (WLF) in 2015; this non-profit organization is dedicated to advancing the sport of lacrosse through various initiatives.\n\nMatt Striebel\n\nMatt Striebel is a two-sport athlete who was an all-star in both lacrosse and soccer. He played field Lacross for the New York Lizards before joining their sister team—Major League Baseball’s Mets (2011). In addition to being highly skilled on offense or defense, you can find him upfield trafficking balls into scoring positions!\n\nHe’s no stranger to success at the highest levels of competition. After four seasons with Princeton, he helped his team qualify for both NCAA Men’s Lacrosse Championship games and won three out of four Ivy League championships too!\n\nAn amateur player who became one if not the best players in MLL history (notably earning 3x league records and 8 All-Star Recognition Awards).\n\nTop 5 best college lacrosse players in 2022\n\nJoey Terenzi\n\nJoey was one of the leading contributors for Manhasset as a freshman and helped them win their 2022 title at NLF nationals.\n\nThere might not have been a better candidate in recent Manhasset (N.Y.) history to wear the cherished No 32 jersey than Joey Terenzi. The number is annually awarded to top senior midfielder of memory Johnny Driscoll, who went on play at the University Of Virginia and died six years ago after battling brain cancer. Still, before his time was up, he let coach Keith Cromwell know that this would be something different had chosen rather than sticking with what he has always done well, which brings us here today, where we can proudly announce him as our newest member!\n\nRead also: Best college lacrosse uniforms in 2022\n\nJoey Spallina\n\nJoey has been the face of lacrosse since he was eight years old, and now it looks like Joey Spallina might be taking over as well. The Mount Sinai (NY) attackman thrived under pressure. Most recently, he was named 1st team ALL-American after leading his high school into states last year where they won 3 titles, including ‘most goals scored.’\n\nCharles Balsamo\n\nChaminade High School’s lacrosse program is well-known locally and nationally. He ranks among the best in New York State for his tremendous athletic ability playing for them.\n\nBalsamo brings an aggressive, tenacious style to the field that is sure to score many goals and create them. From his amazing lacrosse IQ, he can find ways around defenders or take opponents off their feet with finesse in tight spaces before finishing strong anywhere on or near goal!\n\nLuke Engelke\n\nIn the world of recruiting, some go into their choices with a favorite clear school—the one they’ve envisioned playing for since childhood. Luke Engelke is definitely not one of these people; he’s been a die-hard Duke fan from way back! The Leading Edge 2022 and Pingry standout faceoff man has always focused on Dukemicianship. And you’ll never guess what nickname fits best: ” Duker.”\n\nEngelke is the best faceoff man on his team and has been dominant at X since joining. His play in the field after winning draws also sets him apart from others, making it easy for Duke to notice this 6-2 187-pounder with a size/speed combo that can fight through checks while still being one of the top scorers around summer futures tournament circuit last year (17 goals).\n\nCharlie Johnson\n\nCharlie Johnson is one of the most physical defensemen in this year’s Junior Open. He has a lengthy history with Prime Time, which shows he always gives everything on every shift to help his team win! He is a physical, aggressive defenseman who’s well-put together at 6 feet 1 inch and 205 pounds. And he also has the skating skills to turn any matchup into an alley fight for his team.\n\nWith a 6-foot frame, you know what kind of dangerous player Charlie will be – coming across the middle looking for the opposition’s top scorer? Don’t worry about being caught off guard because if there ever were anyone capable of putting hurtin’ around here…it would definitely end up being him.\n\nSumming Up\n\nThese are a few most famous lacrosse players who have made their mark on the sport throughout its long history. From Jim Brown to Paul Rabil, these athletes show that lacrosse is a sport anyone can excel at regardless of where they come from or their background. So get out there and pick up a stick! You never know where it might take you!\n\nRead also: Best lacrosse drills for one person\n\nDid your favorite lacrosse player make our list? Leave us a comment below and let us know!"}], "Matt Striebel played in Major League Lacrosse (MLL).": [{"url": "https://www.usalacrosse.com/player-profile/matthew-striebel", "page_content": "Striebel was inducted as a truly great player. He was a two-time All-American at Princeton, splitting time during his career between attack and midfield. Striebel helped the Tigers capture two NCAA championships during his career, winning the title in 1998 and 2001. He was also a part of four Ivy League championships, and earned All-Ivy honors three times (1999, 2000, 2001).\n\nStriebel played on three U.S. National Teams, helping to claim world championships in 2002 and 2010, and a runner-up finish in 2006. He also enjoyed a 13-year professional career in Major League Lacrosse, earning all-star honors nine times and All-Pro status in 2007 & 2008. He was a part of three MLL championships and was selected as the Championship Game MVP in 2007. He finished his MLL career with 225 goals, 120 assists, and 355 points, ranking among the top 10 all-time in each category.\n\nA product of Gill, Mass., Striebel was inducted into the US Lacrosse Western Massachusetts Chapter Hall of Fame in 2014."}, {"url": "https://www.wikiwand.com/en/Matt_Striebel", "page_content": "Matt Striebel (born January 12, 1979) is a former professional lacrosse midfielder who played professional field lacrosse in the Major League Lacrosse (MLL) for the New York Lizards and formerly played professional box lacrosse in the National Lacrosse League (NLL). He starred as a member of the Princeton Tigers men's lacrosse team from 1998 through 2001 and the Princeton Tigers men's soccer team from 1997 through 2000.\n\nAmerican lacrosse player (born 1979)\n\nQuick facts: Born, Nationality, Height, Weight, Position... ▼\n\nDuring his time at Princeton, the team qualified for the NCAA Men's Lacrosse Championship all four years, reached the championship game three times, won the championship game twice and won four Ivy League championships. He was a two-time honorable mention United States Intercollegiate Lacrosse Association (USILA) All-American and three-time All-Ivy League selection (once first team, twice second team). He was also an All-Ivy league performer in soccer and earned Princeton co-athlete of the year (all-sport) honors as a senior.\n\nAs a professional, he has earned three MLL championships, a league record eight MLL All-Star recognitions and an MLL championship game MVP award. He is also a three-time Team USA representative and two-time World Lacrosse Championship gold medalist.\n\nIn 2019, Striebel was elected to the National Lacrosse Hall of Fame.[1]"}, {"url": "https://premierlacrosseleague.com/articles/hall-of-fame-inductee-matt-striebel", "page_content": "A two-sport athlete at Princeton, Matt Striebel played lacrosse like a soccer player. In MLL offseasons, Striebel played three years of professional soccer from 2002-04 for the Western Massachusetts Pioneers of the USL Second Division.\n\n“His fitness level was just off the charts,” said former Philadelphia Barrage head coach Tony Resch. “He could keep going and going. He had great speed. He could shoot it. Unselfish. All the things you look for in a midfielder, he had it.”\n\nWhile Resch and most fans may remember Striebel as a lights-out shooter, that wasn’t always the case. Prior to his senior year at Princeton, Striebel was an X attackman. When freshman Ryan Boyle stepped on campus, Striebel was moved above GLE – where, Boyle jokes, his shot couldn’t break a paper bag.\n\n“He completely reinvented himself, starting with his senior year at Princeton moving from behind the cage out in front to midfield,” said Boyle, who also played with Striebel on the Philadelphia Barrage. “His dedication to his craft is truly remarkable. Going from somebody who didn’t really have much range to speak of at all to being somebody who you had to pick up at 16 yards… he was unguardable.”\n\nThat work ethic led to a 171-game career. Striebel evolved to earn playing time on the ‘04 Barrage midfield unit featuring Blake Miller (46G, 11A), Roy Colsey (25G, 6T, 7A), Mike Mollot (11G, 8A), and Doug Shanahan (12G, 6A).\n\nStriebel stuck the eventual game-winning goal in the ‘04 MLL Championship for that Barrage squad. He did the same in ‘07 on a broken powerplay – Boyle’s favorite shot of Striebel’s 15-year pro career."}, {"url": "https://www.usalaxmagazine.com/usa-insider/senior-men/hall-of-fame-call-a-final-victory-for-the-versatile-matt-striebel", "page_content": "Nine lacrosse legends — Ryan Boyle, Charlie Coker, Kara Ariza Cooke, Rachael Becker DeCecco, Sarah Forbes, Cathy Reese, Paul Schimoler, Richard Speckmann and Matt Striebel — will be inducted into the National Lacrosse Hall of Fame Oct. 19 at The Grand Lodge in Hunt Valley, Md. These are their stories.\n\nMatt Striebel was out to lunch with his wife and two kids, and then he saw his phone ring. He didn’t recognize the number, so he let it go straight to voicemail, as one does.\n\nThe message, he quickly realized, was from US Lacrosse. It was right around the annual giving time for the men’s national team, Striebel said, so he called back to let them know his check was ready to be sent out.\n\nBut on the other line was Rick Lake, men's game senior manager at US Lacrosse. His message was a tad different.\n\n“He goes, ‘Matt, we're actually calling you to let you know made the Hall of Fame,’” the Gill, Mass., native recalled. “It was an amazing moment that was made doubly better that I found out I was going in with Ryan (Boyle). As soon as I hung up that phone call, I called Ryan and was like, ‘This is crazy. Can you believe it?’ It was the perfect, poetic bookend to a journey of our playing careers.”\n\n\"We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?\" — Matt Striebel describing a meeting Bill Tierney his senior year.\n\nStriebel is one of nine set for the National Lacrosse Hall of Fame’s Class of 2019, entering with his close friend, Boyle — a fellow champion at Princeton, with the U.S. national team and in Major League Lacrosse. They now work together at Trilogy Lacrosse, the company Boyle co-founded, though their roots extend back to 2001 at Princeton.\n\nThe Tigers, then coached by fellow Hall of Fame member Bill Tierney, had Boyle entering as a blue-chip recruit down on attack. Striebel, a captain and returning All-American on attack, was excited by playing with a player of his quality. Plans went another direction, though.\n\n“We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?,’” said Striebel, who gave himself 24 hours to sulk before embracing his new role.\n\n“I decided it's my senior year, I really want to win and am here to win a national championship. From a lacrosse standpoint, it's the best thing that could have happened to me, because I am more of a midfielder talent-wise and it made us a better team and opened opportunities on the U.S. team and as a professional.”\n\nThat’s not hyperbole from Striebel, either. That 2001 season marked Striebel’s second national championship while at Princeton, as well as a fourth straight Ivy League championship. On the national stage, he captured gold at the World Lacrosse championships in 2002 (Perth) and 2010 (Manchester), plus silver in 2006 (Ontario).\n\nStriebel also secured three MLL championships (2004, ‘06, ‘07) with the Philadelphia Barrage, earning earning MLL All-Star honors on nine occasions. Boyle was right there at nearly every step.\n\n“I’m far happier for him than I am for myself,” Boyle said.\n\n\n\n\n\n\n\n\n\n\n\n“I often say there are some guys out there who are A-plus in a couple categories. Oh, he's an A-plus shooter or an A-plus dodger,” Striebel began. “For me, I think I just had the versatility to be B-plus, A-minus guy in a lot of different categories. That allowed me to change and adapt my game as I got older.\n\n“The first 10 years I was in the MLL, I think I took one two-point shot and it was on an open goal when we needed goal differential for the playoffs. Then as I got older, like a basketball player who's adding a different aspect, I became more of a shooter so I could develop other parts of my game and maintain relevance as a player.”\n\nBut like most great players, Striebel’s connection with the game didn’t cease once he put away the pads and cleats. He’s spent the last seven years coaching at Northampton High School in Massachusetts, plus working for Trilogy. He’s especially close with coaches in the Colonial Athletic Association, so he’ll often swing by nearby UMass-Amherst to catch games and chat with old friends.\n\nThose experiences also remind Striebel of his time at Hotchkiss, in Lakeville, Conn., during the mid-1990s. He said that was the “dawn of the post-graduate lacrosse era” at New England prep schools, where he played alongside several NHL draft picks.\n\n“You had kids who played multiple sports at a very high level,” Striebel said. “There were great athletes and for better or for worse, lacrosse has become a 365-day endeavor where kids have an opportunity to play every day.”"}, {"url": "https://teamusa.uslacrosse.org/player-profile/matthew-striebel", "page_content": "Striebel was inducted as a truly great player. He was a two-time All-American at Princeton, splitting time during his career between attack and midfield. Striebel helped the Tigers capture two NCAA championships during his career, winning the title in 1998 and 2001. He was also a part of four Ivy League championships, and earned All-Ivy honors three times (1999, 2000, 2001).\n\nStriebel played on three U.S. National Teams, helping to claim world championships in 2002 and 2010, and a runner-up finish in 2006. He also enjoyed a 13-year professional career in Major League Lacrosse, earning all-star honors nine times and All-Pro status in 2007 & 2008. He was a part of three MLL championships and was selected as the Championship Game MVP in 2007. He finished his MLL career with 225 goals, 120 assists, and 355 points, ranking among the top 10 all-time in each category.\n\nA product of Gill, Mass., Striebel was inducted into the US Lacrosse Western Massachusetts Chapter Hall of Fame in 2014."}, {"url": "https://www.gazettenet.com/Matt-Striebel-will-be-inducted-into-National-Lacrosse-Hall-of-Fame-29390368", "page_content": "Lacrosse began as a hobby for Matt Striebel.\n\nHis sister, Jessica, played first and brought her stick home. He was a baseball fan and dreamed of becoming a major leaguer.\n\n“Like every kid in America,” the Northampton resident said.\n\nIntrigued, the Gill native started playing as a teenager for the Franklin County Lacrosse Club for Jeff Coulson, who now owns Indoor Action Sports in Greenfield.\n\n“Growing up here in western Mass., and I grew up in Gill, which was obviously not a hotbed of lacrosse at the time or really now. It’s such a dynamic combination of other sports you’re familiar growing up with,” Striebel said. “You get the best of all those worlds combined in one Frankenstein sport. For a lot of kids, and I see this all the time at camps, it just grabs you, and once it does you’re hooked for life.”\n\nLacrosse became Striebel’s passion and profession. He won championships at every level and worked to spread the spark lacrosse ignited in him. On Saturday, Striebel, 40, will earn one of the sport’s highest honors with his induction to the National Lacrosse Hall of Fame.\n\n“At a certain point, I’d had a career that was solid enough and significant enough that I had a pretty good idea that I would one day make it to the Hall of Fame. The part that was surprising to me was how quickly I got that call,” Striebel said. “It was a validating honor. It puts your career in a nice, cohesive narrative.”\n\nHe’ll be inducted as part of a nine-member class at the The Grand Lodge in Hunt Valley, Maryland, just outside Baltimore.\n\n“It’s increasingly starting to set in. There’s some behind the scenes getting tickets for people and organizing all that stuff that makes it seem like it’s more in the real world and less something that’s really special and exists as the culmination of a career,” Striebel said. “It’s sitting in a space that’s between about to be real and pretty fantastic.”\n\nStriebel received the call while out to lunch with his family at Green Bean in Northampton. It came from a Philadelphia number he didn’t recognize, so he let it go to voice mail. Rick Lake, the men’s lacrosse director of USA Lacrosse, was on the other end of the call.\n\n“My immediate assumption was they were calling because the annual giving campaigns had started up,” Striebel said. “As a veteran of three U.S. teams, they look to me to give donations every once in a while and I assumed that’s what it was.”\n\nInstead, he found out he was being inducted alongside one of his longtime teammates and best friends Ryan Boyle. Boyle was a freshman at Princeton during Striebel’s senior year in 2001. They both played attack, but Boyle took all of the repetitions during fall practices since Striebel also played soccer for the Tigers.\n\nAs a returning All-American and team captain, Striebel tried to coexist with the freshman.\n\n“It was pretty apparent that Ryan was just better at it than I was, even as a freshman,” said Striebel, who attended The Hotchkiss School before Princeton. “The coaches brought me into their office and said, ‘Striebs you had a great run, we’re going to move you to midfield.’ For about 48 hours, I hated Ryan.”\n\nBut he realized that if the team was going to compete for a title, that would give the Tigers the best chance. Princeton won the national championship for the second time in Striebel’s career.\n\nStriebel began his professional career the next season during the inaugural season of Major League Lacrosse. He played for the Bridgeport Barrage, and three years later after the franchise relocated to Philadelphia, they asked Striebel if Boyle was worth a first-round draft pick.\n\n“I said he was and it would make our team better instantly,” Striebel said.\n\nThe Barrage won the MLL title, one of three in Striebel’s 15-year career. He and Boyle also played together for the USA on three World Lacrosse Championship teams.\n\nBoyle started a company called Trinity Lacrosse in 2005 and brought Striebel on as the program’s national director, which is his full-time job. They run camps and events all over the country.\n\n“The fact that I was able to go in with Ryan, that’s such a poetic bookend to our career and our friendship in the sport,” Striebel said.\n\nStriebel was first called up to the U.S. national team in 2002, less than a year after the September 11 terrorist attacks. The Americans took gold in Perth, Australia.\n\n“To be able to put on a jersey and represent your country playing a sport you love, there aren’t many honors that are more fulfilling than that,” Striebel said.\n\nHe enjoyed teaming up with other elite players in a competitive setting. Unlike All-star games, which Striebel played in eight times, the world championships provided a goal to achieve rather than an exhibition.\n\nWhen the U.S. lost the 2006 final – the first time they hadn’t won gold since 1978 – Striebel and his team left their medals in the dormitories in Ontario.\n\n“It was a really difficult loss to stomach,” he said.\n\nStriebel and the USA redeemed themselves in 2010 in England with the nation’s ninth gold medal.\n\n“I’ve been fortunate enough to win a lot of incredible championships in my career, and those USA championships are definitely up there,” Striebel said. “I’ve had a fortunate career.”\n\nHe recognizes that fortune and works to give others the same opportunity. Striebel coached Northampton High School for seven years before stepping down following the 2018 season.\n\n“I’ve been fortunate enough to go all over the country and around the world spreading the gospel of lacrosse and sharing the sport with people who care about it,” Striebel said. “It has a strong fraternity of followers. It’s been amazing to see that expand to include so many people and so many places.”\n\nTrilogy partners with organizations like Harlem Lacrosse to bring the game to areas and environments that haven’t historically played it.\n\n“For many years it’s been a predominantly white, wealthy, preppy sport, and that’s not sustainable and that’s not the best version of lacrosse that’s going to exist,” Striebel said. “When the sport is available to kids all across the country whether you’re living in an inner city neighborhood or Fairfield County, Connecticut, that’s when the sport is really going to have achieved its peak.”"}, {"url": "https://www.gazettenet.com/Lax-11604458", "page_content": "When Matt Striebel met Jarrod Neumann in the parking lot of Northampton High School in 2012, there was a simple conversation about lacrosse.\n\nStriebel was a decorated lacrosse player. He played in the Ivy League for Princeton before moving on to a 15-year professional career in Major League Lacrosse.\n\n“I just saw an athletic monster,” Striebel said. “I recognized early on that he would succeed. He just ran with it.”\n\nNeumann had never played lacrosse, but wanted to give the sport a try during his senior year for the Blue Devils.\n\n“I wouldn’t have played lacrosse without Matt,” Neumann said. “He is the reason I gave it a shot. I owe him the world.”\n\nAfter a talk with Northampton basketball coach Rey Harp, Striebel knew that Neumann would excel immediately if he played defense.\n\nNeumann could guard any position during his time playing basketball for the Blue Devils. With his fundamentals in lacrosse lacking due to inexperience, he could let his athleticism take over, smothering the other team’s attack.\n\n“It’s the same concepts in basketball and lacrosse defense,” Neumann said. “I had never even touched a stick. But Matt said ‘just move your feet.’”\n\nFast forward to 2017. Neumann is playing in the MLL for the Florida Launch after finishing a college career at Providence where he was named Big east Defensive Player of the Year this spring.\n\nFlorida qualified for the postseason for the first time this past weekend. It will open the playoffs on Aug. 12.\n\n“I feel so lucky that I can continue to play at the highest level,” Neumann said.\n\nStriebel’s guidance helped Neumann’s progress exponentially.\n\n“I would come early and stay late with Matt,” Neumann said. “He’s one of the greatest ever. He has a wealth of knowledge that most coaches don’t have.”\n\nWhile Neumann is preparing for the playoffs, Striebel is playing in a Legends Alumni Game at the Lake Placid Summit Classic on Friday.\n\n“I played the first 15 years of the league,” Striebel said. “It’s cool to have everyone together and playing. We’ll try to make some cool plays and not to hurt ourselves.”\n\nAt Princeton, Striebel scored 43 goals with 74 assists. During his MLL career, he scored 184 goals with 97 assists.\n\nStriebel stayed in contact with Neumann as his lacrosse path took him to Bridgton Academy before heading to Providence.\n\n“We talk just about every week,” Striebel said. “When he was going through the draft process I was encouraging GMs to take a chance on him.”\n\nThe Florida Launch selected Neumann with the 25th pick of the MLL Draft.\n\nNeumann is in graduate school at Providence and plans to help coach the Friars. (On Launch game days, he flies to where the team is playing.)\n\n“Everyone wants to stay in college,” Neumann said. “This is a great way for me to keep my eye on them.”\n\nAlong with coaching at Northampton, Striebel works for Trilogy Lacrosse, a national program.\n\nThere are no plans for Striebel to coach at a higher level.\n\n“In college, the percentage is much higher for recruiting than actual coaching,” Striebel said. “In high school when you walk off the field, it doesn’t always follow you like it does in college.”\n\nIn Florida’s regular season finale against the Cannons in Boston on Saturday, Neumann left a ticket for his old coach.\n\nWhen he found out that Striebel could not make the game, his response was to score his first goal as a professional.\n\n“I did that to stick it to him a bit,” Neumann said. “That’s the kind of relationship we have.”"}, {"url": "https://trilogylacrosse.com/our-staff/matt-striebel/", "page_content": "“I play lacrosse because I love it—the speed, the intensity, the teamwork, the sense of fulfillment and satisfaction that comes when success is achieved over and through adversity. At Trilogy Lacrosse, we approach the teaching and coaching of lacrosse with the same passion and commitment to excellence that we bring to our play. Nowhere else can you find a community of lacrosse players and coaches so dedicated to the singular values of the game.”\n\nDuring his career Matt was among the most elite class of lacrosse players in the world. At his peak he was widely considered the best midfielder in the game. His unique combination of athleticism, versatility, and intelligence set him apart as a dynamic playmaker and offensive force. A champion at every level of the game, Matt set professional records in All Star appearances and games played, while compiling one of the most impressive statistical careers for a midfielder ever. His vast knowledge and passion for the game of lacrosse distinguish him as a Trilogy instructor. His energy is contagious and quickly picked up by his players. When not coaching lacrosse, Matt can be found playing pick-up basketball in high school gyms across America. He earned a BA in English from Princeton University and an MFA in Creative Writing from the University of Iowa.\n\nUS Lacrosse National Hall of Fame Class of 2019"}, {"url": "https://www.statscrew.com/lacrosse/stats/p-striemat001", "page_content": "Matt Striebel\n\nMatt Striebel\n\nBorn: January 12, 1979\n\nIowa City, IA\n\nPosition: M\n\nHeight: 6'1\"\n\nWeight: 190\n\nCareer: 2001-2015\n\n\n\nMatt Striebel scored 225 goals and recorded 117 assists in his 167-game career with the Bridgeport Barrage, Philadelphia Wings, Philadelphia Barrage, Barrage, Chicago Machine, Rochester Rattlers , Boston Cannons, New York Lizards and Chesapeake BayHawks. He began playing during the 2001 season and last took the field during the 2015 campaign.\n\nClick on column headings to sort.\n\nScoring:\n\nPostseason - Scoring:"}, {"url": "https://www.hotchkiss.org/athletics/post/~board/athletics-news/post/striebel-97-inducted-into-lacrosse-hall-of-fame", "page_content": "Striebel ’97 Inducted Into Lacrosse Hall of Fame\n\nMatt Striebel ’97 was inducted into the National Lacrosse Hall of Fame in a ceremony held in Maryland on Oct. 19.\n\nIn attendance was longtime boys lacrosse coach Chris Burchfield, who coached Striebel during his time in Lakeville.\n\n“When [Striebel] enrolled, I knew we had the privilege of working with a true scholar/athlete,” said Burchfield. “He never took his talents for granted while at Hotchkiss, and he remained impressively dedicated to his work, his teammates, and his school.\n\nIn his citation from the committee, Striebel was lauded for his play in college, as a professional, and also as a member of US national teams.\n\n“Striebel will be inducted as a truly great player. He was a two-time All-American at Princeton University, splitting time during his career between attack and midfield. Striebel helped the Tigers capture two NCAA championships during his career, winning the title in 1998 and 2001. He was also a part of four Ivy League championships, and earned all-Ivy honors three times (1999, 2000, 2001).\n\n“Striebel played on three U.S. National Teams, helping to claim world championships in 2002 and 2010, and a runner-up finish in 2006. He also enjoyed a 13-year professional career in Major League Lacrosse, earning all-star honors nine times and All-Pro status in 2007 & 2008. He was a part of three MLL championships, and selected as the Championship Game MVP in 2007. He finished his MLL career with 225 goals, 120 assists, and 355 points, ranking among the top 10 all-time in each category.\n\n“A product of Gill, Mass., Striebel was inducted into the US Lacrosse Western Massachusetts Chapter Hall of Fame in 2014,” according to a release from the Hall of Fame."}], "Matt Striebel played in the National Lacrosse League (NLL).": [{"url": "https://www.wikiwand.com/en/Matt_Striebel", "page_content": "Matt Striebel (born January 12, 1979) is a former professional lacrosse midfielder who played professional field lacrosse in the Major League Lacrosse (MLL) for the New York Lizards and formerly played professional box lacrosse in the National Lacrosse League (NLL). He starred as a member of the Princeton Tigers men's lacrosse team from 1998 through 2001 and the Princeton Tigers men's soccer team from 1997 through 2000.\n\nAmerican lacrosse player (born 1979)\n\nQuick facts: Born, Nationality, Height, Weight, Position... ▼\n\nDuring his time at Princeton, the team qualified for the NCAA Men's Lacrosse Championship all four years, reached the championship game three times, won the championship game twice and won four Ivy League championships. He was a two-time honorable mention United States Intercollegiate Lacrosse Association (USILA) All-American and three-time All-Ivy League selection (once first team, twice second team). He was also an All-Ivy league performer in soccer and earned Princeton co-athlete of the year (all-sport) honors as a senior.\n\nAs a professional, he has earned three MLL championships, a league record eight MLL All-Star recognitions and an MLL championship game MVP award. He is also a three-time Team USA representative and two-time World Lacrosse Championship gold medalist.\n\nIn 2019, Striebel was elected to the National Lacrosse Hall of Fame.[1]"}, {"url": "https://www.usalaxmagazine.com/usa-insider/senior-men/hall-of-fame-call-a-final-victory-for-the-versatile-matt-striebel", "page_content": "Nine lacrosse legends — Ryan Boyle, Charlie Coker, Kara Ariza Cooke, Rachael Becker DeCecco, Sarah Forbes, Cathy Reese, Paul Schimoler, Richard Speckmann and Matt Striebel — will be inducted into the National Lacrosse Hall of Fame Oct. 19 at The Grand Lodge in Hunt Valley, Md. These are their stories.\n\nMatt Striebel was out to lunch with his wife and two kids, and then he saw his phone ring. He didn’t recognize the number, so he let it go straight to voicemail, as one does.\n\nThe message, he quickly realized, was from US Lacrosse. It was right around the annual giving time for the men’s national team, Striebel said, so he called back to let them know his check was ready to be sent out.\n\nBut on the other line was Rick Lake, men's game senior manager at US Lacrosse. His message was a tad different.\n\n“He goes, ‘Matt, we're actually calling you to let you know made the Hall of Fame,’” the Gill, Mass., native recalled. “It was an amazing moment that was made doubly better that I found out I was going in with Ryan (Boyle). As soon as I hung up that phone call, I called Ryan and was like, ‘This is crazy. Can you believe it?’ It was the perfect, poetic bookend to a journey of our playing careers.”\n\n\"We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?\" — Matt Striebel describing a meeting Bill Tierney his senior year.\n\nStriebel is one of nine set for the National Lacrosse Hall of Fame’s Class of 2019, entering with his close friend, Boyle — a fellow champion at Princeton, with the U.S. national team and in Major League Lacrosse. They now work together at Trilogy Lacrosse, the company Boyle co-founded, though their roots extend back to 2001 at Princeton.\n\nThe Tigers, then coached by fellow Hall of Fame member Bill Tierney, had Boyle entering as a blue-chip recruit down on attack. Striebel, a captain and returning All-American on attack, was excited by playing with a player of his quality. Plans went another direction, though.\n\n“We tried to coexist for two games, then I went into the coach's office and they basically looked at me and said ‘Striebs, it's been a great run. How about you try midfield?,’” said Striebel, who gave himself 24 hours to sulk before embracing his new role.\n\n“I decided it's my senior year, I really want to win and am here to win a national championship. From a lacrosse standpoint, it's the best thing that could have happened to me, because I am more of a midfielder talent-wise and it made us a better team and opened opportunities on the U.S. team and as a professional.”\n\nThat’s not hyperbole from Striebel, either. That 2001 season marked Striebel’s second national championship while at Princeton, as well as a fourth straight Ivy League championship. On the national stage, he captured gold at the World Lacrosse championships in 2002 (Perth) and 2010 (Manchester), plus silver in 2006 (Ontario).\n\nStriebel also secured three MLL championships (2004, ‘06, ‘07) with the Philadelphia Barrage, earning earning MLL All-Star honors on nine occasions. Boyle was right there at nearly every step.\n\n“I’m far happier for him than I am for myself,” Boyle said.\n\n\n\n\n\n\n\n\n\n\n\n“I often say there are some guys out there who are A-plus in a couple categories. Oh, he's an A-plus shooter or an A-plus dodger,” Striebel began. “For me, I think I just had the versatility to be B-plus, A-minus guy in a lot of different categories. That allowed me to change and adapt my game as I got older.\n\n“The first 10 years I was in the MLL, I think I took one two-point shot and it was on an open goal when we needed goal differential for the playoffs. Then as I got older, like a basketball player who's adding a different aspect, I became more of a shooter so I could develop other parts of my game and maintain relevance as a player.”\n\nBut like most great players, Striebel’s connection with the game didn’t cease once he put away the pads and cleats. He’s spent the last seven years coaching at Northampton High School in Massachusetts, plus working for Trilogy. He’s especially close with coaches in the Colonial Athletic Association, so he’ll often swing by nearby UMass-Amherst to catch games and chat with old friends.\n\nThose experiences also remind Striebel of his time at Hotchkiss, in Lakeville, Conn., during the mid-1990s. He said that was the “dawn of the post-graduate lacrosse era” at New England prep schools, where he played alongside several NHL draft picks.\n\n“You had kids who played multiple sports at a very high level,” Striebel said. “There were great athletes and for better or for worse, lacrosse has become a 365-day endeavor where kids have an opportunity to play every day.”"}, {"url": "https://www.usalacrosse.com/player-profile/matthew-striebel", "page_content": "Striebel was inducted as a truly great player. He was a two-time All-American at Princeton, splitting time during his career between attack and midfield. Striebel helped the Tigers capture two NCAA championships during his career, winning the title in 1998 and 2001. He was also a part of four Ivy League championships, and earned All-Ivy honors three times (1999, 2000, 2001).\n\nStriebel played on three U.S. National Teams, helping to claim world championships in 2002 and 2010, and a runner-up finish in 2006. He also enjoyed a 13-year professional career in Major League Lacrosse, earning all-star honors nine times and All-Pro status in 2007 & 2008. He was a part of three MLL championships and was selected as the Championship Game MVP in 2007. He finished his MLL career with 225 goals, 120 assists, and 355 points, ranking among the top 10 all-time in each category.\n\nA product of Gill, Mass., Striebel was inducted into the US Lacrosse Western Massachusetts Chapter Hall of Fame in 2014."}, {"url": "https://peoplepill.com/people/matt-striebel/", "page_content": "Matt Striebel (born January 12, 1979) is a high school lacrosse coach at Northampton High School and a professional lacrosse midfielder who plays professional field lacrosse in the Major League Lacrosse (MLL) for the New York Lizards and formerly played professional box lacrosse in the National Lacrosse League (NLL). He starred as a member of the Princeton Tigers men's lacrosse team from 1998 through 2001 and the Princeton Tigers men's soccer team from 1997 through 2000.\n\nDuring his time at Princeton, the team qualified for the NCAA Men's Lacrosse Championship all four years, reached the championship game three times, won the championship game twice and won four Ivy League championships. He was a two-time honorable mention United States Intercollegiate Lacrosse Association (USILA) All-American and three-time All-Ivy League selection (once first team, twice second team). He was also an All-Ivy league performer in soccer and earned Princeton co-athlete of the year (all-sport) honors as a senior.\n\nAs a professional, he has earned three MLL championships, a league record eight MLL All-Star recognitions and an MLL championship game MVP award. He is also a three-time Team USA representative and two-time World Lacrosse Championship gold medalist.\n\nBackground\n\nStriebel is a native of Gill, Massachusetts. He first got involved in lacrosse at about the age of 12 or 13 when his sister brought home the Brine Lightning stick that he began to play with. Striebel attended The Hotchkiss School in Lakeville, Connecticut. Striebel first started playing lacrosse when he was a youth for Jeff Coulson, owner of Indoor Action Sports, in Greenfield, Massachusetts.\n\nHe also attended the Writers Workshop at The University of Iowa in Iowa City, Iowa, earning a Master of Fine Arts degree in 2007. He had earned a Bachelor of Arts degree in English at Princeton.\n\nCollege career\n\nAt Princeton he was a two-time honorable mention USILA All-American Team selection in 2000 and 2001. He was a second team All-Ivy League selection in 1999 and 2000 and a first team selection in 2001. He was a 2001 USILA Scholar All-American. During his four-year career, Princeton went undefeated in Ivy League Conference play with consecutive 6–0 records. Princeton was invited to the 1999 tournament, was a finalist in the 2000 tournament and earned championships in both the 1998 and 2001 tournaments, bringing the schools consecutive tournament invitations streak to twelve. In Striebel's 2001 senior season, the arrival of freshman Ryan Boyle necessitated that he move from attack to midfield. The move came the first practice after Princeton's 14–8 loss to Syracuse. Striebel had previously been orchestrating the Princeton offense from behind the goal, but on March 25, 2001, head coach Bill Tierney made the switch. During the 1998 season when Princeton won the NCAA title, Striebel had been playing midfield. Princeton went undefeated for the rest of the 2001 season after the switch.\n\nDuring the 2000 NCAA tournament, Striebel scored two goals in the quarterfinals 10–7 victory against Maryland, and he added another in the 13–7 championship game loss to Syracuse. Striebel was one of the leading scorers on the team that season, and he was the team leader in assists entering the final four weekend. In the quarterfinals of the 2001 NCAA championship tournament, Striebel had an assist in the 8–7 victory over Loyola. In the 12–11 semifinal victory over Towson State, Striebel had a goal and an assist. Striebel scored twice in the 2001 championship game and also added two assists. He was selected to the All-tournament team.\n\nStriebel was also an honorable mention All-Ivy League soccer player in 2000 as well as a 2000 Academic All-Ivy selection in soccer. As a junior, Striebel was a member of the 1999 Ivy League Champion Princeton Soccer team that earned an invitation to the 1999 NCAA Men's Division I Soccer Championship. The team posted a 10–5–2 (5–1–1 Ivy League) record.\n\nAs of 2010, Striebel ranks eighth on the Princeton Lacrosse career assists list and eleventh on the Princeton soccer career assists list. As a senior, he was honored as one of the three athletes of the year on campus (along with Dennis Norman and Scott Denbo)\n\nProfessional career\n\nStriebel began his career in the league's inaugural 2001 MLL season with the Bridgeport Barrage and stayed with the team as it remained in Bridgeport, Connecticut until the 2003 season. Then he moved with the franchise and played with the Philadelphia Barrage from 2004 through 2008. In 2009 MLL season, he joined the Chicago Machine and then became a member of the Rochester Rattlers for the 2011 MLL season. Striebel and Boyle were reunited for five seasons in Philadelphia. Striebel has helped the Barrage to win three Steinfeld Cup championships in 2004, 2006, and 2007. In the 2004 championship game, he scored what the Baltimore Sun described as the clinching goal in the 13–11 victory over the Boston Cannons. In the 2006 game, he had nine points (four goals, including one two-pointer and four assists). He was presented with the 2007 Steinfeld Cup Game Most Valuable Player Award. Striebel appeared in the 2005 & 2007 Major League Lacrosse All-Star Games. In the 2006 All-Star game he represented Team USA by scoring a goal and two assists. Striebel was an MLL All-Pro selection in 2007 and 2008. Striebel was an MLL All-Star in 2011. In 2012, Striebel set the MLL record for most All-Star games with eight (consecutive).\n\nStriebel served as an assistant coach for Princeton Men's Lacrosse in 2005. Striebel also spent time assisting the men's lacrosse team at Iowa during his time there. As of 12 April 2012, Striebel currently coaches the Varsity Boys Lacrosse team at Northampton High School in Northampton, MA which is just south of his hometown. He also played professionally in 2012 and 2013.\n\nIn addition to his field lacrosse career, Striebel played one season in 2003 of box lacrosse with the Philadelphia Wings in the National Lacrosse League. Streibel was traded by the Wings to the New York Saints in February 2003. He never appeared in a game for the Saints. Striebel has also played professional soccer for the Western Massachusetts Pioneers.\n\nStriebel has represented Team USA in the World Lacrosse Championship in 2002, 2006, and 2010. In the 2002 World Lacrosse Championship semifinal match against the Iroquois Nation, Striebel scored a goal in the 18–8 victory. Striebel also serves as a representative of Trilogy Lacrosse.\n\nOn November 11, 2013, Striebel was traded to the New York Lizards.\n\nStatistics\n\nMLL\n\nRegular Season Playoffs Season Team GP G 2ptG A Pts LB PIM GP G 2ptG A Pts LB PIM 2001 Bridgeport 8 4 0 8 12 10 0 -- -- -- -- -- -- -- 2002 Bridgeport 9 10 0 5 15 22 0 2 2 0 1 3 4 0 2003 Bridgeport 12 16 0 2 18 19 0 -- -- -- -- -- -- -- 2004 Philadelphia 12 15 0 12 27 14 0.5 2 2 0 1 3 4 0 2005 Philadelphia 12 22 0 13 35 25 0.5 -- -- -- -- -- -- -- 2006 Philadelphia 11 23 0 12 35 29 0 2 9 1 5 15 2 0 2007 Philadelphia 12 25 1 13 39 22 0 2 5 0 4 9 4 0 2008 Philadelphia 12 31 0 11 42 21 0 1 2 0 0 2 1 0 2009 Chicago 12 13 1 8 22 18 1.5 -- -- -- -- -- -- -- 2010 Chicago 10 12 0 5 17 14 0 -- -- -- -- -- -- -- 2011 Rochester 12 13 4 8 25 16 3.0 -- -- -- -- -- -- -- 2012 Rochester 14 14 8 10 32 13 0.5 -- -- -- -- -- -- -- MLL Totals 122 184 6 97 287 210 2.5 7 18 1 10 29 11 0\n\nPrinceton University"}, {"url": "https://www.statscrew.com/lacrosse/stats/p-striemat001", "page_content": "Matt Striebel\n\nMatt Striebel\n\nBorn: January 12, 1979\n\nIowa City, IA\n\nPosition: M\n\nHeight: 6'1\"\n\nWeight: 190\n\nCareer: 2001-2015\n\n\n\nMatt Striebel scored 225 goals and recorded 117 assists in his 167-game career with the Bridgeport Barrage, Philadelphia Wings, Philadelphia Barrage, Barrage, Chicago Machine, Rochester Rattlers , Boston Cannons, New York Lizards and Chesapeake BayHawks. He began playing during the 2001 season and last took the field during the 2015 campaign.\n\nClick on column headings to sort.\n\nScoring:\n\nPostseason - Scoring:"}, {"url": "https://www.hotchkiss.org/athletics/post/~board/athletics-news/post/striebel-97-inducted-into-lacrosse-hall-of-fame", "page_content": "Striebel ’97 Inducted Into Lacrosse Hall of Fame\n\nMatt Striebel ’97 was inducted into the National Lacrosse Hall of Fame in a ceremony held in Maryland on Oct. 19.\n\nIn attendance was longtime boys lacrosse coach Chris Burchfield, who coached Striebel during his time in Lakeville.\n\n“When [Striebel] enrolled, I knew we had the privilege of working with a true scholar/athlete,” said Burchfield. “He never took his talents for granted while at Hotchkiss, and he remained impressively dedicated to his work, his teammates, and his school.\n\nIn his citation from the committee, Striebel was lauded for his play in college, as a professional, and also as a member of US national teams.\n\n“Striebel will be inducted as a truly great player. He was a two-time All-American at Princeton University, splitting time during his career between attack and midfield. Striebel helped the Tigers capture two NCAA championships during his career, winning the title in 1998 and 2001. He was also a part of four Ivy League championships, and earned all-Ivy honors three times (1999, 2000, 2001).\n\n“Striebel played on three U.S. National Teams, helping to claim world championships in 2002 and 2010, and a runner-up finish in 2006. He also enjoyed a 13-year professional career in Major League Lacrosse, earning all-star honors nine times and All-Pro status in 2007 & 2008. He was a part of three MLL championships, and selected as the Championship Game MVP in 2007. He finished his MLL career with 225 goals, 120 assists, and 355 points, ranking among the top 10 all-time in each category.\n\n“A product of Gill, Mass., Striebel was inducted into the US Lacrosse Western Massachusetts Chapter Hall of Fame in 2014,” according to a release from the Hall of Fame."}, {"url": "https://trilogylacrosse.com/our-staff/matt-striebel/", "page_content": "“I play lacrosse because I love it—the speed, the intensity, the teamwork, the sense of fulfillment and satisfaction that comes when success is achieved over and through adversity. At Trilogy Lacrosse, we approach the teaching and coaching of lacrosse with the same passion and commitment to excellence that we bring to our play. Nowhere else can you find a community of lacrosse players and coaches so dedicated to the singular values of the game.”\n\nDuring his career Matt was among the most elite class of lacrosse players in the world. At his peak he was widely considered the best midfielder in the game. His unique combination of athleticism, versatility, and intelligence set him apart as a dynamic playmaker and offensive force. A champion at every level of the game, Matt set professional records in All Star appearances and games played, while compiling one of the most impressive statistical careers for a midfielder ever. His vast knowledge and passion for the game of lacrosse distinguish him as a Trilogy instructor. His energy is contagious and quickly picked up by his players. When not coaching lacrosse, Matt can be found playing pick-up basketball in high school gyms across America. He earned a BA in English from Princeton University and an MFA in Creative Writing from the University of Iowa.\n\nUS Lacrosse National Hall of Fame Class of 2019"}, {"url": "https://www.nll.com/stats/all-player-stats/", "page_content": "3rd Party Cookies\n\nThis website uses Google Analytics and Facebook to collect anonymous information such as the number of visitors to the site, and the most popular pages.\n\nKeeping this cookie enabled helps us to improve our website.\n\nEnable or Disable Cookies"}, {"url": "https://www.gazettenet.com/Matt-Striebel-will-be-inducted-into-National-Lacrosse-Hall-of-Fame-29390368", "page_content": "Lacrosse began as a hobby for Matt Striebel.\n\nHis sister, Jessica, played first and brought her stick home. He was a baseball fan and dreamed of becoming a major leaguer.\n\n“Like every kid in America,” the Northampton resident said.\n\nIntrigued, the Gill native started playing as a teenager for the Franklin County Lacrosse Club for Jeff Coulson, who now owns Indoor Action Sports in Greenfield.\n\n“Growing up here in western Mass., and I grew up in Gill, which was obviously not a hotbed of lacrosse at the time or really now. It’s such a dynamic combination of other sports you’re familiar growing up with,” Striebel said. “You get the best of all those worlds combined in one Frankenstein sport. For a lot of kids, and I see this all the time at camps, it just grabs you, and once it does you’re hooked for life.”\n\nLacrosse became Striebel’s passion and profession. He won championships at every level and worked to spread the spark lacrosse ignited in him. On Saturday, Striebel, 40, will earn one of the sport’s highest honors with his induction to the National Lacrosse Hall of Fame.\n\n“At a certain point, I’d had a career that was solid enough and significant enough that I had a pretty good idea that I would one day make it to the Hall of Fame. The part that was surprising to me was how quickly I got that call,” Striebel said. “It was a validating honor. It puts your career in a nice, cohesive narrative.”\n\nHe’ll be inducted as part of a nine-member class at the The Grand Lodge in Hunt Valley, Maryland, just outside Baltimore.\n\n“It’s increasingly starting to set in. There’s some behind the scenes getting tickets for people and organizing all that stuff that makes it seem like it’s more in the real world and less something that’s really special and exists as the culmination of a career,” Striebel said. “It’s sitting in a space that’s between about to be real and pretty fantastic.”\n\nStriebel received the call while out to lunch with his family at Green Bean in Northampton. It came from a Philadelphia number he didn’t recognize, so he let it go to voice mail. Rick Lake, the men’s lacrosse director of USA Lacrosse, was on the other end of the call.\n\n“My immediate assumption was they were calling because the annual giving campaigns had started up,” Striebel said. “As a veteran of three U.S. teams, they look to me to give donations every once in a while and I assumed that’s what it was.”\n\nInstead, he found out he was being inducted alongside one of his longtime teammates and best friends Ryan Boyle. Boyle was a freshman at Princeton during Striebel’s senior year in 2001. They both played attack, but Boyle took all of the repetitions during fall practices since Striebel also played soccer for the Tigers.\n\nAs a returning All-American and team captain, Striebel tried to coexist with the freshman.\n\n“It was pretty apparent that Ryan was just better at it than I was, even as a freshman,” said Striebel, who attended The Hotchkiss School before Princeton. “The coaches brought me into their office and said, ‘Striebs you had a great run, we’re going to move you to midfield.’ For about 48 hours, I hated Ryan.”\n\nBut he realized that if the team was going to compete for a title, that would give the Tigers the best chance. Princeton won the national championship for the second time in Striebel’s career.\n\nStriebel began his professional career the next season during the inaugural season of Major League Lacrosse. He played for the Bridgeport Barrage, and three years later after the franchise relocated to Philadelphia, they asked Striebel if Boyle was worth a first-round draft pick.\n\n“I said he was and it would make our team better instantly,” Striebel said.\n\nThe Barrage won the MLL title, one of three in Striebel’s 15-year career. He and Boyle also played together for the USA on three World Lacrosse Championship teams.\n\nBoyle started a company called Trinity Lacrosse in 2005 and brought Striebel on as the program’s national director, which is his full-time job. They run camps and events all over the country.\n\n“The fact that I was able to go in with Ryan, that’s such a poetic bookend to our career and our friendship in the sport,” Striebel said.\n\nStriebel was first called up to the U.S. national team in 2002, less than a year after the September 11 terrorist attacks. The Americans took gold in Perth, Australia.\n\n“To be able to put on a jersey and represent your country playing a sport you love, there aren’t many honors that are more fulfilling than that,” Striebel said.\n\nHe enjoyed teaming up with other elite players in a competitive setting. Unlike All-star games, which Striebel played in eight times, the world championships provided a goal to achieve rather than an exhibition.\n\nWhen the U.S. lost the 2006 final – the first time they hadn’t won gold since 1978 – Striebel and his team left their medals in the dormitories in Ontario.\n\n“It was a really difficult loss to stomach,” he said.\n\nStriebel and the USA redeemed themselves in 2010 in England with the nation’s ninth gold medal.\n\n“I’ve been fortunate enough to win a lot of incredible championships in my career, and those USA championships are definitely up there,” Striebel said. “I’ve had a fortunate career.”\n\nHe recognizes that fortune and works to give others the same opportunity. Striebel coached Northampton High School for seven years before stepping down following the 2018 season.\n\n“I’ve been fortunate enough to go all over the country and around the world spreading the gospel of lacrosse and sharing the sport with people who care about it,” Striebel said. “It has a strong fraternity of followers. It’s been amazing to see that expand to include so many people and so many places.”\n\nTrilogy partners with organizations like Harlem Lacrosse to bring the game to areas and environments that haven’t historically played it.\n\n“For many years it’s been a predominantly white, wealthy, preppy sport, and that’s not sustainable and that’s not the best version of lacrosse that’s going to exist,” Striebel said. “When the sport is available to kids all across the country whether you’re living in an inner city neighborhood or Fairfield County, Connecticut, that’s when the sport is really going to have achieved its peak.”"}, {"url": "https://www.celebsagewiki.com/matt-striebel", "page_content": "Age, Biography and Wiki\n\nMatt Striebel was born on 12 January, 1979 in Gill, Massachusetts, United States. Discover Matt Striebel's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 44 years old?\n\nPopular As N/A Occupation N/A Age 44 years old Zodiac Sign Capricorn Born 12 January 1979 Birthday 12 January Birthplace Gill, Massachusetts, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 12 January. He is a member of famous with the age 44 years old group.\n\nMatt Striebel Height, Weight & Measurements\n\nAt 44 years old, Matt Striebel height is 6 ft 1 in (1.85 m) and Weight 190 pounds (86 kg).\n\nPhysical Status Height 6 ft 1 in (1.85 m) Weight 190 pounds (86 kg) Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nMatt Striebel Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Matt Striebel worth at the age of 44 years old? Matt Striebel’s income source is mostly from being a successful . He is from United States. We have estimated Matt Striebel's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nMatt Striebel Social Network\n\nInstagram Linkedin Twitter Matt Striebel Twitter Facebook Wikipedia Matt Striebel Wikipedia Imdb\n\nTimeline"}]}