{"Bob Miller was a member of the Bills' AFL championship teams in 1964 and 1965.": [{"url": "https://www.britannica.com/topic/Buffalo-Bills", "page_content": "Buffalo Bills, American professional football franchise that plays in the American Football Conference (AFC) of the National Football League (NFL) and is based in Buffalo. As a member of the American Football League (AFL), the Bills won two league championships (1964 and 1965), and, while playing in the NFL (after the merger of the AFL and the NFL in 1970), they appeared in a record four consecutive Super Bowls (1991–94), losing on each occasion.\n\n(Read Walter Camp’s 1903 Britannica essay on inventing American football.)\n\nBritannica Quiz Sports Quiz\n\nThe Bills were one of the eight founding members of the AFL (1960). They were one of the worst teams in the league in their first two seasons, but the addition of quarterback Jack Kemp and punishing running back Cookie Gilchrist during the 1962 season helped turn around the franchise’s fortunes. That year Gilchrist was named the AFL’s Most Valuable Player, and the next he set a league record by rushing for 243 yards in a game. In 1963, his first full season with the team, Kemp guided the Bills to a playoff appearance. The following year the Bills won 12 of their 14 games and finished with the AFL’s highest-ranked offense and defense. To cap off the season, Buffalo defeated the San Diego Chargers to win its first championship in only its fifth year of existence. The Bills repeated their title-game victory over the Chargers in 1965, and in 1966 they again returned to the AFL championship game, only to lose to the Kansas City Chiefs and be denied entry into the inaugural AFL-NFL World Championship Game (now called the Super Bowl).\n\nBuffalo then entered into a prolonged period of losing seasons, including a league-worst 1–12–1 record in 1968 that gave the team the first selection in the 1969 NFL draft (the two leagues held a joint draft for three years before their merger in 1970), which it used to select running back O.J. Simpson. Running behind a powerful offensive line known as “The Electric Company” (because they “turned on the Juice”—an allusion to Simpson’s nickname), Simpson set a number of NFL rushing records in his nine years with the Bills, including having the league’s first 2,000-yard rushing season in 1973, but the team advanced to the playoffs only once over that span. The Bills continued to struggle for a few seasons after Simpson was traded to the San Francisco 49ers in 1978, but in 1980 they made their first of two consecutive postseason berths.\n\nThe Bills drafted quarterback Jim Kelly in the first round of the 1983 NFL draft. Kelly instead signed to play in the upstart United States Football League (USFL), and Buffalo posted league-worst 2–14 records in both 1984 and 1985. After the USFL folded in 1986, Kelly joined the Bills, who had retained his NFL rights. Head coach Marv Levy soon took advantage of his quarterback’s skill set and instituted a no-huddle “K-Gun” offense (named after Kelly), which was based on a series of fast-paced passes and runs out of the shotgun formation. The Buffalo offense—which also featured future Hall of Fame running back Thurman Thomas and perennial Pro Bowl receiver Andre Reed—was one of the most prolific in the league at this time, and the team’s defense was anchored by all-time great defensive end Bruce Smith and star linebacker Cornelius Bennett. Between 1988 and 1993, the Bills made six straight playoff appearances (winning five division titles), and the team had a number of notable postseason exploits over those years.\n\nThe Bills advanced to their first Super Bowl in 1991, which they lost to the New York Giants after a last-second field goal attempt by Buffalo’s Scott Norwood missed wide right. The next year Buffalo returned to the Super Bowl, where it was defeated by the Washington Redskins. In the 1992 postseason’s Wild Card round, the Bills—playing without an injured Kelly—trailed the Houston Oilers by a score of 35–3 early in the third quarter. Backup quarterback Frank Reich rallied the Bills to five unanswered touchdowns, and Buffalo prevailed over the Oilers 41–38 in overtime. The Bills’ feat was the greatest point-differential comeback in NFL history, including both regular-season and postseason games. The team’s momentum continued throughout the AFC playoffs, and the Bills easily won two road games to advance to a third Super Bowl. There, however, they were soundly defeated by the Dallas Cowboys 52–17. Buffalo made it to a record fourth consecutive Super Bowl in 1994, but its rematch against the Cowboys ended in another disappointing loss in the big game. The Bills made two more postseason appearances in the mid-1990s but failed to advance past the second round of the playoffs each time, and the key members of the team’s 1990s dynasty all soon retired.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nQuarterback Doug Flutie led the Bills to brief postseason berths after both the 1998 and 1999 seasons, but the franchise fell back to the middle of the AFC standings in the 2000s. The financially struggling team was dogged by rumours of an impending move to Toronto, which only increased when the Bills agreed to play a series of “home” games (including both preseason and regular-season contests) in the Canadian city between 2008 and 2017. However, in October 2014 the Bills were sold to a local ownership group that vowed to keep the team in Buffalo, and the Toronto series was canceled soon thereafter. In 2017 the Bills posted a 9–7 record and ended a franchise-record 18-year postseason drought, but the team lost its opening playoff game. Two years later the team won 10 games—its first season with double-digit victories in 20 years—but again lost its first postseason contest."}, {"url": "https://www.buffalobills.com/news/a-history-of-bills-general-managers-10160193", "page_content": "Dick Gallagher (1960-1966)\n\n\"Long before Ralph Wilson placed his American Football League franchise in the City of Buffalo, New York, or even before he had a franchise to play anywhere, he knew who he wanted to be his general manager, if and when. That man was Dick Gallagher.\n\nIt has been said of Dick Gallagher, 'there is no more enthusiastic salesman of professional football.' The general manager accepts the compliment gracefully. \"I suppose I must sound, to some, as if I'm overboard about pro football. But, I'm completely dedicated to the game not only as my business, but as my way of life.\"\n\nIn addition to his other duties, the personable Irishman flashed his friendly smile, ready wit, and countless football stories...as the Browns No. 1 ambassador of goodwill, just as he has been the Bills since the day he signed on as general manager. He joined the Bills in 1960 as the second man ever hired for the team by Ralph Wilson Jr.\"\n\nBob Lustig (1967-1978)\"Bills Vice President and General Manager Bob Lustig has been an associate of Owner Ralph Wilson since 1948. When Wilson became one of the original members of the newly-born American Football League in 1960, he entrusted Lustig with the responsibility for signing many of the players on the original Bills roster. Four years later, Lustig was devoted full time to the Bills operation as a Vice President, soon taking on the General Manager title as well. Lustig was a key figure in the drive for a new stadium to house Buffalo's NFL franchise - a dream finally realized in 1973 with the dedication of a magnificent facility in Orchard Park, NY.\n\nFor all of his present association with football, Lustig's first love was baseball - a sport he played in the American Legion and later as a freshman at the University of Detroit. His college career was interrupted by Army service in World War II, where he saw action in the European theatre as a member of the 104th Infantry Division. He returned to Detroit following the war to complete his college education, then went to work for the Ralph Wilson Agency.\"\n\nStew Barber (1979-1982)\"Stew Barber who established a reputation for dependability and excellence as a player, was appointed to the new post of Vice President in Charge of Administration which assumes the duties of the General Manager. He will continue to supervise player signings, as well as coordinating the travel arrangements and directing the club's ticket and stadium operations.\n\nIn announcing Barber's position, Wilson said he was confident Stew would 'attack this challenge with the same skill and vigor that typified his career with the Buffalo Bills.' After a distinguished playing career at Penn State, Barber was drafted fourth round of the 1961 AFL selection meeting by Buffalo. Over the next nine seasons, Barber started 112 consecutive regularly-scheduled games, with a five-time All-AFL choice and appeared in five League All-Star games. He was a member of both the Bills AFL Championship teams.\"\n\nPat McGroder (1983)\"A lifelong friend of Ralph Wilson, Pat McGroder took charge of Buffalo's newly reorganized front office in March, 1983. A native of Buffalo, McGroder attended St. Joseph's Collegiate Institute and Hutchinson High School, and Canisius and Chattanooga Colleges. He founded the McKinley Liquor Company in 1942, and was the Buffalo Athletic Club's Sportsman of the Year in 1955.\n\n'I have never met a more dynamic personality of a more knowledgeable businessman,\" said Owner Ralph Wilson at the time of his GM appointment. \"He loves Buffalo and the Bills. He has been involved in the Western New York community throughout his lifetime and is widely-respected throughout the NFL.'\"\n\nTerry Bledsoe (1984-1985)\"Former New York Giants Assistant General Manager Terry Bledsoe, whose background includes such diverse subjects as sportswriting, labor-management negotiations and player contract bargaining, was appointed to the post of General Manager and Vice President after becoming acquainted with Ralph Wilson on the NFL Management Council. Bledsoe played a lead role as a negotiator representing the clubs in talks leading to the landmark 1977 Collective Bargaining Agreement.\n\nWhile born in Chicago, Bledsoe was raised in Clinton, Iowa, after his father was fatally wounded at the Battle of the Bulge. He was a sportswriter and columnist covering the Green Bay Packers from 1962-1968.\"\n\nBill Polian (1986-1992)\"Bill Polian has scouted football players, coached football players, and negotiated contracts with football players. That gives Polian, who also played the game at New York University, a unique perspective in his new position as General Manager of the Buffalo Bills.\n\nAt his introductory press conference, Polian said: 'I want to emphasize, as Mr. Wilson has emphasized to me, that he is committed to building a winning football team for the fans of Western New York. I share in the sentiment. Faith can move mountains, so the cliche goes...and maybe even a few Miami Dolphins on the goal line, as time goes by.'\n\nWhile Polian believes the turnaround on the field is already in motion, he isn't taking anything for granted. 'Our philosophy here is that we have to say please and thank you, and we have to sell like hell.'\n\nJohn Butler (1993-2000)\"After being named Executive Vice President and General Manager on February 5, 1993, Butler wasted no time in directing the Bills to an unprecedented fourth consecutive trip to the Super Bowl during the 1993 season. The Bills former Director of Player Personnel has always instillied an air of excitement and optimism to the general manager's office with an even mixture of football knowledge and friendly personality.\n\nButler entered the NFL in 1985 with the San Diego Chargers as a scout, after coaching for the United State Football League's Chicago Blitz. In fact, Butler has the unique distinction of serving with three head coaches who have posted over 100 NFL career victories in George Allen, Marv Levy and Don Coryell.\n\nHis contributions to the Bills in the area of talent adding speak for themselves when you look at the players on the Buffalo roster who were selected since his first draft in 1988, beginning with RB Thurman Thomas.\"\n\nTom Donahoe (2001-2005)\"Tom Donahoe became the eighth General Manager in Bills history in January of 2001 while also being named the team's President, marking the first time in franchise history that someone other than Ralph Wilson held the position.\n\nPrior to coming to Buffalo, Donahoe served as the football analyst for espn.com during the 2000 season. He served as a BLESTO scout for one year and started with the Steelers in 1985 before serving at various positions up to Director of Football Operations. During that time, the Steelers made seven playoff appearances.\n\nDonahoe coaches football and basketball and taught English for 15 years in the Pittsburgh area. Additionally, he served as athletic director and newspaper advisor and he is a member of the Seton-LaSalle High School Hall of Fame.\"\n\nMarv Levy (2006-2007)\"Marv Levy returned to the Bills organization as General Manager, a position he has never held in his 50+ years in football. During his Pro Football Hall of Fame coaching tenure in Buffalo, Levy worked very closely with Bill Polian and John Butler and learned the nuances of the position.\n\nLevy's return to the Bills family came about when Ralph Wilson called his good friend seeking advice for a new general manager. After a brief discussion of possible candidates, the Bills owner asked the magical question, 'What about you, Marv, coming back as general manager?' At that point, Mr. Wilson had found his new general manager and much of the credibility of the Buffalo Bills rich tradition had returned home.\"\n\nRuss Brandon (2008-2009)\"Russ Brandon was appointed Chief Operating Officer of the Buffalo Bills on January 8, 2008 with the responsibility of overseeing the day-to-day operations of the organization, which includes Football and Business Operations.\n\n'It has been my experience over the years that our greatest opportunity for success comes when we promote from within our own organization,' said owner Ralph C. Wilson Jr. 'I am confident in the skills possessed by our seasoned football front office staff. What I feel we need is a person with Russ Brandon's proven leadership skills to put it all together. He has worked very closely with me over the years and I am comfortable that he is up to the task.'\"\n\nBuddy Nix (2010-2012)\"The Bills organization embarked upon a new direction on December 31, 2009 by naming Buddy Nix General Manager and making him responsible for all football operations. Nix had rejoined the franchise earlier in the year as the National Scout. Prior to returning to Buffalo, he had served seven seasons with the San Diego Chargers, first as Director of Player Personnel, where he oversaw both pro and college scouting, and then as Assistant General Manager-Director of Player Personnel. Nix's first tenure with the Bills was as a Southeast region college scout from 1993 – 2000, where he first worked with former Bills GM John Butler before joining San Diego.\n\nNix's approach to building the Bills back into prominence centers around the Draft and with the first selection with Nix as GM, the team chose RB C.J. Spiller from Clemson, the player that some Draft evaluators and media felt was the best overall player. Nix's ability as a keen evaluator of talent also led to the Bills adding players in free agency who fit the team in key positions.\"\n\nDoug Whaley (2013- )\"It is with great pleasure to name Doug Whaley to the position of General Manager,\" said Bills President and CEO Russ Brandon. \"Doug has been involved in every level of player personnel throughout his career and he will lead our efforts in re-establishing a winning tradition for this organization and our great fans.\"\n\nWhaley, 40, who has seen his role expand almost annually since being originally hired as Assistant GM/Director of Pro Personnel three years ago, will now run the personnel side of the Bills franchise.\n\nThe year after Whaley was hired by the Bills he was promoted to oversee all Player Personnel as his presence in College Scouting was expanded in 2011. He has had a heavy hand in putting together the team's draft board over the past two years including this year's eight-player draft class.\n\nWhaley was also part of the four person search committee that conducted the exhaustive week long pursuit of a new head coach for the Bills in Arizona, which ultimately led the club to Doug Marrone."}, {"url": "https://www.profootballhof.com/news/2005/01/news-afl-championship-games/", "page_content": "Click on image of program for larger view.\n\n\n\n1960\n\nHouston Oilers 24, Los Angeles Chargers 16\n\nJan. 1, 1961\n\nGeorge Blanda helped the Houston Oilers become the AFL’s first league champions. The quarterback/kicker passed for three touchdowns, added the extra points, and connected on a field goal to guide the Oilers to a win over the Chargers. A crowd of 32,183 in Houston’s Jeppessen Stadium witnessed the first American Football League championship game.\n\n\n\n1961\n\nHouston Oilers 10, San Diego Chargers 3\n\nDec. 24, 1961\n\nIn a rematch of the AFL’s first title game, the Oilers again defeated the Chargers to become league champs. George Blanda hooked up with Billy Cannon on a 35-yard pass play for the game’s only touchdown. Cannon, one of the AFL’s first big-name stars, finished the game with 101 total yards from scrimmage.\n\n1962\n\nDallas Texans 20, Houston Oilers 17 (2 OT)\n\nDec. 23, 1962\n\nThe Dallas Texans jumped out to an early 17-point lead, only to see the two-time AFL champion Oilers rally and tie the game to force overtime. Tommy Brooker kicked a 25-yard field goal after 17 minutes, 54 seconds of sudden death to give the Texans the win and end Houston’s two-year reign as AFL champions.\n\n\n\n1963\n\nSan Diego Chargers 51, Boston Patriots 10\n\nJan. 5, 1964\n\nKeith Lincoln put on an outstanding show for the Chargers as he rushed for 206 yards on 13 carries and added an additional 123 yards on seven pass receptions and scored two touchdowns. The Chargers ran away with a convincing 51-10 victory over the Patriots.\n\n1964\n\nBuffalo Bills 20, San Diego Chargers 7\n\nDec. 26, 1964\n\nWray Carlton and Jack Kemp each scored touchdowns and Pete Gogolak kicked two field goals as the Bills defeated the reigning AFL champion Chargers 20-7. The Chargers star running back Keith Lincoln was forced out of the game with an injury sustained on a tackle by Buffalo linebacker Mike Stratton in the first quarter.\n\n\n\n1965\n\nBuffalo Bills 23, San Diego Chargers 0\n\nDec. 26, 1965\n\nThe Bills won their second straight AFL championship by completely dominating the Chargers 23-0. The Chargers were only able to penetrate Buffalo’s 25-yard line once. The Bills’ Butch Byrd returned an interception 74 yards for a touchdown and placekicker Pete Gogolak nailed three field goals.\n\n1966\n\nKansas City Chiefs 31, Buffalo Bills 7\n\nJan. 1, 1967\n\nHall of Fame quarterback Len Dawson passed for two touchdowns and Mike Garrett ran for a pair of scores as Kansas City defeated Buffalo to keep the Bills from winning an unprecedented third straight AFL championship. With the win, the Chiefs earned the right to represent the AFL in Super Bowl I.\n\n\n\n1967\n\nOakland Raiders 40, Houston Oilers 7\n\nDec. 31, 1967\n\nQuarterback Daryle Lamonica passed for two touchdowns, one in a fake field goal situation, and George Blanda kicked four field goals as the Raiders beat the Oilers to win its first AFL title in team history.\n\n1968\n\nNew York Jets 27, Oakland Raiders 23\n\nDec. 29, 1968\n\nJoe Namath’s three touchdown passes sparked the Jets to a fourth quarter victory over the defending champion Raiders. New York kicker Jim Turner contributed with two field goals. The game was played in front of 62,627 fans, the largest crowd ever for an AFL title game.\n\n\n\n1969\n\nKansas City Chiefs 17, Oakland Raiders 7\n\nJan. 4, 1970\n\nKansas City’s defense swarmed Oakland and forced four interceptions, including three in the final quarter, to help the Chiefs to the win. One of the interceptions included a 62-yard return for a touchdown by Hall of Fame cornerback Emmitt Thomas.\n\n"}, {"url": "https://theathletic.com/2522275/2021/04/16/what-couldve-been-for-the-bills-and-the-entire-afl-in-a-1964-nfl-draft-full-of-future-hall-of-famers/", "page_content": "You can’t blame Buffalo Bills fans for already contemplating whether 2018 will go down as the team’s greatest draft class. Still a work in progress, quarterback Josh Allen and linebacker Tremaine Edmunds have combined for three Pro Bowls while igniting a franchise that last experienced success two years before the Harry Potter movies existed.\n\nAdvertisement\n\nThe score to beat might be the 1985 draft class, which produced two future Pro Football Hall of Famers: defensive end Bruce Smith and receiver Andre Reed.\n\nBut 1983 featured leading man Jim Kelly and Wall of Fame linebacker Darryl Talley. Many also consider 1983 the NFL’s overall draft standard, buoyed by a glitzy quarterback list and — so far — eight bronze busts in Canton.\n\nAnother year, however, must be considered.\n\nThe 1964 class yielded a record 10 Hall of Fame players, two of them drafted by Buffalo. An 11th draftee made the Hall of Fame as a coach.\n\nThe problem was, Buffalo and the rest of the AFL failed to land a single one.\n\nThe Bills were on the rise and would win the AFL championship in 1964 and 1965. Imagine how stacked those teams would have been had they signed defensive end Carl Eller and receiver Paul Warfield and nine others who preferred the august NFL.\n\nA couple of superstars certainly wouldn’t have hurt the Bills in 1966, when they lost to the Kansas City Chiefs for the right to appear in Super Bowl I.\n\n“The Bills were the cream of the AFL at that time,” Eller said. “They had some talent, especially that great running back, Cookie Gilchrist.”\n\nEller and Warfield this month looked back on botched Buffalo pursuits that essentially made up each superstar’s mind.\n\nThey look back with no regrets.\n\n“No,” Warfield said with a laugh. “I like the way things turned out.”\n\nOne of 10 receivers chosen for the NFL’s all-century team, Warfield won an NFL title with the Cleveland Browns as a rookie and back-to-back Super Bowls with the Miami Dolphins. He was the top target on their undefeated 1972 team.\n\nEller played left end on the Minnesota Vikings’ legendary Purple People Eaters defensive line, was voted All-Pro five times and played in four Super Bowls.\n\nThe NFL and AFL held competing drafts from 1961 to 1966. Once the leagues brokered their merger, they established a “common draft” from 1967 to 1969 to end rookie wrangling while they worked toward the 1970 reboot.\n\nAdvertisement\n\nBills general manager Dick Gallagher did a fine job identifying young talent in 1964, but the NFL routed him on acquisitions. Gallagher signed only one of his first 11 draft picks.\n\n“It was a fun time because of the bargaining and bickering going on,” Eller said.\n\nGallagher managed to sign a great one in cornerback Butch Byrd, a fourth-round pick whose 40 interceptions, while playing a 14-game schedule, no less, still stand as Buffalo’s record a half-century after his retirement.\n\nIn hopes of gaining an edge, the AFL staged its draft Nov. 30, 1963, three days ahead of the NFL’s. The Bills got Byrd to sign immediately. So the AFL’s 25th overall pick wasn’t drafted by any NFL team, although he said they still ventured to lure him away.\n\n“After the draft, three or four NFL scouts asked me to renege on my contract with Buffalo, which I wouldn’t do,” Byrd said.\n\n“Dallas was interested. Green Bay was really interested. They were saying, ‘Don’t worry about the contract with Buffalo. We’ll handle that.’ But I had signed the contract and was going to Buffalo.”\n\nHad the Bills known then that Byrd and veteran Booker Edgerson would form the AFL’s most formidable cornerback tandem, perhaps they would have been more amenable to Warfield’s wishes.\n\nThe Bills drafted Warfield 28th overall. The Browns took him with the NFL’s 11th pick. One could look at Warfield’s background and assume he chose home, sweet home. He was from Northeast Ohio and went to Ohio State.\n\nIn truth, Warfield’s decision came down to an opportunity the Browns were willing to grant.\n\n“The Cleveland Browns were my favorite team as a youngster,” Warfield said. “They would have had an edge. But had Buffalo indicated they would have given me a look as a wide receiver, that perhaps could have changed things.”\n\nThat’s right. Buffalo drafted Warfield, versatile enough to play halfback, receiver and defensive back at Ohio State, to be a cornerback.\n\nAdvertisement\n\nCleveland did, too, but agreed to let him try receiver at minicamp.\n\n“It really boiled down to how the Bills saw me in their organization,” Warfield said. “I was basically a running back and a defensive back at Ohio State. My final year I was switched to end, but Ohio State’s offense was 3 yards and a cloud of dust.\n\n“The Bills made it very clear they wanted me to play as a cornerback. While the Browns also were thinking of me as a defensive back, they said, ‘We will take a look at you as a wide receiver.’ With that notion in mind, I preferred the Browns a little bit more than the Bills.”\n\nCleveland wised up in a flash. Browns coach Blanton Collier must’ve drooled while watching Frank Ryan throw to a smooth target who would average 20.1 yards a catch over a 13-year NFL career.\n\nIn the same offense as grand back Jim Brown and all-decade flanker Gary Collins?\n\nMercy.\n\n“Somebody over there had some sense,” Eller said.\n\nHad the Bills eventually come to their wits, especially after realizing what they had in Byrd and Edgerson, the offense would have deployed Gilchrist, receivers Elbert “Golden Wheels” Dubenion and Glenn Bass and tight end Ernie Warlick. Jack Kemp was Buffalo’s starting quarterback, but Daryle Lamonica still was on the team then.\n\nThe “Mad Bomber” tossing it to Warfield and Dubenion when defenses got too bold against Gilchrist?\n\nMercy.\n\nThe Bills probably should have been more aggressive with Warfield. They must have been leery of his options. Not only did the Bills have to agonize about the NFL alternative, but also the 1964 Tokyo Olympics and his love for baseball.\n\nWarfield in 1962 and 1963 was an All-American in the long jump and won the Big Ten broad jump. He acknowledged track and field didn’t interest him because amateur status needed to be maintained at the time. He wanted to earn a living.\n\nAdvertisement\n\n“There were several Major League Baseball clubs that had approached me about signing,” Warfield said, recalling the Cleveland Indians, Chicago White Sox and Pittsburgh Pirates showed the most interest in him as an outfielder. “I was seriously considering playing baseball.”\n\nWhen the Bills contacted Warfield first in summer 1963 and again toward the end of his senior season at Ohio State, he wasn’t sure about football.\n\n“The Bills told me they wanted to make me their first-round pick,” Warfield said, “but they told me, ‘We can ill afford to waste a first-round pick on you if you are thinking about playing baseball.’\n\n“At that point I wasn’t elated about my football season. I told them I was going to play in a couple of the postseason football games, but I was leaning toward baseball. When we parted, they had the distinct idea I was going to play baseball.\n\n“But those postseason football games were fun, and the idea of going through the minor leagues wasn’t what I wanted to do. So my thoughts switched back to football, but I didn’t have any more contact with Buffalo before the draft.”\n\nBaseball, the long jump pit or cornerback, it’s not difficult to imagine Warfield excelling at whatever sport he embraced.\n\nYounger fans might scratch their heads upon researching Warfield’s stats. In three of his eight Pro Bowl seasons, he caught 28, 29 and 27 passes. He broke 1,000 yards once.\n\nThe game was different then, of course, yet he caught 85 touchdowns, third most in the NFL when he retired. He scored a touchdown on 19.9 percent of his receptions. All-time touchdowns leader Jerry Rice scored on 12.7 percent of his catches. Randy Moss scored on 15.9 percent.\n\nByrd called Warfield the most difficult receiver to defend.\n\n“He never took a play off,” Byrd said. “Most wide receivers, when a run play was called, would just kind of jog down the field. You could rest up. But Paul on every play would run a pattern. Covering him was a full-time, 60-minute job because you never knew when they were going to throw the ball to him. He was a tough competitor, the toughest one I had to cover.”\n\nAdvertisement\n\nAs with Warfield, there was a home connection for Eller to weigh.\n\nThe Bills drafted Eller fifth. The Vikings took him sixth and had a decided edge: He played at the University of Minnesota, and the Vikings were athirst after failing to sign Eller’s college teammate, linebacker Bobby Bell, a year earlier. Bell signed with the Kansas City Chiefs.\n\n“The Vikings somehow got wind that I might go to the American Football League,” Eller said. “The Vikings had a coach follow me around everywhere I went to make sure the Bills didn’t get ahold of me.”\n\nThe Vikings had nothing to fear.\n\nEller was unimpressed with the Bills’ interest. The Minnesota connection was one thing, but he also felt the Bills — and the AFL — were a slapdash operation.\n\n“I didn’t know they were interested,” Eller said. “They came out of the blue about a week before the draft. They sent somebody to speak with me and ask if I would come if they drafted me. I said, ‘Sure, I’ll take a look.’\n\n“But I didn’t really feel like they were serious. I didn’t feel like they’d done their work. That kind of made up my mind. I think I had a better chance with the Vikings, who I could tell really wanted me.”\n\nThe Bills’ returning defensive line was solid, but there was a reason they used their first-round draft choice on Eller. He and Ron McDole would have made nasty bookends, with Tom Sestak and Jim Dunaway inside.\n\nAlas, any AFL team likely faced the same resolution had they drafted Eller, regardless of how things were working out for Bell in Kansas City.\n\n“I might have gotten more money from Buffalo than I did from the Vikings that first year,” Eller said, “but I wasn’t sure the league would survive. Going to the Vikings provided security.”\n\nBuffalo wasn’t particularly fruitless relative to the rest of the AFL. The entire league struggled to lock up its draft picks.\n\nByrd and Boston Patriots center Jon Morris, taken with the 25th and 29th picks, turned out to be the most decorated players the AFL signed.\n\nAll 10 future Hall of Famers signed with the NFL. They were Philadelphia Eagles tackle Bob Brown, Washington receiver Charley Taylor and safety Paul Krause, Dallas Cowboys receivers Mel Renfro and Bob Hayes, San Francisco 49ers linebacker Dave Wilcox and Browns running back Leroy Kelly, whom the AFL didn’t draft.\n\nThe 1964 class included another Hall of Famer not drafted by the new league. The Detroit Lions drafted Bill Parcells in the seventh round, one pick after Hayes. Parcells didn’t make the team and became a coach.\n\nAs lopsided as the NFL’s 1964 haul was, Warfield stressed he never viewed the AFL as inferior competition.\n\n“My perspective was that the gap was not as wide or deep as the perception,” Warfield said. “There was a slight difference here or there, but not as overwhelming as people thought.”\n\nCleveland traded Warfield to Miami right after the merger, putting him on a team that launched in the AFL just four seasons earlier. The Dolphins had averaged four wins a year but were on the verge of becoming dominant.\n\n“That first year in the NFL in 1970, Miami made it appear there wasn’t much difference and won 10 games,” Warfield said. “The following year we went to the Super Bowl and lost. The third year we went undefeated. The fourth year was another Super Bowl win.”\n\nOut of 26 selections, Buffalo secured just two more who would stick beyond two seasons. Offensive lineman Joe O’Donnell, despite being taken 40th by the powerhouse Green Bay Packers, signed with the Bills after being chosen 101st. Safety and punt returner Hagood Clarke was taken 85th by San Francisco but signed with Buffalo as its 141st pick.\n\nPerhaps the most notable figure from the Bills’ 1964 rookie class was Pete Gogolak, the pioneering soccer-style kicker. The NFL didn’t draft him, but the New York Giants signed him away from the Bills in 1966, violating an unwritten gentleman’s agreement between the leagues not to poach each other’s veterans and tipping a domino that would hasten the NFL-AFL merger.\n\nBuffalo nevertheless won the AFL championship and repeated in 1965 without Eller and Warfield.\n\n“Those two guys are both Hall of Fame members and certainly would have added something to the team,” Byrd said, “but we only lost two games. I don’t know how much better that would have made us. Maybe we would have won by wider margins.\n\n“We were good and really thought we were the match for any NFL team at the time. I don’t know if that’s true or not, but we certainly felt that.”\n\nBuffalo eroded quickly as the NFL and AFL united, averaging three wins and warranting the first overall pick twice from 1967 through 1972.\n\nO.J. Simpson and Walt Patulski had no choice but to sign with Buffalo then.\n\n(Photo of Carl Eller: Nate Fine / Getty Images)"}, {"url": "https://afltashalloffame.com.au/inductees/62-bob-miller/", "page_content": "Coach Inductee\n\nCity/City South, 1951-72\n\nCity captain-coach, 1951-55\n\nCity/City-South non-playing coach 1956-57, 1970-72\n\nCity/City South NTFA premiership coach 1952, 1953, 1954, 1956, 1972\n\nCity/City-South State premiership coach 1952 (unofficial), 1954, 1972\n\nRossarden premiership coach 1961, 1962, 1963, 1964, 1965, 1967 (Fingal District FA)\n\n74 games for City/City-South, 1951-55\n\nCity-South Team of the Century (Coach)\n\nWithout question one of the most successful coaches in Tasmanian history, Bob Miller guided City-South through a golden era in the 1950’s which produced six consecutive NTFA Grand Finals and four premierships.\n\nBorn in 1923, Bob Miller came to Tasmania from Victoria where he had played 44 VFL games for Fitzroy from 1946 to 1950. In 1951 he journeyed south to Tasmania to take up the role as captain-coach of City in the NTFA, a club who hadn’t won an NTFA premiership since 1941; his arrival would usher in the greatest era in the club’s 106-year history. After making his debut for the Redlegs in the opening round of 1951, Miller had become one of the star centremen in the competition by season’s end, leading his side to a Grand Final against Launceston, a match City would lose by 12 points. They would go one better the following year, getting the better of Scottsdale by 20 points.\n\nThe 1952 triumph was to be the first of a hat trick of premierships for City under Miller’s guidance: in 1953 the Redlegs proved too strong for Longford, while the following year it would be Launceston who would be the vanquished challenger, City emerging premiers by five goals. This led to the club’s first state premierships decider since 1941, and as they had done at league level City emerged triumphant, toppling TANFL premiers Hobart by 24 points. During this period Miller became an effective and popular coach, regularly inspiring teammates through pieces of on-field brilliance through the middle of the ground or during a short-lived stint at full forward. Sadly, Miller would watch his teammates’ glorious 1954 achievements from the sidelines, after badly breaking his leg during the NTFA finals. After retiring at the end of 1955 Miller retained his role as coach, and his on-field absence failed to blunt City’s dominance. After falling to Longford in 1955 NTFA decider, Miller’s charges brought home their fourth flag in five years in 1956, overcoming North Launceston by eight points.\n\nAfter (the re-named) City-South failed to reach the Grand Final for the first time under his watch in 1957, Miller stepped down as coach, handing the reigns to champion Centre Half Forward Geoff Long. Miller subsequently spent some time coaching in the country, most notably in the Fingal District Association with Rossarden where he guided the club to a dynasty of six premierships in seven seasons between 1961 and 1967. He was eventually lured back to City-South as coach after nearly 15 years in 1970, replacing club champion Berkley Cox. City-South’s golden era had ended in 1966 and it was hoped that the previously successful Miller would be able to lead the club back into the top echelon of teams in the NTFA. His re-appointment was met with almost immediate success: after reaching the preliminary final in his first season back, City-South finished as minor premiers in 1971, only to be crushed by Scottsdale in the Grand Final by 93 points. Stung by that humiliation, the Redlegs and Miller were back with a vengeance the following year, exacting revenge on Scottsdale to take out the NTFA premiership, before winning their seventh and final State premiership with a magnificent victory over the Darrel Baldock-coached Latrobe by 36 points. Despite this success, Miller stepped down as coach at season’s end, going out on the highest note possible.\n\nIn ten combined seasons as coach of City/City-South, Bob Miller led his side to eight Grand Final appearances, five premierships and two state flags. When the club’s Team of the Century was named in 2002, Miller was an obvious choice as coach. Unfortunately he didn’t live to see himself accorded the honour, passing away in 1993 at the age of 69."}, {"url": "https://medium.com/sportsraid/lou-saban-was-always-a-coach-on-the-move-a-lot-of-moves-8671718e0420", "page_content": "THE AFL 1960–69: A RETROSPECTIVE\n\nLou Saban Was Always a Coach on the Move — A Lot of Moves\n\nNo one had a more diverse and lengthy coaching resume, but his greatest successes came in the AFL with the Buffalo Bills Sal Maiorana · Follow Published in SportsRaid · · Nov 18, 2020 4 min read -- 1 Share\n\nLou Saban coached the Buffalo Bills to back-to-back AFL championships in 1964 and 1965.\n\nIt did not take a genius to figure out what the woebegone Buffalo Bills should do on…"}, {"url": "https://www.pro-football-reference.com/players/M/MillBo20.htm", "page_content": "Frequently Asked Questions\n\nWhen was Bob Miller born?\n\nBob Miller was born on December 11, 1929.\n\nWhere was Bob Miller born?\n\nBob Miller was born in Norwalk, CT.\n\nHow tall was Bob Miller?\n\nBob Miller was 6-3 (190 cm) tall.\n\nHow much did Bob Miller weigh when playing?\n\nBob Miller weighed 242 lbs (109 kg) when playing.\n\nIs Bob Miller in the Hall of Fame?\n\nBob Miller has not been elected into the Hall of Fame.\n\nHow many games did Bob Miller play?\n\nBob Miller played 81 games over his career.\n\nHow many Super Bowls has Bob Miller won?\n\nBob Miller never won a Super Bowl.\n\nWhen did Bob Miller retire?\n\nBob Miller last played in 1958."}, {"url": "https://www.profootballhof.com/teams/buffalo-bills/", "page_content": "The Buffalo Bills Wall of Fame was started in 1980 to honor former players, administrators, and coaches who have played significant roles in the team's history.\n\nBills Wall of Fame\n\nEddie Abramoski\n\nJoe DeLamielleure\n\nElbert Dubenion\n\nBooker Edgerson\n\nJoe Ferguson\n\nPhil Hanen\n\nKent Hull\n\nRobert James\n\nBob Kalsu\n\nJim Kelly\n\nJack Kemp\n\nMarv Levy\n\nPatrick J. McGroder\n\nBill Polian\n\nAndre Reed\n\nJim Ritcher\n\nGeorge Saimes\n\nTom Sestak\n\nBilly Shaw\n\nO.J. Simpson\n\nFred Smerlas\n\nBruce Smith\n\nMike Stratton\n\nDarryl Talley\n\nSteve Tasker\n\nThurman Thomas\n\nRalph Wilson\n\n\"The 12th Man\"\n\nFor more on the Bills Wall of Fame, visit the team website. Click here>>>\n\n\n\nThe Bills announced its 50th Anniversary Team on draft day 2009.See the all-time team>>>"}, {"url": "http://www.remembertheafl.com/Bills.htm", "page_content": "A legendary player in the American Football League, Cookie Gilchrist came from six years of super-stardom in the Canadian Football League, where he played fullback, linebacker, lineman and placekicker, and gained nearly 5,000 yards rushing. Gilchrist was a CFL All-Star five straight years, with the Hamilton Tiger Cats in 1956 and 1957, in 1958 with the Saskatchewan Roughriders, and the Toronto Argonauts in 1959 and 1960. Gilchrist recorded 4,911 rushing yards, 1,068 receiving yards and 12 interceptions during his Canadian Football League career. For Buffalo, he ran and kicked, though he insisted he could have played both ways. He was the first 1,000-yard American Football League rusher, with 1,096 in a 14-game schedule in 1962. Gilchrist, and later Paul Robinson ( Bengals, 1968 ), were the only two men to rush for over 1,000 yards in their first year in a U.S. Professional Football league. That year, Gilchrist set the all-time AFL record for touchdowns with 13, and earned league MVP honors. He rushed for 243 yards and scored 5 tds in a single game against the NY Jets in 1963, setting a Professional Football record.\n\nThough he was only with the Bills for three years (1962-1964), he remains the team's fifth leading rusher all-time, and led the league in scoring in each of his three years as a Bill. Gilchrist ran for 122 yards in the Bills' 1964 American Football League championship defeat of San Diego, 20-7. His 4.5 yds/rush average is second as a Bill only to O.J. Simpson.\n\nCookie led a successful boycott of New Orleans as the site of the American Football League All-Star game after the 1964 season, in an early civil rights victory for black athletes. He was an AFL All-Star in 1962, 1963, 1964, and while with the Denver Broncos in 1965, when he rushed for 954 yards. He also played for the Miami Dolphins in 1966 and finished his AFL career in Denver in 1967. In 1970, he was selected as the fullback on the All-Time All-AFL Team . His combined statistics in the CFL and the AFL are 9,204 yards rushing, 2,203 yards receiving, and 12 interceptions. Can that combination of stats be matched by any other player?\n\nIn November 2006, Cookie received honorable mention in the selection of the 50 greatest CFL players of all time. Cookie was the only former AFL player to receive this honor. In 2007, he fought a battle against throat cancer. After a remission, the cancer made an even stronger return, and Cookie succumbed on January 10, 2011.\n\nCookie is a member of the Buffalo Bills Wall of Fame."}, {"url": "https://www.thegamebeforethemoney.com/bills-chiefs-afl-afc-championship/", "page_content": "BILLS VS CHIEFS FOR THE SUPER BOWL\n\nThe 2020 AFC Championship Game carries the legacy and tradition of the original AFL teams. Both franchises won multiple AFL championships.\n\nThe 2020 AFC Championship Game features the Buffalo Bills at the Kansas City Chiefs. This isn’t the first time the two teams have played for a chance at the Super Bowl.\n\nThe Bills and Chiefs battled for the American Football League championship on January 1, 1967 for a berth in Super Bowl 1.\n\nThe Bills had won the last two consecutive American Football League championships in 1964 and 1965. The AFL and NFL announced a merger in the summer of 1966. The leagues’ respective champions would meet to determine the World Champion in what was originally called the AFL-NFL World Championship Game.\n\nThe Chiefs found good fortune early in the chilly mist of Buffalo’s War Memorial Stadium, as the Bills fumbled the opening kickoff. Kansas City quarterback Len Dawson tossed a touchdown pass to tight end Fred Arbanas. The Chiefs led 7-0.\n\nBuffalo countered with a touchdown of their own, as quarterback Jack Kemp hit receiver Elbert Dubenion on a 69-yard catch and run.\n\nHear Bills DE Ron McDole share stories about the Bills AFL championships!\n\nOtis Taylor broke the tie in the second quarter with a 29-yard touchdown reception. A key play came later in the second quarter, as Chiefs Hall of Fame defensive back Johnny Robinson interception a Jack Kemp pass and returned it over 70 yards. Kansas City capitalized with a field goal before the end of the first half to lead 17-7 at halftime.\n\nFormer USC Heisman Trophy winner Mike Garrett scored 2 touchdowns for Kansas City in the fourth quarter. His second touchdown was a remarkable 18-yard run through a swarming Bills defense that chased Garrett from one sideline to the other. Garrett stayed on his feet in the muddy conditions, circling back all the way near the Bills 30 before cutting to his right and dashing toward the goal line. Garrett’s gallop made the score 31-7, which was the final.\n\nEmbed from Getty Images\n\nPhotos: The 1966 AFL Championship Game\n\nThe Kansas City Chiefs played the Green Bay Packers in Super Bowl I. The Packers won 35-10. The name “Super Bowl” was thought up by Kansas City Chiefs founder Lamar Hunt. Hunt played college football at SMU with two future NFL stars, one who was a member of the Packers. The Chiefs won Super Bowl 4 against the Minnesota Vikings.\n\nListen to our football history podcast!\n\nLooking for a great American Football League history book? Check out The Game Before the Money: Voices of the Men Who Built the NFL. The book features stories from legendary AFL and NFL players. Available at — Amazon.com – Barnes and Noble – University of Nebraska Press"}]}