{"Bob Miller was inducted into the College Football Hall of Fame in 1988.": [{"url": "https://www.cfbhall.com/about/inductees/", "page_content": "ATTENTION\n\nThe Hall of Fame will be closed to the public for a private event June 6\n\nWELCOME FANS TO THE COLLEGE FOOTBALL HALL OF FAME!! The Chick-Fil-A College Football is the home of all things college football. Plan your visit, throw, kick a field goal and experience 94,000 square feet of the storied tradition of college football. OPEN DAILY 10a - 5p Be sure to follow us on all platforms @cfbhall"}, {"url": "http://hof.ehc.edu/members/robert-a-miller/", "page_content": "Robert “Bob” A. Miller\n\nRobert “Bob” A. Miller, a native of Portage, Pennsylvania, played halfback for the Emory & Henry football team from 1948-51. He played during the era before official school statistics were kept, but estimates based on newspaper clippings and old microfilm indicate that he accumulated a total career “ground gain” (a combination of rushing, receiving, and returns) of over 3,000 yards. Miller, who was known as “The Emory Express” for his rushing ability, was inducted as a charter member into the E&H Sports Hall of Fame in 1972.\n\nMiller, who had intended to go to Florida State on a football scholarship before Coach Conley Snidow convinced him to join the Wasps, made quite an impact at Emory & Henry College. In his sophomore year, Miller was named to the Little All-America Second-Team and the All-Little Six First-Team, and he was the top scorer in Virginia, with a total of 102 points over twelve games. The team itself had a perfect 10-0 record. His junior year, 1950, he was both a Little-All America and All-Little Six first-teamer and again led the state in scoring, with 114 points in 11 games. He capped off his senior year as a three-time All-American and three-time top scorer in the state of Virginia, as well as being named the Virginia State All-Division Player of the Year.\n\nOver Miller’s four-year career, the Wasps went 31-8-1, mounting an impressive 28-1-1 record during his sophomore through senior years. In 1949 and 1950, the Wasps were invited to the Burley Bowl and the Tangerine Bowl. He scored a career total of 379 points, the highest in college history at the time of his graduation. His estimated ground gain record stood for thirty-five years until it was broken by the legendary Hall of Fame member Sandy Rogers in 1986. His jersey number has been retired by the Emory & Henry football team, a distinction he shares with only three other players.\n\nMiller was a U.S. Army veteran, having served in the Korean War. While in the Army, he played football for the base team at Fort Eustis until he injured a knee. After his service, he settled in Tazewell, where he was teacher and football coach at Tazewell High School for nine years. He went on to become a businessman and real estate developer in the Tazewell area, and he served on the town council and the board of governors.\n\nRobert Miller died of a heart attack on December 1996 in Bluefield, West Virginia. Miller left Emory & Henry holding 10 records, and in 2006 he was inducted posthumously into the Virginia Sports Hall of Fame."}, {"url": "https://footballfoundation.org/sports/2018/7/31/college-football-hall-of-fame-trivia.aspx", "page_content": "Thanks for visiting !\n\nThe use of software that blocks ads hinders our ability to serve you the content you came here to enjoy.\n\nWe ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here.\n\nThank you for your support!"}, {"url": "https://californiasportshalloffame.org/inductees/bob-miller/", "page_content": "2011 CALIFORNIA SPORTS HALL OF FAME INDUCTEE\n\nHockey Hall of Famer Bob Miller is in his 37th season as the \"Voice of the Kings\" -- the first 17 years simulcast on TV and radio and the last 19 years as the exclusive television voice of the team -- and is again joined for the 20th season by former Kings right winger Jim Fox for all Kings games on FS West.\n\nOn November 13, 2000, Miller was inducted into the Hockey Hall of Fame in Toronto, where a plaque hangs, as the recipient of the annual Foster Hewitt Memorial Award as selected by the NHL Professional Broadcasters’ Association. The award recognizes those members of the radio and television industry who have made outstanding contributions to their profession and the game during their hockey broadcasting careers.\n\nOn October 2, 2006, Miller received a star on the famous Hollywood Boulevard Walk of Fame. He also that year authored the book, Bob Miller’s Tales from the Los Angeles Kings. On February 4, 2002, Miller was inducted into the Southern California Sports Broadcasters Hall of Fame, and he currently serves as that organization’s president. Miller has also been named the top television play-by-play announcer in Southern California three times, including 2005.\n\nIn 1998, to commemorate his 25 years of loyal service to the organization, Miller was honored by having the STAPLES Center press box named after him and was presented with a \"lifetime contract\" by the club, and in 1997, Miller was named as one of the six inaugural members of the Kings Hall of Fame during the organization’s 30th Anniversary celebration. The National Association of Sportscasters and Sportswriters also named him the California Sportscaster of the Year in 1997 and 2002.\n\nA native of Chicago, Miller, 71 (10/12/38), received his degree at the University of Iowa where he started his broadcasting career doing Hawkeye football and basketball games. Before joining the Kings, he worked professionally in radio and TV in Milwaukee and Madison, Wisconsin, and was the voice of University of Wisconsin hockey, football and basketball. In 1992, Miller received the honor of being inducted into Wisconsin’s Hockey Hall of Fame.\n\nAlong with his duties for the Kings, Miller’s voice has accented numerous TV and film projects, including \"Cheers,\" \"Rollerball,\" \"Miracle on Ice,\" \"The Mighty Ducks\" and \"The Mighty Ducks 2.\"\n\nA resident of West Hills, Bob and his wife Judy have a married daughter, Kristin, and a son Kevin."}, {"url": "https://volswire.usatoday.com/lists/tennessee-football-vols-in-the-college-football-hall-of-fame/", "page_content": "The University of Tennessee first fielded a football team in 1891.\n\nTennessee has won 19 conference championships: Southeastern Conference (16), Southern Conference (2) and SIAA (1).\n\nTennessee has won six SEC East division titles since the conference went to a divisional format in 1992.\n\nThe Vols have won six national championships in 1938, 1940, 1950. 1951, 1967 and 1998.\n\nTennessee is 29-25 in bowl games.\n\nThroughout its tradition-rich history, Tennessee players and coaches have been enshrined in the College Football Hall of Fame.\n\nTwo Tennessee hall of famers have been inducted as both a player and coach.\n\nQuarterback Bobby Dodd, who later served as head coach at Georgia Tech, was enshrined as a player in 1959. He was inducted as a coach in 1993.\n\nBowden Wyatt, who played for and coached with the Vols, was inducted as a player in 1972 and as a coach in 1997.\n\nBelow are Tennessee players and coaches in the College Football Hall of Fame."}, {"url": "https://michigansportshof.org/inductee/bob-miller/", "page_content": "Robert John (Bob) Miller\n\nAffiliation: U of D Baseball\n\nU of D Baseball Player\n\nU of D Baseball Manager (1965 - 2000)\n\nDetroit Mercy Titans Athletic Hall of Fame\n\nAdditional Affiliation: Philadelphia Phillies Player (1949 – 1958)\n\nRobert John (Bob) Miller\n\nU of D Baseball Player\n\nPhiladelphia Phillies Player (1949 – 1958)\n\nU of D Baseball Manager (1965 – 2000)\n\nBob Miller was born in Detroit, Michigan and served in the U.S. Army during World War II. After his release from active service, Miller went on to attend the University of Detroit. He was signed by the Philadelphia Phillies in 1948 and was called up to the Major Leagues in 1949 staying with the Phillies throughout his MLB career. He was a part of the 1950 “Whiz Kids” only the second Phillies team to win a National League pennant. After his playing career ended, he went on to a baseball coaching career at the University of Detroit that lasted from 1965 – 2000, where his teams would win 896 games. Bob Miller was inducted into the Detroit Mercy Titans Athletic Hall of Fame in 1979 and was inducted into the Michigan Sports Hall of Fame in 1999. He passed away on November 27, 2020 at 94 years of age."}, {"url": "https://www.jsonline.com/story/sports/college/2023/01/11/wisconsin-football-players-in-the-college-football-hall-of-fame/69795377007/", "page_content": "Former University of Wisconsin cornerback Troy Vincent will be inducted into the College Football Hall of Fame in a ceremony late in 2023, one of 18 players so honored in this year's class.\n\nOne of the four coach inductees, Monte Cater, coached at Lakeland College from 1981 through 1986.\n\nThe College Football Hall of Fame encompasses a large contingent of inductees, but only 13 associated directly with their time at the University of Wisconsin make the list, though many others with connections to Wisconsin football have been recognized. Here's who's on the list:\n\nUniversity of Wisconsin\n\nDave Schreiner (inducted in 1955). Born in Lancaster, Schreiner was a first-team All-American defensive end in 1941 and 1942, leading the latter team to an 8-1-1 record and earning Big Ten MVP. He was killed in action in Okinawa serving during World War II.\n\nGeorge Little (1955). He coached Wisconsin from 1925-26 and continued on as athletic director until 1932, where he oversaw the construction of the Wisconsin Field House. As head football coach, he went 11-3-2 in his two seasons, and he also coached at Cincinnati, Miami (Ohio) and Michigan.\n\nPatrick O'Dea (1962). The native Australian played for the Badgers from 1896-99, and his booming drop kicks contributed to his legend. He's credited with two punts of 100 yards or greater and made 32 field goals, including a 62-yard running drop kick in 1898. He garnered the name \"Kangaroo Kicker\" and he also played fullback. He was an All-American in 1899.\n\nBob Butler (1972). The All-American in 1912 was part of a powerhouse offensive line at Wisconsin.\n\nElroy Hirsch (1974). \"Crazylegs\" is one of Wisconsin's greatest home-grown athletes, a native of Wausau who only played halfback one year at Wisconsin (1942) but left a significant mark. His team went 8-1-1 and he went on to serve as the school's athletic director from 1969-87.\n\nAlan Ameche (1975).\"The Horse\" from Kenosha won the 1954 Heisman Trophy and became one of the game's great fullbacks. He set the NCAA career rushing yards record while at Wisconsin, leading UW to its first Rose Bowl in 1951 and earning his first of two All-American nods in 1953. He went on to score the winning touchdown in the 1958 NFL Championship game for the Baltimore Colts.\n\nMartin Below (1988). Born in Oshkosh, Below split his time between Wisconsin and UW-Oshkosh, serving as a right tackle for the Badgers and earning consensus All-American status in 1923.\n\nPat Harder (1993). The Milwaukee Washington alumnus served as the UW fullback from 1941-42, leading the Big Ten in rushing and scoring in the former season and leading UW to an 8-1-1 record in the latter, including a 17-7 win over Ohio State.\n\nPat Richter (1996). The multi-sport star won nine letters at UW in football, basketball and baseball and then became the program's athletic director starting in 1989, when one of his first orders of business was hiring Barry Alvarez as head football coach. Richter led the Big Ten in receptions in 1961 and 1962 and led the conference in punting the latter year. He was first-team All-American at end both years and set a Rose Bowl record with 11 receptions against USC after the 1962 season.\n\nBarry Alvarez (2010). The first Big Ten coach to win back-to-back Rose Bowls, Alvarez went 118-74-4 during his time at Wisconsin, where he turned around a flailing program and made it into a sustained power. He won three Big Ten titles, won three Rose Bowls and coached 12 first-team All-Americans before becoming the school's AD from 2004-2021.\n\nRon Dayne (2013). Became the NCAA all-time leading rusher over four dominant seasons, which included back-to-back Rose Bowl triumphs after the 1998 and 1999 seasons. He won the Heisman Trophy in the latter campaign and was named first-team All-American three times. He became a first-round draft pick by the New York Giants in 2000.\n\nTim Krumrie (2016). The standout at Mondovi High School went on to become Wisconsin's all-time leading tackler during his tenure from 1979-82, with a first-team All-American nod in 1981 at nose tackle. His 13 tackles in the Independence Bowl in 1982 earned him defensive MVP, and he went on to have a fruitful NFL career, making two Pro Bowls with the Cincinnati Bengals.\n\nJoe Thomas (2019). The Brookfield Central graduate was a force at offensive tackle from 2003-06, where he started 39 games and won the Outland Trophy for the nation's best lineman. He became the No. 3 pick in the 2007 NFL draft and played 11 seasons for the Cleveland Browns; he'll almost certainly be inducted into the Pro Football Hall of Fame next year.\n\nOther Wisconsin college ties\n\nEarl Abell (1973). The Portage native was inducted as a player after his years as a tackle at Colgate from 1912-15, earning All-American honors as a senior. He later became head coach at VMI and his alma mater at Colgate, then Virginia for two years.\n\nStanley Barnes (1954). The center/tackle for California played in Rose Bowls in 1920 and 1921, with the latter winning a national title. He was born in Baraboo and later became a U.S. circuit judge.\n\nKirk Baumgartner (2005). The UW-Stevens Point quarterback was twice named NAIA player of the year and earned first-team All-American honors three times during his tenure from 1986-89. He posted 14,847 passing yards and 122 touchdown passes, leading the nation in total offense as a junior and senior. The Colby-born Baumgartner was drafted by the Packers in 1990.\n\nDave Casper (2012). Graduate of Chilton High School was a consensus All-American tight end at Notre Dame in 1973 and played a key role on the national title team before enjoying a Pro Football Hall of Fame career with the Oakland Raiders.\n\nJim Crowley (1966). Halfback at Notre Dame played at Green Bay East High School and spent a brief time with the Packers in 1925. He was one of the \"Four Horsemen\" with the Irish.\n\nGus Dorais (1954). The Chippewa Falls native played and roomed with Notre Dame legend Knute Rockne, and together they hatched strategies that would help change the face of football. At the University of Detroit Mercy from 1914-42, Dorais's teams went 150-70-12.\n\nWilliam Dietz (2012). Rice Lake native became head coach at Washington State from 1915-17 and then made several other stops before becoming an NFL coach in Boston from 1933-34.\n\nPaddy Driscoll (1974). Pro Football Hall of Famer who played at Northwestern from 1915-16 as a quarterback and halfback became the Marquette head coach from 1937-40.\n\nRoger Harring (2005). The Green Bay-born coach guided UW-La Crosse to three national championships and became the first coach to win NAIA and Division III national titles. He went 261-75-7 over 31 seasons, and his teams took first or second in the conference 25 times, with 15 titles and 14 national playoff appearances. He was also a successful high school coach in Wisconsin Rapids.\n\nJimmy Johnson (1969). Born in Edgerton, played at Carlisle in Pennsylvania (where he became an All-American quarterback under Pop Warner) and Northwestern from 1899-1903.\n\nPhil King (1962). King had a tremendous playing career at Princeton from 1890-93 but also had a strong second act as Wisconsin head coach from 1896-1902, coaching the Badgers to their first conference title with the Western Conference crown in 1896, the first of three such titles under King. The 1901 team went 9-0 and outscored opponents 317-5.\n\nPug Lund (1958). Halfback was born in Rice Lake and was named an All-American with Minnesota in 1934.\n\nEdgar Manske (1989). Nekoosa native played at end for Northwestern, where he was an All-American in 1933.\n\nFred Miller (1985). Tackle under Knute Rockne was named an All-American, but his legacy is beer. The Milwaukee-born Miller was the grandson of Frederick Miller, founder of Miller Brewing Company, and Fred later became president of the company in 1947. He also helped bring Major League Baseball to Milwaukee when the Boston Braves moved to town.\n\nFrank Murray (1983). The Marquette University football coach from 1922-36, then again from 1946-49, amassed a 145-89-11 career record at MU and Virginia and specifically a 90-32-6 mark at MU. His team went 8-0-1 in his first season and 8-0-0 in the next.\n\nErnie Nevers (1951). Pro football hall of famer played fullback for Stanford from 1923-25. Though he was born in Minnesota and finished his high-school career in California, he spent multiple years as a high-school athlete at Superior Central.\n\nScott Reppert (2003). Running back from Appleton West was a three-time All-American at Lawrence University in Appleton, he led the nation in rushing three straight years in 1980, 1981 and 1982.\n\nClarence Spears (1955). He was a two-time All-American guard at Dartmouth in 1914 and 1915, then began a coaching career that included a stretch from 1932-35 as Wisconsin's head coach.\n\nTony Romo (2021).Native of Burlington High School stood out at Eastern Illinois and went on to a lengthy career as quarterback of the Dallas Cowboys and now a celebrated commentator. Won the Walter Payton Award for the nation's best Division I-AA football player and threw for 82 touchdowns in three years.\n\nHarry Stuhldreher (1958). One of the \"Four Horsemen\" as a quarterback at Notre Dame, he was inducted in 1958 as a player; he later became head coach at Wisconsin from 1936-48 and athletic director from 1936-50.\n\nGreen Bay Packers\n\nA sampling of ex-Packers who are in the Hall of Fame:\n\nDonny Anderson (Texas Tech). Halfback inducted in 1989 who was a member of Green Bay's Super Bowl winning teams in 1966 and 1967.\n\nLarry Bettencourt (Saint Mary's). Two-way player became an All-American in 1927 as an offensive and defensive lineman and later played one year for the Packers in 1933.\n\nDave Brown (Michigan). Safety inducted in 2007 was also a punt returner from 1972-74. He played for the Packers from 1987-90, with 12 interceptions during his time with Green Bay.\n\nRoss Browner (Notre Dame). Defensive end inducted in 1999 was a two-time unanimous All-American choice in 1976 and 1977, winning awards as the nation's best interior lineman both years. He played his final NFL year with the Packers in 1987.\n\nTerrell Buckley (Florida State). Defensive back inducted in 2019 drafted No. 5 by the Packers in 1992 and spent three seasons with Green Bay.\n\nChuck Cecil (Arizona). Safety inducted in 2009 was known for his hard hitting and grisly nose injuries during his tenure with the Packers from 1988-92.\n\nPaul Christman (Missouri). Played one year with the Packers in 1950. The quarterback was a two-time All-American and inducted in 1956.\n\nJack Cloud (William & Mary). Linebacker was drafted by the Packers in 1950 and spent two years with the franchise, playing both linebacker and fullback in the NFL. He was inducted in 1990.\n\nSylvester Croom (Alabama). Former running backs coach for the Packers from 2001-03 was a standout center who won three SEC championships from 1972-74, with a national title in the middle year. He was inducted in 2022.\n\nEric Crouch (Nebraska). Quarterback inducted in 2020 served on the Packers practice squad in 2003-04.\n\nCarroll Dale (Virginia Tech). Inducted as an end in 1987 won three NFL championships with the Packers as a wide receiver (including the first two Super Bowls) and made three Pro Bowls.\n\nAve Daniell (Pittsburgh). Tackle won two national titles and played for the Packers in 1937.\n\nTy Detmer (BYU). Quarterback inducted in 2012 backed up Brett Favre from 1992-95.\n\nDan Devine (Arizona State, Missouri, Notre Dame). Inducted in 1985, Devine also had a run from 1971-74 as head coach and GM with the Packers, when he led the team to a 25-27-4 record.\n\nTom Fears (UCLA). Split end became a Pro Football Hall of Famer with the Rams and served as a Packers assistant in 1959 and 1962-65.\n\nBeattie Feathers (Tennessee). Halfback spent the 1940 season with Green Bay. May have won the Heisman Trophy in 1935 if it had been established yet.\n\nJim Grabowski (Illinois). Running back was a two-time All-American and the No. 9 pick in the 1966 Draft by the Packers, where he played from 1966-70 and won two Super Bowls.\n\nJerry Gray (Texas). Safety inducted in 2013 has been a Packers assistant coach since 2019. He played in the NFL from 1985-93 and has been a college or pro coach since 1995.\n\nJohn Hadl (Kansas). Though Packers fans associate him with a dubious trade and two star-crossed years in 1974-75, he was a first-round draft choice in 1962 and had a strong 16-year NFL career after his standout days as the Jayhawks quarterback.\n\nTed Hendricks (Miami). Four-time Super Bowl champion briefly spent time with the Packers in 1974. The linebacker inducted in 1987 is also part of the Pro Football Hall of Fame.\n\nClarke Hinkle (Bucknell). Fullback inducted in 1971 became a Pro Football Hall of Famer with the Packers, winning NFL championships in 1936 and 1939 and becoming a seven-time All Pro.\n\nPaul Hornung (Notre Dame). Halfback inducted in 1985 was drafted first by the Packers in 1957 and spent nine seasons with Green Bay, spanning four NFL championships. He's now in the Pro Football Hall of Fame.\n\nDesmond Howard (Michigan). Inducted as a wide receiver and kick returner in 2010, best known by Packers fans for his kickoff return to the end zone in Super Bowl XXXI after the 1996 season, earning Super Bowl MVP. He won the 1991 Heisman Trophy.\n\nCal Hubbard (Centenary, Geneva). Offensive tackle inducted in 1962 played for the Packers from 1929-33 and in 1935 and is a member of the Pro Football Hall of Fame.\n\nDon Hutson (Alabama). 1951 inductee at end is one of the greatest players in Packers history, a Hall of Famer twice named league MVP with eight All-Pro nods and NFL championships in 1936, 1939 and 1944.\n\nCecil Isbell (Purdue). Halfback inducted in 1967 was taken seventh in the 1938 draft and made four Pro Bowls with the Packers, including during the championship 1939 season.\n\nKeith Jackson (Oklahoma). Tight end inducted in 2001 played two seasons with the Packers and was part of the 1996 Super Bowl champion squad in a Pro Bowl season.\n\nDick Jauron (Yale). Free safety was inducted as a player in 2015. He went on to become a head NFL coach with the Bears and Bills, but before that, he was the Packers defensive backs coach from 1986-94.\n\nJohn Jefferson (Arizona State). Played from 1981-84 with the Packers, a wide receiver alongside James Lofton in the strike-shortened 1982 season; he was inducted in 2002.\n\nRon Kramer (Michigan). Inducted in 1978 as an end, Kramer played in 1957 and again from 1959-64 with the Packers, with an All-Pro season in 1962 and twice winning an NFL championship.\n\nDarrell Lester (Texas Christian). Center inducted in 1988 was twice named All-American and played for the Packers from 1937-38.\n\nRussell Maryland (Miami). Former No. 1 overall draft pick was a star defensive tackle who played for the Packers in 2000.\n\nRich McGeorge (Elon). Drafted in the first round by the Packers in 1970, the tight end caught 13 touchdowns in his Packers career, stretching until 1978. He was inducted in 2012.\n\nJim McMahon (BYU). Quarterback inducted in 1999 known more for his Bears career, but he was with the Packers in 1995-96.\n\nSteve McMichael (Texas). Longtime Chicago Bears defensive tackle ended his career with Green Bay in 1994. He was an All-American in 1979 and inducted in 2010.\n\nSteve Meilinger (Kentucky). Inducted as an end, halfback and quarterback in 2013, Mellinger was a first-round draft choice by Washington who played from 1958-60 with the Packers.\n\nLou Michaels (Kentucky). Former first-round pick played for the Packers in 1971. Defensive lineman was inducted in 1992, though he was a kicker with the Packers.\n\nDick Modzelewski (Maryland). Inducted in 1993, the standout defensive tackle was twice named All-American and won the Outland Trophy in 1952. He became the Packers defensive coordinator for two seasons and spent 1984-87 on the coaching staff.\n\nKen O'Brien (UC-Davis). Longtime Jets quarterback inducted in 1997 was with the Packers as a member of the practice squad in 1993.\n\nBabe Parilli (Kentucky). Parilli was taken with the fourth overall pick in the 1952 draft by Green Bay after earning All-American honors two years playing under Bear Bryant. He played two years with the Packers and found success later in his career, with three AFL All-Star Game selections starting in 1963.\n\nErny Pinckert (USC). Born in Medford, the halfback became a star at USC and later a two-time Pro Bowler. He was an All-American in 1930.\n\nMerv Pregulman (Michigan). Offensive lineman was drafted in 1944 by the Packers with the seventh pick and played one season.\n\nDave Robinson (Penn State). Linebacker inducted in 1997 won three NFL championships with the Packers and earned a spot on the 1960s all-decade team en route to a spot in the Pro Football Hall of Fame.\n\nDan Ross (Northeastern). Tight end played with the Packers in 1986 after a huge receiving career in college.\n\nRashaan Salaam (Colorado). Heisman Trophy winner in 1994 played for the Packers at running back in 1999.\n\nGeorge Sauer (Nebraska). All-American halfback played from 1935-37 with the Packers. Inducted in 1954.\n\nSterling Sharpe (South Carolina). Wide receiver inducted in 2014 became an All-Pro with the Packers (1989, 1992, 1993) and made five Pro Bowls before his career was cut short by a neck injury.\n\nBruce Smith (Minnesota). Halfback who won the 1941 Heisman Trophy was initially drafted in 1942 played from 1945-48 for the Packers.\n\nErnie Smith (USC). Tackle and placekicker was a unanimous All-American in 1932, and he played from 1935-39 with Green Bay, making the Pro Bowl in his final year.\n\nAaron Taylor (Notre Dame). Offensive guard was Green Bay's first-round pick in 1994, and he spent four seasons with the Packers, with trips to two Super Bowls. He was inducted in 2021.\n\nClayton Tonnemaker (Minnesota). The center and linebacker was drafted with the fourth overall pick in 1950, and he stayed with the Packers until 1954. He was named All-Pro as a rookie and again after war service in 1953.\n\nWesley Walls (Mississippi). Inducted as a tight end and defensive end in 2014, he played tight end in the NFL, including during the 2003 season with the Packers.\n\nReggie White (Tennessee). Defensive tackle and one of the NFL's all-time greats was inducted in 2002; he signed with the Packers as a free agent before the 1993 season and played in two Super Bowls with the Packers, playing with the Packers until 1998.\n\nDick Wildung (Minnesota). First-round pick of the Packers in 1943 and played from 1946-53 as a tackle after two All-American seasons with the Gophers. He was inducted in 1957 and joined the Packers Hall of Fame in 1973.\n\nCharles Woodson (Michigan). Inducted as a cornerback in 2018, Woodson played with the Packers from 2006-12, winning NFL defensive player of the year in 2009 and playing a huge role on the team that won Super Bowl XLV after the 2010 season.\n\nDanny Wuerffel (Florida). Heisman Trophy winner in 1996 spent one season with the Packers in 2000. Quarterback was inducted in 2013.\n\nVince Young (Texas). Quarterback inducted in 2019 briefly played on the Packers practice squad in 2013.\n\nGust Zarnas (Ohio State). Guard inducted in 1975 played for the Packers from 1939-40.\n\nJR Radcliffe can be reached at (262) 361-9141 or jradcliffe@gannett.com. Follow him on Twitter at @JRRadcliffe."}, {"url": "https://soonerswire.usatoday.com/2021/12/08/sooners-legend-bob-stoops-inducted-into-the-college-football-hall-of-fame/", "page_content": "It’s been a wild nine days for Oklahoma Sooners legend Bob Stoops. Last Sunday, he was called into work from the golf course to take the reins as interim head coach after Lincoln Riley’s sudden departure.\n\nStoops was introduced the next day as the interim head coach, and, that afternoon, hit the road to get face time with Oklahoma’s 2022 recruits. As the week went on, he remained committed to his Fox “Big Noon Kickoff” duties, covering the Big 10 title game. And on Tuesday night, he was inducted into the College Football Hall of Fame.\n\nTo say it’s been a whirlwind of a week is an understatement, but as he has done his whole career, Stoops handled it with strength and class.\n\nHis Tuesday night induction makes him the 27th Oklahoma Sooner to be inducted into the College Football Hall of Fame. Stoops joins Barry Switzer, Bennie Owen, Bud Wilkinson, Steve Owens, Billy Sims and Tony Casillas as members of the Hall of Fame.\n\nWith 190 wins, Bob Stoops is the all-time winningest coach in Oklahoma Sooners history. Stoops won a national championship and 10 Big 12 titles with seven top-five finishes in his 18 seasons as the head coach.\n\nNow all eyes turn to Bob Stoops’ return to the sideline as Oklahoma prepares for the Alamo Bowl where it will face Oregon.\n\nContact/Follow us @SoonersWire on Twitter, and like our page on Facebook to follow ongoing coverage of Oklahoma news, notes, and opinions."}, {"url": "https://footballfoundation.org/news/2022/1/10/nff-announces-star-studded-2022-college-football-hall-of-fame-class.aspx", "page_content": "2022 COLLEGE FOOTBALL HALL OF FAME CLASS\n\nLaVar Arrington – LB, Penn State (1997-99)\n\n– LB, Penn State (1997-99) Champ Bailey – DB, Georgia (1996-98)\n\n– DB, Georgia (1996-98) Michael Crabtree – WR, Texas Tech (2007-08)\n\n– WR, Texas Tech (2007-08) Sylvester Croom – C, Alabama (1972-74)\n\n– C, Alabama (1972-74) Mike Doss – S, Ohio State (1999-2002)\n\n– S, Ohio State (1999-2002) Chuck Ealey – QB, Toledo (1969-71)\n\n– QB, Toledo (1969-71) Kevin Faulk – AP/RB, LSU (1995-98)\n\n– AP/RB, LSU (1995-98) Moe Gardner – DT, Illinois (1987-90)\n\n– DT, Illinois (1987-90) Boomer Grigsby – LB, Illinois State (2001-04)\n\n– LB, Illinois State (2001-04) Mike Hass – WR, Oregon State (2002-05)\n\n– WR, Oregon State (2002-05) Marvin Jones – LB, Florida State (1990-92)\n\n– LB, Florida State (1990-92) Andrew Luck – QB, Stanford (2009-11)\n\n– QB, Stanford (2009-11) Mark Messner – DT, Michigan (1985-88)\n\n– DT, Michigan (1985-88) Terry Miller – RB, Oklahoma State (1974-77)\n\n– RB, Oklahoma State (1974-77) Rashaan Salaam – RB, Colorado (1992-94)\n\n– RB, Colorado (1992-94) Dennis Thomas – C, Alcorn State (1971-73)\n\n– C, Alcorn State (1971-73) Zach Wiegert – OT, Nebraska (1991-94)\n\n– OT, Nebraska (1991-94) Roy Williams – DB, Oklahoma (1999-2001)\n\nJohn Luckhardt – 225-70-2 (76.1%); Washington & Jefferson [PA] (1982-98), California [PA] (2002-11)\n\n– 225-70-2 (76.1%); Washington & Jefferson [PA] (1982-98), California [PA] (2002-11) Billy Jack Murphy – 91-44-1 (67.3%); Memphis (1958-71)\n\n– 91-44-1 (67.3%); Memphis (1958-71) Gary Pinkel – 191-110-3 (63.3%); Toledo (1991-2000), Missouri (2001-15)\n\n2022 COLLEGE FOOTBALL HALL OF FAME CLASS NOTES\n\nPLAYERS\n\n1 Heisman Trophy winner (Salaam)\n\n10 unanimous First Team All-Americans (Arrington, Crabtree (2), Doss, Gardner, Jones, Messner, Miller, Salaam, Wiegert, Williams)\n\n3 consensus First Team All-Americans (Bailey, Gardner, Jones)\n\n8 multi-year First Team All-Americans (Arrington (2), Crabtree (2), Doss (3), Gardner (2), Grigsby (3), Jones (2), Miller (2), Thomas (2))\n\n9 winners of college football major awards (Arrington – Bednarik, Butkus; Bailey – Nagurski; Crabtree – Biletnikoff (2); Hass – Biletnikoff; Jones – Butkus, Lombardi; Luck – Maxwell, Walter Camp; Salaam – Doak Walker, Heisman, Walter Camp; Wiegert – Outland; Williams – Nagurski, Thorpe)\n\n4 members of national championship teams (Croom, Doss, Wiegert, Williams)\n\n11 conference players of the year (Arrington, Doss, Ealey (3), Gardner, Grigsby (3), Luck (2), Messner, Miller (2), Salaam, Thomas, Williams)\n\n9 members of conference championship teams (Croom (3), Doss, Ealey (3), Gardner, Jones, Messner (2), Miller, Wiegert (4), Williams)\n\n9 players who still hold school records (Crabtree, Doss, Faulk, Grigsby, Hass, Luck, Messner, Miller, Salaam)\n\n11 played for College Football Hall of Fame coaches (Arrington – Joe Paterno; Bailey – Jim Donnan; Croom – Paul \"Bear\" Bryant; Doss – John Cooper & Jim Tressel; Hass – Dennis Erickson; Jones – Bobby Bowden; Messner – Bo Schembechler; Salaam – Bill McCartney; Thomas – Marino Casem; Wiegert – Tom Osborne; Williams – Bob Stoops)\n\n8 first-round NFL draft picks (Arrington, Bailey, Crabtree, Jones, Luck, Miller, Salaam, Williams)\n\n10 offensive players (Crabtree, Croom, Faulk, Hass, Luck, Miller, Salaam, Thomas, Wiegert)\n\n8 defensive players (Arrington, Bailey, Doss, Gardner, Grigsby, Jones, Messner, Williams)\n\n5 decades represented: 1970s (4) – Croom, Ealey, Miller, Thomas; 1980s (2) – Gardner, Messner; 1990s (6) – Arrington, Bailey, Faulk, Jones, Salaam, Wiegert; 2000s (5) – Crabtree, Doss, Grigsby, Hass, Williams; 2010s (1) – Luck\n\n1 school with its first-ever Hall of Fame player (Illinois State – Grigsby)\n\nCOACHES\n\n18 conference championships (Luckhardt – 14, Murphy – 3, Pinkel – 1)\n\nMost wins in school history (Luckhardt – California [PA]; Murphy – Memphis; Pinkel – Toledo, Missouri)\n\n28 Bowl/postseason appearances (Luckhardt – 16, Murphy – 1, Pinkel – 11)\n\n24 First Team All-Americans coached (Luckhardt – 11, Murphy – 4, Pinkel – 9)\n\n28 conference coach of the year honors (Luckhardt – 21, Murphy – 3, Pinkel – 4)\n\n1 school with its first-ever Hall of Fame coach or player inductee (California [PA] – Luckhardt)\n\nSELECTION CRITERIA\n\nCOLLEGE FOOTBALL HALL OF FAME QUICK FACTS\n\nWhen the 2022 Hall of Fame Class is officially inducted in December, only 1,056 players and 226 coaches will have been inducted into the College Football Hall of Fame from the nearly 5.54 million who have played or coached the game during the past 152 years. In other words, less than two one-hundredths of a percent (.02%) of the individuals who have played the game have earned this distinction.\n\nand will have been inducted into the College Football Hall of Fame from the nearly who have played or coached the game during the past 152 years. In other words, less than of the individuals who have played the game have earned this distinction. Founded in 1947, The National Football Foundation & College Hall of Fame inducted its first class of inductees in 1951. The first class included 32 players and 22 coaches, including Illinois' Red Grange , Notre Dame's Knute Rockne , Amos Alonzo Stagg and Carlisle (PA)'s Jim Thorpe .\n\n, Notre Dame's , and Carlisle (PA)'s . 317 schools are represented with at least one College Football Hall of Famer.\n\nare represented with at least one College Football Hall of Famer. Induction for the 2022 Class will take place Dec. 6 during the 64th NFF Annual Awards Dinner Presented by Las Vegas at the Bellagio Resort & Casino.\n\n2022 College Football Hall of Fame Class Bios\n\nL A VAR ARRINGTON\n\nPenn State University\n\nLinebacker, 1997-99\n\nCHAMP BAILEY\n\nUniversity of Georgia\n\nDefensive Back, 1996-98\n\nMICHAEL CRABTREE\n\nTexas Tech University\n\nWide Receiver, 2007-08\n\nSYLVESTER CROOM\n\nUniversity of Alabama\n\nCenter, 1972-74\n\nMIKE DOSS\n\nOhio State University\n\nSafety, 1999-2002\n\nCHUCK EALEY\n\nUniversity of Toledo\n\nQuarterback, 1969-71\n\nKEVIN FAULK\n\nLouisiana State University\n\nAll-Purpose/Running Back, 1995-98\n\nMOE GARDNER\n\nUniversity of Illinois\n\nDefensive Tackle, 1987-90\n\nBOOMER GRIGSBY\n\nIllinois State University\n\nLinebacker, 2001-04\n\nMIKE HASS\n\nOregon State University\n\nWide Receiver, 2002-05\n\nMARVIN JONES\n\nFlorida State University\n\nLinebacker, 1990-92\n\nANDREW LUCK\n\nStanford University\n\nQuarterback, 2009-11\n\nMARK MESSNER\n\nUniversity of Michigan\n\nDefensive Tackle, 1985-88\n\nTERRY MILLER\n\nOklahoma State University\n\nRunning Back, 1974-77\n\nRASHAAN SALAAM\n\nUniversity of Colorado\n\nRunning Back, 1992-94\n\nDENNIS THOMAS\n\nAlcorn State University\n\nCenter, 1971-73\n\nZACH WIEGERT\n\nUniversity of Nebraska\n\nOffensive Tackle, 1991-94\n\nROY WILLIAMS\n\nUniversity of Oklahoma\n\nDefensive Back, 1999-2001\n\nJOHN LUCKHARDT\n\nWashington & Jefferson College [PA] (1982-98), California University [PA] (2002-11)\n\nHead Coach, 225-70-2 (76.1%)\n\nBILLY JACK MURPHY\n\nUniversity of Memphis (1958-71)\n\nHead Coach, 91-44-1 (67.3%)\n\nGARY PINKEL\n\nUniversity of Toledo (1991-2000), University of Missouri (2001-15)\n\nHead Coach, 191-110-3 (63.3%)\n\nNote: Updated on May 11, 2022, to include location of NFF Annual Awards Dinner.IRVING, Texas (Jan. 10, 2022) – The National Football Foundation (NFF) & College Hall of Fame announced today the 2022 College Football Hall of Fame Class during \"Championship Drive Presented by Capital One\" on ESPN.The 18 First Team All-America players and three standout coaches in the 2022 Class were selected from the national ballot of 78 players and seven coaches from the Football Bowl Subdivision, the 99 players and 33 coaches from the divisional ranks and the NFF Veterans Committee candidates.\"We are extremely proud to announce the 2022 College Football Hall of Fame Class,\" said, NFF Chairman and a 1989 College Football Hall of Famer from Mississippi. \"Each of these men has established himself among the absolute best to have ever played or coached the game, and we look forward to immortalizing their incredible accomplishments.\"The 2022 College Football Hall of Fame Class will officially be inducted during the 64th NFF Annual Awards Dinner Presented by Las Vegas on Dec. 6 at the Bellagio Resort & Casino in Las Vegas.for more information on the event.The inductees will also be recognized at their respective collegiate institutions with NFF Hall of Fame On-Campus Salutes, presented by Fidelity Investments, during the fall. Their accomplishments will be forever immortalized at the Chick-fil-A College Football Hall of Fame in Atlanta, and each inductee will receive a custom ring created by Jostens, the official and exclusive supplier of NFF rings.The announcement of the 2022 College Football Hall of Fame Class was made today during \"Championship Drive Presented by Capital One\" leading up to tonight's College Football Playoff National Championship.\"We want to thank ESPN for the opportunity to announce the 2022 College Football Hall of Fame Class during today's lead up to the College Football Playoff National Championship,\" said NFF President & CEO. \"Today's announcement shines a light on the accomplishments of some of college football's greatest legends.\"1. First and foremost, a player must have received First Team All-America recognition by a selector recognized by the NCAA and utilized to comprise its consensus All-America teams.2. A player becomes eligible for consideration by the NFF's Honors Court 10 full seasons after his final year of intercollegiate football played.3. While each nominee's football achievements in college are of prime consideration, his post football record as a citizen is also weighed. He must have proven himself worthy as a citizen, carrying the ideals of football forward into his relations with his community. Consideration may also be given for academic honors and whether or not the candidate earned a college degree.4. Players must have played their last year of intercollegiate football within the last 50 years*. For example, to be eligible for the 2022 ballot, the player must have played his last year in 1972 or thereafter. In addition, current professional players and/or coaches are not eligible until retirement.5. A coach becomes eligible three full seasons after retirement or immediately following retirement provided he is at least 70 years old. Active coaches become eligible at 75 years of age. He must have been a head football coach for a minimum of 10 years and coached at least 100 games with a .600 winning percentage.6. Nominations may only be submitted by the current athletics director, head coach or sports information director (SID) of a potential candidate's collegiate institution. Nominations may also be submitted by the president/executive director of a dues-paying chapter of the National Football Foundation.* Players that do not comply with the 50-year rule may still be eligible for consideration by the Football Bowl Subdivision and Divisional Veterans Committees. Veterans Committee candidates must still meet First Team All-America requirement.Known for the \"LaVar Leap\" where he would jump over the offensive line,was one of the most feared linebackers in the late 1990s. The Pittsburgh native becomes the 19th Penn State player to enter the College Football Hall of Fame.The 12th Nittany Lion ever selected as a two-time First Team All-American, Arrington earned unanimous honors in 1999. In 1999, he was the recipient of the Butkus Award as the nation's top linebacker and the Bednarik Award as the country's top defensive player. A finalist for the Nagurski and Lombardi awards, Arrington finished ninth in the 1999 Heisman Trophy voting. A two-time First Team All-Big Ten honoree, Arrington became the first sophomore to ever be named the Big Ten Defensive Player of the Year when he received the honor in 1998.The 1999 Jack Lambert Award recipient led the Nittany Lions to three bowl games, including wins in the 1999 Outback Bowl and the 1999 Alamo Bowl. Penn State finished with top 20 national rankings all three years of his career, highlighted by a No. 11 finish in 1999. Arrington racked up 173 tackles, 39 tackles for loss, 19 sacks and three interceptions while playing for College Football Hall of Fame coach. The Big Ten Network named him to its \"Mount Rushmore of Penn State Football,\" and he was elected to the WPIAL Hall of Fame in 2011 for his excellence at North Hills High School in Pittsburgh.The second overall pick in the 2000 NFL Draft by the Washington Football Team, Arrington played for Washington from 2000-05 and then for the New York Giants in 2006. He was a three-time Pro Bowl selection.Following his NFL career, Arrington began a successful broadcasting career. Currently working for FOX Sports Radio, he is the co-host of the network's weekday morning show \"2 Pro's and a Cup of Joe\" alongsideand. He is also co-host of the nationally-syndicated weekend program/podcast \"Up On Game\" withand. Arrington has also been featured on FOX Sports television programs, including FS1's \"Speak for Yourself.\"One of the most versatile players in Georgia history,played more than 1,000 snaps on offense, defense and special teams during his remarkable 1998 season. The Folkston, Georgia, native becomes the 16th Bulldog player to join the College Football Hall of Fame.The 1998 consensus First Team All-American took home the Nagurski Trophy as the nation's top defensive player that season while finishing seventh for the Heisman Trophy. During that standout season, Bailey was a team captain and saw action at defensive back and wide receiver while also returning kickoffs. He was named the SEC Player of the Week against Auburn that season after a performance that included a career-high 119 plays highlighted by a fourth-quarter interception.A two-time First Team All-SEC selection (1997, 1998), he was also named to the SEC All-Freshman Team in 1996. The inaugural recipient of the UGA Vince Dooley MVP Award, Bailey led the Bulldogs to consecutive postseason wins at the 1998 Outback Bowl and the 1998 Peach Bowl, where he won Defensive MVP honors. He helped UGA to national rankings in 1997 (No. 10) and 1998 (No. 14) while playing for College Football Hall of Fame Coachand alongside Hall of Famer. A member of the FWAA's 75th Anniversary All-America Team, Bailey finished his career at Georgia with 147 tackles, eight interceptions and 27 pass breakups while racking up 978 receiving yards and five touchdowns on offense.The seventh overall pick by Washington in the 1999 NFL Draft, Bailey played 15 seasons for Washington (1999-2003) and the Denver Broncos (2004-13). The 12-time Pro Bowl selection is a member of the NFL's 2000s All-Decade Team, and he was inducted into the Pro Football Hall of Fame in 2019.While with the Broncos, Bailey donated time and money to the Denver Rescue Mission, and he worked with The Crossing in Park Hill, a transitional housing program in Denver. He also supports the Bailey Brothers Foundation with his brother and fellow Georgia football alum,. The 2018 State of Georgia Sports Hall of Fame inductee was also a record-setting track and field athlete at UGA.The first two-time winner of the Biletnikoff Award,was one of the most electric wide receivers in college football history. The Dallas native becomes the sixth Red Raider player in the College Football Hall of Fame.The only two-time unanimous First Team All-American (2007, 2008) in Texas Tech history, Crabtree finished fifth in the 2008 Heisman Trophy voting. The 2007 Freshman All-American burst onto the scene by setting still-standing freshman single-season FBS records for receiving yards (1,962), receptions (134), receiving yards per game (150.9), touchdown receptions (22), receptions per game (10.3) and 100-yard receiving games (11). Crabtree still ranks in the top 15 all-time in nine FBS receiving categories, with his 1,962 receiving yards in 2007 currently third in FBS single-season history. A two-time recipient of the Paul Warfield Award, Crabtree was named CBSSports.com's National Freshman of the Year and the AT&T All-America Player of the Year in 2007.A two-time First Team All-Big 12 selection, Crabtree was named the Big 12 Co-Offensive Freshman of the Year in 2007. Despite playing just two seasons, he remains Texas Tech's all-time leader with 41 career receiving touchdowns and 15 career 100-yard receiving games while ranking second with 3,127 career receiving yards. His 1,962 receiving yards and 134 receptions in 2007 are both Big 12 and Red Raider records, and he owns the top two single-season receiving touchdown marks in school history (22 in 2007, 19 in 2008). The 2007 Texas Tech team MVP owns nearly every freshman receiving record in the Big 12 and Red Raider record books. In 2008, Crabtree led Texas Tech to a share of the Big 12 South Division title, an 11-2 record and the No. 12 final ranking. His highlight moment came against Texas that season, in which he hauled in the game-winning 28-yard touchdown with one second remaining to shock No. 1 Texas. Crabtree led the Red Raiders to two bowl games, including a win in the 2008 Gator Bowl. The 2020 Texas Tech Hall of Fame inductee was named to the school's Football Ring of Honor in 2021.The 10th overall pick in the 2009 NFL Draft by the San Francisco 49ers, Crabtree played 11 seasons with the 49ers (2009-14), Oakland Raiders (2015-17), Baltimore Ravens (2018) and Arizona Cardinals (2019).Off the field, he established the Crab5 Foundation, which hosts numerous events each year for underprivileged youth. Crabtree also fully endowed a scholarship at Texas Tech in 2019.Highlighted by a national championship,was a leader at center during one of the most successful runs in Alabama history. The Tuscaloosa, Alabama, native becomes the 20th Crimson Tide player to be inducted into the College Football Hall of Fame.A 1974 First Team All-American, Croom helped the Crimson Tide to a UPI national title in 1973. The 1974 First Team All-SEC selection and Jacobs Blocking Trophy recipient led Alabama to three consecutive conference titles. The 1974 team captain led the Tide to three bowl games and three top 10 final national rankings (No. 7 in 1972, No. 4 in 1973 and No. 5 in 1974).Behind Croom's stellar blocking, the Tide averaged 414.7 yards per game in 1972, 480.7 yards per game in 1973 and 388.3 yards per game in 1974. During his three seasons, Alabama posted an impressive 32-4 record, with only one loss coming during the regular season. Croom capped his collegiate career in the 1975 Senior Bowl after playing for College Football Hall of Fame Coachand alongside Hall of Famersandin Tuscaloosa. He was inducted into the State of Alabama Sports Hall of Fame in 2020, and the Crimson Tide's spring practice award is named the Sylvester Croom Commitment to Excellence Award in his honor.After going undrafted in 1975, Croom played one season with the New Orleans Saints before returning to Alabama to begin his storied coaching career. After serving on the Crimson Tide staff from 1976-86 under his former coach Bryant and, he then coached in the NFL from 1987-2003. In 2004, Croom made history when Mississippi State hired him as the first Black head football coach in SEC history. He was named the SEC Coach of Year in 2007. Following five seasons at Mississippi State, Croom returned to the NFL as an assistant coach before retiring following the 2017 season.Croom is heavily involved with College View Baptist Church, which was started by his father who was an All-American at Alabama A&M.One of just eight three-time All-Americans in Ohio State history,capped his remarkable career by leading the Buckeyes to a national championship. The Canton, Ohio, native becomes the school's 27th player to join the College Football Hall of Fame.A First Team All-American during his last three seasons at Ohio State, Doss earned unanimous honors following his stellar senior campaign in 2002 in which he recorded a personal best 107 tackles. That season, the team captain and Thorpe Award finalist led the Buckeyes to a perfect 14-0 record, the Big Ten title, the No. 1 final ranking and the BCS National Championship following a victory over Miami (FL) in the Fiesta Bowl. Doss was named the Defensive MVP of that 31-24 double-overtime victory after recording nine tackles and a 35-yard interception return that led to Ohio State's first touchdown of the game on its ensuing possession. The 2002 season was the Buckeyes' first 14-0 season in school history and their first undefeated season since 1973.The 2002 Big Ten Defensive Player of the Year, Doss was a three-time First Team All-Big Ten selection. Boasting the most career tackles by a defensive back in school history (331), he led Ohio State in tackles as a sophomore and junior. His 228 career solo tackles are the fifth most in Buckeyes history. A 2011 Ohio State Athletics Hall of Fame inductee, Doss played for College Football Hall of Fame CoachesandA second-round pick by the Indianapolis Colts in the 2003 NFL Draft, Doss played six seasons for the Colts (2003-06), Minnesota Vikings (2007) and Cincinnati Bengals (2008). He won Super Bowl XLI as a member of the Colts.In 2005, he founded the Michael A. Doss Foundation, which focuses on education and social welfare. He has also hosted \"Make a Difference\" youth camps. In 2019, Doss earned a master's in business operational excellence from Ohio State, and he is now a licensed real estate agent for the Robert Weiler Company in Columbus, Ohio.The signal caller for the best run in Toledo football history,never lost a game in his three seasons as the Rockets' starting quarterback. The NFF Veterans Committee selection becomes the second player in school history to enter the College Football Hall of Fame.Named a 1971 First Team All-American, Ealey went a remarkable 35-0 as Toledo's starting quarterback. The three-time MAC Back of the Year became the first player in conference history to receive votes for the Heisman Trophy, tallying 168 points for an eighth-place finish in 1971. A three-time First Team All-MAC selection, Ealey led the Rockets to three consecutive conference titles. He guided the team to three-straight Tangerine Bowl victories, earning MVP honors in all three games.A 1971 team captain, Ealey finished his career as Toledo's all-time leader with 5,275 passing yards and 45 touchdown passes, both marks that still rank in the top 10. In both 1970 and 1971, he received the team's Jim Nicholson Award. Voted No. 1 on Toledo's All-Century Football Team, Ealey is one of just four players to have his number retired by the Rockets. The Portsmouth, Ohio, native played alongside College Football Hall of Famerduring his time in the Glass Bowl.After going undrafted by the NFL, Ealey signed with the Hamilton Tiger-Cats of the Canadian Football League. Taking over as the starting quarterback in 1972, he would go on to win the CFL's Most Outstanding Rookie Award and lead the Tiger-Cats to a victory in the Grey Cup, where he earned MVP honors. In total, Ealey played seven seasons in the CFL with the Tiger-Cats (1972-74), Winnipeg Blue Bombers (1974-75) and Toronto Argonauts (1975-78).Following his football career, Ealey served as a financial advisor in the Toronto area. He currently serves as a consultant and public speaker, helping people of all ages discover and embrace their undefeated spirit so they can better themselves and their community. He founded the Chuck Ealey Foundation, which annually awards academic scholarships to college and high school recipients of The Chuck Ealey Undefeated Spirit Award. The Chuck Ealey Foundation also provides opportunities to high school students to help build their mentoring skills while guiding underprivileged youth to discover and embrace their sense of self-worth and \"undefeated spirit.\"The epitome of an all-purpose player,remains the SEC's leader in career all-purpose yards and LSU's all-time leading rusher. The Lafayette, Louisiana, native becomes the 11th Tiger player to enter the College Football Hall of Fame.A 1996 First Team All-American as an all-purpose player, Faulk still holds the all-time SEC record with 6,833 all-purpose yards, a mark that was fourth in FBS history when he finished his career. During that 1996 season, he led the SEC in all-purpose yards and ranked second in the league in rushing. Faulk followed up his All-America campaign by leading the SEC in rushing during both his junior and senior seasons, and he also topped the league in scoring as a senior. The three-time First Team All-SEC selection was the first player in LSU history to average more than 100 yards per game during his entire career.Setting 11 school records by career's end, Faulk still holds LSU career marks for rushing yards (4,577), rushing touchdowns (46), all-purpose yards (6,833) and 100-yard rushing games (22). The 1995 SEC Freshman of the Year ranks fourth in the conference in career rushing yards and is tied for third in career rushing touchdowns. A two-time LSU MVP, Faulk led the Tigers to two top-15 final rankings and three bowl victories, earning offensive MVP honors following the 1995 Independence Bowl after setting LSU bowl records with 234 rushing yards and 271 all-purpose yards. Faulk owns LSU's single-game all-purpose yards record (376 vs. Houston, 1996), and ranks fifth in school history with 832 punt return yards. He is also a member of the LSU Athletics and State of Louisiana Sports halls of fame.Taken in the second round of the 1999 NFL Draft by the New England Patriots, Faulk spent his entire 13-year career with the franchise. The 2016 New England Patriots Hall of Fame inductee led the team to three Super Bowl titles (XXXVI, XXXVIII, XXXIX), and he holds the franchise record for career all-purpose yards.Following his pro career, Faulk served as an assistant football coach from 2013-17 at his former high school, Carencro High School in Lafayette, Louisiana. He then served on the coaching staff at his alma mater, LSU, from 2018-21. He annually hosts a free youth football camp in Louisiana, and he founded the Kevin Faulk Foundation to support youth. He is the cousin of 2017 College Football Hall of Fame inducteefrom San Diego State.A two-time First Team All-American,was described by Illinois head coachas \"the best player at any position in college football\" during his senior campaign in 1990. The Indianapolis, Indiana, native becomes the 13th Fighting Illini player to enter the College Football Hall of Fame.Gardner earned unanimous First Team All-America honors in 1989 before earning consensus laurels as a senior in 1990. In 1989, he was named the Big Ten Lineman of the Year and an Outland Trophy finalist after leading the Illini to a No. 10 final ranking and a win in the 1990 Citrus Bowl – the program's first bowl victory since 1964. The following season, Gardner was a Rotary Lombardi Award finalist and earned Big Ten Defensive Player of the Year honors after guiding Illinois to a share of the 1990 conference title and a No. 25 final ranking.A four-time All-Big Ten selection, Gardner earned first team honors from 1988-90 after second team recognition as a freshman. The two-year team captain finished his career with a school-record 57 tackles for loss, which currently rank second, and he led the Illini in the category during his final three seasons. Chosen as the 1989 team MVP, Gardner is tied for fifth all-time at Illinois with 18 career sacks. A 2020 Illinois Athletics Hall of Fame inductee, he was named to the school's all-century team as an active player in 1990.A fourth-round pick by in the 1991 NFL Draft, Gardner played six seasons for the Atlanta Falcons from 1991-96.After earning a master's degree in library information sciences from Clark Atlanta University, Gardner currently works as a public services librarian principal at the Auburn Avenue Research Library on African American Culture and History in Atlanta, serving in the reference, research and programs division. His responsibilities include assisting scholars and PhD candidates who study the African diaspora on a global scale.The all-time leading tackler in FCS history,is the only three-time Missouri Valley Football Conference Defensive Player of the Year in league history. The Canton, Illinois, native deservedly becomes the first Redbird player to enter the College Football Hall of Fame.A three-time First Team All-American (2002-04), Grigsby remains the FCS leader in career tackles (550), career solo tackles (325), single-season tackles per game (16.27 in 2002) and single-season solo tackles per game (9.82 in 2002). The standout linebacker is the only player in history to finish in the top three for the Buck Buchanan Award in three consecutive seasons. Grigsby ranks second all-time in FCS history with 12.5 tackles per game during his career, and he boasts two of the top three single-season solo tackle performances in FCS history: 109 in 2003 and 108 in 2002. He twice won the College Sporting News FCS Defensive Player of the Year award, which has since been renamed in his honor.The three-time First Team All-MVFC selection remains the all-time leading tackler in conference and school history (note: both the MVFC and Illinois State credit him with 580 career tackles). Grigsby was also an honorable mention all-conference selection in 2001 when he was named to the MVFC All-Newcomer Team. He led the FCS in tackles in 2002, led the conference in tackles three times and led Illinois State in tackles all four seasons. A three-time team captain, Grigsby was also twice named the Illinois State Milt Weisbecker Male Athlete of the Year, and he was inducted into the Illinois State Athletics Percy Family Hall of Fame in 2010.A fifth-round pick in the 2005 NFL Draft, Grigsby played in league for the Kansas City Chiefs (2005-07), Miami Dolphins (2008) and Houston Texans (2009).Off the field, he established the Boomer Grigsby Foundation, and he has volunteered with Jared Allen's Homes for Wounded Warriors and the Special Olympics. Grigsby continued his relationship with ISU football as the color analyst for Redbird football broadcasts on NBC Sports Chicago for three seasons, and he served as a television analyst for Illinois High School Association football playoff broadcasts for two years. He currently works in Las Vegas as a sales representative for Stryker.After receiving no Division I scholarship offers and walking on at Oregon State,left the university as its all-time leading receiver while boasting a Biletnikoff Award. The Portland, Oregon, native becomes the third Beaver player to join the College Football Hall of Fame.The 2005 First Team All-American and Biletnikoff Award recipient was just the 10th player in NCAA history and the only Oregon State player ever with three seasons of 1,000-plus receiving yards. During his stellar senior season in 2005, Hass led the nation with 139.9 receiving yards per game. He set then-school records for single-season receptions (90) and receiving yards (1,532 – also a Pac-10 mark at the time), surpassing his own records set in 2004 when he was a Third Team All-American. The 2005 team captain led the Beavers to three consecutive bowl berths, including wins in the 2003 Las Vegas Bowl and 2004 Insight Bowl.A two-time First Team All-Pac-10 selection, Hass' 3,924 career receiving yards rank third all-time in conference history. In addition to being the school's all-time leading receiver, he owns Oregon State records for career 100-yard games (19), single-season 100-yard games (nine in 2005) and single-game receptions (14 vs. Arizona State in 2004). Hass owns four of the top 10 single-game receiving performances in school history, including a Beaver record 293 yards against Boise State in 2004. His 20 career receiving touchdowns are second in school annals while his 220 receptions rank fourth.A sixth-round pick by the New Orleans Saints in the 2006 NFL Draft, Hass played in the league for the Chicago Bears (2006-08) and the Seattle Seahawks (2009). He also played for the Omaha Nighthawks in the United Football League from 2010-11.Hass earned his degree in civil engineering from Oregon State in 2007. Following his football career, he worked in the development department at Nike, helping design sporting equipment. Hass is currently a project manager at Pacific GeoSource, an industry leader in pavement design and engineering. He has also coached youth football.A dominant force on Florida State's stellar teams in the early 1990s,became the first player from the university to win two national awards in the same season. The Miami, Florida, native becomes the eighth Seminole player in the College Football Hall of Fame.A two-time First Team All-American, Jones earned consensus honors in 1991 and unanimous honors in 1992. During his stellar 1992 campaign, he won the Butkus and Rotary Lombardi awards and finished fourth for the Heisman Trophy. Jones tallied 111 tackles that year while guiding the Seminoles to the ACC title, an 11-1 record and the No. 2 final ranking after a win over Nebraska in the Orange Bowl. The 1992 First Team All-ACC selection was also named the Sporting News Defensive Player of the Year and received the Jack Lambert Trophy.In 1991, Jones tallied 125 tackles while leading Florida State to an 11-2 record and a No. 4 final ranking following a win over Texas A&M in the Cotton Bowl. A Third Team All-American as a freshman in 1990, he guided that squad to a 10-2 record, No. 4 ranking and a win in the Blockbuster Bowl. Prior to joining the ACC in 1992, Jones was a two-time First Team All-South Independent selection. He ranks seventh in Seminole history with 369 career tackles despite playing just three seasons. One of 11 players in school history to have his number retired, Jones was inducted into the Florida State Athletics Hall of Fame in 2000. Coached by College Football Hall of Famer, he played alongside Hall of Famersandduring his time in Tallahassee.The fourth overall selection in the 1993 NFL Draft, Jones played his entire 11-year career with the New York Jets from 1993-2003.A coach in the champions pro indoor football league from 2019-22, Jones won the league championship in 2021 and reached the championship game again in 2022. He was named the first head coach for the Indoor Football League's Tulsa Oilers when they begin their inaugural season in 2023.One of the most precise passers in college football history,put together a record-setting career at Stanford that saw him claim multiple national awards. The Houston, Texas, native becomes the 19th Cardinal player to join the College Football Hall of Fame.A 2011 First Team All-American, Luck took home the Maxwell, Walter Camp and Johnny Unitas Golden Arm awards. The two-time Heisman Trophy runner-up (2010, 2011) transformed a Stanford program that had suffered seven-straight losing seasons before he became the starter in 2009. Luck would lead the Cardinal to a 31-7 record, including three-straight postseason berths and consecutive top 10 final rankings in 2010 (No. 4) and 2011 (No. 7). He was named the MVP at the 2011 Orange Bowl after throwing for 287 yards and four touchdowns in a win over Virginia Tech, which gave Stanford a school-record 12 wins.A two-time Pac-12 Offensive Player of the Year, Luck led the conference in multiple categories during his stellar 2011 campaign, including completion percentage (71.3) and passing efficiency (169.7). The two-time First Team All-Pac-12 selection is Stanford's all-time leader in career passing touchdowns (82) and passing efficiency (162.8). Ranking second in Cardinal history with 9,430 career passing yards, Luck owns two of the top four passing seasons in school history: 3,517 yards in 2011 and 3,338 in 2010. His .670 career completion percentage is the best in Stanford annals, as are his single-season completion percentages in 2010 (.707) and 2011 (.713). His 37 touchdown passes in 2011 are a single-season school record, followed by his 32 touchdown passes in 2010.Luck presided over three of the most prolific offensive teams in Stanford history, helping the Cardinal to scoring records in 2009 (461), 2010 (524) and 2011 (561). Just as proficient in the classroom, he was named the 2011 Academic All-American of the Year, and he was a three-time First Team Academic All-Pac-12 honoree and a member of the NFF Hampshire Honor Society.The first overall pick in the 2012 NFL Draft, Luck spent his entire seven-year career with the Indianapolis Colts from 2012-18. The four-time Pro Bowler was named the 2018 Comeback Player of the Year, and he owns the NFL rookie record for passing yards (4,373).Luck is involved with several philanthropic pursuits, including Riley Children's Foundation and the Andrew Luck Book Club. He was previously honored by the NFF in 2008 as an NFF National High School Scholar-Athlete. Luck is now retired and living in Indianapolis.One of the greatest defensive players in Michigan history,terrorized offenses while becoming the Wolverines' all-time leader in sacks and tackles for loss. The Hartland, Michigan, native becomes the 33rd player in school history to be elected to the College Football Hall of Fame.A unanimous First Team All-American in 1988, Messner started every game of his career (49) at Michigan. The 1988 Rotary Lombardi Award finalist remains the Wolverines' all-time career leader with 70 tackles for loss, 376 tackles for loss yardage, 36 sacks and 273 sack yardage. Named the 1988 Big Ten Defensive Lineman of the Year, Messner led Michigan to conference titles in 1986 and 1988. He was the first player in Big Ten history to be a first team all-conference selection in four consecutive years, and his career tackles for loss and sacks are both tied for third in the Big Ten record books.The 1988 team captain led the Wolverines to three bowl victories, including the 1986 Fiesta Bowl where he earned Defensive MVP honors, as well as the 1988 Hall of Fame Bowl and the 1989 Rose Bowl. Messner guided the Wolverines to a 38-9-2 record and four final national rankings, including two top five finishes in 1985 (No. 2) and 1988 (No. 4). Michigan's sack leader all four seasons, his five sacks against Northwestern in 1987 remain a school single-game record. The Wolverines' 1987 team MVP and 1986 Defensive MVP led the team to a 3-1 record against archrival Ohio State. Messner was coached by College Football Hall of Famerand played alongside Hall of Famerduring his time in Ann Arbor. He capped his collegiate career in the Hula Bowl all-star game.A sixth-round pick in the 1989 NFL Draft, Messner played one season for the Los Angeles Rams before a career-ending injury.After retiring from football, Messner worked for Eastman Kodak, and he currently serves as a market vice president at Konica Minolta. He is also a board member of Meals on Wheels PLUS of Manatee in Florida.One of only three players in Big Eight history to rush for more than 4,000 yards during his career,'s 4,754 yards were the fourth most in NCAA history when his career ended. The Colorado Springs, Colorado, native becomes the fifth Oklahoma State player to enter the College Football Hall of Fame.A two-time First Team All-American, Miller earned unanimous honors in 1977, and he twice finished as a top five Heisman Trophy finalist (second in 1977 and fourth in 1976). The only rusher in Oklahoma State history with three 1,000-yard seasons, he ranked fifth in the nation in rushing yards in 1976 (1,714) and third in 1977 (1,680). Miller also led the nation with 23 rushing touchdowns in 1976. The two-time Big Eight Offensive Player of the Year (1976, 1977) led the Cowboys to the 1976 conference title and postseason wins in the 1974 Fiesta Bowl and 1976 Tangerine Bowl, which led to a final No. 14 ranking for the Pokes.Miller led the Big Eight in rushing his final two seasons, boasting 1,887 yards in 1976 (note: Oklahoma State credits him with a different total than the NCAA) and 1,680 yards in 1977 – marks that rank third and sixth all-time, respectively, at Oklahoma State. He owns the Cowboy record with 26 career games with 100 yards rushing. Sitting behind fellow College Football Hall of Fame running backsand/orin nearly every other school career rushing category, Miller ranks second in rushing yards (4,754), rushing touchdowns (49) and rushing yards per game (113.2) while placing third in career all-purpose yards (5,305).The fifth overall pick in the 1978 NFL Draft by the Buffalo Bills, Miller played for the Bills from 1978-80 before one season with the Seattle Seahawks in 1981.Miller has been a regular volunteer for the Fellowship of Christian Athletes and Payne County Youth Services, among many other organizations. He is now retired and living in Stillwater.The winner of the 1994 Heisman Trophy,was just the fourth player in NCAA history to run for 2,000 yards in a season. The San Diego native becomes the ninth Buff player to be inducted into the College Football Hall of Fame.A unanimous First Team All-American in 1994, Salaam also claimed the Walter Camp and Doak Walker awards in addition to the Heisman Trophy. That season, the 1994 Big Eight Offensive Player of the Year led the nation in rushing yards (2,055), scoring (144) and all-purpose yards (2,349), all while not playing in the fourth quarter in five games. Salaam led the 1994 Buffs to an 11-1 record and the No. 3 final ranking after a win over Notre Dame in the 1995 Fiesta Bowl. He led Colorado to two other bowl berths, including a win in the 1993 Aloha Bowl where he was named MVP, and two other top 20 finishes in 1992 (No. 13) and 1993 (No. 16).Salaam was a two-time First Team All-Big Eight selection, including unanimous recognition in 1994, and he led the Buffs to second place finishes in the conference all three seasons. He still owns 18 school records, including many single-season marks for rushing yards (2,055), touchdowns (24), points (144) and all-purpose yards (2,349), all set during his 1994 Heisman campaign. That season, Salaam also set Colorado single-season records with 10 games of 100 yards rushing, four games of 200 yards rushing and nine consecutive games with 100 yards rushing. He finished his career with 3,057 rushing yards, which rank fourth all-time at Colorado. During his time in Boulder, Salaam played for College Football Hall of Fame Coachand alongside Hall of FamerA first-round pick in the 1995 NFL Draft by the Chicago Bears, Salaam played three seasons with the Bears (1995-97), and he was named the NFC Rookie of the Year in 1995. He spent the 1999 season with the Cleveland Browns and Green Bay Packers before playing with the XFL's Memphis Maniax in 2001.A member of both the CU Athletic and the State of Colorado Sports halls of fame, Salaam's No. 19 jersey was retired by the university in 2017. He died Dec. 5, 2016, at the age of 42.The only offensive lineman to ever be named the SWAC Offensive Player of the Year,was a looming force on Alcorn State's offensive line. The Heidelberg, Mississippi, native becomes the second Braves player to enter the College Football Hall of Fame.A two-time First Team All-American, Thomas earned the honor from the Pittsburgh Courier in 1972 and 1973 and from the Black Mutual Sports Network in 1973. The only offensive lineman to ever win SWAC Offensive Player of the Year honors, he put together such an impressive 1973 season that he beat out legendary College Football Hall of Fame running back(Jackson State) for the award. That season, Thomas was a First Team All-SWAC selection and received Alcorn State's outstanding offensive lineman award. He also blocked for freshman running back, who would go on to become the school's all-time leading rusher (currently ranks second).Thomas lettered three seasons and started two years at center for Hall of Fame Coach. In 1970, he was redshirted on the Braves' SWAC championship team. In 1973, Thomas was named to the \"Who's Who in America Colleges and Universities,\" and he was a member of the dean's list all four years of college. In 1974, the state of Mississippi declared April 15 as Dennis and Johnny Thomas Day.Following his collegiate career at Alcorn State, Thomas joined the Braves' coaching staff, and he helped Casem's teams win SWAC football championships in 1976, 1979 and 1984. He then served as the head football coach at South Carolina State from 1986-88. After earning his bachelor's degree from Alcorn State, Thomas later earned his master's from the University of Louisiana at Monroe and his doctorate from the State University of New York at Buffalo. From 1990-2002, he served as the athletics director at Hampton University, where he oversaw the school's transition from NCAA Division II to the Division I level. In 2002, Thomas was named NACDA's Athletics Director of the Year for the Southeast Region.Thomas served as the commissioner of the Mid-Eastern Athletic Conference from 2002 until his retirement in December 2021. As MEAC commissioner, he negotiated a multi-million dollar TV contract with ESPN and was instrumental in the creation of the Celebration Bowl, the annual game between the MEAC and SWAC champions. A 2020 Black College Football Hall of Fame inductee, Thomas also serves on the NFF Board of Directors.The anchor of some of Nebraska's dominant teams of the 1990s,capped his collegiate career by helping the Huskers when a national title. The Fremont, Nebraska, native becomes the 20th player in school history elected to the College Football Hall of Fame.A unanimous First Team All-American in 1994, Wiegert received the Outland Trophy after helping Nebraska to a perfect 13-0 national championship season and the NCAA rushing title. In 1993, he was a finalist for the Outland Trophy after leading the Huskers to an 11-1 record, the No. 3 final ranking and berth in the Orange Bowl for the national title. The three-time First Team All-Big Eight selection led Nebraska to four conference titles and two other top 15 national finishes in 1991 (No. 15) and 1992 (No. 14).Wiegert's other honors include being named the 1994 TD Club of Columbus Offensive Lineman of the Year, the 1994 UPI Lineman of the Year, a 1993 Second Team All-American and a 1992 First Team Sophomore All-American. He was named the ABC Chevrolet Player of the Game following the Huskers' 1994 win over UCLA in which he helped the team rush for 340 yards. Wiegert blocked for three 1,000-yard rushers during his career, and he allowed only one sack in 37 starts. In 1994 alone, he recorded 113 pancake blocks. Wiegert played for College Football Hall of Fame Coachand alongside five other Hall of Famers at Nebraska:andA second-round pick by the St. Louis Rams in the 1995 NFL Draft, Wiegert played with the Rams (1995-98), Jacksonville Jaguars (1999-2002) and Houston Texans (2003-06). He started in 137 NFL games and helped the Jaguars make the playoffs in 1999.After a decade of working in commercial real estate as an investor and developer, Wiegert formed Goldenrod Companies in October 2005 to oversee his own portfolio of assets. He has served, or is currently serving, on many non-profit boards, and he has chaired events for The Salvation Army, The United Way, The Omaha North Magnet STEM School, The Boy Scouts of America and The Teammates Foundation.The first player in history to claim the Bronko Nagurski Trophy and the Jim Thorpe Award in the same year,struck fear in his opponents as he led Oklahoma to the 2000 national title and a 31-7 record during his three seasons in Norman. The Union City, California, native becomes the 23rd Sooner player to enter the College Football Hall of Fame.A unanimous First Team All-American in 2001, Williams started 31 games for the Sooners, recording 287 tackles, 34 tackles for loss, nine interceptions and 44 pass deflections during his career. In 2001, he captained the Sooners to an 11-2 record and a 10-3 win in the Cotton Bowl against Arkansas. Williams posted six tackles, three tackles for loss and two sacks in the game, claiming Defensive MVP honors. His performance during the 2001 season earned him Big 12 Defensive Player of the Year honors as well as the Nagurski and Thorpe awards, and he finished seventh in the Heisman Trophy voting, the highest vote total in 2001 for a non-quarterback. In 2000, he led the Big 12 champion Sooners to their first 13-win season and first undefeated season since 1987, capped by a 13-2 win over Florida State in the 2001 Orange Bowl to claim the BCS National Championship.In 1999, which marked the first season at OU for Coach(inducted into the Hall in 2021), Williams helped Oklahoma notch a 7-5 record and a spot in the Independence Bowl, which snapped the school's four-year absence from postseason play. A two-time First Team All-Big 12 selection, he carved a unique place in Oklahoma football annals with an iconic play during the 2001 Red River Showdown. Leaping over defenders, Williams knocked the ball from Texas QBand into the hands of OU's, who scored a touchdown. The play sealed a 14-3 win for OU while earning Williams the \"Superman\" moniker as he appeared to fly through the air.Selected as the eighth overall pick in the 2002 NFL Draft by Dallas, Williams played for the Cowboys from 2002-08 and the Cincinnati Bengals from 2009-10, earning five consecutive Pro Bowl selections from 2003-07 while being named a First Team All-Pro in 2003.William currently serves as the president of Global Security Corporation in Edmond, Oklahoma, which provides protection for VIPs, security at corporate events and other security consulting services. Active in the community, he established the Roy Williams Safety Net Foundation to support low-income single mothers. The Roy Williams Strength and Speed Complex at OU is named in his honor, and he is a member of the Cotton Bowl Hall of Fame.A stalwart on the Western Pennsylvania football scene for the better part of three decades,turned two programs into perennial national contenders, winning an astounding 76.1 percent of his combined games at Washington & Jefferson and California University of Pennsylvania. He becomes the first person ever to represent the Vulcans in the College Football Hall of Fame and the fourth person with ties to Washington & Jefferson.In 1982, Luckhardt took over a Washington & Jefferson program that had only produced four winning campaigns in the previous 17 seasons. By 1984, Luckhardt had turned the Presidents into a 9-2 team, winning the team's first Presidents' Athletic Conference (PAC) title and earning the school's first trip to the NCAA Division III playoffs. The program never looked back, amassing winning records every season under his watch, culminating in 1998 with a 137-37-2 record during his 17-year tenure.Under Luckhardt's guidance, W&J claimed 13 PAC championships and made 11 appearances in the NCAA Playoffs, including two trips to the Amos Alonzo Stagg Bowl (1992 and 1994). In 1992, he was named the AFCA National Coach of the Year, and CNN named him the Division III Coach of the Year in 1994.Following his time at W&J, Luckhardt led the program at nearby Cal U from 2002-11. His tenure with the Vulcans witnessed the best 10-year stint in school history, and he exited as the school's all-time winningest coach with an 88-33 overall record. He led Cal U to the NCAA Division II Semifinals in three consecutive seasons after capturing NCAA Regional titles in 2007, 2008 and 2009. The 2008 season marked the program's first Pennsylvania State Athletic Conference (PSAC) championship since 1984. Two more playoff appearances in his final two years at Cal U gave him five consecutive seasons of double-digit victories and five NCAA Division II Playoff appearances along with seven consecutive PSAC West titles.Luckhardt's teams appeared in 16 NCAA playoffs during his 27-year coaching career, and he coached 11 First Team All-Americans, nine Academic All-Americans and two NFF National Scholar-Athletes. He was named the PAC Coach of the Year 11 times and the PSAC West Coach of the Year once.A native of Western Pennsylvania, Luckhardt played college football at Purdue for College Football Hall of Fame Coach, and he was the center on the 1967 Rose Bowl team that beat USC. He began his coaching career at Northern Illinois and then Lehigh. Luckhardt has been inducted into the Pennsylvania Sports; the Washington & Jefferson College Athletics; and the California University of Pennsylvania Athletic halls of fame. From 1994-98, he served on the American Football Coaches Association Board of Directors. From 1996-98, Luckhardt also served as Washington & Jefferson's Director of Athletics.The winningest coach in Memphis historyheaded the Tigers' program for 14 years, posting winning records in all but two seasons and leading the school into the national rankings. Murphy, who passed away in 2008 at the age of 87, becomes the second person with ties to Memphis to enter the College Football Hall of Fame.In 1958, Murphy became head coach at Memphis, then-known as Memphis State, and he would take the program from obscurity to national prominence with multiple firsts while winning 67.3 percent of his games before his exit after the 1971 season with an overall record of 91-44-1. In 1960, he led the team's transition to major college status as a member of the NCAA University Division while posting an 8-2 record. As the Tigers' program grew in stature, Murphy replaced small-college opponents with major programs, including wins against Florida State, Houston, Miami (FL), Mississippi, Mississippi State, South Carolina, Virginia Tech and Wake Forest. In 1962, Murphy led the Tigers to their first win over a member of the SEC, a 28-7 victory at Mississippi State.In 1963, the Tigers posted the school's first undefeated season since 1938 with a 9-0-1 record, and Murphy claimed National Coach of the Year honors from The Detroit Times while Memphis running backclaimed the NCAA rushing title and the defense posted five shutouts. The team finished No. 14 in the UPI Coaches Poll, the highest ranking in school history. The lone tie that season, a 0-0 tilt, came against No. 2 Ole Miss who had not been shutout in 47 games. In 1967, Murphy and the Tigers would finally gain the upper hand, claiming the program's first win against Ole Miss with a 27-17 victory at home.In 1968, Memphis ended its 27-year run as an independent, joining the Missouri Valley Conference, and Murphy would earn Missouri Valley Conference Coach of the Year honors in three of the school's first four seasons in the conference. On Dec. 18, 1971, Murphy led Memphis to its first appearance and first win in a major bowl with a 28-9 victory over San Jose State in the Pasadena Bowl. The game marked Murphy's final appearance as a head coach, and he transitioned fulltime to athletics director, a role he had started in 1966 and held until 1981.Murphy grew up in Siloam Springs, Arkansas, before enrolling at Mississippi State in 1939 and playing as an All-SEC tailback for future College Football Hall of Coachwho had previously headed the Memphis program. In 1943 and the midst of World War II, Murphy joined the Marine Corps Reserve and transferred to Duke University for training with the V-12 Program. He served heroically in the South Pacific, narrowly escaping with his life on at least four occasions and receiving the Bronze Star, the Presidential Citation and the Navy Citation. Following World War II, Murphy returned to Mississippi State as the captain of the 1946 Bulldogs team.After graduating from Mississippi State, Murphy took his first job as an assistant coach at Memphis for a five-year stint. In 1951, he returned to Mississippi State under head coachwho he then followed to Minnesota in 1954 for four seasons as the running backs coach before becoming the Memphis head coach at the age of 37 in 1958. Murphy has been inducted into the State of Tennessee Sports Hall of Fame, the Mississippi State Hall of Fame and the Memphis M Club Hall of Fame. Each year the Billy J. Murphy Award is presented to a former Memphis athlete who has excelled in their chosen profession after graduation, and the Tigers' practice facility is named in Murphy's honor.Standing at No. 20 for most wins in Football Bowl Subdivision history at the time of his retirement,'s legacy as the winningest coach in school history at both Toledo and Missouri makes him one of only three coaches to hold the distinction at two Division I programs. He becomes the first coach from Toledo and the sixth coach from Missouri inducted into the College Football Hall of Fame.Pinkel began his head coaching career at Toledo in 1991 and during the next 10 years he would take the Rockets to new heights, winning 65.9 percent of his games and amassing a 73-37-3 record, the most wins in school history. His nine winning seasons at Toledo included the 1995 MAC championship, with the Rockets going 11-0-1 and finishing at No. 24 in the final polls. Pinkel would lead Toledo to three other MAC West Division titles. In 1997, the Rockets finished 9-3, climbing as high as No. 18 in the national rankings. They repeated as division champions again in 1998 with a 7-5 record. In his final season with the Rockets in 2000, the team went 10-1, including a 24-6 win at Penn State. The team finished the regular season with the MAC West Division title and ranked No. 25 in the AP Poll. He was named the MAC Coach of the Year in 1995 and 1997.Pinkel took over at Missouri in 2001, inheriting a program that had produced just one 10-win season in school history and two winning seasons in the previous 17 years. Pinkel would transform the program, leading the Tigers to 10 winning seasons (including five years with 10 wins or more), five conference division titles, 10 bowl appearances and six bowl victories. The end result: an overall record of 118-73 and the distinction of being the school's all-time winningest coach.Pinkel's Missouri teams posted final top-20 national rankings five times, including AP rankings of No. 4 in 2007 and No. 5 in 2013. In 2007, he was named the National Coach of the Year by FieldTurf, and he won conference coach of the year honors in 2007 (Big 12) and 2014 (SEC). In 2007, Mizzou claimed the school's first No. 1 national ranking since 1960 after a watershed 36-17 win against archrival Kansas in the Border Showdown at Arrowhead Stadium on Nov. 24, 2007. The Tigers subsequently fell short against Oklahoma in the Big 12 title game, but the team ended the season with a school-record 12 wins, including a win in the Cotton Bowl and a No. 4 final national ranking.Pinkel's finest year may have come in 2013, one year after Mizzou joined the SEC. Picked to finish sixth in the SEC Eastern Division, the Tigers finished 11-1 as East Division champs, and they gave Pinkel his second victory in the Cotton Bowl and his second 12-win season along with a final No. 5 ranking in the national polls. Pinkel would lead the Tigers back to the SEC Championship Game in 2014, falling short against Alabama. The team finished the season with a win against Minnesota in the Citrus Bowl and an 11-3 record and No. 14 ranking in the AP Poll.After his final game in 2015 and announcing his retirement because of a diagnosis of non-Hodgkin's lymphoma, Pinkel ranked as the third-winningest active coach behind future College Football Hall of Fame inducteesof Virginia Tech andof Kansas State. Pinkel also is one of only three coaches in history to be the winningest coach of two college football programs, joining College Football Hall of Fame inductees(Kentucky, Alabama) and(Florida, South Carolina). Pinkel coached 10 First Team All-Americans, three Academic All-Americans, three NFF National Scholar-Athletes and 79 first team all-conference players.Prior to becoming a head coach, Pinkel was an all-conference and Honorable Mention All-America tight end at Kent State, playing for future College Football Hall of Fame Coach. Pinkel worked as an assistant under James at Washington for 12 years, including the Huskies' 1991 national championship team. He also served as an assistant at Kent State and Bowling Green.Pinkel has been inducted into multiple halls of fame, including the State of Missouri Sports, St. Louis Sports Commission, Mid-American Conference, Toledo Athletics, Kent State Athletics and Kenmore High School. Active in the community, he created the GP Made Foundation to help youth facing difficult challenges and he has raised more than $10 million for charitable causes. In 2017, Pinkel released an autobiography \"The 100-Yard Journey: A Life in Coaching and Battling for the Win.\"Founded in 1947 with early leadership from General Douglas MacArthur, legendary Army coach Earl \"Red\" Blaik and immortal journalist Grantland Rice, The National Football Foundation & College Hall of Fame is a non-profit educational organization that runs programs designed to use the power of amateur football in developing scholarship, citizenship and athletic achievement in young people. With 120 chapters and 12,000 members nationwide, NFF programs include the Chick-fil-A College Football Hall of Fame in Atlanta, Future for Football, The William V. Campbell Trophy®, the NFF National Scholar-Athlete Class Presented by Fidelity Investments and a series of initiatives to honor the legends of the past and inspire the leaders of the future. NFF corporate partners include Catapult, Delta Air Lines, Fidelity Investments, Goodyear, Jostens, the Las Vegas Convention and Visitors Authority, the New York Athletic Club and the Sports Business Journal. Follow us on Facebook Instagram and Twitter @NFFNetwork and learn more at footballfoundation.org"}, {"url": "https://footballfoundation.org/hof_search.aspx?hof=2479", "page_content": "Hall of Fame\n\nChoose a Hall Of Fame Member: Abell, Earl \"Tuffy\" Agase, Alex Agganis, Harry Aikman, Troy Aillet, Joe Albert, Frankie Alberts, Trev Aldrich, Ki Aldrich, Mal Alexander, Bill Alexander, Joe \"Doc\" Alexander, Charles Allen, Marcus Alvarez, Barry Alvarez, Carlos Alworth, Lance Ameche, Alan Ames, Knowlton Amling, Warren Anderson, Eddie Anderson, Hunk Anderson, Donny Anderson, Dick Anderson, Bobby Anderson, Bob Armstrong, Otis Armstrong, Ike Arnett, Jon Arrington, LaVar Ashford, Volney Atkins, Pervis Atkins, Doug Ault, Chris Babich, Bob Bachman, Charlie Bacon, Everett Bagnell, Reds Bailey, Johnny Bailey, Champ Baker, Terry Baker, Johnny Baker, Hobey Baker, Ralph Ballard, Jim Ballin, Harold Banker, Bill Banks, Earl Banonis, Vince Barber, Mike Barnes, Stan Barrett, Charley Bartkowski, Steve Barton, Harris Baston, Bert Battles, Cliff Baugh, Sammy Baughan, Maxie Baujan, Harry Baumgartner, Kirk Bausch, Jim Beagle, Ron Beamer, Frank Beasley, Terry Beban, Gary Bechtol, Hub Beck, Ray Beck, Tom Beckett, John Bednarik, Chuck Bedsole, Hal Behm, Forrest Bell, Matty Bell, Ricky Bell, Bobby Bellino, Joe Bellotti, Mike Below, Marty Benbrook, Albert Bennett, Cornelius Bentrim, Jeff Berry, Charlie Berry, Eric Bertelli, Angelo Berwanger, Jay Bettencourt, Larry Bezdek, Hugo Bible, Dana Bierman, Bernie Biletnikoff, Fred Bisaillon, Chris Bishop, Michael Blackman, Bob Blades, Bennie Blaik, Earl \"Red\" Blanchard, Doc Blazine, Tony Blozis, Al Bly, Dre Bock, Ed Bomar, Lynn Bomeisler, Doug Booth, Albie Boozer, Emerson Bork, George Borries, Buzz Boselli, Tony Bosley, Bruce Bosseler, Don Bosworth, Brian Bottari, Vic Bowden, Bobby Bowden, Murry Bowes, Bill Boynton, Benny Lee Bradshaw, Terry Brahaney, Tom Breunig, Bob Brewer, Sean Brewer, Charley Bright, Johnny Briscoe, Marlin Brodie, John Brooke, George Brooks, Derrick Brosky, Al Brown, Jim Brown, Bob Brown, Ruben Brown, Ted Brown, Troy Brown, Gordon Brown, Tom Brown, Dave Brown, Tim Brown, Roger Brown, Tay Brown, George Brown, John \"Babe\" Brown, Johnny Mack Brown, Mack Brown, Lomas Browner, Ross Broyles, Frank Bruce, Earle Bruner, Teel Bruschi, Tedy Bryant, Paul \"Bear\" Buchanan, Buck Buckley, Terrell Budde, Brad Bunker, Paul Burford, Chris Burris, Kurt Burry, Harold Burton, Ron Bush, Reggie Butkus, Dick Butler, Kevin Butler, Bob Butterfield, Jim Butts, Wally Butz, Dave Byars, Keith Byrd, Dennis Cafego, George Cagle, Chris \"Red\" Cain, John Caldwell, Charley Calip, Brad Cameron, Eddie Camp, Walter Campbell, Earl Campbell, Dave Cannon, Jack Cannon, Billy Cappelletti, John Carideo, Frank Carney, Chuck Caroline, J.C. Carpenter, Bill Carpenter, Hunter Carpenter, Gene Carr, Lloyd Carroll, Chuck Carson, Harry Carter, Anthony Casanova, Tommy Casanova, Len Casem, Marino Casey, Eddie Casillas, Tony Cason, Rod Casper, Dave Cassady, Howard \"Hopalong\" Cater, Monte Cavanaugh, Frank Caveness, Ronnie Cecil, Chuck Chamberlin, Guy Chandler, Wes Chapman, Sam Chappuis, Bob Childress, Ray Christman, Paul Christopherson, Jim Cichy, Joe Cignetti, Frank Claiborne, Jerry Clark, Earl \"Dutch\" Cleary, Paul Clevenger, Zora Cloud, Jack Coakley, Dexter Cobb, Trevor Cochran, Gary Cody, Josh Coleman, Don Collins, Kerry Colman, Dick Conerly, Charlie Conlan, Shane Connor, George Cooper, John Cooper, Bill Corbin, Pa Corbus, Bill Coryell, Don Cousineau, Tom Covert, Jimbo Cowan, Hector Coy, Ted Cozza, Carmen Crable, Bob Crabtree, Michael Crawford, Brad Crawford, Fred Crisler, Fritz Croom, Sylvester Cross, Randy Crouch, Eric Crow, John David Crowley, Jim Csonka, Larry Cunningham, Sam Cunningham, Randall Curtis, Tom Cutter, Slade Czarobski, Ziggy Dale, Carroll Dalrymple, Jerry Dalton, John Daly, Charlie Daniell, Ave Daniell, Jim Daugherty, Duffy Davies, Tom Davis, Glenn Davis, Bobby Davis, Ernie Davis, Anthony Davis, Harold Davis, Jeff Davis, Troy Dawkins, Pete Dayne, Ron Dean, Fred DeBerry, Fisher Deery, Tom Delaney, Joe DeLong, Steve Dement, Kenneth Den Herder, Vern Dent, Kevin DeRogatis, Al Deromedi, Herb Des Jardien, Paul Detmer, Ty Devaney, Bob Devine, Dan Devine, Aubrey DeWitt, John Dial, Buddy Dickenson, Dave Dickerson, Eric Dickey, Doug Dicus, Chuck Dierdorf, Dan Dietz, William \"Lone Star\" Ditka, Mike Dixon, Rickey Dobbs, Glenn Dobie, Gil Dodd, Bobby Dodd, Bobby Dombrowski, Jim Donahue, Terry Donahue, Michael Donan, Hollie Donchess, Joe Donnan, Jim Donnelly, James \"Boots\" Dooley, Vince Dorais, Gus Dorney, Keith Dorsett, Tony Dorsey, Glenn Doss, Mike Dougherty, Nathan Dove, Bob Dow, Jess Drahos, Nick Driscoll, Paddy Drury, Morley Dryer, Fred Dudek, Joe Duden, Dick Dudley, Bill Duncan, Randy Dyas, Ed Dye, Pat Ealey, Chuck Easley, Kenny Eckersall, Walter Edwards, Glen \"Turk\" Edwards, Bill Edwards, Bill Edwards, LaVell Eichenlaub, Ray Eisenhauer, Steve Elkins, Larry Eller, Carl Elliott, Bump Elliott, Pete Elliott, John Elmendorf, Dave Elway, John Emanuel, Frank Emtman, Steve Engle, Rip English, Doug Enyart, Bill Erickson, Dennis Evans, Ray Evashevski, Forest Everett, Thomas Exendine, Albert Falaschi, Nello Farley, Dick Faulk, Marshall Faulk, Kevin Faurot, Don Favor, Mike Fears, Tom Feathers, Beattie Fenimore, Bob Fenton, Doc Ferguson, Bob Ferraro, John Fesler, Wes Fincher, Bill Fischer, Bill Fish, Hamilton Fisher, Bob Fitzgerald, Pat Fletcher, London Flowers, Charlie Flowers, Buck Floyd, George Flutie, Doug Ford, Danny Fortmann, Danny Fralic, Bill Francis, Sam Franck, George \"Sonny\" Franco, Ed Frank, Clint Franz, Rod Frazier, Tommie Frederickson, Tucker Freeney, Dwight Friedman, Benny Friesz, John Fry, Hayden Fulcher, David Fuller, William Fulmer, Phillip Fusco, Joe Gabriel, Roman Gagliardi, John Gain, Bob Gaither, Jake Galiffa, Arnold Galimore, Willie Gallarneau, Hugh \"Duke\" Gallery, Robert Gamble, Kenny Garbisch, Edgar Gardner, Moe Garrett, Mike Gatewood, Thom Gelbert, Charlie George, Eddie Geyer, Forest Gibbs, Jake Gibson, Kirk Giel, Paul Gifford, Frank Gilbert, Walter Gilbert, Chris Gillman, Sid Gilmer, Harry Gipp, George Girardi, Frank Gladchuk, Chet Glass, Bill Glover, Rich Godfrey, Ernie Goldberg, Marshall Goodreault, Gene Gorden, W.C. Gordon, Walter Governali, Paul Grabowski, Jim Gradishar, Randy Graham, Otto Grange, Red Graves, Ray Gray, Jerry Grayson, Bobby Green, John Green, Darrell Green, Charlie Green, Hugh Green, Tim Green, Jacob Greene, Joe Griese, Bob Griffin, Archie Grigsby, Boomer Grinnell, William \"Johnny\" Groom, Jerry Guglielmi, Ralph Gulick, Merle Gustafson, Andy Guy, Ray Guyon, Joe Hadl, John Hale, Edwin Haley, Charles Hall, Ed Hall, Parker Ham, Tracy Ham, Jack Hamilton, Joe Hamilton, Bob \"Bones\" Hamilton, Tom Hannah, John Hanson, Vic Hanson, Jason Harder, Pat Hardin, Wayne Harding, Jack Hardwick, Huntington \"Tack\" Hare, Truxton Harley, Chic Harlow, Dick Harman, Harvey Harmon, Tom Harms, Ron Harper, Jesse Harpster, Howard Harring, Roger Harris, Major Harris, Wayne Hart, Ed Hart, Leon Hartman, Bill Haslett, Jim Hass, Mike Haughton, Percy Hawkins, Frank Hayes, Woody Haynes, Michael Hazel, Homer \"Pop\" Hazeltine, Matt Healey, Ed Heffelfinger, Pudge Hein, Mel Heinrich, Don Heisman, John Henderson, E.J. Hendricks, Ted Henley, Garney Hennings, Chad Henry, Wilbur \"Pete\" Herrmann, Mark Herschberger, Clarence \"Bert\" Herwig, Bob Heston, Willie Hickman, Herman Hickok, Bill Hicks, John Higgins, Bob Hill, Dan Hillebrand, Art \"Doc\" Hines, Clarkston Hinkey, Frank Hinkle, Clarke Hinkle, Carl Hirsch, Elroy \"Crazy Legs\" Hitchcock, Jimmy Hoage, Terry Hoernemann, Paul Hoffmann, Frank \"Nordy\" Hogan, James Holder, Jim Holland, Brud Holleder, Don Hollenback, Bill Hollingbery, Orin \"Babe\" Holovak, Mike Holt, Pierce Holt, Torry Holtz, Lou Holub, E.J. Hornung, Paul Horrell, Edwin \"Babe\" Horvath, Les Houston, Jim Howard, Desmond Howard, Dana Howard, Frank Howe, Art Howell, Millard \"Dixie\" Huard, John Huarte, John Hubbard, Cal Hubbard, Jack Hubbard, Rudy Hubert, Pooley Hudson, Gordon Huerta, Marcelino Huff, Sam Humble, Weldon Hunley, Ricky Hunt, Jackie Hunt, Joel Huntington, Ellery Hutson, Don Iacavazzi, Cosmo Ingram, Jonas Ingram, Bill Isbell, Cecil Ismail, Raghib “Rocket” Jablonsky, Harvey Jackson, Bo Jackson, Keith James, Don James, LaMichael Janowicz, Vic Jauron, Dick Jefferson, John \"J.J.\" Jeffries, Willie Jenkins, Darold Jennings, Morley Jensen, Jackie Joe, Billy Joesting, Herb Johnson, Jimmy Johnson, Johnnie Johnson, Jimmy Johnson, Calvin Johnson, Gary Johnson, Billy Johnson, Ron Johnson, Bob Johnson, Derrick Johnson, Paul Jones, Marvin Jones, Stan Jones, Brent Jones, Bert Jones, Clinton Jones, Tad Jones, Gomer Jones, Calvin Jones, Lawrence \"Biff\" Jones, Howard Jordan, Lloyd Jordan, Shelby Jordan, Shug Jordan, Lee Roy Juhan, Frank Junior, E.J. Justice, Charlie Kaer, Mort Kapp, Joe Karras, Alex Kavanaugh, Ken Kaw, Eddie Kazmaier, Dick Keck, Stan Kehres, Larry Kell, Chip Kelley, Brian Kelley, Larry Kelly, Bill Kelly, Mike Kendall, Joe Kenna, Doug Kennedy, Lincoln Kern, Rex Kerr, Andy Kerr, George Kessinger, Ted Ketcham, Henry Keyes, Leroy Kidd, Roy Killinger, Glenn Kilmer, Billy Kilpatrick, John Kimbrough, John Kinard, Bruiser Kinard, Terry Kiner, Steve King, Philip Kinnick, Nile Kipke, Harry Kitzmiller, Johnny Klausing, Chuck Kobrosky, Mickey Koch, Barton Kollar, Bill Koppisch, Walter Kramer, Ron Kramer, Tommy Kramer, Roy Kroll, Alex Krueger, Charlie Krumrie, Tim Kuechly, Luke Kush, Frank Kutner, Malcolm Kwalick, Ted Lach, Steve Lane, Myles Lanier, Willie Lattner, Johnny Lauricella, Hank Lautenschlaeger, Lester Layden, Elmer Layne, Bobby Lea, Langdon \"Biffy\" Leahy, Frank Leaks, Roosevelt LeBaron, Eddie LeClair, Jim Leech, Jimmy Leinart, Matt Lester, Darrell LeVias, Jerry Lewis, Leo Lewis, William Lewis, D.D. Lilly, Bob Lio, Augie Little, Lou Little, George Little, Floyd Lockbaum, Gordie Locke, Gordon Lomax, Neil Long, Mel Long, Chuck Loria, Frank Lott, Ronnie Lourie, Don Lowe, Woodrow Lucas, Richie Luck, Andrew Luckhardt, John Luckman, Sid Lujack, Johnny Lund, Pug Lynch, Jim Lyons, Marty Lytle, Rob MacAfee, Ken MacLeod, Bob Maclin, Jeremy Macomber, Bart MacPherson, Dick Madigan, Slip Maegle, Dick Mahan, Eddie Majors, Johnny Mallett, Ronnie Mallory, Bill Mancha, Vaughn Mandich, Jim Manlove, Bill Mann, Gerald Manning, Peyton Manning, Archie Manske, Edgar Margerum, Ken Marinaro, Ed Marino, Dan Markov, Vic Marshall, Bobby Marshall, Wilber Martin, Jim Martinelli, Fred Maryland, Russell Mathis, Terance Matson, Ollie Matthews, Rags Maulbetsch, Johnny Maurer, Dave Mauthe, Pete Maxwell, Bob May, Mark Mayes, Rueben McAfee, George McCain, Vernon \"Skip\" McCallum, Napoleon McCartney, Bill McCauley, Don McClendon, Charlie McClung, Lee \"Bum\" McColl, Bill McCormick, Jim McCracken, Herb McDaniel, Randall McDonald, Tommy McDowall, Jack McElhenny, Hugh McEver, Gene McEwan, John \"Cap\" McFadden, Banks McFadden, Darren McFadin, Bud McGee, Mike McGeorge, Rich McGinley, Ed McGovern, John McGraw, Thurman McGriff, Tyrone McGugin, Dan McInally, Pat McKay, Bob McKay, John McKeen, Allyn McKeever, Mike McKenzie, Reggie McKinnie, Bryant McKinnon, Ronald McLaren, George \"Tank\" McLaughry, Tuss McMahon, Jim McMichael, Steve McMillan, Dan McMillin, Bo McNair, Steve McNown, Cade McPherson, Don McWhorter, Bob Meilinger, Steve Mercer, Leroy Meredith, Don Merritt, Frank Merritt, John Messner, Mark Metzger, Bert Meyer, Dutch Meylan, Wayne Micchia, Joe Michaels, Lou Michels, John Mickal, Abe Miller, Don Miller, Edgar \"Rip\" Miller, Fred Miller, Shorty Miller, Creighton Miller, Terry Millner, Wayne Mills, Sam Milstead, Century Minds, John \"Jack\" Minisi, Skip Mirich, Rex Mitchell, Lydell Modzelewski, Dick Moeller, Chet Moffat, Alex Molinski, Ed Mollenkopf, Jack Monk, Art Montgomery, Wilbert Montgomery, Cliff Moomaw, Donn Moore, Bernie Moore, Andy Moore, Jerry Moore, Corey Morgan, Dan Morin, Milt Morley, Bill Morris, George Morris, Larry Morrison, Ray Morton, Bill Morton, Craig Moscrip, James \"Monk\" Mudra, Darrell Muller, Harold \"Brick\" Mumford, Ace Munger, George Munn, Clarence \"Biggie\" Murphy, Billy Jack Murray, Bill Murray, Frank Musso, Johnny Myers, Greg Mylin, Edward Nagurski, Bronko Neale, Greasy Neely, Jess Nehlen, Don Neighbors, Billy Nelson, Darrin Nelson, David Nevers, Ernie Newell, Marshall Newman, Harry Newsome, Ozzie Neyland, Bob Nguyen, Dat Nicks, Billy Nielsen, Gifford Nix, Dwayne Nobis, Tommy Nomellini, Leo Norton, Homer Novacek, Jay O'Brien, Davey O'Brien, Ken O'Dea, Pat O'Hearn, Jack O'Neal, Leslie O'Neill, Frank \"Buck\" O'Rourke, Charlie Oberlander, Andy Odell, Bob Ogden, Jonathan Olds, Robin Oliphant, Elmer Olsen, Merlin Onkotz, Dennis Oosterbaan, Bennie Orsi, John Orvis, Herb Osborne, Tom Osgood, Winchester Osmanski, Bill Outland, John Owen, George Owen, Bennie Owens, Jim Owens, Steve Pace, Orlando Page, Alan Palmer, Paul Palmer, Carson Palumbo, Joe Pardee, Jack Parilli, Babe Parker, Jackie Parker, Jim Parker, Ace Parks, Dave Parseghian, Ara Paterno, Joe Payton, Michael Payton, Walter Pazzetti, Vince \"Pat\" Peabody, Endicott Peck, Bob Pellegrini, Bob Pennock, Stan Perry, Doyt Peterson, Adrian Pfann, George Phelan, Jim Phillips, Henry Phillips, Loyd Phipps, Mike Pihos, Pete Pinckert, Erny Pingel, John Pinkel, Gary Plummer, Jake Plunkett, Jim Poe, Art Poindexter, Anthony Polamalu, Troy Pollack, David Pollard, Fritz Poole, Barney Porter, Doug Powell, Marvin Pregulman, Merv Price, Eddie Pritchard, Ron Prothro, Tommy Pruitt, Greg Pugh, Larry Pund, Peter Ralston, John Ramsey, Buster Randle, John Rashad, Ahmad Rauch, John Raymond, Tubby Reade, Bob Reasons, Gary Redell, Bill Redman, Rick Reed, Ed Reeds, Claude Reid, Steve Reid, Mike Reid, Bill Reifsnyder, Bob Renfro, Mel Rentner, Ernie \"Pug\" Reppert, Scott Ressler, Glenn Reynolds, Bobby Reynolds, Bob Rhino, Randy Rhome, Jerry Rice, Jerry Richard, Charlie Richardson, Willie Richt, Mark Richter, Pat Richter, Les Riley, Jack Rimington, Dave Rinehart, Charles \"Babe\" Ritcher, Jim Ritchie, Richard Rivera, Gabe Roaf, Willie Roberts, Calvin Roberts, J.D. Robeson, Paul Robinson, Edward \"Robbie\" Robinson, Dave Robinson, Eddie Robinson, Jerry Robinson, John Rocker, Tracy Rockne, Knute Rodgers, Ira Rodgers, Johnny Rogers, George Rogers, Eddie Roland, Johnny Romig, Joe Romney, Dick Romo, Tony Roper, Bill Rosenberg, Aaron Ross, Dan Rote, Kyle Routt, Joe Rowland, Brad Royal, Darrell Royce, Bill Rozier, Mike Ruth, Mike Rutschman, Ad Salaam, Rashaan Salmon, Louis \"Red\" Sanders, Red Sanders, Deion Sanders, Barry Sanford, George Sarkisian, Alex Sauer, George Savitsky, George Saxton, James Sayers, Gale Scarbath, Jack Scarlett, Hunter Schembechler, Bo Schipper, Ron Schloredt, Bob Schmidt, Francis Schmidt, Joe Schoonover, Wear Schreiner, Dave Schulz, Germany Schwab, Frank \"Dutch\" Schwartz, Marchy Schwartzwalder, Ben Schwegler, Paul Sciarra, John Scott, Jake Scott, Freddie Scott, Clyde Scott, Dick Scott, Tom Seibels, Henry Sellers, Ron Selmon, Lee Roy Sewell, Harley Shakespeare, William Sharpe, Sterling Shaughnessy, Clark Shaw, Buck Shell, Art Shell, Donnie Shelton, Murray Sheptock, Frank Sheridan, Dick Sherman, Ed Shevlin, Tom Shields, Will Shively, Bernie Shoate, Rod Siemon, Jeff Simmons, Ron Simoneau, Mark Simons, Monk Simpson, O.J. Sims, Billy Sims, Kenneth Singletary, Mike Sington, Fred Sinkwich, Frank Sisemore, Jerry Sitko, Red Skladany, Joe Slater, Duke Slocum, R.C. Smith, Leonard Smith, Rod Smith, Bruce Smith, Emmitt Smith, Billy Ray Smith, Bubba Smith, Andy Smith, John \"Clipper\" Smith, Ernie Smith, Harry Smith, Riley Smith, Vernon Smith, Bruce \"Boo\" Smith, Jim Ray Snavely, Carl Snow, Neil Snow, Percy Snyder, Bill Sochor, Jim Spani, Gary Sparlis, Al Spears, Clarence \"Doc\" Spears, Bill Spielman, Chris Spiller, C.J. Sprackling, Bill Sprague, Bud Sproles, Darren Spurrier, Steve Spurrier, Steve Stafford, Harrison Stagg, Amos Alonzo Stagg, Amos Alonzo Stallings, Gene Stanfill, Bill Starcevich, Max Station, Larry Staubach, Roger Steffen, Walter Steffy, Joe Stein, Herb Stein, Bob Steinke, Gil Stephens, Sandy Steuber, Bob Stevens, Mal Stevenson, Ben Stevenson, Vince Still, Art Stillwagon, Jim Stinchcomb, Matt Stinchcomb, Gaylord Stonebreaker, Michael Stoops, Bob Stovall, Jerry Strahm, Dick Strom, Brock Stromberg, Bill Strong, Ken Strupper, Everett Stuhldreher, Harry Sturhahn, Herbert Stydahar, Joe Suffridge, Bob Suhey, Steve Sullivan, Pat Sundstrom, Frank Sutherland, Jock Swann, Lynn Swanson, Clarence Swiacki, Bill Swilling, Pat Swink, Jim Switzer, Barry Talboom, Eddie Taliaferro, George Talley, Darryl Talley, Andy Tarkenton, Fran Tatum, Jim Tatum, Jack Tavener, John Taylor, Chuck Taylor, Aaron Taylor, Bruce Taylor, Joe Taylor, Aaron Teaff, Grant Tebow, Tim Testaverde, Vinny Theismann, Joe Thomas, Thurman Thomas, Zach Thomas, Derrick Thomas, Clendon Thomas, Scott Thomas, Aurealius Thomas, Frank Thomas, Dennis Thomas, Joe Thompson, Joe Thompson, Anthony Thomsen, Lynn Thorne, Sam \"Brinck\" Thorpe, Jim Ticknor, Ben Tigert, John Tillman, Pat Tinsley, Gaynell \"Gus\" Tippett, Andre Tipton, Eric Tjeerdsma, Mel Tomlinson, LaDainian Tonnemaker, Clayton Torretta, Gino Torrey, Bob Totten, Willie Trautman, Randy Travis, Ed Tressel, Jim Tressel, Lee Trippi, Charley Trull, Don Tryon, Ed Tubbs, Jerry Tucker, Arnold Tuggle, Jessie Turner, Bulldog Twilley, Howard Urlacher, Brian Utay, Joe Utley, Mike Van Brocklin, Norm Van Pelt, Brad Van Sickel, Dale Van Surdam, Harry Vann, Thad \"Pie\" Vaught, Johnny Very, Dexter Vessels, Billy Vick, Ernie Vincent, Troy Wade, Wallace Wagner, Hube Waldorf, Lynn \"Pappy\" Waldrop, Rob Walker, Herschel Walker, Doak Wallace, Bill Walls, Wesley Walsh, Adam Warburton, Cotton Ward, Bob Ward, Charlie Ware, Andre Warner, Curt Warner, Pop Warner, Bill Washington, Kenny Washington, Joe Washington, Gene Waters, Muddy Weatherall, Jim Webster, George Wedemeyer, Herman Weekes, Harold Wehrli, Roger Weiner, Art Weir, Ed Welch, Gus Weller, John \"Jac\" Welsh, George Wendell, Percy West, Belford Westbrook, Brian Westbrook, Michael Westering, Frosty Westfall, Bob Weyand, Alex \"Babe\" Wharton, Charles \"Buck\" Wheeler, Art White, Reggie White, Randy White, Charles White, Danny White, Ed White, Byron \"Whizzer\" White, Lorenzo Whitley, Wilson Whitmire, Don Wickhorst, Frank Widseth, Ed Wiegert, Zach Wieman, Tad Wiggin, Paul Wilce, John Wildung, Dick Wilkinson, Bud Williams, James \"Froggy\" Williams, Bobby Williams, Henry Williams, David Williams, Reggie Williams, Alfred Williams, Ricky Williams, Doug Williams, Roy Williams, DeAngelo Willis, Patrick Willis, Bill Wilson, Bobby Wilson, George \"Mike\" Wilson, George \"Wildcat\" Wilson, Harry Wilson, Marc Wilson, Al Winslow, Kellen Wistert, Francis Wistert, Alvin Wistert, Albert Wistrom, Grant Wittman, Jeff Woerner, Scott Wojciechowicz, Alex Wood, Barry Wood, Richard Woodruff, George Woodson, Rod Woodson, Charles Woodson, Warren Wooten, John Wright, Elmo Wuerffel, Danny Wyant, Andy Wyatt, Bowden Wyatt, Bowden Wyckoff, Clint Yarr, Tommy Yary, Ron Yeoman, Bill Yoder, Lloyd Yost, Fielding Young, Harry \"Cy\" Young, Waddy Young, Buddy Young, Steve Young, Jim Young, Charles Young, Vince Youngblood, Jim Youngblood, Jack Younger, Paul \"Tank\" Zarnas, Gust Zorich, Chris Zuppke, Bob Bob Stoops School Oklahoma\n\nInduction 2021\n\nPosition: Coach\n\nYears: 1999-2016\n\nPlace of Birth: Youngstown, OH\n\nDate of Birth: Sept. 9, 1960\n\nRecord: 190-48-0 (79.8%)\n\n\n\nOklahoma's all-time winningest coach, Bob Stoops is the only coach in history to win a national championship and all four BCS bowl games. He posted a 79.8 winning percentage during his remarkable 18-year tenure, returning the Sooners to one of the elite programs in college football. Stoops is the sixth Oklahoma coach to be inducted into the College Football Hall of Fame.\n\n\n\nPrior to his arrival at Oklahoma, the proud Sooner program was five years removed from a winning record and hadn't produced double-digit victories since 1987. Coaching at Oklahoma from 1999-2016, Stoops never had a losing record en route to a school record 190 career wins, including 14 seasons of 10-plus victories (the most of an FBS coach from 2000-16). He led the Sooners to four BCS National Championship Game appearances, winning the 2000 national title after a perfect 13-0 season that culminated with a win over Florida State in the Orange Bowl. Leading OU to a bowl game in each of his 18 seasons (a school record), Stoops claimed nine postseason victories, including wins in the Cotton, Fiesta, Orange, Rose and Sugar bowls. The sixth-fastest coach to ever reach 150 wins (187 games), he guided the Sooners to top 25 finishes in all but three seasons, including seven top five rankings.\n\n\n\nA two-time national coach of the year and six-time Big 12 Coach of the Year, Stoops led Oklahoma to 10 Big 12 titles while posting an impressive 121-29 (.807) conference record during his career. His teams averaged 10.6 wins per season, and he owned a 101-9 home record, with wins in each of his first 37 games at Gaylord Family – Oklahoma Memorial Stadium. Stoops' 2008 team went down as the highest scoring team in college football history, scoring a total of 716 points and averaging 51 points per game. A combined 25-11 against the Sooners' biggest rivals Oklahoma State and Texas, he also posted a 66.7 winning percentage vs. AP Top 25 teams, the best in the country during his reign at OU.\n\n\n\nStoops coached 38 First Team All-Americans at Oklahoma, including seven Heisman Trophy finalists and two winners in Jason White (2003) and Sam Bradford (2008). He also coached three NFF National Scholar-Athletes, including 2015 Campbell Trophy® recipient Ty Darlington. In 2019, Stoops was inducted into the OU Sports Hall of Fame.\n\n\n\nA four-year starter at Iowa under College Football Hall of Fame Coach Hayden Fry, Stoops excelled in 1982 as a team captain, First Team All-Big Ten selection and Iowa's MVP. The Youngstown, Ohio, native began his coaching career as an assistant under Fry at Iowa, followed by a stint at Kent State. After coaching under Hall of Famer Bill Snyder at Kansas State, he joined Hall of Famer Steve Spurrier's staff and helped the Gators win the 1996 national title as defensive coordinator.\n\n\n\nIn 2001, he started the Bob Stoops Champions Foundation to provide support to children and families in the Norman and Oklahoma City areas. In 2018, Stoops joined with current OU head coach Lincoln Riley and College Football Hall of Fame Coach Barry Switzer to create the HBC Champions Foundation to supply financial contributions, positive experiences and support to ill or disadvantaged children in Oklahoma. After briefly coming out of retirement in 2020 to coach the Dallas Renegades in the XFL, he now serves as a special assistant to the athletics director at OU."}]}