{"In 2014, Bryan McClendon was promoted to co-offensive coordinator and running backs coach.": [{"url": "https://www.espn.com/college-football/story/_/id/32992960/miami-hurricanes-hire-oregon-bryan-mcclendon-co-offensive-coordinator-wide-receivers-coach-sources-say", "page_content": "Miami is set to hire Bryan McClendon as co-offensive coordinator and wide receivers coach, sources told ESPN.\n\nMcClendon spent the past two seasons working for new Miami coach Mario Cristobal at Oregon, serving as Ducks wide receivers coach and passing game coordinator. He was Oregon's interim head coach for last week's Valero Alamo Bowl against Oklahoma.\n\nThe 38-year-old has extensive experience in the Southeast, serving from 2009 to 2015 as an assistant at Georgia, where he coached running backs and wide receivers. McClendon, who played wide receiver at Georgia, then spent four years as an offensive coordinator and wide receivers coach at South Carolina, holding the primary coordinator role in 2018 and 2019.\n\nMiami is expected to hire a primary playcaller to work alongside McClendon, according to sources."}, {"url": "https://ugawire.usatoday.com/2022/01/30/georgia-football-brings-back-wr-coach-bryan-mcclendon-uga/", "page_content": "Multiple reports have confirmed Georgia has hired Bryan McClendon as receivers coach replacing Cortez Hankton, who left for the same position at LSU.\n\nMcClendon is a Mays High School (Atlanta) graduate who played receiver for the Bulldogs from 2002 to 2005 before transitioning to a graduate assistant coach.\n\nMcClendon coached running backs and receivers in his first stint at Georgia under head coach Mark Richt and later served as interim head coach in the 2015 TaxSlayer Bowl after Richt’s departure.\n\nGeorgia’s Kirby Smart brings McClendon back to Athens just four weeks after McClendon was named co-offensive coordinator and receivers coach at Miami under new coach Mario Cristobal, who brought McClendon with him to Miami from Oregon where he served in the same capacity.\n\nBefore his stint in Eugene, McClendon coached three seasons at South Carolina where he served as co-offensive coordinator and receivers coach and eventually was named offensive coordinator in 2019.\n\nMcClendon brings recruiting prowess and experience to the Georgia receiver room, which is looking to replace some serious talent.\n\nStar George Pickens is headed to the NFL draft and Jermaine Burton is headed to Tuscaloosa via the transfer portal, along with two other receiver reserves in Justin Robinson and Jaylen Johnson."}, {"url": "https://ugawire.usatoday.com/2020/02/09/report-former-georgia-football-player-and-coach-hired-to-steelers-staff/", "page_content": "According to the ABC television affiliate in Columbia, S.C., the Pittsburgh Steelers have pulled from the college ranks to find their next receivers coach.\n\nThe Steelers have reportedly worked out a deal with former Georgia wide receiver Bryan McClendon, who also coached in Athens for nearly a decade.\n\nThe Steelers have been on a long search for a receivers coach. This past season, interim receivers coach Ray Sherman handled those duties after Darryl Drake passed away during training camp in August.\n\nRelated Two former Georgia football running backs team up on LA Rams\n\nMcClendon played at Georgia from 2002-05, finding a ton of success in Athens.\n\nAfter college, he tried out the NFL for a year with the Bears but quickly found himself coaching at Georgia in 2007 as a graduate assistant and staying until 2015. In 2009, McClendon was promoted to running backs coach under Mark Richt, a position he held until 2014, before switching to wide receivers coach in 2015. He also added other titles along the way, such as assistant head coach and interim head coach after Richt’s firing.\n\nIn 2016, McClendon was named co-offensive and wide receivers coach coordinator at South Carolina and in 2019 was named the Gamecocks’ offensive coordinator.\n\nOddly enough, McClendon is the second former Georgia football player to get an NFL coaching job today. And even more odd, the other, Thomas Brown, also left a position at South Carolina to do so."}, {"url": "https://www.sun-sentinel.com/sports/miami-hurricanes/fl-sp-hurricanes-bryan-mcclendon-co-offensive-coordinator-20220104-uehpjtioivezrjctf54hyiddsi-story.html", "page_content": "Mario Cristobal will be bringing over another familiar face to the Miami Hurricanes, hiring former Oregon pass game coordinator and wide receivers coach Bryan McClendon.\n\nMcClendon updated his Twitter handle Wednesday night, stating “WR Coach – University of Miami.” McClendon will serve as the Hurricanes’ wide receiver coach and is expected to hold a co-offensive coordinator title.\n\nHe replaces former passing game coordinator and wide receivers coach Rob Likens.\n\nIronically, McClendon was Oregon’s interim head coach for last week’s Alamo Bowl loss to Oklahoma, serving as Cristobal’s replacement after he accepted the UM job.\n\nUnder McClendon, the Ducks averaged 221.3 passing yards per game last season and had 20 passing touchdowns. In his first season in 2020, he helped Oregon reach its second consecutive PAC-12 championship and a spot in the Fiesta Bowl.\n\nBefore coaching at Oregon, McClendon spent four seasons (2016-19) on Will Muschamp’s staff at South Carolina, serving as offensive coordinator in his final two seasons. He coached the wide receiver group all four years at South Carolina.\n\nBeginning his coaching career at his alma mater, McClendon coached on the Georgia Bulldogs staff for nine years (2007-15), holding numerous positions. McClendon coached running backs in the early part of his tenure before making the switch to wide receivers in 2015.\n\nMcClendon, 38, was named the national recruiter of the year by 247sports in 2014.\n\nAs a player, McClendon, who is the son of former NFL running back Willie McClendon, helped Georgia win two SEC Championships during his college career (2002-2005)."}, {"url": "https://www.espn.com/college-football/story/_/id/21969564/south-carolina-gamecocks-promote-bryan-mcclendon-offensive-coordinator", "page_content": "COLUMBIA, S.C. -- South Carolina has promoted Bryan McClendon to offensive coordinator, filling one of the Gamecocks biggest items on the offseason to-do list.\n\nCoach Will Muschamp announced the move Friday, saying he talked with McClendon soon after the interim OC had helped the Gamecocks to a 26-19 victory in the Outback Bowl on New Year's Day.\n\n\"In his two years here at South Carolina, he's been outstanding,\" Muschamp said of the 34-year-old McClendon. \"You see the rapport he has with our staff, with our players, how he positively affects everybody in our entire organization.\"\n\nMcClendon will remain in charge of wide receivers going forward.\n\nMuschamp also hired Dan Werner as quarterbacks coach. Werner was co-offensive coordinator and quarterbacks coach at Ole Miss for five seasons before moving on as an offensive analyst at Alabama this past season.\n\nMcClendon and Werner fill the role of fired offensive coordinator Kurt Roper, who was let go after the season.\n\nThe Gamecocks ranked 13th in total offense and last in points in the 14-team Southeastern Conference in Muschamp's first season in 2016. Those numbers improved slightly this past fall as the Gamecocks were 12th in both SEC categories. That was not enough, however, to keep Muschamp from making a change.\n\nMcClendon hopes to keep South Carolina's offense advancing to next year, building off the team's 9-4 season which marked just the sixth time in school history the team won nine games or more.\n\n\"It's not like we're going to reinvent the wheel offensively,\" McClendon said. \"One thing that we do have to is giving our players the best chance to be successful. That's all any coach can be asked to do.\"\n\nMcClendon's attack will have a solid quarterback in rising junior Jake Bentley, who was named the bowl's most valuable player. It will also have dynamic playmaking receiver Deebo Samuel, who had six touchdowns before getting hurt against Kentucky on Sept. 16.\n\nSamuel, who fractured his leg, is cleared for spring practice, Muschamp said."}, {"url": "https://www.espn.com/college-football/story/_/id/33186734/georgia-bulldogs-hire-assistant-bryan-mcclendon-away-miami-hurricanes", "page_content": "ATHENS, Ga. -- Georgia football has hired assistant coach Bryan McClendon to return to his alma mater less than a month after he took a job with Miami (Fla.).\n\nMcClendon had been on new Hurricanes coach Mario Cristobal's staff at Oregon, and he followed Cristobal to Miami, taking a job early this month as receivers coach and co-offensive coordinator.\n\nBut on Monday, the national champion Bulldogs announced McClendon is joining coach Kirby Smart's staff as wide receivers coach and passing game coordinator, the same titles McClendon had for the previous two seasons at Oregon.\n\nA former wide receiver at Georgia, McClendon was the Bulldogs' running backs coach from 2009 to 2015. Following the firing of coach Mark Richt at the end of the 2015 season, McClendon served as interim coach for the Bulldogs' 24-17 win over Penn State in the TaxSlayer Bowl.\n\nMcClendon also stepped in as Oregon's interim coach for the Ducks' 47-32 loss to Oklahoma in the Alamo Bowl last month. Former Georgia defensive coordinator Dan Lanning is Oregon's new coach.\n\nAt Georgia, McClendon replaces Cortez Hankton, who left to coach LSU's wide receivers.\n\nAfter leaving Georgia in 2015, McClendon was South Carolina's offensive coordinator and wide receivers coach from 2016 to '19.\n\nMcClendon is continuing a family legacy at Georgia. His father, Willie McClendon, was the 1978 Southeastern Conference player of the year as a Georgia running back. His nephew, Warren McClendon, was the starting right tackle this past season as Georgia won its first national title since 1980."}, {"url": "https://www.oregonlive.com/ducks/2020/04/oregon-ducks-hiring-former-sec-offensive-coordinator-as-wide-receivers-coach-per-report.html", "page_content": "EUGENE — Oregon has found its new wide receivers coach from the SEC.\n\nBryan McClendon, who spent the last four years as co-offensive coordinator and wide receivers coach at South Carolina, is joining the Ducks.\n\nMcClendon, who earned $1 million last year, had play-calling duties for the Gamecocks each of the last two years but was stripped off those duties in December and Will Muschamp brought in Mike Bobo as offensive coordinator and quarterbacks coach.\n\nUO instituted a hiring freeze earlier this month, among several measures the school has taken to mitigate the financial impact and uncertainty due to the novel coronavirus. The athletic department requested and was granted an exception to fill the wide receiver coach position, according to an Oregon spokesman.\n\nMcClendon’s contract at South Carolina was for $1 million annually through 2021 and if terminated by the school, he would be owed the difference between that and his new salary and has a $200,000 buyout to leave on his own, according to The State.\n\nHe joined South Carolina’s staff when Muschamp was hired in 2016 and helped develop Deebo Samuel into a second-round draft pick and recruited four-star receivers Bryan Edwards, Shi Smith and OrTre Smith.\n\nFootballScoop first reported the hire of McClendon, who was promoted after the 2017 season and the Gamecocks ranked 24th nationally in yards per play and scored just over 30 points per game in 2018. But that production dropped last season amid injuries at the quarterback position.\n\nMcClendon replaces Jovon Bouknight at UO, which parted ways with its receivers coach last month and he since landed at Kentucky. Bouknight earned $310,000 in salary plus $55,000 in bonuses last year.\n\nMcClendon previously served at Georgia, his alma mater, for nine seasons (2007-15) including as running backs coach, receivers coach and as interim head coach in 2015 for the TaxSlayer Bowl.\n\nHe inherits an Oregon receiver room with 10 scholarship wideouts and with Johnny Johnson III and Jaylon Redd completing their eligibility after this season, receiver is arguably the position of greatest need for the Ducks in their 2021 recruiting class."}, {"url": "https://247sports.com/college/georgia/Article/Georgia-Bulldogs-Football-announces-Bryan-McClendon-hire-official-title-181899799/", "page_content": "Bryan McClendon is officially returning to the University of Georgia. Kirby Smart announced Monday morning that McClendon is returning to the Classic City where he will coach the wide receivers and serve as the passing-game coordinator.\n\nMcClendon is coming on to replace Cortez Hankton, who after four years at UGA -- three as the receivers coach and pass-game coordinator, left for LSU. Salary details for McClendon have not yet been made available by the university. The Mays High School (Atlanta, Ga.) product joins the Bulldog staff after an extremely short stint (less than four weeks) at Miami where he held the co-offensive coordinator and wide receivers coach titles.\n\nMcClendon was the receivers coach at Oregon in 2020 and 2021. He was also the Ducks' interim head coach when Mario Cristobol left to take the Miami job. He was at South Carolina for the four seasons prior to that where he was hired by Will Muschamp, a current assistant coach on Georgia's defensive staff. McClendon held the co-offensive coordinator title at South Carolina in 2016 and 2017. He then became the offensive coordinator and play caller in 2018 and 2019 before being relieved of his duties.\n\nDuring his time with the Gamecocks McClendon helped develop current NFL wideouts Deebo Samuel and Bryan Edwards. They each went over 800 yards receiving in 2018 while Shi Smith had 673 yards receiving. Edwards stayed for the 2019 season and had over 800 yards receiving in that season, too.\n\nHis coaching career began at UGA in 2007 as a graduate assistant. He spent two seasons in that role before being promoted by Mark Richt to the on-field staff in 2009 as running backs coach. McClendon coached running backs from 2009 to 2014 and grew into one of the nation's top recruiters.\n\nMcClendon had a huge hand in Georgia winning out in the hotly tested recruitments of prospects like Isaiah Crowell, Isaiah Wynn, Keith Marshall, Todd Gurley, Sony Michel, and Nick Chubb among others. He was moved to coach wide receivers in 2015 to make room for Thomas Brown to join the coaching staff, but he spent just one season in that role before Richt was fired and most of the staff was let go. McClendon stayed on with the Bulldogs for the 2015 TaxSlayer Bowl and helped lead the team to a victory over Penn State.\n\nMcClendon is the son of UGA running back great Willie McClendon and joined the UGA football team as a player in 2002. He spent four years with the program and was a part of two SEC Championship teams in 2002 and 2005. Smart was the running backs coach on that 2005 team while McClendon was the team's second-leading receiver behind Leonard Pope. After his time at UGA as a player, McClendon was picked up by the Chicago Bears but didn't make it to the 2006 season with the team before he was let go."}, {"url": "https://southcarolina.rivals.com/news/mcclendon-elevated-to-playcaller", "page_content": "Will Muschamp has filled South Carolina's vacant offensive coordinator position by elevating current assistant Bryan McClendon to the full-time role in a move that was announced during a press conference Friday morning.\n\nGamecock Central first learned that Muschamp was learning towards promoting McClendon on Wednesday, news that was reported on The Insiders Forum.\n\nAfter last month's dismissal of co-offensive coordinator Kurt Roper, who called plays for Carolina the last two seasons, McClendon was tabbed by Muschamp to call the Gamecocks' offensive plays in the Outback Bowl against Michigan.\n\n\"Throughout the entire time, I was extremely impressed without how he managed the situation and he we were able to adjust,\" Muschamp said Friday. \"In his first game calling a game, he did a lot better than a lot of proven coordinators, I can tell you that. I'm exciting about that. I've got great belief in Bryan and our entire offensive staff.\"\n\nThe 34-year old Georgia native just completed his second season on the Gamecock coaching staff and was brought to Columbia as the co-offensive coordinator and wide receivers coach when Muschamp first arrived in Columbia.\n\n\"I think it's all just to buy-in to everything we have going on here at South Carolina as a team,\" McClendon said. \"One of the biggest things that Coach Muschamp always talks about is effort, toughness and discipline. I think on offense, we want to lead the country in effort, toughness and discipline. ... One thing we do have to do is do all we can to give our players the best chance to be successful. I think that's all any coach can be asked to do.\"\n\nMuschamp also announced the addition of current Alabama analyst Dan Werner as the Gamecocks' new quarterbacks coach.\n\nALSO SEE: Watch Will Muschamp's press conference live at 10:30 | More scoop on today's press conference | Discuss today's news on The Insider's Forum\n\nIn the bowl, the Gamecocks, down 16 points in the second half, came from behind to win, posting the third-highest point total surrendered by Michigan's defense this season.\n\nA Rivals.com top 25 recruiter for the 2017 cycle, McClendon has done fine work in that department while at USC. He's led efforts on signing four-star wide receiver prospects Bryan Edwards, OrTre Smith, Shi Smith, and Josh Vann, among other prospects.\n\nAn alumnus of the University of Georgia, McClendon enjoyed a successful playing career in Athens prior to a stint in the NFL with the Chicago Bears. He was an assistant coach under Mark Richt at UGA from 2009 until 2015.\n\nAs running backs coach, he recruited and tutored Todd Gurley, Nick Chubb, Sony Michel, and Isaiah Crowell, among others. He also recruited talents such as Keith Marshall, Lorenzo Carter, Isaiah McKenzie, Kendall Baker, and Isaiah Wynn.\n\nMcClendon was the program's recruiting coordinator in 2014 and 2015 and added the titles of assistant head coach and passing game coordinator during the 2015 campaign. He served as UGA's interim head coach at the conclusion of the 2015 and led the Bulldogs to a win over Penn State.\n\nUnder McClendon, South Carolina is expected to run a spread offense with up-tempo principles, which is the identity that Muschamp has hoped to establish in Columbia.\n\n*** SUBSCRIBE today to GamecockCentral.com for the inside scoop on USC athletics and recruiting ***\n\n*** Discuss this story on The Insiders Forum - our vibrant, premium subscriber-only message board ***"}, {"url": "https://247sports.com/college/miami/Article/bryan-mcclendon-officially-hired-at-miami-hurricanes-football-179918283/", "page_content": "The University of Miami press release:\n\nCORAL GABLES, Fla. – Head football coach Mario Cristobal announced Wednesday the hiring of Bryan McClendon to the position of Miami Hurricanes’ wide receivers coach and co-offensive coordinator. McClendon’s hire is pending completion of a standard University background check.\n\nMcClendon arrives in Miami after spending the previous two seasons working as wide receivers coach/pass game coordinator at the University of Oregon under Cristobal. In his final season in Eugene, McClendon helped guide the Ducks to a 10-4 record, including a 7-2 mark in conference play, and its third straight appearance in the Pac-12 Championship Game.\n\n“I’m fired up to have Bryan McClendon join our staff as wide receivers coach and co-offensive coordinator,” Cristobal said. “’B Mac’ is an elite football mind, coach and recruiter, and has exceptional acumen in the area of player development. Miami is a place that has always been known as ‘Wide Receiver U,’ and Bryan’s combination of passion and energy makes him the perfect candidate to help build on that reputation and elevate our program and culture to new heights.”\n\nIn his first season at Oregon in 2020, McClendon helped the Ducks to their second consecutive Pac-12 championship and a spot in the Fiesta Bowl. The Ducks finished fourth in scoring in the Pac-12 in 2020 and third in the conference in McClendon’s final year in 2021.\n\n“I’m thrilled to be joining Coach Cristobal’s staff at the University of Miami,” McClendon said. “Having the chance to reunite with Coach Cristobal, co-coordinate an offense and lead a position room as prestigious as the one at The U presents a special opportunity and a challenge that my family and I are excited to take on together. We can’t wait to get started.”\n\nBefore his arrival at Oregon, McClendon spent the previous four seasons on the South Carolina Gamecocks staff, including the final two seasons as offensive coordinator and wide receivers coach. A National Recruiter of the Year Award winner from 247Sports, McClendon helped take a youthful position room upon arrival in 2016 and turn it into one of the SEC’s strongest wideout groups.\n\n2021 NFL Pro Bowl selection Deebo Samuel turned in a pair of strong seasons under McClendon’s guidance, highlighted by All-America honors in 2018 before being selected in the second round of the 2019 NFL Draft by the San Francisco 49ers. Samuel returned from a season-ending injury as a senior in 2018 to finish second in the SEC with 11 receiving TDs and was joined by junior Bryan Edwards to make up one of two duos in the SEC with 55-plus catches.\n\nNamed co-offensive coordinator and wide receivers coach when he was hired in 2016, McClendon made his play-calling debut for the Gamecocks in a 26-19 win over Michigan in the 2018 Outback Bowl. Weeks after the Outback Bowl win, McClendon was promoted to offensive coordinator and in the 2018 season, the Gamecocks averaged 30.1 points and 425.6 yards per game, good for the program’s most since 2014. South Carolina set a program record with five games of 500 yards or more of total offense, including back-to-back 600-yard performances against Chattanooga and at No. 1 Clemson.\n\nIn McClendon’s first year as offensive coordinator in 2018, quarterback Jake Bentley finished third in program history with 27 TD passes and fourth with 3,171 yards through the air while setting a new school record with five completions of 70 or more yards. Bentley set South Carolina single-game records for TD passes (5) and passing yards (510) at Clemson en route to becoming just the fourth SEC quarterback with 500 yards passing in a road game since 2000.\n\nHis four years in Columbia were preceded by nine seasons on the staff at Georgia, where he was part of 85 wins and a pair of SEC East titles.\n\nNamed the National Recruiter of the Year by 247Sports in 2014, McClendon was the running backs coach at Georgia for six seasons (2009 – 2014) before taking over the wide receivers room in 2015 while serving as passing game coordinator. He was also Georgia’s recruiting coordinator the last two seasons and was the program’s interim head coach during the 2015 TaxSlayer Bowl win over Penn State.\n\nFrom 2009-15 when McClendon was a full-time member of the staff, the Bulldogs averaged 33.4 points per game, which was the second most in the SEC over that seven-year span. McClendon was part of Georgia’s staff that helped the Bulldogs lead the SEC in scoring offense (41.3) in 2014 for just the third time since 1982, highlighted by 44.3 points per game in four SEC road contests.\n\nMcClendon’s running backs room was crowded with future NFL stars in 2014, as Georgia went on to lead the SEC in rushing for the first time since 1992 with 3,352 yards and 38 TDs, which ranked second and third most, respectively, in program history. Despite starting just eight games, Nick Chubb finished second in the SEC in rushing (1,547 yards) and was named the SEC Freshman of the Year. Chubb and Todd Gurley (911 yards in six games) gave Georgia one of five FBS running back duos with over 900 yards rushing in 2014, while Sony Michel rushed for 410 yards on just 64 carries.\n\nPrior to the start of the 2015 season, McClendon was promoted to assistant head coach by Mark Richt and took over as passing game coordinator and wide receivers coach in addition to starting his second year as Georgia’s recruiting coordinator. McClendon’s first class (2015) as recruiting coordinator was ranked No. 6 nationally by 247Sports and Rivals.\n\nFrom 2011-14, the Bulldogs put together four of the top six seasons in program history in total offense and three of the top five seasons for total TDs. McClendon was promoted to the post of running backs coach in 2009. He recruited and developed some of the nation’s best running backs over his five seasons, including Gurley, Chubb, Michel and Isaiah Crowell.\n\nMcClendon began his coaching career with a two-year stint as an offensive graduate assistant on the Georgia staff from 2007-08.\n\nMcClendon was a four-year letterman at Georgia, where he graduated in 2005. His senior class won 44 games, which was the most by any class in Georgia history at the time of his graduation. During his tenure, the Bulldogs won three SEC Eastern Division titles, two SEC championships and played in four bowl games, winning three of them.\n\nMcClendon and his wife, Amber, have three children: Bryan, Brooke and Brayden."}]}