{"Bryan McClendon previously served as the co-offensive coordinator and running backs coach at the University of South Carolina.": [{"url": "https://ugawire.usatoday.com/2022/08/25/georgia-football-wr-coach-bryan-mcclendon-recognized-nationally-as-assistant-watch/", "page_content": "One of Georgia’s biggest offseason moves was adding Bryan McClendon to its coaching staff.\n\nThe former Bulldog receiver is coaching wide receivers in his second coaching stint at UGA since graduating in 2005.\n\nThis week ESPN named McClendon as an assistant to watch ahead of the 2022 season.\n\n“McClendon is very familiar with the program, after playing wide receiver there and coaching the receivers in 2015 after a six-year run with the Bulldogs running backs. He also coached wide receivers at both South Carolina and Oregon, holding an offensive coordinator title at South Carolina. McClendon was set to move with Mario Cristobal from Oregon to Miami before Georgia came calling, “Adam Rittenberg writes.\n\nMcClendon coached running backs and receivers in his first stint at Georgia under head coach Mark Richt and later served as interim head coach in the 2015 TaxSlayer Bowl after Richt’s departure.\n\nGeorgia’s Kirby Smart brought McClendon back to Athens in January just four weeks after McClendon was named co-offensive coordinator and receivers coach at Miami under new coach Mario Cristobal, who brought McClendon with him to Miami from Oregon where he served in the same capacity.\n\nBefore his stint in Eugene, McClendon coached three seasons at South Carolina where he served as co-offensive coordinator and receivers coach and eventually was named offensive coordinator in 2019."}, {"url": "https://ugawire.usatoday.com/2022/01/30/georgia-football-brings-back-wr-coach-bryan-mcclendon-uga/", "page_content": "Multiple reports have confirmed Georgia has hired Bryan McClendon as receivers coach replacing Cortez Hankton, who left for the same position at LSU.\n\nMcClendon is a Mays High School (Atlanta) graduate who played receiver for the Bulldogs from 2002 to 2005 before transitioning to a graduate assistant coach.\n\nMcClendon coached running backs and receivers in his first stint at Georgia under head coach Mark Richt and later served as interim head coach in the 2015 TaxSlayer Bowl after Richt’s departure.\n\nGeorgia’s Kirby Smart brings McClendon back to Athens just four weeks after McClendon was named co-offensive coordinator and receivers coach at Miami under new coach Mario Cristobal, who brought McClendon with him to Miami from Oregon where he served in the same capacity.\n\nBefore his stint in Eugene, McClendon coached three seasons at South Carolina where he served as co-offensive coordinator and receivers coach and eventually was named offensive coordinator in 2019.\n\nMcClendon brings recruiting prowess and experience to the Georgia receiver room, which is looking to replace some serious talent.\n\nStar George Pickens is headed to the NFL draft and Jermaine Burton is headed to Tuscaloosa via the transfer portal, along with two other receiver reserves in Justin Robinson and Jaylen Johnson."}, {"url": "https://www.espn.com/college-football/story/_/id/32992960/miami-hurricanes-hire-oregon-bryan-mcclendon-co-offensive-coordinator-wide-receivers-coach-sources-say", "page_content": "Miami is set to hire Bryan McClendon as co-offensive coordinator and wide receivers coach, sources told ESPN.\n\nMcClendon spent the past two seasons working for new Miami coach Mario Cristobal at Oregon, serving as Ducks wide receivers coach and passing game coordinator. He was Oregon's interim head coach for last week's Valero Alamo Bowl against Oklahoma.\n\nThe 38-year-old has extensive experience in the Southeast, serving from 2009 to 2015 as an assistant at Georgia, where he coached running backs and wide receivers. McClendon, who played wide receiver at Georgia, then spent four years as an offensive coordinator and wide receivers coach at South Carolina, holding the primary coordinator role in 2018 and 2019.\n\nMiami is expected to hire a primary playcaller to work alongside McClendon, according to sources."}, {"url": "https://www.wikiwand.com/en/Bryan_McClendon", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Bryan McClendon?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.cbsnews.com/miami/news/georgia-hires-bryan-mcclendon-away-from-cristobal-miami/", "page_content": "ATHENS, Ga. (CBSMiamiAP) — Miami Hurricanes new head football coach Mario Cristobal is looking for a new receivers coach and co-offensive coordinator after losing Bryan McClendon to Georgia.\n\nGeorgia hired McClendon to return to his alma mater less than a month after he took a job with Miami.\n\nMcClendon had been on new Hurricanes coach Mario Cristobal's staff at Oregon, and he followed Cristobal to Miami, taking a job early this month as receivers coach and co-offensive coordinator.\n\nBut on Monday, the national champion Bulldogs announced McClendon is joining coach Kirby Smart's staff as wide receivers coach and passing game coordinator, the same titles McClendon had for the previous two seasons at Oregon.\n\nA former wide receiver at Georgia, McClendon was the Bulldogs' running backs coach from 2009 to 2015. Following the firing of coach Mark Richt at the end of the 2015 season, McClendon served as interim coach for the Bulldogs' 24-17 win over Penn State in the TaxSlayer Bowl.\n\nMcClendon also stepped in as Oregon's interim coach for the Ducks' 47-32 loss to Oklahoma in the Alamo Bowl last month. Former Georgia defensive coordinator Dan Lanning is Oregon's new coach.\n\nAt Georgia, McClendon replaces Cortez Hankton, who left to coach LSU's wide receivers.\n\nAfter leaving Georgia in 2015, McClendon was South Carolina's offensive coordinator and wide receivers coach from 2016-19.\n\nMcClendon is rejoining a family legacy at Georgia. His father, Willie McClendon, was the 1978 Southeastern Conference player of the year as a Georgia running back. His nephew, Warren McClendon, was the starting right tackle this past season as Georgia won its first national title since 1980.\n\n(© Copyright 2022 CBS Broadcasting Inc. All Rights Reserved. The Associated Press contributed to this report.)"}, {"url": "https://www.saturdaydownsouth.com/sports/bryan-mcclendon-former-georgia-and-south-carolina-assistant-reportedly-lands-acc-co-oc-job/", "page_content": "Bryan McClendon, a former assistant coach at Georgia and South Carolina, has reportedly landed a new job with the Miami Hurricanes.\n\nMcClendon, who was the interim coach at Oregon after he held a similar post at Georgia, is set to become the co-offensive coordinator at Miami, Pete Thamel of Yahoo Sports reported.\n\nAt Oregon, McClendon was the Pass Game Coordinator/wide receivers coach. He joined Mario Cristobal’s staff ahead of the 2020 season, and will reunite with Cristobal in Miami.\n\nMcClendon spent the previous 2 seasons before Oregon as South Carolina’s offensive coordinator and wide receivers coach. His 4 years in Columbia were preceded by 9 seasons on the staff at Georgia where he coached the running backs coach for 6 seasons (2009-14) before taking over the wide receivers room in 2015 while serving as passing game coordinator.\n\nMcClendon was named the National Recruiter of the Year by 247Sports in 2014, according to his Oregon bio."}, {"url": "https://www.oregonlive.com/ducks/2020/04/oregon-ducks-hiring-former-sec-offensive-coordinator-as-wide-receivers-coach-per-report.html", "page_content": "EUGENE — Oregon has found its new wide receivers coach from the SEC.\n\nBryan McClendon, who spent the last four years as co-offensive coordinator and wide receivers coach at South Carolina, is joining the Ducks.\n\nMcClendon, who earned $1 million last year, had play-calling duties for the Gamecocks each of the last two years but was stripped off those duties in December and Will Muschamp brought in Mike Bobo as offensive coordinator and quarterbacks coach.\n\nUO instituted a hiring freeze earlier this month, among several measures the school has taken to mitigate the financial impact and uncertainty due to the novel coronavirus. The athletic department requested and was granted an exception to fill the wide receiver coach position, according to an Oregon spokesman.\n\nMcClendon’s contract at South Carolina was for $1 million annually through 2021 and if terminated by the school, he would be owed the difference between that and his new salary and has a $200,000 buyout to leave on his own, according to The State.\n\nHe joined South Carolina’s staff when Muschamp was hired in 2016 and helped develop Deebo Samuel into a second-round draft pick and recruited four-star receivers Bryan Edwards, Shi Smith and OrTre Smith.\n\nFootballScoop first reported the hire of McClendon, who was promoted after the 2017 season and the Gamecocks ranked 24th nationally in yards per play and scored just over 30 points per game in 2018. But that production dropped last season amid injuries at the quarterback position.\n\nMcClendon replaces Jovon Bouknight at UO, which parted ways with its receivers coach last month and he since landed at Kentucky. Bouknight earned $310,000 in salary plus $55,000 in bonuses last year.\n\nMcClendon previously served at Georgia, his alma mater, for nine seasons (2007-15) including as running backs coach, receivers coach and as interim head coach in 2015 for the TaxSlayer Bowl.\n\nHe inherits an Oregon receiver room with 10 scholarship wideouts and with Johnny Johnson III and Jaylon Redd completing their eligibility after this season, receiver is arguably the position of greatest need for the Ducks in their 2021 recruiting class."}, {"url": "https://www.espn.com/college-football/story/_/id/33186734/georgia-bulldogs-hire-assistant-bryan-mcclendon-away-miami-hurricanes", "page_content": "ATHENS, Ga. -- Georgia football has hired assistant coach Bryan McClendon to return to his alma mater less than a month after he took a job with Miami (Fla.).\n\nMcClendon had been on new Hurricanes coach Mario Cristobal's staff at Oregon, and he followed Cristobal to Miami, taking a job early this month as receivers coach and co-offensive coordinator.\n\nBut on Monday, the national champion Bulldogs announced McClendon is joining coach Kirby Smart's staff as wide receivers coach and passing game coordinator, the same titles McClendon had for the previous two seasons at Oregon.\n\nA former wide receiver at Georgia, McClendon was the Bulldogs' running backs coach from 2009 to 2015. Following the firing of coach Mark Richt at the end of the 2015 season, McClendon served as interim coach for the Bulldogs' 24-17 win over Penn State in the TaxSlayer Bowl.\n\nMcClendon also stepped in as Oregon's interim coach for the Ducks' 47-32 loss to Oklahoma in the Alamo Bowl last month. Former Georgia defensive coordinator Dan Lanning is Oregon's new coach.\n\nAt Georgia, McClendon replaces Cortez Hankton, who left to coach LSU's wide receivers.\n\nAfter leaving Georgia in 2015, McClendon was South Carolina's offensive coordinator and wide receivers coach from 2016 to '19.\n\nMcClendon is continuing a family legacy at Georgia. His father, Willie McClendon, was the 1978 Southeastern Conference player of the year as a Georgia running back. His nephew, Warren McClendon, was the starting right tackle this past season as Georgia won its first national title since 1980."}, {"url": "https://www.behindthesteelcurtain.com/2020/2/9/21130331/report-steelers-hire-former-south-carolina-coach-bryan-mclendon-as-wide-receiver-coach-news-rumors", "page_content": "The Pittsburgh Steelers had a glaring vacancy on their coaching staff since the offseason began. After the passing of Darryl Drake during training camp at Saint Vincent College, the team coaxed Ray Sherman to stay on staff for the season to take over for the late coach.\n\nMike Tomlin was adamant the move was temporary, but after the season there was no news of any new hire, until now.\n\nDale Lolley of DKPittsburghSports reports the team has finally filled the role of wide receivers coach, and they have gone to the college game to do so by hiring former South Carolina coach Bryan McClendon.\n\nMike Tomlin has dipped into the college ranks to fill his wide receivers coaching position.https://t.co/tUAvIGe8kv — Dale Lolley (@dlolley_pgh) February 9, 2020\n\nMcClendon has been in the coaching game since he graduated from the University of Georgia. After being a graduate assistant with the Bulldogs, he was promoted to running backs coach from 2009-2013. From 2014 to 2015 McClendon served as the recruiting coordinator for Georgia. On January 12, 2015, he was promoted and given the title of assistant head coach. He served as interim head coach for Georgia after Mark Richt left the team late in 2015.\n\nAfter Georgia hired Kirby Smart as their head new coach, McClendon left to become the co-offensive coordinator and wide receivers coach at the University of South Carolina. On January 5, 2018, McClendon was promoted to offensive coordinator for the Gamecocks.\n\nJon Ledyard provides more context to the players McClendon coached at Georgia, as well as the wide receivers he has developed in his time in the college ranks.\n\nThis is my way of saying \"help Randy Fichtner design a good run scheme too\". But even at South Carolina, McClendon switched to WRs and developed Deebo Samuel, Bryan Edwards and Shi Smith. — Jon Ledyard (@LedyardNFLDraft) February 9, 2020\n\nThe Steelers adding McClendon looks as if it is much more than a wide receivers coach, but possibly another set of eyes to help build the running game, an area the Steelers struggled mightily in 2019.\n\nThis isn’t the first, or likely the last, time Tomlin has turned to the college game to fill coaching needs. He did it when he hired Eddie Faulkner as the running backs coach, Tom Bradly as the secondary coach and Karl Dunbar as the defensive line coach.\n\nWill McClendon make an impact for the Steelers in 2020 and beyond? The product on the field will be the first indicator. However, it looks as if the Steelers have solidified their coaching staff for the 2020 regular season.\n\nStay tuned to BTSC for the latest news and notes surrounding the black-and-gold as they continue to press on throughout the offseason."}, {"url": "https://caneswarning.com/2022/01/30/impact-miami-football-losing-wr-coach-bryan-mcclendon-georgia/", "page_content": "Multiple media outlets are reporting that Georgia is hiring alum Bryan McClendon as their wide receivers coach away from the Miami football program. McClendon played at Georgia under former Miami head coach Mark Richt from 2002 through 2005. The first nine years of his coaching career McClendon was at Georgia under Richt.\n\nMcClendon worked at Oregon with new Miami head coach Mario Cristobal for the last two years as the passing game coordinator and WRs coach. When Richt was fired by Georgia in 2015 and when Cristobal left for Miami this season, McClendon was the interim head coach for the Ducks and Bulldogs.\n\nMcClendon will be in the interesting position of coaching against Oregon and former Georgia defensive coordinator and now Ducks head coach in the 2022 season opener for both teams. Miami loses an elite recruiter with McClendon returning to Georgia. McClendon is credited with signing five five-star players.\n\nIn 2014 McClendon was named the 247Sports National Recruiter of the Year. McClendon was hired at South Carolina following his first stint as an assistant at Georgia. In two seasons with the Gamecocks, McClendon was the co-offensive coordinator and WR coach from 2016–2017 and sole OC from 2018-’19.\n\nThis is the second year in a row the Miami football program lost a coach shortly after they were hired. After former head coach Manny Diaz hired Travis Williams as the Miami linebackers coach, he left to become the defensive coordinator under Gus Malzahn at Central Florida. Miami will have five WRs coaches in five years.\n\nRob Likens was WRs coach for Miami in the last two seasons and the passing game coordinator in 2021. Likens joined former Miami offensive coordinator Rhett Lashlee at SMU in the same positions he held in Miami. Previous Miami WRs coaches were Taylor Stubblefield in 2019 and Ron Dugans from 2016-17.\n\nMcClendon was hired as the co-offensive coordinator with Miami but was not going to be the play-caller. In the two seasons with South Carolina McClendon called plays. Cristobal now has another assistant coaching position to hire. Miami has all three coordinator positions and all but three position coaches to hire.\n\nKevin Smith was hired from Mississippi as the Miami running backs coach. Cristobal brought defensive line coach Joe Salave’a and offensive line coach Alex Mirabal with him from Oregon. Miami loses McClendon less than three days before National Signing Day. Isaiah Horton is the only WR Miami has in the 2022 Class."}]}