{"After his playing career, Bryan McClendon served as a graduate assistant at Georgia from 2006 to 2008.": [{"url": "https://georgiadogs.com/sports/football/roster/coaches/bryan-mcclendon/3095", "page_content": "Four-year University of Georgia letterman and coach Bryan McClendon was named passing game coordinator and wide receivers coach in February of 2022.\n\n\n\nHe is part of a coaching staff that led the 15-0 Bulldogs to the 2022 College Football Playoff National Championship with a 65-7 victory over TCU in the title game following a semi-final win over Ohio State in the Chick-fil-A Peach Bowl semi-final, 42-41.\n\n\n\nThe Georgia offense ranked among the top five nationally in both scoring offense (41.1 ppg) and total offense (501.1 ypg). The ‘Dogs also finished first nationally in red zone offense (97.6%), first downs (375), and fourth down percentage (86.7%). Senior quarterback Stetson Bennett became the first player to be named the offensive Most Valuable Player in four CFP games including twice in a CFP National Championship Game.\n\n\n\nMcClendon served as a graduate assistant at UGA in 2007-08 and was named to the full-time staff as running backs coach in 2009, a position he held until 2015. McClendon was named interim head coach at UGA at the end of the 2015 season and led the Bulldogs to a 24-17 victory over Penn State in the TaxSlayer Bowl.\n\n\n\nSince that time McClendon has held assistant coaching positions at South Carolina (2016-19) and Oregon (2020-21). He had accepted the post of co-offensive coordinator and wide receivers coach at Miami in January of 2022 but left when his alma mater offered him his current position.\n\n\n\nAt UGA, he coached a number of elite running backs during his tenure, including Isaiah Crowell, Todd Gurley and Keith Marshall, as well as Nick Chubb and Sony Michel. Additionally, McClendon was named National Recruiter of the Year by 247Sports in 2014. McClendon lettered as a wide receiver at Georgia in 2002-05. During that time, the Bulldogs won three SEC Eastern Division titles, two SEC championships and played in four bowl games (2003 Nokia Sugar, ’04 Capital One, ‘05 Outback, ‘06 Nokia Sugar), winning three of them.\n\n\n\nHe graduated in December 2005 with a degree in Recreation and Leisure Studies. He is the son of former Georgia tailback Willie McClendon, 1978 SEC Player of the Year and running back for the Chicago Bears.\n\n\n\nMcClendon is married to the former Amber Arnold of Atlanta. They have three children, Bryan (born 1/10/07), Brooke (born 12/18/11) and Brayden (born 9/18/17).\n\n\n\nMcClendon Thumbnail\n\nBirthdate: Dec. 28, 1983\n\nBirthplace: Chicago, Ill.\n\nFamily: Wife Amber; children Bryan and Brooke\n\nHigh School: Mays\n\nCollege: Georgia '05 (BA Recreation & Leisure Studies)\n\n\n\nCoaching Experience\n\n2007-08.......................... Georgia (Grad. Asst., offense)\n\n2009-14................................... Georgia (Running Backs)\n\n2015...... Georgia (Asst. Head Coach / Wide Receivers /\n\nPassing Game Coord. / Interim Head Coach)\n\n2016-17.......... South Carolina (Co-OC, Wide Receivers)\n\n2018-19.. South Carolina (Offensive Coordinator, WRs)\n\n2020-21.................... Oregon (Pass Game Coord., WRs,\n\n...................................................... Interim Head Coach)\n\nJan. 2022..................... Miami (Co-OC, Wide Receivers)\n\nJan. 2022-Present... Georgia (Pass Game Coord., WRs)\n\n\n\nPlaying Experience\n\nGeorgia (2002-05) - Wide receiver ...member of senior class that won 44 games at UGA, 2 SEC titles, 3 SEC Eastern Division titles, played in four bowl games...caught 56 career passes for 830 yards and six TD's.\n\nMays H.S. - PrepStar All-American, Superprep All-Dixie Team...as a senior, rushed for 424 yards and four TD's on 62 carries...also caught 37 passes for 736 yards...played in Georgia-Florida All-Star game.\n\n"}, {"url": "https://www.espn.com/college-football/story/_/id/33186734/georgia-bulldogs-hire-assistant-bryan-mcclendon-away-miami-hurricanes", "page_content": "ATHENS, Ga. -- Georgia football has hired assistant coach Bryan McClendon to return to his alma mater less than a month after he took a job with Miami (Fla.).\n\nMcClendon had been on new Hurricanes coach Mario Cristobal's staff at Oregon, and he followed Cristobal to Miami, taking a job early this month as receivers coach and co-offensive coordinator.\n\nBut on Monday, the national champion Bulldogs announced McClendon is joining coach Kirby Smart's staff as wide receivers coach and passing game coordinator, the same titles McClendon had for the previous two seasons at Oregon.\n\nA former wide receiver at Georgia, McClendon was the Bulldogs' running backs coach from 2009 to 2015. Following the firing of coach Mark Richt at the end of the 2015 season, McClendon served as interim coach for the Bulldogs' 24-17 win over Penn State in the TaxSlayer Bowl.\n\nMcClendon also stepped in as Oregon's interim coach for the Ducks' 47-32 loss to Oklahoma in the Alamo Bowl last month. Former Georgia defensive coordinator Dan Lanning is Oregon's new coach.\n\nAt Georgia, McClendon replaces Cortez Hankton, who left to coach LSU's wide receivers.\n\nAfter leaving Georgia in 2015, McClendon was South Carolina's offensive coordinator and wide receivers coach from 2016 to '19.\n\nMcClendon is continuing a family legacy at Georgia. His father, Willie McClendon, was the 1978 Southeastern Conference player of the year as a Georgia running back. His nephew, Warren McClendon, was the starting right tackle this past season as Georgia won its first national title since 1980."}, {"url": "https://www.wikiwand.com/en/Bryan_McClendon", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Bryan McClendon?\n\nSummarize this article for a 10 years old"}, {"url": "https://africa.espn.com/college-football/story/_/id/33186734/georgia-bulldogs-hire-assistant-bryan-mcclendon-away-miami-hurricanes", "page_content": "ATHENS, Ga. -- Georgia football has hired assistant coach Bryan McClendon to return to his alma mater less than a month after he took a job with Miami (Fla.).\n\nMcClendon had been on new Hurricanes coach Mario Cristobal's staff at Oregon, and he followed Cristobal to Miami, taking a job early this month as receivers coach and co-offensive coordinator.\n\nBut on Monday, the national champion Bulldogs announced McClendon is joining coach Kirby Smart's staff as wide receivers coach and passing game coordinator, the same titles McClendon had for the previous two seasons at Oregon.\n\nA former wide receiver at Georgia, McClendon was the Bulldogs' running backs coach from 2009 to 2015. Following the firing of coach Mark Richt at the end of the 2015 season, McClendon served as interim coach for the Bulldogs' 24-17 win over Penn State in the TaxSlayer Bowl.\n\nMcClendon also stepped in as Oregon's interim coach for the Ducks' 47-32 loss to Oklahoma in the Alamo Bowl last month. Former Georgia defensive coordinator Dan Lanning is Oregon's new coach.\n\nAt Georgia, McClendon replaces Cortez Hankton, who left to coach LSU's wide receivers.\n\nAfter leaving Georgia in 2015, McClendon was South Carolina's offensive coordinator and wide receivers coach from 2016 to '19.\n\nMcClendon is continuing a family legacy at Georgia. His father, Willie McClendon, was the 1978 Southeastern Conference player of the year as a Georgia running back. His nephew, Warren McClendon, was the starting right tackle this past season as Georgia won its first national title since 1980."}, {"url": "https://apnews.com/076b6d87867974693105cd38b17e9e1d", "page_content": "ATHENS, Ga. (AP) — Georgia has hired assistant coach Bryan McClendon to return to his alma mater less than a month after he took a job with Miami.\n\nMcClendon had been on new Hurricanes coach Mario Cristobal’s staff at Oregon, and he followed Cristobal to Miami, taking a job early this month as receivers coach and co-offensive coordinator.\n\nBut on Monday, the national champion Bulldogs announced McClendon is joining coach Kirby Smart’s staff as wide receivers coach and passing game coordinator, the same titles McClendon had for the previous two seasons at Oregon.\n\nA former wide receiver at Georgia, McClendon was the Bulldogs’ running backs coach from 2009 to 2015. Following the firing of coach Mark Richt at the end of the 2015 season, McClendon served as interim coach for the Bulldogs’ 24-17 win over Penn State in the TaxSlayer Bowl.\n\nMcClendon also stepped in as Oregon’s interim coach for the Ducks’ 47-32 loss to Oklahoma in the Alamo Bowl last month. Former Georgia defensive coordinator Dan Lanning is Oregon’s new coach.\n\nAt Georgia, McClendon replaces Cortez Hankton, who left to coach LSU’s wide receivers.\n\nAfter leaving Georgia in 2015, McClendon was South Carolina’s offensive coordinator and wide receivers coach from 2016-19.\n\nMcClendon is rejoining a family legacy at Georgia. His father, Willie McClendon, was the 1978 Southeastern Conference player of the year as a Georgia running back. His nephew, Warren McClendon, was the starting right tackle this past season as Georgia won its first national title since 1980.\n\n___\n\nMore AP college football: https://apnews.com/hub/college-football and https://twitter.com/AP_Top25. Sign up for the AP’s college football newsletter: https://apnews.com/cfbtop25"}, {"url": "https://www.saturdaydownsouth.com/south-carolina-football/report-south-carolina-assistant-bryan-mcclendon-leaving-for-nfl/", "page_content": "The staff exits continue at South Carolina.\n\nAccording to Mike Gillespie of ABC Columbia, Gamecocks wide receivers coach Bryan McClendon is leaving to join the Pittsburgh Steelers staff. It’s hard to fault McClendon for looking for other jobs as he was demoted from his position as offensive coordinator after the 2019 season. Head coach Will Muschamp kept McClendon on staff as wide receivers coach, a position he has held since 2016. Former Colorado State head coach Mike Bobo is South Carolina’s new offensive coordinator.\n\nMcClendon played wide receiver at Georgia from 2002-05. After a brief stint with the Chicago Bears, McClendon ended his playing career and got into coaching. In 2007, McClendon started as a graduate assistant at his alma mater on Mark Richt’s staff. McClendon was promoted to running backs coach in 2009 and added the recruiting coordinator title in 2014. For the 2015 season, his last at Georgia, McClendon moved to wide receivers coach and also promoted to assistant head coach. McClendon was UGA’s interim head coach for the Bulldogs’ TaxSlayer Bowl win over Penn State after Richt’s departure.\n\nMcClendon is the third post-Signing Day departure from Muschamp’s Gamecocks staff. Defensive line coach John Scott Jr. left for Penn State and running backs coach Thomas Brown left for a position with the Los Angeles Rams."}, {"url": "https://kids.kiddle.co/Bryan_McClendon", "page_content": "\n\nBryan McClendon (born December 28, 1983) is an American football coach who is currently the wide receivers coach and pass game coordinator at the University of Georgia. He previously served as the passing game coordinator and wide receivers coach at the University of Oregon from 2020 to 2021 and interim head coach in the Alamo Bowl in 2021.\n\nMcClendon was previously the offensive coordinator and wide receivers coach for the University of South Carolina. McClendon also served as the interim head football coach at the University of Georgia for the final game of the 2015 season, the TaxSlayer Bowl.\n\nEarly life and playing career\n\nMcClendon played high school football at Benjamin E. Mays High School in Atlanta, Georgia. He played wide receiver at the University of Georgia and graduated in 2005. He was part of a senior class that won 44 games, which was the most in Georgia history until the national championship-winning Class of 2022. As a senior in 2005, McClendon caught the game-winning touchdown pass from DJ Shockley with 3:18 left in Georgia's 14–7 win over Georgia Tech. After college, he spent one summer with the Chicago Bears of the National Football League (NFL).\n\nCoaching career\n\nGeorgia\n\nMcClendon began his career at Georgia as a graduate assistant and was promoted to running backs coach when Tony Ball was moved to wide receivers coach. From 2009 to 2013 he served as the running backs coach for Georgia, but was reassigned to wide receivers coach in 2015 after Thomas Brown was hired from the Wisconsin Badgers. From 2013 to 2015 McClendon served as the recruiting coordinator for Georgia. On January 12, 2015, he was promoted and given the title of assistant head coach. Following the departure of Mark Richt from Georgia in late 2015, McClendon was named interim head coach for the TaxSlayer Bowl.\n\nSouth Carolina\n\nAfter Georgia hired Kirby Smart as their head new coach, McClendon left to become the co-offensive coordinator and wide receivers coach at the University of South Carolina. On January 5, 2018, McClendon was promoted to offensive coordinator for the Gamecocks. However, he was demoted after the conclusion of the 2019 season as South Carolina's offense only scored one touchdown in their last twelve quarters of football. After being demoted he resumed his prior role as wide receivers coach, with no coordinator responsibilities.\n\nOregon\n\nOn April 17, 2020, McClendon was hired as the passing game coordinator and wide receivers coach at the University of Oregon. On December 6, 2021, McClendon was named the interim head coach for the Alamo Bowl following Mario Cristobal's departure to become the head coach at the University of Miami. Following the season, McClendon was hired by Cristobal and the Miami Hurricanes staff.\n\nReturn to Georgia\n\nOn January 31, 2022, McClendon was hired as the wide receivers coach and passing game coordinator at Georgia. McClendon was initially set to be the co-offensive coordinator for the Miami Hurricanes before Georgia offered him a position on its coaching staff. He replaced Cortez Hankton, who left Georgia for the same position at LSU. This is McClendon's second coaching stint with the Bulldogs, as he served under former Georgia head coach Mark Richt from 2007-2015.\n\nPersonal life\n\nMcClendon is married to the former Amber Arnold of Atlanta. They have one son, Bryan. McClendon is the son of former running back Willie McClendon, who also played at Georgia and with the Chicago Bears.\n\nHead coaching record"}, {"url": "https://www.on3.com/teams/georgia-bulldogs/news/bryan-mcclendon-returning-to-georgia-as-wide-receivers-coach/", "page_content": "Georgia has made a move to fill the vacancy at wide receivers coach as sources have confirmed to DawgsHQ that Kirby Smart has hired Bryan McClendon away from Miami.\n\nThe former Bulldog pass catcher was set to be a member of Mario Crisobal’s first staff at “The U” after making the move from Oregon with him but will now head home to Athens where he played and began his coaching career.\n\nMcClendon played at Georgia from 2002 to 2005, hauling in 56 passes for 830 yards and six touchdowns over the course of his career. All six of those scores, including the game winner against Georgia Tech, came during his senior season. From there it was the NFL, playing one season for the Chicago Bears before returning back to Athens to coach under Mark Richt.\n\nMcClendon was a graduate assistant during the 2007 and 2008 seasons until he was promoted into the role of running backs coach in 2009. Recruiting the likes of Todd Gurley, Keith Marshall, Nick Chubb and Sony Michel, Georgia under McClendon continued to build its reputation as “RBU.” In his final season at Georgia, McClendon moved to coaching wide receivers where he has remained for the rest of his career. He also served as the interim head coach, leading the Bulldogs to victory over Penn State in the TaxSlayer Gator Bowl.\n\nWhen Richt left Georgia, so too did McClendon. He joined forces with Will Muschamp, who is on staff at Georgia now, at South Carolina from 2016 to 2019 focusing on the Gamecock wide receivers the entirety of his time there as well as his duties as offensive coordinator in 2018 and 2019. Under McClendon’s direction, Deebo Samuel earned All-SEC honors with 62 catches for 882 yards and 11 touchdowns while Bryan Edwards and Shi Smith also combined for 100 receptions, 1,519 yards and 11 touchdowns. McClendon then went to Oregon for two seasons as the wide receivers coach and passing game coordinator, also serving as the interim head coach when Cristobal made the move to Miami.\n\nMcClendon will be tasked with replacing quite a bit of lost talent and production in the wide receiver room this coming season. Aside from the departure of former position coach Cortez Hankton, Georgia saw George Pickens leave for the NFL Draft and Jermaine Burton, as well as Justin Robinson and Jaylen Johnson, enter the transfer portal. Luckily, the Bulldogs have Ladd McConkey, AD Mitchell and Kearis Jackson coming back to spearhead the passing game.\n\nDawgsHQ will continue to update this story as more details emerge.\n\nReady to get all your latest Georgia athletics news in one place? Become a member of DawgsHQ today. With your DawgsHQ membership, you’ll not only have access to the goings on in Athens, but you’ll be able to peruse other fan sites within the On3 network to hear just how rivals are feeling about the Dawgs, as well. Make sure to follow along on Twitter (@DawgsHQ), on Facebook and on YouTube for all the Dawg news you need now! And listen to the DawgsHQ crew on our podcast Dawg Walk Talk on Spotify and Apple Podcasts."}, {"url": "https://247sports.com/college/georgia/Article/Georgia-Bulldogs-Football-announces-Bryan-McClendon-hire-official-title-181899799/", "page_content": "Bryan McClendon is officially returning to the University of Georgia. Kirby Smart announced Monday morning that McClendon is returning to the Classic City where he will coach the wide receivers and serve as the passing-game coordinator.\n\nMcClendon is coming on to replace Cortez Hankton, who after four years at UGA -- three as the receivers coach and pass-game coordinator, left for LSU. Salary details for McClendon have not yet been made available by the university. The Mays High School (Atlanta, Ga.) product joins the Bulldog staff after an extremely short stint (less than four weeks) at Miami where he held the co-offensive coordinator and wide receivers coach titles.\n\nMcClendon was the receivers coach at Oregon in 2020 and 2021. He was also the Ducks' interim head coach when Mario Cristobol left to take the Miami job. He was at South Carolina for the four seasons prior to that where he was hired by Will Muschamp, a current assistant coach on Georgia's defensive staff. McClendon held the co-offensive coordinator title at South Carolina in 2016 and 2017. He then became the offensive coordinator and play caller in 2018 and 2019 before being relieved of his duties.\n\nDuring his time with the Gamecocks McClendon helped develop current NFL wideouts Deebo Samuel and Bryan Edwards. They each went over 800 yards receiving in 2018 while Shi Smith had 673 yards receiving. Edwards stayed for the 2019 season and had over 800 yards receiving in that season, too.\n\nHis coaching career began at UGA in 2007 as a graduate assistant. He spent two seasons in that role before being promoted by Mark Richt to the on-field staff in 2009 as running backs coach. McClendon coached running backs from 2009 to 2014 and grew into one of the nation's top recruiters.\n\nMcClendon had a huge hand in Georgia winning out in the hotly tested recruitments of prospects like Isaiah Crowell, Isaiah Wynn, Keith Marshall, Todd Gurley, Sony Michel, and Nick Chubb among others. He was moved to coach wide receivers in 2015 to make room for Thomas Brown to join the coaching staff, but he spent just one season in that role before Richt was fired and most of the staff was let go. McClendon stayed on with the Bulldogs for the 2015 TaxSlayer Bowl and helped lead the team to a victory over Penn State.\n\nMcClendon is the son of UGA running back great Willie McClendon and joined the UGA football team as a player in 2002. He spent four years with the program and was a part of two SEC Championship teams in 2002 and 2005. Smart was the running backs coach on that 2005 team while McClendon was the team's second-leading receiver behind Leonard Pope. After his time at UGA as a player, McClendon was picked up by the Chicago Bears but didn't make it to the 2006 season with the team before he was let go."}, {"url": "https://ugawire.usatoday.com/2022/01/30/georgia-football-brings-back-wr-coach-bryan-mcclendon-uga/", "page_content": "Multiple reports have confirmed Georgia has hired Bryan McClendon as receivers coach replacing Cortez Hankton, who left for the same position at LSU.\n\nMcClendon is a Mays High School (Atlanta) graduate who played receiver for the Bulldogs from 2002 to 2005 before transitioning to a graduate assistant coach.\n\nMcClendon coached running backs and receivers in his first stint at Georgia under head coach Mark Richt and later served as interim head coach in the 2015 TaxSlayer Bowl after Richt’s departure.\n\nGeorgia’s Kirby Smart brings McClendon back to Athens just four weeks after McClendon was named co-offensive coordinator and receivers coach at Miami under new coach Mario Cristobal, who brought McClendon with him to Miami from Oregon where he served in the same capacity.\n\nBefore his stint in Eugene, McClendon coached three seasons at South Carolina where he served as co-offensive coordinator and receivers coach and eventually was named offensive coordinator in 2019.\n\nMcClendon brings recruiting prowess and experience to the Georgia receiver room, which is looking to replace some serious talent.\n\nStar George Pickens is headed to the NFL draft and Jermaine Burton is headed to Tuscaloosa via the transfer portal, along with two other receiver reserves in Justin Robinson and Jaylen Johnson."}]}