{"Bryan McClendon then served as the wide receivers coach at the University of Tennessee from 2009 to 2011.": [{"url": "https://georgiadogs.com/sports/football/roster/coaches/bryan-mcclendon/3095", "page_content": "Four-year University of Georgia letterman and coach Bryan McClendon was named passing game coordinator and wide receivers coach in February of 2022.\n\n\n\nHe is part of a coaching staff that led the 15-0 Bulldogs to the 2022 College Football Playoff National Championship with a 65-7 victory over TCU in the title game following a semi-final win over Ohio State in the Chick-fil-A Peach Bowl semi-final, 42-41.\n\n\n\nThe Georgia offense ranked among the top five nationally in both scoring offense (41.1 ppg) and total offense (501.1 ypg). The ‘Dogs also finished first nationally in red zone offense (97.6%), first downs (375), and fourth down percentage (86.7%). Senior quarterback Stetson Bennett became the first player to be named the offensive Most Valuable Player in four CFP games including twice in a CFP National Championship Game.\n\n\n\nMcClendon served as a graduate assistant at UGA in 2007-08 and was named to the full-time staff as running backs coach in 2009, a position he held until 2015. McClendon was named interim head coach at UGA at the end of the 2015 season and led the Bulldogs to a 24-17 victory over Penn State in the TaxSlayer Bowl.\n\n\n\nSince that time McClendon has held assistant coaching positions at South Carolina (2016-19) and Oregon (2020-21). He had accepted the post of co-offensive coordinator and wide receivers coach at Miami in January of 2022 but left when his alma mater offered him his current position.\n\n\n\nAt UGA, he coached a number of elite running backs during his tenure, including Isaiah Crowell, Todd Gurley and Keith Marshall, as well as Nick Chubb and Sony Michel. Additionally, McClendon was named National Recruiter of the Year by 247Sports in 2014. McClendon lettered as a wide receiver at Georgia in 2002-05. During that time, the Bulldogs won three SEC Eastern Division titles, two SEC championships and played in four bowl games (2003 Nokia Sugar, ’04 Capital One, ‘05 Outback, ‘06 Nokia Sugar), winning three of them.\n\n\n\nHe graduated in December 2005 with a degree in Recreation and Leisure Studies. He is the son of former Georgia tailback Willie McClendon, 1978 SEC Player of the Year and running back for the Chicago Bears.\n\n\n\nMcClendon is married to the former Amber Arnold of Atlanta. They have three children, Bryan (born 1/10/07), Brooke (born 12/18/11) and Brayden (born 9/18/17).\n\n\n\nMcClendon Thumbnail\n\nBirthdate: Dec. 28, 1983\n\nBirthplace: Chicago, Ill.\n\nFamily: Wife Amber; children Bryan and Brooke\n\nHigh School: Mays\n\nCollege: Georgia '05 (BA Recreation & Leisure Studies)\n\n\n\nCoaching Experience\n\n2007-08.......................... Georgia (Grad. Asst., offense)\n\n2009-14................................... Georgia (Running Backs)\n\n2015...... Georgia (Asst. Head Coach / Wide Receivers /\n\nPassing Game Coord. / Interim Head Coach)\n\n2016-17.......... South Carolina (Co-OC, Wide Receivers)\n\n2018-19.. South Carolina (Offensive Coordinator, WRs)\n\n2020-21.................... Oregon (Pass Game Coord., WRs,\n\n...................................................... Interim Head Coach)\n\nJan. 2022..................... Miami (Co-OC, Wide Receivers)\n\nJan. 2022-Present... Georgia (Pass Game Coord., WRs)\n\n\n\nPlaying Experience\n\nGeorgia (2002-05) - Wide receiver ...member of senior class that won 44 games at UGA, 2 SEC titles, 3 SEC Eastern Division titles, played in four bowl games...caught 56 career passes for 830 yards and six TD's.\n\nMays H.S. - PrepStar All-American, Superprep All-Dixie Team...as a senior, rushed for 424 yards and four TD's on 62 carries...also caught 37 passes for 736 yards...played in Georgia-Florida All-Star game.\n\n"}, {"url": "https://www.wikiwand.com/en/Bryan_McClendon", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Bryan McClendon?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.espn.com/college-football/story/_/id/33186734/georgia-bulldogs-hire-assistant-bryan-mcclendon-away-miami-hurricanes", "page_content": "ATHENS, Ga. -- Georgia football has hired assistant coach Bryan McClendon to return to his alma mater less than a month after he took a job with Miami (Fla.).\n\nMcClendon had been on new Hurricanes coach Mario Cristobal's staff at Oregon, and he followed Cristobal to Miami, taking a job early this month as receivers coach and co-offensive coordinator.\n\nBut on Monday, the national champion Bulldogs announced McClendon is joining coach Kirby Smart's staff as wide receivers coach and passing game coordinator, the same titles McClendon had for the previous two seasons at Oregon.\n\nA former wide receiver at Georgia, McClendon was the Bulldogs' running backs coach from 2009 to 2015. Following the firing of coach Mark Richt at the end of the 2015 season, McClendon served as interim coach for the Bulldogs' 24-17 win over Penn State in the TaxSlayer Bowl.\n\nMcClendon also stepped in as Oregon's interim coach for the Ducks' 47-32 loss to Oklahoma in the Alamo Bowl last month. Former Georgia defensive coordinator Dan Lanning is Oregon's new coach.\n\nAt Georgia, McClendon replaces Cortez Hankton, who left to coach LSU's wide receivers.\n\nAfter leaving Georgia in 2015, McClendon was South Carolina's offensive coordinator and wide receivers coach from 2016 to '19.\n\nMcClendon is continuing a family legacy at Georgia. His father, Willie McClendon, was the 1978 Southeastern Conference player of the year as a Georgia running back. His nephew, Warren McClendon, was the starting right tackle this past season as Georgia won its first national title since 1980."}, {"url": "https://africa.espn.com/college-football/story/_/id/33186734/georgia-bulldogs-hire-assistant-bryan-mcclendon-away-miami-hurricanes", "page_content": "ATHENS, Ga. -- Georgia football has hired assistant coach Bryan McClendon to return to his alma mater less than a month after he took a job with Miami (Fla.).\n\nMcClendon had been on new Hurricanes coach Mario Cristobal's staff at Oregon, and he followed Cristobal to Miami, taking a job early this month as receivers coach and co-offensive coordinator.\n\nBut on Monday, the national champion Bulldogs announced McClendon is joining coach Kirby Smart's staff as wide receivers coach and passing game coordinator, the same titles McClendon had for the previous two seasons at Oregon.\n\nA former wide receiver at Georgia, McClendon was the Bulldogs' running backs coach from 2009 to 2015. Following the firing of coach Mark Richt at the end of the 2015 season, McClendon served as interim coach for the Bulldogs' 24-17 win over Penn State in the TaxSlayer Bowl.\n\nMcClendon also stepped in as Oregon's interim coach for the Ducks' 47-32 loss to Oklahoma in the Alamo Bowl last month. Former Georgia defensive coordinator Dan Lanning is Oregon's new coach.\n\nAt Georgia, McClendon replaces Cortez Hankton, who left to coach LSU's wide receivers.\n\nAfter leaving Georgia in 2015, McClendon was South Carolina's offensive coordinator and wide receivers coach from 2016 to '19.\n\nMcClendon is continuing a family legacy at Georgia. His father, Willie McClendon, was the 1978 Southeastern Conference player of the year as a Georgia running back. His nephew, Warren McClendon, was the starting right tackle this past season as Georgia won its first national title since 1980."}, {"url": "https://wikimili.com/en/Bryan_McClendon", "page_content": "Mark Allan Richt is a retired American football coach, former player, and television analyst. He was the head football coach at the University of Georgia for 15 years and at the University of Miami, his alma mater, for three. His teams won two Southeastern Conference (SEC) championships, five SEC division titles, and one Atlantic Coast Conference division title. He was a two-time SEC Coach of the Year, the 2017 ACC Coach of the Year, and the winner of the national 2017 Walter Camp Coach of the Year Award. On January 10, 2023, he was inducted into College Football Hall of Fame as part of the 2023 class.\n\nMario Manuel Cristobal is head football coach of the Miami Hurricanes football team at the University of Miami. Cristobal previously was the head football coach at Florida International University (FIU) from 2007 to 2012 and the University of Oregon from 2017 to 2021. He was an all-conference offensive tackle on the Miami Hurricanes football team that won national championships in 1989 and 1991. Cristobal is the first Cuban-American head coach in NCAA Division I college football history.\n\nKevin Leon Beard is an American football coach and former player who is the wide receivers coach for University of Miami. He played college football at the University of Miami for Larry Coker, and afterward played professionally in the AF2 from 2005 to 2006, and in the Arena Football League in 2007. In 2015, Beard returned to Miami as the wide receivers coach.\n\nShawn Watson is an American football coach. He is currently the Head Coach at Wofford College, a position he has held since October 6, 2022 after the resignation of Josh Conklin. Watson served as the head football coach at Southern Illinois University Carbondale from 1994 to 1996, compiling a record of 11–22. He was the offensive coordinator at the University of Colorado Boulder (2000–2005), the University of Nebraska–Lincoln (2007–2010), the University of Louisville (2011–2013), and the University of Pittsburgh (2017–2018).\n\nRobert Michael Bobo is an American college football coach who is currently the offensive coordinator and quarterbacks coach for the Georgia Bulldogs. He was the head coach of the Colorado State Rams football team from 2015 to 2019.\n\nThomas Brown is an American football coach and former running back who is the offensive coordinator for the Carolina Panthers of the National Football League (NFL). Brown previously served as the offensive coordinator and running backs coach at the University of Miami. He played college football at Georgia. Thereafter, he played professionally in the NFL for the Atlanta Falcons and the Cleveland Browns.\n\nMike Hartline is an American football coach and former quarterback who is currently the pass game coordinator and wide receivers coach for the Charlotte 49ers football team. He spent the 2022 season at Auburn. He was previously the offensive coordinator at Ohio Dominican University. He has also spent time on the coaching staffs at the University of Cincinnati and Ohio State University. He was signed by the Indianapolis Colts as an undrafted free agent in 2011. He was signed by the New England Patriots in January 2012, but released in May 2012. He played college football at the University of Kentucky.\n\nJoseph Anthony Cox is an American football coach and former college football quarterback. He played college football for four seasons at the University of Georgia, and was the team's starting quarterback for the 2009 season.\n\nJames Coley is an American football coach who is currently the Wide Receivers coach at Texas A&M University. He was previously the offensive coordinator and quarterbacks coach at the University of Georgia\n\nMichael Eric Johnson is an American football coach and former quarterback, and current wide receivers coach for Syracuse. He was the interim head coach for the UCLA Bruins football team after serving as their offensive coordinator. Previously, he spent two years with the San Francisco 49ers of the National Football League. Johnson was hired along with former offensive coordinator Jimmy Raye by San Francisco head coach Mike Singletary on February 6, 2009. Raye was fired on September 27, 2010 and Johnson was promoted. Beginning in 2014 he served for three seasons as head coach of The King's Academy Knights in Sunnyvale, California, before being hired as wide receiver coach by the University of Oregon in 2017.\n\nSean Ryan is an American football quarterbacks coach with experience coaching in the National Football League (NFL). He has previously served as an assistant coach for the Detroit Lions, Houston Texans, New York Giants and the Carolina Panthers, and is often cited for his development of star players including Victor Cruz, Odell Beckham Jr., Matthew Stafford, Eli Manning, and Deshaun Watson.\n\nJedd Ari Fisch is an American football coach who is currently the head football coach at the University of Arizona. Fisch previously served as the quarterbacks coach for the New England Patriots and as an assistant offensive coordinator and senior offensive assistant for the Los Angeles Rams. In addition, Fisch served as the interim head football coach at the University of California, Los Angeles (UCLA) for the final two games of the 2017 season. He was the quarterbacks coach, wide receivers coach, and passing game coordinator under head coach Jim Harbaugh at the University of Michigan from 2015 to 2016. Fisch has served several stints as an assistant coach in both the professional and college ranks.\n\nMatt Lubick is an American football coach and former player. He currently is a senior analyst for the University of Kansas. He was previously the offensive coordinator and wide receivers coach at the University of Nebraska–Lincoln. He was named the 2012 Football Scoop Wide Receivers Coach of the Year while coaching at Duke University.\n\nT. J. Weist is an American football coach who is an assistant special teams coach for the Baltimore Ravens of the National Football League (NFL). He was the senior offensive analyst for University of Michigan in 2015 and interim head coach of the Connecticut Huskies football team for the 2013 season.\n\nClay Charles Helton is an American college football coach and former player, who is currently the head coach at Georgia Southern. He was previously the head coach of USC from 2015 to 2021. Helton has also been an assistant coach for Duke, Houston and Memphis. His father, Kim Helton, was a coach in college, the National Football League, and the Canadian Football League.\n\nThe 2015 Georgia Bulldogs football team represented the University of Georgia in the 2015 NCAA Division I FBS football season. The Bulldogs played their home games at Sanford Stadium. They were members of the Eastern Division of the Southeastern Conference. This was head coach Mark Richt's 15th and final season leading the program. Richt was relieved of his duties at the end of the regular season. Richt was originally slated to remain head coach for the team's bowl game, but he was replaced after he reached an agreement to become head coach of the Miami Hurricanes football team. Wide receivers coach Bryan McClendon was named interim head coach for the TaxSlayer Bowl against Penn State.\n\nThe 2016 Georgia Bulldogs football team represented the University of Georgia in the 2016 NCAA Division I FBS football season. The Bulldogs played their home games at Sanford Stadium. They were members of the Eastern Division of the Southeastern Conference. They were led by first-year head coach Kirby Smart. They finished the season 8–5, 4–4 in SEC play to finish in a three-way tie for second place in the Eastern Division. They were invited to the Liberty Bowl where they defeated TCU.\n\nThe 2016 TaxSlayer Bowl was a post-season American college football bowl game played on January 2, 2016, at EverBank Field in Jacksonville, Florida. The 71st edition of the Gator Bowl featured the Penn State Nittany Lions of the Big Ten Conference against the Georgia Bulldogs of the Southeastern Conference. It began at noon EST and aired on ESPN. It was one of the 2015–16 bowl games that concluded the 2015 FBS football season. The game's naming rights sponsor was tax preparation software company TaxSlayer.com, and for sponsorship reasons was officially known as the TaxSlayer Bowl.\n\nDan Lanning is an American football coach and former player who is currently the head coach at the University of Oregon. He previously served as the defensive coordinator and outside linebackers coach at the University of Georgia from 2019 to 2021."}, {"url": "https://duckswire.usatoday.com/2021/12/21/interim-hc-bryan-mcclendon-rebuffs-speculation-that-hes-leaving-for-miami/", "page_content": "The past several weeks in Oregon Ducks football news has been concerned with commitment and wondering which coaches are hanging around, and which are jetting for new destinations.\n\nEver since head coach Mario Cristobal left for the University of Miami, Oregon’s coaching staff has seen a mass exodus, with a number of guys agreeing to deals with new teams for next season and signaling their departure from Oregon. While a number of them are still hanging around Eugene to help coach in the bowl game, we know for a large part who is staying and who is going after December 29th.\n\nOne guy who’s future we don’t quite know just yet, though, is interim head coach Bryan McClendon, who has served as the wide receivers coach and pass-game coordinator for the Ducks. McClendon is an extremely valuable coach who players seem to love, and decision-makers seem to respect, made clear by him being offered the interim tag. Fans would obviously like to keep him around.\n\nUnfortunately, it doesn’t look like that will be the case, with some recent leaks online signaling that B-Mac might be taking off for Miami as soon as the season is over to join Cristobal.\n\n“I don’t how much is out there is actually true, to be honest with you,” McClendon said Monday after Oregon’s practice. “The frustrating thing about it and disappointing thing about it is regardless of how some stuff came up, which I still don’t know how that happened until this point, I think everything did get rectified in that sense. The thing that’s frustrating though is I haven’t even thought about it as much as some of the other people have. My focus has been on these guys.”\n\nLooks like Miami has landed Bryan McClendon, who is the lead recruiter for T-Mac. Poorly kept secret but here you go. pic.twitter.com/lQIavnzwvr — Jason Scheer (@jasonscheer) December 18, 2021\n\nThe above tweet is what McClendon is likely referencing, where he was listed on the Miami website directory as the assistant football coach. On Monday, McClendon stated again that he has yet to even think about where his next destination should be if it is outside of Oregon, and that he wants to keep his focus on the players, who deserve it.\n\n“It’s not right for those guys for my focus to be other places. So I haven’t done it,” McClendon said. “It’s not right, quite honestly, for my family to try to make a family decision while my focus is on the guys right now. I feel like anything that’s out there right now, it did not come from me and I would — not to sit up here and say one way or another, but it did not come from me. However all that stuff came out there, I think it got rectified and I do look forward to being able to make those decisions. I just feel like it’ll be a hard decision to make right now while my focus is solely on these guys and making sure that these guys have a positive influence. I don’t want to cheat them. I don’t want to make a bad decision for my family because my focus is so much on these guys right now.”\n\nIt’s extremely possible, and probable, that we find out more about McClendon’s future over the next few days or weeks as Oregon’s appearance in the Alamo Bowl comes and goes. If you were inclined to bet, I could give you a good idea of where to put your money. For now, though, B-Mac is keeping his focus on the players wearing green and yellow. Ten days from now, we’ll see how that changes."}, {"url": "https://www.on3.com/teams/georgia-bulldogs/news/bryan-mcclendon-returning-to-georgia-as-wide-receivers-coach/", "page_content": "Georgia has made a move to fill the vacancy at wide receivers coach as sources have confirmed to DawgsHQ that Kirby Smart has hired Bryan McClendon away from Miami.\n\nThe former Bulldog pass catcher was set to be a member of Mario Crisobal’s first staff at “The U” after making the move from Oregon with him but will now head home to Athens where he played and began his coaching career.\n\nMcClendon played at Georgia from 2002 to 2005, hauling in 56 passes for 830 yards and six touchdowns over the course of his career. All six of those scores, including the game winner against Georgia Tech, came during his senior season. From there it was the NFL, playing one season for the Chicago Bears before returning back to Athens to coach under Mark Richt.\n\nMcClendon was a graduate assistant during the 2007 and 2008 seasons until he was promoted into the role of running backs coach in 2009. Recruiting the likes of Todd Gurley, Keith Marshall, Nick Chubb and Sony Michel, Georgia under McClendon continued to build its reputation as “RBU.” In his final season at Georgia, McClendon moved to coaching wide receivers where he has remained for the rest of his career. He also served as the interim head coach, leading the Bulldogs to victory over Penn State in the TaxSlayer Gator Bowl.\n\nWhen Richt left Georgia, so too did McClendon. He joined forces with Will Muschamp, who is on staff at Georgia now, at South Carolina from 2016 to 2019 focusing on the Gamecock wide receivers the entirety of his time there as well as his duties as offensive coordinator in 2018 and 2019. Under McClendon’s direction, Deebo Samuel earned All-SEC honors with 62 catches for 882 yards and 11 touchdowns while Bryan Edwards and Shi Smith also combined for 100 receptions, 1,519 yards and 11 touchdowns. McClendon then went to Oregon for two seasons as the wide receivers coach and passing game coordinator, also serving as the interim head coach when Cristobal made the move to Miami.\n\nMcClendon will be tasked with replacing quite a bit of lost talent and production in the wide receiver room this coming season. Aside from the departure of former position coach Cortez Hankton, Georgia saw George Pickens leave for the NFL Draft and Jermaine Burton, as well as Justin Robinson and Jaylen Johnson, enter the transfer portal. Luckily, the Bulldogs have Ladd McConkey, AD Mitchell and Kearis Jackson coming back to spearhead the passing game.\n\nDawgsHQ will continue to update this story as more details emerge.\n\nReady to get all your latest Georgia athletics news in one place? Become a member of DawgsHQ today. With your DawgsHQ membership, you’ll not only have access to the goings on in Athens, but you’ll be able to peruse other fan sites within the On3 network to hear just how rivals are feeling about the Dawgs, as well. Make sure to follow along on Twitter (@DawgsHQ), on Facebook and on YouTube for all the Dawg news you need now! And listen to the DawgsHQ crew on our podcast Dawg Walk Talk on Spotify and Apple Podcasts."}, {"url": "https://www.espn.com/college-football/story/_/id/32992960/miami-hurricanes-hire-oregon-bryan-mcclendon-co-offensive-coordinator-wide-receivers-coach-sources-say", "page_content": "Miami is set to hire Bryan McClendon as co-offensive coordinator and wide receivers coach, sources told ESPN.\n\nMcClendon spent the past two seasons working for new Miami coach Mario Cristobal at Oregon, serving as Ducks wide receivers coach and passing game coordinator. He was Oregon's interim head coach for last week's Valero Alamo Bowl against Oklahoma.\n\nThe 38-year-old has extensive experience in the Southeast, serving from 2009 to 2015 as an assistant at Georgia, where he coached running backs and wide receivers. McClendon, who played wide receiver at Georgia, then spent four years as an offensive coordinator and wide receivers coach at South Carolina, holding the primary coordinator role in 2018 and 2019.\n\nMiami is expected to hire a primary playcaller to work alongside McClendon, according to sources."}, {"url": "https://thefamousinfo.com/bryan-mcclendon/", "page_content": "Bryan McClendon (Bryan Edward McClendon) is an American football coach and former player. He is the offensive coordinator and wide receivers coach\n\nBryan McClendon Biography\n\nBryan McClendon (Bryan Edward McClendon) is an American football coach and former player. He is the offensive coordinator and wide receivers coach at the University of South Carolina.\n\nBryan McClendon Age\n\nHe was born on 28 December 1983 in Chicago, Illinois, United States. He is 39 years old as of 2022.\n\nBryan McClendon Height\n\nMcClendon stands at a height of 6 feet 1 inch tall.\n\nBryan McClendon Family\n\nMcClendon is the son of former Bears running back Willie McClendon. He is married to the former Amber Arnold of Atlanta, and together they have a son named Bryan.\n\nBryan McClendon Wife\n\nMcClendon is married to the former Amber Arnold of Atlanta, and together they have a son named Bryan.\n\nBryan McClendon Net Worth\n\nMcClendon has an estimated net worth of about $ 1 million to $5 million .\n\nBryan McClendon Contract/ Salary\n\nMcClendon signed a contract with Georgia Football for two seasons that run through June 30 2024 in which he is being paid a salary of $705,000 annually.\n\nBryan McClendon\n\nHe served as the interim head football coach at the University of Georgia for the final game of the 2015 season, the TaxSlayer Bowl.\n\nHe attended Benjamin E. Mays High School in Atlanta, Georgia, where he played high school football. McClendon played wide receiver at the University of Georgia and graduated in 2005. McClendon was part of a senior class that won 44 games, the most in Georgia history.\n\nAs a senior in 2005, he caught the game-winning touchdown pass from DJ Shockley with 3:18 left in Georgia’s 14–7 win over Georgia Tech.\n\nAfter college, McClendon spent one summer with the Chicago Bears of the National Football League (NFL).\n\nBryan McClendon Coaching career\n\nMcClendon began his career at Georgia as a graduate assistant and was later promoted to running backs coach when Tony Ball was moved to wide receivers coach.\n\nFrom 2009 to 2013, McClendon served as the running backs coach for Georgia, but was reassigned to wide recovers coach in 2014 after Thomas Brown was hired from the Wisconsin Badgers. From 2014 to 2015, he served as the recruiting coordinator for Georgia.\n\nOn January 12, 2015, McClendon was promoted and given the title of assistant head coach. Following the departure of Mark Richt from Georgia in late 2015, he was named interim head coach for the TaxSlayer Bowl.\n\nAfter Georgia hired Kirby Smart as their head new coach, McClendon left to become the co-offensive coordinator and wide receivers coach at the University of South Carolina, a title he held from 2016 to 2017. On January 5, 2018, he was promoted to head Offensive Coordinator for the South Carolina Gamecocks.\n\nBryan McClendon 247\n\nMcClendon was named the 247 after finishing atop the 247Sports National Recruiter Rankings for 2014. He very well earned his title after he locked down two final commitments on February 2014, one more amaizingly contested than the other.\n\nBryan McClendon Head coaching record"}, {"url": "https://www.behindthesteelcurtain.com/2020/2/9/21130331/report-steelers-hire-former-south-carolina-coach-bryan-mclendon-as-wide-receiver-coach-news-rumors", "page_content": "The Pittsburgh Steelers had a glaring vacancy on their coaching staff since the offseason began. After the passing of Darryl Drake during training camp at Saint Vincent College, the team coaxed Ray Sherman to stay on staff for the season to take over for the late coach.\n\nMike Tomlin was adamant the move was temporary, but after the season there was no news of any new hire, until now.\n\nDale Lolley of DKPittsburghSports reports the team has finally filled the role of wide receivers coach, and they have gone to the college game to do so by hiring former South Carolina coach Bryan McClendon.\n\nMike Tomlin has dipped into the college ranks to fill his wide receivers coaching position.https://t.co/tUAvIGe8kv — Dale Lolley (@dlolley_pgh) February 9, 2020\n\nMcClendon has been in the coaching game since he graduated from the University of Georgia. After being a graduate assistant with the Bulldogs, he was promoted to running backs coach from 2009-2013. From 2014 to 2015 McClendon served as the recruiting coordinator for Georgia. On January 12, 2015, he was promoted and given the title of assistant head coach. He served as interim head coach for Georgia after Mark Richt left the team late in 2015.\n\nAfter Georgia hired Kirby Smart as their head new coach, McClendon left to become the co-offensive coordinator and wide receivers coach at the University of South Carolina. On January 5, 2018, McClendon was promoted to offensive coordinator for the Gamecocks.\n\nJon Ledyard provides more context to the players McClendon coached at Georgia, as well as the wide receivers he has developed in his time in the college ranks.\n\nThis is my way of saying \"help Randy Fichtner design a good run scheme too\". But even at South Carolina, McClendon switched to WRs and developed Deebo Samuel, Bryan Edwards and Shi Smith. — Jon Ledyard (@LedyardNFLDraft) February 9, 2020\n\nThe Steelers adding McClendon looks as if it is much more than a wide receivers coach, but possibly another set of eyes to help build the running game, an area the Steelers struggled mightily in 2019.\n\nThis isn’t the first, or likely the last, time Tomlin has turned to the college game to fill coaching needs. He did it when he hired Eddie Faulkner as the running backs coach, Tom Bradly as the secondary coach and Karl Dunbar as the defensive line coach.\n\nWill McClendon make an impact for the Steelers in 2020 and beyond? The product on the field will be the first indicator. However, it looks as if the Steelers have solidified their coaching staff for the 2020 regular season.\n\nStay tuned to BTSC for the latest news and notes surrounding the black-and-gold as they continue to press on throughout the offseason."}]}