{"Bryan McClendon was a four-year letterman and two-year starter at wide receiver.": [{"url": "https://247sports.com/college/georgia/LongFormArticle/Georgia-Football-A-look-at-the-Bulldogs-complete-coaching-staff-and-projected-roles-183626558/", "page_content": "A busy time for Georgia in terms of the coaching carousel seems to have finally ended.\n\nThe Bulldogs’ hiring of North Carolina offensive line coach Stacy Searels on Monday completes the team’s on-field coaching staff for the 2022 season. Searels becomes Georgia’s fourth offseason hire, joining wide receivers coach Bryan McClendon, outside linebackers coach Chidera Uzo-Diribe and defensive backs coach Fran Brown.\n\nGeorgia’s new coaches will look to replicate the success the Bulldogs had in 2021. Georgia posted a 14-1 record in head coach Kirby Smart’s sixth season at the helm and ended the season with a 33-18 victory over Alabama to give the Bulldogs their first national title in 41 years.\n\nLet’s take a look at all 10 assistant coaches that will help the Bulldogs as they try to defend the title in 2022:"}, {"url": "https://247sports.com/Article/Georgias-McClendon-is-247Sports-National-Recruiter-of-the-Year-175899/", "page_content": "BOULDER, Colo.— Who's been talked about more in college football than Deion Sanders?\n\nWhether it's getting the nation's top recruit Travis Hunter to flip on signing day to Jackson State, his decision to accept the Colorado job or the massive roster overhaul that has taken place since the spring game (51 scholarship players total, 44 alone after the spring game) Sanders has given sports media plenty to write about while raising eyebrows across college football.\n\n\"We'll see how it works out but that, to me, looks bad on college football coaches across the country,\" Pitt coach Pat Narduzzi told 247Sports' Brandon Marcello in May, a quote that went viral. \"The reflection is on one guy right now but when you look at it overall — those kids that have moms and dads and brothers and sisters and goals in life — I don't know how many of those 70 that left really wanted to leave or they were kicked in the butt to get out.\"\n\nSanders believes his true true goal behind his roster makeover has been lost in translation. He addressed that and much more this week in a wide-ranging Q&A with 247Sports this week on campus, with Sanders and Colorado providing behind-the-scenes access to one of its summer football camps.\n\nEDITOR'S NOTE: This interview has been edited for clarity.\n\n247Sports: What have you seen so far from your new team?\n\nSanders: \"Want, determination, effort, camaraderie. It is a collection of men — some wanting a second chance. And some of them are just trying to get to the next level. But all of them share a desperate want to get where they want to go as quickly as possible.\"\n\n247Sports: What do you say to people like Pat Narduzzi who have been critical of your roster overhaul?\n\nSanders: \"What was his situation when he came to Pitt? He had a different situation than me. He is not mad at me, he is mad at the situation in football now that allowed his best player to leave a year ago. He’s not mad at me, he’s using me to shoot bullets at another coach who he has an issue with. I don’t know who he is; if he walked in here right now I wouldn’t know him.\"\n\n247Sports: There was a lot of smoke surrounding Travis Hunter when he entered the portal: Would he follow you to Colorado or land somewhere else? He obviously enrolled at Colorado. What are your expectations for him this season?\n\nSanders: \"People offered Travis Hunter a bag. About $1.5 million to try to lure him and buy him out of the transfer portal. But Travis is not the kind of guy that can be bought. He isn't built like that. Travis is a relational young man that is built on relationships and stability. And that’s what he wanted and desired. That is why he decided to ride and stay with us. I cannot wait until they see what he is capable of doing in these next couple of years. Because he will be a top-5 or top-3 pick after his junior year. But the sky's the limit, he is going to play both ways and he is a vital part of the offense and the defense, and he wants that.\n\n247Sports: How do you manage him playing both ways?\n\nSanders: \"We don’t have to manage that. His game is his game. It’s nothing that we manage. Travis is bored when he is not on the field, Travis is not intertwined with things when he is not on the field. Travis likes to be in the action, that’s who he is.\"\n\n247Sports: As I watched the workouts this week, one of the things that has stood out to me is the vocal leadership of Shedeur Sanders. You’ve been coaching him from youth, to high school and now college football. How has Shedeur grown as a leader this spring in the transition to Colorado?\n\nSanders: \"It’s funny telling you this because his brother is sitting here filming this, but [Shedeur’s] nickname is “Grown.” Because he has always been truly mature for his age at different stages of his life that he has encountered and different obstacles he has overcome. He is rock-steady. Grown doesn't get flustered. He is not a 'ra-ra' guy. He's not a 'I’m gonna talk about what he’s going to do” [type of person]. It’s not too many things in life that will get him up or get him down. He is like a baseball player. Baseball players are rock-steady. Football players are up because they have to practice for six days and play one. Baseball players have to do it every day. That is his character. And I love the expectation that he has placed on himself. My expectation of him is far less than his expectations he places on himself. Because not only does he have tremendous expectations, but he is a Sanders. And he knows what that means.\"\n\nGet offseason and recruiting information on your favorite college team for $1 for first month\n\n247Sports: A lot of roster changes have been made.\n\nSanders: \"Necessary changes. Say: 'Necessary.'\n\n247Sports: How do you like your team going into the fall as opposed to what you had in the spring?\n\nSanders: \"Apples and Oranges. You can’t compare the two. You are talking about a situation in which we inherited a team that was 1-11. And everyone knows there are going to be some changes. I don’t understand how you would think that the coaching staff is the only thing that deserved a change. Now when you rid yourself of the entire coaching staff, you think you are going to keep all the kids? That doesn’t make sense to me. And that just doesn’t make sense whatsoever when the previous staff was responsible for securing those kids. That’s not the way that this game is played with us.\"\n\n247Sports: From a recruiting standpoint, if a young man wants to play for Colorado, what does he need to have?\n\nSanders: \"First he needs to have his grades correct and needs to be eligible through our compliance department. Then, he needs to be tough, smart, fast, disciplined and with character. And he has to understand that this coaching staff is old school. Not old fools, but old school. A lot of our principles and the way we attack the game comes from way back when. And we are still that way because that way is the way and it has not failed us yet. So it’s a tremendous expectation, but we go hard and we play fast. And you have to love this thing. We don’t want you to be 'in like' with it. We want you to be 'in love' with it.\"\n\nRELATED: 5 things Carl Reed learned from Colorado's spring game"}, {"url": "https://www.gcshof.com/williemcclendon", "page_content": "WILLIE McCLENDON\n\nMcClendon enjoyed a standout high school career at Glynn Academy, where he was a three-year letterman in football and also a two-year letterman in both basketball and track and field. McClendon was also a team captain for both the football and track teams.\n\n​\n\nMcClendon went on play football at the University of Georgia, where he became an All-American running back for the Bulldogs and was named the 1978 SEC Player of the Year. He was also a three-year letterman for the Bulldogs and continues to rank in the top 10 on several all-time rushing lists at Georgia.\n\n​\n\nIn 1978, McClendon, a team captain for the Bulldogs, ran for 1,312 yards to break the school single-season rushing record then held by former Heisman Trophy winner Frank Sinkwich. Two years later, McClendon’s new record would be topped by freshman sensation Herschel Walker.\n\nFollowing his UGA career, McClendon was drafted by the Chicago Bears with the 66th overall pick in the third round of the NFL draft. He played four seasons with the Bears from 1979-82, backing up legendary running back Walter Payton. McClendon also played professionally with the Jacksonville Bulls of the USFL.\n\n​\n\nMcClendon was an assistant coach at Georgia from 1989 through 1993. McClendon’s son, Bryan, was a standout wide receiver at Georgia and now serves as running backs coach for the Bulldogs.\n\n​\n\nMcClendon is a member of the Glynn Academy Hall of Fame, Georgia-Florida Hall of Fame and the NFL Northeast Chapter Hall of Fame"}, {"url": "https://mgoblue.com/news/2023/4/29/football-five-michigan-selections-round-out-final-day-of-2023-nfl-draft.aspx", "page_content": "Mike Morris (Michigan Photography)\n\nKANSAS CITY, Mo. -- The 2023 NFL Draft closed on Saturday (April 29) and five players from the University of Michigan football program heard their names called for a weekend total of nine players drafted. Defensive lineman Mike Morris and center Olusegun Oluwatimi were chosen four picks apart by the Seattle Seahawks in the fifth round. Punter Brad Robbins (Cincinnati Bengals), offensive lineman Ryan Hayes (Miami Dolphins) and wide receiver Ronnie Bell (San Francisco 49ers) were selected in the seventh round.\n\nWith nine players chosen this weekend, U-M has reached 401 players drafted as a program and is now one of six programs in college football to have 400-plus players selected in the NFL Draft.\n\nThis marks the sixth draft in eight since head coach Jim Harbaugh has been leading the program in which at least five Wolverines have been selected, and the fourth with at least eight players selected. With two specialists chosen this weekend, U-M has had at least one player drafted at every major position on offense, defense and special teams during Harbaugh's tenure.\n\nThe Seahawks selected Morris with the 151st overall selection in the fifth round and chose Oluwatimi at No. 154. Morris and Oluwatimi are the sixth and seventh Wolverines drafted by the Seattle organization, respectively, and the first U-M players taken since wide receiver Amara Darboh (2017). Morris is the first defensive lineman chosen by Seattle since Frank Clark (2015). The last time the team chose a U-M offensive lineman was Steve Hutchinson (2001). Both will join former Wolverine defensive lineman Bryan Mone on the roster.\n\nMorris had his best season in the maize and blue as a senior, earning second-team All-America honors in 2022. He was the Big Ten's Defensive Lineman of the Year after earning first team All-Big Ten honors from the coaches and media. The team's Richard Katcher Award winner as the team's top defensive lineman, Morris was also a semifinalist for the Bednarik Award and a candidate for the Ted Hendricks Trophy. He started at edge defender in 11 contests and played in 12 games, recording 23 tackles, 11 tackles for loss, 7.5 sacks and three pass breakups.\n\nA three-year letterman, Morris appeared in 27 career games and made 16 starts during his career. He registered 40 tackles, 12 TFLs, eight sacks, one interception and three PBUs during his career. Morris earned Academic All-Big Ten honors his final three seasons (2020-22).\n\nOluwatimi made the most of his only season in the winged helmet, earning consensus All-America honors and winning the Rimington Trophy (nation's best center) and Outland Trophy (country's best lineman) in 2022. He started all 14 games at center and helped anchor an offensive line that won the Joe Moore Award as college football's best offensive line for the second straight season. In addition to winning two individual national awards, Oluwatimi was a semifinalist for the Rotary Lombardi Award. He earned first team All-Big Ten honors.\n\nCincinnati chose its second Wolverine of the weekend ( DJ Turner , second round) when it made Brad Robbins its sixth-round selection (217th overall). The Westerville, Ohio, native is the 17th Wolverine drafted by the Bengals, joining former U-M teammates Daxton Hill, Chris Evans and Turner on the roster.\n\nA four-year starter at punter and five-year letterman, Robbins was a three-time Ray Guy Award candidate and 2021 semifinalist for the award honoring the nation's outstanding punter. He was twice selected as a finalist for the Mortell Holder of the Year award (2021-22). Robbins was a two-time All-Big Ten honorable mention selection. He is the first player in program history to be a two-time recipient of the Robert P. Ufer Bequest as the top senior demonstrating the most enthusiasm and love for Michigan.\n\nOn the field, he finished his career ranked second in Michigan history with a 43-yard average and is one of nine punters at U-M with a career average better than 40 yards per punt. He punted 179 times for 7,689 yards (43.0 avg.) with a 66-yard career-long punt. Robbins had 61 punts downed inside the opposition's 20-yard line with only nine career touchbacks; 75 of his 179 punts were fair caught.\n\nHayes was selected by Miami in the seventh round with the 238th pick overall. He is the ninth player from U-M to be chosen by the Dolphins, who have a penchant for drafting offensive linemen when they pick Wolverines. Offensive tackle Jake Long (2008) was the last Wolverine drafted by Miami, who also chose linemen Tony Pape (2004) and Jon Giesler (1979).\n\nThe starting left tackle for back-to-back Joe Moore Award-winning offensive lines, Hayes was a four-year letterman and three-year starter. He appeared in 40 career contests and started 30 games at left tackle. Hayes earned All-Big Ten second-team honors twice (2021-22) and was a three-time Academic All-Big Ten recipient.\n\nHe started 12 games at left tackle in 2022 and helped Michigan's offense surpass 6,000 total offensive yards in both 2021 and 2022, which were the second and third times accomplishing the feat in school history. Hayes was a candidate for the Rotary Lombardi Award and earned second-team All-Big Ten accolades.\n\nThe 49ers chose Bell with the 253rd selection overall (seventh round). He is the 18th Wolverine drafted by the franchise and will join former U-M teammates Moody and Ambry Thomas on the west coast. San Francisco has drafted four U-M wide receivers, with the last prior to Bell being Tai Streets (1999).\n\nBell appeared in 47 career games and started at receiver in 31 contests. A five-year letterman, he finished his career tied for ninth in school history in receiving yards (2,269) and is 10th in receptions (145). Bell scored nine receiving touchdowns and had 36 career receptions of 20-plus yards. A team captain for a pair of Big Ten Championship-winning teams, Bell hauled in at least one reception in 29 straight games played. He had 75 or more receiving yards in 13 games during his career, including four 100-yard receiving efforts.\n\nAs a senior, Bell led the receiving corps career highs in receptions (62), receiving yards (889) and touchdowns (four), earning the team's Offensive Skill Player of the Year award. He was a semifinalist for the Comeback Player of the Year award nationally and earned All-Big Ten third-team honors from the media and coaches. Bell started all 14 games at receiver in 2022.\n\nNotes\n\n• In eight NFL Drafts since head coach Jim Harbaugh has been leading the program, U-M has had every major position selected at least once. On offense: quarterback, running back, tight end, h-back/fullback, wide receiver, offensive line (tackle and interior). On defense: defensive line (edge and interior), linebacker, cornerback, and safety. Among specialists: kicker, punter, and long snapper.\n\n• When Ryan Hayes was selected in the seventh round, it marked 400 U-M players drafted in program history. Michigan is one of six programs in college football with 400-plus players chosen in the NFL Draft (401).\n\n• At least one Michigan player has been selected in 85 consecutive NFL Drafts (1938 to present), continuing the program's NCAA record streak among its peers.\n\n• Two Wolverines were chosen by the Seattle Seahawks in Mike Morris (151th overall) and Olu Oluwatimi (154). The last time a team selected two U-M players in the same year was 2020, when the New England Patriots chose Josh Uche (60) and Michael Onwenu (182) in the same draft.\n\n• The three-pick spread between selections from U-M is the tightest since Devin Bush (10) and Rashan Gary (12) were chosen in the first round of the 2019 draft. Chase Winovich (77) and David Long (79) also were chosen three picks apart that year.\n\n• When punter Brad Robbins was chosen in the sixth round (Cincinnati Bengals), he and kicker Jake Moody (San Francisco 49ers) became the first pair of U-M specialists to be drafted in the same year. In the last 40 NFL Drafts, only U-M (2023) and Utah (2019; kicker Mitch Wishnowsky, punter Matt Gay) have had multiple specialists drafted in the same year.\n\n• In six of the eight NFL Drafts to occur since head coach Harbaugh has been leading the program, at least five Wolverines have been selected. In four drafts, at least eight Wolverines have been selected.\n\n• Fifty-three players have been drafted during Harbaugh's tenure, including eight first-round picks."}, {"url": "https://www.gcshof.com/inductees", "page_content": "CLASS OF 2016\n\nBASEBALL\n\nKEVIN DRURY\n\nKevin Drury was a star shortstop on Glynn Academy's 1973 AAA state championship baseball team, whom long-time Brunswick News sports editor Murray Poole says was one of the two best fielding shortstops he witnessed in his 40 years with the newspaper.\n\nCOACH\n\nGARY LARKINS\n\nGary Larkins was a teacher and successful coach at Frederica Academy for 25 years from 1975-2000 before moving to Glynn Academy where he enjoyed continued success with the Glynn Academy girls soccer team until retiring from coaching following the 2013 season with...\n\nFOOTBALL\n\nRESHARD LEE\n\nReshard Lee was a record-setting quarterback for Brunswick High before going on to play collegiate and professional football. Lee was a three-year starter for John Willis’ Pirates from 1997-99, finishing his prep career with 4,038 passing yards which is a Glynn County record while also throwing for 51 touchdowns.\n\nCOACH\n\nC.M. PAGE\n\nC.M. Page was a major influence in high school athletics in Glynn County for 36 years in his several coaching positions and also his eventual role as athletic director for the local school system. Page was the head football coach at Glynn for 18 years, from 1944 to 1961, when he coached...\n\nSPORTS WRITER\n\nMURRAY POOLE"}, {"url": "https://www.tennesseetitans.com/team/players-roster/ryan-tannehill/", "page_content": "PRO: The Titans traded for Ryan Tannehill in the 2019 offseason, bringing an experienced, veteran leader to the team. He took control as the team's starting quarterback by midseason and subsequently led the Titans to the playoffs and an AFC championship game appearance. In the process, he set single-season franchise records and led the NFL with a 117.5 passer rating and a passing average of 9.6 yards per attempt. His play led to his first career Pro Bowl appearance. He was rewarded with a multi-year contract extension in March 2020. Tannehill excelled again in his second season with the club, registering a career-best 33 touchdown passes while leading the Titans to a second consecutive postseason appearance. In 2021, he passed for 3,734 yards while leading the club to the best record in the AFC and a third straight playoff berth. Tannehill spent his first seven seasons as a member of the Miami Dolphins after being selected in the first round of the 2012 NFL Draft. He started 88 games over six seasons in South Florida and accumulated 20,434 passing yards and 123 touchdown passes. The Texas A&M product has also shown mobility as a signal caller, having rushed for 1,931 career yards and 24 touchdowns through 2021.\n\nCAREER HIGHLIGHTS:\n\n• In 2021, Tannehill notched 3,734 passing yards, 21 passing touchdowns and seven rushing scores while leading the Titans to their second consecutive AFC South division title.\n\n• In 2020, Tannehill finished fifth in the NFL with a 106.5 passer rating and tied for seventh in the NFL with a career-high 33 touchdown tosses. He passed for 3,819 yards and rushed for 266 yards with a career-high seven rushing touchdowns. In the process, he set a franchise record with 40 combined touchdowns in a season.\n\n• In his first season in Tennessee, Tannehill led the Titans to a 9-4 combined record as a starter in the regular season and playoffs and won the NFL Comeback Player of the Year Award. He earned his first Pro Bowl invitation after leading the NFL in passer rating (117.5) and passing average (9.6 yards per attempt) and ranking third in completion percentage (70.3). He set club records in all three categories.\n\n• He was named AFC Offensive Player of the Month for December 2019 after completing 90 of 132 passes for 1,322 yards with 12 touchdowns and two interceptions. His passer rating for the calendar month was 124.6, which led the AFC.\n\n• Tannehill made his first career playoff appearance at the conclusion of the 2019 campaign and helped lead the Titans to a wild card win at New England and a divisional round victory at Baltimore.\n\n• During his seven seasons (2012-18) in Miami, Tannehill passed for at least 3,000 yards four times and more than 4,000 yards twice. He totaled 16 career 300-yard passing games, which is the second-most in Dolphins history.\n\n• Tannehill engineered 17 career fourth-quarter comebacks during the first eight seasons of his career.\n\n• In 2015, Tannehill posted 4,208 passing yards with 24 touchdowns and set a then-NFL record with 25 consecutive completions. His 4,208 passing yards was the fifth-highest single-season total in Dolphins history and most by a Dolphins quarterback other than Dan Marino.\n\n• In 2014, Tannehill passed for 4,045 yards with 27 touchdowns for a 92.8 passer rating. He registered a career-best 311 rushing yards with a touchdown. His 392 completions were the most in Dolphins history.\n\nTITANS TIDBITS:\n\n• Ryan founded the Tannehill's A.C.E.S. (Achieving Community Educations Success) program with wife, Lauren, which consisted of 17 sophomores from American Senior High School and is focused on awarding scholarships to the participating students who strive for good grades and took on an active role in their community by hosting monthly events to reward the students and help them give back to the community.\n\n• Ryan enjoys deep-sea fishing off the coast of South Florida in his free time.\n\n• Ryan's father, Tim, played wide receiver at Texas Tech from 1985-87.\n\nCAREER TRANSACTIONS:\n\n• The Big Spring, Texas, native was originally selected by the Miami Dolphins in the first round (eighth overall) of the 2012 NFL Draft.\n\n• Traded by the Dolphins to the Titans along with a 2019 sixth-round pick for a 2019 seventh-round draft pick and a 2020 fourth-round draft choice on March 15, 2019.\n\nCOLLEGE:\n\n• Was a four-year letterman (2008-11) and two-year starter as a quarterback and wide receiver at Texas A&M.\n\n• Played in 50 games with 25 starts and completed 484 of 774 passes for 5,450 yards with 42 touchdowns. Hauled in 112 receptions for 1,596 yards with 10 touchdowns. Rushed 115 times for 369 yards with five touchdowns.\n\n• Started 19 games at quarterback and six contests at wide receiver, while playing both quarterback and wide receiver in five games.\n\n• As a senior (2011), started all 13 games and completed 327 of 531 passes for 3,744 yards and 29 touchdowns. Notched 58 carries for 306 yards and four touchdowns.\n\n• In his final collegiate campaign, was named honorable mention All-American, a finalist for the Johnny Unitas Golden Arm Award (nation's top quarterback), a semifinalist for the Davey O'Brien Award (nation's top quarterback) and a finalist for the William V. Campbell Trophy (nation's best scholar-athlete).\n\n• As a junior (2010), played in all 13 games with six starts at quarterback and connected on 152 of 234 passes for 1,638 yards and 13 touchdowns. As a wide receiver registered 11 receptions for 143 yards with a touchdown. Rushed 51 times for 76 yards and a score. Saw action at wide receiver for the first seven games of the season. Took over starting quarterback duties for the final six games and posted a 5-1 record.\n\n• As a sophomore (2009), played in all 13 games and was named honorable mention All-Big 12. Collected 46 receptions for 609 yards and four touchdowns. Completed four of eight passes for 60 yards. Notched four carries for minus five yards.\n\n• As a redshirt freshman (2008), played in 11 games with six starts at wide receiver. Battled for the starting quarterback spot in camp but moved to receiver at the start of the season. Tallied 55 receptions for 844 yards with five touchdowns. Completed his only pass for eight yards. Notched two carries for minus eight yards. His 55 receptions, 844 receiving yards and five receiving touchdowns were school freshman records. Received honorable mention Freshman All-American honors and was voted school's offensive MVP by his teammates.\n\n• Redshirted in 2007.\n\n• Majored in biology at Texas A&M."}, {"url": "https://www.arkansasonline.com/news/2022/jul/30/armstead-headlines-induction-ceremony/", "page_content": "Miami Dolphins offensive tackle Terron Armstead and 16 other University of Arkansas at Pine Bluff greats will be inducted into the school's Letter \"A\" Club Hall of Fame during a virtual ceremony Aug. 13.\n\nThe event, themed \"A Celebration of the Resiliency of Golden Lions,\" will begin at 6 p.m. Tickets are required for the event.\n\nArmstead, a three-time Pro Bowler, signed a five-year, $75-million deal with the Dolphins after spending his first nine NFL seasons with the New Orleans Saints. The Illinois native helped the UAPB football team win the 2012 Southwestern Athletic Conference championship. The following year was drafted in the third round, 75th overall, by New Orleans in 2013 after running a 4.71-second 40-yard dash, the fastest time of any offensive lineman at the NFL combine since it started in 1982.\n\nArmstead was also a shot putter, discus thrower and hammer thrower for the Golden Lions.\n\nOther inductees this year include:\n\n• Football: Ronald McCall, Eddie Patterson, Willie Robinson, Jimmy Sanders, Roderick Robinson, Donald Belle, Harold Sanders Sr., George Belton and Terris Harris\n\n• Two sports: Johnny Edwards and Walter Baker\n\n• Track and field: Kimberly George Robinson and Tammie Pickett McFarland\n\n• Basketball: Dr. Lawrence A. Davis Jr. and Lonnette Davis\n\n• Baseball: Budd Anthony White\n\nRonald McCall\n\nMcCall, a native of Birmingham, Alabama, was a four-year starter at wide receiver and was an eighth round draft selection for the Pittsburgh Steelers in the 1980 NFL Draft. While at UAPB, he experienced resounding success in football and is noted for being the first-ever player in school's history to participate in the prestigious Senior Bowl All-Star game in Mobile, Alabama. He was also a three-time National Association of Intercollegiate Athletics (NAIA) All-American.\n\nEddie Patterson\n\nPatterson, a 1972 graduate from Wabbaseka, was a three-year starter at linebacker and defensive end. Known for his quickness as an edge rusher, he was chosen as the outstanding defensive player of the game seven times during his collegiate career. He led the team in sacks as a junior and was the defensive team captain during his senior season. He was offered a free agent contract with the Kansas City Chiefs. He now resides in Las Vegas.\n\nWillie Robinson\n\nRobinson transferred to UAPB from Wiley (Texas) College after his freshman season and quickly made an impact with the Golden Lions. Known as \"Wild Bill\" by his teammates, he started at linebacker as a junior and senior. A key member of both the special teams unit and defense, Robinson was a versatile athlete He resides in Birmingham, Alabama.\n\nJimmy Sanders\n\nSanders, who lives in Atlanta, was a three-year letterman in football and track, an aggressive hitter on defense and a key special teams' performer. He worked his way into the starting lineup at free safety as a senior. He went into coaching after graduating in 1972, spending time as an assistant high school football coach, a high school track coach and a stint on the UAPB football coaching staff as the offensive coordinator.\n\nRoderick Robinson\n\nRobinson is a 1999 graduate who was a four-year letterman in football. A native of Memphis, he finished his collegiate career with some impressive numbers at quarterback. In addition to his passing ability, he rushed for 392 yards and scored 10 touchdowns as a junior while throwing for 14 touchdowns. He finished his career with 3,851 passing yards, a 51.7 passing completion percentage, 30 touchdowns and 517 yards rushing yards. After college, he joined the Indianapolis Colts as a free agent quarterback. For two seasons, he was the Colts' backup for Pro Football Hall of Famer Peyton Manning.\n\nLonnette Davis\n\nDavis, a native of West Helena (now Helena-West Helena), is a 1990 graduate who was a four-year letterwinner in women's basketball. Perhaps one of the top defensive players on the squad during her collegiate career, she was a two-time winner of the Sam Cook Defensive Award. She broke into the starting lineup as a point guard during her junior season and never relinquished it for the remainder of her career. She helped the Golden Lions reach the NAIA District 17 post-season tournament three consecutive years, beginning her sophomore year. She resides in Little Rock.\n\nTammie Pickett McFarland\n\nMcFarland is a 1997 graduate who was a four-year letterwinner in track and field. A native of Dallas, the speedy and gifted sprinter was a steady performer on the 4x100-meter and 4x400-meter relay team. One of her most notable outings occurred in 1994 at the NAIA national outdoor track and field championships at Azusa Pacific University in Azusa, Calif., where UAPB finished 14th overall. Despite running on a sore right heel, she clocked an 11.57-second split on the third leg of the 4x100-meter relay to help UAPB post a season-best 47.09 timing in the event. She resides in Odessa, Florida.\n\nWalter Baker\n\nBaker is a 1961 graduate who was a four-year letterman in football and baseball. He had a decorated collegiate career while playing quarterback for the football team and competing at a high level as a hard-throwing pitcher in baseball. In his senior year, he received the James \"Smiley\" Gay Award for the Outstanding Athlete of the Year for his performance as a two-sport athlete. He lives in Louisville, Mississippi.\n\nJohnny Edwards\n\nEdwards, a 1971 graduate from Louisville, Miss., was a three-year letterman in baseball and football. The two-sport athlete turned in his most productive season in both sports during his senior year. The switch-hitting second baseman, who was known for his accurate fielding, was named the team's most valuable player as a senior. He was also an exceptional running back on the football field. He resides in Louisville, Miss., his hometown.\n\nLawrence A. Davis Jr.\n\nDavis is a 1958 graduate who was a four-year letterman in basketball. He also was a two-time O'Bryant Award winner for the highest grade point average for an athlete and was the 9th District Outstanding Scholar for Omega Psi Phi fraternity. His career as an educator and administrator is just as impressive. He has been an instructor, assistant professor, associate professor and professor in the UAPB Department of Mathematics and Physics, dean of the School of Arts and Sciences for 15 years, UAPB's chancellor for 21 years and is currently UAPB's Chancellor Emeritus. He lives in Pine Bluff.\n\nKimberly George Robinson\n\nRobinson, a native of Batesville, is a 1994 graduate who was a four-year letterwinner and two-time NAIA All-American track and field standout. Throughout her collegiate career, she performed at a high level. During her sophomore year, she finished in the top 10 of a crowded field at the NAIA national cross country championships. That same year, she continued to be impressive during the national outdoor track and field championships in Canada. She was a part of the 1,600-meter relay squad that established a school record with a 3-minute, 44.00-second timing in the event.\n\nGeorge Belton\n\nBelton is a 1970 graduate who was a four-year letterman and three-year starter in football. He played at a trio of positions, including tight end, slot receiver and split end. He also was a teammate of notable UAPB Hall of Famers such as L.C. Greenwood, Charles \"Monk\" Williams and Willie Parker. He lives in Monroe, La.\n\nDonald Belle\n\nBelle, a native of Mobile, Ala., is a 1971 graduate who was a two-year letterman in football. He made his mark as a top-notch quarterback on the gridiron during the 1969 and 1970 seasons, passing for 1,125 yards and 21 touchdowns. During his final two seasons, he received the Letter \"A\" Club Most Valuable Player Award, the Claude T. Pumphrey Most Valuable Player Award, the Ernest and Carolyn Gibson Most Valuable Player Award and the Outstanding Offensive Player of the Year Award.\n\nHarold Sanders Sr.\n\nSanders is a 1962 graduate who was a three-year letterman in football. He anchored the offensive line as a starting center for three consecutive years, beginning with his sophomore season. One of his proudest accomplishments is being responsible for over 27 family members attending UAPB/AM&N. He lives in Pine Bluff.\n\nBudd Anthony White\n\nWhite, who will be inducted posthumously, was a four-year letterman in baseball. The 1974 graduate was a standout pitcher and a member of the football team for one season. One of his finest achievements was being part of the baseball team during the squad's NAIA District 17 playoff run.\n\nTerris Harris\n\nHarris, who also will be inducted posthumously, lettered four years in football. He began his college career as a quarterback and was later converted to safety. He was an outstanding athlete and earned various awards. For over two decades, he was credited with having the school's longest interception return against Alcorn State University until the record was broken in 1998. Shortly after his senior season, he signed a free agent contract with the Buffalo Bills."}, {"url": "https://247sports.com/college/miami/Article/Miami-Hurricanes-Football-2022-Coach-Bryan-McClendon-shares-recruiting-philosophy-at-wide-receiver-179875544/", "page_content": "Miami Hurricanes co-offensive coordinator and wide receivers coach Bryan McClendon doesn’t overcomplicate what he looks for in recruiting players at his position group.\n\nWhile at Oregon, McClendon, who is regarded as one of the best recruiters in the country and was the 247Sports Recruiter of the Year in 2015, shared what he is looking for at the wide receiver position.\n\n“As silly as it might sound, I like receivers that can catch the ball,” McClendon said. “I like guys that can naturally catch the football and then you like guys that can create players after they have the ball in their hand. It is really hard in football nowadays to go seven, eight, nine, ten play drives. You want guys that can create explosive plays on their own.”\n\nWhile at Oregon, McClendon was the primary recruiter for two of the most highly touted wide receivers to ever sign with the program.\n\nMcClendon was the primary recruiter for 6-feet-5, 185 pound four-star receiver Dont’e Thornton, who hailed from Mount Saint Joseph in Baltimore, Maryland. Thornton ranked as the No. 57 overall player in the country in the class of 2021.\n\nMcClendon was the secondary recruiter for Troy Franklin (6-2, 170) out of Melo-Atherton (CA) High School in the 2021 cycle. Franklin ranked as the No. 41 overall player in the country.\n\nAs true freshmen in 2021, Thornton and Franklin combined for 384 receiving yards and four touchdowns.\n\nIn the 2022 class, McClendon was targeting wide receiver Kevin Coleman out of St. Louis, Missouri. Coleman ranks as the No. 44 overall player in the country and stands 5-feet-11 and 170 pounds.\n\nDoes McClendon have a particular type of receiver he likes in terms of body type? The coach made it clear at Oregon that he simply wants playmakers.\n\n“The best guys, no matter what size they are, they can get open and create explosive plays. Whatever size that comes in, is what size it comes in,” McClendon said. “The size range can really vary. At the end of the day, you want guys that can consistently beat man-to-man coverage. Whatever size that comes in, I am fine with it. I am more about the traits that you need to go out and play well. I am fine if that comes with a bigger body guy or a smaller guy.”\n\nMcClendon’s reputation as a top recruiter was earned dating back to when he was a young running backs coach at Georgia. McClendon is credited as the primary recruiter for top UGA backs like Isaiah Crowell, Nick Chubb, Sony Michel, and Todd Gurley.\n\nTalent acquisition is a key part of success in major college football and McClendon understands that.\n\n“Recruiting is part of the job,” McClendon said. “In today’s day and age, coaches have to recruit. You have to do it. I definitely want to go out and bring in the best players that I can work with. I have been placed where people have put their trust in me to do that.\n\n“Recruiting is about relationships. It is about gaining the trust of people and get to the point where they know you are going to do everything in your power to help them be the best they can be on and off the field. At the end of the day, that is what I am trying to show people.”\n\nDuring his time at Oregon, McClendon appreciated being on a staff that was led by a head coach that embraces the grind of participating fully in the recruiting process.\n\n“It is always great to be on a staff with like minded people,” McClendon said. “Recruiting should always be a main focus for every staff. At the end of the day, that is the lifeblood of every program. Coach Cristobal has recruited at a high level during his career and that shows that he gets it and understands it.”\n\nMcClendon has a lot of success recruiting in the southeastern region of the country and using those connections to land top players from Georgia, Florida, and the Carolinas.\n\n“All I really know is recruiting in that region and so I have a lot of really good relationships built up,” McClendon said. “It helps that I have known people a long time that will put a good word in for me with recruits and their families.”"}, {"url": "https://www.letsrun.com/forum/flat_read.php?thread=6065152", "page_content": "Instead of saying you earned 4 varsity letters in XC, does it make sense to say \"4 x Letterman\" ?.......or do you only reach letterman status once? (the first time you make varsity)\n\nand would it be \"4 x LettermAn\" or LettermEn ?\n\nI tried looking it up online but didn't find conclusive results"}, {"url": "https://www.sun-sentinel.com/sports/miami-hurricanes/fl-sp-um-mcclendon-leaving-20220130-twh3w4oh25cebcmzhsqro2wwke-story.html", "page_content": "Miami’s coaching staff took a hit on Sunday, as Georgia will hire Hurricanes wide receivers coach and co-offensive coordinator Bryan McClendon.\n\nMcClendon was on Miami’s staff for only 25 days after being officially hired on Jan. 5. He will be Georgia’s new wide receivers coach.\n\nMcClendon followed new Hurricanes coach Mario Cristobal from Oregon to Miami after spending two years as an assistant coach on Cristobal’s staff with the Ducks. Before coaching with Cristobal at Oregon, McClendon coached at South Carolina for four years.\n\nTaking a position on Georgia’s staff allows McClendon to return to his alma mater; he played for Georgia from 2002 to 2005 and coached there for nine seasons.\n\nMcClendon’s departure opens another spot on Cristobal’s staff. The new Miami coach has not hired an offensive or defensive coordinator and currently has only three assistant coaches on his staff: offensive line coach Alex Mirabal, running backs coach Kevin Smith and defensive line coach and associate head coach Joe Salave’a\n\nMcClendon has a reputation as a good position coach and as an excellent recruiter, and he already played a key role in securing 2023 wide receiver commit Andy Jean, who announced his commitment to the Hurricanes on Saturday.\n\n“Me and coach Bryan McClendon’s relationship feels great like I [knew] him for years,” Jean told the South Florida Sun Sentinel on Sunday before news of McClendon’s departure broke. “Great energy from the both us. We connect well. Can’t wait to be coached by him.”"}]}