{"Royce Campbell has released several albums as a leader, including Royce Campbell Plays the Music of Pat Martino (1995), Royce Campbell Plays the Music of George Gershwin (1997), and Royce Campbell Plays the Music of Antonio Carlos Jobim (1999).": [{"url": "https://www.radioswissjazz.ch/en/music-database/musician/23863981e9384cb3556b8909564e1e4c966d7f/biography", "page_content": "Royce Campbell\n\nFrom Wikipedia, the free encyclopedia.\n\nRoyce Campbell is a jazz guitarist.\n\nRoyce Campbell was born in Seymour, Indiana, in 1952. The son of a career navy man, Campbell grew up in various cities around the U.S. and abroad, including Asia, Europe, and the West Indies. Exposure to various musical genres while a child contributed to Campbell's musical style and approach in jazz composition and playing. A love for rock and roll marked Campbell's first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, Campbell was also influenced by Jimi Hendrix and Eric Clapton.[1]\n\nBy the time Royce finished high school in the early 1970s, he was certain he wanted to pursue a professional career in music. His uncle, Carroll DeCamp, an arranger/pianist who arranged for Stan Kenton and Les Elgart, invited Royce to live with him and study in Indiana, providing most of Royce's musical education in theory and composition, and by age 21, Campbell had begun touring with R&B artist Marvin Gaye and developing his talents for stage performance. In 1975, Royce was hired by a local music contractor to do three concerts with award-winning film composer Henry Mancini in Indianapolis. Soon after Royce became the touring guitarist with Henry Mancini's orchestra, holding that positing until Mancini's death in 1994.[2]\n\nWhile appearing on recordings as a sideman, and a couple as leader, during the early years of his career, Campbell started recording and touring more on his own during the 1990s, focusing at first on mainstream or straight-ahead jazz. Although he cites Wes Montgomery as his main influence, horn players such as Dexter Gordon and Chet Baker are evident in Royces, tone and approach to changes. In 1993, he produced Project G-5: A Tribute to Wes Montgomery which also featured guitarists Tal Farlow, Jimmy Raney, Herb Ellis and Cal Collins. His 1994 album 6x6 featured guitarists Pat Martino, John Abercrombie, Larry Coryell, Dave Stryker and Bucky Pizzarelli.With Project G-5: A Tribute to Joe Pass, in 1999, he combined the talents of Charlie Byrd, Gene Bertoncini, Mundell Lowe, and John Pisano.\n\nDuring his career Royce Campbell has released more than 30 CDs as leader or co-leader among various sideman projects. Fifteen of these CDs have made it onto the US national jazz radio charts. Campbell's soloing is documented among other jazz guitarists of the era, in Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! [3]\n\nIn November 2010, Royce Campbell was inducted into the Indianapolis Jazz Foundation Hall of Fame.\n\nDiscography\n\nHeadline Recordings\n\nYear Title Label 1983 Solo Guitar RedBud Records 1987 Around the Town Raised Eyebrow Records 1990 Nighttime Daydreams Timeless Records 1993 Elegy To A Friend Raised Eyebrow Records 1993 Vista Sin-Drome Records 1994 A Tribute To Wes Montgomery Evidence Music 1994 Vista - WTPI 10th Anniversary Jazz Sampler WTPI 1994 6x6 Paddle Wheel Records 1994 Gentle Breeze Timeless Records 1995 Make Me Rainbows Positive Music 1995 A Tribute to Henry Mancini Tuxedo Music Ltd 1998 Pitapat A-Records 1999 Hands Across The Water String Jazz Recordings 1999 A Tribute to Joe Pass King Record Co. 1999 Royce Campbell with Strings Chase Music 1999 Remembering Wes Savant Records 1999 Stella By Starlight. Jazz After Midnight. St. Clair Entertainment Group 2000 \"Prelude to a Kiss\" - Jazz Guitarists Who's Who: The Art of Solo Guitar King Record Co. 2002 Trioing Jardis Records 2003 A Tribute to Charlie Byrd Jardis Records 2006 Trio By Starlight Philology Jazz Records 2007 Get Happy Foxhaven Records 2008 Roses & Wine Philology Jazz Records 2009 All Standards...and A Blues Philology Jazz Records 2009 Movie Songs Project (with Phil Woods) Philology Jazz Records 2010 What is This Thing Called? Philology Jazz Records 2004 Six by Six: A Jazz Guitar Celebration Moon Cycle Records 2004 A Jazz Guitar Christmas Moon Cycle Records 2005 Plays for Lovers Moon Cycle Records 2006 Elegy To A Friend Moon Cycle Records 2006 Gypsy Soul Moon Cycle Records 2007 A Solo Guitar Christmas Moon Cycle Records 2008 The Art of Chord Solo Guitar Moon Cycle Records 2008 A Jazz Guitar Christmas: Volume 2 Moon Cycle Records 2009 Solo Wes: A Solo Guitar Tribute to Wes Montgomery Moon Cycle Records 2009 Solo Mancini: A Solo Guitar Tribute to Henry Mancini Moon Cycle Records 2010 Solo Trane: A Solo Guitar Tribute to John Coltrane Moon Cycle Records 2010 Triologue: Concepts Moon Cycle Records 2011 Jazz Blues Moon Cycle Records 2012 The Beginning Moon Cycle Records\n\nReferences\n\nHeidt, John. \"Royce Campbell.\" Vintage Guitar. July (2005): 26. Alexander, Charles. Masters of Jazz Guitar: The Story of the Players and Their Music. London, UK: Balafon Books, 1999, 185. Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! Pacific, MO: Mel Bay Publications, 2000.\n\nAdditional sources\n\nBenedetto, Robert. Making an Archtop Guitar . Anaheim Hills, CA: Centerstream Publishing, 1994. xiii.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1994. xiii. Cook, Richard, and Brian Morton. The Penguin Guide to Jazz, 9th Ed. New York, NY: The Penguin Group, 2008. 221, 1209.\n\nNew York, NY: The Penguin Group, 2008. 221, 1209. Esposito, Russell R. The Golden Milestone,4th Ed . New York, NY: The New York Learning Library, 2007. 320.\n\n. New York, NY: The New York Learning Library, 2007. 320. Ingram, Adrian. Mel Bay Concise History of the Electric Guitar . Pacific, MO: Mel Bay Publications, 2006. 106.\n\n. Pacific, MO: Mel Bay Publications, 2006. 106. Ingram, Adrian. The Gibson L5 . Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74. Larkin, Colin, ed. Encyclopedia of Popular Music, 4th Ed . USA: Oxford U P, 2006.\n\n. USA: Oxford U P, 2006. Leonard, Hal, Corp. All Music Guide to Jazz: The Definitive Guide to Jazz, 4th Ed . San Francisco, CA: Backstreet Publishing, 2002. 1063.\n\n. San Francisco, CA: Backstreet Publishing, 2002. 1063. Ellis, Andy. \"A Tribute to Wes Montgomery.\" Guitar Player 29.2 (Feb 1995): 146.\n\n29.2 (Feb 1995): 146. Resnicoff, Matt. \"Project G-5: A Tribute to Wes Montgomery.\" Guitar Player 29.6 (June 1995): 29-30.\n\n29.6 (June 1995): 29-30. Boyd, Herb. \"CD Reviews A Tribute to Henry Mancini.\" Down Beat 63.6 (June 1996): 45.\n\n63.6 (June 1996): 45. Ellis, Andy. \"Hands Across the Water.\" Guitar Player 32.12 (Dec 1998): 139.\n\n32.12 (Dec 1998): 139. Koransky, Jason. \"Project Shopping.\" Down Beat 66.6 (June 1999): 53.\n\n66.6 (June 1999): 53. Levy, Adam. \"Royce Campbell.\" Guitar Player 33.12 (Dec 1999): 41.\n\n33.12 (Dec 1999): 41. Smith, Will. \"Six By SixA Jazz Guitar Celebration.\" Down Beat 72.7 (July 2005): 76.\n\n72.7 (July 2005): 76. Ephland, John. \"Rudy Linka-Royce Campbell.\" Down Beat 74.3 (March 2007): 71.\n\n74.3 (March 2007): 71. Koert, Hans. \"The Five Guitars.\" IAJRC Journal 40.4 (Dec 2007): 71-72.\n\n40.4 (Dec 2007): 71-72. Ephland, John. \"Traveling Guitars.\" Down Beat 76.2 (Feb 2009): 71.\n\nThis page was last modified 31.10.2013 22:24:26\n\n\n\nThis article uses material from the article Royce Campbell from the free encyclopedia Wikipedia and it is licensed under the GNU Free Documentation License."}, {"url": "https://www.benedettoguitars.com/player/royce-campbell/", "page_content": "December 28, 2017 Royce Campbell\n\nRoyce Campbell is a prolific recording artist and performer with over 30 albums released as leader or co-leader. He is known as one of the most melodic soloists on the jazz guitar scene today. He has recorded with many legendary jazz guitarists including Pat Martino, Tal Farlow, Jimmy Raney, Herb Ellis, John Abercrombie, Larry Coryell, Bucky Pizzarelli, Mundell Lowe, Charlie Byrd, Gene Bertoncini, and Cal Collins. His recordings have been favorably reviewed by jazz critics worldwide, and he has been featured in profiles in Jazz Times, DownBeat, Guitar Player Magazine, 21st Century Guitar, Japan’s Swing Journal, and Germany’s Akustik Gitarre. He has appeared on the cover of String Jazz and Just Jazz Guitar.\n\nCampbell toured for 19 years as the guitarist for famed film composer Henry Mancini and has performed in over 30 countries including 10 tours of Japan. He has appeared in jazz festivals and taught master classes in Europe, Asia and Australia, as well as the US. Campbell has performed with jazz greats Jimmy Cobb, Ray Brown, Dave Brubeck, Gerry Mulligan, Houston Person, Jack McDuff, Groove Holmes, Eddie Daniels and Fred Hersch among others, and he has accompanied many great vocalists including Marvin Gaye, Rosemary Clooney, Mose Allison, Nancy Wilson, Mel Torme, Cleo Laine, Micheal Feinstein, Perry Como, Freddy Cole, and Luciano Pavorotti.\n\nRoyce plays a Fratello model.\n\nphoto courtesy of player"}, {"url": "https://infogalactic.com/info/Royce_Campbell", "page_content": "From Infogalactic: the planetary knowledge core\n\nRoyce Campbell (born June 7, 1952) is a jazz guitarist primarily associated with mainstream jazz, but also has released smooth jazz and post bop jazz recordings.\n\nCampbell was born in Seymour, Indiana. The son of a career navy man, Campbell grew up in various cities around the U.S. and abroad, including Asia, Europe, and the West Indies. Exposure to various musical genres while a child contributed to Campbell's musical style and approach in jazz composition and playing. A love for rock and roll marked Campbell's first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, Campbell was also influenced by Jimi Hendrix and Eric Clapton.[1]\n\nBy the time Campbell finished high school in the early 1970s, he was certain he wanted to pursue a professional career in music. His uncle, Carroll DeCamp, an arranger/pianist who arranged for Stan Kenton and Les Elgart, invited Royce to live with him and study in Indiana, providing most of Royce's musical education in theory and composition, and by age 21, Campbell had begun touring with R&B artist Marvin Gaye and developing his talents for stage performance. In 1975, Royce was hired by a local music contractor to do three concerts with award-winning film composer Henry Mancini in Indianapolis. Soon after Royce became the touring guitarist with Henry Mancini's orchestra, holding that positing until Mancini's death in 1994.[2]\n\nWhile appearing on recordings as a sideman, and a couple as leader, during the early years of his career, Campbell started recording and touring more on his own during the 1990s, focusing at first on mainstream or straight-ahead jazz. Although he cites Wes Montgomery as his main influence, the influence of horn players such as Dexter Gordon and Chet Baker are evident in Royce's melodic style. In 1993, he produced Project G-5: A Tribute to Wes Montgomery which also featured guitarists Tal Farlow, Jimmy Raney, Herb Ellis and Cal Collins. His 1994 album 6x6 featured guitarists Pat Martino, John Abercrombie, Larry Coryell, Dave Stryker and Bucky Pizzarelli. With Project G-5: A Tribute to Joe Pass, in 1999, he combined the talents of Charlie Byrd, Gene Bertoncini, Mundell Lowe, and John Pisano.\n\nDuring his career Royce Campbell has released more than 30 CDs as leader or co-leader among various sideman projects. Fifteen of these CDs have made it onto the US national jazz radio charts. Campbell's soloing is documented among other jazz guitarists of the era, in Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! [3]\n\nIn November 2010, Royce Campbell was inducted into the Indianapolis Jazz Foundation Hall of Fame.\n\nDiscography\n\nHeadline Recordings\n\nYear Title Label 1983 Solo Guitar RedBud Records 1987 Around the Town Raised Eyebrow Records 1990 Nighttime Daydreams Timeless Records 1993 Elegy to a Friend Raised Eyebrow Records 1993 Vista Sin-Drome Records 1994 A Tribute To Wes Montgomery Evidence Music 1994 Vista – WTPI 10th Anniversary Jazz Sampler WTPI 1994 6x6 Paddle Wheel Records 1994 Gentle Breeze Timeless Records 1995 Make Me Rainbows Positive Music 1995 A Tribute to Henry Mancini Tuxedo Music Ltd 1998 Pitapat A-Records 1999 Hands Across The Water String Jazz Recordings 1999 A Tribute to Joe Pass King Record Co. 1999 Royce Campbell with Strings Chase Music 1999 Remembering Wes Savant Records 1999 Stella By Starlight. Jazz After Midnight. St. Clair Entertainment Group 2000 \"Prelude to a Kiss\" – Jazz Guitarists Who's Who: The Art of Solo Guitar King Record Co. 2002 Trioing Jardis Records 2003 A Tribute to Charlie Byrd Jardis Records 2006 Trio By Starlight Philology Jazz Records 2007 Get Happy Foxhaven Records 2008 Roses & Wine Philology Jazz Records 2009 All Standards...and A Blues Philology Jazz Records 2009 Movie Songs Project (with Phil Woods) Philology Jazz Records 2010 What is This Thing Called? Philology Jazz Records 2004 Six by Six: A Jazz Guitar Celebration Moon Cycle Records 2004 A Jazz Guitar Christmas Moon Cycle Records 2005 Plays for Lovers Moon Cycle Records 2006 Elegy to a Friend Moon Cycle Records 2006 Gypsy Soul Moon Cycle Records 2007 A Solo Guitar Christmas Moon Cycle Records 2008 The Art of Chord Solo Guitar Moon Cycle Records 2008 A Jazz Guitar Christmas: Volume 2 Moon Cycle Records 2009 Solo Wes: A Solo Guitar Tribute to Wes Montgomery Moon Cycle Records 2009 Solo Mancini: A Solo Guitar Tribute to Henry Mancini Moon Cycle Records 2010 Solo Trane: A Solo Guitar Tribute to John Coltrane Moon Cycle Records 2010 Triologue: Concepts Moon Cycle Records 2011 Jazz Blues Moon Cycle Records 2012 The Beginning Moon Cycle Records\n\nReferences\n\n↑ Heidt, John. \"Royce Campbell.\" Vintage Guitar. July (2005): 26. ↑ Alexander, Charles. Masters of Jazz Guitar: The Story of the Players and Their Music. London, UK: Balafon Books, 1999, 185. ↑ Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! Pacific, MO: Pacific, MO: Mel Bay Publications , 2000.\n\nAdditional sources"}, {"url": "https://www.liquisearch.com/royce_campbell", "page_content": "Royce Campbell is a jazz guitarist.\n\nRoyce Campbell was born in Seymour, Indiana, in 1952. The son of a career navy man, Campbell grew up in various cities around the U.S. and abroad, including Asia, Europe, and the West Indies. Exposure to various musical genres while a child contributed to Campbell's musical style and approach in jazz composition and playing. A love for rock and roll marked Campbell's first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, Campbell was also influenced by Jimi Hendrix and Eric Clapton.\n\nBy the time Royce finished high school in the early 1970s, he was certain he wanted to pursue a professional career in music. His uncle, Carroll DeCamp, an arranger/pianist who arranged for Stan Kenton and Les Elgart, invited Royce to live with him and study in Indiana, providing most of Royce's musical education in theory and composition, and by age 21, Campbell had begun touring with R&B artist Marvin Gaye and developing his talents for stage performance. In 1975, Royce was hired by a local music contractor to do three concerts with award-winning film composer Henry Mancini in Indianapolis. Soon after Royce became the touring guitarist with Henry Mancini's orchestra, holding that positing until Mancini's death in 1994.\n\nWhile appearing on recordings as a sideman, and a couple as leader, during the early years of his career, Campbell started recording and touring more on his own during the 1990s, focusing at first on mainstream or straight-ahead jazz. Although he cites Wes Montgomery as his main influence, horn players such as Dexter Gordon and Chet Baker are evident in Royce’s, tone and approach to changes. In 1993, he produced Project G-5: A Tribute to Wes Montgomery which also featured guitarists Tal Farlow, Jimmy Raney, Herb Ellis and Cal Collins. His 1994 album 6x6 featured guitarists Pat Martino, John Abercrombie, Larry Coryell, Dave Stryker and Bucky Pizzarelli.With Project G-5: A Tribute to Joe Pass, in 1999, he combined the talents of Charlie Byrd, Gene Bertoncini, Mundell Lowe, and John Pisano.\n\nDuring his career Royce Campbell has released more than 30 CD’s as leader or co-leader among various sideman projects. Fifteen of these CDs have made it onto the US national jazz radio charts. Campbell's soloing is documented among other jazz guitarists of the era, in Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists!\n\nIn November 2010, Royce Campbell was inducted into the Indianapolis Jazz Foundation Hall of Fame."}, {"url": "https://www.guitarsite.com/newsletters/040927/4.shtml", "page_content": "Contact | Contents | Privacy Policy | Forum\n\nCopyright © 1999 - 2023 , All Rights Reserved.\n\nAffiliate Notice: As an Amazon Associate we earn from qualifying purchases."}, {"url": "https://music.metason.net/artistinfo?name=Royce%20Campbell", "page_content": "Royce Campbell\n\ng, *1952 US, North Vernon, Indiana\n\nMusician of Jazz and Spoken Word\n\nRoyce Campbell (born June 7, 1952) is a jazz guitarist primarily associated with mainstream jazz, but also has released smooth jazz and post bop jazz recordings.Campbell was born in Seymour, Indiana. The son of a career navy man, Campbell grew up in various cities around the U.S. and abroad, including Asia, Europe, and the West Indies. Exposure to various musical genres while a child contributed to Campbell's musical style and approach in jazz composition and playing. A love for rock and roll marked Campbell's first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, Campbell was also influenced by Jimi Hendrix and Eric Clapton."}, {"url": "https://sonichits.com/artist/Royce_Campbell", "page_content": "A full- time musician since age 17, Royce Campbell has now been a musician over 40 years. His talent became apparent early, and by age 21 he was touring with R&B legend Marvin Gaye. In 1975, Campbell began touring with award-winning film composer Henry Mancini, and he would remain with Mancini for 19 years. Campbell has released over 20 CD’s as leader or co-leader. Eleven consecutive CDs have made it onto the US national jazz radio charts, including four reaching the top ten.\n\nA full- time musician since age 17, Royce Campbell has now been a musician over 40 years. His talent became apparent early, and by age 21 he was touring with R&B legend Marvin Gaye. In 1975, Campbell began touring with award-winning film composer Henry Mancini, and he would remain with Mancini for 19 years. Campbell has released over 20 CD’s as leader or co-leader. Eleven consecutive CDs have made it onto the US national jazz radio charts, including four reaching the top ten.\n\n\n\nCampbell has recorded with many of the greats of the jazz guitar, including legendary Pat Martino, Herb Ellis, Tal Farlow, Jimmy Raney, and Cal Collins, Pat Martino, John Abercrombie, Larry Coryell, Mundell Lowe, John Pisano, Charlie Byrd, Gene Bertoncini, and Bucky Pizzarelli. Royce has toured in Europe eight times and in Japan ten times as a soloist. Royce has also performed with many other jazz giants such as Mel Torme, James Moody, Nancy Wilson, Sarah Vaughn, Jack McDuff, Ray Brown, Dave Brubeck, Joe Williams, Cleo Laine, Eddie Daniels, Eddie Harris, Frank Morgan, Ken Poplowski, Gerry Mulligan, Houston Person, Freddy Cole, Vanessa Rubin, Jimmy Cobb, Fred Hersch, Rosemary Clooney, and Mose Allison.\n\n\n\nRoyce has been featured on the covers of String Jazz and Just Jazz Guitar. He also has been featured in profiles in Jazz Times, Down Beat, Guitar Player Magazine, 21st Century Guitar, Japan's Swing Journal and Germany's Akustik Gitarre.\n\n\n\nCampbell’s primary influence has always been Wes Montgomery, and in his honor, Royce produced the historic recording “Project G-5, A Tribute to Wes Montgomery\" as well as the CD “Remembering Wes” featuring Mel Rhyne, former organ player with the Wes Montgomery trio."}, {"url": "https://www.allaboutjazz.com/musicians/royce-campbell", "page_content": "Royce has played guitar since age nine. By the time Royce finished high school, he was certain that he wanted to pursue a career in music, but he did not have the means to go to music school. Fortunately, his uncle Carroll DeCamp, a renowned arranger/pianist/guitarist, invited Royce to live with him and study.\n\nSoon Royce's reputation as a quality musician spread, and in 1973 he was asked to tour with vocalist Marvin Gaye. Two years later, Royce was hired by a local music contractor to do three concerts with Henry Mancini in Indianapolis. Mancini was so impressed by Royce's abilities that he asked him to become his regular touring guitarist, and Royce worked with Mancini for 19 years until Mancini's death in 1994.\n\nRoyce has been on the cover of the two main jazz guitar magazines String Jazz and Just Jazz Guitar. He has been featured in profiles in Jazz Times, Down Beat, Guitar Player Magazine, Vintage Guitar, 21st- Century Guitar, Japan's Swing Journal, and Germany's Akustik Gitarre.\n\nRoyce has toured in Europe seven times and toured Japan ten times as a soloist. Royce has also performed with many jazz greats such as Mel Torme, Sarah Vaughn, Ray Brown, Dave Brubeck, Joe Williams, Cleo Laine, Eddie Daniels, Eddie Harris, Frank Morgan and Mose Allison.\n\nCurrently, Royce resides in the Virginia/Washington D.C. area, and he continues to compose and produce recordings regularly.\n\n\n\n"}, {"url": "https://www.last.fm/music/Royce+Campbell/+wiki", "page_content": "A full- time musician since age 17, Royce Campbell has now been a musician over 40 years. His talent became apparent early, and by age 21 he was touring with R&B legend Marvin Gaye. In 1975, Campbell began touring with award-winning film composer Henry Mancini, and he would remain with Mancini for 19 years. Campbell has released over 20 CD’s as leader or co-leader. Eleven consecutive CDs have made it onto the US national jazz radio charts, including four reaching the top ten.\n\nCampbell has recorded with many of the greats of the jazz guitar, including legendary Pat Martino, Herb Ellis, Tal Farlow, Jimmy Raney, and Cal Collins, Pat Martino, John Abercrombie, Larry Coryell, Mundell Lowe, John Pisano, Charlie Byrd, Gene Bertoncini, and Bucky Pizzarelli. Royce has toured in Europe eight times and in Japan ten times as a soloist. Royce has also performed with many other jazz giants such as Mel Torme, James Moody, Nancy Wilson, Sarah Vaughn, Jack McDuff, Ray Brown, Dave Brubeck, Joe Williams, Cleo Laine, Eddie Daniels, Eddie Harris, Frank Morgan, Ken Poplowski, Gerry Mulligan, Houston Person, Freddy Cole, Vanessa Rubin, Jimmy Cobb, Fred Hersch, Rosemary Clooney, and Mose Allison.\n\nRoyce has been featured on the covers of String Jazz and Just Jazz Guitar. He also has been featured in profiles in Jazz Times, Down Beat, Guitar Player Magazine, 21st Century Guitar, Japan's Swing Journal and Germany's Akustik Gitarre.\n\nCampbell’s primary influence has always been Wes Montgomery, and in his honor, Royce produced the historic recording “Project G-5, A Tribute to Wes Montgomery\" as well as the CD “Remembering Wes” featuring Mel Rhyne, former organ player with the Wes Montgomery trio."}, {"url": "https://www.allaboutjazz.com/six-by-six-royce-campbell-moon-cycle-review-by-john-kelman", "page_content": "Album Review\n\nFor some reason, the guitar is one of those instruments that engender competition. While there are exceptions, in general if you put two guitarists together, what you'll get is a contest to see who can be louder, who can be faster, who can be more dominant. So, when you get an album where a relative unknown teams up with five more visible players, it's not unreasonable to expect something of a whizzing contest.\n\nFortunately, while there's plenty of good-spirited jousting on Royce Campbell's Six By Six, it's more a demonstration of how one guitarist can integrate seamlessly with five stylistically diverse players. Rather than being a case of determining who's on top, Campbell has created a celebration of jazz guitar which, while staying within the mainstream, covers a lot of turf by virtue of its roster\u0097which ranges from the technical virtuosity of Pat Martino to the traditional leanings of Larry Coryell and Bucky Pizzarelli and the more modernistic approaches of John Abercrombie and Dave Stryker.\n\nOriginally recorded for and released by the Japanese Paddlewheel Records in '94, this album is curiously only now seeing the light of day in North America. Why, after enjoying great acclaim in Japan and Europe, it has taken ten years to get released here is a mystery; but for fans of more down-the-centre jazz guitar, the album sounds as fresh as when it was first recorded.\n\nWith the exception of three originals from Campbell, the material all comes from familiar territory, although the arrangements are sometimes a little off the beaten path. \"Naima gets a light bossa treatment, with Martino as dark-toned and fleet-fingered as always. \"Love for Sale, patterned after an arrangement the more acerbic Coryell played with trumpeter Chet Baker, alternates between funky groove and relaxed swing. \"Softly, As in a Morning Sunrise is taken at a nice clip, with Stryker demonstrating, even at this early stage in his career, a remarkable ability to blend a post bop sensibility with sometimes subtle, other times more in-your-face blue shadings.\n\nThe most adventurous moves are with Abercrombie. On Campbell's aptly-titled \"Angular Blues things get almost raucous, with Abercrombie kicking on the overdrive and heading for more oblique places. \"Day Into Night, another Campbell original, is dark and mysterious, with a spacious ECM vibe.\n\nEveryone seems to be enjoying themselves. Campbell may not have the name recognition of his associates, but he clearly holds his own with them all, confidently trading fours here, assertively staking his own stylistic space there. An appealing mainstream player, Campbell's career has been most defined by a number of tribute albums to seminal guitarists including Wes Montgomery, Charlie Byrd and Joe Pass.\n\nBut while Campbell may not have what it takes to distinguish himself as a player of significance, he's certainly good enough to go head-to-head with his guests on Six By Six. An homage to jazz guitar done with energy and commitment, the long-overdue release of Six By Six in North America rights a longstanding wrong.\n\nVisit Royce Campbell and Independent Music Distribution on the web."}]}