{"After graduating, Royce Campbell moved to New York City and began performing with jazz musicians such as Joe Henderson, Bobby Hutcherson, and Kenny Barron.": [{"url": "https://jazzguitartoday.com/2022/11/exclusive-interview-with-guitarist-royce-campbell/", "page_content": "JGT contributor Joe Barth talks to guitarist Royce Campbell about his playing and his incredible career.\n\nRoyce Campbell was born in Indiana but grew up around the world because his stepfather was a career Navy man. As a guitarist, he toured with Motown singer Marvin Gaye and later played for over twenty years in Henry Mancini’s orchestra until the composer died in 1994. Royce Campbell\n\nJB: How old were you when you started to play jazz guitar and what was most helpful in your personal development as a guitarist?\n\nRC: I was around 16 when I started playing jazz. My uncle, Carroll DeCamp was most helpful in my development. He was an accomplished pianist/guitarist/arranger who played with Wes Montgomery’s group in the 1950s. I learned more from him than I could have from a music school. He also introduced me to a host of older players in the Indianapolis area who also contributed a lot to my development. I learned on the gigs with them rather than in classes. I got a lot of work as a pit orchestra player for musicals and had to develop my reading skills for those jobs. Even though these weren’t jazz gigs, I grew a lot as a player and as a professional.\n\nJB: What are three of the most influential jazz guitar albums and why?\n\nRC: The Incredible Jazz Guitar of Wes Montgomery was among the most influential albums for me because it was the first jazz LP I ever bought. It introduced me to jazz guitar. Pat Martino’s album The Visit was another one that was an early influence. It introduced me to Martino and was the first album I attempted to do some transcribing. The other is also a Wes album, Smokin’ at the Half Note. Since this album was live it presented Wes in a looser environment where he could really stretch out so I could hear Wes at his very best.\n\nJB: Practice and listening aside, can you pinpoint one or two ‘things’ that really boosted your profile and career toward where it’s at today?\n\nRC: Initially, it was my recordings with other guitarists that helped me build a profile in the first place since so many of them were famous. I recorded with Pat Martino, Larry Coryell, John Abercrombie, Bucky Pizzarelli, Tal Farlow, Jimmy Raney, Mundell Lowe, Cal Collins, Charlies, Byrd, Gene Bertoncini, Herb Ellis, John Pisano, and Dave Stryker. I am really grateful that I had the chance to be forever associated with them in this way.\n\nIn later periods of my career, the other ‘thing’ that contributed to my profile was the recordings I was able to do for small labels in Holland, Germany, Italy, and Japan. Those labels specialized in building catalogs of world-class recordings despite the fact that they did not have the resources of bigger labels, and they also gave me a chance to play with and be associated musically with some extraordinary musicians.\n\nJB: Talk about your musical experience with the great Henry Mancini.\n\nRC: My 19 years with Mancini have given me the fondest memories of my career. Not only did I play great music with Mancini, but he was really a great bandleader who was always kind, generous, and loyal to his musicians. I feel that playing his compositions all those years helped my development as a composer.\n\nJB: What was it like working with the Smithsonian Jazz Orchestra in the Washington DC- Northern Virginia area?\n\nRC: Years ago, I played in DC with the Smithsonian Jazz Masterworks Orchestra which is an awesome big band. It might just be one of the most under-appreciated collections of musicians anywhere. I had the honor and privilege to play with incredibly talented colleagues, real” jazz musicians’ musicians.”\n\nJB: What about your career today that you find rewarding?\n\nRC: Due to health issues I’m semi-retired now, but I do some gigs at retirement communities that are rewarding because the residents appreciate the music so much. I also still compose and work on recording projects, some my own and some as collaborations.\n\nJB: Talk about your composing.\n\nRC: Composing is incredibly rewarding. To create something from nothing is pretty special; there is an energy and beauty to the process that is an important counterpoint to some of the darker aspects of our world right now.\n\nI still love to do recording projects. The whole planning process, the actual sessions, and the post-production work are all exciting and energizing, and even though I am getting older, that process never does.\n\nIn a bigger sense, one of the most rewarding aspects of my recording career in particular is that those recordings still draw new, young audiences. It seems that younger generations don’t get hung up as much on specific genres of music or time periods and fashions; they are willing to engage with a broader variety of styles. I am always gratified when I hear from young fans—some fellow guitarists others just new fans—that they enjoyed listening to particular albums. It might be corny, but it makes the last 50+ years in the biz really worth it.\n\nJB: Tell us about the guitar and amp that you use.\n\nRC: I usually use a Benedetto Fratello guitar and an Acoustic Image amp. I do some gigs that include some funk; for that, I use a Gibson ES-335. I also still play a Gibson L5 from time to time. I love the difference in tone that I get from the Benedetto and the Gibson. One is bright and a little cool, and the other is darker and warmer; each offers different possibilities in terms of what I can create.\n\nJB: Tell me about one of your CD albums that best represents your playing.\n\nRC: It’s difficult to pick just one because I’ve done different styles from mainstream jazz to smooth jazz to free jazz. My personal favorite of the 33 CDs I’ve released is the Tribute to Henry Mancini CD. It was an inspiring moment when we recorded it. Mancini was definitely present, and we could all feel it. It made us all play at our best. I recently had a gig with my friend, bassist Bill Moring, and completely without prompting he said much the same thing. He also still remembers that session as musical magic.\n\nJB: How has your playing changed over the years?\n\nRC: I hope it’s gotten better. I feel that over the years my soloing has gotten more melodic. Because I have gotten older and various health conditions have posed challenges, I might not have the same technique I had as a younger player or the speed, but I think my sense of melodic storytelling has been sharpened over the years. Composing and improvising go hand in hand for me and are both ways to tell stories that listeners can relate to. I happen to be a romantic, and melodic lines tell the stories that I want to tell, so I have been working on that all my life, though it’s become even more important in recent years.\n\nSubscribe to Jazz Guitar Today – it’s FREE!"}, {"url": "https://www.radioswissjazz.ch/en/music-database/musician/23863981e9384cb3556b8909564e1e4c966d7f/biography", "page_content": "Royce Campbell\n\nFrom Wikipedia, the free encyclopedia.\n\nRoyce Campbell is a jazz guitarist.\n\nRoyce Campbell was born in Seymour, Indiana, in 1952. The son of a career navy man, Campbell grew up in various cities around the U.S. and abroad, including Asia, Europe, and the West Indies. Exposure to various musical genres while a child contributed to Campbell's musical style and approach in jazz composition and playing. A love for rock and roll marked Campbell's first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, Campbell was also influenced by Jimi Hendrix and Eric Clapton.[1]\n\nBy the time Royce finished high school in the early 1970s, he was certain he wanted to pursue a professional career in music. His uncle, Carroll DeCamp, an arranger/pianist who arranged for Stan Kenton and Les Elgart, invited Royce to live with him and study in Indiana, providing most of Royce's musical education in theory and composition, and by age 21, Campbell had begun touring with R&B artist Marvin Gaye and developing his talents for stage performance. In 1975, Royce was hired by a local music contractor to do three concerts with award-winning film composer Henry Mancini in Indianapolis. Soon after Royce became the touring guitarist with Henry Mancini's orchestra, holding that positing until Mancini's death in 1994.[2]\n\nWhile appearing on recordings as a sideman, and a couple as leader, during the early years of his career, Campbell started recording and touring more on his own during the 1990s, focusing at first on mainstream or straight-ahead jazz. Although he cites Wes Montgomery as his main influence, horn players such as Dexter Gordon and Chet Baker are evident in Royces, tone and approach to changes. In 1993, he produced Project G-5: A Tribute to Wes Montgomery which also featured guitarists Tal Farlow, Jimmy Raney, Herb Ellis and Cal Collins. His 1994 album 6x6 featured guitarists Pat Martino, John Abercrombie, Larry Coryell, Dave Stryker and Bucky Pizzarelli.With Project G-5: A Tribute to Joe Pass, in 1999, he combined the talents of Charlie Byrd, Gene Bertoncini, Mundell Lowe, and John Pisano.\n\nDuring his career Royce Campbell has released more than 30 CDs as leader or co-leader among various sideman projects. Fifteen of these CDs have made it onto the US national jazz radio charts. Campbell's soloing is documented among other jazz guitarists of the era, in Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! [3]\n\nIn November 2010, Royce Campbell was inducted into the Indianapolis Jazz Foundation Hall of Fame.\n\nDiscography\n\nHeadline Recordings\n\nYear Title Label 1983 Solo Guitar RedBud Records 1987 Around the Town Raised Eyebrow Records 1990 Nighttime Daydreams Timeless Records 1993 Elegy To A Friend Raised Eyebrow Records 1993 Vista Sin-Drome Records 1994 A Tribute To Wes Montgomery Evidence Music 1994 Vista - WTPI 10th Anniversary Jazz Sampler WTPI 1994 6x6 Paddle Wheel Records 1994 Gentle Breeze Timeless Records 1995 Make Me Rainbows Positive Music 1995 A Tribute to Henry Mancini Tuxedo Music Ltd 1998 Pitapat A-Records 1999 Hands Across The Water String Jazz Recordings 1999 A Tribute to Joe Pass King Record Co. 1999 Royce Campbell with Strings Chase Music 1999 Remembering Wes Savant Records 1999 Stella By Starlight. Jazz After Midnight. St. Clair Entertainment Group 2000 \"Prelude to a Kiss\" - Jazz Guitarists Who's Who: The Art of Solo Guitar King Record Co. 2002 Trioing Jardis Records 2003 A Tribute to Charlie Byrd Jardis Records 2006 Trio By Starlight Philology Jazz Records 2007 Get Happy Foxhaven Records 2008 Roses & Wine Philology Jazz Records 2009 All Standards...and A Blues Philology Jazz Records 2009 Movie Songs Project (with Phil Woods) Philology Jazz Records 2010 What is This Thing Called? Philology Jazz Records 2004 Six by Six: A Jazz Guitar Celebration Moon Cycle Records 2004 A Jazz Guitar Christmas Moon Cycle Records 2005 Plays for Lovers Moon Cycle Records 2006 Elegy To A Friend Moon Cycle Records 2006 Gypsy Soul Moon Cycle Records 2007 A Solo Guitar Christmas Moon Cycle Records 2008 The Art of Chord Solo Guitar Moon Cycle Records 2008 A Jazz Guitar Christmas: Volume 2 Moon Cycle Records 2009 Solo Wes: A Solo Guitar Tribute to Wes Montgomery Moon Cycle Records 2009 Solo Mancini: A Solo Guitar Tribute to Henry Mancini Moon Cycle Records 2010 Solo Trane: A Solo Guitar Tribute to John Coltrane Moon Cycle Records 2010 Triologue: Concepts Moon Cycle Records 2011 Jazz Blues Moon Cycle Records 2012 The Beginning Moon Cycle Records\n\nReferences\n\nHeidt, John. \"Royce Campbell.\" Vintage Guitar. July (2005): 26. Alexander, Charles. Masters of Jazz Guitar: The Story of the Players and Their Music. London, UK: Balafon Books, 1999, 185. Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! Pacific, MO: Mel Bay Publications, 2000.\n\nAdditional sources\n\nBenedetto, Robert. Making an Archtop Guitar . Anaheim Hills, CA: Centerstream Publishing, 1994. xiii.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1994. xiii. Cook, Richard, and Brian Morton. The Penguin Guide to Jazz, 9th Ed. New York, NY: The Penguin Group, 2008. 221, 1209.\n\nNew York, NY: The Penguin Group, 2008. 221, 1209. Esposito, Russell R. The Golden Milestone,4th Ed . New York, NY: The New York Learning Library, 2007. 320.\n\n. New York, NY: The New York Learning Library, 2007. 320. Ingram, Adrian. Mel Bay Concise History of the Electric Guitar . Pacific, MO: Mel Bay Publications, 2006. 106.\n\n. Pacific, MO: Mel Bay Publications, 2006. 106. Ingram, Adrian. The Gibson L5 . Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74. Larkin, Colin, ed. Encyclopedia of Popular Music, 4th Ed . USA: Oxford U P, 2006.\n\n. USA: Oxford U P, 2006. Leonard, Hal, Corp. All Music Guide to Jazz: The Definitive Guide to Jazz, 4th Ed . San Francisco, CA: Backstreet Publishing, 2002. 1063.\n\n. San Francisco, CA: Backstreet Publishing, 2002. 1063. Ellis, Andy. \"A Tribute to Wes Montgomery.\" Guitar Player 29.2 (Feb 1995): 146.\n\n29.2 (Feb 1995): 146. Resnicoff, Matt. \"Project G-5: A Tribute to Wes Montgomery.\" Guitar Player 29.6 (June 1995): 29-30.\n\n29.6 (June 1995): 29-30. Boyd, Herb. \"CD Reviews A Tribute to Henry Mancini.\" Down Beat 63.6 (June 1996): 45.\n\n63.6 (June 1996): 45. Ellis, Andy. \"Hands Across the Water.\" Guitar Player 32.12 (Dec 1998): 139.\n\n32.12 (Dec 1998): 139. Koransky, Jason. \"Project Shopping.\" Down Beat 66.6 (June 1999): 53.\n\n66.6 (June 1999): 53. Levy, Adam. \"Royce Campbell.\" Guitar Player 33.12 (Dec 1999): 41.\n\n33.12 (Dec 1999): 41. Smith, Will. \"Six By SixA Jazz Guitar Celebration.\" Down Beat 72.7 (July 2005): 76.\n\n72.7 (July 2005): 76. Ephland, John. \"Rudy Linka-Royce Campbell.\" Down Beat 74.3 (March 2007): 71.\n\n74.3 (March 2007): 71. Koert, Hans. \"The Five Guitars.\" IAJRC Journal 40.4 (Dec 2007): 71-72.\n\n40.4 (Dec 2007): 71-72. Ephland, John. \"Traveling Guitars.\" Down Beat 76.2 (Feb 2009): 71.\n\nThis page was last modified 31.10.2013 22:24:26\n\n\n\nThis article uses material from the article Royce Campbell from the free encyclopedia Wikipedia and it is licensed under the GNU Free Documentation License."}, {"url": "https://www.cnbc.com/2021/04/21/i-want-to-move-to-new-york-after-college-graduation-can-i-afford-it.html", "page_content": "Amanda Mier is graduating from UC Berkeley and ready to move to New York! The question is: Can she afford it? Amanda Mier | CNBC\n\nAfter three semesters of online school, I've been in denial, but it's time to face it. I graduate in a month. I wish I could be in college forever (who doesn't?), but it's time to get ready for adulthood. And, like most soon to be graduates, I have some big questions to answer. Like: 1. Where will I live? 2. How much will I need to live independently? 3. How will I pay for 1&2? 4. How on earth do I get a job? I set out to ask experts and friends who have successfully moved to a new city for advice.\n\nGetting started\n\nSince childhood, my dream was to get a job and move to New York. I sadly wasn't able to relocate for my internship at CNBC this past summer because of the pandemic but have focused a lot of my job search efforts in the area. I want to get a plan and do the math so I will be ready when I get my first job out of college. My job search is focused on digital media and communications, so I did some research. The median salary for a social media associate (an entry-level position) in New York City is $54,000 annually. Wow! After seven years of hourly wages, it's hard to wrap my head around a salary. But, before we get hung up on that first number, there's something to consider: income taxes. You need to shave off about 25-30% of your income to find out how much you really make. In New York state with a salary of $54,000, my after-tax income would be $43,000 for the year. Amanda's first budget, a four-part series for CNBC's College Voices:\n\n1. Budget: Here's what college students need to know about making a budget\n\n2. Spending: Three easy ways for college students to cut expenses\n\n3. Saving: Quick tips to help college students start saving money\n\n4. Adulting: I want to move to New York after college graduation. Can I afford it? Always know your numbers! Being an adult is expensive, especially in the big cities where I'm looking for work (like New York or San Francisco). Be proud of yourself for your grown-up job but remember that your budget is more important now than ever.\n\nWhere will I live?\n\nNow that I have my hypothetical job lined up, it's time to figure out some hypothetical housing. Some of the advice I got from New Yorkers was to choose the neighborhood that fits you and your budget best, not what's closest to work, but to try to find something close to public transportation. With that in mind, I decided that if I were lucky enough to get a job in New York, I would search for an apartment in Brooklyn, which is more affordable than living directly in Manhattan. But, with the rise of remote working, I could be based anywhere in the country! So, I also have the more financially realistic option of living in my hometown of Richmond, Virginia, and working remotely. I knew that it was significantly cheaper to live in Richmond than in Brooklyn, but I wondered just how much. To find out, I used NerdWallet's cost of living calculator to compare the two. You input your current area (in this case, Richmond), where you want to live (Brooklyn), and your pre-tax household income ($54,000). I knew it would be more expensive living in New York City but I didn't realize just how much: The tool told me that the cost of living is 170% higher in Brooklyn than in Richmond. That's nearly triple! And it's not just housing costs, although housing is 300% more expensive in Brooklyn. Transportation, food, entertainment, and health care were all more expensive in New York. To maintain the same quality of living that $54,000 buys in Richmond, I would need $146,000 in Brooklyn.\n\nA morning walk in Brooklyn's Clinton Hill neighborhood in spring. Hannah Goldstein | CNBC\n\nThis isn't unexpected, but it certainly is sobering. Doing more research, I found that there are definitely more affordable options for housing in Brooklyn, you just need to look for them ... and be willing to make some sacrifices. But that's the price of following your dreams! So, here's a quick look at the math: A one-bedroom in Brooklyn is out of the question.\n\nA two-bedroom in Brooklyn costs around $3,000 per month which, if I got a roommate, would be $1,500 per person and within my budget!\n\nA one-bedroom in Richmond costs $1,200 per month on average, and I could definitely find something more affordable depending on the location.\n\nAnd, of course, living with my parents is free. Living with your parents may not sound like the dreamy way you imagined kicking off your adult life, but it is a financially smart move. Whether you have a job or not, you can save a lot of money. That will be money you can use to fund your move when you do finally move out on your own – or invest it for your future. Of course, not everyone has the option of living at home but if you possibly can – for any length of time – experts highly recommend it. This is one of the most important times of your life to build savings and make smart financial moves. If I were to live at home, my primary expenses would be from food and transportation costs, and it would allow me to focus on saving for a year before a big move (New York, here I come!). But, let's say I do get a job in New York and I decide to just go for it and move to Brooklyn. The question is: Can I afford it?\n\nBudget breakdown\n\nI mapped out a hypothetical budget based on the annual post-tax salary of $43,000 per year. Here's what my budget breakdown would look like, based on 2019 averages for NY from smartasset.com: Monthly income: $3,500\n\nRent: $1,500/month\n\nAverage cost of utilities (phone, cable, gas/electric): $150/month\n\nAverage cost of groceries: $450/month\n\nSavings: $300/month\n\nWhat's left over for spending money: $1,000/month That ends up being $2,100 per month on necessities, $1,100 per month for discretionary expenses, and $300 per month on savings. To say that doesn't quite match up with the 50/30/20 rule is an understatement. According to the 50/30/20 rule, my budget should look like this: Necessities: $1,800/month\n\nWants: $1,100/month\n\nSavings: $700/month But, as a young professional going through a (hypothetical) major life transition, it's a start. The most important thing is to start saving something, get settled, and increase savings as soon as I can.\n\nWhere can I save money?\n\nBut before you decide to hop on the next flight to the big city of your choice, remember: Moving is expensive. There are a lot of moving costs that you might not think of when you're planning for The Future, but they can sure add up. Luckily, I know a few \"experts\" – friends who already made the cross-country move to New York. Here are a few tips they offered to help you keep your moving costs low: 1. Local groups. Join local Facebook groups a month before you move so you can find free/cheap furniture to have waiting for you when you get there. 2. Rent a moving truck. If you rent a U-Haul to move, make sure you keep it an extra day to go pick up any furniture you may need, especially if you're moving without a car. If you use professional movers or fly, look into renting a U-Haul van for like $20 a day to do a big day of errands: picking up furniture, a Costco haul, your first grocery shop. 3. Leave it! Be OK with leaving things behind, especially if you're moving into an apartment. You can always get used furniture and you'll definitely want new (thrifted!) clothing to fit in to your new city. 4. Sell it. You can always make some extra money by selling old things to underclassmen or posting in free or for-sale pages. When it comes to housing, finding an apartment in New York is notoriously competitive, stressful, and expensive. But the pandemic sent a lot of city folks fleeing to the suburbs and that meant deals on city apartments! New graduates like me could benefit from this easier pandemic rental market but this is New York, after all – those deals won't last for long. Especially as vaccinations increase and renters flock back to the city.\n\nwatch now\n\nMadeline Corbin, who moved cross-country from Seattle to New York during the pandemic, has a great tip for no matter what the market is like: It can be cheaper and easier to find a place if you answer ads from roommates looking to fill a spot, rather than looking for an apartment to move into with your best friend. There are more of those situations available and you save money: You're only on the hook for your security deposit – not a broker's fee, too. (Yes, that's a thing in New York!) \"If you're one person looking to live with roommates, there are a lot of options, and wading through them all to find one that's a good fit is the challenge,\" Corbin said. The bottom line – especially when you're in New York: Always figure out what the landscape is, ask people who've done it before – and look for ways that you can save money. And if you want to haggle, find advice for rent negotiations here.\n\nReady to move?"}, {"url": "https://www.allaboutjazz.com/musicians/royce-campbell", "page_content": "Royce has played guitar since age nine. By the time Royce finished high school, he was certain that he wanted to pursue a career in music, but he did not have the means to go to music school. Fortunately, his uncle Carroll DeCamp, a renowned arranger/pianist/guitarist, invited Royce to live with him and study.\n\nSoon Royce's reputation as a quality musician spread, and in 1973 he was asked to tour with vocalist Marvin Gaye. Two years later, Royce was hired by a local music contractor to do three concerts with Henry Mancini in Indianapolis. Mancini was so impressed by Royce's abilities that he asked him to become his regular touring guitarist, and Royce worked with Mancini for 19 years until Mancini's death in 1994.\n\nRoyce has been on the cover of the two main jazz guitar magazines String Jazz and Just Jazz Guitar. He has been featured in profiles in Jazz Times, Down Beat, Guitar Player Magazine, Vintage Guitar, 21st- Century Guitar, Japan's Swing Journal, and Germany's Akustik Gitarre.\n\nRoyce has toured in Europe seven times and toured Japan ten times as a soloist. Royce has also performed with many jazz greats such as Mel Torme, Sarah Vaughn, Ray Brown, Dave Brubeck, Joe Williams, Cleo Laine, Eddie Daniels, Eddie Harris, Frank Morgan and Mose Allison.\n\nCurrently, Royce resides in the Virginia/Washington D.C. area, and he continues to compose and produce recordings regularly.\n\n\n\n"}, {"url": "https://www.udiscovermusic.com/stories/best-jazz-musicians/", "page_content": "The best jazz musicians ever are among the most talented musicians ever. Period. Even though jazz has been around for well over a century, it’s still viewed by some people as the coolest, hippest music there is. That’s because in jazz, a musical language whose essence is spontaneous creation, anything can happen. What’s exciting is its unpredictability and because of that, jazz has never stood still and continues to evolve and grow, reflecting the lives and times of its myriad creators.\n\nAbove all else, though, jazz is about extreme musical virtuosity and being the best of the best. But with the genre having produced so many incredible talents over the years, it’s impossible to list them all. Instead, we’ve chosen a 40-strong selection of singers, horn players, pianists, guitarists, bassists, and drummers whom we consider to be among the best jazz musicians to have ever walked the earth.\n\nCheck out some of the greatest jazz albums on vinyl here.\n\nADVERTISEMENT\n\nElla Fitzgerald (1917-1996)\n\nBorn in Newport News, Virginia, Ella Fitzgerald earned the title “The First Lady Of Song” due to her peerless vocal abilities. Combining a soft, caressing tone with clear diction and a deep emotional sensitivity, she was also a pioneer of scatting, a vocal technique defined by wordless, horn-like improvisation. Though she rose to prominence in the big band swing era, debuting with the Chick Webb Orchestra in 1939, it was her themed songbook albums during the mid-to-late 1950s under the aegis of jazz impresario and producer Norman Granz that sealed her solo fame. At Granz’s Verve label – a company specifically set up to showcase the singer’s talents – Fitzgerald established herself as the premier jazz singer of her generation, and remains among the greatest jazz musicians ever.\n\nEssential Album: Sings The Cole Porter Songbook (1956)\n\nDuke Ellington (1899-1974)\n\nBetween 1927 and 1974, Washington DC-born Duke Ellington commanded one of the finest ensembles in jazz. A pianist by trade – he played in a unique staccato style – Ellington made his name performing at Harlem’s famous Cotton Club in the late 20s where his orchestra helped to usher in the big band swing movement. The most prolific jazz composer of all time, whose repertoire extended to symphonic and sacred pieces, Ellington brought respectability to jazz. He also stayed abreast of new trends, famously recording an album with rising saxophonist John Coltrane (1962’s Duke Ellington & John Coltrane) as well as collaborating with bassist Charles Mingus and drummer Max Roach the same year on the LP Money Jungle.\n\nEssential Album: Ellington At Newport (1956)\n\nLouis Armstrong (1901-1971)\n\nNicknamed “Satchmo” or “Pops,” New Orleans-born Louis Armstrong was one of jazz’s most significant founding fathers and played a profoundly influential role in exporting the music to other parts of the world. He was not only a brilliant trumpeter who could dazzle with his hard-swinging molten improvisations but also an expressive jazz singer who possessed a unique, gravel-textured voice. He helped to popularize jazz in the 1920s and enjoyed a long and fruitful career that saw notable collaborations with Duke Ellington, Ella Fitzgerald, Oscar Peterson and Bing Crosby. In 1968, in the twilight of his career, he scored a huge international pop hit with “What A Wonderful World.”\n\nEssential Album: Porgy & Bess (with Ella Fitzgerald) (1959)\n\nSummertime\n\nWatch this video on YouTube Click to load video\n\nMiles Davis (1926-1991)\n\nA trumpeter and bandleader from East St. Louis, Illinois, Miles Davis is arguably the most influential jazz musician of all time. Renowned for his ability to play ballads with a haunting, bittersweet lyricism, Miles’ career was characterized by a restless quest for innovation and musical change. He began his career in the mid-1940s playing bebop alongside Charlie Parker but ended it venturing into hip-hop with the album, Doo-Bop. In between he explored a variety of styles; everything from cool jazz and hard bop to modal jazz – which produced his iconic LP Kind Of Blue – free bop and electric jazz rock; the latter was epitomized by his influential 1970 album Bitches Brew, which ignited the fusion movement that dominated jazz in the early 70s.\n\nEssential Album: Kind Of Blue (1959)\n\nJohn Coltrane (1926-1967)\n\nBorn in North Carolina and raised in Philadelphia, John Coltrane was an influential and technically accomplished saxophonist that played the tenor and soprano varieties of the instrument and initially rose to fame in the Miles Davis Quintet in the mid-to-late 1950s. He eventually outgrew the trumpeter’s band and began forging a storied solo career that was distinguished by such classic and stylistically contrasting albums as Blue Train (1958), Giant Steps (1960) and My Favorite Things (1961). As the 60s progressed, Coltrane’s music became much more exploratory; the result of him seeking spiritual enlightenment through music.\n\nEssential Album: A Love Supreme (1965)\n\nCharles Mingus (1922-1979)\n\nAlongside his idol Duke Ellington and pianist Thelonious Monk, Arizona-born Charles Mingus is one of jazz’s best ever composers and musicians. A formidable bass player who attacked his instrument in a pugnacious yet virtuosic manner, Mingus championed collective improvisation in the various groups he led, using his compositions as a loose framework that enabled individual self-expression. Among his greatest tunes are the beautifully melancholy “Goodbye Porkpie Hat” and uproarious “Better Git It In Your Soul,” which both reflect Mingus’ deep blues and gospel influences.\n\nEssential Album: The Black Saint And The Sinner Lady (1963)\n\nRon Carter (Born 1937)\n\nOne of the great jazz session musicians of all time, no jazz bass player in history has made more appearances than Michigan-born Ron Carter, whose recording credits exceed 2,000. Admired for his rich, full-bodied tone, acute musical intelligence, and nimble-fingered virtuosity, Carter (who also plays the cello) recorded with Eric Dolphy and Milt Jackson in the early 60s before Miles Davis recruited him and helped make him a star in his “Second Great Quintet” between 1962 and 1968. After leaving Miles’ band, Carter became an omnipresent figure of the US session scene, appearing on records by artists as varied as Antonio Carlos Jobim, Paul Simon, and Roberta Flack.\n\nEssential Album: Where? (1962)\n\nStan Getz (1927-1991)\n\nThough born in Philadelphia, the tenor saxophonist Stan Getz, whose nickname was “The Sound,” became synonymous with west coast cool jazz that emerged in California during the 1950s. Famed for producing a gorgeously feathery tone that caressed the ear, Getz also played a major role in exposing the bossa nova sound to the wider US public, first with the LP Jazz Samba in 1962 and then, two years later when he collaborated with Brazilian maestro Joao Gilberto on the landmark album Getz/Gilberto, which featured the hit single “Girl From Ipanema” sung by Gilberto’s then wife, Astrud.\n\nEssential Album: Jazz Samba (with Charlie Byrd, 1962)\n\nSamba Triste\n\nWatch this video on YouTube Click to load video\n\nEric Dolphy (1928-1964)\n\nA talented multi-instrumentalist, Los Angeles-born Eric Dolphy was a bonafide musical triple-threat; a phenomenally talented master of the alto saxophone, bass clarinet and flute who combined technical dexterity with forward-thinking musical concepts. Starting out in drummer Chico Hamilton’s band in the late 50s, Dolphy became a leading light of the avant-garde movement in the early 1960s, recording as a sideman with Ornette Coleman, Charles Mingus, and John Coltrane while making envelope-pushing jazz records for Prestige label’s New Jazz imprint. Sadly, he died on tour in Berlin just a few months after recording his magnum opus, Out To Lunch!, a groundbreaking album that remains an enduring monument to Dolphy’s genius.\n\nEssential Album: Out To Lunch! (1964)\n\nCharles Lloyd (Born 1938)\n\nAn accomplished tenor saxophonist and jazz mystic who also blows a mean flute, Memphis-born Charles Lloyd started out as a sideman for blues legends Howlin’ Wolf and B. B. King before gravitating to jazz. He made his name in Los Angeles playing with drummer Chico Hamilton’s band and between 1966 and 1969, led a groundbreaking quartet that included a young pianist called Keith Jarrett and succeeded in wowing the west coast’s counterculture generation. After disappearing from view in the 70s, Lloyd revived his career from the late 80s onwards, producing a series of outstanding albums that established him as a leading tenor player whose deeply lyrical sound is infused with a spiritually-inclined otherworldliness.\n\nEssential Album: The Water Is Wide (2000)\n\nChet Baker (1929-1988)\n\nHailed as the poster boy of west coast cool jazz in the 1950s for his chiseled movie star looks, Oklahoma-born Chet Baker first made his mark playing trumpet in saxophonist Gerry Mulligan’s quartet before expanding his fanbase by singing on his records in a dreamy, androgynous croon. Though Baker’s languid vocals transformed him into a pop idol in the eyes of teenage girls, they were rarely to the critics’ liking, who preferred his horn playing with its gorgeously lyrical tone. Sadly, drug addiction and jail time regularly derailed Baker’s career but he managed to get it back on track in the 1980s.\n\nEssential Album: Chet Baker & Crew (1956)\n\nJelly Roll Morton (1890-1941)\n\nBorn Ferdinand LaMothe in New Orleans, Jelly Roll Morton was a nimble-fingered pianist and composer with a knack for creating infectious melodies. A larger-than-life character, he claimed to have invented jazz single-handedly in 1902; though his assertion was often disputed, there’s no doubt that he certainly played an important role in popularising the genre with his band the Red Hot Peppers. Starting out playing ragtime, Morton was one of jazz’s first notable composers/arrangers, serving up immortal compositions like “Black Bottom Stomp,” “Wolverine Blues,” and “King Porter Stomp,” which he recorded at his peak in the late 1920s.\n\nEssential Album: Complete Recorded Work, 1926-1930 (2000)\n\nBlack Bottom Stomp (1992 Remastered)\n\nWatch this video on YouTube Click to load video\n\nArt Tatum (1909-1956)\n\n“Tonight, God is in the house” is how fellow pianist Fats Waller purportedly referred to Art Tatum‘s presence in a club he was playing at. Waller’s deification of Tatum, a visually impaired pianist from Toledo, Ohio, expressed the awe that many jazz musicians felt when faced with Tatum’s exceptional talent. A virtuoso whose ornate style was characterized by florid right-hand runs, richly embroidered harmonic tapestries and addictive, swing rhythms, Tatum redefined the piano lexicon in 1930s and 40s. His influence on other musicians was huge, which included fellow pianist Oscar Peterson, who absorbed Tatum’s techniques into his own style.\n\nEssential Album: Piano Starts Here – Live At the Shrine (2008)\n\nBill Evans (1926-1980)\n\nNew Jersey-born Bill Evans brought a classical music-influenced sensibility to piano jazz, beginning in the late-1950s when he emerged as an exciting new talent whose jazz sound owed little to the musical vocabulary of his piano-playing predecessors. His penchant for lush, pastel-hued chords and impressionistic tone colors didn’t go unnoticed by Miles Davis, who recruited Evans for the recording session that yielded the classic 1959 album, Kind Of Blue. Evans’ preferred setting was the piano trio, which he developed over many years into a platform for three-way musical conversation, with every musician making an equal contribution.\n\nEssential Album: You Must Believe In Spring (1981)\n\nBud Powell (1924-1966)\n\nAlthough mental health troubles cut short the career of this dazzling New York-born jazz musician at the age of 41, Bud Powell etched the blueprint for modern jazz piano and his influence on others, particularly keyboard players, was a profound one. Beginning his recording career in the late 1940s, he was the first pianist to successfully adopt Charlie Parker’s bebop vocabulary and use it as the foundation for a virtuosic style that married darting, horn-like melodic lines with complex chords over charging swing rhythms. His genius for spontaneous musical creation prompted fellow pianist Erroll Garner to describe him as “the second greatest thing to Art Tatum.”\n\nEssential Album: The Amazing Bud Powell (1956)\n\nSonny Rollins (Born 1930)\n\nThough a modest man whose humility isn’t a comfortable fit with his grandiose nickname “Saxophone Colossus,” the Newark-born jazz musician Sonny Rollins has more than lived up to the title first bestowed upon him by producer Bob Weinstock as an album title in 1956. From his debut recording back in the late ‘40s right up to his final studio album, 2006’s Sonny Please, Rollins combined a rotund and soulful sound with melodic agility and a seemingly effortless gift for continuous thematic invention. One of jazz’s greatest ever improvisers, Rollins pioneered a piano-less trio in the late 50s with albums such as Way Out West, which allowed him greater melodic and harmonic freedom in his extemporizations.\n\nEssential Album: Saxophone Colossus (1957)\n\n\n\nWatch this video on YouTube Click to load video\n\nMax Roach (1924-2007)\n\nOriginally from North Carolina, Max Roach revolutionized jazz drumming in the bebop era by moving away from a rigid backbeat and preferring to create a more flowing and subtly shifting rhythmic pulse driven by the ride cymbal. That freed him up to use other parts of the drum set to create color, atmosphere, and drama. As well as being a master drummer, Roach was also a notable bandleader, helping to create hard bop in the early 50s with a quintet he co-led with the trumpeter Clifford Brown. He was also a vociferous Civil Rights activist who used his music to make socio-political statements, especially in the late 1950s and early 60s.\n\nEssential Album: We Insist! Max Roach’s Freedom Now Suite (1960)\n\nFreddie Hubbard (1938-2008)\n\n“You could whistle something and he would make a symphony out of it.” Those were the words of jazz producer Creed Taylor talking about Freddie Hubbard in 2008 and certainly, few jazz musicians could spontaneously compose and blow their horn with the technical brilliance of Indianapolis-born Hubbard, who could dazzle with his jaw-dropping virtuosity. Going to New York in 1958, he made some hard bop records for Blue Note while appearing on more outré recordings by Ornette Coleman, Eric Dolphy, and John Coltrane. In the 70s, Hubbard ventured into fusion before a lip injury put him out of action for some years, though in the early 2000s he made a triumphant return to straight-ahead jazz.\n\nEssential Album: Red Clay (1970)\n\nWayne Shorter (Born 1933)\n\nFrom Newark, New Jersey, Wayne Shorter is a jazz musician with a distinctively robust sound who served his apprenticeship in the ranks of Art Blakey’s ever-changing Jazz Messengers between 1959 and 1964, where he established himself as one of modern jazz’s leading composers. Poached from Blakey’s band by Miles Davis, Shorter became the main writer for the trumpeter’s 60s quintet while enjoying a parallel career as a solo artist at Blue Note Records that saw him release seminal LPs like Speak No Evil. Appearing on Davis’ landmark jazz-rock album Bitches Brew in 1970, Shorter co-founded the electric fusion group Weather Report before eventually going back to acoustic jazz in his twilight years. A prolific writer with a penchant for quirky melodies, Shorter is widely regarded as one of jazz’s finest composers in the post-bebop era.\n\nEssential Album: Speak No Evil (1966)\n\nSpeak No Evil (Remastered 1998 / Rudy Van Gelder Edition)\n\nWatch this video on YouTube Click to load video\n\nTony Williams (1945-1997)\n\nA wunderkind drum prodigy who joined the Miles Davis Quintet at seventeen, Chicago-born jazz musician Tony Williams was an adaptable sticks man whose repertoire ranged from avant-garde jazz to fusion and rock and roll. Equally adept at maintaining a disco-funk groove as an intricate polyrhythmic percussion symphony, he began his solo career by recording two exploratory acoustic jazz albums for Blue Note Records before becoming a jazz-rock pioneer with the group Tony Williams Lifetime, which featured organist Larry Young and guitarist John McLaughlin. Away from jazz, Williams played drums for Santana, Public Image Ltd and Yoko Ono in the 80s.\n\nEssential Album: The Joy Of Flying (1979)\n\nBenny Goodman (1909-1986)\n\nCrowned the “King of Swing,” Chicago’s Benny Goodman was a virtuoso clarinetist who led one of the most successful big bands in the swing era. He broke down barriers by not only being the first jazz performer to hold a concert at Carnegie Hall, then the hallowed haven of classical music, but also pioneered one of the first racially integrated groups. (His group featured the African American guitar pioneer, Charlie Christian). When the popularity of big band swing music faded fast after the end of World War II, Goodman wasn’t afraid to try his hand at bebop.\n\nEssential Album: The Famous 1938 Carnegie Hall Jazz Concert (1950/1999 reissue)\n\nDizzy Gillespie (1917-1993)\n\nSometimes perceived as a comic foil to fellow bebopper Charlie Parker’s searing intensity, Dizzy Gillespie‘s penchant for sprinkling humor in his music belied both the seriousness of the South Carolina trumpeter’s music and the enormity of his talent. Famous for the way his cheeks puffed out when blowing his horn, Gillespie played his instrument with a commanding intensity and also gave modern jazz one of its most iconic and much-covered tunes in the shape of “A Night In Tunisia.” As well as co-creating bebop with Parker, “Diz” was instrumental in birthing Latin jazz via his Afro-Cuban cross-pollinations in the late 1940s.\n\nEssential Album: Dizzy Gillespie At Newport (1957)\n\nThelonious Monk (1917-1982)\n\nFrom Rocky Mount in North Carolina, jazz musician Thelonious Monk is second-only to the great Duke Ellington in terms of the number of his compositions that have been recorded. Though he emerged when bebop was coming to the fore, Monk forged a unique stylistic path, combining angular but infectious melodic motifs with dissonant harmonies and throbbing swing rhythms. The uniquely personal style he created took a long time to be truly appreciated by the public at large but by the 1960s, he had made the front cover of Time magazine and was signed to a major record company. Monk composed many memorable songs that are now considered jazz standards; among them “Round Midnight,” “Blue Monk” and “Straight No Chaser.”\n\nEssential Album: Brilliant Corners (1956)\n\nNat King Cole (1919-1965)\n\nThough admired for his sonorous velour croon with its clear tone and subtle phrasing, Nat King Cole, who was born in Alabama and raised in Chicago, began his career in the 1930s as a jazz pianist influenced by Earl Hines. After he started singing in 1940, he scored three No. 1 R&B singles in a row with his influential combo, the King Cole Trio, including “Straighten Up And Fly Right.” In 1947 he claimed his first US solo No. 1 with “Nature Boy,” and by 1950, after he had dissolved his trio, his career blossomed as a solo artist, resulting in his domination of the pop charts until his death from lung cancer at the age of 45. Cole’s influence can be heard in contemporary jazz singers such as Michael Bublé and Gregory Porter, proving that his legacy as one of the greatest jazz musicians ever is secure.\n\nEssential Album: Unforgettable (1954)\n\nNature Boy\n\nWatch this video on YouTube Click to load video\n\nHerbie Hancock (Born 1940)\n\nA supremely versatile musician, Chicago keyboard wizard and polymath Herbie Hancock‘s long, odyssey-like career has seen him alight at many different musical stops along the way; from acoustic modal jazz (Maiden Voyage) through to spiritual meditations (Mwandishi), electric jazz-funk (Head Hunters) and sampladelic techno-funk (Future Shock). Hancock began his career as a sideman for trumpeter Donald Byrd in 1961 and then joined Miles Davis’ pathfinding quintet two years later while enjoying a remarkable parallel solo career at Blue Note Records. Never afraid to take risks and experiment, Hancock has always embraced state-of-the-art technology and strived to push jazz forward.\n\nEssential Album: Maiden Voyage (1965)\n\nCharlie Parker (1920-1955)\n\nFrom Kansas City, alto saxophonist Charlie “Bird” Parker blew up the New York jazz scene with the impact of an atomic bomb in the mid-1940s thanks to a revolutionary new, small group jazz style called bebop that hastened the extinction of big bands. Parker, together with his co-conspirator, trumpeter Dizzy Gillespie, created a fresh and radical musical language, defined by rapidly played melodic lines played over complex chord patterns and a driving swing pulse. Parker’s innovations had a profound impact on jazz musicians everywhere, transforming the idiom from functional dance music into a serious art form.\n\nEssential Album: Bird And Diz (1952)\n\nBillie Holiday (1915-1959)\n\nWith its bittersweet tone and somewhat forlorn timbre, the legendary and highly influential Billie Holiday undoubtedly possessed one of jazz’s most haunting female voices. Born Eleanora Fagan in Philadelphia and raised in Baltimore, Holiday found that singing offered her an escape from the tough upbringing she had endured. Her career as a jazz singer began when she was 18 after she had moved to New York and with her unique sound, where she phrased like a horn player, she quickly became a star. Her most famous singles were 1939’s “Strange Fruit,” a controversial song about a lynching, and the self-written “God Bless The Child,” which sold a million copies in 1941. She also released many successful albums, including Lady Sings The Blues and Lady In Satin, both issued in the 1950s.\n\nEssential Album: Billie Holiday Sings (1952)\n\nFrank Sinatra (1915-1998)\n\nFrank Sinatra had several nicknames – “The Chairman” and “Ol’ Blue Eyes” being two of them – but the one that spoke volumes about his talent as a jazz singer was the most telling one: “The Voice.” From Hoboken, New Jersey, Sinatra rose to fame in the big band era and first came on the radar of record buyers singing with the Harry James and Tommy Dorsey bands. Phrasing melodies like a jazz horn player, Sinatra cemented his fame as a solo artist at Capitol Records in the 1950s where his themed concept albums In The Wee Small Hours and Frank Sinatra Sings For Only The Lonely showed him to be a pop innovator.\n\nEssential Album: Come Fly With Me (1968)\n\nCome Fly With Me (2008 Remastered)\n\nWatch this video on YouTube Click to load video\n\nJimmy Smith (1925-2005)\n\nThere had been electric organists in jazz before Jimmy Smith – like Fats Waller and Wild Bill Davis – but, emerging in 1956, the Pennsylvania-born Hammond B3 virtuoso gave the instrument genuine credibility as a viable solo instrument in the genre. A showman who was mesmerizing on stage with his pyrotechnical blend of blues and gospel elements, Smith redefined the organ in a jazz context. A prolific recording artist, he enjoyed his most fruitful commercial spells at Blue Note in the 50s and Verve in the 60s, serving up classic soul-jazz albums like The Sermon! and The Cat.\n\nEssential Album: Home Cookin’ (1959)\n\nArt Blakey (1919-1990)\n\nAs a drummer, Pittsburgh-born Art Blakey was a polyrhythmic powerhouse whose turbulent, hard-swinging grooves functioned as the engine room that drove the legendary group The Jazz Messengers for 36 years. Blakey was a key architect of hard bop, a forceful offshoot of bebop heavily influenced by blues and gospel which found its purest expression in the music of The Jazz Messengers, an ever-changing ensemble that was dubbed the “Hard Bop Academy.” Among their greatest recorded triumphs are the albums The Freedom Rider and Buhaina’s Delight.\n\nEssential Album: Art Blakey & The Jazz Messengers (aka Moanin’, 1958)\n\nLee Morgan (1938-1972)\n\nA boy wonder jazz musician who made his debut album for Blue Note at 17, Philadelphia-born Lee Morgan first made his mark playing in fellow hornblower Dizzy Gillespie’s big band in the mid-50s before launching a spectacular solo career. Morgan, who also served with Art Blakey’s Jazz Messengers between 1958 and 1965, played his instrument in a virtuosic hard bop style and achieved his biggest commercial success in 1965 with the hit single and album The Sidewinder. His early death, at 32, from a gunshot wound, robbed the jazz world of one its brightest young talents.\n\nEssential Album: The Sidewinder (1965)\n\nWes Montgomery (1923-1968)\n\nFrom Indianapolis, John “Wes” Montgomery revolutionized jazz guitar playing in the late 1950s with a style that built on the foundations that an earlier innovator, Charlie Christian, had established in the 1940s. Using just his calloused thumb instead of a pick, self-taught Montgomery (who couldn’t read music) played melodic lines like a bebop horn player and also pioneered the uses of parallel octaves to emphasize a melodic line; a technique that has been borrowed by everyone from George Benson to Pat Metheny. Stylistically, his albums ranged from swinging hard bop (1965’s Smokin’ At The Half Note) to pop-tinged proto-smooth jazz (1968’s Road Song).\n\nEssential Album: So Much Guitar (1961)\n\nI Wish I Knew\n\nWatch this video on YouTube Click to load video\n\nCount Basie (1904-1984)\n\nRed Bank, New Jersey, was the birthplace of William “Count” Basie, a pianist noted for his percussive, minimalist style but who was also one of the greatest jazz bandleaders that ever lived. Like fellow jazz aristocrat Duke Ellington, his career took flight in the 1930s when he played a leading role in popularizing big band swing music with classic tunes like “One O’clock Jump.” Basie’s long-running band was incredibly tight and well-drilled; its blend of incendiary solos combined with gorgeously executed ensemble work over a propulsive rhythmic pulse came to epitomize swing music at its most arresting.\n\nEssential Album: The Atomic Mr. Basie (1957)\n\nKeith Jarrett (Born 1945)\n\nA child piano prodigy blessed with absolute pitch, Keith Jarrett came from Allentown, Pennsylvania, and was raised on classical music before gravitating to jazz as a teenager. After serving in Art Blakey’s Jazz Messengers and the influential bands of Charles Lloyd and Miles Davis in the 1960s, Jarrett established himself as a jazz superstar in the 70s with the million-selling improvised solo piano album, The Köln Concert. Though his name is synonymous with the piano, Jarrett is a talented multi-instrumentalist who also plays guitar, flute, and percussion.\n\nEssential Album: Sun Bear Concerts (1978)\n\nAlice Coltrane (1937-2007)\n\nBorn Alice McLeod in Detroit, this highly influential pianist, organist, and harp player was the second wife of saxophonist John Coltrane and played in his band after his quartet was dissolved in 1965. After her husband’s death in 1967, she began her own recording career, pursuing the spiritual path her spouse had embarked on by serving up comic meditations where post-bop jazz explorations collided with Indian music. Coltrane’s musical settings on her albums were varied, ranging from intimate small group jazz (A Monastic Trio) to grandiose orchestral works (World Galaxy).\n\nEssential Album: Journey In Satchidananda (1971)\n\nSarah Vaughan (1924-1990)\n\nNicknamed “Sassie,” this New Jersey jazz singer was noted for her supple contralto voice with its warm, honeyed tone and fluttery vibrato. After performing in the mid-40s band of singer Billy Eckstine (whose influential group was the crucible where bebop was first forged), she embarked on a solo career that blossomed in the 1950s. Her consummate vocal artistry can be heard on significant albums 50s like In The Land Of Hi-Fi and Swingin’ Easy, both of which demonstrated the singer’s peerless interpretive skills and her spectacular facility for improvising using a technique called scatting.\n\nEssential Album: Sarah Vaughan with Clifford Brown (1955)\n\nDave Brubeck (1920-2012)\n\nThough sometimes perceived as an early architect of California’s cool school movement, Concord-born Dave Brubeck was a jazz musician and composer who preferred to forge a unique and unclassifiable path in jazz that wasn’t dictated by a trend or scene. An innovator who experimented with different and often complex meters, Brubeck was also influenced by different music from around the world. He scored his biggest commercial successes in the late 1950s leading a legendary quartet that included alto saxophonist Paul Desmond.\n\nEssential Album: Time Out (1959)\n\nNina Simone (1933-2003)\n\nBorn Eunice Waymon in Tryon, North Carolina, Nina Simone aspired to be a concert pianist until her dream was shattered by the racism she encountered in the classical music world during the 1950s. Instead, she reinvented herself as a smoky-voiced jazz singer and pianist, whose eclectic repertoire drew on folk, blues, pop, and gospel music besides jazz. A sensitive interpreter of other people’s songs, Simone also wrote some classic tunes herself, including “My Baby Just Cares For Me,” “Four Women,” and “Mississippi Goddam.”\n\nEssential Album: Little Girl Blue (1959)\n\nCannonball Adderley (1928-1975)\n\nOne of the best alto saxophonists in jazz after the great Charlie Parker, Julian “Cannonball” Adderley was a Florida-born school teacher who became a professional musician after moving to New York in the mid-50s. Taking the Big Apple by storm with his mellifluous alto playing, he joined Miles Davis’ band – he played on the trumpeter’s classic 1959 Kind Of Blue album – but preferred to lead his own soul-jazz oriented bands and was extremely popular, especially with Black audiences, in the 1960s.\n\nEssential Album: Somethin’ Else (1958)\n\nMercy, Mercy, Mercy\n\nWatch this video on YouTube Click to load video\n\nOrnette Coleman (1930-2015)\n\nTexas-born Ornette Coleman, a saxophonist who later added trumpet and violin to his skill set, shook up the New York jazz scene in 1959 with his third album, the prophetically titled The Shape Of Jazz To Come. Essentially a free jazz manifesto, the album dispensed with orthodox concepts of melody, harmony, and structure, igniting a jazz revolution that ushered in the avant-garde age. Though a controversial figure, Coleman was also highly influential and his daring innovations still permeate jazz today.\n\nEssential Album: At The Golden Circle Volume 1 (1966)\n\nCheck out some of the greatest jazz albums on vinyl here."}, {"url": "https://www.biography.com/musicians/louis-armstrong-biography-facts", "page_content": "Jazz musician Louis Armstrong is remembered not only for his hundreds of recordings but as a lovable and humorous character who appeared in a wide swath of Hollywood films and TV shows. Many listeners identify him with the heartwarming ballad “What A Wonderful World” or the joyful “Hello Dolly.” But in the history of American and world music, he was much, more more.\n\nArmstrong had rough beginnings and was sent to an orphanage\n\nArmstrong was born in a poor area of New Orleans. His mother raised him as best she could after his father abandoned the family when Armstrong was a baby. As a youth, he often sang on the streets in a vocal group for pennies. He loved hearing the many brass bands that filled the city and got excited whenever a parade was nearby. Armstrong did odd jobs for a local Jewish family that loved him and bought him his first cornet when he was 10.\n\nOn New Year's Eve of 1912, Armstrong shot a pistol in the air in celebration. He was immediately arrested and, when the court decided that his mother could not raise him properly, was sent to a Waif’s Home for orphans. Life looked bleak for the youngster but music turned out to be his salvation.\n\nNew Orleans native Louis Armstrong moved to New York City in 1924, where he played the clubs and on Broadway, helping to spread the sound of jazz to a larger audience. Photo: Museum of the City of New York/Getty Images\n\nKing Oliver became his mentor\n\nThe disciplined atmosphere and the Waif’s Home inspired young Armstrong to work hard on mastering the cornet. When he was released two years later, he was considered a promising musician. Armstrong idolized cornetist Joe “King” Oliver, one of New Orleans’ top musicians who became a father figure for the teenager. When Oliver moved up North in 1918, he recommended that the youngster get his spot with trombonist Kid Ory's pacesetting band. Armstrong improved rapidly, learning to read music while playing on riverboats with Fate Marable’s group. In 1922 when Oliver decided to add a second cornetist to his Creole Jazz Band, which was based at the Lincoln Gardens in Chicago, he sent for his protégé.\n\nBy then, Louis Armstrong had a beautiful tone, wide range and exciting style on the cornet. Early New Orleans jazz was primarily an ensemble-oriented music. King Oliver’s Creole Jazz Band featured four horns playing nearly all of the time, with individual heroics being largely confined to brief two or four-bar breaks and very rare one-chorus solos. Because Oliver was the lead cornetist and took care of the melody, Armstrong was mostly featured playing harmonies in ensembles, adding to the power of the group while going out of his way not to outshine its leader. However it was soon apparent to the other musicians, including pianist Lil Harden (who would soon become Armstrong’s second of four wives), that he would not be the second cornetist to anyone for long.\n\nArmstrong changed the way jazz soloists were highlighted in the band\n\nIn 1924 Lil Armstrong persuaded her new husband to accept an offer to go to New York and join the Fletcher Henderson Orchestra. Henderson had the top Black band of the era although his orchestra, while possessing fine musicians and excellent sight-readers, had not yet learned how to swing. This is where Armstrong began to change the direction of jazz.\n\nAt the time, most jazz soloists only made brief statements, emphasizing staccato phrases, staying close to the melody and often punctuating their solos with double-time phrases that were repetitive and full of effects. At Armstrong’s first rehearsal with Henderson, the other musicians initially looked down on the newcomer because of his out-of-date clothes and rural manners. But their opinions changed as soon as Armstrong played his first notes. As a cornetist (he would switch permanently to trumpet in 1926), Armstrong’s utilized legato rather than staccato phrasing. He made every note count, used space dramatically, built up his solos to a climax and “told a story” in his playing. In addition, he put a blues feeling into every song, his expressive style was voice-like and tone was so beautiful that he helped to define the sound of the trumpet itself.\n\nIt was largely due to Armstrong's powerful playing that jazz changed into a music that put the focus on brilliant and adventurous soloists. During his year with Henderson, Armstrong became a major influence not only on other brass players but on musicians of all instruments. His swinging solos were emulated by others and, by the time he moved back to Chicago in late-1925, jazz had moved a decade ahead of where it was in 1923. Soon there were many trumpeters who sounded like relatives of Armstrong. It was not until the bebop era began twenty years later that jazz trumpeters, inspired by Dizzy Gillespie and Miles Davis, moved beyond Armstrong to look for other musical role models.\n\nHe popularized scat singing\n\nDuring 1925-28, Armstrong’s recordings with his small groups (the Hot Five, Hot Seven and his Savoy Ballroom Five), revolutionized jazz, containing some of his most brilliant trumpet playing. Those timeless sessions also introduced Armstrong as a singer. Before Armstrong, most vocalists who recorded were chosen due to their volume and ability to articulate lyrics clearly, singing in a very straight and square manner. In contrast, Armstrong’s gravelly tone was distinctive from the start and he phrased like one of his horn solos. \"Heebies Jeebies,\" from 1926, while not the very first recording of scat-singing (which utilizes nonsense syllables instead of words), greatly popularized scatting. The legend was that, after singing a chorus of the lyrics during the recording session, Armstrong dropped the music and had to make up sounds instead since he had not memorized the words, thereby inventing scat singing. It is a great story but the smoothness of Armstrong’s singing throughout the record (there is never a sense of panic) makes one think that the mishap happened on an earlier version of the song and it was decided to keep it in the routine. In any event, the first scat singing on record had already occurred 15 years earlier.\n\nIn addition to popularizing scatting, Armstrong’s relaxed phrasing in his singing, which like his trumpet playing made perfect use of space, was a revelation to other vocalists. He altered melody lines to give them catchier rhythms, and changed lyrics when it suited his voice and his conception of the song. Among those who became influenced by his phrasing while adapting it to their own musical personalities were Bing Crosby (who brought jazz phrasing into pop music), Billie Holiday, Cab Calloway and Ella Fitzgerald among countless others.\n\nArmstrong often stole the show with his electric performances\n\nWhile his small group recordings of 1925-28 made Armstrong a sensation among instrumentalists and singers, altering the course of jazz, it was in a third area that Armstrong became world famous. In 1929 he began recording regularly with a big band and was usually heard in that setting up until 1947. Rather than mostly performing jazz originals and New Orleans standards as earlier, Armstrong explored popular songs from the Great American Songbook, changing the compositions of Gershwin, Porter, Berlin, Rodgers and others into jazz through his interpretations.\n\nAs the dominant star of his performances and recordings, Armstrong was free to display his humorous personality much more. When it came to being an entertainer, Armstrong (who became universally known as “Satchmo”) was impossible to top. He could steal the show from anyone with his comedic abilities, lovable personality and musical brilliance. He became an international star, a household name who visited Europe a few times during the 1930s. When he broke up his big band in 1947, he formed a sextet called The Louis Armstrong All-Stars that made it possible economically for him to become a world traveler. His popularity grew steadily during his last 24 years and Armstrong became famous as jazz’s goodwill ambassador, even being nicknamed \"Ambassador Satch.\" His recordings sold very well and such hits as “Blueberry Hill,” “Mack The Knife” and 1964’s “Hello Dolly” kept him famous and busy.\n\nAs the most accessible of all jazz performers and a universally beloved figure, Armstrong introduced jazz to a countless number of listeners while symbolizing the music for millions. His importance to jazz, whether through his solos, singing or ability to win over listeners, cannot be measured. The history of jazz, American music and music in general would be much different if there had not been Armstrong."}, {"url": "https://www.britannica.com/place/New-York-City", "page_content": "The city site\n\nSections of the granite bedrock of New York date to about 100 million years ago, but the topography of the present city is largely the product of the glacial recession that marked the end of the Wisconsin Glacial Stage about 10,000 years ago. Great erratic boulders in Manhattan’s Central Park, deep kettle depressions in Brooklyn and Queens, and the glacial moraine that remains in parts of the metropolitan area provide silent testimony to the enormous power of the ice. Glacial retreat also carved out the waterways around the city. The Hudson and East rivers, Spuyten Duyvil Creek, and Arthur Kill are, in reality, estuaries of the Atlantic Ocean, and the Hudson is tidal as far north as Troy. The approximately 600 miles (1,000 km) of New York shoreline are locked in constant combat with the ocean, as it erodes the land and adds new sediments elsewhere. Although the harbour is constantly dredged, ship channels are continually filled with river silt and are too shallow for more modern deep-sea vessels.\n\nBritannica Quiz Anywhere USA\n\nSouth of the rockbound terrain of Manhattan stretches a sheltered deepwater anchorage offering easy access to the Atlantic Ocean. In 1524 the Italian navigator Giovanni da Verrazzano was the first European to enter the harbour, which he named Santa Margarita, and he reported that the hills surrounding the vast expanse of New York Bay appeared to be rich in minerals; more than 90 species of precious stone and 170 of the world’s minerals have actually been found in New York. Verrazzano’s daring expedition was commemorated in 1964, when what was then the world’s longest suspension bridge was dedicated to span the Narrows at the entrance to Upper New York Bay.\n\nWalk through Central Park and the Garment District and hop a ferry past the Statue of Liberty in New York City See all videos for this article\n\nOnly the third largest American port at the time of the American Revolution, New York gradually achieved trade domination and by the mid-1800s handled more than half of the country’s oceangoing travelers and commercial trade. After 1900 New York was the world’s busiest port, a distinction it held until the 1950s. Cargo containerization, the obsolescence of its waterfront piers, and soaring labour costs shifted business to the New Jersey side of the river after the 1960s, but at the beginning of the 21st century the Port Authority of New York and New Jersey still dominated the water trade of the northeastern United States."}, {"url": "https://www.allaboutjazz.com/musicians/bob-hamilton", "page_content": "Born and raised in the Newark, NJ area, Bob started playing piano and organ at the age of 8. Early on, family and friends noticed that he was gifted and encouraged him to pursue his music. Throughout middle school and high school, Bob played in numerous bands covering a variety of musical styles, but his interest was truly in jazz. His early influences included Count Basie Band and Oscar Peterson.\n\nPursuing music as his career, Bob then went on to major in music at Butler University in Indianapolis, IN. Bob's music teacher, Richard Osborne, introduced him to the Indianapolis music scene. He was a steady at the The Embers and performed with comedians and singers, such as Frankie Lane, Eloise Laws, and Slappy White. On the jazz front, he performed with Pookie Johnson, Russell Webster and Royce Campbell. He was even fortunate at a young age to sit in with Wes Montgomery, during this time.\n\nAfter several years, Bob moved back to New Jersey. Focusing on jazz, he performed in clubs around the NYC area, including the Village Corner, Surf Maid and Green Street. Vic Juris, Andy Fusco, Calvin Hill, Eddie Gladden and Bob Moses were among the musicians with whom he frequently performed. It was during this time and shortly after, Bob started doing record dates and recorded with some of the biggest R&B and disco artists of the 70's, including Gladys Knight, Donna Summer, Vanessa Williams, Fifth Dimension, The Tramps, and Samantha Sang. Over the last two decades, Bob has continued to stay true to his love of jazz. Living for a time in NYC and then San Diego, he's performed with many legendary and accomplished jazz musicians that have helped shape his playing style of today, including Joe Henderson, Harry \"Sweets\" Edison, Tal Farlow, Walt Weiskopf, Charlie Rouse, James Moody, Mundell Lowe, Frank Morgan, Tootie Heath, Lou Donaldson, Terry Gibbs, Buddy DeFanco, Lynn Seaton, Attila Zoller, Holly Hoffman, Bob Magnusson, Don Menza, Bob Devos, Jeff Brillinger and Ron McClure.\n\nBob currently lives in Westchester County, NY. For more information on Bob Hamilton, contact us at Good Stuff Productions - [email protected]\n\n\n\n"}, {"url": "https://www.nytimes.com/interactive/2018/obituaries/overlooked-marsha-p-johnson.html", "page_content": "Obituary writing is more about life than death: the last word, a testament to a human contribution.\n\nYet who gets remembered — and how — inherently involves judgment. To look back at the obituary archives can, therefore, be a stark lesson in how society valued various achievements and achievers.\n\nSince 1851, The New York Times has published thousands of obituaries: of heads of state, opera singers, the inventor of Stove Top stuffing and the namer of the Slinky. The vast majority chronicled the lives of men, mostly white ones.\n\nCharlotte Brontë wrote “Jane Eyre”; Emily Warren Roebling oversaw construction of the Brooklyn Bridge when her husband fell ill; Madhubala transfixed Bollywood; Ida B. Wells campaigned against lynching. Yet all of their deaths went unremarked in our pages, until now.\n\nBelow you’ll find obituaries for these and others who left indelible marks but were nonetheless overlooked. We’ll be adding to this collection each week, as Overlooked becomes a regular feature in the obituaries section, and expanding our lens beyond women.\n\nYou can use this form to nominate candidates for future “Overlooked” obits. Read an essay from our obituaries editor about how he approaches subjects and learn more about how the project came to be."}, {"url": "https://blogs.shu.edu/nyc-history/jazz-age-new-york/", "page_content": "The jazz age in New York is one of the most infamous times throughout the history of New York. From the booming music scene, to the changing social and sexual norms, New York became the hub for enjoying the newly emerging American culture. New York City is one of the entertainment capitals of the world, and much of that entertainment is from music. Music is not new to the city, and came to a peak during the jazz age. The jazz age was at its peak in the 1920s, when jazz was becoming more and more popular. Many of the most famous jazz musicians were African Americans such as Louis Armstrong and Duke Ellington. The jazz age was not only a pivotal time for music, but also for fashion, mass culture, prohibition, the automobile, and the lives of women. This time is also called “The Roaring Twenties,” since it was a time known for its opulence and over the top parties. New Yorkers travelled to Carnegie Hall to get their fix of jazz music at one of the many concerts put on there. People looking to party and drink illegal alcohol would visit speakeasies such as The Back Room, where the entrance to the bar was hidden behind a bookcase. The Cotton Club was another major jazz club, known for its “#1 Beer” and a memorable house band led by Duke Ellington. New York is full of landmarks that will transport visitors back to the Jazz Age with just one step inside.\n\nThe Jazz Age was an age marked by the uprising of jazz music, and the drastic change in American culture. Women called “flappers” were wearing shorter dresses and cutting their hair into bobs, dancing to the popular music in speakeasies and dance clubs. With prohibition in effect during this time period, alcohol had to be illegally made and served at places called speakeasies. One of the most popular speakeasies could be found at 102 Norfolk Ave, and was called The Back Room. While many speakeasies had fake fronts, this speakeasy had an actual business operating in conjunction with the speakeasy, Ratner’s Restaurant. This particular speakeasy was known for serving illegal alcohol and the criminals of the city as well. Many gangsters such as Meyer Lansky, Lucky Luciano and Bugsy Siegel used this space for “business meetings.”[1] The gangsters preferred this speakeasy due to its multiple exits onto different streets. If there was a hit going on, or a raid, it was very easy for the gangsters to make a quick getaway through one of the many entrances.[2] Today, the Back Room is accessed the same way it was during the 1920s. A secret staircase behind a bookshelf brings customers down to the speakeasy and transports them to the 1920s. With vintage décor and cocktails served in teacups, just like they were during prohibition to secretly drink, one trip to this hidden bar will make you feel like you are partying at the peak of the jazz age.\n\nAside from parties and illegal alcohol, the jazz age was known quite obviously for its music. Jazz was making its way into the limelight and became the music of the 1920s and 30s. Jazz music was not new in America, but was becoming more and more popular at this time than it had ever been before. In the article “If Jazz Isn’t Music, Why Isn’t It,” from the June 13th, 1926 edition of the New York Times, Paul Whiteman claims that “jazz came to America 300 years ago in chains.”[3] There is an undeniable truth that jazz is a major part of the African American culture and many of its roots lie within the slaves that came to America hundreds of years ago. As the years went on, jazz began to spread to mainstream American culture and gave African Americans the opportunity to be in the spotlight. Jazz music was mainly performed by African Americans during this age at the listening pleasure of wealthier white citizens. One place where this jazz music was heard was at the Cotton Club, one of the most famous jazz clubs in NYC during this era. It was located in Harlem and owned by the infamous gangster Owney Madden. This club was the go-to spot for illegal alcohol and entertainment from jazz musicians and dancers.[4] The acts that performed at the Cotton Club became world famous musicians, such as Duke Ellington. Duke Ellington led the Orchestra at the Cotton Club from 1927-1930, and sporadically after that for 8 years. Ellington and his orchestra gained national attention and praise through weekly radio broadcasts that were sometimes recorded and released on albums.[5]\n\nAlthough the jazz music was played mostly by African Americans, the clubs they were performing in were not so racially friendly to customers and other workers. The club was created with the idea to make “a stylish plantation environment for its entirely white clientele.”[6] The Cotton Club originally excluded all but white customers, although the majority of the performers and staff were African American. The dancers were held to a very strict standard and were required to be under 21 years old, light skinned, and at least 5’6” tall. The music here was instructed to be played to give a jungle like atmosphere to portray the African American employees as plantation residents or exotic savages. Although the majority of the population in the Cotton Club was African American and the music would not be possible without them, the club was extremely segregated and oppressive. Jazz music was bringing together the races, only to segregate them when they got together. Carnegie Hall was another music hall that was popular for jazz music during this period. It was home to hundreds of jazz concerts by famous artists such as Ella Fitzgerald, Miles Davis, Louis Armstrong and Duke Ellington. Early jazz was first heard here in 1912, becoming one of the first places in the city to go and listen to the newly emerging genre.[7] Carnegie Hall is still in use today and has withstood the test of time as a prestigious music venue.\n\nThe jazz age was also a time for new fashion, especially for women. The flapper style became very popular starting in the 1920s. Women began cutting their hair short into bobs, wearing shorter skirts that showed their legs, wearing more makeup, and high-heeled shoes. Being a flapper was not all about the clothes, but also their state of mind. In the April 16th, 1922 issue of the New York Times, a flapper “dresses simply and sensibly, and looks life right straight in the eye; she knows just what she wants and goes after it, whether it is a man, a career, a job, or a new hat.”[8] This new type of woman pushed the boundaries and challenged the sexual standards of the times. Women were no longer submissive to the men in their lives and were not afraid to have fun. Flappers would go to dance clubs and dance until the wee hours of the morning. They would spend their time with men drinking and socializing in speakeasies while listening to jazz. The changing times came with changing standards for women and gave them more freedom. If it wasn’t for the brave flappers who changed the rules, women would not be where they are today.\n\nOverall, the Jazz Age in New York City was a time of change and advancement. The music scene was changing with the emergence of jazz into popular culture. This music was played by African American musicians in places such as the Cotton Club and Carnegie Hall. While the African American musicians were in the spotlight, their business was not welcomed as patrons. These jazz clubs were segregated and only white clientele were welcome to see the show. Besides the jazz clubs, New Yorkers also passed their time by going to speakeasies to drink illegal alcohol. Prohibition was in place during this time period, so the only way to get alcohol was to go to a secret club. These secret clubs were also hot beds of mob activity. The mob was very active during the jazz era and gangsters used prohibition to their advantage. For example, famous gangster Owney Madden was the owner of the Cotton Club and used the club to sell his “#1 Beer.” The Back Room was also used by many gangsters such as Meyer Lansky, Lucky Luciano and Bugsy Siegel used this space for “business meetings.”[9] The gangsters preferred this speakeasy due to its multiple exits onto different streets. If there was a hit going on, or a raid, it was very easy for the gangsters to make a quick getaway through one of the many entrances. From flappers, to gangsters, to jazz musicians, the jazz age in New York City has a colorful history. A tour around New York City with visits to the Backroom, The Cotton Club, and Carnegie Hall, will instantly transport you back to the opulent 1920s and early 1930s.\n\n\n\nCarnegie Hall Carnegie Hall\n\nDuke Ellington Duke Ellington\n\nJazz Age Annotated Source List Caelynn Robinson Professor Fieldston History of NYC October 5th, 2016 Virtual Guidebook Assignment: Jazz Age New York My topic for the virtual guidebook assignment is the jazz age in New York City. New York City is one of the entertainment capitals of the world, and much of that entertainment is from music. Music is not new to the city, and ...\n\nJazz Age New York The jazz age in New York is one of the most infamous times throughout the history of New York. From the booming music scene, to the changing social and sexual norms, New York became the hub for enjoying the newly emerging American culture. New York City is one of the entertainment capitals of the world, ...\n\nThe Back Room NYC The Back Room NYC\n\n[1] “The Backroom Bar in New York City | National Trust for Historic Preservation.” The Backroom Bar in New York City | National Trust for Historic Preservation. 2014. Accessed October 05, 2016. https://savingplaces.org/stories/historic-bars-backroom-bar-new-york-city#.V_XJFOLMicE.\n\n[2] Savingplaces.org\n\n[3] “If Jazz Isn’t Music, Why Isn’t it?” 1926.New York Times (1923-Current File), Jun 13, 1. http://search.proquest.com.ezproxy.shu.edu/docview/103913320?accountid=13793.\n\n[4] Elmayan, Lara. “Vintage Photos: Inside the Cotton Club, One of NYC’s Leading Jazz Venues of the 1920s and ’30s.” Untapped Cities RSS. N.p., 05 Aug. 2013. Web. 05 Oct. 2016.\n\n[5] “The Black Past: Remembered and Reclaimed,” accessed December 14, 2016, http://www.blackpast.org/aah/cotton-club-harlem-1923.\n\n[6] Ibid\n\n[7] “Press Center,” carnegiehall.org, 2016, accessed December 10, 2016, https://www.carnegiehall.org/Press/People-and-History/.\n\n[8] By, MARGARET O. “More Ado about the Flapper.” New York Times (1857-1922), Apr 16, 1922. http://search.proquest.com.ezproxy.shu.edu/docview/98854065?accountid=13793.\n\n[9] “The Backroom Bar in New York City | National Trust for Historic Preservation.” The Backroom Bar in New York City | National Trust for Historic Preservation. 2014. Accessed October 05, 2016. https://savingplaces.org/stories/historic-bars-backroom-bar-new-york-city#.V_XJFOLMicE."}]}