{"Royce Campbell was born on October 28, 1954.": [{"url": "https://jazzguitartoday.com/2022/11/exclusive-interview-with-guitarist-royce-campbell/", "page_content": "JGT contributor Joe Barth talks to guitarist Royce Campbell about his playing and his incredible career.\n\nRoyce Campbell was born in Indiana but grew up around the world because his stepfather was a career Navy man. As a guitarist, he toured with Motown singer Marvin Gaye and later played for over twenty years in Henry Mancini’s orchestra until the composer died in 1994. Royce Campbell\n\nJB: How old were you when you started to play jazz guitar and what was most helpful in your personal development as a guitarist?\n\nRC: I was around 16 when I started playing jazz. My uncle, Carroll DeCamp was most helpful in my development. He was an accomplished pianist/guitarist/arranger who played with Wes Montgomery’s group in the 1950s. I learned more from him than I could have from a music school. He also introduced me to a host of older players in the Indianapolis area who also contributed a lot to my development. I learned on the gigs with them rather than in classes. I got a lot of work as a pit orchestra player for musicals and had to develop my reading skills for those jobs. Even though these weren’t jazz gigs, I grew a lot as a player and as a professional.\n\nJB: What are three of the most influential jazz guitar albums and why?\n\nRC: The Incredible Jazz Guitar of Wes Montgomery was among the most influential albums for me because it was the first jazz LP I ever bought. It introduced me to jazz guitar. Pat Martino’s album The Visit was another one that was an early influence. It introduced me to Martino and was the first album I attempted to do some transcribing. The other is also a Wes album, Smokin’ at the Half Note. Since this album was live it presented Wes in a looser environment where he could really stretch out so I could hear Wes at his very best.\n\nJB: Practice and listening aside, can you pinpoint one or two ‘things’ that really boosted your profile and career toward where it’s at today?\n\nRC: Initially, it was my recordings with other guitarists that helped me build a profile in the first place since so many of them were famous. I recorded with Pat Martino, Larry Coryell, John Abercrombie, Bucky Pizzarelli, Tal Farlow, Jimmy Raney, Mundell Lowe, Cal Collins, Charlies, Byrd, Gene Bertoncini, Herb Ellis, John Pisano, and Dave Stryker. I am really grateful that I had the chance to be forever associated with them in this way.\n\nIn later periods of my career, the other ‘thing’ that contributed to my profile was the recordings I was able to do for small labels in Holland, Germany, Italy, and Japan. Those labels specialized in building catalogs of world-class recordings despite the fact that they did not have the resources of bigger labels, and they also gave me a chance to play with and be associated musically with some extraordinary musicians.\n\nJB: Talk about your musical experience with the great Henry Mancini.\n\nRC: My 19 years with Mancini have given me the fondest memories of my career. Not only did I play great music with Mancini, but he was really a great bandleader who was always kind, generous, and loyal to his musicians. I feel that playing his compositions all those years helped my development as a composer.\n\nJB: What was it like working with the Smithsonian Jazz Orchestra in the Washington DC- Northern Virginia area?\n\nRC: Years ago, I played in DC with the Smithsonian Jazz Masterworks Orchestra which is an awesome big band. It might just be one of the most under-appreciated collections of musicians anywhere. I had the honor and privilege to play with incredibly talented colleagues, real” jazz musicians’ musicians.”\n\nJB: What about your career today that you find rewarding?\n\nRC: Due to health issues I’m semi-retired now, but I do some gigs at retirement communities that are rewarding because the residents appreciate the music so much. I also still compose and work on recording projects, some my own and some as collaborations.\n\nJB: Talk about your composing.\n\nRC: Composing is incredibly rewarding. To create something from nothing is pretty special; there is an energy and beauty to the process that is an important counterpoint to some of the darker aspects of our world right now.\n\nI still love to do recording projects. The whole planning process, the actual sessions, and the post-production work are all exciting and energizing, and even though I am getting older, that process never does.\n\nIn a bigger sense, one of the most rewarding aspects of my recording career in particular is that those recordings still draw new, young audiences. It seems that younger generations don’t get hung up as much on specific genres of music or time periods and fashions; they are willing to engage with a broader variety of styles. I am always gratified when I hear from young fans—some fellow guitarists others just new fans—that they enjoyed listening to particular albums. It might be corny, but it makes the last 50+ years in the biz really worth it.\n\nJB: Tell us about the guitar and amp that you use.\n\nRC: I usually use a Benedetto Fratello guitar and an Acoustic Image amp. I do some gigs that include some funk; for that, I use a Gibson ES-335. I also still play a Gibson L5 from time to time. I love the difference in tone that I get from the Benedetto and the Gibson. One is bright and a little cool, and the other is darker and warmer; each offers different possibilities in terms of what I can create.\n\nJB: Tell me about one of your CD albums that best represents your playing.\n\nRC: It’s difficult to pick just one because I’ve done different styles from mainstream jazz to smooth jazz to free jazz. My personal favorite of the 33 CDs I’ve released is the Tribute to Henry Mancini CD. It was an inspiring moment when we recorded it. Mancini was definitely present, and we could all feel it. It made us all play at our best. I recently had a gig with my friend, bassist Bill Moring, and completely without prompting he said much the same thing. He also still remembers that session as musical magic.\n\nJB: How has your playing changed over the years?\n\nRC: I hope it’s gotten better. I feel that over the years my soloing has gotten more melodic. Because I have gotten older and various health conditions have posed challenges, I might not have the same technique I had as a younger player or the speed, but I think my sense of melodic storytelling has been sharpened over the years. Composing and improvising go hand in hand for me and are both ways to tell stories that listeners can relate to. I happen to be a romantic, and melodic lines tell the stories that I want to tell, so I have been working on that all my life, though it’s become even more important in recent years.\n\nSubscribe to Jazz Guitar Today – it’s FREE!"}, {"url": "https://peoplepill.com/people/royce-campbell/", "page_content": "Royce Campbell (born June 7, 1952) is a jazz guitarist from Indiana who was a member of the Henry Mancini orchestra for twenty years.\n\nMusical career\n\nHe was born in North Vernon, Indiana. When he was five, his mother married a career Navy man, and Campbell grew up in cities throughout the U.S. and the world. Exposure to a variety of genres contributed to his musical style. A love for rock and roll marked his first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, he was influenced by Jimi Hendrix and Eric Clapton.\n\nBy the time he finished high school in Spain in the early 1970s, he had decided to pursue a career in music. His uncle, pianist Carroll DeCamp, who had done arrangements for Stan Kenton and Les Elgart, invited him to Indianapolis to live and study. His uncle provided his education in music theory and composition. At 21, he toured with rhythm and blues (R&B) singer Marvin Gaye before spending twenty years as a member of the Henry Mancini orchestra. He held the job until Mancini's death in 1994.\n\nDuring the 1990s, Campbell recorded more as a leader. In 1993, he produced Project G-5: A Tribute to Wes Montgomery which also featured guitarists Tal Farlow, Jimmy Raney, Herb Ellis, and fellow Hoosier Cal Collins. His 1994 album 6x6 featured guitarists Pat Martino, John Abercrombie, Larry Coryell, Dave Stryker, and Bucky Pizzarelli. On Project G-5: A Tribute to Joe Pass (1999) he combined the talents of Charlie Byrd, Gene Bertoncini, Mundell Lowe, and John Pisano.\n\nIn November 2010, Campbell was inducted into the Indianapolis Jazz Foundation Hall of Fame.\n\nDiscography\n\nYear Title Label 1990 Nighttime Daydreams Timeless 1991 Gentle Breeze [rel. 1994] Timeless 1992 Vista Raised Eyebrow; Sin-Drome (1993) 1993 Elegy to a Friend Raised Eyebrow; Moon Cycle (2006) 1993 A Tribute to Wes Montgomery by Project G-5 Paddlewheel/King [Japan]; Evidence 1994 6 x 6 (Six by Six: A Jazz Guitar Celebration) Paddlewheel/King [Japan]; Moon Cycle (2004) 1995 Make Me Rainbows Positive Music 1995 A Tribute to Henry Mancini Episode; String Jazz (1999) 1998 Pitapat A Records/Challenge 1998 Hands Across the Water (with Adrian Ingram) String Jazz 1999 A Tribute to Joe Pass by Project G-5 Paddlewheel/King [Japan] 1999 Royce Campbell with Strings Chase Music 1999 Remembering Wes (with Mel Rhyne) Savant 2002 Trioing Jardis 2003 A Tribute to Charlie Byrd (with Gene Bertoncini) Jardis 2003 A Jazz Guitar Christmas Moon Cycle 2005 Plays for Lovers (with Fred Hersch) Moon Cycle 2006 Gypsy Soul Moon Cycle 2007 Get Happy Foxhaven 2007 A Solo Guitar Christmas Moon Cycle 2008 The Art of Chord Solo Guitar Moon Cycle 2008 A Jazz Guitar Christmas, Volume II Moon Cycle 2008 Trio By Starlight Philology 2008 Roses & Wine Philology 2009 Solo Wes: A Solo Guitar Tribute to Wes Montgomery Moon Cycle 2009 Solo Mancini: A Solo Guitar Tribute to Henry Mancini Moon Cycle 2009 All Standards...and a Blues Philology 2009 Movie Songs Project (with Phil Woods) Philology 2010 Concepts Moon Cycle 2010 What is This Thing Called Philology 2010 Solo Trane: A Solo Guitar Tribute to John Coltrane Moon Cycle 2011 Jazz Blues (compilation) Moon Cycle 2012 All Ballads...and a Bossa Moon Cycle 2012 The Beginning Moon Cycle 2015 Romancing the Tone Moon Cycle 2017 Tea for Three (with Hod O'Brien) Moon Cycle 2018 Duo (with Bob Bowen) Moon Cycle 2019 Organ Trio Moon Cycle\n\nAdditional sources\n\nBenedetto, Robert. Making an Archtop Guitar . Anaheim Hills, CA: Centerstream Publishing, 1994. xiii.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1994. xiii. Boyd, Herb. \"CD Reviews: A Tribute to Henry Mancini\". Down Beat 63.6 (June 1996): 45.\n\n63.6 (June 1996): 45. Cook, Richard, and Brian Morton. The Penguin Guide to Jazz . 9th ed. New York, NY: The Penguin Group, 2008. 221, 1209.\n\n. 9th ed. New York, NY: The Penguin Group, 2008. 221, 1209. Ellis, Andy. \"A Tribute to Wes Montgomery\". Guitar Player 29.2 (Feb 1995): 146.\n\n29.2 (Feb 1995): 146. Ellis, Andy. \"Hands Across the Water\". Guitar Player 32.12 (Dec 1998): 139.\n\n32.12 (Dec 1998): 139. Ephland, John. \"Rudy Linka-Royce Campbell\". Down Beat 74.3 (March 2007): 71.\n\n74.3 (March 2007): 71. Ephland, John. \"Traveling Guitars\". Down Beat 76.2 (Feb 2009): 71.\n\n76.2 (Feb 2009): 71. Erlewine, Stephen Thomas, ed. All Music Guide to Jazz: The Definitive Guide to Jazz . 4th ed. San Francisco, CA: Backstreet Publishing, 2002. 1063.\n\n. 4th ed. San Francisco, CA: Backstreet Publishing, 2002. 1063. Esposito, Russell R. The Golden Milestone . 4th ed. New York, NY: The New York Learning Library, 2007. 320.\n\n. 4th ed. New York, NY: The New York Learning Library, 2007. 320. Ingram, Adrian. Mel Bay Concise History of the Electric Guitar . Pacific, MO: Mel Bay Publications, 2006. 106.\n\n. Pacific, MO: Mel Bay Publications, 2006. 106. Ingram, Adrian. The Gibson L5 . Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74. Koert, Hans. \"The Five Guitars\". IAJRC Journal 40.4 (Dec 2007): 71–72.\n\n40.4 (Dec 2007): 71–72. Koransky, Jason. \"Project Shopping\". Down Beat 66.6 (June 1999): 53.\n\n66.6 (June 1999): 53. Larkin, Colin, ed. Encyclopedia of Popular Music . 4th ed. US: Oxford University Press, 2006.\n\n. 4th ed. US: Oxford University Press, 2006. Levy, Adam. \"Royce Campbell\". Guitar Player 33.12 (Dec 1999): 41.\n\n33.12 (Dec 1999): 41. Resnicoff, Matt. \"Project G-5: A Tribute to Wes Montgomery\". Guitar Player 29.6 (June 1995): 29–30.\n\n29.6 (June 1995): 29–30. Smith, Will. \"Six by Six: A Jazz Guitar Celebration\". Down Beat 72.7 (July 2005): 76.\n\nReferences"}, {"url": "https://www.radioswissjazz.ch/en/music-database/musician/23863981e9384cb3556b8909564e1e4c966d7f/biography", "page_content": "Royce Campbell\n\nFrom Wikipedia, the free encyclopedia.\n\nRoyce Campbell is a jazz guitarist.\n\nRoyce Campbell was born in Seymour, Indiana, in 1952. The son of a career navy man, Campbell grew up in various cities around the U.S. and abroad, including Asia, Europe, and the West Indies. Exposure to various musical genres while a child contributed to Campbell's musical style and approach in jazz composition and playing. A love for rock and roll marked Campbell's first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, Campbell was also influenced by Jimi Hendrix and Eric Clapton.[1]\n\nBy the time Royce finished high school in the early 1970s, he was certain he wanted to pursue a professional career in music. His uncle, Carroll DeCamp, an arranger/pianist who arranged for Stan Kenton and Les Elgart, invited Royce to live with him and study in Indiana, providing most of Royce's musical education in theory and composition, and by age 21, Campbell had begun touring with R&B artist Marvin Gaye and developing his talents for stage performance. In 1975, Royce was hired by a local music contractor to do three concerts with award-winning film composer Henry Mancini in Indianapolis. Soon after Royce became the touring guitarist with Henry Mancini's orchestra, holding that positing until Mancini's death in 1994.[2]\n\nWhile appearing on recordings as a sideman, and a couple as leader, during the early years of his career, Campbell started recording and touring more on his own during the 1990s, focusing at first on mainstream or straight-ahead jazz. Although he cites Wes Montgomery as his main influence, horn players such as Dexter Gordon and Chet Baker are evident in Royces, tone and approach to changes. In 1993, he produced Project G-5: A Tribute to Wes Montgomery which also featured guitarists Tal Farlow, Jimmy Raney, Herb Ellis and Cal Collins. His 1994 album 6x6 featured guitarists Pat Martino, John Abercrombie, Larry Coryell, Dave Stryker and Bucky Pizzarelli.With Project G-5: A Tribute to Joe Pass, in 1999, he combined the talents of Charlie Byrd, Gene Bertoncini, Mundell Lowe, and John Pisano.\n\nDuring his career Royce Campbell has released more than 30 CDs as leader or co-leader among various sideman projects. Fifteen of these CDs have made it onto the US national jazz radio charts. Campbell's soloing is documented among other jazz guitarists of the era, in Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! [3]\n\nIn November 2010, Royce Campbell was inducted into the Indianapolis Jazz Foundation Hall of Fame.\n\nDiscography\n\nHeadline Recordings\n\nYear Title Label 1983 Solo Guitar RedBud Records 1987 Around the Town Raised Eyebrow Records 1990 Nighttime Daydreams Timeless Records 1993 Elegy To A Friend Raised Eyebrow Records 1993 Vista Sin-Drome Records 1994 A Tribute To Wes Montgomery Evidence Music 1994 Vista - WTPI 10th Anniversary Jazz Sampler WTPI 1994 6x6 Paddle Wheel Records 1994 Gentle Breeze Timeless Records 1995 Make Me Rainbows Positive Music 1995 A Tribute to Henry Mancini Tuxedo Music Ltd 1998 Pitapat A-Records 1999 Hands Across The Water String Jazz Recordings 1999 A Tribute to Joe Pass King Record Co. 1999 Royce Campbell with Strings Chase Music 1999 Remembering Wes Savant Records 1999 Stella By Starlight. Jazz After Midnight. St. Clair Entertainment Group 2000 \"Prelude to a Kiss\" - Jazz Guitarists Who's Who: The Art of Solo Guitar King Record Co. 2002 Trioing Jardis Records 2003 A Tribute to Charlie Byrd Jardis Records 2006 Trio By Starlight Philology Jazz Records 2007 Get Happy Foxhaven Records 2008 Roses & Wine Philology Jazz Records 2009 All Standards...and A Blues Philology Jazz Records 2009 Movie Songs Project (with Phil Woods) Philology Jazz Records 2010 What is This Thing Called? Philology Jazz Records 2004 Six by Six: A Jazz Guitar Celebration Moon Cycle Records 2004 A Jazz Guitar Christmas Moon Cycle Records 2005 Plays for Lovers Moon Cycle Records 2006 Elegy To A Friend Moon Cycle Records 2006 Gypsy Soul Moon Cycle Records 2007 A Solo Guitar Christmas Moon Cycle Records 2008 The Art of Chord Solo Guitar Moon Cycle Records 2008 A Jazz Guitar Christmas: Volume 2 Moon Cycle Records 2009 Solo Wes: A Solo Guitar Tribute to Wes Montgomery Moon Cycle Records 2009 Solo Mancini: A Solo Guitar Tribute to Henry Mancini Moon Cycle Records 2010 Solo Trane: A Solo Guitar Tribute to John Coltrane Moon Cycle Records 2010 Triologue: Concepts Moon Cycle Records 2011 Jazz Blues Moon Cycle Records 2012 The Beginning Moon Cycle Records\n\nReferences\n\nHeidt, John. \"Royce Campbell.\" Vintage Guitar. July (2005): 26. Alexander, Charles. Masters of Jazz Guitar: The Story of the Players and Their Music. London, UK: Balafon Books, 1999, 185. Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! Pacific, MO: Mel Bay Publications, 2000.\n\nAdditional sources\n\nBenedetto, Robert. Making an Archtop Guitar . Anaheim Hills, CA: Centerstream Publishing, 1994. xiii.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1994. xiii. Cook, Richard, and Brian Morton. The Penguin Guide to Jazz, 9th Ed. New York, NY: The Penguin Group, 2008. 221, 1209.\n\nNew York, NY: The Penguin Group, 2008. 221, 1209. Esposito, Russell R. The Golden Milestone,4th Ed . New York, NY: The New York Learning Library, 2007. 320.\n\n. New York, NY: The New York Learning Library, 2007. 320. Ingram, Adrian. Mel Bay Concise History of the Electric Guitar . Pacific, MO: Mel Bay Publications, 2006. 106.\n\n. Pacific, MO: Mel Bay Publications, 2006. 106. Ingram, Adrian. The Gibson L5 . Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74. Larkin, Colin, ed. Encyclopedia of Popular Music, 4th Ed . USA: Oxford U P, 2006.\n\n. USA: Oxford U P, 2006. Leonard, Hal, Corp. All Music Guide to Jazz: The Definitive Guide to Jazz, 4th Ed . San Francisco, CA: Backstreet Publishing, 2002. 1063.\n\n. San Francisco, CA: Backstreet Publishing, 2002. 1063. Ellis, Andy. \"A Tribute to Wes Montgomery.\" Guitar Player 29.2 (Feb 1995): 146.\n\n29.2 (Feb 1995): 146. Resnicoff, Matt. \"Project G-5: A Tribute to Wes Montgomery.\" Guitar Player 29.6 (June 1995): 29-30.\n\n29.6 (June 1995): 29-30. Boyd, Herb. \"CD Reviews A Tribute to Henry Mancini.\" Down Beat 63.6 (June 1996): 45.\n\n63.6 (June 1996): 45. Ellis, Andy. \"Hands Across the Water.\" Guitar Player 32.12 (Dec 1998): 139.\n\n32.12 (Dec 1998): 139. Koransky, Jason. \"Project Shopping.\" Down Beat 66.6 (June 1999): 53.\n\n66.6 (June 1999): 53. Levy, Adam. \"Royce Campbell.\" Guitar Player 33.12 (Dec 1999): 41.\n\n33.12 (Dec 1999): 41. Smith, Will. \"Six By SixA Jazz Guitar Celebration.\" Down Beat 72.7 (July 2005): 76.\n\n72.7 (July 2005): 76. Ephland, John. \"Rudy Linka-Royce Campbell.\" Down Beat 74.3 (March 2007): 71.\n\n74.3 (March 2007): 71. Koert, Hans. \"The Five Guitars.\" IAJRC Journal 40.4 (Dec 2007): 71-72.\n\n40.4 (Dec 2007): 71-72. Ephland, John. \"Traveling Guitars.\" Down Beat 76.2 (Feb 2009): 71.\n\nThis page was last modified 31.10.2013 22:24:26\n\n\n\nThis article uses material from the article Royce Campbell from the free encyclopedia Wikipedia and it is licensed under the GNU Free Documentation License."}, {"url": "https://www.guitarsite.com/newsletters/040927/4.shtml", "page_content": "Contact | Contents | Privacy Policy | Forum\n\nCopyright © 1999 - 2023 , All Rights Reserved.\n\nAffiliate Notice: As an Amazon Associate we earn from qualifying purchases."}, {"url": "https://www.everything-birthday.com/date/october-28-1954", "page_content": "What generation am I in if I was born on October 28th 1954?\n\nYou are part of the Baby Boomer Generation\n\nLike to see more about Generations? Click here to go to our interactive generations table.\n\nZodiac - Scorpio: Symbol: Scorpio Traits: Fierce\n\nIntense\n\nAmbitious\n\nLoyal Scorpio Summary: Scorpios question everything, and work hard to understand all things. Are very intense, loyal and kind Start Date: 10-23 End Date: 11-21\n\nClick here to see more about Scorpio\n\nOctober 28th, on this day in History: 1954-10-28: This day in History: 1492-10-28 Columbus discovers Cuba 1636-10-28 Harvard College 1st US college founded. 1776-10-28 Battle of White Plains; Washington retreats to NJ 1790-10-28 NY gives up claims to Vermont in exchange for $30 000. 1793-10-28 Eli Whitney applies for patent for the cotton gin. 1886-10-28 Pres Grover Cleveland dedicates the Statue of Liberty. 1904-10-28 St Louis Police try a new investigation method - fingerprints 1918-10-28 Czechoslovakia declares independence from Austria. 1919-10-28 Volstead Act passed by Congress starting Prohibition 1922-10-28 Benito Mussolini takes control of Italy's government. 1922-10-28 1st coast-to-coast radio broadcast of a football game. 1929-10-28 1st child born in aircraft Miami Fl 1946-10-28 German rocket engineers begin work in USSR 1948-10-28 Flag of Israel is adopted 1953-10-28 Bud Grant of the Winnipeg Blue Bombers intercepts 5 passes (record). 1962-10-28 Krushchev orders withdrawal of Cuban missiles 1965-10-28 Pope Paul VI proclaims Jews not collectively guilty for crucifixion. 1965-10-28 Gateway Arch (190 meters high) completed in St. Louis Missouri. 1965-10-28 The Gateway Arch (630 feet high) completed in St Louis Missouri 1970-10-28 US/USSR signed an agreement to discuss joint space efforts 1971-10-28 England becomes 6th nation to have a satellite (Prospero) in orbit. 1973-10-28 Elmore Smith of the Lakers blocks 17 shots in a game (NBA record). 1974-10-28 1st time 2 Islanders hat trick in same game - MacMillian & Westfall 1976-10-28 Billy Martin named A.L. Manager of the Year (NY Yankees) 1977-10-28 TV's Rhoda gets married 1979-10-28 Dick Howser (Best Yank mngr win-lost pct 636) replaces Billy Martin\n\n10-28-1954 in\n\nRoman Numerals:\n\nX • XXVIII • MCMLIV\n\nWhat is 1954-10-28 converted to roman numerals? Above is the date 10-28-1954 converted into roman numerals.\n\nThe above date is written in the traditional western/American style of writing dates. Formatted in the order of\n\nMonth-Day-Year. If you prefer the European way of writing dates (Which is day-month-year) the roman numerals would be written XXVIII • X • MCMLIV.\n\nNext Birthday Countdown: Countdown timer for Oct 28, 2023:\n\nClick to see age and birthday countdown timer Days Hours Minutes Seconds\n\nThe above timer is a countdown clock for your next birthday! (Assuming you were born on 1954-10-28) This timer is automatically updated, and is accurate all the way up to the nearest second. Watch as your next birthday ticks closer and closer right before your eyes. If you were born on october-28-1954, your next birthday is only 158 days away.\n\nYour birthday is on October twenty-eighth, 1954. Being born in late-October says a lot about you. Your zodiac sign is scorpio, your birth-stone is the Opal, and your birth flower is the Marigold (both of which make great gifts for someone with this birthday). You are 68 years old, and were born in the middle of the Baby Boomer Generation . Which generation you are born into makes a huge impact on your life, click here to see our interactive table and learn more. You have been alive for 25044 days, or 601056 hours, or 36063360 minutes! Your next birthday which is in 2023, is on a Saturday. Birthstone: Opal (great gift idea, see Opal article) Birthflower: Marigold Zodiac Sign: Scorpio"}, {"url": "https://www.allaboutjazz.com/musicians/royce-campbell", "page_content": "Royce has played guitar since age nine. By the time Royce finished high school, he was certain that he wanted to pursue a career in music, but he did not have the means to go to music school. Fortunately, his uncle Carroll DeCamp, a renowned arranger/pianist/guitarist, invited Royce to live with him and study.\n\nSoon Royce's reputation as a quality musician spread, and in 1973 he was asked to tour with vocalist Marvin Gaye. Two years later, Royce was hired by a local music contractor to do three concerts with Henry Mancini in Indianapolis. Mancini was so impressed by Royce's abilities that he asked him to become his regular touring guitarist, and Royce worked with Mancini for 19 years until Mancini's death in 1994.\n\nRoyce has been on the cover of the two main jazz guitar magazines String Jazz and Just Jazz Guitar. He has been featured in profiles in Jazz Times, Down Beat, Guitar Player Magazine, Vintage Guitar, 21st- Century Guitar, Japan's Swing Journal, and Germany's Akustik Gitarre.\n\nRoyce has toured in Europe seven times and toured Japan ten times as a soloist. Royce has also performed with many jazz greats such as Mel Torme, Sarah Vaughn, Ray Brown, Dave Brubeck, Joe Williams, Cleo Laine, Eddie Daniels, Eddie Harris, Frank Morgan and Mose Allison.\n\nCurrently, Royce resides in the Virginia/Washington D.C. area, and he continues to compose and produce recordings regularly.\n\n\n\n"}, {"url": "https://www.birthdayanswers.com/date/october-28-1954/", "page_content": "It was the 4th Thursday of 1954. If you were born on this date your birthday numbers 10, 28 and 1954 reveal that your life path number is 3. Your zodiac sign is Scorpio with a ruling planet Pluto, your birthstone is the Opal and Tourmaline, and your birth flower is the Marigold. You are 68 old, and were born in 1950s, in the middle of Baby Boomers Generation. The generation you are born into makes an impact on your life. Swipe up to find out what it all means.\n\n→ October 28, 1954 was a Thursday\n\n→ Zodiac sign for this date is Scorpio\n\n→ This date was 25,061 days ago\n\n→ 1954 was the Year of the Horse\n\n→ In 2023, October 28 is on Monday\n\nView snazzy October 28, 1954 birthday facts that no one tells you about, such as your life path number, birthstone, ruling planet, zodiac sign and birth flower.\n\nYou have been alive for:\n\n\n\nPeople born on this day will turn 69 in exactly .\n\nIf you were born on this date:\n\nYou have been alive for . You were born in the Year of the Horse. Your birth sign is Scorpio with a ruling planet Pluto. There were precisely 850 full moons after you were born up to this day. Your billionth second was on was on July 6, 1986.\n\n→ You’ve slept 8,354 days or 22.89 years.\n\n→ Your next birthday is away\n\n→ You’ve been alive\n\n→ You were born in the Year of the Horse\n\n→ You have been alive 601,468 hours\n\n→ You are 36,088,122 minutes old\n\n→ Age on next birthday: 69 years old\n\nYou were born on a Thursday\n\nOctober 28, 1954 was the 4th Thursday of that year. It was also the 301st day and 10th month of 1954 in the Georgian calendar. The next time you can reuse 1954 calendar will be in 2027. Both calendars will be exactly the same.\n\nThere are left before your next birthday. Your 69th birthday will be on a Friday and a birthday after that will be on a Monday. The timer below is a countdown clock to your next birthday. It’s always accurate and is automatically updated.\n\nYour next birthday is in:\n\n\n\nFriday\n\nYou’ve slept 33% of your life!\n\nYour next birthday is on a\n\nAssuming you’ve been sleeping 8 hours daily since birth. Here is how much time you’ve spent sleeping so far:\n\nYou’ve slept 22.89 years of your life.\n\nYou’ve slept 274 month of your life.\n\nYou’ve slept 1,193 week of your life.\n\nYou’ve slept 8,354 days of your life.\n\nDid you know you have taken approximately 505,229,760 breaths since your birth? Moreover, using 80 beats per minute as average, your heart has beaten over 2,887,027,200 times. You have also blinked over 613,493,280 times in your lifetime.\n\n#1 Song on your birthday\n\nThe number one song in the US on the day of your birth was [Not available]. No song matches found.. (Billboard Hot 100 – October 28, 1954) . Ask your parents if they remember this popular song.\n\nDo you remember the number one song on your 14th birthday? It was \"Hey Jude\" by The Beatles (October 28, 1968) .\n\nCelebrities born on October 28, 1954\n\nYou share a birthday with We could not find a celebrity that shares a birthday with you. However, we update our database constantly, and invite you to check back later to see if we found someone with the same birthday..\n\nWe have over 150,000 celebrities in our database. We will continue to update this list with matching birthdays, so bookmark this page and check back often. You can also find out all celebrity birthdays born on October 28, 1954.\n\nWhat happened on October 28th\n\nBelow are some of the most important historical events that happened on 28 October 1954.\n\nSports in 1954\n\nChristopher Columbus sights Cuba and claims it for Spain under the name \"Juana\".The first university in the New World, the Universidad Santo Tomás de Aquino, is established on Hispaniola.Peruvian cities of Lima and Callao demolished by earthquake, 18,000 die.St Louis police try a new investigation method - fingerprints.Volstead Act passed by US Congress, establishing prohibition, despite President Woodrow Wilson's veto.\n\nNBA – Minneapolis Lakers beat Syracuse Nationals (4 - 3) to win the NBA Finals.\n\nNHL – Detroit Red Wings defeated Montreal Canadiens (4 - 3) to win the Stanley Cup.\n\nNFL –\n\nMLB – New York Giants beat Cleveland Indians (4 - 0) to win the World Series.\n\nYour life path number is 3\n\nSo what does your birthday really say about you and what does your life path number mean? On the next page, we’ll explain what your birth sign, ruling planet, age generation, birthstone, and birth flower mean — and more!\n\nContinue to the next page to discover the answers to the most important questions about your birthday."}, {"url": "https://wiki2.org/en/Royce_Campbell", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican jazz guitarist\n\nMusical artist\n\nRoyce Campbell (born June 7, 1952) is a jazz guitarist from Indiana who was a member of the Henry Mancini orchestra for twenty years.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 417 435 1 489\n\nOn Green Dolphin Street - Royce Campbell - Solo Guitar\n\nRoyce Campbell / Shiny Stockings\n\nRoyce Campbell - Live Every Day Like Christmas Transcription\n\nMusical career\n\nHe was born in North Vernon, Indiana. When he was five, his mother married a career Navy man, and Campbell grew up in cities throughout the U.S. and the world.[1] Exposure to a variety of genres contributed to his musical style. A love for rock and roll marked his first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, he was influenced by Jimi Hendrix and Eric Clapton.[2]\n\nBy the time he finished high school in Spain in the early 1970s, he had decided to pursue a career in music. His uncle, pianist Carroll DeCamp, who had done arrangements for Stan Kenton and Les Elgart, invited him to Indianapolis to live and study. His uncle provided his education in music theory and composition.[1] At 21, he toured with rhythm and blues (R&B) singer Marvin Gaye before spending twenty years as a member of the Henry Mancini orchestra. He held the job until Mancini's death in 1994.[3]\n\nDuring the 1990s, Campbell recorded more as a leader. In 1993, he produced Project G-5: A Tribute to Wes Montgomery which also featured guitarists Tal Farlow, Jimmy Raney, Herb Ellis, and fellow Hoosier Cal Collins. His 1994 album 6x6 featured guitarists Pat Martino, John Abercrombie, Larry Coryell, Dave Stryker, and Bucky Pizzarelli. On Project G-5: A Tribute to Joe Pass (1999) he combined the talents of Charlie Byrd, Gene Bertoncini, Mundell Lowe, and John Pisano.\n\nIn November 2010, Campbell was inducted into the Indianapolis Jazz Foundation Hall of Fame.\n\nDiscography\n\nYear Title Label 1990 Nighttime Daydreams Timeless 1991 Gentle Breeze [rel. 1994] Timeless 1992 Vista Raised Eyebrow; Sin-Drome (1993) 1993 Elegy to a Friend Raised Eyebrow; Moon Cycle (2006) 1993 A Tribute to Wes Montgomery by Project G-5 Paddlewheel/King [Japan]; Evidence 1994 6 x 6 (Six by Six: A Jazz Guitar Celebration) Paddlewheel/King [Japan]; Moon Cycle (2004) 1995 Make Me Rainbows Positive Music 1995 A Tribute to Henry Mancini Episode; String Jazz (1999) 1998 Pitapat A Records/Challenge 1998 Hands Across the Water (with Adrian Ingram) String Jazz 1999 A Tribute to Joe Pass by Project G-5 Paddlewheel/King [Japan] 1999 Royce Campbell with Strings Chase Music 1999 Remembering Wes (with Mel Rhyne) Savant 2002 Trioing Jardis 2003 A Tribute to Charlie Byrd (with Gene Bertoncini) Jardis 2003 A Jazz Guitar Christmas Moon Cycle 2005 Plays for Lovers (with Fred Hersch) Moon Cycle 2006 Gypsy Soul Moon Cycle 2007 Get Happy Foxhaven 2007 A Solo Guitar Christmas Moon Cycle 2008 The Art of Chord Solo Guitar Moon Cycle 2008 A Jazz Guitar Christmas, Volume II Moon Cycle 2008 Trio By Starlight Philology 2008 Roses & Wine Philology 2009 Solo Wes: A Solo Guitar Tribute to Wes Montgomery Moon Cycle 2009 Solo Mancini: A Solo Guitar Tribute to Henry Mancini Moon Cycle 2009 All Standards...and a Blues Philology 2009 Movie Songs Project (with Phil Woods) Philology 2010 Concepts Moon Cycle 2010 What is This Thing Called Philology 2010 Solo Trane: A Solo Guitar Tribute to John Coltrane Moon Cycle 2011 Jazz Blues (compilation) Moon Cycle 2012 All Ballads...and a Bossa Moon Cycle 2012 The Beginning Moon Cycle 2015 Romancing the Tone Moon Cycle 2017 Tea for Three (with Hod O'Brien) Moon Cycle 2018 Duo (with Bob Bowen) Moon Cycle 2019 Organ Trio Moon Cycle\n\nReferences\n\nAdditional sources\n\nBenedetto, Robert. Making an Archtop Guitar . Anaheim Hills, CA: Centerstream Publishing, 1994. xiii.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1994. xiii. Boyd, Herb. \"CD Reviews: A Tribute to Henry Mancini\". Down Beat 63.6 (June 1996): 45.\n\n63.6 (June 1996): 45. Cook, Richard, and Brian Morton. The Penguin Guide to Jazz . 9th ed. New York, NY: The Penguin Group, 2008. 221, 1209.\n\n. 9th ed. New York, NY: The Penguin Group, 2008. 221, 1209. Ellis, Andy. \"A Tribute to Wes Montgomery\". Guitar Player 29.2 (Feb 1995): 146.\n\n29.2 (Feb 1995): 146. Ellis, Andy. \"Hands Across the Water\". Guitar Player 32.12 (Dec 1998): 139.\n\n32.12 (Dec 1998): 139. Ephland, John. \"Rudy Linka-Royce Campbell\". Down Beat 74.3 (March 2007): 71.\n\n74.3 (March 2007): 71. Ephland, John. \"Traveling Guitars\". Down Beat 76.2 (Feb 2009): 71.\n\n76.2 (Feb 2009): 71. Erlewine, Stephen Thomas, ed. All Music Guide to Jazz: The Definitive Guide to Jazz . 4th ed. San Francisco, CA: Backstreet Publishing, 2002. 1063.\n\n. 4th ed. San Francisco, CA: Backstreet Publishing, 2002. 1063. Esposito, Russell R. The Golden Milestone . 4th ed. New York, NY: The New York Learning Library, 2007. 320.\n\n. 4th ed. New York, NY: The New York Learning Library, 2007. 320. Ingram, Adrian. Mel Bay Concise History of the Electric Guitar . Pacific, MO: Mel Bay Publications, 2006. 106.\n\n. Pacific, MO: Mel Bay Publications, 2006. 106. Ingram, Adrian. The Gibson L5 . Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74. Koert, Hans. \"The Five Guitars\". IAJRC Journal 40.4 (Dec 2007): 71–72.\n\n40.4 (Dec 2007): 71–72. Koransky, Jason. \"Project Shopping\". Down Beat 66.6 (June 1999): 53.\n\n66.6 (June 1999): 53. Larkin, Colin, ed. Encyclopedia of Popular Music . 4th ed. US: Oxford University Press, 2006.\n\n. 4th ed. US: Oxford University Press, 2006. Levy, Adam. \"Royce Campbell\". Guitar Player 33.12 (Dec 1999): 41.\n\n33.12 (Dec 1999): 41. Resnicoff, Matt. \"Project G-5: A Tribute to Wes Montgomery\". Guitar Player 29.6 (June 1995): 29–30.\n\n29.6 (June 1995): 29–30. Smith, Will. \"Six by Six: A Jazz Guitar Celebration\". Down Beat 72.7 (July 2005): 76.\n\nReferences"}, {"url": "https://www.todaybirthdays.com/famous/royce-campbell.html", "page_content": "Jazz guitarist who has released more than thirty albums since 1983.He was inducted into the Jazz Foundation Hall of Fame in 2010.He toured for many years with music legend and R&B singer Marvin Gaye.\n\nHe moved in with his musician uncle right out of high school in order to pursue his own career.\n\nHis father was a career Navy man who moved the family around for years.\n\nCrooked Mouth\n\nGuitarist Royce Campbell were born on Saturday, in a leap year, birthstone is Pearl, the seaon was Spring in the Chinese year of Dragon, it is 149 days until Royce Campbell next birthday.\n\nJune 07 Horoscope."}, {"url": "https://music.metason.net/artistinfo?name=Royce%20Campbell", "page_content": "Royce Campbell\n\ng, *1952 US, North Vernon, Indiana\n\nMusician of Jazz and Spoken Word\n\nRoyce Campbell (born June 7, 1952) is a jazz guitarist primarily associated with mainstream jazz, but also has released smooth jazz and post bop jazz recordings.Campbell was born in Seymour, Indiana. The son of a career navy man, Campbell grew up in various cities around the U.S. and abroad, including Asia, Europe, and the West Indies. Exposure to various musical genres while a child contributed to Campbell's musical style and approach in jazz composition and playing. A love for rock and roll marked Campbell's first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, Campbell was also influenced by Jimi Hendrix and Eric Clapton."}], "Royce Campbell is an American jazz guitarist.": [{"url": "http://www.roycecampbell.net/", "page_content": "ROYCE CAMPBELL\n\nFirmly established as one of the premier guitarists, composers, and producers in\n\nthe world today.\n\n\n\nLegendary music icons from Marvin Gaye to Henry Mancini, to Quincy Jones, and many others have used Campbell's talents."}, {"url": "https://jazzguitartoday.com/2022/11/exclusive-interview-with-guitarist-royce-campbell/", "page_content": "JGT contributor Joe Barth talks to guitarist Royce Campbell about his playing and his incredible career.\n\nRoyce Campbell was born in Indiana but grew up around the world because his stepfather was a career Navy man. As a guitarist, he toured with Motown singer Marvin Gaye and later played for over twenty years in Henry Mancini’s orchestra until the composer died in 1994. Royce Campbell\n\nJB: How old were you when you started to play jazz guitar and what was most helpful in your personal development as a guitarist?\n\nRC: I was around 16 when I started playing jazz. My uncle, Carroll DeCamp was most helpful in my development. He was an accomplished pianist/guitarist/arranger who played with Wes Montgomery’s group in the 1950s. I learned more from him than I could have from a music school. He also introduced me to a host of older players in the Indianapolis area who also contributed a lot to my development. I learned on the gigs with them rather than in classes. I got a lot of work as a pit orchestra player for musicals and had to develop my reading skills for those jobs. Even though these weren’t jazz gigs, I grew a lot as a player and as a professional.\n\nJB: What are three of the most influential jazz guitar albums and why?\n\nRC: The Incredible Jazz Guitar of Wes Montgomery was among the most influential albums for me because it was the first jazz LP I ever bought. It introduced me to jazz guitar. Pat Martino’s album The Visit was another one that was an early influence. It introduced me to Martino and was the first album I attempted to do some transcribing. The other is also a Wes album, Smokin’ at the Half Note. Since this album was live it presented Wes in a looser environment where he could really stretch out so I could hear Wes at his very best.\n\nJB: Practice and listening aside, can you pinpoint one or two ‘things’ that really boosted your profile and career toward where it’s at today?\n\nRC: Initially, it was my recordings with other guitarists that helped me build a profile in the first place since so many of them were famous. I recorded with Pat Martino, Larry Coryell, John Abercrombie, Bucky Pizzarelli, Tal Farlow, Jimmy Raney, Mundell Lowe, Cal Collins, Charlies, Byrd, Gene Bertoncini, Herb Ellis, John Pisano, and Dave Stryker. I am really grateful that I had the chance to be forever associated with them in this way.\n\nIn later periods of my career, the other ‘thing’ that contributed to my profile was the recordings I was able to do for small labels in Holland, Germany, Italy, and Japan. Those labels specialized in building catalogs of world-class recordings despite the fact that they did not have the resources of bigger labels, and they also gave me a chance to play with and be associated musically with some extraordinary musicians.\n\nJB: Talk about your musical experience with the great Henry Mancini.\n\nRC: My 19 years with Mancini have given me the fondest memories of my career. Not only did I play great music with Mancini, but he was really a great bandleader who was always kind, generous, and loyal to his musicians. I feel that playing his compositions all those years helped my development as a composer.\n\nJB: What was it like working with the Smithsonian Jazz Orchestra in the Washington DC- Northern Virginia area?\n\nRC: Years ago, I played in DC with the Smithsonian Jazz Masterworks Orchestra which is an awesome big band. It might just be one of the most under-appreciated collections of musicians anywhere. I had the honor and privilege to play with incredibly talented colleagues, real” jazz musicians’ musicians.”\n\nJB: What about your career today that you find rewarding?\n\nRC: Due to health issues I’m semi-retired now, but I do some gigs at retirement communities that are rewarding because the residents appreciate the music so much. I also still compose and work on recording projects, some my own and some as collaborations.\n\nJB: Talk about your composing.\n\nRC: Composing is incredibly rewarding. To create something from nothing is pretty special; there is an energy and beauty to the process that is an important counterpoint to some of the darker aspects of our world right now.\n\nI still love to do recording projects. The whole planning process, the actual sessions, and the post-production work are all exciting and energizing, and even though I am getting older, that process never does.\n\nIn a bigger sense, one of the most rewarding aspects of my recording career in particular is that those recordings still draw new, young audiences. It seems that younger generations don’t get hung up as much on specific genres of music or time periods and fashions; they are willing to engage with a broader variety of styles. I am always gratified when I hear from young fans—some fellow guitarists others just new fans—that they enjoyed listening to particular albums. It might be corny, but it makes the last 50+ years in the biz really worth it.\n\nJB: Tell us about the guitar and amp that you use.\n\nRC: I usually use a Benedetto Fratello guitar and an Acoustic Image amp. I do some gigs that include some funk; for that, I use a Gibson ES-335. I also still play a Gibson L5 from time to time. I love the difference in tone that I get from the Benedetto and the Gibson. One is bright and a little cool, and the other is darker and warmer; each offers different possibilities in terms of what I can create.\n\nJB: Tell me about one of your CD albums that best represents your playing.\n\nRC: It’s difficult to pick just one because I’ve done different styles from mainstream jazz to smooth jazz to free jazz. My personal favorite of the 33 CDs I’ve released is the Tribute to Henry Mancini CD. It was an inspiring moment when we recorded it. Mancini was definitely present, and we could all feel it. It made us all play at our best. I recently had a gig with my friend, bassist Bill Moring, and completely without prompting he said much the same thing. He also still remembers that session as musical magic.\n\nJB: How has your playing changed over the years?\n\nRC: I hope it’s gotten better. I feel that over the years my soloing has gotten more melodic. Because I have gotten older and various health conditions have posed challenges, I might not have the same technique I had as a younger player or the speed, but I think my sense of melodic storytelling has been sharpened over the years. Composing and improvising go hand in hand for me and are both ways to tell stories that listeners can relate to. I happen to be a romantic, and melodic lines tell the stories that I want to tell, so I have been working on that all my life, though it’s become even more important in recent years.\n\nSubscribe to Jazz Guitar Today – it’s FREE!"}, {"url": "https://www.radioswissjazz.ch/en/music-database/musician/23863981e9384cb3556b8909564e1e4c966d7f/biography", "page_content": "Royce Campbell\n\nFrom Wikipedia, the free encyclopedia.\n\nRoyce Campbell is a jazz guitarist.\n\nRoyce Campbell was born in Seymour, Indiana, in 1952. The son of a career navy man, Campbell grew up in various cities around the U.S. and abroad, including Asia, Europe, and the West Indies. Exposure to various musical genres while a child contributed to Campbell's musical style and approach in jazz composition and playing. A love for rock and roll marked Campbell's first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, Campbell was also influenced by Jimi Hendrix and Eric Clapton.[1]\n\nBy the time Royce finished high school in the early 1970s, he was certain he wanted to pursue a professional career in music. His uncle, Carroll DeCamp, an arranger/pianist who arranged for Stan Kenton and Les Elgart, invited Royce to live with him and study in Indiana, providing most of Royce's musical education in theory and composition, and by age 21, Campbell had begun touring with R&B artist Marvin Gaye and developing his talents for stage performance. In 1975, Royce was hired by a local music contractor to do three concerts with award-winning film composer Henry Mancini in Indianapolis. Soon after Royce became the touring guitarist with Henry Mancini's orchestra, holding that positing until Mancini's death in 1994.[2]\n\nWhile appearing on recordings as a sideman, and a couple as leader, during the early years of his career, Campbell started recording and touring more on his own during the 1990s, focusing at first on mainstream or straight-ahead jazz. Although he cites Wes Montgomery as his main influence, horn players such as Dexter Gordon and Chet Baker are evident in Royces, tone and approach to changes. In 1993, he produced Project G-5: A Tribute to Wes Montgomery which also featured guitarists Tal Farlow, Jimmy Raney, Herb Ellis and Cal Collins. His 1994 album 6x6 featured guitarists Pat Martino, John Abercrombie, Larry Coryell, Dave Stryker and Bucky Pizzarelli.With Project G-5: A Tribute to Joe Pass, in 1999, he combined the talents of Charlie Byrd, Gene Bertoncini, Mundell Lowe, and John Pisano.\n\nDuring his career Royce Campbell has released more than 30 CDs as leader or co-leader among various sideman projects. Fifteen of these CDs have made it onto the US national jazz radio charts. Campbell's soloing is documented among other jazz guitarists of the era, in Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! [3]\n\nIn November 2010, Royce Campbell was inducted into the Indianapolis Jazz Foundation Hall of Fame.\n\nDiscography\n\nHeadline Recordings\n\nYear Title Label 1983 Solo Guitar RedBud Records 1987 Around the Town Raised Eyebrow Records 1990 Nighttime Daydreams Timeless Records 1993 Elegy To A Friend Raised Eyebrow Records 1993 Vista Sin-Drome Records 1994 A Tribute To Wes Montgomery Evidence Music 1994 Vista - WTPI 10th Anniversary Jazz Sampler WTPI 1994 6x6 Paddle Wheel Records 1994 Gentle Breeze Timeless Records 1995 Make Me Rainbows Positive Music 1995 A Tribute to Henry Mancini Tuxedo Music Ltd 1998 Pitapat A-Records 1999 Hands Across The Water String Jazz Recordings 1999 A Tribute to Joe Pass King Record Co. 1999 Royce Campbell with Strings Chase Music 1999 Remembering Wes Savant Records 1999 Stella By Starlight. Jazz After Midnight. St. Clair Entertainment Group 2000 \"Prelude to a Kiss\" - Jazz Guitarists Who's Who: The Art of Solo Guitar King Record Co. 2002 Trioing Jardis Records 2003 A Tribute to Charlie Byrd Jardis Records 2006 Trio By Starlight Philology Jazz Records 2007 Get Happy Foxhaven Records 2008 Roses & Wine Philology Jazz Records 2009 All Standards...and A Blues Philology Jazz Records 2009 Movie Songs Project (with Phil Woods) Philology Jazz Records 2010 What is This Thing Called? Philology Jazz Records 2004 Six by Six: A Jazz Guitar Celebration Moon Cycle Records 2004 A Jazz Guitar Christmas Moon Cycle Records 2005 Plays for Lovers Moon Cycle Records 2006 Elegy To A Friend Moon Cycle Records 2006 Gypsy Soul Moon Cycle Records 2007 A Solo Guitar Christmas Moon Cycle Records 2008 The Art of Chord Solo Guitar Moon Cycle Records 2008 A Jazz Guitar Christmas: Volume 2 Moon Cycle Records 2009 Solo Wes: A Solo Guitar Tribute to Wes Montgomery Moon Cycle Records 2009 Solo Mancini: A Solo Guitar Tribute to Henry Mancini Moon Cycle Records 2010 Solo Trane: A Solo Guitar Tribute to John Coltrane Moon Cycle Records 2010 Triologue: Concepts Moon Cycle Records 2011 Jazz Blues Moon Cycle Records 2012 The Beginning Moon Cycle Records\n\nReferences\n\nHeidt, John. \"Royce Campbell.\" Vintage Guitar. July (2005): 26. Alexander, Charles. Masters of Jazz Guitar: The Story of the Players and Their Music. London, UK: Balafon Books, 1999, 185. Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! Pacific, MO: Mel Bay Publications, 2000.\n\nAdditional sources\n\nBenedetto, Robert. Making an Archtop Guitar . Anaheim Hills, CA: Centerstream Publishing, 1994. xiii.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1994. xiii. Cook, Richard, and Brian Morton. The Penguin Guide to Jazz, 9th Ed. New York, NY: The Penguin Group, 2008. 221, 1209.\n\nNew York, NY: The Penguin Group, 2008. 221, 1209. Esposito, Russell R. The Golden Milestone,4th Ed . New York, NY: The New York Learning Library, 2007. 320.\n\n. New York, NY: The New York Learning Library, 2007. 320. Ingram, Adrian. Mel Bay Concise History of the Electric Guitar . Pacific, MO: Mel Bay Publications, 2006. 106.\n\n. Pacific, MO: Mel Bay Publications, 2006. 106. Ingram, Adrian. The Gibson L5 . Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74. Larkin, Colin, ed. Encyclopedia of Popular Music, 4th Ed . USA: Oxford U P, 2006.\n\n. USA: Oxford U P, 2006. Leonard, Hal, Corp. All Music Guide to Jazz: The Definitive Guide to Jazz, 4th Ed . San Francisco, CA: Backstreet Publishing, 2002. 1063.\n\n. San Francisco, CA: Backstreet Publishing, 2002. 1063. Ellis, Andy. \"A Tribute to Wes Montgomery.\" Guitar Player 29.2 (Feb 1995): 146.\n\n29.2 (Feb 1995): 146. Resnicoff, Matt. \"Project G-5: A Tribute to Wes Montgomery.\" Guitar Player 29.6 (June 1995): 29-30.\n\n29.6 (June 1995): 29-30. Boyd, Herb. \"CD Reviews A Tribute to Henry Mancini.\" Down Beat 63.6 (June 1996): 45.\n\n63.6 (June 1996): 45. Ellis, Andy. \"Hands Across the Water.\" Guitar Player 32.12 (Dec 1998): 139.\n\n32.12 (Dec 1998): 139. Koransky, Jason. \"Project Shopping.\" Down Beat 66.6 (June 1999): 53.\n\n66.6 (June 1999): 53. Levy, Adam. \"Royce Campbell.\" Guitar Player 33.12 (Dec 1999): 41.\n\n33.12 (Dec 1999): 41. Smith, Will. \"Six By SixA Jazz Guitar Celebration.\" Down Beat 72.7 (July 2005): 76.\n\n72.7 (July 2005): 76. Ephland, John. \"Rudy Linka-Royce Campbell.\" Down Beat 74.3 (March 2007): 71.\n\n74.3 (March 2007): 71. Koert, Hans. \"The Five Guitars.\" IAJRC Journal 40.4 (Dec 2007): 71-72.\n\n40.4 (Dec 2007): 71-72. Ephland, John. \"Traveling Guitars.\" Down Beat 76.2 (Feb 2009): 71.\n\nThis page was last modified 31.10.2013 22:24:26\n\n\n\nThis article uses material from the article Royce Campbell from the free encyclopedia Wikipedia and it is licensed under the GNU Free Documentation License."}, {"url": "https://www.thejazzguitarlife.com/2021/03/06/royce-campbell-interview-with-jazz-guitar-life/", "page_content": "“I never practised scales. I just worked on playing songs and improvising over the chords.” Royce Campbell\n\nRoyce is a wonderful Jazz Guitarist who has played with a slew of top-shelf entertainers including Henry Mancini and Marvin Gaye. This interview was done via email in 2017\n\n——————-\n\nJGL: Thank you Royce for taking the time to talk to Jazz Guitar Life. First off, if we can get into a little background about you that would be great. How old are you?\n\nRC: 64.\n\nJGL: What geographical area do you reside in?\n\nRC: VA.\n\nJGL: For those who may not know you, could you give us an elevator pitch of who is Royce Campbell and then we’ll get into more detail as this interview unfolds.\n\nRC: A primarily mainstream jazz guitarist who has also done recordings in the smooth jazz and more modern jazz genres.\n\nJGL: At what age did you first start playing the guitar and were you interested in jazz from the beginning or were there other musical interests before jazz? How did you find your way to this particular music and instrument?\n\nRC: I started guitar at 9 and the first jazz guitarist I was interested in was Wes Montgomery.\n\nJGL: Did you know early on that music was something you wanted to do as a career choice and if so, what were some of the things you did to make this choice work for you?\n\nRC: I knew pretty early on and to make it happen I taught myself to read music.\n\nJGL: Do you give private lessons and if so, how does one go about studying with you, and if so, is there a particular level of student you are looking for?\n\nRC: I don’t teach anymore.\n\nJGL: What was your first guitar and what are you playing now? Any guitar of particular note in between?\n\nRC: My first guitar was a Guild. I’m currently playing a ’70 Gibson L-5 and I also have a Benedetto Fratello.\n\nJGL: What other gear are you using? Do you have a specific stage set-up that works best for you in a variety of musical situations?\n\nRC: I just use an Acoustic Image amp through a Raezer’s Edge speaker.\n\nJGL: Who were your influences on jazz guitar when you were beginning, and have they stayed the same or have they changed over the years? Who are you listening to today (guitarists or non-guitarists)?\n\nRC: Wes Montgomery is by far my main influence. Some other of my favorites are Tal Farlow, Jim Hall, Jimmy Raney and Pat Martino.\n\nJGL: In the same vein, who has been most influential in your life as a Jazz Guitarist and why?\n\nRC: Wes.\n\nJGL: Is there anyone – alive or dead – who you’d love to play and/or record with and why?\n\nRC: Chet Baker or Miles Davis. I love their melodic styles.\n\nJGL: I’ve really enjoyed your playing in all that I’ve heard you do, from straight-ahead to some outside playing as well. What was your practice routine like when you were beginning and what is it like now? Are there specific areas that you work on or do you just play through tunes?\n\nRC: I never practiced scales. I just worked on playing songs and improvising over the chords.\n\nJGL: What would you advise students of Jazz Guitar to work on if you could only choose two components?\n\nRC: Harmony and melody.\n\nJGL: You were Henry Mancini’s guitarist for 19 years which is very impressive. How did you land the gig?\n\nRC: I was hired by a music contractor to do a couple of concerts with Mancini in Indiana and Mancini asked me to be his regular after those concerts. I must have impressed him.\n\nJGL: Was this only for touring or did you also record with him as well?\n\nRC: Touring only.\n\nJGL: As Mancini’s guitar player, what was expected of you and were there any challenges that caught you off guard?\n\nRC: It was usually easy rhythm guitar parts. The challenge was just to blend in well with the full orchestra.\n\nJGL: You have been very open about your health issues on Face Book and at one point it looked like you would be hanging up your guitar for good. How is your health these days and is it still affecting your playing?\n\nRC: It’s been a long road but I feel like I’m pretty much back.\n\nJGL: Apart from Mr. Mancini, you have played with a variety of super-stars including Marvin Gaye, The Pointer Sisters, Dave Brubeck, Quincy Jones, Pavarotti, Mose Allison, Gerry Mulligan, Brother Jack McDuff, Ray Brown, Rosemary Clooney and Sarah Vaughn to name the most popular of performers. Do any of these musical associations stand out more than others? (in a positive sense of course)\n\nRC: All those names are great so one doesn’t really stand out to me. Of those names, I worked the most with Marvin Gaye.\n\nJGL: Having worked with so many popular artists, you’ve been outspoken about not working as much as you feel you should. Given your status as a top-shelf musician and player, why do you think it is that work is hard to come by? Do you think it’s a sign of the times? Or is it a young players game now?\n\nRC: Jazz just isn’t very popular and getting less so all the time. No way could I make a living as a player anymore. I make my main income from composer royalties, downloads and streaming sales.\n\nJGL: You’ve been recording since 1983 and have more than 30 albums out as a leader. Sadly I am only aware of a few “Six by Six” – which I reviewed, “Project G-5, A Tribute to Wes Montgomery” and “Elegy to a Friend” – which I have also reviewed. Are these albums still available and if so, how would one go about purchasing them from you? Also, do you plan on recording anymore?\n\nRC: All my CD’s are available through the usual outlets: CDBaby, Amazon or directly from me www.roycecampbell.net Yes, I recently recorded an organ trio album.\n\nJGL: Among your prodigious number of recordings are there any that you dig more than the others? Any special moments you would like to share from these sessions?\n\nRC: I like my Tribute to Henry Mancini CD the best.\n\nJGL: It seems like you’ve done it all! What type of musical situation do you enjoy the most (ie: trio, quartet, duo, solo, etc.) and is there something that you’d still like to do?\n\nRC: I have pretty much done it all. I haven’t done anything with a string quartet.\n\nJGL: Conversely, almost every musician, no matter their level and professional stature have their own insecurities to deal with when it comes to music and playing their instrument. What, if any, insecurities do you face on your instrument and how do you work at getting over them?\n\nRC: I wish I had better technique to feel more at ease playing real fast tempos. The only way to get over that is to practice a lot.\n\nJGL: In 2010 you were inducted into the Indianapolis Jazz Foundation Hall of Fame. Wow, how cool is that!!?? What was that experience like?\n\nRC: It was a surprise and an honor.\n\nJGL: What’s your personal take on the health of Jazz Guitar in particular and the genre in general these days?\n\nRC: Not good.\n\nJGL: Do you find the business side of being a Jazz musician something that should be taught in music schools or should the playing be left to the player and the business side of things be left to managers and agents?\n\nRC: I think the business angle should be addressed in school.\n\nJGL: What – if any – new technology (ie: Internet, Face Book, YouTube, Instagram etc…) do you incorporate into your looking to get gigs or get hired?\n\nRC: I try to use whatever is available.\n\nJGL: Any advice for the younger guy or gal who is thinking about playing jazz guitar?\n\nRC: Learn how to read music and study harmony, harmony and more harmony.\n\nJGL: Have you ever had second thoughts about your choice to have music as a career and if so, what other career path do you think you would have followed had you not been a guitar player.\n\nRC: Photography or art.\n\nJGL: If you had to do one thing over again, what would it be and why?\n\nRC: If I had to do thing over I think I would have stuck more to one style instead of trying to be a jack-of-all-trades.\n\nJGL: What does the future hold for Royce Campbell?\n\nRC: I’d like to do more recording and hopefully some concerts.\n\nJGL: Before I bring this interview to a close, I would be remiss if I didn’t mention that you have a fondness for funny word-plays, which I enjoy as well. Can you share a few with us and have you ever gotten into trouble for using such word-plays in public or on the job?\n\nRC: I’ve used word play in some of my titles such a In A Sorta Mental Mood and Bossa Me Mucho . So far my puns haven’t gotten me in trouble. So far."}, {"url": "https://www.indianapolisjazzhalloffame.org/inductee/royce-campbell", "page_content": "Royce Campbell\n\n(June 7, 1952 - Present)\n\nRoyce Campbell, jazz guitarist, was a member of the Henry Mancini orchestra for twenty years and whose blues-influenced, jazz-guitar playing has earned him accolades as a solo performer and sought-after session musician. Born in North Vernon, Indiana with a stepfather who was career military, Campbell grew up in cities throughout the U.S. and the world. He started playing the guitar at 9 and the first jazz guitarist he was interested in was Wes Montgomery. By the time he finished high school in Spain in the early 1970s, he had decided to pursue a career in music. His uncle, pianist Carroll DeCamp, who had done arrangements for Stan Kenton and Les Elgart, invited him to Indianapolis to live and study. His uncle provided his education in music theory and composition and at 21, he toured with rhythm and blues (R&B) singer Marvin Gaye before spending twenty years as a member of the Henry Mancini orchestra until Mancini's death in 1994.\n\nDuring the 1990s, Campbell recorded more as a leader. In 1993, he produced Project G-5: A Tribute to Wes Montgomery which also featured guitarists Tal Farlow, Jimmy Raney, Herb Ellis, and fellow Hoosier Cal Collins. His 1994 album 6x6 featured guitarists Pat Martino, John Abercrombie, Larry Coryell, Dave Stryker, and Bucky Pizzarelli. On Project G-5: A Tribute to Joe Pass (1999) he combined the talents of Charlie Byrd, Gene Bertoncini, Mundell Lowe, and John Pisano.\n\nIn addition to recording with many of the greats of the jazz guitar, Royce has had multiple tours in Europe and Japan as a soloist. Royce has also performed with many other jazz giants such as Mel Torme, James Moody, Nancy Wilson, Sarah Vaughn, Jack McDuff, Ray Brown, Dave Brubeck, Joe Williams, Cleo Laine, Eddie Daniels, Eddie Harris, Frank Morgan, Ken Poplowski, Gerry Mulligan, Houston Person, Freddy Cole, Vanessa Rubin, Jimmy Cobb, Fred Hersch, Rosemary Clooney, and Mose Allison.\n\nRecording since 1983 and with more than 30 albums as a leader, Campbell has said he is most proud of his 2009 release Solo Mancini: A Solo Guitar Tribute to Henry Mancini."}, {"url": "https://www.allaboutjazz.com/musicians/royce-campbell", "page_content": "Royce has played guitar since age nine. By the time Royce finished high school, he was certain that he wanted to pursue a career in music, but he did not have the means to go to music school. Fortunately, his uncle Carroll DeCamp, a renowned arranger/pianist/guitarist, invited Royce to live with him and study.\n\nSoon Royce's reputation as a quality musician spread, and in 1973 he was asked to tour with vocalist Marvin Gaye. Two years later, Royce was hired by a local music contractor to do three concerts with Henry Mancini in Indianapolis. Mancini was so impressed by Royce's abilities that he asked him to become his regular touring guitarist, and Royce worked with Mancini for 19 years until Mancini's death in 1994.\n\nRoyce has been on the cover of the two main jazz guitar magazines String Jazz and Just Jazz Guitar. He has been featured in profiles in Jazz Times, Down Beat, Guitar Player Magazine, Vintage Guitar, 21st- Century Guitar, Japan's Swing Journal, and Germany's Akustik Gitarre.\n\nRoyce has toured in Europe seven times and toured Japan ten times as a soloist. Royce has also performed with many jazz greats such as Mel Torme, Sarah Vaughn, Ray Brown, Dave Brubeck, Joe Williams, Cleo Laine, Eddie Daniels, Eddie Harris, Frank Morgan and Mose Allison.\n\nCurrently, Royce resides in the Virginia/Washington D.C. area, and he continues to compose and produce recordings regularly.\n\n\n\n"}, {"url": "https://music.metason.net/artistinfo?name=Royce%20Campbell", "page_content": "Royce Campbell\n\ng, *1952 US, North Vernon, Indiana\n\nMusician of Jazz and Spoken Word\n\nRoyce Campbell (born June 7, 1952) is a jazz guitarist primarily associated with mainstream jazz, but also has released smooth jazz and post bop jazz recordings.Campbell was born in Seymour, Indiana. The son of a career navy man, Campbell grew up in various cities around the U.S. and abroad, including Asia, Europe, and the West Indies. Exposure to various musical genres while a child contributed to Campbell's musical style and approach in jazz composition and playing. A love for rock and roll marked Campbell's first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, Campbell was also influenced by Jimi Hendrix and Eric Clapton."}, {"url": "https://www.guitarsite.com/newsletters/040927/4.shtml", "page_content": "Contact | Contents | Privacy Policy | Forum\n\nCopyright © 1999 - 2023 , All Rights Reserved.\n\nAffiliate Notice: As an Amazon Associate we earn from qualifying purchases."}, {"url": "https://peoplepill.com/people/royce-campbell/lists/", "page_content": "Famous American Guitarists\n\nThe guitar was my weapon, my shield to hide behind. –– Brian May\n\nFamous American Jazz Musicians\n\nIf you have to ask what jazz is, you'll never know. ― Louis Armstrong\n\nFamous Jazz Musicians\n\nWhat is my definition of jazz? 'Safe sex of the highest order. ― Kurt Vonnegut"}, {"url": "https://www.guitarsite.com/news/whats_hot_with_jazz_guitar/royce_campbell/", "page_content": "Contact | Contents | Privacy Policy | Forum\n\nCopyright © 1999 - 2023 , All Rights Reserved.\n\nAffiliate Notice: As an Amazon Associate we earn from qualifying purchases."}]}