{"Royce Campbell attended the University of Miami, where he studied with Pat Martino and Jim Hall.": [{"url": "https://peoplepill.com/people/royce-campbell/", "page_content": "Royce Campbell (born June 7, 1952) is a jazz guitarist from Indiana who was a member of the Henry Mancini orchestra for twenty years.\n\nMusical career\n\nHe was born in North Vernon, Indiana. When he was five, his mother married a career Navy man, and Campbell grew up in cities throughout the U.S. and the world. Exposure to a variety of genres contributed to his musical style. A love for rock and roll marked his first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, he was influenced by Jimi Hendrix and Eric Clapton.\n\nBy the time he finished high school in Spain in the early 1970s, he had decided to pursue a career in music. His uncle, pianist Carroll DeCamp, who had done arrangements for Stan Kenton and Les Elgart, invited him to Indianapolis to live and study. His uncle provided his education in music theory and composition. At 21, he toured with rhythm and blues (R&B) singer Marvin Gaye before spending twenty years as a member of the Henry Mancini orchestra. He held the job until Mancini's death in 1994.\n\nDuring the 1990s, Campbell recorded more as a leader. In 1993, he produced Project G-5: A Tribute to Wes Montgomery which also featured guitarists Tal Farlow, Jimmy Raney, Herb Ellis, and fellow Hoosier Cal Collins. His 1994 album 6x6 featured guitarists Pat Martino, John Abercrombie, Larry Coryell, Dave Stryker, and Bucky Pizzarelli. On Project G-5: A Tribute to Joe Pass (1999) he combined the talents of Charlie Byrd, Gene Bertoncini, Mundell Lowe, and John Pisano.\n\nIn November 2010, Campbell was inducted into the Indianapolis Jazz Foundation Hall of Fame.\n\nDiscography\n\nYear Title Label 1990 Nighttime Daydreams Timeless 1991 Gentle Breeze [rel. 1994] Timeless 1992 Vista Raised Eyebrow; Sin-Drome (1993) 1993 Elegy to a Friend Raised Eyebrow; Moon Cycle (2006) 1993 A Tribute to Wes Montgomery by Project G-5 Paddlewheel/King [Japan]; Evidence 1994 6 x 6 (Six by Six: A Jazz Guitar Celebration) Paddlewheel/King [Japan]; Moon Cycle (2004) 1995 Make Me Rainbows Positive Music 1995 A Tribute to Henry Mancini Episode; String Jazz (1999) 1998 Pitapat A Records/Challenge 1998 Hands Across the Water (with Adrian Ingram) String Jazz 1999 A Tribute to Joe Pass by Project G-5 Paddlewheel/King [Japan] 1999 Royce Campbell with Strings Chase Music 1999 Remembering Wes (with Mel Rhyne) Savant 2002 Trioing Jardis 2003 A Tribute to Charlie Byrd (with Gene Bertoncini) Jardis 2003 A Jazz Guitar Christmas Moon Cycle 2005 Plays for Lovers (with Fred Hersch) Moon Cycle 2006 Gypsy Soul Moon Cycle 2007 Get Happy Foxhaven 2007 A Solo Guitar Christmas Moon Cycle 2008 The Art of Chord Solo Guitar Moon Cycle 2008 A Jazz Guitar Christmas, Volume II Moon Cycle 2008 Trio By Starlight Philology 2008 Roses & Wine Philology 2009 Solo Wes: A Solo Guitar Tribute to Wes Montgomery Moon Cycle 2009 Solo Mancini: A Solo Guitar Tribute to Henry Mancini Moon Cycle 2009 All Standards...and a Blues Philology 2009 Movie Songs Project (with Phil Woods) Philology 2010 Concepts Moon Cycle 2010 What is This Thing Called Philology 2010 Solo Trane: A Solo Guitar Tribute to John Coltrane Moon Cycle 2011 Jazz Blues (compilation) Moon Cycle 2012 All Ballads...and a Bossa Moon Cycle 2012 The Beginning Moon Cycle 2015 Romancing the Tone Moon Cycle 2017 Tea for Three (with Hod O'Brien) Moon Cycle 2018 Duo (with Bob Bowen) Moon Cycle 2019 Organ Trio Moon Cycle\n\nAdditional sources\n\nBenedetto, Robert. Making an Archtop Guitar . Anaheim Hills, CA: Centerstream Publishing, 1994. xiii.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1994. xiii. Boyd, Herb. \"CD Reviews: A Tribute to Henry Mancini\". Down Beat 63.6 (June 1996): 45.\n\n63.6 (June 1996): 45. Cook, Richard, and Brian Morton. The Penguin Guide to Jazz . 9th ed. New York, NY: The Penguin Group, 2008. 221, 1209.\n\n. 9th ed. New York, NY: The Penguin Group, 2008. 221, 1209. Ellis, Andy. \"A Tribute to Wes Montgomery\". Guitar Player 29.2 (Feb 1995): 146.\n\n29.2 (Feb 1995): 146. Ellis, Andy. \"Hands Across the Water\". Guitar Player 32.12 (Dec 1998): 139.\n\n32.12 (Dec 1998): 139. Ephland, John. \"Rudy Linka-Royce Campbell\". Down Beat 74.3 (March 2007): 71.\n\n74.3 (March 2007): 71. Ephland, John. \"Traveling Guitars\". Down Beat 76.2 (Feb 2009): 71.\n\n76.2 (Feb 2009): 71. Erlewine, Stephen Thomas, ed. All Music Guide to Jazz: The Definitive Guide to Jazz . 4th ed. San Francisco, CA: Backstreet Publishing, 2002. 1063.\n\n. 4th ed. San Francisco, CA: Backstreet Publishing, 2002. 1063. Esposito, Russell R. The Golden Milestone . 4th ed. New York, NY: The New York Learning Library, 2007. 320.\n\n. 4th ed. New York, NY: The New York Learning Library, 2007. 320. Ingram, Adrian. Mel Bay Concise History of the Electric Guitar . Pacific, MO: Mel Bay Publications, 2006. 106.\n\n. Pacific, MO: Mel Bay Publications, 2006. 106. Ingram, Adrian. The Gibson L5 . Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74. Koert, Hans. \"The Five Guitars\". IAJRC Journal 40.4 (Dec 2007): 71–72.\n\n40.4 (Dec 2007): 71–72. Koransky, Jason. \"Project Shopping\". Down Beat 66.6 (June 1999): 53.\n\n66.6 (June 1999): 53. Larkin, Colin, ed. Encyclopedia of Popular Music . 4th ed. US: Oxford University Press, 2006.\n\n. 4th ed. US: Oxford University Press, 2006. Levy, Adam. \"Royce Campbell\". Guitar Player 33.12 (Dec 1999): 41.\n\n33.12 (Dec 1999): 41. Resnicoff, Matt. \"Project G-5: A Tribute to Wes Montgomery\". Guitar Player 29.6 (June 1995): 29–30.\n\n29.6 (June 1995): 29–30. Smith, Will. \"Six by Six: A Jazz Guitar Celebration\". Down Beat 72.7 (July 2005): 76.\n\nReferences"}, {"url": "https://jazzguitartoday.com/2022/11/exclusive-interview-with-guitarist-royce-campbell/", "page_content": "JGT contributor Joe Barth talks to guitarist Royce Campbell about his playing and his incredible career.\n\nRoyce Campbell was born in Indiana but grew up around the world because his stepfather was a career Navy man. As a guitarist, he toured with Motown singer Marvin Gaye and later played for over twenty years in Henry Mancini’s orchestra until the composer died in 1994. Royce Campbell\n\nJB: How old were you when you started to play jazz guitar and what was most helpful in your personal development as a guitarist?\n\nRC: I was around 16 when I started playing jazz. My uncle, Carroll DeCamp was most helpful in my development. He was an accomplished pianist/guitarist/arranger who played with Wes Montgomery’s group in the 1950s. I learned more from him than I could have from a music school. He also introduced me to a host of older players in the Indianapolis area who also contributed a lot to my development. I learned on the gigs with them rather than in classes. I got a lot of work as a pit orchestra player for musicals and had to develop my reading skills for those jobs. Even though these weren’t jazz gigs, I grew a lot as a player and as a professional.\n\nJB: What are three of the most influential jazz guitar albums and why?\n\nRC: The Incredible Jazz Guitar of Wes Montgomery was among the most influential albums for me because it was the first jazz LP I ever bought. It introduced me to jazz guitar. Pat Martino’s album The Visit was another one that was an early influence. It introduced me to Martino and was the first album I attempted to do some transcribing. The other is also a Wes album, Smokin’ at the Half Note. Since this album was live it presented Wes in a looser environment where he could really stretch out so I could hear Wes at his very best.\n\nJB: Practice and listening aside, can you pinpoint one or two ‘things’ that really boosted your profile and career toward where it’s at today?\n\nRC: Initially, it was my recordings with other guitarists that helped me build a profile in the first place since so many of them were famous. I recorded with Pat Martino, Larry Coryell, John Abercrombie, Bucky Pizzarelli, Tal Farlow, Jimmy Raney, Mundell Lowe, Cal Collins, Charlies, Byrd, Gene Bertoncini, Herb Ellis, John Pisano, and Dave Stryker. I am really grateful that I had the chance to be forever associated with them in this way.\n\nIn later periods of my career, the other ‘thing’ that contributed to my profile was the recordings I was able to do for small labels in Holland, Germany, Italy, and Japan. Those labels specialized in building catalogs of world-class recordings despite the fact that they did not have the resources of bigger labels, and they also gave me a chance to play with and be associated musically with some extraordinary musicians.\n\nJB: Talk about your musical experience with the great Henry Mancini.\n\nRC: My 19 years with Mancini have given me the fondest memories of my career. Not only did I play great music with Mancini, but he was really a great bandleader who was always kind, generous, and loyal to his musicians. I feel that playing his compositions all those years helped my development as a composer.\n\nJB: What was it like working with the Smithsonian Jazz Orchestra in the Washington DC- Northern Virginia area?\n\nRC: Years ago, I played in DC with the Smithsonian Jazz Masterworks Orchestra which is an awesome big band. It might just be one of the most under-appreciated collections of musicians anywhere. I had the honor and privilege to play with incredibly talented colleagues, real” jazz musicians’ musicians.”\n\nJB: What about your career today that you find rewarding?\n\nRC: Due to health issues I’m semi-retired now, but I do some gigs at retirement communities that are rewarding because the residents appreciate the music so much. I also still compose and work on recording projects, some my own and some as collaborations.\n\nJB: Talk about your composing.\n\nRC: Composing is incredibly rewarding. To create something from nothing is pretty special; there is an energy and beauty to the process that is an important counterpoint to some of the darker aspects of our world right now.\n\nI still love to do recording projects. The whole planning process, the actual sessions, and the post-production work are all exciting and energizing, and even though I am getting older, that process never does.\n\nIn a bigger sense, one of the most rewarding aspects of my recording career in particular is that those recordings still draw new, young audiences. It seems that younger generations don’t get hung up as much on specific genres of music or time periods and fashions; they are willing to engage with a broader variety of styles. I am always gratified when I hear from young fans—some fellow guitarists others just new fans—that they enjoyed listening to particular albums. It might be corny, but it makes the last 50+ years in the biz really worth it.\n\nJB: Tell us about the guitar and amp that you use.\n\nRC: I usually use a Benedetto Fratello guitar and an Acoustic Image amp. I do some gigs that include some funk; for that, I use a Gibson ES-335. I also still play a Gibson L5 from time to time. I love the difference in tone that I get from the Benedetto and the Gibson. One is bright and a little cool, and the other is darker and warmer; each offers different possibilities in terms of what I can create.\n\nJB: Tell me about one of your CD albums that best represents your playing.\n\nRC: It’s difficult to pick just one because I’ve done different styles from mainstream jazz to smooth jazz to free jazz. My personal favorite of the 33 CDs I’ve released is the Tribute to Henry Mancini CD. It was an inspiring moment when we recorded it. Mancini was definitely present, and we could all feel it. It made us all play at our best. I recently had a gig with my friend, bassist Bill Moring, and completely without prompting he said much the same thing. He also still remembers that session as musical magic.\n\nJB: How has your playing changed over the years?\n\nRC: I hope it’s gotten better. I feel that over the years my soloing has gotten more melodic. Because I have gotten older and various health conditions have posed challenges, I might not have the same technique I had as a younger player or the speed, but I think my sense of melodic storytelling has been sharpened over the years. Composing and improvising go hand in hand for me and are both ways to tell stories that listeners can relate to. I happen to be a romantic, and melodic lines tell the stories that I want to tell, so I have been working on that all my life, though it’s become even more important in recent years.\n\nSubscribe to Jazz Guitar Today – it’s FREE!"}, {"url": "https://www.radioswissjazz.ch/en/music-database/musician/23863981e9384cb3556b8909564e1e4c966d7f/biography", "page_content": "Royce Campbell\n\nFrom Wikipedia, the free encyclopedia.\n\nRoyce Campbell is a jazz guitarist.\n\nRoyce Campbell was born in Seymour, Indiana, in 1952. The son of a career navy man, Campbell grew up in various cities around the U.S. and abroad, including Asia, Europe, and the West Indies. Exposure to various musical genres while a child contributed to Campbell's musical style and approach in jazz composition and playing. A love for rock and roll marked Campbell's first connection with the guitar, at the age of nine, when he discovered Chuck Berry. Like many guitarists of his generation, Campbell was also influenced by Jimi Hendrix and Eric Clapton.[1]\n\nBy the time Royce finished high school in the early 1970s, he was certain he wanted to pursue a professional career in music. His uncle, Carroll DeCamp, an arranger/pianist who arranged for Stan Kenton and Les Elgart, invited Royce to live with him and study in Indiana, providing most of Royce's musical education in theory and composition, and by age 21, Campbell had begun touring with R&B artist Marvin Gaye and developing his talents for stage performance. In 1975, Royce was hired by a local music contractor to do three concerts with award-winning film composer Henry Mancini in Indianapolis. Soon after Royce became the touring guitarist with Henry Mancini's orchestra, holding that positing until Mancini's death in 1994.[2]\n\nWhile appearing on recordings as a sideman, and a couple as leader, during the early years of his career, Campbell started recording and touring more on his own during the 1990s, focusing at first on mainstream or straight-ahead jazz. Although he cites Wes Montgomery as his main influence, horn players such as Dexter Gordon and Chet Baker are evident in Royces, tone and approach to changes. In 1993, he produced Project G-5: A Tribute to Wes Montgomery which also featured guitarists Tal Farlow, Jimmy Raney, Herb Ellis and Cal Collins. His 1994 album 6x6 featured guitarists Pat Martino, John Abercrombie, Larry Coryell, Dave Stryker and Bucky Pizzarelli.With Project G-5: A Tribute to Joe Pass, in 1999, he combined the talents of Charlie Byrd, Gene Bertoncini, Mundell Lowe, and John Pisano.\n\nDuring his career Royce Campbell has released more than 30 CDs as leader or co-leader among various sideman projects. Fifteen of these CDs have made it onto the US national jazz radio charts. Campbell's soloing is documented among other jazz guitarists of the era, in Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! [3]\n\nIn November 2010, Royce Campbell was inducted into the Indianapolis Jazz Foundation Hall of Fame.\n\nDiscography\n\nHeadline Recordings\n\nYear Title Label 1983 Solo Guitar RedBud Records 1987 Around the Town Raised Eyebrow Records 1990 Nighttime Daydreams Timeless Records 1993 Elegy To A Friend Raised Eyebrow Records 1993 Vista Sin-Drome Records 1994 A Tribute To Wes Montgomery Evidence Music 1994 Vista - WTPI 10th Anniversary Jazz Sampler WTPI 1994 6x6 Paddle Wheel Records 1994 Gentle Breeze Timeless Records 1995 Make Me Rainbows Positive Music 1995 A Tribute to Henry Mancini Tuxedo Music Ltd 1998 Pitapat A-Records 1999 Hands Across The Water String Jazz Recordings 1999 A Tribute to Joe Pass King Record Co. 1999 Royce Campbell with Strings Chase Music 1999 Remembering Wes Savant Records 1999 Stella By Starlight. Jazz After Midnight. St. Clair Entertainment Group 2000 \"Prelude to a Kiss\" - Jazz Guitarists Who's Who: The Art of Solo Guitar King Record Co. 2002 Trioing Jardis Records 2003 A Tribute to Charlie Byrd Jardis Records 2006 Trio By Starlight Philology Jazz Records 2007 Get Happy Foxhaven Records 2008 Roses & Wine Philology Jazz Records 2009 All Standards...and A Blues Philology Jazz Records 2009 Movie Songs Project (with Phil Woods) Philology Jazz Records 2010 What is This Thing Called? Philology Jazz Records 2004 Six by Six: A Jazz Guitar Celebration Moon Cycle Records 2004 A Jazz Guitar Christmas Moon Cycle Records 2005 Plays for Lovers Moon Cycle Records 2006 Elegy To A Friend Moon Cycle Records 2006 Gypsy Soul Moon Cycle Records 2007 A Solo Guitar Christmas Moon Cycle Records 2008 The Art of Chord Solo Guitar Moon Cycle Records 2008 A Jazz Guitar Christmas: Volume 2 Moon Cycle Records 2009 Solo Wes: A Solo Guitar Tribute to Wes Montgomery Moon Cycle Records 2009 Solo Mancini: A Solo Guitar Tribute to Henry Mancini Moon Cycle Records 2010 Solo Trane: A Solo Guitar Tribute to John Coltrane Moon Cycle Records 2010 Triologue: Concepts Moon Cycle Records 2011 Jazz Blues Moon Cycle Records 2012 The Beginning Moon Cycle Records\n\nReferences\n\nHeidt, John. \"Royce Campbell.\" Vintage Guitar. July (2005): 26. Alexander, Charles. Masters of Jazz Guitar: The Story of the Players and Their Music. London, UK: Balafon Books, 1999, 185. Mel Bay's Anthology of Jazz Guitar Solos: Featuring Solos by the World's Finest Jazz Guitarists! Pacific, MO: Mel Bay Publications, 2000.\n\nAdditional sources\n\nBenedetto, Robert. Making an Archtop Guitar . Anaheim Hills, CA: Centerstream Publishing, 1994. xiii.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1994. xiii. Cook, Richard, and Brian Morton. The Penguin Guide to Jazz, 9th Ed. New York, NY: The Penguin Group, 2008. 221, 1209.\n\nNew York, NY: The Penguin Group, 2008. 221, 1209. Esposito, Russell R. The Golden Milestone,4th Ed . New York, NY: The New York Learning Library, 2007. 320.\n\n. New York, NY: The New York Learning Library, 2007. 320. Ingram, Adrian. Mel Bay Concise History of the Electric Guitar . Pacific, MO: Mel Bay Publications, 2006. 106.\n\n. Pacific, MO: Mel Bay Publications, 2006. 106. Ingram, Adrian. The Gibson L5 . Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74.\n\n. Anaheim Hills, CA: Centerstream Publishing, 1997. 7, 68, 74. Larkin, Colin, ed. Encyclopedia of Popular Music, 4th Ed . USA: Oxford U P, 2006.\n\n. USA: Oxford U P, 2006. Leonard, Hal, Corp. All Music Guide to Jazz: The Definitive Guide to Jazz, 4th Ed . San Francisco, CA: Backstreet Publishing, 2002. 1063.\n\n. San Francisco, CA: Backstreet Publishing, 2002. 1063. Ellis, Andy. \"A Tribute to Wes Montgomery.\" Guitar Player 29.2 (Feb 1995): 146.\n\n29.2 (Feb 1995): 146. Resnicoff, Matt. \"Project G-5: A Tribute to Wes Montgomery.\" Guitar Player 29.6 (June 1995): 29-30.\n\n29.6 (June 1995): 29-30. Boyd, Herb. \"CD Reviews A Tribute to Henry Mancini.\" Down Beat 63.6 (June 1996): 45.\n\n63.6 (June 1996): 45. Ellis, Andy. \"Hands Across the Water.\" Guitar Player 32.12 (Dec 1998): 139.\n\n32.12 (Dec 1998): 139. Koransky, Jason. \"Project Shopping.\" Down Beat 66.6 (June 1999): 53.\n\n66.6 (June 1999): 53. Levy, Adam. \"Royce Campbell.\" Guitar Player 33.12 (Dec 1999): 41.\n\n33.12 (Dec 1999): 41. Smith, Will. \"Six By SixA Jazz Guitar Celebration.\" Down Beat 72.7 (July 2005): 76.\n\n72.7 (July 2005): 76. Ephland, John. \"Rudy Linka-Royce Campbell.\" Down Beat 74.3 (March 2007): 71.\n\n74.3 (March 2007): 71. Koert, Hans. \"The Five Guitars.\" IAJRC Journal 40.4 (Dec 2007): 71-72.\n\n40.4 (Dec 2007): 71-72. Ephland, John. \"Traveling Guitars.\" Down Beat 76.2 (Feb 2009): 71.\n\nThis page was last modified 31.10.2013 22:24:26\n\n\n\nThis article uses material from the article Royce Campbell from the free encyclopedia Wikipedia and it is licensed under the GNU Free Documentation License."}, {"url": "https://www.guitarsite.com/newsletters/040927/4.shtml", "page_content": "Contact | Contents | Privacy Policy | Forum\n\nCopyright © 1999 - 2023 , All Rights Reserved.\n\nAffiliate Notice: As an Amazon Associate we earn from qualifying purchases."}, {"url": "https://www.miaminewtimes.com/music/the-ten-best-musical-alumni-of-the-university-of-miami-7845083", "page_content": "just\n\nare\n\n90 year\n\nway\n\nUniversity\n\nscholarship,\n\nback-up\n\nIt isn'thall of fame football players like Michael Irvin and Jim Kelly or action movie stars like The Rock and Sylvester Stallone that have walked across The University of Miami's campus. Therealso a boatload of renowned and acclaimed musicians who attended class in Coral Gables. And in the school'shistory, it has racked up quite an impressive list of musical alumni.With an enrollment hovering around 15,000, there's bound to by some talent hiding in its halls. Here are ten of the best musicians who are former Hurricanes.Perry is the youngest alumni on this list, but she's also been rapping since she was only seven-years-old , when she first stepped up to the mic in Miami's legendary Poe Boy Music Studio. Along theshe's earned the respect of Miami's own Trina, and the iconic Missy Elliott. She was nominated for Best Female Hip-Hop Artist at the BET Awards, and she did all of this while earning a degree in a degree in Business Economics. Now that she's a graduate, we can't wait to see what she does with all this free time.The singer of Jefferson Airplane and Starship spent a year at UM from 1958 to 1959 where a literature class or two may have helped her write about Alice's Adventures in Wonderland in her hit \"White Rabbit.\" Or perhaps it was an architecture class that helped inspire her adorably cheesy \"We Built This City\" with Starship. The Woodstock vet and counterculture icon was a provocateur who was the first person to say \"motherfucker\" on live TV, which she belted out on the Dick Cavett Show in 1969. We landed on the moon before the first F-bomb was dropped on live television. What an odd world we live in.The jazz guitarist attended UM in 1972 where his virtuoso skills must have awfully impressed someone because he was quickly hired at the age of 18 as the school's youngest teacher. He formed the Pat Metheny Group in 1977 and his work with the six string, 12 string, and guitar synthesizer has resulted in his earning three gold albums and 20 Grammy awards. He's still gigging today with the Pat Metheny Unity Group, who made a local appearance this past February at the Adrienne Arsht Center.Starting his academic career on French horn, Lee made a wise transition to a bass major by the time he graduated from UM, which must have made his father Bill Lee (Dean of the Frost School of Music at the time) awfully proud. But in his professional career, no one could accuse Will Lee of nepotism. From the time David Letterman started hostingon NBC in 1982 until his final episode of theon CBS this year, Will Lee was in the house band picking his bass guitar. Lee was also inducted into the Musicians Hall of Fame and Museum in 2014.An argument could be made that dropping out of business school atof Miami was the best thing Enrique's Iglesias has ever done. Not that we're suggesting anything, kids, but Enrique's fame has just about surpassed that of his father Julio's — no easy accomplishment. Hits like \"Bailando,\" \"Hero,\" and \"I'm a Freak\" have helped him sell over 137 million albums worldwide, while snapping pics of his marriage to Anna Kournikova has paid for many a paparazzi's rent.Folds Attended the Frost School of Music on a percussionbut dropped out in 1985 after flunking a final exam with one credit to go before graduating. After throwing his drumset into a lake and moving back to North Carolina, his lack of formal qualifications didn't stop the piano man from finding radio play with the Ben Folds Five. In the mid- '90s, songs like \"Brick\" and \"Song for the Dumped\" helped earn him his fame, and later he excelled as a solo artist with tracks like \"Rockin' the Suburbs.\"After completing a Bachelor's degree in Music and then earning a Master's degree in Jazz Vocal Performance, the Hialeah-raised man born as Juan Secada co-wrote a number one hit for his fellow Hurricane, Gloria Estefan, in \"Coming Out of the Dark\" and found chart success with his own hits \"Just Another Day,\" \"Angel,\" and \"I'm Free.\" He has also given back to his alma mater by creating the Jon Secada Endowed Music Scholarship.Bruce Springsteen's wife and backing singer had her own bonafides before she joined the rock and roll hall of fame with the E Street Band. She attended the Frost School of Music's jazz conservatory in the 1970's as the program's sole female at the time before transferring to NYU in 1974, where she eventually earned her degree. Besides her day job with The Boss, Scialfa has sungon Rolling Stones songs as well as released three solo albums. Yet, we can't help but crawl with jealousy when we see her singing into the same microphone as Springsteen.At 22 years of age, the Oakland Park prodigy was teaching bass at UM's Frost School of Music jazz program. Pastorius was not lacking in confidence, unabashedly calling himself the world's greatest bassist. Finding work with legends like Herbie Hancock, Joni Mitchell, and Ian Hunter helped to back up this claim. He died in 1987 at the age of 35 after a confrontation at a Wilton Manors bar, but he hasn't been forgotten. Oakland Park named a park after their fallen son and this summer, Herbie Hancock hosted a concert at the Hollywood Bowl dedicated to Pastorius' music.Graduating in 1979 with a B.A. in psychology, and a minor in French, Gloria has cranked out pop hits like \"Conga,\" \"Rhythm Is Gonna Get You,\" and \"Coming out of the Dark\" both as a solo artist and with the Miami Sound Machine, introducing Spanglish to a whole cross-section of Middle America. We put her at the top of this list because, one, she's a Magic City icon who deserves it and, two, not doing so may very well be considered inciting a riot in the eyes of Miami law. Now hard at work with a musical about her life called, set to debut on Broadway later this year, Dr. Estefan was given her honorary doctorate in music from UM in 1993."}, {"url": "http://www.scottishphilosophy.org/philosophers/george-campbell/", "page_content": "George Campbell (1719-1796)\n\nGeorge Campbell, the son a Presbyterian minister, was born in Aberdeen on Christmas Day 1719, a religious festival that at the time went unobserved by Scottish Calvinists. At the age of fifteen, Campbell attended Marischal College, one of two local universities, where he studied logic, metaphysics, pneumatology (philosophy of mind), ethics, and natural philosophy (physics). After graduating M.A. in 1738, Campbell went to Edinburgh and became apprenticed in the law. At the same time he attended divinity lectures at the University of Edinburgh, and this stimulated his interest in theological questions. As a result, once his apprenticeship was completed, he returned to Aberdeen and enrolled as a divinity student at both King's College and Marischal. Since the city of Aberdeen became actively caught up in the suppression of the Jacobite uprising in 1745, Campbell's divinity examinations were delayed until 1746. He received his license to preach in that year, and within two years was ordained to at the parish of Banchory Ternan just outside Aberdeen.\n\nIt was as a parish minister that George Campbell embarked on his lifelong project of translating the Gospels from the Greek, and also while a minister that he wrote the first two chapters of a subsequently well regarded book on The Philosophy of Rhetoric. After ten years in rural Aberdeenshire, Campbell was offered a parish within the city, and this brought him into contact with the intellectual community in northeast Scotland that was increasingly playing its part in the Scottish Enlightenment. In 1759, he was offered, and accepted, the position of principal at Marischal College and fully immersed himself in university affairs.\n\nAlong with Thomas Reid at King’s College, Campbell was a founding member of the Aberdeen Philosophical Society, popularly known as ‘the Wise Club’. The Club was not confined to philosophers in the modern sense. Its founders included the mediciner John Gregory and the naturalist David Skene, but the best known works to emerge from its deliberations were indeed primarily works of philosophy -- Reid's Inquiry into the Human mind, on the Principles of Common Sense (1764), James Beattie's Essay on the Nature and Immutability of Truth (1770), and Alexander Gerard's Essay on Genius. Campbell continued to work on the Philosophy of Rhetoric, sections of which he read to the Society. It was not finally published until 1776, three years after the Club had ceased to meet. The Philosophy of Rhetoric has a practical educational purpose, but it engages in the unmistakable Scottish Enlightenment project of a ‘science of human nature’, as well as revealing the influence of Reid’s philosophical conception of ‘common sense’.\n\nFourteen years before that, Campbell published his first major book -- A Dissertation in Miracles (1762). The philosophy of David Hume was a regular topic of discussion at the Wise Club and in this book Campbell took issue with the attack on miracles that Hume had launched in An Enquiry concerning Human Understanding. Campbell’s criticism of Hume, in contrast to the somewhat hysterical tone of Beattie’s later Essay, was judicious and respectful. The book was well received and led to Campbell succeeding the venerable Alexander Gerard as Professor of Divinity at Marischal in 1770. The lectures on church history and on preaching that he gave in this position were later published. After the publication of The Philosophy of Rhetoric (1776), George Campbell finally completed his translation of The Four Gospels. Ill health forced him into retirement shortly afterwards, and he died in 1796, the same year as Thomas Reid.\n\nLike several other philosophers who were prominent in the Scottish Enlightenment, Campbell’s works circulated widely, and then in a relatively short period of time disappeared almost completely. A recent full length study of Campbell by Jeffrey M Suderman concludes that ‘the limits of the moderate mind’ that Campbell exemplifies to perfection ‘were intimately related to the limits of the enlightened mind’ with the result that ‘the fall of the Enlightenment entailed the fall of Christian moderatism’. Campbell’s Philosophy of Rhetoric is undoubtedly a product of this moderatism, and as such can probably only be read today out of historical interest. But some philosophical interest has revived in his Dissertation on Miracles because of its relevance to contemporary epistemological debates about testimony.\n\nGordon Graham, Princeton Theological Seminary"}, {"url": "https://miamioh.edu/news/top-stories/2019/03/richard-campbell.html", "page_content": "Richard Campbell is at home in the classroom sharing his passion for journalism. Photo: Jeff Sabo\n\nThe Benjamin Harrison Medallion The Benjamin Harrison Medallion Award is one of the most significant recognitions Miami offers faculty for contributions attesting to qualities of teaching, research and/or service. Richard Campbell will be honored at the University Awards Reception 5-6:30 p.m. Tuesday, March 19, in Marcum Conference Center. Benjamin Harrison is an 1852 Miami graduate and was 23rd president of the United States, serving from 1889-1893.\n\nBy Carole Johnson, university news and communications\n\nRichard Campbell, professor of journalism, is the 2019 recipient of Miami University’s prestigious Benjamin Harrison Medallion.\n\nThe Benjamin Harrison Medallion, named for the Miami alumnus and 23rd president of the United States, has the inscription of “For Outstanding Contribution to the Education of the Nation.”\n\nCampbell’s nominators all agree that this inscription describes him.\n\nHis visionary scholarship, compassionate teaching, and forward-thinking leadership is rooted within his “fascination with storytelling in the public life,” his nominators wrote.\n\nCampbell joined Miami in 2004 as director of the newly created journalism program.\n\nThe former journalist led the effort to create the new department of media, journalism and film, for which he served as chair from its implementation in 2013 through 2018.\n\nHe saw journalism and mass communication in a way that many experts couldn’t see, said one nominator.\n\nAmong his scholarly works, Campbell took a hard look at media covearge in Cracked Coverage: Television News, the Anti-Cocaine Crusade, and the Reagan Legacy,1994 (co-authored with J. Reeves) and \"60 Minutes\" and the News: A Mythology for Middle America, 1991.\n\nHe received numerous accolades for his widely used textbook, Media and Culture, An Introduction to Mass Communication, 1997. It is now in its 11th edition, subtitled Mass Communication in a Digital Age and co-authored by former student Bettina Fabos and student and colleague, Christopher R. Martin.\n\nThis work, updated every two years to meet the rapidly changing field, encourages critical engagement with media, offering students a practical, step-by-step process for interacting with media and popular culture – (1) describe, (2) analyze, (3) interpret, (4) evaluate, (5) engage .\n\nRichard Campbell and Wil Haygood, journalist, author and Miami's Boadway Distinguished Scholar-in-Residence, share a moment during a recent event. Campbell and his colleagues bring journalists to campus to interact with students.\n\nWriting is essential to storytelling\n\n“Many Miami graduates name Campbell as the professor who had the greatest impact on their careers,” according to his nominators. Campbell has “persuaded many students that their own love of media can be enriched and deepened by critical analysis,” his nominators wrote.\n\nCampbell was adamant that the study of journalism be embedded in the study of liberal arts, and because of his insistence, all Miami journalism majors double-major in a second field.\n\nHe also argued that “writing remain a core component to journalism, bucking a national trend of moving away from the skill giving way to the “technological flood that on some campuses has trumped the centrality of language,” his nominators wrote. Campbell is co-founder of Miami’s Writing Scholars program.\n\nIn addition to writing, Campbell understands the importance of data and statistical analysis and is a champion of quantitative literacy at Miami.\n\nHis course “News and Numbers,” co-taught with statistics professor John Bailer, was “one of the most unique and engaging classes I took while at Miami,” a former student said.\n\nThat course led to a new partnership between Bailer and Campbell and the creation of Stats+Stories, a podcast with featured guests and a moderator chatting about the “statistics behind the stories and the stories behind the statistics.” Stats+Stories has gained national attention and recently received financial support from the American Statistical Association.\n\nHis leadership led to the opportunity to serve on the steering committee of the Dayton Peace Accords 20th Anniversary Conference, keynoted by former President Bill Clinton. It was an opportunity to be a part of the news and to provide ample story material to share with his students.\n\nIt’s all about telling stories\n\nOne external nominator commended Campbell for not giving up on journalism as the current field struggles to maintain its viability. Campbell and James Tobin, also a professor of journalism, launched Report for Ohio in 2018. The project is modeled after AmeriCorps’ Teach for America. Report for Ohio aims to provide assistance to shrinking regional news organizations to hire young journalists.\n\n“It’s a smart and thoughtful vision at every level,” said an external nominator. “I think it may well prove to be a national model.”\n\nIn an attempt to revitalize local news reporting, Campbell and colleagues founded the Oxford Observer, a digital newspaper covering Oxford and the township. Miami’s journalism students report on local affairs, guided by editor David Wells, a Miami visiting instructor and former professional journalist.\n\nThis summer, Campbell will make his documentary debut. After six years in the making, “Training for Freedom: How Ordinary People In An Unusual Time & Unlikely Place Made Extraordinary History,” will air on Cincinnati and Dayton’s public broadcasting stations. Campbell helped produce the documentary with Kathy Conkwright, a former Miami faculty member and Mary Makley, both of MakeWright Films, LLC.\n\nIt’s the story of Freedom Summer, a 1964 voter registration drive aimed at increasing black voter registration in Mississippi. Freedom Summer workers, predominately white volunteers, trained on the campus of then-Western College for Women, now part of Miami University.\n\nLater this spring, Campbell plans to retire from academia. However, to those who know him, there’s no telling how many more stories he’ll find ways to champion.\n\nView a tribute video by Campbell's former students, edited by alumnus and former student JM Rieger."}, {"url": "https://miamioh.edu/cas/academics/departments/mjf/about/faculty-staff/campbell-richard/index.html", "page_content": "Professor Emeritus of Journalism,\n\nFormer Department Chair\n\nRichard Campbell is professor emeritus and founding chair of the Department of Media, Journalism & Film at Miami University.\n\nHe is the author of 60 Minutes and the News: A Mythology for Middle America and co-author of Cracked Coverage: Television News, the Anti-Cocaine Crusade and the Reagan Legacy. For Bedford/St. Martin’s Press, he was the lead author of three textbooks, including Media & Culture: Mass Communication in a Digital Age, now in its 13th edition.\n\nCampbell earned his B.A. in English from Marquette University and his Ph.D. from Northwestern University in the Radio-Television-Film department. He also worked as a print reporter and broadcast news writer in Milwaukee. In his 48-year academic career, he also taught at Mount Mary College, UW-Milwaukee, Middle Tennessee State University, and the University of Michigan.\n\nHe was co-creator (with John Bailor) of “Stats + Stories,” a long-running podcast sponsored by Miami University and the American Statistical Association. The podcast won the 2021 Communication Award from the Mathematical Association of America. His other projects have included supporting the digital Oxford Observer and Report for Ohio -- initiatives aimed at getting more young journalists real-world experience and hired to cover under-reported areas in both rural and urban communities. He is also the executive producer of Training for Freedom: How Ordinary People in an Unusual Time & Unlikely Place Made Extraordinary History, a 2019 documentary on Oxford’s role in the historic events of Freedom Summer in 1964.\n\nHe grew up in Dayton, Ohio, where in 2015 he served on the city’s planning committee for the 20th anniversary of Dayton Peace Accords. In 2018, his Dayton alma mater, Carroll High School, inducted Campbell into their Alumni Hall of Fame. In 2019, Campbell received Miami’s Benjamin Harrison Medallion Award \"For Outstanding Contribution to the Education of the Nation\" and delivered Miami’s winter commencement address."}, {"url": "https://www.sunsigns.org/famousbirthdays/profile/joseph-campbell/", "page_content": "Childhood and Early Life\n\nAmerican academic and writer Joseph Campbell was born Joseph John Campbell on the 26 March 1904 in White Plains, New York. His parents were Josephine and Charles Campbell, who were a middle-class couple and practising Roman Catholics.\n\nWhen he was seven years old, he was taken to see Buffalo Bill’s Wild West show and later he wrote that the show was a defining event in his life. He became obsessed and fascinated by the Native Americans tribes. By the age of ten, he had read every child’s book on Native American culture that he could find. He was then allowed access to the adult library where he discovered Reports of the Bureau of American Ethnology.\n\nJoseph Campbell also visited the American Museum of Natural History where he was able to view masks, totem poles, and other artifacts. He had a happy childhood until l 1919 when in high school, the family home was destroyed by a fire which destroyed all their possessions and killed his grandmother.\n\nadvertisement advertisement\n\n\n\n\n\n\n\nEducation\n\nIn his early teens, Joseph Campbell attended Iona, a private school in Westchester, New York. He then studied at a Catholic boarding school, Canterbury, in New Milford, Conneticutt. After graduating from Canterbury (1921), Campbell attended Dartmouth College. The college did not suit him, and he transferred to Columbia University. He did well at university and also participated in athletics and joined a jazz band.\n\nHe obtained a B.A. from Columbia (1925) and went on to do an M.A. in Arthurian Studies (1927). After winning a Proudfit Travelling Fellowship, Campbell went to Europe where he studied at the University of Paris in France (1927-1928). After the renewal of his Proudfit Traveling Fellowship, he studied at the University of Munich in Germany (1928-1929).\n\nadvertisement advertisement\n\nRise to Fame\n\nA practising Catholic into his twenties, Joseph Campbell said that the dynamics shaped his worldview between rituals and symbols of Catholicism and his deep interest in Native American culture. When he was studying in Europe, Campbell had the opportunity to meet many of the famous modernist masters of the day including Pablo Picasso, James Joyce, Thomas Mann, Sigmund Freud, and Carl Jung. Around this time he began formulating his ideas concerning myths being the creative products of the human psyche and that mythologies are manifestations of humankind’s need to explain spiritual, cosmological, psychological and social realities.\n\nCampbell returned to the United States in August 1929 at the beginning of the Great Depression. He was unable to find work and spent the time reading and writing in his journal. In 1931, he undertook a cross-country journey to explore the soul of America. He studied Russian in Los Angeles until January 1932 then moved to Pacific Grove, California where he spent time with the writer John Steinbeck and marine biologist Ed Ricketts.\n\nAt the same time, Joseph Campbell was applying to over 70 universities and colleges for work but had no success. He was then offered a teaching position at Canterbury School on the East Coast. He spent a year as a housemaster and during that time, he had his first story published, Strictly Platonic in Liberty magazine. In 1933, he moved to a cottage in Woodstock, New York where he spent a year focusing on research and writing.\n\nadvertisement advertisement\n\nCareer\n\nJoseph Campbell was then offered a position at Sarah Lawrence College in the literature department, and for the next thirty-eight years, he remained at the college. While teaching, he also began working on a translation of The Gospel of Sri Ramakrishna (1942), He contributed an introduction and commentary to Where the Two Came to their Father: A Navaho War Ceremonial. When Zimmer died in 1943, Campbell was asked by his widow Christina and Mary Mellon to manage the publication of Zimmer’s unpublished works.\n\nUsing Zimmer's extensive notes and research, he published Myths and Symbols in Indian Art and Civilization(1946), The King and the Corpse(1948), Philosophies of India (1951), and The Art of Indian Asia (1955). He also wrote a commentary to Grimm’s Fairy Tales (1944) and with Henry Morton Robinson, wrote A Skeleton Key to Finnegan’s Wake (1944), a study of the complex James Joyce novel. His first full-length book The Hero with a Thousand Faces (1949) was met with wide acclaim and awards.\n\nJoseph Campbell went on to write numerous books and articles including The Masks of God: Prmitive Mythology (1959), Oriential Mythology (1962), Creative Mythology (1968), Myths to Live By (1972) and The Inner Reaches of Outer Space: Metaphor as Myth and as Religion (1986). Works he edited include The Portable Arabian Nights (1952), the Man and Myth series (1953-1954) and The Portable Jung (1972). He was also a public speaker and lecturer.\n\nadvertisement advertisement\n\nAwards and Achievements\n\nJoseph Campbell received the National Arts Club Gold Medal in Honor in Literature in 1985.\n\nadvertisement advertisement\n\nPersonal Life\n\nJoseph Campbell married Jean Erdman in 1938 who was a dancer and choreographer.\n\nIn 1987, Joseph Campbell died after a short battle with cancer."}, {"url": "https://prabook.com/web/roy.campbell/722831", "page_content": "Roy Campbell\n\nsatirist poet\n\nOctober 2, 1901 (age 55) Durban, KwaZulu-Natal, South Africa\n\nWhile living in a small converted stable on the coast of North Wales, Campbell completed his first long poem, The Flaming Terrapin, a humanistic allegory of the rejuvenation of man projected in episodes. It was published in 1924. Returning to South Africa in 1925, he started Voorslag, a literary magazine with the ambition to serve as a \"whiplash\" (the meaning of the Afrikaans word voorslag) on South African colonial society, which he considered backward and inbred. Before the magazine was launched, he invited William Plomer to help with it, and late in the year, Laurens van der Post was invited to become Afrikaans editor of Voorslag. Campbell lasted as the magazine's editor for three issues but then resigned because of interference from the magazine's proprietor, Lewis Reynolds; Reynolds reacted against Campbell's negative comments about colonial South Africa and informed him that he would remove some of his editorial control over the content of Voorslag. Campbell moved back to England in 1927. While still in South Africa, he had written The Wayzgoose, a lampoon, in rhyming couplets, on the racism and other cultural shortcomings of South Africa. It was published in 1928. The Campbells moved to Provence in the early 1930s. The French period saw the publication of, among other writings, Adamastor (1930), Poems (1930), The Georgiad (1931), and the first version of his autobiography, Broken Record (1934). In 1932, the Campbells retained the Afrikaner poet Uys Krige as tutor to Tess and Anna."}]}