{"Carlos Arniches y Barrera was a member of the Generation of '98 and the Royal Spanish Academy.": [{"url": "https://www.britannica.com/topic/Generation-of-1898", "page_content": "Generation of 1898, also called Generation of ’98, Spanish Generación del 1898 or Generación del ’98, in Spain, the novelists, poets, essayists, and thinkers active at the time of the Spanish-American War (1898), who reinvigorated Spanish letters and restored Spain to a position of intellectual and literary prominence that it had not held for centuries.\n\nThe shock of Spain’s defeat in the war, which left it stripped of the last vestiges of its empire and its international prestige, provided an impetus for many writers and thinkers to embark on a period of self-searching and an analysis of Spain’s problems and its destiny.\n\nMore From Britannica Spanish literature: The Generation of 1898\n\nThe term Generation of 1898 was used loosely at the turn of the century but was elaborated by the literary critic Azorín in critical essays that appeared in various periodicals and were collected in his Clásicos y modernos (1913). It was soon generally applied to the writers who concerned themselves with Spain’s heritage and its position in the modern world. Never an organized movement or school, the Generation of 1898 worked in diverse fields and styles and rarely agreed on approaches or solutions to Spain’s problems, but all had in common a desire to shake the Spanish people out of what they saw as apathy and to restore a sense of national pride.\n\nJoaquín Costa, Ángel Ganivet, and Miguel de Unamuno are generally considered precursors of the Generation of 1898, but many literary historians consider Ganivet and, usually, Unamuno as members of the group proper. Other outstanding figures are Azorín himself, the philosopher and critic José Ortega y Gasset, the novelists Pío Baroja, Vicente Blasco Ibáñez, and Ramón María del Valle-Inclán, and the poets Antonio Machado y Ruiz and Manuel Machado y Ruiz. In their revitalization of Spanish letters, they brought a new seriousness of purpose to the Spanish novel and elevated the essay—critical, psychological, philosophical—to a position of literary importance. At the same time, they brought to Spain an awareness of foreign trends in literature and thought that enabled the Spanish people to reassess their own values in the context of the modern world, thus awakening a national consciousness that paved the way for Spanish cultural development in the 20th century."}, {"url": "https://adp.library.ucsb.edu/names/103603", "page_content": "Carlos Arniches (11 October 1866 – 16 April 1943) was a Spanish playwright, born in Alicante. His prolific work, drawing on the traditions of the género chico, the zarzuela and the grotesque, came to dominate the Spanish comic theatre in the early twentieth century.\n\nAfter starting his career as a novelist and journalist, Arniches turned to theatre in 1888 with the publication of his first play, Casa editorial. Much of his work is set in lower-class Madrid and uses colloquial language, song, dance and music.\n\nArniches was complimented in a 1935 interview by Federico García Lorca, often a scathing critic of contemporary Spanish theatre, as 'more of a poet than almost any of those who are writing theatre in verse at the moment'.\n\nFollowing the end of the Spanish Civil War, the social dramas of Carlos Arniches were among the relatively non-controversial plays allowed by the new government."}, {"url": "https://www.actualidadliteratura.com/en/generation-of-98/", "page_content": "Surely you remember from your years at school and / or high school having studied the Generation of '98 in the Language and Literature class. Perhaps it is even possible that, now that you have children, you have to study it again with them so that they learn it. If so, then you have come to the right place because we are going to tell you about it.\n\nAnd if not, it is always good to remember part of the history of Spain, specifically the literary part, since it is the authors who were part of the Generation of 98 were very important in their time and had an impact, not only in Spain, but in many more parts of the world. Stay and know more about them.\n\nHow the Generation of '98 emerged\n\nThe Generation of '98 is actually the name of a group of writers who came together at a time with the aim of facing a situation that all of them were going through, characterized by a moral, social, political and economic crisis. in Spain, the result of the loss of Cuba, Puerto Rico and the Philippines.\n\nWe speak specifically of the year 1898, At a time when, due to the decline of the Spanish empire and the signing of a treaty by which several Spanish-American colonies were lost, society was plunged into an atmosphere of unease and indignation, which many authors channeled and exhibited in their own works.\n\nAt first, the group was formed only by three authors: Pío Baroja, Azorín and Ramiro de Maeztu, known as \"The Three\", nickname by which they signed the articles published in the media of that time. But little by little they increased in number, adding many more authors, up to more than 20 personalities from the literature of that time: Ángel Ganivet, Miguel de Unamuno, Enrique de Mesa, Antonio and Manuel Machado, Ricardo Baroja, Ramón María del Valle- Inclán, Gabriel y Galán, Manuel Gómez Moreno, Miguel Asín Palacios, Francisco Villaespesa, Ramón Menéndez Pidal, Jacinto Benavente, Carlos Arniches, Joaquín and Serafín Álvarez Quintero.\n\nGeneration '98 Characteristics\n\nThese authors, upset by what had happened, began a \"campaign\" of social protest characterized by a series of conditions that governed their writings. These are:\n\nFlaunt Spain\n\nDefending her and expressing his love for her. Therefore, for them the \"homeland\" and the essence of the country are important. For them, the need for regeneration, not only social, political, but also artistic is a priority.\n\nThey reject the bourgeoisie\n\nConsidering that this social class is only one defeatist and failed society that it does not serve the common good (and much less for Spain).\n\nThey are very critical\n\nOn the political situation and the social norms that govern the country, sometimes opposing them, especially if those norms clashed with his patriotistic values ​​or love of Spain.\n\nThey created new forms of literature\n\nFollowing their own dictates, in which literature also needed a \"change,\" they were the pioneers in offering a new literature, as for example the absurdity, a branch of the theater; or the impressionist novel.\n\nTo give you an example, Azorín was perhaps one of the first authors of the time in Spain who decided that his characters should take a trip back in time, when that was unthinkable.\n\nIn turn, they decided to bring literature much closer to readers, make it more understandable, so they began to use simple phrases, with careful language but that everyone understood. And short; with a sentence of just a few words they were able to convey a large body of opinions or make people reflect on what they had just read.\n\nThe main authors of the Generation of '98\n\nAs we have seen before, the Generation of '98 was not a matter of just three authors. There were many more and it is worth commenting a bit about the main authors, starting with the group of 'The Three'.\n\nPio Baroja\n\nBaroja, along with the following two authors, was one of the pillars of the Generation of '98. At that time, his works were influenced by the characteristics of this movement, where pessimism and restlessness were present in his literary works.\n\nIn this case, Baroja used his critical and sarcastic humor to talk about the reality of Spain, but at the same time he was trying to make readers wake up and see that the best thing for the country was to regenerate itself, to change to have a better one.\n\nIt must be said of Pío Baroja that he was a very pessimistic and sullen man. Perhaps the most \"incendiary\" of the whole group since he was quite nonconformist and one of the first to be predisposed to \"be noticed\".\n\nAzorin\n\nIn the case of Azorín, or his real name, José Martínez Ruiz, had access to publications due to his status as a journalist. For this reason, by being in the \"front line\" of the information, he was able to see the social and economic problems that the loss of the colonies posed to Spain, and how a change should be brought about in the country so that it would regenerate and emerge again.\n\nIn the case of Azorín, he is the complete opposite of Pio Baroja. In the sense that he was more calm and observant, very sensitive and able to appreciate even the smallest details that were put before him.\n\nFor this reason, his passion for Spain, for landscapes, transience and the passage of time characterized all of his work.\n\nRamiro de Maeztu in the Generation of '98\n\nMaeztu, in addition to being a writer, was a journalist. Thanks to his profession, he had the media more at hand and was able to publish many articles related to the defense of the Homeland (Spain) and Hispanic values, trying to get more people to identify with his country.\n\nEven though at first it was quite impulsive and radical, with the passage of time his writings were more conservative, always in the same vein, but with a more appeasing message.\n\nMiguel de Unamuno\n\nUnamuno joined the Generation of 98 shortly after it was created since he shared his same way of thinking with other authors and reflected it in his works, where very similar characteristics to this group are seen.\n\nTo Miguel de Unamuno he is recognized as a kind of \"leader\" of the group due to that fighting and rebellious spirit that, even in advanced age, he knew how to keep intact. For him, both Spain and human life were the most important thing in the world, and he tried to influence everyone who wanted to listen to him or read him."}, {"url": "https://adp.library.ucsb.edu/index.php/mastertalent/detail/103603/Arniches_y_Barrera_Carlos", "page_content": "Carlos Arniches (11 October 1866 – 16 April 1943) was a Spanish playwright, born in Alicante. His prolific work, drawing on the traditions of the género chico, the zarzuela and the grotesque, came to dominate the Spanish comic theatre in the early twentieth century.\n\nAfter starting his career as a novelist and journalist, Arniches turned to theatre in 1888 with the publication of his first play, Casa editorial. Much of his work is set in lower-class Madrid and uses colloquial language, song, dance and music.\n\nArniches was complimented in a 1935 interview by Federico García Lorca, often a scathing critic of contemporary Spanish theatre, as 'more of a poet than almost any of those who are writing theatre in verse at the moment'.\n\nFollowing the end of the Spanish Civil War, the social dramas of Carlos Arniches were among the relatively non-controversial plays allowed by the new government."}, {"url": "http://www.zarzuela.net/writ/arniches.htm", "page_content": "\n\nCarlos Arniches\n\n(1866 - 1943)\n\nBorn into an Alicante family of modest means on 11th October 1866, Arniches became the most prestigious writer of one-act sainetes and género chico zarzuelas in the early decades of the 20th Century. Although he was undisputed successor to the great saineteros such as Ramon de la Cruz and Ricardo de la Vega, his background was far removed from the Madrid literary coffee houses and tertulias that bred so many of the capital's celebrated stage writers. He left home aged 14 for a post in a Barcelona bank, later working in a sewing machine factory. A benevolent maiden aunt covered the costs of a mutual move to Madrid in 1885, though she soon retired to Valencia and left him to his own financial devices. Penury forced him to move back to Barcelona, but one clever idea - a Rhyming Alphabet based on incidents from the life of Alfonso XII, dedicated to his young son and heir Alfonso XIII - won the heart of the Queen, who ordered its use in all Spanish schools. Arniches returned to Madrid, this time for good. His first short play Casa editorial was written with Gonzalo Cantó, and performed at the Teatro Eslava in 1888. Altogether he wrote over 200 stage pieces, many with other writers. Many of these earlier works are sainetes in one or two acts, with or without music, full of costumbrismo (popular life and customs) and written in the fresh, colourful and buoyant style which was his trademark. Later on he developed a new dramatic form, the tragi-comic tragedia grotesca, often farcical in action but trenchant in social commentary: the full-length plays La señorita de Trevélez (1916) and Es mi hombre (1921) are amongst the most potent of these. His spoken dialogue (other writers often wrote the sung lyrics) is fluent but far from vapid, sparkling with keen wit. His texts have a moral framework which allays any suspicion of frivolity. Arniches' scripts were in great demand with virtually all the leading composers and writers of the day. A mere handful may be singled out, though many more will be found in the Zarzuela Index. For Chapí he penned three notable works with Cantó which cemented his reputation - Ortografía (1888); La leyenda del monje (1890); and Las campanadas (1892) - two with Celso Lucio, El reclamo (1893) and Vía libre (1893) - one with Asensio Mas, El puñao de rosas (1902) - and unaided La cara de Dios (1899) and El maldito dinero (1906). For Caballero he wrote Los aparecidos (1892), and the evergreen El cabo primero (1895, with Lucio); for Chueca, Los descamisados (1893) and El coche correo (1896), both with José López Silva. Of his many sainetes for Torregrosa El santo de La Isidra and La fiesta de San Antón (both 1898) retain their popularity; as does El pobre Valbuena (1904) with music by Torregrosa and Quinito Valverde, and lyrics by Enrique García Alvarez. Arniches and García Alvarez also enjoyed great success writing sainetes for the young Serrano such as El pollo Tejada (1906); the brilliant Alma de Dios (1907); and El trust de los tenorios (1910). La alegría del batallón (1909) was written for the same composer with Félix Quintana. Alone, he wrote El amigo Melquiades (1914, music by Serrano and Quinito Valverde). A collaboration with Antonio Estremera, Don Quintín el amargao (1924), a sainete in two acts with a substantial music score by Jacinto Guerrero, proved one of his biggest music theatre successes. No less than three films were made of the play, two of them directed by no less than Luis Buñuel (1935 and 1951), who amplified Arniches hints of surrealism in his treatment of the \"embittered\" anti-hero and his gangster sidekicks. Perhaps his heyday was the brilliant period between 1916 and 1926, when he was a nationally known and loved figure. His work rate later declined considerably - until the onset of the Civil War, when he moved to Argentina and resuscitated his career in theatre, radio and cinema. Unhappy away from his beloved Madrid, he and his wife returned home in the early 1940's, only to find the capital changed beyond recognition. Loved and respected for his personal virtues as well as his sainetes, Arniches died in Madrid on 16th April 1943, from heart failure brought on by news of the sudden death of his daughter Rosario. **See also El pudín negro de Stornoway (December 28th 1904), \"by Torregrosa and Quinito Valverde, to a libretto by Carlos Arniches\"**\n\n\n\n[Back to top of page]"}, {"url": "https://commons.wikimedia.org/wiki/Category:Carlos_Arniches", "page_content": "This category has the following 2 subcategories, out of 2 total.\n\nMedia in category \"Carlos Arniches\"\n\nThe following 6 files are in this category, out of 6 total."}, {"url": "http://dictionary.sensagent.com/Carlos%20Arniches%20y%20Barrera/en-en/", "page_content": "Webmaster Solution\n\nAlexandria\n\nA windows (pop-into) of information (full-content of Sensagent) triggered by double-clicking any word on your webpage. Give contextual explanation and translation from your sites !\n\nTry here or get the code\n\nSensagentBox\n\nWith a SensagentBox, visitors to your site can access reliable information on over 5 million pages provided by Sensagent.com. Choose the design that fits your site."}, {"url": "https://www.bookdepository.com/author/Arniches-Y-Barrera-Carlos", "page_content": "We are sorry to let you know that Book Depository has now closed.\n\nWe will continue to deliver orders placed before midday (12pm BST) on 26 April and will provide support for any order issues until 23 June 2023.\n\nFrom all of us at Book Depository we want to say 'thank you'. Delivering your favourite reads to you since 2007 has been a pleasure.\n\nYou’ll find more info in our FAQs."}, {"url": "https://commons.wikimedia.org/wiki/Category:Carlos_Arniches", "page_content": "This category has the following 2 subcategories, out of 2 total.\n\nMedia in category \"Carlos Arniches\"\n\nThe following 6 files are in this category, out of 6 total."}, {"url": "https://commons.wikimedia.org/wiki/Category:Carlos_Arniches", "page_content": "This category has the following 2 subcategories, out of 2 total.\n\nMedia in category \"Carlos Arniches\"\n\nThe following 6 files are in this category, out of 6 total."}]}