{"Geoff Griffin played for Eastern Suburbs Roosters for two seasons.": [{"url": "https://www.roosters.com.au/history/our-players/sydney-roosters-centurions/", "page_content": "In 2007, the Sydney Roosters announced \"The Centurions\", a team consisting of those regarded as the greatest players to have played 100 or more games for the Club between 1908 and 2007. The team was selected by Ray Chesterton, Ian Heads, David Middleton and Alan Clarkson and was unveiled at the centenary season launch at the Michael Algeri Pavilion on 10 March 2007. 1. Anthony Minichiello (2000-2014) A one-Club man, Anthony Minichiello is currently the second-most capped player in Sydney Roosters history. In an NRL career that spanned over 15 seasons, Minichiello played in six grand finals, winning two Premierships in 2002 and 2013 respectively, captaining the side in the latter. In the representative arena, he represented Australia on 19 occasions, captained Italy in the 2013 World Cup, made 11 appearances for the NSW Blues and represented NSW City four times. Making his debut for the Roosters on the wing in 2000, Minichiello’s rise was rapid, playing his first NRL Grand Final that season before first tasting Premiership victory in 2002, featuring in the 2003 and 2004 NRL Grand Finals as well.\n\nRelated The Best We've Ever Seen: Anthony Minichiello\n\nHaving made the switch to fullback in 2003, Minichiello was named Dally M Fullback of the Year in 2004. In 2005, Minichiello won the ‘Golden Boot’, awarded to the player voted the Best in the World. In 2006, persistent back, neck and ankle injuries looked like they would halt his career but a determination to succeed led to the rebuilding of his body and life. True grit, determination and belief saw him return to peak form that led to him continuing his journey of a brilliant and fulfilling career and ending on his own terms. He assumed the Sydney Roosters captaincy in 2013, which was a record year for the Club, which saw the team score a record six shut-outs and secure the Club Championship and Minor Premiership on their way to winning the title. 2. Bill Mullins (1968-1978) Even though modern-day wingers tend to be big and fast like Bill Mullins was, most opponents in his era were much smaller. Mullins used his remarkable athleticism to become the first Roosters’ player to score 100 career tries. He played in the Roosters’ 1974 and 1975 premiership teams, scoring a try in the ’74 decider against Canterbury. His son Brett Mullins was a member of the Roosters’ 2002 Premiership-winning side. 3. Mark Harris (1970-1979) 1970s flyer Mark Harris was an unusually big centre for his era, and he used that size to full effect, especially in attack. He played in the Roosters’ legendary 1974/75 grand final-winning teams, and represented Australia at two World Cups. Harris was also a gridiron trailblazer. He unsuccessfully trialled for the NFL’s Philadelphia Eagles in 1973, but was picked up by a Canadian team and played several matches in their league during one season before returning to the Roosters. 4. John Brass (1969-1976) Regarded as one of the most successful converts from the amateur code during the modern era John Brass was a classy centre renowned for his great handling skills and brick-wall defence. With 12 rugby Tests to his credit, Brass switched codes on a record $30,000 contract to play with Easts in 1969. The following year he captained both his Club and state before becoming a dual international when he played in all three Tests against the Ashes-winning Great Britain side. Brass declined to tour with Australia's victorious World Cup squad in 1970 due to business and family reasons but was a mainstay of the Roosters' great sides of the 1970s. Although missing the 1972 grand final loss to Manly because of injury, Brass played in both 1974-75 grand final successes with Easts. An accomplished inside centre and prolific goal-kicker, he scored 213pts during the 1974 season. After making himself available for rep duty in 1975, he captained Australia to victory against the Kiwis in a World Series match before touring Great Britain for the latter half of the short-lived competition. 5. Ian Schubert (1975-1982) Known for his pace out wide, Ian Schubert was first recommended to Eastern Suburbs coach Jack Gibson in 1974. Although not out of school at the time, Schubert instantly became a regular first grader on the wing - in the process relegating the previous season's leading try scorer Bill Mullins to reserve grade. When he was shifted to fullback to cover for the injured Russell Fairfax, the results were devastating. Schubert scored 14 tries that year and was named 'Man Of The Match' in the 1975 grand final. He completed the season with Australian selection for that season's World Cup and was also a member of the Eastern Suburbs side that defeated St Helens in the first-ever World Club Challenge match in 1976. 6. Brad Fittler (1996-2004) After starting his career at Penrith in the late 1980s, Brad ‘Freddy’ Fittler joined the Roosters as a marquee signing in 1996. He quickly showed his class and won the Rothman’s Medal (the equivalent of today’s Dally M Medal for the best player in the competition) in 1997. Fittler had one of the best steps in the game, which, combined with his size, made him a major attacking threat.\n\nRelated The Best We've Ever Seen: Brad Fittler\n\nHe captained the Roosters to a premiership in 2002, steered New South Wales to several State of Origin series wins and led Australia to a World Cup victory during his time at the Club. His influence was such that he is widely considered among the best five-eighths of all time. 7. Kevin Hastings (1976-1987) Kevin ‘Horrie’ Hastings was the first player to reach 200 first grade games for Eastern Suburbs. He won the Rothman’s Medal in 1981 and was voted the Rugby League Week Player of the Year in three consecutive years (1980-1982). A member of the Easts side that lost to Canterbury in the 1980 grand final, his sole appearance for NSW was as a reserve in 1983. Hastings was also runner-up in the 'Dally M' Player of the Year award in 1980-82. 8. Ray Stehr (1929-1946) Ray Stehr was a tough prop who overcame a spinal issue as a child to make his first-grade debut for the Roosters at just 16. He was part of a dominant Roosters’ forward pack during their golden era in the 1930s when they went through three seasons losing just one match.\n\nRelated The Best We've Ever Seen: Ray Stehr\n\nStehr won five premierships with the Club, captaining the team in their 1940 and 1945 grand final wins, and is considered one of rugby league’s greatest ever front rowers. 9. Sandy Pearce (1908-1921) Sandy Pearce was the Roosters’ inaugural hooker, winning three premierships with the Club as they established themselves as a force in the early years of Australian rugby league. He was the first player to reach the 100-game milestone for the tri-colours, as well as the first in Australian rugby league history to notch up 150 top grade games. He also represented NSW and Australia for most of his career. 10. Arthur Beetson (Captain, 1971-1978) Arthur Beetson was named as the seventh rugby league immortal in 2004. He had brilliant ball skills and his ability to offload, despite the attention of several defenders, became legendary. ‘Artie’ also had good speed for a man of his size and was a strong, tough defender.\n\nRelated The Best We've Ever Seen: Arthur Beetson\n\nHe captained the Roosters’ premiership-winning teams in 1974 and 1975 and was named the Rugby League Week Player of the Year in 1974. While at the Roosters, he also became the first Indigenous player to captain Australia in any sport. 11. Ron Coote (1972-1978) The tall, rangy, mobile middle was at the height of his career when he joined Eastern Suburbs in 1972. He formed a great combination with Artie Beetson, with the sight of Coote running off a Beetson pass becoming as well-known as his brilliant cover defence.\n\nRelated The Best We've Ever Seen: Ron Coote\n\nCoote was a key member of both the 1974 and 1975 Roosters’ premiership teams, and continued to play for Australia for several years after joining the Club. 12. Joe Pearce (1929-1942) Joe Pearce was a member of the Roosters’ dominant forward pack in their golden era during the mid-1930s. Noted for his ball-playing ability, Pearce won four premierships with Eastern Suburbs and is considered by many to be one of the greatest second-rowers of all-time. He was also the son of the Roosters’ legendary hooker Sandy Pearce. They became the first father and son in rugby league history to be selected to represent Australia during their respective careers. 13. Andy Norval (1934-1941) A player of outstanding versatility, Andy Norval was a member of the famous Easts teams that won premierships in 1935,1936,1937 and 1940. He was best known as a lock, but played his only three Test matches on the 1937–38 Kangaroo tour as a winger. He joined Easts in 1934 after playing some Australian rules football in South Australia. Sydney fans saw Norval play every position in the backline bar halfback — an amazing achievement for a forward. He was incredibly strong and intimidating and combined spectacular cover defence with an ability to score tries. He finished with 42 tries in 106 first-grade appearances for Easts and scored a try in each of his three Tests. 14. Craig Fitzgibbon (2000-2009) Joining the Roosters in 2000, Craig Fitzgibbon established himself as a great leader, Clubman and a fierce competitor, and one of the most admired players in the modern era. In 2002, he was a prime contributor to the Roosters’ drought-breaking premiership title and was justly rewarded with the Clive Churchill Medal after amassing a tally of 14 points in the decider with a try and five goals. His success at representative level was acknowledged in 2004 when Fitzgibbon won the Dally M Representative Player of the Year Award and the inaugural Wally Lewis Medal for the Player of the Series in State of Origin. At Club level Fitzgibbon received the Sydney Roosters highest honour, the Jack Gibson Medal for the Player of the Year, three times, in 2001, 2002 and 2006.\n\nRelated The Best We've Ever Seen: Craig Fitzgibbon\n\nIn 2006, he succeeded Luke Ricketson as captain of the Roosters. Apart from his non-stop efforts at Club and representative level, Fitzgibbon was also making his mark as a point-scorer. By 2005 he became the highest scorer in the 97-year history of the Roosters and a year later he became the game’s highest points-scoring forward when he overtook the old mark of 1,218. In his final season in the NRL, he chalked up more memorable milestones – he passed 1,500 career points, played his 250th career first-grade game and broke into the top 10 all-time point-scorers in Premiership history. In 2021, Fitzgibbon was awarded Life Membership of the Club for his achievements and efforts in ten years of playing and ten years of coaching. 15. Ernie Norman (1931-1939) A product of the Paddington and Imperial Clubs in Easts' juniors, Norman made his way to grade in 1931 after starring in the Tricolours' President's Cup side the previous year. Equally at home at centre or five-eighth and described by team-mate Joe Pearce as ''an amazingly low tackler and a very good team player'', Norman made an instant impact in big-time football. First-grade selection was followed by representative honours for both City and NSW within three months. He wore the green and gold into one of the toughest Test series of all time in 1932, starring in the epic Battle of Brisbane, won 15–6 by Australia. Injury cost Norman his place in the 1933–34 Kangaroo squad, but he quickly regained his position for the 1935 New Zealand tour and became a regular in Australian sides until the intervention of the war. Norman was a member of the champion Eastern Suburbs sides which won three straight premierships and played 101 first-grade matches until his retirement in 1939. 16. Luke Ricketson (1991-2005) Son of former Easts player, Doug Ricketson, Luke started playing junior rugby league at the age of seven for Bondi United. He was then graded with Eastern Suburbs as a local junior and made his first-grade debut in 1991. In 1996, Ricketson made his representative debut when selected for City Origin. He played again for City in 1997 but had to wait until 1999 to make his State of Origin debut for NSW, coming off the bench in all three games in the first drawn series in Origin history. Ricketson played at lock for the Sydney Roosters in their 2000 and 2003 grand final defeats. He also played at lock in the Roosters 2002 Premiership win. In 2003, he was selected for the Kangaroo Tour where he played all three Tests against Great Britain and helped Australia retain The Ashes with a clean sweep. Ricketson retired from rugby league after the 2005 NRL season having played 301 games for the Roosters, the last season as captain. He played in five Tests for Australia and four for Ireland as well as 10 games for NSW and 3 for NSW City. 17. Barry Reilly (1966-1971, 1973-1979) Barry Reilly was known as ‘The Axe’ because of his defensive technique, which it was said allowed him to chop down opposition attackers like an axe. An Easts junior, he carved out a career as a wiry, lightweight backrower with a great work rate in defence.\n\nRelated The Best We've Ever Seen: Barry Reilly"}, {"url": "https://www.rugbyleagueproject.org/seasons/nswrfl-1977/eastern-suburbs/summary.html", "page_content": "Players\n\n* Greyed out numbers in the table below indicate that the corresponding data is incomplete.\n\nAge is sorted on both years and days. Other columns use player name as a secondary sort, or squad number if applicable.\n\nLegend\n\nRep = Representative Status\n\nApp = Starting Appearances\n\nInt = Interchange Appearances\n\nT = Try/Penalty Try\n\nG = Conversion/Penalty Goal\n\nFG = Field Goal/Drop Goal\n\nPts = Points\n\nB = 5/10 Minute Sin Bins\n\nS = Sendoffs"}, {"url": "https://www.roosters.com.au/history/timeline/1980-1989/", "page_content": "The 1980s proved to be a rollercoaster of a decade, which featured a Grand Final appearance, two Minor Premierships, Arthur Beetson's returning as Head Coach as well as a move into the revolutionary Sydney Football Stadium.\n\nUltimately, however, it proved to be a decade filled with plenty of 'what could have been' moments, with wavering results seeing a number of players come and go, with the Club infamously dubbed 'the transit lounge'.\n\n1980 - Grand Final Bound\n\nPlayed: 25 Won: 15 Lost: 8 Drawn: 2 Final Position: Runners Up\n\nWithout a recognised hooker in his squad, new fulltime Head Coach Bob Fulton enticed recently retired Queensland rake John Lang to make the move down to Sydney - which proved to be fruitful for all involved.\n\nThe season started poorly, with just four wins in the first six games, with a number of new faces including Lang, Noel Cleal and Paul McCabe adjusting to life in Bondi, while established stars struggled with form and injury.\n\nHowever, the side's time in the cellar was brief, as Easts came into a purple patch during the winter, including resounding wins against Canterbury (20-5), Manly (29-9), Wests (26-14) and Newtown (19-5).\n\nThe Roosters' scintillating form led them to the Minor Premiership after a 15-10 defeat of Balmain in the final round, but after a week's break, they were brought down to earth by a ruthless Bulldogs outfit 13-7 in the first week of finals.\n\nAfter a sluggish performance, the razor-sharp Tricolours dismantled Wests 41-5, earning them a second crack against Canterbury in their first Grand Final since 1975, but it wasn't to be as they were beaten 18-4 in a disappointing final result.\n\nDebutants: Barry Andrews, John Berne, Noel Cleal, Steve Hage, Paul McCabe, David Michael, John Lang, Greg Lane, Robert Lane, Steven Sydenham\n\n1981 - Falling Short Again\n\nPlayed: 24 Won: 16 Lost: 8 Drawn: 0 Final Position: Third\n\nTaking out their fourth pre-season title in eight years, hopes were bright for the Red, White and Blue heading into season 1981, with the disappointing of the previous year's Grand Final well behind them.\n\nWith Jack Gibson at the helm of Parramatta, the Roosters recorded three victories against their Western Sydney based opponents; the first in the pre-season final, then in Round 10 (15-7) and Round 21 (20-6).\n\nThe latter sealed the Roosters' second consecutive Minor Premiership with sixteen wins, but in a gripping contest against the Eels in the Major Semi, their opponents bested them in a 100-minute epic, 12-8.\n\nIn a bitterly disappointing ending to the season, the Tricolours were downed by Newtown in the Grand Final, in another 'what could have been' year for the men from Bondi.\n\nIn a positive end to the year, rookie Jeff Masterman, forwards Paul McCabe and Captain Royce Ayliffe made their Test debuts alongside Kerry Boustead and Terry Fahey, while Kevin Hastings claimed the Rothman's Medal and Dally M Halfback of the Year.\n\nDebutants: Ian Barkley, Dave Brown, Terry Fahey, Ron Giteau, Jeff Masterman, Jeff Fisher, Bruce Foye\n\n1982 - Expansion Continues\n\nPlayed: 29 Won: 17 Lost: 10 Drawn: 2 Final Position: Fourth\n\nThe competition expanded further to 14 teams with the addition of Canberra and Illawarra, and with it came an extended 26-round competition - which proved to be beneficial for the Red, White and Blue.\n\nFulton's side suffered a barrage of injuries in the early weeks, and after nine rounds they were anchored to the bottom of the table with just three wins but made an impressive turnaround from the brink.\n\nAlthough they succumbed to defeat to Manly 19-20 in Round 12, the performance set the side on a remarkable seven-match winning streak, beginning with a 55-15 demolition of newbies Canberra.\n\nA three-week period following may have only garnered a draw, but the Roosters were crowing at the right end of the year, and another winning streak saw them scrape into the finals in fourth position.\n\nEasts took care of Wests (11-7) and Norths (12-10) in two exhilarating and tight matches, but in the Preliminary Final, Parramatta dominated on the SCG quagmire.\n\nThe Roosters struggled particularly with the absence of Kevin Hastings to a broken foot, going on to lose 33-nil, and things looked to worsen with a lack of player re-signings and the imminent loss of Coach Bob Fulton - a mass exodus ensued.\n\nDebutants: Russel Gartner, Robert Thompson, Ricky Walford, Robert Cowie, Kevin Webb, Steve Collins, Allen Geelan, Warren McDonnell, Rick Hannan, Les Cleal, Earnie Garland, Grant Jones\n\n1983 - Freier's Club\n\nPlayed: 27 Won: 14 Lost: 12 Drawn: 1 Final Position: Sixth (Playoff Semi)\n\nWith nine top-line players from the previous season departing, an astounding 22 players made their first-grade debut in 1983, with a total of 39 taking the field under new Head Coach and former first-grader Laurie Freier.\n\nComing in with a fresh approach, Freier had the Roosters humming despite the lack of big-name stars and doubt from 'experts' and analysts alike, sitting in fourth position at the end of July with a month remaining before finals.\n\nUnfortunately for the new mentor, numerous incidents had taken their toll throughout the campaign, and a mounting injury toll contributed to a slide down the ladder, finishing tied in fifth position and forced into a Tuesday night playoff.\n\nJust over a month after disposing of St George 47-12 at Kogarah Oval, the Roosters were on the wrong end of a 44-16 thrashing and missed the finals for the first time since 1979.\n\nStill, there were plenty of positives from a year that saw plenty of change, including:\n\nFreier named Coach of the Year\n\nNew signing Mike Eden claiming the Rothman's Medal and breaking Dave Brown's 48-year Club record of most points in a year, finishing with 256\n\nMarty Gurr breaking Graeme Langland's record for most tries by a fullback with seventeen to his name\n\nAfter shifting to lock, Kevin Hastings made his long-awaited State of Origin debut for New South Wales from the interchange bench\n\nDebutants: Michael Eden, Peter Grounds, Alan Neil, Seamus O'Connell, Terry Regan, Mick Ryan, Tom Arber, Keith Farrelly, Graeme Atkins, Ron Gibbs, Ken Groves, Matt Cruickshank, Col Porter, Wayne McPherson, Craig Farrugia, James Cutler, Dale Garrett, Joe Fenech, Harold Salmon, Mick Fitzsimons, Stuart Davis, Darren Finlayson\n\n1984 - Unstable and Untenable\n\nPlayed: 24 Won: 5 Lost: 18 Drawn: 1 Final Position: Twelfth\n\nNewtown's departure from the top grade saw thirteen teams compete over 24 rounds, but that mattered little as Eastern Suburbs stumbled to their worst result since the infamous 1966 season.\n\nFollowing a strong 24-8 win over heavyweights Manly in the opening round, the Roosters lost their next five matches, before producing back-to-back victories over Norths (22-20) and Wests (54-6).\n\nBut as performances stagnated, support became hard to come by with crowds only usurping 5000 at the Sydney Sports Ground once over the year and star players spending time in and out of reserve grade.\n\nFive weeks from the competition's end, Freier was told his services were no longer needed, with Arthur Beetson instilled as the Club's Head Coach for 1985.\n\nIn contrast to the Premiership season, the Red, White and Blue paved through the mid-week National Panasonic Cup, narrowly defeated by a Wally Lewis-led combined Brisbane, 11-12.\n\nDebutants: Mark Beaven, Rowland Beckett, Paul Dunn, John Ferguson, Brett Gale, Scott Gale, David Greene, Dane Sorensen, Kurt Sorensen, Shane McKellar, Robert Simpkins, Steve Stone, Glenn Leggett, Tim Barnes, Kelvin Eirth, Steve Hardy, Mick Cupic, Gary Wurth, Mark Wheeler, Scott Bennett\n\n1985 - Coach Artie\n\nPlayed: 24 Won: 10 Lost: 11 Drawn: 3 Final Position: Seventh\n\nWith Club Legend Arthur Beetson at the helm came another influx of player arrivals and departures, while the administration of the Club took a significant change throughout the year, introducing the first fulltime secretary in Barry Van Heekeran.\n\nOn the field though, it was a tough season most notably with a broken arm to Kevin Hastings midseason, following a renaissance at hooker and as the side's Captain - his leadership was sorely missed as Beetson trialled six different skippers.\n\nA highlight of a disappointing season, though, came in Round 22 when the Tricolours took on the reigning Premiers in Parramatta.\n\nDown 4-20 just after the halftime break, the Roosters rallied with tries to Ron Gibbs, Gary Wurth and Wayne Challis getting on the scoreboard for what was, at the time, statistically hte greatest comeback in the Club's history.\n\nDebutants: Dean Bell, Olsen Filipaina, Hugh McGahan, Laurie Spina, Wilfred Williams, Wayne Challis, Mark Horton, Mike McLean, Wayne Portlock, Todd Riley, Jim Harvey, Terry Matterson, Brad Tessmann, Col Dreier, Mick Alchin, Corey Adams, Lindsay Johnston, Richie Douglas\n\n1986 - Nomads of the NSWRL\n\nPlayed: 24 Won: 10 Lost: 14 Drawn: 0 Final Position: Ninth\n\nMore departures in the form of Paul Dunn, John Ferguson and Ron Gibbs along with a handful of players who featured in first grade saw the introduction of Trevor Gillmeister, David Trewhella, Brian Battese, Tony Melrose, David French, Gary Prohm and Trevor Paterson - but of growing concern was the Club's inability to lure top-end players.\n\nWith the competition looking to expand at the end of the decade with the likes of Newcastle and Brisbane pushing for a team, for the first time Easts were identified by the media as being 'on death row' - however, with the financial stability of the Club, it was a criticism that was far from warranted.\n\nIn 1986, with the development of the Sydney Football Stadium, the Roosters took home games around to the Sydney Cricket Ground, Parramatta Stadium and Orana Park in Campbelltown in the most nomadic season since the Club's foundation years.\n\nOn June 29, the Club played its final match at the Sydney Sports Ground, holding off a fightback from North Sydney and claiming a famous 21-14 victory, with Gary Wurth starring with a hat-trick in the first 22 minutes.\n\nHalfback Kevin Hastings broke Barry Reilly's record for most caps in the Red, White and Blue, and became the first Rooster to claim 200 first-grade games against Western Suburbs.\n\nWhile the first grade failed to make the finals, Jim Morgan's reserve grade side surprised Minor Premiers Parramatta to win the Grand Final 10-2 in their first title since 1949.\n\nDebutants: Brian Battese, David French, Trevor Gillmeister, George Katsogiannis, Tony Melrose, David Trewhella, Trevor Paterson, Craig Salvatori, Luke Beasley, Paul Matterson, Dean Bailey, Ron Griffen, Gary Prohm, Brian Johnson, Carlos Parra, John Thomas, Brendan Hall, Steve Keir, Mark McDonnell\n\n1987 - Surprise Packets\n\nPlayed: 27 Won: 16 Lost: 10 Drawn: 1 Final Position: Third\n\nDespite no major signings or changes to the side for 1987, coach Beetson was confident in his side's ability as the league looked to expand, with player movement looking to take an upswing during the year with three new sides confirmed for 1988.\n\nThe loyalty from their mentor proved to be a catalyst in the side's reversal in fortunes, as they rocketed up the ladder to throw out a credible challenge to the likes of Parramatta, Canterbury-Bankstown and Manly-Warringah.\n\nBy the time the finals series had rolled around, both Grand Finalists from 1986 had fallen away, while Easts emerged as Manly's main threat with their first consistent season since 1982 - displaying an uncanny ability to win close contests.\n\nThe 1987 Roosters took out seven games by five points or less, as well as a 12-all draw with Balmain, but reserved their best performance against the Sea Eagles, breaking their twelve-match streak with a 26-16 victory after leading 26-nil.\n\nStill on their nomadic tour at Henson Park, the SCG and Parramatta Stadium, Eastern Suburbs finished second on the ladder before disposing of Canberra in the major preliminary final, before being denied by Manly 10-16 in the semi.\n\nBut the well-balanced team couldn't compete against the Raiders in the major preliminary final, going down 32-24, but with the likes of Trevor Gillmeister, Hugh McGahan, Steve Morris and halves Laurie Spina and Brendan Hall in fine form, plenty expected the side to go one better in 1988.\n\nThe season was also the final one for talisman Kevin Hastings, who finished his career in Red, White and Blue after 228 games of first-grade, holding the Club's appearance record for fifteen years.\n\nDebutants: John Richards, Steve Morris, Tony Rampling, Paul Danes, Peter Johnston, Kurt Sherlock, Ron Ryan, David Smith, Brad Tassell, Danny Shepherd, Joe Lydon, Russell Bartlett\n\n1988 - The Home of the Future\n\nPlayed: 22 Won: 6 Lost: 13 Drawn: 3 Final Position: Twelfth\n\nThe rapidly growing competition added three more teams - and for the first time expanded outside of New South Wales for the first time with Newcastle, Brisbane and Gold Coast coming in for a total of sixteen clubs.\n\nAfter over half a century at the Sydney Sports Ground, the renovations were complete for the brand-new 40,000-capacity Sydney Football Stadium, and following the addition of rugby international Brett Papworth along with the return to Moore Park, the Roosters were instilled as early favourites.\n\nUnfortunately, however, injuries and troubles adjusting to the heavy rain on the opening night at their new home, saw the side's lofty goals diminished in a matter of weeks, with just a single victory in the first ten rounds.\n\nFollowing four seasons at the helm, which saw him slow down the Club's recruitment policy and take the side to one game within a Grand Final, Arthur Beetson stood down from his position with six weeks remaining with his Premiership-winning teammate Russell Fairfax taking over.\n\nDebutants: Gary Bridge, Wayne Marshall, Brett Papworth, Jason Williams, Darren Blythe, Bill Dart, Kevin Duckett, John Elias, Cam Cherry, Dean Clark, Pat Jarvis, Adrian Sligar, Rob McClusky, Dennis Beecraft, Rod Silva, Rodney Thomson\n\n1989 - Revolution Afoot?\n\nPlayed: 22 Won: 9 Lost: 12 Drawn: 1 Final Position: Eleventh\n\nWhile the Club's on-field fortunate showed little sign of improvement under new coach Russell Fairfax, moves of a power shift at board level were underway, with fans looking for a change in the Roosters' recruitment policies.\n\nA paper titled 'Resurrecting the Roosters' pitched by former player Bill Healey identified major problem areas and ways the Club could improve their positioning - with a focus on management and administration which suggested the appointment of a fulltime chief executive and football manager.\n\nOn the field, the Tricolours laboured through the season with a 9-12 record including a solitary draw, with star signing Brett Papworth's luck eluding him as injuries and form saw him ruled out of the season.\n\nThe sleeping giants of the competition won opening games against Souths and St George, and despite the mid-season arrivals of exciting Englishmen Martin Offiah and Joe Lydon, but ultimately were unable to reach their potential and the semi-finals.\n\nWhile a late surge of five wins from their final nine matches gave supporters hope for 1990, ultimately it would prove to be another under achievement for the Club.\n\nDebutants: Sandy Campbell, Michael Cook, Paul Mares, Geoff Sharpe, Mick Delroy, Steve Georgallis, Martin Offiah, Paul Culnane, Paul James, Tim Dwyer, Col Fraser, Steve Deacon, Brett Gillard, Warren Crompton, Anthony Totten"}, {"url": "https://rugbyleagueopinions.com/greatest-sydney-eastern-suburbs-roosters-team-13/", "page_content": "Sydney Roosters: All-Time Greatest XIII\n\nThe Sydney Roosters are one of the oldest and most successful rugby league clubs in Australian history. Known as Eastern Suburbs for the majority of their existence, they were a foundation club of the New South Wales Rugby League (NSWRL) when it formed in 1908.\n\nThe tri-colours have have won 13 NSWRL/NRL premierships in their history, placing them behind only the South Sydney Rabbitohs (21) and St George-Illawarra Dragons (15).\n\nThey have had some brilliant players over the years; some that I have really struggled to leave out.\n\nPlayers like the legendary 1930s halves pairing of Ernie Norman and Viv Thicknesse, who won three consecutive premierships in a great era for the club – the Roosters lost just one match during those three seasons! Lock Andy Norval is another from that era who has a strong case for inclusion, though I have included three of their teammates.\n\nThere are also legends from the club’s champion 1974 and 1975 premiership teams like fullback Russell Fairfax, winger Ian Schubert, centre and dual international John Brass, as well as noted defender Barry “Bunny” Reilly (second row). You could mount a great argument to include any of those players, along with their four teammates that I have actually chosen.\n\nI also couldn’t find a spot for more recent club great Luke Ricketson, who was a key member of the dominant sides from the early 2000s.\n\nNone of the players I’ve mentioned above would be out of place in this side. In the end, though, I think that the players I’ve chosen achieved more success for the Roosters over a longer period, or were more influential individually in the teams they played in.\n\nThe stats I’ve listed for each player only include their performances for the Roosters, not for any other clubs or in rep matches.\n\nFullback: Anthony Minichiello\n\n302 matches (2000-14), 139 tries.\n\nThe current record-holder for the most games and most tries for the Roosters, Anthony Minichiello was a constant threat in attack, safe under the high ball and solid in defence. In 2005, he won the Golden Boot Award, being voted as the best player in the world. ‘Mini’ won two premierships with the Roosters during his fifteen loyal seasons, including captaining the side to victory in 2013. He also showed a lot of courage in coming back from a serious back injury later in his career.\n\nWinger: Dally Messenger\n\n48 matches (1908-13), 21 tries, 159 goals.\n\nDally Messenger was a rugby union international and one of Easts’ key signings for their debut season in 1908. He helped rugby league gain publicity in Australia in the early years. Messenger won three premierships with the Roosters, was the season’s leading point-scorer on three occasions, and was the inaugural captain of the Australian Rugby League Test team. The Dally M Medal that is awarded to the best player in the National Rugby League today is named in his honour.\n\nCentre: Dave Brown\n\n94 matches (1930-36, 1939-41), 93 tries, 194 goals.\n\nDave Brown broke so many records during his career that he became known as “the Bradman of league”. Some of those records still stand today, like the 38 tries he scored in the 1935 season, as well as the 45 points he scored in the first match of that same year against Canterbury. Those 45 points included 15 goals (another record that hasn’t been broken) and five tries (which were worth three points then – so it would actually be 50 points for the match using today’s four point value for a try!).\n\nBrown was the lynchpin in one of rugby league’s all-time greatest backlines. His phenomenal strike rate of 93 tries in 94 matches for the Roosters shows just how dangerous he was. He won two premierships with Eastern Suburbs and captained Australia in Test matches during his career at the club.\n\nRead More: Australian Rugby League’s Greatest Centres\n\nCentre: Mark Harris\n\n190 matches (1970-79), 88 tries.\n\n1970s flyer Mark Harris was an unusually big centre for his era, and he used that size to full effect, especially in attack. He played in the Roosters’ legendary 1974/75 grand final-winning teams, and represented Australia at two World Cups.\n\nHarris was also a gridiron trailblazer long before Jarryd Hayne was even born. He unsuccessfully trialled for the Philadelphia Eagles in the NFL in 1973, but was picked up by a Canadian team and played several matches in their league during one season before returning to the Roosters.\n\n\n\nWinger: Bill Mullins\n\n190 matches (1968-78), 104 tries.\n\nEven though modern-day wingers tend to be big and fast like Bill Mullins was, most opponents in his era were much smaller. Mullins used his remarkable athleticism to become the first Roosters’ player to score 100 career tries. He played in the Roosters’ 1974 and 1975 premiership teams, scoring a try in the ’74 decider against Canterbury. His son Brett Mullins later had his own successful career at Canberra and the Roosters, winning premierships with both clubs.\n\nFive-eighth: Brad Fittler\n\n217 matches (1996-2004), 91 tries.\n\nAfter starting his career at Penrith in the late 1980s, Brad ‘Freddy’ Fittler joined the Roosters as a marquee signing in 1996. He quickly showed his class and won the Rothman’s Medal (the equivalent of today’s Dally M Medal for the best player in the competition) in 1997. Fittler had one of the best steps in the game, which, combined with his size, made him a major attacking threat. He captained the Roosters to a premiership in 2002, steered New South Wales to several State of Origin series wins and led Australia to a World Cup victory during his time at the club. His influence was such that he is widely considered among the best five-eighths of all-time.\n\nHalfback: Kevin Hastings\n\n239 matches (1976-1987), 49 tries.\n\nKevin “Horrie” Hastings was the heart and soul of the Eastern Suburbs Roosters during the late 1970s and early 1980s. A brilliant organiser and very physically fit, he was the first player to reach 200 first grade games for the club. He won the Rothman’s Medal in 1981 and was voted the Rugby League Week Player of the Year in 1980, 1981 and 1982. The Kevin Hastings Stand at the Sydney Football Stadium is named in his honour.\n\nProp Forward: Ray Stehr\n\n182 matches (1929-1946), 19 tries.\n\nRay Stehr was a tough prop who overcame a spinal issue as a child to make his first grade debut for the Roosters at just 16! He was part of a dominant Roosters’ forward pack during their golden era in the 1930s when they went through three seasons losing just one match. Stehr won five premierships with the club, captaining the team in their 1940 and 1945 grand final wins, and is considered one of rugby league’s greatest ever front rowers.\n\nHooker: Sandy Pearce\n\n156 matches (1908-21), 9 tries.\n\nSandy Pearce was the Roosters’ inaugural hooker, winning three premierships with the club as they established themselves as a force in the early years of Australian rugby league. He was the first player to reach the 100 game milestone for the tri-colours, as well as the first in Australian rugby league history to notch up 150 top grade games. He also represented New South Wales and Australia for most of his career.\n\nProp Forward: Arthur Beetson\n\n131 matches (1971-78), 17 tries.\n\nArthur Beetson was named as the seventh rugby league immortal in 2004. He had brilliant ball skills and his ability to offload, despite the attention of several defenders, became legendary. ‘Big Artie’ also had good speed for a man of his size and was a strong, tough defender. He captained the Roosters’ premiership-winning teams in 1974 and 1975 and was named the Rugby League Week Player of the Year in 1974. While at the Roosters, he also became the first Indigenous player to captain Australia.\n\nHe was the best forward I’ve ever seen in my lifetime\n\n– Queensland great Chris Close on Arthur Beetson\n\nSecond Row Forward: Joe Pearce\n\n147 matches (1929-42), 34 tries.\n\nJoe Pearce was another member of the Roosters’ dominant forward pack in their golden era during the mid 1930s. Noted for his ball-playing ability, Pearce won four premierships with Eastern Suburbs and is considered by many to be one of the greatest second-rowers of all-time. He was also the son of the Roosters’ legendary hooker Sandy Pearce. They became the first father and son in rugby league history to be selected to represent Australia during their respective careers.\n\nSecond Row Forward: Craig Fitzgibbon\n\n228 matches (2000-2009), 36 tries, 655 goals.\n\nThere have been a lot more flashy players than Craig Fitzgibbon for the Roosters over the years, but few who were able to do their job so effectively in both attack and defence. Extremely physically fit, Fitzgibbon had a phenomenal workrate and was also a great goal-kicker. He remains second on the all-time list of point-scoring forwards in rugby league history with 1604. Fitzgibbon won the Clive Churchill Medal in the Roosters’ 2002 grand final win over the New Zealand Warriors, and had successful Origin and Test careers while at the club.\n\nLock Forward: Ron Coote\n\n108 matches (1972-78), 39 tries.\n\nRon Coote had already established himself as a South Sydney legend before joining the Roosters in 1972. The rangy lock was at the height of his career and continued his phenomenal success with the tricolours. He formed a great combination with Artie Beetson, with the sight of Coote running off a Beetson pass becoming as well known as his brilliant cover defence. Coote was a key member of both the 1974 and 1975 Roosters’ premiership teams, and continued to play for Australia for several years after joining the club.\n\n\n\nSo that’s my opinion for the Sydney Roosters’ all-time greatest 13. What are your thoughts and how do you think the Roosters’ greats would stack up against South Sydney’s greatest line-up?\n\n6"}, {"url": "https://www.roosters.com.au/news/2022/01/21/home-sweet-home-a-history-of-roosters-home-grounds/", "page_content": "Since 1908, Moore Park has been the spiritual home of the Sydney Roosters - and with the brand-new Sydney Football Stadium nearing completion, it's only appropriate that we take a look back on the venues that we have proudly called our home.\n\nFull-Time Home Grounds:\n\nThe famous venues which have been synonymous with the Club since 1908, there are a handful of iconic grounds which the Roosters have been based.\n\n*Statistics in tables contain information regarding the Club's record at each venue as the home side - including finals matches and Grand Finals.\n\nRoyal Agricultural Society Showground: 1908-1920, 1926-1930\n\nThe Club's inaugural home ground, Eastern Suburbs played all but two of their home games in 1908 at the 'Ag' - which continued to host games regularly until 1921, when the side moved to the Sydney Sports Ground.\n\nAlternating between the two venues as their home base for the majority of the 1910s and 1920s, Easts would play their final match (albeit an away fixture) at the Royal Agricultural Society Showground in 1930, defeating North Sydney in a 43-11 thumping.\n\nThe venue also fielded the first-ever night game in Australia on December 22, 1928 in an exhibition match between Easts and Souths.\n\nPlayed: 71 Won: 53 Lost: 16 Drawn: 2 Winning Percentage: 75%\n\nSydney Sports Ground: 1911, 1921-1925, 1930-1976, 1978-1986\n\nThe home venue of the Club for the majority of the 20th century, the Sydney Sports Ground is revered by the rusted-on Roosters fan who passionately waved their Red, White and Blue flags on the famous hill until 1986.\n\nOne of the only venues without the rock-hard surface of a cricket pitch torn through the centre, the Sports Ground was first adorned by Tricolours in 1911, before becoming the Club's permanent base from 1930 onward.\n\nNoted for its dirt track around the perimeter which hosted the speedway, the Sports Ground had the unique distinction of running east to west - which caused plenty of havoc for opposition wingers and fullbacks with the gleaming rays of the sun affecting the visibility of catchers.\n\nThe final match at the famous old venue was on June 29th, 1986, with the Eastern Suburbs Roosters defeating the North Sydney Bears 21-14 in front of 8,175 spectators - one that Easts fans still recall fondly to this day.\n\nPlayed: 425 Won: 248 Lost: 162 Drawn: 15 Winning Percentage: 58%\n\nSydney Football Stadium: 1988-2018, 2022-Present\n\nWhile the early years of the Sydney Football Stadium had its fair share of issues and lopsided results, the venue quickly became synonymous with the Sydney Roosters' successes through the 1990s and 2000s.\n\nBuilt upon the site of the old Sydney Sports Ground, the Roosters took the stage at the then-world-class Sydney Football Stadium in 1988; and while early results were not favourable, the stadia soon became one of the great venues of Rugby League for the next three decades.\n\nSign up for a free NRL Account to access this video and other exclusive content. Sign Up Already have an NRL Account? Log In Not sure? Learn more about an NRL Account .\n\nAfter over 200 games, the Roosters farewelled the SFS in the best way possible - with a Preliminary Final victory over arch-rivals South Sydney en route to the 2018 Premiership.\n\nIn 2022 the Club will return to the brand-new SFS in the latter part of the season, with plenty of new memories to be etched in the hearts and minds of Roosters Members and supporters alike.\n\nPlayed: 339 Won: 210 Lost: 123 Drawn: 6 Winning Percentage: 62%\n\nSydney Cricket Ground: 1913-2022\n\nWhile the hallowed Sydney Cricket Ground has been a neutral home ground for many clubs since 1908, particularly with the old 'match of the round', the Roosters took base at the famous venue in 2019, with immediate results.\n\nThe Tricolours won all but one match at the SCG in 2019, with another Premiership in tow, and as of the end of 2021, the Roosters have won 18 of their 23 matches at the ground, averaging 30 points per game with more than 40 points scored on seven occasions.\n\nEasts also held home games at the venue in 1977 as they looked to gain an advantage during the semi-finals (as every finals game was played at the SCG). Hosting twelve games, the Roosters won nine matches with two losses and a draw, however quickly reverted back to the Sports Ground.\n\nOnly a handful of seasons since 1913 have seen the Club not host matches at the venue prior to the Sydney Football Stadium opening, including 1929-1934, 1948-1949, 1954-1956, 1959, 1962-1966, 1969, 1971 and 1983.\n\nBetween 1988 and 2019, the Roosters played three matches at the SCG, one in 1999, 2006 and 2010, while the Club proudly recorded its 300th overall victory at the ground in 2019.\n\nThe Club recorded the highest-ever Rugby League score in their final match at the venue in Round 23, 2022 - a 72-6 demolition job of the Wests Tigers.\n\nPlayed: 197 Won: 139 Lost: 49 Drawn: 9 Winning Percentage: 71%\n\nPart-Time Home Grounds:\n\nWhether it be for just a few games or the duration of the season, the Roosters have expanded the reach of Rugby League across Australia by taking home games to notable part-time venues.\n\nHenson Park: 1987, 1989-1990\n\nWith renovations underway at the soon-to-be Sydney Football Stadium, Easts took eight games in 1987 to Henson Park in Marrickville - the home of former NSWRL side the Newtown Jets.\n\nAlthough there was a consideration of playing at the local ES Marks Athletics Field in Kensington, the Club's record while at Henson was strong, winning all but two matches at the venue (including their first six). The exciting Easts side would go on to finish the season in second position under Arthur Beetson, going all the way to the preliminary final.\n\nDespite calling the Sydney Football Stadium home from 1988, the Roosters took further matches to Henson Park in 1989 and 1990, winning their final match at the venue 16-11 against Cronulla.\n\nUp Next / Cancel Replay Play Next The New Sydney Football Stadium From a View\n\nPlayed: 17 Won: 10 Lost: 7 Drawn: 0 Winning Percentage: 58%\n\nTrumper Oval: 1915, 1934, 1939, 1941\n\nAlso known as Hampden Oval, this venue played host to a number of Eastern Suburbs matches in the first half of the 20th century, when not playing the match-of-the-day at the Sydney Cricket Ground or if the Sports Ground was unavailable.\n\nBased in the Club's heartland in Paddington, Easts played ten home matches at Trumper Oval, with four in 1915, four in 1934 and one each in 1939 and 1941.\n\nThe side enjoyed a winning record at the venue, taking out nine of their twelve matches, which included thumping wins over Annandale (32-3) and North Sydney (35-4) in 1915, as well as a 40-11 victory against University in 1934.\n\nPlayed: 12 Won: 9 Lost: 3 Drawn: 0 Winning Percentage: 75%\n\nCentral Coast Stadium: 2004-2011, 2015-2019, 2021-present\n\nSince 2004 the Sydney Roosters have taken consistent home games to Gosford, and with the Club's pathways entrenched on the Central Coast, the relationship continues to grow stronger with each passing year.\n\nShooting out of the blocks with two wins in 2004 and 2005, the side's fortunes waned, and while games were temporarily held elsewhere from 2012-2014, the Tricolours returned to host annual matches from 2015, with a much greater rate of success - including the 44-16 thumping of Canberra in 2021 and the 54-18 demolition of St George Illawarra in 2022.\n\nUp Next / Cancel Replay Play Next Round 12 Match Highlights: Roosters v Raiders\n\nPlayed: 17 Won: 7 Lost: 10 Drawn: 0 Winning Percentage: 41%\n\nWentworth Park: 1926-1929\n\nOne of the pioneering Rugby League grounds in Australia, Wentworth Park - situated between Glebe and Ultimo - was commonplace for clubs to take neutral home games to throughout the formative years of the code's existence.\n\nEasts did so from 1926-1929, with games against University (who never formally had a home ground), Newtown and North Sydney, before opting to take matches elsewhere in closer proximity to the Club's heartland.\n\nPlayed: 6 Won: 2 Lost: 4 Drawn: 0 Winning Percentage: 33%\n\nAdelaide Oval: 2017-2019\n\nThe City of Churches was the Club's 'home away from home' from 2017-2019, taking on fierce rivals the Melbourne Storm in all three annual contests during the period.\n\nAll three matches were tightly fought contests, with one point separating the sides in the opening two games while the third was decided by just a penalty goal.\n\nUp Next / Cancel Replay Play Next Highlights | Roosters v Storm 2017\n\nA Mitchell Pearce field goal handed the Tricolours a memorable victory in 2017, and while the Storm overcame the hosts in the other two matches, it mattered little as Easts claimed back-to-back Premierships in 2018 and 2019.\n\nPlayed: 3 Won: 1 Lost: 2 Drawn: 0 Winning Percentage: 33%\n\nParramatta Stadium: 1986, 1997\n\nWith the development of the Sydney Football Stadium underway, the Roosters sought refuge on a handful of occasions at Parramatta Stadium in 1986.\n\nThe Red, White and Blue took on the Balmain Tigers and Illawarra Steelers that year, winning both matches 16-6 and 22-20 respectively.\n\nOver a decade later in 1997, the Roosters hosted the Gold Coast Chargers in the second week of finals at the venue, with the Brad Fittler-led side progressing after a 32-10 victory.\n\nUp Next / Cancel Replay Play Next Highlights | Roosters v Rabbitohs\n\nPlayed: 3 Won: 3 Lost: 0 Drawn: 0 Winning Percentage: 100%\n\nCommbank Stadium: 2020\n\nThe restructuring of the NRL schedule due to covid-19 restrictions saw the Sydney Roosters forced to take three home games from the Sydney Cricket Ground to Commbank Stadium in western Sydney in 2020.\n\nThe Tricolours took on Souths, Parramatta and St George Illawarra and recorded three comprehensive victories on each occasion, overcoming a 0-2 start to the season before returning to the SCG as they propelled towards the top four for the fourth consecutive season.\n\nPlayed: 3 Won: 3 Lost: 0 Drawn: 0 Winning Percentage: 100%\n\nNorth Sydney Oval: 1932, 1944\n\nOne of the most picturesque Rugby League grounds in the country had three matches with the Red, White and Blue as the hosts.\n\nThe Sid Pearce led side thumped locals Norths in their first home match at North Sydney Oval 29-9, before narrowly going down to Souths 23-26 in Round 7 of 1944.\n\nWith the North Sydney Bears now the Club's affiliate in the NSW Cup, plenty of Roosters youngsters make their way through the grades playing amongst the iconic fig tree.\n\nPlayed: 2 Won: 1 Lost: 1 Drawn: 0 Winning Percentage: 50%\n\nRedfern Oval: 1948, 1950, 1966\n\nMany will be understandably surprised to see Redfern Oval listed as an Eastern Suburbs home ground - but the venue known as our arch-rival's old stomping ground was hosted by the men from Bondi in four matches in the mid-20th century.\n\nEasts hosted Norths in Round 8 of 1948 at Redfern, claiming a solid 22-6 scalp, while they took on Balmain (10-3) and oddly enough regular hosts South Sydney (12-23) in 1950.\n\nRound 2 of the infamous 1966 season saw the Tricolours host the Tigers at the venue, going down narrowly 17-23 - which would prove to be the Club's final home game on Chalmers Street.\n\nPlayed: 4 Won: 2 Lost: 2 Drawn: 0 Winning Percentage: 50%\n\nPratten Park: 1931, 1933, 1935, 1947\n\nOriginally Western Suburbs' home ground, Easts held a handful of matches at the venue located in Ashfield in Sydney's inner west.\n\nThe Tricolours hosted five matches at the venue including a 65-10 thumping of newcomers Canterbury in 1935, with three contests against the competition's nomads in University.\n\nThe Club last hosted match at the venue was in 1947 against Newtown, while the last match at the venue came against hosts Western Suburbs in 1967.\n\nPlayed: 5 Won: 3 Lost: 2 Drawn: 0 Winning Percentage: 60%\n\nStadium Australia: 2000, 2002, 2004, 2013, 2018-2019\n\nSince 1999 Stadium Australia has been host to the NRL Grand Final, with the Roosters hosting and lifting the Premiership trophy on numerous occasions.\n\nHowever, Easts also opened the new millennium at the venue in Round 1, 2000 against Parramatta with over 60,000 Members and supporters witnessing the Roosters overcome a 12-point half-time deficit to claim a memorable 20-16 victory.\n\nUp Next / Cancel Replay Play Next Round 1, 2000 Flashback: Roosters vs Eels\n\nAnother occasion where the side took a home game to Homebush was another unforgettable match - this time being the 2004 Preliminary Final victory against North Queensland which saw Ricky Stuart's side reach their third consecutive decider.\n\nThe 2002, 2013, 2018 and 2019 NRL Grand Finals were also hosted by the Tricolours, all of which saw the Roosters lift the Premiership trophy - with a 100% record at the venue as a home ground.\n\nPlayed: 6 Won: 6 Lost: 0 Drawn: 0 Winning Percentage: 100%\n\nSuncorp Stadium: 2019, 2021-22\n\nWith the introduction of the NRL's Magic Round, the Roosters have hosted multiple matches at Brisbane's Suncorp Stadium for the event.\n\nSign up for a free NRL Account to access this video and other exclusive content. Sign Up Already have an NRL Account? Log In Not sure? Learn more about an NRL Account .\n\nTrent Robinson's men defeated eventual Grand Final opponents the Canberra Raiders in the 2019 edition in a high-scoring 30-24 victory, with another win over the North Queensland Cowboys (30-18) in 2021 in a similarly enthralling match.\n\nThe Club also hosted two more matches at the venue that season as the NRL relocated to southeast Queensland, against Grand Finalists Penrith and South Sydney respectively.\n\nIn 2022 Magic Round returned and the Roosters continued their winning run during the Rugby League festival, with a high-scoring thriller against the Parramatta Eels, claiming a 31-24 victory.\n\nPlayed: 5 Won: 3 Lost: 2 Drawn: 0 Winning Percentage: 60%\n\nOne Game Wonders:\n\nWhether it be inaccessibility to traditional home grounds, or to promote the game of Rugby League around the country and world, the Roosters have a proud history of taking singular home games elsewhere.\n\nMetters Sports Ground (adjacent to Erskineville Oval) held a match in 1910 between Eastern Suburbs and Annandale, while the two teams took the field on Sydney Cricket Ground No.2 (adjacent to the Sydney Cricket Ground) ten years later in 1920.\n\nUp Next / Cancel Replay Play Next Round 23 Match Highlights: Roosters vs Dragons\n\nIn 1927 Easts played an exhibition match at the Sydney Showground against Southern Division, and a few years later in 1933 at Marrickville Oval against University.\n\nThe 1945 State Championship against Wests Newcastle was held at Erskineville Oval, while it would take nearly another half-century until the Club took one-off home games away.\n\nTownsville Sports Reserve saw the Roosters take on the Bulldogs in Round 6 of 1990, resulting in a 12-all draw, before hosting the Raiders and Knights in 1993 at the WACA in Perth and at Carlaw Park in Auckland respectively.\n\nThe Tricolours travelled to Darwin at Richardson Park against the Western Suburbs Magpies in 1995, before taking the Sea Eagles to Komazawa Olympic Park Stadium in Tokyo for an exhibition match in 1996.\n\nThe final 'home away from home' match in the 1990s was at Eric Weissel Oval in Wagga Wagga, where the Roosters defeated the Gold Coast Chargers 34-16 in Round 23 of 1998.\n\nIt wasn't until 2012 where the Club decided to host a match at TIO Stadium in Darwin against the North Queensland Cowboys, while Leichhardt Oval was the venue that saw the side take on Manly in Round 2 of the 2020 NRL Premiership due to the covid-19 Pandemic.\n\nWith the NRL relocating to Queensland for the back half of the 2021 season, the Roosters hosted matches in Newcastle, Sunshine Coast, Mackay, Toowoomba and Townsville which generated so much success that the Club has opted to return in season 2022."}, {"url": "https://www.roosters.com.au/news/2021/05/13/the-rooster-revolution-how-easts-found-their-emblem/", "page_content": "Rugby League has garnered some of the most unique team mascots, emblems and logos in Australian sport, and this of course includes the Sydney Roosters.\n\nFrom 1908-1966, Eastern Suburbs were affectionately known as the Tricolours referring to the Red, White and Blue striped jerseys the team ran out in – colours that are still proudly worn to this day.\n\nWhile several clubs like Newtown and Glebe opted to wear crests on their jerseys, Easts wore plain jerseys that did not feature any logos.\n\nSo where did the Rooster come from exactly? Well, there are three reasons behind the Rooster Revolution...\n\nThe French Connection\n\nThe most popular - and official - story of how the Rooster became Easts' emblem also goes hand in hand with the Club's iconic jersey.\n\nAn official Club Statement in 1954 announced that the team would be moving on from the striped Tricolours jersey to a brand-new design, modelled on the same one that the French national team wore at the time:\n\nThis coming 1954 season will see the players in a new style of jersey, fashioned mainly on the French jersey, with a few embellishments, but still retaining the colours of red, white and navy blue. Knickers will be white in lieu of blue whilst the socks will be hooped on the same pattern as the arm of the jersey.\n\nClub Legend Ferris Ashton and teammate Col Donohoe were the catalysts for the change after the pair toured France in 1952 with the Kangaroos. In 2007, Ashton recalled the decision to give the players a new look:\n\n“Col and I had been in France with the Kangaroos in 1952 and had noted the French jumpers and how the colours were interwoven. With the old Easts Tricolour jumper it became very hard to distinguish the colours towards the end of the season after repeated washings – and especially so if it had been a year like 1950 when it rained for the whole season. So Col and I had the bright idea of suggesting the change of jumper with the major use of the navy blue, with the ‘V’ and the red and white. It was a case of moving with the times and other clubs had done it, and because Col and I were on the committee we got the change through. There was a mixed reaction – and especially so from the old traditional Easts ‘sun-risers’.”\n\nBut that still doesn’t answer as to why Easts became the Roosters...but there’s a simple reason for that.\n\nThe Club took further influence from the French by adopting the Rooster moniker emblazoned on their jerseys. The French team were referred to as ‘Les Chanticleers’ – roughly translating to ‘a proud and fierce rooster who dominates the barnyard’ – an appropriate mascot for a team playing Rugby League.\n\nRising With The Sun\n\nWith the Club's origins in the Eastern Suburbs, and with the sun rising in the east, coinciding with the Roosters' crow at dawn, having it as the Club mascot seems like an obvious choice.\n\nFurther evidence of this connection is seen with Ashton’s reference of the older Easts supporter base being known as ‘sun-risers', and until the 1970s The Rugby League News magazine often referred to Easts 'From Where The Sun Rises'.\n\n‘Easts Chasing Birds’\n\nIn a news item tucked away in the Rugby League News, June 4, 1967, under the heading ‘EASTS CHASING BIRDS’ lies a third story that is not as well-known as the other two.\n\nThe story reads like this:\n\n‘Easts have been taken under the wing of Ingham Enterprises through the interest shown in the side by well-known sportsmen Messrs Bob and Jack Ingham. The firm has given a trophy worth $100 plus $400 cash for the best Tricolour player of the season. In addition, there will be a weekly gift of a dozen roosters for the best players in the three grades.'\n\nAlthough the Club had been known as the Roosters since the beginning of that season, this only popularised the term we know today, and while the jersey change had been made in 1954, the Rooster still wouldn't make its first appearance on the jersey until the late 1960s...\n\nVive la Révolution – Easts to Win (1967-1977)\n\nAfter a winless season in 1966 - the lowest point in the Club’s esteemed and proud history - revolution was afoot in 1967.\n\nOn the 20th of December, 1966 at 6pm, it was decided that the Eastern Suburbs District Rugby League Football Club would adopt the Rooster as its official emblem according to the Minutes of Board Meetings of Eastern Suburbs Leagues Club.\n\nAfter general discussion re an emplem (sic) for the Club it was moved by Mr. C. Steel and seconded by Mr. L.Hedger that the Rooster, as worn by the French Rugby League Team be adopted by the Eastern Suburbs' Leagues' Club for its official emblem. This was Carried Unanimously.\n\nFormer Easts player Jack Gibson was appointed head coach, and the Club adopted their first logo; a Red, White and Blue coloured Rooster atop of a football, which read the now-famous phrase ‘Easts To Win’ to instigate a prosperous season after a dismal 1966. The Eastern Suburbs Leagues Club coincided with their re-opening in Bondi Junction by introducing the logo.\n\nGibson would go on to lead the Roosters to the finals for the first time in seven years, and in 1968 the men from Bondi ran out with the famous Rooster crest adorning the jersey, much to the fanfare of the Easts faithful, with a slight variation to the Leagues Club's version.\n\nAlthough the Eastern Suburbs Leagues Club had adopted the Rooster, the rest of the Rugby League world spent some time adjusting to it, with the first instance in 'Rugby League News' magazine found in January 1969 on a small news item labelled \"ROOSTERS\" BEGIN TO CROW, which states:\n\nEasts' new glamour will attract other players - indeed, already there have been transfers of up-and-coming players eager to try out with the Roosters.\n\nSponsorship and Refinement (1978-1994)\n\nWith Rugby League continuing to grow and expand in the 1970s, the Roosters would follow suit, revolutionise the game, and open new horizons for the code.\n\nThe Roosters created history by becoming the first Club in Australian sport to have a front of jersey sponsor in 1976, with City Ford emblazoned on what is now considered to be an iconic jersey of Rugby League.\n\nIn 1977, the NSWRL introduced a properties division, with every club's logo re-designed and trademarked by the following year. This time, the logo featured a Red coloured Rooster on a White background bound by a Blue shield with ‘EASTERN SUBURBS’ displayed on the top of the crest.\n\nThe popular logo was featured on the jersey for seventeen seasons between 1978-1994, and a simplified version solely featuring the Rooster is currently used as the Club’s secondary logo, shown primarily on merchandise items and in a commercial capacity.\n\nSuper League and Survival (1995-1999)\n\nOn the eve of the ARL Premiership’s kick-off in 1995, the board of directors decided to change the Club's name to ‘Sydney City Roosters’.\n\nNow with 20 teams in the competition, including fellow Sydney teams, Brisbane, North Queensland and even Auckland, there was a view that the ‘Eastern Suburbs’ identity had become outdated.\n\nHowever, the Roosters weren’t the only team to do this, as both Canterbury-Bankstown and Balmain also rebranded as ‘Sydney Bulldogs’ and ‘Sydney Tigers’ respectively – although both would revert soon after.\n\nAt the time, the Club believed that having ‘City’ in their name would stamp down an 'ownership' of Sydney’s Central Business District (CBD), which could garner new sponsor partnerships as the threat of Super League loomed.\n\nWhile it was a shift in tradition, it was necessary as the game continued to grow according to Club powerbrokers – but it is important to note that the Club was and still is registered as Eastern Suburbs District Rugby League Football Club.\n\nThe Red, White and Blue jersey now featured the Sydney Harbour Bridge in the background to emphasise the new ‘Sydney City’ title. In 1997, all five remaining Foundation Clubs (Balmain, Easts, Norths, Souths and Wests) had a ’90 Seasons’ logo, which featured an alternate version of their respective logos at the time.\n\nNew Millennium, New Look (2000-present)\n\nWith the advent of a unified competition after the Super League War in 1997, many clubs rebranded their emblems for the new millennium, including Easts, who had now become the ‘Sydney Roosters’.\n\nThe logo, which is also the longest-serving that is still used to this day, features a more refined and stylised look, with a more aggressive-looking Rooster.\n\nCentenary Celebrations (2007-2008)\n\nCelebrating the Club’s 100th season in the top grade, the Roosters adopted a new Centenary Logo, one that gained a popular following.\n\nTaking small influences from each of its predecessors, the 2007 Centenary logo featured a Blue Rooster silhouette with a background resembling the Club’s famous home jersey and ‘100 YEARS’ as a standout element at the base. It is also the only logo to feature a gold trim around the outline of the design.\n\nTo coincide with the Australian Rugby League's Centenary, the Roosters also featured this logo on their jersey for the 2008 season.\n\nWhich Is Your Favourite?\n\nFor over half a century the proud Rooster has been the lasting symbol of the Club, and although a number of changes and refinements have been made over the years, you can guarantee we will always wear the famous Red, White and Blue and we will always be the Sydney Roosters."}, {"url": "https://www.nrl.com/news/2020/12/14/nrl-2020-in-memoriam/", "page_content": "The rugby league world said goodbye to several well-known players, coaches, administrators and people associated with the sport in 2020.\n\nBrian James\n\n1943-January 10, 2020\n\nA high-quality winger for South Sydney who represented Australia at the 1968 World Cup before retiring at the age of 26.\n\nThe son of former Cootamundra Maher Cup prop Jack \"Swifty\" James, he came to rugby league via rugby union after attending Newington College and playing a season of first grade with the St George rugby club.\n\nHe switched to rugby league with St George in 1961 where he played centre and wing but top-grade opportunities were scarce in the Dragons’ star-studded backline, so he made the decision to transfer to South Sydney in 1966.\n\nHe was quickly vindicated, playing more first-grade games in his first season with Souths (18) then he did in four years at St George (16). A winger of above average pace (he pursued professional sprinting in the off-season), James earned his first representative jersey with City Seconds in 1967 before making City Firsts the following year.\n\nHe progressed to NSW selection and then was named in Australia’s 19-man squad for the World Cup. Although overlooked for the opening games he was given an opportunity in the pool match against France.\n\nAustralia won easily but James saw little of the ball and the chance to play his way into the top 13 for the final was lost. James played in four consecutive lower-grade grand finals with St George (winning all but one) before appearing in three first-grade deciders with the Rabbitohs.\n\nHe shared in Souths’ triumphs over Canterbury in 1967 and Manly in 1968 but tasted defeat against Balmain in 1969. James retired soon after to pursue a career in transport and logistics.\n\nHe died on January 10 following an accident on his property at Capertee in central-western NSW.\n\nMark Harris\n\n1947-January 15, 2020\n\nMark Harris was a blockbusting centre who made his mark with Eastern Suburbs in the early 1970s and in 1974 helped secure the club its first premiership title in 29 years.\n\nHarris made a meteoric rise with the Roosters after being signed sight unseen by officials, who had heard of his exploits with the Kone Tigers in Port Moresby.\n\nHarris was a first-grader after only a handful of games in the lower grades at Easts and by the end of his first season was chosen in Australia’s 1970 World Cup squad. A cousin of former Test prop Dud Beattie, Harris played on the wing in the brutal Cup final against Great Britain, won 12-7 by Australia at Headingley and figured in a second World Cup campaign in France two years later.\n\nHis career took a sudden detour in 1973 after his kicking abilities were identified by an American radio broadcaster who had undertaken a worldwide search for a kicker for the Boston Patriots NFL team.\n\nHarris tried out with the Patriots and the Philadelphia Eagles before landing a contract with the Montreal Alouettes in the Canadian Football League. Harris struggled to learn the nuances of the new code and was frustrated that his input was limited to taking kick-offs.\n\nUp Next / Cancel Replay Play Next Harris scores as Coote and Beetson split the Bulldogs\n\nHe returned to Easts in 1974 and resumed his centre partnership with former Wallaby John Brass. Under Jack Gibson’s direction, Harris recaptured his rampaging attacking form and scored a crucial grand final try against Canterbury.\n\nA fractured leg in the preliminary final against Manly cost Harris the chance of back-to-back titles with Easts a year later but he continued to flourish at representative level and helped Australia to another World Cup title in 1977.\n\nAfter playing 195 first-grade games in a decade with Easts, Harris crossed the bridge to join North Sydney for the final two seasons of his career in 1980 and 1981. He died in Sydney on January 15 after a long battle with cancer.\n\nGreg Hawick\n\n1932-February 6, 2020\n\nEven before Greg Hawick played his first Test for Australia, he was described by former Test captain Len Smith as “the most competently versatile footballer the rugby league code has had since Jim Craig in the 1920s.”\n\nIt was praise that the young South Sydney player lived up to over the next decade, featuring in four different positions in a 10-Test career for his country. Hawick displayed versatility from his earliest days as a footballer, alternating between lock and five-eighth at Gardener’s Road Junior Technical School and even filling in at centre and wing when required.\n\nHe played primarily five-eighth for the Rabbitohs and occupied that role when Souths ended an 18-year premiership drought in 1950. But in his first three Tests for Australia he played five-eighth, lock and halfback to effectively cement his reputation as one of the game’s great all-rounders.\n\nHe added a second premiership title with Souths in 1954 but injury cost him the chance of winning three more when he missed deciders in 1951 (broken jaw), 1953 (shoulder) and 1955 (knee). Hawick headed bush in 1957, joining Wagga Kangaroos and lifting the club from the doldrums to win back-to-back titles in 1962-63.\n\nIt was in 1957 that Hawick etched his name in the record books by booting 15 goals for NSW in a 69-5 demolition of Queensland. Hawick returned to Sydney in 1959 for two seasons with Norths but afterwards settled into country life.\n\nHis only foray back into the big smoke was an unedifying stint as North Sydney coach in 1985.\n\nNamed in South Sydney’s all-time Dream Team in 2004 (on the bench) and in the NRL’s Team of the 1950s in 2007 (at five-eighth), he died in Wagga Wagga on February 6, aged 87.\n\nDon Furner\n\n1932-February 24, 2020\n\nDon Furner was best known as the foundation coach of Canberra but his years with the Raiders were only part of the story of a remarkable lifelong contribution to the game.\n\nFurner’s career began as a player in the Balmain juniors in the 1940s and culminated in selection for the Kangaroos in 1956 and a Test jersey against Great Britain.\n\nHis journey included stints at Toowoomba, where he shared in five consecutive Bulimba Cup titles in the annual triangular tournament with Brisbane and Ipswich, at Mackay and Mitchell in rural Queensland, along with Tumbarumba, Junee and Queanbeyan in southern NSW.\n\nFurner quit playing in 1966 but continued to coach Queanbeyan United, steering the club to five grand finals and three premierships. He took on the Eastern Suburbs coaching job in 1970 and guided a team that included Arthur Beetson and Ron Coote to the grand final in 1972.\n\nReturning to Queanbeyan, Furner coached representative teams including Monaro and Country Firsts and Seconds. The Raiders endured a tough initiation into the NSWRL competition but Furner built steadily, eventually enticing high calibre players Mal Meninga, Gary Belcher, Steve Walters and Peter Jackson to the club and, in partnership with Wayne Bennett, led the Raiders to their first grand final in 1987.\n\nFurner coached the Australian team on a second undefeated Kangaroo tour in 1986 and plotted Australia’s defeat of New Zealand in the 1988 World Cup final.\n\nHe became Australia’s chairman of selectors for a decade and coached Fiji at the 2000 World Cup. Furner’s legacy at the Raiders was carried on by his sons David (200 first grade games) and Don jnr (CEO since 2007). Don snr passed away in Canberra on February 24, aged 87.\n\nDon 'Bandy' Adams\n\n1934-March 4, 2020\n\nA stockily built dairy farmer from Nelson Plains in the Hunter Valley, Adams was the star of Australia’s 1956 home series win over New Zealand before he winged his way to England with the Kangaroos.\n\nHis chance at Test level came in the lead-up to the first Test against the Kiwis, when Newcastle’s Brian Carlson injured a leg at training. Adams emerged the hero of a knife’s edge contest at the Sydney Cricket Ground, scoring two tries in Australia’s 12-9 win, including a long-distance match-winner with a minute to play.\n\nAfter seeing little of the ball in a forwards-dominated second Test in Brisbane, won 8-2 by Australia, Adams played another blinder in the third, crossing for a hat-trick of tries in a 31-14 cakewalk and guaranteeing his place among the Kangaroo tourists later in the year.\n\nAdams hit the ground running in England, scoring the first try of the tour, and four for the match against Liverpool. But his progress was slowed by a knee to a kidney at Barrow and despite finishing with 11 tries from 15 games, he played only the one Test against Great Britain and one against France.\n\nAnd that’s where his big-time representative career ended. Adams came to Sydney with Country teams in 1957 and 1958 but after that he was content to stay in the Hunter where he turned from farming to work as a telephone linesman.\n\nAdams played 11 seasons with Maitland, before stints as player coach at Gloucester, Scone and Muswellbrook. His eldest son, David, later played first grade with Manly and Balmain. Don died at Scone on March 4 at the age of 86.\n\nTony Branson\n\n1946-April 1, 2020\n\nTony Branson took the ride of a lifetime in 1967, progressing from first grade at the Nowra Warriors all the way to a Kangaroo tour, where he scored a glorious try to set up Australia’s Ashes victory at Swinton and then played all three Tests against the French.\n\nThe 20-year-old pivot was virtually unknown to Sydney crowds at the start of that season but after representing Group 7 and Southern Division, he played for Country Firsts and then NSW before beating no less a player than Bob Fulton for a place in the Kangaroo squad.\n\nHe signed on with St George after the tour. There he came face-to-face with another high-profile five-eighth, Phil Hawthorne, recruited from Wallaby ranks the same year. Branson admitted in a 2010 interview that he was blindsided by Hawthorne’s signing and claimed he had no idea that he had signed with St George as a centre.\n\nBranson didn’t have the speed for the position and although he tried hard to make a success of the role, his confidence and form suffered and he was eventually dumped to reserve grade. Branson stayed with the Dragons until 1973, playing 101 top grade games and appearing in the club’s 1971 grand final loss to South Sydney.\n\nHe signed with Wollongong before returning to Nowra in 1977 and finally hanging up his boots. He died on April 1, aged 73.\n\nArthur Summons\n\n1935-May 16, 2020\n\nArthur Summons was never one to dwell on the disappointments that could have dimmed the great moments of a career of outstanding endeavour in two rugby codes.\n\nWell before he became the Western Suburbs and Australian captain and then one of the iconic figures adorning the game’s premiership trophy, Summons enjoyed resounding success in rugby union. He played 10 Tests for the Wallabies, debuting against the Springboks in 1956 before touring the British Isles in 1957-58.\n\nHe made the decision to switch to league in 1960 and within two seasons he had become a dual international, playing the first of nine Test matches in his new code.\n\nSummons was appointed Test captain for the third Test of 1962, beginning an undefeated run of five Tests as skipper.\n\nIn 1963 he was selected as captain-coach of the Kangaroos touring team and even though a knee injury kept him out of the three Ashes Tests, he remained at the helm of the first all-Australian team to win the Ashes on British soil.\n\nHe played in three grand finals in five seasons with Western Suburbs, all of them ending in heartache at the hands of St George, the 1963 defeat hurt the most.\n\nIt was a controversial finish and involved a hint of scandal but for Summons there was a silver lining. The photograph snapped by Sun-Herald sharpshooter John O’Gready just after the full-time siren proved to be a life-changer.\n\nHis muddy embrace with Dragons skipper Norm Provan became rugby league’s most famous image, the basis for the game’s premiership trophies since 1982 and led to a lifelong friendship with his former rival that was only broken by Summons’ death on May 16.\n\nBobby Dimond\n\n1929-May 30, 2020\n\nThe passing of Bobby Dimond in a Gold Coast retirement home in May marked the end of an era. Dimond was the last surviving member of the 1948-49 Kangaroos, the first team to tour Great Britain and France after World War II.\n\nDimond was the baby of the tour, becoming only the second Kangaroo (after Charles \"Chook\" Fraser in 1911) to celebrate his 19th birthday while in England. Dimond failed to make the Test team but gained invaluable experience in 15 tour games, playing mostly as a winger and occasionally at centre.\n\nHe came into first grade at Dapto at the age of 16 and played his first senior representative football early in 1948, turning out for Country Firsts and NSW before sailing for England aboard the Maloja with his Kangaroo teammates later in the year.\n\nHe had begun to make his mark in Sydney football with Western Suburbs when he suffered fractures and a severe concussion in a motorcycle accident which ruled him out of the game for two years.\n\nHe attempted a comeback with St George in 1954 but fractured his wrist in a trial and after making a brief comeback at Kempsey in 1955, Dimond was selected for Country Seconds but was forced to withdraw with injury.\n\nDimond’s younger brother Peter toured with the Kangaroos in 1963-64. Bobby was 90 when he died on May 30.\n\nNoel Kelly\n\n1936-June 14, 2020\n\n\"Ned\" was as rough and rugged as they come. Raised in rural Queensland, Kelly took to rugby league like he was made for it and stood his ground against the toughest opponents that played the game in his era.\n\nHe cut his teeth in the ultra-tough Bulimba Cup competition (Ipswich-Brisbane-Toowoomba) in the late 1950s, wore his first Australian jersey in 1959 and became a fixture in the Test line-up for a decade. He became the first front-rower to make three Kangaroo tours (1959-60, 1963-64 and 1967-68) and played 72 games for his country, including 28 Tests.\n\nIn club football, Kelly ensured that few teams enjoyed playing Western Suburbs as he dished out his own brand of punishment for nine seasons. He played 111 games of premiership football for Wests, a figure undoubtedly diminished by regular suspensions.\n\nHis top-level career wound up in 1969 before a brief stint as captain-coach at Wollongong. Kelly became non-playing coach of North Sydney from 1973-76 but apart from steering the Bears to a mid-week final, success proved elusive.\n\nHe remained heavily involved in the game, his character shining through as a panelist on Rex Mossop’s Controversy Corner and he later rendered outstanding service to the Men of League organisation.\n\nIn 2008 Kelly was bestowed the ultimate honour when named in the Australian Rugby League Team of the Century, at hooker. He passed away on June 14 following a brief illness, aged 84.\n\nKeith Middleton\n\n1931-August 24, 2020\n\nKeith Middleton was still a teenager when he achieved his greatest moment in rugby league, throwing the final pass for the try that won the Ashes for Australia after a 30-year drought.\n\nOn any other day it would have been applauded as a slick, if regulation, backline movement but with the SCG a quagmire, the Ashes up for grabs and the match delicately balanced at 2-all, the pressure was intense.\n\nFrom an Australian scrum win, Keith Holman, Frank Stanmore and Doug McRitchie played their part before Middleton sent winger Ron Roberts galloping away for the match-winning try.\n\nMiddleton emerged from the NSW far south coast town of Bermagui, playing his early football as a half and five-eighth before shifting to centre when he joined North Sydney as a 17-year-old in 1948.\n\nHe was selected for Australia for the first Test in 1950 after only one representative game for City Seconds. Middleton’s performances in all three Tests caught the eye of former Test captain Len Smith, who was convinced that the young centre was poised for a long representative career.\n\nApart from one further appearance for NSW, and a couple of games for City, he played no further rep football. By 1955 he announced his retirement to pursue a career as a building executive.\n\nHe made a brief comeback with South Sydney in 1956 before retiring for good at 25. He died at Miranda on August 24, aged 89.\n\nGary Parcell\n\n1933-November 30, 2020\n\nA farmer from Harrisville, a small rural hamlet 25km south of Ipswich, Gary Parcell gained fame as a rugged second-rower or prop in a 10-year career in which he represented Ipswich, Queensland and Australia.\n\nHe won a place in Ipswich Brothers’ first-grade side as an 18-year-old in 1952. He played his first representative game the following season against the American All Stars and the first of 34 Bulimba Cup matches for Ipswich the same year.\n\nBy 1956 he emulated his father Perce Parcell when he was chosen for Queensland. Perce had represented the Maroons in two interstate games in 1924-25. Gary went on to surpass his father’s tally, appearing 12 times in interstate matches and in three games against international opposition.\n\nParcell achieved a breakthrough year in 1959 when he helped the Maroons to a rare series victory over NSW (it turned out to be their last until the 1982 State of Origin series) and from there was chosen to tour with the Kangaroos.\n\nHe made his Test debut at Swinton in a 22-14 victory and went on to play in four of the six Tests on tour. He played his first Test on Australian soil against France in 1960, forming a famous all-Ipswich front row, along with Dud Beattie and Noel Kelly. The trio were part of Australia’s World Cup squad in England later the same year. Parcell played his final Test in 1962.\n\nHis son Steve carried on the family tradition, representing Queensland Residents on a tour of France in 1989, while grandson Matt played NRL for Brisbane and Manly before forging a successful career in the English Super League. Gary Parcell died at Harrisville on November 30, aged 87.\n\nFrank Mulcare\n\nA fiery West Coast second-rower who played in four consecutive New Zealand Test wins over Australia at Brisbane, Sydney, Christchurch and Wellington in 1952-53.\n\nHe played 18 Tests (among 46 games) for the Kiwis from 1951 to 1956. Was one of four Kiwis attached to the injury-hit 1953 American All Stars touring team in New Zealand.\n\nMulcare retired at 26 the when NZRL refused him a clearance to play in Australia (where he met his wife on the 1952 tour). He became chief police prosecutor in Christchurch in the 1960s before farming in Northland until his death. Inducted in NZRL Legends of League in 2007. He died in Whangarei on January 5, aged 90.\n\nTed Curran\n\nA second-rower for NSW country clubs Adelong, Temora and Thirroul in the 1950s before becoming long-term Country and NSW selector. Curran turned 18 the day he made his representative debut for Country Seconds in 1952 before representing Combined Riverina and Western Division against that year’s touring Kiwi side.\n\nHe shifted from Adelong to Temora in 1953 and represented Riverina against the American All Stars.\n\nAnd in 1958 he moved to Thirroul, representing Southern Division against Great Britain (1958) and New Zealand (1959). He died on January 9, aged 85.\n\nManfred Moore\n\nAn American-born winger who played five first grade games for Newtown in 1977 but left an impression that lived on among supporters of the Jets and the wider league community. A member of the Super Bowl-winning Oakland Raiders outfit of 1977, Moore was enticed to Sydney by advertising guru and Jets supporter John Singleton.\n\nThe 26-year-old arrived amid great fanfare, scored a try with one of his first touches but afterwards struggled to adapt to the new code. Moore returned to the NFL with the Minnesota Vikings and after retiring became a church minister. He returned to Australia for a reunion in 2007. Moore died in California on January 11, aged, 69.\n\nPaul Fisher\n\nA utility player for Cronulla in nine first-grade games (1995-97) after moving from Brisbane to play under coach John Lang in 1994.\n\nThe Souths-Sunnybank junior was equally at home at fullback, halfback and hooker. He died after battling Motor Neurone Disease on January 13, aged 49.\n\nGrant Goldman\n\nA radio broadcaster and long-time ground announcer at Brookvale Oval, an unabashed Sea Eagles supporter, Goldman took on the ground announcer’s job in 1978 and was a fixture for most seasons until 2015. His parochial style occasionally earned the ire of officialdom, Goldman passed away on January 17, aged 69.\n\nJack Hardman\n\nA winger for Balmain in the early 1950s, who played one first-grade game (against Western Suburbs) in 1953. He passed away on January 21, his 88th birthday.\n\nGlen Graham\n\nA winger who was a member of South Sydney’s premiership-winning under-23s squad in 1986. Nicknamed \"Toots\", he made his only appearance in first grade as a 19-year-old replacement player that season. He died of a heart attack on January 26, aged 53.\n\nJohn Perry\n\nA halfback for Eastern Suburbs, who took the opportunity to play first grade in 1952 when regular half Col Donohoe sailed for England with the Kangaroos. A member of Easts’ President’s Cup team of 1951, Perry played seven first-grade games (1952-53). He died at Lithgow on January 27, aged 89.\n\nIan 'Elke' Sommer\n\nA second-rower for Valleys in their 26-0 victory over Souths in the 1979 Brisbane grand final. Sommer joined Valleys in 1975 as a winger but made a successful transition to the forwards under coach Henry Holloway in 1977.\n\nSommer played five seasons of first grade alongside Wally Lewis and Ross Strudwick and mentored future Test second-rower Bryan Niebling. He died suddenly on February 12, aged 68.\n\nAdam Maher\n\nA second-rower who played 43 games for Cronulla 1994-96 including six in first grade (all as a 21-year-old in 1994). He joined the Sharks from Brisbane Easts, along with teammates Paul Green, Geoff Bell and Andrew Neave, to play under coach John Lang before joining the Hunter Mariners in 1997.\n\nMaher moved to the UK, playing initially with Rochdale Hornets (1998) and Gateshead (1999) before playing 92 Super League games in four seasons with Hull FC (2000-03). He died of Motor Neurone Disease on February 25, aged 47.\n\nRobert Orchard\n\nA rampaging Kiwis front-rower who later played in and for Queensland. He played 55 games for New Zealand, including 18 Tests, toured Britain and France in 1965 (aged 19) and 1971 and Australia in 1967 and 1972.\n\nOrchard appeared in all seven Tests in 1971 when New Zealand completed a unique grand slam over Australia, Great Britain and France. He settled in Queensland in 1973 and represented the state in two games against NSW.\n\nHe played for Redcliffe in 1973 grand final loss to Valleys and also at Mt Isa, Mackay and Gympie and for Wynnum-Manly. The brother of fellow Kiwi Phillip Orchard, he died in Brisbane on March 10, aged 74.\n\nDoug Page\n\nA lock or second-rower in 29 first-grade games for Western Suburbs between 1964 and 1970. Page’s career was restricted by injury and limited by three years overseas in which he taught physical education at schools in Buenos Aires (1967) and England (1968-69).\n\nHe died in Lismore on March 24, aged 78.\n\nFrank Myler\n\nThe last Great Britain captain to win the Ashes. A centre in 369 appearances for Widnes (1955-67), 144 games for St Helens (1967-71) and 50 games for Rochdale (1972-73); Myler played 24 Tests for Great Britain and toured Australia as a player in 1966, as captain in 1970 and coach in 1984.\n\nHe died on March 27 after a long illness, aged 81.\n\nBill McCarthy\n\nA second-rower who played 13 first-grade games across three seasons for South Sydney and Newtown between 1962 and 1968. The older brother of South Sydney legend and Hall of Famer Bob McCarthy, Bill played juniors with Chelsea United. He died in Cairns after battling emphysema on July 27, aged 77.\n\nPaul Carroll\n\nA five-eighth for Eastern Suburbs, who played five first-grade games for the club in 1952. Carroll joined Easts after two seasons in first grade with Randwick rugby union club. He died on his 91st birthday on March 29.\n\nHarry Slaughter\n\nAn instrumental figure in the establishment of Penrith junior club St Dominics (later known as Brothers) in 1968. Slaughter was a Panthers director from 1967-80 and was awarded life membership of the club in 1979. He died on April 14, aged 92.\n\nMitch Cronin\n\nA Wynnum-Manly hooker who captained the club to the grand final of Queensland’s Intrust Super Cup in 2019 and had spent time in the development systems of the Brisbane Broncos and Canberra Raiders.\n\nThe 27-year-old was found unresponsive in his swimming pool following a weights session at his home on April 17.\n\nJoe Goicoechea\n\nA prime mover in the formative years of the North Queensland Cowboys, and the principal figure in the redevelopment of Willows Paceway into a premiership-standard rugby league venue in 1995.\n\nA former front-rower with Souths Townsville and a Foley Shield representative, Goicoechea sat on the Cowboys board from 1995-2000. He died on April 22, aged 86.\n\nNoel Bissett\n\nA long-serving referee and administrator in Canberra and surrounding regions. Involved in the game for more than 50 years, Bissett was the first Canberra-based referee to control a first-grade game in the NSWRL (1984) and was a pioneer of the video referee system.\n\nHe died on April 25, aged 83.\n\nDick McKelvey\n\nA winger for Western Suburbs, who played 13 first-grade games in the years immediately following World War II. McKelvey debuted in first grade in 1946 but did not cement a position until 1949. He was the Magpies’ oldest living player until his death in May, aged 93.\n\nTony Coll\n\nNew Zealand’s most decorated forward of the 1970s, playing 30 Tests and 35 other matches for the Kiwis from 1972 to 1982. Coll was a powerful and fast second-rower who famously scored a try from 60 metres against Wales at Swansea in 1975.\n\nHe played in the World Cup of 1972 and World Series 1975 and 1977 (captain) and toured Australia and PNG in 1978 and 1982 and Great Britain and France in 1980. Coll played for West Coast province in 58 games (1971-82) and for the Greymouth Marist club (227 games). Coll died while mountain biking near Greymouth on May 14, aged 70.\n\nRick Muru\n\nA long-serving Waikato and New Zealand Maori ball-playing prop who played eight matches on the 1980 Kiwis tour of Britain and France. As a teenager he represented New Zealand under-23 and Auckland in 1969, before starting a 12-season career with Waikato province in 1971.\n\nA Taniwharau club stalwart, his New Zealand Maori career highlights included the 10-all draw with Australia at Hastings in 1980 and captaining the team against France in his Huntly home town in 1981. He died at Huntly on May 15, aged 69.\n\nTom Searle\n\nThe captain-coach of Tweed Heads Seagulls in the 1970s, a Country representative and long-serving Gold Coast official. Searle guided Tweed Heads Seagulls to eight consecutive grand finals and four Group 18 titles.\n\nHe represented Country Firsts in 1972 and Country Seconds in 1973. The father of Gold Coast Titans founder Michael Searle, Tom was the Titans’ inaugural junior development manager in 2007. He died of brain cancer on June 22, aged 73.\n\nBarry Cross\n\nA referee and touch judge who devoted a lifetime to officiating at all levels. Initially a halfback at Wamoon in the Riverina in the early 1950s, Cross turned to refereeing in the Manly district in 1957. He controlled countless games at schoolboy and junior levels before joining the NSWRL Referees Association. He controlled eight NSWRL games as a referee but was touch judge in grand finals, interstate and international matches.\n\nThe father of first-grade players Greg Cross (Manly) and Peter Cross (North Sydney), he died in July, aged 87.\n\nBill Ramsey\n\nA rugged English forward who toured Australia twice and played more than 400 games at club level in a career that lasted from 1962-77.\n\nHe toured Australia and New Zealand with Great Britain in 1966 and was sent off in a brutal second Test against Australia in Brisbane. In 1974 he made history as one of two replacement players (along with Maurice Richards) sent to Australia as reinforcements when injuries left the tourists short. He died on July 6, aged 76.\n\nPeter Burnicle\n\nA second-rower in 46 games for Western Suburbs (1963-68) including a single appearance in first grade in 1965. He died on July 20, aged 76.\n\nDon Regan\n\nA second-rower for Parramatta in 73 first-grade games from 1949-53. Regan played President’s Cup for the Eels in 1947-48 before earning a call-up to first grade under famous coach Vic Hey. Regan died on July 29, aged 90.\n\nWarren Kimberley\n\nA stalwart administrator on the NSW mid-North Coast and former president of the Country Rugby League. His long association with the game began as a 15-year-old player with Wauchope in 1954. He went on to play 160 games with the senior club before turning to administration.\n\nHe was appointed CRL president in 2000 and served nine years in the role. He died on July 31, aged 81.\n\nBal Numapo\n\nCelebrated as an all-time great in Papua New Guinea, he was a Rest of the World representative in 1988 and lower-grade player with the Canterbury Bulldogs in 1989.\n\nNumapo was a gifted centre who made his Test debut for the Kumuls against the touring Great Britain team of 1984. He played 14 Tests for PNG, including eight as captain and led the history-making tour to Great Britain and France in 1987.\n\nHe represented Rest of the World against Great Britain at Leeds in 1988 before a short stint with the Bulldogs in 1989. He died at Kundiawa after suffering a stroke on August 1, aged 57.\n\nRoss Warner\n\nA hooker for North Sydney in 186 first grade games from 1963-74. From Tamworth, he represented Northern Division against the touring Great Britain side of 1962 before heading for Sydney.\n\nWarner represented NSW five times and was unlucky not to play for Australia after being selected as a reserve for the third Test against France in 1964.\n\nHe was named hooker in the Bears' Team of the Century. He passed away on August 1, aged 82.\n\nCol Weir\n\nA talented centre for Wests Brisbane, who rose to the brink of Test honours in 1960 when he was chosen as a reserve for the first Test against France.\n\nA Wests Ithaca junior, Weir played 16 Bulimba Cup games for Brisbane (1957-64) before playing the first of seven games for Queensland in 1959.\n\nHe was a mainstay for Wests, captaining the club in 1964-65 but a premiership title proved elusive. Weir died on August 1, aged 84 after a short battle with cancer.\n\nKevin Hogan\n\nA skilful five-eighth in 63 first-grade games, 49 for Cronulla (1969-73) and 14 for Parramatta (1974) before embarking on a successful career as a junior and lower grade coach.\n\nHe enjoyed his finest season in 1971 when he finished second in the Rothmans Medal count to Souths five-eighth Denis Pittard (by one point) and shared the Sydney Morning Herald player of the year award with Pittard the same year. Hogan died on August 3, aged 75.\n\nClarrie Jeffreys\n\nA hooker for Balmain and Newtown in 117 first-grade games (1953-68) before coaching Newtown at lower-grade and first-grade level.\n\nJeffreys played 23 top-grade games for Balmain (1953-55) before appearing in 94 games for Newtown (1957-68). His tally of 242 grade games for the Bluebags is second only to Frank \"Bumper\" Farrell’s 250.\n\nHe took charge of Newtown’s first grade side in 1974 and held the reins for three seasons. He died on August 27, aged 88.\n\nJack Danzey\n\nA centre or five-eighth for Newtown (1960), Balmain (1962-65) and Cronulla (1967-68), who played 62 first-grade games before becoming a high-ranking NSWRL referee.\n\nDanzey played five-eighth for Balmain in the 1964 grand final and in Cronulla’s inaugural premiership match in 1967 (an 11-5 win over Eastern Suburbs).\n\nHe officiated in 170 first-grade games, was in charge of two interstate games (1978 and 1980) and controlled the 1978 Amco Cup final between Eastern Suburbs and St George. He died on August 31, aged 81.\n\nLaurie Fagan\n\nA halfback who played 177 first-grade games for Balmain (1959-66) and Penrith (1967-70) in a 12-year career in the top grade. In 1962 he represented NSW in one interstate game, played for the state against the touring Great Britain team and was named winner of the Sydney Morning Herald player of the year award.\n\nHe played in Penrith’s inaugural first grade game in 1967 (scoring two tries in a 15-12 loss to Canterbury) and was named the club’s player of the year in 1970. Fagan died on September 28, aged 79.\n\nJoel Dark\n\nThe 19-year-old cousin of NSW and Australian captain Boyd Cordner, he died in John Hunter Hospital on September 11, five days after suffering a head injury playing for Central Newcastle against Western Suburbs at Charlestown. Dark was making his first-grade debut.\n\nJohn Fahey\n\nA lower-grade player for Canterbury who became NSW Premier and played a major role in securing the Olympic Games for Sydney in 2000. Fahey played as a winger, centre or five-eighth in 37 reserve-grade and third-grade games for Canterbury in 1965-66 before taking on captain-coach duties with Camden and Oakdale in Group Six.\n\nHe became a member of parliament in 1984 and served as NSW Liberal Premier from 1992-95. Fahey was inaugural patron of the Men of League organisation, and later a director; sat on the NRL Centenary Committee and was patron of the Bulldogs from 1993 until his death on September 12, aged 75.\n\nPeter Newell\n\nAn administrator, who played a key role in the establishment of the St George Illawarra joint venture before the 1999 season. Newell was a former journalist, editor and general manager of the Illawarra Mercury (1970-2000) and joined the board of the Illawarra Steelers in 1989, serving as chairman from 1999-2019.\n\nHe was awarded an Order of Australia Medal in 2003 for his role in engineering the joint venture and also for his services to the Illawarra community. He died on September 28, aged 71.\n\nJohn Whittaker\n\nA gifted utility back and a star of New Zealand’s 1971 Grand Slam year (two tries as a winger against Australia at Auckland and a brilliant fullback in six Tests in Britain and France), when all three series were won.\n\nDebuted at the 1970 World Cup and recovered from a serious car crash in 1973 to extend his international career through to 1982. Played 26 Tests (10 at fullback, seven at wing, six at centre, three off the bench) and 43 other games for the Kiwis including four world tournaments.\n\nThe first Cook Islander to play for the Kiwis, he proudly represented his homeland in 1986 when aged 36. He died on September 29, aged 70.\n\nErnie Hills\n\nAn All Black triallist, Wallabies winger and prolific tryscorer in two seasons with Western Suburbs in 1956-57. Born in Auckland, Hills represented the Wallabies in two Tests against the British Isles and spent three years serving in the New Zealand Army in Korea. Hills joined Western Suburbs in 1956 and scored 19 tries in 29 games for the Magpies. He died in October, aged 90.\n\nBill 'Mad Dog' Wilson\n\nA hooker and prop for Western Suburbs in 43 games 1964-67, of which two were in first grade. Wilson was a Balmain junior; he made his first grade debut against Newtown late in the 1965 season and played his second and last game in 1966. He died in October, aged 82.\n\nRay Blacklock\n\nA winger for Penrith, Newtown and Canberra, who scored 34 tries in 93 first-grade games and played in Newtown’s 1981 grand final team.\n\nBlacklock captained Penrith to victory in the 1978 under 23s grand final over Western Suburbs. It was the Panthers’ first premiership title in any grade. Blacklock forged a strong partnership with fellow Indigenous winger John Ferguson at Newtown (1981-82) before playing out his career in two seasons with Canberra (1983-84).\n\nHe died of a rare neurological disorder, Multi System Atrophy, on October 28, aged 65.\n\nMick Fitzsimmons\n\nA second-rower who made a single appearance in first grade for Eastern Suburbs in 1983. The Bondi United junior came off the bench in a big win over St George at Kogarah. Fitzsimmons later spent several years with the Roosters as junior representative coach. He died in late October, aged 58.\n\nWal Hourn\n\nA winger who played nine games for South Sydney in 1962, including three in first grade. A Lismore junior, Hourn made his top grade debut against Eastern Suburbs early in the season and later scored two tries against Canterbury. He died at Hervey Bay in November, aged 79.\n\nWarren Simmons\n\nA centre for Manly in 37 first-grade games in the 1950s, including the Sea Eagles’ first grand final team of 1951. Simmons died at Thornton on November 9, aged 90.\n\nGreg Growden\n\nBest known as a rugby union writer for the Sydney Morning Herald and the author of several books but he also covered rugby league, among other sports, for the Herald from the late 1970s to the mid-1980s.\n\nHighly respected, Growden died on November 14, aged 60, after battling cancer.\n\nJim Schroder\n\nA prop who played 32 first-grade games for North Sydney in a club career that spanned a decade (1961-70). A Temora junior, Schroder made his top grade debut in Norths’ final game of 1962 but waited almost five years to make his second appearance. He died at Tumut on November 22, aged 79.\n\nRay Cupic\n\nA hooker for Eastern Suburbs, who played a single game in first grade in 1975. His one appearance may have been fleeting however there was significant history attached to it. Cupic was called on as a replacement by coach Jack Gibson in a late season game against Canterbury as the Roosters were building towards a premiership record 19 consecutive wins. He died in late November.\n\nKeith Titmuss\n\nA 20-year-old Manly front-rower, he had been named in the Sea Eagles’ top 30 squad for 2021. Titmuss fell ill after a training session at Narrabeen on November 23 and despite being rushed to Northern Beaches Hospital and then Royal North Shore, he could not be saved.\n\nAs a 17-year-old, Titmuss scored the match-winning try for Manly in the 2017 Holden Cup grand final. The club honoured the Cabramatta junior by awarding him a heritage number (623), recognising that he was poised to make his NRL debut in 2021.\n\nJack Stewart\n\nA centre in 36 games for Canterbury in the 1940s (six in first grade) and later a long-serving administrator with the Cronulla Sharks.\n\nStewart was one of three brothers who made significant contributions to Canterbury; brothers Kevin and Frank being Life Members of the football club and having the grandstand at Belmore Sports Ground named in their honour.\n\nHe was chairman of Cronulla Leagues Club from 1972-91 and became chairman of both leagues and football clubs when the boards merged in 1988. Stewart died on November 28, aged 99.\n\nMick Falla\n\nA five-eighth for South Sydney in 63 games from 1961-66, who became a selector of metropolitan, state and national teams over a 25-year period. Falla played over half of his 122 games in the top grade.\n\nHe served as metropolitan selector from 1976-2000, NSW selector 1979-2000 and was a member of Australian selection panels in 1982-83 and 1993-96. He died on November 29, aged 83.\n\nNotable deaths late in 2019\n\nNeil Ryan\n\nA winger who played two first-grade games for South Sydney (1957 and 1959) before transferring to Eastern Suburbs and playing a further top grade game in 1960. He died in December 2019, aged 81.\n\nTom Cocking\n\nA forward who played 76 games for South Sydney, including 13 first-grade games (1959-62). A life member of the club, Cocking died on December 16, 2019, aged 82.\n\nDoug Ricketson\n\nA centre for Eastern Suburbs and Penrith in 63 first-grade games (1960-67). A Bondi United junior, Ricketson played in a grand final in his first season of first grade (a 31-6 loss to St George) and represented City Seconds and Sydney (v Great Britain) in 1962.\n\nHe moved to Penrith in 1966, playing in the club’s Second Division-winning team before playing three first grade games in the Panthers’ first season in the NSWRL.\n\nThe father of Roosters’ stalwart and former Test forward Luke Ricketson, he died on December 18, 2019, aged 79.\n\nFrank Foster\n\nA second-rower in 381 games for Workington Town, Hull KR, Bradford, Barrow and Oldham and in one Test for Great Britain (against Australia in 1967). He died on December 20, 2019, aged 79."}, {"url": "https://www.nrl.com/news/2021/04/11/1972-grand-final-rewind-sixth-time-lucky-for-drought-breaking-sea-eagles/", "page_content": "As part of a series of fresh looks at the grand finals of yesteryear, we revisit the 1972 decider which matched two teams staking their claim to succeed South Sydney as the competition's top dogs - foundation club the Eastern Suburbs Roosters and perennial bridesmaids the Manly Sea Eagles.\n\nNRL.com has gone into the vault to find footage of the grand finals from the pre-NRL era dating back to 1966 and will be showcasing these games, including a full replay, match highlights and great moments from these memorable encounters.\n\nBoth sides had droughts to break.\n\nManly were going into their sixth decider after 25 years in the competition with an 0-5 record, having lost to the mighty Rabbitohs just two years before, while the Roosters may have had nine premierships on their honour roll but hadn't lifted the trophy for 35 years.\n\nThe teams finished the regular season ranked 1-2, picking up a win apiece in their head-to-head clashes, before Manly romped home in the major semi-final 32-8 with Bob Fulton bagging a double and Ray Branighan kicking six goals.\n\nBoth Manly and Easts had boosted their stocks by raiding South Sydney's roster in the preceding off-season - the Sea Eagles adding Branighan and Test prop John O'Neill while the Roosters lured across Australian lock Ron Coote.\n\nUp Next / Cancel Replay Play Next Fred Jones scores during the 1972 grand final\n\nThe Sea Eagles went into the game as favourites but the Roosters gave them everything they could handle and jumped out to a 4-0 lead before Manly claimed the lead via four Branighan penalty goals.\n\nIt may have taken well into the second half for the first try but that didn't mean the attack from either side was lacking. Fulton, Graham Eadie and Dennis Ward all produced slashing runs for Manly while Coote, Kevin Junee and Mark Harris did the same for the Roosters.\n\nThe villain of the day, at least as far as Roosters fans were concerned, was referee Keith Page, who disallowed tries to lock John Armstrong (double movement) and Coote (dropped ball) while awarding four-pointers to Sea Eagles skipper Fred Jones (disputed put-down) and Branighan (alleged forward pass in lead-up).\n\nPlay of the day\n\nManly had the game wrapped up and the clock was ticking off the final seconds when the Roosters, trailing 19-9, charged at the Manly defence one more time. Future league boss John Quayle, playing in the Roosters second row, ran on to the ball then lobbed a poor pass to Arthur Beetson.\n\nThe rugby league Immortal, in an inspired display of the creativity he was renowned for, fielded the ball as it was about to hit the ground and sent it back between his legs like an NFL centre to Bill Mullins.\n\nThe big winger grabbed it on the half-volley 25 out and charged over under the posts."}, {"url": "https://www.hulldailymail.co.uk/sport/rugby-league/hull-fcs-eighteen-state-origin-7325223", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nHull FC have had eighteen of their former players feature in the State of Origin series for either Queensland or New South Wales. From arguably one of the greatest ever, Peter Sterling, to Jason Smith, Mark O'Meley, and beyond, some real legends of the Down Under game have found themselves playing in Black and White.\n\nAnd with this year's Origin kicking off this Wednesday morning, what better time for Hull Live to look at Hull's former Origin stars—from the obvious names to one or two names that might surprise you.\n\nQueensland\n\nShaun Berrigan - The hooker signed for Hull in 2008 from Brisbane Broncos and spent three seasons with the club, playing 74 times and scoring 12 tries. He returned to the NRL in 2011, playing one season for New Zealand Warriors before finishing his career with Canberra Raiders.\n\nRead more: Lennon Bursell shares key facets to Hull FC youth gains with big year in store\n\nDave Brown - The prop spent one season at Hull in 1986/87 after playing in Australia for Sydney Roosters, Manly Sea Eagles, and the South Logan Magpies in Brisbane. He scored one try in nine appearances for the Black and Whites.\n\nCraig Greenhill - A hard-nosed prop forward that came back to the city with the late Adam Maher in 2019. He played for Cronulla Sharks and Penrith Panthers in the NRL before lining up for Hull FC in 2002 and 2003, where he played 60 games, scoring three tries. He finished his career at Castleford in 2004.\n\nMatt Sing - The winger signed for Hull in 2008 and played two seasons with the club, making 48 appearances and scoring 17 tries. Before that, Sing turned out for Penrith, Sydney Roosters, and North Queensland Cowboys.\n\nJason Smith - The best Hull Maroon until last. Jason Smith was unbelievable during his time at Hull FC. He was still in his prime when he signed in 2001, staying with the club until 2004 after scoring 17 tries in 80 games. Upon returning to Australia, Smith played for Canberra Raiders and North Queensland, while also turning out for both Canterbury Bulldogs and Parramatta Eels in the 90s.\n\n(Image: Getty)\n\nNew South Wales\n\nDavid Boyle - A prop or back row who played his entire career in Australia with South Sydney. Boyle spent one season with Hull in 1988-89, playing 20 games and scoring one try.\n\nDavid Brooks - Played one season with Hull in 1987-88 after a stellar NSWRL career with Balmain Tigers. A goal-kicking back row forward, Brooks turned out 25 times for the Black and Whites, scoring two tries.\n\nNoel Cleal - Crusher used to chase wild boars growing up. Seriously. One of many ultimate rugby league hardmen. He played for Eastern Suburbs (today's Roosters) and Manly Sea Eagles Down Under before turning out for Widnes and Hull in England. He also coached Hull to 1991 Premiership winning glory after scoring 12 tries in 34 games for the Black and Whites.\n\nCraig Fitzgibbon - Fitzy is the current head coach of Cronulla Sharks. He enjoyed two years with Hull in 2010 and 2011, making 44 appearances and scoring nine tries. He played for Illawarra Steelers before the merger with St George Illawarra Dragons, then spent ten seasons with Sydney Roosters.\n\nSteve Folkes - The back row forward played his entire career at Canterbury Bulldogs either side of one season with Hull in 1989-90. Made 24 appearances for Black and Whites, scoring two tries.\n\nGeoff Gerrard - A back rower, prop, or centre who played for Parramatta, Manly, and Penrith before spending time in England with Wakefield and Hull. He played the one season at the Boulevard in 1985-86, scoring six tries in 24 games.\n\nDes Hasler - The half-back infamously got hypothermia whilst playing at the Boulevard in a Regal Trophy game. Played for Penrith, Manly, and the Western Suburbs in Australia, and had a year with Hull in 1993-94. He scored ten tries in 23 games.\n\nGraham Mackay - A goal kicking winger with more clubs than Nick Faldo. He played for Western Suburbs, Penrith, Sydney City, South Queensland Crushers, Gold Coast Chargers, and Manly in Australia before finishing his career in Super League with Leeds, Bradford, and then Hull. Mackay made 26 appearances for the Black and Whites, scoring 18 tries. He also kicked a field goal in the last-ever game at the Boulevard against New Zealand.\n\nJohn Muggleton - The brother-in-law of Peter Sterling, Muggleton was a strong running back rower from Parramatta, where he played his full NSWRL career barring one year at Balmain. He spent the 1984–85 season with Hull and scored an impressive 28 tries in 37 games.\n\nMark O'Meley - The Ogre started his career at the North Sydney Bears before moving to the Northern Eagles merger. He then turned out for Canterbury and Sydney Roosters before signing for Hull in 2010. Played four seasons for the Black and Whites, scoring 13 tries in 90 games, and retired at the end of 2013. A real crowd favourite.\n\nPeter Sterling - Sterlo played his entire Australian club career with Parramatta and is considered a legend of the western Sydney club. Part of the 1982 Kangaroo 'Invincibles' and signed for Hull in the 1983–84 and longer 1984–85 seasons. He only turned out 36 times for the club, scoring nine tries, but is still regarded as one of the best to ever adorn the irregular hoops.\n\nJosh Reynolds - The most recent ex-Hull player to turn out for the Blues, Reynolds played for both Canterbury Bulldogs and Wests Tigers in the NRL before turning out 25 times for Hull FC, scoring seven times. He left the club last year, re-joining the Bulldogs this season.\n\nSuper League Origin\n\nSean Ryan - The back-rower signed for Hull in 2002, playing the last-ever season at the Boulevard and the first ever at the MKM Stadium. Ryan played 56 games and scored nine tries for the club after signing from Cronulla, where he made one 'Super League War' Origin appearance for the Blues in 1997. He finished his career with Castleford.\n\nEx coaches\n\nRoyce Simmons, Phil Sigsworth, and Brett Hodgson all played for New South Wales during their careers. Remember Gordon Tallis throwing that Blues full-back around like a rag doll? Yeah, that was Hodgson. Time flies.\n\nRead next"}, {"url": "https://alchetron.com/Geoff-Griffin", "page_content": "Geoffrey Merton \"Geoff\" Griffin (12 June 1939 – 16 November 2006) was a cricketer who played two Tests for South Africa in 1960. In his second Test appearance in 1960 at Lord's, he became the first (and, as of November 2014, only) South African cricketer to take a hat-trick in a Test match, and also the first and only cricketer to take a Test hat-trick at Lord's. He is best known for being no-balled for throwing in his second Test and the exhibition match that followed, and never having played Test cricket again.\n\nGriffin was born in Greytown in the former Natal Province and was educated at Durban High School. He was tall and blond, and excelled in many sports, playing hockey for Rhodesia and under-19s rugby for Natal. He was also Natal champion in the high jump, long jump, triple jump and pole vault.\n\nGriffin suffered an accident in childhood which rendered him unable to straighten his right arm. There was continuing controversy about bowlers \"throwing\" or \"chucking\" the ball (that is, flexing their elbow in the action of bowling the ball, which is contrary to the Laws of Cricket). The issue had been controversial since the editor of Wisden, Sydney Pardon, claimed that Australian fast bowler Ernest Jones was throwing in the tour of England in 1896, and then Jones and C. B. Fry were both no-balled in the Melbourne Test in 1897. The issue achieved renewed prominence following the Ashes series in Australia in 1958–59, when Australians Ian Meckiff and Gordon Rorke were suspected of throwing. Other fast bowlers, such as West Indies' Charlie Griffith and New Zealand's Gary Bartlett were also suspected. The MCC was determined to stamp out the problem before the Ashes series in England in 1961, and English umpires were instructed to strictly enforce the rule against throwing in 1960.\n\nGriffin made his first-class cricket debut for Natal in the 1957–58 South African domestic season, as a fast bowler. Despite being no-balled in South African provincial matches in the 1959–60 season, Griffin finished at the top of the averages, with 35 wickets at a bowling average of 12.23, and was selected to tour England in 1960, aged 20. Griffin was no-balled eight times during the tour match against the MCC at Lord's in May 1960, the first time that a touring player was called for throwing, and no-balled again several times by various umpires in matches against the counties. His tried to change his action at Alf Gover's indoor school, and was not called once in the 42 overs that he bowled in the 1st Test at Edgbaston, although his pace was much reduced. In the search for quicker deliveries, he fell back into his old faults, and was called in a tour match against Hampshire.\n\nEnglish umpires Frank Lee and Syd Buller repeatedly called Geoff Griffin for throwing in the 2nd Test, at Lord's, starting from his third over. After being no-balled five times on the first day and six times on the second day, he returned for a final bowling spell on Saturday 25 June and dismissed M. J. K. Smith with the last ball of one over, caught behind by John Waite for 99, and then bowled Peter Walker and Fred Trueman with the first two balls of his next over. This was the first Test cricket hat-trick claimed by a South African cricketer. England immediately declared their first innings for 362 with 8 wickets down.\n\nEngland quickly dismissed South Africa twice to win by an innings and 73 runs, just after lunch on the fourth day, Monday 27 June, with Brian Statham taking 6–62 and 5–34. A 20-over exhibition match was arranged to fill the period until the scheduled presentation of the players to the Queen at tea. Griffin was again repeatedly no-balled in the exhibition match for throwing, and was also no-balled for failing to notify the umpires that he was changing to bowl underarm to complete an over. Griffin later recounted that Donald Bradman came to the dressing room to console him, and let him know that the umpires were acting on order from MCC president Gubby Allen.\n\nGriffin remained on the tour as a batsman, but never played Test cricket again. Many spectators could see no difference between his \"legitimate\" deliveries, and the ones that were no-balled: many concluded that he threw every delivery. The public saw him as a martyr and scapegoat, and he was warmly applauded by the spectators at all of his subsequent tour matches. None of the controversial Australian bowlers from the 1958–59 Ashes series toured England in 1961.\n\nHe moved to play for Rhodesia, but his cricket career ended less than two years later, at the age of 23, after he was no-balled playing in a Currie Cup match against North Eastern Transvaal at Salisbury.\n\nIn retirement from cricket, he played club cricket, was a cricket coach, and worked as a hotel manager for South African Breweries in Durban, at the Argyll, and then at the Congela Hotel. He married twice.\n\nGriffin died of a heart attack in Durban."}]}