{"Griffin was a talented player who was known for his speed and agility.": [{"url": "https://www.espn.com/nba/columns/story?page=EddieGriffin", "page_content": "These are various thoughts and observations, prompted by a tragic story.\n\nThis is coming from a distance, words about a person I don't know well, about a death whose precise circumstances we don't yet know for sure.\n\nWas Eddie Griffin trying to kill himself when he drove his SUV past railroad gates and flashing lights and into the side of a moving freight train in Houston last week? It will likely be some time before an investigation is complete, just as it took more than four days to identify Griffin because his body was burned so badly in the fiery crash that dental records were required for identification.\n\nBut what we do know of Griffin is this: The stream of incidents, arrests and unsuccessful stints in rehabilitation centers allows us to list him as Exhibit A in the argument that just because you can enter the NBA, that doesn't mean you should.\n\nAn ex-player I talked to Tuesday called Griffin \"a perfect example of a kid who shouldn't have went to the NBA early.\"\n\nI saw the other extreme over the weekend in Las Vegas, where young men with zero or one year of college experience such as LeBron James, Dwight Howard and Kevin Durant were gathered for the Team USA training camp. These are people who have stayed out of trouble, who seem capable of handling the extreme world of the NBA. Griffin's failures should not be a reason to deny opportunities for those who are ready.\n\nBut they should serve as a warning, a reminder that the most important part of college isn't the course credits, it's the socialization. It's about making the transition to adulthood in a sheltered environment where the mistakes aren't as costly as they are in the real world.\n\nIt's clear Griffin never learned to be responsible or accountable during his one year at Seton Hall or the six seasons he spent in the NBA. Maybe his problems were too serious for anyone in the league to deal with, even if teams' top priorities hadn't been making money and winning games. Regardless, it was the wrong environment for someone so unstable. Youth and money and loads of unsupervised time were a toxic combination for him.\n\nGriffin also is a case study in the temptation of talent.\n\nBecause of a fight with a teammate, he had to finish high school by studying at home instead of going to class and walking across a stage to get his diploma. In his year at Seton Hall, he punched out a teammate in the locker room.\n\nAnd yet the Rockets traded the rights to their three first-round draft picks (Jason Collins, Richard Jefferson and Brandon Armstrong) to get Griffin's draft rights in 2001.\n\nWhile in Houston, Griffin pleaded guilty in an assault case, and yet the Nets and then the Minnesota Timberwolves signed him to free-agent contracts. He later was jailed for violating probation, and yet the Timberwolves re-signed him, this time to a three-year, $8.1 million extension. They wound up cutting him loose in March.\n\nBefore his self-destructive tendencies turned deadly, they were expensive. Before he cost those who loved him the chance to see him again, he cost teams money, players and time. But who's to blame for that?\n\nThere's a blinding arrogance teams get when they covet talent. They think they can make it work for them, when all the evidence suggests otherwise.\n\nLate Tuesday night I talked to someone who did know Griffin well, Houston Rockets vice president of basketball operations and athletic trainer Keith Jones.\n\nJones last saw Griffin at a restaurant in Houston in May. He said Griffin seemed alert and optimistic. He talked about his daughter. He said his troubles, the most recent of which was a league-imposed substance abuse suspension that effectively ended his stay in Minnesota, were behind him\n\n\"I said, 'Eddie, you always tell me, \"Yeah, yeah, yeah,\" then I find out different,'\" Jones said. \"He said, 'I'm taking care of it.'\"\n\nSounds like the voice of an addict, never acknowledging the extent of the problem.\n\nAs the dialogue implied, Jones had had that type of conversation with Griffin before. He knew Griffin well enough that the news of his death saddened him, but didn't completely surprise him.\n\n\"I can't say it shocks me,\" Jones said. \"It's still really sad and really tragic. And Eddie was a good guy. He had a good heart. He made some bad decisions on a lot of things. I think he had people that were guiding him, that he thought were guiding him, that didn't have his best interests in heart.\"\n\nJones said the Rockets did what they could to look after him while he played for them. In addition to the league-mandated rookie orientation program the incoming players are required to attend, the Rockets had a team security staffer look after Griffin. And they worked with a realtor who not only helped Griffin buy a home, she helped him with the details of life, such as opening a checking account.\n\n\"I thought we did a good job providing some guidance for him,\" Jones said. \"And giving him something solid to work with and solid people to look after him.\n\n\"You can't be with him 24 hours a day. You can only do so much. If a guy doesn't want help and isn't ready to change, he isn't going to.\"\n\nBy the time they get to the NBA, it's too late.\n\n\"There's those things that he didn't learn that most 17-, 18-, 19-year-old guys learn at some point, from their father or some other male figure,\" Jones said.\n\n\"Eddie was one of those AAU phenoms. They didn't teach him, they brought him along to win games. There's one more statistic, right there.\"\n\nJones is left with one last, nagging thought.\n\n\"I know he trusted me,\" Jones said. \"I know he knew I never asked him for anything, never wanted anything except for him to be successful. The whole thing that bugs me is I wish he would have trusted me enough, if he was drinking, or whatever happened, that he would call. If something was bothering him, he would have called one more time.\"\n\nI can't believe some of the strange and sad phrases associated with Griffin that came out while doing some research on him. These old news stories here and here (which I found through a Minnesota-based Web site called MNspeak.com) contained the unusual charge of \"deadly conduct\" and a probation violation for \"consorting with disreputable people.\"\n\nIn March 2004 Griffin plea-bargained to a misdemeanor charge of deadly conduct after facing a felony charge of aggravated assault that stemmed from an accusation that he punched and shot at a woman who came across Griffin with another woman in his Houston house. That prompts two questions: (1) How can something as serious-sounding as \"deadly conduct\" only be a misdemeanor? (2) In retrospect, wasn't his adult life an extended episode of deadly conduct, one practically destined for an early fatality?\n\nThe deadly conduct guilty plea resulted in an 18-month probation. While serving it, Griffin was sentenced to 15 days in jail because he was at a Houston nightclub when a fight broke out.\n\nA court official said Griffin violated probation because he was \"consorting with disreputable people.\" I wonder how many people would be better off if we consistently made that a jailable offense, if we forced them to choose between the company they keep and their best interests.\n\nWe've seen how Michael Vick was unable to escape his crowd and its dogfighting culture. While Griffin, apparently, was not surrounded by people who could guide him to the right path, in the end he wasn't able to escape himself.\n\nThe 2001 draft is starting to resemble the cursed Class of 1986 when it comes to tragedy and disappointment.\n\nGriffin's death follows the failure of No. 1 overall pick Kwame Brown in Washington, the unrealized potential of Tyson Chandler and the bad behavior of Zach Randolph that caused the Trail Blazers to dump a 20-and-10 guy for a player they didn't even want to keep.\n\nLikewise, the 1986 draft was overshadowed by the cocaine-overdose death of Len Bias, and drug-wasted careers of Chris Washburn and Roy Tarpley, plus the injury-shortened career of top pick Brad Daugherty.\n\nOne of my first reactions to the sad news was that I never really got to know Eddie Griffin. Later I realized that's because he never played in the playoffs. The playoffs are when casual fans get to know players' names and faces, and when we in the media get to know out-of-town players' personalities. You spend a week or two with a team over the course of a series and you get a little sense for who they are. But he never played in May, a sad reflection on his career and the teams that acquired him.\n\nIf most sports fans remember him at all, it's probably because last season he was in a car crash that witnesses said occurred because he was driving while watching a porno DVD and masturbating. That was good for a few yuks around the blogosphere. But maybe we should have taken it more seriously, recognizing it for what it was: a sign of his descent.\n\nIt was a warning that went ignored, just as, surely, some other unprepared teenager will someday fail to pay attention to the lessons of Eddie Griffin, and some team will take that risk.\n\nJ.A. Adande joined ESPN.com as an NBA columnist in August 2007 after 10 years with the Los Angeles Times. Click here to e-mail J.A."}, {"url": "https://www.theguardian.com/sport/2018/mar/04/shaquem-griffin-nfl-combine-40-time-record", "page_content": "The NFL combine, in which college players show off their skills to scouts and coaches, is usually dominated by athletes who have been tipped for greatness for years. This year’s star is a little different.\n\nWhen Shaquem Griffin was a child, his left hand was amputated due to a pre-natal condition. He nevertheless grew up to star for his high school in track, football and baseball before winning an athletics scholarship to the University of Central Florida alongside his twin brother, Shaquill.\n\nSome believed UCF had offered Shaquem a place just to curry favor with Shaquill. If that was true the coaching staff were soon pleasantly surprised: the linebacker was named American Athletic Conference defensive player of the year in 2016.\n\nAt this week’s combine, Shaquem was again expected to be a curiosity rather than a standout performer. But on Saturday he bench-pressed 225lb 20 times, using a prosthetic hand. His previous best was 11 and his twin, who turned pro early with the Seattle Seahawks) had only managed 17 last year.\n\n“Everybody in the stands was hyping me up,” Griffin said. “ I got the guys I’m here with hyping me up. It felt amazing.”\n\nOn Sunday, Griffin was even better in the 40-yard dash, an important event in a league where speed is a coveted skill. His time of 4.38 seconds was the fastest ever by a linebacker – 4.65 is considered outstanding – and the exact same time as his brother, a cornerback, managed last year. Shaquem’s time was also faster than the combine’s top-rated wide receiver, Calvin Ridley and running back Saquon Barkley, who is considered a future star.\n\n“This is a legitimate football player,” NFL Network analyst Mike Mayock said. “He’s an energy giver.”\n\nGriffin’s performance created a buzz among scouts and coaches – and also caught the attention of NFL players. “Shaquem Griffin killing it,” tweeted three-time NFL defensive player of the year JJ Watt, of the Houston Texans. Four-time Pro Bowler Richard Sherman wrote: “If @Shaquemgriffin doesn’t get drafted in the first two days the system is broken. Productive and performed well at the combine. Played well against high level competition.”\n\nShaquem Griffin killing it. — JJ Watt (@JJWatt) March 4, 2018\n\nIf @Shaquemgriffin doesn’t get drafted in the first two days the system is broken. Productive and performed well at the combine. Played well against high level competition. — Richard Sherman (@RSherman_25) March 4, 2018\n\nGriffin’s performance should be met with some caveats. Although the drills at the combine show coaches what players are capable of they are not predictors of success in the professional game. Many NFL stars have performed modestly at the event. Other players have displayed blazing speed only to struggle in the pros.\n\nHowever, Griffin did himself no harm in Indianapolis this week and is expected to be picked up by a team in the later rounds of the draft."}, {"url": "https://www.nytimes.com/2021/01/02/sports/basketball/blake-griffin-detroit-pistons.html", "page_content": "There must be some mistake. There is no way Blake Griffin, the star forward for the Detroit Pistons, is in his 11th N.B.A. season. Wasn’t he just soaring over the hood of a Kia to win the slam dunk contest? Being schooled in “dunkology” by Jeff Goldblum? That was almost a decade ago?\n\nIt’s true. Griffin has entered the 2020-21 season as the third oldest player on the Pistons, behind Derrick Rose and Wayne Ellington.\n\n“It’s just happened so fast,” Griffin, a six-time All-Star, said in a recent phone interview, adding later: “I saw on our roster, I was seeing the birth dates and it was like, some guys were born in 2001. I was like, ‘Oh, my gosh. I feel ancient.’”\n\nGriffin, 31, is a year removed from one of the best seasons of his career and a dozen years older than two of his rookie teammates, Killian Hayes and Isaiah Stewart. Griffin has plenty of games left, he said. But in basketball years, in a league in which the best players seem to get younger every season, he is akin to middle-aged."}, {"url": "https://www.profootballhistory.com/archie-griffin/", "page_content": "Archie Griffin was tailor-made to be a running back.\n\nAt 5’9” and 190 pounds, he was tough and elusive and racked up huge yardage in high school and college.\n\nGriffin was so good at Ohio State University that he became the first, and still only, two-time Heisman Trophy winner.\n\nThe @Bengals were established in 1967. They go for their 1st Super Bowl today against the @RamsNFL in #SuperBowlLVI. Former 2x Heisman winner and Bengals great Archie Griffin said it best: \"It's not the size of the dog in the fight, but the size of the fight in the dog.\" pic.twitter.com/7fUU7XsZlw — Kendal Steele 🏟⚖️ (@K_Steele1) February 13, 2022\n\nA first-round NFL draft pick, Griffin never did pan out as a member of the Cincinnati Bengals.\n\nAlthough his professional football career didn’t amount to much, his career as a businessman has been a success.\n\nThis is the story of Archie Griffin.\n\nA Football Family\n\nArchie Mason Griffin was born on August 21, 1954, in Columbus, Ohio at Ohio State University Hospital.\n\n“He’s a better young man than he is a football player, and he’s the best football player I’ve ever seen.” – Woody Hayes on Archie Griffin. pic.twitter.com/bEfzlgT2yT — Eleven Warriors (@11W) August 21, 2020\n\nHe was one of eight Griffin children, born into a tight-knit family of athletes.\n\nArchie’s father, James, played guard as a football player and boxed before working in the coal mines of West Virginia.\n\nThree of Archie’s older brothers played football and would matriculate to play the sport at the college level.\n\nGriffin’s younger brother, Ray, would also play football.\n\nBefore Archie was born, the Griffin family moved to Columbus, where James worked three jobs.\n\nDespite the fact that he frequently worked 20-hour days, James Griffin made time to travel and watch his boys.\n\nInitially, Archie played football for fun while also gorging on candy from a family-run grocery store.\n\nAs he grew, Griffin became known as “Tank” due to his size and clumsy gait on the field.\n\nWanting to be like his older brothers, Griffin quit consuming candy bars and instead focused on getting in shape.\n\nBeginning in middle school, Griffin began a workout plan that included running to his school and back, lifting weights with a makeshift weight set, and doing sit-ups and jumping jacks.\n\nOnce he became slim and trim, Griffin joined his school’s track team as a member of the 440 and 880 relay teams.\n\nAt the same time, he began playing fullback for the football team and displayed a knack for the position.\n\nEastmoor Star\n\nShortly after arriving at Eastmoor High School, Griffin asked head football coach, Bob Stuart, a question.\n\n“Archie walked on the field and asked what he had to do to play first string,” said Stuart. “He was ready to play right there. He started as a sophomore, and by his final year he was just scary. I can never remember one man tackling him; you had to bring folks. Heck, Archie played the last three games with a broken bone in his foot, and they still couldn’t catch him.”\n\nGriffin’s sophomore year was highlighted by a 75-yard score in his second game as a starter.\n\nAs a junior, Griffin toted the rock for over 1,000 yards.\n\nThen, during his senior year, Griffin blew the doors off opponents by averaging over seven yards per carry and running for 1,787 yards and 29 touchdowns.\n\n“We used to sit and pray for him to get someone in a one-on-one situation, Archie would beat the guy every time,” Stuart said. “On top of all that, he had a ton of courage. That’s something you can never measure in a person, but it stuck out all over on him.”\n\nAfter a 9-1 season, Eastmoor advanced to the city championship where Griffin dashed for another 267 yards, leading the Warriors to the city title.\n\nForty years ago, a former Eastmoor High School and Ohio State University graduate, Archie Griffin, competed for the Bengals in Super Bowl XVI (16) and has much to share about his experience before and after the world was watching. #OurCCS READ: https://t.co/ZCGfc0qs6e pic.twitter.com/juiPDl4I9V — Columbus City Schools (@ColsCitySchools) February 11, 2022\n\nHe was then named Player of the Year for Ohio.\n\nFive Star Recruit\n\nPlaying in a football-mad state like Ohio led to national attention as Griffin’s 3,382-yard and 47-touchdown prep career came to a close.\n\nHe received over 150 recruiting offers from every corner of the country.\n\nGriffin wanted to play close to home, but he also wanted to go somewhere he could play immediately.\n\nNorthwestern was on his radar as well as Navy, Louisville, and Michigan.\n\nOhio State University was practically in the Griffins’ backyard, but they were unsure of the fit between Archie and Buckeyes coach Woody Hayes.\n\nHowever, Hayes wasn’t about to miss out on the state’s hottest recruit.\n\n#ThrowbackThursday\n\nWoody Hayes and Archie Griffin pic.twitter.com/vw5swgMXFc — The Sporting News Archives (@sportsphotos) May 26, 2016\n\nThe coach pulled out all the stops to get Griffin and assure him he would do well at OSU.\n\n“Woody was messing around with the wishbone back then,” Stuart recalls, “and Archie was afraid he’d never see the ball if he went to Ohio State. So Woody took him into an office, closed the door and spent a lot of time X-ing and O-ing. When they came out two hours later—zippo, that was it.”\n\nIt also helped that Hayes reminded Griffin of what the Buckeyes could provide for him.\n\nHayes said, “I told Archie that he’d play better for us because he’d get better blocking. That’s pretty obvious. We can block, you know.”\n\nThe Griffin family liked Hayes and his wife, who assisted in the recruiting, and Archie finally picked OSU.\n\n“If I went anywhere but Ohio State, my mommy would die,” said Griffin.\n\nGriffin Starts As A Freshman\n\nGriffin became a college athlete at the perfect time.\n\nHe arrived on campus in 1972, the same year that the NCAA allowed freshmen to play varsity basketball and football for the first time.\n\nHayes, however, was an old-school coach and listed Griffin as a backup to begin the season, believing that upperclassmen should start.\n\nBy the second game of the year against the North Carolina Tar Heels, even Hayes’ assistants were questioning his decision.\n\nThe Heels struck the first blow and were ahead 7-0 with the OSU offense sputtering.\n\nSeeing the writing on the wall, Hayes turned and summoned Griffin into the game.\n\nAfter nearly running onto the field without a helmet, Griffin settled his nerves with a quick prayer then set about torching the ‘Heels.\n\nIn barely three quarters of work, Griffin set a program record with 239 yards and a touchdown to boot.\n\nArchie Griffin debuted for the Buckeyes today in 1972. In his second game that season, he would set the team's then-single game rushing record (239 yards). Pay homage. pic.twitter.com/7MwWZH1crk — HOMAGE (@HOMAGE) October 1, 2019\n\nWhen he exited the game for the final time, Griffin was met with a standing ovation from the OSU faithful.\n\n“It was one of the most incredible sights of my life,” Griffin said. “Amazing how your life can change in a day, from sunup to sundown.”\n\nHayes didn’t need any more convincing, and Griffin remained his starting tailback for the remainder of the ‘72 season.\n\nThe Buckeyes would finish the season 9-2 including a loss to top-ranked USC in the Rose Bowl.\n\nGriffin ended his freshman season with 867 rushing yards and three scores.\n\nSophomore Year\n\nGriffin was just getting started.\n\nIn 1973, he led the country with 1,577 yards and added eight total touchdowns.\n\nEven more soul-crushing for opponents, Griffin only got better as the season wore on.\n\n“In the face of adversity, you find out if you’re a fighter or a quitter. It’s all about getting up after you’ve been knocked down.” Archie Griffin pic.twitter.com/H7ZkZtXiL5 — Mack Brown (@CoachMackBrown) November 3, 2018\n\nAgainst fourth-ranked Michigan in the penultimate game of the year, Griffin pounded the Wolverines for 163 yards.\n\nThen, in the Rose Bowl against seventh-ranked USC, Griffin tallied 147 yards to help OSU to a 42-21 win.\n\nDuring the college awards season, Griffin was named the Big Ten’s MVP and was selected as a first-team All-American and first-team All-Big Ten.\n\nHe also finished fifth in the Heisman Trophy balloting.\n\nHeisman Winner\n\nWith two conference championships in the past two years, Ohio State was ready to try for a third in 1974.\n\nThe team was cruising until they hit a speed bump against Michigan State on November 9 when the Spartans defeated number one OSU by three.\n\nMeanwhile, Griffin kept piling up huge numbers.\n\nDuring the ‘74 season, he continued rushing for at least 100 yards in each game, a streak he started as a sophomore.\n\nGriffin also led the nation again in rushing with 1,695 yards and 12 touchdowns.\n\nBy that time, Hayes couldn’t contain his glee about coaching arguably the nation’s best college player.\n\n“Archie Griffin is the greatest back I’ve ever seen or coached,” Hayes said.\n\nWhen interviewed about his amazing year, the always humble Griffin deflected praise and made sure to acknowledge his teammates.\n\n“Can you make sure you put something about my (offensive) line in there,” Griffin asked a reporter. “I have no problem getting through the holes the line opens up. All I have to do is run.”\n\nOpposing coaches were baffled by Griffin’s running ability, fueled in part by strong legs as well as outstanding field vision.\n\n“He has unbelievable peripheral vision,” commented University of Indiana coach Lee Corso. “I saw him go through a hole in our line that wasn’t there. It was an off tackle to the left. You could see the hole develop, but then three of our men played it perfectly and closed it up. Griffin suddenly got through for 12 yards. It was one of the greatest runs I’ve ever seen.”\n\nOSU ended its season as Big Ten co-champion and a loss in the Rose Bowl against USC.\n\nDespite the setback, Griffin was voted conference MVP for the second time (one of three players to win the award twice) and was honored as a first-team All-American and first-team All-Big Ten Conference.\n\n#OnThisDay this day in 1974, legendary #OhioState University running back Archie Griffin won the Heisman Trophy. He won his second Heisman a year later, and remains the only college player to ever win it twice. pic.twitter.com/tqdfCFf4gF — Ohio History Connection (@OhioHistory) December 27, 2020\n\nBetter yet, he received the majority of ballots to become the 1974 Heisman Trophy winner.\n\nAdditionally, Griffin was the UPI and Sporting News’ Player of the Year and Walter Camp Award winner.\n\nHistory is Made\n\nEntering the 1975 season, there were those in the media that believed Griffin had already won a Heisman Trophy and that the award should be given to someone else.\n\nAfter all, no one had won the coveted award more than once, so why start now?\n\nGriffin then proceeded to run for 1,450 yards and four rushing scores and added 170 receiving yards.\n\nThe Buckeyes had college football’s best backfield that year as junior Pete Johnson had over 1,000 yards himself.\n\nGoing into the Rose Bowl for the fourth straight year, OSU was undefeated and ranked first in the nation.\n\nThey were Big Ten champions and only had to defeat UCLA to win the national title.\n\nThat didn’t happen, and the Bruins upset Griffin (playing in an unprecedented fourth Rose Bowl) and the Buckeyes 23-10.\n\nDespite their reservations, the Heisman voters couldn’t ignore the stats and Griffin became the first player in college history to win the award twice.\n\nOn this date in 1975, @OhioStateFB running back Archie Griffin won the Heisman for the second straight year. He remains to this date the only player to ever win the award twice. pic.twitter.com/xwoScwBtue — ESPN Stats & Info (@ESPNStatsInfo) December 2, 2020\n\nHe also received his third straight first-team All-American and first-team All-Big Ten nods as well as a second UPI and Sporting News Player of the Year Awards, a second Walter Camp Award, and the Maxwell Award as the best college player.\n\nGriffin received the Chicago Tribune Silver Football Award twice while at OSU and was the recipient of the NCAA Top Five Award as a senior, given to the player who exudes excellence in academics, athletics, and leadership.\n\nFor his career, Griffin had 5,589 total yards, 26 rushing touchdowns, 350 receiving yards, and another score.\n\nHe was college football’s all-time rushing yards leader until Pitt’s Tony Dorsett broke the record in 1976.\n\nGriffin still owns the NCAA record of 31 consecutive games with over 100 yards rushing.\n\n@OhioStateFB RB Archie Griffin, might’ve been the best to don #45. He set an NCAA record of 31 consecutive regular season games with 100 or more rushing yards. He is also the only player to receive the Heisman Trophy twice (1974-75). #ImARealFan #45daysuntilCFB pic.twitter.com/KefYf1bFMh — College Football Hall of Fame (@cfbhall) July 10, 2019\n\nSince leaving OSU, Griffin has been added to the program’s Varsity O Hall of Fame, had his number 45 retired by the university (the first for a Buckeye athlete), been inducted into the College Football Hall of Fame in 1986, and been inducted into the Rose Bowl Hall of Fame in 1990.\n\n“There are a lot of places that mean a lot to me, but Ohio Stadium was huge for me because of the way things happened and the magnitude of being in this place and playing in front of 80-some-thousand people,” said Griffin in 2022.\n\nGriffin Becomes a Bengal\n\nIt’s rare that a pro athlete can play his entire sports career in the same state.\n\nGriffin played high school and college ball in Ohio and remained there when the Cincinnati Bengals made him the 24th overall pick of the first round in the 1976 NFL Draft.\n\nApril 8, 1976 – Paul Brown announces that the Bengals have selected the only 2-time Heisman Trophy winner, RB Archie Griffin. This Day In Bengals History, Geoff Hobson pic.twitter.com/Jc6ParL4bA — 𝗕𝗲𝗻𝗴𝗮𝗹𝘀𝗖𝗮𝗽𝘁𝗮𝗶𝗻 🐯⚓ (@BengalsCaptain) April 9, 2020\n\nTeam owner Paul Brown wanted to add Griffin to a Bengal’s offense led by quarterback Ken Anderson.\n\nCincinnati lost to the Oakland Raiders in the 1975 postseason by three points, and it took three Bengals running backs combined to rush for 1,277 yards that same year.\n\nA better running game, in theory, would help Cincy get further in the playoffs and possibly land a trip to the Super Bowl.\n\nAs a rookie, Griffin started all 14 games but had difficulty on the gridiron for the first time in his life.\n\nIn 1976, he rushed for just 625 yards and three touchdowns as the Bengals ended the year 10-4 and missed the playoffs.\n\nArchie Griffin pounds the rock for the Cincinnati Bengals against the Vikings. pic.twitter.com/FinEA0IX7C — SportsPaper (@SportsPaperInfo) June 11, 2015\n\nThe following year, Cincinnati selected Griffin’s former OSU teammate, Pete Johnson, in the second round of the 1977 draft.\n\nCincy’s win total would fall to eight, and Griffin had 549 yards and failed to find the end zone.\n\nThe Bengals stumbled with two coaches in 1978 when Bill Johnson was fired after an 0-5 start and Homer Rice went 4-7 the rest of the way.\n\nGriffin’s brother, Ray, was selected by the Bengals with the 35th pick in the second round, reuniting the brothers who had also played together in college.\n\nArchie Griffin was kept from scoring a rushing touchdown again in ‘78 while running for 484 yards.\n\nHe did have three receiving touchdowns.\n\nCincy Reaches the Super Bowl While Griffin Watches\n\nIn 1979, Griffin had his best output as a pro when he totaled 688 yards with two receiving scores.\n\n\"It's not the SIZE of the dog in the fight, but the size of the FIGHT in the dog\". – Archie Griffin, Cincinnati Bengals #MotivationalMonday pic.twitter.com/YzrvuevFym — NFL Legends (@NFLLegends) July 3, 2017\n\nHe also had a career-high 417 receiving yards.\n\nJohnson outgained his backfield mate in 1980 with 747 yards and seven total scores to 260 yards and no rushing touchdowns (for the fourth straight year).\n\nIt didn’t help that Griffin sustained an Achilles injury partway through the season.\n\n1981 would be a success story for the Bengals as second-year coach Forrest Gregg guided the team to a 12-4 record and wins against Buffalo and San Diego in the playoffs.\n\nSure enough, Cincy was realizing its dream of reaching the promised land, except Archie Griffin didn’t take them there.\n\nDelegated to backup duty, Griffin barely saw the field during the Bengals’ run to Super Bowl XVI.\n\nHe started two games and ran for 163 yards and three touchdowns.\n\nJohnson outgained him again and rushed for 1,077 yards and 16 total touchdowns.\n\nDuring the Super Bowl, Griffin received one carry for four yards.\n\nGriffin Retires\n\nIn 1982, Griffin was back on the bench again and appeared in nine games, leading to 39 rushing yards and one touchdown.\n\nAfter the season, he retired and then briefly played with the Jacksonville Bulls of the USFL.\n\nThe only 2 time winner 1974 & 1975 of the Heisman Trophy from Ohio State Archie Griffin. Played 7 years for the Cincinnati Bengals 1976-82 and the Jacksonville Bulls 1985 pic.twitter.com/zO3SWoLWEA — Cool Old Sports (@CoolOldSports) June 13, 2022\n\nDuring his NFL career, Griffin had totals of 2,808 rushing yards, seven rushing touchdowns, 1,607 receiving yards, and six receiving scores.\n\nBecause of his outstanding collegiate career, Griffin’s disappointing pro career has led many football pundits to label him as a bust.\n\nHowever, others have pointed out that Paul Brown preferred larger backs such as Johnson and that Griffin did not get enough carries.\n\nGriffin himself affirms that fact but also notes that his yards per carry were good as a pro.\n\n“Underrated? It depends on what the expectations are,” Griffin said in 2016. “When I went into pro football, my expectations were to originally get 1,000 yards a season. However, I found out quickly that I wasn’t going to get the ball enough to get 1,000 yards. I changed that goal to average five yards a carry. I didn’t quite reach five, but I think any running back in the NFL, if they can say he averaged over four yards a carry over the course of a career, they’d be happy with it.”\n\nGriffin averaged 4.1 yards per attempt in his career.\n\nLife After Football\n\nWhen he was in college, Griffin majored in Industrial Management and graduated shortly after the fall semester ended in 1975.\n\nDuring his career with the Bengals, Griffin invested in a retail business selling athletic shoes.\n\nEventually, he had six stores but the business folded due to a poor economy and a push to expand the business too quickly.\n\nThat ultimately led to bankruptcy and Griffin’s vow to be more cautious in the future.\n\n”I guess you can say I’ll be quite conservative in the future. I won’t go into a business until I can be there and run it,” said Griffin in 1982.\n\nGriffin rebounded to become CEO of OSU’s Alumni Association and was the Buckeyes’ associate athletic director for a time.\n\n\"In the face of adversity, you find out if you're a fighter or a quitter\" – Archie Griffin #OhioState #Buckeyes #OSU pic.twitter.com/x58qYZx3rZ — Ohio State SPORTalk (@SPORTalkOSU) November 17, 2015\n\nHe is on the Board of Directors for an insurance company, Abercrombie and Fitch, the College Football Hall of Fame, and the National Football Foundation.\n\nPrior to 2014, Griffin and former Lakers star Magic Johnson co-owned the Dayton Dragons, a minor league team for the Cincinnati Reds.\n\nGriffin and his wife, Bonita, have been married for over 30 years and have two sons, Andre and Adam, who played football.\n\nReferences\n\nhttps://www.nytimes.com/1982/01/07/sports/griffin-s-days-of-glory-are-fading-into-memories.html\n\nhttps://www.bengals.com/news/still-a-buckeye-once-a-bengal-17838485\n\nhttps://www.richlandsource.com/sports/football/archie-griffin-a-hometown-hero-with-a-columbus-story/article_208fd07a-b640-11e9-a7a1-6bdb64799b12.html\n\nhttps://en.wikipedia.org/wiki/Archie_Griffin\n\ncollegefootballcrazy.com\n\nhttps://vault.si.com/vault/1975/09/08/good-man-in-the-long-run\n\nhttps://footballfoundation.org/honors/hall-of-fame/archie-griffin/1953\n\nhttps://www.cincyjungle.com/2015/4/22/8464753/no-7-bengals-draft-bust-of-all-time-archie-griffin\n\nhttps://www.sports-reference.com/cfb/players/archie-griffin-1.html\n\nfanbuzz.com\n\nhttps://alumnimagazine.osu.edu/story/archie-griffin-shoe\n\nhttps://www.pro-football-reference.com/players/G/GrifAr00.htm\n\nhttps://ohiostatebuckeyes.com/archie-griffin/\n\nwww.heisman.com"}, {"url": "https://comicvine.gamespot.com/griffin/4005-15386/", "page_content": "Origin\n\nJohnny Horton\n\nJohnny Horton was a street thug who was known for his big fist, bad temper and small brain. Johnny tried to make a name for himself when he joined a gang in New Orleans but wasn't going anywhere. A guy from Chicago hired Johnny for some local muscle and they were impressed so they introduced him to the Secret Empire. Johnny told them he wanted to be more than a cheap hood and the Empire promised to make him a super villain. Johnny agreed and underwent a dramatic operation where the Secret Empire permanently grafted onto him a mane, wings and replaced his hands with lion's paws. His face turned dead white after the procedure and the Griffin was born.\n\nHis first assignment for the Secret Empire was to kill the Beast. The mutant known as Angel witnessed the battle and intervened when the Beast kicked the Griffin in the face and Horton plummets from a great height. Angel tried to catch the Griffin but he quickly recovered and knocked out the mutant with one punch. Beast saved his friend while the Griffin retreated. Griffin informs Number One that the Beast was assisted by Angel so the Empire ordered him to kill Angel as well. The Griffin attacks the Beast after he attends a meeting with Patsy Walker and her husband, Buzz Baxter. Angel tries to help the Beast subdue their powerful enemy and a fierce fight ensues. Griffin goes airborne with the Beast in his clutches and attempts to bite him with his fangs. The Beast manages to turn his body around and use his long arms to grab the Griffin's wings. The Griffin is unable to control his wings and begins to quickly descend. During the free fall, Griffin is punched in the jaw by Angel and knocked unconscious.\n\nCreation\n\nGriffin was created by Steve Englehart, Tom Sutton, Frank Giacoia and John Tartag\n\nHistory\n\nGriffin\n\nHorton would continue to work for the Empire and still consume the serum that transformed him into the Griffin. The serum drove him insane and he ended up killing the doctor that performed the surgery. This led to a confrontation with Beast and Spider Man where the two heroes barely defeated him. The Griffin would later team up with Crimson Dynamo and the Titanium Man to battle the Champions. This group shortly disbanded after they were defeated. The Griffin's facial features would change during a confrontation with Spider Man and Wonder Man. The Griffin evolved once more and his face became more bestial. The Griffin was presumed dead when a burning plane he attempted to lift fell on him during that battle. The Griffin survived when he dug a tunnel with his claws under the burning wreckage. Griffin was discovered roaming the Adirondacks by Headlok and became his mental slave. They ended up battling the West Coast Avengers but Griffin was eventually subdued when Tigra was able to calm his bestial side.\n\nNamor would run into the Griffin when Desmond Marrs enlisted him to kidnap Carrie Alexander in order to draw out of hiding the mystery man who is the real power behind Oracle Inc. Desmond and his sister Phoebe Marrs realized that the Prince of Atlantis was alive when everyone presumed he was killed during an Atlantean invasion a few months earlier. Namor battled Griffin near the Statue of Liberty and was able to defeat him by taking the beast out of his element and take the fight underwater. Namor caged the Griffin inside a dockside warehouse and was able to tame the beast. He taught the Griffin that Namor was his master and to remain docile under his command. Namor rode the Griffin and crashed a meeting at the Roxxon Plaza in order to get answers on why he was attacked. Namor got his answers and left the Griffin inside the Roxxon boardroom. Namor and the Griffin would reunite once more during an adventure to the Savage Land and come into conflict with the Super Skrull.\n\nSecret Invasion\n\nGriffin would return to villainy and join the The Hood's new iteration of the Masters of Evil and battle the Avengers on a few occasions. Griffin was later seen with the Masters.battling the Skrulls during the Secret Invasion crisis.\n\nDark Reign\n\nGriffin & Mandrill hunt for Spiders!\n\nNorman Osborn would appoint the Hood as Camp HAMMER's new chief operating officer and his men are legally working for the government to capture dangerous fugitives. The Hood sent Griffin, Razorfist, Living Laser and the Scorcher to go after Gauntlet and Tigra when they went AWOL. He was also a part of the Hood's plan to steal a vast fortune from a rich Arabian prince. Later on after the robbery and the burning of one of Hood's hide outs, Griffin got drunk with other members of the gang and got arrested for their recklessness. He and the others would later be let free by the Hood. However Griffin was angry that the Hood didn't free them earlier. He tries to kill the Hood but is wounded in the process as the Hood shoots him multiple times in the legs.\n\nThe Hood has powered up members of his Masters of Evil with the Norn Stones which were given to him by Loki. The Hood wanted to juice up his crew so they could go hunt down some Avengers. The Griffin tells Mandrill that they are being used and that he had no interest to hunt the Avengers. He also tells the Mandrill that he's too afraid to run and have a price on his head. Mandrill tries to tell Griffin that this is the opportunity to become part of Osborn's A-list team and taking down the Avengers would be a great chance to bump up their status. Griffin tells Mandrill he would rather die and is only doing this for the money. Mandrill would spot Spider Man and Spider Woman with his suped up vision and the two engage the Avengers. Spider Man has noticed that the Griffin is more powerful than their previous encounter before he is blasted off the roof by a mind-controlled Spider Woman. Griffin and Mandrill enjoy the assault on Spider Man by the possessed crimson beauty. Spider Man refuses to strike Spider Woman as he gets bombarded by venom blasts and body blows. Spider Man keeps talking to Spider Woman until she tells the wall-crawler that she is being controlled by the monkey faced villain. Spider Man replies \"I know what to do\" as he finally falls from one final venom blast. The two villains approach Spider Woman when Mandrill gets webbed in the mouth and Spider Man knocks out the Griffin with one powerful uppercut. Spider Woman blasts the Mandrill in the mouth and Spider Man webs both villains together.\n\nHeroic Age\n\nThe Hood would go on the run after the siege of Asgard was a failure and Norman Osborn is no longer the Director of National Security. Several members of the Hood's gang are arrested in Asgard but the Griffin is later captured in New York by Spider Man. The Griffin is caught in a giant web and the crowd is aggravated at the web-head for causing a traffic jam on Fifth Avenue. The crowd starts throwing trash at Spider Man and Griffin tells everyone that the wall-crawler is his partner and they're in cahoots. The Griffin is apprehended and sent to the Raft.\n\nX-Men: To Serve & Protect\n\nGriffin comes into conflict with Hercules and Psylocke of the X-Men when he apparently steals some money from a bank. Hercules places Griffin in a headlock while Psylocke stabs him in the head with her psychic blade.\n\nFear Itself\n\nThe Raft Penitentiary is severely damaged when a mystic hammer lands inside the prison facility and nullifies the cell block's force-field. Several super-powered felons escape including Griffin, Basilisk and Man-Bull. They flee the island with a female inmate that has a raft boat and head to Brooklyn. The four criminals participate in a bank heist in Cadman Plaza and come into conflict with Hercules who has been depowered after his epic battle with the Chaos King. Hercules has been equipped with various mythological weapons and is still a brave, fierce warrior despite his lack of superstrength. Griffin is stabbed in the chest with the Sword of Peleus but Hercules avoided all major arteries and organs. Griffin recovers while Hercules is fighting with Man-Bull. Griffin grabs two handfuls of cash and flies through a window but he is gunned down by the Warhawks who are led by Kyknos, the son of Ares. Man-Bull and Hercules team up against Kynkos and help save Griffin. The crowd begins to go crazy and turns against Hercules, Man-Bull and Griffin. They find their female inmate laying on the floor with horns sprouting from her head and she's uttering some unknown language. Man-Bull and Hercules fend themselves against the Warhawks when the female inmate reveals herself to be Hecate, Mistress of Terror and Witchcraft. Hecate casts a spell that enrages the crowd and dogs throughout the city go wild. Hercules is rushed by the crowd when Man-Bull and Basilisk noticed a change with Griffin. The magic emanating from all the chaos had transformed Griffin into a real, mythological griffin and he saves Hercules from the crowd. Hercules rides Griffin like a steer and they come across some civilians going crazy from the magic. Hercules is wounded and Griffin takes him to a building rooftop. Hercules collapses and Griffin tries to provide nourishment by offering two wild dogs he just killed. Hercules treats his wounds while Griffin eats the rest of his kill. Hercules wakes up the next morning and hears Griffin whining. They are in awe when the city landscape has changed and overwhelmed by massive trees sprouting through various buildings.\n\nA Council Of Masters\n\nMax Fury, the leader of the Shadow Council has assembled a new Masters of Evil in the sovereign nation of Bagalia where Griffin is presently a member. Griffin is present when Max Fury and the Masters of Evil capture John Steele after he attempts to escape Bagalia with the Serpent Crown and the Crown of Thorns.\n\nPowers & Abilities\n\nGriffin is very similar to his mythical counterpart and quite powerful. Griffin has wings that provide him flight and he possesses razor sharp claws and fangs. He also has a prehensile tail he can use to strike and grab his enemies. During his early changes, he had the ability to control certain animals with his voice when he called upon a flock of birds to attack Spider Man and Wonder Man. Griffin has superhuman durability and strength. Griffin managed to overpower superhumans like Ghost Rider, Spider Man and Wonder Man with his bestial strength. The Griffin's senses are also heightened which make him an excellent tracker.\n\nOther Versions\n\nMarvel Adventures\n\nGriffin would be involved in several stories taking place in the Marvel Adventures comics which are standalone stories and does not take place in the current Marvel Universe continuity.\n\nGriffin takes on the Avengers.\n\nThe Griffin would come into conflict with the Avengers when Iron Man and Captain America witness the villain land in a park with SHIELD agents around him. The Griffin was trying to kidnap a Chinese diplomat when SHIELD agents tried to stop him. Iron Man and Captain America call for reinforcements so Storm, Spider Man and Wolverine arrive. The Griffin's strength, speed and ferocity give the Avengers more than they can handle. The Griffin starts to gain the upper hand when he controls a flock of birds to attack Wolverine and knocks Storm down with a park bench. Tigra was watching the entire fiasco from a distance because she was paid by an unknown client to gather information on the Avengers for a book he was planning to write on the heroes. Tigra decided to intervene and kicked the Griffin behind the head. Tigra then flipped over the Griffin and planted a kiss on him. The kiss was a distraction and it allowed Iron Man to take down Griffin with a neuro-blast. The Griffin was placed into custody and Tigra was invited to join the Avengers.\n\nOther Media\n\nTelevision\n\nAgents of S.H.I.E.L.D.\n\nHe is mentioned by John Garrett as the first prisoner he ever brought to the S.H.I.E.L.D. facility known as the Fridge."}, {"url": "https://www.sportskeeda.com/basketball/blake-griffin", "page_content": "Blake Griffin: A Brief Biography\n\nBlake Austin Griffin is a professional American basketball player. He was born on March 16, 1989 in Oklahoma City. Griffin plays center in the National Basketball Association and is representing the Boston Celtics, currently. He joined Oklahoma Christian School and won four state titles under the head coach, Tommy Griffin, his father. Also, Blake played college basketball for the Oklahoma Sooners at the University of Oklahoma. He was named the Consensus National College Player of the year. Later, the Los Angeles Clippers drafted Blake Griffin in the 2009 NBA draft.\n\n\n\n\n\nBlake Griffin\n\n\n\n\n\nBlake Griffin Early Life\n\n\n\n\n\nBorn on March 16, 1989, Blake Griffin belongs to half Afro-Haitian and half-White ethnicity. His hometown is Oklahoma City in Oklahoma. His father, Tommy Griffin, is also a former basketball player and coach who had played college (Northwestern Oklahoma State University) basketball. Tommy coached the teams at Oklahoma Christian School, where Blake played and won four state championships. His mother, Gail Griffin, homeschooled Blake and his older brother Tylor before they joined high school.\n\n\n\n\n\nBlake Griffin also played other games such as football and baseball. Blake joined the Oklahoma Christian School in 2003 and played along with his brother under the coaching of his father. Both brothers together won two state basketball championships in the 2003-04 and 2004-05 seasons. In 2007, Blake entered the University of Oklahoma and represented the Oklahoma Sooners.\n\n\n\n\n\nBlake Griffin NBA Journey\n\n\n\n\n\nBlake Griffin was drafted in the 2009 NBA draft by the Los Angeles Clippers. He played for the franchise’s Summer League Team and was named Summer League MVP. Meanwhile, he got a stress fracture in his left knee which delayed his NBA debut game for 7 weeks. Eventually, he missed the entire 2009-10 season. Blake played his NBA debut in the 2010-11 season against the Portland Trail Blazers and posted 20 points and 14 rebounds. He created a franchise record for most consecutive double-doubles with 23. Blake scored a career-high 44 points against the Knicks on November 11, 2010.\n\n\n\n\n\nGriffin participated in the 2011 Rookie Challenge and acquired Slam Dunk Contest. Against the Washington Wizards, he posted his first career triple-double with 33 points, 17 rebounds and 10 assists on March 23, 2011. Along with his new teammate Chris Paul, Blake was selected to play as a starter in the 2012 NBA All-Star Game for the first time. He averaged another double-double (20.7 points and 10.9 rebounds per game) in the lockout-shortened season.\n\n\n\n\n\nHe signed a contract extension worth US$95 million for five years before commencing the 2012-13 NBA season. Griffin was also included in the USA team for the 2012 London Summer Olympics but was withdrawn due to a knee injury. Griffin finished the season averaging 18 points and 8.3 rebounds per game. He was again named to the All-NBA Second Team.\n\n\n\n\n\nWith the new team coach Doc Rivers, Griffin averaged 24.1 points each game and was voted as a starter in the NBA All-Star Game. The Clippers finished third seed in the Western Conference playoffs with a franchise-best 57-25 record. In the later season, Blake Griffin recorded a season-high 40 points and 12 rebounds in a lost game against the Utah Jazz on November 25, 2015. After that, he missed 45 games due to injury and returned on April 13 against the Wizards.\n\n\n\n\n\nIn January 2018, Griffin entered the Detroit Pistons along with Willie Reed and Brice Johnson. He played his debut game for the Pistons against the Grizzlies and recorded 24 points and 10 rebounds. He missed the first 10 games due to a knee injury in the 2019-20 season. However, he managed to be available at the start of the 2020-21 season but struggled. He posted near a career-low 12.3 points and 5.2 rebounds per game.\n\n\n\n\n\nBlake Griffin signed an agreement with the Brooklyn Nets on March 8, 2021. He played his debut for his side on March 21 against the Wizards and recorded two points and two rebounds. Also, Griffin collected his first double-double (10 points and 10 rebounds) for the Nets on May 6. Blake came under a one-year deal to extend his contract. He registered his season-high 19 points on February 6, 2022 against the Denver Nuggets. The Boston Celtics was the next franchise for Blake Griffin. He signed a one-year agreement with the Celtics on September 30, 2022.\n\n\n\n\n\nBlake Griffin\n\n\n\n\n\nBlake Griffin Education\n\n\n\n\n\nBlake Griffin and his brother Tylor Griffin were homeschooled by their mother Gail Griffin until high school. In 2003, Blake joined Oklahoma Christian School where he played under the head coach (Blake’s father), Tommy Griffin. Then in 2007, Blake Griffin reached the University of Oklahoma to play college basketball. He represented the Oklahoma Sooners and became one of the high-rated players. Blake won several awards and honors during his college basketball career.\n\n\n\n\n\nBlake Griffin Championship\n\n\n\n\n\nBlake Griffin underwent a fabulous career at the high school and college levels. He became one of the most favorite and decorated players due to his brilliant skills on the court. Griffin entered the NBA in 2009 when he was picked by the Los Angeles Clippers in the 2009 NBA draft. Later, Blake joined the Detroit Pistons in 2018, Brooklyn Nets in 2021, and Boston Celtics in 2022. Blake is already a 6-time NBA All-Star, 3-time All-NBA Second Team and has won many other achievements. Blake Griffin is yet to become an NBA champion, however.\n\n\n\n\n\nBlake Griffin Awards and Achievements\n\n\n\n\n\nBlake Griffin was a highly-skilled and talented basketball player since his childhood. Since the start of his career, he has won multiple awards, honors and medals.\n\n\n\n\n\nAwards/Achievements Year 6-time NBA All-Star 2011-2015, 2019 3-time All-NBA Second Team 2012, 2013, 2014 2-time All-NBA Third Team 2015, 2019 NBA Rookie of the Year 2011 NBA All-Rookie First Team 2011 NBA Slam Dunk Contest Champion 2011 National College Player of the Year 2009 Consensus First Team All-American 2009 NCAA Rebounding Leader 2009 Big 12 Player of the Year 2009 Third-Team Parade All-American 2007 McDonald’s All-American 2007\n\n\n\n\n\nBlake Griffin Net Worth\n\n\n\n\n\nBlake Griffin is among the high-paid athletes who amassed a massive fortune from his NBA career. The center has a net worth that is estimated to be US$110 million in 2023. Additionally, Blake earns more than 30 million US dollars every year from the NBA. He earned 32.1 million US dollars in 2018 from his team Detroit Pistons. In addition to that, several brand endorsements also contribute to his income immensely. Blake has great deals with world-renowned brands such as Kia Motors, Nike, AT&T, Subway, Vizio etc.\n\n\n\n\n\nBlake Griffin Contract\n\n\n\n\n\nThe professional basketball player Blake Griffin initiated his career in the National Basketball Association in 2009. He came under a multi-year agreement with the Los Angeles Clippers. He extended his contract with the franchise on July 10, 2012 for reportedly US$95 million for five years. Again in 2017, Blake re-signed a contract worth US$173 million for five years.\n\n\n\n\n\nGriffin moved ahead to join the Detroit Pistons in 2018 and played until 2021. On March 8, 2021, Blake came under an agreement with the Brooklyn Nets. In the following year, he signed a one-year deal with the Boston Celtics on September 30, 2022.\n\n\n\n\n\nBlake Griffin Family\n\n\n\n\n\nBlake Griffin was born to very loving and supportive parents. Both his parents belong to different races. His father, Tommy Griffin, is an Afro-Haitian while his mother, Gail Griffin, is White. He has an older brother Tylor Griffin, who also played professional basketball in the NBA. Blake was once in a relationship with Brynn Cameron. The couple has two children – Ford Wilson Cameron Griffin (son) and Finley Elaine Griffin (daughter). They separated for unknown reasons. His relationship with Kendall Jenner was also pretty much in the news. Currently, Blake Griffin is dating a beautiful model and designer, Francesca Aiello.\n\n\n\n\n\nBlake Griffin Girlfriend\n\n\n\n\n\nOff the court, Blake Griffin is usually spotted with ladies. He has dated several women till now. Bryn Cameron was one of the first ladies that Blake dated and had children. Later, he moved to singer Madison Beer. However, his romance with Kendall Jenner has also gained immense highlight. She is a TV personality. His current girlfriend is Francesca Aiello, a popular designer and model.\n\n\n\n\n\nBlake Griffin Dad\n\n\n\n\n\nTommy Griffin is the father of Blake Griffin. He is a former basketball player and played college basketball. Also, Tommy was a professional coach and served at Oklahoma Christian School.\n\n\n\n\n\nBlake Griffin Shoe\n\n\n\n\n\nWith the first overall pick, Los Angeles Clippers selected Blake Griffin in the 2009 NBA draft. He used to wear Jordan Brand’s Super.Fly shoes. Currently, Blake is wearing the Air Jordan 37s while playing with the Celtics.\n\n\n\n"}, {"url": "https://www.britannica.com/biography/Ken-Griffey-Jr", "page_content": "Ken Griffey, Jr., in full George Kenneth Griffey, Jr., (born November 21, 1969, Donora, Pennsylvania, U.S.), American professional baseball player who was one of the iconic athletes of the 1990s and ranked among the best power hitters and defensive outfielders of all time.\n\nIn 1987 Griffey was the first player selected by the Major League Baseball draft and was signed by the American League Seattle Mariners. He made his major league debut in 1989. His father, outfielder Ken Griffey, Sr., was playing for the Cincinnati Reds in that year, and the Griffeys thus became the first father and son ever to play in the major leagues at the same time. Griffey, Sr., arranged to be traded to the Mariners late in the 1989 season, and the two formed a sentimental duo in the lineup until his retirement in 1991.\n\nBritannica Quiz I Am the Greatest (Athlete)\n\nGriffey, Jr., soon began to prove his worth as both a centre fielder and a hitter. He was injured in his rookie season, but in 1990 he won his first Gold Glove Award, had a batting average of .300, and played in the All-Star Game. He went on to win the American League Gold Glove Award for the years 1991–99 with his spectacular fielding. In 1997, when Griffey hit 56 home runs and batted in 147 runs, he was a unanimous selection for the American League’s Most Valuable Player award.\n\nAt the close of the 1999 season, Griffey—who had come to dislike playing in the Mariners’ new pitcher-friendly stadium and wanted to work closer to his family’s home in Orlando, Florida—requested a trade from Seattle. In February 2000 he was traded to Cincinnati, which he considered his hometown and where his father worked as a coach. Griffey struggled with a series of injuries in Cincinnati. When he was on the field, he remained a dangerous left-handed hitter. In 2004 he became the 20th major league player to hit 500 home runs, and he was named to the National League All-Star team in 2000, 2004, and 2007. In 2008, after hitting his 600th career home run, Griffey joined Barry Bonds, Hank Aaron, Babe Ruth, Willie Mays, and Sammy Sosa as the only players in major league history to accomplish that feat. Griffey was traded to the Chicago White Sox in July 2008.\n\nHe became a free agent for the first time in his career at the end of the 2008 season, and he signed with the Mariners again in February 2009. Griffey’s return to Seattle was a boon for the Mariners’ attendance figures, but his deteriorating on-field play and subsequent lack of playing time led him to abruptly retire from baseball in June 2010. He finished his career with a .284 batting average, 630 home runs, and 1,836 runs batted in. In 2016 he was inducted into the Baseball Hall of Fame, having received 437 of the 440 votes cast (99.32 percent) to set the record for the highest percentage of votes in the history of the Hall of Fame (which was broken in 2019 when Mariano Rivera was elected unanimously). In 2021 he joined the Mariners’ ownership group."}, {"url": "https://www.britannica.com/biography/O-J-Simpson", "page_content": "On June 12, 1994, O.J. Simpson's ex-wife, Nicole Brown Simpson, and her friend Ronald Goldman were stabbed to death outside her home in Los Angeles. Simpson was arrested and charged with the two murders on June 17. He pleaded not guilty, and in 1995 he was acquitted.\n\nIn 2007 O.J. Simpson was arrested and charged with several crimes, including armed robbery and kidnapping. A jury found him guilty of all charges in 2008, and he was sentenced to a minimum of nine years in prison.\n\nO.J. Simpson was an American football player known for his speed and elusiveness. As a collegiate player, he was named All-American (1967–68), played in two Rose Bowl games, and won the Heisman Trophy (1968). His trial on murder charges in 1995 was one of the most celebrated criminal trials in American history.\n\nO.J. Simpson, in full Orenthal James Simpson, (born July 9, 1947, San Francisco, California, U.S.), American collegiate and professional gridiron football player who was a premier running back known for his speed and elusiveness. His trial on murder charges in 1995 was one of the most celebrated criminal trials in American history.\n\nSimpson played football at Galileo High School in San Francisco, first as a tackle and then as a fullback. He attended San Francisco City College (1965–66) to achieve a scholastic record that allowed him to play at the University of Southern California (USC), where he set team records for yards gained by rushing: 1967, 1,415 yards; 1968, 1,709 yards. He was named All-American (1967–68), played in two Rose Bowl games, and won the Heisman Trophy as the best collegiate player of the season (1968). At USC he was also a member of a world-record-setting 440-yard relay team.\n\nBritannica Quiz Sports Quiz\n\nSimpson, who was often called “Juice” because of his energetic runs and because his initials could stand for “orange juice,” was the number one draft choice of the American Football League (AFL) Buffalo Bills in 1969. The following year the AFL merged with the National Football League (NFL). The Bills were members of the American Football Conference (AFC) of the NFL when Simpson set a single-season record for yards gained rushing (2,003) in 1973. The Bills were never a contending team during his stay, but he was a great box-office draw. Injuries to his knees prompted the Bills to trade him in 1978 to the San Francisco 49ers, but he retired after the 1979 season. His 1975 record of most touchdowns scored in a season (23) stood until 1983, and his 1973 season rushing record for most yards gained lasted until 1984, when it was broken by Eric Dickerson. Simpson led the AFC in rushing yardage four times (1972–73, 1975–76). His career total yards gained (11,236) was second in the all-time rankings at the time of his retirement. He was inducted into the Pro Football Hall of Fame in 1985.\n\nAfter retiring from football, Simpson became a film and television actor and sports commentator. On June 12, 1994, his ex-wife Nicole Brown Simpson and her friend Ronald Goldman were stabbed to death outside her home in Los Angeles. Simpson was arrested and charged with the two murders on June 17; he pleaded not guilty and hired a team of prominent lawyers to handle his defense. His lengthy nationally televised trial became the focus of unprecedented media scrutiny. A jury acquitted Simpson of the murder charges on October 3, 1995. In a separate civil trial decision in 1997, he was found liable for the deaths of his ex-wife and Goldman and was ordered to pay $33.5 million in damages to the families. Simpson later collaborated (with Pablo F. Fenjves) on If I Did It, in which he hypothesized about how he would have committed the murders. Public outrage prevented its initial publication in 2006, but a bankruptcy court subsequently awarded the book’s rights to the Goldman family, who released the work in 2007.\n\nLater that year, Simpson was arrested after he and several other men entered a Las Vegas hotel room and took memorabilia items that Simpson claimed had been stolen from him. The incident resulted in Simpson being charged with a number of crimes, including armed robbery and kidnapping. On October 3, 2008, a jury found him guilty of all charges. He was later sentenced to a minimum of nine years in prison, with a possible maximum sentence of 33 years. Simpson was granted parole in 2017."}, {"url": "https://www.current-affairs.org/meet-miklos-feher-wife-adrienn-kaibas/", "page_content": "Meet Miklos Feher Wife Adrienn Kaibás: Dating History & Relationship Timeline\n\nRemembering the Tragic Death of Hungarian Footballer Miklos Feher: Where is His Family Now?\n\nAs a famous quote by Marcus Aurelius goes, “Death smiles at us; all a man can do is smile back.” However, the passing of Hungarian footballer Miklos Feher on January 25, 2004, was a tragic loss that left many in shock and disbelief.\n\nFeher was in Guimares that fateful day to play against Vitória de Guimares as part of the Benfica team, and the game was being broadcasted live on TV. The striker, who had been brought on as a substitute, helped score the match’s only goal, leading Benfica to a 1-0 lead.\n\nHowever, in the injury time, he was given a yellow card, and while he was on the ground, he quickly bent forward, appearing to be in pain, before tragically collapsing.\n\nLocal and international media reported on Feher’s condition throughout the day until he was pronounced dead at midnight, with his cause of death reported to be a cardiac arrhythmia.\n\nIt has been almost two decades since the football community lost a promising talent, but the memories of Miklos Feher still linger.\n\nThe Aftermath of Miklos Feher’s Death\n\nMiklos Feher’s passing had a profound impact on the football world and his family. Feher’s family received an outpouring of support and condolences from fans, fellow players, and clubs worldwide.\n\nView this post on Instagram A post shared by Miklós Fehér (@miklosfeher29)\n\nFeher’s funeral was held on January 29, 2004, in his hometown of Budapest, Hungary, and was attended by thousands of mourners, including members of the Hungarian football team and government officials. Feher’s burial site at the Kerepesi Cemetery has since become a place of pilgrimage for football fans worldwide.\n\nWhere is Miklos Feher’s Family Now?\n\nFeher’s parents, Attila and Adriana, continue to reside in Budapest, Hungary, and have been preserving their son’s memory through various initiatives. In 2005, they established the Miklos Feher Foundation, which aims to support talented young footballers and promote healthy lifestyle choices.\n\nFeher’s partner, Adrienn Kaibás, has since remarried and is now a mother of two. She has also been working on initiatives that commemorate Feher’s legacy, such as organizing an annual charity football tournament in his name.\n\nAlso Read: Dalvin Cook Family: Parents, Siblings, Bio, Wiki, Age, Pet Dog, Career, Net Worth 2023 and More\n\nMiklos Feher: A Look Back at His Relationship with Adrienn Kaibás\n\nMiklos Feher was a talented football player who left a mark on the sport before his untimely death at the age of 24. While his accomplishments on the field were impressive, many also remember him for his relationship with Adrienn Kaibás.\n\nDating and Engagement\n\nMiklos Feher and Adrienn Kaibás began dating in 2000. Although it’s unclear how they met, it’s clear that they shared a strong bond. They were engaged and had plans to get married before Feher’s tragic passing.\n\nGrief and Tragedy\n\nKaibás has spoken publicly about her grief following Feher’s death. In an interview with Story Magazine, she shared details about the day of his passing. Feher would call her within an hour after each game, but on the day of his death, her phone didn’t ring. She knew something was wrong.\n\nKaibás tried to reach Feher but couldn’t get through to him. Eventually, one of his teammates answered the phone and explained the situation. Kaibás was in disbelief and didn’t understand what was happening.\n\nAdrienn Kaibás: Life After Miklos Feher\n\nThe sudden death of Miklos Feher shook the world of football in 2004. His girlfriend at the time, Adrienn Kaibás, was devastated by the loss. However, life goes on, and Adrienn has since moved forward. She now leads a beautiful family with her husband and their two children.\n\nMarriage and Motherhood\n\nAdrienn Kaibás tied the knot with retired Hungarian ice hockey player Krisztián Palkovics in May 2006. Palkovics played for Alba Volán Székesfehérvár before retiring in 2012. The couple welcomed their first child, Krisztián, into the world shortly after their marriage, followed by their daughter Emili.\n\nThe couple’s separation was a difficult time for Adrienn and her family, but they have since found happiness in new beginnings.\n\nLife after Miklos Feher\n\nMiklos Feher’s sudden passing was a traumatic experience for everyone involved. Adrienn Kaibás has spoken out about her experience with grief and how she has managed to move on.\n\nAdrienn’s life now revolves around her family, which includes her two children and her husband. She has found joy in motherhood and takes pride in watching her children grow up.\n\nAdrienn’s words about Miklos Feher\n\nIn a statement, Adrienn said that Miklos Feher was a wonderful man and a great father. She also expressed her belief that Miklos sent her husband, Krisztián Palkovics, into her life. This sentiment shows that Adrienn has come to terms with the past and has found peace in her present.\n\nAlso Read: Meet Ryan Pulock Wife Paige Friesen: Relationship Timeline, Girlfriend Dating History\n\nMiklos Feher’s Ex-Fiancee, Adrienn Kaibás, Flourishes as an Entrepreneur\n\nAdrienn Kaibás, former fiancee of the late football player Miklos Feher, has established herself as a successful entrepreneur and real estate developer, according to the latest reports of 2019. Her professional achievements have been noteworthy, indicating a promising future.\n\nEntrepreneurship and Real Estate Development\n\nAdrienn Kaibás has made a name for herself in the business world, as she has been involved in entrepreneurship and real estate development. Her work has been impressive, and she has shown a keen eye for detail and innovation in her projects.\n\nA Life Full of Work and Children\n\nAdrienn Kaibás has been focusing on her work and raising her children, which takes up most of her time. She believes in dedicating herself fully to whatever she does, and her busy schedule reflects this. Despite the demands of her life, she manages to balance her personal and professional life efficiently.\n\nFinding Her Place in the World\n\nAs a successful entrepreneur and real estate developer, Adrienn Kaibás has found her passion in her work. She feels that she still has a lot to accomplish, and she is dedicated to exploring her full potential. Adrienn is currently not seeking a new partner, as she is focused on finding her place in the world and making a positive impact.\n\nMiklos Feher’s Presence in Her Heart\n\nMiklos Feher, Adrienn Kaibás’ former fiance, passed away tragically. However, his memory continues to inspire her, and he remains close to her heart. Although losing him was painful, she has learned to cope with the loss and has continued to pursue her passions with dedication and commitment.\n\n10 years ago, football lost Hungary & @SL_Benfica player Miklos Feher. We remember him today. http://t.co/4TR0N16Q9p pic.twitter.com/7nSEDOnB5Y — Joseph S Blatter (@SeppBlatter) January 25, 2014\n\nMiklos Feher: Remembering the Legacy of a Hungarian Soccer Icon\n\nMiklos Feher, a renowned Hungarian soccer player, left a lasting legacy in the world of sports. Born on July 20, 1979, in Hungary, Feher quickly rose to fame for his impressive skills and innate talent on the field.\n\nAs of January 9, 2023, Miklos Feher’s net worth was estimated to be around $5 Million. Today, we remember his remarkable career and contributions to the world of soccer.\n\nEarly Life\n\nFeher was born in Hungary and began his career as a professional soccer player in 1995, playing for Gyori ETO FC. He then moved on to play for clubs such as Braga and Porto in Portugal, before finally joining Benfica in 2002. During his career, he became known for his speed, agility, and striking ability.\n\nFeher’s Impressive Achievements\n\nFeher’s most notable achievement came in 2002 when he scored a hat trick against Lithuania during the World Cup qualifiers. His incredible performance helped Hungary secure a place in the tournament. He also represented the Hungarian national team from 1998 to 2004, earning 25 caps and scoring 8 goals.\n\nTragic Death and Legacy\n\nDespite his promising career, tragedy struck in 2004 during a match against Vitoria de Guimaraes. Feher suffered a cardiac arrest on the field and passed away at the young age of 24. His death shook the soccer community, and many mourned the loss of a talented player who had so much potential.\n\nFeher’s family was well-known in Hungary for their restaurant in Gyor, where they created a special room dedicated to Miklos’ memory. His sister, Orsolya, also became an advocate for heart health and worked to raise awareness about the risks of cardiac arrest.\n\nRemembering Miklos Feher\n\nAlthough Miklos Feher’s life was cut short, his legacy lives on through the memories of his fans, family, and fellow players. His impressive achievements and incredible talent will always be remembered in the world of soccer.\n\nThe International Career of Miklós Fehér: A Hungarian Football Legend\n\nMiklós Fehér was a well-known Hungarian football player who made a name for himself with his impressive skills and performances on the pitch. He represented his country at the highest level and played an instrumental role in Hungary’s success on the international stage.\n\nDebut and Early Years\n\nFehér began his international career on 10 October 1998, when he made his debut for the Hungary national team in a UEFA Euro 2000 qualifying match against Azerbaijan.\n\nHe was brought on as a substitute in the sixth minute, replacing Ferenc Horváth, and ended up scoring the final goal in a 4-0 win at the Tofiq Bahramov Stadium in Baku. This debut performance set the stage for what was to come from the young Hungarian talent.\n\nFehér’s first few years in the national team were characterized by his impressive performances, which earned him a regular place in the squad. He quickly established himself as one of Hungary’s most important players, thanks to his skill, speed, and agility on the pitch. He was a versatile player who could play in multiple positions, which made him an asset to the team.\n\nHat-trick Hero\n\nOne of the most memorable moments of Fehér’s international career came on 11 October 2000, when he scored a hat-trick in Hungary’s 6-1 away victory over Lithuania in the 2002 FIFA World Cup qualifiers. This was a defining moment in Fehér’s career, as it showcased his talent and ability to score goals at the highest level.\n\nIn total, Fehér scored seven goals in 25 appearances for the Hungary national team. He was a consistent performer for his country and played a key role in their success during his time with the team.\n\nLegacy and Impact\n\nFehér’s untimely death in 2004 shocked the football world, and he was mourned by fans, teammates, and opponents alike. His death was a huge loss for Hungarian football, as he was considered one of the country’s brightest talents.\n\nHowever, Fehér’s legacy lives on, both in Hungary and around the world. He was a player who inspired others with his skill, determination, and passion for the game. His impact on Hungarian football cannot be overstated, and he remains a beloved figure among fans of the sport in the country.\n\nFacts\n\nMiklos Feher was a Hungarian professional footballer who played as a striker for a number of clubs, including Porto, Benfica, and Sporting Lisbon.\n\nFeher was born on July 20, 1979, in Budapest, Hungary, and began his football career with MTK Budapest in 1997.\n\nIn January 2004, Feher signed with Portuguese club Porto, where he won the Primeira Liga title in his first season.\n\nFeher’s life was tragically cut short on January 25, 2004, when he suffered a cardiac arrest and collapsed on the field during a match against Vitoria Guimaraes.\n\nAdrienn Kaibás is the wife of the late Miklos Feher. The couple had one child together, a son named Botond.\n\nKaibás was born on February 14, 1982, in Budapest, Hungary.\n\nKaibás and Feher began dating in 1999 and were together until Feher’s untimely death in 2004.\n\nAfter Feher’s passing, Kaibás set up the Miklos Feher Foundation, a non-profit organization that provides support to disadvantaged children and young people in Hungary.\n\nIn 2014, a statue of Feher was unveiled outside the Estádio da Luz, the home stadium of Benfica, in tribute to the player’s life and career.\n\nToday, Feher is remembered as a talented footballer who left a lasting impact on the sport and those who knew him.\n\nFAQ’S\n\n1. Who is Miklos Feher’s wife Adrienn Kaibás?\n\nAns: Adrienn Kaibás is the wife of late Hungarian professional footballer Miklos Feher. She was born in 1980 in Hungary and is a former handball player.\n\n2. When did Miklos Feher and Adrienn Kaibás start dating?\n\nAns: Miklos Feher and Adrienn Kaibás started dating in 2002, a year before Feher’s tragic death.\n\n3. What is the relationship timeline of Miklos Feher and Adrienn Kaibás?\n\nAns: Miklos Feher and Adrienn Kaibás started dating in 2002 and were together until Feher’s untimely death in January 2004. They were planning to get married in the summer of 2004, but Feher passed away before that could happen.\n\n4. How did Adrienn Kaibás cope with Miklos Feher’s death?\n\nAns: Adrienn Kaibás was devastated by Miklos Feher’s death and took some time off from her professional career to grieve. She has since returned to her career as a handball coach.\n\n5. Does Adrienn Kaibás keep Miklos Feher’s memory alive?\n\nAns: Yes, Adrienn Kaibás keeps Miklos Feher’s memory alive by regularly posting pictures and tributes to him on social media. She also established the Miklos Feher Foundation in his memory, which provides support to talented young athletes.\n\nRead More: Kwity Paye Family: Parents, Siblings, Career, Bio, Wiki, Net Worth 2023, Playing Golf and More"}, {"url": "https://theathletic.com/3237103/2022/04/08/nets-forward-blake-griffin-famous-for-his-dunks-has-quietly-mastered-the-art-of-the-charge/", "page_content": "Blake Griffin stood in a tunnel just off to the side of the Nets’ practice court in Sunset Park and launched into a traditional defensive stance: arms out at either side, knees bent and ready to get a stop.\n\nThen he switched and extended his arms, clasping them below his waist in a V shape, as if he were on his best behavior, a stance a kid at a prep school, not a professional basketball player, would probably take.\n\nAdvertisement\n\nYou might think he was doing basketball’s version of the “YMCA.” He wasn’t. He’s was explaining which stances will draw a charge in the eyes of officials and which will have a defender looking foolish.\n\nThat’s right: Griffin, one of the greatest dunkers of his generation, was talking a big game to The Athletic about drawing fouls. And not the common ones. A decade after he established himself in Los Angeles as a high-flying highlight reel, Griffin has seen his career undergo a wholesale change. The man who became famous for defying gravity when he jumped over a Kia has now earned his teammates’ respect for succumbing to gravity.\n\nGriffin joined the Nets last season to be a supporting cast member alongside their original big three. Though the dunks and playmaking he’d bring at power forward were a given, the hustle plays and ability to get defensive stops on charges have given him a unique niche on Brooklyn’s roster and changed the way many around the league perceive him.\n\n“He went from an All-Star player for the most part in his career to a role player with us,” Nets coach Steve Nash said, “and he accepted it and, I think, attacked that role. … His ability to throw his body around, take charges, rebound, set good screens, do all the little things, it’s been outstanding.”\n\nNBA rules define a charge as an occurrence when an offensive player makes contact with a defensive one who has already established position. A defensive player is not permitted to move in the path of an offensive player once he has started his upward motion to attempt a field goal or pass. And maybe more importantly, aside from an illegal screen, a charge is the only call that equates to both a personal foul on the opposing player and a defensive stop. Griffin, 33, said the twofold impact of the call is why he aims for it so frequently, despite being a six-time All-Star who has and still can do so much more.\n\nAdvertisement\n\nEntering the final weekend of the season, Griffin is tied with Kevin Love for the league lead in charges drawn, at 26, and his 0.98 charges per 36 minutes lead the NBA by an overwhelming margin; Love trails him there, drawing 0.57 per 36. And though that may seem surprising to anyone who hasn’t followed Griffin since his Clippers’ days, based on recent history, at least, it shouldn’t be. In 2020-21, despite missing a month while the Pistons bought out his contract, the 6-foot-9 forward drew 22 charges, which put him in a three-way tie with Kemba Walker and Montrezl Harrell for the league lead. As Griffin wraps up his 12th professional season, he’s proven he’s more than willing to get physical in service of a stop.\n\n“A lot of these opportunities come from being the help defender, you know?” Griffin said that day at the Nets’ practice facility. “I definitely do draw some charges straight up, guarding on-ball, but a lot of times it’s like, I see a guy make a move, I see a guy get beat, I kind of pull over and, I don’t know, for some reason I don’t really do this thing…”\n\nGriffin put his hands together in front of his stomach and kept talking. “I come across like hands up sort of like…”\n\nAt this point, he assumed a traditional defensive stance — and continued explaining: “When you see a guy come in (with his hands together in front of him), you know what’s on his mind. You see a guy come over like this … I don’t think guys are really thinking charge. And at the last second, you can kind of sell that charge a little bit more.\n\n“That’s just sort of my philosophy: Just always be watching for an opportunity.”\n\nSo what makes Griffin so good at drawing charges and not getting called for blocks?\n\nAdvertisement\n\nFor starters, he thinks about it. Walker, another charge-drawing whiz, keeps his process simple. “I just try to stay there and take it to the chest,” he said.\n\nBut Griffin’s procedure has more depth. He’s studied other players around the league who rival his ability to draw charges and analyzes personnel as he debates whether to throw his body into an oncoming opponent.\n\n“Certain guys, I think, are a little bit easier to take charges on,” Griffin said during his charge streak in the spring of 2021. “The guys who are incredibly shifty and have a lot of Euro steps and can sort of get by people, that’s sort of a harder one to take charges on.\n\n“Bigger guys, guys that are a little bit more reckless, you kind of key in on those things.”\n\nGriffin’s position as a smaller center also helps him. Aside from Love, who has undergone a similar transition from All-Star center to reserve, most of the league’s leaders in charges drawn tend to be guards. But Griffin’s position down low aids in his ability to jump in front of players who previously beat a teammate.\n\n“If you come over too early and you give away that taking a charge (with your hands at your stomach), those guys will just stop, spin, pivot or jump up,” Griffin explained recently. “Like, they won’t keep going. But I think, for me, that’s how I would teach, like, my son, … to, like, come over and be ready and then, boom,”\n\nBoom is a jump and a two-footed landing. Griffin continued: “That’s all you have to do. You know what I mean? Other than that, I mean, it’s just kind of a timing, just kind of a feel.”\n\nGriffin has taken cues from what officials are seeing, too.\n\n“One thing good charge takers do is … if they’re getting to a spot, it’s always like, get your feet down first,” Griffin said. “Because it kind of helps the refs know you’re set. Sometimes guys will come in and try a charge, so I always try to get my feet there and then my body just comes to that spot, so I’m not ever like leaning. ‘Cause that’s really the only way you can lose a charge call, is if you’re still trying to lean into it or something.”\n\nAdvertisement\n\nAnd referees see where Griffin is coming from.\n\nShelley Russi, a college basketball referee for more than 20 years who was formerly responsible for WNBA Referee Performance and Development, said her colleagues determine a block/charge call from the feet up, which gives Griffin’s rationale some legs. Russi runs Third Side Coaching, a business that works with players and coaches to better understand mindset, awareness and keys to getting charge calls. She said block/charge is one of the toughest calls her colleagues have to make and complimented Griffin’s thought process on factoring officials into his mindset. He might make a fine guest instructor for her company.\n\n“What he’s saying makes sense entirely,” Russi told The Athletic. “I don’t like to use the term “just set”, but referees do look to make sure that he has two feet and body in front (legal) when defending dribblers or prior to shooter starting his upward shooting motion on drives to basket. Once he’s legal, he can maintain by either moving laterally (dribble only) or retreating as they go to make a decision.\n\n“His line of thinking is a good line of thought. … Ensuring that he’s legal from the feet up to point of contact is a very important fundamental that referees use for making their decisions.”\n\nGriffin’s charge-drawing origins start long before he got to Brooklyn — and long before the NBA started tracking hustle stats in 2016-17. His father, Tommy, was a longtime high school coach at Oklahoma Christian in the suburbs of Oklahoma City. Griffin was around the team as a kid and said his father was a defense-oriented coach who always had players who were good at taking charges. Griffin kept that in mind when he eventually went to play for him — and throughout his career, he’s drawn the whistle in his favor. The dunks just got more attention.\n\nThen, in 2017-18, he drew a dozen charges in a year split between the Clippers and the Pistons. The following season, he drew 30, which ranked second in the NBA. Griffin missed most of 2019-20 because of knee surgery before drawing 22 charges last season in Detroit and Brooklyn. He joined the Nets in late March 2021, and as the charges piled up on his stat sheet, the Nets started to take on his style.\n\nIn Griffin’s first full month in Brooklyn, the Nets led the NBA in charges drawn, with 19. According to PBPStats, a basketball tracking site, Griffin drew .96 charges per 100 possessions in 26 games as a Net in the 2020-21 regular season, which was the most of any player who logged as many minutes as he did with Brooklyn (560). Had he been able to keep up his rate as a Net for the whole season, it would have been the league’s highest single-season rate in five years. And this season, it’s even higher. He’s drawn 1.31 charges per 100 possessions, showing his efficiency at picking one up whenever he plays. For context, Love, whose rate is No. 2 in the league behind Griffin’s, has .79 per 100 possessions, and Kyle Lowry, who’s next in the standings, draws .59.\n\nAdvertisement\n\nDwane Casey, who coached Griffin in Detroit, said his charge skills go beyond his positioning. And Casey, who also coached Lowry, would know. He’s seen two of the league’s best at hitting the floor up close, and he said Griffin understands angles and offenses at a higher level than most players, which allows him to beat opponents to their spots. Help defenders in the post can easily give up lobs when they come over to aid a teammate who just got beat. Griffin’s rare, elite sense of timing allows him to help without creating a backdoor path for another player to catch a lob. Casey argued that at 250 pounds, Griffin can take more hits than most players because, on a mismatch, a guard hitting him won’t hurt as much as if the roles were reversed.\n\n“(Griffin and Lowry) both have a knack, a feel, for getting it,” Casey said. “Some guys try to go get charges and end up getting blocks, but Kyle will come across the floor, Blake will come from his position and find a way to get a charge, but that’s a knack. You teach as much as you can, whether you take a charge or go vertical, but he just has a feel for it, and you’re never going to take that away.”\n\nThis season, Griffin took his charges into uncharted territory, adding a celebration upon drawing them. Baseball has bat flips, football has touchdown celebrations, and race-car drivers have figure-eights; Griffin created a new category. Last season, in a game where both he and Joe Harris took charges, Griffin said the two joked about the blue-collar nature of the act and mused that “it’s a steel-toe, hard-hat, lunch-pail kind of game.” With that in mind, this season they co-founded the “Blue Collar Boys,” an unofficial club whose rules mandate they put on an imaginary hard hat and boots after drawing charges.\n\nHard Hats ✔️\n\nSteel-Toe Boots ✔️ The BCB have clocked in. pic.twitter.com/PElc55unkR — Brooklyn Nets (@BrooklynNets) November 11, 2021\n\nAs the season went on, they ditched the boots and solely celebrated the construction helmet. Patty Mills, who ranked among the top charge-drawers through his 10 years in San Antonio, joined the group after Griffin claimed he reviewed Mills’ application, and he’s drawn seven of his own this year, second on the team. After Kevin Durant drew a charge at Toronto in a November win, Griffin acknowledged his star teammate’s hustle but said the application process takes some time.\n\nDurant’s membership status is currently unknown.\n\nThis year, the Nets are eighth in charges drawn as a team, with 42, after finishing seventh last year with 47. In the first three months of this season, Brooklyn ranked in the top five of the league in charges drawn, which, coincidentally, was when its defense was also in a similar range. Though Griffin’s drop-off in playing time isn’t the reason the Nets defense significantly regressed, for a unit that many expected to fall back to the mean, losing his unique ability to generate stops certainly didn’t help.\n\nGriffin’s ability to stay in the league lead this late in the season despite averaging a career-low 17 minutes per game is a testament to his ability to master one of the game’s wrinkles later in his career. And his new-ish talent for putting his body in the opponent’s paths may extend his relevance and add to his legacy.\n\n“I’ll do whatever, to be honest,” Griffin said. “I’ll dive on the floor. I don’t think twice about that stuff, because you just never know how that one possession could change the shape of a game.\n\n“There’s been games where I’ve taken a charge to seal a win. You just never know. That’s why I always do it.”\n\n(Photo of Patty Mills and Blake Griffin: Nathaniel S. Butler / NBAE via Getty Images)"}]}