{"Geoff Griffin was a regular member of the South Sydney Rabbitohs team from 1985 to 1988, playing in the centres and on the wing.": [{"url": "https://www.rabbitohs.com.au/news/club-records", "page_content": "History CLUB RECORDS\n\nFOUNDERS OF THE RABBITOHS The South Sydney Rugby League Football Club was officially the third rugby league to be formed in Australia on 17 January 1908, after Glebe (9 January) and Newtown (14 January) were formed. But our initial formation goes back to September 1907 when Arthur Stephen Hennessy organised a meeting to form the club at his house in 9 Chapman Street, Surry Hills. He sent out letters to all rugby clubs in the district inviting interested parties to attend. The response was less than overwhelming, with George Ball, Billy Cann and Johnny McGrath being the only ones present with Hennessy, while Ed Fry sent his full support behind the new club and an apology for not being able to attend owing to a previous engagement. Hennessy, Cann and Fry were the three local players who had taken part in the three matches against the NZ All Golds, which were all played under rugby union rules because the Northern Union rule book didn’t arrive by boat from the UK until January 1908. The seeds of our club were first sprouted at this meeting by the five brave men who were the real Founders of our grand old club, and in December 1955 Souths commissioned a photo to be taken of the five men. This photo was proudly displayed in the offices of the old Souths Leagues Club.\n\nBack Row (L-R): Billy Cann, Johnny McGrath. Front Row: George Ball, Arthur Hennessy and Edward Fry.\n\nA number of other meetings were convened during the spring and summer of 1907-08 to form the district club, and the co-founders also helped in organising fliers across the South Sydney district which read: “SOUTH SYDNEY – all footballers in this district should join this club for these reasons; play for yourself and your club’s advantage or play for the Union to their advantage, and no return to yourself. Savee?” But despite those humble beginnings, the small band of believers managed to garner more and more support, culminating in an historic meeting at Redfern Town Hall on January 17, 1908 where South Sydney was officially formed. One of the documents held by the NSW Rugby League is the receipt signed by J.J. Giltinan which lists Souths as the number 2 affiliated club with the NSWRL (North Sydney were the first to affiliate).\n\nIn a 1931 interview, George Ball said of that night in 1908: “The attendance was excellent, quite a number of those present, no doubt, being attracted to the meeting out of curiosity, as much had been written in the press concerning the new code and the likelihood of disqualification from the Rugby Union of anyone who had the temerity to join up with the New Movement.” Despite strong initial opposition from those who continued to support rugby union, the club made significant progress, with regular training sessions being held at Moore Park, where the players were taught the rules of Northern Union football. On 21st March 1908 Souths had the distinction of playing the first football game under North Union rules in Australia, when a trial was organised between Souths’ Possibles against Souths’ Probables at the Sir Joseph Banks’ Ground, Botany. The game was played as 12-a-side, probably because the club only had 24 players on their books at the time. George Ball hired the ground for the day, which cost the club half a guinea. A month later on Easter Monday the first round of the NSWRL competition was played at Birchgrove Oval, with Souths defeating Norths by 11-7.\n\nARTHUR STEPHEN HENNESSY (1876-1959) (a.k.a. The Father of South Sydney) A regular Souths rugby union first grade forward in 1900-07 (94 games, scoring 5 tries), he toured New Zealand in 1901, and represented New South Wales against Queensland in 1904. He was Souths’ first captain in the new code and was also named the club's first delegate to the NSWRL. His policy of 'no kicking' at the club earned South Sydney the title 'The Pride of the League' with their running and passing style of play. He also captained NSW in their first interstate match before being named Australia’s inaugural Test captain in the series against New Zealand. When clubs and representative sides began to list their players in chronological order, as had been the case in cricket, Hennessy held the unique honour of being Number One on the Rabbitohs player register, as well as NSW Blues and the Australian Kangaroos. Hennessy had quickly absorbed the principles of the new code and became a sought-after coach; in 1911 he trained the Wyalong team. As NSW coach of the 1913 touring side to New Zealand he imposed a steak-only diet for lunch on match days. Hennessy strongly advocated the no kick principle, emphasizing the importance of ball possession to score tries. This came to be the mark of South Sydney's football, influenced by Hennessy as head trainer in 1912-13. He was amongst the first pioneers to be inducted as a Life Member of the New South Wales Rugby League in 1908. During the 1920s Hennessy was a football and boxing coach at Waverley College. He was a non-playing coach of the 1929-30 Kangaroo tour of Britain, the first and only such appointment until Clive Churchill's in 1959. Hennessy prohibited kicking and the Australians were narrowly defeated. He coached Country against City in 1942-44, and Souths' firsts in 1946; about then he also published a coaching manual, “Winning Rugby Moves”. ‘The Father of South Sydney’ died on 19 September 1959 at Maroubra, aged 82, and was buried with Anglican rites in Botany cemetery.\n\nSAMUEL GEORGE BALL (1884-1969) George Ball was Souths’ pioneer administrator and a remarkable figure in the development of the South Sydney Club and the growth of rugby league in the 20th century. He was a man of calm disposition and solid judgement, and he had seen his beloved Rabbitohs, and the League, grow through the years to remarkable success. Mr Ball began his administrative career in 1900 as secretary of the Waterloo Albions rugby union side, which played in the junior competition. When the South Sydney club was officially formed in 1908 Mr Ball became Hon. Treasurer of the Club, and stayed in office until the following year. From there his duties included: Delegate to the League in 1909-66, Club Secretary in 1910-66, General Committee in 1943-57, Retention Committee in 1950-65, Private Member Reviewing Committee in 1950-66, Social Committee in 1950-66 and Members’ Reviewing Committee in 1963-66. Mr Ball was the first Secretary of the Australian Board of Control and was for many years a NSW representative on that body. He also served as manager of NSW sides to Queensland and New Zealand and managed the 1921 Kangaroo tour with clubmate, Billy Cann, the only time any club has had such an honour. He became one of the cornerstones of the game until stepping down from all duties on 12th April 1966. Mr Ball was inducted as a Life Member of the NSWRL in 1914, and he was one of 14 people who were the first to be inducted as Life Members of the South Sydney Football Club at the 54th Annual General Meeting held at Redfern Town Hall on 6th February 1962. His wife Alice Pearce was a champion swimmer and she was Sid ‘Sandy’ Pearce’s sister. The Pearce family were a famous swimming, sculling, boxing and footballing family. The junior representative competition, SG Ball Cup, was named after George Ball and has been in existence since 1965. Mr Ball died on 26th August 1969 at Double Bay, aged 85, and there were many fine tributes given to him after his death. But none summed up everyone's feelings towards this truly great statesman as the one given by Bill Buckley, OBE (President of the Australian and NSW Rugby League) when he said: \"George Ball was of fine character and a wonderfully sound administrator. I have never known a better one in League affairs.\"\n\nWILLIAM ASKEW CANN (1882-1958) Younger brother of Sydney Cann, who played for Souths’ Third Grade in 1909. Former rugby union three-quarter with Souths in 1905-07 (playing 20 games, scoring 5 tries), Billy Cann was a member of the rebel NSW side that played the NZ All Golds in 1907. He made his first grade rugby league debut with Souths in 1908, Round 2 v Western Suburbs at the Agricultural Ground, scoring two tries on debut. Mr Cann went on to become both an innovative player and long-serving administrator with Souths. A pioneer of lock forward play, he was also elected as the club's first committeeman in 1908 as well as Souths’ delegate to the NSWRL. Cann’s creativity in ‘loose’ play shaped the role of the lock in the professional code and he combined brilliantly with his backline. He took part in Australia’s inaugural Test series, against NZ in 1908, and was a member of the 1908-09 Kangaroos (8 matches, no Tests) and the 1911-12 ‘Australasian’ Kangaroos (18 matches, 3 Tests). Mr Cann also played against NZ (1909) and England (1914) during his international career and although he missed Souths’ first premiership final because he was on tour, he later played an important part in the club’s title wins in 1909 and 1914. He was inducted as a Life Member of the NSWRL in 1908. Following his retirement Mr Cann was co-manager of the 1921-22 Kangaroos with Souths secretary George Ball - the only time that officials from the same club have been in charge of a touring team. During the 1940s and 50s, Cann was a vice-president of the NSWRFL. He was also an SP bookie and for many years wrote articles for The Sydney Morning Herald. Mr Cann died on 7th June 1958 at Harbord after a short illness, aged 75.\n\nJOHN JOSEPH McGRATH (1884-1966) Mr McGrath took over from George Ball as Souths’ Treasurer in 1910 and stayed in that role until 1917. The following year he became Club President until 1924, as well as Hon. Auditor from 1918-19 and then club Delegate to the League in 1920-22. Mr McGrath was inducted as a Life Member of the South Sydney Football Club at the 89th Annual General Meeting held at the South Sydney Leagues Club in Redfern on 8th December 1963. He died on 15th June 1966 at Kensington, aged 82.\n\nEDWARD STEPHEN FRY (1878-1968) Brother of James Fry (who played rugby union for Souths in their very first game in 1900), Fred Fry (who played rugby league for Easts), and Bill Fry (who also played rugby league for Souths). Edward played first grade rugby union for Souths in 1902-07, playing in 62 games (scoring 9 tries and 2 field goals). He was also a member of the NSW Pioneers team who played against NZ All Golds in three games back in 1907. He made his first grade debut in rugby league in the very first game played in 1908 against North Sydney at Birchgrove Oval. He was also the Vice-Captain of the side and captained the first grade team in 5 games, including the Final against Eastern Suburbs, which Souths won by 14-12 to claim their first premiership victory. Mr Fry also played representative football with the Probables in 1908 and 2 games for NSW against the Queensland side in 1908. When his playing career ended in 1908, the loyal clubman continued at Souths in many different roles: on the Committee in 1909-32, Vice-President in 1911-19, 1921 and 1927-46 as well as Hon. Auditor in 1920-68. He was inducted as a Life Member of the NSWRL in 1908, and also as a Life Member of the South Sydney Football Club at the 55th Annual General Meeting held at Redfern Town Hall on 5th February 1963. He died on 27th March 1968 at Rockdale, aged 89, after a long illness.\n\nSouth Sydney District Rugby League Football Club Limited The Beginning… South Sydney District Rugby League Football Club was formed at a public meeting held at Redfern Town Hall on 17 January 1908. On March 5, 1908, the NSW Rugby League issued the Club its receipt No. 2 for their £ -1 – 1 – 0 affiliation fee. The Club’s first premiership match, also the first in the NSWRL competition, was played at Birchgrove Oval on Easter Monday, 20 April 1908. Souths defeated North Sydney 11-7. Winger Tommy Anderson scored Souths first try, with others added during the historic game by forwards Dick Green and Harold Butler, who also kicked a goal. The Club was incorporated as a company limited by guarantee at a Special General Meeting on 13 June 1982. The rebirth of the Rabbitohs began on 7 June, 2006 through a new partnership between Russell Crowe, Peter Holmes à Court and the 8000 Members of the Club. The voting Members of the Football Club voted by a 75.8% majority to convert the Club from a company limited by guarantee to a company limited by shares at an Extraordinary General Meeting held on 19 March 2006.\n\nOUTSTANDING SEASONS 1925: Won the first, reserve and third grade premierships and City Cup. First grade was undefeated in its 12 matches – the first and still the only team to win every game in a season. 1953: Won the first and reserve grade premierships, Club Championship and President’s Cup (then the only interdistrict junior competition). Runner – up in third grade, losing 11-9, after playing extra time. 1968: Won first and reserve grade premierships, Club Championships, President’s Cup and Flegg Trophy. Third grade defeated 14-9 in preliminary final. 1969: Minor premiers and runner’s up in first grade. Minor premiers in reserve grade. Won third grade premiership, Club Championship, Pre-season Competition, President’s Cup, Flegg Trophy and Ball Cup. TEAM ACHIEVEMENTS PREMIERSHIPS AND COMPETITIONS First Grade Premiers: 21 1908, 1909, 1914, 1918, 1925, 1926, 1927, 1928, 1929, 1931, 1932, 1950, 1951, 1953, 1954, 1955, 1967, 1968, 1970, 1971, 2014 First Grade Runners-Up: 14 1910, 1916, 1917, 1920, 1923, 1924, 1935, 1937, 1939, 1949, 1952, 1965, 1969, 2021 Reserve Grade Premiers: 20 1913, 1914, 1917, 1923, 1924, 1925, 1926, 1927, 1929, 1931, 1932, 1934, 1943, 1945, 1952, 1953, 1956, 1966, 1968, 1983 Reserve Grade Runners-Up: 8 1918, 1920, 1930, 1933, 1954, 1963, 1964, 1967 Third Grade/Under 23/Under 21 Grade Premiers: 10 1912, 1918, 1925, 1928, 1933, 1962, 1969, 1981, 1986, 1989, 2019 Third Grade/Under 23/Under 21/Under 20 Runners-Up: 15 1913, 1926, 1934, 1935, 1936, 1942, 1952, 1953, 1954, 1956, 1961, 1966, 1970, 1987, 2010 Third Grade South Sydney affiliated Clubs Premiers: 7 1908 (Sydney), 1909 (S.S. Federal), 1910 (Sydney), 1913 (S.S. Federal), 1921, 1922 (Mascot), 1923 (Kensington). World Club Challenge Champions (1976 - ): 1 2015 - defeated St Helens 39-0 at Lengtree Park. Record winning margin. Club Champions (1930 - ): 9 1932, 1933, 1952, 1953, 1954, 1967, 1968, 1969, 1989 City Cup Won (1912 – 1925, first grade): 4 1912, 1921, 1924, 1925 City Cup Runners-Up: 2 1914, 1917 Sports Ground Cup won (1912-1916, reserve grade): 3 1914, 1915, 1916 – won outright. League’s Cup won (1917 – 1926 reserve grade): 4 1917, 1918, 1919, 1922 NRL Auckland Nines (2014 - ): 1 2015 Pre-season competition won (1962 – 1981, 1990 – 1995): 5 1966, 1969, 1972, 1978, 1994 Mid-week Knockout Cup won (1974 – 1989): 1 1981 as Tooth Cup State Championship won (1932, 1939-1945): 1 1932 Sevens won (1988 - 2005): 1 1988 NSWRL WOMEN’S RUNNERS UP (2018 - ): 1 2018 NSWRL WOMEN’S MINOR PREMIERSHIP (2018 - ): 1 2018 JUNIORS COMPETITIONS WON Munn Cup (1908 – 1910): 3 1908, 1909, 1910 – won outright President’s Cup (1910 - ): 20 1936, 1942, 1943, 1951, 1953, 1960, 1961, 1962, 1963, 1964, 1965, 1968, 1969, 1971, 1972, 1974, 1977, 1980, 1982, 1983 H.J. Flegg Trophy (1961 - ): 9 1962, 1964, 1966, 1967, 1968, 1969, 1972, 1978, 2019 S.G. Ball Cup (1965 - ): 10 1965, 1969, 1974, 1975, 1976, 1979, 1980, 1986, 1994, 1998 H. Matthews Cup (1970 - ): 1 1974 Junior Club Championship (1982 - ): 1 1986 Lennox Cup (1947 – 1950): 1 1948 SUMMARY 79 NSWRL Grade competitions won 45 NSWRL junior competitions won Total: 122 LARGEST HOME GROUND ATTENDANCES No specific Home Ground (1908 - 1927): 31,500 at Sydney Cricket Ground V St George, 18 June 1927 Sydney Sports Ground (1928 - 1947): 31,095 v Balmain 4 June 1967 32,373 v Western Suburbs (Final) 16 September 1950, when not at home ground. Redfern Oval (1948 - 1987): 23,257 v Manly-Warringah 19 July 1987 Sydney Football Stadium (1988 - 2005): 35,316 v Sydney Roosters 15 March 2002 (competition round) 40,000 v Balmain 10 September 1989 (Preliminary Final) 36,804 vs St George Illawarra 16 February 2002 (Charity Shield) ANZ Stadium (2006 - current): 59,708 v Roosters 6 September 2013 (competition round) 83,833 v Bulldogs 5 October 2014 (Grand Final) 24,566 v St George Illawarra Dragons 18 February 2006 (Charity Shield) LARGEST ATTENDANCE AT ANY GROUND ANZ Stadium; 83,833 v Bulldogs, Grand Final, 5 October 2014 HIGHEST SCORE AND BIGGEST WINNING MARGIN IN PREMIERSHIP GAME 67 – 0 Western Suburbs, Sydney Showground, 23 July 1910\n\nINDIVIDUAL ACHIEVEMENTS MOST GAMES IN FIRST GRADE: 336 John Sutton 2004 - 2019 MOST GAMES IN ALL GRADES: 364 John Sutton 2002 - 2019"}, {"url": "https://www.wikiwand.com/en/Geoff_Griffin", "page_content": "Geoffrey Merton Griffin (12 June 1939 – 16 November 2006) was a Test cricketer who toured England with the South African cricket team in 1960, appearing in two Test matches. A right-arm, fast bowler and lower order batsman, his selection for the tour was controversial, because of his suspect bowling action – some of his deliveries were judged to be thrown rather than bowled. The core of his problem was that, due to a childhood accident, he was unable to fully straighten his right arm.\n\nSouth African cricketer\n\nQuick facts: Personal information, Full name, Born, D... ▼\n\nDuring the 1960 tour he was no-balled for throwing in several matches prior to the Test series, but retained his place in the side nevertheless. In his second Test appearance, at Lord's in June 1960, he became the first South African cricketer to take a hat-trick in a Test match, and also the first cricketer of any nationality to do this at Lord's. In the same match, however, he was no-balled for throwing eleven times, and again in an exhibition match that followed the match's early conclusion. These events ended his international career, and after fruitless attempts to resolve his problem, he retired from cricket in 1963, at the age of 23.\n\nGriffin was unfortunate to emerge on the international scene at a time when cricketing authorities were particularly concerned about the growing proliferation of bowlers with dubious actions and were determined to eradicate it. He, along with others, was convinced that he had been made a scapegoat to ensure that certain bowlers would be omitted from the Australian side due to tour England in 1961. After 1960 the throwing controversy largely subsided as an issue in international cricket."}, {"url": "https://www.theguardian.com/sport/2021/oct/03/nrl-diehards-gear-up-for-a-grand-final-like-none-before-south-sydney-rabbitohs-penrith-panthers", "page_content": "The Redfern Oval that Fran Grant remembers is long gone. The old hill into the ground and the cardinal and myrtle grandstand were pulled down years ago and replaced by a schmick $20m redevelopment that’s all clean lines and cool cement.\n\nThe South Sydney Rabbitohs are long gone too, of course. Lured away like so many NRL clubs to the cavernous Olympic Stadium, where clubs don’t have to worry about pesky local council fees and instead get paid handsomely to play.\n\nToday the spiritual home of one of rugby league’s foundation clubs matches the profile of the largely gentrified inner-city suburb it has become; populated by designer dog walkers and gym-fit preeners.\n\nIt was different when Grant was a kid. Along with her father, a member of the stolen generation, she remembers the raucous crowds, heady atmosphere, and the sense of belonging to something. “It was very working class, a poor area, but that never seemed to bother anyone,” she told the Guardian this week.\n\nFor all the Koori people there it was about being around your mob Fran Grant\n\nThe home of Australia’s first Aboriginal-run health and legal centres during the 1970s, the Block, TJ Hickey and Paul Keating’s Redfern speech, the suburb has for a long time been synonymous with Sydney’s Indigenous population. That intersection of politics and culture hasn’t escaped the Rabbitohs either, and the club’s history is over-stuffed with Indigenous icons such as Greg Inglis and Nathan Merritt.\n\n“But the fans were not only from Redfern, we grew up in Maroubra near the beach in public housing, it was just a great feeling being around people who not only loved the Rabbitohs but also our family. For all the Koori people there it was about being around your mob,” Grant remembers.\n\n“There was always a lot of Koori people there, I guess it’s important to keep in mind, Redfern was not an Aboriginal settlement per se, it was just where people came to be together, there was work there in the railways.”\n\nOn Sunday night, the Rabbitohs will play the Penrith Panthers in the NRL grand final. It will be an event like no other in rugby league history. Sydney’s long Covid-19 lockdown saw the game shifted out of its heartland and into Queensland, which will play host to its first ever decider.\n\nThe fraught relocation has made for a stunted build-up. While Souths’ last grand final appearance in 2014 seemed to prompt a week-long party, Redfern’s main strips, along with the southern beaches where its main fanbase exists, were quiet this week. So too out west, where fans have had to make-do with DIY pageantry, decking out homes in flags and banners.\n\nSouth Sydney supporters showing their colours. Photograph: Bianca de Marchi/AAP\n\nBut beyond the jarring prospect of two Sydney clubs playing to an out-of-state crowd, there is a kind of symmetry in the game. Located at diametrically opposite ends of the stark geographic and class divide that separates Sydney, Souths may represent rugby league’s blue collar past but it is the Panthers who better embody it in 2021.\n\n“It was always a tough area,” 2003 Panthers premiership hero Luke Rooney says of the Penrith he grew up in. “But it was my kind of town. Growing up I didn’t know anything else, but there are a lot of beautiful people there and it’s all about rugby league.”\n\nLocated in Sydney’s far west, the Panthers have never been a glamour club. When it joined the NSW rugby league in 1967, the club president owned a butcher’s shop, the vice president was a boiler maker, and one director’s profession was listed simply as “driver”.\n\nWhile the club may have lacked boardroom heft, its emergence from Sydney’s league obsessed, working class west meant it developed a production line of local talent.\n\nWhen Penrith won their first premiership in 1991, it was on the back of local products like Greg Alexander and Brad Fittler. So too in 2003, when Penrith juniors like Rooney and Luke Lewis became household names. The same has held in 2021 – much has been made of the fact many of the Panthers stars have played together since they were teenagers.\n\nPenrith’s young stars have come up through the ranks together. Photograph: Dave Hunt/AAP\n\n“That’s the thing, we get this stigma in western Sydney of being bogans and maybe we sometimes live up to that stereotype, but the reality is the team is about locals come good,” life-long Penrith fan Ben Cummings says. “It’s awesome to see these guys who didn’t have everything gifted to them on a silver spoon,” he says.\n\nIt’s awesome to see these guys who didn’t have everything gifted to them on a silver spoon Ben Cummings\n\nIf a change has occurred, it has been in tandem with the cultural dynamic of the area. As western Sydney has become more diverse, so too has the talent pool of young and eager footballers. That has, in many ways, helped rugby league reflect the culture and background of its fans more effectively than its rival code in Victoria.\n\nWhile the Age recently reported that a swathe of the starting players in the AFL grand final were products of Melbourne’s elite private schools, many of the Panthers players have spoken at length about the role of rugby league in helping to navigate life in the hardscrabble Penrith suburbs of Mount Druitt and St Marys. Charismatic winger Brian To’o in particular has been open about the challenges in his upbringing. In 2019 he told the Daily Telegraph about his family not being able to pay for a headstone after his sister died of cancer at the age of eight.\n\nIn that interview, he told the newspaper about missing out on birthday presents when money was tight. “But you go without,” he said at the time, “so your family can eat”. He used his Panthers contract to buy a headstone for his sister and, more recently, his match fees from State of Origin to help his parents buy a home.\n\nWhile league has a less than saintly reputation off the field, the presence of To’o and many other prominent Pasifika players among the Panthers means religion has also become a more central theme of the game. It has become common in recent years to see players in prayer huddles after games, and many of the players are open about the role of faith in their lives.\n\n“It is a good thing to see them practising their faith in the public arena, but also to see them on the field because it is inspiring to others,” Siona Vaelaa, the minister at the Samoa Worship Centre Christian Church in St Marys told the Guardian this week. “Especially young people who have no hope, who come from difficult backgrounds, it is very inspiring to see people that came from the same kind of place succeeding.\n\n“They had nothing too once, but they have done this. It really gives people hope that if those guys can do it, anybody can.”\n\nBut this is rugby league, and if the game is inextricably linked to the class of its fans and players, it is also, at its core, a capitalist machine. The Panthers’ on-field success may be attributable to its thriving junior nursery, but off the field its financial heft is built on the same thing that most NRL clubs survive on: poker machine revenue.\n\nFrom the late ‘90s the club began merging with a series of clubs across Sydney and greater NSW. By 2020, the Panthers group reportedly controlled six licensed clubs raking in $150m, including annual poker machine revenue of $66m. It’s an association South Sydney have been one of the few clubs to successfully shed.\n\nBetween the club’s last grand final victories in 1971 and 2014, Souths went from rugby league powerhouses to whipping boys, league rejects and then back again. After they successfully gained reinstatement following their ejection from the NRL in 2000, the new ownership of Hollywood actor Russell Crowe and casino mogul James Packer has seen the club attain the kind of cultural cache that other NRL clubs can only dream of.\n\nCrowe, in particular, has made the club fashionable by leaning into its storied history. The site of actress Natalie Portman at a Souths game this year was just the latest in a series of surreal moments for long-time Rabbitohs fans. For long-time fans like Josh Kemp, who was there at the very first meeting of Fightback campaign that saw Souths reinstated to the league, the change in stars still takes some getting used to.\n\n“Put it this way, I went to a school where it was predominantly [Canterbury Bull]Dogs fans and it was really, really unfashionable to support Souths,” he says.\n\n“I mean I was a proud Souths fan and I didn’t really care one way or another but we were getting belted every week and copping it, even in the fightback years it was not fashionable to support Souths. There were plenty of times at games where there were not many of us around.”\n\nBut for all the changes to the club and its traditional heartland, Souths has maintained a connection with its roots. When the Covid-19 pandemic hit, Grant, who works for a major airline, was stood down along with thousands of other employees. Through the Rabbitohs not-for-profit public benevolent institution, Souths Cares, she was able to keep putting food on the table for her three children.\n\n“It obviously meant a pretty big adjustment for our finances, but they have been just fantastic in supporting us with things like produce boxes but just generally supporting the family and our daughter, checking in and making sure she’s doing OK,” she says.\n\n“I think that’s thing that matters most about sport to me, is the community feeling.”"}, {"url": "https://www.theroar.com.au/2021/01/29/the-forgotten-players-south-sydney-rabbitohs/", "page_content": "This is the 28th and final episode in the series where we look at some of the forgotten players from your favourite club.\n\nThe series has covered all of the current clubs, those that disappeared in mergers, those that came and went and those that just disappeared.\n\nIt’s amazing how many players have come and gone through the various clubs over the years, how many who had brief careers, how many who had their careers cut short by injury, how many went from club to club like footballing nomads and how many became club stalwarts and legends.\n\nFacebook Twitter Whatsapp Reddit Email Share\n\nThis is the last in the series, so it’s fitting that we end with the South Sydney Rabbitohs, not only one of the two remaining foundation clubs and a club that won the first premiership in 2008 and then went back to back in 2009 but also a club that faced extinction at the end of the 1999 season only to be reborn bigger and better than ever in 2002.\n\nIn total 1142 players have proudly represented the Rabbitohs since Arthur Hennessy led the team out for their first-ever match at Birchgrove Oval in April 1908, and the list is littered with both club legends and icons of the game, including Clive Churchill, Ian Moir, Bobby McCarthy, John Sattler, John Sutton, Eric Simms, Michael Cleary, Greg Inglis, Howard Hallett, Elwyn Walters, Harold Horder, Benny Wearing, Ron Coote, Ernie Hammerton, Nathan Merritt, Johnny Graves, Bernie Purcell, Sam Burgess, George Treweek, Jack Rayner, Adam Reynolds – and so the list goes on and on.\n\nHere is a team made up of some of South Sydney’s lesser lights who represented the club since the mid-60s. How many do you remember?\n\n1. Bronko Djura\n\nDjura had two stints with Souths and a season with St George and ended his career with a cameo with Wests. He was a Newtown junior and a very talented sportsman, representing Australia at schoolboy level in both rugby league and cricket. He made his first-grade debut for Souths in 1984 and had three seasons with the club. After a season with St George he returned to the Rabbitohs in 1988 for another two years. In all he played 79 games for Souths.\n\nAdvertisement\n\n2. Bernie Lowther\n\nLowther was a very fast and powerful outside back with a knack for taking intercepts. He came from the Auckland competition to join Canterbury Bankstown in 1972 and then joined Souths for the 1975 and 1976 seasons, playing 42 first-grade games. He later played and coached in the Brisbane competition. He also played nine Tests for New Zealand.\n\n3. Jacin Sinclair\n\nSinclair was an exceptional talent but a player whose career was hampered both by injury and the pressure of living up to his early promise and accolades. He made his debut in the top grade with Balmain in 1991 but then headed to Souths in 1994 after a fallout with Balmain coach Alan Jones. He had three years with the Rabbitohs, playing 28 first grade games, before moving on to Easts. Sinclair passed away at the age of just 38.\n\n4. Bob Honan\n\nHonan was a dual international, playing two rugby Tests against the All Blacks and going on to play two league Tests against the Kiwis. Blessed with speed and a great step, he switched from the Brothers Rugby Club in Brisbane to South Sydney in 1967 after being controversially left out of the Wallabies tour side that year, and he went on to play 89 first-grade games with the club, winning premierships in both 1968 and 1970.\n\n5. Henderson Gill\n\nGill scored nearly 200 tries in his 300-plus-game career over 14 years. A Great Britain international who played 15 Tests, Gill was both quick and elusive, and his only experience in the Australian competition came in 1985 when he joined the Rabbitohs for eight games during the English off-season.\n\n6. Ken Wright\n\nWhat Wright lacked in size he made up for with both acceleration and great footwork. He first came to notice when playing for the Randwick Rugby Club, and he went on to play nine Tests for the Wallabies and six games for the Waratahs. He switched to league with Eastern Suburbs in 1979 and eventually arrived at Souths in 1982, where he played 36 games for the club over the next two years.\n\n7. Brett Kearney\n\nKearney was a solid performer who could play anywhere in the spine. He came to Souths in 2003 from the Central Coast via the Bears juniors and played 28 first-grade games for the Rabbitohs over the next three years before having three years with the Sharks. He moved to the UK in 2010 and played 112 top-level games for Bradford over the next five years.\n\nAdvertisement\n\n8. Harry Eden\n\nEden began life a centre and somehow ended up in the front row, and he just loved the physical encounters. After making his first-grade debut with the Roosters in 1969, he had a few seasons with the Dragons and then ended up at Souths in 1974, where he played 38 first-grade games over the next two years. Eden was both super fit and very quick for a front-rower and was a noted try-scorer, running in 27 tries in his 73-game first-grade career.\n\nSports opinion delivered daily\n\n9. Lee Jackson\n\nLee Jackson was quite simply one of the best hookers to lace on a boot. He came from the UK to Souths in 1995 and played just eight games for the club before joining the Knights in 1996 and helping them to their first premiership in 1997. The rest of his long and successful career was played in England, and he also played 23 Tests for the Great Britain and English sides.\n\n10. John Burke\n\nJohn Burke was an old-school English front-rower who was not afraid to push the boundaries on the field, resulting in him being sent off more than 20 times during his 16-year career. He joined Souths in 1976 and played ten first-grade games for the club that year, joining other formidable Souths front-rowers in John O’Neill and George Piggins. Playing against John Burke was not for the faint-hearted.\n\n11. Kane Cleal\n\nKane Cleal is the son of the legendary Noel Cleal and came from the bush to join Manly, making his first-grade debut for the club in 2004. Cleal joined Souths in 2006 and never really hit top form, playing just nine games for the Rabbitohs that year and being released at the end of the season.\n\n12. Tony Rampling\n\nYou always knew what you were going to get when Rampling took the field – hard and straight ball running, kamikaze defence and a large dose of mongrel. Rampling had two stints with Souths. He made his first-grade debut for the club in 1981 and played for the Rabbitohs for the next six seasons, also playing three Origin matches for New South Wales along the way. After stints with both Easts and the Gold Coast during the 1987 and 1988 seasons he returned to Souths in 1989 before spending time with both Salford in the UK and Western Suburbs. In all he played 91 first-grade games for the Rabbitohs.\n\nAdvertisement\n\n13. Ashley Harrison\n\nA former Australian Schoolboys representative, Harrison was playing in the Brisbane competition when he was called up to first grade by the Broncos in 2000, winning a premiership that year. One of the best lock forwards in the game at the time, he signed with South Sydney in 2003 and went on to play 66 games for the club over the next three years before moving on to the Roosters and then the Titans. He played 277 first-grade games in his 15-year career and 15 Origin matches for Queensland. He was one of the best players never to receive an Australian jersey.\n\n14. Troy Slattery\n\nSlattery was a versatile player and at different times played five-eighth and virtually every position in the pack. He made his first-grade debut with the Bunnies in 1993 and played 46 top-level games between 1993 and 1999 before finishing his career in England.\n\n15. Rick Stone\n\nRick Stone never really hit the heights as a player – in fact his only three first-grade appearances were off the bench with Souths in 1989. However, since his retirement as a player he has established himself as a quality coach, holding the clipboard for both the Newcastle Knights and the Huddersfield Giants.\n\n16. Paul McNicholas\n\nOne of the biggest players going around in his day, McNicholas was another who had two stints with Souths. He made his top-level debut with Souths in 1996 and went on to play 26 games for the club over the next four years. He then had a couple of years with the Sharks before rejoining Souths in 2002, notching up another eight first-grade games. He then headed to the Cowboys in 2003 before finishing his career in England. He also played three Tests for Ireland.\n\n17. Jaiman Lowe\n\nA hard nut by any standard, Lowe was a big and rugged forward who came to the Rabbitohs from the Cowboys in 2006 and played 50 first-grade games for the club over the next five seasons. He then moved on to the Storm and 2012 premiership success.\n\nAdvertisement\n\nThanks for following the series."}, {"url": "https://www.theguardian.com/sport/blog/2014/oct/03/south-sydney-rabbitohs-nrl-grand-final", "page_content": "Time is usually a killer for consistency in storytelling; the mind today can never know what the mind will want tomorrow. But for the past decade, there have been three surprisingly durable truths to life in the NRL. New South Wales will lose the State of Origin. Phil Gould will be indignant, on a weekly basis, about something or other. And the South Sydney Rabbitohs will fail to make the grand final.\n\nIn that sense, this has been a genuinely revolutionary year for rugby league. The Blues have shaken off the curses of the post-Joey Johns era at their ninth attempt. Gould, the puffy, disgruntled Garfield of rugby league punditry, has softened some of his verbal edges as he eases into the gentle decline of television old age. And most shockingly of all, South Sydney, after failing at the final hurdle the last two years, are into the grand final for the first time since 1971. But what’s most remarkable about the Rabbitohs’ participation in Sunday night’s decider is not that it’s taken them so long; it’s that they’re there at all.\n\nFor all the triumphs of the postwar years, when premiership followed premiership and the club turned itself into the most historically successful team in rugby league, a title it continues to hold today, disappearance has always been a core theme of South Sydney. It’s there, arguably, in the very location of the club, which sits in a bit of Sydney that, to me at least, has always been a little difficult to get a solid mental hold of: what, exactly (he says, dropping into his Werner Herzog voice), is South Sydney?\n\n“South Sydney”, as an idea, has none of the immediacy of the suburbs to its east (Roosters territory) and west (where the Tigers live). Even further down the parts of the south-west and south-east most obviously associated with the Bulldogs and the Dragons, respectively, seem to rush up on the inner south and rob it of any discrete urban identity to call its own; they make it feel like a place left over.\n\nNow gentrified, South Sydney is an area where light industry, plucky rows of single-story terraces and organic coffee and pig roast barns exist in an uncomfortable truce with each other; the names of its suburbs, whether mythical and exotic (Alexandria) or made-up-sounding (Zetland), add to the overwhelming sense of Rabbitohs land as a place both there and not there, on its way to something else but not quite sure of what that is. Even the club’s nickname, a remnant of South Sydney’s pre-league origins as a rugby union outfit, is a sign of absence, recalling the rabbits its earliest amateur players would sell in their day jobs away from the field of play. Obviously I’m overdoing things a little here, but it’s the season for going over the top; and besides, disappearance is on everyone’s mind this week, because it was only 15 years ago that South Sydney looked like vanishing, as a club, forever. Some history may be in order here.\n\n\n\nThe Rabbitohs are playing in their first grand final since 1971. Photograph: Renee McKay/Getty Images\n\nSouths, quite apart from being the sport’s most successful club, have always been the brightest laboratory for rugby league’s most macho urgings: this, after all, is the team that gave us Clive Churchill, Bob McCarthy, and the spectacle of John Sattler playing virtually a whole grand final with a broken jaw.\n\nBut the strut of the 1950s and 1960s had slowed by the 1970s and as the game and Sydney itself changed throughout the next two decades, the club stumbled. Bright spots appeared under the snarling, antic leadership of Mario Fenech in the 1980s but poor economic management through the early 1990s meant it was only a matter of time before the club hit the wall (although no one imagined that Julian O’Neill would personally act that process out in quite the manner that he did).\n\nThe catalyst, of course, was the Super League Wars, in retrospect less a battle over the future of the sport than a competition between two organisations of different means and outlook to see who could come up with the bigger tally of bad locations to set up a rugby league franchise. When Souths, faced with the prospect of merger or death and unable to find a partner at the frantic late-1999 dance of the historic Sydney clubs, were cut from the NRL for the 2000 season, it was difficult to see them ever returning. What beckoned, seemingly, was a future as a lower-tier Toyota Cup-level concern or as a feeder club, in the manner of the North Sydney Bears or the Newtown Jets. The Rabbitohs as an NRL team were dead.\n\nAt the turn of this century, the only things that kept the club afloat were Souths Juniors, one impassioned protest march and a handful of poo in the shoe jokes. Litigation is rarely the giver of life but it was through the courts that Souths elbowed their way back to league’s top table, winning readmission to the NRL in 2002. At first things did not go well: the club finished as theoretical wooden spooners in its first season back, and actual wooden spooners the next.\n\nMost of Russell Crowe’s post-Gladiator career, it’s fair to say, has been about the search of one man to find different ways to wear a boofy jacket (it was probably around the time of the release of Cinderella Man that Crowe reached peak boof in terms of his fashion sense, though he’s maintained a steady boof-rhythm in jacket choices since). Souths’ post-readmission struggles presented Crowe with the chance to give his wardrobe the context, and his sporting ego the stage, they deserved. More than anything, it is his takeover of the club in 2006 – Peter Holmes a Court by his side – that has set the Rabbitohs on the path to Sunday night.\n\nRussell Crowe shortly before his takeover of the Rabbitohs: ‘most of Russell Crowe’s post-Gladiator career, it’s fair to say, has been about the search of one man to find different ways to wear a boofy jacket’. Photograph: Mark Baker/AP\n\nWhat Crowe and Holmes a Court grasped best of all was that, in sport as in life, too much talk of real struggle can reduce the struggle to mere talk. This put them into immediate conflict with Piggins and many of the club’s former greats, such as McCarthy and Sattler. Where the old guard’s view of the club and its position within the code was fundamentally reclamatory and retributory, nourished by very legitimate past grievances and motivated by the desire to seek their redress, the new guard understood that the best way forward for the club was to shelve the past and get on with living. (It’s interesting, to say the least, that News Ltd, despite their instrumental role in forcing Souths into exile in the early 2000s, have, with their characteristic flair for playing the political angles, swooped in with an offer to broker a reconciliation of sorts between Piggins and his estranged love.)\n\nFrom being a team shaped around the hardscrabble hustle of mid-20th century inner-city working class Sydney, Crowe and Holmes a Court, the heir to a cattle fortune, changed the Rabbitohs into a much different team – a team built on meat. This was perhaps fitting, given rugby league’s place as the most straightforwardly beefy of the world’s football codes. There’s a little bit of George Street on a Friday night in every NRL player now, and Crowe – despite the impression he gives that at heart, he’s just a modest brickie out for a post-shift beer stuck reluctantly in a very wealthy man’s body – embraced the George Streetification of the code with zeal. At first there was something slightly flashy and needy about the way he went about wooing the code’s top players. The team of Roy Asotasi, Nigel Vagana, Dean Widders and Craig Wing, for all its obvious talent, always had the look of something whipped up in a rush, rather than a gathering force organically raised from scratch. Progress was halting. Jason Taylor came and went amid a buzz of expletives at Bar Coluzzi. Then there was John Lang; then there wasn’t John Lang.\n\nBut in more recent years, the Rabbitohs have mastered the combination of bling and brawn that has marked the best teams of this generation. For a start, there’s a deep bank of tactical acumen on the sidelines. Most people will see something quintessentially Australian in Michael Maguire’s laconic, buzzword-allergic approach to coaching; to me he resembles more a worldwise expat, trenchcoat on, whisky in hand, at a bar in Nazi-occupied Europe, mumbling hard truths out the corner of his mouth as he checks on flights to Lisbon. The team, built on the foundation of its monster forward pack, the genetic triple- (and sometimes quadruple-) hit of the Burgess brothers and the elusive promptings of John Sutton and Adam Reynolds, does the ugly and pretty things equally well. And in Greg Inglis, this triple-decker, reverse pinball machine of a man, the club boasts perhaps the game’s best non-halves back since Mal Meninga. This is a team for which, you sense, the time is finally right.\n\nThe way Sunday is being spoken about in the media it’s as if we are on the cusp of something messianic and truly epoch-defining, a theatrical happening of world-historical significance to rank with the Red Army’s Long March, the invention of the internet, or the final episode of Breaking Bad. And that’s all true, of course.\n\nBut for all the advances made under Crowe’s stewardship, Sunday, above all, is a tribute to the mere act of survival, a celebration of the persistence of one club in the face of mortal danger. This is one grand final, for once, that will be less significant as a sporting event than as a reminder of the brittle grandeur of experience, and of the delirious, critical necessity – against reason, through better evidence, no matter the disappointments – of holding on."}, {"url": "https://www.theguardian.com/sport/2021/oct/02/russell-crowe-has-been-magnificent-for-the-south-sydney-rabbitohs-and-the-nrl", "page_content": "South Sydney’s arch-rivals the Sydney Roosters are owned by motoring magnate Nick Politis, about whom it is said – and one would suggest our Nick is not averse to cultivating the theory – that he has the look of a craggy Al Pacino.\n\nRabbitohs fans, who have been butting heads with their near neighbours longer than the black-and-white spies in Mad Magazine, would tell you they do not need a lookalike famous Hollywood actor, a facsimile from Madame Tussauds, because they have the real thing at Redfern: a genuine, Oscar-winning Hollywood famous person.\n\nThe person they have, of course, is Russell Crowe.\n\nCrowe has been co-owner of South Sydney since 2006 when his final pitch to the membership – to grant him and fellow rich person Peter Holmes à Court 75% ownership for $3m while the membership retained a quarter – was: “Let’s vote ‘yes’. Let’s get into bed together. I hope you respect me in the morning.”\n\nSouths fans did indeed vote yes, and respected Crowe the next morning and ever since. And it has been nothing short of a hoot, because Crowe has been magnificent for Souths and for rugby league.\n\nThe game’s catchphrase is “the greatest game of all”, which belies (or perhaps highlights) its own insecurity about its place in the greater schema. Rugby league is proudly from working class roots. It is the Aussie battler. The underdog against “posh” rugby union and “up-itself” Australian rules.\n\nAnd there was Russell Crowe, rugby league’s Russell Crowe, bringing Hollywood to South Sydney. He brought Tom Cruise and his dazzling white teeth to the Sydney Football Stadium and wrapped him in a Souths scarf. Cruise looked excited and borderline crazy, like he had found a new cult.\n\nCrowe put Souths hats on – and thus made “Souths fans” of – an eclectic group of famous people including Ben Affleck, Snoop Dogg, Cristiano Ronaldo and the Dalai Lama. Pamela Anderson came to a game with Eva Mendes. Oprah Winfrey hung out on a boat with Crowe on Sydney harbour as a flotilla of the world’s press bobbed along nearby. Across the sea she trumpeted the club’s attempted signing of Melbourne Storm ace Greg Inglis by roaring – in her “you get a car and you get a car” Oprah way – “Greg Inglis”.\n\nI was just taking a punt. I just had an instinct Russell Crowe\n\nCrowe’s tenure on top has been like a show. You see the man on TV and it is like he’s playing Russell Crowe in The Russell Crowe Show. He has been a big beardy Moses-looking fellow and a handsome man ringing an old bell for which he paid $42,000 in Souths’ first game back in the big league in 2002. There was also a famous and quite cool “thumbs down” gesture during a derby game with those Roosters.\n\nHe narrated Bra Boys, a documentary about a Maroubra beach surf crew which featured Souths captain John Sutton. He helped keep Sutton at the club. He brought Sam Burgess and his three brothers to Souths, and their mum. The boys had lost their father, Mark, as teenagers to motor neurone disease. Crowe made Mark a member of Souths and made Sam cry.\n\nRussell Crowe, Taika Waititi and Chris Hemsworth watch the Rabbitohs’ round-three NRL match against the Roosters in March. Photograph: Brendon Thorne/AAP\n\nHe made Luke Keary angry. At a pre-season team bonding do at Crowe’s farm near Coffs Harbour in 2016, Crowe criticised the five-eighth, which drove Keary off the property at 3am and ultimately out of Souths. You can see how Keary might have been miffed. He went straight to the Roosters and won two premierships.\n\nSo there has been the odd misstep. Ultimately, though, Crowe has been a godsend for the Bunnies and for rugby league. A man with a passion for the club, a massive profile and deep pockets, not to mention pals with pockets even deeper.\n\nHolmes à Court sold out in 2014, weeks after Souths won the grand final and before another of Australia’s uber-wealthy people, James Packer, bought in. Packer’s famous, uber-rich dad, Kerry, was a Souths fan and a Roosters man. James is said to admire the quote “the winner is he who dies with the most toys”. Mariah Carey once bought him Jim Jefferies for his birthday, the comedian performing at Packer’s birthday party in front of (the real) Al Pacino, Warren Beatty, Eddie Murphy and Leonardo DiCaprio who arrived with three women. The uber-wealthy are odd enough birds.\n\nQuick Guide How do I sign up for sport breaking news alerts? Show Download the Guardian app from the iOS App Store on iPhone or the Google Play store on Android by searching for 'The Guardian'.\n\nIf you already have the Guardian app, make sure you’re on the most recent version.\n\nIn the Guardian app, tap the Menu button at the bottom right, then go to Settings (the gear icon), then Notifications.\n\nTurn on sport notifications. Was this helpful? Thank you for your feedback.\n\nCrowe is not uber-wealthy but he is still a very rich person with many homes. Finance journalists cannot tell you his exact worth – estimates are around $100m. He is doing well enough that in 2016 he and Packer waived a $7m loan to Souths. And since that magnanimity, the Rabbitohs have been flying. Today they are well run and have so many members that Crowe and Packer need only tip in money if Souths make a loss.\n\nCrowe is understandably proud of his contribution.\n\n“Did I have any idea what we could achieve when I took this on?” he speculated when asked by former Rabbitohs star Dean Widders on NITV. “You know, no, man,” Crowe said. “I was just taking a punt. I just had an instinct that if somebody was in charge, a single voice, so people would work to one set of ambitions, then we had a chance of being able to combine all the love that was out there.\n\n“The people wanted Souths to be successful. We still had a very high membership even though we were coming last every year.”\n\nToday they are a powerhouse. And on Sunday at Brisbane’s Suncorp Stadium, while Crowe is watching on television from Thailand where he is filming some secret Project X, Souths will play Penrith in a bid to win their 22nd premiership.\n\nAnd there at Suncorp, Covid-willing, club favourite Isaac Luke, hand-picked by Crowe, will ring that famous old foundation bell, the one that sounded the start of Souths’ first ever game, against North Sydney at Birchgrove Oval in 1908 and which Crowe has declared must be put away for nobody to even look at and brought out to ring only when Souths play a grand final.\n\nA sense of theatre and story, has our Rusty. He helped create a book of them called the Book of Feuds. Today there is a story about the bell’s journey from Crowe’s house to Brisbane. One might suggest the grand stage of big-time rugby league appeals to him. Actors love an audience, and to entertain, and this sport is pure entertainment."}, {"url": "https://www.famousfix.com/list/south-sydney-rabbitohs-captains", "page_content": "Clive Churchill Australian rugby league player and coach\n\n0 0\n\n#7 · rank\n\nClive Bernard Churchill AM (21 January 1927 – 9 August 1985) was an Australian professional rugby league footballer and coach in the mid-20th century. An Australian international and New South Wales and Queensland interstate representative fullback, he played the majority of his club football with and later coached the South Sydney Rabbitohs. He won five premierships with the club as a player and three more as coach. Retiring as the most capped Australian Kangaroos player ever, Churchill is thus considered one of the game's greatest ever players and the prestigious Clive Churchill Medal for man-of-the-match in the NRL grand final bears his name. Churchill's attacking flair as a player is credited with having changed the role of the fullback."}, {"url": "https://www.espncricinfo.com/story/geoff-griffin-dies-aged-67-268860", "page_content": "Geoff Griffin, the former South African pace bowler who was effectively no-balled out of Test cricket, has died in Durban aged 67\n\n\n\n\n\nGeoff Griffin in action during the 1960 tour of England which was the start and end of his international career © Cricketer International\n\nGeoff Griffin, the former South African pace bowler, has died in Durban aged 67. Geoff Griffin, the former South African pace bowler, has died in Durban aged 67.\n\nAlthough he played two Tests and was the first South African to take a hat-trick in a Test, Griffin will best be remembered as the man who was no-balled out of international cricket at Lord's in 1960.\n\nA tall, blond, quick bowler who topped the national averages during the 1959-60 domestic season with 35 wickets at 12.23, his action had been the subject of debate from the moment the South Africans landed. In his defence, he had suffered an accident as a schoolboy which meant he couldn't straighten his arm, but he was playing at a time that there was considerable debate over suspect actions, mainly of Australian fast bowlers.\n\nNo-balled in warm-up matches, he underwent remedial work at Alf Gover's famous indoor school before returning to action, but a number of people were not satisfied.\n\nAt Lord's he took a hat-trick, the first by a South African, but that was completely overshadowed by him being repeatedly no-balled. His career was almost finished when, in an exhibition match played as the Test ended early, he was again called for throwing. Attempting to finish an over by bowling underarm, he was then rather cruelly called for not informing the umpire of a change of action. \"We didn't take the warning seriously,\" he was to recall many years later. \"It sounded so preposterous to use an exhibition match to do the dirty on me. He remained on the tour playing as a specialist batsman.\"\n\nA good-natured and popular player, he was widely praised for the way he took this massive setback. Griffin was contacted by a lawyer who offered to take the matter to court, free of charge. \"You'll win hands down and end up a wealthy young man,\" he said. But he declined. \"I loved cricket too much to sully the great game further.\"\n\nMany felt that the relatively unknown Griffin had been singled out by the authorities, who were desperate to send a message to the world that chuckers would not be tolerated. The fear was that a major row would erupt if Australia brought their batch of suspect bowlers in 1961, and so Griffin was used to show that umpires were prepared, if necessary, to act. If so, it worked. Australia omitted all their fast bowlers whose actions had caused such rancour in 1958-59.\n\n\"I was the victim of a thoroughly distasteful 'chucking' conspiracy,\" Griffin said earlier this year. \"I was the fall guy. I attribute the blame to the SA cricket authorities and the MCC who should never have allowed things to develop as they did.\"\n\nHe returned home and moved from Natal to Rhodesia, but within two years - and still only 23 years old - his career was over after he was repeatedly no-balled against North-Eastern Transvaal at Salisbury."}, {"url": "https://peoplepill.com/people/geoff-griffin/", "page_content": "Geoffrey Merton \"Geoff\" Griffin (12 June 1939 – 16 November 2006) was a cricketer who played two Tests for South Africa in 1960. In his second Test appearance in 1960 at Lord's, he became the first (and, as of November 2014, only) South African cricketer to take a hat-trick in a Test match, and also the first and only cricketer to take a Test hat-trick at Lord's. He is best known for being no-balled for throwing in his second Test and the exhibition match that followed, and he never played Test cricket again.\n\nGriffin was born in Greytown in the former Natal Province and was educated at Durban High School. He was tall and blond, and excelled in many sports, playing hockey for Rhodesia and under-19s rugby for Natal. He was also Natal champion in the high jump, long jump, triple jump and pole vault.\n\nGriffin suffered an accident in childhood which rendered him unable to straighten his right arm. There was continuing controversy about bowlers \"throwing\" or \"chucking\" the ball (that is, flexing their elbow in the action of bowling the ball, which is contrary to the Laws of Cricket). The issue had been controversial since the editor of Wisden, Sydney Pardon, claimed that Australian fast bowler Ernest Jones was throwing in the tour of England in 1896, and then Jones and C. B. Fry were both no-balled in the Melbourne Test in 1897. The issue achieved renewed prominence following the Ashes series in Australia in 1958–59, when Australians Ian Meckiff and Gordon Rorke were suspected of throwing. Other fast bowlers, such as West Indies' Charlie Griffith and New Zealand's Gary Bartlett were also suspected. The MCC was determined to stamp out the problem before the Ashes series in England in 1961, and English umpires were instructed to strictly enforce the rule against throwing in 1960.\n\nGriffin made his first-class cricket debut for Natal in the 1957–58 South African domestic season, as a fast bowler. Despite being no-balled in South African provincial matches in the 1959–60 season, Griffin finished at the top of the averages, with 35 wickets at a bowling average of 12.23, and was selected to tour England in 1960, aged 20. Griffin was no-balled 8 times during the tour match against the MCC at Lord's in May 1960, the first time that a touring player was called for throwing, and no-balled again several times by various umpires in matches against the counties. His tried to change his action at Alf Gover's indoor school, and was not called once in the 42 overs that he bowled in the 1st Test at Edgbaston, although his pace was much reduced. In the search for quicker deliveries, he fell back into his old faults, and was called in a tour match against Hampshire.\n\nEnglish umpires Frank Lee and Syd Buller repeatedly called Geoff Griffin for throwing in the 2nd Test, at Lord's, starting from his third over. After being no-balled 5 times on the first day and 6 times on the second day, he returned for a final bowling spell on Saturday 25 June and dismissed M. J. K. Smith with the last ball of one over, caught behind by John Waite for 99, and then bowled Peter Walker and Fred Trueman with the first two balls of his next over. This was the first Test cricket hat-trick claimed by a South African cricketer. England immediately declared their first innings for 362 with 8 wickets down.\n\nEngland quickly dismissed South Africa twice to win by an innings and 73 runs, just after lunch on the fourth day, Monday 27 June, with Brian Statham taking 6–62 and 5–34. A 20-over exhibition match was arranged to fill the period until the scheduled presentation of the players to the Queen at tea. Griffin was again repeatedly no-balled in the exhibition match for throwing, and was also no-balled for failing to notify the umpires that he was changing to bowl underarm to complete an over. Griffin later recounted that Donald Bradman came to the dressing room to console him, and let him know that the umpires were acting on order from MCC president Gubby Allen.\n\nGriffin remained on the tour as a batsman, but never played Test cricket again. Many spectators could see no difference between his \"legitimate\" deliveries, and the ones that were no-balled: many concluded that he threw every delivery. The public saw him as a martyr and scapegoat, and he was warmly applauded by the spectators at all of his subsequent tour matches. None of the controversial Australian bowlers from the 1958–59 Ashes series toured England in 1961.\n\nHe moved to play for Rhodesia, but his cricket career ended less than 2 years later, at the age of 23, after he was no-balled playing in a Currie Cup match against North Eastern Transvaal at Salisbury.\n\nIn retirement from cricket, he played club cricket, was as a cricket coach, and worked as a hotel manager for South African Breweries in Durban, at the Argyll, and then at the Congela Hotel. He married twice.\n\nGriffin died of a heart attack in Durban."}, {"url": "https://www.theguardian.com/sport/2022/sep/11/after-seven-sin-bins-and-114-years-of-rivalry-latrells-rabbitohs-crush-roosters-in-fiery-final", "page_content": "Seven sin-bins, two costly concussions and one brutal battle marked the latest chapter in the NRL’s oldest feud between South Sydney and the Sydney Roosters.\n\nThe eight-game winning streak the Roosters brought into the elimination final was the longest unbeaten run of any side playing finals. However, they left the Sydney Football Stadium soundly beaten by their old rival, their 16-point loss their biggest defeat since round 11, when beaten 32-12 by Penrith.\n\nBeaten by their sworn enemies last week, a resurgent Souths won an elimination final 30-14 in front of a crowd of 39,816 at Allianz Stadium on Sunday, ending the Roosters’ 2022 hopes in one of the most violent and chaotic games in recent memory.\n\nThe Roosters’ cause was not helped when they lost James Tedesco and Angus Crichton to first-half concussions and were deprived of winger Daniel Tupou for the second half. At one point they had just 13 fit bodies when Siosiua Taukeiaho went off for a second-half head injury assessment for which he was later cleared.\n\nRoosters lock Victor Radley was sin-binned in each half - the first for punching after the intervention of the bunker and the second for running in and causing a melee. Teammate Jared Waerea-Hargreaves also got sent for 10 minutes on the sideline by referee Ashley Klein in the second half after he slammed Tom Burgess’s head into the ground with his forearm.\n\nThe seven sin-bins was a record for the NRL era, with Souths also losing Burgess and Tevita Tatola. Bunnies centre Taane Milne, like Radley, was sin-binned in both halves.\n\nRoosters superstar Tedesco was sent for an assessment in the 18th minute after he got collected by a thundering high shot from Burgess. Tedesco received clearance to return by the doctor until he showed concussion symptoms and was ruled out.\n\nBurgess doubled down 60 seconds later and got sent for ten minutes after he hit Matt Lodge in similar fashion. Teammate Milne followed him off shortly after when he contacted Tedesco’s replacement at fullback - Joseph Suaalii - flush across the jaw.\n\nWith Burgess and Milne off, Souths spent nine minutes down to 11 men in the first half but, with customary courage, managed to keep the Roosters at bay and even scored through ex-Rooster turned Rabbitioh Latrell Mitchell.\n\nThe relentless booing of Mitchell by Roosters supporters for the second week in a row was relegated to a footnote in an explosive opening 40 minutes but the ‘Taree Ferrari’ was assured and chased his try by kicking five goals from as many attempts.\n\nHe converted Alex Johnston’s opener before first-half tries to Crichton and Tupou to give Souths a 12-8 half-time lead.\n\nA frequrnt flier at the NRL judiciary, Waerea-Hargreaves was sin-binned for his hit on Burgess with Jai Arrow extending the Rabbitohs’ advantage after diving on a Cody Walker grubberkick in the 54th minute.\n\nDespite Nat Butcher hitting back for the Roosters, Tatola and Radley squandered the advantage as they were marched for forming a melee. Souths centre Isaiah Taas made sure of the victory when he weaved over the line to keep Souths’ finals hopes alive.\n\nHowever, their intensity could cost the Rabbitohs dearly as Thomas Burgess, Junior Tatola and Taane Milne sweat on NRL match review committee findings.\n\nWhile they have depth in the outside backs to cover Milne, the Rabbitohs can ill-afford to lose Burgess or Tatola for next week’s sudden-death semi-final against the Sharks, who finished the season second on the ladder.\n\nBurgess, 30, is averaging more tackle breaks this year than ever before and is running for 140 metres per game, while Tatola was recently crowned the Rabbitohs’ player of the year for his consistency through the middle.\n\nThe crowd became heavily involved in the chaos, booing Latrell Mitchell constantly despite the Souths fullback’s request for fans to go easy on taunting in the finals, a plea backed by his former mentor, Roosters coach Trent Robinson.\n\nBut despite the negative attention, it was the red-and-green fullback and his partner in crime Cody Walker who carried the Rabbitohs through the carnage. Mitchell had a hand in the first try of the game, another four-pointer to the prolific Alex Johnston.\n\n\n\nWith his side down two points and reduced to 11 men, Mitchell then proved his genius, spotting Sam Walker out of the defensive line and sei=zed the moment to barge over for a try of his own that gave Souths the lead at the half.\n\nWalker extended the Rabbitohs’ advantage after the restart, first finding Johnston on the wing with a cut-out pass, then providing for edge-back rower Jai Arrow, who pounced on his grubber kick.\n\nWhen Tatola and Milne were sin-binned, the Rabbitohs were again reduced to 11 men but held on to emerge victorious from the physical battle.\n\nThe Rabbitohs now face Cronulla in a semi-final next Saturday, with the winner advancing to face reigning premiers Penrith the following weekend. The sides’ last meeting was decided by a Nicho Hynes field goal and was one of the Rabbitohs’ three losses in the 10 regular season games after Mitchell’s return from a hamstring injury."}]}