{"Geoff Griffin was born on 28 August 1965.": [{"url": "https://www.espncricinfo.com/story/geoff-griffin-dies-aged-67-268860", "page_content": "Geoff Griffin, the former South African pace bowler who was effectively no-balled out of Test cricket, has died in Durban aged 67\n\n\n\n\n\nGeoff Griffin in action during the 1960 tour of England which was the start and end of his international career © Cricketer International\n\nGeoff Griffin, the former South African pace bowler, has died in Durban aged 67. Geoff Griffin, the former South African pace bowler, has died in Durban aged 67.\n\nAlthough he played two Tests and was the first South African to take a hat-trick in a Test, Griffin will best be remembered as the man who was no-balled out of international cricket at Lord's in 1960.\n\nA tall, blond, quick bowler who topped the national averages during the 1959-60 domestic season with 35 wickets at 12.23, his action had been the subject of debate from the moment the South Africans landed. In his defence, he had suffered an accident as a schoolboy which meant he couldn't straighten his arm, but he was playing at a time that there was considerable debate over suspect actions, mainly of Australian fast bowlers.\n\nNo-balled in warm-up matches, he underwent remedial work at Alf Gover's famous indoor school before returning to action, but a number of people were not satisfied.\n\nAt Lord's he took a hat-trick, the first by a South African, but that was completely overshadowed by him being repeatedly no-balled. His career was almost finished when, in an exhibition match played as the Test ended early, he was again called for throwing. Attempting to finish an over by bowling underarm, he was then rather cruelly called for not informing the umpire of a change of action. \"We didn't take the warning seriously,\" he was to recall many years later. \"It sounded so preposterous to use an exhibition match to do the dirty on me. He remained on the tour playing as a specialist batsman.\"\n\nA good-natured and popular player, he was widely praised for the way he took this massive setback. Griffin was contacted by a lawyer who offered to take the matter to court, free of charge. \"You'll win hands down and end up a wealthy young man,\" he said. But he declined. \"I loved cricket too much to sully the great game further.\"\n\nMany felt that the relatively unknown Griffin had been singled out by the authorities, who were desperate to send a message to the world that chuckers would not be tolerated. The fear was that a major row would erupt if Australia brought their batch of suspect bowlers in 1961, and so Griffin was used to show that umpires were prepared, if necessary, to act. If so, it worked. Australia omitted all their fast bowlers whose actions had caused such rancour in 1958-59.\n\n\"I was the victim of a thoroughly distasteful 'chucking' conspiracy,\" Griffin said earlier this year. \"I was the fall guy. I attribute the blame to the SA cricket authorities and the MCC who should never have allowed things to develop as they did.\"\n\nHe returned home and moved from Natal to Rhodesia, but within two years - and still only 23 years old - his career was over after he was repeatedly no-balled against North-Eastern Transvaal at Salisbury."}, {"url": "https://kids.kiddle.co/Geoff_Griffin", "page_content": "Geoffrey Merton Griffin (12 June 1939 – 16 November 2006) was a Test cricketer who toured England with the South African cricket team in 1960, appearing in two Test matches. A right-arm, fast bowler and lower order batsman, his selection for the tour was controversial, because of his suspect bowling action – some of his deliveries were judged to be thrown rather than bowled. The core of his problem was that, due to a childhood accident, he was unable to fully straighten his right arm.\n\nDuring the 1960 tour he was no-balled for throwing in several matches prior to the Test series, but retained his place in the side nevertheless. In his second Test appearance, at Lord's in June 1960, he became the first South African cricketer to take a hat-trick in a Test match, and also the first cricketer of any nationality to do this at Lord's. In the same match, however, he was no-balled for throwing eleven times, and again in an exhibition match that followed the match's early conclusion. These events ended his international career, and after fruitless attempts to resolve his problem, he retired from cricket in 1963, at the age of 23.\n\nGriffin was unfortunate to emerge on the international scene at a time when cricketing authorities were particularly concerned about the growing proliferation of bowlers with dubious actions and were determined to eradicate it. He, along with others, was convinced that he had been made a scapegoat to ensure that certain bowlers would be omitted from the Australian side due to tour England in 1961. After 1960 the throwing controversy largely subsided as an issue in international cricket.\n\nLife\n\nEarly life and cricket career\n\nGriffin was born in Graytown, Natal, on 12 June 1939. He received his education at Durban High School, where he excelled at many sports: cricket, athletics (he held provincial titles for high jump, triple jump and pole vault), and Rugby football (in which he played for the provincial under-19 XV). After leaving school he made his debut for Natal's Cricket XI in the 1957–58 season, and played regularly in 1958–59. In 1959–60 he returned bowling figures for the season of 35 wickets for an average of 12.23, heading the national bowling averages. His figures included 7 wickets for 11 runs in the extraordinary Currie Cup match at East London on 19–21 December 1959, in which Natal dismissed Border for 16 and 18. These performances were significant, because a Test tour of England was scheduled for 1960, and South Africa were looking for a partner for their star fast bowler Neil Adcock. Griffin was duly selected, at 20 the team's youngest player.\n\nThese early successes with Natal were, however, marked with a degree of controversy about Griffin's bowling action. As the result of an accident when a schoolboy, he could not fully straighten his right (bowling) arm; he experienced problems with his action while at school, and was twice no-balled for throwing during the 1958–59 season while bowling for Natal, although he escaped censure in the 1959–60 season. According to Griffin's Wisden obituarist many years later, his bent arm \"allied to an open-chested action, with front foot splayed towards gully, made him look more like a baseball pitcher than a conventional bowler\". John Waite, Griffin's future Test colleague, batting for Transvaal against Natal in 1958–59, says he informed the umpire that Griffin was throwing. The umpire replied: \"You concentrate on batting, and leave the umpiring to me.\"\n\nIt was Griffin's misfortune that his emergence as a possible Test bowler occurred at a time when the matter of illegal bowling was an issue of considerable and rising concern among cricket's international authorities. Incidents in a recent England tour to Australia had brought the issue to the fore; South Africa were, therefore taking some risk in selecting Griffin.\n\nSouth African tour of England, 1960\n\nEarly matches\n\nGriffin's first match of the 1960 tour was against Derbyshire, on 7–10 May. During this game the umpire Paul Gibb called the Derbyshire fast bowler Harold Rhodes six times for throwing, but Griffin remained unmolested. He took three wickets in his side's easy victory. In his next county game, against Essex, on 14–17 May, Griffin again escaped attention from the umpires, but members of the media, including the writer and former Test bowler Ian Peebles, wrote that \"there was something amiss\". The following week, in the match against the MCC at Lord's on 21–24 May, Griffin was called for throwing by both umpires, John Langridge and Frank Lee, the first member of any touring side to be thus called. When, a few days later, he was called again in the match against Nottinghamshire, it was clear that some action needed to be taken.\n\nThe immediate step was to send Griffin to the indoor cricket school run by the former England bowler Alf Gover, in Wandsworth. This treatment seemed to help, but at the same time to reduce Griffin's effectiveness. He returned to the side, and was duly selected to play in the First Test, at Birmingham, on 9–14 June. Langridge was one of the umpires, but the match passed without official incident, Griffin taking two wickets in each of England's innings in a game comprehensively lost by the tourists. However, a week later in Southampton, in the match against Hampshire, Griffin was called again, so his inclusion in the South African side for the Second Test at Lord's, on 23–27 June, was something of a risk.\n\nLord's Test, 23–27 June, and after\n\nAt Lord's, England batted first and scored 362. The match provided mixed fortunes for the beleaguered bowler. In the third over of the innings, Griffin was no-balled by umpire Frank Lee, and ten further times by the same umpire, before the innings closed in sensational fashion. In three successive balls, Griffin had Mike Smith caught behind for 99, Peter Walker bowled for 52, and Fred Trueman bowled for 0, to record the first-ever hat-trick in a Test at Lords. South Africa were then twice bowled out cheaply, the match ending with their defeat early on the afternoon of Monday 26 June. Because a visit from the Queen was scheduled for later that afternoon, to fill the available time the teams agreed to play an exhibition match of 20 overs per side.\n\nIn the exhibition match, despite its informal nature, the umpires Lee and Syd Buller chose to apply the Laws of cricket strictly. Bowling at half-pace from a shortened run, Griffin was no-balled by Buller for throwing on four occasions. When the South African captain, Jackie McGlew, remonstrated, Buller replied: \"We are playing to the Laws, which I must abide by\". Griffin was allowed to finish the over by bowling underarm, but was then pedantically no-balled again by Lee, standing at square leg, for failing to notify him of the change of action. These events provoked both great sympathy for the player and contempt for the authorities. The South African writer Louis Duffus challenged Buller's intransigency concerning the Laws; the exhibition match, he said, was being played outside the \"strict tenets of play\", because of the arrangement that every player was required to bowl. McGlew later wrote: \"My own feeling at that moment was that cricket, its laws and their application, had been reduced to complete and utter farce.\" There was general anger that the South African management had exposed Griffin to the Lord's Test, given the high likelihood of an incident; the management's response was to blame the press for stirring up the trouble.\n\nSubsequent matches\n\nThe events at Lord's finished Griffin as a bowler on the tour. He remained with the team, and played in a number of subsequent matches as a specialist batsman, generally in the lower order, but on a couple of occasions as an opener. He made a few useful scores, including 65 not out against Lancashire in his next match after the Lord's Test, and 37 in the final match of the tour, against T.N. Pearce's XI at the Scarborough Festival in September.\n\nGriffin was praised in The Cricketer magazine for \"the superb manner in which he has taken [his] misfortune\". A final attempt to analyse and perhaps correct his bowling action was made in the nets at Lord's, during the tourists' match against Middlesex in mid-July. In front of Bradman and McGlew, he bowled wearing a specially-designed surgical brace on his arm, but the experiment came to nothing.\n\nLate career, retirement, later life\n\nAfter the tour, Griffin was approached by a lawyer who offered to bring the issue to court, assuring the bowler that he would win if he brought a case against the authorities, but Griffin declined, not wishing, he said, \"to sully the great game further\". He returned to South Africa, and attempted to revive his cricket career there. He moved from Natal to Rhodesia, and played a few times for his new state, but this ended after he was repeatedly no-balled in a match at Salisbury, against North-Eastern Transvaal, in 1962–63. At the age of 23 he retired from first-class cricket. He continued his involvement with the game at club level and as a coach, while pursuing a new career in hotel management.\n\nGriffin died on 16 November 2006 at the age of 67, after collapsing while attending a dinner held at his old school, Durban High. In all first-class cricket he played 42 matches, taking 108 wickets for 2324 runs, averaging 21.51. With the bat he scored 895 runs, av. 17.90, with a highest score of 73. He held 19 catches. In his two Tests he took 8 wickets, averaging 24.00, and scored 25 runs, av. 6.25.\n\nAftermath\n\nNot everyone was convinced that Griffin threw rather than bowled the ball. The former England batsman Denis Compton wrote: \"I am sure the umpires have been too severe on this boy. Certainly he has a bent elbow, but he cannot straighten it because of physical disability. I have seen bowlers with far more suspect actions get away with it. And I will say definitely that Griffin does not throw\". Against this, the South African commentator Charles Fortune was convinced that Griffin threw, as were his team-mates Waite and Adcock. Fortune questioned the wisdom of the selectors in sending Griffin to England: \"they chanced their arm\", he wrote. The England batsman Peter Walker, who played at Lord's, was unequivocal: \"There was absolutely no doubt in either Mike [Smith]'s or my mind that he threw virtually every ball\".\n\nSome believed that Griffin had been deliberately scapegoated, as part of a conspiracy to ensure that Australia's suspect bowlers were excluded from the forthcoming 1961 tour of England. In support of the conspiracy theory the journalist Martin Chandler, in his analysis of the throwing controversy, writes that umpire Lee may have been instructed by Allen, during a rain break in England's innings in the Lord's Test, to take a firmer line against Griffin, who had largely escaped attention in the match at that point in time, but was afterwards called on six occasions in rapid succession. According to Griffin's later account, after the match Bradman came to the tourists' dressing room to offer sympathy, and claimed that Allen had ordered Buller to \"call Griffin out of the game\". Griffin asserted: \"I was the victim of a thoroughly distasteful 'chucking' conspiracy. I was the fall guy. I attribute the blame to the SA cricket authorities and the MCC who should never have allowed things to develop as they did\".\n\nIn the event, none of Australia's suspect quartet was selected for the 1961 tour. Burke retired from Test cricket after the 1958–59 series; Slater did not add to the one cap he gained during that series, and Rorke's international career had ended by December 1959. Meckiff played on until December 1963, when he was no-balled four times by the umpire Colin Egar during the first Test of a series against South Africa. He then retired from all forms of the game. In cricket generally, the throwing controversy rumbled on in low-key fashion, but did not re-emerge in Tests until 1995, when the Sri Lankan bowler Muttiah Muralitharan was no-balled for throwing seven times in Melbourne. Analysis through modern technology, however, demonstrated that every bowler, on delivery of the ball, flexed his arm to some extent, and the Laws were changed to reflect this; a 15-degree elbow bend was thenceforth permitted. Had this rule been applied in Griffin's day, it might have saved him."}, {"url": "https://infofamouspeople.com/famous/geoff-griffin.htm", "page_content": "Geoff Griffin's About ✎]\n\nGeoff Griffin was born on June 12, 1939 (age 67) in South Africa. According to numerology, Geoff Griffin's Life Path Number is 22. He is a celebrity cricketer. He played in two tests for South Africa in 1960, and became the country's first player to record a hat trick in a test. More information on Geoff Griffin can be found here. This article will clarify Geoff Griffin's Bio, Wikipedia, Age, Birthday, Height, and other information.\n\nLet's explore Your Tarot online (love,wellness,fortune)\n\nIf you are a fan of Geoff Griffin, tell us more about Him\n\nAdvertisement\n\nFamily, Spouse, Dating, and Relationships of Geoff Griffin ✎]\n\nHe was married twice.\n\nGeoff Griffin Before Fame ✎]\n\nOn 6-12-1939, Geoff Griffin was born. It indicates that He is on life path 22. His personal year number in 2023 is 7. He was an exceptional youth cricket, hockey, and track and field athlete.\n\nThe Numerology of Geoff Griffin ✎]\n\nGeoff Griffin has Life Path Number 22. Those with Life Path Number 22 are natural leaders. They are confident and can inspire others to achieve their goals with their great ambition. Additionally, they are also creative and resourceful deep thinkers. They are often visionaries and can see the potential in people and situations.\n\nAdvertisement\n\nGeoff Griffin's personal year in numerology ✎]\n\nGeoff Griffin was born in 1939, that means in 2023, Geoff Griffin has personal year number 7. This is the second bottoming phase, there will be many challenges and difficulties for Geoff Griffin in this year, especially in His career. He should prepare everything for the 8th year.\n\nSuccess of Geoff Griffin ✎]\n\nHe notably played domestic cricket for Natal, debuting in 1957.\n\nAssociated with ✎]\n\nIn his second test, he was often called for throwing by umpire Syd Buller. Virat Kohli, MS Dhoni, Sachin Tendulkar, and Shane Warne were also His acquaintances.\n\nGeoff Griffin Net Worth ✎]\n\nInformation about His net worth in 2023 is being updated as soon as possible by infofamouspeople.com, You can also click edit to tell us what the Net Worth of the Geoff Griffin is"}, {"url": "https://www.birthdayanswers.com/date/august-28-1965/", "page_content": "It was the 4th Saturday of 1965. If you were born on this date your birthday numbers 8, 28 and 1965 reveal that your life path number is 3. Your zodiac sign is Virgo with a ruling planet Mercury, your birthstone is the Peridot and Sardonyx, and your birth flower is the Gladiolus. You are 57 old, and were born in 1960s, in the middle of Generation X. The generation you are born into makes an impact on your life. Swipe up to find out what it all means.\n\n→ August 28, 1965 was a Saturday\n\n→ Zodiac sign for this date is Virgo\n\n→ This date was 21,106 days ago\n\n→ 1965 was the Year of the Serpent\n\n→ In 2023, August 28 is on Wednesday\n\nView must-know August 28, 1965 birthday facts that no one tells you about, such as your life path number, birthstone, ruling planet, zodiac sign and birth flower.\n\nYou have been alive for:\n\n\n\nPeople born on this day will turn 58 in exactly .\n\nIf you were born on this date:\n\nYou have been alive for . You were born in the Year of the Serpent. Your birth sign is Virgo with a ruling planet Mercury. There were precisely 715 full moons after you were born up to this day. Your billionth second was on was on May 6, 1997.\n\n→ You’ve slept 7,035 days or 19.27 years.\n\n→ Your next birthday is away\n\n→ You’ve been alive\n\n→ You were born in the Year of the Serpent\n\n→ You have been alive 506,553 hours\n\n→ You are 30,393,231 minutes old\n\n→ Age on next birthday: 58 years old\n\nYou were born on a Saturday\n\nAugust 28, 1965 was the 4th Saturday of that year. It was also the 240th day and 8th month of 1965 in the Georgian calendar. The next time you can reuse 1965 calendar will be in 2027. Both calendars will be exactly the same.\n\nThere are left before your next birthday. Your 58th birthday will be on a Sunday and a birthday after that will be on a Wednesday. The timer below is a countdown clock to your next birthday. It’s always accurate and is automatically updated.\n\nYour next birthday is in:\n\n\n\nSunday\n\nYou’ve slept 33% of your life!\n\nYour next birthday is on a\n\nAssuming you’ve been sleeping 8 hours daily since birth. Here is how much time you’ve spent sleeping so far:\n\nYou’ve slept 19.27 years of your life.\n\nYou’ve slept 231 month of your life.\n\nYou’ve slept 1,005 week of your life.\n\nYou’ve slept 7,035 days of your life.\n\nDid you know you have taken approximately 425,496,960 breaths since your birth? Moreover, using 80 beats per minute as average, your heart has beaten over 2,431,411,200 times. You have also blinked over 516,674,880 times in your lifetime.\n\n#1 Song on your birthday\n\nThe number one song in the US on the day of your birth was \"I Got You Babe\" by Sonny and Cher. (Billboard Hot 100 – August 28, 1965) . Ask your parents if they remember this popular song.\n\nDo you remember the number one song on your 14th birthday? It was \"My Sharona\" by The Knack (August 28, 1979) .\n\nCelebrities born on August 28, 1965\n\nYou share a birthday with You share a birthday with Satoshi Tajiri (game designer), Shania Twain (country singer), Amanda Tapping (tv actress).\n\nWe have over 150,000 celebrities in our database. We will continue to update this list with matching birthdays, so bookmark this page and check back often. You can also find out all celebrity birthdays born on August 28, 1965.\n\nWhat happened on August 28th\n\nBelow are some of the most important historical events that happened on 28 August 1965.\n\nSports in 1965\n\nThird Crusade: the Crusaders begin the Siege of Acre under Guy of Lusignan.English explorer Henry Hudson, discovers and explores Delaware Bay.1st American built locomotive, \"Tom Thumb\" races a horse-drawn car from Stockton and Stokes stagecoach company from Baltimore to Ellicott Mills. Let history record that due to mechanical problems the horse won!.Scientific American magazine publishes its first issue.Martin Luther King Jr. delivers his \"I have a dream speech\" addressing civil rights march at Lincoln Memorial, Washington, D.C.\n\nNBA – Boston Celtics beat Los Angeles Lakers (4 - 1) to win the NBA Finals.\n\nNHL – Montreal Canadiens defeated Chicago Blackhawks (4 - 3) to win the Stanley Cup.\n\nNFL –\n\nMLB – Los Angeles Dodgers beat Minnesota Twins (4 - 3) to win the World Series.\n\nYour life path number is 3\n\nSo what does your birthday really say about you and what does your life path number mean? On the next page, we’ll explain what your birth sign, ruling planet, age generation, birthstone, and birth flower mean — and more!\n\nContinue to the next page to discover the answers to the most important questions about your birthday."}, {"url": "https://murderpedia.org/male.G/g/griffin-geoffrey.htm", "page_content": "Murderpedia has thousands of hours of work behind it. To keep creating new content, we kindly appreciate any donation you can give to help the Murderpedia project stay alive. We have many\n\nplans and enthusiasm to keep expanding and making Murderpedia a better site, but we really\n\nneed your help for this. Thank you very much in advance."}, {"url": "https://www.idolbirthdays.net/geoff-griffin", "page_content": "Does Geoff Griffin Dead or Alive?\n\nAs per our current Database, Geoff Griffin has been died on Nov 16, 2006 (age 67).\n\n🎂 Geoff Griffin - Age, Bio, Faces and Birthday\n\nWhen Geoff Griffin die, Geoff Griffin was 67 years old.\n\nPopular As Geoff Griffin Occupation Cricket Player Age 67 years old Zodiac Sign Gemini Born June 12, 1939 (South Africa) Birthday June 12 Town/City South Africa Nationality South Africa\n\n🌙 Zodiac\n\nGeoff Griffin’s zodiac sign is Gemini. According to astrologers, Gemini is expressive and quick-witted, it represents two different personalities in one and you will never be sure which one you will face. They are sociable, communicative and ready for fun, with a tendency to suddenly get serious, thoughtful and restless. They are fascinated with the world itself, extremely curious, with a constant feeling that there is not enough time to experience everything they want to see.\n\n🌙 Chinese Zodiac Signs\n\nGeoff Griffin was born in the Year of the Rabbit. Those born under the Chinese Zodiac sign of the Rabbit enjoy being surrounded by family and friends. They’re popular, compassionate, sincere, and they like to avoid conflict and are sometimes seen as pushovers. Rabbits enjoy home and entertaining at home. Compatible with Goat or Pig.\n\nSome Geoff Griffin images\n\nAbout\n\nHe played in two tests for South Africa in 1960, and became the country's first player to record a hat trick in a test.\n\nBefore Fame\n\nHe was an exceptional youth cricket, hockey, and track and field athlete.\n\nTrivia\n\nHe notably played domestic cricket for Natal, debuting in 1957.\n\nFamily Life\n\nHe was married twice.\n\nAssociated With\n\nIn his second test, he was often called for throwing by Umpire Syd Buller.\n\nGeoff Griffin trend"}, {"url": "https://www.thetimes.co.uk/article/geoffrey-griffin-mpwptds02hc", "page_content": "WHILE the G8 summit leaders were focusing their minds on Africa, the world lost a man whose inspiration and dedication made poverty history for thousands of young Kenyans.\n\nIn 1959 Geoffrey Griffin rescued a handful of destitute boys, found roaming the streets of Nairobi. It was the time of the Mau Mau freedom fighters, when orphan children, forced to flee ravaged homes in the countryside, headed for the city. From this simple action grew the Starehe Boys’ Centre, an institution that became one of the most successful schools in Kenya, if not in all of Africa.\n\nSponsored\n\nGeoffrey William Griffin was born in 1933 in Eldoret, Kenya, the son of an English police officer, who went to serve in Kenya in 1919, and an English mother,"}, {"url": "https://buzzlearn.com/geoff-griffin/", "page_content": "Learn about Geoff Griffin Net Worth, Biography, Age, Birthday, Height, Early Life, Family, Dating, Partner, Wiki and Facts.\n\nWho is Geoff Griffin:\n\nGeoff Griffin is a famous Cricket Player. He was born on June 12, 1939 and his birthplace is South Africa. Geoff is also well known as, He played in two tests for South Africa in 1960, and became the country’s first player to record a hat trick in a test.\n\nGeoff is originated from South Africa. In his second test, he was often called for throwing by umpire Syd Buller.\n\nBiography:\n\nBio / Wiki Full Name Geoff Griffin Occupation Cricket Player Age Death Date – Nov 16, 2006 (age 67) Date of Birth June 12, 1939 Place of Birth South Africa Star Sign Gemini Country South Africa Gender Male\n\nBirthday, Age & Zodiac Sign:\n\nGeoff Griffin birthday is on 12-Jun-39 and he was born on Monday. He is now 67 years old. Geoff sun sign is Gemini and his birth flower is Rose or Honeysuckle.\n\nBirth date 12-Jun Day of Birth Monday Year of Birth 1939 Birth Sign Gemini Birth Sign Duality Assertive Birth Sign Modality & Element Mutable Air Opposite Sign Sagittarius\n\nHeight, Weight & Physical Stats:\n\nHere is the Body measurement informations.\n\nHeight N/A Weight N/A Bust – Waist – Hip N/A Hair Color N/A Eye Color N/A Shoe Size N/A\n\nEarly Life and Family:\n\nBefore he was famous, He was an exceptional youth cricket, hockey, and track and field athlete. His relationship status is single.\n\nFamily Information Parents Name Spouse Name N/A Children Name Number of Children(s) N/A Partner Name N/A Relative(s) Name\n\nEducation:\n\nUniversity N/A College N/A School N/A\n\nGeoff Griffin Net Worth:\n\nGeoff Griffin net worth or net income is estimated to be between $1 Million – $5 Million dollars. He has made such amount of wealth from his primary career as Cricket Player.\n\nNet Worth between $1 Million – $5 Million Annual Salary N/A Source of Income Cricket Player Verification Status of Wealth Unverified\n\nDead or Alive?\n\nGeoff Griffin was died on Nov 16, 2006 at age 67.\n\nQuick Facts:\n\nHere are some interesting facts about Geoff Griffin:\n\n* He notably played domestic cricket for Natal, debuting in 1957.\n\n* Geoff Griffin is the 20th century South-African cricketer.\n\nFrequently Asked Questions (FAQs):\n\nWhy is Geoff Griffin famous? He is famous for being a successful Cricket Player. Where is he from? He is from South Africa. How tall is he? His height is Not available. How much does he earn? between $1 Million – $5 Million. Is he married? Single. How many children(s) does he have? N/A.\n\nReference : Wiki, StarsNetworths, Newspapers."}, {"url": "https://www.cricketweb.net/geoff-griffin-guilty-or-not-guilty/", "page_content": "Geoff Griffin – Guilty or Not Guilty?\n\nMartin Chandler | 8:07pm BST 09 April 2015\n\nA decade after Cuan McCarthy another ill-starred blond Natalian fast bowler was born. Geoff Griffin maintained to the end of his days that he was the victim of a thoroughly distasteful chucking conspiracy. Like that of McCarthy Griffin’s cricket career did not last very long, and again in common with his predecessor he was undoubtedly treated badly. There was however one big difference between the two, in that unlike McCarthy Griffin almost certainly did throw.\n\nWhy should there have been a conspiracy is the first question that needs to be looked at. The flippant response to that is to point to conspiracy theories emerging in most situations of great controversy, but to be fair to Griffin when the ground opened up before him the game, in England at least, needed a scapegoat.\n\nA 19 year old Griffin had made his First Class debut in the 1957/58 season without tearing up any trees. His second campaign was much better and, at the same time, Peter May’s England were touring Australia. Having started the season as favourites to retain The Ashes England had been soundly beaten, and blamed the defeat on the quartet who inspired Jack Fingleton to title his book on the series Four Chukkas to Australia. The alleged offenders were Ian Meckiff, Gordon Rorke, Keith Slater and Jim Burke.\n\nThe next Ashes series was due to be played in England in 1961, and the authorities did not want Australia bringing with them a group of illegal bowlers thus, so Griffin’s argument would go, they resolved to adopt a zero tolerance attitude against South Africa in 1960. The reasoning was that by making it clear to Australia that, unlike on their own soil, offenders would be ruthlessly exposed, the selectors would be dissuaded from picking those with suspect actions. At this time the four mentioned in the preceding paragraph were by no means the only offenders in the Australian game.\n\nReturning to the 1958/59 South African domestic season it should not be forgotten that during that season Griffin was called for throwing twice by his own umpires. Des Fell called him in the match between Natal and Transvaal, and a couple of weeks later in an end of season trial Arthur Kidson called him as well.\n\nAnother Kidson, Hayward, as far as I can see unrelated to Arthur, was a South African umpire who went on to be one of that nation’s very best and who later wrote an autobiography. Prior to the selection of the 1960 touring party Hayward Kidson had never stood in a game in which Griffin played. But in making that point he did add a telling observation; Bearing in mind the lack of a suitable definition, I would most likely have gone along with the majority of umpires in this country and done nothing anyway. Men more senior than I had passed him, but there were warnings which the South African Board should perhaps not have ignored.\n\nThe side to tour England was to be selected at the end of the 1959/60 domestic season and if the Board were in any way reluctant to select him Griffin spent the summer piling on the pressure. He ended the campaign with the remarkable tally of 35 wickets at 12.22, including 7-11 in the second innings of a bizarre match in which Border were dismissed for 16 and 18. The Board could not ignore form like that, so Griffin was picked. It should also be borne in mind that throughout that momentous season no umpire called him. He didn’t encounter Arthur Kidson, but Fell was not troubled by Griffin’s action in the 41 overs he bowled in a match against Rhodesia.\n\nLike a number of bowlers, Muttiah Muralitharan the foremost of them, Griffin did start out with a “problem”, in that as a result of a bad break to his right arm in a childhood accident he could not straighten his elbow fully. Thus any square leg umpire would see a bent arm throughout his delivery. There was another factor with Griffin that exacerbated his difficulties. He had the classic open chested action of the thrower, with a front foot splayed outwards at the point of delivery.\n\nGriffin was left out of the side for the tour’s opening First Class fixture against Worcestershire. There was some speculation that the identity of the umpires dictated that decision. One was a known hardliner, Syd Buller, and the other, Jack Crapp, had recently called Worcestershire’s John Aldridge. To add fuel to that particular theory Aldridge was rested by the home side.\n\nThe South Africans next outing was against Derbyshire. Paul Gibb was not afraid to call a throw a throw but Griffin couldn’t be hidden forever so he played. There were six calls from Gibb at square leg, but none of them directed at Griffin who seemed to satisfy most of the travelling press pack that his action was fair. The man called on this occasion, wholly unjustly in this writer’s opinion, was Derbyshire’s Harold Rhodes.\n\nThe next appearance against a county for Griffin was the game against Essex. This time the press did get on his case although the umpires did not. One newspaper, The People, was particularly trenchant in its criticism of Griffin’s “jerk”. The only problem with that argument however was that on an experimental basis the word jerk had been removed from what was then Law 26 for the 1960 season.\n\nNearly all cricketers reminisce fondly about their first appearance at Lord’s, although it was not to prove a happy hunting ground for Geoff Griffin after he was selected to play against the MCC in late May. The day was cold and damp and the start of play, before a disappointing crowd, was considerably delayed. Skipper Jackie McGlew won the toss and invited the home side to bat. There were four uneventful overs from Griffin. His fifth began with a call from John Langridge for dragging, and then half way through the over Frank Lee crossed to point. He immediately called Griffin. It was the first time a visiting cricketer had ever been called for throwing in England. McGlew immediately took his man out of the attack.\n\nShortly before tea Griffin was reintroduced to the attack from the other end. He then guaranteed his place at the forefront of the next day’s Sunday Newspapers by being called by both umpires for the same delivery, by Lee for dragging and John Langridge for throwing. Langridge must have seen something different, because he had allowed Griffin to bowl unhindered in the game against Essex. Langridge called him again later in the game. One of the complaints that Griffin had, supported by many irrespective of their views on his basic action, was that all his deliveries were identical. Thus it should have been a case of all or nothing. Either everything he bowled was a no ball, or all were legal deliveries.\n\nThere was a meeting after the MCC match attended by South African manager Dudley Nourse, the umpires and MCC representatives. Nourse made a statement afterwards to the effect that he was entirely happy with the outcome of the meeting and that he believed that from then on English umpires would not have any further difficulty with Griffin. The press were critical and accused the MCC of condoning throwing. It may be that adverse reaction influenced what happened next, but Nourse’s view proved to be well wide of the mark. Griffin was left out of the next game at Northampton, but was selected to play against Nottinghamshire at Trent Bridge. He was called five times for throwing in the first innings, and three times in the second innings.\n\nIt was clear that by the end of the game Griffin, still not yet 21 and the baby of the South African team had, unsurprisingly, lost his direction and much of his pace. One thing he had however done, on McGlew’s instructions, was bowled his fastest delivery immediately after being called. For many with dubious actions it is their quicker ball that offends. As all of Griffin’s fastest got past the umpires that is something else that distinguishes his case from those of others who, at first glance, might appear similar.\n\nVery sensibly in the circumstances Griffin was packed off to Alf Gover’s indoor school for help in sorting out his action. Gover thought the basic action was fine, and sought to modify it in such a way that at the point of delivery Griffin was in a position where he couldn’t throw. He was back to join his teammates for the game against Glamorgan in which he bowled 18 overs without falling foul of the umpires. South African journalist Charles Fortune described his action as distinctly smoother.\n\nThe first Test followed the Glamorgan encounter and, in a 100 run defeat, Griffin took four wickets altogether and once more avoided censure. Langridge was one of the umpires on duty so, presumably, he too saw a difference. The second Test was, as usual, to be played at Lord’s. In the meantime there were two more county games, against Somerset at Taunton and Hampshire at Southampton.\n\nThere was no Griffin at Taunton, but he did play at Southampton and, if he thought his troubles were over he was to be sorely disappointed. He was called once each by Jim Parks Snr and Harry Elliott in the first innings, and three times by Parks in the second innings as well as once more by Elliott. He had now been called by six different umpires and the South Africans had a difficult decision to make about whether he should be selected for the Lord’s Test. The battle of wills was primarily between Nourse and Gubby Allen, the man who wanted to use Griffin as a stick with which to beat the Australian selectors.\n\nThe simple truth was that without Griffin there was no adequate foil for the South African spearhead Neil Adcock. So Griffin played at Lord’s and South Africa bowled first. Griffin’s first over was uneventful, and in the second he claimed the prized scalp of Colin Cowdrey. Just as he must have started to feel better about himself he then heard Lee call him twice from square leg in his third over. Never before had a bowler been called for throwing in a Test in England. At the close of a truncated day’s play England were 114-2, and Griffin had been called five times altogether.\n\nPlay began on time next morning and England moved serenely on to 210-3 by lunch, losing only Kenny Barrington to Trevor Goddard’s miserly left arm medium pace. Griffin did his share of bowling, and was not called at all, umpire Lee seeming to take less and less interest in him as the session wore on. His interest did however rise considerably after lunch when the new ball was taken and there were two more calls in Griffin’s very first over with it.\n\nThis is another basis for the conspiracy theory. As ever there was nothing different about the way that Griffin bowled after lunch, other than having a new cherry in his hand, but there was a very substantial change in the way that Lee went about his duties. It is difficult to dismiss the idea that Allen had had words with him during the interval. There was a rain break during the afternoon session, and after it Lee called Griffin twice more. By 6.15 pm in the final session Griffin had been called six times in all by Lee for throwing and once by Buller for dragging. He had not taken a wicket all day and when, with England cruising as 347-5, Mike Smith on 99 edged the last ball of an over into the gloves of ‘keeper John Waite most of the crowd did not know whether to feel sympathy for Smith or delight that the young bowler had finally got something to take from the game.\n\nThere was however much more for Griffin. With the first delivery of his next over he got through Peter Walker’s defences and just clipped the bails. The new batsman was Fred Trueman and his reaction to the hat trick delivery was to take a mighty swing at it and lose his leg stump. It was the first ever Test hat trick at Lord’s and the first by a South African anywhere. The crowd rose to applaud a young man they were growing to like. England reached the close at 362-8 and at that point Cowdrey declared. There was little play on the Saturday, which saw South Africa move to 34-1 in reply, but they then collapsed twice on the fourth day to lose by an innings before mid-afternoon. This committed the two sides to playing an exhibition match as a royal visit was due later so there had to be some cricket in play. The game involved no more than 20 overs per side and two overs per bowler, so it was a game that’s only purpose was to entertain the crowd.\n\nEngland batted first and Griffin took the second over. For the first time on the tour Buller was at square leg for Griffin. The youngster ran in off five yards to deliver the first of his dozen deliveries. For the second Buller crossed to point and then back again to square leg for the third. He called that as well as the next two despite Griffin having cut his “run up” down to a couple of paces and the delivery itself to a gentle loosener. There was a discussion between McGlew and Buller as a result of which McGlew instructed Griffin, following an indication from Buller that it would be the only way he could complete the over, to bowl underarm. Even then Lee chose to no ball the first such delivery on the basis that Griffin, unsurprisingly, had forgotten to inform the batsman he would be changing his mode of delivery. With commendable restraint McGlew wrote later; My own feeling at that moment was that cricket, its laws and their application, had been reduced to complete and utter farce. Former England and Middlesex leg spinner turned writer Ian Peebles, who published an interesting book on the throwing controversy a few years later, said of the episode, this was the saddest moment I have ever experienced in cricket.\n\nFollowing that particular debacle there was to be no more bowling for Griffin on the tour. He played occasionally as a batsman, and indeed in his first game in that role he scored an unbeaten 65 against Lancashire, but that effort apart there were not too many more runs for him.\n\nThe tour was just about the end of Griffin’s career, but not quite. An International Cavaliers XI arrived in South Africa for a month long tour a few days after the tourists got back. Griffin played twice against them, first for Natal and then for an invitation eleven. After the controversy in England Griffin was a big draw and the umpires, who included Fell, were firmly requested not call him. Howard Kidson stood in the second match and was content to follow orders. What would he have done if there were no such instructions? The answer to that one is as clear as mud. He first wrote I still had no clear definition of a throw although I knew a throw when I saw it, before adding cryptically, with Griffin I was left with a lingering impression that I had been observing something that certainly looked* like a throw.\n\nOne of the Cavaliers on that trip was Trueman who, interestingly, commented; On a dead wicket which wasn’t helping anyone Griffin let one go faster than anything I’ve ever bowled – it ripped the thumb clean off Norm O’Neill’s brand new batting glove. After the Cavaliers games Griffin moved to Rhodesia were he played a few matches over the next couple of seasons, but he stepped off a First Class cricket ground for the last time at the age of just 23 after being no balled seven times. He only bowled nine overs in what was a sad end to an unfulfilled career.\n\nSo did Griffin throw? In 1960 Richie Benaud wrote; He has a very strong wrist flick in the last moment of delivery but this is quite permissible under the new interpretation of law 26, Benaud was in a tricky position as a man who might have found himself skippering Meckiff, Rorke and Slater the following summer, and he made similar comments about Charlie Griffith before later doing a volte face with him.\n\nDenis Compton wrote; I am sure the umpires have been too severe on this boy. Certainly he has a bent elbow, but he cannot straighten it because of physical disability. I have seen bowlers with far more suspect actions get away with it. And I will say definitely that Griffin does not throw. On the other hand Fortune believed that Griffin threw as, more tellingly, did Adcock and Waite. But for all that no one ever suggested that there was any malice in Griffin. For a fast bowler he was certainly a man with an equable temperament. His reaction to his hat trick was not significantly different to the outwardly phlegmatic response to being called. Trueman summed him up by saying; I would like to say what a really good sport Griffin has been about the whole throwing business. Geoff is a very nice lad, I think we were all sorry for him on that tour.\n\nFurther evidence to support Griffin’s theory came the following year when none of the controversial Australian bowlers were chosen, despite all of them putting forward a decent case for selection in the previous domestic season. It may well be that Geoff Griffin’s action did infringe the laws of the game, but that doesn’t alter the fact that the treatment that he received at the hands of English umpires was truly appalling. His ordeal should never have been played out in the public eye in the manner that it was and the whole episode is one from which only Griffin himself emerges with any credit.\n\nBy the mid 1960s, when he might have been leading South Africa’s attack with Peter Pollock and Mike Procter, Geoff Griffin was building an alternative career for himself as a hotelier in Rhodesia and was lost to the game of cricket. In due course he moved back to Natal where, at the age of 67, he died from a heart attack in 2006.\n\n*the emphasis is Kidson’s, not that of the writer."}, {"url": "https://biogossipy.com/geoff-griffin/", "page_content": "Geoff Griffin net worth, birthday, age, height, weight, wiki, fact 2021-22! In this article, we will discover how old is Geoff Griffin? Who is Geoff Griffin dating now & how much money does Geoff Griffin have?\n\nSHORT PROFILE Father Not Available Mother Not Available Siblings Not Available Spouse Not Known Children(s) Not Available\n\nGeoff Griffin Biography\n\nGeoff Griffin is a famous Cricket Player, who was born on June 12, 1939 in South Africa. He played in two tests for South Africa in 1960, and became the country’s first player to record a hat trick in a test. According to Astrologers, Geoff zodiac sign is Gemini.\n\nHe was married twice.\n\nEthnicity, religion & political views\n\nMany peoples want to know what is Geoff Griffin ethnicity, nationality, Ancestry & Race? Let’s check it out!\n\nAs per public resource, IMDb & Wikipedia, Geoff Griffin’s ethnicity is Not Known. We will update Geoff Griffin’s religion & political views in this article. Please check the article again after few days.\n\nGeoff Griffin Net Worth\n\nGeoff is one of the richest Cricket Player & listed on most popular Cricket Player. According to our analysis, Wikipedia, Forbes & Business Insider, Geoff Griffin net worth is approximately $1.5 Million.\n\nGeoff Griffin Net Worth & Salary Net Worth $1.5 Million Salary Under Review Source of Income Cricket Player Cars Not Available House Living in own house.\n\nHe was an exceptional youth cricket, hockey, and track and field athlete.\n\nGeoff Griffin Height\n\nGeoff Griffin’s height Not available right now. Geoff weight Not Known & body measurements will update soon.\n\nGeoff Griffin Height & Body Stats Height Unknown Weight Not Known Body Measurements Under Review Eye Color Not Available Hair Color Not Available Feet/Shoe Size Not Available\n\nHe notably played domestic cricket for Natal, debuting in 1957.\n\nWho is Geoff Griffin dating?\n\nAccording to our records, Geoff Griffin is possibily single & has not been previously engaged. As of June 2021, Geoff Griffin’s is not dating anyone.\n\nRelationships Record: We have no records of past relationships for Geoff Griffin. You may help us to build the dating records for Geoff Griffin!\n\nFacts & Trivia\n\nGeoff Ranked on the list of most popular Cricket Player. Also ranked in the elit list of famous celebrity born in South Africa. Geoff Griffin celebrates birthday on June 12 of every year.\n\nYou may read full biography about Geoff Griffin from Wikipedia."}], "Geoff Griffin is Australian.": [{"url": "https://apollo.io/people/Geoff/Griffin/54ebb7e17468694311244f15", "page_content": "Established in 1989, Awards Australia is an Australian owned and run, Corporate Partnerships market leader. Specialising in awards programs on a state and national level, clients and the community receive win/w...\n\nEstablished in 1989, Awards Australia is an Australian owned and run, Corporate Partnerships market leader. Specialising in awards programs on a state and national level, clients and the community receive win/win opportunities and outcomes through established marketing, media and event management expertise. Awards Australia is committed to the client brief and positive outcomes.Awards Australia has successfully worked with organisations of all sizes, from large scale corporations, to small businesses, not-for-profits and government departments.Some of our clients include 7NEWS, PRIME7, Bank of Melbourne, Regional Development Victoria (VIC State Government), Prime Super, First National Real Estate and numerous Universities around Australia.Our team is made up of highly talented and dedicated professionals with skills in event management, marketing, design and community engagement.\"I have worked with the Awards Australia team since 2010 when Prime Super became a category naming right's partner of the Western Australian Regional Achievement and Community Awards. During this time, our relationship has continued to strengthen and Prime Super is now a national partner with naming rights of two categories in each state of Australia for the Regional Achievement and Community Awards and Community Achievement Awards programs. \"I thoroughly enjoy working with the Awards Australia team because I can rely on their commitment to excellence and delivering outstanding and consistent branding, networking and community engagement benefits not only for Prime Super, but for the community members that nominate or are nominated for these impressive Awards.\"- Rod Stewart, National Sales Manager, Prime SuperTo partner with us and/or nominate in our State awards programs visit https://awardsaustralia.com, phone 1300 735 445 or email info@awardsaustralia.com\n\nSee more"}, {"url": "https://www.espncricinfo.com/story/geoff-griffin-dies-aged-67-268860", "page_content": "Geoff Griffin, the former South African pace bowler who was effectively no-balled out of Test cricket, has died in Durban aged 67\n\n\n\n\n\nGeoff Griffin in action during the 1960 tour of England which was the start and end of his international career © Cricketer International\n\nGeoff Griffin, the former South African pace bowler, has died in Durban aged 67. Geoff Griffin, the former South African pace bowler, has died in Durban aged 67.\n\nAlthough he played two Tests and was the first South African to take a hat-trick in a Test, Griffin will best be remembered as the man who was no-balled out of international cricket at Lord's in 1960.\n\nA tall, blond, quick bowler who topped the national averages during the 1959-60 domestic season with 35 wickets at 12.23, his action had been the subject of debate from the moment the South Africans landed. In his defence, he had suffered an accident as a schoolboy which meant he couldn't straighten his arm, but he was playing at a time that there was considerable debate over suspect actions, mainly of Australian fast bowlers.\n\nNo-balled in warm-up matches, he underwent remedial work at Alf Gover's famous indoor school before returning to action, but a number of people were not satisfied.\n\nAt Lord's he took a hat-trick, the first by a South African, but that was completely overshadowed by him being repeatedly no-balled. His career was almost finished when, in an exhibition match played as the Test ended early, he was again called for throwing. Attempting to finish an over by bowling underarm, he was then rather cruelly called for not informing the umpire of a change of action. \"We didn't take the warning seriously,\" he was to recall many years later. \"It sounded so preposterous to use an exhibition match to do the dirty on me. He remained on the tour playing as a specialist batsman.\"\n\nA good-natured and popular player, he was widely praised for the way he took this massive setback. Griffin was contacted by a lawyer who offered to take the matter to court, free of charge. \"You'll win hands down and end up a wealthy young man,\" he said. But he declined. \"I loved cricket too much to sully the great game further.\"\n\nMany felt that the relatively unknown Griffin had been singled out by the authorities, who were desperate to send a message to the world that chuckers would not be tolerated. The fear was that a major row would erupt if Australia brought their batch of suspect bowlers in 1961, and so Griffin was used to show that umpires were prepared, if necessary, to act. If so, it worked. Australia omitted all their fast bowlers whose actions had caused such rancour in 1958-59.\n\n\"I was the victim of a thoroughly distasteful 'chucking' conspiracy,\" Griffin said earlier this year. \"I was the fall guy. I attribute the blame to the SA cricket authorities and the MCC who should never have allowed things to develop as they did.\"\n\nHe returned home and moved from Natal to Rhodesia, but within two years - and still only 23 years old - his career was over after he was repeatedly no-balled against North-Eastern Transvaal at Salisbury."}, {"url": "https://www.cricketweb.net/geoff-griffin-guilty-or-not-guilty/", "page_content": "Geoff Griffin – Guilty or Not Guilty?\n\nMartin Chandler | 8:07pm BST 09 April 2015\n\nA decade after Cuan McCarthy another ill-starred blond Natalian fast bowler was born. Geoff Griffin maintained to the end of his days that he was the victim of a thoroughly distasteful chucking conspiracy. Like that of McCarthy Griffin’s cricket career did not last very long, and again in common with his predecessor he was undoubtedly treated badly. There was however one big difference between the two, in that unlike McCarthy Griffin almost certainly did throw.\n\nWhy should there have been a conspiracy is the first question that needs to be looked at. The flippant response to that is to point to conspiracy theories emerging in most situations of great controversy, but to be fair to Griffin when the ground opened up before him the game, in England at least, needed a scapegoat.\n\nA 19 year old Griffin had made his First Class debut in the 1957/58 season without tearing up any trees. His second campaign was much better and, at the same time, Peter May’s England were touring Australia. Having started the season as favourites to retain The Ashes England had been soundly beaten, and blamed the defeat on the quartet who inspired Jack Fingleton to title his book on the series Four Chukkas to Australia. The alleged offenders were Ian Meckiff, Gordon Rorke, Keith Slater and Jim Burke.\n\nThe next Ashes series was due to be played in England in 1961, and the authorities did not want Australia bringing with them a group of illegal bowlers thus, so Griffin’s argument would go, they resolved to adopt a zero tolerance attitude against South Africa in 1960. The reasoning was that by making it clear to Australia that, unlike on their own soil, offenders would be ruthlessly exposed, the selectors would be dissuaded from picking those with suspect actions. At this time the four mentioned in the preceding paragraph were by no means the only offenders in the Australian game.\n\nReturning to the 1958/59 South African domestic season it should not be forgotten that during that season Griffin was called for throwing twice by his own umpires. Des Fell called him in the match between Natal and Transvaal, and a couple of weeks later in an end of season trial Arthur Kidson called him as well.\n\nAnother Kidson, Hayward, as far as I can see unrelated to Arthur, was a South African umpire who went on to be one of that nation’s very best and who later wrote an autobiography. Prior to the selection of the 1960 touring party Hayward Kidson had never stood in a game in which Griffin played. But in making that point he did add a telling observation; Bearing in mind the lack of a suitable definition, I would most likely have gone along with the majority of umpires in this country and done nothing anyway. Men more senior than I had passed him, but there were warnings which the South African Board should perhaps not have ignored.\n\nThe side to tour England was to be selected at the end of the 1959/60 domestic season and if the Board were in any way reluctant to select him Griffin spent the summer piling on the pressure. He ended the campaign with the remarkable tally of 35 wickets at 12.22, including 7-11 in the second innings of a bizarre match in which Border were dismissed for 16 and 18. The Board could not ignore form like that, so Griffin was picked. It should also be borne in mind that throughout that momentous season no umpire called him. He didn’t encounter Arthur Kidson, but Fell was not troubled by Griffin’s action in the 41 overs he bowled in a match against Rhodesia.\n\nLike a number of bowlers, Muttiah Muralitharan the foremost of them, Griffin did start out with a “problem”, in that as a result of a bad break to his right arm in a childhood accident he could not straighten his elbow fully. Thus any square leg umpire would see a bent arm throughout his delivery. There was another factor with Griffin that exacerbated his difficulties. He had the classic open chested action of the thrower, with a front foot splayed outwards at the point of delivery.\n\nGriffin was left out of the side for the tour’s opening First Class fixture against Worcestershire. There was some speculation that the identity of the umpires dictated that decision. One was a known hardliner, Syd Buller, and the other, Jack Crapp, had recently called Worcestershire’s John Aldridge. To add fuel to that particular theory Aldridge was rested by the home side.\n\nThe South Africans next outing was against Derbyshire. Paul Gibb was not afraid to call a throw a throw but Griffin couldn’t be hidden forever so he played. There were six calls from Gibb at square leg, but none of them directed at Griffin who seemed to satisfy most of the travelling press pack that his action was fair. The man called on this occasion, wholly unjustly in this writer’s opinion, was Derbyshire’s Harold Rhodes.\n\nThe next appearance against a county for Griffin was the game against Essex. This time the press did get on his case although the umpires did not. One newspaper, The People, was particularly trenchant in its criticism of Griffin’s “jerk”. The only problem with that argument however was that on an experimental basis the word jerk had been removed from what was then Law 26 for the 1960 season.\n\nNearly all cricketers reminisce fondly about their first appearance at Lord’s, although it was not to prove a happy hunting ground for Geoff Griffin after he was selected to play against the MCC in late May. The day was cold and damp and the start of play, before a disappointing crowd, was considerably delayed. Skipper Jackie McGlew won the toss and invited the home side to bat. There were four uneventful overs from Griffin. His fifth began with a call from John Langridge for dragging, and then half way through the over Frank Lee crossed to point. He immediately called Griffin. It was the first time a visiting cricketer had ever been called for throwing in England. McGlew immediately took his man out of the attack.\n\nShortly before tea Griffin was reintroduced to the attack from the other end. He then guaranteed his place at the forefront of the next day’s Sunday Newspapers by being called by both umpires for the same delivery, by Lee for dragging and John Langridge for throwing. Langridge must have seen something different, because he had allowed Griffin to bowl unhindered in the game against Essex. Langridge called him again later in the game. One of the complaints that Griffin had, supported by many irrespective of their views on his basic action, was that all his deliveries were identical. Thus it should have been a case of all or nothing. Either everything he bowled was a no ball, or all were legal deliveries.\n\nThere was a meeting after the MCC match attended by South African manager Dudley Nourse, the umpires and MCC representatives. Nourse made a statement afterwards to the effect that he was entirely happy with the outcome of the meeting and that he believed that from then on English umpires would not have any further difficulty with Griffin. The press were critical and accused the MCC of condoning throwing. It may be that adverse reaction influenced what happened next, but Nourse’s view proved to be well wide of the mark. Griffin was left out of the next game at Northampton, but was selected to play against Nottinghamshire at Trent Bridge. He was called five times for throwing in the first innings, and three times in the second innings.\n\nIt was clear that by the end of the game Griffin, still not yet 21 and the baby of the South African team had, unsurprisingly, lost his direction and much of his pace. One thing he had however done, on McGlew’s instructions, was bowled his fastest delivery immediately after being called. For many with dubious actions it is their quicker ball that offends. As all of Griffin’s fastest got past the umpires that is something else that distinguishes his case from those of others who, at first glance, might appear similar.\n\nVery sensibly in the circumstances Griffin was packed off to Alf Gover’s indoor school for help in sorting out his action. Gover thought the basic action was fine, and sought to modify it in such a way that at the point of delivery Griffin was in a position where he couldn’t throw. He was back to join his teammates for the game against Glamorgan in which he bowled 18 overs without falling foul of the umpires. South African journalist Charles Fortune described his action as distinctly smoother.\n\nThe first Test followed the Glamorgan encounter and, in a 100 run defeat, Griffin took four wickets altogether and once more avoided censure. Langridge was one of the umpires on duty so, presumably, he too saw a difference. The second Test was, as usual, to be played at Lord’s. In the meantime there were two more county games, against Somerset at Taunton and Hampshire at Southampton.\n\nThere was no Griffin at Taunton, but he did play at Southampton and, if he thought his troubles were over he was to be sorely disappointed. He was called once each by Jim Parks Snr and Harry Elliott in the first innings, and three times by Parks in the second innings as well as once more by Elliott. He had now been called by six different umpires and the South Africans had a difficult decision to make about whether he should be selected for the Lord’s Test. The battle of wills was primarily between Nourse and Gubby Allen, the man who wanted to use Griffin as a stick with which to beat the Australian selectors.\n\nThe simple truth was that without Griffin there was no adequate foil for the South African spearhead Neil Adcock. So Griffin played at Lord’s and South Africa bowled first. Griffin’s first over was uneventful, and in the second he claimed the prized scalp of Colin Cowdrey. Just as he must have started to feel better about himself he then heard Lee call him twice from square leg in his third over. Never before had a bowler been called for throwing in a Test in England. At the close of a truncated day’s play England were 114-2, and Griffin had been called five times altogether.\n\nPlay began on time next morning and England moved serenely on to 210-3 by lunch, losing only Kenny Barrington to Trevor Goddard’s miserly left arm medium pace. Griffin did his share of bowling, and was not called at all, umpire Lee seeming to take less and less interest in him as the session wore on. His interest did however rise considerably after lunch when the new ball was taken and there were two more calls in Griffin’s very first over with it.\n\nThis is another basis for the conspiracy theory. As ever there was nothing different about the way that Griffin bowled after lunch, other than having a new cherry in his hand, but there was a very substantial change in the way that Lee went about his duties. It is difficult to dismiss the idea that Allen had had words with him during the interval. There was a rain break during the afternoon session, and after it Lee called Griffin twice more. By 6.15 pm in the final session Griffin had been called six times in all by Lee for throwing and once by Buller for dragging. He had not taken a wicket all day and when, with England cruising as 347-5, Mike Smith on 99 edged the last ball of an over into the gloves of ‘keeper John Waite most of the crowd did not know whether to feel sympathy for Smith or delight that the young bowler had finally got something to take from the game.\n\nThere was however much more for Griffin. With the first delivery of his next over he got through Peter Walker’s defences and just clipped the bails. The new batsman was Fred Trueman and his reaction to the hat trick delivery was to take a mighty swing at it and lose his leg stump. It was the first ever Test hat trick at Lord’s and the first by a South African anywhere. The crowd rose to applaud a young man they were growing to like. England reached the close at 362-8 and at that point Cowdrey declared. There was little play on the Saturday, which saw South Africa move to 34-1 in reply, but they then collapsed twice on the fourth day to lose by an innings before mid-afternoon. This committed the two sides to playing an exhibition match as a royal visit was due later so there had to be some cricket in play. The game involved no more than 20 overs per side and two overs per bowler, so it was a game that’s only purpose was to entertain the crowd.\n\nEngland batted first and Griffin took the second over. For the first time on the tour Buller was at square leg for Griffin. The youngster ran in off five yards to deliver the first of his dozen deliveries. For the second Buller crossed to point and then back again to square leg for the third. He called that as well as the next two despite Griffin having cut his “run up” down to a couple of paces and the delivery itself to a gentle loosener. There was a discussion between McGlew and Buller as a result of which McGlew instructed Griffin, following an indication from Buller that it would be the only way he could complete the over, to bowl underarm. Even then Lee chose to no ball the first such delivery on the basis that Griffin, unsurprisingly, had forgotten to inform the batsman he would be changing his mode of delivery. With commendable restraint McGlew wrote later; My own feeling at that moment was that cricket, its laws and their application, had been reduced to complete and utter farce. Former England and Middlesex leg spinner turned writer Ian Peebles, who published an interesting book on the throwing controversy a few years later, said of the episode, this was the saddest moment I have ever experienced in cricket.\n\nFollowing that particular debacle there was to be no more bowling for Griffin on the tour. He played occasionally as a batsman, and indeed in his first game in that role he scored an unbeaten 65 against Lancashire, but that effort apart there were not too many more runs for him.\n\nThe tour was just about the end of Griffin’s career, but not quite. An International Cavaliers XI arrived in South Africa for a month long tour a few days after the tourists got back. Griffin played twice against them, first for Natal and then for an invitation eleven. After the controversy in England Griffin was a big draw and the umpires, who included Fell, were firmly requested not call him. Howard Kidson stood in the second match and was content to follow orders. What would he have done if there were no such instructions? The answer to that one is as clear as mud. He first wrote I still had no clear definition of a throw although I knew a throw when I saw it, before adding cryptically, with Griffin I was left with a lingering impression that I had been observing something that certainly looked* like a throw.\n\nOne of the Cavaliers on that trip was Trueman who, interestingly, commented; On a dead wicket which wasn’t helping anyone Griffin let one go faster than anything I’ve ever bowled – it ripped the thumb clean off Norm O’Neill’s brand new batting glove. After the Cavaliers games Griffin moved to Rhodesia were he played a few matches over the next couple of seasons, but he stepped off a First Class cricket ground for the last time at the age of just 23 after being no balled seven times. He only bowled nine overs in what was a sad end to an unfulfilled career.\n\nSo did Griffin throw? In 1960 Richie Benaud wrote; He has a very strong wrist flick in the last moment of delivery but this is quite permissible under the new interpretation of law 26, Benaud was in a tricky position as a man who might have found himself skippering Meckiff, Rorke and Slater the following summer, and he made similar comments about Charlie Griffith before later doing a volte face with him.\n\nDenis Compton wrote; I am sure the umpires have been too severe on this boy. Certainly he has a bent elbow, but he cannot straighten it because of physical disability. I have seen bowlers with far more suspect actions get away with it. And I will say definitely that Griffin does not throw. On the other hand Fortune believed that Griffin threw as, more tellingly, did Adcock and Waite. But for all that no one ever suggested that there was any malice in Griffin. For a fast bowler he was certainly a man with an equable temperament. His reaction to his hat trick was not significantly different to the outwardly phlegmatic response to being called. Trueman summed him up by saying; I would like to say what a really good sport Griffin has been about the whole throwing business. Geoff is a very nice lad, I think we were all sorry for him on that tour.\n\nFurther evidence to support Griffin’s theory came the following year when none of the controversial Australian bowlers were chosen, despite all of them putting forward a decent case for selection in the previous domestic season. It may well be that Geoff Griffin’s action did infringe the laws of the game, but that doesn’t alter the fact that the treatment that he received at the hands of English umpires was truly appalling. His ordeal should never have been played out in the public eye in the manner that it was and the whole episode is one from which only Griffin himself emerges with any credit.\n\nBy the mid 1960s, when he might have been leading South Africa’s attack with Peter Pollock and Mike Procter, Geoff Griffin was building an alternative career for himself as a hotelier in Rhodesia and was lost to the game of cricket. In due course he moved back to Natal where, at the age of 67, he died from a heart attack in 2006.\n\n*the emphasis is Kidson’s, not that of the writer."}, {"url": "https://awardsaustralia.com/about/", "page_content": "Established in 1989, Awards Australia is a Corporate Social Responsibility market leader.\n\nSpecialising in awards recognition programs on a state and national level, clients and the community receive win/win opportunities and outcomes through established marketing, media and event management expertise.\n\nAwards Australia is committed to the client brief and positive outcomes."}, {"url": "https://www.awardsaustralia.com/event-management-services/", "page_content": "Awards Australia is Australian owned and operated and renowned as Australia’s foremost Community and Corporate Awards Program organisers. We have been proudly working with and supporting the Corporate and Community sectors for over 30 years to deliver successful events and positive corporate and community outcomes.\n\nIn recent years the coordination of conferences, award programs, events and staff recognition programs and dinners for corporate, government and not for profit organisations across Australia have become an increasingly successful and fast growing part of the companies business.\n\nWhether you are planning a staff, stakeholder, industry, client or community awards recognition program, conference, corporate presentation or gala dinner, our Events Management Team offer the expertise and dedicated personalised event management resources for the successful outcome of your event.\n\nOur highly experienced Event Management Team bring together the skills required to deliver your successful event from beginning to end. Our team will work tirelessly to achieve your brief and event goals. Our aim is to ensure your peace of mind and absolute satisfaction.\n\nPlease call to discuss how we can assist you.\n\n\n\nContact\n\nGeoff Griffin\n\nManaging Director\n\nAwards Australia\n\nP: 0417 813 348\n\nE: geoff@awardsaustralia.com"}, {"url": "https://www.golf.org.au/ogilvy-griffin-back-where-it-all-began/", "page_content": "30 Nov 2021 | Feature stories |\n\nUS Open champion Geoff Ogilvy and 7-time professional winner Matthew Griffin have shared their support for public golf as they returned to their junior club, Cheltenham Golf Club, on Monday afternoon.\n\nThe nine-hole public course in the heart of Melbourne’s Sandbelt hosted the latest edition of ‘The Game by the Geoff Ogilvy Foundation’ and the narrow layout tested the skills of Ogilvy, Griffin, Mike Clayton and up-and-coming professionals Elvis Smylie and Bryden Macpherson, and amateur Andre Lautee.\n\nA strong crowd turned out to walk the course with their homegrown heroes as Ogilvy and Griffin had family members in tow, and mixed with former Beaumaris North Primary classmates, junior teammates and golf fans.\n\nLocal dog walkers were shocked to see roughly a hundred people watching on, while four green fee paying players in the group behind were trying even harder than usual to hit the ball straight off the tee.\n\n“Cheltenham is a great one because it has membership and public access, and when you’re out there playing you’ve got people walking their dogs in the afternoon. It’s a park, it’s green space,” Ogilvy said.\n\n“I guess the theory is that if it wasn’t a golf course it would be a park, but it wouldn’t be. It would be houses or condos or warehouses or something. To preserve this much green space, especially in this area with Sandy and Cheltenham, is just amazing. What a value add for the community.”\n\nGriffin shared similar sentiment and emphasised the need to protect the public game.\n\n“I doubt I would be a golfer without public golf,” he said.\n\n“I grew up probably a kilometre from here and started playing at Sandy, Cheltenham, Moorabbin - which is no longer - and Elsternwick which is also no longer. If we keep losing them, we’re guaranteed to lose golfers to the game.”\n\nPublic golf allowed Griffin and Ogilvy to unearth their talent during their adolescence - Ogilvy won Cheltenham’s B grade club championship in 1990 as a 13-year-old, while Griffin won A and B grade club championships at Cheltenham - through practice and playing competitively.\n\n“This was my house for the first three or four years of golf,” Ogilvy said.\n\nHe would ride his bike to the course as soon as the school bell rang and Griffin followed suit a few years later.\n\n“I played lots of putting comps and chipping comps here over the years,” he said.\n\n“It’s always been a place close to my heart. The club’s always been a big supporter of mine. Two of my caddies that have caddied for me in Australia have been members here.”\n\nGriffin gets back to Cheltenham to play a round a few times a year, and he paired up with local player Joel Harrod to get the better of Ogilvy and Commonwealth’s Alexandria Hillard in yesterday’s match.\n\nThe crowd erupted when Griffin holed-out for eagle on the par-5 7th, but some were equally pleased to see the course bite back when his birdie putt on the 8th green caught a downhill slope and trickled off the front of the green.\n\n“I’ve played here so many times before, but I’ve never done that,” Griffin said with a laugh.\n\nThe day belonged to young professional Darcy Brereton who shot the round of the day with a one-under par 34."}, {"url": "https://www.espncricinfo.com/story/geoff-griffin-dies-aged-67-268860", "page_content": "Geoff Griffin, the former South African pace bowler who was effectively no-balled out of Test cricket, has died in Durban aged 67\n\n\n\n\n\nGeoff Griffin in action during the 1960 tour of England which was the start and end of his international career © Cricketer International\n\nGeoff Griffin, the former South African pace bowler, has died in Durban aged 67. Geoff Griffin, the former South African pace bowler, has died in Durban aged 67.\n\nAlthough he played two Tests and was the first South African to take a hat-trick in a Test, Griffin will best be remembered as the man who was no-balled out of international cricket at Lord's in 1960.\n\nA tall, blond, quick bowler who topped the national averages during the 1959-60 domestic season with 35 wickets at 12.23, his action had been the subject of debate from the moment the South Africans landed. In his defence, he had suffered an accident as a schoolboy which meant he couldn't straighten his arm, but he was playing at a time that there was considerable debate over suspect actions, mainly of Australian fast bowlers.\n\nNo-balled in warm-up matches, he underwent remedial work at Alf Gover's famous indoor school before returning to action, but a number of people were not satisfied.\n\nAt Lord's he took a hat-trick, the first by a South African, but that was completely overshadowed by him being repeatedly no-balled. His career was almost finished when, in an exhibition match played as the Test ended early, he was again called for throwing. Attempting to finish an over by bowling underarm, he was then rather cruelly called for not informing the umpire of a change of action. \"We didn't take the warning seriously,\" he was to recall many years later. \"It sounded so preposterous to use an exhibition match to do the dirty on me. He remained on the tour playing as a specialist batsman.\"\n\nA good-natured and popular player, he was widely praised for the way he took this massive setback. Griffin was contacted by a lawyer who offered to take the matter to court, free of charge. \"You'll win hands down and end up a wealthy young man,\" he said. But he declined. \"I loved cricket too much to sully the great game further.\"\n\nMany felt that the relatively unknown Griffin had been singled out by the authorities, who were desperate to send a message to the world that chuckers would not be tolerated. The fear was that a major row would erupt if Australia brought their batch of suspect bowlers in 1961, and so Griffin was used to show that umpires were prepared, if necessary, to act. If so, it worked. Australia omitted all their fast bowlers whose actions had caused such rancour in 1958-59.\n\n\"I was the victim of a thoroughly distasteful 'chucking' conspiracy,\" Griffin said earlier this year. \"I was the fall guy. I attribute the blame to the SA cricket authorities and the MCC who should never have allowed things to develop as they did.\"\n\nHe returned home and moved from Natal to Rhodesia, but within two years - and still only 23 years old - his career was over after he was repeatedly no-balled against North-Eastern Transvaal at Salisbury."}, {"url": "https://apollo.io/people/Geoff/Griffin/54ebb7e17468694311244f15", "page_content": "Established in 1989, Awards Australia is an Australian owned and run, Corporate Partnerships market leader. Specialising in awards programs on a state and national level, clients and the community receive win/w...\n\nEstablished in 1989, Awards Australia is an Australian owned and run, Corporate Partnerships market leader. Specialising in awards programs on a state and national level, clients and the community receive win/win opportunities and outcomes through established marketing, media and event management expertise. Awards Australia is committed to the client brief and positive outcomes.Awards Australia has successfully worked with organisations of all sizes, from large scale corporations, to small businesses, not-for-profits and government departments.Some of our clients include 7NEWS, PRIME7, Bank of Melbourne, Regional Development Victoria (VIC State Government), Prime Super, First National Real Estate and numerous Universities around Australia.Our team is made up of highly talented and dedicated professionals with skills in event management, marketing, design and community engagement.\"I have worked with the Awards Australia team since 2010 when Prime Super became a category naming right's partner of the Western Australian Regional Achievement and Community Awards. During this time, our relationship has continued to strengthen and Prime Super is now a national partner with naming rights of two categories in each state of Australia for the Regional Achievement and Community Awards and Community Achievement Awards programs. \"I thoroughly enjoy working with the Awards Australia team because I can rely on their commitment to excellence and delivering outstanding and consistent branding, networking and community engagement benefits not only for Prime Super, but for the community members that nominate or are nominated for these impressive Awards.\"- Rod Stewart, National Sales Manager, Prime SuperTo partner with us and/or nominate in our State awards programs visit https://awardsaustralia.com, phone 1300 735 445 or email info@awardsaustralia.com\n\nSee more"}, {"url": "https://www.celebrityspeakers.com.au/speakers/geoff-huegill/", "page_content": "Geoff Huegill is one of Australia’s most inspirational athletes and one of the world’s greatest Butterfly competitors.\n\nHaving achieved Olympic status, he stumbled, got back up again, and rose to become one of the world’s greatest swimmers, winning medals at the 2010 Delhi Commonwealth Games and also the 2011 World Championships in Shanghai. In doing so, he fulfilled his personal goals and established himself as a powerful role model for people around the world.\n\nRegarded as one of Australia’s biggest personalities in the swimming world, Geoff is as impressive on stage as he is in the pool, Geoff shares his powerful insights, imparting his knowledge to executives, managers and staff by sharing the skill and disciplines he’s learnt from elite sport and shows how they can be applied to any business.\n\nGeoff connects with audiences on any level and provides valuable lessons for people from all walks of life – whether they’re setting personal or professional goals.\n\nMore about Geoff Huegill:\n\nGeoff Huegill’s swimming career is certainly impressive: he has won dual silver and bronze Olympic medals, he is a five-time World Champion, eight-time World Record holder, seven-time Commonwealth Gold medalist and holder of fourteen Australian National titles.\n\nYet it was his return to form in 2010 that has been by far the most impressive to date. Having won the Commonwealth 4x100m medley relay gold in 2002 with fellow swimmer Ian Thorpe, and competed at the 2004 Athens Olympics, Geoff Huegill left the pool behind and ballooned in weight.\n\nThen he went from overweight and out of shape to the top of his game at an age when most elite athletes are retired. At 31, he lost an incredible 49kg, retrained his body and mind – and went on to achieve his fastest times in the pool and become the second-fastest butterfly swimmer in the world. The time Geoff achieved for the 100m butterfly final – 51.69sec – was easily the fastest he has ever swum and placed him second in the world behind the greatest swimmer of all time, American Michael Phelps.\n\nToday, Geoff is an Athlete-Entrepreneur and co-director of many companies. He holds ambassadorships with Black Dog Institute, Sydney Children’s Hospital Foundation, MS – Qld, Sir David Martin, Foundation and Variety – The Children’s Charity. He is also the author of Be Your Best.\n\nGeoff Huegill has the persuasive power of someone who has overcome all the obstacles and succeeded at being his best. He talks about focusing the mind, body and spirit to be best you can be and imparts valuable messages about code of conduct, personal values and resilience.\n\nGeoff Huegill talks about:\n\nIn control – Sport and business run parallel; as a corporate athlete, how do we take control of our emotions and put strategies in place so we are not overwhelmed with the expectations and pressures that life throws at us on a daily basis?\n\nEnergised – In times of stress we all turn to things that give us comfort. For some it’s food, for others it’s alcohol, shopping or gambling. Geoff talks about what we eat and how we move on a daily basis balances our stress levels and also the importance of recovery.\n\nInspired – What is good work/life balance? How do we achieve that in a world where we’re forever ‘connected’ to the Internet? These workshops are designed to help us look at living a more ‘wholistic, well-balanced life’. What are we aiming for in life? Most importantly, what are the things we use to do before ‘life’ got in the way?\n\nChoices – Life is all about choices; most days we make good choices, but what do we do when the ramifications of a poor choice change our world? What happens to your train of thought, how do you remain upbeat at a time when your world is falling apart around you and how do you go from being reactive to being proactive?\n\nBe Your Best – Geoff shares his life story from the early stages of swimming to world domination and Olympic success, the struggles of transition from sport and having to fight back, from transforming his life and losing 45 kg to step back onto the blocks and successfully race again on the world stage.\n\nAccept it, Own it, Conquer it. Sport, Business and life – It’s better to live a life of design then a life of default. Geoff, the founder of Huegill Bodytech, a luxe lifestyle brand of supplements and sporting apparel, shares his strategies for success."}, {"url": "https://www.sec.gov/news/speech/griffin-remarks-aicpa-2020", "page_content": "Washington D.C.\n\nThe Securities and Exchange Commission disclaims responsibility for any private publication or statement of any SEC employee or Commissioner. This speech expresses the author's views and does not necessarily reflect those of the Commission, the Commissioners, or other members of the staff.\n\nIntroduction\n\nGood afternoon. I am excited to be able to speak with you today. I would like to share some observations regarding principal versus agent determinations under the revenue standard[1] and accounting for right of use assets under the leases standard.[2]\n\nPrincipal versus agent guidance\n\nThis year’s conference may have changed to an all-virtual format, but one thing that will remain the same is a member of the OCA staff providing a speech on principal versus agent considerations. This continues to be a frequent area of consultation for the OCA staff, and my colleague Jillian Pearce[3] and I will both discuss it at this year’s conference.\n\nSignificant judgment is often required when determining whether an entity is a principal or an agent in a revenue transaction. As discussed in previous staff speeches,[4] assessing whether an entity is a principal or agent under the applicable revenue guidance[5] can be particularly challenging in certain industries, such as the digital advertising industry or other industries in the technology space, where arrangements often involve multiple parties providing the good or service. I would like to share a fact pattern that illustrates such an arrangement.\n\nIn this fact pattern, the registrant operated a platform that facilitated an advertiser’s purchase of advertising space from a publisher. The registrant identified a specific advertiser’s digital advertisement (“ad”) before bidding on potential advertising space in an auction process. Upon winning an auction, the registrant obtained an exclusive right to the potential advertising space and immediately pre-loaded the identified advertiser’s ad to the publisher’s site. If a valid user reaches the stage in the publisher’s app where the potential advertising space is to be displayed, the pre-loaded ad is displayed in the advertising space on the publisher’s site and a revenue transaction occurs.\n\nThe registrant concluded it was an agent in the transaction, despite the fact that it obtained momentary title to the advertising space, stating that it did not obtain control of the advertising space prior to transferring it to the customer.[6] That is, the registrant concluded that it did not have the ability to direct the use of, and obtain substantially all the remaining benefits from, the publisher’s advertising space.[7] Due to certain constraints, the registrant concluded it was unable to direct the use of the potential advertising space to an ad other than the predetermined ad in the seconds between winning the auction and the time the ad was displayed on the publisher’s site.\n\nAs part of its assessment, the registrant considered the indicators of control set forth in the revenue recognition guidance, determining that it was not primarily responsible for fulfillment and did not have inventory risk; however, the registrant determined that it did have pricing discretion as the publisher had no ability to set or influence the price charged to advertisers.[8] In reaching its conclusion, the registrant stated that it was not primarily responsible for fulfillment based on the terms and conditions of its contract with the advertiser. The registrant believed that the terms and conditions of its contract only obligated it to provide an advertiser with access to the platform that facilitated the customer’s purchase of advertising space from publishers. Finally, the registrant stated that it did not promise its customer, explicitly or implicitly, the delivery of advertising space, nor did the customer have recourse against the registrant if its ad was not properly displayed in the advertising space or a valid user did not view the ad.\n\nBased on the facts and circumstances presented to OCA staff, the staff did not object to the registrant’s conclusion that it was an agent in the transaction and should recognize revenue on a net basis.\n\nRight-of-use asset guidance\n\nThe second topic I would like to discuss today relates to the accounting for abandonment of right-of-use assets under the leases standard.\n\nConsider a fact pattern where the registrant identified leases for abandonment, but expected there to be an extended period of time between the identification of abandonment and the actual abandonment date. The registrant noted that the leases standard requires a lessee to recognize any impairment loss for a right-of-use asset in accordance with existing guidance on impairment or disposal of long-lived assets;[9] however, upon performing an impairment assessment of the asset group, the registrant concluded there was no impairment. In this fact pattern, the registrant’s identification of specific leases for abandonment did not result in a change to the asset group (i.e., the lowest level of identifiable cash flows) for which it assessed impairment.\n\nThe registrant noted that the leases standard did not provide explicit guidance to address its unique circumstances. The registrant identified a number of alternatives that it believed could be acceptable but ultimately concluded that it would be appropriate to adjust the amortization period of the right of use assets associated with the leases identified for abandonment. Given its plans to abandon these leases, and in the absence of any impairment, the registrant re-evaluated the economic life of the associated right-of-use assets and determined that the remaining right-of-use assets should be amortized ratably over the period between identification of abandonment and the actual abandonment date.\n\nThe staff did not object to the registrant’s conclusion.\n\nConclusion\n\nThank you for your time and I hope you enjoy the remainder of the conference."}], "Geoff Griffin was a professional rugby league footballer.": [{"url": "https://wiki.alquds.edu/?query=George_Griffin_(rugby_league)", "page_content": "English professional rugby league footballer\n\nGeorge Griffin (born (1992-06-26)26 June 1992) is an English professional rugby league footballer who plays as a prop, second-row or loose forward for the Castleford Tigers in the Betfred Super League.\n\nHe has previously played for Hull Kingston Rovers, the London Broncos, and the Salford Red Devils in the Super League. He has spent time at Gateshead Thunder in the Championship 1 on dual registration from Hull KR, and at the Wakefield Trinity Wildcats in the Super League on loan from Salford.\n\nBackground [ edit ]\n\nGriffin was born in Oxford, Oxfordshire, England. He is the younger brother to Josh and Darrell Griffin.\n\nGriffin previously played rugby union while growing up in Oxford, before moving to rugby league alongside his brothers. He played as a junior for Stanley Rangers.[2]\n\nCareer [ edit ]\n\nHull Kingston Rovers [ edit ]\n\nGriffin signed for Hull Kingston Rovers on a two-year deal in September 2011.[6] He had been playing in Australia for the Queanbeyan Kangaroos, a feeder team to the Canberra Raiders, and was originally set to sign for Crusaders until they withdrew from Super League.[6]\n\nGriffin made his Super League debut for Hull KR against the Widnes Vikings on 29 July 2012.[7] He went on to make a total of 20 appearances throughout his 2 seasons at Hull KR.\n\nGateshead Thunder (dual registration) [ edit ]\n\nIn 2013, Griffin played for Gateshead Thunder in the Championship 1 through their dual registration agreement with Hull KR. He made 3 appearances and scored 2 tries for the Thunder.[citation needed]\n\nLondon Broncos [ edit ]\n\nIn January 2014, it was announced that Griffin had signed for the London Broncos.[8] He made 20 appearances and scored 1 try in the 2014 season.\n\nSalford Red Devils [ edit ]\n\nIn July 2014, shortly after London's relegation from Super League was mathematically confirmed, Griffin signed a one-year deal to join the Salford Red Devils for 2015.[9] He would be joining his older brothers Darrell and Josh who already played for the club.[10]\n\nGriffin played alongside both of his brothers for the first time at the 2015 Magic Weekend against the Widnes Vikings, just days after the death of their father.[11] He signed a two-year contract extension with Salford in June 2015.[12]\n\nIn May 2017, Griffin agreed a new two-year contract with Salford, keeping him at the club until the end of 2019.[13]\n\nHe played in the 2019 Super League Grand Final defeat to St. Helens at Old Trafford.[14][15][16]\n\nGriffin made 115 appearances and scored 20 tries during his time at Salford.\n\nWakefield Trinity Wildcats (loan) [ edit ]\n\nGriffin joined the Wakefield Trinity Wildcats on a one-month loan deal in March 2015, making 5 appearances.[17]\n\nCastleford Tigers [ edit ]\n\nIn July 2019, Griffin signed a two-year deal to join the Castleford Tigers (Heritage № 996) from 2020.[18] Head coach Daryl Powell described him as a \"tough hard-working player\" with a \"first-class work rate and attitude\".[19]\n\nGriffin was assigned squad number 16 for 2020.[20] He made his Castleford debut on 2 February against the Toronto Wolfpack.[21] He scored his first try for the club against Hull FC in the 6th round of the Challenge Cup.[22]\n\nIn May 2021, Griffin extended his contract with the Tigers for a further year.[23] On 17 July 2021, he played for Castleford in their 2021 Challenge Cup Final loss against St Helens.[24]"}, {"url": "https://peoplepill.com/people/william-griffin-1/", "page_content": "William \"Bill\" Griffin (birth unknown) is a Welsh former rugby union, and professional rugby league footballer who played in the 1950s. He played club level rugby union (RU) for Abertillery RFC, and representative level rugby league (RL) for Wales, and at club level for Huddersfield, as a loose forward, i.e. number 13, during the era of contested scrums.\n\nRugby union\n\nGriffin started his career in rugby union, where he played for Abertillery. In his final season at the club, he was the club's leading goal- and try-scorer.\n\nRugby league\n\nIn June 1951, Griffin switched to rugby league and joined Huddersfield. He made his début in August 1951 against Halifax. He spent his entire rugby league career with the club, announcing his retirement during the 1956–57 season.\n\nInternational honours\n\nIn rugby league, Griffin won one cap for Wales while at Huddersfield in 1952 against France.\n\nCounty Cup Final appearances\n\nBill Griffin played right-prop, i.e. number 10, in Huddersfield's 18-8 victory over Batley in the 1952 Yorkshire County Cup Final during the 1952–53 season at Headingley Rugby Stadium, Leeds on Saturday 15 November 1952."}, {"url": "https://wiki2.org/en/George_Griffin_(rugby_league)", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nEnglish professional rugby league footballer\n\nGeorge Griffin (born (1992-06-26)26 June 1992) is an English professional rugby league footballer who plays as a prop, second-row or loose forward for the Castleford Tigers in the Betfred Super League.\n\nHe has previously played for Hull Kingston Rovers, the London Broncos, and the Salford Red Devils in the Super League. He has spent time at Gateshead Thunder in the Championship 1 on dual registration from Hull KR, and at the Wakefield Trinity Wildcats in the Super League on loan from Salford.\n\nYouTube Encyclopedic\n\n1 / 5 Views: 627 4 731 413 1 354 855\n\nGeorge Griffin | Career Highlights ᴴᴰ\n\nK2 Team-mates: George Griffin & Gareth O'Brien\n\nJosh Griffin Highlights\n\nSalford's George Griffin takes on the Cfast 1 minute row\n\nJosh Griffin Transcription\n\nBackground\n\nGriffin was born in Oxford, Oxfordshire, England. He is the younger brother to Josh and Darrell Griffin.\n\nGriffin previously played rugby union while growing up in Oxford, before moving to rugby league alongside his brothers. He played as a junior for Stanley Rangers.[2]\n\nCareer\n\nHull Kingston Rovers\n\nGriffin signed for Hull Kingston Rovers on a two-year deal in September 2011.[6] He had been playing in Australia for the Queanbeyan Kangaroos, a feeder team to the Canberra Raiders, and was originally set to sign for Crusaders until they withdrew from Super League.[6]\n\nGriffin made his Super League debut for Hull KR against the Widnes Vikings on 29 July 2012.[7] He went on to make a total of 20 appearances throughout his 2 seasons at Hull KR.\n\nGateshead Thunder (dual registration)\n\nIn 2013, Griffin played for Gateshead Thunder in the Championship 1 through their dual registration agreement with Hull KR. He made 3 appearances and scored 2 tries for the Thunder.[citation needed]\n\nLondon Broncos\n\nIn January 2014, it was announced that Griffin had signed for the London Broncos.[8] He made 20 appearances and scored 1 try in the 2014 season.\n\nSalford Red Devils\n\nIn July 2014, shortly after London's relegation from Super League was mathematically confirmed, Griffin signed a one-year deal to join the Salford Red Devils for 2015.[9] He would be joining his older brothers Darrell and Josh who already played for the club.[10]\n\nGriffin played alongside both of his brothers for the first time at the 2015 Magic Weekend against the Widnes Vikings, just days after the death of their father.[11] He signed a two-year contract extension with Salford in June 2015.[12]\n\nIn May 2017, Griffin agreed a new two-year contract with Salford, keeping him at the club until the end of 2019.[13]\n\nHe played in the 2019 Super League Grand Final defeat to St. Helens at Old Trafford.[14][15][16]\n\nGriffin made 115 appearances and scored 20 tries during his time at Salford.\n\nWakefield Trinity Wildcats (loan)\n\nGriffin joined the Wakefield Trinity Wildcats on a one-month loan deal in March 2015, making 5 appearances.[17]\n\nCastleford Tigers\n\nIn July 2019, Griffin signed a two-year deal to join the Castleford Tigers (Heritage № 996) from 2020.[18] Head coach Daryl Powell described him as a \"tough hard-working player\" with a \"first-class work rate and attitude\".[19]\n\nGriffin was assigned squad number 16 for 2020.[20] He made his Castleford debut on 2 February against the Toronto Wolfpack.[21] He scored his first try for the club against Hull FC in the 6th round of the Challenge Cup.[22]\n\nIn May 2021, Griffin extended his contract with the Tigers for a further year.[23] On 17 July 2021, he played for Castleford in their 2021 Challenge Cup Final loss against St Helens.[24]\n\nReferences"}, {"url": "https://www.wikiwand.com/en/George_Griffin_(rugby_league)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about George Griffin (rugby league)?\n\nSummarize this article for a 10 years old"}, {"url": "https://alchetron.com/Geoff-Griffin", "page_content": "Geoffrey Merton \"Geoff\" Griffin (12 June 1939 – 16 November 2006) was a cricketer who played two Tests for South Africa in 1960. In his second Test appearance in 1960 at Lord's, he became the first (and, as of November 2014, only) South African cricketer to take a hat-trick in a Test match, and also the first and only cricketer to take a Test hat-trick at Lord's. He is best known for being no-balled for throwing in his second Test and the exhibition match that followed, and never having played Test cricket again.\n\nGriffin was born in Greytown in the former Natal Province and was educated at Durban High School. He was tall and blond, and excelled in many sports, playing hockey for Rhodesia and under-19s rugby for Natal. He was also Natal champion in the high jump, long jump, triple jump and pole vault.\n\nGriffin suffered an accident in childhood which rendered him unable to straighten his right arm. There was continuing controversy about bowlers \"throwing\" or \"chucking\" the ball (that is, flexing their elbow in the action of bowling the ball, which is contrary to the Laws of Cricket). The issue had been controversial since the editor of Wisden, Sydney Pardon, claimed that Australian fast bowler Ernest Jones was throwing in the tour of England in 1896, and then Jones and C. B. Fry were both no-balled in the Melbourne Test in 1897. The issue achieved renewed prominence following the Ashes series in Australia in 1958–59, when Australians Ian Meckiff and Gordon Rorke were suspected of throwing. Other fast bowlers, such as West Indies' Charlie Griffith and New Zealand's Gary Bartlett were also suspected. The MCC was determined to stamp out the problem before the Ashes series in England in 1961, and English umpires were instructed to strictly enforce the rule against throwing in 1960.\n\nGriffin made his first-class cricket debut for Natal in the 1957–58 South African domestic season, as a fast bowler. Despite being no-balled in South African provincial matches in the 1959–60 season, Griffin finished at the top of the averages, with 35 wickets at a bowling average of 12.23, and was selected to tour England in 1960, aged 20. Griffin was no-balled eight times during the tour match against the MCC at Lord's in May 1960, the first time that a touring player was called for throwing, and no-balled again several times by various umpires in matches against the counties. His tried to change his action at Alf Gover's indoor school, and was not called once in the 42 overs that he bowled in the 1st Test at Edgbaston, although his pace was much reduced. In the search for quicker deliveries, he fell back into his old faults, and was called in a tour match against Hampshire.\n\nEnglish umpires Frank Lee and Syd Buller repeatedly called Geoff Griffin for throwing in the 2nd Test, at Lord's, starting from his third over. After being no-balled five times on the first day and six times on the second day, he returned for a final bowling spell on Saturday 25 June and dismissed M. J. K. Smith with the last ball of one over, caught behind by John Waite for 99, and then bowled Peter Walker and Fred Trueman with the first two balls of his next over. This was the first Test cricket hat-trick claimed by a South African cricketer. England immediately declared their first innings for 362 with 8 wickets down.\n\nEngland quickly dismissed South Africa twice to win by an innings and 73 runs, just after lunch on the fourth day, Monday 27 June, with Brian Statham taking 6–62 and 5–34. A 20-over exhibition match was arranged to fill the period until the scheduled presentation of the players to the Queen at tea. Griffin was again repeatedly no-balled in the exhibition match for throwing, and was also no-balled for failing to notify the umpires that he was changing to bowl underarm to complete an over. Griffin later recounted that Donald Bradman came to the dressing room to console him, and let him know that the umpires were acting on order from MCC president Gubby Allen.\n\nGriffin remained on the tour as a batsman, but never played Test cricket again. Many spectators could see no difference between his \"legitimate\" deliveries, and the ones that were no-balled: many concluded that he threw every delivery. The public saw him as a martyr and scapegoat, and he was warmly applauded by the spectators at all of his subsequent tour matches. None of the controversial Australian bowlers from the 1958–59 Ashes series toured England in 1961.\n\nHe moved to play for Rhodesia, but his cricket career ended less than two years later, at the age of 23, after he was no-balled playing in a Currie Cup match against North Eastern Transvaal at Salisbury.\n\nIn retirement from cricket, he played club cricket, was a cricket coach, and worked as a hotel manager for South African Breweries in Durban, at the Argyll, and then at the Congela Hotel. He married twice.\n\nGriffin died of a heart attack in Durban."}, {"url": "https://www.bbc.com/sport/football/65843401", "page_content": "Alexis Mac Allister won the World Cup with Argentina in 2022\n\nEvery time referee Nestor Pitana saw Alexis Mac Allister running in his direction to complain about some decision, he would make the same joke to try to calm the Argentinos Juniors youngster down.\n\n\"You remind me of [Lionel] Messi,\" Pitana, who refereed the 2018 World Cup final, would say.\n\n\"Only for the beard and the haircut…\" Mac Allister would reply, laughing.\n\nMac Allister's talent may not be comparable with Messi's - whose is? - but his undoubted ability has been apparent since the early days, when he made his debut aged 17 in Argentina's second tier with Buenos Aires side Argentinos in October 2016.\n\nThe versatile midfielder helped secure promotion later that season, paving the way for a meteoric rise that saw him take his boyhood team to continental football and become the club's second biggest sale ever when Brighton came knocking with an £8m offer in early 2019.\n\nFame, however, didn't immediately arrive and, until not so long ago, he could still walk largely unnoticed back home.\n\nA quiet and down-to-earth man, Mac Allister said that this time last year, before the World Cup, when he travelled to his birth town of La Pampa only \"a couple of people\" approached him for a picture.\n\nHowever, when he returned after helping Argentina win the 2022 World Cup, 15,000 fans were waiting for him.\n\nThings have certainly changed for the 24-year-old and will continue to do so now he has signed for Liverpool in a £55m deal.\n\n'He was destined to reach the very top'\n\nFor those who have been there since the beginning, it feels like he is fulfilling his destiny with the move to Anfield.\n\n\"At the time [he joined Brighton], I told him - and he can confirm it - that I wouldn't ask him for a Brighton jersey or anything else,\" Argentinos general manager Alejandro Roncoroni told BBC Sport.\n\n\"The only thing that I wanted was for him to invite me for the day he made his debut for Real Madrid or a team of the same level. Because he was destined to reach the very top.\"\n\nFour years later, the boy who \"never hides on the pitch\" has reached football's elite and will now play a key role in Liverpool's rebuilding process.\n\nMac Allister joined Brighton from Argentinos Juniors on a four-and-a-half-year deal in January 2019\n\nBorn to be a footballer\n\nMac Allister, whose ancestors came from Ireland, was born to be a footballer.\n\nHis father, Carlos, lined up alongside Diego Maradona for Argentina, his uncle Patricio played for Estudiantes de La Plata and his brothers, Francis and Kevin, currently feature for Rosario Central and Argentinos respectively. They even have their own side back home, Deportivo Mac Allister.\n\nWhile still a youngster, the Reds' new midfield maestro even helped his dad with the scouting reports he prepared for Spanish side Osasuna.\n\nIt was no surprise when he joined Argentinos at the age of 12 and started marking waves right away for a team that is known as the 'world's nursery' and has produced the likes of Fernando Redondo, Juan Roman Riquelme, Esteban Cambiasso, Fabricio Coloccini and, of course, Maradona.\n\n\"I remember taking my kids to the club every Saturday and watching him play. He would always stand out,\" said general manager Roncoroni.\n\nMac Allister made his first senior appearance under former international defender Gabriel Heinze, who he regards as the coach who has brought the best out of him and taught him the game.\n\n'Get into the box, get into the box!'\n\nHaving played a prominent part as Brighton secured European football for the first time in their 122-year history, he finished the last campaign with 12 goals in 40 matches.\n\nIt was the most prolific season of his career so far - and his father Carlos would have been proud.\n\nDuring youth matches he would often yell from the stands for his son to \"get into the box\". Mac Allister hated it back then, but after hearing it so much he admits it has influenced his playing style.\n\nAble to play in different roles ranging from defensive midfielder to operating behind the forwards, as well as central midfield, he will provide a breath of fresh air for Liverpool's midfield.\n\n\"A technically gifted player like him can adapt to any position. He will always have the qualities of a number 10 (attacking midfielder), but with his intelligence and versatility he's able to adjust to any task he's asked to,\" explained Cristian Zermatten, one of his earliest mentors.\n\n\"No matter where he plays, he will do it [in the style of] a number 10 because at the end of the day that's how he feels football.\"\n\nIt will now be up to Reds boss Jurgen Klopp to take Mac Allister to another level - and Roncoroni has no doubt he is heading to the best club for that.\n\n\"After all, they have the same colours from where he was born,\" he said."}, {"url": "https://www.bbc.co.uk/sport/rugby-league/65754161?at_medium=RSS&at_campaign=KARANGA", "page_content": "Josh Griffin (left) scored a hat-trick to turn the game around in the second-half\n\nBetfred Super League Hull FC (6) 30 Tries: Houghton, Swift, Griffin 3, Hoy Goals: Clifford 3 Warrington (12) 18 Tries: Wrench 2, Williams Goals: Ratchford 3\n\nHull FC delivered an impressive second-half comeback to overcome Warrington Wolves in the final game of Magic Weekend at St James' Park.\n\nWarrington led at half-time, with Hull's Danny Houghton replying to tries from Connor Wrench and George Williams.\n\nThat lead was wiped out and overhauled when Adam Swift and Josh Griffin, with two, crossed for the hosts, but the Wire replied through Wrench's second.\n\nGriffin completed a hat-trick to pull Hull clear before Tex Hoy settled it.\n\nSince ending a run of seven straight defeats - against Wigan last month - Tony Smith's Hull FC have bounced back in fine style to win three of the past four.\n\nThey have rediscovered their forward punch with Brad Fash, Chris Satae and Ligi Sao giving Jake Trueman and Jake Clifford a platform to scheme.\n\nBy contrast, Daryl Powell's Warrington have somewhat hit the buffers, as their defeat by Leigh last time out was followed by another loss.\n\nIt took them some time to get into this one as Warrington showed their qualities early on with Wrench marking his return from a serious knee ligament injury with a wonderfully-constructed try out wide.\n\nWilliams pounced on an error in the backfield to add to their lead, but the Primrose and Blue failed to fully capitalise on their purple patch and Hull eventually found a way back.\n\nHoughton plunged in after Warrington failed to deal with a chip to the in-goal before half-time, and Hull took full control.\n\nGriffin barrelled in for his hat-trick as Hull punished Warrington's left-side defence with a brace of punchy short balls, one from a thrilling deep break by Hoy, and a perfectly-weighted kick.\n\nSwift finished off a perfect kick from Clifford in a narrow sliver of space, while Hoy's try was a delicious dance back against the grain providing a fine cap to the evening for the delirious Black and Whites supporters on the Leazes End.\n\nFor Warrington, Wrench's second try from a slick, slicing move to the right, merely gave false hope they could mount a response that never materialised.\n\nSome of their fans headed for the exits early as they ceded top spot on points difference to a Catalans side that thrashed Wigan on Saturday. Hull are in ninth place.\n\nHull boss Tony Smith:\n\n\"I thought we'd get better and improve and I think we are doing that, but there are no guarantees.\n\n\"We are certainly better than we were a number of weeks ago. You can see a whole lot more cohesion with us now and those efforts are getting more rewards when we are all on the same page.\n\n\"Sometimes defending your own line can take the petrol out of you for the rest of the game but it did quite the opposite.\n\n\"It energised us actually and we were all ready to go in the second half. I thought Josh turned back the clock with having to use his speed to score tries. It was terrific and I was pleased for him.\"\n\nWarrington boss Daryl Powell:\n\n\"The way we started the first half was class, but the start of the second half was non-existent really.\n\n\"We've lost a bit of confidence at the moment and we're working hard to get it back. We feel like when we fix up one part of our game another part is not quite there, and there's a bit to do defensively.\n\n\"We're on a straight line at the moment and we've just got to turn that line upwards.\n\n\"Teams have stepped right up against us and we're not playing as well as we were, we're conceding too many points and that has been reflected in the results. We know our game's there but we just need to rediscover it again as soon as possible.\"\n\nHull FC: Hoy; McIntosh, Scott, Sutcliffe, Swift; Trueman, Clifford; Fash, Houghton, Taylor, Griffin, Lane, Cator.\n\nInterchanges: Sao, Satae, Savelio, Lane.\n\nWarrington: Dufty; Wrench, Minikin, Ratchford, Ashton; Williams, Drinkwater; Dudson, Clark, Vaughan, Currie, Harrison, Mata'utia.\n\nInterchanges: Bullock, Philbin, Walker, Green.\n\nReferee: Jack Smith."}, {"url": "https://www.bbc.com/sport/football/65843401", "page_content": "Alexis Mac Allister won the World Cup with Argentina in 2022\n\nEvery time referee Nestor Pitana saw Alexis Mac Allister running in his direction to complain about some decision, he would make the same joke to try to calm the Argentinos Juniors youngster down.\n\n\"You remind me of [Lionel] Messi,\" Pitana, who refereed the 2018 World Cup final, would say.\n\n\"Only for the beard and the haircut…\" Mac Allister would reply, laughing.\n\nMac Allister's talent may not be comparable with Messi's - whose is? - but his undoubted ability has been apparent since the early days, when he made his debut aged 17 in Argentina's second tier with Buenos Aires side Argentinos in October 2016.\n\nThe versatile midfielder helped secure promotion later that season, paving the way for a meteoric rise that saw him take his boyhood team to continental football and become the club's second biggest sale ever when Brighton came knocking with an £8m offer in early 2019.\n\nFame, however, didn't immediately arrive and, until not so long ago, he could still walk largely unnoticed back home.\n\nA quiet and down-to-earth man, Mac Allister said that this time last year, before the World Cup, when he travelled to his birth town of La Pampa only \"a couple of people\" approached him for a picture.\n\nHowever, when he returned after helping Argentina win the 2022 World Cup, 15,000 fans were waiting for him.\n\nThings have certainly changed for the 24-year-old and will continue to do so now he has signed for Liverpool in a £55m deal.\n\n'He was destined to reach the very top'\n\nFor those who have been there since the beginning, it feels like he is fulfilling his destiny with the move to Anfield.\n\n\"At the time [he joined Brighton], I told him - and he can confirm it - that I wouldn't ask him for a Brighton jersey or anything else,\" Argentinos general manager Alejandro Roncoroni told BBC Sport.\n\n\"The only thing that I wanted was for him to invite me for the day he made his debut for Real Madrid or a team of the same level. Because he was destined to reach the very top.\"\n\nFour years later, the boy who \"never hides on the pitch\" has reached football's elite and will now play a key role in Liverpool's rebuilding process.\n\nMac Allister joined Brighton from Argentinos Juniors on a four-and-a-half-year deal in January 2019\n\nBorn to be a footballer\n\nMac Allister, whose ancestors came from Ireland, was born to be a footballer.\n\nHis father, Carlos, lined up alongside Diego Maradona for Argentina, his uncle Patricio played for Estudiantes de La Plata and his brothers, Francis and Kevin, currently feature for Rosario Central and Argentinos respectively. They even have their own side back home, Deportivo Mac Allister.\n\nWhile still a youngster, the Reds' new midfield maestro even helped his dad with the scouting reports he prepared for Spanish side Osasuna.\n\nIt was no surprise when he joined Argentinos at the age of 12 and started marking waves right away for a team that is known as the 'world's nursery' and has produced the likes of Fernando Redondo, Juan Roman Riquelme, Esteban Cambiasso, Fabricio Coloccini and, of course, Maradona.\n\n\"I remember taking my kids to the club every Saturday and watching him play. He would always stand out,\" said general manager Roncoroni.\n\nMac Allister made his first senior appearance under former international defender Gabriel Heinze, who he regards as the coach who has brought the best out of him and taught him the game.\n\n'Get into the box, get into the box!'\n\nHaving played a prominent part as Brighton secured European football for the first time in their 122-year history, he finished the last campaign with 12 goals in 40 matches.\n\nIt was the most prolific season of his career so far - and his father Carlos would have been proud.\n\nDuring youth matches he would often yell from the stands for his son to \"get into the box\". Mac Allister hated it back then, but after hearing it so much he admits it has influenced his playing style.\n\nAble to play in different roles ranging from defensive midfielder to operating behind the forwards, as well as central midfield, he will provide a breath of fresh air for Liverpool's midfield.\n\n\"A technically gifted player like him can adapt to any position. He will always have the qualities of a number 10 (attacking midfielder), but with his intelligence and versatility he's able to adjust to any task he's asked to,\" explained Cristian Zermatten, one of his earliest mentors.\n\n\"No matter where he plays, he will do it [in the style of] a number 10 because at the end of the day that's how he feels football.\"\n\nIt will now be up to Reds boss Jurgen Klopp to take Mac Allister to another level - and Roncoroni has no doubt he is heading to the best club for that.\n\n\"After all, they have the same colours from where he was born,\" he said."}, {"url": "https://www.bbc.co.uk/sport/rugby-league/65754161?at_medium=RSS&at_campaign=KARANGA", "page_content": "Josh Griffin (left) scored a hat-trick to turn the game around in the second-half\n\nBetfred Super League Hull FC (6) 30 Tries: Houghton, Swift, Griffin 3, Hoy Goals: Clifford 3 Warrington (12) 18 Tries: Wrench 2, Williams Goals: Ratchford 3\n\nHull FC delivered an impressive second-half comeback to overcome Warrington Wolves in the final game of Magic Weekend at St James' Park.\n\nWarrington led at half-time, with Hull's Danny Houghton replying to tries from Connor Wrench and George Williams.\n\nThat lead was wiped out and overhauled when Adam Swift and Josh Griffin, with two, crossed for the hosts, but the Wire replied through Wrench's second.\n\nGriffin completed a hat-trick to pull Hull clear before Tex Hoy settled it.\n\nSince ending a run of seven straight defeats - against Wigan last month - Tony Smith's Hull FC have bounced back in fine style to win three of the past four.\n\nThey have rediscovered their forward punch with Brad Fash, Chris Satae and Ligi Sao giving Jake Trueman and Jake Clifford a platform to scheme.\n\nBy contrast, Daryl Powell's Warrington have somewhat hit the buffers, as their defeat by Leigh last time out was followed by another loss.\n\nIt took them some time to get into this one as Warrington showed their qualities early on with Wrench marking his return from a serious knee ligament injury with a wonderfully-constructed try out wide.\n\nWilliams pounced on an error in the backfield to add to their lead, but the Primrose and Blue failed to fully capitalise on their purple patch and Hull eventually found a way back.\n\nHoughton plunged in after Warrington failed to deal with a chip to the in-goal before half-time, and Hull took full control.\n\nGriffin barrelled in for his hat-trick as Hull punished Warrington's left-side defence with a brace of punchy short balls, one from a thrilling deep break by Hoy, and a perfectly-weighted kick.\n\nSwift finished off a perfect kick from Clifford in a narrow sliver of space, while Hoy's try was a delicious dance back against the grain providing a fine cap to the evening for the delirious Black and Whites supporters on the Leazes End.\n\nFor Warrington, Wrench's second try from a slick, slicing move to the right, merely gave false hope they could mount a response that never materialised.\n\nSome of their fans headed for the exits early as they ceded top spot on points difference to a Catalans side that thrashed Wigan on Saturday. Hull are in ninth place.\n\nHull boss Tony Smith:\n\n\"I thought we'd get better and improve and I think we are doing that, but there are no guarantees.\n\n\"We are certainly better than we were a number of weeks ago. You can see a whole lot more cohesion with us now and those efforts are getting more rewards when we are all on the same page.\n\n\"Sometimes defending your own line can take the petrol out of you for the rest of the game but it did quite the opposite.\n\n\"It energised us actually and we were all ready to go in the second half. I thought Josh turned back the clock with having to use his speed to score tries. It was terrific and I was pleased for him.\"\n\nWarrington boss Daryl Powell:\n\n\"The way we started the first half was class, but the start of the second half was non-existent really.\n\n\"We've lost a bit of confidence at the moment and we're working hard to get it back. We feel like when we fix up one part of our game another part is not quite there, and there's a bit to do defensively.\n\n\"We're on a straight line at the moment and we've just got to turn that line upwards.\n\n\"Teams have stepped right up against us and we're not playing as well as we were, we're conceding too many points and that has been reflected in the results. We know our game's there but we just need to rediscover it again as soon as possible.\"\n\nHull FC: Hoy; McIntosh, Scott, Sutcliffe, Swift; Trueman, Clifford; Fash, Houghton, Taylor, Griffin, Lane, Cator.\n\nInterchanges: Sao, Satae, Savelio, Lane.\n\nWarrington: Dufty; Wrench, Minikin, Ratchford, Ashton; Williams, Drinkwater; Dudson, Clark, Vaughan, Currie, Harrison, Mata'utia.\n\nInterchanges: Bullock, Philbin, Walker, Green.\n\nReferee: Jack Smith."}, {"url": "https://www.bbc.com/sport/football/65843401", "page_content": "Alexis Mac Allister won the World Cup with Argentina in 2022\n\nEvery time referee Nestor Pitana saw Alexis Mac Allister running in his direction to complain about some decision, he would make the same joke to try to calm the Argentinos Juniors youngster down.\n\n\"You remind me of [Lionel] Messi,\" Pitana, who refereed the 2018 World Cup final, would say.\n\n\"Only for the beard and the haircut…\" Mac Allister would reply, laughing.\n\nMac Allister's talent may not be comparable with Messi's - whose is? - but his undoubted ability has been apparent since the early days, when he made his debut aged 17 in Argentina's second tier with Buenos Aires side Argentinos in October 2016.\n\nThe versatile midfielder helped secure promotion later that season, paving the way for a meteoric rise that saw him take his boyhood team to continental football and become the club's second biggest sale ever when Brighton came knocking with an £8m offer in early 2019.\n\nFame, however, didn't immediately arrive and, until not so long ago, he could still walk largely unnoticed back home.\n\nA quiet and down-to-earth man, Mac Allister said that this time last year, before the World Cup, when he travelled to his birth town of La Pampa only \"a couple of people\" approached him for a picture.\n\nHowever, when he returned after helping Argentina win the 2022 World Cup, 15,000 fans were waiting for him.\n\nThings have certainly changed for the 24-year-old and will continue to do so now he has signed for Liverpool in a £55m deal.\n\n'He was destined to reach the very top'\n\nFor those who have been there since the beginning, it feels like he is fulfilling his destiny with the move to Anfield.\n\n\"At the time [he joined Brighton], I told him - and he can confirm it - that I wouldn't ask him for a Brighton jersey or anything else,\" Argentinos general manager Alejandro Roncoroni told BBC Sport.\n\n\"The only thing that I wanted was for him to invite me for the day he made his debut for Real Madrid or a team of the same level. Because he was destined to reach the very top.\"\n\nFour years later, the boy who \"never hides on the pitch\" has reached football's elite and will now play a key role in Liverpool's rebuilding process.\n\nMac Allister joined Brighton from Argentinos Juniors on a four-and-a-half-year deal in January 2019\n\nBorn to be a footballer\n\nMac Allister, whose ancestors came from Ireland, was born to be a footballer.\n\nHis father, Carlos, lined up alongside Diego Maradona for Argentina, his uncle Patricio played for Estudiantes de La Plata and his brothers, Francis and Kevin, currently feature for Rosario Central and Argentinos respectively. They even have their own side back home, Deportivo Mac Allister.\n\nWhile still a youngster, the Reds' new midfield maestro even helped his dad with the scouting reports he prepared for Spanish side Osasuna.\n\nIt was no surprise when he joined Argentinos at the age of 12 and started marking waves right away for a team that is known as the 'world's nursery' and has produced the likes of Fernando Redondo, Juan Roman Riquelme, Esteban Cambiasso, Fabricio Coloccini and, of course, Maradona.\n\n\"I remember taking my kids to the club every Saturday and watching him play. He would always stand out,\" said general manager Roncoroni.\n\nMac Allister made his first senior appearance under former international defender Gabriel Heinze, who he regards as the coach who has brought the best out of him and taught him the game.\n\n'Get into the box, get into the box!'\n\nHaving played a prominent part as Brighton secured European football for the first time in their 122-year history, he finished the last campaign with 12 goals in 40 matches.\n\nIt was the most prolific season of his career so far - and his father Carlos would have been proud.\n\nDuring youth matches he would often yell from the stands for his son to \"get into the box\". Mac Allister hated it back then, but after hearing it so much he admits it has influenced his playing style.\n\nAble to play in different roles ranging from defensive midfielder to operating behind the forwards, as well as central midfield, he will provide a breath of fresh air for Liverpool's midfield.\n\n\"A technically gifted player like him can adapt to any position. He will always have the qualities of a number 10 (attacking midfielder), but with his intelligence and versatility he's able to adjust to any task he's asked to,\" explained Cristian Zermatten, one of his earliest mentors.\n\n\"No matter where he plays, he will do it [in the style of] a number 10 because at the end of the day that's how he feels football.\"\n\nIt will now be up to Reds boss Jurgen Klopp to take Mac Allister to another level - and Roncoroni has no doubt he is heading to the best club for that.\n\n\"After all, they have the same colours from where he was born,\" he said."}]}