{"Frankie Lymon was a rock and roll/rhythm and blues singer and songwriter.": [{"url": "https://wbssmedia.com/artists/detail/2390", "page_content": "Frankie Lymon\n\nFranklin Joseph Lymon (September 30, 1942 – February 27, 1968), known professionally as Frankie Lymon, was an American rock and roll/rhythm and blues singer and songwriter, best known as the boy soprano lead singer of the New York City-based early rock and roll group The Teenagers. The group was composed of five boys, all in their early to mid-teens. The original lineup of the Teenagers, an integrated group, included three African-American members, Frankie Lymon, Jimmy Merchant, and Sherman Garnes; and two Puerto Rican members, Joe Negroni and Herman Santiago. The Teenagers' first single, 1956's \"Why Do Fools Fall in Love,\" was also its biggest hit. After Lymon went solo in mid-1957, both his career and that of the Teenagers fell into decline. He was found dead at the age of 25 on the floor of his grandmother's bathroom from a heroin overdose. His life was dramatized in the 1998 film Why Do Fools Fall In Love.\n\nBiography\n\n1942–56: Early life/Joining the Teenagers\n\nLymon was born in Harlem, New York on September 30, 1942 to Jeanette and Howard Lymon. Howard was a truck driver and Jeanette was a maid. Both also sang in the gospel group The Harlemaires; Frankie and his brothers Lewis and Howie sang with the Harlemaire Juniors (a fourth brother, Timmy, was a singer, though not with the Harlemaire Juniors). The Lymons struggled to make ends meet, so Lymon began working as a grocery boy at age 10. At 12 in 1954, Lymon heard a local doo-wop group known as the Coupe De Villes at a school talent show. He became friends with the lead singer, Herman Santiago, and he eventually became a member of the group, now calling itself both The Ermines and The Premiers. Dennis Jackson of Columbus, Georgia, was one of the main influences in Lymon's life. His personal donation of $500 helped start Lymon's career.\n\nOne day in 1955, a neighbor gave The Premiers several love letters that had been written to him by his girlfriend, hoping to give the boys inspiration to write their own songs. Merchant and Santiago adapted one of the letters into a song called \"Why Do Fools Fall in Love\". The Premiers, now calling themselves The Teenagers, got their first shot at fame after impressing Richard Barrett, a singer with The Valentines. Barrett, in turn, got the group an audition with record producer George Goldner. On the day of the group's audition, original lead singer Santiago was late. Lymon stepped up and told Goldner that he knew the part because he helped write the song. The disc jockeys always called them \"Frankie Lymon and the Teenagers\".\n\n1956: \"Why Do Fools Fall in Love\" success\n\nGoldner signed the group to Gee Records, and \"Why Do Fools Fall in Love\" became its first single in January 1956. The single peaked at No. 6 on the Billboard pop singles chart, and topped the Billboard R&B singles chart for five weeks. Six other top blues 10 singles followed over the next year or so: \"I Want You to Be My Girl\", \"I Promise to Remember\", \"Who Can Explain?\", \"Out in the Cold Again\", \"The ABC's of Love\", \"I'm Not a Juvenile Delinquent\", and \"Baby Baby\" were also popular Teenagers releases. \"I Want You To Be My Girl\" gave the band its second pop hit, reaching No. 13 on the national Billboard Hot 100 chart. \"Goody Goody\" (written by Matty Malneck and Johnny Mercer and originally performed by Benny Goodman) was a No. 20 pop hit but did not appear on the R&B chart. The Teenagers placed two other singles in the lower half of the pop chart. With the release of \"I Want You To Be My Girl\", the group's second single, The Teenagers became Frankie Lymon & the Teenagers. An album, \"The Teenagers Featuring Frankie Lymon\", was released in December 1956.\n\n1957–65: Solo career\n\nIn early 1957, Lymon and the Teenagers broke up while on a tour in Europe. During an engagement at the London Palladium, Goldner began pushing Lymon as a solo act, giving him solo spots in the show. Lymon began performing with backing from pre-recorded tapes. The group's last single, \"Goody Goody\" backed with \"Creation of Love,\" initially retained the \"Frankie Lymon & the Teenagers\" credit, but they were actually solo recordings (with backing by session singers). Lymon had officially departed from the group by September 1957; an in-progress studio album called Frankie Lymon and the Teenagers at the London Palladium was instead issued as a Lymon solo release.\n\nAs a solo artist, Lymon was not nearly as successful as he had been with the Teenagers. Beginning with his second solo release, \"My Girl\", Lymon had moved to Roulette Records. On a July 19, 1957 episode of Alan Freed's live ABC TV show The Big Beat, Lymon began dancing with a white teenage girl while he was performing. His actions caused a scandal, particularly among Southern TV station owners, and The Big Beat was subsequently canceled. There is no surviving footage because the episode was taped over, according to Judith Fisher Freed.\n\nLymon's slowly declining sales fell sharply in the early 1960s. Within the span of one year, as a result of heroin use, and the deepening of his voice to a baritone as a result of going through puberty. His highest-charting solo hit was a cover of Bobby Day's \"Little Bitty Pretty One\", which peaked at No. 58 on the Hot 100 pop chart in 1960 and which had been recorded in 1957. Addicted to heroin since the age of 15, Lymon fell further into his habit, and his performing career went into decline. According to Lymon in an interview with Ebonymagazine in 1967, he was first introduced to heroin when he was 15 by a woman twice his age. In 1961, Roulette, now run by Morris Levy, ended their contract with Lymon and he entered a drug rehabilitation program. After losing Lymon, the Teenagers went through a string of replacement singers, the first of whom was Billy Lobrano. In 1960, Howard Kenny Bobo sang lead on \"Tonight's the Night\" with the Teenagers; later that year, Johnny Houston sang lead on two songs. The Teenagers, who had been moved by Morris Levy to End Records, were released from their contract in 1961. The Teenagers briefly reunited with Lymon in 1965, without success.\n\n1966–68: Later years\n\nOver the next four years, Lymon struggled through short-lived deals with 20th Century Fox Records and Columbia Records. He began a relationship with Elizabeth Mickey Waters, who became his first wife in January 1964 and gave birth to his only child, Francine, who died two days after birth at Lenox Hill Hospital.Lymon's marriage to Waters was not legal because she was still married to her first husband. After the marriage failed, he moved to Los Angeles in the mid-1960s, where he began a romantic relationship with Zola Taylor, a member of the Platters. Taylor claimed to have married Lymon in Mexico in 1965 although their relationship ended several months later, purportedly because of Lymon's drug habits. Lymon, however, had been known to say that their marriage was a publicity stunt, and Taylor could produce no legal documentation of their marriage. In Major Robinson's gossip column of June 6, 1966, Zola said the whole thing was a joke that she went along with at the time (October 1965).\n\nHe appeared at the Apollo as part of a revue, adding an extended tap dance number. Lymon recorded several live performances (such as \"Melinda\" in 1959), but none rose on the charts. His final television performance was on Hollywood A Go-Go in 1965, where the then-22- or 23-year-old singer lip-synched to the recording of his 13-year-old self singing \"Why Do Fools Fall in Love.\" On June 21, 1966, he was arrested on a heroin charge and was drafted into the United States Army in the lieu of a jail sentence. He reported to Fort Gordon, Georgia, near Augusta, Georgia, for training. While in the Augusta area, Lymon met and fell in love with Emira Eagle, a schoolteacher at Hornsby Elementary in Augusta. The two were wed in June 1967, and Lymon repeatedly went AWOL to secure gigs at small Southern clubs. Dishonorably discharged from the Army, Lymon moved into his wife's home and continued to perform sporadically. Traveling to New York in 1968, Lymon was signed by manager Sam Bray to his Big Apple label, and the singer returned to recording. Roulette Records expressed interest in releasing Lymon's records in conjunction with Big Apple and scheduled a recording session for February 28. A major promotion had been arranged with CHO Associates, owned by radio personalities Frankie Crocker, Herb Hamlett and Eddie O'Jay. Lymon, staying at his grandmother's house in Harlem where he had grown up, celebrated his good fortune by taking heroin; he had remained clean ever since entering the Army three years earlier.\n\nDeath\n\nOn February 27, 1968, Lymon was found dead of a heroin overdose at the age of 25 on the floor of his grandmother's bathroom. Lymon, a Baptist, was buried at Catholic Saint Raymond's Cemetery in the Throggs Neck section of The Bronx, New York City, New York. \"I'm Sorry\" and \"Seabreeze\", the two songs Lymon had recorded for Big Apple before his death, were released later in 1968.\n\nPosthumous troubles\n\nLymon's troubles extended to others after his death. After R&B singer Diana Ross returned \"Why Do Fools Fall in Love\" to the Top Ten in 1981, a major controversy concerning Lymon's estate ensued. Zola Taylor, Elizabeth Waters and Emira Eagle each approached Morris Levy, the music impresario who retained possession of Lymon's copyrights and his royalties, claiming to be Lymon's rightful widow; Lymon had neglected to divorce any of them. The complex issue resulted in lawsuits and counter-lawsuits, and in 1986 the first of several court cases concerning the ownership of Lymon's estate began.\n\nTrying to determine who was indeed the lawful Mrs. Frankie Lymon was complicated by more issues. Waters was already married when she married Lymon; she had separated from her first husband, but their divorce was finalized in 1965, after she had married Lymon. Taylor claimed to have married Lymon in Mexico in 1965, but could produce no acceptable evidence of their union. Lymon's marriage to Eagle, on the other hand, was properly documented as having taken place at Beulah Grove Baptist Church in Augusta, Georgia, in 1967; however, the singer was still apparently twice-married and never divorced when he married Eagle. The first decision was made in Waters' favor; Eagle appealed, and in 1989, the Appellate Division of the New York State Supreme Court reversed the original decision and awarded Lymon's estate to Eagle.\n\nHowever, the details of the case brought about another issue: whether Morris Levy was deserving of the songwriting co-credit on \"Why Do Fools Fall in Love\". Although early single releases of \"Why Do Fools Fall in Love\" credit Frankie Lymon, Herman Santiago and Jimmy Merchant as co-writers, later releases and cover versions were attributed to Lymon and George Goldner. When Goldner sold his music companies to Morris Levy in 1959, Levy's name began appearing as co-writer of \"Why Do Fools Fall in Love\" in place of Goldner's. Lymon was never paid his songwriting royalties during his lifetime; one result of Emira Eagle's legal victory was that Lymon's estate would finally begin receiving monetary compensation from his hit song's success. In 1987, Herman Santiago and Jimmy Merchant, both by then poor, sued Morris Levy for their songwriting credits. In December 1992, the United States federal courts ruled that Santiago and Merchant were co-authors of \"Why Do Fools Fall in Love\". However, in 1996 the ruling was reversed by the Court of Appeals for the 2nd Circuit on the basis of the statute of limitations: copyright cases must be brought before a court within three years of the alleged civil violation, and Merchant and Santiago's lawsuit was not filed until 30 years later. Authorship of \"Why Do Fools Fall in Love\" currently remains in the names of Frankie Lymon and Morris Levy.\n\nLegacy\n\nAlthough their period of success was brief, Frankie Lymon & the Teenagers' string of hits were highly influential on the rock and R&B performers who followed them. Lymon's high-voiced sound is said to be a direct predecessor of the girl group sound, and the list of performers who name him as an influence include Michael Jackson, Ronnie Spector, Diana Ross, The Chantels, The Temptations, George Clinton, Smokey Robinson, Len Barry and The Beach Boys, among others. The performers most inspired by and derivative of Lymon and the Teenagers' style are The Jackson 5 and their lead singer and future superstar Michael Jackson. Motown founder Berry Gordy based much of the Jackson 5's sound on Frankie Lymon & the Teenagers' recordings, and the Teenagers are believed to be the original model for many of the other Motown groups he cultivated.\n\nLymon's music and story were re-introduced to modern audiences with Why Do Fools Fall in Love, a 1998 biographical film directed by Gregory Nava, also the director of the Selena biopic. Why Do Fools Fall in Love tells a comedic, fictionalized version of Lymon's story from the points of view of his three wives as they battle in court for the rights to his estate. The film stars Larenz Tate as Frankie Lymon, Halle Berry as Zola Taylor, Vivica A. Fox as Elizabeth Waters and Lela Rochon as Elmira Eagle. Why Do Fools Fall in Love was not a commercial success and met with mixed reviews; the film grossed a total of $12,461,773 during its original theatrical run.\n\nIn 1973, Lymon became known to a slightly younger generation than before with the release of American Graffiti, which included \"Why Do Fools Fall in Love\" on its soundtrack. In September 1979 at the Santa Barbara Bowl, Joni Mitchell performed a version of \"Why Do Fools Fall In Love\" which subsequently appeared on the release of her album of the concert entitled \"Shadows and Light\" the following September. During the opening mix of the album, Joni Mitchell also spliced sections of \"I'm Not A Juvenile Delinquent\" into the title track refrains. The Fall reference him in \"No X-mas for John Quays\" on their March 1979 album \"Live at the Witch Trials\" The song \"Harlem Roulette\" by The Mountain Goats, off its 2012 album Transcendental Youth,, contains reference to Frankie Lymon, the song \"Seabreeze\" and Roulette Records. Frontman John Darnielle has stated that the song is about the last night of Lymon's life.\n\nFrankie Lymon and the Teenagers were inducted into the Rock and Roll Hall of Fame in 1993, and into the Vocal Group Hall of Fame in 2000. Lymon was mentioned in the 1992 Stephen King short story \"You Know They Got a Hell of a Band\". Lymon is named as the one who cut off the waitress Sissy's finger for trying to help the protagonists, Mary and Clark Willingham, escape from the town of Rock & Roll Heaven, Oregon, who is inhabited by musicians like Janis Joplin, Otis Redding, Roy Orbison, and other musicians who died young. The English Band Everything but the Girl on their 1991 Album \"Worldwide\" include the song Boxing and Pop Music which references Lymon throughout the song.\n\nDiscography\n\nFrankie Lymon & the Teenagers discography\n\nSingles\n\nGee releases\n\n1956-01: [Gee 1002] \"Why Do Fools Fall in Love\" / \"Please Be Mine\" 1 (#1 on the R&B chart for 5 weeks)\n\n(#1 on the R&B chart for 5 weeks) 1956-04: [Gee 1012] \"I Want You to Be My Girl\" / \"I'm Not a Know-It-All\" 2 (#3 on R&B chart)\n\n(#3 on R&B chart) 1956-07: [Gee 1018] \"I Promise to Remember\" / \"Who Can Explain?\" (double-sided hit on R&B chart (#10 and #7))\n\n1956-09: [Gee 1022] \"The ABC's of Love\" / \"Share\" (#8 on R&B chart)\n\n1956-11: [Gee 1026] \"I'm Not a Juvenile Delinquent\" / \"Baby, Baby\"\n\n1957-04: [Gee 1032] \"Teenage Love\" / \"Paper Castles\"\n\n1957-05: [Gee 1035] \"Love Is a Clown / Am I Fooling Myself Again\"\n\n1957-06: [Gee 1036] \"Out in the Cold Again\" / \"Miracle in the Rain\" 5 (#10 on R&B chart)\n\n(#10 on R&B chart) 1957-07: [Gee 1039] \"Goody Goody\" / \"Creation of Love\" 3\n\n1957-12: [Gee 1046] \"Everything to Me\" / \"Flip Flop\" 4\n\nNotes\n\n1 Released as by \"The Teenagers\"\n\nReleased as by \"The Teenagers\" ⊃2; Early copies released as by \"The Teenagers featuring Frankie Lymon\"; billing on later pressings changed to \"Frankie Lymon & the Teenagers\"\n\n⊃3; Both sides of this release are actually Frankie Lymon solo recordings.\n\n4 billed as \"The Teenagers\" (lead vocal by Billie Lobrano)\n\nbilled as \"The Teenagers\" (lead vocal by Billie Lobrano) 5 Released as by \"The Teenagers featuring Frankie Lymon\"\n\nAlbum\n\n1956: [Gee 701] The Teenagers Featuring Frankie Lymon\n\nCompilations\n\n1986: Frankie Lymon and the Teenagers: For Collectors Only (Murray Hill 148)\n\nFrankie Lymon solo discography\n\nSingles\n\nRoulette releases\n\n1957: [Roulette 4026] \"My Girl\" / \"So Goes My Love\"\n\n1957: [Roulette 4035] \"Little Girl\" / \"It's Christmas Once Again\"\n\n1958: [Roulette 4044] \"Thumb Thumb\" / \"Footsteps\"\n\n1958: [Roulette 4068] \"Portable on My Shoulder\" / \"Mama Don't Allow It\" — 4/58\n\n1958: [Roulette 4093] \"Only Way to Love\" / \"Melinda\"\n\n1959: [Roulette 4128] \"Up Jumped a Rabbit\" / \"No Matter What You've Done\"\n\n1969: [Roulette 21095 \"\"/ \"1-20-12 Forever'\n\nGee release\n\n1959: [Gee 1052] \"Goody Good Girl\" / \"I'm Not Too Young to Dream\"\n\nRoulette releases\n\n1960: [Roulette 4257] \"Little Bitty Pretty One\" / \"Creation of Love\"\n\n1960: [Roulette 4283] \"Buzz Buzz Buzz\" / \"Waitin' in School\"\n\n1961: [Roulette 4310] \"Jailhouse Rock\" / \"Silhouettes\"\n\n1961: [Roulette 4348] \"Change Partners\" / \"So Young (And So in Love)\"\n\n1961: [Roulette 4391] \"Young\" / \"I Put the Bomp\" (featuring backing vocals by two members of The Delicates (Denise Ferri and Peggy Santiglia))\n\nLater releases\n\n1964: \"To Each His Own\" / \"Teacher, Teacher\" (20th Century Fox)\n\n1964: \"Somewhere\" / \"Sweet and Lovely\" (Columbia)\n\n1969: \"I'm Sorry\" / \"Seabreeze\" (Big Apple\n\nAlbums"}, {"url": "https://walkoffame.com/frankie-lymon/", "page_content": "Frankie Lymon\n\nFranklin Joseph “Frankie” Lymon was an American rock and roll/rhythm and blues singer and songwriter, best known as the boy soprano lead singer of a New York City-based early rock and roll group, The Teenagers. The group was composed of five boys, all in their early to mid teens. The original lineup of the Teenagers, an integrated group, included three African American members, Frankie Lymon, Jimmy Merchant and Sherman Garnes, and two Puerto Rican members, Herman Santiago and Joe Negroni.\n\nThe Teenagers’ first single, 1956’s “Why Do Fools Fall in Love”, was also their biggest hit. After Lymon went solo in mid-1957, both his career and those of the Teenagers fell into decline. By age 25, he was found dead in his grandmother’s bathroom from a heroin overdose. His life inspired the 1998 film, Why Do Fools Fall In Love?.\n\nFrankie Lymon was born in Harlem to a truck driver father and a mother who worked as a maid. Lymon’s father, Howard Lymon, also sang in a gospel group known as the Harlemaires; Frankie Lymon and his brothers Lewis and Howie sang with the Harlemaire Juniors. The Lymon family struggled to make ends meet, and Lymon began working as a grocery boy at age ten, augmenting his legitimate income with proceeds gained from hustling prostitutes and was known for having relationships with women twice his age.\n\nAt the age of 12, Lymon heard a local doo-wop group known as the Coupe De Villes at a school talent show. He befriended their lead singer, Herman Santiago, and he eventually became a member of the group, now calling itself both The Ermines and The Premiers. Dennis Jackson of Columbus, Georgia was one of the main influences of Lymon’s life. His personal donation of $500 helped start Frankie’s career."}, {"url": "https://metrobiography.com/frankie-lymon/", "page_content": "Frankie Lymon is a famous American rock and roll/rhythm and blues singer and songwriter. Just at the age of 20, he was already a superstar. Whereas his untimely death was a very bad thing for the music and overall entertainment industry.\n\nFrankie Lymon was a very young and talented kid at the time when he started his professional career as a singer and songwriter. He is mostly known and famous as the boy soprano lead singer of the New York City-based rock and roll doo-wop group The Teenagers.\n\nThey were among the most famous and renowned American teenage musical groups in the country. Within a very short period of time, he managed to earn himself a name and fame all through his hard work and dedication.\n\nFrankie Lymon’s Personal Life\n\nFrankie Lymon was born on September 30, 1942, in Harlem, New York, United States of America. As of 2022, he would be 80 years old but he didn’t survive till the age of 80. Meanwhile, his untimely death was a big shock to all his fans and followers all over the country.\n\nHis real or birth name is Franklin Joseph Lymon whereas he is famous by his stage name Franklin Lymon. According to his birthdate, Libra is his zodiac sign. He was born and raised in New York and holds an American nationality. He belongs to a black ethnic group.\n\nSee also The Natural Solution to Erectile Dysfunction\n\nFrankie Lymon’s Career\n\nFrankie Lymon’s started his professional career as a singer and songwriter at a very young and early age. His early days weren’t as beautiful as his teenage days. His father was a driver whereas his mother was a maid yet he worked really hard at a very young age and earned himself a name and respect.\n\nBack in 1954 at the age of 12 was when Frankie officially started his professional musical journey. Lymon heard a local doo-wop group known as the Coupe De Villes at a school talent show.\n\nHe became friends with the lead singer, Herman Santiago, and joined as a member of the group.\n\nBack in 1956, they signed with musical labels named Gee Records and soon became a part of the bigger musical part. They even did a tour at a very young age.\n\nUnfortunately back in 1957 the group broke up and moved their own ways. Since then Lymon started his career as a solo performer and pulled a lot of audiences towards his performances.\n\nIn a time period of 14 years, Lymon was already a famous and renowned name in the musical industry.\n\nFrankie Lymon’s Net Worth\n\nFrankie’s net worth at the time of his death was around 9 million dollars. He was already a millionaire back in the 1950s while he was just a teenager.\n\nAs of 2022, he would be one of the greatest singers in the music industry. However, his untimely death affects his musical career.\n\nFrankie Lymon’s huge net worth includes his salary from his musical band as well as another salary from several tours. He even published his own songs which did earn him a lot of money.\n\nFrankie Lymon’s Social Media Handle\n\nFrankie Lymon’s isn’t active and available on any kind of social media handle. At the time of his birth and death, there weren’t any social media platforms available. Whereas some of his songs and music are appearing on YouTube and different platforms.\n\nFrankie Lymon’s Love Life and Relationship\n\nFrankie Lymon was married to Emira Eagle. They both got married back in 1967 and within a year Frankie was dead. They both spent most of their time before and after marriage in Augusta, Georgia, United States of America. However, there isn’t any news regarding their first meeting and date.\n\nFrenkie and Emira Eagle do not have any children together. However, Frankie did have a child named Francine Lymon as he didn’t reveal much of his children nor about his mother. He kept his personal life very secretive and private despite being a celebrity.\n\nThere isn’t any news regarding Frankie’s past love life or his marriages.\n\nWho did Frankie Lymon have a child with? Frankie didn’t reveal or talk about his child’s mother as he kept it private and secret from all his fans and followers. He did have a child named Francine Lymon. He died in Lenox Hill Hospital, New York, United States of America.\n\nFrankie Lymon’s Death\n\nFrankie Lymon’s died just at the age of 25. He died on February 27, 1968, in Harlem, New York, United States of America. As of 2022, he would be just 80 years old. Whereas reason behind his death is said to be an overdose of drugs.\n\nHe died on the floor of his grandmother’s bathroom with a syringe by his side. He was buried in Saint Raymond’s Cemetery in the Throggs Neck section of The Bronx, New York City, New York."}, {"url": "https://www.dicytrends.com/frankie-lymon-what-happened-to-the-singer-songwriter/", "page_content": "The name Frankie Lymon might ring a bell in your mind. Frankie Lymon was considered one of the first African-American teenage pop stars and the favorite of several people. He is also known as Franklin Joseph Lymon or Frankie Lyman. He was an American rock and roll/rhythm and blues singer and songwriter. He was best known as the boy soprano lead singer of the New York City-based early rock and roll doo-wop group The Teenagers.\n\nFrankie Lymon: Bio Summary\n\nName Frankie Lymon Date of birth September 30, 1942 Birthplace Harlem, New York, U.S. Died February 27, 1968 (aged 25) Spouse/Ex Emira Lymon, Zola Taylor, and Elizabeth Waters Children Francine Lymon Parents Jeanette Lymon and Howard Lymon Occupation Singer, songwriter\n\nEarly Life\n\nFrankie Lymon was born on September 30, 1942, in Harlem, New York City, New York, USA. He is the son of Jeanette Lymon, a maid, and Howard Lymon, a truck driver. Both also sang in the gospel group The Harlemaires. At age 10 he was employed at a grocery store.\n\nFrankie Lymon heard of a local doo-wop group known as the Coupe De Villes at a school talent show. He befriended the lead singer, Herman Santiago, and he became a member of the group, which was later named The Ermines and The Premiers.\n\nCareer\n\nIn 1955, The Premiers received several love letters from a neighbor written by his girlfriend to inspire them to write their own songs. They later came up with a song titled ‘Why Do Fools Fall in Love’, from one of the letters. The group later called themselves The Teenagers.\n\nThe Teenagers\n\nRichard Barrett, a singer with The Valentines got the group an audition with record producer George Goldner. On the day of the group’s audition, Santiago, the original lead singer didn’t arrive on time and Frankie Lymon who knew his part because he assisted in writing the song stepped up instead and sang on his behalf.\n\nGeorge Goldner signed the group to Gee Records in 1956 and their first single titled ‘Why Do Fools Fall in Love’ was released. This was followed by the singles ‘I Want You to Be My Girl’, ‘I Promise to Remember’, ‘The ABC’s of Love’, and ‘I’m Not a Juvenile Delinquent.’\n\nThe Teenagers became Frankie Lymon & the Teenagers. The album The Teenagers Featuring Frankie Lymon was released in 1956. They also released the singles ‘Teenage Love’, ‘Out in the Cold Again’, and ‘Everything to Me’ was released. Frankie Lymon and the Teenagers broke up while touring in Europe in 1957.\n\nFrankie Lymon started performing as a solo artist and began performing with backing from pre-recorded tapes. He released his singles with Roulette Record. His singles titled ‘My Girl’ and ‘Little Girl’ came out in 1957. Soon after these singles, the rock and roll vocalist released his solo album ‘Rock & Roll with Frankie Lymon’.\n\nIn 1959, released the single ‘Up Jumped a Rabbit.’ He released his singles ‘Little Bitty Pretty One’ and ‘Buzz Buzz Buzz’ and in the early 1960s, his career started declining. He was addicted to heroin use and his voice changed to a deeper baritone. He released a few more singles before Roulette ended their contract with him.\n\nAlso Read: David Ray Mccoy: What Happened To LisaRaye McCoy’s Father\n\nFrankie Lymon entered a drug rehabilitation program. He struggled through short-lived deals with Columbia Records and 20th Century Fox Records. Under these records, he managed to release the singles ‘To Each His Own’ and ‘Somewhere.’ He appeared at the Apollo as part of a revue.\n\nFrankie Lymon also recorded several live performances but none were successful. Then in 1968, he was signed to the Big Apple label and released his single ‘I’m Sorry’ under the label. According to sources, he is known for American Graffiti (1973), October Sky (1999), and The Big Fix (1978).\n\nDid Frankie Lymon Get Married?\n\nFrankie Lymon was married to Emira Lymon and previously married to Zola Taylor, and Elizabeth Waters. His first wife was Elizabeth Mickey Waters. Frankie and Elizabeth gave birth to Francine Lymon, who died two days after birth at Lenox Hill Hospital.\n\nFrankie and Elizabeth’s union was not legal because Elizabeth was still married to her first husband at the time. Frankie later started dating Zola Taylor, a member of the Platters. According to Zola, she got married to Frankie in Mexico in 1965.\n\nTheir relationship ended several months later, purportedly because of Frankie’s drug habits. Frankie then met Emira Eagle who was a schoolteacher at Hornsby Elementary in Augusta. They got married in June 1967.\n\nWhat Happened To Frankie Lymon?\n\nFrankie Lymon passed away on February 27, 1968, in Harlem, New York, U.S. He was only 25 years old when he died. He was found dead of a heroin overdose on the floor of his grandmother’s bathroom with a syringe by his side.\n\nFrankie Lymon was buried at Saint Raymond’s Cemetery in the Throggs Neck section of The Bronx, New York City, New York. “I’m Sorry” and “Seabreeze”, the two songs Lymon had recorded for Big Apple before his death, were released later in 1969."}, {"url": "https://soul-patrol.com/frankielymon/", "page_content": "Franklin Joseph “Frankie” Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the boy soprano lead singer of the New York City-based early rock and roll group The Teenagers. The group was composed of five boys, all in their early to mid-teens. The original lineup of the Teenagers, an integrated group, included three African-American members, Frankie Lymon, Jimmy Merchant, and Sherman Garnes; and two Puerto Rican members, Joe Negroni and Herman Santiago.\n\nThe Teenagers’ first single, 1956’s “Why Do Fools Fall in Love,” was also its biggest hit. After Lymon went solo in mid-1957, both his career and that of the Teenagers fell into decline. He was found dead at the age of 25 on the floor of his grandmother’s bathroom from a heroin overdose. His life was dramatized in the 1998 film Why Do Fools Fall In Love.\n\nFrankie Lymon was born in Harlem, New York on September 30, 1942 to Howard and Jeanette Lymon. Howard worked as a truck driver and Jeanette worked as a maid. Howard and Jeanette Lymon also sang in a gospel group known as the Harlemaires; Frankie and his brothers, Lewis and Howie, sang with the Harlemaire Juniors (a fourth Lymon brother, Timmy, was a singer, though not with the Harlemaire Juniors). The Lymons struggled to make ends meet, so, at age 10, Lymon began working as a grocery boy.\n\nAt the age of 12 in 1954, Lymon heard a local doo-wop group known as the Coupe De Villes at a school talent show. He became friends with the lead singer, Herman Santiago, and he eventually became a member of the group, now calling itself both The Ermines and The Premiers. Dennis Jackson of Columbus, Georgia, was one of the main influences in Lymon’s life. His personal donation of $500 helped start Lymon’s career.\n\nOne day in 1955, a neighbor gave The Premiers several love letters that had been written to him by his girlfriend, with the hopes that he could give the boys inspiration to write their own songs. Merchant and Santiago adapted one of the letters into a song called “Why Do Fools Fall in Love”. The Premiers, now calling themselves The Teenagers, got their first shot at fame after impressing Richard Barrett, a singer with The Valentines. Barrett, in turn, got the group an audition with record producer George Goldner. On the day of the group’s audition, Santiago, the original lead singer, was late. Lymon stepped up and told Goldner that he knew the part because he helped write the song. The disc jockeys always called them “Frankie Lymon and the Teenagers”.\n\nGoldner signed the group to Gee Records, and “Why Do Fools Fall in Love” became its first single in January 1956. The single peaked at No. 6 on the Billboard pop singles chart, and topped the Billboard R&B singles chart for five weeks.\n\nSix other top blues 10 singles followed over the next year or so: “I Want You to Be My Girl”, “I Promise to Remember”, “Who Can Explain?”, “Out in the Cold Again”, “The ABC’s of Love”, “I’m Not a Juvenile Delinquent”, and “Baby Baby” were also popular Teenagers releases. “I Want You To Be My Girl” gave the band its second pop hit, reaching No. 13 on the national Billboard Hot 100 chart. “Goody Goody” (written by Matty Malneck and Johnny Mercer and originally performed by Benny Goodman) was a No. 20 pop hit but did not appear on the R&B chart. The Teenagers placed two other singles in the lower half of the pop chart.\n\nWith the release of “I Want You To Be My Girl”, the group’s second single, The Teenagers became Frankie Lymon & the Teenagers. An album, “The Teenagers Featuring Frankie Lymon”, was released in December 1956.\n\nIn early 1957, Lymon and the Teenagers broke up while on a tour in Europe. During an engagement at the London Palladium, Goldner began pushing Lymon as a solo act, giving him solo spots in the show. Lymon began performing with backing from pre-recorded tapes. The group’s last single, “Goody Goody” backed with “Creation of Love,” initially retained the “Frankie Lymon & the Teenagers” credit, but they were actually solo recordings (with backing by session singers). Lymon had officially departed from the group by September 1957; an in-progress studio album called Frankie Lymon and the Teenagers at the London Palladium was instead issued as a Lymon solo release.\n\nAs a solo artist, Lymon was not nearly as successful as he had been with the Teenagers. Beginning with his second solo release, “My Girl”, Lymon had moved to Roulette Records. On a July 19, 1957 episode of Alan Freed’s live ABC TV show The Big Beat, Lymon began dancing with a white teenage girl while he was performing. His actions caused a scandal, particularly among Southern TV station owners, and The Big Beat was subsequently canceled. There is no surviving footage because the episode was taped over, according to Judith Fisher Freed.\n\nLymon’s slowly declining sales fell sharply in the early 1960s. Within the span of one year, as a result of heroin use, his voice changed from his signature tenor to a much deeper baritone. His highest-charting solo hit was a cover of Bobby Day’s “Little Bitty Pretty One”, which peaked at No. 58 on the Hot 100 pop chart in 1960 and which had been recorded in 1957. Addicted to heroin since the age of 15, Lymon fell further into his habit, and his performing career went into decline. According to Lymon in an interview with Ebony magazine in 1967, he was first introduced to heroin when he was 15 by a woman twice his age. In 1961, Roulette, now run by Morris Levy, ended their contract with Lymon and he entered a drug rehabilitation program.\n\nAfter losing Lymon, the Teenagers went through a string of replacement singers, the first of whom was Billy Lobrano. In 1960, Howard Kenny Bobo sang lead on “Tonight’s the Night” with the Teenagers; later that year, Johnny Houston sang lead on two songs. The Teenagers, who had been moved by Morris Levy to End Records, were released from their contract in 1961. The Teenagers briefly reunited with Lymon in 1965, without success.\n\nOver the next four years, Lymon struggled through short-lived deals with 20th Century Fox Records and Columbia Records. Lymon began a relationship with Elizabeth Mickey Waters, who became his first wife in January 1964 and the mother of his only child, a baby girl named Francine who died two days after birth at Lenox Hill Hospital. Lymon’s marriage to Waters was not legal because she was still married to her first husband. After the marriage failed, he moved to Los Angeles in the mid-1960s, where he began a romantic relationship with Zola Taylor, a member of the Platters. Taylor claimed to have married Lymon in Mexico in 1965 although their relationship ended several months later, purportedly because of Lymon’s drug habits. Lymon, however, had been known to say that their marriage was a publicity stunt, and Taylor could produce no legal documentation of their marriage. In Major Robinson’s gossip column of June 6, 1966, Zola said the whole thing was a joke that she went along with at the time (October 1965).\n\nHe appeared at the Apollo as part of a revue, adding an extended tap dance number. Lymon recorded several live performances (such as “Melinda” in 1959), but none rose on the charts. His final television performance was on Hollywood a Go-Go in 1965, where the then-22-year-old singer lip-synched to the recording of his 13-year-old self singing “Why Do Fools Fall in Love.”\n\nThe same year, Lymon was drafted into the United States Army and reported to Fort Gordon, Georgia, near Augusta, Georgia, for training. While in the Augusta area, Lymon met and fell in love with Emira Eagle, a schoolteacher at Hornsby Elementary in Augusta. The two were wed in June 1967, and Lymon repeatedly went AWOL to secure gigs at small Southern clubs. Dishonorably discharged from the Army, Lymon moved into his wife’s home and continued to perform sporadically.\n\nTraveling to New York in 1968, Lymon was signed by manager Sam Bray to his Big Apple label, and the singer returned to recording. Roulette Records expressed interest in releasing Lymon’s records in conjunction with Big Apple and scheduled a recording session for February 28. A major promotion had been arranged with CHO Associates, owned by radio personalities Frankie Crocker, Herb Hamlett and Eddie O’Jay. Lymon, staying at his grandmother’s house in Harlem where he had grown up, celebrated his good fortune by taking heroin; he had remained clean ever since entering the Army three years earlier.\n\nOn February 27, 1968, Lymon was found dead of a heroin overdose at the age of 25 on the floor of his grandmother’s bathroom. Lymon, a Baptist, was buried at Catholic Saint Raymond’s Cemetery in the Throgs Neck section of The Bronx, New York City, New York.\n\n“I’m Sorry” and “Seabreeze”, the two songs Lymon had recorded for Big Apple before his death, were released later in 1968."}, {"url": "http://soul-patrol.com/frankielymon/", "page_content": "Franklin Joseph “Frankie” Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the boy soprano lead singer of the New York City-based early rock and roll group The Teenagers. The group was composed of five boys, all in their early to mid-teens. The original lineup of the Teenagers, an integrated group, included three African-American members, Frankie Lymon, Jimmy Merchant, and Sherman Garnes; and two Puerto Rican members, Joe Negroni and Herman Santiago.\n\nThe Teenagers’ first single, 1956’s “Why Do Fools Fall in Love,” was also its biggest hit. After Lymon went solo in mid-1957, both his career and that of the Teenagers fell into decline. He was found dead at the age of 25 on the floor of his grandmother’s bathroom from a heroin overdose. His life was dramatized in the 1998 film Why Do Fools Fall In Love.\n\nFrankie Lymon was born in Harlem, New York on September 30, 1942 to Howard and Jeanette Lymon. Howard worked as a truck driver and Jeanette worked as a maid. Howard and Jeanette Lymon also sang in a gospel group known as the Harlemaires; Frankie and his brothers, Lewis and Howie, sang with the Harlemaire Juniors (a fourth Lymon brother, Timmy, was a singer, though not with the Harlemaire Juniors). The Lymons struggled to make ends meet, so, at age 10, Lymon began working as a grocery boy.\n\nAt the age of 12 in 1954, Lymon heard a local doo-wop group known as the Coupe De Villes at a school talent show. He became friends with the lead singer, Herman Santiago, and he eventually became a member of the group, now calling itself both The Ermines and The Premiers. Dennis Jackson of Columbus, Georgia, was one of the main influences in Lymon’s life. His personal donation of $500 helped start Lymon’s career.\n\nOne day in 1955, a neighbor gave The Premiers several love letters that had been written to him by his girlfriend, with the hopes that he could give the boys inspiration to write their own songs. Merchant and Santiago adapted one of the letters into a song called “Why Do Fools Fall in Love”. The Premiers, now calling themselves The Teenagers, got their first shot at fame after impressing Richard Barrett, a singer with The Valentines. Barrett, in turn, got the group an audition with record producer George Goldner. On the day of the group’s audition, Santiago, the original lead singer, was late. Lymon stepped up and told Goldner that he knew the part because he helped write the song. The disc jockeys always called them “Frankie Lymon and the Teenagers”.\n\nGoldner signed the group to Gee Records, and “Why Do Fools Fall in Love” became its first single in January 1956. The single peaked at No. 6 on the Billboard pop singles chart, and topped the Billboard R&B singles chart for five weeks.\n\nSix other top blues 10 singles followed over the next year or so: “I Want You to Be My Girl”, “I Promise to Remember”, “Who Can Explain?”, “Out in the Cold Again”, “The ABC’s of Love”, “I’m Not a Juvenile Delinquent”, and “Baby Baby” were also popular Teenagers releases. “I Want You To Be My Girl” gave the band its second pop hit, reaching No. 13 on the national Billboard Hot 100 chart. “Goody Goody” (written by Matty Malneck and Johnny Mercer and originally performed by Benny Goodman) was a No. 20 pop hit but did not appear on the R&B chart. The Teenagers placed two other singles in the lower half of the pop chart.\n\nWith the release of “I Want You To Be My Girl”, the group’s second single, The Teenagers became Frankie Lymon & the Teenagers. An album, “The Teenagers Featuring Frankie Lymon”, was released in December 1956.\n\nIn early 1957, Lymon and the Teenagers broke up while on a tour in Europe. During an engagement at the London Palladium, Goldner began pushing Lymon as a solo act, giving him solo spots in the show. Lymon began performing with backing from pre-recorded tapes. The group’s last single, “Goody Goody” backed with “Creation of Love,” initially retained the “Frankie Lymon & the Teenagers” credit, but they were actually solo recordings (with backing by session singers). Lymon had officially departed from the group by September 1957; an in-progress studio album called Frankie Lymon and the Teenagers at the London Palladium was instead issued as a Lymon solo release.\n\nAs a solo artist, Lymon was not nearly as successful as he had been with the Teenagers. Beginning with his second solo release, “My Girl”, Lymon had moved to Roulette Records. On a July 19, 1957 episode of Alan Freed’s live ABC TV show The Big Beat, Lymon began dancing with a white teenage girl while he was performing. His actions caused a scandal, particularly among Southern TV station owners, and The Big Beat was subsequently canceled. There is no surviving footage because the episode was taped over, according to Judith Fisher Freed.\n\nLymon’s slowly declining sales fell sharply in the early 1960s. Within the span of one year, as a result of heroin use, his voice changed from his signature tenor to a much deeper baritone. His highest-charting solo hit was a cover of Bobby Day’s “Little Bitty Pretty One”, which peaked at No. 58 on the Hot 100 pop chart in 1960 and which had been recorded in 1957. Addicted to heroin since the age of 15, Lymon fell further into his habit, and his performing career went into decline. According to Lymon in an interview with Ebony magazine in 1967, he was first introduced to heroin when he was 15 by a woman twice his age. In 1961, Roulette, now run by Morris Levy, ended their contract with Lymon and he entered a drug rehabilitation program.\n\nAfter losing Lymon, the Teenagers went through a string of replacement singers, the first of whom was Billy Lobrano. In 1960, Howard Kenny Bobo sang lead on “Tonight’s the Night” with the Teenagers; later that year, Johnny Houston sang lead on two songs. The Teenagers, who had been moved by Morris Levy to End Records, were released from their contract in 1961. The Teenagers briefly reunited with Lymon in 1965, without success.\n\nOver the next four years, Lymon struggled through short-lived deals with 20th Century Fox Records and Columbia Records. Lymon began a relationship with Elizabeth Mickey Waters, who became his first wife in January 1964 and the mother of his only child, a baby girl named Francine who died two days after birth at Lenox Hill Hospital. Lymon’s marriage to Waters was not legal because she was still married to her first husband. After the marriage failed, he moved to Los Angeles in the mid-1960s, where he began a romantic relationship with Zola Taylor, a member of the Platters. Taylor claimed to have married Lymon in Mexico in 1965 although their relationship ended several months later, purportedly because of Lymon’s drug habits. Lymon, however, had been known to say that their marriage was a publicity stunt, and Taylor could produce no legal documentation of their marriage. In Major Robinson’s gossip column of June 6, 1966, Zola said the whole thing was a joke that she went along with at the time (October 1965).\n\nHe appeared at the Apollo as part of a revue, adding an extended tap dance number. Lymon recorded several live performances (such as “Melinda” in 1959), but none rose on the charts. His final television performance was on Hollywood a Go-Go in 1965, where the then-22-year-old singer lip-synched to the recording of his 13-year-old self singing “Why Do Fools Fall in Love.”\n\nThe same year, Lymon was drafted into the United States Army and reported to Fort Gordon, Georgia, near Augusta, Georgia, for training. While in the Augusta area, Lymon met and fell in love with Emira Eagle, a schoolteacher at Hornsby Elementary in Augusta. The two were wed in June 1967, and Lymon repeatedly went AWOL to secure gigs at small Southern clubs. Dishonorably discharged from the Army, Lymon moved into his wife’s home and continued to perform sporadically.\n\nTraveling to New York in 1968, Lymon was signed by manager Sam Bray to his Big Apple label, and the singer returned to recording. Roulette Records expressed interest in releasing Lymon’s records in conjunction with Big Apple and scheduled a recording session for February 28. A major promotion had been arranged with CHO Associates, owned by radio personalities Frankie Crocker, Herb Hamlett and Eddie O’Jay. Lymon, staying at his grandmother’s house in Harlem where he had grown up, celebrated his good fortune by taking heroin; he had remained clean ever since entering the Army three years earlier.\n\nOn February 27, 1968, Lymon was found dead of a heroin overdose at the age of 25 on the floor of his grandmother’s bathroom. Lymon, a Baptist, was buried at Catholic Saint Raymond’s Cemetery in the Throgs Neck section of The Bronx, New York City, New York.\n\n“I’m Sorry” and “Seabreeze”, the two songs Lymon had recorded for Big Apple before his death, were released later in 1968."}, {"url": "https://www.smithsonianmag.com/history/teen-idol-frankie-lymon-tragic-rise-fall-tells-truth-1950s-america-180967506/", "page_content": "That voice! Those apple cheeks! Arms wide, head back, he radiates joy, even in antique black and white. That beautiful soprano flying high, talent and presence and just enough ham to sell it all. And it was a great story, too: Up from nothing! A shooting star! So when they found Frankie Lymon dead at the age of 25 one February morning in 1968, in the same apartment building where he’d grown up, it was the end of something and the beginning of something, but no one was quite sure what.\n\nFrankie Lymon and the Teenagers were five kids from Washington Heights, just north of Harlem. They sang doo-wop under the streetlight on the corner of 165th and Amsterdam. They were discovered by the Valentines’ lead singer Richie Barrett while the kids were rehearsing in an apartment house. A few months later their first record, “Why Do Fools Fall in Love?” made it to the top of the national charts. It was 1956. Overnight, Frankie Lymon was the hottest singer in America, off on a world tour. He was 13 years old.\n\nThat made him the first black teenage pop star, a gap-toothed, baby-faced, angel-voiced paragon of show business ambition, and a camera-ready avatar of America’s new postwar youth movement. He was a founding father of rock ’n’ roll even before his voice had changed. That voice and that style influenced two generations of rock, soul and R&B giants. You heard his echoes everywhere. The high, clear countertenor, like something out of Renaissance church music, found its way from the Temptations to the Beach Boys to Earth, Wind & Fire. Even Diana Ross charted a cover of “Why Do Fools Fall in Love?” 25 years after its release. Berry Gordy may not have modeled the Jackson 5 on Frankie Lymon and the Teenagers, as is often said, but it sure sounded as if he had.\n\nThat’s the legend, anyway. Truth is, Frankie Lymon grew up too fast in every way imaginable. “I never was a child, although I was billed in every theater and auditorium where I appeared as a child star,” Lymon told Art Peters, a reporter for Ebony magazine, in 1967. “I was a man when I was 11 years old, doing everything that most men do. In the neighborhood where I lived, there was no time to be a child. There were five children in my family and my folks had to scuffle to make ends meet. My father was a truck driver and my mother worked as a domestic in white folks’ homes. While kids my age were playing stickball and marbles, I was working in the corner grocery store carrying orders to help pay the rent.”\n\nA few days before Frankie and his friends from the corner recorded the song that made them famous, Rosa Parks was pulled off a bus in Montgomery, Alabama. Less than two years later, Frankie danced with a white girl on a national television show, and the show was swiftly canceled. Another part of the legend.\n\nRace integration in pop music was never going to be simple.\n\n**********\n\nAmerica in the 1950s: postwar economy roaring, a chicken in every pot and two cars in every garage of the split-level house in Levittown, every cliché of union-made American middle-class prosperity held to be self-evident.\n\nAnd music was a big part of that. Raucous and brawny, electrified, it felt like Chuck Berry, Little Richard, Elvis and Jerry Lee Lewis all fell from the sky at once. Frankie Lymon and the Teenagers, with their tight, upbeat harmony, were an important part of it, too. You can trace doo-wop back to the Psalms, hear it bubble up in the a cappella harmonies of Gregorian chant, or, by way of Africa and the Caribbean, from gospel quartets.\n\nIn America, beginning in the 1930s, the Mills Brothers and the Ink Spots were the popularizers of those intricate harmonies we recognize today as proto-rock ’n’ roll. Doo-wop was among the inheritors, a thousand street-corner groups and a thousand one-hit wonders. The Spaniels and the Five Satins and the Vocaleers, the Drifters and the Fleetwoods and the Moonglows, the Coasters and the Platters and on to Frankie Valli and modernity. In the 1950s, every high school stairwell in this country was loud with four-part singing. Even today the “Pitch Perfect” movie franchise owes its popularity to an a cappella tradition stretching back into pre-electric history.\n\n“We harmonized every night on the street corner until the neighbors would call the cops to run us away,” Lymon told Ebony. But Frankie wasn’t doo-wop, not really. Doo-wop was group music. “Frankie Lymon was always different than that,” Robert Christgau, great-granddaddy of American rock critics and historians, will tell you. “He was the star.”\n\nFrankie and his record producers and managers soon agreed he’d be a more profitable solo act, so off he went, leaving behind the Teenagers, and with them friendship and loyalty. He had another, lesser, hit—a recording of “Goody Goody,” sung by Bob Crosby and Ella Fitzgerald before him—before things cooled.\n\nThen came the long, slow slide.\n\nAsk any junkie and they’ll tell what they’re chasing is the feeling they got the first time they got high. But that first-time rush can never be recaptured, whether you’re talking about heroin or cigarettes or hit records.\n\nFrankie was a heroin addict at 15 years old. He tried to kick, tried again and again and got straight for a while. Then his mother died, and he fell hard.\n\nHe wasn’t alone. Heroin was everywhere in New York by then, and methadone clinics run by the city were springing up in neighborhoods all over town. The failure rate was heartbreaking.\n\n“I looked twice my age,” Lymon told Ebony. “I was thin as a shadow and I didn’t give a damn. My only concern was in getting relief. You know, an addict is the most pathetic creature on earth. He knows that every time he sticks a needle in his arm, he’s gambling with death and, yet, he’s got to have it. It’s like playing Russian Roulette with a spike. There’s always the danger that some peddler will sell him a poisoned batch—some garbage.” Here young Frankie knocks on wood. “I was lucky. God must have been watching over me.”\n\nEven now you want to believe him.\n\n**********\n\nFrankie’s neighborhood, just up the bluffs from the long-gone Polo Grounds, feels mostly unchanged even 50 years later. It was poorer then, sure, like the rest of New York City, and in the age before earbuds and headphones it was surely louder. You heard music in the streets.\n\nOutside Frankie’s old address, on West 165th, there’s a “Wet Paint” sign on the door this bright autumn morning, and one building over a crew is painting the ancient fire escapes. The whole block smells of solvent, sharp and clean. It’s a well-kept street of five- and six-story apartment houses in a tidy neighborhood of working-class folks who greet each other on the sidewalk, black and white and brown, Latin American and Caribbean immigrants and Great Migration African-Americans and, like the rest of New York, folks from all over.\n\nYoung as he was, Lymon had three wives. He married them in quick succession, and there was plenty of confusion about the paperwork. He may have been married to more than one at a time, or not entirely married to one of the three at all. One of them may have still been married to someone else. Depends whom you ask. (In the 1980s, they all met in court, to settle Lymon’s estate, such as it was, to find out who was entitled to songwriting royalties from best sellers like “Why Do Fools Fall in Love?” None got much, but the third wife, Emira Eagle, received an undisclosed settlement from record producers.)\n\nIn 1966, there was a brief glimmer of hope. Fresh out of rehab at Manhattan General Hospital, Lymon appeared at a block party organized by a group of nuns at a Catholic settlement house in the Bronx. He told an audience of 2,000 teenagers, “I have been born again. I’m not ashamed to let the public know I took the cure. Maybe my story will keep some other kid from going wrong.”\n\nOn February 27, 1968, he was booked for a recording session to mark the start of a comeback. Instead, he was found dead that morning on his grandmother’s bathroom floor.\n\n**********\n\nFrankie Lymon was buried in the Bronx, at St. Raymond’s Cemetery: Row 13, Grave 70. It’s 15 minutes by car from the old neighborhood. His headstone is over by the highway. The grass is green and the ground is hard and uneven and on the left his stone is packed tight with the others. On the right there’s a gap like a missing tooth. You can see the towers of two bridges from here, the Bronx-Whitestone and Throgs Neck, and hear the traffic rush past on the Cross Bronx Expressway. Billie Holiday is buried here, and Typhoid Mary. This is where the Lindbergh ransom exchange happened. The wind comes hard off Eastchester Bay and shakes the pagoda trees.\n\nFor years Frankie’s grave was unmarked. In the mid-1980s, a New Jersey music store held a benefit to raise money for a memorial, but it never made it to the cemetery. The headstone gathered dust in the record shop, then moved at last to the backyard of a friend of the owner.\n\nEmira Eagle had the current headstone installed sometime in the late 1990s.In Loving Memory\n\nOf My Husband Frank J. Lymon Sept. 30, 1942 – Feb. 27, 1968\n\nNot much room to tell his story. And what could anyone say? That the 1950s were long over? That innocence was dead? That by 1968 one America had vanished entirely, and another had taken its place?\n\nOr maybe that Frankie Lymon’s America, doo-wop America, was never simple, never sweet, but was rather an America as complex and wracked by animus and desire as any in history. It was the same America that killed Emmett Till, after all, another angel-faced kid with apple cheeks and a wide, bright smile.\n\nSeen across the gulf of years, what we now think of as the anodyne, antiseptic 1950s America is revealed as an illusion. June Cleaver vacuuming in an organdy cocktail dress and pearls is a television mirage, a national hallucination. We had the postwar world economy to ourselves because so many other industrial nations had been bombed flat. And for every Pat Boone there was a “Howl,” an Allen Ginsberg, a Kerouac, a Coltrane, a Krassner, a Ferlinghetti. There were underground explosions in painting and poetry and music and prose. It was a kind of invisible revolution.\n\nA telling detail of that chaste 1950s mythology: to preserve his image as a clean-cut teenager, Frankie Lymon would pass off the women he dated in different cities as his mother. It gets told and told and told—in fact, he told it himself—that he once got caught by a reporter who went to shows in New York and Chicago and saw that his “mom” was two different women, each twice Frankie’s age. A story too good to fact-check.\n\nIt was in these 1950s that Ralph Ellison wrote Invisible Man, and James Baldwin published Notes of a Native Son. After Rosa Parks was pulled off that bus, Dr. King led the Montgomery bus boycott and changed the trajectory of civil rights in America. The Supreme Court decided Brown v. Board of Education, and then came Little Rock and the lunch counter sit-ins at Wichita and Oklahoma City. What you saw of the ’50s in America was all about where you stood. And with whom.\n\nWas the short, blinding arc of Frankie Lymon’s career a morality play? A rock ’n’ roll cautionary tale? Or just another story of a young man gone too soon?\n\nMaybe it was a reminder that America changes in every instant and never changes at all. Our streets have always been filled with music and temptation; addiction has always been with us, long before “us” was even America, from the Lotus Eaters of The Odyssey to the opium dens of the Wild West to the crack epidemic and on to our own new opioid crisis.\n\nLooking at that headstone, you get to thinking maybe Frankie Lymon was the 1950s, man and myth, the junkie with an angel’s voice, and that the stone stands as a monument to the lies we tell ourselves about America in the time before Frankie flew away.\n\nThe very night Lymon died Walter Cronkite went on the air and said of Vietnam, “We are mired in a stalemate.” It was clear the center couldn’t hold, and if you felt like the 1950s were five polite young men in matching letter sweaters, the rest of 1968 came at you like the Four Horsemen of the Apocalypse. The world lurched and suddenly spun too fast. Tet. My Lai. Chicago. Washington. Baltimore. Riots everywhere. Vietnam the pulse and drumbeat behind and beneath everything.\n\nSo when Frankie Lymon died that February morning you’d have been forgiven for missing it. He was nearly forgotten by then, a five-paragraph item on page 50 of the New York Times, a casualty of the moment the future and the past came apart.\n\nIt was sad, but for a while, arms wide and head back, Frankie Lymon had bridged and bound all those opposing energies. That face! That voice!\n\nMan, he could sing like an angel.\n\nGet the latest History stories in your inbox? Click to visit our Privacy Statement."}, {"url": "https://www.lyrics.com/lyric/21138284/Frankie+Lymon/Why+Do+Fools+Fall+In+Love", "page_content": "\n\n2:19 1,896 Views\n\nWhy do fools fall in love? Why do birds sing so gay And lovers await the break of day Why do they fall in love Why does the rain fall from up above Why do fools fall in love Why do they fall in love Love is a losing game Love can be a shame I know of a fool you see That fool is me Why do fools fall in love? Why do birds sing so gay And lovers await the break of day Why do they fall in love Why does the rain fall from up above Why do fools fall in love Why do they fall in love Why does my heart skip this crazy beat Because it knows It will reach defeat Tell me why, tell me why Why do fools fall in love?\n\nFollow 0 fans"}, {"url": "https://www.lyrics.com/lyric/21138284/Frankie%20Lymon/Why%20Do%20Fools%20Fall%20In%20Love", "page_content": "\n\n2:19 1,896 Views\n\nWhy do fools fall in love? Why do birds sing so gay And lovers await the break of day Why do they fall in love Why does the rain fall from up above Why do fools fall in love Why do they fall in love Love is a losing game Love can be a shame I know of a fool you see That fool is me Why do fools fall in love? Why do birds sing so gay And lovers await the break of day Why do they fall in love Why does the rain fall from up above Why do fools fall in love Why do they fall in love Why does my heart skip this crazy beat Because it knows It will reach defeat Tell me why, tell me why Why do fools fall in love?\n\nFollow 0 fans"}, {"url": "https://pantheon.world/profile/person/Frankie_Lymon/", "page_content": "Frankie Lymon\n\nFranklin Joseph Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the boy soprano lead singer of the New York City-based early rock and roll doo-wop group The Teenagers. The group was composed of five boys, all in their early to mid-teens. The original lineup of the Teenagers, an integrated group, included three African-American members, Frankie Lymon, Jimmy Merchant, and Sherman Garnes; and two Puerto Rican members, Joe Negroni and Herman Santiago . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Frankie Lymon has received more than 3,289,114 page views. His biography is available in 18 different languages on Wikipedia . Frankie Lymon is the 1,901st most popular singer (down from 1,590th in 2019), the 10,299th most popular biography from United States (down from 8,800th in 2019) and the 530th most popular American Singer."}], "Frankie Lymon was best known as the lead singer of the New York City-based early rock and roll group The Teenagers.": [{"url": "https://www.goldradiouk.com/features/frankie-lymon-life-death-marriages/", "page_content": "Frankie Lymon facts: Life, and tragic death of The Teenagers star and 'Why Do Fools Fall in Love' teen idol\n\nFrankie Lymon and the Teenagers in Streetlight Harmonies\n\nBy Mayer Nissim\n\nFrankie Lymon was the leader of the first all-teen hit rock 'n' roll band, but his short life spiralled into tragedy.\n\nListen to this article Loading audio...\n\nRock 'n' roll was always a teen phenomenon, but while most of the fans lapping up the new sound were that age, many of those putting out the records were well into their 20s and beyond.\n\nThat wasn't the case for Frankie Lymon & The Teenagers. Frankie was the baby of the group, just 13 when they released their debut single, and his four bandmates were all aged 15 or 16.\n\nWith their of-the-moment sound mashing up doo-wop and rock 'n' roll to their racially integrated lineup (Frankie, Jimmy Merchant and Sherman Garnes were Black, Joe Negroni and Herman Santiago were Puerto Rican), The Teenagers were groundbreaking.\n\nThey exploded on to the scene with 'Why Do Fools Fall in Love', which remained their biggest single, before the hits dried up all-too swiftly.\n\nFrankie Lymon left the group, but his solo career failed to launch. He had struggles in his personal life, and tragically died at the age of 25 after a drug overdose. Below, we mourn teen idol Frankie Lymon, while celebrating his life and legacy.\n\nWhen was Frankie Lymon born and how did he join the Teenagers?\n\nFrankie Lymon was born to truck driver dad Howard and maid mum Jeanette on September 30, 1942 in Harlem, New York\n\nSinging was very much in Frankie's blood, as both his parents sang together in gospel group The Harlemaires.\n\nFrankie and his brothers Lewis and Howie sang with Harlemaire Juniors, while Frankie worked as a grocery boy from the age of 10.\n\nWhen he was just 12 Frankie became friends with Herman Santiago, the lead singer of local doo-wop group the Coupe De Villes, having first heard them at a school talent show.\n\nHe went on to join the group that became known as The Ermines, The Premiers and eventually The Teenagers.\n\nHow did Frankie Lymon end up fronting The Teenagers?\n\nFrankie Lymon and The Teenagers. Picture: Getty Images\n\nWith his stunning boy soprano voice, it seems obvious that Frankie Lymon would be the frontman (front-boy?) of The Teenagers, but it didn't start that way.\n\nAs said, it was Santiago who was leading the group when Lymon joined, but that all changed quickly.\n\nAfter impressing The Valentines singer Richard Barrett, The Teenagers got an audition with producer George Goldner. Santiago turned up late, Lymon stepped up and said he could take his place.\n\nFrom then on, the group was effectively Frankie Lymon and the Teenagers.\n\nDid Frankie Lymon write 'Why Do Fools Fall in Love'?\n\nFrankie Lymon & The Teenagers - Why Do Fools Fall In Love (Mastered HD)\n\n'Why Do Fools Fall in Love' was the debut single from The Teenagers, their signature song, and their biggest hit.\n\nIt topped the US R&B Chart, went to number 6 on the pop chart, and incredibly went all the way to number one in the UK singles chart, too.\n\nIt's endured to this day, and has also been covered by The Diamonds in 1956, the Beach Boys in 1964 and Diana Ross in 1981.\n\nAs for who wrote the classic song, it's a little bit complicated.\n\nHerman Santiago had written the basic song called 'Why Do Birds Sing So Gay?' for the audition with producer and Gee Records boss George Goldner, basing the words on some love letters given to the group by a tenant in bassist Sherman Garnes' apartment building.\n\nGoldner suggested some tweaks to the lyrics, while Frankie improvised and tweaked the melody.\n\nSo on the first pressings, the song was attributed to Frankie Lymon, Herman Santiago, and George Goldner.\n\nAfter a while, Santiago's name was mysteriously dropped from the label. Then, after Goldner was bought out by Morris Levy his name was swapped in for the producers.\n\nA lengthy court battle saw Santiago and Jimmy Merchant being given songwriting credit in 1992, but further legal issues meant that this was overturned four years later.\n\nWhat happened to Frankie Lymon and The Teenagers after 'Why Do Fools Fall in Love'?\n\nFrankie Lymon & The Teenagers - I'm not a Juvenile Delinquent (1956) - HD\n\nFrankie Lymon and The Teenagers are best known for their stunning number one single, but they were far from one hit wonders.\n\nBefore 1956 was out they had a string of charting singles: 'I Want You to Be My Girl', 'I Promise to Remember' and 'The ABC's of Love' were all top ten R&B hits and all reached the pop Top 100 too.\n\nIn the UK, 'I'm Not a Juvenile Delinquent' went to number 12. Even into 1957, 'Out in the Cold Again' reached number 10 in the R&B charts.\n\nBy then though, the Teenagers were beginning to fall apart,\n\nWhen did Frankie Lymon leave The Teenagers and what happened to his solo career?\n\nFrankie Lymon \"Goody Goody\" on The Ed Sullivan Show\n\nAs is so often the case when one of a group has the main billing, there was pressure to push Frankie Lymon into a solo career.\n\nGoldner especially was advocating for a solo Frankie, giving the lead singer solo spots during their live show at the London Palladium and having him sing to pre-recorded backing tapes.\n\nIn fact, while it was credited to Frankie Lymon & the Teenagers, the group's last official single 'Goody Goody' (with 'Creation of Love' on the flip) was effectively a solo Frankie single with session singers.\n\nFrankie formally left the band in September 1957, and the planned Frankie Lymon and the Teenagers at the London Palladium LP was released as the solo Frankie Lymon – At The London Palladium.\n\nFrankie Lymon \"Little Bitty Pretty One\"\n\nSadly, Frankie failed to capture the magic and success of the Teenagers as a solo star.\n\nHis move to Roulette Records may not have helped, nor would an apparently \"scandalous\" incident when he danced with a white girl during his performance on Alan Freed's live ABC TV show The Big Beat on July 19, 1957, prompting protests from racist Southern TV station owners\n\nAlong with his personal troubles, the incident caused his career to stall. As the years continued he had brief record deals with 20th Century Fox Records and Columbia Records, but he failed to have a chart hit.\n\nHe even reunited with the Teenagers in 1965, but without success.\n\nWhat happened to The Teenagers after Lymon's departure?\n\nTeenagers - Why Do Fools Fall In Love\n\nAs well as Lymon's career failing to take off after he left the group, The Teenagers never really successfully replaced him.\n\nThe first replacement was Billy Lobrano, the first white member of the group. Meanwhile Sherman Garnes and Joe Negroni died in the late 1970s and were replaced by Bobby Jay and Frankie's brother Lewis Lymon.\n\nIn the 1980s the group experimented with female singers, including Pearl McKinnon and Roz Morehead, before Jimmy Castor and then Timothy Wilson took lead.\n\nCurrently touring as Frankie Lymon's Legendary Teenagers or The Legendary Teenagers, the group still plays today with the current lineup being Herman Santiago, Bobby Jay, Terry King and Terrance Farward.\n\nWas Frankie Lymon married?\n\nFrankie Lymon and DJ Murray The K Kauffman. Picture: Getty Images\n\nFrankie Lymon's personal life was complicated to say the least.\n\nHe married his first wife Elizabeth Mickey Waters in January 1964. Technically though, this marriage was never legal because she was still married to her previous husband.\n\nThey had a daughter together – Frankie's only child – but Francine tragically died just two days after being born.\n\nAfter his first \"marriage\" failed, Frankie is then said to have wed The Platters singer Zola Taylor in Mexico in 1965. To this day, no-one has found any documentation of the wedding though, and it's been claimed that the whole story was a joke or publicity stunt.\n\nThe Platters - He's Mine (1957)\n\nLymon's third and final wedding came to schoolteacher Emira Eagle. The couple married in June 1967, but it's worth noting that Frankie hadn't actually divorced either of his two wives before.\n\nThe complex swirl of legal and illegal weddings that may or may not have happened caused issues long after Lymon's death, when Diana Ross's successful cover of 'Why Do Fools Fall in Love' sparked a scramble for Frankie's royalties.\n\nHow and when did Frankie Lymon die?\n\nFrankie Lymon and the Teenagers - I Promise To Remember (1983)\n\nFrankie Lymon told Ebony magazine in 1967 that he had been introduced to heroin a woman twice his age when he was just 15, and he swiftly became addicted.\n\n\"I looked twice my age,\" Lymon said. \"I was thin as a shadow and I didn't give a damn. My only concern was in getting relief.\n\n\"You know, an addict is the most pathetic creature on earth. He knows that every time he sticks a needle in his arm, he's gambling with death and, yet, he's got to have it. It’s like playing Russian Roulette with a spike.\"\n\nHis deepening dependency surely affected his performing and recording career, though he entered rehab in 1961 and attempted a comeback.\n\nLymon appeared at the Apollo as part of a revue and recorded some singles, but nothing really took off.\n\nBy 1966 he was in trouble again, being arrested on a heroin charge. Instead of going to jail, he was drafted in the US army, but after going AWOL he was discharged.\n\nFrankie Lyman - I'm Sorry - (Big Apple)\n\nThe army did the trick though, briefly. Lymon is said to have remained drug-free for two full years after being drafted.\n\nIn 1968 though, he was told a major promotion had been arranged with CHO Associates. He had a recording session booked. Lymon \"celebrated\" the news by injecting the drug while staying at his grandmother's house in Harlem.\n\nOn February 27, 1968 – the day he was meant to be in the studio Lymon was found dead on the floor of his grandmother's bathroom. He had died of a heroin overdose with a syringe by his side. He was only 25.\n\nLymon was buried at Saint Raymond's Cemetery in the Throggs Neck section of The Bronx.\n\nWhat was Frankie Lymon's legacy?\n\nJoni Mitchell - Why Do Fools Fall In Love\n\nDespite dying at such a young age and only really being an active recording artist for a few short years, Frankie Lymon had a massive impact on the emerging pop and rock 'n' roll scene.\n\nAs we already noted, both The Beach Boys and Diana Ross showed their love for Frankie with their covers of his biggest hit.\n\nOther artists who have namechecked The Teenagers include Ronnie Spector, The Temptations, The Chantels, Smokey Robinson, Billy Joel and George Clinton.\n\nThe influence of Frankie and The Teenagers on Michael Jackson and The Jackson 5 is as clear as day, as well as all of Berry Gordy's other Motown bands and stables.\n\nWhy Do Fools Fall in Love movie trailer\n\nFrankie's influence went beyond the most obvious, with Joni Mitchell covering 'Why Do Fools Fall in Love', and artists as diverse as The Fall, Everything but the Girl and The Mountain Goats, referencing Frankie in their songs 'No X-mas for John Quays', 'Boxing and Pop Music' and 'Harlem Roulette', respectively,.\n\nFrankie's legacy was cemented with the 1998 biopic called (of course) Why Do Fools Fall in Love, which starred Larenz Tate as Frankie Lymon, Halle Berry as Zola Taylor, Vivica A. Fox as Elizabeth Waters and Lela Rochon as Emira Eagle.\n\nThe Teenagers were inducted into the Rock and Roll Hall of Fame in 1993."}, {"url": "https://wbssmedia.com/artists/detail/2390", "page_content": "Frankie Lymon\n\nFranklin Joseph Lymon (September 30, 1942 – February 27, 1968), known professionally as Frankie Lymon, was an American rock and roll/rhythm and blues singer and songwriter, best known as the boy soprano lead singer of the New York City-based early rock and roll group The Teenagers. The group was composed of five boys, all in their early to mid-teens. The original lineup of the Teenagers, an integrated group, included three African-American members, Frankie Lymon, Jimmy Merchant, and Sherman Garnes; and two Puerto Rican members, Joe Negroni and Herman Santiago. The Teenagers' first single, 1956's \"Why Do Fools Fall in Love,\" was also its biggest hit. After Lymon went solo in mid-1957, both his career and that of the Teenagers fell into decline. He was found dead at the age of 25 on the floor of his grandmother's bathroom from a heroin overdose. His life was dramatized in the 1998 film Why Do Fools Fall In Love.\n\nBiography\n\n1942–56: Early life/Joining the Teenagers\n\nLymon was born in Harlem, New York on September 30, 1942 to Jeanette and Howard Lymon. Howard was a truck driver and Jeanette was a maid. Both also sang in the gospel group The Harlemaires; Frankie and his brothers Lewis and Howie sang with the Harlemaire Juniors (a fourth brother, Timmy, was a singer, though not with the Harlemaire Juniors). The Lymons struggled to make ends meet, so Lymon began working as a grocery boy at age 10. At 12 in 1954, Lymon heard a local doo-wop group known as the Coupe De Villes at a school talent show. He became friends with the lead singer, Herman Santiago, and he eventually became a member of the group, now calling itself both The Ermines and The Premiers. Dennis Jackson of Columbus, Georgia, was one of the main influences in Lymon's life. His personal donation of $500 helped start Lymon's career.\n\nOne day in 1955, a neighbor gave The Premiers several love letters that had been written to him by his girlfriend, hoping to give the boys inspiration to write their own songs. Merchant and Santiago adapted one of the letters into a song called \"Why Do Fools Fall in Love\". The Premiers, now calling themselves The Teenagers, got their first shot at fame after impressing Richard Barrett, a singer with The Valentines. Barrett, in turn, got the group an audition with record producer George Goldner. On the day of the group's audition, original lead singer Santiago was late. Lymon stepped up and told Goldner that he knew the part because he helped write the song. The disc jockeys always called them \"Frankie Lymon and the Teenagers\".\n\n1956: \"Why Do Fools Fall in Love\" success\n\nGoldner signed the group to Gee Records, and \"Why Do Fools Fall in Love\" became its first single in January 1956. The single peaked at No. 6 on the Billboard pop singles chart, and topped the Billboard R&B singles chart for five weeks. Six other top blues 10 singles followed over the next year or so: \"I Want You to Be My Girl\", \"I Promise to Remember\", \"Who Can Explain?\", \"Out in the Cold Again\", \"The ABC's of Love\", \"I'm Not a Juvenile Delinquent\", and \"Baby Baby\" were also popular Teenagers releases. \"I Want You To Be My Girl\" gave the band its second pop hit, reaching No. 13 on the national Billboard Hot 100 chart. \"Goody Goody\" (written by Matty Malneck and Johnny Mercer and originally performed by Benny Goodman) was a No. 20 pop hit but did not appear on the R&B chart. The Teenagers placed two other singles in the lower half of the pop chart. With the release of \"I Want You To Be My Girl\", the group's second single, The Teenagers became Frankie Lymon & the Teenagers. An album, \"The Teenagers Featuring Frankie Lymon\", was released in December 1956.\n\n1957–65: Solo career\n\nIn early 1957, Lymon and the Teenagers broke up while on a tour in Europe. During an engagement at the London Palladium, Goldner began pushing Lymon as a solo act, giving him solo spots in the show. Lymon began performing with backing from pre-recorded tapes. The group's last single, \"Goody Goody\" backed with \"Creation of Love,\" initially retained the \"Frankie Lymon & the Teenagers\" credit, but they were actually solo recordings (with backing by session singers). Lymon had officially departed from the group by September 1957; an in-progress studio album called Frankie Lymon and the Teenagers at the London Palladium was instead issued as a Lymon solo release.\n\nAs a solo artist, Lymon was not nearly as successful as he had been with the Teenagers. Beginning with his second solo release, \"My Girl\", Lymon had moved to Roulette Records. On a July 19, 1957 episode of Alan Freed's live ABC TV show The Big Beat, Lymon began dancing with a white teenage girl while he was performing. His actions caused a scandal, particularly among Southern TV station owners, and The Big Beat was subsequently canceled. There is no surviving footage because the episode was taped over, according to Judith Fisher Freed.\n\nLymon's slowly declining sales fell sharply in the early 1960s. Within the span of one year, as a result of heroin use, and the deepening of his voice to a baritone as a result of going through puberty. His highest-charting solo hit was a cover of Bobby Day's \"Little Bitty Pretty One\", which peaked at No. 58 on the Hot 100 pop chart in 1960 and which had been recorded in 1957. Addicted to heroin since the age of 15, Lymon fell further into his habit, and his performing career went into decline. According to Lymon in an interview with Ebonymagazine in 1967, he was first introduced to heroin when he was 15 by a woman twice his age. In 1961, Roulette, now run by Morris Levy, ended their contract with Lymon and he entered a drug rehabilitation program. After losing Lymon, the Teenagers went through a string of replacement singers, the first of whom was Billy Lobrano. In 1960, Howard Kenny Bobo sang lead on \"Tonight's the Night\" with the Teenagers; later that year, Johnny Houston sang lead on two songs. The Teenagers, who had been moved by Morris Levy to End Records, were released from their contract in 1961. The Teenagers briefly reunited with Lymon in 1965, without success.\n\n1966–68: Later years\n\nOver the next four years, Lymon struggled through short-lived deals with 20th Century Fox Records and Columbia Records. He began a relationship with Elizabeth Mickey Waters, who became his first wife in January 1964 and gave birth to his only child, Francine, who died two days after birth at Lenox Hill Hospital.Lymon's marriage to Waters was not legal because she was still married to her first husband. After the marriage failed, he moved to Los Angeles in the mid-1960s, where he began a romantic relationship with Zola Taylor, a member of the Platters. Taylor claimed to have married Lymon in Mexico in 1965 although their relationship ended several months later, purportedly because of Lymon's drug habits. Lymon, however, had been known to say that their marriage was a publicity stunt, and Taylor could produce no legal documentation of their marriage. In Major Robinson's gossip column of June 6, 1966, Zola said the whole thing was a joke that she went along with at the time (October 1965).\n\nHe appeared at the Apollo as part of a revue, adding an extended tap dance number. Lymon recorded several live performances (such as \"Melinda\" in 1959), but none rose on the charts. His final television performance was on Hollywood A Go-Go in 1965, where the then-22- or 23-year-old singer lip-synched to the recording of his 13-year-old self singing \"Why Do Fools Fall in Love.\" On June 21, 1966, he was arrested on a heroin charge and was drafted into the United States Army in the lieu of a jail sentence. He reported to Fort Gordon, Georgia, near Augusta, Georgia, for training. While in the Augusta area, Lymon met and fell in love with Emira Eagle, a schoolteacher at Hornsby Elementary in Augusta. The two were wed in June 1967, and Lymon repeatedly went AWOL to secure gigs at small Southern clubs. Dishonorably discharged from the Army, Lymon moved into his wife's home and continued to perform sporadically. Traveling to New York in 1968, Lymon was signed by manager Sam Bray to his Big Apple label, and the singer returned to recording. Roulette Records expressed interest in releasing Lymon's records in conjunction with Big Apple and scheduled a recording session for February 28. A major promotion had been arranged with CHO Associates, owned by radio personalities Frankie Crocker, Herb Hamlett and Eddie O'Jay. Lymon, staying at his grandmother's house in Harlem where he had grown up, celebrated his good fortune by taking heroin; he had remained clean ever since entering the Army three years earlier.\n\nDeath\n\nOn February 27, 1968, Lymon was found dead of a heroin overdose at the age of 25 on the floor of his grandmother's bathroom. Lymon, a Baptist, was buried at Catholic Saint Raymond's Cemetery in the Throggs Neck section of The Bronx, New York City, New York. \"I'm Sorry\" and \"Seabreeze\", the two songs Lymon had recorded for Big Apple before his death, were released later in 1968.\n\nPosthumous troubles\n\nLymon's troubles extended to others after his death. After R&B singer Diana Ross returned \"Why Do Fools Fall in Love\" to the Top Ten in 1981, a major controversy concerning Lymon's estate ensued. Zola Taylor, Elizabeth Waters and Emira Eagle each approached Morris Levy, the music impresario who retained possession of Lymon's copyrights and his royalties, claiming to be Lymon's rightful widow; Lymon had neglected to divorce any of them. The complex issue resulted in lawsuits and counter-lawsuits, and in 1986 the first of several court cases concerning the ownership of Lymon's estate began.\n\nTrying to determine who was indeed the lawful Mrs. Frankie Lymon was complicated by more issues. Waters was already married when she married Lymon; she had separated from her first husband, but their divorce was finalized in 1965, after she had married Lymon. Taylor claimed to have married Lymon in Mexico in 1965, but could produce no acceptable evidence of their union. Lymon's marriage to Eagle, on the other hand, was properly documented as having taken place at Beulah Grove Baptist Church in Augusta, Georgia, in 1967; however, the singer was still apparently twice-married and never divorced when he married Eagle. The first decision was made in Waters' favor; Eagle appealed, and in 1989, the Appellate Division of the New York State Supreme Court reversed the original decision and awarded Lymon's estate to Eagle.\n\nHowever, the details of the case brought about another issue: whether Morris Levy was deserving of the songwriting co-credit on \"Why Do Fools Fall in Love\". Although early single releases of \"Why Do Fools Fall in Love\" credit Frankie Lymon, Herman Santiago and Jimmy Merchant as co-writers, later releases and cover versions were attributed to Lymon and George Goldner. When Goldner sold his music companies to Morris Levy in 1959, Levy's name began appearing as co-writer of \"Why Do Fools Fall in Love\" in place of Goldner's. Lymon was never paid his songwriting royalties during his lifetime; one result of Emira Eagle's legal victory was that Lymon's estate would finally begin receiving monetary compensation from his hit song's success. In 1987, Herman Santiago and Jimmy Merchant, both by then poor, sued Morris Levy for their songwriting credits. In December 1992, the United States federal courts ruled that Santiago and Merchant were co-authors of \"Why Do Fools Fall in Love\". However, in 1996 the ruling was reversed by the Court of Appeals for the 2nd Circuit on the basis of the statute of limitations: copyright cases must be brought before a court within three years of the alleged civil violation, and Merchant and Santiago's lawsuit was not filed until 30 years later. Authorship of \"Why Do Fools Fall in Love\" currently remains in the names of Frankie Lymon and Morris Levy.\n\nLegacy\n\nAlthough their period of success was brief, Frankie Lymon & the Teenagers' string of hits were highly influential on the rock and R&B performers who followed them. Lymon's high-voiced sound is said to be a direct predecessor of the girl group sound, and the list of performers who name him as an influence include Michael Jackson, Ronnie Spector, Diana Ross, The Chantels, The Temptations, George Clinton, Smokey Robinson, Len Barry and The Beach Boys, among others. The performers most inspired by and derivative of Lymon and the Teenagers' style are The Jackson 5 and their lead singer and future superstar Michael Jackson. Motown founder Berry Gordy based much of the Jackson 5's sound on Frankie Lymon & the Teenagers' recordings, and the Teenagers are believed to be the original model for many of the other Motown groups he cultivated.\n\nLymon's music and story were re-introduced to modern audiences with Why Do Fools Fall in Love, a 1998 biographical film directed by Gregory Nava, also the director of the Selena biopic. Why Do Fools Fall in Love tells a comedic, fictionalized version of Lymon's story from the points of view of his three wives as they battle in court for the rights to his estate. The film stars Larenz Tate as Frankie Lymon, Halle Berry as Zola Taylor, Vivica A. Fox as Elizabeth Waters and Lela Rochon as Elmira Eagle. Why Do Fools Fall in Love was not a commercial success and met with mixed reviews; the film grossed a total of $12,461,773 during its original theatrical run.\n\nIn 1973, Lymon became known to a slightly younger generation than before with the release of American Graffiti, which included \"Why Do Fools Fall in Love\" on its soundtrack. In September 1979 at the Santa Barbara Bowl, Joni Mitchell performed a version of \"Why Do Fools Fall In Love\" which subsequently appeared on the release of her album of the concert entitled \"Shadows and Light\" the following September. During the opening mix of the album, Joni Mitchell also spliced sections of \"I'm Not A Juvenile Delinquent\" into the title track refrains. The Fall reference him in \"No X-mas for John Quays\" on their March 1979 album \"Live at the Witch Trials\" The song \"Harlem Roulette\" by The Mountain Goats, off its 2012 album Transcendental Youth,, contains reference to Frankie Lymon, the song \"Seabreeze\" and Roulette Records. Frontman John Darnielle has stated that the song is about the last night of Lymon's life.\n\nFrankie Lymon and the Teenagers were inducted into the Rock and Roll Hall of Fame in 1993, and into the Vocal Group Hall of Fame in 2000. Lymon was mentioned in the 1992 Stephen King short story \"You Know They Got a Hell of a Band\". Lymon is named as the one who cut off the waitress Sissy's finger for trying to help the protagonists, Mary and Clark Willingham, escape from the town of Rock & Roll Heaven, Oregon, who is inhabited by musicians like Janis Joplin, Otis Redding, Roy Orbison, and other musicians who died young. The English Band Everything but the Girl on their 1991 Album \"Worldwide\" include the song Boxing and Pop Music which references Lymon throughout the song.\n\nDiscography\n\nFrankie Lymon & the Teenagers discography\n\nSingles\n\nGee releases\n\n1956-01: [Gee 1002] \"Why Do Fools Fall in Love\" / \"Please Be Mine\" 1 (#1 on the R&B chart for 5 weeks)\n\n(#1 on the R&B chart for 5 weeks) 1956-04: [Gee 1012] \"I Want You to Be My Girl\" / \"I'm Not a Know-It-All\" 2 (#3 on R&B chart)\n\n(#3 on R&B chart) 1956-07: [Gee 1018] \"I Promise to Remember\" / \"Who Can Explain?\" (double-sided hit on R&B chart (#10 and #7))\n\n1956-09: [Gee 1022] \"The ABC's of Love\" / \"Share\" (#8 on R&B chart)\n\n1956-11: [Gee 1026] \"I'm Not a Juvenile Delinquent\" / \"Baby, Baby\"\n\n1957-04: [Gee 1032] \"Teenage Love\" / \"Paper Castles\"\n\n1957-05: [Gee 1035] \"Love Is a Clown / Am I Fooling Myself Again\"\n\n1957-06: [Gee 1036] \"Out in the Cold Again\" / \"Miracle in the Rain\" 5 (#10 on R&B chart)\n\n(#10 on R&B chart) 1957-07: [Gee 1039] \"Goody Goody\" / \"Creation of Love\" 3\n\n1957-12: [Gee 1046] \"Everything to Me\" / \"Flip Flop\" 4\n\nNotes\n\n1 Released as by \"The Teenagers\"\n\nReleased as by \"The Teenagers\" ⊃2; Early copies released as by \"The Teenagers featuring Frankie Lymon\"; billing on later pressings changed to \"Frankie Lymon & the Teenagers\"\n\n⊃3; Both sides of this release are actually Frankie Lymon solo recordings.\n\n4 billed as \"The Teenagers\" (lead vocal by Billie Lobrano)\n\nbilled as \"The Teenagers\" (lead vocal by Billie Lobrano) 5 Released as by \"The Teenagers featuring Frankie Lymon\"\n\nAlbum\n\n1956: [Gee 701] The Teenagers Featuring Frankie Lymon\n\nCompilations\n\n1986: Frankie Lymon and the Teenagers: For Collectors Only (Murray Hill 148)\n\nFrankie Lymon solo discography\n\nSingles\n\nRoulette releases\n\n1957: [Roulette 4026] \"My Girl\" / \"So Goes My Love\"\n\n1957: [Roulette 4035] \"Little Girl\" / \"It's Christmas Once Again\"\n\n1958: [Roulette 4044] \"Thumb Thumb\" / \"Footsteps\"\n\n1958: [Roulette 4068] \"Portable on My Shoulder\" / \"Mama Don't Allow It\" — 4/58\n\n1958: [Roulette 4093] \"Only Way to Love\" / \"Melinda\"\n\n1959: [Roulette 4128] \"Up Jumped a Rabbit\" / \"No Matter What You've Done\"\n\n1969: [Roulette 21095 \"\"/ \"1-20-12 Forever'\n\nGee release\n\n1959: [Gee 1052] \"Goody Good Girl\" / \"I'm Not Too Young to Dream\"\n\nRoulette releases\n\n1960: [Roulette 4257] \"Little Bitty Pretty One\" / \"Creation of Love\"\n\n1960: [Roulette 4283] \"Buzz Buzz Buzz\" / \"Waitin' in School\"\n\n1961: [Roulette 4310] \"Jailhouse Rock\" / \"Silhouettes\"\n\n1961: [Roulette 4348] \"Change Partners\" / \"So Young (And So in Love)\"\n\n1961: [Roulette 4391] \"Young\" / \"I Put the Bomp\" (featuring backing vocals by two members of The Delicates (Denise Ferri and Peggy Santiglia))\n\nLater releases\n\n1964: \"To Each His Own\" / \"Teacher, Teacher\" (20th Century Fox)\n\n1964: \"Somewhere\" / \"Sweet and Lovely\" (Columbia)\n\n1969: \"I'm Sorry\" / \"Seabreeze\" (Big Apple\n\nAlbums"}, {"url": "https://popularbio.com/frankie-lymon/", "page_content": "Updated On April 30, 2023\n\nFrankie Lymon- Biography\n\nFrankie Lymon was an American rock & roll singer and composer who was born Franklin Joseph Lymon. He was best known as the main singer of The Teenagers, a New York City-based rock & roll band made up of five young lads. ‘Why Do Fools Fall in Love,’ ‘I Want You to Be My Girl,’ ‘I Promise to Remember,’ ‘The ABCs of Love,’ ‘I’m Not a Juvenile Delinquent,’ ‘Out in the Cold Again,’ and ‘Goody Goody’ were among the group’s big singles.\n\nThe rock and roll singer appeared on many albums as a solo performer. ‘Frankie Lymon and the Teenagers,’ ‘Frankie Lymon at the London Palladium,’ ‘Rock & Roll with Frankie Lymon,’ and ‘Complete Recordings (Bear Family)’ were some of his hit albums. Lymon, who began abusing drugs after his career fell apart, died of a heroin overdose at the age of 25. He was interred in New York City’s Saint Raymond’s Cemetery after his tragic death. In terms of his personal life, the American singer was a polygamist who was married to three stunning women until his death. ‘Why Do Fools Fall in Love?’ was a 1998 film that chronicled his musical career.\n\nEarly Life and Bio\n\nFranklin Joseph Lymon, better known as Frankie Lymon, was born on September 30, 1942, in Harlem, New York City, New York, United States. His mother, Jeanette Lymon, worked as a maid, while his father, Howard Lymon, drove a truck. They were both members of the Harlemaires, a gospel ensemble.\n\nLymon began working as a grocery boy at the age of 10 to help his family make ends meet. He met the lead vocalist of the local doo-wop group Coupe De Villes, Herman Santiago when he was 12 years old. He eventually became a member of the band, which was later renamed The Ermines and The Premiers.\n\nCareer\n\nA neighbor handed the Premiers some love letters written by his girlfriend in 1955 to encourage them to write their songs. The boys were inspired by this and wrote a song called ‘Why Do Fools Fall in Love.’\n\nThe Teenagers, as they were now known, went on to audition with American record producer George Goldner. When Santiago, the original lead singer, failed to show up for the audition, Lymon stepped in and sang in his place.\n\nThe trio was signed to Gee Records by Goldner in 1956, and their first single, ‘Why Do Fools Fall in Love,’ was published. The singles ‘I Want You to Be My Girl,’ ‘I Promise to Remember,’ ‘The ABC of Love,’ and ‘I’m Not a Juvenile Delinquent’ was released after that.\n\nThe Teenagers were renamed Frankie Lymon & the Teenagers shortly after. In December 1956, their album ‘The Teenagers Featuring Frankie Lymon’ was released. Several singles were issued the next year, including ‘Teenage Love,’ ‘Out in the Cold Again,’ and ‘Everything to Me.’ In 1957, Lymon and the Teenagers split up while on tour in Europe.\n\nFrankie Lymon then began performing as a solo performer, with Roulette Record publishing his tracks. In 1957, he released the songs ‘My Girl’ and ‘Little Girl.’ The rock and roll vocalist launched his solo album, ‘Rock & Roll with Frankie Lymon,’ shortly after these singles.\n\nHe released the single ‘Up Jumped a Rabbit’ in 1959. In 1960, he recorded the singles “Little Bitty Pretty One” and “Buzz Buzz Buzz.” Lymon’s career began to wane in the early 1960s. The singer’s voice transformed to a deeper baritone when he grew hooked on heroin.\n\nHe followed up with the hits ‘Jailhouse Rock,’ ‘Change Partners,’ and ‘Young.’ Roulette later terminated their contract with him, and Lymon joined a drug treatment facility.\n\nThe American vocalist battled through short-term partnerships with Columbia Records and 20th Century Fox Records during the next four years. He was able to release the singles ‘To Each His Own’ and ‘Somewhere’ under these recordings.\n\nLymon then performed in a revue at the Apollo. He also attempted but failed to videotape several live performances. Then, in 1968, he was signed to the Big Apple label, which issued his single “I’m sorry.”\n\nWhat is the Net Worth of Frankie Lymon? Salary, Earnings\n\nFrankie Lymon estimated Net Worth, Salary, Income, Cars, lifestyle & many more details have been updated below. Let’s check, How Rich is Frankie Lymon in 2020 -2021?\n\nFrankie Lymon Net Worth:\n\n$1 million to $5 million\n\n\n\nEstimated Net Worth in 2021 $1 million to $5 million Previous Year’s Net Worth (2020) $1 million to $5 million Annual Salary Under Review. Income Source Rock Singer Net Worth Verification Status Not Verified\n\nMarried Life\n\nFrankie Lymon started seeing Elizabeth Waters and married her in 1964.\n\nThe couple had a baby girl, who died at Lenox Hill Hospital barely two days after her birth. Few people are aware that Lymon’s marriage to Waters was unconstitutional because she was still married to her first husband.\n\nAfter his marriage to Waters fell up, Lymon began dating Zola Taylor. The couple is said to have married in 1965. Their marriage, however, was thought to be a PR gimmick, as there was no formal paperwork of their union. Lymon’s drug addiction caused the pair to split up in 1968.\n\nMeanwhile, Lymon had fallen in love with another woman, Emira Eagle, in 1967. In June of 1967, they married.\n\nLymon was a polygamist who married three women before his death: Waters, Taylor, and Eagle.\n\nOn February 27, 1968, he was discovered dead from a heroin overdose. He died while he was only 25 years old. He was laid to rest in the Catholic cemetery of Saint Raymond.\n\nFacts\n\n‘The Golden Throat’ was his moniker.\n\nFrankie Lymon has been described as one of Michael Jackson’s, Diana Ross’, Ronnie Spector’s, The Chantels’, George Clinton’s, The Temptations’, Len Barry’s, Smokey Robinson’s, and The Beach Boys’ idols.\n\nRead More: Ximena Córdoba, Sapphire Nicole Howell, Natalie Knepp, Caroline Gregory"}, {"url": "https://www.dicytrends.com/frankie-lymon-what-happened-to-the-singer-songwriter/", "page_content": "The name Frankie Lymon might ring a bell in your mind. Frankie Lymon was considered one of the first African-American teenage pop stars and the favorite of several people. He is also known as Franklin Joseph Lymon or Frankie Lyman. He was an American rock and roll/rhythm and blues singer and songwriter. He was best known as the boy soprano lead singer of the New York City-based early rock and roll doo-wop group The Teenagers.\n\nFrankie Lymon: Bio Summary\n\nName Frankie Lymon Date of birth September 30, 1942 Birthplace Harlem, New York, U.S. Died February 27, 1968 (aged 25) Spouse/Ex Emira Lymon, Zola Taylor, and Elizabeth Waters Children Francine Lymon Parents Jeanette Lymon and Howard Lymon Occupation Singer, songwriter\n\nEarly Life\n\nFrankie Lymon was born on September 30, 1942, in Harlem, New York City, New York, USA. He is the son of Jeanette Lymon, a maid, and Howard Lymon, a truck driver. Both also sang in the gospel group The Harlemaires. At age 10 he was employed at a grocery store.\n\nFrankie Lymon heard of a local doo-wop group known as the Coupe De Villes at a school talent show. He befriended the lead singer, Herman Santiago, and he became a member of the group, which was later named The Ermines and The Premiers.\n\nCareer\n\nIn 1955, The Premiers received several love letters from a neighbor written by his girlfriend to inspire them to write their own songs. They later came up with a song titled ‘Why Do Fools Fall in Love’, from one of the letters. The group later called themselves The Teenagers.\n\nThe Teenagers\n\nRichard Barrett, a singer with The Valentines got the group an audition with record producer George Goldner. On the day of the group’s audition, Santiago, the original lead singer didn’t arrive on time and Frankie Lymon who knew his part because he assisted in writing the song stepped up instead and sang on his behalf.\n\nGeorge Goldner signed the group to Gee Records in 1956 and their first single titled ‘Why Do Fools Fall in Love’ was released. This was followed by the singles ‘I Want You to Be My Girl’, ‘I Promise to Remember’, ‘The ABC’s of Love’, and ‘I’m Not a Juvenile Delinquent.’\n\nThe Teenagers became Frankie Lymon & the Teenagers. The album The Teenagers Featuring Frankie Lymon was released in 1956. They also released the singles ‘Teenage Love’, ‘Out in the Cold Again’, and ‘Everything to Me’ was released. Frankie Lymon and the Teenagers broke up while touring in Europe in 1957.\n\nFrankie Lymon started performing as a solo artist and began performing with backing from pre-recorded tapes. He released his singles with Roulette Record. His singles titled ‘My Girl’ and ‘Little Girl’ came out in 1957. Soon after these singles, the rock and roll vocalist released his solo album ‘Rock & Roll with Frankie Lymon’.\n\nIn 1959, released the single ‘Up Jumped a Rabbit.’ He released his singles ‘Little Bitty Pretty One’ and ‘Buzz Buzz Buzz’ and in the early 1960s, his career started declining. He was addicted to heroin use and his voice changed to a deeper baritone. He released a few more singles before Roulette ended their contract with him.\n\nAlso Read: David Ray Mccoy: What Happened To LisaRaye McCoy’s Father\n\nFrankie Lymon entered a drug rehabilitation program. He struggled through short-lived deals with Columbia Records and 20th Century Fox Records. Under these records, he managed to release the singles ‘To Each His Own’ and ‘Somewhere.’ He appeared at the Apollo as part of a revue.\n\nFrankie Lymon also recorded several live performances but none were successful. Then in 1968, he was signed to the Big Apple label and released his single ‘I’m Sorry’ under the label. According to sources, he is known for American Graffiti (1973), October Sky (1999), and The Big Fix (1978).\n\nDid Frankie Lymon Get Married?\n\nFrankie Lymon was married to Emira Lymon and previously married to Zola Taylor, and Elizabeth Waters. His first wife was Elizabeth Mickey Waters. Frankie and Elizabeth gave birth to Francine Lymon, who died two days after birth at Lenox Hill Hospital.\n\nFrankie and Elizabeth’s union was not legal because Elizabeth was still married to her first husband at the time. Frankie later started dating Zola Taylor, a member of the Platters. According to Zola, she got married to Frankie in Mexico in 1965.\n\nTheir relationship ended several months later, purportedly because of Frankie’s drug habits. Frankie then met Emira Eagle who was a schoolteacher at Hornsby Elementary in Augusta. They got married in June 1967.\n\nWhat Happened To Frankie Lymon?\n\nFrankie Lymon passed away on February 27, 1968, in Harlem, New York, U.S. He was only 25 years old when he died. He was found dead of a heroin overdose on the floor of his grandmother’s bathroom with a syringe by his side.\n\nFrankie Lymon was buried at Saint Raymond’s Cemetery in the Throggs Neck section of The Bronx, New York City, New York. “I’m Sorry” and “Seabreeze”, the two songs Lymon had recorded for Big Apple before his death, were released later in 1969."}, {"url": "https://walkoffame.com/frankie-lymon/", "page_content": "Frankie Lymon\n\nFranklin Joseph “Frankie” Lymon was an American rock and roll/rhythm and blues singer and songwriter, best known as the boy soprano lead singer of a New York City-based early rock and roll group, The Teenagers. The group was composed of five boys, all in their early to mid teens. The original lineup of the Teenagers, an integrated group, included three African American members, Frankie Lymon, Jimmy Merchant and Sherman Garnes, and two Puerto Rican members, Herman Santiago and Joe Negroni.\n\nThe Teenagers’ first single, 1956’s “Why Do Fools Fall in Love”, was also their biggest hit. After Lymon went solo in mid-1957, both his career and those of the Teenagers fell into decline. By age 25, he was found dead in his grandmother’s bathroom from a heroin overdose. His life inspired the 1998 film, Why Do Fools Fall In Love?.\n\nFrankie Lymon was born in Harlem to a truck driver father and a mother who worked as a maid. Lymon’s father, Howard Lymon, also sang in a gospel group known as the Harlemaires; Frankie Lymon and his brothers Lewis and Howie sang with the Harlemaire Juniors. The Lymon family struggled to make ends meet, and Lymon began working as a grocery boy at age ten, augmenting his legitimate income with proceeds gained from hustling prostitutes and was known for having relationships with women twice his age.\n\nAt the age of 12, Lymon heard a local doo-wop group known as the Coupe De Villes at a school talent show. He befriended their lead singer, Herman Santiago, and he eventually became a member of the group, now calling itself both The Ermines and The Premiers. Dennis Jackson of Columbus, Georgia was one of the main influences of Lymon’s life. His personal donation of $500 helped start Frankie’s career."}, {"url": "https://www.britannica.com/topic/Frankie-Lymon-and-the-Teenagers", "page_content": "Frankie Lymon and the Teenagers, American vocal group popular in the mid-1950s, prime exponents of the doo-wop vocal style. The members were Frankie Lymon (b. Sept. 30, 1942, New York, N.Y., U.S.—d. Feb. 28, 1968, New York), Herman Santiago (b. Feb. 18, 1941, New York), Jimmy Merchant (b. Feb. 10, 1940, New York), Joe Negroni (b. Sept. 9, 1940, New York—d. Sept. 5, 1978, New York), and Sherman Garnes (b. June 8, 1940, New York—d. Feb. 26, 1977, New York).\n\nThe broad-based success of this vocal ensemble helped signal the emergence of rock and roll as a part of mainstream teenage culture. The prepubescent soprano of 13-year-old lead singer Lymon, sounding innocent and girlish, represented one of the most appealing sounds in early rock and roll, and many later pop groups would feature a preteen male lead, most notably the Jackson 5. The Teenagers’ first successful record, “Why Do Fools Fall In Love” (1956), was followed by five more singles that appeared on the national survey lists of the most popular records in the United States. The Teenagers also appeared in two popular rock-and-roll movies starring disc jockey Alan Freed, Rock, Rock, Rock (1956) and Mister Rock and Roll (1957).\n\nIn 1957 Lymon left the group to launch a solo career, which failed when his changed adult voice, an unremarkable tenor, proved to have diminished commercial appeal. Long afflicted by a substance abuse problem, Lymon died in 1968 from a drug overdose. He and the group were inducted into the Rock and Roll Hall of Fame in 1993."}, {"url": "https://www.blackpast.org/african-american-history/groups-organizations-african-american-history/frankie-lymon-and-teenagers-1954-1957/", "page_content": "Let it play in the background as you study and immerse yourself in this topic!\n\nFrankie Lymon and the Teenagers began in 1954 as a singing group founded at Edward W. Stitt Junior High School in the Washington Heights section of Manhattan (New York City, New York) by second tenor Jimmy Merchant and bass Sherman Garnes. They initially called themselves the Earth Angels. Eventually they added lead singer, Herman Santiago, and baritone, John Seda, to their lineup and evolved into The Coupe De Villes. By the end of 1954, Frankie Lymon joined the band and they changed their name to Ermines and later The Premiers.\n\nLymon was born in New York City on December 30, 1942. When he was 12 years old and working in a grocery store, he met The Premiers. Lymon, who was was already singing gospel music in his father’s church, transitioned to secular music after meeting The Premiers.\n\nAfter joining the group Lymon helped lead singer Herman Santiago rewrite what would become their most popular song, “Why Do Fools Fall in Love.” The song got the group an audition with Gee Records in 1955. On the day of the audition Santiago fell ill and was unable to sing. Lymon replaced him. After hearing Lymon sing, Gee Records agreed to sign the band as The Teenagers with Lymon as the lead singer.\n\nReleased in 1956, “Why Do Fools Fall in Love” quickly became the number one R&B song in the United States and the number one pop hit in Great Britain. Music critics credit the song’s success as the likely result of Lymon’s agile, ingenuous, and utterly charming performance. The song remains one of the key records by which the doo-wop style is defined and remembered. Moreover, its success in an era of racial segregation allowed Lymon to become the first black teenage pop star.\n\nThe group went on to star in Alan Freed’s package shows and movies and later appeared on The Ed Sullivan Show and American Bandstand. By the end of 1956, after touring through all of the United States and in Great Britain, the group was arguably the most popular band in the nation.\n\nIn 1956 and 1957 the Teenagers released five more singles which reached the Billboard R&B top ten list, and three of these songs —”I Want You to Be My Girl,” “Who Can Explain?” and “The ABC’s of Love”— all reached the U.S. pop charts as well. As the band toured in 1957 Lymon left the group and began to record solo singles produced by Roulette Records.\n\nLymon continued to make records, as did the Teenagers but neither his solo career nor the Teenagers’ career ever matched their early success in 1956. On February 27, 1968, Frankie Lymon was found dead of a heroin overdose in his grandmother’s New York City apartment bathroom floor. He was only 25 years old. “I’m Sorry” and “Seabreeze,” the two songs Lymon had recorded for Big Apple Records before his death, were released later in 1968.\n\nIn 1993 Frankie Lymon and the Teenagers were inducted into the Rock and Roll Hall of Fame. They were inducted into the Vocal Group Hall of Fame in 2000."}, {"url": "https://www.allmusic.com/artist/frankie-lymon-mn0000139933/biography", "page_content": "Biography Frankie Lymon Follow Artist +\n\nThe frontman of Frankie Lymon & the Teenagers became the first Black teenage pop star following 1956's hit \"Why Do Fools Fall in Love.\"\n\nRead Full Biography"}, {"url": "https://pantheon.world/profile/person/Frankie_Lymon/", "page_content": "Frankie Lymon\n\nFranklin Joseph Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the boy soprano lead singer of the New York City-based early rock and roll doo-wop group The Teenagers. The group was composed of five boys, all in their early to mid-teens. The original lineup of the Teenagers, an integrated group, included three African-American members, Frankie Lymon, Jimmy Merchant, and Sherman Garnes; and two Puerto Rican members, Joe Negroni and Herman Santiago . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Frankie Lymon has received more than 3,289,114 page views. His biography is available in 18 different languages on Wikipedia . Frankie Lymon is the 1,901st most popular singer (down from 1,590th in 2019), the 10,299th most popular biography from United States (down from 8,800th in 2019) and the 530th most popular American Singer."}, {"url": "https://alchetron.com/Frankie-Lymon", "page_content": "Franklin Joseph \"Frankie\" Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the boy soprano lead singer of the New York City-based early rock and roll group The Teenagers. The group was composed of five boys, all in their early to mid-teens. The original lineup of the Teenagers, an integrated group, included three African-American members, Frankie Lymon, Jimmy Merchant, and Sherman Garnes; and two Puerto Rican members, Joe Negroni and Herman Santiago.\n\nThe Teenagers' first single, 1956's \"Why Do Fools Fall in Love,\" was also its biggest hit. After Lymon went solo in mid-1957, both his career and that of the Teenagers fell into decline. He was found dead at the age of 25 on the floor of his grandmother's bathroom from a heroin overdose. His life was dramatized in the 1998 film Why Do Fools Fall In Love.\n\nEarly years: joining the Teenagers\n\nFrankie Lymon was born in Harlem, New York on September 30, 1942 to Howard and Jeanette Lymon. Howard worked as a truck driver and Jeanette worked as a maid. Howard and Jeanette Lymon also sang in a gospel group known as the Harlemaires; Frankie and his brothers, Lewis and Howie, sang with the Harlemaire Juniors (a fourth Lymon brother, Timmy, was a singer, though not with the Harlemaire Juniors). The Lymons struggled to make ends meet, so, at age 10, Lymon began working as a grocery boy.\n\nAt the age of 12 in 1954, Lymon heard a local doo-wop group known as the Coupe De Villes at a school talent show. He became friends with the lead singer, Herman Santiago, and he eventually became a member of the group, now calling itself both The Ermines and The Premiers. Dennis Jackson of Columbus, Georgia, was one of the main influences in Lymon's life. His personal donation of $500 helped start Lymon's career.\n\nOne day in 1955, a neighbor gave The Premiers several love letters that had been written to him by his girlfriend, with the hopes that he could give the boys inspiration to write their own songs. Merchant and Santiago adapted one of the letters into a song called \"Why Do Fools Fall in Love\". The Premiers, now calling themselves The Teenagers, got their first shot at fame after impressing Richard Barrett, a singer with The Valentines. Barrett, in turn, got the group an audition with record producer George Goldner. On the day of the group's audition, Santiago, the original lead singer, was late. Lymon stepped up and told Goldner that he knew the part because he helped write the song. The disc jockeys always called them \"Frankie Lymon and the Teenagers\".\n\n\"Why Do Fools Fall in Love\": fame and success\n\nGoldner signed the group to Gee Records, and \"Why Do Fools Fall in Love\" became its first single in January 1956. The single peaked at No. 6 on the Billboard pop singles chart, and topped the Billboard R&B singles chart for five weeks.\n\nSix other top blues 10 singles followed over the next year or so: \"I Want You to Be My Girl\", \"I Promise to Remember\", \"Who Can Explain?\", \"Out in the Cold Again\", \"The ABC's of Love\", \"I'm Not a Juvenile Delinquent\", and \"Baby Baby\" were also popular Teenagers releases. \"I Want You To Be My Girl\" gave the band its second pop hit, reaching No. 13 on the national Billboard Hot 100 chart. \"Goody Goody\" (written by Matty Malneck and Johnny Mercer and originally performed by Benny Goodman) was a No. 20 pop hit but did not appear on the R&B chart. The Teenagers placed two other singles in the lower half of the pop chart.\n\nWith the release of \"I Want You To Be My Girl\", the group's second single, The Teenagers became Frankie Lymon & the Teenagers. An album, \"The Teenagers Featuring Frankie Lymon\", was released in December 1956.\n\nGoing solo\n\nIn early 1957, Lymon and the Teenagers broke up while on a tour in Europe. During an engagement at the London Palladium, Goldner began pushing Lymon as a solo act, giving him solo spots in the show. Lymon began performing with backing from pre-recorded tapes. The group's last single, \"Goody Goody\" backed with \"Creation of Love,\" initially retained the \"Frankie Lymon & the Teenagers\" credit, but they were actually solo recordings (with backing by session singers). Lymon had officially departed from the group by September 1957; an in-progress studio album called Frankie Lymon and the Teenagers at the London Palladium was instead issued as a Lymon solo release.\n\nAs a solo artist, Lymon was not nearly as successful as he had been with the Teenagers. Beginning with his second solo release, \"My Girl\", Lymon had moved to Roulette Records. On a July 19, 1957 episode of Alan Freed's live ABC TV show The Big Beat, Lymon began dancing with a white teenage girl while he was performing. His actions caused a scandal, particularly among Southern TV station owners, and The Big Beat was subsequently canceled. There is no surviving footage because the episode was taped over, according to Judith Fisher Freed.\n\nLymon's slowly declining sales fell sharply in the early 1960s. Within the span of one year, as a result of heroin use, his voice changed from his signature tenor to a much deeper baritone. His highest-charting solo hit was a cover of Bobby Day's \"Little Bitty Pretty One\", which peaked at No. 58 on the Hot 100 pop chart in 1960 and which had been recorded in 1957. Addicted to heroin since the age of 15, Lymon fell further into his habit, and his performing career went into decline. According to Lymon in an interview with Ebony magazine in 1967, he was first introduced to heroin when he was 15 by a woman twice his age. In 1961, Roulette, now run by Morris Levy, ended their contract with Lymon and he entered a drug rehabilitation program.\n\nAfter losing Lymon, the Teenagers went through a string of replacement singers, the first of whom was Billy Lobrano. In 1960, Howard Kenny Bobo sang lead on \"Tonight's the Night\" with the Teenagers; later that year, Johnny Houston sang lead on two songs. The Teenagers, who had been moved by Morris Levy to End Records, were released from their contract in 1961. The Teenagers briefly reunited with Lymon in 1965, without success.\n\nLater years\n\nOver the next four years, Lymon struggled through short-lived deals with 20th Century Fox Records and Columbia Records. Lymon began a relationship with Elizabeth Mickey Waters, who became his first wife in January 1964 and the mother of his only child, a baby girl named Francine who died two days after birth at Lenox Hill Hospital. Lymon's marriage to Waters was not legal because she was still married to her first husband. After the marriage failed, he moved to Los Angeles in the mid-1960s, where he began a romantic relationship with Zola Taylor, a member of the Platters. Taylor claimed to have married Lymon in Mexico in 1965 although their relationship ended several months later, purportedly because of Lymon's drug habits. Lymon, however, had been known to say that their marriage was a publicity stunt, and Taylor could produce no legal documentation of their marriage. In Major Robinson's gossip column of June 6, 1966, Zola said the whole thing was a joke that she went along with at the time (October 1965).\n\nHe appeared at the Apollo as part of a revue, adding an extended tap dance number. Lymon recorded several live performances (such as \"Melinda\" in 1959), but none rose on the charts. His final television performance was on Hollywood a Go-Go in 1965, where the then-22-year-old singer lip-synched to the recording of his 13-year-old self singing \"Why Do Fools Fall in Love.\"\n\nThe same year, Lymon was drafted into the United States Army and reported to Fort Gordon, Georgia, near Augusta, Georgia, for training. While in the Augusta area, Lymon met and fell in love with Emira Eagle, a schoolteacher at Hornsby Elementary in Augusta. The two were wed in June 1967, and Lymon repeatedly went AWOL to secure gigs at small Southern clubs. Dishonorably discharged from the Army, Lymon moved into his wife's home and continued to perform sporadically.\n\nTraveling to New York in 1968, Lymon was signed by manager Sam Bray to his Big Apple label, and the singer returned to recording. Roulette Records expressed interest in releasing Lymon's records in conjunction with Big Apple and scheduled a recording session for February 28. A major promotion had been arranged with CHO Associates, owned by radio personalities Frankie Crocker, Herb Hamlett and Eddie O'Jay. Lymon, staying at his grandmother's house in Harlem where he had grown up, celebrated his good fortune by taking heroin; he had remained clean ever since entering the Army three years earlier.\n\nDeath\n\nOn February 27, 1968, Lymon was found dead of a heroin overdose at the age of 25 on the floor of his grandmother's bathroom. Lymon, a Baptist, was buried at Catholic Saint Raymond's Cemetery in the Throggs Neck section of The Bronx, New York City, New York.\n\n\"I'm Sorry\" and \"Seabreeze\", the two songs Lymon had recorded for Big Apple before his death, were released later in 1968.\n\nPosthumous troubles\n\nLymon's troubles extended to others after his death. After R&B singer Diana Ross returned \"Why Do Fools Fall in Love\" to the Top Ten in 1981, a major controversy concerning Lymon's estate ensued. Zola Taylor, Elizabeth Waters and Emira Eagle each approached Morris Levy, the music impresario who retained possession of Lymon's copyrights and his royalties, claiming to be Lymon's rightful widow; Lymon had neglected to divorce both Taylor and Waters. The complex issue resulted in lawsuits and counter-lawsuits, and in 1986, the first of several court cases concerning the ownership of Lymon's estate began.\n\nTrying to determine who was indeed the lawful Mrs. Frankie Lymon was complicated by more issues. Waters was already married when she married Lymon; she had separated from her first husband, but their divorce was finalized in 1965, after she had married Lymon. Taylor claimed to have married Lymon in Mexico in 1965, but could produce no acceptable evidence of their union. Lymon's marriage to Eagle, on the other hand, was properly documented as having taken place at Beulah Grove Baptist Church in Augusta, Georgia, in 1967; however, the singer was still apparently twice-married and never divorced when he married Eagle. The first decision was made in Waters' favor; Eagle appealed, and in 1989, the Appellate Division of the New York State Supreme Court reversed the original decision and awarded Lymon's estate to Eagle.\n\nHowever, the details of the case brought about another issue: whether Morris Levy was deserving of the songwriting co-credit on \"Why Do Fools Fall in Love\". Although early single releases of \"Why Do Fools Fall in Love\" credit Frankie Lymon, Herman Santiago and Jimmy Merchant as co-writers, later releases and cover versions were attributed to Lymon and George Goldner. When Goldner sold his music companies to Morris Levy in 1959, Levy's name began appearing as co-writer of \"Why Do Fools Fall in Love\" in place of Goldner's. Lymon was never paid his songwriting royalties during his lifetime; one result of Emira Eagle's legal victory was that Lymon's estate would finally begin receiving monetary compensation from his hit song's success. In 1987, Herman Santiago and Jimmy Merchant, both then poor, sued Morris Levy for their songwriting credits.\n\nIn December 1992, the United States federal courts ruled that Santiago and Merchant were co-authors of \"Why Do Fools Fall in Love\". However, in 1996 the ruling was reversed by the Court of Appeals for the 2nd Circuit on the basis of the statute of limitations: copyright cases must be brought before a court within three years of the alleged civil violation, and Merchant and Santiago's lawsuit was not filed until 30 years later. Authorship of \"Why Do Fools Fall in Love\" currently remains in the names of Frankie Lymon and Morris Levy.\n\nLegacy\n\nAlthough their period of success was brief, Frankie Lymon & the Teenagers' string of hits were highly influential on the rock and R&B performers who followed them. Lymon's high-voiced sound is said to be a direct predecessor of the girl group sound, and the list of performers who name him as an influence include Michael Jackson, Ronnie Spector, Diana Ross, The Chantels, The Temptations, George Clinton, Smokey Robinson, Len Barry and The Beach Boys, among others. The performers most inspired by and derivative of Lymon and the Teenagers' style are The Jackson 5 and their lead singer and future superstar Michael Jackson. Motown founder Berry Gordy based much of the Jackson 5's sound on Frankie Lymon & the Teenagers' recordings, and the Teenagers are believed to be the original model for many of the other Motown groups he cultivated.\n\nLymon's music and story were re-introduced to modern audiences with Why Do Fools Fall in Love, a 1998 biographical film directed by Gregory Nava, also the director of the Selena biopic. Why Do Fools Fall in Love tells a comedic, fictionalized version of Lymon's story from the points of view of his three wives as they battle in court for the rights to his estate. The film stars Larenz Tate as Frankie Lymon, Halle Berry as Zola Taylor, Vivica A. Fox as Elizabeth Waters and Lela Rochon as Elmira Eagle. Why Do Fools Fall in Love was not a commercial success and met with mixed reviews; the film grossed a total of $12,461,773 during its original theatrical run.\n\nIn 1973, Lymon became known to a slightly younger generation than before with the release of American Graffiti,, which included \"Why Do Fools Fall in Love\" on its soundtrack.\n\nIn September 1979 at the Santa Barbara Bowl, Joni Mitchell performed a version of \"Why Do Fools Fall In Love\" which subsequently appeared on the release of her album of the concert entitled \"Shadows and Light\" the following September. During the opening mix of the album, Joni Mitchell also spliced sections of \"I'm Not A Juvenile Delinquent\" into the title track refrains.\n\nThe song \"Harlem Roulette\" by The Mountain Goats, off its 2012 album Transcendental Youth,, contains reference to Frankie Lymon, the song \"Seabreeze\" and Roulette Records. Frontman John Darnielle has stated that the song is about the last night of Lymon's life.\n\nFrankie Lymon and the Teenagers were inducted into the Rock and Roll Hall of Fame in 1993, and into the Vocal Group Hall of Fame in 2000.\n\nLymon was mentioned in the 1992 Stephen King short story \"You Know They Got a Hell of a Band\". Lymon is named as the one who cut off the waitress Sissy's finger for trying to help the protagonists, Mary and Clark Willingham, escape from the town of Rock & Roll Heaven, Oregon, who is inhabited by musicians like Janis Joplin, Otis Redding, Roy Orbison, and other musicians who died young.\n\nThe English Band Everything but the Girl on their 1991 Album \"Worldwide\" include the song Boxing and Pop Music which references Lymon throughout the song.\n\nSingles\n\nGee releases\n\n1956-01: [Gee 1002] \"Why Do Fools Fall in Love\" / \"Please Be Mine\" 1 (#1 on the R&B chart for 5 weeks)\n\n1956-04: [Gee 1012] \"I Want You to Be My Girl\" / \"I'm Not a Know-It-All\" 2 (#3 on R&B chart)\n\n1956-07: [Gee 1018] \"I Promise to Remember\" / \"Who Can Explain?\" (double-sided hit on R&B chart (#10 and #7))\n\n1956-09: [Gee 1022] \"The ABC's of Love\" / \"Share\" (#8 on R&B chart)\n\n1956-11: [Gee 1026] \"I'm Not a Juvenile Delinquent\" / \"Baby, Baby\"\n\n1957-04: [Gee 1032] \"Teenage Love\" / \"Paper Castles\"\n\n1957-05: [Gee 1035] \"Love Is a Clown / Am I Fooling Myself Again\"\n\n1957-06: [Gee 1036] \"Out in the Cold Again\" / \"Miracle in the Rain\" 5 (#10 on R&B chart)\n\n1957-07: [Gee 1039] \"Goody Goody\" / \"Creation of Love\" 3\n\n1957-12: [Gee 1046] \"Everything to Me\" / \"Flip Flop\" 4\n\nNotes\n\n1 Released as by \"The Teenagers\"\n\n² Early copies released as by \"The Teenagers featuring Frankie Lymon\"; billing on later pressings changed to \"Frankie Lymon & the Teenagers\"\n\n³ Both sides of this release are actually Frankie Lymon solo recordings.\n\n4 billed as \"The Teenagers\" (lead vocal by Billie Lobrano)\n\n5 Released as by \"The Teenagers featuring Frankie Lymon\"\n\nAlbum\n\n1956: [Gee 701] The Teenagers Featuring Frankie Lymon\n\nCompilations\n\n1986: Frankie Lymon and the Teenagers: For Collectors Only (Murray Hill 148)\n\nSingles\n\nRoulette releases\n\n1957: [Roulette 4026] \"My Girl\" / \"So Goes My Love\"\n\n1957: [Roulette 4035] \"Little Girl\" / \"It's Christmas Once Again\"\n\n1958: [Roulette 4044] \"Thumb Thumb\" / \"Footsteps\"\n\n1958: [Roulette 4068] \"Portable on My Shoulder\" / \"Mama Don't Allow It\" — 4/58\n\n1958: [Roulette 4093] \"Only Way to Love\" / \"Melinda\"\n\n1959: [Roulette 4128] \"Up Jumped a Rabbit\" / \"No Matter What You've Done\"\n\n1969: [Roulette 21095 \"\"/ \"1-20-12 Forever'\n\nGee release\n\n1959: [Gee 1052] \"Goody Good Girl\" / \"I'm Not Too Young to Dream\"\n\nRoulette releases\n\n1960: [Roulette 4257] \"Little Bitty Pretty One\" / \"Creation of Love\"\n\n1960: [Roulette 4283] \"Buzz Buzz Buzz\" / \"Waitin' in School\"\n\n1961: [Roulette 4348] \"Change Partners\" / \"So Young (And So in Love)\"\n\n1961: [Roulette 4391] \"Young\" / \"I Put the Bomp\" (featuring backing vocals by two members of The Delicates (Denise Ferri and Peggy Santiglia))\n\nLater releases\n\n1964: \"To Each His Own\" / \"Teacher, Teacher\" (20th Century Fox)\n\n1964: \"Somewhere\" / \"Sweet and Lovely\" (Columbia)\n\n1969: \"I'm Sorry\" / \"Seabreeze\" (Big Apple)\n\nAlbums\n\n1956: Frankie Lymon And The Teenagers - 1981 Re-issue Roulette Y2-116-RO (Japan) [Gee 701]\n\n1957: Frankie Lymon at the London Palladium (Roulette)\n\n1958: Rock & Roll with Frankie Lymon (Roulette)\n\n1994: Complete Recordings (Bear Family)"}]}