{"The Teenagers were composed of five boys, all of whom were in their mid-teens.": [{"url": "https://www.history.com/news/8-famous-child-prodigies", "page_content": "1. Wolfgang Amadeus Mozart\n\nImagno / Getty Images Mozart at age 7.\n\nThe Austrian-born wunderkind first took up the harpsichord when he was just 3 years old. He composed his first piece of published music at age 5, and by his teen years, he had already written several concertos, sonatas, operas and symphonies. Mozart and his sister Maria Anna—herself a musical prodigy—traveled widely through Europe exhibiting their talents in royal courts and public concerts. From Bavaria to Paris, audiences marveled at the boy wonder’s ability to improvise and play the piano blindfolded or with one hand crossed over the other. During a 1764 stopover in London, he was even tested and examined by a British lawyer and naturalist named Daines Barrington, who was awestruck by the 8-year-old’s ability to sight-read unfamiliar music “in a most masterly manner.” Mozart would eventually grow into one of Europe’s most celebrated and prolific composers. Before his untimely death at age 35, he wrote more than 600 pieces of music.\n\n2. Enrico Fermi\n\nHistorical / Contributor/ Getty Images Enrico Fermi in his laboratory.\n\nBefore his work on radioactivity won him the Nobel Prize and helped usher in the nuclear age, Enrico Fermi was considered a mathematics and physics prodigy. The Italy native showed signs of having a photographic memory as a boy, and by age 10 he was spending his free time mulling over geometric proofs and building electric motors. After his brother died unexpectedly in 1915, 13-year-old Enrico dealt with his grief by burying himself in books on trigonometry, physics and theoretical mechanics. He then applied to the University of Pisa in 1918, wowing the admissions panel with a doctoral-level essay that solved the partial differential equation of a vibrating rod. Fermi achieved his post-secondary degree from the school several years early at the age of just 21. He later conducted groundbreaking experiments in neutron bombardment and nuclear chain reactions before becoming one of the lead physicists on the Manhattan Project—the secret research program that developed the atomic bomb.\n\n3. Sor Juana Inés de la Cruz\n\nBorn in Mexico in 1651, Sor Juana Inés de la Cruz learned to read as a toddler and quickly blazed through all the books in her grandfather’s library. Despite being denied a formal education because of her gender, she began writing religious poetry at age 8 and later taught herself Latin, supposedly mastering it in just 20 lessons. By her adolescence, she had also studied Greek logic and learned an Aztec language called Nahuatl. Juana’s reputation for genius later won her a place as a lady-in-waiting at the viceroy’s court in Mexico City. When she was 17, she was famously tested by a panel of 40 university professors, all of whom were shocked by her deep knowledge of philosophy, mathematics and history. The former child prodigy entered a convent at age 20 and spent the rest of her life as a cloistered nun. She continued her studies, however, and eventually established herself as one of the 17th century’s most popular authors of drama, poetry and prose. Her image now appears on the 200-peso bill in Mexico.\n\n4. Pablo Picasso\n\nAPI / Gamma-Rapho / Getty Images <em>Picasso at age 10.</em>\n\nAs the son of a painter, Pablo Picasso had a brush in his hand from an early age. The future art legend could reportedly draw before he could talk, and his mother claimed that when he finally spoke, his first words were to ask for a pencil. Picasso made his first oil painting when he was 9 years old. His skills soon surpassed those of his father, and at age 14, he was admitted to a prestigious Barcelona art school. Just a year later, he completed “First Communion,” an astonishingly mature work that was displayed in a public exhibition. The painting was among the first of the more than 22,000 artworks that Picasso would produce in his eight-decade career. “When I was a child, my mother said to me, ‘If you become a soldier, you’ll be a general. If you become a monk you’ll end up as the pope,’” he later said. “Instead, I became a painter and wound up as Picasso.”\n\n5. Blaise Pascal\n\nFine Art Images / Heritage Images / Getty Images Portrait Of The Philosopher Blaise Pascal.\n\nBorn in 1623 in France, Blaise Pascal spent his youth being privately tutored at home by his father. The elder Pascal banished mathematics texts from the house to ensure the boy first focused on languages, but by age 12, young Blaise had secretly invented his own terminology and independently discovered nearly all the geometric proofs of Euclid. His mathematical genius only grew from there. At 16, he produced an essay on conic sections so advanced that the famed philosopher Rene Descartes was convinced his father must have ghostwritten it; by 19, he had designed and built a mechanical calculator known as the “Pascaline.” Pascal went on to publish papers and conduct experiments on everything from fluid mechanics and perpetual motion to atmospheric pressure and the philosophy of religion. Before his death at the age of 39, he developed his famous “Pascal’s Wager,” which uses probability theory to argue for belief in God.\n\n6. Arthur Rimbaud\n\nHistory / Universal Images Group / Getty Images Painting of Arthur Rimbaud.\n\nVagabond poet Arthur Rimbaud is often held up as one of history’s few examples of a literary prodigy. An award-winning student, the Frenchman published his first work in 1870 at the age of 15 before running away to Paris and making his name as a writer and rabble-rouser. Rimbaud produced his early masterpiece “The Drunken Boat” when he was just 16. He followed it up three years later with “A Season in Hell,” a hallucinatory prose poem that helped set the stage for the surrealist movement. Along the way, he engaged in a drug and alcohol-fueled love affair with fellow poet Paul Verlaine and won plaudits from the likes of Victor Hugo, who supposedly dubbed him “an infant Shakespeare.” While Rimbaud’s work would later influence Jack Kerouac, Bob Dylan and many others, the teen phenom stopped writing altogether at age 20. He later roamed through the Middle East and Africa and worked as a trader and gunrunner before dying from cancer at age 37.\n\n7. Clara Schumann\n\nHistory & Art Images / Getty Images Young Clara Schumann\n\nGerman-born musician Clara Schumann didn’t speak until age 4, but by the time she was 7, she was already spending up to three hours a day mastering the piano. She began composing her own pieces at 10 and made her concert debut in 1830 at the age of 11. In 1831, Schumann embarked on the first of several tours of Europe, where she won acclaim from the likes of Chopin and Liszt and astonished audiences with her ability to play from memory. The young virtuoso later married fellow composer Robert Schumann in 1840 but defied convention by continuing to write and perform even while raising her children. By the time she died in 1896, Schumann had spent six decades as a professional musician and played more than 1,300 public concerts.\n\n8. Jean-Francois Champollion\n\nDan Kitwood / Getty Images The Rosetta Stone.\n\nThe secrets of ancient Egyptian hieroglyphics might never have been revealed if not for the former child prodigy Jean-Francois Champollion. Born in France in 1790, he displayed a natural talent for languages from an early age and went on to master Latin, Greek, Arabic, Hebrew, Syriac, Sanskrit and Coptic by his mid-teens. Champollion presented his first academic paper at 16, and by 19 he was already teaching history at a school in Grenoble. In the early 1820s, the young polyglot turned his attention toward deciphering the mysteries of the Rosetta Stone. He soon became the first philologist to recognize that the symbols of ancient Egyptian hieroglyphics were both pictographic and alphabetical—a breakthrough that proved to be the key to cracking the code of a long-lost language."}, {"url": "https://www.classical-music.com/features/articles/the-young-composers-who-wrote-symphonies-in-their-teenage-years/", "page_content": "Wolfgang Amadeus Mozart (1756-1791)\n\nMozart is undoubtedly the most impressive child prodigy of them all. His 13 childhood symphonies were written between 1764 and 1771, and were technically sound and showed obvious musical promise. Despite the works written in these early years are diligent and precise, it’s important to note the potentially overwhelming artistic input of his father Leopold during this period. How much Mozart’s father helped his son is difficult to judge, but it isn’t unreasonable to think he would have taken a strong proprietary interest in his early works.\n\nAdvertisement\n\nFranz Schubert (1797-1828)\n\nSchubert began writing his Symphony in D as a 14-year-old boy, but – like five other incomplete Schubert symphonies, was never finished. Just two years later, he penned his first official symphony. By the time he turned 19, Schubert had already written six symphonies.\n\nFelix Mendelssohn (1809-1847)\n\nBy the time he turned 15, Mendelssohn had completed his First Symphony premiering at a soiree to celebrate his sister Fanny’s 19th birthday. He conducted the piece upon his first trip to England in 1829, with the London Philharmonic Society. The reception he received was a resounding success and led to a popular following in Britain. This visit to England and later Scotland would inspire Mendelssohn to compose his Third Symphony taking more than a decade to complete.\n\nCamille Saint-Saëns (1835-1921)\n\nSaint-Saëns gave his first piano recital at the age of eleven before studying organ performance at Paris Conservatory aged 13. In 1851, he began formal composition lessons under Fromental Halévy who had also taught Bizet and Gounod. By the time he was 20, his First Symphony had received its first performance and even when he turned 18, he had already completed his second.\n\nGeorges Bizet (1838-1875)\n\nBizet’s musical gifts were apparent so early that he enrolled at the Paris Conservatoire before he turned ten. His Symphony in C was written in 1855 at the age of 17, with its fluid counterpoint and orchestral mastery reminiscent of works by Mendelssohn. Bizet showed no interest in this early work being performed or published; it was never played in his lifetime. Its fusion of Viennese classical style and French melody gives it a worthy ranking in Bizet’s library.\n\nAlexander Glazunov (1865-1936)\n\nGlazunov penned his First Symphony at just 16, when he was studying under fellow Russian composer Rimsky-Korsakov. The so-called Slavonian Symphony proven to be an undeniable success, with an audience astonished to see a teenage boy bow in his school uniform. Glazunov did however receive some guidance from Balakirev, writing in his memoirs, “I composed and orchestrated the slow movement of the First Symphony in the summer of 1881. In addition, I played that passage to Balakirev, who approved of it in general but advised me to add something after the presentation of the two themes, before the repetition of the beginning.\"\n\nDmitri Shostakovich (1906-1975)\n\nShostakovich composed his inaugural symphony as a graduation piece from Petrograd Conservatory, which he finished by the time he was 19. The premiere was organised by the Conservatory’s director Alexander Glazunov, a child prodigy in his own right, and took place in the same hall 44 years after the premiere of Glazunov’s own First Symphony. It was performed by the Leningrad Philharmonic Orchestra under the direction of Nikolay Malko.\n\nOliver Knussen (1952-2018)\n\nKnussen studied composition with John Lambert and Gunther Schuller at Tanglewood in the US. He was only 15 years old when he composed his First Symphony and later conducted its premiere with the London Symphony Orchestra at the Royal Festival Hall in 1968. In this work, Knussen displayed a wide range of influences including Britten, Berg and other mid-century symphonists.\n\nJay Greenberg (b. 1991)\n\nJay Greenberg is an American composer who first started playing the cello when he was two before attending the Julliard School in 2002 at the age of 12. By 2005, Greenberg had written five symphonies. His first album was released on Sony Classical and featured the London Symphony Orchestra performing his Fifth Symphony. Unlike many of the other aforementioned child prodigies, Greenberg primarily composes on a computer using musical notation software.\n\nAdvertisement\n\nWords by: Tom Fletcher"}, {"url": "https://www.history.com/topics/1980s/central-park-five", "page_content": "When Trisha Meili’s body was discovered in New York City’s Central Park early in the morning on April 20, 1989, she had been so badly beaten and repeatedly raped that she remained in a coma for nearly two weeks and retained no memory of the attack.\n\nThe brutal assault of the 28-year-old white investment banker, who had been out for a jog the night before, led to widespread public outcry and the quick arrest and subsequent conviction of five black and Latino teens—Antron McCray, 15, Kevin Richardson, 15, Yusef Salaam, 15, Raymond Santana, 14, and Korey Wise, 16—who came to be known as the Central Park Five.\n\nBut, in 2002, after serving sentences that ranged from six to 13 years for what then-New York City Mayor Ed Koch called “the crime of the century,” new DNA evidence and a confession proved convicted rapist Matias Reyes was the true, lone culprit. The charges against the five men were vacated and they eventually received at $41 million settlement.\n\nNY Daily News Archive via Getty Images The New York Daily News front page on April 21, 1989.\n\nThe attack ignited a media firestorm, highlighting racial tensions in the city and playing into preconceived notions about African-American youth. When the five former teens convicted in the case were finally exonerated, many community leaders decried the miscarriage of justice that sent the Central Park Five to prison. The case became a flashpoint for illustrating racial disparities in sentencing and the inequities at the heart of the criminal justice system.\n\nAttackers Described as ‘Wolf Pack’\n\nMeili’s rape and attack was so severe, she lost 75 percent of her blood, suffering a severe skull fracture among other injuries. The woman, identified in the media as the Central Park Jogger until she made her name public in 2003, had been bludgeoned with a rock, tied up, raped and left for dead.\n\n“The woman is bleeding from five deep cuts across her forehead and scalp; patients who lose this much blood are generally dead,” Meili writes in her 2003 book, I am the Central Park Jogger, of the attack. “Her skull has been fractured, and her eye will later have to be put back in its place. … There is extreme swelling of the brain caused by the blows to the head. The probable result is intellectual, physical, and emotional incapacity, if not death. Permanent brain damage seems inevitable.”\n\nWith the attack occurring during a particularly violent era in New York City—1,896 homicides, a record at the time, took place a year earlier in 1988—police officers were quick to find somewhere to point the blame.\n\nAn April 21, 1989 story in the New York Daily News reported that on the night of the crime, a 30-person gang, or so-called “wolf pack” of teens launched a series of attacks nearby, including assaults on a man carrying groceries, a couple on a tandem bike, another male jogger and a taxi driver. Then, the News reported “at least a dozen youths grabbed the woman and dragged her off the path through heavy underbrush and trees, down a ravine toward a small body of water known as The Loch. It was there, 200 feet north of the transverse, that she was beaten and assaulted, police said. ‘They dragged her down like she was an animal,’ one police official said.”\n\nAccording to New York magazine, police told reporters the teens used the word “wilding” in describing their acts and “that while in a holding cell the suspects had laughed and sung the rap hit ‘Wild Thing.’”\n\nA 'Media Tsunami'\n\nThe crime was splashed across front pages for months, with the teens depicted as symbols of violence and called “bloodthirsty,” “animals,” “savages” and “human mutations,” the Poynter Institute, a nonprofit journalism and research organization, reports.\n\nNewspaper columnists joined in. The New York Post’s Pete Hamill wrote that the teens hailed “from a world of crack, welfare, guns, knives, indifference and ignorance…a land with no fathers…to smash, hurt, rob, stomp, rape. The enemies were rich. The enemies were white.”\n\nAdding fuel to the fire, weeks after the attack, in May 1989, real estate developer (and future U.S. president) Donald Trump took out full-page ads in The New York Times, the New York Daily News, the New York Post and New York Newsday with the headline, \"Bring Back The Death Penalty. Bring Back Our Police!\"\n\n“It was a media tsunami,” former New York Daily News police bureau chief David Krajicek tells Poynter. “It was so competitive. The city desk absolutely demanded that we come up with details that other reporters didn’t have.”\n\nJames Estrin/The New York Times/Redux The five defendants in the Central Park jogger case, behind the table, in court in New York, February 23, 1990.\n\nArrest and Trial of ‘The Central Park Five’\n\nRichardson and Santana, both part of the alleged “wolf pack,” were arrested for “unlawful assembly” on April 19, before police learned of the jogger’s attack. They were detained for hours before their parents were eventually called. Meili was found early the next morning while the teens were still at the precinct, and a link was made. Korey, Salaam and McCray were soon brought in for questioning.\n\n“Five were arrested shortly before 11 p.m. on Wednesday at 102d Street and Central Park West in connection with the pipe attack on the male jogger,” The New York Times reported the day after Meili was found. “Three were charged as juveniles with second-degree assault and unlawful assembly, and two were charged with unlawful assembly and released that night to their parents.”\n\nFour of the five teens, all from Harlem, confessed on videotape following hours of interrogation. The boys later recanted and plead not guilty, saying their confessions had been coerced.\n\n“When we were arrested, the police deprived us of food, drink or sleep for more than 24 hours,” Salaam wrote in the Washington Post years later in 2016. “Under duress, we falsely confessed. Though we were innocent, we spent our formative years in prison, branded as rapists.”\n\nDespite inconsistencies in their stories, no eye witnesses and no DNA evidence linking them to the crime, the five were convicted in two trials in 1990. McCray, Salaam and Santana were found guilty of rape, assault, robbery and riot. Richardson was found guilty of attempted murder, rape, assault and robbery. Korey was found guilty of sexual abuse, assault and riot. They spent between six and 13 years behind bars.\n\nMichael Nagle/The New York Times/Redux (L-R) Antron McCray, Raymond Santana, Kevin Richardson, Yusef Salaam, and <em>Korey Wise</em>, all of whom served prison sentences after being wrongly convicted in the Central Park jogger case, pictured in New York in 2012.\n\nCharges Vacated After Shocking Confession\n\nIn 2002 a convicted serial rapist and murderer already serving time, confessed to the Meili attack. Matias Reyes was a positive DNA match to evidence found at the crime scene. On December 19, 2002, a New York Supreme Court justice vacated the convictions of the five previously accused men.\n\nIn 2003, the Central Park Five filed a civil lawsuit against New York City for malicious prosecution, racial discrimination and emotional distress. City officials fought the case for more than a decade, before finally settling for $41 million dollars.\n\nAccording to The New York Times, the payout equaled about $1 million for each year of imprisonment, with four men serving about seven years and Wise serving about 13.\n\nWhere Are the Central Park 5 Now?\n\nIn the years since their release, the five men accused in the Central Park case have moved on with their lives. Richardson lives in New Jersey with his wife and two daughters. He works as an advocate for criminal justice reform. McCray lives in Georgia with his wife and six children. Santana also lives in Georgia with his teenage daughter and, in 2018, Santana started his own clothing company called Park Madison NYC. Wise lives in New York City, where he works as a public speaker and criminal justice reform advocate. Salaam is a published poet, public speaker and criminal justice reform advocate. He lives in George and is a father to 10 children.\n\nSources\n\n“The Central Park Five: About the Case,” by Ken Burns, November 23, 2012, PBS\n\n“The Central Park Five, Criminal Justice, and Donald Trump,” by Jelani Cobb, April 19, 2019, New Yorker\n\n“Central Park Revisited,” by Chris Smith, October 21, 2002, New York magazine"}, {"url": "https://www.bbc.com/future/article/20220124-why-teens-arent-what-they-used-to-be", "page_content": "Before World War Two, the term teenager (or teen-ager) had occasionally been used, but it was only in the late 1940s and 1950s that it became more common. Around this time, a number of different forces converged to make that happen.\n\nIn rich countries, it became much more likely for a young person to stay in school for their teenage years. In the late 1940s, schooling in the UK was made compulsory up to the age of 15. And in the US, high school graduation rates grew from less than 10% at the start of the century to around 60% by the mid-1950s.\n\nPost-World War Two, historians also note that social attitudes towards the rights of young people shifted in many Western nations: the sense that young people had a duty to serve their parents weakened, and their own wishes and values began to be listened to more.\n\nAnd one sector of society that was listening to these needs the most? Commerce. In the 1950s, companies realised that teenagers could also be influencers. They were capable of setting trends and spreading fashions, and therefore could be marketed to for great profit. As a writer for the New Yorker noted in 1958: \"To some extent, the teenage market – and, in fact, the very notion of the teenager – has been created by the businessmen who exploit it.\"\n\nBack then it was all about capitalising on rebellion, hot-rods and rock n' roll. Today it's TikTok and… well, I wouldn't know, since I'm 41 years old. But the point is that the perception of teenagers as cool, trend-setting and influential was – and still is – just as much a creation of commerce and media as a reflection of reality. Teenage music, fashion and language ripples across the rest of society, supercharged by industries established to profit from them."}, {"url": "https://www.history.com/topics/great-depression/scottsboro-boys", "page_content": "The Scottsboro Boys were nine Black teenagers falsely accused of raping two white women aboard a train near Scottsboro, Alabama, in 1931. The trials and repeated retrials of the Scottsboro Boys sparked an international uproar and produced two landmark U.S. Supreme Court verdicts, even as the defendants were forced to spend years battling the courts and enduring the harsh conditions of the Alabama prison system.\n\nWho Were the Scottsboro Boys?\n\nBy the early 1930s, with the nation mired in the Great Depression, many unemployed Americans would try and hitch rides aboard freight trains to move around the country searching for work.\n\nOn March 25, 1931, after a fight broke out on a Southern Railroad freight train in Jackson County, Alabama, police arrested nine Black youths, ranging in age from 13 to 19, on a minor charge. But when deputies questioned two white women, Ruby Bates and Victoria Price, they accused the boys of raping them while onboard the train.\n\nThe nine teenagers—Charlie Weems, Ozie Powell, Clarence Norris, brothers Andrew and Leroy Wright, Olen Montgomery, Willie Roberson, Haywood Patterson and Eugene Williams—were transferred to the local county seat, Scottsboro, to await trial.\n\nOnly four of them had known each other before their arrest. As news spread of the alleged rape (a highly inflammatory charge given the Jim Crow laws in the South), an angry white mob surrounded the jail, leading the local sheriff to call in the Alabama National Guard to prevent a lynching.\n\nInitial Trials and Appeals (1931-32)\n\nIn the first set of trials in April 1931, an all-white, all-male jury quickly convicted the Scottsboro Boys and sentenced eight of them to death.\n\nThe trial of the youngest, 13-year-old Leroy Wright, ended in a hung jury when one juror favored life imprisonment rather than death. A mistrial was declared, and Leroy Wright would remain in prison until 1937 awaiting the final verdict on his co-defendants.\n\nAt this point, the International Labor Defense (ILD), the legal wing of the American Communist Party, took on the boys’ case, seeing its potential to galvanize public opinion against racism. That June, the court granted the boys a stay of execution pending an appeal to the Alabama Supreme Court.\n\nThe ILD spearheaded a national campaign to help free the nine young men, including rallies, speeches, parades and demonstrations. Letters streamed in from people—Communists and non-Communists, white and Black—protesting the guilty verdicts.\n\nBut in March 1932, the Alabama Supreme Court upheld the convictions of seven of the defendants; it granted Williams a new trial, as he was a minor at the time of his conviction.\n\nPowell v. Alabama\n\nIn November 1932, the U.S. Supreme Court ruled in Powell v. Alabama that the Scottsboro defendants had been denied the right to counsel, which violated their right to due process under the 14th Amendment.\n\nThe Supreme Court overturned the Alabama verdicts, setting an important legal precedent for enforcing the right of Black Americans to adequate counsel, and remanded the cases to the lower courts.\n\nThe second round of trials began in the circuit court in Decatur, Alabama, 50 miles west of Scottsboro, under Judge James Horton. One of the boys’ accusers, Ruby Bates, recanted her initial testimony and agreed to testify for the defense.\n\nBut even with her revised testimony and evidence from the initial medical examination of the women that refuted the rape charge, another all-white jury convicted the first defendant, Patterson, and recommended the death penalty.\n\nHaving reviewed the evidence and met privately with one of the medical examiners, Judge Horton suspended the death sentence and granted Patterson a new trial. (The judge would be rewarded for this brave action by losing his bid for reelection the following year.)\n\nProsecutors got the cases in front of a more sympathetic judge, and both Patterson and Norris were retried, convicted and sentenced to death in late 1933. With prominent defense attorney Samuel Leibowitz arguing the case for the ILD, the Alabama Supreme Court unanimously denied the defense’s motion for new trials, and the case headed for a second hearing in front of the U.S. Supreme Court.\n\nNorris v. Alabama\n\nIn January 1935, the Supreme Court again overturned the guilty verdicts, ruling in Norris v. Alabama that the systematic exclusion of Blacks on Jackson Country jury rolls denied a fair trial to the defendants, and suggesting that the lower courts review Patterson’s case as well.\n\nThis second landmark decision in the Scottsboro Boys case would help integrate future juries across the nation. The National Association for the Advancement of Colored People (NAACP) and other civil rights groups joined the ILD that year to form the Scottsboro Defense Committee, which reorganized the defense effort for the next set of retrials.\n\nEarly in 1936, Patterson was convicted for a fourth time, but sentenced to 75 years in prison. The day after the verdict, Ozie Powell was shot in the head after attacking a deputy sheriff with a knife; both men survived.\n\nAfter the Alabama Supreme Court upheld Patterson’s conviction in June, and Norris’s third trial ended in another death sentence, Andy Wright and Weems were both convicted of rape and sentenced to long prison terms as well.\n\nThrough negotiations with the defense, prosecutors agreed to drop rape charges against Powell, but he was convicted of assaulting the deputy sheriff and sentenced to 20 years.\n\nThey also dropped rape charges against the four remaining defendants—Montgomery, Roberson, Williams and Leroy Wright—and all four were released. Alabama Governor Bibb Graves commuted Norris’ sentence to life imprisonment in 1938, and denied pardon applications by all five convicted defendants that same year.\n\nScottsboro Boys Legacy\n\nAlabama officials eventually agreed to let four of the convicted Scottsboro Boys—Weems, Andy Wright, Norris and Powell—out on parole.\n\nAfter escaping from prison in 1948, Patterson was picked up in Detroit by the FBI, but the Michigan governor refused Alabama’s efforts to extradite him. Convicted of manslaughter after a barroom brawl in 1951, Patterson died of cancer in 1952.\n\nThe trials of the Scottboro Boys, the two Supreme Court verdicts they produced and the international uproar over their treatment helped fuel the rise of the civil rights movement later in the 20th century, and left a lasting imprint on the nation’s legal and cultural landscape.\n\nHarper Lee\n\nAuthor Harper Lee reportedly drew on the boys’ experience when she wrote her classic novel To Kill A Mockingbird, and over the years the case has inspired numerous other books, songs, feature films, documentaries and even a Broadway musical.\n\nClarence Norris, who received a pardon from Governor George Wallace of Alabama in 1976, would outlive all of the other Scottsboro Boys, dying in 1989 at the age of 76.\n\nIn 2013, the Alabama Board of Pardons and Paroles voted unanimously to issue posthumous pardons to Patterson, Weems and Andy Wright, bringing a long-overdue end to one of the most notorious cases of racial injustice in U.S. history.\n\nHISTORY Vault Stream thousands of hours of acclaimed series, probing documentaries and captivating specials commercial-free in HISTORY Vault START FREE TRIAL\n\nSources\n\nDaren Salter, Scottsboro Trials, Encyclopedia of Alabama.\n\nScottsboro: An American Tragedy, PBS.\n\nHistory, Scottsboro Boys Museum.\n\nAlan Blinder, “Alabama Pardons 3 ‘Scottsboro Boys’ After 80 Years,” New York Times, November 21, 2013."}, {"url": "https://www.who.int/news-room/fact-sheets/detail/adolescent-mental-health", "page_content": "Introduction\n\nOne in six people are aged 10-19 years. Adolescence is a unique and formative time. Physical, emotional and social changes, including exposure to poverty, abuse, or violence, can make adolescents vulnerable to mental health problems. Protecting adolescents from adversity, promoting socio-emotional learning and psychological well-being, and ensuring access to mental health care are critical for their health and well-being during adolescence and adulthood.\n\nGlobally, it is estimated that 1 in 7 (14%) 10-19 year-olds experience mental health conditions(1), yet these remain largely unrecognized and untreated.\n\nAdolescents with mental health conditions are particularly vulnerable to social exclusion, discrimination, stigma (affecting readiness to seek help), educational difficulties, risk-taking behaviours, physical ill-health and human rights violations.\n\nMental health determinants\n\nAdolescence is a crucial period for developing social and emotional habits important for mental well-being. These include adopting healthy sleep patterns; exercising regularly; developing coping, problem-solving, and interpersonal skills; and learning to manage emotions. Protective and supportive environments in the family, at school and in the wider community are important.\n\nMultiple factors affect mental health. The more risk factors adolescents are exposed to, the greater the potential impact on their mental health. Factors that can contribute to stress during adolescence include exposure to adversity, pressure to conform with peers and exploration of identity. Media influence and gender norms can exacerbate the disparity between an adolescent’s lived reality and their perceptions or aspirations for the future. Other important determinants include the quality of their home life and relationships with peers. Violence (especially sexual violence and bullying), harsh parenting and severe and socioeconomic problems are recognized risks to mental health.\n\nSome adolescents are at greater risk of mental health conditions due to their living conditions, stigma, discrimination or exclusion, or lack of access to quality support and services. These include adolescents living in humanitarian and fragile settings; adolescents with chronic illness, autism spectrum disorder, an intellectual disability or other neurological condition; pregnant adolescents, adolescent parents, or those in early or forced marriages; orphans; and adolescents from minority ethnic or sexual backgrounds or other discriminated groups.\n\nEmotional disorders\n\nEmotional disorders are common among adolescents. Anxiety disorders (which may involve panic or excessive worry) are the most prevalent in this age group and are more common among older than among younger adolescents. It is estimated that 3.6% of 10-14 year-olds and 4.6% of 15-19 year-olds experience an anxiety disorder. Depression is estimated to occur among 1.1% of adolescents aged 10-14 years, and 2.8% of 15-19-year-olds. Depression and anxiety share some of the same symptoms, including rapid and unexpected changes in mood.\n\nAnxiety and depressive disorders can profoundly affect school attendance and schoolwork. Social withdrawal can exacerbate isolation and loneliness. Depression can lead to suicide.\n\nBehavioural disorders\n\nBehavioural disorders are more common among younger adolescents than older adolescents. Attention deficit hyperactivity disorder (ADHD), characterized by difficulty paying attention, excessive activity and acting without regard to consequences, occurs among 3.1% of 10-14 year-olds and 2.4% of 15-19 year-olds(1). Conduct disorder (involving symptoms of destructive or challenging behaviour) occurs among 3.6% of 10-14 year-olds and 2.4% of 15-19 year-olds(1). Behavioural disorders can affect adolescents’ education and conduct disorder may result in criminal behaviour.\n\nEating disorders\n\nEating disorders, such as anorexia nervosa and bulimia nervosa, commonly emerge during adolescence and young adulthood. Eating disorders involve abnormal eating behaviour and preoccupation with food, accompanied in most instances by concerns about body weight and shape. Anorexia nervosa can lead to premature death, often due to medical complications or suicide, and has higher mortality than any other mental disorder.\n\nPsychosis\n\nConditions that include symptoms of psychosis most commonly emerge in late adolescence or early adulthood. Symptoms can include hallucinations or delusions. These experiences can impair an adolescent’s ability to participate in daily life and education and often lead to stigma or human rights violations.\n\nSuicide and self-harm\n\nSuicide is the fourth leading cause of death in older adolescents (15-19 years)(2). Risk factors for suicide are multifaceted, and include harmful use of alcohol, abuse in childhood, stigma against help-seeking, barriers to accessing care and access to means of suicide. Digital media, like any other media, can play a significant role in either enhancing or weakening suicide prevention efforts.\n\nRisk-taking behaviours\n\nMany risk-taking behaviours for health, such as substance use or sexual risk-taking, start during adolescence. Risk-taking behaviours can be an unhelpful strategy to cope with emotional difficulties and can severely impact an adolescent’s mental and physical well-being.\n\nWorldwide, the prevalence of heavy episodic drinking among adolescents aged 15­-19 years was 13.6% in 2016, with males most at risk(3).\n\nThe use of tobacco and cannabis are additional concerns. Many adult smokers had their first cigarette prior to the age of 18 years. Cannabis is the most widely used drug among young people with about 4.7% of 15-16 years-olds using it at least once in 2018(4).\n\nPerpetration of violence is a risk-taking behaviour that can increase the likelihood of low educational attainment, injury, involvement with crime or death. Interpersonal violence was ranked among the leading causes of death of older adolescent boys in 2019(5).\n\nPromotion and prevention\n\nMental health promotion and prevention interventions aim to strengthen an individual's capacity to regulate emotions, enhance alternatives to risk-taking behaviours, build resilience for managing difficult situations and adversity, and promote supportive social environments and social networks.\n\nThese programmes require a multi-level approach with varied delivery platforms – for example, digital media, health or social care settings, schools or the community – and varied strategies to reach adolescents, particularly the most vulnerable.\n\nEarly detection and treatment\n\nIt is crucial to address the needs of adolescents with mental health conditions. Avoiding institutionalization and over-medicalization, prioritizing non-pharmacological approaches, and respecting the rights of children in line with the United Nations Convention on the Rights of the Child and other human rights instruments are key for adolescents’ mental health.\n\nWHO response\n\nWHO works on strategies, programmes and tools to assist governments in responding to the health needs of adolescents.\n\nFor example, the Helping Adolescents Thrive (HAT) Initiative is a joint WHO-UNICEF effort to strengthen policies and programmes for the mental health of adolescents. More specifically, the efforts made through the Initiative are to promote mental health and prevent mental health conditions. They are also intended to help prevent self-harm and other risk behaviours, such as harmful use of alcohol and drugs, that have a negative impact on the mental ̶ and physical ̶ health of young people.\n\nWHO has also developed a module on Child and Adolescent Mental and Behavioural Disorders as part of the mhGAP Intervention Guide 2.0. This Guide provides evidence-based clinical protocols for the assessment and management of a range of mental health conditions in non-specialized care settings.\n\nFurthermore, WHO is developing and testing scalable psychological interventions to address emotional disorders of adolescents, and guidance on mental health services for adolescents.\n\nWHO’s Regional Office for the Eastern Mediterranean has developed a mental health training package for educators for improved understanding of the importance of mental health in the school setting and to guide the implementation of strategies to promote, protect and restore mental health among their students. It includes training manuals and materials to help scale up the number of schools promoting mental health."}, {"url": "https://www.womenshealthmag.com/life/a27394351/central-park-five-true-story/", "page_content": "Ava DuVernay’s Netflix series, When They See Us, is based on the true story of the “Central Park Five.”\n\nFive boys were wrongfully accused and convicted of raping and beating a white woman in 1989.\n\nThe men have since been exonerated of those crimes and are now in their mid-forties.\n\n\n\nLast May, Ava DuVernay shed new light on the 30-year-old case of the Central Park Five with her Netflix miniseries, When They See Us. The scripted series is based on the true story of the “Central Park Five,” a group of five teenagers wrongly accused and convicted of a crime they didn't commit. Now, they're known as the “Exonerated Five,” since the real assailant was found in 2002.\n\nOver the past two weeks, the miniseries has become one of Netflix's most-watched shows, won a Peabody award, and celebrated its one-year anniversary.\n\nBut before that, DuVernay's production company, Array Now, launched Array 101, an educational resource for viewers of When They See Us, to help understand the historical context and work through their emotional responses to it. \"So many people came up to me and were like, 'I cried' and 'I couldn’t finish it,'\" the director told Gayle King when discussing Array 101. “I think what I failed to do and many people in Hollywood failed to do and other people failed to do was connect the dots between the thing you make and the people who are watching it, particularly young people.”\n\nThe show is an emotional one, because the case was a highly-publicized example of how systemic racism and implicit bias led to the boys' wrongful conviction and incarceration—which happens with startling frequency. (The Innocence Project exists for this very reason.)\n\nDuVernay signed on to direct the film after connecting with Raymond Santana, one of the Exonerated Five, over Twitter. \"I was familiar with the story from growing up, but also I’d watched the Sarah Burns documentary [about it]. In his DMs, I said, 'No one has your story?' And he said, 'No,'\" DuVernay told Rolling Stone. \"I was just fascinated by the case, not really thinking I’d ever make a film. But once I met him and then gradually met all of the other men, I felt like I had to make it.\"\n\nBefore you tune in to the show, here's everything you need to know about the real Central Park Five:\n\nWho are the Central Park Five?\n\nIn 1989, Antron McCray, Kevin Richardson, Yusef Salaam, Raymond Santana Jr., and Korey Wise (who later changed his name to Kharey) were in Central Park on April 19—the night a white female jogger, Trisha Meili, was raped and severely beaten. All five were Black or Latinx teenagers from Harlem between the ages of 14 and 16.\n\nWhat happened to the Central Park Five?\n\nSimply put, they were wrongly accused—and convicted—of raping and beating Meili, then a 28-year-old investment banker who fell into a coma after the attack. When she woke up, she had no memory of the sexual assault. By that time, prosecutors had already interrogated McCray, Richardson, Salaam, Santana Jr., and Wise, and coerced false confessions from four of the five teenagers, according to the Exonerated Five's lawyers.\n\nThe last teenager, Yusef Salaam, might have confessed, too, if his mother had not interrupted the interrogation before he could sign a formal statement, The New York Times reported. Still, the court allowed a detective to testify that Salaam had confessed to taking part in the attack.\n\nWhy did the Central Park Five confess to a crime they didn’t commit?\n\nIt happens—a lot, actually. According to the Innocence Project, 28 percent of wrongful conviction cases that are exonerated using DNA evidence in the U.S. involve false confessions. That percentage jumps to 33 percent when the false confessors are 18 years old or younger at the time of arrest. (Btw, the Innocence Project helped the Central Park Five get exonerated.)\n\nAccording to The New York Times, the teenagers were interrogated for hours on end, with no lawyers present and often without the presence of a parent or guardian, either. The publication also reported that “they were denied food, drink, and sleep over many hours.”\n\nWatch the When They See Us cast talk about their real-life counterparts:\n\nThe young men were all led to believe that they only had one way out—telling the police what they wanted to hear. So McCray, Richardson, Santana Jr., and Wise all gave statements admitting to being present at the attack, but blaming others for the sexual assault. They believed saying this would not incriminate them (it did).\n\nThe false confessions, perhaps unsurprisingly, were full of inconsistencies. The Central Park Five’s formal statements “differed from one another on the specific details of virtually every major aspect of the crime—who initiated the attack, who knocked the victim down, who undressed her, who struck her, who held her, who raped her, what weapons were used in the course of the assault and when in the sequence of events the attack took place,” the district attorney’s office learned, according to The New York Times.\n\nWas there any other evidence to convict the Central Park Five?\n\nNope. The “confessions” were the only real evidence used in the case. None of the Central Park Five's DNA matched the single DNA sample (in the form of semen) found on Meili.\n\nNonetheless, the district attorney’s office had already created a narrative that McCray, Richardson, Salaam, Santana Jr., and Wise raped and attacked Meili—and stuck to it through two trials and several appeals.\n\nWhat happened during the Central Park Five trials?\n\nThe prosecutors presented the Central Park Five’s confessions as evidence, and a forensic analyst testified that hair found on the victim was “similar” to Richardson’s hair “to a reasonable degree of scientific certainty,” according to the Innocence Project. The prosecution also presented a rock found near the crime scene as evidence because it had blood and hair on it that was believed to have come from the victim.\n\nRelated Story The Real-Life Sentences Of The Central Park Five\n\nIn 1990, all five teenagers were convicted in two separate trials. McCray, Salaam, and Santana Jr. were all tried as juveniles, convicted of rape and assault, and sentenced to five to 10 years. Kevin Richardson, the youngest of the group at age 14, was tried as a juvenile and convicted of attempted murder, rape, sodomy, and robbery. He was also sentenced to five to 10 years.\n\nUnlike the rest of the Central Park Five, 16-year-old Wise was tried as an adult and convicted of assault, sexual abuse, and riot. He was sentenced to serve five to 15 years in prison.\n\nHow long were the Central Park Five in prison?\n\nFour of the men, McCray, Richardson, Salaam, and Santana Jr. served about seven years, while Wise, spent about 13 years in prison, per The New York Times. The entire time they were imprisoned, all five men consistently maintained their innocence.\n\nWise was even identified as “noncompliant” in a sex offender program in prison because, according to a 1999 psychological evaluation of Wise, “he denies sexually abusing the victim.”\n\nHow were the Central Park Five exonerated?\n\nIn 2002, Matias Reyes, a convicted murderer and rapist, confessed that he alone had sexually assaulted and beaten Meili, per The New York Times. DNA evidence confirmed his confession.\n\nNot only that, but the crime fit a pattern Reyes had already established. Just days earlier in 1989, he had committed another rape near Central Park.\n\n\n\nTrisha Meili I Am the Central Park Jogger: A Story of Hope and Possibility Trisha Meili I Am the Central Park Jogger: A Story of Hope and Possibility $13 at Amazon\n\nThe hairs found on Meili (and used against Richardson in trial) were also tested and matched Reyes.\n\nUnfortunately, the men had already served their time, but in 2002, then-Manhattan district attorney Robert M. Morgenthau joined a defense motion to vacate the five men’s convictions. On December 19, 2002, those convictions were officially overturned. In 2014, New York City agreed to pay the men $41 million to settle a federal civil rights lawsuit they filed. They also received a $3.9 million settlement from New York state for being incarcerated, per New York Daily News.\n\nFour years later, in 2018, New York City released thousands of pages of internal police documents related to the Central Park Five case, from videotaped statements and crime scene pictures to confidential police reports, further exonerating the men.\n\nOne of the men’s lawyers, Jonathan C. Moore, told The New York Times that the public release of the case materials make it clear that Reyes alone committed the rape and that “the prosecution of our five clients, the Central Park Five, was an intentional violation of their rights.”\n\nReyes is currently serving a life sentence for his crimes.\n\nDoes everyone believe the Central Park Five are innocent now?\n\nHmmm, not quite. Linda Fairstein, who was then chief of the sex crimes unit and oversaw the prosecution, maintains that the documents contain evidence that the men carried out other attacks in Central Park the night of Meili's rape and assault (something prosecutors have long argued), according to The New York Times.\n\nIn 2018, Fairstein urged people to watch the newly released defendants’ full videotaped statements, saying they’d been distorted in a documentary film, , directed by Ken Burns, Sarah Burns and David McMahon.\n\nWatch the Central Park Five documentary trailer and decide for yourself:\n\nplay icon The triangle icon that indicates to play\n\nAs for Meili, she doesn’t believe that the prosecutors did anything wrong in their initial interrogation and conviction of the Central Park Five. “When that lawsuit was settled, it gave some the impression that the detectives and the prosecutors had acted improperly, and I’d like to see it be acknowledged that there wasn’t a violation of [the teens'] civil rights,” she told the New York Daily News in 2018.\n\n\n\n“I so wish the case hadn't been settled,” Meili also told ABC News' 20/20 in January 2019. “I wish that it had gone to court because there's a lot of information that's now being released that I'm seeing for the first time. I support the work of law enforcement and prosecutors. ... They treated me with such dignity and respect.”\n\nWhere are the Central Park Five now?\n\n\n\nSalaam is now married and lives in another state with his wife and their 10 children (a blended family), The Root reported in 2018. Meanwhile, Santana Jr. lives in Atlanta with his daughter and works as a fashion designer, which often brings him back to New York.\n\nRichardson, along with Salaam and Santana Jr., attended their former high school, Bronx Preparatory High School's, 2017 commencement to receive honorary diplomas, per The New York Times. “When we went to prison, this was taken away from us,” Santana said at the time. “It was something we never got to experience. You felt like you were being robbed, and we’ve finally found redemption.”\n\nLittle to nothing is publicly known about the current whereabouts of McCray and Wise (though they both did receive their honorary diplomas by mail). According to a 2013 interview with Wise, he currently lives in the Bronx and speaks on behalf of the Innocence Project at events."}, {"url": "https://www.psychologytoday.com/us/basics/adolescence", "page_content": "What Is Adolescence?\n\nAdolescence can be a time of both disorientation and discovery. The transitional period can raise questions of independence and identity; as adolescents cultivate their sense of self, they may face difficult choices about academics, friendship, sexuality, gender identity, drugs, and alcohol.\n\nMost teens have a relatively egocentric perspective on life; a state of mind that usually abates with age. They often focus on themselves and believe that everyone else—from a best friend to a distant crush—is focused on them too. They may grapple with insecurities and feelings of being judged. Relationships with family members often take a backseat to peer groups, romantic interests, and appearance, which teens perceive as increasingly important during this time.\n\nThe transition can naturally lead to anxiety about physical development, evolving relationships with others, and one's place in the larger world. Mild anxiety and other challenges are typical, but serious mental health conditions also emerge during adolescence. Addressing a disorder early on can help ensure the best possible outcome."}, {"url": "https://www.britannica.com/event/West-Memphis-Three", "page_content": "West Memphis Three, three American men who in 1994, while teenagers, were found guilty of murdering three young boys in West Memphis, Arkansas, allegedly as part of devil worship. The men garnered national attention due to a series of documentaries and books that questioned their convictions as well as the vocal support of numerous celebrities. After the discovery of new DNA evidence, the three entered Alford pleas in 2011 and were released for time served. The West Memphis Three are Damien Echols (b. December 11, 1974, West Memphis, Arkansas, U.S.), Jason Baldwin (b. April 11, 1977, West Memphis, Arkansas, U.S.), and Jessie Misskelley, Jr. (b. July 10, 1975).\n\nThe crime and investigation On May 5, 1993, Christopher Byers, Michael Moore, and Stevie Branch—all of whom were eight years old—went bike riding in West Memphis. Later that evening, their parents reported the boys missing. The following day, law officers found their naked and hog-tied bodies in a drainage ditch in a forested area known as Robin Hood Hills. The boys had been beaten, and Byers’s body showed signs of mutilation. The police believed that the murders were connected to Satan worship. Almost immediately they interviewed Damien Echols, an 18-year-old high-school dropout and self-proclaimed Wiccan who was considered a troublemaker. In addition, he had a history of mental issues, notably depression. Echols denied knowing the boys or being involved in their deaths. Police, however, remained focused on Echols, and they soon received help from Vicki Hutcheson, whose 8-year-old child was friends with the victims and claimed to have witnessed their murders but was unable to identify the assailants. In a meeting with police, she was told that Echols had been interviewed, and she offered to “play detective” by meeting him. With the encouragement of law officers, she enlisted the help of Misskelley, a 17-year-old neighbour who knew Echols. According to Hutcheson, on May 19, 1993, she, Misskelley, and Echols attended a gathering of witches at a nearby field. She then claimed that the proceedings devolved into an orgy, at which point she asked Echols to take her home; Misskelley stayed. Hutcheson later related the events to the police and reportedly passed a polygraph test. Armed with this information, police interviewed Misskelley, who reportedly had an IQ of about 72. Despite initially denying involvement in the crime, he eventually confessed, saying that he had helped detain the three young boys but left before Echols and 16-year-old Jason Baldwin, who were best friends, committed the murders. All three were arrested in June 1993, though no physical evidence connected them to the crime and each had alibis.\n\nTrials and convictions Misskelley was tried separately, and his trial began in January 1994. His attorney focused on Misskelley’s confession, which he alleged had been coerced. Notably, early versions of his statements differed from the physical evidence; he falsely claimed that the boys had been sexually assaulted and that they had been tied with rope (they had actually been bound with shoelaces), among other discrepancies. The police claimed that Misskelley was simply “confused.” On February 4, 1994, he was found guilty of first-degree and second-degree murder and was sentenced to life without the possibility of parole. The trial of Echols, who was seen as the trio’s leader, and Baldwin started shortly thereafter. Misskelley refused to testify, and the prosecution was forced to rely on circumstantial evidence, notably Echols’s interest in the occult. The prosecution also introduced evidence it believed incriminating, such as the fact that Echols read Stephen King and listened to Metallica. In addition, a fellow inmate testified that Baldwin had confessed to the murders, and two girls claimed to have overheard Echols confess during a softball game. The defense sought to introduce other suspects, notably a local teenager who left for California shortly after the bodies were discovered and who said that he might have committed the crimes before recanting. However, the judge refused to let him testify before the jury. On March 18, 1994, Echols and Baldwin were found guilty of first-degree murder. Echols was later sentenced to the death penalty, and Baldwin was given life without the possibility of parole. Get a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nParadise Lost and prison release The cases had attracted the attention of filmmakers Joe Berlinger and Bruce Sinofsky, and their resulting documentary, Paradise Lost: The Child Murders at Robin Hood Hills, aired on HBO in 1996. It raised serious doubts about the guilt of Echols, Baldwin, and Misskelley, and it brought national awareness to the three men, who had become known as the West Memphis Three. The cases gained an even higher profile with the airing of Paradise Lost 2: Revelations in 2000. In addition to the Paradise Lost series, various books and films covered the cases, and a number of celebrities, including Johnny Depp and Pearl Jam frontman Eddie Vedder, became vocal supporters of the defendants. Their cause was further aided by a series of noteworthy events. In 2004 Hutcheson recanted, claiming that she had lied at the urging of the police, who had allegedly threatened to implicate her in the murders if she did not cooperate. Then in 2007 a hair found in a knot on one of the victims was sent for DNA testing, the technology of which was not available in the 1990s. It was determined that the hair was not consistent with the hair of Echols, Misskelley, or Baldwin. However, it was consistent with the hair of Terry Hobbs, the stepfather of Stevie Branch. In addition, another hair found at the crime scene was consistent with the hair of a friend of Hobbs. However, Hobbs denied any involvement in the murders. Based on this and additional evidence—including allegations that during deliberations in the trial of Echols and Baldwin, the jury foreman introduced Misskelley’s confession, which was inadmissable—a judge vacated all three convictions on August 19, 2011. Immediately thereafter, Echols, Baldwin, and Misskelley pled guilty while maintaining their innocence; the rare legal maneuver is known as an Alford plea. They were released after each was sentenced to time served and received a 10-year suspended sentence. These developments were chronicled in Paradise Lost 3: Purgatory (2011). While other suspects were discussed on the Internet and in such media projects as the documentary West of Memphis (2012), law officials closed the cases. Echols later published the books Life After Death (2012) and Yours for Eternity: A Love Story on Death Row (2014); the latter was written with his wife, Lorri Davis, whom he met while in prison."}, {"url": "https://www.elle.com/culture/movies-tv/a27438141/central-park-five-true-story-when-they-see-us-netflix/", "page_content": "On April 19, 1989, a 28-year-old white investment banker named Trisha Meili was jogging in Central Park when she was beaten, raped, and left for dead. She survived, with no recollection of what happened, and five black and Latino teenage boys from Harlem were charged with the attack, even though no physical evidence tied them to the crime scene and their confessions, which the boys later said were coerced, were filled with inconsistencies. Those boys, who spent years in prison for a crime they did not commit, famously became known as the Central Park Five, and starting on May 31, a new scripted miniseries on Netflix called When They See Us will explore what really happened to them.\n\nAva DuVernay (13th, Selma, A Wrinkle in Time) created, wrote, and directed the series, after one of the original Central Park Five, Raymond Santana, sent her a tweet , asking if she would look at the case for her next project. According to Town & Country , DuVernay then met with each of the five (Santana, Yusef Salaam, Kevin Richardson, Korey Wise, and Antron McCray), and in her words, “They had to decide if I was the right person.” DuVernay says she chose the series' title because, to her, the story is about young people of color who are judged upon sight. “What we try to do in the series is show that these are living, breathing people with thoughts, memories, feelings, families.”\n\nAhead, what you need to know about the new series and the true story of the Central Park Five.\n\nMore From ELLE play icon The triangle icon that indicates to play\n\nThis content is imported from youTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nWatch on YouTube Icon YouTube Icon\n\nWhat is the Netflix series about?\n\nWhen They See Us is a drama miniseries that explores what really happened in the case of the Central Park Five. The four-part series takes you through the night of the crime, the interrogations, the trials, and the time four of the boys spent in prison. (The boys were all between 14 and 16 years old when convicted.) The last episode mainly focuses on the time Wise, the only one convicted as an adult, spent in New York state prisons, where he was the victim of brutal beatings.\n\nThen 13 years after the crime occurred, Matias Reyes, a convicted murder and rapist who met Wise in prison, came forward to admit that he was the one who had attacked Meili, saying he did so alone. DNA evidence linked Reyes to the crime, and his confession reopened the case. (It should also be noted that Reyes had committed another rape near the park days before he assaulted Meili.) Ultimately, in 2002, the Central Park Five's convictions were vacated, and in 2014, New York City paid the men $41 million to settle a civil suit they filed.\n\nKorey Wise, Antron McCray, Kevin Richardson, Raymond Santana, and Yusef Salaam at the 2012 NYC Doc Festival Closing Night D Dipasupil // Getty Images\n\nWhat really happened to the Central Park Five?\n\nOn this particular night in April 1989, a number of other crimes were committed in the park, including the harassment and assault of bicyclists and joggers. Because of this, a number of teenagers were picked up by police as they exited the park, and hours later, when the police discovered Meili's body, those same teenagers became suspects in the rape.\n\nSarah Burns, who made a documentary about the Central Park Five back in 2012, explained that because Wise, McCray, Salaam, Richardson, and Santana had never been in the system or been in trouble before, they were especially vulnerable when they were picked up by the police, and they did not know to ask for a lawyer or how to keep from saying anything incriminating.\n\nThis content is imported from youTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nWatch on YouTube Icon YouTube Icon\n\nAfter being brought in, all five were subjected to hours of interrogation with no lawyers, and often with no parents, present. They went without food, water, and sleep, and said they were intimidated and coerced into giving false confessions. Four of the five gave videotaped confessions admitting to being present at the rape and incriminating each other, believing that if they told the officers what they wanted to hear, they would be allowed to go. In a recent interview with CBS, Salaam describes hearing officers beating up Wise in the next room when he was waiting to be interrogated. Salaam's mother interrupted his interrogation before he signed a confession, but even so, a detective was allowed to testify that Salaam admitted to participating.\n\nAs cited in Women's Health, The Innocence Project, which helped get the five exonerated, reports that in the United States, 28 percent of wrongful conviction cases where people are later exonerated using DNA evidence involve false confessions.\n\nFast forward to their trials: All five were found guilty, even though there was no DNA evidence that put them at the scene of the crime. But the New York Times reports that the district attorney's office later said their statements \"differed from one another on the specific details of virtually every major aspect of the crime,\" including who initiated the assault, who hit the victim, who held the victim, who raped the victim, the weapons used, and the sequence of events.\n\nThe boys were split into two trials, and Salaam, McCray, and Santana were convicted of rape and assault and sentenced to 5 to 10 years; Richardson was sentenced to 5 to 10 years and convicted of attempted murder, rape, sodomy, and robbery; and Wise was sentenced to 5 to 15 years and convicted of assault, sexual abuse, and riot.\n\nThe case created a media circus. Reports called the boys a \"wolf pack\" and Donald Trump spent $85,000 to take out full-page newspaper ads in the four daily New York City newspapers calling for the return of the death penalty. As recently as 2016, Trump has said the five are guilty.\n\nThe men spent between 7 and 13 years in prison, and consistently maintained their innocence.\n\nThis content is imported from youTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nWatch on YouTube Icon YouTube Icon\n\nWho's playing the Central Park Five in the Netflix series?\n\nBecause the miniseries follows the Central Park Five as both teenagers and adults, four of the group are played by two actors each. Asante Blackk plays young Richardson, while Justin Cunningham plays older Richardson; Caleel Harris plays young McCray, while Jovan Adepo plays older McCray; Ethan Herisse plays young Salaam, while Chris Chalk plays older Salaam; Marquis Rodriguez plays young Santana, while Freddy Miyares plays older Santana; and Jharrel Jerome takes on both younger and older Korey Wise.\n\nFelicity Huffman also appears in the series, playing Linda Fairstein, the woman who oversaw the interrogation of the Central Park Five, and Niecy Nash takes on the role of Wise's mother.\n\nWhat have the real Central Park Five said about the new series?\n\nAs mentioned above, Santana reached out to DuVernay originally about taking on their story for her next project. He told Town & Country that he had seen her film Selma, about the 1965 march for voting rights, and decided to ask. He said, “It showed me that she wasn’t afraid to tell the truth and she took her craft very seriously. I said, ‘This is the person we need.’”\n\nDuVernay also told the magazine that before the she made the film, Wise said to her about his conviction as an adult, “There is no Central Park Five. It was four plus one. And no one has told that story.” These words inspired her to dedicate the final episode mostly to his time in adult prison.\n\nRichardson recently told NBC, \"This whole process was surreal. Just to see our life story portrayed and it to still be relevant 30 years later... I think it will open up doors and conversations for people to see and see exactly what happened to us and everything that we went through and are still going through to this day.\"\n\nWhen They See Us will be available to watch on Netflix starting May 31."}]}