{"Frankie Lymon was noted for his high-pitched voice and his ability to sing in a \\\"whining\\\" style.": [{"url": "https://www.rockhall.com/inductees/frankie-lymon-and-teenagers", "page_content": "Jeff Tamarkin\n\nRonnie Spector, in her autobiography, Be My Baby, wrote, “A lot of entertainers can’t or won’t tell you where they got their style from. But I know exactly where I got my voice. Frankie Lymon…I was twelve when I first heard Frankie and the Teenagers sing ‘Why Do Fools Fall in Love?’. Frankie had the greatest voice I’d ever heard.”\n\nDiana Ross has said that she started out trying to emu­late Lymon’s high-pitched, crystalline voice, his enuncia­tion and whip-crack timing. Marvin Gaye, upon first wit­nessing his Motown labelmate Michael Jackson in action, commented, “It was Frankie Lymon all over again.”"}, {"url": "https://www.smithsonianmag.com/history/teen-idol-frankie-lymon-tragic-rise-fall-tells-truth-1950s-america-180967506/", "page_content": "That voice! Those apple cheeks! Arms wide, head back, he radiates joy, even in antique black and white. That beautiful soprano flying high, talent and presence and just enough ham to sell it all. And it was a great story, too: Up from nothing! A shooting star! So when they found Frankie Lymon dead at the age of 25 one February morning in 1968, in the same apartment building where he’d grown up, it was the end of something and the beginning of something, but no one was quite sure what.\n\nFrankie Lymon and the Teenagers were five kids from Washington Heights, just north of Harlem. They sang doo-wop under the streetlight on the corner of 165th and Amsterdam. They were discovered by the Valentines’ lead singer Richie Barrett while the kids were rehearsing in an apartment house. A few months later their first record, “Why Do Fools Fall in Love?” made it to the top of the national charts. It was 1956. Overnight, Frankie Lymon was the hottest singer in America, off on a world tour. He was 13 years old.\n\nThat made him the first black teenage pop star, a gap-toothed, baby-faced, angel-voiced paragon of show business ambition, and a camera-ready avatar of America’s new postwar youth movement. He was a founding father of rock ’n’ roll even before his voice had changed. That voice and that style influenced two generations of rock, soul and R&B giants. You heard his echoes everywhere. The high, clear countertenor, like something out of Renaissance church music, found its way from the Temptations to the Beach Boys to Earth, Wind & Fire. Even Diana Ross charted a cover of “Why Do Fools Fall in Love?” 25 years after its release. Berry Gordy may not have modeled the Jackson 5 on Frankie Lymon and the Teenagers, as is often said, but it sure sounded as if he had.\n\nThat’s the legend, anyway. Truth is, Frankie Lymon grew up too fast in every way imaginable. “I never was a child, although I was billed in every theater and auditorium where I appeared as a child star,” Lymon told Art Peters, a reporter for Ebony magazine, in 1967. “I was a man when I was 11 years old, doing everything that most men do. In the neighborhood where I lived, there was no time to be a child. There were five children in my family and my folks had to scuffle to make ends meet. My father was a truck driver and my mother worked as a domestic in white folks’ homes. While kids my age were playing stickball and marbles, I was working in the corner grocery store carrying orders to help pay the rent.”\n\nA few days before Frankie and his friends from the corner recorded the song that made them famous, Rosa Parks was pulled off a bus in Montgomery, Alabama. Less than two years later, Frankie danced with a white girl on a national television show, and the show was swiftly canceled. Another part of the legend.\n\nRace integration in pop music was never going to be simple.\n\n**********\n\nAmerica in the 1950s: postwar economy roaring, a chicken in every pot and two cars in every garage of the split-level house in Levittown, every cliché of union-made American middle-class prosperity held to be self-evident.\n\nAnd music was a big part of that. Raucous and brawny, electrified, it felt like Chuck Berry, Little Richard, Elvis and Jerry Lee Lewis all fell from the sky at once. Frankie Lymon and the Teenagers, with their tight, upbeat harmony, were an important part of it, too. You can trace doo-wop back to the Psalms, hear it bubble up in the a cappella harmonies of Gregorian chant, or, by way of Africa and the Caribbean, from gospel quartets.\n\nIn America, beginning in the 1930s, the Mills Brothers and the Ink Spots were the popularizers of those intricate harmonies we recognize today as proto-rock ’n’ roll. Doo-wop was among the inheritors, a thousand street-corner groups and a thousand one-hit wonders. The Spaniels and the Five Satins and the Vocaleers, the Drifters and the Fleetwoods and the Moonglows, the Coasters and the Platters and on to Frankie Valli and modernity. In the 1950s, every high school stairwell in this country was loud with four-part singing. Even today the “Pitch Perfect” movie franchise owes its popularity to an a cappella tradition stretching back into pre-electric history.\n\n“We harmonized every night on the street corner until the neighbors would call the cops to run us away,” Lymon told Ebony. But Frankie wasn’t doo-wop, not really. Doo-wop was group music. “Frankie Lymon was always different than that,” Robert Christgau, great-granddaddy of American rock critics and historians, will tell you. “He was the star.”\n\nFrankie and his record producers and managers soon agreed he’d be a more profitable solo act, so off he went, leaving behind the Teenagers, and with them friendship and loyalty. He had another, lesser, hit—a recording of “Goody Goody,” sung by Bob Crosby and Ella Fitzgerald before him—before things cooled.\n\nThen came the long, slow slide.\n\nAsk any junkie and they’ll tell what they’re chasing is the feeling they got the first time they got high. But that first-time rush can never be recaptured, whether you’re talking about heroin or cigarettes or hit records.\n\nFrankie was a heroin addict at 15 years old. He tried to kick, tried again and again and got straight for a while. Then his mother died, and he fell hard.\n\nHe wasn’t alone. Heroin was everywhere in New York by then, and methadone clinics run by the city were springing up in neighborhoods all over town. The failure rate was heartbreaking.\n\n“I looked twice my age,” Lymon told Ebony. “I was thin as a shadow and I didn’t give a damn. My only concern was in getting relief. You know, an addict is the most pathetic creature on earth. He knows that every time he sticks a needle in his arm, he’s gambling with death and, yet, he’s got to have it. It’s like playing Russian Roulette with a spike. There’s always the danger that some peddler will sell him a poisoned batch—some garbage.” Here young Frankie knocks on wood. “I was lucky. God must have been watching over me.”\n\nEven now you want to believe him.\n\n**********\n\nFrankie’s neighborhood, just up the bluffs from the long-gone Polo Grounds, feels mostly unchanged even 50 years later. It was poorer then, sure, like the rest of New York City, and in the age before earbuds and headphones it was surely louder. You heard music in the streets.\n\nOutside Frankie’s old address, on West 165th, there’s a “Wet Paint” sign on the door this bright autumn morning, and one building over a crew is painting the ancient fire escapes. The whole block smells of solvent, sharp and clean. It’s a well-kept street of five- and six-story apartment houses in a tidy neighborhood of working-class folks who greet each other on the sidewalk, black and white and brown, Latin American and Caribbean immigrants and Great Migration African-Americans and, like the rest of New York, folks from all over.\n\nYoung as he was, Lymon had three wives. He married them in quick succession, and there was plenty of confusion about the paperwork. He may have been married to more than one at a time, or not entirely married to one of the three at all. One of them may have still been married to someone else. Depends whom you ask. (In the 1980s, they all met in court, to settle Lymon’s estate, such as it was, to find out who was entitled to songwriting royalties from best sellers like “Why Do Fools Fall in Love?” None got much, but the third wife, Emira Eagle, received an undisclosed settlement from record producers.)\n\nIn 1966, there was a brief glimmer of hope. Fresh out of rehab at Manhattan General Hospital, Lymon appeared at a block party organized by a group of nuns at a Catholic settlement house in the Bronx. He told an audience of 2,000 teenagers, “I have been born again. I’m not ashamed to let the public know I took the cure. Maybe my story will keep some other kid from going wrong.”\n\nOn February 27, 1968, he was booked for a recording session to mark the start of a comeback. Instead, he was found dead that morning on his grandmother’s bathroom floor.\n\n**********\n\nFrankie Lymon was buried in the Bronx, at St. Raymond’s Cemetery: Row 13, Grave 70. It’s 15 minutes by car from the old neighborhood. His headstone is over by the highway. The grass is green and the ground is hard and uneven and on the left his stone is packed tight with the others. On the right there’s a gap like a missing tooth. You can see the towers of two bridges from here, the Bronx-Whitestone and Throgs Neck, and hear the traffic rush past on the Cross Bronx Expressway. Billie Holiday is buried here, and Typhoid Mary. This is where the Lindbergh ransom exchange happened. The wind comes hard off Eastchester Bay and shakes the pagoda trees.\n\nFor years Frankie’s grave was unmarked. In the mid-1980s, a New Jersey music store held a benefit to raise money for a memorial, but it never made it to the cemetery. The headstone gathered dust in the record shop, then moved at last to the backyard of a friend of the owner.\n\nEmira Eagle had the current headstone installed sometime in the late 1990s.In Loving Memory\n\nOf My Husband Frank J. Lymon Sept. 30, 1942 – Feb. 27, 1968\n\nNot much room to tell his story. And what could anyone say? That the 1950s were long over? That innocence was dead? That by 1968 one America had vanished entirely, and another had taken its place?\n\nOr maybe that Frankie Lymon’s America, doo-wop America, was never simple, never sweet, but was rather an America as complex and wracked by animus and desire as any in history. It was the same America that killed Emmett Till, after all, another angel-faced kid with apple cheeks and a wide, bright smile.\n\nSeen across the gulf of years, what we now think of as the anodyne, antiseptic 1950s America is revealed as an illusion. June Cleaver vacuuming in an organdy cocktail dress and pearls is a television mirage, a national hallucination. We had the postwar world economy to ourselves because so many other industrial nations had been bombed flat. And for every Pat Boone there was a “Howl,” an Allen Ginsberg, a Kerouac, a Coltrane, a Krassner, a Ferlinghetti. There were underground explosions in painting and poetry and music and prose. It was a kind of invisible revolution.\n\nA telling detail of that chaste 1950s mythology: to preserve his image as a clean-cut teenager, Frankie Lymon would pass off the women he dated in different cities as his mother. It gets told and told and told—in fact, he told it himself—that he once got caught by a reporter who went to shows in New York and Chicago and saw that his “mom” was two different women, each twice Frankie’s age. A story too good to fact-check.\n\nIt was in these 1950s that Ralph Ellison wrote Invisible Man, and James Baldwin published Notes of a Native Son. After Rosa Parks was pulled off that bus, Dr. King led the Montgomery bus boycott and changed the trajectory of civil rights in America. The Supreme Court decided Brown v. Board of Education, and then came Little Rock and the lunch counter sit-ins at Wichita and Oklahoma City. What you saw of the ’50s in America was all about where you stood. And with whom.\n\nWas the short, blinding arc of Frankie Lymon’s career a morality play? A rock ’n’ roll cautionary tale? Or just another story of a young man gone too soon?\n\nMaybe it was a reminder that America changes in every instant and never changes at all. Our streets have always been filled with music and temptation; addiction has always been with us, long before “us” was even America, from the Lotus Eaters of The Odyssey to the opium dens of the Wild West to the crack epidemic and on to our own new opioid crisis.\n\nLooking at that headstone, you get to thinking maybe Frankie Lymon was the 1950s, man and myth, the junkie with an angel’s voice, and that the stone stands as a monument to the lies we tell ourselves about America in the time before Frankie flew away.\n\nThe very night Lymon died Walter Cronkite went on the air and said of Vietnam, “We are mired in a stalemate.” It was clear the center couldn’t hold, and if you felt like the 1950s were five polite young men in matching letter sweaters, the rest of 1968 came at you like the Four Horsemen of the Apocalypse. The world lurched and suddenly spun too fast. Tet. My Lai. Chicago. Washington. Baltimore. Riots everywhere. Vietnam the pulse and drumbeat behind and beneath everything.\n\nSo when Frankie Lymon died that February morning you’d have been forgiven for missing it. He was nearly forgotten by then, a five-paragraph item on page 50 of the New York Times, a casualty of the moment the future and the past came apart.\n\nIt was sad, but for a while, arms wide and head back, Frankie Lymon had bridged and bound all those opposing energies. That face! That voice!\n\nMan, he could sing like an angel.\n\nGet the latest History stories in your inbox? Click to visit our Privacy Statement."}, {"url": "https://www.britannica.com/topic/Frankie-Lymon-and-the-Teenagers", "page_content": "Frankie Lymon and the Teenagers, American vocal group popular in the mid-1950s, prime exponents of the doo-wop vocal style. The members were Frankie Lymon (b. Sept. 30, 1942, New York, N.Y., U.S.—d. Feb. 28, 1968, New York), Herman Santiago (b. Feb. 18, 1941, New York), Jimmy Merchant (b. Feb. 10, 1940, New York), Joe Negroni (b. Sept. 9, 1940, New York—d. Sept. 5, 1978, New York), and Sherman Garnes (b. June 8, 1940, New York—d. Feb. 26, 1977, New York).\n\nThe broad-based success of this vocal ensemble helped signal the emergence of rock and roll as a part of mainstream teenage culture. The prepubescent soprano of 13-year-old lead singer Lymon, sounding innocent and girlish, represented one of the most appealing sounds in early rock and roll, and many later pop groups would feature a preteen male lead, most notably the Jackson 5. The Teenagers’ first successful record, “Why Do Fools Fall In Love” (1956), was followed by five more singles that appeared on the national survey lists of the most popular records in the United States. The Teenagers also appeared in two popular rock-and-roll movies starring disc jockey Alan Freed, Rock, Rock, Rock (1956) and Mister Rock and Roll (1957).\n\nIn 1957 Lymon left the group to launch a solo career, which failed when his changed adult voice, an unremarkable tenor, proved to have diminished commercial appeal. Long afflicted by a substance abuse problem, Lymon died in 1968 from a drug overdose. He and the group were inducted into the Rock and Roll Hall of Fame in 1993."}, {"url": "https://www.encyclopedia.com/education/news-wires-white-papers-and-books/frankie-lymon-and-teenagers", "page_content": "Frankie Lymon and The Teenagers\n\nVocal group\n\nFor the Record…\n\nShort Ride On Success’s Wave\n\nMarried Thrice But Never Divorced\n\nThree Versions of “Fools”\n\n“Fools” Rose Again\n\nSelected discography\n\nSources\n\nFrankie Lymon and the Teenagers—like Hansen, the New Kids on the Block, the Jackson 5, and Stevie Wonder after them—all had smash pop music singles before they could legally drive. However, Frankie Lymon was, as Cub Koda stated in the All Music Guide, Volume 1, “the first black teenage star.” From the streets corners of Harlem to the London Palladium stage, Frankie Lymon and The Teeagers, as noted in the Encyclopedia of Pop, Rock, and Soul, were a doo-wop vocal group whose “saga... might be called a Cinderella story without a happy ending” as well as a song without an answer to this eternal question: “Why Do Fools Fall in Love?”\n\nIn the 1950s, a sweet-sounding musical craze swept across America—doo wop. In 1955, one group, the Ermines—school friends Herman Santiago, Joe Negroni, Sherman Games, and Jimmy Merchant stood on West 165th Street in New York City and harmonized because, as Merchant said in the New Yorker, “It was a fad at the time to be a vocal group. It wasn’t just like roller skating. It was a higher-class fad—a quality fad. It tied in to being known, and getting girls.” Yet, it was not until another voice, the soprano boy voice of Frankie Lymo, joined the group that the Ermines, now renamed the Coupe de Villes, became more than a fad. Lymon, had already stepped into the public spotlight by singing with the Harlemaires, his father’s gospel group, but how Lymon joined the Coupe de Villes is unclear. One version suggested by reporter Calvin Trillin in the New Yorker, was that Lymon, passing the group on the street, overheard Santiago struggling to hit some high notes. Lymon, as Santiago told Trillin, who was “extremely talented and bright and very cocky,” just jumped in with his “gospel tenor—a high strong voice of remarkable clarity.”\n\nBy late 1955, the once Ermines and Coupe de Villes, changed their name again—to the Premiers. Richard Barrett, a member of another vocal group, the Valentines and a part-time record company employee, heard the Premiers singing “Lily Maebelle”—a Valentine’s hit—outside his bedroom window. Barrett liked what he heard and promised to praise the group to his boss, Gee Records producer/promoter George Goldner, if they would stop waking him up every morning. Goldner, awed by one song—“Why Do Fools Fall in Love?”— asked Lymon, as quoted in the Encyclopedia of Pop, Rock, and Soul, “You got any sheet music for it?” Lymon replied, “Nope, we don’t know anything about written-down music. This lack of “written-down music” knowledge would 30 years later create an intriguing court battle. However, on January 10, 1956, “Why Do Fools Fall in Love?” was released and as stated by Trillin in the New Yorker, “It was an instant, stupendous hit.”\n\nMembers includ Frankie Lymon (born September 30, 1942, died February 28, 1968, married Elizabeth Waters, Zola Tayor, and Emira Eagle, never divorced), soprano; Sherman Garnes (born June 8, 1940, died 1978), bass; Jimmy Merchant (born February 10, 1940), second tenor; Joe Negroni (born September 9, 1940, died 1978), baritone; Herman Santiago (born February 18, 1941), first tenor.\n\nGroup began as the Ermines, a New York street corner quartet in 1955; changed name to Coupe de Villes and added a new member, Frankie Lymon later that year; became the Premiers and recorded “Why Do Fools Fall in Love,” 1956; released “Why do Fools Fall in Love,” under a new name: Frankie Lymon and the Teenagers; starred in rock and roll radio disc jockey, Alan Freed’s rock concerts and movie, Rock, Rock, Rock singing, “Baby, Baby” and “I’m Not a Juvenile Delinquent”; Lymon left group in late 1956 and failed at solo career while the Teenagers continued; Lymon died of a drug overdose, 1968; in the 1980s, Lymon’s three wives (whom he never divorced) sued and won lost royalties; Last two surviving Teenagers—Jimmy Merchant and Herman Santiagao—sued and won song writing credit and back royalties to “Why Do Fools Fall in Love,” 1993; released movie based on the group, Why Do Fools Fall in Love, 1998.\n\nAwards: Inducted into the Rock and Roll Hall of Fame, 1993.\n\nWith the success of “Why Do Fools Fall in Love?”—a gold record single—Frankie Lymon, at the age of 14, and The Teenagers, all under the age of 16, became pop music superstars. However, it was not just their smooth vocal harmonies that made them popular. In the 1950s, due to race discrimination, crossover success from the rhythm and blues charts to the pop charts by black recording artists was uncommon. Yet, as stated by Trillin in the New Yorker, “The Teenagers came in a squeaky-clean package—processed hair and the sort of clothes familiar from Hollywood campus movies of the forties, including letter sweaters.” And with their smash hit spending 16 weeks on the pop chart, Lymon and The Teenagers rode a wave of success onto Ed Sullivan and Dick Clark’s TV shows as well as onto rock ‘n roll deejay Alan Freed’s rock concerts and movies, such as Rock, Rock, Rock In that movie, Lymon and The Teenagers debuted two new, non-intimidating singles, “Baby, Baby, Baby” and “I’m Not a Juvenile Delinquent.”\n\nBy the middle of 1956, four more singles from the group’s first album also hit the top ten: “I Promise to Remember,” “I Want You to be My Girl,” “I’m Not a Know-it-All,” and “Who Can Explain?” Trillin believed that, “the Teenagers were the model—the proof that a miracle could happen.” Frankie Lymon and The Teenagers, five kids from the street corners of Harlem, played concerts at London, England’s Palladium theatre and cruised in luxury. Merchant told Trillin that “we [the group] were the first people to get out of long limousines with sneakers and jeans on.” Moreover, as Trillin further stated, the success of this vocal group was because “The Teenagers were not considered threatening to whites—probably because of Frankie, who came across as the sassy, pint-sized kid brother who would never grow up.”\n\nYet, the end of 1956, Lymon had grown up enough to catch a new wave—a solo wave. The Teenagers replaced Lymon but never again rode the high wave of success. Neither did Lymon, as quoted in People, “he [Lymon] got trapped in his child-like image”—but his voice had changed. Thus, Lymon was forced to lip-synch his hits at sock hops. Lymon also was not, as Jerry Blavat, a deejay, told Trillin, “the mischievous kid, whose idea of back stage entertainment was to hide Paul Anka’s shoes just before Anka had to be onstage”—Lymon had become a drug addict. Lymon, as quoted by People, admitted that the single, “I’m Not a Juvenile Delinquent” was far from autobiographical, “[I] … had been a pimp at age 10… [and] had been smoking marijuana when I was in grade school. But I didn’t start using [heroin] until I got into show business.” Lymon tried to get clean, but failed. As quoted in People, Lymon said, “I didn’t give a damn about drugs.”\n\nHowever, Lymon despite a career cut short by his voice change and drugs, married three times—first, in 1964 to Elizabeth Waters, a woman with arrests for theft and prostitution; In 1965, to Zola Taylor, the Platters girl singer, and in 1967, after a brief stint in the Army to get out of jail time, to Emira Eagle, an elementary school teacher. In 1968, Lymon attempted a comeback and had been promised a singing job in New York. Yet, on February 28, 1968, Lymon was found dead on his grandmother’s bathroom floor. Lymon, only 25, had overdosed on heroin. Ten years later, two Teenagers— Garnes and Negroni also died—Garnes from a heart attack and Negronia from a cerebral hemorrhage.\n\nOver the next 28 years, Frankie Lymon and the Teenagers, were a forgotten doo-wop quintet, however their hit single, “Why Do Fools Fall in Love?” was not. In 1973, the song was featured in the popular coming-of-age movie, American Graffiti, and in 1981, Diana Ross recorded her version of the song, and it once again became a Top 10 hit on the pop music charts. In 1984, George Goldner, Frankie Lymon and The Teenagers’ producer applied for an original copyright of the song to insure royalty money for Emira, Lymon’s third wife. However, two questions arose with this application—first, who was Lymon’s legal widow, and second, who wrote “Why Do Fools Fall in Love?”\n\nLymon’s three wives—Elizabeth Waters, Zola Taylor, and Emira Eagle—had never met. That fact changed in 1997, almost 30 years after Lymon’s death, when, at a Manhattan court house, the three women were called to testify. Because Lymon had never divorced Waters, Taylor, or Eagle, the question of who was Lymon’s legal widow had to be answered before any royalty money was awarded. Each woman had their own memories of Lymon. Waters, as quoted in the New Yorker, knew “Frankie at the time [in 1961] he was a very sad, lonely person.” Waters also stated that,” Frankie could fool you, he could fool me, Frankie could fool God.” However, Waters seemed to fool Lymon. In 1964, when Lymon and she were married, Waters was already married to someone else. Taylor, Lymon’s second wife, and the Platters girl singer, had dated Lymon when he was just 14, never produced a marriage license. Eagle, only married to Lymon for eight months, remembered, as quoted in People, that Frankie “treated me like I was his queen.”\n\nThe judge decided that only Waters, seeing that Lymon could not legally marry anyone else after marrying his first wife, and overlooking the fact that she was already married, named Waters Lymon’s legal widow. However, in 1990, this decision was overturned and Eagle was named Lymon’s new legal widow and therefore entitled to his estate of back royalties for “Why Do Fools Fall in Love?” However, another question had to be answered before any money was awarded—who wrote that smash single?\n\nIn the early 1990s, another court battle began—this time to decide who were the true author’s of “Why Do Fools Fall in Love?” To answer this question, a time trip must be taken back through a maze of buyers and sellers (including Lymon himself). In 1956, the song’s registered copyright listed Lymon and The Teenager’s producer George Goldner as the hit song’s writers. However, as stated by Trillin in the New Yorker, it was a “common practice in the fifties for an R & B record producer to tell a group that he’d have to have a writing credit if it wanted its song recorded.” Richard Barrett, the man who brought Lymon and The Teenagers to the attention of Goldner further stated that, “we [doo-wop groups] had no idea of the value of a song then. We had no idea what the value of a copyright was. And they [record producers] weren’t going to tell any black people about that anyway.”\n\nHowever, Goldner, after amassing too many gambling debts, left his partner, Morris Levy, with control of the copyright. In 1965, Lymon, by that time a heavy drug user, needed money. So he sold his rights to Levy for, as reported in the New Yorker, “a sum that was probably something like fifteen hundred dollars.” Thus, when “Why Do Fools Fall in Love?” appeared in the 1973 movie, American Graffiti, and when Diana Ross covered the hit in 1981, only Levy received 100 per cent of the royalties. Yet, in the late 1980s, Jimmy Merchant and Henry Santiago—the last two surviving Teenagers— contested Levy’s claim. At the trial, as stated in People, “witnesses testified that Merchant and Santiago were 15-year-old street corner harmonizers who came up with the tune before Lymon joined them.” Merchant and Santiago also had, as reported in the New Yorker, an “interesting piece of evidence: the first 45-r.p.m. single of “Why Do Fools Fall in Love?” [which] listed as the song’s writers not just Frankie Lymon and George Goldner but also Herman Santiago.”\n\nFurthermore, Santiago and Merchant stated in the New Yorker that the idea for the song came when they picked through a groupie’s letters to “get ideas, just to see what we could come up with…. That’s basically what we had the idea from.” Yet, another version of the song’s origin, as reported by Trillin, was that one of the groupie’s letters included a poem. That poem had “one of its [“Why Do Fools Fall in Love?”] main lines: “Why do birds sing so gay?” [and] Santiago and Merchant… worked the sentiments of the letters into a song lyric and then Frankie Lymon helped with the tune.”\n\nHowever, Lymon himself told three versions of how he wrote the song. The first version, as remembered by Emira Lymon in the New Yorker, said that Lymon “had written the song at twelve because he had fallen in love with a teacher and she told him that he was nothing but a kid, he was too young for her. And that is why he wrote ‘Why Do Fools Fall in Love?’.” Another version, as cited in the New Yorker, was that the song was “inspired by Lymon’s seventh grade essay.” Yet, Elizabeth Waters, Lymon’s first wife, offered that the song was just “off the top of his [Lymon’s] head.” Finally, in 1992, over 30 years after “Why Do Fools Fall in Love?” hit the charts, Santiago and Merchant, along with Frankie Lymon were named the writers of the song. Merchant told People, “Thirty-six years is a long, long, long time. But they [record producers] never really do get away with it.” However, this verdict was later overturned.\n\nIn the late 1990s, Santiago, Merchant, and Lymon’s brother Louis still performed as The Teenagers. Yet, it was in September of 1998, when Hollywood released Why Do Fools Fall in Love, a movie based on the life of Frankie Lymon and The Teenagers, that the group’s doo-wop sound and hit single rose again. However, the movie, as stated in the Milwaukee Journal Sentinel, “missed its mark … and never notes Frankie’s voice changing… [nor how Frankie] lost his looks and charm.” Bobby Jay, the Teenagers current bassist, further commented that Lymon “was begging on the street. The drugs took a huge toll. He was missing teeth. He looked bad. It was tragic.”\n\nEven though the movie misrepresented Lymon and The Teenagers life, it had reminded the public of their sweet-sounding melodies. Moreover, as stated in the Rock ‘n Roll Hall of Fame’s online biography of the group, “The song [“Why Do Fools Fall in Love?”] has attained the status of a vocal-group classic owing to Lymon’s agile, ingenuous and utterly charming performance.” Thus, perhaps the saga of Frankie Lymon and The Teenagers and the eternal question: “Why Do Fools Fall in Love?” was a fairy tale, albeit one without a happily-ever-after ending for Lymon—or as Santiago told People, “a natural superstar. There was nobody like Frankie.”\n\nWhy Do Fools Fall in Love, Gee Records, 1956.\n\nAt The London Palladium, 1956.\n\nThe Teenagers For Collectors Only [Box Set], Collectables Records, 1994.\n\nThe Very Best of Frankie Lymon & The Teenagers, Wea/Atlantic/Rhino, 1998.\n\nBooks\n\nHitchcock, H. Wiley and Stanley Sadie, eds., The New Grove Dictionary of American Music Volume Three, L-Q, Mac-Millan Press Limited, 1986.\n\nStambler, Irwin, Encyclopedia of Pop, Rock, & Soul, St. Martin’s Press, 1974.\n\nPeriodicals\n\nMilwaukee Journal Sentinel, September 6, 1998, page 8.\n\nNew Yorker, February 25, 1991.\n\nPeople, December 7, 1992; September 14, 1998.\n\nOnline\n\n“Frankie Lymon and the Teenagers, “Rock and Roll Hall of Fame, http:www.rockhall.com.\n\nAdditional information was provided by Music Boulevard Online Newsstand [Cub Koda’s short biography].\n\n—Ann M. Schwalboski"}, {"url": "https://face2faceafrica.com/article/a-junkie-with-an-angels-voice-the-tragic-tale-of-teen-idol-frankie-lymon-who-died-from-heroin-overdose12", "page_content": "Frankie Lymon was America’s first black teenage pop star but by 1968, aged a mere 25 years, he was found dead from a heroin overdose in the same apartment building where he’d grown up. Lymon’s fate is tragic in that he was ill equipped to manage the fame that found him.\n\nLymon and the Teenagers, five kids from Washington Heights, just north of Harlem sang doo-wop under the streetlight on the corner of 165th and Amsterdam were discovered by the Valentines’ lead singer Richie Barrett. Months later in 1956, their first record, “Why Do Fools Fall in Love?” made it to the top of the national charts.\n\nThe Teenagers comprised three African-American members, Frankie Lymon, Jimmy Merchant, and Sherman Garnes; and two Puerto Rican members, Joe Negroni and Herman Santiago.\n\nAt 13, Frankie Lymon became the hottest singer in America overnight with a world tour to boot. Lymon by that feat was a founding father of rock ’n’ roll. His voice and style influenced two generations of rock, soul and R&B giants.\n\nThere’s even talk Berry Gordy may have modeled the Jackson 5 on Frankie Lymon and the Teenagers. “I never was a child, although I was billed in every theater and auditorium where I appeared as a child star,” Lymon told Art Peters, a reporter for Ebony magazine, in 1967. “I was a man when I was 11 years old, doing everything that most men do. In the neighborhood where I lived, there was no time to be a child. There were five children in my family and my folks had to scuffle to make ends meet. My father was a truck driver and my mother worked as a domestic in white folks’ homes. While kids my age were playing stickball and marbles, I was working in the corner grocery store carrying orders to help pay the rent.”\n\nInterestingly just a few days before Frankie and his friends recorded the song that made them famous, Rosa Parks was pulled off a bus in Montgomery, Alabama.\n\nThe 1950s American postwar economy was booming and music was part of that. Lymon told Ebony “We harmonized every night on the street corner until the neighbors would call the cops to run us away.”\n\nBut that friendship will take a hit when Lymon and his record producers agreed he’d be a more profitable solo act, so the Teenagers were ditched. They landed another hit in “Goody Goody,” earlier done by Bob Crosby and Ella Fitzgerald. When Lymon went solo in mid-1957, both his career and that of the Teenagers fell into decline. Their union lasted for a brief 18-month period.\n\nFrom here, the tide changed. Lymon was a heroin addict at 15 years old and despite his best efforts to straighten out, he relapsed. It didn’t help when his mother died.\n\n“I looked twice my age,” Lymon told Ebony. “I was thin as a shadow and I didn’t give a damn. My only concern was in getting relief. You know, an addict is the most pathetic creature on earth. He knows that every time he sticks a needle in his arm, he’s gambling with death and, yet, he’s got to have it. It’s like playing Russian Roulette with a spike. There’s always the danger that some peddler will sell him a poisoned batch—some garbage.” Here young Frankie knocks on wood. “I was lucky. God must have been watching over me.”\n\nIn 1966, fresh out of rehab at Manhattan General Hospital, Lymon appeared at a block party organized by a group of nuns at a Catholic settlement house in the Bronx. He told an audience of 2,000 teenagers, “I have been born again. I’m not ashamed to let the public know I took the cure. Maybe my story will keep some other kid from going wrong.”\n\nOn February 27, 1968, he was booked for a recording session to mark the start of a comeback. Instead, he was found dead that morning on his grandmother’s bathroom floor. He was buried in the Bronx, at St. Raymond’s Cemetery but for years, Lymon’s grave was unmarked until Emira Eagle, his third wife had the current headstone installed sometime in the late 1990s.\n\nFame has its gifts and young as Lymon was, he had three wives. He married them in quick succession, and there was plenty of confusion about the paperwork about who was entitled to songwriting royalties from his best sellers. None got much, but the third wife, Emira Eagle, received an undisclosed settlement from record producers.\n\nIt was also said that to preserve his image as a clean-cut teenager, Frankie Lymon would pass off the women he dated in different cities as his mother except keen observers noted different women emerged as mothers in various cities. He sang for Queen Elizabeth II at the London Palladium and performed in nightclubs and theaters worldwide. Lymon also served as an Army private at Fort Gordon.\n\nFrankie Lymon who could sing like an angel but was a troubled soul influenced Diana Ross, Smokey Robinson, Len Barry and Michael Jackson as well as a host of other singers."}, {"url": "https://www.goldradiouk.com/features/frankie-lymon-life-death-marriages/", "page_content": "Frankie Lymon facts: Life, and tragic death of The Teenagers star and 'Why Do Fools Fall in Love' teen idol\n\nFrankie Lymon and the Teenagers in Streetlight Harmonies\n\nBy Mayer Nissim\n\nFrankie Lymon was the leader of the first all-teen hit rock 'n' roll band, but his short life spiralled into tragedy.\n\nListen to this article Loading audio...\n\nRock 'n' roll was always a teen phenomenon, but while most of the fans lapping up the new sound were that age, many of those putting out the records were well into their 20s and beyond.\n\nThat wasn't the case for Frankie Lymon & The Teenagers. Frankie was the baby of the group, just 13 when they released their debut single, and his four bandmates were all aged 15 or 16.\n\nWith their of-the-moment sound mashing up doo-wop and rock 'n' roll to their racially integrated lineup (Frankie, Jimmy Merchant and Sherman Garnes were Black, Joe Negroni and Herman Santiago were Puerto Rican), The Teenagers were groundbreaking.\n\nThey exploded on to the scene with 'Why Do Fools Fall in Love', which remained their biggest single, before the hits dried up all-too swiftly.\n\nFrankie Lymon left the group, but his solo career failed to launch. He had struggles in his personal life, and tragically died at the age of 25 after a drug overdose. Below, we mourn teen idol Frankie Lymon, while celebrating his life and legacy.\n\nWhen was Frankie Lymon born and how did he join the Teenagers?\n\nFrankie Lymon was born to truck driver dad Howard and maid mum Jeanette on September 30, 1942 in Harlem, New York\n\nSinging was very much in Frankie's blood, as both his parents sang together in gospel group The Harlemaires.\n\nFrankie and his brothers Lewis and Howie sang with Harlemaire Juniors, while Frankie worked as a grocery boy from the age of 10.\n\nWhen he was just 12 Frankie became friends with Herman Santiago, the lead singer of local doo-wop group the Coupe De Villes, having first heard them at a school talent show.\n\nHe went on to join the group that became known as The Ermines, The Premiers and eventually The Teenagers.\n\nHow did Frankie Lymon end up fronting The Teenagers?\n\nFrankie Lymon and The Teenagers. Picture: Getty Images\n\nWith his stunning boy soprano voice, it seems obvious that Frankie Lymon would be the frontman (front-boy?) of The Teenagers, but it didn't start that way.\n\nAs said, it was Santiago who was leading the group when Lymon joined, but that all changed quickly.\n\nAfter impressing The Valentines singer Richard Barrett, The Teenagers got an audition with producer George Goldner. Santiago turned up late, Lymon stepped up and said he could take his place.\n\nFrom then on, the group was effectively Frankie Lymon and the Teenagers.\n\nDid Frankie Lymon write 'Why Do Fools Fall in Love'?\n\nFrankie Lymon & The Teenagers - Why Do Fools Fall In Love (Mastered HD)\n\n'Why Do Fools Fall in Love' was the debut single from The Teenagers, their signature song, and their biggest hit.\n\nIt topped the US R&B Chart, went to number 6 on the pop chart, and incredibly went all the way to number one in the UK singles chart, too.\n\nIt's endured to this day, and has also been covered by The Diamonds in 1956, the Beach Boys in 1964 and Diana Ross in 1981.\n\nAs for who wrote the classic song, it's a little bit complicated.\n\nHerman Santiago had written the basic song called 'Why Do Birds Sing So Gay?' for the audition with producer and Gee Records boss George Goldner, basing the words on some love letters given to the group by a tenant in bassist Sherman Garnes' apartment building.\n\nGoldner suggested some tweaks to the lyrics, while Frankie improvised and tweaked the melody.\n\nSo on the first pressings, the song was attributed to Frankie Lymon, Herman Santiago, and George Goldner.\n\nAfter a while, Santiago's name was mysteriously dropped from the label. Then, after Goldner was bought out by Morris Levy his name was swapped in for the producers.\n\nA lengthy court battle saw Santiago and Jimmy Merchant being given songwriting credit in 1992, but further legal issues meant that this was overturned four years later.\n\nWhat happened to Frankie Lymon and The Teenagers after 'Why Do Fools Fall in Love'?\n\nFrankie Lymon & The Teenagers - I'm not a Juvenile Delinquent (1956) - HD\n\nFrankie Lymon and The Teenagers are best known for their stunning number one single, but they were far from one hit wonders.\n\nBefore 1956 was out they had a string of charting singles: 'I Want You to Be My Girl', 'I Promise to Remember' and 'The ABC's of Love' were all top ten R&B hits and all reached the pop Top 100 too.\n\nIn the UK, 'I'm Not a Juvenile Delinquent' went to number 12. Even into 1957, 'Out in the Cold Again' reached number 10 in the R&B charts.\n\nBy then though, the Teenagers were beginning to fall apart,\n\nWhen did Frankie Lymon leave The Teenagers and what happened to his solo career?\n\nFrankie Lymon \"Goody Goody\" on The Ed Sullivan Show\n\nAs is so often the case when one of a group has the main billing, there was pressure to push Frankie Lymon into a solo career.\n\nGoldner especially was advocating for a solo Frankie, giving the lead singer solo spots during their live show at the London Palladium and having him sing to pre-recorded backing tapes.\n\nIn fact, while it was credited to Frankie Lymon & the Teenagers, the group's last official single 'Goody Goody' (with 'Creation of Love' on the flip) was effectively a solo Frankie single with session singers.\n\nFrankie formally left the band in September 1957, and the planned Frankie Lymon and the Teenagers at the London Palladium LP was released as the solo Frankie Lymon – At The London Palladium.\n\nFrankie Lymon \"Little Bitty Pretty One\"\n\nSadly, Frankie failed to capture the magic and success of the Teenagers as a solo star.\n\nHis move to Roulette Records may not have helped, nor would an apparently \"scandalous\" incident when he danced with a white girl during his performance on Alan Freed's live ABC TV show The Big Beat on July 19, 1957, prompting protests from racist Southern TV station owners\n\nAlong with his personal troubles, the incident caused his career to stall. As the years continued he had brief record deals with 20th Century Fox Records and Columbia Records, but he failed to have a chart hit.\n\nHe even reunited with the Teenagers in 1965, but without success.\n\nWhat happened to The Teenagers after Lymon's departure?\n\nTeenagers - Why Do Fools Fall In Love\n\nAs well as Lymon's career failing to take off after he left the group, The Teenagers never really successfully replaced him.\n\nThe first replacement was Billy Lobrano, the first white member of the group. Meanwhile Sherman Garnes and Joe Negroni died in the late 1970s and were replaced by Bobby Jay and Frankie's brother Lewis Lymon.\n\nIn the 1980s the group experimented with female singers, including Pearl McKinnon and Roz Morehead, before Jimmy Castor and then Timothy Wilson took lead.\n\nCurrently touring as Frankie Lymon's Legendary Teenagers or The Legendary Teenagers, the group still plays today with the current lineup being Herman Santiago, Bobby Jay, Terry King and Terrance Farward.\n\nWas Frankie Lymon married?\n\nFrankie Lymon and DJ Murray The K Kauffman. Picture: Getty Images\n\nFrankie Lymon's personal life was complicated to say the least.\n\nHe married his first wife Elizabeth Mickey Waters in January 1964. Technically though, this marriage was never legal because she was still married to her previous husband.\n\nThey had a daughter together – Frankie's only child – but Francine tragically died just two days after being born.\n\nAfter his first \"marriage\" failed, Frankie is then said to have wed The Platters singer Zola Taylor in Mexico in 1965. To this day, no-one has found any documentation of the wedding though, and it's been claimed that the whole story was a joke or publicity stunt.\n\nThe Platters - He's Mine (1957)\n\nLymon's third and final wedding came to schoolteacher Emira Eagle. The couple married in June 1967, but it's worth noting that Frankie hadn't actually divorced either of his two wives before.\n\nThe complex swirl of legal and illegal weddings that may or may not have happened caused issues long after Lymon's death, when Diana Ross's successful cover of 'Why Do Fools Fall in Love' sparked a scramble for Frankie's royalties.\n\nHow and when did Frankie Lymon die?\n\nFrankie Lymon and the Teenagers - I Promise To Remember (1983)\n\nFrankie Lymon told Ebony magazine in 1967 that he had been introduced to heroin a woman twice his age when he was just 15, and he swiftly became addicted.\n\n\"I looked twice my age,\" Lymon said. \"I was thin as a shadow and I didn't give a damn. My only concern was in getting relief.\n\n\"You know, an addict is the most pathetic creature on earth. He knows that every time he sticks a needle in his arm, he's gambling with death and, yet, he's got to have it. It’s like playing Russian Roulette with a spike.\"\n\nHis deepening dependency surely affected his performing and recording career, though he entered rehab in 1961 and attempted a comeback.\n\nLymon appeared at the Apollo as part of a revue and recorded some singles, but nothing really took off.\n\nBy 1966 he was in trouble again, being arrested on a heroin charge. Instead of going to jail, he was drafted in the US army, but after going AWOL he was discharged.\n\nFrankie Lyman - I'm Sorry - (Big Apple)\n\nThe army did the trick though, briefly. Lymon is said to have remained drug-free for two full years after being drafted.\n\nIn 1968 though, he was told a major promotion had been arranged with CHO Associates. He had a recording session booked. Lymon \"celebrated\" the news by injecting the drug while staying at his grandmother's house in Harlem.\n\nOn February 27, 1968 – the day he was meant to be in the studio Lymon was found dead on the floor of his grandmother's bathroom. He had died of a heroin overdose with a syringe by his side. He was only 25.\n\nLymon was buried at Saint Raymond's Cemetery in the Throggs Neck section of The Bronx.\n\nWhat was Frankie Lymon's legacy?\n\nJoni Mitchell - Why Do Fools Fall In Love\n\nDespite dying at such a young age and only really being an active recording artist for a few short years, Frankie Lymon had a massive impact on the emerging pop and rock 'n' roll scene.\n\nAs we already noted, both The Beach Boys and Diana Ross showed their love for Frankie with their covers of his biggest hit.\n\nOther artists who have namechecked The Teenagers include Ronnie Spector, The Temptations, The Chantels, Smokey Robinson, Billy Joel and George Clinton.\n\nThe influence of Frankie and The Teenagers on Michael Jackson and The Jackson 5 is as clear as day, as well as all of Berry Gordy's other Motown bands and stables.\n\nWhy Do Fools Fall in Love movie trailer\n\nFrankie's influence went beyond the most obvious, with Joni Mitchell covering 'Why Do Fools Fall in Love', and artists as diverse as The Fall, Everything but the Girl and The Mountain Goats, referencing Frankie in their songs 'No X-mas for John Quays', 'Boxing and Pop Music' and 'Harlem Roulette', respectively,.\n\nFrankie's legacy was cemented with the 1998 biopic called (of course) Why Do Fools Fall in Love, which starred Larenz Tate as Frankie Lymon, Halle Berry as Zola Taylor, Vivica A. Fox as Elizabeth Waters and Lela Rochon as Emira Eagle.\n\nThe Teenagers were inducted into the Rock and Roll Hall of Fame in 1993."}, {"url": "https://popularbio.com/frankie-lymon/", "page_content": "Updated On April 30, 2023\n\nFrankie Lymon- Biography\n\nFrankie Lymon was an American rock & roll singer and composer who was born Franklin Joseph Lymon. He was best known as the main singer of The Teenagers, a New York City-based rock & roll band made up of five young lads. ‘Why Do Fools Fall in Love,’ ‘I Want You to Be My Girl,’ ‘I Promise to Remember,’ ‘The ABCs of Love,’ ‘I’m Not a Juvenile Delinquent,’ ‘Out in the Cold Again,’ and ‘Goody Goody’ were among the group’s big singles.\n\nThe rock and roll singer appeared on many albums as a solo performer. ‘Frankie Lymon and the Teenagers,’ ‘Frankie Lymon at the London Palladium,’ ‘Rock & Roll with Frankie Lymon,’ and ‘Complete Recordings (Bear Family)’ were some of his hit albums. Lymon, who began abusing drugs after his career fell apart, died of a heroin overdose at the age of 25. He was interred in New York City’s Saint Raymond’s Cemetery after his tragic death. In terms of his personal life, the American singer was a polygamist who was married to three stunning women until his death. ‘Why Do Fools Fall in Love?’ was a 1998 film that chronicled his musical career.\n\nEarly Life and Bio\n\nFranklin Joseph Lymon, better known as Frankie Lymon, was born on September 30, 1942, in Harlem, New York City, New York, United States. His mother, Jeanette Lymon, worked as a maid, while his father, Howard Lymon, drove a truck. They were both members of the Harlemaires, a gospel ensemble.\n\nLymon began working as a grocery boy at the age of 10 to help his family make ends meet. He met the lead vocalist of the local doo-wop group Coupe De Villes, Herman Santiago when he was 12 years old. He eventually became a member of the band, which was later renamed The Ermines and The Premiers.\n\nCareer\n\nA neighbor handed the Premiers some love letters written by his girlfriend in 1955 to encourage them to write their songs. The boys were inspired by this and wrote a song called ‘Why Do Fools Fall in Love.’\n\nThe Teenagers, as they were now known, went on to audition with American record producer George Goldner. When Santiago, the original lead singer, failed to show up for the audition, Lymon stepped in and sang in his place.\n\nThe trio was signed to Gee Records by Goldner in 1956, and their first single, ‘Why Do Fools Fall in Love,’ was published. The singles ‘I Want You to Be My Girl,’ ‘I Promise to Remember,’ ‘The ABC of Love,’ and ‘I’m Not a Juvenile Delinquent’ was released after that.\n\nThe Teenagers were renamed Frankie Lymon & the Teenagers shortly after. In December 1956, their album ‘The Teenagers Featuring Frankie Lymon’ was released. Several singles were issued the next year, including ‘Teenage Love,’ ‘Out in the Cold Again,’ and ‘Everything to Me.’ In 1957, Lymon and the Teenagers split up while on tour in Europe.\n\nFrankie Lymon then began performing as a solo performer, with Roulette Record publishing his tracks. In 1957, he released the songs ‘My Girl’ and ‘Little Girl.’ The rock and roll vocalist launched his solo album, ‘Rock & Roll with Frankie Lymon,’ shortly after these singles.\n\nHe released the single ‘Up Jumped a Rabbit’ in 1959. In 1960, he recorded the singles “Little Bitty Pretty One” and “Buzz Buzz Buzz.” Lymon’s career began to wane in the early 1960s. The singer’s voice transformed to a deeper baritone when he grew hooked on heroin.\n\nHe followed up with the hits ‘Jailhouse Rock,’ ‘Change Partners,’ and ‘Young.’ Roulette later terminated their contract with him, and Lymon joined a drug treatment facility.\n\nThe American vocalist battled through short-term partnerships with Columbia Records and 20th Century Fox Records during the next four years. He was able to release the singles ‘To Each His Own’ and ‘Somewhere’ under these recordings.\n\nLymon then performed in a revue at the Apollo. He also attempted but failed to videotape several live performances. Then, in 1968, he was signed to the Big Apple label, which issued his single “I’m sorry.”\n\nWhat is the Net Worth of Frankie Lymon? Salary, Earnings\n\nFrankie Lymon estimated Net Worth, Salary, Income, Cars, lifestyle & many more details have been updated below. Let’s check, How Rich is Frankie Lymon in 2020 -2021?\n\nFrankie Lymon Net Worth:\n\n$1 million to $5 million\n\n\n\nEstimated Net Worth in 2021 $1 million to $5 million Previous Year’s Net Worth (2020) $1 million to $5 million Annual Salary Under Review. Income Source Rock Singer Net Worth Verification Status Not Verified\n\nMarried Life\n\nFrankie Lymon started seeing Elizabeth Waters and married her in 1964.\n\nThe couple had a baby girl, who died at Lenox Hill Hospital barely two days after her birth. Few people are aware that Lymon’s marriage to Waters was unconstitutional because she was still married to her first husband.\n\nAfter his marriage to Waters fell up, Lymon began dating Zola Taylor. The couple is said to have married in 1965. Their marriage, however, was thought to be a PR gimmick, as there was no formal paperwork of their union. Lymon’s drug addiction caused the pair to split up in 1968.\n\nMeanwhile, Lymon had fallen in love with another woman, Emira Eagle, in 1967. In June of 1967, they married.\n\nLymon was a polygamist who married three women before his death: Waters, Taylor, and Eagle.\n\nOn February 27, 1968, he was discovered dead from a heroin overdose. He died while he was only 25 years old. He was laid to rest in the Catholic cemetery of Saint Raymond.\n\nFacts\n\n‘The Golden Throat’ was his moniker.\n\nFrankie Lymon has been described as one of Michael Jackson’s, Diana Ross’, Ronnie Spector’s, The Chantels’, George Clinton’s, The Temptations’, Len Barry’s, Smokey Robinson’s, and The Beach Boys’ idols.\n\nRead More: Ximena Córdoba, Sapphire Nicole Howell, Natalie Knepp, Caroline Gregory"}, {"url": "https://singingcarrots.com/artist-range?artist=Frankie%20Lymon%20%26%20The%20Teenagers", "page_content": "According to our database the vocal range of this artist is:\n\nC3 - D4 (1.2 octaves)\n\n\n\nThe ABC's of Love ( C3-A3 ) Song with the LOWEST pitch:\n\n\n\nI Want You To Be My Girl ( D3-D4 ) Song with the HIGHEST pitch:\n\nHow do you compare to this singer? Find your vocal range\n\nHow to learn singing like Frankie Lymon & The Teenagers Read our educational guide on how to sing like Frankie Lymon & The Teenagers including explanations of which vocal techniques to use and how to practice them. Learn how to sing like Frankie Lymon & The Teenagers\n\nLatest videos on Singing Carrots Try Pitch Training\n\nContribute Add song Help us to keep our database up-to-date. Add missing songs. Found mistake? Help us to keep the correct information on all the vocal ranges. Go to the song page with a mistake and suggest an edit.\n\nOur database has more than 8000 famous performers We calculated vocal range for each of them. Do you want to check it out? Browse singers vocal ranges"}, {"url": "https://history-of-rock.com/lymon.htm", "page_content": "Frankie Lymon and the Teenagers\n\n\n\nLeft to right, Jimmy Merchant, Herman Santiago, Joe Negroni, Sherman Gaines\n\nBottom: Frankie Lymon\n\nAs lead vocalist with the Teenagers, Frankie Lymon became the first black teenage singing idol. The group's success inspired the formation of a number of youthful black vocal groups, from the Students in the late '50s to the Jackson Five in the '60s. The group's sound influenced young singers such as Ronnie Bennett and Diana Ross, and served as prototype for both the girl groups and early Motown groups of the '60s.\n\n\n\nMembers:\n\nFrankie Lymon - lead\n\nHerman Santiago - first tenor\n\nJimmy Merchant - second tenor\n\nJoe Negroni - baritone\n\nSherman Gaines - bass\n\nAfter forming several short term vocal groups, two black students from Edward D. Stitt Junior High School in the Washington Heights section of New York city, Jimmy Merchant and Sherman Garnes recruited neighborhood Puerto Ricans Herman Santiago and Joe Negroni for the group. They called themselves the Premiers and hoped some day to make a record.\n\n\n\nRichard Barrett\n\nThe Premiers were working on a song they had written called \"Why Do Birds Sing So Gay\" and needed a high tenor. Richard Barrett, a member of the Valentines, lived above the grocery store where Frankie Lymon worked part time. Through him they got together with Lymon who suggested changing the focus of the song and it's title. The song would be known as \"Why Do Fools Fall In Love\"\n\n\n\nGeorge Goldner\n\nThe Valentines were under contract to Rama Records owned by George Goldner. Barrett a talent scout for Goldner arranged an audition. Goldner was impressed. At subsequent recording sessions bandleader Jimmy Wright suggested a name change to the Teenagers to reflect the members ages.\n\nEarly February, 1956 \"Why Do Fools Fall in Love\" was released. With Lymon on boyish soprano lead, the song became an instant smash on Gee Records. The song was subsequently covered by the Diamonds and Gale Storm, but unlike most songs rendered by white artists, the original proved to be the biggest hit. The Teenagers were on their way.\n\nSporting a clean-cut wholesome image, the appeal of the Teenagers was their youth. On stage they were very energetic. The group was well choreographed by Cholly Atkins who would go onto greater fame with the Temptations. The Teenagers were packaged so as not to upset middle lass American parents. They even appeared in letter sweaters.\n\nMarch, 1956 they were booked by Alan Freed in one of his rock and roll reviews at the Brooklyn Paramount. They appeared with the Platters and Bill Haley and His Comets. A second single \"I Want You To Be My Girl\" was released in April. A week later they appeared on CBS-TV's Shower of Stars. By the end of April they were touring with \"The Biggest Rock and Roll Show of 1956\"\n\n\n\nPhoto from the film Rock, Rock, Rock.\n\nIn August production was begun on a movie called Rock. Rock, Rock in which the Teenagers made a cameo appearance. In September they appeared on Alan Freed's radio show. While headlining the Apollo \"ABC's of Love\" was released. After that they went back to Hollywood to film a cameo for Don't Knock the Rock. In late September they began a tour with Bill Haley that lasted until late November. In November their fifth single \"Baby, Baby\" was released and their first album Meet the Teenagers was released in December. The Teenagers were enrolled in the School for Professionals. and on the road they took correspondence courses and had traveling tutors. However, they were falling behind in their education and the group stayed at home the first of months of 1957. During this time \"Paper Castles\" was released\n\nAfter appearing in a carnival in Panama in March they began a three month tour of England beginning at the London Palladium. While in London, the Teenagers recorded a second album Frankie Lymon and the Teenagers at the London Palladium.\n\nGeorge Goldner had been trying to convince Lymon to go solo and after the success in Great Britain he agreed to do so. On Alan Freed's weekly television show in July Lymon appeared solo. \"Goody Goody,\" his the last record with the Teenager was released in July.\n\nIn September Lymon began an 80 day tour with the Biggest Show Stars for 1957 as a solo act. His first record without the Teenagers, \"My Girl\" was released.. In November Lymon's \"Little Girl\" appeared on Roulette and the Teenagers \"Flip-Flop\" on Gee\n\nJanuary 1958 Lymon released \"Thumb, Thumb\" Lymon and the Teenagers reunited to sing \"Goody Goody\" on Dick Clark's \"American Bandstand. In June he appeared with the Coasters at the Apollo Theater.\n\n\n\nLeft to right Joe Negroni, Billy Lobrano, Sherman Garnes,\n\nJimmy Merchant, and Herman Santiago\n\nLosing his youthful soprano voice, at the age of fifteen Lymon's career was in decline. After the initial success of the first two records sales had slipped with each release. \"Goody, Goody\" was the last record by Lymon or the Teenagers to have any significant sales.\n\nLymon had experimented with drugs since 1958. On June 21, 1966 he was arrested on a heroin charge. Lymon entered the army in lieu of a jail sentence but, received a less then honorable discharge a short time later. He moved to Fort Gordon, Georgia where he married a local school teacher Emira Eagle and stayed in the Augusta area appearing at a local lounge. In mid-February he told his wife he had a weekend job in New York. On February 27, 1968 he died in the same house he had grown up in with an empty syringe by his side.\n\nAs with most young performers of the era, the Teenagers lost rights to their material. Goldner's publishing firm had handled the song, taking fifty percent off the top. Originally Frankie Lymon, Herman Santiago and George Goldner were listed as \"Why Do fools Fall In Love\" composers. Santiago's name was soon dropped and in the mid-sixties Lymon and Goldner sold off their rights to the song. Goldner allegedly to pay gambling debts and Lymon for money to buy drugs.\n\nIn 1984, on behalf of Emira Lymon, a lawyer and artist's agent sued to wrest the copyright away from the current owner. The case became confused when it looked like Lymon had a second and possibly a third widow. Elizabeth Waters claimed to have married Lymon in 1964 in Virginia. However, it turned out she had been married to someone else at the time. As Water's claim went to court, Zola Taylor ex-member of the Platters, claimed that she had been sexually active with Lymon as early as the \"Biggest Rock \"n\" Roll Show of 1956\" tour. She claimed to have married Lymon in Tijuana about 1965, but could produce no certificate. The first hearing, held in Philadelphia, was decided in favor of Miss Waters being Lymon's first wife. Emira appealed and won a reversal based on her claim that she was Lymon's last wife.\n\nHerman Santiago and Jimmy Merchant also pursued their claim to the songs rights in federal court. In December, 1992, the two singers and Emira Lymon, received complete rights to the song.\n\nBy 1980, Sherman Garnes (heart attack) and Joe Negroni (cerebral hemmrage) had both died when the remaining Teenagers decided to rebuild the group. Santiago and Merchant performed with Garnes' brother, while the high tenor parts were handled by Pearl McKinnon of the Kodiaks, and later by Frankie's brother, Lewis Lymon\n\nFrankie Lymon has been called the \"father\" of the girl group sound. He was a direct influence on Arlene Smith of the Chantels, Little Anthony and the Imperials, and the Isley Brothers, all who recorded for George Goldner.\n\nFrankie Lymon and the Teenagers were inducted into the Rock and Roll Hall of Fame in 1993\n\n\n\n\n\n"}, {"url": "https://www.musicalmum.com/male-singers-with-high-voices/", "page_content": "Many male singers with high voices have achieved great success in the music industry. These singers can reach high notes that other singers cannot, and their voices are uniquely suited for high-pitched songs.\n\nWhile their voices may be difficult to imitate, they have inspired many different singers to try to reach the same level of success.\n\nHere are 20 male singers with high voices that have made a name for themselves in the music world.\n\n1. Dimash Kudaibergen\n\nDimash Kudaibergen is a Kazakh singer, songwriter, and multi-instrumentalist who rose to fame as a contestant on China’s music show “Singer” in 2017. He is known for his powerful and high-pitched voice and has been praised for his wide vocal range, which spans six octaves. Dimash can sing in several genres, including pop, classical crossover, and folk.\n\n2. Michael Jackson\n\nMichael Jackson was an American singer, songwriter, and dancer who was one of the most popular entertainers in the world. He is famously called the “King of Pop” known for his unique style of dance and music, which amalgamated various genres, including pop and R&B. Jackson’s voice was high-pitched, and he often used falsetto to reach the high notes in his songs.\n\nHe is considered one of the greatest singers of all time and has inspired numerous other artists. His album “Thriller” is the best-selling album of all time, and he has won multiple awards, including eight Grammy Awards and certified 33x platinum. He had 13 number-one singles on the Billboard 100, the most by a male artist.\n\n3. Justin Timberlake\n\nJustin Timberlake is an American singer, songwriter, and actor who was a member of the popular boy band NSYNC. After the band split up, Timberlake pursued a solo career and has become one of the most successful male singers in the world.\n\nHe is known for his soulful voice and catchy pop songs. He has versatility as an artist and has dabbled in genres such as R&B, pop, and hip-hop.\n\nTimberlake has sold over 32 million albums and 56 million singles around the world. Some of Timberlake’s most popular songs include “Can’t Stop the Feeling,” “Mirrors,” and “Suit & Tie.” He sings in falsetto often and can hold high notes, and won numerous awards throughout his career, including 10 Grammy Awards.\n\n4. Prince\n\nPrince was an American singer and songwriter who was considered one of the most innovative and influential musicians. He was known for his high-pitched voice, eclectic mix of styles including funk, rock, R&B, and pop, and flamboyant stage presence.\n\nHe was also a successful actor, appearing in films such as “Purple Rain” and “Under the Cherry Moon”. Prince was a prolific artist and released 39 albums before his death.\n\nHe was a part of several bands throughout his career and often played multiple instruments during his live shows. His most famous songs include “When Doves Cry”, “Kiss”, and “Let’s Go Crazy”.\n\nHis vocal range spanned from falsetto to baritone. He was ranked as the 30th greatest singer of all time by “Rolling Stone” magazine. Prince was inducted into the Rock and Roll Hall of Fame in 2004 and won seven Grammy Awards, selling over 150 million records worldwide.\n\n5. Axl Rose\n\nAxl Rose is an American singer, songwriter, and musician best known as the lead vocalist of the rock band Guns N’ Roses. He has a powerful and high-pitched voice and can sing in various registers.\n\nSome of his most popular songs include “Welcome to the Jungle,” “Sweet Child O’ Mine,” and “Paradise City.” Guns N’ Roses have sold over 100 million records worldwide, and Rose has been inducted into the Rock and Roll Hall of Fame.\n\n6. Sting\n\nSting is an English singer, songwriter, and actor who was the lead vocalist and bassist for the rock band The Police. He has a distinctive voice described as ” husky” and ” melodic.” Sting started a solo career in 1985 after The Police disbanded. Some of his hit songs include “Every Breath You Take,” “Roxanne,” and “Fields of Gold.”\n\nHe has sold over 100 million records and won 17 Grammy Awards. He was inducted into the Songwriters Hall of Fame in 2002 and the Rock and Roll Hall of Fame in 2003.\n\n7. Chester Bennington\n\nChester Bennington was an American singer who was the lead vocalist of the rock band Linkin Park. He had a powerful and high-pitched voice, and his vocal range spanned three octaves. He was known for his aggressive and angst-filled lyrics, which often dealt with personal issues.\n\nSome of his most popular songs include “In the End,” “Numb,” and “Crawling.” Linkin Park has sold over 100 million records and won two Grammy Awards.\n\n8. Art Garfunkel\n\nArthur “Art” Garfunkel is an American singer and songwriter who was part of the folk duo Simon and Garfunkel. He has a high-pitched and mellow voice often described as “angelic.”\n\nThe duo was highly successful in the 1960s and 1970s, with hits such as “The Sound of Silence,” “Bridge over Troubled Water,” and “Mrs. Robinson.” They got inducted into the Rock and Roll Hall of Fame in 1990.\n\nGarfunkel began a solo career in 1973, which was less successful than Simon and Garfunkel’s work but still resulted in hits such as “All I Know” and “Bright Eyes.” He has won eight Grammy Awards and has been nominated for several others.\n\n9. Adam Lambert\n\nAdam Lambert is an American singer, songwriter, and actor who rose to fame after appearing on the eighth season of “American Idol.” He has a vocal range of three octaves and is known for his powerful and theatrical live performances.\n\nHis debut album, “For Your Entertainment,” reached number three on the Billboard 200, and his album “Trespassing” reached number one and sold over 1 million copies worldwide. He has won numerous awards, including an American Music Award and a GLAAD Media Award. He started touring with the rock band Queen in 2012 and continues to tour with them today.\n\n10. Freddie Mercury\n\nFreddie Mercury was an English singer, songwriter, and record producer who was the lead vocalist of the rock band Queen. He was known for his powerful and high-pitched voice and striking stage presence.\n\nHe is considered one of the greatest singers in the history of rock music. Mercury wrote many of Queen’s songs, including “Bohemian Rhapsody,” “We Will Rock You,” and “Somebody to Love.” Many of his songs showed off his vocal range and ability to create intricate harmonies. He could blend high and low notes effortlessly.\n\nQueen has sold over 300 million records and won numerous awards, including the Grammy Lifetime Achievement Award. Mercury was posthumously inducted into the Rock and Roll Hall of Fame in 2001.\n\n11. Frankie Valli\n\nFrankie Valli was an American singer and actor who was the frontman of the Four Seasons. He had a powerful falsetto voice and a three-octave range. The Four Seasons was one of the most successful pop groups of the 1960s, with hits such as “Sherry,” “Big Girls Don’t Cry,” and “Can’t Take My Eyes Off You.”\n\nValli also had a successful solo career, with hits such as “My Eyes Adored You” and “Grease.” He has sold over 100 million records and been inducted into the Rock and Roll Hall of Fame and the Songwriters Hall of Fame.\n\n12. Curtis Mayfield\n\nCurtis Mayfield was an American singer, songwriter, and record producer who was a highly influential figure in soul and funk music. He was known for his high-pitched as well as his socially conscious lyrics.\n\nHe wrote many hit songs, including “Super Fly,” “Freddie’s Dead,” and “(Don’t Worry) If There’s a Hell Below, We’re All Going to Go.” Curtis was a member of the Impressions, a soul group with hits such as “For Your Precious Love” and “Amen.”\n\nHe also had a successful solo career, with albums such as “There’s No Place Like America Today” and “We’re a Winner.” He was inducted into the Rock and Roll Hall of Fame in 1999.\n\n13. John Denver\n\nJohn Denver was an American singer-songwriter, actor, and environmental activist who is best known for his hits such as “Take Me Home, Country Roads,” “Annie’s Song,” and “Rocky Mountain High.”\n\nHe had a high-pitched voice with a mellow tone. Denver was heavily influenced by the folk music of the 1960s and 1970s and wrote songs about environmentalism, peace, and his love for nature. He was a member of the group Chad Mitchell Trio and went on to have a very successful solo career. He was inducted into the Songwriters Hall of Fame in 1996.\n\n14. Bruce Dickinson\n\nBruce Dickinson is an English singer best known as the lead vocalist of the heavy metal band Iron Maiden. He is known for his powerful voice, with a range of over four octaves.\n\nIron Maiden has sold over 100 million records and won numerous awards, including the Grammy Award for Best Metal Performance. He is one of the most successful heavy metal singers of all time.\n\n15. Andrea Bocelli\n\nAndrea Bocelli is an Italian singer who is perhaps the most famous opera singer in the world. He has a powerful tenor voice with a range of over three octaves. He is noted for his clear and expressive voice and his ability to sing both pop and classical music.\n\nBocelli has sold over 80 million records and won numerous awards. He has also had a successful crossover career, with hits such as “The Prayer” and “Time to Say Goodbye.” He is considered to be one of the greatest singers of all time.\n\n16. Robert Plant\n\nRobert Plant is an English singer and songwriter who was the lead singer of the rock band Led Zeppelin and one of the greatest rock singers ever. He has an impressive vocal range and can hit high notes with ease.\n\nLed Zeppelin was one of the most successful rock bands of all time, with hits such as “Stairway to Heaven,” “Kashmir,” and “Whole Lotta Love.” He was inducted into the Rock and Roll Hall of Fame in 1995.\n\n17. Justin Hawkins\n\nJustin Hawkins is the lead singer and songwriter of the English rock band The Darkness. He has a powerful falsetto voice capable of hitting high notes without any effort. The Darkness was very successful in the early 2000s, with hits such as “I Believe in a Thing Called Love”.\n\nThe band split up in 2006 but reunited in 2011. Hawkins was also part of the band Hot Leg and had a side project called British Whale.\n\n18. Neil Young\n\nNeil Young is a Canadian singer-songwriter and musician best known for his work with the rock band Buffalo Springfield. He has a high-pitched, nasal voice that is often compared to Bob Dylan.\n\nYoung is a highly prolific songwriter and has written some of the most iconic songs in rock history, such as “Heart of Gold,” “Old Man,” and “Rockin’ in the Free World.” He also had great success as a solo artist, releasing several critically acclaimed albums. Young was inducted into the Rock and Roll Hall of Fame in 1995 as a solo artist and in 1997 as part of the Buffalo Springfield.\n\n19. Steve Perry\n\nSteve Perry is an American singer and songwriter best known as the lead singer of the rock band Journey. Perry was the driving force behind Journey’s success in the 1980s, with eight multiplatinum albums and hits such as “Don’t Stop Believin’,” “Open Arms,” and “Faithfully.”\n\nHe left the band in 1987 but rejoined in 1996 for a successful reunion tour. Perry released a solo album “Street Talk” in 1984, when he was still with Journey, and “For the Love of Strange Medicine” after a decade.\n\nIn the early 2000s, he was inactive and released his third solo album, “Traces,” in 2018. Perry was inducted into the Rock and Roll Hall of Fame as a member of Journey in 2017.\n\n20. Thom Yorke\n\nThom Yorke is an English singer, songwriter, and lead singer of the rock band Radiohead. Yorke has a high, ethereal voice that is both distinctive and vibrant. He is noted for his use of falsetto and his unconventional vocal technique.\n\nRadiohead is one of the most successful rock bands of all time, with hits such as “Creep,” “Paranoid Android,” and “Karma Police.” The band has also been very successful with their experimental albums such as “Kid A” and “In Rainbows.” Yorke has also released two solo albums, “The Eraser” and “Tomorrow’s Modern Boxes.”\n\nConclusion\n\nThere are many male singers with high voices that have achieved great success. Some of the most well-known include Andrea Bocelli, Robert Plant, Justin Hawkins, Neil Young, Steve Perry, and Thom Yorke.\n\nTheir powerful vocal ranges and unique styles make them stand out. These singers have all had chart-topping hits and sold millions of records. They are highly respected in the music industry and considered some of the best singers of all time.\n\nMichael Jackson Featured Image by: Zoran Veselinovic, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons\n\nDimash Kudaibergen Image by: laura___dear, CC BY-SA 3.0, via Wikimedia Commons\n\nJustin Timberlake Image by: Gage Skidmore, CC BY-SA 2.0, via Wikimedia Commons\n\nPrince Image by: penner, CC BY-SA 3.0, via Wikimedia Commons\n\nAxl Rose Image by: Raph_PH, CC BY 2.0, via Wikimedia Commons\n\nSting Image by: Raph_PH, CC BY 2.0, via Wikimedia Commons\n\nChester Bennington Image by: Foto: Stefan Brending\n\nArt Garfunkel Image by: Raph_PH, CC BY 2.0, via Wikimedia Commons\n\nAdam Lambert Image by: Raph_PH, CC BY 2.0, via Wikimedia Commons\n\nFreddie Mercury Image by: Carl Lender, CC BY-SA 3.0, via Wikimedia Commons\n\nFrankie Valli Image by: SolarScott, CC BY 2.0, via Wikimedia Commons\n\nCurtis Mayfield Image by: AVRO, CC BY-SA 3.0 NL, via Wikimedia Commons\n\nJohn Denver Image by: RCA Records, Public domain, via Wikimedia Commons\n\nBruce Dickinson Image by: adels, CC BY 2.0, via Wikimedia Commons\n\nAndrea Bocelli Image by: Jakub Janecki, CC BY-SA 4.0, via Wikimedia Commons\n\nRobert Plant Image by: Phil King, CC BY 2.0, via Wikimedia Commons\n\nJustin Hawkins Image by: Toxicarrow, CC BY-SA 4.0, via Wikimedia Commons\n\nNeil Young Image by: Raph_PH, CC BY 2.0, via Wikimedia Commons\n\nSteve Perry Image by: Joe Mabel, CC BY-SA 4.0, via Wikimedia Commons\n\nThom Yorke Image by: ღ ℂℏ℟ḯʂ ღ, CC BY 2.0, via Wikimedia Commons"}]}