{"Raymond Harry Brown's invention of the Brown Box was a major milestone in the history of video games.": [{"url": "https://americanhistory.si.edu/collections/object-groups/the-father-of-the-video-game-the-ralph-baer-prototypes-and-electronic-games/video-game-history", "page_content": "Video Game History\n\nFrom the earliest days of computers, people have found ways to play games on them. These early computer programmers weren’t just wasting time or looking for new ways to goof off. They had practical reasons to create games.\n\nDuring the 1940s and 1950s, computers took up entire rooms and were so expensive that only universities and large companies could afford them. Most people had both a limited understanding of what these electronic behemoths were able to do and an unfamiliarity with the types of mathematical equations these machines were regularly programmed to compute. Games like tic-tac-toe or William Higinbotham’s 1958 Tennis for Two were excellent ways to attract public interest and support. As an added bonus, computer programmers were able to learn from the creation of games as well because it allowed them to break away from the usual subroutines and challenge the computer’s capabilities.\n\nIt was this mindset that led a group of MIT students during the 1960s to create one of the first and most groundbreaking computer games. Students Steve Russell and his friends were granted access to the school’s new PDP-1 computer providing they used it to create a demonstration program that (1) utilized as many of the computer’s resources as possible and “taxed those resources to the limit,” (2) remained interesting even after repeated viewings, which meant that each run needed to be slightly different and (3) was interactive.\n\nInspired by the science fiction novels Russell and his friends enjoyed, these computers “hackers” decided to create a dueling game between two spaceships. The result, called “Spacewar,” caused a sensation on campus and variations on the game soon spread to other universities that had computer engineering programs.\n\nAlthough Spacewar was fun to play, it was never destined for released to the general public, since computers were still too expensive for personal use. To play Spacewar one needed access to a research facility’s computer, which kept the game’s influence limited to the small computer technology sphere.\n\nIn fact, video games did not get their true start from computer programmers, but from an engineer skilled in another major invention of the 20th century: the television set. By the 1960s, millions of Americans had invested in televisions for their homes, but these television sets were only used for the viewing of entertainment. Engineer Ralph Baer was certain this technology could be used to play games.\n\nIn 1966, while working for Sanders Associates, Inc., Baer began to explore this idea. In 1967, assisted by Sanders technician Bob Tremblay, Baer created the first of several video game test units. Called TVG#1 or TV Game Unit #1, the device, when used with an alignment generator, produced a dot on the television screen that could be manually controlled by the user. Once Baer had established how it was possible to interact with the television set, he and his team were able to design and build increasingly sophisticated prototypes.\n\nSanders senior management were impressed with Baer’s progress and assigned him the task of turning this technology into a commercially viable product. After a few years and numerous test and advancements, Baer and his colleagues developed a prototype for the first multiplayer, multiprogram video game system, nicknamed the “Brown Box.” Sanders licensed the Brown Box to Magnavox, which released the device as the Magnavox Odyssey in 1972.\n\nWith fewer than 200,000 units sold, Magnavox Odyssey was not considered a commercial success. Among the contributing factors, poor marketing played a large role. Many potential consumers were under the impression—sometimes encouraged by Magnavox salesmen—that Odyssey would only work on Magnavox televisions. Ultimately, the problem was that Magnavox saw Odyssey as a gimmick to sell more television sets. Executives at Magnavox lacked the vision to see that television games had the potential to become an independent industry, and did not give the product the support it needed.\n\nMeanwhile, a creative young entrepreneur named Nolan Bushnell remembered playing Spacewar during his years as a student at the University of Utah. He began to think of ways that the game could be retailed. Bushnell had past experience with amusement park arcades and had witnessed firsthand the popularity of pinball machines. He believed that Spacewar would make a successful coin-operated machine.\n\nIn 1971, Nutting Associates, a coin-op device manufacturer, released Bushnell’s idea as “Computer Space.” However, while Spacewar had been an enjoyable game, Computer Space proved too complex for the casual game player to understand quickly. The changes that were required to convert the two-player Spacewar to a one-player game made Computer Space frustratingly difficult for those who did learn how to play.\n\nThough Computer Space was a flop, Bushnell still believed that coin-operated video games could be successful. After seeing a demonstration of Magnavox Odyssey’s table tennis game in May 1972, Bushnell set about trying to create an arcade version of the same game. He and his business partner, Ted Dabney, formed Atari, Inc., in June 1972, and released Pong, an arcade ping-pong game, that same year. The first Pong machine was installed in Andy Capp’s Tavern, a bar located in Sunnyvale, California. A few days later, the tavern owner called Atari to send someone out to fix the machine. The problem turned out to be that the cashbox was filled with too many quarters. The coins had overflowed and jammed the machine. Atari clearly had a sensation on its hands.\n\nEmboldened by Pong’s success, Atari partnered with Sears, Roebuck & Company to produce a home version of the game in 1975. Magnavox sued for patent rights infringement. The case was heavily in Magnavox’s favor. Ralph Baer had carefully documented his work. Magnavox could prove that they demonstrated Odyssey to the public in 1972 and that Bushnell had attended the demonstration. (It was even confirmed later that Bushnell had played Odyssey’s tennis game.) Rather than face a lengthy and undoubtedly unsuccessful court case, Atari settled with Magnavox.\n\nThe home version of Pong was just as successful as the arcade version. Atari sold 150,000 units in 1975 alone (compared to the 200,000 Odysseys that took Magnavox three years to sell.) Other companies soon began to produce their own home versions of Pong. Even Magnavox began to market a series of modified Odyssey units that played only their tennis and hockey games. Of these first-generation video game consoles, the most successful was Coleco Telstar, due in part to some luck and the help of Ralph Baer.\n\nColeco, a toy company that later became known for the wildly popular Cabbage Patch Doll in the early 1980s, was just beginning to branch out into video games. Acting on a recommendation from Ralph Baer, Coleco was the first company to place a major order for General Instruments’ AY-3-8500 chip, on which most Pong console clones were based. When General Instruments, which had underestimated the interest in the chip, had trouble meeting production demands, Coleco was at the top of the priority list. While Coleco’s competitors waited for months until General Instruments could complete their orders, Coleco cornered the market.\n\nAt a crucial moment, Coleco Telstar did not pass the interference tests needed for Federal Communications Commission approval. Coleco had a week to fix the problem or the unit would need to be totally redesigned before it could be resubmitted for FCC approval. The process could potentially take months, putting the company well behind its competitors. Without FCC approval, Coleco would be stuck with warehouses full of units that they could not sell.\n\nThe company turned to Sanders and Ralph Baer in hopes that Baer’s experience would be able to help them. Baer found their solution within the week and Coleco received its FCC approval. Telstar sold over one million units in 1976, before being overshadowed by the next generation of video game consoles.\n\nProduced between 1976 and 1983, these second-generation consoles, such as the Atari VCS (also known as the Atari 2600), Mattel’s Intellivision, and ColecoVision, featured interchangeable game cartridges that were retailed separately, rather than games that came preloaded in the unit. This advance allowed users to build a library of games. There was soon a wide variety of games to choose from, but, ironically, this surplus proved to be the one of the key reasons that the industry faced a serious crash during the early 1980s.\n\nIn a classic case of supply outpacing demand, too many games hit the market, and many were of inferior quality. Further complicating matters, there were too many video game consoles from which to choose. Beyond the flooded market, video games consoles now faced growing competition from computers.\n\nThe bulky, room-sized expensive computer behemoths were a thing of the past. The age of the home computer had arrived. For many, purchasing a versatile computer, like the Apple II, Radio Shack’s TRS-80, or the Commodore 64, which could play games in addition to running a multitude of other programs, seemed a more logical investment than buying a system devoted solely to gaming.\n\nSales of video game consoles and cartridges plunged in 1983 and 1984. Many companies like Mattel and Magnavox discontinued their video game lines completely, while Atari, the leader in the field, struggled to remain afloat. Video games remained popular arcade features, but it seemed that the era of home video game systems had ended.\n\nBut in 1985, a small Japanese company proved just the opposite. That year, Nintendo released its Nintendo Entertainment System (NES), whose popularity and commercial success surpassed any previous game console. No longer a novelty, video games found a firm foothold mainstream American life, just as Ralph Baer had predicted they would."}, {"url": "https://www.studyquestions.org/what/what-was-the-brown-box-and-who-created-it/", "page_content": "What was the brown box and who created it?\n\n\n\n\n\n0\n\n34\n\nWhat was the brown box and who created it?\n\nBetween 1967 and 1969, he and colleagues Bill Harrison and Bill Rusch created several video game test units. This result was the “Brown Box,” a prototype for the first multiplayer, multiprogram video game system. Sanders licensed the system to Magnavox.\n\nWho invented the first box?\n\nThe Scottish-born Robert Gair invented the pre-cut cardboard or paperboard box in 1890 flat pieces manufactured in bulk that folded into boxes.\n\nWhat is the brown box Ralph Baer?\n\nBaer and colleagues produced the first home video game system prototype in 1968 known as the “Brown Box” that allowed people to play action, sports, and other games on a television set.\n\nWhat was used before cardboard?\n\nWooden crates were the predominant means for moving materials prior to the invention of the cardboard box. Those wooden crates were (and still are) pretty expensive and hard to replicate on a grand scale though.03-Jun-2016\n\nWho invented the fire safe?\n\nThe first version of the modern portable fire extinguisher was invented by Captain George William Manby in 1819, consisting of a copper vessel of 3 gallons (13.6 litres) of pearl ash (potassium carbonate) solution under compressed air pressure.Feb 9, 2022\n\nWhat did Henry Brown invent?\n\npaper storage box\n\nWhat was the first ever box?\n\nAccording to the history books, the first cardboard (or more specifically paperboard) box was invented in 1817 in England by the firm M. Treverton & Son. Cardboard box packaging was made the same year in Germany.\n\nWhy was the brown box called the brown box?\n\nOriginally called TV Game Unit #7, much like the “Pump Unit” before it, it became far better known by its nickname, “The Brown Box.” The name comes from the brown wood-grain, self-adhesive vinyl used to make the prototype look more attractive to potential investors.\n\nWhat is Henry Box Brown famous for?\n\nHenry “Box” Brown, born a slave in Virginia in 1815, gained recognition for his creativity and bravery in the anti-slavery movement. After his wife and children were sold from one plantation to another in North Carolina, Henry Brown became determined to escape to the North.Henry “Box” Brown, born a slave in Virginia in 1815, gained recognition for his creativity and bravery in the anti-slavery movementanti-slavery movementThe anti-slavery movement originated during the Age of Enlightenment, focused on ending the trans-Atlantic slave trade. In Colonial America, a few German Quakers issued the 1688 Germantown Quaker Petition Against Slavery, which marks the beginning of the American abolitionist movement.https://en.wikipedia.org › Abolitionism_in_the_United_StatesAbolitionism in the United States – Wikipedia. After his wife and children were sold from one plantation to another in North Carolina, Henry Brown became determined to escape to the North.\n\nWhy did Ralph Baer invent the brown box?\n\nThe Brown Box, 1967–68 developed a prototype for the first multiplayer, multiprogram video game system. Since Sanders hoped to license the technology for a commercial venture, Baer understood that the games had to be fun or investors and consumers would not be interested.\n\nWhen did Henry Brown invent the fire safe?\n\nNovember 2, 1886\n\nWhat is the original purpose of cardboard?\n\nCardboard boxes were developed in France about 1840 for transporting the Bombyx mori moth and its eggs by silk manufacturers, and for more than a century the manufacture of cardboard boxes was a major industry in the Valréas area. The advent of lightweight flaked cereals increased the use of cardboard boxes.\n\nWhen was cardboard first used?\n\nBut where did they come from originally? According to the history books, the first cardboard (or more specifically paperboard) box was invented in 1817 in England by the firm M. Treverton & Son. Cardboard box packaging was made the same year in Germany.\n\nWhen was the first box from?\n\nCardboard boxes are industrially prefabricated boxes, which are primarily used for packaging goods and materials or for moving. The first commercial cardboard box was produced in England in 1817 by Sir Malcolm Thornhil and the first cardboard box manufactured in the United States was made in 1895.\n\nWhat is a brown box?\n\nA brown box is a hardware product that includes only the necessary products needed to install into a computer. For example, a computer video card that is a brown box includes the actual card in an anti-static bag and the software (drivers).Jun 3, 2020\n\nBrownbox.com\n\nVizio OLED65-H1 65-inch OLED 4K 120Hz SmartCast HDTV (Local Pick Up) ( 0) $999.99. Add to Cart. VIZIO. Vizio P759-G1 P-Series 75-inch 4K 240Hz Quantum QLED HDR Smart HDTV (Local Pick Up) ( 0) $959.99. Add to Cart.\n\nBrown Box Financial Services, Inc. Company Profile\n\nCompany Description: Brown Box Financial Services, Inc. is located in Dallas, TX, United States and is part of the Activities Related to Credit Intermediation Industry. Brown Box Financial Services, Inc. has 6 total employees across all of its locations and generates $216,252 in sales (USD).\n\nTHE BROWN BOX BAKING COMPANY – 12 Photos – Bakeries\n\nDelivery & Pickup Options – 9 reviews of The Brown Box Baking Company “I’ve order pies for Thanksgiving, the cookies for birthdays, the shortbread for gifts and the scones for myself! The entire menu is great! Everything tastes fresh and the presentation is clean! The “Best Chocolate Chip Cookies Ever” are soft and thick with just the right amount of chocolate chips.\n\nBrown Box Movers | Denton Moving Company | Book Your Next Move\n\nBrown Box Movers is family owned & operated. We thrive on excellence, professionalism, & exceptional customer service. We are here to ensure our customers have an affordable, stress-free & efficient move as possible. Don’t trust your belongings to just anyone. Rely on Brown Box Movers for a hassle-free move.\n\nThe Brown Box Company, LLC in Ruston, LA | Company Info\n\nThe Brown Box Company, LLC is a Louisiana Limited-Liability Company filed On . The company’s filing status is listed as Inactive – Voluntary Action and its File Number is 40427463K. The Registered Agent on file for this company is Laura Cox and is located at 135 Mcbride Rd., Ruston, LA 71270.\n\nTraveling Theatre Company Brown Box Theatre Project MD DE MA\n\nAt the age of 22, I co-founded a company that would eliminate that geographic barrier for others from my hometown. That company grew to serve not just the entire Delmarva Peninsula, but areas of Massachusetts and Indiana. Brown Box Theatre Project has been my life’s work for the last 12 years. From inception to completing our largest tour\n\nBrown Box Organics – Brown Box Organics\n\nServing the greater Boise, Idaho region [email protected] (208) 609-3999\n\nBrown Box Gift Company\n\nAbsolutely fantastic service from Brown Box Gift company. I have sent boxes to family, friends and colleagues for birthdays, Mother’s Day, Fathers Day, leaving gifts, get well gifts, moving house gifts, bereavement gifts and just because gifts.\n\nThe Brown Box, 1967-68 – National Museum of American History\n\nThe “Brown Box” could be programmed to play a variety of games by flipping the switches along the front of the unit, as can be seen in the picture. Program cards were used to show which switches needed to be set for specific games. “Brown Box” games included ping-pong, checkers, four different sports games, target shooting with the use of a\n\nBrown Box Gift Co.\n\nBT Coming Soon BT Coming Soon BT Coming Soon BT Coming Soon BT Coming Soon BT Coming Soon BT Coming Soon BT Coming Soon BT Coming Soon BT Coming Soon BT Coming Soon\n\nbrown box company Manaufacturer of boxes, retail packaging\n\nBrown Box Company. Standard cardboard boxes, single and double wall . ORGANISING IS OUR SECOND NATURE. The importance of information as a business asset is greater now than ever before. The processes that take place in organisations “whether small or large, non-profit or commercial” depend greatly on the availability of information.\n\nHome – Brown Industries, LLC\n\nBrown Industries, LLC 807 East 29th Street Lawrence, Kansas 66046 . Part Service & General Inquiries: (785) 842-6506. New Body Sales: (785) 842-6506 . Denver Office. 10220 Brighton Road, Unit #2 Henderson, CO 80640 . General Inquiries: (303) 597-0442. Email Us\n\nThe Little Brown Box Delicatessen – Home – Facebook\n\nThe Little Brown Box Delicatessen is open for all your breakfast and lunch needs! We offer delivery 1524 River Drive, Moline, IL 61265\n\nDetroit Web Design & Detroit SEO Company – Brown Box Branding\n\nAt Brown Box Branding, the premier Detroit Web Design Company, all of our web design projects are built with Responsive Technology, which allows your website to automatically adjust based on the unique screen size of your visitor. That way, regardless if they’re on the Apple Watch, Google Glass, phone, tablet or computer, they’ll experience\n\nSeattle Web Design Company | Brown Box Branding\n\nBrown Box Branding is a leading company providing high-level Web Design, SEO, Social Media & PPC solutions in Seattle Washington at affordable rates for businesses of all sizes.\n\nPortland Web Design Company | Brown Box Branding Portland\n\nBrown Box Branding is a leading company providing high-level Web Design, SEO, Social Media & PPC solutions in Portland, Oregon at affordable rates for businesses of all sizes.\n\nBROWN BOX MOVERS – 94 Photos & 23 Reviews – Movers – 3825\n\nSpecialties: Brown Box Movers is a family owned moving company located in Denton, TX. From hearing all the horror stories about movers from friends, ordinary citizens like yourself, and the local news, Brown Box Movers noticed an opportunity to join and improve the moving industry. Established in 2009. Brown Box Movers is here to change the way the world looks at the moving industry. From\n\nThe Little Brown Box Pizza LLC Company Profile | Rancho\n\nCompany Description: The Little Brown Box Pizza LLC is located in Rancho Santa Margarita, CA, United States and is part of the Restaurants and Other Eating Places Industry. The Little Brown Box Pizza LLC has 1,001 total employees across all of its locations and generates $11.46 million in sales (USD).\n\nBROWN PAPER BOX CO. – Home\n\nBased in Chicago, Brown Paper Box Co. produces theatre that connects audiences to the heart of the story and to our shared human experience. By combining smart, simple design with clear storytelling, we make traditional pieces relevant and new work accessible.\n\nRd Brown Box Packaging Pvt.ltd, Chennai – Manufacturer of\n\nAbout Us. Rd Brown Box Packaging Pvt.ltd – Manufacturer of corrugated box, carton box & other products in Chennai, Tamil Nadu. Nature of Business. Exporter and Manufacturer. Legal Status of Firm. Limited Company (Ltd./Pvt.Ltd.) Annual Turnover. Rs. 25 – 50 Crore.\n\nBrown Box Baking Company – Facebook\n\nBrown Box Baking Company. 589 likes · 4 talking about this. Brown Box Baking Company is a family-owned, small-town, home-based bakery offering a variety of gourmet breads as well as homemade turtles.\n\nAbout Us – Brown Box Movers | Denton Moving Company\n\nBrown Box Movers is a family owned moving company located in Denton, TX.From hearing all the horror stories about movers, Brown Box Movers noticed an opportunity to join and improve the moving industry.The stigma surrounding moving companies is one of recklessness and carelessness.\n\nStore | Touring Theater Company Brown Box Theatre Project\n\nStore limiteduser 2021-07-19T14:07:14+00:00. Brown Box Baseball Cap. Brown Box Baseball Cap. $21.00. Brown Box T-Shirt. Brown Box T-Shirt. $17.00. Brown Box Tote Bag. Brown Box Tote Bag.\n\nCardboard packing boxes for moving house – Big Brown Box\n\nEnjoy peace of mind when you buy big boxes from us here at Big Brown Box. When it comes to packaging supplies, our range of packaging accessories includes packing tapes, tape dispenser guns, box cutters, and marker pens to help you to wrap and pack items quickly and easily when moving home or office.\n\nBrownBox | Delivering to Convenience Retailers\n\nBox Kits. Clip Strips. Sign Up For An Account. Click on the button below to register for an account. Sign up for an account Email Us. [email protected]. Find By Categories. Action Figures & Collectables (29) Activity Books (212) Box Kits (4) Christmas Cards (0) Christmas Crackers (0) Christmas Wrapping Paper (0)\n\nBrown Bag Company – Durable, Low-cost Plan Bags\n\nThe Brown Bag Company was created in 1974 to help fulfill the growing needs of architects, designers, engineers, contractors, subcontractors, craftsmen, city planners, office administrators, delivery personnel and other professionals whose businesses depend on the safe and secure transport of blueprints, plans, drawings and other rolled documents.\n\nThe Brown Box Gift Company | Storefront\n\nThe Brown Box Gift Company is fully licensed to sell alcohol online. You will be required to produce proof of age upon delivery of your gift box. By purchasing a product containing alcohol, you are confirming that you are 18 years of age or over. Candles/Diffusers. Safety and burning instructions can be found on each product.\n\nCardboard Boxes NZ | Custom Cardboard – Quick Brown Box\n\nCheck out our range of box styles We manufacture a huge range of packaging, and we’re not just talking brown boxes and cartons. From plain brown cardboard shipping cases to top quality printed displays, we can make just about anything in corrugated cardboard.\n\nLittle Brown Box | Beautifully Curated New Baby Gift Boxes\n\nLittle Brown Box create the most thoughtful and unique gifts beautifully wrapped in a wooden keepsake box. We have worked hard to source premium branded products to feature in each of our gift boxes. Every item, in every box, has been carefully selected, ethically sourced and lovingly paired to create a truly bespoke gift.\n\nBrown Box Catering | Always fresh, seasonal & healthy\n\nLunch Menu. Deliciously seasonal, fresh & healthy food prepared daily. Let us cater to your business lunch or small gathering with our tasty made to order platters. Order now. Family Menu. Our Brown Box Family menu takes the stress away & provides your family with fresh, nutritious & seasonal food which is enjoyed by all ages. Order now. Packages.\n\nThe Brown Box Gift Company | Storefront | notonthehighstreet.com\n\nThe Brown Box Gift Company is fully licensed to sell alcohol online. You will be required to produce proof of age upon delivery of your gift box. By purchasing a product containing alcohol, you are confirming that you are 18 years of age or over. Candles/Diffusers. Safety and burning instructions can be found on each product.\n\nThe Brown Box Baking Company – cca.lafayettechamber.org\n\nSmall handcrafted bakery, custom made to order items. lafayettechamber_ca. News & events, member promotions, professional development, resources and advocacy.\n\nBrown Toy Box\n\nBrown Toy Box is centering play to disrupt generational poverty by normalizing Black excellence, cultivating curiosity, and building 21st century skills to create pathways to prosperous careers and expand Black children’s ideas for the possibilities for their lives.\n\nBrown Packaging Stock & Custom Packaging Distributor\n\nBrown Packaging is an ISO 9000 company committed to quality at every level, standing strongly behind all our policies and procedures. We provide ongoing training to our team members to insure that we maintain the highest standard of quality that has allowed our company to excel. Our Clients Include.\n\nParts & Services – Brown Industries, LLC\n\nBrown Industries, LLC 807 East 29th Street Lawrence, Kansas 66046 . Part Service & General Inquiries: (785) 842-6506. New Body Sales: (785) 842-6506 . Denver Office. 10220 Brighton Road, Unit #2 Henderson, CO 80640 . General Inquiries: (303) 597-0442. Email Us\n\nBrown Manufacturing Group\n\nbrown manufacturing group family owned and operated. made in usa. Curing Systems. premium textile screen printing equipment. durable, easy to use, simple to maintain . Check out our other product lines and keep up with our news. Products for the digital decorating market. Patented curing systems and high volume pretreaters.\n\nThe Box Theatre Co.\n\nLegacy Tile Program. Show your support of The Box to anyone attending the theatre by purchasing a stone tile to be hung in our lobby! Download the form here and send it by email or mail (W359 N5920 Brown Street, Suite 101 Oconomowoc, WI 53066) with payment to The Box Theatre Company before the final tile is sold.\n\nBrown Toy Box – LinkedIn\n\nBrown Toy Box is a consumer products company specialized in educational toys, games, books and content centering Black children ages 4-12 that focuses on STEAM education, purposeful play and\n\nThe Boujee Brown Box LLC in Omaha, NE | Company Info & Reviews\n\nTHE BOUJEE BROWN BOX LLC. The Boujee Brown Box LLC is a Nebraska Domestic LLC filed On . The company’s filing status is listed as Active. The company’s mailing address is 19625 X Street, Omaha, NE 68135. There are no reviews yet for this company. There are no questions yet for this company.\n\nMenu | Brown Bag Seafood Co.\n\n4 oz. grilled salmon and 8 grilled shrimp served over our ancient grain power blend of spinach, brown rice, quinoa and wheatberry (67g protein, 41g fat, 62g carbs, 5g fiber, 2g sugar, 890 calories). Low-Carb Fresh Catch Sala – $12.25\n\nHenry \"Box\" Brown | Underground Railroad | PBS\n\nSamuel Alexander Smith shipped Henry by Adams Express Company on , in a box 3 feet long by 2 feet 8 inches deep by 2 feet wide, and sent the box as “dry goods.” Henry Brown\n\nBrown & Brown | Insurance & Risk Management\n\nGrowth has no finish line. No matter where you are on your growth journey, we can help you find solutions to meet your ever-evolving insurance and risk management needs. If you are a highly complex multinational company, an individual or anything in between, our experienced teams can help every step of the way.\n\nBrown Company | Wyoming | Torrington | Riverton | Wheatland\n\nBrown Company has been serving Wyoming whith agricultural equipment since 1995. We have 3 great locations in Torrington, Wheatland, and Riverton! Brown Co. prides itself on customer service and the fact that they are locally owned and operated! Stop by today or call to meet our experienced team.\n\nInsurance & Risk Management Solutions – Brown & Brown\n\nCompany News. Brown & Brown, Inc. announces 2022 first-quarter earnings release and conference call dates. DAYTONA BEACH, Fla., (GLOBE NEWSWIRE) — Brown & Brown, Inc. (NYSE: BRO) announces it will release it\n\nlittle brown box & co. | healthy and delicious holiday gifts\n\nlittle brown box & co. healthy and delicious holiday gifts. Yummy + Beautiful + Affordable Holiday Gifts . Handmade granola. Presented in two beautiful muslin bags with illustrated logo. Honey Sesame and Holiday Harvest granolas are all-natural & made in Portland, Oregon with quality ingredients.\n\nCarton Box Retail Shop in Malaysia – The Box Company\n\nWelcome to The Box Company. We are a Box Retail Shop in Malaysia selling corrugated carton boxes in various sizes suitable to be used as moving box, packing box, shipping box, document box, mailing box, storage box, packaging box, etc. Our box store is located at 4th Floor in Endah Parade (Sri Petaling) in Kuala Lumpur. Need to buy boxes?\n\nBROWN BOX LIMITED overview – Find and update company information – GOV.UK\n\nCompany Overview for BROWN BOX LIMITED (12163392) Filing history for BROWN BOX LIMITED (12163392) People for BROWN BOX LIMITED (12163392) More for BROWN BOX LIMITED (12163392) Registered office address Unit 1b Spinnaker Court, Becketts Wharfe, Kingston Upon Thames, Surrey, United Kingdom, KT1 4ER\n\nBrown Packing Co., Inc. | About Us | Gaffney, SC\n\nBrown Packing Co., Inc. is a beef packer located in Gaffney, South Carolina. We harvest cows and bulls, buying cattle from stockyards and producers throughout the southeast. Everyday we strive to produce the best quality products and offer the best service in the industry. The 2016 Cattle Buyers Weekly lists the company as the 20 th Top Beef\n\nBrown-Service Funeral Homes – Bhamwiki\n\nBrown-Service Funeral Homes Company is a wholly-owned subsidiary of Liberty National Life Insurance Company which provided burial services and merchandise to holders of Liberty National’s burial insurance policies. The company, which had formerly provided home services insurance itself as the Brown-Service Insurance Company, was acquired in 1944 with the purchase of a $5 million share from\n\nCardboard packing boxes for moving house in London & UK – Big Brown Box\n\nEnjoy peace of mind when you buy big boxes from us here at Big Brown Box. When it comes to packaging supplies, our range of packaging accessories includes packing tapes, tape dispenser guns, box cutters, and marker pens to help you to wrap and pack items quickly and easily when moving home or office.\n\nB O X Partners, LLC Distributor Website\n\nB O X Partners is the nation’s largest wholesaler of packaging, shipping and industrial supplies. For over 20 years, our unique business model has propelled the growth and success of distributors of all sizes from coast to coast.\n\nBrown Roofing Company\n\nBrown Roofing Company The Best Roofing Team World class materials and a world class expert team of installers. Call us today for an estimate! Contact us today to plan your next new roof or roofing repair! We are looking forward to hearing from you soon! Wilmington Pike, Aurora, IN 47001.\n\nSafes – Luxury Home Safes – Brown Safe Manufacturing, Inc.\n\nBrown Safe is the top manufacturer of high-security luxury safes and vaults. We also offer a wide range of standard safes, and lead the industry in custom-built solutions. We sell direct to the customer. For those demanding the highest in quality, security, and convenience, our luxury lineup is sure to please.\n\nBrown Box Crab – California Sea Grant\n\nBrown box crab is a type of king crab, like the better known Alaskan king crab. [2] The Fishery . Once only caught as incidental catch, there is now an experimental fishery targeting this crab! [4] The Seafood . San Diego fishermen are building a market for this delicious species, which has been traditionally used as bait. [6]\n\nBrown Packing Co., Inc. | Contact | Gaffney, SC\n\nBrown Packing Co., Inc. Post Office Box 130 Gaffney, SC 29342-0130 [email protected] Contact Us. First Name. Last Name. Phone. Email. Contact Us. 864-489-5723 Fax: 864-487-3210 [email protected] Brown Packing P.O. Box 130 Gaffney, SC 29342 About. Company History; Community Involvement; C\n\nWelcome to U.S. Box the largest wholesale gift boxes, gift bags, shopping bags\n\nU.S. Box Packaging offers the largest selection of gift boxes, jewelry boxes, candy boxes, bakery boxes, plastic boxes,gift bags, shopping bags, jewelry pouches, vinyl pouches, gift wrap and more\n\nBrown University\n\nBrown is a leading research university, home to world-renowned faculty and also an innovative educational institution where the curiosity, creativity and intellectual joy of students drives academic excellence.\n\nE.B. Box Company | Toronto\n\nE.B. Box Company has been manufacturing custom boxes and standard folding carton boxes since 1972. Our commitment to quality and customer service has allowed us to forge many successful long-term relationships with our clients. Our in-house die cutting, printing, and gluing capabilities allows us to produce a variety of boxes including computer\n\nTheater Review: Brown Paper Box Company Hosts a Monumental 'Speech & Debate'\n\nCHICAGO – “Speech & Debate,” the latest production from the mighty Brown Paper Box Company, continues their tradition of thinking outside that “box” in presenting storefront theater that\n\nCheap Packaging Boxes Johannesburg Boxes Corrugated Packaging Ballot – Pick A Box\n\nWelcome to Pick A Box, We providing Packaging solution to suit your everyday needs, everything from boxes to packaging to trays making your search easier with one convenient stop.Choosing Pick A Box means getting competitively priced corrugated boxes and packaging supplies without having to sacrifice quality and service.\n\nPie Boxes – BRP Box Shop\n\nGrab some pie box samples from the Samples Page if you aren’t sure which box size is best for your pies. 3788 – 5″ x 5″ x 2 1/2″ White/White Timesaver Box with Window 8″ x 8″ x 2 1/2″ Chocolate/Brown Timesaver Box with Window. $87.64. per Case (100 pieces) $24.80. per Pack (10 pieces) 3229 – 8″ x 8″ x 2 1/2″ Diamond Blue/White Timesaver Box\n\nDelivery Boxes, Cardboard Boxes & Mailing Boxes – Tiny Box Company\n\nKraft 1-Piece A4 Corrugated Postal Box. 322 x 228 x 55mm SKU: FMKRA4. £1.19 £0.99. As low as £0.76. Kraft Brown Postal Box For Mailing Medium Snap Shut Box. 218 x 175 x 90mm SKU: FMKR16. £0.76 £0.63. As low as £0.65. Kraft Brown Postal Box For Mailing Deep Snap Shut Box.\n\nThe Little Brown Box 's (@thelittlebrownboxofficial) profile on Instagram • 250\n\n844 Followers, 56 Following, 250 Posts – See Instagram photos and videos from The Little Brown Box (@thelittlebrownboxofficial)\n\nTheater Review: Brown Paper Box Co's Magnificent, Must-See 'Little Women: The\n\nBrown Paper Box Co. presents “Little Women: The Musical,” in both matinees and evening performances on various days through February 9th, 2019, at the Strawdog Theatre, 1802 West Berenice\n\nAug 13 | Much Ado About Nothing with the Brown Box Theatre Company | Chelmsford\n\nTown Common, Chelmsford, MA, 01824. Much Ado About Nothing will be presented by Brown Box Theatre on the town common, Friday, August 13 at 7:30 pm. Upon their return from war, a group of soldiers\n\nBrown Butter Box – Lowrider Cookie Company\n\nBrown Butter Box. Regular price. $46.00. Sale price Unit price / per. Free Shipping. Brown butter is EVERYTHING. It makes everything better – which is why we use it in so many of our cookies. This box contains only cookies that use brown butter so if you are a brown butter fanatic like we are, or you’ve never tried it and you have to know what\n\nBrown Bag Meeting Definition – investopedia.com\n\nA brown bag meeting is an informal meeting that takes place in the workplace, generally around lunchtime. Brown bag meetings are typically informal training and learning sessions offered by employers.\n\nSolved Q Search 7. Brown Brothers Box Company recently lost | Chegg.com\n\nBrown Brothers Box Company recently lost a contract to produce price signs for gasoline stations, and it finds itself with excess capacity. Assume that each lot of 100 shipping boxes requires 160 pounds of heavy-duty liner board, 35 pounds of finished cardboard, and 2.5 hours of labor; that each lot of 600 mailing tubes requires 60 pounds of\n\nIf/Then – BROWN PAPER BOX CO.\n\nBrown Paper Box Co. is proud to present the regional premiere of this original new musical. Presented at The Athenaeum. Studio Three. 2936 N Southport Ave. Chicago, IL 60657. Jan 25 – . Thursday – Monday. Evening performances @ 7:30PM. Matinee performances @ 2:00 PM.\n\nWood Watch Box and Cases – Men's Watch Storage Boxes for Sale | Watch Box Co.\n\nVolta Ebony Wood Watch Case w/ Cream Interior $229.00. Volta Carbon Fiber 15 Wood Watch Case With Extra Storage Compartment $249.95. Volta Ebony 10 Wood Watch Case w/ Gold Trim $299.95. Browse through our extensive line of wood watch cases. We offer many different styles, colors, sizes, and finishes. Buying a wood watch box should be easy.\n\nGODSPELL, presented by The Brown Paper Box Co. – Kickstarter\n\nThe Brown Paper Box Co. is raising funds for GODSPELL, presented by The Brown Paper Box Co. on Kickstarter! The Brown Paper Box Co. presents an entirely new interpretation of Stephen Schwartz’s musical of parables from the Book of Matthew.\n\nPrinted Custom Boxes and stock, Packaging Supplies in Canada – Instabox\n\nWe are the only box company that has 2 factories in Alberta offering a quick turn around. You can choose from numerous RSC style stock boxes that can be custom printed with 1 or 2 colors or even laminated with a full color sticker. Stock and Custom Boxes; Stand Up and Counter Top Displays; Shipping Supplies; View Box Samples\n\nPeanuts Gang | The Music Box Company\n\nThe Music Box Company was founded in 1988 in San Francisco, California, with humble beginnings, it quickly grew to several stores, specializing in unique and high quality musicals Contact FAQ\n\nTheater Review: IF/THEN (Brown Paper Box Co.) – Stage and Cinema\n\nphotos by Zach Dries. If/Then. Brown Paper Box Co. The Athenaeum, Studio Three. 2936 N. Southport Ave. ends on . for tickets, call 773.935.6860. or visit Brown Paper Box. for more shows, visit Theatre in Chicago.\n\nAmazon and Target race to revolutionize the cardboard shipping box – Fast Company\n\nFast Company’s annual ranking of businesses that are making an outsize impact. Brandless is a perfect example of that, with a simple brown box with “Brandless” stamped on the side. The\n\nBrown & Williamson Tobacco Company – NCpedia\n\nI have a box that has the name Brown &Williamson address on it 1600 west hill street. Louisville,Ky In the box was a Dremel sander. On the cardboard box is stamped Model B Sander. also next to the addressee name. This is dated Jan. 1958. Did this company make sanders or how did it come in that box, stamped with Brown & Williamson.\n\nUsed Resourses:"}, {"url": "https://www.wepc.com/statistics/history-video-games/", "page_content": "The motion of the so-called “ball” is controlled by four operational amplifiers with another six used to sense when the ball impacts another simulated surface. These functions were time-shared so that all elements can be generated at once.\n\nWhat this project benefited from, that the cathode-ray tube amusement device didn’t, were germanium transistors. Becoming more commercially available in the 1950s, these transistors allowed Higinbotham to make fast-switching circuits that displayed images from the three computer outputs at 36 Hertz. This was fast for the time and fast enough that your eyes saw the ball, net, and any other elements on-screen instead of separate images.\n\nAfter unveiling it in 1958, they improved the initial model a year later by adding a larger screen. There were also options for low or high gravity options that would change how the game plays.\n\nThe game was played using two lightweight aluminum controllers that had one button and one turning dial. Pressing that button hit the ball while the dial allowed you to decide the shot angle before “swinging.” An amusing side note is that Higinbotham wanted a second dial to control shot velocity but thought it’d be too complicated. Nowadays, we have studies investigating how modern game console controllers, which have approximately 15 player input mechanisms, may benefit players’ motor skills.\n\nYou can read about the mechanisms at play in Tennis for Two here if you’re interested in a detail-specific analysis of how this pioneering machine worked."}, {"url": "https://ultimatehistoryvideogames.jimdofree.com/brown-box", "page_content": "Brown Box\n\nTrivia:\n\n1) First game console prototype created by Ralph H. Baer (later officially released to public as first game console ever - Magnavox Odyssey (1972).\n\n2) First game on the console was called \"Chase\". Vacuum tube circuit produced two-spot display, game used joystick. People able to play a \"chase' game on the set, with one 'player's dot trying to 'catch' the other player's.\n\n3) Also known as \"Fox and hound\" chase game was demonstrated to Sanders corporate director of research and development, Herb Chapman. The demonstration was a success, and shortly thereafter the project was granted the sum of $2 500 to maintain it. Project was unofficial.\n\n4) Console uses a type of removable printed circuit board, called a game card, that inserts into a slot similar to a ROM cartridge slot. The game cards do not contain any components, but have a series of \"jumpers\" — simple electrical connections — between pins of the card connector. These jumpers interconnect different logic and signal generators in the console to produce the desired game logic and screen output.\n\n5) In late 1967 the \"Chase\" game got a machine-controlled third dot, as well as compatibility with the first ever ‘light-gun’ peripheral. Bauer create first light gun and developed several video games. First gun for a home console was in fact a big rifle.\n\n6) A video game console is a device that outputs a video signal or visual image to display a video game. The term \"video game console\" is used to distinguish a console machine primarily designed for consumers to use for playing video games in contrast to arcade machines or home computers. It includes home video game consoles, handheld game consoles, microconsoles and dedicated consoles.\n\n7) Light gun is a pointing device for computers and a control device for arcade and video games, shaped as a pistol. Modern screen-based light guns work by building an optical sensor into the gun, which receives its input from the light emitted by on-screen target(s). The first device of this type, the light pen, was used on the MIT Whirlwind computer. First ever mechanical light gun game was arcade game \"Seeburg Ray-O-Lite\" (1936).\n\n8) First official prototype of a console plays game of \"Ping Pong\" (it inspired arcade game Pong (1972).\n\n9) Game is not emulated."}, {"url": "https://homework.study.com/explanation/where-did-ralph-henry-baer-create-the-brown-box.html", "page_content": "Question:\n\nWhere did Ralph Henry Baer create the brown box?\n\nFather of Video Games:\n\nInventer Ralph Henry Baer (1922 to 1914) was a German immigrant who fled Nazi Germany to the United States. He is often referred to as the ''Father of Video Games'' because of his invention of the ''Brown Box'' which allowed people to play simple video games on their televisions.\n\nAnswer and Explanation:\n\nBecome a Study.com member to unlock this answer! Create your account View this answer"}, {"url": "https://www.thoughtco.com/henry-brown-inventor-4077419", "page_content": "Henry Brown patented a \"receptacle for storing and preserving papers on November 2, 1886\" This was a kind of strongbox, a fire-safe and accident-safe container made of forged metal, which could be sealed with a lock and key. It was special in that it kept the papers inside it separated, A precursor to the personal safe? It was not the first patent for a strongbox, but it was patented as an improvement.\n\nWho Was Henry Brown?\n\nNo biographical information about Henry Brown could be found, other than his being noted as a Black inventor. He lists his place of residence as Washington DC at the time of his patent application, filed June 25, 1886. There is no record of whether Henry Brown's receptacle was manufactured or marketed, or whether he profited from his ideas and designs. It isn't known what he did as a profession and what inspired this invention.\n\nReceptacle for Storing and Preserving Papers\n\nThe box designed by Henry Brown had a series of hinged trays. When opened, you could access one or more of the trays. The trays could be lifted separately. This allowed the user to separate papers and store them securely.\n\nHe mentions it was a useful design for storing carbon papers, which might be more delicate and could be damaged by scraping against the lid. They could also transfer carbon smudges to other documents, so it was important to keep them separate. His design helped ensure that they didn't come into contact with the lid or the tray above each lower tray. That would minimize any risk of damaging documents when you opened and closed the box.\n\nThe use of typewriters and carbon papers at this time likely presented new challenges in how to store them. While carbon papers were a handy innovation for keeping a duplicate of typewritten documents, they could be easily smudged or torn.\n\nThe box was made of sheet metal and could be locked. This allowed for secure storage of important documents at home or the office.\n\nStoring Papers\n\nHow do you store your important papers? Have you grown used to being able to scan, copy, and save paper documents in digital formats? You may have difficulty imagining the world where there might be only a single copy of a document that could be lost and never recovered.\n\nIn the time of Henry Brown, fires that destroyed homes, office buildings and factories were all too common. Papers being flammable, they were likely to go up in smoke. If they were destroyed or stolen, you might not be able to retrieve the information or proof they contained. This was a time when carbon paper was the commonly used way to make multiples of important documents. It was a long time before the copying machine and before documents might be saved on microfilm. Today, you often get documents in digital form from the outset and have a reasonable reassurance that copies can be retrieved from one or more sources. You may never print them out."}, {"url": "https://www.blackpast.org/african-american-history/raymond-aloysius-brown-1915-2009/", "page_content": "Raymond A. Brown, a prominent civil rights activist, attorney, and military officer was born on May 6, 1915 in Fernandina Beach, Florida. His mother, Elizabeth Christopher Traeye, was a domestic, teacher and homemaker who in 1930 helped establish Christ the King, Jersey City’s only Black Catholic church. Brown’s father, Miller, was the first Black bus mechanic employed at the Public Service Bus Company in Jersey City.\n\nThe Browns moved to Jersey City in 1917 where Raymond graduated from Lincoln High School and joined the segregated Civilian Conservation Corps fighting forest fires in Montana’s Kootenai National Forest. As a history major at Florida A&M College, Brown wrote humor for the FAMCEAN newspaper, participated in a 1937 campus protest, and played football under legendary coach Jake Gaither before graduating in 1938.\n\nBrown returned to Jersey City and worked as a bellhop at Journal Square’s Plaza Hotel, shipping clerk, FDIC messenger, cab driver and dockworker while enrolled in the night program at Fordham University law school. Drafted in the segregated US Army Quartermaster Corps in 1942, he challenged segregated practices in the south during World War II and served overseas.\n\nUpon discharge, Brown lived at the Jersey City Booker T. Washington housing complex and joined the all-Black New Jersey Army National Guard 372nd AAA Group under Colonel Leon G. Brown. He rose in the ranks to become a full colonel and Judge Advocate General, retiring in 1975. After graduating from Fordham in 1948, Brown worked for Raymond Chasan, a white Jewish lawyer who was a member of the Jersey City NAACP. While there, Brown was admitted to the Bar in 1949.\n\nAt the behest of the NAACP Legal Defense Fund’s Barbara A. Morris and Robert L. Carter, Brown represented defendants in Georgia, Alabama, Mississippi, and Texas. He helped quell the 1964 Jersey City rebellion, the 1967 Newark and Plainfield uprisings, and the 1971 Rahway prison revolt. As president of the Jersey City NAACP (1959-1966), he helped desegregate public schools, took five busloads to the March on Washington, and joined Dr. Martin Luther King Jr. in Selma.\n\nHis clients included Black Liberation Army activist Assata Shakur, poet Amiri Baraka, SNCC chairman H. Rap Brown, pugilist Rubin “Hurricane” Carter, jazz legend Sarah Vaughn, Jersey City Black Panthers Isaiah Rowley, Victor Perez and Charles Hicks, Student Afro Society members during the 1968 Columbia University protests, Kawaida Towers, and the Congress of African People. He also assisted with the 1967 Black Power Conference, the 1969 Committee for Unified Newark’s Black and Puerto Rican Convention, and attended the 1972 National Black Political Convention in Gary, Indiana.\n\nFor nearly 60 years, Black lawyers were inspired by Brown’s commitment, work ethic, and courtroom presence. Raymond A. Brown died at 94 on October 9, 2009 of chronic obstructive pulmonary disease. He was survived by his second wife, Dr. Jennie Davis Brown, and children, Dr. Deborah E. Brown Bowles, attorney Raymond M. Brown, Denise Howell Randall, and Clifton Howell. His first wife Elaine Camilla Williams Brown died in 1968."}, {"url": "https://www.history.com/topics/inventions/history-of-video-games", "page_content": "Today, video games make up a $100 billion global industry, and nearly two-thirds of American homes have household members who play video games regularly. And it’s really no wonder: Video games have been around for decades and span the gamut of platforms, from arcade systems, to home consoles, to handheld consoles and mobile devices. They’re also often at the forefront of computer technology.\n\nThe Early Days\n\nThough video games are found today in homes worldwide, they actually got their start in the research labs of scientists.\n\nIn 1952, for instance, British professor A.S. Douglas created OXO, also known as noughts and crosses or a tic-tac-toe, as part of his doctoral dissertation at the University of Cambridge. And in 1958, William Higinbotham created Tennis for Two on a large analog computer and connected oscilloscope screen for the annual visitor’s day at the Brookhaven National Laboratory in Upton, New York.\n\nIn 1962, Steve Russell at the Massachusetts Institute of Technology invented Spacewar!, a computer-based space combat video game for the PDP-1 (Programmed Data Processor-1), then a cutting-edge computer mostly found at universities. It was the first video game that could be played on multiple computer installations.\n\nHISTORY Vault: Game Changers: Inside the Video Game Wars Brought to life by Academy Award-winning director Daniel Junge, this is the untold story of the personal battles that gave rise to the multibillion-dollar video game industry. WATCH NOW\n\nDawn of the Home Console\n\nIn 1967, developers at Sanders Associates, Inc., led by Ralph Baer, invented a prototype multiplayer, multi-program video game system that could be played on a television. It was known as “The Brown Box.”\n\nBaer, who’s sometimes referred to as Father of Video Games, licensed his device to Magnavox, which sold the system to consumers as the Odyssey, the first video game home console, in 1972. Over the next few years, the primitive Odyssey console would commercially fizzle and die out.\n\nYet, one of the Odyssey’s 28 games was the inspiration for Atari’s Pong, the first arcade video game, which the company released in 1972. In 1975, Atari released a home version of Pong, which was as successful as its arcade counterpart.\n\nMagnavox, along with Sanders Associates, would eventually sue Atari for copyright infringement. Atari settled and became an Odyssey licensee; over the next 20 years, Magnavox went on to win more than $100 million in copyright lawsuits related to the Odyssey and its video game patents.\n\nIn 1977, Atari released the Atari 2600 (also known as the Video Computer System), a home console that featured joysticks and interchangeable game cartridges that played multi-colored games, effectively kicking off the second generation of the video game consoles.\n\nThe video game industry had a few notable milestones in the late 1970s and early 1980s, including:\n\nThe release of the Space Invaders arcade game in 1978\n\nThe launch of Activision, the first third-party game developer (which develops software without making consoles or arcade cabinets), in 1979\n\nThe introduction to the United States of Japan’s hugely popular Pac-Man\n\nNintendo’s creation of Donkey Kong, which introduced the world to the character Mario\n\nMicrosoft’s release of its first Flight Simulator game\n\nThe Video Game Crash\n\nIn 1983, the North American video game industry experienced a major “crash” due to a number of factors, including an oversaturated game console market, competition from computer gaming, and a surplus of over-hyped, low-quality games, such as the infamous E.T., an Atari game based on the eponymous movie and often considered the worst game ever created.\n\nLasting a couple of years, the crash led to the bankruptcy of several home computer and video game console companies.\n\nThe video game home industry began to recover in 1985 when the Nintendo Entertainment System (NES), called Famicom in Japan, came to the United States. The NES had improved 8-bit graphics, colors, sound and gameplay over previous consoles.\n\nNintendo, a Japanese company that began as a playing card manufacturer in 1889, released a number of important video game franchises still around today, such as Super Mario Bros., The Legend of Zelda, and Metroid.\n\nAdditionally, Nintendo imposed various regulations on third-party games developed for its system, helping to combat rushed, low-quality software. Third-party developers released many other long-lasting franchises, such as Capcom’s Mega Man, Konami’s Castlevania, Square’s Final Fantasy, and Enix’s Dragon Quest (Square and Enix would later merge to form Square Enix in 2003).\n\nIn 1989, Nintendo made waves again by popularizing handheld gaming with the release of its 8-bit Game Boy video game device and the often-bundled game Tetris. Over the next 25 years, Nintendo would release a number of successful successors to the Game Boy, including the Game Boy color in 1998, Nintendo DS in 2004, and Nintendo 3DS in 2011.\n\nThe First Console War\n\nAlso in 1989, Sega released its 16-bit Genesis console in North America as a successor to its 1986 Sega Master System, which failed to adequately compete against the NES.\n\nWith its technological superiority to the NES, clever marketing, and the 1991 release of the Sonic the Hedgehog game, the Genesis made significant headway against its older rival. In 1991, Nintendo released its 16-bit Super NES console in North America, launching the first real “console war.”\n\nThe early- to mid-1990s saw the release of a wealth of popular games on both consoles, including new franchises such as Street Fighter II and Mortal Kombat, a fighting game that depicted blood and gore on the Genesis version of the game.\n\nIn response to the violent game (as well as congressional hearings about violent video games), Sega created the Videogame Rating Council in 1993 to provide descriptive labeling for every game sold on a Sega home console. The council later gives rise to the industry-wide Entertainment Software Rating Board, which is still used today to rate video games based on content.\n\nIn the mid-1990s, video games leaped to the Big Screen with the release of the Super Mario Bros. live-action movie in 1993, followed by Street Fighter and Mortal Kombat over the next two years. Numerous movies based on video games have been released since.\n\nWith a much larger library of games, lower price point, and successful marketing, the Genesis had leapfrogged ahead of the SNES in North America by this time. But Sega was unable to find similar success in Japan.\n\nThe Rise of 3D Gaming\n\nWith a leap in computer technology, the fifth generation of video games ushered in the three-dimensional era of gaming.\n\nIn 1995, Sega released in North America its Saturn system, the first 32-bit console that played games on CDs rather than cartridges, five months ahead of schedule. This move was to beat Sony’s first foray into video games, the Playstation, which sold for $100 less than the Saturn when it launched later that year. The following year, Nintendo released its cartridge-based 64-bit system, the Nintendo 64.\n\nThough Sega and Nintendo each released their fair share of highly-rated, on-brand 3D titles, such as Virtua Fighter on the Saturn and Super Mario 64 on the Nintendo 64, the established video game companies couldn’t compete with Sony’s strong third-party support, which helped the Playstation secure numerous exclusive titles.\n\nSimply put: Sony dominated the video game market and would continue to do so into the next generation. In fact, the Playstation 2, released in 2000 and able to play original Playstation games, would become the best-selling game console of all time.\n\nThe Playstation 2, which was the first console that used DVDs, went up against the Sega Dreamcast (released in 1999), the Nintendo Gamecube (2001), and Microsoft’s Xbox (2001).\n\nThe Dreamcast—considered by many to be ahead of its time and one of the greatest consoles ever made for several reasons, including its capability for online gaming—was a commercial flop that ended Sega’s console efforts. Sega pulled the plug on the system in 2001, becoming a third-party software company henceforth.\n\nModern Age of Gaming\n\nIn 2005 and 2006, Microsoft’s Xbox 360, Sony’s Playstation 3, and Nintendo’s Wii kicked off the modern age of high-definition gaming. Though the Playstation 3—the only system at the time to play Blu-rays—was successful in its own right, Sony, for the first time, faced stiff competition from its rivals.\n\nThe Xbox 360, which had similar graphics capabilities to the Playstation 3, was lauded for its online gaming ecosystem and won far more Game Critics Awards than the other platforms in 2007; it also featured the Microsoft Kinect, a state-of-the-art motion capture system that offered a different way to play video games (though the Kinect never caught on with core gamers or game developers).\n\nAnd despite being technologically inferior to the other two systems, the Wii trounced its competition in sales. Its motion-sensitive remotes made gaming more active than ever before, helping it appeal to a much larger slice of the general public, including people in retirement homes.\n\nTowards the end of the decade and beginning of the next, video games spread to social media platforms like Facebook and mobile devices like the iPhone, reaching a more casual gaming audience. Rovio, the company behind the Angry Birds mobile device game (and, later Angry Birds animated movie), reportedly made a whopping $200 million in 2012.\n\nIn 2011, Skylanders: Spyro’s Adventure brought video games into the physical world. The game required players to place plastic toy figures (sold separately) onto an accessory, which reads the toys’ NFC tags to bring the characters into the game. The next few years would see several sequels and other toy-video game hybrids, such as Disney Infinity, which features Disney characters.\n\nThe 8th generation of video games began with the release of Nintendo’s Wii U in 2012, followed by the Playstation 4 and Xbox One in 2013. Despite featuring a touch screen remote control that allowed off-TV gaming and being able to play Wii games, the Wii U was a commercial failure—the opposite of its competition—and was discontinued in 2017.\n\nIn early 2017, Nintendo released its Wii U successor, the Nintendo Switch, the only system to allow both television-based and handheld gaming. Microsoft released its 4K-ready console, the Xbox One X, in late 2017, and followed up in 2020 with the Xbox Series X and Series S. In 2020, Sony released the Playstation 5, a successor to Playstation 4.\n\nWith their new revamped consoles, both Sony and Microsoft currently have their sights set on virtual reality gaming, a technology that has the potential to change the way players experience video games.\n\nSources\n\n‘Spacewar!’ The story of the world’s first digital video game. The Verge.\n\nThe First Video Game? BNL.\n\nThe Brown Box, 1967–68. Smithsonian.\n\nInventor Ralph Baer, The ‘Father Of Video Games,’ Dies At 92. NPR.\n\nThe Video Game Revolution. PBS.\n\nVideo Game History Timeline. Museum of Play.\n\nThe Surprisingly Long History of Nintendo. Gizmodo.\n\nHow Tetris Helped Game Boy Take Over the World. Gizmodo.\n\nHow Sonic Helped Sega Win the Early 90s Console Wars. Kotaku.\n\nSega and Nintendo Console War: Greatest Moments. Prima Games.\n\nAngry Birds Maker Rovio Reports $200 Million In Revenue, $71 Million In Profit For 2012. Business Insider.\n\nHere’s who won each console war. Venturebeat.\n\nThe History Of Gaming: An Evolving Community. TechCrunch.\n\nThe History of Video Game Consoles. TIME."}, {"url": "https://virginiahistory.org/learn/resurrection-henry-box-brown", "page_content": "One of the memorable escapes from slavery was that of Henry Brown of Richmond when, on March 29-30, he had himself shipped in a crate as railroad freight from Richmond to Philadelphia. He made the twenty-seven-hour journey to freedom crammed into a box measuring 3 x 2 ½ x 2 feet.\n\nTo celebrate his safe arrival, he adopted the name Henry “Box” Brown. This rare lithograph, titled The Resurrection of Henry “Box” Brown at Philadelphia, shows the moment that the box was opened in the office of the Pennsylvania Anti-Slavery Society and Brown emerged. The print is probably the only portrait of Henry Box Brown from life, and the artist likely also drew the box from life. None of the other figures accurately represent people who were at Brown's arrival; standing figures shown include (at right) James Miller McKim, who ran the Philadelphia Anti-Slavery office and a well-known abolitionist, and (second from left) Frederick Douglass, a stand-in for William Still of Philadelphia. A description of the production of this lithograph appears in The Unboxing of Henry Brown (2003) by Jeffrey Ruggles.\n\nOnce free, Brown appeared at abolitionist events and collaborated on a slave narrative. Using profits from the book, Brown produced a moving panorama depicting enslavement. Exhibiting the panorama helped lead Brown into a career of public performance.\n\nThis print by Samuel Worcester Rowse—who is remembered for his portraits of such figures as Henry David Thoreau, Nathaniel Hawthorne, and Ralph Waldo Emerson—was issued in 1850 in Boston to help raise funds for the panorama. The print in the VMHC collections is one of only a few known originals. Brown’s portrait is from life, and many other likenesses of him were based directly or indirectly on it. An inscription on the back of the print, \"From Samuel May, 1889,\" probably refers to one of the two Samuel Mays who knew Brown. The Rev. Samuel J. May was a Unitarian minister who met Brown soon after his arrival in Philadelphia. His nephew, Samuel May, Jr., was an agent for the Massachusetts Anti-Slavery Society and spoke at the 1849 Convention about Brown, apparently becoming the first to confirm in public a story that was widely rumored: that Brown had indeed escaped in a box from Richmond."}, {"url": "https://www.biography.com/activists/henry-box-brown", "page_content": "(1815-)\n\nWho Was Henry \"Box\" Brown?\n\nHenry \"Box\" Brown was born, enslaved, on a Virginia plantation in 1815. After his family was sold, Brown committed himself to escaping from bondage. He had himself shipped in a wooden box from Virginia to Philadelphia, where slavery had been abolished. Brown was subsequently the subject of a popular slave narrative, which he adapted into a stage show. The details of his death are unknown.\n\nEarly Life and Family\n\nHenry \"Box\" Brown was born enslaved in Louisa County, Virginia, in 1815. The precise date of his birth is unknown. At the age of 15, he was sent to Richmond to work in a tobacco factory. Although he married and had four children, he was unable to live with his family. In 1848, his wife and children were sold to a plantation in North Carolina. This tremendous loss fueled Brown's fervor to escape from slavery.\n\nEscape from Slavery\n\nBrown, an active member of a local church, enlisted fellow parishioner James Caesar Anthony Smith and a white contact, Samuel Smith, to aid him in his escape. Brown's plan was to have himself shipped as cargo from Richmond to Philadelphia, where slavery had been abolished.\n\nSamuel Smith shipped a box containing Brown by Adams Express Company on March 23, 1849. The box, labeled \"dry goods,\" was lined with cloth and had a single hole cut in the top for air. 27 hours later, the box arrived at the headquarters of the Philadelphia Anti-Slavery Society. Emerging from the box, Brown recited a psalm.\n\nCareer as a Performer\n\nFollowing Brown's successful escape, Samuel Smith attempted to ship more enslaved people from Richmond to Philadelphia on May 8, 1849. His plan was discovered, however, and he was subsequently arrested. James Caesar Anthony Smith was also arrested on similar charges, though he did not serve time.\n\nGiven the dangers of making Brown's escape public, some abolitionist leaders — including Frederick Douglass — argued that it should be kept confidential. Others argued that the story would inspire other innovative and daring escapes. Brown made the decision to publicize his experience. Shortly after his escape, Brown appeared before the New England Anti-Slavery Society Convention in Boston. He subsequently toured the region performing his story. Boston publisher Charles Sterns also published a version of the story, which would become one of the best-known slave narratives in American history.\n\nBrown again developed his stage show to include a panorama on the institution of slavery. In 1850, the \"Mirror of Slavery\" show opened in Boston. After passage of the Fugitive Slave Act later that year, Brown moved to England with his panorama. He remained in England for the next quarter-century, marrying and fathering a daughter despite criticism that he should purchase the freedom of his first wife and four children.\n\nIn 1875, Brown returned to the United States with his English wife and child. He performed as a magician to make a living. As part of his stage act, he emerged from the original box in which he had traveled to freedom.\n\nLater Life\n\nBrown's last recorded performance took place in Ontario, Canada, on February 26, 1889. The date and location of his death are unknown.\n\nQUICK FACTS\n\nBirth Year: 1815\n\nBirth State: Virginia\n\nBirth Country: United States\n\nGender: Male\n\nBest Known For: Henry \"Box\" Brown was an enslaved man who shipped himself to freedom in a wooden box. He developed his published slave narrative into an anti-slavery stage show.\n\nIndustries\n\nCivil Rights\n\nInteresting Facts\n\nHenry \"Box\" Brown performed as a magician in his later years.\n\n\n\nThe Henry Box Brown Festival, produced by the Brothers Network and inspired by the life of Henry \"Box\" Brown, was held in Philadelphia, Pennsylvania, in 2013.\n\nDeath City: Unknown\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION"}]}