{"Raymond Harry Brown was born in Sydney, Australia.": [{"url": "https://www.publicrecords.com.au/topic/births-deaths-marriages/", "page_content": "Births, Deaths, Marriages & Divorces\n\nSearch births, deaths and marriages records in Australia. This also includes divorce. Our index provides both current and historical pointers.\n\nHistorical records are commonly used in genealogy and family history research. Whilst current records may be useful in adoption matters and document retrieval. Certificates and information on how to obtain them are also available through state registries.\n\nOnline records in Australia date back as far as 1792. Some records are compiled as Australia-wide whilst others are done by the state. We have included data sets from each state as well as those covering the entire country.\n\nIn addition to official notices, we have also included those compiled from unofficial sources. Some of these have been painstakingly pieced together using old newspapers and records. Whilst they are not a direct source, they can be very handy. And in a number of cases provide an excellent guide to dates.\n\nShould you know of any additional resources, please include them so others researching can do so effectively."}, {"url": "https://www.nla.gov.au/research-guides/australian-birth-death-and-marriage-records/new-south-wales", "page_content": "This page lists New South Wales-related online, networked and microform resources as well as print publications available for use within the National Library of Australia.\n\nBackground\n\nCivil registration of births, deaths and marriages in the Colony of New South Wales commenced in 1856. Prior to this date, baptisms, marriages and burials were recorded in Church registers.\n\nThe New South Wales civil registration system also included the following areas when under New South Wales administration:\n\nFederal Capital Territory/Australian Capital Territory\n\nNorthern Territory\n\nQueensland\n\nOnline\n\nThe NSW Registry of Births, Deaths and Marriages provides free, searchable, online indexes to the following:\n\nBirths/baptisms 1788 - 100 years ago\n\nMarriages 1788 - 50 years ago\n\nDeaths/burials 1788 - 30 years ago\n\nFindmypast (World Edition)\n\nYou can find Findmypast (World Edition) by visiting our eResources portal and searching for this database under the Browse eResources tab. Currently, Findmypast has the following New South Wales-related BDM records available:\n\nCD-ROMs in the Library\n\nIn addition to the Library's subscription databases, the following CD-ROM resources are available for access within the Library.\n\nNew South Wales Pioneers Index, 1788-1918\n\nIncludes church baptisms, marriage and burial records 1788-1856 (incomplete), and official birth, death and marriage records 1856-1918\n\nIncludes church baptisms, marriage and burial records 1788-1856 (incomplete), and official birth, death and marriage records 1856-1918 New South Wales Between the Wars Index 1919-1945\n\nincludes marriage and death records only\n\nMicrofilmed and other published material\n\nWithin the Library you may access the following indexes in the Newspapers and Family History zone:\n\nThe New South Wales Between the Wars 1919-1945 [microform] resource includes the following indexes:\n\nMarriage index 1919-1945, and\n\nDeath index 1919-1945\n\nmc N 1369\n\nMarriage index 1919-1945, and Death index 1919-1945 mc N 1369 Registers of births, deaths and marriages from NSW churches prior to Civil Registration in 1856. The records form part of the State Archives and Records NSW Genealogical Research Kit - Stage 1. These records can be identified by having volume reference numbers beginning with V in the above indexes. Eg. V183214 26 (year = 1832, entry no = 14., volume no. = 26) The Library holds microfilmed copies of Volumes 1-123 out of a total of 158 volumes and are contained in the Microfilm drawer in Bay 3. Each microfilm box is labelled with both the Library Call Number 'mfm N 229' and the respective State Archives and Records NSW Reel number (AO 5001 to AO 5048).\n\nCopies of entries in volumes not held by the Library may be purchased directly from the NSW Registry of Births, Deaths and Marriages.\n\nNB: There are occasional Errors in the Place of Registration on the indexes.\n\nDivorce Records\n\nDivorce records for New South Wales commence from 1873 onward.\n\nThe State Archives and Records of New South Wales hold divorce records from 1873-1975. Refer to their guide for further information.\n\nFrom 1976 onward, divorce records are the responsibility of the Commonwealth Family Court of Australia."}, {"url": "https://www.ancestry.com/genealogy/records/raymond-harry-freeman-24-6483x3", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://nostalgiacentral.com/music/artists-l-to-z/artists-r/ray-brown-whispers/", "page_content": "When Ray Brown died in August 1996, Australian rock & roll lost one of its unsung achievers.\n\nAfter bursting onto the pop scene at Sydney’s legendary premier discotheque of the day, Surf City in 1964, Ray Brown and The Whispers became the most successful local recording act of 1965.\n\nThe band first entered Festival’s recording studios in Sydney early in 1965. Blessed with two outstanding guitarists, Al Jackson and Laurie Barclay, they were able to exploit the primitive conditions in the studio to the maximum.\n\nWhat followed was an unprecedented year in Australian rock music history. Their first four singles reached #1 and three hit albums were produced.\n\nThe singles 20 Miles, Pride, In the Midnight Hour and Fool, Fool, Fool revealed a band bursting with energy and talent.\n\nThe rhythm section of John Manners and Pat Jeffrey anchored a sound which seemed to bounce from Festival’s legendary tiled walls.\n\nTheir self-titled debut album is a perfect snapshot of post-Beatles Australian rock.\n\nThe cover shows the band on the beach in tight jeans and Beatle boots, and the album marries American R&B and British Merseybeat perfectly.\n\nBy the end of the year, Ray Brown and The Whispers were a national sensation – so popular that some country towns declared a public holiday when the band hit town. Their photo’s sold magazines and they were on every major teenage TV show in the country.\n\n1966 should have been the year of triumph for the hottest band in the country, but in a depressingly familiar story, the band was torn asunder by managerial hassles.\n\nBrown had been under 21 when he signed his first contract, and like many others, he discovered he had virtually no control over his career. The year it took to establish control cost him his band and the roll he was on but gave him much more integrity.\n\nNever one to give up easily, Brown set about creating a solo career.\n\nHe’d had two hits with the Whispers in 1966, including the stunningly original Ain’t It Strange? but in 1967 he was finally free to record under his own name alone. The result was another smash with The Same Old Song.\n\nThe next few years were spent recording and working in the United States, although he returned with two adventurous attempts to create original music – Moonstone (a country rock band) and One Ton Gypsy (an eight-piece jazz-rock band) – but these bands were simply too far ahead of their time in concept and execution. So too was Brown’s experiment with a blend of Aboriginal and rock music in the 1970s.\n\nThroughout the 80’s, Brown reformed The Whispers (with new line-ups) for several rock & roll revival concerts. He died of a heart attack in August 1996.\n\nRay Brown never stopped innovating. He pioneered many aspects of the Australian music industry which are now taken for granted, although sadly he was never really recognised during his lifetime.\n\nRay Brown\n\nVocals\n\nAl Jackson\n\nGuitar\n\nLaurie Barclay\n\nGuitar\n\nJohn Manners\n\nBass\n\nPat Jeffrey\n\nDrums\n\nVideo"}, {"url": "https://adb.anu.edu.au/biography/lindsay-raymond-7760/brown-harry-percy-5384", "page_content": "by M. J. Howard\n\nSir Harry Percy Brown (1878-1967), engineer, public servant and company director, was born on 28 December 1878 at Hylton, County Durham, England, son of George Brown, a former superintendent of the London Telegraph Office, and his wife Sarah Emma, née Dawson. Educated at Bede College, Durham, and Durham College, Newcastle upon Tyne, he entered the Post Office and advanced quickly. On 28 September 1904 he married Emily Aldous in the Anglican Church of St Andrew, Leytonstone. In 1913, as an adviser to the Indian government, he introduced management by telephone of rail traffic and dock-handling in Calcutta. Next year Brown was made responsible for the technical planning and management of all telephone and telegraph plant in Great Britain. In 1916 he was placed in charge of 'emergency communications' for home defence. This work, which entailed a high degree of inventiveness and improvisation, won him an M.B.E. in 1918.\n\nOn the invitation of the W. M. Hughes government, Brown arrived in Australia late in 1922 to act as technical adviser on a three-man Postal Advisory Committee that had been commissioned to draw up a 'reconstruction' programme for postal and telegraph services. His early work so impressed W. G. Gibson, the postmaster-general, that by December he had manoeuvred the retirement of the secretary of the department, J. Oxenham, and secured Brown's accession as secretary and director. The appointment was initially controversial. The installation of an 'import', on a salary (£2500) well above that of any other Federal public servant, drew criticism from within the Post Office, from the press and from the Federal Parliamentary Labor Party. Dissatisfaction subsided within six months, however, and the next five years proved a triumph for Brown as the department underwent a period of rapid and overdue development. Allowing for the underlying economic boom and for the decisions taken before his arrival, Brown clearly gave marked impetus to this expansion.\n\nHis first undertaking was to strengthen central administration. Previously the State offices had been the main organs, but in his first four years six major sections were created at central office, Melbourne — telegraphs and wireless (1923), telephones (1924), postal services (1924), correspondence, records and staff (1926), chief inspectors' (1926) and research (1927). He also shaped new patterns of staff promotion: the pre-eminence of the career generalist was diminished by the near-abolition of the senior positions of chief clerk and clerk. It was later said that Brown tended to give undue weight to technical qualifications in administrative appointments.\n\nThe first engineer to be permanent departmental head, Brown had a personal impact on postal technology. After initial lethargy from departmental engineers, in 1925-31 he pushed through the linking of all State capitals by 'carrier wave' channels, an apparatus conveying multiple circuits on each trunk line. He similarly spurred on mechanized mail-handling, the system completed in 1930 at the Sydney General Post Office being the most extensive in the world.\n\nBrown attached as much importance to public relations as to administration and technology. To raise morale, and hence efficiency, a personnel branch was set up at central office. The interest taken by him in staff matters was intense and never condescending. The same thought was given to his market, the public. Subscriber surveys, advertising campaigns, and press releases were used on an unprecedented scale. These measures had considerable success in improving the poor image of the department. Brown himself received a prominence in the press extraordinary for a Commonwealth public servant.\n\nAs he did with the postal and telegraph services, Brown played a key role in the growth of wireless broadcasting between 1923 and 1928. A very active intermediary in the negotiations between industry interests and the minister, he was later credited with the formulation of the 'dual system' of 'A' and 'B' class stations enacted under the Wireless Agreement Act, 1924, and the wireless telegraphy regulations. While he probably did not instigate the 1928 decision of the government to purchase the assets of the 'A' stations — at the time he was actively representing Australia at conferences in Washington and London — he was, as chairman of the Wireless Broadcasting Advisory Committee, the central figure in the planning of the 'National Broadcasting Service' in 1929-30.\n\nAfter the establishment of the Australian Broadcasting Commission in July 1932, the Postmaster-General's Department continued to have responsibility for the technical side of the national service, something which Brown prized. The department also retained its wide powers over the commercial ('B') stations and Brown, though he always preferred and was renowned for his methods of conciliation and persuasion, was not afraid to deploy these powers. At least three times — in 1931, 1936 and 1938 — he was a willing party to acts of political censorship, which he believed were necessary in times of 'crisis'. He also viewed with some dismay the growth of newspaper-controlled radio stations; in 1935 he helped to frame regulations to limit the number of stations owned by one licensee, a measure which, later weakened by Cabinet, proved of little consequence.\n\nIn the field of posts and telegraphs, Brown throughout the 1930s maintained his exacting managerial standards and his flair for public relations. The impact of the Depression could not be warded off, but the department's net profit for the years 1933-39 was an impressive £18 million. His most auspicious initiative in this period was his plan in 1935 for a daily air mail service to all Australian capitals without surcharge, a scheme which was eventually compromised in Cabinet. In 1938-39 he sat on the Defence Communications Committee, completing arrangements for the wartime control of communications.\n\nOn 3 October 1939 Brown's resignation was announced, seemingly precipitated by proposals to transfer to the A.B.C. some of the department's technical powers in broadcasting and to devolve some of the administrative functions of the director-general. In December he took up the appointment of chairman and joint managing director of the British General Electric Co. Pty Ltd, a position he had earlier declined.\n\nIn May 1940 Brown returned to the Commonwealth public service in the new wartime position of co-ordinator-general of works, his company 'releasing' his services as a war gesture. His task was to advise the Australian Loan Council on the degree of civil and military urgency of the major capital works planned by the State governments. Based on consultation with State officials, his submissions and arguments before the Loan Council facilitated the necessary reduction in civil works expenditure in 1940-42.\n\nIn August 1943 the Loan Council decided to retain Brown's services as executive of the National Works Council, planning post-war works to provide employment during demobilization and reconversion. To this end he submitted three reports, collating £150 million worth of projected works. In this phase perhaps an equally important service was his persuading State bodies to place all resource orders to war production authorities through him. In contributing to resource co-ordination he had been able to draw on his experience in rationalizing supply and distribution in the P.M.G. in 1926-27, and from his long membership of the Commonwealth Stores Supply and Tender Board.\n\nBrown's pre-eminent reputation brought him extra wartime tasks. In 1940 he submitted a report on the standardization of State power-supply systems. From July to November 1941, he acted as part-time director of war organization of industry, under a minister but without a department. He was a member of the Treasury's advisory committee on financial and economic policy, and early in 1943 he investigated charges against the New South Wales director and the deputy director of the Allied Works Council. In 1944-45 he wrote a report which provided the framework for the post-war Snowy Mountains hydro-electric scheme.\n\nFollowing a serious illness in August 1945, Brown resigned from the public service. He remained, however, a co-opted member of the Council for Scientific and Industrial Research until 1952, this arrangement stemming from his formative membership of the Radio Research Board in 1927-39. He did not retire from his post with British General Electric until 1953, having presided over the establishment of local manufacture of small-horsepower motors and light industrial products.\n\nPhysically and intellectually robust, Brown was a great and powerful public servant. Gracious and high-minded by nature, he was capable of shrewdness with ministers and sternness with critics. He cherished the Empire and voted conservatively all his life. He had settled religious beliefs. Radiating his conviction of the personal rewards of public service and of the ultimate good of scientific advance, he aspired to social leadership, but his standards were not as lofty or as stern as those of his contemporary, Lord Reith. For all his polish and discipline, Brown was very much at home in the Australia of the inter-war period. He had been appointed C.M.G. in 1934 and was knighted in 1938. Survived by two sons and a daughter, he died in Sydney on 5 June 1967. His estate was valued for probate at $145,817."}, {"url": "https://www.wikitree.com/wiki/Carter-29003", "page_content": "Harry Raymond (Raymond) Carter\n\n13 Oct 1911 in Pine Ridge, New South Wales, Australia Bornin\n\nAncestors\n\nHusband of [private wife (1910s - 1980s) ]\n\nDescendants\n\n27 Nov 1986 at age 75 in Quirindi, New South Wales, Australia Diedin\n\nProfile last modified 25 Aug 2019 | Created 25 Jul 2019\n\nThis page has been accessed 384 times.\n\nBiography\n\nHarry Raymond Carter (1911-1986)\n\nHarry Raymond Carter was born in 1911 at Quirindi, New South Wales, Australia. He was the son of Harry Carter and Elsie Tate. [1]\n\n\n\nHarry Raymond Carter married Barbara Davies in 1935 at Scone, New South Wales, Australia. [2]\n\n\n\nMarriage Notice \"Family Notices\" The Sydney Morning Herald (NSW : 1842 - 1954) 10 December 1935: Page 10 <http://nla.gov.au/nla.news-article17208113>. CARTER—DAVIES.—November 22, at St. Luke's Church, Scone, by the Rev. Canon Cadell, Harry Raymond, youngest son of Mr. H. C. Carter, M.L.A., and Mrs. Carter, of Yarramen North, Quirindi, to Barbara, only daughter of Mr. and Mrs. J. R. C. Davies, Puen Buen, Scone.\n\nHarry Raymond Carter enlisted on 22 July 1941 and served as a Flying Officer with the Royal Australian Air Force during World War 2. He was discharged from duty on 20 November 1945. [3]\n\n\n\nRoyal Australian Air Force\n\nWorld War Two Service [4] Veteran Details Name CARTER, HARRY RAYMOND Service Royal Australian Air Force Service Number 60111 Date of Birth 13 Oct 1911 Place of Birth QUIRINDI, NSW Date of Enlistment 22 Jul 1941 Place of Enlistment SYDNEY, NSW Next of Kin BARBARA Date of Discharge 20 Nov 1945 Rank Flying Officer Posting at Discharge Air Force Headquarters Prisoner of War No Honours None for display\n\nHarry Raymond Carter passed away 27 November 1986 at Quirindi, New South Wales, Australia. [5] [6] [7]\n\n\n\nSources\n\nfamily info and birth and death certicates\n\nSponsored Search\n\nMemories: 1\n\nEnter a personal reminiscence or story."}, {"url": "https://wiki2.org/en/Raymond_Harry_Brown", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican composer, trumpeter, and jazz educator\n\nFor other people named Raymond Brown, see Raymond Brown (disambiguation)\n\nMusical artist\n\nRaymond Harry \"Ray\" Brown (born November 7, 1946) is an American composer, arranger, trumpet player, and jazz educator.[1] He has performed as trumpet player and arranged music for Stan Kenton (early 1970s), Bill Watrous, Bill Berry, Frank Capp – Nat Pierce (Juggernaut Big Band), and the Full Faith and Credit Big Band.[2]\n\nYouTube Encyclopedic\n\n1 / 1 Views: 467\n\nV-Disc 309 Stan Kenton, Raymond Scott Transcription\n\nCareer\n\nBrown joined Kenton in September 1971, succeeding Gary Lee Pack [b. 1950; Director of Jazz Studies (retired), University of Southern Maine], holding the jazz trumpet chair and serving as an improv clinician. The Kenton trumpet section included Mike Vax,[3] Jay Saunders, and Dennis Noday.[4] Brown also contributed arrangements for Kenton, including \"Mi Burrito\" and \"Neverbird.\"[3] Brown remained with the Kenton Orchestra until November 1972.\n\nBefore joining the Kenton Orchestra, Brown had served as arranger and trumpeter with the Studio Band of The United States Army Field Band at Fort Meade, Maryland (1968–71). His tenure with the Army Band and Kenton coincided closely with that of Jay Saunders — trumpet player, and jazz educator, who, while with the Kenton Orchestra, eventually played lead trumpet.\n\nBrown also has performed with Mundell Lowe, Leroy Vinnegar, Ray Brown, Thad Jones, Jimmy Heath, Steve Gadd, and Billy Hart.\n\nBrown conducted the recording session of the Roy Hargrove Quintet entitled Roy Hargrove with Strings, Moment to Moment, released May 2000 on Verve. He has appeared at the Monterey Jazz Festival frequently as conductor of his wife Susan Cahill Brown's Monterey Jazz Festival Chamber Orchestra in collaboration with Charlie Haden, Kenny Barron, Michael Brecker, Ralph Towner, Gary Burton, and Terence Blanchard.\n\nBrown currently leads his own big band, the Great Big Band, which has performed at the Monterey Jazz Festival, the San Jose Jazz Festival, the Santa Cruz Jazz Festival,[5] the Lake Tahoe Music Festival,[6] and jazz venues in the San Francisco Bay area.\n\nRay is currently on the faculty of Cabrillo College in Aptos, California, teaching jazz improvisation, arranging, and jazz ensembles.\n\nFormal education\n\nEarly career\n\nMusical family\n\nRay's wife, Sue Brown [10] (b. 1949, New York),[11] is a violinist and teacher of strings – violin, viola, chamber music, and orchestra. She holds a Bachelor of Music from Ithaca College (1971) and a Master of Fine Arts from Sarah Lawrence College (1974), where she studied with Dorothy DeLay. She also did post-grad work at the University of Colorado (1975). Ray and Sue were married on August 26, 1973, and together, they have three daughters, one of whom, Karin,[12] is a violinist and is married to cellist Daniel Levitov.[13] Karin earned degrees in music from Oberlin Conservatory of Music (1998) and Juilliard. Daniel is a member of the preparatory faculty at the Peabody Institute.\n\nRay, born 1946 in Oceanside, New York, grew up in Freeport, New York. He has three older brothers, Glenn Edward Brown (1937–2007), Stephen Charles Brown, Roger V. Brown and a younger sister, Jeanne De Martino.\n\nGlenn taught music for 28 years.\n\nSteve is a jazz guitarist, bassist, drummer, composer, and arranger. For 45 years, Steve was professor of music and director of jazz studies at the Ithaca College School of Music (retired 2008). One of Steve's many life achievements is that he formalized jazz studies in 1968 at Ithaca College School of Music, a long-standing, well-known music institution within a well-known liberal arts college that was founded in 1892 solely as a conservatory of music.\n\nRoger, a civil engineer, played bass. He did two tours with Astrud Gilberto.\n\nJeanne, a pre-school teacher, played flute.\n\nGlenn, Steve, and Ray all earned music degrees from Ithaca College – Steve: Bachelor of Music (1964) and a Master of Music (1968); Ray: Bachelor of Music (1968). Ray's nephew (Steve's son) – Miles Brown[14] – is a jazz bassist, performer, and music educator.\n\nRay's father, Glenn Earl Brown (1914–1965;[15] 1936 graduate of Ithaca College School of Music), was the District Music Supervisor of Public Schools for Long Beach, New York. He was also director of bands at Long Beach Jr. Sr. High School from 1938 to 1965. As a pioneer in jazz education at the scholastic level,[16] he introduced stage bands to Long Beach public schools in 1939.[17] He also ran a music camp — Lake Shore Music Score — at Lake Winnipesaukee, Center Harbor, New Hampshire. Glenn Brown had been, for more than 14 years, a marimba soloist with the Xavier Cugat Orchestra.[18]\n\nRay's mother, Marie Brown (née Ward) (1916–2002), taught English at Boardman Junior High School in Oceanside for 28 years, where, before retiring from the Oceanside School District in 1982, she served as curriculum coordinator and English department chairwoman.[19][20] She earned a Bachelor of Music degree from the Ithaca College School of Music in 1935, where she played piano, saxophone, and clarinet. She also held a Masters in English from Hofstra University.[21]\n\nSelected compositions/arrangements\n\nCompositions/arrangements for the Stan Kenton Orchestra[22]\n\n\"Call Me Mister\" (Kenton Chart Nos. 565 & 1168)\n\n\"Hit and Run\" – EP305104 © 1972 V1718P086 (Kenton Chart No. 488)\n\n\"Is There Anything Still There?\" – EP304505 © 1972 V1718P086 (Kenton Chart No. 800)\n\n\"Mi Burrito\" – EP354892 © 1973 V1718P086 (Kenton Chart No. 975)\n\n\"Neverbird\" (Kenton Chart No. 564)\n\nArrangement for the Stan Kenton Orchestra\n\nOther compositions/arrangements\n\n\"Route 81 North\" (arrangement)\n\n\"Clyde's Glides\"\n\n\"Double Fault Blues\"\n\n\"AfterThoughts\"\n\n\"The Opener\"\n\n\"My Man Willie\"\n\n\"Tomas Gatos\"\n\n\"Arthur Author\"\n\n\"Two Rare T-Bones\"\n\n\"Procrastination City\" – copyright no. EP354893 © 1973 V1718P086\n\n\"Big D and Me\" – copyright no. PA0000398365 © 1988\n\n\"Blues for the two K's\" – copyright no. PAu000444456 © 1982\n\n\"Got the time?\" – PA0000398368 © 1985\n\n\"Haziness\" – copyright no. PA0000250024 © 1984\n\n\"Hop, skip, and a Jump\" – copyright no. PAu000313614 © 1981\n\nSelected discography\n\nThe Session, Studio Band of the United States Army Field Band (Brown is one of three arrangers), recorded Washington, D.C., Nov. 1972 \"Route 81 North\", arr. Ray Brown \"Is There Anything Still There?\" arr. Ray Brown\n\nAs a member (jazz trumpet/flugelhorn) of the Stan Kenton Orchestra\n\nArrangement recorded by the Stan Kenton Orchestra\n\nKenton For Collectors Vol. 3 (recorded live, Towson State University, July 27, 1976), Dynaflow (CD) (released October 16, 2007)[i] \"Angel Eyes\", by Matt Dennis & Tom Adair, arr Ray Brown\n\nAs a member of the Full Faith & Credit Big Band\n\nAs leader of Ray Brown's Great Big Band\n\nOther recordings\n\nOther published works\n\nAn Introduction to Jazz Improvisation, by Ray Brown and Steve Brown, Piedmont Music (1975); OCLC 22326461\n\nSelected film- and videoography\n\nThe Music of Stan Kenton (film for television) (note: 1969 is the date given in some resources,[23]\n\nProduction director: Stanley Dorfman\n\nFestival de Jazz de Montreux, Switzerland 1979 (film for television)\n\nSwing Shift, 1984 film (USA)\n\nA Tribute to Count Basie, filmed at Kan-i Hoken Hall, Tokyo, November 11, 1989 (film for television)\n\nFujitsu Concord Jazz Festival, filmed at Kan-i Hoken Hall, Japan, November 11, 1990 (film for television)\n\nHonors and awards\n\nIthaca College School of Music\n\nBrown family who studied at the Ithaca College School of Music: As part of the Ithaca College School of Music expansion (2001), a chamber jazz room was added as a gift from Steve McCluski '74 and Kim Joslyn McCluski '74 in honor of the Brown family. A plaque there honors seven members of the Brown family who graduated from Ithaca College: 1) Glenn Brown (1914 – 1965) — Ithaca College School of Music (IC) 1936 (Ray's father) 2) Marie Brown (née Ward; 1916 – 2002) — IC 1935 (Ray's mother) 3) Stephen Charles Brown — Ithaca College (IC) Bachelor of Music 1964; Master of Music 1968 (Ray's second oldest brother) 4) Barbara Katz Brown — IC 1974; 1975 (Steve's wife) 5) Ray Brown — IC 1968 6) Sue Brown — IC 1971 (Ray's wife) 7) Glenn Edward Brown — IC 1959 (Ray's oldest brother)\n\n14th Annual Gail Rich Awards — Cultural Council Associates (of the Santa Cruz County arts community) (Jan 26, 2010)\n\nRay and Sue Brown were two of seven being honored — they were being honored for their creative work as music teachers[25]\n\non YouTube (fast forward to 4:13)\n\nSee also\n\nReferences\n\nNotes\n\n^ Dynaflow is a collector's label produced by historian Steven D. Harris of Pasadena, CA\n\nInline citations"}, {"url": "https://prabook.com/web/harry.edwards/2332940", "page_content": "Harry Edwards\n\nJanuary 10, 1927 (age 85) Sydney, Australia\n\nIn 1966 he became Professor of Economics at Macquarie University, a position he held until 1972. Among his students was John Hewson. He held the seat until his retirement in 1993. Edwards was the only person to be on the Coalition front bench during the Labor governments of both Gough Whitlam and Bob Hawke, without holding ministerial position during the intervening Liberal government of Malcolm Fraser."}, {"url": "https://musicbrainz.org/artist/4a8e09e1-148d-4ff6-84d4-96fab4c984c3", "page_content": "Ray Brown ~ Person\n\nLegal name: Raymond Harry Brown\n\nDiscography\n\nShowing official release groups by this artist ."}, {"url": "https://alchetron.com/Raymond-Harry-Brown", "page_content": "Raymond Harry \"Ray\" Brown (born November 7, 1946) is an American composer, arranger, trumpet player, and jazz educator. He has performed as trumpet player and arranged music for Stan Kenton (early 1970s), Bill Watrous, Bill Berry, Frank Capp – Nat Pierce (Juggernaut Big Band), and the Full Faith and Credit Big Band.\n\nContents\n\nBrown joined Kenton in September 1971, succeeding Gary Lee Pack [b. 1950; Director of Jazz Studies (retired), University of Southern Maine], holding the jazz trumpet chair and serving as an improv clinician. The Kenton trumpet section included Mike Vax, Jay Saunders, and Dennis Noday. Brown also contributed arrangements for Kenton, including \"Mi Burrito\" and \"Neverbird.\" Brown remained with the Kenton Orchestra until November 1972.\n\nBefore joining the Kenton Orchestra, Brown had served as arranger and trumpeter with the Studio Band of The United States Army Field Band at Fort Meade, Maryland (1968–71). His tenure with the Army Band and Kenton coincided closely with that of Jay Saunders — trumpet player, and jazz educator, who, while with the Kenton Orchestra, eventually played lead trumpet.\n\nBrown also has performed with Mundell Lowe, Leroy Vinnegar, Ray Brown, Thad Jones, Jimmy Heath, Steve Gadd, and Billy Hart.\n\nBrown conducted the recording session of the Roy Hargrove Quintet entitled Roy Hargrove with Strings, Moment to Moment, released May 2000 on Verve. He has appeared at the Monterey Jazz Festival frequently as conductor of his wife Susan Cahill Brown's Monterey Jazz Festival Chamber Orchestra in collaboration with Charlie Haden, Kenny Barron, Michael Brecker, Ralph Towner, Gary Burton, and Terence Blanchard.\n\nBrown currently leads his own big band, the Great Big Band, which has performed at the Monterey Jazz Festival, the San Jose Jazz Festival, the Santa Cruz Jazz Festival, the Lake Tahoe Music Festival, and jazz venues in the San Francisco Bay area.\n\nRay is currently on the faculty of Cabrillo College in Aptos, California, teaching jazz improvisation, arranging, and jazz ensembles."}], "Raymond Harry Brown moved to the United States in the 1940s.": [{"url": "https://oxfordre.com/americanhistory/view/10.1093/acrefore/9780199329175.001.0001/acrefore-9780199329175-e-64", "page_content": "Suburbanites played key roles in other political movements as well. Levittowners engaged in environmental activism by the late 1960s, part of a broader push among suburbanites nationally. 57 As ironic as this may have appeared to those who saw Levittown as the epitome of denuded nature, many Levittowners in fact had a discernable connection to their natural environment, fostered both by the developers and their own labors in yards and gardens. When Levittown began feeling the effects of local factory pollutants and encroaching overdevelopment, residents united in action. This new politics coalesced around Earth Day in , then fanned out into a range of grassroots activities. Residents gathered for garbage clean-up days, opposed a proposed nuclear power plant, held environmental teach-ins, circulated petitions, and picketed the nearby U.S. Steel plant over industrial pollutants. 58 Suburban politics in the postwar years, thus, encompassed a range of political players who embraced such wide-ranging impulses as environmentalism, racial liberalism, and feminism.\n\nLocal politics in the first two Levittowns exemplified these and other themes. In the 1950s, conflicts over the Levittown, NY, schools broke out between advocates of progressive versus traditional education, refracting larger differences between liberals and conservatives. 55 More dramatic was the race riot that erupted in when the first black family moved into Levittown, PA. Their arrival was facilitated by a small, dedicated group of local activists, mainly leftists and Quakers, who were committed to civil rights. When William and Daisy Myers stepped forward to become black pioneers in Levittown, their arrival sparked massive grassroots resistance. For several weeks, hundreds of white residents gathered in the evenings, hurling rocks and yelling epithets (see Figure 2 ). They burned a cross and sprayed “KKK” on the property of Myers supporters. Yet other white residents stepped up to support the Myers family. As the conflict turned Levittown into a “civil rights battleground,” the event illustrated the presence of both pro- and anti-integrationists in the suburb. Eventually, emotions simmered down. Yet as Tom Sugrue shows, the end result signaled the limits of racial liberalism in places like Levittown where blacks remained a miniscule percentage of the population for decades, as well as in other metro areas where sharp class and race inequality persisted. 56\n\nRecent scholarship has also explored the presence of liberal and progressive politics in postwar suburbs, through grassroots movements for affordable housing, pacifism, and desegregation in housing and schools. Sylvie Murray’s study of families in the suburban fringe of eastern Queens, New York, for instance, shows that women played critical roles in liberal political causes. Residents like a young Betty Friedan mobilized to enhance their quality of life, which included a vision of integrated schools and multicultural neighbors, and they sought the active hand of government to achieve these ends. Lily Geismer’s study of Boston reveals the strength, and also the limits, of liberal activism in suburbia. White liberals in suburbs like Brookline and Newton actively supported a racially open housing market, but they rarely challenged the high economic hurdles that ensured that most people of color could not afford these neighborhoods. 54\n\nRecent scholarship has documented the crucial role suburbia played in the rise of postwar conservatism, while newer studies linked suburbs to centrist and liberal politics. Two important works on suburban conservatism centered on California. Historian Lisa McGirr’s study of Orange County demonstrated how this prosperous region—characterized by high-tech defense industry, an all-white well-educated populace, and Christian evangelicalism—was a potent breeding ground for modern-day conservatism. In the late 1950s and 1960s, these “suburban warriors” coalesced into a remarkable grassroots movement that attacked communism locally and globally, opposed big government, and supported the protection of property rights and Christian morality. Michelle Nickerson’s study of Los Angeles documented a similar movement of suburban women who rallied against communism and racial integration, particularly in public education. The infrastructure they created—study groups, newsletters, bookstores, and clubs—represented a crucial formative aspect of a maturing Republican Party. Both studies argued that localized suburban politics in this era deeply shaped conservatism at the national scale. 52 Another cluster of studies highlighted racial politics in postwar suburbia, and the dogged efforts of suburbanites to resist federal civil rights mandates to integrate neighborhoods and public schools. Evoking the language of “white rights,” colorblind meritocratic individualism, and homeowner entitlement, suburbanites across the nation—and across the partisan spectrum—resisted school desegregation, court-ordered busing, open housing laws, and public housing, in battles that began locally but ultimately influenced federal policy and the national parties. As Matthew Lassiter and others have shown, this bipartisan suburban movement elevated the issues of metropolitan politics onto the national stage by asserting the interests of suburban taxpayers, etching deeply entrenched patterns of inequality across metropolitan areas. The Republican Party was first to connect with this voting bloc at the national level, using it to win electoral majorities in seven of the ten Presidential elections from , but Democrats likewise supported suburban political mandates during the postwar years. 53\n\nScholars have examined the political culture of postwar suburbia since the mass suburban boom began, tracing critical trends that have shaped U.S. politics at large, including ideals of localism, meritocratic individualism, home owner entitlement, and aversion to general taxation. In the 1950s, political scientist, Robert Wood explored the fragmented municipal landscape of suburbia and the localism that characterized its political culture much as it had since the . This ideal of localism manifested in campaigns around municipal incorporation and zoning controls, annexation, taxation, school policy and local services from potholes to public swimming pools. Other political identities blossomed at the local level. Many suburbanites derived their core political identity—as white middle-class, taxpaying homeowners—within the context of their suburban neighborhoods, often politically independent municipalities. Suburbanites made a direct connection between their role as taxpayers and their right to a particular quality of life, delivered through services like good schools and safe streets. They developed a sense of entitlement to these advantages, which they perceived as the just rewards of their individual efforts to achieve home ownership. Historians, in turn, have exposed the limitations in this thinking by underscoring the broad web of governmental policies that subsidized and privileged white suburban homeowners. 50 Nevertheless, the notion of homeowner entitlement based on meritocratic individualism remained as a core element of postwar suburban political culture, one that transcended party lines and mobilized suburbanites against an array of perceived threats, ranging from communists to free-spending liberals, the urban poor, excluded minorities, and inefficient government. 51 Their local efforts in the postwar years came to influence national politics and the political parties. The rich scholarship on suburban politics produced by historians in recent years challenges an earlier image of suburban civic banality painted by some postwar critics, and highlights the national importance of suburban politics.\n\nSeveral social scientists in the 1960s set out to challenge what they called “the myth of suburbia” created by this polemical discourse. Sociologists like Bennett Berger, Herbert Gans, and William Dobriner found that moving to suburbia did not actually change people, as both the critics and boosters suggested. Instead, suburbanites continued to make life choices based upon such factors as class, ethnicity, religion, and personal preference. 48 Their scholarship challenged the notion that environments shape human behavior (or environmental determinism). 49 Yet for the most part, their voices were drowned out by the shriller, more lurid suburban depictions filling the bookstores, airwaves, and movie houses.\n\nOn the other side were the critics, who believed suburbia was inflicting profound damage on the American character. Academics, novelists, filmmakers, and designer-planners, among others, blamed mass suburbia for some of the most disturbing social trends of the era. Homogeneous suburban landscapes, they believed, spawned homogenous people, who followed the dictates of blind conformity. Bland, monotonous, isolating landscapes oppressed women and pushed bored kids toward juvenile delinquency. Female-centric suburban life distorted gender relations and left men emaciated. And the list went on. Not only did suburbia trivialize life, as Lewis Mumford wrote, but it fostered “the temptation to retreat from unpleasant realities, to shirk public duties, and to find the whole meaning of life in the most elemental social group, the family, or even in the still more isolated and self-centered individual. What was properly a beginning was treated as an end.” 46 The final result was a devastating turn away from civic obligation. Even suburban family life was lambasted, portrayed as the polar opposite of the carefree innocence depicted on popular television sitcoms. Novelists and filmmakers in particular depicted all manner of suburban domestic dysfunction: alcoholism, adultery, inept parenting, wounding anxieties, deeply troubled marriages, and fraught sexuality, all concealed beneath a smiling public face. These themes animated such classic postwar films as Mildred Pierce ( ), Rebel Without a Cause ( ), Man in the Gray Flannel Suit ( ), and The Graduate ( ), and the fiction of Richard Yates, John Cheever, and John Updike. 47\n\nOn one side were the boosters—business interests and politicians with a stake in selling suburban homes and the consumer goods to fill them. To them, the suburbs represented the fulfillment of the postwar “American dream”—a warm, happy place filled with healthy families and friendly neighbors, living cozy lives in homes brimming with the latest products and appliances. Magazines, television commercials, and real-estate developers peddled this image tirelessly, depicting contented white families thriving in suburbia. A logical collusion infused their efforts. Real-estate interests plugged the homes themselves, while shelter magazines ran articles on suburban living alongside vivid advertisements for refrigerators, range-tops, television sets, cleaning products, and other household goods. These ads invariably depicted happy homemakers set against a backdrop of gleaming, modern suburban interiors. The picture came full circle on television sitcoms like Leave It to Beaver and Father Knows Best, which offered benign, family-centered stories of generational quarrels and reconciliation, all sponsored by advertisers eager to tap into the lucrative suburban market. The result was a reinforcing web of suburban salesmanship. 44 Political leaders, too, celebrated suburban living, linking suburban consumption to the health of the republic itself. And they elevated the suburban home to a gleaming symbol of American superiority during the Cold War. In the so-called “Kitchen Debates” of , which took place at an exposition of U.S. products in Moscow, Vice President Richard Nixon sparred with Soviet Premier Nikita Khrushchev over the merits of capitalism versus communism, while standing in a six-room $14,000 ranch house assembled by a Long Island sub-divider and furnished by Macys. Nixon used this slice of everyday suburban life as the ultimate Cold War propaganda weapon. 45\n\nThe spread of mass suburbs touched off a virtual “culture war” in America between suburbia’s boosters and its critics. This debate pulled in a range of participants, from advertisers, real estate developers and politicians to journalists, academics, and filmmakers. In the course of debating the relative merits of mass suburbia, each side put forth vivid—if often distorted—images of suburban life, swinging wildly between the extremes of utopia and dystopia. The suburban portrayals and images they generated had deep and lasting impact on the ways that many Americans came to view the suburbs, even up to our own day.\n\nThe centrality of women was another feature of postwar suburban social history. In these dormitory suburbs, husbands typically commuted to work during the day leaving their wives at home to dominate daily life in the community. The postwar return to domesticity was driven by powerful media imagery and platitudes by national leaders that valorized the housewife, infusing her role as household consumer and manager with patriotic overtones in the context of the Cold War. 41 Popular magazines schooled suburban women in the ways of scientific housekeeping, pushing products and the latest techniques for cleaning, entertaining, and child rearing. Yet despite this image of quiescent domesticity, women were active community participants in suburbia—as the “telephoners, organizers, and arrangers of community life.” 42 They built social networks, joined clubs, and engaged in politics. Although suburban men tended to dominate positions of local leadership, women did much of the everyday work to keep social and civic life vibrant. 43\n\nWhyte found neighbors who were closely connected, and immersed in a culture of borrowing and lending, participation in local clubs and civic groups, and social intimacy. Neighbors were not merely acquainted. They bonded on multiple levels—in the minutiae of the everyday demands of child raising and running homes, in mutual concerns about local civic issues, and even in intellectual and spiritual life. 34 Suburbia seemed to encourage a habit of joining. Similarly, studies of the Levittowns reveal that early residents relied upon one another, especially the many isolated, carless housewives. Neighbors gave each other rides, formed babysitter co-ops, gathered regularly for television viewing parties, and created a nurturing social environment. 35 Even yard work became a socializing experience, as neighbors shared tips with one another. 36 Without fences to separate neighbors, children freely circulated from one backyard to the next, and acted as a kind of social “glue” for their parents. 37 As a child in Levittown, New York, Martha Mordin later recalled, “Living here was like being in an extended family. There were lots of mothers. If you couldn’t talk to your own mother, you could talk to someone else’s mother.” 38 One Levittowner concluded simply, “Had we stayed in the city, I never would have joined anything.” 39 Even sociologist Herbert Gans, whose participant-observer study of Levittown, PA, was meant to challenge an emerging suburban critique of hyperactive socializing and conformity, conceded that suburbanites engaged in high levels of community engagement. 40\n\nThe mass-produced suburb became the subject of intense public scrutiny, representing a proliferating built form that appeared to present a new, untested social canvass. Observers wondered, was this setting producing new patterns of life and behavior? Under this microscope, certain salient themes emerged about suburban social life. For one, postwar suburbanites were active participants in their neighborhoods. A number of accounts documented this pattern, but perhaps the most influential portrait was by Fortune editor William H. Whyte in his bestseller Organization Man. The final third of that book provided a detailed portrait of Park Forest, Illinois, which he dubbed the “dormitory” of the organization man, and characterized as a “hotbed of Participation” with a capital “P.” 33 Whyte was one among many journalists from mass circulation magazines like Harpers , Fortune, and Look who delved into social experience on the new suburban frontier.\n\nDemographics established an important basic context. Right after World War II, new suburbs attracted a remarkably homogenous population, comprised of relatively young, white married couples with kids. Heterosexual families with distinct roles for men and women were the accepted norm. In , just 9% of suburban women worked outside the home, compared to 27% nationally. 27 In the era’s best known development, Levittown, New York, residents were all white, ranged from 25 to 35 years old, were married less than seven years, and had an average of three children. The husband was employed and the wife was a homemaker. 28 There was notable religious and ethnic diversity, however, with a mix of Protestants, Catholics, and Jews, while approximately 15% were foreign born. 29 Suburbs like Levittown attracted both white- and blue-collar workers, who together, through their capacity to buy homes and the consumer goods of suburban life, defined the expanding American middle class. 30 Approximately 41% of men and 38% of women had some college education; many of the men were veterans. 31 Over time, however, suburbanites of different incomes sorted into different communities, creating greater socioeconomic homogeneity within suburbs, but growing class stratification and inequality across suburbia as a whole. As historian Lizabeth Cohen points out, the rising trend toward “hierarchy and exclusion” meant that residents by the 1960s “participated in more homogeneous, stratified communities [and] the contact they did have with neighbors connected them to less diverse publics.” 32\n\nThe social history of postwar suburbia remains a fairly understudied area by historians. It is defined as much by sociologists and journalists observing suburbanites at the time, as by historians who have produced case studies of individual suburbs. Such studies offer useful starting points, especially the detailed accounts of social life that focused on the iconic mass-produced suburbs of the Levittowns and Park Forest, Illinois. Although they were hardly typical postwar subdivisions, they attracted a lion’s share of scrutiny. 26\n\nDespite such obstacles, growing numbers of minority families found footholds in postwar suburbia. Between and , the number of African American suburbanites increased by 1 million, amounting to 2.5 million by —approximately 5% of the total suburban population. Regional variations typified this movement. In the South, where African Americans had lived on the metropolitan fringes for decades, developers built more than 200,000 new homes and apartments by . In many cities, explicit planning for “Negro expansion areas” preserved access to places where blacks could move without upsetting segregation or provoking violence. Developments such as Collier Heights in west Atlanta, Washington Shores near Orlando, and Hamilton Park in north Dallas created suburban-style footholds for a growing black middle class. 24 Outside the South the proliferation of new suburban municipalities, each with control over local land use, limited construction for minority families. As a result, African Americans and other nonwhites struggled to find housing in existing city and suburban neighborhoods. Older black communities in suburbs such as Evanston, Illinois, Pasadena, California, and Mount Vernon, New York, welcomed new residents. In every region, most of these new suburbanites settled near existing minority communities, with the result that racial segregation expanded in metropolitan America even as court decisions and mass mobilization for civil rights upset the legal structures of Jim Crow. Movement into white neighborhoods was fiercely contested. And communities of color—in suburbs and cities alike—faced ongoing pressures such as school segregation, poor services, redlining, lax zoning enforcement, and reckless “slum clearance” that forced residents to organize politically as racial communities, sharpening the connection between race and place of residence. For whites and nonwhites alike, race emerged as part of the physical structure of the metropolis, reinforced by the separate and unequal spaces that they occupied. 25\n\nAt the same time, African American, Asian American, and Latino families battled for access to the suburbs, challenging not only the presumed whiteness of suburbia but the ideology of white supremacy implicit in postwar suburban ideology. In response, white suburbanites in concert with other crucial players—including government—created a web of discrimination that secured links between race, social advantage, and metropolitan space. Mechanisms of segregation included collusion by real estate brokers, homebuilders and lenders, discriminatory federal housing guidelines, local neighborhood associations, municipal land use controls, and the threat of violence. FHA underwriting guidelines, for example, explicitly required racial segregation until the early 1950s. In most cases, that spelled exclusion from a program that did so much to lift millions of whites into the middle class. By , African Americans and other people of color had received just 2% of FHA-insured mortgages. 21 Added to the barriers of institutional racism, recent historical studies suggest that acts of violence and intimidation against nonwhite neighbors—including arson, bombings, death threats, and mob assaults—numbered in the hundreds during the decades after World War II. In the Chicago suburb of Cicero, for instance, rumors that a black family had rented a local apartment in provoked a mob to ransack the building. This bleak side of postwar urban history led historian Arnold Hirsch to refer to the 1940s and 1950s as “an era of hidden violence.” 22 African Americans were targeted in most of these attacks, but discrimination also affected Asian Americans and Latinos, albeit in less predictable and capricious ways. In one well-publicized instance, a Chinese American couple, Grace and Sing Sheng, responded to the objections of white neighbors, who opposed their purchase of a house in suburban San Francisco in , by suggesting a vote. Opponents prevailed 174–28 in the informal canvas, and the disillusioned Shengs decided to move elsewhere. 23\n\nMass suburbanization had equally dramatic consequences for race in postwar America. Suburbia beckoned with opportunity for millions of whites, but it remained rigidly segregated and broadly exclusive throughout the postwar decades. Mass suburbs supported ethnic and racial assimilation, where Italians, Poles, Greeks, Jews, and other European-Americans found a common social ground that solidified their identity as “whites.” 19 The beneficiaries of racially structured federal policies, millions of “not yet white ethnics” (as historian, Thomas Sugrue described them) attained symbols of white, middle-class status, such as college educations, pensions, small businesses, and homes of their own. 20 Mass suburbia tied these benefits together in a coherent spatial package, providing a setting for common experiences, aspirations, and interests. And because these communities were prefaced on the principle of racial exclusion, the new suburbs reinforced solidarities of race while downplaying the significance of ethnic, religious, and occupational differences. Further reinforcing this merger of race and suburbia were the ever-present images in the national media of happy, white families celebrating the postwar suburban dream.\n\nThe metropolitan political structure of the United States played a hand in this divergence. As independent political entities, urban and suburban municipalities competed for business, people, and tax dollars. Cities and suburbs both used municipal powers such as land use and tax policy to maximize economic advantages within the town limits, but in the postwar period, suburbs held a clear advantage. In California’s East Bay region, for instance, the historian Robert Self shows that suburban civic leaders shaped zoning policies, infrastructure spending, and tax rates to capture flows of people and capital. They attracted new factories and other investment and bolstered services for local residents, while excluding unwanted groups such as blue-collar workers, African Americans, and other people of color. By contrast, the city of Oakland faced waves of capital flight, job losses, and growing tax and service burdens for a population that included rising numbers of African Americans and Latinos, who were prevented from moving by racial barriers in the suburban housing market. 18 The fortunes of cities and suburbs remained linked throughout the postwar decades, but the balance of prestige and power within metropolitan regions had clearly shifted.\n\nAt the metropolitan scale, the suburban shift in population and investment shaped divergent futures for U.S. cities and suburbs—a drain of people and resources from cities to their suburbs that the columnist William Laas labeled simply, “suburbitis.” 16 Older industrial centers, especially, faced serious challenges. The relocation of factories to suburbs and other lower cost locations sapped resources that had sustained city neighborhoods since the . Urban job losses stoked unemployment and poverty. Declining tax revenues forced cut-backs on infrastructure, schools and other services, which reinforced the cycle of suburbanization. By the 1960s, commentators pointed to a full-fledged “urban crisis.” Meanwhile, the suburbs boomed. 17\n\nNew residential suburbs represented just one element of the postwar suburban trend. By the early 1950s, commercial developers, corporate headquarters, big retailers and other businesses, were also migrating to the suburban fringe, setting the stage for a wholesale reorganization of metropolitan economies by the end of the century. Aided by federal tax policies such as accelerated depreciation that subsidized new buildings over the maintenance of existing ones, retailers like Macy’s and Allied Stores opened new suburban branches to capture consumer dollars that traditionally flowed to their downtown stores. Architect-developers like Victor Gruen—who designed many early suburban shopping centers, including the nation’s first indoor shopping mall, the Southdale Center in suburban Minneapolis, —evangelized the new shopping center as a modern civic center, a privately-built “public” space that would replace the traditional downtown. 13 Corporate headquarters, and other offices also began a slow shift to suburban locations. Attracted by the prestige value of elite suburbia, Fortune 500 companies such as General Foods, Reader’s Digest and Connecticut General Life Insurance built landscaped campus “estates” in suburbs such as Westchester County, New York, and Bloomfield, Connecticut, during the 1950s, signaling a trend that peaked in the 1980s. 14 In the Washington, D.C., area, government agencies also shifted to suburbia, led by the Central Intelligence Agency, which broke ground on its new campus headquarters in Langley, Virginia, in . 15\n\nThe media hailed developers like Levitt as “community builders” because they not only subdivided land and built houses but created whole communities from scratch. Despite these accolades, historian Dolores Hayden points out that the drive for profit pushed community planning to the back burner in much of postwar suburbia. Developers often set aside space for civic facilities, but local taxpayers were responsible for the cost of parks, playgrounds, libraries, and other public amenities. Levittown, Long Island, for example, was built without public sewers or even adequate septic tanks, forcing homeowner/taxpayers to make expensive upgrades after the Levitts moved on. Smaller builders were often even more frugal. Thus, for many new suburbanites, the companion to low housing prices was a high tax bill. The ongoing struggle of many suburbanites to build a sense of community in the unfinished civic landscape of mass suburbia was a legacy of this era.\n\nThe typical postwar home of the late 1940s was the “minimum house,” a reference to the FHA’s minimum building standards. They were small, often cramped for families in the midst of a baby boom, but they were considered entirely modern with their up-to-date appliances, mechanical systems and utilities (with costs for everything neatly rolled into a 25-year mortgage). The average home in was 983 square feet (down from 1,140 in ). It had 5 to 6 rooms—typically two bedrooms, one bathroom, a living room and kitchen on a single floor. 11 The size and simple construction of these homes encouraged owners to remodel as their families changed. At Levittown, Long Island, the “Cape Cod” house model included a half-story “expansion attic” upstairs. By the mid-1950s and 1960s, as consumers demanded more space, builders increased home sizes, introducing open floor plans and new designs such as split-levels and expansive, horizontal ranch homes for buyers at different price points. By the mid-1950s, mass suburbs that had started out with a mix of incomes were sorting out into neighborhoods and communities that were increasingly homogenous in terms of class. 12\n\nEmblematic of the new builders was William J. Levitt, who joined his immigrant father in the construction business in the 1930s. After experimenting with mass production during WWII, in the late 1940s the Levitts built what would become the most famous housing development of the age, the 17,000-home Levittown on Long Island , New York. By the mid-1950s, Levitt was the nation’s largest builder, with an annual production of more than 2,000 houses. 9 While large-scale builders such as Levitt attracted the lion’s share of media attention, more typical were smaller-volume and custom builders who constructed fewer than 250 homes per year, but they too turned out homes uniform in appearance and amenities, reflecting the broad standardization of the industry and the landscapes it was producing. 10\n\nEqually important to the postwar boom was a revolution in construction. In response to pent-up demand and new federal supports, a cohort of builder-developers modernized home building to achieve mass production. The new builders were young, bold, and creative; many were the children of immigrants. Using techniques pioneered by prewar builders, such as Fritz Burns of Los Angeles, and refined through work on large war construction projects, contractors streamlined home building, employing standardized parts and floor-plans, subassembly of doors and windows, and subdivision of labor to minimize the need for skilled or unionized workers. 7 The scale of building took off (see Figure 1 ). Whereas “large builders” in prewar America might have built 25 homes per year, by the late 1940s, large firms were building several hundred homes per year. Annual housing starts leaped upward from 142,000 in to an average of 1.5 million per year in the 1950s. 8\n\nThe solution to this crisis emerged from a partnership between government and private enterprise that exemplified the mixed Keynesian political economy of the postwar era. The Federal government provided a critical stimulus to suburbanization through policies that revolutionized home building and lending, subsidized home ownership, and built critical suburban infrastructure, such as the new interstate highway system. 4 Private enterprise, for its part, applied new mass production techniques and technologies tested during the war to ramp up home building. Key to this partnership was a New Deal–era agency, the Federal Housing Administration (FHA). At the heart of FHA policy was a mortgage insurance program that took the risk out of home lending and made the long-term (25–30 years), low-interest home mortgage the national standard. The FHA also granted low-interest construction loans to builders and established basic construction guidelines that set new nationwide building standards. Along with a companion program in the Veterans’ Administration (VA) created by the GI Bill, the FHA stimulated a flood of new construction that brought the price of home ownership within the reach of millions of families. “Quite simply,” concludes historian Kenneth Jackson, “it often became cheaper to buy than to rent.” 5 Jackson also notes that these programs had a pro-suburban bias. FHA and VA requirements for standard setbacks, building materials, lot sizes, and other features ruled out loans to large sections of urban America while giving preference to new homes on the suburban fringe. By the 1950s, as many as one-third of home buyers in the United States received support from the FHA and VA programs, and home ownership rates rose from four in ten U.S. households in to more than six in ten by the 1960s. The vast majority of these new homes were in the suburbs. 6\n\nThis history originated in the chaotic transition to peacetime society after . World War II migrations, military deployment, and demobilization compounded a housing shortage that dated back to the Depression. In , experts estimated a shortage of 5 million homes nationwide. Veterans returned to “no vacancy” signs and high rents. As late as , one-third were still living doubled up with relatives, friends, and strangers. American family life was on hold. 3\n\nPostwar suburbia was built upon a prewar metropolitan landscape characterized by “segregated diversity,” a heterogeneous mix of landscapes, functions, and populations that emerged in the late . Prewar commuter suburbs with lush landscaping and large houses abutted farms and orchards, modest streetcar suburbs, and Main Street shopping districts. Elsewhere, smokestacks broke the rural skyline alongside worker housing. As geographers Richard Harris and Robert Lewis conclude, “Prewar suburbs were as socially diverse as the cities that they surrounded.” 1 Ironically, this heterogeneous landscape, and especially the open spaces lying between and beyond it, was the setting for a massive wave of postwar suburbanization that was characterized by similarity and standardization. 2\n\n1970–Present: Growth and Diversification\n\nLand Development and Real Estate Changing economic conditions in the United States after reshaped suburbia, as they did much of American life. The decline of manufacturing across the industrial heartland, the rise of service employment, high-tech growth, deregulation, and globalization altered the context for metropolitan life, resulting in regional shifts, growing economic volatility, polarization of wealth and income, and unstable futures for cities and suburbs alike. New trends in the housing market set the tone for events that affected American suburbs through the following decades. New patterns of real estate investment in the 1960s and 1970s, for example, foreshadowed the coming merger of real-estate development and global financial markets that triggered recurrent housing volatility, including the global financial crisis of . After new real estate investment trusts (REIT’s), investment banks, major pension and insurance funds, and Fortune 500 corporations poured capital into metropolitan real-estate development.59 Financial deregulation at the state and federal levels opened up additional sources of investment for real-estate lending, and government sponsored financial entities, such as FNMA (colloquially known as “Fannie Mae”) facilitated the flow of money to real estate through the sale of mortgage-backed securities to investors worldwide. By , mortgage-backed securities were valued at almost $9 trillion, representing almost two-thirds of funds invested in the U.S. mortgage market.60 Flush with new capital, real-estate firms dramatically increased the scale and scope of development after . In places like California, development schemes reached gargantuan proportions that made even postwar developments like Levittown look small by comparison. Miles of pristine coastline and 10,000-acre cattle ranches succumbed to the bulldozer, giving birth to future suburban cities such as Irvine, Thousand Oaks, Temecula, and Mission Viejo, and laying the template for the pervasive sprawl that characterized modern suburban life (see Figure 3). The period saw the rise of the first truly national development firms, corporate real-estate enterprises such as Ryan and Pulte Homes, Kaufman and Broad, and Levitt, which had operations in multiple U.S.—and even international—markets. By the early , firms such as these and their successors were building tens of thousands of units per year, replicating standardized architecture and community planning across the United States. By the peak of the housing bubble in , the top five largest builders each closed on more than 30,000 houses for the year.61 Their robust activity symbolized the dramatic expansion of suburban areas and rise in the suburban population in the U.S. with a majority of Americans living in suburbia by (see Table 1). Open in new tab Photograph by Andrew Wiese, 2005. The scale and scope of real-estate investment and development ushered in new levels of volatility in U.S. real-estate markets after that had been subdued in the long postwar boom. The early 1970s witnessed the first in a series of modern boom-and-bust cycles that rocked the housing market through the . Builders reached the all-time record in U.S. housing starts of 2.36 million in and the largest three-year total in U.S. history between and . The bust, when it came, in 1974, sparked widespread bankruptcies and job losses, helping to drag the U.S. economy into recession. With frightening regularity, housing market crises returned in the early 1980s, the early 1990s, and late 2000s, creating a nauseating series of economic rollercoaster rides for homeowners and renters alike. Across these same decades, the United States witnessed a generalized rise in housing prices. Driven by growing suburban land-use restrictions, a shortage of buildable land in many metro areas, and increased supplies of mortgage capital, the long upward price spiral was a boon to property owners who hung on for the long term, but it produced a burden of rising property taxes and a growing crisis in affordability. Aspiring homeowners faced outsized home prices, pushing them to work more hours, drive greater distances, and take on greater loads of debt to purchase a suburban home. By , nearly 40 million American households were paying more than 30% of their income for housing, and as many as 10% of homeowners were paying upwards of 50%.62 In booming suburban markets, such as Orange County, California, Long Island and Westchester County, New York, and Fairfax County, Virginia, children were priced out of the suburban areas where they grew up. Public and private efforts to expand home ownership in the 1990s and 2000s met this reality with increasingly risky credit arrangements—interest-only and stated income loans, and ballooning adjustable-rate mortgages that were almost unheard of in postwar suburbia. These arrangements were at the center of the housing meltdown and global economic crisis in . For households left out of the market—blue-collar families, singles, young couples, many people of color—the spiral in housing prices was an obstacle to building wealth and a continuing source of economic disparity in America’s post-Civil Rights era.\n\nMetropolitanism After , the economic ascendancy of suburbia that had been building since reached maturity. In a landmark, study, Geographer Peter Muller explored the rise of the “Outer City,” his term for the hubs of retail activity, office parks, super-regional shopping malls, and gleaming business headquarters that clustered along the nation’s metropolitan highway exchanges. Muller concluded that “suburbia,” was now the “essence of the contemporary American city,” no longer “sub” to the “urb.”63 By the early 1970s, suburban employment outnumbered city jobs for first time, and suburban “edge cities,” such as the Washington D.C. Beltway; Schaumburg, Illinois; Boston’s Route 128 corridor; Seattle’s high-tech suburbs such as Redmond and Bellevue; and California’s Silicon Valley played a central role in the nation’s economy. By the 1990s, fewer than one in five metropolitan area jobs were located within three miles of the old central business district, whereas almost half were located ten or more miles from that center.64 While many central cities rebounded in the 2000s with new high-tech and innovation clusters of their own, they now represented just one part of the complex and poly-nucleated metropolitan economies that Muller explored in the 1970s. Analysts increasingly recognized these metropolitan economies as the drivers of the nation’s economy, competing independently in the global marketplace against other metro areas worldwide. By , this metropolitan ascendance was evident: the 100 largest metro areas in the United States were responsible for three-quarters of the nation’s gross domestic product (GDP).65 After , these trends played out across a pervasive physical pattern of suburban sprawl. Between and , metropolitan regions ballooned in area, with real-estate development consuming 43 million acres of rural land, an area larger than Washington State. By , according to one estimate, the United States was losing two acres of farmland per minute to suburban development.66 Low-density, auto-dependent development characterized fast-growing regions such as Atlanta and Los Angeles, where residents endured multi-hour commutes from new “drive ‘til you qualify” subdivisions in the rural fringe. Even in comparatively slow-growing metro areas such as Pittsburgh and Detroit, rates of suburban sprawl outpaced population growth.67 By the early , Americans were driving more miles, spending more time in the car, and using more energy than ever before. Per-capita automobile miles driven tripled between and , resulting in gridlock, taxi-parenting, and hectic patterns of family life on the road that became common features of modern suburbia.68 The fiscal costs of sprawl were equally significant. As U.S. suburban areas spent billions on new infrastructure, existing urban systems deteriorated, resulting in continued disparities between growing suburbs and declining urban and inner suburban places. Even on the fringe, however, low-density sprawl frequently failed to pay for itself. As Myron Orfield shows, fast growing “exurban” areas were among the most fiscally stressed metropolitan communities, with major imbalances in tax revenue versus needs for service.69 To make ends meet, thousands of suburban governments employed “fiscal zoning,” restricting apartments, raising lot sizes, and setting aside large areas for big box retailers to boost tax revenues. As many Americans looked forward to more sustainable ways of living, the sprawling landscapes of modern suburbia represented a major policy challenge.70 In contrast to the era of postwar “sitcom suburbs,” recent decades witnessed the construction of more varied types of suburban housing. In response to rising home prices, land shortages, and the growing crisis in affordability, corporate real-estate firms built millions of new suburban condominiums, attached homes, and apartments after . Many of these were built as part of common interest developments (CIDs), and planned neighborhoods governed by homeowners’ associations, which were ruled according to strict covenants, conditions, and restrictions (CC&Rs). Home to fewer than 1% of the population in , by as many as one in five Americans lived in a community governed by a private association, and homeowners’ associations dominated the market for new construction. In , for example, 72% of new single-family homes were built as part of a homeowners’ association.71 For builders, CIDs squeezed more units (and dollars) out of finite acreage. Suburban municipalities, for their part, welcomed CIDs—despite higher densities and more affordable housing types—because private amenities such as pools, parks, and playgrounds reduced public expenditures. Finally, in a context of rising home prices, townhome and condo developments were among the few affordable housing options for many families. For first-time homebuyers, retirees, empty nesters, and families without children, condominiums and townhomes provided flexibility lacking in postwar “sitcom suburbs.” At the same time, the rise of CIDs signaled a shift away from the suburban dream of a single-family home in communion with nature. While average house sizes grew (2,450 square feet in ), lot sizes shrank.72 The proliferation of gated CIDs after raised additional debates about privacy, exclusivity, and social division across metro America. Research by anthropologist Setha Low suggested that rather than making residents safer, gated communities tended to intensify fears of crime and social distrust.73 Such concerns were brought into deadly focus in by the shooting of Trayvon Martin, an unarmed black teenager killed by a neighborhood watch volunteer in the gated enclave where he lived near Orlando, Florida.\n\nSocial Diversification One of the most striking features of American suburbs since has been rapid social diversification, marking a return to suburbia’s historic diversity.74 After , a wide cross-section of Americans settled the suburbs, including singles, divorced adults, gays, lesbians, the elderly, the poor, and perhaps most significantly an array of ethnic and racial groups. The proportion of working women also rose substantially, shattering earlier images of suburban housewives trapped at home. As more Americans settled in the suburbs, suburbia looked increasingly like America itself. A confluence of forces underlay these changes. Trends affecting suburban women and families included the aging of baby boomers, the rise in feminism, economic slumps, and soaring inflation of the 1970s that pushed many women into the labor force. The suburban influx of racial and ethnic groups was spurred by new waves of immigration from Asia and Latin America in the wake of the Hart-Celler Act, and the passage of the federal Civil Rights Act of and Fair Housing Act of , which improved minority job prospects and curbed housing discrimination. These factors created new demographic realities, while policy changes opened suburban areas—growing at a fast clip—to groups that were once fervently excluded. One change was the suburban family, earlier typified by a working husband, homemaker wife, and the requisite two or three children. By , scholars noted an increase in divorced, separated, and single adults living in the suburbs, as well as an uptick in working women. One study of the suburbs of Nassau County, New York, found that these trends accelerated from . By , two of every five adults lived in a non-nuclear family arrangement (single, separated, divorced, or widowed). Families were having fewer children, and more than half of married women with children aged six to seven years worked outside the home. The author attributed the changes to an aging population, liberalized divorce laws, and the 1970s economic downturn which “propelled more married women into the labor market.”75 These trends continued over the next decades. By , the suburbs contained more nonfamily households (29%)—mostly young singles and elderly people living alone—than married couples with children (27%). There were also substantial proportions of married couples with no kids under 18 (29%), and rising numbers of single parents, divorced, unmarried partners, and adult relatives living in suburban homes.76 By , 75% of suburban homes did not contain a married-couple family with kids, exploding the older image of the “Leave it to Beaver” domicile.77 And while statistical data on the social geography of LGBTQ (lesbian, gay, bisexual, transgender, queer/questioning) are elusive, a range of evidence suggests that gays and lesbians also migrated to suburbia.78 One catalyst was a shift in federal housing housing/borrowing eligibility guidelines by the U.S. Department of Housing and Urban Development (HUD), which altered its definition of family away from heterosexual “marital or biological attachments” toward a more pluralist concept that would include “any stable family relationship,” including LGBTQ households.79 The powerful image of heterosexual “married with children” families in suburbia was giving way to the more complex family structures that mirrored national social change. Ethnic and racial diversification was also significant. While African Americans, Latinos, and Asian Americans comprised just less than 10% of the suburban population in , by they represented 28%. Minorities have propelled the bulk of recent suburban population gains in the 100 largest metropolitan areas, as demographer William Frey has noted.80 Even more striking are data on specific population groups. For example, from the number of black suburbanites climbed from 3.5 to nearly 15 million, comprising 39% of all African Americans. Even faster growth occurred among Latinos and Asians, who endured less severe housing discrimination than blacks. By , 46% of Latinos and 48% of Asians nationally resided in the suburbs. And in the largest 100 metro areas, the proportions were even higher—62% of Asian Americans and 59% of Latinos. Immigrants comprised a significant portion of new suburbanites as well. By , suburbia housed 50% of foreign-born residents in the United States, and numbers were even greater in the biggest metropolitan areas, where most immigrants lived.81 Even the iconic postwar suburbs reflected these changes, though in different ways. In Park Forest, the site where William Whyte documented social conformity in his best-seller Organization Man, liberal activists initiated a program of “managed integration” in the 1960s and 1970s to recruit African-American neighbors gradually. As a strategy designed to stave off white flight, the approach seemed to work at first: from , the proportion of blacks rose from just 2.3% to 24.4% of the local populace. From , however, a process of racial resegregation accelerated; large numbers of whites left the suburb and the proportion of African Americans rose from 39.4 to 59.8%.82 Lakewood, a postwar mass-produced suburb in southern Los Angeles, drew national attention in the 1950s when it became the largest development in the country with 17,500 homes, surpassing even Levittown. Lakewood eventually became a site of robust multiethnic diversity: by , the population was 40.9% white, 30.1% Latino, 16% Asian, and 8.3% black, making it one of L.A.’s most racially balanced cities.83 The irony was thick. The very suburbs once reviled for their monotonous landscapes—which supposedly churned out monotonous, conforming people—became the staging ground for racial and ethnic diversity. In some ways, this was no surprise because these communities, which were originally built to be affordable, maintained that quality once nonwhite buyers gained the economic wherewithal to become suburban homeowners and the barriers to racial segregation fell. In Levittown, New York, by contrast, whites maintained an overwhelming majority, comprising more than 80% of the population as late as .84 All three places illustrate trends in suburbia since —growing diversity alongside persistent racial segregation. Open in new tab Source: U.S. Census, Profile of General Population and Housing Characteristics: 2010, accessed on American Fact Finder. Open in new tab Source: U.S. Census, Profile of General Population and Housing Characteristics: 2010, accessed on American Fact Finder. Open in new tab Source: U.S. Census, Profile of General Population and Housing Characteristics: 2010, accessed on American Fact Finder. Another notable trend was the rise of class inequality across suburbia, with growth in both poor and rich suburbs. While poor people had long resided in the periphery, after a different set of pressures accelerated the trend. A crucial factor was economic restructuring, which created an “hourglass economy” characterized by high- and low-paying jobs, a shrinking middle class, and falling income levels for most Americans. The effects of these structural changes reverberated across suburban space. Many inner-ring suburbs contended with aging housing and infrastructure and high service needs from a growingly poor, immigrant populace. Deindustrialization in the 1970s and 1980s, in turn, devastated older industrial suburbs, which suffered a difficult combination of job loss, white flight, and environmental degradation in the wake of industry’s departure.85 Suburban poverty accelerated after , as Elizabeth Kneebone and Alan Berube have shown, driven by two economic recessions and the continued effects of restructuring and globalization.86 In addition to these economic forces, public policy also played a role. Reversing years of policies that protected the rights of suburbs to exclude the poor, the federal government gradually promoted the dispersal of low-income families into suburban areas through policies such as the Section 8 voucher program, which granted a housing allowance to people with qualified incomes who could then choose their own housing on the open market—thus untethering them from public housing projects concentrated in poor urban areas. Fair-share housing initiatives and modest inclusionary zoning and affordable housing programs also helped open the suburbs to poorer people.87 As a result, the number of poor people in the suburbs climbed. In the 1980s and 1990s, poor populations increased in both cities and suburbs; however, in the 1990s and 2000s, the rate of increase in suburbs was twice that of cities. During the 2000s, moreover, for the first time more poor people lived in suburbs than in cities—signaling that metropolitan America had “crossed an economic Rubicon.” By , 55% of the metropolitan poor lived in the suburbs, while one in three poor Americans overall lived in the suburbs, “making them home to the largest and fastest-growing poor population in the country.”88 At the same time, affluent suburbs proliferated, especially around high-tech and financial hubs like the Silicon Valley, California, Boston’s Route 128, and Fairfield County, Connecticut. Wealthy executives, tech workers, and professionals clustered in these upscale areas, their outsized salaries driving real estate prices to stratospheric levels. Despite the much-heralded return to the city by millennials and the “creative class” (i.e., workers in “knowledge intensive industries” such as computer science, medicine, the arts, and education) as late as , the super-rich concentrated in tony suburbs of the bi-coastal economy in places like Greenwich, Connecticut, Coral Gables, Florida, and Newport Beach, California.89 The middle class, meanwhile, faced mixed prospects in suburbia.90 In the , American suburbs have come to house a cross section of America itself, including the poor, the rich, and a broad array of racial and ethnic groups and family types. Inequality was reproduced across suburbia, while ethno-racial diversity set the stage for emerging forms of suburban lifeways and politics.\n\nSocial Life Suburban variations led to disparate social experiences, yielding a mosaic of suburban social histories after . While it is impossible to offer a synthesis of this history due to wide variations among suburbanites themselves as well as the nascent nature of the scholarship, certain salient themes have emerged on social life and suburban ideals in the post-1970 era. One group of scholars has emphasized a trend of social disconnection, especially among whites. After the intensive sociability of the 1950s and 1960s, suburbanites after appeared to swing to the other extreme—social alienation and detachment. This was apparent in ethnographer M.P. Baumgartner’s book The Moral Order of a Suburb. Conducting field work in a suburb of New York City in the late 1970s, Baumgartner was interested in exploring how people handled conflict in their town. What she found was a culture of tolerance and avoidance. The suburb lacked “social integration,” and instead was defined by a sense of indifference between neighbors. Avoidance as a strategy was thus logical: “It is easy to end a relationship that hardly exists.”91 She attributed this lack of neighborhood connectedness to the privatism of families; the high mobility of homeowners, making it hard for them to form lasting bonds; and the compartmentalizing of social life (at work, at church and synagogue, and at school). Other scholars extended this theme in exploring fear and privatism in suburbia, characterized in the extreme by the rise of privatized, gated neighborhoods.92 By , observers from political scientist Robert Putman in his landmark book Bowling Alone to proponents of the New Urbanism agreed that suburbs fostered social and civic disconnection.93 It was no coincidence that this change occurred at the moment many suburbs were diversifying. One study of Pasadena, California, over this time period found that racial integration in the 1970s had variable effects on community engagement among suburbanites, pushing some whites into their own insular social communities, reorienting the nature and purpose of local clubs and organization as they saw their numbers decline, and creating some pockets of multiracial social vibrancy.94 This comports roughly with the findings of some political and social scientists, who observed decreased levels of “social capital” in communities experiencing ethno-racial diversification.95 At the same time some suburbanites were retreating, others created new cultures and lifeways in the suburbs. Scholarship on ethnic suburbia, in particular, documented this from several angles. Anthropologist Sarah Mahler investigated the lives of working-poor Salvadoran immigrants living in substandard housing in Long Island, New York. The enormous economic pressures they faced, from the challenge to survive on low wages while also supporting families in El Salvador, altered the social dynamic in the Salvadoran community, away from co-ethnic reciprocity toward more individualistic survival. “Burdened with debt and remittance responsibilities,” Mahler writes, immigrant suburbanites “frequently must wring this surplus out of their own deprivation, forgoing everything but an ascetic existence.”96 A more robust ethnic culture developed in the middle-class suburbs of the west San Gabriel Valley, California, where Asian and Latino residents fostered community life and values around ideals of racial inclusivity. Wendy Cheng describes this as a “moral geography of differentiated space . . . a world view that challenged and opposed whiteness as property.”97 Remaining in these communities as white residents fled, Asian American and Mexican American residents valued the comfort and familiarity of interracial spaces. Groups like the Boy Scouts reflected this multiethnic sensibility, which in turn stimulated high levels of participation both by boys and their parents.98 Open in new tab Photograph by Victor Chalermki used by permission of Mark Padoongpatt. Open in new tab Photograph by Lucas Wiese. Open in new tab Photograph by Becky Nicolaides. Robust displays of ethnic culture and identity were strongest in what geographer Wei Li described as “ethnoburbs,” defined as “suburban ethnic clusters of residential and business districts . . . [that] are multiracial/multiethnic, multicultural, multilingual, and often multinational communities.”99 In ethnoburbs, ethnic culture is constantly refreshed by the transnational flow of immigrants, capital, and businesses. In contrast to older sociological models that considered the suburbs a site of Americanization, ethnoburbs reinforced and sustained ethnicity within suburbia (see Figures 5–7). Ethnoburbs appeared across the country, in places like the San Gabriel Valley and Silicon Valley, California, Langley Park, Maryland, Palisades Park, New Jersey, Upper Darby, Pennsylvania, and Chamblee, Georgia. In ethnic suburbs, some residents forged new suburban ideals around such values as robust public life, defying long-standing suburban traditions of privatism. For example, Thai residents of the east San Fernando Valley, California, held lively weekend food festivals at the Wat Thai Buddhist Temple, a quasi-public community space. Asian-Indian residents of Woodbridge, New Jersey, celebrated days-long Navrati festivals under enormous tents, with music, dancing, and vendors selling traditional Indian food and dress. Along Whittier Boulevard—which traversed the suburbs of Montebello, Pico Rivera, and Whittier, outside of Los Angeles, Mexican-American youth developed a cruising culture tied to the use of suburban public space.100 These practices helped cultivate community, and as Mark Padoongpatt writes of the Wat Thai festivals, “fostered a public sociability that went against dominant and even legal definitions of suburbia.”101\n\nPolitics across Diverse Suburbia Suburban politics after came to reflect these differences as well, revealing political leanings as varied as suburbanites themselves. One powerful strand worked to sustain suburban privilege. The solid tradition of tax-averse homeowner politics remained strong, and in the post-civil rights era, white suburbanites, especially, increasingly deployed a discourse of colorblind meritocratic individualism to defend their rights, claiming that suburbs were open equally to all and race and class played no role in who lived where. In general, this politics worked to protect suburbanites’ fiscal resources, to defend their quality of life, and to maintain class and racial segregation. Suburban citizens framed these efforts in terms of their hard-earned rights as taxpaying homeowners, which they felt were under siege by free-spending liberals, minorities, the urban poor, inefficient government, and even drug pushers. This political agenda manifested in several ways. One was a full-fledged tax revolt movement. In , California taxpayers resoundingly passed Proposition 13, a measure that placed severe limits on property tax rates. This campaign led the way for similar tax revolts in other states and helped propel former California governor, Ronald Reagan, a fervent supporter of Prop 13, to the White House in . Reagan embraced many of the core principles of this campaign—cutting taxes and government power—suggesting the national resonance of suburban political ideals.102 Second, many suburbanites opposed initiatives seeking to close the gap between cities and suburbs in terms of wealth, opportunity, and race. Across the country, suburbanites mobilized against busing for school integration, open housing, affordable housing, and Section 8 tenants.103 In a similar way, nonpartisan suburban NIMBY (Not In My Back Yard) campaigns proliferated against public and nonprofit projects such as group homes, AIDS clinics, daycare centers, garbage dumps, and nuclear power plants.104 Their actions suggested that suburbanites sought to reap the benefits of metropolitan belonging while minimizing its burdens. A third manifestation was suburbia’s role in the war on drugs. As recent work by Matt Lassiter shows, it created a policy approach that perceived a binary of “white suburban addict-victims and minority ghetto predator-criminals.” This construct reinforced in American political culture a tendency to demonize urban minorities while rendering white suburbanites as innocent victims, an oversimplification that belied more complex realities.105 The cumulative effect of these efforts, many of them successful, was to reinforce inequality across metropolitan space. Moreover, these efforts attracted the attention of politicians at the national level, who increasingly cultivated these voters’ support through federal policies and judicial appointments that supported suburban prerogatives. During the Richard Nixon presidency, for instance, the Federal government limited its support for fair housing, metropolitan school integration, and the dispersal of affordable housing.106 In the wake of civil rights laws that broke down explicit racial barriers in the housing market, suburban exclusion increasingly pivoted on class, fueling class segregation since .107 Local governments played a crucial role in this. Some suburbanites withdrew into privately owned and governed residential enclaves, known as Common Interest Developments (CIDs) or what Evan McKenzie labelled “privatopias” for their capacity to concentrate local resources under tight local control.108 In CIDs, civic and social belonging was restricted to select groups defined by ownership as opposed to citizenship. Suburbanites also used local zoning and building regulations as colorblind tools to exclude low-income residents through tactics like “exclusionary”—or “snob”—zoning, environmental protection codes, land trusts, historic preservation, and no-growth activism, which effectively shut out affordable housing. “Snob” zoning, for example, required large lots and floor areas and limited construction to single-family homes while prohibiting apartments and other multifamily dwellings. While housing and civil rights activists recognized this trend as early as the 1960s, it intensified over the following decades. These local initiatives were pushed not only by whites, but also some affluent Asian Americans who recognized value in suburban exclusivity.109 During the 1970s, the U.S. Supreme Court in two cases upheld these broad municipal powers, defining “general welfare” in terms of the existing residents of a community, making it impossible for new, poorer residents to enter in and have a civic voice. As race disappeared from the rhetoric of suburban exclusion, it was replaced by a class-oriented discourse of property values, landscape aesthetics, tax rates, congestion, and environmental protection, often captured by the catchall phrase “quality of life.” One result was a crisis in affordable housing, with deep ramifications for African Americans, Latinos, and other minorities who generally earned less money than whites. By harnessing the power of local government, suburbanites maintained exclusionary practices using new tools and approaches.110 This suburban outlook continued to influence the political parties and their agendas at the national level. The Republicans remained aligned with this suburban worldview, and by the 1990s the Democrats too—traditionally a city-based party—recognized the importance of the “suburban vote” and altered its ideology and platforms to win over this critical bloc. For the Democrats, this adjustment was enormous, forcing the party to recalibrate its traditional commitment to the urban poor, minorities, and labor (and their demand for public programs), with a new commitment to middle-class suburban voters (and their aversion to taxes and social welfare spending, and their reluctance to imperil their own property values). Some saw this adjustment—known variously as the “third way” or the “New Democrats”—as the effective death of liberalism; others saw it as a realistic shift toward the political center. In either case, the influence of suburban political culture on the party’s shifting values was enormous.111 In her study of Boston’s Route 128 suburbs, Lily Geismer described a hierarchical set of values among suburban liberals that justified their support of progressive causes like racially open housing while simultaneously opposing affordable housing. As progressive citizens who lived in suburbia, they viewed themselves as somehow apart, as “separate from, and not responsible for, many of the consequences of suburban growth and the forms of inequality and segregation that suburban development fortified.”112 This captured a central dilemma of suburban Democrats. Parallel to this suburban politics of defensive self-interest, a contrasting strand of progressive, social justice politics grew in the suburbs, particularly those experiencing ethno-racial change. As social diversification increased, so did new political agendas and forms of political organization, revealing “progressive potential in places once dismissed as reactionary.”113 Progressive organizations included the Suburban Action Institute, established in to wage legal battles against exclusionary zoning, and Long Island’s Workplace Project and the Southwest Suburban Immigrant Project of Chicago, which campaigned to secure better education, workplace rights, and immigration reform. One study deployed Henri Lefebvre’s concept of “right to the city” to analyze progressive suburban activism. It focused on Maywood, California, southeast of Los Angeles, a suburb of working-class Latino immigrants (including the undocumented) who claimed rights by virtue of inhabitance in particular places. They mobilized around the issue of immigrant rights, challenging the local police practice of using DUI (driving under the influence of alcohol) checkpoints to identify and criminalize undocumented immigrants, who were charged high fees for towing, impounding and fines, which amounted to “a municipal tax on immigrants.”114 A grassroots movement successfully challenged this policy, and went on to win seats on the city council which ultimately declared Maywood a “sanctuary city.”115 Maywood and neighboring Latino suburbs also waged environmental justice campaigns.116 Other progressive initiatives were launched in places like Alviso and Richmond, Ca., Silver Spring, Md., Shaker Heights, Oh., and suburbs around Cincinnati and Chicago.117"}, {"url": "https://peoplepill.com/people/raymond-harry-brown/", "page_content": "Raymond Harry \"Ray\" Brown (born November 7, 1946) is an American composer, arranger, trumpet player, and jazz educator. He has performed as trumpet player and arranged music for Stan Kenton (early 1970s), Bill Watrous, Bill Berry, Frank Capp – Nat Pierce (Juggernaut Big Band), and the Full Faith and Credit Big Band.\n\nBrown joined Kenton in September 1971, succeeding Gary Lee Pack [b. 1950; Director of Jazz Studies (retired), University of Southern Maine], holding the jazz trumpet chair and serving as an improv clinician. The Kenton trumpet section included Mike Vax, Jay Saunders, and Dennis Noday. Brown also contributed arrangements for Kenton, including \"Mi Burrito\" and \"Neverbird.\" Brown remained with the Kenton Orchestra until November 1972.\n\nBefore joining the Kenton Orchestra, Brown had served as arranger and trumpeter with the Studio Band of The United States Army Field Band at Fort Meade, Maryland (1968–71). His tenure with the Army Band and Kenton coincided closely with that of Jay Saunders — trumpet player, and jazz educator, who, while with the Kenton Orchestra, eventually played lead trumpet.\n\nBrown also has performed with Mundell Lowe, Leroy Vinnegar, Ray Brown (jazz double-bassist), Thad Jones, Jimmy Heath, Steve Gadd, and Billy Hart.\n\nBrown conducted the recording session of the Roy Hargrove Quintet entitled Roy Hargrove with Strings, Moment to Moment, released May 2000 on Verve. He has appeared at the Monterey Jazz Festival frequently as conductor of his wife Susan Cahill Brown's Monterey Jazz Festival Chamber Orchestra in collaboration with Charlie Haden, Kenny Barron, Michael Brecker, Ralph Towner, Gary Burton, and Terence Blanchard.\n\nBrown currently leads his own big band, the Great Big Band, which has performed at the Monterey Jazz Festival, the San Jose Jazz Festival, the Santa Cruz Jazz Festival, the Lake Tahoe Music Festival, as well as jazz venues in the San Francisco Bay area.\n\nRay is currently on the faculty of Cabrillo College in Aptos, California, teaching Jazz improvisation, arranging, and Jazz ensembles.\n\nFormal education\n\n1964 — Graduated Freeport High School (New York)\n\n1968 — Bachelor of Music, Ithaca College School of Music (attended 1964-68)\n\n19?? — Master of Science, C.W. Post Campus of Long Island University\n\n19?? — Arranging lessons from Willie Maiden\n\n19?? — Arranging lessons from Manny Albam\n\n19?? — Arranging lessons from Rayburn Wright (1922–1990)\n\n19?? — Arranging lessons from Hank Levy\n\n19?? — Arranging lessons from Glenn Earl Brown (Ray's father)\n\n19??-?? — Four summers, Lake Shore Music Camp, headed by Ray's father, Glenn Earl Brown\n\nEarly career\n\n1968-71 — Arranger and trumpet player for the Studio Band of The United States Army Field Band, Fort Meade, Maryland\n\nSept. 1971 – Nov. 1972 — trumpet player (jazz chair) & improv clinician with the Stan Kenton Orchestra\n\n1973 — Became a member of ASCAP\n\n1973-74 — trumpet player for Bill Watrous Band in New York\n\n1973-75 — Led own rehearsal band in New York City\n\nMar. 1975 — Grant: Jazz, Category I, National Endowment for the Arts (to write a composition for the rehearsal band)\n\n1974-75 — Teacher of improv. in nine New Jersey schools through a grant from the New Jersey State Council on the Arts\n\n1974-75 — Faculty member (teaching arranging, improv, brass), Five Towns College, Merrick, NY\n\n1974-79 — Played trumpet with the New York Orchestra, Thad Jones, Joe Newman, Ray Brown (the bassist), Leroy Vinnegar, Mundell Lowe, Bill Berry (William Richard Berry) Big Band\n\n1980 — Nat Pierce & Frankie Capp Big Band\n\n\n\n\n\nMusical family\n\nRay's wife, Sue Brown (b. 1949, New York), is a violinist and teacher of strings – violin, viola, chamber music, and orchestra. Susan holds a Bachelor of Music from Ithaca College (1971) and a Master of Fine Arts from Sarah Lawrence College (1974), where she studied with Dorothy DeLay. She also did post grad work at the University of Colorado (1975). Ray and Sue were married Aug 26, 1973, and together, they have three daughters, one of whom, Karin, is a violinist and is married to cellist Daniel Levitov. Karin earned degrees in music from Oberlin Conservatory of Music (1998) and Juilliard. Daniel is a member of the preparatory faculty at the Peabody Institute.\n\nRay, born 1946 in Oceanside, New York, grew up in Freeport, New York. He has three older brothers, Glenn Edward Brown (1937–2007), Stephen Charles Brown, Roger V. Brown and a younger sister, Jeanne De Martino.\n\nGlenn taught music for 28 years.\n\nSteve is a jazz guitarist, bassist, drummer, composer, and arranger. For 45 years, Steve was professor of music and director of jazz studies at the Ithaca College School of Music (retired 2008). One of Steve's many life achievements is that he formalized jazz studies in 1968 at Ithaca College School of Music, a long-standing, well-known music institution within a well-known liberal arts college that was founded in 1892 solely as a conservatory of music.\n\nRoger, a civil engineer, played bass. He did two tours with Astrud Gilberto.\n\nJeanne, a pre-school teacher, played flute.\n\nGlenn, Steve, and Ray all earned music degrees from Ithaca College – Steve: Bachelor of Music (1964) and a Master of Music (1968); Ray: Bachelor of Music (1968). Ray's nephew (Steve's son) – Miles Brown – is a jazz bassist, performer, and music educator.\n\nRay's father, Glenn Earl Brown (1914–1965; 1936 graduate of Ithaca College School of Music), was the District Music Supervisor of Public Schools for Long Beach, New York. He was also director of bands at Long Beach Jr. Sr. High School from 1938 to 1965. As a pioneer in jazz education at the scholastic level, he introduced stage bands to Long Beach public schools in 1939. He also ran a music camp — Lake Shore Music Score — at Lake Winnipesaukee, Center Harbor, New Hampshire. Glenn Brown had been, for more than 14 years, a marimba soloist with the Xavier Cugat Orchestra.\n\nRay's mother, Marie Brown (née Ward) (1916–2002), taught English at Boardman Junior High School in Oceanside for 28 years, where, before retiring from the Oceanside School District in 1982, she served as curriculum coordinator and English department chairwoman. She earned a Bachelor of Music degree from the Ithaca College School of Music in 1935, where she played piano, saxophone, and clarinet. She also held a Masters in English from Hofstra University.\n\nSelected compositions/arrangements\n\nCompositions/arrangements for the Stan Kenton Orchestra\n\n“Call Me Mister” (Kenton Chart Nos. 565 & 1168)\n\n“Hit and Run” – EP305104 © 1972 V1718P086 (Kenton Chart No. 488)\n\n“Is There Anything Still There?” – EP304505 © 1972 V1718P086 (Kenton Chart No. 800)\n\n“Mi Burrito” – EP354892 © 1973 V1718P086 (Kenton Chart No. 975)\n\n“Neverbird” (Kenton Chart No. 564)\n\non YouTube\n\nArrangement for the Stan Kenton Orchestra\n\n“Angel Eyes”, Matt Dennis & Tom Adair, arr Ray Brown\n\nOther compositions/arrangements\n\n“Route 81 North” (arrangement)\n\n“Clyde's Glides”\n\n“Double Fault Blues”\n\n“AfterThoughts”\n\n“The Opener”\n\n“My Man Willie”\n\n“Tomas Gatos”\n\n“Arthur Author”\n\n“Two Rare T-Bones”\n\n“Procrastination City” – copyright no. EP354893 © 1973 V1718P086\n\n“Big D and Me” – copyright no. PA0000398365 © 1988\n\n“Blues for the two K's” – copyright no. PAu000444456 © 1982\n\n“Got the time?” – PA0000398368 © 1985\n\n“Haziness” – copyright no. PA0000250024 © 1984\n\n“Hop, skip, and a Jump” – copyright no. PAu000313614 © 1981\n\non YouTube\n\n“Little Jeannette Leigh” – copyright no. PA0000250023 © 1983\n\n“No Timeouts Left” – copyright no. PA0000398361 © 1988\n\n“Spectrum” – copyright no. PA0000250025 © 1984\n\n“Three to go” – copyright no. PA0000398367 © 1985\n\n“Straightahead City”\n\n“Bossa Barbara” by Steve Brown, arr. Ray Brown\n\n“Embraceable You/Quasimodo” – Gershwin / Charlie Parker, arr. Ray Brown\n\n“The Telephone Song” – Music by Menescal, Portuguese words by Boscoli, English words by Gimbel, arr. Ray Brown\n\n“Bittersweet” – Willie Maiden, transcribed by Ray Brown\n\n“Our Love Is Here To Stay” – George Gershwin, arr. Ray Brown\n\n“Del Sasser” – Sam Jones, arr. Ray Brown\n\n“Kayak” – Kenny Wheeler, arr. Ray Brown\n\n“Barbara” – Horace Silver, arr. Ray Brown\n\n“I Could Write a Book” – Rodgers & Hart, arr. Ray Brown\n\n“The Thumb” – Wes Montgomery, arr. Ray Brown\n\n“The Ballad of Thelonious Monk” – Jimmy Rowles, arr. Ray Brown\n\n“Stella By Starlight” – Victor Young, arr. Ray Brown\n\n“I.C. Light” – Ray Brown (commissioned for the retirement of Steve Brown, March 2008)\n\n“Turn Out The Stars”, by Bill Evans, arr. Ray Brown\n\n“Louie’s Prima”\n\nSelected discography\n\nThe Session, Studio Band of the United States Army Field Band (Brown is one of three arrangers), recorded Washington, D.C., Nov. 1972 \"Route 81 North\", arr. Ray Brown \"Is There Anything Still There?\" arr. Ray Brown\n\nAs a member (jazz trumpet/flugelhorn) of the Stan Kenton Orchestra\n\nStan Kenton Today (recorded live, Fairfield Halls, Croydon, Surrey, UK, February 10, 1972, 2nd show), originally released in 1972 by Creative World Inc. (2 LPs, quadraphonic), re-released by Dutton Vocalion (2 CDs), 2005 Selections from a Feb 6, 1972, live audience BBC recording (same band) (Ray is 25 years old in these recordings) Hank Levy - (Ray Brown is one of the jazz soloists) on YouTube on YouTube on YouTube on YouTube The Four Freshmen: Live at Butler University, with Stan Kenton and his Orchestra, Creative World Inc. (2 LPs, quadraphonic), 1972; re-released by GNP Crescendo Records (CDs), 1986\n\nLive at Butler University, National Anthems Of The World , Creative World Inc. (2 LPs, quadraphonic), 1972\n\n, Creative World Inc. (2 LPs, quadraphonic), 1972 Clearwater 72 (recorded at the Fort Harrison Hotel, Clearwater, FL, Mar 1972), Hitchcock Media (1 CD), 2002\n\n(recorded at the Fort Harrison Hotel, Clearwater, FL, Mar 1972), Hitchcock Media (1 CD), 2002 Rhapsody in Blue (Live, Las Vegas), 1972\n\nArrangement recorded by the Stan Kenton Orchestra\n\nKenton For Collectors Vol. 3 (recorded live, Towson State University, July 27, 1976), Dynaflow (CD) (released October 16, 2007) \"Angel Eyes\", by Matt Dennis & Tom Adair, arr Ray Brown\n\nAs a member of the Full Faith & Credit Big Band\n\nDebut, Palo Alto Records, 1980 (Ray Brown conducts, arranges, and plays flugelhorn); OCLC 9913785\n\nPalo Alto Records, 1980 (Ray Brown conducts, arranges, and plays flugelhorn); OCLC 9913785 JazzFaire, with Madeline Eastman, Palo Alto Records (LP), 1983 (Ray Brown conducts, arranges, and plays flugelhorn); OCLC 30325285 \"Hop, Skip & a Jump\", arr Ray Brown \"Like Someone in Love\", arr Ray Brown \"I remember Clifford\", arr Ray Brown \"Barbara\", arr Ray Brown \"A Time for Love\", arr Ray Brown \"Can't Handle It\", arr Ray Brown FF&C III, Sea Breeze (1 LP), 1988; re-released (1 CD) by Sea Breeze, 1994\n\nAs leader of Ray Brown's Great Big Band\n\nOther recordings\n\nRay Brown & Steve Brown: An introduction to jazz improvisation: a basic method of study for all musicians, Piedmont Music Co., Melville, NY (LP), 1975\n\nPiedmont Music Co., Melville, NY (LP), 1975 Gary Bartz: Music is My Sanctuary , 1975\n\n, 1975 Los Angeles City College Jazz Band , 1981 (Ray Brown arranges Is There Anything Still There? )\n\n, 1981 (Ray Brown arranges ) Grover Mitchell: Butter Jazz Chronicles , 1978\n\n, 1978 Norman Connors: This is Your Life , late 1970s\n\n, late 1970s Ella Fitzgerald: A Classy Pair, Ella Fitzgerald Sings, Count Basie Plays, Pablo Records, 1979 The music on album is composed and arranged entirely by Ray Brown Frank Wess/Harry Edison Orchestra: Dear Mr. Basie (recorded live, Kan-i Hoken Hall, Tokyo, Nov 1989) Concord, 1989\n\n(recorded live, Kan-i Hoken Hall, Tokyo, Nov 1989) Concord, 1989 Ernestine Anderson, with the Clayton/Hamilton Orchestra: Boogie Down (recorded Aug 18, 1990) (1 CD), 1989\n\n(recorded Aug 18, 1990) (1 CD), 1989 Great Moments with Ernestine Anderson (1 CD) Concord Jazz, Nov 8, 1993 Recorded from 1976 to 1990, at Alley Cat Bistro, Culver City, CA; Coast Records, San Francisco; Concord Summer Festival, Concord Pavilion, Concord, CA; Fujitsu-Concord Jazz Festival, Tokyo; Mad Hatter Recording Studios, Los Angeles; Ocean Way Recording Studios, Hollywood, CA Michael Paulo: Fuse Box , (1 CD) GRP, 1990\n\n, (1 CD) GRP, 1990 Michael Paulo: Don't Let Go , (1 CD) GRP, 1990\n\n, (1 CD) GRP, 1990 Michael Paulo: Rainbow Room , (1 CD) GRP, 1990\n\n, (1 CD) GRP, 1990 Miles Davis & Michel Legrand: Dingo (film) (film soundtrack), 1990\n\n(film soundtrack), 1990 Buddy Collette: Live at El Camino College (recorded May 19, 1990, Torrance, CA), 1990\n\n(recorded May 19, 1990, Torrance, CA), 1990 Mel Torme: Sent for You Yesterday , Concord Jazz, 1990\n\n, Concord Jazz, 1990 David Benoit: Over the Edge (1 CD) GRP, 1991\n\n(1 CD) GRP, 1991 David Benoit: Still Standing (1 CD) GRP, 1991\n\n(1 CD) GRP, 1991 The Clayton-Hamilton Jazz Orchestra: Heart and Soul 1991\n\n1991 Child's Play , produced by Steve Brown, Cafe Records (1 CD), 1990\n\n, produced by Steve Brown, Cafe Records (1 CD), 1990 Kirk Whalum: Love Saw It , Columbia, 1993\n\n, Columbia, 1993 Kirk Whalum: The Language of Life , Columbia, 1993\n\n, Columbia, 1993 Landes Jugend Jazz Orchester Hessen: Magic Morning, (recorded in Cologne, Germany, Apr 30 - May 4, 1993) Ray Brown is an arranger of four pieces: \"For Heaven's Sake\", comp Donald Meyer, Elise Bretton, & Sherman Edwards, arr Ray Brown \"Die Autobahn 500\", arr Ray Brown \"Magic Morning\", comp by Dan Haerle, arr Ray Brown Rickey Woodard: Yazoo City Blues , ( 1 CD) Concord, 1994\n\n, ( 1 CD) Concord, 1994 Roy Hargrove With Strings: \"Moment to Moment\", Verve (CD), 2000 (Ray Brown, conductor)\n\nLive Recording from the Monterey Jazz Festival (recorded Sept. 21, 2002) (private recording, Monterey Jazz Festival tapes held by Stanford University) with Charlie Haden, Michael Brecker, & Kenny Barron a. \"The Night\" (composer/arranger unknown) b. \"American Dreams\" (Charlie Haden) c. \"Trends\" (composer/arranger unknown) (possibly titled Travels by Pat Metheny & Lyle Mays) d. \"Prism\" (Keith Jarrett) e. \"No Lonely Nights\" (Keith Jarrett) f. \"Ron's Place\" (Brad Mehldau) g. \"Nightfall\" (Charlie Haden) h. \"Bird Food\" (Ornette Coleman) i. \"America the Beautiful\" (Samuel A. Ward, Katharine Lee Bates) Ray Brown (Raymond Harry Brown) conducts the Festival Orchestra on b, e, f, & i\n\n\n\n\n\nOther published works\n\nAn Introduction to Jazz Improvisation, by Ray Brown and Steve Brown, Piedmont Music (1975); OCLC 22326461\n\nSelected film- and videoography\n\nThe Music of Stan Kenton (film for television) (note: 1969 is the date given in some resources,\n\nProduction director: Stanley Dorfman\n\n\"Malaga\", arr Bill Holman \"Intermission Riff\", by Steve Graham, Ray Wetzel \"MacArthur Park\", by Jimmy Webb\n\nMike Vax, Dennis Noday, Jay Saunders, Ray Brown, Joe Marcinkiewicz, trumpet; Dick Shearer, Mike Jamieson, Fred Carter, Mike Wallace, Phil Herring, trombone; Quin Davis, Richard Torres, Kim Frizell, Willie Maiden, Chuck Carter, reeds; Stan Kenton, piano; John Worster, acoustic double bass; John Von Ohlen, drums; Ramon Lopez, Latin percussion\n\nFestival de Jazz de Montreux, Switzerland 1979 (film for television)\n\nCount Basie and his Orchestra: Sonny Cohn, Pete Minger, Ray Brown, Nolan Smith (aka Nolan Shaheed), trumpet, fluegel horn; Melvin Wanzo, Booty Wood, Dennis Wilson, trombone; Bill Hughes, bass trombone; Bobby Plater, Danny Turner, Eric Dixon, Kenny Hing, reeds; Charlie Fowlkes, baritone sax; Count Basie, Paul Smith, piano; Freddie Green, guitar; John Clayton, acoustic double bass; Butch Miles, drums; Ella Fitzgerald, Dennis Roland, vocal\n\nSwing Shift, 1984 film (USA)\n\nMusic by: Patrick Williams; music orchestrated by: Billy May, Michael Moores, Jack Hayes; soundtrack personnel: Conte Candoli, Bob Findley, Dick Hurwitz, Ray Brown, Bill Berry, trumpet; Alan Kaplan, George Bohanon, Buster Cooper, trombone; Marshal Royal, Lanny Morgan, alto sax; Pete Christlieb, Bill Green, tenor sax; Jimmy Rowles, piano; John Pisano, guitar; Monty Budwig, acoustic double bass; Frank Capp, drums\n\nA Tribute to Count Basie, filmed at Kan-i Hoken Hall, Tokyo, November 11, 1989 (film for television)\n\nPersonnel: Harry \"Sweets\" Edison, Joe Newman, Snooky Young, Al Aarons, Ray Brown, trumpet; Al Grey, Benny Powell, Grover Mitchell, Michael Grey, trombone; Marshal Royal, Curtis Peagler, alto sax; Frank Wess, tenor sax, flute; Billy Mitchell, tenor sax; Bill Ramsay, baritone sax; Ronnell Bright, piano; Ted Dunbar, guitar; Eddie Jones, acoustic double bass; Gregg Fields, drums.\n\nFujitsu Concord Jazz Festival, filmed at Kan-i Hoken Hall, Japan, November 11, 1990 (film for television)\n\nPersonnel: Ray Brown, Pete Minger, Joe Newman, Snooky Young, trumpet; Arthur Baron, Grover Mitchell, Dennis Wilson, Douglas Purviance, trombone; Bill Ramsay, Curtis Peagler, alto sax; Frank Wess, tenor sax, flute; Billy Mitchell, tenor sax; Babe Clarke, baritone sax; Tee Curson, piano; Ted Dunbar, guitar; Eddie Jones, acoustic double bass; Dennis Mackrel, drums, Mel Torme, vocal, drums.\n\n^\n\nHonors and awards\n\nIthaca College School of Music\n\nBrown family who studied at the Ithaca College School of Music: As part of the Ithaca College School of Music expansion (2001), a chamber jazz room was added as a gift from Steve McCluski ’74 and Kim Joslyn McCluski ’74 in honor of the Brown family. A plaque there honors seven members of the Brown family who graduated from Ithaca College: 1) Glenn Brown (1914 – 1965) — Ithaca College School of Music (IC) 1936 (Ray's father) 2) Marie Brown (née Ward; 1916 – 2002) — IC 1935 (Ray's mother) 3) Stephen Charles Brown — Ithaca College (IC) Bachelor of Music 1964; Master of Music 1968 (Ray's second oldest brother) 4) Barbara Katz Brown — IC 1974; 1975 (Steve's wife) 5) Ray Brown — IC 1968 6) Sue Brown — IC 1971 (Ray's wife) 7) Glenn Edward Brown — IC 1959 (Ray's oldest brother)\n\n14th Annual Gail Rich Awards — Cultural Council Associates (of the Santa Cruz County arts community) (Jan 26, 2010)\n\nRay and Sue Brown were two of seven being honored — they were being honored for their creative work as music teachers"}, {"url": "https://www.ancestry.com/cs/1940-census", "page_content": "What was happening in the U.S. in 1940?\n\nFrom sea to shining sea—and beyond—we’ve found interesting and surprising facts about\n\nthe states and territories from the 1940s era. Click on a location to learn more.\n\n\n\n\n\n\n\n\n\n\n\n\n\nCT\n\nD.C.\n\nDE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMA\n\nMD\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNJ\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRI\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGUAM, SAMOA, PANAMA CANAL ZONE\n\nPUERTO RICO, U.S. VIRGIN ISLANDS\n\nLet our experts at Ancestry help you find your family in the 1940 U.S. Census. Watch now"}, {"url": "https://www.archives.gov/research/african-americans/migrations/great-migration", "page_content": "The Great Migration was one of the largest movements of people in United States history. Approximately six million Black people moved from the American South to Northern, Midwestern, and Western states roughly from the 1910s until the 1970s. The driving force behind the mass movement was to escape racial violence, pursue economic and educational opportunities, and obtain freedom from the oppression of Jim Crow.\n\nThe Great Migration is often broken into two phases, coinciding with the participation and effects of the United States in both World Wars. The First Great Migration (1910-1940) had Black southerners relocate to northern and midwestern cities including: New York, Chicago, Detroit, and Pittsburgh. When the war effort ramped up in 1917, more able bodied men were sent off to Europe to fight leaving their industrial jobs vacant. The labor supply was further strained with a decline in immigration from Europe and standing bans on peoples of color from other parts of the world. All of this afforded the opportunity for the Black population to be the labor supply in non-agricultural industries.\n\nAlthough the migrants found better jobs and fled the South entrenched in Jim Crow, many African Americans faced injustices and difficulties after migrating. The Red Summer of 1919 was rooted in tensions and prejudice that arose from white people having to adjust to the demographic changes in their local communities. From World War I until World War II, it is estimated that about 2 million Black people left the South for other parts of the country.\n\nWorld War II brought an expansion to the nation’s defense industry and many more jobs for African Americans in other locales, again encouraging a massive migration that was active until the 1970s. During this period, more people moved North, and further west to California's major cities including Oakland, Los Angeles, and San Francisco, as well as Portland, Oregon and Seattle, Washington. Within twenty years of World War II, a further 3 million Black people migrated throughout the United States."}, {"url": "https://www.loc.gov/exhibits/civil-rights-act/world-war-ii-and-post-war.html", "page_content": "In the spring of 1941, hundreds of thousands of whites were employed in industries mobilizing for the possible entry of the United States into World War II. Black labor leader A. Philip Randolph threatened a mass march on Washington unless blacks were hired equally for those jobs, stating: “It is time to wake up Washington as it has never been shocked before.” To prevent the march, which many feared would result in race riots and international embarrassment, President Franklin Roosevelt issued an executive order that banned discrimination in defense industries. His Executive Order 8802, June 25, 1941, established the Committee on Fair Employment Practices (known as FEPC) to receive and investigate discrimination complaints and take appropriate steps to redress valid grievances.\n\nThe fight against fascism during World War II brought to the forefront the contradictions between America’s ideals of democracy and equality and its treatment of racial minorities. Throughout the war, the NAACP and other civil rights organizations worked to end discrimination in the armed forces. During this time African Americans became more assertive in their demands for equality in civilian life as well. The Congress of Racial Equality (CORE), an interracial organization founded to seek change through nonviolent means, conducted the first sit-ins to challenge the South’s Jim Crow laws.\n\nAfter the war, and with the onset of the Cold War, segregation and inequality within the U.S. were brought into sharp focus on the world stage, prompting federal and judicial action. President Harry Truman appointed a special committee to investigate racial conditions that detailed a civil rights agenda in its report, To Secure These Rights. Truman later issued an executive order that abolished racial discrimination in the military. The NAACP won important Supreme Court victories and mobilized a mass lobby of organizations to press Congress to pass civil rights legislation. African Americans achieved notable firsts—Jackie Robinson broke the color barrier in major league baseball, and civil rights activists Bayard Rustin and George Houser led black and white riders on a “Journey of Reconciliation” to challenge racial segregation on interstate buses.\n\nSee timeline for this period"}, {"url": "https://alchetron.com/Raymond-Harry-Brown", "page_content": "Raymond Harry \"Ray\" Brown (born November 7, 1946) is an American composer, arranger, trumpet player, and jazz educator. He has performed as trumpet player and arranged music for Stan Kenton (early 1970s), Bill Watrous, Bill Berry, Frank Capp – Nat Pierce (Juggernaut Big Band), and the Full Faith and Credit Big Band.\n\nContents\n\nBrown joined Kenton in September 1971, succeeding Gary Lee Pack [b. 1950; Director of Jazz Studies (retired), University of Southern Maine], holding the jazz trumpet chair and serving as an improv clinician. The Kenton trumpet section included Mike Vax, Jay Saunders, and Dennis Noday. Brown also contributed arrangements for Kenton, including \"Mi Burrito\" and \"Neverbird.\" Brown remained with the Kenton Orchestra until November 1972.\n\nBefore joining the Kenton Orchestra, Brown had served as arranger and trumpeter with the Studio Band of The United States Army Field Band at Fort Meade, Maryland (1968–71). His tenure with the Army Band and Kenton coincided closely with that of Jay Saunders — trumpet player, and jazz educator, who, while with the Kenton Orchestra, eventually played lead trumpet.\n\nBrown also has performed with Mundell Lowe, Leroy Vinnegar, Ray Brown, Thad Jones, Jimmy Heath, Steve Gadd, and Billy Hart.\n\nBrown conducted the recording session of the Roy Hargrove Quintet entitled Roy Hargrove with Strings, Moment to Moment, released May 2000 on Verve. He has appeared at the Monterey Jazz Festival frequently as conductor of his wife Susan Cahill Brown's Monterey Jazz Festival Chamber Orchestra in collaboration with Charlie Haden, Kenny Barron, Michael Brecker, Ralph Towner, Gary Burton, and Terence Blanchard.\n\nBrown currently leads his own big band, the Great Big Band, which has performed at the Monterey Jazz Festival, the San Jose Jazz Festival, the Santa Cruz Jazz Festival, the Lake Tahoe Music Festival, and jazz venues in the San Francisco Bay area.\n\nRay is currently on the faculty of Cabrillo College in Aptos, California, teaching jazz improvisation, arranging, and jazz ensembles."}, {"url": "https://www.blackpast.org/african-american-history/raymond-aloysius-brown-1915-2009/", "page_content": "Raymond A. Brown, a prominent civil rights activist, attorney, and military officer was born on May 6, 1915 in Fernandina Beach, Florida. His mother, Elizabeth Christopher Traeye, was a domestic, teacher and homemaker who in 1930 helped establish Christ the King, Jersey City’s only Black Catholic church. Brown’s father, Miller, was the first Black bus mechanic employed at the Public Service Bus Company in Jersey City.\n\nThe Browns moved to Jersey City in 1917 where Raymond graduated from Lincoln High School and joined the segregated Civilian Conservation Corps fighting forest fires in Montana’s Kootenai National Forest. As a history major at Florida A&M College, Brown wrote humor for the FAMCEAN newspaper, participated in a 1937 campus protest, and played football under legendary coach Jake Gaither before graduating in 1938.\n\nBrown returned to Jersey City and worked as a bellhop at Journal Square’s Plaza Hotel, shipping clerk, FDIC messenger, cab driver and dockworker while enrolled in the night program at Fordham University law school. Drafted in the segregated US Army Quartermaster Corps in 1942, he challenged segregated practices in the south during World War II and served overseas.\n\nUpon discharge, Brown lived at the Jersey City Booker T. Washington housing complex and joined the all-Black New Jersey Army National Guard 372nd AAA Group under Colonel Leon G. Brown. He rose in the ranks to become a full colonel and Judge Advocate General, retiring in 1975. After graduating from Fordham in 1948, Brown worked for Raymond Chasan, a white Jewish lawyer who was a member of the Jersey City NAACP. While there, Brown was admitted to the Bar in 1949.\n\nAt the behest of the NAACP Legal Defense Fund’s Barbara A. Morris and Robert L. Carter, Brown represented defendants in Georgia, Alabama, Mississippi, and Texas. He helped quell the 1964 Jersey City rebellion, the 1967 Newark and Plainfield uprisings, and the 1971 Rahway prison revolt. As president of the Jersey City NAACP (1959-1966), he helped desegregate public schools, took five busloads to the March on Washington, and joined Dr. Martin Luther King Jr. in Selma.\n\nHis clients included Black Liberation Army activist Assata Shakur, poet Amiri Baraka, SNCC chairman H. Rap Brown, pugilist Rubin “Hurricane” Carter, jazz legend Sarah Vaughn, Jersey City Black Panthers Isaiah Rowley, Victor Perez and Charles Hicks, Student Afro Society members during the 1968 Columbia University protests, Kawaida Towers, and the Congress of African People. He also assisted with the 1967 Black Power Conference, the 1969 Committee for Unified Newark’s Black and Puerto Rican Convention, and attended the 1972 National Black Political Convention in Gary, Indiana.\n\nFor nearly 60 years, Black lawyers were inspired by Brown’s commitment, work ethic, and courtroom presence. Raymond A. Brown died at 94 on October 9, 2009 of chronic obstructive pulmonary disease. He was survived by his second wife, Dr. Jennie Davis Brown, and children, Dr. Deborah E. Brown Bowles, attorney Raymond M. Brown, Denise Howell Randall, and Clifton Howell. His first wife Elaine Camilla Williams Brown died in 1968."}, {"url": "https://art.state.gov/personnel/harry_henry/", "page_content": "Harry Raymond Henry (1882-1973)\n\nHarry Raymond Henry was born in Woodson, Illinois on March 21, 1882. Henry was raised in the Midwest and apprenticed to a draftsman while in his teens. At the turn of the century he began art training at the Art Institute of Chicago and St Louis Academy and had further training under John C. Johansen at Saugatuck, Michigan. He then had a studio in New York City until 1910 when he moved to southern California and first exhibited in Los Angeles. The 1920s were spent in San Juan Capistrano where he maintained a studio in an old adobe. After moving to Hollywood in 1929, Henry was an art critic for Citizens News. In the mid-1940s he moved to a home in Three Arch Bay south of Laguna Beach and continued to paint until his eyesight failed in the mid-1960s. He died in Costa Mesa, CA on May 16, 1974. Using a Pointillist style with a rich palette of blues, reds and lavenders, Henry painted poetic landscapes of southern California.\n\nExhibited: Royar Gallery (LA), 1915; Old Adobe Gallery (Capistrano), 1926; Ainslie Gallery (LA), 1928; Gump’s (SF), 1929 (solo); California State Fair, 1930; Los Angeles County Museum, 1932; Laguna Beach Art Association; Tuesday Morning Club (LA), 1936; Nash Gallery (LA), 1938; California Palace of the Legion of Honor, 1947.\n\nhttp://www.sternfinearts.com/harahe1.html"}, {"url": "https://www.britannica.com/biography/Ray-Brown", "page_content": "Ray Brown, byname of Raymond Matthews Brown, (born October 13, 1926, Pittsburgh, Pennsylvania, U.S.—died July 2, 2002, Indianapolis, Indiana), American string bassist and one of the greatest of all jazz virtuosos.\n\nBrown first made his mark at age 19 when he went to New York City to join Dizzy Gillespie’s band at a time when the modern jazz revolution, spearheaded by saxophonist Charlie Parker, was just getting under way. Brown began reaching wider audiences in the late 1940s when he started working with singer Ella Fitzgerald (the couple married in 1947 and divorced in 1952), and from 1951 to 1966 he was a member of the Oscar Peterson Trio, considered by many to be the finest small group in jazz history. Beginning in 1952 he was a frequent performer on Norman Granz’s popular Jazz at the Philharmonic concert tours. Brown’s playing was characterized by magnificent tonal resonance, extremely subtle grasp of harmony, and astonishing technique.\n\nAfter leaving Peterson’s trio in 1966, Brown settled in California, where he became a freelance and studio musician. He played on more than 2,000 recordings and worked with such musicians as Duke Ellington, Louis Armstrong, and Frank Sinatra. Brown continued to perform until his death."}, {"url": "https://www.federalreservehistory.org/essays/employment-act-of-1946", "page_content": "At the conclusion of World War II, with hundreds of thousands of American soldiers returning home, a large share of the workforce concerned about finding jobs as the economy transitioned from the production of wartime goods, and the specter of the Great Depression fresh in the minds of nearly all, Congress passed the Employment Act of 1946. At the heart of the act was its “Declaration of Policy”:\n\nThe Congress hereby declares that it is the continuing policy and responsibility of the federal government to use all practicable means consistent with its needs and obligations and other essential considerations of national policy with the assistance and cooperation of industry, agriculture, labor, and state and local governments, to coordinate and utilize all its plans, functions, and resources for the purpose of creating and maintaining, in a manner calculated to foster and promote free and competitive enterprise and the general welfare, conditions under which there will be afforded useful employment for those able, willing, and seeking work, and to promote maximum employment, production, and purchasing power.1\n\nThe act was the product of numerous revisions to what was originally introduced as the Full Employment Bill of 1945. It had declared:\n\nAll Americans able to work and seeking work have the right to useful, remunerative, regular, and full-time employment, and it is the policy of the United States to assure the existence at all times of sufficient employment opportunities to enable all Americans who have finished their schooling and who do not have full-time housekeeping responsibilities to freely exercise this right.2\n\nConspicuous in the final bill is the removal of the claim that citizens have a “right” to a job; so, too, is the acknowledgment of the importance of maintaining purchasing power — that is, the need to keep inflation in check. Stephen Kemp Bailey has attributed such changes, in large measure, to opposition among certain members of the House of Representatives who viewed the original bill as too radical and wished to produce a substitute that would “exclude the last remnants of … dangerous federal commitments and assurances (including the wording of the title), but would provide for an economic planning mechanism of some sort in the Executive and legislative branches, and for a moderate program of public works” (Bailey 1950, 165).\n\nThe Employment Act of 1946 created the Council of Economic Advisers (CEA), a three-member board that advises the president on economic policy; required the president to submit a report to Congress within ten days of the submission of the federal budget that forecasts the future state of the economy and presents the administration’s domestic and international economic priorities; and established the Joint Economic Committee – composed of members of both political parties from both the House and Senate – that is charged with, among other things, reviewing the president’s report and making recommendations to the Senate and House on economic policy.\n\nWhile the 1946 act did not prescribe any specific actions, federal economic policy generally has conformed to the spirit of its language, argues Murray Weidenbaum, an economist at Washington University in St. Louis who served as chairman of the CEA during the early 1980s. He has written:\n\nViewed in the most fundamental light … the legislation has been successful: the act’s then-controversial statement of national policy has become adopted as part of the federal government’s bureaucratic fabric and the two new institutions the 1946 act established are still in operation. A substantial government responsibility for the overall performance of the economy is widely presumed (Weidenbaum 1996, 880).\n\nDuring the three decades immediately following the passage of the 1946 act, the American economy generally performed quite well. While there was significant inflation in the last half of the 1940s, annual inflation rates typically ranged from 1 percent to 5 percent during the rest of this period. The labor market also was relatively strong, with annual unemployment rates trending around 5 percent. But during the 1970s, the United States experienced high inflation and unemployment, often referred to as “stagflation.” In early 1975, worsening economic conditions prompted Congress to adopt Resolution 133, which instructed the Federal Reserve to:\n\npursue policies in the first half of 1975 so as to encourage lower long term interest rates and expansion in the money and credit aggregates appropriate to facilitating prompt economic recovery; and maintain long run growth of the monetary and credit aggregates commensurate with the economy’s long run potential to increase production, so as to promote effectively the goals of maximum employment, stable prices, and moderate long term interest rates.3\n\nIn 1977, Congress amended the Federal Reserve Act to incorporate the provisions of Resolution 133, but only after debating more ambitious proposals.\n\nIn 1978, Congress passed the Full Employment and Balanced Growth Act, better known as the Humphrey-Hawkins Act, which amended the Employment Act of 1946 and was signed into law by President Carter. The Humphrey-Hawkins Act specified explicit unemployment and inflation goals. Within five years, unemployment should not exceed 3 percent for people 20 years or older, and inflation should be reduced to 3 percent or less, provided that its reduction would not interfere with the employment goal. And by 1988, the inflation rate should be zero, again provided that pursuing this goal would not interfere with the employment goal.4\n\nCongress could not simply mandate such unemployment and inflation rates; it could set them only as targets. Still, the act did call for, as needed, “expansion of private employment through Federal assistance” as well as “expansion of public employment.” It also included an eight-point agenda for maintaining price stability, including “the establishment of stockpiles of agricultural commodities and other critical materials to help stabilize prices, meet emergency needs, and promote adequate income to producers.” But, like the bill it amended, the final version of the Humphrey-Hawkins Act was considerably less interventionist than what was initially proposed. Earlier versions of the bill came quite close to stating that all Americans had a right to a job, just as the Full Employment Bill of 1945 had (Santoni 1986)."}]}