{"George Roll began his career in the food industry in the late 1980s.": [{"url": "https://www.restaurantbusinessonline.com/special-reports/timeline-how-todays-restaurant-industry-came-be", "page_content": "1920s | 1930s | 1940s |1950s | 1960s | 1970s | 1980s | 1990s | 2000s | 2010s\n\n1900-1920: A period of rampant immigration introduces new cultures and cuisines to the United States. By the second decade of the century, some 4 million people had come from Italy alone, bringing with them the foods and cooking styles of their homeland.\n\n1918: “The War to End All Wars,” aka World War I, ends with Germany’s defeat and the emergence of the United States on the world stage.\n\n1919: The National Prohibition Act, outlawing most adult beverages, is passed. It would remain in place until 1933.\n\n1919: Roy Allen uses a root beer recipe he bought from a pharmacist and sells the brew for a nickel a glass; three years later, he and partner Frank Wright begin A&W Root Beer.\n\n1919: Restaurateurs form The National Restaurant Association in Kansas City, MO, to deal with issues of rationing, price gouging, unions and Prohibition.\n\n1921: The first White Castle restaurant opens in Wichita, KS. The “white” was chosen to signify purity, and the “castle” to indicate permanence and strength.\n\n1921: The Pig Stand, one of the first “drive-ins,” opens in the Dallas-Fort Worth area.\n\n1923: Merritt J. Osborn starts the Economics Laboratory company with a product to clean hotel carpeting. His mission to provide customers with “economic” solutions developed through “laboratory” research is the beginning of Ecolab.\n\n1924: Caesar Cardini concocts the salad that will become a restaurant staple named after him: the Caesar Salad.\n\n1924: Twenty-two local restaurant associations collaborate with the National Restaurant Association on issues of importance to the business. Most would become today’s state restaurant associations.\n\n1926: The Palm Restaurant (originally called The Parma but misspelled by a license clerk) opens in NYC. It would close, in a different location, in 2015, though spinoffs remain open today.\n\n1926: The Charleston hits its peak as a dance craze. The provocative gyrations were seen as a way of mocking the proponents of Prohibition.\n\n1927: J. Willard Marriott, a Utah transplant living in Washington, D.C., uses $3,000 to open an A&W franchise in the district.\n\n1928: Sliced bread is invented.\n\n1929: The U.S. stock market crashes and the Great Depression sets in.\n\n1932: The Krystal hamburger chain opens its doors in Chattanooga, Tenn., its name purposely misspelled with a “K” to snag attention.\n\n1933: Prohibition ends, giving a boost to fine-dining restaurants and supper clubs such as The Pump Room in Chicago and The Rainbow Room in New York City. “21,” a well-known New York City speakeasy, can now operate legally.\n\n1935: Beer is sold in cans for the first time.\n\n1935: A New England ice cream seller named Howard Johnson hits on the idea of letting other restaurant operators use his business’ name for a fee. Restaurant franchising is born.\n\n1935: Duncan Hines, a traveling salesman from Kentucky, publishes “Adventures in Good Eating,” believed to be the first nationwide restaurant guide.\n\n1936: The 40-hour work week is mandated by Congress.\n\n1936: Robert Wian opens a hamburger stand in California. The following year he comes up with a double-decker burger and a mascot for his business, and Bob’s Big Boy is born.\n\n1937: Victor Bergeron opens Trader Vic’s in San Francisco. His exotic cocktails, adorned with miniature umbrellas, foreshadowed today’s mixology.\n\n1937: Vernon Rudolph opens the Krispy Kreme doughnut shop in Winston-Salem, N.C.\n\n1938: At age 19, Bill Darden opens his first restaurant, The Green Frog, which promises “Service with a Hop.” He would go on to develop a bargain-priced full-service seafood concept, Red Lobster, which would be the foundation for the company that bears his name, Olive Garden parent Darden Restaurants (it sold Red Lobster in 2014).\n\n1939: President Franklin D. Roosevelt serves Nathan’s Hot Dogs to the King and Queen of England during their visit to the U.S.\n\n1939: The New York World’s Fair features innovative cuisine from nearly 60 countries, giving many Americans their first exposure to exotic ethnic foods.\n\n1940: A veteran dairyman who respected cows as the queens of the business opens a shop in Joliet, Ill. J.F. McCullough calls his brainchild Dairy Queen.\n\n1941: An entrepreneur scrapes together the money to open a hot dog cart in Southern California. That enterprise from Carl Karcher would become the Carl’s Jr. burger chain.\n\n1941: Japan bombs Pearl Harbor, pulling the U.S. into World War II.\n\n1941: Regular TV broadcasting begins in the U.S.\n\n1943: Wartime rationing comes to restaurants. Restaurants are allowed to use 1 pound of coffee for every 100 meals and 1 pound of sugar for every 33 customers.\n\n1943: Ike Sewell and business partner Ric Riccardo open a restaurant in Chicago called Pizzeria Uno, introducing the nation to deep-dish pizza.\n\n1945: World War II ends, leaving a much-changed world. A war-weary U.S. settles into a post-war period focused on family, financial security and creature comforts, including a new thing called television. A massive shift of the population from city to suburbs reshapes the nation.\n\n1946: Frances Roth and Katharine Angell establish the New Haven Restaurant Institute to train returning military veterans to become chefs. It would move to Hyde Park, N.Y., and become the Culinary Institute of America.\n\n1948: Harry Snyder and his wife, Esther, open a drive-thru restaurant featuring burgers, fries and little else. He names the California outpost In-N-Out Burger.\n\n1950: Dunkin' Donuts is founded by Bostonian Bill Rosenberg, whose business plan is simple: \"Make and serve the freshest, most delicious coffee and donuts quickly and courteously.” He would begin to franchise the concept, making it a pioneer of the development strategy that would change the industry a decade later.\n\n1952: The first sugar-free soft drink, No-Cal, is introduced as a specialty beverage for diabetics. It was initially available only as a ginger ale.\n\n1953: The first McDonald’s featuring “golden arches” architecture opens, in Phoenix.\n\n1953: Burton Baskin and Irvine Robbins combine their California ice cream shops to form Baskin-Robbins. From the beginning, pink spoons were offered to let people sample any flavor.\n\n1954: A milkshake blender salesman named Ray Kroc visits his star customers, Dick and Mac McDonald, to see why they were buying so many of his machines. He finds a glass-walled drive-up place that can sell hamburgers for 15 cents, or roughly half the prevailing rate, because of its batch-cooking system and operational procedures. Kroc realizes he’s witnessing a breakthrough and pursues a collaboration.\n\n1954: Jim McLamore and Dave Edgerton decide to open a new burger concept, differentiating it from the pack by broiling the patties over open flames. Burger King is born.\n\n1954: Southern Californian Glenn Bell sees an unoccupied niche in his native area’s booming fast-food industry and decides to open Taco Tia, a restaurant featuring a Mexican street-food staple in a crunch taco shell. He would later change the name to Taco Bell.\n\n1955: Disneyland, a theme park dedicated to fairy tales and Disney characters, opens in Anaheim, Calif.\n\n1955: Waffle House is founded.\n\n1959: Gennaro and Carmela Sbarro open an Italian grocery store in Brooklyn, N.Y. Out of that retail base would come a pizza and pasta restaurant chain called Sbarro.\n\n1960: The National Restaurant Association moves its annual convention in Chicago to McCormick Place, drawing 50,000 attendees.\n\n1960: Thad Eure Jr. and Charles Winston turn a red barn in North Carolina into a restaurant with an emphasis on hospitality and strong value for families. The Angus Barn would become one of the nation’s highest-grossing establishments and a driver of fine dining’s “casualization.”\n\n1961: The first astronaut orbits the earth.\n\n1962: The first model food and sanitation code is drafted, with input from the National Restaurant Association.\n\n1964: Harland Sanders sells his Kentucky Fried Chicken restaurants to John Y. Brown and Jack Massey, with the deal entitling Sanders to an annual salary for life for serving as company spokesperson.\n\n1965: Ronald McDonald makes his debut on television. He would become the chain’s official spokesman a year later.\n\n1965: Alan Stillman notices the young partiers flocking to bars in New York City, and figures he’d try something geared specifically to those single professionals prowling for fun. He opens a quirky place called TGI Fridays, the first of what would initially be called fern bars, and then casual-dining chains.\n\n1966: A young, charismatic entrepreneur sees a gap in the restaurant mix of Dallas: Young families and singles in the 25-to-44 age bracket had to choose between fast food and the sedate full-service restaurants frequented by their parents. Norman Brinker decided to sandwich something in between. He called it Steak and Ale, inspired by the hit movie “Tom Jones,” and featured steak and other upscale choices at prices young people could afford.\n\n1969: Jack in the Box introduces a breakfast sandwich, believed to be the first offered by a quick-service chain.\n\n1969: After selling off his Kentucky Fried Chicken franchises, bored Midwesterner Dave Thomas decides to enter into the quick-service sector’s biggest market, burgers. Although that arena is already packed, Thomas hatches the idea for a new type of place, featuring burgers made with fresh meat, baked potatoes and chili. He names it Wendy’s, after his daughter.\n\n1969: Based on a school project, the Victoria Station chain is launched by three graduates of the Cornell Hotel School. To lower opening costs, the restaurants were converted from railway boxcars. They featured prime rib at a bargain price and the restaurants quickly became a hit in the 1970s—but the business model ultimately proved unsustainable.\n\n1969: John Baugh, a small food distributor in Houston, convinces eight other distributors to join forces and create a national distribution network called Sysco. Sales that year were $115 million; estimates for sales in 2012 topped $42 billion.\n\n1971: A Chicago entrepreneur named Rich Melman opens a restaurant featuring a salad bar consisting of some 40 items. R.J. Grunts would become a hit, and Melman would go on to build Lettuce Entertain You Enterprises, the model multiconcept restaurant operation, or a collection of concepts varying in format and name.\n\n1971: The first Starbucks opens in Seattle’s Pike Place Market, with its name taken from a character in Herman Melville’s “Moby Dick.”\n\n1971: The Center for Science in the Public Interest, a consumer advocacy organization, is formed in Washington, D.C.; the following year, its founder, Michael Jacobson, popularizes the term “junk food.”\n\n1973: Johnson & Wales University in Providence, R.I., introduces what would become its College of Culinary Arts and begins offering an associate degree in that field.\n\n1973: McDonald’s introduces the Egg McMuffin, an idea hatched by a franchisee.\n\n1973: The first Golden Corral opens in Fayetteville, NC.., offering its now famous “endless buffet” of comfort food items.\n\n1974: The first personal computer is manufactured.\n\n1974: Burger King’s game-changing “Have It Your Way” marketing campaign is launched, introducing customization as a major point of differentiation.\n\n1974: The first Ronald McDonald House, providing comfy lodgings for families seeking care for an ill child far from home, opens in Philadelphia. It is funded by sales of the chain’s Shamrock Shake.\n\n1974: The Brennan family takes over New Orleans’ iconic Commander’s Palace Restaurant, updating both the exterior and its acclaimed kitchen.\n\n1975: McDonald’s’ Hamburger University training facility opens, offering would-be managers a degree in hamburgerology and a minor in french fries. The college campus-like facility would be much copied by competitors.\n\n1976: Windows on the World, the brainchild of New York City restaurant creators Joe Baum and Michael Whiteman, opens on the 107th floor of the World Trade Center.\n\n1977: Denny’s introduces its signature Grand Slam Breakfast to honor baseball great and home-run record breaker Hank Aaron.\n\n1977: Fresh from creating Atari, game inventor Nolan Bushnell creates the first Chuck E. Cheese’s Pizza Time Theatre in San Jose, Calif.\n\n1978: McDonald’s launches kid-sized portions paired with toys and calls them Happy Meals.\n\n1979: Paul Prudhomme opens K-Paul’s restaurant in New Orleans, sparking a renaissance in Cajun cooking and heightened interest in American cuisine.\n\n1979: The National Restaurant Association relocates its headquarters and most operations to Washington, D.C., a reflection of its greater involvement in public advocacy.\n\n1980: McDonald’s offers a new dish of “chopped chicken meat, mechanically compressed and factory shaped” known as the Chicken McNugget.\n\n1982: During a major snowstorm in Atlanta, George McKerrow places a sign in the window of his year-old LongHorn Steakhouse, promising “Drinks $1 While It Snows.” The place is packed for the three days of the storm. LongHorn takes off, helping to foster the herd of cowboy-themed steakhouses such as Lone Star, Texas Roadhouse and Logan’s Roadhouse.\n\n1982: A British magazine coins the term “foodie,” to describe a person “… for whom food became ... a hobby, pastime, and topic of discussion.”\n\n1983: Hooters opens its first restaurant.\n\n1985: Dairy Queen introduces a super-thick milkshake studded with mixed-in treats such as candies and crumbled cookies. The Blizzard would become one of the most successful new products of all time.\n\n1985: After watching crowds flock to Wolfgang Puck’s original Spago for so-called gourmet pizza, attorneys Rick Rosenfield and Larry Flax decide to adopt the notion for a new mass-market concept called California Pizza Kitchen.\n\n1985: Two men begin selling rotisserie chickens and sides in Newton, Mass., and call the business Boston Chicken; in 1995 they expand the offerings and change the name to Boston Market.\n\n1987: The original owners of Starbucks sell the brand to a former manager and supplier, Howard Schultz, who had his own coffee brand at the time, called Il Giornale. Schultz would convert his cafes into Starbucks outlets and expand the brand.\n\n1989: Drawn together for a story and photo slated to run in Restaurant Business, 14 prominent women in the foodservice industry decide there is a need to promote more diversity in the field. They form the Women’s Foodservice Forum to develop leadership talent and foster career advancement of executive women.\n\n1990: With backing from six major industry organizations, the National Restaurant Association launches the ServSafe program to foster voluntary food safety training. The course and certification process teaches restaurant professionals to safeguard their business by ensuring the safety of guests and employees.\n\n1990: McDonald’s opens its first unit in the Soviet Union and begins serving more than 50,000 people a day.\n\n1991: The last Horn & Hardart Automat closes in New York City.\n\n1991: Domino’s Pizza puts out a warning to franchisees that war is likely, based on record orders of pizza from the Pentagon the previous evening.\n\n1993: Steve Ells, a Culinary Institute of America grad and former line chef at Stars in San Francisco, opens the first Chipotle Mexican Grill.\n\n1993: TV Food Network, the first of what would be a flurry of cable and network TV programs devoted to cooking and celebrity chefs, airs its first broadcasts. Restaurateurs welcomed the attention brought to the industry by the interest-whetting onslaught of food programs, but they would rue the great knowledge of food amassed by viewers. It was harder to get any slack from customers.\n\n1995: Restaurant industry sales totaled more than $295 billion, up nearly sevenfold from sales of approximately $42 billion in 1970.\n\n1997: Tricon Global Restaurants is formed to manage three quick-service chains spun off from PepsiCo: Kentucky Fried Chicken, Pizza Hut and Taco Bell. The name would change in 2003 to Yum Brands.\n\n1998: Chuck Templeton founds OpenTable, allowing diners to make dinner reservations online.\n\n2001: Seventy-three employees of Windows on the World are among the victims of the 9/11 terrorist attacks\n\n2002: Burger King introduces its Value Menu of 11 items priced at 99 cents.\n\n2003: Darden Restaurants opens the first Seasons 52 restaurant, featuring seasonally inspired menu items and a wide array of wines. The concept is intended to be the next logical progression for consumers who had grown up on fast food, graduated to casual dining, and were looking for more healthful and sophisticated fare.\n\n2004: The administration of George W. Bush sounds what is believed to be the first viable call for voluntary menu labeling.\n\n2005: Hurricane Katrina devastates the dining mecca of New Orleans and surrounding areas.\n\n2006: Restaurant sales are forecast by the National Restaurant Association to pass the $500 billion mark.\n\n2006: Three out of four adults report they are trying to eat more healthfully in restaurants.\n\n2006: The three major soft drink companies agree to stop selling sweetened sodas in schools.\n\n2006: The New York City Board of Health votes to institute a ban on trans fat oils and shortenings in restaurants.\n\n2008: Three out of four full-service restaurants have a website.\n\n2009: A National Restaurant Association survey of American Culinary Federation chefs identifies the use of local produce as the restaurant industry’s No. 1 food trend.\n\n2009: Industry icon Norman Brinker, widely recognized as a father of casual dining, dies at age 78.\n\n2012: ServSafe issues its 5 millionth ServSafe certification.\n\n2012: Locke-Ober, the iconic watering hole of Boston politicians and Brahmins, closes after being in business since 1875. Other fine-dining graybeards similarly fire down their ovens, the victims of a shift in consumer preferences to more casual fare and settings.\n\n2012: Hurricane Sandy pummels New York and New Jersey, hurting thousands of restaurants and small businesses throughout the area. The National Oceanic and Atmospheric Administration (NOAA) estimates the damages at $65 billion.\n\n2013: The National Restaurant Association hosts the first annual Restaurant Innovation Summit, focusing on “customer engagement through emerging technology.”\n\n2013: Burger King introduces Satisfries, a lower-calorie, healthier french fry; less than a year later, the product is removed from all U.S. menus.\n\n2014: The U.S. Senate rejects legislation that would have raised the federal minimum wage from $7.25 to $10.10 an hour.\n\n2014: Burger King pays more than $11 billion to purchase iconic Canadian donut chain Tim Hortons.\n\n2014: The Food and Drug Administration releases its final menu labeling regulations, passed in 2010 as part of the Affordable Care Act.\n\n2014: California passes a law mandating paid sick leave for all employees who have worked for one employer for more than 30 days.\n\n2014: Seattle votes to increase its minimum wage to $15 an hour.\n\n2015: Restaurateur Danny Meyer, founder and CEO of Union Square Hospitality Group, announces that his restaurants will phase out tipping in an attempt to “… address a system that is broken and that is not sustainable.”\n\n2015: McDonald’s announces plans to offer a number of its breakfast items throughout the day.\n\n2015: The Supreme Court rules that gay and lesbian couples have a constitutional right to be married.\n\n2016: Republican Donald Trump is elected the 45th president of the United States.\n\n2016: Famed New York City restaurant the Four Seasons closes in July, only to open later in a different location, to varied reviews.\n\n2016: A Technomic study, done in conjunction with the Food Marketing Institute, shows a growth of $15 billion in supermarket foodservice over the last eight years.\n\n2018: After 10 years of fits and starts, federal menu labeling requirements take effect. The National Restaurant Association had been a proponent of the regulations, which set out precisely how nutritional information must be displayed on the menus of chain restaurants.\n\n2018: While overall restaurant sales are flat to slightly positive, delivery booms. Sales through third parties during the first half of the year topped $5 billion, a 55% increase over the prior year. That volume would have made the delivery specialists the industry’s third-largest chain, behind McDonald’s and Starbucks.\n\nClick here for more insights and information on the Centennial.\n\nMembers help make our journalism possible. Become a Restaurant Business member today and unlock exclusive benefits, including unlimited access to all of our content. Sign up here."}, {"url": "https://www.history.com/topics/1980s/1980s", "page_content": "In the 1980s, a new conservatism arose in social, economic and political life, characterized by the policies of U.S. President Ronald Reagan and U.K. Prime Minister Margaret Thatcher. For some, the 1960s and 1970s had been a troubling time that undermined Americans’ confidence in their fellow citizens and in their government. The 1980s, often remembered for its materialism and consumerism, also saw the rise of the \"yuppie,\" an explosion of blockbuster movies and the emergence of cable networks like CNN and MTV, which introduced the music video and launched the careers of many iconic artists. The AIDS crisis of the 1980s would go on to kill more than 700,000 people in the United States alone.\n\nReagan Revolution\n\nThe populist conservative movement known as the New Right enjoyed unprecedented growth in the late 1970s and early 1980s. It appealed to a diverse assortment of Americans including evangelical Christians, anti-tax crusaders, advocates of a more powerful American presence abroad, disaffected white liberals and defenders of a free market with few if any regulations.\n\nDid You Know? At the beginning of the decade, as the Cold War showed no signs of easing, arms control advocates argued for a \"nuclear freeze\" agreement between the United States and the Soviet Union. In 1982, almost a million people rallied in support of the freeze in New York City's Central Park. Many historians believe this was the largest mass demonstration in American history.\n\nThe movement resonated with many citizens who had once supported more liberal policies but who no longer believed the Democratic Party represented their interests.\n\nDuring and after the 1980 presidential election, these disaffected former liberals came to be known as “Reagan Democrats.” They contributed millions of crucial votes to the victory of Republican Ronald Reagan, the former actor and governor of California, over incumbent Democrat Jimmy Carter.\n\nReaganomics\n\nReagan advocated for industrial deregulation, reductions in government spending and tax cuts for both individuals and corporations, as part of an economic plan he and his advisors referred to as “supply-side economics.” His economic and social agenda was largely shared by his across-the-pond friend, British Prime Minister Margaret Thatcher.\n\nThe resulting economic growth would allegedly “trickle down” to everyone—but whether it did or not is a matter of ongoing debate among politicians and economists. George H.W. Bush, campaigning against Reagan in the 1980 primary election, referred to his opponent’s economic policy as “voodoo economics.”\n\nReagan’s economic policies—known as Reaganomics—initially proved less successful than its partisans had hoped, particularly when it came to a key tenet of the plan: balancing the budget.\n\nHuge increases in military spending—during the Reagan administration, Pentagon spending would reach $34 million an hour—were not offset by spending cuts or tax increases elsewhere. This fact, plus Reagan’s militaristic posture in international affairs, earned him the nickname “Ronald Ray-Gun.”\n\nBy early 1982, the United States was experiencing its worst recession since the Great Depression. Nine million people were unemployed in November of that year. Businesses closed, families lost their homes and farmers lost their land. The economy slowly righted itself, however, and Reaganomics grew popular again.\n\nEven the stock market crash of October 1987 did little to undermine the confidence of middle-class and wealthy Americans in the president’s economic agenda. Many also overlooked the fact that Reagan’s policies created record budget deficits: During his eight years in office, the federal government accumulated more debt than it had in its entire history.\n\nReagan Doctrine\n\nLike many other American leaders during the Cold War, Reagan believed that the spread of communism anywhere threatened freedom everywhere. As a result, his administration was eager to provide financial and military aid to anticommunist governments and insurgencies around the world. This policy, applied in nations including Grenada, El Salvador and Nicaragua, was known as the Reagan Doctrine.\n\nIn November 1986, it emerged that the White House had illegally sold arms to Iran in an effort to win the freedom of U.S. hostages in Lebanon, and then diverted money from the sales to Nicaraguan rebels known as the Contras. The Iran-Contra affair, as it became known, resulted in the convictions—later reversed—of Reagan’s national security adviser, John Poindexter, and Marine Lt. Col. Oliver North, a member of the National Security Council.\n\nDespite its mixed track record, a majority of Americans still believed in the conservative agenda by the late 1980s. When Ronald Reagan left office in 1989, he had the highest approval rating of any president since Franklin D. Roosevelt. In 1988, Reagan’s vice president, George H. W. Bush, soundly defeated Massachusetts Governor Michael Dukakis in the presidential election.\n\nFall of Communism\n\nWhile Reagan and Thatcher trumpeted the march of conservative politics and capitalism, the foundations of communism grew increasingly shaky. In Poland, former electrician Lech Walesa led striking workers to form Solidarity, the first labor union to develop in a Soviet bloc nation. In 1980, representatives of the communist government of Poland agreed to the demands of the strikers.\n\nIn 1985, Soviet leader Mikhail Gorbachev began to introduce the twin concepts of glasnost, or “openness\" and perestroika, or “restructuring,” to revive the moribund Soviet economy—but those efforts yielded few tangible results.\n\nBy the end of the 1980s, communism was in rapid retreat across Europe and Asia. The Berlin Wall, which had long divided the German city into an eastern, communist-held half and a western democratic half, was torn down by ecstatic crowds in 1989. And two years later, the Soviet Union collapsed.\n\nIn communist China, the Tiananmen Square protests—student-led demonstrations calling for democracy, free speech and a free press—began in the spring of 1989. In June of that year, the protests were ended by the Chinese government in a bloody crackdown known as the Tiananmen Square Massacre.\n\nYuppie Culture\n\nIn some respects, the popular culture of the 1980s reflected the era's political conservatism. For many people, the embodiment of the decade was the young, urban professional, or “yuppie,” a baby boomer with a college education, a good-paying job and expensive taste.\n\nMany people derided yuppies for being self-centered and materialistic, and surveys of young urban professionals across the country showed that they were, indeed, more concerned with making money and buying consumer goods than their parents and grandparents had been.\n\nMovies in the 1980s\n\nUnlike the 1970s, when hard-hitting movies addressed controversial subjects, lighthearted fare seemed to reign supreme in the 1980s. Films like “Ghostbusters,” “Die Hard,” “The Breakfast Club” and “Fast Times at Ridgemont High” kept audiences enthralled and box office receipts high.\n\nThe decade was also the era when blockbusters dominated: Movies like “E.T. the Extra-Terrestrial,\" “Beverly Hills Cop” and mammoth franchises like the Indiana Jones, Back to the Future and Star Wars series appealed to moviegoers of all ages, making hundreds of millions of dollars in domestic and international releases.\n\nBut not everything was superficial escapism: Many now-famous directors honed their craft with dark, serious movies like David Lynch in “Blue Velvet” and “The Elephant Man,” Martin Scorsese in “Raging Bull” and Gus Van Sant in “Drugstore Cowboy.”\n\nTelevision in the 1980s\n\nAt home, millions watched family sitcoms like “The Cosby Show,” “The Simpsons,” “thirtysomething” “Family Ties,” “Roseanne” and “Married...with Children.” They also skipped broadcast network fare and watched rented movies on their new VCRs.\n\nBy the end of the 1980s, broadcast networks realized they were in serious trouble as 60 percent of American television owners had cable service. Soon, cable companies like HBO, Cinemax, TBS and Nickelodeon were household names.\n\nIn 1980, the Cable News Network first aired, and soon CNN became a major player in delivering U.S. and international news via satellite worldwide, 24 hours a day. One year later, another revolutionary cable network, MTV, made its debut and completely changed the way Americans thought about music, dance and fashion.\n\nMusic in the 1980s\n\nThe music videos MTV played made stars out of bands like Duran Duran, R.E.M. and Culture Club and megastars out of artists like Madonna, Prince, Whitney Houston and Michael Jackson, whose elaborate \"Thriller\" video helped sell 600,000 albums in the five days after its first broadcast.\n\nLater, MTV became a forum for those who went against the grain or were left out of predominantly white, yuppie culture. Rap and hip-hop artists such as Public Enemy channeled the frustration of urban Blacks into their powerful album “It Takes a Nation of Millions to Hold Us Back.”\n\nBut because of the consistent promotion of white musicians and bands on MTV, other venues soon opened up for emerging artists. BET, or Black Entertainment Television, premiered in 1980 as a challenger to MTV by promoting Black bands and musicians.\n\nHard rock acts such as Metallica and Guns N’ Roses captured the sense of malaise among young people, particularly young men. The 1980s also saw the growing popularity of electronic music, house music, reggae, new wave and other dance-club favorites.\n\nFashion in the 1980s\n\nIn addition to serving as a platform for music, MTV also influenced fashion: People across the country (and around the world) did their best to copy the hairstyles and fashions they saw in music videos. Soon, musicians like Madonna, MC Hammer and Boy George also became style icons.\n\nBut behind the gloss of MTV, another influence grew in both music and fashion: Punk culture and new-wave fashion, especially in London, grew from a late-1970s trend into a potent 1980s fashion force worldwide, with designers like Vivienne Westwood leading the charge. Ripped jeans and jackets—replete with safety pins and other metallic adornments—Doc Martens boots, spiked hair and heavy makeup were all the rage.\n\nOther fashion trends from the 1980s included athletic wear—running shoes or basketball shoes, track suits and leg warmers—worn as everyday clothing. The preppy look, which mimicked the clothing worn by Ivy League students and buttoned-up professionals, invaded college campuses and nightclubs alike, following the success of “The Official Preppy Handbook,” published by Lisa Birnbach in 1980.\n\nAIDS Crisis\n\nIn 1981, the Centers for Disease Control and Prevention (CDC) and other sources began reporting on an outbreak of unusual health conditions in otherwise healthy, young gay men in New York City, San Francisco and other urban areas.\n\nWithin a few years, an alarmed public learned about the spread of a deadly infectious disease now known as AIDS, or Acquired Immune Deficiency Syndrome, transmitted by direct contact with bodily fluids. Because it was initially dismissed by many—including the political and medical establishments—as occurring only among gay men, the disease spread rapidly, with at least 100,000 U.S. cases and an estimated 400,000 AIDS cases worldwide by the end of the 1980s.\n\nAfter news broke that a number of popular figures—including Rock Hudson, Keith Haring, Magic Johnson, Greg Louganis and Liberace—were infected with the disease, the government, medical officials and the general public rallied to prevent the spread of AIDS and offer help to those affected.\n\nRed ribbons supporting AIDS awareness soon adorned clothes, books, cars and public buildings, including the White House. The first antiviral treatment for AIDS, azidothymidine (AZT), was made available in 1987 and was followed by other, more advanced treatments, but the disease remains a health threat to this day.\n\nWomen in the News\n\nExpanding on the hard-won rights that women earned in previous decades, women were leaders in many arenas in the 1980s, from politics to science and the arts. Maggie Thatcher was elected as the first woman prime minister of Great Britain, and Corazon Aquino—following the assassination of her husband, Senator Benigno Aquino Jr.—was ushered into office as the first women president of the Philippines.\n\nU.S. astronaut Sally Ride became the first American woman to fly in space on the space shuttle Challenger in 1983. On the Supreme Court, Sandra Day O’Connor was appointed by President Reagan as the first woman to serve as associate justice.\n\nArguably the most famous woman of the era was Princess Diana, who married Charles, the Prince of Wales, in an elaborate 1981 televised wedding watched by some 750 million people around the world. Her visage was to grace television screens and magazine covers for many years thereafter until Diana’s death in 1997.\n\nDisasters\n\nA number of disasters, both natural and manmade, made headlines in the 1980s. The decade began with the 1980 eruption of Mount St. Helens in Washington. The titanic explosion claimed more than 50 human lives and destroyed thousands of acres of forest and rangeland.\n\nIn Bhopal, India, an explosion at a Union Carbide pesticide plant in 1984 led to the worst industrial accident in history. At least 2,000 people died and another 200,000 were injured when poisonous gas enveloped the city.\n\nMemories of the 1979 nuclear disaster at Three Mile Island in Pennsylvania were revived when the Chernobyl nuclear plant in Ukraine exploded in 1986, killing dozens of people, sickening many more and sending plumes of radioactive particles into the air as far as Sweden. Mikhail Gorbachev would later say the Chernobyl disaster “was perhaps the real cause of the collapse of the Soviet Union five years later.”\n\nIn Alaska, the pristine shores of Prince William Sound were stained black in 1989 when the Exxon Valdez tanker spilled some 11 million gallons of crude oil into the sea, killing hundreds of thousands of seabirds, otters, seals and whales. Even 30 years later, pockets of crude oil remained in some areas.\n\nAnd in the blue skies above Cape Canaveral, Florida, the space shuttle Challenger exploded as millions of people watched on television and on the ground. All seven crew members aboard were killed.\n\nTechnology in the 1980s\n\nThroughout the 1970s, computers were expensive devices that remained the province of a handful of garage tinkerers and multibillion-dollar entities like IBM and NASA. But all that changed during the 1980s, the decade that introduced the world to the video game Pac-Man.\n\nIBM released the IBM Model 5150, the first IBM personal computer, to much fanfare in 1981. One year later, the Commodore 64 personal computer debuted at the Consumer Electronics Show in Las Vegas, and TIME magazine named The Computer as its “Man of the Year.”\n\nSoon, scattered computer users began to communicate with one another through an early network developed by the U.S. Department of Defense: ARPANET. In 1983, the network adopted TCP/IP, a set of communications protocols that led to the creation of the internet, and the modern era of computer communications was born.\n\nWith the personal computer, or PC, now available to middle-class consumers, Microsoft—founded in 1975 by Bill Gates and Paul Allen—soon became the dominant player in PC software. In 1983, Microsoft released Word, a simple, practical word-processing program, followed in 1985 by Windows, now the world’s most popular computer operating system. And Apple released its first Apple computer in 1984.\n\nCommunication took another leap forward when Motorola introduced the Motorola DynaTAC 8000X, a handheld cellular telephone. Weighing in at 1 lb., 12 ounces and 13 inches tall, the brick-like cell phone was a novelty at the time, but it heralded the beginning of a new era. By 2021, almost 15 million cell phones would be in use worldwide.\n\nSources\n\nTimeline: 1980s. Security and Exchange Commission: Historical Society.\n\nList of 1980's Major News Events in History. The People History.\n\nThe 10 biggest tech breakthroughs of the 1980s. TechRadar.\n\nPOP Culture: 1980. United States Census Bureau.\n\n1980s: Pop Culture in Excess. The Guardian (UCSD).\n\nThe 10 defining moments of the 1980s. SBS."}, {"url": "https://www.iwfs.org/americas/wine-food---friends-1/articles/auguste-escoffier--founder-of-modern-cuisine", "page_content": "Auguste Escoffier: Founder of Modern Cuisine\n\n\n\n\n\nby Tom Murnan (Council Bluffs & Omaha Branches)\n\nI was dimly aware of the name Auguste Escoffier just a few months ago, but if I had been asked to give any kind of summary of his life or importance, I would have been unable to do so, other to say he was an pioneer in French cuisine. I suspect that most members of the IWFS are in the same situation. Serendipity can be a wonderful thing, and it was quite by chance that I stumbled onto an entertaining, and at the same time, educational presentation of Escoffier at Omaha's Institute for the Culinary Arts which presented a brunch and one-man play on his life. It's hard to know where you are going if you don't know where you've been, and the whole time I was watching the play I was thinking that I must bring this wonderful presentation to my fellow IWFS members.\n\nAfter a series of articles promoting the history of Escoffier in our Bluffs Gazette, the Council Bluffs Branch engaged local Omaha Actor Marty Skomal to bring Escoffier to life. Our event featured a dinner with all Escoffier recipes paired with all French wines. The one man play is delightful, fitting right into the second part of our IWFS name: FOOD, and its mission to educate its members about the world of food and wine.\n\nMarty Skomal as Escoffier with member Tom Murnan\n\ndiscussing hotel magnate César Ritz\n\nThis man was a giant in the culinary world at the end of the 19th century and the beginning of the 20th. Escoffier met with, and impressed, the important people on the world stage at that time: King Edward VII, Kaiser Wilhelm II, actress Lily Langtry, hotelier César Ritz, and opera superstars Nellie Melba and the divine Sarah Bernhardt. When Ritz ran the London Carlton, and Escoffier ran its dining room, together they changed English society's dining habits. It became more important to be seen dining at the Carlton than to stay and eat at home. From the play we learned about his relationship with these luminaries, the challenges of his day, and his culinary accomplishments. The character of Escoffier came alive and spoke directly to you as if you were having a tête à tête in his home in Monte Carlo.\n\nMarty Skomal (Escoffier) is a graduate of the conservatory of theatre arts at Webster University. A native Omahan, he has been an arts administrator with the Nebraska Arts Council for 25 years, as director of programs for the last ten. Previously he was director of theatre at the Jewish Community Center, production manager at Chanticleer Theatre, and has worked with many local and regional theatres including the Nebraska Theatre Caravan. As a director, Marty has directed for the play lab of the Great Plains Theatre Conference at Metropolitan Community College in Omaha. He has performed Escoffier in Omaha previously at Le Voltaire Restaurant, for the Institute for the Culinary Arts at Metropolitan Community College, and in Lincoln for the Angels Theatre Company. Marty wishes to thank Barbee Davis, who directed and wrote a large portion of the production, for her unwavering support in bringing Escoffier from conception to reality.\n\nMarty is willing to travel, so if your branch would like to do something unique, fun and educational, contact Marty at mjsomaha@yahoo.com regarding his play Escoffier: Master of the Kitchen.\n\nActor Marty Skomal portrays Auguste Escoffier\n\nThe following are the series of articles on the French culinary powerhouse, Auguste Escoffier that appeared in the International Wine & Food Society Council Bluffs Branch, Bluffs Gazettes from January 2014 to April 2014. They focus in greater detail on the life, times and importance of this great French chef.\n\nWHY ESCOFFIER MATTERS TODAY\n\nI have noticed that in the International Wine & Food Society, at least in the United States, that we tend to emphasize more the Wine part of the name and place less emphasis on the Food. The two are inextricably intertwined, however, because without food to enhance the wine, and vice versa, the pleasurable experience of dining is diminished. I hope to help right the ship a bit with a series of articles on one of the towering figures of French cuisine. He never worked on an aristocratic estate but instead displayed his culinary skills in restaurants and the grand Hotels of the era. He is best known for promoting French cuisine during the Belle Époque in the 1890's.\n\nGeorges Auguste Escoffier was born October 28th, 1846 in humble circumstances in the French village of Villaneuve-Loubet, not far from Niece. He began his culinary career at the age of 13 in his uncle's restaurant. In those days, working in a kitchen was a hot thankless job. At the time, the culinary profession was not held in high regard. Kitchens were unclean, disorganized, and a safety hazard This was true of private aristocratic estate kitchens, as well as inns, taverns, and the newly developed place to eat, a restaurant. Young Auguste, as he preferred to be called, was not coddled but was given rigorous and disciplined training in his apprenticeship.\n\nIn 1865, he moved to Paris and began working for another restaurant, Le Petit Moulin Rouge. When the Franco Prussian War broke out in 1870, he became an army chef. Auguste noticed how the military was organized in a hierarchical system and thought he could apply this kind of structure to the kitchen to gain more efficiency, reduce duplication of effort, and identify specific staff functions. He organized what today is called the Brigade System with its clear chain of command. More on the Brigade system in the next Gazette. This streamlined division of labor proved to be very effective.\n\nAuguste applied the Brigade system to the hotel kitchens he worked for. Moving to England in 1890, working with César Ritz, he transformed the Savoy Hotel in London, then the Paris Ritz (1898) and then the London Carlton Hotel in 1899. He invented new dishes for celebrity patrons who stayed at these hotels. The organized kitchen was essential to luxury liners such as the Titanic, and his menus inspired the last menu in the first class dining room when the Titanic sank in 1912. He met Kaiser Wilhelm II on board the SS Imperator who told him, \"I am the Emperor of Germany, but you are the Emperor of Chefs.\"\n\nBesides organizing the kitchen, Escoffier simplified the elaborate recipes and procedures of his predecessor, Antonin Carême (1784-1833). Carême was a pioneer in French Grande Cuisine. He worked closely with aristocrats like Talleyrand, the future King George IV and Tsar Alexander I, and wrote several cookbooks. He is known for large, intricate and decorative centerpieces and elaborate and involved recipes. Escoffier simplified Carême's classifications. For example, he distilled Carême's detailed classifications of sauce down to Five Mother Sauces. He believed that the grandeur of French cuisine came from the sauces.\n\nEscoffier wrote eight landmark books, including his most famous, Le Guide Culinaire which is still used today and has over 5000 recipes. The Guide has been translated into English: The Complete Guide to the Art of Modern Cookery. Recipes stress using the freshest ingredients, local ingredients that are in season, and simplified preparation that allowed for flexibility that carries over to our time.\n\nSo, why are we concerned with a man whose heyday was over a hundred years ago? Because so much of what he did still remains with us. He abolished the system where all food came out at the same time and replaced it with its delivery in courses. He developed canning of tomatoes, vegetables and other methods of food preservation. He invented the bouillon cube. Kitchens became organized, cleaner, more hygienic and safer. He elevated cooking to an art and a profession that workers could be proud of. He was aware of social concerns in the kitchen. He created a kind of social security for his kitchen staff and was concerned about their welfare. He created recipes, such as Peach Melba, that are famous even in our time. He championed fresh, wholesome ingredients from farm to table. His cookbooks are still a foundation of French Haut Cuisine. He fed the poor because he did not believe in leftovers, preferring instead to start each day anew in the kitchen, and so donated what remained from the previous day to the hungry.\n\nIn his day, there was a lot of drinking alcohol and smoking in the kitchen. He banned smoking and drinking and even asked a French doctor to develop a healthy barley drink to relieve the unbearable heat of the kitchen. The toque or hat and neckerchief were introduced to prevent drops of sweat falling into the food. Most importantly, Escoffier brought a sense of calm and order to the kitchen. \"Above all, keep it simple\" is one Escoffier's famous maxims. His first concern was the pleasure and comfort of the customer.\n\nEscoffier retired in 1920 and moved back to the Mediterranean area of France. He was made a Chevalier of the French Legion of Honor. In retirement he continued to write, his last book, Ma Cuisine, dealt with cuisine bourgeoisie. He died at Monte Carlo, Monaco, on February 12, 1935, the pre-eminent chef of France.\n\nSources: On Cooking A Textbook of Culinary Fundamentals 4th Edition by Sarah R Labensky and Alan M Hause; Wikipedia; History of Auguste Escoffier - YouTube http://www.youtube.com/watch%3Fv%3DA6T7d2yB-2I; Escoffier: Britain's First Master Chef by Hannah Briggs http://www.bbc.co.uk/food/0/20123168\n\nESCOFFIER INTRODUCES THE BRIGADE SYSTEM TO THE KITCHEN\n\nContinuing our miniseries on the important French Chef, Auguste Escoffier, we move to a significant improvement that he introduced that revolutionized how kitchens were organized.\n\nWhen the Franco Prussian War broke out in 1870, Escoffier became an army chef. While in the service, Auguste noticed how the military was organized in a hierarchical system. He thought he could apply this kind of structure to the kitchen to gain more efficiency, reduce duplication of effort, and identify specific staff functions. He organized what today is called the Brigade System with its clear chain of command. This streamlined and reduced duplication of effort in hotel kitchens. There were two main divisions in a restaurant: The Kitchen Brigade and the Front of the House, or Dining Room Brigade. Each station has clear cut responsibilities. Today, with modern equipment, or a smaller establishment, the number of positions can be reduced. Maintaining a well-organized kitchen was key for Escoffier who could be managing up to 60 or 80 members of staff at any one time. The aim was to cut down on waiting times and to ensure that food was served efficiently at exactly the right temperature. Most importantly, Escoffier brought a sense of calm and order to the kitchen. The Brigade system is only for large kitchen staffs, but even smaller professional kitchens will adopt some portion of Escoffier's organization and division of labor even today.\n\nThe Kitchen Brigade\n\nAt the top was the Chef de Cuisine (executive chef), responsible for all kitchen operations and all those under him. He developed the menus, the theme of the restaurant and set the tempo and tone. Beneath him was the Sous-Chef, or second in command. He was directly responsible for scheduling the staff, placement and changing staff at the different stations, and sometimes relaying orders from the waiter to the kitchen. Next came the Chefs de Partie or station chefs (Commis). In the old system, duplication would occur at this point because each station made what they needed. You could have more than one station making the same sauce, for example. Now roles were clearly defined at each station.\n\nThe Saucier (sauté and sauce station chef) held one of the most important and exacting stations, demanding experience and expertise in making sauces and sautéing most dishes. The Rôtisseur (roast station chef) were responsible for roasting and jus. The Poissonier (fish station chef) was responsible for fish and shellfish. The Potager was responsible for stocks and soups. The Pâtissier (pastry chef) was responsible for all baked items, such as bouchées and puff pastry, and supervised the Boulanger (bread baker) who made rolls and breads. There was a Entremetier (hot vegetable chef), a Garde-Manger (pantry chef) responsible for cold food preparations, salads and cold appetizers, and a Chef Tournant, or relief chef. Under these chefs, responsible for a certain station, were the demi-chefs (assistants) and the Commis (apprentice), in English known as cooks.\n\nThe Dining Room Brigade\n\nThe front of the restaurant also had its hierarchy of authority. Even today, students at culinary institutes study both the front and the back of the house.\n\nThe Maître d'Hôtel, or Maître D, is in charge of the dining room and is responsible for operations in the front of the house. He or she trains and manages the service and wait staff, works with the Chef de Cuisine to develop menus, is responsible for the wine list, and seating of patrons.\n\nThe Sommelier or Wine Steward's duties include all aspects of the wine service: selecting and purchasing wines, printing a wine list, assisting guests in selecting the best wines based on customer preference, price and affinity for the food selected, and the proper opening and serving of the wine. Wines may need to be decanted at tableside. Some restaurants have a Beverage Manager\n\nThe Chef de Salle, or Head Waiter, is in charge of the service and waiters for the entire dining room.\n\nThe Chef d'Étage or Captain deals with the guests once they are seated. He or she explains the menu, answers questions and takes the order. Should there be tableside food preparation, the Captain does it.\n\nThe Chef de Rang or Front Waiter sets the table for each course, ensured that the food is properly delivered, and that the guests' needs are promptly and courteously met.\n\nThe Demi-chef de rang or Commis de Rang (Busboy) fills water glasses, clears plates between courses, fills bread baskets and assists the front waiter or Captain as required.\n\nSources: On Cooking A Textbook of Culinary Fundamentals 4th Edition by Sarah R Labensky and Alan M Hause; The Professional Chef 9th edition The Culinary Institute of America; Escoffier: Britain's First Master Chef by Hannah Briggs http://www.bbc.co.uk/food/0/20123168\n\nA SHORT HISTORY OF THE FRENCH RESTAURANT: 18TH TO MID 20TH CENTURIES\n\nMost people today have no clue as to how food in the past was prepared and served for the traveler, or just hungry diners with money, home or away from home. The professional trained chef is relatively recent in the historical scheme of things. The development of the restaurant as we know it only occurred at the end of the 18th century in France. Instead of one menu for everyone, this new innovation called a restaurant produced numerous dishes for different diners at different times of the day.\n\nIn much of Europe, and France in particular, food preparation outside aristocratic households was done by various guilds, who had a monopoly on certain kinds of preparations. One preparation was a \"restorative,\" highly flavored and rich soups or stews. In fact, the word restaurant comes from the French word restaurer, meaning to restore. Their original purpose was to restore strength and vigor. So during the reign of King Henri IV (1553-1610) there were guilds for rôtisseurs who cooked main cuts of meat, vinaigriers, who made sauces, pâtissiers, who cooked pies and poultry, tamisiers who baked bread, and the like. Taverns and inns typically served food prepared by these guilds. Food was not the main focus of these establishments: drinking and a place to sleep was. Food was an afterthought, and there was a very limited selection. Food was prepared at the guild and brought in. Diners would share a common table and eat family style.\n\nThe first restaurant opened in Paris in 1765 when a tavern keeper, Monsieur Boulanger, hung a sign advertising his restorative: sheep feet in white sauce. After winning a lawsuit brought by a guild who thought they had the monopoly on soup and stew preparation, the restaurant went on to prosper. Boulanger's innovation was to focus on food, offer a selection of prepared food instead of just a preselected, limited menu, and the food was prepared on site as you waited. Since it was a restorative, it had a kind of medical application. As time progressed, this medical aspect was dropped in favor of a diverse selection of ordinary food.\n\nDuring the French Revolution (1789-1799) the guilds were abolished, as well as the aristocracy. Their private chefs and kitchens were scattered, but some of the well trained, sophisticated chefs started restaurants.\n\nThe Grande Taverne de Londres opened in Paris in 1782 by Antoine Beauvilliers, the former steward to King Louis XVIII (1814 to 1824). His innovation was to offer food service during fixed hours as well as a printed menu. A wait staff was impeccably trained and patrons sat at small tables instead of a communal table.\n\nAntonin Carême Carême's elaborate presentations\n\nBy the middle of the 19th century, several large, grand restaurants in Paris were serving elaborate meals which recalled the days of grande cuisine of the aristocrats. Antonin Carême perfected this trend of dozens of courses, elaborately prepared and painstakingly garnished and sauced. Cuisine had become an art form. There were not, however, just restaurants serving grande cuisine. Some restaurants combined grande cuisine with cuisine bourgeoisie to create a simpler menu.\n\nCésar Ritz\n\nIn the late 19th century, hotels offered the finest restaurants. César Ritz opened restaurants, first in London at the Savoy, and later the Paris Ritz and London Carlton. He allied with August Escoffier to make the hotel restaurant a destination, the showpiece of his hotels. Escoffier refined and simplified Carême's cuisine, and organized the kitchen and wait staffs in a hierarchical system, with division of labor to make food preparation more efficient.. The first American internationally known chef, Charles Ranhofer (1836-1899) opened Delmonico's restaurant in New York City. Restaurants were now shaped into the form we are familiar with today.\n\nEnglish Women not allowed to dine in public circa 1890\n\nIn England, Cesar Ritz and Auguste Escoffier were brought over to the Savoy Hotel in London by owner Richard D'Oyly Carte, the impressario of Gilbert and Sullivan operettas. Ritz wanted to make the Savoy's restaurant a magnet for London society, not just the luxurious appointments of the hotel. When they arrived, women seldom dined out. Highborn women would instead dine at their estates. Even for the men, dining out was mostly done at one's club, not a restaurant. Ritz worked to change that. He knew that men and women dressed up and dined out frequently in Paris, Vienna or the Côte d'Azure, for example, but once one crossed the English channel, a different set of social mores ruled. Women did not dine out in public, nor was it proper to dine out on Sundays. Ritz started a campaign for dining in the evening after an evening of the theatre. He enlisted the help of Lillie Langtry, (former mistress of the future Edward VII and stage superstar) who helped to get the liquor licensing regulations changed so liquor could be served until 12:30 in the morning. Gradually, it became more chic for men and women to be seen at the Savoy Restaurant than in their own homes. But Escoffier's stoves were a key attraction in making the hotel restaurant a fashionable place to go. Sunday night dinners after the theatre, with society dressed to the nines, became the event of the week. At the Savoy Restaurant they mingled with actors and actresses (Sarah Bernhardt), opera divas (Nellie Melba), composers (Sir Arthur Sullivan) and other artists. So, Auguste Escoffier, one of the greatest French chefs in history, had a hand in getting women out of their homes and into public restaurants in England.\n\nSources: On Cooking A Textbook of Culinary Fundamentals 4th Edition by Sarah R Labensky and Alan M Hause; Wikipedia.\n\nhttp://www.famoushotels.org/article/1157 ; Wikipedia ; http://www.anothermag.com/current/view/88/At_the_Savoy_in_Mayfair\n\nESCOFFIER: THE FIVE MOTHER SAUCES\n\nOur series on the influence Auguste Escoffier had on modern cooking continues with his classification of the five mother sauces. Sauces are the glory of French cuisine, and his predecessor, Antonin Carême had previously set forth four grandes sauces as the basis of French cooking: béchamel, espagnole, velouté, and allemande. Escoffier modernized this list with his five mother sauces by dropping allemande sauce, which is a variant of velouté, and adding hollandaise and tomato sauce.\n\nLet's start by defining just exactly what a sauce is. A sauce is a thickened liquid used to flavor and enhance other foods. A good sauce adds flavor, moisture, richness and visual appeal. A sauce should compliment food. It should never disguise it A sauce can be hot or cold, sweet or savory, smooth or chunky. A mother sauce is the base or starting point for making other secondary sauces. Three of the mother sauces use roux, or flour and butter, as a thickening agent. A roux is equal parts clarified butter and flour, sautéed for various lengths of time. The longer you sauté it, the more brown it becomes. For a white sauce, you would sauté the roux for only a short time, for example, enough to take away the floury taste. Each sauce has a different flavored liquid as its base. Here are Escoffier's five mother sauces.\n\n1. Béchamel Sauce is probably the simplest of the mother sauces because it doesn't require making stock. If you have milk, flour and butter, you can make a very basic béchamel.\n\n\n\nBéchamel is made by thickening hot milk with a simple white roux. Clarified butteris the preferred fat to be used. Clarified butter is heated butter where the milk solids and water are poured off, resulting in a translucent golden butter fat.\n\nThe sauce is then flavored with onion, cloves and nutmeg and salt, then simmered until it is creamy and velvety smooth. Daughter sauces (secondary sauces) made from Béchamel sauce includes Mornay Sauce (cheese added), Crème Sauce (cream instead of milk) and Nantua Sauce (shrimp butter instead of plain clarified).\n\n2. Velouté Sauce is another fairly simple sauce whose liquid can vary from chicken stock to veal or fish stock. Again, the liquid is thicken with a roux. Daughter or small sauces include Normandy Sauce (fish stock, chopped mushrooms thickened with egg yolk and cream) for seafood dishes, Mushroom Sauce, or Suprême Sauce (chicken Velouté Sauce with cream).\n\n3. Espagnole Sauce, also known as Brown Sauce, is a more complex sauce. It starts with meat stock which was prepared with beef bones that were browned in the oven. This roasting adds a deep brown color and more flavor than if you just put the bones in water to make a stock. Espagnole also uses a roux, cooked until the flour is dark brown, but it then adds tomato purée and a mirepoix. A mirepoix is a mixture of finely chopped onion, celery and carrots. Roasting this vegetable mixture first adds even more flavor. Since Espagnole sauce simmers for a long time, the vegetables have time to release their flavors. Secondary sauces made from this mother sauce include Marchand de Vin Sauce (red wine sauce), Madeira or Port Sauces, Bercy Sauce (white wine and shallots) Mushroom Sauce, and Demi-Glace. Demi-Glace, the crown glory of French cuisine, is a reduction of half brown stock reduced by 50%, and half Espagnole sauce and is the basis of many meat sauces.\n\n4. Hollandaise Sauce does not use a roux as its thickening agent. It is an emulsified sauce where the liquid is hot clarified butter and the thickening agent is egg yolks. An emulsion is a mixture of two liquids that would ordinarily not mix together, like oil and vinegar. In the case of Hollandaise, it is the lecithin in the egg yolks that acts as the emulsifier. Lecithin, a fatty substance soluble in both fat and water, will readily combine with both the egg yolk and the butter, essentially holding the two liquids together. Daughter sauces include Mousseline Sauce (whipped cream), Dijon Sauce (mustard), Béarnaise Sauce (tarragon leaves, shallots and tarragon vinegar), and Choron Sauce (tomato paste added to Béarnaise), and Mayonnaise.\n\n5. Classic Tomato Sauce is the fifth mother sauce. This sauce resembles the traditional tomato sauce that we might use on pasta and pizza, but it's got much more flavor and requires a few more steps to make.\n\n\n\nFirst the chef renders salt pork and then sauté aromatic vegetables. Then tomatoes are added along with stock and a ham bone, and simmered in the oven for a couple of hours. Cooking the sauce in the oven helps heat it evenly and without scorching.\n\n\n\nTraditionally, the tomato sauce was thickened with roux, and some chefs still prepare it this way. But in reality, the tomatoes themselves are enough to thicken the sauce. Here are a few small sauces made from the classic tomato sauce: Spanish Sauce (sautéed green onions, green peppers, garlic and mushrooms), Creole Sauce (same as before but cayenne pepper and no mushrooms), and Provençale Sauce (sautéed onions, garlic, capers, olives and Herbes de Provence).\n\nThese five mother sauces, then, give birth to hundreds of other sauces. With the addition of different meats, vegetables, herbs and spices, these small or daughter sauces can enhance an infinite variety of food.\n\nAuguste Escoffier (in black) with two of his chefs.\n\nWHAT'S IN A NAME? ESCOFFIER'S ARTISTIC NAMES FOR FOOD\n\n\"That which we call a rose by any other name would smell as sweet\"\n\nShakespeare, Romeo & Juliet\n\nIn my impecunious salad days, I was backpacking through Europe, staying at Youth Hostels and pensiones, having the time of my life. On this occasion, I was at a bargain restaurant in Brittany examining the menu. One item intrigued me: \"Pommes Anglaise.\" Hmmm, I thought to myself, English Potatoes. The price was right (cheap), so I decided to take the leap to this obviously wonderful culinary experience. After all, it was French. When the plate was brought to table, I discovered that what I ordered was stinking lousy boiled potatoes! Was this potato sobriquet a scathing Gallic indictment of English cooking? Boiled potatoes indeed. A child of six could do it. This taught me to be a little more discriminating when examining floridly written menu items with exotic French names.\n\nHaving just completed our Escoffier event, it would be hard not to notice that most courses had a fanciful name. We learned in our one man play how Escoffier named two different items for the opera singer Nellie Melba: Melba Toast and Peach Melba. I thought I would run through the menu for the benefit of those who were not there, as well as to remind those that were, to learn more about how these foods got their names.\n\nCuisses de Nymphs à l'Aurore is perhaps Escoffier's most mysterious dish name. Nowhere does the name give a clue to what is in the dish. This subterfuge was purposely done. Thighs of the Nymphs of Dawn was euphemistically named to trick 600 guests at a soirée held in 1908 at the London Savoy for the Prince of Wales (the future King George V) into eating a food that was not popular with the English. The French, however, had been eating frog legs since prehistoric times. In fact, in the Tenth Century, French monks got frog legs classified as a fish to get around Lenten prohibitions on meat, and this classification has stuck in the culinary world to the present time. In some accounts, it is said that the prince was partial to frog legs, so he was in on the hoax. In other accounts he did not know of the deception and was not partial to frog legs either. The dish was served in a buffet with the above name so as not to disturb the delicate sensibilities of the diners, but really, Escoffier was miffed that the English would not eat a favorite French national dish. The dish was a sensation, and so Cuisses became a great hit that London social season. Imagine that. Setting your prejudices aside, through sleight of hand or just an iron will, could result in a wonderfully tasty dish.\n\nMelba Toast. If I told you that toast had been named after Helen Porter Mitchell, you would not recognize the significance. But if I told you that same toast was named after opera singer Dame Nellie Melba, you might remember that. Escoffier came up with this innovation in toast after the singer became ill in 1897 and wanted something light and simple to eat. César Ritz supposedly gave the toast its name after a conversation with Escoffier. It is simplicity itself. Lightly toast slices of bread, remove from heat source, trim off crust and split the bread in half, then toast the untoasted sides again. Melba toast is used even today in dieting, and for hors d'oeuvres as a base for spreadable toppings.\n\nPeach Melba was created for the opera star when she was staying at the London Savoy Hotel, where Escoffier ran the restaurant. She was starring in Richard Wagner's Lohengrin. She gave Escoffier tickets to the opera, which featured a boat in the shape of a swan, and the next night he created a dessert for her. Peaches served over vanilla ice cream and topped with spun sugar were placed in a silver bowl and inserted into a ice sculpture formed in the shape of a swan. He called it Peach with a Swan. A few years later he refined the dish by removing the ice sculpture, and adding pureed raspberry as a topping. He then called it Peach Melba. There were many variations on this famous dessert, to which Escoffier commented in Memories of My Life “Pêche Melba is a simple dish made up of tender and very ripe peaches, vanilla ice cream, and a purée of sugared raspberry. Any variation on this recipe ruins the delicate balance of its taste.”\n\nTournedos Rossini. There is adispute as to which chef invented this dish: Marie-Antonin Carême or Auguste Escoffier. In Escoffier's cooking bible, Le Guide Culinaire, numerous recipes are named after Gioachino Rossini, enough to create a whole menu.\n\nBut my guess is that it was actually Carême who invented it, since Carême and Rossini were great friends. According to legend, the dish was named at the Café Anglais in Paris. Rossini insisted on overseeing the preparation of this dish near his table. The chef finally became fed up with his constant interference, whereupon the Maestro told him \"So, turn your back.\" There are other versions on how the dish received its name, so we may never know for sure. But it is true that the combination pan fried tenderloin, served over a crouton topped with fresh foie gras, and garnished with demi-glace or Madeira sauce and topped with truffles is a classic gastronomic opus worthy of the maestro.\n\nBombe Nero was named after the Roman Emperor Nero, who began his reign in 54 A.D. after his uncle Emperor Claudius died. Legend has it that Nero fiddled as Rome burned during the Great Fire of 64 A.D. This was impossible since the fiddle would not be invented for another 1500 years, but Suetonius, in his The Lives of Twelve Caesars, mentions that Nero played the lyre. Despite being out of town during the fire, many of his enemies suggested that he set the fire to make room for an imperial palace.\n\nA bombe is a French frozen dessert made in a spherical mold. Layers of ice cream or sherbet would be spread on the mold and successively frozen before another layer was added. Finally, the mold was closed and frozen as a whole. In Escoffier's Bombe Nero a mold of vanilla ice cream, caramel and chocolate truffles was opened on to a punch biscuit. Meringue was piped over the ice cream and placed briefly in an oven to lightly brown the meringue. Once removed from the oven, flaming rum was ignited and the dessert was served immediately. It is the flaming rum that reminds us of Emperor Nero and his fiddling about while Rome burned.\n\nSo, the question remains: What's in a name? Apparently, a lot. An elegant name enhances a menu card. It can be used to disarm your prejudices and get someone to try something if only their narrow-mindedness would get out of the way (think of your kids...they won't eat pheasant but will eat \"chicken\"), and you can use a famous celebrity to entice someone to be adventurous. The next time you think that oysters are not indigenous to the Rocky Mountains, beware, be aware, and think what's in a name!\n\nSources: Wikipedia; http://www.pbs.org/food/the-history-kitchen/opera-escoffier-and-peaches-the-story-behind-the-peach-melba/ ;\n\nhttp://www.theguardian.com/lifeandstyle/2009/aug/07/frogs-legs-france-asia\n\n\"Among the faithful, in the great kitchens of the world, Escoffier is to Câreme what the New Testament is to the Old.\"\n\n\n\n(André L Simon, 1877-1970, The Concise Encyclopedia to Gastronomy, 1952)\n\nWHAT'S IN A NAME PART 2: ESCOFFIER'S ARTISTIC NAMES FOR FOOD\n\n\n\nIn August 2014, the Omaha Branch put on their own event featuring the one man play: Escoffier Master of the Kitchen, A Play About the Most Influential Chef of all Time. With over ten thousand recipes in his repertoire, the menu designer has many choices to choose from. Here are some more stories behind the names Escoffier used for his recipes.\n\n\n\nVelouté Agnès Sorel\n\nR-rated mushroom soup! Although only the most dedicated American amateur history buff would recognize the name of Agnès Sorel, the French know her as the mistress to King Charles VII, who reigned from 1422 to 1461. It was a tumultuous time to be king of France, and Charles, beginning with the help of St. Joan of Arc, eventually succeeded in ridding France of the English. He also received help from his wife, Marie d'Anjou, and her mother Queen Yolande of Aragon. Enter Agnès Sorel, who was his wife's lady in waiting and only 22 years old to his 40. She became the love of his life. She was exceptionally bright, politically astute, and incredibly beautiful. She was also said to have the most shapely and beautiful breasts in Europe. She was fond of wearing décolletage and gauzy dresses that showed off her considerable assets. One of the stricter moralist courtiers complained upon first meeting her that he could see her nipples! Pretty risqué for that era. When she became Charles' mistress, she had to give up being the mistress to two other courtiers (but she kept a third, the Royal Chamberlain and fellow advisor to the king, Pierre de Breze).\n\nThe king showered her with gifts, such as the Château de Loches, and had her painted as the Virgin Mary, with one breast bared, for a diptych at Melun. She became the first official mistress in a long line of French kings. She helped Charles to conquer his depression and transformed him from a timid, indecisive king into a strong ruler. She met an untimely death by mercury poisoning shortly after giving birth to her fourth illegitimate royal daughter. She was only 28 years old. Charles' estranged son, the future Louis XI, was suspected, but it was never proven. She was only the king's mistress for six years, but those were Charles' most prosperous years.\n\nBesides the Velouté Agnès Sorel, Escoffier also included Suprême de Volaille Agnès Sorel (Breasts of chicken in a Madeira sauce on a bed of rice flavored with truffles, mushrooms and tongue) into his Guide to Modern Cookery. How appropriate for the woman with the most beautiful bosom in 15th century France!\n\nSources: Wikipedia; http://www.medadvocates.org/celebrati/february/feb_09.htm\n\n\n\nSole Véronique\n\nThe opéra comique Véronique was composed by André Messager in Paris in 1898 and was widely performed in London and Paris for fifty years. Eventually, it was performed in all the major capitals in Europe. Vicomte Florestan is forced by his uncle to either marry or go to debtor's prison for his overspending. He chooses an arranged marriage to Hélène. She has never seen his intended, but goes to a florist to buy her corsage before the ceremony. By coincidence, Florestan goes there too. She overhears Floristan's conversation and discovers that she is his intended. Hélène changes her name to Véronique, and comedy ensues. Escoffier created a new dish at the London Carlton to celebrate the long run of the play: Sole Véronique.\n\nSource: Wikipedia\n\n\n\nPoularde La Tosca\n\nBuried in his work while at the London Savoy, only getting four to five hours a sleep a night, with his wife and family away in France, Escoffier could at times be a lonely man, but always a private man. He did have one great admiration, and that was for Sara Bernhardt. They had been friends for years and he knew all her stage roles by heart. It was well known that she admired him as well and was one of her favorites. She would have Auguste prepare scrambled eggs accompanied by Champagne privately for her birthday dinners. There has been much speculation if they were lovers, but Sarah usually would comment on her leading men. Her powers over men was magical. Her biographer wrote \"For Sarah, to admire a man was, as often as not, to sleep with him\" and she would usually talk about her conquests. But, showing discretion unusual for her, all she would ever say about Auguste was that he made the best scrambled eggs in the world. So it was never proven that the two were more than just great friends.\n\nBernhardt around 1878 Sarah Bernhardt in the title\n\nrole of the play La Tosca\n\n\n\n\n\n\n\nSarah would stay at the Savoy for long periods at a time, and Auguste would design recipes for her. Poularde La Tosca was created when she was playing the title role for the play (not the opera) La Tosca by Victorien Sardou in 1887. Puccini's opera was based on this five act play. It is interesting that in Act 2 of the opera, the villain Baron Scarpia, of intemperate appetites, eats from a table which, besides being laden with food, also has cutlery. Tosca later uses a knife from this table to dispatch him.\n\nPoularde La Tosca is a whole chicken stuffed with truffled rice pilaf, roasted and served with braised fennel. But this was not the only Escoffier recipe with a Tosca theme. Consommé Tosca, Tartlettes Tosca, Saddle of Veal à la Tosca, and Bombe Tosca can be found in his books. Other dishes were named for Bernhardt directly, such as Escoffier's Potage Sarah Bernhardt and Fraises à la Sarah Bernhardt.\n\nSources: Wikipedia; Escoffier: The King of Chefs by Kenneth James; The Boston Globe: A real- life Diva Gave Tosca Some of its Flavor."}, {"url": "https://menwhoblog.com/blog/who-invented-pizza-rolls.html", "page_content": "Who Invented Pizza Rolls\n\nWe all know of the infamous pizza rolls; one of the quickest and cleanest ways to eat our favorite food, pizza. These perfectly-sized square treats satisfy that pizza craving any time you need them! But, who invented these delicious pizza rolls?\n\nWho Invented Pizza Rolls?\n\nJeno Paulucci created pizza rolls in the 1960s when he decided to stuff a Chinese egg roll with pizza toppings instead of the traditional Asian filling. The brand was originally called Jeno's Pizza Rolls in 1968, but after Mr. Paulucci sold his company to Pillsbury, the name was changed to Totino's. Mr. Paulucci had begun his career in the ready-made food business by creating Chun King, a company that originally sold canned chop suey, and then he expanded into a line of ready-made Chinese foods.\n\nThe Crisp Crust you are familiar with in today's Totino's pizza rolls was patented in 1979. Pillsbury bought Jeno's Pizza Rolls in 1985 for $140 million in an attempt to offer more product choices in their lines. In 1993, the #1 selling hot snack food was rebranded and given the more familiar Totinos Pizza Rolls name.\n\nWho Was Jeno Paulucci?\n\nJeno Paulucci's (who was dubbed the \"king of frozen foods\") ready-made food creations included pie fillings and egg foo as well as the infamous pizza rolls. He was born to poor Italian immigrants, and started his life in the food business at only 16 years old selling fruit. The air conditioner in a local store malfunctioned, causing 18 crates of bananas to change color after being exposed to ammonia vapors. Jeno raised the price of the bananas and advertised them in the street as rare Argentinian bananas. He gave passersby a sense of urgency with his shouts and sold out in a matter of hours.\n\nLater, as a traveling garlic salesman, he discovered bean sprouts growing indoors in hydroponic gardens in a Minneapolis Japanese community. He was fascinated by the idea that legumes could be grown indoors all year long, especially with Minnesota's cold winters. He began growing his own bean sprouts and sold them to area restaurants to be used as an ingredient in salad.\n\nIn the 1940s, he one of the first creators of packaged Chinese dishes. While traveling to sell his bean sprouts, Mr. Paulucci noticed that though he saw many Chinese food restaurants, there weren't any prepared Chinese food dishes in any grocery stores. He knew the food industry was missing out an a great opportunity. Mr. Paulucci created his own chop suey recipe by canning his bean sprouts, celery, pimento, and Italian herbs. In 1947, a friend loaned him $2,500, which he used to start Chun King. In 1960, Jeno began hiring the radio comedian Stan Freberg to host a Chinese New Year celebration he titled “Chun King Chow Mein Hour.\" The broadcast was interspersed with commercials and folk songs, and Jeno's marketing began including television commercials and advertisements by plane. Some people criticized him for using Chinese heritage and traditions for his gain. In 1966, J.R. Reynolds tobacco company bought Chun King for $63 million.\n\nHe later founded an Italian frozen food company, Jeno's, which started with frozen lasagna and garlic bread. Mr. Paulucci had used a machine of his own invention to prepare his Chun King egg rolls, and one day he decided to replace the usual filling with pizza toppings, essentially creating a pizza egg roll, or one of the first pizza rolls.\n\nAfter Mr. Paulucci sold Jeno's, he founded Luigino's. He then created Michelina's, a frozen Italian food brand he named after his mother.\n\nIn his lifetime, Jeno Paulucci gave millions of dollars to many philanthropic efforts including charities, churches, and public projects. He regularly visited the northern Italian village of his ancestors. He died November 24, 2011 at 93 years old. Lois Mae, his wife of 64 years, died just four days before him. They had three children.\n\nAnother Possibility\n\nThere is one other possible creator of the pizza roll. In the 1920s, in Fairmont, West Virginia, Giuseppe Agiro noticed that coal miners were often seen eating a sausage in one hand a roll in the other. He decided to put them together, originally with only pepperoni. They didn't have to be refrigerated, which was important for coal miners who had nowhere to refrigerate their food.\n\nVariations of the pepperoni roll can still be found in areas of Ohio and West Virginia. The United States military even has a version of the pepperoni meal as one of their \"meals, ready to eat,\" also known as MREs.\n\nPerhaps Agiro's idea inspired Jeno Paulucci. Paulucci took the idea up a notch by adding cheese, peppers, and sausage to his frozen pizza rolls.\n\nTotino's is still the biggest brand of pizza rolls, but you can also find them made by Great Value, FarmRich, Michelina's, and Zap'ems.\n\nNo matter what, pizza filling inside a crusty bread rolls was an excellent invention!"}, {"url": "https://www.britannica.com/biography/George-Soros", "page_content": "George Soros , (born August 12, 1930, Budapest , Hungary), Hungarian-born American financier, author, philanthropist, and activist whose success as an investor made him one of the wealthiest men in the world. He was also known as a powerful and influential supporter of liberal social causes.\n\nSoros, who was born into a prosperous Jewish family, had his upbringing disrupted by the Nazis ’ arrival in Hungary in 1944. The family split up and used false papers to avoid being sent to concentration camps . In 1947 they moved to London. Soros studied philosophy under Karl Popper at the London School of Economics , but he abandoned his plans to become a philosopher. He joined the London merchant bank Singer & Friedlander. In 1956 he moved to New York City , where he worked initially as an analyst of European securities and rapidly made his mark.\n\nFinancial career\n\nIn 1973 Soros established the Soros Fund (later Quantum Endowment Fund), a hedge fund that subsequently spawned a range of associated companies. His daring investment decisions caused the funds to grow rapidly, but not all his gambles succeeded. He correctly foresaw the worldwide stock market crash of October 1987—but wrongly predicted that Japanese stocks would fall hardest of all.\n\nSoros’s status as an almost mythical financier was established in September 1992 when the British government devalued the pound sterling. Through his Quantum group of companies, Soros had sold billions of pounds during the days preceding devaluation, much of it purchased with borrowed money. Afterward Soros bought back pounds, repaid the money he had borrowed, and made a profit of about $1 billion. Others also profited from the pound’s fall, but the scale of Soros’s operations dwarfed those of everyone else, and the gambit earned him the nickname “the man who broke the Bank of England.” In 1994, however, his instincts appeared to fail him—at least temporarily—as he speculated that the dollar would rise in value against the Japanese yen. Instead, the dollar fell all year, and the Quantum Fund reportedly lost hundreds of millions on a single day in February.\n\nAlthough he denied involvement in speculative attacks on the Thai baht in 1997, Soros’s name was soon linked with the financial crisis that swept Asia the following year. Malaysian Prime Minister Mahathir bin Mohamad singled out Soros, stating that he was responsible for the decline of the ringgit. In reality, Soros’s funds had lost billions as a result of the crisis. Soros recovered with early gains on Internet stocks in 1999, but his investment style became more conservative in the wake of the implosion of the technology bubble in 2000. In December 2002 a French court convicted Soros of insider trading for a 1988 stock deal involving financial services company Société Générale, and he was fined €2.2 million ($2.9 million). Soros appealed the ruling, but it was upheld by the Cour de Cassation (France’s highest court) in 2006. Facing new federal regulations concerning hedge funds, Soros announced in July 2011 that the Quantum Endowment Fund would no longer manage the money of outside investors. Instead, it would only handle the assets of Soros and his family."}, {"url": "https://www.britannica.com/biography/George-Strait", "page_content": "George Strait, in full George Harvey Strait, (born May 18, 1952, Poteet, Texas, U.S.), American country music singer, guitarist, and “new traditionalist,” known for reviving interest in the western swing and honky-tonk music of the 1930s and ’40s through his straightforward musical style and his unassuming right-off-the-ranch stage persona. He was among the most popular concert and recording artists in the 1980s and ’90s, and his shows continued to pack stadiums to their capacity well into the 21st century.\n\nStrait was raised in the small town of Pearsall in southern Texas, where his father worked as a junior-high-school math teacher while also operating a ranch, about 40 miles (64 km) to the southwest, that had been in the Strait family for almost a century. During his youth Strait spent many weekends with his brother riding horses, roping cattle, and otherwise absorbing the lifestyle and values of the rural West. Country music, however, was not an element of the culture that he readily embraced. He was more interested in hammering out the latest rock tunes, with guitar skills that he knew were limited, with his high-school garage band.\n\nBritannica Quiz Pop Culture Quiz\n\nAfter attending Southwest Texas State University (now Texas State University–San Marcos) for a year, Strait married his high-school sweetheart and enlisted in the U.S. Army in 1971. While stationed in Hawaii, he refined his guitar and vocal technique and developed an affinity for the country music of Hank Williams, George Jones, Merle Haggard, and, especially, Bob Wills, the champion of western swing. In 1973, while still in the military, he joined his first country music band, at his army post.\n\nStrait left the army in 1975, resumed his studies at Southwest Texas State University, and graduated with a degree in agriculture in 1979. While at the university he joined the country band Stoney Ridge (later renamed Ace in the Hole), which played regularly in the clubs near campus. Strait tried repeatedly to promote his music in Nashville, but the industry executives balked, doubting the appeal of his traditional style in a market then dominated by a slicker image and a pop-country sound. In 1981, however, MCA Records relented and signed him to a one-song contract; if the song proved a success, the company would offer a longer-term agreement. Strait’s response, “Unwound” (1981), reached number six on Billboard magazine’s Hot Country Songs chart, landed him an extended contract with MCA, and ultimately launched his career as a professional musician.\n\nDuring the next decade Strait released more than a dozen albums, each of which sold more than a million copies. Close on the heels of his honky-tonk debut album, Strait Country (1981), he issued Strait from the Heart (1982), which contained his first number one country music hit, “Fool Hearted Memory.” In 1992 Strait played the role of a country music superstar in the film Pure Country, which further fueled his popularity. He remained phenomenally productive and in 2006 was inducted into the Country Music Hall of Fame. His 2008 release, Troubadour, won a Grammy Award for best country album. In 2009 he made a foray into songwriting, writing three of the tracks on Twang with his son, George (“Bubba”) Strait, Jr. By 2010 the senior Strait had recorded nearly 50 songs that reached the top spot on Billboard’s Country Songs chart.\n\nThroughout his career Strait rarely swerved from his old-style sound and his rancher’s image, sartorially marked by a western button-down shirt, blue jeans, and a cowboy hat and boots. Moreover, as the ongoing host of the George Strait Team Roping Classic—an annual event that he, his father, and his brother had established in the early 1980s—he never abandoned his passion for the saddle. Although he remained a strong performer, Strait announced in September 2012 that his 2013–14 Cowboy Rides Away tour—the start of which coincided roughly with the May 2013 release of his album Love Is Everything—would be his last. In late 2013, between legs of the tour, Strait earned the Country Music Association’s award for entertainer of the year for the third time in his career (following wins in 1989–90). Strait issued his 29th studio album, Cold Beer Conversation, in 2015, and he began a residency in Las Vegas the following year."}, {"url": "https://www.businessinsider.com/what-happened-to-american-jobs-in-the-80s-2017-7", "page_content": "Navarro is the guy the arrows are pointing to. Reuters The Trump administration's timeline on the decline of American workers starts in the late 1990s with the rise of China.\n\nThat thinking overlooks the impact of spending cuts, deregulation, and a shift to shareholder primacy at the expense of investment in innovation and workers.\n\nThat began in the 1980s when Ronald Reagan was president and led a push for more Laissez Faire economics.\n\nIgnoring the US's hand in the demise of its own working class means this administration will never actually find ways to grow the economy for them.\n\nWhite House Trade Council head Peter Navarro was explaining what he sees as the biggest problem with the American economy since the 1990s that exacerbated inequality and left the American worker in the lurch.\n\n\"Well, I think you start with the idea that we've had 15 years of subpar growth — 2 percent or below,\" he said in an interview with NPR to promote \"Made in America Week.\"\n\n\"Prior to 2001, we grew at 3 and a half percent. The big difference has been the entry of China in particular into the World Trade Organization and our markets. And we've just been hammered. What that does as a proxy, basically, is it drains essentially the lifeblood out of our manufacturing economy, out of our communities, out of our tax bases.\"\n\nSo the narrative from the White House is that China's big push into global markets is the root cause for stagnant economic and wage growth since the turn of the millennium. But that narrative has a really basic flaw: It's only half the story. And with only half the story, you're not going to find a whole solution to the slow growth, low wage, low unemployment predicament we find ourselves in now.\n\nThe problem didn't start in the 1990s, it started in the 1980s, when Ronald Reagan — a hero of the Trump administration — was president, and neoliberal economics were first making their mark on policy. Reagan and his ilk distrusted government and believed that the private sector could make the best decisions when left on its own. You've heard about this — it's called laissez faire economics.\n\nThis ideology ultimately led to the financialization of the US corporation — the process of putting shareholders first, often at the expense of workers and consumers — and its emergence as an actor that takes resources from the economy rather than creating them. This, combined with a government zeal for lowering taxes rather than spending, means no one — not the government, and not the private sector — is investing enough in America to keep the economy strong across social classes.\n\nIn short: Government cuts and changes in how corporations operate mean American workers are getting screwed by their own government and their own employers.\n\nNavarro and I end up with the same dire view of the current economic landscape. We just disagree on how we got there.\n\nAn unstoppable force...\n\nBut I'm jumping ahead — let's go back to the Reagan era. That was also the time Japanese manufacturers had developed a superior management style to their American rivals and, frankly, started eating our lunch.\n\nInstead of keeping a wall between management and workers, Japanese manufacturers adopted “organizational integration,” which put technical specialists and shop-floor workers together. The result was better products made faster in Japan, and jobs lost permanently in the United States.\n\nThe Financialization of the US Corporation, William Lazonick\n\nWilliam Lazonick, an economics professor at UMass Lowell,\n\ndescribes the results of that transformation in his 2012 paper, \"The Financialization of the US Corporation: What Has Been Lost, and How Can It Be Regained.\" It's a must-read for this kind of stuff.\n\nLazonick describes the huge negative effect competition from Japanese manufacturers had on American manufacturing jobs:"}, {"url": "https://lemelson.mit.edu/resources/george-crum", "page_content": "The fine details surrounding the invention of one of the United States' favorite snack foods are somewhat hazy. There are several different claims on how the potato chip was invented, but some evidence shows a man named George Crum, a cook and restaurateur was said to have come up with the idea for the tasty crisp.\n\nBorn by the name of George Speck in 1824 in Saratoga Lake, New York, Crum was the son of an African American father and Native American mother, a member of the Huron tribe. He professionally adopted the name \"Crum,\" as it was the name his father used in his career as a jockey. As a young man, Crum worked as a guide in the Adirondack Mountains and as an Indian trader. Eventually, he came to realize that he possessed exceptional talent in the culinary arts.\n\nIn the summer of 1853, he was working as a chef at Saratoga Springs' elegant Moon Lake Lodge resort, where French-fried potatoes were a favorite on the menu. This preparation for potatoes, in which the tubers are cut lengthwise, lightly fried, and eaten with a fork, is said to have become popular in the 1700s. Thomas Jefferson, having enjoyed them in France during his service as an ambassador to that country, is known to have introduced them to local folks at home and liked to eat and serve them frequently.\n\nLegend says Crum became agitated when a customer sent his French-fried potatoes back to the kitchen, complaining that they were cut too thickly. Crum reacted by slicing the potatoes as thin as he possibly could, frying them in grease, and sending the crunchy brown chips back out on the guest's plate that way.\n\nThe reaction was unexpected: The guest loved the crisps. In fact, other guests began asking for them as well, and soon Crum's \"Saratoga Chips\" became one of lodge's most popular treats.\n\nIn 1860, Crum opened his own restaurant, \"Crumbs House,\" near Saratoga Lake where he catered to an upscale clientele. Guests are said to have included the likes of William Vanderbilt, Cornelius Vanderbilt, and Jay Gould. One of the restaurant's attractions was a basket of potato chips placed on every table.\n\nCrum never patented or attempted to widely distribute his potato chips. Nevertheless, they were soon on their way to becoming an international phenomenon with the help of a number of aspiring snack food entrepreneurs around the country. Crum closed his restaurant in 1890. He died on July 22, 1914 at the age of 90.\n\nMeanwhile, in 1895, a man by the name of William Tappenden began making potato chips for sale to local grocery stores, at first in his kitchen and later in a makeshift factory behind his house. This marked the first attempt by any person to put potato chips onto grocery store shelves. Others followed his lead, including the Hanover Home Potato Chip company out of Hanover Penn., which was established in 1921. Soon grocers around the United States were selling chips in bulk, from barrels, or out of glass display cases.\n\nIn 1926, Laura Scudder came up with the concept of putting potato chips into wax paper bags, and the \"bag of chips\" concept was born. In 1932, Herman Lay founded Lay's in Nashville, Tenn. His potato chips became the first successfully marketed national brand. Phenomenal success followed for him and for scores of other potato chip makers. Today, retail sales of potato chips top $10 billion per year in the United States alone."}, {"url": "https://www.khanacademy.org/humanities/us-history/postwarera/1950s-america/a/popular-culture-and-mass-media-cnx", "page_content": "Rocking around the clock\n\nIn the late 1940s, some white country musicians began to experiment with the rhythms of the blues, a decades-old musical genre of rural southern black people. This experimentation led to the creation of a new musical form known as rockabilly; by the 1950s, rockabilly had developed into rock and roll.\n\nRock and roll music celebrated themes such as young love and freedom from the oppression of middle-class society. It quickly grew in favor among American teens during the 1950s, thanks largely to the efforts of disc jockey Alan Freed. Freed named and popularized rock and roll by playing it on the radio in Cleveland—where he also organized the first rock and roll concert—and later in New York.\n\nThe theme of rebellion against authority, present in many rock and roll songs, appealed to teens. In 1954, rock group Bill Haley and His Comets provided youth with an anthem for their rebellion with the song ”Rock Around the Clock.” The song, used in the 1955 movie Blackboard Jungle about a white teacher at a troubled inner-city high school, seemed to be calling for teens to declare their independence from adult control.\n\nHaley illustrated how white artists could take musical motifs from African American musicians and achieve mainstream success. Teen heartthrob Elvis Presley rose to stardom doing the same. Thus, besides encouraging a feeling of youthful rebellion, rock and roll also began to tear down color barriers in popular culture, as white youths sought out African American musicians such as Chuck Berry and Little Richard.\n\nPhoto of Elvis Presley dancing in a promo shoot for the song Jailhouse Rock. Rock musician Elvis Presley enthralled teens and scandalized adults with his suggestive lyrics and dance moves. Image credit: Image credit: Wikimedia Commons\n\nWhile youth had found an outlet for their feelings and concerns, their parents were much less enthused about rock and roll and the rebellion and sexuality it seemed to promote. Many regarded the music as a threat to American values. When Elvis Presley appeared on The Ed Sullivan Show, a popular television variety program, the camera deliberately focused on his torso and did not show his swiveling hips or legs shaking in time to the music."}, {"url": "https://www.biography.com/inventors/george-eastman", "page_content": "(1854-1932)\n\nWho Was George Eastman?\n\nIn 1880, George Eastman opened the Eastman Dry Plate and Film Company. His first camera, the Kodak, was sold in 1888 and consisted of a box camera with 100 exposures. Later he offered the first Brownie camera, which was intended for children. By 1927, Eastman Kodak was the largest U.S. company in the industry. Eastman committed suicide in 1932.\n\nEarly Life and Education\n\nNamed after his father George Washington Eastman, George Eastman was born on July 12, 1854, in Waterville, New York. George Sr. had started a small business school, Eastman Commercial College, in Rochester, where he moved the family in 1860. But he died suddenly when Eastman was eight. One of young Eastman's two older sisters was wheelchair-bound from polio and died when Eastman was 16.\n\nEastman's mother, Mary, took in boarders to support the family, and Eastman dropped out of high school at age 14 to add to the family income. He began as a messenger and office boy for insurance companies and studied accounting at home to qualify for a higher salary. He eventually landed a job as bookkeeper at the Rochester Savings Bank.\n\nInventions\n\nWhen Eastman was 24, he planned to visit Santo Domingo and, on the advice of a colleague, decided to document the trip. But the photography equipment alone was enormous, heavy and costly. He bought all the equipment, but he never took the trip.\n\nInstead he began researching how to make photography less cumbersome and easier for the average person to enjoy. After seeing a formula for a \"dry plate\" emulsion in a British publication, and getting tutelage from two local amateur photographers, Eastman formulated a gelatin-based paper film and a device for coating dry plates.\n\nKodak Photography\n\nHe resigned from his bank job after launching his fledgling photography company in April 1880. In 1885, he headed to the patent office with a roll-holder device that he and camera inventor William Hall Walker had developed. This allowed cameras to be smaller and cheaper.\n\nEastman also came up with the name Kodak, because he believed products should have their own identity, free from association with anything else. So in 1888, he launched the first Kodak camera (a few years later, he amended the company name to Eastman Kodak).\n\nThe company slogan was \"You press the button, we do the rest,\" which meant the camera was sent in to the company after the 100 exposures on the roll of film had been used; they developed it and sent it back to the customer. In 1889, Eastman hired chemist Henry Reichenbach to develop a type of flexible film that could be more easily inserted into cameras. Thomas Edison adapted the film for use in the motion-picture camera he was developing, further propelling the success of Eastman's company.\n\nThe Brownie Camera\n\nThe Brownie camera was launched in 1900 to target new hobbyist photographers — children — and with its $1 price tag, it also became a favorite of servicemen. Eastman supported the military in other ways as well, developing unbreakable glass lenses for gas masks and a special camera for taking pictures from planes during World War I.\n\nIn all, Eastman's innovations started the amateur photography craze that is still going strong today.\n\nPhilanthropist\n\nAlthough his company was essentially a monopoly for many years, Eastman was not the average corporate industrialist. He was one of the first American industrialists to embrace and implement the concept of employee profit sharing in the United States, and, in addition, he made an outright gift from his own money to each of his workers. In 1919, he added what is known now as stock options.\n\nHis generosity extended beyond his own business, as he gave to the struggling Mechanics Institute of Rochester, which became the Rochester Institute of Technology, as well as M.I.T. (Massachusetts Institute of Technology). His high regard for education in general led him to contribute to University of Rochester, and the Hampton and Tuskegee institutes. \"The progress of the world depends almost entirely upon education,\" he said.\n\nDental clinics both in Rochester and in Europe were also a focus of his concern. \"It is a medical fact,\" he said, \"that children can have a better chance in life with better looks, better health and more vigor if the teeth, nose, throat and mouth are taken proper care of at the crucial time of childhood.\"\n\nIn all, it is estimated that Eastman contributed more than $100 million of his wealth for philanthropic purposes during his lifetime.\n\nDeath and Legacy\n\nAn avid cyclist, Eastman noticed a progressive immobility, the result of a degenerative condition that involved a hardening of the cells in the lower spinal cord. He also suffered from severe diabetes. So on March 14, 1932, at age 77, he took his own life with a single gunshot to the heart. A note he left said, \"My work is done. Why wait?\"\n\n“The life of our communities in the future needs what our schools of music and of other fine arts can give them. It is necessary for people to have an interest in life outside their occupations.\" - George Eastman\n\nHe never married or had a family, citing being too busy and too poor when he was younger. He was an enthusiastic art collector on his long trips to Europe, and a music lover, establishing the prestigious Eastman School of Music in 1921 in Rochester, New York.\n\nOverall, it is believed that he enjoyed his life, and he gave countless millions the opportunity to enjoy theirs with lasting memories captured on film.\n\nQUICK FACTS\n\nBirth Year: 1854\n\nBirth date: July 12, 1854\n\nBirth State: New York\n\nBirth City: Waterville\n\nBirth Country: United States\n\nGender: Male\n\nBest Known For: George Eastman invented the Kodak camera, helping make photography accessible to the public. His company remains one of the largest in the industry.\n\nIndustries\n\nBusiness and Industry\n\nAstrological Sign: Cancer\n\nNacionalities\n\nAmerican\n\nInteresting Facts\n\nAlthough Eastman invented amateur photography, there are very few pictures of him, and he often went unrecognized in his hometown of Rochester, which he had helped become a thriving community.\n\n\n\nEastman was one of the first American industrialists to embrace and implement the concept of employee profit sharing in the United States.\n\n\n\nEastman never married or had a family, citing being too busy and too poor when he was younger.\n\nDeath Year: 1932\n\nDeath date: March 14, 1932\n\nDeath State: New York\n\nDeath City: Rochester\n\nDeath Country: United States\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: George Eastman Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/inventors/george-eastman\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: June 22, 2020\n\nOriginal Published Date: April 2, 2014\n\nQUOTES"}], "George Roll worked for the family-owned business, Roll International Corporation.": [{"url": "https://www.encyclopedia.com/books/politics-and-business-magazines/roll-international-corporation", "page_content": "Roll International Corporation\n\n11444 West Olympic Boulevard, Tenth Floor\n\nLos Angeles, California 90064-1060\n\nU.S.A.\n\nTelephone: (310) 966-5700\n\nFax: (310) 914-4747\n\nPrivate Company\n\nIncorporated: 1993\n\nEmployees: 7,500\n\nSales: $1.57 billion (1998)\n\nNAIC: 551112 Offices of Other Holding Companies\n\nRoll International Corporation, a private company, is made up of a collection of companies owned by husband-and-wife team Stewart and Lynda Resnick. The biggest and best known of the operations are the Franklin Mint, the world’s largest collectibles company, and Teleflora LLC, the world’s largest florist network. The other Roll subsidiaries are pistachio producer Paramount Farming Co., citrus grower and packer Para-mount Citrus, processor and marketer Paramount Farms, and Bundy Properties, which owns and manages commercial properties in Los Angeles and Pennsylvania.\n\nForming a Holding Company in the 1960s\n\nThe Resnicks started their empire by buying Teleflora, a flowers-by-wire company. They then bought American Protection Industries Inc. (API), a security company. API Alarm Systems, which started in the 1960s, provided both patrols and alarm systems. The alarms, installed in retail, office, and indus-trial buildings as well as in houses, were connected to monitoring centers. If an alarm went off, an operator at the center could summon the closest police or fire department. By 1987, it was the largest alarm company in California.\n\nThe Resnicks made API their holding company, with API Alarm Systems another subsidiary. In 1989, they sold the subsidiary to the British company Automated Security Holdings plc (ASH) for $105 million. At that time, API Alarm Systems served some 21,000 customers and had seven central stations. The Resnicks, however, kept the API name. In 1993 they renamed their holding company Roll International after an agri-cultural company they had acquired.\n\nLate 1970s Addition of Teleflora LLC\n\nSending out-of-town flower orders by wire began in 1910 when two U.S. florists agreed to telegraph each other orders and then settle up on costs. Thus was born Florists’ Trans world Delivery Association (FTD). In 1934, attorney Edwin S. Douglas founded a rival service. Originally called Telegraph Delivery Service, the name was changed to Teleflora. The Res-nicks bought the California-based company in 1979 after it had changed hands several times.\n\nA year after the purchase, Lynda Resnick introduced the concept of keepsake containers and revolutionized the floral delivery business. Instead of just wiring a flower arrangement or a dozen flowers, people could order their flowers in a special vase or basket that the receiver could use after the flowers died.\n\nIn 1987, the company set up its Teleflora Technologies division, providing retail members a computer system with software specifically designed for florists, and Creditline, which allowed members to process credit card purchases immediately. The company also published an award-winning magazine for the retail floral business.\n\nBut by the early 1990s customers had options other than wire services for out-of-town orders. Toll-free telephone numbers were the biggest competition, although catalogs and online delivery services added to the problem. In 1993, Roll made the first of its three bids for FTD. A year later, the FTD board rejected Roll’s final bid of $175 million, which consisted of $140 million in cash and taking over FTD’s debt of $35 million. The merger would have positioned Roll to dominate the industry, but FTD announced it would instead accept a lower bid from Perry Capital Inc. The nonprofit florist cooperative became essentially a trade group representing member florists. The business ventures be-came part of FTD Inc., a for-profit corporation. One of the first initiatives of the new owners was the establishment of FTD.com, an online service for order flowers.\n\nTeleflora continued to look for acquisitions. In 1997, the company became the largest florist network in the country with the purchase of Redbook Florist Services. The next year it acquired Daisy Systems, which provided computerized shop-management systems to retailers. Building on those systems, Teleflora introduced its “Teleflorist Online” service in October 2000. The new service offered Teleflora’s 27,000 members professionally de-signed and managed web sites with e-commerce support such as credit card processing, e-mail gift reminders, and an online ad-dress book for customers. Unlike competitor FTD.com, Teleflora’s approach was to help its members establish their own online businesses (with their own web sites) and to keep their own customers along with 100 percent of their revenue.\n\n1980s Entry into Agricultural Subsidiaries\n\nThe Resnicks moved into agribusiness in the mid-1980s. They first bought a citrus growing and processing operation near Bakersfield, California, which became Paramount Citrus Association. Paramount Citrus grew and packed fruit for both the retail and wholesale markets, selling oranges, lemons, apples, and grapefruit. The company sold much of its juice as Alpha-Beta.\n\nIn 1986, they purchased Apex Orchards from Mobil Oil for $30 million. The 12,000-acre pistachio and almond farm near Bakersfield was renamed Paramount Farming Co. The next year the Resnicks bought Texaco’s central California farming operations, adding some 77,000 acres of farmland, also in the San Joaquin Valley.\n\nIn 1989 the Resnicks formed Paramount Farms, a processing and marketing group that sold pistachios and almonds under its own label as well as wholesale. Paramount Farms’ nuts were soon selling across the country and internationally, primarily to cereal and candy manufacturers, including Cadbury, Nestle, Hershey, Carnation, and Kellogg. Over the years, Paramount Farms expanded its processing and marketing operations to include citrus, olives, and pomegranates. In 1993, Paramount Farms and the Pistachio Producers of California (PPC) formed a marketing co-op called Cal-Pure Pistachios and began offering pistachios under the Sunkist name. By 1996, Paramount Farms was the largest grower, processor, and marketer of almonds and pistachios in the world.\n\nBy the late 1990s, Paramount Citrus had become one of the state’s largest citrus producers. In 2000, the company bought 3,912 acres and several packing houses from Dole Food Co. for $55 million. The purchase, which brought its total acreage of citrus to nearly 27,000, made Paramount Citrus the largest grower, packer, and marketer of fresh citrus in the country.\n\nAddition of The Franklin Mint\n\nIn 1964, Joseph Segal founded General Numismatics, a company devoted to producing and marketing commemorative coins, medals, and other metal objects. The company’s first coin was a commemorative of General Douglas MacArthur. Segal, who paid a medal manufacturer $10,000 to make the MacArthur coin, advertised his product in collectors’ magazines and was soon making $10,000 a month. Segal set up his own production facility and in 1965 took the company public and changed the company’s name to Franklin Mint. Within two years, Segal had built a new headquarters and a modern mint and foundry near Media, Pennsylvania, a Philadelphia suburb. When Segal re-tired in 1973, Franklin Mint had sales of nearly $113 million and earnings of over $9 million as well as its own post office. Sales during the 1970s peaked in 1975 at $233.9 million. After that, sales dropped, although they remained in the $150-$200 million range throughout the decade.\n\nWarner Communications (now Time Warner) purchased The Franklin Mint and its Franklin Mint Museum in 1981, paying some $250 million for the operation. At that point, Franklin Mint became a subsidiary of Warner. In 1984, Warner sold a majority interest (70 percent) to the Resnick’s American Protection Industries for $167.5 million. It retained the administration building, minting facilities, library, mailing center, and a retail store. Stewart Resnick became chairman and Lynda vice-chairman. In its first year of operation under the Resnicks, Franklin Mint had sales of about $250 million, but it lost money from 1988 through 1990. In 1991 it earned $9.1 million, about what its profits were when Segal retired in 1973.\n\nAs the Resnicks expanded Franklin Mint’s offerings, they also set about making Franklin Mint Museum a tourist destination. The museum, which opened in 1973, contained about 7,000 square feet of exhibit space. A visitor could find the major items from the Franklin Mint offerings and trace popular tastes—pewter during the American Bicentennial, the growth of fantasy, and dolls, dolls, dolls. In the museum’s gift shop, visitors could buy any of the items they had just viewed.\n\nIn 1992, the Resnicks were considering taking Franklin Mint public. They hoped to raise $100 million and use most of it to repay bank debt and interest owed to Time Warner. However, the stock sale was canceled. Allan Sloan, writing about the proposed public offering in The Washington Post, noted that Franklin Mint spent $140 million to make its products in 1991 and $184 million to market and promote them. Sales for 1991 were $538 million, more than 250 percent over its cost of goods.\n\nKey Dates:\n\n1979: Stewart and Lynda Rae Resnick buy Teleflora, LLC; Resnicks buy American Protection Industries and set it up as holding company. 1984: Resnicks buy Franklin Mint from Warner Communications Inc. 1985: Resnicks begin adding agriculture subsidiaries Par-amount Citrus and Paramount Farming. 1989: Resnicks sell API Alarm Systems; form Paramount Farms. 1993: Resnicks rename holding company Roll International Corporation.\n\nThe company the Resnicks proposed taking public was very different from the one they had bought from Warner Communications. It now manufactured collectibles, not commemoratives. In 1993 it promoted over 950 products: jewelry, Christmas ornaments, plates, dolls, games, religious sculptures, miniature cars, Arthurian swords, Faberge-type eggs, scale model replicas of the Harley-Davidson Heritage Softail. There was also a magazine for collectors, Almanac. Coins represented less than three percent of the company’s total business. Franklin Mint retail stores were opening and there were plans for catalogs, clothing, cosmetics, and perfume. By 1994, Franklin Mint had expanded to a 187-acre campus, and was housed in a facility larger than ten football fields. It also had employees in 20 countries.\n\nThe 1990s and Beyond\n\nWhile Stewart Resnick was seen to be the financial and organizational genius behind the transformation of Franklin Mint, Lynda Resnick was acknowledged as the marketing and aesthetic genius. Art collectors themselves, the Resnicks under-stood that people are passionate collectors. What they learned from their experience at Franklin Mint is that people collect by theme, such as wildflowers or dogs or movie stars, and by form—dolls, plates, games. With that knowledge, they saw the potential for crossover sales.\n\nLynda Resnick also had a keen feel for cultural trends, which she augmented with equally talented staff around the world. In the mid-1990s she began establishing licensing agreements, first with museums, including the Vatican Museum and the Louvre, and then with celebrities (or their estates), including Elvis. She added fashion designers, then moved to agreements with corporations, including Coca Cola, Campbell Soup, and Parker Bros., as well as movie companies. One reason the corporations found an agreement with Franklin Mint attractive was the company’s advertising budget ($120 million in 1995) and range. Their ads in Parade, TV Guide, and USA Weekend magazines reached more than 70 million households each week.\n\nHowever, collectible sales were beginning to shift from direct marketing to retail and TV shopping. In 1995, top management from several companies left the collectible business. This included Tom Dorovsik, president of Franklin Mint, who joined U.S. Healthcare. Sales were strong but profits were weak and there appeared to be a need for more products.\n\nLynda Resnick’s response was to buy Jackie Kennedy Onassis’ faux pearls for $211,500 when Southeby’s auctioned the former first lady’s possessions in 1996. At the Franklin Mint, a replica of the pearls sold for $195 and was an immediate hit. Resnick also bought one of Princess Di’s evening dresses, and displayed it in the museum. A version of the gown clothed the Mint’s Princess Diana porcelain doll, which also sold for $195. As Resnick explained to David Richards in his 1998 article in The Washington Post, “Nothing lasts. What the Franklin Mint does is create a permanence about the memories we have of the past.” Meanwhile, the company had expanded its retail operations to 50 stores.\n\nFranklin Mint began having some problems in 1997, when Tiger Woods sued the company after it produced a commemorative medal of his win in the 1997 Masters tournament. Franklin Mint paid Woods an undisclosed amount of money to settle the case. In May 1998, the estate of Princess Diana filed a lawsuit to keep Franklin Mint from profiting from the sale of commemorative Princess Di merchandise. In addition to the Diana porcelain doll and a commemorative plate, Franklin Mint sold a jeweled tribute ring and a diamond pendant. The case was not settled until January 2000, when the judge ruled in favor of Franklin Mint. In reality, Franklin Mint had donated over $4 million to charities supported by the late princess. The legal battles led to rumors that the Resnicks were considering selling Franklin Mint. The company quickly denied the reports.\n\nFor over 30 years, the Resnicks have been buying and building companies. In almost each case, their purchase has become the nation’s or the world’s largest operation in its specific field—pistachio production, processing and marketing; manufactured collectibles; flowers by wire; citrus production. With such an amazing record, Roll International was poised for continued success at the start of the new century.\n\nPrincipal Subsidiaries\n\nThe Franklin Mint; Paramount Farms; Paramount Farming Company; Paramount Citrus Association; Teleflora LLC; Bundy Properties.\n\nPrincipal Competitors\n\nCollections; Bradford Exchange; Danbury Mint; FTD Inc.; 1-800-FLOWERS Inc.\n\nFurther Reading\n\nCarr-Brown, Jonathon, “The Princess of Sales,” Ottawa Citizen, June 1, 1999, p. A14.\n\n“Franklin Mint is Going Public,” New York Times, March 13, 1992, p. D3.\n\nHodges, Jane and Laura Loro, “Collectibles Cut Budgets,” Advertising Age, November 13, 1995, p. 4.\n\nLittman, Margaret, “A Thorny Side to FTD.com IPO,” Crain’s Chicago Business, July 12, 1999, p. 1.\n\nLoro, Laura, “The Marketing 100; Lynda Rae Resnick,” Advertising Age, June 26, 1995, p. S22.\n\nLubove, Seth, “King of the Startups,” Forbes, November 8, 1993, p. 186.\n\nMacNeil, V. “American Protection Industries Inc.: Enterprise Collects Sweet Smells and Heirlooms,” Los Angeles Business Journal, February 5, 1990, p. 6.\n\nMehren, Elizabeth, “Objects of Desire,” Los Angeles Times, June 8, 1993, p. E1.\n\n“Mint Conditions,” Guardian, January 7, 2000, p. 5.\n\n“Paramount Farms to Drop Sunkist Growers as Marketer of Nut Brands,” Bakersfield Californian, February 28, 1996.\n\nPiskora, Beth and John Crudele, “A Sale Worth a Mint,” New York Post, August 10, 1998, p. 024.\n\nRichards, David, “Don’t Say Tchotche! Why America Loves the Franklin Mint,” Washington Post, January 25, 1998, p. G1.\n\nRodriguez, Robert, “Paramount Ripens with Recent Dole Land Pur-chase,” Fresno Bee, October 3, 2000, p. C1.\n\nSalley-Schoen, Gwen, “A Peek Inside the Franklin Mint,” Sacramento Bee, November 28, 1992, p. CL11.\n\nSerdahely, Franz, “Will Franklin Mint Regain Lost Luster?,” Focus, September 11, 1985, p. 44.\n\nSherefkin, Robert, “FTD Expected to Approve Perry Bid,” Crain’s Detroit Business, November 7, 1994, p. 1.\n\nSloan, Allan, “Don’t Rush to Add Franklin Mint to Your Stock Collection,” Washington Post, May 19, 1992, p. C3.\n\n“State’s Largest Alarm Service,” Southern California Business, October 1987, p. 8.\n\n“Tiger Woods Settles Lawsuit Over Franklin Mint Medal,” Sports & Entertainment Litigation Reporter, May 1998, p. 5.\n\n“Warner Communications Sells Major Stake in Franklin Mint,” American Metal Market, December 17, 1984, p. 19.\n\nWarner, Susan, “Owners Deny Philadelphia’s Franklin Mint for Sale,” Philadelphia Inquirer, August 11, 1998.\n\n—Ellen D. Wernick"}, {"url": "https://www.company-histories.com/Roll-International-Corporation-Company-History.html", "page_content": "Key Dates:\n\n11444 West Olympic Boulevard, Tenth FloorLos Angeles, California 90064-1060U.S.A.(310) 966-5700(310) 914-4747Stewart and Lynda Rae Resnick buy Teleflora, LLC; Resnicks buy American Protection Industries and set it up as holding company.Resnicks buy Franklin Mint from Warner Communications Inc.Resnicks begin adding agriculture subsidiaries Paramount Citrus and Paramount Farming.Resnicks sell API Alarm Systems; form Paramount Farms.Resnicks rename holding company Roll International Corporation.\n\nRoll International Corporation, a private company, is made up of a collection of companies owned by husband-and-wife team Stewart and Lynda Resnick. The biggest and best known of the operations are the Franklin Mint, the world's largest collectibles company, and Teleflora LLC, the world's largest florist network. The other Roll subsidiaries are pistachio producer Paramount Farming Co., citrus grower and packer Paramount Citrus, processor and marketer Paramount Farms, and Bundy Properties, which owns and manages commercial properties in Los Angeles and Pennsylvania.\n\nForming a Holding Company in the 1960s\n\nThe Resnicks started their empire by buying Teleflora, a flowers-by-wire company. They then bought American Protection Industries Inc. (API), a security company. API Alarm Systems, which started in the 1960s, provided both patrols and alarm systems. The alarms, installed in retail, office, and industrial buildings as well as in houses, were connected to monitoring centers. If an alarm went off, an operator at the center could summon the closest police or fire department. By 1987, it was the largest alarm company in California.\n\nThe Resnicks made API their holding company, with API Alarm Systems another subsidiary. In 1989, they sold the subsidiary to the British company Automated Security Holdings plc (ASH) for $105 million. At that time, API Alarm Systems served some 21,000 customers and had seven central stations. The Resnicks, however, kept the API name. In 1993 they renamed their holding company Roll International after an agricultural company they had acquired.\n\nLate 1970s Addition of Teleflora LLC\n\nSending out-of-town flower orders by wire began in 1910 when two U.S. florists agreed to telegraph each other orders and then settle up on costs. Thus was born Florists' Transworld Delivery Association (FTD). In 1934, attorney Edwin S. Douglas founded a rival service. Originally called Telegraph Delivery Service, the name was changed to Teleflora. The Resnicks bought the California-based company in 1979 after it had changed hands several times.\n\nA year after the purchase, Lynda Resnick introduced the concept of keepsake containers and revolutionized the floral delivery business. Instead of just wiring a flower arrangement or a dozen flowers, people could order their flowers in a special vase or basket that the receiver could use after the flowers died.\n\nIn 1987, the company set up its Teleflora Technologies division, providing retail members a computer system with software specifically designed for florists, and Creditline, which allowed members to process credit card purchases immediately. The company also published an award-winning magazine for the retail floral business.\n\nBut by the early 1990s customers had options other than wire services for out-of-town orders. Toll-free telephone numbers were the biggest competition, although catalogs and online delivery services added to the problem. In 1993, Roll made the first of its three bids for FTD. A year later, the FTD board rejected Roll's final bid of $175 million, which consisted of $140 million in cash and taking over FTD's debt of $35 million. The merger would have positioned Roll to dominate the industry, but FTD announced it would instead accept a lower bid from Perry Capital Inc. The nonprofit florist cooperative became essentially a trade group representing member florists. The business ventures became part of FTD Inc., a for-profit corporation. One of the first initiatives of the new owners was the establishment of FTD.com, an online service for order flowers.\n\nTeleflora continued to look for acquisitions. In 1997, the company became the largest florist network in the country with the purchase of Redbook Florist Services. The next year it acquired Daisy Systems, which provided computerized shop-management systems to retailers. Building on those systems, Teleflora introduced its 'Teleflorist Online' service in October 2000. The new service offered Teleflora's 27,000 members professionally designed and managed web sites with e-commerce support such as credit card processing, e-mail gift reminders, and an online address book for customers. Unlike competitor FTD.com, Teleflora's approach was to help its members establish their own online businesses (with their own web sites) and to keep their own customers along with 100 percent of their revenue.\n\n1980s Entry into Agricultural Subsidiaries\n\nThe Resnicks moved into agribusiness in the mid-1980s. They first bought a citrus growing and processing operation near Bakersfield, California, which became Paramount Citrus Association. Paramount Citrus grew and packed fruit for both the retail and wholesale markets, selling oranges, lemons, apples, and grapefruit. The company sold much of its juice as Alpha-Beta.\n\nIn 1986, they purchased Apex Orchards from Mobil Oil for $30 million. The 12,000-acre pistachio and almond farm near Bakersfield was renamed Paramount Farming Co. The next year the Resnicks bought Texaco's central California farming operations, adding some 77,000 acres of farmland, also in the San Joaquin Valley.\n\nIn 1989 the Resnicks formed Paramount Farms, a processing and marketing group that sold pistachios and almonds under its own label as well as wholesale. Paramount Farms' nuts were soon selling across the country and internationally, primarily to cereal and candy manufacturers, including Cadbury, Nestle, Hershey, Carnation, and Kellogg. Over the years, Paramount Farms expanded its processing and marketing operations to include citrus, olives, and pomegranates. In 1993, Paramount Farms and the Pistachio Producers of California (PPC) formed a marketing co-op called Cal-Pure Pistachios and began offering pistachios under the Sunkist name. By 1996, Paramount Farms was the largest grower, processor, and marketer of almonds and pistachios in the world.\n\nBy the late 1990s, Paramount Citrus had become one of the state's largest citrus producers. In 2000, the company bought 3,912 acres and several packing houses from Dole Food Co. for $55 million. The purchase, which brought its total acreage of citrus to nearly 27,000, made Paramount Citrus the largest grower, packer, and marketer of fresh citrus in the country.\n\nAddition of The Franklin Mint\n\nIn 1964, Joseph Segal founded General Numismatics, a company devoted to producing and marketing commemorative coins, medals, and other metal objects. The company's first coin was a commemorative of General Douglas MacArthur. Segal, who paid a medal manufacturer $10,000 to make the MacArthur coin, advertised his product in collectors' magazines and was soon making $10,000 a month. Segal set up his own production facility and in 1965 took the company public and changed the company's name to Franklin Mint. Within two years, Segal had built a new headquarters and a modern mint and foundry near Media, Pennsylvania, a Philadelphia suburb. When Segal retired in 1973, Franklin Mint had sales of nearly $113 million and earnings of over $9 million as well as its own post office. Sales during the 1970s peaked in 1975 at $233.9 million. After that, sales dropped, although they remained in the $150--$200 million range throughout the decade.\n\nWarner Communications (now Time Warner) purchased The Franklin Mint and its Franklin Mint Museum in 1981, paying some $250 million for the operation. At that point, Franklin Mint became a subsidiary of Warner. In 1984, Warner sold a majority interest (70 percent) to the Resnick's American Protection Industries for $167.5 million. It retained the administration building, minting facilities, library, mailing center, and a retail store. Stewart Resnick became chairman and Lynda vice-chairman. In its first year of operation under the Resnicks, Franklin Mint had sales of about $250 million, but it lost money from 1988 through 1990. In 1991 it earned $9.1 million, about what its profits were when Segal retired in 1973.\n\nAs the Resnicks expanded Franklin Mint's offerings, they also set about making Franklin Mint Museum a tourist destination. The museum, which opened in 1973, contained about 7,000 square feet of exhibit space. A visitor could find the major items from the Franklin Mint offerings and trace popular tastes--pewter during the American Bicentennial, the growth of fantasy, and dolls, dolls, dolls. In the museum's gift shop, visitors could buy any of the items they had just viewed.\n\nIn 1992, the Resnicks were considering taking Franklin Mint public. They hoped to raise $100 million and use most of it to repay bank debt and interest owed to Time Warner. However, the stock sale was canceled. Allan Sloan, writing about the proposed public offering in The Washington Post, noted that Franklin Mint spent $140 million to make its products in 1991 and $184 million to market and promote them. Sales for 1991 were $538 million, more than 250 percent over its cost of goods.\n\nThe company the Resnicks proposed taking public was very different from the one they had bought from Warner Communications. It now manufactured collectibles, not commemoratives. In 1993 it promoted over 950 products: jewelry, Christmas ornaments, plates, dolls, games, religious sculptures, miniature cars, Arthurian swords, Faberge-type eggs, scale model replicas of the Harley-Davidson Heritage Softail. There was also a magazine for collectors, Almanic. Coins represented less than three percent of the company's total business. Franklin Mint retail stores were opening and there were plans for catalogs, clothing, cosmetics, and perfume. By 1994, Franklin Mint had expanded to a 187-acre campus, and was housed in a facility larger than ten football fields. It also had employees in 20 countries.\n\nThe 1990s and Beyond\n\nWhile Stewart Resnick was seen to be the financial and organizational genius behind the transformation of Franklin Mint, Lynda Resnick was acknowledged as the marketing and aesthetic genius. Art collectors themselves, the Resnicks understood that people are passionate collectors. What they learned from their experience at Franklin Mint is that people collect by theme, such as wildflowers or dogs or movie stars, and by form--dolls, plates, games. With that knowledge, they saw the potential for crossover sales.\n\nLynda Resnick also had a keen feel for cultural trends, which she augmented with equally talented staff around the world. In the mid-1990s she began establishing licensing agreements, first with museums, including the Vatican Museum and the Louvre, and then with celebrities (or their estates), including Elvis. She added fashion designers, then moved to agreements with corporations, including Coca Cola, Campbell Soup, and Parker Bros., as well as movie companies. One reason the corporations found an agreement with Franklin Mint attractive was the company's advertising budget ($120 million in 1995) and range. Their ads in Parade, TV Guide, and USA Weekend magazines reached more than 70 million households each week.\n\nHowever, collectible sales were beginning to shift from direct marketing to retail and TV shopping. In 1995, top management from several companies left the collectible business. This included Tom Dorovsik, president of Franklin Mint, who joined U.S. Healthcare. Sales were strong but profits were weak and there appeared to be a need for more products.\n\nLynda Resnick's response was to buy Jackie Kennedy Onassis' faux pearls for $211,500 when Southeby's auctioned the former first lady's possessions in 1996. At the Franklin Mint, a replica of the pearls sold for $195 and was an immediate hit. Resnick also bought one of Princess Di's evening dresses, and displayed it in the museum. A version of the gown clothed the Mint's Princess Diana porcelain doll, which also sold for $195. As Resnick explained to David Richards in his 1998 article in The Washington Post, 'Nothing lasts. What the Franklin Mint does is create a permanence about the memories we have of the past.' Meanwhile, the company had expanded its retail operations to 50 stores .\n\nFranklin Mint began having some problems in 1997, when Tiger Woods sued the company after it produced a commemorative medal of his win in the 1997 Masters tournament. Franklin Mint paid Woods an undisclosed amount of money to settle the case. In May 1998, the estate of Princess Diana filed a lawsuit to keep Franklin Mint from profiting from the sale of commemorative Princess Di merchandise. In addition to the Diana porcelain doll and a commemorative plate, Franklin Mint sold a jeweled tribute ring and a diamond pendant. The case was not settled until January 2000, when the judge ruled in favor of Franklin Mint. In reality, Franklin Mint had donated over $4 million to charities supported by the late princess. The legal battles led to rumors that the Resnicks were considering selling Franklin Mint. The company quickly denied the reports.\n\nFor over 30 years, the Resnicks have been buying and building companies. In almost each case, their purchase has become the nation's or the world's largest operation in its specific field--pistachio production, processing and marketing; manufactured collectibles; flowers by wire; citrus production. With such an amazing record, Roll International was poised for continued success at the start of the new century.\n\nPrincipal Subsidiaries: The Franklin Mint; Paramount Farms; Paramount Farming Company; Paramount Citrus Association; Teleflora LLC; Bundy Properties.\n\nPrincipal Competitors: Lennox Collections; Bradford Exchange; Danbury Mint; FTD Inc.; 1-800-FLOWERS Inc.\n\nCarr-Brown, Jonathon, 'The Princess of Sales,' Ottawa CitizenNew York TimesAdvertising AgeCrain's Chicago BusinessAdvertising AgeForbesLos Angeles Business JournalLos Angeles TimesGuardianBakersfield CalifornianNew York PostWashington PostFresno BeeSacramento BeeFocusCrain's Detroit BusinessWashington PostSouthern California BusinessSports & Entertainment Litigation ReporterAmerican Metal MarketPhiladelphia Inquirer\n\nSource: International Directory of Company Histories, Vol. 37. St. James Press, 2001."}, {"url": "https://companies.jrank.org/pages/3625/Roll-International-Corporation.html", "page_content": "Roll International Corporation Business Information, Profile, and History\n\n11444 West Olympic Boulevard, Tenth Floor\n\nLos Angeles, California 90064-1060\n\nU.S.A.\n\n\n\nHistory of Roll International Corporation\n\nRoll International Corporation, a private company, is made up of a collection of companies owned by husband-and-wife team Stewart and Lynda Resnick. The biggest and best known of the operations are the Franklin Mint, the world's largest collectibles company, and Teleflora LLC, the world's largest florist network. The other Roll subsidiaries are pistachio producer Paramount Farming Co., citrus grower and packer Paramount Citrus, processor and marketer Paramount Farms, and Bundy Properties, which owns and manages commercial properties in Los Angeles and Pennsylvania.\n\nForming a Holding Company in the 1960s\n\nThe Resnicks started their empire by buying Teleflora, a flowers-by-wire company. They then bought American Protection Industries Inc. (API), a security company. API Alarm Systems, which started in the 1960s, provided both patrols and alarm systems. The alarms, installed in retail, office, and industrial buildings as well as in houses, were connected to monitoring centers. If an alarm went off, an operator at the center could summon the closest police or fire department. By 1987, it was the largest alarm company in California.\n\nThe Resnicks made API their holding company, with API Alarm Systems another subsidiary. In 1989, they sold the subsidiary to the British company Automated Security Holdings plc (ASH) for $105 million. At that time, API Alarm Systems served some 21,000 customers and had seven central stations. The Resnicks, however, kept the API name. In 1993 they renamed their holding company Roll International after an agricultural company they had acquired.\n\nLate 1970s Addition of Teleflora LLC\n\nSending out-of-town flower orders by wire began in 1910 when two U.S. florists agreed to telegraph each other orders and then settle up on costs. Thus was born Florists' Transworld Delivery Association (FTD). In 1934, attorney Edwin S. Douglas founded a rival service. Originally called Telegraph Delivery Service, the name was changed to Teleflora. The Resnicks bought the California-based company in 1979 after it had changed hands several times.\n\nA year after the purchase, Lynda Resnick introduced the concept of keepsake containers and revolutionized the floral delivery business. Instead of just wiring a flower arrangement or a dozen flowers, people could order their flowers in a special vase or basket that the receiver could use after the flowers died.\n\nIn 1987, the company set up its Teleflora Technologies division, providing retail members a computer system with software specifically designed for florists, and Creditline, which allowed members to process credit card purchases immediately. The company also published an award-winning magazine for the retail floral business.\n\nBut by the early 1990s customers had options other than wire services for out-of-town orders. Toll-free telephone numbers were the biggest competition, although catalogs and online delivery services added to the problem. In 1993, Roll made the first of its three bids for FTD. A year later, the FTD board rejected Roll's final bid of $175 million, which consisted of $140 million in cash and taking over FTD's debt of $35 million. The merger would have positioned Roll to dominate the industry, but FTD announced it would instead accept a lower bid from Perry Capital Inc. The nonprofit florist cooperative became essentially a trade group representing member florists. The business ventures became part of FTD Inc., a for-profit corporation. One of the first initiatives of the new owners was the establishment of FTD.com, an online service for order flowers.\n\nTeleflora continued to look for acquisitions. In 1997, the company became the largest florist network in the country with the purchase of Redbook Florist Services. The next year it acquired Daisy Systems, which provided computerized shop-management systems to retailers. Building on those systems, Teleflora introduced its 'Teleflorist Online' service in October 2000. The new service offered Teleflora's 27,000 members professionally designed and managed web sites with e-commerce support such as credit card processing, e-mail gift reminders, and an online address book for customers. Unlike competitor FTD.com, Teleflora's approach was to help its members establish their own online businesses (with their own web sites) and to keep their own customers along with 100 percent of their revenue.\n\n1980s Entry into Agricultural Subsidiaries\n\nThe Resnicks moved into agribusiness in the mid-1980s. They first bought a citrus growing and processing operation near Bakersfield, California, which became Paramount Citrus Association. Paramount Citrus grew and packed fruit for both the retail and wholesale markets, selling oranges, lemons, apples, and grapefruit. The company sold much of its juice as Alpha-Beta.\n\nIn 1986, they purchased Apex Orchards from Mobil Oil for $30 million. The 12,000-acre pistachio and almond farm near Bakersfield was renamed Paramount Farming Co. The next year the Resnicks bought Texaco's central California farming operations, adding some 77,000 acres of farmland, also in the San Joaquin Valley.\n\nIn 1989 the Resnicks formed Paramount Farms, a processing and marketing group that sold pistachios and almonds under its own label as well as wholesale. Paramount Farms' nuts were soon selling across the country and internationally, primarily to cereal and candy manufacturers, including Cadbury, Nestle, Hershey, Carnation, and Kellogg. Over the years, Paramount Farms expanded its processing and marketing operations to include citrus, olives, and pomegranates. In 1993, Paramount Farms and the Pistachio Producers of California (PPC) formed a marketing co-op called Cal-Pure Pistachios and began offering pistachios under the Sunkist name. By 1996, Paramount Farms was the largest grower, processor, and marketer of almonds and pistachios in the world.\n\nBy the late 1990s, Paramount Citrus had become one of the state's largest citrus producers. In 2000, the company bought 3,912 acres and several packing houses from Dole Food Co. for $55 million. The purchase, which brought its total acreage of citrus to nearly 27,000, made Paramount Citrus the largest grower, packer, and marketer of fresh citrus in the country.\n\nAddition of The Franklin Mint\n\nIn 1964, Joseph Segal founded General Numismatics, a company devoted to producing and marketing commemorative coins, medals, and other metal objects. The company's first coin was a commemorative of General Douglas MacArthur. Segal, who paid a medal manufacturer $10,000 to make the MacArthur coin, advertised his product in collectors' magazines and was soon making $10,000 a month. Segal set up his own production facility and in 1965 took the company public and changed the company's name to Franklin Mint. Within two years, Segal had built a new headquarters and a modern mint and foundry near Media, Pennsylvania, a Philadelphia suburb. When Segal retired in 1973, Franklin Mint had sales of nearly $113 million and earnings of over $9 million as well as its own post office. Sales during the 1970s peaked in 1975 at $233.9 million. After that, sales dropped, although they remained in the $150--$200 million range throughout the decade.\n\nWarner Communications (now Time Warner) purchased The Franklin Mint and its Franklin Mint Museum in 1981, paying some $250 million for the operation. At that point, Franklin Mint became a subsidiary of Warner. In 1984, Warner sold a majority interest (70 percent) to the Resnick's American Protection Industries for $167.5 million. It retained the administration building, minting facilities, library, mailing center, and a retail store. Stewart Resnick became chairman and Lynda vice-chairman. In its first year of operation under the Resnicks, Franklin Mint had sales of about $250 million, but it lost money from 1988 through 1990. In 1991 it earned $9.1 million, about what its profits were when Segal retired in 1973.\n\nAs the Resnicks expanded Franklin Mint's offerings, they also set about making Franklin Mint Museum a tourist destination. The museum, which opened in 1973, contained about 7,000 square feet of exhibit space. A visitor could find the major items from the Franklin Mint offerings and trace popular tastes--pewter during the American Bicentennial, the growth of fantasy, and dolls, dolls, dolls. In the museum's gift shop, visitors could buy any of the items they had just viewed.\n\nIn 1992, the Resnicks were considering taking Franklin Mint public. They hoped to raise $100 million and use most of it to repay bank debt and interest owed to Time Warner. However, the stock sale was canceled. Allan Sloan, writing about the proposed public offering in The Washington Post, noted that Franklin Mint spent $140 million to make its products in 1991 and $184 million to market and promote them. Sales for 1991 were $538 million, more than 250 percent over its cost of goods.\n\nThe company the Resnicks proposed taking public was very different from the one they had bought from Warner Communications. It now manufactured collectibles, not commemoratives. In 1993 it promoted over 950 products: jewelry, Christmas ornaments, plates, dolls, games, religious sculptures, miniature cars, Arthurian swords, Faberge-type eggs, scale model replicas of the Harley-Davidson Heritage Softail. There was also a magazine for collectors, Almanic. Coins represented less than three percent of the company's total business. Franklin Mint retail stores were opening and there were plans for catalogs, clothing, cosmetics, and perfume. By 1994, Franklin Mint had expanded to a 187-acre campus, and was housed in a facility larger than ten football fields. It also had employees in 20 countries.\n\nThe 1990s and Beyond\n\nWhile Stewart Resnick was seen to be the financial and organizational genius behind the transformation of Franklin Mint, Lynda Resnick was acknowledged as the marketing and aesthetic genius. Art collectors themselves, the Resnicks understood that people are passionate collectors. What they learned from their experience at Franklin Mint is that people collect by theme, such as wildflowers or dogs or movie stars, and by form--dolls, plates, games. With that knowledge, they saw the potential for crossover sales.\n\nLynda Resnick also had a keen feel for cultural trends, which she augmented with equally talented staff around the world. In the mid-1990s she began establishing licensing agreements, first with museums, including the Vatican Museum and the Louvre, and then with celebrities (or their estates), including Elvis. She added fashion designers, then moved to agreements with corporations, including Coca Cola, Campbell Soup, and Parker Bros., as well as movie companies. One reason the corporations found an agreement with Franklin Mint attractive was the company's advertising budget ($120 million in 1995) and range. Their ads in Parade, TV Guide, and USA Weekend magazines reached more than 70 million households each week.\n\nHowever, collectible sales were beginning to shift from direct marketing to retail and TV shopping. In 1995, top management from several companies left the collectible business. This included Tom Dorovsik, president of Franklin Mint, who joined U.S. Healthcare. Sales were strong but profits were weak and there appeared to be a need for more products.\n\nLynda Resnick's response was to buy Jackie Kennedy Onassis' faux pearls for $211,500 when Southeby's auctioned the former first lady's possessions in 1996. At the Franklin Mint, a replica of the pearls sold for $195 and was an immediate hit. Resnick also bought one of Princess Di's evening dresses, and displayed it in the museum. A version of the gown clothed the Mint's Princess Diana porcelain doll, which also sold for $195. As Resnick explained to David Richards in his 1998 article in The Washington Post, 'Nothing lasts. What the Franklin Mint does is create a permanence about the memories we have of the past.' Meanwhile, the company had expanded its retail operations to 50 stores .\n\nFranklin Mint began having some problems in 1997, when Tiger Woods sued the company after it produced a commemorative medal of his win in the 1997 Masters tournament. Franklin Mint paid Woods an undisclosed amount of money to settle the case. In May 1998, the estate of Princess Diana filed a lawsuit to keep Franklin Mint from profiting from the sale of commemorative Princess Di merchandise. In addition to the Diana porcelain doll and a commemorative plate, Franklin Mint sold a jeweled tribute ring and a diamond pendant. The case was not settled until January 2000, when the judge ruled in favor of Franklin Mint. In reality, Franklin Mint had donated over $4 million to charities supported by the late princess. The legal battles led to rumors that the Resnicks were considering selling Franklin Mint. The company quickly denied the reports.\n\nFor over 30 years, the Resnicks have been buying and building companies. In almost each case, their purchase has become the nation's or the world's largest operation in its specific field--pistachio production, processing and marketing; manufactured collectibles; flowers by wire; citrus production. With such an amazing record, Roll International was poised for continued success at the start of the new century.\n\nPrincipal Subsidiaries: The Franklin Mint; Paramount Farms; Paramount Farming Company; Paramount Citrus Association; Teleflora LLC; Bundy Properties.\n\nPrincipal Competitors: Lennox Collections; Bradford Exchange; Danbury Mint; FTD Inc.; 1-800-FLOWERS Inc."}, {"url": "https://www.referenceforbusiness.com/history2/32/Roll-International-Corporation.html", "page_content": "Roll International Corporation - Company Profile, Information, Business Description, History, Background Information on Roll International Corporation\n\n11444 West Olympic Boulevard, Tenth Floor\n\nLos Angeles, California 90064-1060\n\nU.S.A.\n\n\n\nHistory of Roll International Corporation\n\nRoll International Corporation, a private company, is made up of a collection of companies owned by husband-and-wife team Stewart and Lynda Resnick. The biggest and best known of the operations are the Franklin Mint, the world's largest collectibles company, and Teleflora LLC, the world's largest florist network. The other Roll subsidiaries are pistachio producer Paramount Farming Co., citrus grower and packer Paramount Citrus, processor and marketer Paramount Farms, and Bundy Properties, which owns and manages commercial properties in Los Angeles and Pennsylvania.\n\nForming a Holding Company in the 1960s\n\nThe Resnicks started their empire by buying Teleflora, a flowers-by-wire company. They then bought American Protection Industries Inc. (API), a security company. API Alarm Systems, which started in the 1960s, provided both patrols and alarm systems. The alarms, installed in retail, office, and industrial buildings as well as in houses, were connected to monitoring centers. If an alarm went off, an operator at the center could summon the closest police or fire department. By 1987, it was the largest alarm company in California.\n\nThe Resnicks made API their holding company, with API Alarm Systems another subsidiary. In 1989, they sold the subsidiary to the British company Automated Security Holdings plc (ASH) for $105 million. At that time, API Alarm Systems served some 21,000 customers and had seven central stations. The Resnicks, however, kept the API name. In 1993 they renamed their holding company Roll International after an agricultural company they had acquired.\n\nLate 1970s Addition of Teleflora LLC\n\nSending out-of-town flower orders by wire began in 1910 when two U.S. florists agreed to telegraph each other orders and then settle up on costs. Thus was born Florists' Transworld Delivery Association (FTD). In 1934, attorney Edwin S. Douglas founded a rival service. Originally called Telegraph Delivery Service, the name was changed to Teleflora. The Resnicks bought the California-based company in 1979 after it had changed hands several times.\n\nA year after the purchase, Lynda Resnick introduced the concept of keepsake containers and revolutionized the floral delivery business. Instead of just wiring a flower arrangement or a dozen flowers, people could order their flowers in a special vase or basket that the receiver could use after the flowers died.\n\nIn 1987, the company set up its Teleflora Technologies division, providing retail members a computer system with software specifically designed for florists, and Creditline, which allowed members to process credit card purchases immediately. The company also published an award-winning magazine for the retail floral business.\n\nBut by the early 1990s customers had options other than wire services for out-of-town orders. Toll-free telephone numbers were the biggest competition, although catalogs and online delivery services added to the problem. In 1993, Roll made the first of its three bids for FTD. A year later, the FTD board rejected Roll's final bid of $175 million, which consisted of $140 million in cash and taking over FTD's debt of $35 million. The merger would have positioned Roll to dominate the industry, but FTD announced it would instead accept a lower bid from Perry Capital Inc. The nonprofit florist cooperative became essentially a trade group representing member florists. The business ventures became part of FTD Inc., a for-profit corporation. One of the first initiatives of the new owners was the establishment of FTD.com, an online service for order flowers.\n\nTeleflora continued to look for acquisitions. In 1997, the company became the largest florist network in the country with the purchase of Redbook Florist Services. The next year it acquired Daisy Systems, which provided computerized shop-management systems to retailers. Building on those systems, Teleflora introduced its 'Teleflorist Online' service in October 2000. The new service offered Teleflora's 27,000 members professionally designed and managed web sites with e-commerce support such as credit card processing, e-mail gift reminders, and an online address book for customers. Unlike competitor FTD.com, Teleflora's approach was to help its members establish their own online businesses (with their own web sites) and to keep their own customers along with 100 percent of their revenue.\n\n1980s Entry into Agricultural Subsidiaries\n\nThe Resnicks moved into agribusiness in the mid-1980s. They first bought a citrus growing and processing operation near Bakersfield, California, which became Paramount Citrus Association. Paramount Citrus grew and packed fruit for both the retail and wholesale markets, selling oranges, lemons, apples, and grapefruit. The company sold much of its juice as Alpha-Beta.\n\nIn 1986, they purchased Apex Orchards from Mobil Oil for $30 million. The 12,000-acre pistachio and almond farm near Bakersfield was renamed Paramount Farming Co. The next year the Resnicks bought Texaco's central California farming operations, adding some 77,000 acres of farmland, also in the San Joaquin Valley.\n\nIn 1989 the Resnicks formed Paramount Farms, a processing and marketing group that sold pistachios and almonds under its own label as well as wholesale. Paramount Farms' nuts were soon selling across the country and internationally, primarily to cereal and candy manufacturers, including Cadbury, Nestle, Hershey, Carnation, and Kellogg. Over the years, Paramount Farms expanded its processing and marketing operations to include citrus, olives, and pomegranates. In 1993, Paramount Farms and the Pistachio Producers of California (PPC) formed a marketing co-op called Cal-Pure Pistachios and began offering pistachios under the Sunkist name. By 1996, Paramount Farms was the largest grower, processor, and marketer of almonds and pistachios in the world.\n\nBy the late 1990s, Paramount Citrus had become one of the state's largest citrus producers. In 2000, the company bought 3,912 acres and several packing houses from Dole Food Co. for $55 million. The purchase, which brought its total acreage of citrus to nearly 27,000, made Paramount Citrus the largest grower, packer, and marketer of fresh citrus in the country.\n\nAddition of The Franklin Mint\n\nIn 1964, Joseph Segal founded General Numismatics, a company devoted to producing and marketing commemorative coins, medals, and other metal objects. The company's first coin was a commemorative of General Douglas MacArthur. Segal, who paid a medal manufacturer $10,000 to make the MacArthur coin, advertised his product in collectors' magazines and was soon making $10,000 a month. Segal set up his own production facility and in 1965 took the company public and changed the company's name to Franklin Mint. Within two years, Segal had built a new headquarters and a modern mint and foundry near Media, Pennsylvania, a Philadelphia suburb. When Segal retired in 1973, Franklin Mint had sales of nearly $113 million and earnings of over $9 million as well as its own post office. Sales during the 1970s peaked in 1975 at $233.9 million. After that, sales dropped, although they remained in the $150--$200 million range throughout the decade.\n\nWarner Communications (now Time Warner) purchased The Franklin Mint and its Franklin Mint Museum in 1981, paying some $250 million for the operation. At that point, Franklin Mint became a subsidiary of Warner. In 1984, Warner sold a majority interest (70 percent) to the Resnick's American Protection Industries for $167.5 million. It retained the administration building, minting facilities, library, mailing center, and a retail store. Stewart Resnick became chairman and Lynda vice-chairman. In its first year of operation under the Resnicks, Franklin Mint had sales of about $250 million, but it lost money from 1988 through 1990. In 1991 it earned $9.1 million, about what its profits were when Segal retired in 1973.\n\nAs the Resnicks expanded Franklin Mint's offerings, they also set about making Franklin Mint Museum a tourist destination. The museum, which opened in 1973, contained about 7,000 square feet of exhibit space. A visitor could find the major items from the Franklin Mint offerings and trace popular tastes--pewter during the American Bicentennial, the growth of fantasy, and dolls, dolls, dolls. In the museum's gift shop, visitors could buy any of the items they had just viewed.\n\nIn 1992, the Resnicks were considering taking Franklin Mint public. They hoped to raise $100 million and use most of it to repay bank debt and interest owed to Time Warner. However, the stock sale was canceled. Allan Sloan, writing about the proposed public offering in The Washington Post, noted that Franklin Mint spent $140 million to make its products in 1991 and $184 million to market and promote them. Sales for 1991 were $538 million, more than 250 percent over its cost of goods.\n\nThe company the Resnicks proposed taking public was very different from the one they had bought from Warner Communications. It now manufactured collectibles, not commemoratives. In 1993 it promoted over 950 products: jewelry, Christmas ornaments, plates, dolls, games, religious sculptures, miniature cars, Arthurian swords, Faberge-type eggs, scale model replicas of the Harley-Davidson Heritage Softail. There was also a magazine for collectors, Almanic. Coins represented less than three percent of the company's total business. Franklin Mint retail stores were opening and there were plans for catalogs, clothing, cosmetics, and perfume. By 1994, Franklin Mint had expanded to a 187-acre campus, and was housed in a facility larger than ten football fields. It also had employees in 20 countries.\n\nThe 1990s and Beyond\n\nWhile Stewart Resnick was seen to be the financial and organizational genius behind the transformation of Franklin Mint, Lynda Resnick was acknowledged as the marketing and aesthetic genius. Art collectors themselves, the Resnicks understood that people are passionate collectors. What they learned from their experience at Franklin Mint is that people collect by theme, such as wildflowers or dogs or movie stars, and by form--dolls, plates, games. With that knowledge, they saw the potential for crossover sales.\n\nLynda Resnick also had a keen feel for cultural trends, which she augmented with equally talented staff around the world. In the mid-1990s she began establishing licensing agreements, first with museums, including the Vatican Museum and the Louvre, and then with celebrities (or their estates), including Elvis. She added fashion designers, then moved to agreements with corporations, including Coca Cola, Campbell Soup, and Parker Bros., as well as movie companies. One reason the corporations found an agreement with Franklin Mint attractive was the company's advertising budget ($120 million in 1995) and range. Their ads in Parade, TV Guide, and USA Weekend magazines reached more than 70 million households each week.\n\nHowever, collectible sales were beginning to shift from direct marketing to retail and TV shopping. In 1995, top management from several companies left the collectible business. This included Tom Dorovsik, president of Franklin Mint, who joined U.S. Healthcare. Sales were strong but profits were weak and there appeared to be a need for more products.\n\nLynda Resnick's response was to buy Jackie Kennedy Onassis' faux pearls for $211,500 when Southeby's auctioned the former first lady's possessions in 1996. At the Franklin Mint, a replica of the pearls sold for $195 and was an immediate hit. Resnick also bought one of Princess Di's evening dresses, and displayed it in the museum. A version of the gown clothed the Mint's Princess Diana porcelain doll, which also sold for $195. As Resnick explained to David Richards in his 1998 article in The Washington Post, 'Nothing lasts. What the Franklin Mint does is create a permanence about the memories we have of the past.' Meanwhile, the company had expanded its retail operations to 50 stores .\n\nFranklin Mint began having some problems in 1997, when Tiger Woods sued the company after it produced a commemorative medal of his win in the 1997 Masters tournament. Franklin Mint paid Woods an undisclosed amount of money to settle the case. In May 1998, the estate of Princess Diana filed a lawsuit to keep Franklin Mint from profiting from the sale of commemorative Princess Di merchandise. In addition to the Diana porcelain doll and a commemorative plate, Franklin Mint sold a jeweled tribute ring and a diamond pendant. The case was not settled until January 2000, when the judge ruled in favor of Franklin Mint. In reality, Franklin Mint had donated over $4 million to charities supported by the late princess. The legal battles led to rumors that the Resnicks were considering selling Franklin Mint. The company quickly denied the reports.\n\nFor over 30 years, the Resnicks have been buying and building companies. In almost each case, their purchase has become the nation's or the world's largest operation in its specific field--pistachio production, processing and marketing; manufactured collectibles; flowers by wire; citrus production. With such an amazing record, Roll International was poised for continued success at the start of the new century.\n\nPrincipal Subsidiaries: The Franklin Mint; Paramount Farms; Paramount Farming Company; Paramount Citrus Association; Teleflora LLC; Bundy Properties.\n\nPrincipal Competitors: Lennox Collections; Bradford Exchange; Danbury Mint; FTD Inc.; 1-800-FLOWERS Inc.\n\nChronology\n\nKey Dates:\n\n1979: Stewart and Lynda Rae Resnick buy Teleflora, LLC; Resnicks buy American Protection Industries and set it up as holding company.\n\nStewart and Lynda Rae Resnick buy Teleflora, LLC; Resnicks buy American Protection Industries and set it up as holding company. 1984: Resnicks buy Franklin Mint from Warner Communications Inc.\n\nResnicks buy Franklin Mint from Warner Communications Inc. 1985: Resnicks begin adding agriculture subsidiaries Paramount Citrus and Paramount Farming.\n\nResnicks begin adding agriculture subsidiaries Paramount Citrus and Paramount Farming. 1989: Resnicks sell API Alarm Systems; form Paramount Farms.\n\nResnicks sell API Alarm Systems; form Paramount Farms. 1993: Resnicks rename holding company Roll International Corporation.\n\nFurther Reference\n\nCarr-Brown, Jonathon, 'The Princess of Sales,' Ottawa CitizenNew York TimesAdvertising AgeCrain's Chicago BusinessAdvertising AgeForbesLos Angeles Business JournalLos Angeles TimesGuardianBakersfield CalifornianNew York PostWashington PostFresno BeeSacramento BeeFocusCrain's Detroit BusinessWashington PostSouthern California BusinessSports & Entertainment Litigation ReporterAmerican Metal MarketPhiladelphia Inquirer"}, {"url": "https://knowledge.wharton.upenn.edu/article/the-challenges-faced-by-family-owned-companies/", "page_content": "Fiscal pressures, the search for talent, international expansion. Family companies need to deal with a wide array of challenges. Without doubt, however, the most critical challenge involves generational change. More specifically, what happens when the third generation – the grandchildren of the founders of the company – takes over. How can companies deal with the opening of new markets and with globalization and growing competition from multinationals? How can companies that have a family character confront the professionalization of their structure? What does this mean for the debate about the meaning of a family dynasty on the daily management or about whether family owners should become mere shareholders?\n\nIn addition, what measures must a family company take in order to grow? What alternatives does it have so that it does not lose its competitiveness? What countries offer better opportunities for growth? All these questions were addressed during the Eleventh Congress of the Institute of the Family Enterprise, which took place for three days in the Spanish city of Valencia. Representatives of more than 300 Spanish family-owned companies participated.\n\nJuan Roure, a member of the International Advisory Board of IESE, participated in the event. He gave an interview to Universia-Knowledge at Wharton about the opportunities and challenges that family-owned companies face in the new international context.\n\nUniversia-Knowledge at Wharton: What are the main challenges that family owned companies face today? What are some of the solutions in the short and medium term?\n\nJuan Roure: Naturally, the challenges vary according to the size of the company and its level of development. On the one hand, we have several large family-owned corporations that are active on an international level, and which have made the transition from family company to a corporate family. They have professionalized their management boards, diversified their ownership and, in many cases, issued shares on the stock market that enable them to grow more easily and have liquidity…. In these cases, the challenge is for the family to maintain some institutions of governance; to have a family council and assembly as well as assets and cash that enable the family to promote and channel talent from within the family; to maintain strong and effective relationships between the business and these governing organs, that is to say, between the management board and groups of shareholders.\n\nOn the other hand, a great many family owned companies of small and midsize – as well as some large companies – have become more sensitive to these challenges thanks to the excellent work of the Institute of Family Companies and to regional associations. Nevertheless, the true challenge is to make the transition into family projects that enable them to free their talent and simultaneously maintain good relations between the members of the family. They need to move from the culture of a family enterprise to a culture of a corporate family. These enables them to overcome the “formal agreement syndrome” and have some governing organs of the enterprise and of the family (such as the management board and family council) and some forums that have maximum professionalism and seriousness that deal with both business matters as well as family matters. When it comes to the topics relevant to the board of directors, there is much room for improving efficiency.\n\nProgress has been made, but to the extent that I can perceive things, and my own experience and the research that I have carried out, there is a great shortage in the management and the regularity with which topics involving the family are treated. For example, when it comes to developing talent, [insufficient attention has been paid to such topics as] the arrival of family members in the business and their compensation; the planning for succession; representation [of family members] on the board of directors; and, in general terms, creating a family plan that has a vision and has values that are attractive for all its members.\n\nUnfortunately, many families seem to believe that they can solve all of their problems simply by asking a lawyer or consultant to draw up such an agreement. At times, it is not the most convenient thing to begin by signing an agreement and at other times, if you have an agreement, it does not help a great deal. For me, the key is to set up forums where, every month or two months, the various challenges of the business and the family are treated separately; where people respond to those challenges occasionally with external support, and with the goal of creating a plan that is attractive on both the family level and on the corporate level. And where, simultaneously, people continue to develop and carry out pacts that govern the smooth functioning of the family enterprise.\n\nFinally, the big challenge of every enterprise today, whether family owned or not, is globalization. Globalization provides more opportunities but also more competition than ever before.\n\nUKnowledge at Wharton: How would you compare conditions for family owned businesses in Europe with conditions in Latin America?\n\nJ. R: When it comes to Latin America, the situation is quite different in each country and, surely, quite different from Europe. The size of the market and sociopolitical uncertainties make it very different to compete in Latin America and in Europe. In Europe, we have a great opportunity [to do business] in Central and Eastern Europe. As for Latin America, the United States and such large countries as Brazil and Mexico are natural markets. Finally, Asia is a great opportunity as well as a great threat for both Europe and Latin America.\n\nUKnowledge at Wharton: Do family owned companies have the strength and financial resources to undertake ventures in foreign markets?\n\nJ.R: Several family-owned Spanish companies serve as extraordinary examples of international expansion such as Ferrovial, Entrecanales and OHL in the construction sector; Mango and Zara in the textile and apparel sector; Barcelo, Riu, Sol-Melia and Iberostar in the hotel sector; Roca, CELSA, and CH-Werfen, industrial companies; and Freixenet, Codorniz, Nutrexpa and Puig, which make consumer products. I think that the largest limitation is not a financial one. A good plan always attracts financing, especially today. The shortage is not about capital but about the ambition and the skill of the management team. Ownership must, through its governing organs, create a family business plan that is ambitious, and it must attract a management team that is capable of carrying it out.\n\nIn this sense, one problem that many family owned companies face is the challenge of growth, especially on an international scale. They have to have a management team that is a bit inflated and, to use a sports term, also “a good bench.” They may have the funding to construct a plant in the Czech Republic, or open a business office in the United States or acquire a company in India. But if you don’t have a strong managerial team and the confidence that they can manage things without affecting operations in the head office, you are lost. The easiest thing for many family-owned companies is to accept what gradual growth of the market means for their management team; even for those members of the family that work in the company. In many cases, this means maintaining the status quo and avoiding the risks, tensions and the training required for specific international growth projects. Sometimes, the other limitation that family companies confront is that international expansion means opening up the company to other owners, including through joint ventures. This is something that many families are hesitant to do.\n\nUKnowledge at Wharton: When it comes to choosing foreign destinations, what are the latest developments for Spanish companies in Latin America?\n\nJ.R: It depends on the sector. For example, hotel chains find that heading to the Caribbean is increasingly an extension of their service to the Balearic and Canary island chains, and they are pressured by their customers and tour operators to create a season that lasts 12 months.\n\nOther companies in the service and construction sectors have gone along with the big Spanish investors such as Telefonica, Endesa, Repsol YPF, BBVA and Santander.\n\nThe automobile suppliers have gone, above all, to Mexico and Brazil, because of the requests of the big brand manufacturers that have set up in those countries.\n\nFinally, in the consumer goods and retail sectors, companies have been naturally setting up operations that respond to the potential of each market and its linguistic and cultural ties [to Latin America].\n\nUKnowledge at Wharton: How does competition from China, India, Russia and Brazil affect these companies? Should they also outsource their production, the way that the multinationals are doing that?\n\nJ.R: Family owned companies are affected by competition from emerging countries and that is an essential consideration when it comes time to creating a strategy for the future. They need to manage that threat. However, they need to manage their opportunities. Nowadays, these countries are already extraordinary markets for companies in the industrial, service and consumer sector. Chains such as Mango, Zara and Ermengildo Zegna from Italy are enjoying a higher growth rate in these markets because they want to satisfy the needs of Chinese, Indian, Russian and Brazilian customers. If we compare ourselves with countries like Germany, Holland and France, companies from Spain – especially family-owned companies – are clearly behind when it comes to having a presence in emerging countries. If managers of family businesses want to compete better on the global playing field, they have to make a real effort at globalization. Responding to the various sectors and characteristics of their business, they need to establish a meaningful presence in emerging markets.\n\nIn this sense, a timely strategy of outsourcing can be an extraordinary competitive advantage, and a training ground in some of these markets, in order to compete more effectively in the country of origin.\n\nUKnowledge at Wharton: What do you need to consider when it is time to undertake a generational change [in management]?\n\nJ.R: Managing generational transitions is essential for family owned business because of the impact that it can have on its members and their ability to compete in the business in the future. Although this subject has been studied at length and there are certain general rules, you have to recognize that each family company is different.\n\nThe first thing you have to understand is that the succession process must be planned and managed. This process has a much higher probability of being a success in future generations that have developed some values, and where there is a family plan and there is sufficient training, and where some organs of corporate and family governance have been established in clearly written agreements. If all of these things do not exist, there is a lot of complexity. Nevertheless, it can help to be aware that this is a process, and to think that it can take between four and six years. The process is easier when the business is performing well, and when there is a clear strategy and an efficient board of directors. It also helps if there are no significant conflicts within the family and if the plan is clear. Another essential point is that the preparation and motivation of the people who are going to take control must be appropriate. In addition, you have to establish clear guidelines about the time-periods and conditions, and you have to meet benchmarks. The plan also has to be consistent, and must be rigorously monitored by an organization that has the authority required to correct it, and [the authority] to take measures that will vary according to the way things are developing. And it is prudent to have a contingency plan.\n\nAll of these things are not a substitute for good communication between the parties involved, nor for generosity and patience, and a capacity for negotiating and resolving conflicts in a constructive way. Given the complexity and the high stakes of the game — the potential economic and emotional costs — I recommend that companies ask for outside help.\n\nBarceló, a family owned hotel chain, offers a very good example of a successful process of managerial transition. I had the opportunity to watch closely as the IESE developed a case study focused on the relationship between generational change and the sustainability of the entrepreneurial spirit. The Barceló case dramatizes 75 years of corporate development and, in particular, the management of generational change that has served as a catalyst for growth, which is unlike the situation in many companies where families act to inhibit or destroy the company.\n\nWhen it was time to initiate the transition process from the second generation to the third, during the 1990s, Barceló was a hotel chain that had 37 hotels. By four years later, the period of time it took to make the transition, the chain had grown to 90 hotels with a staff of 6,000 employees. It had made significant progress in the structuring and professionalization of the company and its governing bodies, as well as relations between the company and the family. Ten years later, in 2005, the company had become one of Spain’s leading hotel companies, a chain that comprised 108 hotels, a network of travel agencies with 380 offices (Barceló Travel), and revenues that exceed one billion euros.\n\nThe generational transition process was planned so that it took between three and five years, and it involved a challenge of the first order for the family and the leadership of the company. From the outset, there were no mechanisms for adequately coordinating the managerial structure, and there no relationships between the management of the company and the family. And the functioning of the company’s institutions of governance was far from desirable. The generational transition process came at a time when the company was undergoing a high rate of growth. Its financial condition was strong, and it planned to expand into the Caribbean full-force and enjoy high profitability there.\n\nGiven the complexity of the business, it’s worth emphasizing that the process involved passing the leadership of the company from two brothers (who were responsible for the company’s initial growth) to a group of cousins, in which 11 members of the two family branches were involved. The process was orderly, and based on the following key premises: It dealt with the business development needs of the company and the professionalization of the company. It established the distribution of ownership, maintaining the control of management in three sons. It effectively incorporated a third generation into management, increasing that generation’s responsibility as owners, and letting go of those executives who did not do any work, with the exception of two co-presidents. It also established ways for the second generation to leave management.\n\nIt is also worth emphasizing that the process was very well planned, and relied on external support. It began with a phase when the philosophy of the company was formalized and communicated to employees. This process transmitted the values of the family to incoming generation. It developed specific channels for establishing contacts between the incoming generation, the outgoing generation, and the management of the company. It explained the results of an internal strategic plan, and formally established a management board composed of members of the second and third generation. It created a family council and, finally, created regulations based on a consensus among family members. The three key factors in the success of this exemplary transition can be helpful for other family-owned companies: First, the formalization of a corporate philosophy and a process for succession. Second, the planning of the process. Third, the creation of substitute activities for facilitating the departure of the second generation.\n\nUKnowledge at Wharton: How must relations between the family and the company be structured?\n\nJ.R: This is a major concern; a permanent concern for managers of family businesses. In a family business, the various interest groups – the family itself, the management team, and the ownership – all exercise their influence and power from day to day and over prolonged periods in the life of the company. Each one of them is a source of challenges and questions that can determine the emotional conditions that affect the process for planning and for making decisions in the company. Put differently, business decisions are constantly adjusting, or should be adjusting, to the family interests and to the interests of the company. Frequently, the two planes can conflict. In this kind of system, where questions that crop in one area wind up influencing other areas, one person or several people can belong to the three groups involved, which only leads to additional complexity. Moreover, conditions in the company and within the family are changing over time, and they determine the different needs and challenges in all the structures and governance processes of the company, no matter how formal the process is.\n\nIf you are trying to preserve equilibrium in every area of the company, and I assume that this is what family enterprises are trying to do, you have to find structures, arenas, forums and occasions where these points of view and perspectives – which are potentially divergent – can be resolved and reconciled on the basis of respect and tolerance. Another factor is the amount of definition and formalization, which depends again on each company and each family.\n\nIt is good to make an effort to provide separate realms for resolving those questions that are specifically family-related and those that involve the company. If you progress in formalizing a structure for corporate governance and, in particular, for the family, you must have a clear separation of the functions that these organizations exercise. Communication between these two areas is fluid, which is good, but we must not be confused by a clear delimitation of these tasks. You derive an advantage by avoiding the introduction of family questions into the work done by managers or by the company’s board of directors. Not resolving this separation carries some costs – and considerable problems – when it comes to the functioning of the family and the enterprise.\n\nThe family council must concern itself with how to share the vision and the values of the family and the company; how to train and retain future generations [of managers]; how to manage the arrival and departure of family members and non-family members; how to plan for the professionalization of family members and how to compensate them; how to tackle the process of succession; how to prepare shareholders in the family for the responsibilities of ownership and governance. It must also determine which family members and non-family members have a role on the board of directors, and it must develop regulations or carry out those regulation that already exist. It must determine which dividend strategies are most appropriate, policy for investments by family members in new businesses – and so forth. In contrast, the board of directors should deal with the strategy of the company; the nature and development of the management team; strategic moves for making acquisitions and engaging in joint ventures; evaluating risks; financial policies; and, obviously, approving the accounting results, among other concerns.\n\nCreating formal rules is a process that helps to improve relationships between the company and the family. By extension, it also helps the way governance bodies function in every realm of activity. However, it is neither a panacea nor an absolute necessity."}, {"url": "https://hbr.org/2012/11/what-you-can-learn-from-family-business", "page_content": "Though these practices come more naturally to executives who feel an obligation to be stewards for the next generation, executives at any corporation can adopt them. Indeed, the researchers uncovered a number of nonfamily-controlled companies that mimicked the behaviors of family firms and saw very similar patterns of performance.\n\nFamily-controlled companies surpass their peers because they focus on resilience, not short-term results. During economic booms, this approach leads them to forgo some opportunities (and hence do slightly worse than their counterparts), but it puts them in a position of strength during downturns, when they shine. The researchers identified seven specific ways in which family-run businesses build their resilience:\n\nThough the term “family business” may call to mind visions of local mom-and-pop firms, family-controlled companies play a huge role on the global stage. Not only do they include sprawling corporations like Walmart and Tata Group, but they account for more than 30% of all companies with sales in excess of $1 billion. And over the long term, their financial performance exceeds that of traditional public companies, according to a new study by BCG and École Polytechnique.\n\nTo many, the phrase “family business” connotes a small or midsized company with a local focus and a familiar set of problems, such as squabbles over succession. While plenty of mom-and-pop firms certainly fit that description, it doesn’t reflect the powerful role that family-controlled enterprises play in the world economy. Not only do they include sprawling corporations such as Walmart, Samsung, Tata Group, and Porsche, but they account for more than 30% of all companies with sales in excess of $1 billion, according to the Boston Consulting Group’s analysis.\n\nConventional wisdom holds that the unique ownership structure of family businesses gives them a long-term orientation that traditional public firms often lack. But beyond that, little is known about exactly what makes family businesses different. Some studies suggest that, on average, they outperform other businesses over the long term—but other studies prove the opposite.\n\nTo settle that question, we and Sophie Mignon, an associate researcher at the Center for Management and Economic Research at École Polytechnique, compiled a list of 149 publicly traded, family-controlled businesses with revenues of more than $1 billion. They were based in the United States, Canada, France, Spain, Portugal, Italy, and Mexico. In each business a family owned a significant percentage, though not necessarily a majority, of the stock, and family members were actively involved both on the board and in management. We then created a comparison group of companies from the same countries and sectors, which were similar in size but not family controlled. (We didn’t look at Asian companies because so many of them are family controlled that it’s difficult to find a suitable comparison group.) Then we did a rigorous analysis of the ways in which those two sets of companies were managed differently and how that affected performance.\n\nOur results show that during good economic times, family-run companies don’t earn as much money as companies with a more dispersed ownership structure. But when the economy slumps, family firms far outshine their peers. And when we looked across business cycles from 1997 to 2009, we found that the average long-term financial performance was higher for family businesses than for nonfamily businesses in every country we examined.\n\nThe Long-Term View of Family-Business Performance Though family-run companies slightly lag their peer group when the economy booms, they weather recessions far better.\n\nThe simple conclusion we reached is that family businesses focus on resilience more than performance. They forgo the excess returns available during good times in order to increase their odds of survival during bad times. A CEO of a family-controlled firm may have financial incentives similar to those of chief executives of nonfamily firms, but the familial obligation he or she feels will lead to very different strategic choices. Executives of family businesses often invest with a 10- or 20-year horizon, concentrating on what they can do now to benefit the next generation. They also tend to manage their downside more than their upside, in contrast with most CEOs, who try to make their mark through outperformance.\n\nAt a time when executives of every company are encouraged to manage for the long term, we believe that well-run family businesses can serve as role models. In fact, in our research we were able to identify several companies with dispersed ownership whose strategies mimicked those of family firms. Those companies also exhibited a similar performance pattern: below their peers during upturns but leading the pack in times of crisis. (See the sidebar “It Operates Like a Family Business—but It’s Not.”)\n\nIt Operates Like a Family Business—but It’s Not It makes sense that family-controlled companies would focus on resilience instead of performance, but why can’t other companies mimic that strategy? In fact, some do. Consider Nestlé. It follows most of the golden rules of family firms. It slightly underperformed its three major competitors during the economic expansions of 1997–1999 and 2003–2007—but consistently outperformed them in periods of financial stress and crisis. Its leverage is lower: Debt accounts for 35% of its capitalization, versus an average of 47% among its competitors. Nestlé relies less on acquisitions: Annually, newly acquired businesses account for an average of 3.9% of its revenues, versus an average of 7.8% for its competitors. Nestlé is also the most diversified of the world’s four food giants, in terms of both geography (67% of its sales come from outside its home region, compared with 56% for its competitors) and product lines (which range from pet food to beverages, and from confectionary to pharmaceuticals). Nestlé is not a unique example. Essilor, the world leader in optical lenses, is another nonfamily firm that mimics these behaviors. It has a culture of cost consciousness, maintains a very low level of debt, and has little staff turnover. Essilor is highly international—and has made many small acquisitions close to the core rather than pursuing big deals. Like Nestlé, it has weathered the recent downturn exceptionally well. In the United States, Johnson & Johnson isn’t a family-owned business, but it acts like one, with a low debt-to-equity ratio, a product line that allows its PR people to tout it as “the most diversified global health care company,” and a skepticism toward the large transformational mergers that other pharma players routinely attempt. For years managers have been advised to “think like an owner.” The rules of family business show how to translate that thinking into actual strategies. What Nestlé and other nonfamily companies prove is that it’s possible to benefit from these rules regardless of ownership structure.\n\nSo how do family-run firms manage for resiliency? We’ve identified seven differences in their approach:\n\n1: They’re frugal in good times and bad.\n\nAfter years of studying family businesses, we believe it’s possible to identify one just by walking into the lobby of its headquarters. Unlike many multinationals, most of these firms don’t have luxurious offices. As the CEO at one global family-controlled commodity group told us, “The easiest money to earn is the money we haven’t spent.” While countless corporations use stock grants and options to turn managers into shareholders and minimize the classic principal-agent conflict, family firms seem imbued with the sense that the company’s money is the family’s money, and as a result they simply do a better job of keeping their expenses under control. If you examine company finances over the last economic cycle, you’ll see that family-run enterprises entered the recession with leaner cost structures, and consequently they were less likely to have to do major layoffs.\n\n2: They keep the bar high for capital expenditures.\n\nFamily-controlled firms are especially judicious when it comes to capex. “We have a simple rule,” one owner-CEO at a family firm told us. “We do not spend more than we earn.” This sounds like simple good sense, but the reality is, you never hear those words uttered by corporate executives who are not owners. The owner-CEO added: “We make roughly €450 million of free cash flow every year, so we try to spend no more than €400 million per year, and we keep the balance for rainy days.”\n\nAt most family firms, capex investments have a double hurdle to clear: First a project must provide a good return on its own merits; then it’s judged against other potential projects, to keep spending under the company’s self-imposed limit. Because they’re more stringent, family businesses tend to invest only in very strong projects. So they miss some opportunities (hence their underperformance) during periods of expansion, but in times of crisis their exposure will be limited because they’ve avoided borderline projects that may turn into cash black holes.\n\n3: They carry little debt.\n\nIn modern corporate finance a judicious amount of debt is considered a good thing because financial leverage maximizes value creation. Family-controlled firms, however, associate debt with fragility and risk. Debt means having less room to maneuver if a setback occurs—and it means being beholden to a nonfamily investor. The firms we studied were much less leveraged than the comparison group; from 2001 to 2009, debt accounted for 37% of their capital, on average, but for 47% of the nonfamily firms’ capital. As a result, the family-run companies didn’t need to make big sacrifices to meet financing demands during the recession. “People think we are rich and courageous,” one executive from a family firm told us, “but in fact we are cowardly—we leave most of the cash in the company to avoid giving away too much power to our banks.”\n\n4: They acquire fewer (and smaller) companies.\n\nOf all the plays a manager can make, a sparkly transformational acquisition may be the hardest to resist. It carries high risks but can pay large rewards. Many family businesses we studied eschewed these deals. They favored smaller acquisitions close to the core of their existing business or deals that involved simple geographic expansion. There were significant exceptions to this rule—when the family was convinced that its traditional sector faced structural change or disruption or when managers felt that not participating in industry consolidation might endanger the firm’s long-term survival. But generally, family companies aren’t energetic deal makers. On average, we found, they made acquisitions worth just 2% of revenues each year, while nonfamily businesses made acquisitions worth 3.7%—nearly twice as much. Family businesses prefer organic growth and will often pursue partnerships or joint ventures instead of acquisitions. As the HR director of a leading family-owned luxury goods company described it: “We don’t like big acquisitions—they represent too much integration risk, you may get the timing wrong and invest just before a downturn, and more importantly, you may alter the culture and fabric of the corporation.”\n\n5: Many show a surprising level of diversification.\n\nPlenty of family-controlled companies—such as Michelin and Walmart—remain focused on a core business. But despite a generation’s worth of financial wisdom that diversification is better done by individual investors than at a corporate level, we found a large number of family businesses—such as Cargill, Koch Industries, Tata, and LG—that were far more diversified than the average corporation. In our study 46% of family businesses were highly diversified, but only 20% of the comparison group were. Some family firms had expanded into new lines of business organically; others had acquired small entities in new fields and built on them. The CEOs we spoke with say that as recessions have become deeper and more frequent, diversification has become a key way to protect the family wealth. If one sector suffers a downturn, businesses in other sectors can generate funds that allow a company to invest for the future while its competitors are pulling back.\n\n6: They are more international.\n\nFamily-controlled companies have been ambitious about their overseas expansion. They generate more sales abroad than other businesses do; on average 49% of their revenues come from outside their home region, versus 45% of revenues at nonfamily businesses. But family businesses usually achieve foreign growth organically or through small local acquisitions—without big cash outlays. And they are very patient once they enter a new market. “We accepted that we’d lose money in the U.S. for 20 years, but without this persistence we would not be the global leader today,” says one executive from a family-run global consumer products company.\n\n7: They retain talent better than their competitors do.\n\nRetention at the family-run businesses we studied was better, on average, than at the comparison companies; only 9% of the workforce (versus 11% at nonfamily firms) turned over annually.\n\nThe leaders of family companies extol the benefits of longer employee tenures: higher trust, familiarity with coworkers’ behaviors and decision making, a stronger culture. These businesses have a lot in common with what the academics Karlene Roberts and Karl Weick call “high-reliability organizations,” in which long-serving teams of specialists develop efficient team dynamics and a collective mind-set that helps them achieve goals. Says the CEO of one $10 billion diversified group: “We don’t have the smartest guys out there, but they know their job like nobody else, and when a problem hits they can act immediately as a team—one that has been there before.”\n\nInterestingly, family businesses generally don’t rely on financial incentives to increase retention. Instead, they focus on creating a culture of commitment and purpose, avoiding layoffs during downturns, promoting from within, and investing in people. In our study we found that they spent far more on training: €885 a year per employee on average, versus an average of €336 at nonfamily firms.Examine these seven principles, and it becomes clear how coherent and synergistic they are: Adhering to one of them often makes it easier to follow the next. Frugality and low debt help reduce the need for layoffs, thus improving retention. International expansion provides a natural diversification of risks. Fewer acquisitions mean less debt. Money saved through frugality is invested wisely if the company keeps a high bar on capital expenditures. Instead of working in isolation, these principles reinforce one another nicely.\n\nWhen we talk with executives at family-controlled firms, they speak derisively about competitors who “bet the farm” or “swing for the fences.” They talk about what keeps them up at night. Though they realize they are missing opportunities by being overly prudent, they hope to generate superior returns over time as business cycles turn from good to bad.\n\nIt’s evident that those cycles are speeding up. If that trend continues, the resilience-focused strategy of family-owned companies may become more attractive to all companies. In a global economy that seems to shift from crisis to crisis with alarming frequency, accepting a lower return in good times to ensure survival in bad times may be a trade-off that managers are thrilled to make."}, {"url": "https://www.roll-call.com/about/our-team/", "page_content": "×\n\nTyler Schaeffer\n\nAs the Vice President of IRC, Tyler works within every aspect of IRC’s specialties such as customer relations, business management, sales, development of new products, and support etc. Before taking on the role of Vice President, Tyler started off at IRC as a part time technician over 10 years ago and over the years he spent a great deal of time being mentored by IRC’s senior experienced team members, learning all of IRC’s new and existing products like the hi-resolution LED displays, xmLegislator.NET™ Voting Software, SCU-9000 and VSCU-1000 member desk voting solutions etc. Through hard work, dedication, and continued experience he became well versed in all of IRC’s inner workings, laying the foundation for his ascension to his current position of Vice President. To this day he continues to work closely with our clients whether it be through providing on-site and remote support, overseeing new installations, sales or commissioning of IRC’s new products, or learning more about each client’s unique legislative process. He is devoted to expanding his knowledge of the legislative process in order to discover better ways to improve the user experience for all IRC clients and maximizing the capabilities of current technology or laying the groundwork for the future. When not spearheading projects or policy for IRC, Tyler loves to travel, most notably to historic landmarks, achieving his goal to visit all 50 state capitols (4 left) and (since he is a passionate fan of Formula 1) other countries where F1 races are held."}, {"url": "https://www.company-histories.com/Beloit-Corporation-Company-History.html", "page_content": "Statistics:\n\n1 St. Lawrence AvenueBeloit, Wisconsin 53511U.S.A.(608) 365-3311(608) 364-70131858 as The Merrill and Houston Iron Works7,500$712.8 million3554 Paper Industries Machinery\n\nBeloit Corporation is the world's leading manufacturer of papermaking machinery. An estimated 70 percent of the world's newsprint, writing, and printing-grade paper is produced on machines made by Beloit, as is an estimated 50 percent of the world's napkins, paper towels, and tissues. Besides manufacturing paper and paperboard machines, the company has a substantial business rebuilding these machines and providing parts and service. Beloit also produces equipment and systems for pulp manufacturing, paper stock preparation, deinking, and recycled fiber and wood chip processing. The company has the industry's largest installed equipment base and operates plants in the United States, Italy, England, Brazil, Poland, and Canada. Beloit licensees also operate plants in Australia, China, France, Italy, Japan, Spain, and India. Beloit's machines are considered the \"Cadillac\" of the industry; the company is responsible for many major advances in papermaking technology, and its machines hold numerous records for speed.\n\nThe company was founded in 1858 in Beloit, Wisconsin, by partners Orson E. Merrill and George Houston. Their firm, The Merrill and Houston Iron Works, principally manufactured a waterwheel that had been developed by George Houston, but it also made iron products including saws, augers, spokes, iron and steel castings, and horseshoe nails. The Merrill and Houston Iron Works got its first order for papermaking machinery from Orson Merrill's brother, who owned a paper mill on the nearby Rock River. He had bought his paper machine in New England, but rather than order parts from the eastern manufacturer he asked if Merrill and Houston could make them. Soon other area paper mills also placed orders for parts, and by 1862 Merrill and Houston was building complete paper machines. The company continued to produce its waterwheels and other iron products while it built several paper machines a year, from four in 1862 to 14 in 1884.\n\nIn spite of this steady business, The Houston and Merrill Iron Works ran into financial difficulties. The company changed hands several times until it landed in receivership in 1882. The plant continued to operate in order to pay off its debts. The assets of the company were sold to a Janesville, Wisconsin, businessman in January 1885 for $20,000. Later that year, four employees of Merrill and Houston formed an association to lease back from the purchaser most of the plant and property. Under the name Beloit Iron Works, the former employees put the plant back in business. Fred Messer, who had been a superintendent at Merrill and Houston, became president, and the other officers of the new company included a lathe operator, a draftsman, and a former boss erector. These four, along with ten employees, turned the company around. In its first year Beloit Iron Works had sales of nearly $20,000, and by 1889 the company employed 100 people. Beloit filled many orders for paper machine parts and soon advertised that it could build a complete paper machine every 30 days.\n\nBy 1889 Beloit's officers had bought back all the property of the old Houston and Merrill company. Orders for parts, rebuilds, and new paper machines came from all over the Midwest, Canada, and even Texas. Beloit built and installed a paper machine at the Chicago World's Fair of 1893 and won a United States Columbian Award. This exposure bolstered Beloit's reputation in the United States, and its name became known abroad as well. The company plowed money back into the plant in order to keep up with changing technology. Its paper machines became larger and faster, and around the turn of the century they sold for between $25,000 and $30,000 each. Beloit sold a machine to Japan in 1897, two to China in 1900, and the company continued to lead the industry over the next dozen years.\n\nThe paper industry grew rapidly, and sales at Beloit increased. The company expanded its facilities and modernized its tools and machine shop in the 1920s to make ever larger machines. The first paper machines the company had made had been only 30 inches wide; the machines of the 1920s were wider than 160 inches. As sales surged, Beloit became a large employer, with a peak of 550 workers in 1930. Alonzo Aldrich, one of the original four founders of Beloit Iron Works and president since 1889, presided over the good times. Aldrich died in 1931, and the presidency passed to his son-in-law, Elbert Neese Sr., who had been a manager at Beloit since 1916. The first year of his presidency coincided with the nadir of the Great Depression. Orders were next to nothing, and over two-thirds of Beloit's workers were let go. But the company recovered gradually, and by 1937 it employed more workers than in 1930. When the United States entered World War II, Beloit turned its production from paper machines to machines for war materials. It built lathes and boring mills, even engines for the Navy. Beloit workers became unionized for the first time, becoming members of the International Association of Machinists.\n\nAfter the war Beloit went back to manufacturing papermaking machines. The company added buildings and equipment to make newer machines that broke existing records for speed and production. As Beloit returned to prosperity, it began to expand. In 1949 Beloit opened a sales office in Paris. About one-fifth of Beloit's shipments were overseas in the 1950s, and the company began to acquire plants abroad. In 1957 Beloit bought an Italian operation, which it named Beloit Italia SpA. Further international expansion included a plant in England, Beloit Walmsley Ltd., in 1960; a Canadian branch in 1962; and a Spanish operation in 1963. In the United States Beloit opened sales offices in Portland, Oregon, and Mobile, Alabama, in the 1950s and acquired several paper equipment manufacturers in Pennsylvania.\n\nWhile continuing to expand internationally in the 1960s with new projects in Poland and India, Beloit began to diversify its product line somewhat. The company changed its name in 1962 from Beloit Iron Works to Beloit Corporation in order to reflect its changing business. Beloit experimented with manufacturing machinery for use in the plastics industry and other nonpaper industries. The company eventually deemed these diversification projects unsuccessful. When the paper industry slowed down between 1970 and 1972 Beloit had very few orders to fill. Though business picked up dramatically in the next two years, surging inflation in 1974 had dire effects. That year the company lost money for the first time since its reorganization in 1885. However, Beloit quickly recovered and entered one of its most profitable periods beginning in 1975.\n\nElbert Neese Sr. had died in 1961, and he was succeeded as president by Harry Moore. Moore was president until 1974, when Elbert Neese Jr. took the post (Moore was elevated to chairman). Beloit continued to diversify, acquiring a farm, an insurance company and a railroad in the 1970s. Though these were ultimately unsuccessful projects, creating a financial drain, Beloit still made significant advances in its core business--paper machinery. Beloit's Jones Division in Dalton, Massachusetts, expanded its facilities in order to research new paper industry technology such as refiner mechanical pulp production and newspaper deinking. In 1977 Beloit developed computer-aided drafting and computer-aided manufacturing (CAD/CAM) technology to automate its machinery design process. Because Beloit's papermaking machines were custom built, the design process for each order required sometimes thousands of drawings, and so the CAD/CAM development increased the company's productivity enormously. Beloit also acquired more businesses in the 1970s, including the Lenox Machine Company, which manufactured winders and sheeters for the paper industry, and another specialized paper industry manufacturer, the Rader Companies. In 1977 Beloit spent $12 million to acquire the Roll Covering Division of Raybestos Manhattan, which became Beloit Manhattan. This company chalked up about $8 million in sales, but it suffered very little from the ups and downs of the business cycle that affected Beloit, a big advantage. Manhattan's acquisition added stability to Beloit, and in less than ten years Manhattan's sales were close to $50 million. Beloit also acquired minority shareholdings in some of its overseas plants in the 1970s, and in 1978 it began construction on a manufacturing division in Brazil, Beloit-Rauma.\n\nElbert Neese Jr. became chairman of Beloit in 1984, with Thomas McKie succeeding him as president. Then, in 1985, Neese announced the Neese family wished to sell the Beloit Corporation. The business had been closely held for more than a century. When plans for the sale were announced, over 30 companies in the United States, Europe, and Japan expressed an interest. After only a few months, a deal was struck with Milwaukee-based Harnischfeger Corp., a maker of mining and earth-moving equipment. Harnischfeger paid $175 million for Beloit Corp. At the time, Beloit had sales of $483 million, with 18 plants in five countries and 6,300 employees. Harnischfeger boasted 1985 sales of $484 million. Harnischfeger's president and chief executive officer, William W. Goessel, had spent 32 years as a Beloit executive before he moved to Harnischfeger in 1982, and so he understood Beloit's business very well. After the acquisition by Harnischfeger, Beloit restructured its operations to concentrate more closely on pulp and paper industry equipment. Shortly after the sale to Harnischfeger, Beloit's Japanese licensee, Mitsubishi Heavy Industries Ltd., bought a 20 percent interest in Beloit.\n\nJohn A. McKay became Beloit's new president in November 1986. The next year, Beloit formed a strategic alliance with Measurex Corp., an industrial process control company, to develop online computer controls and computer integrated manufacturing systems for the paper industry. Paper machine technology was advancing rapidly, and consumers were demanding higher-quality products. The alliance with Measurex allowed Beloit to offer its customers highly sophisticated control systems using artificial intelligence. Beloit also spent millions of dollars on research and development and maintained three research centers: a main one in Rockton, Illinois, another in Pittsfield, Massachusetts, and a third in Bolton, England.\n\nThe late 1980s saw a boom in the paper industry. Paper companies were making record profits, and Beloit employed two shifts of engineers to keep up with equipment orders. Because Beloit had so much equipment installed around the world, it also had a large and profitable business in spare parts and rebuilds. The company reinvested much of its profit in upgrading equipment. Harnischfeger spent close to $26 million in 1987, mostly to restructure, retool, and modernize Beloit plants. The Beloit, Wisconsin, plant was gutted and refitted with new machine tools; the Beloit Manhattan facility and a plant in Canada were similarly modernized. Beloit also overhauled its spare parts operation. By 1987 Beloit's spare parts storage area was completely computerized and running without a single human worker inside the area. Beloit's customers had computer access to the spare parts inventory and could place an order directly with the storage area for immediate automatic retrieval and shipping. The first year this system was in place Beloit's spare parts business increased 40 percent. The company installed the system in its Canadian and European plants as well.\n\nBusiness in the late 1980s was so good that it created a backlog, and orders took 18 months to fill. The price for a new paper machine was close to $50 million, though only a few years earlier the price had been between $10 and $15 million. Not surprisingly, 1988 was a record year for Beloit. Sales increased 42 percent over the previous year, to $697 million. The company handled approximately 45 major rebuild projects and had a similar number of orders for new equipment. Beloit had five divisions worldwide capable of making a complete paper machine, and each was working at top capacity. Beloit had about $952 million in bookings for 1988 and, including Beloit's licensees, bookings topped $1 billion. Beloit also handled its first project in the Soviet Union and explored the China market through a joint venture. The company continued to plow money back into plants, investing another $12.7 million in facilities and equipment in Wisconsin. New tools enabled Beloit to produce paper machines over 400 inches wide, as its customers were requiring.\n\nBeloit continued to expand its manufacturing capabilities in the 1990s. In 1991 the company acquired an 80 percent equity in a Polish paper machine manufacturer, which it renamed Beloit Poland S.A. in 1993. Beloit also acquired a Wisconsin manufacturer of refiner plate in 1992 and entered a joint venture in 1994 with a German paper machinery manufacturer, Jagenberg AG. Beloit also acquired a paper machine optical alignment and inspection services company, OASIS Inc., in 1994.\n\nBeloit had experienced trouble with patent infringement from European competitors, and in the 1980s it had filed patent infringement suits . After almost ten years in various courts, the lawsuits were resolved in Beloit's favor. In May 1993 Beloit was awarded $17.2 million in damages after a federal court found a German manufacturer, J. M. Voith GmbH, had infringed Beloit's paper drying technology patents. And in November 1994 Beloit was awarded $7.9 million in damages in a patent infringement case involving a Finnish competitor, Valmet Corp.\n\nRecycling became an increasingly important part of the paper industry in the 1990s, and Beloit positioned itself to take advantage of this trend. The company began constructing small paper mills, called minimills, to make recycled paper out of used corrugated boxes. Beloit had long been a leader in deinking and recycling technology. The challenge of the minimills was that they generally had to be located in an urban area in order to be close to a used paper source, limiting access to the large amounts of water that traditional mills used for processing. Beloit opened a recycling minimill in Montville, Connecticut, in 1994 and built another near Oswego, New York. Beloit also entered a consortium of three companies in 1994 to construct and operate urban minimills. The consortium pooled the resources of Hoffman Environmental Systems, a company that developed no-discharge water technology, as well as Ogden Projects, which ran the completed mills, and Beloit, which built the recycling machinery. This was expected to be an area of rapid expansion for Beloit in the future.\n\nPrincipal Subsidiaries:Beloit Canada Ltd./Ltee.; Beloit Industrial Ltda. (Brazil); Beloit Poland S.A.; Beloit Technologies Inc.; BWRC, Inc.; Beloit Italia SpA (Italy); Beloit Lenox Europe GmbH (Germany); Beloit Walmsley Limited (United Kingdom); J&L Fiber Services, Inc.; Optical Alignment systems & Inspection Serv., Inc.; Sandusky International Inc.\n\nAhn, C. R., \"Spare Parts and Service Simplified by Computerized Ordering System,\"September 1987, pp. 107--10.\"Alliance: Industry Suppliers Try Unique Approach to Consolidation,\"August 1987, pp. 172--76.\"Beloit Sold for $175 Million to Harnischfeger,\"April 1986, p. 21.\"Beloit Wins Valmet Appeal; Sues Voith, Chesapeake,\"March 1985, pp. 35--37.\"Customized CAD/CAM's Aid Machinery Manufacturer's Drawing Ability,\"September 1987, pp. 72--73.Evans, John C. W., \"Beloit-Jones Research Center Boasts Latest in TMP Equipment,\"April 1976, pp. 116--17.\"Harnischfeger Acquires Beloit,\"April 1, 1986, p. 6.\"Harnischfeger Expects Lower Fiscal '93 Profit Than Analysts Predict,\"January 14, 1993, p. B4.\"Harnischfeger Industries, Inc.: Beloit Unit Wins $7.9 Million in Patent-Infringement Case,\"November 29, 1994, p. B6.\"Harnischfeger to Sell 20% Holding in Unit to Japanese Concern,\"October 27, 1986, p. 11.\"Harnischfeger Wins Damages,\"May 25, 1993, p. C22.Kansas, Dave, \"Mills for Recycled Paper Head to the Big City,\"January 21, 1994, p. B1.Patrick, Ken, \"Beloit's Future Looks Bright, Steady Growth Expected by Harnischfeger,\"May 1986, pp. 66--69.------ \"Expansion Pace Puts Heavy Demands on Manufacturers,\"April 1989, pp. 74--77.\"TC: Valmet Didn't Infringe U.S. Patent,\"June 1984, p. 39.\n\nSource: International Directory of Company Histories, Vol. 14. St. James Press, 1996."}]}