{"Ayn Rand was known for two best-selling novels, The Fountainhead and Atlas Shrugged, and for developing a philosophical system she called Objectivism.": [{"url": "https://www.biography.com/authors-writers/ayn-rand", "page_content": "(1905-1982)\n\nWho Was Ayn Rand?\n\nAyn Rand moved to the United States in 1926 and tried to establish herself in Hollywood. Her first novel, We the Living (1936), championed her rejection of collectivist values in favor of individual self interest, a belief that became more explicit with her subsequent novels The Fountainhead (1943) and Atlas Shrugged (1957). Following the immense success of the latter, Rand promoted her philosophy of Objectivism through courses, lectures and literature.\n\nEarly Years\n\nAyn Rand was born Alissa Zinovievna Rosenbaum on February 2, 1905, in St. Petersburg, Russia. The oldest daughter of Jewish parents (and eventually an avowed atheist), she spent her early years in comfort thanks to her dad's success as a pharmacist, proving a brilliant student.\n\nIn 1917, her father's shop was suddenly seized by Bolshevik soldiers, forcing the family to resume life in poverty in the Crimea. The situation profoundly impacted young Alissa, who developed strong feelings toward government intrusion into individual livelihood. She returned to her city of birth to attend the University of Petrograd, graduating in 1924, and then enrolled at the State Institute for Cinema Arts to study screenwriting.\n\nGranted a visa to visit relatives in Chicago, Alissa left for the United States in early 1926, never to look back. She took on her soon-to-be-famous pen name and, after a few months in Chicago, moved to Hollywood to become a screenwriter.\n\nEarly Writing Career\n\nFollowing a chance encounter with Hollywood titan Cecil B. DeMille, Rand became an extra on the set of his 1927 film The King of Kings, where she met actor Frank O'Connor. They married in 1929, and she became an American citizen in 1931.\n\nRand landed a job as a clerk at RKO Pictures, eventually rising to head of the wardrobe department, and continued developing her craft as a writer. In 1932, she sold her screenplay Red Pawn, a Soviet romantic thriller, to Universal Studios. She soon completed a courtroom drama called Penthouse Legend, which featured the gimmick of audience members serving as the jury. In late 1934, Rand and her husband moved to New York City for its production, now renamed Night of January 16th.\n\nAround this time, Rand also completed her first novel, We the Living. Published in 1936 after several rejections, We the Living championed the moral authority of the individual through its heroine's battles with a Soviet totalitarian state. Rand followed with the novella Anthem (1938), about a future collectivist dystopia in which \"I\" has been stamped out of the language.\n\n'The Fountainhead' and 'Atlas Shrugged'\n\nIn 1937, Rand began researching a new novel by working for New York architect Ely Jacques Kahn. The result, after years of writing and more rejections, was The Fountainhead. Underscoring Rand’s individualistic underpinnings, the book’s hero, architect Howard Roark, refuses to adhere to conventions, going so far as to blowing up one of his own creations. While not an immediate success, The Fountainhead eventually achieved strong sales, and at the end of the decade became a feature film, with Gary Cooper in the role of Roark.\n\nRand's ideas became even more explicit with the 1957 publication of Atlas Shrugged. A massive work of more than 1,000 pages, Atlas Shrugged portrays a future in which leading industrialists drop out of a collectivist society that exploits their talents, culminating with a notoriously lengthy speech by protagonist John Galt. The novel drew some harsh reviews, but became an immediate best seller.\n\nObjectivism and Later Years\n\nAround 1950, Rand met with a college student named Nathan Blumenthal, who changed his name to Nathaniel Branden and became the author's designated heir. Along with his wife, Barbara, Braden formed a group that met at Rand's apartment to engage in intellectual discussions. The group, which included future Federal Reserve Chairman Alan Greenspan, called itself the Collective, or the Class of '43 (the publication year of The Fountainhead).\n\nRand soon honed her philosophy of what she termed \"Objectivism\": a belief in a concrete reality, from which individuals can discern existing truths, and the ultimate moral value of the pursuit of self interest. The development of this system essentially ended her career as a novelist: In 1958, the Nathaniel Branden Institute formed to spread her message through lectures, courses and literature, and in 1962, the author and her top disciple launched The Objectivist Newsletter. Her books during this period, including For the New Intellectual (1961) and Capitalism: The Unknown Ideal (1966), were primarily comprised of previously published essays and other works.\n\nFollowing a public split with Braden, the author published The Romantic Manifesto (1969), a series of essays on the cultural importance of art, and repackaged her newsletter as The Ayn Rand Letter. She continued traveling to give lectures, though she was slowed by an operation for lung cancer. In 1979, she published a collection of articles in Introduction to Objectivist Epistemology, which included an essay from protégé Leonard Peikoff.\n\nDeath and Legacy\n\nRand was working on a television adaptation of Atlas Shrugged when she died of heart failure at her home in New York City on March 6, 1982.\n\nAlthough she weathered criticism for her perceived literary shortcomings and philosophical arguments, Rand undeniably left her mark on the Western culture she embraced. In 1985, Peikoff founded the Ayn Rand Institute to continue her teachings. The following year, Braden's ex-wife, Barbara, published a tell-all memoir, The Passion of Ayn Rand, which later was made into a movie starring Helen Mirren.\n\nInterest in Rand's works resurfaced alongside the rise of the Tea Party movement during President Barack Obama's administration, with leading political proponents like Rand Paul and Ted Cruz proclaiming their admiration for the author. In 2010, the Ayn Rand Institute announced that more than 500,000 copies of Atlas Shrugged had been sold the previous year.\n\nIn 2017, Tony-winning director Ivo van Hove reintroduced The Fountainhead to the American public with a production at the Brooklyn Academy of Music. Having originated at Toneelgroep Amsterdam in the Netherlands, van Hove's version featured his performers speaking in Dutch, with their words projected onto a screen in English.\n\nQUICK FACTS\n\nBirth Year: 1905\n\nBirth date: February 2, 1905\n\nBirth City: St. Petersburg\n\nBirth Country: Russia\n\nGender: Female\n\nBest Known For: Author Ayn Rand wrote the best-selling books 'The Fountainhead' and 'Atlas Shrugged,' and promoted the philosophy of Objectivism.\n\nIndustries\n\nWriting and Publishing\n\n\n\nFilm\n\nAstrological Sign: Aquarius\n\nSchools\n\nUniversity of Petrograd\n\n\n\nState Institute For Cinema Arts\n\nDeath Year: 1982\n\nDeath date: March 6, 1982\n\nDeath State: New York\n\nDeath City: New York\n\nDeath Country: United States\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Ayn Rand Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/authors-writers/ayn-rand\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: November 16, 2021\n\nOriginal Published Date: April 2, 2014\n\nQUOTES"}, {"url": "https://www.britannica.com/biography/Ayn-Rand", "page_content": "Top Questions Who was Ayn Rand? Ayn Rand was a Russian-born American author and philosopher. Rand authored two best-selling novels, The Fountainhead (1943) and Atlas Shrugged (1957). Her novels were especially influential among conservatives and libertarians from the mid-20th century. Where is Ayn Rand from? Ayn Rand was born in St. Petersburg, Russia, on February 2, 1905. When the tsarist regime was overthrown in the Russian Revolution of 1917, her family moved to Crimea, where she finished high school. She returned to Russia in 1921 and then moved to the United States in 1926. What is Ayn Rand’s real name? Ayn Rand is the pen name of Alissa Zinovievna Rosenbaum. She adopted it when she moved to the United States in 1926. The first name, which rhymes with “pine,” was inspired by the name of a Finnish writer (whom she declined to identify), and the surname she described as an abbreviation of Rosenbaum. When did Ayn Rand begin writing? Ayn Rand arrived in Chicago in 1926 and then moved to Hollywood, where she met American filmmaker Cecil B. DeMille. Her chance encounter with DeMille led to work as a movie extra and eventually to a job as a screenwriter. Rand sold her first screenplay, Red Pawn, to Universal Studios in 1932. What are Ayn Rand’s most famous works? Rand’s first major work, The Fountainhead, was published in 1943. It details the struggle of a genius architect against mediocrity. Her second major work, Atlas Shrugged, was published in 1957. It follows a railroad executive and a steel magnate as they grapple with a collectivist government. Both The Fountainhead and Atlas Shrugged explicate Rand’s personal philosophy of objectivism. How did Ayn Rand die? Rand died of heart failure on March 6, 1982, in New York City. At the time, she had been working on a television adaptation of her novel Atlas Shrugged.\n\nAyn Rand, original name Alissa Zinovievna Rosenbaum, (born February 2, 1905, St. Petersburg, Russia—died March 6, 1982, New York, New York, U.S.), Russian-born American writer whose commercially successful novels promoting individualism and laissez-faire capitalism were influential among conservatives and libertarians and popular among generations of young people in the United States from the mid-20th century.\n\nEarly life and career Her father, Zinovy Rosenbaum, was a prosperous pharmacist. After being tutored at home, Alissa Rosenbaum, the eldest of three children, was enrolled in a progressive school, where she excelled academically but was socially isolated. Following the Russian Revolution of 1917, her father’s shop was confiscated by communist authorities, an event she deeply resented. As a student at Leningrad State University, she studied history and became acquainted with the works of Plato and Aristotle. After graduating in 1924, she enrolled in the State Institute for Cinematography, hoping to become a screenwriter. The arrival of a letter from cousins in Chicago gave her an opportunity to leave the country on the pretext of gaining expertise that she could apply in the Soviet film industry. Upon her arrival in the United States in 1926, she changed her name to Ayn Rand. (The first name, which rhymes with “pine,” was inspired by the name of a Finnish writer, whom she never identified, and the surname she described as an abbreviation of Rosenbaum.) After six months in Chicago she moved to Hollywood, where a fortuitous encounter with the producer Cecil B. DeMille led to work as a movie extra and eventually to a job as a screenwriter. In 1929 she married the actor Frank O’Connor. Soon hired as a filing clerk in the wardrobe department of RKO Radio Pictures, Inc., she rose to head of the department within a year, meanwhile writing stories, plays, and film scenarios in her spare time. She became an American citizen in 1931."}, {"url": "https://bookanalysis.com/ayn-rand/best-books/", "page_content": "Ayn Rand was a famous writer who developed a philosophy of her own and used both fiction and non-fiction writing to promote and popularize her philosophy. Her philosophy was called Objectivism. The general tenet of Objectivism is that the pursuit of one’s own happiness should be the highest moral goal of an individual. This article highlights some of her fictional works.\n\n\n\n\n\nNight of January 16th\n\nNight of January 16th is a theatrical play by Ayn Rand written in 1933. It was first produced in 1934 in Los Angeles under the title Woman on Trial. The play’s title was changed many times, as Rand had initially titled it Penthouse Legend but it was changed to The Verdict by the production team led by E.E Clive but on the night of its premiere, it was called Woman on Trial.\n\nLater when the play was taken to Broadway, Rand was given the option to choose from two titles The Black Sedan and Night of January 16th. Rand said she hated both titles but eventually chose the latter. In 1968, Rand published an edited version of the script and maintained the title Night of January 16th because according to her, the title was already too well known to be changed.\n\nNight of January 16th is a courtroom drama about a woman, Karen Andre who was on trial for killing her employer, Bjorn Faulkner a business tycoon who defrauded his company to make another investment but went bankrupt.\n\nBjorn Faulkner and Karen Andre were together in the Faulkner Penthouse on the night of January the 16th when Faulkner fell to his death. The prosecutor Mr. Flint and the defense attorney Mr. Stevens make their cases with testimonies from several witnesses.\n\nAn interesting thing about the play is that the jury is chosen from the audience and whatever verdict they pass determines the ending of the play. There are two alternate endings to the play. First, if the jury finds Karen Andre not guilty, she thanks them. If found guilty, she defiantly says that the jury has saved her from committing suicide. It was a play that proved Ayn Rand’s unique style of storytelling.\n\n\n\n\n\nWe the Living\n\nPublished in 1936, it is Ayn Rand’s first full-length novel. We the Living focuses on three individuals who dare to be independent-minded in the face of the communist dictatorship of Soviet Russia. The heroine, Kira Arguonova, an aspiring engineer from a bourgeois family, and her love triangle with two men: Leo Kovalesnsky, the aristocrat whom she loves, and Andrei Taganov, the communist who loves her. Kira gets expelled from engineering school because of her novel ideas and Leo, also a brilliant scholar realizes he has no future in Russia because of his rich family background and independent thinking.\n\nAndrei is the idealist man who believes in the virtues of the Communist principles and supports the Bolsheviks Revolution but later begins to question all his beliefs when society treats Kira unjustly.\n\n\n\n\n\nAnthem\n\nA dystopian novella about a brave young man who brakes the shackles of a totalitarian dictatorship to assert his individuality, find love and make an invention.\n\nAnthem centers on a hero called Equality 7-2521 who lives in a dystopian society where citizens cannot speak, eat or sleep without the government’s permission. The population grows from an impersonal mating ritual where people engage in intercourse with partners assigned to them by the state and give birth to children who are separated from their parents at birth and raised without personal identity. It is in such an extremely collectivist society that Equality 7-2521 commits the greatest crime of thinking and acting alone and is forced to escape the city as his actions put his life in danger.\n\n\n\n\n\nThe Fountainhead\n\nThis novel gave Ayn Rand her first major success in fiction writing. Published in 1943, Rand sold the script of The Fountainhead at Fifty Thousand dollars. The novel is about a genius challenging conformity and mediocrity as he paves his way in the field of Architecture. It follows Howard Roark who gets expelled from architectural school for his novel ideas and creativity. Undaunted, he pursues his vision and refuses to compromise in the face of betrayal from the woman he loves and from friends. Howard goes to trial for blowing up a public housing project he designed because of alterations by government bureaucrats without his consent.\n\nDominique Franon a woman who loves Howard with her life but betrays him by marrying his worst enemy; Ellsworth Toohey, a Marxist intellectual; Peter Keating, a brilliant architect who follows conventions and bends to the will of others, are all interesting characters that add to the brilliance of the novel.\n\nThe novel glorifies original creators and inventors in history and how these brilliant creators are often attacked by traditional worshiping society. The idea of individualism and collectivism in The Fountainhead is more complex than political, in that individuals have the leisure of free will and can choose to be freethinkers or conformists.\n\n\n\n\n\nAtlas Shrugged\n\nPublished in 1957, and set in the United States at an unspecified time, it is the last novel by Ayn Rand. In Atlas Shrugged, great entrepreneurs and innovators go on strike in protest against the government dictatorship that exploits them to favor the unproductive majority of the masses. Rand described the theme of this novel as the “role of man’s mind in existence.”\n\nRailroad executive, Danny Taggart who runs a company as a vice president to her brother who is not as business savvy as her, meets Hank Rearden, a steel magnate who she falls in love with despite his being married. They all discover that a mysterious figure known as John Galt is persuading business owners to abandon their businesses in protest against the state.\n\nDagny’s plane crashes on an island where she discovers John Galt and through a series of events, Galt follows Dagny to New York from his hiding place called the Galt’s Gulch and hacks into a national radio broadcast where he delivers a three-hour speech that projects the theme of the novel. The government eventually collapses after failing to force John Galt to lead the restoration of the country under the collectivist government. Galt triumphantly announces that the strikers can rejoin society on their own terms.\n\n\n\n\n\nFAQs\n\nWhat are two of Ayn Rand’s most famous books? Two of Ayn Rand’s most famous works are The Fountainhead and Atlas Shrugged.\n\nThe Fountainhead was published in 1943, it is a novel about the interplay of individuality, creativity, conformity, love, and betrayal as a genius called Howard Roark makes his way in the field of Architecture.\n\nAtlas Shrugged is about an economy where business owners abandon their businesses in protest of an unjust government that exploits the rich minority to serve the unproductive majority. Atlas Shrugged is regarded as Ayn Rand’s masterpiece and it was the last novel she wrote. What is Ayn Rand’s philosophy? Ayn Rand’s philosophy is called Objectivism. The philosophy is generally anchored on the idea of an individual as the paramount being and advocates for the economic and political freedom of the individual through laissez-faire capitalism. What year did Ayn Rand’s Anthem appear in the United States? Ayn Rand’s Anthem appeared in the United States in the year 1946. The novella was written in 1937 and first published in England in 1938 by Cassell Publishers while American publishers rejected the manuscripts. But after the success of Ayn Rand’s 1943 novel The Fountainhead, Rand revised the manuscript of Anthem and it was published in 1946 by Pamphleteers Inc, a publishing house owned by her friends. Is Ayn Rand primarily a novelist or a philosopher? Ayn Rand is both a novelist and a philosopher, she wrote three novels, developed a philosophical idea of her own called Objectivism, and wrote over four non-fiction books on philosophy.\n\nThe response to this question in Ayn Rand’s own words is\n\n“I am often asked whether I am primarily a novelist or a philosopher. The answer is: both. In a certain sense, every novelist is a philosopher, because one cannot present a picture of human existence without a philosophical framework;…\n\nIn order to define, explain and present my concept of man, I had to become a philosopher in the specific meaning of the term.”"}, {"url": "http://awardsandwinners.com/winner/?mid=/m/0h25", "page_content": "Quotes\n\nI am leaving it as I found it. Take over. It's yours.\n\nSenor d'Anconia said that you bore him, Mr. Taggart.\n\nI don't build in order to have clients. I have clients in order to build.\n\nThroughout the centuries there were men who took first steps, down new roads, armed with nothing but their own vision.\n\nUpper classes are a nation's past, the middle class its future.\n\nWhat is a demanding pleasure that demands the use of ones mind! Not in the sense of problem solving, but in the sense of exercising discrimination, judgment, awareness.\n\nArt is a selective re-creation of reality according to an artist's metaphysical value-judgments. An artist recreates those aspects of reality which represent his fundamental view of man's nature.\n\nEvery aspect of Western culture needs a new code of ethics -- a rational ethics -- as a precondition of rebirth.\n\nA building has integrity just like a man. And just as seldom.\n\nTo achieve, you need thought. You have to know what you are doing and that's real power.\n\nThere is a level of cowardice lower than that of the conformist: the fashionable non-conformist.\n\nWealth is the product of man's capacity to think.\n\nLove is an expression and assertion of self-esteem, a response to one's own values in the person of another. One gains a profoundly personal, selfish joy from the mere existence of the person one loves. It is one's own personal, selfish happiness that one seeks, earns, and derives from love.\n\nThe purpose of morality is to teach you, not to suffer and die, but to enjoy yourself and live.\n\nThe common good of a collective -- a race, a class, a state -- was the claim and justification of every tyranny ever established over men. Every major horror of history was committed in the name of an altruistic motive. Has any act of selfishness ever equaled the carnage perpetrated by disciples of altruism? Does the fault lie in men's hypocrisy or in the nature of the principle? The most dreadful butchers were the most sincere. The believed in the perfect society reached through the guillotine and the firing squad. Nobody questioned their right to murder since they were murdering for an altruistic purpose. It was accepted that man must be sacrificed for other men. Actors change, but the course of the tragedy remains the same. A humanitarian who starts with the declarations of love for mankind and ends with a sea of blood. It goes on and will go on so long as men believe that an action is good if it is unselfish. That permits the altruist to act and forces his victims to bear it. The leaders of collectivist movements ask nothing of themselves. But observe the results.\n\nWho is John Galt?\n\nRun for your life from any man who tells you that money is evil. That sentence is the leper's bell of an approaching looter."}, {"url": "https://inspirationalbookreviews.com/2019/12/03/the-fountainhead-book-review/", "page_content": "Overview:\n\nThe Fountainhead was written in 1943 by Ayn Rand who has to be one of my top 5 authors. I have read The Fountainhead and Atlas Shrugged another Ayn Rand novel several times. More recently I have both books available on Audible. There are several key characters in this novel, but the most notable is Howard Roark who is an architect. Howard is the focal point of the book for his individualist character and the love he possesses for his work. As with Atlas Shrugged this novel pits the individualist (capitalist) against those that feel there is little meaning to life and everything should be shared (socialist). Like all of Ayn Rand’s novels there is this good vs. evil plot being played out, or you might look at it as conventional vs. innovative when referring to the central theme of architecture. I won’t give away the details of the plot or how it ends, but I can guarantee you will enjoy reading or listening to this book.\n\nIf you have Audible beware that this is a very long book and is over 32 hours. The narration is incredible as the narrator changes their voice for various characters, making it much easier to listen to. Ayn Rand does an incredible job of creating compelling characters with all their virtues and flaws. As I mentioned the key character Howard Roark is what the author would call the ideal man. A man of virtue, dedicated to his work, and idealistic.\n\nRecommendation:\n\nAs you can probably tell I loved it. There is nothing in this book not to like and while it is a substantial investment in terms of the time to read it (752 pages), you will not be disappointed. Due to the quality of the narration and the fact that it is a novel, where much of it consists of dialog it really lends itself to the audio book format. If you choose to listen to it on Audible the version I listened to had Christopher Hurt as the narrator. While the underlying theme in this novel is philosophical, it is also entertaining and most of the characters are somewhat complex, making it fun to read.\n\nIf you would like to support this blog, you can purchase this book at:\n\neBooks.com\n\n\n\nThe Fountainhead\n\nAudiobooks.com\n\n\n\nFountainhead\n\nA little bit about the Author\n\n(source: https://en.wikipedia.org/wiki/Ayn_Rand)\n\nAyn Rand born Alisa Zinovyevna Rosenbaum; February 2, 1905 – March 6, 1982) was a Russian-American writer and philosopher. She is known for her two best-selling novels, The Fountainhead and Atlas Shrugged, and for developing a philosophical system she named Objectivism. Educated in Russia, she moved to the United States in 1926. She had a play produced on Broadway in 1935 and 1936. After two early novels that were initially unsuccessful, she achieved fame with her 1943 novel, The Fountainhead. In 1957, Rand published her best-known work, the novel Atlas Shrugged. Afterward, she turned to non-fiction to promote her philosophy, publishing her own periodicals and releasing several collections of essays until her death in 1982.\n\nRand advocated reason as the only means of acquiring knowledge and rejected faith and religion. She supported rational and ethical egoism and rejected altruism. In politics, she condemned the initiation of force as immoral and opposed collectivism and statism as well as anarchism, instead supporting laissez-faire capitalism, which she defined as the system based on recognizing individual rights, including property rights. In art, Rand promoted romantic realism. She was sharply critical of most philosophers and philosophical traditions known to her, except for Aristotle, Thomas Aquinas and classical liberals.\n\nLiterary critics received Rand’s fiction with mixed reviews and academia generally ignored or rejected her philosophy, though academic interest has increased in recent decades. The Objectivist movement attempts to spread her ideas, both to the public and in academic settings. She has been a significant influence among libertarians and American conservatives.\n\nAdvertisement"}, {"url": "https://www.geni.com/people/Ayn-Rand/6000000013498202722", "page_content": "About איין ראנד (עברית)\n\nאיין ראנד\n\n' (באנגלית: Ayn Rand;‏ 2 בפברואר[1] 1905, סנקט פטרבורג – 6 במרץ 1982, ניו יורק) הייתה סופרת ופילוסופית יהודית אמריקאית ילידת רוסיה, שזכתה לפרסום בזכות ספריה \"מרד הנפילים\" ו\"כמעיין המתגבר\", ובזכות פילוסופיית האובייקטיביזם שלה.\n\nקורות חיים תחילת דרכה ילדות ונעורים ברוסיה נולדה בשם אליסה זינובייבנה רוזנבאום (ברוסית: Алиса Зиновьевна Розенбаум), בת למשפחה יהודית בסנקט פטרבורג בירת האימפריה הרוסית. אביה, זינובי זכרוביץ' (פרונץ) רוזנבאום, היה רוקח מצליח, וראנד הצעירה חשה אליו קרבה אינטלקטואלית והערצה. אמה, שעבדה לפרנסתה במשרד שידוכים, ראתה את עצמה כאינטלקטואלית, ושיננה באוזני ראנד הצעירה כי גידול ילדים הוא \"חובה שנואה\".\n\nמילדות העדיפה ראנד, בניגוד לאחיותיה נטליה ונורה, מגזינים לנערים שהיו רוויים בסיפורי גבורה והרפתקאות. קירה, שמה של גיבורת הרומן \"אנו החיים\" שכתבה מאוחר יותר, היא גרסה נשית של \"סיירוס\", אחד מגיבורי אותם סיפורי מגזינים. התלהבות גדולה אף יותר עוררו בה סרטי הראינוע, ובמיוחד סרטים הוליוודיים. בעקבות המהפכה הקומוניסטית בשנת 1917 הופקעו נכסיו של אביה, ומצבה הכלכלי של משפחת רוזנבאום הידרדר במהירות. שינוי זה בגורל משפחתה, כמו גם מצבה של רוסיה אחרי המהפכה, עמדו בשורש עוינותה ארוכת השנים לקומוניזם. משפחת רוזנבאום נמלטה לחצי האי קרים[2], שבו החזיקו כוחות הלבנים ברוסיה, ונותרה שם עד שנת 1921. בזמן שהותה שם, קראה ראנד לראשונה את ספריו של ויקטור הוגו ואת \"סיראנו דה ברז'ראק\" של אדמון רוסטאן. הוגו, במיוחד, הותיר בה רושם בל יימחה, וספריו נחשבו אצלה כל חייה לדגם אידיאלי של כתיבה ספרותית.\n\nכאשר הסתיימה מלחמת האזרחים ברוסיה בניצחונם הסופי של הבולשביקים, שבה משפחת רוזנבאום לסנקט פטרבורג (עתה, פטרוגרד) וראנד החלה ללמוד היסטוריה ופילוסופיה באוניברסיטת פטרוגרד. במהלך לימודי הפילוסופיה שלה למדה ראנד לראשונה על הפילוסופיה של אפלטון ואריסטו — הראשון הפך למושא תיעוב מתמשך, כאבי תורת הקולקטיביזם, והאחרון היה לפילוסוף היחידי שלו רחשה ראנד הערצה וכבוד. רושם עמוק עוד יותר, אף כי קצר ימים, הותירה אצלה הפילוסופיה של פרידריך ניטשה ובמיוחד \"כה אמר זרתוסטרא\" שלו.\n\nשני אירועים הותירו בראנד רושם מיוחד במהלך שנות לימודיה: הראשון היה ההיתר שניתן לאביה לפתוח מחדש בית מרקחת, במסגרת תוכנית הנא\"פ; כעבור שנה, הולאם שוב בית המרקחת, כמו בתי מרקחת אחרים. ראנד סברה כי העילה היחידה למתן ההיתר מלכתחילה הייתה לאפשר לאנשים כאביה ליצור את ההכנסות שאותן ניתן יהיה לבזוז מאוחר יותר. אירוע שני היה הטיהורים באוניברסיטה. בשנה הראשונה ללימודיה פעלו בקמפוס סטודנטים קומוניסטים ואנטי-קומוניסטים. רוב הסטודנטים נתנו את קולותיהם לאנטי-קומוניסטים. בשנה השנייה החלו טיהורים, וכל הסטודנטים האנטי-קומוניסטים המוצהרים הוצאו להורג או נכלאו.\n\nמעבר לארצות הברית עם תום לימודיה בשנת 1924 החלה ראנד לעבוד כמדריכת מטיילים בארמונות הצאר. זמן קצר אחרי כן, ב-1925, זכתה באשרה לביקור אצל קרובי משפחתה, משפחת פורטנוי, בארצות הברית. במסיבת הפרידה שלה לחש לה אחד מקרובי משפחתה: \"אם ישאלו אותך באמריקה, ספרי להם שרוסיה היא בית קברות אחד גדול, וכולנו גוועים כאן לאטנו.\" ראנד הגיעה לארצות הברית בפברואר 1926 וכפי שתכננה מראש החליטה לא לשוב לברית המועצות לעולם. בתקופה זו אימצה לעצמה שם חדש, איין ראנד (בשם \"ראנד\" בחרה עוד בהיותה ברוסיה, כקיצור לשמה המקורי).\n\nשינוי השם ומקורו מקור השם \"איין ראנד\" שנוי במחלוקת: לפי הביוגרפיה של ברברה ברנדן, מקור השם \"איין\" הוא בשמו של סופר פיני שמצא חן בעיני ראנד. ברנדן טענה כי ההגייה המקורית של השם הייתה אִינָה, אך ראנד העדיפה הגייה המתחרזת עם המילה mine. לטענה זו לא נמצאו כל סימוכין וקשה לקבלה בהתחשב בכך שברנדן טעתה באשר למקור השם 'ראנד' (להלן). יש הסוברים כי 'איין' הוא למעשה עי\"ן - האות הראשונה בשם עליזה (שמה ברוסית אליסה), ומדובר אפוא בצורה 'ע. ראנד'.\n\nבאשר למקור שם המשפחה \"ראנד\" - ברנדן ייחסה אותו לשמה של יצרנית מכונות הכתיבה \"רמינגטון ראנד\"[3], וטענה כי בבחירת השם החדש ביקשה ראנד למנוע פגיעה במשפחתה אם תתפרסם. אך בשלהי המאה העשרים התגלה כי סיפור זה חסר בסיס: משפחתה של ראנד ברוסיה מיענה אליה מכתבים תחת שם זה מיד עם בואה לארצות הברית, דבר המעיד על כך שהשם אומץ עוד ברוסיה. כמו כן, החברות רמינגטון וראנד התאחדו רק בשנת 1927, שנה אחרי המועד שבו בחרה ראנד בשם החדש. כך או כך, בראיון משנת 1936 סיפרה ראנד כי שם המשפחה הוא בפשטות קיצור של שם המשפחה המקורי שלה (רוזנבאום).\n\nקריירה \"אנו החיים\" ו\"כמעיין המתגבר\" Postscript-viewer-shaded.png ערכים מורחבים – אנו החיים, כמעיין המתגבר זמן קצר לאחר המעבר לארצות הברית נסעה ראנד להוליווד וניסתה להשתלב בתעשיית הסרטים שם. עבודה ראשונה קיבלה בזכות היכרות אקראית עם הבמאי ססיל ב. דה-מיל שביים אז את הסרט \"מלך המלכים\". ראנד שימשה כנצבת בסרט, ואחר–כך קיבלה בהשתדלותו של דה-מיל משרה של תסריטאית זוטרה באולפניו. על הסט בסרט פגשה ראנד גם שחקן צעיר בשם פרנק אוקונור והתאהבה בו. השניים נישאו ב-15 באפריל 1929, זמן קצר לפני שפג תוקף אשרת השהייה שלה. לאחר שדה-מיל נאלץ לסגור את אולפנו בשנת 1929, נשכרה ראנד כפקידת תיוק במחלקת הלבוש של RKO והפכה לראש המחלקה שנה אחרי כן. באותה תקופה החלה ראנד לכתוב את הרומן הראשון שלה, \"אנו החיים\" (במקור, \"חתום\"), ולאחר שהצליחה למכור אחד מסיפוריה לאולפני יוניברסל נטשה את עבודתה ב-RKO והתמסרה לכתיבה[4].\n\nהצלחתה המשמעותית הראשונה ככותבת הייתה במחזה \"ליל ה-16 בינואר\", שהתבסס באופן רופף על סיפור חייו של איל הגפרורים השוודי איוואר קרוגר. הביקורות על המחזה היו חיוביות ברובן. המחזה גם הוסרט מאוחר יותר (1941). ראנד פרסמה את \"אנו החיים\", שלא זכה להד של ממש. הספר תיאר, בנימה אוטוביוגרפית בולטת, את קורותיה של קירה, צעירה הנאבקת בעריצות הסובייטית בשנים הראשונות אחרי המהפכה הקומוניסטית, ושני הגברים בחייה - ליאו, אינטלקטואל המתנגד גם הוא למשטר ואנדרי, פעיל בכיר במפלגה הקומוניסטית. הספר הולל על ידי מבקר הספרות ה. ל. מנקן. בלי רשותה וללא ידיעתה של ראנד, עובד הספר לסרט באיטליה של מלחמת העולם השנייה תחת השם \"אנו החיים\" (Noi Vivi) או \"להתראות קירה!\" (Addio Kira!) - אולם לאחר זמן מה אסר המשטר הפאשיסטי את המשך הקרנתו לאחר שהתברר כי המסר העולה ממנו עשוי להיות מכוון כלפי כל משטר עריצות ולא רק זה הקומוניסטי. גרסה מעודכנת באישורה יצאה בשנת 1986.\n\nהנובלה \"המנון\" שכתבה בשנת 1937 פורסמה רק באנגליה בשנת 1938, ואף היא לא זכתה להצלחה משמעותית. הספר היה דיסטופיה של חברה טוטליטרית שבה מושלת אידאולוגיה קולקטיביסטית קיצונית, והמילה \"אני\" אינה קיימת בה.\n\nבמקביל המשיכה ראנד לעבוד כתסריטאית. היא כתבה את התסריט ל\"ואז את באת\" שהפך לסרט בבימויו של ג'ון פארו (אביה של מיה פארו) ובכיכובו של רוברט קמינגס, ו\"מכתבי אהבה\" בכיכובם של ג'וזף קוטון וג'ניפר ג'ונס - וריאציה חופשית על \"סירנו דה ברז'רק\" של רוסטאן.\n\nבשנת 1935 החלה ראנד לכתוב את \"כמעיין המתגבר\"[5]. הספר פורש את סיפורו של האדריכל הווארד רוארק, הדבק בנחישות בעקרונותיו ומסרב להתפשר על עבודתו ועל ערכיו. דמותו של רוארק שאבה השראה מסוימת מן האדריכל פרנק לויד רייט. הספר נדחה על ידי הוצאות ספרים רבות, אך הפך בסופו של דבר להצלחה גדולה, בעיקר בזכות המלצות \"מפה לאוזן\". בשנת 1949 הפך התסריט שכתבה ראנד ל\"כמעיין המתגבר\" לסרט בכיכובם של גרי קופר ופטרישה ניל. הצלחתו העצומה של הספר העניקה לראנד פרסום והכנסות, ואפשרה לה להתמסר באופן בלעדי לכתיבה.\n\n\"מרד הנפילים\" והתנועה האובייקטיביסטית Postscript-viewer-shaded.png ערך מורחב – מרד הנפילים ב-3 בספטמבר 1946 החלה ראנד לעבוד על רומן חדש בשם \"השביתה\" שלבסוף הפך לספר \"מרד הנפילים\", שבו ראתה את יצירתה האפית הגדולה. ראנד עמלה במשך 11 שנים על כתיבת הרומן, החובק כ-1,100 עמודים. במהלך כתיבתו, באוקטובר 1951, עברו ראנד ואוקונור להתגורר במנהטן, הממלאת מקום מרכזי ברומן. הרומן כלל תכנים מיניים, והוצאות הספרים באותה תקופה חששו להוציאו לאור.\n\nבשנת 1947 העידה ראנד כעדה ידידותית בפני ועדת בית הנבחרים לפעילות אנטי אמריקאית. עדותה כללה בעיקר ניתוח של הסרט \"שירה של רוסיה\" משנת 1943. אף שרבים האמינו כי ראנד חשפה שמות של חברי המפלגה הקומוניסטית בארצות הברית,[%D7%93%D7%A8%D7%95%D7%A9 מקור] ובכך הביאה לנידוים, עדותה לא כללה למעשה דבר מלבד הערות ביחס לפער שבין המציאות בברית המועצות לבין התיאור שלה בסרט.\n\nזמן קצר לפני כן, בסוף שנת 1950, קיבלה ראנד מכתב ממעריץ, סטודנט לפסיכולוגיה וקומוניסט לשעבר בן 19 - נתנאל בלומנטל, שמאוחר יותר שינה את שמו לנתניאל ברנדן. בין השניים נוצר קשר אמיץ, והם חברו לקבוצה שעמה נמנו גם אשתו ברברה ברנדן, אלן גרינספן, לאונרד פייקוף, הארי ואיליין קלברמן, ג'ואן ואלן בלומנטל ואחרים — כולם קרובי משפחה או מקורבים דרך נישואין לזוג ברנדן. כך החלה הקבוצה להתגבש סביבה וסביב הפילוסופיה שלה. ראנד סייעה לברנדן להקים את \"מכון נתניאל ברנדן\" לקידום הפילוסופיה האובייקטיביסטית שלה, ויחסיה עם הצעיר הפכו לקשר רומנטי ב-1953. הרומן התקיים בידיעתם של בני זוגם ונמשך עד שנת 1958. בני הזוג ברנדן התגרשו, והקשר בין ראנד לצעיר נשמר עוד כעשור.\n\n\"מרד הנפילים\" (באנגלית, \"אטלס התנער ממשאו\") פורסם בשנת 1957 והפך מיד לרב מכר. הספר בנוי כסיפור תעלומה בלשי המשולב בדיסטופיה, ומציג את מצב העולם אילו פרשו ממנו אילי ההון, התעשייה וההגות. חלק ניכר מזמנה - למעלה משנתיים - הקדישה ראנד לכתיבת נאומו של ג'ון גאלט בסוף הספר, שבו ראתה את מיצוי תפישותיה הפילוסופיות. הספר ממשיך להימכר עד היום (2006) במאות אלפי עותקים מדי שנה.\n\nהשנים האחרונות\n\nקברם של איין ראנד ופרנק אוקונור פרסום הספר סימן גם שינוי דרמטי במעמדה של ראנד. היא הפכה בתוך זמן קצר ממושא הערצה של קומץ מקורבים לדמות המרכזית בלבה של תנועה פילוסופית חדשה, ה\"אובייקטיביזם\". מכון נתניאל ברנדן, הרצאות ברחבי ארצות הברית וכתב העת \"האובייקטיביסט\" - כל אלה סייעו בידה להנחיל את הפילוסופיה שלה בכל רחבי ארצות הברית. בשנת 1961 פרסמה את ספרה \"לאינטלקטואל החדש\" שמכיל את החלקים הפילוסופיים ברומנים שלה, ובשנת 1964 פרסמה את \"מעלת האנוכיות\", שמתאר את האתיקה שלה - אגואיזם רציונלי.\n\nבשנת 1968 נודע לראנד כי ברנדן מנהל רומן עם אישה בשם פטרישיה סקוט. בתגובה ניתקה באחת את כל קשריה עמו ופרסמה ב\"האובייקטיביסט\" כתב הוקעה נגדו, בו נדרשו כל חברי התנועה לנתק כל קשר עמו. בעקבות הקרע בין השניים, ובשל אי יכולתה של ראנד לנהל גוף כה גדול, החלה התנועה האובייקטיביסטית לדעוך.\n\nבשנות השבעים עדיין המשיכה ראנד לקדם את הפילוסופיה שלה, אך בתקופה זו התגלה בריאותיה גידול סרטני, וראנד נאלצה לחדול מהעישון האהוב עליה. בשנת 1978 החל בעלה פרנק לסבול מהסתיידות עורקים וראנד הקדישה חלק ניכר מזמנה לטיפול בו. פרנק מת בסוף שנת 1979 וראנד התקשתה לשוב לכתיבה ולפעילות. בשנת 1981 חידשה את פעילותה והחלה לכתוב תסריט למיני-סדרה טלוויזיונית בעקבות \"מרד הנפילים\". זמן קצר לאחר מכן הידרדר מצבה הבריאותי. על ערש דווי דאגה ראנד לקבוע את הסדרי ההלוויה והקבורה שלה. היא נפטרה ב-6 במרץ 1982.\n\nהפילוסופיה של ראנד Postscript-viewer-shaded.png ערך מורחב – אובייקטיביזם (איין ראנד) המטאפיזיקה של איין ראנד מבוססת על האקסיומה לפיה \"הקיום קיים\". ראנד דגלה בתפישה כי המציאות, העולם החיצוני, קיים בלי תלות בתודעתו או במשאלות ליבו של הצופה. עקרון מרכזי נוסף הוא חוק הזהות של אריסטו: \"א' הוא א'\", כל דבר הוא עצמו. מתוך חוק הזהות נובע חוק הסתירה: \"עלה אינו יכול להיות אבן בעת ובעונה אחת\"[6][7].\n\nבתחום האפיסטמולוגיה ראנד מחזיקה ברעיון לפיו ההגיון (תבונה) הוא האמצעי היחיד להשגת ידע העומד ברשות האדם[8]. כשאדם נתקל בדבר שנראה לו סותר או לא הגיוני, עליו לבחון מחדש את הנחות המוצא שלו.\n\nבתחום האתיקה איין ראנד דגלה באנוכיות רציונלית, היא ראתה באדם יצור רציונלי ובחשיבה רציונלית המדריך היחיד לפעולה והדרך היחידה לשפוט ערכים. כל אדם קיים כמטרת עצמו, והחשיבה הרציונלית היא המעלה הבסיסית שלו. ערכיו הבסיסיים הם הגיון, מטרה והערכה-עצמית[9]. האדם אינו אמצעי למטרותיהם של אחרים: הוא צריך לחיות למען עצמו, בלי להקריב אחרים לצרכיו או להקריב את עצמו למען אחרים. עליו לחתור לטובת האינטרס העצמי הרציונלי שלו, כשאושרו האישי הוא המטרה שלו.\n\nפסל של הטיטאן (נפיל) היווני אטלס, שהיווה השראה לרומן מרד הנפילים. בתחום הפוליטי-חברתי דגלה ראנד בתפישה של לסה פר וראתה בקפיטליזם את השיטה המוסרית היחידה. לפי ראנד, הזכות היסודית של האדם היא לחייו שלו, וממנה נגזרות הזכות לחירות, קניין, וחתירה לאושר. תפקיד המדינה הוא להגן על זכויות אלה[10]. בני אדם מתנהגים כ\"סוחרים\" המחליפים ערך אחד בערך אחר על–בסיס הסכמה הדדית ולצורך תועלת הדדית. התפקידים היחידים של ממשלה על פי ראנד הם משטרה, צבא ובתי משפט. כחלק מתפיסתה של ראנד, הפעלת כוח פיזי מותרת רק נגד מי שיזם את השימוש בו[11].\n\nלפי תפישתה של ראנד, החשיבה הפילוסופית התפלגה לאורך הדורות לשני מחנות עיקריים: האחד שהלך בעקבות חוק הזהות (א' היא א') וחוק הסתירה (\"אין זה אפשרי לאותה תכונה להשתייך ולא להשתייך לאותו דבר בו-זמנית ובאותו יחס\") של אריסטו, והאחר, שגרס כי קיים ידע אפריורי לא טריוויאלי, שדובריו הבולטים ביותר היו אפלטון בתקופה העתיקה ועמנואל קאנט בפילוסופיה המודרנית יותר[12]. לאור תפישות אלו הסתייגה ראנד בתוקף ממה שראתה כגישות מיסטיות ואי-רציונליות הממשיכות את התפישות הפלטוניסטיות בתחום האתי, ובמיוחד מהחשיבה ההגליאנית, ההיסטוריציסטית, והדטרמיניסטית שנבעה מתפישות אלו. ראנד גילתה התנגדות עזה לכל צורה של קולקטיביזם, פשיסטי או סוציאליסטי, ולדחיית מה שהיא מכנה \"כלכלה מעורבת\". ראנד התנגדה לרעיון שהממשלה תבצע רגולציה בכלכלה ותחלק מחדש את העושר. בתחום הפוליטי, סברה ראנד, באות לידי ביטוי המסקנות הסופיות של הפילוסופיה האי-הרציונלית בהחלפת עקרונות הבסיס האריסטוטליים באלה של האפלטוניזם ושל האידיאליזם. ההתכחשות לקיום המציאות ולתפישתנו אותה מובילה לדעתה בהכרח לתפישה הגורסת כי יש מהויות - ישויות-על ומטרות-על - החורגות מתחומו של הפרט. התפישה האי-רציונלית רואה בפרט מסקנה של הכלל ודוגלת בקולקטיביזם המקריב את הפרט למען הישות הכללית.\n\nיצירתה של ראנד אופי יצירתה ספרי הסיפורת של ראנד עוסקים בהתמודדות של גיבורים מוסריים ואינדיבידואליסטים מול חברה דיסטופית. כתיבתה מתאפיינת בנאומים ארוכים של הפרוטגוניסט המהווים ביטוי של התפיסה הפילוסופית שלה. הרומנים של ראנד ארוכים, כשמרד הנפילים בן 958 עמודים, כמעיין המתגבר בן 575 עמודים, ואנו החיים בן 439 עמודים. בספריה, ראנד מרבה לעסוק בנושאים בעלי חשיבות מוסרית וערכית אוניברסלית, ולא בחיי היומיום והשגרה. הפרוטגוניסטים בספריה מייצגים את מה שראנד תופסת כאדם האידיאלי, ואכן ראנד מספרת שמטרת הכתיבה שלה היא הצגתו של האדם האידיאלי, ולא, כמו שאחרים סוברים, להפיץ את הפילוסופיה שלה[13]. מוטיב משותף נוסף בכתיבתה הוא ראיית האדם כישות הרואית, רעיון שראנד קוראת לו \"פולחן האדם\"[14].\n\nספרי העיון של ראנד מורכבים בעיקר ממאמרים שפורסמו במגזינים האובייקטיביסטים שפרסמה.\n\nמורשת וביקורת השפעתה\n\nמפגין בתקופת המשבר הכלכלי של 2008 עם שלט המתייחס לג'ון גאלט, גיבור הספר מרד הנפילים. ראנד השפיעה על תנועות ורעיונות רבים, בארצות הברית וברחבי העולם. תורתה, האובייקטיביזם, הופצה ברחבי ארצות הברית, וקנתה לה תומכים רבים. בשנת 1985 הוקם מכון איין ראנד, שמוקדש ללימוד והפצה של תורתה של ראנד.\n\nראנד השפיעה במיוחד על התנועה הליברטיאנית בארצות הברית. דייוויד נולאן, אחד ממייסדי המפלגה הליברטיאנית בארצות הברית, טען ש\"אילולי ראנד, התנועה הליברטריאנית לא הייתה קיימת\"[15]. ראנד עצמה התנגדה לתנועה הליברטריאנית בטענה שהם מנצלים את רעיונותיה על מנת לקדם אנרכיזם[16], שגם אליו היא התנגדה[11]. דמות חשובה נוספת שהושפעה מראנד היא הכלכלן אלן גרינספן, ששימש כראש מועצת הנגידים של הבנק הפדרלי בארצות הברית, אם כי ראנד עצמה התנגדה לקיומו של הבנק המרכזי ותמכה בבנקאות חופשית.\n\nבעקבות המשבר הכלכלי בשנת 2008 חל זינוק חד בשיעורי קניית ספריה של איין ראנד, ומפגינים רבים בארצות הברית, בפרט מתנועת מסיבת התה נשאו שלטים הקשורים לתורתה[17]. תחייה זו הובילה גם לביקורת מחודשת מצד השמאל[18].\n\nמלבד השפעתה של משנתה הפילוסופית, גם ספריה של ראנד השפיעו רבות על מיליוני אנשים ברחבי העולם. אמנים וסופרים רבים, ביניהם אירה לווין, טרי גודקיינד, ניל פירט ואחרים, טענו שאהבו את ספריה והושפעו מהם. ישנן התייחסויות תרבותיות רבות לספריה של ראנד, הכוללות ציטוטים, פרפרזות וסאטירות. אנשי עסקים וטכנולוגיה רבים הושפעו מרעיונותיה של ראנד, בהם מייסד ויקיפדיה ג'ימי ויילס, המצהיר על עצמו כאובייקטיביסט, אשר אף התייחס לסוגיית האינטרס העצמי לעומת ההתנגשות לכאורה עם בניית ויקיפדיה כשירות חינם[19]. ג'ון אליסון, המנהל לשעבר של ענקית הבנקאות האמריקאי BB&T, שהתפרסם במכתב חריף אותו שלח לחברי הקונגרס האמריקאי נגד תוכניות החילוץ של הבנקים הכושלים, הוא אחד מתומכי הפילוסופיה של ראנד ומכהן כיום כראש מכון קאטו בוושינגטון[20]. וכמוהם גם ג'ף בזוס בעלי אמזון, שחקן הקולנוע קלינט איסטווד ורבים נוספים[21].\n\nהתנועה האובייקטיביסטית היורש החוקי והרוחני של ראנד לאחר מותה הוא לאונרד פיקוף, שירש את הזכויות לספריה וכתב בתקופת חייה ולאחר מכן מספר ספרים אודות הפילוסופיה שלה, והעביר מגוון הרצאות. הארגון הבולט ביותר העוסק בקידום הפילוסופיה של ראנד הוא Ayn Rand Institute[22], שהוקם בשנת 1985 על ידי לאונרד פיקוף ואד שניידר. נשיא מכון איין ראנד הוא ד\"ר ירון ברוק, ישראלי לשעבר. למכון שני סניפים, בקליפורניה ובוושינגטון.\n\nקבלה בעולם האקדמי היחס להגותה של ראנד בעולם האקדמי, לבד מיוצאי דופן בודדים, הוא לעיתים קרובות התעלמות ואף זלזול. הסיבות ליחס זה הן מורכבות וקשורות להגותה רק בחלקן.\n\nיסוד מובהק אחד להסתייגות מראנד הוא מתקפתה שלה נגד הפילוסופיה המיסטית-אפלטוניסטית, המרקסיזם וההיסטוריציזם. תפישות אלה (ואלה הנובעות מהן) מרכזיות בתחומי חקר רבים. ובכיוון ההפוך, גישותיה הושפעו במידת מה מתפישות אפיקוריאניות וליברליזם קלסי או, בתחום הכלכלי, מהוגים כמו הנרי הזליט ולודוויג פון מיזס מן האסכולה האוסטרית - כל אלה עמדו בניגוד לגישות הרווחות והדומיננטיות בתחום החקר האקדמי.\n\nרעיונות אלה של ראנד הותקפו כ\"בלתי מוסריים\" על–ידי הוגים מרקסיסטים וקולקטיביסטיים, שראו ברווחת הכלל מטרה נעלה מרווחת הפרט. אחרים, כמו הפילוסוף רוברט נוזיק שדעותיו בתחום הפוליטי היו קרובות לאלה של ראנד, טענו כי הטיעון הבסיסי של ראנד כאן אינו מבוסס.\n\nגם זרמים פילוסופיים אחרים שלא דגלו בגישות מיסטיות או מרקסיסטיות - כמו הפילוסופיה האנליטית שהובילה זרם פילוסופי מרכזי בארצות האנגלו-סקסיות - התייחסו לעצמם כ\"פוסט-אריסטוטליים\" ודחו את העיסוק בראנד ובהגותה כגישה \"מכניסטית\" ו\"מיושנת\".\n\nהאקדמיה נרתעה מראנד גם בשל החיבור שבין התפישות המטפיזיות והאפיסטמולוגיות שלה לרעיון החיים הרציונליים ולתפישת האדם כיצור הרואי. רבים ראו בהתכה בין הרעיונות האלה עניין מלאכותי שהתקיים רק בתורתה. התנועה האובייקטיביסטית בראשות \"יורשה הרוחני\" ליאונרד פייקוף מנסה ליצור באמצעות \"מכון איין ראנד\" מתודה שיטתית יותר של תורתה של ראנד, במסגרת פעילות המכון הוקמו מרכזי מחקר אקדמאיים ברחבי ארצות הברית, תוכניות הכשרה והוראה למורים ואקדמאים וכן פעילויות המגיעות לעשרות אלפי תלמידי תיכונים בכל שנה. המכון הפעיל מתרומות פרטיות בלבד צומח בהיקף פעולתו משנה לשנה.\n\nביקורת אודות ראנד מורי רותבארד, שהיה מקורב לזמן מה לראנד ולברנדן ואחרים[23][24], הצביע על מספר מאפיינים מובהקים של כת דתית בתנועה האובייקטיביסטית. מאפיינים אלה כללו הערצה והתבטלות מוחלטת כלפי ראנד, דעותיה ורצונותיה. אנשי הקבוצה התייחסו אליה כאדם הדגול ביותר שחי מאז ומעולם. הנכון והאמיתי בעיניהם נקבעו על פי הירארכיה, כשראנד ניצבת בראש, תחתיה ברנדן וקבוצת המקורבים (שכונו באירוניה \"הקולקטיב\"), ולאחריהם נציגים אזוריים של התנועה וחברים מהשורה. כמו כן, הונהגו מנגנונים מיוחדים כדי לברר את מידת הדבקות העיוורת של החבר בעקרונות.\n\nביקורות שנוגעות לכתיבה של ראנד מתרכזות לרוב בהיותן של הדמויות בספריה חד-ממדיות, מייצגות רעיון אחיד ומחולקות באופן ברור לטובים ולרעים באופן מוחלט. לפי המבקרים, הגיבורים החיוביים הם תמיד חופשיים, חזקים, עצמאיים, יצרניים, כריזמטים ובטוחים בעצמם, בעוד הדמויות השליליות מרושעות, בינוניות, חסרות עצמאות, קונפורמיסטיות, וחסרות עמוד שדרה[25][26][27].\n\nראנד וישראל בהרצאה שנשאה בשנת 1974 הביעה ראנד את הדעה כי על ארצות הברית לתמוך בישראל בעימות הישראלי-ערבי מכיוון שמדובר במאבק של \"אנשי תרבות\" מול \"פראים\" וכי \"ישראל נלחמת לא רק בערבים אלא גם ברוסיה הסובייטית\"[28], ושבכדי לדעת מיהם אויבך, במיוחד אם הנך משויך לעולם הנאור ולקדמה, עליך לבדוק מי הם אויבי היהודים וישראל.\n\nראנד עוררה הד ציבורי בישראל בשנות ה-70, בעיקר בעקבות פריצתו לתודעה של הפילוסוף משה קרוי שהושפע ממנה. ספרו של קרוי \"חיים על פי השכל\", שפורש את משנתו ואת פרשנותו לפילוסופיה של ראנד, זכה לפופולריות רבה, ועורר מחלוקת. בשנות השמונים התפרסם בטאון אובייקטביסטי \"לאינטלקטואל החדש\" (כשם אחד מספריה של ראנד), שמו הוסב מאוחר יותר ל\"אנכי\". בשנת 2005 הוקם אתר אינטרנט הנושא שם זה והוא \"מהווה מרכז לפעילות בנושאי הפילוסופיה של איין ראנד בישראל\"[29]. העורך הראשי של המגזין הוא בועז ארד (ארדר).\n\nבחודש אוקטובר 2012 הוקם בישראל \"מרכז איין ראנד בישראל ARCI\" הפועל כעמותה ומרכז פעילות רעיונית וחינוכית בנושאים הקשורים לספרות ולפילוסופיה של איין ראנד. המרכז מנהל מספר פרויקטים וביניהם תחרות חיבורים ארצית בעברית בנושאים מתוך הספרים \"כמעיין המתגבר\" ו\"מרד הנפילים\" במקביל לתחרות הבינלאומית המתקיימת בארצות הברית, תרגום מאמרי איין ראנד לעברית ולערבית, ואירוח מרצים וחוקרים אקדמאים מישראל ומארצות הברית העוסקים בפילוסופיה של איין ראנד[30]. מרכז איין ראנד בשיתוף עם TheMarker וDeloitte מעניקים כל שנה מאז 2016 את הAtlas Award לחברת הסטארטאפ הישראלית הטובה ביותר[31].\n\nספריה של ראנד ספרים שתורגמו לעברית סיפורת אנו החיים, 1936. מאנגלית - שושנה עין-גד, ערך אברהם בירמן, מזרחי, תל אביב, 1963. המנון, 1937, מאנגלית - יעל טולדנו, זמורה ביתן, תל אביב, תשמ\"ז 1987. כמעין המתגבר, 1943. הוצאת ש. פרידמן, תרגם ד. אהליאב, 1960 \\כנרת, זמורה-ביתן, מאנגלית: אינגה מיכאלי, תשע\"ב 2012. מרד הנפילים, 1957. הוצאת ש. פרידמן, תרגם יצחק אברהמי \\כנרת, זמורה-ביתן, מאנגלית: יעל סלע-שפירו, תשע\"ב 2012. עיון קפיטליזם: האידיאל, 1966. הוצאת סלע מאיר, תשע\"ז 2017. ספרי עיון שלא תורגמו לעברית For the New Intellectual: The Philosophy of Ayn Rand (1961). New York: Random House. The Virtue of Selfishness: A New Concept of Egoism (1964). New York: New American Library. The Romantic Manifesto: A Philosophy of Literature (1969). New York: The World Publishing. Expanded second edition published by New American Library in 1975. The New Left: The Anti-Industrial Revolution (1971). New York: New American Library. Expanded second edition published by New American Library in 1975. Introduction to Objectivist Epistemology (1979). New York: New American Library. Expanded second edition published by Meridian in 1990. Philosophy: Who Needs It (1982). Leonard Peikoff, ed. New York: Bobbs-Merrill. . קישורים חיצוניים מיזמי קרן ויקימדיה ויקיציטוט ציטוטים בוויקיציטוט: איין ראנד ויקישיתוף תמונות ומדיה בוויקישיתוף: Category:Ayn Rand איין ראנד\n\nבאתר Find a Grave (באנגלית) אתרי ארגונים ומקורות מידע אתר איין ראנד\n\n(באנגלית) אנכי, ביטאון תלמידי וידידי הפילוסופיה של איין ראנד בישראל מרכז איין ראנד בישראל מאמרי איין ראנד בעברית אתר קפיטליזם - הכולל מצגת לעקרונות הכלכלה האובייקטיביסטית (באנגלית) גלריית האמנות של קורדייר - ריכוז יצירות על פי עקרונות האסתטיקה האובייקטיביסטית המנון: הטקסט המלא של הספר (באנגלית) באתר פרויקט גוטנברג או באתר page by page קטרין דליגה, איין ראנד , באנציקלופדיה לנשים יהודיות (באנגלית) כתבות ומאמרים אודותיה אריאנה מלמד, ג'ון גולט חוזר , באתר ynet, 3 במאי 2009 סרטונים בועז ארד ורותם סלע בראיון בטלוויזיה הישראלית לרגל 50 שנה לפרסום מרד הנפילים , סרטון באתר יוטיוב סרטונים קטע פתיחה של הרצאת ד\"ר ירון ברוק, מנהל מכון איין ראנד, במרכז מורשת המודיעין בישראל 2007 , סרטון באתר יוטיוב \"הסוציולוגיה של פולחן איין ראנד\", מאת מורי רות'בארד\n\n(באנגלית) \"הפולחן המוזר ביותר בהיסטוריה\", מאת מייקל שרמר\n\n(באנגלית) \"אובייקטיביזם והאקדמיה\" מאת כריס מתיוס צ'יאברה\n\n(באנגלית) אריק גלסנר, על איין ראנד , שבעה לילות \"ידיעות אחרונות\", 28 במאי 2012 עופרה עופר אורן, האישה ששיבחה את האנוכיות והתפעלה מרוצח אכזרי , בבלוג \"סופרת ספרים\", 25 באפריל 2015 https://he.wikipedia.org/wiki/%D7%90%D7%99%D7%99%D7%9F_%D7%A8%D7%90...\n\n-------------------------------------\n\nAyn Rand (born Alisa Zinov'yevna Rosenbaum, February 2 [O.S. January 20] 1905 – March 6, 1982) was a Russian-American novelist, philosopher, playwright, and screenwriter. She is known for her two best-selling novels The Fountainhead and Atlas Shrugged and for developing a philosophical system she called Objectivism.\n\nhttps://secure.wikimedia.org/wikipedia/en/wiki/Ayn_Rand"}, {"url": "https://fee.org/articles/ayn-rand-sovietologist/", "page_content": "Whatever one thinks of Ayn Rand as a novelist, it is fair to say that her books, especially Atlas Shrugged, contain a great deal of sophisticated political and economic thinking. Atlas Shrugged may well be the most economically literate novel ever written. Although Rand does not couch her points in the language of economic theory, there is much in Atlas Shrugged that is consistent with sound economics. This should not be surprising given that her favorite economist was Ludwig von Mises. Moreover, her chapter “Aristocracy of Pull” is chock full of excellent political economy that fits well with Public Choice economics as well as the long history of classical liberalism dating back at least to Adam Smith. The famous “Love of Money” speech by Francisco D’Anconia contains many astute observations about the nature of money and its role in a market economy.\n\nLess noted in this regard is Rand’s first novel, We the Living. This is a semiautobiographical story set in Russia just after the revolution of 1917. The particulars of the plot are not as interesting in this context as the level of detail Rand provides about life in the Soviet Union in the early years of communist rule. I recently reread it for the first time in 20 or 25 years and was struck by the sophistication of Rand’s analysis of the Soviet economy in practice. Unlike most contemporary western observers, she had first-hand knowledge of the terrible conditions and the reality of Soviet power.\n\nThree Insights\n\nThree insights in We the Living illustrate Rand’s superior understanding of Soviet socialism. First she recognized what has since been called “the myth of the plan.” If Mises, F. A. Hayek, and the other Austrians are right, it’s impossible to plan a complex economy, yet many referred to the Soviet Union as having a “planned economy” right up to its demise in 1991. A variety of plot details and sidelights in Rand’s novel illustrates that the economy was anything but planned, with the two most obvious being how Party insiders had differential access to goods and the thriving black market. Those “in charge” of the economy are accurately portrayed as clueless about how to get things done, while the black marketeers at least get goods moving. Although she never says so explicitly, it’s clear that the “planners” suffer from the exact knowledge problem the Austrians raised.\n\nSecond, the novel makes clear that in the absence of any rationality to the plan, those with the power to implement it will use that power to divert resources to themselves. More specifically, Rand understood how a system in which discretionary power is up for grabs will attract those with a comparative advantage in acquiring and using that power. Much of her portrayal of party members revolves around their competition with one another in climbing the ladder — no one hesitating to stab his comrades in the back. Those who are good at such maneuverings are able to gain power and control resources. In the end, much like in Animal Farm, things didn’t change that much: The revolution ended the exploitation of man by man and replaced it with . . . the exploitation of man by man.\n\nDeclining Living Standards\n\nFinally, Rand vividly documents the decline in living standards for the average Russian. There are countless descriptions of the impoverishment of the citizenry, from their shrinking living space, to their dwindling food supplies, to their increasingly shabby clothing, to their growing inability to heat their homes. The party elite, of course, lives well, but the average person suffers. Rand’s depiction is important here because so many observers from the 1930s right up through the 1980s argued that the Soviet economy was an economic powerhouse that would overtake America’s. Paul Samuelson’s widely used introductory economics textbook for years had a graph showing just that. Pundits and experts both left and right believed the “official” Soviet statistics, with the left wanting to believe that socialism worked and the right wanting to justify larger military budgets. But just as in the United States during World War II, aggregates such as GDP, which in the Soviet case were not accurate anyway, mostly reflected “conspicuous production” that had little relationship to the well-being of the typical person.\n\nWe the Living makes this abundantly clear.\n\nRand’s novels may or may not be excellent literature, but they are excellent both at deploying good political economy and, in the case of We the Living, getting economic history right in a way most everyone else did not."}, {"url": "https://aynrand.org/novels/", "page_content": "Do you remember what you thought or how you felt when you read Atlas Shrugged or The Fountainhead for the first time? Do you want others to have that same experience?\n\nThe Ayn Rand Institute makes that happen every day. We encourage young people to read Ayn Rand and become passionate about her ideas through educational programs, articles, talks, blog posts and social media.\n\nAyn Rand’s philosophy offers a much-needed antidote to the present culture. Your contribution will help us promote her ideas to the widest possible audience."}, {"url": "https://plato.stanford.edu/entries/ayn-rand/", "page_content": "First published Tue Jun 8, 2010; substantive revision Mon Jul 13, 2020\n\nAyn Rand (1905–1982) was a novelist-philosopher who outlined a comprehensive philosophy, including an epistemology and a theory of art, in her novels and essays. Early in her career she also wrote short stories, plays, and screenplays. Rand’s first and most autobiographical novel, We the Living (1936), set in the Soviet Union, was published only after many rejections, owing to widespread sympathy for the Soviet “experiment” among the intellectuals of the day. We the Living was quickly followed by the dystopian novel, Anthem (1938), written as “a kind of rest” from work on her next major novel, The Fountainhead (1943). The Fountainhead, also published after many rejections because of its individualism, and largely panned by critics, soon became a best-seller by word of mouth. The Fountainhead brought Rand international fame, and Atlas Shrugged (1957) sealed this fame. By 1958, Rand’s novels, increasingly philosophical, had won her ideas a sufficiently devoted following for her to form, in association with psychologist Nathaniel Branden (with whom she later broke), an official “Objectivist” philosophical movement, complete with journals and lecture courses. For all her popularity, however, only a few professional philosophers have taken her work seriously. As a result, most of the serious philosophical work on Rand has appeared in non-academic, non-peer-reviewed journals, or in books, and the bibliography reflects this fact. We discuss the main reasons for her rejection by most professional philosophers in the first section. Our discussion of Rand’s philosophical views, especially her moral-political views, draws from both her non-fiction and her fiction, since her views cannot be accurately interpreted or evaluated without doing so.\n\n1. Introduction\n\n1.1 Ayn Rand and Philosophy\n\nIn Rand’s own words, her first and greatest love, her “life purpose”, was “the creation of the kind of world … that represents human perfection”, while her interest in philosophical knowledge was “only” for the sake of this purpose (Journal entry for 4 May 1946; in 1997: 479).[1] Nevertheless, her interest in philosophical knowledge continued long after she had created this world in her magnum opus, Atlas Shrugged, her last work of fiction. In her non-fiction, Rand developed a conception of metaphysical realism, rationality, ethical egoism (rational self-interest), individual rights, laissez-faire capitalism, and art, and applied her philosophy to social issues. She wrote polemical, philosophical essays, often in response to questions by fans of Atlas Shrugged and The Fountainhead; lectured on college campuses; and gave radio and television interviews. In her own words, her philosophy,\n\nin essence, is the concept of man as a heroic being, with his own happiness as the moral purpose of his life, with productive achievement as his noblest activity, and reason as his only absolute. (Rand 1957 [1992]: Afterword)\n\nCapitalism, “the unknown ideal”, is for her the only political-economic system compatible with this philosophy because it is the only system based on respect for human beings as ends in themselves. The free-market libertarian political movement, though largely disowned by Rand, drew—and draws—great inspiration from her moral defense of the minimal state, that is, the state whose only raison d’être is protection of individual rights.\n\nWhereas Rand’s ideas and mode of presentation make Rand popular with many non-academics, they lead to the opposite outcome with academics. She developed some of her views in response to questions from her readers, but seldom took the time to defend them against possible objections or to reconcile them with the views expressed in her novels. Her philosophical essays lack the self-critical, detailed style of analytic philosophy, or any serious attempt to consider possible objections to her views. Her polemical style, often contemptuous tone, and the dogmatism and cult-like behavior of many of her fans also suggest that her work is not worth taking seriously.[2] Further, understanding her views requires reading her fiction, but her fiction is not to everyone’s taste. It does not help that she often dismisses other philosophers’ views on the basis of cursory readings and conversations with a few philosophers and with her young philosophy student acolytes. Some contemporary philosophers return the compliment by dismissing her work contemptuously on the basis of hearsay. Some who do read her work point out that her arguments too often do not support her conclusions. This estimate is shared even by many who find her conclusions and her criticisms of contemporary culture, morality, and politics original and insightful. It is not surprising, then, that she is either mentioned in passing, or not mentioned at all, in the entries that discuss current philosophical thought about virtue ethics, egoism, rights, libertarianism, or markets. (Readers may also find the entry on Nozick’s political philosophy to be of interest.) We present specific criticisms of her arguments and claims below, in the relevant sections of this entry.\n\n1.2 Life and Work\n\nAyn Rand was born Alissa Zinovievna Rosenbaum, to a bourgeois Jewish family in St. Petersburg, Russia, on 2 February 1905. A witness to the Russian Revolution and civil war, Rand opposed both the Communists and the Tsarists. She majored in history, but the social science program in which she was enrolled at Petrograd State University included philosophy, law, and philology. Her teachers emphasized—as she herself later did—the importance of developing systematic connections among different areas of thought (Sciabarra 2013). Rand’s formal philosophical education included ancient philosophy (especially Plato and Aristotle), logic, philosophical psychology, Marxism-Leninism, and non-Marxist political thought. But she was evidently also exposed to Hegelian and Nietzschean ideas, which blossomed during this period (known as the Russian Silver Age), and read a great deal of Friedrich Nietzsche on her own. After graduating from Petrograd State University in 1924, an interest in screenwriting led her to enroll in the State Institute for Cinematography. On the literary side, she studied the great Russian novelists and poets, but fell in love with Victor Hugo, to whose influence she owes the “Romantic Realism” of her novels.\n\nIn 1925 Rand succeeded in obtaining permission to visit relatives in the United States; hating the Soviet system, she left with no intention of returning. After six months with relatives in Chicago, she made her way to Hollywood where, on her second day, a fortuitous encounter with Cecil B. DeMille led to a job as a script reader, and later as a screenplay writer. The next week she had another fortuitous encounter, this time with the actor Frank O’Connor, whom she married in 1929. She was married to him till his death in 1979. She adopted the pen name Ayn Rand to (it is thought) protect her family back in Russia, although she also told the New York Evening Post in 1936 that “Rand” was an abbreviation of her Russian surname.\n\nRand and her husband moved permanently to New York City in 1951, where she became involved with, and was influenced by, the circle of mostly New-York-based intellectuals involved in the revival of classical liberalism, such as the economic journalist Henry Hazlitt, the Austrian economist Ludwig von Mises, and the Canadian-American novelist, literary critic, and political philosopher Isabel Paterson. Rand also studied, and was a great admirer of, the Lockean philosophy of the American founding. Rand lived and worked in New York City until her death in 1982.\n\nRand holds that philosophy, like all forms of knowledge and achievement, is important only because it is necessary for living a good human life and creating a world conducive to living such a life. Philosophy supplies the most fundamental cognitive and normative abstractions which, respectively, identify and evaluate what is. Everyone, according to Rand, needs a philosophy and is guided by at least an implicit one (1982a: ch. 1). Her novels express her belief that if our philosophy is more or less correct, our lives will be more or less successful, if our philosophy is wildly off the mark, our lives will be disastrous. Philosophy thus has an urgent, practical importance. But unlike Marx, her philosophical and political antipode, Rand thinks that social change has to start with a moral revolution within each individual and the spread of the right ideas and ideals through rational discourse and the inspiration of art.\n\nRand’s ideal human being appears, in varying degrees of development, in all her novels; her ideal world appears in Atlas Shrugged. Her novels feature striking, complex plots with subtle psychological explorations of her characters’ emotions and thoughts, and philosophical reflections that rarely lose sight of the dramatic context. Like many famous Russian novelists, especially Dostoevsky, whom she recognized as a great psychologist, Rand also uses long speeches to lay out her philosophy, a device that has both its supporters and its detractors. She described Atlas Shrugged as a “stunt novel” and a murder mystery—the murder of the human soul by a collectivist culture. By “soul”, however, she meant not an immortal substance that survives the death of the body—she is not a dualist in any aspect of her philosophy—but the mind, or the human spirit that celebrates life on this earth. She took a familiar phenomenon and literary trope—a workers’ strike—and turned it on its head to show what happens when “the men of mind”—scientists, philosophers, industrialists, entrepreneurs, writers—the “prime movers” of a society—go on strike. It also purports to show how the wrong metaphysics can lead to the wrong ethics and thus to disastrous personal choices and a disastrous political and economic system, and how the right philosophy is needed for the rebirth of the soul and the rebuilding of the world. Her protagonists are not knights on white steeds rescuing damsels in distress, or swordsmen who can fight off a dozen enemies single-handed, but men and women in the mid-20th century industrial America of steel mills, skyscrapers, and glimmering highways: women who run transcontinental railroads and men who revolutionize architecture or (long before clean energy became a cause célèbre) build a motor powered by static electricity to produce limitless, clean energy. Her novels show the importance of striving to be the best we can be:\n\nDo not let your fire go out, spark by irreplaceable spark, in the hopeless swamps of the approximate, the not-quite, the not-yet, the not-at-all. Do not let the hero in your soul perish, in lonely frustration for the life you deserved, but never have been able to reach. Check your road and the nature of your battle. The world you desired can be won, it exists, it is real, it is possible…. (Atlas Shrugged, 1957 [1992]: 983).\n\nHer novels inspire readers because they present heroes of unbreached integrity, heroes who lead colorful and remarkable lives and succeed not in spite of, but because of, their uncompromising virtue. This estimate of their virtue is not, of course, shared by all: many readers find her characters wooden, her writing stilted, and her ethical and political views misguided.\n\nRand paid tribute to Aristotle, whom she considered the greatest of all philosophers, in the titles she gave to the three Parts of Atlas Shrugged (Non-Contradiction, Either-Or, A is A) and to one of the chapters (The Immovable Movers). While she differed sharply from Nietzsche on many issues, including rationality, free will, and individual rights, his influence is evident in her provocative, often aphoristic, point-counterpoint writing style, as well as in her “transvaluation” of traditional values and her powerful affirmation of life and joy and the spirit of youth. In the Introduction to the 25th Anniversary edition of The Fountainhead, she stated that the novel’s sense of life is best conveyed by a quotation from Nietzsche’s Beyond Good and Evil: “The noble soul has reverence for itself”. (For The Fountainhead’s partly sympathetic and partly critical engagement with Nietzsche’s ideas, see Hunt 2006.)\n\n1.3 Metaphysics and Epistemology\n\nFundamental to Rand’s outlook—so fundamental that she derives the name of her philosophical system, “Objectivism”, from it—is a trichotomy among three categories: the intrinsic, the subjective, and the objective (ITOE: 52–54; Rand 1965: 13–23). An intrinsic phenomenon is one whose nature depends wholly on factors external to the mind; a subjective phenomenon is one whose nature depends wholly on the mind; and an objective phenomenon is defined, variously, as that which depends on the relation between a living entity’s nature (including the nature of its mind) and its environment, or as that which depends on the relation between a properly functioning (rational) mind and extramental reality. Commentators are divided over the best way to interpret Rand’s views on this issue.\n\nRand holds that there is a widespread tendency to ignore the third category or to assimilate it to the second, thus setting up a false dichotomy between the intrinsic and the subjective. On Rand’s view, many of the fundamental questions of philosophy, from the existence of universals to the nature of value, involve fruitless debates over the false alternative “intrinsic or subjective?” in cases where the phenomenon in question is neither intrinsic nor subjective, but rather objective.\n\nIf ethics is the branch of philosophy concerned with practice, then in a sense all of Rand’s philosophy is ethics, for Rand stresses “the supremacy of actual living over all other considerations”, and insists that philosophy needs to be “brought up to the realm of actual living”—adding “I say intentionally brought up to it, not down” (Journal entry for 15 May 1934, p. 72; in Rand 1997: 73). Consequently, Rand regularly concerns herself with the practical implications and social relevance not only of moral and political philosophy, but likewise of the seemingly more arcane strata of metaphysics and epistemology—as when she identifies errors in concept-formation as one of the roots of racism, or mind-body dualism as a root of the dichotomy between economic and personal freedom. This approach likewise reflects Rand’s emphasis on integrating each piece of information into the total context of one’s knowledge, and her consequent hostility to compartmentalization.\n\nRand’s conviction of the vital practical importance of abstract theory may help to explain the passionately polemical nature of her philosophical writing (which some readers find inspiring and others hyperbolic and off-putting), although Nietzsche’s influence, as well as the influence of her Marxist-Leninist education also probably play a role. Rand also tended—perhaps owing in part to the same two influences—to regard philosophical errors as revelatory of the psychological flaws of their authors.\n\nFor a more in-depth presentation of Rand’s views on epistemology and metaphysics, please see the supplement on Epistemology and Metaphysics\n\n2. Ethics\n\n2.1 What is Ethics, and Why do we need It?\n\nEthics\n\nis a code of values to guide man’s choices and actions—the choices and actions that determine the purpose and the course of his life. (1961b: 13)\n\nBefore we can decide which code of values we should accept, we need to ask why we need a code of values at all. Rand claims that no philosopher before her has provided a scientific answer to this question, and so none has provided a satisfactory ethics.\n\nRand starts by describing value or “the good”, in classical fashion, as the object of pursuit: “that which one acts to gain and/or keep” (1961b: 16). Thus, the concept of value presupposes the concept of “an entity capable of acting to achieve a goal in the face of an alternative”—and the basic alternative facing any living entity is life or death (1961b: 16). It is the conditional nature of life that gives rise to values, not just human values, but values as such. As she puts it:\n\nMetaphysically, life is the only phenomenon that is an end in itself: a value gained and kept by a constant process of action. (1961b: 18)\n\nSurvival is the organism’s ultimate value, the “final goal or end to which all [its] lesser goals are the means”, and the standard of all its other values: “that which furthers its life is the good, that which threatens it is the evil” (pp. 16–17). The same, suitably modified, applies to human beings. Life is the standard and goal of all genuine human values, in the sense that all of them—from food to philosophy to fine art to ethics—must be explained and justified as requirements of human survival. “Ethics is an objective, metaphysical necessity of man’s survival” (p. 24). Thus,\n\n[t]he standard of value of the Objectivist ethics … is man’s life, or: that which is required for man’s survival qua man, (1961b: 25)\n\nthat is,\n\nthe terms, methods, conditions and goals required for the survival of a rational being through the whole of his lifespan—in all those aspects of existence which are open to his choice. (1961b: 27)\n\nTo choose to live is to accept one’s “own life” as one’s “ethical purpose”.\n\nRand’s metaphysical arguments make three points central to her axiology and ethics. (1) All living entities have values, not only human beings, and only living entities have values: life necessitates value, and value depends on life. (2) An entity’s values are determined by its objective life-needs, that is, by the requirements of survival for entities of its kind, and ethics is a requirement of human survival. (3) Thus, values are neither intrinsic properties of things, nor subjective, neither free-floating Platonic entities, nor mere matters of preference, time, or culture. Rather, values are relational or objective, dependent on the nature of the valuing entity and the nature of its environment.\n\nRand supports the first point by arguing that the concept of value entails the concept of life:\n\nepistemologically, the concept of “value” is genetically dependent upon and derived from the antecedent concept of “life”. (1961b: 18)\n\nShe asks the reader to\n\nimagine an immortal, indestructible robot, an entity which moves and acts, but which cannot be affected by anything, which cannot be changed in any respect, which cannot be damaged, injured or destroyed. (1961b: 16)\n\nSuch an entity, she concludes, cannot have values.\n\nThe problem with this argument is that all it shows is that an entity that cannot be destroyed or harmed cannot have values, and not that a non-living entity cannot have values. Unlike the robot of this example, real robots can be damaged or destroyed, by external as well as internal events. What it means for them to be damaged or destroyed is that they cannot perform their functions well, or at all. Hence they can, quite straightforwardly, be said to have values.[3] To take this into account, Rand would have to say that for an entity that has a function, values are determined by what it needs to function (well), and that the function of living beings is to survive (well). Hence she can still maintain that for living things, values are determined by its objective life-needs, hence that values are objective, and that ethics is a requirement of a proper human survival.\n\nRand’s naturalism, and her rejection of intrinsicism and subjectivism in favor of objectivism, anticipate recent naturalisms and echo Aristotle’s argument, against both the Platonist and the subjectivist, that “the good” must always be good-for-something. Her conception of the function of morality is notable both for its affinity to, and its difference from, Thomas Hobbes’ conception: like Hobbes, Rand sees morality as a necessary means to long-term survival, but unlike Hobbes, she does not see morality as requiring a contract or even as a fundamentally social affair. The need for morality, according to Rand, is dictated by our nature as creatures that must think and produce to survive; hence we would need morality even on a desert island. There is, however, no duty to survive; morality is based on a hypothetical imperative: if you choose to live, then you must value your own long-term survival as an ultimate end, and morality as a necessary means to it. If asked why the choice to live commits you to your own long-term survival rather than some other ultimate end (such as, for example, the greatest happiness of the greatest number (Nozick 1971), or becoming worthy of eternal life in heaven), the only answer is: because any other ultimate end, if consistently adhered to, would lead to death.\n\nRand’s ethics is thus firmly teleological, this-worldly, and foundationalist. Virtue is “the act by which one gains/and or keeps” values in light of a recognition of certain facts (1961b: 27, 28); it “is not an end in itself … not its own reward” (1957 [1992]: 939). A fact central to a “scientific” ethics is that reason is the chief indispensable human tool of survival, and we exercise reason by choice. Hence rationality is the fundamental moral virtue, a virtue implicated in all the other virtues, including productiveness (Section 2.4 below).\n\nRand is widely credited by Objectivists (Peikoff 1991; Binswanger 1990, 1992; Kelley & Thomas 1999—see Other Internet Resources; Gotthelf 1999; Smith 2000, 2006) with having solved the is-ought problem by showing that morality is essential for long-term survival as a rational being, and so anyone who chooses to live ought to be moral (1961b: 19). But if the choice to live is itself a moral choice, in the sense that we ought to choose to live, then the argument proceeds from an ought to an ought, not from an is to an ought. On the other hand, if the choice to live is a non-moral choice (an idea that’s hard to reconcile with Rand’s general view that all significant choices are moral choices), then suicide can never be wrong, even if it is done for cowardly, irresponsible, or unjust reasons, a view that is obviously incoherent (King 1984 and Narveson 1998 criticize this and other aspects of Rand’s moral views). Again, if morality is needed only for long-term survival, and choosing death is not immoral, then a suicide-bomber does no wrong in killing innocent people. But people don’t lose their rights just because their killer has decided to kill himself. Darryl Wright seeks to save something of the commonsense view that the suicide-bomber acts wrongly by arguing that his choice to die without good reason “corresponds to a real defect or corruption” in him (Wright 2011: 26–29). But this verdict contradicts the premise that choosing death is not immoral. For if the choice expresses a corruption in the character of the suicide-bomber, then the choice itself is immoral. Moreover, this response leaves untouched the most important criticism of the suicide-bomber’s actions: that he violates other people’s rights by using them as mere means to his own (wicked) ends.\n\nMore fundamentally, the very idea of morality resting on the choice to live is questionable (Long 2000, Badhwar 2001). Most of us rarely, if ever, make a choice to live: we live by default. By giving us desires for food and water, for pleasure and security, Nature gives us, as she gives other animals, the implicit desire to stay alive. Perhaps the most dramatic evidence is the existence of feral children, children who have managed to stay alive for years in the company of wild animals. When we grow up, the only time we seriously ask ourselves if we want to live or die is when living requires an effort on our part, such as in a grave illness, or deep depression, or emergency. But we start learning the difference between right and wrong (for example, don’t hit others, don’t grab their things, and so on) long before we ever consider whether to live or die. A deeper reflection on morality begins when we mature and start asking ourselves what constitutes happiness and a worthwhile life. But this is an inherently moral question to which the answers are inherently moral or immoral.\n\nLet let us now return to the question of how we should understand the relationship between long-term survival and survival as a rational being—the life “proper to a rational being” (Rand 1961b: 27). Is a life proper to a rational being a necessary means, and only a necessary means, to literal, long-term survival? Or is such a life itself the ultimate goal, the kind of survival worth having? Again, what are we to make of the many passages in which Rand states that the ultimate goal is one’s own happiness?\n\nSome of Rand’s statements suggest that she had only one, consistent ethical view: the ultimate goal is the individual’s own survival; the only way to survive long-term, i.e., over a complete life-span, is to live by the standard of man’s life as a rational being, which means: to live morally; and happiness is the psychological “result, reward and concomitant” (p. 32) of living thus. Many of Rand’s commentators follow her in holding that there is only one consistent view, while disagreeing on the right interpretation of it (Den Uyl & Rasmussen 1978; Machan 1984, 2000; Peikoff 1991; Bidinotto 1994—see Other Internet Resources; Hunt 1999; Kelley & Thomas 1999—see Other Internet Resources; Gotthelf 1999; Smith 2000, 2006). Others (Mack 1984, 2003; Badhwar 1999, 2001; Long 2000) argue that Rand’s writings actually allow of two, if not three, mutually incompatible views of the ultimate goal, and our task is to see which of these is the dominant or most plausible view. The three views are: survival, survival qua rational being, and happiness in the ancient Aristotelian sense of flourishing or eudaimonia. In the rest of Section 2, we will present the textual evidence for each of these views of the final goal, and the common objections to them, in turn.\n\nAll three views are, of course, egoist, in that the primary or sole intended beneficiary of morality is supposed to be the moral agent herself. But some of the criticisms usually levied at egoism lose some of their force when directed at the second and third views.\n\n2.2 Survival as the Ultimate Value\n\nThe survivalist view holds that just as literal survival is the ultimate value for other living entities, so it is for human beings (Kelley & Thomas 1999; Gotthelf 1999; Smith 2000). Survival is the source and final goal of all the actions of an entity, that which gives point to all its other values. For human beings, morality and happiness are both instrumental means to survival. The vicious can “achieve their goals [only] for the range of a moment”, as evidenced by “any criminal or any dictatorship” (1961b: 26).\n\n“Non-survivalists” make the following objections:\n\nThe biological premise that survival is the ultimate goal of all living things is mistaken. Animals of many species risk their own lives for the sake of reproduction, or for protecting their young or even their group. But even if survival were the ultimate goal of other species, it need not be ours. Even if our own survival needs were the source of all our values, it would not follow that survival must be the ultimate psychological and moral goal to which all our other values are merely necessary means. The genesis of x does not logically determine the ultimate goal of x. For example, the source of sexual desire is our reproductive capacity but, as Rand would agree, it doesn’t follow that we ought to satisfy our sexual desires only if we want to reproduce. The survivalist view that turns happiness into a mere means to survival entails, quite implausibly, that a long, unhappy life is better than a somewhat shorter but happy life, and just as good as a long and happy one. Many dictators, including the Pharaohs of the past and the Stalins and Maos of the 20th century, have survived by making elaborate plans to preserve their lives and their power by using a combination of terror, myth, and bribery. Their gross injustice poses a far greater threat to the lives of their subordinates than to their own. Morality enhances the individual’s chances of survival under normal circumstances, but it is not necessary for survival. And in some circumstances, such as in a dictatorship, acting morally decreases the individual’s chances of survival, a point that Rand herself convincingly dramatizes in We the Living and Anthem. A survivalist ethics can support, at best, a bare-bones Hobbesian morality, not a virtue ethics. If Rand’s virtues were necessary for survival, the human species would have perished a long time ago, instead of expanding exponentially. Her rich and challenging picture of human life and virtue in her novels points to a richer and more challenging conception of the final end than mere survival. Many of Rand’s heroes, from Kira (We the Living) to Prometheus (Anthem) to John Galt (Atlas Shrugged), risk their lives for the sake of the values that make their lives worth living. Like Hobbes, Rand rightly points out that if everyone or most people were to start preying on each other, then no one would survive for long—literally, and that generations of predators would end up destroying or driving away the producers, and thus destroying themselves (Anthem and Atlas Shrugged). But this doesn’t show that a few predators in a society of producers cannot survive by predation. Indeed, Rand herself sometimes acknowledges that evil people can survive by free-riding (“hitch-hiking”, as she calls it) on rational, productive people: If some men attempt to survive by means of brute force or fraud … it still remains true that their survival is made possible only by their victims, only by the men who choose to think and to produce the goods which they, the looters, are seizing. (1961b: 25) Rand often says that the final end is survival proper to a human being (1961b: 26), or that the final end is happiness (1961b: 27, 30). Neither can be reduced to survival simpliciter. In “Man’s Rights”, Rand explains an individual’s right to his own life as the freedom to take all the actions required by the nature of a rational being for the support, the furtherance, the fulfillment and the enjoyment of his own life. (1963b: 93 and 1967a: 321–22) “Life” here is explicated in terms of not only continued survival but also of fulfillment and enjoyment.\n\nFor all these reasons, a more plausible interpretation of Rand’s view is that morality is required for surviving qua human being, that is, for living a life proper to a human being.\n\n2.3 Survival Qua Man as the Ultimate Value\n\nJust as the standard of value is survival qua human being, so the ultimate goal is one’s own survival qua human being. To accept this standard and goal is to accept (i) the three cardinal values of reason, purpose (or purposiveness) and self-esteem as not only “the means to” but also “the realization of one’s ultimate value, one’s own life” (1961b: 27), and (ii) the three “corresponding virtues” of rationality, productiveness, and pride. These values are means to one’s life insofar as they further one’s life as a rational being, and they realize it insofar as they express the value we place on our lives.\n\nWhat it means to value survival qua human being turns on the relationship of the three cardinal values to the three virtues. Rand often states that virtue is only a means to value. But when she explains how the three cardinal values “correspond” to their three virtues, she does not provide a means-end analysis (Badhwar 1999, 2001). Thus, she says:\n\nProductive work is the central purpose of a rational man’s life, the central value that integrates and determines the hierarchy of all his other values. Reason is the source, the precondition of his productive work—pride is the result. (1961b: 27)\n\nThe virtue of productiveness becomes the central example of purpose (one of the three cardinal values), reason (another cardinal value) becomes its source, and the virtue of pride becomes its result. Rand also defines rationality, which is “the basic virtue”, in terms of\n\nthe recognition and acceptance of reason as one’s only source of knowledge … and one’s only guide to action. (1961b: 28)\n\nBy this definition, being rational means valuing reason in thought, word, and deed, and realizing reason in one’s life means being rational: the virtue and the value entail each other.\n\nThis point generalizes to all the virtues and values. Further, since the (cardinal) values are both “the means to” and “the realization of one’s ultimate value” (1961b: 27), it follows that the (cardinal) virtues are also both the means to and the realization of one’s ultimate value: long-term survival qua human being. On this interpretation, to survive qua human being is none other than to lead a virtuous life in which one has realized one’s potential.\n\nBoth survivalists and eudaimonists, however, point out that this conception of the final end contradicts Rand’s oft-repeated claim that “Virtue is not an end in itself.…” In addition, eudaimonists make the following objections:\n\nSince even a long, virtuous life need not be a happy one, positing it as the final end contradicts Rand’s related claim that “Life is the reward of virtue—and happiness is the goal and reward of life” (1957 [1992]: 939). It contradicts Rand’s conception of the final end in her novels, where happiness is proclaimed as “the purpose, the sanction and the meaning of life” (1957 [1992]: 674).\n\nIn addition, it is psychologically implausible to hold that we would choose mere survival as an end even if we were deeply unhappy and saw no happiness in our future (cf. Wright 2019 20).\n\nEudaimonists hold that the dominant and/or more plausible view expressed in Rand’s writings is that happiness—a happy life—is the ultimate value, where a happy life is understood as a life of emotional fulfillment in worthwhile goals and activities. Happiness in this sense necessarily involves virtue, but is not identical with virtue (Den Uyl & Rasmussen 1978; Machan 1984, 2000; Mack 1984; Badhwar 1999, 2001; Hunt 1999; Long 2000).[4]\n\n2.4 Happiness as the Ultimate Value\n\nHappiness is the existentially and psychologically “successful state of life” (1961b: 27). As an emotion it is not simply a positive subjective state, as on some contemporary views, but an emotion that meets certain normative standards: “a state of non-contradictory joy—a joy without penalty or guilt”, achievable only by\n\nthe man who desires nothing but rational goals, seeks nothing but rational values and finds his joy in nothing but rational actions. (1961b: 32)\n\nHappiness is also a form of life-affirmation:\n\nthe feeling of one’s blessing upon the whole of the earth, the feeling of being in love with the fact that one exists and in this kind of world. (1957 [1992]: 105–6)\n\nThus, happiness is an emotionally positive state of mind in an objectively worthwhile state of life.\n\nRand holds that the pursuit of happiness is inseparable from the activity of maintaining one’s life through the rational pursuit of rational goals (1961b: 29, 32). A virtuous life is, thus, essential to happiness. It is also a shield against soul-wracking unhappiness. Just as even great misfortunes don’t throw Aristotle’s virtuous individual into misery, they don’t throw Rand’s heroes into misery. Even at the worst of times, the virtuous individual’s pain “only goes down to a certain point” (1943: 344), never touching the core of her being: the conviction that she is worthy and capable of happiness.[5]\n\nIn keeping with their richer conception of the final end, Rand’s novels also employ a richer conception of virtue as an integrated intellectual-emotional character trait to think, feel, and act in certain ways, rather than simply as an act in light of a recognition of certain facts (Badhwar 1999, 2001). Her characters reveal their souls not only in what they say or do, notice or fail to notice, focus on or evade, on this or that occasion, but in their cognitive, emotional, and action dispositions, their style of being in the world. Their actions show not only an intellectual commitment to the right but a wholehearted “love of rectitude” (1957 [1992]: 512).\n\nThis basically Aristotelian view of virtue goes hand-in-hand with a basically Aristotelian view of emotions. Rand rejects the reason-emotion dichotomy as stemming, ultimately, from a false mind-body dichotomy. Emotions are neither raw feelings nor inherently irrational but, rather, automatized value-judgments:\n\nestimates of that which furthers man’s values or threatens them … lightning calculators giving him the sum of his profit or loss. (1961b: 27)\n\nEmotions provide instant guidance when circumstances do not permit reasoning everything out anew. But our emotions are only as good as our reason, because they are “programmed” by our reason. Hence they can only be corrected by conscious reasoning, and in a conflict between reason and emotions, one must always side with the former.[6]\n\nEudaimonists argue that Rand’s vision of a virtuous and happy life in her novels can be understood only as a form of eudaimonism, even if she sometimes makes statements inconsistent with this vision. The chief objection to eudaimonism is that, by defining a happy life partly in terms of virtue, it employs an unconvincing conception of happiness. The philosophical literature on happiness in this sense (usually called well-being) makes and answers this and other such objections (Annas 1993, Haybron 2008, Badhwar 2014).\n\n2.5 Virtues, Vices, and Egoism\n\nThe chief Objectivist virtues are rationality, integrity, honesty (with self and others), justice, independence, productiveness, and pride. Rationality,\n\none’s total commitment … to the maintenance of a full mental focus in all issues, in all choices … to the fullest perception of reality within one’s power, (1961b: 28)\n\nis the basic virtue of which the other virtues are aspects or derivatives. The virtues are thus united or reciprocal. Each virtue is defined partly in terms of a recognition of, and appropriate responsiveness to, some important fact or facts, a recognition and responsiveness understood by the agent to be indispensable for gaining, maintaining, or expressing her ultimate value. For example, integrity is “the recognition of the fact that you cannot fake your consciousness” (1957 [1992]: 936), a recognition that is expressed in loyalty to one’s rational values and convictions, especially in the face of social pressures to surrender them (1961b: 28; 1964a: 52, 80); honesty is “the recognition of the fact that you cannot fake existence”, a recognition that is expressed in truthfulness in thought and speech (1957 [1992]: 936–37); and justice is\n\nthe recognition of the fact that you cannot fake the character of men as you cannot fake the character of nature, … that every man must be judged for what he is and treated accordingly…. (1957 [1992]: 937)\n\nConspicuous by their absence from Rand’s list of the cardinal virtues are the “virtues of benevolence”, such as kindness, charity, generosity, and forgiveness. Rand states that charity is not a major virtue or moral duty (1964b); likewise, presumably, kindness, generosity, and forgiveness. Whether, and how much, one should help others depends on their place in one’s rationally defined hierarchy of values, and on the particular circumstances (whether they are worthy of help, what the likely consequences are of helping them, and so on). The greater their value vis-à-vis one’s rational self-interest, the greater the help that one should be willing to give, ceteris paribus. What is never morally appropriate is to make a sacrifice, that is, to surrender something of value to oneself for the sake of something of less or no value to oneself. Thus, it can never be moral to knowingly risk one’s life for a stranger (unless, of course, one’s life is no longer worth living) or to court unhappiness for the happiness of another, whether stranger or friend. It is appropriate to help a stranger only in an emergency, and only when the risk to our own life or well-being is minimal (1963c: 43–45). This should not be taken to imply that helping a stranger is always morally optional, regardless of the circumstances. Indeed, people who are “totally indifferent to anything living and would not lift a finger to help a man or a dog left mangled by a hit-and-run driver” are “psychopaths” (1963c: 43–45) Rand makes even more concessions to “common sense morality” when she states that it’s good to help a neighbor going through a hard time till he can get back on his own feet, if we can afford to and if we have no reason to think that he is undeserving. Charity understood thus is a virtue because it is an expression of the generalized good will and respect that all normal people have towards others as creatures who share with them the capacity to value (1963c: 46–47). Nathaniel Branden tries to reconcile charity with egoism by declaring that the former stems from a species-identification with another, such that, in revering others, people “are revering their own life”. By acting charitably, people actualize this sense of kinship, without sacrificing their own well-being.\n\nThis last is true, but the desire to reduce all proper motivations to egoistic motivations leads Branden (and Rand and many Objectivists) to ignore the fact that charity is first and foremost profoundly other-regarding, prompted by another’s plight rather than concern for one’s own self-actualization. The same is true of trying to rescue a dog mangled by a hit-and-run driver, where the egoistic motivation must be even weaker, since here there is no species-identification, but rather only a “genus-identification” with another sufferer.\n\nThe problem with Rand and Branden’s ethical egoism can be sharpened by asking why we should not harm others, for example, by spitefully stepping on their gouty toes. Rand and Branden’s answer has to be: because doing so will harm us. But why will it harm us? Because we have unjustly and irrationally hurt another out of spite, and injustice and irrationality are bad for us. But our action wouldn’t be unjust and irrational if it didn’t hurt them – if, in fact, stepping on their toes cured their gout and we did it for that reason. Clearly, then, the wrongness of our action and motivation depends, in the first instance, on what we know it will do to our victims. This is why we ought to apologize to them, and not to ourselves. It’s right and important to consider the effect on ourselves of being spiteful, unjust, and irrational, but there is no good argument for the view that we ought to be just to others only or primarily because it is good for us. All other-regarding virtues are responses to other people’s moral standing.\n\nAt any rate, the argument from identification can also be used to justify charity towards strangers in non-emergency situations, for example, towards those who are permanently disabled and unable to care for themselves (Badhwar forthcoming). Rand concedes as much in “What is Capitalism?” (1965) where she argues that people who are unable to work must rely on voluntary charity, thus implying that it is proper for those who can afford it to support strangers in non-emergency situations. And indeed, as recent scholarship has revealed, in her own life Rand was often extremely generous, not only towards friends and acquaintances, but also strangers.[7]\n\nThe question arises why Rand thinks that charity, kindness etc. are not major virtues when they meet all the conditions of appropriateness: the recipient is worthy of help, one can afford to help, it is in one’s rational self-interest (or not contrary to it) to help, and so on. Perhaps Rand thinks that they are “minor” virtues because we are not obligated to act on them at all times, the way we are obligated to act justly and honestly at all times. A deeper reason, however, might be her conception of people as essentially agents rather than patients, doers rather than receivers, self-sufficient rather than dependent. Nevertheless, Rand’s view of the unity of the virtues dictates that, even if we are not obligated to act on charity, kindness etc. at all times, they are just as important to possess as the other virtues. Moreover, in keeping with her emphasis on the importance of goodwill towards others and “the benevolent universe premise”, Rand’s heroes are often extraordinarily (and almost always appropriately) kind and generous, not only towards those they love but also towards mere acquaintances, and even sometimes adversaries. Striking examples include, from The Fountainhead, Howard Roark’s unsought-for attempt to give hope and courage to Steven Mallory, the gifted young sculptor whose failure to get work has driven him to the verge of a spiritual and physical collapse, and Roark’s unreproachful help to his erstwhile adversary, Peter Keating, when Keating falls on hard times. In Atlas Shrugged, Dagny offers support to a heart-broken and despairing Cheryl Taggart who, in the past, has treated Dagny with scorn, and Hank Rearden generously supports his exploitative family before he realizes their exploitativeness.[8] Rand’s implicit recognition that kindness and generosity are important virtues is shown also in her depiction of her villains as lacking all kindness and generosity.\n\nJust as rationality, a focus on reality, is at the heart of every virtue, so irrationality, evasion of reality (including self-deception), is at the heart of every vice. Rand’s villains are all master evaders motivated by a desire for power, social status, fame, or unearned wealth, and resentment of the good. They are “second-handers”—people whose primary relationship is to other people rather than to reality. Between the virtuous and the vicious are the “innocently wrong”, people who adopt wrong moral principles or make wrong choices, not through evasion but through an error of judgment (Rand does not explicitly recognize any moral category other than virtue, vice, and moral error, although her novels portray characters that do not easily fit into any of these categories). Hank Rearden, in Atlas Shrugged, is the great innocent living under a burden of unearned guilt because of his mistaken sense of honor and a family interested only in manipulating and using him. Cheryl Taggart is killed by the too-sudden revelation that the man she loved and admired as the embodiment of her ideals is a fraud—and that the world is full of such frauds.\n\nAs already indicated, Rand justifies virtue in both instrumental and non-instrumental terms, though without distinguishing between them. The instrumental arguments show the existential and psychological rewards of virtue and costs of vice. In her depiction of her heroes, Rand shows her conviction that virtue creates an inner harmony and serenity. Virtue also makes one trustworthy, and thus enables mutually beneficial interactions with others. Evasiveness, by contrast, traps one in a “tangled web” of rationalizations and pretenses. The evader who deceives others is either eventually caught, or lives in fear of getting caught, becoming dependent on others’ unconsciousness. He is “a fool”, says a character in Atlas Shrugged, “whose source of values is the fools he succeeds in fooling” (1957 [1992]: 945). Further, like Sartre, Rand holds that no evasion is completely successful, because the truth constantly threatens to resurface. Hence, the evader’s “diseased soul” is in a state of constant inner conflict and anxiety as he tries to suppress his awareness of uncomfortable truths while maintaining his hold on others. His lack of integrity and of esteem for reality results in a lack of self-love or self-esteem and, indeed, of a solid self. (It is noteworthy, however, that Rand’s portrayal of Gail Wynand in The Fountainhead is closer to Aristotle’s portrayal of the vicious man in Book III of the Nicomachean Ethics as someone who is “unconscious of his vice” than to her own stated view of the evader.)\n\nThese views are familiar from the history of philosophy, but many readers find their expression in Rand’s novels to be of unusual psychological depth and conviction. Nevertheless, the views are subject to the well-known objection that the complexity and variability of human psychology and society allow only “for the most part” generalizations about the existential and psychological benefits of virtue or costs of vice. For example, it is possible for a small injustice to lead to great rewards, especially since others are willing to shrug off or forgive occasional transgressions. It is also possible for poor introspection, forgetfulness, or self-acceptance to allow one to evade something without any need for supporting evasions or damage to one’s self-esteem. Again, even if every wrongdoing carries psychological costs, these might sometimes be outweighed by the long-term psychological and existential costs of doing the right thing (as Rand herself suggests in her portrayal of the embittered Henry Cameron and Stephen Mallory in The Fountainhead).\n\nThe non-instrumentalist justification of virtue in Rand’s novels is largely immune to these objections (though subject to the objections noted in 2.4 above). To compromise morally is, necessarily, to compromise one’s own (objectively conceived) happiness, because no existential loss can compare to the loss of moral integrity. Rectitude is partly constitutive of genuine happiness because it expresses the right relationship to reality: to existence, to oneself, and to others. For the same reason, it is partly constitutive of a self worth loving, an ideally human or rational self. Any value gained at the price of rectitude is only the simulacrum of genuine value. In a variety of conceptually interconnected ways, then, virtuous individuals are necessarily better off than those willing to take moral short-cuts. In its structure and much of its content, Rand’s ethical egoism is thus of a piece with the egoism of ancient eudaimonistic theories.\n\nOf course, this non-instrumentalist justification of virtue depends on the prior instrumentalist justification, viz., that in normal circumstances (that is, in a society of more or less virtuous people), virtue enables us to gain both external and psychological goods. If justice or kindness were systematically bad for human beings, leading to disease and death, they would not be virtues. If rationality routinely led to an early demise, no one would value rationality. But this does not entail, as Salmieri seems to think, that the ultimate value is literal survival (Salmieri 2019). All it entails is that the virtues be compatible with survival in normal circumstances. For it is easy to see that if justice or kindness systematically led to deep depression, and rationality routinely sucked the joy out of life, only the rare misery-lover would value his life, or the virtues. Survival is a necessary condition of a happy life (as well as an unhappy one), not an ultimate value. And it’s only because the virtues lead to, and partly constitute, a happy (eudaimonic) life, that a virtuous person considers it a greater loss to betray his principles than to lose the work he loves – or, sometimes, even his life. One of the best examples of this from Rand’s own work is Howard Roark’s decision to act out of integrity, even at the cost of being unable to practice architecture (The Fountainhead). Another example concerns two minor characters in We The Living who risk – and lose – their freedom and lives for resisting the new communist regime. (Note, however, that Rand does not think that we are morally obligated to martyr ourselves to fight evil. All we are obligated to do is not be complicit in evil, or betray our values.)\n\nEven on this indirect, sophisticated egoism, where the good to the agent lies in being virtuous, Rand’s theory is open to the objection often levied against egoistic theories, viz., that they give the wrong reason for acting in other-regarding ways – justly, kindly, etc. My act does not adequately express the virtue of justice if I give you your due solely or primarily because acting justly is good for me rather than because I recognize and respect your moral standing, your entitlement to be treated justly. Nor does my helping you when you need help adequately express goodwill or kindness if I help you solely or primarily because acting benevolently is good for me. One way out taken by some other theories is to argue that the egoist’s justification is egoistic but not her motivation. Rand does not address the “wrong-reason” objection, but there is no hint in her writings that she would accept this dichotomy between justification and motivation. The root of the problem is that, although Rand rejects psychological egoism, she seems to regard genuine goodwill towards, or love of, others as an offshoot of proper self-love, as though there were no independent source of love for others in human nature. This is where her metaethics and ethics differ most starkly from that of Aristotle.\n\n2.6 Altruism\n\nAccording to Rand, there is only one alternative to being rationally self-interested: sacrificing one’s proper interests, either for the sake of other people (which she equates with altruism) or for the sake of the supernatural (which she calls mysticism) (1982a: ch. 7). “The basic principle of altruism”, she argues, “is that man has no right to exist for his own sake, that service to others is the only justification of his existence, and that self-sacrifice is his highest moral duty, virtue and value” (“Faith and Force,” PWNI 61). Kant’s ethics is a secularized mysticism insofar as it rests on categorical commands and duty for duty’s sake, which is to say: regardless of any earthly desire or interest (1970). An altruistic ethics equates right action with self-sacrifice for the sake of others’ good and immorality with “selfishness”, while saying nothing about the standard of the good (“Introduction”, 1964a: iii; 1974). It thus fails to answer the prior question of what code of values we should follow and why, and provides no motivation to be moral other than guilt over “selfishness”. When taken to its logical conclusion, altruism does not simply tell us that it is “selfish” to pursue our own desires, but also that it is “selfish to uphold… [our own] convictions, … [that we] must sacrifice them to the convictions of others” (Rand 1957 [1992]: 943; Galt’s Speech, Rand 1961a: 142). In foreign policy, altruism is used to justify and gain support for America’s intervention in other countries (1966a). Altruism is also the reason why so many sympathize with, or even praise, bloody dictatorships that proudly proclaim that the sacrifice of the individual is a necessary and noble means to the goal of the collective good (Rand 1966a).\n\nAs a moral code, altruism is impractical, because its requirements are contrary to the requirements of life and happiness, both the agent’s and other people’s. As such, it is also profoundly immoral. Altruism leaves us without any moral guidance in our everyday lives and gives morality a bad name.\n\nWhat, then, is the psychological explanation for the widespread equation of altruism with morality? Rand suggests various explanations reminiscent of Nietzsche’s analysis of the psychology of altruism. The theorists and preachers of altruism are motivated largely by a desire to control and manipulate others by playing on their guilt. Those who accept their teachings typically do so either because of guilt over their own superior achievements, or because, lacking any “intellectual integrity, love of truth…or a passionate dedication to an idea”, they have nothing much worth saving, and so do not mind sacrificing themselves (“Selfishness Without a Self”, 1973b; 1982a). Some altruists are altruists because their mentalities are still frozen in a tribal past when survival required the sacrifice of some for the sake of others (1973b). Rand herself rejects a zero-sum picture of human relationships, so long as everyone in the relationship acts rationally.\n\nRand’s defense of “selfishness” (rational self-interest) and rejection of altruism (living for others’ sake) are part of the reason both for her popularity with the general reader, and her unpopularity with philosophers and other intellectuals, although some would no doubt agree with her rejection of abject self-sacrifice and her recognition of proper concern with the self as moral (Falk 1963; Gilligan 1982; Hampton 1993; Badhwar 1993a). The general reader who responds positively to Rand’s work finds, for the first time, a moral justification for pursuing a life of her or his own and a liberation from “unearned guilt”. The philosopher who responds negatively to her work finds many biased and simplistic interpretations of philosophers and philosophical doctrines, including her claim that she is the first to consistently defend a morality of rational self-interest, all other philosophers having defended either altruism or mysticism (Pojman 1995). Her critics also challenge her equation of altruism with abject self-sacrifice (Rachels 2000, Flew 1984), and her claim (explained below) that there is no conflict between people’s rational interests (Flew 1984).\n\n3. Social-Political Philosophy\n\n3.1 Rights, Capitalism, the Trader Principle, and Government\n\n“Force and mind are opposites; morality ends where a gun begins” (Atlas Shrugged 1023). Not only actually shooting someone, but also threatening him with a gun, is an act of force. The non-initiation of force against others is the basic moral principle guiding our interactions with others, whether in a political society, or in the state of nature. It is also the basic political principle: “no man may initiate the use of physical force against others. … Men have the right to use physical force only in retaliation and only against those who initiate its use” (1961b, 1964a: 36). This political principle binds not only individuals in their interactions with each other, but also, importantly, the government. Rand’s ideal society is a society of independent individuals who respect each other’s rights to life, liberty, and property, and who trade value for value, materially and spiritually. They live, in her words, by “the trader principle”. Individual rights and the trader principle are both dictated by the fact that, as rational, independent beings, we need to think and act for our “proper survival” (1961b: 31). Both are based in human nature, and required by respect for individuals as ends in themselves, not mere means to others’ ends. But what exactly is a right?\n\n“Rights” are a moral concept—the concept that provides a logical transition from the principles guiding an individual’s actions to the principles guiding his relationship with others—the concept that preserves and protects individual morality in a social context—the link between the moral code of a man and the legal code of a society, between ethics and politics. Individual rights are the means of subordinating society to moral law. (1963b: 92).\n\nAgain,\n\nA “right” is a moral principle defining and sanctioning a man’s freedom of action in a social context. (1964a 93).\n\nThese rights are based in human nature, and are basically rights to actions, not to things or outcomes, and they can be violated only through the initiation or threat of force, or through fraud. Hence, all natural rights are negative, that is, claims on others’ non-interference, and not claims on them to provide one with certain goods or outcomes.[9] The fundamental right is the right to life: the right to take the actions necessary for sustaining the life proper to a human being.\n\nThe right to life means…the freedom to take all the actions required by the nature of a rational being for the support, the furtherance, the fulfillment and the enjoyment of his own life. (Such is the meaning of the right to life, liberty and the pursuit of happiness.). (1963b: 93)\n\nThe right to liberty is the right to act (including to write and speak) on one’s judgment; the right to the pursuit of happiness is the right to pursue goals for one’s own fulfillment; the right to property is “the right to gain, to keep, to use and to dispose of material values” (1963b: 94). Like the mind-body dichotomy, the common dichotomy between “human rights” and the right to property is a false one, because to own one’s life is to own one’s actions and their fruits (1962b: 91).[10] Just as there is a causal and logical connection between the virtues, so there is between these rights: a government that violates human rights also violates property rights. Thus, for example, in violating the right to freedom of expression by banning “obscene” speech on TV, the government violates the property right of the owners of the TV station to use their property as they see fit. Like other libertarians, both right (market) and left (egalitarian), Rand opposes state regulation of morality, as well as forced service to the state, whether military or civilian. She criticizes both conservatives and liberals (as these terms are understood in American politics) for wanting government to control the realm they regard as important: the spiritual or moral realm in the case of conservatives, and the material or economic realm in the case of liberals (1981b). Both sides thus betray a lack of understanding of the fact that human beings need to be free in both realms to be free in either.\n\nCritics have pointed out that if we have rights only because we need them for our survival and happiness, then we have no right to take actions that are contrary to our survival and happiness, such as blindly following a guru instead of thinking for ourselves, living off others because we prefer the life of a couch potato to fending for ourselves, wasting our property instead of using it wisely, or, most obviously, committing suicide (Mack 1984; Zwolinski 2019). Yet the freedom to do only that which is morally good or rational is no freedom. But there is another interpretation of the claim that “The right to life means…the freedom to take all the actions required by the nature of a rational being for the support, the furtherance, the fulfillment and the enjoyment of his own life.” What Rand is pointing out here is that we would not have rights if we did not need them for our survival and happiness (Badhwar 2017, Miller & Mossoff 2019). This need (and the fact that we value our survival and happiness) is the source of rights. If by our very nature we didn’t care whether we lived or died, didn’t care about being forced by the government or other people to act in certain ways and not others, had no use for property, and couldn’t be bothered to think for ourselves, we would have no rights. It doesn’t follow, however, that we don’t have the right to act contrary to the requirements of our survival or happiness. As Rand says elsewhere:\n\nA right is the sanction of independent action. A right is that which can be exercised without anyone’s permission (Rand 2018 83). [A] right is the moral sanction of a positive, of his freedom to act on his own judgment, for his own goals, by his own voluntary, uncoerced choice. (Rand 1963b 93.)\n\nIn spite of several statements that justify such freedom in terms of the individual’s rational judgments (Rand 1965 17), it is the position taken here that is compatible with Rand’s deep-seated commitment to liberty and a minimal government.\n\nAnother criticism of Rand’s theory of rights is that it is incompatible with her ethical egoism, because respect for others’ rights cannot be justified as a means to the ultimate end of one’s survival (Mack 1984; Flew 1984). For under perfectly realistic scenarios, one’s survival can require one to violate another’s right to life or property. Thus, according to these critics, Rand’s defense of rights suffers from the same unresolved tension between the instrumentalist strand and the deontic strand that we find in her justification of morality in general (Mack 1984, 2003). On our eudaimonistic interpretation of Rand’s ethical egoism and theory of rights, there is no incompatibility between the two. Nevertheless, as we’ve argued above, both her ethical egoism and her theory of rights face the criticism that the primary reason for respecting others’ rights, or exercising any of the other-regarding virtues, is not one’s eudaimonia but the fact that others are ends in themselves. What promotes our eudaimonia is recognizing this and living accordingly, but our own eudaimonia is not the primary reason for respecting people’s rights.\n\nEverything said so far shows that Rand believes that individuals have rights even in a state of nature, or a society without a government. Yet in later years, in a workshop on rights, Rand suggests that rights exist only in a society with some kind of authority and a “formulated morality” (2018: 111). It is not clear what Rand means by “formulated morality”: a written, or at least explicitly stated, morality that recognizes rights, like the Bill of Rights in the U.S. Constitution? Or like Thomas Paine’s Rights of Man?? But aren’t there many societies – perhaps a majority – that don’t have a formulated morality yet do recognize at least individuals’ basic rights against each other and the government, and many that can produce paper Constitutions claiming to recognize these rights that, in fact, they deny their citizens? In any case, Rand takes back her controversial statement by reiterating her earlier view that:\n\nThe source of man’s rights is not divine law or congressional law, but the law of identity. A is A and Man is Man. Rights are conditions of existence required by man’s nature for his proper survival (“Galt’s Speech,” Rand 1961a: 182).\n\nWhat we don’t have in the absence of a government, she says, is objectively defined laws that can determine if a right has been violated (2018: 211). A “proper government,” in her words, “is the means of placing the retaliatory use of physical force under objective control, i.e., under objectively defined laws” (1963a: 128).\n\nOnkar Ghate (2019) and Harry Binswanger (2019) both defend this view. Ghate uses two scenarios involving individuals in a state of nature. Suppose you are by yourself on a desert island, and you domesticate a pig. Then someone from a neighboring tribe steals it. Do you have a right to retaliate by stealing some of his property, or stealing from his relatives? Again, suppose Robinson Crusoe and Friday are strangers sharing an island, and Crusoe invents a superior spear. Does Friday have a right to copy it? Ghate’s main point is that because individuals in his scenarios don’t have a government, they don’t have objectively defined laws, and because they don’t have objectively defined laws, the boundaries of their property rights are unclear. But Ghate does not explain why you, the pig owner, cannot talk to the tribe and come up with a mutually agreeable solution, or why Crusoe and Friday can’t talk things over and decide on the boundaries of their rights vis-a-vis each other (if Crusoe has any common sense, he’ll encourage Friday to copy his spear and propose that they cooperate in their future hunts). Of course the tribe and you might not be able to reach a resolution satisfactory to both of you. But that doesn’t mean that it is in principle impossible to do so. Neither Rand nor Ghate (2019) provide an explanation of why a peaceful society of people without a government cannot come up with objective laws that define the boundaries of their rights – as, in fact, they do in Rand’s Atlantis: Galt’s Gulch. Their view seems to imply that if the Founding Fathers had been shipwrecked for 5 years on a desert island, they could not have come up with a Bill of Rights that defined the limits of their liberties vis-a-vis each other, or set up a fair system of adjudication in the event of a dispute. But we don’t have to engage in hypotheticals. As many scholars have pointed out, starting in the 11th C, merchants from various countries created the body of law called the Law Merchant in order to protect foreign merchants not protected by the local laws (Benson 1989; see the entry on law merchant at libertarianism.org, linked from Other Internet Resources). The Law Merchant was uniform throughout Europe, and enforced by courts also created by merchants in European cities, without the involvement of any European government.\n\nRand argues that the only just social-political system, the only system compatible with our rational nature and with the right of individuals to live for their own sakes, is capitalism (1965, 1967b), that is,\n\nlaissez-faire capitalism—with a separation of state and economics, in the same way and for the same reasons as the separation of state and church. (1961b, 1964a)\n\nState regulation of the market, she argues, is responsible for corrupting both state and market institutions, just as political regulation of religion (or religious regulation of politics), wherever it exists, corrupts both state and religious institutions. Regulation creates the opportunity for the trading of favors between politicians and religious leaders, and politicians and businesses. Atlas Shrugged offers a complex and compelling depiction of the economic, political, and moral corruption spawned by “cronyism” between government and business. Laissez-faire capitalism is “the only [social] system that bans force from social relationships” domestically and abroad, because the trader and the warrior are antagonists (Rand 1966a). Rand’s conception of capitalism is, thus, more radical than the mainstream conception, and her defense of it significantly different both from the utilitarian defenses given by most economists, and the religious defenses given by many conservatives (for discussion, see Den Uyl & Rasmussen 1984b; Machan 1984). She does, of course, praise capitalism (or semi-capitalism) for creating widespread prosperity, but this feature is itself explained only by the fact that it leaves individuals free to produce in peace. In Atlas Shrugged, Rand distinguishes between the few business people who earn their money through honest effort, without seeking favors from the government, and the vast majority who are members of “the aristocracy of pull” (“crony capitalists”, in contemporary terminology) and get rich only through such favors, a situation that she thinks prevails, and has always prevailed, in the real world (Rand 1964c). She holds that for a short period in the nineteenth-century America came closer to a laissez-faire system than any other society before or since, but that capitalism remains an unknown ideal. Some critics complain, however, that in her non-fiction (1961c) Rand does not always recognize the aristocrats of pull in the real world—business leaders who lobby politicians for subsidies for themselves and restrictions on their competitors (Rothbard 1968; Johnson 2006).\n\nRand rejects the criticism that unregulated, laissez-faire capitalism would lead to a concentration of power in a few hands and undermine people’s ability to lead their own lives, because laissez-faire capitalism requires the rule of law, a well-defined system of property rights, freedom of contract, and, as a corollary, a government that abstains from all favoritism. In such a society, competition and opportunity will flourish, and prevent concentration of power in a few hands.\n\nRand holds that there is no conflict between one person’s rational interests and another’s, hence that there is no conflict between their rights (1962a, 1964a: 57–65). Is it true, however, that rational interests cannot conflict, or that, if they do, it follows that rights must also conflict? Our answer to both questions is ‘no’. We think that whenever two or more people have a rational interest in one good, there is potential for conflict, and sometimes that potential is actualized. To show otherwise, Rand considers a situation in which two people apply for the same job, and the better candidate gets the job. There is no conflict of interests here, she argues, because the better candidate has earned the job, and the loser cannot rationally wish to have been given the job. Both applicants also know that competition for jobs is a good thing, because the business would close if only one person applied for its jobs (presumably, because that would mean that the business wasn’t doing very well).\n\nBoth points are well-taken. But what if the employer is not rational and gives the job to the somewhat less qualified applicant because, say, he reminds the employer of his long-lost brother? Or, what if the two candidates are equally qualified, and the hiring committee chooses one over the other by tossing a coin? In both cases there is a conflict of interests between two rational applicants. Rand raises the first possibility, that of the irrational employer, but doesn’t trace its implications for her thesis that rational interests don’t conflict. The second possibility, that of two equally qualified candidates, she does not consider at all. Rand would be on firmer ground if she were to argue that there is no necessary conflict between rational interests, that is, that it is not in their nature to conflict. When they conflict, it is due to contingent factors, such as only one job for two equally qualified people. In any case, a conflict between rational interests does not entail a conflict between rights, since, as Rand herself points out, neither party has a right to the job.\n\nRand defines government as:\n\nan institution that holds the exclusive power to enforce certain rules of social conduct in a given geographical area. (1963a: 125)\n\nA proper government is:\n\nthe means of placing the retaliatory use of physical force under objective control—i.e., under objectively defined law. (1963b: 128)\n\nSuch a government is minimal, limited to protecting us from criminals and foreign aggressors, and enforcing individual rights and contracts with the help of the police and armed forces, using objectively defined civil and criminal laws and courts. Someone who violates his contracts, or engages in fraud, is guilty of the “indirect” use of force, in that he obtains a value from another without that person’s consent (1963a: 111). Accordingly, the government may use or threaten force only in retaliation against those who initiate or threaten force directly or indirectly. A government that tries to enforce the brother’s keeper principle—“from each according to his ability, to each according to his need”; or that drafts citizens into the armed services or “public service”; or that forces them, directly or indirectly, to become more virtuous, well-mannered, healthy, or wealthy, violates rights. Statism in all its forms, from unlimited democracy to a mixed economy to dictatorship, is at odds with our status as independent, rational beings, as ends in ourselves. Statism also destroys ability and fails to fulfill anyone’s needs for long, because “[t]o deal with men by force is as impractical as to deal with nature by persuasion” (1973a: 32). The fountainhead of all progress is the human mind, and the mind does not function well when forced.\n\nIn Atlas Shrugged Rand depicts her utopia, Galt’s Gulch, as a “voluntary association of men held together by nothing but every man’s self-interest”, without any formal organization (1957 [1992]: 690). There is a judge to arbitrate disagreements, but there has never been any need for arbitration. Galt’s Gulch is, thus, an anarchist society, although Rand never calls it that. In “The Nature of Government”, however, Rand rejects anarchism as irrational and unworkable because, she says, it is incompatible with a single, objective system of law and, thus, with rights and peaceful cooperation (1963a; cf. 2018b). Anarchist critics, such as Roy Childs (1969 [1994]) and Murray Rothbard (1978), have argued that a territorial monopoly on law and force (government) is not necessary, because people can establish a just and effective legal system in a competitive market of security providers (see Long and Machan 2009). The Law Merchant, a body of law established and enforced in private courts by the merchants of various countries, illustrates the possibility of an effective voluntary legal system. Further, a government is incompatible with Rand’s own principle of the non-initiation of force, a principle she regards as the linchpin of a moral society (Long 2013; cf. Cox 2013a and 2013b).\n\nThe trader principle states that a voluntary, mutually beneficial exchange between independent equals is the only basis for a mutually respectful and rational relationship (1961b: 31). It is also the only basis for a peaceful relationship among countries: “the trader and the warrior have been fundamental antagonists throughout history” (1966a: 38).\n\nThe trader principle applies to emotional relationships as well. To love or admire someone is to “pay” him for the pleasure one derives from his virtues (1961b: 31)—or, Rand might say in the case of love for a small child, from his personality. It would seem, however, that the trade between parent and child is unequal, given that the child receives both pleasure and material support from the parent. And it is unclear how the trader principle applies at all when a severe disability renders a beloved child or spouse a source of pain rather than pleasure.\n\n3.2 Feminism\n\nIf feminism is the view that women are, and ought to be recognized as, men’s intellectual, moral, sexual, and political equals, then the Objectivist philosophy of human nature is inherently feminist, since it applies equally to all human beings, regardless of gender (or race) (N. Branden 1999). Decades before it was considered acceptable for women to lack “maternal instincts” or pursue careers, Rand created heroines who lack the first and pursue the second, free of guilt or self-doubt.[11] Kira (We the Living) wants to be an engineer, and Dagny (Atlas Shrugged) runs Taggart Transcontinental, the largest and most successful transcontinental railroad in the country. None of Rand’s heroines sacrifices her interests, intellect, or principles for the man or men in her life. One literary critic argues that Dagny is the first, and perhaps only, epic heroine in Western literature because of the grandness of her vision, her courage and integrity, her unusual abilities, and her national importance (Michalson 1999). Rand’s depiction of her heroines’ enjoyment of sex and their freedom from all merely conventional norms about sex anticipates the sexual liberation movement of the 20th century by at least 30 years. In all three novels, it is the heroine who has the power to choose which of the men who love, admire, and desire her (and only her) she will have. Rand was also an ardent champion of a woman’s right to control her own reproductive choices (1968a, 1981).\n\nHer relationship to the feminist movement, however, was more complex. Although she praised Betty Friedan’s The Feminine Mystique, mainstream feminism’s collectivism and emphasis on women as victims later led her to reject feminism as such. Many theorists argue that Rand’s work, especially Atlas Shrugged, upholds important feminist ideals, even as it succumbs to some anti-feminist tendencies that contradict her individualistic ethics (e.g., Gladstein 1978, 1999; B. Branden 1999; Presley 1999; Sheaffer 1999; Taylor 1999). Many others regard her and her work as plainly anti-feminist, with Susan Brownmiller even calling her “a traitor to her own sex” (Brownmiller 1975). One criticism takes aim at the individualism of Rand’s ethics and politics, which rejects any special government help for women or discrimination against men (e.g., Harrison 1978). Another objects that Rand has internalized a masculine conception of human nature and virtue, and then created her ideal woman in light of this conception (Brownmiller 1975; Glennon 1979). This may be responsible for Rand’s puzzling (and offensive) view that the essence of femininity is to hero-worship (not men, but) masculinity, while insisting (as her novels depict) that women and men are inherently equal and that the ideal romantic relationship is between moral and intellectual equals (1968b; cf. Brown 1999). At least as offensive to many are the violent sex scenes in her novels, especially the infamous scene in The Fountainhead that many regard as rape, where Howard Roark has sex with Dominique in spite of her resistance.\n\nThose who reject the charge of rape argue that in the 1940s and 50s, when Rand wrote her novels, it would have been seen as rough sex rather than non-consensual sex (McElroy 1999; Sheaffer 1999). That Rand herself thought of this scene as consensual is shown a few pages later, when she writes: “They had been united in an understanding beyond the violence, beyond the deliberate obscenity of his action” (1943: 218). And in letters to disturbed readers in 1946 and 1965, Rand denied that the scene is “actual rape” which, she stated, is “a dreadful crime”, a “vicious action and a violation of a woman’s rights” (Rand 1995a). On the other hand, she also depicts Dominique exultantly telling herself that she’s been raped. McElroy wonders if having her heroine call it rape is just another instance of Rand’s desire to provoke and shock the reader (McElroy 1999), as when she uses “selfishness” to mean “rational self-interest”.\n\n4. Aesthetics\n\nRand holds that our actions need guidance by a vision of the fundamental nature of the universe and of the efficacy of human thought and activity—a vision that can be grasped directly rather than requiring the conscious repetition of long chains of abstract reasoning. The chief function of art is to meet this psychological need by expressing abstract conceptual values and metaphysical truths in concrete perceptible form. Art, according to Rand, constitutes a selective, stylized re-creation of reality, with the principle of selection being the artist’s “sense of life”, a set of implicit “metaphysical value-judgments”, i.e., judgments about what is fundamentally significant about the world and our place in it. (There is controversy among Rand scholars as to whether what is re-created in art is certain elements of reality or reality as a whole, i.e., a “microcosm”, as well as how and whether the concept of re-creation applies to apparently non-representational forms of art: Torres and Kamhi 2000; Bissell 2004.) Both the artist’s creative work and the audience’s emotional responses to it are driven by their senses of life, that is, the worldviews they have “formed by a process of emotional generalization … a subconscious counterpart of a process of abstraction” (1966b: 27). The role of art in sustaining us psychologically by providing a concretization of our most fundamental values is a frequent theme in Rand’s fiction as well, especially The Fountainhead.[12]\n\nWhile art can be used to convey information or to advocate a position, such functions are secondary to its chief task: providing an object whose mere contemplation brings spiritual fulfillment. Hence Rand does not regard her own novels primarily as vehicles for her philosophy, though of course they are that inter alia. Given her own worldview, Rand favors literature with a strong plot as a way of expressing purposeful human action in a world of causal regularity, and stories involving value-conflicts as a way of expressing the importance of free choice; hence her preference for romantic (as opposed to, e.g., naturalistic) literature. But Rand holds that it is possible to evaluate an artwork’s aesthetic value simply in terms of its success in conveying a concretization of the artist’s sense of life, whether or not one shares the values and judgments so conveyed."}, {"url": "https://librivox.org/author/4301", "page_content": "Project type all\n\nsolo\n\ngroup\n\nLibriVox recordings are Public Domain in the USA. If you are not in the USA, please verify the copyright status of these works in your own country before downloading, otherwise you may be violating copyright laws."}]}