{"Ayn Rand's best-known work was the novel Atlas Shrugged.": [{"url": "https://book.douban.com/subject/1760380/", "page_content": "作者介绍\n\n安•兰德（1905—1982），俄裔美国作家、哲学家。青年时代从苏联流亡美国，以其小说和哲学闻名于世。小说《源泉》（The Fountainhead）1943年出版后立即成为畅销书，并为她赢得了巨大的声誉，该书至今仍以每年超过10万册的数量再版。1957年《耸肩的阿特拉斯》（Atlas Shrugged）出版，成为美国历史上仅次于《圣经》的超级畅销书，被誉为对美国影响最大的10本书之一，累计销售超过8000万册。\n\n安•兰德推崇理性，认为人的最高美德便是理性；她不顾传统舆论的偏见，力倡个人主义，认为不能使个人利益得到最大伸张的社会，就不是理想社会。她的客观主义哲学自20世纪50年代起风靡美国校园，影响了几代美国人，她本人也成为美国青年崇拜的偶像。安•兰德一生著述百余种，根据她的生平拍摄的记录片和故事片曾获奥斯卡奖。1982年安•兰德去世后，美...\n\n(展开全部)"}, {"url": "https://ari.aynrand.org/issues/government-and-business/capitalism/the-influence-of-atlas-shrugged/", "page_content": "On the 50th anniversary of its publication, Atlas Shrugged, Ayn Rand’s epic about a group of businessmen who rebel against a society that shackles and condemns them, is everywhere. Hardly a day goes by without a mention of the novel in the media or by some prominent celebrity or businessman as the most significant book he’s read. Meanwhile, Ayn Rand’s novels, including Atlas Shrugged, are being taught in tens of thousands of high schools. And last year sales of the novel in bookstores topped an astonishing 130,000 copies — more than when it was first published.\n\nAs executive director of the Ayn Rand Institute, I see the impact of Atlas Shrugged on a daily basis. I’m continually amazed by how many people, from every walk of life and every part of the planet, from high school students to political activists in countries from Hong Kong to Belarus to Ghana, eagerly tell me: “Atlas Shrugged changed my life.”\n\nScores of business leaders, from CEOs of Fortune 500 companies to young entrepreneurs in Silicon Valley, say they have derived great spiritual fuel from Atlas Shrugged. Many tell me that the novel has motivated them to make the most of their lives, inspiring them to be more ambitious, more productive, and more successful in their work. And many of America’s politicians and intellectuals who claim to fight for economic freedom name Atlas Shrugged as the book that has most inspired them. I have no doubt that the novel has played a considerable role in discrediting socialism as an ideal and in making discussion of capitalism intellectually legitimate.\n\nIf you have read Atlas Shrugged and entered the universe of Dagny Taggart, Hank Rearden, and John Galt, you can understand why the novel has inspired so many in this way. Atlas Shrugged portrays great businessmen as heroic, productive thinkers, and it venerates capitalism as the only social system that leaves such minds free to create and produce the material values on which all of our lives depend. It gives philosophic and esthetic expression to the uniquely American spirit of individualism, of self-reliance, of entrepreneurship, of free markets.\n\nBut while many people appreciate these elements of Atlas Shrugged on a personal, emotional level, they are often uncomfortable on a moral level with the novel’s arguments in support of business and capitalism.\n\nAyn Rand’s ethical philosophy of rational selfishness — on which her admiration for successful businessmen and her impassioned defense of capitalism rest — constitutes a radical challenge to the dominant beliefs of our culture. Rejecting the prevailing ideas that morality comes from a supernatural being or from a societal decree, Rand holds that morality is a science that can be proved by reason. Rejecting the altruistic idea that morality consists of selflessly serving something “higher” — whether the Judeo-Christian God or a collectivist society — she maintains that the height of moral virtue is to rationally pursue your own selfish ends.\n\nSocialism as a political ideal is dead. But the morality that spawned it — from each according to his ability, to each according to his need — still haunts us. So long as need and the “public interest” are regarded as moral claim checks on the ability of the productive, the continued growth of the government’s control over the economy and our lives is inevitable.\n\nThose who have read Atlas Shrugged are often struck by the similarity of the events in the novel to the disastrous events reported in the daily news — from the government’s attempt to take over medicine to decaying infrastructure and collapsing bridges to the shackles on businessmen inflicted by Sarbanes-Oxley. The similarity is no accident: the justification for these government programs is the needs of the uninsured, the so-called public interest, and the necessity to curb the selfishness of businessmen. Without a moral revolution, we cannot win true economic or political freedom.\n\nSo while Atlas Shrugged has provided millions with inspiration and with some level of appreciation for the virtues of capitalism and the evils of statism, it has not had nearly the influence it could have had, had its underlying ideas gained wider understanding. Though it has changed individual lives, it has not changed the world. But I believe it could — and should.\n\nImagine a future America guided by the principles found in Atlas Shrugged — a culture of reason, where science is cherished and respected, not banished from biology classrooms and stem-cell research labs — a culture of individualism, in which government is the protector of individual rights, not its primary violator — a culture in which markets are not just regarded as the most effective option of an imperfect lot, but in which laissez-faire capitalism is recognized and venerated as the only moral social system — a culture in which business innovators understand that ambition, productive effort, and wealth creation are not just practical necessities, but moral virtues — a culture in which such innovators, proudly asserting their right to their work, are fully liberated and their productive genius fully applied to the generation of unimaginable economic progress.\n\nThis is the world that Atlas Shrugged challenges us to strive for. But in order to get there, the novel’s full philosophic meaning must be grasped. This is precisely why the Ayn Rand Institute exists: to convey Rand’s profound message. And her message is getting out, all the way to professional intellectuals, on campuses and elsewhere across America, who are taking up Ayn Rand’s ideas with a seriousness that they never have shown before.\n\nWith more and more thinkers giving it the attention it merits, I am confident that the real influence of Atlas Shrugged has yet to be felt."}, {"url": "https://books.google.com/books/about/Atlas_Shrugged.html?id=bVyCd7da8OcC", "page_content": "Peopled by larger-than-life heroes and villains, charged with towering questions of good and evil, Atlas Shrugged is Ayn Rand’s magnum opus: a philosophical revolution told in the form of an action thriller—nominated as one of America’s best-loved novels by PBS’s The Great American Read.\n\n\n\nWho is John Galt? When he says that he will stop the motor of the world, is he a destroyer or a liberator? Why does he have to fight his battles not against his enemies but against those who need him most? Why does he fight his hardest battle against the woman he loves?\n\n\n\nYou will know the answer to these questions when you discover the reason behind the baffling events that play havoc with the lives of the amazing men and women in this book. You will discover why a productive genius becomes a worthless playboy...why a great steel industrialist is working for his own destruction...why a composer gives up his career on the night of his triumph...why a beautiful woman who runs a transcontinental railroad falls in love with the man she has sworn to kill.\n\n\n\nAtlas Shrugged, a modern classic and Rand’s most extensive statement of Objectivism—her groundbreaking philosophy—offers the reader the spectacle of human greatness, depicted with all the poetry and power of one of the twentieth century’s leading artists."}, {"url": "https://www.atlassociety.org/post/book-review-ayn-rands-atlas-shrugged", "page_content": "BOOK REVIEW: Edward W. Younkins, Editor, Ayn Rand’s Atlas Shrugged: A Philosophical and Literary Companion (Ashgate Publishing, Aldershot, Hampshire, UK 2007) 431 pages, $24.95 (paperback).\n\nAyn Rand’s Atlas Shrugged is a collection of thirty-six essays on Rand’s monumental novel and its meaning. The essays range from basic primers and plot summaries—competent book reports, more than anything else—to romps by scholars exercising their favorite theoretical hobby horses. Most of the writers are not literary scholars, nor is the editor: Edward Younkins is a professor of accountancy at Wheeling Jesuit University. So the book is not a piece of literary scholarship as the term is currently understood—most of the essays focus on political economy, philosophy, or practical psychology. And though a kind of love for the novel is present in all the essays, the result is a big, mixed bag.\n\nTHE THOUGHTFUL…\n\nThe best essays in the collection offer insightful analysis: They accurately represent Rand’s distinctive worldview while bringing something new to the table, such as a fresh perspective or a connection between Rand’s work and other literature, philosophy, or social theory. In this way, they allow people familiar with Rand’s work to approach it anew, and they encourage those who don’t know Rand well to inquire further.\n\nIn “Forced to Rule,” philosopher Roderick Long looks at how Atlas Shrugged may have been in part a response to Plato’s dialogue the Republic. The Republic portrays a collectivist utopia where material life and education are sharply controlled by the government. All must act from duty, not self-interest—even the rulers, who should be wise men forced to rule against their inclinations. Long points out that this is strange, since Plato’s ethics appear to focus on individual flourishing. How can there be individual happiness without any freedom? But Plato was a dualist, holding that real knowledge, truth, and virtue proceed from a realm of Ideas only dimly reflected in material reality, and this made him pessimistic about practical affairs. Long shows how Ayn Rand strikes back at this conception of man in Atlas Shrugged and details implicit references to Plato in the text. Ayn Rand rejected the dichotomy of mind versus body and its attendant splits of spirit versus matter, love versus sex, and art versus engineering. In the climax of Atlas, Rand put Plato’s doctrine to the test as the villains try to torture John Galt—the best and wisest of men, “an engineer and philosopher”—to make him rule them. (Spoiler: It doesn’t work.)\n\nIn an essay subtitled “Virtuous Sexuality in Atlas Shrugged ,” anthropologist Susan Love Brown argues that Rand’s view of sex developed over the course of her career. Rand always presented sex as channeled violence and a dance of dominance and submission. But in Atlas, Brown says, we see a philosophical view of sex as a “celebration of life” that was not fully present before. It’s an aspect of the novel’s theme of mind-body unity: Sexual desire should be a response to the whole person one loves—physical traits, of course, but mental traits, too, such as intelligence and virtuousness. Also, sex should be based on particular knowledge of the loved one. In Rand’s earlier novels, the characters make full sexual commitments based on a love-at-first-sight perception. In The Fountainhead , hero Howard Roark sexually assaults his lover Dominique Francon, certain that’s just what she wants—though she doesn’t know it herself. Contrast this with the sexual affairs of heroine Dagny Taggart in Atlas: Dagny knows each of her lovers well before sleeping with them.\n\nIn a related meditation, “Friendship in Atlas Shrugged ,” avocational Rand scholar Peter Saint-Andre puts some of the friendships in the novel under critical scrutiny, bringing to bear a wide reading of the psychological and philosophical literature on friendship. Like several of the writers in this book, Saint-Andre finds Rand’s ideal man, John Galt, too much like a god, and he finds Galt’s friendships unbalanced. Even his two closest friends seem to worship and follow him. That doesn’t sound healthy. But one of those strikers, Francisco d’Anconia, has a “more interesting and instructive” relationship with “scab” industrialist Hank Rearden. Their friendship is a relationship of equals founded on shared values and mutual esteem. Saint-Andre accurately describes Rand’s theory of friendship, imports insights from Aristotle and others in a clear and intelligible fashion, and has us looking at the novel afresh.\n\nLet me also mention economist Bryan Caplan’s “ Atlas Shrugged and Public Choice: The Obvious Parallels.” Public-choice theory is the economics of democratic policy-making: It posits that “politicians maximize votes, just as firms maximize profits.” Caplan ties together a variety of plot developments distributed throughout the novel that show public-choice effects at work. For example, when businessmen use government power to loot competitors, they gain in the short run while greater losses are spread throughout society. The “aristocracy of pull” in Atlas Shrugged rules through access to Washington, trading favors and back-stabbing in a destructive political competition that eventually leads to economic collapse.\n\n…THE WORKMANLIKE…\n\nA problem with the book is that many of the essays are nothing much to write home about. If the book is intended to serve as (among other things) a resource for teachers and students, it needs basic textbook material that identifies main themes, structural elements, and characters. An example in this volume that does the job nicely is philosopher Fred Seddon’s tour through the chapter titles. Ayn Rand chose every one purposefully, and Seddon shows why and how. But few of contributions of this type are really rock-solid.\n\nEditor Younkins writes an overview essay that reads like a mash-up of the various extant surveys and studies of Atlas. Summaries crash into summaries, and we zig-zag over deep issues. Because I’m a Rand scholar, I know what Younkins is getting at, but I doubt that most readers would be able to fill in the needed details and connect the dots. Fortunately, the next essay, by researcher and editor Chris Sciabarra, offers a comprehensible overview of Rand’s view of man and society.\n\nThen there’s the problem of the “book reports.” The volume has several essays that summarize what happens to a single character, such as Cheryl Brooks. A good character study, however, not only gives an overview of the character and his role in the novel but also sheds light on the author’s choices by bringing in comparisons with other characters or relating the character’s behavior to heroic models or psychological truths. The character studies here don’t do that, by and large; instead, they are just summaries: what the character did and why, in terms internal to the novel. As a promoter of Ayn Rand ’s philosophy, I’m pleased to see these accurate summaries, but I don’t think they add much that an attentive reader couldn’t notice on his own.\n\nBy contrast, consider psychologist Robert Campbell’s study of Eddie Willers. It’s the best of the character studies in the volume. Campbell surveys the main role of Willers in the plot and theme (he is a decent, mediocre Everyman who comes to a tragic end because he lacks the ability to survive independently). Campbell points out a fact that I had never much considered: Willers is well-known to three of the heroes, and yet they never offer him the chance to join their strike and enter their hidden utopia. Did Rand bar him from salvation consciously, or sub-consciously? And what does that mean for most Rand readers, who, Campbell points out, are more like the decent-yet-unremarkable Eddie than they are like his companions, the world-beating achievers Dagny Taggart and John Galt?\n\n…AND THE CRANK\n\nSo this is a hit-and-miss collection, with a few really wild pitches to complete the mix. For example, did you know that Sundays in Massachusetts induce lassitude and a neither-here-nor-there attitude—universally, across the state, every Sunday? Well, novelist Karen Michalson seems to believe so—or at least she takes a whimsical notion much, much too far in her memoir “Dagny and Me.” In this appalling piece of self-indulgence, Michalson offers thoughts on those Sundays, followed by some snarky recollections of her first meeting with some ardent Rand fans (on a Sunday). Then, on to Dagny. Michalson admired Dagny Taggart, the heroine of Atlas Shrugged , but has since given up comparing herself to the character now that she realizes Dagny “had inherited her position” and thus is not a model of a self-made woman. But that’s just an inaccurate reading of the novel. Michalson claims to be a literature scholar, but she can’t discern that a woman wouldn’t rise to the head of operations at a big industrial firm in the 1950s—or even today—no matter how much stock she owned? Yet that’s what Dagny does. And, er, “Sundays” are a man-made institution; they don’t have metaphysical effects.\n\nIn “The Non-Fictional Robert Stadlers: Traitors to Liberty,” anarchist economist Walter Block indulges in a petty exercise of rationalistic nit-picking and movement in-fighting. Using hyperbolic language, he lambastes the few figures who actually made a case for greater freedom in our times, like Milton Friedman, Friedrich Hayek, and Alan Greenspan. Since these folks studied free-market theory, he claims, they should have known better than to compromise it. Well, too true. But Stadler isn’t just a compromiser: Over the course of the novel he betrays everything good he had stood for, abandoning even his own reason in the end. These men aren’t Stadlers; they all made substantial efforts to increase our political freedom. Even Block admits as much in the conclusion of his essay, so what was the point? The reader has learned little about Atlas and less about how its principles should be put into practice.\n\nMany of the essays use Atlas Shrugged as the occasion for their authors to retail theories of their own that are not really an analysis of Rand’s work. An entertaining example is Roger Bissell’s presentation “My Music: Why It’s Romantic, and Why I Write It That Way,” which purports to be a lecture given by Richard Halley “on the 25th anniversary of the Great Strike.” This sounds like a fun fan-fic idea: Halley is a minor character in Atlas, a composer of heroic music who joins the strike against the mystic-altruist-collectivist culture that dominates America. But this isn’t Halley’s speech, it’s Bissell’s, retailing his own theory of how melody functions in music. I know that Bissell’s theory is one of several that try to develop esthetic ideas along Randian lines. But you wouldn’t know that from reading this disguised essay. Like many of the ingrown and self-referential essays in this book, the Halley “speech” is less than it could have been.\n\nA COMPANION FOR WHOM?\n\nI’ve not discussed many of the essays in Younkins’ volume, though for someone well-versed in Rand’s works and Rand scholarship, there are many juicy tidbits to pick up. I must mention philosopher Douglas Den Uyl’s investigation of Ayn Rand ’s view of America—had she become more pessimistic since writing the paean to the American sense of life in The Fountainhead —and also another essay I enjoyed, literature professor Stephen Cox’s discussion of “Ayn Rand’s Debt to Isabel Paterson.” Cox is Paterson’s biographer, and his essay is more about Paterson than Rand. But it calls attention to one of Rand’s mentors and reminds us that her biographers still have work to do tracing her intellectual development.\n\nIn the end, whom is this book for? I couldn’t imagine college students getting much out of it; they might benefit from Sciabarra’s overview, I suppose, and Seddon’s study of the chapter headings. Most of the other essays are too idiosyncratic, too “in-movement,” too scholarly, or too much like a paper that a college student would write. Ayn Rand fans may find many of them stultifying, though I’ve tried to indicate some that had gold in them. Philosophers, I suspect, will find something to root around in, but again, they will have to be choosy. Still, I must admit that reading these essays got me thinking about Rand and Atlas. It’s a useful volume for anyone who would enjoy a hunt around the attic of Rand scholarship.\n\nspiderID=900\n\nABOUT THE AUTHOR:\n\nWilliam Thomas\n\nWilliam R Thomas writes about and teaches Objectivist ideas. He is the editor of The Literary Art of Ayn Rand and of Ethics at Work, both published by The Atlas Society. He is also an economist, teaching occasionally at a variety of universities.\n\n‍"}, {"url": "https://books.google.com/books/about/Ayn_Rand_s_Atlas_Shrugged.html?id=p9MmnATOORwC", "page_content": "Since its publication in 1957 Atlas Shrugged, the philosophical and artistic climax of Ayn Rand's novels, has never been out of print and has received enormous critical attention becoming one of the most influential books ever published, impacting on a variety of disciplines including philosophy, literature, economics, business, and political science among others.\n\nMore than a great novel, Atlas Shrugged is an abstract conceptual, and symbolic work that expounds a radical philosophy, presenting a view of man and man's relationship to existence and manifesting the essentials of an entire philosophical system – metaphysics, epistemology, politics and ethics.\n\nCelebrating the fiftieth year of Atlas Shrugged's publication, this companion is an exploration of this monumental work of literature. Contributions have been specially commissioned from a diversity of eminent scholars who admire and have been influenced by the book, the included essays analyzing the novel's integrating elements of theme, plot and characterization from many perspectives and from various levels of meaning."}, {"url": "https://www.esquire.com/entertainment/tv/a38665621/aaron-rodgers-ayn-rand-atlas-shrugged-book/", "page_content": "Namaste. First off, welcome to the new year that is 2022. Secondly, let's discuss the consciousness of man, the innate benefits of capitalism, and the turmoil that can result from extreme governmental oversight as it applies to small- and medium-sized businesses. Not of interest to you? Oh, perhaps you haven't read Ayn Rand's Atlas Shrugged—noted favorite novel of Aaron Rodgers and every 17-year-old libertarian interested in majoring in fuh-nance.\n\nHow do we know this? During Monday Night Football, Peyton and Eli Manning had Rodgers on for a segment and couldn't resist asking him what he was reading from the bookshelf behind him on camera. Earnestly, Rodgers points to the collection and says, \"A lot of French poetry,\" before pointing to the other side and saying, \"Got Atlas Shrugged by Ayn Rand over here.\" Then, he adds that he also has a football helmet on the shelf, signed by both Manning brothers, leading me to believe that Rodgers reads that regularly, too.\n\nWhile I'm intrigued by the idea of Rodgers kicking back with a tall glass of room temperature kombucha, reading the works of de la Fontaine and Hugo, the part that caught the attention of the internet is, of course, the Ayn Rand of it all. Rand's best-known work, Atlas Shrugged is often referenced as a favorite in libertarian and conservative circles, so when our guy proudly pointed to the nearly 1,200 page work as a highlight of his library, people took notice.\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. Aaron Rodgers points out his copy of Atlas Shrugged by Ayn Rand to Eli and Peyton Manning during Monday Night Football. pic.twitter.com/2qSOcSSb3m — The Recount (@therecount) January 4, 2022\n\nFor most of us, Atlas Shrugged was the summer reading assignment we skimmed a third of before resorting to SparkNotes. You didn't need to read it, really—Blake, that guy from your junior year literature class who has big thoughts on the free market, wasn't going to let you get a word in edgewise during class discussion anyway. And that's because Atlas Shrugged is the Bible for people who might describe themselves as, simultaneously, \"cerebral\" and \"free-thinker.\" It represents an ideology that values the individual and his own decisions, or, as my friend Zack used to say, it's a \"real douche-nozzle's guide to the world.\"\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. Rodgers giving a shoutout to Atlas Shrugged on the manning cast was the free spot on Manning Cast bingo — Vinny Espinosa (@Vinny_Espinosa) January 4, 2022\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. Atlas Shrugged is the favorite book for a lot of people who never read a book. — Morten Øverbye (@morten) January 4, 2022\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. average Atlas Shrugged reader pic.twitter.com/xzJT90bqIP — Ship of Theses (@postclassics) January 4, 2022\n\nThis all aligns pretty nicely with the headline-making course that Rodgers has been on for the past six months. After claiming to be \"immunized\" in August, Rodgers tested positive for Covid-19 this fall and further explained that he's not actually vaccinated in the, you know, actually vaccinated way, but that he's taken alternative treatments like ivermectin, which is an anti-parasite medication often used on horses. Looking back, Rodgers's explanation on The Pat McAfee Show should have tipped us off on what was to come:\n\nI believe strongly in bodily autonomy and ability to make choices for your body: Not have to acquiesce to some woke culture or crazed group of individuals who say you have to do something. Health is not a one-size-fits-all for everybody.\n\nHis worldview gels perfectly with two facts seared into my mind for eternity: Rodgers' finacée Shailene Woodley absorbs vitamin D through her vagina and sometimes eats clay. I don't fault Rodgers for loving Ayn Rand; I fault myself for not assuming Ayn Rand was an inspiration in this tall lug of a man's life from the jump. Now, I simply want to know what else is on the book shelf. Eat This, Not That? Three unopened paperback copies of Animal Farm? A VHS copy The Scarlet Letter where Demi Moore takes baths? Open my mind, Aaron Rodgers. Save me from myself by recommending Chicken Soup for the Sports Fan's Soul.\n\nThe Packers are set to play the Detroit Lions this Sunday at 1pm. Aaron Rodgers is set to play himself again at some point in the near future."}, {"url": "https://www.cliffsnotes.com/literature/a/atlas-shrugged/about-atlas-shrugged", "page_content": "About Atlas Shrugged\n\nIntroduction\n\nAtlas Shrugged is Ayn Rand's masterpiece and the culmination of her career as a novelist. With its publication in 1957, the author accomplished everything she wanted to in the realm of fiction; the rest of her career as a writer was devoted to nonfiction. Rand was already a famous, best-selling author by the time she published Atlas Shrugged. With the success of The Fountainhead a decade earlier and its subsequent production as a Hollywood film starring Gary Cooper in 1949, her stature as an author was established. Publishers knew that her fiction would sell, and consequently they bid for the right to publish her next book.\n\nAtlas Shrugged, although enormously controversial, had no difficulty finding a publisher. On the contrary, Rand conducted an intellectual auction among competing publishers, finally deciding on Random House because its editorial staff had the best understanding of the book. Bennett Cerf was a famous editor there. When Rand explained that, at one level, Atlas Shrugged was to provide a moral defense of capitalism, the editorial staff responded, \"But that would mean challenging 3,000 years of Judeo-Christian tradition.\" Their depth of philosophical insight impressed Ayn Rand, and she decided that Random House was the company to publish her book.\n\nAtlas Shrugged furthers the theme of individualism that Ayn Rand developed in The Fountainhead. In The Fountainhead, she shows by means of its hero, the innovative architect Howard Roark, that the independent mind is responsible for all human progress and prosperity. In Atlas Shrugged, she shows that without the independent mind, our society would collapse into primitive savagery. Atlas Shrugged is an impassioned defense of the freedom of man's mind. But to understand the author's sense of urgency, we must have an idea of the context in which the book was written. This includes both the post-World War II Cold War and the broader trends of modern intellectual culture.\n\nThe Cold War and Collectivism\n\nTwentieth-century culture spawned the most oppressive dictatorships in human history. The Fascists in Italy, the National Socialists (Nazis) in Germany, and the Communists — first in Russia and later in China and elsewhere — seriously threatened individual freedom throughout the world. Ayn Rand lived through the heart of this terrifying historical period. In fact, when she started writing Atlas Shrugged in 1946, the West had just achieved victory over the Nazis. For years, the specter of national socialism had haunted the world, exterminating millions of innocent people, enslaving millions more, and threatening the freedom of the entire globe. The triumph of the free countries of the West over Naziism was achieved at an enormous cost in human life. However, it left the threat of communism unabated.\n\nAyn Rand was born in Russia in 1905 and witnessed firsthand the Bolshevik Revolution, the Communist conquest of Russia, and the political oppression that followed. Even after her escape from the Soviet Union and her safe arrival in the United States, she kept in close touch with family members who remained there. But when the murderous policies of Joseph Stalin swallowed the Soviet Union, she lost track of her family. From her own life experiences, Ayn Rand knew the brutal oppression of Communist tyranny.\n\nDuring the last days of World War II and in the years immediately following, communism conquered large portions of the world. Soviet armies first rolled through the countries of Eastern Europe, setting up Russian \"satellite\" nations in East Germany, Poland, Hungary, Romania, and elsewhere. Communists then came to power in China and North Korea and launched an invasion of South Korea. Shortly thereafter, communism was also dominant in Cuba, on America's doorstep. In the 1940s and 1950s, communism was an expanding military power, threatening to engulf the free world.\n\nThis time period was the height of the Cold War — the ideological battle between the United States and the Soviet Union. The Soviet Union ruled its empire in Eastern Europe by means of terror, brutally suppressing an uprising by Hungarian freedom fighters in 1956. The Russians developed the atomic bomb and amassed huge armies in Eastern Europe, threatening the free nations of the West. Speaking at the United Nations, Soviet dictator Nikita Khrushchev vowed that communism would \"bury\" the West. Like the Nazis in the 1930s, communists stood for a collectivist political system: one in which an individual is morally obliged to sacrifice himself for the state. Intellectual freedom and individual rights, cherished in the United States and other Western countries, were in grave danger.\n\nForeign military power was not the only way in which communism threatened U.S. freedom. Collectivism was an increasingly popular political philosophy among American intellectuals and politicians. In the 1930s, both national socialism and communism had supporters among American thinkers, businessmen, politicians, and labor leaders. The full horror of Naziism was revealed during World War II, and support for national socialism dwindled in the United States as a result. But communism, in the form of Marxist political ideology, survived World War II in the United States. Many American professors, writers, journalists, and politicians continued to advocate Marxist principles. When Ayn Rand was writing Atlas Shrugged, many Americans strongly believed that the government should have the power to coercively redistribute income and to regulate private industry. The capitalist system of political and economic freedom was consistently attacked by socialists and welfare statists. The belief that an individual has a right to live his own life was replaced, to a significant extent, by the collectivist idea that individuals must work and live in service to other people. Individual rights and political freedom were threatened in American politics, education, and culture.\n\nAn Appeal for Freedom\n\nRand argues in Atlas Shrugged that the freedom of American society is responsible for its greatest achievements. For example, in the nineteenth century, inventors and entrepreneurs created an outpouring of innovations that raised the standard of living to unprecedented heights and changed forever the way people live. Rand, who thoroughly researched the history of capitalism, was well aware of the progress made during this period of economic freedom. Samuel Morse invented the telegraph — a device later improved by Thomas Edison, who went on to invent the phonograph, the electric light, and the motion picture projector. John Roebling perfected the suspension bridge and, just before his death, designed his masterpiece, the Brooklyn Bridge. Henry Ford revolutionized the transportation industry by mass-producing automobiles, a revolution that the Wright Brothers carried to the next level with their invention of the airplane. Railroad builders like Cornelius Vanderbilt and James J. Hill established inexpensive modes of transportation and opened up the Pacific Northwest to economic development.\n\nLikewise, Alexander Graham Bell invented the telephone during this era, Cyrus McCormick the reaper, and Elias Howe the sewing machine. Charles Goodyear discovered the vulcanization process that made rubber useful, and George Eastman revolutionized photography with the invention of a new type of camera — the Kodak. George Washington Carver, among myriad agricultural accomplishments, developed peanuts and sweet potatoes into leading crops. Architects like Louis Sullivan and William LeBaron Jenney created the skyscraper, and George Westinghouse, the inventor of train airbrakes, developed a power system able to transmit electricity over great distances. The penniless Scottish immigrant Andrew Carnegie built a vast company manufacturing steel, and John D. Rockefeller did the same in the oil industry.\n\nThese are a few examples from an exhaustive list of advances in the late nineteenth and early twentieth centuries. Ayn Rand argues that economic freedom liberated these great creative thinkers, permitting them to put into practice new ideas and methods. But what would happen if economic freedom were lost?\n\nAtlas Shrugged provides Ayn Rand's answer to this question. In the story, she projects the culmination of America's twentieth-century socialist trend. The U.S. government portrayed in the story has significant control over the domestic economy. The rest of the world has been swallowed up by communist \"Peoples' States\" and subsists in abject poverty. A limited degree of economic freedom still exists in America, but it is steadily declining, as is American prosperity. The successful are heavily taxed to support the poor, and the American poor are similarly levied to finance the even poorer people in foreign Peoples' States. The government subsidizes inefficient businesses at the expense of the more efficient. With the state controlling large portions of the economy, the result is the rise of corrupt businessmen who seek profit by manipulating crooked politicians rather than by doing productive work. The government forces inventors to give up their patents so that all manufacturers may benefit equally from new products. Similarly, the government breaks up productive companies, compelling them to share the market with weaker (less efficient) competitors. In short, the fictionalized universe of Atlas Shrugged presents a future in which the U.S. trend toward socialism has been accelerated. Twentieth-century realities such as heavy taxation, massive social welfare programs, tight governmental regulation of industry, and antitrust action against successful companies are heightened in the universe of this story. The government annuls the rights of American citizens, and freedom is steadily eroded. The United States of the novel — the last bastion of liberty on earth — rapidly becomes a fascist/communist dictatorship.\n\nThe result, in Rand's fictional universe, is a collapse of American prosperity. Great minds are shackled by government policies, and their innovations are either rejected or expropriated by the state. Thinkers lack the freedom necessary to create new products, to start their own companies, to compete openly, and to earn wealth. Under the increasing yoke of tyranny, the most independent minds in American society choose to defend their liberty in the most effective manner possible: They withdraw from society.\n\nThe Mind on Strike\n\nAtlas Shrugged is a novel about a strike. Ayn Rand sets out to show the fate that befalls the world when the thinkers and creators go on strike. The author raises an intriguing question: What would happen if the scientists, medical researchers, inventors, industrialists, writers, artists, and so on withheld their minds and their achievements from the world?\n\nIn this novel, Rand argues that all human progress and prosperity depend on rational thinking. For example, human beings have cured such diseases as malaria, polio, dysentery, cholera, diphtheria, and tuberculosis. Man has learned to fly, erect cities and skyscrapers, grow an abundant food supply, and create computers. Humans have been to the moon and back and have invented the telephone, radio, television, and a thousand other life-promoting technologies. All of these achievements result from the human application of a rational mind to practical questions of survival. If the intellectuals responsible for such advances abandon the world, regression to the primitive conditions of the Dark Ages would result. But what would motivate intellectuals to such an extreme act as going on strike? We are used to hearing about strikes that protest conditions considered oppressive or intolerable by workers. The thinkers go on strike in Atlas Shrugged to protest the oppression of their intellect and creativity.\n\nThe thinkers in Atlas Shrugged strike on behalf of individual rights and political freedom. They strike against an enforced moral code of self-sacrifice — the creed that human life must be devoted to serving the needs of others. Above all, the thinkers strike to prove that reason is the only means by which man can understand reality and make proper decisions; emotions should not guide human behavior. In short, the creative minds are on strike in support of a person's right to think and live independently.\n\nIn the novel, the withdrawal of the great thinkers causes the collapse of the American economy and the end of dictatorship. The strike proves the role that the rational mind plays in the attainment of progress and prosperity. The emphasis on reason is the hallmark of Ayn Rand's fiction. All of her novels, in one form or another, glorify the life-giving power of the human mind.\n\nFor example, in The Fountainhead, Ayn Rand emphasizes the independent nature of the mind's functioning — that rational individuals neither conform to society nor obey authority, but trust their own judgment. In her early novelette Anthem, Ayn Rand shows that under a collectivist dictatorship, the mind is stifled and society regresses to a condition of primitive ignorance. Anthem focuses on the mind's need for political freedom. The focus of Atlas Shrugged is the role that the human mind plays in human existence. Atlas Shrugged shows that rational thinking is mankind's survival instrument, just as the ability to fly is the survival tool for birds. In all of her major novels, Ayn Rand presents heroes and heroines who are brilliant thinkers opposed to either society's pressure to conform or a dictatorial government's commands to obey. The common denominator in all of her books is the life-and-death importance, for both the individual and society, of remaining true to the mind.\n\nObjectivism in Action\n\nIn Atlas Shrugged, Ayn Rand presents, for the first time and in a dramatized form, her original philosophy of Objectivism. She exemplifies this philosophy in the lives of the heroes and in the action of the story. Objectivism holds that reason — not faith or emotionalism — is man's sole means of gaining knowledge. Her theory states that an individual has a right to his or her own life and to the pursuit of his or her own happiness, which is counter to the view that man should sacrifice himself to God or society. Objectivism is individualistic, holding that the purpose of government is to protect the sovereign rights of an individual. This philosophy opposes the collectivist notion that society as a whole is superior to the individual, who must subordinate himself to its requirements. In the political/economic realm, Objectivism upholds full laissez-faire capitalism — a system of free markets that legally prevent the government from restricting man's productive activities — as the only philosophical system that protects the freedom of man's mind, the rights of the individual, and the prosperity of man's life on earth.\n\nBecause of Ayn Rand's uncompromising defense of the mind, of the individual, and of capitalism, Atlas Shrugged created great controversy on its publication in 1957. Denounced by critics and intellectuals, the book nevertheless reached a wide audience. The book has sold millions of copies and influenced the lives of countless readers. Since 1957, Ayn Rand's philosophy of Objectivism has gradually taken hold in American society. Today, her books and ideas are becoming widely taught in high schools and universities."}, {"url": "https://books.google.com/books/about/Atlas_Shrugged.html?id=TecPMQAACAAJ", "page_content": "Peopled by larger-than-life heroes and villains, charged with towering questions of good and evil, Atlas Shrugged is Ayn Rand’s magnum opus: a philosophical revolution told in the form of an action thriller—nominated as one of America’s best-loved novels by PBS’s The Great American Read.\n\n\n\nWho is John Galt? When he says that he will stop the motor of the world, is he a destroyer or a liberator? Why does he have to fight his battles not against his enemies but against those who need him most? Why does he fight his hardest battle against the woman he loves?\n\n\n\nYou will know the answer to these questions when you discover the reason behind the baffling events that play havoc with the lives of the amazing men and women in this book. You will discover why a productive genius becomes a worthless playboy...why a great steel industrialist is working for his own destruction...why a composer gives up his career on the night of his triumph...why a beautiful woman who runs a transcontinental railroad falls in love with the man she has sworn to kill.\n\n\n\nAtlas Shrugged, a modern classic and Rand’s most extensive statement of Objectivism—her groundbreaking philosophy—offers the reader the spectacle of human greatness, depicted with all the poetry and power of one of the twentieth century’s leading artists."}, {"url": "https://books.google.com/books/about/Atlas_Shrugged.html?id=e8yNEAAAQBAJ", "page_content": "Peopled by larger-than-life heroes and villains, charged with towering questions of good and evil, Atlas Shrugged is Ayn Rand’s magnum opus: a philosophical revolution told in the form of an action thriller—nominated as one of America’s best-loved novels by PBS’s The Great American Read.\n\n\n\nWho is John Galt? When he says that he will stop the motor of the world, is he a destroyer or a liberator? Why does he have to fight his battles not against his enemies but against those who need him most? Why does he fight his hardest battle against the woman he loves?\n\n\n\nYou will know the answer to these questions when you discover the reason behind the baffling events that play havoc with the lives of the amazing men and women in this book. You will discover why a productive genius becomes a worthless playboy...why a great steel industrialist is working for his own destruction...why a composer gives up his career on the night of his triumph...why a beautiful woman who runs a transcontinental railroad falls in love with the man she has sworn to kill.\n\n\n\nAtlas Shrugged, a modern classic and Rand’s most extensive statement of Objectivism—her groundbreaking philosophy—offers the reader the spectacle of human greatness, depicted with all the poetry and power of one of the twentieth century’s leading artists."}, {"url": "https://www.businessinsider.com/how-pandemic-disproved-philosophy-of-ayn-rands-atlas-shrugged-2021-3", "page_content": "Paul Constant is a writer at Civic Ventures and cohost of the \"Pitchfork Economics\" podcast with Nick Hanauer and David Goldstein.\n\nIn the latest episode, they spoke with evolutionist David Sloan Wilson about his novel, \"Atlas Hugged.\"\n\nWilson says the pandemic has unraveled the Ayn Rand philosophy that self-interest should trump societal needs.\n\nTop editors give you the stories you want — delivered right to your inbox each weekday. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy\n\nLike a lot of white males, I read Ayn Rand's bestselling novel \"Atlas Shrugged\" when I was 18. And like a lot of white males, \"Atlas Shrugged\" turned me into a huge jerk for a couple of months.\n\n\"Atlas Shrugged,\" which was published in 1959 and came in second only after The Bible in a Library of Congress survey of influential books, is a 1,200-page sci-fi novel about what would happen if all the \"makers\" in the world were to go on strike. The mysterious hero of the book, John Galt, encourages captains of industry, inventors, and other heroes of capitalism to join him in a secret utopia hidden in Colorado called Galt's Gulch. The rest of the world — populated only by collectivists, politicians, and other assorted \"takers\" — quickly begins to fall apart without them.\n\n\"Atlas Shrugged\" serves as a page-turning enticement to Ayn Rand's philosophy, Objectivism, which is based on the idea that selfishness should be the guiding virtue for all mankind. (If you think I'm overstating or mischaracterizing her message, please note that Rand literally published a non-fiction book titled \"The Virtue of Selfishness.\")\n\nSelf-interest, Rand argues, is the best motivation for economics, finance, politics, and basically all of humanity's pursuits. Putting others first, she argues, means that everyone finishes last.\n\nThe appeal of selfishness\n\nRand's simplistic Objectivist worldview couldn't be better designed to appeal to sheltered middle-and-upper-class suburban white boys like me — the kind of people who, in the immortal words of Barry Switzer, were born on third base and thought they hit a triple.\n\nFor kids like me at the time, Rand's message that we earned every piece of wealth that we inherited was a comforting one, and it pleased our egos by centering us as masters of the universe who deserved our elevated perch.\n\nThankfully, it didn't take me too long to shake off the themes of \"Atlas Shrugged.\" As soon as I befriended people who were not suburban white dudes, and once I understood that they had to work five times as hard to enjoy half of the privilege that I enjoyed, I realized that Rand was singing a heroic ode to the comfortable. With the application of a little bit of empathy and life experience, her philosophy fell apart.\n\nBut plenty of powerful adults still subscribe to Rand's philosophy. Former Speaker of the House Paul Ryan has spoken often, and lovingly, about the impact Rand had on his life. Former Fed Chair Alan Greenspan was a Randian acolyte, along with both Ron and Rand Paul. Some of Silicon Valley's most powerful players, including Peter Thiel and Travis Kalanick, have praised Rand.\n\nHer writing to this day informs a particularly virulent form of conservative thought — fiercely libertarian, aggressively anti-government, blindly in favor of handing power to corporations.\n\nIn this week's episode of \"Pitchfork Economics,\" Nick Hanauer and David Goldstein talk with celebrated evolutionist David Sloan Wilson about his debut novel, \"Atlas Hugged.\" \"Hugged\" rebuts the claims of Shrugged using Sloan's unparalleled understanding of evolutionary biology, which reframes humans as cooperative and community-minded animals and not mono-maniacally selfish actors.\n\nSelf-interest versus the pandemic\n\nAnd for a ripped-from-the-headlines example of why humans are absolutely not the sociopathic strivers of Rand's fiction, look no further than the pandemic. How would Galt's Gulch have responded last year when COVID-19 arrived?\n\nTo begin with, none of Rand's rugged individualist protagonists would abide by a mask mandate. They loathe government regulations of all types, and since mask-wearing protects other people as much as it does the person wearing the mask, it violates Rand's primary directive of selfishness above all else. The same goes for six-foot social distancing rules.\n\nSo already, Galt's Gulch looks like a petri dish for coronavirus. Rand envisioned her utopia as a haven for CEOs and presidents of big manufacturing firms, and the average age of CEOs in America has climbed in recent years to just under 60 years old. Given that 95% of all coronavirus deaths have been in people over 60 years old, the survival rate for Galt's Gulch isn't looking great.\n\nI hear the protests now: \"But surely these unfettered capitalists would be able to buy or manufacture ventilators to keep those infected CEOs alive?\" Probably not.\n\nIf you recall, ventilators were in high demand in the early days of the pandemic, and then-President Trump had to use powers of government to force General Motors to manufacture them — a gross violation of Rand's philosophy.\n\nAnd the global supply chain was completely broken in those early days, meaning all the money in the world couldn't get ventilators or the parts to manufacture ventilators to Galt's Gulch in time to save those poor sickened Objectivists.\n\nThen consider the fact that Galt's Gulch likely has no public health department to inform the populace about at-risk behaviors and demographics, no way to direct private business in ways that benefit the public good without massive price-gouging, and no tax dollars to support people who lose their jobs because of the pandemic, and John Galt's utopia is starting to look a lot like \"The Hunger Games.\"\n\nThe science fiction of individualism\n\nThere's a reason why libertarians have been so quiet since COVID arrived on our shores a year ago, and why Republican hyper-conservatives were bleating about Dr. Seuss when Democrats were passing an incredibly popular pandemic relief package.\n\nThe pandemic is proof of the single inescapable fact that destroys Ayn Rand's philosophy: We live in a society, and nobody is truly a self-made master of their own destiny. The sooner we understand the American ideal of sovereign individualism is the stuff of science-fiction, the faster we can get to work building a world that's better for everyone."}]}