{"Ayn Rand was educated in Russia.": [{"url": "https://www.britannica.com/biography/Ayn-Rand", "page_content": "Top Questions Who was Ayn Rand? Ayn Rand was a Russian-born American author and philosopher. Rand authored two best-selling novels, The Fountainhead (1943) and Atlas Shrugged (1957). Her novels were especially influential among conservatives and libertarians from the mid-20th century. Where is Ayn Rand from? Ayn Rand was born in St. Petersburg, Russia, on February 2, 1905. When the tsarist regime was overthrown in the Russian Revolution of 1917, her family moved to Crimea, where she finished high school. She returned to Russia in 1921 and then moved to the United States in 1926. What is Ayn Rand’s real name? Ayn Rand is the pen name of Alissa Zinovievna Rosenbaum. She adopted it when she moved to the United States in 1926. The first name, which rhymes with “pine,” was inspired by the name of a Finnish writer (whom she declined to identify), and the surname she described as an abbreviation of Rosenbaum. When did Ayn Rand begin writing? Ayn Rand arrived in Chicago in 1926 and then moved to Hollywood, where she met American filmmaker Cecil B. DeMille. Her chance encounter with DeMille led to work as a movie extra and eventually to a job as a screenwriter. Rand sold her first screenplay, Red Pawn, to Universal Studios in 1932. What are Ayn Rand’s most famous works? Rand’s first major work, The Fountainhead, was published in 1943. It details the struggle of a genius architect against mediocrity. Her second major work, Atlas Shrugged, was published in 1957. It follows a railroad executive and a steel magnate as they grapple with a collectivist government. Both The Fountainhead and Atlas Shrugged explicate Rand’s personal philosophy of objectivism. How did Ayn Rand die? Rand died of heart failure on March 6, 1982, in New York City. At the time, she had been working on a television adaptation of her novel Atlas Shrugged.\n\nAyn Rand, original name Alissa Zinovievna Rosenbaum, (born February 2, 1905, St. Petersburg, Russia—died March 6, 1982, New York, New York, U.S.), Russian-born American writer whose commercially successful novels promoting individualism and laissez-faire capitalism were influential among conservatives and libertarians and popular among generations of young people in the United States from the mid-20th century.\n\nEarly life and career Her father, Zinovy Rosenbaum, was a prosperous pharmacist. After being tutored at home, Alissa Rosenbaum, the eldest of three children, was enrolled in a progressive school, where she excelled academically but was socially isolated. Following the Russian Revolution of 1917, her father’s shop was confiscated by communist authorities, an event she deeply resented. As a student at Leningrad State University, she studied history and became acquainted with the works of Plato and Aristotle. After graduating in 1924, she enrolled in the State Institute for Cinematography, hoping to become a screenwriter. The arrival of a letter from cousins in Chicago gave her an opportunity to leave the country on the pretext of gaining expertise that she could apply in the Soviet film industry. Upon her arrival in the United States in 1926, she changed her name to Ayn Rand. (The first name, which rhymes with “pine,” was inspired by the name of a Finnish writer, whom she never identified, and the surname she described as an abbreviation of Rosenbaum.) After six months in Chicago she moved to Hollywood, where a fortuitous encounter with the producer Cecil B. DeMille led to work as a movie extra and eventually to a job as a screenwriter. In 1929 she married the actor Frank O’Connor. Soon hired as a filing clerk in the wardrobe department of RKO Radio Pictures, Inc., she rose to head of the department within a year, meanwhile writing stories, plays, and film scenarios in her spare time. She became an American citizen in 1931."}, {"url": "https://iep.utm.edu/rand/", "page_content": "Ayn Rand (1905—1982)\n\nAyn Rand was a major intellectual of the twentieth century. Born in Russia in 1905 and educated there, she immigrated to the United States after graduating from university. Upon becoming proficient in English and establishing herself as a writer of fiction, she became well-known as a passionate advocate of a philosophy she called Objectivism. This philosophy is in the Aristotelian tradition, with that tradition’s emphasis upon metaphysical naturalism, empirical reason in epistemology, and self-realization in ethics. Her political philosophy is in the classical liberal tradition, with that tradition’s emphasis upon individualism, the constitutional protection of individual rights to life, liberty, and property, and limited government. She wrote both technical and popular works of philosophy, and she presented her philosophy in both fictional and nonfictional forms. Her philosophy has influenced several generations of academics and public intellectuals, and has had widespread popular appeal.\n\nRegarding human nature, Rand said, “Man is a being of self-made soul.” Rand believes human beings are not born in sin or with destructive desires; nor do they necessarily acquire them in the course of growing to maturity. Instead one is born morally tabula rasa (a blank slate), and through one’s choices and actions one acquires one’s character traits and habits. Having chronic desires to steal, rape, or kill others is the result of mistaken development and the acquisition of bad habits, just as are chronic laziness or the habit of eating too much junk food. And just as one is not born lazy but can by one’s choices develop oneself into a person of vigor or sloth, so also one is not born antisocial but can by one’s choices develop oneself into a person of cooperativeness or conflict.\n\nTable of Contents\n\n1. Life\n\nAyn Rand’s life was often as colorful as those of her heroes in her best-selling novels The Fountainhead and Atlas Shrugged. Rand first made her name as a novelist, publishing We the Living (1936), The Fountainhead (1943), and her magnum opus Atlas Shrugged (1957). These philosophical novels embodied themes she subsequently developed in nonfiction form in a series of essays and books written in the 1960s and 1970s.\n\nBorn in St. Petersburg, Russia, on February 2, 1905, Rand was raised in a middle-class family. As a child, she loved storytelling, and at age nine she decided to become a writer. In school she showed academic promise, particularly in mathematics. Her family was devastated by the communist revolution of 1917, both by the social upheavals that the revolution and the ensuing civil war brought and by her father’s pharmacy being confiscated by the Soviets. The family moved to the Crimea to recover financially and to escape the harshness of life the revolution brought to St. Petersburg. They later returned to Petrograd (the new name given to St. Petersburg by the Soviets), where Rand was to attend university.\n\nAt the University of Petrograd, Rand concentrated her studies on history, with secondary focuses on philosophy and literature. At university, she was repelled by the dominance of communist ideas and strong-arm tactics that suppressed free inquiry and discussion. As a youth, she had been repelled by the communists’ political program, and now an adult, she was also more fully aware of the destructive effects that the revolution had had on Russian society more broadly.\n\nHaving studied American history and politics at university, and having long been an admirer of Western plays, music, and movies, she became an admirer of American individualism, vigor, and optimism, seeing them as the opposites of Russian collectivism, decay, and gloom. Not believing, however, that she would be free under the Soviet system to write the kinds of books she wanted to write, she resolved to leave Russia and go to America.\n\nRand graduated from the University of Petrograd in 1924. She then enrolled at the State Institute for Cinema Arts in order to study screenwriting. In 1925, she finally received permission from the Soviet authorities to leave the country in order to visit relatives in the United States. Officially, her visit was to be brief; Rand, however, had already decided not to return to the Soviet Union.\n\nAfter several stops in western European cities, Rand arrived in New York City in February 1926. From New York, she traveled on to Chicago, Illinois, where she spent the next six months living with relatives, learning English, and developing ideas for stories and movies. She had decided to become a screenwriter, and, having received an extension to her visa, she left for Hollywood, California.\n\nOn Rand’s second day in Hollywood, an event occurred that was worthy of her fiction. She was spotted by Cecil B. DeMille, one of Hollywood’s leading directors, while she was standing at the gate of his studio. She had recognized him as he was passing by in his car, and he had noticed her staring at him. He stopped to ask why she was staring, and Rand explained that she had recently arrived from Russia, that she had long been passionate about Hollywood movies, and that she dreamed of being a screenwriter. DeMille was then working on “The King of Kings,” and gave her a ride to his movie set and signed her on as an extra. During her second week at DeMille’s studio, another significant event occurred: Rand met Frank O’Connor, a young actor also working as an extra. Rand and O’Connor were married in 1929, and they remained married for fifty years until his death in 1979.\n\nRand worked for DeMille as a reader of scripts and struggled financially while working on her own writing. She also held a variety of non-writing jobs until in 1932 she was able to sell her first screenplay, “Red Pawn,” to Universal Studios. Also in 1932 her first stage play, “Night of January 16th,” was produced in Hollywood and later on Broadway.\n\nRand had been working for years on her first significant novel, We the Living, and finished it in 1933. However, for several years it was rejected by various publishers, until in 1936 it was published by Macmillan in the U.S. and Cassell in England. Rand described We the Living as the most autobiographical of her novels, its theme being the brutality of life under communist rule in Russia. We the Living did not receive a positive reaction from American reviewers and intellectuals. It was published in the 1930s, a decade sometimes called the “Red Decade,” during which American intellectuals were often pro-communist and respectful and admiring of the Soviet experiment.\n\nRand’s next major project was The Fountainhead, which she had begun to work on in 1935. While the theme of We the Living was political, the theme of The Fountainhead was ethical, focusing on individualist themes of independence and integrity. The novel’s hero, the architect Howard Roark, is Rand’s first embodiment of her ideal man, the man who lives on a principled and heroic scale of achievement.\n\nAs with We the Living, Rand had difficulties getting The Fountainhead published. Twelve publishers rejected it before it was published by Bobbs-Merrill in 1943. Again not well received by reviewers and intellectuals, the novel nonetheless became a best seller, primarily through word-of-mouth recommendation. The Fountainhead made Rand famous as an exponent of individualist ideas, and its continuing to sell well brought her financial security. Warner Brothers produced a movie version of the novel in 1949, starring Gary Cooper and Patricia Neal, for which Rand wrote the screenplay.\n\nIn 1946, Rand began work on her most ambitious novel, Atlas Shrugged. At the time, she was working part-time as a screenwriter for producer Hal Wallis. In 1951, she and her husband moved to New York City, where she began to work full-time on Atlas. Published by Random House in 1957, Atlas Shrugged is her most complete expression of her literary and philosophical vision. Dramatized in the form of a mystery about a man who stopped the motor of the world, the plot and characters embody the political and ethical themes first developed in We the Living and The Fountainhead and integrates them into a comprehensive philosophy including metaphysics, epistemology, economics, and the psychology of love and sex.\n\nAtlas Shrugged was an immediate best seller and Rand’s last work of fiction. Her novels had expressed philosophical themes, although Rand considered herself primarily a novelist and only secondarily a philosopher. The creation of plots and characters and the dramatization of achievements and conflicts were her central purposes in writing fiction, rather than presenting an abstracted and didactic set of philosophical theses.\n\nThe Fountainhead and Atlas Shrugged, however, had attracted to Rand many readers who were strongly interested in the philosophical ideas the novels embodied and in pursuing them further. Among the earliest of those with whom Rand became associated and who later became prominent were psychologist Nathaniel Branden and economist Alan Greenspan, later Chairman of the Federal Reserve. Her interactions with these and several other key individuals were partly responsible for Rand’s turning from fiction to nonfiction writing in order to develop her philosophy more systematically.\n\nFrom 1962 until 1976, Rand wrote and lectured on her philosophy, now named “Objectivism.” Her essays during this period were mostly published in a series of periodicals: The Objectivist Newsletter, published from 1962 to 1965; the larger periodical The Objectivist, published from 1966 to 1971; and then The Ayn Rand Letter, published from 1971 to 1976. The essays written for these periodicals form the core material for a series of nine nonfiction books published during Rand’s lifetime. These books develop Rand’s philosophy in all its major categories and apply it to cultural issues. Perhaps the most significant of these books are The Virtue of Selfishness, which develops her ethical theory, Capitalism: The Unknown Ideal, devoted to political and economic theory, Introduction to Objectivist Epistemology, a systematic presentation of her theory of concepts, and The Romantic Manifesto, a theory of aesthetics.\n\nDuring the 1960s, Rand’s most significant professional relationship was with Nathaniel Branden. Branden, author of The Psychology of Self-Esteem and later known as a leader in the self-esteem movement in psychology, wrote many essays on philosophical and psychological topics that were published in Rand’s books and periodicals. He was the founder and head of the Nathaniel Branden Institute, the leading Objectivist institution of the 1960s. Based in New York City, the Nathaniel Branden Institute published with Rand’s sanction numerous periodicals and pamphlets and sponsored many lectures in New York that were then distributed on tape around the United States and the rest of the world. The rapid growth of the Nathaniel Branden Institute and the Objectivist movement came to a halt in 1968 when, for both professional and personal reasons, Rand and Branden parted ways.\n\nRand continued to write and lecture consistently until she stopped publishing The Ayn Rand Letter in 1976. Thereafter she wrote and lectured less as her husband’s health declined, leading to his death in 1979, and as her own health began to decline. Rand died on March 6, 1982, in her New York City apartment.\n\n2. Rand’s Ethical Theory: Rational Egoism\n\nThe provocative title of Ayn Rand’s The Virtue of Selfishness matches an equally provocative thesis about ethics. Traditional ethics has always been suspicious of self-interest, praising acts that are selfless in intent and calling amoral or immoral acts that are motivated by self-interest. A self-interested person, on the traditional view, will not consider the interests of others and so will slight or harm those interests in the pursuit of his own.\n\nRand’s view is that the exact opposite is true: Self-interest, properly understood, is the standard of morality and selflessness is the deepest immorality.\n\nSelf-interest rightly understood, according to Rand, is to see oneself as an end in oneself. That is to say that one’s own life and happiness are one’s highest values, and that one does not exist as a servant or slave to the interests of others. Nor do others exist as servants or slaves to one’s own interests. Each person’s own life and happiness are their ultimate ends. Self-interest rightly understood also entails self-responsibility: One’s life is one’s own, and so is the responsibility for sustaining and enhancing it. It is up to each of us to determine what values our lives require, how best to achieve those values, and to act to achieve those values.\n\nRand’s ethic of self-interest is integral to her advocacy of classical liberalism. Classical liberalism, more often called “libertarianism” in the twentieth century, is the view that individuals should be free to pursue their own interests. This implies, politically, that governments should be limited to protecting each individual’s freedom to do so. In other words, the moral legitimacy of self-interest implies that individuals have rights to their lives, their liberties, their property, and the pursuit of their own happiness, and that the purpose of government is to protect those rights. Economically, leaving individuals free to pursue their own interests implies in turn that only a capitalist or free market economic system is moral: Free individuals will use their time, money, and other property as they see fit, and will interact and trade voluntarily with others to mutual advantage.\n\n3. Reason and Ethics\n\nFundamentally, the means by which humans live is reason. Our capacity for reason is what enables us to survive and flourish. We are not born knowing what is good for us; that is learned. Nor are we born knowing how to achieve what is good for us; that too is learned. It is by reason that we learn what is food and what is poison, what animals are useful or dangerous to us, how to make tools, what forms of social organization are fruitful, and so on.\n\nThus, Rand advocates rational self-interest: One’s interests are not whatever one happens to feel like; rather it is by reason that one identifies what is in one’s interest and what is not. By the use of reason one takes into account all of the factors one can identify, projects the consequences of potential courses of action, and adopts principled policies of action.\n\nThe principled policies a person should adopt are called virtues. A virtue is an acquired character trait; it results from identifying a policy as good and committing to acting consistently in terms of that policy.\n\nOne such virtue is rationality: Having identified the use of reason as fundamentally good, the virtue of rationality is being committed to acting in accordance with reason. Another virtue is productiveness: Given that the values one needs to survive must be produced, the virtue of productiveness is being committed to producing those values. Another is honesty: Given that facts are facts and that one’s life depends on knowing and acting in accordance with the facts, the virtue of honesty is being committed to awareness of the facts.\n\nIndependence and integrity are also core virtues for Rand’s account of self-interest. Given that one must think and act by one’s own efforts, being committed to the policy of independent action is a virtue. And given that one must both identify what is in one’s interests and act to achieve it, the virtue of integrity is a policy of being committed to acting on the basis of one’s beliefs. The opposite policy of believing one thing and doing another is of course the vice of hypocrisy; hypocrisy is a policy of self-destruction, on Rand’s view.\n\nJustice is another core self-interested virtue: Justice, on Rand’s account, means a policy of judging people, including oneself, according to their value and acting accordingly. The opposite policy of giving to people more or less than they deserve is injustice. The final virtue on Rand’s list of core virtues is pride, the policy of “moral ambitiousness,” in Rand’s words. This means a policy of being committed to making oneself be the best one can be, of shaping one’s character to the highest level possible.\n\nThe moral person, in summary, on Rand’s account, is someone who acts and is committed to acting in their best self-interest. It is by living the morality of self-interest that one survives, flourishes, and achieves happiness.\n\n4. Criticisms of Rand’s Ethics\n\nEvery aspect of Rand’s philosophy is subject to lively criticism and debate, but her normative views are the ones most focused upon.\n\nFrom the broadly defined conservative right, the main criticisms are (a) that Rand’s metaphysical naturalism involves an atheism that undercuts religious metaphysics, (b) that her strong emphasis upon empirical data and reason undercut epistemologies based on faith and tradition, and (c) that her normative individualism undercuts the commands of duty, obligation and selflessness that are necessary for achieving social values. From the left, again defined broadly, the main criticisms are (a) that Rand’s individualism atomistically isolates each of us from genuine society, (b) that her advocacy of free markets enables strong-versus-weak exploitation, and in left-postmodern critique (c) that her philosophical fundamentals commit her to an untenable foundationalism and absolutism.\n\nHere we will focus only on the arguments over Rand’s account of self-interest, which is currently a minority position and subject to strong criticism from both the philosophical left and the philosophical right.\n\nThe contrasting view of self-interest typically pits it against morality, holding that one is moral only to the extent that one sacrifices one’s self-interest for the sake of others or, more moderately, to the extent one acts primarily with regard to the interests of others. For example, standard versions of morality will hold that one is moral to the extent one sets aside one’s own interests in order to serve God, or the weak and the poor, or society as a whole. On these accounts, the interests of God, the poor, or society as a whole are held to be of greater moral significance than one’s own, and so accordingly one’s interests should be sacrificed when necessary. These ethics of selflessness thus believe that one should see oneself fundamentally as a servant, as existing to serve the interests of others, not one’s own. “Selfless service to others” or “selfless sacrifice” are stock phrases indicating these accounts’ view of appropriate motivation and action.\n\nOne core difference between Rand’s self-interest view and the selfless view can be seen in the reason why most advocates of selflessness think self-interest is dangerous: conflicts of interest.\n\n5. Conflicts of Interest\n\nMost traditional ethics take conflicts of interest to be fundamental to the human condition, and take ethics to be the solution: Basic ethical principles are to tell us whose interests should be sacrificed in order to resolve the conflicts. If there is, for example, a fundamental conflict between what God wants and what humans naturally want, then religious ethics will make fundamental the principle that human wants should be sacrificed for God’s. If there is a fundamental conflict between what society needs and what individuals want, then some versions of secular ethics will make fundamental the principle that the individual’s wants should be sacrificed for society’s.\n\nTaking conflicts of interest to be fundamental almost always stems from one of two beliefs: that human nature is fundamentally destructive or that economic resources are scarce. If human nature is fundamentally destructive, then humans are naturally in conflict with each other. Many ethical philosophies start from this premise—for example, Plato’s myth of Gyges, Jewish and Christian accounts of original sin, and Freud’s account of the id. If what individuals naturally want to do to each other is rape, steal, and kill, then in order to have society these individual desires need to be sacrificed. Consequently, a basic principle of ethics will be to urge individuals to suppress their natural desires so that society can exist. In other words, self-interest is the enemy, and must be sacrificed for others.\n\nIf economic resources are scarce, then there is not enough to go around. This scarcity then puts human beings in fundamental conflict with each other: For one individual’s need to be satisfied, another’s must be sacrificed. Many ethical philosophies begin with this premise. For example, Thomas Malthus’s theory that population growth outstrips growth in the food supply falls into this category. Karl Marx’s account of capitalist society is that brutal competition leads to the exploitation of some by others. Garrett Hardin’s famous use of the lifeboat analogy asks us to imagine that society is like a lifeboat with more people than its resources can support. And so, in order to solve the problem of destructive competition the lack of resources leads us to, a basic principle of ethics will be to urge individuals to sacrifice their interests in obtaining more, or even some, so that others may obtain more or some and society can exist peacefully. In other words, in a situation of scarcity, self-interest is the enemy and must be sacrificed for others.\n\nRand rejects both the scarce resources and destructive human nature premises. Human beings are not born in sin or with destructive desires; nor do they necessarily acquire them in the course of growing to maturity. Instead one is born morally tabula rasa (“blank slate”), and through one’s choices and actions one acquires one’s character traits and habits. As Rand phrased it, “Man is a being of self-made soul.” Having chronic desires to steal, rape, or kill others is the result of mistaken development and the acquisition of bad habits, just as are chronic laziness or the habit of eating too much junk food. And just as one is not born lazy but can by one’s choices develop oneself into a person of vigor or sloth, one is not born antisocial but can by one’s choices develop oneself into a person of cooperativeness or conflict.\n\nNor are resources scarce, according to Rand, in any fundamental way. By the use of reason, humans can discover new resources and how to use existing resources more efficiently, including recycling where appropriate and making productive processes more efficient. Humans have, for example, continually discovered and developed new energy resources, from animals to wood to coal to oil to nuclear fission to solar panels; and there is no end in sight to this process. At any given moment, the available resources are a fixed amount, but over time the stock of resources are and have been constantly expanding.\n\nBecause humans are rational they can produce an ever-expanding number of goods, and so human interests do not fundamentally conflict with each other. Instead, Rand holds that the exact opposite is true: Since humans can and should be productive, human interests are deeply in harmony with each other. For example, my producing more corn is in harmony with your producing more peas, for by our both being productive and trading with each other we are both better off. It is to your interest that I be successful in producing more corn, just as it is to my interest that you be successful in producing more peas.\n\nConflicts of interest do exist within a narrower scope. For example, in the immediate present available resources are more fixed, and so competition for those resources results, and competition produces winners and losers. Economic competition, however, is a broader form of cooperation, a social way to allocate resources without resorting to physical force and violence. By competition, resources are allocated efficiently and peacefully, and in the long run more resources are produced. Thus, a competitive economic system is in the self-interest of all of us.\n\nAccordingly, Rand argues that her ethic of self-interest is the basis for personal happiness and free and prosperous societies.\n\n6. Rand’s Influence\n\nThe impact of Rand’s ideas is difficult to measure, but it has been large. All her books were still in print as of 2017, had sold more than thirty million copies, and continued to sell approximately one million copies each year. A survey jointly conducted by the Library of Congress and the Book of the Month Club early in the 1990s asked readers to name the book that had most influenced their lives: Atlas Shrugged was second only to the Bible. Excerpts from Rand’s works are regularly reprinted in college textbooks and anthologies, and several volumes have been published posthumously containing her early writings, journals, and letters. As an outsider with iconoclastic views, Rand’s influence within the academic world has been limited, though university press books and scholarly articles about her work continue to be published regularly. Outside the academic world are several institutes founded by those influenced by Rand. Noteworthy among these are the Cato Institute, based in Washington, D.C., the leading libertarian think tank. Rand, along with Nobel Prize-winners Friedrich Hayek and Milton Friedman, was highly instrumental in attracting generations of individuals to the libertarian movement. Also noteworthy are the Ayn Rand Institute, founded in 1985 by philosopher Leonard Peikoff and entrepreneur Edward Snider and based in California, and The Atlas Society, founded in 1990 by philosopher David Kelley and based in Washington, D.C.\n\n7. References and Further Reading\n\na. Primary Sources\n\nRand, Ayn. Atlas Shrugged. Random House, 1957. Rand’s magnum opus of fiction.\n\nRand, Ayn. Capitalism: The Unknown Ideal. New American Library, 1967. A collection of twenty of Rand’s essays on politics, history, and economics. Also includes two essays by psychologist Nathaniel Branden, three by economist Alan Greenspan, and one by historian Robert Hessen.\n\nRand, Ayn. The Fountainhead. Bobbs-Merrill, 1943. The novel of individualism, independence, and integrity that made Rand famous.\n\nRand, Ayn. Introduction to Objectivist Epistemology. New American Library, 1979. Rand’s theory of concept-formation. Includes an essay by philosopher Leonard Peikoff on the analytic/synthetic distinction.\n\nRand, Ayn. Philosophy: Who Needs It. Bobbs-Merrill, 1982. A collection of Rand’s essays on the nature and significance of philosophy, including her critiques of other thinkers such as Kant, Aristotle, Rawls, and Skinner.\n\nRand, Ayn. The Romantic Manifesto. World Publishing, 1969. Paperback edition: New American Library, 1971. A collection of Rand’s essays on philosophy of art and aesthetics.\n\nRand, Ayn. The Virtue of Selfishness. New American Library, 1964. A collection of fourteen of Rand’s essays on ethics. Also includes five essays by psychologist Nathaniel Branden.\n\nRand, Ayn. We the Living. Macmillan, 1936. Rand’s first novel, set in the Soviet Union in the years following the Russian Revolution.\n\n\n\nb. Secondary Sources\n\nBadhwar, Neera, and Long, Roderick T. “Ayn Rand,” The Stanford Encyclopedia of Philosophy, 2010/2016. Two philosophers present an overview of Rand’s life and work in the major areas of philosophy, with special attention to several major disagreements among philosophers working within Objectivism.\n\nBinswanger, Harry. The Biological Basis of Teleological Concepts. Los Angeles, CA: A.R.I. Press, 1990. Written by a philosopher, this is a scholarly work focused on the connection between biology and the concepts at the roots of ethics.\n\nBranden, Nathaniel. The Vision of Ayn Rand: The Basic Principles of Objectivism. Cobden Press, 2009. A comprehensive overview of Rand’s philosophy based on the lecture series presented under Rand’s auspices in the 1960s.\n\nBranden, Nathaniel, and Branden, Barbara. Who Is Ayn Rand? New York: Random House, 1962. This book contains essays on Objectivism’s moral philosophy, its connection to psychological theory, and a literary study of Rand’s novel methods. It contains an additional biographical essay, tracing Rand’s life from birth up until her mid-50s.\n\nBurns, Jennifer. Goddess of the Market: Ayn Rand and the American Right. Oxford University Press, 2009. Written by a historian, a scholarly discussion of Rand’s ambiguous relationship with free market, libertarian, and conservative movements.\n\nGotthelf, Allan and Salmieri, Gregory. A Companion to Ayn Rand. Wiley-Blackwell, 2016. The editors have compiled a series of scholarly entries on all of the major elements of Rand’s philosophy.\n\nGotthelf, Allan and Lennox, James. Concepts and Their Role in Knowledge. University of Pittsburgh Press, 2013. Ten philosophers debate Rand’s epistemology, with focused articles on her theories of perception, concepts, and scientific method.\n\nGotthelf, Allan and Lennox, James. Metaethics, Egoism, and Virtue: Studies in Ayn Rand’s Normative Theory. University of Pittsburgh Press, 2010. Eight philosophers debate Rand’s ethical theory.\n\nHessen, Robert. In Defense of the Corporation. Stanford, CA: Hoover Institution, 1979. An economic historian, Hessen argues and defends from an Objectivist perspective the moral and legal status of the corporate form of business organizations.\n\nHicks, Stephen. “Ayn Rand and Contemporary Business Ethics.” Journal of Accounting, Ethics, and Public Policy 3:1, 2003. A philosopher explores the implications of Rand’s ethics for the foundations of business ethics.\n\nHicks, Stephen. “Egoism in Nietzsche and Ayn Rand.” Journal of Ayn Rand Studies 10:2, 2009. A philosopher compares and contrasts the positions that underlie Nietzsche’s and Rand’s theses on egoism and altruism.\n\nKelley, David. The Evidence of the Senses. Baton Rouge: Louisiana State University Press, 1986. Written by a philosopher working within the Objectivist tradition, this scholarly work in epistemology focuses on the foundational role the senses play in human knowledge.\n\nMayhew, Robert. Ayn Rand’s Marginalia. New Milford, CT: Second Renaissance Books, 1995. This volume contains Rand’s critical comments on over twenty thinkers, including Friedrich Hayek, C. S. Lewis, and Immanuel Kant. Edited by a philosopher, the volume contains facsimiles of the original texts with Rand’s comments on facing pages.\n\nPeikoff, Leonard. The Ominous Parallels: The End of Freedom in America. New York: Stein & Day, 1982. A scholarly work in the philosophy of history, arguing Objectivism’s theses about the role of philosophical ideas in history and applying them to explaining the rise of National Socialism.\n\nPeikoff, Leonard. Objectivism: The Philosophy of Ayn Rand. New York: Dutton, 1991. This is the first comprehensive overview of all aspects of Objectivist philosophy, written by the philosopher closest to Rand during her lifetime.\n\nRasmussen, Douglas and Douglas Den Uyl, editors. The Philosophic Thought of Ayn Rand. Urbana, IL: University of Illinois Press, 1984. A collection of scholarly essays by philosophers, defending and criticizing various aspects of Objectivism’s metaphysics, epistemology, ethics, and politics.\n\nReisman, George. Capitalism: A Treatise on Economics. Ottawa, IL: Jameson Books, 1996. A scholarly work by an economist, developing free-market capitalist economic theory, especially that coming out of the Austrian tradition, and connecting it to Objectivist philosophy.\n\nSciabarra, Chris Matthew. Ayn Rand, The Russian Radical. University Park: Pennsylvania State University Press, 1995. A work in history of philosophy, this book attempts to trace the influence upon Rand’s thinking of dialectical approaches to philosophy prevalent in 19 th century Europe and Russia. Also an introduction and overview of the major branches of Objectivist philosophy.\n\nSmith, Tara. Ayn Rand’s Normative Ethics: The Virtuous Egoist. Cambridge University Press, 2006. A scholarly work by a philosopher on Rand’s meta-ethics and its application in normative ethics.\n\nWilkinson, Will, editor. “What’s Living and Dead in Ayn Rand’s Moral and Political Thought?” Cato Unbound, 2010. Four professors of philosophy—Douglas B. Rasmussen, Michael Huemer, Neera K. Badhwar, and Roderick T. Long—discuss and debate the current state of Rand scholarship.\n\nZwolinski, Matthew. “Is Ayn Rand Right about Rights?” Learn Liberty, April 2017. A philosophy professor argues that Rand’s theory of individual rights is subject to three major criticisms.\n\n\n\nAuthor Information\n\nStephen R. C. Hicks\n\nEmail: shicks@rockford.edu\n\nRockford University\n\nU. S. A."}, {"url": "https://www.cliffsnotes.com/literature/a/anthem/ayn-rand-biography", "page_content": "Ayn Rand Biography\n\nEarly Life and Education\n\nAyn Rand was born Alissa Rosenbaum in 1905 in St. Petersburg, Russia. Rand was raised in an upper-middle-class, European-oriented family, in the midst of the mysticism and nationalism of Russia. Having taught herself to read, Rand, at the age of 8, became captivated by the heroism in a French-language serial adventure titled The Mysterious Valley. At the age of 9, Rand decided to become a writer, inspired especially by Victor Hugo's novels. Hugo's writing helped arm her against the fatalistic view of life that dominated Russia, a country she later described as \"an accidental cesspool of civilization.\"\n\nIn February of 1917, Ayn Rand witnessed the first shots of the Russian Revolution, and later that year she witnessed the Bolshevik Revolution as well. In order to escape the fighting, her family went to the Crimea, where Rand finished high school. The final Communist victory brought the confiscation of her father's pharmacy and periods of near-starvation. When introduced to American history in her last year of high school, Rand immediately took America as her model of what a nation of free men could be. Her love for the West — especially America — was fueled by the Viennese operettas and American and German films, which the Soviets temporarily allowed to be shown.\n\nWhen Rand and her family returned from the Crimea, she entered the University of Petrograd to study philosophy and history, graduating in 1924. She entered the State Institute for Cinema Arts in 1924 to study screenwriting. During this period, Rand produced her first formal writings, essays about Hollywood, published in 1999 by The Ayn Rand Institute Press as Russian Writings on Hollywood.\n\nImmigration to the United States\n\nIn late 1925, Ayn Rand obtained permission to leave the Soviet Union to visit relatives in the United States, on the pretext of learning the American film business. After six months with relatives in Chicago, she moved to Hollywood to pursue a career as a screenwriter. On her second day there, she had a chance meeting with her favorite American director, Cecil B. DeMille, who took her to the set of his epic film The King of Kings and gave her a job, first as an extra, then as a script reader. During the next week at the studio, she met an actor, Frank O'Connor, whom she married in 1929; they were married until his death 50 years later.\n\nCareer Highlights\n\nAfter struggling for several years at various non-writing jobs, including one in the wardrobe department at the RKO film studio, Rand sold her first screenplay, Red Pawn, to Universal Studios in 1932. Rand saw her first stage play, Night of January 16th, produced in Hollywood in 1934 and then on Broadway in 1935. Her first novel, We the Living, was completed in 1933. The most autobiographical of Rand's novels, We the Living, was rejected as too anti-Communist and wasn't published in the United States until 1936. In 1937, Rand devoted a few weeks to write her novella Anthem, which was soon published in England but was not published in the United States until 1947, ten years later.\n\nAlthough positively reviewed, neither We the Living nor Anthem garnered high sales. Not until the publication of The Fountainhead did Ayn Rand achieve fame. Rand began writing The Fountainhead in 1935, taking seven years to complete the book. In the hero of The Fountainhead, architect Howard Roark, she presented for the first time the kind of hero whose depiction was the chief goal of her writing: the ideal man, man \"as he could be and ought to be.\" The Fountainhead was rejected by 12 publishers but finally accepted by Bobbs-Merrill. Although published in 1943, The Fountainhead made history by becoming a bestseller two years later, through word-of-mouth, and it gained for its author lasting recognition as a champion of individualism.\n\nAyn Rand returned to Hollywood in late 1943 to write the screenplay for The Fountainhead, but wartime restrictions delayed production until 1948. Working part-time as a screenwriter for producer Hal Wallis, Rand wrote such scripts as Love Letters and You Came Along, and she began her major novel, Atlas Shrugged, in 1946. In 1951, Rand permanently moved back to New York City and devoted herself full-time to the completion of the novel Atlas Shrugged. Despite extremely negative reviews, Atlas Shrugged quickly became a bestseller.\n\nRand's Philosophy: Objectivism\n\nAfter the publication of Atlas Shrugged in 1957, Ayn Rand realized that she would have to identify the philosophy that made her heroes possible. She termed this philosophy Objectivism and described it as \"a philosophy for living on earth.\" Rand offered private courses on both fiction and nonfiction writing and, in 1958, helped form an institute to teach her philosophy. For the remaining years of her life, Rand devoted herself to nonfiction writing, penning and editing a number of articles for her periodicals. These articles later appeared in numerous philosophic collections and dealt with topics including ethics (The Virtue of Selfishness), politics (Capitalism: the Unknown Ideal), aesthetics (The Romantic Manifesto), and the theory of knowledge (Introduction to Objectivist Epistemology). At the time of her death in 1982, Rand was working on a television miniseries of Atlas Shrugged.\n\nA controversial novelist and philosopher — especially in academic circles — Ayn Rand attained widespread recognition, as indicated by a 1991 joint survey by The Library of Congress and The Book-of-the-Month Club, which placed Atlas Shrugged as second only to the Bible as the most influential book among American readers. The Ayn Rand Society (a subgroup of the American Philosophical Association), an Ayn Rand first-class postage stamp (issued by The U.S. Postal Service in 1999), and an Academy Award-nominated documentary about her life (Ayn Rand: A Sense of Life, 1997) also serve as proof of her influence. The Ayn Rand Institute in Marina del Rey, California, was established in 1985 to increase the awareness of the existence and content of Ayn Rand's philosophy."}, {"url": "https://human.libretexts.org/Bookshelves/Philosophy/Words_of_Wisdom_-_Introduction_to_Philosophy_(Ondich)/07%3A_Late_Modern_Wisdom_1750-1950_CE/7.01%3A_Ayn_Rand", "page_content": "Ayn Rand, 1905 – 1982 CE, was a Russian-American novelist and philosopher. She is best known for her two novels, The Fountainhead and Atlas Shrugged , and for developing a philosophical system she called Objectivism. She was born and educated in Russia, and moved to the United States in 1926. She was first noticed by the media and the general public after the publication in 1943 of her novel, The Fountainhead . In 1957, Rand published her best-known work, the novel Atlas Shrugged . Rand insisted that reason be the only means of acquiring knowledge and she adamantly rejected any kind of adherence to or use of religion. She supported rational and ethical egoism and rejected any form of altruism.\n\nExcerpts from various works\n\n(From The Virtue of Selfishness. “The Objectivist Ethics” ) About Selfishness: The Objectivist ethics proudly advocates and upholds rational selfishness— which means: the values required for man’s survival qua man — which means: the values required for human survival — not the values produced by the desires, the emotions, the “aspirations,” the feelings, the whims or the needs of irrational brutes, who have never outgrown the primordial practice of human sacrifices, have never discovered an industrial society and can conceive of no self-interest but that of grabbing the loot of the moment. The Objectivist ethics holds that human good does not require human sacrifices and cannot be achieved by the sacrifice of anyone to anyone. It holds that the rational interests of men do not clash — that there is no conflict of interests among men who do not desire the unearned, who do not make sacrifices nor accept them, who deal with one another as traders, giving value for value. Internet Encyclopedia of Philosophy: Ayn Rand “The provocative title of Ayn Rand’s The Virtue of Selfishness matches an equally provocative thesis about ethics. Traditional ethics has always been suspicious of self-interest, praising acts that are selfless in intent and calling amoral or immoral acts that are motivated by self-interest. A self-interested person, on the traditional view, will not consider the interests of others and so will slight or harm those interests in the pursuit of his own. Rand’s view is that the exact opposite is true: Self-interest, properly understood, is the standard of morality and selflessness is the deepest immorality.“\n\n(From Philosophy: Who Needs It. “Faith and Force: the Destroyers of the Modern World”) About Altruism: What is the moral code of altruism? The basic principle of altruism is that man has no right to exist for his own sake, that service to others is the only justification of his existence, and that self-sacrifice is his highest moral duty, virtue and value. Do not confuse altruism with kindness, good will or respect for the rights of others. These are not primaries, but consequences, which, in fact, altruism makes impossible. The irreducible primary of altruism, the basic absolute, is self-sacrifice — which means; self-immolation, self-abnegation, self-denial, self-destruction — which means: the self as a standard of evil, the selfless as a standard of the good. Do not hide behind such superficialities as whether you should or should not give a dime to a beggar. That is not the issue. The issue is whether you do or do not have the right to exist without giving him that dime. The issue is whether you must keep buying your life, dime by dime, from any beggar who might choose to approach you. The issue is whether the need of others is the first mortgage on your life and the moral purpose of your existence. The issue is whether man is to be regarded as a sacrificial animal. Any man of self-esteem will answer: “No.” Altruism says: “Yes.” Example Ayn Rand: How is This Still a Thing? Comedy can be an interesting way to approach big ideas. Ayn Rand has been very controversial in philosophy and ethics. Try watching a little John Oliver and his commentary about Ayn Rand and her ideas from this October 2014 clip before continuing on reading about Rand’s ideas.\n\n(From Philosophy: Who Needs It, “Selfishness Without a Self”) About Altruism: It is obvious why the morality of altruism is a tribal phenomenon. Prehistorical men were physically unable to survive without clinging to a tribe for leadership and protection against other tribes. The cause of altruism’s perpetuation into civilized eras is not physical, but psycho-epistemological: the men of self-arrested, perceptual mentality are unable to survive without tribal leadership and “protection” against reality. The doctrine of self-sacrifice does not offend them: they have no sense of self or of personal value — they do not know what it is that they are asked to sacrifice — they have no firsthand inkling of such things as intellectual integrity, love of truth, personally chosen values, or a passionate dedication to an idea. When they hear injunctions against “selfishness,” they believe that what they must renounce is the brute, mindless whim-worship of a tribal lone wolf. But their leaders — the theoreticians of altruism — know better. Immanuel Kant knew it; John Dewey knew it; B. F. Skinner knows it; John Rawls knows it. Observe that it is not the mindless brute, but reason, intelligence, ability, merit, self-confidence, self-esteem that they are out to destroy. I swear, by my life and my love of it, that I will never live for the sake of another man, nor ask another man to live for mine. Ayn Rand\n\n(From For the New Intellectual. “Galt’s Speech”) About the Self: The self you have betrayed is your mind; self-esteem is reliance on one’s power to think. The ego you seek, that essential “you” which you cannot express or define, is not your emotions or inarticulate dreams, but your intellect, that judge of your supreme tribunal whom you’ve impeached in order to drift at the mercy of any stray shyster you describe as your “feeling.” The question isn’t who is going to let me; it’s who is going to stop me. Ayn Rand"}, {"url": "https://aynrand.org/about/timeline/", "page_content": "1982\n\nRand held that each one of us is guided by philosophic ideas, whether we know this or not and whether we choose to think about ideas or not. And these ideas have real consequences in our lives for better or worse, depending on whether they are rational or irrational, true or false. This essay collection, the last work planned by Rand before her death in 1982, brings together pieces of hers that touch on the theme of philosophy’s indispensable role in human life. The title essay is a talk that Rand gave on this subject to the 1974 graduating class at West Point.\n\nWest Point – n.d. West Point, where Rand addressed graduating class in 1974"}, {"url": "https://thecultureofreasoncenter.com/articles/who-was-ayn-rand/", "page_content": "Ayn Rand (1905- 1982) was a Russian-American novelist, philosopher, playwright and screenwriter. She is highly known for her best-selling fiction novels: The Fountainhead and Atlas Shrugged as well as for defining and developing a revolutionary philosophical system called Objectivism. Rand was born and educated in Russia, then emigrated to the United States in 1926. She first achieved fame with the publication of The Fountainhead in 1943 and her magnum opus Atlas Shrugged was published in 1957.\n\nRand's political views are clearly pronounced in her fiction novels, especially in Atlas Shrugged where she emphasized the necessity of respecting individual rights such as life, liberty, property and the pursuit of happiness. Rand advocated both political and social freedom; and, therefore, advocated total separation of economics and state in the form of laissez-faire capitalism enforced via a constitutionally limited government.\n\nAyn Rand was a fierce opponent of all forms of political slavery: collectivism, fascism, communism and socialism, or even a mixed-economy. Her ethical theory promoted rational self-interest as opposed to the sacrifice of others or of oneself. Rand was committed to reason as an absolute means of acquiring knowledge and as the most important aspect of her philosophy stating: \"I am not primarily an advocate of capitalism, but of egoism; and I am not primarily an advocate of egoism, but of reason. If one recognizes the supremacy of reason and applies it consistently, all the rest follows.\""}, {"url": "https://fee.org/articles/ayn-rand-the-russian-radical/", "page_content": "Mr. Brown is a freelance writer.\n\nMuch to my surprise the author of Ayn Rand: The Russian Radical, a comprehensive new study of Rand’s thought and its genesis in Russian culture, has persuaded me that something called “dialectics” is integral to Ayn Rand’s philosophic approach and crucial to its success.\n\nRussian Radical is a different kind of look at Ayn Rand, a full-fledged “hermeneutic” on the contours, development, and interpretation of her thought. Not to fear. Chris Sciabarra is a visiting scholar at New York University who easily deploys crypto-post-modernist scholarly lingo, but he does not seem to be entirely depraved. His fundamental sympathy with Rand’s thought is obvious; and clearly, Sciabarra wants to convey its complexity and power to an academic audience that has often dismissed Rand’s rational egoism and libertarianism as polemical and shallow.\n\nSciabarra wants to approach Objectivism “as an evolved response to the dualities Rand confronted in Soviet Russia. Although she rejected both the mysticism of Russia’s religious traditions and the secular collectivism of the Russian Marxists, she nonetheless remained a profoundly Russian thinker.” The author argues, “Rand’s Russian nature was not reflected merely in her heavy foreign accent or in the length of her novels. She was Russian in more fundamental ways. In the sweeping character of her generalizations, and in her passionate commitment to the practical realization of her ideals, Rand was fully within the Russian literary and philosophic tradition.” The historical inquiry and speculation about Rand’s Russian roots is core to Sciabarra’s project. As political scientist and intellectual historian, his goal in the book is not to evaluate the validity of Rand’s radical ideas (although his analysis is frequently suggestive on that score) but to interpret them in their historical context.\n\nAfter examining the historical background in Russia, Sciabarra goes on to consider how Rand’s dialectical rejection of dualism, as a “by-product” of her Russian heritage, saturated every aspect of her thought. From this angle he dissects the systemic relations of being and knowing, ethics, art, politics, sex, and “history and resolution,” critically illuminating not only Rand’s own thought but also its development and amendment in the hands of her followers, orthodox and non-orthodox alike. At every step, Sciabarra’s scrupulous scholarship, dispassionate tone and dialectically dynamic argument are calculated to render Rand as palatable as possible to serious academic consideration. But the book is not aimed only at academics. It also invites those who already appreciate Rand to consider her thought anew.\n\nRand has repeatedly been read as a kind of “vulgar” Nietzschean egoist herself. But true to her non-dualism, Rand’s mature theory in fact transcends the false alternative of sacrificing one’s self to others or sacrificing others to one’s self. She rejects not only the masochism of conventional altruism but the sadism of conventional, other-trampling “egoism.” To pursue one’s long-range interests rationally, one functions as neither master nor slave. Rand vividly illustrates these themes in her novel The Fountainhead, in which the Nietzschean kinds of egoist are contrasted with the more independent-minded, self-sufficient Howard Roark. Roark succeeds by earning the trust and rational agreement of others, and by trading values with them, not by getting anyone’s self-sacrificial submission (despite dramatic opportunities to do so).\n\nSciabarra’s insight into the import of Rand’s integrative, contextualist dialectic is part of what makes his book distinctive and challenging. His methodology will be controversial, and here I cannot begin to suggest its playing out in the skein of the “hermeneutic.” I take his understanding of Randian dialectic to be somewhat problematic as enunciated, less so as applied in Sciabarra’s actual interpretation of Rand. There is room for much more controversy, too: for example, in Sciabarra’s comparison of Rand to other thinkers, including provocative wondering about, say, whether Rand may have picked up her emphasis on productive work from Karl Marx. In terms of sheer new information, the material on Rand’s education is invaluable, but of a necessarily speculative character.\n\nSciabarra also rehabilitates Rand’s advocacy of limited government and repudiation of anarchism as an expression of her non-dualistic, dialectical approach (and, yes, it turns out that anarchism really is “context-dropping”). He reconstructs Rand’s analysis of power relations on the interlocking personal, cultural, and “structural” levels, and notes that her capitalist ideal is set forth as “the only social system that makes possible a triumph over social fragmentation.”\n\nThe Aristotelian philosopher Henry Veatch has asked whether Objectivism will ever be academically respectable. That formerly open question must now be answered with an unequivocal “Yes,” inasmuch as Chris Matthew Sciabarra’s profound and subtle study has made it inevitable. But more important, Ayn Rand: The Russian Radical is a fundamental challenge to everyone to reassess the remarkable thought of a remarkable woman."}, {"url": "https://www.spiralnature.com/culture/ayn-rand-a-brief-biography/", "page_content": "Ayn Rand was born on February 2, 1905, in the city of Saint Petersburg, Russia and died on March 6, 1983, in New York, USA . “Ayn Rand” was not her birth name; her birth name was Alice Rosenbaum. She adopted the name “Ayn” from a Finish writer and “Rand” shortly after arriving in America from her Remington-Rand typewriter . Rand decided to become an author at the age of nine and “everything [she had] done” was directed towards that goal. Rand attended college in Europe, where she took history as her major subject and philosophy as her “special interest.” The first she took “in order to have a factual knowledge of men’s past, for [her] future writing” and the second “in order to achieve an objective definition of [her] values” .\n\nThough born in Russia and educated in Europe Rand considered herself an American “by choice and conviction” and came to America in 1926 based on her moral premises; believing it to be “the only country where one could be fully free to write.” She came alone and found the transition difficult at first, having to take odd jobs to earn a living until she could make a financial success with her writing . She achieved this with the publication of her second novel The Fountainhead in 1943 which brought her international fame and even more so with the publication of Atlas Shrugged in 1957. With this, her “position in history”, both as a novelist and as a philosopher, was established .\n\nRand met Frank (Charles Francis) O’Conner on a movie set in Hollywood shortly after her move to America . At the time she was interested in writing screen-plays for silent films . He was eight years her senior, born September 22, 1897, in Lorain, Ohio. He was “drawn to motion pictures ever since the first two-reelers came to Lorain” . They were married in 1929 and remained so until his death fifty years later . Rand saw O’Conner as the physical ideal for a man and portrayed this in all her novels. He was not, however, her intellectual ideal , Rand sought this elsewhere.\n\nTheir marriage was not faithful in the traditional sense, however, as she and Nathaniel Branden (who was also married at the time) engaged in an intimate and romantic affair, which Branden insists Rand initiated and wished to maintain. Both were intent on preserving their current marriages and both Rand’s husband, O’Conner and Branden’s wife, Barbara Branden were fully aware of the relationship and professed to agree with the conditions they presented . Rand and Branden (who was her intellectual ideal and was asked to inherit her property and become her “intellectual heir”) were in love, but all held that it was best if they kept this secret from their group of friends (“The Collective”) and associates. Rand dedicated Atlas Shrugged, her most influential novel to him declaring that he was her legal and “intellectual heir” and “proclaimed him to be an ideal exponent of her philosophy” . Eventually, however, Branden lost interest in Rand romantically, though he remained “obsessed” with her intellectually, and sought to break off the relationship. Knowing how this would affect Rand, he wrote her a letter describing why it was “rational” that they terminate their relationship of several years. The letter was not well received .\n\nRand went to Barbara Branden for support; raving about the letter and altogether not accepting what was happening, condemning Branden at every turn. (The Brandens had split up months before, though were still on amicable terms. Barbara knew of the letter and had proof read it for Branden, though she professed to Rand that she was not aware of it.) Rand sought to destroy him professionally, though could not logically do so without making their affair publicly known (which she was not willing to do), but nonetheless sought to destroy him as well as she could . In the 1968 May issue of The Objectivist Newsletter Rand wrote an article titled “To Whom It May Concern” which was six pages long. The following is an excerpt:\n\nThis is to inform my readers and all those interested in Objectivism that Nathaniel Branden and Barbara Branden are no longer associated with this magazine, with me or with my philosophy. I have permanently broken all personal, professional and business association with them, and have withdrawn from them the permission to use my name in connection with their commercial, professional, intellectual or other activities. I hereby withdraw my endorsement of them and of their future works and activities. I repudiate both of them, totally and permanently, as spokesman for or of Objectivism. .\n\nRand later declared Leonard Peikoff as her legal and “intellectual heir” and to this date he remains the representative of her Objectivism and of her works and owns their copyrights. (ibid, 364.))\n\nWorks Cited:\n\n“Ayn Rand – About Her Life.” The Ayn Rand Institute. 1999. http://www.aynrand.com/aynrand. (4 October 2000).\n\nBranden, Barbra and Nathaniel. “In Answer to Rand: Preface.” Nathenial Branden. http://www.nathanielbranden.net/ayn/ayn05.shtml. (10 October 2000).\n\nBranden, Nathaniel. My Years with Ayn Rand. San Francisco: Jossey-Bass Publishers, 1999.\n\nRand, Ayn. Atlas Shrugged. New York: Signet, 1957.\n\nRand, Ayn. The Fountainhead. New York: Signet, 1952."}, {"url": "https://newideal.aynrand.org/ayn-rand-speaks-to-russia/", "page_content": "Ayn Rand escaped from Soviet Russia in 1926 and would never return. But she did not forget the country in which she witnessed firsthand the horrors of communism. In 1968, she was given the opportunity to send a radio message back to Russia, when the Voice of America interviewed her in her native tongue.\n\nOn October 29, 2022, ARI members have a unique opportunity to hear the full fourteen-minute interview in Russian with English subtitles. (A five-minute segment of the full interview was originally played at OCON 2022 in Washington, DC, this past summer). The recording is being prepared for public release on YouTube where Russian speakers will again hear Ayn Rand’s voice, but we’re saving the premiere for our donors.\n\nThe event will take place on October 29, 2022, at 1:00 p.m. eastern time / 10:00 a.m. Pacific time on Zoom. I will be joined by Gena Gorlin, who helped translate the full interview, and Shoshana Milgram, who will help us understand the biographical and historical context in which it was recorded.\n\nProfessor Gorlin is a clinical associate professor in the Department of Psychology at the University of Texas at Austin. She emigrated from the former Soviet Union in 1993. Professor Milgram is an associate professor in the Department of English at Virginia Tech. She is an expert on nineteenth-century Russian literature (among other fields) and Ayn Rand’s biography.\n\nIn our conversation, we’ll discuss not just the content and form of Rand’s interview, but its significance as a historical artifact and its enduring relevance to Russian speakers today. Following a Q&A, we will have breakout rooms for informal chat, hosted by several of our scholars and staff members.\n\nIf you want to attend this unique event as well as other events in the future, consider becoming a member. Membership details are here.\n\nSUPPORT ARI If you value the ideas presented here, please become an ARI Member today. Membership\n\nDo you have a comment or question? I have a comment I have a question"}, {"url": "http://www.saint-petersburg.com/famous-people/ayn-rand/", "page_content": "Ayn Rand\n\nAuthor, philosopher\n\nBorn: St. Petersburg - 2 February 1905\n\nDied: New York - 6 March 1982\n\n\n\nThe controversial, enormously popular American novelist and founder of Objectivist philosophy Ayn Rand was born Alisa Zinovyevna Rosenbaum in St. Petersburg in February 1905, just as the revolution of that year was getting underway. Her father was a pharmacist who, despite the restrictions of an increasingly anti-semitic climate, became successful enough to buy the store he managed and the building in it, on the corner of Nevsky Prospekt and Ploshchad Vosstaniya. According to her later recollections, she was a solitary child who took to writing at a very young age, composing four novels by the time she was eleven.\n\nThe family's comfortable bourgeois existence came to an end with the October Revolution, when Rand witnessed Bolshevik soldiers seizing and looting her father's business. The family moved to Crimea, a White Russian stronghold, where Rand attended high school. The family returned to Petrograd in 1921, and Rand enrolled at Petrograd State University in the Department of Social Pedagogy. After graduating in 1924, she spent one year studying at the State Technicum of Photography and Cinema, where she wrote a monograph about the Polish actress Pola Negri that was her first work to be published.\n\nIn Autumn 1925, Rand was granted a US travel visa to visit relatives in Chicago. She soon moved to Hollywood where she spent several years trying to break into the movie industry as a screenwriter. Her first novel, the semi-autobiographical We The Living, was published in 1936. Considered by many her best literary work, it recounts the fates of a female engineering student and her two lovers, a former aristocrat and an idealistic Communist secret policeman, in post-Revolutionary Petrograd.\n\nThe Fountainhead (1943) and Atlas Shrugged (1957) made Rand a household name, and she spent the rest of her life writing non-fiction works promoting Objectivism, her philosophy espousing the \"virtue of selfishness\" that has become one of the intellectual bedrocks of modern American right-wing thought, with economist Alan Greenspan among her most famous disciples. She died in New York in 1982, but has once again become a major force in American public life with the rise of the Tea Party movement.\n\nDespite Rand's best efforts, she was unable to help the rest of her family leave the Soviet Union, and her parents died during the Siege of Leningrad.\n\nWorks: We the Living (1936, Revised edition 1959)"}], "Ayn Rand moved to the United States in 1926.": [{"url": "https://www.britannica.com/biography/Ayn-Rand", "page_content": "Top Questions Who was Ayn Rand? Ayn Rand was a Russian-born American author and philosopher. Rand authored two best-selling novels, The Fountainhead (1943) and Atlas Shrugged (1957). Her novels were especially influential among conservatives and libertarians from the mid-20th century. Where is Ayn Rand from? Ayn Rand was born in St. Petersburg, Russia, on February 2, 1905. When the tsarist regime was overthrown in the Russian Revolution of 1917, her family moved to Crimea, where she finished high school. She returned to Russia in 1921 and then moved to the United States in 1926. What is Ayn Rand’s real name? Ayn Rand is the pen name of Alissa Zinovievna Rosenbaum. She adopted it when she moved to the United States in 1926. The first name, which rhymes with “pine,” was inspired by the name of a Finnish writer (whom she declined to identify), and the surname she described as an abbreviation of Rosenbaum. When did Ayn Rand begin writing? Ayn Rand arrived in Chicago in 1926 and then moved to Hollywood, where she met American filmmaker Cecil B. DeMille. Her chance encounter with DeMille led to work as a movie extra and eventually to a job as a screenwriter. Rand sold her first screenplay, Red Pawn, to Universal Studios in 1932. What are Ayn Rand’s most famous works? Rand’s first major work, The Fountainhead, was published in 1943. It details the struggle of a genius architect against mediocrity. Her second major work, Atlas Shrugged, was published in 1957. It follows a railroad executive and a steel magnate as they grapple with a collectivist government. Both The Fountainhead and Atlas Shrugged explicate Rand’s personal philosophy of objectivism. How did Ayn Rand die? Rand died of heart failure on March 6, 1982, in New York City. At the time, she had been working on a television adaptation of her novel Atlas Shrugged.\n\nAyn Rand, original name Alissa Zinovievna Rosenbaum, (born February 2, 1905, St. Petersburg, Russia—died March 6, 1982, New York, New York, U.S.), Russian-born American writer whose commercially successful novels promoting individualism and laissez-faire capitalism were influential among conservatives and libertarians and popular among generations of young people in the United States from the mid-20th century.\n\nEarly life and career Her father, Zinovy Rosenbaum, was a prosperous pharmacist. After being tutored at home, Alissa Rosenbaum, the eldest of three children, was enrolled in a progressive school, where she excelled academically but was socially isolated. Following the Russian Revolution of 1917, her father’s shop was confiscated by communist authorities, an event she deeply resented. As a student at Leningrad State University, she studied history and became acquainted with the works of Plato and Aristotle. After graduating in 1924, she enrolled in the State Institute for Cinematography, hoping to become a screenwriter. The arrival of a letter from cousins in Chicago gave her an opportunity to leave the country on the pretext of gaining expertise that she could apply in the Soviet film industry. Upon her arrival in the United States in 1926, she changed her name to Ayn Rand. (The first name, which rhymes with “pine,” was inspired by the name of a Finnish writer, whom she never identified, and the surname she described as an abbreviation of Rosenbaum.) After six months in Chicago she moved to Hollywood, where a fortuitous encounter with the producer Cecil B. DeMille led to work as a movie extra and eventually to a job as a screenwriter. In 1929 she married the actor Frank O’Connor. Soon hired as a filing clerk in the wardrobe department of RKO Radio Pictures, Inc., she rose to head of the department within a year, meanwhile writing stories, plays, and film scenarios in her spare time. She became an American citizen in 1931."}, {"url": "https://www.biography.com/authors-writers/ayn-rand", "page_content": "(1905-1982)\n\nWho Was Ayn Rand?\n\nAyn Rand moved to the United States in 1926 and tried to establish herself in Hollywood. Her first novel, We the Living (1936), championed her rejection of collectivist values in favor of individual self interest, a belief that became more explicit with her subsequent novels The Fountainhead (1943) and Atlas Shrugged (1957). Following the immense success of the latter, Rand promoted her philosophy of Objectivism through courses, lectures and literature.\n\nEarly Years\n\nAyn Rand was born Alissa Zinovievna Rosenbaum on February 2, 1905, in St. Petersburg, Russia. The oldest daughter of Jewish parents (and eventually an avowed atheist), she spent her early years in comfort thanks to her dad's success as a pharmacist, proving a brilliant student.\n\nIn 1917, her father's shop was suddenly seized by Bolshevik soldiers, forcing the family to resume life in poverty in the Crimea. The situation profoundly impacted young Alissa, who developed strong feelings toward government intrusion into individual livelihood. She returned to her city of birth to attend the University of Petrograd, graduating in 1924, and then enrolled at the State Institute for Cinema Arts to study screenwriting.\n\nGranted a visa to visit relatives in Chicago, Alissa left for the United States in early 1926, never to look back. She took on her soon-to-be-famous pen name and, after a few months in Chicago, moved to Hollywood to become a screenwriter.\n\nEarly Writing Career\n\nFollowing a chance encounter with Hollywood titan Cecil B. DeMille, Rand became an extra on the set of his 1927 film The King of Kings, where she met actor Frank O'Connor. They married in 1929, and she became an American citizen in 1931.\n\nRand landed a job as a clerk at RKO Pictures, eventually rising to head of the wardrobe department, and continued developing her craft as a writer. In 1932, she sold her screenplay Red Pawn, a Soviet romantic thriller, to Universal Studios. She soon completed a courtroom drama called Penthouse Legend, which featured the gimmick of audience members serving as the jury. In late 1934, Rand and her husband moved to New York City for its production, now renamed Night of January 16th.\n\nAround this time, Rand also completed her first novel, We the Living. Published in 1936 after several rejections, We the Living championed the moral authority of the individual through its heroine's battles with a Soviet totalitarian state. Rand followed with the novella Anthem (1938), about a future collectivist dystopia in which \"I\" has been stamped out of the language.\n\n'The Fountainhead' and 'Atlas Shrugged'\n\nIn 1937, Rand began researching a new novel by working for New York architect Ely Jacques Kahn. The result, after years of writing and more rejections, was The Fountainhead. Underscoring Rand’s individualistic underpinnings, the book’s hero, architect Howard Roark, refuses to adhere to conventions, going so far as to blowing up one of his own creations. While not an immediate success, The Fountainhead eventually achieved strong sales, and at the end of the decade became a feature film, with Gary Cooper in the role of Roark.\n\nRand's ideas became even more explicit with the 1957 publication of Atlas Shrugged. A massive work of more than 1,000 pages, Atlas Shrugged portrays a future in which leading industrialists drop out of a collectivist society that exploits their talents, culminating with a notoriously lengthy speech by protagonist John Galt. The novel drew some harsh reviews, but became an immediate best seller.\n\nObjectivism and Later Years\n\nAround 1950, Rand met with a college student named Nathan Blumenthal, who changed his name to Nathaniel Branden and became the author's designated heir. Along with his wife, Barbara, Braden formed a group that met at Rand's apartment to engage in intellectual discussions. The group, which included future Federal Reserve Chairman Alan Greenspan, called itself the Collective, or the Class of '43 (the publication year of The Fountainhead).\n\nRand soon honed her philosophy of what she termed \"Objectivism\": a belief in a concrete reality, from which individuals can discern existing truths, and the ultimate moral value of the pursuit of self interest. The development of this system essentially ended her career as a novelist: In 1958, the Nathaniel Branden Institute formed to spread her message through lectures, courses and literature, and in 1962, the author and her top disciple launched The Objectivist Newsletter. Her books during this period, including For the New Intellectual (1961) and Capitalism: The Unknown Ideal (1966), were primarily comprised of previously published essays and other works.\n\nFollowing a public split with Braden, the author published The Romantic Manifesto (1969), a series of essays on the cultural importance of art, and repackaged her newsletter as The Ayn Rand Letter. She continued traveling to give lectures, though she was slowed by an operation for lung cancer. In 1979, she published a collection of articles in Introduction to Objectivist Epistemology, which included an essay from protégé Leonard Peikoff.\n\nDeath and Legacy\n\nRand was working on a television adaptation of Atlas Shrugged when she died of heart failure at her home in New York City on March 6, 1982.\n\nAlthough she weathered criticism for her perceived literary shortcomings and philosophical arguments, Rand undeniably left her mark on the Western culture she embraced. In 1985, Peikoff founded the Ayn Rand Institute to continue her teachings. The following year, Braden's ex-wife, Barbara, published a tell-all memoir, The Passion of Ayn Rand, which later was made into a movie starring Helen Mirren.\n\nInterest in Rand's works resurfaced alongside the rise of the Tea Party movement during President Barack Obama's administration, with leading political proponents like Rand Paul and Ted Cruz proclaiming their admiration for the author. In 2010, the Ayn Rand Institute announced that more than 500,000 copies of Atlas Shrugged had been sold the previous year.\n\nIn 2017, Tony-winning director Ivo van Hove reintroduced The Fountainhead to the American public with a production at the Brooklyn Academy of Music. Having originated at Toneelgroep Amsterdam in the Netherlands, van Hove's version featured his performers speaking in Dutch, with their words projected onto a screen in English.\n\nQUICK FACTS\n\nBirth Year: 1905\n\nBirth date: February 2, 1905\n\nBirth City: St. Petersburg\n\nBirth Country: Russia\n\nGender: Female\n\nBest Known For: Author Ayn Rand wrote the best-selling books 'The Fountainhead' and 'Atlas Shrugged,' and promoted the philosophy of Objectivism.\n\nIndustries\n\nWriting and Publishing\n\n\n\nFilm\n\nAstrological Sign: Aquarius\n\nSchools\n\nUniversity of Petrograd\n\n\n\nState Institute For Cinema Arts\n\nDeath Year: 1982\n\nDeath date: March 6, 1982\n\nDeath State: New York\n\nDeath City: New York\n\nDeath Country: United States\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Ayn Rand Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/authors-writers/ayn-rand\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: November 16, 2021\n\nOriginal Published Date: April 2, 2014\n\nQUOTES"}, {"url": "https://human.libretexts.org/Bookshelves/Philosophy/Words_of_Wisdom_-_Introduction_to_Philosophy_(Ondich)/07%3A_Late_Modern_Wisdom_1750-1950_CE/7.01%3A_Ayn_Rand", "page_content": "Ayn Rand, 1905 – 1982 CE, was a Russian-American novelist and philosopher. She is best known for her two novels, The Fountainhead and Atlas Shrugged , and for developing a philosophical system she called Objectivism. She was born and educated in Russia, and moved to the United States in 1926. She was first noticed by the media and the general public after the publication in 1943 of her novel, The Fountainhead . In 1957, Rand published her best-known work, the novel Atlas Shrugged . Rand insisted that reason be the only means of acquiring knowledge and she adamantly rejected any kind of adherence to or use of religion. She supported rational and ethical egoism and rejected any form of altruism.\n\nExcerpts from various works\n\n(From The Virtue of Selfishness. “The Objectivist Ethics” ) About Selfishness: The Objectivist ethics proudly advocates and upholds rational selfishness— which means: the values required for man’s survival qua man — which means: the values required for human survival — not the values produced by the desires, the emotions, the “aspirations,” the feelings, the whims or the needs of irrational brutes, who have never outgrown the primordial practice of human sacrifices, have never discovered an industrial society and can conceive of no self-interest but that of grabbing the loot of the moment. The Objectivist ethics holds that human good does not require human sacrifices and cannot be achieved by the sacrifice of anyone to anyone. It holds that the rational interests of men do not clash — that there is no conflict of interests among men who do not desire the unearned, who do not make sacrifices nor accept them, who deal with one another as traders, giving value for value. Internet Encyclopedia of Philosophy: Ayn Rand “The provocative title of Ayn Rand’s The Virtue of Selfishness matches an equally provocative thesis about ethics. Traditional ethics has always been suspicious of self-interest, praising acts that are selfless in intent and calling amoral or immoral acts that are motivated by self-interest. A self-interested person, on the traditional view, will not consider the interests of others and so will slight or harm those interests in the pursuit of his own. Rand’s view is that the exact opposite is true: Self-interest, properly understood, is the standard of morality and selflessness is the deepest immorality.“\n\n(From Philosophy: Who Needs It. “Faith and Force: the Destroyers of the Modern World”) About Altruism: What is the moral code of altruism? The basic principle of altruism is that man has no right to exist for his own sake, that service to others is the only justification of his existence, and that self-sacrifice is his highest moral duty, virtue and value. Do not confuse altruism with kindness, good will or respect for the rights of others. These are not primaries, but consequences, which, in fact, altruism makes impossible. The irreducible primary of altruism, the basic absolute, is self-sacrifice — which means; self-immolation, self-abnegation, self-denial, self-destruction — which means: the self as a standard of evil, the selfless as a standard of the good. Do not hide behind such superficialities as whether you should or should not give a dime to a beggar. That is not the issue. The issue is whether you do or do not have the right to exist without giving him that dime. The issue is whether you must keep buying your life, dime by dime, from any beggar who might choose to approach you. The issue is whether the need of others is the first mortgage on your life and the moral purpose of your existence. The issue is whether man is to be regarded as a sacrificial animal. Any man of self-esteem will answer: “No.” Altruism says: “Yes.” Example Ayn Rand: How is This Still a Thing? Comedy can be an interesting way to approach big ideas. Ayn Rand has been very controversial in philosophy and ethics. Try watching a little John Oliver and his commentary about Ayn Rand and her ideas from this October 2014 clip before continuing on reading about Rand’s ideas.\n\n(From Philosophy: Who Needs It, “Selfishness Without a Self”) About Altruism: It is obvious why the morality of altruism is a tribal phenomenon. Prehistorical men were physically unable to survive without clinging to a tribe for leadership and protection against other tribes. The cause of altruism’s perpetuation into civilized eras is not physical, but psycho-epistemological: the men of self-arrested, perceptual mentality are unable to survive without tribal leadership and “protection” against reality. The doctrine of self-sacrifice does not offend them: they have no sense of self or of personal value — they do not know what it is that they are asked to sacrifice — they have no firsthand inkling of such things as intellectual integrity, love of truth, personally chosen values, or a passionate dedication to an idea. When they hear injunctions against “selfishness,” they believe that what they must renounce is the brute, mindless whim-worship of a tribal lone wolf. But their leaders — the theoreticians of altruism — know better. Immanuel Kant knew it; John Dewey knew it; B. F. Skinner knows it; John Rawls knows it. Observe that it is not the mindless brute, but reason, intelligence, ability, merit, self-confidence, self-esteem that they are out to destroy. I swear, by my life and my love of it, that I will never live for the sake of another man, nor ask another man to live for mine. Ayn Rand\n\n(From For the New Intellectual. “Galt’s Speech”) About the Self: The self you have betrayed is your mind; self-esteem is reliance on one’s power to think. The ego you seek, that essential “you” which you cannot express or define, is not your emotions or inarticulate dreams, but your intellect, that judge of your supreme tribunal whom you’ve impeached in order to drift at the mercy of any stray shyster you describe as your “feeling.” The question isn’t who is going to let me; it’s who is going to stop me. Ayn Rand"}, {"url": "https://openlibrary.org/authors/OL59188A/Ayn_Rand", "page_content": "Alice O'Connor (born Alisa Zinovyevna Rosenbaum;[a] February 2, [O.S. January 20] 1905 – March 6, 1982), better known by her pen name Ayn Rand (/aɪn/), was a Russian-American writer and philosopher. She is known for her fiction and for developing a philosophical system she named Objectivism. Born and educated in Russia, she moved to the United States in 1926. She wrote a play that opened on Broadway in 1935. After two early novels that were initially unsuccessful, she achieved fame with her 1943 novel, The Fountainhead. In 1957, Rand published her best-known work, the novel Atlas Shrugged. Afterward, until her death in 1982, she turned to non-fiction to promote her philosophy, publishing her own periodicals and releasing several collections of essays.\n\nRand advocated reason as the only means of acquiring knowledge; she rejected faith and religion. She supported rational and ethical egoism and rejected altruism. In politics, she condemned the initiation of force as immoral[5][6] and opposed collectivism, statism, and anarchism. Instead, she supported laissez-faire capitalism, which she defined as the system based on recognizing individual rights, including property rights. Although Rand opposed libertarianism, which she viewed as anarchism, she is often associated with the modern libertarian movement. In art, Rand promoted romantic realism. She was sharply critical of most philosophers and philosophical traditions known to her, except for Aristotle, Thomas Aquinas and classical liberals.\n\nRand's fiction received mixed reviews from literary critics.[ Although academic interest in her ideas has grown since her death, academic philosophers have generally ignored or rejected her philosophy because of her polemical approach and lack of methodological rigor.[4] Her writings have influenced some libertarians and conservatives politically. The Objectivist movement attempts to spread her ideas, both to the public and in academic settings"}, {"url": "https://postalmuseum.si.edu/people/ayn-rand", "page_content": "33c Ayn Rand single.\n\nCopyright United States Postal Service. All rights reserved.\n\nThe 33-cent Ayn Rand commemorative stamp was issued on April 22, 1999, in New York, New York. The stamp was designed by Phil Jordan of Falls Church, Virginia, and illustrated by Nicholas Gaetano of Fletcher, North Carolina.\n\nAuthor Ayn Rand is famous for \"The Fountainhead\" and \"Atlas Shrugged\". Born Alissa Rosenbaum in St. Petersburg, Russia, Ayn Rand came to the United States in 1926 at the age of 21. Later she became a US citizen. Rand believed that a productive society was the result of individual freedom and effort. Her philosophy shaped all of her books and made her an often controversial but respected author. This stamp continues the American Literary Arts Series.\n\n42.5 million stamps were produced by Ashton-Potter (USA) Ltd., in the offset process.\n\nReference:\n\nPostal Bulletin (March 11, 1999/ April 8, 1999)."}, {"url": "https://www.historycentral.com/Bio/people/Rand.html", "page_content": "Ayn Rand 1905- 1982 Novelist\n\nIconoclast writer Ayn Rand was born in St. Petersburg, Russia in 1905. She immigrated to the United States in 1926, and became an American citizen five years later.\n\nHer visceral hatred of Communism made her a strong believer in Capitalism and the rights of the individual, and an ardent opponent of what she often termed, \"collectivism.\"\n\nHer literary creations often featured strong and unusual individualists engaged in a struggle against \"the system.\" She created a philosophy called objectivism, which rejected selflessness among people in favor of \"I,\" a person's putting himself and his interests first, as long as does not harm others."}, {"url": "https://www.infoplease.com/people/who2-biography/ayn-rand", "page_content": "Philosopher / Writer\n\nName at birth: Alissa Zinovievna Rosenbaum\n\nAyn Rand the author is famous for her novels The Fountainhead and Atlas Shrugged. Ayn Rand the \"philosopher\" is known for what came to be called Objectivism: the idea that the individual should be preeminent over the state and collective action, and that enlightened selfishness and capitalism are the purest forms of individual freedom. Born and educated in Russia, Ayn Rand moved to the United States in 1926, landing in Hollywood to begin a career as a screenwriter. In 1932 she sold her first screenplay, but soon turned to writing novels. Her novelwas published in 1943 and became her best-known work. The story of Howard Roark, a principled architect whose brilliant designs and pure ideals were sneered at and blocked by the cultural elites, it was an early template of the Objectivist ideal. Still occasionally working as a screenwriter, Rand moved to New York City in 1951 and publishedin 1957. That book introduced John Galt, a genius who organizes a strike of great creative thinkers and capitalists to \"stop the motor of the world\" and prove his point that collectivism is corrupt. Rand's ideas were both popular and controversial in an era when communism was still a major force in world affairs. Ayn Rand was in the news again in the early 21st century, as an inspiration to rightwing American candidates suggesting that capitalists and industrial leaders should \"go Galt\" and leave liberals and collectivists to suffer."}, {"url": "http://awardsandwinners.com/winner/?mid=/m/0h25", "page_content": "Quotes\n\nI am leaving it as I found it. Take over. It's yours.\n\nSenor d'Anconia said that you bore him, Mr. Taggart.\n\nI don't build in order to have clients. I have clients in order to build.\n\nThroughout the centuries there were men who took first steps, down new roads, armed with nothing but their own vision.\n\nUpper classes are a nation's past, the middle class its future.\n\nWhat is a demanding pleasure that demands the use of ones mind! Not in the sense of problem solving, but in the sense of exercising discrimination, judgment, awareness.\n\nArt is a selective re-creation of reality according to an artist's metaphysical value-judgments. An artist recreates those aspects of reality which represent his fundamental view of man's nature.\n\nEvery aspect of Western culture needs a new code of ethics -- a rational ethics -- as a precondition of rebirth.\n\nA building has integrity just like a man. And just as seldom.\n\nTo achieve, you need thought. You have to know what you are doing and that's real power.\n\nThere is a level of cowardice lower than that of the conformist: the fashionable non-conformist.\n\nWealth is the product of man's capacity to think.\n\nLove is an expression and assertion of self-esteem, a response to one's own values in the person of another. One gains a profoundly personal, selfish joy from the mere existence of the person one loves. It is one's own personal, selfish happiness that one seeks, earns, and derives from love.\n\nThe purpose of morality is to teach you, not to suffer and die, but to enjoy yourself and live.\n\nThe common good of a collective -- a race, a class, a state -- was the claim and justification of every tyranny ever established over men. Every major horror of history was committed in the name of an altruistic motive. Has any act of selfishness ever equaled the carnage perpetrated by disciples of altruism? Does the fault lie in men's hypocrisy or in the nature of the principle? The most dreadful butchers were the most sincere. The believed in the perfect society reached through the guillotine and the firing squad. Nobody questioned their right to murder since they were murdering for an altruistic purpose. It was accepted that man must be sacrificed for other men. Actors change, but the course of the tragedy remains the same. A humanitarian who starts with the declarations of love for mankind and ends with a sea of blood. It goes on and will go on so long as men believe that an action is good if it is unselfish. That permits the altruist to act and forces his victims to bear it. The leaders of collectivist movements ask nothing of themselves. But observe the results.\n\nWho is John Galt?\n\nRun for your life from any man who tells you that money is evil. That sentence is the leper's bell of an approaching looter."}, {"url": "https://americansthatmatter.com/ayn-rand/", "page_content": "Americans That Matter is an ongoing effort to offer concise biographies of Americans who have made a difference in the world — for good or ill — through their ideas, inventions, and achievements.\n\nThis site was written and illustrated by J.J. McCullough, a Canadian-born Americanophile. Edited by @NathanTsui.\n\nFor questions, comments, or feedback, email him at jjmccullough@gmail.com\n\nTo donate to this site via PayPal, click here."}, {"url": "https://iep.utm.edu/rand/", "page_content": "Ayn Rand (1905—1982)\n\nAyn Rand was a major intellectual of the twentieth century. Born in Russia in 1905 and educated there, she immigrated to the United States after graduating from university. Upon becoming proficient in English and establishing herself as a writer of fiction, she became well-known as a passionate advocate of a philosophy she called Objectivism. This philosophy is in the Aristotelian tradition, with that tradition’s emphasis upon metaphysical naturalism, empirical reason in epistemology, and self-realization in ethics. Her political philosophy is in the classical liberal tradition, with that tradition’s emphasis upon individualism, the constitutional protection of individual rights to life, liberty, and property, and limited government. She wrote both technical and popular works of philosophy, and she presented her philosophy in both fictional and nonfictional forms. Her philosophy has influenced several generations of academics and public intellectuals, and has had widespread popular appeal.\n\nRegarding human nature, Rand said, “Man is a being of self-made soul.” Rand believes human beings are not born in sin or with destructive desires; nor do they necessarily acquire them in the course of growing to maturity. Instead one is born morally tabula rasa (a blank slate), and through one’s choices and actions one acquires one’s character traits and habits. Having chronic desires to steal, rape, or kill others is the result of mistaken development and the acquisition of bad habits, just as are chronic laziness or the habit of eating too much junk food. And just as one is not born lazy but can by one’s choices develop oneself into a person of vigor or sloth, so also one is not born antisocial but can by one’s choices develop oneself into a person of cooperativeness or conflict.\n\nTable of Contents\n\n1. Life\n\nAyn Rand’s life was often as colorful as those of her heroes in her best-selling novels The Fountainhead and Atlas Shrugged. Rand first made her name as a novelist, publishing We the Living (1936), The Fountainhead (1943), and her magnum opus Atlas Shrugged (1957). These philosophical novels embodied themes she subsequently developed in nonfiction form in a series of essays and books written in the 1960s and 1970s.\n\nBorn in St. Petersburg, Russia, on February 2, 1905, Rand was raised in a middle-class family. As a child, she loved storytelling, and at age nine she decided to become a writer. In school she showed academic promise, particularly in mathematics. Her family was devastated by the communist revolution of 1917, both by the social upheavals that the revolution and the ensuing civil war brought and by her father’s pharmacy being confiscated by the Soviets. The family moved to the Crimea to recover financially and to escape the harshness of life the revolution brought to St. Petersburg. They later returned to Petrograd (the new name given to St. Petersburg by the Soviets), where Rand was to attend university.\n\nAt the University of Petrograd, Rand concentrated her studies on history, with secondary focuses on philosophy and literature. At university, she was repelled by the dominance of communist ideas and strong-arm tactics that suppressed free inquiry and discussion. As a youth, she had been repelled by the communists’ political program, and now an adult, she was also more fully aware of the destructive effects that the revolution had had on Russian society more broadly.\n\nHaving studied American history and politics at university, and having long been an admirer of Western plays, music, and movies, she became an admirer of American individualism, vigor, and optimism, seeing them as the opposites of Russian collectivism, decay, and gloom. Not believing, however, that she would be free under the Soviet system to write the kinds of books she wanted to write, she resolved to leave Russia and go to America.\n\nRand graduated from the University of Petrograd in 1924. She then enrolled at the State Institute for Cinema Arts in order to study screenwriting. In 1925, she finally received permission from the Soviet authorities to leave the country in order to visit relatives in the United States. Officially, her visit was to be brief; Rand, however, had already decided not to return to the Soviet Union.\n\nAfter several stops in western European cities, Rand arrived in New York City in February 1926. From New York, she traveled on to Chicago, Illinois, where she spent the next six months living with relatives, learning English, and developing ideas for stories and movies. She had decided to become a screenwriter, and, having received an extension to her visa, she left for Hollywood, California.\n\nOn Rand’s second day in Hollywood, an event occurred that was worthy of her fiction. She was spotted by Cecil B. DeMille, one of Hollywood’s leading directors, while she was standing at the gate of his studio. She had recognized him as he was passing by in his car, and he had noticed her staring at him. He stopped to ask why she was staring, and Rand explained that she had recently arrived from Russia, that she had long been passionate about Hollywood movies, and that she dreamed of being a screenwriter. DeMille was then working on “The King of Kings,” and gave her a ride to his movie set and signed her on as an extra. During her second week at DeMille’s studio, another significant event occurred: Rand met Frank O’Connor, a young actor also working as an extra. Rand and O’Connor were married in 1929, and they remained married for fifty years until his death in 1979.\n\nRand worked for DeMille as a reader of scripts and struggled financially while working on her own writing. She also held a variety of non-writing jobs until in 1932 she was able to sell her first screenplay, “Red Pawn,” to Universal Studios. Also in 1932 her first stage play, “Night of January 16th,” was produced in Hollywood and later on Broadway.\n\nRand had been working for years on her first significant novel, We the Living, and finished it in 1933. However, for several years it was rejected by various publishers, until in 1936 it was published by Macmillan in the U.S. and Cassell in England. Rand described We the Living as the most autobiographical of her novels, its theme being the brutality of life under communist rule in Russia. We the Living did not receive a positive reaction from American reviewers and intellectuals. It was published in the 1930s, a decade sometimes called the “Red Decade,” during which American intellectuals were often pro-communist and respectful and admiring of the Soviet experiment.\n\nRand’s next major project was The Fountainhead, which she had begun to work on in 1935. While the theme of We the Living was political, the theme of The Fountainhead was ethical, focusing on individualist themes of independence and integrity. The novel’s hero, the architect Howard Roark, is Rand’s first embodiment of her ideal man, the man who lives on a principled and heroic scale of achievement.\n\nAs with We the Living, Rand had difficulties getting The Fountainhead published. Twelve publishers rejected it before it was published by Bobbs-Merrill in 1943. Again not well received by reviewers and intellectuals, the novel nonetheless became a best seller, primarily through word-of-mouth recommendation. The Fountainhead made Rand famous as an exponent of individualist ideas, and its continuing to sell well brought her financial security. Warner Brothers produced a movie version of the novel in 1949, starring Gary Cooper and Patricia Neal, for which Rand wrote the screenplay.\n\nIn 1946, Rand began work on her most ambitious novel, Atlas Shrugged. At the time, she was working part-time as a screenwriter for producer Hal Wallis. In 1951, she and her husband moved to New York City, where she began to work full-time on Atlas. Published by Random House in 1957, Atlas Shrugged is her most complete expression of her literary and philosophical vision. Dramatized in the form of a mystery about a man who stopped the motor of the world, the plot and characters embody the political and ethical themes first developed in We the Living and The Fountainhead and integrates them into a comprehensive philosophy including metaphysics, epistemology, economics, and the psychology of love and sex.\n\nAtlas Shrugged was an immediate best seller and Rand’s last work of fiction. Her novels had expressed philosophical themes, although Rand considered herself primarily a novelist and only secondarily a philosopher. The creation of plots and characters and the dramatization of achievements and conflicts were her central purposes in writing fiction, rather than presenting an abstracted and didactic set of philosophical theses.\n\nThe Fountainhead and Atlas Shrugged, however, had attracted to Rand many readers who were strongly interested in the philosophical ideas the novels embodied and in pursuing them further. Among the earliest of those with whom Rand became associated and who later became prominent were psychologist Nathaniel Branden and economist Alan Greenspan, later Chairman of the Federal Reserve. Her interactions with these and several other key individuals were partly responsible for Rand’s turning from fiction to nonfiction writing in order to develop her philosophy more systematically.\n\nFrom 1962 until 1976, Rand wrote and lectured on her philosophy, now named “Objectivism.” Her essays during this period were mostly published in a series of periodicals: The Objectivist Newsletter, published from 1962 to 1965; the larger periodical The Objectivist, published from 1966 to 1971; and then The Ayn Rand Letter, published from 1971 to 1976. The essays written for these periodicals form the core material for a series of nine nonfiction books published during Rand’s lifetime. These books develop Rand’s philosophy in all its major categories and apply it to cultural issues. Perhaps the most significant of these books are The Virtue of Selfishness, which develops her ethical theory, Capitalism: The Unknown Ideal, devoted to political and economic theory, Introduction to Objectivist Epistemology, a systematic presentation of her theory of concepts, and The Romantic Manifesto, a theory of aesthetics.\n\nDuring the 1960s, Rand’s most significant professional relationship was with Nathaniel Branden. Branden, author of The Psychology of Self-Esteem and later known as a leader in the self-esteem movement in psychology, wrote many essays on philosophical and psychological topics that were published in Rand’s books and periodicals. He was the founder and head of the Nathaniel Branden Institute, the leading Objectivist institution of the 1960s. Based in New York City, the Nathaniel Branden Institute published with Rand’s sanction numerous periodicals and pamphlets and sponsored many lectures in New York that were then distributed on tape around the United States and the rest of the world. The rapid growth of the Nathaniel Branden Institute and the Objectivist movement came to a halt in 1968 when, for both professional and personal reasons, Rand and Branden parted ways.\n\nRand continued to write and lecture consistently until she stopped publishing The Ayn Rand Letter in 1976. Thereafter she wrote and lectured less as her husband’s health declined, leading to his death in 1979, and as her own health began to decline. Rand died on March 6, 1982, in her New York City apartment.\n\n2. Rand’s Ethical Theory: Rational Egoism\n\nThe provocative title of Ayn Rand’s The Virtue of Selfishness matches an equally provocative thesis about ethics. Traditional ethics has always been suspicious of self-interest, praising acts that are selfless in intent and calling amoral or immoral acts that are motivated by self-interest. A self-interested person, on the traditional view, will not consider the interests of others and so will slight or harm those interests in the pursuit of his own.\n\nRand’s view is that the exact opposite is true: Self-interest, properly understood, is the standard of morality and selflessness is the deepest immorality.\n\nSelf-interest rightly understood, according to Rand, is to see oneself as an end in oneself. That is to say that one’s own life and happiness are one’s highest values, and that one does not exist as a servant or slave to the interests of others. Nor do others exist as servants or slaves to one’s own interests. Each person’s own life and happiness are their ultimate ends. Self-interest rightly understood also entails self-responsibility: One’s life is one’s own, and so is the responsibility for sustaining and enhancing it. It is up to each of us to determine what values our lives require, how best to achieve those values, and to act to achieve those values.\n\nRand’s ethic of self-interest is integral to her advocacy of classical liberalism. Classical liberalism, more often called “libertarianism” in the twentieth century, is the view that individuals should be free to pursue their own interests. This implies, politically, that governments should be limited to protecting each individual’s freedom to do so. In other words, the moral legitimacy of self-interest implies that individuals have rights to their lives, their liberties, their property, and the pursuit of their own happiness, and that the purpose of government is to protect those rights. Economically, leaving individuals free to pursue their own interests implies in turn that only a capitalist or free market economic system is moral: Free individuals will use their time, money, and other property as they see fit, and will interact and trade voluntarily with others to mutual advantage.\n\n3. Reason and Ethics\n\nFundamentally, the means by which humans live is reason. Our capacity for reason is what enables us to survive and flourish. We are not born knowing what is good for us; that is learned. Nor are we born knowing how to achieve what is good for us; that too is learned. It is by reason that we learn what is food and what is poison, what animals are useful or dangerous to us, how to make tools, what forms of social organization are fruitful, and so on.\n\nThus, Rand advocates rational self-interest: One’s interests are not whatever one happens to feel like; rather it is by reason that one identifies what is in one’s interest and what is not. By the use of reason one takes into account all of the factors one can identify, projects the consequences of potential courses of action, and adopts principled policies of action.\n\nThe principled policies a person should adopt are called virtues. A virtue is an acquired character trait; it results from identifying a policy as good and committing to acting consistently in terms of that policy.\n\nOne such virtue is rationality: Having identified the use of reason as fundamentally good, the virtue of rationality is being committed to acting in accordance with reason. Another virtue is productiveness: Given that the values one needs to survive must be produced, the virtue of productiveness is being committed to producing those values. Another is honesty: Given that facts are facts and that one’s life depends on knowing and acting in accordance with the facts, the virtue of honesty is being committed to awareness of the facts.\n\nIndependence and integrity are also core virtues for Rand’s account of self-interest. Given that one must think and act by one’s own efforts, being committed to the policy of independent action is a virtue. And given that one must both identify what is in one’s interests and act to achieve it, the virtue of integrity is a policy of being committed to acting on the basis of one’s beliefs. The opposite policy of believing one thing and doing another is of course the vice of hypocrisy; hypocrisy is a policy of self-destruction, on Rand’s view.\n\nJustice is another core self-interested virtue: Justice, on Rand’s account, means a policy of judging people, including oneself, according to their value and acting accordingly. The opposite policy of giving to people more or less than they deserve is injustice. The final virtue on Rand’s list of core virtues is pride, the policy of “moral ambitiousness,” in Rand’s words. This means a policy of being committed to making oneself be the best one can be, of shaping one’s character to the highest level possible.\n\nThe moral person, in summary, on Rand’s account, is someone who acts and is committed to acting in their best self-interest. It is by living the morality of self-interest that one survives, flourishes, and achieves happiness.\n\n4. Criticisms of Rand’s Ethics\n\nEvery aspect of Rand’s philosophy is subject to lively criticism and debate, but her normative views are the ones most focused upon.\n\nFrom the broadly defined conservative right, the main criticisms are (a) that Rand’s metaphysical naturalism involves an atheism that undercuts religious metaphysics, (b) that her strong emphasis upon empirical data and reason undercut epistemologies based on faith and tradition, and (c) that her normative individualism undercuts the commands of duty, obligation and selflessness that are necessary for achieving social values. From the left, again defined broadly, the main criticisms are (a) that Rand’s individualism atomistically isolates each of us from genuine society, (b) that her advocacy of free markets enables strong-versus-weak exploitation, and in left-postmodern critique (c) that her philosophical fundamentals commit her to an untenable foundationalism and absolutism.\n\nHere we will focus only on the arguments over Rand’s account of self-interest, which is currently a minority position and subject to strong criticism from both the philosophical left and the philosophical right.\n\nThe contrasting view of self-interest typically pits it against morality, holding that one is moral only to the extent that one sacrifices one’s self-interest for the sake of others or, more moderately, to the extent one acts primarily with regard to the interests of others. For example, standard versions of morality will hold that one is moral to the extent one sets aside one’s own interests in order to serve God, or the weak and the poor, or society as a whole. On these accounts, the interests of God, the poor, or society as a whole are held to be of greater moral significance than one’s own, and so accordingly one’s interests should be sacrificed when necessary. These ethics of selflessness thus believe that one should see oneself fundamentally as a servant, as existing to serve the interests of others, not one’s own. “Selfless service to others” or “selfless sacrifice” are stock phrases indicating these accounts’ view of appropriate motivation and action.\n\nOne core difference between Rand’s self-interest view and the selfless view can be seen in the reason why most advocates of selflessness think self-interest is dangerous: conflicts of interest.\n\n5. Conflicts of Interest\n\nMost traditional ethics take conflicts of interest to be fundamental to the human condition, and take ethics to be the solution: Basic ethical principles are to tell us whose interests should be sacrificed in order to resolve the conflicts. If there is, for example, a fundamental conflict between what God wants and what humans naturally want, then religious ethics will make fundamental the principle that human wants should be sacrificed for God’s. If there is a fundamental conflict between what society needs and what individuals want, then some versions of secular ethics will make fundamental the principle that the individual’s wants should be sacrificed for society’s.\n\nTaking conflicts of interest to be fundamental almost always stems from one of two beliefs: that human nature is fundamentally destructive or that economic resources are scarce. If human nature is fundamentally destructive, then humans are naturally in conflict with each other. Many ethical philosophies start from this premise—for example, Plato’s myth of Gyges, Jewish and Christian accounts of original sin, and Freud’s account of the id. If what individuals naturally want to do to each other is rape, steal, and kill, then in order to have society these individual desires need to be sacrificed. Consequently, a basic principle of ethics will be to urge individuals to suppress their natural desires so that society can exist. In other words, self-interest is the enemy, and must be sacrificed for others.\n\nIf economic resources are scarce, then there is not enough to go around. This scarcity then puts human beings in fundamental conflict with each other: For one individual’s need to be satisfied, another’s must be sacrificed. Many ethical philosophies begin with this premise. For example, Thomas Malthus’s theory that population growth outstrips growth in the food supply falls into this category. Karl Marx’s account of capitalist society is that brutal competition leads to the exploitation of some by others. Garrett Hardin’s famous use of the lifeboat analogy asks us to imagine that society is like a lifeboat with more people than its resources can support. And so, in order to solve the problem of destructive competition the lack of resources leads us to, a basic principle of ethics will be to urge individuals to sacrifice their interests in obtaining more, or even some, so that others may obtain more or some and society can exist peacefully. In other words, in a situation of scarcity, self-interest is the enemy and must be sacrificed for others.\n\nRand rejects both the scarce resources and destructive human nature premises. Human beings are not born in sin or with destructive desires; nor do they necessarily acquire them in the course of growing to maturity. Instead one is born morally tabula rasa (“blank slate”), and through one’s choices and actions one acquires one’s character traits and habits. As Rand phrased it, “Man is a being of self-made soul.” Having chronic desires to steal, rape, or kill others is the result of mistaken development and the acquisition of bad habits, just as are chronic laziness or the habit of eating too much junk food. And just as one is not born lazy but can by one’s choices develop oneself into a person of vigor or sloth, one is not born antisocial but can by one’s choices develop oneself into a person of cooperativeness or conflict.\n\nNor are resources scarce, according to Rand, in any fundamental way. By the use of reason, humans can discover new resources and how to use existing resources more efficiently, including recycling where appropriate and making productive processes more efficient. Humans have, for example, continually discovered and developed new energy resources, from animals to wood to coal to oil to nuclear fission to solar panels; and there is no end in sight to this process. At any given moment, the available resources are a fixed amount, but over time the stock of resources are and have been constantly expanding.\n\nBecause humans are rational they can produce an ever-expanding number of goods, and so human interests do not fundamentally conflict with each other. Instead, Rand holds that the exact opposite is true: Since humans can and should be productive, human interests are deeply in harmony with each other. For example, my producing more corn is in harmony with your producing more peas, for by our both being productive and trading with each other we are both better off. It is to your interest that I be successful in producing more corn, just as it is to my interest that you be successful in producing more peas.\n\nConflicts of interest do exist within a narrower scope. For example, in the immediate present available resources are more fixed, and so competition for those resources results, and competition produces winners and losers. Economic competition, however, is a broader form of cooperation, a social way to allocate resources without resorting to physical force and violence. By competition, resources are allocated efficiently and peacefully, and in the long run more resources are produced. Thus, a competitive economic system is in the self-interest of all of us.\n\nAccordingly, Rand argues that her ethic of self-interest is the basis for personal happiness and free and prosperous societies.\n\n6. Rand’s Influence\n\nThe impact of Rand’s ideas is difficult to measure, but it has been large. All her books were still in print as of 2017, had sold more than thirty million copies, and continued to sell approximately one million copies each year. A survey jointly conducted by the Library of Congress and the Book of the Month Club early in the 1990s asked readers to name the book that had most influenced their lives: Atlas Shrugged was second only to the Bible. Excerpts from Rand’s works are regularly reprinted in college textbooks and anthologies, and several volumes have been published posthumously containing her early writings, journals, and letters. As an outsider with iconoclastic views, Rand’s influence within the academic world has been limited, though university press books and scholarly articles about her work continue to be published regularly. Outside the academic world are several institutes founded by those influenced by Rand. Noteworthy among these are the Cato Institute, based in Washington, D.C., the leading libertarian think tank. Rand, along with Nobel Prize-winners Friedrich Hayek and Milton Friedman, was highly instrumental in attracting generations of individuals to the libertarian movement. Also noteworthy are the Ayn Rand Institute, founded in 1985 by philosopher Leonard Peikoff and entrepreneur Edward Snider and based in California, and The Atlas Society, founded in 1990 by philosopher David Kelley and based in Washington, D.C.\n\n7. References and Further Reading\n\na. Primary Sources\n\nRand, Ayn. Atlas Shrugged. Random House, 1957. Rand’s magnum opus of fiction.\n\nRand, Ayn. Capitalism: The Unknown Ideal. New American Library, 1967. A collection of twenty of Rand’s essays on politics, history, and economics. Also includes two essays by psychologist Nathaniel Branden, three by economist Alan Greenspan, and one by historian Robert Hessen.\n\nRand, Ayn. The Fountainhead. Bobbs-Merrill, 1943. The novel of individualism, independence, and integrity that made Rand famous.\n\nRand, Ayn. Introduction to Objectivist Epistemology. New American Library, 1979. Rand’s theory of concept-formation. Includes an essay by philosopher Leonard Peikoff on the analytic/synthetic distinction.\n\nRand, Ayn. Philosophy: Who Needs It. Bobbs-Merrill, 1982. A collection of Rand’s essays on the nature and significance of philosophy, including her critiques of other thinkers such as Kant, Aristotle, Rawls, and Skinner.\n\nRand, Ayn. The Romantic Manifesto. World Publishing, 1969. Paperback edition: New American Library, 1971. A collection of Rand’s essays on philosophy of art and aesthetics.\n\nRand, Ayn. The Virtue of Selfishness. New American Library, 1964. A collection of fourteen of Rand’s essays on ethics. Also includes five essays by psychologist Nathaniel Branden.\n\nRand, Ayn. We the Living. Macmillan, 1936. Rand’s first novel, set in the Soviet Union in the years following the Russian Revolution.\n\n\n\nb. Secondary Sources\n\nBadhwar, Neera, and Long, Roderick T. “Ayn Rand,” The Stanford Encyclopedia of Philosophy, 2010/2016. Two philosophers present an overview of Rand’s life and work in the major areas of philosophy, with special attention to several major disagreements among philosophers working within Objectivism.\n\nBinswanger, Harry. The Biological Basis of Teleological Concepts. Los Angeles, CA: A.R.I. Press, 1990. Written by a philosopher, this is a scholarly work focused on the connection between biology and the concepts at the roots of ethics.\n\nBranden, Nathaniel. The Vision of Ayn Rand: The Basic Principles of Objectivism. Cobden Press, 2009. A comprehensive overview of Rand’s philosophy based on the lecture series presented under Rand’s auspices in the 1960s.\n\nBranden, Nathaniel, and Branden, Barbara. Who Is Ayn Rand? New York: Random House, 1962. This book contains essays on Objectivism’s moral philosophy, its connection to psychological theory, and a literary study of Rand’s novel methods. It contains an additional biographical essay, tracing Rand’s life from birth up until her mid-50s.\n\nBurns, Jennifer. Goddess of the Market: Ayn Rand and the American Right. Oxford University Press, 2009. Written by a historian, a scholarly discussion of Rand’s ambiguous relationship with free market, libertarian, and conservative movements.\n\nGotthelf, Allan and Salmieri, Gregory. A Companion to Ayn Rand. Wiley-Blackwell, 2016. The editors have compiled a series of scholarly entries on all of the major elements of Rand’s philosophy.\n\nGotthelf, Allan and Lennox, James. Concepts and Their Role in Knowledge. University of Pittsburgh Press, 2013. Ten philosophers debate Rand’s epistemology, with focused articles on her theories of perception, concepts, and scientific method.\n\nGotthelf, Allan and Lennox, James. Metaethics, Egoism, and Virtue: Studies in Ayn Rand’s Normative Theory. University of Pittsburgh Press, 2010. Eight philosophers debate Rand’s ethical theory.\n\nHessen, Robert. In Defense of the Corporation. Stanford, CA: Hoover Institution, 1979. An economic historian, Hessen argues and defends from an Objectivist perspective the moral and legal status of the corporate form of business organizations.\n\nHicks, Stephen. “Ayn Rand and Contemporary Business Ethics.” Journal of Accounting, Ethics, and Public Policy 3:1, 2003. A philosopher explores the implications of Rand’s ethics for the foundations of business ethics.\n\nHicks, Stephen. “Egoism in Nietzsche and Ayn Rand.” Journal of Ayn Rand Studies 10:2, 2009. A philosopher compares and contrasts the positions that underlie Nietzsche’s and Rand’s theses on egoism and altruism.\n\nKelley, David. The Evidence of the Senses. Baton Rouge: Louisiana State University Press, 1986. Written by a philosopher working within the Objectivist tradition, this scholarly work in epistemology focuses on the foundational role the senses play in human knowledge.\n\nMayhew, Robert. Ayn Rand’s Marginalia. New Milford, CT: Second Renaissance Books, 1995. This volume contains Rand’s critical comments on over twenty thinkers, including Friedrich Hayek, C. S. Lewis, and Immanuel Kant. Edited by a philosopher, the volume contains facsimiles of the original texts with Rand’s comments on facing pages.\n\nPeikoff, Leonard. The Ominous Parallels: The End of Freedom in America. New York: Stein & Day, 1982. A scholarly work in the philosophy of history, arguing Objectivism’s theses about the role of philosophical ideas in history and applying them to explaining the rise of National Socialism.\n\nPeikoff, Leonard. Objectivism: The Philosophy of Ayn Rand. New York: Dutton, 1991. This is the first comprehensive overview of all aspects of Objectivist philosophy, written by the philosopher closest to Rand during her lifetime.\n\nRasmussen, Douglas and Douglas Den Uyl, editors. The Philosophic Thought of Ayn Rand. Urbana, IL: University of Illinois Press, 1984. A collection of scholarly essays by philosophers, defending and criticizing various aspects of Objectivism’s metaphysics, epistemology, ethics, and politics.\n\nReisman, George. Capitalism: A Treatise on Economics. Ottawa, IL: Jameson Books, 1996. A scholarly work by an economist, developing free-market capitalist economic theory, especially that coming out of the Austrian tradition, and connecting it to Objectivist philosophy.\n\nSciabarra, Chris Matthew. Ayn Rand, The Russian Radical. University Park: Pennsylvania State University Press, 1995. A work in history of philosophy, this book attempts to trace the influence upon Rand’s thinking of dialectical approaches to philosophy prevalent in 19 th century Europe and Russia. Also an introduction and overview of the major branches of Objectivist philosophy.\n\nSmith, Tara. Ayn Rand’s Normative Ethics: The Virtuous Egoist. Cambridge University Press, 2006. A scholarly work by a philosopher on Rand’s meta-ethics and its application in normative ethics.\n\nWilkinson, Will, editor. “What’s Living and Dead in Ayn Rand’s Moral and Political Thought?” Cato Unbound, 2010. Four professors of philosophy—Douglas B. Rasmussen, Michael Huemer, Neera K. Badhwar, and Roderick T. Long—discuss and debate the current state of Rand scholarship.\n\nZwolinski, Matthew. “Is Ayn Rand Right about Rights?” Learn Liberty, April 2017. A philosophy professor argues that Rand’s theory of individual rights is subject to three major criticisms.\n\n\n\nAuthor Information\n\nStephen R. C. Hicks\n\nEmail: shicks@rockford.edu\n\nRockford University\n\nU. S. A."}]}