{"Carol Huston is best known for her roles in the films The Misfits (1961), The Unforgiven (1960), and The Mambo Kings (1992).": [{"url": "https://www.bfi.org.uk/features/film-fate-helped-make-classic-misfits", "page_content": "The Misfits (1961)\n\nWhat makes a film a classic?\n\nIs it the direction, the story and script, the choice of cast, the acting, the camerawork, editing or production design?\n\nIn the end, classic status can be the result of pretty much anything… including, I suspect, accidental or unintended factors. Making a movie is usually an expensive process involving extensive and meticulous planning. But however much one may try to minimise the role played by chance – by shooting, for instance, in a studio with a small cast and crew – one can never eradicate it altogether. Serendipity will always have an effect, which is why a producer or director will often feel relatively chuffed if a movie turns out to be 40 or 50 per cent of what they were aiming for.\n\nGet the latest from the BFI Sign up for BFI news, features, videos and podcasts. Email Sign up\n\nIt’s also why a film can end up terrific despite the odds. Take, for example, John Huston’s The Misfits (1961), starring Marilyn Monroe, Clark Gable and Montgomery Clift. Now, before you say, “Well, of course it was always going to be great with that cast, that director, and that writer on board,” let’s bear a few things in mind. Okay, Arthur Miller, then America’s most respected playwright, wrote the film as ‘a valentine’ for his wife Monroe. But remember that he had next to no experience as a writer for the screen, that the marriage was on the rocks (they divorced shortly before the film’s premiere in early 1961), and Monroe was in many ways a wreck, dependent on alcohol and prescription drugs, having difficulties with remembering her lines and turning up on time at the set. Director John Huston was often drunk, and apparently not averse to falling asleep on set. He would often display more interest in gambling than in the job at hand.\n\nThe Misfits (1961)\n\nThen there were the two male leads. The success of Clark Gable – a Hollywood star par excellence – had always rested rather more on his rugged masculinity, good looks and easy charm than on any particular range, depth or subtlety as an actor. Moreover, the postwar years had not been good for him, and even he regarded many of the roles offered by MGM as unsatisfactory.\n\nAs for Montgomery Clift, yes, he had been a performer of a different order, and for a decade he was undoubtedly one of the finest actors in Hollywood; but after his car accident in 1956, his health went downhill in all kinds of ways, and it tended to show on screen.\n\nIn other words, despite the big names, The Misfits didn’t have too much going for it. Eli Wallach, Thelma Ritter and Kevin McCarthy were around to provide excellent support for the three stars, and few cinematographers could rival Russell Metty, whose CV included visual gems like Bringing Up Baby (1938), Touch of Evil (1958), Spartacus (1960) and a whole host of eye-catching Douglas Sirk titles. But a film usually needs a little more than superior camerawork and fine actors in minor roles to ensure its role as a classic.\n\nThe Misfits (1961)\n\nIndeed, just as the initial omens were not promising, so the film’s release – it barely broke even – didn’t suggest that it would in time become regarded as an important movie for all concerned and something we’d still be watching more than half a century later.\n\nSerendipity played its part in The Misfits’ long-term status, and not only because Gable, Monroe and Clift, notwithstanding the problematic shoot, ended up giving memorably fine performances. As it happened, it turned out to be the last completed film for both Gable (who died just 10 days after filming finished) and Monroe (who lived on for another year and a half). For his part, Clift had only two further major roles before his own demise in 1966.\n\nThe film’s consequent association with premature death (though Gable, admittedly, was, at 59, no spring chicken) and the kind of celebrity worship which that can provoke hasn’t harmed its reputation one bit. But I’d suggest there’s more to the film’s enduring value than that kind of slightly morbid cult interest.\n\nThe Misfits (1961)\n\nAlongside the heartfelt performances, The Misfits is memorable for the way Metty’s black-and-white cinematography creates taut, fraught, resonant relationships between the characters (and between humans and horses) in the Nevada desert. But perhaps most rewarding of all is how the almost palpable atmosphere of pain, disappointment and ubiquitous mortality reinforces, complicates and enriches the script’s sometimes trite conception of damaged masculine souls (the ranchers and rodeo-riders played by Gable, Clift and Wallach) redeemed by their encounter with a woman (Monroe’s divorcee Roslyn). Roslyn is essentially presented as a life-force corrective to their apparent indifference regarding the suffering of all the gentle, innocent and beautiful creatures on this earth.\n\nDue to their various personal circumstances, Gable, Clift and Monroe come across as fragile, vulnerable, indecisive and not quite sure where they’re headed or why. That rather muddies Miller’s ‘message’ (which was probably inspired by his own feelings about and experiences with Monroe), which is no bad thing. For all the (strikingly staged and shot) struggles with stallions and so on, the film consequently feels less like some sort of poetic fable about primal forces, and more like something recognisably human in scale and nature.\n\nThe Misfits (1961)\n\nMisfits? Hardly. Aren’t these folks actually just like the rest of us, trying to get by while turning a blind eye to the inevitable? Huston may have been stewed a lot of the time during shooting, but the film has more in common with his very finest works – The Asphalt Jungle (1950), Fat City (1972) and The Dead (1987) – than might at first be apparent. In his book The American Cinema, critic Andrew Sarris famously included Huston in the ‘Less than Meets the Eye’ category of directors. I’d venture to suggest that with The Misfits, thanks in no small part to serendipity, the contrary might be the case."}, {"url": "https://www.imdb.com/title/tt0055184/reviews", "page_content": "10 /10\n\nWarning: Spoilers\n\nThis movie has generated a huge following in since it was made due to the acting by it's leads and directing (John Huston), but it is best known as \"the final movie\" of the stars. It was the final film for Clark Gable. Indeed, it killed Gable due to the scene where he stupidly did his own stunt of trying to restrain a wild horse. However, it was not the last film for Marilyn Monroe. She began work on a film with George Cukor which she was fired from and which was never completed. Since Monty Clift was also in it many people claim it was his last film too. Actually he made several complete films after it, including FREUD (also by John Huston). Thelma Ritter lived until 1969, and she was still making plenty of films until then. Estelle Winwood would reach her 100th year, and was still making films up to a decade before that. As for Kevin McCarthy and Eli Wallach - they are both ('bless 'em) going strong. However the final scene of the script gave a coda to Gable's and Monroe's career. This helps make the public point of view about the film understandable.\n\n\n\nIn his later years, Gable popped up in a series of films where his co-star was a leading lady of similar popular following, who was usually younger than him but his feminine sexual equivalent. These included TEACHER'S PET (with Doris Day) and IT STARTED IN NAPLES (with Sophia Loren). The film he did with Monroe (their only film together) was THE MISFITS, and it was not a comedy.\n\n\n\nTHE MISFITS was supposed to be a philosophical drama about why people can't be loners but have to find their way into some group where they are acceptable to each other. Philosophical films are very difficult ones to turn into box office gold. People go to films as an escape and rarely to feed their brains. But Marilyn's then husband (dramatist Arthur Miller) wrote the screenplay for the film. At the time the Miller-Monroe marriage was collapsing, and this may be why the screenplay seems to be lopsided. Marilyn's character \"Rosalind Taber\" seems to be flighty at points, but at other points too deep. We first see her willing to get through her divorce with Kevin McCarthy (who does a lot with his one brief scene in the film trying to stop the divorce). This shows determination - she even gives a vague reason to McCarthy that it was his fault for keeping her on the shelf while he concentrated on his career. Yet she shows a flakiness too. She tells Thelma Ritter she never wants to see an expensive car that was given to her again.\n\n\n\nThis follows her throughout the film. She is introduced to these modern cowboys through cab driver Eli Wallach (\"Guido\"), and she takes an offer from him to go up to his country house to chill out. Gable and Ritter accompany them. But soon she is showing a different personality: she is a mother-earth figure. Wallach is an ex military pilot who was married, but whose wife died in a fluke situation while pregnant (his car lacked a tire, and he could not rush her to the hospital). Marilyn tries to get to the bottom of Wallach's feelings and it is obvious that Wallach does not want to discuss this. Gable (\"Gay Langdon\") seems more settled - but we learn that daughter and son keep him at arm's length due to his tendency to carouse and get drunk. Marilyn and Gable do turn each other on, but Marilyn is upset by Gable's matter-of-fact feelings about animals like horses and rabbits.\n\n\n\nMontgomery Clift (\"Perce Howland) comes in later in the film when he joins the group headed for a rodeo. All of them have attended rodeos except Monroe. She is horrified at the injuries the cowboys get. Clift gets injured but while he and the other men accept his injuries as normal, Monroe wants to scream about them. Clift also has personal family problems: his mother remarried and the man has basically pushed Clift out of his property rights to his father's ranch. But the lack of his mother's interest in him (she is totally enthralled by the new husband) is what hurts him the most.\n\n\n\nEven the fifth wheel of this ensemble, Ritter (\"Isabelle Steers\") has a serious family problem that makes her a misfit (albeit one who has learned to accept it). Her husband left her for a best friend of her's years before, and has never paid her alimony - he sends her a potted rose once a year. At the end she leaves the film before the conclusion: she meets the husband and her best friend at the rodeo, and they go to her home to spend a few days! Ritter's character is a realist when she is not involved - she keeps warning Marilyn about cowboys and their ways - but she can be remarkably weak in defending her own rights and feelings.\n\n\n\nHow they all come to terms (or fail to come to terms) with their family and personality failures is what I leave to the viewers. It is worthwhile to watch this film to it's emotional climax (the scene with the wild horses), where Monroe's character finally gets her real voice - and Monroe achieved her acting height outside of her performance as \"Cherie\" in BUS STOP). But it is achieved at a ridiculous cost: as mentioned before Gable had to do his own stunt in that scene. The follow-up scene really shows how he was too old for it.\n\n\n\nThere is also that lovely coda: Clark and Marilyn in the pick-up truck looking at the star in the sky that Clark says is his guide. It does sort of seem an appropriate sign-off for those two movie icons."}, {"url": "https://www.filmsite.org/misf.html", "page_content": "Background The Misfits (1961) is a poignant modern-day western drama about the death of the old West, from director John Huston and screenwriter Arthur Miller (who was briefly married to star Marilyn Monroe from 1956-1960, wrote the film for her, and experienced a disintegrating marriage during the film's production). [Note: Ironically, the film was set in Reno, Nevada, where divorces were often sought by separating couples. The year the film premiered, Miller's marriage to Marilyn ended. The film reflected uncanny resemblances to Monroe's own personal life.] It was derived from scriptwriter Arthur Miller's own novelette (appearing in 1957 in Esquire Magazine), and from Milller's first screenplay (written specifically for his wife Marilyn Monroe at the time, during their rocky marriage). The film's budget of $4 million made it one of the most expensive B/W films of its time, and although it was a popular and well-received film, it was met with mixed reviews and responses, and didn't become profitable for United Artists until its home video release and later re-releases. The themes of the introspective picture were the issues of loneliness and lack of communication, and the rugged individualism of modern-day 1960 Nevada cowboys who rounded up wild \"misfit\" mustang horses to be sold for dog food. Some of the film's posters exclaimed the tagline: It shouts and sings with life...explodes with love! The introductions of the film's five main characters in the Nevada desert revealed that three were also 'misfit' cowboys who had failed family relationships (for various reasons) in their lives. Their shifting interactions with each other formed the basis for the film: Roslyn Taber (Marilyn Monroe), a 30 year-old ex-stripper - temporarily renting a place in Reno, NV (a gambling and divorce mecca) after recently obtaining a divorce\n\nIsabelle Steers (Thelma Ritter), Roslyn's friendly landlady\n\nGuido Racanelli (Eli Wallach), a widowed ex-mechanic, tow-truck driver and WWII war pilot-aviator\n\nGaylord \"Gay\" Langland (59 year-old Clark Gable, the name \"Gay\" was short for Gable), an aging, strong-willed, old-school horse-wrangler and roper cowboy\n\nPerce Howland (Montgomery Clift), a death-defying rodeo bull- and bronc-riding drifter, who was destined to inherit his father’s ranch, but denied by his step-father-in-law All three cowboys were captivated by Roslyn's spontaneity, sensual beauty, youthful vitality, and charm. Although Roslyn at first established a wary emotional relationship with Gay, both Guido and Perce appeared to be waiting for their chance to be with her. The thought-provoking film was best known for being the final, haunting, fully-completed film for two major screen legends: 59 year old Clark Gable (once \"The King of Hollywood\") and 35 year old Marilyn Monroe. Monroe had earlier worked with director John Huston when she performed in a small role in The Asphalt Jungle (1950). A film retrospective was made by director Gail Levin over 40 years later, titled Making the Misfits (2002), featuring interviews with Arthur Miller and star Eli Wallach and archival photographs. Huston's film became a precursor of two other 1960s-1970s modern-day western dramas: Hud (1963) and The Last Picture Show (1971). Plot Synopsis The minor classic film concerned a troubled divorcee Roslyn Taber (Marilyn Monroe) in Reno, Nevada who was just completing requirements for a quickie divorce to rid herself of her inattentive husband Raymond (Kevin McCarthy). With difficulty, she practiced her lines to a divorce judge with her experienced, wise-cracking landlady Isabelle Steers (Thelma Ritter). Through Isabelle, she was introduced first to ex-mechanic, former WWII pilot, and widower Guido Racanelli (Eli Wallach) and then in a local bar to aging, washed-out 'real-life' cowboy Gay Langland (Clark Gable), a rugged individualist. When Roslyn asked him: \"How do you just live?\", Langland replied: \"Well, you start by goin' to sleep. You get up when you feel like it. You scratch yourself. You fry yourself some eggs. You see what kind of a day it is. You throw stones at a can. Whistle.\" Isabelle toasted to the state of Nevada, known for gambling and for quickie divorces: (\"Here's to Nevada, the 'leave it' state...You got money you want to gamble, leave it here. You got a wife you wanna get rid of, get rid of her here. Extra atom bomb you don't need, blow it up here. Nobody's gonna mind in the slightest. The slogan of Nevada is 'Anything goes, but don't complain if it went.'...I even left my Southern accent here....I love Nevada. You know, they don't even have regular meal times here. Never met so many people didn't own a watch. Might have two wives at the same time, but no watch. Bless them all\"). Both Gay and Guido were immediately interested in the young voluptuous blonde woman, although she eventually fell in love with the gallant Langland - who was old enough to be her father. During their time together, Gay complimented Roslyn's beauty, and they discussed her profound sadness in life: Gay: \"You're a real beautiful woman. It's almost kind of an honor sittin' next to ya. You just shine in my eyes. That's my true feelin', Roslyn. What makes you so sad? I think you're the saddest girl I ever met.\"\n\nRoslyn: \"You're the first man that ever said that. I'm usually told how happy I am.\"\n\nGay: \"That's because you make a man feel happy...Well, don't get discouraged, girl, you might.\" They were offered Guido's unfinished dream house in the desert, abandoned by heartbroken widower Guido after the death of his wife (during childbirth). Gay suggested that she sort her life out by remaining in the country with him - to be friends, and she agreed. They moved in together (in the ranch-house midway between civilization and the wide-open spaces), but both realized from their past experiences that it was very difficult to \"belong\" to someone else: \"Look, why don't you try it out here for a while, see what happens? You know, sometimes when a person don't know what to do, the best thing is to just stand still. I'll guarantee you'll have something out here you wouldn't find on every corner. I, uh, I may not amount to much in some ways, but I am a good friend...Let me take you back and get your things. Try it for a while, see what happens.\" [Note: Scenes of Roslyn's face are always in soft-focus, while the harsh light of the black and white film accentuates the crags and wrinkles on the faces of the cowboys.] A sexy paddle-ball game was played by Roslyn in her loose-fitting polka-dotted white dress in a bar, to win a bet. Roslyn was exhilarated by the freedom of the wide open spaces, and a new, growing passionate relationship with Langland. Gay and Roslyn engaged in an honest talk about love and his first failed marriage, when she asked: Roslyn: \"What happened? Did you just stop loving your wife, Gay?\"\n\nGay: \"Well, I come home one night and she's all wrapped up in a car with a fella. Turned out to be an old friend. A cousin of mine, as a matter of fact...You know, in those days I thought you got married and that was it. But nothin' is it. Not for ever.\"\n\nRoslyn: \"That's what I can't get used to. Everything keeps changing.\"\n\nGay: \"I'll tell you this, though. I wouldn't know how to say goodbye to you, Roslyn. It surprises me.\" Conflict in a growing love triangle developed between Gay, Roslyn, and his friend Guido, who attempted to persuade her to ally with him: (\"You're through with Gay now, right? Well, tell me. He doesn't know what you're all about. He'll never know. Tell me, Roslyn. I been waitin'. I'm goin' out of my mind with waitin'. Come back with me. Give me a week, two weeks. Let me show you what I am. Tell me, Roslyn. Give me a reason and I'll stop it. There'll be hell to pay, but give me a reason and I'll do it\"). But Roslyn she rejected his offer: \"You never felt anything for anybody in your life. All you know is the sad words. You could blow up the world, and all you would feel is sorry for yourself!\" The trio of men -- Langland, Guido, and reckless, worn-out, injured 'rodeo cowboy' rider Perce Howland (Montgomery Clift) -- teamed up to go after a herd of wild horses in the desert highlands for a last roundup, and they took Roslyn along. After Guido's small airplane guided and terrorized the animals down from the hills, the others lassoed and rounded up the 'misfit' horses from a speeding pick-up truck. The animals included a stallion, four mares, and a colt. Roslyn was ultimately shocked to learn that these free and wild horses would be slaughtered and cheaply sold to a dog food company for pet food. She hysterically screamed at them, accusing them of being murderers - in a dramatic long shot - gesturing and attempting to persuade Langland to call off the roundup. When he refused, she successfully appealed to Perce to defy Langland and release the horses that had already been captured. This infuriated wrangler Langland, who had single-handedly recaptured the stallion leader of the horses after a rough struggle. [Note: After filming ended, sources claimed that Gable's subsequent heart-attack four days later (with his death 12 days later) was due to executing his own strenuous, bronc-busting stunts without a double.] After he had assertively and independently proved that he was the boss, Gay then decided to let the horses free, thereby reconciling with Roslyn: Don't want nobody makin' up my mind for me, that's all. Damn 'em all! They changed it, changed it all around. Smeared it all over with blood. I'm finished with it. It's, it's like, like ropin' a dream now. I just gotta find another way to be alive, that's all. If there is one anymore. (He stands). Perce, cut that mare loose for me, will ya? The roundup ended as a financial failure, but from the ordeal, Roslyn and Langland made a new start together. In the final scene from the front seat of a pick-up truck, Roslyn spoke to Langland about having a family together - he was now optimistic about taking the right path and entering a new phase of life with her: Roslyn: Gay, if there could be one person in the world, a child who could be brave from the beginning - I was scared to when you asked me, but I'm not so much now. Are you?\n\nGay: No.\n\nRoslyn: How do you find your way back in the dark?\n\nLangland: (nodding to the nighttime sky) Just head for that big star straight on. The highway's under it - it'll take us right home."}, {"url": "https://www.desertusa.com/desert-people/misfits.html", "page_content": "The Filming of a Desert Classic: The Misfits\n\nMarilyn Monroe - Clark Gable\n\nBy Joe Zentner\n\nIn the production of the motion picture The Misfits, released in 1961, some of the 20th century's most beguiling cinematic talent gathered in the Nevada desert in what, for several of them, would be a final stab at creating art.\n\nThe Misfits began life as a short story written by playwright Arthur Miller and published by Esquire Magazine in 1957. In the tale, Miller spoke of his memories of modern-day cowboys he had met in 1956 in and around Reno, Nevada, where he had come to divorce his first wife, Mary Grace Slattery. He had seasoned those memories about the cowboys in his story with his infatuation with his second wife, the legendary actress Marilyn Monroe, whom he married in 1956. He felt that she was a pure creature intimately connected to the spirit of life.\n\nIn search of a project that would allow them to work together, Miller and Monroe pitched a film version of The Misfits to United Artists. The studio agreed to produce the film and offered John Huston the job as director. Huston accepted with a one-word response: “Magnificent!”\n\nMiller’s visceral reaction to Reno’s desert landscape had led him to choose the region as the setting for the film, which was not to be a conventional Western. The “misfits” referred to by the title are physically crippled horses and emotionally crippled people. The horses fell to a cruel lariat and ended up canned, piece by piece, as dog food. The people struggled to find emotional stability and ended up picked off, one at a time, by fate.\n\nThe Plot\n\nQuasi-sophisticated but an emotional basket case, Roslyn Taber, Marilyn Monroe’s character, has come to Nevada to get a quickie divorce from her husband, Raymond Taber (played by Kevin McCarthy). After her landlady introduces her to aging cowboy Gay Langland (Clark Gable), Roslyn finds herself at last, seemingly, with a person with whom she can communicate. Meanwhile, Gay and his fellow horsemen, Guido and Perce Howland (played, respectively, by Eli Wallach and Montgomery Clift), scheme to capture a herd of wild mustangs, intending to sell them to a packing company for dog food.\n\nRoslyn accompanies the men on a horse-hunting expedition. She is horrified by the blatant acts of cruelty to the animals. Her anguish forces the men to take an introspective look at their own behavior and motivations.\n\nThe Tortured Marilyn Monroe\n\nBorn Norma Jean Mortenson (though christened Norma Jean Baker) in Los Angeles on June 1, 1926, the woman who would become known to the world as Marilyn Monroe was the daughter of Gladys Baker, an unmarried movie technician. Her mother’s mental instability led to a childhood of foster homes, neglect and abuse for Norma Jean.\n\nAt age 16, Norma Jean married James Dougherty, a defense worker. During World War II, she posed for an army photographer, who shot pin-up pictures of her. Her images caught the attention of many people. She was soon signed by a modeling agency. She bleached her light brown hair, turning herself into a classic blond. In 1946, she divorced Dougherty. In that same year, she signed a contract with the motion picture studio 20th Century Fox, taking the new name of Marilyn Monroe. After several movie flops and in desperate need of money, she posed nude for a calendar photo that became the centerfold of the first issue of Playboy and helped propel her to stardom.\n\nMonroe secured small movie roles, most notably in The Asphalt Jungle (1950), as a crooked lawyer’s niece, and in All About Eve (also 1950), as a “graduate of the Copacabana School of Dramatic Art.” Her rise to movie stardom came rapidly, due primarily to an intensive publicity campaign orchestrated by Fox studios, which realized, belatedly, her box-office potential.\n\nEarly in her film career, Marilyn Monroe starred as a ditzy blonde in such movies as How to Marry a Millionaire and The Seven Year Itch. She later won critical acclaim for her performance in the films Bus Stop and Some Like it Hot.\n\nAlways difficult to direct, Monroe, in her thirties, became increasingly unstable. After trying to take her life several times, she finally succeeded, on the night of August 4, 1962. It remains unclear whether she really meant to kill herself. It is also uncertain whether she had a liaison with President John F. Kennedy. Elton John’s moving tribute to Britain’s Princess Diana, “Candle in the Wind,” was originally written to commemorate Monroe’s life.\n\nThe Doomed Clark Gable\n\nOriginally, John Huston had wanted Robert Mitchum to star as the washed-up cowboy who becomes involved with a divorcée in Reno. But Mitchum considered the script incomprehensible. He dodged Huston’s phone calls. Finally, Huston cast Clark Gable in the part. When Mitchum finally spoke to Huston, he warned about Gable’s age and health. He said, “You get him at the end of a rope, fighting those horses, and that’s going to be the end of him.” Mitchum would prove to be prophetic.\n\nOn location, Gable was much like the cowboy he played in The Misfits: rugged, handsome and fiercely independent, according to Marilyn Newton, one of the movie’s extras. “He was down to earth and would go out of his way to be nice to everyone,” Newton once commented. “He was even warmer off the stage than his Hollywood image led people to believe.”\n\nThe casting of Gable in the movie became a problem. “...while he was intrigued with the script, he didn’t understand it,” Arthur Miller once commented. Miller advised Gable, “Think of it as an Easterner’s Western. The preoccupation of the film is not typically that of a Western film. Instead, it’s about people trying to connect with one another, and yet afraid to do so.”\n\nThe Tumult of the Production\n\nBecause of Monroe’s prior commitment to make the musical Let’s Make Love, production on The Misfits didn’t begin until July 1960, when the Nevada locations were baked by temperatures climbing to 120 degrees each day. Filming lasted through the blistering summer and was finally completed on November 4, 1960. Release came some three months later, on February 1, 1961.\n\nThose blistering days of production sound like a Tennessee Williams-inspired conundrum: Superstar siren lost and depressed. Playwright caught between the art of the cinema and the anguish of a failing marriage. The ailing King of the Movies taking unnecessary risks. A director addicted to the gambling tables. And an intense young method actor, Montgomery Clift, who had his own emotional stress but who nevertheless ended up being the most reliable actor on the set. (Gable’s first reaction to playing a scene with Clift was: “Damn, he’s really good!”)\n\n“It was an anxious set,” one observer recalls. “There was a tremendous amount of tension.” By the time everybody showed up for work in those July days of 1960, it was already 110 degrees Fahrenheit in the shade. Monroe’s habitual lateness didn’t help. She was rarely called before 11:00 a.m., and she usually showed up even later than that. In her defense, she did have to stay up long after midnight trying to learn Miller’s many script changes. At the same time, she was trying to deal with the effects of numerous pain and sleep medications. Though he often resented her tardiness, Gable went out of his way to help her through the shooting, enduring retake after retake while she tried to focus on her lines.\n\nCompounding Monroe’s problems was the fact that the film, conceived while she and Miller were still in the flush of first love, was filmed as their marriage was falling apart. During the shooting, she moved out of their shared hotel room, electing to stay with her acting coach, Paula Strasberg. Moreover, Monroe was heartbroken that a role she had seen as her chance to prove she could play something other than “Marilyn Monroe” was being rewritten, turning into something different than the original vision. Miller would decide to include embarrassing elements from her personal life, for example, references to the failure of her marriage to baseball legend Joe DiMaggio and to the mental problems of her mother. Even Gable’s casting contributed autobiographical elements. Miller knew that his wife idolized “The King” during her childhood, sometimes fantasizing that he was her father.\n\nStrangely, neither director Huston nor anyone else admonished Monroe for her constant tardiness. Huston was nonconfrontational. One might have thought he would have insisted that she be on time. Instead, he was benign. He felt that he couldn’t push Monroe, “because what would that get me?” Huston said, “It will only upset her, so let’s just play this thing out.”\n\nHuston, meanwhile, had his own problems during the production. He was developing emphysema after decades of heavy smoking. Several days of production were lost when he felt too sick to work. Location shooting in the only U. S. state that had legal gaming at the time turned into a huge mistake because Huston usually spent most of his nights in the casinos, gambling until around 5:00 a. m. He would then fall asleep in the director’s chair during filming.\n\nThe studio provided Huston with a gambling allowance. When his losses exceeded the allowance, he stopped production for a week to scrounge more money. He, in fact, convinced Monroe’s psychiatrist to put her in a Los Angeles hospital for a week to deal with her drug dependency, making the actress bear the blame for lost production that he himself had caused.\n\nWith legend John Huston directing a cast of movie icons, in a screenplay written by a famed playwright, The Misfits was one of the most anticipated films ever. However, difficult shooting locations, an unstable leading lady, an aging leading man, a crumbling marriage and an undisciplined director all combined to make the behind-the-scenes event of the film’s production more dramatic than The Misfits itself.\n\nThe film is less an entertaining Western than a cerebral exploration of what happens when discontents fall in love with an insecure woman. By most standards, Marilyn Monroe’s acting in The Misfits is superb. Under John Huston’s direction, she transforms her stunning good looks into something more vulnerable than sexuality. Her characterization of Roslyn Taber is full of haunting depth and subtlety.\n\nThe Aftermath\n\nThe Misfits, filmed mainly in the Reno area, was the only movie Monroe and Gable appeared in together, and it was the last completed film for both. Only a few days after filming ended, Gable’s failing health caught up with him. He died of a heart attack at age 59. The film may have contributed to the actor’s death.\n\nThe most strenuous scenes were those shot near the end of production, when Gable and two other cowboys capture a wild horse herd in the desert and attempt to break the herd’s lead animal. Rumors suggested that the scenes he played in trying to hold back the lead horse contributed to Gable’s heart attack. A close analysis of the film, however, reveals that the dramatic action was more attributable to film direction and editing than to actual events. Gable, in fact, is rarely in the same shot as the lead horse. He did, however, have to shoot a scene in which the horse drags him mercilessly across the desert floor. In truth, the actor was actually holding a rope attached to a truck, with a camera in the truck bed. But even though Gable was heavily padded, he came back from the day’s shooting a bloody mess. The actor tried to lie to his wife that it had just been an accident, but she knew better, telling him, “You’re out of your mind.”\n\nProduction ended with studio work in Hollywood, but Gable was already too sick to attend the celebration party on November 4. He would suffer a massive heart attack two days later. He died 10 days after that. In an interview, Marilyn Monroe wondered mournfully whether she had somehow contributed to his death. Gossip columnist Hedda Hopper blamed Gable’s death on Huston. At the time, few persons seemed to consider that Gable’s three-packs-a-day smoking habit or his overwhelming grief over the death of a good friend, Ward Bond, just days earlier, might have been contributing factors.\n\nSince Huston shot the scenes in sequence and edited the film as shooting progressed, Gable had already seen himself on the screen before becoming ill. He believed it to be his best acting performance ever. Following his death, the studio tried to get the film completed in time for the 1960 Academy Awards, hoping he would share a posthumous nomination. However, when composer Alex North protested that he couldn’t possibly get the picture musically scored that quickly, the idea was dropped.\n\nMarilyn Monroe and Arthur Miller divorced on January 20, 1961. Monroe started filming another movie, Something’s Gotta Give, in 1962. However, Monroe’s deteriorating physical condition and her emotional instability, exacerbated by drugs and personal turmoil, eventually reached such a degree that she was dropped from the film. She forgot her lines. She missed numerous shoots. Less than 21 months later, Marilyn Monroe died by her own hand.\n\nSome film critics suggest that The Misfits was Monroe’s finest acting performance. In playing a vulnerable divorcée, she was really playing herself. The rest of the cast, including Gable and Clift, gave solid performances. However, The Misfits did not immediately receive wide critical acclaim. It was not a box-office smash. Still, its popularity has grown with time. There is a melancholy tone to this engaging black-and-white movie that hints at the tragedy that would soon consume Gable, Monroe and Clift.\n\nMontgomery Clift’s film career did not end with The Misfits. In the same year the movie was released, Clift also starred in Judgement at Nuremberg. The following year he played Sigmund Freud in Freud.\n\nClift’s dependency on drugs and alcohol and his shame about his homosexuality affected him profoundly throughout his career. His life ended on July 23, 1966, when his companion found him lying naked and dead in a New York City hotel room. According to the autopsy, the cause of death was “occlusive coronary artery disease.”\n\nThe fine line that often exists between art and life is remarkable in The Misfits because Monroe, Gable and Clift played characters so much like themselves. Though greeted coolly by critics and audiences in 1961, it is, undeniably, a film that still lives. It has that rare element, mystique.\n\nToday, The Misfits holds special interest as an example of the loss of traditional values in the modern Western. It is one of John Huston’s trademark celebrations of a bunch of charismatic losers. It was the last film from two of Hollywood’s greatest stars.\n\nLife produces few happy endings, but there are brief moments of hope. Perhaps the most metaphorically telling thing about The Misfits is that the “stallions” weren’t really stallions. One must look carefully to observe this anatomical detail, just as one must watch carefully to discern the skill, talent and confusion that went into production of a desert classic."}, {"url": "https://wikimili.com/en/Carol_Huston", "page_content": "Dyan Cannon is an American actress, filmmaker and editor. Her accolades include a Saturn Award, a Golden Globe Award, three Academy Award nominations and a star on the Hollywood Walk of Fame. She was named Female Star of the Year by the National Association of Theatre Owners in 1973 and the Hollywood Women's Press Club in 1979.\n\nConnie Stevens is an American actress and singer. Born in Brooklyn, New York City to musician parents, Stevens was raised there until age 12, when she was sent to live with family friends in rural Missouri after she witnessed a murder in the city. In 1953, at age 15, Stevens relocated with her father to Los Angeles, California.\n\nRobin Curtis is an American actress. She is best known for replacing Kirstie Alley in the role of Vulcan Lieutenant Saavik in the films Star Trek III: The Search for Spock and Star Trek IV: The Voyage Home.\n\nShelley Lee Long is an American actress, singer, and comedian. Long portrayed Diane Chambers on the hit sitcom Cheers and received five Emmy nominations, winning in 1983 for Outstanding Lead Actress in a Comedy Series. She won two Golden Globe Awards for the role. Long reprised her role as Diane Chambers in three episodes of the spin-off Frasier, for which she received an additional guest star Emmy nomination. In 2009, she began playing a recurring role as DeDe Pritchett on the ABC comedy series Modern Family.\n\nMaggie Roswell is an American actress, comedian, writer and producer from Los Angeles, California. She is well known for her voice work on the Fox network animated television series The Simpsons, in which she has played recurring characters such as Maude Flanders, Helen Lovejoy, Miss Hoover, and Luann Van Houten, as well as several minor characters. This work has earned her an Annie Award nomination.\n\nMarla Gibbs is an American actress, singer, comedian, writer and television producer whose career spans seven decades. Gibbs is known for her role as George Jefferson's maid, Florence Johnston, in the CBS sitcom The Jeffersons (1975–1985), for which she received five nominations for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series.\n\nTracy Kristine Nelson is an American actress. From a long line of entertainers, she is the daughter of musician Ricky Nelson and actress and painter Kristin Nelson.\n\nTricia Leigh Fisher is an American actress and singer.\n\nJulia Margaret Duffy is an American actress. She began her career in television, appearing in minor guest roles before being cast in the role of Penny Davis in the series The Doctors from 1973 until 1977. She starred in the acclaimed Broadway revival of Once in a Lifetime in 1978.\n\nAnn Magnuson is an American actress, performance artist, and nightclub performer. She was described by The New York Times in 1990 as \"An endearing theatrical chameleon who has as many characters at her fingertips as Lily Tomlin does\".\n\nEve Aline Plumb is an American actress, singer and painter. She is best known for portraying the middle daughter Jan Brady on the ABC sitcom The Brady Bunch.\n\nMichele Dominguez Greene is an American actress, singer, and author. She is known for her role as attorney Abby Perkins on the TV series L.A. Law from 1986 to 1991, for which she was nominated for a 1989 Primetime Emmy Award. She reprised the role in the 2002 TV reunion film L.A. Law: The Movie.\n\nAnn Bradford Davis was an American actress. She achieved prominence for her role in the NBC situation comedy The Bob Cummings Show (1955–1959), for which she twice won the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series, but she was best known for playing the part of Alice Nelson, the housekeeper in ABC's The Brady Bunch (1969–1974).\n\nFlorence Agnes Henderson was an American actress and singer. With a career spanning six decades, she is best known for her starring role as Carol Brady on the ABC sitcom The Brady Bunch. Henderson also appeared in film, as well as on stage, and hosted several long-running cooking and variety shows over the years. She appeared as a guest on many scripted and unscripted television programs and as a panelist on numerous game shows. She was a contestant on Dancing with the Stars in 2010.\n\nThe Charmings is an American fantasy sitcom that follows Snow White and Prince Charming, awakened from a thousand-year spell, as they adjust from their familiar life in the enchanted forest to the modern ways of 20th century Los Angeles suburbs. The series originally aired from March 20, 1987, to February 11, 1988, on ABC.\n\nCeleste Thorson is an American actress, model, screenwriter, and activist. She is best known for her roles on How I Met Your Mother, Jimmy Kimmel Live!, The Exes, Heartbeat and as a host for numerous lifestyle and travel television shows. Thorson has written twenty four episodes of television and several short films. As a model, she has been featured in modeling and commercial campaigns for Reebok, Lady Foot Locker, Yoplait, Sprint, Nissan, Nokia, Samsung, Yahoo!, Body Glove, Toms Shoes, and Paul Mitchell.\n\nIrene Tsu is an actress who started in the film Flower Drum Song in 1961. She was featured in an advertising campaign in the 1960s. She speaks English and three varieties of Chinese.\n\nMorningside High School is a public high school in Inglewood, California. It is the second largest high school after Inglewood High School in the city.\n\nJanet Carroll was an American film, stage and television character actress."}, {"url": "https://peoplepill.com/people/carol-huston/", "page_content": "Carol Huston (born August 15, 1963) is an American actress and singer.\n\nEarly life\n\nHuston was born in Chicago, and grew up in Des Plaines, Illinois. Huston attended Forest View High School in nearby Arlington Heights, where she participated in its performing arts program, headed by Dr. Jack Martin and Jerry Swanson. She started her early professional training there as a singer and actress. She attended Wheaton College as a voice major. She also, at the time, performed throughout Chicago as an actor and singer, most notably at the Goodman Theater. She was also a member of the Chicago Sunday Evening Club Chorale, appearing weekly on Chicago's WTTW, a PBS station.\n\nCareer\n\nActing\n\nShe is most well known for her roles in the TV series Matlock, The Charmings and Island Son. Huston replaced Caitlin O'Heaney as Snow Charming on The Charmings in 1987.\n\nShe appeared in an episode of the TV series Diagnosis: Murder called \"Open and Shut\", as well as A Very Brady Christmas as Peter Brady's fiancée (and boss), Valerie Thomas.\n\nShe appeared with Paul Newman and Tom Cruise in The Color of Money (1986), Tom Hanks and Jackie Gleason in Nothing in Common (1986). before relocating permanently to the Southern California area.\n\nReal estate\n\nCarol left acting in 2003 to become a real estate agent in California.\n\nPersonal life\n\nCarol married Gerald \"Jerry\" Watts Jr., on July 20, 2003. She has a daughter, Morgan, from a previous relationship. She also has a grandson, Rhys.\n\nFilmography"}, {"url": "https://allstarbio.com/carol-huston-bio-wiki-net-worth-age-height-married-wife/", "page_content": "Quick Facts of Carol Huston Full Name Carol Huston\n\nDate of Birth 15 August, 1963\n\nNickname Carol\n\nMarital Status Divorce\n\nBirthplace Chicago, Illinois, the United States of America\n\nEthnicity White\n\nProfession Actress, Singer\n\nNationality American\n\nActive Year 1982-2003\n\nEye colour Blue\n\nHair colour Blonde\n\nBuild Slim\n\nSpouse Jerry Watts Jr. (2003–present)\n\nOnline Presence Instagram, Facebook and Twitter\n\nChildren 1\n\nHoroscope Leo\n\nThe ever beautiful actress and a singer, Carol Huston is someone who has marked her territory in the industry through her professional life. Huston is popular for her roles in the television series Matlock, The Charmings and Island Son. Likewise, she played Dorothy in 1989’s film Hooperman.\n\nThere are plenty of Carol’s fans who have a question on their minds, What she is doing now? Who is Huston’s husband? If you’re one of those fans who want to know more about Huston, we must say you have stumbled upon a correct article. Here are all the details related to the singer.\n\nWho is Carol Huston? Know her Bio & Wiki\n\nCarol Huston was born on August 15, 1963, in Chicago, Illinois, the United States of American. Huston holds an American nationality and belongs to white ethnicity. She was raised in Chicago along with her sister and a brother. The other details about her family background and early life are far from the media.\n\nHuston attended Forest View High School in nearby Arlington Heights, where she participated in its performing arts program, headed by Dr.Jack Martin and Jerry Swanson. She began her early professional training there as a singer and actress. Carol attended Wheaton College as a voice major. She was also a member of the Chicago Sunday Evening Club Chorale, which appeared weekly on the WTTW station in Chicago.\n\nCarol Huston’s Age, Height & Body Measurements\n\nTalking about Carol’s age, she is 55 years old as of 2019. In the same way, Huston has a good height and weight but the measurements are unavailable at the moment. Being an actress, Huston has maintained her body figure to it’s optimum. She is blessed with blonde hair and grey eyes.\n\nCarol Huston’ Professional Life\n\nHuston began her acting career since 1982, starring the role Snow White Charming in the film The Charmings. She is most famous for her roles in the TV series Matlock, and Island Son. Huston has appeared in an episode of the TV series Diagnosis: Murder called Open and Shut as well as A Very Brady Christmas as Valerie Thomas.\n\nIn The Color of Money, she appeared with Paul Newman and Tom Cruise. Since 2003, Carol left her acting career to became a real estate agent in California.\n\nSee More:\n\nHow much is Carol Huston’ Net Worth & Salary?\n\nThe hard work and dedication of Carole Hudson have paid off in form of huge net worth. She has an estimated net worth of around $1 million as of 2019. Moreover, Carol’s net worth is aided by her acting career. Looking at Carol’s public apperances we can she is a travel freak and loves to explore new places. Since the actress quit her acting to became a real estate agent in California, she must be earning a big chunk of money from there as well.\n\nEven though she has earned such a hefty amount, Carol hasn’t revealed the details about the house she owns and cars she rides.\n\nSee More:\n\nWho is Carol Huston’ Married to? Know about her husband & children\n\nCarol has earned a good name and fame when it comes to her career. Yet, Huston’ personal life is quite a low key. She was married to her longterm boyfriend turned husband Jerry Watts Jr, on July 20, 2003. Probably, their wedding ceromany was held in a private ceromany hall. However, the former couple hasn’t revealed when and how they met.\n\nDespite sharing several years as a husband and wife, the couple ended their relationship into divorce. With her spouse, Carol shares a daughter Morgan Watts. Similarly, Huston’s past affairs and relationship are also not disclosed yet. Not just that, Hudson is now a grandmother of Morgan’s son Rhys. She often shares pictures of her daughter and grandson on various social media sites such as Instagram, Facebook, and Twitter."}, {"url": "https://www.celebsagewiki.com/carol-huston", "page_content": "Age, Biography and Wiki\n\nCarol Huston was born on 15 August, 1963 in Chicago, Illinois, United States, is an Actress. Discover Carol Huston's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 59 years old?\n\nPopular As N/A Occupation Actress Age 59 years old Zodiac Sign Leo Born 15 August 1963 Birthday 15 August Birthplace Chicago, Illinois, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 15 August. She is a member of famous Actress with the age 59 years old group.\n\nCarol Huston Height, Weight & Measurements\n\nAt 59 years old, Carol Huston height not available right now. We will update Carol Huston's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Carol Huston's Husband?\n\nHer husband is David Hume Kennerly (m. 1989–1992)\n\nFamily Parents Not Available Husband David Hume Kennerly (m. 1989–1992) Sibling Not Available Children 1 daughter, Morgan\n\nCarol Huston Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Carol Huston worth at the age of 59 years old? Carol Huston’s income source is mostly from being a successful Actress. She is from United States. We have estimated Carol Huston's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actress\n\nCarol Huston Social Network\n\nTimeline"}, {"url": "https://www.famousfix.com/topic/carol-huston", "page_content": "Carol Huston was connected to:\n\nover a year ago\n\nTerry Lester (April 13, 1950 – November 28, 2003) was an American actor. His best known roles include Jack Abbott on The Young and the Restless, Mason Capwell on Santa Barbara and Royce Keller on As the World Turns."}, {"url": "https://bodysize.org/en/carol-huston/", "page_content": "Carol Huston is an American actress and singer.\n\nHuston was born in Chicago, and grew up in Des Plaines, Illinois. Huston attended Forest View High School in nearby Arlington Heights, where she participated in its performing arts program, headed by Dr. Jack Martin and Jerry Swanson. She started her early professional training there as a singer and actress. She attended Wheaton College as a voice major. She also, at the time, performed throughout Chicago as an actor and singer, most notably at the Goodman Theater. She was also a member of the Chicago Sunday Evening Club Chorale, appearing weekly on Chicago's WTTW, a PBS station.\n\nShe is most well known for her roles in the TV series Matlock, The Charmings and Island Son. Huston replaced Caitlin O'Heaney as Snow Charming on The Charmings in 1987.\n\nShe appeared in an episode of the TV series Diagnosis: Murder called \"Open and Shut\", as well as A Very Brady Christmas as Peter Brady's fiancée (and boss), Valerie Thomas."}]}