{"Carol Huston made her film debut in The Misfits.": [{"url": "https://www.britannica.com/topic/The-Misfits", "page_content": "The Misfits, American film drama, released in 1961, that is perhaps best remembered as the final movie of screen legends Marilyn Monroe and Clark Gable.\n\nThe Misfits, directed by John Huston, is a contemporary tale of the West that centres on aging cowboys. Out of their element in the modern world, they now herd wild “misfit” horses from their trucks and sell them to be killed and cheaply sold as pet food. Monroe played a troubled ex-stripper who falls in love with Gable’s cowboy character but is appalled at the capture and fate of these once-free animals. The parallel in the plot is thinly disguised: the hopeless plight of the horses mirrors that of their captors.\n\nBritannica Quiz Oscar-Worthy Movie Trivia\n\nPlaywright Arthur Miller wrote the script specifically for Monroe, his wife, though their marriage would disintegrate during production of the film. The publicity surrounding The Misfits centred on Monroe’s real-life problems, unreliable work habits, and temper tantrums. Gable died about a week after the film was finished, and within a year of its release Monroe was dead from a drug overdose. Costar Montgomery Clift made only three films after The Misfits, dying in 1966 at age 45. The scenes depicting the roundup of wild horses are particularly well staged, and Gable’s insistence on doing many of his own stunts might have contributed to the heart attack that killed him."}, {"url": "https://nevadamagazine.com/issue/spring-2021/16977/", "page_content": "When John Huston, Clark Gable, and Marilyn Monroe came to Reno to make a movie ‘about a world in change,’ the whole town got into the act.\n\nBY JOHN GOODE\n\nThis story originally appeared in the November/December 1986 issue of Nevada Magazine.\n\nTwenty-five years ago eager movie buffs filled theaters across the country for the debut of “The Misfits.” Shot entirely on location in and around Reno, the movie had all the makings of a blockbuster. Directed by John Huston and written by Arthur Miller, it starred Clark Gable and Marilyn Monroe, with Eli Wallach, Thelma Ritter, and Mont­gomery Cliff sharing the bill.\n\nBut movie-goers expecting a shoot ’em up Gable western or a sexy Monroe comedy were disappointed. Although some critics gave it four stars, others panned it. Still, it remains a classic.\n\nThe story was based on Nevada reality. In 1956 Miller, seeking a divorce, spent his six weeks’ resid­ency in a cabin near Pyramid Lake. While there he met three Nevada mustangers who impressed him as being “the last three unreconstructed originals in the United States.”\n\nSo begins author James Goode in “The Making of The Misfits.” First printed in 1963 and repub­lished this year, the book is a day-by-day account of the movie’s production, which brought some of film­dom’s best known figures to the Nevada desert. Here Goode describes the arrival of the Hollywood misfits.\n\nJULY 18, 1960 — This morning, at nine o’clock, “The Misfits” company, directed by John Huston, began shooting a series of random Reno scenes devised by Arthur Miller to alternate with the title and credits and establish the setting of the picture. These title shots, made without the principal actors, might have been photographed at any time, but the plan is to shoot in strict script sequence throughout, to enable the actors to stay in the context of meaning as the intricate play unfolds; the day’s shooting also serves to bring the crew together as a unit under Huston. The crew itself was incredibly swift, set­ting up camera, lights, and sound within 15 minutes at each new location and strik­ing in the same time, loading and unload­ing three large trucks of gear at each stop in 104-degree temperature, providing power for the heavy lights from a large gasoline generator.\n\nThe scenes appear to be an unrehearsed look at Reno but are not in fact. For one short sequence, showing a wedding dress revolving in the Virginia Street window of Joseph Magnin, the second assistant direc­tor, Carl Beringer, found aging Freddy Parker in a Commercial Row saloon, saw him as a perfect cinematic drunk, and took him back to the waiting camera. It was no good because Parker, off a bar stool, froze into unrewarding poses. Beringer found it necessary to spend $20 on whiskey before Parker could freely implement Huston’s idea, to whirl drunkenly in balletic parody of the revolving wedding dress.\n\nThe camera moved on to a pawnshop window, created by art director Steve Grimes, which displayed a sad collection of useless male artifacts traded in for another chance on the unremitting Reno slots; then to the slot machines themselves, anthropomorphic cast iron or carved wood replicas of western badmen, with the usual long chrome lever in place of one arm, each with plaster eyes more evil than the last. This surrealistic touch was fol­lowed by a look at long rows of the stand­ard slot machines and crap tables in action in the gambling clubs, in Arthur Miller’s words “a sea of cold chrome.”\n\nThe title shots ended with a bride and groom being escorted by Reno Junior Chamber of Commerce-types in western dress into a “Black Mariah” with accompa­nying gunfire, and driven under the Vir­ginia Street neon sign, RENO, THE BIGGEST LITTLE CITY IN THE WORLD. The bride closed the sequence by returning to her job as a blackjack dealer in the Mapes Hotel casino, still in her white wedding gown, the veil in place. The groom, Walter Ramage, returned to his office. Huston, in the first of a long series of appearances in the casino, celebrated the end of the first day’s shooting by winning $175.\n\nJuly 20 — Today’s shooting call, listing the cast and crew needed for the day and posted in the Mapes Hotel lobby, was for 8 a.m., an hour earlier than usual. The rea­son was a scene showing Clark Gable, as Gay Langland, saying good-by to a St. Louis divorcee at the Southern Pacific train station in the center of town. One of the first scenes in the picture, it called for the lady to board the train and wave good­by as the train pulled out. Since the cost of a special train would have been prohibi­tive, even if one had been available, it was necessary to use the Overland Limited heading west from Chicago to San Fran­cisco, holding it for a few minutes longer than usual. A train heading east might have been more accurate, but there were none during daylight hours.\n\nPlaying opposite Gable in this brief scene was blonde Marietta Tree, socialite and friend of John Huston, and most fa­mous for the Democratic political salon that she runs in her upper-Eastside man­sion in New York. Mrs. Tree had not intended to appear in the picture, but had simply stopped off to see Huston on her way to San Francisco. The day before, Huston had interviewed a local actress who was to play the part of the departing St. Louis divorcee, and had decided against using her. Gable, Huston, and Mrs. Tree were talking later at lunch when Gable suddenly said, “Why don’t we have that one over there?” meaning that Mrs. Tree could very well play the part. Mrs. Tree protested, saying that she wasn’t an actress, and not the type. Gable replied that she was just the type he wanted.\n\nAs the train pulled in at 8:25, discharging passengers, Gable and Mrs. Tree began the farewell scene, establishing Gay Langland’s character as a Reno cowboy who has had frequent affairs with women in town for divorce actions, and also as a man who can’t be bought and who refuses to be tied down. Mrs. Tree, as Susan, said, “Will you think about it? It’s the second largest laundry in St. Louis!” Gay replied, “I wouldn’t want to kid you, Susan. I ain’t cut out for business …. ”\n\nMrs. Tree, as Susan, was crying as she boarded the train and waved good-by from a window as the train pulled out of the station. She said later that she was scared silly about the moving train; knowing Huston’s elaborate practical jokes, she feared that he had given the engineer instructions to keep right on going to San Francisco. But the train stopped after a few feet and backed up into position again for an additional shot. In this one, Guido (Eli Wallach), a garage mechanic, pulling up to a lowered signal at the track, sees Gay and invites him over to Harrah’s for a drink.\n\nCompleting the shot, with tiny micro­phones on sticks at ground level and inside Gable’s shirt, the crew struck the lights and moved on to the next location, a two­-story frame house belonging to the Reno USO and chosen by Steve Grimes as a likely boardinghouse for Roslyn (Marilyn Monroe) and her friend Isabelle (Thelma Ritter). Monroe had not yet arrived in Reno, but she wasn’t required for the first shots at the USO.\n\nThe script called for the arrival of Guido in his garage truck to appraise Roslyn’s new Cadillac convertible, a present from her husband in Chicago. Roslyn, it seems, would like to dispose of both the Cadillac and the husband. Isabelle says in the script that Reno men keep running into Roslyn’s Cadillac just to start conversations, so it was necessary to pound dents into the body of the new car with a sledge hammer. The usual crowd of Reno onlookers winced with each blow, but the crew itself was calm, offering advice to the grip with the hammer.\n\nThelma Ritter appeared for the first time in this scene, her left arm in a sling and carrying a broken alarm clock in her other hand, and speaking in one of the memorable voices of the screen.\n\nThe afternoon was also marked by the arrival of Marilyn Monroe at the Reno airport. Arthur Miller, Frank Taylor, a United Artists publicity man, “The Misfits” still photographer, Al St. Hilaire, a few members of the Reno press, a newsreel photographer, and 200 fans were on hand when a United DC-7 landed at 2:45. In a preview of what was to happen throughout the filming of “The Mis­fits,” America’s oldest enfant terrible did not emerge from the plane for 30 minutes. No one seemed to mind, and everyone waited patiently as she walked to the passenger gate, accompanied by Miller, Rupert Allan, her press representative, and Sydney Guilaroff, who had arranged her hair on the plane. She looked very young in a white blouse and skirt, and was already in char­acter as Roslyn in the upswept platinum wig that she would wear during the pic­ture. There were a few words of welcome, a presentation of flowers by the wife and daughter of the governor, and Monroe was escorted to Taylor’s Thunderbird for a triumphant ride down Virginia Street to the Mapes Hotel. Taylor was hoping to get pictures for the wire services and news­reels of Monroe perched on the back of the open car under the sign, RENO, THE BIGGEST LITTLE …. He did, and Monroe disappeared into the Mapes and her suite on the top floor. It was later explained that the delay at the airport occurred because Miss Monroe was changing her clothes in the ladies’ room on the plane.\n\nJuly 21 — Montgomery Clift and Kevin McCarthy both arrived in Reno today, McCarthy for a three-day appearance as Mr. Taber, Roslyn’s husband, who comes from Chicago to ask Roslyn to reconsider the divorce.\n\nJuly 23 — ln his suite at the Mapes Hotel that afternoon, Huston tried to explain “for what,” and to tell why he had decided to direct “The Misfits.” As he spoke, he drew a succession of ink portraits of this writer, and smoked innumerable Gauloises cigarettes.\n\n“I got the script in the mail with a letter from Arthur Miller. He was unbelievably modest. He asked me if it had any value. I read it and immediately cabled that I liked it very much ….\n\n“What’s behind it? It is about people who sell their work but won’t sell them­selves. Anybody who holds out is a mis­fit. If he loses, he is a failure, and if he is successful, he is rare. This movie is about a world in change. There was meaning in our lives before World War II, but we have lost meaning now. Now the cowboys ride pickup trucks and a rodeo rider is an actor of sorts. Once they sold the wild horses for children’s ponies. And now for dog food. This is a dog-eat-horse society.\n\n“The part of Gay Langland is a point that should be underscored now, not as a preachment. It reveals itself dramatically. He’s the same man but the world has changed. Then he was noble. Now he is ignoble.”\n\nJuly 25 — After rushes, the party walked to Harrah’s Club on Virginia Street, where the company was shooting a scene from the script in which Gay and Guido meet Roslyn and Isabelle in the bar in Har­rah’s. This marked the first time Gable had played opposite Monroe and the entire company was on hand.\n\nIt was also the first time in years that Harrah’s Club, open 24 hours a day, seven days a week, had been closed to the public. The stars emerged from their trailers parked at the curb, and policemen kept a crowd of 300 people from surging through the doorless air-curtain entrance. The atmosphere inside was realistic, jarred only in the bar where the lights, sound boom, and camera were already in place. A casual group of 75 extras, all hired in Reno for $10 a day, milled through the dice and roulette tables and around the slot machines, but did not play. The famil­iar sounds were absent, and even the air ­conditioning had been turned off to permit recording. The normal shift of Har­rah’s dealers, pit bosses, and waitresses stood silently at hand, the dealers losing about $10 a day in tips, Bill Harrah losing an estimated $50,000 each day in gam­bling revenue in exchange for the refer­ences to his club in the script.\n\nThe scene began with Gable and Wal­lach on adjoining bar stools with their backs to the camera, Monroe, and Ritter. Langland’s hound, Tom Dooley, was beside a stool. In the script, Roslyn sees the dog and calls to it. Langland notices that his dog is missing, sees Roslyn, and advan·ces upon her. Guido and Langland are introduced by Isabelle, who has met Guido at the boardinghouse, and the issue is joined. Marilyn Monroe was very ner­vous, Tom Dooley was unmanageable, and the scene was long, but Huston got the company out of Harrah’s in a day and a half, a day and a half ahead of the esti­mated three-day shutdown, to Bill Har­rah’s vast relief."}, {"url": "https://www.imdb.com/title/tt0055184/reviews", "page_content": "10 /10\n\nWarning: Spoilers\n\nThis movie has generated a huge following in since it was made due to the acting by it's leads and directing (John Huston), but it is best known as \"the final movie\" of the stars. It was the final film for Clark Gable. Indeed, it killed Gable due to the scene where he stupidly did his own stunt of trying to restrain a wild horse. However, it was not the last film for Marilyn Monroe. She began work on a film with George Cukor which she was fired from and which was never completed. Since Monty Clift was also in it many people claim it was his last film too. Actually he made several complete films after it, including FREUD (also by John Huston). Thelma Ritter lived until 1969, and she was still making plenty of films until then. Estelle Winwood would reach her 100th year, and was still making films up to a decade before that. As for Kevin McCarthy and Eli Wallach - they are both ('bless 'em) going strong. However the final scene of the script gave a coda to Gable's and Monroe's career. This helps make the public point of view about the film understandable.\n\n\n\nIn his later years, Gable popped up in a series of films where his co-star was a leading lady of similar popular following, who was usually younger than him but his feminine sexual equivalent. These included TEACHER'S PET (with Doris Day) and IT STARTED IN NAPLES (with Sophia Loren). The film he did with Monroe (their only film together) was THE MISFITS, and it was not a comedy.\n\n\n\nTHE MISFITS was supposed to be a philosophical drama about why people can't be loners but have to find their way into some group where they are acceptable to each other. Philosophical films are very difficult ones to turn into box office gold. People go to films as an escape and rarely to feed their brains. But Marilyn's then husband (dramatist Arthur Miller) wrote the screenplay for the film. At the time the Miller-Monroe marriage was collapsing, and this may be why the screenplay seems to be lopsided. Marilyn's character \"Rosalind Taber\" seems to be flighty at points, but at other points too deep. We first see her willing to get through her divorce with Kevin McCarthy (who does a lot with his one brief scene in the film trying to stop the divorce). This shows determination - she even gives a vague reason to McCarthy that it was his fault for keeping her on the shelf while he concentrated on his career. Yet she shows a flakiness too. She tells Thelma Ritter she never wants to see an expensive car that was given to her again.\n\n\n\nThis follows her throughout the film. She is introduced to these modern cowboys through cab driver Eli Wallach (\"Guido\"), and she takes an offer from him to go up to his country house to chill out. Gable and Ritter accompany them. But soon she is showing a different personality: she is a mother-earth figure. Wallach is an ex military pilot who was married, but whose wife died in a fluke situation while pregnant (his car lacked a tire, and he could not rush her to the hospital). Marilyn tries to get to the bottom of Wallach's feelings and it is obvious that Wallach does not want to discuss this. Gable (\"Gay Langdon\") seems more settled - but we learn that daughter and son keep him at arm's length due to his tendency to carouse and get drunk. Marilyn and Gable do turn each other on, but Marilyn is upset by Gable's matter-of-fact feelings about animals like horses and rabbits.\n\n\n\nMontgomery Clift (\"Perce Howland) comes in later in the film when he joins the group headed for a rodeo. All of them have attended rodeos except Monroe. She is horrified at the injuries the cowboys get. Clift gets injured but while he and the other men accept his injuries as normal, Monroe wants to scream about them. Clift also has personal family problems: his mother remarried and the man has basically pushed Clift out of his property rights to his father's ranch. But the lack of his mother's interest in him (she is totally enthralled by the new husband) is what hurts him the most.\n\n\n\nEven the fifth wheel of this ensemble, Ritter (\"Isabelle Steers\") has a serious family problem that makes her a misfit (albeit one who has learned to accept it). Her husband left her for a best friend of her's years before, and has never paid her alimony - he sends her a potted rose once a year. At the end she leaves the film before the conclusion: she meets the husband and her best friend at the rodeo, and they go to her home to spend a few days! Ritter's character is a realist when she is not involved - she keeps warning Marilyn about cowboys and their ways - but she can be remarkably weak in defending her own rights and feelings.\n\n\n\nHow they all come to terms (or fail to come to terms) with their family and personality failures is what I leave to the viewers. It is worthwhile to watch this film to it's emotional climax (the scene with the wild horses), where Monroe's character finally gets her real voice - and Monroe achieved her acting height outside of her performance as \"Cherie\" in BUS STOP). But it is achieved at a ridiculous cost: as mentioned before Gable had to do his own stunt in that scene. The follow-up scene really shows how he was too old for it.\n\n\n\nThere is also that lovely coda: Clark and Marilyn in the pick-up truck looking at the star in the sky that Clark says is his guide. It does sort of seem an appropriate sign-off for those two movie icons."}, {"url": "https://www.irishtimes.com/culture/film/the-misfits-review-when-art-and-life-collide-1.2251619", "page_content": "The Misfits      Director : John Huston Cert : Club Genre : Drama Starring : Clark Gable, Marilyn Monroe, Montgomery Clift, Thelma Ritter, Eli Wallach Running Time : 2 hrs 15 mins\n\nRosalyn, a beautiful divorcee (Monroe) and her wise-cracking friend (Ritter) are invited to stay with an ageing cowboy (Gable) and his friend (Wallach). The men enlist the help of a rodeo-rider (Clift) so that they might round up the ‘misfit’ mustangs.\n\nIt's practically impossible to watch The Misfits without thinking of the fraught conditions that the film was made in. Film lore tells us that director John Huston was hitting the bottle throughout the production. And who could blame him?\n\nWhere to begin? Leading lady Marilyn Monroe’s marriage to Arthur Miller – who penned the screenplay as a “love-letter” – was disintegrating in a haze of medication. The shoot had to shut down for weeks while she checked into rehab. Clark Gable would have a heart attack two days after production; he died 10 days later. The temperatures in the Nevada desert frequently hit 42 degrees.\n\nMany critics were disappointed with the film on release. For all the talent attached – producer Frank E Taylor had proclaimed The Misfits as “the ultimate motion picture” – detractors criticised the film for being worthy and shallow and overly theatrical.\n\nREAD MORE\n\nStill, for all such caveats, there’s something wonderful about the picture.\n\nBolstered by incredible, career-best performances from Monroe and Gable and the meticulous photography of Russell Metty, it’s a powerful and moving viewing experience. As Monroe and Gable ride off in their truck – neither would live long enough to make another film – they seem to leave behind Hollywood cinema as we know it."}, {"url": "https://www.magnumphotos.com/arts-culture/cinema/misfits-story-shoot-inge-morath-arthur-miller/", "page_content": "John Huston’s 1961 movie, ‘The Misfits’, was to be the last completed production for two of its stars: Marilyn Monroe and Clark Gable. Gable died shortly after the film wrapped, while Monroe died in August 1962 having worked on the uncompleted movie ‘Something’s Got to Give’.\n\nScripted by Arthur Miller, a raft of Magnum photographers were hired to photograph the making of the film – among them Inge Morath and Henri Cartier-Bresson, who were the first photographers to arrive on set.\n\nAs many of the images, and indeed Morath’s remembrances, attest – the photographers and the actors enjoyed a degree of camaraderie in spite of the film’s widely reported troubled production – one aspect of which was the deteriorating marriage between Miller and Monroe that came to an end that summer.\n\nIn James Goode’s 1963 book, The Story of ‘The Misfits’ – a day-by-day account of the shoot – he hints at the friendly atmosphere the photographers and the actors shared in:\n\nAugust 1 – Monday. Still no shooting call. To pass the time, Eli Wallach has gotten himself into character clothes and makeup as Sigmund Freud, to be photographed by Inge Morath. The object is to paste the resulting photograph on an album cover as a birthday present for John Huston, whose next picture will be ‘Freud’. Eli, Inge and Dick Rowan, a Magnum representative here on location, drove out to a nearby ranch and Eli posed next to a couch in the middle of a corral, with some interested horses looking on. Eli looked frighteningly authentic.\n\nHere, ahead of the 60th anniversary of last day of the film’s shooting on location in Nevada (October 18th), we share both Miller and Morath’s personal reflections upon the film’s production and its at times troubled, yet charming stars alongside little-seen images from the production, and archival materials.\n\nYou can see more work by Magnum photographers during movie productions here, in the series, On Set .\n\nThere is a ‘The Misfits’ collection on the Magnum Shop, which can be viewed here."}, {"url": "https://www.marieclaire.com/culture/a22715141/marilyn-monroe-naked-movie-scene-the-misfits-found/", "page_content": "Though it’s been 56 years since her death, Marilyn Monroe remains one of the most iconic Hollywood stars of all time. Of course we’re still fascinated by her: She was gorgeous, talented as both a singer and an actress, and possessed a pride over her curvy figure that’s still inspiring today.\n\nThat last part is also why we still find scenes she did naked totally fascinating: At a time when women were discouraged from even acknowledging sex, Marilyn Monroe embraced her sexuality.But she may have been even more of a trailblazer than we first thought. Though she appeared nude in the first-ever issue of Playboy (albeit in photos picked up from another photographer—she didn’t actually pose for the magazine itself), it’s long believed that her first-ever nude film scene would have been in Something’s Got to Give, the uncompleted movie she was making when she passed away.\n\nNow, reports the Daily Mail, an author named Charles Custillo, while researching for his biography, Marilyn Monroe: The Private Life of a Public Icon, has discovered a heretofore unknown nude scene from the film The Misfits. In the footage, Monroe, following a love scene with costar Clark Gable, drops a bedsheet and reveals her totally naked body. Not only that, it would have been the first fully-nude scene by an American actress in a film had the movie’s director, John Huston, (dad of icon Anjelica Huston) not cut it from the final version.\n\nThe movie was written by Arthur Miller, Marilyn Monroe’s husband at the time, but the idea to drop the sheet was all Marilyn’s idea. Custillo found the footage in the home of Curtice Taylor, son of the movie’s producer Frank Taylor. According to Custillo:\n\nHe said: \"If you read [The Misfits] script… it doesn’t say anything about nudity… When she did the scene, everyone was shocked on the set. 'Huston sighed and said, \"Honey, I’ve seen them before\" Gable and others… wanted [it] to be left in. Huston didn’t… because he felt it… was totally unnecessary to the scene.\"\n\nThough the scene in question is only 45 seconds long, Taylor said he thought it made the love seen between Monroe and Gable “more passionate.” The footage had been in a locked cabinet since 1999, when his father died. It was long assumed destroyed, since most of the movie’s unused takes were disposed of by people associated with the production. Frank Taylor just happened to save this one. Wonder why...\n\n'Clark Gable and Marilyn Monroe in The Misfits.' (Image credit: Keystone-France)\n\nTBD whether the scene in question is going to be released for public consumption (it still belongs to Curtice Taylor), but the fact that would have been the first nude scene by an American actress gives it a lot of historical importance. Plus, you know, it's a nude scene of Marilyn Monroe."}, {"url": "https://letterboxd.com/film/the-misfits/", "page_content": "“The Misfits” is a film so utterly despondent; it could only have been made by the truly lost at heart.\n\nJohn Huston’s “Misfits” was long ago eclipsed in artistic merit by its widespread infamy. The final completed film of Marilyn Monroe and Clark Gable; Huston himself was also consistently drunk and/or gambling while on location, and costar Montgomery Clift would suffer an untimely early death within five years of the movie’s release.\n\nIt’s hard, then, to view “Misfits” for its original intent; a Valentine to Monroe from Arthur Miller. It’s unfortunate, because Miller’s script is among his best writings, and Monroe gave her greatest acting performance in the film... even while she was in and out of rehab, and her…"}, {"url": "https://cinephiliabeyond.org/john-hustons-the-misfits/", "page_content": "John Huston’s The Misfits is a studious, daring vision of American life depicting the same type of protagonists that always appealed to the great filmmaker—people who could be easily called losers, but whose streak of idealism and hopefulness, in the midst of their isolating displacement, makes them attractive and quite easily relatable for the audience. The status of this 1961 drama gained an additional burst by the fact that it was the last film Clark Gable and Marilyn Monroe ever worked on, but its value hardly lies in trivialities like this. The main strengths of Huston’s celebrated film can be found in superb acting by Monroe, Gable, Montgomery Clift and Thelma Ritter, as well as Arthur Miller’s genuinely inspired script and director of photography Russell Metty’s astonishing black-and-white visuals. In its production phase, the film basically had to go through hell.\n\nOne of the myths attached to The Misfits was that Gable died of a heart attack because of over-exertion on this film. This is utter nonsense. Toward the end of the picture there was a contest between Clark and the stallion the cowboys had captured. It looked like rough work, and it was, but it was the stunt men who were thrown around, not Clark. —John Huston\n\n\n\nFilmed in northern Nevada’s unbearable heat, The Misfits proved to be the perfect arena for the crew’s battle with their inner demons. John Huston drank a lot back in those days, allegedly falling asleep during filming; Marilyn Monroe and writer Arthur Miller’s marriage was at the point of a devastating collapse, so she completely gave herself away to alcohol and drugs. But the fact is that what the crew delivered in The Misfits is perhaps some of the greatest moments of their entire careers. The flash of the film’s stellar cast, however, didn’t distract the critics, who noted and deservedly praised Huston’s approach as a new take on the western genre. Courageous and thought-out, brilliantly acted and written, The Misfits stands tall as a pearl of the sixties which isn’t going to fade into public oblivion any time soon.\n\nI have a sense that we are all moving into one of those rare productions when everything touched becomes alive. —Arthur Miller\n\n\n\nDear every screenwriter/filmmaker, read Arthur Miller’s screenplay for The Misfits [PDF]. (NOTE: For educational and research purposes only). The DVD/Blu-ray of the film is available at Amazon and other online retailers. Absolutely our highest recommendation.\n\nLoading...\n\n\n\nThis documentary for the PBS series Great Performances chronicles the chaos in making of what its producer, Frank Taylor, dubbed “the ultimate motion picture,” The Misfits. Features photographs from the Magnum Agency, which was given exclusive behind-the-scenes access to the filming.\n\n\n\nOpen YouTube video\n\nPhotographer Elliott Erwitt is interviewed about his famous photos of Marilyn Monroe, Clark Gable, Montgomery Clift, Arthur Miller and others from the cast of The Misfits together in the one shoot.\n\n\n\nOpen YouTube video\n\nWritten and directed by Claudio Masenza, who had previously documented the lives of Marlon Brando and James Dean, and featuring an impressive interview cast, this was an incredible find. As Masenza retraces Montgomery Clift’s life, from his toddler years, through to his Hollywood years beginning with The Search (1947) and ending with The Defector (1966), we get some very rare insights into the life of this enigmatic actor with previously unseen home footage shot by family, friends and Clift himself. What we also learn about him is that he was something of a daredevil, a kind soul and a sensitive man, one who couldn’t bear the thought of others suffering. We also hear from his friends how his personality would change at the blink of an eye, either when he drank or when the mood would hit him. Hollywood Rebels: Montgomery Clift (1983) dwells heavily on this side of him, as most biographies on Clift do. It’s a great documentary for anyone who is a fan of this remarkable and talented actor. —The films of Montgomery Clift\n\n\n\nOpen YouTube video\n\nAt his best, Montgomery Clift was a better actor than Marlon Brando. For such a small, slightly-built man Clift had an intensity and depth to his performance that could eclipse Brando—even with all that actor’s realistic improvisations, impressive physicality and “naturalistic body language.” —Better than Brando, more tragic than James Dean\n\n\n\nOpen Vimeo video\n\nOn location during the filming of The Misfits, Nevada, Reno, 1960. Photo credits: Eve Arnold & Erich Hartmann/Magnum Photos.\n\n\n\nGet Cinephilia & Beyond in your inbox by signing in\n\nSpread the love\n\n[newsletter]"}, {"url": "https://www.academymuseum.org/en/programs/detail/the-misfits-with-call-it-murder-018416a8-12b4-4a3e-d2f8-b224cdfd6e06", "page_content": "The Misfits | North American Restoration Premiere\n\nPenned by Arthur Miller, this John Huston film centers on the recently divorced Roslyn (Marilyn Monroe) and her relationship with an aging former cowboy, Gay (Clark Gable), who now survives by rounding up wild mustangs to sell them to the slaughterhouse. Although considered a commercial failure at the time of its original release, the film has since been regarded as a classic by critics and audiences, perhaps notably because it was the final completed film of both Gable and Monroe. The film was restored in 4K from the 35mm original picture negative.\n\nNote by Academy Film Archive Short Film Preservationist Tessa Idlewine.\n\nDIRECTED BY: John Huston. WRITTEN BY: Arthur Miller. WITH: Clark Gable, Marilyn Monroe, Montgomery Clift. 1961. 125 min. USA. Color. English. DCP. Restored in 2018 by the Academy Film Archive and The Film Foundation. Restoration funding provided by the Hobson/Lucas Family Foundation.\n\n\n\nCall It Murder | Los Angeles Restoration Premiere\n\nOriginally released as Midnight—just a few short months before the crackdown of the Production Code—with Humphrey Bogart cast as a secondary character, the film was reissued in 1949 as Call It Murder, with Bogart given top billing after he had risen to stardom. Even in this lesser role, Bogart’s performance is impressive as a charismatic grifter who romances the daughter of the jury’s foreman at a sensational trial they both attend. Call It Murder is a psychological drama that examines concepts of justice and truth in relation to capital punishment, directed by Broadway director-producer Chester Erskine for his film debut.\n\nNote by Academy Film Archive Preservation Archivist Brianna Toth.\n\nDIRECTED BY: Chester Erskine. WITH: Humphrey Bogart, Sidney Fox, Henry Hull, O. P. Heggie, Richard Whorf. 1934. 74 min. USA. B&W. English. DCP. Restoration by the Academy Film Archive and Blackhawk Films with funding from the estate of David Shepard from a 35mm nitrate duplicate negative and 35mm nitrate fine grain in the Lobster Films collection."}, {"url": "https://www.hollywoodinsider.com/the-misfits-marilyn-monroe/", "page_content": "Photo: Marilyn Monroe\n\nAn All-Star Cast and a Recipe for Disaster\n\nWe have to talk about John Huston. The Golden Age of Hollywood saw a deluge of filmmakers who are now almost regarded as gods, such as Orson Welles and Billy Wilder, but few can claim to be even as remotely chaotic as John Huston, who had made his feature debut in 1941 and would continue until his death in 1987. Huston was, in a sense, the sort of hypermasculine auteur modern movie buffs would have an uneasy relationship with, from his famously gruff voice to his devil-may-care attitude to making his movies; in reality, he was a Hemingway-esque figure, a man so brimming with masculine energy that he threatened to implode.\n\nNot unlike how Ernest Hemingway’s writings were conjoined inexplicably with the man’s chronic battles with physical injuries and mental illness, Huston’s films often gave us insight into a violent flame that stood on the brink of being snuffed out, and as such, there is a kind of emotional honesty and brutality to Huston’s work. Reading about the production behind a Huston film can, at times, be just as enthralling as watching the film itself.\n\nThings to do:\n\nWhen ‘The Misfits’ hit American theaters in February 1961, Huston had been in the business for twenty years, having won two Oscars for his troubles (for ‘The Treasure of the Sierra Madre’), and he already had an impressive list of behind-the-scenes stories behind him. We don’t need to get into how everyone on the set of ‘The African Queen’ was miserable (when not physically ill), or how Huston’s adaptation of Moby Dick ran the gamut from the expensive whale model getting lost at sea to Huston and screenwriter Ray Bradbury (yes, that Ray Bradbury) butting heads.\n\nOf all these, though, none are as purely tragic as the story behind ‘The Misfits,’ the film that would prove to skeptics that Marilyn Monroe was a real actress — and which would end up featuring her final performance. True, Monroe was working on ‘Something’s Got to Give’ at the time of her death, but the film went unfinished, and so ‘The Misfits’ stood as her last will and testament. Not only that, but on paper, the cast and crew — no, the sheer hurricane of talent being funneled into ‘The Misfits’ should have made the film a dream, both in front of and behind the camera; instead, it proved to be a breaking point for some of the people involved.\n\nHuston had already collaborated with Ray Bradbury, one of America’s literary heavyweights, and for ‘The Misfits’ he would continue that streak — this time with Pulitzer Prize-winner Arthur Miller, who also happened to be married to Marilyn Monroe at the time. Miller adapted one of his own short stories, also titled ‘The Misfits,’ for the film, with his wife as the heroine in mind. Alongside Monroe were Clark Gable, most famous as the male lead in ‘Gone with the Wind,’ Eli Wallach, who would later become most famous as the anti-hero Tuco in ‘The Good, the Bad and the Ugly,’ and Montgomery Clift, a young star whose career was derailing due to a car accident in 1956.\n\nRelated video: Full Commentary – Cast & Crew Spills Secrets on Making of ‘Elvis’ | In-Depth Scoop | Austin Butler\n\nRelated video: Full Rendezvous At the Premiere of ‘Elvis’ with Reactions from Stars | Austin Butler, Baz Luhrmann\n\nRelated video: Come Behind The Scenes of ‘Elvis’ | Austin Butler, Tom Hanks and Baz Luhrmann\n\nRelated article: MUST WATCH – The Hollywood Insider’s CEO Pritan Ambroase’s Love Letter to Black Lives Matter – VIDEO\n\nRelated article: Why Queen Elizabeth II Is One Of The Greatest Monarchs | Her Majesty Queen Elizabeth II of United Queendom of Great Britain & Northern Ireland (Video Insight)\n\nRelated article: All Best Actor/Actress Speeches From The Beginning Of Oscars 1929-2019 | Hollywood Insider\n\nOf the four stars, only Wallach would make it past 60: Monroe died in 1962, at the age of 36, Clift would die in 1966 at the age of 45, and Gable died mere days after filming for ‘The Misfits’ had wrapped. The film was released on February 1, on what would have been Gable’s 60th birthday. On the set, drug problems plagued Monroe and Clift, and Monroe had things doubly bad, on account of the fact that her marriage to Miller was eroding; by the time the movie hit theaters, the two had parted ways.\n\nThe Short Unhappy Life of Marilyn Monroe\n\nThere is an alternate timeline, not too different from ours, where Marilyn Monroe had a long and successful career as a film actress; alas, Monroe’s acting career had a number of false starts, and she died young. Born in 1926, Monroe started taking roles when she was barely out of her teens, appearing in B-movie schlock that has long since been forgotten before landing minor roles in Joseph L. Mankiewicz’s ‘All About Eve’ and Huston’s own ‘The Asphalt Jungle,’ both in 1950, both also being held as classics. Still, it would take a few more years for Monroe to land a lead role of any significance, with ‘Gentlemen Prefer Blondes’ in 1953, directed by Howard Hawks and co-starring Jane Russell, and this cemented her status as a sex symbol of the 1950s — for better and worse.\n\nIn her short career, Monroe managed to work with such astounding Golden Age directors as Hawks, Mankiewicz, Huston, and even Billy Wilder, yet despite all these projects, she struggled to be taken seriously as an actress; for all her fame, she died without getting even one Oscar nomination. Being pigeonholed as a promiscuous empty-headed blonde when in reality she was anything but (not helped by the fact that she was a three-time divorcee by the end of it all, at a time when divorce was a taboo subject), Monroe had her beauty turned against her. ‘The Misfits’ was set to be the one, the role that would make Monroe’s career, and how could she fail? She had Huston, who had previously worked with her, and she had her then-husband writing her lines. What could go wrong?\n\nRelated article: The Hollywood Insider’s CEO Pritan Ambroase: “The Importance of Venice Film Festival as the Protector of Cinema”\n\nRelated article: The Masters of Cinema Archives: The Hollywood Insider Pays Tribute to ‘La Vie En Rose’, Exclusive Interview with Director Olivier Dahan\n\nRelated article: – Want GUARANTEED SUCCESS? Remove these ten words from your vocabulary| Transform your life INSTANTLY\n\nRelated Video: Full Commentary on ‘Top Gun: Maverick’: Tom Cruise, Val Kilmer, Jennifer Connelly, Miles Teller\n\nRelated video: ‘Top Gun: Maverick’ Full Premiere Reactions: Tom Cruise, Val Kilmer, Jennifer Connelly, Miles Teller\n\nRelated video: EVOLUTION: Every Tom Cruise Role From 1981 to 2021, All Performances Exceptionally Poignant\n\nFor one thing, Huston was being his usual unprofessional self, even running production over-budget and nearly having the film shut down due to his immense gambling losses. For another, it turns out that having the screenwriter and the leading lady be in a relationship may not be the best idea; not only did Miller keep revising his screenplay mid-production, but Monroe resented her character being modeled after herself. The movie follows a young divorcee and former nightclub dancer (hmmm) who moves to Reno, striking up a friendship and business partnership with an aging cowboy (Gable) and his volatile WWII veteran friend (Wallach), as the three try to make it in the Nevada desert.\n\nThe film, by the way, was actually shot in the Nevada desert, in scorching heat, which probably didn’t help matters. Curiously, despite on-set tensions with Huston and Miller, Monroe befriended a scarred and drug-addled Montgomery Clift, and the surprisingly platonic friendship between their characters on-screen hints at a genuine off-screen friendship between kindred spirits. As said before, Monroe and Clift suffered from drug addiction during production — battles they would eventually lose, and it must also be said that despite these personal troubles, they both carried through on-screen wonderfully. Indeed, Monroe’s performance in ‘The Misfits’ could be her very best; she exudes a tragic femininity trying to transcend itself in spite of all the men in her life disappointing her.\n\nRelated article: A Tribute to Johnny Depp: The Actor and Musician Who Defined Range\n\nRelated video: EVOLUTION: Every Johnny Depp Role From 1984 to 2020, All Performances Exceptionally Poignant\n\nRelated article: A Tribute to the Hero & President Volodymyr Zelenskyy: Comedian/Actor, Ukraine’s President and Heroic Leader\n\nA Swan Song for Hollywood’s Golden Age\n\nIn 1961, Hollywood’s Golden Age was coming to an end, although this would not have been apparent to most people yet. As far as moviegoers and filmmakers were concerned, 1961 was part of the 1950s, in spirit if not literally; after all, one of the highest-grossing films of 1960 was Stanley Kubrick’s sword-and-sandals epic ‘Spartacus,’ a movie that would almost surely not have done as well if released a decade later. Regardless, the Golden Age was in its twilight years — a twilight that would then turn pitch black with the financial disaster that was Joseph L. Mankiewicz’s ‘Cleopatra’ in 1963. ‘The Misfits’ starred three Golden Age legends, all of whom were at the ends of their careers, being the last rodeo for Monroe and Gable in particular.\n\nIt would also be the last time Huston would put 100% of himself into his filmmaking for at least a decade, afterward directing a string of forgettable or regrettable features until the critical hit of ‘Fat City’ in 1972, at which point he had virtually reinvented himself. ‘The Misfits’ also occupies an interesting space as a Western that doesn’t fit into the classic Western mode (no gunfights, no saloon brawls, no villain in a black suit) while also not quite anticipating the transformation the Western would experience in the coming years. As such, ‘The Misfits’ stands, perhaps better than any other movie, as a line in the sand, between the Golden Age Hollywood production and the grittier, more socially conscious New Hollywood productions that were to emerge in the 1960s.\n\nRelated article: EVOLUTION: Every Henry Cavill Role From 2001 to 2021, All Performances Exceptionally Poignant\n\nRelated article: EVOLUTION: Every Chris Evans Role From 1997 to 2020, All Performances Exceptionally Poignant\n\nRelated article: #metoo Revolution: Powerful Questions That Need Answers\n\nRelated article: FACT-CHECKED Series: Timothee Chalamet and 32 Facts about The Young Superstar\n\nDespite its making being a torture for those involved, and despite its initial reception being underwhelming, ‘The Misfits’ comes out as a triumph. Not only are the four leads incredible, with all of them embodying complex and troubled characters with disturbing ease, but you probably wouldn’t think Miller had kept fiddling with the screenplay during shooting, since while the structure is not a strict three-act one that we would expect, it gives plenty of air to breathe for the characters. The vast Nevada landscape is gorgeous, and there are some bird’s-eye-view shots that are pretty remarkable for the time, with Huston proving once again that he could make great movies — in spite of himself. Most importantly, ‘The Misfits’ might be the strongest argument in favor of Monroe’s potential as an actress, giving a dexterous performance that is at once tender and overflowing with emotion — the kind of performance any actor would be proud of. Hollywood was about to go through some serious changes, and in so doing would leave Monroe, Clift, and the others behind, but with the gift of hindsight, we can now appreciate a masterpiece for what it is.\n\nSadly, ‘The Misfits’ is not currently available to stream anywhere, but it is available to rent digitally. The movie itself is certainly worth a few dollars and your time.\n\nBest of luck to Ana de Armas playing Marilyn Monroe in ‘Blonde’.\n\nBy Brian Collins\n\nClick here to read The Hollywood Insider’s CEO Pritan Ambroase’s love letter to Cinema, TV and Media. An excerpt from the love letter: The Hollywood Insider’s CEO/editor-in-chief Pritan Ambroase affirms, “We have the space and time for all your stories, no matter who/what/where you are. Media/Cinema/TV have a responsibility to better the world and The Hollywood Insider will continue to do so. Talent, diversity and authenticity matter in Cinema/TV, media and storytelling. In fact, I reckon that we should announce “talent-diversity-authenticity-storytelling-Cinema-Oscars-Academy-Awards” as synonyms of each other. We show respect to talent and stories regardless of their skin color, race, gender, sexuality, religion, nationality, etc., thus allowing authenticity into this system just by something as simple as accepting and showing respect to the human species’ factual diversity. We become greater just by respecting and appreciating talent in all its shapes, sizes, and forms. Award winners, which includes nominees, must be chosen on the greatness of their talent ALONE.\n\nI am sure I am speaking for a multitude of Cinema lovers all over the world when I speak of the following sentiments that this medium of art has blessed me with. Cinema taught me about our world, at times in English and at times through the beautiful one-inch bar of subtitles. I learned from the stories in the global movies that we are all alike across all borders. Remember that one of the best symbols of many great civilizations and their prosperity has been the art they have left behind. This art can be in the form of paintings, sculptures, architecture, writings, inventions, etc. For our modern society, Cinema happens to be one of them. Cinema is more than just a form of entertainment, it is an integral part of society. I love the world uniting, be it for Cinema, TV, media, art, fashion, sport, etc. Please keep this going full speed.”\n\nMore Interesting Stories From The Hollywood Insider\n\n– Want GUARANTEED SUCCESS? Remove these ten words from your vocabulary| Transform your life INSTANTLY\n\n– A Tribute to Martin Scorsese: A Complete Analysis of the Life and Career of the Man Who Lives and Breathes Cinema\n\n– Do you know the hidden messages in ‘Call Me By Your Name’? Find out behind the scenes facts in the full commentary and In-depth analysis of the cinematic masterpiece\n\n– A Tribute To The Academy Awards: All Best Actor/Actress Speeches From The Beginning Of Oscars 1929-2019 | From Rami Malek, Leonardo DiCaprio To Denzel Washington, Halle Berry & Beyond | From Olivia Colman, Meryl Streep To Bette Davis & Beyond\n\n– In the 32nd Year Of His Career, Keanu Reeves’ Face Continues To Reign After Launching Movies Earning Over $4.3 Billion In Total – “John Wick”, “Toy Story 4”, “Matrix”, And Many More\n\nMarilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe"}], "Carol Huston starred alongside Clark Gable and Marilyn Monroe in The Misfits.": [{"url": "https://www.bfi.org.uk/features/film-fate-helped-make-classic-misfits", "page_content": "The Misfits (1961)\n\nWhat makes a film a classic?\n\nIs it the direction, the story and script, the choice of cast, the acting, the camerawork, editing or production design?\n\nIn the end, classic status can be the result of pretty much anything… including, I suspect, accidental or unintended factors. Making a movie is usually an expensive process involving extensive and meticulous planning. But however much one may try to minimise the role played by chance – by shooting, for instance, in a studio with a small cast and crew – one can never eradicate it altogether. Serendipity will always have an effect, which is why a producer or director will often feel relatively chuffed if a movie turns out to be 40 or 50 per cent of what they were aiming for.\n\nGet the latest from the BFI Sign up for BFI news, features, videos and podcasts. Email Sign up\n\nIt’s also why a film can end up terrific despite the odds. Take, for example, John Huston’s The Misfits (1961), starring Marilyn Monroe, Clark Gable and Montgomery Clift. Now, before you say, “Well, of course it was always going to be great with that cast, that director, and that writer on board,” let’s bear a few things in mind. Okay, Arthur Miller, then America’s most respected playwright, wrote the film as ‘a valentine’ for his wife Monroe. But remember that he had next to no experience as a writer for the screen, that the marriage was on the rocks (they divorced shortly before the film’s premiere in early 1961), and Monroe was in many ways a wreck, dependent on alcohol and prescription drugs, having difficulties with remembering her lines and turning up on time at the set. Director John Huston was often drunk, and apparently not averse to falling asleep on set. He would often display more interest in gambling than in the job at hand.\n\nThe Misfits (1961)\n\nThen there were the two male leads. The success of Clark Gable – a Hollywood star par excellence – had always rested rather more on his rugged masculinity, good looks and easy charm than on any particular range, depth or subtlety as an actor. Moreover, the postwar years had not been good for him, and even he regarded many of the roles offered by MGM as unsatisfactory.\n\nAs for Montgomery Clift, yes, he had been a performer of a different order, and for a decade he was undoubtedly one of the finest actors in Hollywood; but after his car accident in 1956, his health went downhill in all kinds of ways, and it tended to show on screen.\n\nIn other words, despite the big names, The Misfits didn’t have too much going for it. Eli Wallach, Thelma Ritter and Kevin McCarthy were around to provide excellent support for the three stars, and few cinematographers could rival Russell Metty, whose CV included visual gems like Bringing Up Baby (1938), Touch of Evil (1958), Spartacus (1960) and a whole host of eye-catching Douglas Sirk titles. But a film usually needs a little more than superior camerawork and fine actors in minor roles to ensure its role as a classic.\n\nThe Misfits (1961)\n\nIndeed, just as the initial omens were not promising, so the film’s release – it barely broke even – didn’t suggest that it would in time become regarded as an important movie for all concerned and something we’d still be watching more than half a century later.\n\nSerendipity played its part in The Misfits’ long-term status, and not only because Gable, Monroe and Clift, notwithstanding the problematic shoot, ended up giving memorably fine performances. As it happened, it turned out to be the last completed film for both Gable (who died just 10 days after filming finished) and Monroe (who lived on for another year and a half). For his part, Clift had only two further major roles before his own demise in 1966.\n\nThe film’s consequent association with premature death (though Gable, admittedly, was, at 59, no spring chicken) and the kind of celebrity worship which that can provoke hasn’t harmed its reputation one bit. But I’d suggest there’s more to the film’s enduring value than that kind of slightly morbid cult interest.\n\nThe Misfits (1961)\n\nAlongside the heartfelt performances, The Misfits is memorable for the way Metty’s black-and-white cinematography creates taut, fraught, resonant relationships between the characters (and between humans and horses) in the Nevada desert. But perhaps most rewarding of all is how the almost palpable atmosphere of pain, disappointment and ubiquitous mortality reinforces, complicates and enriches the script’s sometimes trite conception of damaged masculine souls (the ranchers and rodeo-riders played by Gable, Clift and Wallach) redeemed by their encounter with a woman (Monroe’s divorcee Roslyn). Roslyn is essentially presented as a life-force corrective to their apparent indifference regarding the suffering of all the gentle, innocent and beautiful creatures on this earth.\n\nDue to their various personal circumstances, Gable, Clift and Monroe come across as fragile, vulnerable, indecisive and not quite sure where they’re headed or why. That rather muddies Miller’s ‘message’ (which was probably inspired by his own feelings about and experiences with Monroe), which is no bad thing. For all the (strikingly staged and shot) struggles with stallions and so on, the film consequently feels less like some sort of poetic fable about primal forces, and more like something recognisably human in scale and nature.\n\nThe Misfits (1961)\n\nMisfits? Hardly. Aren’t these folks actually just like the rest of us, trying to get by while turning a blind eye to the inevitable? Huston may have been stewed a lot of the time during shooting, but the film has more in common with his very finest works – The Asphalt Jungle (1950), Fat City (1972) and The Dead (1987) – than might at first be apparent. In his book The American Cinema, critic Andrew Sarris famously included Huston in the ‘Less than Meets the Eye’ category of directors. I’d venture to suggest that with The Misfits, thanks in no small part to serendipity, the contrary might be the case."}, {"url": "https://www.britannica.com/topic/The-Misfits", "page_content": "The Misfits, American film drama, released in 1961, that is perhaps best remembered as the final movie of screen legends Marilyn Monroe and Clark Gable.\n\nThe Misfits, directed by John Huston, is a contemporary tale of the West that centres on aging cowboys. Out of their element in the modern world, they now herd wild “misfit” horses from their trucks and sell them to be killed and cheaply sold as pet food. Monroe played a troubled ex-stripper who falls in love with Gable’s cowboy character but is appalled at the capture and fate of these once-free animals. The parallel in the plot is thinly disguised: the hopeless plight of the horses mirrors that of their captors.\n\nBritannica Quiz Oscar-Worthy Movie Trivia\n\nPlaywright Arthur Miller wrote the script specifically for Monroe, his wife, though their marriage would disintegrate during production of the film. The publicity surrounding The Misfits centred on Monroe’s real-life problems, unreliable work habits, and temper tantrums. Gable died about a week after the film was finished, and within a year of its release Monroe was dead from a drug overdose. Costar Montgomery Clift made only three films after The Misfits, dying in 1966 at age 45. The scenes depicting the roundup of wild horses are particularly well staged, and Gable’s insistence on doing many of his own stunts might have contributed to the heart attack that killed him."}, {"url": "https://www.imdb.com/title/tt0055184/reviews", "page_content": "10 /10\n\nWarning: Spoilers\n\nThis movie has generated a huge following in since it was made due to the acting by it's leads and directing (John Huston), but it is best known as \"the final movie\" of the stars. It was the final film for Clark Gable. Indeed, it killed Gable due to the scene where he stupidly did his own stunt of trying to restrain a wild horse. However, it was not the last film for Marilyn Monroe. She began work on a film with George Cukor which she was fired from and which was never completed. Since Monty Clift was also in it many people claim it was his last film too. Actually he made several complete films after it, including FREUD (also by John Huston). Thelma Ritter lived until 1969, and she was still making plenty of films until then. Estelle Winwood would reach her 100th year, and was still making films up to a decade before that. As for Kevin McCarthy and Eli Wallach - they are both ('bless 'em) going strong. However the final scene of the script gave a coda to Gable's and Monroe's career. This helps make the public point of view about the film understandable.\n\n\n\nIn his later years, Gable popped up in a series of films where his co-star was a leading lady of similar popular following, who was usually younger than him but his feminine sexual equivalent. These included TEACHER'S PET (with Doris Day) and IT STARTED IN NAPLES (with Sophia Loren). The film he did with Monroe (their only film together) was THE MISFITS, and it was not a comedy.\n\n\n\nTHE MISFITS was supposed to be a philosophical drama about why people can't be loners but have to find their way into some group where they are acceptable to each other. Philosophical films are very difficult ones to turn into box office gold. People go to films as an escape and rarely to feed their brains. But Marilyn's then husband (dramatist Arthur Miller) wrote the screenplay for the film. At the time the Miller-Monroe marriage was collapsing, and this may be why the screenplay seems to be lopsided. Marilyn's character \"Rosalind Taber\" seems to be flighty at points, but at other points too deep. We first see her willing to get through her divorce with Kevin McCarthy (who does a lot with his one brief scene in the film trying to stop the divorce). This shows determination - she even gives a vague reason to McCarthy that it was his fault for keeping her on the shelf while he concentrated on his career. Yet she shows a flakiness too. She tells Thelma Ritter she never wants to see an expensive car that was given to her again.\n\n\n\nThis follows her throughout the film. She is introduced to these modern cowboys through cab driver Eli Wallach (\"Guido\"), and she takes an offer from him to go up to his country house to chill out. Gable and Ritter accompany them. But soon she is showing a different personality: she is a mother-earth figure. Wallach is an ex military pilot who was married, but whose wife died in a fluke situation while pregnant (his car lacked a tire, and he could not rush her to the hospital). Marilyn tries to get to the bottom of Wallach's feelings and it is obvious that Wallach does not want to discuss this. Gable (\"Gay Langdon\") seems more settled - but we learn that daughter and son keep him at arm's length due to his tendency to carouse and get drunk. Marilyn and Gable do turn each other on, but Marilyn is upset by Gable's matter-of-fact feelings about animals like horses and rabbits.\n\n\n\nMontgomery Clift (\"Perce Howland) comes in later in the film when he joins the group headed for a rodeo. All of them have attended rodeos except Monroe. She is horrified at the injuries the cowboys get. Clift gets injured but while he and the other men accept his injuries as normal, Monroe wants to scream about them. Clift also has personal family problems: his mother remarried and the man has basically pushed Clift out of his property rights to his father's ranch. But the lack of his mother's interest in him (she is totally enthralled by the new husband) is what hurts him the most.\n\n\n\nEven the fifth wheel of this ensemble, Ritter (\"Isabelle Steers\") has a serious family problem that makes her a misfit (albeit one who has learned to accept it). Her husband left her for a best friend of her's years before, and has never paid her alimony - he sends her a potted rose once a year. At the end she leaves the film before the conclusion: she meets the husband and her best friend at the rodeo, and they go to her home to spend a few days! Ritter's character is a realist when she is not involved - she keeps warning Marilyn about cowboys and their ways - but she can be remarkably weak in defending her own rights and feelings.\n\n\n\nHow they all come to terms (or fail to come to terms) with their family and personality failures is what I leave to the viewers. It is worthwhile to watch this film to it's emotional climax (the scene with the wild horses), where Monroe's character finally gets her real voice - and Monroe achieved her acting height outside of her performance as \"Cherie\" in BUS STOP). But it is achieved at a ridiculous cost: as mentioned before Gable had to do his own stunt in that scene. The follow-up scene really shows how he was too old for it.\n\n\n\nThere is also that lovely coda: Clark and Marilyn in the pick-up truck looking at the star in the sky that Clark says is his guide. It does sort of seem an appropriate sign-off for those two movie icons."}, {"url": "https://nevadamagazine.com/issue/spring-2021/16977/", "page_content": "When John Huston, Clark Gable, and Marilyn Monroe came to Reno to make a movie ‘about a world in change,’ the whole town got into the act.\n\nBY JOHN GOODE\n\nThis story originally appeared in the November/December 1986 issue of Nevada Magazine.\n\nTwenty-five years ago eager movie buffs filled theaters across the country for the debut of “The Misfits.” Shot entirely on location in and around Reno, the movie had all the makings of a blockbuster. Directed by John Huston and written by Arthur Miller, it starred Clark Gable and Marilyn Monroe, with Eli Wallach, Thelma Ritter, and Mont­gomery Cliff sharing the bill.\n\nBut movie-goers expecting a shoot ’em up Gable western or a sexy Monroe comedy were disappointed. Although some critics gave it four stars, others panned it. Still, it remains a classic.\n\nThe story was based on Nevada reality. In 1956 Miller, seeking a divorce, spent his six weeks’ resid­ency in a cabin near Pyramid Lake. While there he met three Nevada mustangers who impressed him as being “the last three unreconstructed originals in the United States.”\n\nSo begins author James Goode in “The Making of The Misfits.” First printed in 1963 and repub­lished this year, the book is a day-by-day account of the movie’s production, which brought some of film­dom’s best known figures to the Nevada desert. Here Goode describes the arrival of the Hollywood misfits.\n\nJULY 18, 1960 — This morning, at nine o’clock, “The Misfits” company, directed by John Huston, began shooting a series of random Reno scenes devised by Arthur Miller to alternate with the title and credits and establish the setting of the picture. These title shots, made without the principal actors, might have been photographed at any time, but the plan is to shoot in strict script sequence throughout, to enable the actors to stay in the context of meaning as the intricate play unfolds; the day’s shooting also serves to bring the crew together as a unit under Huston. The crew itself was incredibly swift, set­ting up camera, lights, and sound within 15 minutes at each new location and strik­ing in the same time, loading and unload­ing three large trucks of gear at each stop in 104-degree temperature, providing power for the heavy lights from a large gasoline generator.\n\nThe scenes appear to be an unrehearsed look at Reno but are not in fact. For one short sequence, showing a wedding dress revolving in the Virginia Street window of Joseph Magnin, the second assistant direc­tor, Carl Beringer, found aging Freddy Parker in a Commercial Row saloon, saw him as a perfect cinematic drunk, and took him back to the waiting camera. It was no good because Parker, off a bar stool, froze into unrewarding poses. Beringer found it necessary to spend $20 on whiskey before Parker could freely implement Huston’s idea, to whirl drunkenly in balletic parody of the revolving wedding dress.\n\nThe camera moved on to a pawnshop window, created by art director Steve Grimes, which displayed a sad collection of useless male artifacts traded in for another chance on the unremitting Reno slots; then to the slot machines themselves, anthropomorphic cast iron or carved wood replicas of western badmen, with the usual long chrome lever in place of one arm, each with plaster eyes more evil than the last. This surrealistic touch was fol­lowed by a look at long rows of the stand­ard slot machines and crap tables in action in the gambling clubs, in Arthur Miller’s words “a sea of cold chrome.”\n\nThe title shots ended with a bride and groom being escorted by Reno Junior Chamber of Commerce-types in western dress into a “Black Mariah” with accompa­nying gunfire, and driven under the Vir­ginia Street neon sign, RENO, THE BIGGEST LITTLE CITY IN THE WORLD. The bride closed the sequence by returning to her job as a blackjack dealer in the Mapes Hotel casino, still in her white wedding gown, the veil in place. The groom, Walter Ramage, returned to his office. Huston, in the first of a long series of appearances in the casino, celebrated the end of the first day’s shooting by winning $175.\n\nJuly 20 — Today’s shooting call, listing the cast and crew needed for the day and posted in the Mapes Hotel lobby, was for 8 a.m., an hour earlier than usual. The rea­son was a scene showing Clark Gable, as Gay Langland, saying good-by to a St. Louis divorcee at the Southern Pacific train station in the center of town. One of the first scenes in the picture, it called for the lady to board the train and wave good­by as the train pulled out. Since the cost of a special train would have been prohibi­tive, even if one had been available, it was necessary to use the Overland Limited heading west from Chicago to San Fran­cisco, holding it for a few minutes longer than usual. A train heading east might have been more accurate, but there were none during daylight hours.\n\nPlaying opposite Gable in this brief scene was blonde Marietta Tree, socialite and friend of John Huston, and most fa­mous for the Democratic political salon that she runs in her upper-Eastside man­sion in New York. Mrs. Tree had not intended to appear in the picture, but had simply stopped off to see Huston on her way to San Francisco. The day before, Huston had interviewed a local actress who was to play the part of the departing St. Louis divorcee, and had decided against using her. Gable, Huston, and Mrs. Tree were talking later at lunch when Gable suddenly said, “Why don’t we have that one over there?” meaning that Mrs. Tree could very well play the part. Mrs. Tree protested, saying that she wasn’t an actress, and not the type. Gable replied that she was just the type he wanted.\n\nAs the train pulled in at 8:25, discharging passengers, Gable and Mrs. Tree began the farewell scene, establishing Gay Langland’s character as a Reno cowboy who has had frequent affairs with women in town for divorce actions, and also as a man who can’t be bought and who refuses to be tied down. Mrs. Tree, as Susan, said, “Will you think about it? It’s the second largest laundry in St. Louis!” Gay replied, “I wouldn’t want to kid you, Susan. I ain’t cut out for business …. ”\n\nMrs. Tree, as Susan, was crying as she boarded the train and waved good-by from a window as the train pulled out of the station. She said later that she was scared silly about the moving train; knowing Huston’s elaborate practical jokes, she feared that he had given the engineer instructions to keep right on going to San Francisco. But the train stopped after a few feet and backed up into position again for an additional shot. In this one, Guido (Eli Wallach), a garage mechanic, pulling up to a lowered signal at the track, sees Gay and invites him over to Harrah’s for a drink.\n\nCompleting the shot, with tiny micro­phones on sticks at ground level and inside Gable’s shirt, the crew struck the lights and moved on to the next location, a two­-story frame house belonging to the Reno USO and chosen by Steve Grimes as a likely boardinghouse for Roslyn (Marilyn Monroe) and her friend Isabelle (Thelma Ritter). Monroe had not yet arrived in Reno, but she wasn’t required for the first shots at the USO.\n\nThe script called for the arrival of Guido in his garage truck to appraise Roslyn’s new Cadillac convertible, a present from her husband in Chicago. Roslyn, it seems, would like to dispose of both the Cadillac and the husband. Isabelle says in the script that Reno men keep running into Roslyn’s Cadillac just to start conversations, so it was necessary to pound dents into the body of the new car with a sledge hammer. The usual crowd of Reno onlookers winced with each blow, but the crew itself was calm, offering advice to the grip with the hammer.\n\nThelma Ritter appeared for the first time in this scene, her left arm in a sling and carrying a broken alarm clock in her other hand, and speaking in one of the memorable voices of the screen.\n\nThe afternoon was also marked by the arrival of Marilyn Monroe at the Reno airport. Arthur Miller, Frank Taylor, a United Artists publicity man, “The Misfits” still photographer, Al St. Hilaire, a few members of the Reno press, a newsreel photographer, and 200 fans were on hand when a United DC-7 landed at 2:45. In a preview of what was to happen throughout the filming of “The Mis­fits,” America’s oldest enfant terrible did not emerge from the plane for 30 minutes. No one seemed to mind, and everyone waited patiently as she walked to the passenger gate, accompanied by Miller, Rupert Allan, her press representative, and Sydney Guilaroff, who had arranged her hair on the plane. She looked very young in a white blouse and skirt, and was already in char­acter as Roslyn in the upswept platinum wig that she would wear during the pic­ture. There were a few words of welcome, a presentation of flowers by the wife and daughter of the governor, and Monroe was escorted to Taylor’s Thunderbird for a triumphant ride down Virginia Street to the Mapes Hotel. Taylor was hoping to get pictures for the wire services and news­reels of Monroe perched on the back of the open car under the sign, RENO, THE BIGGEST LITTLE …. He did, and Monroe disappeared into the Mapes and her suite on the top floor. It was later explained that the delay at the airport occurred because Miss Monroe was changing her clothes in the ladies’ room on the plane.\n\nJuly 21 — Montgomery Clift and Kevin McCarthy both arrived in Reno today, McCarthy for a three-day appearance as Mr. Taber, Roslyn’s husband, who comes from Chicago to ask Roslyn to reconsider the divorce.\n\nJuly 23 — ln his suite at the Mapes Hotel that afternoon, Huston tried to explain “for what,” and to tell why he had decided to direct “The Misfits.” As he spoke, he drew a succession of ink portraits of this writer, and smoked innumerable Gauloises cigarettes.\n\n“I got the script in the mail with a letter from Arthur Miller. He was unbelievably modest. He asked me if it had any value. I read it and immediately cabled that I liked it very much ….\n\n“What’s behind it? It is about people who sell their work but won’t sell them­selves. Anybody who holds out is a mis­fit. If he loses, he is a failure, and if he is successful, he is rare. This movie is about a world in change. There was meaning in our lives before World War II, but we have lost meaning now. Now the cowboys ride pickup trucks and a rodeo rider is an actor of sorts. Once they sold the wild horses for children’s ponies. And now for dog food. This is a dog-eat-horse society.\n\n“The part of Gay Langland is a point that should be underscored now, not as a preachment. It reveals itself dramatically. He’s the same man but the world has changed. Then he was noble. Now he is ignoble.”\n\nJuly 25 — After rushes, the party walked to Harrah’s Club on Virginia Street, where the company was shooting a scene from the script in which Gay and Guido meet Roslyn and Isabelle in the bar in Har­rah’s. This marked the first time Gable had played opposite Monroe and the entire company was on hand.\n\nIt was also the first time in years that Harrah’s Club, open 24 hours a day, seven days a week, had been closed to the public. The stars emerged from their trailers parked at the curb, and policemen kept a crowd of 300 people from surging through the doorless air-curtain entrance. The atmosphere inside was realistic, jarred only in the bar where the lights, sound boom, and camera were already in place. A casual group of 75 extras, all hired in Reno for $10 a day, milled through the dice and roulette tables and around the slot machines, but did not play. The famil­iar sounds were absent, and even the air ­conditioning had been turned off to permit recording. The normal shift of Har­rah’s dealers, pit bosses, and waitresses stood silently at hand, the dealers losing about $10 a day in tips, Bill Harrah losing an estimated $50,000 each day in gam­bling revenue in exchange for the refer­ences to his club in the script.\n\nThe scene began with Gable and Wal­lach on adjoining bar stools with their backs to the camera, Monroe, and Ritter. Langland’s hound, Tom Dooley, was beside a stool. In the script, Roslyn sees the dog and calls to it. Langland notices that his dog is missing, sees Roslyn, and advan·ces upon her. Guido and Langland are introduced by Isabelle, who has met Guido at the boardinghouse, and the issue is joined. Marilyn Monroe was very ner­vous, Tom Dooley was unmanageable, and the scene was long, but Huston got the company out of Harrah’s in a day and a half, a day and a half ahead of the esti­mated three-day shutdown, to Bill Har­rah’s vast relief."}, {"url": "https://www.hollywoodyesterday.com/clark-gable-and-marilyn-monroe-behind-the-scenes-of-the-bittersweet-film-the-misfits/", "page_content": "Clark Gable and Marilyn Monroe\n\nClark Gable and Marilyn Monroe lead an outstanding cast in the WONDERFUL 1961 film The Misfits, directed by John Huston. Tragically, it would be the last completed film legends Gable or Monroe made. He died of a heart attack shortly after filming ended and she died a year and a half later.\n\nObviously, that’s the SAD side of the historical film. The great side is that the film happened to begin with. Marilyn Monroe had grown up idolizing Clark Gable, so the fact that she got to make a film with him really warms my heart. It’s also, in my opinion, one of her very best performances.\n\nAdd these to the fact that the movie is truly outstanding and you can see why it’s such a bittersweet film. It might just be the very definition of bittersweet.\n\nThe western also stars Montgomery Clift, Thelma Ritter, Eli Wallach, James Barton, and Kevin McCarthy.\n\nMarilyn Monroe and Clark Gable\n\nYou can buy The Misfits on dvd or Blu-ray (Amazon link). Surprisingly it isn’t on Prime Video, given the historical importance of the film (and how good it is), you’d think it would be."}, {"url": "https://www.magnumphotos.com/arts-culture/cinema/misfits-story-shoot-inge-morath-arthur-miller/", "page_content": "John Huston’s 1961 movie, ‘The Misfits’, was to be the last completed production for two of its stars: Marilyn Monroe and Clark Gable. Gable died shortly after the film wrapped, while Monroe died in August 1962 having worked on the uncompleted movie ‘Something’s Got to Give’.\n\nScripted by Arthur Miller, a raft of Magnum photographers were hired to photograph the making of the film – among them Inge Morath and Henri Cartier-Bresson, who were the first photographers to arrive on set.\n\nAs many of the images, and indeed Morath’s remembrances, attest – the photographers and the actors enjoyed a degree of camaraderie in spite of the film’s widely reported troubled production – one aspect of which was the deteriorating marriage between Miller and Monroe that came to an end that summer.\n\nIn James Goode’s 1963 book, The Story of ‘The Misfits’ – a day-by-day account of the shoot – he hints at the friendly atmosphere the photographers and the actors shared in:\n\nAugust 1 – Monday. Still no shooting call. To pass the time, Eli Wallach has gotten himself into character clothes and makeup as Sigmund Freud, to be photographed by Inge Morath. The object is to paste the resulting photograph on an album cover as a birthday present for John Huston, whose next picture will be ‘Freud’. Eli, Inge and Dick Rowan, a Magnum representative here on location, drove out to a nearby ranch and Eli posed next to a couch in the middle of a corral, with some interested horses looking on. Eli looked frighteningly authentic.\n\nHere, ahead of the 60th anniversary of last day of the film’s shooting on location in Nevada (October 18th), we share both Miller and Morath’s personal reflections upon the film’s production and its at times troubled, yet charming stars alongside little-seen images from the production, and archival materials.\n\nYou can see more work by Magnum photographers during movie productions here, in the series, On Set .\n\nThere is a ‘The Misfits’ collection on the Magnum Shop, which can be viewed here."}, {"url": "https://www.irishtimes.com/culture/film/the-misfits-review-when-art-and-life-collide-1.2251619", "page_content": "The Misfits      Director : John Huston Cert : Club Genre : Drama Starring : Clark Gable, Marilyn Monroe, Montgomery Clift, Thelma Ritter, Eli Wallach Running Time : 2 hrs 15 mins\n\nRosalyn, a beautiful divorcee (Monroe) and her wise-cracking friend (Ritter) are invited to stay with an ageing cowboy (Gable) and his friend (Wallach). The men enlist the help of a rodeo-rider (Clift) so that they might round up the ‘misfit’ mustangs.\n\nIt's practically impossible to watch The Misfits without thinking of the fraught conditions that the film was made in. Film lore tells us that director John Huston was hitting the bottle throughout the production. And who could blame him?\n\nWhere to begin? Leading lady Marilyn Monroe’s marriage to Arthur Miller – who penned the screenplay as a “love-letter” – was disintegrating in a haze of medication. The shoot had to shut down for weeks while she checked into rehab. Clark Gable would have a heart attack two days after production; he died 10 days later. The temperatures in the Nevada desert frequently hit 42 degrees.\n\nMany critics were disappointed with the film on release. For all the talent attached – producer Frank E Taylor had proclaimed The Misfits as “the ultimate motion picture” – detractors criticised the film for being worthy and shallow and overly theatrical.\n\nREAD MORE\n\nStill, for all such caveats, there’s something wonderful about the picture.\n\nBolstered by incredible, career-best performances from Monroe and Gable and the meticulous photography of Russell Metty, it’s a powerful and moving viewing experience. As Monroe and Gable ride off in their truck – neither would live long enough to make another film – they seem to leave behind Hollywood cinema as we know it."}, {"url": "https://www.ft.com/content/2f90f610-278f-11ea-9a4f-963f0ec7e134", "page_content": "What is included in my trial?\n\nDuring your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages.\n\nStandard Digital includes access to a wealth of global news, analysis and expert opinion. Premium Digital includes access to our premier business column, Lex, as well as 15 curated newsletters covering key business themes with original, in-depth reporting. For a full comparison of Standard and Premium Digital, click here.\n\nChange the plan you will roll onto at any time during your trial by visiting the “Settings & Account” section.\n\nWhat happens at the end of my trial?\n\nIf you do nothing, you will be auto-enrolled in our premium digital monthly subscription plan and retain complete access for HK$549 per month.\n\nFor cost savings, you can change your plan at any time online in the “Settings & Account” section. If you’d like to retain your premium access and save 20%, you can opt to pay annually at the end of the trial.\n\nYou may also opt to downgrade to Standard Digital, a robust journalistic offering that fulfils many user’s needs. Compare Standard and Premium Digital here.\n\nAny changes made can be done at any time and will become effective at the end of the trial period, allowing you to retain full access for 4 weeks, even if you downgrade or cancel."}, {"url": "https://www.hollywoodinsider.com/the-misfits-marilyn-monroe/", "page_content": "Photo: Marilyn Monroe\n\nAn All-Star Cast and a Recipe for Disaster\n\nWe have to talk about John Huston. The Golden Age of Hollywood saw a deluge of filmmakers who are now almost regarded as gods, such as Orson Welles and Billy Wilder, but few can claim to be even as remotely chaotic as John Huston, who had made his feature debut in 1941 and would continue until his death in 1987. Huston was, in a sense, the sort of hypermasculine auteur modern movie buffs would have an uneasy relationship with, from his famously gruff voice to his devil-may-care attitude to making his movies; in reality, he was a Hemingway-esque figure, a man so brimming with masculine energy that he threatened to implode.\n\nNot unlike how Ernest Hemingway’s writings were conjoined inexplicably with the man’s chronic battles with physical injuries and mental illness, Huston’s films often gave us insight into a violent flame that stood on the brink of being snuffed out, and as such, there is a kind of emotional honesty and brutality to Huston’s work. Reading about the production behind a Huston film can, at times, be just as enthralling as watching the film itself.\n\nThings to do:\n\nWhen ‘The Misfits’ hit American theaters in February 1961, Huston had been in the business for twenty years, having won two Oscars for his troubles (for ‘The Treasure of the Sierra Madre’), and he already had an impressive list of behind-the-scenes stories behind him. We don’t need to get into how everyone on the set of ‘The African Queen’ was miserable (when not physically ill), or how Huston’s adaptation of Moby Dick ran the gamut from the expensive whale model getting lost at sea to Huston and screenwriter Ray Bradbury (yes, that Ray Bradbury) butting heads.\n\nOf all these, though, none are as purely tragic as the story behind ‘The Misfits,’ the film that would prove to skeptics that Marilyn Monroe was a real actress — and which would end up featuring her final performance. True, Monroe was working on ‘Something’s Got to Give’ at the time of her death, but the film went unfinished, and so ‘The Misfits’ stood as her last will and testament. Not only that, but on paper, the cast and crew — no, the sheer hurricane of talent being funneled into ‘The Misfits’ should have made the film a dream, both in front of and behind the camera; instead, it proved to be a breaking point for some of the people involved.\n\nHuston had already collaborated with Ray Bradbury, one of America’s literary heavyweights, and for ‘The Misfits’ he would continue that streak — this time with Pulitzer Prize-winner Arthur Miller, who also happened to be married to Marilyn Monroe at the time. Miller adapted one of his own short stories, also titled ‘The Misfits,’ for the film, with his wife as the heroine in mind. Alongside Monroe were Clark Gable, most famous as the male lead in ‘Gone with the Wind,’ Eli Wallach, who would later become most famous as the anti-hero Tuco in ‘The Good, the Bad and the Ugly,’ and Montgomery Clift, a young star whose career was derailing due to a car accident in 1956.\n\nRelated video: Full Commentary – Cast & Crew Spills Secrets on Making of ‘Elvis’ | In-Depth Scoop | Austin Butler\n\nRelated video: Full Rendezvous At the Premiere of ‘Elvis’ with Reactions from Stars | Austin Butler, Baz Luhrmann\n\nRelated video: Come Behind The Scenes of ‘Elvis’ | Austin Butler, Tom Hanks and Baz Luhrmann\n\nRelated article: MUST WATCH – The Hollywood Insider’s CEO Pritan Ambroase’s Love Letter to Black Lives Matter – VIDEO\n\nRelated article: Why Queen Elizabeth II Is One Of The Greatest Monarchs | Her Majesty Queen Elizabeth II of United Queendom of Great Britain & Northern Ireland (Video Insight)\n\nRelated article: All Best Actor/Actress Speeches From The Beginning Of Oscars 1929-2019 | Hollywood Insider\n\nOf the four stars, only Wallach would make it past 60: Monroe died in 1962, at the age of 36, Clift would die in 1966 at the age of 45, and Gable died mere days after filming for ‘The Misfits’ had wrapped. The film was released on February 1, on what would have been Gable’s 60th birthday. On the set, drug problems plagued Monroe and Clift, and Monroe had things doubly bad, on account of the fact that her marriage to Miller was eroding; by the time the movie hit theaters, the two had parted ways.\n\nThe Short Unhappy Life of Marilyn Monroe\n\nThere is an alternate timeline, not too different from ours, where Marilyn Monroe had a long and successful career as a film actress; alas, Monroe’s acting career had a number of false starts, and she died young. Born in 1926, Monroe started taking roles when she was barely out of her teens, appearing in B-movie schlock that has long since been forgotten before landing minor roles in Joseph L. Mankiewicz’s ‘All About Eve’ and Huston’s own ‘The Asphalt Jungle,’ both in 1950, both also being held as classics. Still, it would take a few more years for Monroe to land a lead role of any significance, with ‘Gentlemen Prefer Blondes’ in 1953, directed by Howard Hawks and co-starring Jane Russell, and this cemented her status as a sex symbol of the 1950s — for better and worse.\n\nIn her short career, Monroe managed to work with such astounding Golden Age directors as Hawks, Mankiewicz, Huston, and even Billy Wilder, yet despite all these projects, she struggled to be taken seriously as an actress; for all her fame, she died without getting even one Oscar nomination. Being pigeonholed as a promiscuous empty-headed blonde when in reality she was anything but (not helped by the fact that she was a three-time divorcee by the end of it all, at a time when divorce was a taboo subject), Monroe had her beauty turned against her. ‘The Misfits’ was set to be the one, the role that would make Monroe’s career, and how could she fail? She had Huston, who had previously worked with her, and she had her then-husband writing her lines. What could go wrong?\n\nRelated article: The Hollywood Insider’s CEO Pritan Ambroase: “The Importance of Venice Film Festival as the Protector of Cinema”\n\nRelated article: The Masters of Cinema Archives: The Hollywood Insider Pays Tribute to ‘La Vie En Rose’, Exclusive Interview with Director Olivier Dahan\n\nRelated article: – Want GUARANTEED SUCCESS? Remove these ten words from your vocabulary| Transform your life INSTANTLY\n\nRelated Video: Full Commentary on ‘Top Gun: Maverick’: Tom Cruise, Val Kilmer, Jennifer Connelly, Miles Teller\n\nRelated video: ‘Top Gun: Maverick’ Full Premiere Reactions: Tom Cruise, Val Kilmer, Jennifer Connelly, Miles Teller\n\nRelated video: EVOLUTION: Every Tom Cruise Role From 1981 to 2021, All Performances Exceptionally Poignant\n\nFor one thing, Huston was being his usual unprofessional self, even running production over-budget and nearly having the film shut down due to his immense gambling losses. For another, it turns out that having the screenwriter and the leading lady be in a relationship may not be the best idea; not only did Miller keep revising his screenplay mid-production, but Monroe resented her character being modeled after herself. The movie follows a young divorcee and former nightclub dancer (hmmm) who moves to Reno, striking up a friendship and business partnership with an aging cowboy (Gable) and his volatile WWII veteran friend (Wallach), as the three try to make it in the Nevada desert.\n\nThe film, by the way, was actually shot in the Nevada desert, in scorching heat, which probably didn’t help matters. Curiously, despite on-set tensions with Huston and Miller, Monroe befriended a scarred and drug-addled Montgomery Clift, and the surprisingly platonic friendship between their characters on-screen hints at a genuine off-screen friendship between kindred spirits. As said before, Monroe and Clift suffered from drug addiction during production — battles they would eventually lose, and it must also be said that despite these personal troubles, they both carried through on-screen wonderfully. Indeed, Monroe’s performance in ‘The Misfits’ could be her very best; she exudes a tragic femininity trying to transcend itself in spite of all the men in her life disappointing her.\n\nRelated article: A Tribute to Johnny Depp: The Actor and Musician Who Defined Range\n\nRelated video: EVOLUTION: Every Johnny Depp Role From 1984 to 2020, All Performances Exceptionally Poignant\n\nRelated article: A Tribute to the Hero & President Volodymyr Zelenskyy: Comedian/Actor, Ukraine’s President and Heroic Leader\n\nA Swan Song for Hollywood’s Golden Age\n\nIn 1961, Hollywood’s Golden Age was coming to an end, although this would not have been apparent to most people yet. As far as moviegoers and filmmakers were concerned, 1961 was part of the 1950s, in spirit if not literally; after all, one of the highest-grossing films of 1960 was Stanley Kubrick’s sword-and-sandals epic ‘Spartacus,’ a movie that would almost surely not have done as well if released a decade later. Regardless, the Golden Age was in its twilight years — a twilight that would then turn pitch black with the financial disaster that was Joseph L. Mankiewicz’s ‘Cleopatra’ in 1963. ‘The Misfits’ starred three Golden Age legends, all of whom were at the ends of their careers, being the last rodeo for Monroe and Gable in particular.\n\nIt would also be the last time Huston would put 100% of himself into his filmmaking for at least a decade, afterward directing a string of forgettable or regrettable features until the critical hit of ‘Fat City’ in 1972, at which point he had virtually reinvented himself. ‘The Misfits’ also occupies an interesting space as a Western that doesn’t fit into the classic Western mode (no gunfights, no saloon brawls, no villain in a black suit) while also not quite anticipating the transformation the Western would experience in the coming years. As such, ‘The Misfits’ stands, perhaps better than any other movie, as a line in the sand, between the Golden Age Hollywood production and the grittier, more socially conscious New Hollywood productions that were to emerge in the 1960s.\n\nRelated article: EVOLUTION: Every Henry Cavill Role From 2001 to 2021, All Performances Exceptionally Poignant\n\nRelated article: EVOLUTION: Every Chris Evans Role From 1997 to 2020, All Performances Exceptionally Poignant\n\nRelated article: #metoo Revolution: Powerful Questions That Need Answers\n\nRelated article: FACT-CHECKED Series: Timothee Chalamet and 32 Facts about The Young Superstar\n\nDespite its making being a torture for those involved, and despite its initial reception being underwhelming, ‘The Misfits’ comes out as a triumph. Not only are the four leads incredible, with all of them embodying complex and troubled characters with disturbing ease, but you probably wouldn’t think Miller had kept fiddling with the screenplay during shooting, since while the structure is not a strict three-act one that we would expect, it gives plenty of air to breathe for the characters. The vast Nevada landscape is gorgeous, and there are some bird’s-eye-view shots that are pretty remarkable for the time, with Huston proving once again that he could make great movies — in spite of himself. Most importantly, ‘The Misfits’ might be the strongest argument in favor of Monroe’s potential as an actress, giving a dexterous performance that is at once tender and overflowing with emotion — the kind of performance any actor would be proud of. Hollywood was about to go through some serious changes, and in so doing would leave Monroe, Clift, and the others behind, but with the gift of hindsight, we can now appreciate a masterpiece for what it is.\n\nSadly, ‘The Misfits’ is not currently available to stream anywhere, but it is available to rent digitally. The movie itself is certainly worth a few dollars and your time.\n\nBest of luck to Ana de Armas playing Marilyn Monroe in ‘Blonde’.\n\nBy Brian Collins\n\nClick here to read The Hollywood Insider’s CEO Pritan Ambroase’s love letter to Cinema, TV and Media. An excerpt from the love letter: The Hollywood Insider’s CEO/editor-in-chief Pritan Ambroase affirms, “We have the space and time for all your stories, no matter who/what/where you are. Media/Cinema/TV have a responsibility to better the world and The Hollywood Insider will continue to do so. Talent, diversity and authenticity matter in Cinema/TV, media and storytelling. In fact, I reckon that we should announce “talent-diversity-authenticity-storytelling-Cinema-Oscars-Academy-Awards” as synonyms of each other. We show respect to talent and stories regardless of their skin color, race, gender, sexuality, religion, nationality, etc., thus allowing authenticity into this system just by something as simple as accepting and showing respect to the human species’ factual diversity. We become greater just by respecting and appreciating talent in all its shapes, sizes, and forms. Award winners, which includes nominees, must be chosen on the greatness of their talent ALONE.\n\nI am sure I am speaking for a multitude of Cinema lovers all over the world when I speak of the following sentiments that this medium of art has blessed me with. Cinema taught me about our world, at times in English and at times through the beautiful one-inch bar of subtitles. I learned from the stories in the global movies that we are all alike across all borders. Remember that one of the best symbols of many great civilizations and their prosperity has been the art they have left behind. This art can be in the form of paintings, sculptures, architecture, writings, inventions, etc. For our modern society, Cinema happens to be one of them. Cinema is more than just a form of entertainment, it is an integral part of society. I love the world uniting, be it for Cinema, TV, media, art, fashion, sport, etc. Please keep this going full speed.”\n\nMore Interesting Stories From The Hollywood Insider\n\n– Want GUARANTEED SUCCESS? Remove these ten words from your vocabulary| Transform your life INSTANTLY\n\n– A Tribute to Martin Scorsese: A Complete Analysis of the Life and Career of the Man Who Lives and Breathes Cinema\n\n– Do you know the hidden messages in ‘Call Me By Your Name’? Find out behind the scenes facts in the full commentary and In-depth analysis of the cinematic masterpiece\n\n– A Tribute To The Academy Awards: All Best Actor/Actress Speeches From The Beginning Of Oscars 1929-2019 | From Rami Malek, Leonardo DiCaprio To Denzel Washington, Halle Berry & Beyond | From Olivia Colman, Meryl Streep To Bette Davis & Beyond\n\n– In the 32nd Year Of His Career, Keanu Reeves’ Face Continues To Reign After Launching Movies Earning Over $4.3 Billion In Total – “John Wick”, “Toy Story 4”, “Matrix”, And Many More\n\nMarilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe, Marilyn Monroe"}, {"url": "https://emanuellevy.com/review/misfits-the-1961/", "page_content": "by\n\nJohn Huston’s emotionally disturbing, thematically riveting “The Misfits,” is based on an original screenplay by the famed playwright Arthur Miller.\n\nThe feature marks the very last screen performances of Clark Gable and Marilyn Monroe (who was then divorced from Miller). Gable died before the film’s release, and Monroe attempted one more project, “Something’s Gotta Give,” which was begun by director George Cukor but was never completed.\n\nWhen “The Misfits” was initially released, it divided critics and failed to find large audiences. However, over the years, the film has grown in stature and in both cinematic and emotional baggage, not least because of the caliber of the cast members and their troubled lives; Montgomery Clift also co-starred.\n\nSet in the Reno rooming house run by Isabelle Steers (Thelma Ritter), “The Misfits” is a modern Western about a triangle of individuals whose paths fatefully crisscross. Roslyn Tabor (Marilyn Monroe), who stays at Steers, meets Gay Langland (Clark Gable), an aging cowboy known for his rugged independence.\n\nDespite difference in age and personality, the two are attracted to each other and soon fall in love, sharing together residence in the partially completed ranch house of Gay’s friend, Guido (Eli Wallach), a mechanic who has turned into an aimless wanderer (and lost soul) ever since his wife had died in childbirth.\n\nThe movie deconstructs the myth of the cowboys, who now drive a pick up and ride horses without saddles, and the myth of the Western, both real and reel. Even so, it still presents a romantically nostalgic view of the old American mores, which is in tune with one of the most recurrent themes in Miller’s stage plays “”Death of a Salesman,” “All My Sons”), which could be described as the degradation or dissolution of the American Dream.\n\nThe text is replete of ironies and mysteries. The ruthless and aimless cowboys live around Reno, Nevada, which is after all, the divorce capital of American, and this a symbol of graveyard of romance.\n\nThe film makes allusions to the public screen images and lives off screen of the three central stars. Take Gable anti-hero, who’s ironically named Gay. Or the punch-drunk, mother-fixated rodeo rider played by Clift, a star whose handsome looks had been tarnished after a bad accident in 1957 during the production of “Raintree County.”\n\n“The Misfits” reflects how modern technology has caught up with the work and lifestyles of the characters involved. The guys hunt wild stallions not with ropes and horses, but with a truck and airplane. Moreover, their ”work” involves horses whose meat is then processed into tinned cat food.\n\nThe film ends on an ambiguous note, with Gable and Monroe discovering some peace and heading together “home.” Consider the last exchange between the couple. When Monroe asks, “How do you find your way back in the dark?” Gable says: “Just head for that big star straight on. The highway’s under it, and it will take us right home.”\n\nBut after all we have seen there’s no avoiding the feeling that the bond is still fragile and they both live in a void, searching for co-existence in a more meaninful world. Most of the drama is about characters who have no “home” and never have had one.\n\nIn 1961, some critics found the picture to be too solemn, pretentious, and wallowing in self-pity. But over the years, “The Misfits” has changed meanings from a drama about ill-fated lives into one about its personas’ real lives, including Gable’s fading charisma as an aging star, Monroe’s evolution as a dramatic actress and her desire to be recognized as such, and Clift’s alcoholic, wasted, self-destructive life.\n\nThe movie walks a fine, tenuous line between being theatrical and cinematic, and between using Monroe’s sex appeal as integral to the character she plays and exploiting it for commercial reasons.\n\nIt’s worth noting that Monroe’s career as a “serious” dramatic actress is bookended by two John Huston pictures: “The Asphalt Jungle,” in 1950, in which Monroe made a strong impression in a secondary part, and exactly a decade later with “The Misfits.”\n\nThe film is evocatively shot in black and white by Russell Metty and beautifully scored by composer Alex North, a frequent collaborator of Huston.\n\nCredits:\n\nReleased: February 4, 1961\n\nRunning time: 124 Minutes\n\nA Seven Arts-John Huston production.\n\nProduced by Frank Taylor\n\nScreenplay: Arthur Miller\n\nDirected by John Huston\n\nCinematography: Russell Metty\n\nEditor: George Tomasini\n\nMusic: Alex North\n\nArt Directors: Stephan Grimes and William Newberry"}]}