{"Carol Huston appeared in several other films, including The Unforgiven, The Mambo Kings, and The Godfather Part III.": [{"url": "https://www.tcm.com/tcmdb/title/17825/the-unforgiven", "page_content": "A big-budget Western with a top cast and challenging themes (racial violence and the suggestion of incest),turned out to be a disaster for just about everyone involved. With Burt Lancaster and Audrey Hepburn as stars and John Huston at the helm, expectations were high. But the production was plagued with deaths, accidents, miscarriages, and a disgruntled, disinterested director. In the end, for all the considerable interest the film has for us today, it failed to find an audience and proved to be the undoing of the HHL production company that Lancaster and partners Harold Hecht and James Hill had started several years earlier with such high ambitions.The sometimes bizarrely structured story tells of racial tension dividing a family and a community in the old West. A mysterious stranger, Abe Kelsey, shows up out of nowhere one day, accusing the Zachary family of harboring an abducted Kiowa child, now grown into a beautiful and spirited young woman. The revelation brings down the wrath of the Kiowas, the townspeople, and even the younger Zachary brother, whose racism spills out vehemently against his adopted sister.The script was based on a novel by Alan LeMay, the same writer who fashioned a similar story of anti-Indian hatred that became the basis for John Ford's masterpiece(1956). Huston hoped screenwriter Ben Maddow, who had scripted Huston's(1950), would concentrate more on the serious racial intolerance theme. But the director soon felt that producers Lancaster and Hill were more interested in a conventional action picture. \"Quite mistakenly, I agreed to stick it out, thus violating my own conviction that a picture-maker should undertake nothing but what he believes in, regardless,\" Huston later said in his autobiography,(Knopf, 1984). \"From that moment on, the entire picture turned sour. Everything went to hell. It was as if some celestial vengeance had been loosed upon me for infidelity to my principles.\"If, indeed, there was \"celestial vengeance\" as Huston suggests, it was visited on others with almost Biblical horror. Three crewmembers were killed in a plane crash on their way back from the States to location shooting in Mexico. Audie Murphy nearly drowned when his boat capsized in a lake, and he was saved by the quick action and skill of still photographer Inge Morath (although news reports tried to paint it as a publicity stunt). Hepburn, who was pregnant, was thrown from a horse and suffered fractured vertebrae that required six weeks of recuperation in Los Angeles. When she returned to the set, she had to complete the film in a stiff back brace. Shortly after shooting completed, she suffered a miscarriage, although it's unclear if it was related to the fall. Maka Czernichew, an artist Huston met in Mexico and with whom he began an affair during production, claimed she also suffered a miscarriage. The baby was Huston's, which may have been the spur for another incident, a knife attack against him by Lorrie Sherwood, a personal assistant referred to by one newspaper as his \"secretary-mistress.\"And although its only loss was monetary, it was the death knell for the business founded by Lancaster and his partners. HHL had been started not only to give the actor greater creative control and range but also to produce prestigious projects he didn't appear in. After some early box office successes, as well as such critically praised work as(1955) and(1957), HHL's efforts grew more expensive, more chaotic and fraught with conflict, and ultimately less and less financially successful. This was the company's last production. With the stars' and director's high salaries, the cost of delays brought on by Hepburn's accident, and the huge expense of creating not only the Zacharys' frontier house but the hill that encased part of the structure (designed by the same man who made the whale for Huston's, 1956), even a decent box office profit could not have brought the picture into the black.Unfortunately, the behind-the-scenes drama has obscured some very interesting work by Huston and his cast. The film is rather oddly put together, with sudden shifts in tone and characters who inexplicably disappear from the story. But there are several effective and memorable moments - Lancaster's attempt to save the half-buried house from a cattle stampede, the hanging of Kelsey, Gish playing classical music on her piano in defiance of the Kiowa's war dance, and the subsequent attack on the piano by the furious Indians. Critics were divided on whether Hepburn gave a top performance or was totally miscast in the role, but most everyone agreed it was former war hero Murphy's finest work on screen (in a part that was originally to have gone to Tony Curtis).As for Huston, he always insisted it was the only one of his films he actively disliked and couldn't bear to watch. Evidence suggests, however, that much of what he considered unpleasant about the production may have been his own fault. Several crewmembers have stated he was thoroughly unengaged in the filming process and may have taken the job only to raise funds for renovation of a castle he bought in Ireland. Some suggested he signed onto the location shoot in Mexico as a way of furthering his generally illegal but lucrative collection and importation of pre-Columbian art and artifacts. In any case, he abandoned the project immediately after principal photography, leaving the studio to shape the final cut.Director: John HustonProducer: James HillScreenplay: Ben Maddow, based on the novel by Alan LeMayCinematography: Franz PlanerEditing: Russell LloydArt Direction: Stephen GrimesOriginal Music: Dimitri TiomkinCast: Burt Lancaster (Ben Zachary), Audrey Hepburn (Rachel Zachary), Audie Murphy (Cash Zachary), Lillian Gish (Mattilda Zachary), John Saxon (Johnny Portugal), Joseph Wiseman (Abe Kelsey).C-122m. Letterboxed.by Rob Nixon\n\nThe Unforgiven\n\nA big-budget Western with a top cast and challenging themes (racial violence and the suggestion of incest), The Unforgiven turned out to be a disaster for just about everyone involved. With Burt Lancaster and Audrey Hepburn as stars and John Huston at the helm, expectations were high. But the production was plagued with deaths, accidents, miscarriages, and a disgruntled, disinterested director. In the end, for all the considerable interest the film has for us today, it failed to find an audience and proved to be the undoing of the HHL production company that Lancaster and partners Harold Hecht and James Hill had started several years earlier with such high ambitions. The sometimes bizarrely structured story tells of racial tension dividing a family and a community in the old West. A mysterious stranger, Abe Kelsey, shows up out of nowhere one day, accusing the Zachary family of harboring an abducted Kiowa child, now grown into a beautiful and spirited young woman. The revelation brings down the wrath of the Kiowas, the townspeople, and even the younger Zachary brother, whose racism spills out vehemently against his adopted sister. The script was based on a novel by Alan LeMay, the same writer who fashioned a similar story of anti-Indian hatred that became the basis for John Ford's masterpiece The Searchers (1956). Huston hoped screenwriter Ben Maddow, who had scripted Huston's The Asphalt Jungle (1950), would concentrate more on the serious racial intolerance theme. But the director soon felt that producers Lancaster and Hill were more interested in a conventional action picture. \"Quite mistakenly, I agreed to stick it out, thus violating my own conviction that a picture-maker should undertake nothing but what he believes in, regardless,\" Huston later said in his autobiography, An Open Book (Knopf, 1984). \"From that moment on, the entire picture turned sour. Everything went to hell. It was as if some celestial vengeance had been loosed upon me for infidelity to my principles.\" If, indeed, there was \"celestial vengeance\" as Huston suggests, it was visited on others with almost Biblical horror. Three crewmembers were killed in a plane crash on their way back from the States to location shooting in Mexico. Audie Murphy nearly drowned when his boat capsized in a lake, and he was saved by the quick action and skill of still photographer Inge Morath (although news reports tried to paint it as a publicity stunt). Hepburn, who was pregnant, was thrown from a horse and suffered fractured vertebrae that required six weeks of recuperation in Los Angeles. When she returned to the set, she had to complete the film in a stiff back brace. Shortly after shooting completed, she suffered a miscarriage, although it's unclear if it was related to the fall. Maka Czernichew, an artist Huston met in Mexico and with whom he began an affair during production, claimed she also suffered a miscarriage. The baby was Huston's, which may have been the spur for another incident, a knife attack against him by Lorrie Sherwood, a personal assistant referred to by one newspaper as his \"secretary-mistress.\" And although its only loss was monetary, it was the death knell for the business founded by Lancaster and his partners. HHL had been started not only to give the actor greater creative control and range but also to produce prestigious projects he didn't appear in. After some early box office successes, as well as such critically praised work as Marty (1955) and Sweet Smell of Success (1957), HHL's efforts grew more expensive, more chaotic and fraught with conflict, and ultimately less and less financially successful. This was the company's last production. With the stars' and director's high salaries, the cost of delays brought on by Hepburn's accident, and the huge expense of creating not only the Zacharys' frontier house but the hill that encased part of the structure (designed by the same man who made the whale for Huston's Moby Dick, 1956), even a decent box office profit could not have brought the picture into the black. Unfortunately, the behind-the-scenes drama has obscured some very interesting work by Huston and his cast. The film is rather oddly put together, with sudden shifts in tone and characters who inexplicably disappear from the story. But there are several effective and memorable moments - Lancaster's attempt to save the half-buried house from a cattle stampede, the hanging of Kelsey, Gish playing classical music on her piano in defiance of the Kiowa's war dance, and the subsequent attack on the piano by the furious Indians. Critics were divided on whether Hepburn gave a top performance or was totally miscast in the role, but most everyone agreed it was former war hero Murphy's finest work on screen (in a part that was originally to have gone to Tony Curtis). As for Huston, he always insisted it was the only one of his films he actively disliked and couldn't bear to watch. Evidence suggests, however, that much of what he considered unpleasant about the production may have been his own fault. Several crewmembers have stated he was thoroughly unengaged in the filming process and may have taken the job only to raise funds for renovation of a castle he bought in Ireland. Some suggested he signed onto the location shoot in Mexico as a way of furthering his generally illegal but lucrative collection and importation of pre-Columbian art and artifacts. In any case, he abandoned the project immediately after principal photography, leaving the studio to shape the final cut. Director: John Huston Producer: James Hill Screenplay: Ben Maddow, based on the novel by Alan LeMay Cinematography: Franz Planer Editing: Russell Lloyd Art Direction: Stephen Grimes Original Music: Dimitri Tiomkin Cast: Burt Lancaster (Ben Zachary), Audrey Hepburn (Rachel Zachary), Audie Murphy (Cash Zachary), Lillian Gish (Mattilda Zachary), John Saxon (Johnny Portugal), Joseph Wiseman (Abe Kelsey). C-122m. Letterboxed. by Rob Nixon"}, {"url": "https://letterboxd.com/film/the-unforgiven/", "page_content": "”Don’t shoot unless you have to”\n\n“When is that?”\n\n“When they break the peace and kill me”\n\nThere’s some great moments to be found here, but sadly as whole this John Huston western fails to come together. It’s one of those films where I admire what they were trying to do much more than what they actual did.\n\nBONUS POINTS to Lillian Gish who is by far and away my favorite thing about this film.\n\n”Stop fussing. I’ve hurt myself worse with a kitchen knife”\n\n\n\nCinematic Time Capsule - 1960 Ranked"}, {"url": "https://www.tvguide.com/celebrities/carol-huston/credits/3030402566/", "page_content": "Join or Sign In\n\nSign in to customize your TV listings\n\nContinue with Facebook\n\nContinue with email\n\nBy joining TV Guide, you agree to our Terms of Use and acknowledge the data practices in our Privacy Policy."}, {"url": "https://www.famousfix.com/topic/carol-huston", "page_content": "Carol Huston was connected to:\n\nover a year ago\n\nTerry Lester (April 13, 1950 – November 28, 2003) was an American actor. His best known roles include Jack Abbott on The Young and the Restless, Mason Capwell on Santa Barbara and Royce Keller on As the World Turns."}, {"url": "https://allstarbio.com/carol-huston-bio-wiki-net-worth-age-height-married-wife/", "page_content": "Quick Facts of Carol Huston Full Name Carol Huston\n\nDate of Birth 15 August, 1963\n\nNickname Carol\n\nMarital Status Divorce\n\nBirthplace Chicago, Illinois, the United States of America\n\nEthnicity White\n\nProfession Actress, Singer\n\nNationality American\n\nActive Year 1982-2003\n\nEye colour Blue\n\nHair colour Blonde\n\nBuild Slim\n\nSpouse Jerry Watts Jr. (2003–present)\n\nOnline Presence Instagram, Facebook and Twitter\n\nChildren 1\n\nHoroscope Leo\n\nThe ever beautiful actress and a singer, Carol Huston is someone who has marked her territory in the industry through her professional life. Huston is popular for her roles in the television series Matlock, The Charmings and Island Son. Likewise, she played Dorothy in 1989’s film Hooperman.\n\nThere are plenty of Carol’s fans who have a question on their minds, What she is doing now? Who is Huston’s husband? If you’re one of those fans who want to know more about Huston, we must say you have stumbled upon a correct article. Here are all the details related to the singer.\n\nWho is Carol Huston? Know her Bio & Wiki\n\nCarol Huston was born on August 15, 1963, in Chicago, Illinois, the United States of American. Huston holds an American nationality and belongs to white ethnicity. She was raised in Chicago along with her sister and a brother. The other details about her family background and early life are far from the media.\n\nHuston attended Forest View High School in nearby Arlington Heights, where she participated in its performing arts program, headed by Dr.Jack Martin and Jerry Swanson. She began her early professional training there as a singer and actress. Carol attended Wheaton College as a voice major. She was also a member of the Chicago Sunday Evening Club Chorale, which appeared weekly on the WTTW station in Chicago.\n\nCarol Huston’s Age, Height & Body Measurements\n\nTalking about Carol’s age, she is 55 years old as of 2019. In the same way, Huston has a good height and weight but the measurements are unavailable at the moment. Being an actress, Huston has maintained her body figure to it’s optimum. She is blessed with blonde hair and grey eyes.\n\nCarol Huston’ Professional Life\n\nHuston began her acting career since 1982, starring the role Snow White Charming in the film The Charmings. She is most famous for her roles in the TV series Matlock, and Island Son. Huston has appeared in an episode of the TV series Diagnosis: Murder called Open and Shut as well as A Very Brady Christmas as Valerie Thomas.\n\nIn The Color of Money, she appeared with Paul Newman and Tom Cruise. Since 2003, Carol left her acting career to became a real estate agent in California.\n\nSee More:\n\nHow much is Carol Huston’ Net Worth & Salary?\n\nThe hard work and dedication of Carole Hudson have paid off in form of huge net worth. She has an estimated net worth of around $1 million as of 2019. Moreover, Carol’s net worth is aided by her acting career. Looking at Carol’s public apperances we can she is a travel freak and loves to explore new places. Since the actress quit her acting to became a real estate agent in California, she must be earning a big chunk of money from there as well.\n\nEven though she has earned such a hefty amount, Carol hasn’t revealed the details about the house she owns and cars she rides.\n\nSee More:\n\nWho is Carol Huston’ Married to? Know about her husband & children\n\nCarol has earned a good name and fame when it comes to her career. Yet, Huston’ personal life is quite a low key. She was married to her longterm boyfriend turned husband Jerry Watts Jr, on July 20, 2003. Probably, their wedding ceromany was held in a private ceromany hall. However, the former couple hasn’t revealed when and how they met.\n\nDespite sharing several years as a husband and wife, the couple ended their relationship into divorce. With her spouse, Carol shares a daughter Morgan Watts. Similarly, Huston’s past affairs and relationship are also not disclosed yet. Not just that, Hudson is now a grandmother of Morgan’s son Rhys. She often shares pictures of her daughter and grandson on various social media sites such as Instagram, Facebook, and Twitter."}, {"url": "https://wikimili.com/en/Carol_Huston", "page_content": "Dyan Cannon is an American actress, filmmaker and editor. Her accolades include a Saturn Award, a Golden Globe Award, three Academy Award nominations and a star on the Hollywood Walk of Fame. She was named Female Star of the Year by the National Association of Theatre Owners in 1973 and the Hollywood Women's Press Club in 1979.\n\nConnie Stevens is an American actress and singer. Born in Brooklyn, New York City to musician parents, Stevens was raised there until age 12, when she was sent to live with family friends in rural Missouri after she witnessed a murder in the city. In 1953, at age 15, Stevens relocated with her father to Los Angeles, California.\n\nRobin Curtis is an American actress. She is best known for replacing Kirstie Alley in the role of Vulcan Lieutenant Saavik in the films Star Trek III: The Search for Spock and Star Trek IV: The Voyage Home.\n\nShelley Lee Long is an American actress, singer, and comedian. Long portrayed Diane Chambers on the hit sitcom Cheers and received five Emmy nominations, winning in 1983 for Outstanding Lead Actress in a Comedy Series. She won two Golden Globe Awards for the role. Long reprised her role as Diane Chambers in three episodes of the spin-off Frasier, for which she received an additional guest star Emmy nomination. In 2009, she began playing a recurring role as DeDe Pritchett on the ABC comedy series Modern Family.\n\nMaggie Roswell is an American actress, comedian, writer and producer from Los Angeles, California. She is well known for her voice work on the Fox network animated television series The Simpsons, in which she has played recurring characters such as Maude Flanders, Helen Lovejoy, Miss Hoover, and Luann Van Houten, as well as several minor characters. This work has earned her an Annie Award nomination.\n\nMarla Gibbs is an American actress, singer, comedian, writer and television producer whose career spans seven decades. Gibbs is known for her role as George Jefferson's maid, Florence Johnston, in the CBS sitcom The Jeffersons (1975–1985), for which she received five nominations for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series.\n\nTracy Kristine Nelson is an American actress. From a long line of entertainers, she is the daughter of musician Ricky Nelson and actress and painter Kristin Nelson.\n\nTricia Leigh Fisher is an American actress and singer.\n\nJulia Margaret Duffy is an American actress. She began her career in television, appearing in minor guest roles before being cast in the role of Penny Davis in the series The Doctors from 1973 until 1977. She starred in the acclaimed Broadway revival of Once in a Lifetime in 1978.\n\nAnn Magnuson is an American actress, performance artist, and nightclub performer. She was described by The New York Times in 1990 as \"An endearing theatrical chameleon who has as many characters at her fingertips as Lily Tomlin does\".\n\nEve Aline Plumb is an American actress, singer and painter. She is best known for portraying the middle daughter Jan Brady on the ABC sitcom The Brady Bunch.\n\nMichele Dominguez Greene is an American actress, singer, and author. She is known for her role as attorney Abby Perkins on the TV series L.A. Law from 1986 to 1991, for which she was nominated for a 1989 Primetime Emmy Award. She reprised the role in the 2002 TV reunion film L.A. Law: The Movie.\n\nAnn Bradford Davis was an American actress. She achieved prominence for her role in the NBC situation comedy The Bob Cummings Show (1955–1959), for which she twice won the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series, but she was best known for playing the part of Alice Nelson, the housekeeper in ABC's The Brady Bunch (1969–1974).\n\nFlorence Agnes Henderson was an American actress and singer. With a career spanning six decades, she is best known for her starring role as Carol Brady on the ABC sitcom The Brady Bunch. Henderson also appeared in film, as well as on stage, and hosted several long-running cooking and variety shows over the years. She appeared as a guest on many scripted and unscripted television programs and as a panelist on numerous game shows. She was a contestant on Dancing with the Stars in 2010.\n\nThe Charmings is an American fantasy sitcom that follows Snow White and Prince Charming, awakened from a thousand-year spell, as they adjust from their familiar life in the enchanted forest to the modern ways of 20th century Los Angeles suburbs. The series originally aired from March 20, 1987, to February 11, 1988, on ABC.\n\nCeleste Thorson is an American actress, model, screenwriter, and activist. She is best known for her roles on How I Met Your Mother, Jimmy Kimmel Live!, The Exes, Heartbeat and as a host for numerous lifestyle and travel television shows. Thorson has written twenty four episodes of television and several short films. As a model, she has been featured in modeling and commercial campaigns for Reebok, Lady Foot Locker, Yoplait, Sprint, Nissan, Nokia, Samsung, Yahoo!, Body Glove, Toms Shoes, and Paul Mitchell.\n\nIrene Tsu is an actress who started in the film Flower Drum Song in 1961. She was featured in an advertising campaign in the 1960s. She speaks English and three varieties of Chinese.\n\nMorningside High School is a public high school in Inglewood, California. It is the second largest high school after Inglewood High School in the city.\n\nJanet Carroll was an American film, stage and television character actress."}, {"url": "https://emanuellevy.com/review/unforgiven-the-1960-john-hustons-western-starring-burt-lancaster-and-audrey-hepburn/", "page_content": "by\n\nJohn Huston directed The Unforgiven, a liberal-minded Western after two artistic and commercial flops, though he was not pleased with its results either.\n\nThe star power—Burt Lancaster and Audrey Hepburn at the height of their careers and in their only teaming together—did not help either.\n\nAhead of its time in terms of racial politics, The Unforgiven, based on Alan Le May’s novel, aimed to bring a more realistic angle on the problems of the Native Americans.\n\nThe Zacharys are a respected family on the Texas frontier, having endured the killing of patriarch Will Zachary by Kiowa Indians. His oldest son Ben (Lancaster) and his mother Mattilda (Lillian Gish) are protective of the Zacharys’ adopted daughter, Rachel (Hepburn), and her brothers, Cash (Audie Murphy) and Andy (Doug McClure) also like Rachel.\n\nThe family is supported by their neighbor, Zeb Rawlins (reliable character actor Charles Bickford), the head of a racist family, whose son Charlie (Albert Salmi) wishes to marry Rachel. Problem is, Ben, aware that she is not actually his blood sister, also loves Rachel.\n\nAs the ranchers prepare for cattle drive to Wichita, Kansas, an old “crazy” man, Abe Kelsey (Joseph Wiseman) claim that Rachel is an Indian. Refusing to believe, Ben and Cash try to kill Kelsey, but he steals a horse from them.\n\nSome Kiowas appear one night, led by Lost Bird, offering to trade horses to Ben in return for Rachel, presumably Bird’s actual sister. The Kiowa kill Charlie when he returns to his ranch from courting Rachel, and his grieving mother accuses Rachel of being a “dirty Injun.” Ben tracks down Kelsey and brings him back to the Rawlins ranch to be hanged as a thief.\n\nKelsey then tells the mob that, on a retaliatory raid against the Kiowa, he found a baby. Claiming that his son was captured by the Kiowa, he now demands that Will return Rachel in exchange for him.\n\nBen refusing, arguing that Kelsey’s son was killed in the fighting, and that Kelsey made up the story to justify vengeance against the Zacharys. Mattilda reacts to Kelsey’s rant by striking the horse Kelsey is on, causing his hanging. As a result, Zeb and the ranchers turn their backs on the Zacharys.\n\nMattilda admits to her family that Will had taken the Kiowa baby and brought it to her to replace an infant daughter they had just lost. Unable to deal with his sister being a “red-hide nigger,” Cash abandons the family. The Kiowa return, demanding Rachel, who tries to save her family by going over to the Kiowa.\n\nBen deliberately breaks the truce by killing a Kiowa, forcing a fight, during which his mother gets killed. In the end, Cash returns and turns the tide. Aware of Ben’s true love, Rachel kills her brother during a confrontation, thus showing her commitment to the white men.\n\nThe casting of Hepburn as Native American stirred controversy. Additionally, production was halted after the star broke her back when she fell off a horse; the accident was blamed for a subsequent miscarriage. Upon recovery, she completed the movie.\n\nFor his part, Huston was in conflict with Rick Height company, which financed the movie. Height’s company wanted a more commercial, less controversial, film, while the director was more concerned with its political ideology."}, {"url": "https://www.imdb.com/filmosearch/?role=nm0404108&sort=year", "page_content": "Action, Adventure, Comedy\n\n8.7 Rate this 1 2 3 4 5 6 7 8 9 10 8.7 / 10 X\n\nWhen Jonathan gets an activation code from someone in the CIA, he learns that he's being sent to kill someone big in the spy game. When someone tries to kill him, he chases the person down ... See full summary »\n\nDirector: Vern Gillum | Stars: Jeffrey Meek, Lee Majors, Greg Beecroft, Andy Bumatai\n\nVotes: 11"}, {"url": "https://ell.stackexchange.com/questions/181528/why-is-it-he-has-appeared-in-several-films-instead-of-he-appeared", "page_content": "Present perfect simple is used to talk about past events when the time is not specified. He has appeared in several movies. He has acted in movies in the past but we don't know for sure when that happened. The time is not specified.\n\nShe has been to the theatre before. - we don't know when\n\nHe has worked there for a long time.\n\nPast tense simple is used to talk about past events when the time has been specified. He appeared in several movies last year. It is still a past action but you know when it happened, the time is specified here.\n\nShe went to the theatre yesterday."}, {"url": "https://www.rottentomatoes.com/celebrity/carol_huston", "page_content": "Log in or sign up for Rotten Tomatoes\n\nContinue with Google\n\nContinue with Email\n\nEmail\n\nNew Where is the password field?\n\nContinue\n\nTrouble logging in?\n\nBy continuing, you agree to the Privacy Policy and the Terms and Policies, and to receive email from Rotten Tomatoes."}]}