{"Richard Allen Epstein is a frequent contributor to the popular press, including The Wall Street Journal, The New York Times, and The Washington Post.": [{"url": "https://www.nytimes.com/2021/04/10/business/media/wall-street-journal-murdoch.html", "page_content": "To hear more audio stories from publishers like The New York Times, download Audm for iPhone or Android.\n\nThe Wall Street Journal is a rarity in 21st-century media: a newspaper that makes money. A lot of money. But at a time when the U.S. population is growing more racially diverse, older white men still make up the largest chunk of its readership, with retirees a close second.\n\n“The No. 1 reason we lose subscribers is they die,” goes a joke shared by some Journal editors.\n\nNow a special innovation team and a group of nearly 300 newsroom employees are pushing for drastic changes at the paper, which has been part of Rupert Murdoch’s media empire since 2007. They say The Journal, often Mr. Murdoch’s first read of the day, must move away from subjects of interest to established business leaders and widen its scope if it wants to succeed in the years to come. The Journal of the future, they say, must pay more attention to social media trends and cover racial disparities in health care, for example, as aggressively as it pursues corporate mergers.\n\nThat argument has yet to convince executives in the top ranks of the company.\n\nThe Journal got digital publishing right before anyone else. It was one of the few news organizations to charge readers for online access starting in 1996, during the days of dial-up internet. At the time, most other publications, including The New York Times, bought into the mantra that “information wants to be free” and ended up paying dearly for what turned out to be a misguided business strategy."}, {"url": "https://fampeople.com/cat-richard-allen-epstein", "page_content": "Richard Allen Epstein : biography\n\nRichard Allen Epstein (born April 17, 1943) is the Laurence A. Tisch Professor of Law at the New York University School of Law. He is also an Adjunct Scholar at the Cato Institute, the Peter and Kirsten Bedford Senior Fellow at Stanford University’s Hoover Institution, the James Parker Hall Distinguished Service Professor of Law Emeritus and a Senior Lecturer at the University of Chicago Law School, and a policy advisor for The Heartland Institute. Epstein became a permanent faculty member at NYU School of Law in 2010. Epstein was chosen in a poll as one of the most influential legal thinkers of modern times.\n\nViews\n\nEpstein is an advocate of minimal legal regulation. In his book Simple Rules for a Complex World (1997), Epstein consolidated much of his previous work, arguing that simple rules work best because complexities create excessive costs. Complexity comes from attempting to do justice in individual cases. Complex rules are justifiable however, according to Epstein, if they can be opted out of. For instance, drawing on Gary Becker, he argues that the Civil Rights Act and other anti-discrimination legislation would be better if repealed. Consistent with libertarian principles, he believes that the federal regulation on same-sex marriage, DOMA, should be repealed, stating:\n\nUnder our law, only the state may issue marriage licenses. That power carries with it a duty to serve all-comers on equal terms, which means that the state should not be able to pick and choose those on whom it bestows its favors. DOMA offends this principle in two ways. First, it excludes polygamous couples from receiving these marital benefits. Second, it excludes gay couples. Both groups contribute to the funds that support these various government programs. Both should share in its benefits.\n\nHowever, in the two cases under discussion (Gill and Massachusetts, both of which had been heard by U.S. District Court Judge Joseph Tauro), Epstein observed that:\n\nTo strike down DOMA, Judge Tauro had to reject all state justifications for its definition of marriage. Congress advanced four such justifications for this statute: \"(1) encouraging responsible procreation and child-bearing, (2) defending and nurturing the institution of traditional heterosexual marriage, (3) defending traditional notions of morality, and (4) preserving scarce resources.\" The Justice Department disavowed them all. So much for tradition. Its sole defense of DOMA was that it was needed to preserve the status quo until matters were sorted out politically. Given that open invitation Judge Tauro concluded that all of the justifications offered in DOMA flunked even the lowest \"conceivable\" standard of rationality. Religious people will surely take umbrage at his one-sentence rebuttals of centuries of tradition.\n\nEpstein’s criticism of these two decisions concluded:\n\nNow there is no reason for principle to yield to pragmatism. We don’t need a judicial precedent that will spark a nation-wide rerun of California’s Proposition 8. We need courts to back off to democratic processes, imperfect as they are.\n\nEpstein views market incentives against discrimination as sufficient to regulate the acknowledged evil, and attempting to give everyone a court hearing only encourages excessive litigation.Simple Rules for a Complex World (1995) 171-176\n\nIn Takings: Private Property and the Power of Eminent Domain (1985) Epstein argues the government should be regarded with the same respect as any other private entity in a property dispute. Though then U.S. Senator Joseph Biden denounced the book during the confirmation hearings of Clarence Thomas for Associate Justice of the Supreme Court of the United States, the book served as a focal point in the argument about the government’s ability to control private property. The book has also influenced how some courts view property rights and has been cited by the United States Supreme Court in four cases, including Lucas v. South Carolina Coastal Council from 1992. Epstein’s defense of tobacco companies during the 1990s was controversial. Epstein serves on the advisory board of the New York University Journal of Law and Liberty, and introduces the keynote speaker every year at the sponsored Annual Friedrich A. von Hayek Lecture."}, {"url": "https://www.nndb.com/people/379/000117028/", "page_content": "Richard A. Epstein\n\nAKA Richard Allen Epstein\n\nBorn: 17-Apr-1943\n\nBirthplace: Brooklyn, NY\n\n\n\nGender: Male\n\nRace or Ethnicity: White\n\nSexual orientation: Straight\n\nOccupation: Legal Scholar\n\nNationality: United States\n\nExecutive summary: Takings\n\nWife: Eileen W. Epstein (one daughter, two sons)\n\nDaughter: Melissa\n\nSon: Benjamin\n\nSon: Elliot\n\n\n\nUniversity: BA, Columbia University (1964, summa cum laude)\n\nUniversity: BA Jurisprudence, Oxford University (1966)\n\nLaw School: LLB, Yale Law School (1968, cum laude)\n\nProfessor: University of Southern California Law School (1968-72)\n\nProfessor: Law, University of Chicago Law School (1972-)\n\n\n\nAmerican Academy of Arts and Sciences 1985\n\nFederalist Society\n\nHoover Institution Senior Fellow (2000-)\n\nMont Pelerin Society\n\nPhi Beta Kappa Society\n\nOrder of the Coif\n\nJournal of Legal Studies Editor (1981-91)\n\nJournal of Law and Economics Editor (1991-2001)\n\n\n\nAuthor of books:\n\nModern Products Liability Law ( 1980 )\n\nTakings: Private Property and the Power of Eminent Domain ( 1985 )\n\nForbidden Grounds: The Case Against Employment Discrimination Laws ( 1992 )\n\nBargaining with the State ( 1993 )\n\nSimple Rules for Complex World ( 1995 )\n\nMortal Peril: Our Inalienable Right to Health Care? ( 1997 )\n\nPrinciples for a Free Society: Reconciling Individual Liberty with the Common Good ( 1998 )\n\nTorts ( 1999 )\n\nThe Vote: Bush, Gore & the Supreme Court ( 2001 , with Cass Sunstein)\n\nSkepticism and Freedom: A Modern Case for Classical Liberalism ( 2003 )\n\n\n\n\n\n\n\nRequires Flash 7+ and Javascript.\n\nDo you know something we don't?\n\nSubmit a correction or make a comment about this profile\n\n\n\n\n\n\n\n"}, {"url": "https://www.businessinsider.com/famous-people-jeffery-epstein-money-manager-sexual-trafficking-connected-2019-7", "page_content": "Jeffrey Epstein was known for jet-setting with the likes of billionaires, presidents, and princes.\n\nDocuments show his contacts included investor Leon Black, former CEO Les Wexner, and Prince Andrew.\n\nEpstein died by suicide in jail in 2020, as he awaited trial on charges of sex trafficking minors.\n\nTop editors give you the stories you want — delivered right to your inbox each weekday. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy\n\nFormer L Brands CEO Les Wexner may have been Jeffrey Epstein's only confirmed client, but he was far from the only billionaire paying the convicted sex offender.\n\nEpstein, who pleaded guilty to charges of solicitation of prostitution and procurement of minors for prostitution in Florida in 2007, ran a years-long \"trafficking pyramid scheme\" from the US Virgin Islands, prosecutors alleged in a lawsuit against the former wealth manager's estate in January 2020.\n\nMeanwhile, the convicted sex offender maintained a vast social and professional network both on and off the Islands, which even included the wife of the US Virgin Islands' former governor.\n\nIn October 2020, Wall Street billionaire Leon Black acknowledged to The New York Times through a spokesperson that he hired Epstein as an advisor and paid Epstein at least $50 million in consulting and other fees between 2012 and 2017.\n\nEpstein, a former hedge-fund manager, kept his client list under wraps, but he often bragged of his elite social circle that included presidents and Hollywood stars.\n\n\"I invest in people — be it politics or science,\" Epstein was known to say, New York Magazine reported. \"It's what I do.\"\n\nEpstein, 66, died by suicide in a Manhattan jail on August 10, 2020, as he awaited trial on charges of sex trafficking of minors. He had been in police custody since his arrest on July 6, shortly after exiting his private jet in New Jersey's Teterboro Airport. He pleaded not guilty on July 8 and was being held without bail in New York City, where he was already on suicide watch after an earlier reported suicide attempt that had led to his hospitalization.\n\nHere's what we know about the famous people who crossed paths with Epstein."}, {"url": "https://nymag.com/intelligencer/2019/07/jeffrey-epstein-high-society-contacts.html", "page_content": "Epstein in his townhouse in 2015. Photo: Christopher Anderson for New York Magazine\n\nPerhaps, at long last, a serial rapist and pedophile may be brought to justice, more than a dozen years after he was first charged with crimes that have brutalized countless girls and women. But what won’t change is this: the cesspool of elites, many of them in New York, who allowed Jeffrey Epstein to flourish with impunity. For decades, important, influential, “serious” people attended Epstein’s dinner parties, rode his private jet, and furthered the fiction that he was some kind of genius hedge-fund billionaire. How do we explain why they looked the other way, or flattered Epstein, even as they must have noticed he was often in the company of a young harem? Easy: They got something in exchange from him, whether it was a free ride on that airborne “Lolita Express,” some other form of monetary largesse, entrée into the extravagant celebrity soirées he hosted at his townhouse, or, possibly and harrowingly, a pound or two of female flesh.\n\nIf you watch Fox News, you will believe Bill Clinton was Epstein’s No. 1 pal and enabler. If you watch MSNBC, this scandal is usually all about Donald Trump. In fact, both presidents are guilty (at the very least) of giving Epstein cover and credibility. There are so many unanswered questions about Epstein, but one that looms over all of them is whether the bipartisan crowd who cleared a path for him will cover its tracks before we can get answers — not just Clinton and Trump and all those who drank at Epstein’s trough but also (among others) institutions like Harvard, Dalton, and the Council on Foreign Relations, or lawyers like the New York prosecutor Cy Vance Jr., whose office tried to downgrade Epstein’s sex-offender status; Kenneth Starr, who tried to pressure Republican Justice Department officials to keep the Epstein case from ever being prosecuted; and Alan Dershowitz, who tried to pressure the Pulitzer Prizes to shut out the Miami Herald for its epic investigative reporting that cracked open the case anew.\n\nIn 2015, Gawker published Epstein’s “little black book,” which had surfaced in court proceedings after a former employee took it from Epstein’s home around 2005 and later tried to sell it. He said that the book had been created by people who worked for Epstein and that it contained the names and phone numbers of more than 100 victims, plus hundreds of social contacts. Along with the logs of Epstein’s private plane, released in 2015, the book paints a picture of a man deeply enmeshed in the highest social circles.\n\nCollectively, these documents constitute just a glance at the way society opened itself to Epstein in New York, Hollywood, and Palm Beach. In the weeks since his arrest, we have learned even more about the cliques he traveled in and the way they protected him. Though some observers have likened Epstein’s enigmatic rise as a glamorous social magnet to that of Jay Gatsby, a more appropriate archetype may be the fixer, sexual hedonist, and (ultimately disbarred) lawyer Roy Cohn. In the 1970s and early ’80s, Cohn was a favor broker for boldface chums as various as the top Democratic-machine politicians, the mobster Carmine “Lilo” Galante, Nancy Reagan, the proprietors of Studio 54, the Catholic Archdiocese of New York, Andy Warhol, the publishers Rupert Murdoch and Si Newhouse, Dershowitz, and the ambitious young real-estate developer Donald Trump.\n\nThis project is meant to catalogue how Epstein’s secure footing in elite spheres helped hide his crimes. It includes influential names listed in his black book, people he flew, funded, and schmoozed, along with others whose connections to him have drawn renewed attention. Certainly, not everyone cited here knew of everything he was up to; Malcolm Gladwell told New York, “I don’t remember much except being baffled as to who this Epstein guy was and why we were all on his plane.” Some said they never met Epstein at all, or knew of him only through his ex-girlfriend and alleged accomplice, the socialite Ghislaine Maxwell. Others backed away from him after the scandal. But all of the influential people listed here were attached in some way to Epstein’s world. The sum of their names constitutes a more concrete accounting of Epstein’s power than could any accounting of his disputed wealth. Consider this a pointillist portrait of enablement that all too chillingly overlaps with a significant slice of the Establishment.\n\n—Frank Rich\n\nHis Contacts, A to Z\n\nA guided tour of a perverse power list.\n\nAllen, Woody: Director.\n\nWith Woody Allen and Soon-Yi Previn in 2013. Photo: Elder Ordonez/Elder Ordonez/Splash News\n\nEpstein kept a photo of his friend Allen, the sexual pariah, on his wall and was photographed walking with him on the Upper East Side. They had more than a neighborhood in common. For years before his relationship with Mia Farrow, Allen had carried on with a 16-year-old girl he’d met at Elaine’s named Babi Christina Engelhardt. In an interview with The Hollywood Reporter, she wondered if she was the inspiration for Manhattan, Allen’s 1979 movie about a man in his 40s who dates a high-school student, which was nominated for two Academy Awards. Engelhardt had sex with Allen more than 100 times, she says, sometimes with Farrow. “The whole thing was a game that was being operated solely by Woody so we never quite knew where we stood,” she said. Engelhardt went on to become Epstein’s assistant.\n\nRead More: How a Predator Operated in Plain Sight\n\nAlthorp, Charles: Princess Diana’s brother.\n\nName found in Epstein’s black book.\n\nAndersson-Dubin, Dr. Eva: Doctor and former Miss Sweden.\n\nName found on Epstein’s private jet log.\n\nEpstein’s ex-girlfriend and her husband, billionaire hedge-funder Glenn Dubin, had Epstein over for Thanksgiving dinner in 2009, telling his probation officer they were “100 percent comfortable” with his being around their teenage daughter, Insider reported. She also created a foundation so Epstein could donate to her breast-cancer charity without attaching his name. “The Dubins are horrified by the new allegations against Jeffrey Epstein,” they said in a statement. “Had they been aware of the vile and unspeakable conduct described in these new allegations, they would have cut off all ties and certainly never have allowed their children to be in his presence.”\n\nPrince Andrew, The Duke of York: Looking for a friend.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nWith Prince Andrew in Central Park in 2010. Photo: Jae Donnelly/News Licensing\n\nEpstein and the second son of Queen Elizabeth II have been friends for years and were introduced, it is generally thought, by Brit Ghislaine Maxwell, Epstein’s former girlfriend and longtime aide-de-camp. Epstein has entertained the prince at his townhouse, where he would toss aside regal formalities and refer to him simply, and to English ears heretically, as “Andy.” Prince Andrew has had Epstein and Maxwell to shooting parties at Sandringham House, the queen’s country retreat in Norfolk. Theirs is an unusual alliance, given their stations — the born royal and the Brooklyn boy who made it big — but its disparities may be part of the point. “Jeffrey had Andrew put on a pair of sweatpants for the first time in his life,” a source told Vanity Fair about the two. “It was Jeffrey who taught Andrew how to relax.”\n\nBut their relationship, and their relaxing, took on darker shades as time went on. Andrew stood by Epstein after his release from a 13-month prison sentence and was the star attraction at the party he threw to reenter society. (Katie Couric and George Stephanopoulos also came.) The British press wrung its hands with equal parts pain and glee when it was discovered that Sarah, the perennially indebted Duchess of York — Fergie to her Weight Watchers fans — had accepted £15,000 from Epstein to pay off one of her creditors, a deal brokered by her ex-husband, and that a former employee at Epstein’s Palm Beach manse had alleged in a sworn deposition that the duke was a longtime guest, enjoying massages and naked pool parties. (Prince Andrew denied ever attending, or any awareness of, naked pool parties.) The ongoing affiliation with Epstein likely contributed to the end of Andrew’s duties as a U.K. trade envoy. In 2015, Virginia Roberts Giuffre alleged in a court filing that Andrew was one of the powerful friends to whom Epstein lent her out for sex. Buckingham Palace issued a statement emphatically denying the allegation. She hasn’t pressed her case further in court. But a photograph of the duke with his arm around a 17-year-old Roberts Giuffre, with Maxwell grinning beside them, didn’t help. —Matthew Schneier\n\nAssaf, Vittorio: Restaurateur.\n\nName found in Epstein’s black book.\n\nStarted the Upper East Side institution Serafina.\n\nBand, Doug: Influence peddler.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nA onetime White House intern who climbed his way to being Bill Clinton’s bag carrier, body man, fixer, and all-purpose gatekeeper, Band arranged for the former president to travel to Africa on Epstein’s 727 in 2002. Band would go on to help his boss found the Clinton Global Initiative in 2005, a choice platform from which he launched his own lucrative favor-trading corporate-advisory firm, Teneo. Throughout that time, he took a number of trips on Epstein’s plane and attended parties at his townhouse. Band resigned from his position at CGI in 2012; leaked emails later showed Band and Chelsea Clinton trading accusations of conflicts of interest in a war of influence over her parents. More recently, Band’s been teaching a “Public Service” class at NYU.\n\nRead More: Everything We Know About Jeffrey Epstein’s Upper East Side Mansion\n\nBalazs, André: Celebrity hotelier.\n\nName found in Epstein’s black book.\n\nBaldwin, Alec: Actor.\n\nName found in Epstein’s black book.\n\nDenies knowing Epstein, though he appears in the black book. Recently, Baldwin invited Julie K. Brown, the Miami Herald reporter who resurfaced the Epstein story, to do a podcast.\n\nBannon, Steve: Former White House chief strategist.\n\nIn August 2018, the New York Post reported that Bannon had been seen entering Epstein’s townhouse. Neither Bannon nor Epstein has commented on the substance of their meeting, but when Ivanka Trump condemned Roy Moore’s campaign in Alabama, saying, “There’s a special place in hell for people who prey on children,” Bannon, who backed Moore, responded, “What about the allegations about her dad and that 13-year-old?” It was a clear reference to the woman who had accused Donald Trump and Epstein of raping her when she was 13.\n\nBarr, Donald: The headmaster who offered entrée.\n\nIn the 1975 Dalton School yearbook. Photo: The Dalton School\n\nBarr was ousted shortly before Epstein, 21 and without a college degree, showed up for his first day of work teaching math and physics at the Manhattan’s elite Dalton School in the early 1970s. Barr announced his resignation soon after, in February 1974: “He was disliked by the faculty, he was highly controversial, he hadn’t raised much money, he was very conservative,” said the board’s chairman. Barr’s leadership style was described as “authoritarian” and “undemocratic” at the time. Memorably, several former students told the New York Times that Epstein was overly familiar with teenage girls at the school. Donald’s son William would intersect with Epstein’s orbit while serving as a counsel at Kirkland and Ellis in 2009. The law firm secured Epstein his obscenely lenient 2007 non-prosecution deal, which the Justice Department is now reviewing. In July, Barr the son refused to recuse himself from the ongoing Epstein investigation.\n\nBarrack, Tom: Trump adviser and private-equity manager.\n\nName found in Epstein’s black book.\n\nIn Fire and Fury, Michael Wolff wrote that Trump, Epstein, and Barrack were a “set of nightlife musketeers” in the ’80s and ’90s.\n\nBerger, Sandy: National-security adviser for Bill Clinton.\n\nName found on Epstein’s private jet log.\n\nBerggruen, Nicolas: Billionaire investor.\n\nName found in Epstein’s black book.\n\nBerkman, Bill: New York businessman.\n\nNames found in Epstein’s black book.\n\nA wealthy executive whose family established the Berkman Klein Center for Internet & Society at Harvard, Berkman was sued in 2014 by his administrative assistant, who said she was forced to read emails Berkman had sent to a colleague containing “pictures of random and unsuspecting women on the street” — that is, creepshots. (The suit was settled.)\n\nBirley, Robin: Nightclub impresario.\n\nName found in Epstein’s black book.\n\n﻿Owned the club where Meghan Markle and Prince Harry had their first date.\n\nBismarck, Debonnaire von: Countess.\n\nName found in Epstein’s black book.\n\nListed as Debbie in the black book.\n\nBismarck, Leopold von: Count.\n\nName found in Epstein’s black book.\n\nYes, those von Bismarcks. His nickname, Bola, was listed in the black book.\n\nBismarck, Vanessa von: Heiress and publishing entrepreneur.\n\nName found in Epstein’s black book.\n\nBlack, Conrad: Media mogul.\n\nName found in Epstein’s black book.\n\nHe’s perhaps best known for being sentenced to 42 months in prison for fraud, then writing a book about Trump and receiving a pardon. Vicky Ward, who profiled Epstein for Vanity Fair in 2003, said Epstein heavily leaned on Black, who is her ex-husband’s uncle (and was her ex-husband’s then-boss), to try to exert his influence on Ward.\n\nBlack, Leon: Private-equity tycoon.\n\nName found in Epstein’s black book.\n\nThe billionaire co-founder of Apollo Global Management and chairman of MoMA, Black made Epstein the director of his family foundation in 2001. The foundation continued to list Epstein as director on its tax forms until 2012, four years after he had pleaded guilty to soliciting a minor for prostitution in Florida. The foundation now says that Epstein resigned in 2007 and that his name continued to appear on its rolls owing to a “recording error.” In 2011, he was listed as an investor in Environmental Solutions Worldwide, a Pennsylvania company, alongside several people close to Black, including his four children. Black himself was seen with Epstein at a movie screening just a few months after Epstein finished probation in 2010, and Epstein was spotted at a party at Black’s home in the Hamptons as recently as 2015.\n\nBlack, Roy: An Epstein lawyer.\n\nThe trial attorney and legal analyst’s client roster has included Justin Bieber, Girls Gone Wild creator Joe Francis, and Rush Limbaugh. Black is perhaps best known for representing William Kennedy Smith against rape charges in Palm Beach in 1991. (The Kennedy nephew was acquitted.) In 2005, Black played the “managing partner” on NBC’s The Law Firm, a knockoff of The Apprentice for up-and-coming lawyers.\n\nBlaine, David: Magician.\n\nName found in Epstein’s black book.\n\nBlaine put on a private show for Epstein’s dinner guests in 2003, doing card tricks for the likes of Sergey Brin, Mort Zuckerman, and Bill Clinton aide Doug Band. The dinner was organized by Ghislaine Maxwell and included a group of young women who were introduced as Victoria’s Secret models.\n\nBlair, Tony: Former British prime minister.\n\nName found in Epstein’s black book.\n\nBloomberg, Michael: Billionaire, private-jet enthusiast, former mayor.\n\nName found in Epstein’s black book.\n\nBolkiah, Hassanal: Sultan of Brunei.\n\nEpstein had at least one meeting with the sultan when he traveled to Brunei in 2002 with Bill Clinton. Bolkiah and his brother are famous for their lavish spending, including a collection of 2,500 cars and a $1.5 billion palace. Bolkiah was once sued by Miss USA 1997, who claimed she had been held as a sex slave. The suit was dismissed on the grounds that Bolkiah had sovereign immunity.\n\nBond, Annabelle: British socialite.\n\nName found in Epstein’s black book.\n\nBonomi, Andrea: Italian businessman.\n\nName found in Epstein’s black book.\n\nThe chairman and founder of Investindustrial was a key character in the Paradise Papers international tax-shelter scandal.\n\nBorrico, Michael: Long Island contractor.\n\nName found in Epstein’s black book.\n\nDescribed by Social Life magazine as the “ambassador of the all-important Hamptons polo culture,” Borrico is known for hosting polo matches at his estate in Water Mill.\n\nBourke, Frederic: A founder of Dooney & Bourke.\n\nName found in Epstein’s black book.\n\nBourke went to prison for a scheme to bribe government officials in Azerbaijan.\n\nBowles, Hamish: European editor-at-large for Vogue.\n\nName found in Epstein’s black book.\n\nBrandolini, Muriel: Interior designer.\n\nName found in Epstein’s black book.\n\nHer clients have included Matt Lauer and the Crown Prince and Princess of Greece.\n\nBranson, Richard: Founder of Virgin Group.\n\nName found in Epstein’s black book.\n\nLike Epstein, Branson enjoys entertaining on a private island.\n\nBriatore, Flavio: Italian millionaire businessman.\n\nName found in Epstein’s black book.\n\nA friend of Trump, a convicted card cheat, and an accused Formula 1 race fixer, Briatore was a longtime fugitive in the Virgin Islands.\n\nBrockman, John: Agent for scientific “freethinkers.”\n\nName found on Epstein’s private jet log.\n\nFrom left, John Brockman, Steven Pinker, Daniel Dennett, Katinka Matson, and Richard Dawkins flying to a TED conference in 2002 aboard Epstein's plane, pictured below Photo: Dailymail.com. From left, John Brockman, Steven Pinker, Daniel Dennett, Katinka Matson, and Richard Dawkins flying to a TED conference in 2002 aboard Epstein's plane... more From left, John Brockman, Steven Pinker, Daniel Dennett, Katinka Matson, and Richard Dawkins flying to a TED conference in 2002 aboard Epstein's plane, pictured below Photo: Dailymail.com.\n\nWhat seems new, in flipping through the reams of society photos of perhaps the world’s most prolific sexual predator that have been circulating over the past few weeks, is not the powerful and the beautiful who surrounded Epstein, but the intellectuals — the Richard Dawkinses, the Daniel Dennetts, the Steven Pinkers. All men, of course. But the group selfies probably shouldn’t have been a surprise — documents of an age in which every millionaire doesn’t just fancy himself a philosopher-king but expects to be treated as such, and every public intellectual wants to be seen as a kind of celebrity.\n\nCultural shifts like these require visionaries, networkers, salespeople. Brockman is one. A Warhol Factory kid turned freelance philosopher of science turned literary agent to Dawkins and Dennett and Pinker (and many others), in the 1980s he formed a casual salon of like-minded scientists and futurists that came to be known as the Reality Club, a knock against the poststructuralism then dominant in the academy. In the 1990s, he rebranded it as the Edge Foundation, an organization whose central event was an annual online symposium devoted to a single, broad question. In 2000, it was “What is today’s most important underreported story?” In 2006, “What is your dangerous idea?”\n\nEpstein was a regular contributor, and his plane — to judge from the photographs, at least — was an especially appealing way for other contributors to get to ted. They could also catch Epstein at Harvard, where so many of them taught and where he became so prolific a donor that one whole academic program seemed to be run like his private Renaissance ateliers. Epstein had long described himself as a “scientific philanthropist,” and in a press release put out by the Jeffrey Epstein VI Foundation announcing its “substantial backing” of Edge, he called it “the world’s smartest think tank.”\n\nMany in Brockman’s Edge community are, or were, inarguably significant figures in the American intellectual Establishment: Freeman Dyson, Jared Diamond, Craig Venter, John Horgan, Paul Bloom (to name a random but representative sample). They are also among the gods and heroes of the Trump-era internet community of “freethinkers,” whom Eric Weinstein, the venture capitalist and regular Edge contributor, memorably called “the intellectual dark web.” The name suggests a self-glamorizing style of dangerous discourse, and as soon as the community was identified, it was criticized as revanchist, an effort to reopen areas of intellectual inquiry — about innate differences between the races, say, or the genders — now considered problematic, at a minimum. But to listen to the IDW warriors themselves — talking about the “war on free speech” as though their universities had sent assassins their way rather than tenured chairs — their crusade seems motivated just as much by a thin-skinned sense of their own world-historical significance. They were special people, deserving of special acclaim and, of course, special privileges.\n\nMany contributions to Edge were plausibly the products of genuinely special minds. Epstein’s were not. In 2008, the year he went to jail for prostitution, the prompt was “What have you changed your mind about?” Epstein replied, “The question presupposes a well defined ‘you’ and an implied ability that is under ‘your’ control to change your ‘mind.’ The ‘you’ I now believe is distributed amongst others (family friends, in hierarchal structures), i.e. suicide bombers, believe their sacrifice is for the other parts of their ‘you.’ The question carries with it an intention that I believe is out of one’s control. My mind changed as a result of its interaction with its environment. Why? Because it is a part of it.”\n\n“Jeffrey has the mind of a physicist,” the Harvard professor Martin Nowak has said, incredibly. But what he really did have was the life of a very rich person — unable to see any world he felt unqualified to enter and surrounded by too many people enamored with his money to ever hear the word no. —David Wallace-Wells\n\nBronfman Jr., Edgar: Executive.\n\nName found in Epstein’s black book.\n\nThe former Warner Music Group CEO, son of the late Seagram’s CEO Edgar Bronfman Sr., is related to the NXIVM-sex-cult Bronfmans. His son has a child with pop star M.I.A.\n\nBrunel, Jean-Luc: Model scout.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nBrunel was accused in court testimony of having used his agency to supply Epstein with girls. (He was not charged.) He also has a long history of allegations that he had abused his fashion-world position. In 1988, he was the subject of a 60 Minutes investigation alleging that he and a fellow agent sexually assaulted nearly two dozen models. He denied the claims but later told Model author Michael Gross, “You get laid tonight with a model, is that a crime?” In 2005, Brunel co-founded the Mc2 modeling agency; Epstein invested $1 million, according to a 2010 deposition.\n\nBuck, Joan Juliet: Fashion editor.\n\nName found in Epstein’s black book.\n\nIn 2003, Buck met Maxwell at a fashion party at a New York City boutique. Buck had recently moved on from her seven-year tenure as the editor of Paris Vogue and was writing for its American counterpart and living in New Mexico. She was a lifelong resident of a rarefied social world. Maxwell, a regular on that particular circuit, quickly made a connection. “Oh, Jeffrey’s got a ranch in Santa Fe, blah blah blah,” Buck recently remembered their conversation going. She gave Maxwell her Santa Fe number and later asked a friend about Epstein and New Mexico. “His ranch?” the friend replied. “As we say in Texas, all hat, no cattle.”\n\nBurkle, Ron: Supermarket magnate.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nBurkle took what were described as humanitarian trips to Africa with Bill Clinton on Epstein’s private Boeing 727. According to a 2008 Vanity Fair feature about the former president, “Burkle’s usual means of transport is the custom-converted Boeing 757 that Clinton calls ‘Ron Air’ and that Burkle’s own circle of young aides privately refer to as ‘Air Fuck One.’ ”\n\nBushnell, Candace: Columnist who inspired Sex and the City.\n\nName found in Epstein’s black book.\n\nBusson, Arpad: French financier.\n\nName found in Epstein’s black book.\n\nDuring a custody battle with ex Uma Thurman, her lawyer asked Busson, a prominent hedge-funder, if he had ever said he was “addicted to prostitutes.” (He said no.)\n\nCalacanis, Jason: Businessman.\n\nName found in Epstein’s black book.\n\nAn investor in Uber, Calacanis was a fixture in the early-aughts New York tech scene as the founder and editor of Silicon Alley Reporter. (“I can’t tell you how many propositions I get, it’s absolutely insane,” he told the Observer in 2000.) In 2014, Vice awarded him Most Offensive Tweet of the Year for describing as racist the idea of white privilege.\n\nCaledon, Nicky: Earl.\n\nName found in Epstein’s black book.\n\nCampbell, Naomi: Supermodel.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nCandy, Nicholas and Christian: British property-developer brothers.\n\nName found in Epstein’s black book.\n\nCarter, Graydon: Former editor of Vanity Fair.\n\nAccording to journalist Vicky Ward, he killed portions of a 2003 story that accused Epstein of pedophilia after an office visit from Epstein. (Carter says there wasn’t enough on-the-record sourcing.) “I didn’t invent the system. I just lived by the system,” he said when The New York Times Magazine questioned him about the story last week.\n\nCecil, Aurelia: PR chairman.\n\nName found in Epstein’s black book.\n\nAllegedly the former girlfriend of Prince Andrew.\n\nCecil, Mark: Hedge-funder.\n\nName found in Epstein’s black book.\n\nHas hosted Prince William and Kate Middleton at his villa in Mustique.\n\nChatwal, Vikram: Hotelier.\n\nName found in Epstein’s black book.\n\nWhen the 1990s playboy settled down, Bill Clinton attended his wedding. In 2017, Chatwal pleaded guilty to a misdemeanor violation after being accused of trying to set a pair of dogs on fire on a Soho street.\n\nCipriani, Giuseppe: Restaurant magnate.\n\nName found in Epstein’s black book.\n\nThe scene-y Cipriani Italian spots are known for inventing the Bellini cocktail — and more infamously for being Harvey Weinstein’s “hunting ground.”\n\nCisneros, Gustavo: Venezuelan billionaire.\n\nName found in Epstein’s black book.\n\nThe patriarch of a family so wealthy it operates practically as its own nation-state in Latin America.\n\nJeffrey Epstein in his townhouse in 2015. Photo: Christopher Anderson for New York Magazine\n\nClinton, Bill: President and problem.\n\nName found on Epstein’s private jet log.\n\nAs soon as the Epstein news broke two weeks ago, the taunting and tallying began, suffocating in its familiarity. First were the jeering reminders, as if we didn’t know it in our every molecule: It wasn’t just Donald Trump who’d be ensnared in this stygian nightmare of underage sexual assault and trafficking of girls, it was Bill Clinton, who’d been a friend and repeat flier on Epstein’s plane. Then came the numbers, the attempts to quantify the nature of the Clinton-Epstein relationship. Clinton issued a statement toting up four plane trips, one Epstein meeting in Clinton’s Harlem office, one visit to Epstein’s home, and zero trips to his island. Meanwhile, reporters recalled that Gawker’s published flight logs had tallied 12 separate plane legs and that Epstein had more than 20 numbers and email addresses for Clinton and one signed photo of him in his home, along with one of Woody Allen and one of Mohammed bin Salman, the Crown Prince of Saudi Arabia.\n\nAll of this was presented as if these numbers could clarify some exact science of guilt or complicity. The reality is: Yes, Clinton was grimy and had grimy friends, and, more broadly, this is how powerful men have behaved toward women and one another. Yes, we know it’s dirty and mean and exhausting and true.\n\nWe know, of course, because the shadow of Clinton’s sexual history and his associations with other men who have terrible legacies of sexually inappropriate-to-criminal behavior have for decades hung like a greasy and unscrubbable film over the Democratic Party he once led. Clinton palled around not just with Epstein but with Charlie Rose and Harvey Weinstein and Trump himself.\n\nThey hung out together and flew together and went to each other’s offices and visited each other’s homes and appeared on each other’s TV shows and had each other’s phone numbers and attended each other’s weddings and created a circle of money and protection. The prosecutorial and defensive math — the haggling over flights and phone numbers — is just used to complicate this basic reality.\n\nThose on the left have been going over how we’re supposed to feel about him for decades, but in the arguing about it, we have been asked to focus again and again on Clinton and his dick and what he did or didn’t do with it. The questions we’ve asked ourselves and one another have become defining.\n\nAre we morally compromised in our defense of him or sexually uptight in our condemnation? Are we shills for having not believed he should have resigned, or doing the bidding of a vindictive right wing if we say that, in retrospect, he probably should have?\n\nMeanwhile, how much energy and time have been spent circling round this man and how we’ve felt about him, when in fact his behaviors were symptomatic of far broader and more damaging assumptions about men, power, and access to — as Trump has so memorably voiced it — pussies?\n\nAfter all, Clinton was elected president during a period that may turn out to be an aberration, just as the kinds of dominating, sexually aggressive behaviors that had been norms for his West Wing predecessors had become officially unacceptable, and 24 years before those behaviors would again become a presidential norm. So yes, Clinton got in trouble, yet still managed to sail out of office beloved by many, his reputation as the Big Dog mostly only enhanced by revelations of his exploits.\n\nBut the election of Trump over Clinton’s wife, and the broad conversation around sexual assault and harassment that has erupted in its wake, has recast his behavior more profoundly. The buffoonery, the smallness and tantrums of Trump, has helped make clear what always should have been: that the out-of-control behavior toward women by powerful men, the lack of self-control or amount of self-regard that undergirded their reckless treatment of women, spoke not of virility or authority but of their immaturity. And the people who have paid the biggest price for these men’s fixation on sex as a measure of manhood have, of course, not been the men themselves.\n\nIn Clinton’s case, it has been Monica Lewinsky, whose life and name became defined by her relationship to him. It has been his wife, Hillary, who, in addition to having been celebrated and pilloried for her defense of her husband, also had to conduct one of her three historic presidential debates with women who’d accused him of sexual misconduct sitting in the audience, invited there by her opponent as props to unsettle and disempower her. It has been decades of left feminist women who have had Clinton’s misdeeds thrown in our faces as proof of our own hypocrisy.\n\nI try sometimes to imagine a contemporary Democratic Party without Bill Clinton in its recent past — yes, of course, from a policy perspective, but also simply from a personal one. What if so much energy had not been eaten up by his colleagues, by his wife, by feminists, by his supporters and friends and critics, all of whom had to dance around him, explain their associations with him, or carefully lay out their objections to him without coming off as frigid reactionaries?\n\nWhat else might we have done with our politics had we not been worrying about Clinton and his grubby buddies? What further power have they taken from us? —Rebecca Traister\n\nClinton, Chelsea: First Daughter.\n\nGhislaine Maxwell attended her wedding after Epstein had first been charged. This was shortly after she skipped a deposition for the Epstein case, claiming she needed to return to the U.K. to be with her deathly ill mother.\n\nColeridge, Nicholas: Chairman of Condé Nast Britain.\n\nName found in Epstein’s black book.\n\nCollins, Phil: Musician.\n\nName found in Epstein’s black book.\n\nCopperfield, David: Magician.\n\nAccording to a message-pad entry dated January 27, 2005, at 3:55 p.m., Copperfield rang Epstein’s line while he was out. The handwritten entry reads, “Magic David called.”\n\nCouric, Katie: Journalist.\n\nAmong those who attended a dinner at Epstein’s townhouse for Prince Andrew in 2010.\n\nCosby, Bill: Comedian, convicted rapist.\n\nLived across the street from Epstein in Manhattan.\n\nd’Arenberg, Prince Pierre: Royal.\n\nName found in Epstein’s black book.\n\nAmericans often imagine aristocrats floating on a cloud of above-it-all wealth, but even real-life princes, this one descended from a German royal family that long ago united with the most influential and wealthiest family of the Hapsburg Netherlands, could get something out of a relationship with a font of new American money like Epstein.\n\nde Broglie, Louis Albert: Political scion, founder of luxury garden brand.\n\nName found in Epstein’s black book.\n\nde Carvalho-heineken, Charlene: Heiress.\n\nName found in Epstein’s black book.\n\nde Crussol, Jacques: 17th Duke of Uzès.\n\nName found in Epstein’s black book.\n\nCuomo, Andrew: Governor of New York.\n\nName found in Epstein’s black book.\n\nDahl, Sophie: Former model, granddaughter of Roald Dahl.\n\nName found in Epstein’s black book.\n\nde Rothschild, Lynn Forester: De Rothschild!\n\nName found on Epstein’s private jet log.\n\nDershowitz, Alan: Lawyer who stands accused.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nWith Alan Dershowitz at Harvard in 2004. Photo: Rick Friedman/Polaris\n\nFor around a decade, Dershowitz kept casual company with Epstein, who introduced him to his friends, like Ghislaine Maxwell and Prince Andrew.\n\n(Dershowitz says he and the prince ended up not getting along because they disagreed about Israel.) Dershowitz visited Epstein’s mansions in New York and Palm Beach and occasionally accompanied him on his private plane. He says these trips were family oriented. Once, Epstein lent him the Palm Beach home so he could attend a granddaughter’s soccer tournament. Another time, he and his nephew flew down to watch a space launch with another Epstein connection, a top NASA official. He and his wife, Carolyn Cohen, once stayed with Epstein on his island in the Caribbean, where they were joined by another Harvard professor and his family.\n\nWhen Epstein first started to attract media attention in the early aughts, mainly because of his friendship with former president Bill Clinton, Dershowitz served as a character witness for the reclusive financier.\n\nHe told Vanity Fair that he shared manuscripts of his books with Epstein before they were published and swore that his money was irrelevant. “I would be as interested in him as a friend if we had hamburgers on the boardwalk in Coney Island and talked about his ideas,” he told the magazine.\n\nBut Dershowitz says their interactions changed in 2005, when Epstein faced a local police investigation into his relations with underage girls in Palm Beach and he hired Dershowitz as a lawyer. With his assistance, Epstein was able to whittle down the state’s indictment against him to a single count of soliciting prostitution. But in the years to come, as Epstein’s legal problems compounded, they would eventually ensnare Dershowitz himself. He is also accused of having sex with two of Epstein’s alleged victims. “The stories are so phantasmological,” Dershowitz says. He recognizes that the #MeToo movement has surfaced countless accounts of preposterous-sounding sexual misbehavior by powerful men and almost all of them have turned out to be true. But Dershowitz swears he is different. “Mine is the only case, singular, the only one, where I never met the people,” he says. “There’s no evidence we’ve ever met, no evidence we were ever in the same place at the same time, ever.”\n\nToday, Dershowitz claims he and Epstein were never really even friends, despite their proximity. “He was an acquaintance,” he says. “In retrospect, I wish I hadn’t taken the case, but I didn’t see a problem with taking the case. We didn’t have a close personal relationship.” —Andrew Rice\n\nRead More: Alan Dershowitz Cannot Stop Talking\n\nDickinson, Janice: Model, actress, TV personality.\n\nName found in Epstein’s black book.\n\nDiniz, Pedro: Agroforester, businessman, former Formula 1 racing driver.\n\nName found in Epstein’s black book.\n\nDriver, Minnie: Actress.\n\nName found in Epstein’s black book.\n\nDunbar-Johnson, Stephen: President, international, of the New York Times Company.\n\nName found in Epstein’s black book.\n\nDunne, Griffin: Director.\n\nName found in Epstein’s black book.\n\nJoan Didion’s nephew and a Martin Scorsese leading man.\n\nEdelman, Gerald: Nobel Prize winner.\n\nEdelman received funding from the Jeffrey Epstein VI Foundation. “Jeff is extraordinary in his ability to pick up on quantitative relations,” he told New York in 2002. “He came to see us recently. He is concerned with this basic question: Is it true that the brain is not a computer? He is very quick.”\n\nEllenbogen, Eric: Former CEO of Marvel Enterprises.\n\nName found in Epstein’s black book.\n\nEstrada, Christina: Model.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nEx-wife of the late Walid Juffali, billionaire chairman of the largest privately owned enterprise in Saudi Arabia.\n\nFekkai, Frédéric: Celebrity hairstylist.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nFekkai’s expensive salons are up and down the Upper East Side and in Palm Beach, and he’s known for butter blondes, layered bobs, and participating in the polishing up of Hillary Clinton. Epstein’s assistants were given house accounts for blowouts, waxing, nails, highlights, the works.\n\nFerguson, Sarah: Duchess of York.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nEpstein loaned Prince Andrew’s then-wife $18,000 to pay off some debts. “I personally, on behalf of myself, deeply regret that Jeffrey Epstein became involved in any way with me,” Ferguson told the Telegraph in 2011. “I abhor paedophilia.”\n\nFiennes, Ralph: Actor, producer, director.\n\nName found in Epstein’s black book.\n\nFisher, Paula Heil: Opera producer.\n\nEpstein’s former girlfriend met him through Bear Stearns, where she was once an associate.\n\nForbes, Steve: Chairman and editor-in-chief of Forbes magazine.\n\nName found in Epstein’s black book.\n\nFord, Tom: Designer.\n\nName found in Epstein’s black book.\n\nGell-Mann, Murray: Physicist.\n\nName found in Epstein’s black book.\n\nIn 1969, Gell-Mann won the Nobel Prize. In 2003, he told Vanity Fair, “ ‘There are always pretty ladies around’ when he goes to dinner chez Epstein.”\n\nGetty, Mark: Co-founder and chairman of Getty Images.\n\nName found in Epstein’s black book.\n\nGinsberg, Gary: Communications pooh-bah.\n\nName found in Epstein’s black book.\n\nOnce a lawyer in the Clinton White House, Ginsberg joined George, then News Corp., then Time Warner. He has also done pro bono speechwriting for Benjamin Netanyahu and now works for SoftBank, a Japanese investment company with close ties to the Saudi government.\n\nGladwell, Malcolm: Writer.\n\n“I was invited to the TED conference in maybe 2000 (I can’t remember), and they promised to buy me a plane ticket to California,” Gladwell says now. “Then at the last minute they said, ‘We found you a ride on a private plane instead.’ As I recall, there were maybe two dozen TED conferencegoers onboard. I don’t remember much else, except being slightly baffled as to who this Epstein guy was and why we were all on his plane.”\n\nGoldsmith, Gerald: Rothschild North America.\n\nName found in Epstein’s black book.\n\nGreenberg, Ace: Bear Stearns chairman, Epstein’s first patron.\n\nJeffrey Epstein didn’t have any formal training when he started working at Bear Stearns in 1976, but that wouldn’t have mattered to then-CEO Alan “Ace” Greenberg, who famously hired “PSD degrees,” short for “poor, smart, with a deep desire to be rich.” As it happened, Epstein was all three. He came from a modest Coney Island background, had no college degree, and worked a job — as a math teacher at Dalton and a tutor to Greenberg’s son — that was unlikely to support his tastes, which were apparently of the private islands–and–gilded desk–purportedly–belonging–to–J. P. Morgan variety. At Bear Stearns, Epstein made a name for himself in the “special-products division,” essentially figuring out how to help the rich pay less taxes. “He would recommend certain tax-advantageous transactions,” Greenberg’s protégé, James “Jimmy” Cayne, told New York in 2002. Cayne, who succeeded Greenberg in 1993, seems to have become the closer party to Epstein, whose mysterious departure from the firm he publicly defended decades after Epstein’s departure. “Jeffrey said specifically, ‘I don’t want to work for anybody else. I want to work for myself,’ ” Cayne insisted, despite transcripts from an SEC deposition that suggest other concerns around them both. It’s easier to imagine Cayne, a cigar-chomping, archetypal fat cat who was infamously off playing bridge when Bear Stearns collapsed in 2008, as a member of Epstein’s inner circle than his mentor, a folksy, bow-tie-wearing soul who referred to his successor as “crude,” “full of himself,” and “warped” in a memoir published shortly before his death. At the very least, it seems Cayne and Epstein were both capable of, ah, massaging the truth. —Jessica Pressler\n\nGuest, Cornelia: Socialite.\n\nName found in Epstein’s black book.\n\nShe was dubbed “debutante of the decade” in 1986.\n\nGutfreund, John: CEO of Salomon Brothers.\n\nName found in Epstein’s black book.\n\nHamilton, George: Actor.\n\nName found in Epstein’s black book.\n\nThe overtanned C-lister that Hollywood turns to when casting any vaguely and/or mysteriously aristocratic cameo role.\n\nHandler, Chelsea: Comedian.\n\nAttended a dinner at Epstein’s townhouse for Prince Andrew in 2010. “It was just one of those strange nights,” she later said.\n\nHaskell, Nikki: Socialite.\n\nEpstein dated Haskell, one of Donald Trump’s closest friends. “Jeffrey didn’t talk about his past, although he claimed to have been a concert pianist,” Haskell told the Daily Mail in 1992. “He told me he was a spy hired by corporations to find major amounts of money which had been embezzled.”\n\nHawking, Stephen: Physicist.\n\nIn 2006, the world’s most famous brain visited Little St. James, Epstein’s private island, which came to be known as “Pedophile Island.” Hawking, who was in the Caribbean for a conference, was photographed at a barbecue on the island and aboard a submarine for a tour. According to the Telegraph, “Epstein is said to have paid for the submarine to be modified for Professor Hawking, who had never been underwater before.”\n\nRead More: Everything We Know About Jeffrey Epstein’s Private ‘Pedophile Island’\n\nHoffenberg, Steven: A mentor and a con man.\n\nBefore Bernie Madoff, there was Hoffenberg, who in 1985 pleaded guilty to cheating investors out of $460 million — at the time, the largest Ponzi scheme ever. He was sentenced to 20 years in prison and, after his release in 2013, began sounding the alarm on Epstein, who had worked at Hoffenberg’s Towers Financial Corporation after leaving Bear Stearns. He claimed that Epstein had been his co-conspirator in the scheme and that Epstein’s fortune was built on Towers Financial’s fraud. “He was great at moving money illegally,” Hoffenberg says. “He was the deeper architect to getting things accomplished.”\n\nHoffenberg claims he was introduced to Epstein by Douglas Leese, a mysterious British arms dealer, and that he paid Epstein $25,000 a month as Towers Financial began making risky plays to take over companies like Pan American World Airways and Emery Air Freight. Advisers on the Pan Am deal included Richard Nixon’s attorney general John Mitchell, Nixon’s brother Edward, and John Lehman, a former secretary of the Navy. The move fell apart after the Lockerbie bombing, and when Towers Financial later went belly-up, Hoffenberg says, the two of them engineered a Ponzi scheme to fill the hole.\n\n“He has a magnificent personality,” Hoffenberg says. “He’s very easy to interact with, very social, very easy to bond with, an unusually nice person. And he’s pretty dynamic on financial savvy. He could move money in different areas to get the stock prices to go up and down.”\n\nHoffenberg still owes his victims some $1 billion in restitution, and in 2016 he sued Epstein to recover some of the money. (He eventually dropped the suit.) Last year, two victims brought a suit against Epstein making the same claims as Hoffenberg but voluntarily dismissed the suit two months later.\n\n“You’re about to see an entire story about this supposed billionaire and the story about his financial empire, which is as big as the tragedy with the girls,” Hoffenberg says. “It’s billions of dollars, and it’s a fiasco.” —James D. Walsh\n\nHoffman, Dustin: Actor.\n\nName found in Epstein’s black book.\n\nHurley, Elizabeth: Actress.\n\nName found in Epstein’s black book.\n\nHutton, Lauren: Model and actress.\n\nName found in Epstein’s black book.\n\nIsaacson, Walter: Former editor of Time.\n\nName found in Epstein’s black book.\n\nThe onetime journalist is now an emeritus figure in the TED universe thanks to his role at the Aspen Institute and his widely worshipped biography of Steve Jobs.\n\nJagger, Mick: Musician.\n\nName found in Epstein’s black book.\n\nJarecki, Andrew: Filmmaker.\n\nName found in Epstein’s black book.\n\nThe director of the documentaries Capturing the Friedmans, about an accused pedophile, and The Jinx, which profiled Robert Durst, the madman at the center of another New York fortune.\n\nJarecki, Henry: Billionaire.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nOnce a psychiatrist, Henry, Andrew’s father, made his fortune in gold and silver speculation.\n\nJohnson, Elizabeth: Heiress.\n\nName found on Epstein’s private jet log.\n\nEpstein was a co-trustee on 14 parcels of land the Johnson & Johnson heiress owned in Dutchess County, New York. He resigned as a trustee for Johnson’s revocable trust at the end of 1998.\n\nJohnson, Richard: Gossip journalist for “Page Six.”\n\nName found in Epstein’s black book.\n\nKellen, Sarah: An alleged enabler on a staff of them.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nIn a world where most women still work for men, and where their jobs are overwhelmingly in the “service” or “caring” professions, it should surprise no one that Epstein’s procurers, schedulers, fixers, and enablers were female.\n\nFour women — Sarah Kellen, Nadia Marcinkova, Adriana Ross, and Lesley Groff — were identified in the 2007 Florida case against Epstein as possible co-conspirators, though none was charged.\n\nAmong public figures named in the black book are over 100 listings for “massages”: female names divided by location and descriptors like “big-boned,” “red head,” or “speaks NO English.”\n\nHistory is full of the self-serving enabling of men by women, ending with the Trump court but not starting there. Was it money? Probably. The word is that Epstein paid his “executive assistants” $200,000 a year and let them order takeout from Le Cirque. When Groff had a baby, Epstein gave her a Mercedes and paid for a full-time nanny. “There is no way I could lose Lesley to motherhood,” he told the New York Times in 2005 (for a front-page story on the indispensability of good help for Wall Street tycoons).\n\nMarcinkova, referred to in court documents as Epstein’s “sex slave,” hails from the former Yugoslavia; Ross, a model, is from Poland. Kellen (who has since married a NASCAR driver) was a scheduler, making sure that Epstein always had a slate full of girls, and it was she who sometimes walked the girls up the stairs in the Florida mansion and laid the oils out on the massage table. Marcinkova would have sex with the girls for Epstein’s viewing pleasure and sometimes all together. Groff booked travel, and Ross also helped with the calendar. After the Miami Herald published its investigation in 2018, Epstein wired the “possible co-conspirators” $250,000 and $100,000, respectively, prosecutors say, to buy their silence. Since then, none of them have been reached for comment. —Lisa Miller\n\nKennedy, Ethel: Human-rights advocate.\n\nName found in Epstein’s black book.\n\nWidow of Robert Kennedy.\n\nKennedy, Ted: Senator.\n\nName found in Epstein’s black book.\n\nEpstein had his home number.\n\nKent, Geoffrey: High-end safari entrepreneur.\n\nName found in Epstein’s black book.\n\nKerry, John: Secretary of State.\n\nName found in Epstein’s black book.\n\nThe seven numbers listed for Kerry in Epstein’s address book include the direct line to his presidential campaign.\n\nKhashoggi, Adnan: Saudi Arabian man of mystery.\n\nTo bolster their argument that private-jet owner Epstein is a massive flight risk, SDNY prosecutors produced an expired Austrian passport under an alias that listed Saudi Arabia as Epstein’s primary country of residence. His lawyers claim the fake ID was for the “personal protection” of “an affluent member of the Jewish faith” traveling in the Middle East, but it could also point to one of his more secretive income sources.\n\nAccording to his former friend the journalist Jesse Kornbluth, in the mid-1980s Epstein said he “worked for governments to recover money looted by African dictators” and occasionally subcontracted to those same autocrats to “help them hide their stolen money.” A source who spoke with journalist Vicky Ward said one of Epstein’s clients was the late Saudi arms dealer Khashoggi, a middleman in the Iran-Contra scandal who helped smuggle cash for the Marcos family out of the Philippines. In 1988, Khashoggi was arrested in Switzerland for concealing assets and later faced fraud and racketeering charges in the U.S. (He was later acquitted.) That year, he sold his 282-foot yacht to the Sultan of Brunei, who soon flipped it to Donald Trump. —Matt Stieb\n\nKissinger, Henry: Secretary of State and national-security adviser.\n\nName found in Epstein’s black book.\n\nOne of the century’s most notorious practitioners of cutthroat realpolitik, Kissinger served on the Council on Foreign Relations with Epstein.\n\nKissinger, Nancy: Philanthropist.\n\nEpstein and Kissinger served on the Rockefeller University board alongside Nobel laureate Joseph Goldstein, socialite Brooke Astor, and Texas billionaire Robert Bass.\n\nKleman, Leah: Art dealer.\n\nShe told Vanity Fair in 2003 that Epstein lived like a “modern maharaja” and described his haggling over art prices as “something like a scene out of the movie Mad Max: Beyond Thunderdome.”\n\nKoch, David: Plutocrat.\n\nName found in Epstein’s black book.\n\nKosslyn, Stephen: Harvard psychologist.\n\nName found in Epstein’s black book.\n\n“He is amazing,” Kosslyn said of Epstein in a 2002 New York profile. “Like a honeybee — he talks to all these different people and cross-pollinates. Just two months ago, I was talking to him about a new alternative to evolutionary psychology. He got excited and sent me a check.”\n\nKrauss, Lawrence: Cosmologist.\n\nEpstein was a major donor to his program at Arizona State University, and Krauss teamed with the financier to host a conference of Nobel laureates in the U.S. Virgin Islands in 2012. “Jeffrey has surrounded himself with beautiful women and young women, but they’re not as young as the ones that were claimed,” he told the Daily Beast in 2011. “I always judge things on empirical evidence, and he always has women ages 19 to 23 around him but I’ve never seen anything else. So as a scientist, my presumption is that whatever the problems were I would believe him over other people. I don’t feel tarnished in any way by my relationship with Jeffrey. I feel raised by it.” This spring, Krauss retired amid allegations of his own sexual harassment.\n\nLaybourne, Geraldine: TV executive.\n\nName found on Epstein’s private jet log.\n\nCo-founder of Nickelodeon and, with her husband, Kit, and pal Oprah, the Oxygen network.\n\nLe Bon, Simon: Singer.\n\nName found in Epstein’s black book.\n\nThe caricature playboy heartthrob at the front of Duran Duran.\n\nLefcourt, Gerald: Epstein’s lawyer.\n\nName found in Epstein’s black book.\n\nA white-collar defense attorney to the stars, Lefcourt has also represented Black Panther Huey P. Newton, Sid Vicious, Tracy Morgan, Russell Crowe, insider trader Michael Milken, and Murder Inc. Records founder Irv Gotti. —Matt Stieb\n\nLefkowitz, Jay: Attorney for Epstein\n\nLefkowitz negotiated the terms of Epstein’s negligently lenient plea deal with his former Kirkland & Ellis colleague Alexander Acosta. Now at Columbia Law, he served in both Bush administrations, as director of Cabinet affairs for H.W. and deputy executive secretary to the Domestic Policy Council and special envoy for human rights in North Korea for W. —Matt Stieb\n\nLove, Courtney: Singer.\n\nName found in Epstein’s black book.\n\nMaxwell, Ghislaine: Epstein’s ex turned right-hand woman.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nWith Ghislaine Maxwell at Cipriani Wall Street in 2005. Photo: Patrick McMullan/Getty Images\n\nShe was there at the socialites’ dos: Cornelia Guest’s holiday bash, Georgette Mosbacher’s party for the writer Michael Gross. At real-estate mogul Aby Rosen’s birthday, at Harvey Weinstein’s cocktail party. At film screenings and store openings and fashion shows, at Tina Brown’s home and Arianna Huffington’s and the Time 100 Gala. For years, though not lately, Maxwell was a constant on the New York social scene in its most Upper East iteration. She was a friend of everyone, if an intimate of few.\n\nMaxwell seemed to know many rich and powerful men — articles mention her dining with Bill Clinton, photos show her partying with Elon Musk and deep in conversation with Stephen Schwarzman — but her most durable connection has been with Epstein. She was, as he once put it, his “best friend.” Maxwell, 57, has been accused in civil suits of serving as his procuress, luring women and girls into Epstein’s web.\n\nIn court documents, Epstein’s accusers allege that Maxwell — who denies all and has never been criminally charged — acted as a recruiter, an instructor, and in some cases a participant in the abuse he practiced. Virginia Roberts Giuffre, who claims Maxwell recruited her on behalf of Epstein when Giuffre was a 16-year-old spa attendant at Mar-a-Lago in Palm Beach, where Epstein has a home, said much of her grooming came from Maxwell. “The training started immediately,” Giuffre said in a video interview with the Miami Herald. “It was everything down to how to give a blow job, how to be quiet, be subservient, give Jeffrey what he wants.”\n\n“Every pretty girl in New York, in those days, Ghislaine would invite to Jeffrey’s,” said Euan Rellie, an investment banker and social fixture who has known Maxwell for years and who, along with his wife, the author and socialite Lucy Sykes, was a fellow guest at a dinner for Prince Andrew at Epstein’s townhouse in the early aughts. Maxwell and Epstein had been attached, but she was “now an employee of his, as I understood it,” Rellie said. “Her job was to jazz up his social life by getting fashionable young women to show up.” He presumed the young women to be in their 20s.\n\nTabloid reports on Maxwell claim she managed Epstein’s properties from his office on Madison Avenue, which appeared in public records for many years as one of Maxwell’s addresses. Epstein, for his part, said she wasn’t on the payroll, yet she did errands for him: hunted for a yoga teacher in California and acted as intermediary when he wanted to give his friend the billionaire Les Wexner a family portrait painted by Nelson Shanks.\n\nShe was said to be wickedly funny and unusually knowledgeable, glamorous, and, on top of that, British. (“I think New Yorkers are charmed by that high-end English accent,” photographer Patrick McMullan said.)\n\nWhat’s more, she was exotic. She had explored the seas and could pilot a helicopter, or maybe a submarine, one acquaintance thought — a MacGyver of the gala circuit.\n\nMaxwell arrived in New York in the early ’90s, on the cusp of her 30th birthday. English-born and poshly educated, she was the favorite daughter of Robert Maxwell, the English media mogul, whose holdings included newspapers, notably the tabloid Daily Mirror in London, and the Macmillan publishing house in the U.S. Ghislaine had founded a social club for women in London and worked for another of her father’s papers, and, according to the New York Post, she came as his emissary to American society when he bought the New York Daily News in 1991.\n\nBut that same year, Robert was found dead — by suicide, murder, or accident (the official inquest’s ruling, though opinions vary) — in the Atlantic, off the Canary Islands. (He was last seen on the deck of his yacht, the Lady Ghislaine.) Soon after, he was discovered to have plundered the pension funds of the Mirror to shore up his floundering empire. Ghislaine was reported to have an income for life from a family trust, but at £80,000 a year, it would hardly be enough to sustain a high-flying lifestyle.\n\nThe meet-cute of Epstein and Maxwell in New York is unclear, and neither has historically gone into any great detail. By 1992, they were already linked, showing up at a Mar-a-Lago party with each other in Palm Beach, where Trump and Epstein ogled women together in front of NBC cameras. Suffice it to say they were romantically linked and then platonically linked. (Epstein told people his former paramours move “up, not down,” to friend status.)\n\nFor a woman seen everywhere about town, she is curiously silent in the press, except where ocean conservation is concerned. In 2008, she hosted a cocktail party for the board of the nonprofit Oceana at her townhouse on East 65th Street. And by 2012, she had launched the TerraMar Project, a conservation nonprofit of her own, of which, according to tax filings, she was president but from which she drew no salary. She gave a ted Talk about its work and talked it up at the U.N. and in the press, which credited TerraMar as her “brainchild.”\n\nFrom the New York social world, she has vanished. “I have not seen her in a zillion years,” one acquaintance said. The party photos dried up in 2016. Her 65th Street townhouse was sold for just over $15 million that year. Where is she now? One social-watcher guessed the islands; others think Europe. She incorporated a company — Ellmax, a play on her name — in the U.K., and TerraMar’s last two years of tax filings listed the address of an accounting firm near Boston. (An executive there declined to provide any forwarding information.)\n\n“She seemed like a woman who didn’t have any real job, didn’t have any real boyfriend, had lost her dad,” Rellie said of his impressions of her when they’d met. “A woman adrift who was clinging on to whatever she could find.” —Matthew Schneier\n\nRead More: The Socialite on Epstein’s Arm\n\nMcMullan, Patrick: Photographer.\n\nName found in Epstein’s black book.\n\nMeister, Robert: Insurance executive.\n\nIntroduced Epstein to Leslie Wexner after Epstein met and charmed Meister on a plane to Palm Beach, according to James Patterson’s book Filthy Rich.\n\nRead More: Author James Patterson on Jeffrey Epstein’s ‘Unbelievable’ Crimes\n\nMinsky, Marvin: MIT professor and pioneer of artificial intelligence.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nMitchell, George: Senate majority leader.\n\nName found in Epstein’s black book.\n\nThe former senator was appointed the U.S. special envoy for Northern Ireland by President Clinton and was an architect of the Good Friday Agreement. He called Epstein a “friend,” and the address book lists a dozen numbers for him under the heading “Piper, Rudnick,” the name of the Washington law firm where Mitchell was a partner.\n\nMonckton, Rosa: Former CEO of Tiffany & Co. in the U.K.\n\nName found in Epstein’s black book.\n\nEpstein’s “close friend since the early 1980s,” according to the 2003 profile of Epstein written by Vicky Ward in Vanity Fair: “Monckton recalls Epstein telling her that her daughter, Domenica, who suffers from Down syndrome, needed the sun, and that Rosa should feel free to bring her to his house in Palm Beach anytime.”\n\nMurdoch, Rupert: Media mogul.\n\nName found in Epstein’s black book.\n\nMurdoch has two numbers — one New York, one California — listed in the address book.\n\nMyhrvold, Nathan: Businessman.\n\nThe legendary patent troll turned impresario of molecular gastronomy dined at Epstein’s home.\n\nPagano, Joe: Venture capitalist.\n\nName found on Epstein’s private jet log.\n\nThe chief executive, secretary and treasurer, principal accounting officer, and principal financial officer of an insecticide-research company, Pagano even visited Epstein in jail.\n\nPastrana Arango, Andrés: Former Colombian president.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nFiled in the address book under “ex president of Colu.”\n\nPerelman, Ronald: Revlon chairman.\n\nName found in Epstein’s black book.\n\nThe billionaire invited 14 guests, including Epstein, Jimmy Buffett, and DNC co-chair Don Fowler, to his Palm Beach home for a Bill Clinton fund-raiser in 1995.\n\nPerlman, Itzhak: Violinist.\n\nName found in Epstein’s black book.\n\nPinker, Steven: The linguist who became a celebrity optimist.\n\nWith Lawrence Krauss and Steven Pinker. Photo: via Facebook\n\nPinker is one of the famous intellectuals most often linked to Epstein, but he says he flew on Epstein’s private plane only once in 2002 and that he was involuntarily placed next to him for a picture at Lawrence Krauss’s Origins Project’s annual conference in 2014: “If I had more wherewithal, I would not have indulged my friend in sitting with him. Despite what various friends and colleagues all said about what a genius he was, I found him tedious and distasteful. Even before I knew about the criminality, I found it irritating to talk to him, all the more so because the reason he was in the conversation was because he had given money to these various projects. He likes schmoozing with smart and intellectual people, but he couldn’t really or had very little interest in exploring an issue. He’d wisecrack, change subjects, or get bored after a few seconds. He’s a kibitzer more than a serious intellectual.” Nevertheless, Pinker supplied some linguistic expertise that his friend Alan Dershowitz used to defend Epstein during the 2008 trial. —Matt Stieb\n\nPinto, Alberto: Interior designer for the gold-leaf life.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nForget for a moment the mural featuring Epstein in the middle of a prison yard complete with guards and barbed wire. Let’s also forget the life-size doll hanging from a chandelier, and the chess set with figures of his staff as pieces to play with. Let’s instead focus on the very lush Euro-Orientalist décor of Epstein’s 21,000-square-foot seven-story Beaux-Arts mansion, decorated by none other than the late great Alberto Pinto, one of the world’s top prestige interior designers. His clientele included princes, moguls, and wannabe princes, as captains of industry so frequently are, and Epstein clearly aspired to that provenance and history. He flew Pinto on his private plane, as he did other architects and designers (Jean-Michel Gathy, Ricardo Legorreta, and Peter Marino are also listed in Epstein’s flight logs), and lived like a modern pasha in rooms lavished with money that bought custom-tooled gold leather walls (at least they were made to look like tooled-leather walls) and leopard-print upholstered armchairs in the dining room that appear to be covered in silk velvet. It was exactly the sort of project Pinto relished, flexing all the artisanal muscle that a designer of his stature can exercise when cushioning his client’s home. —Wendy Goodman\n\nPittman, Bob: Chairman and CEO of iHeartMedia, Inc.\n\nName found in Epstein’s black book.\n\nPosen, Felix: Philanthropist\n\nName found in Epstein’s black book.\n\nFormer business partner of Marc Rich (who was famously indicted for tax evasion and trading with Iran, before being even more famously pardoned by President Clinton), with whom he paired on deals in the Soviet Union before the fall of communism.\n\nPritzker, Tom: Executive chairman of the Hyatt Hotels Corporation.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nKnown to dine with Epstein in the early aughts.\n\nRadziwill, Carole: Author and television personality.\n\nName found in Epstein’s black book.\n\nThe daughter-in-law of Lee Radziwill and a Real Housewife of New York.\n\nRanieri, Lewis: The “father” of mortgage-backed securities.\n\nName found in Epstein’s black book.\n\nAnother Epstein dinner partner.\n\nRichardson, Bill: Former New Mexico governor.\n\nName found in Epstein’s black book.\n\nZorro Ranch, Epstein’s New Mexico property. Photo: Reuters/REUTERS\n\nEpstein donated $50,000 to each of his gubernatorial campaigns. A spokeswoman for Richardson told the Albuquerque Journal that Richardson recalls visiting Epstein’s New Mexico ranch only once, during his first run for governor in 2002.\n\nRiggio, Steve: Barnes & Noble CEO.\n\nPhotographed with Epstein at the 1999 Edge Foundation Billionaires’ Dinner, and twice met him at the TED conference.\n\nRivers, Joan: TV host, actress, and comedian.\n\nName found in Epstein’s black book.\n\nRose, Charlie: Television journalist.\n\nName found in Epstein’s black book.\n\nYou learn things answering phones, and in the spring of 2005, answering Charlie Rose’s phone at his PBS show, you would learn that his friend Jeffrey Epstein had some recommendations to make for whom Rose ought to hire as his next assistant. Written call logs from 2005 and 2006 show Epstein and his own assistant calling dozens of times, making plans for lunch and tea in Manhattan or to try to meet up in Paris. Epstein also called with a total of five women’s names and phone numbers. One woman was described as “world’s most perfect assistant she used to work for Harvey Weinstein he’s lucky if he can get her.” Another entry reads, “Jeffrey Epstein wants to talk to you before you call these two girls.” A fourth woman shows up on the manifests of Epstein’s jet, including on Bill Clinton’s trip across Africa, and wound up working at the Clinton Foundation. Two former staffers remember another Epstein referral, a young woman not mentioned in the logs, who interned at the show. In all, Rose hired three (“Jeffrey Epstein from time to time recommended various candidates for open positions at the Charlie Rose Show,” Rose’s representative said in a statement, but said the ex-host only learned about Epstein’s alleged abuse years later, when he pleaded guilty in Florida). When I called one of these women recently, she was stunned to learn she was one of many women Epstein recommended for the job. “I was being offered up for abuse,” said the woman, who was 22 at the time she worked for Rose. It helped her understand not only how her boss Rose — whom in 2017 she would accuse, along with 34 other adult women, of sexual harassment — had treated her, but also how the rest of the staff had seen her. And it helped her understand a grim version of networking among powerful men. —Irin Carmon\n\nSacco, Amy: Nightlife impresario.\n\nName found in Epstein’s black book.\n\nThe undisputed club queen of aughts New York, Sacco ran Lot 61 in Chelsea, which was famous for using fresh fruit in its drinks, and later Bungalow 8, which prided itself on discretion, the kind of place where celebrities could behave badly and not have to worry about appearing in “Page Six.” Sacco was a pioneer of marrying nightlife with concierge-style indulgences for the very rich: Her staff would get you whatever you needed: pizza delivery, peanut M&M’s, a private flight to Miami leaving from Teterboro as soon as you could get there.\n\nSchank, Roger: Chief learning officer at Trump University.\n\nVisited Epstein in prison in 2008.\n\nSchumer, Chuck: New York’s senior senator.\n\nOne of many politicians to receive donations from Epstein over the years. Epstein gave bipartisanly but not equally: Between 1990 and 2004, he gave more than $139,000 to Democrats and just over $18,000 to Republicans. Epstein also gave to a handful of politicians in New Mexico, where he’d purchase the Zorro Ranch from former governor Bruce King and where he was not required to register as a sex offender. In recent weeks, politicians including Schumer decided to donate an equal amount to charity.\n\nShriver, Maria: Journalist and former First Lady of California.\n\nName found in Epstein’s black book.\n\nTwo California numbers are listed in the address book.\n\nSiegal, Peggy: Elite New York’s glue.\n\nName found in Epstein’s black book.\n\nA brazen and relentless publicist of the old school, Siegal understands one thing well: “Bringing people together. Everyone needs to feel that they belong.” At least a certain kind of accomplished person, no matter, frankly, how they went about getting there (who was she to judge?). Known for her movie premieres and other guest-list-driven social events, she bragged that she “ruined the Hamptons” to Vanity Fair in a profile back in 1996.\n\nPublicity-party invites are an amoral game, driven by status and FOMO. Like everyone, she worked with Harvey Weinstein when he was an Oscar machine, the toast of the town. So you can’t blame Siegal for including someone who already knew all the boldface power people. In 2008, in the teeth of the accusations against Epstein, he was spotted by a New York party reporter, “unshaven, smiling that feline-monkey grin,” at the Siegal-engineered screening of the HBO film Bernard and Doris at the Time Warner Center. But after prison, apparently Epstein needed her more than ever: In a Times story on how Manhattan’s A-list refused to shun him, Siegal in particular was willing to help him (for free, apparently), “using her gate-keeping powers to usher Mr. Epstein, a friend, into screenings and events.” In 2010, she threw a dinner party at his Upper East Side townhouse for Prince Andrew, Katie Couric, George Stephanopoulos, Charlie Rose, and Woody Allen. She and Epstein might have had other reasons to get along: Siegal, who has just turned 72, is a self-invention as well, without a particularly pedigreed background. Also notable is the fact that, as she told Vanity Fair in 2012, “my favorite way to travel” to Cannes is “on a friend’s G5 from Teterboro to Nice.” —Carl Swanson\n\nSlater, Rodney: Secretary of Transportation under Bill Clinton.\n\nName found on Epstein’s private jet log.\n\nFlight logs record Slater taking a flight from Ghana to Nigeria in September 2002.\n\nSoros, Peter: Nephew of George Soros.\n\nName found in Epstein’s black book.\n\nConspiracy theorists looking through Epstein’s black book will be disappointed that George Soros never appears — but they can find Peter.\n\nSpacey, Kevin: Actor.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\nFlew with Bill Clinton to Africa (and, according to flight logs, the Azores) on Epstein’s plane.\n\nSpector, Warren: Bear Stearns executive.\n\nName found on Epstein’s private jet log.\n\nStanbury, Caroline: Socialite.\n\nName found in Epstein’s black book.\n\nWent on to star on Bravo’s Ladies of London.\n\nStarr, Kenneth: Former United States solicitor general.\n\nObviously, lawyers do not share guilt for their clients’ crimes. But it’s striking that Kenneth Starr chose to join Jeffrey Epstein’s defense team in 2007, after his moral fulminations against Bill Clinton’s sexual perfidy. His obsessive pursuit of President Clinton made him a folk hero on the right, representing the defense of traditional sexual virtue and the notion that it was under assault by Bill Clinton and the liberal elite. His special-prosecutor exploits propelled him to the presidency of the conservative Baptist Baylor University. During his tenure, the football program engaged in a horrific pattern of sexual abuse that led to the dismissal of the football coach and the removal of Starr after an investigation found “actions by University administrators that directly discouraged some complainants from reporting or participating in student conduct processes.”\n\nIt is perhaps coincidental, but Starr has tracked the broader conversion of the religious right from sexual shaming to sexual shamelessness. In an era when Donald Trump has exposed the hollowness of so many values conservatives allegedly hold dear, it is fitting that this Zelig of right-wing sexual hypocrisy has made yet another cameo. —Jonathan Chait\n\nStephanopoulos, George: Former White House communications director.\n\nAttended a dinner at Epstein’s Upper East Side townhouse for Prince Andrew in 2010. “That dinner was the first and last time I’ve seen him,” Stephanopoulos said recently. “It was a mistake to go.”\n\nSummers, Larry: Former Treasury secretary.\n\nName found on Epstein’s private jet log.\n\nWith Robert Trivers and Larry Summers at Harvard in 2004. Photo: Rick Friedman/Polaris\n\nBy the time the accusations of Epstein trafficking in girls surfaced, Larry Summers was out as Harvard’s president, having alienated much of the faculty, including two black professors who jumped ship, and spitballing about women’s biological inferiority in the sciences. But his tenure — 2001 to ’06, bookended by serving as Bill Clinton’s Treasury secretary and Barack Obama’s director of the National Economic Council — overlapped with a high-water mark of Harvard’s love affair with Epstein. Epstein, reads a story published in the Harvard Crimson in 2003, “has found Harvard the perfect staging ground for his intellectual pursuits.” Then-president Summers didn’t comment, but Alan Dershowitz confided that Epstein “speaks well of Larry, and I think he admires Larry’s economic thinking.” Lucky Larry, to be recognized by such an eminence.\n\nEpstein, of course, was not an alumnus of Harvard (or anywhere), or a faculty member, but he was a donor. Asked by the Crimson in 2006 whether Epstein’s $6.5 million donation should be returned, interim president Derek Bok referred to an earlier statement that Harvard has no “obligation to investigate each donor and impose detailed moral standards.” Summers imposed his own moral standards, hitching a ride on Epstein’s plane. (A representative had no comment.) Even after Epstein registered as a sex offender, the Boston Globe reported, Summers’s wife, Harvard English professor Elisa New, accepted Epstein’s $110,000 donation to her PBS poetry show. —Irin Carmon\n\nTaymor, Julie: Director.\n\nName found in Epstein’s black book.\n\nResponsible for one of the biggest hits in Broadway history, The Lion King, and one of the biggest flops, Spider-Man: Turn Off the Dark.\n\nTrivers, Robert: Evolutionary biologist.\n\nIn 2015, he defended Epstein, saying, “By the time they’re 14 or 15, they’re like grown women were 60 years ago, so I don’t see these acts as so heinous.” This month, he called his past statement “stupid and offensive.”\n\nTrump, Donald: President and partygoer.\n\nName found in Epstein’s black book.\n\nAt a party at Mar-a-Lago on November 1992. Photo: via NBC\n\nThere it was, yet another tape. This time, the now-president was filmed, in footage dredged up by NBC, in 1992 at Mar-a-Lago, hosting a party attended by a bevy of Buffalo Bills cheerleaders — and Epstein, from whom Trump has tried to distance himself since the arrest. He knew him only like anyone else in Palm Beach knew him, he said recently, although there were several entries for Trump in the black book, including a “direct emergency contact,” and 17 years ago Trump had boasted to this magazine that he’d known him forever and that he was a “terrific guy.”\n\nIt’s not just the denial in the face of evidence that, yes, he really did hang out with the guy that makes this set of film so classically Trumpian. The tape distills Trump to a certain essence: In this frame, he dances, snapping his fingers and spinning, surrounded by women — but profoundly alone, backing off and avoiding eye contact the second a woman moves in to dance with him. In another frame, he smiles with self-satisfaction as a crowd of women chants his name. Surrounded by a group of cheerleaders about to pose for a picture, he reaches around the waist of one and pulls her sharply in to him, then briskly cups her behind in a businesslike, joyless fashion while she reaches for her hair to maintain smiling composure. It’s as if he thinks it’s his vaguely grim duty, as an American man playing the campiest possible version of swinging billionaire bachelor, to grab the closest available body part.\n\nAnd most telling is his sideline locker-room talk with Epstein, whom the camera catches entering the party, greeted warmly by Trump. Like teenagers, they stand at the edges of the dance floor, pointing out the women they like, laughing at private jokes about them, rating them as hot. Here, there is joy. You see in this moment two outer-borough boys who have successfully crashed the Manhattan Establishment, who have boorishly, clumsily used money to get everything they want — but whose desires have never moved beyond an adolescent vision of the world, of women, of men, of the good life, of who merits consideration and who can be used.\n\nIn middle age, Trump had enough self-control to understand that his worst instincts were best received by men who were an awful lot like him. Now, as an old man — the oldest teenager ever — Trump has lost even that filter. He’s turned the whole country into his bunga-bunga party, made a Mar-a-Lago of the world stage, and divided us into Epsteins and cheerleaders — either co-conspirators who love the license his immaturity grants or else disposable collateral damage. —Noreen Malone\n\nRead More: NBC Obtained Trump-Epstein Footage After Trump Kissed an Anchor Without Consent\n\nTrump, Ivana: Donald Trump’s first ex-wife.\n\nName found in Epstein’s black book.\n\nTrump, Ivanka: Daughter of Donald and Ivana Trump.\n\nName found in Epstein’s black book.\n\nTrump, Melania: Wife of Donald Trump.\n\nWith Trump, Melania, and Maxwell at Mar-a-Lago in 2000. Photo: Davidoff Studios Photography/Getty Images\n\nEpstein has reportedly bragged that he’s the one who introduced Melania to her future husband. At the very least, the three have traveled together: She flew with Epstein on then-boyfriend Donald Trump’s plane in 2000.\n\nRead More: Remembering the Time Jeffrey Epstein Rode on Donald Trump’s Plane\n\nTucker, Chris: Actor.\n\nName found in Epstein’s black book and on Epstein’s private jet log.\n\n﻿Flew with Bill Clinton to Africa on Epstein’s plane.\n\nTuttle, Edward: Architect of a conspiratorial fever dream.\n\nName found on Epstein’s private jet log.\n\nAerial detail of “the temple” on “Pedophile Island.” Photo: via Inside Edition\n\nWho built the temple? Tuttle, a designer of luxury resorts by trade, renovated the main compound on Epstein’s 70-acre private island in 2003. Sometime between 2009 and 2013, a “temple” appeared on the island: a large, boxy, blue-and-white-striped structure with a golden dome, surrounded by palm trees. In the days after Epstein’s arrest, the temple became the object of fervent speculation online. It was the kind of irresistible conspiracy-bait that exemplifies the Epstein story: On the one hand, shouldn’t it be enough that a mysteriously wealthy banker with connections to the globe’s most powerful people was apparently operating a child sex-trafficking ring without dabbling in theories about occult island temples? On the other hand, though, once you’ve accepted that, why would occult island temples be so out of the question? On the edges, the Epstein saga could seem less like a news story than like a brutal, unreadable fairy tales. Or maybe it was a desire to take a story about financial power and social privilege colluding to protect a criminal predator and transform it into something more terrible and monumental. After weeks of speculation, the first eyewitness account revealed that what the “temple” contained wasn’t a necromantic shrine but a gym, decorated with a framed photograph of a topless woman. —Max Read\n\nVance, Cyrus Jr.: Prosecutor in the crosshairs.\n\nThere are currently 475 level-three sex offenders registered in New York County, but in 2011, when an attorney from the office of Cy Vance, Manhattan DA, argued that Epstein’s risk level should be reduced, Justice Ruth Pickholz responded, “I have to tell you I am a little overwhelmed because I have never seen a prosecutor’s office do anything like this.” Pickholz denied the request — Epstein’s risk assessment put him 20 points above the required threshold for the highest level of offender — and the DA’s office later reversed its request. Though there’s no indication Vance and Epstein were friendly, his office has been criticized previously for declining to pursue sex-crimes charges against Harvey Weinstein that coincided with a donation from his attorneys (though Weinstein has since been charged by Vance’s office) and fraud charges against Ivanka and Donald Trump Jr. —Irin Carmon\n\nWachner, Linda: Head of the textile corporation behind Calvin Klein and Speedo.\n\nName found in Epstein’s black book.\n\nWallace, Mike: 60 Minutes journalist.\n\nName found in Epstein’s black book.\n\nWalters, Barbara: Broadcast journalist and TV personality.\n\nName found in Epstein’s black book.\n\nWeinstein, Bob: Former co-chairman of Miramax Films and the Weinstein Company.\n\nName found in Epstein’s black book.\n\nWexner, Leslie: The money behind the money.\n\nName found in Epstein’s black book.\n\nRetailing billionaire Leslie Wexner was Epstein’s only known client, the man who transferred the rights to that famous townhouse to him for free in 2011, years after they were supposed to no longer be in contact. The relationship stretches back to the late 1980s, a time when Wexner’s star was on the rise. A 1985 cover story for New York visited him in Columbus, Ohio, where his retail empire was built. Journalist Julie Baumgold described how he, not unlike Epstein, was a self-made man, addicted to self-improvement, how he didn’t know how to pronounce La Grenouille correctly and wanted to have his picture taken at the Whitney, and noted that “Wexner is what used to be known as a ‘confirmed bachelor.’ ” (He later married and has four children.) Not long after that piece, he was introduced to Epstein, who had left Bear Stearns under a cloud and was broke. He and Wexner hit it off, and Epstein soon began managing Wexner’s finances. Wexner’s credibility lent plausibility to the notion that Epstein managed billions from his Caribbean-island redoubt. Associates of Wexner, who is now worth $6.6 billion, didn’t understand the attraction. Soon after the men began working together, Epstein moved into Wexner’s Upper East Side mansion. Wexner bought the seven-story townhouse in 1989 for $13.2 million but apparently lived there only for a few months. The title was transferred in 2011 to a Virgin Islands entity controlled by Epstein. It is now worth $56 million. —Michelle Celarier and Carl Swanson\n\nRead More: Who Is Les Wexner, and How Is He Connected to Jeffrey Epstein?\n\nWiesel, Elie: Nobel Prize winner.\n\nName found in Epstein’s black book.\n\nZagat, Nina and Jim: Publishers.\n\nName found on Epstein’s private jet log.\n\nZuckerman, Mort: Media mogul and newspaper publisher.\n\nZuckerman went into business with Epstein — briefly — in 2004, spending $25 million to invest in Radar, but he pulled the plug after just three issues. He first attempted a deal with Epstein in 2003, when he was part of a consortium with Michael Wolff, Donny Deutsch, Nelson Peltz, and Harvey Weinstein to buy New York Magazine.\n\n*This article appears in the July 22, 2019, issue of New York Magazine. Subscribe Now!"}, {"url": "https://www.librarything.com/author/epsteinrichardallen", "page_content": "Improve this author\n\nCombine/separate works\n\nAuthor division\n\nRichard Allen Epstein is currently considered a \"single author.\" If one or more works are by a distinct, homonymous authors, go ahead and split the author.\n\nIncludes\n\nRichard Allen Epstein is composed of 3 names. You can examine and separate out names.\n\nCombine with…"}, {"url": "https://nymag.com/intelligencer/2021/12/jeffrey-epstein-unanswered-questions.html", "page_content": "Photo-Illustration: Intelligencer; Photo: Patrick McMullan via Getty Images\n\nThis article was featured in One Great Story, New York’s reading recommendation newsletter. Sign up here to get it nightly.\n\nLast Friday, the prosecution rested its case against Ghislaine Maxwell, the British heiress and former companion of Jeffrey Epstein. Her trial, in which she stands accused of federal sex-trafficking offenses, was supposed to provide some measure of resolution to the many mysteries surrounding the life and death of Epstein, the superwealthy globetrotting sexual predator who hanged himself (maybe) in a Manhattan jail cell in 2019. Instead, federal prosecutors called just a handful of witnesses, and rested their case far earlier than they had predicted before the trial. “It’s surprising,” says Julie Brown, the Miami Herald reporter whose 2018 investigative series is widely credited with reviving the criminal case against Epstein. The case against Maxwell will rest almost entirely on the testimony of four women who described being sexually abused by Epstein when they were teenagers. That evidence may still weigh heavily enough to convict Maxwell, who is accused of identifying and grooming Epstein’s victims, as well as sometimes joining in his sexual activities. But it will do little to dispel the stench of speculation and conspiracy surrounding Epstein and his highly connected friends.\n\nThe prosecution made no attempt to explain the origin of Epstein’s wealth, although it did present tantalizing evidence of the lascivious existence he was able to purchase with it. There were candid snapshots — part of the “vast trove” of photos seized at the time of Epstein’s arrest — of him cavorting with Maxwell on his private jet. There were interior and aerial shots of his personal properties: the 21,000-square-foot mansion on East 71st Street; the 8,000-acre Zorro Ranch in New Mexico; the private Caribbean island of Little Saint James, which features steep cliffs fit for a Bond villain and a “piano pavilion” that resembles an occult temple. Epstein’s personal pilot testified of flying the financier around the world with former and future presidents (Bill Clinton, Donald Trump), a royal family member (Prince Andrew, the Duke of York), celebrities (Kevin Spacey), and a continually replenished roster of beautiful young women. If anyone was expecting to hear what Epstein and his pals were really up to, though, they were disappointed.\n\nMaxwell’s trial has done little, either, to clear up the bewildering nature of her relationship with Epstein. At one point, as evidence of a long-term affair, prosecutors presented a bizarre Microsoft Word document from an Epstein computer, written in the third person by user “GMax,” that read like a college recommendation for the couple. It said they were lovers for “11 years,” beginning around the time of her father Robert Maxwell’s death in 1991. Witnesses testified that they shared a bedroom in Palm Beach. Yet other witnesses have described her playing a role more akin to a household manager.\n\nThursday, Maxwell’s aggressive attorneys will begin to present her defense, which may provide some further explanation. After that, 12 supposedly impartial jurors will determine whether she is guilty of sex-trafficking crimes. While we wait for that verdict, though, New York has decided to convene its own jury of sorts, made up of half-dozen people who know Epstein’s life inside and out. Our expert panel is here to chew over, debate, and maybe even answer the Big Questions.\n\nPanel Participants Julie Brown: Miami Herald reporter and the author of Perversion of Justice\n\nNick Bryant: reporter who first obtained and published Epstein’s “little black book”\n\nLachlan Cartwright: editor-at-large at The Daily Beast who has covered the Epstein case\n\nVanessa Grigoriadis: co-creator of the podcast Fallen Angel, about Victoria’s Secret, the chain’s founder Leslie Wexner, and his relationship with Epstein\n\nJose Lambiet: South Florida private investigator who formerly worked as a gossip columnist for the Palm Beach Post and other news organizations\n\nGabriel Sherman: special correspondent for Vanity Fair who has written on Epstein’s finances\n\nWere Epstein and Maxwell actually romantic partners, and if so, for how long? What role did she play in his life?\n\nVanessa Grigoriadis: I don’t know if they were sleeping together or not, but she would tell Epstein’s above-age girlfriends that they were. They thought she did it to make them jealous.\n\nLachlan Cartwright: No doubt they hooked up at some point, but for Epstein, Maxwell played a more valuable role than just a love interest. She was his go-between not just amongst the women (and as the Feds are arguing in court, girls as young as 14) but to celebrities, scientists, businessmen, and social elites. The company Epstein craved and needed to keep the jig up.\n\nJulie Brown: I think she really loved him, like a lot of women that fall in love with the wrong person. When she realized that she was never going to be able to marry him, she had to find other ways to stay in his life. And essentially, what she did was she began running his household. I think that most of his relationships were transactional, and that’s the way he wanted it. He used and discarded people most of his life. Even Ghislaine. He discarded her too.\n\nWhat did Maxwell get out of the trade?\n\nJose Lambiet: From the late ‘90s on, Epstein almost always showed up in Palm Beach with Maxwell. I believe she got money and some power out of her relationship with Epstein. Remember that her dad, Robert Maxwell, didn’t leave her much. He was flat broke and owed everybody money when he died.\n\nJulie Brown: What else did she really have? Her father was dead. She no longer had the kind of money that she was accustomed to growing up. Her career was her social connections and being a socialite, so she made a bargain and decided she was going to stay with him, despite knowing everything that she knew about what he was doing. She’s a victim in the sense that all adults, they are confronted sooner or later with someone in their life that they know is toxic and shouldn’t be in their lives. And some people are better at saying, “Look, I’m going to walk away from this,” than others. If you’ve ever had a relationship with someone you really loved a lot, it’s very hard to walk away, especially if you don’t feel like there’s anything else in your life. And in her case … I’m not trying to make anybody feel sorry for her. This is just a reality.\n\nHow significant was Epstein’s little black book?\n\nNick Bryant: Jeffrey Epstein had a house manager named Alfredo Rodriguez. Rodriguez purloined all of Epstein’s contacts, which are known at this point as the “black book.” He tried to sell it to an attorney who was representing a number of the victims. And the attorney quickly called the FBI, and the FBI did a sting on Rodriguez, and he tried to sell the black book to the FBI, and the FBI busted him. In 2012, I went down to Florida and I was able to acquire the black book. That’s what started my quest. I came back to New York and I had the black book, but no one wanted to touch the story. So I just sat on it for like three years until Gawker offered to not only publish the black book, but let me write some articles about it.\n\nJose Lambiet: The black book is very significant. Just by sheer association, it makes practically every name in it a suspect of sex crimes.\n\nVanessa Grigoriadis: No, it’s not significant. It’s like the list of followers that an influencer has. Just because he had the numbers doesn’t mean he had a relationship with the people. And the numbers had to have come mostly from Ghislaine.\n\nJulie Brown: A lot of people don’t understand that it was Maxwell that really started that whole book. It was a computerized list that she would go in on the computer and she would update repeatedly. She was the person that gathered those social connections. It really wasn’t Epstein.\n\nDid Epstein really know all the people in the book?\n\nLachlan Cartwright: I spent a few days calling people named in that “little black book.” Guess how many had actually met Epstein? Or had any dealings with him? Not many! Ghislaine put this address book together for her own benefit and like much of the Epstein reporting it has taken on a mythical life of its own.\n\nGabriel Sherman: I think the black book is another example of Epstein being full of shit. Many of the people in that book didn’t even know Epstein or if they did it was on the most superficial level. When the black book became public, it was like, Oh my God! This man is tight with the entire world of the elite! I just think it was a case of more of his desperate social-climbing than it was necessarily a reflection of his influence.\n\nNick Bryant: It’s very interesting. As soon as people’s names come up in Epstein’s black book, see how they run. Rodriguez circled a bunch of names in the black book, who he said had colluded with Epstein, and the FBI called a number of them material witnesses, meaning they are witnesses that are integral in reporting a crime. I’ve written extensively about Epstein’s network and the men who were named. Some of them were also accused by Virginia Giuffre.\n\nJulie Brown: Joe Recarey, the lead detective, got pieces of the book from Rodriguez. What Rodriguez did was he circled certain names on that list. If you look at the list, what Recarey told me was that Rodriguez circled the names of people who were involved in Epstein’s activities, or knew about what he was doing. For example, Trump is circled in there.\n\nHow close were Epstein and Donald Trump, really?\n\nLachlan Cartwright: The Trump/Epstein dynamic is a red herring.\n\nJose Lambiet: In Palm Beach, it’s clear Epstein had access to Mar-a-Lago without being a paying member, and that’s something Trump allows for some acquaintances.\n\nVanessa Grigoriadis: I’ve heard they were close. Jeffrey Epstein and Donald Trump flew around on private planes with flocks of girls, going wherever whenever (Atlantic City, Virgin Islands), and during these jaunts both were allegedly stone-cold sober, which is just so weird. They would both reference Morgan Fairchild as the ultimate specimen of feminine beauty. They were part of the scene of rich guys running after models — O.J., Trump, Weinstein, Epstein. Epstein of course had a misshapen penis and we don’t know much about Trump in that regard, but we do know about his hands. Trump was pretty broke at the time. I talked to a model who dated Epstein who said that he called her once saying that he was going to be late because he had to go over to Donald’s. Maybe it was just Epstein’s sick sense of humor, but she said he told her Donald was upset and crying under the covers, so he was going to drop him off food. Trump was a joke to some of those models; she called him a “credit clown.”\n\nJulie Brown: Epstein and Trump are kind of two different animals, so to speak. Epstein really aspired to hang out with people who were very, very bright and brilliant scientists, and to talk about all kinds of esoteric research. And he just saw himself on a different playing field than Trump. Trump was a guy that made a lot of money, but made it off of his family. But they were both in Palm Beach, their houses were not that far from each other, and they hung in the same social circles, so they inevitably would cross paths. And I think we know that, for example, Epstein molded his modeling company that he had a stake in, he kind of set it up the way that Trump had his modeling company set up. So I think there was a little bit of competition.\n\nGabriel Sherman: They had a falling out over a real-estate deal where they both bid on a mansion in Palm Beach.\n\nHow close was his relationship to Bill Clinton? Was he just another rich guy with a plane?\n\nLachlan Cartwright: Clinton was definitely closer to Epstein than Trump but it has been incredibly difficult over the years to pin down details of Clinton and Epstein’s relationship.\n\nJulie Brown: Clinton obviously had a relationship with Epstein, and I know that everybody has distanced themselves from him, but to some degree, it seems like there are things that don’t make any sense. Why are there people that say Clinton was on the island when he’s saying he wasn’t on the island? I think everybody knows that he was on the island. Gabriel Sherman wrote a Vanity Fair piece where Doug Band basically said, “Yes, he was on the island.” Why is your former right-hand man saying now that you were on that island, and if you were on that island, why would you lie about it?\n\nJose Lambiet: Frequent use of the jet plus hosting the president sure would make anyone suspicious that Epstein knew Clinton better than Trump. If I wrote a book about Epstein, I’d title it The Gala of Whores. Just about everybody associated with the story is truly a whore.\n\nWhy were so many academics, especially at Harvard, so taken with him?\n\nVanessa Grigoriadis: People love money.\n\nJose Lambiet: With academics, it’s always the money. Plus I believe Epstein truly had a keen interest in science.\n\nGabriel Sherman: I talked to Steven Pinker at one point and he told me that he tried to have a real conversation with Epstein about science and after a minute, Epstein clearly was out of his depth and got all pissed off and changed the subject. He could talk about a lot for a short amount of time but if you actually really engaged this guy, he was full of shit.\n\nWhy did Alexander Acosta cut such a lenient plea deal?\n\nLachlan Cartwright: Why does anyone cut a deal? Epstein had the best lawyers: Kenneth Starr, Alan Dershowitz, Roy Black, and Gerry Lefcourt. They were killers and they were applying constant and unrelenting pressure on Alexander Acosta and his office.\n\nJulie Brown: I think they were to some degree outlawyered, but they allowed themselves to be outlawyered. They were all enamored with each other. I know one of the prosecutors told me words to the effect that they were all sitting in the room, and there was Kenneth Starr and Alan Dershowitz and Jay Lefkowitz, and he was sitting there thinking to himself how much money an hour they were all making. Alexander Acosta had ambitions to be a Supreme Court justice. There was a reason that Epstein hired Ken Starr and Jay Lefkowitz. These were people that were in the Federalist Society, which had a say on what conservative judges would be nominated to the Supreme Court. So he certainly was on a trajectory.\n\nJose Lambiet: I believe Acosta was starstruck by the dream team that Epstein gathered for his defense, guys like Ken Starr and Alan Dershowitz. I also believe there was political pressure from above on Acosta to go easy on Epstein. And we shouldn’t assume that Acosta was a competent U.S. Attorney. I often believe more in incompetence than corruption.\n\nJulie Brown: Buried in an appendix to the DOJ report on the case, it said that Alex Acosta’s emails during the time that this deal was being negotiated and signed, just disappeared. How does that happen? That’s something that just kind of sticks in my head.\n\nWhat about Acosta’s reported explanation that Epstein “belonged to intelligence”? Is it likely Epstein was a spy? If so, what would his use have been to the intelligence community?\n\nJulie Brown:I really don’t believe it. If that was true, we would probably know by now. I think that Epstein did a very good job of telling people, probably including his own lawyers, that he had connections like that. There would’ve been no reason, really, for them to check it out. And it was a good excuse for Acosta to use when he went to try to get confirmed for his Cabinet post. If it’s the CIA, you’re not going to find out. You can’t just call and find out whether it’s true or not.\n\nLachlan Cartwright: It is total and utter bollocks (propagated by muppets trying to sell books and podcasts) to say that Epstein was a Mossad asset or part of the intelligence community.\n\nNick Bryant: It’s very obvious that Acosta was told to stand down. Who has the power to tell a U.S. Attorney to stand down from a child-abuse investigation? You’ve got the attorney general and you’ve got the president. So those orders must have come from very high. There had to have been some intervention by another organization, which I believe was intelligence.\n\nGabriel Sherman: I mean, Epstein was a master bullshit artist. He definitely liked people to have the impression that he was a spy. He cultivated the idea. There’s no evidence whatsoever to support the idea that he was formally or even informally working for the CIA or Mossad or any of the agencies. I think he cultivated this entire persona of this man of mystery. And I think on some level it shows you how gullible and how stupid billionaires and rich people are, that they could be seduced by this guy and sucked into his lies. Things took on a life of their own, and word spread. One rich guy tells another rich guy: “You have to meet this brilliant guy Epstein.”\n\nSteve Bannon:\n\nOf course he’s an intelligence asset. We just don’t know whose.\n\n—quoted in Wolff, Too Famous, p. 317\n\nWhy did so many friends and business associates — for instance Leon Black, Bill Gates — with a great deal of reputational equity at stake, continue to interact with a convicted sex offender?\n\nJose Lambiet: Living in Palm Beach for two decades and my current job as a private investigator for this country’s elite have both shown me that the rich always look out for each other. Nothing one of them can do is shameful enough to warrant getting canceled, for all kinds of reasons, including social, financial, and moral. Since most of Palm Beach’s rich have skeletons in their giant closets, pointing the finger is most unwelcome.\n\nGabriel Sherman: He by all accounts was a psychopath, right? He is the kind of person who had no conscience and could lie convincingly. I think he cultivated this aura of himself, that he was this connected person who had Prince MBS on speed dial. I think people like Gates were brought into this world and it was like this billionaire club. Epstein would host these gatherings at his house and it was this secret society and there were models and beautiful women around. I think a lot of rich guys at that level, with their egos, their money has made them believe that they’re above the rules of society.\n\nVanessa Grigoriadis: He gave them permission to feel manly. They liked being close to an illicit lifestyle, and figured if everyone else was doing it, it was okay.\n\nJulie Brown: You would think that Epstein wouldn’t be able to manipulate someone like Bill Gates, but I don’t think anybody is non-manipulable if you are adept at finding that one thing that gets that person’s attention, and that’s what he did.\n\nLachlan Cartwright: People like Gates are disconnected from society and enact their urges in a weird way. Hanging out with Epstein was for him a release. As I’ve reported it was an escape from his loveless marriage and an avenue where he could hold court in the confines of the somewhat secure environment of Epstein’s Upper East Side mansion. And when I say “somewhat,” you had people like Michael Wolff at some of these dinners and gatherings.\n\nSo what was going on inside the mansion?\n\nGabriel Sherman: A lawyer who has represented one of the victims told me that after getting out of jail in Palm Beach, Epstein was very careful — at least while he was in the United States — about not doing anything with girls under 18. There’s no evidence that a lot of these men who socialized with Epstein were involved with underage girls. I think some of Epstein’s value to them was the fact that he just populated his social world with beautiful 22-year-old or 19-year-old models. That’s my sense. Epstein surrounded himself with a lot of powerful men who didn’t necessarily commit sex crimes, but they clearly looked the other way, and they didn’t think it was strange that this 40- or 50-something-year-old man was surrounded by 20-year-olds all the time. I don’t think just because you knew Epstein meant that you were part of something criminal. I think you were part of something definitely sordid and unethical and immoral.\n\nVanessa Grigoriadis: I’ve heard that the scene at his house wasn’t actually all that fun, and even though people wanted to check out the amazing townhouse, it was, most of the time, all old people and a few young women who didn’t talk.\n\nWhat about when Epstein traveled to, among other places, his private island?\n\nGabriel Sherman: I think while he was here, he was careful not to break the law post-incarceration. But we know he traveled the world on his jet. In the Virgin Islands or the Middle East or Africa, all bets were off.\n\nAny theories about what that “piano pavilion” structure was for?\n\nJose Lambiet: No idea. Epstein was pretty weird with some stuff. In his Palm Beach house, for example, I remember he had one room with an old-fashioned dentist’s chair blinged out with all the equipment. Antique stuff but really creepy, like something out of Marathon Man.\n\nHow much money did Epstein really have at this point?\n\nVanessa Grigoriadis: His assets, including his properties in New York and Palm Beach, were valued at $559 million in a one-page document filed in federal court in connection with his July 2019 bail hearing.\n\nJeffrey Epstein (in conversation with Steve Bannon):\n\nJE: Money, at the level we are talking about, has an independent life. In some sense nobody, no one person, controls it. It is part of the world’s capital. It has to be managed …\n\nSB: I’m not even sure what that means.\n\nJE: It means money is infrastructure. No matter who uses that infrastructure, saints or sinners, we need it to work.\n\n—quoted in Wolff, Too Famous, p. 300\n\nWhere did Epstein’s money come from?\n\nGabriel Sherman: After all of these years, there are only two publicly named clients of Epstein’s supposed money-management firm. First, there was Leslie Wexner. That lasted until 2007. Then after Epstein got out of jail, his next client was Leon Black.\n\nLachlan Cartwright: Ask yourself why Wexner gave Epstein full power of attorney over his affairs? It is extraordinary! That then allowed Epstein to manipulate Wexner’s finances and take control of his private jet and the now infamous Upper East Side mansion. Epstein then parlayed the appearance of wealth to con other rich and gullible men.\n\nWhat was up with him and Leslie Wexner?\n\nGabriel Sherman: Epstein’s longest relationship was with Wexner. It dated back to around 1986, a few years after Epstein had been fired from Bear Stearns. If you just look at the trajectory of Epstein’s life, shortly before he met Wexner, he was living in a modest apartment, a one-bedroom on the Upper East Side of Manhattan. Within about five years, he’s living in the largest private townhouse in the city, which formerly belonged to Wexner. His entire life, all of the things that we associate with Jeffrey Epstein — the house, the jet, the Palm Beach mansion — all of those things he got within several years of meeting Leslie Wexner.\n\nVanessa Grigoriadis: Wexner was just insanely rich back then, one of the only billionaires in the country, and since Epstein had general powers of attorney over his money, he may have been able to siphon off more than the $47 million Wexner later claimed he took. They were close friends. Epstein had a house, and a big presence, in Wexner’s hometown of Columbus, Ohio. They went on shopping trips to Europe together. No one has been able to figure out exactly what the relationship was about, but Wexner was absolutely devoted to him and his counsel. Wexner was married late, at 55. New York ran a cover story about him when he was killing it in retail called “The Bachelor Billionaire.” He also now has four children with his wife.\n\nDid Wexner really just give him the townhouse?\n\nGabriel Sherman: It’s very murky. At one point, it was reported that Wexner gave it to him for a dollar. In Vanity Fair, I reported that there were transfer documents that show that Epstein paid $20 million for it. There’s no way to know exactly the financial arrangements around the house. You know, Epstein could have paid $20 million but what if that $20 million had come from Wexner? What we do know is that Epstein got the house around five to seven years after the time he was living in a one-bedroom apartment. It’s not logical for someone with his credentials to make that amount of money in that short of a time.\n\nWas he actually a skilled investor? Or an investor of any kind?\n\nGabriel Sherman: People who have been to Epstein’s offices say he had no Bloomberg Terminals. He didn’t have a team of analysts. People said he didn’t even have a computer on his desk. Essentially, Epstein was a fund-of-funds manager. He would direct his clients’ money to big, powerful institutions and hedge funds and they would invest it. He didn’t do a lot of the trading himself. But Epstein would be in control. He was the middle man. That’s why Wall Street banks were so interested in cultivating Epstein, because he was a gatekeeper to Wexner’s fortune. In the late ‘80s and 1990s, Wexner was one of the richest people in America.\n\nWas Epstein laundering money for wealthy Saudis, as he implied, or anyone else?\n\nJeffrey Epstein (in conversation with Steve Bannon):\n\nSB: Isn’t that your business, hiding money for Third World dictators? What you actually do is launder money for the worst people in the world.\n\nJE: What is money laundering?\n\n–quoted in Wolff, Too Famous, p. 301\n\nJulie Brown: He probably didn’t think of it as money laundering. He thought of it as just helping people save money and hide money from paying taxes. When you help people who have so much money that we can’t even fathom it, like entire royal families for example, help them put their money away somewhere, and you get a cut of it, it earns you an awful lot of money.\n\nWas he a blackmailer? Either an explicit one or an implicit one?\n\nVanessa Grigoriadis: No clue, but we still have no evidence of this.\n\nJose Lambiet: Of course. If you are a well-known man who sleeps with an underage girl at a friend’s house, you automatically become the friend’s bitch. It’s an old CIA source-recruiting technique back from the Cold War era. Still, I’m not sure he would have become as rich as he was if all he did was blackmail folks. Blackmailing people for as much money as Epstein had would’ve made him a target of international assassins.\n\nJulie Brown: He clearly had cameras all over that mansion. We know from history that men sometimes do stupid things, and I think that Epstein knew which of these men that he associated with could be manipulated in that kind of way. So yeah, I absolutely think that there’s some of that that happened. I think it depended on who he wanted for what purpose. I think he just had a lot of different cons going on, depending on whether it was a connection that he needed to the British royal family or the Saudi royal family, or God knows what other people that he wanted to do business with.\n\nNick Bryant: I believe that there was obviously blackmail going on. Why else would you have the hidden cameras? But what people miss about this, and this is a very important point, is that Jeffrey Epstein by himself could not be a blackmail artist. Some of these men who he reportedly recorded are some of the most powerful men in the world. There’s no way that Epstein could be blackmailing these people unless there was an organization behind him, and Alexander Acosta said it was intelligence. I believe that there is some dark malignant corner of our intelligence services that blackmails politicians. I mean, political blackmail is as old as politics itself, almost, and Americans are very naïve about the blackmail that takes place in their political system.\n\nGabriel Sherman: If blackmail took place it was the implicit kind. It was the fact that these powerful men knew what Epstein knew about them. When he made financial requests, they willingly went along with it because they knew that the costs of not were too great. A source told me this story. One time a wealthy real-estate person in New York bumped into Epstein, and Epstein gave him some run-of-the-mill tax advice or financial advice, conversationally. The guy didn’t think anything of it. Then a month or so later, a bill shows up at his office: an invoice for financial advice. For a lot of money. If that’s true, I could imagine if this person had participated in Epstein’s sex ring, and Epstein then sends this person a bill, that’s a case where it sounds like implicit blackmail. In this case, the wealthy guy didn’t pay. It was just like he was put off by it.\n\nDo we think there is a vault filled with incriminating photos and videos?\n\nJose Lambiet: There’s likely a repository of written and maybe digital information about the habits of Epstein friends.\n\nNick Bryant: A former 60 Minutes producer, Ira Rosen, wrote a book and said that Ghislaine Maxwell had told him that Epstein had blackmail footage on both Clinton and Trump.\n\nLachlan Cartwright: This is the fantasyland stuff. There is no evidence of it. None. If those tapes existed we would know about them by now. I’ve spent a shitload of time running this down and can confidently tell you there are no videos and any “vault” was just as likely to safely secure Epstein’s lunch as it was secret videos.\n\nMichael Wolff:\n\nThe FBI did not list in its findings a set of pictures that Epstein sometimes removed from his safe to show friends: a dozen or so snapshots from shortly before their quarrel in 2004 of Donald Trump at Epstein’s Palm Beach home posing with a variety of young women in various stages of undress — some topless — sitting on his lap, touching his hair, laughing and pointing at a suggestive stain on the front of the future president’s pants.\n\n–Wolff, Too Famous, p. 314\n\nWho was Patrick Kessler, the purported hacker who approached David Boies and the New York Times, claiming to have Epstein’s videos? Any reason to believe he was for real?\n\nJulie Brown: When the Times was doing their investigation, I had been warned by people that I really trusted that Kessler was a phony. I still kept poking at it because I knew the Times was looking at it. But every time I got looking at what was going on, it just seemed to me like this is kind of bullshit. I just felt like it didn’t make any sense at all. I believe that what he was up to, was that this was a phony guy who was set up to try to discredit these lawyers. It was sort of like if Epstein had been alive, that would be something that Epstein would’ve done. I have my own theory about who did it, but I probably want to keep it to myself, because the kinds of people that would’ve been behind this aren’t nice people. You know what I mean?\n\nLachlan Cartwright: The New York Times, God bless ‘em, got hoodwinked by this Kessler whackjob. The NYT assigned a crack team of at least four journalists to the story and a crew from their FX Hulu show The Weekly followed the reporters as they tried to crack the story. They even boast on that TV special about having an “air gapped” laptop in a special room within the Times building in anticipation of reviewing the files that Kessler had promised. No prizes for guessing that the bloke never delivered and turned out to be a complete charlatan.\n\nNick Bryant: I don’t know who he worked for, or on whose behalf he was doing it. The only thing I can say is, it very much tainted David Boies.\n\nIf the fabled materials from the vault do exist, will the public ever know?\n\nJulie Brown: I really don’t think that they’re going to ever see the light of day. I don’t think the Feds are ever going to release them. The only other people that would know about its contents are probably the people that are now in charge of his estate, the people in his closest, closest inner circle. I mean, do I think that the FBI should release everything? Yes. Do I think that they should at least investigate with the goal of prosecuting more people who were involved? Yes. Will they? I don’t think so. Look at what prosecutors are facing with Maxwell. She is pulling out all the stops. It’s going to be surprising if they try to bring charges against anybody else.\n\nHow do you think Epstein most likely died?\n\nNick Bryant: I doubt that we will never know for certain exactly how Jeffrey Epstein died. There were many, many anomalies that night. So there seems to have been a convergence of factors that enabled Epstein to meet his demise. But I try not to speculate on that particular meme.\n\nVanessa Grigoriadis: Almost certainly suicide.\n\nGabriel Sherman: I firmly believe that Epstein killed himself. I don’t believe this idea that there was some grand conspiracy where he was killed by the powerful to prevent his secrets from coming out. I think in this case, he was a psychopathic narcissist who couldn’t stand the idea of spending the rest of his life in jail and he also didn’t want to allow his victims to get any justice for his crimes. The ultimate power that he had at that point was to take his own life.\n\nJose Lambiet: I believe Epstein was too much of a hedonist and a narcissist to resort to suicide. From what I knew about him when he lived mostly in Palm Beach in the winter, Epstein wasn’t the profile of a suicide victim.\n\nJulie Brown: I don’t think he did it by his own hand. I don’t think he committed suicide alone. I think that he had help. The fact that you had two guards that were asleep at the wheel, so to speak, and the cameras were gone, it suggests to me that there was something that was set up ahead of time to make sure that these guards weren’t paying attention, to make sure that the cameras weren’t working, to make sure that he didn’t have a roommate in there. I mean, there was just too many things in there that indicate to me that this was something that was pre-planned, and it was not just Epstein just deciding, “I’m going to kill myself today.” Now, whether it was a murder, or whether it was something that he set up, I’m sort of split in the middle. But I don’t think he did it by his own hand. I don’t think it would be possible for him to break three bones in his neck that way, that violently. There’s too many holes in this whole thing.\n\nLachlan Cartwright: Epstein’s death was a conspiracy: a conspiracy of clowns. From the overworked prison guards to the chronic mismanagement of the Manhattan Metropolitan Correctional Center where he died, it allowed for a very desperate man who had finally run out of cards and favors to play to kill himself. You gotta think somewhere Epstein is having the last laugh.\n\nSign Up for Court Appearances A newsletter by New York’s Choire Sicha, covering the Ghislaine Maxwell trial. Email This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Vox Media, LLC Terms and Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us."}, {"url": "https://www.buzzfeednews.com/article/ryanmac/marcus-mark-epstein-white-nationalist-vdare-wall-street", "page_content": "The publication of Epstein’s pieces is the latest instance of the far-right, hyper-nationalist fringe becoming part of the mainstream conservative movement over the last decade. The Journal, which ran a piece from Epstein titled “Antitrust, Free Speech and Google” earlier this month, declined to say if it looked into his history before publishing his work.\n\n\"We know Mark Epstein as we identified him for our readers: a freelance writer and antitrust attorney who has written on antitrust and regulation for a variety of publications,” a Journal spokesperson said to BuzzFeed News in a statement. “We are not aware that he has written under any other byline.\"\n\nIn a statement provided to BuzzFeed News, Epstein explained his decision to write under a pen name.\n\n“During college and immediately thereafter I struggled with alcohol, which led to — among other problems — a misdemeanor assault charge in 2007 which was ultimately dismissed,” he wrote. “I changed my name in an attempt to move past the media-internet driven outrage culture which refuses to allow people to move on with their lives. I submitted these articles under this name, with an accurate bio, and which expressed my honest opinions.”\n\nIn the years since the assault charge, Epstein told BuzzFeed News he became sober, graduated near the top of his class from University of Penn Law School, and developed concerns about the power wielded by big tech companies.\n\nBut Epstein, who worked for the conservative commentator Pat Buchanan, was a key figure in nativist and white nationalist political circles from the mid-2000s to the early 2010s. In 2006, he founded the now-defunct Robert A. Taft Club alongside Spencer and Kevin DeAnna, another leading white nationalist. Invited speakers to that club included influential white supremacist Jared Taylor and the journalist John Derbyshire, who would eventually be fired from the National Review in 2012 for a racist column.\n\nEpstein also helped run Youth for Western Civilization, a far-right student group, founded by DeAnna and Taylor, whose members included white separatist and neo-Nazi Matthew Heimbach. From 2004 to 2009, Epstein, under his full name, wrote for VDare, where his posts came with provocative headlines like “[Howard] Dean Is Right - GOP Is \"The White Party.\" So?”; “It Depends On What Your Definition Of \"Jim Crow\" Is”; and “White Refugees And Culture.”\n\nIn a statement, Epstein denied that he had ever held white nationalist beliefs. “As a proud American of Jewish and Asian descent, I obviously have never been white nationalist nor held their beliefs.”\n\nUnder the name “Mark Epstein,” the former congressional staffer stays away from the topics of race and immigration. In his most recent piece for the Journal in June, he wrote that “antitrust law isn’t a panacea” and shouldn’t be used to combat perceived bias against conservative voices, as advocated by President Donald Trump. He made a similar argument in a piece for the Hill in 2017.\n\nThe Hill, which ran at least two pieces from Epstein in 2017, said that the editor who approved the pieces no longer works at the publication so it does “not know what vetting he performed at the time.”\n\n“We would never knowingly post material from a racist writer and have no information identifying this writer as such,” a Hill spokesperson said. “The Hill generally posts opinion submissions from well-known writers but we occasionally post columns by lesser known individuals. We make efforts to check their backgrounds, as well as requiring them to sign paperwork verifying their identities, backgrounds and the absence of conflicts of interest.”\n\nEpstein also coauthored at least four op-eds in the Journal, Forbes, and US News and World Report with Michigan State University law professor Adam Candeub, who represented Taylor in a lawsuit against Twitter. US News did not respond to a request for comment, while Forbes said it had taken down Candeub and Epstein’s post for further review.\n\n“Epstein appeared on our platform without permission as a co-author on one of our contributor’s posts,” a Forbes spokesperson told BuzzFeed News, noting that he was never an authorized contributor. “Forbes guidelines explicitly prohibit adding co-authors without permission.”\n\nThe editor of National Review, which published a piece from Epstein in 2017, did not respond to a request for comment.\n\nIn an email, Candeub declined to say if he was aware of Epstein’s past.\n\n“I can only say that the Mark Epstein whom I know is a brilliant antitrust lawyer and superb writer,” he wrote. “We share an interest in the market power of big tech.”"}, {"url": "https://www.britannica.com/topic/publishing/Era-of-the-popular-press", "page_content": "In the industrial era, technological advances were routinely appropriated by the newspaper industry to broaden the geographic reach of a paper’s coverage, streamline news-gathering efforts, or speed the production and delivery of newspapers. Ottmar Mergenthaler’s introduction of the Linotype machine in 1886—first in the United States, then in Britain and other industrialized countries—allowed existing newspapers to increase substantially their production and circulation. The change also spurred the launch of new papers in an increasingly competitive business. In the battle to win more readers, U.S. newspapers set new standards of sensationalism—and frequently announced new sales records—with the birth of the ruthless “yellow” journalism (an expression derived from a cartoon character called the “Yellow Kid,” whose creator, Richard F. Outcault, was at the centre of the competition between American newspaper publishers William Randolph Hearst and Joseph Pulitzer). In Britain the print runs of papers such as The Times and the Daily Telegraph quickly reached the 100,000 mark in the second half of the 19th century. Newspapers were becoming part of mass-market industry, and in so doing they were shaking off many of their former ties with the literary world. This was evidenced in the revolutionary 1890s by the emergence of the “press baron,” a businessman who owned a chain of several newspapers, by the increasing importance of advertising revenue, and by the use of unorthodox methods of winning more readers.\n\nOne outcome of the new ownership pattern was the gradual disappearance of the old press baron, who, as editor-proprietor, had tended to combine the roles of professional editor and management executive. Even the editor was to suffer a loss of personal impact as fame was increasingly won by columnists —men and women who were given regular columns to express forceful points of view or divulge society secrets. Among the most important political columnists of the 1920s were David Lawrence of the United States News, Frank Kent of the Baltimore Sun, Mark Sullivan of the New York Herald-Tribune, and Walter Lippmann of the New York World. Such writers could gain considerable national followings when their columns or articles were syndicated by major chains.\n\nCommercial consolidation into larger publishing groups continued immediately after World War I , when the struggle for circulation intensified. First published in 1919, the New York Daily News was written to a ruthless recipe of sex and sensationalism by Joseph Medill Patterson , and it sparked off a war with Hearst’s Daily Mirror and Bernarr Macfadden ’s Daily Graphic, both launched in 1924. The Graphic closed in 1932, and the Mirror ceased publication in 1963, selling many of its feature columns and comics to the Daily News, which underwent several ownership changes before being bought by Mortimer B. Zuckerman in 1993. Takeovers often led to title mergers or the complete disappearance of titles. In 1931 the New York Morning, Evening, and Sunday World titles were bought by the Scripps-Howard chain; the morning and Sunday editions were dropped, and the Evening World was merged with the New York Evening Telegram, an action that suited Americans’ preference for afternoon papers at that time. Newspapers with extensive circulations could command the attention of the larger advertisers, and this reinforced the disappearance of smaller titles in favour of a few high-circulation papers.\n\nBy 1900 there were half a dozen well-known newspaper barons in the United States. Hearst, whose collections at one time ran to 42 papers, was the most acquisitive of the early owners. Another early chain-builder was Edward Scripps , who began purchasing newspapers in 1878. Scripps bought small, financially insecure newspapers and set them on their feet by installing capable young editors, who were given a share of the profits as an incentive to improve circulation. The editors were always urged “to serve that class of people and only that class of people from whom you cannot even hope to derive any other income than the one cent a day that they pay for your newspaper.” Scripps wanted his papers to be of genuine service to the public, and though he succeeded in making money from them his motive was never exclusively profit. But the commercial advantage of owning newspaper chains soon became obvious, as it allowed newsprint to be bought on favourable terms and syndicated articles to be used to the fullest. Scripps’s methods were adopted by his rivals and by newspaper proprietors in other countries as the idea of chain ownership spread. Inevitably, the profitable newspapers attracted outside investors whose motives were commercial, not journalistic. This new type of proprietor was exemplified by Frank A. Munsey , who bought and merged many newspapers between 1916 and 1924, including the Sun and the Herald in New York City. In describing Munsey and others like him, the American author and editor William Allen White wrote that he possessed “the talent of a meat packer, the morals of a money changer, and the manners of an undertaker.”\n\nIt was inevitable that some newspapers, and especially those that refrained from irresponsible tactics, would suffer circulation losses. One of these was The New York Times , which only recovered after it was acquired in 1896 by newspaper investor Adolph S. Ochs , who promoted responsible journalism and reestablished The New York Times as the city’s leading serious journal. The paper’s slogans, “All the news that’s fit to print” and “It will not soil the breakfast cloth,” indicated Ochs’s commitment to fair-minded news reporting.\n\nWhereas Pulitzer was never afraid to unearth public wrongdoing and to crusade against it, the next press baron to influence New York City newspapers, William Randolph Hearst , was prepared to go to much further extremes in creating a headline story. Like Pulitzer, Hearst had learned about newspaper proprietorship in the brash, tough frontier West. His San Francisco Examiner (from 1880) had gained a reputation for exposing and cleaning up political corruption. By the time he came to New York City in 1895, however, Hearst was interested in circulation-building sensation at any price, even if it meant dressing up complete fabrications as news. This approach was revealed all too clearly in 1898, when Hearst’s Morning Journal was challenging Pulitzer’s World in the New York circulation battle. The Journal published exaggerated stories and editorials about the political tensions between the United States and Spain that stirred the country to a pitch of hysteria . Eventually, war—over Cuba —was triggered by the sinking of the U.S. battleship Maine in Havana harbour, but Hearst nevertheless claimed credit for the war in a banner headline: “How Do You Like the Journal’s War?” Hearst is reported to have cabled his illustrator in Cuba, demanding pictures of atrocities for the Journal. The illustrator found no atrocities to illustrate and informed Hearst, who replied, “You furnish the pictures and I’ll furnish the war.” Alarmist headlines and attention-grabbing campaigns were only one of the tactics introduced by Hearst. Equally important in the sensationalist yellow journalism of the era were vivid pictorial designs—photographs, cartoons, graphic illustrations—and the new Sunday supplements, which focused on human-interest stories and comic strips .\n\nThe number of American newspaper titles more than doubled between 1880 and 1900, from 850 to nearly 2,000. In addition to the weekly newspaper serving the smaller community , every major city had its own daily newspaper, and the metropolis had become the site of circulation battles between several titles. In New York City the newspaper business was shaken up by the arrival of Joseph Pulitzer , who is often credited with changing the course of American journalism. An immigrant from Hungary , Pulitzer had proved his ability in St. Louis , Missouri , where he had bought and merged two local papers , the Post and the Dispatch. In New York City Pulitzer bought the failing New York World and in three years raised its circulation from 15,000 to 250,000, at that time the highest figure achieved by any newspaper in the world. With a series of stunts and campaigns, Pulitzer revitalized the established formulas of sensationalism and idealism, taking one step further the qualities of editorial independence and exciting journalism that had been introduced to an earlier generation of New Yorkers by Bennett ’s Herald and Greeley ’s Tribune (see above).\n\nThe British press was slower to emerge as a popular, sensational medium, but a major turning point came in 1855 when the stamp tax was abolished. This was preceded in 1853 by the abolition of the duty on advertisements, and the more liberal climate exposed a remarkable national appetite for newspapers of all kinds. The abolition of taxes and duties, including that on paper in 1861, brought down the prices of newspapers, and this alone was enough to create what were, for the time, very high circulations. By 1861 sales of the Daily Telegraph had risen to a daily average of 130,000, double that of The Times. Abolition of the tax on paper was said to have brought an additional £12,000 a year to the Telegraph. The Telegraph’s daily circulation exceeded 240,000 by 1877, then the highest in the world. The Telegraph, however, differed greatly from the more colourful New York papers. It was a worthy newspaper, more than half of it being taken up with reports of proceedings in Parliament, but its readers and those of The Times came almost exclusively from the growing mercantile middle class, for whom the two papers provided the writings of many of the best authors of the day at a comfortably affordable price. Journalistic independence was usually upheld, but as the party political hostility between William Ewart Gladstone and Benjamin Disraeli grew sharper, each paper became more partisan, a development that in turn stimulated sales.\n\nLater in the century the British press began to adapt to the demand for less exacting reading matter. In 1888 the halfpenny evening Star was launched by the Irish nationalist politician T.P. O’Connor. Aiming at a wider public than any previous newspaper, the Star incorporated short, lively news items of human interest in a bold, attractive display. The new paper also gave good racing tips, thus endearing it to a group of men who have always contributed substantially to the circulation of what are known in the United Kingdom as the “populars.” Another contemporary evening paper, the Pall Mall Gazette, adopted American tactics for some of its crusades. In a series of articles entitled “The Maiden Tribute to Modern Babylon”, W.T. Stead exposed the prostitution of young girls in London by himself procuring one. (Indeed as a result he served a term in jail.) This early example of investigative journalism—in which the reporter creates hard news stories by investigating (sometimes clandestinely and by direct experience from inside) illegal or scandalous activities—led to the passing of the Criminal Law Amendment Act in 1885, which improved protection of minors. It also highlighted the power of the press to define what is unacceptable to society.\n\nAt the turn of the century, popular journalism came into its own in Britain with the rise of Alfred Harmsworth (later Lord Northcliffe), who can be called the first of the British press barons both for his title and for his enduring influence on the press. During his lifetime he owned, at various times, the Daily Mail, the Mirror, The Times, and the Observer. As his first effort he launched a cheap weekly magazine in 1888, when he was only age 23. Using short sentences, short paragraphs, and short articles, the new style of editing was aimed at attracting a large following among those who had learned to read as a result of the 1870 Education Act that made school compulsory for all British children. In 1894 Harmsworth bought the Evening News, and by combining his editing style with some of the methods of American yellow journalism, he quadrupled its circulation within a year. In 1896 came Harmsworth’s main innovation, the Daily Mail, which within three years was selling more than 500,000 copies a day. This was more than twice the figure reached by any competing paper up to that time. The Daily Mail went on to sell more than one million copies a day during the South African (Boer) War (1899–1902).\n\nAs “A Penny Paper for One Halfpenny” the Daily Mail was sold to the reader at a low price only made possible by the paper’s lucrative revenue from advertising. It was the first British paper to be based deliberately on advertising revenue rather than on sales revenue and the first to publish circulation figures audited independently by a chartered accountant. These figures gave advertisers evidence that the Daily Mail was reaching the public in sufficient numbers to warrant increasingly expensive advertising space. Another Mail slogan, “The Busy Man’s Daily Journal,” emphasized the snappy editorial style that followed the Harmsworth dictum of “Explain, simplify, clarify.” This approach guided the new type of journalists known as subeditors, whose job was to rewrite stories in the “house” style, to compose headlines, and, if necessary, to add a little seasoning to the original story.\n\nAnother Harmsworth innovation was the tabloid newspaper, which was to revolutionize the popular press in the 20th century. The term tabloid was coined by Harmsworth when he designed and edited an experimental issue of the New York World, produced for New Year’s Day, 1900. The tabloid halved the size of the newspaper page, which allowed easier handling by the reader, but it also suited the new, curtailed size of articles and the more numerous pages required per issue. In the long run, however, the term tabloid has come to define the popular newspaper more in style than in physical characteristics. The first successful tabloid was Harmsworth’s Daily Mirror (1903). Originally launched as a newspaper for “gentlewomen,” the Mirror had been a failure, but the tabloid format, together with a halfpenny cover price and numerous photographs, made the new picture paper an immediate success, with circulation running at more than one million copies by 1914. Lord Northcliffe sold the Mirror to his brother Lord Rothermere in 1913. Meanwhile, the equally successful tabloid Daily Sketch had been begun in Manchester in 1909 by Sir Edward Hulton.\n\nLike the American press barons, Northcliffe constantly intervened in the production of his newspapers, sending orders under his preferred appellation of “Chief” to the editors not only of the Mail and the Mirror but also of The Times (from 1908) and the Observer (from 1905), both of which he owned until his death in 1922. His control over newspaper content was never more apparent than during World War I, when the British Official Press Bureau was set up to control the amount of war information available to the public through the newspapers. Though accepting that a certain degree of censorship was necessary to conceal military intelligence from the enemy, Northcliffe nevertheless boldly defied the bureau over its cover-up of an ammunition shortage. Such defiance confirmed the independence of the press from government, but the influence of proprietors was itself to become an important issue in press freedom. This was typified after World War I by the intensive campaign for Empire Free Trade in Lord Beaverbrook’s Daily Express. The preservation of the British Empire was the guiding passion of Max Aitken, who had been raised to the peerage as Lord Beaverbrook in 1917. A Canadian-born journalist who took the Express into second place in national circulation behind the Daily Mirror, Beaverbrook continued to thrust his viewpoint on the editors of his papers for many years, although his campaigns for free trade within the empire and, after World War II, commonwealth trade preference were unsuccessful. Through the Daily Express, the Sunday Express (started in 1918), and the London Evening Standard (acquired 1923), Beaverbrook’s opposition to Britain’s attempts to join the European Economic Community (EEC; later the European Community, which became the primary component of the European Union), was given a regular airing. Beaverbrook admitted to the first Royal Commission on the Press that if an editor took a divergent view on, for example, the empire, he would be “talked out of it.” So talented was Beaverbrook as a publisher and journalist that the Express newspapers gained and kept many readers for life, even though it is doubtful whether the issues of empire and EEC membership were of passionate concern to them.\n\nThe circulation “war of the tabs” that broke out in New York City in the 1920s was copied in Britain in the 1930s, bringing with it numerous circulation-boosting stunts. Prizes for readers had been introduced as early as the 1890s, when Harmsworth offered a pound sterling per week for life for the reader who could guess the value of gold in the Bank of England on a given day. In the 1920s one paper offered free insurance to subscribers, but this soon proved too costly to maintain. In 1930 the Daily Herald offered gifts to woo new readers. Although they were condemned by the Newspaper Proprietors’ Association (later known as the Newspaper Publishers Association), gift schemes proliferated among other newspapers, with the Herald eventually achieving a circulation of two million, the highest in the world. Many of the new readers were stolen from other papers—the Daily Mirror saw its figure drop from more than one million to 700,000 by 1934—but newspapers in general acquired 1.5 million new readers, so that by the end of the decade there was a national newspaper aimed at every socioeconomic class. The Daily Mirror was revived by its editor, Harry Bartholomew, to become a true working-class paper with a radical political voice, although the winning of new readers—circulation eventually topped four million—was mostly due to the shameless use of the techniques of yellow journalism."}, {"url": "https://pro.wsj.com/press-room/wall-street-journal-introduces-wsj-podcasts/", "page_content": "Wall Street Journal Introduces WSJ Podcasts\n\nTwelve news, opinion and lifestyle podcasts expand the Journal’s\n\nOn-demand digital news offerings\n\nNEW YORK (December 8, 2015) – The Wall Street Journal today introduced WSJ Podcasts, expanding its on-demand digital news offerings with 12 podcasts highlighting award-winning reporting from the Journal, Barron’s and MarketWatch. The podcasts range from daily updates with What’s News, Your Money Matters and Tech News Briefing to the weekly Opinion: Potomac Watch and Free for All with Jason Gay.\n\nThe WSJ Podcasts provide need-to-know information by delving into markets, world and political news, with briefings on tech, money and top headlines. The shows include three daily and nine weekly podcasts and showcase popular columns, writers and sections from the Journal, MarketWatch and Barron’s.\n\nStarting on December 11, the WSJ Podcasts will be distributed in partnership with The Slate Group’s Panoply podcast network.\n\nWSJ Podcasts are available for listening at WSJ.com/podcasts and via download at iTunes, Stitcher, Deezer, and SoundCloud.\n\n“WSJ Podcasts give voice to the Journal’s world class reporting, creating new opportunities for audiences to engage with our news, analysis and commentary,” said John Wordock, Executive Producer, WSJ Podcasts.\n\n“Through WSJ Podcasts, advertisers can develop an even deeper relationship with our ambitious audience; the world’s most important decision makers,” said Trevor Fellows, Global Head of Advertising, The Wall Street Journal. “We’re looking forward to helping clients tell their stories via this new platform.”\n\nThe WSJ Podcast lineup includes:\n\nWhat’s News : Updates on business, the economy and politics, mirrored after the popular Journal column and the new app\n\n: Updates on business, the economy and politics, mirrored after the popular Journal column and the new app Tech News Briefing : What’s hot and happening in technology featuring WSJD and MarketWatch reporters\n\n: What’s hot and happening in technology featuring WSJD and MarketWatch reporters Your Money Matters : Insights on Wall Street, investing, personal finance trends and strategies for watching your wealth with Veronica Dagher\n\n: Insights on Wall Street, investing, personal finance trends and strategies for watching your wealth with Veronica Dagher Opinion: Potomac Watch: Paul Gigot, editor of the WSJ editorial pages, hosts a lively weekly roundtable\n\nPaul Gigot, editor of the WSJ editorial pages, hosts a lively weekly roundtable Opinion: Foreign Edition: The Journal’s Bret Stephens and Mary Kissel tackle hot-button issues overseas\n\nThe Journal’s Bret Stephens and Mary Kissel tackle hot-button issues overseas Free for All with Jason Gay : Sports, fun and more from the Journal’s pages with columnist Jason Gay\n\n: Sports, fun and more from the Journal’s pages with columnist Jason Gay Off Duty : A guide to life and leisure with updates on travel, food, drinks, gadgets, style and design\n\n: A guide to life and leisure with updates on travel, food, drinks, gadgets, style and design WSJ Speakeasy : Celebrity interviews and updates on movies, TV and arts with WSJ Speakeasy staffers\n\n: Celebrity interviews and updates on movies, TV and arts with WSJ Speakeasy staffers MoneyBeat : An entertaining look at the markets and money with the Journal’s Paul Vigna and Stephen Grocer\n\n: An entertaining look at the markets and money with the Journal’s Paul Vigna and Stephen Grocer Heard on the Street : Market news, fresh insights and financial analysis from the Journal’s Heard on the Street team\n\n: Market news, fresh insights and financial analysis from the Journal’s Heard on the Street team MarketWatch Money, Markets & More : Consumer tips, personal finance insights and Millennial Mailbag with MarketWatch’s Catey Hill and Quentin Fottrell\n\n: Consumer tips, personal finance insights and Millennial Mailbag with MarketWatch’s Catey Hill and Quentin Fottrell This Week with Barron’s: Highlights from the latest edition of Barron’s Magazine\n\nWSJ Podcasts join the Journal’s recently enhanced suite of digital products, including What’s News, WSJ City, the fully responsive WSJ.com and new apps for both iOS and Android, as well as an Apple Watch app.\n\nAbout The Wall Street Journal\n\nThe Wall Street Journal is a global news organization that provides leading news, information, commentary and analysis. Published by Dow Jones, The Wall Street Journal engages readers across print, digital, mobile, social, and video. Building on its heritage as the preeminent source of global business and financial news, the Journal includes coverage of U.S. & world news, politics, arts, culture, lifestyle, sports, and health. It holds 36 Pulitzer Prizes for outstanding journalism."}]}