{"Richard Allen Epstein's books include Simple Rules for a Complex World (1995), The Casemaker's Manual (1996), Skepticism and Freedom (2003), and Design for Liberty (2011).": [{"url": "https://www.hup.harvard.edu/catalog.php?isbn=9780674808218", "page_content": "Too many laws, too many lawyers—that’s the necessary consequence of a complex society, or so conventional wisdom has it. Countless pundits insist that any call for legal simplification smacks of nostalgia, sentimentality, or naiveté. But the conventional view, the noted legal scholar Richard Epstein tells us, has it exactly backward. The richer texture of modern society allows for more individual freedom and choice. And it allows us to organize a comprehensive legal order capable of meeting the technological and social challenges of today on the basis of just six core principles. In this book, Epstein demonstrates how.\n\nThe first four rules, which regulate human interactions in ordinary social life, concern the autonomy of the individual, property, contract, and tort. Taken together these rules establish and protect consistent entitlements over all resources, both human and natural. These rules are backstopped by two more rules that permit forced exchanges on payment of just compensation when private or public necessity so dictates. Epstein then uses these six building blocks to clarify many intractable problems in the modern legal landscape. His discussion of employment contracts explains the hidden virtues of contracts at will and exposes the crippling weaknesses of laws regarding collective bargaining, unjust dismissal, employer discrimination, and comparable worth. And his analysis shows how laws governing liability for products and professional services, corporate transactions, and environmental protection have generated unnecessary social strife and economic dislocation by violating these basic principles.\n\nSimple Rules for a Complex World offers a sophisticated agenda for comprehensive social reform that undoes much of the mischief of the modern regulatory state. At a time when most Americans have come to distrust and fear government at all levels, Epstein shows how a consistent application of economic and political theory allows us to steer a middle path between too much and too little."}, {"url": "https://books.google.com/books/about/SIMPLE_RULES_FOR_A_COMPLEX_WORLD.html?id=b3n_J-gTUnMC", "page_content": "Richard A. Epstein Harvard University Press , 1995 - 361 pages , 1995 - Law 0 Reviews Reviews aren't verified, but Google checks for and removes fake content when it's identified Too many laws, too many lawyers--that's the necessary consequence of a complex society, or so conventional wisdom has it. Countless pundits insist that any call for legal simplification smacks of nostalgia, sentimentality, or naiveté. But the conventional view, the noted legal scholar Richard Epstein tells us, has it exactly backward. The richer texture of modern society allows for more individual freedom and choice. And it allows us to organize a comprehensive legal order capable of meeting the technological and social challenges of today on the basis of just six core principles. In this book, Epstein demonstrates how.\n\n\n\nThe first four rules, which regulate human interactions in ordinary social life, concern the autonomy of the individual, property, contract, and tort. Taken together these rules establish and protect consistent entitlements over all resources, both human and natural. These rules are backstopped by two more rules that permit forced exchanges on payment of just compensation when private or public necessity so dictates. Epstein then uses these six building blocks to clarify many intractable problems in the modern legal landscape. His discussion of employment contracts explains the hidden virtues of contracts at will and exposes the crippling weaknesses of laws regarding collective bargaining, unjust dismissal, employer discrimination, and comparable worth. And his analysis shows how laws governing liability for products and professional services, corporate transactions, and environmental protection have generated unnecessary social strife and economic dislocation by violating these basic principles.\n\n\n\nSimple Rules for a Complex World offers a sophisticated agenda for comprehensive social reform that undoes much of the mischief of the modern regulatory state. At a time when most Americans have come to distrust and fear government at all levels, Epstein shows how a consistent application of economic and political theory allows us to steer a middle path between too much and too little. Preview this book »"}, {"url": "https://www.amazon.com/Simple-Rules-Complex-Richard-Epstein/dp/0674808215", "page_content": "On the cover of this book, the eminent Professor of Law, Richard A. Epstein (RAE) writes: \" The government works best when it establishes the rules of the road, not when it seeks to determine the composition of the traffic\". Above that is, I think, the book's thesis which states: \" ...Regulation takes certain elements from the owner's bundle of rights and transfers them to the state, where they again fall prey to the same difficulties that arose when central planning was defended on a grand scale\". Actually, central planning was promoted and promulgated throughout the Cold War from the time of Stalin. For those of us who lived through that time, and worked in the private sector, Socialism, and the promise of Socialism has been a total failure and the latter, a fraud perpetrated by politicians and bureaucrats for their own self aggrandizement, and perpetrated by Unions, especially Public Service Unions, the latter being the consummate means of securing their own fortune and power by becoming our masters through actual rule.\n\nFortunately for the reader, RAE manages to subdue his passions (whereas this reviewer frequently doesn't), and it makes his books appreciated by all readers wishing enlightenment on the way forward out of the clutches of the present 'soft tyrannies' which have resulted in the political, social, economic and constitutional turmoil of most if not all nations, including those of America and Canada, not to mention those of Europe.\n\nIn the preface, RAE writes that with this book, he \"hopes to lay bare some of the foundational difficulties in the modern law for readers without specialized legal training and experience....It is a book about legal doctrine, and about social structures and the incentives that these legal doctrines help create\".\n\nThroughout the book, RAE exhibits real knowledge of the history of law, beginning with the Bible (although not referenced as such), but acknowledges the impact that our Judeo / Christian religions and theologies have had on our laws and in references to the need for best individual behaviour. Moses was the first to declare that religion has to do with one's conduct in every sphere of life, for example: worship, civil & criminal law, neighbourliness, health and cleanliness. Because Christianity infested the Roman Empire long before its acceptance as the official state religion of Rome by the Emperor Constantine (c.324 A. D.), it was incorporated into the operations of those imperial dominions, helping to form the foundations of democracy and the rule of the Common Law, which were firmly in place by the time James I was crowned the King of England. The Common Law emanates from the people through catalogs of standing decisions from previous trials in all actions, in the laws of property, contract, tort, negligence, nuisance, and procedure, et cetera.\n\nOn the other hand, more and more statutes have been crafted by governments ostensibly to redress some \"new wrong\", with an ulterior motive of growing a bureaucracy, where none had previously existed.RAE tells us that in most cases, the common Law works better than the regulation, and why.\n\nRAE also demonstrates a knowledge of Economics (Classical) and its importance in the framework of the workings of laws and regulations. RAE quotes such economics philosophers as Frederick Hayek and John Locke among others.\n\nFrom these bases, RAE then informs us how to cut through the complexity, and then, how to develop simple rules, discussing autonomy & property; Contract; Torts, Necessity, Coordination and Just Compensation, Labour, employment discrimination, Professional Liability; Product Liability law, the Corporation, Environmental Protection and Private Property.\n\nLawyers, Law students and those who may be exposed to legal questions in the course of their work (including politicians) should certainly read this book. RAE describes what was; what is; what works; what doesn't, and so much more. I highly recommend this book as a permanent part of anyone's library!"}, {"url": "https://www.hup.harvard.edu/catalog.php?isbn=9780674808218&content=reviews", "page_content": "“Richard A. Epstein, a professor of law at the University of Chicago, has a record of proposing radical and extreme alterations in key areas of law—alterations that perhaps initially could be dismissed as so far from the center of legal thinking as to be of only theoretical interest but then turn out to have much more political life in them than one could have thought possible… Mr. Epstein has to be taken seriously, and not only because of the power of his reasoning and his authoritative command of the common law and political philosophy… The reasoning is strong, the knowledge of specific areas of policies is deep, and behind them stands his basic commitment to a more productive and efficient society… It is bracing to undergo a cold bath in the pure doctrine of the simple rules, and in many areas they will give us some practical guidance.” —Nathan Glazer, The New York Times Book Review\n\n“A book called The Death of Common Sense: How Law is Suffocating America by attorney Philip Howard has captured the attention of Washington’s policy community with its maddening accounts of overzealous regulation and complex litigation. But Mr. Howard’s appeal for enforcing rules with a dose of common sense never sets forth a framework for bringing about legal simplification. That’s why Richard Epstein’s new book…is such a suitable companion to Mr. Howard’s battle cry. Mr. Epstein…believes that the traditional common law is actually more attuned to the modern world… He argues that the more complex the world, the less bureaucrats and lawmakers can know about how everything interacts, and the more perverse and inefficient the law will become… Mr. Epstein’s relentlessly logical arguments tell us why we should return to the tried-and-true rules of the common law. Like manners, the common law has proven useful and long lasting precisely because it is so well-suited to a world of strangers.” —John H. Fund, The Wall Street Journal\n\n“This book is a tour de force of legal history and analysis. It would have been timeless in any event, but the current Congress’ agenda makes it timely as well. Property rights, product and professional liability, a flat tax and environmental protection are now front and center; labor law reform and comparable worth may soon crowd their way onto the agenda as well. Long-range vision and wisdom are too seldom combined with topical analysis, but Simple Rules for a Complex World has this invaluable quality… What Mr. Epstein has accomplished, then, is not the fabrication of a framework but the distillation of one. He has articulated and rationalized basic principles of law in a creative way that shows these principles to have both historical and theoretical primacy. At a time when much legal scholarship is devoted to the deconstruction of the root of our legal order, Mr. Epstein has written a book of reconstruction.” —Roger Clegg, The Washington Times\n\n“A persuasive argument for the American legal system’s return to the common-sense rules of common law, by a distinguished professor at the University of Chicago.” —The Chicago Tribune"}, {"url": "https://www.goodreads.com/author/list/132710.Richard_A_Epstein", "page_content": "Showing 30 distinct works.\n\nsort by popularity original publication year title average rating number of pages\n\nAntitrust Consent Decrees in Theory and Practice: Why Less Is More\n\nEqual Opportunity Or More Opportunity?: The Good Thing About Discrimination\n\nDesign for Liberty: Private Property, Public Administration, and the Rule of Law\n\n* Note: these are all the books on Goodreads for this author. To add more books, click here"}, {"url": "https://www.hup.harvard.edu/catalog.php?isbn=9780674808218&content=bios", "page_content": "Select shipping destination United States of America United Kingdom Canada ────────── Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius, and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo, Democratic Republic of the [Congo–Kinshasa] Congo, Republic of the [Congo–Brazzaville] Cook Islands Costa Rica Côte d’Ivoire Croatia Cuba Curaçao Cyprus Czechia Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini [Swaziland] Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See [Vatican City] Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People’s Republic of [North Korea] Korea, Republic of [South Korea] Kuwait Kyrgyzstan Lao People’s Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena, Ascension, and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Türkiye Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom of Great Britain and Northern Ireland United States Minor Outlying Islands United States of America Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands (British) Virgin Islands (U.S.) Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe\n\nSelect shipping country United States of America United Kingdom Canada ────────── Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius, and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo, Democratic Republic of the [Congo–Kinshasa] Congo, Republic of the [Congo–Brazzaville] Cook Islands Costa Rica Côte d’Ivoire Croatia Cuba Curaçao Cyprus Czechia Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini [Swaziland] Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See [Vatican City] Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People’s Republic of [North Korea] Korea, Republic of [South Korea] Kuwait Kyrgyzstan Lao People’s Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena, Ascension, and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Türkiye Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom of Great Britain and Northern Ireland United States Minor Outlying Islands United States of America Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands (British) Virgin Islands (U.S.) Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe\n\nRelated Subjects"}, {"url": "https://archive.org/details/simplerulesforco0000epst", "page_content": "xiv, 361 pages ; 24 cm\n\n\n\nIncludes bibliographical references (pages 335-350) and indexes\n\n\n\nIntroduction: Too Many Lawyers, Too Much Law -- I. Cutting through Complexity. 1. The Virtues of Simplicity. 2. The Enemies of Simplicity -- II. The Simple Rules. 3. Autonomy and Property. 4. Contract. 5. Torts. 6. Necessity, Coordination, and Just Compensation. 7. Take and Pay -- III. The Rules in Action. 8. Contracting for Labor. 9. Employment Discrimination and Comparable Worth. 10. Professional Liability for Financial Loss. 11. The Origins of Product Liability Law. 12. The Contemporary Product Liability Scene. 13. The Internal Life of the Corporation. 14. The Corporation and the World. 15. Environmental Protection and Private Property -- Conclusion: The Challenges to Simple Rules\n\nNotes\n\nobscured text front cover.\n\n\n\nAccess-restricted-item true Addeddate 2020-03-05 17:02:38 Boxid IA1790323 Camera USB PTP Class Camera Collection_set printdisabled External-identifier urn:oclc:record:1151397461\n\nurn:lcp:simplerulesforco0000epst:lcpdf:9f304b40-729c-4c95-9522-2965ca8804f9\n\nurn:lcp:simplerulesforco0000epst:epub:37e9d8a4-aecb-44d9-b3a2-7d53f02b5f8b Foldoutcount 0 Grant_report Arcadia #4117 Identifier simplerulesforco0000epst Identifier-ark ark:/13960/t22c7kk21 Invoice 1853 Isbn 0674808207\n\n9780674808201\n\n0674808215\n\n9780674808218 Lccn 94040364 Ocr tesseract 4.1.1 Ocr_converted abbyy-to-hocr 1.1.4 Ocr_detected_lang en Ocr_detected_lang_conf 1.0000 Ocr_detected_script Latin Ocr_module_version 0.0.12 Ocr_parameters -l eng Old_pallet IA17604 Openlibrary_edition OL1114411M Openlibrary_work OL16959168W Page_number_confidence 92.09 Pages 394 Partner Innodata Ppi 300 Rcs_key 24143 Republisher_date 20200305202201 Republisher_operator associate-rochelle-sesaldo@archive.org Republisher_time 544 Scandate 20200305105913 Scanner station51.cebu.archive.org Scanningcenter cebu Scribe3_search_catalog isbn Scribe3_search_id 9780674808201 Tts_version 3.5-initial-88-gad68d72 Show More Show Less\n\nFull catalog record MARCXML"}, {"url": "https://mises.org/library/simple-rules-complex-world-richard-epstein", "page_content": "Tags\n\nA Libertarian's Plea\n\nMises Review 1, No. 3 (Fall 1995)\n\nSIMPLE RULES FOR A COMPLEX WORLD\n\nRichard A. Epstein\n\nHarvard University Press, 1995. xiv + 361 pgs.\n\nRichard Epstein's excellent book is packed full of arguments which continually engage the reader, even if they do not always compel assent. He constructs a powerful case for a free-market social order, with a strictly limited state.\n\nAt times, Epstein compromises with the state more than he should. Nevertheless, this book ranks among the firmest defenses of private property ever written by an American academic.\n\nEpstein starts in an unusual place for a work of legal theory, the widespread public perception, shown for instance by lawyer jokes, that there \"is too much law and too many lawyers\" (p. ix).\n\nLawyers, most people believe, burden the economy with costly and often frivolous suits; but no remedy seems in sight, given the complexity and detail of legal regulations. Given that there is too much law, there are not too many lawyers: we cannot cut down on the number of lawyers without a drastic simplification of the law. It is this far from simple task that Epstein here undertakes.\n\nIn doing so, Epstein shows himself well aware of two objections that threaten to derail his project. First, it would be easy to devise very simple rules that would be utterly deplorable. \"If simplicity is the only goal of a legal system, I can think of just two rules for determining the outcome of a lawsuit that would satisfy a criterion of ultimate simplicity. The first of these rules says that the plaintiff always wins . . . if you don t like that rule, there's always its mirror image, which says that the defendant always wins\" (p. 32). Simplicity, then, does not alone suffice.\n\nIf so, is it not then open to a defender of complex rules to enter a demurrer? Though complexity may count against a rule, may this not be outweighed by other factors? How can one tell whether a legal system is too complex, absent an overall judgment on the goodness of the system?\n\nEpstein has his reply ready to hand. He is not after absolute simplicity: rather, what he seeks is governmental rules that generate more incentives than they impose costs. \"The central trade-off that must be examined at all times is this: does the creation of some administrative structure . . . also create some desirable incentives for individual behavior such that the gain from this particular administrative expenditure is justified in terms of the overall improvement in incentive structures\" (pp. 33 34)?\n\nEpstein's real goal, then, is a set of efficient rules, and simplicity is no more than a means to this end. Nevertheless, it is a vital means, since complex rules are liable to be inefficient. Epstein constructs an excellent case for simplicity in the law; but I wish he had at least mentioned the once-famous essay of Rudolf von Jhering, The Struggle for Law. Jhering maintained that the assertion of rights was essential to the development of law; thus, legal battles were to be desired rather than shunned. Epstein would I think have found in this essay a valuable counterpoint to his own line of thought.\n\nIf, then, what Epstein principally seeks is efficiency, we must know what he means by that. Here there is little mystery: he understands it in a way analogous to neoclassical economists characterization of the market in equilibrium. In particular, the market in equilibrium is Pareto optimal: no change can be made which will make at least one person better off while making no one else worse off. This notion of efficiency underlies the variant of utilitarianism which Epstein defends, leading to difficulties in his argument. But of these more later.\n\nThe first of Epstein's rules is for those familiar with the Lockean tradition a familiar landmark: \"individual self- ownership\" (p. 54). He defends this principle against the competing view of John Rawls. According to Rawls, people do not deserve their natural abilities, which are from the moral point of view arbitrary. Epstein rightly rejects Rawls's opinion that abilities and talents are \"collective assets.\"\n\nEpstein proceeds to defend a \"first possession\" rule for the acquisition of property and follows with strong support for freedom of contract. He notes a fact familiar to all students of Austrian economics: the parties to an exchange are, from their own point of view, better off than they would otherwise have been. If not, no voluntary trade would take place. Thus, assuming no effects on third parties, a voluntary exchange always increases utility. Quite the contrary, of course, with a coerced exchange.\n\nBut Epstein goes too far when he says this: \"Theft arises when one person takes something without the consent of the other . . . it is at best a constant-sum game, for what one party gains the other necessarily loses\" (p. 76). Of course Epstein is right that the stolen item does not multiply. But what is at issue is utility, and it does not at all follow that no act of theft can increase utility. What if the thief derives more utility from the good than its rightful owner? This objection presupposes that interpersonal comparisons of utility can be made, which is eminently questionable but Epstein does allow them, at least if made in a non-rigorous fashion (p. 142).\n\nHere I think Epstein would have profited from attention to Murray Rothbard's fundamental \"Toward a Reconstruction of Utility and Welfare Economics.\" Rothbard disallows interpersonal comparisons: he makes the more limited, and more defensible, claim that in any coerced transfer, we cannot determine that overall utility has increased.\n\nSo far, though, our objections to Epstein have been mere matters of detail. Things change, unfortunately, with his fifth rule, particularly as applied to the government. Our author does not forbid all coerced exchanges. Sometimes necessity demands that one seize the goods of another. If such a case arises, compensation is owed the person whose property is taken, so that he is restored to a position as well off as he was before the taking.\n\nApplied to governmental action, Epstein's rule works in this way: \"Often the government needs to obtain material resources from individuals in order to supply services to the public at large. . . . [H]oldout and coordination problems preclude that consensual solution for certain key assets, such as specific parcels of land needed for the construction of a fort or a public road. This problem is best met by government taking with payment of just compensation. Ideally, the individual citizen is left indifferent to the loss\" (p. 128).\n\nAll of this seems to me radically unsatisfactory. Suppose that someone owns a parcel of land that the government needs in order to build a road. (Why, incidentally, must roads be provided by the government?) If the land had to be purchased, the owner could secure a large sum of money by threatening a holdout. If the land is taken, and its owner compensated, in what sense is he rendered indifferent to the loss? He has been deprived of his profit-making opportunity. The \"take-and-pay\" rule that Epstein favors does not fulfill the principle, basic to his position, that governmental actions be Pareto superior. Only on an etiolated notion of compensation is the owner left equally well off.\n\nWhat Epstein here in effect says is that the state may take your property, so long as you are not left too much worse off. Is it not a sad commentary on our times that, to the likes of Senator Biden, this counts as a \"right-wing extremist\" position on the takings issue?\n\nObviously, this is neither the time nor place to offer a treatment of cases of necessity. I shall confine myself to two observations. In those cases of necessity that strike one intuitively as calling for remedial action (e.g., the person who demands from a victim of thirst in the desert a million dollar fee for a drink of water), something is going on of a morally dubious character other than so-called \"strategic-bargaining.\" Second, if one does hold that it is wrong for someone, by taking advantage of a threat position to seize virtually all the gains from trade, it does not follow that he may be deprived of any gain at all.\n\nAfter he presents his rules, Epstein applies them to a number of legal issues, including employment discrimination, product liability, and environmental protection. In all of the areas he treats, Epstein displays a formidable mastery of case law. He exposes to devastating effect the fallacies of governmental programs that often make almost everyone, including their intended beneficiaries, worse off.\n\nIn one instance, though, Epstein's discussion seems incomplete. In his excellent discussion of employment discrimination, he notes that sometimes what appears to be discrimination against certain groups is from the employer s point of view economically rational. Sometimes, e.g., an employer may find it profitable to hire a racially homogeneous workforce.\n\nEpstein's point is well taken, but his discussion fails to speak to a key issue in the debate on discrimination. What about those who contend that discrimination is morally wrong, even in cases where it is economically rational? To answer them, a more robust moral theory is required than the \"Pareto-optima\"l brand of utilitarianism that Epstein professes.\n\nAs his last chapter, \"The Challenges to Simple Rules,\" makes clear, Epstein disagrees; and it is here that I find myself most fundamentally at odds with him.\n\nHe contrasts the utilitarian system he favors with moral intuitions that lack a systematic basis. Since his theory usually arrives at the same conclusions as do the intuitions about justice, why not jettison separate resort to them? \"Make way for Occam's Razor. If a smaller class of assumptions can be used to account for all the relevant results, why treat the intuitive sense of justice as the irreducible primitive of the system or even as an important side constraint\" (pp. 319-20)?\n\nHere Epstein erects an unreal antithesis. Why are unsupported intuitions the sole alternative to his theory? What about other moral theories (including intuitionism) of a non-utilitarian sort? Here once more attention to Rothbard and Robert Nozick would have helped.\n\nAnd Epstein's theory is vulnerable to pressure from another direction. What about utilitarian theories that do not operate under the Pareto constraint that Epstein favors? Why should a change that greatly benefits a large number of people be ruled out simply because a few are made somewhat worse off? (Suppose circumstances make compensation impossible.) Why, on utilitarian grounds, should measures of this kind always be disallowed? Epstein's view must thus confront both non-utilitarian theories and more robust utilitarian accounts. Faced with a war on two fronts, can it survive?\n\nIf Simple Rules For a Complex World frequently rouses me to dissent, it is nevertheless a distinguished work that merits the attention of anyone interested in ethics and legal philosophy."}, {"url": "https://www.abebooks.com/9780674808218/Simple-Rules-Complex-World-Richard-0674808215/plp", "page_content": "Richard A. Epstein is Laurence A. Tisch Professor of Law at New York University School of Law, Peter and Kirsten Bedford Senior Fellow at the Hoover Institution, and James Parker Hall Distinguished Service Professor Emeritus of Law and Senior Lecturer at the University of Chicago Law School.\n\nA book called 'The Death of Common Sense: How Law is Suffocating America' by attorney Philip Howard has captured the attention of Washington's policy community with its maddening accounts of overzealous regulation and complex litigation. But Mr. Howard's appeal for enforcing rules with a dose of common sense never sets forth a framework for bringing about legal simplification. That's why Richard Epstein's new book...is such a suitable companion to Mr. Howard's battle cry. Mr. Epstein...believes that the traditional common law is actually more attuned to the modern world...He argues that the more complex the world, the less bureaucrats and lawmakers can know about how everything interacts, and the more perverse and inefficient the law will become...Mr. Epstein's relentlessly logical arguments tell us why we should return to the tried-and-true rules of the common law. Like manners, the common law has proven useful and long lasting precisely because it is so well-suited to a world of strangers. (John H. Fund Wall Street Journal)\n\n\n\nRichard A. Epstein, a professor of law at the University of Chicago, has a record of proposing radical and extreme alterations in key areas of law--alterations that perhaps initially could be dismissed as so far from the center of legal thinking as to be of only theoretical interest but then turn out to have much more political life in them than one could have thought possible...Mr. Epstein has to be taken seriously, and not only because of the power of his reasoning and his authoritative command of the common law and political philosophy...The reasoning is strong, the knowledge of specific areas of policies is deep, and behind them stands his basic commitment to a more productive and efficient society...It is bracing to undergo a cold bath in the pure doctrine of the simple rules, and in many areas they will give us some practical guidance. (Nathan Glazer New York Times Book Review)\n\n\n\nSimple Rules for a Complex World is a clear, consistent, libertarian economic approach to the law that should keep you interested from start to finish. (Charles W. Chesbro Trial)\n\n\n\nThis book is a tour de force of legal history and analysis. It would have been timeless in any event, but the current Congress' agenda makes it timely as well. Property rights, product and professional liability, a flat tax and environmental protection are now front and center; labor law reform and comparable worth may soon crowd their way onto the agenda as well. Long-range vision and wisdom are too seldom combined with topical analysis, but Simple Rules for a Complex World has this invaluable quality...What Mr. Epstein has accomplished, then, is not the fabrication of a framework but the distillation of one. He has articulated and rationalized basic principles of law in a creative way that shows these principles to have both historical and theoretical primacy. At a time when much legal scholarship is devoted to the deconstruction of the root of our legal order, Mr. Epstein has written a book of reconstruction. (Roger Clegg Washington Times)\n\n\n\nA persuasive argument for the American legal system's return to the common-sense rules of common law, by a distinguished professor at the University of Chicago. (Chicago Tribune)\n\n\"About this title\" may belong to another edition of this title."}]}