{"Richard Allen Epstein is also a visiting professor at the University of Chicago Law School.": [{"url": "https://www.law.uchicago.edu/faculty/epstein", "page_content": "\"The Private Law Connections to Public Nuisance Law: Some Realism about Today's Intellectual Nominalism,\" 17 Journal of Law, Economics and Policy 282 (2022).\n\n\"The Application of Antitrust Law to Labor Markets — Then and Now,\" 15 New York University Journal of Law and Liberty 327 (2022). ssrn www\n\n\"A Rational Immigration Policy,\" 22 Hoover Digest 91 (2022).\n\n\"The Excessive Ambitions of Stakeholder Ideology,\" 77 Business Lawyer 755 (2022).\n\n\"Antitrust Overreach in Labor Markets: A Response to Eric Posner,\" 15 New York University Journal of Law and Liberty 407 (2022). www\n\n\"Market Competition as a Constitutional Virtue: A Defense of Lochner and a Revitalized Dormant Commerce Clause,\" 16 New York University Journal of Law and Liberty 308 (2022).\n\n\"Rules and Reasons, Public and Private: On the Use and Limits of Simple Rules 25 Years Later,\" 52 European Journal of Law and Economics 363 (2021). www\n\n\"Getting It Right: The push for open borders ignores the hard questions. How to ask--and answer--them.,\" 3 Hoover Digest 108 (2021). www\n\n\"Liability Rules for Autonomous Vehicles,\" 10 Journal of Entrepreneurship and Public Policy 218 (2021).\n\n\"College Isn't Free--Nor Should It Be: Wiping out student debt would involve staggering costs and unfair taxation. Worse, loan forgiveness would violate the principle of making degrees pay for themselves.,\" Hoover Digest __ (2021). www\n\n\"Birth Rights and Birth Wrongs Through A Common Law Lens: Why the No Liability Regime Is Likely to Ensure,\" 23 Journal of Contemporary Legal Issues 67 (2021).\n\n\"Delegation of Powers: A Historical and Functional Analysis,\" 24 Chapman Law Review 659 (2021).\n\n\"Valuation Blunders in the Law of Eminent Domain,\" 96 Notre Dame Law Review 1441 (2021).\n\n\"Property Rights: Long and Skinny,\" 14 International Journal of the Commons 567 (2020). www\n\n\"The Civil Rights Juggernaut,\" 2020 University of Illinois Law Review 1541 (2020).\n\n\"Joint Employment: The Unintended and Unpredictable \"Employment\" Relationship,\" 45 University of Dayton Law Review 489 (2020) (with Timothy Tymkovich, Phillip Miscimarra, Richard Griffin & Pepper Crutcher).\n\n\"The Acquisition of Property Rights in Animals: A Brief Comment on Oliar and Stern: Right on Time: First Possession in Property and Intellectual Property,\" 100 Boston University Law Review Online 11 (2020).\n\n\"Chicago Betrays the Public Trust for Obama,\" Wall Street Journal __ (2019). www\n\n\"The Many Sins of NEPA,\" 6 Texas A&M Law Review 1 (2019).\n\n\"The Necessity of Convergence in Private Law,\" 92 Southern California Law Review 751 (2019). www\n\n\"Introduction to the Symposium on Convergence and Divergence in Private Law,\" 92 Southern California Law Review 741 (2019) (with Yun-chien Chang). www\n\n\"Citizenship, Alienage and Territoriality: Why Both Pennoyer and Eisentrager are Wrong as a Matter of General Jurisprudence and American Constitutional Law,\" 55 Willamette Law Review 421 (2019).\n\n\"Showcase Panel I: What is Regulation For?,\" 98 Nebraska Law Review 109 (2019) (with Philip Hamburger, Kathryn Kovacs, Jon D. Michaels & Britt Grant). www\n\n\"The Regulatory Hour: The History, Law and Economics of Minimum Wage and Maximum Hours Legislation,\" 12 NYU Journal of Law & Liberty 477 (2019). www\n\n\"Structural Protections for Individual Rights: The Indispensable Role of Article III - Or Even Article I - Courts in the Administrative State,\" 26 George Mason Law Review 777 (2019).\n\n\"Judge Koh's Monopolization Mania: Her Novel Antitrust Assault against Qualcomm Is an Abuse of Antitrust Theory,\" 98 Nebraska Law Review 241 (2019). www\n\n\"The Nature of the Religious Firm,\" 21 Journal of Markets and Morality 141 (2018).\n\n\"Sitaraman’s Mistaken Case for the Middle-Class Constitution,\" 98 Boston University Law Review Online 15 (2018).\n\n\"Regulatory Enforcement Under New York's Martin Act: From Financial Fraud to Global Warming,\" 14 New York University Journal of Law and Business 805 (2018). cu\n\n\"Introduction to Decentralization and Development,\" 102 Minnesota Law Review 1485 (2018) (with Shitong Qiao). cu\n\n\"The Supreme Court Tackles Patent Reform: A Series of Articles Examining Oil States Energy Services, LLC v. Greene's Energy Group, LLC,\" 19 Federalist Society Review 88 (2018). cu\n\n\"Positive and Negative Externalities in Real Estate Development,\" 102 Minnesota Law Review 1493 (2018). cu\n\n\"The Wrong Rights, or: The Inescapable Weaknesses of Modern Liberal Constitutionalism,\" 85 University of Chicago Law Review 403 (2018). cu\n\n\"A Not Quite Contemporary View of Privacy,\" 41 Harvard Journal of Law and Public Policy 95 (2018). cu\n\n\"The Role of Exit Rights: What the Theory Of the Firm Says About the Conduct of Brexit Negotiations,\" 39 Cardozo Law Review 825 (2018). cu\n\n\"A Common Law for the First Amendment,\" 41 Harvard Journal of Law and Public Policy 1 (2018). cu\n\n\"The Misconceived Modern Attack on Right to Work Laws,\" 2017 University of Chicago Legal Forum 95 (2017). cu\n\n\"Hayek’s Constitution of Liberty - A Guarded Retrospective,\" 30 Review of Austrian Economics 415 (2017). cu\n\n\"Why Incentives for \"Patent Holdout\" Threaten to Dismantle FRAND, and Why It Matters,\" 32 Berkeley Technology Law Journal 1381 (2017) (with Kayvan B. Noroozi). cu\n\n\"In Memoriam: Michael E. Levine\", 11 New York University Journal of Law and Liberty 1 (2017). cu\n\n\"Dual Sovereignty Under the Constitution: How Best to Protect States Against Federal Taxation and Regulation,\" 49 Arizona State Law Journal 936 (2017). cu\n\n\"Disappointed Expectations: How The Supreme Court Failed to Clean Up Takings Law in Murr v. Wisconsin,\" 11 New York University Journal of Law and Liberty 151 (2017). cu\n\n\"Compounding Errors: Why Heightened Regulation and Taxation Are Bad Antidotes for Recessions and Income Inequality,\" 17 Theoretical Inquiries in Law 711 (2017). cu\n\n\"Missed Opportunities, Good Intentions: The Takings Decisions of Justice Antonin Scalia,\" 6 British Journal of American Legal Studies 109 (2017). cu\n\n\"Review of Peter T. Leeson, Anarchy Unbound: Why Self-Governance Works Better Than You Think,\" 30 Review of Austrian Economics 259 (2017). cu\n\n\"My Methodological Flip-Flop on Individual Liberty,\" 14 Econ Journal Watch 288 (2017). cu\n\n\"Concepts before Percepts: The Central Place of Doctrine in Legal Scholarship,\" 84 University of Chicago Law Review 99 (2017). cu\n\n\"The Unfinished Business Of Horne v. Department Of Agriculture,\" 10 New York University Journal of Law and Liberty 734 (2016). cu\n\n\"Property Rights And Governance Strategies: How Best To Deal With Land, Water, Intellectual Property, And Spectrum,\" 14 Colorado Technology Law Journal 181 (2016). cu\n\n\"The Deepening EU Blindness on Privacy: A Pointed Response to Professor Martin Scheinin,\" 12 European Consititutional Law Review 349 (2016). cu\n\n\"The ECJ's Fatal Imbalance,\" 12 European Consititutional Law Review 330 (2016). cu\n\n\"The Two Sides Of Magna Carta: How Good Government Sometimes Wins Out Over Public Choice,\" 47 International Review of Law and Economics 10 (2016). cu\n\n\"The Double-Edged Sword of State Constitutional Law,\" 9 New York University Journal of Law and Liberty 723 (2016). cu\n\n\"From Common Law to Environmental Protection: How the Modern Environmental Movement Has Lost Its Way,\" 23 Supreme Court Economic Review 141 (2016). cu\n\n\"The Role of Guidances in Modern Administrative Procedure: The Case for De Novo Review,\" 8 Journal of Legal Analysis 47 (2016). cu\n\n\"The Ends of Capitalism: An Introduction,\" 23 Supreme Court Economic Review 1 (2016) (with Mario J. Rizzo). cu\n\n\"Rational Basis Review And FDA Regulation: Why The Two Do Not Mix,\" 14 Georgetown Journal of Law and Public Policy 417 (2016). cu\n\n\"Linguistic Relativism And The Decline Of The Rule Of Law,\" 39 Harvard Journal of Law and Public Policy 583 (2016). cu\n\n\"Returning to Common-Law Principles of Insider Trading After United States v. Newman,\" 125 Yale Law Journal 1150 (2016). cu www\n\n\"The Mutual Dependency of Force and Law in American Foreign Policy,\" 83 University of Chicago Law Review 89 (2016) (with Mario Loyola). cu\n\n\"Innovation and Inequality: The Separability Thesis,\" 39 Harvard Journal of Law and Public Policy 1 (2016). cu\n\n\"How Spontaneous? How Regulated?: The Evolution Of Property Rights Systems,\" 100 Iowa Law Review 2341 (2015). cu\n\n\"Introduction to Spontaneous Order and Emergence of New Systems of Property,\" 100 Iowa Law Review 2249 (2015). cu\n\n\"Inevitability in Law and Literature: A Strained Relationship,\" 76 Modern Language Quarterly 271 (2015). cu www\n\n\"An Unapologetic Defense of the Classical Liberal Constitution,\" 128 Harvard Law Review Forum 145 (2015). cu www\n\n\"Entick v. Carrington and Boyd v. United States: Keeping the Fourth and Fifth Amendments on Track,\" 82 University of Chicago Law Review 27 (2015). cu\n\n\"The Political Economy of Crowdsourcing: Markets for Labor, Rewards, and Securities,\" 82 University of Chicago Law Review Dialogue 35 (2015). cu www\n\n\"Contractual Solutions for Employment Law Problems,\" 38 Harvard Journal of Law and Public Policy 789 (2015). cu\n\n\"Redistribution Within Collective Organizations: What Corporations, Condominiums and Unions Tell Us about the Proper Use of Government Power,\" 8 New York University Journal of Law and Liberty 279 (2014). cu\n\n\"Public Accommodations Under the Civil Rights Act of 1964: Why Freedom of Association Counts as a Human Right,\" 66 Stanford Law Review 1241 (2014). cu\n\n\"The Common Law Foundations of the Takings Clause: The Disconnect Between Public and Private Law,\" 30 Touro Law Review 265 (2014). cu\n\n\"Modern Environmentalists Overreach: A Plea for Understanding Background Common Law Principles,\" 37 Harvard Journal of Law and Public Policy 23 (2014). cu\n\n\"The Use and Limits of Self-Valuation Systems,\" 81 University of Chicago Law Review 109 (2014). cu\n\n\"Beyond Textualism: Why Originalist Theory Must Apply General Principles of Interpretation to Constitutional Law,\" 37 Harvard Journal of Law and Public Policy 705 (2014). cu\n\n\"The Advantages of Outrage,\" 116 Technology Review 9 (2013) (Letter to the editor). cu\n\n\"Fixing Obamacare: The Virtues of Choice, Competition and Deregulation,\" 68 New York University Annual Survey of American Law 493 (2013) (with David A. Hyman). cu\n\n\"In Praise of Suzanna Sherry and Judicial Activism,\" 16 Green Bag 443 (2013). cu\n\n\"Labor Unions: Saviors or Scourges?,\" 41 Capital University Law Review 1 (2013). cu\n\n\"The Perilous Position of the Rule of Law and the Administrative State,\" 36 Harvard Journal of Law and Public Policy 5 (2013). cu\n\n\"Can Technological Innovation Survive Government Regulation?,\" 36 Harvard Journal of Law and Public Policy 87 (2013). cu\n\n\"The Takings Clause and Partial Interests in Land: On Sharp Boundaries and Continuous Distributions,\" 78 Brooklyn Law Review 589 (2013). cu\n\n\"Harmonization, Heterogeneity and Regulation: CESL, the Lost Opportunity for Constructive Harmonization,\" 50 Common Market Law Review 207 (2013). cu\n\n\"Free Trade and Free Immigration: Why Domestic Competitive Injury Should Never Influence Government Policy,\" 80 University of Chicago Law Review 201 (2013). cu\n\n\"Immigration Law and Institutional Design,\" 80 University of Chicago Law Review 1 (2013) (with Adam B. Cox & Eric A. Posner). cu\n\n\"The Economic Consequences of the Obama Reelection: How Stagnation Has Vanquished Growth,\" 80 Southern Economic Journal 282 (2013). cu\n\n\"Tushnet's Lawless World: A Response to Mark Tushnet, Book Review, Epstein's Best of All Possible Worlds: The Rule of Law, 80 U Chi L Rev 487 (2013),\" 80 University of Chicago Law Review Dialogue 1 (2013). cu\n\n\"Intellectual Property and the Law of Contract: The Case Against \"Efficient Breach\",\" 9 European Review of Contract Law 345 (2013). cu\n\n\"Big Law and Big Med: The Deprofessionalization of Legal and Medical Services,\" 38 International Review of Law and Economics 64 (2013). cu\n\n\"Jersey Central Power & Light Co v Federal Energy Regulatory Comission: Robert Bork on Public Utility Rate Regulation--and Lochner v New York,\" 80 University of Chicago Law Review Dialogue 193 (2013). cu\n\n\"Foreword: The Unfinished Business of the Supreme Court - An Introduction,\" 8 New York University Journal of Law and Liberty 137 (2013). cu\n\n\"Legal Remedies for Patent Infringement: From General Principles to FRAND Obligations for Standard Essential Patents,\" 9 Competition Policy International 69 (2013) (with David Kappos). cu\n\n\"Introduction: Erie Railroad at Seventy-Five,\" 10 Journal of Law, Economics and Policy 1 (2013) (with Michael Greve). cu\n\n\"Intellectual Property and the Law of Contract: The Case against \"Efficient Breach\",\" 2 European Property Law Journal 278 (2013).\n\n\"Letter to the Editor,\" 10 First Things __ (2012). cu\n\n\"The Property Rights Decisions of Justice Sandra Day O'Connor: When Pragmatic Balancing Is Not Enough,\" 1 Brigham-Kanner Property Rights Conference Journal 177 (2012). cu\n\n\"Law in the Hands of the Politicians: The Cycles of American Politics,\" 12 Common Law Review 3 (2012). cu\n\n\"Physical and Regulatory Takings: One Distinction Too Many,\" 64 Stanford Law Review 99 (2012). cu www\n\n\"Judicial Engagement with the Affordable Care Act: Why Rational Basis Analysis Falls Short,\" 19 George Mason Law Review 931 (2012). cu\n\n\"Unifying Copyright: An Instrumentalist's Response to Shyamkrishna Balganesh,\" 125 Harvard Law Review Forum 120 (2012). cu\n\n\"Forgotten No More: A Review of John D. Inazu’s Liberty’s Refuge: The Forgotten Freedom of Assembly (reviewing John D. Inazu, Liberty's Refuge: The Forgotten Freedom of Assembly (2012)),\" 13 Engage: The Journal of the Federalist Society's Practice Groups 153 (2012). cu www\n\n\"The Role of Accreditation Commissions in Higher Education: The Troublesome Case of Dana College,\" 79 University of Chicago Law Review 83 (2012). cu\n\n\"The Natural Law Bridge between Private Law and Public International Law,\" 13 Chicago Journal of International Law 47 (2012). cu\n\n\"Constitutional Ratemaking and the Affordable Care Act: A New Source of Vulnerability,\" 38 American Journal of Law and Medicine 243 (2012) (with Paula M. Stannard). cu\n\n\"The FTC, IP, and SSOS: Government Hold-up Replacing Private Coordination,\" 8 Journal of Competition Law and Economics 1 (2012) (with F. S. Kieff & Daniel F. Spulber). cu\n\nResponse, \"Bring on the Heavy Constitutional Artillery: A Brief Response to Professor Mitchell’s ‘Reconsidering Murdock’\", Legal Workshop: University of Chicago Law Review __ (2011). cu\n\n\"The Natural Law Influences on the First Generation of American Constitutional Law: Reflections on Philip Hamburger's Law and Judicial Duty,\" 6 Journal of Law, Philosophy and Culture 103 (2011). cu\n\n\"A New Birth of Economic Freedom (reviewing David Bernstein, Rehabilitating Lochner: Defending Individual Rights Against Progressive Reform (2011)),\" XI(4) Claremont Review of Books 38 (2011). cu\n\n\"The Constitutionality of the Patient Protections and Affordable Care Act,\" 12 Engage: The Journal of the Federalist Society's Practice Groups 4 (2011) (debate with Jesse Choper). cu\n\n\"Government By Waiver,\" 7 National Affairs 39 (2011). cu www\n\n\"Can We Design an Optimal Constitution? Of Structural Ambiguity and Rights Clarity,\" 28 Social Philosophy and Policy 290 (2011). cu\n\n\"Beware of Prods and Pleas: A Defense of the Conventional Views on Tort and Administrative Law in the Context of Global Warming,\" 121 Yale Law Journal 317 (2011). cu www\n\n\"Durbin’s Folly: The Erratic Course of Debit Card Markets,\" 7(2) Competition Policy International 58 (2011). cu\n\n\"Bundle-of-Rights Theory as a Bulwark Against Statist Conceptions of Property,\" 8(3) Econ Journal Watch 223 (2011). cu www\n\n\"The Protection of 'Hot News': Putting Balganesh’s 'Enduring Myth' About International New Service v. Associated Press in Perspective,\" 111 Columbia Law Review Sidebar 79 (2011). cu www\n\n\"Licensing of Intellectual Property,\" 78 University of Chicago Law Review 1 (2011) (with Omri Ben-Shahar & Jonathan S. Masur). cu\n\n\"The Constitutional Paradox of the Durbin Amendment: How Monopolies are Offered Constitutional Protections Denied to Competitive Firms,\" 63 Florida Law Review 1307 (2011). cu\n\n\"Of Pleading and Discovery: Reflections on Twombly and Iqbal with Special Reference to Antitrust,\" 2011 University of Illinois Law Review 187 (2011). cu\n\n\"The Coase Centennial,\" 54 Journal of Law and Economics S1 (2011). cu\n\n\"Inside the Coasean Firm: Why Variations in Competence and Taste Matter,\" 54 Journal of Law and Economics S41 (2011). cu\n\n\"Direct Democracy: Government of the People, by the People, and for the People,\" 34 Harvard Journal of Law and Public Policy 819 (2011). cu\n\n\"The Constitutionality of Proposition 8,\" 34 Harvard Journal of Law and Public Policy 879 (2011). cu\n\n\"Branded versus Generic Competition - A Kind Word for the Branded Drugs,\" 3 Hastings Science and Technology Law Journal 459 (2011). cu\n\n\"Citizens United v. FEC: The Constitutional Right That Big Corporations Should Have But Do Not Want,\" 34 Harvard Journal of Law and Public Policy 639 (2011). cu\n\n\"Littoral Rights under the Takings Doctrine: The Clash between the IUS Naturale and Stop the Beach Renourishment The Very Idea of Judicial Takings,\" 6 Duke Journal of Constitutional Law and Public Policy 37 (2011). cu\n\n\"Do Accounting Rules Matter? - The Dangerous Allure of Mark to Market,\" 36 Journal of Corporation Law 513 (2011) (with M. Todd Henderson). cu\n\n\"Questioning the Frequency and Wisdom of Compulsory Licensing for Pharmaceutical Patents,\" 78 University of Chicago Law Review 71 (2011) (with F. S. Kieff). cu\n\n\"Plain Meaning in Context: Can Law Survive Its Own Language?,\" 6 New York University Journal of Law and Liberty 359 (2011). cu\n\n\"Heller's Gridlock Economy in Perspective: Why There is Too Little, Not Too Much Private Property,\" 53 Arizona Law Review 51 (2011). cu\n\n\"Breakdown of the Social Democratic State: Taking a Fresh Look at Waldron's Dignity, Rights, and Responsibilities,\" 43 Arizona State Law Journal 1169 (2011). cu\n\n\"The Constitutional Protection of Trade Secrets and Patents under the Biologics Price Competition and Innovation Act of 2009,\" 66 Food and Drug Law Journal 285 (2011). cu\n\n\"Are We Lifting All Boats or Only Some?: Equity versus Excellence and the Talented Tenth,\" 11 Education Next 47 (2011) (with Daniel Pianko, Jon Schnur & Joshua Wyner). cu\n\n\"The Spurious Constitutional Distinction Between Takings and Regulation,\" 11 Engage: The Journal of the Federalist Society's Practice Groups __ (2010). cu www\n\n\"What Tort Theory Tells Us about Federal Preemption: The Tragic Saga of Wyeth v. Levine,\" 65 New York University Annual Survey of American Law 485 (2010). cu\n\n\"A Big Year for the First Amendment: Church and State at the Crossroads: Christian Legal Society v. Martinez,\" 2009-10 Cato Supreme Court Review 105 (2010). cu\n\n\"NRA v. City of Chicago : Does the Second Amendment Bind Frank Easterbrook?,\" 77 University of Chicago Law Review 997 (2010). cu\n\n\"Toward a General Theory of Tort Law: Strict Liability in Context,\" 4 Journal of Tort Law 6 (2010). cu\n\n\"Reassessing the State and Local Government Toolkit: Introduction,\" 77 University of Chicago Law Review 1 (2010) (with Julie A. Roin & Lee Fennell ). cu\n\n\"Academic Fraud Today: Its Social Causes and Institutional Responses,\" 21 Stanford Law and Policy Review 135 (2010). cu\n\n\"The Classical Liberal Alternative to Progressive and Conservative Constitutionalism (reviewing Jack M. Balkin and Reva B. Siegel, eds.,The Constitution in 2020 (2009)),\" 77 University of Chicago Law Review 887 (2010). cu\n\n\"Takings Law Made Hard: A Novel Property Rights Challenge Is a Constitutional Morass,\" 32 Regulation 4 (2010). cu\n\n\"Why We Need Term Limits for Congress: Four in the Senate, Ten in the House,\" 78 Tennessee Law Review 849 (2010). cu\n\n\"Why I Will Never Be a Keynesian,\" 33 Harvard Journal of Law and Public Policy 387 (2010). cu\n\n\"Obama's Constitution: The Passive Virtues Writ Large,\" 26 Constitutional Commentary 183 (2010). cu\n\n\"How to Undermine Tax Increment Financing: The Lessons of City of Chicago v. ProLogis,\" 77 University of Chicago Law Review 121 (2010). cu\n\n\"Carbon Dioxide: Our Newest Pollutant,\" 43 Suffolk University Law Review 797 (2010). cu\n\n\"Bleak Prospects: How Health Care Reform Has Failed in the United States,\" 15 Texas Review of Law & Politics 1 (2010). cu\n\n\"Executive Power in Political and Corporate Contexts,\" 12 University of Pennsylvania Journal of Constitutional Law 277 (2010). cu\n\n\"Political Bankruptcies: How Chrysler and GM Have Changed the Rules of the Game,\" 59 Freeman 8 (2009). cu www\n\nResponse, \"Protect Us, Lord, from Title VII: A Response to Gelbach, Klick, and Wexler\", The Legal Workshop: University of Chicago Law Review __ (2009). cu\n\nResponse, \"Not so Private Takings: A Response to Abraham Bell’s Private Takings\", The Legal Workshop: University of Chicago Law Review __ (2009). cu\n\n\"Overtreated, or Overregulated? (reviewing Shannon Brownlee, Overtreated: Why Too Much Medicine is Making Us Sicker and Poorer (2008)),\" 28 Health Affairs 920 (2009). cu\n\n\"The Going Private Phenomenon: Causes and Implications,\" 76 University of Chicago Law Review 1 (2009) (with M. Todd Henderson). cu\n\n\"Activity Levels under the Hand Formula: A Comment on Gilo and Guttel,\" 108 Michigan Law Review First Impressions 37 (2009). cu\n\n\"Public Use in a Post-Kelo World,\" 17 Supreme Court Economic Review 151 (2009). cu\n\n\"Lessons from the Common Law of Reasonable Expectations,\" 24 Berkeley Technology Law Journal 1199 (2009). cu\n\n\"The Case for Field Preemption of State Laws in Drug Cases,\" 103 Northwestern University Law Review 463 (2009). cu\n\n\"A Speech on the Structural Constitution and the Stimulus Program,\" 4 Charleston Law Review 395 (2009). cu\n\n\"Privacy and the Third Hand: Lessons from the Common Law of Reasonable Expectations,\" 24 Berkeley Technology Law Journal 1199 (2009). cu\n\n\"Against Permititis: Why Voluntary Organizations Should Regulate the Use of Cancer Drugs,\" 94 Minnesota Law Review 1 (2009). cu\n\n\"The Disintegration of Intellectual Property - A Classical Liberal Response to a Premature Obituary,\" 62 Stanford Law Review 455 (2009). cu\n\n\"The Regulation of Sovereign Wealth Funds: The Virtues of Going Slow,\" 76 University of Chicago Law Review 111 (2009) (with Amanda M. Rose). cu\n\n\"Property Rights, State of Nature Theory, and Environmental Protection,\" 4 New York University Journal of Law and Liberty 1 (2009). cu\n\n\"Monopolization Follies: The Dangers of Structural Remedies under Section 2 of the Sherman Act,\" 76 Antitrust Law Journal 205 (2009). cu\n\n\"Debate, Implicit Race Bias and the 2008 Presidential Election: Much Ado about Nothing?,\" 157 University of Pennsylvania Law Review 210 (2009) (with Gregory S. Parks & Jeffrey J. Rachlinski). cu\n\n\"Is Group Selection Necessary? An Alternative Interpretation of Homogenous Middleman Groups: Comments on Janet Landa's Paper,\" 10 Journal of Bionomics 279 (2008). cu\n\n\"Should Antidiscrimination Laws Limit Freedom of Association? The Dangerous Allure of Human Rights Legislation,\" 25 Social Philosophy and Policy 123 (2008). cu\n\n\"The Subprime Crisis: Why One Bad Turn Leads to Another at Pepperdine University School of Law,\" 2 Journal of Business, Entrepreneurship and the Law 198 (2008). cu\n\n\"Property Rights, Public Use, and the Perfect Storm: An Essay in Honor of Bernard H. Siegan,\" 45 San Diego Law Review 612 (2008). cu\n\n\"Decentralized Responses to Good Fortune and Bad Luck Moral and Legal Luck,\" 9 Theoretical Inquiries in Law 309 (2008). cu\n\n\"Federal Preemption, and Federal Common Law, in Nuisance Cases,\" 102 Northwestern University Law Review 551 (2008). cu\n\n\"The Many Faces of Fault in Contract Law: Or How to Do Economics Right, Without Really Trying,\" 107 Michigan Law Review 1461 (2008). cu\n\n\"The Human and Economic Dimensions of Altruism: The Case of Organ Transplantation,\" 37 Journal of Legal Studies 459 (2008). cu\n\n\"The Reflections and Responses of a Legal Contrarian,\" 44 Tulsa Law Review 647 (2008). cu\n\n\"David P. Currie (1936-2007) In Memoriam,\" 75 University of Chicago Law Review 1 (2008) (with Gerhard Casper, David Gossett & Herma H. Kay). cu\n\n\"Cybersecurity in the Payment Card Industry,\" 75 University of Chicago Law Review 203 (2008) (with Thomas P. Brown). cu\n\n\"Why the Modern Administrative State Is Inconsistent with the Rule of Law,\" 3 New York University Journal of Law and Liberty 491 (2008). cu\n\n\"Happiness and Revealed Preferences in Evolutionary Perspective,\" 33 Vermont Law Review 559 (2008). cu\n\n\"A Structural Interpretation of the Second Amendment: Why Heller is (Probably) Wrong on Originalist Grounds,\" 59 Syracuse Law Review 171 (2008). cu\n\n\"The AT&(and)T Consent Decree: In Praise of Interconnection Only,\" 61 Federal Communications Law Journal 149 (2008). cu\n\n\"Federalism: Executive Power in Wartime,\" 5 Georgetown Journal of Law and Public Policy 309 (2007) (with Roger Pilon, Geoffrey R. Stone & John C. Yoo). cu\n\n\"Influence of Pharmaceutical Funding on the Conclusions of Meta-analyses,\" 335 British Medical Journal 1167 (2007). cu\n\n\"Zoning: Deliberative Democracy at Zero Prices,\" 136 Daedalus 67 (2007). cu\n\n\"Contingent Commissions in Insurance: A Legal and Economic Analysis,\" 3 Competition Policy International 281 (2007). cu\n\n\"Conflicts of Interest in Health Care: Who Guards the Guardians?,\" 50 Perspectives in Biology and Medicine 72 (2007). cu\n\n\"David Josiah Brewer Addresses Yale Law School,\" 10 Green Bag 483 (2007). cu www\n\n\"From Penn Central to Lingle: The Long Backwards Road,\" 40 John Marshall Law Review 593 (2007). cu www\n\n\"Tribute to Bernard Meltzer,\" 74 University of Chicago Law Review 427 (2007). cu\n\n\"Pharmaceutical Industry at Risk: How Excessive Government Regulation Stifles Innovation,\" 82 Clinical Pharmacology and Therapeutics 131 (2007). cu\n\n\"Defanging IRBs: Replacing Coercion with Information,\" 101 Northwestern University Law Review 735 (2007). cu\n\n\"How to Create - or Destroy - Wealth in Real Property,\" 58 Alabama Law Review 741 (2007). cu\n\n\"Coniston Corp v. Village of Hoffman Hills: How to Make Procedural Due Process Disappear,\" 74 University of Chicago Law Review 1689 (2007). cu\n\n\"The Neoclassical Economics of Consumer Contracts,\" 92 Minnesota Law Review 803 (2007). cu\n\n\"Introduction to the Italian Edition of Overdose,\" 38 Cumberland Law Review 223 (2007). cu\n\n\"How to Solve (or Avoid) the Exactions Problem,\" 72 Missouri Law Review 973 (2007). cu\n\n\"The Dangers of Investor Protection in Securities Markets,\" 12 Texas Review of Law & Politics 412 (2007). cu\n\n\"Bell Atlantic v. Twombly: How Motions to Dismiss Become (Disguised) Summary Judgments,\" 25 Washington University Journal of Law and Policy 61 (2007). cu\n\n\"On Wal-Mart: Doing Good by Doing Nothing,\" 39 Connecticut Law Review 1287 (2007). cu\n\n\"The Erosion of Individual Autonomy in Medical Decisionmaking: Of the FDA and IRBs,\" 96 Georgetown Law Journal 559 (2007). cu\n\n\"Why the FDA Must Preempt Tort Litigation: A Critique of Chevron Deference and a Response to Richard Nagareda,\" 1 Journal of Tort Law 5 (2006). cu\n\n\"The Public Use, Public Trust, and Public Benefit: Could Both Cooley and Kelo Be Wrong?,\" 9 Green Bag 125 (2006). cu www\n\n\"What Light If Any Does the Google Print Dispute Shed on Intellectual Property Law?,\" 7 Columbia Science and Technology Review 1 (2006). cu\n\n\"Ending the Mad Scramble: An Experimental Matching Plan for Federal Clerkships,\" 10 Green Bag 37 (2006). cu www\n\n\"Limiting Financial Disincentives in Live Organ Donation: A Rational Solution to the Kidney Shortage,\" 6 American Journal of Transplantation 2548 (2006) (with R. Gaston, Gabriel M. Danovitch & Jeffrey P. Kahn). cu\n\n\"Why Parties and Powers Both Matter: A Separationist Response to Levinson and Pildes,\" 119 Harvard Law Review Forum 210 (2006). cu\n\n\"Separation versus Accommodation: Why We Should Favor the Latter,\" 44 Criterion 3 (2006). cu\n\n\"Introduction to Symposium: Homo Economicus, Homo Myopicus, and the Law and Economics of Consumer Choice,\" 73 University of Chicago Law Review 1 (2006) (with Douglas G. Baird & Cass R. Sunstein). cu\n\n\"Intuition, Custom, and Protocol: How to Make Sound Decisions with Limited Knowledge,\" 2 New York University Journal of Law and Liberty 1 (2006). cu\n\n\"Our Ignorance about Intelligence,\" 17 Stanford Law and Policy Review 233 (2006). cu\n\n\"Behavioral Economics: Human Errors and Market Corrections,\" 73 University of Chicago Law Review 111 (2006). cu\n\n\"The Federalism Decisions of Justices Rehnquist and O'Connor: Is Half a Loaf Enough?,\" 58 Stanford Law Review 1793 (2006). cu\n\n\"Taking Stock of Takings: An Author's Retrospective,\" 15 William and Mary Bill of Rights Journal 407 (2006). cu\n\n\"The Theory and Practice of Self-Help,\" 1 Journal of Law, Economics and Policy 1 (2005). cu\n\n\"Kelo: An American Original,\" 8 Green Bag 355 (2005). cu www\n\n\"The Creator's Own Ideas,\" 108 Technology Review 56 (2005). cu\n\n\"One Step Beyond Nozick's Minimal State: The Role of Forced Exchanges in Political Theory,\" 22 Social Philosophy and Policy 286 (2005). cu\n\n\"It Did Happen Here: Fear and Loathing on the Vaccine Trail,\" 24 Health Affairs 740 (2005). cu\n\n\"The Constitutional Protection of Trade Secrets Under the Takings Clause,\" 37 Intellectual Property Law Review 661 (2005). cu\n\n\"Disparities and Discrimination in Health Care Coverage: A Critique of the Institute of Medicine Study,\" 48 Perspectives in Biology and Medicine S26 (2005). cu\n\n\"Regulatory Paternalism in the Market for Drugs: Lessons from Vioxx and Celebrex,\" 5 Yale Journal of Health Policy, Law, and Ethics 741 (2005). cu\n\n\"What (Not) to Do about Obesity: A Moderate Aristotelian Answer,\" 93 Georgetown Law Journal 1361 (2005). cu\n\n\"Contractual Principle versus Legislative Fixes: Coming to Closure on the Unending Travails of Medical Malpractice,\" 54 DePaul Law Review 503 (2005). cu\n\n\"Executive Power, the Commander in Chief, and the Militia Clause,\" 34 Hofstra Law Review 317 (2005). cu\n\n\"Justified Monopolies: Regulating Pharmaceuticals and Telecommunications,\" 56 Case Western Reserve Law Review 103 (2005). cu\n\n\"Takings, Commons, and Associations: Why the Telecommunications Act of 1996 Misfired,\" 22 Yale Journal on Regulation 315 (2005). cu\n\n\"Of Citizens and Persons: Reconstructing the Privileges or Immunities Clause of the Fourteenth Amendment,\" 1 New York University Journal of Law and Liberty 334 (2005). cu\n\n\"Monopoly Dominance or Level Playing Field - The New Antitrust Paradox,\" 72 University of Chicago Law Review 49 (2005). cu\n\n\"Taxation with Representation: Or, the Libertarian Dilemma,\" 18 Canadian Journal of Law and Jurisprudence 7 (2005). cu\n\n\"Liberty versus Property - Cracks in the Foundations of Copyright Law,\" 42 San Diego Law Review 1 (2005). cu\n\n\"Intel v. Hamidi: The Role of Self-Help in Cyberspace,\" 1 Journal of Law, Economics and Policy 147 (2005). cu\n\n\"Introductory Remarks: Some Reflections on Two-Sided Markets and Pricing,\" 2005 Columbia Business Law Review 509 (2005) (with Victor P. Goldberg). cu\n\n\"Untying the Grokster Knot: Learning to Live in a Second-Best World,\" 12 Brown Journal of World Affairs 177 (2005). cu\n\n\"The Uses and Limits of Local Knowledge: A Cautionary Note on Hayek,\" 1 New York University Journal of Law and Liberty 205 (2005). cu\n\n\"Further Thoughts on the Privileges or Immunities Clause of the Fourteenth Amendment,\" 1 New York University Journal of Law and Liberty 1096 (2005). cu\n\n\"The Not so Minimum Content of Natural Law,\" 25 Oxford Journal of Legal Studies 219 (2005). cu\n\n\"The Roman Law of Cyberconversion,\" 2005 Michigan State Law Review 103 (2005). cu\n\n\"The Regulation of Interchange Fees: Australian Fine-Tuning Gone Awry,\" 2005 Columbia Business Law Review 551 (2005). cu\n\n\"Introduction,\" 72 University of Chicago Law Review 1 (2005) (with Randal C. Picker). cu\n\n\"Introduction,\" 5 Yale Journal of Health Policy, Law, and Ethics 713 (2005) (with Mark Siegler & Alix Weisfeld). cu\n\n\"Of Same Sex Relationships and Affirmative Action: The Covert Libertarianism of the United States Supreme Court,\" 12 Supreme Court Economic Review 75 (2004). cu\n\n\"The Perils of Posnerian Pragmatism,\" 71 University of Chicago Law Review 639 (2004). cu\n\n\"A Farewell to Pragmatism,\" 71 University of Chicago Law Review 675 (2004). cu www\n\n\"Inside Information: Financial Conflicts of Interest for Research Subjects in Early Phase Clinical Trials,\" 96 Journal of National Cancer Institute 656 (2004) (with Paul R. Helft, Mark J. Ratain & Mark Siegler). cu\n\n\"A Defence of the Corporation,\" 2004 New Zealand Law Review 707 (2004). cu\n\n\"The Constitutional Protection of Trade Secrets under the Takings Clause,\" 71 University of Chicago Law Review 57 (2004). cu\n\n\"The Monopolistic Vices of Progressive Constitutionalism,\" 2004-2005 Cato Supreme Court Review 11 (2004). cu\n\n\"The Case against Black Reparations,\" 84 Boston University Law Review 1177 (2004). cu\n\n\"In Defense of the 'Old' Public Health: The Legal Framework for the Regulation of Public Health,\" 69 Brooklyn Law Review 1421 (2004). cu\n\n\"Reflections on the Historical Origins of Economic Structure of the Law Merchant,\" 5 Chicago Journal of International Law 1 (2004). cu\n\n\"Introduction to Colloquium: Intellectual Property,\" 71 University of Chicago Law Review 1 (2004) (with Randal C. Picker & Douglas G. Lichtman). cu\n\n\"Skepticism and Freedom: The Intellectual Foundations of Our Constitutional Order,\" 6 University of Pennsylvania Journal of Constitutional Law 657 (2004). cu\n\n\"Just Do It!: Title IX as a Threat to University Autonomy,\" 101 Michigan Law Review 1365 (2003). cu\n\n\"Book Review (reviewing Robert D. Cooter, The Strategic Constitution (2000)),\" 113 Ethics 695 (2003). cu\n\n\"Review of The Strategic Constitution by Robert Cooter,\" 113 Ethics 695 (2003). cu\n\n\"The 'Necessary' History of Property and Liberty,\" 6 Chapman Law Review 1 (2003). cu\n\n\"Class Actions: Aggregation, Amplification, and Distortion,\" 2003 University of Chicago Legal Forum 475 (2003). cu\n\n\"Cybertrespass,\" 70 University of Chicago Law Review 73 (2003). cu\n\n\"Beware of Legal Transitions: A Presumptive Vote for the Reliance Interest,\" 13 Journal of Contemporary Legal Issues 69 (2003). cu\n\n\"Indirect Restraints on the Provision of Health Care Quality,\" 46 Perspectives in Biology and Medicine 24 (2003). cu\n\n\"Standing in Law & Equity: A Defense of Citizen and Taxpayer Suits,\" 6 Green Bag 17 (2002). cu\n\n\"Book Review (reviewing Haavi Morreim, Holding Health Care Accountable: Law and the New Medical Malpractice (2001)),\" 7 Independent Review 294 (2002). cu\n\n\"Imperfect Liability Regimes: Individual and Corporate Issues,\" 53 South Carolina Law Review 1153 (2002). cu\n\nResponse, \"Smoothing the Boundary between Foreign and Domestic Law: Comments on Professors Dodge, Golove, and Stephan\", 52 DePaul Law Review 663 (2002). cu\n\n\"Does Literature Work as Social Science? The Case of George Orwell,\" 73 University of Colorado Law Review 987 (2002). cu\n\n\"Classical Liberalism Meets the New Constitutional Order: A Comment on Mark Tushnet,\" 3 Chicago Journal of International Law 455 (2002). cu\n\n\"Liberty, Equality, and Privacy: Choosing a Legal Foundation for Gay Rights,\" 2002 University of Chicago Legal Forum 73 (2002). cu\n\n\"Beyond Judicial Activism and Restraint,\" 1 Georgetown Journal of Law and Public Policy 85 (2002). cu\n\n\"HIPAA on Privacy: Its Unintended and Intended Consequences,\" 22 Cato Journal 13 (2002). cu\n\n\"Let 'the Fundamental Things Apply': Necessary and Contingent Truths in Legal Scholarship,\" 115 Harvard Law Review 1288 (2002). cu\n\n\"A Rational Basis for Affirmative Action: A Shaky but Classical Liberal Defense,\" 100 Michigan Law Review 2036 (2002). cu\n\n\"The Allocation of the Commons: Parking on Public Roads,\" 31 Journal of Legal Studies S515 (2002). cu\n\n\"The Dubious Constitutionality of the Copyright Term Extension Act,\" 36 Loyola of Los Angeles Law Review 123 (2002). cu\n\n\"Can Anyone Beat the Flat Tax?,\" 19 Social Philosophy and Policy 140 (2002). cu\n\n\"Intellectual Property: Old Boundaries and New Frontiers,\" 76 Indiana Law Journal 803 (2001). cu\n\n\"Employment and Labor Law Reform in New Zealand Lecture,\" 33 Case Western Reserve Journal of International Law 361 (2001). cu\n\n\"Life in No Trump: Property and Speech under the Constitution,\" 53 Maine Law Review 23 (2001). cu\n\n\"The Ebbs and Flows in Takings Law: Reflections on the Lake Tahoe Case,\" 2001-2002 Cato Supreme Court Review 5 (2001). cu\n\n\"'In Such Manner as the Legislature Thereof May Direct': The Outcome in Bush v Gore Defended,\" 68 University of Chicago Law Review 613 (2001). cu\n\n\"Consent, Not Power, as the Basis of Jurisdiction Frontiers of Jurisdiction,\" 2001 University of Chicago Legal Forum 1 (2001). cu\n\n\"The Assault on Managed Care: Vicarious Liability, ERISA Preemption, and Class Actions,\" 30 Journal of Legal Studies 625 (2001) (with Alan O. Sykes). cu\n\n\"Standing and Spending - The Role of Legal and Equitable Principles,\" 4 Chapman Law Review 1 (2001). cu\n\n\"Introduction: Managed Care in Perspective,\" 30 Journal of Legal Studies 527 (2001) (with Mark Siegler). cu\n\n\"The Necessity for Constrained Deliberation,\" 24 Harvard Journal of Law and Public Policy 159 (2000). cu\n\n\"The Economics of Tort Law: A Hurried and Partial Overview,\" 10 Kansas Journal of Law and Public Policy 60 (2000). cu\n\n\"The Constitutional Perils of Moderation: The Case of the Boy Scouts,\" 74 Southern California Law Review 119 (2000). cu\n\n\"Privacy, Publication, and the First Amendment: The Dangers of First Amendment Exceptionalism,\" 52 Stanford Law Review 1003 (2000). cu\n\n\"Vicarious Liability of Health Plans for Medical Injuries,\" 34 Valparaiso University Law Review 581 (2000). cu\n\n\"The Uneasy Marriage of Utilitarian and Libertarian Thought,\" 19 Quinnipiac Law Review 783 (2000). cu\n\n\"Waste and the Dormant Commerce Clause,\" 3 Green Bag 29 (2000). cu\n\n\"The Dangerous Claims of the Animal Rights Movement,\" 10 Responsive Community 28 (2000). cu\n\n\"Too Pragmatic by Half (reviewing Daniel A. Farber, Eco-Pragmatism: Making Sensible Environmental Decisions in an Uncertain World (1999)),\" 109 Yale Law Journal 1639 (2000). cu\n\n\"The Assault that Failed: The Progressive Critique of Laissez Faire (reviewing Barbara H. Fried, The Progressive Assault on Laissez Faire : Robert Hale and the First Law and Economics Movement (1998)),\" 97 Michigan Law Review 1697 (1999). cu\n\n\"Hayekian Socialism,\" 58 Maryland Law Review 271 (1999). cu\n\n\"Property Rights Claims of Indigenous Populations: The View from the Common Law,\" 31 University of Toledo Law Review 1 (1999). cu\n\n\"Exit Rights and Insurance Regulation: From Federalism to Takings,\" 7 George Mason Law Review 293 (1999). cu\n\n\"Confusion about Custom: Disentangling Informal Customs from Standard Contractual Provisions,\" 66 University of Chicago Law Review 821 (1999). cu\n\n\"Liberty, Patriarchy, and Feminism,\" 1999 University of Chicago Legal Forum 89 (1999). cu\n\n\"Managed Care Under Siege,\" 5 Journal of Medicine and Philosophy 434 (1999). cu\n\n\"The University in the 21st Century,\" 18 ACCESS: Critical Perspectives on Cultural and Policy Studies in Education 93 (1999). cu\n\n\"The New Chicago School: Myth or Reality?,\" 5 University of Chicago Law School Roundtable 1 (1998) (with Lisa Bernstein & Eric A. Posner & Randal C. Picker). cu\n\nResponse, \"Pennsylvania Coal v. Mahon: The Erratic Takings Jurisprudence of Justice Holmes\", 86 Georgetown Law Journal 875 (1998). cu\n\nResponse, \"Protecting Property with Legal Remedies: A Common Sense Reply to Professor Ayres\", 32 Valparaiso University Law Review 833 (1998). cu\n\n\"The Cartelization of Commerce,\" 22 Harvard Journal of Law and Public Policy 209 (1998). cu\n\n\"Living Dangerously: A Defense of Mortal Peril,\" 1998 University of Illinois Law Review 909 (1998). cu\n\n\"Lest We Forget: Buchanan v. Warley and Constitutional Jurisprudence of the 'Progressive Era',\" 51 Vanderbilt Law Review 787 (1998). cu\n\n\"Affirmative Action for the Next Millennium,\" 43 Loyola Law Review 503 (1998). cu\n\n\"Libertà e femminismo,\" 147 Biblioteca della libertà 51 (1998). cu\n\n\"The Right Set of Simple Rules: A Short Reply to Schauer and Comment on Cohen,\" 12 Critical Review 319 (1998). cu\n\n\"The Promise and Pitfalls of Simple Rules,\" 9 Constitutional Political Economy 151 (1998). cu\n\n\"Encryption, Key Escrow, and the Clash of Imperatives,\" 2 Electronic Banking Law and Commerce Report 7 (1998). cu\n\n\"Imitations of Libertarian Thought,\" 15 Social Philosophy and Policy 412 (1998). cu\n\n\"More Fidelity, Less Translation: A Loyalist's Response to Professor Treanor,\" 1 Green Bag 185 (1998). cu\n\n\"The Modern Uses of Ancient Law,\" 48 South Carolina Law Review 243 (1997). cu\n\n\"Takings, Exclusivity and Speech: The Legacy of PruneYard v. Robins Exchange,\" 64 University of Chicago Law Review 21 (1997). cu\n\n\"A Clear View of the Cathedral: The Dominance of Property Rules,\" 106 Yale Law Journal 2091 (1997). cu\n\n\"Employment Law: Courts and Contracts,\" 28 California Western International Law Journal 13 (1997). cu\n\n\"Law and Economics: Its Glorious Past and Cloudy Future,\" 64 University of Chicago Law Review 1167 (1997). cu\n\n\"Before Cyberspace: Legal Transitions in Property Rights Regimes,\" 73 Chicago-Kent Law Review 1137 (1997). cu\n\n\"Externalities Everywhere? Morals and the Police Power,\" 21 Harvard Journal of Law and Public Policy 61 (1997). cu\n\n\"Fidelity Without Translation,\" 1 Green Bag 21 (1997). cu\n\n\"The Problem of Forfeiture in the Welfare State,\" 14 Social Philosophy and Policy 256 (1997). cu\n\n\"Subrogation and Insurance, With Especial Reference to the Tobacco Litigation,\" 41 New York Law School Law Review 493 (1997). cu\n\n\"The Proper Goals of Antitrust: When Public and Private Interests Collide,\" 9 Loyola Consumer Law Review 122 (1997). cu\n\n\"Book Review (reviewing James Boyle, Shamans, Software, and Spleens: Law and the Construction of the Information Society (1996)),\" 16 Economic Affairs 46 (1996). cu\n\n\"Why Is This Man A Moderate? (reviewing William A. Fischel, Regulatory Takings: Law, Economics and Politics (1995)),\" 94 Michigan Law Review 1758 (1996). cu\n\n\"The Subtle Vices of the Employment Discrimination Laws,\" 29 John Marshall Law Review 575 (1996). cu\n\nResponse, \"Regulatory Sins versus Market Legacies: A Short Reply to Mr. Leech\", 29 John Marshall Law Review 617 (1996). cu\n\n\"Some Doubts on Constitutional Indeterminacy,\" 19 Harvard Journal of Law and Public Policy 363 (1996). cu\n\n\"The Remote Causes of Affirmative Action, or School Desegregation in Kansas City, Missouri,\" 84 California Law Review 1101 (1996). cu\n\n\"Property Rights in cDNA Sequences: A New Resident for the Public Domain,\" 3 University of Chicago Law School Roundtable 575 (1996). cu\n\n\"The Tort/Crime Distinction: A Generation Later,\" 76 Boston University Law Review 1 (1996). cu\n\n\"Constitutional Faith and the Commerce Clause,\" 71 Notre Dame Law Review 167 (1996). cu\n\n\"A Conceptual Approach to Zoning: What's Wrong with Euclid,\" 5 New York University Environmental Law Journal 277 (1996) (Statutory interpretation and Environmental Law). cu\n\n\"The Takings Jurisprudence of the Warren Court: A Constitutional Siesta,\" 31 Tulsa Law Journal 643 (1996). cu\n\n\"Babbitt v. Sweet Home Chapters of Oregon: The Law and Economics of Habitat Preservation,\" 5 Supreme Court Economic Review 1 (1996). cu\n\n\"Whose Democratic Vision of the Takings Clause? A Comment on Frank Michelman's Testimony on Senate Bill 605,\" 49 Washington University Journal of Urban and Contemporary Law 17 (1996). cu\n\n\"The Future of Property Rights in America,\" 11 Journal of Private Enterprise 1 (1996). cu\n\n\"Catastrophic Responses to Catastrophic Risks,\" 12 Journal of Risk and Uncertainty 287 (1996). cu\n\n\"Norms: Social and Legal,\" Good Society 1 (1996). cu\n\n\"Contract and Trust in Corporate Law: The Case of Corporate Opportunity,\" 21 Delaware Journal of Corporate Law 1 (1996). cu\n\n\"Book Review (reviewing James W. Ely, The Chief Justiceship of Melville W. Fuller, 1888-1910 (1995)),\" 40 American Journal of Legal History 109 (1996). cu\n\n\"Introduction,\" 15 Northern Illinois University Law Review 477 (1995). cu\n\n\"Two Challenges for Feminist Thought,\" 18 Harvard Journal of Law and Public Policy 331 (1995). cu\n\n\"The Permit Power Meets the Constitution,\" 81 Iowa Law Review 407 (1995). cu\n\n\"The Status-Production Sideshow: Why the Antidiscrimination Laws Are Still a Mistake,\" 108 Harvard Law Review 1085 (1995). cu\n\n\"Unconstitutional Conditions Puzzle,\" 4 Cornell Journal of Law and Public Policy 466 (1995). cu\n\n\"The Harms and Benefits of Nollan and Dolan,\" 15 Northern Illinois University Law Review 479 (1995). cu\n\n\"Surrogacy: The Case for Full Contractual Enforcement,\" 81 Virginia Law Review 2305 (1995). cu\n\n\"Dolan v. City of Tigard: Brief of the Institute for Justice as Amicus Curiae in Support of Petitioner,\" 15 Northern Illinois University Law Review 493 (1995) (with William H. Mellor). cu\n\n\"History Lean: The Reconciliation of Private Property and Representative Government,\" 95 Columbia Law Review 591 (1995). cu\n\n\"Are Values Incommensurable, or Is Utility the Ruler of the World?,\" 1995 Utah Law Review 683 (1995). cu\n\n\"The Harm Principle - and How It Grew,\" 45 University of Toronto Law Journal 369 (1995). cu\n\n\"The Place of Caste under the Civil Rights Laws: From Jim Crow to Same Sex Marriages,\" 92 Michigan Law Review 2456 (1994). cu\n\n\"Standing Firm, on Forbidden Grounds,\" 31 San Diego Law Review 1 (1994). cu\n\n\"The Moral and Practical Dilemmas of an Underground Economy,\" 103 Yale Law Journal 2157 (1994). cu\n\n\"Caste and the Civil Rights Laws: From Jim Crow to Same-Sex Marriages,\" 92 Michigan Law Review 2456 (1994). cu\n\n\"The Ubiquity of the Benefit Principle,\" 67 Southern California Law Review 1369 (1994). cu\n\n\"The Legal Regulation of Genetic Discrimination: Old Responses to New Technology,\" 74 Boston University Law Review 1 (1994). cu\n\n\"Faculty-Edited Law Journals,\" 70 Chicago-Kent Law Review 87 (1994). cu\n\n\"For a Bramwell Revival,\" 38 American Journal of Legal History 246 (1994). cu\n\n\"Introduction: Baron Bramwell at the End of the Twentieth Century,\" 38 American Journal of Legal History 241 (1994). cu\n\n\"On the Optimal Mix of Private and Common Property,\" 11 Social Philosophy and Policy 17 (1994). cu\n\n\"A False Sense of Social Reality: A Response to Erwin Chemerinsky,\" 3 Southern California Interdisciplinary Law Journal 445 (1993). cu\n\n\"Holdouts, Externalities, and the Single Owner: One More Salute to Ronald Coase,\" 36 Journal of Law and Economics 553 (1993). cu\n\n\"The Seven Deadly Sins of Takings Law: The Dissents in Lucas v. South Carolina Coastal Council,\" 26 Loyola of Los Angeles Law Review 955 (1993). cu\n\n\"The Federalist Papers: From Practical Politics to High Principle,\" 16 Harvard Journal of Law and Public Policy 13 (1993). cu\n\n\"Judicial Control over Expert Testimony: Of Deference and Education,\" 87 Northwestern University Law Review 1156 (1993). cu\n\n\"Some Reflections on the Gender Gap in Employment,\" 82 Georgetown Law Journal 75 (1993). cu\n\n\"Lucas v. South Carolina Coastal Council: A Tangled Web of Expectations,\" 45 Stanford Law Review 1369 (1993). cu\n\n\"Legal Education and the Politics of Exclusion,\" 45 Stanford Law Review 1607 (1993). cu\n\n\"Drafting a Constitution: A Friendly Warning to South Africa,\" 8 American University Journal of International Law and Policy 567 (1993). cu\n\n\"Should Title VII of the Civil Rights Act of 1964 be Repealed?,\" 2 Southern California Interdisciplinary Law Journal 349 (1993) (with Erwin Chemerinsky). cu\n\n\"Altruism: Universal and Selective,\" 67 Social Service Review 388 (1993). cu\n\n\"Organ Transplants: Is Relying on Altruism Costing Lives?,\" American Enterprise 50 (1993). cu\n\n\"Ruminations on Lucas v. South Carolina Coastal Council: An Introduction to an Amicus Curiae Brief,\" 25 Loyola of Los Angeles Law Review 1225 (1992). cu\n\n\"Rights and 'Rights Talk' (reviewing Mary Ann Glendon, Rights Talk: The Impoverishment of Political Discourse (1991)),\" 105 Harvard Law Review 1106 (1992). cu\n\n\"Why is Health Care Special?,\" 40 University of Kansas Law Review 307 (1992). cu\n\n\"Yee v. City of Escondido: The Supreme Court Strikes out Again,\" 26 Loyola of Los Angeles Law Review 3 (1992). cu\n\n\"A New Regime for Expert Witnesses,\" 26 Valparaiso University Law Review 757 (1992). cu\n\n\"Exit Rights under Federalism,\" 55 Law and Contemporary Problems 147 (1992). cu\n\n\"The Indivisibility of Liberty under the Bill of Rights,\" 15 Harvard Journal of Law and Public Policy 35 (1992). cu\n\n\"Affirmative Action in Law Schools: The Uneasy Truce,\" 2 Kansas Journal of Law and Public Policy 33 (1992). cu\n\n\"Gender is for Nouns,\" 41 DePaul Law Review 981 (1992). cu\n\n\"The Authoritarian Impulse in Sex Discrimination Law: A Reply to Professors Abrams and Strauss,\" 41 DePaul Law Review 1041 (1992). cu\n\n\"Property and the Politics of Distrust,\" 59 University of Chicago Law Review 41 (1992). cu\n\n\"The Path to the T. J. Hooper: The Theory and History of Custom in the Law of Tort,\" 21 Journal of Legal Studies 1 (1992). cu\n\n\"A Common Lawyer Looks at Constitutional Interpretation,\" 72 Boston University Law Review 699 (1992). cu\n\n\"International News Service v. Associated Press: Custom and Law as Sources of Property Rights in News,\" 78 Virginia Law Review 85 (1992). cu\n\n\"Property as a Fundamental Civil Right,\" 29 California Western Law Review 187 (1992). cu\n\n\"Tuskegee Modern, or Group Rights under the Constitution,\" 80 Kentucky Law Journal 869 (1991). cu\n\n\"All Quiet on the Eastern Front,\" 58 University of Chicago Law Review 555 (1991). cu\n\n\"A Clash of Two Cultures: Will the Tort System Survive Automobile Insurance Reform?,\" 25 Valparaiso University Law Review 173 (1991). cu\n\n\"Regulation--and Contract--in Environmental Law,\" 93 West Virginia Law Review 859 (1991). cu\n\nResponse, \"The Single Owner Revisited: A Brief Reply to Professor Lewin\", 93 West Virginia Law Review 901 (1991). cu\n\n\"Rationing Access to Medical Care: Some Sober Second Thoughts,\" 3 Stanford Law and Policy Review 81 (1991). cu\n\n\"The Legal Regulation of Lawyers' Conflicts of Interest,\" 60 Fordham Law Review 579 (1991). cu\n\n\"Two Conceptions of Civil Rights,\" 8 Social Philosophy and Policy 38 (1991). cu\n\n\"The Paradox of Civil Rights,\" 8 Yale Law and Policy Review 299 (1990). cu\n\n\"The Consolidation of Complex Litigation: A Critical Evaluation of the ALI Proposal,\" 10 Journal of Law and Commerce 1 (1990). cu\n\n\"Unconstitutional Conditions Obscured: A Brief Response to Professor Abrams,\" 27 San Diego Law Review 395 (1990). cu\n\n\"Property and Necessity,\" 13 Harvard Journal of Law and Public Policy 2 (1990). cu\n\n\"An Augmentation of the Guard,\" 19 Journal of Legal Studies 1 (1990). cu\n\n\"No New Property,\" 56 Brooklyn Law Review 747 (1990). cu\n\n\"In Praise of Divided Government,\" 68 Washington University Law Quarterly 567 (1990). cu\n\n\"The Independence of Judges: The Uses and Limitations of Public Choice Theory,\" 1990 Brigham Young University Law Review 827 (1990). cu\n\n\"Compassion and Compulsion,\" 22 Arizona State Law Journal 25 (1990). cu\n\n\"Religious Liberty in the Welfare State,\" 31 William and Mary Law Review 375 (1990). cu\n\n\"Introduction: The Law and Economics of Risk,\" 19 Journal of Legal Studies 531 (1990) (with Geoffrey P. Miller). cu\n\n\"The Evolution of Product Liability Law,\" 1990 Policy 5 (1990). cu\n\n\"The Varieties of Self-Interest,\" 8 Social Philosophy and Policy 102 (1990). cu\n\n\"Constitutional Conundrums in the Public Funding of the Arts,\" 15 Columbia-VLA Journal of Law and the Arts 30 (1990). cu\n\n\"Property Rights and the New Legal Order (panel discussion),\" 21 Cumberland Law Review 451 (1990). cu\n\nResponse, \"Rent Control Revisited: One Reply to Seven Critics\", 54 Brooklyn Law Review 1281 (1989). cu\n\n\"Justice across the Generations,\" 67 Texas Law Review 1465 (1989). cu\n\n\"Products Liability: From Contract to Regulation in the United States and Europe,\" 9 Tel Aviv University Studies in Law 49 (1989). cu\n\n\"The Utilitarian Foundations of Natural Law,\" 12 Harvard Journal of Law and Public Policy 711 (1989). cu\n\n\"Postscript: Subjective Utilitarianism,\" 12 Harvard Journal of Law and Public Policy 769 (1989). cu\n\n\"Unconstitutional Conditions and Bargaining Breakdown,\" 26 San Diego Law Review 189 (1989). cu\n\n\"Beyond Foreseeability: Consequential Damages in the Law of Contract,\" 18 Journal of Legal Studies 105 (1989). cu\n\n\"Race and the Police Power: 1890 to 1937,\" 46 Washington and Lee Law Review 741 (1989). cu\n\n\"Modern Republicanism--Or the Flight from Substance,\" 97 Yale Law Journal 1633 (1988). cu\n\n\"Foreword: Unconstitutional Conditions, State Power, and the Limits of Consent,\" 102 Harvard Law Review 4 (1988). cu\n\n\"The Unintended Revolution in Product Liability Law,\" 10 Cardozo Law Review 2193 (1988). cu\n\n\"The Mistakes of 1937,\" 11 George Mason Law Review 5 (1988). cu\n\n\"AIDS, Testing and the Workplace,\" 1988 University of Chicago Legal Forum 33 (1988). cu\n\n\"Charles O. Gregory--An Appreciation from the Wings,\" 74 Virginia Law Review 11 (1988). cu\n\n\"Market and Regulatory Approaches to Medical Malpractice: The Virginia Obstetrical No-Fault Statute,\" 74 Virginia Law Review 1451 (1988). cu\n\n\"Rent Control and the Theory of Efficient Regulation,\" 54 Brooklyn Law Review 741 (1988). cu\n\n\"Classical Legal Tradition,\" 73 Cornell Law Review 292 (1988). cu\n\n\"Covenants and Constitutions,\" 73 Cornell Law Review 906 (1988). cu\n\n\"Luck,\" 6 Social Philosophy and Policy 17 (1988). cu\n\n\"The Political Economy of Product Liability Reform,\" 78 American Economic Review 311 (1988). cu\n\n\"Legal Liability for Medical Innovation,\" 8 Cardozo Law Review 1139 (1987). cu\n\n\"The Fundamentals of Freedom of Speech,\" 10 Harvard Journal of Law and Public Policy 53 (1987). cu\n\n\"Beyond the Rule of Law: Civic Virtue and Constitutional Structure,\" 56 George Washington Law Review 149 (1987). cu\n\n\"Self-Interest and the Constitution,\" 37 Journal of Legal Education 153 (1987). cu\n\n\"Public Trust Doctrine, The Government, the Economy, and the Constitution,\" 7 Cato Journal 411 (1987). cu\n\n\"Inducement of Breach of Contract as a Problem of Ostensible Ownership,\" 16 Journal of Legal Studies 1 (1987). cu\n\n\"Takings: Descent and Resurrection,\" 1987 Supreme Court Review 1 (1987). cu\n\n\"The Proper Scope of the Commerce Power,\" 73 Virginia Law Review 1387 (1987). cu\n\n\"Wilder v. Bernstein: Squeeze Play by Consent Decree,\" 1987 University of Chicago Legal Forum 209 (1987). cu\n\n\"The Risks of Risk/Utility,\" 48 Ohio State Law Journal 469 (1987). cu\n\n\"Causation - In Context: An Afterword,\" 63 Chicago-Kent Law Review 653 (1987). cu\n\n\"Book Review (reviewing Patricia M. Danzon, Medical Malpractice: Theory, Evidence and Public Policy (1985)),\" 61 Quarterly Review of Biology 304 (1986). cu\n\n\"Medical Malpractice, Imperfect Information, and the Contractual Foundation for Medical Services,\" 49 Law and Contemporary Problems 201 (1986). cu\n\n\"An Outline of Takings,\" 41 University of Miami Law Review 3 (1986). cu\n\n\"A Last Word on Eminent Domain,\" 41 University of Miami Law Review 253 (1986). cu\n\n\"Was New York Times v. Sullivan Wrong?,\" 53 University of Chicago Law Review 782 (1986). cu\n\n\"The Temporal Dimension in Tort Law,\" 53 University of Chicago Law Review 1175 (1986). cu\n\n\"Past and Future: The Temporal Dimension in the Law of Property,\" 64 Washington University Law Quarterly 667 (1986). cu\n\n\"Taxation in a Lockean World,\" 4 Social Philosophy and Policy 49 (1986). cu\n\n\"On Drafting Rules and Procedures for Academic Fraud,\" 24 Minerva 344 (1986). cu\n\n\"Products Liability as an Insurance Market,\" 14 Journal of Legal Studies 645 (1985). cu\n\n\"Positive and Normative Elements in Legal Education,\" 8 Harvard Journal of Law and Public Policy 255 (1985). cu\n\n\"Two Fallacies in the Law of Joint Torts,\" 73 Georgetown Law Journal 1377 (1985). cu\n\n\"Judicial Review: Reckoning on Two Kinds of Error,\" 4 Cato Journal 711 (1985). cu\n\n\"The Uncertain Quest for Welfare Rights,\" 1985 Brigham Young University Law Review 201 (1985). cu\n\n\"Why Restrain Alienation?,\" 85 Columbia Law Review 970 (1985). cu\n\n\"The Historical Origins and Economic Structures of Workers' Compensation Law,\" 7 Workmen's Compensation Law Review 1 (1985). cu\n\n\"Views on Legal Education: An Exchange,\" 8 Harvard Journal of Law and Public Policy 269 (1985) (with Duncan Kennedy). cu\n\n\"Introduction: Critical Issues in Tort Law Reform: A Search for Principles,\" 14 Journal of Legal Studies 459 (1985) (with George L. Priest). cu\n\n\"The Legal and Insurance Dynamics of Mass Tort Litigation,\" 13 Journal of Legal Studies 475 (1984). cu\n\n\"The Pitfalls of Interpretation,\" 7 Harvard Journal of Law and Public Policy 101 (1984). cu\n\n\"Toward a Revitalization of the Contract Clause,\" 51 University of Chicago Law Review 703 (1984). cu\n\n\"In Defense of the Contract at Will,\" 51 University of Chicago Law Review 947 (1984). cu\n\n\"Introduction,\" 51 University of Chicago Law Review 945 (1984) (with Jeffrey Paul). cu\n\n\"Introduction: Catastrophic Personal Injuries,\" 13 Journal of Legal Studies 415 (1984) (with Patricia Danzon). cu\n\n\"Blackmail, Inc.,\" 50 University of Chicago Law Review 553 (1983). cu\n\n\"Common Law, Labor Law, and Reality: A Rejoinder to Professors Getman and Kohler,\" 92 Yale Law Journal 1435 (1983). cu\n\n\"Professor, Now Judge - A Tribute to Richard A. Posner,\" 12 Journal of Legal Studies 1 (1983). cu\n\n\"A Common Law for Labor Relations: A Critique of the New Deal Labor Legislation,\" 92 Yale Law Journal 1357 (1983). cu\n\n\"Taxation, Regulation, and Confiscation,\" 20 Osgoode Hall Law Journal 433 (1982). cu\n\n\"The Social Consequences of Common Law Rules,\" 95 Harvard Law Review 1717 (1982). cu\n\n\"The Principles of Environmental Protection: The Case of Superfund,\" 2 Cato Journal 9 (1982). cu\n\n\"Not Deference, but Doctrine: The Eminent Domain Clause,\" 1982 Supreme Court Review 351 (1982). cu\n\n\"Private Property and the Public Domain: The Case of Antitrust,\" 24 Nomos 48 (1982). cu\n\n\"Notice and Freedom of Contract in the Law of Servitudes Comments,\" 55 Southern California Law Review 1353 (1981). cu\n\n\"The Historical Origins and Economic Structure of Workers' Compensation Law,\" 16 Georgia Law Review 775 (1981). cu\n\n\"The Static Conception of the Common Law,\" 9 Journal of Legal Studies 253 (1980). cu\n\n\"A Taste for Privacy? Evolution and the Emergence of a Naturalistic Ethic,\" 9 Journal of Legal Studies 665 (1980). cu\n\n\"Automobile No-Fault Plans: A Second Look at First Principles,\" 13 Creighton Law Review 769 (1980). cu\n\n\"Possession as the Root of Title,\" 13 Georgia Law Review 1221 (1979). cu\n\n\"Plaintiff's Conduct in Products Liability Actions: Comparative Negligence, Automatic Division and Multiple Parties,\" 45 Journal of Air Law and Commerce 87 (1979). cu\n\n\"Grade Normalization,\" 44 Southern California Law Review 707 (1970). cu\n\n\"Nuisance Law: Corrective Justice and Its Utilitarian Constraints,\" 8 Journal of Legal Studies 49 (1979). cu\n\n\"The Consumption and Loss of Personal Property under the Internal Revenue Code,\" 23 Stanford Law Review 454 (1970). cu\n\n\"Causation and Corrective Justice: A Reply to Two Critics,\" 8 Journal of Legal Studies 477 (1979). cu\n\n\"Private Property and the Constitution,\" 30 Stanford Law Review 635 (1978). cu\n\n\"The Limits of Medical Malpractice,\" 298 New England Journal of Medicine 1311 (1978). cu\n\n\"Privacy, Property Rights, and Misrepresentations,\" 12 Georgia Law Review 455 (1978). cu\n\n\"Private-Law Models for Official Immunity,\" 42 Law and Contemporary Problems 53 (1978). cu\n\n\"Products Liability: The Search for the Middle Ground,\" 56 North Carolina Law Review 643 (1978). cu\n\n\"Coordination of Workers' Compensation Benefits with Tort Damage Awards,\" 13 Forum 464 (1978). cu\n\n\"Contracting Out of the Medical Malpractice Crisis,\" 20 Perspectives in Biology and Medicine 228 (1977). cu\n\n\"Medical Malpractice: The Case for Contract,\" 1976 American Bar Foundation Research Journal 87 (1976). cu\n\n\"Intentional Harms,\" 4 Journal of Legal Studies 391 (1975). cu\n\n\"Unconscionability: A Critical Reappraisal,\" 18 Journal of Law and Economics 293 (1975). cu\n\n\"Defenses and Subsequent Pleas in a System of Strict Liability,\" 3 Journal of Legal Studies 165 (1974). cu\n\n\"Pleadings and Presumptions,\" 40 University of Chicago Law Review 556 (1973). cu\n\n\"A Theory of Strict Liability,\" 2 Journal of Legal Studies 151 (1973). cu\n\n\"Substantive Due Process by Any Other Name: The Abortion Cases,\" 1973 Supreme Court Review 159 (1973). cu"}, {"url": "https://www.hoover.org/profiles/richard-epstein", "page_content": "About\n\nRichard A. Epstein, the Peter and Kirsten Bedford Senior Fellow (adjunct) at the Hoover Institution, is the Laurence A. Tisch Professor of Law, New York University Law School, and a senior lecturer at the University of Chicago.\n\nIn 2011, Epstein was a recipient of the Bradley Prize for outstanding achievement. In 2005, the College of William & Mary School of Law awarded him the Brigham-Kanner Property Rights Prize.\n\nEpstein researches and writes in a broad range of constitutional, economic, historical, and philosophical subjects. He has taught administrative law, antitrust law, communications law, constitutional law, corporation criminal law, employment discrimination law, environmental law, food and drug law, health law, labor law, Roman law, real estate development and finance, and individual and corporate taxation.\n\nHe edited the Journal of Legal Studies (1981–91) and the Journal of Law and Economics (1991–2001).\n\nEpstein’s most recent publication is The Classical Liberal Constitution: The Uncertain Quest for Limited Government (2014). Other books include Design for Liberty: Private Property, Public Administration, and the Rule of Law (2011); The Case against the Employee Free Choice Act (Hoover Institution Press, 2009); Supreme Neglect: How to Revive the Constitutional Protection for Private Property (2008); How the Progressives Rewrote the Constitution (2006); Overdose (2006); and Free Markets under Siege: Cartels, Politics, and Social Welfare (Hoover Institution Press, 2005).\n\nHe received a BA degree in philosophy summa cum laude from Columbia in 1964; a BA degree in law with first-class honors from Oxford University in 1966; and an LLB degree cum laude, from the Yale Law School in 1968. Upon graduation he joined the faculty at the University of Southern California, where he taught until 1972. In 1972, he visited the University of Chicago and became a regular member of the faculty the following year.\n\nHe has been a senior fellow at the MacLean Center for Clinical Medical Ethics since 1984 and was elected a fellow of the American Academy of Arts and Sciences in 1985. He has been a Hoover fellow since 2000."}, {"url": "https://www.law.nyu.edu/news/ECM_PRO_059743", "page_content": "Professor Richard Epstein, the James Parker Hall Distinguished Service Professor of Law at the University of Chicago, will join NYU School of Law as a permanent member of the faculty in Fall 2010.\n\nEpstein, who is currently visiting the Law School for the fourth time, is considered to be one of the most influential thinkers in legal academia. He is well known for his research and writings on a broad range of constitutional, economic, historical, and philosophical subjects.\n\n\"I am honored to be able to join the NYU faculty whose collegiality and seriousness of purpose has been evident to me since I first started visiting at NYU four years ago,\" Epstein said.\n\nAmong his many books are Overdose: How Excessive Government Regulation Stifles Pharmaceutical Innovation (2006); How Progressives Rewrote the Constitution (2006); and Supreme Neglect: How to Revive Constitutional Protection for Private Property (2008). He has taught courses across the whole curriculum, including antitrust, communications, constitutional law, contracts, criminal law, health, labor, jurisprudence, patents, property, Roman law, and torts.\n\nEpstein has also been the Peter and Kirstin Bedford Senior Fellow at the Hoover Institution since 2000. Prior to joining the University of Chicago Law School faculty, he taught law at the University of Southern California. He served as Interim Dean at the University of Chicago from February to June 2001, and will be a Senior Lecturer after his move to NYU.\n\nEpstein received an LL.D., h.c., from the University of Ghent, 2003. He has been a member of the American Academy of Arts and Sciences since 1985 and a Senior Fellow of the Center for Clinical Medical Ethics at the University of Chicago Medical School, also since 1983. He served as editor of the Journal of Legal Studies from 1981 to 1991, and of the Journal of Law and Economics from 1991 to 2001. At present he is a director of the John M. Olin Program in Law and Economics. He earned both a B.A. in Law from Oxford and an LL.B. from Yale.\n\n\"Richard has been a wonderful addition to our intellectual community in recent years, and we are so pleased that he will now join us on a permanent basis,\" NYU School of Law Dean Richard Revesz said.\n\nVisit Richard Epstein's faculty profile page\n\nRead Richard Epstein's blog at Forbes.com"}, {"url": "https://www.independent.org/aboutus/person_detail.asp?id=836", "page_content": "Richard A. Epstein is the Laurence A. Tisch Professor of Law at New York University, Peter and Kirsten Bedford Senior Fellow at the Hoover Institution, James Parker Hall Distinguished Service Professor Emeritus of Law at the University of Chicago, and Research Fellow at the Independent Institute. He received an LLB cum laude from Yale Law School and LLD, hc, from the University of Ghent. He is a Member of the American Academy of Arts and Sciences and an Honorary Member of the Law and Economics Association of New Zealand, as well as a Senior Fellow of the Center for Clinical Medical Ethics at the University of Chicago Medical School. He served as editor of the Journal of Legal Studies from 1981 to 1991, and the Journal of Law and Economics from 1991 to 2001.\n\nHis numerous books include Antitrust Decrees in Theory and Practice: Why Less Is More; Bargaining with the State; The Case Against the Employee Free Choice Act; Cases and Materials on Torts; The Classical Liberal Constitution: The Uncertain Quest for Limited Government; Design for Liberty: Private Property, Public Administration, and the Rule of Law; Free Markets Under Siege: Cartels, Politics and Social Welfare; How Progressives Rewrote the Constitution; Intellectual Property for the Technological Age; Modern Products Liability Law; Mortal Peril: Our Inalienable Rights to Health Care; Overdose: How Excessive Government Regulation Stifles Pharmaceutical Innovation; Principles for a Free Society; Simple Rules for a Complex World; Skepticism and Freedom: A Modern Case for Classical Liberalism; Supreme Neglect: How to Revive the Constitutional Protection for Private Property; Takings: Private Property and the Power of Eminent Domain; and Torts. He is editor of the books, Economics of Constitution Law; Liberty, Property and the Law; and Economics of Property Law; and he is coeditor of The Vote: Bush, Gore, and the Supreme Court; and Labor Law and the Employment Market. He is also the author of over 250 articles in numerous scholarly journals and popular publications.\n\nDr. Epstein is a recipient of the Bradley Prize, and he has taught courses in administrative law, antitrust law civil procedure, communications, constitutional law, contracts, corporations, criminal law, criminal procedure, employment discrimination law, environmental law, health law and policy, legal history, labor law, property, real estate development and finance, jurisprudence, labor law, land use planning, patents, individual, estate and corporate taxation, Roman law, torts, water law, and workers' compensation."}, {"url": "https://blogs.law.nyu.edu/magazine/2009/profile-richard-epstein/", "page_content": "Introducing Richard Epstein\n\nVisiting Professor of Law\n\nA classical libertarian arguing against universal health care, Richard Epstein was clearly at a disadvantage when he took the podium in April 2008 to debate Americans’ right to health care. He was in Massachusetts, the only state that requires health coverage, and participating in a forum sponsored by PBS. He faced JudyAnn Bigby, an advocate of the state’s near universal coverage plan and the secretary of health. “It was the worst possible setting for him,” says one of his opponents, Regina Herzlinger of Harvard Business School.\n\nRarely coy, Epstein began by declaring that Wal-Mart could provide health coverage better than Massachusetts could. Then in a move Herzlinger called “Kissingeresque,” Epstein distanced himself from his teammate, who was presenting a distasteful argument, and reached across the aisle to her. “It took him about five minutes to realign three of the four debaters,” she says. Afterward, Epstein was “surrounded by people who may not have liked what he had to say but were dazzled by his brilliance.”\n\nEpstein’s debating skills are legendary, as is almost everything about the man. It’s been said that taking notes in his class is like trying to fill a Dixie cup with water from Niagara Falls. “Richard speaks without breathing, and in perfect paragraphs,” says Samuel Issacharoff, Bonnie and Richard Reiss Professor of Constitutional Law. During the timed closing remarks in Boston, Epstein got in 35 percent more words than did his opponent (218 words per minute versus 161).\n\nIt seems he knows something about everything, and his reach extends beyond the academy to newspaper op-eds, podcasts, and even YouTube videos. He’s written and edited 22 books on diverse subjects. At the University of Chicago, he has taught 27 different courses—including Roman law—since 1972. Epstein, who has been an annual visiting professor at the NYU School of Law since 2005, plans to follow suit when he permanently joins the faculty in 2010. “Whatever they ask is what I teach,” Epstein says. “That’s always been my rule.”\n\nHe trains students to speak off-the-cuff—a practice that can fell even the ablest. He calls on a student closest to the aisle, then moves rapidly down the row, getting through half the class in an hour. “He’s intimidating at first, but he’s not trying to embarrass you,” says Michael Schachter ’10, who nearly blacked out once when Epstein worked his way toward him in Contracts.\n\nEpstein can debate any topic with ease because his arguments have a common denominator: classical liberalism. “I’m working off a strong, central theorem,” he says. In a nutshell: He believes in individual freedom, but not unconstrained by the rights of others, and in limited government with an eye toward the common good.\n\nIn his best-known work, Takings: Private Property and the Power of Eminent Domain (1985), which has been cited in four U.S. Supreme Court cases, he doesn’t come down against eminent domain per se, but argues that the government should be required to provide the same protections as any private entity in a property dispute. “He, more than any other scholar, has had an impact on reopening issues about property rights that have been neglected for decades in the constitutional literature,” says Vanderbilt law professor James Ely. Epstein is currently working on a book that analyzes the Constitution through libertarian eyes. The Tulsa Law Review, which traditionally honors constitutional scholars, dedicated its 2008 symposium to Epstein’s complete works.\n\nPredictably, Epstein opposes most of the positions of his one-time colleague President Barack Obama. He does support the president’s call to safeguard habeas corpus rights and close Guantánamo Bay, while reserving his highest compliment for Obama’s skill in another arena altogether: the basketball court. “He’s a great player, but not the equal of Arne Duncan, his education secretary,” says Epstein, who played with those two plus First Brother-in-Law Craig Robinson at a party for Marty Nesbitt, Obama’s campaign treasurer.\n\nEpstein was raised with his two sisters in what he calls “a perfectly conventional Brooklyn home.” His father, Bernard, was a radiologist, and his mother, Catherine, “a basic New Deal liberal,” ran Bernard’s office. Epstein did well in school, but was not a model student. He bounced out of his seat to blurt out answers, often lost his homework, and wasn’t a particularly good test-taker. “I had a bunch of teachers who prophesied an ugly end to my academic career,” he recalls. That didn’t stop him from getting into Columbia College. As a student during the height of the turbulent 1960s, Epstein stood apart from the protests. “I’ve always been a contrarian intellectual, and when I see lots of people out there chanting and screaming, my first reaction is that they’ve got to be wrong,” he says.\n\nHe graduated in 1964, earning a Kellett Fellowship to study at Oxford. The English curriculum was oriented toward private law, so he found himself immersed in work by judges with classical libertarian leanings. He received his B.A. in jurisprudence in 1966, then entered Yale Law School, earning his LL.B. in 1968.\n\nDuring the next four years he taught law at the University of Southern California and met his wife, Eileen, a professional fundraiser. They have three children. At the University of Chicago, Epstein headed the John M. Olin Program in Law and Economics, and in 2001 served as interim dean when his predecessor left unexpectedly. “He filled the gap selflessly. People thought of him as a steady rock,” says Chicago colleague Douglas Baird.\n\nIn 2005, Epstein began splitting his year between Chicago and New York. “This is a faculty that is convivial and highly professional,” he says. “I like the culture.” His appointment allows him to keep his connection with the Hoover Institution at Stanford University, where he has been a fellow since 2000, and spoil his granddaughter, Bella. In his leisure time he plays basketball and does crossword puzzles. With typical humility, he notes, “I have progressed from rank amateur to respectable mediocrity, and sometimes surprise myself by finishing a Saturday New York Times puzzle.”\n\n–\n\nAll of 2009 Faculty Focus\n\n2009 Home"}, {"url": "https://www.nyu.edu/about/news-publications/news/2008/november/richard_epstein_one_of_the.html", "page_content": "Professor Richard Epstein, the James Parker Hall Distinguished Service Professor of Law at the University of Chicago, will join NYU School of Law as a permanent member of the faculty in the fall of 2010.\n\nEpstein, who is currently visiting the Law School for the fourth time, is considered to be one of the most influential thinkers in legal academia. He is well known for his research and writings on a broad range of constitutional, economic, historical, and philosophical subjects.\n\n“I am honored to be able to join the NYU faculty whose collegiality and seriousness of purpose has been evident to me since I first started visiting at NYU four years ago,” Epstein said.\n\n“Richard has been a wonderful addition to our intellectual community in recent years, and we are so pleased that he will now join us on a permanent basis,” NYU School of Law Dean Richard Revesz said.\n\nAmong Epstein’s many books are Overdose: How Excessive Government Regulation Stifles Pharmaceutical Innovation (2006); How Progressives Rewrote the Constitution (2006); and Supreme Neglect: How to Revive Constitutional Protection for Private Property (2008). He has taught courses across the whole curriculum, including antitrust, communications, constitutional law, contracts, criminal law, health, labor, jurisprudence, patents, property, Roman law, and torts.\n\nEpstein has also been the Peter and Kirstin Bedford Senior Fellow at the Hoover Institution since 2000. Prior to joining the University of Chicago Law School faculty, he taught law at the University of Southern California. He served as Interim Dean at the University of Chicago from February to June 2001, and will be a Senior Lecturer after his move to NYU.\n\nEpstein received an LL.D., h.c., from the University of Ghent, 2003. He has been a member of the American Academy of Arts and Sciences since 1985 and a Senior Fellow of the Center for Clinical Medical Ethics at the University of Chicago Medical School, also since 1983. He served as editor of the Journal of Legal Studies from 1981 to 1991, and of the Journal of Law and Economics from 1991 to 2001. At present he is a director of the John M. Olin Program in Law and Economics. He earned both a B.A. in Law from Oxford and an LL.B. from Yale."}, {"url": "https://www.law.uchicago.edu/events/festschrift-honoring-richard-epstein", "page_content": "Conference Celebrating the Work of Richard A. Epstein Add to Calendar Conference Celebrating the Work of Richard A. Epstein Event details: https://www.law.uchicago.edu/events/festschrift-honoring-richard-epstein - University of Chicago Law School web@law.uchicago.edu America/Chicago public\n\n1111 East 60th Street, Chicago, Illinois 60637 Room V By invitation only\n\n\n\nThe University of Chicago Law School and New York University School of Law will co-sponsor a conference in honor of the fifty-year academic career and scholarship of Richard A. Epstein.\n\nLocation\n\nThe conference will be held at the University of Chicago Law School, 1111 E. 60th Street.\n\nHotel Reservations\n\nTo take advantage of the University discount at the Hyatt Place Chicago-South/University Medical Center, please make your reservations online. The hotel is located at 5225 S. Harper Avenue, Chicago, IL. We recommend making your reservations as soon as possible.\n\nLiber Amicorum\n\nWhether you are able to attend this conference in honor of Professor Richard A. Epstein or not, we invite you to participate by sharing a few words about Professor Epstein, his career, and/or his scholarship. We will be collecting your words and printing a booklet – a liber amicorum – collecting your sentiments. The deadline to submit and be included in the booklet is February 8, 2018.\n\nRegister by March 30, 2018\n\nSubmit Liber Amicorum Comments"}, {"url": "https://www.law.uchicago.edu/news/epsteins-takings-appreciation", "page_content": "Epstein's Takings: An Appreciation\n\nAfter he became a law professor in 1968, it took Richard A. Epstein at least two years to get anything published because \"it's tricky,\" he said. Not to mention the distractions.\n\n\"There was a lot of instability\" at the University of Southern California where he first taught, Epstein said. The dean shut down the university for a while due to continual student protests.\n\nBy Epstein's third year of teaching, he started to get the hang of writing.\n\nSince then, Epstein has published 19 books, nearly 270 law review articles, 84 magazine and newspaper pieces and a several dozen other works.\n\nOf all these, one work stands out: \"Takings: Private Property and the Power of Eminent Domain.\"\n\nPublished by Harvard University Press in 1985, the book was \"almost universally\" condemned by law professors, said Eric A. Kades, a professor at William & Mary School of Law.\n\nEpstein, now at the University of Chicago Law School, echoed that view: the book was \"widely reviled when it came out.\"\n\nNevertheless, \"Takings\" has since been cited by the U.S. Supreme Court in four property rights cases, Kades noted.\n\n\"Not only does the Supreme Court cite him,\" Kades said, \"but his work has clearly influenced the court, perhaps most clearly in Lucas v. South Carolina Coastal Council,\" 505 U.S. 1003 (1992).\n\nTwenty years later, Epstein's 1985 book and his body of work on property rights led the William & Mary School of Law to give Epstein the school's 2005 Brigham-Kanner Prize this fall.\n\nThe prize is given to recognize the recipient's lifetime of contributions to protecting property rights and advancing those constitutional rights.\n\nDespite the initial condemnation of Epstein's book by the legal academy, \"Takings\" was an \"instant classic ... a must-read ... cited on both sides of the aisle,\" Kades related.\n\n\"The academy is very liberal. He's very conservative,\" Kades continued, explaining why law professors' original reviews were \"almost universally condemnatory.\"\n\n\"Liberals generally believe the state has wide powers to regulate private property,\" according to Kades. \"Conservatives generally believe property owners have wide rights to be free of government regulations of their land use.\"\n\nEpstein fondly remembered the 1991 U.S. Senate hearings to confirm Clarence Thomas to sit on the Supreme Court -- and the cameo appearance by \"Takings.\"\n\n\"It did not start as a debate over Anita Hill,\" Epstein said. \"It started with a debate over natural law and property rights.\"\n\nEpstein recalled that Sen. Joseph R. Biden Jr., D-Del., showed Epstein's book to Thomas \"and wanted him to confirm or disavow this book.\"\n\nIf Thomas had approved of the book, it would have given his opponents reason to reject him, Epstein related, but \"Thomas did the right thing and avoided the question.\"\n\n\"When I wrote the book, I had never taught constitutional law,\" Epstein stated. He said he had done a lot of work with property law and nuisances.\n\nHe said he wanted to learn whether the Constitution laid down a difference between property disputes involving individuals and property disputes between the government and a citizen.\n\n\"Eventually, I concluded it did not,\" Epstein said.\n\nIn Kades' summation, Epstein's \"fundamental axiom ... is that the government's power to regulate is no greater than private citizens' power to assert common-law remedies against each other.\"\n\nThe book, Epstein said, also questioned the legality of New Deal legislation.\n\n\"It was a thorough, unrelenting, all-guns-blazing attack on the received wisdom,\" Epstein said.\n\nBut his defense of property rights, he said, was \"not meant to be a defense of privilege but a defense of a series of social institutions.\"\n\n\"Where we find eminent domain abuse in most cases is powerful people going to government to condemn land owned by their neighbors to build parking lots\" and other commercial uses, Epstein asserted.\n\nEpstein says, as expected, that the Supreme Court recent decision in Kelo v. City of New London, No. 04-108 (June 23, 2005), in holding that New London, Conn., could take citizens' homes in the name of urban planning was \"dreadful.\"\n\nKades estimated that Epstein's many writings have been cited by other authors about 6,500 times.\n\n\"He's one of the giants of the field, one of the very top property scholars of the last 50 years,\" Kades said.\n\nYet when Epstein was asked what his focus is, he said, \"I don't specialize in anything.\"\n\nHe has taught courses in civil procedure, communications, constitutional law, contracts, corporations, criminal law, health law and policy, legal history, labor law, land use planning, patents, taxes, Roman law, torts, and workers' compensation.\n\nHe has written about most of those things, too.\n\n\"People ask me, How do you know what you want to write? I haven't the slightest idea,\" Epstein said. \"Somebody suggests a topic. You read, you talk, you listen ... until it all comes pouring out of your head in a relatively organized fashion.\"\n\n\n\nCopyright 2005 Law Bulletin Publishing Company"}, {"url": "https://www.law.nyu.edu/news/ideas/Richard-Epstein-prolific", "page_content": "Richard Epstein\n\nGoogle “Richard A. Epstein” and “prolific” and you’ll get plenty of hits. Other searches will produce multiple items documenting that Epstein, who is the Laurence A. Tisch Professor of Law, has long been one of the country’s most productive and influential legal scholars. On April 20, NYU Law and the University of Chicago Law School (Epstein’s former academic home, where he is now a senior lecturer) will jointly sponsor an event in Chicago to honor Epstein’s 50-year career. Even focusing just on the most recent quintile of his career—since the fall of 2007, when he began teaching regularly at NYU—there is plenty to celebrate, as his output and activity have continued at a brisk pace.\n\nScholarly productivity has long been assessed by quantifying traditional publications, and Epstein has no shortage of those. Between September 1, 2007, and March 1, 2018, he authored 123 academic journal articles and 30 book chapters; he also wrote or edited 10 books.\n\nTo focus only on Epstein’s academic writing, though, is to miss a substantial portion of his oeuvre. A leading exponent of libertarian (or, in his preferred formulation, “classical liberal”) thought, Epstein is a multiplatform threat, disseminating his ideas on myriad topics through online columns, podcasts, radio broadcasts, Twitter, and other outlets.\n\nThe conservative website Ricochet, which features Epstein on podcasts, referred to him in a tweet as “The Human Paragraph.” Words, Epstein acknowledges, flow easily for him. “If you can get yourself to a topic sentence,” he says, “you can usually see a problem through to the end.” Credit Epstein with more than 450 topic sentences for the opinion pieces he has written since August 2008, primarily for Defining Ideas, an online journal of Stanford University’s Hoover Institution, where Epstein is a senior fellow. Based on their average length, these pieces total about 750,000 words. Under \"The Libertarian\" moniker, he's done hundreds of podcasts for Hoover, as well.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBy his own estimate, Epstein delivers between 75 and 100 lectures and talks a year. During a two-day visit to Philadelphia this February, he delivered four, all without notes, as is typical for his appearances. “If you like to talk, it’s not a great burden,” he explains. With material from a single five-hour recording session, the Federalist Society has produced a YouTube playlist featuring 14 brief videos of Epstein explaining the common law and plans to post nine more this summer on contracts as well as additional segments next year on torts.\n\n“They put me on a stool and said, ‘Start talking,’” Epstein recalls. “Pretty soon it was like a rock rolling downhill.”\n\nEmploying yet another medium, Epstein has done two “Ask Me Anything” interviews on Reddit, the social news and media site.\n\nBeyond how much he produces, Epstein scores high on another metric for law professors: influence. The yardstick for this is law journal citations, and Epstein ranks in the upper echelons in a tally published in 2014 as well as in a current count in the HeinOnline database that includes citations over the past decade. Courts also cite his scholarship frequently.\n\nLess amenable to measurement, but still emblematic of Epstein’s influence is the Classical Liberal Institute (CLI), which he co-founded at NYU Law in 2013 with Mario Rizzo, an economics professor at NYU. CLI shapes law, policy, and scholarship through its conferences, publications, and fellows program and works closely with its affiliate scholars even after they leave NYU.\n\nOf final note is the breadth of Epstein’s scholarship and teaching. Among the topics he wrote about just in 2017, for example, are patents, right-to-work laws, takings law, Brexit, and Kantian moral theory. Over the course of his career, he has taught courses on 30 different subjects (16 since arriving at NYU Law), including Roman law, military law, and water law. “I will write or teach about anything, and happily learn as I teach,” he says.\n\nPosted April 17, 2018\n\nIllustration: Robert Neubecker"}, {"url": "https://www.law.uchicago.edu/events/faculty-lecture-richard-epstein-us-constitution-new-york", "page_content": "Faculty Lecture with Richard A. Epstein: The U.S. Constitution (New York) Open to the public\n\n\n\nThe Chicago Economics Society presents a discussion by leading law and economics scholar Richard Epstein, the James Parker Hall Distinguished Service Professor Emeritus of Law and senior lecturer at the University of Chicago Law School. Epstein will discuss the U.S. Constitution, shedding light on contemporary disputes in economic policy and regulation.\n\n\n\nCost: $35/person; includes an open bar from 6:30-7:30 p.m.\n\n\n\nClick here for more information or to register."}]}