{"Tom Butler is known for his roles in Saw III, Saw IV, and Saw V, as well as Smallville, Supernatural, and The 4400.": [{"url": "https://www.techradar.com/how-to/how-to-watch-the-saw-movies-in-order", "page_content": "Eight films, 16 years, and countless torture traps later, Saw remains a beloved horror series. The story follows John Kramer, aka the Jigsaw killer, a man who captures people in order to rehabilitate those he deems unworthy.\n\nHe adopts violent means to impart this message, forcing innocents into horrific death traps from which they have to do grisly things in order to survive. Despite the fact that he dies midway through the franchise, for the remainder of the series his acolytes, family and victims adopt the Jigsaw mantle, continuing his reign of terror.\n\nThe franchise also continues with Spiral: From the Book of Saw , the latest installment currently in US theaters and rolling out worldwide. It enlists fresh franchise meat in the shape of Chris Rock, Max Minghella, Marisol Nichols, and Samuel L. Jackson, as cops track crimes that resemble the infamous Jigsaw killer.\n\nWith that in mind, you might be considering a rewatch of the Saw movies to refresh your memory. With Jigsaw’s twists and turns, and the not-inconsiderable retconning, it’s a good idea to get reacquainted. Here’s how you watch the Saw movies in order – both chronologically and by release date, as we explain the best way to enjoy the horror films in 2021.\n\nSaw movies in chronological order\n\nJigsaw\n\nSaw\n\nSaw II\n\nSaw III\n\nSaw IV\n\nSaw V\n\nSaw VI\n\nSaw 3D\n\nJigsaw\n\nSpiral: From the Book of Saw (2021)\n\nTo watch the Saw story in precise chronological order is like Jigsaw’s traps: difficult to figure out. It requires patience and an editing suite. Why? It's because each movie includes two story parts.\n\nOur chronological order follows the present day timeline. A strict chronology based solely on the backstory means you’d be stopping and starting different movies every five minutes, and rewatching the movies several times. Accurate? Yes. Fun? Not so much.\n\nBut fear not. Here’s the explanation of what’s happening in the present, and we’ve included descriptions of the flashbacks that fill in Kramer’s backstory to help you make sense of the Saw movies as you go. Expect big spoilers ahead for the movies.\n\n(Image credit: Lionsgate)\n\nPart of Jigsaw (2017)\n\nA portion of the story in Jigsaw takes place years before Saw. Five people wake up in a barn wearing Bucket Head Traps. This is the very first set ‘game’ by John (although not his first trap). One of the survivors of this game, Logan, goes on to become one of Kramer’s apprentices.\n\nSaw (2004)\n\nPresent day: Dr. Laurence Gordon (Cary Elwes) and Adam Stanheight (Leigh Whannell) both wake up chained up in an underground room. There’s a dead body in the room.\n\nFlashbacks: Detective Tapp hires photographer Adam Stanheight to spy on Dr. Gordon. Kramer learns of this. His apprentice Amanda Young (Shawnee Smith) kidnaps both of them. Kramer takes a cocktail of meds to slow his vitals, and lies in the underground room.\n\nSaw II (2005)\n\nPresent day: One year after the events of Saw, Detective Eric Matthews (Donnie Wahlberg) apprehends Kramer. But there’s another game underway with eight people including Matthews’ son Daniel and Kramer’s undercover apprentice, Amanda.\n\nFlashbacks: After his wife Jill leaves him, Kramer tries to commit suicide but fails. His rebirth inspires him to teach others the feeling of “instant rehabilitation” and so begins his work to help others.\n\nDr. Gordon diagnoses Kramer with an inoperable tumor.\n\nSaw III (2006) / Saw IV (2007)\n\nPresent day: In the franchise’s first big twist, it’s revealed that both films happen six months after the events of Saw II at the same time. They each follow games carried out by two of Kramer’s minions: Amanda Young and Detective Hoffman.\n\nFlashbacks: In Saw IV we learn the motivation for Kramer’s entire scheme when his wife Jill miscarries as a result of the actions of Cecil Adams. Kramer sets his first trap for Cecil, cutting out a piece of his skin shaped like a puzzle piece, leading to his nickname, the Jigsaw killer.\n\n(Image credit: Lionsgate)\n\nSaw V (2008)\n\nPresent day: With Kramer dead, a new murderer begins a series of traps that resemble Jigsaw’s old games. Jill receives instructions from her dead ex-husband.\n\nFlashbacks: The media frenzy surrounding Jigsaw leads to a copycat killer in the shape of Detective Hoffman. We learn it's Hoffman who created the trap for Seth Baxter at the start of Saw V to appear like a Jigsaw killing, as Baxter murdered his sister. Kramer finds out and enlists Hoffman to help his mission.\n\nSaw VI (2009)\n\nPresent day: A few days after the events of Saw V, Hoffman starts a new game that involves health insurance executive CEO William Easton. Easton dies. Under instruction from her husband, Jill puts Hoffman in a bear trap, which he survives.\n\nFlashbacks: Kramer asks Easton to fund an experimental therapy for his tumor that may save his life. Easton denies him coverage. We learn that Amanda was partially to blame for the miscarriage. Hoffman used this information to blackmail Amanda into carrying out her game in Saw III.\n\nSaw 3D / The Final Chapter (2010)\n\nPresent day: A few weeks after the events of Saw VI, Jill and Hoffman battle it out to take control of Jigsaw's legacy. The main game involves Bobby Dagen (Sean Patrick Flanery), a man who lied about surviving a Jigsaw trap to garner fame. Hoffman is killed by Dr. Gordon.\n\nFlashbacks: In a jump all the way back to Saw, we learn that shortly after he saws his foot off, Dr. Gordon cauterizes the wound and is enlisted by Kramer to be another apprentice.\n\nLatter part of Jigsaw (2017)\n\nPresent day: Surprise! The main story of the detectives trying to locate the Jigsaw killer takes place ten years after Saw III. It’s his apprentice, Logan, who survived the barn trap that’s actually carrying out the game.\n\nSpiral (2021)\n\nWithout spoiling the movie if you haven't seen it yet, Spiral takes place years after the previous Saw movies.\n\n(Image credit: Lionsgate)\n\nSaw movies in release order\n\nSaw (2004)\n\nSaw II (2005)\n\nSaw III (2006)\n\nSaw IV (2007)\n\nSaw V (2008)\n\nSaw VI (2009)\n\nSaw 3D/The Final Chapter (2010)\n\nJigsaw (2017)\n\nSpiral: From the Book of Saw (2021)\n\nWatching the Saw movies in chronological order is a good way to enjoy the series as a newbie. First-time watchers will get a good idea of what the franchise is about, without diving into the hows and whys. For those revisiting it a second time, it’ll serve as a handy refresher leading into Spiral.\n\nWhat began with the grimy, low-budget original expanded into a complex web of plot twists and turns that audiences never saw coming. Saw throws you in at the deep end – in the middle of a story that unravels over the next decade of storytelling. The 2004 opener kicked things off modestly with a $1.2 million budget. Relative newcomers Leigh Whannell and James Wan co-wrote the script, with Wan tackling director duties.\n\nThe Mobius strip of Jigsaw’s plots grows ever more complex the deeper you get into the franchise. Watching the Saw movies in release date order, you’re able to chart the series’ box office success, purely based on how elaborate (and costly) the traps become in the later sequels.\n\nAs you progress into the series, the retconning and interwoven backstories grow more complex, which is why it’s a good idea to watch once without worrying too much about it. After that, you should revisit our first list to really get to grips with the specifics.\n\nBest Saw movies\n\nThis all leads to one inevitable question: what are the best Saw movies? Everyone’s opinions differ on this topic, of course, with personal preferences being taken into account (we’re fond of the first three).\n\nHere, we’re letting the film community speak for themselves, by ranking the Saw movies via their IMDB user ratings. To be honest, the general consensus feels pretty accurate to us. It’s interesting to note that newest entry Spiral sits quite high on the list already, but that could all change once the movie is widely available.\n\nBest\n\nWorst"}, {"url": "https://www.imdb.com/title/tt0489270/faq", "page_content": "It is open for debate, but there could be six games in total. First, there is Troy, who needs to escape the room he is in before it explodes. The second game involves Det. Kerry, who needs to retrieve a key to free herself before a device pulls her rib cage apart. However, both games are revealed to be unwinnable, i.e. there is no outcome where they can survive. Both games appear mainly as subplots, and both victims fail their test.\n\n\n\nThere are two games in the main plot, concerning two victims: Jeff, a grief-stricken father who neglects his family in a quest for vengeance, and Lynn, a doctor who is cheating on her husband. Jeff is put through a series of trials whereby he must learn to forgive and stop living for revenge, which he must complete in time, otherwise he will be sealed inside the room and die of starvation. Jeff's final trial will be a confrontation with \"the man responsible for the loss of his child\", assumed to be the man who killed his son in an accident. Lynn simply has to keep John \"Jigsaw\" Kramer alive until Jeff completes his trials; if John dies, she'll die. If Jeff succeeds, he and Lynn (who are revealed to be husband and wife) are free to leave; if Jeff fails, they will both die.\n\n\n\nIt is not until the very end that we learn that both Jeff and Lynn's games are also part of the fifth and (arguably) sixth game, with the victims being Amanda and John themselves. Amanda built traps that were unwinnable, making her no better than a killer in John's eyes. So when John tells Lynn that her game is to \"test her will to keep someone alive\", notice that he is actually looking at Amanda; Amanda's game is to give Lynn a fair challenge and play by the rules. If she allows Lynn to pass her test, Amanda will pass hers.\n\n\n\nAs for Jeff, he is part of John's test: John says that Jeff will finally meet \"the man responsible for the loss of his child\", meaning himself, as John has also kidnapped Corbett, Jeff's daughter. John hopes that he can \"cure\" his victims and make them appreciate their lives again, so his game involves putting his own methods to the test. He puts himself at the Jeff's mercy, as well as putting his fate in Amanda: if John passes his own test, he will be forgiven; if not, he will be killed.\n\n\n\nLynn passes her test, but when Amanda fails her test by shooting Lynn, John says \"you just destroyed four lives\", referring the lives of Lynn, Jeff, herself and John. John fails his test when Jeff cannot forgive him. In Jeff's case, the punishment for failing his test is the loss of his daughter, since the oxygen in her room is running out, and John and Amanda are the only ones who know where she is. Edit"}, {"url": "https://www.denofgeek.com/movies/tobin-bell-interview-jigsaw-the-saw-movies-and-more/", "page_content": "No, no. It’s not about [that]. I knew he was in the middle. I knew he was the fulcrum, on a seesaw, you know? And roles in films have nothing to do, really, with the size of the role. They have, for me, to do with how important they are, to the film, and to the story. So, I’ve played many roles that were not huge talking roles, but were vital.\n\nSo, lying on the floor! I was aware that I was going to have to do that. I was aware that half his head was blown off, and that I was going to have to deal with being wet most of the day. And that no one would want to have lunch with me, because I was so disgusting-looking, you know? And, so, all of those things came to mind. It would take three and a half hours every morning to build that prosthetic on my head so that it looked convincing. So, all of those things you think about.\n\nAnd, of course, there are a few scenes in that first film where you do get to move around. Obviously, there’s the ending, and there’s also the –\n\nOh yes, there’s always outside the place flashback-y sort of things. Flashfowards. I think it’s mostly flashback. It’s just kind of a window into where this guy lives, you know?\n\nAnd how much backstory information did you have to go on, at that time? Because obviously, you play John, in the scene where Danny Glover finds his secret base, and John is right in the middle of everything he does. Did they give you much indication of, like, how long has John been doing this and what are his motivations? Or did you not have that information yet, at that time?\n\nUm… no. I didn’t give a lot of thought to Danny’s backstory. Mine was so sketchy, that, I gave a lot of thought to the cancer. His mind-set. Oh… people ask me, all the time, about favourite scenes… and what just occurred to me was, when I said mind-set, the moments before Saw 1, are filmed in… how many of these films have you seen?"}, {"url": "https://www.looper.com/383813/what-happened-to-the-cast-of-saw/", "page_content": "Cookies help us deliver our Services. By using our Services, you agree to our use of cookies. Learn More\n\nWhat Happened To The Cast Of Saw?\n\nIn the grand tradition of Saw — a franchise that has now been with us for over 15 years! — an ominous voice recording has just informed us that it fears we may not have sufficiently appreciated the considerable skills of the original film's actors. Now the name of our game is \"What happened to the cast of Saw?\" If we want to get out of this alive, we have to tell you about where their lives and careers went after they first encountered Jigsaw back in 2004.\n\nLuckily for us, even glancing at the film's featured players is enough to remind us that it really does have an exceptional cast, one complete with genuine movie stars, outstanding character actors, and all-around interesting people. And their post-Saw work has a lot to offer, so let's work together to disarm this trap by looking at some of the coolest horror alumni around.\n\nNote: This article will contain spoilers for the Saw series."}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Characters/SawIToIII", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Characters/SawIToIII\n\nopen/close all folders\n\nLawrence Gordon\n\nAdam Stanheight\n\nAlison and Diana Gordon\n\nCarla Song\n\nCarla Song \"It's not like I know the rules for this sort of stuff.\" Played by: Alexandra Bokyun Chun\n\nAppearances: Saw Alexandra Bokyun Chun A medical student at the Angel of Mercy Hospital, where she was educated by the Lawrence, whom she tried to have an affair with. Impaled with Extreme Prejudice: In the second video game, Carla meets her fate at Henry Jacobs' hands, who impales her with a pair of scissors.\n\nKarma Houdini: Averted in the second video game, where she is kidnapped and put to test by Jigsaw for smuggling drugs.\n\nThe Mistress: Carla engages in an affair with Lawrence, even though he has a wife and a daughter.\n\nOlder Than They Look: Carla, a medical student, is played by Alexandra Bokyun Chun, who was 37 years old when the movie was released.\n\nSmall Role, Big Impact: Her adultery with Lawrence kickstarts the latter's suffering streak. Lawrence's family slowly crumbles down, he becomes vulnerable and exposed to both Tapp and Jigsaw, and despite surviving his test, Word of God said that he later went through a Sanity Slippage that led to Alison divorcing and taking custody of Diana.\n\nWord of God said that he later went through a Sanity Slippage that led to Alison divorcing and taking custody of Diana. Sympathetic Adulterer: She seems genuinely saddened when Lawrence decides to abruptly end their affair before it even begins, leading to the assumption that her feelings for Lawrence are real to some degree.\n\nOther Victims\n\nBrett\n\nBrett Played by: Benito Martinez\n\nAppearances: Saw \"Well, as your lawyer and your friend, my advice to you is to bite the bullet and give them your alibi now because no one is gonna believe you later.\" Lawrence's lawyer and close friend. Ascended Extra: A What Could Have Been example. In Saw IV, he was going to be the victim who had to set up the various traps seen in the film before Art Blank took his place.\n\nWhat Could Have Been example. In Saw IV, he was going to be the victim who had to set up the various traps seen in the film before Art Blank took his place. No Full Name Given: Only his first name is known.\n\nFather\n\nFather Played by: Avner Garbi\n\nAppearances: Saw Avner Garbi A neighbor of Lawrence and his family, who offers Alison and Diana to stay in his house when they escape from Zep. No Name Given: The film's credits only refer to him as \"Father\".\n\nDaniel Matthews\n\nOther Nerve Gas House Victims\n\nMichael Marks\n\nJeff Denlon\n\nJeff Denlon Played by: Angus Macfadyen\n\nAppearances: Saw III | Saw IV The main character of Saw III. His son was killed by a drunk driver. He is unable to let go, to the detriment of the rest of his family, including his daughter Corbett and his wife Lynn. Jigsaw devises a series of traps in an attempt to help him let go and forgive those responsible for his son's death. Aborted Arc: In Saw IV, the arc about saving his daughter by playing another game is abruptly cut short by Strahm shooting him dead.\n\nChainsaw Good: When his pistol runs out of ammo, he uses a circular saw to kill Jigsaw.\n\nDecoy Protagonist: The last minute or so of Saw III sets him up as the protagonist for the next movie as well - \"In order to save your daughter, you will need to play a game.\" Apparently the new writers brought in for IV didn't want to follow up on that plotline, since he's shot by Strahm seconds later. In a previous version of the Saw IV script, it was shown that Jeff had to play a game similar to Strahm's in Saw V but with saw blades, and would have had to get inside like a giant blender of sorts. note This idea was later reused for the Cycle Trap in Jigsaw. He was still killed regardless.\n\nExcessive Mourning: What brings him onto Jigsaw's radar: Jeff is consumed by grief over his son's death, to the point he's neglecting the rest of his family. His first scene has him getting angry at his daughter for taking a toy bear from his son's room. His game is all about getting him to let go of his grief and anger. Too bad it didn't take.\n\nPapa Wolf: All of his rage is over the death of his son. Anyone even remotely involved with the boy's death is responsible in his eyes.\n\nParental Neglect: He's so busy grieving for his lost son that he has been neglecting his daughter.\n\nPyrrhic Victory: The only victory he can really be said to have is that of putting an end to Jigsaw and his apprentice. Not that it matters much, since it condemns his wife and daughter to death and he gets killed by Strahm.\n\nRevenge Before Reason: His fatal flaw. He could have forgiven all those responsible, save them from death, and find peace for himself. He could have also chosen to live the rest of his life with his other family members, learning to live with his son's death. Yeah, he doesn't. The result? Every victim of the games dies, including his wife. Plus, his daughter remains missing and he gets killed by Strahm.\n\nToo Dumb to Live: He draws Amanda's pistol on an armed FBI agent who warned him to stand down. Although to be fair, Jeff was definitely not in the right state of mind with everything he went through.\n\nVengeance Feels Empty: When confronted with Timothy, he doesn't exactly feel too great about watching his torture device slowly kill him despite openly stating he's wanted to kill him for years. Jeff then tries to save him. Ironically, he didn't actually learn anything from this and tries to exact revenge on John after, which ends horribly for him.\n\nLynn Denlon\n\nTroy\n\nTroy Played by: J. Larose\n\nAppearances: Saw III J. Larose A repeat convict who is the first victim of Amanda Young's rigged inescapable traps. Asshole Victim: Potentially, as he is a known repeat offending criminal, though exactly what his crimes were is never elaborated on, so it's unclear how bad he was.\n\nAttack the Mouth: One of the chains is hooked into his lower jaw. It's the only one he's unable to remove in time.\n\nBit Character: His only real purpose is to foreshadow the fact that Amanda has started rigging traps.\n\nCruel and Unusual Death: He was mutilated by having chains pierced through his body, and was forced to pull them out before being blown up with a nail bomb.\n\nFive-Second Foreshadowing: If you are knowledgeable, you may realize that removing the chain from his lower jaw would be impossible for him to do with his bare hands. note In fact, an earlier version of the Classroom Trap's scene had him attempting to remove the chain by stomping it with his feet, resulting in a comparable outcome wherein his jaw gets broken. This is a hint that his test was rigged to be nearly impossible to escape. Unless he could free himself from the other chains and grab the bomb to disarm it or throw it out one of the windows, he would have no way to survive. Even then, he would be forced to stay with his jaw hooked until help arrived, assuming he didn't bleed to death first.\n\nThis is a hint that his test was rigged to be nearly impossible to escape. Unless he could free himself from the other chains and grab the bomb to disarm it or throw it out one of the windows, he would have no way to survive. Even then, he would be forced to stay with his jaw hooked until help arrived, assuming he didn't bleed to death first. Ludicrous Gibs: From taking the explosion of a nail bomb point-blank.\n\nMorton's Fork: Even if he had been able to remove the final chain in time, the door to the room was welded shut. Technically, despite the attempt to rig his test, he could have possibly survived by cheating and removing the visible batteries from the bomb's timer or throwing the bomb out the window, but with the mercilessly short timer of a minute and 37 seconds and no foreknowledge of the door being welded shut, his chance of surviving is still virtually nonexistent, due to just how much of the time he would have spent getting out of the chains.\n\nSymbolic Mutilation: Troy repeatedly returned to prison despite having a good privileged life. In the Classroom Trap, numerous chains pierce his body and keep him enclosed like in a prison cell, which he has to pull out in order to free himself. Plus, the door to get out of the classroom was rigged by Amanda, which, while rendering the trap inescapable, can be seen as a metaphor to confinement.\n\nVictims of Jeff's Trial"}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Characters/SawMetropolitanPoliceDepartment", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Characters/SawMetropolitanPoliceDepartment\n\nopen/close all folders\n\nIn general:\n\nIn General\n\nThe department's seal and logo from Saw II to 3D, as seen in a police station sign. The department's seal and logo from Spiral, as seen in another police station sign. The police department of the unnamed city where the movies take place. Its known divisions include a Homicide Unit, a SWAT division, a forensic team, a tech team, a bomb squad and an Internal Affairs Division. Dirty Cop: Hoo boy, is it full of them. The department has had several Cowboy Cops, a few Rabid Cops, and plenty of officers who framed people, commited torture, shot suspects in the back or (in the case of the commanding ones) covered evidence regarding cases of corruption. One of them was even an actual Jigsaw killer (who attempted to recruit Rigg into the role as a bonus point), and another is a copycat.\n\nInternal Affairs: The department's Internal Affairs Division takes charge of the Jigsaw case when Hoffman is publicly identified as the wanted second Jigsaw apprentice in Saw 3D.\n\nJack Bauer Interrogation Technique: Rigg physically assaults one abusive parent and potentially other suspects, and in Saw II encourages Eric to beat the answers they want out of John, implying that this is standard practice for the department.\n\nPolice Are Useless: Played with most of the time. Alongside the FBI, the department isn't necessarily incompetent and is always active in the Jigsaw case, but they never manage to capture any of the Jigsaw killers and accomplices they know about (only getting their corpses after they have been killed by someone else), or even discover certain Closed Circles like the Nerve Gas House (which includes the infamous Bathroom) and the barn (which somehow went unnoticed for over a decade ). Justified in Spiral, where it's shown that the department has had plenty of Dirty Cops and a long history of Police Brutality, especially after Zeke turned in Pete for murdering a witness. This not only worsens the department's efforts to capture the Spiral Killer, but also left many past crimes without resolution.\n\nSWAT Team: The department has a division with several of them, though Rigg and the unnamed Lead SWAT Officer are the only known SWAT leaders so far.\n\nWhere the Hell Is Springfield?: The department is part of the government of an unnamed American city, which is the setting for the movies, with the only hint as to the location being the TV network WNKW, implying that it's east of the Mississippi River. The license plates seen in the movies deliberately leave off the name of the state, although their style resembles that of New Jersey ones. In the first film, Tapp and Sing are seen using a map with the layout of Washington, D.C. Jigsaw further establishes that the city isn't Cleveland, as Eleanor is offered the position of medical examiner in that city. That said, most fans believe that the city is somewhere on the East Coast, specifically around Philadelphia, whose skyline was used in establishing shots of Spiral.\n\nChiefs and commanding officers:\n\nChief of Police\n\nChief of Police Played by: Al Sapienza\n\nAppearances: Saw V Al Sapienza \"I'd like to thank you all for coming today. I'd like to be the first to say the Jigsaw murders are over. The officers who gave their lives are being honored here today.\" The chief in charge of the Metropolitan Police Department at the time of Saw V. Minor Major Character: As the chief at the time of the first seven films, it should go without saying that he must have given particular attention to the notorious Jigsaw killers, especially once they rack a good body count and show themselves to be competent enough to outsmart the police many times. However, he's only seen at the ceremony held to announce the supposed end of their killing spree, not even returning once further games pop up or Hoffman is exposed as the killer who's been holding the games since that moment.\n\nNo Name Given: He's left unnamed, only being credited by his title.\n\nOne-Shot Character: He's only present in the ceremony for the end of the Jigsaw killings and Hoffman's promotion.\n\nMarcus Banks\n\nAngie Garza\n\nAngie Garza Played by: Marisol Nichols\n\nAppearances: Spiral \"Hey! Now, we got a dead cop here, guys, who was brutally killed. A fallen brother whose tongue was ripped out. We need to focus on the case and solve this. So get the footage to Detective Banks and put your personal shit aside. O’Brien, you good?\" Zeke's boss and a captain of the force. During the days of Marcus as chief, she was his closest cohort in covering up the brutal and unjust actions of the Metropolitan Police Department's officers. Asshole Victim: Downplayed. While Angie was deeply complicit in a conspiracy to allow police corruption to run rampant, she wasn't a particularly malevolent person herself and genuinely cared about her subordinates. Her absolutely horrific death was incredibly cruel, to say the least.\n\nCruel and Unusual Death: Her game forces her to sever her spinal cord by pressing the back of her neck into a blade far enough to stop a contraption from pouring boiling wax onto her face. As she fails, she literally gets her face melted off before suffocating to death.\n\nDa Chief: While not the police chief in the present (she's only a captain), Angie displays the usual clichés associated with this character archetype, chastising Zeke's antics which she doesn't approve of, while also letting him (and the rest of the department) get away with whatever they want.\n\nDirty Cop: She was the number two of Marcus in a large-scale conspiracy to grant police officers more power regardless of what they did.\n\nEveryone Has Standards: While she's reluctant to put Zeke in charge of the new Jigsaw homicides, Angie lashes out at the disdain the other cops have for her decision, stating a life has been lost and to get over themselves and catch the killer.\n\nForeshadowing: In the scene where Zeke and Schenk examine the Spiral Killer's first video message to the police, Zeke's own computer to the opposite side of the one they're using shows what appears to be an X-ray of a spinal cord alongside carved flesh. Angie is given the goal of severing her spinal cord in the Wax Trap.\n\nJerkass Has a Point: She calls out Zeke on his stubbornness on not following police protocol, stating regardless of his circumstances, it jeopardizes his life and creates even more problems.\n\nHomicide Unit:\n\nPre-Spiral:\n\nDavid Tapp\n\nSteven Sing\n\nSteven Sing \"What did you do?! Turn it off!\" Played by: Ken Leung\n\nAppearances: Saw \"He's been injected with an opiate overdose. Couldn't move or feel much of anything.\" A homicide detective who was Tapp's close friend and partner. He was tragically killed in a disastrous raid on Jigsaw's lair. Tapp never got over his death. Take a Third Option: He initially plays along with Jigsaw's orders to find the keys for Jeff's Drill Chair game in his lair. After realizing the nigh impossibility of the task, he simply shoots at the drills and saves the man.\n\nA Tragedy of Impulsiveness: He raids Jigsaw's lair with Tapp without a permit or backup and, in the ensuing struggle, tries to pursue him on his own. That didn't end well.\n\nYour Head Asplode: In his pursuit of Jigsaw, he trips a wire linked to the triggers of four shotguns above his head, which end up shooting him.\n\nYou Need to Get Laid: Sarcastically says this to Tapp when he notices how unhealthily he investigates the Jigsaw Killer's case overnight. However, he changes his tune when Tapp makes a discovery that leads them right to the killer.\n\nAllison Kerry\n\nEric Matthews\n\nFisk\n\nFisk \"I'd say justice was served.\" Played by: Mike Realba\n\nAppearances: Saw IV | Saw V Mike Realba A homicide detective seen in Saw IV and V, who seems to be a close colleague of Hoffman. Chuck Cunningham Syndrome: From Saw VI onward, he ends up completely absent in the series. Even though pretty much every significant law enforcement officer (cops and FBI agents alike) dies at some point in the series, Fisk just disappears.\n\nNo Full Name Given: Only his first name is known.\n\nJenkins\n\nJenkins Played by: Don Balderamos\n\nAppearances: The Scott Tibbs Documentary Don Balderamos A homicide detective seen in The Scott Tibbs Documentary. He's the officer who announced at a press conference the escape of John and Eric (whom he presumed was taken hostage by John) after the events of Saw II. Later in the short, Scott attempts to interview him. No Full Name Given: Only his surname is known.\n\nRage-Breaking Point: Downplayed. He angrily tells Scott to stop asking him about things that only the police can have knowledge of when he asks him for what reason Eric was tested.\n\nSpiral:\n\nZeke Banks\n\nWilliam Schenk\n\nWilliam Schenk Played by: Max Minghella\n\nAppearances: Spiral A relatively new cop that's assigned as a partner to Zeke on the new Jigsaw homicides. By-the-Book Cop: To Zeke's Cowboy Cop.\n\nDesecrating the Dead: He is kidnapped and his corpse skinned by the Spiral Killer in a departure from the Jigsaw M.O.\n\nFamily Man: Has a wife and a newborn son.\n\nFatal Family Photo: Early on in the film, he shows Zeke a photo of his wife and newborn child. Later on, his dead body is discovered .\n\n. New Meat: Of the Metropolitan Police Department. Zeke even refers to him as such.\n\nNice Guy: Even by the department's standards, he's one of the nicest cops around in the series.\n\nMarv Bozwick\n\nMarv \"Boz\" Bozwick Played by: Dan Petronijevic\n\nAppearances: Spiral Dan Petronijevic A detective from the Metropolitan Police Department. He was the Spiral Killer's first victim. Notably, while corrupt, Boz was said to be a kind man, and his death is a large part of why Zeke is so determined in stopping the killer. Asshole Victim: Despite being one of the only cops who were nice to Zeke, he was still a corrupt cop whose false testimonies put innocent people in prison.\n\nDirty Cop: He has taken the witness stand in court many times, and his lies have put innocent people in jail.\n\nLudicrous Gibs: All that's left of Boz after his test is unrecognizable gore splattered across the subway tracks.\n\nPet the Dog: He was possibly the only one in the department who remained friends with Zeke, even after he turned one of them in. He used to go to games with him and play with his son.\n\nSmall Role, Big Impact: He dies in the opening, but his death kickstarts the plot and we retroactively learn more about him.\n\nSymbolic Mutilation: In the Subway Trap, Boz is forced to rip his tongue out for lying about innocent people being criminals.\n\nTongue Trauma: The trap he's put in hoists his body up into the air, with his tongue trapped by a device. Boz must jump off a platform to avoid getting hit by a subway train, losing his tongue in the process. He does so, but too late, and he not only does take his whole tongue with him, but he gets ran over anyways.\n\nFitch\n\nFitch Played by: Richard Zeppieri\n\nAppearances: Spiral Richard Zeppieri A homicide detective who's one of the many officers who ostracize Zeke. He was the Spiral Killer's second victim. Asshole Victim: The biggest in the whole movie. Fitch was a sociopathic monster who once murdered a man for flipping him off when ordered to raise his hands . He also treated Zeke with nothing but contempt. It's telling that of all the cops that die in the movie, Zeke feels absolutely nothing for Fitch upon discovering his remains .\n\n. He also treated Zeke with nothing but contempt. It's telling that of all the cops that die in the movie, . Dirty Cop: And how! Besides all the crimes mentioned above in Asshole Victim, he also refused to provide backup for Zeke during a shootout as revenge for turning another cop in, which almost got Zeke killed .\n\n. Dirty Coward: While feeling smugly satisfied with denying Zeke backup, Fitch turns into a nervous wreck fidgeting around suspiciously when he witnesses Marcus' wrath at the situation.\n\nEvil Is Petty: Exaggerated. He once murdered a man for flipping him off.\n\nFingore: Fitch is trapped in a tub slowly filling up with water, with exposed electrified wires hung over the edge, and a motor binding his fingers down. To escape, he must bite a mechanism that'll activate the motor, which will rip all of his fingers off. He ultimately can't do so in time and ends up electrocuted to death.\n\nForeshadowing: After Zeke and Schenk come with Fitch and Kraus to the see the spray-painted spiral, an X-ray of a hand is present on Fitch's computer. The trap Fitch ends up in specifically requires him to mutilate a part of his hands.\n\nHigh-Voltage Death: He fails to remove his fingers in time, and thus, is fried to a crisp when the water in his trap reaches the electrical cords.\n\nJerkass: He always treats Zeke like shit, due to him turning another cop in. He once refused to provide backup for Zeke during a shootout, despite being the nearest cop to him, which almost got Zeke killed .\n\n. Killer Cop: He once murdered a man for Flipping the Bird while raising his hands.\n\nNo Full Name Given: His first name is never stated.\n\nPragmatic Villainy: Despite refusing Zeke backup , the second shots are fired, he has an Oh, Crap! moment and rushes to his location. This isn't because he cares about Zeke , but because he knows Marcus will go ballistic (i.e. kill him) if his son died because of him\n\n, the second shots are fired, he has an Oh, Crap! moment and rushes to his location. This isn't because he , but because he Symbolic Mutilation: Fitch has to rip his fingers off in the Finger Trap. He previously killed a man just because he flipped him off , and the Spiral Killer says that his fingers pulled the trigger.\n\nPete Dunleavy\n\nPeter \"Pete\" Dunleavy Played by: Patrick McManus\n\nAppearances: Spiral Patrick McManus A former officer from the Metropolitan Police Department, who was discharged after Zeke turned him in for the murder of Charlie Emmerson. He's since been reduced to a pathetic bum living under a church and drowning his sorrows with booze. The Atoner: After becoming homeless and miserable, he seems to have lapsed into this after living under a church. He claims he seeks God's forgiveness regularly and has a serious Heel Realization about how out of control he and the department was. That said, it's made clear he still deeply resents Zeke for turning him in, indicating a certain degree of lasting irresponsibility.\n\nAsshole Victim: His death at the hands of the Spiral Killer is horrifying, but he previously murdered Charlie Emmerson to prevent him from testifying against a fellow officer. And for all his gestures at atonement, Pete still remained a bitter asshole to Zeke and never realized he was in the right in testifying against him. This is even lampshaded by Schenk, expressing Pete had it coming for ruining not only his life but Zeke's as well.\n\nBlatant Lies: He makes a pathetic attempt to justify shooting Charlie by saying it was in self-defense. Zeke : The witness pulled a gun on you?\n\nCruel and Unusual Death: Besides Angie, he gets arguably the worst of the victims in the movie. Pete is chained up above a platform in front of a machine that will grind up rounds of glass bottles and pelt their shards at his body. The only way he can survive this is if Zeke finds the key to free him, but he's slowed down by being forced to take cover between the grinder taking breaks and firing. Pete agonizingly takes multiple rounds of this before expiring.\n\nDirty Cop: Ex-dirty cop, to be more specific. He killed Charlie to prevent him from testifying against another officer, then tried to make it look like he shot him in self-defense. Zeke didn't buy it and turned him in, getting him kicked out of the force.\n\nForeshadowing: At the church, when Zeke asks him if he's trying to get sober again, Pete replies: \"Alcohol's not my problem. The glass and the bottle can kill.\" Later in Zeke's game, Pete appears in a trap involving broken glass from bottles.\n\nUnwitting Instigator of Doom: His murder of Charlie Emmerson made his son William take revenge against dirty cops like him as the Spiral Killer.\n\nDeborah Kraus\n\nDeborah Kraus Played by: Edie Inksetter\n\nAppearances: Spiral Edie Inksetter A detective of the Homicide Unit. Dirty Cop: Possibly averted, unlike most of the other detectives seen in the film. Asides from Boz, she's the only officer who doesn't hold any grudges against Zeke, and it's implied that she was against Article 8.\n\nDrury\n\nDrury Played by: K.C. Collins\n\nAppearances: Spiral K.C. Collins A homicide detective who's one of the many officers who ostracize Zeke. Facial Horror: A What Could Have Been example. He was going to have a trap in which he had to cut his face off. The trap's scene was cut due to the MPAA deeming it to be too violent.\n\nWhat Could Have Been example. He was going to have a trap in which he had to cut his face off. The trap's scene was cut due to the MPAA deeming it to be too violent. No Full Name Given: Only his surname is known.\n\nSWAT division:\n\nDaniel Rigg\n\nLead SWAT Officer\n\nLead SWAT Officer Played by: Simon Northwood\n\nAppearances: Saw 3D Simon Northwood The SWAT team leader who accompanies Gibson on his pursue of Hoffman in Saw 3D. No Name Given: His name is unknown.\n\nSWAT Team: The leader of one.\n\nInternal Affairs Division:\n\nMatt Gibson\n\nMatt Gibson \"You've got to give before you can receive in this house, Jill.\" Played by: Chad Donella\n\nAppearances: Saw 3D An officer who became bitter towards his colleague Mark Hoffman when he killed a homeless man who was holding him at gunpoint. He was demoted and re-assigned to the department's Internal Affairs Division when he told their boss to enact at least some punishment on Hoffman. In Saw 3D, Jill specifically requests protection from him with Hoffman out for her head. By-the-Book Cop: One of the more upstanding cops seen in the series. He previously turned in some of Hoffman's cronies for corruption and is reluctant to help Jill unless she follows the rules. Due to his selfless nature and history with Hoffman, he's the only police officer who Jill believes isn't complicit with Hoffman.\n\nGood is Not Nice: While Gibson is genuinely a heroic figure, he repeatedly expresses his disdain for Jill due to her involvement in a murderous conspiracy.\n\nNice Job Breaking It, Hero: His all-out manhunt for Hoffman is arguably the biggest clusterfuck out of all of this trope's examples in the series. It leads to, among other things, the deaths of an entire police precinct .\n\n. Tempting Fate: He returns to the Horsepower Trap's scene when Rogers tells him over the phone that an explosion just happened there. The moment he enters, Gibson asks if anyone got hurt, to which another explosion comes off almost immediately. Downplayed in that the cops at the scene dodge both explosions in time to avoid any injuries.\n\nToken Trio: He (white male) forms one with Palmer (white female) and Rogers (black male).\n\nYou're Insane!: He's exasperated when he finds out about Jill's role in placing the Reverse Bear Trap 2.0 on Hoffman.\n\nPalmer and Rogers\n\nPalmer Rogers Played by: Kim Scharner (Palmer), Laurence Anthony (Rogers)\n\nAppearances: Saw 3D Kim Scharner (Palmer), Laurence Anthony (Rogers) Gibson's two partners in the Internal Affairs Division. Moe Greene Special: Rogers is killed by Hoffman when the latter shoots him in the right eye.\n\nNeck Snap: How Hoffman kills Palmer.\n\nNo Full Name Given: Only their surnames are known.\n\nToken Trio: They form one with Gibson (white male). Palmer is the white female and Rogers is the black male.\n\nForensic team:\n\nAdam Heffner\n\nDr. Adam Heffner \"I was the one who examined that body. I've examined every victim of the Jigsaw Killer.\" Played by: James Van Patten\n\nAppearances: Saw IV | Saw VI | Saw 3D James Van Patten A forensic pathologist who examines victims of the Jigsaw killings found by the police. The Coroner: He plays a far smaller role in comparison to other characters who fit this trope, and he was first introduced in IV, but he's the one who examined the cause of death of all the dead Jigsaw victims found by the police from the first movie to 3D.\n\nImpromptu Tracheotomy: How Hoffman kills him in 3D.\n\nPathologist\n\nPathologist Played by: David Boyce\n\nAppearances: Saw IV David Boyce A forensic pathologist seen in Saw IV, who assists Heffner in the autopsy of John's corpse. The Coroner: A pathologist in the deparment's forensic team.\n\nNo Name Given: His name is unknown.\n\nOne-Shot Character: He's only seen in the film's opening scene, with the role of calling Hoffman when Heffner tells him to.\n\nCoroner Worker\n\nCoroner Worker Played by: Carlos Diaz\n\nAppearances: Saw 3D Carlos Diaz A forensic officer seen in Saw 3D, charged with taking the dead corpses of presumed Jigsaw victims to the department's morgue. Impromptu Tracheotomy: How Hoffman kills him, shortly after doing the same to Heffner.\n\nNo Name Given: His name is unknown.\n\nChada\n\nChada Played by: Nazneen Contractor\n\nAppearances: Spiral Nazneen Contractor A forensic officer seen in Spiral. No Full Name Given: Only her surname is known.\n\nOne-Shot Character: She only shows up at the scene of Schenk's death to examine his corpse.\n\nTech team:\n\nVideo Techie"}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Franchise/Saw", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Franchise/Saw\n\nHello. I want to play a game.\n\nSaw is an American horror franchise — composed chiefly of a series of films — that originally started with the release of the first film of the same title, which was directed and written by Australian filmmakers James Wan and Leigh Whannell.\n\nIt centers around a Poetic Serial Killer dubbed \"The Jigsaw Killer\", or just \"Jigsaw\" (real name John Kramer, played by Tobin Bell), who places people in Death Traps and gives them a chance to escape before death claims them. Jigsaw designs each trap as a violent form of poetic justice by reflecting what Jigsaw sees as the vital flaw of its victim(s). To escape these traps — or \"games\", as Jigsaw calls them — the victims must typically harm either themselves or others in some horrific way to escape their impending (and horrific) death. The films' storylines center around the victims' efforts to escape their traps, the attempts by law enforcement to catch Jigsaw, Jigsaw's life, and his connection to the films' other characters.\n\nAfter the first movie originally premiered on January of its year at the Sundance Film Festival, Lionsgate theatrically released the first seven films in the franchise on the week prior to Halloween from 2004 to 2010. The seventh installment, titled Saw 3D, was renamed Saw: The Final Chapter for its home video release, as it was meant to be the Grand Finale of the series. According to Word of God, the series was supposed to end with an eighth film, but due to the poor box office performance of Saw VI, Executive Meddling worked the plots of the original Saw VII and Saw VIII into Saw 3D.\n\nIn October 2016, an eighth film under the working title Saw: Legacy was announced to be in production. The title was later changed to Jigsaw, and the film was released on October 27, 2017. A ninth film, Spiral, was announced in February 2020 and ultimately released in May 2021, promoting itself as \"from the Book of Saw\" and taking an anthology-esque approach in telling a story about a Jigsaw copycat. A tenth film, Saw X, was announced in April 2021 and is slated for release on October 27, 2023.\n\nThese films (especially the first) inspired many imitations, though some argue that Saw itself is a form of imitation of Se7en: both films focus on elaborate, grisly murders carried out by a man trying to send a message to society. Whereas Se7en portrays John Doe as vain and interested in showing the world a lesson through murder, Jigsaw focuses on a more \"individualized\" message with his \"games\". Hell, the concept of a moralistic serial killer playing God to a society he deems morally corrupt didn't even originate with Se7en — and according to Word of God, all of these ideas have always been carried out since the original 2003 short film that preceded the first movie.note Hilariously enough, though, the crew involved in Spiral did claim that they were aiming for a plot similar to Se7en for the movie.\n\nA comic book titled Saw: Rebirth was published alongside the release of Saw II in both physical and digital format. The comic revolved around Jigsaw's backstory and life before he began his crusade as a killer, though the events that happened in it were eventually retconned by Saw IV, which had a different version of his past as one of its main plot lines.\n\nThe series managed to spawn two video game adaptations. In addition, the multiplayer horror game Dead by Daylight released a DLC based on the series in 2018. It features David Tapp and Amanda Young as playable characters, and includes a map based on the various films' locations.\n\nIn 2009, a ride based on the films opened in Thorpe Park, aptly named Saw: The Ride. It's notable for being the world's first rollercoaster based on a horror movie franchise. Another ride of the \"escape room\" kind, named Saw: The Experience, opened in London in 2022.\n\nSaw media:\n\nopen/close all folders\n\nFeature Films\n\nShort Films\n\nSaw (2003)\n\nFull Disclosure Report (2004; DVD Bonus Material for Saw)\n\nBonus Material for Saw) The Scott Tibbs Documentary (2005; DVD bonus material for Saw II)\n\nComic Books\n\nSaw: Rebirth (2005)\n\nPodcasts\n\nSeeing Saw: The Official Spiral Podcast (2021)\n\nVideo Games\n\nRides\n\nSaw: The Ride (2009, Thorpe Park)\n\n''Saw: The Experience (2022)\n\nThe Saw franchise provides examples of:\n\nWARNING: These pages contain no small number of spoilers, but many of the trope examples in them will assume you have knowledge of the spoilers of the first four films — and as such, those spoilers will go untagged. Even then it's advised to have finished watching the series first. Read on or go back — make your choice."}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Characters/SawJohnKramer", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Characters/SawJohnKramer\n\nJohn Kramer\n\n\"I want to play a game.\"\n\n\"Yes, officer, I'm sick. Sick from the disease eating me away inside, sick of people who don’t appreciate their blessing, sick of those who scoff at the suffering of others. I'm sick of it all!\"\n\nJohn Kramer was a civil engineer who was driven to become the Jigsaw Killer after a series of tragic events and circumstances — his unborn son was killed when his wife, Jill, had a miscarriage; this caused John to drive her away, making her divorce him. John was later diagnosed with an inoperable tumor, which led to cancer. When his insurance company turned down an experimental treatment that could have potentially saved his life (or at least prolonged it), John attempted suicide. When he survived, his new outlook on life became his motivation to become the Jigsaw Killer.\n\nJigsaw kidnaps people that he believes aren't valuing their lives or are intentionally hurting others, then forces them to go through sadistic \"games\" where there are usually only two outcomes: live (and gain a new outlook on life) or die. John was eventually killed by Jeff Denlon, one of the last of his direct victims. Events ensuring his legacy would live on, however, were already in motion — Mark Hoffman, one of John's apprentices, continued Jigsaw's work after his death.\n\nopen/close all folders\n\nA-D\n\nE-J\n\nK-Z\n\n\"Game over.\""}, {"url": "https://www.techradar.com/how-to/how-to-watch-the-saw-movies-in-order", "page_content": "Eight films, 16 years, and countless torture traps later, Saw remains a beloved horror series. The story follows John Kramer, aka the Jigsaw killer, a man who captures people in order to rehabilitate those he deems unworthy.\n\nHe adopts violent means to impart this message, forcing innocents into horrific death traps from which they have to do grisly things in order to survive. Despite the fact that he dies midway through the franchise, for the remainder of the series his acolytes, family and victims adopt the Jigsaw mantle, continuing his reign of terror.\n\nThe franchise also continues with Spiral: From the Book of Saw , the latest installment currently in US theaters and rolling out worldwide. It enlists fresh franchise meat in the shape of Chris Rock, Max Minghella, Marisol Nichols, and Samuel L. Jackson, as cops track crimes that resemble the infamous Jigsaw killer.\n\nWith that in mind, you might be considering a rewatch of the Saw movies to refresh your memory. With Jigsaw’s twists and turns, and the not-inconsiderable retconning, it’s a good idea to get reacquainted. Here’s how you watch the Saw movies in order – both chronologically and by release date, as we explain the best way to enjoy the horror films in 2021.\n\nSaw movies in chronological order\n\nJigsaw\n\nSaw\n\nSaw II\n\nSaw III\n\nSaw IV\n\nSaw V\n\nSaw VI\n\nSaw 3D\n\nJigsaw\n\nSpiral: From the Book of Saw (2021)\n\nTo watch the Saw story in precise chronological order is like Jigsaw’s traps: difficult to figure out. It requires patience and an editing suite. Why? It's because each movie includes two story parts.\n\nOur chronological order follows the present day timeline. A strict chronology based solely on the backstory means you’d be stopping and starting different movies every five minutes, and rewatching the movies several times. Accurate? Yes. Fun? Not so much.\n\nBut fear not. Here’s the explanation of what’s happening in the present, and we’ve included descriptions of the flashbacks that fill in Kramer’s backstory to help you make sense of the Saw movies as you go. Expect big spoilers ahead for the movies.\n\n(Image credit: Lionsgate)\n\nPart of Jigsaw (2017)\n\nA portion of the story in Jigsaw takes place years before Saw. Five people wake up in a barn wearing Bucket Head Traps. This is the very first set ‘game’ by John (although not his first trap). One of the survivors of this game, Logan, goes on to become one of Kramer’s apprentices.\n\nSaw (2004)\n\nPresent day: Dr. Laurence Gordon (Cary Elwes) and Adam Stanheight (Leigh Whannell) both wake up chained up in an underground room. There’s a dead body in the room.\n\nFlashbacks: Detective Tapp hires photographer Adam Stanheight to spy on Dr. Gordon. Kramer learns of this. His apprentice Amanda Young (Shawnee Smith) kidnaps both of them. Kramer takes a cocktail of meds to slow his vitals, and lies in the underground room.\n\nSaw II (2005)\n\nPresent day: One year after the events of Saw, Detective Eric Matthews (Donnie Wahlberg) apprehends Kramer. But there’s another game underway with eight people including Matthews’ son Daniel and Kramer’s undercover apprentice, Amanda.\n\nFlashbacks: After his wife Jill leaves him, Kramer tries to commit suicide but fails. His rebirth inspires him to teach others the feeling of “instant rehabilitation” and so begins his work to help others.\n\nDr. Gordon diagnoses Kramer with an inoperable tumor.\n\nSaw III (2006) / Saw IV (2007)\n\nPresent day: In the franchise’s first big twist, it’s revealed that both films happen six months after the events of Saw II at the same time. They each follow games carried out by two of Kramer’s minions: Amanda Young and Detective Hoffman.\n\nFlashbacks: In Saw IV we learn the motivation for Kramer’s entire scheme when his wife Jill miscarries as a result of the actions of Cecil Adams. Kramer sets his first trap for Cecil, cutting out a piece of his skin shaped like a puzzle piece, leading to his nickname, the Jigsaw killer.\n\n(Image credit: Lionsgate)\n\nSaw V (2008)\n\nPresent day: With Kramer dead, a new murderer begins a series of traps that resemble Jigsaw’s old games. Jill receives instructions from her dead ex-husband.\n\nFlashbacks: The media frenzy surrounding Jigsaw leads to a copycat killer in the shape of Detective Hoffman. We learn it's Hoffman who created the trap for Seth Baxter at the start of Saw V to appear like a Jigsaw killing, as Baxter murdered his sister. Kramer finds out and enlists Hoffman to help his mission.\n\nSaw VI (2009)\n\nPresent day: A few days after the events of Saw V, Hoffman starts a new game that involves health insurance executive CEO William Easton. Easton dies. Under instruction from her husband, Jill puts Hoffman in a bear trap, which he survives.\n\nFlashbacks: Kramer asks Easton to fund an experimental therapy for his tumor that may save his life. Easton denies him coverage. We learn that Amanda was partially to blame for the miscarriage. Hoffman used this information to blackmail Amanda into carrying out her game in Saw III.\n\nSaw 3D / The Final Chapter (2010)\n\nPresent day: A few weeks after the events of Saw VI, Jill and Hoffman battle it out to take control of Jigsaw's legacy. The main game involves Bobby Dagen (Sean Patrick Flanery), a man who lied about surviving a Jigsaw trap to garner fame. Hoffman is killed by Dr. Gordon.\n\nFlashbacks: In a jump all the way back to Saw, we learn that shortly after he saws his foot off, Dr. Gordon cauterizes the wound and is enlisted by Kramer to be another apprentice.\n\nLatter part of Jigsaw (2017)\n\nPresent day: Surprise! The main story of the detectives trying to locate the Jigsaw killer takes place ten years after Saw III. It’s his apprentice, Logan, who survived the barn trap that’s actually carrying out the game.\n\nSpiral (2021)\n\nWithout spoiling the movie if you haven't seen it yet, Spiral takes place years after the previous Saw movies.\n\n(Image credit: Lionsgate)\n\nSaw movies in release order\n\nSaw (2004)\n\nSaw II (2005)\n\nSaw III (2006)\n\nSaw IV (2007)\n\nSaw V (2008)\n\nSaw VI (2009)\n\nSaw 3D/The Final Chapter (2010)\n\nJigsaw (2017)\n\nSpiral: From the Book of Saw (2021)\n\nWatching the Saw movies in chronological order is a good way to enjoy the series as a newbie. First-time watchers will get a good idea of what the franchise is about, without diving into the hows and whys. For those revisiting it a second time, it’ll serve as a handy refresher leading into Spiral.\n\nWhat began with the grimy, low-budget original expanded into a complex web of plot twists and turns that audiences never saw coming. Saw throws you in at the deep end – in the middle of a story that unravels over the next decade of storytelling. The 2004 opener kicked things off modestly with a $1.2 million budget. Relative newcomers Leigh Whannell and James Wan co-wrote the script, with Wan tackling director duties.\n\nThe Mobius strip of Jigsaw’s plots grows ever more complex the deeper you get into the franchise. Watching the Saw movies in release date order, you’re able to chart the series’ box office success, purely based on how elaborate (and costly) the traps become in the later sequels.\n\nAs you progress into the series, the retconning and interwoven backstories grow more complex, which is why it’s a good idea to watch once without worrying too much about it. After that, you should revisit our first list to really get to grips with the specifics.\n\nBest Saw movies\n\nThis all leads to one inevitable question: what are the best Saw movies? Everyone’s opinions differ on this topic, of course, with personal preferences being taken into account (we’re fond of the first three).\n\nHere, we’re letting the film community speak for themselves, by ranking the Saw movies via their IMDB user ratings. To be honest, the general consensus feels pretty accurate to us. It’s interesting to note that newest entry Spiral sits quite high on the list already, but that could all change once the movie is widely available.\n\nBest\n\nWorst"}, {"url": "https://news.yahoo.com/saw-movies-order-205300506.html", "page_content": "The one that kicked everything off! This movie, with a reported budget of $1,200,000, went on to gross over $103 million worldwide.\n\nThe plot is simple: Two strangers wake up chained in a windowless room. They don't know how they got there or why they are being held against their will. The only thing they do know is that a dead body lies between them and the corpse has a recorder. When both strangers find a tape in their pocket, they pop them into the recorder and soon learn they are victims in a serial killer's deadly game. The killer's name? Jigsaw.\n\nShop Now\n\nWatch Now for Free on Pluto TV\n\nWatch Now for Free on Tubi\n\n(Lionsgate)"}]}