{"Kenan Hasagić was born on 28 April 1988.": [{"url": "https://fbref.com/en/players/b0322004/Kenan-Hasagic", "page_content": "About FBref.com\n\nFBref.com launched (June 13, 2018) with domestic league coverage for England, France, Germany, Italy, Spain, and United States. Since then we have been steadily expanding our coverage to include domestic leagues from over 40 countries as well as domestic cup, super cup and youth leagues from top European countries. We have also added coverage for major international cups such as the UEFA Champions League and Copa Libertadores.\n\nFBref is the most complete sources for women's football data on the internet. This includes the entire history of the FIFA Women's World Cup as well as recent domestic league seasons from nine countries, including advanced stats like xG for most of those nine.\n\nIn collaboration with Opta, we are including advanced analytical data such as xG, xA, progressive passing, duels and more for over twenty competitions. For more information on the expected goals model and which competitions have advanced data, see our xG explainer.\n\nView Additional Information"}, {"url": "https://www.soccerway.com/players/kenan-hasagic/5043/", "page_content": "Matches of K. Hasagić\n\nCopyright ©2023 Perform Group. All rights reserved.\n\nData provided by Opta Sports. Articles provided by OMNISPORT."}, {"url": "https://dbpedia.org/page/Kenan_Hasagi%C4%87", "page_content": "Kenan Hasagić (* 1. Februar 1980 in Kakanj) ist ein bosnisch-herzegowinischer Fußballtorhüter. (de)\n\nKenan Hasagic (n. 1 de febrero de 1980 (42 años) Kakanj) es un futbolista bosnio que juega de portero. Su carrera futbolística comenzó en su ciudad natal con la local de la primera Liga de Bosnia y Herzegovina. A la edad de 16 años, hizo su debut en un partido de primera división. Fue el portero más prometedor en Bosnia-Herzegovina, que jugó para las selecciones júnior y luego fue transferido a Austria al Vorwärts Steyr. Después de eso, él era un miembro de la Altay SK en Turquía, pero en realidad nunca consiguió un equipo de fútbol de primera. Volvió a Bosnia y jugó para Bosna Visoko. En 2003, firmó un contrato con FK Željezničar Se ha encontrado una buena forma allí e incluso se convirtió en portero de primera elección para la Selección de fútbol de Bosnia y Herzegovina. En las temporadas 2004/2005, se trasladó a Turquía una vez más en que fichó para la Liga turca, en Gaziantepspor. Fichó por el Istanbul Buyuksehir Belediyespor. Hizo su debut con el equipo nacional el 12 de febrero de 2003, en un juego entre Gales y Bosnia-Herzegovina, que terminó en un empate 2-2. (es)\n\nKenan Hasagić (Bosnian pronunciation: [xâsaɡitɕ]; born 1 February 1980) is a Bosnian retired professional football goalkeeper and current goalkeeping coach of Bosnian Premier League club Željezničar. (en)\n\nKenan Hasagić, né le 1er février 1980 à Kakanj, est un footballeur bosnien évoluant au poste de gardien de but. Il est le gardien titulaire de l'équipe de Bosnie-Herzégovine de football de 2003 à 2011. (fr)\n\nKenan Hasagić (Kakanj, 1º febbraio 1980) è un ex calciatore bosniaco, di ruolo portiere, attuale preparatore dei portieri del Tuzla City. (it)\n\nKenan Hasagić (Kakanj, 1 februari 1980) is een Bosnisch voetballer. Hij speelt als doelman bij het Turkse Istanbul Büyükşehir Belediyespor. Hasagić staat al een aantal jaren op het hoogste niveau in Turkije onder de lat. In zijn geboorteland Bosnië en Herzegovina speelde hij voor FK Željezničar en FK Rudar Kakanj. Als doelman moet hij het hebben van zijn kwaliteiten in het strafschopgebied zoals het één op één gaan in lastige situaties. (nl)\n\nKenan Hasagić (ur. 1 lutego 1980 w Kakanju) – piłkarz bośniacki grający na pozycji bramkarza. Od 2007 roku jest piłkarzem klubu İstanbul Büyükşehir Belediyespor. (pl)\n\nКенан Хасагич (сербохорв. Kenan Hasagić / Кенан Хасагић; родился 1 февраля 1980, Какань) — боснийский футболист, вратарь, тренер. (ru)\n\nКенан Хасагич (босн. Kenan Hasagić, нар. 1 лютого 1980, Какань, СФРЮ) — боснійський футболіст, що грав на позиції воротаря. Виступав, зокрема, за клуби , «Ґазіантепспор» та «Істанбул ББ», а також національну збірну Боснії і Герцеговини. (uk)"}, {"url": "https://www.bornglorious.com/person/?pi=965786", "page_content": "Date of Birth: 01-Feb-1980\n\nPlace of Birth: Kakanj, Federation of Bosnia and Herzegovina, Bosnia and Herzegovina\n\nProfession: association football player\n\nNationality: Bosnia and Herzegovina\n\nZodiac Sign: Aquarius"}, {"url": "https://wiki.alquds.edu/?query=Kenan_Hasagi%C4%87", "page_content": "Kenan Hasagić ( Bosnian pronunciation: [xâsaɡitɕ]; born 1 February 1980) is a Bosnian retired professional football goalkeeper[1] and current goalkeeping coach of Bosnian Premier League club Željezničar.\n\nClub career [ edit ]\n\nHasagić's football career began in his hometown with Rudar Kakanj. At the age of 16, he made his debut in a first division match. He concedeed 5 goals. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr.\n\nAfter that, Hasagić was a member of Altay in Turkey but didn't see much first team football. He went back to Bosnia and played for Rudar Kakanj and Bosna Visoko. In 2003, he signed a contract with Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnia and Herzegovina national team.\n\nDuring the 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. In 2007, he moved over to another Turkish Süper Lig side in İstanbul Başakşehir. In 2012, Hasagić retired from football early after injuries shattered his career.\n\nInternational career [ edit ]\n\nHasagić made his debut for Bosnia and Herzegovina in a September 2002 European Championship qualification match against Romania and has earned a total of 44 caps, scoring no goals.[2] His final international was an October 2011 European Championship qualification match against France.[3]\n\nManagerial career [ edit ]\n\nIn August 2017, Hasagić became the new goalkeeping coach of Bosnian Premier League club Mladost Doboj Kakanj.[4] Two years later, on 2 November 2019, he announced that he left Mladost and that he will only be focusing on the Bosnia and Herzegovina national team.[5]\n\nOn 4 January 2018, after Robert Prosinečki was named the new head coach of the Bosnia and Herzegovina national team, it was announced that Hasagić became the new goalkeeping coach of the national team.[6] Hasagić left the national team in November 2019 with the sacking of Prosinečki.[7]\n\nIt was announced on 7 January 2020 that Hasagić took over the position of goalkeeping coach of another Bosnian Premier League club, Tuzla City, working alongside former national team teammate, good friend, and godfather Elvir Baljić, the club manager at the time.[8] He decided to leave the club in June 2021.[9]\n\nOn 9 July 2021, Hasagić became the new goalkeeping coach of his former club Željezničar.[10]\n\nPersonal life [ edit ]\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam. On 27 December 2009, Hasagić confirmed he divorced his wife Dijana after 9 years of marriage.\n\nAfter his divorce, he has been in a long term relationship with a model, Aminka Sivac. He is 15 years older than her.[11] On 8 July 2019, Hasagić married Sivac. Former national team teammate Elvir Baljić was the best man at his wedding.[12]\n\nCareer statistics [ edit ]\n\nInternational [ edit ]\n\nNational team Year Apps Goals Bosnia and Herzegovina 2002 1 0 2003 7 0 2004 2 0 2005 7 0 2006 6 0 2008 5 0 2009 3 0 2010 6 0 2011 7 0 Total 44 0\n\nHonours [ edit ]\n\nPlayer [ edit ]\n\nŽeljezničar[1]"}, {"url": "https://popularbio.com/kenan-hasagi/", "page_content": "Updated On April 30, 2023\n\nKenan Hasagić estimated Net Worth, Biography, Age, Height, Dating, Relationship Records, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Kenan Hasagić in 2019-2020? Scroll below and check more details information about Current Net worth as well as Monthly/Year Salary, Expense, Income Reports!\n\nBiography\n\nKenan Hasagić was born in Kakanj on February 1, 1980.\n\nOn Popular Bio, He is one of the successful Association Football Player. He has ranked on the list of those famous people who were born on February 1, 1980. He is one of the Richest Association Football Player who was born in Bosnia and Herzegovina. He also has a position among the list of Most popular Association Football Player. Kenan Hasagić is 1 of the famous people in our database with the age of 39 years old.\n\nShort Profile First Name Kenan Last Name Hasagić Profession Association Football Player Age 39 years old Birth Sign Aquarius Birth Date February 1, 1980 Birth Place Kakanj Country Bosnia and Herzegovina\n\nKenan Hasagić Net Worth\n\nKenan Hasagić estimated Net Worth, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Kenan Hasagić in 2019-2020?\n\nAccording to Wikipedia, Forbes, IMDb & Various Online resources, famous Association Football Player Kenan Hasagić’s net worth is $1-5 Million at the age of 39 years old. He earned the money being a professional Association Football Player. He is from Bosnia and Herzegovina.\n\nKenan Hasagić’s Net Worth:\n\n$1-5 Million\n\nEstimated Net Worth in 2020 Under Review Previous Year’s Net Worth (2019) Under Review Annual Salary Under Review. Income Source Primary Income source Association Football Player (profession). Net Worth Verification Status Not Verified\n\nAge, Height & Body Measurements\n\nKenan Hasagić current age 39 years old. Kenan Hasagić’s height Unknown & weight Not Available right. Full body measurements, dress & shoe size will be updated soon.\n\nWho is Kenan Hasagić Dating?\n\nKenan Hasagić keeps his personal and love life private. Check back often as we will continue to update this page with new relationship details. Let’s take a look at Kenan Hasagić past relationships, ex-girlfriends and previous hookups. Kenan Hasagić prefers not to tell the details of marital status & divorce.\n\nDating is to describe a stage in a person’s life when he or she is actively pursuing romantic relationships with different people. If two unmarried celebrities are seen in public together, they are often described as “dating” which means they were seen in public together, and it is not clear whether they are merely friends, exploring a more intimate relationship, or are romantically involved.\n\nFacts About Kenan Hasagić"}, {"url": "https://en-academic.com/dic.nsf/enwiki/1159695", "page_content": "Football player infobox\n\nplayername = Kenan Hasagić\n\n\n\n\n\nfullname = Kenan Hasagić\n\ndateofbirth = Birth date and age|1980|2|1|\n\ncityofbirth = Kakanj\n\ncountryofbirth = SFR Yugoslavia\n\nheight = height|m=1.86\n\ncurrentclub = Istanbul BB\n\nclubnumber = 1\n\nposition = Goalkeeper\n\nyouthyears = 1994-1998\n\nyouthclubs = FK Rudar Kakanj Mladost Mostar\n\nyears = 1998-1999 1999-2001 2001-2002 2001-2002 2002-2004 2004-2007 2007-\n\nclubs = SK Vorwärts Steyr Altay SK FK Rudar Kakanj FK Bosna FK Željezničar Gaziantepspor Istanbul BB\n\ncaps(goals) = 0 21 0 (0) 0 42 0 (0) 0 11 0 (0) 0 0 8 0 (0) 0 55 0 (0) 0 76 0 (0) 0 28 0 (0)\n\nnationalyears = 2003-\n\nnationalteam = Bosnia and Herzegovina\n\nnationalcaps(goals) = 0 25 0 (0)\n\nKenan Hasagić (born February 1 , 1980 in Kakanj ) is a Bosnian football goalkeeper .\n\nHis football career began in his hometown with the local FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia-Herzegovina, he played for junior selections and was later transferred to Austria n side Vorwärts Steyr. After that, he was a member of Altay SK in Turkey but never actually secured a first team football. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar . Although he spent only two seasons there, he will be remembered as the best goalkeeper in league, and one of the best in club's history. He has found a good form there and even became first choice goalkeeper for Bosnian national team. In 2004/2005 season, he moved to Turkey once again where he signed for Turkish League side Gaziantepspor . He sign for İstanbul Büyükşehir Belediyespor .\n\nHe made his debut for national team on February 12 , 2003 . in a game between Wales and Bosnia-Herzegovina which ended in a 2-2 draw. He is very good in one-on-ones and in the air. He mainly has sharp reflexes, but can sometimes \"fall asleep\" and concede long range shots.\n\nCareer\n\n* FK Rudar Kakanj\n\n* SK Vorwärts Steyr\n\n* Altay SK\n\n* NK Bosna Visoko\n\n* FK Željezničar\n\n* Gaziantepspor\n\n* İstanbul Büyükşehir Belediyespor\n\nExternal links"}, {"url": "https://prabook.com/web/kenan.hasagic/2130128", "page_content": "Kenan Hasagic\n\nassociation football player\n\nFebruary 1, 1980 Kakanj, Kakanj Municipality, Bosnia and Herzegovina\n\nHis football career began in his hometown with FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnian national team In 2004-2005 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. He made his debut for national team on 12 February 2003 in a game between Wales and Bosnia and Herzegovina which ended in a 2–2 draw."}, {"url": "https://www.celebrity-birthday.uk/bio/Kenan-Hasagi%C4%87", "page_content": "All Genders ♀️ Female ♂️ Male Transgender\n\nAll Genres Performers Musicians Artists Sports Footballers Writers Scholars Business Politicians Hoi Polloi\n\nAll Countries 🇬🇧 United Kingdom 🇺🇸 United States 🇦🇫 Afghanistan 🇦🇱 Albania 🇩🇿 Algeria 🇦🇸 American Samoa 🇦🇩 Andorra 🇦🇴 Angola 🇦🇮 Anguilla 🇦🇬 Antigua and Barbuda 🇦🇷 Argentina 🇦🇲 Armenia 🇦🇼 Aruba 🇦🇺 Australia 🇦🇹 Austria 🇦🇿 Azerbaijan 🇧🇸 Bahamas 🇧🇭 Bahrain 🇧🇩 Bangladesh 🇧🇧 Barbados 🇧🇾 Belarus 🇧🇪 Belgium 🇧🇿 Belize 🇧🇯 Benin 🇧🇲 Bermuda 🇧🇹 Bhutan 🇧🇴 Bolivia 🇧🇦 Bosnia and Herzegovina 🇧🇼 Botswana 🇧🇷 Brazil 🇻🇬 British Virgin Islands 🇧🇳 Brunei Darussalam 🇧🇬 Bulgaria 🇧🇫 Burkina Faso 🇧🇮 Burundi 🇰🇭 Cambodia 🇨🇲 Cameroon 🇨🇦 Canada 🇨🇻 Cape Verde 🇰🇾 Cayman Islands 🇨🇫 Central African Republic 🇹🇩 Chad 🇨🇱 Chile 🇨🇳 China 🇨🇴 Colombia 🇰🇲 Comoros 🇨🇰 Cook Islands 🇨🇷 Costa Rica 🇨🇮 Côte d'Ivoire 🇭🇷 Croatia 🇨🇺 Cuba 🇨🇾 Cyprus 🇨🇿 Czech Republic 🇩🇰 Denmark 🇩🇯 Djibouti 🇩🇲 Dominica 🇩🇴 Dominican Republic 🇪🇨 Ecuador 🇪🇬 Egypt 🇸🇻 El Salvador 🇬🇶 Equatorial Guinea 🇪🇷 Eritrea 🇪🇪 Estonia 🇪🇹 Ethiopia 🇫🇴 Faroe Islands 🇫🇯 Fiji 🇫🇮 Finland 🇫🇷 France 🇬🇫 French Guiana 🇵🇫 French Polynesia 🇬🇦 Gabon 🇬🇲 Gambia 🇬🇪 Georgia 🇩🇪 Germany 🇬🇭 Ghana 🇬🇮 Gibraltar 🇬🇷 Greece 🇬🇱 Greenland 🇬🇩 Grenada 🇬🇵 Guadeloupe 🇬🇺 Guam 🇬🇹 Guatemala 🇬🇬 Guernsey 🇬🇳 Guinea 🇬🇼 Guinea-Bissau 🇬🇾 Guyana 🇭🇹 Haiti 🇭🇳 Honduras 🇭🇰 Hong Kong 🇭🇺 Hungary 🇮🇸 Iceland 🇮🇳 India 🇮🇩 Indonesia 🇮🇷 Iran 🇮🇶 Iraq 🇮🇪 Ireland 🇮🇲 Isle of Man 🇮🇱 Israel 🇮🇹 Italy 🇯🇲 Jamaica 🇯🇵 Japan 🇯🇪 Jersey 🇯🇴 Jordan 🇰🇿 Kazakhstan 🇰🇪 Kenya 🇰🇮 Kiribati 🇰🇵 Korea (North) 🇰🇷 Korea (South) 🇰🇼 Kuwait 🇰🇬 Kyrgyzstan 🇱🇦 Lao PDR 🇱🇻 Latvia 🇱🇧 Lebanon 🇱🇸 Lesotho 🇱🇷 Liberia 🇱🇾 Libya 🇱🇮 Liechtenstein 🇱🇹 Lithuania 🇱🇺 Luxembourg 🇲🇰 Macedonia 🇲🇬 Madagascar 🇲🇼 Malawi 🇲🇾 Malaysia 🇲🇻 Maldives 🇲🇱 Mali 🇲🇹 Malta 🇲🇭 Marshall Islands 🇲🇶 Martinique 🇲🇷 Mauritania 🇲🇺 Mauritius 🇲🇽 Mexico 🇲🇩 Moldova 🇲🇨 Monaco 🇲🇳 Mongolia 🇲🇪 Montenegro 🇲🇸 Montserrat 🇲🇦 Morocco 🇲🇿 Mozambique 🇲🇲 Myanmar 🇳🇦 Namibia 🇳🇷 Nauru 🇳🇵 Nepal 🇳🇱 Netherlands 🇦🇳 Netherlands Antilles 🇳🇨 New Caledonia 🇳🇿 New Zealand 🇳🇮 Nicaragua 🇳🇪 Niger 🇳🇬 Nigeria 🇲🇵 Northern Mariana Islands 🇳🇴 Norway 🇴🇲 Oman 🇵🇰 Pakistan 🇵🇼 Palau 🇵🇸 Palestinian Territory 🇵🇦 Panama 🇵🇬 Papua New Guinea 🇵🇾 Paraguay 🇵🇪 Peru 🇵🇭 Philippines 🇵🇱 Poland 🇵🇹 Portugal 🇵🇷 Puerto Rico 🇶🇦 Qatar 🇷🇪 Réunion 🇷🇴 Romania 🇷🇺 Russian Federation 🇷🇼 Rwanda 🇰🇳 Saint Kitts and Nevis 🇱🇨 Saint Lucia 🇼🇸 Samoa 🇸🇲 San Marino 🇸🇦 Saudi Arabia 🇸🇳 Senegal 🇷🇸 Serbia 🇸🇨 Seychelles 🇸🇱 Sierra Leone 🇸🇬 Singapore 🇸🇰 Slovakia 🇸🇮 Slovenia 🇸🇧 Solomon Islands 🇸🇴 Somalia 🇿🇦 South Africa 🇬🇸 South Georgia 🇸🇸 South Sudan 🇪🇸 Spain 🇱🇰 Sri Lanka 🇵🇲 St Pierre and Miquelon 🇸🇩 Sudan 🇸🇷 Suriname 🇸🇿 Swaziland 🇸🇪 Sweden 🇨🇭 Switzerland 🇸🇾 Syria 🇹🇼 Taiwan 🇹🇯 Tajikistan 🇹🇿 Tanzania 🇹🇭 Thailand 🇹🇬 Togo 🇹🇴 Tonga 🇹🇹 Trinidad and Tobago 🇹🇳 Tunisia 🇹🇷 Turkey 🇹🇲 Turkmenistan 🇹🇨 Turks and Caicos Islands 🇹🇻 Tuvalu 🇺🇬 Uganda 🇺🇦 Ukraine 🇦🇪 United Arab Emirates 🇬🇧 United Kingdom 🇺🇸 United States of America 🇺🇾 Uruguay 🇺🇿 Uzbekistan 🇻🇪 Venezuela 🇻🇳 Vietnam 🇪🇭 Western Sahara 🏳️ World 🇾🇪 Yemen 🇿🇲 Zambia 🇿🇼 Zimbabwe\n\nAll Signs Aries Taurus Gemini Cancer Leo Virgo Libra Scorpio Sagittarius Capricorn Aquarius Pisces\n\nAll Animals Rat Ox Tiger Dragon Snake Horse Goat Monkey Rooster Dog Pig\n\nReset"}], "Kenan Hasagić is a professional footballer.": [{"url": "https://fbref.com/en/players/b0322004/Kenan-Hasagic", "page_content": "About FBref.com\n\nFBref.com launched (June 13, 2018) with domestic league coverage for England, France, Germany, Italy, Spain, and United States. Since then we have been steadily expanding our coverage to include domestic leagues from over 40 countries as well as domestic cup, super cup and youth leagues from top European countries. We have also added coverage for major international cups such as the UEFA Champions League and Copa Libertadores.\n\nFBref is the most complete sources for women's football data on the internet. This includes the entire history of the FIFA Women's World Cup as well as recent domestic league seasons from nine countries, including advanced stats like xG for most of those nine.\n\nIn collaboration with Opta, we are including advanced analytical data such as xG, xA, progressive passing, duels and more for over twenty competitions. For more information on the expected goals model and which competitions have advanced data, see our xG explainer.\n\nView Additional Information"}, {"url": "https://dbpedia.org/page/Kenan_Hasagi%C4%87", "page_content": "Kenan Hasagić (* 1. Februar 1980 in Kakanj) ist ein bosnisch-herzegowinischer Fußballtorhüter. (de)\n\nKenan Hasagic (n. 1 de febrero de 1980 (42 años) Kakanj) es un futbolista bosnio que juega de portero. Su carrera futbolística comenzó en su ciudad natal con la local de la primera Liga de Bosnia y Herzegovina. A la edad de 16 años, hizo su debut en un partido de primera división. Fue el portero más prometedor en Bosnia-Herzegovina, que jugó para las selecciones júnior y luego fue transferido a Austria al Vorwärts Steyr. Después de eso, él era un miembro de la Altay SK en Turquía, pero en realidad nunca consiguió un equipo de fútbol de primera. Volvió a Bosnia y jugó para Bosna Visoko. En 2003, firmó un contrato con FK Željezničar Se ha encontrado una buena forma allí e incluso se convirtió en portero de primera elección para la Selección de fútbol de Bosnia y Herzegovina. En las temporadas 2004/2005, se trasladó a Turquía una vez más en que fichó para la Liga turca, en Gaziantepspor. Fichó por el Istanbul Buyuksehir Belediyespor. Hizo su debut con el equipo nacional el 12 de febrero de 2003, en un juego entre Gales y Bosnia-Herzegovina, que terminó en un empate 2-2. (es)\n\nKenan Hasagić (Bosnian pronunciation: [xâsaɡitɕ]; born 1 February 1980) is a Bosnian retired professional football goalkeeper and current goalkeeping coach of Bosnian Premier League club Željezničar. (en)\n\nKenan Hasagić, né le 1er février 1980 à Kakanj, est un footballeur bosnien évoluant au poste de gardien de but. Il est le gardien titulaire de l'équipe de Bosnie-Herzégovine de football de 2003 à 2011. (fr)\n\nKenan Hasagić (Kakanj, 1º febbraio 1980) è un ex calciatore bosniaco, di ruolo portiere, attuale preparatore dei portieri del Tuzla City. (it)\n\nKenan Hasagić (Kakanj, 1 februari 1980) is een Bosnisch voetballer. Hij speelt als doelman bij het Turkse Istanbul Büyükşehir Belediyespor. Hasagić staat al een aantal jaren op het hoogste niveau in Turkije onder de lat. In zijn geboorteland Bosnië en Herzegovina speelde hij voor FK Željezničar en FK Rudar Kakanj. Als doelman moet hij het hebben van zijn kwaliteiten in het strafschopgebied zoals het één op één gaan in lastige situaties. (nl)\n\nKenan Hasagić (ur. 1 lutego 1980 w Kakanju) – piłkarz bośniacki grający na pozycji bramkarza. Od 2007 roku jest piłkarzem klubu İstanbul Büyükşehir Belediyespor. (pl)\n\nКенан Хасагич (сербохорв. Kenan Hasagić / Кенан Хасагић; родился 1 февраля 1980, Какань) — боснийский футболист, вратарь, тренер. (ru)\n\nКенан Хасагич (босн. Kenan Hasagić, нар. 1 лютого 1980, Какань, СФРЮ) — боснійський футболіст, що грав на позиції воротаря. Виступав, зокрема, за клуби , «Ґазіантепспор» та «Істанбул ББ», а також національну збірну Боснії і Герцеговини. (uk)"}, {"url": "https://peoplepill.com/people/kenan-hasagic/", "page_content": "Kenan Hasagić (born 1 February 1980) is a Bosnian football goalkeeper who plays for Balıkesirspor.\n\nHis football career began in his hometown with FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr. After that, he was a member of Altay SK in Turkey but didn't see much first team football. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnian national team. In 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor.\n\nHe made his debut for national team on 12 February 2003 in a game between Wales and Bosnia and Herzegovina which ended in a 2–2 draw.\n\nPersonal life\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam.\n\nOn 27 December 2009, Hasagić confirmed he divorced his wife after 9 years of marriage."}, {"url": "https://www.soccerway.com/players/kenan-hasagic/5043/", "page_content": "Matches of K. Hasagić\n\nCopyright ©2023 Perform Group. All rights reserved.\n\nData provided by Opta Sports. Articles provided by OMNISPORT."}, {"url": "https://prabook.com/web/kenan.hasagic/2130128", "page_content": "Kenan Hasagic\n\nassociation football player\n\nFebruary 1, 1980 Kakanj, Kakanj Municipality, Bosnia and Herzegovina\n\nHis football career began in his hometown with FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnian national team In 2004-2005 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. He made his debut for national team on 12 February 2003 in a game between Wales and Bosnia and Herzegovina which ended in a 2–2 draw."}, {"url": "https://everything.explained.today/%5C/Kenan_Hasagi%C4%87/", "page_content": "Kenan Hasagić Explained\n\nKenan Hasagić (pronounced as /xâsaɡitɕ/; born 1 February 1980) is a Bosnian retired professional football goalkeeper[1] and current goalkeeping coach of Bosnian Premier League club Željezničar.\n\nClub career\n\nHasagić's football career began in his hometown with Rudar Kakanj. At the age of 16, he made his debut in a first division match. He concedeed 5 goals. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr.\n\nAfter that, Hasagić was a member of Altay in Turkey but didn't see much first team football. He went back to Bosnia and played for Rudar Kakanj and Bosna Visoko. In 2003, he signed a contract with Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnia and Herzegovina national team.\n\nDuring the 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. In 2007, he moved over to another Turkish Süper Lig side in İstanbul Başakşehir. In 2012, Hasagić retired from football early after injuries shattered his career.\n\nInternational career\n\nHasagić made his debut for Bosnia and Herzegovina in a September 2002 European Championship qualification match against Romania and has earned a total of 44 caps, scoring no goals.[2] His final international was an October 2011 European Championship qualification match against France.[3]\n\nManagerial career\n\nIn August 2017, Hasagić became the new goalkeeping coach of Bosnian Premier League club Mladost Doboj Kakanj.[4] Two years later, on 2 November 2019, he announced that he left Mladost and that he will only be focusing on the Bosnia and Herzegovina national team.[5]\n\nOn 4 January 2018, after Robert Prosinečki was named the new head coach of the Bosnia and Herzegovina national team, it was announced that Hasagić became the new goalkeeping coach of the national team.[6] Hasagić left the national team in November 2019 with the sacking of Prosinečki.[7]\n\nIt was announced on 7 January 2020 that Hasagić took over the position of goalkeeping coach of another Bosnian Premier League club, Tuzla City, working alongside former national team teammate, good friend, and godfather Elvir Baljić, the club manager at the time.[8] He decided to leave the club in June 2021.[9]\n\nOn 9 July 2021, Hasagić became the new goalkeeping coach of his former club Željezničar.[10]\n\nPersonal life\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam. On 27 December 2009, Hasagić confirmed he divorced his wife Dijana after 9 years of marriage.\n\nAfter his divorce, he has been in a long term relationship with a model, Aminka Sivac. He is 15 years older than her.[11] On 8 July 2019, Hasagić married Sivac. Former national team teammate Elvir Baljić was the best man at his wedding.[12]\n\nCareer statistics\n\nInternational\n\nNational team Year Apps Goals Bosnia and Herzegovina 2002 1 0 2003 7 0 2004 2 0 2005 7 0 2006 6 0 2008 5 0 2009 3 0 2010 6 0 2011 7 0 Total 44 0\n\nHonours\n\nPlayer\n\nŽeljezničar[1]\n\n2002–03\n\nExternal links\n\nKenan Hasagić at TFF.org\n\n\n\nNotes and References"}, {"url": "https://www.bornglorious.com/person/?pi=965786", "page_content": "Date of Birth: 01-Feb-1980\n\nPlace of Birth: Kakanj, Federation of Bosnia and Herzegovina, Bosnia and Herzegovina\n\nProfession: association football player\n\nNationality: Bosnia and Herzegovina\n\nZodiac Sign: Aquarius"}, {"url": "https://www.football-lineups.com/footballer/15461/", "page_content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n--- Today Top Games --- América-MG - Atlético Paranaense Boyacá Chicó FC - Millonarios Flamengo - Grêmio Porto Alegre Goiás - Fluminense IK Sirius - IFK Göteborg Internacional - Vasco da Gama Nacional - Deportivo Maldonado Ponte Preta - Sport Recife Portland Timbers - FC Dallas São Paulo - Palmeiras St. Louis City SC - LA Galaxy Twente Enschede - Sparta Rotterdam --- Tomorrow Top Games --- Banfield - River Plate Independiente Medellin - América de Cali Instituto - Racing Club Newells Old Boys - Union Santa Fe San Lorenzo - Central Cordoba Sgo del Estero Velez Sarsfield - Argentinos Juniors\n\n--- Recent games --- Argentina - Primera División Brazil - Brasileirão Brazil - Brasileiro Série B Bulgaria - Parva Liga Canada - Canadian Championship Denmark - Danish Superliga Egypt - Egyptian Premier League Italy - Serie B Playoffs Italy - Serie C Japan - J-League Japan - WE League Netherlands - Dutch Playoffs Conference League Peru - Liga Femenina FPF Spain - Segunda División Playoffs Sweden - Allsvenskan Sweden - Damallsvenskan Turkey - Turkish Super Lig USA - Major League Soccer USA - National Womens Soccer League USA - U.S. Open Cup ------ - Champions League ------ - Copa Libertadores ------ - Copa Sudamericana ------ - Europa Conference League ------ - Friendlies ------ - Toulon ------ - World Cup U-20 select match 09-Jun --- Barracas 0:0 R.Central 09-Jun --- Indepte 2:0 Sarmiento select match 10-Jun --- Coritiba 0:0 Santos select match 07-Jun --- Novorizon 1:0 Guarani 07-Jun --- Sport 2:1 Avaí 07-Jun --- Sampaio 2:0 Londrina select match 07-Jun --- CSKA 48 0:0 L.Plovdiv 07-Jun --- Levski 0:2 CSKA Sofia 07-Jun --- Chrn More 0:1 Ludogrets select match 07-Jun --- Whitecaps 2:1 Montréal select match 09-Jun --- Viborg 0:1 Midtjyl. select match 07-Jun --- ElMehalla 1:1 Al Masry 07-Jun --- Smouha 2:2 Cleopatra 08-Jun --- Ismaily 0:1 El Geish 08-Jun --- Aswan 1:1 Arab Cont select match 08-Jun --- Cagliari 1:1 Bari select match 08-Jun --- Pescara 2:2 Foggia 08-Jun --- Cesena 0:1 Lecco select match 10-Jun --- YokohamaM 4:3 Kashiwa 10-Jun --- C Osaka 2:1 Kobe 10-Jun --- Tosu 1:1 Sapporo 11-Jun --- Niigata 1:3 Kyoto 11-Jun --- Nagoya 2:1 Fukuoka 11-Jun --- Kashima 1:0 Shonan 11-Jun --- G Osaka 3:1 FC Tokyo 11-Jun --- YokohamaC 0:0 Urawa 11-Jun --- Kawasaki 1:0 Hiroshima select match 10-Jun --- Omiya V 1:1 Sendai L 10-Jun --- Saitama 0:5 Urawa L 10-Jun --- Stella 0:2 Hiroshima 10-Jun --- Niigata 2:3 Nittele 10-Jun --- Nagano L 2:2 INAC Kobe select match 08-Jun --- Sparta 1:1 Twente select match 09-Jun --- Universit 10:0 USMP select match 07-Jun --- Levante 3:0 Albacete 08-Jun --- Alaves 2:0 Eibar select match 09-Jun --- Hammarby 2:1 Brommap. 10-Jun --- Kalmar 2:1 Degerfors 10-Jun --- Värnamo 1:3 Malmö 10-Jun --- Varbergs 1:2 Halmstad select match 09-Jun --- Uppsala 0:0 Rosengård 09-Jun --- Linköping 2:1 Vittsjö 09-Jun --- Kalmar 0:1 Djurgård. select match 07-Jun --- Hatayspor 0:3 Gsaray 07-Jun --- Fenerbhce 3:0 Gaziantep 07-Jun --- Giresun 2:0 Antalya 07-Jun --- Istanbuls 4:0 Ümraniye 07-Jun --- Ankrgcu 1:2 Adana Dem 07-Jun --- Beşiktaş 3:3 Konya select match 07-Jun --- FC Dallas 2:0 STL City 07-Jun --- LAFC 0:0 Atlanta select match 09-Jun --- Racing Lou 0:0 SD Wave select match 07-Jun --- Legion 0:1 Int Miami 07-Jun --- Salt Lake 3:2 LA Galaxy select match 10-Jun --- Man.City 1:0 Inter select match 07-Jun --- IDV 3:0 Cor hians 07-Jun --- Nacional 1:1 Inter 07-Jun --- Arg.Jrs 2:1 Liverpool 07-Jun --- Palmeiras 4:2 Barcelona 07-Jun --- River 2:0 Fluminense 07-Jun --- Aucas 0:0 Ñublense 07-Jun --- Strongest 1:2 S Cristal 08-Jun --- Metro 0:1 DIM 08-Jun --- Flamengo 2:1 Racing 08-Jun --- Olimpia 3:0 ANacional select match 07-Jun --- Estud. LP 1:1 RB Braga 07-Jun --- Blooming 1:2 Audax 07-Jun --- Emelec 1:1 Guaraní 08-Jun --- Danubio 1:0 Huracan 08-Jun --- Oriente P 1:3 Tacuary 08-Jun --- São Paulo 5:0 Tolima 08-Jun --- Goiás 0:0 Gsia. LP 08-Jun --- S.Lorenzo 0:0 Palestino 08-Jun --- C Vallejo 3:2 Magallane 08-Jun --- Santa Fe 2:0 Universit select match 07-Jun --- Fiorentina 1:2 West.Ham select match 07-Jun --- Mexico 2:0 Guatemala select match 07-Jun --- Japan 2:1 Morocco 07-Jun --- I. Coast 1:1 Panama 08-Jun --- Saudi Arb 0:0 Venezuela 08-Jun --- France 3:1 Costa Rica 09-Jun --- Australia 3:2 Med.Team 09-Jun --- Mexico 4:0 Qatar 10-Jun --- Japan 0:2 Panama 10-Jun --- I. Coast 0:1 Morocco select match 08-Jun --- Uruguay 1:0 Israel 08-Jun --- Italy 2:1 S. Korea\n\n\n\nSHARE THIS\n\n\n\n\n\n"}, {"url": "https://prabook.com/web/kenan.hasagic/2130128", "page_content": "Kenan Hasagic\n\nassociation football player\n\nFebruary 1, 1980 Kakanj, Kakanj Municipality, Bosnia and Herzegovina\n\nHis football career began in his hometown with FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnian national team In 2004-2005 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. He made his debut for national team on 12 February 2003 in a game between Wales and Bosnia and Herzegovina which ended in a 2–2 draw."}, {"url": "https://sofifa.com/player/140892/kenan-hasagic/080002/", "page_content": "All product names, logos, and brands are the property of their respective owners.\n\nAll company, product, and service names used in this website are for identification purposes only.\n\nTerms Privacy FAQ"}], "Kenan Hasagić plays as a midfielder.": [{"url": "https://fbref.com/en/players/b0322004/Kenan-Hasagic", "page_content": "About FBref.com\n\nFBref.com launched (June 13, 2018) with domestic league coverage for England, France, Germany, Italy, Spain, and United States. Since then we have been steadily expanding our coverage to include domestic leagues from over 40 countries as well as domestic cup, super cup and youth leagues from top European countries. We have also added coverage for major international cups such as the UEFA Champions League and Copa Libertadores.\n\nFBref is the most complete sources for women's football data on the internet. This includes the entire history of the FIFA Women's World Cup as well as recent domestic league seasons from nine countries, including advanced stats like xG for most of those nine.\n\nIn collaboration with Opta, we are including advanced analytical data such as xG, xA, progressive passing, duels and more for over twenty competitions. For more information on the expected goals model and which competitions have advanced data, see our xG explainer.\n\nView Additional Information"}, {"url": "https://peoplepill.com/people/kenan-hasagic/", "page_content": "Kenan Hasagić (born 1 February 1980) is a Bosnian football goalkeeper who plays for Balıkesirspor.\n\nHis football career began in his hometown with FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr. After that, he was a member of Altay SK in Turkey but didn't see much first team football. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnian national team. In 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor.\n\nHe made his debut for national team on 12 February 2003 in a game between Wales and Bosnia and Herzegovina which ended in a 2–2 draw.\n\nPersonal life\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam.\n\nOn 27 December 2009, Hasagić confirmed he divorced his wife after 9 years of marriage."}, {"url": "https://sofifa.com/player/140892/kenan-hasagic/070001/", "page_content": "All product names, logos, and brands are the property of their respective owners.\n\nAll company, product, and service names used in this website are for identification purposes only.\n\nTerms Privacy FAQ"}, {"url": "https://sofifa.com/player/140892/kenan-hasagic/070002/", "page_content": "All product names, logos, and brands are the property of their respective owners.\n\nAll company, product, and service names used in this website are for identification purposes only.\n\nTerms Privacy FAQ"}, {"url": "https://sofifa.com/player/140892/kenan-hasagic/080001/", "page_content": "All product names, logos, and brands are the property of their respective owners.\n\nAll company, product, and service names used in this website are for identification purposes only.\n\nTerms Privacy FAQ"}, {"url": "https://sofifa.com/player/140892/kenan-hasagic/150001/", "page_content": "All product names, logos, and brands are the property of their respective owners.\n\nAll company, product, and service names used in this website are for identification purposes only.\n\nTerms Privacy FAQ"}, {"url": "https://dbpedia.org/page/Kenan_Hasagi%C4%87", "page_content": "Kenan Hasagić (* 1. Februar 1980 in Kakanj) ist ein bosnisch-herzegowinischer Fußballtorhüter. (de)\n\nKenan Hasagic (n. 1 de febrero de 1980 (42 años) Kakanj) es un futbolista bosnio que juega de portero. Su carrera futbolística comenzó en su ciudad natal con la local de la primera Liga de Bosnia y Herzegovina. A la edad de 16 años, hizo su debut en un partido de primera división. Fue el portero más prometedor en Bosnia-Herzegovina, que jugó para las selecciones júnior y luego fue transferido a Austria al Vorwärts Steyr. Después de eso, él era un miembro de la Altay SK en Turquía, pero en realidad nunca consiguió un equipo de fútbol de primera. Volvió a Bosnia y jugó para Bosna Visoko. En 2003, firmó un contrato con FK Željezničar Se ha encontrado una buena forma allí e incluso se convirtió en portero de primera elección para la Selección de fútbol de Bosnia y Herzegovina. En las temporadas 2004/2005, se trasladó a Turquía una vez más en que fichó para la Liga turca, en Gaziantepspor. Fichó por el Istanbul Buyuksehir Belediyespor. Hizo su debut con el equipo nacional el 12 de febrero de 2003, en un juego entre Gales y Bosnia-Herzegovina, que terminó en un empate 2-2. (es)\n\nKenan Hasagić (Bosnian pronunciation: [xâsaɡitɕ]; born 1 February 1980) is a Bosnian retired professional football goalkeeper and current goalkeeping coach of Bosnian Premier League club Željezničar. (en)\n\nKenan Hasagić, né le 1er février 1980 à Kakanj, est un footballeur bosnien évoluant au poste de gardien de but. Il est le gardien titulaire de l'équipe de Bosnie-Herzégovine de football de 2003 à 2011. (fr)\n\nKenan Hasagić (Kakanj, 1º febbraio 1980) è un ex calciatore bosniaco, di ruolo portiere, attuale preparatore dei portieri del Tuzla City. (it)\n\nKenan Hasagić (Kakanj, 1 februari 1980) is een Bosnisch voetballer. Hij speelt als doelman bij het Turkse Istanbul Büyükşehir Belediyespor. Hasagić staat al een aantal jaren op het hoogste niveau in Turkije onder de lat. In zijn geboorteland Bosnië en Herzegovina speelde hij voor FK Željezničar en FK Rudar Kakanj. Als doelman moet hij het hebben van zijn kwaliteiten in het strafschopgebied zoals het één op één gaan in lastige situaties. (nl)\n\nKenan Hasagić (ur. 1 lutego 1980 w Kakanju) – piłkarz bośniacki grający na pozycji bramkarza. Od 2007 roku jest piłkarzem klubu İstanbul Büyükşehir Belediyespor. (pl)\n\nКенан Хасагич (сербохорв. Kenan Hasagić / Кенан Хасагић; родился 1 февраля 1980, Какань) — боснийский футболист, вратарь, тренер. (ru)\n\nКенан Хасагич (босн. Kenan Hasagić, нар. 1 лютого 1980, Какань, СФРЮ) — боснійський футболіст, що грав на позиції воротаря. Виступав, зокрема, за клуби , «Ґазіантепспор» та «Істанбул ББ», а також національну збірну Боснії і Герцеговини. (uk)"}, {"url": "https://fbref.com/en/players/b0322004/Kenan-Hasagic", "page_content": "About FBref.com\n\nFBref.com launched (June 13, 2018) with domestic league coverage for England, France, Germany, Italy, Spain, and United States. Since then we have been steadily expanding our coverage to include domestic leagues from over 40 countries as well as domestic cup, super cup and youth leagues from top European countries. We have also added coverage for major international cups such as the UEFA Champions League and Copa Libertadores.\n\nFBref is the most complete sources for women's football data on the internet. This includes the entire history of the FIFA Women's World Cup as well as recent domestic league seasons from nine countries, including advanced stats like xG for most of those nine.\n\nIn collaboration with Opta, we are including advanced analytical data such as xG, xA, progressive passing, duels and more for over twenty competitions. For more information on the expected goals model and which competitions have advanced data, see our xG explainer.\n\nView Additional Information"}, {"url": "https://prabook.com/web/kenan.hasagic/2130128", "page_content": "Kenan Hasagic\n\nassociation football player\n\nFebruary 1, 1980 Kakanj, Kakanj Municipality, Bosnia and Herzegovina\n\nHis football career began in his hometown with FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnian national team In 2004-2005 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. He made his debut for national team on 12 February 2003 in a game between Wales and Bosnia and Herzegovina which ended in a 2–2 draw."}, {"url": "https://sofifa.com/player/140892/kenan-hasagic/110002/", "page_content": "All product names, logos, and brands are the property of their respective owners.\n\nAll company, product, and service names used in this website are for identification purposes only.\n\nTerms Privacy FAQ"}], "Kenan Hasagić plays for Željezničar.": [{"url": "https://korner.ba/kenan-hasagic-biografija/", "page_content": "Kenan Hasagić biografija golmana koji je OSAM GODINA branio mrežu Reprezentacije BiH i istovremeno čuvao Željezničar.\n\nRođen je 1. februara 1980. godine u Kaknju. Priključuje se omladinskom sistemu Rudara, te sa 16. godina ostvaruje svoj prvi profesionalni nastup za seniorski tim. Jedna sezona u kojoj se ostvario 14 nastupa bila je dovoljna da mu austrijski Vorwärts Steyr da šansu.\n\nOdlazak iz Kaknja ogromna pogreška?\n\nOdlazak u Vorwärts za Hasagića nije bio uspješan. Dobio je ugovor na jednu godinu te iako je upisao 21 nastup nije uspio uvjeriti klub da mu produže ugovor.\n\nNakon Austrije Hasagić odlazi u Tursku kako bi igrao za Altay. Uspio je uvezati 42 nastupa i dvije sezone u turskom klubu bije nego što je ponovo ostao bez kluba.\n\nSa 20 godina i već dva kluba iza sebe Hasagić je odlučio da se vrati u rodnu BiH kako bi ponovo vratio formu koju je pokazivao kao omladinski igrač.\n\nPotpisuje za Bosnu iz Visokog za koju upisuje 8 nastupa, te narednu sezonu vraća se u Kakanj kako bi igrao za Rudar. Uspješna sezona sa Rudarom privukla je pažnju Željezničara za koji potpisuje 1. jula 2002. godine.\n\nSa dolaskom u FK Željezničar, Hasagić je shvatio da mu je ovo odlična prilika te je vezao odličan nastup za odličnim nastupom.\n\nU samo dvije sezone sa Željezničarom upisao je 55 nastupa i osvojio svoj prvi i jedini trofej u karijeru, a to je bio Kup BiH u sezoni 2002/2003.\n\nKenan Hasagić je definitivno jedan od najboljih golamana u historiji BH fudbala\n\nKvalitetni nastupi u Željezničaru su naveli tadašnjeg selektora reprezentacije BiH da mu da šansu, te Hasagić postaje prvi golman reprezentacije BiH.\n\nDruga šansa u Turskoj koju nije propustio\n\nKenan Hasagić sredinom 2004. godine ponovo se seli u Tursku, ali ovaj put oblači dres Gaziantepspora, te postaje standardan u startnoj postavi.\n\nKroz tri godine sa Gaziantepsporom pokazao je koliko je konstantan i pouzdan golman te također da povrede ne utiču mnogo na njega. Upisao je 86 nastupa i postao favorit turskog kluba.\n\nU 2007. godini čini svoj posljednji transfer u karijeri i prelazi u Istanbul Basaksehir. Iako se tada Basaksehir nije borio za titulu i nije predstavljao preveliku prijetnju velikoj trojci Hasagić se uvijek trudio da svoj klub stavi u najbolju moguću poziciju.\n\nČinjenica da je Hasagić nakon završetka svoje karijere ostao u fudbalu kao trener golmana pokazuje koliko voli ovaj sport i koliko voli golmansku poziciju.\n\nOdlazi iz Basaksehira kao omiljen među navijačima i svojim kolegama igračima. Zvanično se penzionisao 2012. godine nakon pet godina u klubu i upisanih 97 nastupa.\n\nKenan je u svojevremeno bio zaposlen u bh. premijerligašu Tuzla City kao trener golmana u stručnom štabu kojeg je predvodio trener Nermin Bašić. Prethodno je bio trener golmana Mladosti iz Doboja kod Kaknja te reprezentacije BiH.\n\nKenan Hasagić je ostavio neizbrisiv tragu u dresu reprezentacije BiH\n\nDres reprezentacije BiH je nosio 8 godina\n\nDakle, debi za seniorsku reprezentaciju Bosne i Hercegovine Hasagić je napravio u februaru 2003. godine na prijateljskom meču protiv Walesa koji je završen rezultatom 2:2.\n\nNo, prije dolaska u seniorsku reprezentaciju BiH, Kenan Hasagić je branio za U21 selekciju BiH za koju je upisao šest nastupa.\n\nOd debija protiv Walesa 2003. godine, Kenan Hasagić je bio neizostavan dio spiska selektora Blaža Sliškovića. Dolaskom Fuada Muzurovića, Hasagić nije dolazio na okupljanja reprezentacije BiH, a njegovo mjesto zauzeo je Adnan Gušo.\n\nKenan se na gol reprezentacije BiH vratio u kvalifikacijama za EURO 2008 kada je branio na četiri meča.\n\nOpet je uslijedila pauza od nacionalnog dresa, da bi među stative ponovo stao u prijateljskom meču protiv Japana 2008. godine.\n\nKenan Hasagić vs David Villa\n\nNa otvaranju kvalifikacija za Svjetsko prvenstvo u Južnoj Africi 2010. godine, BiH je gostovala kod reprezentacije Španije gdje je poražena minimalnim rezultatom 1:0.\n\nNa tom meču Kenan Hasagić urezao se u srca svih bh. navijača kada je poslao vrsnog napadača Davida Villu, ni manje ni više, nego po “ćevape”.\n\nU baražu za odlazak na pomenuto takmičenje Hasagić je branio u obje utakmice, ali nažalost selekcija BiH je ostala bez plasmana na Mundijal 2010. godine.\n\nNakon toga, nastavio je Kenan Hasagić biti standardan u kvalifikacijama za EURO 2012. godine.\n\nPosljednji susret u dresu reprezentacije BiH, Hasagić je odigrao u Parizu 2011. godine kada je BiH remizirala protiv Francuske 1:1, ali nažalost utakmicu je napustio nakon 45 minuta zbog povrede.\n\nU tih devet godina u dresu reprezentacije BiH, Hasagić je branio 43 puta.\n\nZa kraj vam donosimo kompilaciju najboljih poteza koje je Kenan Hasagić napravio u karijeri.\n\nPREPORUČENO ZA VAS:"}, {"url": "https://fbref.com/en/players/b0322004/Kenan-Hasagic", "page_content": "About FBref.com\n\nFBref.com launched (June 13, 2018) with domestic league coverage for England, France, Germany, Italy, Spain, and United States. Since then we have been steadily expanding our coverage to include domestic leagues from over 40 countries as well as domestic cup, super cup and youth leagues from top European countries. We have also added coverage for major international cups such as the UEFA Champions League and Copa Libertadores.\n\nFBref is the most complete sources for women's football data on the internet. This includes the entire history of the FIFA Women's World Cup as well as recent domestic league seasons from nine countries, including advanced stats like xG for most of those nine.\n\nIn collaboration with Opta, we are including advanced analytical data such as xG, xA, progressive passing, duels and more for over twenty competitions. For more information on the expected goals model and which competitions have advanced data, see our xG explainer.\n\nView Additional Information"}, {"url": "https://prabook.com/web/kenan.hasagic/2130128", "page_content": "Kenan Hasagic\n\nassociation football player\n\nFebruary 1, 1980 Kakanj, Kakanj Municipality, Bosnia and Herzegovina\n\nHis football career began in his hometown with FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnian national team In 2004-2005 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. He made his debut for national team on 12 February 2003 in a game between Wales and Bosnia and Herzegovina which ended in a 2–2 draw."}, {"url": "https://peoplepill.com/people/kenan-hasagic/", "page_content": "Kenan Hasagić (born 1 February 1980) is a Bosnian football goalkeeper who plays for Balıkesirspor.\n\nHis football career began in his hometown with FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr. After that, he was a member of Altay SK in Turkey but didn't see much first team football. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnian national team. In 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor.\n\nHe made his debut for national team on 12 February 2003 in a game between Wales and Bosnia and Herzegovina which ended in a 2–2 draw.\n\nPersonal life\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam.\n\nOn 27 December 2009, Hasagić confirmed he divorced his wife after 9 years of marriage."}, {"url": "https://www.wikizero.com/www//Kenan_Hasagi%C4%87", "page_content": "Kenan Hasagić ( Bosnian pronunciation: [xâsaɡitɕ]; born 1 February 1980) is a Bosnian retired professional football goalkeeper[1] and current goalkeeping coach of Bosnian Premier League club Željezničar.\n\nClub career [ edit ]\n\nHasagić's football career began in his hometown with Rudar Kakanj. At the age of 16, he made his debut in a first division match. He concedeed 5 goals. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr.\n\nAfter that, Hasagić was a member of Altay in Turkey but didn't see much first team football. He went back to Bosnia and played for Rudar Kakanj and Bosna Visoko. In 2003, he signed a contract with Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnia and Herzegovina national team.\n\nDuring the 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. In 2007, he moved over to another Turkish Süper Lig side in İstanbul Başakşehir. In 2012, Hasagić retired from football early after injuries shattered his career.\n\nInternational career [ edit ]\n\nHasagić made his debut for Bosnia and Herzegovina in a September 2002 European Championship qualification match against Romania and has earned a total of 44 caps, scoring no goals.[2] His final international was an October 2011 European Championship qualification match against France.[3]\n\nManagerial career [ edit ]\n\nIn August 2017, Hasagić became the new goalkeeping coach of Bosnian Premier League club Mladost Doboj Kakanj.[4] Two years later, on 2 November 2019, he announced that he left Mladost and that he will only be focusing on the Bosnia and Herzegovina national team.[5]\n\nOn 4 January 2018, after Robert Prosinečki was named the new head coach of the Bosnia and Herzegovina national team, it was announced that Hasagić became the new goalkeeping coach of the national team.[6] Hasagić left the national team in November 2019 with the sacking of Prosinečki.[7]\n\nIt was announced on 7 January 2020 that Hasagić took over the position of goalkeeping coach of another Bosnian Premier League club, Tuzla City, working alongside former national team teammate, good friend, and godfather Elvir Baljić, the club manager at the time.[8] He decided to leave the club in June 2021.[9]\n\nOn 9 July 2021, Hasagić became the new goalkeeping coach of his former club Željezničar.[10]\n\nPersonal life [ edit ]\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam. On 27 December 2009, Hasagić confirmed he divorced his wife Dijana after 9 years of marriage.\n\nAfter his divorce, he has been in a long term relationship with a model, Aminka Sivac. He is 15 years older than her.[11] On 8 July 2019, Hasagić married Sivac. Former national team teammate Elvir Baljić was the best man at his wedding.[12]\n\nCareer statistics [ edit ]\n\nInternational [ edit ]\n\nNational team Year Apps Goals Bosnia and Herzegovina 2002 1 0 2003 7 0 2004 2 0 2005 7 0 2006 6 0 2008 5 0 2009 3 0 2010 6 0 2011 7 0 Total 44 0\n\nHonours [ edit ]\n\nPlayer [ edit ]\n\nŽeljezničar[1]"}, {"url": "https://www.soccerway.com/players/kenan-hasagic/5043/", "page_content": "Matches of K. Hasagić\n\nCopyright ©2023 Perform Group. All rights reserved.\n\nData provided by Opta Sports. Articles provided by OMNISPORT."}, {"url": "https://sportsport.ba/fudbal/kenan-hasagic-fk-zeljeznicar-trener/403258", "page_content": "Nekadašnji golman Plavih sa Grbavice danas je potpisao ugovor sa sarajevskim klubom i postao je novi trener golmana.\n\nHasagić je proteklu godinu i po proveo u Tuzla Cityju proveo Stigao je u januaru 2020. godine i očigledno da je došlo do zasićena i 41-godišnji trener se odlučio na odlazak.\n\nKenan Hasagić je ranije radio kao trener golmana u ekipi Mladosti iz Doboj Kaknja, te reprezentaciji Bosne i Hercegovine.\n\nNekadašnji golman Plavih i reprezentacije BiH, Kenan Hasagić, novi je trener golmana FK Željezničar. Posted by FK Željezničar on Friday, July 9, 2021\n\nDugo godina je Kenan bio broj jedan reprezentacije BiH za koju je nastupio 44 puta u periodu od 2002. do 2011. godine.\n\nKlupsku karijeru ovaj nekadašnji čuvar mreže započeo je u kakanjskom Rudaru, a potom je igrao u Vorwartsu i Altayju.\n\nPotražite više informacija na temu Premijer liga BiH: Vijesti Tabela Raspored\n\nU BiH se vratio 2001. godine u redove visočke Bosne, a zatim je preko Rudara došao u Željezničar.\n\nNakon dvije godine na Grbavici 2004. godine ponovo odlazi u Tursku, gdje je ostao narednih osam godina i gdje je nastupao za Gaziantepspor i Bašakšehir."}, {"url": "https://wiki.alquds.edu/?query=Kenan_Hasagi%C4%87", "page_content": "Kenan Hasagić ( Bosnian pronunciation: [xâsaɡitɕ]; born 1 February 1980) is a Bosnian retired professional football goalkeeper[1] and current goalkeeping coach of Bosnian Premier League club Željezničar.\n\nClub career [ edit ]\n\nHasagić's football career began in his hometown with Rudar Kakanj. At the age of 16, he made his debut in a first division match. He concedeed 5 goals. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr.\n\nAfter that, Hasagić was a member of Altay in Turkey but didn't see much first team football. He went back to Bosnia and played for Rudar Kakanj and Bosna Visoko. In 2003, he signed a contract with Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnia and Herzegovina national team.\n\nDuring the 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. In 2007, he moved over to another Turkish Süper Lig side in İstanbul Başakşehir. In 2012, Hasagić retired from football early after injuries shattered his career.\n\nInternational career [ edit ]\n\nHasagić made his debut for Bosnia and Herzegovina in a September 2002 European Championship qualification match against Romania and has earned a total of 44 caps, scoring no goals.[2] His final international was an October 2011 European Championship qualification match against France.[3]\n\nManagerial career [ edit ]\n\nIn August 2017, Hasagić became the new goalkeeping coach of Bosnian Premier League club Mladost Doboj Kakanj.[4] Two years later, on 2 November 2019, he announced that he left Mladost and that he will only be focusing on the Bosnia and Herzegovina national team.[5]\n\nOn 4 January 2018, after Robert Prosinečki was named the new head coach of the Bosnia and Herzegovina national team, it was announced that Hasagić became the new goalkeeping coach of the national team.[6] Hasagić left the national team in November 2019 with the sacking of Prosinečki.[7]\n\nIt was announced on 7 January 2020 that Hasagić took over the position of goalkeeping coach of another Bosnian Premier League club, Tuzla City, working alongside former national team teammate, good friend, and godfather Elvir Baljić, the club manager at the time.[8] He decided to leave the club in June 2021.[9]\n\nOn 9 July 2021, Hasagić became the new goalkeeping coach of his former club Željezničar.[10]\n\nPersonal life [ edit ]\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam. On 27 December 2009, Hasagić confirmed he divorced his wife Dijana after 9 years of marriage.\n\nAfter his divorce, he has been in a long term relationship with a model, Aminka Sivac. He is 15 years older than her.[11] On 8 July 2019, Hasagić married Sivac. Former national team teammate Elvir Baljić was the best man at his wedding.[12]\n\nCareer statistics [ edit ]\n\nInternational [ edit ]\n\nNational team Year Apps Goals Bosnia and Herzegovina 2002 1 0 2003 7 0 2004 2 0 2005 7 0 2006 6 0 2008 5 0 2009 3 0 2010 6 0 2011 7 0 Total 44 0\n\nHonours [ edit ]\n\nPlayer [ edit ]\n\nŽeljezničar[1]"}]}