{"Kenan Hasagić made his professional debut in 2006.": [{"url": "https://fbref.com/en/players/b0322004/Kenan-Hasagic", "page_content": "About FBref.com\n\nFBref.com launched (June 13, 2018) with domestic league coverage for England, France, Germany, Italy, Spain, and United States. Since then we have been steadily expanding our coverage to include domestic leagues from over 40 countries as well as domestic cup, super cup and youth leagues from top European countries. We have also added coverage for major international cups such as the UEFA Champions League and Copa Libertadores.\n\nFBref is the most complete sources for women's football data on the internet. This includes the entire history of the FIFA Women's World Cup as well as recent domestic league seasons from nine countries, including advanced stats like xG for most of those nine.\n\nIn collaboration with Opta, we are including advanced analytical data such as xG, xA, progressive passing, duels and more for over twenty competitions. For more information on the expected goals model and which competitions have advanced data, see our xG explainer.\n\nView Additional Information"}, {"url": "https://prabook.com/web/kenan.hasagic/2130128", "page_content": "Kenan Hasagic\n\nassociation football player\n\nFebruary 1, 1980 Kakanj, Kakanj Municipality, Bosnia and Herzegovina\n\nHis football career began in his hometown with FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnian national team In 2004-2005 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. He made his debut for national team on 12 February 2003 in a game between Wales and Bosnia and Herzegovina which ended in a 2–2 draw."}, {"url": "https://peoplepill.com/people/kenan-hasagic/", "page_content": "Kenan Hasagić (born 1 February 1980) is a Bosnian football goalkeeper who plays for Balıkesirspor.\n\nHis football career began in his hometown with FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr. After that, he was a member of Altay SK in Turkey but didn't see much first team football. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnian national team. In 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor.\n\nHe made his debut for national team on 12 February 2003 in a game between Wales and Bosnia and Herzegovina which ended in a 2–2 draw.\n\nPersonal life\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam.\n\nOn 27 December 2009, Hasagić confirmed he divorced his wife after 9 years of marriage."}, {"url": "https://sofifa.com/player/140892/kenan-hasagic/070001/", "page_content": "All product names, logos, and brands are the property of their respective owners.\n\nAll company, product, and service names used in this website are for identification purposes only.\n\nTerms Privacy FAQ"}, {"url": "https://wiki.alquds.edu/?query=Kenan_Hasagi%C4%87", "page_content": "Kenan Hasagić ( Bosnian pronunciation: [xâsaɡitɕ]; born 1 February 1980) is a Bosnian retired professional football goalkeeper[1] and current goalkeeping coach of Bosnian Premier League club Željezničar.\n\nClub career [ edit ]\n\nHasagić's football career began in his hometown with Rudar Kakanj. At the age of 16, he made his debut in a first division match. He concedeed 5 goals. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr.\n\nAfter that, Hasagić was a member of Altay in Turkey but didn't see much first team football. He went back to Bosnia and played for Rudar Kakanj and Bosna Visoko. In 2003, he signed a contract with Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnia and Herzegovina national team.\n\nDuring the 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. In 2007, he moved over to another Turkish Süper Lig side in İstanbul Başakşehir. In 2012, Hasagić retired from football early after injuries shattered his career.\n\nInternational career [ edit ]\n\nHasagić made his debut for Bosnia and Herzegovina in a September 2002 European Championship qualification match against Romania and has earned a total of 44 caps, scoring no goals.[2] His final international was an October 2011 European Championship qualification match against France.[3]\n\nManagerial career [ edit ]\n\nIn August 2017, Hasagić became the new goalkeeping coach of Bosnian Premier League club Mladost Doboj Kakanj.[4] Two years later, on 2 November 2019, he announced that he left Mladost and that he will only be focusing on the Bosnia and Herzegovina national team.[5]\n\nOn 4 January 2018, after Robert Prosinečki was named the new head coach of the Bosnia and Herzegovina national team, it was announced that Hasagić became the new goalkeeping coach of the national team.[6] Hasagić left the national team in November 2019 with the sacking of Prosinečki.[7]\n\nIt was announced on 7 January 2020 that Hasagić took over the position of goalkeeping coach of another Bosnian Premier League club, Tuzla City, working alongside former national team teammate, good friend, and godfather Elvir Baljić, the club manager at the time.[8] He decided to leave the club in June 2021.[9]\n\nOn 9 July 2021, Hasagić became the new goalkeeping coach of his former club Željezničar.[10]\n\nPersonal life [ edit ]\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam. On 27 December 2009, Hasagić confirmed he divorced his wife Dijana after 9 years of marriage.\n\nAfter his divorce, he has been in a long term relationship with a model, Aminka Sivac. He is 15 years older than her.[11] On 8 July 2019, Hasagić married Sivac. Former national team teammate Elvir Baljić was the best man at his wedding.[12]\n\nCareer statistics [ edit ]\n\nInternational [ edit ]\n\nNational team Year Apps Goals Bosnia and Herzegovina 2002 1 0 2003 7 0 2004 2 0 2005 7 0 2006 6 0 2008 5 0 2009 3 0 2010 6 0 2011 7 0 Total 44 0\n\nHonours [ edit ]\n\nPlayer [ edit ]\n\nŽeljezničar[1]"}, {"url": "https://dbpedia.org/page/Kenan_Hasagi%C4%87", "page_content": "Kenan Hasagić (* 1. Februar 1980 in Kakanj) ist ein bosnisch-herzegowinischer Fußballtorhüter. (de)\n\nKenan Hasagic (n. 1 de febrero de 1980 (42 años) Kakanj) es un futbolista bosnio que juega de portero. Su carrera futbolística comenzó en su ciudad natal con la local de la primera Liga de Bosnia y Herzegovina. A la edad de 16 años, hizo su debut en un partido de primera división. Fue el portero más prometedor en Bosnia-Herzegovina, que jugó para las selecciones júnior y luego fue transferido a Austria al Vorwärts Steyr. Después de eso, él era un miembro de la Altay SK en Turquía, pero en realidad nunca consiguió un equipo de fútbol de primera. Volvió a Bosnia y jugó para Bosna Visoko. En 2003, firmó un contrato con FK Željezničar Se ha encontrado una buena forma allí e incluso se convirtió en portero de primera elección para la Selección de fútbol de Bosnia y Herzegovina. En las temporadas 2004/2005, se trasladó a Turquía una vez más en que fichó para la Liga turca, en Gaziantepspor. Fichó por el Istanbul Buyuksehir Belediyespor. Hizo su debut con el equipo nacional el 12 de febrero de 2003, en un juego entre Gales y Bosnia-Herzegovina, que terminó en un empate 2-2. (es)\n\nKenan Hasagić (Bosnian pronunciation: [xâsaɡitɕ]; born 1 February 1980) is a Bosnian retired professional football goalkeeper and current goalkeeping coach of Bosnian Premier League club Željezničar. (en)\n\nKenan Hasagić, né le 1er février 1980 à Kakanj, est un footballeur bosnien évoluant au poste de gardien de but. Il est le gardien titulaire de l'équipe de Bosnie-Herzégovine de football de 2003 à 2011. (fr)\n\nKenan Hasagić (Kakanj, 1º febbraio 1980) è un ex calciatore bosniaco, di ruolo portiere, attuale preparatore dei portieri del Tuzla City. (it)\n\nKenan Hasagić (Kakanj, 1 februari 1980) is een Bosnisch voetballer. Hij speelt als doelman bij het Turkse Istanbul Büyükşehir Belediyespor. Hasagić staat al een aantal jaren op het hoogste niveau in Turkije onder de lat. In zijn geboorteland Bosnië en Herzegovina speelde hij voor FK Željezničar en FK Rudar Kakanj. Als doelman moet hij het hebben van zijn kwaliteiten in het strafschopgebied zoals het één op één gaan in lastige situaties. (nl)\n\nKenan Hasagić (ur. 1 lutego 1980 w Kakanju) – piłkarz bośniacki grający na pozycji bramkarza. Od 2007 roku jest piłkarzem klubu İstanbul Büyükşehir Belediyespor. (pl)\n\nКенан Хасагич (сербохорв. Kenan Hasagić / Кенан Хасагић; родился 1 февраля 1980, Какань) — боснийский футболист, вратарь, тренер. (ru)\n\nКенан Хасагич (босн. Kenan Hasagić, нар. 1 лютого 1980, Какань, СФРЮ) — боснійський футболіст, що грав на позиції воротаря. Виступав, зокрема, за клуби , «Ґазіантепспор» та «Істанбул ББ», а також національну збірну Боснії і Герцеговини. (uk)"}, {"url": "https://www.soccerway.com/players/kenan-hasagic/5043/", "page_content": "Matches of K. Hasagić\n\nCopyright ©2023 Perform Group. All rights reserved.\n\nData provided by Opta Sports. Articles provided by OMNISPORT."}, {"url": "https://everything.explained.today/%5C/Kenan_Hasagi%C4%87/", "page_content": "Kenan Hasagić Explained\n\nKenan Hasagić (pronounced as /xâsaɡitɕ/; born 1 February 1980) is a Bosnian retired professional football goalkeeper[1] and current goalkeeping coach of Bosnian Premier League club Željezničar.\n\nClub career\n\nHasagić's football career began in his hometown with Rudar Kakanj. At the age of 16, he made his debut in a first division match. He concedeed 5 goals. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr.\n\nAfter that, Hasagić was a member of Altay in Turkey but didn't see much first team football. He went back to Bosnia and played for Rudar Kakanj and Bosna Visoko. In 2003, he signed a contract with Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnia and Herzegovina national team.\n\nDuring the 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. In 2007, he moved over to another Turkish Süper Lig side in İstanbul Başakşehir. In 2012, Hasagić retired from football early after injuries shattered his career.\n\nInternational career\n\nHasagić made his debut for Bosnia and Herzegovina in a September 2002 European Championship qualification match against Romania and has earned a total of 44 caps, scoring no goals.[2] His final international was an October 2011 European Championship qualification match against France.[3]\n\nManagerial career\n\nIn August 2017, Hasagić became the new goalkeeping coach of Bosnian Premier League club Mladost Doboj Kakanj.[4] Two years later, on 2 November 2019, he announced that he left Mladost and that he will only be focusing on the Bosnia and Herzegovina national team.[5]\n\nOn 4 January 2018, after Robert Prosinečki was named the new head coach of the Bosnia and Herzegovina national team, it was announced that Hasagić became the new goalkeeping coach of the national team.[6] Hasagić left the national team in November 2019 with the sacking of Prosinečki.[7]\n\nIt was announced on 7 January 2020 that Hasagić took over the position of goalkeeping coach of another Bosnian Premier League club, Tuzla City, working alongside former national team teammate, good friend, and godfather Elvir Baljić, the club manager at the time.[8] He decided to leave the club in June 2021.[9]\n\nOn 9 July 2021, Hasagić became the new goalkeeping coach of his former club Željezničar.[10]\n\nPersonal life\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam. On 27 December 2009, Hasagić confirmed he divorced his wife Dijana after 9 years of marriage.\n\nAfter his divorce, he has been in a long term relationship with a model, Aminka Sivac. He is 15 years older than her.[11] On 8 July 2019, Hasagić married Sivac. Former national team teammate Elvir Baljić was the best man at his wedding.[12]\n\nCareer statistics\n\nInternational\n\nNational team Year Apps Goals Bosnia and Herzegovina 2002 1 0 2003 7 0 2004 2 0 2005 7 0 2006 6 0 2008 5 0 2009 3 0 2010 6 0 2011 7 0 Total 44 0\n\nHonours\n\nPlayer\n\nŽeljezničar[1]\n\n2002–03\n\nExternal links\n\nKenan Hasagić at TFF.org\n\n\n\nNotes and References"}, {"url": "https://korner.ba/kenan-hasagic-biografija/", "page_content": "Kenan Hasagić biografija golmana koji je OSAM GODINA branio mrežu Reprezentacije BiH i istovremeno čuvao Željezničar.\n\nRođen je 1. februara 1980. godine u Kaknju. Priključuje se omladinskom sistemu Rudara, te sa 16. godina ostvaruje svoj prvi profesionalni nastup za seniorski tim. Jedna sezona u kojoj se ostvario 14 nastupa bila je dovoljna da mu austrijski Vorwärts Steyr da šansu.\n\nOdlazak iz Kaknja ogromna pogreška?\n\nOdlazak u Vorwärts za Hasagića nije bio uspješan. Dobio je ugovor na jednu godinu te iako je upisao 21 nastup nije uspio uvjeriti klub da mu produže ugovor.\n\nNakon Austrije Hasagić odlazi u Tursku kako bi igrao za Altay. Uspio je uvezati 42 nastupa i dvije sezone u turskom klubu bije nego što je ponovo ostao bez kluba.\n\nSa 20 godina i već dva kluba iza sebe Hasagić je odlučio da se vrati u rodnu BiH kako bi ponovo vratio formu koju je pokazivao kao omladinski igrač.\n\nPotpisuje za Bosnu iz Visokog za koju upisuje 8 nastupa, te narednu sezonu vraća se u Kakanj kako bi igrao za Rudar. Uspješna sezona sa Rudarom privukla je pažnju Željezničara za koji potpisuje 1. jula 2002. godine.\n\nSa dolaskom u FK Željezničar, Hasagić je shvatio da mu je ovo odlična prilika te je vezao odličan nastup za odličnim nastupom.\n\nU samo dvije sezone sa Željezničarom upisao je 55 nastupa i osvojio svoj prvi i jedini trofej u karijeru, a to je bio Kup BiH u sezoni 2002/2003.\n\nKenan Hasagić je definitivno jedan od najboljih golamana u historiji BH fudbala\n\nKvalitetni nastupi u Željezničaru su naveli tadašnjeg selektora reprezentacije BiH da mu da šansu, te Hasagić postaje prvi golman reprezentacije BiH.\n\nDruga šansa u Turskoj koju nije propustio\n\nKenan Hasagić sredinom 2004. godine ponovo se seli u Tursku, ali ovaj put oblači dres Gaziantepspora, te postaje standardan u startnoj postavi.\n\nKroz tri godine sa Gaziantepsporom pokazao je koliko je konstantan i pouzdan golman te također da povrede ne utiču mnogo na njega. Upisao je 86 nastupa i postao favorit turskog kluba.\n\nU 2007. godini čini svoj posljednji transfer u karijeri i prelazi u Istanbul Basaksehir. Iako se tada Basaksehir nije borio za titulu i nije predstavljao preveliku prijetnju velikoj trojci Hasagić se uvijek trudio da svoj klub stavi u najbolju moguću poziciju.\n\nČinjenica da je Hasagić nakon završetka svoje karijere ostao u fudbalu kao trener golmana pokazuje koliko voli ovaj sport i koliko voli golmansku poziciju.\n\nOdlazi iz Basaksehira kao omiljen među navijačima i svojim kolegama igračima. Zvanično se penzionisao 2012. godine nakon pet godina u klubu i upisanih 97 nastupa.\n\nKenan je u svojevremeno bio zaposlen u bh. premijerligašu Tuzla City kao trener golmana u stručnom štabu kojeg je predvodio trener Nermin Bašić. Prethodno je bio trener golmana Mladosti iz Doboja kod Kaknja te reprezentacije BiH.\n\nKenan Hasagić je ostavio neizbrisiv tragu u dresu reprezentacije BiH\n\nDres reprezentacije BiH je nosio 8 godina\n\nDakle, debi za seniorsku reprezentaciju Bosne i Hercegovine Hasagić je napravio u februaru 2003. godine na prijateljskom meču protiv Walesa koji je završen rezultatom 2:2.\n\nNo, prije dolaska u seniorsku reprezentaciju BiH, Kenan Hasagić je branio za U21 selekciju BiH za koju je upisao šest nastupa.\n\nOd debija protiv Walesa 2003. godine, Kenan Hasagić je bio neizostavan dio spiska selektora Blaža Sliškovića. Dolaskom Fuada Muzurovića, Hasagić nije dolazio na okupljanja reprezentacije BiH, a njegovo mjesto zauzeo je Adnan Gušo.\n\nKenan se na gol reprezentacije BiH vratio u kvalifikacijama za EURO 2008 kada je branio na četiri meča.\n\nOpet je uslijedila pauza od nacionalnog dresa, da bi među stative ponovo stao u prijateljskom meču protiv Japana 2008. godine.\n\nKenan Hasagić vs David Villa\n\nNa otvaranju kvalifikacija za Svjetsko prvenstvo u Južnoj Africi 2010. godine, BiH je gostovala kod reprezentacije Španije gdje je poražena minimalnim rezultatom 1:0.\n\nNa tom meču Kenan Hasagić urezao se u srca svih bh. navijača kada je poslao vrsnog napadača Davida Villu, ni manje ni više, nego po “ćevape”.\n\nU baražu za odlazak na pomenuto takmičenje Hasagić je branio u obje utakmice, ali nažalost selekcija BiH je ostala bez plasmana na Mundijal 2010. godine.\n\nNakon toga, nastavio je Kenan Hasagić biti standardan u kvalifikacijama za EURO 2012. godine.\n\nPosljednji susret u dresu reprezentacije BiH, Hasagić je odigrao u Parizu 2011. godine kada je BiH remizirala protiv Francuske 1:1, ali nažalost utakmicu je napustio nakon 45 minuta zbog povrede.\n\nU tih devet godina u dresu reprezentacije BiH, Hasagić je branio 43 puta.\n\nZa kraj vam donosimo kompilaciju najboljih poteza koje je Kenan Hasagić napravio u karijeri.\n\nPREPORUČENO ZA VAS:"}, {"url": "http://dictionary.sensagent.com/Kenan_Hasagi%C4%87/en-en/", "page_content": "Kenan Hasagić (born February 1, 1980 in Kakanj) is a Bosnian football goalkeeper.\n\nHis football career began in his hometown with the local FK Rudar of Premier League of Bosnia and Herzegovina. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia-Herzegovina, he played for junior selections and was later transferred to Austrian side Vorwärts Steyr. After that, he was a member of Altay SK in Turkey but never actually secured a first team football. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar He has found a good form there and even became first choice goalkeeper for Bosnian national team. In 2004/2005 season, he moved to Turkey once again where he signed for Turkish League side Gaziantepspor. He signed for İstanbul Büyükşehir Belediyespor. He is known for dribbling past a player if the player charges to him to take the ball.\n\nHe made his debut for national team on February 12, 2003. in a game between Wales and Bosnia-Herzegovina which ended in a 2–2 draw.\n\nPersonal life\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam.[2]\n\nOn December 27, 2009, Hasagić confirmed he divorced his wife after 9 years of marriage.[2]\n\nReferences\n\n\n\n\n\nPersondata Name Hasagic, Kenan Alternative names Short description Date of birth 1980-02-01 Place of birth Kakanj, SFR Yugoslavia Date of death Place of death\n\n\n\n"}], "Kenan Hasagić started his career at his hometown club Željezničar": [{"url": "https://dbpedia.org/page/Kenan_Hasagi%C4%87", "page_content": "Kenan Hasagić (* 1. Februar 1980 in Kakanj) ist ein bosnisch-herzegowinischer Fußballtorhüter. (de)\n\nKenan Hasagic (n. 1 de febrero de 1980 (42 años) Kakanj) es un futbolista bosnio que juega de portero. Su carrera futbolística comenzó en su ciudad natal con la local de la primera Liga de Bosnia y Herzegovina. A la edad de 16 años, hizo su debut en un partido de primera división. Fue el portero más prometedor en Bosnia-Herzegovina, que jugó para las selecciones júnior y luego fue transferido a Austria al Vorwärts Steyr. Después de eso, él era un miembro de la Altay SK en Turquía, pero en realidad nunca consiguió un equipo de fútbol de primera. Volvió a Bosnia y jugó para Bosna Visoko. En 2003, firmó un contrato con FK Željezničar Se ha encontrado una buena forma allí e incluso se convirtió en portero de primera elección para la Selección de fútbol de Bosnia y Herzegovina. En las temporadas 2004/2005, se trasladó a Turquía una vez más en que fichó para la Liga turca, en Gaziantepspor. Fichó por el Istanbul Buyuksehir Belediyespor. Hizo su debut con el equipo nacional el 12 de febrero de 2003, en un juego entre Gales y Bosnia-Herzegovina, que terminó en un empate 2-2. (es)\n\nKenan Hasagić (Bosnian pronunciation: [xâsaɡitɕ]; born 1 February 1980) is a Bosnian retired professional football goalkeeper and current goalkeeping coach of Bosnian Premier League club Željezničar. (en)\n\nKenan Hasagić, né le 1er février 1980 à Kakanj, est un footballeur bosnien évoluant au poste de gardien de but. Il est le gardien titulaire de l'équipe de Bosnie-Herzégovine de football de 2003 à 2011. (fr)\n\nKenan Hasagić (Kakanj, 1º febbraio 1980) è un ex calciatore bosniaco, di ruolo portiere, attuale preparatore dei portieri del Tuzla City. (it)\n\nKenan Hasagić (Kakanj, 1 februari 1980) is een Bosnisch voetballer. Hij speelt als doelman bij het Turkse Istanbul Büyükşehir Belediyespor. Hasagić staat al een aantal jaren op het hoogste niveau in Turkije onder de lat. In zijn geboorteland Bosnië en Herzegovina speelde hij voor FK Željezničar en FK Rudar Kakanj. Als doelman moet hij het hebben van zijn kwaliteiten in het strafschopgebied zoals het één op één gaan in lastige situaties. (nl)\n\nKenan Hasagić (ur. 1 lutego 1980 w Kakanju) – piłkarz bośniacki grający na pozycji bramkarza. Od 2007 roku jest piłkarzem klubu İstanbul Büyükşehir Belediyespor. (pl)\n\nКенан Хасагич (сербохорв. Kenan Hasagić / Кенан Хасагић; родился 1 февраля 1980, Какань) — боснийский футболист, вратарь, тренер. (ru)\n\nКенан Хасагич (босн. Kenan Hasagić, нар. 1 лютого 1980, Какань, СФРЮ) — боснійський футболіст, що грав на позиції воротаря. Виступав, зокрема, за клуби , «Ґазіантепспор» та «Істанбул ББ», а також національну збірну Боснії і Герцеговини. (uk)"}, {"url": "https://wiki.alquds.edu/?query=Kenan_Hasagi%C4%87", "page_content": "Kenan Hasagić ( Bosnian pronunciation: [xâsaɡitɕ]; born 1 February 1980) is a Bosnian retired professional football goalkeeper[1] and current goalkeeping coach of Bosnian Premier League club Željezničar.\n\nClub career [ edit ]\n\nHasagić's football career began in his hometown with Rudar Kakanj. At the age of 16, he made his debut in a first division match. He concedeed 5 goals. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr.\n\nAfter that, Hasagić was a member of Altay in Turkey but didn't see much first team football. He went back to Bosnia and played for Rudar Kakanj and Bosna Visoko. In 2003, he signed a contract with Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnia and Herzegovina national team.\n\nDuring the 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. In 2007, he moved over to another Turkish Süper Lig side in İstanbul Başakşehir. In 2012, Hasagić retired from football early after injuries shattered his career.\n\nInternational career [ edit ]\n\nHasagić made his debut for Bosnia and Herzegovina in a September 2002 European Championship qualification match against Romania and has earned a total of 44 caps, scoring no goals.[2] His final international was an October 2011 European Championship qualification match against France.[3]\n\nManagerial career [ edit ]\n\nIn August 2017, Hasagić became the new goalkeeping coach of Bosnian Premier League club Mladost Doboj Kakanj.[4] Two years later, on 2 November 2019, he announced that he left Mladost and that he will only be focusing on the Bosnia and Herzegovina national team.[5]\n\nOn 4 January 2018, after Robert Prosinečki was named the new head coach of the Bosnia and Herzegovina national team, it was announced that Hasagić became the new goalkeeping coach of the national team.[6] Hasagić left the national team in November 2019 with the sacking of Prosinečki.[7]\n\nIt was announced on 7 January 2020 that Hasagić took over the position of goalkeeping coach of another Bosnian Premier League club, Tuzla City, working alongside former national team teammate, good friend, and godfather Elvir Baljić, the club manager at the time.[8] He decided to leave the club in June 2021.[9]\n\nOn 9 July 2021, Hasagić became the new goalkeeping coach of his former club Željezničar.[10]\n\nPersonal life [ edit ]\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam. On 27 December 2009, Hasagić confirmed he divorced his wife Dijana after 9 years of marriage.\n\nAfter his divorce, he has been in a long term relationship with a model, Aminka Sivac. He is 15 years older than her.[11] On 8 July 2019, Hasagić married Sivac. Former national team teammate Elvir Baljić was the best man at his wedding.[12]\n\nCareer statistics [ edit ]\n\nInternational [ edit ]\n\nNational team Year Apps Goals Bosnia and Herzegovina 2002 1 0 2003 7 0 2004 2 0 2005 7 0 2006 6 0 2008 5 0 2009 3 0 2010 6 0 2011 7 0 Total 44 0\n\nHonours [ edit ]\n\nPlayer [ edit ]\n\nŽeljezničar[1]"}, {"url": "https://www.wikizero.com/www//Kenan_Hasagi%C4%87", "page_content": "Kenan Hasagić ( Bosnian pronunciation: [xâsaɡitɕ]; born 1 February 1980) is a Bosnian retired professional football goalkeeper[1] and current goalkeeping coach of Bosnian Premier League club Željezničar.\n\nClub career [ edit ]\n\nHasagić's football career began in his hometown with Rudar Kakanj. At the age of 16, he made his debut in a first division match. He concedeed 5 goals. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr.\n\nAfter that, Hasagić was a member of Altay in Turkey but didn't see much first team football. He went back to Bosnia and played for Rudar Kakanj and Bosna Visoko. In 2003, he signed a contract with Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnia and Herzegovina national team.\n\nDuring the 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. In 2007, he moved over to another Turkish Süper Lig side in İstanbul Başakşehir. In 2012, Hasagić retired from football early after injuries shattered his career.\n\nInternational career [ edit ]\n\nHasagić made his debut for Bosnia and Herzegovina in a September 2002 European Championship qualification match against Romania and has earned a total of 44 caps, scoring no goals.[2] His final international was an October 2011 European Championship qualification match against France.[3]\n\nManagerial career [ edit ]\n\nIn August 2017, Hasagić became the new goalkeeping coach of Bosnian Premier League club Mladost Doboj Kakanj.[4] Two years later, on 2 November 2019, he announced that he left Mladost and that he will only be focusing on the Bosnia and Herzegovina national team.[5]\n\nOn 4 January 2018, after Robert Prosinečki was named the new head coach of the Bosnia and Herzegovina national team, it was announced that Hasagić became the new goalkeeping coach of the national team.[6] Hasagić left the national team in November 2019 with the sacking of Prosinečki.[7]\n\nIt was announced on 7 January 2020 that Hasagić took over the position of goalkeeping coach of another Bosnian Premier League club, Tuzla City, working alongside former national team teammate, good friend, and godfather Elvir Baljić, the club manager at the time.[8] He decided to leave the club in June 2021.[9]\n\nOn 9 July 2021, Hasagić became the new goalkeeping coach of his former club Željezničar.[10]\n\nPersonal life [ edit ]\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam. On 27 December 2009, Hasagić confirmed he divorced his wife Dijana after 9 years of marriage.\n\nAfter his divorce, he has been in a long term relationship with a model, Aminka Sivac. He is 15 years older than her.[11] On 8 July 2019, Hasagić married Sivac. Former national team teammate Elvir Baljić was the best man at his wedding.[12]\n\nCareer statistics [ edit ]\n\nInternational [ edit ]\n\nNational team Year Apps Goals Bosnia and Herzegovina 2002 1 0 2003 7 0 2004 2 0 2005 7 0 2006 6 0 2008 5 0 2009 3 0 2010 6 0 2011 7 0 Total 44 0\n\nHonours [ edit ]\n\nPlayer [ edit ]\n\nŽeljezničar[1]"}, {"url": "https://prabook.com/web/kenan.hasagic/2130128", "page_content": "Kenan Hasagic\n\nassociation football player\n\nFebruary 1, 1980 Kakanj, Kakanj Municipality, Bosnia and Herzegovina\n\nHis football career began in his hometown with FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnian national team In 2004-2005 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. He made his debut for national team on 12 February 2003 in a game between Wales and Bosnia and Herzegovina which ended in a 2–2 draw."}, {"url": "https://korner.ba/kenan-hasagic-biografija/", "page_content": "Kenan Hasagić biografija golmana koji je OSAM GODINA branio mrežu Reprezentacije BiH i istovremeno čuvao Željezničar.\n\nRođen je 1. februara 1980. godine u Kaknju. Priključuje se omladinskom sistemu Rudara, te sa 16. godina ostvaruje svoj prvi profesionalni nastup za seniorski tim. Jedna sezona u kojoj se ostvario 14 nastupa bila je dovoljna da mu austrijski Vorwärts Steyr da šansu.\n\nOdlazak iz Kaknja ogromna pogreška?\n\nOdlazak u Vorwärts za Hasagića nije bio uspješan. Dobio je ugovor na jednu godinu te iako je upisao 21 nastup nije uspio uvjeriti klub da mu produže ugovor.\n\nNakon Austrije Hasagić odlazi u Tursku kako bi igrao za Altay. Uspio je uvezati 42 nastupa i dvije sezone u turskom klubu bije nego što je ponovo ostao bez kluba.\n\nSa 20 godina i već dva kluba iza sebe Hasagić je odlučio da se vrati u rodnu BiH kako bi ponovo vratio formu koju je pokazivao kao omladinski igrač.\n\nPotpisuje za Bosnu iz Visokog za koju upisuje 8 nastupa, te narednu sezonu vraća se u Kakanj kako bi igrao za Rudar. Uspješna sezona sa Rudarom privukla je pažnju Željezničara za koji potpisuje 1. jula 2002. godine.\n\nSa dolaskom u FK Željezničar, Hasagić je shvatio da mu je ovo odlična prilika te je vezao odličan nastup za odličnim nastupom.\n\nU samo dvije sezone sa Željezničarom upisao je 55 nastupa i osvojio svoj prvi i jedini trofej u karijeru, a to je bio Kup BiH u sezoni 2002/2003.\n\nKenan Hasagić je definitivno jedan od najboljih golamana u historiji BH fudbala\n\nKvalitetni nastupi u Željezničaru su naveli tadašnjeg selektora reprezentacije BiH da mu da šansu, te Hasagić postaje prvi golman reprezentacije BiH.\n\nDruga šansa u Turskoj koju nije propustio\n\nKenan Hasagić sredinom 2004. godine ponovo se seli u Tursku, ali ovaj put oblači dres Gaziantepspora, te postaje standardan u startnoj postavi.\n\nKroz tri godine sa Gaziantepsporom pokazao je koliko je konstantan i pouzdan golman te također da povrede ne utiču mnogo na njega. Upisao je 86 nastupa i postao favorit turskog kluba.\n\nU 2007. godini čini svoj posljednji transfer u karijeri i prelazi u Istanbul Basaksehir. Iako se tada Basaksehir nije borio za titulu i nije predstavljao preveliku prijetnju velikoj trojci Hasagić se uvijek trudio da svoj klub stavi u najbolju moguću poziciju.\n\nČinjenica da je Hasagić nakon završetka svoje karijere ostao u fudbalu kao trener golmana pokazuje koliko voli ovaj sport i koliko voli golmansku poziciju.\n\nOdlazi iz Basaksehira kao omiljen među navijačima i svojim kolegama igračima. Zvanično se penzionisao 2012. godine nakon pet godina u klubu i upisanih 97 nastupa.\n\nKenan je u svojevremeno bio zaposlen u bh. premijerligašu Tuzla City kao trener golmana u stručnom štabu kojeg je predvodio trener Nermin Bašić. Prethodno je bio trener golmana Mladosti iz Doboja kod Kaknja te reprezentacije BiH.\n\nKenan Hasagić je ostavio neizbrisiv tragu u dresu reprezentacije BiH\n\nDres reprezentacije BiH je nosio 8 godina\n\nDakle, debi za seniorsku reprezentaciju Bosne i Hercegovine Hasagić je napravio u februaru 2003. godine na prijateljskom meču protiv Walesa koji je završen rezultatom 2:2.\n\nNo, prije dolaska u seniorsku reprezentaciju BiH, Kenan Hasagić je branio za U21 selekciju BiH za koju je upisao šest nastupa.\n\nOd debija protiv Walesa 2003. godine, Kenan Hasagić je bio neizostavan dio spiska selektora Blaža Sliškovića. Dolaskom Fuada Muzurovića, Hasagić nije dolazio na okupljanja reprezentacije BiH, a njegovo mjesto zauzeo je Adnan Gušo.\n\nKenan se na gol reprezentacije BiH vratio u kvalifikacijama za EURO 2008 kada je branio na četiri meča.\n\nOpet je uslijedila pauza od nacionalnog dresa, da bi među stative ponovo stao u prijateljskom meču protiv Japana 2008. godine.\n\nKenan Hasagić vs David Villa\n\nNa otvaranju kvalifikacija za Svjetsko prvenstvo u Južnoj Africi 2010. godine, BiH je gostovala kod reprezentacije Španije gdje je poražena minimalnim rezultatom 1:0.\n\nNa tom meču Kenan Hasagić urezao se u srca svih bh. navijača kada je poslao vrsnog napadača Davida Villu, ni manje ni više, nego po “ćevape”.\n\nU baražu za odlazak na pomenuto takmičenje Hasagić je branio u obje utakmice, ali nažalost selekcija BiH je ostala bez plasmana na Mundijal 2010. godine.\n\nNakon toga, nastavio je Kenan Hasagić biti standardan u kvalifikacijama za EURO 2012. godine.\n\nPosljednji susret u dresu reprezentacije BiH, Hasagić je odigrao u Parizu 2011. godine kada je BiH remizirala protiv Francuske 1:1, ali nažalost utakmicu je napustio nakon 45 minuta zbog povrede.\n\nU tih devet godina u dresu reprezentacije BiH, Hasagić je branio 43 puta.\n\nZa kraj vam donosimo kompilaciju najboljih poteza koje je Kenan Hasagić napravio u karijeri.\n\nPREPORUČENO ZA VAS:"}, {"url": "https://everything.explained.today/%5C/Kenan_Hasagi%C4%87/", "page_content": "Kenan Hasagić Explained\n\nKenan Hasagić (pronounced as /xâsaɡitɕ/; born 1 February 1980) is a Bosnian retired professional football goalkeeper[1] and current goalkeeping coach of Bosnian Premier League club Željezničar.\n\nClub career\n\nHasagić's football career began in his hometown with Rudar Kakanj. At the age of 16, he made his debut in a first division match. He concedeed 5 goals. He was the most promising goalkeeper in Bosnia and Herzegovina, he played for youth selections and was later transferred to Austrian side Vorwärts Steyr.\n\nAfter that, Hasagić was a member of Altay in Turkey but didn't see much first team football. He went back to Bosnia and played for Rudar Kakanj and Bosna Visoko. In 2003, he signed a contract with Željezničar. Here he found good form and even became first choice goalkeeper for the Bosnia and Herzegovina national team.\n\nDuring the 2004–05 season, he moved to Turkey once again where he signed for Turkish Süper Lig side Gaziantepspor. In 2007, he moved over to another Turkish Süper Lig side in İstanbul Başakşehir. In 2012, Hasagić retired from football early after injuries shattered his career.\n\nInternational career\n\nHasagić made his debut for Bosnia and Herzegovina in a September 2002 European Championship qualification match against Romania and has earned a total of 44 caps, scoring no goals.[2] His final international was an October 2011 European Championship qualification match against France.[3]\n\nManagerial career\n\nIn August 2017, Hasagić became the new goalkeeping coach of Bosnian Premier League club Mladost Doboj Kakanj.[4] Two years later, on 2 November 2019, he announced that he left Mladost and that he will only be focusing on the Bosnia and Herzegovina national team.[5]\n\nOn 4 January 2018, after Robert Prosinečki was named the new head coach of the Bosnia and Herzegovina national team, it was announced that Hasagić became the new goalkeeping coach of the national team.[6] Hasagić left the national team in November 2019 with the sacking of Prosinečki.[7]\n\nIt was announced on 7 January 2020 that Hasagić took over the position of goalkeeping coach of another Bosnian Premier League club, Tuzla City, working alongside former national team teammate, good friend, and godfather Elvir Baljić, the club manager at the time.[8] He decided to leave the club in June 2021.[9]\n\nOn 9 July 2021, Hasagić became the new goalkeeping coach of his former club Željezničar.[10]\n\nPersonal life\n\nIn 1998, Hasagić met his future wife, Dijana, in Jablanica. They were married in 2000. They have three daughters together: Ilda, Iman and Inam. On 27 December 2009, Hasagić confirmed he divorced his wife Dijana after 9 years of marriage.\n\nAfter his divorce, he has been in a long term relationship with a model, Aminka Sivac. He is 15 years older than her.[11] On 8 July 2019, Hasagić married Sivac. Former national team teammate Elvir Baljić was the best man at his wedding.[12]\n\nCareer statistics\n\nInternational\n\nNational team Year Apps Goals Bosnia and Herzegovina 2002 1 0 2003 7 0 2004 2 0 2005 7 0 2006 6 0 2008 5 0 2009 3 0 2010 6 0 2011 7 0 Total 44 0\n\nHonours\n\nPlayer\n\nŽeljezničar[1]\n\n2002–03\n\nExternal links\n\nKenan Hasagić at TFF.org\n\n\n\nNotes and References"}, {"url": "https://www.soccerway.com/players/kenan-hasagic/5043/", "page_content": "Matches of K. Hasagić\n\nCopyright ©2023 Perform Group. All rights reserved.\n\nData provided by Opta Sports. Articles provided by OMNISPORT."}, {"url": "https://en-academic.com/dic.nsf/enwiki/1159695", "page_content": "Football player infobox\n\nplayername = Kenan Hasagić\n\n\n\n\n\nfullname = Kenan Hasagić\n\ndateofbirth = Birth date and age|1980|2|1|\n\ncityofbirth = Kakanj\n\ncountryofbirth = SFR Yugoslavia\n\nheight = height|m=1.86\n\ncurrentclub = Istanbul BB\n\nclubnumber = 1\n\nposition = Goalkeeper\n\nyouthyears = 1994-1998\n\nyouthclubs = FK Rudar Kakanj Mladost Mostar\n\nyears = 1998-1999 1999-2001 2001-2002 2001-2002 2002-2004 2004-2007 2007-\n\nclubs = SK Vorwärts Steyr Altay SK FK Rudar Kakanj FK Bosna FK Željezničar Gaziantepspor Istanbul BB\n\ncaps(goals) = 0 21 0 (0) 0 42 0 (0) 0 11 0 (0) 0 0 8 0 (0) 0 55 0 (0) 0 76 0 (0) 0 28 0 (0)\n\nnationalyears = 2003-\n\nnationalteam = Bosnia and Herzegovina\n\nnationalcaps(goals) = 0 25 0 (0)\n\nKenan Hasagić (born February 1 , 1980 in Kakanj ) is a Bosnian football goalkeeper .\n\nHis football career began in his hometown with the local FK Rudar. At the age of 16, he made his debut in a first division match. He was the most promising goalkeeper in Bosnia-Herzegovina, he played for junior selections and was later transferred to Austria n side Vorwärts Steyr. After that, he was a member of Altay SK in Turkey but never actually secured a first team football. He went back to Bosnia and played for Bosna Visoko. In 2003, he signed a contract with FK Željezničar . Although he spent only two seasons there, he will be remembered as the best goalkeeper in league, and one of the best in club's history. He has found a good form there and even became first choice goalkeeper for Bosnian national team. In 2004/2005 season, he moved to Turkey once again where he signed for Turkish League side Gaziantepspor . He sign for İstanbul Büyükşehir Belediyespor .\n\nHe made his debut for national team on February 12 , 2003 . in a game between Wales and Bosnia-Herzegovina which ended in a 2-2 draw. He is very good in one-on-ones and in the air. He mainly has sharp reflexes, but can sometimes \"fall asleep\" and concede long range shots.\n\nCareer\n\n* FK Rudar Kakanj\n\n* SK Vorwärts Steyr\n\n* Altay SK\n\n* NK Bosna Visoko\n\n* FK Željezničar\n\n* Gaziantepspor\n\n* İstanbul Büyükşehir Belediyespor\n\nExternal links"}, {"url": "https://www.howold.co/person/adnan-guso/biography", "page_content": "Adnan Gušo Biography\n\nAdnan Gušo (born 30 November 1975) is a Bosnian retired professional football goalkeeper and current goalkeeping coach. During his playing career, Gušo played for many clubs across Europe.\n\nClub career\n\nBosnia and Herzegovina\n\nBorn in Sarajevo, Gušo started his career at hometown club Željezničar. He was usually a regular first team choice and in 1998 he won a championship *le. Soon he went abroad. After a short spell in Turkish Erzurumspor and Spartak Moscow, he signed a one-year contract with FK Sarajevo in summer 2002. Gušo shortly after went to Romania, where he played for several clubs. While in Bosnia, Gušo won three league *les, one cup and one supercup, all while playing for Željezničar.\n\nRomania\n\nGušo was signed a three-and-a-half year contract with FC Universitatea Craiova in January 2003, on free transfer.\n\nAfter the relegation, he signed for FC Dinamo București in summer 2005 where he won the 2005 Romanian Supercup and then in January 2006 he signed a two-year deal with FC Argeş Piteşti.\n\nCyprus\n\nIn January 2008, he moved to Olympiakos Nicosia but left the club the same year.\n\nReturn to Željezničar\n\nIn 2009, Gušo was named the goalkeeping coach of the first team of Željezničar. In 2011, he came out of retirement and played one more season for the club. He was still in the same time the goalkeeping coach. He won the double that season and once again retired.\n\nInternational career\n\nGušo made his debut for Bosnia and Herzegovina in an October 1999 UEFA Euro qualification match away against Scotland and has earned a total of 22 caps, scoring no goals.\n\nHe was not called up to Blaž Slišković's squad for the first four matches of UEFA Euro 2008 qualifying. At that time the first and second choice goalkeepers were Kenan Hasagić and Almir Tolja. Due to Fuad Muzurović’s appointment as head coach, both were dropped and Gušo played the remaining 8 games as first choice. His final international was a November 2007 UEFA Euro qualification match against Turkey.\n\nCoaching career\n\nGušo started his goalkeeping coach career in 2009 after finishing his career. He was appointed as a goalkeeper coach at Željezničar after Amar Osim was named manager. After 2 years as coach, Gušo paused his coaching career so that he could come out of retirement to once again be a player at Željezničar for one season.\n\nIn 2016, 4 years after finishing his playing career for a second time, he went back to coaching as he was appointed as the goalkeeper coach of the Bosnia and Herzegovina national team.\n\nIn July 2018, almost a year after leaving the national team, Gušo became the goalkeeper coach in the Youth Academy of Željezničar.\n\nOn 3 January 2019, he left the Youth Academy to once again become the goalkeeper coach in the first team of Željezničar after negotiations with Amar Osim who was in late December 2018 for a third time in his managerial career appointed as the manager of the club. In the middle of a seven game winless run in the 2020–21 league season, on 5 April 2021, Gušo decided to leave Osim's first team coaching staff and returned to Željezničar's Youth Academy.\n\nHonours\n\nPlayer\n\nŽeljezničar\n\nBosnian Premier League: 1997–98, 2000–01, 2001–02, 2011–12\n\nBosnian Cup: 2000–01, 2011–12\n\nBosnian Supercup: 1998\n\nDinamo București\n\nSupercupa României: 2005\n\nReferences\n\nExternal links"}, {"url": "https://uk.soccerway.com/players/kenan-hasagic/5043/", "page_content": "Matches of K. Hasagić\n\nCopyright ©2023 Perform Group. All rights reserved.\n\nData provided by Opta Sports. Articles provided by OMNISPORT."}]}