{"Gordon Hogg was re-elected in the 2005, 2009, and 2013 provincial elections.": [{"url": "https://link.springer.com/article/10.1007/s10644-017-9215-4", "page_content": "In this section, we discuss our key findings. To that effect, we assess the cyclicality of total expenditure and its components. We investigate the role of the phase of growth regime and the 1994 reform. Lastly we analyze the heterogeneity across provinces and the related driving factors.\n\n4.1 Cyclicality of expenditure\n\n4.1.1 Baseline\n\nWe first investigate whether sub-national public spending is acyclical, counter-cyclical or pro-cyclical, at the provincial level. We estimate Eq. (3).\n\nTable 2 reports in the first two columns, the difference and system GMM of the cyclicality of real public expenditure across provinces. The optimal lag structure of internal instruments is 3. Based on the classical appraisal criteria, the GMM results are not internally consistent with our provincial dataset. The GMM technique is very sensitive to the risk of proliferation of instruments. Depending on the lags chosen, the number of instruments can be larger than the cross-sectional dimension and create an over-identification bias. The number of instruments outweighs the cross-sectional dimension, and the model is over-identified, with the probability for the Sargan-Hansen test of over-identifying restrictions being well above the accepted thresholds in the literature (even following Roodman’s 2009 strategy).Footnote 14 The results reported in Table 2 show that p-values of Hansen tests are 1. The issue is even more pronounced when splitting the sample or including interaction terms as done later in this paper.\n\nTable 2 Cyclicality of provincial expenditure, 1978–2013 Full size table\n\nThe two last columns report the FE estimates of the Eq. (3) with and without the lagged dependent variable to assess the influence of the possible Nickell’s bias discussed above. The results remain broadly stable suggesting that the bias does not alter significantly the estimates. Moreover, the Nickell bias diminishes asymptotically toward zero as the time dimension of the panel increases (Beck and Katz 2011). In our case with 35 years of data, the Nickell bias is small giving support to the fixed effects results without the lagged dependent variable. Because of these reasons, as discussed above, the fixed effect estimator is preferred. We also re-estimate Eq. (3) using lagged GDP growth. The results remain broadly unchanged indicating that the results are not driven by reverse causality (Appendix 1).\n\nWe find that the coefficient associated with output growth is stable across both specifications. In addition, the R-squared remains unchanged at 0.6 with and without the lagged dependent variable. The results are like those in the empirical literature (Carmignani and Laurenceson 2013). There is strong evidence that provincial expenditure is pro-cyclical. The coefficient of output growth is positive, statistically significant at the 1% level, but below 1. A 1% increase in provincial output is associated with an increase in provincial public expenditure of 0.4%. In other words, a one standard deviation (i.e. 0.06) increase (decrease) in the output growth rate is associated with 0.02 increase (decrease) in spending. These estimates are robust to the use of a filtering technique to extract any cyclical components of output and expenditure (see Appendix 2). The coefficient of the output cycle remains positive, statistically significant at the 1% level, but below 1. In what follows, we shed further light on the pro-cyclical nature of provincial public spending in China.\n\n4.1.2 Spending categories\n\nWe split provincial spending into capital and current expenditure and their subcomponents. A subcomponent approach is useful to understand how the pro-cyclical behavior plays out, and to help avoid reaching misleading conclusions that could arise from broad aggregates, especially if subcomponents move in offsetting ways (Lane 2003). In the context of the Chinese provinces, we measure capital expenditure as the sum of capital construction and innovation funds. Current expenditure covers the remaining expenditure and includes support to agriculture, social expenditure (including culture, education, science, and health care), and expenditure related to government administration. The results are shown in Table 3. We find that pro-cyclicality exists (and is statistically significant at the 5% level) when considering current expenditure and capital expenditure as dependent variables.\n\nTable 3 Cyclicality of components of expenditure, 1978–2013 Full size table\n\nAll sub-categories of current spending are found to be pro-cyclical. The pro-cyclicality of spending related to government administration is twice as high. As suspected, capital expenditure tends to be slightly more pro-cyclical than current expenditure. For a 1% increase in provincial output, capital expenditure tends to increase by 0.43% while current spending increases less, by about 0.37%. The pro-cyclicality capital expenditure is mostly driven by the changes in construction funds. Spending related to innovation funds are acyclical. Capital expenditure is more responsive to economic cycles, since in periods of low growth the government has more leeway to cut or postpone capital expenditure compared to current expenditure, which is often statutory in nature, already committed, or non-discretionary.\n\n4.1.3 Growth regimes\n\nWe test whether the pro-cyclicality of provincial expenditure depends on the position of the economy in the cycle. Two complementary arguments are proposed in the literature to support the rationale of asymmetric conduct of fiscal policy over the business cycle. Talvi and Vegh (2005) suggested that fiscal pro-cyclicality may be fueled by political pressure to spend windfall revenues in good times. Whereas Gavin and Perotti (1997) suggested that the pro-cyclical behavior might arise in times of low growth when fiscal authorities are shut out of markets obliging them to cut expenditure. For China, we suspect that in periods of good times and high tax intake, the leaders will be more sensitive to political pressure for more expenditure. Moreover, financial constraints will relax in good times.\n\nDistinguishing the phases of the business cycle in China might be tricky. The country has experienced steady two-digit growth rates over recent decades. In the paper, we use a simple rule by computing, for each province, the deviation from the average growth rate over the period 1978–2013 (Y*).Footnote 15 We generate a dummy variable taking the value 1 if the growth in year t is above Y* and 0 otherwise. This dummy is interactive with the growth. The same approach is followed for the periods of growth below the average. The results are shown in Table 4.\n\nTable 4 Cyclicality of provincial expenditure and growth regime, 1978–2013 Full size table\n\nWe find that pro-cyclicality occurs in both phases of the cycle. The estimated coefficients for total expenditure significant at 1% and similar in magnitude at around 0.4%. Provincial expenditure consistently follows the cycle irrespective of periods of low or high growth rates for all categories of expenditure. As seen above, a 1% increase in provincial output is associated with a less than proportional increase in provincial public expenditure.\n\n4.1.4 1994 fiscal reform\n\nWe explore the effect of the 1994 reform on the cyclicality of provincial expenditure. As discussed above, in 1994 a structural shift occurred in China’s decentralization system. Provinces were given more autonomy which has an influence on the conduct of local fiscal policy. We introduce additively and multiplicatively (with Δ Log Yit), a dummy variable taking the value 1 after 1994 and 0 before. The results are shown in Table 5.\n\nTable 5 Impact of 1994 reform, 1978–2013 Full size table\n\nIt turns out that pro-cyclicality has markedly intensified with the increased autonomy of provincial leaders. The coefficient associated with Δ Log Y it is positive, statistically significant at the 1% level, and estimated at 0.23. The coefficient associated with the interactive term is positive, statistically significant at the 1% level, and estimated at 0.45. In other words, cyclical pro-cyclicality almost tripled after 1994. A similar pattern is observed in the pro-cyclicality of current expenditure which more than doubled. The change is stronger for capital spending which moved from acyclical before 1994 to highly pro-cyclical after the implementation of the reforms.\n\nThe reforms have resulted in more pro-cyclicality in provincial expenditure. With more autonomy over the expenditure assignments and revenue collection and the rating system described above, provincial fiscal authorities have used expenditure in procyclical way that is accelerating spending in periods of high growth and slowing it down in times of low growth.\n\n4.1.5 Graduating class\n\nWe explore the heterogeneity of pro-cyclicality among provinces, whether some provinces could mitigate the pro-cyclicality bias over time, especially after the 1994 reform despite the general trend of increasing pro-cyclicality documented above. In this regards, we follow Frankel et al. (2013) who showed that over the last decade, several developing countries were able to “graduate” in the sense of overcoming the problem of pro-cyclicality and becoming countercyclical.\n\nFor China, we estimate the province specific cyclical response of public spending to growth (\\(\\hat{\\beta}_{i}\\)) over the period 1978–2013, and subsequently for 1978–1993 and 1994–2013. Table 6 gives the value of the \\(\\hat{\\beta}_{i}\\) coefficients by province, and highlights the changes over time of the cyclical coefficients. In line with the findings above, none of the provinces conduct a counter-cyclical policy, but we observe a strong heterogeneity among provinces and over time. We follow Frankel et al.’s (2013) classification to illustrate graduation among Chinese provinces.\n\nTable 6 Cyclicality by province: testing for graduation, 1978–2013 Full size table\n\nWe find that about one-third of the provinces were able to avoid or escape from the pro-cyclicality bias. These are the so-called recent and established graduates. The recent graduates group includes 6 provinces (Gansu, Guizhou, Inner Mongolia, Qinghai, Shaanxi, and Sichuan) that reduced the degree of pro-cyclicality over time. They have “graduated” from pro-cyclical expenditure (significant positive \\(\\hat{\\beta}_{i}\\)) before the reform to countercyclical spending (significant negative \\(\\hat{\\beta}_{i}\\)) or acyclical (insignificant \\(\\hat{\\beta}_{i}\\)) after 1994. The established graduates group includes 5 provinces (Heilongjiang, Jilin, Ningxia, Xinjiang, and Zhejiang) that have always been countercyclical (significant negative \\(\\hat{\\beta}_{i}\\)) or acyclical (insignificant \\(\\hat{\\beta}_{i}\\)). The rest of the provinces can be categorized into the so-called still-in-school and back-to-school groups. The still-in-school group comprises 6 provinces (Beijing, Chongqing, Guangdong, Hunan, Shanghai, and Shanxi) for which pro-cyclicality continued after the reform (significant positive \\(\\hat{\\beta}_{i}\\) before and after 1994). The back-to-school group is quantitatively the biggest (13 provinces: Anhui, Fujian, Guangxi, Hainan, Hebei, Henan, Hubei, Jiangsu, Jiangxi, Liaoning, Shandong, Tianjin, and Yunnan) and is characterized by an amplification of the pro-cyclicality of public expenditure. These provinces were countercyclical (significant negative \\(\\hat{\\beta}_{i}\\)) or acyclical (insignificant \\(\\hat{\\beta}_{i}\\)) before 1994 and pro-cyclical (significant positive \\(\\hat{\\beta}_{i}\\)) after the reform.\n\n4.2 Driving factors\n\nIn this section, we study the determinants of the cyclicality of provincial expenditure. We first estimate the time varying β coefficient from Eq. (3). As evidenced above, pro-cyclicality is the prominent feature of provincial public spending. The average estimated coefficient is 0.5. In Fig. 1, about 92% province-year observations of the estimated \\(\\hat{\\beta}_{i}\\) are found to be associated with procyclical stance. We therefore proceed by estimating Eq. (4) depending on data availability. The sample size is constrained by the availability of the data, especially information on corruption, government efficiency, and the NERI index (see Sect. 4).Footnote 16 The Tibet province is excluded because of the lack of data on the drivers. Results are reported in Table 7.\n\nFig. 1 Source Authors Histogram of the time-varying \\(\\hat{\\beta}_{i}\\) coefficients. Full size image\n\nTable 7 Determinants of the cyclicality of provincial expenditure, 1978–2013 Full size table\n\nAs expected, when the financial constraints are relaxed (an increase in the loan-to-deposit ratio) fiscal policy becomes less pro-cyclical for the period 1978–2013. The corresponding estimated coefficient is negative and statistically significant at the 1% level. A one standard deviation increase in the loan-to-deposit ratio is associated with about 21.6% decrease in the average pro-cyclicality. It is worth noting that the loan-to-deposit variable becomes insignificant statistically when the quality of institution is controlled for on the shorter sample. This might reflect a strong correlation between the financial development and the quality of institution generating a collinearity bias.\n\nAmong the political factors, only the RPL appears to be significant: we find that the coefficient associated with RPL is negative. A longer RPL induces the leader to pursue a more prudent fiscal policy. A one standard deviation increase in the RPL is associated with about 13–16% decrease in the average pro-cyclicality. However, the RPL is no longer significant when the quality of institution is controlled for on the shorter sample. This suggests that the effect of the RPL on the cyclicality of provincial expenditure operates through the quality of institutions.\n\nThe quality of the institutions is found to be a key mitigating factor of a pro-cyclical fiscal policy. Because of data limitations, we are only able to cover the quality of institutions for the 1998–2013 period. Provinces with more corruption cases are characterized by stronger pro-cyclicality. The estimated coefficient is positive, statistically significant at the 10% level. A one standard deviation increase in the corruption index is associated with about 4–4.5% increase in the average pro-cyclicality. In the same vein, pro-cyclicality of public spending is lower when governments can efficiently deliver public goods and services and address corruption. We find that a higher government efficiency is negatively and statistically associated with the cyclicality coefficient. A one standard deviation increase in the government efficiency index is associated with about 11% decrease in the average pro-cyclicality.\n\nStructural factors are found to be significant drivers of the cyclicality of provincial spending. As expected, government size is negatively and significantly associated with lower pro-cyclicality. The estimated coefficient is negative, statistically significant at the 10% level. Large provincial governments tend to embark on countercyclical policy (lower procyclicality) which is associated with lower growth volatility (as evidenced by van den Noord 2000). The level of development significantly lowers pro-cyclicality during the most recent period (1998–2013).\n\nThe remaining suspected variables are not statistically significant. The marketization index is not significant. Provinces that are more affected by shocks, proxied by the output volatility, are not more prone to pro-cyclical spending. Trade openness does not significantly impact cyclicality as well as the lagged deficit to GDP ratio."}, {"url": "https://www.peacearchnews.com/news/gordie-hogg-announces-run-for-surrey-mayors-chair/", "page_content": "Surrey First announced Wednesday its mayoral and council candidates for this fall’s municipal election: (left to right) Mary-Em Waddington, Gordie Hogg – who will run for mayor – Linda Annis and Bilal Cheema. (Contributed photo)\n\nOne of the Semiahmoo Peninsula’s most experienced politicians is running for Surrey mayor in this fall’s municipal election.\n\nOn Wednesday, Gordie Hogg announced that he will run for the mayor’s seat with the city’s Surrey First slate, citing improved access to city hall as a key plank in his platform, while also noting that he doesn’t think the city’s “enormous potential” is currently being realized.\n\n“The multicultural, pluralistic nature of Surrey best reflects (Canada)… and I’ve been disappointed with some of the divisive nature that has taken place, the conflict that has been in existence (in the city), and I think we need to come together and realize what opportunities we have in Surrey to be a leading city in Canada,” he told Peace Arch News.\n\n“We’re unique in that we have parkland, agricultural land… heavy industrial, light industrial – we have everything that we need to be the leading city in Canada, where we can be compared to Toronto and Ottawa and Montreal and Vancouver.\n\n“We’re on the Canada-U.S. border, and we have access to the ocean – we just have so much potential, and I’ve been disappointed that we haven’t been realizing that, and instead have spent too much time debating.”\n\nThe Surrey First announcement came Wednesday morning during an event at Surrey’s Civic Hotel. Also announced were three Surrey First council candidates – incumbent Linda Annis, plus two new faces, Bilal Cheema and Mary-Em Waddington.\n\nIn a press release issued Wednesday, Annis said Hogg “will be a breath of fresh air at city hall because he always listens, and his reputation for honesty and integrity will be a refreshing change, which means Surrey voters will always be welcome at their city hall.”\n\nHogg also noted that Surrey residents’ ability to access city hall needs improvement, and pitched a few ideas to make that possible – from expanded operating hours in city departments to holding council meetings throughout the city, rather than solely at city hall.\n\n“I think we need to open things up,” he said. “It’s a big city, and there are opportunities for all kinds of questions to be asked, and that’s been prohibited in the last little while.”\n\nOver the last few decades, Hogg, 75, has been a politician at all levels of government. He served as a White Rock city councillor from 1974 until 1984, then was mayor from ’84 until 1993. Moving on from the municipal arena, he was elected as a BC Liberal MLA in the Surrey-White Rock riding in 1997 and was re-elected four times before retiring from provincial politics in 2013.\n\nHe was subsequently elected Liberal MP for White Rock–South Surrey in 2017 in a byelection prompted by the resignation of sitting Conservative MP Dianne Watts – herself a former Surrey mayor – but Hogg lost the seat in 2019 to Conservative challenger Kerry-Lynne Findlay, who also won a rematch during last year’s federal election of 2021.\n\nEarlier this spring, Hogg told PAN he was mulling a mayor’s run in either Surrey or White Rock.\n\nHogg is the fifth candidate to announce a Surrey mayoralty run. Current Mayor Doug McCallum has said he plans to run for re-election, while current councillor Brenda Locke, Surrey MLA Jinny Sims, and Surrey MP Sukh Dhaliwal – who announced his candidacy and his new slate, United Surrey, Monday – are also running for the city’s top political seat.\n\nDespite so many experienced, well-known politicians running, Hogg said he wasn’t concerned with vote-splitting or with the idea that, potentially, candidates could have similar platforms.\n\n“My perspective is that the people of Surrey deserve a number of different visions and options to choose from,’ Hogg said. “People running for mayor and for council should be challenged, and should have to explain what their vision is… Access, opportunity, the police transition – people should be able to challenge each one of us on these issues, and then decide what works best for them.\n\n“That’s how democracies are most effective.”\n\n\n\neditorial@peacearchnews.com\n\nLike us on Facebook and follow us on Twitter\n\nBC municipal electionCity of SurreyMayor's Race"}, {"url": "https://www.celebsagewiki.com/christy-clark", "page_content": "Age, Biography and Wiki\n\nChristy Clark (Christina Joan Clark) was born on 29 October, 1965 in Burnaby, Canada, is a Former Premier of British Columbia. Discover Christy Clark's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 57 years old?\n\nPopular As Christina Joan Clark Occupation N/A Age 57 years old Zodiac Sign Scorpio Born 29 October 1965 Birthday 29 October Birthplace Burnaby, Canada Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 29 October. She is a member of famous Former with the age 57 years old group.\n\nChristy Clark Height, Weight & Measurements\n\nAt 57 years old, Christy Clark height not available right now. We will update Christy Clark's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Christy Clark's Husband?\n\nHer husband is Mark Marissen (m. ?–2008)\n\nFamily Parents Not Available Husband Mark Marissen (m. ?–2008) Sibling Not Available Children Hamish Marissen-Clark\n\nChristy Clark Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Christy Clark worth at the age of 57 years old? Christy Clark’s income source is mostly from being a successful Former. She is from Canada. We have estimated Christy Clark's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Former\n\nChristy Clark Social Network\n\nTimeline"}, {"url": "https://fr.wikipedia.org/wiki/Gordon_Hogg", "page_content": "Pour les articles homonymes, voir Hogg.\n\nCet article est une ébauche concernant un homme politique canadien et la Colombie-Britannique. Vous pouvez partager vos connaissances en l’améliorant (comment ?) selon les recommandations des projets correspondants.\n\nGordon Hogg (né le ) est un homme politique canadien.\n\nIl est député libéral de Surrey-Sud—White Rock à la Chambre des communes du Canada de 2017 à 2019.\n\nIl a auparavant été député libéral provincial de Surrey—White Rock à l'Assemblée législative de la Colombie-Britannique de 2011 à 2017.\n\nÉtudes et vie privée [ modifier | modifier le code ]\n\nFils d'Al Hogg, éminent médecin de White Rock (une aile de l'hôpital Peace Arch est nommée en son honneur), il obtient un baccalauréat en sociologie et en psychologie à l'Université de la Colombie-Britannique, puis une maîtrise en psychologie à l'Antioch College (Ohio). Alors qu'il est âgé de 70 ans et est député provincial, il complète un doctorat interdisciplinaire axé sur les politiques publiques à l'Université Simon Fraser.\n\nAvant son élection à l'Assemblée législative de la Colombie-Britannique il a été conseiller, agent de probation puis directeur régional des services correctionnels.\n\nIl vit à White Rock avec sa femme LaVerne et ont un fils.\n\nVie politique provinciale [ modifier | modifier le code ]\n\nVie politique fédérale [ modifier | modifier le code ]\n\nDianne Watts, ex-mairesse de Surrey et députée conservatrice de Surrey-Sud—White Rock démissionne en septembre 2017 pour se lancer dans la course à la chefferie du Parti libéral de la Colombie-Britannique[1]. Les conservateurs investissent Kerry-Lynne Findlay, députée de la circonscription voisine de Delta—Richmond-Est et plusieurs fois ministre, battue en 2015[2]. Le parti libéral du Canada investi alors Gordon Hogg, récemment retiré de politique provinciale, pour tenter de gagner cette circonscription, qui leur aait échappé de justesse en 2015[3]. Le 11 décembre 2017, il amène la circonscription dans l'escarcelle des libéraux avec un peu plus de 1600 voix d'avance[4].\n\nÀ la suite de la démission de Dianne Watts"}, {"url": "https://ojs.unbc.ca/index.php/cpsr/article/view/252", "page_content": "Completing the ‘Three-Peat’: Recent Provincial Elections in British Columbia\n\nPatrick J. Smith\n\nAbstract\n\nBritish Columbia held its 39th General Election on May 12, 2009. It produced a result very close to the previous election in May, 2005, with Gordon Campbell’s Liberal Government returned with 48% of the popular vote and 49 of 85 seats (or 57.6% of the MLA’s) in an expanded British Columbia legislature. For Gordon Campbell, his victory to a third term made him only the fourth Premier in British Columbia to be elected for a third term, and the first since William Bennett and the Socreds from the mid 1970’s to the mid 1980’s.\n\nUntil Gordon Campbell, all First Ministers since 1986 had served no more than one term, some considerably less. (VanderZalm, Johnston, Harcourt, Clark, Miller and Dosanjh (between 1986 and 2001 – an average of 2.5 years each), During this decade and a half of electoral turmoil, British Columbia became the first Canadian jurisdiction with Recall and Initiative legislation, as well as adding a separate Referendum Act.\n\nTo understand the 2009 result, having an idea of its prelude is helpful. That prelude included two General Elections – in 1996 and 2001 which were controversial and resulted in British Columbia’s shift to fixed election dates for 2005 and 2009. The latter two elections both also included a referendum on electoral reform. Both of these failed."}, {"url": "https://link.springer.com/article/10.1007/s11127-021-00939-1", "page_content": "When electoral law specifies the OLPR system, the menu of choices is long. In that system, voters choose a party as well as a name from the party’s list of candidates. In county council elections (#2), the average number of candidates was 48.70, while in the remaining two OLPR elections, the numbers were 76.75 and 104.72 candidates (see Table 1). The longest ballot in the provincial elections included 182 candidates. Because candidates’ places of residence were displayed prominently at the entries to voting booths, voters could have been incentivized to pick a “local” candidate within just the first party on the ballot (see Shugart et al., 2005; Jankowski, 2016). Even if voters chose the first party without noticing its identity, the choice of a local candidate could provide them with psychological alibis, assuring them that they had voted conscientiously (see Fig. 2). Some voters may select their preferred candidate first, and their party choice may then be automatic (Oscarsson & Rosema, 2019). The analysis of spoiled votes in the 2014 elections revealed similar effects (Gendźwiłł et al., 2016).\n\nFig. 2 Ballot booklet in 2014 county elections (#2). Note: Right: The first page of the ballot booklet, with PiS listed on the cover. Left: An inside page of the ballot booklet with the PO (Platforma Obywatelska—Citizens’ Platform) candidates. Photo by Bartłomiej Michalak Full size image\n\n5.1 Party primacy estimates for PiS\n\nThe natural experiment occurred in the county council elections (#2). Our units of observation were boroughs, wherein voters voted four times. All variables listed below record the percentages of total votes cast, including spoiled votes. The main dependent variable is the percentage of votes for PiS in boroughs in county council elections (#2). Our main explanatory variable PRIMACY equals 1 for those boroughs in which PiS was listed first (and PSL competed as a freestanding committee) and 0 elsewhere (where PSL competed as a party). Of the 314 counties that were not county-boroughs, we excluded eight cases in which PiS did not compete, which left us with 2338 boroughs where both PiS and PSL competed.\n\nOur control variables included most notably Province-PiS, i.e., support in boroughs for PiS in provincial elections. In all provincial elections, PiS was listed second or third, because PSL competed as a party in the 2014 elections in all MMDs. Other control variables were related to county and provincial elections; additional electoral variables were related to 2014 mayoral and 2011 House elections as well as main territorial and demographic variables. We also considered a larger set of control variables typically entered in Polish election studies whose impact turned out uniformly to be statistically nonsignificant in all configurations. All control variables are described in greater detail in Appendix 1.\n\nIn the second row of Table 2 (labeled PRIMACY) we report the estimates of the party primacy effect depending on the configurations of the control variables. Moving PiS to the top position on the ballot in county elections results, on average, in an estimated 8.01–8.52% larger vote share in boroughs. The results are similar and significant in all models.Footnote 5 Most of the demographic and territorial control variables are nonsignificant; a notable exception is Area-West, denoting the part of Poland that in 1795–1918 belonged to the Prussian partition. It is a region where support for PiS is substantially weaker than in other regions of Poland.\n\nTable 2 Dependent variable: percentage of votes for PiS in 2014 county elections (#2) at the borough level Full size table\n\nIn addition to running our main model, we examined the PiS results in the 2014 county elections (#2) separately for the two PRIMACY values, i.e., in those boroughs where PiS was listed first and in those boroughs where it occupied a more remote ballot position. Parallel lines would imply that the estimate of the first-position bonus is relatively stable regardless of support for PiS in provincial elections (#1) (see Fig. 3).\n\nFig. 3 Scatterplot of percentages of votes for PiS in boroughs in the 2014 county elections (#2) by percentages of votes for PiS in boroughs in province elections (#1). Note: PiS was listed first for PRIMACY = 1 (marked by o), and second or third for PRIMACY = 0 (marked by x). The numbers on the x-axis and y-axis represent the percentages of all votes cast Full size image\n\nIn fact, the two regression lines are nearly parallel. The distance between the lines at various values of PiS support in boroughs in the provincial elections represents changes in the estimated magnitudes of the positional bonus. The estimated bonus ranges from 8.92% (when PiS support in the boroughs in the provincial elections (#1) was equal to zero) to 7.42% (when PiS support in the boroughs in the provincial elections (#1) was at its maximum of 65). At 26.89%, which is the actual average support for PiS in the provincial elections, the effect is estimated to be 8.38%, which is close to our previous estimates. We also note that a similar comparative analysis of PiS results in the 2010 and 2014 elections revealed two almost identical regression lines.Footnote 6\n\nThe average of our five estimates of the PRIMACY bonus is 8.32%, the bump that a party receives exclusively for being listed first on the ballot. That is our estimate of the average first-position bonus for PiS in the OLPR county (#2) elections.\n\n5.2 Interactions between party primacy and list primacy\n\nWe next checked whether party primacy and list primacy interact for PiS, i.e., whether a larger number of primacy votes for a party is associated with a larger (or smaller) number of votes for the first candidate on the party’s list. If such interaction is evident, we would observe varying proportions of votes for the first position on the PiS list in MMDs where PiS competed as No. 1 versus down-ballot. As a control variable, we entered the number of votes for the first PiS candidate on the party’s list in the 2010 local election. The differences turned out to be small and nonsignificant, with a two-sided p-value of 0.711 (t-test for differences in means). That result corroborates the hypothesis that party primacy and list primacy effects are independent of one another.\n\n5.3 Party primacy estimates for PSL\n\nIn addition to providing estimates of party primacy effect for PiS, we conducted a similar analysis for PSL (see Table 3). The research design and the variables that we tested were defined analogously.\n\nTable 3 Dependent variable: percentage of votes for PSL in 2014 county elections (#2) at the borough level Full size table\n\nWhile both cases technically are symmetric, an important difference renders the estimates for PSL slightly less reliable than those for PiS. Recall that PSL competed in some districts as PSL-party, and in some districts as PSL-freestanding committee of citizens. The main difference was that PSL-freestanding formed some local coalitions with minor partners in districts while such coalitions for PSL-party were negligibly small. There was no comparable effect for PiS.\n\nPRIMACY* denotes the estimated bonus that was obtained by PSL-party in about three-quarters of MMDs where it was listed first versus MMDs in which PSL’s freestanding committee was listed further down the ballot. The main control variable, Province-PSL, represents PSL's results in provincial elections where PSL always competed as PSL-party and was listed first.\n\nThe estimates of PRIMACY* for PSL range from 6.02 to 8.06%, and are slightly smaller than comparable estimates for PiS, which ranged from 8.01 to 8.52%. As we mentioned already, we attribute the difference to the slightly more expansive coalitions formed by PSL-freestanding versus PSL-party, which added some small numbers of votes to the former consistently. Needless to say, PSL's leaders did not expect the party to win the first ballot position in the lottery, nor that it would capture a huge party primacy bonus that would be much more valuable electorally than forming small local coalitions. Had party leaders anticipated those events, most likely PSL would have competed as PSL-party in all or almost all MMDs.\n\nIn general, while the estimates for the two models are similar, the PSL model explains less of the variation in that party’s votes than the PiS model does, and the significance of control variables is weaker. We attribute those differences to the small number of extra votes that PSL-freestanding received because of the small coalition partners."}, {"url": "https://www.legassembly.sk.ca/mlas/template/?first=Don&last=Morgan", "page_content": "Don Morgan was born, raised and educated in Saskatoon. He graduated from the University of Saskatchewan (College of Law) in 1978 and practiced law in Saskatoon from 1979 to 1988. Between 1988 and 1992, he was chair and CEO of the Saskatchewan Legal Aid Commission and was appointed as King's Counsel in 1990. He practiced law in Saskatoon from 1992 until 2007. Don also served on the Saskatoon Public School Board from 1999 to 2003, including a term as board chair.\n\nDon was first elected to the Legislative Assembly in November 2003, representing the constituency of Saskatoon Southeast. He was re-elected in the 2007, 2011, 2016, and 2020 provincial elections. During his term in opposition, Don served as critic for Justice, deputy critic for First Nations and Métis Relations, Opposition Deputy House Leader, and sat on the legislature’s Standing Committee on Private Bills.\n\nSince the 2007 provincial election, Don has served the province as Minister of Justice and Attorney General, Minister of Education and Minister of Advanced Education.\n\nHe currently serves as Minister of Crown Investments Corporation and Minister responsible for the Saskatchewan Gaming Corporation, SaskEnergy, SGI, SaskPower, SaskTel, and SaskWater. He is also Minister responsible for Labour Relations and Workplace Safety, and Minister responsible for the Workers’ Compensation Board. He also serves as chair of the caucus Legislation and Regulation Review Committee.\n\nDon and his wife Sandy reside in the Rosewood area of Saskatoon."}, {"url": "https://ourcommons.ca/publicationsearch/en/?view=L&item=&parlses=41&oob=&topic=&proc=40816,40497&per=&prov=nb&cauc=&text=&rpp=60&order=&targetlang=&sbs=0&pubtype=37", "page_content": "moved that Bill C-642, An Act to amend the Corrections and Conditional Release Act (high profile offender), be read the second time and referred to a committee.\n\nHe said: Mr. Speaker, I am honoured to rise in the House tonight to start the debate on second reading of my private member's bill, Bill C-642. Before I begin, I want to thank my colleague the hon. member for Miramichi for seconding my bill. I certainly appreciate her doing that.\n\nI feel very confident that my colleagues will see the wisdom of these proposed amendments to the Corrections and Conditional Release Act. This private member's bill would amend the act so as to require the Correctional Service of Canada to disclose certain key information regarding the statutory release of a high-profile offender. This would be accomplished by posting the required information on the service's website, as prescribed by the bill, and by also providing written notice with the disclosure of the information to the victim or victims. The legislation would also provide for community consultation related to the proposed release.\n\nI introduced the bill in order to fulfill a commitment I made to the citizens of my community of Saint John after they were exposed to a situation that many felt was a major injustice, in 2013. The perceived injustice that I am speaking of was the introduction of three serious offenders into our community, without prior notice or without people even understanding who they were dealing with, what they looked like, what restrictions were imposed on them, or what was being done for the protection of the citizens in our area.\n\nAs an example of this, I would like to refer to a news article at the time that described one of these individuals, who had been convicted of raping eight women. He was sentenced to 37 years in prison. He qualified for statutory release and was released from prison to the Parrtown Community Corrections Centre, after having served two-thirds of his 37-year sentence. However, what got people quite concerned was that the news article stated that a recent assessment had indicated that this individual's risk to reoffend and commit another sexual assault was in the high end of the moderate range. That had community members on edge.\n\nI want to highlight that this could happen in any community throughout Canada that is home to a halfway house that houses high profile offenders prior to their full release.\n\nI want to say at the outset that I believe that we in society have an obligation to do our part to reintegrate individuals back into society once they have paid their dues. However, it cannot be done without looking after the mental and physical well-being of law-abiding citizens.\n\nI stated back at the time that this whole situation unfolded in Saint John that there must be stronger rules to ensure more public disclosure of information surrounding the release of high-risk sex offenders in the application of conditions to the release that protect the public interest. I am no different from anyone else. I certainly consider Saint John to be a wonderful area in which to live, with a lot of support services for the people who need it. I believe we have an obligation to protect those who are vulnerable from potential risks. This is an area of responsibility that we all take very seriously, and we do in Saint John for sure.\n\nSaint John, New Brunswick, is home to the Parrtown Community Correctional Centre, which is commonly referred to as a halfway house by most. We also have a strong chapter of the John Howard Society. Together they do great work helping prisoners re-enter life in the community. However, their job is not the protection of the public.\n\nThe National Parole Board and the approach we have taken to prisoner releases in Canada give the role of protecting the public to the police and to us, the lawmakers of Canada. We need to provide the police with the tools they require when doing their job. At the present time, it is left to the local police to decide if they will inform the public about the release of dangerous criminals. They must balance the right of the prisoner with the right of the public to know. This is not fair to the police and it is definitely not fair to the public.\n\nThere is another example in another news article from 2013 when this was unfolding in my riding. Another individual, different from the one I referred to earlier, was released from prison after having served a 12-year sentence for forcible confinement and sexual assault.\n\nThis was put out by the Saint John Police Force. The Saint John Police Force considered this individual to be a high risk to offend sexually and violently against females and other vulnerable persons. They went on to say that the Saint John Police Force was issuing this information in warning after careful deliberation about all related issues, including privacy concerns, in the belief that it was clearly in the public interest to inform the members of the community. It is quite extraordinary to have an article like that appear in the local newspaper. It certainly caused concern for many citizens in Saint John.\n\nWe need to protect the citizens of our communities that play host to these dangerous offenders as they are reintroduced in society.\n\nIn 2013, the city of Saint John played host to three individuals, as I mentioned earlier, who were deemed to be dangerous offenders and who it was determined had a high chance of reoffending. Each was in jail for sex-related crimes, and the people of my community were alarmed when they learned of their release into the Saint John area. We had no idea what they looked like, where they were staying for sure, and what restrictions were placed on their movements, if any.\n\nWe were not made aware of their release into the community until after it had already occurred. Concerned citizens, as one can probably imagine, held rallies, signed petitions, and raised the issue in the media. They raised the issue with city council, provincial MLAs, and me, their member of Parliament.\n\nAt the time, I made a commitment to try to ensure that this situation was not repeated in Saint John or in any other community in Canada. I felt it was important for communities to have the information they needed in advance to allow the police and citizens to be prepared and to make sure that the victims of the people who had violated them were informed as well.\n\nThe Saint John city council passed motions about having access to more information about the people being released into the community. Again, I refer to another article at the time about these motions, when city council was debating this. In the motion, one of the councillors, the deputy mayor, actually, stated:\n\nI believe it is important that we understand the process by which these types of offenders are released and how locations are chosen as well as what support is available from the Federal Government for those communities expected to accept such individuals.\n\nShe went on to say:\n\nPeople are concerned, and rightly so. The absence of good information just exacerbates the concern. I would like to have accurate data to be able to decide what the issues are.\n\nI have all the faith in the world in our law enforcement officials here, but I want to provide them with all the support I can to ensure that they understand the process and what supports are necessary and what resources might be available elsewhere to help them.\n\nThe deputy mayor made it clear that she was not asking for the disclosure of offenders' personal information. She went on to say:\n\nI respect the fact that people who've been convicted of an offence served their time, and they do need to be able to re-establish a life for themselves. But at the same time, we do have a responsibility to our community to ensure that the quality of life is maintained for our citizens.\n\nObviously, as politicians, we are called upon to respond to many situations, and I did respond at that time to that situation talked about in another article. I went on to say in that article that I think the public needs to be aware of the nature of the release. With each of these individuals, there are conditions applied, and the public should be aware of the conditions that are applied. That was in a news article at the time.\n\nThat is the gist of what I am trying to say here today. As lawmakers, I believe we have an obligation to listen to people and to act in the interests of the majority. I undertook in 2013 to address the needs and concerns of the people of my riding. They were concerned and were looking to us to provide them with the protection and information they needed to make themselves feel good about walking the streets of their community.\n\nI want to be very clear. Bill C-642 does not interfere with the rights of the inmate being released. It does not change the fact that they are being released. It does not deny them the protection provided by our Canadian justice and correctional system. What it does do is give the citizens of our country and the victims of crime more information and a sense that they are being treated fairly.\n\nIt makes the release of certain dangerous offenders become part of the public record.\n\nIt would no longer be the responsibility of the police in local communities to decide if certain information should be made public. This would also give the public and victims the knowledge that those certain individuals would not be able to quietly, under the veil of secrecy, enter their community and quite possibly reoffend before the community even knew they were there.\n\nI must point out one very important point. This change would not apply to all offenders being released into our communities. It would only apply to the most dangerous offenders, as defined by schedule 1 of the act, and if the commissioner were to determine that the offence dynamics had elicited or had the potential to elicit a community reaction in the form of public or media attention.\n\nI look forward to the members, my fellow lawmakers and protectors of the public, supporting this simple change that would give the general public the notice and the information they deserved when a dangerous offender was to be released into a community. We as elected officials must be responsible to our communities. We must take the steps that are needed to protect the people who make up our great country.\n\nSome will no doubt argue that this is more tough-on-crime legislation. Let them. This is not tough on crime. This is simply informing members of the public of what is happening within their communities. It would provide a protection to the people who deserve to be protected. It would inform and involve members of the public in a key aspect of our justice system.\n\nIn this age of social media, especially at a time when municipal policing budgets are under strain, we must do whatever we can to keep the public informed with factual information for communities.\n\nI look forward to the support of members for the bill and to their involvement with the protection of their constituents. In our modern world, information is key. People demand to know what is going on and, as elected representatives, it is our obligation to do what is expected of us, which is provide reliable and valuable information in a timely and predictable fashion.\n\nI look forward to the support of my hon. colleagues and I am ready for any questions they might have."}, {"url": "https://pastoralismjournal.springeropen.com/articles/10.1186/s13570-017-0076-2", "page_content": "Impact of colonial changes on Borana women’s roles and status\n\nExploration of colonial impact on pastoral gender organization in northern Kenya provides an interesting look at how gender and colonial ideologies were constructed. As mentioned before, with the exception of a few studies, pastoral societies have been overlooked in the studies on gender relations, reflecting the importance of analysing how gender and colonial ideologies were recreated and reinforced in areas considered marginal to the colonial enterprise such as northern Kenya. Detailing this process, this study traces changes in Borana gender ideology in the broader socio-economic and political changes wrought by colonization. This makes sense in relation to the argument that ‘gender relations in general are bound up with historical relations of economic and political dominance, particularly with the workings of imperialism and capitalism (Clever 2001).’Footnote 64 It is demonstrated that the enduring colonial social construction of gender projects a broader socio, economic and political analysis, and I now turn to the discussion of these through three major themes - establishment of colonial native authority, commercialization of pastoralism and post-World War II social reforms.\n\nEstablishment of colonial native authority\n\nThe British colonies adopted the principles of indirect rule introduced officially in 1934. Indirect rule was a system in which the British ruled their colonies in Africa as elsewhere through the pre-existing local governance system. Although there was no full-scale application of the system, in the case of Africa, the policy was guided by the postulation that African and European cultures varied greatly and communities that had developed institutions were best ruled indirectly. In Kenya, the history and process of British colonial consolidation and rule has been discussed in detail by (Ogot and Ochieng 1989; Lonsdale and Berman 1979; Mungeam 1966).Footnote 65 However, it is important to note that British administration was based on the general British principals, where the colony was divided into provinces led by the provincial commissioner helped by the district commissioners. The district commissioners were aided by district officers and assistant district officers. Under the district officers were local administrators, composed of village headmen and the post of chiefs, the lowest hierarchies in the colonial administration. Many reasons abound in the literature for the establishment of indirect rule including saving the colony the costs of hiring British administrators. Indirect rule was also said to help preserve cultural practices with minimal interference (Vail and White 1989).Footnote 66 This is significant to my analysis. First, gender-related issues were part and parcel of these cultural practices. Going by this, the colonial administration system would have retained women in some of their pre-existing positions of power. However, colonial authorities misrepresented the meaning of public and domestic sphere to ‘mean that men and women do not know about each other’s sphere (Jaylain 2004).’Footnote 67 I suggest that this justified the integration of native men into the colonial local administration by default. Archival sources are explicit about the association of men with colonial titles of village elders, chiefs and headmen. For example, the Moyale District Annual Report of 1920 to 1921 provides a favourable description of a Borana headman named Yatanni Kune. He is described as ‘an influential and most useful headman, who would be difficult to replace.’ (Moyale District Annual Report 1920-1921) Footnote 68 The phrase \"difficult to replace\" speaks to the depth of responsibility and invested on men by the colonial regime. The new system reinforced men’s authority and status by introducing not only a new hierarchy of native administration, but also new a gender hierarchy. This observation is supported, for example, by Dorothy Hodgson in her study on the Maasai of Tanzania. She notes that ‘by extending the authority of men, especially elder men, over the newly emerging domain of “the political,” indirect rule broadened and deepened their control over junior men and women. It gave certain men new rights and responsibilities as “representatives” of their communities, including the authority to collect taxes, enforce livestock decisions and codify customary laws.’Footnote 69\n\nIt has been further argued that the European colonial venture ‘was a gendered enterprise’ which thrived on labour forces provided by men. Central to this were ethos of militarism, masculinity and manhood.Footnote 70 Colonizers reinforced these ideas in their recruitment of natives into the British forces based on gender and even cultural backgrounds. In this context, men from pastoral cultural background were thought to possess military skills, which made them desirable for recruitment into the colonial troops.Footnote 71 The evidence from a colonial report indicates that six Borana men were trained as members of the tribal forces, commonly known as dubas, and were eventually employed as prison wardens.Footnote 72 The absence of Borana women from such accounts speaks loudly to the fact that colonial labour forces favoured males reinforcing the invisibility of Borana women and their lack of participation in military roles as espoused under the Gada system. On the other hand, men increased their privileges and dominance, an argument further made by Timothy Parsons that the recruitment of pastoralist men into British forces ‘led to feelings of superiority among soldiers and resulted in demands for special treatment and privileges, many of which were granted by the army.’Footnote 73 Parsons alludes to the continuation of such privileges in the post-colonial period in which men benefited from ranch distribution policies. Commercialization and ranching policies divided pastoral land into group ranches distributing over 99% of ranches to men, leaving women out (Flintan 2007).Footnote 74 Pastoral women and men complemented each other; while women looked after livestock within the homestead, men managed satellite herds, and this permeated also into the equal access to natural resources sustaining patoralism activities. However, with the replacement of collective ownership of lands with private property rights, pastoral women in general lost their access to natural resources, which by extension included lands allocated to ranching in which male members had privileged land access leaving out the females. While this process was not even for all pastoralist societies, it affected the Borana women as it happened with the Maasai and Samburu women. Research on policies enforcing land privatization has been shown to have negative effects on the social well-being of women. Although this has been the case in most countries with large pastoral populations, like Ethiopia, women have limited ability to access and own land, which is a form of economic access to key markets as well as a form of social access to non-market institutions, such as household- and community-level governance systems (Flintan 2003).Footnote 75\n\nCommercialization of pastoralism\n\nColonial policy of monetization and commoditization of a generally pastoralist economy has been shown to have an impact on gender relations. In the early years of British administration in the Northern Frontier District, the British established colonial posts along the trade routes used by pastoralists to impose taxes and control trading activities (Samatar 1989).Footnote 76 Although slow in developing, colonial revenues were derived from commodities - tea, sugar and tobacco - sold to pastoralists. Trade licences provided to retail shop operators both by local residents and Indian and Arab immigrants in northern Kenya were another source of revenue accrued by the government (Marsabit District Annual Report 1928).Footnote 77\n\nThe introduction of taxes gave greater impetus to the integration of pastoralists and the Borana into the colonial economy. In colonial Kenya, direct taxation of Africans began in 1901. Pastoral societies paid taxes in kind (Tignor 1976).Footnote 78 The Northern Frontier District Annual report of 1925 indicates that pastoralists, including the Borana, paid 30 head of cattle and 50 sheep annually. This system was, however, replaced in 1928 by a hut and poll tax in which each man aged 16 and over was required to pay a prescribed tax in cash annually. To meet this requirement, Borana had begun to trade livestock between the north and central Kenya by the 1930s (Colonial Report 1930).Footnote 79 However, the codification of males aged 16 and over is telling of the gender designation of men as heads of households who had ability to pay taxes and not women. It has often been argued that in the case of northern Kenya and pastoralists, the tax policies encouraged trade in livestock, introducing the cash economy in the north. Integration of men, though peripherally, into the colonial cash economy gradually replaced women’s control over milk and other dairy products and gave men exclusive rights to dispossession of livestock (Sobania 1979; Hodgson 2001).Footnote 80\n\nThe outbreak of the Italo-Abyssinian war of 1936 increased the supply for livestock from northern Kenya to feed the large troops stationed in NFD and Marsabit in particular. For example, Marsabit District was used as a military base to send patrols into the whole of the NFD and the dispatch of the Kenya African Rifles (KAR). By 1942, 250,000 sheep and goats were sold and 20,000 heads of cattle were disposed in the NFD. Although short-lived, the demand particularly brought the Borana under presure to supply the meat needed by the soldiers (Marsabit District Annual Report 1935 and 1941).Footnote 81 However, the demand sparked by the short-lived war period and the need for cash to purchase commodities were not the only factors in explaining colonial policies that encouraged pastoralists to sell their livestock. Other concerns emerged, for example overstocking issues. The overstocking thesis was premised on the view that pastoralists including the Borana kept more livestock than their available grazing land leading to overgrazing and land degradation (Mackenzie 1947).Footnote 82 To effect this policy, in 1934, a special District Ordinance restricted all pastoralists in northern Kenya to demarcated ‘tribal’ grazing areas for each ethnic group and grazing guards were put in place to enforce grazing rules (Tana River district Report 1947).Footnote 83 Failure to stay within a designated grazing area was considered trespassing, warranting not only a court order but also seizure of livestock and a monetary fine. For instance, the Borana were restricted to graze their herds only on the northern side of Mount Marsabit, but when in 1936, some of the Borana in Marsabit were found herding their stock in a restricted area, 10% of the 500 sheep alleged to have trespassed were confiscated by the colonial authorities and their owners expelled from the area along with their remaining stock. Boru Abdo, their village elder, was summoned to court to explain and made to pay a monetary fine. Again the reference to men, with regard to the matter, as elderly played into colonial gender hierarchies, and as Hodgson puts it for the case of Maasai, ‘men were expected to apply for permits, and men were directed to herd and keep livestock in quarantines.’Footnote 84 Similarly, in Borana society, attention given to men implies that they were the ones in charge of livestock, including where to graze and with responsibility for maintaining local control.\n\nLand-related policies further lowered women’s socioeconomic status in Borana society and pastoralists in general. First and foremost, the colonial government perceived pastoralism as seasonal and traditional land tenure and practices associated with pastoralism were viewed as a barrier to commercialization of land. In essence, by 1940, demonstration plots were developed on the slopes of Mount Marsabit to plant maize. The local communities including the Borana were allocated farming plots but with various conditions including signing a legal contract with the District Commissioner, maintaining presences on the land. They could not transfer land, sell their agricultural products or erect any building without the written permission by the District Commissioner. Furthermore, the plots were considered Crown Land and not inheritable. This condition was particularly a blow for widows, including from the Borana community, who were vulnerable to eviction upon the death of their husbands (Marsabit District Annual Report 1946).Footnote 85 These laws reduced women’s access to productive resources such as land.\n\nIn the period during and after the Second World War, gender inequality was further reinforced as the Borana were brought more into contact with the colonial economy. Broadly speaking, in response to increased pressures in the aftermath of the Great Depression, among the Borana, like other pastoral communities, the colonial government intensified earlier efforts to promote monetization and commoditization of their livestock and opportunities for retail trading for the Borana elite (Dahl 1979). Dahl writes:\n\nThe period during and after World War II, with its high demand for cattle, contributed much to giving Borana society an altered profile. Deliberate new attempts were made to back up the power of chiefs and headmen and fresh fields of activity also opened up, which made it possible for a stratum of Borana leaders to differentiate themselves more distinctly from the common herd owner.Footnote 86\n\nAgain this shows that the colonial economy did not create a niche for the Borana women but increased the powers of male figures over the women in the community. It is also interesting to note that apart from creating gender inequality, the colonial economy increased differentiation among the Borana communities where class became a basis for social inequality, impacting non-elite male members of the Borana society and, of course, placing women, who were perceived as stockless, at the bottom of the hierarchy.\n\nPost-World War II social reforms and women\n\nEven in the post-World War II period that ushered in socio-economic recovery in most colonies in Africa, including Kenya, there was notable exclusion of pastoral women’s needs in general. The post-World War II social programmes stressed reforms in health, agriculture, education, trading apprenticeships and creation of women’s organizations.Footnote 87 One of the major areas that post-World War II social reforms sought to address in the last decade of colonial rule was participation of African women in formal education.Footnote 88 It is important to stress that even post-World War II policies that explicitly sought to increase basic education thought to open opportunities for African women in general had little impact on pastoral women’s access to education.Footnote 89 However, the author is aware of the complexity of socio-economic, cultural and religious factors that explains the absences of pastoral women’s participation. That said, during the late colonial period in Kenya, as was true with the rest of the British colonies in Africa, education was a crucial stepping stone to all other types of socio-economic and political mobility. For example, among pastoral societies of northern Kenya, it was only men who had an opportunity for basic education and even read the popular newspaper of the time, Habari. The colonial labour force was made open to men trainees who were recruited into native colonial military forces.Footnote 90 Although pastoral societies’ participation in formal education for men and women of pastoral cultural backgrounds was at best minimal relative to the rest of the Kenyan communities, the participation of pastoral women in education was even far more minimal. That said, pastoral women were deprived of the socio-economic opportunities available to pastoral men by virtue of the latter’s relative educational attainment.\n\nThe deprived nature of the educational system among pastoral societies makes it difficult to gather total school enrolment and attendance figures in northern Kenya. Nevertheless, in 1948, the first intermediate government school was built in Wajir. The Bible Church Missionary Society established elementary schools in Marsabit, Wamba and Maralal and enrolled children of the Borana, Burji and Rendille converts.Footnote 91 Only a few children got access to a modern education, for example those whose parents were shop owners, natives working for the colonial government, administrators, members of the local police (dubas) or ex-soldiers.Footnote 92\n\nEven when, in 1952, the colonial government with the help of missionaries established self-help groups for African women, later named Maendelo ya Wanawake organization, (MYWO) development for women in 1954, pastoral women were generally excluded simply by default with most of the groups being established in the regions settled by sedentary communities and in urban areas. In NFD, Colonial Annual Report only mentions Marsabit District as the possible location to establish Maendelo ya Wanawake organization.Footnote 93 Even so, the implementation process in Marsabit was largely left to the discretion of the colonial District Commissioners. Detrimentally, the women’s groups were not given priority in funding. Colonial archives reveal that ‘only a small sum has been included for Marsabit in case the District Commissioner can introduce some community development there.’Footnote 94 While the colonial government emphasized the importance of the MYWO in non-pastoral areas, for pastoral women, British administrators never made social policy welfare a priority as evident in the limited funding offered by the colonial government.Footnote 95 Indeed, colonialism destroyed women’s traditional organization, replacing it with a hierarchical system that undermined the traditional bases of women’s authority generally in Africa.Footnote 96 Women’s organizations in colonial Kenya illuminate important aspects of these shifting roles. Often, these played out in actions that fed the marginalization, especially that of the rural pastoralist women.\n\nHowever, pastoral women in general have not been just helpless victims to changes around them, but active agents. This is illustrated in a memoir by Daniel G. Van Wyk, a pioneer settler in Kenya who travelled in NFD in the 1950s.Footnote 97 Although it has been ignored by scholars, the autobiography sheds light on pastoralist women’s roles in the late colonial period, crucial in reconstructing women’s roles in colonial NFD. Offering a vital account of the interaction between the NFD pastoralists and the colonial administrators, the autobiography provides glimpses into the roles that pastoralist women played in colonial Kenya in defending their rights. The women participated in actions affecting public policy. Van Wyk describes in detail a demonstration by pastoralist women against the imposition of dress codes by the colonial administration. According to Van Wyk’s account, the wives of colonial administrators demanded the compulsory law. They accused the indigenous women of wearing scant dressing styles intentionally to provoke attention in the township.Footnote 98 Enraged by the law, the women took to the street to demonstrate, demanding apologies and respect from the colonial authority. Van Wyk writes,\n\nScores of demonstrators came into view …They were all women; there were not a single male amongst them. They had defied the dressing regulations and came … bare breasted, bare footed, and with only a string of beads and a piece of cloth tied around the waist. As time went by I pieced together their shouted grievances and demands. It went something like this: no more Khaat (mi’rah in Arabic) for our men.Footnote 99\n\nWhile the author does not clearly say the ethnicities of women, he does mention the Borana, Somali, Samburu, and Turkana pastoralists of northern Kenya. Regardless of which group or groups these women came from, the women’s actions fit the theme of the informal ways pastoralist females came together to oppose unjust policies imposed upon them without their voice or vote.\n\nThey also wanted the colonial administration to ban the stimulant plant, khaat, noted in the quote above. The wives paid for their husbands’ khaat purchases from the money they earned with basket weaving and jewellery making. At the same time, they paid taxes levied by the colonial government on the khaat trade. The women felt those resources would have been better used for their needs and that of their households and communities. In response, the women organized themselves to protest these injustices. They lobbied themselves by taking to the street and forging demonstration strategies. Their activist actions included songs and rude gestures such as putting their hands high on their heads and shouting.Footnote 100 Van Wyk’s accounting provides an invaluable description of these women’s active agency during a time of government and gender-based strictures. The governmental restrictions along with the pockets of women’s resistance continued throughout the colonial period in northern Kenya and the Kenyan colony as a whole.\n\nVan Wyk’s account is significant because it illustrates the aspirations of pastoral women. In the literature on African studies and women in general, such information is often glossed over - or, in the case of pastoralist women, even totally ignored. Scholars have failed to appreciate the insights that this travel memoir provides about a group whose voices have been marginalized in historical literature. However, written from a white male perspective of the time, the work is not without biases. There are plenty incidences where the author’s descriptions are lost to the exoticization of pastoral societies in general and the NFD environment.\n\nPost-colonial development and women\n\nAs in other African nations during the twentieth century, Kenya joined the stream of independence movements and regained independence in 1963 and women’s issues in general moved into the post-colonial phase of Kenyan history. Initially, the new government’s actions towards policies affecting women paralleled those of colonial administrators, for example use of the network of women’s groups for education and social development. However, at the national level, the newly independent Kenya government, with assistance of western countries, enacted 5- and 10-year development plans within which the government delineated the roles urban and rural populations would play. While development plans in the 1960s focused on large infrastructural development, the 1980s projects were small and focused on agricultural and health-related issues targeted at rural populations. These projects were carried out with the help of private and voluntary international and domestic non-governmental organizations (NGOs). The reference to international and domestic NGOs is particularly important to my analysis of changes in Borana women’s roles and pastoralists in general. This is so because activities of these organizations feed into policies and issues of women’s socio-economic development including an emphasis on creating educational opportunities for women.\n\nIn 1964, the Kenya Education Commission ordered a study on educational needs of the country under the chairmanship of Simeon Ominde. The Ominde report laid the foundation for post-colonial educational policy by stressing the practical goals of education.Footnote 101 The report recommended greater social inclusion, including decreasing the gender disparity. Throughout the 1960s and 1970s, the government embraced and endorsed the slogan Harambee, a Swahili word meaning ‘let’s pull together’, and focused on the mobilization of local resources and local participation in development (Ngau Peter 1987).Footnote 102 While the Harambee spirit was used as a national strategy for mobilizing self-help development projects, communities placed greater emphasis on creating educational opportunities for children. In 1961, the Borana of Isiolo raised $1000 to build the first primary schools, Govern African School (GAS), in Isiolo district. The total enrolment was estimated at 253 (Isiolo District Annual Report 1961).Footnote 103 It is not clear how many of these students were female. In the earlier years following independence, there had been an expansion of and increased enrolment in primary and secondary schools, but a major gender gap existed in pastoralist areas. The rate of completion was generally low for both pastoralist girls and boys relative to other Kenyan communities, and it was worse for pastoral girls, for example, in 1979, only 1,927 girls completed grade 8 in the whole of northern Kenya compared to 3,149 boys (Kenya Ministry of Education Annual Report 1979).Footnote 104\n\nAdditionally, in Marsabit, local communities strove to build and maintain some Harambee schools for their children, as shown in Table 1. Although data on the number of students from pastoral backgrounds is not available, the table provides the number of secondary schools in the Marsabit District; the last four secondary schools are examples of Harambee schools. The local communities in the district shared the cost of school construction and maintenance by selling their cattle to make financial contributions. However, there was only one girls’ school in the whole of Marsabit District after more than two decades of independence, the Moi Girls Secondary School. The presence of only one girls’ school compared to the number of schools for boys means fewer girls enrolled, speaking to the problem of gender gap in education for pastoralists girls and young women. According to Anthony Somerset’s ‘Consortium for Research on Educational Access, Transitions and Equity’, the general increase in girls’ primary school enrolment rate and the national girls’ enrolment rate stood at 77% compared to 34% of girls from pastoral background in 1979 (Somerset 2007).Footnote 105 While the rise in cost of education, among other socio-cultural factors, can explain the educational gender gap for pastoral females, the government did not, however, make efforts to encourage education of pastoralists in general and pastoral females in particular, compared to the rest of the Kenyan colony.\n\nTable 1 Number of secondary schools in Marsabit District, 1965 to 1989 Full size table\n\nThere were also policies that generally considered integration of pastoralists into the general post-colonial national economy. Famine relief programmes and irrigation schemes were introduced to present agriculture as an alternative way of making a living. The Kenyan government, supported by the Food and Agricultural Organization (FAO) and Christian Relief agencies, as well as the United Nations Development Programme (UNDP), initiated irrigation projects in the country’s dry areas.Footnote 106 For instance, in 1969, the first government/donor-sponsored irrigation project in the Waso Borana territory was inaugurated at Kinna on the bank of the Ewaso River to enhance food production for families who had lost their livestock during the drought that followed the Shifta conflict. These irrigation schemes became sources of employment and investment for rich Borana who employed other pastoralists.Footnote 107 Subsequent schemes began in 1973, 1974 and 1976 (Hogg 1980).Footnote 108\n\nHowever, the importance of mainstreaming gender in the development issues did not surface until the 1980s structural adjustment polices (SAPs) and the economic crisis in developing countries in general. To remedy these problems, the World Bank and International Monetary Funds established a bottom-up strategy in developing countries, stressing the importance of mainstreaming gender issues in development plans. The goal of the programme was to bring development agendas to the local level in order to empower women as well as to help community organizations access resources and participate in local decisions and processes relevant to them. According to the United Nations, these two aspects help empower women and contribute to economic growth and development (United Nations 1995).Footnote 109\n\nUntil recently, the impact of these adjustment programmes on pastoral women has been neglected. While sedentary agricultural communities in Kenya suffered a slump in prices for their produce, as in other developing countries, practices for pastoralists exhibited both advantages and disadvantages (Monte and Katebalirwe 2000).Footnote 110 On the one hand, the structural adjustment polices (SAPs) created competition for land. Based on the underlying notion that pastoralism was not an efficient use of land, the post-colonial government adopted policies that emphasized privatization and commercialization. These new laws caused pastoralists to be evicted from their own lands as was the case with the Maasai communities in Kenya.Footnote 111 On a positive note, the commercialization of livestock resulted in better market prices. This allowed pastoral women from wealthy households to increasingly diversify their economic activities. The Orma pastoral women provide an apt example of this latter dynamic (Einsminger 1992).Footnote 112 The Kenya National Development Plan of 1989 to 1993 envisaged long-term goal policy plans that stressed improvements in standard of living of people in Arid and Semi-arid Lands (ASALs) by integrating them into the wider Kenya economy. Among the Borana, settlement schemes intensified in the post-colonial era after the devastating Shifta conflict, not to mention the impact of major droughts in the 1970s and 1980s that eradicated 40% of Marsabit’s livestock, thus impoverishing many pastoralists (Republic of Kenya, Development Polict for Arid and Semi-Arid Lands 1992).Footnote 113 Consequently, the government’s role as a national policy-maker and its subsequent decisions affecting pastoralists might be explained by the long-standing perception of pastoralism as an unviable economic pursuit especially ‘at a time when Shifta insurgency subverted’ the Kenyan government. This generated a feeling that pastoralists were an uncontrollable, anti-development group, a perception that informed government policies and had implications for the nature of development interventions adopted by the government (Whittacker 2012).Footnote 114\n\nThe development policies initiated by the Kenyan government and international community envisioned women as agents of social change and invited them to assist in the implementation of development plans in the nation and in their societies (Edwards et al. 1996).Footnote 115 These changes sped up in the 1990s with the emergence of democratic movements.Footnote 116 The rights of minority communities, such as pastoralists, who had suffered historical marginalization, began to gain recognition in Kenyan politics in part because of international advocacy, which created an awareness of the issues facing pastoral communities. These organizations advocated for constitutional changes, meaningful policies and the inclusion of minority ethnic groups and women in Kenyan politics. Referring to efforts by these organizations, Elizabeth Kharono in her study done in 2011 argues that they ‘made it possible for the poverty eradication strategies to include issues such as pastoralism which had previously been marginalized’.Footnote 117 It was argued that the agendas of democratization, human rights, sustainable development and economic growth could only be achieved with the consideration of women’s and gender issues at their core.Footnote 118 Women’s collective actions became an important strategy in the fight against poverty. For example, Action Aid, one of the well-known NGOs working among pastoralists in northern Kenya, has promoted income-generating activities for Waso Borana women (Walsh 1992).Footnote 119 Participation in NGO activities further encouraged women’s interest in collective action and group formation. It is within this historical context that the formation of women’s groups, especially among the Borana of Isiolo following the devastating impact of the Shifta war from 1963-1967, began (Khalif 2010).\n\nKhalif’s seminal work discusses the response of the Isiolo Borana women through women’s groups. The author has outlined the history of these pastoral women groups starting in 1982. The Kulamawe women’s Group was the first one named after the administrative division where it was based. As the first organization, the numbers started out small: a membership of 24 women. A year later, the post-colonial government organized women’s associations such as Korbesa and Kifunguo founded in 1987. The groups had 30 and 40 members, respectively. By 1990, 11 other groups had emerged. Individual women founded over 80% of these bodies. This speaks of the agency of Borana women in post-colonial era. Although Khalif’s work focused only on the Borana of Isiolo, the work of Coppock and his co-authors published in 2013, focused on 16 women’s groups distributed in northern Kenya. Both of these studies discussed the groups’ origin, formation activities and the degree of sustainability. The two studies fill the gap in our knowledge of women’s collective action among pastoral societies that has been obscured for long but leaves unanswered questions as outlined in the concluding remarks."}, {"url": "https://docslib.org/doc/7960627/section-16-of-the-constitution-of-the-republic-of-south-africa", "page_content": "Section 16 of the C ons titution of\n\nthe Republic of S outh Africa\n\n“Ever y one ha s the right to freedom of expres sion,\n\nwhich incl udes freedom of the pre ss and o ther\n\nmedia; freedom to re ceive or imp ar t informa tion or\n\nidea s; freedom of ar tis tic crea tivity ; and a cademic\n\nfreedom and freedom of scientific resear ch.”"}]}