{"Gordon Hogg was a member of the British Columbia Liberal Party.": [{"url": "https://bc.ctvnews.ca/former-mla-mp-gordie-hogg-enters-race-to-become-surrey-mayor-1.5995847", "page_content": "Another candidate has entered the race to become the next mayor of Surrey.\n\nOn Wednesday, Gordie Hogg announced his bid for the top job under the banner of the Surrey First Party.\n\nHogg was the BC Liberal MLA for Surrey-White Rock for 20 years before trying his hand at federal politics. In 2017, he ran with the Liberal Party of Canada and was elected as the MP for South Surrey-White Rock. He ran again in 2019 and 2021, both times losing to Conservative Kerry-Lynne Findlay.\n\nLinda Annis, the only city councillor currently representing the party founded by former mayor Dianne Watts, introduced Hogg at the launch event and in an accompanying statement. She touted his roots in the community and described him as a person of honesty and integrity, something she said would be a \"refreshing change\" at city hall.\n\nHogg took more direct shots at current Mayor Doug McCallum.\n\n\"When it comes to the election in October, the question for Surrey voters is clear: have you had enough yet, and do you believe we can do better, together?” Hogg write in a statement.\n\n\"Over the past four years Surrey residents have had a tough go of it as they witnessed one man’s destructive my-way-or-the-highway approach to governing.\"\n\nThe current mayor and his slate of councilors with the Safe Surrey Coalition have made a number of moves that have been slammed by critics – Annis among them – as undemocratic. Those have included a controversial bylaw on signs, abrupt ends to meetings and shutting down debate, and an attempt to suspend all new ethics complaints until after the 2022 election.\n\nBut the move to prohibit seven citizens from attending meetings was by far the most inflammatory. McCallum reversed the ban after it was challenged in court.\n\n\"When Surrey residents were banned from city hall by the mayor it made news right across the country, because that’s what you expect from politicians who have given up on democracy. We cannot let that ever happen again,” Hogg said, adding that part of his platform is \"giving city hall back to the people.\"\n\nMcCallum is also facing a criminal charge of public mischief, something Hogg reminds prospective voters on in his announcement.\n\nMany of these controversies can be traced back to disagreement over the move to replace the RCMP with a municipal police force.\n\nHogg describes the transition as \"divisive,\" over-budget, and behind schedule – pledging to hold a referendum on the well-underway establishment of the Surrey Police Service.\n\n“We will give people all the facts about costs so far and what it will cost to carry on, then let Surrey residents decide who will police their city,\" Hogg writes.\n\nIn addition to Annis, Hogg announced two other candidates running for council on the slate -- Bilal Cheema and Mary-Em Waddington. Hogg's statement says more candidates will be announced in the coming weeks."}, {"url": "https://www.leg.bc.ca/content/legacy/web/mla/38thparl/hogg.htm", "page_content": "38th Parliament Members\n\nat dissolution on April 14, 2009\n\nMLA: Hon. Gordon Hogg Surrey-White Rock Minister of State for Mining Elected: 1997, 2001, 2005 BRITISH COLUMBIA LIBERAL PARTY\n\nGordon Hogg was appointed Minister of State for Mining on June 23, 2008.\n\nHe previously served as Minister of State for ActNow BC and Minister of Children and Family Development.\n\nMr. Hogg also served as chair of the Government Caucus and was a member of the Legislative Assembly Management Committee. He was also the chair of the Seniors Caucus Committee and has served on the Cabinet Committee for Agenda Development and the Select Standing Committees on Finance and Government Services; Sustainable Aquaculture; Children and Youth; Health and Social Services; Justice; Constitutional Affairs; and Intergovernmental Relations.\n\nPreviously, Mr. Hogg served as the Official Opposition Critic for education and human resources and was also a member of the Official Opposition Caucus Committees on Health and Education.\n\nGordon Hogg was first elected to represent the riding of Surrey-White Rock in a 1997 by-election. He was re-elected in 2001 and again in 2005.\n\nMr. Hogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nMr. Hogg served on White Rock council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch District Hospital. He has also been a foster parent and little league coach.\n\nGordon and his wife, LaVerne, live in White Rock and have one son.\n\n\n\n"}, {"url": "https://www.leg.bc.ca/content/legacy/web/mla/39thparl/hoggG.htm", "page_content": "39th Parliament Members\n\nat dissolution on April 16, 2013\n\nMLA: Gordon Hogg Surrey-White Rock Elected: 1997, 2001, 2005, 2009 BRITISH COLUMBIA LIBERAL PARTY\n\nGordon Hogg was first elected to represent the riding of Surrey-White Rock in a 1997 byelection. He was re-elected in 2001, 2005 and again in 2009.\n\nGordon is currently the government caucus chair and is Parliamentary Secretary for Non-profit Partnerships to the Minister of Social Development. He also serves on various committees, including the Cabinet Committee on Families First and the Cabinet Committee on Open Government and Engagement.\n\nPreviously, he served as Parliamentary Secretary for Social Entrepreneurship to the Minister of Finance and a member of the Select Standing Committees on Education, Aboriginal Affairs and Crown Corporations. He is also the former Minister of State for Mining, Minister of State for ActNow BC and Minister of Children and Family Development.\n\nHe previously served as Minister of State for ActNow BC and Minister of Children and Family Development.\n\nHe was also the chair of the Seniors Caucus Committee and has served on the Cabinet Committee for Agenda Development and the Select Standing Committees on Finance and Government Services, Sustainable Aquaculture, Children and Youth, Health and Social Services, Justice, Constitutional Affairs, and Intergovernmental Relations.\n\nPreviously, Gordon served as the Official Opposition Critic for education and human resources and was also a member of the Official Opposition Caucus Committees on Health and Education.\n\nGordon was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College\n\nHe served on White Rock council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch District Hospital. He has also been a foster parent and little league coach.\n\nGordon and his wife, LaVerne, live in White Rock and have one son."}, {"url": "https://www.leg.bc.ca/content/legacy/web/mla/37thparl/hogg.htm", "page_content": "37th Parliament Members\n\nat dissolution on April 19, 2005\n\nMLA: Gordon Hogg Surrey-White Rock Elected: 1997, 2001 BRITISH COLUMBIA LIBERAL PARTY\n\nGordon Hogg was first elected in a by-election in 1997 to represent the riding of Surrey-White Rock and was re-elected in 2001. He is currently a member of the Government Caucus Committee on Health.\n\nGord served as Minister of Children and Family Development from June 5, 2001 to January 23, 2004.\n\nPreviously he served as critic for education and human resources for the Official Opposition. He sat on the Select Standing Committees on Health and Social Services, and on Justice, Constitutional Affairs and Intergovernmental Relations.\n\nHe was also a member of the Official Opposition Caucus Committees on Health and Education.\n\nBefore his election to the Legislative Assembly, Gord was a counsellor, probation officer and regional director for corrections.\n\nHe received his bachelor of arts in sociology and psychology from the University of B.C., and his master's degree in psychology from Antioch College.\n\nGord served for 20 years on White Rock council, 10 of those as mayor. He was a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch District Hospital. He has also been a foster parent and Little League coach.\n\nGord and LaVerne Hogg live in White Rock and have one son.\n\n\n\n"}, {"url": "https://www.todayinbc.com/federal-election/federal-election-meet-the-candidates-gordie-hogg-liberal/", "page_content": "Gordie Hogg, Liberal candidate for South Surrey-White Rock, has had a lifelong commitment to a vision of Canada – and his home community – as an inclusive society with equal opportunities for everyone to thrive and prosper.\n\nBut a driving force behind his political activism, he recalled, has always been something his mother Kay said to him when he was just out of high school and a Little League coach trying to get his players to an Edmonton championship.\n\nHe had attended a White Rock council meeting to ask for funding and had been discouraged by what he saw then as a tedious and silly process.\n\n“I told my mom and she looked at me and said, ‘I thought I always raised you to be the kind of person who would, if you didn’t like what was going on, you’d get involved and do something to change it.'”\n\nHis service has included being a council member, and later mayor, of the City of White Rock; two decades as MLA for the area, and a subsequent stint as South Surrey-White Rock MP following a win in the 2017 byelection.\n\n“I discovered that, in political life one could make changes that impacted a lot of people for the better,” he said.\n\nHe can point with pride to tangible benefits to both his home community and the broader population, including overseeing the building of the White Rock promenade, and – as provincial Minister of Children and Families – creating Community Living BC , now a $1.3 billion government agency that supports families and people with disabilities .\n\nAlthough his time in Ottawa was short before the national election in 2019, Hogg also helped secure federal funding to bring clean water to the Semiahmoo First Nation, and continued his ongoing activism against the shipping of thermal coal through the community.\n\nAlthough born in Victoria – Hogg points out there wasn’t a local hospital at the time (his mother was in the forefront of women who campaigned for the creation of Peace Arch Hospital) – he is proud to say he has been a resident of White Rock since he was two months old.\n\nHogg said his dedication to to the community has also been inspired by his father, Dr. Al Hogg, whose historic commitment to community health and well-being has been honoured by dedications of both a pavilion at Peace Arch Hospital and a park in his name.\n\nHis parents’ example has also been seen in the way Hogg and his wife LaVerne have raised their own children, and in his commitment to young people in his work as a youth probation officer at the Salvation Army House of Concord, and later as warden of the Burnaby Youth Custody Centre. It has also inspired him to foster four young people and to go on and found Night Hoops Basketball, a no-cost community program that helps get youth of the street.\n\nHogg has also earned bachelor’s and master’s degrees, and latterly a Ph.D, for which his thesis very much hewed to his passion: ‘Creating Public Policy in a Complex Society.’\n\nPeace Arch News"}, {"url": "https://peoplepill.com/people/gordon-hogg/", "page_content": "Gordon Hogg (born August 24, 1946) is a Canadian municipal and provincial politician. As a BC Liberal Member of the Legislative Assembly, in the province of British Columbia, he has represented the riding of Surrey-White Rock since 1997. Hogg announced in October 2016 that he will not seek re-election in 2017. The Liberal Party chose Tracy Redies, former CEO of Coast Capital Savings as the next candidate for his riding, which boundaries will be adjusted.\n\nHe currently serves as the Parliamentary Secretary for Not for Profit-Public Partnerships. Previously he has been Minister of State for Mining, Minister of State for ActNowBC and Minister of Children and Family Development.\n\nHogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nHe served on White Rock city council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch Hospital. He has also been a foster parent and Little League coach.\n\nHogg and his wife, LaVerne, live in White Rock and have one son. His father Al Hogg was a prominent physician in White Rock honoured with the naming of a residential care facility at Peace Arch Hospital."}, {"url": "https://voiceonline.com/selected-liberals-candidate/", "page_content": "FORMER White Rock mayor and MLA Gordon Hogg has been chosen by the federal Liberals as their candidate in the South Surrey-White Rock federal riding in the December 11 by-election.\n\nHogg told The VOICE on Sunday that the official announcement will be made on Monday.\n\nThe South Surrey-White Rock riding fell vacant after Conservative MP Dianne Watts resigned to enter the BC Liberal leadership race.\n\nPrime Minister Justin Trudeau on Sunday announced that Parliamentary by-elections will be held on December 11 in the riding as well as in three other ridings:\n\n* Bonavista—Burin—Trinity, Newfoundland and Labrador\n\n* Scarborough—Agincourt, Ontario\n\n* Battlefords—Lloydminster, Saskatchewan\n\nHogg pointed out to The VOICE that he was on White Rock council first as a Councillor for 10 years and then as the mayor for another 10 years.\n\nHe then became an MLA from the riding of Surrey-White Rock in a 1997 by-election. He was re-elected in 2001, 2005, 2009, and again in 2013.\n\nHe held several portfolios as MLA including Minister of Children and Family Development, Parliamentary Secretary for Youth Sport to the Minister of Community, Sport and Cultural Development, Parliamentary Secretary for Social Entrepreneurship to the Minister of Finance, Minister of State for Mining, and Minister of State for ActNow BC.\n\nHogg also served as chair of the Government Caucus.\n\nMost recently, Hogg was awarded a PhD from Simon Fraser University (Creating Public Policy in a Complex Society) and appointed Adjunct Professor at the School of Criminology.\n\nHogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nGordon Hogg and his wife, LaVerne, live in White Rock and have one son. They have also been foster parents, Hogg told The VOICE."}, {"url": "https://prabook.com/web/gordon.hogg/2317300", "page_content": "Gordon Hogg\n\npolitician\n\nAugust 24, 1946\n\nHe has represented the riding of Surrey-White Rock since 1997. He currently serves as the Parliamentary Secretary for Not for Profit-Public Partnerships. Previously he has been Minister of State for Mining, Minister of State for ActNowBC and Minister of Children and Family Development. Hogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College. He served on White Rock city council for 20 years, for 10 of which he was mayor. He has also been a foster parent and Little League coach. His father First Rate (at Lloyd's) Hogg was a prominent physician in White Rock honoured with the naming of a residential care facility at Peace Architecture Hospital."}, {"url": "https://www.wikiwand.com/en/Gordon_J._Hogg", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Gordon J. Hogg?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.ourcampaigns.com/CandidateDetail.html?CandidateID=91237", "page_content": "CANDIDATE DETAILS Affiliation Liberal Name Gordon Hogg Address\n\nWhite Rock, British Columbia , Canada Email None Website [Link] Born August 24, 1946 (76 years) Contributor User 13 Last Modifed Campari_007\n\nOct 20, 2020 02:06am Tags Info Gordon Hogg was first elected in a by-election in 1997 to represent the riding of Surrey-White Rock and was re-elected in 2001. He has served as a member of the Government Caucus Committee on Health, and was Minister of Children and Family Development from June 5, 2001 to January 23, 2004.\n\n\n\nGord has also served as critic for education and human resources for the Official Opposition. He sat on the Select Standing Committees on Health and Social Services, and on Justice, Constitutional Affairs and Intergovernmental Relations. He was also a member of the Official Opposition Caucus Committees on Health and Education.\n\n\n\nBefore his election to the Legislative Assembly, Gord was a counsellor, probation officer and regional director for corrections.\n\n\n\nHe received his bachelor of arts in sociology and psychology from the University of B.C., and his master's degree in psychology from Antioch College.\n\n\n\nGord served for 20 years on White Rock council, 10 of those as mayor. He was a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch District Hospital. He has also been a foster parent and Little League coach.\n\n\n\n[Link]\n\nJOB APPROVAL POLLS\n\nBOOKS Title Purchase Contributor\n\nEVENTS Start Date End Date Type Title Contributor\n\nNEWS Date Category Headline Article Contributor\n\nAdd Your 2¢\n\nAgree\n\nDisagree\n\nLaugh\n\nGroan\n\nTroll\n\nBefuddled\n\nWork Complete\n\nPrediction\n\n[close]\n\nDISCUSSION"}]}