{"Gordon Hogg was born on October 28, 1951.": [{"url": "https://en-academic.com/dic.nsf/enwiki/7792679", "page_content": "Gordon Hoare — Gordon Rahere Hoare (nacido el 18 de abril de 1884 y fallecido el 27 de octubre de 1973) fue un jugador de fútbol amateur de Inglaterra. Nacido en Blackheath, Londres, comenzó a jugar en las categorías inferiores de los equipos West Norwood F.C … Wikipedia Español\n\nGordon Campbell — L honorable Gordon Campbell 34e premier ministre de la Colombie Britannique Mandat: 5 juin, 2001 14 mars 2011 Prédécesseur … Wikipédia en Français\n\nGordon Brown (Australian politician) — For others with the same or similar names, see Gordon Brown (disambiguation). The Honourable Gordon Brown Senator for Queensland … Wikipedia\n\nGordon Hoare — Olympic medal record Men s Football Gold 1912 Stockholm Team Competition Gordon Rahere Hoare (April 18, 1884 – October 27, 1973) was an English amateur football (soccer) player Born in Blackheath, Hoare started out with junior sides such as West… … Wikipedia\n\nAllan Gordon — (born c. 1740) of Aberdeen, Scotland, was the sole survivor of the Anne Forbes , a whaling ship that disappeared without a trace in 1757.Early life The Surpassing Adventures of Allan Gordon by James Hogg reportedly preserved the autobiographical… … Wikipedia\n\nChris Hogg — Personal information Full name Christopher Francis Hogg[1] Date of birth … Wikipedia\n\nQuintin Hogg, Baron Hailsham of St Marylebone — Infobox Officeholder honorific prefix = The Right Honourable, name=Quintin Hogg honorific suffix = 2nd Viscount Hailsham(1950 1963) Baron Hailsham of St Marylebone (1970 2001) KG, CH PC QC order=First Lord of the Admiralty term start=October 1956 … Wikipedia\n\nMary Hogg — The Hon. Dame Mary Claire Hogg, DBE (15 January 1947) is a British lawyer and judge. She is the daughter of the late Quintin Hogg, Baron Hailsham of St Marylebone and his wife Mary Evelyn Martin, and is the sister of Douglas Hogg, 3rd Viscount… … Wikipedia\n\nJames McGarel-Hogg, 1st Baron Magheramorne — James Macnaghten McGarel Hogg, 1st Baron Magheramorne, KCB (3 May 1823 ndash; 27 June 1890) was a British politician, Member of Parliament, and local government leader.Early lifeMcGarel Hogg was the son of Sir James Weir Hogg, Bt., the… … Wikipedia"}, {"url": "https://happyhappybirthday.net/en/age/gordon-hogg-person_ffqfxay", "page_content": "Gordon Hogg\n\nCanadian politician – Gordon Hogg was born in New Westminster (city in British Columbia, Canada) on August 24th, 1946 and is 76 years old today.\n\nAge How old is Gordon Hogg? 76 Gordon Hogg is 76 years old.\n\nBiographical data\n\nGordon Hogg\n\nBirthday When was Gordon Hogg born? Gordon Hogg was born on August 24th, 1946.\n\nPlace of Birth Where was Gordon Hogg born? New Westminster (city in British Columbia, Canada).\n\n♍ ♍ Zodiac What is the zodiac sign of Gordon Hogg? Gordon Hogg was born in the zodiac sign Virgo (The Maiden)."}, {"url": "https://www.wikilogy.com/biography/gordon-hogg/", "page_content": "Gordon Hogg is a Politician. He was born in New Westminster on August 24, 1946. Want to more about Him? In this article, we covered Gordon Hogg's net worth, wiki, bio, career, height, weight, pics, family, affairs, car, salary, age, facts, and other details in 2023. Continue reading to discover who is Gordon Hogg.\n\nGordon Hogg Biography\n\nGordon Hogg\n\nDo you wanna know Gordon Hogg's full Biodata? Gordon Hogg is a Politician. He was born in New Westminster on August 24, 1946. He is 77 years old. Take a look at the following table for more information.\n\nName Gordon Hogg Nickname None Gender Male Date of Birth 24-Aug-1946 Age in 2023 77 Birth Place New Westminster Country Canada Nationality Canadian Height None (m) Weight Unknown (KGs) Profession Politician\n\nYou may also like>\n\nGordon Hogg Net Worth, and Salary 2023\n\nWhat is the Networth of Gordon Hogg? What is the income source of Gordon Hogg? We all know that is it almost impossible to say someone's total asset, and how much he or she earns every month. According to the various source, there is an approximate asset that is net worth. So what is the networth of Gordon Hogg? As of 2023, the current net worth of Gordon Hogg is $1.5 Million.\n\nGordon Hogg Age, and Birthday Info 2023\n\nHow old is Gordon Hogg? In this section, we will talk about Gordon Hogg's age, and birthday-related info. Gordon Hogg's actual age is 77, and his birthday is on 24-Aug-1946. When is Gordon Hogg's next birthday? The next birthday of Gordon Hogg is on 24 August, 2023.\n\nBirthday August 24, 1946 Name of the Day Saturday Zodiac Sign (Horoscope) Virgo Next Birthday 24 August, 2023 Age in 2023 77 years Place of Birth New Westminster Country of Birth Canada\n\nGordon Hogg's Height, Weight, and Physical Condition\n\nWhat is the physical condition of Gordon Hogg? The physical condition of Gordon Hogg is good. How tall is Gordon Hogg? Want to know Gordon Hogg's Height Weight in Feet-Inch or Meter-Centimeter? In this section, we discussed his height-weight along with his eyes and hair colors. His height is Not known, and weight is Unknown.\n\nGordon Hogg's Height: Not known\n\nGordon Hogg's Weight: Not known\n\nIn the below table, you will find the height of Gordon Hogg in Meter, Centimeter, and Feet Inche, & the weight in KG and Pound.\n\nHeight In Centimeters: Not known\n\nIn Meters: Not known\n\nIn Feet Inches: Not known Weight In KG: Not known\n\nIn Pound: Not known Eye Color - Hair Color -\n\nRead also: Gordon Joseloff Net Worth, Age, Height, Weight, Wife, Wiki-Bio, Family\n\nGordon Hogg Girlfriend and Marital Status\n\nDo you want to know whether Gordon Hogg is married or unmarried? Who is the Girlfriend of Gordon Hogg? In this section, we will talk about Gordon Hogg's personal life, life story. As you are curious to know about Gordon Hogg. We added the information below.\n\nMarital Status Yet to update\n\nGordon Hogg Educational Qualifications\n\nDo you want to know what is the educational qualifications of Gordon Hogg? In this table, we added the education information of Gordon Hogg. As we do not have all data currently, we keep some fields blank which we will update soon.\n\nSchool Yet to update College Yet to update University Yet to update\n\nGordon Hogg Facebook Instagram Twitter and YouTube\n\nVisit the official Facebook, Instagram, Twitter, Wikipedia, and YouTube accounts of Gordon Hogg. For those who do not have an account on a certain platform, we added the official website link of the platform.\n\nFAQs about Gordon Hogg\n\nSome FAQs (Frequently Asked Questions) about Gordon Hogg.\n\nWhat is the Net Worth of Gordon Hogg?\n\nThe Net Worth of Gordon Hogg is $1.5 Million.\n\nWhat is the Height of Gordon Hogg?\n\nThe height of Gordon Hogg is None.\n\nWhere is the birthplace of Gordon Hogg?\n\nThe birthplace of Gordon Hogg is New Westminster\n\nWhat is the Date of Birth of Gordon Hogg?\n\nThe birthday of Gordon Hogg is on 24-Aug-1946.\n\nIs Gordon Hogg Married?\n\nThe marital status of Gordon Hogg is: Yet to update.\n\nConclusion\n\nSo that's all we have about Gordon Hogg's net worth, bio, wiki, biography, height, weight, awards, facts, siblings, awards, and other information. We hope you get the information about Gordon Hogg. Share your thoughts in the comment section.\n\nDisclaimer\n\nThe info about Gordon Hogg's net worth, wiki, bio, career, height, weight, family, affairs, car, salary, age, and other details are based on Wikipedia, IMDb, Forbes, Instagram, and Facebook of Gordon Hogg. There may have wrong or outdated info, if you find so, please let us know by leaving a comment below."}, {"url": "https://www.ancientfaces.com/person/george-h-hogg-birth-1951/95920959", "page_content": "Add George's birthday or the date he died to see a list of historic events that occurred during George's lifetime. Refresh the page for new events.\n\nIn 1951, in the year that George H. Hogg was born, on June 25th, CBS began broadcasting in color. There were well over 10 million televisions by that time. The first show in color was a musical variety special titled \"Premiere\". Hardly anyone had a color TV that could see the show.\n\nIn 1963, the British Secretary of War, 46 year old John Profumo ,was forced to resign when he lied about an affair with 19 year old Christine Keeler. Keeler was also involved with the Soviet naval attaché and charges of espionage were feared. No proof of spying was ever found.\n\nIn 1975, on September 5th, Lynette \"Squeaky\" Fromme tried to assassinate President Ford in Sacramento, California. She failed when her gun wouldn't fire. President Ford escaped a second assassination attempt 17 days later on September 22 when Sarah Jane Moore tried to shoot him in San Francisco. A bystander saw her raise her arm, grabbed it, and the shot went wild.\n\nIn 1988, on December 21st, Pan Am Flight 103 exploded over Lockerbie Scotland. The explosion killed all 259 people on board and another 11 on the ground. The flight had left Heathrow Airport in London less than an hour before, on its way to New York. After an exhaustive (and long) investigation it came to be believed that two individuals from Libya had planted the bomb.\n\nIn 1999, on January 1st, the Euro became the new official single currency of the eurozone. It was used by Austria, Belgium, Cyprus, Estonia, Finland, France, Germany, Greece, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, the Netherlands, Portugal, Slovakia, Slovenia, and Spain and has since spread in use. Daily, over 337 million Europeans use the euro."}, {"url": "https://www.ancientfaces.com/person/robert-hogg-birth-1953-death-1974/32212451", "page_content": "Refresh this page to see various historical events that occurred during Robert's lifetime.\n\nIn 1953, in the year that Robert Hogg was born, on July 27th, the Korean Armistice Agreement was signed. The Armistice was to last until \"a final peaceful settlement is achieved\". No peaceful settlement has ever been agreed upon.\n\nIn 1960, Robert was merely 7 years old when on May 1st, an American CIA U-2 spy plane, piloted by Francis Gary Powers, was shot down by a surface-to-air missile over the Soviet Union. Powers ejected and survived but was captured. The U.S. claimed that the U-2 was a \"weather plane\" but Powers was convicted in the Soviet Union of espionage. He was released in 1962 after 1 year, 9 months and 10 days in prison.\n\nIn 1966, Robert was merely 13 years old when on September 8th, the first Star Trek episode, \"The Man Trap,\" was broadcast on NBC. The plot concerned a creature that sucked salt from human bodies. The original series only aired for 3 seasons due to low ratings.\n\nIn 1974, in the year of Robert Hogg's passing, on August 9th, Gerald R. Ford became the 38th President of the United States. He had been Vice President for 8 months when he became President due to the resignation of President Nixon."}, {"url": "https://www.ancientfaces.com/person/robert-gordon-hogg-birth-1878-death-1942-australia/143727835", "page_content": "Refresh this page to see various historical events that occurred during Robert's lifetime.\n\nIn 1878, in the year that Robert Gordon Hogg was born, in Africa, the death of the last confirmed Cape lion occurred. The Cape lion was slightly larger than other lions and had black ears, a black mane, and black hair on its belly.\n\nIn 1896, when he was 18 years old, on August 17th, the first pedestrian v car fatality occurred in Great Britain. Bridget Driscoll, age 44, was walking with her family on the grounds of The Crystal Palace in London when she was hit by a car driven by Arthur James Edsall. Edsall claimed to be going 4.5 mph and Driscoll's death was ruled an \"accidental death\" after an inquest.\n\nIn 1917, when he was 39 years old, the NHL (National Hockey League) was established as a response to the demise of the National Hockey Association (NHA). The first superstar of the League was \"Phantom\" Joe Malone of the Montreal Canadiens, a leading scorer with records that still stand. The Canadiens won the NHL championship over the Senators.\n\nIn 1934, when he was 56 years old, on November 11th 1933, an extremely strong dust storm hit South Dakota, stripping topsoil. Other strong dust storms had occurred during 1933. Severe droughts continued to hit the Great Plains and the dust storms devastated agricultural production as well as people's' lives for several years. The Roosevelt administration and scientists eventually determined that farming practices had caused the conditions that led to the dust storms and the changes they implemented in farming stopped the Dust Bowl.\n\nIn 1942, in the year of Robert Gordon Hogg's passing, on February 19th, President Roosevelt signed Executive Order 9066. This authorized the Secretary of War to \"prescribe certain areas as military zones.\" On March 21st, he signed Public Law 503 which was approved after an hour discussion in the Senate and 30 minutes in the House. The Law provided for enforcement of his Executive Order. This cleared the way for approximately 120,000 men, women, and children of Japanese ancestry to be evicted from the West Coast and to be held in concentration camps and other confinement sites across the country. In Hawaii, a few thousand were detained. German and Italian Americans in the U.S. were also confined."}, {"url": "https://www.harpenden-history.org.uk/harpenden-history/people-2/adventurers/george_hogg_his_life_in_china/george_hogg_1915-1945_and_st_georges_school_-_1927-1934", "page_content": "George ‘Aylwin’ Hogg entered St George’s in 1927 and left in 1934. His short and remarkable life has left a profound legacy on the people of China, and also on his school, St George’s.\n\nFor those unacquainted with the story, Hogg went up to Wadham College Oxford in ’34 to read ‘Greats’ (PPE), thereby following a family tradition (all of his brothers also attended Wadham). From Oxford, Hogg managed to persuade his parents to finance a travelling expedition across America, and then to Japan and China with his Aunty, the well-known international pacifist campaigner Muriel Lester – today’s ‘Gap Year’. Hogg stayed in touch with St George’s and like many of his friends, he wrote back to The Georgian, the school magazine, updating them of his travels.\n\nIndeed, whilst at Oxford he also played against the School 1st XV in the annual old boys match, was good enough to make the all-star OG’s sevens team (which won the Herts tournament 7 years running in the 1930s), and also played for the inaugural OG cricket team The Dragons.\n\nHogg’s actions in China as a reporter for the Manchester Guardian, and especially in saving a school in war-torn China from the ravages of the Japanese Army were remarkable. It is an heroic story that ended in tragedy, as Hogg died in Shandan, Gansu Province, in 1945 at the age of 30.\n\nThis story of Hogg is now well known amongst most of the community of St George’s, but this was not always so. Mrs Weatherly, the school Archivist, first delved into the archives in the 1980s following on from articles by James McManus, the Telegraph and later Times journalist. The coming of the film, The Children of Huang Shi and the biography of Hogg Ocean Devil in 2008 acted as a further stimulus for the School’s interest in George Hogg’s life.\n\nA special insight into the History of in China\n\nIn 2008 the school sent a group of students and staff to research the life of Hogg further. We travelled up to Gansu province, to the town where he died. We visited memorials, statues and his tomb.\n\nWe also interviewed some of his former students whose lives he saved and also the brothers who he adopted. This was edited skilfully by the history students and made into a DVD which is used to teach the students of St Georges during Year 9. The story of Hogg and the question of his significance allows us to study not only St George’s in the 1930s, but also China and the Far East during the Second World War. This unit has widened our teaching of the Second World War and given the students an understanding of the events of the Sino-Japanese War, including the atrocities that occurred to cities like Nanjing. It also gives students a better sense of China as a modern country today – the history of the decline of its imperial monarchy, the failure of its Republic, the period of Civil War and the rise of Communism. Students answer questions on the significance of Hogg*, and examine the accuracy of the film The Children of Huang Shi as an interpretation of his life. They are upset that St George’s does not feature however!\n\nWhat is most exciting about the history of George Hogg is that so much of it is still living. This was evident from our trip to China in 2008 and also this summer when we welcomed two of Hogg’s surviving adopted sons and also other members of the Hogg family to celebrate his life and legend. During the summer, the school was given the George Hogg private papers by the Hogg family which will go on to enrich our understanding and teaching of Hogg even further. We have much more to learn!\n\n* See also four presentations by pupils in 2011, evaluating the significance of George Hogg in world history, as an indication of how his life and work are studied in St George’s School."}, {"url": "https://www.findagrave.com/memorial/174340485/gordon-douglas-hogg", "page_content": "Gordon was born in Nelson, BC and the family moved to Revelstoke shortly after. In 1977, the family moved to Cranbrook. After finishing high school, Gordon worked in the shops for Canadian Pacific Railway until his accident which took the use of his legs and left him confined to a wheelchair. Gordon then lived in Vancouver for rehabilitation and took courses in computer and bookkeeping. He participated in wheelchair basketball and learned to scuba dive. In approximately 1989, he returned to Cranbrook where he continued accounting courses and enjoyed spending time with family, playing cards and listening to music.\n\nGordon passed away on Sunday, May 17, 2015. He is survived by his mother, 1 sister, 1 brother, 2 nieces and 5 nephews, 4 great-nieces and 3 great-nephews who came to know him as “Gaffer.” Gordon was pre-deceased by his father William, brothers Bill and Trevor and his grandparents Hogg and White.\n\nA funeral service for Gordon was held on Monday, May 25, 2015 at 1:00 pm at McPherson Funeral Home in Cranbrook.\n\nExcerpt from obituary\n\nSource: McPherson Funeral Home on-line\n\nGordon was born in Nelson, BC and the family moved to Revelstoke shortly after. In 1977, the family moved to Cranbrook. After finishing high school, Gordon worked in the shops for Canadian Pacific Railway until his accident which took the use of his legs and left him confined to a wheelchair. Gordon then lived in Vancouver for rehabilitation and took courses in computer and bookkeeping. He participated in wheelchair basketball and learned to scuba dive. In approximately 1989, he returned to Cranbrook where he continued accounting courses and enjoyed spending time with family, playing cards and listening to music.\n\nGordon passed away on Sunday, May 17, 2015. He is survived by his mother, 1 sister, 1 brother, 2 nieces and 5 nephews, 4 great-nieces and 3 great-nephews who came to know him as “Gaffer.” Gordon was pre-deceased by his father William, brothers Bill and Trevor and his grandparents Hogg and White.\n\nA funeral service for Gordon was held on Monday, May 25, 2015 at 1:00 pm at McPherson Funeral Home in Cranbrook.\n\nExcerpt from obituary\n\nSource: McPherson Funeral Home on-line"}, {"url": "https://www.ancientfaces.com/person/robert-gordon-hogg-birth-1919-death-1944/164228254", "page_content": "Refresh this page to see various historical events that occurred during Robert's lifetime.\n\nIn 1919, in the year that Robert Gordon Hogg was born, in Norfolk Virginia, the first rotary dial telephones were introduced by the American Telephone and Telegraph Company (AT&T), making it easier to make a call without an operator.\n\nIn 1920, by the time he was just 1 year old, the Volstead Act became law. Formally called the National Prohibition Act, the Volstead Act enabled law enforcement agencies to carry out the 18th Amendment. It said that \"no person shall manufacture, sell, barter, transport, import, export, deliver, or furnish any intoxicating liquor except as authorized by this act\" and defined intoxicating liquor as any beverage containing more than 0.5% alcohol by volume.\n\nIn 1922, he was only 3 years old when on November 4th, British Egyptologists George Carnarvon and Howard Carter unearthed the first step leading to King Tutankhamen's tomb in the Valley of the Kings. By the end of the month they had unearthed the steps and broken through the door into the intact tomb. This was the only tomb that had remained unlooted that had been found (and is, to date). Filled with gold, jewels, and ancient everyday items, the find was priceless - in terms of money and history.\n\nIn 1930, by the time he was merely 11 years old, as head of the Motion Picture Producers and Distributors of America, William Hays established a code of decency that outlined what was acceptable in films. The public - and government - had felt that films in the '20's had become increasingly risque and that the behavior of its stars was becoming scandalous. Laws were being passed. In response, the heads of the movie studios adopted a voluntary \"code\", hoping to head off legislation. The first part of the code prohibited \"lowering the moral standards of those who see it\", called for depictions of the \"correct standards of life\", and forbade a picture from showing any sort of ridicule towards a law or \"creating sympathy for its violation\". The second part dealt with particular behavior in film such as homosexuality, the use of specific curse words, and miscegenation.\n\nIn 1944, in the year of Robert Gordon Hogg's passing, on June 22nd, the Servicemen's Readjustment Act of 1944, called the G.I. Bill, was signed into law, pushed through by the veteran's organizations. Benefits provided for veterans to return to school (high school, vocational school, or college), obtain low interest home mortgages and low interest business loans, and (if needed) one year of unemployment insurance. Since most returning vets immediately found work, less than 20% of the unemployment benefits were distributed."}], "Gordon Hogg is a Canadian politician.": [{"url": "https://www.wikiwand.com/en/Gordon_J._Hogg", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Gordon J. Hogg?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.todayinbc.com/federal-election/federal-election-meet-the-candidates-gordie-hogg-liberal/", "page_content": "Gordie Hogg, Liberal candidate for South Surrey-White Rock, has had a lifelong commitment to a vision of Canada – and his home community – as an inclusive society with equal opportunities for everyone to thrive and prosper.\n\nBut a driving force behind his political activism, he recalled, has always been something his mother Kay said to him when he was just out of high school and a Little League coach trying to get his players to an Edmonton championship.\n\nHe had attended a White Rock council meeting to ask for funding and had been discouraged by what he saw then as a tedious and silly process.\n\n“I told my mom and she looked at me and said, ‘I thought I always raised you to be the kind of person who would, if you didn’t like what was going on, you’d get involved and do something to change it.'”\n\nHis service has included being a council member, and later mayor, of the City of White Rock; two decades as MLA for the area, and a subsequent stint as South Surrey-White Rock MP following a win in the 2017 byelection.\n\n“I discovered that, in political life one could make changes that impacted a lot of people for the better,” he said.\n\nHe can point with pride to tangible benefits to both his home community and the broader population, including overseeing the building of the White Rock promenade, and – as provincial Minister of Children and Families – creating Community Living BC , now a $1.3 billion government agency that supports families and people with disabilities .\n\nAlthough his time in Ottawa was short before the national election in 2019, Hogg also helped secure federal funding to bring clean water to the Semiahmoo First Nation, and continued his ongoing activism against the shipping of thermal coal through the community.\n\nAlthough born in Victoria – Hogg points out there wasn’t a local hospital at the time (his mother was in the forefront of women who campaigned for the creation of Peace Arch Hospital) – he is proud to say he has been a resident of White Rock since he was two months old.\n\nHogg said his dedication to to the community has also been inspired by his father, Dr. Al Hogg, whose historic commitment to community health and well-being has been honoured by dedications of both a pavilion at Peace Arch Hospital and a park in his name.\n\nHis parents’ example has also been seen in the way Hogg and his wife LaVerne have raised their own children, and in his commitment to young people in his work as a youth probation officer at the Salvation Army House of Concord, and later as warden of the Burnaby Youth Custody Centre. It has also inspired him to foster four young people and to go on and found Night Hoops Basketball, a no-cost community program that helps get youth of the street.\n\nHogg has also earned bachelor’s and master’s degrees, and latterly a Ph.D, for which his thesis very much hewed to his passion: ‘Creating Public Policy in a Complex Society.’\n\nPeace Arch News"}, {"url": "https://wiki2.org/en/Gordie_Hogg", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nCanadian politician\n\nGordon \"Gordie\" Hogg (born August 24, 1946) is a Canadian politician who served as the Member of Parliament (MP) for South Surrey—White Rock in the House of Commons of Canada from 2017 to 2019, as a member of the Liberal Party of Canada. He previously represented Surrey-White Rock in the Legislative Assembly of British Columbia from 1997 to 2017 as part of the British Columbia Liberal Party caucus, serving in several cabinet positions under Premier Gordon Campbell during that time, and was the mayor of White Rock, British Columbia from 1984 to 1993.\n\nBackground\n\nHogg was born in Victoria to Kathleen and Dr. Allan Hogg, a prominent physician in White Rock, who was instrumental in establishing the first White Rock Hospital in 1954, and is the oldest of four children. Dr. Hogg went on to deliver more than 1,100 children during his time in the community, with a wing of the Peace Arch Hospital named in his honour.[1][2]\n\nWhile attending the University of British Columbia (UBC), Hogg was a two-sport athlete, playing football and basketball, including winning the National Junior Men’s Basketball Championship in 1967.[3] He graduated from UBC with a bachelor of arts in sociology and psychology, and from Antioch College with a master's degree in psychology.[4][5]\n\nHogg began coaching baseball in the community in his teens. He was asked to go before White Rock City Council to request support for the team to go to Edmonton for the championships. Upon returning home, Hogg said that he thought the whole thing had been pointless, to which his mother replied “Son, I hoped I’d always raised you to be the kind of person that if you didn’t like something, you wouldn’t complain about it, but you’d get involved and try and make a difference.” Hogg has said that this is what led him to run for politics, first at the municipal level, then provincially and federally.[2][6]\n\nHe had worked for the Salvation Army's House of Concord as a probation officer, and the British Columbia corrections service as a regional director.[2][7] In 1996, while working as director of the Burnaby Youth Custody Centre, he established Night Hoops, a nighttime basketball program for at-risk youth to help reduce recidivism and other related issues.[8]\n\nHogg and his wife LaVerne have one son, Blair. They were also foster parents and billet parents for the Surrey Eagles hockey team. He had served on the board of organizations such as Peace Arch Hospital and the Peace Arch Community Health Council.[5]\n\nPolitical career\n\nMunicipal\n\nHogg was elected in 1974 as alderman for the City of White Rock, serving in that role from 1975 to 1983.[9][10] He was then elected the city's mayor in 1984, serving until 1993.[9][10] During his tenure as mayor, Hogg oversaw the development of the White Rock Promenade along the waterfront,[2] as well as the repurposing of the old train station into the White Rock Museum and Archives.\n\nProvincial\n\nWith incumbent Surrey-White Rock member of the Legislative Assembly (MLA) Wilf Hurd resigning to run in the 1997 federal election, Hogg was approached by the British Columbia Liberal Party to contest the riding's by-election.[11] He was elected to the British Columbia Legislative Assembly at the 1997 by-election,[5][12] and held the seat for twenty years. While the Liberals were in opposition, Hogg served as critic for education and human resources.[5] He shared an apartment in Victoria with Geoff Plant and party leader Gordon Campbell during that time.[13]\n\nWhen the Liberals formed government following the 2001 provincial election, Hogg was appointed Minister of Children and Family Development by Premier Campbell.[5][14] He was forced to resign from that role in January 2004 during an investigation into the ministry's spending;[15] an audit by PricewaterhouseCoopers concluded there was no evidence of fraud or misappropriation of the ministry's funds.[16][17]\n\nHe re-entered the cabinet in August 2006 to serve as Minister of State for ActNow BC, a provincial initiative to promote healthy living.[17] He then served as Minister of State for Mining from June 2008 until being replaced by Randy Hawes in June 2009.[14] He was subsequently named Parliamentary Secretary for Social Entrepreneurship.[18]\n\nHogg was chosen as government caucus chair by fellow Liberal MLAs in July 2011, replacing the outgoing Ron Cantelon.[19] He was also named Parliamentary Secretary for Non-Profit Partnerships by Premier Christy Clark in September 2011,[20] before being reassigned to the role of Parliamentary Secretary for Youth Sport in September 2015.[21]\n\nHogg announced in October 2016 that he would not seek re-election in 2017.[7] The BC Liberals chose Tracy Redies, former CEO of Coast Capital Savings, as the next candidate for the riding.[22]\n\nFederal\n\nHogg first ran for federal office under the federal Liberal banner in the riding of Surrey—White Rock—South Langley in 1993, placing second behind Reform candidate Val Meredith.[23]\n\nIn 2017, Hogg was selected as the Liberal candidate for the South Surrey—White Rock by-election, resulting from the resignation of incumbent Conservative MP Dianne Watts.[24] Hogg defeated former cabinet minister and former MP from neighbouring Delta—Richmond East, Conservative candidate Kerry-Lynne Findlay, in the by-election. This marked the first time a Liberal had won the riding since the 1940s, when it included all of Surrey, and most of New Westminster.[25] On March 21, 2018, Hogg was elected as chair of the Federal Liberal Pacific Caucus.[26] He sat on the House of Commons Standing Committee on Human Resources, Skills and Social Development and the Status of Persons with Disabilities, and the Standing Committee on Canadian Heritage.[9]\n\nHogg lost the seat to Findlay in the 2019 federal election;[27] he was defeated by Findlay again in 2021.[28]\n\nRecent activities\n\nAt the age of 70, while working as an MLA, Hogg completed an interdisciplinary doctorate that focused on public policy from Simon Fraser University (SFU).[29] He was subsequently named an adjunct professor in criminology at SFU in 2017.[4][7]\n\nHe ran for mayor of Surrey in the 2022 municipal election as part of the Surrey First slate,[28][30] finishing third behind winner Brenda Locke and incumbent Doug McCallum.[31]\n\nElectoral record\n\nFederal\n\n\n\n\n\nProvincial\n\nB.C. General Election 2001: Surrey-White Rock Party Candidate Votes % ± Expenditures Liberal Gordon J. Hogg 18,678 68.70 +10.66 $46,685 Green Ruth Christine 3,577 13.16 +10.98 $2,700 NDP Matt Todd 3,415 12.56 -13.87 $5,509 Unity Garry Sahl 983 3.62 - Marijuana David Bourgeois 536 1.96 - $394 Total valid votes 27,189 100.00 Total rejected ballots 91 0.33 Turnout 27,280 77.64\n\nReferences"}, {"url": "https://peoplepill.com/people/gordon-hogg/", "page_content": "Gordon Hogg (born August 24, 1946) is a Canadian municipal and provincial politician. As a BC Liberal Member of the Legislative Assembly, in the province of British Columbia, he has represented the riding of Surrey-White Rock since 1997. Hogg announced in October 2016 that he will not seek re-election in 2017. The Liberal Party chose Tracy Redies, former CEO of Coast Capital Savings as the next candidate for his riding, which boundaries will be adjusted.\n\nHe currently serves as the Parliamentary Secretary for Not for Profit-Public Partnerships. Previously he has been Minister of State for Mining, Minister of State for ActNowBC and Minister of Children and Family Development.\n\nHogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nHe served on White Rock city council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch Hospital. He has also been a foster parent and Little League coach.\n\nHogg and his wife, LaVerne, live in White Rock and have one son. His father Al Hogg was a prominent physician in White Rock honoured with the naming of a residential care facility at Peace Arch Hospital."}, {"url": "https://www.sfu.ca/fass/news/2016/06/white-rock-politician-seeks-to-improve-public-policies.html", "page_content": "Throughout his 40 years of elected office, Gordon Hogg has seen the good, the bad and the ugly when it comes to creating public policy. But he says as citizens become isolated and disconnected in an increasingly complex society, the matter of creating successful policy is more challenging than ever.\n\nIt’s an issue that drove the MLA for Surrey-White Rock back to school, completing his PhD at SFU in the process. On Thursday June 9 he’ll receive his degree, and at 70, is the oldest member of SFU’s 2016 spring convocation class.\n\nFor his thesis, Creating Public Policy in a Complex Society: The Context, the Processes, the Decisions, Hogg examined nearly 100 global studies on public policy development.\n\nRead more...\n\n"}, {"url": "https://prabook.com/web/gordon.hogg/2317300", "page_content": "Gordon Hogg\n\npolitician\n\nAugust 24, 1946\n\nHe has represented the riding of Surrey-White Rock since 1997. He currently serves as the Parliamentary Secretary for Not for Profit-Public Partnerships. Previously he has been Minister of State for Mining, Minister of State for ActNowBC and Minister of Children and Family Development. Hogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College. He served on White Rock city council for 20 years, for 10 of which he was mayor. He has also been a foster parent and Little League coach. His father First Rate (at Lloyd's) Hogg was a prominent physician in White Rock honoured with the naming of a residential care facility at Peace Architecture Hospital."}, {"url": "https://www.peacearchnews.com/news/federal-election-q-a-with-gordie-hogg-liberals/", "page_content": "Liberal candidate Gordon Hogg is running in the South Surrey-White Rock riding in the upcoming federal election. (Contributed photo)\n\nPeace Arch News reached out to the four candidates running for the South Surrey-White Rock riding in the Sept. 20 federal election and asked them each to respond to four questions.\n\nBelow are the responses from Gordie Hogg (Liberals) in his own words:\n\n1) Following another summer of record-breaking heat in B.C., what actions would your party take, if elected, to immediately address the causes and impacts of climate change?\n\nA: I know that climate change is real, as do the residents of Lytton, those who lost loved ones in the heat dome, and most other Canadians.\n\nIf elected, I commit to building on the results of the Liberals’ 2015 $60 billion climate plan and to ensuring that our community directly benefits from goals in the new $17.6 billion strategy for a green recovery – reaching net-zero by 2050, preserving 25 per cent of our lands and oceans by 2025, boosting domestic green technology and energy, creating sustainable jobs and planting two billion trees.\n\nSouth Surrey/White Rock is witnessing the impacts of climate change. I commit to ensuring that residents benefit from programs like the $2 billion Disaster Mitigation and Adaptation Fund to help manage droughts and floods, restore shorelines and make our homes more energy efficient.\n\nFor 15 years I’ve worked with local activists to rid our community of thermal coal, and I’m pleased to announce that all exports of thermal coal will end no later than 2030. This is an important milestone, the first of many.\n\n2) Canada remains in the grips of a global pandemic. What steps need to be taken to get Canadians safely through this crisis, to facilitate economic recovery and to ensure our nation is better prepared for future public-health emergencies?\n\nA: When COVID hit, the Liberal government took immediate, decisive action to stabilize the economy and support Canadians with the largest economic aid package in generations. As of Sept. 1, 76.7 per cent of Canadians 12-plus are fully vaccinated, a key signpost of progress towards normal life.\n\nI will advocate for our community as we navigate the next steps in Canada’s economic recovery.\n\nIn April, the Liberals launched a $101.4 billion growth strategy with important measures including a $30 billion childcare program, a $17.6 billion investment in a green recovery, support for small businesses, tourism and entrepreneurs, targeted tax measures and income supports including boosting Old Age Security. Economic recovery needs to be felt at the household level, and I will strive to ensure that it is.\n\nIn terms of future public-health emergencies, I will support Liberal government campaigns to rebuild domestic vaccine manufacturing capacity, boost research, protect the most vulnerable and make long-term care homes safer.\n\n3) The price of everything from housing to food and child care is rising rapidly. What steps would a government formed by your party take to ensure all Canadians have access to safe and adequate housing and a healthy diet?\n\nA: I’ve seen the financial pressure facing our community in young families who fear they may never be able to buy their first home, and seniors who fear the loss of life-long homes.\n\nI commit to ensuring that residents benefit from Liberal government programs for first-time homebuyers, rent-to-own projects, social housing initiatives, the $40-billion National Housing Strategy and the $2 billion Canada Housing Benefit. Housing is for people, not speculators.\n\nI commit to supporting the Liberal government’s measures to help our families – the Canada Child Benefit, $10 a day daycare, reduced taxes on small businesses and the middle class, targeted income supports, and jobs. New recovery programs and infrastructure investments are projected to create one million jobs, and I will ensure some of these jobs are in our community.\n\nI will support programs that put more money in residents’ pockets and connect residents with resources. Poverty is the biggest reason people are hungry or homeless, and I commit to connecting people to programs to make sure there’s food on every table and a roof over every head.\n\n4) Racial justice and reconciliation are at the forefront of Canadian consciousness. What steps need to be taken to help right past wrongs and ensure that all Canadians are granted equal voice, opportunity and respect?\n\nA: I am proud of the diversity of our community.\n\nI am proud to be part of a party that has made historic investments to support equality, diversity and reconciliation via commitments to a $30 billion child-care program, an $18 billion program for Indigenous peoples, more than $1 billion to address systemic racism, and the most significant advancement in disability rights in 30 years.\n\nThese commitments will help ensure that all Canadians can participate fully in our communities.\n\nIn terms of righting past wrongs, I was very pleased to have worked closely with the Semiahmoo First Nation on the lifting of its 16-year boiled-water advisory and look forward to continuing action to advance meaningful reconciliation.\n\nIn April, the Liberal government passed legislation to adopt the UN Declaration on the Rights of Indigenous People, an action that paves the way for transformative change in First Nations communities.\n\nThese and other Liberal government programs support equality, opportunity and respect, values enshrined in our Charter of Rights and Freedoms that I will strive to advance across our community.\n\n\n\neditorial@peacearchnews.com\n\nLike us on Facebook and follow us on Twitter\n\nCanada Election 2021"}, {"url": "https://happyhappybirthday.net/en/age/gordon-hogg-person_ffqfxay", "page_content": "Gordon Hogg\n\nCanadian politician – Gordon Hogg was born in New Westminster (city in British Columbia, Canada) on August 24th, 1946 and is 76 years old today.\n\nAge How old is Gordon Hogg? 76 Gordon Hogg is 76 years old.\n\nBiographical data\n\nGordon Hogg\n\nBirthday When was Gordon Hogg born? Gordon Hogg was born on August 24th, 1946.\n\nPlace of Birth Where was Gordon Hogg born? New Westminster (city in British Columbia, Canada).\n\n♍ ♍ Zodiac What is the zodiac sign of Gordon Hogg? Gordon Hogg was born in the zodiac sign Virgo (The Maiden)."}, {"url": "https://www.todayinbc.com/news/federal-election-q-a-with-gordie-hogg-liberals/", "page_content": "Liberal candidate Gordon Hogg is running in the South Surrey-White Rock riding in the upcoming federal election. (Contributed photo)\n\nPeace Arch News reached out to the four candidates running for the South Surrey-White Rock riding in the Sept. 20 federal election and asked them each to respond to four questions.\n\nBelow are the responses from Gordie Hogg (Liberals) in his own words:\n\n1) Following another summer of record-breaking heat in B.C., what actions would your party take, if elected, to immediately address the causes and impacts of climate change?\n\nA: I know that climate change is real, as do the residents of Lytton, those who lost loved ones in the heat dome, and most other Canadians.\n\nIf elected, I commit to building on the results of the Liberals’ 2015 $60 billion climate plan and to ensuring that our community directly benefits from goals in the new $17.6 billion strategy for a green recovery – reaching net-zero by 2050, preserving 25 per cent of our lands and oceans by 2025, boosting domestic green technology and energy, creating sustainable jobs and planting two billion trees.\n\nSouth Surrey/White Rock is witnessing the impacts of climate change. I commit to ensuring that residents benefit from programs like the $2 billion Disaster Mitigation and Adaptation Fund to help manage droughts and floods, restore shorelines and make our homes more energy efficient.\n\nFor 15 years I’ve worked with local activists to rid our community of thermal coal, and I’m pleased to announce that all exports of thermal coal will end no later than 2030. This is an important milestone, the first of many.\n\n2) Canada remains in the grips of a global pandemic. What steps need to be taken to get Canadians safely through this crisis, to facilitate economic recovery and to ensure our nation is better prepared for future public-health emergencies?\n\nA: When COVID hit, the Liberal government took immediate, decisive action to stabilize the economy and support Canadians with the largest economic aid package in generations. As of Sept. 1, 76.7 per cent of Canadians 12-plus are fully vaccinated, a key signpost of progress towards normal life.\n\nI will advocate for our community as we navigate the next steps in Canada’s economic recovery.\n\nIn April, the Liberals launched a $101.4 billion growth strategy with important measures including a $30 billion childcare program, a $17.6 billion investment in a green recovery, support for small businesses, tourism and entrepreneurs, targeted tax measures and income supports including boosting Old Age Security. Economic recovery needs to be felt at the household level, and I will strive to ensure that it is.\n\nIn terms of future public-health emergencies, I will support Liberal government campaigns to rebuild domestic vaccine manufacturing capacity, boost research, protect the most vulnerable and make long-term care homes safer.\n\n3) The price of everything from housing to food and child care is rising rapidly. What steps would a government formed by your party take to ensure all Canadians have access to safe and adequate housing and a healthy diet?\n\nA: I’ve seen the financial pressure facing our community in young families who fear they may never be able to buy their first home, and seniors who fear the loss of life-long homes.\n\nI commit to ensuring that residents benefit from Liberal government programs for first-time homebuyers, rent-to-own projects, social housing initiatives, the $40-billion National Housing Strategy and the $2 billion Canada Housing Benefit. Housing is for people, not speculators.\n\nI commit to supporting the Liberal government’s measures to help our families – the Canada Child Benefit, $10 a day daycare, reduced taxes on small businesses and the middle class, targeted income supports, and jobs. New recovery programs and infrastructure investments are projected to create one million jobs, and I will ensure some of these jobs are in our community.\n\nI will support programs that put more money in residents’ pockets and connect residents with resources. Poverty is the biggest reason people are hungry or homeless, and I commit to connecting people to programs to make sure there’s food on every table and a roof over every head.\n\n4) Racial justice and reconciliation are at the forefront of Canadian consciousness. What steps need to be taken to help right past wrongs and ensure that all Canadians are granted equal voice, opportunity and respect?\n\nA: I am proud of the diversity of our community.\n\nI am proud to be part of a party that has made historic investments to support equality, diversity and reconciliation via commitments to a $30 billion child-care program, an $18 billion program for Indigenous peoples, more than $1 billion to address systemic racism, and the most significant advancement in disability rights in 30 years.\n\nThese commitments will help ensure that all Canadians can participate fully in our communities.\n\nIn terms of righting past wrongs, I was very pleased to have worked closely with the Semiahmoo First Nation on the lifting of its 16-year boiled-water advisory and look forward to continuing action to advance meaningful reconciliation.\n\nIn April, the Liberal government passed legislation to adopt the UN Declaration on the Rights of Indigenous People, an action that paves the way for transformative change in First Nations communities.\n\nThese and other Liberal government programs support equality, opportunity and respect, values enshrined in our Charter of Rights and Freedoms that I will strive to advance across our community.\n\neditorial@peacearchnews.comLike us on Facebook and follow us on Twitter\n\nPeace Arch News"}, {"url": "https://alchetron.com/Gordon-Hogg", "page_content": "Gordon Hogg (born August 24, 1946) is a Canadian municipal and provincial politician. As a BC Liberal Member of the Legislative Assembly, in the province of British Columbia, he has represented the riding of Surrey-White Rock from 1997 until 2017. Hogg announced in October 2016 that he will not seek re-election in 2017. The Liberal Party chose Tracy Redies, former CEO of Coast Capital Savings as the next candidate for his riding, which boundaries will be adjusted.\n\nContents\n\nHe formerly served as the Parliamentary Secretary for Not for Profit-Public Partnerships. Previously he has been Minister of State for Mining, Minister of State for ActNowBC and Minister of Children and Family Development.\n\nHogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master's degree in psychology from Antioch College. At the age of 70, while working as a Member of Legislative Assembly, he completed an interdisciplinary doctorate that focused on public policy from the University of Simon Fraser.\n\nHe served on White Rock city council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch Hospital. He has also been a foster parent and Little League coach.\n\nHogg and his wife, LaVerne, live in White Rock and have one son. His father Al Hogg was a prominent physician in White Rock honoured with the naming of a residential care facility at Peace Arch Hospital."}], "Gordon Hogg served as the Member of the Legislative Assembly of British Columbia for Surrey-White Rock from 2001 to 2017.": [{"url": "https://www.leg.bc.ca/content/legacy/web/mla/38thparl/hogg.htm", "page_content": "38th Parliament Members\n\nat dissolution on April 14, 2009\n\nMLA: Hon. Gordon Hogg Surrey-White Rock Minister of State for Mining Elected: 1997, 2001, 2005 BRITISH COLUMBIA LIBERAL PARTY\n\nGordon Hogg was appointed Minister of State for Mining on June 23, 2008.\n\nHe previously served as Minister of State for ActNow BC and Minister of Children and Family Development.\n\nMr. Hogg also served as chair of the Government Caucus and was a member of the Legislative Assembly Management Committee. He was also the chair of the Seniors Caucus Committee and has served on the Cabinet Committee for Agenda Development and the Select Standing Committees on Finance and Government Services; Sustainable Aquaculture; Children and Youth; Health and Social Services; Justice; Constitutional Affairs; and Intergovernmental Relations.\n\nPreviously, Mr. Hogg served as the Official Opposition Critic for education and human resources and was also a member of the Official Opposition Caucus Committees on Health and Education.\n\nGordon Hogg was first elected to represent the riding of Surrey-White Rock in a 1997 by-election. He was re-elected in 2001 and again in 2005.\n\nMr. Hogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nMr. Hogg served on White Rock council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch District Hospital. He has also been a foster parent and little league coach.\n\nGordon and his wife, LaVerne, live in White Rock and have one son.\n\n\n\n"}, {"url": "https://wiki2.org/en/Gordie_Hogg", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nCanadian politician\n\nGordon \"Gordie\" Hogg (born August 24, 1946) is a Canadian politician who served as the Member of Parliament (MP) for South Surrey—White Rock in the House of Commons of Canada from 2017 to 2019, as a member of the Liberal Party of Canada. He previously represented Surrey-White Rock in the Legislative Assembly of British Columbia from 1997 to 2017 as part of the British Columbia Liberal Party caucus, serving in several cabinet positions under Premier Gordon Campbell during that time, and was the mayor of White Rock, British Columbia from 1984 to 1993.\n\nBackground\n\nHogg was born in Victoria to Kathleen and Dr. Allan Hogg, a prominent physician in White Rock, who was instrumental in establishing the first White Rock Hospital in 1954, and is the oldest of four children. Dr. Hogg went on to deliver more than 1,100 children during his time in the community, with a wing of the Peace Arch Hospital named in his honour.[1][2]\n\nWhile attending the University of British Columbia (UBC), Hogg was a two-sport athlete, playing football and basketball, including winning the National Junior Men’s Basketball Championship in 1967.[3] He graduated from UBC with a bachelor of arts in sociology and psychology, and from Antioch College with a master's degree in psychology.[4][5]\n\nHogg began coaching baseball in the community in his teens. He was asked to go before White Rock City Council to request support for the team to go to Edmonton for the championships. Upon returning home, Hogg said that he thought the whole thing had been pointless, to which his mother replied “Son, I hoped I’d always raised you to be the kind of person that if you didn’t like something, you wouldn’t complain about it, but you’d get involved and try and make a difference.” Hogg has said that this is what led him to run for politics, first at the municipal level, then provincially and federally.[2][6]\n\nHe had worked for the Salvation Army's House of Concord as a probation officer, and the British Columbia corrections service as a regional director.[2][7] In 1996, while working as director of the Burnaby Youth Custody Centre, he established Night Hoops, a nighttime basketball program for at-risk youth to help reduce recidivism and other related issues.[8]\n\nHogg and his wife LaVerne have one son, Blair. They were also foster parents and billet parents for the Surrey Eagles hockey team. He had served on the board of organizations such as Peace Arch Hospital and the Peace Arch Community Health Council.[5]\n\nPolitical career\n\nMunicipal\n\nHogg was elected in 1974 as alderman for the City of White Rock, serving in that role from 1975 to 1983.[9][10] He was then elected the city's mayor in 1984, serving until 1993.[9][10] During his tenure as mayor, Hogg oversaw the development of the White Rock Promenade along the waterfront,[2] as well as the repurposing of the old train station into the White Rock Museum and Archives.\n\nProvincial\n\nWith incumbent Surrey-White Rock member of the Legislative Assembly (MLA) Wilf Hurd resigning to run in the 1997 federal election, Hogg was approached by the British Columbia Liberal Party to contest the riding's by-election.[11] He was elected to the British Columbia Legislative Assembly at the 1997 by-election,[5][12] and held the seat for twenty years. While the Liberals were in opposition, Hogg served as critic for education and human resources.[5] He shared an apartment in Victoria with Geoff Plant and party leader Gordon Campbell during that time.[13]\n\nWhen the Liberals formed government following the 2001 provincial election, Hogg was appointed Minister of Children and Family Development by Premier Campbell.[5][14] He was forced to resign from that role in January 2004 during an investigation into the ministry's spending;[15] an audit by PricewaterhouseCoopers concluded there was no evidence of fraud or misappropriation of the ministry's funds.[16][17]\n\nHe re-entered the cabinet in August 2006 to serve as Minister of State for ActNow BC, a provincial initiative to promote healthy living.[17] He then served as Minister of State for Mining from June 2008 until being replaced by Randy Hawes in June 2009.[14] He was subsequently named Parliamentary Secretary for Social Entrepreneurship.[18]\n\nHogg was chosen as government caucus chair by fellow Liberal MLAs in July 2011, replacing the outgoing Ron Cantelon.[19] He was also named Parliamentary Secretary for Non-Profit Partnerships by Premier Christy Clark in September 2011,[20] before being reassigned to the role of Parliamentary Secretary for Youth Sport in September 2015.[21]\n\nHogg announced in October 2016 that he would not seek re-election in 2017.[7] The BC Liberals chose Tracy Redies, former CEO of Coast Capital Savings, as the next candidate for the riding.[22]\n\nFederal\n\nHogg first ran for federal office under the federal Liberal banner in the riding of Surrey—White Rock—South Langley in 1993, placing second behind Reform candidate Val Meredith.[23]\n\nIn 2017, Hogg was selected as the Liberal candidate for the South Surrey—White Rock by-election, resulting from the resignation of incumbent Conservative MP Dianne Watts.[24] Hogg defeated former cabinet minister and former MP from neighbouring Delta—Richmond East, Conservative candidate Kerry-Lynne Findlay, in the by-election. This marked the first time a Liberal had won the riding since the 1940s, when it included all of Surrey, and most of New Westminster.[25] On March 21, 2018, Hogg was elected as chair of the Federal Liberal Pacific Caucus.[26] He sat on the House of Commons Standing Committee on Human Resources, Skills and Social Development and the Status of Persons with Disabilities, and the Standing Committee on Canadian Heritage.[9]\n\nHogg lost the seat to Findlay in the 2019 federal election;[27] he was defeated by Findlay again in 2021.[28]\n\nRecent activities\n\nAt the age of 70, while working as an MLA, Hogg completed an interdisciplinary doctorate that focused on public policy from Simon Fraser University (SFU).[29] He was subsequently named an adjunct professor in criminology at SFU in 2017.[4][7]\n\nHe ran for mayor of Surrey in the 2022 municipal election as part of the Surrey First slate,[28][30] finishing third behind winner Brenda Locke and incumbent Doug McCallum.[31]\n\nElectoral record\n\nFederal\n\n\n\n\n\nProvincial\n\nB.C. General Election 2001: Surrey-White Rock Party Candidate Votes % ± Expenditures Liberal Gordon J. Hogg 18,678 68.70 +10.66 $46,685 Green Ruth Christine 3,577 13.16 +10.98 $2,700 NDP Matt Todd 3,415 12.56 -13.87 $5,509 Unity Garry Sahl 983 3.62 - Marijuana David Bourgeois 536 1.96 - $394 Total valid votes 27,189 100.00 Total rejected ballots 91 0.33 Turnout 27,280 77.64\n\nReferences"}, {"url": "https://voiceonline.com/gordon-hogg-approached-by-surrey-first-to-run-for-mayor/", "page_content": "FORMER South Surrey-White Rock MP Gordon Hogg, who is also a former White Rock mayor and MLA, confirmed to the VOICE on Tuesday that he has been approached by Surrey First to run for mayor of Surrey.\n\nHe added: “I am going to be meeting with them [this coming weekend] and I am not sure what my decision will be as a result of that.”\n\nAsked if he was seriously considering a run, he replied: “I’ve been approached by that group. I have also been approached to consider running for mayor of White Rock and I am meeting with my family this week to see whether or not there’s some type of agreement on that.”\n\nHe added: “So, it’s somewhat up in the air – all of it’s up in the air right now.”\n\nBACK in 2017, Hogg was selected as the federal Liberal candidate in a by-election in South Surrey—White Rock when incumbent Conservative MP Dianne Watts — who founded Surrey First in 2007 — resigned. Hogg defeated Conservative candidate Kerry-Lynne Findlay, but lost to her in the 2019 federal election. He lost to her again in 2021.\n\nIn an interview with The VOICE in 2017, he pointed out that he was on White Rock Council first as a Councillor for 10 years and then as the mayor for another 10 years.\n\nHe then became an MLA from the riding of Surrey-White Rock in a 1997 by-election. He was re-elected in 2001, 2005, 2009, and again in 2013.\n\nHe held several portfolios as MLA including Minister of Children and Family Development, Parliamentary Secretary for Youth Sport to the Minister of Community, Sport and Cultural Development, Parliamentary Secretary for Social Entrepreneurship to the Minister of Finance, Minister of State for Mining, and Minister of State for ActNow BC. Hogg also served as chair of the Government Caucus.\n\nHogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nGordon Hogg and his wife, LaVerne, live in White Rock and have one son. They have also been foster parents, Hogg told The VOICE at the time."}, {"url": "https://www.surreynowleader.com/news/former-white-rock-mayor-gordon-hogg-mulls-a-return-to-civic-politics/", "page_content": "Gordon Hogg says he’s “two to three weeks” away from a decision on whether to run for the mayor’s seat in either the Surrey or White Rock municipal races.\n\nHogg acknowledged this week that he has been asked to run in Surrey with the non-partisan civic organization Surrey First and has also been approached by individuals who’d like him to to run in White Rock in the elections, which will take place on Oct. 15.\n\n“I have a few more meetings – and a family meeting – coming up to discuss it,” the veteran politician and lifelong White Rock resident told Peace Arch News, noting that he is mindful of the challenges and stresses such a decision would place on himself and those around him.\n\n“I have mixed feelings, but I’m honoured to be asked,” said Hogg, who served as White Rock mayor from 1984 to 1993, after some 10 years before that as a council member.\n\nMoving on from the municipal arena he was elected B.C. Liberal MLA in the Surrey-White Rock riding in 1997, and was reelected four times before he retired in 2013.\n\nREAD ALSO: Hogg credits ‘deep roots’ for ending 64-year Liberal drought\n\nREAD ALSO: Peninsula voters send Conservative Kerry-Lynne Findlay to Ottawa\n\nHe was subsequently elected Liberal MP for White Rock – South Surrey in 2017 in a byelection prompted by the resignation of sitting Conservative MP Dianne Watts, but lost the seat in 2019 to Conservative challenger Kerry-Lynne Findlay, who also won a rematch during the federal election of 2021.\n\nHe said he has been impressed by those asking him to run again in both civic races that they are “searching for people who are willing to step up and serve the public, people with experience who are interested in seeing what solutions can be found” in an era of increasingly divisive politics.\n\n“If I ran in either, it would be because I felt I could make a significant contribution to the democratic process, in having a number of people who can represent a wide range of different values.\n\n“Building consensus and a co-ordinated approach are very important in local government; making sure that the people have the options they are looking for,” he said. “Unhealthy councils can be very bad for communities.”\n\n\n\nalex.browne@peacearchnews.com\n\nLike us on Facebook and follow us on Twitter\n\nCity of SurreyCity of White Rockmunicipal politics"}, {"url": "https://voiceonline.com/selected-liberals-candidate/", "page_content": "FORMER White Rock mayor and MLA Gordon Hogg has been chosen by the federal Liberals as their candidate in the South Surrey-White Rock federal riding in the December 11 by-election.\n\nHogg told The VOICE on Sunday that the official announcement will be made on Monday.\n\nThe South Surrey-White Rock riding fell vacant after Conservative MP Dianne Watts resigned to enter the BC Liberal leadership race.\n\nPrime Minister Justin Trudeau on Sunday announced that Parliamentary by-elections will be held on December 11 in the riding as well as in three other ridings:\n\n* Bonavista—Burin—Trinity, Newfoundland and Labrador\n\n* Scarborough—Agincourt, Ontario\n\n* Battlefords—Lloydminster, Saskatchewan\n\nHogg pointed out to The VOICE that he was on White Rock council first as a Councillor for 10 years and then as the mayor for another 10 years.\n\nHe then became an MLA from the riding of Surrey-White Rock in a 1997 by-election. He was re-elected in 2001, 2005, 2009, and again in 2013.\n\nHe held several portfolios as MLA including Minister of Children and Family Development, Parliamentary Secretary for Youth Sport to the Minister of Community, Sport and Cultural Development, Parliamentary Secretary for Social Entrepreneurship to the Minister of Finance, Minister of State for Mining, and Minister of State for ActNow BC.\n\nHogg also served as chair of the Government Caucus.\n\nMost recently, Hogg was awarded a PhD from Simon Fraser University (Creating Public Policy in a Complex Society) and appointed Adjunct Professor at the School of Criminology.\n\nHogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nGordon Hogg and his wife, LaVerne, live in White Rock and have one son. They have also been foster parents, Hogg told The VOICE."}, {"url": "https://leadinginfluence.com/mla-gordon-hogg-surrey-white-rock-8/", "page_content": "We thank you for Gordon Hogg, MLA for Surrey-White Rock. We pray you would bring winds of refreshing to MLA Hogg and a renewed sense of purpose and direction. We thank you for his willingness to serve and invest his time and energy on behalf of others. We acknowledge your guiding hand upon him throughout his career in government and pray you would use him to mentor those who are just starting out. We pray he would be plugged into areas where his many and varied experiences and acquired knowledge can be best utilized. We ask that you draw close to MLA Hogg and let him know that you are and always have been there. Bless him and his family with refreshing times together and good health. We ask this in Jesus’ name.\n\nGordon Hogg was first elected to represent the riding of Surrey-White Rock in a 1997 by-election. He was re-elected in 2001, 2005, 2009, and again in 2013.\n\nGordon has previously served as Parliamentary Secretary for Social Entrepreneurship to the Minister of Finance. He is also the former Minister of State for Mining, Minister of State for ActNow BC and Minister of Children and Family Development.\n\nGordon also served as chair of the Government Caucus and was a member of the Legislative Assembly Management Committee. He was also the chair of the Seniors Caucus Committee and a member of the Cabinet Committee for Agenda Development.\n\nHe has also served on the Select Standing Committees on Finance and Government Services; Children and Youth; Health and Social Services; Justice; Constitutional Affairs, and Intergovernmental Relations; and the Special Committee on Sustainable Aquaculture. He is currently a member of the Select Standing Committees on Aboriginal Affairs and Education.\n\nPreviously, he has also served as the Official Opposition Critic for education and human resources and was also a member of the Official Opposition Caucus Committees on Health and Education.\n\nGordon was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nHe served on White Rock council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch District Hospital. He has also been a foster parent and little league coach.\n\nGordon Hogg and his wife, LaVerne, live in White Rock and have one son."}, {"url": "https://www.cloverdalereporter.com/news/former-white-rock-mayor-gordon-hogg-mulls-a-return-to-civic-politics/", "page_content": "Gordon Hogg says he’s “two to three weeks” away from a decision on whether to run for the mayor’s seat in either the Surrey or White Rock municipal races.\n\nHogg acknowledged this week that he has been asked to run in Surrey with the non-partisan civic organization Surrey First and has also been approached by individuals who’d like him to to run in White Rock in the elections, which will take place on Oct. 15.\n\n“I have a few more meetings – and a family meeting – coming up to discuss it,” the veteran politician and lifelong White Rock resident told Peace Arch News, noting that he is mindful of the challenges and stresses such a decision would place on himself and those around him.\n\n“I have mixed feelings, but I’m honoured to be asked,” said Hogg, who served as White Rock mayor from 1984 to 1993, after some 10 years before that as a council member.\n\nMoving on from the municipal arena he was elected B.C. Liberal MLA in the Surrey-White Rock riding in 1997, and was reelected four times before he retired in 2013.\n\nREAD ALSO: Hogg credits ‘deep roots’ for ending 64-year Liberal drought\n\nREAD ALSO: Peninsula voters send Conservative Kerry-Lynne Findlay to Ottawa\n\nHe was subsequently elected Liberal MP for White Rock – South Surrey in 2017 in a byelection prompted by the resignation of sitting Conservative MP Dianne Watts, but lost the seat in 2019 to Conservative challenger Kerry-Lynne Findlay, who also won a rematch during the federal election of 2021.\n\nHe said he has been impressed by those asking him to run again in both civic races that they are “searching for people who are willing to step up and serve the public, people with experience who are interested in seeing what solutions can be found” in an era of increasingly divisive politics.\n\n“If I ran in either, it would be because I felt I could make a significant contribution to the democratic process, in having a number of people who can represent a wide range of different values.\n\n“Building consensus and a co-ordinated approach are very important in local government; making sure that the people have the options they are looking for,” he said. “Unhealthy councils can be very bad for communities.”\n\n\n\nalex.browne@peacearchnews.com\n\nLike us on Facebook and follow us on Twitter\n\nCity of SurreyCity of White Rockmunicipal politics"}, {"url": "https://www.peacearchnews.com/news/surrey-white-rock-mla-hogg-rejects-sixth-term-to-focus-on-community/", "page_content": "Surrey-White Rock MLA Gordon Hogg has announced he will not be seeking re-election.\n\nSurrey-White Rock MLA Gordon Hogg won’t be running for a sixth term in next spring’s provincial election.\n\nThe affable politician – a former White Rock mayor and councillor – said he has been mulling the decision for several months.\n\n“It’s with very mixed emotions that I’m announcing this,” he told Peace Arch News Monday afternoon, noting he takes pride not only in serving constituents, but in the accomplishments that he and his BC Liberal caucus colleagues have made since he first took provincial office in 1997.\n\n“We made a great team and changed the face of British Columbia for the better,” he said.\n\nBut Hogg said he’s reached the decision it’s time now for him to play a more direct role in the community he grew up in – which could involve taking up invitations to be involved as a board member with a number of community organizations.\n\nHogg’s decision adds another element of change to an already evolving provincial political scene in Surrey and the Semiahmoo Peninsula – with two fellow BC Liberals seeking to run in different Surrey ridings come the spring election.\n\nStephanie Cadieux, currently Surrey-Cloverdale MLA, announced Monday she is running in the newly created riding of Surrey South, while current Surrey-Panorama MLA Marvin Hunt will seek office in newly redrawn Surrey Cloverdale.\n\nCrescent Beach, which has been represented as part of Surrey-Cloverdale, and latterly Surrey Panorama, will return to its original alignment with Surrey-White Rock.\n\nHogg said he’s already finding the role of MLA is hard to step back from.\n\n“It really isn’t a job – it’s more of a lifestyle,” he said. “It becomes somewhat addictive for people. I’ve talked to others who have decided not to run again and they’ve said they have all gone through some form of withdrawal, and I’m going through that, too.”\n\nAt the same time, Hogg said, he has always felt very connected to White Rock residents, from his earliest days in Little League, through playing fastball and basketball, and later coaching – as well as in his 20 years as councillor and mayor.\n\n“You lose some of that when you’re going to Victoria and dealing with big-picture issues,” he said.\n\nThe office also represented a significant time commitment, he noted.\n\n“I’ve been averaging 70 hours a week. You come in at 7:30 in the morning and you usually don’t get out until 8:30 p.m., and there are also a lot of events on Friday nights and Saturdays and Sundays – but I’ve loved every bit of it.”\n\nAnd, Hogg said, he wouldn’t rule out a return to politics in some other arena in the future.\n\n“I haven’t thought about that in any real sense,” he said. “But I don’t want to rule out any options. Right now I’m wanting to focus on my work (as MLA) for the next eight months.”\n\nHogg said that since he first made it known he was considering withdrawing from provincial politics, he has been approached by several community organizations wondering whether he would consider serving on their boards.\n\nAnd while he’s not making any commitments, he said he doesn’t doubt that, once his provincial duties are over, he will continue to be heavily involved in the community.\n\n“I think I can contribute – I’ve learned a lot over the years,” he said.\n\nHe’s also been invited to become an adjunct professor at Simon Fraser University, where he completed his PhD earlier this year.\n\n“I’m looking forward to doing some teaching there – and they’ve also been talking with me about turning my dissertation (Creating Public Policy in a Complex Society) into a book.”\n\nThe former counsellor, probation officer and regional director of corrections occupied a number of posts in government, including minister of state for mining, minister of state for ActNow BC and minister of children and family development.\n\nHis current duties include serving on the Select Standing Committee on Aboriginal Affairs and the Select Standing Committee on Education.\n\nBut while he has worked on projects that have created important precedents and travelled internationally to address prestigious groups, Hogg said his most memorable and rewarding achievements have tended to be “the little things”; helping find funding for a deaf student to pursue post-secondary education, for example, or “working with groups like the White Rock Stroke Club and the Friends of the Semiahmoo Bay – little organizations that do great work but don’t get a lot of financial support – and being able to get them some money.”\n\nSuch groups, he said “are the heart and soul of a community.”\n\nIn a prepared statement released Tuesday morning, Hogg thanked a “strong support system” including his family, and his constituency and legislative staff “for ensuring I was prepared and well-represented.” He also thanked the people of Surrey-White Rock “for placing your confidence in me and bringing forward your issues and ideas.”\n\nIn a statement issued Tuesday, Premier Christy Clark said “Gordie’s unique wit and wisdom will be missed.”\n\n“Over the course of his career, Gordie has held an impressive array of roles, and in each he made tremendous and lasting contributions to BC public life,” she said.\n\n“Most recently, as Parliamentary Secretary for Youth Sport, Gordie brought to life the Premier’s Award for Aboriginal Youth Excellence in Sport, which honours and celebrates the next generation of First Nations leaders.”"}, {"url": "https://archive.news.gov.bc.ca/releases/news_releases_2005-2009/2006OTP0134-001042-Attachment2.htm", "page_content": "!DOCUMENT HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n\nHON. MICHAEL de JONG\n\nMINISTER OF ABORIGINAL RELATIONS AND RECONCILIATION\n\n<![if !supportEmptyParas]> <![endif]>\n\nMichael de Jong was appointed Minister of Aboriginal Relations and Reconciliation on Aug. 15, 2006.\n\n<![if !supportEmptyParas]> <![endif]>\n\nHe is also Government House Leader.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. de Jong has previously served as Minister of Labour and Citizens’ Services and Minister of Forests. Prior to that, he was deputy house leader for the Official Opposition and served as a critic for a variety of portfolios.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. de Jong was first elected to the Legislative Assembly in a 1994 byelection to represent the electoral district of Matsqui. He was re-elected in 1996 and again in 2001 to the new riding of Abbotsford-Mount Lehman, where he was again re-elected in 2005.\n\n<![if !supportEmptyParas]> <![endif]>\n\nBefore his election, Mr. de Jong practised as a lawyer in his Abbotsford firm. He holds a bachelor of arts degree from Carleton University in Ottawa and a law degree from the University of Alberta.\n\n<![if !supportEmptyParas]> <![endif]>\n\n<![if !supportEmptyParas]> <![endif]>\n\nHON. TOM CHRISTENSEN\n\nMINISTER OF CHILDREN AND FAMILY DEVELOPMENT\n\n<![if !supportEmptyParas]> <![endif]>\n\nTom Christensen was appointed Minister of Children and Family Development on Aug. 15, 2006.\n\n<![if !supportEmptyParas]> <![endif]>\n\nHe previously served as Minister of Aboriginal Relations and Reconciliation and Minister of Education.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. Christensen was elected to represent the riding of Okanagan-Vernon in 2001 and re-elected in 2005.\n\n<![if !supportEmptyParas]> <![endif]>\n\nHe currently serves as chair of the Cabinet Legislative Review Committee and as a member of the Government Caucus Committee on Natural Resources and the Economy.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. Christensen graduated from the University of Victoria with a law degree in 1994, and was called to the B.C. bar in May 1995. Prior to entering politics, he practiced law at Davidson & Company and was a partner in the firm from 1999 to 2001.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. Christensen was born and raised in Vernon, the fourth generation of his family to raise a family in the Vernon area. He has been involved in a number of community organizations, having held such positions as president of the Downtown Vernon Association, director of the Vernon Winter Carnival and chairperson of Vernon Jubilee Hospital Foundation's Annual Light-a-Bulb Fundraising Campaign.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. Christensen is married and has three young children.\n\n\n\n\n\nHON. OLGA ILICH\n\nMINISTER OF LABOUR AND CITIZENS’ SERVICES\n\n<![if !supportEmptyParas]> <![endif]>\n\nOlga Ilich was appointed Minister of Labour and Citizens’ Services on Aug. 15, 2006.\n\n<![if !supportEmptyParas]> <![endif]>\n\nShe previously served as Minister of Tourism, Sports and the Arts.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMs. Ilich was elected in the riding of Richmond Centre in 2005.\n\n<![if !supportEmptyParas]> <![endif]>\n\nPrior to being elected to the Legislative Assembly, she served as president of Suncor Development Corporation, a real estate development and construction company based in Richmond. Before owning her own business, Ms. Ilich was the executive vice-president of Progressive Construction Ltd, a company also based in Richmond.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMs. Ilich was born in Holland and has lived in Richmond since 1959. She holds a master of business administration from Memorial University of Newfoundland, a master of arts from the University of Manitoba and a bachelor of arts from the University of British Columbia.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMs. Ilich has been involved in a number of community, professional and business organizations. She has served as chair of the BC Assessment Authority, director of UBC Properties Investment Ltd, director of the Vancouver International Airport Authority, member of the City of Richmond Advisory Design Panel, and president of the Urban Development Institute, Pacific Region.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMs. Ilich has also served with the City of Surrey Development Advisory Committee, B.C.’s Advisory Committee on Public-Private Partnerships, B.C.’s Task Force on Public-Private Partnerships, the Federal Business Development Bank’s Regional Advisory Council, the City of Richmond Advisory Planning Commission, St. Georges's School, and the Diane Farris Gallery.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMs. Ilich has two grown sons who are currently at university.\n\n<![if !supportEmptyParas]> <![endif]>\n\n<![if !supportEmptyParas]> <![endif]>\n\nHON. STAN HAGEN\n\nMINISTER OF TOURISM, SPORT AND THE ARTS\n\n<![if !supportEmptyParas]> <![endif]>\n\nStan Hagen was appointed Minister of Tourism, Sport and the Arts on Aug. 15, 2006.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. Hagen had previously served as Minister of Children and Family Development, Minister of Human Resources and Minister of Sustainable Resource Management.\n\nFirst elected in 1986, he represented the riding of Comox until 1991. He returned to politics in 2001 and was re-elected in the riding of Comox Valley, where he was re-elected again in 2005.\n\n<![if !supportEmptyParas]> <![endif]>\n\nThrough his political career, Mr. Hagen has also served as Minister of Agriculture, Food and Fisheries; Advanced Education, Job Training, Science and Technology; Regional and Economic Development; Education and Minister of State for the Vancouver Island/Coast Region. He chaired the Canadian Council of Ministers of Education and was a member of six cabinet committees. Mr. Hagen was instrumental in the creation of Science World and introduced the Scientist in the Classroom program. The Passport to Education program, which still runs today, was also introduced under Mr. Hagen’s tenure.\n\n<![if !supportEmptyParas]> <![endif]>\n\nHe is the recipient of a honourary doctor of laws degree from Simon Fraser University.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. Hagen has been a resident of the Comox Valley since 1968. He worked in the construction industry as a comptroller and later started an independent ready-mix company. Prior to his re-election in 2001, he was the general manager of a local paving company.\n\n\n\n\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. Hagen was a board member and fundraiser for the Courtenay Youth Music Camp; co-ordinator for Big Brothers in the Comox Valley and founding president of the Comox Valley Community Foundation. He was the west coast regional chair of the Salmon Enhancement Project; treasurer of Comox Valley Chamber of Commerce and served as a Comox Valley School board chair and trustee from 1972-1978.\n\n<![if !supportEmptyParas]> <![endif]>\n\nStan and Judy Hagen still live in Courtenay and have five children.\n\n<![if !supportEmptyParas]> <![endif]>\n\n<![if !supportEmptyParas]> <![endif]>\n\nGORDON HOGG\n\nMINISTER OF STATE FOR ACTNOW BC\n\n<![if !supportEmptyParas]> <![endif]>\n\nGordon Hogg was appointed Minister of State for ActNow BC on Aug. 15, 2006.\n\n<![if !supportEmptyParas]> <![endif]>\n\nHe has previously served as Minister of Children and Family Development.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. Hogg also served as Chair of the Government Caucus and was a member of the Legislative Assembly Management Committee. He was also the Chair of the Seniors Caucus Committee, served on the Government Caucus Committee on Health as well as the Select Standing Committees on Health and Social Services, Justice, Constitutional Affairs and Intergovernmental Relations.\n\n<![if !supportEmptyParas]> <![endif]>\n\nPreviously, Mr. Hogg served as the Official Opposition Critic for Education and Human Resources and was also a member of the Official Opposition Caucus Committees on Health and Education.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. Hogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\n<![if !supportEmptyParas]> <![endif]>\n\nMr. Hogg served on White Rock council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies including the Peace Arch Community Health Council and Peace Arch District Hospital. He has also been a foster parent and little league coach.\n\n<![if !supportEmptyParas]> <![endif]>\n\nGordon and his wife, LaVerne live in White Rock and have one son.\n\n<![if !supportEmptyParas]> <![endif]>\n\n-30-\n\n<![if !supportEmptyParas]> <![endif]>\n\n<![if !supportEmptyParas]> <![endif]>"}, {"url": "https://www.peacearchnews.com/news/federal-election-q-a-with-gordie-hogg-liberals/", "page_content": "Liberal candidate Gordon Hogg is running in the South Surrey-White Rock riding in the upcoming federal election. (Contributed photo)\n\nPeace Arch News reached out to the four candidates running for the South Surrey-White Rock riding in the Sept. 20 federal election and asked them each to respond to four questions.\n\nBelow are the responses from Gordie Hogg (Liberals) in his own words:\n\n1) Following another summer of record-breaking heat in B.C., what actions would your party take, if elected, to immediately address the causes and impacts of climate change?\n\nA: I know that climate change is real, as do the residents of Lytton, those who lost loved ones in the heat dome, and most other Canadians.\n\nIf elected, I commit to building on the results of the Liberals’ 2015 $60 billion climate plan and to ensuring that our community directly benefits from goals in the new $17.6 billion strategy for a green recovery – reaching net-zero by 2050, preserving 25 per cent of our lands and oceans by 2025, boosting domestic green technology and energy, creating sustainable jobs and planting two billion trees.\n\nSouth Surrey/White Rock is witnessing the impacts of climate change. I commit to ensuring that residents benefit from programs like the $2 billion Disaster Mitigation and Adaptation Fund to help manage droughts and floods, restore shorelines and make our homes more energy efficient.\n\nFor 15 years I’ve worked with local activists to rid our community of thermal coal, and I’m pleased to announce that all exports of thermal coal will end no later than 2030. This is an important milestone, the first of many.\n\n2) Canada remains in the grips of a global pandemic. What steps need to be taken to get Canadians safely through this crisis, to facilitate economic recovery and to ensure our nation is better prepared for future public-health emergencies?\n\nA: When COVID hit, the Liberal government took immediate, decisive action to stabilize the economy and support Canadians with the largest economic aid package in generations. As of Sept. 1, 76.7 per cent of Canadians 12-plus are fully vaccinated, a key signpost of progress towards normal life.\n\nI will advocate for our community as we navigate the next steps in Canada’s economic recovery.\n\nIn April, the Liberals launched a $101.4 billion growth strategy with important measures including a $30 billion childcare program, a $17.6 billion investment in a green recovery, support for small businesses, tourism and entrepreneurs, targeted tax measures and income supports including boosting Old Age Security. Economic recovery needs to be felt at the household level, and I will strive to ensure that it is.\n\nIn terms of future public-health emergencies, I will support Liberal government campaigns to rebuild domestic vaccine manufacturing capacity, boost research, protect the most vulnerable and make long-term care homes safer.\n\n3) The price of everything from housing to food and child care is rising rapidly. What steps would a government formed by your party take to ensure all Canadians have access to safe and adequate housing and a healthy diet?\n\nA: I’ve seen the financial pressure facing our community in young families who fear they may never be able to buy their first home, and seniors who fear the loss of life-long homes.\n\nI commit to ensuring that residents benefit from Liberal government programs for first-time homebuyers, rent-to-own projects, social housing initiatives, the $40-billion National Housing Strategy and the $2 billion Canada Housing Benefit. Housing is for people, not speculators.\n\nI commit to supporting the Liberal government’s measures to help our families – the Canada Child Benefit, $10 a day daycare, reduced taxes on small businesses and the middle class, targeted income supports, and jobs. New recovery programs and infrastructure investments are projected to create one million jobs, and I will ensure some of these jobs are in our community.\n\nI will support programs that put more money in residents’ pockets and connect residents with resources. Poverty is the biggest reason people are hungry or homeless, and I commit to connecting people to programs to make sure there’s food on every table and a roof over every head.\n\n4) Racial justice and reconciliation are at the forefront of Canadian consciousness. What steps need to be taken to help right past wrongs and ensure that all Canadians are granted equal voice, opportunity and respect?\n\nA: I am proud of the diversity of our community.\n\nI am proud to be part of a party that has made historic investments to support equality, diversity and reconciliation via commitments to a $30 billion child-care program, an $18 billion program for Indigenous peoples, more than $1 billion to address systemic racism, and the most significant advancement in disability rights in 30 years.\n\nThese commitments will help ensure that all Canadians can participate fully in our communities.\n\nIn terms of righting past wrongs, I was very pleased to have worked closely with the Semiahmoo First Nation on the lifting of its 16-year boiled-water advisory and look forward to continuing action to advance meaningful reconciliation.\n\nIn April, the Liberal government passed legislation to adopt the UN Declaration on the Rights of Indigenous People, an action that paves the way for transformative change in First Nations communities.\n\nThese and other Liberal government programs support equality, opportunity and respect, values enshrined in our Charter of Rights and Freedoms that I will strive to advance across our community.\n\n\n\neditorial@peacearchnews.com\n\nLike us on Facebook and follow us on Twitter\n\nCanada Election 2021"}]}