{"Gordon Hogg served as Minister of State for Mining, Minister of State for ActNow BC, Minister of State for Deregulation, Minister of State for Intergovernmental Relations, Minister of State for Climate Action, Minister of State for Seniors, and Minister of State for Rural Development.": [{"url": "https://www.leg.bc.ca/content/legacy/web/mla/38thparl/hogg.htm", "page_content": "38th Parliament Members\n\nat dissolution on April 14, 2009\n\nMLA: Hon. Gordon Hogg Surrey-White Rock Minister of State for Mining Elected: 1997, 2001, 2005 BRITISH COLUMBIA LIBERAL PARTY\n\nGordon Hogg was appointed Minister of State for Mining on June 23, 2008.\n\nHe previously served as Minister of State for ActNow BC and Minister of Children and Family Development.\n\nMr. Hogg also served as chair of the Government Caucus and was a member of the Legislative Assembly Management Committee. He was also the chair of the Seniors Caucus Committee and has served on the Cabinet Committee for Agenda Development and the Select Standing Committees on Finance and Government Services; Sustainable Aquaculture; Children and Youth; Health and Social Services; Justice; Constitutional Affairs; and Intergovernmental Relations.\n\nPreviously, Mr. Hogg served as the Official Opposition Critic for education and human resources and was also a member of the Official Opposition Caucus Committees on Health and Education.\n\nGordon Hogg was first elected to represent the riding of Surrey-White Rock in a 1997 by-election. He was re-elected in 2001 and again in 2005.\n\nMr. Hogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nMr. Hogg served on White Rock council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch District Hospital. He has also been a foster parent and little league coach.\n\nGordon and his wife, LaVerne, live in White Rock and have one son.\n\n\n\n"}, {"url": "https://www.leg.bc.ca/content/legacy/web/mla/39thparl/hoggG.htm", "page_content": "39th Parliament Members\n\nat dissolution on April 16, 2013\n\nMLA: Gordon Hogg Surrey-White Rock Elected: 1997, 2001, 2005, 2009 BRITISH COLUMBIA LIBERAL PARTY\n\nGordon Hogg was first elected to represent the riding of Surrey-White Rock in a 1997 byelection. He was re-elected in 2001, 2005 and again in 2009.\n\nGordon is currently the government caucus chair and is Parliamentary Secretary for Non-profit Partnerships to the Minister of Social Development. He also serves on various committees, including the Cabinet Committee on Families First and the Cabinet Committee on Open Government and Engagement.\n\nPreviously, he served as Parliamentary Secretary for Social Entrepreneurship to the Minister of Finance and a member of the Select Standing Committees on Education, Aboriginal Affairs and Crown Corporations. He is also the former Minister of State for Mining, Minister of State for ActNow BC and Minister of Children and Family Development.\n\nHe previously served as Minister of State for ActNow BC and Minister of Children and Family Development.\n\nHe was also the chair of the Seniors Caucus Committee and has served on the Cabinet Committee for Agenda Development and the Select Standing Committees on Finance and Government Services, Sustainable Aquaculture, Children and Youth, Health and Social Services, Justice, Constitutional Affairs, and Intergovernmental Relations.\n\nPreviously, Gordon served as the Official Opposition Critic for education and human resources and was also a member of the Official Opposition Caucus Committees on Health and Education.\n\nGordon was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College\n\nHe served on White Rock council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch District Hospital. He has also been a foster parent and little league coach.\n\nGordon and his wife, LaVerne, live in White Rock and have one son."}, {"url": "https://www.cbc.ca/news/canada/british-columbia/b-c-premier-names-new-24-member-cabinet-1.857119", "page_content": "B.C. Lieutenant-Governor Steven Point swears in Premier Gordon Campbell on Wednesday at Government House in Victoria. ((Jonathan Hayward/Canadian Press))\n\nThere are nine new faces among the 24 members of the B.C. cabinet named Wednesday afternoon by Premier Gordon Campbell, after his Liberal Party won a third majority in May.\n\nMike de Jong is the new attorney general, as well as government house leader, filling the position vacated by Wally Oppal, who lost to Independent candidate Vicki Huntington in the Delta-South riding after two recounts.\n\nNewcomer Kash Heed takes on the role of solicitor general and public safety minister. John van Dongen resigned from the position in April following revelations that his driver's licence had been suspended for speeding. Van Dongen was re-relected on election night.\n\n'We will focus on B.C.'s priorities of building the economy, creating jobs and continuing to enhance critical services like health and education.'— B.C. Premier Gordon Campbell\n\nColin Hansen remains as finance minister but adds deputy premier to his titles.\n\nKevin Falcon is the new health services minister, and his previous portfolio of transportation and infrastructure goes to Shirley Bond, who used to lead the education ministry.\n\nGeorge Abbott, who was responsible for the health ministry, is now the minister of aboriginal relations and reconciliation.\n\nBarry Penner remains as environment minister, while Rich Coleman continues to head the ministry of housing and social development.\n\nThe eight new ministers, besides Heed, are Margaret MacDiarmid, Ben Stewart, Moira Stilwell, Steve Thomson, Naomi Yamamoto, Mary McNeill, John Yap and Randy Hawes.\n\nTheir new roles in the new cabinet are:\n\nMargaret MacDiarmid, minister of education and minister responsible for early learning and literacy.\n\nBen Stewart, minister of citizens' services and minister responsible for multiculturalism and the public affairs bureau.\n\nMoira Stilwell, minister of advanced education and labour market development.\n\nSteve Thomson, minister of agriculture and lands.\n\nNaomi Yamamoto, minister of state for intergovernmental relations.\n\nMary McNeil, minister of state for the Olympics and ActNow BC.\n\nJohn Yap, minister of state for climate action.\n\nRandy Hawes, minister of state for mining.\n\nLinda Reid, Gordon Hogg, Ron Cantelon and Joan McIntyre, who previously served as ministers, are not part of the new cabinet.\n\nThe legislature is scheduled to be recalled in August.\n\nCampbell described his new executive council members as \"proven leaders.\"\n\n\"Together, we will focus on B.C.'s priorities of building the economy, creating jobs and continuing to enhance critical services like health and education,\" he said.\n\n\"In just 247 days, B.C. and Canada will welcome the world for the 2010 Olympic and Paralympic Winter Games … Our cabinet will work to take advantage of this opportunity and to continue building our province as Canada's gateway to the Asia Pacific.\""}, {"url": "https://globalnews.ca/news/3910701/gordie-hogg-south-surrey-white-rock-by-election/", "page_content": "Send this page to someone via email\n\nThe people of South Surrey-White Rock chose one of two names familiar to politics to represent them in Parliament on Monday night.\n\nLiberal candidate Gordie Hogg will replace Dianne Watts, who stepped down to run for the leadership of the BC Liberal Party.\n\nLISTEN: Liberals win seat in Surrey byelection\n\n\n\nHogg captured 47.5 per cent of the vote, defeating Conservative Kerry-Lynne Findlay by 1,617 votes.\n\nStory continues below advertisement\n\n“This is really a celebration of what you’ve done. Your commitment to, your caring, the grass roots and the process that is our democracy, which is our country, and if this is your victory, thank you so very much.”\n\nThree other byelections took place across Canada on the same night, but the race in South Surrey-White Rock was seen as one of the most-contested races.\n\nWATCH: Conservative MP Dianne Watts declares leadership bid\n\n7:10 Conservative MP Dianne Watts declares leadership bid\n\nThe race pitted Findlay, an ex-MP for Delta-Richmond East and a former minister of national revenue, against Liberal Gordie Hogg, who had served as MLA for Surrey-White Rock from 1997 to 2017.\n\nHogg had previously served in various provincial cabinet roles including minister of children and family development, minister of state for mining, minister of state for ActNow BC and chair of the government caucus.\n\nStory continues below advertisement\n\nNDP candidate Jonathan Silveira previously ran to be a school trustee with Surrey Kids Matter party, which he founded. He has studied at Langara College and Simon Fraser University (SFU), where he played a key role in bringing the U-Pass to campus.\n\nThe Green Party put forward Larry Colero, who ran unsuccessfully in the previous two federal elections.\n\nA White Rock resident for seven years, he has taught corporate ethics at SFU’s Beedie School of Business and UBC’s Sauder School of Business.\n\nMichael Huenefeld, the Progressive Canadian Party candidate, previously worked as a researcher in the provincial legislature and managed and coordinated numerous campaigns at the municipal, provincial and federal levels. He currently teaches business as Columbia College and SFU.\n\nRod Taylor, the candidate for the Christian Heritage Party, wants to address the national debt, as well as the cost of the federal bureaucracy.\n\nTaylor ran on a platform of restoring traditional marriage and keeping schoolchildren protected from “abusive and inappropriate indoctrination disguised as education.”\n\nStory continues below advertisement\n\nDonald Wilson, the Libertarian candidate, is a family lawyer and is an advocate for smaller government and individual liberty.\n\nFederal byelections also took place in Bonavista-Burin-Trinity, Scarborough-Agincourt and Battlefords-Lloydminster."}, {"url": "https://voiceonline.com/gordon-hogg-approached-by-surrey-first-to-run-for-mayor/", "page_content": "FORMER South Surrey-White Rock MP Gordon Hogg, who is also a former White Rock mayor and MLA, confirmed to the VOICE on Tuesday that he has been approached by Surrey First to run for mayor of Surrey.\n\nHe added: “I am going to be meeting with them [this coming weekend] and I am not sure what my decision will be as a result of that.”\n\nAsked if he was seriously considering a run, he replied: “I’ve been approached by that group. I have also been approached to consider running for mayor of White Rock and I am meeting with my family this week to see whether or not there’s some type of agreement on that.”\n\nHe added: “So, it’s somewhat up in the air – all of it’s up in the air right now.”\n\nBACK in 2017, Hogg was selected as the federal Liberal candidate in a by-election in South Surrey—White Rock when incumbent Conservative MP Dianne Watts — who founded Surrey First in 2007 — resigned. Hogg defeated Conservative candidate Kerry-Lynne Findlay, but lost to her in the 2019 federal election. He lost to her again in 2021.\n\nIn an interview with The VOICE in 2017, he pointed out that he was on White Rock Council first as a Councillor for 10 years and then as the mayor for another 10 years.\n\nHe then became an MLA from the riding of Surrey-White Rock in a 1997 by-election. He was re-elected in 2001, 2005, 2009, and again in 2013.\n\nHe held several portfolios as MLA including Minister of Children and Family Development, Parliamentary Secretary for Youth Sport to the Minister of Community, Sport and Cultural Development, Parliamentary Secretary for Social Entrepreneurship to the Minister of Finance, Minister of State for Mining, and Minister of State for ActNow BC. Hogg also served as chair of the Government Caucus.\n\nHogg was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nGordon Hogg and his wife, LaVerne, live in White Rock and have one son. They have also been foster parents, Hogg told The VOICE at the time."}, {"url": "https://archive.news.gov.bc.ca/releases/news_releases_2005-2009/2008EMPR0062-001674-Attachment1.htm", "page_content": "!DOCUMENT HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n\n<![if !supportNestedAnchors]> <![endif]>Ministry of Energy, Mines and Petroleum Resources\n\nHighlight events on Minister of State for Mining Gordon Hogg’s Asia-Pacific Investment Mission include:\n\nBeijing , Shanghai , China – Nov. 7-16\n\nBeijing , the minister will attend Canada Mineral Forum 2008, the China Mining Congress and an investment seminar hosted by the Chinese National Development Reform Commission. In, the minister will attend Canada Mineral Forum 2008, the China Mining Congress and an investment seminar hosted by the Chinese National Development Reform Commission.\n\nThe minister will also have meetings with Capital Steel and the Chinese Ministry of Commerce.\n\nShanghai , the minister will meet with officials of Baosteel, a major steel company and tour the plant. In, the minister will meet with officials of Baosteel, a major steel company and tour the plant.\n\nChina Mining Congress – Nov. 11-13\n\n<![if !supportLists]>o <![endif]>As one of the world’s top four mining expos, China Mining Expo provides the best channel and platform for mining companies to communicate and exchange new ideas on development, investment policies, mining rights trading, exploration, technology and equipment, mining evaluation and consultancy, and sustainable development aspects. Last year, China Mining Expo attracted over 300 exhibitors, 10,000 professional visitors and 3,000 conference delegates from 45 countries. China Mining Expo has four main parts – an exhibition, forum (China Mining Congress), gala awards dinner and featured events.\n\n\n\nVenue: Beijing International Convention Center (BICC).\n\nCanada Mineral Forum 2008 – Nov. 10\n\n<![if !supportLists]>o <![endif]>There will be a Canada Mineral Forum day in Beijing , featuring an event showcasing Canada and Korea . This Canada Day event is scheduled for Nov. 10, the day prior to the China Mining Congress. All B.C. companies are invited to join in the day's events, which include presentations from each of the provinces and territories.\n\nCanada Reception – Nov. 10\n\n<![if !supportLists]>o <![endif]>The Ministry of Energy, Mines and Petroleum Resources is a major sponsor for a networking reception in partnership with Saskatchewan , Yukon , New Brunswick , Quebec , Newfoundland and Labrador , along with Natural Resources Canada.\n\nInvestment Seminar held by the National Development Reform Commission – Nov. 14.\n\n<![if !supportLists]>o <![endif]>Minister Hogg is attending a seminar with Chinese government officials, representatives from large Chinese mining companies and British Columbia mining companies.\n\nTokyo , Japan – Nov. 16-19\n\nTokyo the minister will be meeting with company officials and attending an investment seminar. ( Proposed meetings with: Mitsubishi, Mitsui, Marubeni, Sojitz, Sumitomo, JOGMEC, Tokyo Gas, Sumitoto Metal Mining Co. Ltd. and the Nikkei Exchange). Inthe minister will be meeting with company officials and attending an investment seminar. (\n\nOpening remarks at the British Columbia Mining and Minerals Investment Seminar – Opportunities to Explore 2008.\n\nTokyo Stock Exchange. Tour of theStock Exchange.\n\nSeoul , South Korea – Nov. 19-21\n\nMinister meeting with major company officials , including proposed meetings with POSCO, LG, Hyundai, KS Nickel, KOTRA, KORES, Korean District Heating Corp, Korea International Trade Association, Hanwha Corporation and the Ministry of Knowledge and Economy.\n\nOpening remarks at the British Columbia Mining and Minerals Investment Seminar – Opportunities to Explore 2008.\n\nB.C. companies accompanying the minister (majority of companies will be exhibiting at the BC Pavilion at China Mining Expo 2008):\n\nMundoro Mining Inc.\n\nGoldbrook Ventures Inc.\n\nBCM Resources Corp.\n\nPacific Booker Minerals Inc.\n\nNewmac Resources Inc.\n\nCopper Fox Metals Inc.\n\nInland Explorations Inc.\n\nGeoScience BC\n\nAeroquest International Ltd.\n\nB.C. companies that will be participating at China Mining 2008 (but not exhibiting within the B.C. Pavilion)\n\n(Companies accompanying Minister Hogg to Japan and Korea )\n\n<![if !supportLists]>o <![endif]>Pacific Booker Minerals Inc.\n\n<![if !supportLists]>o <![endif]>BCM Resources Corp.\n\n<![if !supportLists]>o <![endif]>NewMac Resources Inc.\n\n<![if !supportLists]>o <![endif]>Copper Fox Western Inc.\n\n<![if !supportLists]>o <![endif]>Inland Explorations Inc.\n\n-30-"}, {"url": "https://leadinginfluence.com/mla-gordon-hogg-surrey-white-rock-3/", "page_content": "Lord Jesus, we lift up MLA: Gordon Hogg to You. We pray for Your leading for him as he fulfills his duties in his constituency and the province. We pray You will give him clear strategy and wisdom as he works to bring solutions to the issues that concern him and his constituents. We pray You will keep him healthy and give him renewed strength and vision in the New Year. Amen.\n\nGordon Hogg was first elected to represent the riding of Surrey-White Rock in a 1997 by-election. He was re-elected in 2001, 2005, 2009, and again in 2013.\n\nGordon has previously served as Parliamentary Secretary for Social Entrepreneurship to the Minister of Finance. He is also the former Minister of State for Mining, Minister of State for ActNow BC and Minister of Children and Family Development.\n\nGordon also served as chair of the Government Caucus and was a member of the Legislative Assembly Management Committee. He was also the chair of the Seniors Caucus Committee and a member of the Cabinet Committee for Agenda Development.\n\nHe has also served on the Select Standing Committees on Finance and Government Services; Children and Youth; Health and Social Services; Justice; Constitutional Affairs, and Intergovernmental Relations; and the Special Committee on Sustainable Aquaculture. He is currently a member of the Select Standing Committees on Aboriginal Affairs and Education.\n\nPreviously, he has also served as the Official Opposition Critic for education and human resources and was also a member of the Official Opposition Caucus Committees on Health and Education.\n\nGordon was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nHe served on White Rock council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch District Hospital. He has also been a foster parent and little league coach.\n\nGordon Hogg and his wife, LaVerne, live in White Rock and have one son."}, {"url": "https://www.cbc.ca/news/canada/british-columbia/campbell-shakes-up-cabinet-1.605343", "page_content": "In a surprise move, Premier Gordon Campbell has shaken up his cabinet, moving four ministers to new jobs and bringing back a former minister.\n\nPolitical veteran Stan Hagen is being shuffled from the high-profile Ministry of Children and Family Development to Tourism, Sport and Arts.\n\nHe is being replaced in the Children's Ministry by Tom Christensen who has been the aboriginal relations minister.\n\nChristensen becomes the tenth minister in charge of B.C.'s troubled child-protection system in the past decade.\n\nMike de Jong is moving from the labour portfolio to the Ministry of Aboriginal Relations and Reconciliation.\n\nFormer tourism minister Olga Ilich takes over at the Ministry of Labour.\n\nCampbell has also brought Surrey-White Rock MLA Gordon Hogg back into cabinet as the new minister of state for ActNow BC, which encourages fitness and healthy lifestyles.\n\nHogg is a former children's minister who resigned in January 2004 after an investigation into spending by the ministry. An audit later showed no evidence of fraud and misappropriation, and Hogg said he felt vindicated."}, {"url": "https://www.todayinbc.com/opinion/column-hogg-has-tough-job-ahead/", "page_content": "S\n\nurrey-White Rock MLA Gordon Hogg is the new chair of the BC Liberal caucus, a position that some may liken to that of an officer on the ill-fated Titanic.\n\nThe times are not good for the BC Liberals. There is a great deal of unhappiness with the governing party, which is definitely showing its age. It is now in its 11th year of power.\n\nHogg reportedly won the caucus chair position with the support of about two-thirds of the caucus members, and it has been reported that he won against the wishes of Premier Christy Clark, who wanted Vancouver MLA Margaret MacDiarmid in the position.\n\nHogg has been a longtime MLA, first going to Victoria after winning a byelection in 1997, when Liberal MLA Wilf Hurd stepped down to run federally. At one time, he was Gordon Campbell’s roommate, and was an early member of his cabinet. He resigned in 2004 as minister of children and families, when an independent audit was called into a branch of his ministry. As such, he did so on a matter of principle, and no one who knows him doubts that he is a principled individual.\n\nHe was later reappointed to cabinet as minister in charge of ActNow BC and minister of state for mining, but has not served in cabinet since 2009.\n\nWhile he has mostly kept his opinions on the state of BC Liberal affairs out of the public realm, it is no secret that he has not been happy with some of the government’s moves since it won the 2009 election. The BC Liberals went from projecting an aura of managerial competence to a bumbling, half-baked response to the introduction of the HST. The government announced that the HST was a fait accompli in July 2009, two months after an election in which the subject barely came up.\n\nBC Liberal caucus members were told that the tax was going ahead, after cabinet decided to go in that direction. The result has been two years of political turmoil and upheaval which cost Campbell his job, and also took down NDP leader Carole James. She resigned after some members of her party felt she was not capitalizing on the Liberal woes.\n\nHogg, who served 20 years on White Rock council with 10 of those years as mayor, has the ability to ease tensions among individuals, a strength he showed repeatedly as mayor. This may be needed in the caucus room, particularly if the HST referendum results in a defeat of the tax.\n\nIf that happens, the BC Liberals do not appear to have a Plan B. Thus far, Premier Clark has not shown the ability to pull the Liberals out of the political quicksand.\n\nThey do have one advantage. There are many people who are not ready to vote NDP, given the party’s dismal handling of many aspects of the economy in the 1990s. New NDP leader Adrian Dix was at former premier Glen Clark’s side during much of that time, and that won’t make it easy for the NDP to campaign on economic issues.\n\nHowever, the BC Conservatives are more lively than they have been in decades. Even if the Conservatives pick up just five per cent of the vote, and don’t elect any candidates, there is a very good chance the NDP will win as a result of vote splitting.\n\nClark, Hogg and others on the bridge know that – and so does Dix, who has the margins of victory in each B.C. riding in 2009 memorized.\n\nHogg will have plenty of work to do to keep caucus members ready to unreservedly back the government. Thus far, one of the BC Liberals’ greatest strengths has been the backing from caucus, despite all the missteps the cabinet has taken. Even the two caucus members who left in the turmoil over the HST and Campbell’s leadership, Blair Lekstrom and Bill Bennett, are back in the fold.\n\nIf Hogg can assist Clark in keeping caucus united, and if a united caucus is able to show B.C. residents that the BC Liberals remain a viable option, he will have more than met the expectations of those who voted for him as caucus chair – and many of those who have backed him in four straight elections in Surrey-White Rock.\n\nFrank Bucholtz writes Fridays for the Peace Arch News. He is the editor of the Langley Times.\n\nPeace Arch News"}, {"url": "https://appuidepointe.com/mla-gordon-hogg-surrey-white-rock-4/", "page_content": "Father, we thank You for MLA: Gordon Hogg and honor him for his lifetime of commitment to public service in the province of British Columbia. Your Word says in Proverbs 3:21 « Have two goals: wisdom—that is, knowing and doing right—and common sense. Don’t let them slip away ».(NLT) We are grateful for his modeling of this and pray that You will continue to give Gordon Your wisdom and common sense so that he can continue to accomplish all of those things that You still have for him to do in our province. Keep him and his wife in your perfect peace. In Jesus’ name we pray. Amen.\n\nGordon Hogg was first elected to represent the riding of Surrey-White Rock in a 1997 by-election. He was re-elected in 2001, 2005, 2009, and again in 2013.\n\nGordon has previously served as Parliamentary Secretary for Social Entrepreneurship to the Minister of Finance. He is also the former Minister of State for Mining, Minister of State for ActNow BC and Minister of Children and Family Development.\n\nGordon also served as chair of the Government Caucus and was a member of the Legislative Assembly Management Committee. He was also the chair of the Seniors Caucus Committee and a member of the Cabinet Committee for Agenda Development.\n\nHe has also served on the Select Standing Committees on Finance and Government Services; Children and Youth; Health and Social Services; Justice; Constitutional Affairs, and Intergovernmental Relations; and the Special Committee on Sustainable Aquaculture. He is currently a member of the Select Standing Committees on Aboriginal Affairs and Education.\n\nPreviously, he has also served as the Official Opposition Critic for education and human resources and was also a member of the Official Opposition Caucus Committees on Health and Education.\n\nGordon was a counsellor, probation officer and regional director for corrections prior to his election to the Legislative Assembly. He received his bachelor of arts in sociology and psychology from the University of British Columbia and his master’s degree in psychology from Antioch College.\n\nHe served on White Rock council for 20 years, for 10 of which he was mayor. He has been a board member of more than 15 committees and non-profit societies, including the Peace Arch Community Health Council and Peace Arch District Hospital. He has also been a foster parent and little league coach.\n\nGordon Hogg and his wife, LaVerne, live in White Rock and have one son."}]}