{"The Vagos Motorcycle Club was founded in 1965 by a group of Mexican-American war veterans in San Bernardino, California.": [{"url": "https://www.history.co.uk/shows/outlaw-chronicles-hells-angels/articles/history-of-the-vagos-mc", "page_content": "History of the Vagos MC\n\nThe year is 1965. USA are in the middle of the Vietnam War, Martin Luther King has recently marched from Selma to Montgomery and Roger Miller’s ‘King of the Road’ is number one. Thirteen bikers meet on the corner of Eighth and Davidson in San Bernardino, California to form the Vagos Motorcycle Club, beginning a history that would involve drug trafficking, clashes with the police and a violent rivalry with the Hells Angels.\n\nThe elected president was Rudy Esparza, nicknamed Puro, who led the new club in selecting their name. Other names considered included Coffin Dogers MC and Satan’s Saints MC, but Vagos MC, Spanish for vagabond, was chosen. Their new patch, a red devil on a green background, was inspired by an image of a devil in LIFE magazine entitled ‘Return from hell.’\n\nMore Outlaw Motorcycle Gangs (OMGs) were established in the 1960s than in any other decade. The outlaw status is given to groups who are not sanctioned by the American Motorcyclists Association (AMA). They are also known as 1%ers, a term which originated after the Hollister biker riot in 1947 when the AMA allegedly claimed the 99% of bikers were law abiding citizens, although the AMA have no record of issuing this as an official or public statement.\n\nBikers would often move between clubs or find their club being absorbed into a larger club. Puro had previously been with the Psychos MC and others joined from clubs including El Diablo MC. The question of whether the Vagos would absorb or be absorbed was very quickly answered as more Chapters sprang up across California. In 2014 the FBI listed the Vagos as one of the largest Outlaw Motorcycle Groups in Western America with 600 members in 24 Chapters throughout America, as well as Chapters in Canada, Mexico and Europe.\n\nThe Mafia on wheels?\n\nDescribed by Vagos infiltrator Charles Falco as “the mafia on wheels” the Vagos have more than earned their 1%er patch. Drug related arrests have been made throughout their colourful history. In 1987 the head of the South Bay Chapter and President of the Desert Hot Springs Chapter along with three others all pleaded guilty to conspiracy to distribute methamphetamines. Over 40 pounds of cocaine and eight pounds of methamphetamines (and a rocket launcher!) were seized in a 2011 raid. And in 2014 four Vagos members were arrested by the FBI for selling methamphetamines.\n\nAlongside money laundering and weapons trafficking, the Vagos are also known for their general violence, especially with rival OMGs. As the Vagos attempted to expand their territory tension erupted between them and other OMGs most notably the Hells Angels. In 2001 a bloody melee broke out between the Vagos and the Angels in the Californian city of Costa Mesa. And in 2010 an argument over which gang got to hang out in the Starbucks in Santa Cruz escalated. A brawl outside the coffee shop led to a gunfight in Chino Valley, several drive by shootings and a bitter feud.\n\nThe authorities have successfully infiltrated the Vagos a number of times. George Rowe, a street criminal whose friend had disappeared after an incident with the Vagos, volunteered to go undercover as part of Operation 22 in 2003. His evidence gathered over 3 years resulted in 42 arrests and convictions for crimes as serious as murder. Whilst Charles Falco worked his way up to number two of the Victorville Chapter and provided the ATF (Bureau of Alcohol, Tobacco and Firearms) gathering enough information to make 62 arrests for crimes including assault and murder. Fun fact, both Rowe and Falco have written books about their experiences and actually appear as characters in each other’s books.\n\nHowever the Vagos have their own weapon in their ongoing battle with the police- the lawsuit. In 1990 the Vagos sued the police and received a $2 million settlement claiming they were targets of massive police abuse in the early eighties. And in 2010 when the Vagos were blamed for a spree of homemade booby traps that targeted the police, they once again sued and received a settlement that included a public statement and the return of property seized the previous year.\n\n1%ers\n\nAs with all criminal groups the Vagos don’t advertise their more notorious crimes. Their PR website vagosmcworld.com, presents them as a club rather than a gang. Their consistent response to arrests is that it is not all of their members committing crimes, but a few bad apples. So, organised crime syndicate or a club where just 1% of the 1%ers are giving them a bad name…?"}, {"url": "https://onepercenterbikers.com/vagos-mc-motorcycle-club/", "page_content": "Vagos MC is a one percenter motorcycle club founded in San Bernardino, California in 1965. The motorcycle club are also known as the Green Nation and have a strong presence in the USA and Mexico, but have also expanded to many other countries.\n\nVagos MC History\n\nVagos MC was founded in San Bernardino, California in 1965. Like many other motorcycle clubs of the time, the Vagos Motorcycle Club was founded by a group of members who had returned from World War II and enjoyed riding their Harley Davidson motorcycles. This particular group were originally members of a different motorcycle club, the Psychos (Redlands) Motorcycle Club. After some infighting a few of the members decided to leave and form their own club, which then became the Vagos Motorcycle Club.\n\nThe original members were Rudy “Puro” Esparza (President), Gil Carrasco (Vice President), Whitey (Secretary/Treasurer), Lucky (Sgt. at Arms), Freddy Ruiz, Harley Hog, Animal, Crazy John Estrada, Tom Tom, Moose, Squirrel, Alex Estrada, and Little John Bocanegra.\n\nThe founders of Vagos Motorcycle Club had a Mexican heritage, which led to the color green being selected for the club. The word “Vagos” in Spanish means “vagabond”, “gypsy” or “travelling person”, someone who is always up to something. Two other names for the club were considered, Coffin Dodgers MC and Satan Saints MC.\n\nThe first chapter to open was in San Bernardino, California, which is nicknamed the “Berdoo” chapter. San Bernardino was a hot spot for founding motorcycle clubs, also founded in the area were the Hells Angels Motorcycle Club.\n\nThe second chapter was the Vagos Motorcycle Club Victorville chapter, which involved patching over of Cossacks Motorcycle Club.\n\nThe third chapter was the Vagos Motorcycle Club Los Angeles chapter, made up of members from the Talons Motorcycle Club.\n\nThe fourth chapter was the Vagos Motorcycle Club San Gorgonio Pass chapter, started by some of the Berdoo chapter members and their friends.\n\nThe fifth chapter was the Vagos Motorcycle Club SGV (San Gabriel Valley) chapter. This was made up of past members of Dirty Dozen MC, Highwaymen MC, Verdugos MC, Vendettas MC and Ghostmen MC.\n\nThe sixth chapter was the Vagos Motorcycle Club Monterrey chapter, consisting of past members of Sabers MC, Dirty Dozen MC and Highwaymen MC.\n\nThe seventh chapter was the Vagos Motorcycle Club Pomona Valley chapter, with members of Nacoda Breed MC.\n\nThe eighth chapter was the Vagos Motorcycle Club Antelope Valley chapter, where members came from Brothers MC.\n\nChapters in Mexico then opened approximately 15 years later in Mexicali, Mexico.\n\nIn 2013 Vagos Motorcycle Club opened chapters in Australia and Sweden.\n\nThe majority of members of the one percenter motorcycle club are Caucasian or Hispanic.\n\nVagos MC Patch / Motto\n\nThe Vagos Motorcycle Club patch consists of the Norse god of Mischief, Loki. He is depicted riding a motorcycle. The Vagos Motorcycle Club patch was designed by a member of the Berdoo chapter who was in prison at the time.\n\nThe Vagos MC motto is “We Give What We Get”.\n\nOne of the Vagos Motorcycle Club abbreviations is 22, as the 22nd letter in the alphabet is the letter “V”.\n\nThe Vagos Motorcycle Club colors are green, which links back to the Mexican heritage of the Vagos Motorcycle Club founder.\n\nVagos also use the motto “VFFV”, meaning “Vagos Forever, Forever Vagos”. This format is used by many clubs, for example the Bandidos “BFFB”.\n\nVagos MC Chapters\n\nVagos are spread throughout the world, with a strong presence both in Southern California and Mexico.\n\nVagos Motorcycle Club United States Chapters Vagos Berdoo San Bernardino, California chapter Vagos Victorville chapter Vagos Los Angeles chapter Vagos San Gorgonio Pass chapter Vagos Hollywod chapter Vagos Sacramento chapter Vagos San Jose chapter Vagos Compton chapter Vagos Pasadena chapter Vagos SGV (San Gabriel Valley) chapter Vagos Monterrey chapter Vagos Pomona Valley chapter Vagos Antelope Valley chapter Vagos Venice chapter Vagos Central Valley, Stockton, California chapter Vagos New York chapter Vagos Nomads chapter Vagos Arizona chapter Vagos New Mexico chapter Vagos Illinois chapter Vagos Utah chapter Vagos Florida chapter Vagos Arkansas chapter Vagos Mojave chapter\n\n\n\nVagos Motorcycle Club Mexico Chapters Vagos Ocotlan chapter Vagos Hormiga Tlalpan chapter Vagos Coronel chapter Vagos Malpaatla chapter Vagos Tonito chapter Vagos Morelia chapter Vagos Centro chapter Vagos Guanajuato chapter Vagos Toluca chapter Vagos Zamora chapter Vagos Alvaro Obregon chapter Vagos Coyocan chapter Vagos Tlaquepaque chapter Vagos Zapopan chapter Vagos Guadalajara chapter\n\n\n\nVagos Motorcycle Club Australia\n\nVagos Motorcycle Club Canada\n\nVagos Motorcycle Club Brazil\n\nVagos Motorcycle Club Europe Chapters Vagos Scandinavia chapter Vagos Nomads Europe chapter Vagos United Kingdom chapter Vagos Germany chapter Vagos Switzerland chapter\n\n\n\nFamous Vagos MC Members\n\nRudy “Puro” Esparza – Founder/President\n\nBorn November 16, 1935 and died August 14, 2013 in Joshua Tree, California. He was one of the Vagos Motorcycle Club founders and the first President.\n\nVagos MC Crime / In The Media\n\n1974 – 4 members of Vagos Motorcycle Club are convicted of murder and sentenced to death for the murder of William Velten, a student at the University of Mexico. Richard Greer, Ronald Keine, Clarence Smith and Thomas Gladish were on death row for 17 months, however were saved when Kerry Rodney Lee confessed to the murder.\n\n1998 – Over a dozen members of the motorcycle club are arrested for kidnapping as well as on drugs and weapons charges after a two year investigation by undercover agents.\n\n2002 – The ex-wife of a police detective in Pomona, California attempts to hire a member of the Vagos Motorcycle Club to murder he ex-husband. The motorcycle club contacted the police and advised of the situation.\n\n2004 – 26 members of the one percenter motorcycle club are arrested and $125,000 in cash, weapons and drugs is found.\n\n2006 – March 9, 2006, an operation titled “Operation 22 Green” is conducted where 700 ATF, local police and sheriff departments came together to arrested 25 members of the club.\n\n2007 – December, 2007. 6 members of the motorcycle club are arrested for burglary, robbery, coercion and kidnapping in crimes occurring in August 2007. The crime involved a member of Vagos Motorcycle Club who wanted to leave, so was then beaten, kidnapped and robbed.\n\n2009 – June, 2009. 3 members of the motorcycle club are arrested on June 9 and June 10 and charged with sexually assaulting a woman in San Jose, California.\n\n2009 – December 31, 2009. The unmarked headquarters of the Hemet Gang Task Force was filled with natural gas via a hole in the roof. The gas was detected by two members of the law enforcement group and they exited the building quickly without causing any explosion. A day before this event the Vagos Motorcycle Club had been next door at a church, attending a funeral for one of their members.\n\n2010 – February 23, 2010. A member of the Hemet Gang Task Force opens a security gate at the complex and a homemade gun booby trapped to the gate fires, nearly hitting the task force member in the head.\n\n2010 – March 5, 2010. A member of the Hemet Gang Task Force returns to his unmarked police car which was parked outside of a convenience store. He discovers that there is a homemade pipe bomb which has been hidden underneath the car.\n\n2010 – March 17, 2010. Police arrest 30 members of the Vagos Motorcycle Club in relation to the attempted attacks on the Hemet Gang Task Force on December 31, 2009, February 23, 2010 and March 5, 2010. As part of these arrests there were also raids in Arizona, California, Nevada and Utah across 73 locations. Multiple weapons were found in the raids, along with the discovery of a meth lab. A $200,000 reward was posted by law enforcement for information regarding the attacks on the Hemet Gang Task Force, which at the time were labelled as “urban terrorism”.\n\n2011 – March, 2011. Vagos Motorcycle Club sues the Riverside County Law Enforcement or defamation in relation to the attacks on the Hemet Gang Task Force. On August 1, 2011 the case was settled and ties between the club and the attacks removed. Law enforcement arrested two people unrelated to the club for the attacks.\n\n2011 – August, 2011. Vagos Motorcycle Club are involved in a shooting with Galloping Goose Motorcycle Club near Waynesville, Missouri. The fight was said to involved approximately 20 people.\n\n2011 – September 23, 2011. Jeffrey Pettigrew, the Hells Angels San Jose chapter President is killed in a shooting involving members of Vagos Motorcycle Club. The event occurred at John Ascuaga’s Nugget, also known as the Nugget Casino Resort, in Sparks, Nevada. On September 29, 2011, Vagos Motorcycle Club member Ernesto Manuel Gonzales is arrested for the murder. Vagos Motorcycle Club Los Angeles chapter Vice President Gary Rudnick is also arrested in relation to the event and leader plead guilty to murder in the second degree.\n\n2017 – 16 June, 2017. 23 members of the Vagos Motorcycle Club, including several high ranking officers, are arrested in an operation that spread across California, Hawaii and Nevada and are accused of murder, racketeering, kidnap, assault and drug dealing. Some of the arrested are believed to have been involved in the 23 September 2011 shooting of Jeffrey Pettigrew.\n\nThe arrested men were: Pastor Fausto Palafox, aka ‘Tata’, Albert Lopez aka ‘Al’, Albert Benjamin Perez, aka Dragon Man, James Patrick Gillespie, aka Jimbo, Andrew Eloy Lozano, aka Hulk, Ernesto Manuel Gonzalez, aka Romeo, Victor Adam Ramirez, aka Slick, James Walter Henderson aka CJ, Steven Earl Carr, aka Big Steve, Robert Alan Coleman, aka Mayhem, Jeremy John Halgat, aka Maniak, Paul Jeffrey Voll, aka Shyster, John Joseph Siemer, aka Rocky, Bradley Michael Campos, aka Candy Man, Cesar Vaquera Morales, aka C, Diego Chavez Garcia aka Boo, Edward Claridan Chelb, aka Recon, Johnny Russell Neddenriep aka Johnny Bolts, Darin Kieth Grieder, aka Midget, Thomas Granville Garretson, aka Tommy Guns, Bert Wayne Davisson, aka Flash, Matthew Keith Dunlap, aka Big Mat, and John Chrispin Juarez, aka Quicky.\n\n2017 – 29 July, 2017. In Santa Fe, New Mexico, Vagos MC member David Andrew Cordova and his son David Ray Cordova fire over 20 shots from a car at a home of a Bandidos MC member. David Andrew Cordova is shot and injured in the arm during the incident, however it is not clear who fired the shot that hit him.\n\nVagos MC Enemies and Allies\n\nVagos MC Enemies:\n\nVagos MC Allies:\n\nMongols MC are allies\n\nVagos Books:\n\nVagos Book – Vagos, Mongols, and Outlaws: My Infiltration of America’s Deadliest Biker Gangs by Charles Falco and Kerrie Droban.\n\nCharles Falco was a large scale methamphetamine dealer in 2001, reportedly earning $500,000 a year, when he was arrested by law enforcement and provided a deal by the ATF to infiltrate outlaw motorcycle clubs. First it was Vagos MC, where he rose to the role of “Officer” (second in charge) in the Victorville, California chapter. He later joined the Mongols and lastly the Outlaws where he became the Petersburg, Virginia Vice President. Find out more on Amazon (link opens in a new tab).\n\nGods of Mischief: My Undercover Vendetta To Take Down The Vagos Outlaw Motorcycle Club by George Rowe.\n\nAn account of how the author assisted the government by infiltrating Vagos MC. A view looking in from an outsider, with discussion of the author’s troubled childhood and his personal struggle. It doesn’t make our list of the best outlaw motorcycle books, but there aren’t too many books around covering Vagos. Find out more on Amazon (link opens in a new tab).\n\nTerry the Tramp: The Life and Dangerous Times of a One Percenter by K. Randall Ball (Easyriders magazine writer Keith “Bandit” Ball)\n\nThis is the biography of Terry Orendorff. Terry “The Tramp” is the former International President of Vagos MC, a position which he held for several decades. The book takes you through his life, but also provides an insight into the biker culture, particularly around the 1970s and 1980s. Find out more on Amazon (link opens in a new tab).\n\nRead More:\n\nPlease help us out by hitting the “Share” button so that we can keep bringing you more articles and “Follow” us on Facebook so that you get updated when we release new articles."}, {"url": "https://www.liquisearch.com/vagos_motorcycle_club/history", "page_content": "“I believe that history has shape, order, and meaning; that exceptional men, as much as economic forces, produce change; and that passé abstractions like beauty, nobility, and greatness have a shifting but continuing validity.”\n\n—Camille Paglia (b. 1947)\n\n“While the Republic has already acquired a history world-wide, America is still unsettled and unexplored. Like the English in New Holland, we live only on the shores of a continent even yet, and hardly know where the rivers come from which float our navy.”\n\n—Henry David Thoreau (1817\u00961862)\n\n“I assure you that in our next class we will concern ourselves solely with the history of Egypt, and not with the more lurid and non-curricular subject of living mummies.”\n\n—Griffin Jay, and Reginald LeBorg. Prof. Norman (Frank Reicher)"}, {"url": "https://motorcyclehabit.com/famous-motorcycle-gangs-everything-youd-like-to-know/", "page_content": "✓ SAVINGS TIP: Find out if you're overpaying for motorcycle insurance! Save money by comparing quotes. Enter your zip to get started. ZIP:\n\nI often get people asking me if I have ever met a biker gang on the road. No I haven’t, and you probably wouldn’t realize it if you did meet a motorcycle gang member unless they had their vest on. There are very few members of motorcycle gangs compared to how many people ride motorcycles.\n\nI want to point out one thing before you dive into this article. Most of these gangs or clubs have been involved in heavy criminal activity throughout their history. That does not mean that all members of these clubs are criminals. Most members are just looking for brotherhood and a group to ride with.\n\nMy advice to those people who are worried about meeting a motorcycle gang is always the same. Be respectful to them and leave them alone and you’ll be perfectly fine.\n\nIn this article I’ll outline all the famous motorcycle gangs, where they’re located, membership numbers, and some of the things they did to become famous. Some of the most famous motorcycle gangs include:\n\nHell’s Angels\n\nBandidos\n\nMongols\n\nPagan’s Motorcycle Club\n\nSons of Silence\n\nOutlaws Motorcycle Club\n\nVagos Motorcycle Club\n\nHighwaymen Motorcycle Club\n\nFree Souls Motorcycle Club\n\nRoad Knights\n\nBrother Speed\n\nNotorious\n\nRock Machine\n\nWarlocks Motorcycle Club\n\nDragons Motorcycle Club\n\nHell’s Angels\n\nCurrent Membership: 2,500 members\n\nThe Hell’s Angels Motorcycle Club was founded in 1948 in Fontana, California and originally consisted of mostly World War 2 veterans. They saw themselves as misfits and outcasts and found brotherhood by riding together with men who had also served in the war.\n\nThe first charters of the club originated in San Francisco, Gardena, Fontana, and Oakland. The club gained notoriety through famous movies that portrayed them, especially in the 1960’s.\n\nHell’s Angels members are typically white males though there are a few members from minority races. Anyone accused of child molestation or applying to become a police officer disqualifies you to become a member.\n\nThe United States Department of Justice defines Hell’s Angels as an organized crime syndicate since the club has been involved in so many illegal activities throughout the years. The club is completely banned in the Netherlands and there are individual charters (or groups) that are banned all over the world.\n\nBandido’s\n\nCurrent Membership: 5,000 members\n\nThe Bandido’s Motorcycle club was founded in 1966 in San Leon, Texas. They are also referred to as “Bandido Nation” and have the motto “We are the people our parents warned us about”. There are currently 210 chapters in 22 countries.\n\nThe club consists mainly of white and Hispanic males, but they have no rules against those of other races or genders joining. In the early days of the club it consisted of mostly Vietnam veterans who came home from the war and felt unwelcomed in their own country. They banded together to enjoy a common interest and it grew rapidly from there.\n\nThe clubs membership is concentrated in the southeast and midwest United States with many other isolated chapters around the world.\n\nThere have been countless gun and drug charges against members of the club, but club members insist that those are the problems of the individual members and not a collective whole. There is a whole laundry list of murders that have happened in Texas that led to convictions of members of the club.\n\nMongols Motorcycle Club\n\nCurrent Membership: 2,000 members\n\nThe Mongols Motorcycle Club is also referred to as “Mongol Nation” by many people and was founded in Montebello, California in 1969. Most of the club members live in southern California, but there are organized chapters in 14 states and 10 countries.\n\nThe club’s official motto is “respect few, fear none” and they seem to live by that motto whole heartedly. Members of the Mongols have been involved in heavy criminal activity since their inception. They have been heavily involved in drug trades, money laundering, robbery, extortion, gun trafficking, murder, assault, and many other felony charges.\n\nThe club insists that those are actions of individual club members and not a message from the club as a whole.\n\nIn 1998 a federal agent infiltrated the club and rose to the position of vice-president of one of the chapters. He was able to convict 54 members of the club with felony charges in a matter of two years. In 2008, four more federal agents were able to infiltrate the club and arrested 110 other members on felony charges.\n\nSeveral attempts have been made to ban the use of the Mongol’s patch, saying that it is an emblem of domestic terrorism. All attempts at banning the patch have been dismissed in court.\n\nPagan’s Motorcycle Club\n\nCurrent Membership: 1,350 members\n\nThe Pagans were founded in 1958 in Prince George’s County, Maryland. They started out as a harmless motorcycle riding club of men owning Triumphs and Nortons but quickly expanded at the end of the Vietnam War.\n\nMembership has dwindled in recent years and members are now only allowed to ride Harley Davidson motorcycles 1,000cc or bigger. Members of the club are concentrated in the northeast US and often have fights over land with members of Hells Angels.\n\nThe Pagans were the ones who originally invented the 1%er patch, which is now used widely by almost all motorcycle clubs. In the 1970’s their membership grew to 5,000 members under a man named John “Satan” Marron.\n\nThere are very few requirements to become a member of The Pagans. The only requirements I could find through my research were that members had to be 21 years or older and have a 1,000cc or greater Harley.\n\nThe Pagans have been heavily involved in drug trafficking over the years, especially in New Jersey and Pennsylvania. There have been many members convicted of murder and assault, most of which was directed at rival gang Hell’s Angels.\n\nSons of Silence\n\nCurrent Membership: 200 members\n\nThe Sons of Silence was founded in Niwot, Colorado in 1966 and quickly spread into many other states in the Midwest and Southeast US. The club spread to Europe in the early 2000’s and has been slowly growing since then.\n\nTheir logo is a copy of the Budweiser logo, a bald eagle flying through an A. Their motto is “donec mors non separate”, meaning “until death separates us”.\n\nSeveral years ago, two federal agents infiltrated the club and were active members for two years while they gathered evidence against other members. 250 law enforcement officers dismantled several of the Colorado chapters and arrested 39 members of the club, including the club president.\n\nFederal agents seized dozens of illegal automatic weapons, hand grenades, homemade bombs, drugs, stolen motorcycles, and mounds of stolen cash. According to a news report, the Sons of Silence were one of the largest meth traffickers in the country.\n\nOne of the local chapters was protected by a 1.5” thick steel door and found inside one of the closets was a shrine to Adolf Hitler with a vulgar sign and weapons hanging below it.\n\nMembership in Colorado has not grown much since the federal agent bust.\n\nOutlaws Motorcycle Club\n\nCurrent Membership: 700 members\n\nThe Outlaws Motorcycle Club or American Outlaws Association (AOA) was formed in McCook, Illinois in 1935. Making it one of the longest running motorcycle clubs in the world. Their primary rivals are members of Hells Angels motorcycle club which gave rise to their motto ADIOS, meaning “Angels Die In Outlaw States”.\n\nThe clubs membership dropped significantly during WW2 as many of the members were deployed to Europe, but grew in even greater numbers after the war. There are several international motorcycle clubs who also refer to themselves as the Outlaws, but these clubs are not affiliated with the American club.\n\nThere is a long list of indictments and convictions of members of the AOA including gun and drug trafficking, murder, assault, illegal possession of firearms, extortion, and other charges. Different AOA chapters across the country are raided by federal agents every few years which results in the seizing of guns, drugs and usually a few arrests of members.\n\nIn 2015 the AOA celebrated their 80th Anniversary with parties and rallies around the world and giving out commemorative patches to members, showing a middle finger with the letters AOA around it.\n\nVagos Motorcycle Club\n\nCurrent Membership: 4,000 members\n\nThe Vagos Motorcycle Club was founded in San Bernardino, California in 1965. The club is also known as “Green Nation” because riders typically wear green clothes or ride green motorcycles. Their insignia is a picture of Loki, the god of mischief, riding a motorcycle.\n\nThe club’s motto is “We Give What We Get”. The clubs membership is most prominent in the western US with some chapters in several countries around the world. The club wears green to pay homage to the Mexican founders of the club.\n\nThe name Vagos comes from the Spanish word Vago, meaning vagabond or wanderer. Most club members receive a patch embroidered with the letters MF, meaning motorcycle family, after a several year probationary period. Some members of Vagos also wear green swastikas with the letters SS under it.\n\nIn 2010 over 30 members of Vagos were arrested in California for creating homemade booby traps and bombs to try and hurt police officers. These arrests were followed by busts across California by law enforcement officials who later seized countless guns, large amounts of drugs, and uncovering several meth labs owned by the group.\n\nThe group has been classified as urban terrorists by several federal agencies and pose a threat to law enforcement officers. Vagos commonly has run-ins with other motorcycle clubs that end badly for both parties.\n\nHighwaymen Motorcycle Club\n\nCurrent Membership: 800 members\n\nThe Highwaymen Motorcycle Club was founded in Detroit, Michigan in 1954. The club has been involved in a lot of very publicized federal investigations and raids throughout the years. Most members live in the Eastern US and has not spread much to the western states.\n\nTheir logo is a black and silver winged skeleton wearing a cap and jacket. The Highwaymen have been banned from the Detroit Federation of Motorcycle Clubs due to violence.\n\nThe Detroit Highwaymen clubhouse in Detroit was condemned in 2010 for being a drug den and is still vacant. In 2007 the FBI arrested 40 members of the Highwaymen in Detroit under charges of racketeering, murder, assault, cocaine trafficking, vehicle theft, and a number of other felonies.\n\nThe large sting operation conducted by the FBI involved 2 undercover agents that joined the motorcycle club. One of them was eventually found and murdered for snitching on the club.\n\nFree Souls Motorcycle Club\n\nCurrent Membership: 200\n\nThe Free Souls Motorcycle Club was founded in Eugene, Oregon in 1968 by Harley Davidson motorcycle riders. The group’s clubhouse and headquarters are still in Eugene today.\n\nThe group’s motorcycle patch is the Egyptian hieroglyphic of an ankh in front of a motorcycle wheel and handlebars. The ankh is the symbol of life. The club’s colors are blue and white, which is what rival clubs refer to the Free Souls as.\n\nThere are also small chapters of the club in Australia and Europe but membership numbers are still small and not growing quickly.\n\nThe last time the group made mainstream news was in 2010 and was actually for a good reason. Several club members were at a meeting in Salem, Oregon when a neighbor’s SUV caught on fire. The Free Souls called the fire department but put out most of the fire before local firefighters got to the scene. Their quick actions saved the house from going up in flames.\n\nRoad Knights\n\nCurrent Membership: Less than 100\n\nThe Road Knights was founded in 1979 in southern New Zealand and has never seen a large number of group members. There are three other chapters in the world; the US, Netherlands, and Thailand.\n\nThe Road Knights have had an ongoing fued with the Mongrel Mob and it came to a boiling point in 2008 when the Mongrel Mob set their headquarters on fire and stole several motorcycles. Most of the former leadership are in jail or have dispersed.\n\nBrother Speed\n\nCurrent Membership: 250 Members\n\nThe Brother Speed Motorcycle Club was founded in Boise, Idaho in 1969 by a group of high school friends. The friends put an ad in the local newspaper to see if anyone in the area was interested in getting together to ride and about 20 people showed up to the first meeting. A name and logo were picked and the club was started.\n\nThe club’s patch is a black and gold winged skull with a cap, goggles, and a scarf. At this point there are only two chapters in Idaho and Oregon.\n\nIn 2009 the club was on a ride outside of Wilsonville, Oregon when many of the members were involved in a large pileup crash. 26 riders were injured and 1 rider did not survive the wreck. There has not been near as much criminal activity reported on Brother Speed as some of the other motorcycle clubs in the area.\n\nNotorious\n\nCurrent Membership: 150 Members\n\nThe Notorious Motorcycle Club was founded in Wuppertal, Germany in 2013. The club’s logo is a half-human half-skeleton face with a cap and cigar. This new club is not to be confused with the Notorious Motorcycle Club that existed in Australia which has since stopped.\n\nThree friends began the club as a way to gather likeminded people to ride together. The club has since expanded to London, England and is slowly growing in Europe. The club does not have a presence in the US or Oceania at this point.\n\nThe club is very new compared to all other motorcycle clubs and have not been involved in any government raids or large scale illegal activities to this point.\n\nRock Machine\n\nCurrent Membership: 1,200 Members\n\nRock Machine was founded in 1986 in Montreal, Canada by Salvatore Cazzetta. There are currently six chapters in Canada, six in the US, and eight in Australia. The Rock Machine Motorcycle Club has been competing with the Hells Angels club for decades for the drug trade in Montreal.\n\nRock Machine was heavily involved in the Quebec biker war from 1994-2002 which saw over 160 casualties and many more injured. The club was dissolved into the Bandidos Club in the mid-2000’s and then a new one started again in 2007.\n\nThe current Rock Machine Motorcycle Club in Canada claims to be a different organization than they used to be and does not want to be involved in any criminal activity at all.\n\nWarlocks Motorcycle Club\n\nCurrent Membership: 500\n\nThe Warlocks Motorcycle Club was founded in 1967 in Florida by several US Navy veterans who served on the aircraft carrier USS Shangri-La. There are currently chapters in the US, Canada, England and Germany. The Mother Chapter is still located in Orlando, Florida.\n\nThe club’s logo is a red and yellow flaming phoenix.\n\nIn 1991 the club was infiltrated by an undercover agent which led to several arrests on drugs and weapons charges.\n\nDragons Motorcycle Club\n\nCurrent Membership: 500\n\nThe Dragons Motorcycle Club was founded in Oakland, California in 1959 by Tobie Gene Levingston. The club is an all male, all black club for those who ride Harley Davidsons. The club was originally founded as a car club but the club was getting into so many fights with the police that people recommended they switch to being a motorcycle club. Motorcycles are less conspicuous and easier to evade officers so the switch was made.\n\nObtaining Harley Davidsons proved difficult for members of the club since there were only two Harley Dealerships in the area and Harley did not sell to black customers at that time. So all members of the club had used motorcycles that they would have to buy from previous white riders.\n\nThe Dragons is the 2nd oldest all black motorcycle club in the world but has a much larger membership than the 1st largest.\n\nThe Black Panthers and the Dragons had a lot of involvement with each other in the early days and the Dragons attended as many civil rights parades and activities as they could to show their support for black rights.\n\nToday the Dragons try to stay very involved with community service and holding fundraisers for poor families and schools in the Oakland area. The Dragons were even honored to ride alongside the Golden State Warriors in 2015 after their National Championship Title."}, {"url": "https://www.liquisearch.com/vagos_motorcycle_club", "page_content": "The Vagos Motorcycle Club, also known as the Green Nation, is a one percenter motorcycle club that formed in 1965 in the unincorporated community of San Bernardino, California. The club originally was called \"the Psychos\". The club's insignia is Loki, the Norse god of mischief, riding a motorcycle. Members typically wear green.\n\nThe Federal Bureau of Investigation as well as the Bureau of Alcohol, Tobacco, Firearms and Explosives and the California Attorney General have named the Vagos as an outlaw motorcycle club, claiming that they are involved in criminal activities such as producing, transporting and distributing methamphetamine and marijuana, as well as assault, extortion, insurance fraud, money laundering, murder, vehicle theft, witness intimidation and weapons violations. The Vagos have approximately 600 members among 24 chapters located in the states of Arizona, California, Hawaii, Nevada, Oregon, Utah, 1 Canadian chapter in Peterborough, Ontario, and ten chapters located in Mexico (Baja California, Jalisco and Mexico City). Two hundred members are in Inland Empire (California), where the club was started in the late 1960s.\n\nIn 2002, members of the Vagos turned in the estranged wife of a Pomona, California police detective after she attempted to hire a hit man from the Vagos to kill her husband."}, {"url": "https://alchetron.com/Vagos-Motorcycle-Club", "page_content": "The Vagos have approximately 4,000 members among 200 chapters located in the states of Arizona, California, Hawaii, Nevada, Oregon, Utah, Missouri, Several Canadian chapters Peterborough, Ontario,Chapters throughout Europe and ten chapters located in Mexico (Baja California, Jalisco and Mexico City). Two hundred members are in Inland Empire (California), where the club was started in the late 1960s.\n\nThe Vagos Motorcycle Club , also known as the Green Nation , is a one percenter motorcycle club and alleged organized crime syndicate formed in 1965 in the unincorporated community of San Bernardino, California. The club's insignia is Loki, the Norse god of mischief, riding a motorcycle. Members typically wear green.\n\nHistory\n\nDuring World War II, many military service men rode motorcycles and grew attached to them, and could not leave them after the war. The motorcycle enthusiasts formed clubs around the time hot rods were in style. In 1948, the Hells Angels formed a motorcycle club; their first chapter was in San Bernardino (Berdoo), California. They shared the streets with another motorcycle club named the Psychos (Redlands). In 1965, a feud occurred among a few of the Psychos members; they left the group and created their own club, which is now known as Vagos MC. Their colors pay homage to their founders' Mexican heritage. The club expanded to the Riverside, California and the California high desert areas, and later to Mexico and Europe.\n\nInsignia\n\nA member from the Berdoo chapter (slang for San Bernardino) created a patch while he was in prison featuring Loki, the Norse god of mischief. Vago is Spanish for vagabond or wanderer. Their denim jackets sport their top rockers with their club name integrated into the middle patch, and bottom rockers with their chapter's region or state, such as \"SO. CAL\", \"California\", or \"Arizona\". The middle patch \"depicts a muscle-bound caricature of the Norse god of mischief, Loki, set against a green field\". Loki is colored red on top of a bike with his hands holding up their club name. Other patches the club wears are the number 22 (the 22nd letter of the alphabet, V, for Vagos), and a Loki head. An MF patch (meaning motorcycle family), is received by a member after a probationary period is over and the member is validated as a member of the Vagos family on the front. Some members have been seen with a green swastika and an \"SS\" symbol on their jackets.\n\nMembership\n\nVagos Membership primarily consists of Caucasian and Hispanic males.\n\nOfficial chapters\n\nThe Vagos have Chapters all throughout Southern California. They have Chapters in the High Desert (California),Inland Empire (California) which includes both Riverside County, California and San Bernardino County, California in the city of San Bernadino where they started, Azusa california San Gabriel Valley chapter ,Los Angeles and San Diego. They also have chapters in the states of Hawaii, Oregon, Nevada, and Utah as well as Memphis Tennessee and Chattanooga Tennessee and Kingston Tennessee also the country of Mexico, Mexicali BC Mother Chapter, Tijuana, Tecate Centro, Rumorosa and Rosarito beach. Europe, Canada and Australia.\n\nHemet traps\n\nOn March 17, 2010, amid allegations that Vagos members had fabricated home-made booby traps to maim and kill police detectives in Hemet, California, police arrested at least 30 Vagos members in a multi-state raid of Utah, Nevada, Arizona, and California, involving 400 police officers from 60 law enforcement agencies. The police raided 73 locations in Southern California, seizing weapons and drugs, and discovered a meth lab. The raids were the result of several incidents involving booby traps where the club was implicated:\n\nOn December 31, 2009, the unmarked headquarters of the Hemet Gang Task Force was filled with natural gas, which had been routed into the building through a hole drilled in the roof. Two task force members had detected the gas and backed away without triggering the explosion. The day before that attack, a Vagos funeral was held at a church next to the office.\n\nOn February 23, 2010, a task force member opened a security gate outside the building, causing a homemade zip gun attached to the gate to fire, nearly hitting his head.\n\nOn March 5, a task force member who had parked an unmarked police car in front of a convenience store in Hemet found a homemade pipe bomb hidden underneath the vehicle.\n\nCalifornia and federal authorities announced a $200,000 reward for information on these cases. California Attorney General Jerry Brown called the attempts \"urban terrorism.\" Riverside County District Attorney Rod Pacheco said that Vagos members posed an \"extreme threat\" to law enforcement officers and were notorious for trying to \"infiltrate\" public safety agencies, by obtaining sworn or non-sworn positions and working undercover to obstruct and dismantle police investigations.\n\nIn March 2011, the club sued Riverside County law enforcement for defamation and damages caused by implicating the group to the attacks on the Hemet police officers. On August 1, Riverside County settled the lawsuit, and cleared the club of any involvement with the attacks on the officers. Meanwhile, they had arrested two men that had no ties to the club. The club's attorney, Joseph Yanny, stated he was pleased with the result: \"This was never about money. What was important was that the club clear its name and take this shadow off them.\"\n\nNugget Casino shooting\n\nOn September 23, 2011, Vagos members were involved in a shooting at John Ascuaga's Nugget in Sparks, Nevada, where Jeffrey Pettigrew, the president of the San Jose, California chapter of Hells Angels was killed, and Vagos members were wounded. The next day, a Vagos member was wounded at a rally by a drive-by shooter. On September 29, police arrested Ernesto Manuel Gonzales, a Vagos member, at the University of California, San Francisco, for killing Pettigrew. On December 7, police announced that they had arrested Gary Rudnick, the vice-president of the Los Angeles chapter of Vagos, for instigating the fight that led to the shooting. Rudnick later pleaded guilty to second degree murder in a bargaining agreement. The trial for the two Vagos members, as well as a Hells Angels member who fired at a crowd, was held on October 29, 2012.\n\nOther incidents\n\nIn 1974, four Vagos members were convicted and sentenced to death for murdering University of New Mexico student William Velten. The four, Richard Greer, Ronald Keine, Clarence Smith and Thomas Gladish, spent 17 months on death row, but during the appeals process, Kerry Rodney Lee confessed to the murder.\n\nIn October 1998, police arrested more than a dozen Vagos members for kidnapping, drug and weapons crimes, following a two-year undercover investigation. In September 2004, state police arrested 26 members and seized more than $125,000 in cash, drugs and guns. On March 9, 2006, law enforcement conducted \"Operation 22 Green\", which involved 700 personnel from Bureau of Alcohol, Tobacco, Firearms and Explosives and local police and sheriff's departments. The operation resulted in the arrest of 25 Vagos members and associates for violating firearms and drugs policies. It was \"one of the largest coordinated law enforcement probes ever conducted in Southern California\". The investigators seized 95 illegal firearms, illegal drugs, $6,000 cash, and two stolen motorcycles. An ATF agent called the group a \"ruthless criminal bike gang\" that deals in \"guns, drugs, and death.\" Operation 22 Green and its lead-up were used as the basis for the first season of the television series Gangland Undercover.\n\nIn December 2007, police arrested six Vagos members for \"charges of first-degree burglary, second-degree robbery, coercion and second-degree kidnapping\" that occurred in August 2007. The victim had announced he was leaving the club, but suffered a beating at the Custom Motorcycle auto shop in Grants Pass, Oregon, and was then taken to his home where they attempted to rob him they failed. In February 2010, the ex-president of the chapter involved was acquitted of all charges relating to robbery assault and kidnapping.\n\nThree Vagos members were arrested on June 9 and 10, 2009, and charged with sexually assaulting a woman in San Jose, California. Police investigators told the San Jose Mercury News that the victim met the three men in a nightclub on May 4, 2009, and that they had offered to drive her home, but instead they took her to the Vagos clubhouse on Kings Row where she was beaten and sexually assaulted.\n\nOn August 13, 2011 law enforcement authorities reported that the Vagos Motorcycle Club and the Galloping Goose Motorcycle Club were involved in a shootout which shut down traffic on I-44 near Waynesville, Missouri. The local 9-1-1 center received about 20 calls, which reported that approximately 20 men were fighting, and that shots had been fired."}, {"url": "https://www.true-telecom.com/who-are-the-vagos-enemies/", "page_content": "Who are the Vagos enemies?\n\nThe Vagos MC rivals One of the Vagos MC’s biggest rivals is the Hells Angels. The two rivals motorcycle clubs’ feud goes back decades. In 2001 the two Motorcycle Clubs went head to head in a bloody feud in Costa Mesa, California.\n\nAre the Vagos a 1% club?\n\nThe Vagos Motorcycle Club, also known as the Green Nation, is a one percenter motorcycle club formed in 1965 in San Bernardino, California. The club’s insignia is Loki, the Norse god of mischief, riding a motorcycle. Members typically wear green.\n\nWho are the allies of the Bandidos?\n\nThe Australian Bandidos are allied with the Diablos, Mobshitters, and Rock Machine, while their rivals include the Comancheros, Finks, Gypsy Jokers, Hells Angels, Mongols, Notorious, Rebels and Red Devils.\n\nAre the Vagos Mexican?\n\nDescription. The Los Santos Vagos are the largest and most powerful Mexican/Latino street gang based in Los Santos and the 2nd most powerful overall gang at the beginning of the events in San Andreas.\n\nWho are Vagos in real life?\n\nThe most accurate real prototype of Vagos is the Latin Kings gang, who are the biggest Hispanic street gang in the US and sport yellow as their gang color. However, the Latin Kings’ city of origin is Chicago, though they did have active sets in California during the early 1990s.\n\nWhat does the Vagos mean in motorcycle club?\n\nVagos Motorcycle Club. The Vagos Motorcycle Club, also known as the Green Nation, is a one percenter motorcycle club formed in 1965 in San Bernardino, California. The club’s insignia is Loki, the Norse god of mischief, riding a motorcycle. Members typically wear green.\n\nWhat is the history of Vagos MC?\n\nVagos MC History. Vagos MC was founded in San Bernardino, California in 1965. Like many other motorcycle clubs of the time, the Vagos Motorcycle Club was founded by a group of members who had returned from World War II and enjoyed riding their Harley Davidson motorcycles.\n\nWhat is the Vagos MC motto?\n\nThe Vagos MC motto is “We Give What We Get”. One of the Vagos Motorcycle Club abbreviations is 22, as the 22nd letter in the alphabet is the letter “V”. The Vagos Motorcycle Club colors are green, which links back to the Mexican heritage of the Vagos Motorcycle Club founder. Vagos also use the motto “VFFV”, meaning “Vagos Forever, Forever Vagos”.\n\nHow many Vagos are there now?\n\nIt is believed that there are now over 4000 members of the Vagos Motorcycle club and 200 chapters. The Vagos Motorcycle Club was once described as “the mafia on wheels” by Charles Falco a man that once infiltrated the notorious biker gang and lived to tell the tale."}, {"url": "https://moneyinc.com/top-motorcycle-clubs-in-the-world/", "page_content": "Motorcycle clubs come in just about every shape and size imaginable. Some are locally based, others have a global presence. Some are more associated with crime than motorcycles, while others are made up of decent, upstanding folk with regular jobs and regular lives.\n\nRegardless of what the club members get up to in their spare time, the one thing that unites all motorcycle clubs is their love for the open road and all two things two-wheeled.\n\nIf you’ve ever wanted to know which motorcycle clubs are the biggest, the oldest, the baddest, or maybe just the most philanthropic, find out now as take a look at the top 20 motorcycle clubs in the world.\n\n20. The Harley Owners Group (HOG)\n\nThe Harley Owners Group (HOG) was founded in 1983 and is largely credited with helping reverse Harley Davidson’s failing fortunes in the mid-80s. It now ranks as the largest manufacturer-backed riding club in the world.\n\nConsidering Harley would be unlikely to give its official endorsement to a club that engaged as much in turf wars and drug trafficking as riding, there’s no need to panic if you see a group of HOGs rolling into town.\n\nEach chapter has to receive official sponsorship from a Harley Davidson dealer and, as you’d expect, riding a Harley is a pre-requisite of membership.\n\n19. Ducati Owners Club of Victoria\n\nHarley Davidson has its own dedicated group of MC followers. So does BMW. So it’s only fitting, then, that Ducati does too. As one of the most popular motorcycle manufacturers in the world, Ducati certainly isn’t short of fans.\n\nFew, however, are quite so ardent as the members of the Ducati Owners Club of Victoria. It might not have as many members as some of the other clubs to make our list, but its history as one of the oldest MCs in the world guarantees its inclusion.\n\n18. Women in the Wind\n\nIn 1979, Ohio resident Becky Brown decided she was tired of the boys having all the fun. Determined to create a group where women could benefit from the same companionship and sense of solidarity as male motorcyclists had been enjoying for years, she placed an ad in her local paper.\n\n10 women answered the initial ad, and soon after, the Women in the Wind Motorcycle Club was formed.\n\nToday, it has over 1200 members spread across 100 chapters around the world. As well as working to promote the rights of women motorcyclists, the club also serves to educate both its members and the public on motorcycle safety and maintenance.\n\n17. Sons of Silence Motorcycle Club\n\nAs Wikipedia writes, Sons of Silence Motorcycle Club is a one-percenter motorcycle club (i.e. a club that operates outside the rules and regulations of the American Motorcycle Association) that was founded by navy veteran Bruce Gale “The Dude” Richardson in Niwot, Colorado in the United States in 1966.\n\nSince forming, Sons of Silence has grown into one of the largest outlaw MCs in the US, with chapters in Arkansas, Colorado, Florida, Idaho, Illinois, Indiana, Kansas, Kentucky, Louisiana, Minnesota, Mississippi, Missouri, North Dakota, South Dakota, Utah, and Wyoming. In 1998, it began expanding internationally with its first chapter in Germany.\n\n16. The Vagos Motorcycle Club\n\nWhen you think of big, bad, and dangerous to know motorcycle clubs, the Vagos are probably what you’re imagining. Formed in 1965 in San Bernardino, California, the outlaw group has a notorious reputation for drug trafficking, money laundering, and violence.\n\nIt now has around 4000 members in the US spread across chapters in Arizona, California, Hawaii, Idaho, Illinois, Nevada, Oregon, Utah, and Missouri. It also boasts chapters in Mexico, Canada, Sweden, and Australia.\n\n15. Hamsters Motorcycle Club\n\nAs Motorcycle Crusier writes, the Hamsters Motorcycle Club was born as a tongue-in-cheek response to the hard-core biker image of the ’70s. Determined to show that a group of riders could have a good time without it ending in violence, the group’s founders set about creating a club that neither pandered to nor celebrated the stereotypes.\n\nAlthough rumors have abounded about the group for years (including speculation that they clean their boots with $100 bills, that they collectively own 67% of Lawrence County, South Dakota, and that they all own helicopters), there’s actually no stipulation that you have to be a millionaire to join.\n\n14. BMW Motorcycle Owners Of America\n\nIf you love BMW motorcycles, there’s one club, in particular, that has your name all over it – the BMW Motorcycle Owners Of America. Founded by five motorbike enthusiasts in Chicago in 1972, the club has its headquarters in St. Louis, Missouri. Today, it has around 40,000 members spread across the world and regularly hosts rallies and other events.\n\n13.The Buffalo Soldiers Motorcycle Club\n\nThe Buffalo Soldiers Motorcycle Club is a black motorcycle club named after the historic African-American United States Army regiments known as Buffalo Soldiers.\n\nFounded in 1993 with the aim of encouraging members to come together to ride in honor of the Black Americans who fought against slavery in the civil war, the club engages in numerous charitable and community-focused events. With over 140 chapters and more than 5000 members across the US, it ranks as one of the biggest Black motorcycle clubs in the USA.\n\n12. Bikers Against Child Abuse (BACA)\n\nThere are some motorcycle clubs that perpetuate the stereotype of the hard-drinking, hard-partying biker without even trying. And then there are some that couldn’t be further away from the image if they tried. Bikers Against Child Abuse (BACA) fall into the second category.\n\nFounded in 1995 by clinical child social worker and lifelong motorcycle lover, John Paul Lilly, the group works alongside local authorities to provide support to abused children.\n\nOnce they receive a referral, the BACA allocates a member from the chapter nearest to the child’s home. The member then provides a source of psychological support to the child, and will even accompany them to court where needed. Since its foundation, the club has grown to cover 47 states in the US and 12 countries internationally.\n\n11. The Mongols\n\nIf Bikers Against Child Abuse is the kind of motorcycle club you’d encourage your kids to join, the Mongols are the exact opposite. Founded in 1969, the Mongols have been linked to all kinds of bad behavior since their earliest days. In 2008, their activities sparked an undercover FBI operation named Operation Black Rain.\n\nAfter the investigation turned up numerous illicit activities, 38 Mongols were arrested. Although they have their main base in Southern California, they’ve also expanded internationally, with their Geman chapter proving just as notorious as their US ones.\n\n10. The Pagans\n\nIn the late 1950s, thirteen motorcycle enthusiasts teamed up to form the Pagans. At first, they were an orderly group of law-abiding citizens who just happened to love motorcycles.\n\nOver the years, things began to change, with the result that the Pagans are now one of the most infamous of the outlaw MCs. Today, they’re characterized by their mandatory denim jackets, their powerful Harley Davidsons, and their passion for making mischief.\n\n9. Gremium\n\nWhile the US is known for having some of the biggest and baddest motorcycle clubs in the world, Germany isn’t too far behind. Its most notorious MC is Gremium. Formed in 1972, the club quickly developed a reputation for acting outside the law.\n\nThese days, it’s still causing trouble, although now it’s doing it as much in Asia and the rest of Europe as it is in its homeland. Some of the least salubrious activities it’s been accused of include illegal prostitution, human trafficking, drugs, weapons trafficking, and other forms of organized crime.\n\n8. The Mad Dog Motorcycle Club\n\nIn 1994, a former executive at the pharmaceutical firm Wyeth Philippines decided to take his love of motorcycles to the next level by forming his very own MC. After starting life in Leber’s garage, the Mad Dog Motorcycle Club (as he decided to christen his new club) rapidly began to expand across Asia.\n\nToday, it has chapters in Fukuoka, Tokyo, Bangkok, Hong Kong, and Beijing, along with certain areas of the US and Europe. Joining can be tricky: not only will you need to receive a personal invitation first, but you’ll also need to demonstrate your fealty to the club’s principles of diversity, camaraderie, and brotherhood by consuming vast amounts of alcohol, puffing your way through as many packets of cigarettes as humanly possible, and undergoing various initiations over the initial 6 month trial period.\n\n7. Iron Order Motorcycle Club\n\nThe Iron Order Motorcycle Club was founded in 2004 by a group of military, police officers, prison guards, and other government employees who decided to prove once and for all that not all bikers are baddies.\n\nUnfortunately, they haven’t completely succeeded. Whenever a member gets caught up in any criminal naughtiness, the club has been quick to distance itself. However, over the years, the number of incidents has increased, dealing the club’s family-friendly reputation a hefty blow.\n\nAs Hot Cars notes, while they’re not technically a one-percenter, there’s no doubt they embrace some of their traditions, including wearing patches and getting caught up in deadly rivalries. While the police are largely tolerant of the group, the military has adopted a less kindly attitude. Not only have they labeled them a gang, but they’ve also threatened anyone who joins with expulsion from the military.\n\n6. The Outlaws\n\nThe Outlaws are one of the most notorious motorcycle clubs in the world. Founded in 1935, they’re one of the few clubs that have been mad, bad, and dangerous to know from the very beginning.\n\nToday, the club is a member of the “Big Four” outlaw motorcycle clubs, a position that means the FBI, police, and anyone else with a respect for the law have one eye on them at all times.\n\nOriginally formed in Illinois, it’s since gone global, and now has around 200 chapters scattered around the world. Although it’s happy to get into a spat with almost any other MC you care to mention, it reserves most of its hostilities for the Hells Angels.\n\n5. Christians Motorcycle Association\n\nLess of a club and more of a mission, the Christians Motorcycle Association has been spreading the good news since 1975. The leathers and denims may be the same, but this MC is as different to clubs like the Hells Angels and Pagans as chalk and cheese.\n\nFounded in 1972 when an Arkansas pastor by the name of Herb Shreve decided to bridge the generation gap by buying both himself and his son a motorcycle, the Christians Motorcycle Association is now the biggest, and quite possibly only, evangelical Christian MC in the world.\n\nThrough events, rallies, and various philanthropic activities, it aims to turn the world onto Christ and bikes like never before.\n\n4. American Motorcycle Association\n\nAs per Motorcycle Island, the American Motorcycle Association ranks as the largest motorcycle club in the world. With membership in the millions, the AMA not only fights for the rights of riders, but also sponsors the most motorcycle competitions in the world.\n\nDuring the 1970s, it unwittingly gave rise to ‘one percenter’ outlaw clubs when it issued the statement that 99% of riders at their events were law-abiding.\n\n3. Antique Motorcycle Club of America\n\nAs Hot Cars writes, bikers who own a classic motorbike will always find a home at the Antique Motorcycle Club of America. Established in 1954 in New England, the club has grown into one of the largest clubs dedicated to antique motorcycles in the world.\n\nToday, it has over 11000 members across the United States, Canada, and Europe, all of whom are dedicated to upholding the organization’s central mission statement of preserving, restoring, and operating motorbikes that are at least 35 years old.\n\n2. The Bandidos Motorcycle Club\n\nConsidered one of the Big Four Outlaw MCs, the Bandidos Motorcycle Club is one of the most infamous clubs in the world. Founded in Texas in 1966, it now has chapters in 20 countries around the world.\n\nWith a membership that consists of exactly the kind of people your parents warned you about (in fact, that’s its mantra), think twice about joining its ranks if you have any interest in staying on the right side of the law.\n\n1. The Hells Angels Motorcycle Club\n\nAs harleyliberty.com notes, the Hells Angels is the world’s largest biker motorcycle club with chapters spread across all four corners of the globe. Like the Outlaws MC, Mongols MC, and Bandidos MC, the Hells Angels is a member of the Big Four outlaw biker clubs, and it has a reputation to match.\n\nEver since the beginning, it’s had a reputation for trouble, with drug trafficking, violence, and organized crime being just a few of its favorite pastimes. Obviously, not all Hells Angels members are trouble, but enough are to make you think twice before crossing paths with one."}, {"url": "https://wiki.gta.world/index.php/Vagos_Motorcycle_Club", "page_content": "The Vagos Motorcycle Club, also known as the Green Nation, is an outlaw one percenter motorcycle club that was first established in western United States. Since then, the biker club has expanded across the USA and several other countries.\n\nThe name \"Vagos\" is the Spanish translation for the word \"vagabond\" or \"wanderer\", the colors of the Vagos pay homage to their founders' Mexican heritage. The insignia of the Vagos MC depicts a muscular burlesque of Loki, the Norse god of mischief riding a motorcycle with a green field in the background scenery. They are based throughout several countries with precisely four thousand patch members, the most prevalent being the United States and Mexico, where they earned the moniker \"The Green Empire\".\n\nThose affiliated with the Vagos Motorcycle Club can be identified by their club patches and commonly shared tattoos among the Vagos. They bear a two-piece patch on the back, a center-piece consisting of their club name “Vagos” and “MC”, accompanied by a bottom rocker stating their territorial claim.\n\nSouth San Andreas Chapter\n\nThe South San Andreas chapter of the Vagos MC was founded in the year 2010, established as a nomad charter, through the gathering of seven Vagos members previously spread across the states.\n\n\n\n\n\n-- WORK IN PROGRESS --"}, {"url": "https://www.carsandracingstuff.com/library/v/vagos.php", "page_content": "By accessing/using The Crittenden Automotive Library/CarsAndRacingStuff.com, you signify your agreement with the Terms of Use on our Legal Information page. Our Privacy Policy is also available there.\n\nVagos Motorcycle Club\n\nVagos Motorcycle Club\n\nOrganization\n\nA 1% motorcycle club.\n\nHistory\n\n\n\nThe following section is an excerpt from Wikipedia's Vagos Motorcycle Club page on 14 May 2020, text available via the Creative Commons Attribution-ShareAlike 3.0 Unported License.\n\n\n\nThe Vagos Motorcycle Club, also known as the Green Nation, is a one percenter motorcycle club formed in 1965 in San Bernardino, California. The club's insignia is Loki, the Norse god of mischief, riding a motorcycle. Members typically wear green.\n\n\n\nThe Vagos have approximately 4,000 members among 200 chapters located in the states of Arizona, California, Hawaii, Idaho, Illinois, Nevada, Oregon, Utah, Missouri, Several Canadian chapters Peterborough, Ontario, Chapters throughout Europe and ten chapters located in Mexico (Baja California, Jalisco and Mexico City). Two hundred members are in Inland Empire (California), where the club was started in the late 1960s.\n\n\n\nIn 2013, the Vagos expanded to Sweden and Australia.\n\n\n\nHistory\n\n\n\nDuring World War II, many military service men rode motorcycles and grew attached to them. The outlaw motorcycle culture was formed after World War II along Route 66 in Southern California and many clubs were formed during those years, one of which was The Psychos. In 1965, a feud occurred among a few of the Psychos members; they left the group and created their own club, which is now known as Vagos MC. Their colors pay homage to their founders' Mexican heritage. The club expanded to the Riverside, California and the California high desert areas, and later to Mexico and Europe.\n\n\n\nInsignia\n\n\n\nA member from the Berdoo chapter (slang for San Bernardino) created a patch while he was in prison featuring Loki, the Norse god of mischief. Vago is Spanish for vagabond or wanderer. Their denim jackets sport their top rockers with their club name integrated into the middle patch, and bottom rockers with their chapter's region or state, such as \"SO. CAL\", \"California\", or \"Arizona\". The middle patch \"depicts a muscle-bound caricature of the Norse god of mischief, Loki, set against a green field\". Loki is colored red on top of a bike with his hands holding up their club name. Other patches the club wears are the number 22 (the 22nd letter of the alphabet, V, for Vagos), and a Loki head. An MF patch (meaning motorcycle family), is received by a member after a probationary period is over and the member is validated as a member of the Vagos family on the front. Some members have been seen with a green swastika and an \"SS\" symbol on their jackets.\n\n\n\nArticle Index\n\n\n\n"}]}