{"Vagos Motorcycle Club is known for engaging in criminal activities such as drug trafficking, extortion, and murder.": [{"url": "https://www.history.co.uk/shows/outlaw-chronicles-hells-angels/articles/history-of-the-vagos-mc", "page_content": "History of the Vagos MC\n\nThe year is 1965. USA are in the middle of the Vietnam War, Martin Luther King has recently marched from Selma to Montgomery and Roger Miller’s ‘King of the Road’ is number one. Thirteen bikers meet on the corner of Eighth and Davidson in San Bernardino, California to form the Vagos Motorcycle Club, beginning a history that would involve drug trafficking, clashes with the police and a violent rivalry with the Hells Angels.\n\nThe elected president was Rudy Esparza, nicknamed Puro, who led the new club in selecting their name. Other names considered included Coffin Dogers MC and Satan’s Saints MC, but Vagos MC, Spanish for vagabond, was chosen. Their new patch, a red devil on a green background, was inspired by an image of a devil in LIFE magazine entitled ‘Return from hell.’\n\nMore Outlaw Motorcycle Gangs (OMGs) were established in the 1960s than in any other decade. The outlaw status is given to groups who are not sanctioned by the American Motorcyclists Association (AMA). They are also known as 1%ers, a term which originated after the Hollister biker riot in 1947 when the AMA allegedly claimed the 99% of bikers were law abiding citizens, although the AMA have no record of issuing this as an official or public statement.\n\nBikers would often move between clubs or find their club being absorbed into a larger club. Puro had previously been with the Psychos MC and others joined from clubs including El Diablo MC. The question of whether the Vagos would absorb or be absorbed was very quickly answered as more Chapters sprang up across California. In 2014 the FBI listed the Vagos as one of the largest Outlaw Motorcycle Groups in Western America with 600 members in 24 Chapters throughout America, as well as Chapters in Canada, Mexico and Europe.\n\nThe Mafia on wheels?\n\nDescribed by Vagos infiltrator Charles Falco as “the mafia on wheels” the Vagos have more than earned their 1%er patch. Drug related arrests have been made throughout their colourful history. In 1987 the head of the South Bay Chapter and President of the Desert Hot Springs Chapter along with three others all pleaded guilty to conspiracy to distribute methamphetamines. Over 40 pounds of cocaine and eight pounds of methamphetamines (and a rocket launcher!) were seized in a 2011 raid. And in 2014 four Vagos members were arrested by the FBI for selling methamphetamines.\n\nAlongside money laundering and weapons trafficking, the Vagos are also known for their general violence, especially with rival OMGs. As the Vagos attempted to expand their territory tension erupted between them and other OMGs most notably the Hells Angels. In 2001 a bloody melee broke out between the Vagos and the Angels in the Californian city of Costa Mesa. And in 2010 an argument over which gang got to hang out in the Starbucks in Santa Cruz escalated. A brawl outside the coffee shop led to a gunfight in Chino Valley, several drive by shootings and a bitter feud.\n\nThe authorities have successfully infiltrated the Vagos a number of times. George Rowe, a street criminal whose friend had disappeared after an incident with the Vagos, volunteered to go undercover as part of Operation 22 in 2003. His evidence gathered over 3 years resulted in 42 arrests and convictions for crimes as serious as murder. Whilst Charles Falco worked his way up to number two of the Victorville Chapter and provided the ATF (Bureau of Alcohol, Tobacco and Firearms) gathering enough information to make 62 arrests for crimes including assault and murder. Fun fact, both Rowe and Falco have written books about their experiences and actually appear as characters in each other’s books.\n\nHowever the Vagos have their own weapon in their ongoing battle with the police- the lawsuit. In 1990 the Vagos sued the police and received a $2 million settlement claiming they were targets of massive police abuse in the early eighties. And in 2010 when the Vagos were blamed for a spree of homemade booby traps that targeted the police, they once again sued and received a settlement that included a public statement and the return of property seized the previous year.\n\n1%ers\n\nAs with all criminal groups the Vagos don’t advertise their more notorious crimes. Their PR website vagosmcworld.com, presents them as a club rather than a gang. Their consistent response to arrests is that it is not all of their members committing crimes, but a few bad apples. So, organised crime syndicate or a club where just 1% of the 1%ers are giving them a bad name…?"}, {"url": "https://www.latimes.com/archives/la-xpm-2006-mar-10-me-vagos10-story.html", "page_content": "Times Staff Writers\n\nMore than 750 law enforcement officials conducted sweeps in five counties Thursday, aimed at breaking the back of the Vagos Motorcycle Club, an organization founded in the 1960s that authorities say is tied to dealing drugs and weapons.\n\nTwenty-two people were arrested in Los Angeles, San Bernardino, Riverside, Orange and Ventura counties, culminating a three-year investigation aimed at curtailing the operations of the Vagos organization.\n\nThe bust comes two years after another long-term investigation resulted in the arrests of 57 leaders from the Vagos’ archrivals, the Hells Angels motorcycle gang.\n\nAdvertisement\n\nAlthough the two biker gangs have their roots in California’s counterculture movement, law enforcement officials say both groups are actually sophisticated criminal enterprises with a large hand in the methamphetamine trade.\n\n“Today is just the beginning,” said Orange County Sheriff Michael S. Carona. “The Hells Angels, the Vagos -- they are not clubs. The reality is that they’re supporting [street] terrorism.”\n\nLeaders of the Vagos have long denied having any ties to criminal activity. The Vagos website states that the group was formed as a “tight brotherhood to survive the wars between the rival clubs and the constant harassment of the police.”\n\nThe message goes on to say that “Vagos comes from the Spanish language meaning ‘traveling gypsy’ or ‘a streetwise person that’s always up to something.’ ” The club has about 300 members in California, Arizona, Nevada, Hawaii and Mexico.\n\nAuthorities said the Vagos investigation was among the largest coordinated law enforcement probes ever conducted in the region. Those arrested include seven chapter presidents, one vice president, one secretary, one treasurer and seven sergeants-at-arms.\n\nOfficers said they seized 95 illegal firearms; various illegal drugs, including methamphetamine; $6,000 in cash; and two stolen motorcycles.\n\nThe crimes may later be incorporated into a federal racketeering case, officials said.\n\nThe law enforcement operation was dubbed “22-Green” because Vagos gang members wear the number 22 on their vests, representing V, the 22nd letter of the alphabet, and green is the gang’s color.\n\nThe Hells Angels wear red.\n\nThe Hells Angels and Vagos motorcycle gangs have been feuding for years. In 2001, a bloody melee broke out at a Costa Mesa swap meet that authorities later said stemmed from bad blood between Hells Angels and Vagos members. A fight between the Hells Angels and another gang, the Mongols, left three people dead at a Laughlin casino in 2003.\n\nThat year, federal officials arrested Angels leaders across several Western states on suspicion of firearms violations, narcotics trafficking, possession of stolen explosives and organized criminal activity.\n\nAuthorities on Thursday alleged that the Vagos gang also has a long history of involvement in the manufacture and distribution of methamphetamine, as well as other controlled substances. They are believed to be responsible for selling drugs in parks in San Bernardino County, officials said.\n\nBecause the Vagos are classified as a criminal street gang, judges can add enhanced penalties if members are convicted.\n\nAmong those whose homes were searched Thursday was Terry Orendorff of Hesperia, the Vagos’ 23-year international president. Although he was not arrested, Orendorff and other gang leaders remain subject to future federal racketeering charges, based on the gang’s alleged involvement in a July 2004 killing in Lucerne Valley and an attempted murder in Hesperia, authorities said.\n\nThose arrested included chapter presidents Scott “Psycho” Sikoff of Apple Valley, Vincent Mariano of Victorville, Nels “Swede” Bloom of Romoland, “Big” Roy Compton III of San Jacinto, Lino “Umpire” Garcia of Oxnard, and sergeant at arms Michael “Chainsaw” Izykowski of Huntington Beach.\n\nNone of those arrested could be reached for comment Thursday.\n\n“We expect some of the gang leadership to cooperate with us,” said Thomas Mangan, spokesman for the federal Bureau of Alcohol, Tobacco, Firearms and Explosives.\n\n“This is the just the tip of the iceberg.”\n\nIn the Lucerne Valley homicide, James Gavin, 44, was fatally shot in the upper torso, and another person was injured during a home-invasion robbery.\n\nTwo alleged Vagos members were arrested Thursday on suspicion of murder: Daniel “Twist” Foreman, 28, of Apple Valley, and Vagos vice president Ryan Matteson, 29, of Victorville. They will be charged with murder, attempted murder, street terrorism, residential robbery and first-degree burglary, authorities said.\n\nForeman had previously been arrested on suspicion of the slaying in early 2005 but was released for lack of evidence. Considerably more evidence was uncovered in the latest investigation, said Britt Imes, the San Bernardino County deputy district attorney who will prosecute the case.\n\n“It was drug-related and retaliation-related, connected to the gang’s perceived disrespect of another Vagos member’s family member,” Imes said. “We’ve been anxious to resolve that murder, and we are finally able to do that.”\n\nTwo other Vagos members, whom Imes declined to identify, were arrested on suspicion of attempted murder for their roles in firing multiple gunshots at a vehicle occupied by several people on a Hesperia street.\n\n“We believe [the shooting] was a retaliation for a high-ranking member’s relative being disrespected,” Imes said.\n\nThe Vagos organization is considered much smaller and less well-known than the Hells Angels, which rose to national prominence after a deadly altercation involving a member at a 1969 concert at Altamont in Northern California featuring the Rolling Stones and Jefferson Airplane.\n\nIn addition to their green outfits, Vagos wear patches with the image of Loki, the Norse god of mischief.\n\nLast week, 10 people associated with the group -- including the leader of the Northern California Vagos -- pleaded guilty to possessing firearms and conspiracy to sell methamphetamine.\n\n*\n\nTimes staff writer Michelle Keller contributed to this report."}, {"url": "https://www.motorcycledigital.com/vagos-motorcycle-club-membership/", "page_content": "\n\n\n\nThe Vagos Motorcycle Club is one of the most notorious and feared biker clubs in the world. From its inception in the 1960s, the Vagos have built a reputation as an organized crime gang that is known for its violence, drug trafficking, and criminal activities. Despite this reputation, members of the Vagos Motorcycle Club take pride in their commitment to their brothers and sisters and the traditions of the club.\n\n\n\nFor those looking to join the Vagos, membership is open to anyone who wants to become a part of the brotherhood. Prospective members must demonstrate a commitment to the club's ideals through their attitude and actions, as well as honor and loyalty to the members of the Vagos Motorcycle Club. The initiation process typically involves an intense period of probationary riding alongside a current member, and potential new members must be willing to endure mental and physical tests.\n\n\n\nA commitment to the Vagos Motorcycle Club is a lifelong dedication—members are expected to abide by the club's regulations, respect their fellow bikers, and never forget their commitment to the brotherhood. As a member of the Vagos, you'll have access to exclusive events, parties, and rides. You'll also be part of a powerful network of like-minded individuals who share a passion for the open road and the freedom it brings.\n\n\n\nSo, if you're ready to become a part of one of the most notorious biker gangs in the world, the Vagos Motorcycle Club is waiting for you. Join the brotherhood and experience the power of true biker camaraderie.\n\nVagos Motorcycle Club Trial Ends With Acquittals Las Vegas Review Journal\n\nBiker Gangs In America The Most Dangerous Motorcycle Complex\n\nVagos Motorcycle Club Archive Of An Outlaw Biker 1979 85 Daniel Oliver\n\nThe 8 Best Tv Shows About Motorcycle Gangs Tvshowpilot Com\n\nNevada Jury Being Picked For Vagos Biker Club Racketeering Trial Ksnv\n\nVagos Mc Brazil Home Facebook\n\n300 S Seized During Vagos Down Lake Elsinore Ca Patch\n\nInside The World S Deadliest Biker Gangs\n\nAn In Depth Look At The Vagos Motorcycle Club\n\nVagos Mc New York Главная Facebook\n\nMemoir Vagos Infiltrator Rode With Biker Gang Orange County Register\n\nVagos Mc Hawthorne You\n\nThree Biker Club Members Arrested After Search Warrants Served\n\nBiker Gangs In America The Most Dangerous Motorcycle Complex\n\nAndrew Hulk Lozano Enforcer For Vagos Gang S Desert Chapter Arrested In Sweeping Raids\n\nArmas Jaquetas E Rock História De Gangues Motos Nos Eua é Marcada Por Sangue Destruição Fotos R7 Internacional\n\nAn In Depth Look At The Vagos Motorcycle Club\n\nHow Does Vagos Motorcycle Club Operate\n\nFeds Announce Racketeering Charges Against 23 Motorcycle Gang Members Las Vegas Review Journal"}, {"url": "https://www.csmonitor.com/USA/2010/0318/Gang-crackdown-Vagos-Motorcycle-Club-targeted-in-police-raids", "page_content": "At least 30 members of the Vagos Motorcycle Club were arrested Wednesday in a multistate police raid that brings new attention to the California-based gang known for its violent past.\n\nThe raids that reportedly took place in Utah, Nevada, Arizona, and California involved some 400 police officers. As many as 70 locations were hit in Southern California, where police seized weapons and drugs and discovered a methamphetamine lab.\n\nCalifornia Attorney General Jerry Brown is expected to hold a press conference Thursday afternoon to release more details on the scope of the investigation, which official say is intended to eliminate the “threat” posed by the Vagos.\n\n\"Within the last few months, the Vagos outlaw motorcycle gang has gotten our significant attention,\" said Rod Pacheco, district attorney for Riverside, Calif., at a Wednesday press conference. \"Today, we’ve delivered and returned some of that significant attention, and we intend to continue in that effort.”\n\nWhile it's unclear exactly what provoked Wednesday's raids, the operation follows the discovery of at least four booby-traps targeting Southern California gang task force officers. Gov. Arnold Schwarzenegger has offered a $50,000 reward for information leading to the arrest of the people who set the traps, which included an attempt to blow up the gang officers' headquarters.\n\nMr. Pacheco said the operation against the Vagos motorcycle gang will continue until the threat posed “has been eliminated.”\n\nThe gang has “hundreds of members in the US and Mexico and poses a serious criminal threat to those areas in which its chapters are located,” according to the US Department of Justice.\n\nThe Justice Department’s fact sheet on US motorcycle gangs says the Vagos have at least 24 chapters across the Western US and are known for their involvement in the illegal drug trade. They have been “implicated in other criminal activities including assault, extortion, insurance fraud, money laundering, murder, vehicle theft, witness intimidation and weapons violations,” the Justice Department says.\n\nThe Vagos, also known as “Green Nation,” first formed in the late 1960s and has since been the subject of numerous investigations. In 2006, at least 25 Vagos members were arrested for various weapons and drug violations after a three-year investigation that the Orange County Register called one of the “largest coordinated law enforcement probes ever conducted in the region.”\n\nAt the time, an agent with the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) called the group a “ruthless criminal bike gang” that deals in “guns, drugs, and death.”"}, {"url": "https://www.motorcycledigital.com/vagos-motorcycle-gang-members/", "page_content": "\n\n\n\nFor more than 50 years, the Vagos Motorcycle Gang (Vagos) have been a menacing force in organized crime. The gang is active in several countries around the world, but it’s most notorious for its presence in the United States. The group has been linked to numerous high-profile crimes, from drug trafficking to weapons possession and even murder.\n\n\n\nThe Vagos emerged in the 1970s as a faction of the Hells Angels Motorcycle Club, the largest and most notorious outlaw biker gang in the world. Since then, they have grown into an international presence with over 4,000 members spread across the United States, Mexico, Canada, and Europe. While the majority of their members are still based in the US, Vagos has been linked to organized crime operations in various countries.\n\n\n\nTheir criminal activities range from drug trafficking to extortion, and their violent tactics have earned them a fearsome reputation. In addition to their traditional criminal activities, Vagos is also known for its involvement in illegal street racing, motorcycle rallies, and other forms of illegal activity. Despite their notoriety, the gang has managed to remain largely below the radar in recent years, thanks to their increasingly sophisticated tactics and well-organized structure.\n\n\n\nVagos is one of the most powerful and dangerous gangs operating today, and their presence should not be taken lightly. Those caught up in the gang’s activities are at risk of serious harm or even death. As such, it’s important for people to stay aware of the potential threat that Vagos poses and take steps to protect themselves and their families.\n\nFeds Announce Racketeering Charges Against 23 Motorcycle Gang Members Las Vegas Review Journal\n\n22 Vagos Motorcycle Gang Members Arrested In Raids Across Southern California\n\n23 Arrested In 3 States Vagos Motorcycle Gang Crime Case Linked To 2011 Nugget Shooting\n\nLas Vegas Jury Deliberates In Vagos Motorcycle Gang Racketeering Case\n\nSheriff S Office Motorcycle Gang Member Who Wielded Flail In Charged Of Marsing Farmer Ktvb Com\n\nProsecutors Want Charges Dropped Against Vagos Gang Members Ap News\n\nThe Real Life Sons Of Anarchy Men S Journal\n\n300 S Seized During Vagos Down Lake Elsinore Ca Patch\n\nThe Country S Most Notorious Biker Gangs Cnn\n\nBiker Gangs In America The Most Dangerous Motorcycle Complex\n\nTraffic Stop Leads To S Bust Vagos Members Arrested\n\nPolice Report Describes Vagos Bikers Ambush By S Angels Honolulu Star Advertiser\n\nAn In Depth Look At The Vagos Motorcycle Club\n\nFederal Agents Arrest Vagos Motorcycle Gang Members In California Nevada And Hawaii Raids Ktla\n\nAndrew Hulk Lozano Enforcer For Vagos Gang S Desert Chapter Arrested In Sweeping Raids\n\nVagos Motorcycle Club Archive Of An Outlaw Biker 1979 85 Daniel Oliver\n\n23 Arrested In 3 States Vagos Motorcycle Gang Crime Case Linked To 2011 Nugget Shooting\n\nVagos Outlaw Motorcycle Gang Page 47 Factions Archive Gta World Forums V Heavy Roleplay Server\n\nS Of Mischief My Undercover Vendetta To Take Down The Vagos Outlaw Motorcycle Gang By George Rowe\n\nMotorcycle Club S Attorney Scoffs At Fbi Sment Wired"}, {"url": "https://biker-news.com/2020/08/13/canada-three-arrested-in-drug-bust-vagos-mc-member-among-them.html", "page_content": "Canada: Three arrested in drug bust, Vagos MC member among them\n\nTwo Brockville residents face a long list of charges after a joint-forces police operation aimed at motorcycle gang and drug activity on Tuesday, while a third person faces a breach of conditions charge.\n\nThe Brockville Police Service, in a joint-forces effort with the Ontario Provincial Police and its Provincial Biker Enforcement Unit (BEU), arrested two Brockville residents, Eric St. Louis and Katrina Belisle, and seized a variety of drugs with a total street value of $17,656, police reported Wednesday.\n\n“St. Louis has been identified as a member of the Vagos motorcycle club,” city police added.\n\nOfficers arrested the pair on Jefferson Drive just before 2 p.m., said police.\n\nThey added their investigation found the accused had been using a residence on Amy Street and a hotel on Jefferson Drive to sell illicit drugs.\n\nPolice arrested a third suspect when doing the takedown.\n\nRichard Firth “was known to the officers and was breaching a bail condition by being out of his residence,” police added.\n\nThe accusations against the three have yet to be proven in court.\n\nPolice carried out search warrants at the Amy Street residence and the hotel room on Jefferson Drive, where they recovered a long list of items.\n\nCity police said officers seized a large quantity of cocaine with a street value of $8,250; a large quantity of crystal methamphetamine, estimated at $5,950; crack cocaine with a street value of $620; hydromorphone pills worth $2,750; and psilocybin (magic mushrooms) worth $86.\n\nPolice said the seizures also included a “large quantity of Canadian currency,” debt lists, cellphones, two replica long guns, a homemade weapon with razors inserted, a prohibited knife, packaging materials, scales and a safe.\n\nSt. Louis 31, of Brockville, is charged with two counts of possession of a prohibited weapon, contrary to a prohibition order.\n\nBelisle, 41, of Brockville, and St. Louis are jointly charged with possession for the purpose of trafficking cocaine; possession for the purpose of trafficking crack; possession for the purpose of trafficking crystal methamphetamine; possession for the purpose of trafficking hydromorphone; possession for the purpose of trafficking psilocybin; and unauthorized possession of a prohibited weapon.\n\nAll have been held in custody.\n\nMake sure you have subscribed to our Facebook page or Twitter to stay tuned!\n\nSource: The Recorder & Times"}, {"url": "https://www.liquisearch.com/vagos_motorcycle_club", "page_content": "The Vagos Motorcycle Club, also known as the Green Nation, is a one percenter motorcycle club that formed in 1965 in the unincorporated community of San Bernardino, California. The club originally was called \"the Psychos\". The club's insignia is Loki, the Norse god of mischief, riding a motorcycle. Members typically wear green.\n\nThe Federal Bureau of Investigation as well as the Bureau of Alcohol, Tobacco, Firearms and Explosives and the California Attorney General have named the Vagos as an outlaw motorcycle club, claiming that they are involved in criminal activities such as producing, transporting and distributing methamphetamine and marijuana, as well as assault, extortion, insurance fraud, money laundering, murder, vehicle theft, witness intimidation and weapons violations. The Vagos have approximately 600 members among 24 chapters located in the states of Arizona, California, Hawaii, Nevada, Oregon, Utah, 1 Canadian chapter in Peterborough, Ontario, and ten chapters located in Mexico (Baja California, Jalisco and Mexico City). Two hundred members are in Inland Empire (California), where the club was started in the late 1960s.\n\nIn 2002, members of the Vagos turned in the estranged wife of a Pomona, California police detective after she attempted to hire a hit man from the Vagos to kill her husband."}, {"url": "https://indybikepolo.org/vagos-motorcycle-club-members/", "page_content": "The Vagos Motorcycle Club, also known as the Green Machine, is a motorcycle club that was formed in the 1960s in the San Fernando Valley of Los Angeles, California. The club has around 1,000 members and is one of the largest outlaw motorcycle clubs in the United States.\n\nThe Vagos are one of the most feared outlaw motorcycle clubs in the world. They are known for their violence, drugs, and racism. The club has been involved in a number of high-profile killings, shootings, and brawls. In fact, the club has been so violent that the FBI has classified them as a “major criminal organization.”\n\nThe Vagos are a close-knit club and members are fiercely loyal to one another. New members are often required to do menial tasks such as cleaning the club’s headquarters or running errands for the older members.\n\nThe Vagos Motorcycle Club is not just a group of bikers who like to ride motorcycles. They are a full-blown criminal organization that is involved in a wide variety of criminal activity. Some of the things that the Vagos are involved in include drug trafficking, gun running, prostitution, and theft.\n\nThe Vagos Motorcycle Club is a dangerous organization and anyone thinking of joining them should think twice. The club is known for its violence and criminal activity, and members can often be found engaging in criminal behavior. If you are not prepared to commit serious crimes, then the Vagos Motorcycle Club is not the club for you.\n\nAre Vagos and Hells Angels rivals?\n\nAre Vagos and Hells Angels rivals?\n\nThis is a difficult question to answer, as there is no definitive answer. It is safe to say, however, that there is some rivalry between the two groups.\n\nThe Vagos are a motorcycle gang that was formed in the 1960s. The Hells Angels are the largest and most well-known motorcycle gang in the world. There is certainly some competition between the two groups, as each wants to be the most dominant motorcycle gang in the world.\n\nThere have been clashes between the two groups in the past, and there is certainly potential for more clashes in the future. It is important to note, however, that not all members of the Vagos and the Hells Angels are rivals. In fact, many members of the two groups get along well and even cooperate with each other.\n\nSo, are the Vagos and the Hells Angels rivals?\n\nThere is certainly some rivalry between the two groups, but it is not always clear-cut. Many members of the two groups get along well and cooperate with each other.\n\nWhat do Vagos do?\n\nWhat do Vagos do?\n\nThe Vagos are a motorcycle gang that operates primarily in the western United States. They are considered a “one percenter” gang, meaning that they are not part of the mainstream society. The Vagos are known for their criminal activities, which include drug trafficking, extortion, and murder.\n\nThe gang has been active since the 1960s, and their membership has grown to include thousands of members. The Vagos are most active in California, Nevada, and Arizona, but they have a presence in many other states.\n\nThe Vagos are considered a major threat to public safety, and law enforcement officials are working to crack down on their activities. In recent years, the gang has been involved in several high-profile crimes, including the murder of a sheriff’s deputy in California.\n\nThe Vagos are a dangerous gang, and anyone who is associated with them should be aware of the risks. They are known for their criminal activities, and they are not afraid to use violence to get what they want. If you come into contact with the Vagos, it is best to stay away and contact the authorities.\n\nWhy do the Hells Angels hate the Vagos?\n\nThe Hells Angels and the Vagos are two gangs that have been locked in a bloody rivalry for years. The two gangs have been fighting for control of the drug trade in California and other parts of the United States. The Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most\n\nAre Vagos white?\n\nAre Vagos white? This is a question that has been asked by many people over the years. There is no simple answer to this question, as there is no one answer that fits all Vagos. Some members of the gang may be white, while others may be of a different race or ethnicity.\n\nThe Vagos gang was formed in the 1960s in the San Fernando Valley area of Los Angeles. It is believed that the gang was originally formed by a group of Mexican-American teenagers who were looking for a way to express their dissatisfaction with society. The Vagos soon began to engage in a variety of criminal activities, including drug trafficking, robbery, and murder.\n\nThe gang has since grown in size and spread to other parts of the United States. Today, the Vagos are believed to have a membership of around 10,000 people. The gang is particularly active in the states of California, Nevada, and Oregon.\n\nThe Vagos gang is not a monolithic organization. It is made up of a variety of different members with different backgrounds and beliefs. Some members of the gang may be white, while others may be of a different race or ethnicity.\n\nWhether or not the Vagos are a white gang is a matter of debate. There is no definitive answer to this question. Some people may consider the Vagos to be a white gang because the majority of its members are white, while others may not consider the gang to be white because it includes members of other races and ethnicities.\n\nUltimately, the answer to this question depends on your definition of a white gang. If you consider a white gang to be a gang whose members are all white, then the Vagos are not a white gang. However, if you consider a white gang to be a gang whose members are predominantly white, then the Vagos may be considered a white gang.\n\nWho are the enemies of the Vagos?\n\nThe Vagos are a motorcycle gang that has been around for over 50 years. They have a long list of enemies, including the Hells Angels, the Outlaws, and the Bandidos.\n\nThe Hells Angels are the Vagos’ number one enemy. They are a rival motorcycle gang that was formed in California in 1948. The two gangs have been fighting for control of the drug trade since the 1970s.\n\nThe Outlaws are another rival motorcycle gang that was formed in Illinois in 1935. They are also fighting for control of the drug trade with the Vagos.\n\nThe Bandidos are a motorcycle gang that was formed in Texas in 1966. They are the biggest rival of the Vagos, and are also fighting for control of the drug trade.\n\nWho is the leader of the Vagos MC?\n\nThe Vagos Motorcycle Club (VMC) is a one percenter motorcycle club that was formed in 1965 in the San Fernando Valley of Los Angeles, California. The club is made up of Hispanic and Latino riders, and is considered to be one of the most violent outlaw motorcycle gangs in the US. The club’s president is currently unknown, as the club is believed to be a highly-secretive and tightly-run organization.\n\nThe Vagos MC is known for its involvement in a wide range of criminal activities, including drug trafficking, gun running, prostitution, and murder. The club is also known for its brutal and violent initiation rituals, which have resulted in several deaths. In recent years, the Vagos MC has been involved in a number of high-profile clashes with rival gangs, including the Hells Angels, the Mongols, and the Bandidos.\n\nThe Vagos MC is considered to be one of the most dangerous motorcycle gangs in the United States, and its president is a highly-secretive and powerful figure. The club is believed to have a strong presence in California, Nevada, and Arizona, and is known for its involvement in a wide range of criminal activities.\n\nWho is the most feared motorcycle club?\n\nThe most feared motorcycle club in the world is the Hells Angels. This club was founded in 1948 and is considered to be the first motorcycle club in the United States. They have a long and dark history, and are known for their violence and criminal activities.\n\nThe Hells Angels are a worldwide organization, with chapters in over 100 countries. They are known for their brutal violence and for their connections to organized crime. In the United States, they are most well-known for their connections to drugs and prostitution.\n\nThe Hells Angels are considered to be one of the most dangerous motorcycle clubs in the world. They have a history of violence and crime, and are known for their willingness to use force to get what they want. They are also known for their strict rules and for their loyalty to one another.\n\nIf you are ever in a situation where you come into contact with the Hells Angels, it is best to stay away. They are not a club that you want to mess with, and they are not a club that is afraid to use violence."}, {"url": "https://harleyliberty.com/2020/06/16/the-vagos-motorcycle-club-has-built-a-reputation-for-money-laundering-trafficking-weapons-and-just-straight-up-violence/", "page_content": "Thato Mokau-Hotcars.com\n\nThe Vagos Motorcycle Club is one of the most dangerous motorcycle gangs in the United States. Motorcycle gangs have been making like difficult for law enforcement since the 1960s. The Vagos Motorcycle Club is a one-percenter motorcycle club that was formed in 1965 in San Bernardino, California.\n\nGet your copy of New Age of Biking and Brotherhood Paperback written by James “Hollywood” Macecari- Get your copy now\n\nThe Vagos Motorcycle Club has grown into an international enterprise that in some ways resembles the mafia. The club’s insignia is Loki, the Norse god of mischief, and there isn’t a more fitting description. The Vagos MC operates mainly in the United States and the motorcycle club’s members ride Harley Davidson motorcycles and wear denim vests with their club’s insignia imprinted on the back.\n\n.The Iron Order Motorcycle Club is one of the fastest-growing motorcycle clubs in the United States of America\n\nThe Vagos Motorcycle Club’s main business is coordinating a drug-smuggling operation between the United States and the Mexican border. The Motorcycle club has also been accused of setting traps for police officers in California. Despite all of this the Vagos Motorcycle Club still maintains that they are not a notorious outlaw gang but rather a legitimate motorcycle club.\n\nRead rest of Article"}, {"url": "https://link.springer.com/article/10.1007/s12103-011-9104-8", "page_content": "A common characteristic of U.S biker gang leaders/officers is arrest or conviction of a felony. Every past national president of the Bandidos MC has been convicted and sent to prison usually for drug offenses. The same thing has happened to the last three national presidents of the Outlaws MC. Numerous Hells Angels MC national and chapter presidents, including the iconic leader, Sonny Barger, are convicted felons. Barger is a three time convicted felon. In June 11, 2007 the Spokane, Washington Hells Angels chapter president was convicted of racketeering acts, including mail fraud and extortion. Two other current and former Angel leaders were convicted along with him. The federal prosecutor was quoted as saying the case “blows up the myth that (the Hells Angels) create—that they just get together to sell T-shirts and ride motorcycles (Johnson, 2007).” In July 2006, the former Sergeant-at-Arms of the San Diego Hells Angels chapter pled guilty to conspiracy to commit racketeering and conspiracy to commit and distribute methamphetamine and received a 14-year sentence. A Shasta County, California Hells Angels sergeant at arms, a registered sex offender, was arrested for the murders of two young girls—12 & 15—over 20 years ago (Herendeen, 2006). After finishing a 13-month sentence for drug and weapons possession his DNA was run against DNA found at the girls murders and found to match. Members of the Washington Nomads Hell’s Angels, including the chapter president and the former West Coast regional president where charged with racketeering offenses (Bowermaster, 2007). The government alleged that the Washington Hells Angels Nomads are a highly organized criminal organization.\n\nIn October 2006, the national and international Bandidos president was sentenced to a 20 month prison term after he pleaded guilty to conspiracy to commit racketeering (McDonald, 2007). The same federal judge one month later sentenced the 65 year-old president of the Bellingham, Washington Bandidos chapter to 4 years in prison after he pleaded guilty to racketeering.\n\nIn 2007, a combined investigations by federal, state and local law enforcement agencies led to the indictments of fifteen members and associates of the Outlaws in Massachusetts and sixteen Outlaw members and associates in Indiana and Michigan (DOJ 1, 2007). The indictments charged the gang members with violent crime in aid of racketeering, illegal drug distribution and gun violations. The indictments charged that Outlaws in Indiana, Massachusetts and Michigan engaged in violent assaults on Hells Angels members resulting in beatings, shootings and fatalities. The Massachusetts task force seized 18 guns, including an AR-15 assault weapon; 116 g of cocaine, and $100,000 in cash. The Outlaws “Black Region” president that oversees Michigan and Indiana was also arrested along with two former vice presidents.\n\nThe Indiana and Michigan cases were resolved by guilty pleas. Fourteen Outlaws from chapters in Fort Wayne, Indiana, Indianapolis, and the Detroit chapters of Eastside, Detroit Westside, Downriver and Bay City pleaded guilty to violent crimes in aid of racketeering, illegal drug distribution and firearms violations. One pleaded guilty to possessing a firearm following three prior felony convictions (DOJ 2, 2009).\n\nIn October 2009, 55 members and associates of the Pagans MC were indicted on 44 counts that included kidnapping, racketeering, robbery, extortion, and conspiracy to commit murder (DOJ 3, 2009). Five Pagan officers, including the national president and vice-president, were among those indicted. The biker gang members were accused of conspiring with a prison guard to murder a Pagan who was cooperating with the authorities. A 20 year friend of the national vice-president, an electrical contractor from Northern Virginia was indicted because he asked for Pagan help in collecting two bad debts worth $30,000. The “respectable” businessman supplied the Pagan enforcers with the names addresses and physical descriptions of the two men who owed him money. Several of those indicted were accused of conspiring to murder an individual requested by the president of the Avengers MC. Trafficking in cocaine and operating an across state gambling operation, selling raffle tickets on a motorcycle, were included in the allegations. The illegal motorcycle raffle was an annual event earning the Mother Chapter [designated national headquarters] $50,000 a year. The robbery and extortion charges arose from a common practice among biker gangs, forcible taking the colors [patch] from rival gangs. As of February 2010, 18 defendants have pleaded guilty to a variety of charges including stockpiling explosives to use in their war with the HAMC [Hells Angels Motorcycle Club], intimidating other clubs, extortion and selling drugs. A Pagan vice president pled guilty to racketeering charges and conceded that the Pagans were, or were at one time, a criminal organization. The treasurer of the Charleston, West Virginia Pagans chapter pleaded guilty to setting up a plot with a prison guard to kill a Pagan in prison because it was believed he was cooperating with the authorities. He was also the second officer to admit that the “club” was involved in racketeering activities. The electrical contractor who asked for help in collecting bad debts pleaded guilty and received a 38-month prison sentence. He said in court that asking for the Pagans help was “the worst decision and the biggest mistake of my life (Clevenger, 2010).”\n\nSlightly less than a year later “Operation On The Road Again” by federal agents resulted in the arrests of 17 Pagans and their associates for racketeering, extortion, witness tampering, drug distribution and firearms offenses. Those arrested were members or affiliated with clubs in Long Island, upstate New York and New Jersey. Among the charges were allegations that the Rhode Island Pagans were going to attack the Hells Angels with home made grenades in retaliation for an earlier attack.\n\nIn June 2010, twenty-four members of the Outlaws and four Pagans were indicted by a Virginia federal grand jury for a wide range of criminal activities including attempted murder of rival Hells Angels, kidnapping, assault, robbery, extortion, witness intimidation, narcotics distribution, illegal gambling and weapons violations. The Outlaws national president Jack “Milwaukee Jack” Rosga and six chapter presidents and several vice-presidents, treasurers, and enforcers were arrested. Those arrested came from seven states—Maine, Montana, North Carolina, South Carolina, Tennessee, Virginia, and Wisconsin. Included within the allegations is a racial assault on a black male in Fredericksburg, Virginia. The Pagan members are included in the indictment because allegedly they joined the Outlaws in an assault against rival gangs.\n\nThe Hells Angles and other well-known biker gangs, are not the only 1% biker gangs engaged in organized criminal activities. On the West Coast in 2006, Operation Green 22 was carried out by 700 law enforcement officers against the Vagos MC. The coordinated effort involved officers from the BATF, and local police and sheriff’s departments. Twenty-five members and associates of the Vagos MC were arrested for charges ranging from murder, attempted murder, weapons and drug violations. Those arrested included seven chapter presidents, one-vice president, one secretary, one treasurer, and seven sergeants-at-arms (Risling, 2006). The Vagos are currently challenging the Hells Angels in Arizona, a state the Angels consider their territory. In the last 2 years there have been shootouts between the two gangs in Mesa, Prescott, Bullhead City and Chino Valley. There is every reason to believe that this conflict will continue.\n\nFour ATF undercover agents infiltrated the Mongols MC over a 4-year period in “Operation Black Rain” in Southern California, resulting in a 2008 indictment. The Federal Racketeering indictment alleges 86 counts of murder, attempted murder, assaults, hate crimes, gun violations and drug trafficking and led to the arrests of 61 Mongols (www.usdoj.gov/usao/cac/pressroom/pr2008/142). Among the allegations are that Mongols killed and assaulted numerous Hells Angels in California. The indictment alleges that senior Mongol members, including the national president traveled to Atlantic City, New Jersey to meet with Pagan members to form an alliance to allow for Mongol expansion into the Northeast. Furthermore, according to the indictment the Mongols MC is … “racist and hostile to the presence of African-Americans in bars or clubs where Mongols are present, or African-Americans in the presence of females associated with Mongols or Mongols members.” As of September 2009, thirty-four Mongols have plead guilty to a variety of crimes all involving the furtherance of a criminal enterprise and knowing that the criminal enterprise, the Mongols MC, and its members and associates would commit racketeering offenses. In effect, admitting that the motorcycle club is a gang.\n\nThe violence between 1% “brothers” here and overseas goes on unabated. The violence often results from long standing feuds and hatred. The feud and hatred between the Hells Angels and Mongols in 2002 erupted on the floor of Harrah’s Casino in Laughlin, Nevada when hundreds of bikers went after each other with hammers, wrenches, four-cell MAG flashlights, aka death lights; knives and guns. Ball peen hammers are one of the favorite weapons of biker gangs, especially the Hells Angels. Ball peen hammers can inflict terrible injuries but they are legal and can be carried openly. The bloody melee left one Mongol and two Angels dead with numerous injuries. After the police got things under control they found fourteen guns, 107 knives, two hammers, two wrenches, and nine flashlights. The incident was such bad publicity for the casino that Harrah’s sent out a letter to previous guests that everything was under control and it was safe to return. There is nothing but pure hatred between the two gangs who vow to kill each other on sight. Members of the Hells Angels and the Mongols fought in a Las Vegas wedding chapel in December 2008 after both groups showed up at separate weddings. Two members of the Mongols were stabbed and the chapel was trashed.\n\nViolence and hatred between the HAMC and the Outlaws has existed since the late 1960s. A favorite Outlaw patch reads ADIOS—Angels Die in Outlaw States. Two Hells Angels, one a prospect of a Canadian chapter were arraigned and later convicted of shooting five members of the Outlaws at Custer State Park in South Dakota (Walker, 2006). Both gangs were in the area for the annual Sturgis Motorcycle Rally. It was the first violence between 1% biker gangs at the rally since 1990 when a bar brawl between the Outlaws and the Sons of Silence left an Outlaw shot and two Sons of Silence members stabbed.\n\nIn September 2008, the president of the San Francisco Hells Angels, Mark “Papa” Guardado, was shot to death outside a bar in the Mission District of San Francisco. His death was reported to be the result of gang warfare but no one was charged until 2009 when Christopher Ablett a 36 year-old member of the Mongols was indicted on federal and state charges. The July 26, 2009 federal indictment charges Ablett with murder in the aid of racketeering and use of a firearm in a murder. The assassination is just one more murder between the two violent gangs. Mongols and Hells Angels have been murdering each other for decades. Their rivalry and hatred for one another is well known and marked by violence and murder.\n\nAt times biker violence extends to non-bikers, particularly blacks who are often the targets of racist bikers. A member of the Massachusetts Outlaws was convicted of interfering by force with the federally protected rights of a black man in an Ashland, Massachusetts’s restaurant (DOJ 4, 2009). Two outlaws attacked the man and beat him with fists and a ball peen hammer for staring at them."}]}