{"Vagos Motorcycle Club have been involved in numerous violent incidents with the Hells Angels, including a shootout in Laughlin, Nevada in 2002.": [{"url": "https://www.cbsnews.com/news/hells-angels-las-vegas-shooting-vagos-us-95/", "page_content": "A Memorial Day weekend shooting on a Las Vegas-area freeway was an apparent ambush by Hells Angels members on rival Vagos biker gang members returning from a veterans cemetery ride, according to a police report made public Tuesday.\n\nRichard John Devries, who police identified as the Las Vegas Hells Angels chapter president, and club recruits Russell Smith and Stephen Alo were arrested late Sunday, several hours after the shooting on U.S. 95, according to Henderson, Nevada police reports.\n\nAt least six of the seven people taken to hospitals with wounds or injuries following the midday Sunday gunfire were Vagos members or affiliates, the report said. They were riding motorcycles back to Las Vegas after stops at Hoover Dam and the Southern Nevada Veterans Memorial Cemetery in Boulder City.\n\nRichard John Devries Henderson Police Department via AP\n\nAccounts of the shooting indicate the Hells Angels pulled alongside the Vagos and started kicking, trying to knock them over, reports CBS Las Vegas affiliate KLAS-TV.\n\n\"Then one of the Hells Angels OMG riders stood up on their motorcycle and started shooting at one of the Vagos OMG riders,\" according to an arrest report.\n\nA person police identified as an anonymous witness provided video showing three men wearing Hells Angels attire riding up to the Vagos group - including one who appeared to have an object in his left hand - before shots were fired.\n\nPolice said \"multiple\" spent bullet casings were found strewn for more than a mile along the freeway.\n\nIt wasn't clear from the police narrative if anyone in the Vagos group fired weapons or if all the people who were reported sustained gunshot wounds.\n\nTwo were hospitalized in critical condition, according to a police statement issued Monday that said a seventh person involved in the shooting arrived at a hospital with injuries that weren't considered life-threatening.\n\nPolice didn't provide an update Tuesday of the conditions of the injured.\n\nDevries, 66; Smith, 46 and Alo, 26, remained jailed on $380,000 bail pending court appearances on multiple attempted murder, conspiracy, battery and weapon charges.\n\nJail and court records didn't immediately reflect court dates or if the men had attorneys who could speak on their behalf. Several attorneys who've represented Hells Angels and Vagos members in criminal cases in Las Vegas in recent years didn't immediately respond to messages from The Associated Press.\n\nThe freeway remained closed for more five hours during an investigation that also involved Las Vegas and Boulder City police and the Nevada Highway Patrol, according to the Henderson police reports.\n\nPolice said video obtained Sunday morning at a coffee shop in Boulder City and later from a dashboard camera of a police vehicle on a highway in Boulder City showed Devries, Smith and Alo among \"multiple members of the Hells Angels ... prior to the shooting call.\"\n\nCellphone GPS location data put the three men together on U.S. 95 after the shooting, the reports said."}, {"url": "https://www.rgj.com/story/news/2022/06/02/prosecutor-hells-angels-vagos-freeway-highway-95-shooting-act-revenge/7487389001/", "page_content": "HENDERSON — Authorities suspect a Memorial Day weekend shooting on a Southern Nevada highway involving longtime rival motorcycle gangs was an act of retaliation and could be \"part of a larger case,\" a Clark County prosecutor revealed in court Thursday.\n\nAccording to Chief Deputy District Attorney Danielle Chio, a Vagos biker killed a Hells Angels member last month in San Bernardino, California — the birthplace of the Vagos Motorcycle Club in the mid-1960s.\n\n\"The concern is that there's retaliatory shootings going back and forth between the two jurisdictions and between the two clubs,\" Chio said, although she did not disclose further details about last month's killing.\n\nThe latest violent encounter unfolded Sunday morning on a stretch of U.S. Highway 95 in Henderson, a suburb located just outside Las Vegas.\n\nNew details emerge\n\nThe Hells Angels bikers, Chio said, were lying in wait on the side of the freeway as their rivals returned to the area from Arizona and neighboring Boulder City after participating in an annual group ride honoring veterans.\n\nSeven people were injured in the shooting, six of whom are affiliated with the Vagos Motorcycle Club, authorities have said. During the apparent ambush, Chio revealed, one of the bullets travelled across the highway and struck a vehicle parked outside a nearby church.\n\nAfter the shooting, according to Chio, the Hells Angels bikers headed toward a Harley-Davidson dealer, where they attempted to hide their bikes before fleeing the area.\n\nThose new details emerged Thursday during an arraignment hearing in Henderson Justice Court for 66-year-old Richard Devries, president of the Hells Angels Las Vegas chapter, and recruits Russell Smith, 46, and Stephen Alo, 26.\n\nThe trio have been in police custody since their arrests Sunday evening, each held on $380,000 bail.\n\nBail arguments\n\nDuring Thursday's hearing, Chio asked Justice of the Peace David Gibson to raise bail to $1 million, while defense lawyers Richard Schonfeld and Tom Pitaro argued for lower bail, calling the $380,000 collateral \"excessive.\"\n\nThe judge ultimately denied both requests, keeping bail at $380,000 — which Gibson described as a \"big enough number\" that would \"make somebody think again\" before committing a crime.\n\n\"I believe that there is clear and convincing evidence that all of these defendants are a danger to the community,\" Gibson said.\n\nAccording to the defense attorneys, none of the defendants have a serious criminal record, and, therefore, do not pose a risk to the community. In addition, the lawyers said, their clients have deep ties to the community.\n\nDevries, a military veteran who, according to Schonfeld, was honorably discharged, has lived in Nevada for close to two decades.\n\nAlo, meanwhile, is employed and married with one daughter. He has been a Nevada resident nearly his entire life, Pitaro said. Similarly, Smith is married, employed and owns his Southern Nevada home.\n\n\"When we look at the stability factors,\" said Pitaro, who is representing both Alo and Smith, \"how do we predict the future based upon the past? All three of these men, quite truthfully, your honor, have nothing in their past that would give the court a concern for the future.\"\n\nGibson responded: \"I can't predict the future, but I can kind of control it.\"\n\nThe rivalry\n\nDevries, Alo and Smith are scheduled to return to court on June 14.\n\nBoth Vagos and the Hells Angels, which was founded in Fontana, California, in the late 1940s, are classified as outlaw motorcycle gangs by the U.S. Department of Justice.\n\nTheir violent rivalry can be traced back to the Vagos gang's attempts to expand its territory, authorities have said, including a push about a decade ago into the Hells Angels' long-claimed territory of Santa Cruz.\n\nBy late 2011, the turf war would spill into Nevada, where a shootout between the clubs broke out inside a Sparks casino that ended with the death of Hells Angels leader Jeffrey Pettigrew.\n\nRio Lacanlale is the Las Vegas correspondent for the Reno Gazette Journal and the USA Today Network. Contact her at rlacanlale@gannett.com or on Twitter @riolacanlale. Support local journalism by subscribing to the RGJ today."}, {"url": "https://apnews.com/article/entertainment-shootings-las-vegas-nevada-veterans-022c605450f270faf15fec267aa0e68f", "page_content": "This Henderson Detention Center combination photo, shows suspects from left, Richard John Devries, Russell Smith, center, and Stephen Alo, right, following their arrest and booking on Monday, May 30, 2022, on felony attempted murder, battery and weapon charges in a shooting on a Las Vegas-area freeway. Police say Devries is president of the Las Vegas charter of the Hells Angels motorcycle club and that Smith and Alo are associates of the motorcycle club. (Henderson Police Department via AP)\n\nThis Henderson Detention Center combination photo, shows suspects from left, Richard John Devries, Russell Smith, center, and Stephen Alo, right, following their arrest and booking on Monday, May 30, 2022, on felony attempted murder, battery and weapon charges in a shooting on a Las Vegas-area freeway. Police say Devries is president of the Las Vegas charter of the Hells Angels motorcycle club and that Smith and Alo are associates of the motorcycle club. (Henderson Police Department via AP)\n\nLAS VEGAS (AP) — A Memorial Day weekend shooting on a Las Vegas-area freeway was an apparent ambush by Hells Angels members on rival Vagos biker gang members returning from a veterans cemetery ride, according to a police report made public Tuesday.\n\nRichard John Devries, who police identified as the Las Vegas Hells Angels chapter president, and club recruits Russell Smith and Stephen Alo were arrested late Sunday, several hours after the shooting on U.S. 95, according to Henderson police reports.\n\nAt least six of the seven people taken to hospitals with wounds or injuries following the midday Sunday gunfire were Vagos members or affiliates, the report said. They were riding motorcycles back to Las Vegas after stops at Hoover Dam and the Southern Nevada Veterans Memorial Cemetery in Boulder City.\n\nA person whom police identified as an anonymous witness provided video showing three men wearing Hells Angels attire riding up to the Vagos group — including one who appeared to have an object in his left hand — before shots were fired.\n\nPolice said “multiple” spent bullet casings were found strewn for more than a mile (1.6 kilometer) along the freeway.\n\nIt was not clear from the police narrative if anyone in the Vagos group fired weapons, or if all the people who were reported injured received gunshot wounds.\n\nTwo were hospitalized in critical condition, according to a police statement issued Monday that said a seventh person involved in the shooting arrived at a hospital with injuries that were not considered life-threatening.\n\nPolice on Tuesday did not provide an update of the conditions of the injured.\n\nDevries, 66; Smith, 46; and Alo, 26, remained jailed on $380,000 bail pending court appearances on multiple attempted murder, conspiracy, battery and weapon charges.\n\nJail and court records did not immediately reflect court dates or if the men had attorneys who could speak on their behalf. Several attorneys who have represented Hells Angels and Vagos members in criminal cases in Las Vegas in recent years did not immediately respond to messages from The Associated Press.\n\nThe freeway remained closed for more five hours during an investigation also involving Las Vegas and Boulder City police and the Nevada Highway Patrol, according to the Henderson police reports.\n\nPolice said video obtained Sunday morning at a coffee shop in Boulder City and later from a dashboard camera of a police vehicle on a highway in Boulder City showed Devries, Smith and Alo among “multiple members of the Hells Angels ... prior to the shooting call.”\n\nCellphone GPS location data put the three men together on U.S. 95 after the shooting, the reports said."}, {"url": "https://www.history.co.uk/shows/outlaw-chronicles-hells-angels/articles/history-of-the-vagos-mc", "page_content": "History of the Vagos MC\n\nThe year is 1965. USA are in the middle of the Vietnam War, Martin Luther King has recently marched from Selma to Montgomery and Roger Miller’s ‘King of the Road’ is number one. Thirteen bikers meet on the corner of Eighth and Davidson in San Bernardino, California to form the Vagos Motorcycle Club, beginning a history that would involve drug trafficking, clashes with the police and a violent rivalry with the Hells Angels.\n\nThe elected president was Rudy Esparza, nicknamed Puro, who led the new club in selecting their name. Other names considered included Coffin Dogers MC and Satan’s Saints MC, but Vagos MC, Spanish for vagabond, was chosen. Their new patch, a red devil on a green background, was inspired by an image of a devil in LIFE magazine entitled ‘Return from hell.’\n\nMore Outlaw Motorcycle Gangs (OMGs) were established in the 1960s than in any other decade. The outlaw status is given to groups who are not sanctioned by the American Motorcyclists Association (AMA). They are also known as 1%ers, a term which originated after the Hollister biker riot in 1947 when the AMA allegedly claimed the 99% of bikers were law abiding citizens, although the AMA have no record of issuing this as an official or public statement.\n\nBikers would often move between clubs or find their club being absorbed into a larger club. Puro had previously been with the Psychos MC and others joined from clubs including El Diablo MC. The question of whether the Vagos would absorb or be absorbed was very quickly answered as more Chapters sprang up across California. In 2014 the FBI listed the Vagos as one of the largest Outlaw Motorcycle Groups in Western America with 600 members in 24 Chapters throughout America, as well as Chapters in Canada, Mexico and Europe.\n\nThe Mafia on wheels?\n\nDescribed by Vagos infiltrator Charles Falco as “the mafia on wheels” the Vagos have more than earned their 1%er patch. Drug related arrests have been made throughout their colourful history. In 1987 the head of the South Bay Chapter and President of the Desert Hot Springs Chapter along with three others all pleaded guilty to conspiracy to distribute methamphetamines. Over 40 pounds of cocaine and eight pounds of methamphetamines (and a rocket launcher!) were seized in a 2011 raid. And in 2014 four Vagos members were arrested by the FBI for selling methamphetamines.\n\nAlongside money laundering and weapons trafficking, the Vagos are also known for their general violence, especially with rival OMGs. As the Vagos attempted to expand their territory tension erupted between them and other OMGs most notably the Hells Angels. In 2001 a bloody melee broke out between the Vagos and the Angels in the Californian city of Costa Mesa. And in 2010 an argument over which gang got to hang out in the Starbucks in Santa Cruz escalated. A brawl outside the coffee shop led to a gunfight in Chino Valley, several drive by shootings and a bitter feud.\n\nThe authorities have successfully infiltrated the Vagos a number of times. George Rowe, a street criminal whose friend had disappeared after an incident with the Vagos, volunteered to go undercover as part of Operation 22 in 2003. His evidence gathered over 3 years resulted in 42 arrests and convictions for crimes as serious as murder. Whilst Charles Falco worked his way up to number two of the Victorville Chapter and provided the ATF (Bureau of Alcohol, Tobacco and Firearms) gathering enough information to make 62 arrests for crimes including assault and murder. Fun fact, both Rowe and Falco have written books about their experiences and actually appear as characters in each other’s books.\n\nHowever the Vagos have their own weapon in their ongoing battle with the police- the lawsuit. In 1990 the Vagos sued the police and received a $2 million settlement claiming they were targets of massive police abuse in the early eighties. And in 2010 when the Vagos were blamed for a spree of homemade booby traps that targeted the police, they once again sued and received a settlement that included a public statement and the return of property seized the previous year.\n\n1%ers\n\nAs with all criminal groups the Vagos don’t advertise their more notorious crimes. Their PR website vagosmcworld.com, presents them as a club rather than a gang. Their consistent response to arrests is that it is not all of their members committing crimes, but a few bad apples. So, organised crime syndicate or a club where just 1% of the 1%ers are giving them a bad name…?"}, {"url": "https://www.cbsnews.com/news/hells-angels-and-vagos-motorcycle-gangs-in-arizona-shootout-say-cops/", "page_content": "CHINO VALLEY, Ariz. (CBS/AP) It sounds like a scene out of a movie, but for one Arizona neighborhood it was a frightening and violent reality when two rival motorcycle gangs exchanged gunfire in the middle of the street, according to police and witnesses.\n\nWitnesses say that trouble started Saturday afternoon when a group of bikers, who reportedly belong to the Vagos motorcycle gang, rode past a house where another group of bikers, reported to be Hells Angels, were having a party.\n\n\n\nThe Hells Angels allegedly opened fire on the Vagos riders who then returned fire, CBS affiliate KPHO reported.\n\nDozens of Arizona law enforcement officers descended on the area after dispatchers started receiving calls about gunshots, including members of the Arizona State Gang Task Force, Yavapai Sheriff's spokesman Dwight D'Evelyn said.\n\nWhen the dust settled, 27 people were booked on charges ranging from attempted murder and aggravated assault to participation in a criminal street gang. At least five people were shot, but none of the injuries were life threatening, according to D'Evelyn.\n\nDetectives estimate at least 50 rounds were fired during the shootings.\n\nThe Hells Angels have owned the two-story gray house where the shootout occurred for a few years, and apparently used it as a sort of clubhouse. But when the Vagos reportedly moved into a house just up the street, neighbors say they knew a turf war was brewing, according to KPHO.\n\nStill, the violence was not what most would expect in the rural area just north of Prescott, Ariz.\n\n\"Yesterday, I got caught in gunfire by two biker gangs,\" Jon Humen told the station. \"I moved here from Phoenix to get away from this.\"\n\nInvestigators remained in Chino Valley on Sunday, examining and recovering evidence. Several motorcycles were impounded and detectives were trying to locate one injured gang member who was helped away from the scene in an unknown vehicle, D'Evelyn said.\n\nIn December, an Arizona Department of Public Safety spokesman said an ongoing power struggle in northwestern Arizona between the Vagos and the Hells Angels had led to a series of violent assaults."}, {"url": "https://www.phoenixnewtimes.com/news/hells-angels-charges-dismissed-in-2010-shootout-with-vagos-bikers-6627161", "page_content": "Charges were dismissed against seven members of the Hells Angels Motorcycle Club who were accused of being involved in a 2010 shootout with Vagos, a rival gang.\n\n\n\nThe two clubs shot it off in Chino Valley, north of Prescott, in August 2010, as at least 50 shots were fired, although no one was seriously injured.\n\n\n\nRichard Gaxiola, an attorney for one of the alleged Angels, tells New Times that the only direct witness to the confrontation between the gangs immediately before the shooting happened to be a paid confidential informant -- a fact that wasn't presented to him or the other attorneys for quite some time.\n\n\n\n\n\n\"The only witness to the incident was a confidential police informant at the time who tried to infiltrate the Hells Angels, was rebuked, and had substantial biases against the Angels to begin with,\" Gaxiola says.\n\n\n\nThe informant, Alfred Acevedo, had become a \"hanger on\" with Vagos, while working as an informant for an Arizona Department of Public Safety detective named John Morris.\n\n\n\nThe night of the shooting, Acevedo and another man were at a Circle K store picking some things up for the \"Tri-State President\" of Vagos, Ruben Lopez.\n\n\n\nWhile Acevedo was at the store, some Hells Angels -- identified by their getup -- walked into the store, and one of the men asked Acevedo about his Vagos t-shirt.\n\n\n\nAcevedo then called back the Vagos house in town, telling them about a \"confrontation\" with the Angels, and he was told to wait there while some Vagos came by to help.\n\n\n\nAcevedo said he watched the Hells Angels from across the street, and followed the group of Vagos members when they rolled up.\n\n\n\nBut Acevedo claimed he got \"lost,\" and by the time he got back to the Vagos house, the shootings had already happened.\n\n\n\nTwenty-seven people were arrested after that shooting, while five were indicted by a grand jury.\n\n\n\nThe case was remanded to a second grand jury, in which seven were indicted: John Bernard, Kevin Christiansen, Kiley Hill, Robert Kittredge, Michael Koepke, Larry Scott Jr., and Bruce Schweigert.\n\n\n\nThrough both of those grand juries, Yavapai County Sheriff's Office Detective David Zavos failed to mention that Acevedo was an informant, despite Zavos stating that he was aware of this during both.\n\n\n\nDeputy County Attorney Dana Owens, who was prosecuting the case, didn't find out that Acevedo was an informant until February 2011, when someone decided to fill her in.\n\n\n\nHowever, according to Yavapai County Superior Court Judge Celé Hancock's ruling, it appears that Owens still didn't disclose this information to defense attorneys during an evidentiary hearing later that month, although Hancock didn't find her responsible for purposely withholding anything.\n\n\n\nHancock ruled to dismiss the case against the five men, but did so without prejudice, which allows the state to file the charges again and start the process over.\n\n\n\n\"Acevedo's status as a paid informant and as the only direct witness to a confrontation that led to the shootings in this case is material and clearly exculpatory,\" Hancock writes.\n\n\n\nChief Deputy County Attorney Dennis McGrane confirmed to New Times that his office will submit the charges again, but declined to comment on the strength of the prosecution's case in an attempt to \"avoid the appearance of trying a case in the media.\"\n\n\n\nGaxiola, who filed the motion to dismiss the case -- which the rest of the Angels joined in on -- wanted the charges dismissed for good, claiming that everyone's failure to identify Acevedo as an informant was intentional.\n\n\n\nHancock did write at one point that Acevedo's failed attempt to join the Hells Angels \"gives rise to possible issues of bias and veracity.\"\n\n\n\nAcevedo has also worked as an informant for the Bureau of Alcohol, Tobacco, Firearms and Explosives, as well as the Gang and Immigration Intelligence Team Enforcement Mission task force in other parts of the state.\n\n\n\n"}, {"url": "https://www.huffpost.com/entry/hells-angels-gang-fight-w_n_1062730", "page_content": "Two people died, eight suffered gun shot wounds and dozens have been arrested in what authorities are calling \"the most severe clash\" in a decade between two California biker groups, reports Reuters -- and it all started over Starbucks coffee.\n\nOn Saturday, members of the San Jose, Calif., chapter of the motorcycle gang Hells Angels are set to attend the second funeral in as many months for a fallen member of their group. The death of Steve Tausan is the culmination of almost two years of violent tension between Hells Angeles and competing motorcycle gang The Vagos. Security is tight for Tausan's funeral, reports SF Gate, and police hope to stem the tide of growing biker violence.\n\nAdvertisement\n\nMounting tensions between the Hells Angels and Vagos motorcycle clubs erupted in January 2010, when members of each club fought each other over territory at a Starbucks cafe in Santa Cruz, Calif. Santa Cruz Deputy Police Chief Steve Clark analyzed the situation for Reuters, saying, \"It was all about who would be allowed to hang out at the Starbucks downtown... Only in Santa Cruz would you have biker wars over who's going to control pumpkin spice lattes.\" In this case, it was the Vagos who were encroaching on turf that had been considered part of Hells Angels territory.\n\nThe fight spread to other states and continued to escalate. In August 2010, 27 members of the Vagos and the Hells Angels were arrested in Arizona for taking part in a shoot out that resulted in at least five wounded victims. According to CBS News, the violent confrontation took place shortly after the Vagos moved in nearby to a house owned by the Hells Angels. At least 50 rounds of ammunition were exchanged between the two gangs during a house party, reports CBS affiliate KPHO.\n\nThe violence crossed state lines again and turned deadly in September 2011. A Hells Angels leader named Jeffrey \"Jethro\" Pettigrew, chapter president of the San Jose California Hell's Angels, was shot to death on the floor of a Nevada casino, reports the San Jose Mercury News. He and thousands of other bikers were in Sparks, Nevada for the annual \"Street Vibrations\" biker festival when a skirmish between the Hells Angels and the Vagos erupted on the floor of the John Ascuaga's Nugget Casino Resort in Sparks. In addition to Pettigrew, two Vagos members were wounded but taken to the hospital in stable condition, according to the Mercury News.\n\nThe next day, another motorcyclist was shot in the stomach by someone driving a car, reports ABC News. The second shooting prompted the city of Sparks to declare a state of emergency and cancel the remainder of the \"Street Vibrations\" festival, according to the Reno Gazette-Journal.\n\nAdvertisement\n\nThe final tragedy took place at Pettigrew's funeral on October 15, 2011, where Hells Angels biker Steve Tausan was fatally shot by a fellow member. According to Reuters, Tausan and several others confronted member Steve Ruiz because of \"his perceived failure to have protected Pettigrew during the Nugget casino brawl.\" Ruiz is believed to have shot Tausan during the conflict, and he has been evading the authorities ever since.\n\nIt is Tausan's life the Hells Angels will be remembering on Saturday -- hopefully without incident."}, {"url": "https://apnews.com/article/hells-angels-vagos-shooting-vegas-motorcycles-8749ff62558bc897bdd75661688eb6c7", "page_content": "FILE - Richard Devries, 66, makes his initial court appearances in Henderson Justice Court Thursday, June 2, 2022, in Henderson, Nev. Seven alleged Hells Angels members won’t face racketeering or gang charges in a Las Vegas-area freeway shooting that authorities said injured seven people, including six rival Vagos motorcycle gang members, almost a year ago, a judge decided Monday, May 1, 2023. The judge in Las Vegas also reduced from 25 to five the number of shooting counts against defendants including the Hells Angels Las Vegas chapter president Devries. (K.M. Cannon/Las Vegas Review-Journal via AP, File)\n\nFILE - Richard Devries, 66, makes his initial court appearances in Henderson Justice Court Thursday, June 2, 2022, in Henderson, Nev. Seven alleged Hells Angels members won’t face racketeering or gang charges in a Las Vegas-area freeway shooting that authorities said injured seven people, including six rival Vagos motorcycle gang members, almost a year ago, a judge decided Monday, May 1, 2023. The judge in Las Vegas also reduced from 25 to five the number of shooting counts against defendants including the Hells Angels Las Vegas chapter president Devries. (K.M. Cannon/Las Vegas Review-Journal via AP, File)\n\nLAS VEGAS (AP) — Seven alleged Hells Angels members won’t face racketeering or gang charges in a Las Vegas-area freeway shooting that authorities said injured rival Vagos motorcycle gang members almost a year ago, a judge decided Monday.\n\nClark County District Court Judge Tierra Jones also reduced from 25 to five the number of shooting counts in the case against defendants, including the Hells Angels Las Vegas chapter president, Richard Devries.\n\n“The court finds that the ... indictment does not specify which of the defendants engaged in which type of criminal activities, and further does not include the specificity of the racketeering crimes,” Jones wrote. Her ruling followed a March 31 hearing with attorneys and defendants in the case.\n\nAttorney Richard Schonfeld, representing Devries, said Monday he was pleased the judge “granted important aspects of my motion.” He had argued that the indictment was too broad and should be dismissed or revised.\n\nProsecutors Michael Dickerson and Michael Allmon said they were looking at the ruling and declined immediate comment. They could appeal Jones’ decision to the Nevada Supreme Court.\n\nAttorneys for the other defendants did not immediately respond to emails seeking comment.\n\nDevries and the men identified as Hells Angels members or associates — Russell Smith, Stephen Alo, Cameron Treich, Taylor Rodriguez, Aaron Chun and Rayann Mollasgo — still face prosecution on charges including attempted murder, conspiracy to commit murder, battery and assault with weapons. Each has pleaded not guilty to all charges. Each could face up to 40 years in prison if convicted of attempted murder with a weapon.\n\nThe judge instructed prosecutors to revise the indictment. A hearing in the case remained scheduled Wednesday.\n\nPolice said seven people were treated at hospitals for wounds or injuries following the gunfire that erupted among motorcycle riders on Interstate 11 in Henderson after a Memorial Day weekend ceremony at a veterans cemetery in Boulder City.\n\nSchonfeld argued March 31 that Mollasgo, a Hells Angels associate but not a full member, was treated for a gunshot wound, and that police at the scene examined handguns that some of the alleged Vagos had with them, but returned them.\n\n“The grand jury doesn’t know that a Hells Angels-affiliated individual (was) shot and that four Vagos members had firearms concealed on their person,” Schonfeld said. He argued that prosecutors failed to present ”exculpatory evidence” that might cast doubt on the charges they were seeking.\n\nFour motorcycles had gunshot damage, according to evidence, and police found 25 bullet casings on the freeway near where the gunfire took place. Schonfeld told the judge the indictment did not specify what person was alleged to have fired which shots, or which bullets hit which motorcycle.\n\nMollasgo’s lawyer, Augustus Claus, told Jones that his client had become a member of the Hells Angels chapter less than a week before the shooting, but he was accused of a conspiracy with other members dating to 2019.\n\nSchonfeld and Tom Pitaro, attorney representing defendants Russell Smith and Stephen Alo, told the judge that prosecutors never presented evidence that their clients had any intent or agreement to commit a crime.\n\n“Riding (motorcycles) in a group does not show a conspiracy to commit a violent act of shooting (or) attempted murder,” Pitaro said."}, {"url": "https://www.phoenixmag.com/2011/10/01/hells-angels-shootout/", "page_content": "Like most of their immediate neighbors in the sparse high-desert town of Chino Valley, Arizona, the Schafmans were familiar with the two-story stucco house opposite their multi-acre property on Yuma Drive. How could they not be? For many years, it was a well-trafficked Hells Angels hangout. Members of the colorfully named Skull Valley chapter, which was the Angels’ main garrison in north-central Arizona until disbanding in 2006, used it as their clubhouse. A biker still lived there, but he was ailing and infirm, tethered to oxygen tanks and a motorized scooter. The house – which once roared with all-night bacchanals and fleets of hard-revving Harleys – had been silent for years.\n\nLess well known to the good people of Yuma Drive were the occupants of a house about 300 yards down the road. Michael Diecks and his wife, Leslie, had recently moved into the single-family home with their three children – an unremarkable arrangement if not for the fact that Diecks, also known as “Mad Dog Mike,” was a full-patch member of the Vagos motorcycle club.\n\nThe Hells Angels and Vagos – also known as “Green Nation” in the outlaw-biker world for their signature color – have a chippy history, to put it mildly. As so-called “one-percenter” MCs, they emerged from the same amniotic Southern California/Inland Empire biker culture to become bitter rivals, with the Angels playing the proud, powerful incumbents to the Vagos’ motivated upstarts. They’ve brawled hard and often. Over territory. Over nasty remarks. Over whatever.\n\n“They’ve been going at it since the late ’60s,” according to Steve Trethewy, a former Arizona Department of Public Safety (DPS) officer who served 25 years on the department’s anti-gang unit. “They’ll fight, then go dormant, then fight again, then patch things up. It’s all about power and territory.”\n\nHad they been privy to this information, the citizens of Chino Valley might have been less startled by the pop-pop sound of gunfire that raked across Yuma Drive on Saturday, August 21, 2010, shortly after noon. In an instant, their grassy, wide-open neighborhood took on the guise of a Waziristan warzone. The Schafmans – who declined comment for this article – told investigators they heard “approximately 100 shots fired” during the 10-minute gunfight, but official estimates put the number closer to 50. The battle left five bikers wounded, netted 27 arrests and resulted in nine indictments. One year after the melee, virtually everything else about the case, which has yet to go to trial, is still in dispute. The Yavapai County Attorney accepts the Vagos’ account of the incident – in essence, that the Hells Angels fired on them unprovoked as they rode past the two-story stucco house, triggering the fusillade – while the Hells Angels and their attorneys broadly maintain that it was an ambush on the part of the Vagos.\n\nFor the actors involved, the who-shot-first question is paramount. For the rest of us, not so much. In fact, in a case that stokes age-old questions about Arizona’s most powerful bike club, hints at a potentially violent restructuring of the outlaw-biker pecking order and – pursuant to court documents obtained by PHOENIX magazine – reveals provocative details about the crime-fighting methodology of Arizona’s anti-gang units, the question of which band of well-armed hombres shot first seems mostly academic.\n\nBy most accounts, outlaw-biker affiliation is on the rise in Phoenix and elsewhere. So the more pressing question is: Will it happen again? And where?\n\nAs dozens of Yavapai Sheriff’s Office and DPS vehicles swarmed the neighborhood of Yuma Drive shortly after the shooting, a Vagos biker on the scene described the aftermath in no uncertain terms:\n\n“We’re in a war.”\n\n“We’re not a gang,” Michael Koepke, seated in his lawyer’s office, says evenly. “People always slap that thing on us. We’re about brotherhood and riding bikes. And that’s it.”\n\nWell-groomed, fit and articulate, Koepke is part of the Hells Angels’ new guard. Even with his wrist-to-wrist tattoos, the 28-year-old ex-Army infantryman and aspiring Muay Thai prize-fighter seems more Team America than America’s Most Wanted. If he traded in the leather cuts for a pair of pleated wool slacks, Koepke could pass for a lawyer himself.\n\nHe’s also one of the six men – all associated with the Hells Angels’ Arizona Nomads chapter – facing prison time for the Chino Valley shootout, on a menagerie of charges ranging from aggravated assault to disorderly conduct with a weapon.\n\nKoepke’s objection to the “gang” label isn’t just a matter of semantics; in fact, it carries very tangible legal consequences for the 2,500-member-strong worldwide organization. Arizona’s law enforcement entities – including its anti-gang task force, the multi-agency Gang & Immigration Intelligence Team Enforcement Mission (GIITEM) – classify the Hells Angels as a criminal street gang, which means courts can apply enhanced sentencing to lawbreakers. Simple assault becomes a multi-year stretch in prison. A bar fight becomes “felony riot.”\n\nThe Angels dispute the criteria. They claim to be mischaracterized and misunderstood, victims of a zealous law enforcement camp bent on crushing their authority-averse lifestyle.\n\nOf course, the gang stigma is nothing new for the Hells Angels; it has faithfully accompanied them since the club’s earliest days in the Southern California steel town of Fontana, circa 1948, even as they grew into the world’s biggest and most recognized biker entity. Certainly, they can seem like a gang, with their iconic death-head patches and hard-as-nails mystique, but members readily tick off reason after reason why the “gang” descriptor doesn’t fit. Disavowing the stigma has itself become something of an institutional passion for the bikers; a sort of sacred incantation, like stone-writ Druidic verse. Certainly, the Angels’ larger-than-life reputation can salt the impressions of law enforcement personnel. Last November, Yavapai County Sheriff’s Office Detective David Zavos – the lead investigator in the Chino Valley case – offered a grand jury the following impressionistic analysis of the combatants: “The Vagos, for the most part, are not a real aggressive gang. They are somewhat family oriented, opposed to the Hells Angels, who are more into criminal enterprise.”\n\nThat makes Koepke shake his head. “Family oriented. I’m not sure what that means. I have a 1-year-old son and a wife, and I’m totally devoted to them. Doesn’t that make me family oriented? I’m not sure what it has to do with anything.”\n\nYavapai County Superior Court Judge William T. Kiger had similar reservations, kicking the original indictments back to a grand jury after weighing Zavos’ testimony – a short-lived but significant legal victory for the Hells Angels. A defense counsel noted that the Vagos and Hells Angels have near-identical law enforcement profiles; both appear on a Department of Justice list of MCs with suspected involvement in serious crimes such as drug distribution and witness intimidation.\n\nA Vagos member involved in the shootout did not respond to an interview request through an attorney.\n\nFrom the beginning, the Chino Valley case seemed freighted with special small-town tensions. Ironically, one of the accused Angels – Larry “Scotty” Scott, a former college football player and on-again, off-again thoroughbred racehorse owner – previously coached Zavos’ teenage son in his capacity as the defensive coordinator for a local high school team. “[The detective] told me my days as a coach were done,” Scott, who has since left the team, alleges.\n\nPrivately, the Angels acknowledge that some of their members break the law, perhaps even at a statistical pace higher than non-bikers. But they deny that criminal activity is an institutional part of the Hells Angels culture, or that the club maintains a criminal hierarchy within its ranks, à la the Mafia and other corporatized criminal rackets. Richard Gaxiola, a Phoenix-based attorney who represents Koepke and has defended Hells Angels in previous cases, insists that the seven-point Arizona statute for defining a criminal street gang is “overly broad” and a “crass gambit for GIITEM to justify government funding” by turning the Hells Angels into perennial hobgoblins.\n\n“If you look at the street-gang criteria – self-proclamation, official clothing or colors, written correspondence and so on – then the Blue Knights, which are a national law-enforcement motorcycle club, they’d have to be classified a criminal street gang, too,” Gaxiola says. “At the end of the day, the Hells Angels is nothing more than a group of guys who love to ride motorcycles and hang out with like-minded individuals. Sure, some of them are knuckleheads, but most have jobs and wives and kids. Most of them are veterans. They’re stand up guys.”\n\nThough some law enforcement figures acknowledge the Angels’ improved public image over the years – “I call it their spit-and-polish,” one DPS officer says – others point to ugly incidents, such as the murder of 44-year-old party guest Cynthia Yvonne Garcia by three members of the Mesa chapter in 2001. The Angels disavow the crime. They insist that each of their chapters are semi-autonomous entities with their own bylaws and values, and that applying the crimes of one member to the whole club makes as much sense as, say, penalizing the Phoenix PD for a corruption scandal in the LAPD.\n\n“Everybody is his own man in the Hells Angels,” one longtime member says. “Each chapter governs itself. That’s what the authorities never understand. I mean, there’s a chapter back east that doesn’t even let its members smoke pot. That’s why those conspiracy charges never stick. There’s no conspiracy.”\n\nNaturally, the authorities tend to disagree. “They’re very well structured,” says Trethewy, now a spokesman for the law-enforcement think tank Rocky Mountain Information Network. “They have bylaws, they go to meetings and pay dues, they use trademarks and copyrights, and they commit crime. I’d say that makes them a criminal organization.”\n\nTrethewy dismisses the “few bad apples” notion, citing a recent internal DPS report that suggests the majority of the Arizona Hells Angels – who number somewhere around 110 – have rap sheets that include felony arrests: “That’s not a cross-section of society. I don’t care what you say.”\n\nStill, federal and local authorities have had mixed success making racketeering and conspiracy charges – the Kanye and Jay Z of anti-organized crime legislation – stick to the Hells Angels over the years. The ATF’s much-trumpeted, multi-million-dollar Operation Black Biscuit – touted as “the most successful undercover operation ever pulled against an outlaw motorcycle club” when it culminated in 2003 – failed to yield any convictions for the 16 Arizona-based bikers charged with racketeering or running a criminal enterprise.\n\nBlack Biscuit initiated the demise of the Skull Valley chapter and temporarily hobbled the statewide club by jailing several of its top personnel, but in its aftermath, the Arizona Hells Angels were indistinguishable from their old selves: They were still the unquestioned lords of Arizona’s outlaw bikerdom.\n\nIt was hardly routine for the Hells Angels and the Vagos to have more than two dozen combined bikers in Chino Valley on the same weekend. The town was no longer an HA chapter seat, and only one of the Angels charged in the shootout was a Chino Valley resident. Meanwhile, the Vagos were believed to have only a scattered presence in Yavapai County; most of the suspects detained after the shooting were visiting from cities such as Kingman, Phoenix and Bullhead City.\n\nSo what brought them to Chino Valley if not to fight? Both clubs have credible alibis. For the Vagos, it was a bring-your-kids weekend barbecue at the Diecks’ place – a common enough pastime in the biker world. Meanwhile, the Angels were in town to visit Teddy Toth, the ailing ex-president of the Skull Valley Chapter. Sent to prison following the ATF’s Black Biscuit operation several years prior, Toth had gotten “off paper,” or released from parole, just that weekend. After years of state-mandated biker solitude, he was finally allowed to openly fraternize with his HA confreres.\n\nIt was undoubtedly a case of wrong-place, wrong-time, but to understand the tensions that led to the shootout, one must first examine the unique history of the Arizona Hells Angels and the band of Harley-riding, hirsute rogues that preceded them – a club called the Dirty Dozen, which ruled the state’s biker community from its inception in the late ’60s to its merger with the Hells Angels in 1997.\n\nNamed after the iconic World War II action movie starring Lee Marvin and Jim Brown, the Dirty Dozen – who numbered about 120 during their peak – offer a useful compare-and-contrast study with the current Hells Angels. The Cliff Notes version: The Dirty Dozen were several degrees more ruthless and aggressive, according to longtime member Robert “Chico” Mora, who “patched-over” to the Hells Angels during the aforementioned merger.\n\n“Oh, we were obnoxious assholes,” Mora cheerfully confides when quizzed about the Dirty Dozen. “We did terrible, depraved stuff all the time. Don’t get me wrong: The Hells Angels are every bit as tough. But it was a different culture back then. Much wilder.”\n\nA massive, wise-cracking hulk of a man with the letters\n\nA-R-I-Z-O-N-A tattooed across his belly and a scraggly mane of gray-streaked hair, Mora exudes Falstaffian delight as he recounts his days as a hell-raising, debauchery-crazed Dozen regular. There were orgies, brawls, all-night block parties and balls-out Harley sprints across greater Phoenix.\n\nIt was a fast, dangerous life. He points to the extensive scarring on his lower legs where surgeons stitched together the two limbs, including the blood vessels underneath, in a successful gambit to save a foot severed in a bike wreck. He was hospitalized for several weeks until the foot healed and doctors de-conjoined him.\n\n\n\n\n\n\n\nPhotos – From left: Also known as Green Nation, the Vagos motorcycle club was founded in Corona, California, in 1965. According to the DOJ, the club boasts approximately 600 members spanning 24 chapters in the U.S., and 10 more chapters in Mexico. In Arizona, they are concentrated in Mohave County. • Founded in Montebello, California in 1969 by Hispanic Vietnam War veterans, the Mongols M.C. memorably brawled with the Hells Angels in the deadly Laughlin, Nevada, riot of 2002. The Latino-majority club is believed to have a tertiary presence in Arizona, including a Mesa chapter that hosts its own Facebook page.\n\n\n\nDirty Dozen lore is full of wild tales. Old timers recall a weekend evening – sometime in the mid-’80s – when a pair of Dozen bikers cut the fuel lines on a row of rival motorcycles outside a bar in Mesa, creating a sort of daisy chain of flammable spillage. They then lit a makeshift fuse, inducing a spectacular inferno that they admired while munching on Jumbo Jacks down the street.\n\nSo the Dozen were hard-core. They were also intensely territorial, boldly confronting and intimidating any rival club that failed to recognize their primacy in Arizona. In the early 1980s, Mora himself served just more than three years in Florence State Prison for the shooting deaths of two members of Bad Company – an outlaw bike gang based in New Mexico that was attempting to set up a chapter in the old mining town of Globe. Mora – who was president of the Dirty Dozen’s Globe chapter at the time – claims that the Bad Company bikers were harassing members of the community and “acting like jerks.”\n\nMora summoned the two bikers to a popular roadhouse in Globe, where he laid out his ultimatum. “I told them to behave themselves,” Mora recalls. “And respect my authority. Then one of them pulled a gun on me. So I defended myself.”\n\nThe Vagos were another out-of-state club that attempted to plant a flag in Arizona during the Dirty Dozen reign, according to Trethewy. In 1990, the Vagos even managed to start a Phoenix chapter in the heart of Dirty Dozen territory, led by a biker named Don “Arizona Don” Halterman.\n\nThe honeymoon period was brief.\n\n“From what we know, that was the first time [the Dirty Dozen] and the Vagos squared off,” Trethewy says. “There was some shooting and pipe-bombs. Somebody put a pipe-bomb on Arizona Don’s front door. That was it. There was too much heat on them. The Vagos left Phoenix.”\n\nFor the next seven or eight years, the Dozen ran a tight ship in Arizona. They also won the respect of seminal Hells Angels organizer Sonny Barger, who served out a four-year federal conspiracy conviction in Arizona from 1988 to 1992. By all accounts, Barger – who later moved to Cave Creek – took a serious shine to Arizona during his incarceration, which could only have facilitated matters when the Dirty Dozen weighed the Angels’ offer of a friendly merger. In effect, the Dirty Dozen would be trading in their double-six dice emblem for the Angels’ trademarked death-head skull patch.\n\nIn 1997, members of the two clubs convened in the HA clubhouse in Oakland – a converted Arthur Murray dance studio, of all things – and the patch-over was consecrated. The benefits for both clubs were manifest. On one hand, the Hells Angels acquired a big, geographically critical state with lots of wide-open roads and no serious rivals, thanks to the Dozen’s cleansing efforts. Conversely, the former Dirty Dozen bikers scored instant prestige as members of the most powerful and recognizable brand in the biker world – the death-head patch promised them “a bigger playground,” in the words of Mora.\n\nIt also meant embracing the Hells Angels’ more image-savvy and disciplined ethos. According to Mora, the stereotype of the meth-slinging, brawl-seeking, recklessly hostile Hells Angel is a vestige of wilder times – something that continues to exist on the pages of Hunter S. Thompson’s Hell’s Angels: The Strange and Terrible Saga of the Outlaw Motorcycle Gangs, but not in real life. “I have a three-part gospel for staying the fuck out of prison,” Mora explains. “One: Don’t commit senseless, needless violence against the citizenry. Two: Don’t sling dope. And three: Don’t print the government’s money. Follow those rules, and the cops will more or less leave you alone.”\n\nIndeed, there’s an adage in the biker world that the safest neighborhood in any city is the one with a Hells Angels clubhouse. After all, the Angels don’t tolerate any petty crime in their immediate sphere and generally endeavor to avoid scrutiny by the authorities.\n\nThe Hells Angels-as-neighborhood-watchdog theory may very well have stock – unless they happen to be having a shootout with the Vagos.\n\nThe Chino Valley shootout was not the first time the Hells Angels and Vagos warred on Arizona soil. On June 11, 2009, five members of the Arizona Nomads – a roving Hells Angels chapter with no official clubhouse – allegedly mixed it up with a pair of Vagos at Lazy Harry’s Sunshine Saloon in Bullhead City near the Colorado River. Two members of a Hells Angels affiliate club, the Desert Road Riders, were also implicated. It was described by DPS as the biggest “in a series of violent assaults inside several bars” in Bullhead City. Five months later, all seven HA-affiliated combatants were arrested for felony rioting.\n\nThe spike in biker hostilities in Bullhead City initially puzzled authorities, because members of the Vagos’ Tri-State chapter – based in the string of river towns where Arizona, California and Nevada meet – had been operating in northwest Arizona since at least 2000 with relatively little incident, according to Sgt. Ernie Severson of GIITEM. “I ran the unit for Bullhead City and Lake Havasu City, and the two gangs mostly kept to themselves,” Severson says. “The Angels let the Vagos have Havasu. They didn’t really contest it.”\n\nUltimately, the uneasy peace collapsed. And the reason? Severson believes it was a matter of patches.\n\nA quick primer on outlaw biker attire: The vests, or “cuts,” favored by most rank-and-file bikers reveal a deep cache of information about the wearer, via the patches affixed to the front and back of the garment. The front patches denote personal details like rank, exploits and chapter affiliation. The back patches, or “rockers,” cover the more organizational stuff. The top rocker indicates the name of the club. The middle patch is the club’s emblem: In the case of the Hells Angels, the famed, winged death-head; in the case of the Vagos, a muscle-bound caricature of the Norse god of mischief, Loki, set against a green field.\n\nThe bottom rocker is particularly critical for American outlaw bikers, and the key to the Bullhead City incidents, in Severson’s opinion: It identifies the wearer’s state of residence. But the “Arizona” rockers on the bottom of the cuts worn by the Arizona Hells Angels are more than simple identifiers – they’re also an expression of status; they confer power and authority, and wearing them is historically a privilege that the most dominant outlaw motorcycle clubs reserve for themselves.\n\nMora, the one-time Dirty Dozen capo and current Arizona Hells Angel, says that he and his Dirty Dozen comrades would scour the streets and bars of Tucson in the early 1990s, looking for rival bike clubs sporting the “Arizona” rocker. Once they made contact, Mora would issue an ultimatum: “I told them to lose the rocker. If they refused, we’d cut it off their backs. If they obeyed, no problem. Let’s have a beer.”\n\nFor years, the Vagos in Bullhead City and other parts of Mohave County wore “California” rockers. That changed about two years ago, Severson says. “Then they started sporting Arizona rockers, and that’s when the problems started. That’s more than likely what precipitated the fight in Bullhead City.” Concurrently, the number of Vagos operating in Arizona climbed sharply. Not just in Bullhead City and Mohave County, where Severson currently counts “15 or more.” Also in Yavapai County. And in Phoenix.\n\nIt was clear to law enforcement that the Vagos – a rising MC with designs on Mexico and the Southwest – were making a push into Arizona. It seems likely that the Hells Angels noticed, too.\n\nPage Break\n\nThe issue of Arizona rockers was potentially a contributing factor in the Chino Valley gun battle. So was the curious proximity of the Vagos house to Toth’s two-story stucco dwelling. Outlaw bikers are sensitive to affronts. The Hells Angels could not have been pleased by the symbolic violation of their turf. Asked to estimate the odds that a full-patch Vagos biker would move within three doorsteps of the old Skull Valley clubhouse and not know it, one Hells Angels says, “No chance at all.”\n\nThe upshot: Neither side came to Chino Valley on August 21 to brawl, necessarily. But a brawl – somewhere, sometime – was all but inevitable.\n\nAccording to documents released by the Yavapai County Attorney’s Office in September 2010, Vagos Tri-State vice president Aurelio Figueroa – who witnessed the shootout – had at least some inkling of the trouble to come. After the battle, he told a Sheriff’s Office detective that he asked a group of Vagos from the Phoenix area not to attend the Chino Valley get-together, presumably to avoid a run-in with the Hells Angels, but that five of them came anyway.\n\nOn Friday night, the Vagos posted security details at the Diecks’ house. After the shootout, authorities would confiscate a tidy arsenal of weaponry at the residence, including 10 handguns, one Norinco SKS rifle, two fighting knives and numerous boxes of ammunition.\n\nMoreover, Diecks told authorities that for several months leading up to the shooting, a Hells Angels prospect would ride past his house and “[point] his fingers at him simulating a weapon,” according to a news story that ran in the Chino Valley Review on September 15, 2010.\n\nThe volatile air-mixture of suspicion and tension almost certainly informed an incident Saturday morning when a group of three Hells Angels prospects – later identified as Scott, Bruce Schweigert and Robert Kittredge – crossed paths at a nearby Circle K with a pair of Vagos associates named Alfred Azevedo and Clay Messina. Yavapai County Superior Court documents show that Azevedo lived in Kingman at the time and was a “hang-around” – that is, a Vagos gadfly with aspirations of becoming a prospect.\n\nAzevedo – whose version of the events figured prominently in a Sheriff’s report – told investigators that one of the Hells Angels “approached him and asked if he was a Vagos.” That was the extent of the encounter – a surveillance video provided to authorities confirms that no physical confrontation occurred – but it evidently rattled Azevedo and Messina to the extent that a phone call was made to the Diecks residence alerting the Vagos to the effect that “the Hells Angels were trying to get them,” according to the report.\n\nEvidently, the summons was taken to heart. Shortly after the phone call, a convoy of Vagos bikers left the Diecks residence and scrambled eastbound down Road 3 in Chino Valley toward the Circle K. Finding no Hells Angels, they continued westbound up Road 4, making a wide loop that would take them past the Hells Angels residence on their way back to the Vagos house.\n\nAnd that’s when MC mayhem broke loose. According to a report filed by Detective Zavos, a Vagos biker named Bob Blankenship – who held the rank of Sergeant-of-Arms for the Tri-State Vagos – was shot as he executed a U-turn in front of the old Hells Angels clubhouse. The Vagos returned fire, wounding Hells Angel biker Kevin Christensen in the abdomen. (None of the five injuries from the battle was life-threatening.) The outnumbered Angels retreated into the house, where the firefight continued for approximately 10 minutes.\n\nThe Yavapai County Attorney’s case against the Hell Angels chugged along in appeals court until May, when a sensational bit of information emerged about one of the key witnesses in the shootout. Alfred Azevedo, the Vagos hang-around who summoned the cavalry after the Circle K incident, was at the time also a confidential informant for GIITEM. And a scorned wannabe Hells Angel to boot.\n\nAccording to documents filed in Yavapai County Superior Court, Kingman-based GIITEM Detective John Morris started using Azevedo to spy on the Vagos in May 2010. As a “paid reliable informant,” Azevedo had previously worked for law enforcement entities and was known to provide sound information about underworld dealings.\n\nPage Break\n\n“[Azevedo] was hanging out at Bike Night quite a bit, which was a Wednesday night event in Kingman,” Morris told defense attorneys in an hour-long interview. “And he ended up running into one of the Vagos members that lived in Kingman, went to the guy’s shop the next day, and within, I don’t know, an hour… was invited to the international Vagos run in Parker. So that was pretty much how easy it was.” As Azevedo’s control officer, Morris was responsible for monitoring his activity and debriefing him. Consequently, the lawman was alarmed when word trickled up to Kingman about the gun battle in Chino Valley.\n\n“I was worried about [Azevedo] being involved in the shooting,” Morris recalls. Upon hearing the news, he jumped in his car and high-tailed it to the scene of the crime, alerting the lead detective, Zavos, that he had an informant embedded in the Vagos.\n\nPresumably to protect Azevedo’s confidential status, Zavos never disclosed the nature of the hang-around’s involvement with GIITEM during the initial grand jury evidentiary hearing in November. The facts only came to light in May after a court-ordered sheriff’s office report. By that time, Azevedo was no longer useful as an informant, having helped Morris execute a Vagos-related fraud case in Kingman. In other words, his cover was blown. “[The fraud case] pretty much let the cat out of the bag,” Morris says.\n\nCiting ethical rules, both Yavapai County Attorney Dana Owens and defense counsel Gaxiola declined to comment on the Azevedo matter, but the presence of a GIITEM asset in the case does invite some second-guessing. In the wake of the shooting, law enforcement obviously sought to preserve their Vagos informant. Might that have skewed the case against the Hells Angels? And what about Azevedo’s motives? According to Morris, Azevedo tried to “hang out with the Hells Angels” in Kingman before courting the Vagos, but they “kept kind of just shunning him.” Was he bitter over the slight? Could he have lit the powder keg on Yuma Drive by misrepresenting the Circle K encounter?\n\nAs reflected in their police interviews, the Vagos maintain that the shootout was a premeditated event on the part of the Hells Angels. Justin Kaufman, a Vagos hang-around from Mesa who was driving his black Range Rover near the crime scene, told Sheriff’s Office investigators that the Angels had been planning the attack “for a while.”\n\nAll factors for a jury to weigh in trial, if a trial ever happens. As this issue went to press, the case was still mired in appeal and pre-trial litigation. A joint-motion to dismiss the charges against the Hells Angels was pending.\n\nWhatever the outcome in the Chino Valley case, Arizona will be left with the same uncertain outlaw-biker predicament: One large, entrenched biker brand, very well known to the public, and a smaller but fast-growing challenger, significantly less well known. And neither looks to back down.\n\n“We’ve seen a definite upswing in biker numbers for all clubs,” Sgt. Robbie Milam of GIITEM’s Phoenix office says, citing the popularity of the biker-themed cable show The Sons of Anarchy as one explanation. “The Vagos got a foothold in Mohave County and now they’re in Phoenix, and that indicates they’re trying to make inroads.”\n\nHow will the Hells Angels respond? What will happen the next time a group of guys wearing the death-head patch catches sight of a sea of muscular-Loki-green, or vice versa? With Valley-area chapters and clubhouses in Phoenix, Mesa and Cave Creek, the Angels maintain they’re not the belligerent party. Officially, they say the Arizona rocker is a moot issue. “We don’t enforce anything like that,” Koepke says. “That’s the old mentality. People are free to wear whatever patch they like.”\n\nLaw enforcement confirms that the Hells Angels appear to have loosened up their bottom rocker policy. Milam reports that members of the Mongols Motorcycle Club – another traditional Hells Angels enemy – have been sighted wearing the Arizona rocker in Mesa, and that two Hells Angels-affiliated clubs, the Hooligans and the Sons of Hell, recently began wearing the Arizona rocker with the Hells Angels’ blessing.\n\n“That occurred in April, so we’ll see if that’s a change in philosophy on the Angels’ part.” Milam says.\n\nStill, Milam – whose declined to estimate the number of Vagos operating in greater Phoenix, other than to say “significant” – predicts that Chino Valley is just the tip of the iceberg: “There’s still gonna be a turf battle regardless of who wears what.”\n\nFor the Arizona Hells Angels, the changing outlaw-biker landscape presents an age-old dilemma for powerful men and alpha-dominant organizations, of dynasties stretching from ancient Rome to Michael Jordan’s Chicago Bulls – i.e., the challenge of holding the center. Of staying on top.\n\nHow the Hells Angels choose to handle the dilemma may well determine how close the turf battle comes to the Valley’s doorstep. “It’s a tough predicament,” one longtime member concedes. “We’re the only ones with anything to lose in this whole shebang.”"}, {"url": "https://themobmuseum.org/blog/three-charged-in-hells-angels-shooting-of-rival-vagos-riders-during-memorial-day-weekend/", "page_content": "Richard Devries, Russell Smith and Stephen Alo were arrested in the shooting of six members of the Vagos motorcycle gang in Henderson, Nevada. Devries is president of the Las Vegas chapter of the Hells Angels.\n\nIt was supposed to be a peaceful motorcycle ride near Hoover Dam in honor of America’s war dead, followed by a trip to a veterans cemetery in Boulder City, Nevada.\n\nMembers of the Vagos, an outlaw motorcycle gang with a history of violence, were clustered together driving on U.S. 95 in the Las Vegas suburb of Henderson on Sunday, May 29, when three men affiliated with the rival, equally violent Hells Angels gang followed them on their bikes and then fired shots, injuring six Vagos.\n\nThe attack happened after three men, a mix of current and prospective Hells Angels, trailed the Vagos who were riding as part of the Flags Over Dam motorcycle event that morning outside Hoover Dam and on to the Veterans Memorial Cemetery, where people gathered in tribute to fallen members of the U.S. military during the Memorial Day weekend.\n\nAuthorities have not yet released, or determined, what triggered the one-sided shooting. The Vagos apparently did not fire any shots before or during the assault.\n\nThree suspects, Richard Devries, 66, Stephen Alo, 46, and Russell Smith, 26, were arrested and charged with attempted murder, murder conspiracy, battery with a deadly weapon and discharging a firearm into a vehicle.\n\nDevries is president of the Las Vegas chapter of the Hells Angels.\n\nThe exterior of the Hells Angels clubhouse in Las Vegas, near Bonanza Road and 15th Street. Courtesy of Flickr.\n\nHELLS ANGELS MAY HAVE TAKEN THE OPPORTUNITY TO STRIKE\n\nSteve Cook, a motorcycle gang expert and executive director of the Midwest Outlaw Motorcycle Gang Investigators Association, based in Kansas City, Missouri, said the Hells Angels and Vagos have had a longstanding violent feud and the Angels in this case may have decided, “we have an opportunity here, let’s take it.”\n\nSteve Cook, an expert on outlaw motorcycle gangs, suspects the Vagos will retaliate for the shooting of six of its members outside Las Vegas.\n\n“The Angels are the Rolls-Royce of outlaw motorcycle gangs,” Cook said. “Everyone wants to be them, but everyone hates them. They’re wealthy, they have legend status with the public.”\n\nLately, Cook said, the well-known biker gang has had to battle not only the Vagos, but other top motorcycle gangs such as the Mongols and Pagans “on both coasts” and the Outlaws, who “are a big problem for them.”\n\n“The Angels are getting pushed around a lot, especially out in Nevada,” he said. “They are basically fighting on a number of fronts. They are fighting a majority of the biker gangs in the country. The other gangs look at them, and say, ‘Yeah, let’s go after them.’”\n\nIn this case, Cook said the group of Angels may have not expected to see the Vagos on Memorial Day weekend, but “they operate in [a] thought process that can be violent. …You’ve also got to be in an offensive position, especially in a competitive place like Las Vegas.”\n\nThe casual use of methamphetamine, a common drug among biker gangs, may also have affected their judgment, Cook said.\n\nA possible rationalization in their minds to go through with the violent altercation is the belief that witnesses might be too squeamish to testify and “the prosecution’s case will collapse anyway,” he said.\n\nPROSPECTIVE MEMBERS RODE WITH HELLS ANGELS\n\nAccording to Henderson Police, the morning of the shooting, five prospects seeking admission as members to the Hells Angels pursued the group of Vagos to the veterans cemetery in Boulder City. The gang candidates began to cause problems, unspecified by police, for the Vagos inside the confines of the cemetery.\n\nThe prospects then motored out of the cemetery 15 to 20 minutes before the Vagos left to drive toward Henderson. The Vagos cruised side by side northbound in the first lane of U.S. 95 near Wagon Wheel Drive. After the Vagos passed Wagon Wheel, a number of Hells Angels members and prospects were seen approaching in lanes three and two as the Vagos riders remained in lane one.\n\nThe Hells Angels members and prospects drove up to the Vagos and started to kick them, attempting to knock them down onto the freeway. Then one of the Hells Angels allegedly stood up on his cycle, pulled a gun and opened fire on one of the Vagos riders, later identified as Alejandro Castillo. After firing, the Hells Angels gunman drove off northbound on U.S. 95. Nevada State Police received a call about the shooting at 11:50 a.m.\n\nOther Vagos injured in the gunplay included Ricardo Velasquez, Carie Chapin, Michael Stasiewicz, Michael Lempart and Chad Merrill. All were transported to Sunrise Hospital and Medical Center in Las Vegas. In their condition, the victims were only able to provide limited information to detectives.\n\nPolice officers picked up a number of empty shell casings from the northbound roadway, between the College Drive and Horizon Drive exit ramps.\n\nJust before the gunfire, an anonymous witness heading north on U.S. 95 phoned 911 to report seeing a number of Hells Angels parked on the side of the freeway looking as if they were waiting.\n\nThe witness took a video showing a fully patched Hells Angels member and three gang prospects riding alongside the Vagos members. One of the prospects, on a black motorcycle, wore only the bottom half of a gang logo patch, with red lining at the bottom of the vest, and tan pants and red shoes. The rider’s arms were covered in tattoos and he was holding his left arm down with an “item” in his hand, police reported. The rider passed the witness, rode toward an additional motorcyclist and then the witness heard the gunshots.\n\nBoulder City Police soon learned that several Hells Angels had been inside the Coffee Cup café in Boulder City before the shooting. A Las Vegas Metropolitan Police intelligence detective and a sergeant arrived at the café and viewed surveillance footage showing four Hells Angels associates there about 9 a.m.\n\nMetro intelligence officers recognized one of them as Richard “Rizzo” Devries, Las Vegas chapter president. With Devries was Stephen Alo, a prospective member who was wearing a black vest with a red lining on the bottom and no sleeves, plus tan pants and red shoes and his arms fully tattooed. Also present were two other prospects, Aaron Chun, wearing a black vest and dark pants, and Russell Smith, who had on a black vest with black sleeves, black pants and white Nike shoes.\n\nFrom the surveillance video at the café and the witness’s video from the freeway, police identified Smith as the male with the tattoos on both arms, wearing a black vest, tan pants, red shoes and a white helmet who held something in his left arm. Metro intelligence detectives recognized the Hells Angels man with the fully patched vest, riding a black motorcycle, as Devries.\n\nThe detectives viewing Boulder City Police dashboard video saw some suspected Hells Angels riding westbound on U.S. 93 leaving Boulder City before the call about the shooting. A detective identified Devries, Alo and Smith on the video. Devries rode first, followed by Smith and Alo riding together.\n\nLater that evening, Metro detectives wrote search warrants for Devries, Alo and Smith and confirmed their home addresses. Henderson and Las Vegas police watched Alo leave his home.\n\nLas Vegas intelligence detectives traced Alo’s mobile phone to a cell signal site in the area of U.S. 95 and College Drive near the time of the gunshots. Cell sites also placed Smith’s mobile phone in the area of U.S. 95 and the I-215 freeway north of the shooting location, just after the shots were fired, and earlier at the Coffee Cup café.\n\nHenderson Police arrested and booked the three men early Monday on six counts each of alleged attempted murder, conspiracy to commit murder, battery with a deadly weapon and discharge of a firearm into a vehicle. On Tuesday, they were formally charged. Police added gang enhancements against Devries, which could mean more years in prison if he is found guilty.\n\nThe prospects riding with Devries likely were those asked to join the Angels gang and served a preliminary “hang around” designation – fulfilling mundane chores such as guarding bikes outside a bar – for about six months, and then might receive a rectangular bottom partial “rocker” Angels patch to wear on their riding vest, Cook said.\n\nAfter the prospect serves about a year with the gang, the Angels chapter decides if the person has the qualities to become a member, and takes a vote on him joining. If the person wins, the gang awards him the top rocket vest patch, reading “Hells Angels,” the gang’s signature death’s head symbol in the center and the name of their state on the bottom, and perhaps a rocket patch of the side naming their city of membership.\n\nCook said he believes “there will be retaliation by the Vagos” against the Hells Angels over the Henderson shooting.\n\nHUNDREDS OF OUTLAW MOTORCYCLE GANGS\n\nThe U.S. Justice Department as of 2021 logged more than 300 outlaw motorcycle gangs (OMG) across the county, “ranging in size from single chapters with five or six members to hundreds of chapters with thousands of members worldwide,” according to the agency’s website.\n\nThe leading gangs mentioned by the department include the Hells Angels, Vagos, Mongols, Bandidos, Outlaws, Sons of Silence, Black Pistons and Pagans.\n\nMost of the criminal acts committed by OMGs include drug smuggling, in particular across the U.S.-Mexico border, in conspiracies with major international drug trafficking organizations.\n\nThe Hells Angels, formed in San Bernardino California, in 1948, have at least 800 members in 92 chapters in 27 states, according to the Justice Department. The gang’s illegal activities include trafficking marijuana, methamphetamine, cocaine, hashish, heroin, LSD and ecstasy, and committing assaults, extortion, murders, money laundering and motorcycle theft.\n\nJustice did not mention Hells Angels chapters located outside the United States. The gang’s own website claims to have 467 chapters in 59 countries on five continents.\n\nThe Vagos outlaw motorcycle gang was founded in San Bernardino, California, in 1965.\n\nThe Vagos, started in 1965 in San Bernardino, maintains about 300 members in California, Hawaii, Nevada, Oregon and Mexico, the Justice Department estimated. The gang is known to produce and distribute methamphetamine, sell illegal marijuana and engage in assaults, extortion, insurance fraud, money laundering, vehicle theft, witness intimidation and weapons violations.\n\nSeveral decades ago, the American Motorcyclist Association asserted that less than one percent of motorcyclists belong to outlaw motorcycle gangs. The outlaw clubs subsequently embraced this phrase, describing themselves as “one percenters.”\n\nThe Hells Angels and Vagos have participated in many shootings with opposing gangs over the years.\n\nIn September 2011, Vagos member Ernesto Gonzalez shot Jeffrey Pettigrew, president of the Hells Angels chapter in San Jose, California, four times in the back during a brawl on a dance floor at John Ascuaga’s Nugget hotel-casino in Sparks, Nevada. The next day in Sparks, two Vagos members were shot and wounded.\n\nIn a major legal case against the Vagos, including the 2011 Nugget casino killing, federal prosecutors in Las Vegas charged eight members with violations under the Racketeer Influenced and Corrupt Organizations (RICO) Act, including murder, drug dealing, robbery, extortion and kidnapping. The crimes were allegedly committed in California, Nevada and four other states going back to 2005. However, the case foundered and a judge dismissed the charges in 2020.\n\nIn 2002, Laughlin, Nevada, was the setting for a biker gang shootout involving the Hells Angels and Mongols. Two Hells Angels were shot to death, and one Mongol was stabbed to death. Six Hells Angels and six Mongols went to prison stemming from the confrontation."}]}