{"Vagos Motorcycle Club have a rivalry with the Hells Angels Motorcycle Club.": [{"url": "https://www.history.co.uk/shows/outlaw-chronicles-hells-angels/articles/history-of-the-vagos-mc", "page_content": "History of the Vagos MC\n\nThe year is 1965. USA are in the middle of the Vietnam War, Martin Luther King has recently marched from Selma to Montgomery and Roger Miller’s ‘King of the Road’ is number one. Thirteen bikers meet on the corner of Eighth and Davidson in San Bernardino, California to form the Vagos Motorcycle Club, beginning a history that would involve drug trafficking, clashes with the police and a violent rivalry with the Hells Angels.\n\nThe elected president was Rudy Esparza, nicknamed Puro, who led the new club in selecting their name. Other names considered included Coffin Dogers MC and Satan’s Saints MC, but Vagos MC, Spanish for vagabond, was chosen. Their new patch, a red devil on a green background, was inspired by an image of a devil in LIFE magazine entitled ‘Return from hell.’\n\nMore Outlaw Motorcycle Gangs (OMGs) were established in the 1960s than in any other decade. The outlaw status is given to groups who are not sanctioned by the American Motorcyclists Association (AMA). They are also known as 1%ers, a term which originated after the Hollister biker riot in 1947 when the AMA allegedly claimed the 99% of bikers were law abiding citizens, although the AMA have no record of issuing this as an official or public statement.\n\nBikers would often move between clubs or find their club being absorbed into a larger club. Puro had previously been with the Psychos MC and others joined from clubs including El Diablo MC. The question of whether the Vagos would absorb or be absorbed was very quickly answered as more Chapters sprang up across California. In 2014 the FBI listed the Vagos as one of the largest Outlaw Motorcycle Groups in Western America with 600 members in 24 Chapters throughout America, as well as Chapters in Canada, Mexico and Europe.\n\nThe Mafia on wheels?\n\nDescribed by Vagos infiltrator Charles Falco as “the mafia on wheels” the Vagos have more than earned their 1%er patch. Drug related arrests have been made throughout their colourful history. In 1987 the head of the South Bay Chapter and President of the Desert Hot Springs Chapter along with three others all pleaded guilty to conspiracy to distribute methamphetamines. Over 40 pounds of cocaine and eight pounds of methamphetamines (and a rocket launcher!) were seized in a 2011 raid. And in 2014 four Vagos members were arrested by the FBI for selling methamphetamines.\n\nAlongside money laundering and weapons trafficking, the Vagos are also known for their general violence, especially with rival OMGs. As the Vagos attempted to expand their territory tension erupted between them and other OMGs most notably the Hells Angels. In 2001 a bloody melee broke out between the Vagos and the Angels in the Californian city of Costa Mesa. And in 2010 an argument over which gang got to hang out in the Starbucks in Santa Cruz escalated. A brawl outside the coffee shop led to a gunfight in Chino Valley, several drive by shootings and a bitter feud.\n\nThe authorities have successfully infiltrated the Vagos a number of times. George Rowe, a street criminal whose friend had disappeared after an incident with the Vagos, volunteered to go undercover as part of Operation 22 in 2003. His evidence gathered over 3 years resulted in 42 arrests and convictions for crimes as serious as murder. Whilst Charles Falco worked his way up to number two of the Victorville Chapter and provided the ATF (Bureau of Alcohol, Tobacco and Firearms) gathering enough information to make 62 arrests for crimes including assault and murder. Fun fact, both Rowe and Falco have written books about their experiences and actually appear as characters in each other’s books.\n\nHowever the Vagos have their own weapon in their ongoing battle with the police- the lawsuit. In 1990 the Vagos sued the police and received a $2 million settlement claiming they were targets of massive police abuse in the early eighties. And in 2010 when the Vagos were blamed for a spree of homemade booby traps that targeted the police, they once again sued and received a settlement that included a public statement and the return of property seized the previous year.\n\n1%ers\n\nAs with all criminal groups the Vagos don’t advertise their more notorious crimes. Their PR website vagosmcworld.com, presents them as a club rather than a gang. Their consistent response to arrests is that it is not all of their members committing crimes, but a few bad apples. So, organised crime syndicate or a club where just 1% of the 1%ers are giving them a bad name…?"}, {"url": "https://apnews.com/article/hells-angels-vagos-shooting-vegas-motorcycles-8749ff62558bc897bdd75661688eb6c7", "page_content": "FILE - Richard Devries, 66, makes his initial court appearances in Henderson Justice Court Thursday, June 2, 2022, in Henderson, Nev. Seven alleged Hells Angels members won’t face racketeering or gang charges in a Las Vegas-area freeway shooting that authorities said injured seven people, including six rival Vagos motorcycle gang members, almost a year ago, a judge decided Monday, May 1, 2023. The judge in Las Vegas also reduced from 25 to five the number of shooting counts against defendants including the Hells Angels Las Vegas chapter president Devries. (K.M. Cannon/Las Vegas Review-Journal via AP, File)\n\nFILE - Richard Devries, 66, makes his initial court appearances in Henderson Justice Court Thursday, June 2, 2022, in Henderson, Nev. Seven alleged Hells Angels members won’t face racketeering or gang charges in a Las Vegas-area freeway shooting that authorities said injured seven people, including six rival Vagos motorcycle gang members, almost a year ago, a judge decided Monday, May 1, 2023. The judge in Las Vegas also reduced from 25 to five the number of shooting counts against defendants including the Hells Angels Las Vegas chapter president Devries. (K.M. Cannon/Las Vegas Review-Journal via AP, File)\n\nLAS VEGAS (AP) — Seven alleged Hells Angels members won’t face racketeering or gang charges in a Las Vegas-area freeway shooting that authorities said injured rival Vagos motorcycle gang members almost a year ago, a judge decided Monday.\n\nClark County District Court Judge Tierra Jones also reduced from 25 to five the number of shooting counts in the case against defendants, including the Hells Angels Las Vegas chapter president, Richard Devries.\n\n“The court finds that the ... indictment does not specify which of the defendants engaged in which type of criminal activities, and further does not include the specificity of the racketeering crimes,” Jones wrote. Her ruling followed a March 31 hearing with attorneys and defendants in the case.\n\nAttorney Richard Schonfeld, representing Devries, said Monday he was pleased the judge “granted important aspects of my motion.” He had argued that the indictment was too broad and should be dismissed or revised.\n\nProsecutors Michael Dickerson and Michael Allmon said they were looking at the ruling and declined immediate comment. They could appeal Jones’ decision to the Nevada Supreme Court.\n\nAttorneys for the other defendants did not immediately respond to emails seeking comment.\n\nDevries and the men identified as Hells Angels members or associates — Russell Smith, Stephen Alo, Cameron Treich, Taylor Rodriguez, Aaron Chun and Rayann Mollasgo — still face prosecution on charges including attempted murder, conspiracy to commit murder, battery and assault with weapons. Each has pleaded not guilty to all charges. Each could face up to 40 years in prison if convicted of attempted murder with a weapon.\n\nThe judge instructed prosecutors to revise the indictment. A hearing in the case remained scheduled Wednesday.\n\nPolice said seven people were treated at hospitals for wounds or injuries following the gunfire that erupted among motorcycle riders on Interstate 11 in Henderson after a Memorial Day weekend ceremony at a veterans cemetery in Boulder City.\n\nSchonfeld argued March 31 that Mollasgo, a Hells Angels associate but not a full member, was treated for a gunshot wound, and that police at the scene examined handguns that some of the alleged Vagos had with them, but returned them.\n\n“The grand jury doesn’t know that a Hells Angels-affiliated individual (was) shot and that four Vagos members had firearms concealed on their person,” Schonfeld said. He argued that prosecutors failed to present ”exculpatory evidence” that might cast doubt on the charges they were seeking.\n\nFour motorcycles had gunshot damage, according to evidence, and police found 25 bullet casings on the freeway near where the gunfire took place. Schonfeld told the judge the indictment did not specify what person was alleged to have fired which shots, or which bullets hit which motorcycle.\n\nMollasgo’s lawyer, Augustus Claus, told Jones that his client had become a member of the Hells Angels chapter less than a week before the shooting, but he was accused of a conspiracy with other members dating to 2019.\n\nSchonfeld and Tom Pitaro, attorney representing defendants Russell Smith and Stephen Alo, told the judge that prosecutors never presented evidence that their clients had any intent or agreement to commit a crime.\n\n“Riding (motorcycles) in a group does not show a conspiracy to commit a violent act of shooting (or) attempted murder,” Pitaro said."}, {"url": "https://www.usnews.com/news/us/articles/2022-05-31/police-report-describes-vagos-bikers-ambush-by-hells-angels", "page_content": "By KEN RITTER, Associated Press\n\nLAS VEGAS (AP) — A Memorial Day weekend shooting on a Las Vegas-area freeway was an apparent ambush by Hells Angels members on rival Vagos biker gang members returning from a veterans cemetery ride, according to a police report made public Tuesday.\n\nRichard John Devries, who police identified as the Las Vegas Hells Angels chapter president, and club recruits Russell Smith and Stephen Alo were arrested late Sunday, several hours after the shooting on U.S. 95, according to Henderson police reports.\n\nAt least six of the seven people taken to hospitals with wounds or injuries following the midday Sunday gunfire were Vagos members or affiliates, the report said. They were riding motorcycles back to Las Vegas after stops at Hoover Dam and the Southern Nevada Veterans Memorial Cemetery in Boulder City.\n\nA person whom police identified as an anonymous witness provided video showing three men wearing Hells Angels attire riding up to the Vagos group — including one who appeared to have an object in his left hand — before shots were fired.\n\nPolitical Cartoons View All 1021 Images\n\nPolice said “multiple” spent bullet casings were found strewn for more than a mile (1.6 kilometer) along the freeway.\n\nIt was not clear from the police narrative if anyone in the Vagos group fired weapons, or if all the people who were reported injured received gunshot wounds.\n\nTwo were hospitalized in critical condition, according to a police statement issued Monday that said a seventh person involved in the shooting arrived at a hospital with injuries that were not considered life-threatening.\n\nPolice on Tuesday did not provide an update of the conditions of the injured.\n\nDevries, 66; Smith, 46; and Alo, 26, remained jailed on $380,000 bail pending court appearances on multiple attempted murder, conspiracy, battery and weapon charges.\n\nJail and court records did not immediately reflect court dates or if the men had attorneys who could speak on their behalf. Several attorneys who have represented Hells Angels and Vagos members in criminal cases in Las Vegas in recent years did not immediately respond to messages from The Associated Press.\n\nThe freeway remained closed for more five hours during an investigation also involving Las Vegas and Boulder City police and the Nevada Highway Patrol, according to the Henderson police reports.\n\nPolice said video obtained Sunday morning at a coffee shop in Boulder City and later from a dashboard camera of a police vehicle on a highway in Boulder City showed Devries, Smith and Alo among “multiple members of the Hells Angels ... prior to the shooting call.”\n\nCellphone GPS location data put the three men together on U.S. 95 after the shooting, the reports said."}, {"url": "https://www.cbsnews.com/news/hells-angels-las-vegas-shooting-vagos-us-95/", "page_content": "A Memorial Day weekend shooting on a Las Vegas-area freeway was an apparent ambush by Hells Angels members on rival Vagos biker gang members returning from a veterans cemetery ride, according to a police report made public Tuesday.\n\nRichard John Devries, who police identified as the Las Vegas Hells Angels chapter president, and club recruits Russell Smith and Stephen Alo were arrested late Sunday, several hours after the shooting on U.S. 95, according to Henderson, Nevada police reports.\n\nAt least six of the seven people taken to hospitals with wounds or injuries following the midday Sunday gunfire were Vagos members or affiliates, the report said. They were riding motorcycles back to Las Vegas after stops at Hoover Dam and the Southern Nevada Veterans Memorial Cemetery in Boulder City.\n\nRichard John Devries Henderson Police Department via AP\n\nAccounts of the shooting indicate the Hells Angels pulled alongside the Vagos and started kicking, trying to knock them over, reports CBS Las Vegas affiliate KLAS-TV.\n\n\"Then one of the Hells Angels OMG riders stood up on their motorcycle and started shooting at one of the Vagos OMG riders,\" according to an arrest report.\n\nA person police identified as an anonymous witness provided video showing three men wearing Hells Angels attire riding up to the Vagos group - including one who appeared to have an object in his left hand - before shots were fired.\n\nPolice said \"multiple\" spent bullet casings were found strewn for more than a mile along the freeway.\n\nIt wasn't clear from the police narrative if anyone in the Vagos group fired weapons or if all the people who were reported sustained gunshot wounds.\n\nTwo were hospitalized in critical condition, according to a police statement issued Monday that said a seventh person involved in the shooting arrived at a hospital with injuries that weren't considered life-threatening.\n\nPolice didn't provide an update Tuesday of the conditions of the injured.\n\nDevries, 66; Smith, 46 and Alo, 26, remained jailed on $380,000 bail pending court appearances on multiple attempted murder, conspiracy, battery and weapon charges.\n\nJail and court records didn't immediately reflect court dates or if the men had attorneys who could speak on their behalf. Several attorneys who've represented Hells Angels and Vagos members in criminal cases in Las Vegas in recent years didn't immediately respond to messages from The Associated Press.\n\nThe freeway remained closed for more five hours during an investigation that also involved Las Vegas and Boulder City police and the Nevada Highway Patrol, according to the Henderson police reports.\n\nPolice said video obtained Sunday morning at a coffee shop in Boulder City and later from a dashboard camera of a police vehicle on a highway in Boulder City showed Devries, Smith and Alo among \"multiple members of the Hells Angels ... prior to the shooting call.\"\n\nCellphone GPS location data put the three men together on U.S. 95 after the shooting, the reports said."}, {"url": "https://apnews.com/article/entertainment-shootings-las-vegas-nevada-veterans-022c605450f270faf15fec267aa0e68f", "page_content": "This Henderson Detention Center combination photo, shows suspects from left, Richard John Devries, Russell Smith, center, and Stephen Alo, right, following their arrest and booking on Monday, May 30, 2022, on felony attempted murder, battery and weapon charges in a shooting on a Las Vegas-area freeway. Police say Devries is president of the Las Vegas charter of the Hells Angels motorcycle club and that Smith and Alo are associates of the motorcycle club. (Henderson Police Department via AP)\n\nThis Henderson Detention Center combination photo, shows suspects from left, Richard John Devries, Russell Smith, center, and Stephen Alo, right, following their arrest and booking on Monday, May 30, 2022, on felony attempted murder, battery and weapon charges in a shooting on a Las Vegas-area freeway. Police say Devries is president of the Las Vegas charter of the Hells Angels motorcycle club and that Smith and Alo are associates of the motorcycle club. (Henderson Police Department via AP)\n\nLAS VEGAS (AP) — A Memorial Day weekend shooting on a Las Vegas-area freeway was an apparent ambush by Hells Angels members on rival Vagos biker gang members returning from a veterans cemetery ride, according to a police report made public Tuesday.\n\nRichard John Devries, who police identified as the Las Vegas Hells Angels chapter president, and club recruits Russell Smith and Stephen Alo were arrested late Sunday, several hours after the shooting on U.S. 95, according to Henderson police reports.\n\nAt least six of the seven people taken to hospitals with wounds or injuries following the midday Sunday gunfire were Vagos members or affiliates, the report said. They were riding motorcycles back to Las Vegas after stops at Hoover Dam and the Southern Nevada Veterans Memorial Cemetery in Boulder City.\n\nA person whom police identified as an anonymous witness provided video showing three men wearing Hells Angels attire riding up to the Vagos group — including one who appeared to have an object in his left hand — before shots were fired.\n\nPolice said “multiple” spent bullet casings were found strewn for more than a mile (1.6 kilometer) along the freeway.\n\nIt was not clear from the police narrative if anyone in the Vagos group fired weapons, or if all the people who were reported injured received gunshot wounds.\n\nTwo were hospitalized in critical condition, according to a police statement issued Monday that said a seventh person involved in the shooting arrived at a hospital with injuries that were not considered life-threatening.\n\nPolice on Tuesday did not provide an update of the conditions of the injured.\n\nDevries, 66; Smith, 46; and Alo, 26, remained jailed on $380,000 bail pending court appearances on multiple attempted murder, conspiracy, battery and weapon charges.\n\nJail and court records did not immediately reflect court dates or if the men had attorneys who could speak on their behalf. Several attorneys who have represented Hells Angels and Vagos members in criminal cases in Las Vegas in recent years did not immediately respond to messages from The Associated Press.\n\nThe freeway remained closed for more five hours during an investigation also involving Las Vegas and Boulder City police and the Nevada Highway Patrol, according to the Henderson police reports.\n\nPolice said video obtained Sunday morning at a coffee shop in Boulder City and later from a dashboard camera of a police vehicle on a highway in Boulder City showed Devries, Smith and Alo among “multiple members of the Hells Angels ... prior to the shooting call.”\n\nCellphone GPS location data put the three men together on U.S. 95 after the shooting, the reports said."}, {"url": "https://www.huffpost.com/entry/hells-angels-gang-fight-w_n_1062730", "page_content": "Two people died, eight suffered gun shot wounds and dozens have been arrested in what authorities are calling \"the most severe clash\" in a decade between two California biker groups, reports Reuters -- and it all started over Starbucks coffee.\n\nOn Saturday, members of the San Jose, Calif., chapter of the motorcycle gang Hells Angels are set to attend the second funeral in as many months for a fallen member of their group. The death of Steve Tausan is the culmination of almost two years of violent tension between Hells Angeles and competing motorcycle gang The Vagos. Security is tight for Tausan's funeral, reports SF Gate, and police hope to stem the tide of growing biker violence.\n\nAdvertisement\n\nMounting tensions between the Hells Angels and Vagos motorcycle clubs erupted in January 2010, when members of each club fought each other over territory at a Starbucks cafe in Santa Cruz, Calif. Santa Cruz Deputy Police Chief Steve Clark analyzed the situation for Reuters, saying, \"It was all about who would be allowed to hang out at the Starbucks downtown... Only in Santa Cruz would you have biker wars over who's going to control pumpkin spice lattes.\" In this case, it was the Vagos who were encroaching on turf that had been considered part of Hells Angels territory.\n\nThe fight spread to other states and continued to escalate. In August 2010, 27 members of the Vagos and the Hells Angels were arrested in Arizona for taking part in a shoot out that resulted in at least five wounded victims. According to CBS News, the violent confrontation took place shortly after the Vagos moved in nearby to a house owned by the Hells Angels. At least 50 rounds of ammunition were exchanged between the two gangs during a house party, reports CBS affiliate KPHO.\n\nThe violence crossed state lines again and turned deadly in September 2011. A Hells Angels leader named Jeffrey \"Jethro\" Pettigrew, chapter president of the San Jose California Hell's Angels, was shot to death on the floor of a Nevada casino, reports the San Jose Mercury News. He and thousands of other bikers were in Sparks, Nevada for the annual \"Street Vibrations\" biker festival when a skirmish between the Hells Angels and the Vagos erupted on the floor of the John Ascuaga's Nugget Casino Resort in Sparks. In addition to Pettigrew, two Vagos members were wounded but taken to the hospital in stable condition, according to the Mercury News.\n\nThe next day, another motorcyclist was shot in the stomach by someone driving a car, reports ABC News. The second shooting prompted the city of Sparks to declare a state of emergency and cancel the remainder of the \"Street Vibrations\" festival, according to the Reno Gazette-Journal.\n\nAdvertisement\n\nThe final tragedy took place at Pettigrew's funeral on October 15, 2011, where Hells Angels biker Steve Tausan was fatally shot by a fellow member. According to Reuters, Tausan and several others confronted member Steve Ruiz because of \"his perceived failure to have protected Pettigrew during the Nugget casino brawl.\" Ruiz is believed to have shot Tausan during the conflict, and he has been evading the authorities ever since.\n\nIt is Tausan's life the Hells Angels will be remembering on Saturday -- hopefully without incident."}, {"url": "https://harleyliberty.com/2022/09/28/hells-angels-confrontation-with-vagos/", "page_content": "#HELLSANGELS #HELLSANGELSMC #VAGOS\n\nFour men have been arrested on racketeering charges in connection with a shooting between Hells Angels bikers and the rival Vagos Motorcycle Club on a Henderson highway.\n\n00:00 2017 Roadglide special featured\n\n01:28 The Ghostride\n\n03:07 Finally a conclusion to this case\n\n04:16 Clubhouse Columbus 1 deceased 3 hurt\n\n06:01 HELLS ANGELS CONFRONTATION WITH VAGOS"}, {"url": "https://www.wdbj7.com/2022/06/01/hells-angels-shoot-vagos-bikers-highway-several-injured-police-say/", "page_content": "LAS VEGAS (KVVU/Gray News) - Members of the Hells Angels motorcycle club reportedly attacked a group of bikers from a rival club over Memorial Day weekend on a highway outside of Las Vegas.\n\nAuthorities said the shooting took place on U.S. 95 in Henderson, about 25 minutes from Las Vegas, where seven people were injured, as reported by KVVU.\n\nAccording to a Henderson Police Department arrest report, Hells Angels members shot two Vagos members on the highway. Six people were transported to the hospital, with two suffering critical injuries. Another person was also self-transported with non-life-threatening injuries.\n\nHenderson police said Richard Devries, 66, Stephen Alo, 46, and Russell Smith, 26, were arrested in the shooting and have Hells Angels motorcycle club connections.\n\nPolice said Vagos members were riding the Flags Over Dam ride that day that started in Boulder City. The group was at the Veteran’s Memorial Cemetery when Hells Angels bikers were also seen.\n\nAccording to the police report, five bikers from the Hells Angels drove through the cemetery and began to cause problems.\n\nLater, the Vagos riders were reportedly traveling on the highway when multiple Hells Angels members rode up to them, according to police. The Hells Angels bikers then began to kick Vagos riders, and a Hells Angels member stood up on a motorcycle and began shooting.\n\nBoulder City police said multiple Hells Angels members were at a cafe earlier that day. They identified the members as Devries, the Hells Angels Las Vegas chapter president, and Alo and Smith as Hells Angels prospects. A fourth Hells Angels member was also listed as being at the cafe.\n\nAccording to the police report, authorities used cellphone data to track the movement of the select Hells Angel bikers that placed them on the highway at the location and time of the shooting.\n\nDevries, Alo and Smith face multiple charges from the incident that include six counts of attempted murder with a deadly weapon.\n\nOfficials did not release any further immediate details on the condition of the people injured.\n\nCopyright 2022 KVVU via Gray Media Group, Inc. All rights reserved."}, {"url": "https://www.rgj.com/story/news/2022/06/02/prosecutor-hells-angels-vagos-freeway-highway-95-shooting-act-revenge/7487389001/", "page_content": "HENDERSON — Authorities suspect a Memorial Day weekend shooting on a Southern Nevada highway involving longtime rival motorcycle gangs was an act of retaliation and could be \"part of a larger case,\" a Clark County prosecutor revealed in court Thursday.\n\nAccording to Chief Deputy District Attorney Danielle Chio, a Vagos biker killed a Hells Angels member last month in San Bernardino, California — the birthplace of the Vagos Motorcycle Club in the mid-1960s.\n\n\"The concern is that there's retaliatory shootings going back and forth between the two jurisdictions and between the two clubs,\" Chio said, although she did not disclose further details about last month's killing.\n\nThe latest violent encounter unfolded Sunday morning on a stretch of U.S. Highway 95 in Henderson, a suburb located just outside Las Vegas.\n\nNew details emerge\n\nThe Hells Angels bikers, Chio said, were lying in wait on the side of the freeway as their rivals returned to the area from Arizona and neighboring Boulder City after participating in an annual group ride honoring veterans.\n\nSeven people were injured in the shooting, six of whom are affiliated with the Vagos Motorcycle Club, authorities have said. During the apparent ambush, Chio revealed, one of the bullets travelled across the highway and struck a vehicle parked outside a nearby church.\n\nAfter the shooting, according to Chio, the Hells Angels bikers headed toward a Harley-Davidson dealer, where they attempted to hide their bikes before fleeing the area.\n\nThose new details emerged Thursday during an arraignment hearing in Henderson Justice Court for 66-year-old Richard Devries, president of the Hells Angels Las Vegas chapter, and recruits Russell Smith, 46, and Stephen Alo, 26.\n\nThe trio have been in police custody since their arrests Sunday evening, each held on $380,000 bail.\n\nBail arguments\n\nDuring Thursday's hearing, Chio asked Justice of the Peace David Gibson to raise bail to $1 million, while defense lawyers Richard Schonfeld and Tom Pitaro argued for lower bail, calling the $380,000 collateral \"excessive.\"\n\nThe judge ultimately denied both requests, keeping bail at $380,000 — which Gibson described as a \"big enough number\" that would \"make somebody think again\" before committing a crime.\n\n\"I believe that there is clear and convincing evidence that all of these defendants are a danger to the community,\" Gibson said.\n\nAccording to the defense attorneys, none of the defendants have a serious criminal record, and, therefore, do not pose a risk to the community. In addition, the lawyers said, their clients have deep ties to the community.\n\nDevries, a military veteran who, according to Schonfeld, was honorably discharged, has lived in Nevada for close to two decades.\n\nAlo, meanwhile, is employed and married with one daughter. He has been a Nevada resident nearly his entire life, Pitaro said. Similarly, Smith is married, employed and owns his Southern Nevada home.\n\n\"When we look at the stability factors,\" said Pitaro, who is representing both Alo and Smith, \"how do we predict the future based upon the past? All three of these men, quite truthfully, your honor, have nothing in their past that would give the court a concern for the future.\"\n\nGibson responded: \"I can't predict the future, but I can kind of control it.\"\n\nThe rivalry\n\nDevries, Alo and Smith are scheduled to return to court on June 14.\n\nBoth Vagos and the Hells Angels, which was founded in Fontana, California, in the late 1940s, are classified as outlaw motorcycle gangs by the U.S. Department of Justice.\n\nTheir violent rivalry can be traced back to the Vagos gang's attempts to expand its territory, authorities have said, including a push about a decade ago into the Hells Angels' long-claimed territory of Santa Cruz.\n\nBy late 2011, the turf war would spill into Nevada, where a shootout between the clubs broke out inside a Sparks casino that ended with the death of Hells Angels leader Jeffrey Pettigrew.\n\nRio Lacanlale is the Las Vegas correspondent for the Reno Gazette Journal and the USA Today Network. Contact her at rlacanlale@gannett.com or on Twitter @riolacanlale. Support local journalism by subscribing to the RGJ today."}, {"url": "https://harleyliberty.com/2020/02/06/a-vagos-biker-club-member-killed-a-rival-hells-angels-leader-from-california-in-a-northern-nevada-casino-gunfight/", "page_content": "By KEN RITTER\n\nA Vagos biker club member killed a rival Hells Angels leader from California in a northern Nevada casino gunfight in 2011 to stop an active shooting that the dead man started, not as part of a murderous plot and a broad criminal racketeering conspiracy, a defense lawyer told a federal jury on Wednesday.\n\n“Defense of others and self,” attorney Michael Kennedy said, representing admitted Vagos member and shooter Ernesto Gonzalez. “That is the singular simple truth of this case.”\n\nKennedy said none of the eight accused Vagos members deserves to be convicted in a sweeping prosecution stemming from the killing of Jeffrey Pettigrew, then-president of the Hells Angels chapter in San Jose, California. The attorney denied widespread allegations of Vagos conspiring and committing violent crimes for more than a decade in California, Arizona, Hawaii, Oregon, Utah and Nevada.\n\nHarley-Davidson cannot even sell it’s motorcycles but now they go after Die-Hard fans with a lawsuit\n\nProsecutor Daniel Schiess spent the equivalent of two days telling jurors that evidence showed Vagos are a violent gang adhering to “laws of the street, not laws of society,” committing murders, robberies, extortion, kidnappings and dealing drugs in furtherance of a criminal enterprise.\n\nSchiess also asked jurors to reconsider the credibility of ousted Vagos member Gary “Jabbers” Rudnick — a witness who prosecutors in August featured as key to the case before dramatically disavowing him in September as a liar.\n\nRudnick admitted fabricating accounts of Pastor Fausto Palafox, then the Vagos international president and now a co-defendant, giving a “green light” go-ahead to kill Pettigrew ahead of a gunfight that sent patrons diving for cover at the Nugget casino in Sparks.\n\nThe eight co-defendants — Gonzalez, Palafox, Albert Lopez, Albert Perez, James Gillespie, Bradley Campos, Cesar Morales and Diego Garcia — each face up to life in prison if they’re convicted. Thirteen other defendants await trial.\n\nJurors have seen Pettigrew on casino security video talking amiably with other Vagos before arguing with Rudnick, throwing a first punch, pulling a gun and apparently firing several shots.\n\nOne shot badly wounded Vagos member Leo Ramirez in the abdomen, Kennedy said.\n\nAnother Hells Angels member, Cesar Villagrana, is seen drawing a gun and firing shots as people scatter and duck for cover. Garcia was wounded in the leg.\n\nKennedy said the melee continued for almost two minutes before Pettigrew and Villagrana begin kicking the head and neck of a Vagos member who had fallen to the floor.\n\nWest Shore RCMP is rolling out a program that will give local businessesthe power to deny entry or remove ‘inadmissible patrons’ at any time.\n\nGonzalez drew his own gun and fired just as a casino patron reached for a chair to throw it toward Pettigrew and Villagrana, Kennedy said.\n\n“The incident came to an end only when Mr. Gonzalez acted to stop it,” the defense attorney said. He asked the jury to remember the testimony of the man who endured kicks while on the ground.\n\nPolice asking members and associates of Bandidos Motorcycle Club for help in quadruple murder\n\n“I was going to be killed that night,” Kennedy said, quoting Robert Wiggins’ testimony. “The only reason I’m here is because someone saved my life.”\n\nClosings by other defense attorneys are scheduled Thursday, followed by prosecutor John Han’s case summary. The jury then begins deliberating verdicts."}]}