{"Vagos Motorcycle Club was originally formed as a social club for Mexican-American bikers.": [{"url": "https://www.history.co.uk/shows/outlaw-chronicles-hells-angels/articles/history-of-the-vagos-mc", "page_content": "History of the Vagos MC\n\nThe year is 1965. USA are in the middle of the Vietnam War, Martin Luther King has recently marched from Selma to Montgomery and Roger Miller’s ‘King of the Road’ is number one. Thirteen bikers meet on the corner of Eighth and Davidson in San Bernardino, California to form the Vagos Motorcycle Club, beginning a history that would involve drug trafficking, clashes with the police and a violent rivalry with the Hells Angels.\n\nThe elected president was Rudy Esparza, nicknamed Puro, who led the new club in selecting their name. Other names considered included Coffin Dogers MC and Satan’s Saints MC, but Vagos MC, Spanish for vagabond, was chosen. Their new patch, a red devil on a green background, was inspired by an image of a devil in LIFE magazine entitled ‘Return from hell.’\n\nMore Outlaw Motorcycle Gangs (OMGs) were established in the 1960s than in any other decade. The outlaw status is given to groups who are not sanctioned by the American Motorcyclists Association (AMA). They are also known as 1%ers, a term which originated after the Hollister biker riot in 1947 when the AMA allegedly claimed the 99% of bikers were law abiding citizens, although the AMA have no record of issuing this as an official or public statement.\n\nBikers would often move between clubs or find their club being absorbed into a larger club. Puro had previously been with the Psychos MC and others joined from clubs including El Diablo MC. The question of whether the Vagos would absorb or be absorbed was very quickly answered as more Chapters sprang up across California. In 2014 the FBI listed the Vagos as one of the largest Outlaw Motorcycle Groups in Western America with 600 members in 24 Chapters throughout America, as well as Chapters in Canada, Mexico and Europe.\n\nThe Mafia on wheels?\n\nDescribed by Vagos infiltrator Charles Falco as “the mafia on wheels” the Vagos have more than earned their 1%er patch. Drug related arrests have been made throughout their colourful history. In 1987 the head of the South Bay Chapter and President of the Desert Hot Springs Chapter along with three others all pleaded guilty to conspiracy to distribute methamphetamines. Over 40 pounds of cocaine and eight pounds of methamphetamines (and a rocket launcher!) were seized in a 2011 raid. And in 2014 four Vagos members were arrested by the FBI for selling methamphetamines.\n\nAlongside money laundering and weapons trafficking, the Vagos are also known for their general violence, especially with rival OMGs. As the Vagos attempted to expand their territory tension erupted between them and other OMGs most notably the Hells Angels. In 2001 a bloody melee broke out between the Vagos and the Angels in the Californian city of Costa Mesa. And in 2010 an argument over which gang got to hang out in the Starbucks in Santa Cruz escalated. A brawl outside the coffee shop led to a gunfight in Chino Valley, several drive by shootings and a bitter feud.\n\nThe authorities have successfully infiltrated the Vagos a number of times. George Rowe, a street criminal whose friend had disappeared after an incident with the Vagos, volunteered to go undercover as part of Operation 22 in 2003. His evidence gathered over 3 years resulted in 42 arrests and convictions for crimes as serious as murder. Whilst Charles Falco worked his way up to number two of the Victorville Chapter and provided the ATF (Bureau of Alcohol, Tobacco and Firearms) gathering enough information to make 62 arrests for crimes including assault and murder. Fun fact, both Rowe and Falco have written books about their experiences and actually appear as characters in each other’s books.\n\nHowever the Vagos have their own weapon in their ongoing battle with the police- the lawsuit. In 1990 the Vagos sued the police and received a $2 million settlement claiming they were targets of massive police abuse in the early eighties. And in 2010 when the Vagos were blamed for a spree of homemade booby traps that targeted the police, they once again sued and received a settlement that included a public statement and the return of property seized the previous year.\n\n1%ers\n\nAs with all criminal groups the Vagos don’t advertise their more notorious crimes. Their PR website vagosmcworld.com, presents them as a club rather than a gang. Their consistent response to arrests is that it is not all of their members committing crimes, but a few bad apples. So, organised crime syndicate or a club where just 1% of the 1%ers are giving them a bad name…?"}, {"url": "https://www.liquisearch.com/vagos_motorcycle_club/history", "page_content": "“Psychology keeps trying to vindicate human nature. History keeps undermining the effort.”\n\n—Mason Cooley (b. 1927)\n\n“The basic idea which runs right through modern history and modern liberalism is that the public has got to be marginalized. The general public are viewed as no more than ignorant and meddlesome outsiders, a bewildered herd.”\n\n—Noam Chomsky (b. 1928)\n\n“There has never been in history another such culture as the Western civilization M a culture which has practiced the belief that the physical and social environment of man is subject to rational manipulation and that history is subject to the will and action of man; whereas central to the traditional cultures of the rivals of Western civilization, those of Africa and Asia, is a belief that it is environment that dominates man.”\n\n—Ishmael Reed (b. 1938)"}, {"url": "https://onepercenterbikers.com/vagos-mc-motorcycle-club/", "page_content": "Vagos MC is a one percenter motorcycle club founded in San Bernardino, California in 1965. The motorcycle club are also known as the Green Nation and have a strong presence in the USA and Mexico, but have also expanded to many other countries.\n\nVagos MC History\n\nVagos MC was founded in San Bernardino, California in 1965. Like many other motorcycle clubs of the time, the Vagos Motorcycle Club was founded by a group of members who had returned from World War II and enjoyed riding their Harley Davidson motorcycles. This particular group were originally members of a different motorcycle club, the Psychos (Redlands) Motorcycle Club. After some infighting a few of the members decided to leave and form their own club, which then became the Vagos Motorcycle Club.\n\nThe original members were Rudy “Puro” Esparza (President), Gil Carrasco (Vice President), Whitey (Secretary/Treasurer), Lucky (Sgt. at Arms), Freddy Ruiz, Harley Hog, Animal, Crazy John Estrada, Tom Tom, Moose, Squirrel, Alex Estrada, and Little John Bocanegra.\n\nThe founders of Vagos Motorcycle Club had a Mexican heritage, which led to the color green being selected for the club. The word “Vagos” in Spanish means “vagabond”, “gypsy” or “travelling person”, someone who is always up to something. Two other names for the club were considered, Coffin Dodgers MC and Satan Saints MC.\n\nThe first chapter to open was in San Bernardino, California, which is nicknamed the “Berdoo” chapter. San Bernardino was a hot spot for founding motorcycle clubs, also founded in the area were the Hells Angels Motorcycle Club.\n\nThe second chapter was the Vagos Motorcycle Club Victorville chapter, which involved patching over of Cossacks Motorcycle Club.\n\nThe third chapter was the Vagos Motorcycle Club Los Angeles chapter, made up of members from the Talons Motorcycle Club.\n\nThe fourth chapter was the Vagos Motorcycle Club San Gorgonio Pass chapter, started by some of the Berdoo chapter members and their friends.\n\nThe fifth chapter was the Vagos Motorcycle Club SGV (San Gabriel Valley) chapter. This was made up of past members of Dirty Dozen MC, Highwaymen MC, Verdugos MC, Vendettas MC and Ghostmen MC.\n\nThe sixth chapter was the Vagos Motorcycle Club Monterrey chapter, consisting of past members of Sabers MC, Dirty Dozen MC and Highwaymen MC.\n\nThe seventh chapter was the Vagos Motorcycle Club Pomona Valley chapter, with members of Nacoda Breed MC.\n\nThe eighth chapter was the Vagos Motorcycle Club Antelope Valley chapter, where members came from Brothers MC.\n\nChapters in Mexico then opened approximately 15 years later in Mexicali, Mexico.\n\nIn 2013 Vagos Motorcycle Club opened chapters in Australia and Sweden.\n\nThe majority of members of the one percenter motorcycle club are Caucasian or Hispanic.\n\nVagos MC Patch / Motto\n\nThe Vagos Motorcycle Club patch consists of the Norse god of Mischief, Loki. He is depicted riding a motorcycle. The Vagos Motorcycle Club patch was designed by a member of the Berdoo chapter who was in prison at the time.\n\nThe Vagos MC motto is “We Give What We Get”.\n\nOne of the Vagos Motorcycle Club abbreviations is 22, as the 22nd letter in the alphabet is the letter “V”.\n\nThe Vagos Motorcycle Club colors are green, which links back to the Mexican heritage of the Vagos Motorcycle Club founder.\n\nVagos also use the motto “VFFV”, meaning “Vagos Forever, Forever Vagos”. This format is used by many clubs, for example the Bandidos “BFFB”.\n\nVagos MC Chapters\n\nVagos are spread throughout the world, with a strong presence both in Southern California and Mexico.\n\nVagos Motorcycle Club United States Chapters Vagos Berdoo San Bernardino, California chapter Vagos Victorville chapter Vagos Los Angeles chapter Vagos San Gorgonio Pass chapter Vagos Hollywod chapter Vagos Sacramento chapter Vagos San Jose chapter Vagos Compton chapter Vagos Pasadena chapter Vagos SGV (San Gabriel Valley) chapter Vagos Monterrey chapter Vagos Pomona Valley chapter Vagos Antelope Valley chapter Vagos Venice chapter Vagos Central Valley, Stockton, California chapter Vagos New York chapter Vagos Nomads chapter Vagos Arizona chapter Vagos New Mexico chapter Vagos Illinois chapter Vagos Utah chapter Vagos Florida chapter Vagos Arkansas chapter Vagos Mojave chapter\n\n\n\nVagos Motorcycle Club Mexico Chapters Vagos Ocotlan chapter Vagos Hormiga Tlalpan chapter Vagos Coronel chapter Vagos Malpaatla chapter Vagos Tonito chapter Vagos Morelia chapter Vagos Centro chapter Vagos Guanajuato chapter Vagos Toluca chapter Vagos Zamora chapter Vagos Alvaro Obregon chapter Vagos Coyocan chapter Vagos Tlaquepaque chapter Vagos Zapopan chapter Vagos Guadalajara chapter\n\n\n\nVagos Motorcycle Club Australia\n\nVagos Motorcycle Club Canada\n\nVagos Motorcycle Club Brazil\n\nVagos Motorcycle Club Europe Chapters Vagos Scandinavia chapter Vagos Nomads Europe chapter Vagos United Kingdom chapter Vagos Germany chapter Vagos Switzerland chapter\n\n\n\nFamous Vagos MC Members\n\nRudy “Puro” Esparza – Founder/President\n\nBorn November 16, 1935 and died August 14, 2013 in Joshua Tree, California. He was one of the Vagos Motorcycle Club founders and the first President.\n\nVagos MC Crime / In The Media\n\n1974 – 4 members of Vagos Motorcycle Club are convicted of murder and sentenced to death for the murder of William Velten, a student at the University of Mexico. Richard Greer, Ronald Keine, Clarence Smith and Thomas Gladish were on death row for 17 months, however were saved when Kerry Rodney Lee confessed to the murder.\n\n1998 – Over a dozen members of the motorcycle club are arrested for kidnapping as well as on drugs and weapons charges after a two year investigation by undercover agents.\n\n2002 – The ex-wife of a police detective in Pomona, California attempts to hire a member of the Vagos Motorcycle Club to murder he ex-husband. The motorcycle club contacted the police and advised of the situation.\n\n2004 – 26 members of the one percenter motorcycle club are arrested and $125,000 in cash, weapons and drugs is found.\n\n2006 – March 9, 2006, an operation titled “Operation 22 Green” is conducted where 700 ATF, local police and sheriff departments came together to arrested 25 members of the club.\n\n2007 – December, 2007. 6 members of the motorcycle club are arrested for burglary, robbery, coercion and kidnapping in crimes occurring in August 2007. The crime involved a member of Vagos Motorcycle Club who wanted to leave, so was then beaten, kidnapped and robbed.\n\n2009 – June, 2009. 3 members of the motorcycle club are arrested on June 9 and June 10 and charged with sexually assaulting a woman in San Jose, California.\n\n2009 – December 31, 2009. The unmarked headquarters of the Hemet Gang Task Force was filled with natural gas via a hole in the roof. The gas was detected by two members of the law enforcement group and they exited the building quickly without causing any explosion. A day before this event the Vagos Motorcycle Club had been next door at a church, attending a funeral for one of their members.\n\n2010 – February 23, 2010. A member of the Hemet Gang Task Force opens a security gate at the complex and a homemade gun booby trapped to the gate fires, nearly hitting the task force member in the head.\n\n2010 – March 5, 2010. A member of the Hemet Gang Task Force returns to his unmarked police car which was parked outside of a convenience store. He discovers that there is a homemade pipe bomb which has been hidden underneath the car.\n\n2010 – March 17, 2010. Police arrest 30 members of the Vagos Motorcycle Club in relation to the attempted attacks on the Hemet Gang Task Force on December 31, 2009, February 23, 2010 and March 5, 2010. As part of these arrests there were also raids in Arizona, California, Nevada and Utah across 73 locations. Multiple weapons were found in the raids, along with the discovery of a meth lab. A $200,000 reward was posted by law enforcement for information regarding the attacks on the Hemet Gang Task Force, which at the time were labelled as “urban terrorism”.\n\n2011 – March, 2011. Vagos Motorcycle Club sues the Riverside County Law Enforcement or defamation in relation to the attacks on the Hemet Gang Task Force. On August 1, 2011 the case was settled and ties between the club and the attacks removed. Law enforcement arrested two people unrelated to the club for the attacks.\n\n2011 – August, 2011. Vagos Motorcycle Club are involved in a shooting with Galloping Goose Motorcycle Club near Waynesville, Missouri. The fight was said to involved approximately 20 people.\n\n2011 – September 23, 2011. Jeffrey Pettigrew, the Hells Angels San Jose chapter President is killed in a shooting involving members of Vagos Motorcycle Club. The event occurred at John Ascuaga’s Nugget, also known as the Nugget Casino Resort, in Sparks, Nevada. On September 29, 2011, Vagos Motorcycle Club member Ernesto Manuel Gonzales is arrested for the murder. Vagos Motorcycle Club Los Angeles chapter Vice President Gary Rudnick is also arrested in relation to the event and leader plead guilty to murder in the second degree.\n\n2017 – 16 June, 2017. 23 members of the Vagos Motorcycle Club, including several high ranking officers, are arrested in an operation that spread across California, Hawaii and Nevada and are accused of murder, racketeering, kidnap, assault and drug dealing. Some of the arrested are believed to have been involved in the 23 September 2011 shooting of Jeffrey Pettigrew.\n\nThe arrested men were: Pastor Fausto Palafox, aka ‘Tata’, Albert Lopez aka ‘Al’, Albert Benjamin Perez, aka Dragon Man, James Patrick Gillespie, aka Jimbo, Andrew Eloy Lozano, aka Hulk, Ernesto Manuel Gonzalez, aka Romeo, Victor Adam Ramirez, aka Slick, James Walter Henderson aka CJ, Steven Earl Carr, aka Big Steve, Robert Alan Coleman, aka Mayhem, Jeremy John Halgat, aka Maniak, Paul Jeffrey Voll, aka Shyster, John Joseph Siemer, aka Rocky, Bradley Michael Campos, aka Candy Man, Cesar Vaquera Morales, aka C, Diego Chavez Garcia aka Boo, Edward Claridan Chelb, aka Recon, Johnny Russell Neddenriep aka Johnny Bolts, Darin Kieth Grieder, aka Midget, Thomas Granville Garretson, aka Tommy Guns, Bert Wayne Davisson, aka Flash, Matthew Keith Dunlap, aka Big Mat, and John Chrispin Juarez, aka Quicky.\n\n2017 – 29 July, 2017. In Santa Fe, New Mexico, Vagos MC member David Andrew Cordova and his son David Ray Cordova fire over 20 shots from a car at a home of a Bandidos MC member. David Andrew Cordova is shot and injured in the arm during the incident, however it is not clear who fired the shot that hit him.\n\nVagos MC Enemies and Allies\n\nVagos MC Enemies:\n\nVagos MC Allies:\n\nMongols MC are allies\n\nVagos Books:\n\nVagos Book – Vagos, Mongols, and Outlaws: My Infiltration of America’s Deadliest Biker Gangs by Charles Falco and Kerrie Droban.\n\nCharles Falco was a large scale methamphetamine dealer in 2001, reportedly earning $500,000 a year, when he was arrested by law enforcement and provided a deal by the ATF to infiltrate outlaw motorcycle clubs. First it was Vagos MC, where he rose to the role of “Officer” (second in charge) in the Victorville, California chapter. He later joined the Mongols and lastly the Outlaws where he became the Petersburg, Virginia Vice President. Find out more on Amazon (link opens in a new tab).\n\nGods of Mischief: My Undercover Vendetta To Take Down The Vagos Outlaw Motorcycle Club by George Rowe.\n\nAn account of how the author assisted the government by infiltrating Vagos MC. A view looking in from an outsider, with discussion of the author’s troubled childhood and his personal struggle. It doesn’t make our list of the best outlaw motorcycle books, but there aren’t too many books around covering Vagos. Find out more on Amazon (link opens in a new tab).\n\nTerry the Tramp: The Life and Dangerous Times of a One Percenter by K. Randall Ball (Easyriders magazine writer Keith “Bandit” Ball)\n\nThis is the biography of Terry Orendorff. Terry “The Tramp” is the former International President of Vagos MC, a position which he held for several decades. The book takes you through his life, but also provides an insight into the biker culture, particularly around the 1970s and 1980s. Find out more on Amazon (link opens in a new tab).\n\nRead More:\n\nPlease help us out by hitting the “Share” button so that we can keep bringing you more articles and “Follow” us on Facebook so that you get updated when we release new articles."}, {"url": "https://bikernews.net/2020/06/15/an-in-depth-look-at-the-vagos-motorcycle-club/", "page_content": "The Biker News Network / Outlaw Biker World is neutral ground. (IO, LEO’s and Narc are NEVER welcome!) This site has NO club affiliation, we’re only here to spread the news! Also, we aren’t narcs here, so we won’t rat you out for posting. We’ll just ban you!\n\nRegister and Log In for an\n\nAd-Free experience!"}, {"url": "https://hollywoodvagos.com/vago-history/", "page_content": "Vago History\n\nIn the early sixties thirteen friends started a motorcycle club in Southern California. For years many have passed stories around, this is the real story of how the Vagos Motorcycle Club was originated from one of the last of the first 13 original members and founders. This is his story of the birth of our club. It is important to pass this history of our club to all our brothers in order to keep its history alive.\n\nOn May 18th on the corner of Eighth and Davidson in San Bernardino, California a motorcycle club, not gang, was originated.\n\nThe members were:\n\nPuro – President\n\nGil Carrasco – Vice President\n\nWhitey – Secretary\n\nTreasurer Lucky – Sgt. at Arms\n\nFreddy Ruiz, Harley Hog, Crazy John Estrada, Tom Tom, Moose, Squirrel, Alex Estrada, and Little John Bocanegra.\n\nOriginally two other names were considered, Coffin Dodgers MC and Satan Saints MC the name VAGOS MC was suggested by Puro and was voted on. Then the emblem had to be chosen. Lucky was browsing through LIFE magazine and found a picture of a devil coming out of the ground surrounded by smoke, the caption read “return from hell.” Animal and Lucky presented the picture to the other members for a vote, the vote passed. The colors were chosen by Whitey and Puro. The color chosen was green on green with the devil in red. After the vote, Moose was chosen to draw the center piece. The patches made for the first original 13 were made from felt by a seamstress from Muscoy named Betty. She made all the patches for the few clubs that were around at the time. She made ours till the early 90s when her sight went bad. The patches after the original 13 were made from canvas.\n\nSoon after we got started, a lot of men started to come in; the first was J.R. Garcia. That was three months after we originated. Three months after that we moved to 11th and “L” streets in Berdoo, the Mother chapter.\n\nSoon other clubs wanted to become Vagos! A brief history:\n\nThe second Vago chapter started was Victorville, the members were from the Cossacks MC.\n\nThe third Vago chapter was Los Angeles, whose members were from the Talons MC.\n\nThe forth Vago chapter was San Gorgonio Pass, made up of a few Vagos from Berdoo and a bunch of men who they knew, who rode hard and partied harder.\n\nThe fifth Vago chapter was S.G.V., these members were from the Dirty Dozen MC, a few Highwaymen MC, Verdugos MC, Vendettas MC and Ghostmen MC.\n\nThe sixth Vago chapter was Monterrey, they were from the Sabers MC, and some Dirty Dozen MC and Highwaymen MC.\n\nThe seventh Vago chapter was Pomona Valley, made up with men from the Nacoda Breed MC.\n\nThe eighth Vago chapter was Antelope Valley, it’s members were from the Brothers MC,\n\nThe Mexico chapters were started by accident, 15 years later. Lucky was in Ensenada on the 4th of July playing in a softball tournament. His wife Irene, stopped the game to show Lucky three guys on bikes going down the street. The name on their cuts was the same as ours, except the colors were different. They were black and gray with orange-yellow, with an eagle center. Lucky found out later where they were partying, so he went over and talked and partied with them. The president’s name was Tati and they were from Mexicali. With them partying was another club, the Solo Angels MC. When he came back home he got a hold of Prophet who was the national President at the time, he also went to the Berdoo chapter to talk to Lenco, Loco and Crazy Johnny. We give the credit to them for starting the Vagos MC across the border. We also credit P.C. Games for the growth of the rest of the chapters in Mexico in the early years."}, {"url": "https://wiki.gta.world/index.php/Vagos_Motorcycle_Club", "page_content": "The Vagos Motorcycle Club, also known as the Green Nation, is an outlaw one percenter motorcycle club that was first established in western United States. Since then, the biker club has expanded across the USA and several other countries.\n\nThe name \"Vagos\" is the Spanish translation for the word \"vagabond\" or \"wanderer\", the colors of the Vagos pay homage to their founders' Mexican heritage. The insignia of the Vagos MC depicts a muscular burlesque of Loki, the Norse god of mischief riding a motorcycle with a green field in the background scenery. They are based throughout several countries with precisely four thousand patch members, the most prevalent being the United States and Mexico, where they earned the moniker \"The Green Empire\".\n\nThose affiliated with the Vagos Motorcycle Club can be identified by their club patches and commonly shared tattoos among the Vagos. They bear a two-piece patch on the back, a center-piece consisting of their club name “Vagos” and “MC”, accompanied by a bottom rocker stating their territorial claim.\n\nSouth San Andreas Chapter\n\nThe South San Andreas chapter of the Vagos MC was founded in the year 2010, established as a nomad charter, through the gathering of seven Vagos members previously spread across the states.\n\n\n\n\n\n-- WORK IN PROGRESS --"}, {"url": "https://www.liquisearch.com/vagos_motorcycle_club", "page_content": "The Vagos Motorcycle Club, also known as the Green Nation, is a one percenter motorcycle club that formed in 1965 in the unincorporated community of San Bernardino, California. The club originally was called \"the Psychos\". The club's insignia is Loki, the Norse god of mischief, riding a motorcycle. Members typically wear green.\n\nThe Federal Bureau of Investigation as well as the Bureau of Alcohol, Tobacco, Firearms and Explosives and the California Attorney General have named the Vagos as an outlaw motorcycle club, claiming that they are involved in criminal activities such as producing, transporting and distributing methamphetamine and marijuana, as well as assault, extortion, insurance fraud, money laundering, murder, vehicle theft, witness intimidation and weapons violations. The Vagos have approximately 600 members among 24 chapters located in the states of Arizona, California, Hawaii, Nevada, Oregon, Utah, 1 Canadian chapter in Peterborough, Ontario, and ten chapters located in Mexico (Baja California, Jalisco and Mexico City). Two hundred members are in Inland Empire (California), where the club was started in the late 1960s.\n\nIn 2002, members of the Vagos turned in the estranged wife of a Pomona, California police detective after she attempted to hire a hit man from the Vagos to kill her husband."}, {"url": "https://indybikepolo.org/vagos-motorcycle-club-members/", "page_content": "The Vagos Motorcycle Club, also known as the Green Machine, is a motorcycle club that was formed in the 1960s in the San Fernando Valley of Los Angeles, California. The club has around 1,000 members and is one of the largest outlaw motorcycle clubs in the United States.\n\nThe Vagos are one of the most feared outlaw motorcycle clubs in the world. They are known for their violence, drugs, and racism. The club has been involved in a number of high-profile killings, shootings, and brawls. In fact, the club has been so violent that the FBI has classified them as a “major criminal organization.”\n\nThe Vagos are a close-knit club and members are fiercely loyal to one another. New members are often required to do menial tasks such as cleaning the club’s headquarters or running errands for the older members.\n\nThe Vagos Motorcycle Club is not just a group of bikers who like to ride motorcycles. They are a full-blown criminal organization that is involved in a wide variety of criminal activity. Some of the things that the Vagos are involved in include drug trafficking, gun running, prostitution, and theft.\n\nThe Vagos Motorcycle Club is a dangerous organization and anyone thinking of joining them should think twice. The club is known for its violence and criminal activity, and members can often be found engaging in criminal behavior. If you are not prepared to commit serious crimes, then the Vagos Motorcycle Club is not the club for you.\n\nAre Vagos and Hells Angels rivals?\n\nAre Vagos and Hells Angels rivals?\n\nThis is a difficult question to answer, as there is no definitive answer. It is safe to say, however, that there is some rivalry between the two groups.\n\nThe Vagos are a motorcycle gang that was formed in the 1960s. The Hells Angels are the largest and most well-known motorcycle gang in the world. There is certainly some competition between the two groups, as each wants to be the most dominant motorcycle gang in the world.\n\nThere have been clashes between the two groups in the past, and there is certainly potential for more clashes in the future. It is important to note, however, that not all members of the Vagos and the Hells Angels are rivals. In fact, many members of the two groups get along well and even cooperate with each other.\n\nSo, are the Vagos and the Hells Angels rivals?\n\nThere is certainly some rivalry between the two groups, but it is not always clear-cut. Many members of the two groups get along well and cooperate with each other.\n\nWhat do Vagos do?\n\nWhat do Vagos do?\n\nThe Vagos are a motorcycle gang that operates primarily in the western United States. They are considered a “one percenter” gang, meaning that they are not part of the mainstream society. The Vagos are known for their criminal activities, which include drug trafficking, extortion, and murder.\n\nThe gang has been active since the 1960s, and their membership has grown to include thousands of members. The Vagos are most active in California, Nevada, and Arizona, but they have a presence in many other states.\n\nThe Vagos are considered a major threat to public safety, and law enforcement officials are working to crack down on their activities. In recent years, the gang has been involved in several high-profile crimes, including the murder of a sheriff’s deputy in California.\n\nThe Vagos are a dangerous gang, and anyone who is associated with them should be aware of the risks. They are known for their criminal activities, and they are not afraid to use violence to get what they want. If you come into contact with the Vagos, it is best to stay away and contact the authorities.\n\nWhy do the Hells Angels hate the Vagos?\n\nThe Hells Angels and the Vagos are two gangs that have been locked in a bloody rivalry for years. The two gangs have been fighting for control of the drug trade in California and other parts of the United States. The Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most well-known motorcycle gang in the world, while the Vagos are a smaller gang that is based in California.\n\nThe two gangs have been fighting for control of the drug trade in California and other parts of the United States.\n\nThe Hells Angels are the largest and most\n\nAre Vagos white?\n\nAre Vagos white? This is a question that has been asked by many people over the years. There is no simple answer to this question, as there is no one answer that fits all Vagos. Some members of the gang may be white, while others may be of a different race or ethnicity.\n\nThe Vagos gang was formed in the 1960s in the San Fernando Valley area of Los Angeles. It is believed that the gang was originally formed by a group of Mexican-American teenagers who were looking for a way to express their dissatisfaction with society. The Vagos soon began to engage in a variety of criminal activities, including drug trafficking, robbery, and murder.\n\nThe gang has since grown in size and spread to other parts of the United States. Today, the Vagos are believed to have a membership of around 10,000 people. The gang is particularly active in the states of California, Nevada, and Oregon.\n\nThe Vagos gang is not a monolithic organization. It is made up of a variety of different members with different backgrounds and beliefs. Some members of the gang may be white, while others may be of a different race or ethnicity.\n\nWhether or not the Vagos are a white gang is a matter of debate. There is no definitive answer to this question. Some people may consider the Vagos to be a white gang because the majority of its members are white, while others may not consider the gang to be white because it includes members of other races and ethnicities.\n\nUltimately, the answer to this question depends on your definition of a white gang. If you consider a white gang to be a gang whose members are all white, then the Vagos are not a white gang. However, if you consider a white gang to be a gang whose members are predominantly white, then the Vagos may be considered a white gang.\n\nWho are the enemies of the Vagos?\n\nThe Vagos are a motorcycle gang that has been around for over 50 years. They have a long list of enemies, including the Hells Angels, the Outlaws, and the Bandidos.\n\nThe Hells Angels are the Vagos’ number one enemy. They are a rival motorcycle gang that was formed in California in 1948. The two gangs have been fighting for control of the drug trade since the 1970s.\n\nThe Outlaws are another rival motorcycle gang that was formed in Illinois in 1935. They are also fighting for control of the drug trade with the Vagos.\n\nThe Bandidos are a motorcycle gang that was formed in Texas in 1966. They are the biggest rival of the Vagos, and are also fighting for control of the drug trade.\n\nWho is the leader of the Vagos MC?\n\nThe Vagos Motorcycle Club (VMC) is a one percenter motorcycle club that was formed in 1965 in the San Fernando Valley of Los Angeles, California. The club is made up of Hispanic and Latino riders, and is considered to be one of the most violent outlaw motorcycle gangs in the US. The club’s president is currently unknown, as the club is believed to be a highly-secretive and tightly-run organization.\n\nThe Vagos MC is known for its involvement in a wide range of criminal activities, including drug trafficking, gun running, prostitution, and murder. The club is also known for its brutal and violent initiation rituals, which have resulted in several deaths. In recent years, the Vagos MC has been involved in a number of high-profile clashes with rival gangs, including the Hells Angels, the Mongols, and the Bandidos.\n\nThe Vagos MC is considered to be one of the most dangerous motorcycle gangs in the United States, and its president is a highly-secretive and powerful figure. The club is believed to have a strong presence in California, Nevada, and Arizona, and is known for its involvement in a wide range of criminal activities.\n\nWho is the most feared motorcycle club?\n\nThe most feared motorcycle club in the world is the Hells Angels. This club was founded in 1948 and is considered to be the first motorcycle club in the United States. They have a long and dark history, and are known for their violence and criminal activities.\n\nThe Hells Angels are a worldwide organization, with chapters in over 100 countries. They are known for their brutal violence and for their connections to organized crime. In the United States, they are most well-known for their connections to drugs and prostitution.\n\nThe Hells Angels are considered to be one of the most dangerous motorcycle clubs in the world. They have a history of violence and crime, and are known for their willingness to use force to get what they want. They are also known for their strict rules and for their loyalty to one another.\n\nIf you are ever in a situation where you come into contact with the Hells Angels, it is best to stay away. They are not a club that you want to mess with, and they are not a club that is afraid to use violence."}, {"url": "https://www.motorcycledigital.com/vagos-motorcycle-club-membership/", "page_content": "\n\n\n\nThe Vagos Motorcycle Club is one of the most notorious and feared biker clubs in the world. From its inception in the 1960s, the Vagos have built a reputation as an organized crime gang that is known for its violence, drug trafficking, and criminal activities. Despite this reputation, members of the Vagos Motorcycle Club take pride in their commitment to their brothers and sisters and the traditions of the club.\n\n\n\nFor those looking to join the Vagos, membership is open to anyone who wants to become a part of the brotherhood. Prospective members must demonstrate a commitment to the club's ideals through their attitude and actions, as well as honor and loyalty to the members of the Vagos Motorcycle Club. The initiation process typically involves an intense period of probationary riding alongside a current member, and potential new members must be willing to endure mental and physical tests.\n\n\n\nA commitment to the Vagos Motorcycle Club is a lifelong dedication—members are expected to abide by the club's regulations, respect their fellow bikers, and never forget their commitment to the brotherhood. As a member of the Vagos, you'll have access to exclusive events, parties, and rides. You'll also be part of a powerful network of like-minded individuals who share a passion for the open road and the freedom it brings.\n\n\n\nSo, if you're ready to become a part of one of the most notorious biker gangs in the world, the Vagos Motorcycle Club is waiting for you. Join the brotherhood and experience the power of true biker camaraderie.\n\nVagos Motorcycle Club Trial Ends With Acquittals Las Vegas Review Journal\n\nBiker Gangs In America The Most Dangerous Motorcycle Complex\n\nVagos Motorcycle Club Archive Of An Outlaw Biker 1979 85 Daniel Oliver\n\nThe 8 Best Tv Shows About Motorcycle Gangs Tvshowpilot Com\n\nNevada Jury Being Picked For Vagos Biker Club Racketeering Trial Ksnv\n\nVagos Mc Brazil Home Facebook\n\n300 S Seized During Vagos Down Lake Elsinore Ca Patch\n\nInside The World S Deadliest Biker Gangs\n\nAn In Depth Look At The Vagos Motorcycle Club\n\nVagos Mc New York Главная Facebook\n\nMemoir Vagos Infiltrator Rode With Biker Gang Orange County Register\n\nVagos Mc Hawthorne You\n\nThree Biker Club Members Arrested After Search Warrants Served\n\nBiker Gangs In America The Most Dangerous Motorcycle Complex\n\nAndrew Hulk Lozano Enforcer For Vagos Gang S Desert Chapter Arrested In Sweeping Raids\n\nArmas Jaquetas E Rock História De Gangues Motos Nos Eua é Marcada Por Sangue Destruição Fotos R7 Internacional\n\nAn In Depth Look At The Vagos Motorcycle Club\n\nHow Does Vagos Motorcycle Club Operate\n\nFeds Announce Racketeering Charges Against 23 Motorcycle Gang Members Las Vegas Review Journal"}, {"url": "https://alchetron.com/Vagos-Motorcycle-Club", "page_content": "The Vagos have approximately 4,000 members among 200 chapters located in the states of Arizona, California, Hawaii, Nevada, Oregon, Utah, Missouri, Several Canadian chapters Peterborough, Ontario,Chapters throughout Europe and ten chapters located in Mexico (Baja California, Jalisco and Mexico City). Two hundred members are in Inland Empire (California), where the club was started in the late 1960s.\n\nThe Vagos Motorcycle Club , also known as the Green Nation , is a one percenter motorcycle club and alleged organized crime syndicate formed in 1965 in the unincorporated community of San Bernardino, California. The club's insignia is Loki, the Norse god of mischief, riding a motorcycle. Members typically wear green.\n\nHistory\n\nDuring World War II, many military service men rode motorcycles and grew attached to them, and could not leave them after the war. The motorcycle enthusiasts formed clubs around the time hot rods were in style. In 1948, the Hells Angels formed a motorcycle club; their first chapter was in San Bernardino (Berdoo), California. They shared the streets with another motorcycle club named the Psychos (Redlands). In 1965, a feud occurred among a few of the Psychos members; they left the group and created their own club, which is now known as Vagos MC. Their colors pay homage to their founders' Mexican heritage. The club expanded to the Riverside, California and the California high desert areas, and later to Mexico and Europe.\n\nInsignia\n\nA member from the Berdoo chapter (slang for San Bernardino) created a patch while he was in prison featuring Loki, the Norse god of mischief. Vago is Spanish for vagabond or wanderer. Their denim jackets sport their top rockers with their club name integrated into the middle patch, and bottom rockers with their chapter's region or state, such as \"SO. CAL\", \"California\", or \"Arizona\". The middle patch \"depicts a muscle-bound caricature of the Norse god of mischief, Loki, set against a green field\". Loki is colored red on top of a bike with his hands holding up their club name. Other patches the club wears are the number 22 (the 22nd letter of the alphabet, V, for Vagos), and a Loki head. An MF patch (meaning motorcycle family), is received by a member after a probationary period is over and the member is validated as a member of the Vagos family on the front. Some members have been seen with a green swastika and an \"SS\" symbol on their jackets.\n\nMembership\n\nVagos Membership primarily consists of Caucasian and Hispanic males.\n\nOfficial chapters\n\nThe Vagos have Chapters all throughout Southern California. They have Chapters in the High Desert (California),Inland Empire (California) which includes both Riverside County, California and San Bernardino County, California in the city of San Bernadino where they started, Azusa california San Gabriel Valley chapter ,Los Angeles and San Diego. They also have chapters in the states of Hawaii, Oregon, Nevada, and Utah as well as Memphis Tennessee and Chattanooga Tennessee and Kingston Tennessee also the country of Mexico, Mexicali BC Mother Chapter, Tijuana, Tecate Centro, Rumorosa and Rosarito beach. Europe, Canada and Australia.\n\nHemet traps\n\nOn March 17, 2010, amid allegations that Vagos members had fabricated home-made booby traps to maim and kill police detectives in Hemet, California, police arrested at least 30 Vagos members in a multi-state raid of Utah, Nevada, Arizona, and California, involving 400 police officers from 60 law enforcement agencies. The police raided 73 locations in Southern California, seizing weapons and drugs, and discovered a meth lab. The raids were the result of several incidents involving booby traps where the club was implicated:\n\nOn December 31, 2009, the unmarked headquarters of the Hemet Gang Task Force was filled with natural gas, which had been routed into the building through a hole drilled in the roof. Two task force members had detected the gas and backed away without triggering the explosion. The day before that attack, a Vagos funeral was held at a church next to the office.\n\nOn February 23, 2010, a task force member opened a security gate outside the building, causing a homemade zip gun attached to the gate to fire, nearly hitting his head.\n\nOn March 5, a task force member who had parked an unmarked police car in front of a convenience store in Hemet found a homemade pipe bomb hidden underneath the vehicle.\n\nCalifornia and federal authorities announced a $200,000 reward for information on these cases. California Attorney General Jerry Brown called the attempts \"urban terrorism.\" Riverside County District Attorney Rod Pacheco said that Vagos members posed an \"extreme threat\" to law enforcement officers and were notorious for trying to \"infiltrate\" public safety agencies, by obtaining sworn or non-sworn positions and working undercover to obstruct and dismantle police investigations.\n\nIn March 2011, the club sued Riverside County law enforcement for defamation and damages caused by implicating the group to the attacks on the Hemet police officers. On August 1, Riverside County settled the lawsuit, and cleared the club of any involvement with the attacks on the officers. Meanwhile, they had arrested two men that had no ties to the club. The club's attorney, Joseph Yanny, stated he was pleased with the result: \"This was never about money. What was important was that the club clear its name and take this shadow off them.\"\n\nNugget Casino shooting\n\nOn September 23, 2011, Vagos members were involved in a shooting at John Ascuaga's Nugget in Sparks, Nevada, where Jeffrey Pettigrew, the president of the San Jose, California chapter of Hells Angels was killed, and Vagos members were wounded. The next day, a Vagos member was wounded at a rally by a drive-by shooter. On September 29, police arrested Ernesto Manuel Gonzales, a Vagos member, at the University of California, San Francisco, for killing Pettigrew. On December 7, police announced that they had arrested Gary Rudnick, the vice-president of the Los Angeles chapter of Vagos, for instigating the fight that led to the shooting. Rudnick later pleaded guilty to second degree murder in a bargaining agreement. The trial for the two Vagos members, as well as a Hells Angels member who fired at a crowd, was held on October 29, 2012.\n\nOther incidents\n\nIn 1974, four Vagos members were convicted and sentenced to death for murdering University of New Mexico student William Velten. The four, Richard Greer, Ronald Keine, Clarence Smith and Thomas Gladish, spent 17 months on death row, but during the appeals process, Kerry Rodney Lee confessed to the murder.\n\nIn October 1998, police arrested more than a dozen Vagos members for kidnapping, drug and weapons crimes, following a two-year undercover investigation. In September 2004, state police arrested 26 members and seized more than $125,000 in cash, drugs and guns. On March 9, 2006, law enforcement conducted \"Operation 22 Green\", which involved 700 personnel from Bureau of Alcohol, Tobacco, Firearms and Explosives and local police and sheriff's departments. The operation resulted in the arrest of 25 Vagos members and associates for violating firearms and drugs policies. It was \"one of the largest coordinated law enforcement probes ever conducted in Southern California\". The investigators seized 95 illegal firearms, illegal drugs, $6,000 cash, and two stolen motorcycles. An ATF agent called the group a \"ruthless criminal bike gang\" that deals in \"guns, drugs, and death.\" Operation 22 Green and its lead-up were used as the basis for the first season of the television series Gangland Undercover.\n\nIn December 2007, police arrested six Vagos members for \"charges of first-degree burglary, second-degree robbery, coercion and second-degree kidnapping\" that occurred in August 2007. The victim had announced he was leaving the club, but suffered a beating at the Custom Motorcycle auto shop in Grants Pass, Oregon, and was then taken to his home where they attempted to rob him they failed. In February 2010, the ex-president of the chapter involved was acquitted of all charges relating to robbery assault and kidnapping.\n\nThree Vagos members were arrested on June 9 and 10, 2009, and charged with sexually assaulting a woman in San Jose, California. Police investigators told the San Jose Mercury News that the victim met the three men in a nightclub on May 4, 2009, and that they had offered to drive her home, but instead they took her to the Vagos clubhouse on Kings Row where she was beaten and sexually assaulted.\n\nOn August 13, 2011 law enforcement authorities reported that the Vagos Motorcycle Club and the Galloping Goose Motorcycle Club were involved in a shootout which shut down traffic on I-44 near Waynesville, Missouri. The local 9-1-1 center received about 20 calls, which reported that approximately 20 men were fighting, and that shots had been fired."}]}