{"The Vagos have a presence in the United States, Mexico, and Canada.": [{"url": "https://www.history.co.uk/shows/outlaw-chronicles-hells-angels/articles/history-of-the-vagos-mc", "page_content": "History of the Vagos MC\n\nThe year is 1965. USA are in the middle of the Vietnam War, Martin Luther King has recently marched from Selma to Montgomery and Roger Miller’s ‘King of the Road’ is number one. Thirteen bikers meet on the corner of Eighth and Davidson in San Bernardino, California to form the Vagos Motorcycle Club, beginning a history that would involve drug trafficking, clashes with the police and a violent rivalry with the Hells Angels.\n\nThe elected president was Rudy Esparza, nicknamed Puro, who led the new club in selecting their name. Other names considered included Coffin Dogers MC and Satan’s Saints MC, but Vagos MC, Spanish for vagabond, was chosen. Their new patch, a red devil on a green background, was inspired by an image of a devil in LIFE magazine entitled ‘Return from hell.’\n\nMore Outlaw Motorcycle Gangs (OMGs) were established in the 1960s than in any other decade. The outlaw status is given to groups who are not sanctioned by the American Motorcyclists Association (AMA). They are also known as 1%ers, a term which originated after the Hollister biker riot in 1947 when the AMA allegedly claimed the 99% of bikers were law abiding citizens, although the AMA have no record of issuing this as an official or public statement.\n\nBikers would often move between clubs or find their club being absorbed into a larger club. Puro had previously been with the Psychos MC and others joined from clubs including El Diablo MC. The question of whether the Vagos would absorb or be absorbed was very quickly answered as more Chapters sprang up across California. In 2014 the FBI listed the Vagos as one of the largest Outlaw Motorcycle Groups in Western America with 600 members in 24 Chapters throughout America, as well as Chapters in Canada, Mexico and Europe.\n\nThe Mafia on wheels?\n\nDescribed by Vagos infiltrator Charles Falco as “the mafia on wheels” the Vagos have more than earned their 1%er patch. Drug related arrests have been made throughout their colourful history. In 1987 the head of the South Bay Chapter and President of the Desert Hot Springs Chapter along with three others all pleaded guilty to conspiracy to distribute methamphetamines. Over 40 pounds of cocaine and eight pounds of methamphetamines (and a rocket launcher!) were seized in a 2011 raid. And in 2014 four Vagos members were arrested by the FBI for selling methamphetamines.\n\nAlongside money laundering and weapons trafficking, the Vagos are also known for their general violence, especially with rival OMGs. As the Vagos attempted to expand their territory tension erupted between them and other OMGs most notably the Hells Angels. In 2001 a bloody melee broke out between the Vagos and the Angels in the Californian city of Costa Mesa. And in 2010 an argument over which gang got to hang out in the Starbucks in Santa Cruz escalated. A brawl outside the coffee shop led to a gunfight in Chino Valley, several drive by shootings and a bitter feud.\n\nThe authorities have successfully infiltrated the Vagos a number of times. George Rowe, a street criminal whose friend had disappeared after an incident with the Vagos, volunteered to go undercover as part of Operation 22 in 2003. His evidence gathered over 3 years resulted in 42 arrests and convictions for crimes as serious as murder. Whilst Charles Falco worked his way up to number two of the Victorville Chapter and provided the ATF (Bureau of Alcohol, Tobacco and Firearms) gathering enough information to make 62 arrests for crimes including assault and murder. Fun fact, both Rowe and Falco have written books about their experiences and actually appear as characters in each other’s books.\n\nHowever the Vagos have their own weapon in their ongoing battle with the police- the lawsuit. In 1990 the Vagos sued the police and received a $2 million settlement claiming they were targets of massive police abuse in the early eighties. And in 2010 when the Vagos were blamed for a spree of homemade booby traps that targeted the police, they once again sued and received a settlement that included a public statement and the return of property seized the previous year.\n\n1%ers\n\nAs with all criminal groups the Vagos don’t advertise their more notorious crimes. Their PR website vagosmcworld.com, presents them as a club rather than a gang. Their consistent response to arrests is that it is not all of their members committing crimes, but a few bad apples. So, organised crime syndicate or a club where just 1% of the 1%ers are giving them a bad name…?"}, {"url": "https://onepercenterbikers.com/vagos-mc-motorcycle-club/", "page_content": "Vagos MC is a one percenter motorcycle club founded in San Bernardino, California in 1965. The motorcycle club are also known as the Green Nation and have a strong presence in the USA and Mexico, but have also expanded to many other countries.\n\nVagos MC History\n\nVagos MC was founded in San Bernardino, California in 1965. Like many other motorcycle clubs of the time, the Vagos Motorcycle Club was founded by a group of members who had returned from World War II and enjoyed riding their Harley Davidson motorcycles. This particular group were originally members of a different motorcycle club, the Psychos (Redlands) Motorcycle Club. After some infighting a few of the members decided to leave and form their own club, which then became the Vagos Motorcycle Club.\n\nThe original members were Rudy “Puro” Esparza (President), Gil Carrasco (Vice President), Whitey (Secretary/Treasurer), Lucky (Sgt. at Arms), Freddy Ruiz, Harley Hog, Animal, Crazy John Estrada, Tom Tom, Moose, Squirrel, Alex Estrada, and Little John Bocanegra.\n\nThe founders of Vagos Motorcycle Club had a Mexican heritage, which led to the color green being selected for the club. The word “Vagos” in Spanish means “vagabond”, “gypsy” or “travelling person”, someone who is always up to something. Two other names for the club were considered, Coffin Dodgers MC and Satan Saints MC.\n\nThe first chapter to open was in San Bernardino, California, which is nicknamed the “Berdoo” chapter. San Bernardino was a hot spot for founding motorcycle clubs, also founded in the area were the Hells Angels Motorcycle Club.\n\nThe second chapter was the Vagos Motorcycle Club Victorville chapter, which involved patching over of Cossacks Motorcycle Club.\n\nThe third chapter was the Vagos Motorcycle Club Los Angeles chapter, made up of members from the Talons Motorcycle Club.\n\nThe fourth chapter was the Vagos Motorcycle Club San Gorgonio Pass chapter, started by some of the Berdoo chapter members and their friends.\n\nThe fifth chapter was the Vagos Motorcycle Club SGV (San Gabriel Valley) chapter. This was made up of past members of Dirty Dozen MC, Highwaymen MC, Verdugos MC, Vendettas MC and Ghostmen MC.\n\nThe sixth chapter was the Vagos Motorcycle Club Monterrey chapter, consisting of past members of Sabers MC, Dirty Dozen MC and Highwaymen MC.\n\nThe seventh chapter was the Vagos Motorcycle Club Pomona Valley chapter, with members of Nacoda Breed MC.\n\nThe eighth chapter was the Vagos Motorcycle Club Antelope Valley chapter, where members came from Brothers MC.\n\nChapters in Mexico then opened approximately 15 years later in Mexicali, Mexico.\n\nIn 2013 Vagos Motorcycle Club opened chapters in Australia and Sweden.\n\nThe majority of members of the one percenter motorcycle club are Caucasian or Hispanic.\n\nVagos MC Patch / Motto\n\nThe Vagos Motorcycle Club patch consists of the Norse god of Mischief, Loki. He is depicted riding a motorcycle. The Vagos Motorcycle Club patch was designed by a member of the Berdoo chapter who was in prison at the time.\n\nThe Vagos MC motto is “We Give What We Get”.\n\nOne of the Vagos Motorcycle Club abbreviations is 22, as the 22nd letter in the alphabet is the letter “V”.\n\nThe Vagos Motorcycle Club colors are green, which links back to the Mexican heritage of the Vagos Motorcycle Club founder.\n\nVagos also use the motto “VFFV”, meaning “Vagos Forever, Forever Vagos”. This format is used by many clubs, for example the Bandidos “BFFB”.\n\nVagos MC Chapters\n\nVagos are spread throughout the world, with a strong presence both in Southern California and Mexico.\n\nVagos Motorcycle Club United States Chapters Vagos Berdoo San Bernardino, California chapter Vagos Victorville chapter Vagos Los Angeles chapter Vagos San Gorgonio Pass chapter Vagos Hollywod chapter Vagos Sacramento chapter Vagos San Jose chapter Vagos Compton chapter Vagos Pasadena chapter Vagos SGV (San Gabriel Valley) chapter Vagos Monterrey chapter Vagos Pomona Valley chapter Vagos Antelope Valley chapter Vagos Venice chapter Vagos Central Valley, Stockton, California chapter Vagos New York chapter Vagos Nomads chapter Vagos Arizona chapter Vagos New Mexico chapter Vagos Illinois chapter Vagos Utah chapter Vagos Florida chapter Vagos Arkansas chapter Vagos Mojave chapter\n\n\n\nVagos Motorcycle Club Mexico Chapters Vagos Ocotlan chapter Vagos Hormiga Tlalpan chapter Vagos Coronel chapter Vagos Malpaatla chapter Vagos Tonito chapter Vagos Morelia chapter Vagos Centro chapter Vagos Guanajuato chapter Vagos Toluca chapter Vagos Zamora chapter Vagos Alvaro Obregon chapter Vagos Coyocan chapter Vagos Tlaquepaque chapter Vagos Zapopan chapter Vagos Guadalajara chapter\n\n\n\nVagos Motorcycle Club Australia\n\nVagos Motorcycle Club Canada\n\nVagos Motorcycle Club Brazil\n\nVagos Motorcycle Club Europe Chapters Vagos Scandinavia chapter Vagos Nomads Europe chapter Vagos United Kingdom chapter Vagos Germany chapter Vagos Switzerland chapter\n\n\n\nFamous Vagos MC Members\n\nRudy “Puro” Esparza – Founder/President\n\nBorn November 16, 1935 and died August 14, 2013 in Joshua Tree, California. He was one of the Vagos Motorcycle Club founders and the first President.\n\nVagos MC Crime / In The Media\n\n1974 – 4 members of Vagos Motorcycle Club are convicted of murder and sentenced to death for the murder of William Velten, a student at the University of Mexico. Richard Greer, Ronald Keine, Clarence Smith and Thomas Gladish were on death row for 17 months, however were saved when Kerry Rodney Lee confessed to the murder.\n\n1998 – Over a dozen members of the motorcycle club are arrested for kidnapping as well as on drugs and weapons charges after a two year investigation by undercover agents.\n\n2002 – The ex-wife of a police detective in Pomona, California attempts to hire a member of the Vagos Motorcycle Club to murder he ex-husband. The motorcycle club contacted the police and advised of the situation.\n\n2004 – 26 members of the one percenter motorcycle club are arrested and $125,000 in cash, weapons and drugs is found.\n\n2006 – March 9, 2006, an operation titled “Operation 22 Green” is conducted where 700 ATF, local police and sheriff departments came together to arrested 25 members of the club.\n\n2007 – December, 2007. 6 members of the motorcycle club are arrested for burglary, robbery, coercion and kidnapping in crimes occurring in August 2007. The crime involved a member of Vagos Motorcycle Club who wanted to leave, so was then beaten, kidnapped and robbed.\n\n2009 – June, 2009. 3 members of the motorcycle club are arrested on June 9 and June 10 and charged with sexually assaulting a woman in San Jose, California.\n\n2009 – December 31, 2009. The unmarked headquarters of the Hemet Gang Task Force was filled with natural gas via a hole in the roof. The gas was detected by two members of the law enforcement group and they exited the building quickly without causing any explosion. A day before this event the Vagos Motorcycle Club had been next door at a church, attending a funeral for one of their members.\n\n2010 – February 23, 2010. A member of the Hemet Gang Task Force opens a security gate at the complex and a homemade gun booby trapped to the gate fires, nearly hitting the task force member in the head.\n\n2010 – March 5, 2010. A member of the Hemet Gang Task Force returns to his unmarked police car which was parked outside of a convenience store. He discovers that there is a homemade pipe bomb which has been hidden underneath the car.\n\n2010 – March 17, 2010. Police arrest 30 members of the Vagos Motorcycle Club in relation to the attempted attacks on the Hemet Gang Task Force on December 31, 2009, February 23, 2010 and March 5, 2010. As part of these arrests there were also raids in Arizona, California, Nevada and Utah across 73 locations. Multiple weapons were found in the raids, along with the discovery of a meth lab. A $200,000 reward was posted by law enforcement for information regarding the attacks on the Hemet Gang Task Force, which at the time were labelled as “urban terrorism”.\n\n2011 – March, 2011. Vagos Motorcycle Club sues the Riverside County Law Enforcement or defamation in relation to the attacks on the Hemet Gang Task Force. On August 1, 2011 the case was settled and ties between the club and the attacks removed. Law enforcement arrested two people unrelated to the club for the attacks.\n\n2011 – August, 2011. Vagos Motorcycle Club are involved in a shooting with Galloping Goose Motorcycle Club near Waynesville, Missouri. The fight was said to involved approximately 20 people.\n\n2011 – September 23, 2011. Jeffrey Pettigrew, the Hells Angels San Jose chapter President is killed in a shooting involving members of Vagos Motorcycle Club. The event occurred at John Ascuaga’s Nugget, also known as the Nugget Casino Resort, in Sparks, Nevada. On September 29, 2011, Vagos Motorcycle Club member Ernesto Manuel Gonzales is arrested for the murder. Vagos Motorcycle Club Los Angeles chapter Vice President Gary Rudnick is also arrested in relation to the event and leader plead guilty to murder in the second degree.\n\n2017 – 16 June, 2017. 23 members of the Vagos Motorcycle Club, including several high ranking officers, are arrested in an operation that spread across California, Hawaii and Nevada and are accused of murder, racketeering, kidnap, assault and drug dealing. Some of the arrested are believed to have been involved in the 23 September 2011 shooting of Jeffrey Pettigrew.\n\nThe arrested men were: Pastor Fausto Palafox, aka ‘Tata’, Albert Lopez aka ‘Al’, Albert Benjamin Perez, aka Dragon Man, James Patrick Gillespie, aka Jimbo, Andrew Eloy Lozano, aka Hulk, Ernesto Manuel Gonzalez, aka Romeo, Victor Adam Ramirez, aka Slick, James Walter Henderson aka CJ, Steven Earl Carr, aka Big Steve, Robert Alan Coleman, aka Mayhem, Jeremy John Halgat, aka Maniak, Paul Jeffrey Voll, aka Shyster, John Joseph Siemer, aka Rocky, Bradley Michael Campos, aka Candy Man, Cesar Vaquera Morales, aka C, Diego Chavez Garcia aka Boo, Edward Claridan Chelb, aka Recon, Johnny Russell Neddenriep aka Johnny Bolts, Darin Kieth Grieder, aka Midget, Thomas Granville Garretson, aka Tommy Guns, Bert Wayne Davisson, aka Flash, Matthew Keith Dunlap, aka Big Mat, and John Chrispin Juarez, aka Quicky.\n\n2017 – 29 July, 2017. In Santa Fe, New Mexico, Vagos MC member David Andrew Cordova and his son David Ray Cordova fire over 20 shots from a car at a home of a Bandidos MC member. David Andrew Cordova is shot and injured in the arm during the incident, however it is not clear who fired the shot that hit him.\n\nVagos MC Enemies and Allies\n\nVagos MC Enemies:\n\nVagos MC Allies:\n\nMongols MC are allies\n\nVagos Books:\n\nVagos Book – Vagos, Mongols, and Outlaws: My Infiltration of America’s Deadliest Biker Gangs by Charles Falco and Kerrie Droban.\n\nCharles Falco was a large scale methamphetamine dealer in 2001, reportedly earning $500,000 a year, when he was arrested by law enforcement and provided a deal by the ATF to infiltrate outlaw motorcycle clubs. First it was Vagos MC, where he rose to the role of “Officer” (second in charge) in the Victorville, California chapter. He later joined the Mongols and lastly the Outlaws where he became the Petersburg, Virginia Vice President. Find out more on Amazon (link opens in a new tab).\n\nGods of Mischief: My Undercover Vendetta To Take Down The Vagos Outlaw Motorcycle Club by George Rowe.\n\nAn account of how the author assisted the government by infiltrating Vagos MC. A view looking in from an outsider, with discussion of the author’s troubled childhood and his personal struggle. It doesn’t make our list of the best outlaw motorcycle books, but there aren’t too many books around covering Vagos. Find out more on Amazon (link opens in a new tab).\n\nTerry the Tramp: The Life and Dangerous Times of a One Percenter by K. Randall Ball (Easyriders magazine writer Keith “Bandit” Ball)\n\nThis is the biography of Terry Orendorff. Terry “The Tramp” is the former International President of Vagos MC, a position which he held for several decades. The book takes you through his life, but also provides an insight into the biker culture, particularly around the 1970s and 1980s. Find out more on Amazon (link opens in a new tab).\n\nRead More:\n\nPlease help us out by hitting the “Share” button so that we can keep bringing you more articles and “Follow” us on Facebook so that you get updated when we release new articles."}, {"url": "https://markozen.com/2021/10/12/notorious-motorcycle-gangs-in-the-united-states-and-canada/", "page_content": "\n\n10 most infamous gangs in the United States\n\n#10 Vagos\n\nThe Vagos Motorcycle Club was started in San Bernardino, CA in the 1960’s. Members of the club often wear green and bear a patch of the Norse god Loki riding a motorcycle. The club has approximately 24 chapters spread across the western United States in states such as Arizona and Nevada and also 3 in Mexico.\n\nThe Vagos have been the subject of several investigations by the FBI and the ATF for illegal activity such as the production and distribution of methamphetamine, murder, money laundering and weapons violations. A highly coordinated investigation in March of 2006 led to the arrests of 25 Vagos members and their associates in what has been labeled as the largest investigation in Southern California’s history.\n\n#9 Free Souls\n\nThis particular motorcycle gang was started in the state of Oregon in the late 1960’s. Their patch consists of an ankh, an ancient Egyptian symbol in the shape of a cross, in the center of a motorcycle rim and tire. All of their chapters, with the exception of one in Vancouver, Canada, are located within the state of Oregon.\n\nOn May 2, 2007, three members of The Free Souls Motorcycle Club were arrested and charged with various crimes. Amongst the evidence were illegal drugs, weapons and stolen motorcycles all of which were seized as part of the investigation and arrests.\n\n#8 Bandidos\n\nFounded in San Antonio, TX in 1966 The Bandidos are among the more notorious of American Motorcycle Clubs. The gang’s patch bears a cartoon-ishly obese Mexican wearing a large sombrero and carrying a machete in one hand and a pistol in the other. The colors of gold and red were adopted as the club’s colors due to the fact that their founder was a former Vietnam Marine veteran. The Bandidos have around 90 chapters spread across the U.S. alone, but they have also branched out as far as Asia, Germany and Australia.\n\nThe Bandidos gang has a long and brutal history of illegal activity. A member of The Bandidos was arrested, tried and convicted of the 2006 murder of a well known flyweight boxer and a member of the rival Hell’s Angels Motorcycle Club was sniped while leaving a restaurant in March of that same year during The Bandidos 40th Anniversary of the clubs annual birthday celebration. Police suspect that members of The Bandidos are responsible for the murder. Other members have been arrested from anything from murder to drugs and illegal weapons possession as well as assault and racketeering charges.\n\n#7 Highwaymen\n\nThe Highwaymen were formed in Detroit, MI in 1954. Their chapters have spread across the state of Michigan as well as other U.S. states and have reached as far as Norway and England. Their club colors are black and silver and their insignia is a winged skeleton wearing a motorcycle cap and a leather jacket. The Highwaymen also have their own mottos which are: “Highwaymen Forever, Forever Highwaymen” and “Yea, though we ride the highways in the shadows of death, we fear no evil, for we are the most evil mother fuckers on the highway.”\n\nDespite being the largest motorcycle club in the city of Detroit, they are not acknowledged in the Detroit Federation of Motorcycle Clubs due to their violent and criminal reputation. In May 2007, after a two year investigation into the gang’s activities, the FBI raided homes and chapter clubhouses resulting in the arrests of 40 Highwaymen and associates. The charges included insurance and mortgage frauds, murder for hire, cocaine trafficking, police corruption and racketeering.\n\n#6 Warlocks\n\nThe Warlocks were founded in 1967 in Philadelphia, PA and gained a large number of members after the end of the Vietnam War. Consisting only of white males, The Warlocks have spread through the state of Pennsylvania and a good portion of the northeastern United States and also have chapters in the southeast United States as well as overseas in Germany and England. Their club colors are red and white and they use the Greek mythological figure of a winged Harpy as their insignia. Members often adorn themselves and their vests with white supremacy insignia as well.\n\nIn 2008, Tommy Zaroff, a former President of the Bucks County, PA chapter was arrested on suspicion of possessing 10 pounds of methamphetamine. In October of the same year four members of The Warlocks were arrested and charged with producing, transporting and distributing methamphetamine throughout Berks and Montgomery Counties in Pennsylvania. It is alleged that they sold over 500 lbs. of methamphetamine worth approximately $9 million.\n\n#5 Sons of Silence\n\nThe Sons of Silence are another “1%er” motorcycle gang that was founded in Niwot, Colorado in 1966 and featured in a 2009 episode of Gangland on The History Channel. Since 1966 The Sons of Silence have spread across the United States, with concentrations in the eastern U.S. They also have several chapters spread throughout Germany.\n\nThe Sons of Silence have adopted the motto “Donec Mors Non Seperat”, which is Latin for “Until Death Separates Us”. The club patch has been adopted from the American Eagle logo used by the Budweiser beer company and bears an eagle superimposed over the letter A with their motto underneath.\n\nIn October of 1999, 37 members of the Sons of Silence were arrested on drug trafficking and illegal weapons charges during one of Denver’s largest federal undercover operations. During the raids, The ATF seized 20 lbs. of methamphetamine, 35 firearms, four hand grenades, 2 silencers as well as cash and motorcycles.\n\n#4 Outlaws\n\nThe Outlaw Motorcycle Club is one of the more notorious and oldest clubs on this list. The gang started in Matilda’s Bar on old Route 66 in McCook, IL in 1935. Using the insignia on Marlon Brando’s leather jacket in The Wild One as inspiration, the club adopted the skull with cross pistons as their official club patch. Since the club began over 70 years ago their chapters have spread widely across the United States and have been well established in Australia, Asia, Europe and North and South America.\n\nHarry Joseph Bowman, The World Leader of The American Outlaw Association (A.O.A.), was the international president of The Outlaws Motorcycle Club and presided over 30 chapters in the U.S. and 20 chapters in 4 other countries until he was sent to prison for 3 murders in 1999 after being on the F.B.I’s Top 10 Most Wanted Fugitive list in 1998. Across the globe members of The Outlaws have been suspected, arrested, tried and convicted of countless crimes from prostitution, trafficking in narcotics and stolen goods, arms dealing, extortion and murder.\n\n#3 Pagans\n\nThe Pagans formed in Maryland in 1959 and by 1965 had expanded rapidly. Their patch depicts the Norse fire giant Surtr sitting on the sun wielding a sword with the word Pagans in red, white and blue. Members are known to wear their patches on cut-off denim jackets with accompanying white supremacist and Nazi insignia patches. The club’s members have also been seen with tattoos of ARGO (Ar Go Fuck Yourself) and NUNYA (Nun’Ya Fuckin’ Business). Their territory seems to be confined strictly to the eastern coast in the United States.\n\nAside from their history of violent rivalry with the notorious Hell’s Angels Motorcycle Club, The Pagans have been associated with numerous crimes including murder, arson, drug smuggling and have been linked to organized crime in the upper northeastern United States. In February of 2002, seventy-three members of The Pagans Motorcycle Club were arrested in Long Island, NY after violence erupted at a motorcycle and tattoo ball. The Pagans allegedly went to the ball specifically to confront members of The Hell’s Angels MC resulting in 10 wounded bikers and one murdered Pagan member. Then in 2005, members of The Pagans allegedly shot and killed the Vice-President of the Philadelphia Chapter of The Hell’s Angels.\n\n#2 Mongols\n\nThe Mongols, also known as Mongol Nation or Mongol Brotherhood, were formed in 1969 in Montebello, California from Hispanic bikers who were refused entry into The Hell’s Angels MC due to their race. Their colors are black and white and their insignia bears the name Mongols in large black letters above a pony-tail sporting man riding a motorcycle wearing a leather vest and sunglasses while carrying a scimitar or cutlass. Mongol chapters are concentrated in the western United States, but have also opened in Canada, Mexico and Italy.\n\nIn 2008, the ATF coordinated a sting against The Mongols MC where 4 agents went undercover to become fully patched members while gaining intelligence about the gang’s activities. This operation resulted in 38 arrests including the arrest of the club’s president, Ruben “Doc” Cavazos. As part of the operation 160 search warrants were served and 110 arrest warrants were carried out. As part of the operation, members of The Mongols MC are now prohibited by law from the use of the Mongol MC logo and insignia including wearing the patches on vests or any other garb.\n\n#1 Hell’s Angels\n\nProbably the most well known American biker gang, The Hell’s Angels have a long and thorough history on American highways. Much information concerning their origins is hazy due to their long-standing code of secrecy. Sometime within the 1940’s or 1950’s in California Hell’s Angels MC was formed. Their insignia is the “death’s head” logo which is copied from the insignia of the 85th Fighter Squadron and the 552nd Medium Bomber Squadron. Red lettering over white backgrounds stands for the club’s colors. With so much popularity, Hell’s Angels chapters have sprung up across the Untied States as well as Russia and New Zealand and the continents of North America, South America, Europe and Australia.\n\nThe Hell’s Angels MC have gained mass notoriety in the U.S. due to their involvement in many highly publicized run-ins with the law and rival biker gangs. The most note-worthy of publicized events happened during the Altamont Free Concert at Altamont Speedway in December of 1969 where it is alleged that The Rolling Stones hired members of The Hell’s Angels to stand-in as bodyguards for the band. Violence erupted in the crowd and also onto the performance stage and as a result one male was stabbed to death after brandishing a pistol.\n\nAnother publicized incident occurred in Laughlin, Nevada in Harrah’s Casino and Hotel. A violent confrontation in the casino between rival Mongols MC resulted in one fatally stabbed Mongol gang member and two fatally shot Hell’s Angels members.\n\nHonorable mention: The Pissed off Bastards of Bloomington\n\nThe Pissed Off Bastards of Bloomington (POBOB) is a motorcycle club that, in 1947, along with the Boozefighters and the Market Street Commandos, participated in the highly publicized Hollister riot (later immortalized on film as The Wild One).\n\nAfter the Hollister incident, a prominent Pissed Off Bastard named Otto Friedli (28 Jun 1931 – 17 Mar 2008) split with the club and formed his own group on March 17, 1948 in Fontana, just west of San Bernardino. He called it the Hells Angels Motorcycle Club. In 1954 Otto’s new club merged with the Market Street Commandos to become the Hells Angels San Francisco Chapter.\n\nCanada\n\nHells Angels\n\nCriminal Intelligence Service Canada describes the Hells Angels as the largest “outlaw motorcycle gang” in the country, with active chapters concentrated mostly in Quebec, Ontario and British Columbia.\n\nIn its 2004 report, CISC said the Angels derives “significant financial income” from criminal activities such as prostitution, fraud and extortion but primarily relied on drug trafficking for income.\n\nThe gang moved into Ontario in 2000. Before that, its only presence in the province was with a chapter of the Nomads, the club’s elite branch. The Nomads doesn’t tie itself to geographical locations and doesn’t have formal clubhouses, like other chapters.\n\nWithin a year, the Angels had absorbed members of the Para Dice Riders, Satan’s Choice and Last Chance, giving them at least 100 members in the Toronto area — the highest concentration of Hells Angels in the world.\n\nIn mid-April 2009, police targeted more than 150 people linked with the Hells Angels in early-morning raids mostly in Quebec, but also in New Brunswick, France and the Dominican Republic. They also seized four suspected Hells Angels bunkers.\n\nBandidos\n\nIt’s considered world’s second-most powerful criminal biker gang, with more than 2,000 members in 14 countries, according to NGIC’s 2009 report, which describes the Bandidos as a “growing criminal threat.”\n\nThe Bandidos was founded in the 1960s in Texas. The club’s old guard was said to be against its absorption of the Rock Machine’s Ontario branches for fear of igniting the same kind of war with the Hells Angels that gripped Quebec for much of the 1990s and left at least 150 people dead.\n\nIn April 2006, eight people — all Bandidos members or associates — were found dead in a farmer’s field near the small town of Shedden, Ont., about 30 kilometres southwest of London. Police said the killings virtually wiped out the Toronto chapter of the Bandidos.\n\nOutlaws\n\nFirst established in the United States in 1935, the gang came to Canada in 1978 when several chapters of Satan’s Choice in Montreal changed allegiance and set up shop as the Outlaws Motorcycle Club of Canada. The group is known to detest members of the Hells Angels.\n\nRock Machine\n\nSecond only to Hells Angels in Quebec. A long-running turf war with the Angels left more than 150 people dead as the two fought over the lucrative trade in illegal drugs. The war also led to the passage of anti-gang legislation by the federal government.\n\nAs the Hells Angels expanded into Ontario, so did the Rock Machine. The organization established three chapters. In 2001, it aligned itself with the Bandidos.\n\nSatan’s Choice\n\nOnce one of Ontario’s strongest motorcycle gangs, Satan’s Choice became part of the Hells Angels’ 2000-2001 expansion into Ontario. Satan’s Choice had branches in Keswick, Kitchener, Oshawa, Sudbury, Simcoe County, Thunder Bay and Toronto — but nothing outside the province.\n\nPara Dice Riders\n\nAnother group that was once among Ontario’s strongest biker gangs. Its membership was limited to the Toronto area. The group was absorbed by the Hells Angels in 2001, when the Angels moved into Ontario.\n\nLast Chance\n\nAnother small Ontario-based biker gang that agreed to switch over to the Hells Angels when the world’s most power biker gang moved into the province\n\nLobos\n\nOriginally concentrated in the Windsor, Ont., area, the Lobos motorcycle gang decided to take up the Hells Angels on its offer of merger in 2001.\n\nLoners\n\nThe Loners Motorcycle Club was founded in Ontario in 1979 with a handful of chapters, including a now-defunct one in southwestern Ontario that was headed by Wayne Kellestine. As part of its Ontario expansion drive, the Hells Angels tried to persuade the St. Thomas Loners chapter to join the Angels. Kellestine — who was injured in an assassination attempt in 1999 — resisted.\n\nThe club has expanded to the United States and Europe, but in Ontario, its highest profile in recent years was a legal fight by a Toronto chapter to keep its mascot on its property north of the city, in 2001. The neutered, declawed lion named Woody was moved to an animal sanctuary.\n\nVagabonds\n\nAnother Ontario-based motorcycle gang that was more or less absorbed by the Hells Angels when it expanded into Ontario in 2000-2001.\n\nThe Red Devils\n\nSaid to be the oldest motorcycle gang in Canada, the group is made up of a couple of dozen members concentrated in the Hamilton, Ont., area."}, {"url": "https://moneyinc.com/most-popular-motorcycle-clubs-in-the-united-states/", "page_content": "Some motorcycle clubs are infamous for their connection to drugs, organized crime, and living outside the law. Others are simply groups of like-minded, law-abiding citizens who just love to ride.\n\nRegardless of the club in question, wearing its color says something about who you are, what your values are, and what kind of lifestyle you’re chasing. Here, we take a look at the 10 most popular motorcycle clubs in the United States.\n\n1. The Outlaws\n\nThe Outlaws is one of the biggest, baddest clubs around. As one of the infamous “Big Four” outlaw motorcycle clubs, its connection with crime runs just as deep as its connection to motorcycles.\n\nFrom its very inception in 1935, its members have prided themselves on their status as the original ‘outlaws’ (hence the name), while their rivalry with the Hells Angels has been going on for almost as long as both clubs have been around. Based on current estimates, it’s thought there are around 200 chapters and several thousand members across the country.\n\n2. The Pagans\n\nThe Pagans is an outlaw motorcycle club founded by Lou Dobkin in 1959. As thecheapplace.com writes, Dobkin wasn’t your typical ‘outlaw’ in some respects – during the day, he worked as a senior biochemist at the National Institute of Health.\n\nBut on the weekends, he could be found racing around the highways with his denim-wearing buddies. By the late 60s, the club had evolved into your archetypal big, bad outlaw group.\n\nIt’s spent most of the subsequent decades squabbling over territory with the Hells Angels. With thousands of members to its name, the club is active across Delaware, Florida, North Carolina, Ohio, Pennsylvania, Kentucky, Maryland, Virginia, Massachusetts, Connecticut, New Jersey, New York, South Carolina, Rhode Island, and West Virginia. It’s also got a big presence in Puerto Rico.\n\n3. Bikers Against Child Abuse\n\nIf you thought motorcycle club members were all mad, bad, and dangerous to know, the members of the Bikers Against Child Abuse should come as a welcome relief. The club has developed around the mission statement of helping abused children around the world.\n\nWorking alongside official state authorities and philanthropic foundations, it matches abused kids to two members of the group so the child always has someone to call on if assistance is needed.\n\n4. The Iron Order Motorcycle Club\n\nAs hotcars.com writes, the Iron Order Motorcycle Club was founded in 2004 by a group of law enforcement officers committed to upholding the law and helping people in need wherever they found them – a brotherhood of superheroes, if you will.\n\nTheir carefully cultivated image took a bashing when two unarmed members of the club were shot dead by other club members, and repeated allegations of other criminal activities started to emerge.\n\nThe club has been eager to suppress the rumors (for obvious reasons), and in fairness, the allegations have died down over recent years.\n\n5. The Mongols\n\nThe Mongols were formed in 1969 by a group of Hispanic Vietnam veterans. Originally based in Montebello in the San Gabriel Valley in Los Angeles, California, the group has since spread throughout the US.\n\nIt’s believed there are now between 1000 and 1500 official members in the US, along with a few hundred in Australia. Unlike most other major clubs, the Mongols have chosen to feature an actual motorbike and rider on their patch – a black on white emblem sporting a rider in shades straddling a cruiser.\n\n6. The Vagos\n\nThe Vagos (or the ‘Green Nation’, as they’re sometimes referred to) is the biggest motorcycle club in the Southwest. They also have a foothold in Ontario, Canada, Mexico, and Europe. In total, it’s believed there are 4,000 members of the club worldwide.\n\nLike most clubs, their name is more than just a name – in Spanish, Vagos is the term used to describe those who eschew the status quo and embrace a free, nomadic lifestyle unrestricted by convention or the law.\n\n7. The Bandidos\n\nFormed in 1966 in Texas, the Bandidos Motorcycle Club consists of 2,400 members spread over 22 different countries around the world. Despite the cartoon character on their patch suggesting a jolly side, the Bandidos reputation is far from jovial.\n\nAs a member of the Big Four, they’re known to regularly engage in turf wars with rival groups and indulge in the occasional bout of drug trafficking. Basically, when your mother warned you about the dangers of mixing with the wrong kind of crowd, she was thinking of the Bandidos.\n\n8. The Hells Angels\n\nThe Hells Angels might not be the biggest motorcycle club in the US (all in all, there’s estimated to be around 2300 members, including those in other countries), but they’re inarguably the most famous.\n\nWhen people think of motorcycle culture, they think of the Hells Angels, and they have done ever since the club’s heyday in the 1960s. Despite numerous attempts by the authorities to bring the club down, it’s still going strong.\n\nOver 70 years after it was conceived, it’s still as infamous for its turf wars, its drug trafficking, and its reckless abandon of convention as it ever was.\n\n9. Women in The Wind\n\nWomen aren’t exactly known for frequenting motorcycle clubs. In most clubs, they probably wouldn’t be all that welcome – which is exactly why an Ohio motorcyclist called Becky Brown decided to start her own all-women club in 1979.\n\nThe result was Women in the Wind, an organization that as motorcycleisland.com notes, has now grown to encompass more than 100 chapters and over 1200 members across the US, Great Britain, and Australia.\n\nUnlike some of their male counterparts, Women in the Wind promote the acceptable side of motorcycling, with a central aim of highlighting female motorcyclists in a positive way and educating its members on road safety and motorcycle maintenance.\n\n10. American Motorcycle Association\n\nThe American Motorcycle Association (AMA) isn’t just the largest motorcycle club in the US, it’s the largest in the entire world. With a membership that runs into the millions, the AMA is the loudest, proudest proponent of biker’s rights in the country.\n\nAnd unlike a lot of other groups, it prides itself on welcoming upstanding members of the community – so much so, in fact, it inadvertently gave rise to the notion of the 1% (i.e. the term used to describe the likes of the Hells Angels, the Bandidos, and other outlaw groups) when it boldly claimed that 99% of its members were law-abiding."}, {"url": "https://acp.copernicus.org/articles/22/395/2022/", "page_content": "We use methane observations from the GLOBALVIEWplus CH 4 ObsPack in situ data (Sect. 2.1) and/or GOSAT satellite retrievals (Sect. 2.2) with the GEOS-Chem chemical transport model (Sect. 2.4) as the forward model to optimize a state vector of mean methane emissions for individual years (Sect. 2.3) covering the North American continent at a spatial resolution of up to 0.5 ∘ × 0.625 ∘ . We derive posterior estimates of the state vector and the associated error covariance matrix by analytical solution to the Bayesian optimization problem (Sect. 2.5). Our base inversion uses GOSAT + in situ observations and our best choices of inversion parameters. We also present results from an ensemble of sensitivity inversions using observation subsets (in situ or GOSAT) and varying inversion parameter assumptions (e.g., different error distributions). We attribute inversion results to different methane emission sectors with the methodology described in Sect. 2.6.\n\n2.1 In situ methane observations We use the comprehensive database of in situ (surface, tower, shipboard, and aircraft) methane observations over North America for 2010–2017 from the GLOBALVIEWplus CH 4 ObsPack v1.0 product compiled by the National Oceanic and Atmospheric Administration (NOAA) Global Monitoring Laboratory (Cooperative Global Atmospheric Data Integration Project, 2019). Following Lu et al. (2021), data from surface and tower sites are sampled only during daytime (10:00–16:00 LT) and averaged as daytime mean values on individual days for use in the inversion. For sites with standard deviations larger than 30 ppb, we exclude data points that depart by more than 2 standard deviations from the mean because such local extreme conditions are difficult to simulate with the chemical transport model. For other sites we exclude data points that depart by more than 3 standard deviations from the mean. We also exclude aircraft measurements higher than 9 km a . s . l . as these measurements would have weak sensitivity to surface fluxes. The in situ observations thus include 49 742 data points from surface sites, 15 285 from towers, 56 from ship cruises, and 26 620 from aircraft campaigns over North America and adjacent waters (Fig. 1a). The number of available in situ observations per year increases from 10 830 in 2010 to 13 593 in 2017. All these in situ data points are used in the base inversion to optimize methane emissions for individual years. We also conduct sensitivity inversions by only using surface and tower sites with continuous 8-year records for trend analyses.\n\n2.2 GOSAT satellite methane observations The GOSAT satellite launched in 2009 measures the backscattered solar radiation from a sun-synchronous orbit at around 13:00 LT (Kuze et al., 2016). Methane is retrieved in the 1.65 µm shortwave infrared absorption band. We use the column-averaged dry-air methane mixing ratios from the University of Leicester version 9.0 Proxy XCH 4 retrieval (Parker et al., 2020a). Comparison with ground-based methane observations from the Total Carbon Column Observing Network (TCCON) shows that the retrieval has a single-observation precision of 13 ppb and an overall global bias of 9 ppb that is removed from the Proxy XCH 4 data (Parker et al., 2020a). Here we use a total of 205 875 (25 734 per year on average) GOSAT retrievals for 2010–2017 over North America in the inversion, excluding glint data over the oceans and data poleward of 60∘, which are not representatively sampled and for which errors are large (Fig. 1b).\n\n2.3 Prior emission inventories We use as prior estimates of anthropogenic methane emissions the gridded versions of the official national inventories for the US (EPA, 2016), Canada (ECCC, 2020a), and Mexico (INECC and SEMARNAT, 2018) (Maasakkers et al., 2016; Scarpelli et al., 2020, 2021). These emissions are listed in Table 1 for individual countries, and the spatial distributions for major sectors are shown in Fig. 2. We assume no year-to-year trend in the prior emissions so that trends from the inversion are solely driven by observations. Prior anthropogenic emissions for the contiguous US (CONUS) are 28.7 Tg a−1. Anthropogenic US emissions outside CONUS (mostly Alaska, not optimized in the inversion) account for only 0.3 Tg a−1 according to Maasakkers et al. (2016). The latest GHGI report from the EPA (2021) gives mean emissions of 26.0 Tg a−1 for 2010–2017. Prior anthropogenic emissions for Canada are 3.7 Tg a−1. The most recent 2021 version of the ECCC NIR gives a mean of 4.0 Tg a−1 for 2010–2017 (ECCC, 2021). Mexico anthropogenic emissions are 5.0 Tg a−1, and 2015 is the latest available year from INECC. Download XLSX Prior methane emissions from wetlands are the 0.5 ∘ × 0.5 ∘ gridded mean monthly values for 2010–2017 from the nine highest-performance members of the WetCHARTs v1.3.1 inventory ensemble (Ma et al., 2021), selected for their fit to the global GOSAT inversion results of Zhang et al. (2021). This choice of prior estimate effectively corrects the large overestimates of wetland emissions for North America previously found in inversions of GOSAT and aircraft data when using the overall mean of the WetCHARTs v1.0 ensemble (Sheng et al., 2018b; Maasakkers et al., 2021). We do not include interannual variability from WetCHARTs because it is highly uncertain and we prefer to have it informed by the observations. Unlike in our global inversion (Lu et al., 2021), we do not optimize the relative seasonal variation of wetland emissions and instead have it imposed by the prior estimate (Parker et al., 2020b). Prior estimates of open fire emissions are the daily values for individual years from the Global Fire Emissions Database (GFED) version 4s (van der Werf et al., 2017). Other small natural emissions (seepages, termites) are as described in Lu et al. (2021).\n\n2.4 The GEOS-Chem forward model We use the nested version of the GEOS-Chem 12.5.0 chemical transport model (http://geos-chem.org, last access: 6 April 2021) (Wecht et al., 2014) as the forward model for the inversion. The model is driven by MERRA-2 re-analysis meteorological fields at their native 0.5 ∘ × 0.625 ∘ resolution (Gelaro et al., 2017). Methane loss from atmospheric oxidation is as described in Lu et al. (2021) but is inconsequential here because it is negligibly slow compared to the timescale for ventilation of the North American domain. Soil uptake of methane is from the MeMo model v1.0 (Murguia-Flores et al., 2018) but is very small and therefore not optimized in the inversion. The GEOS-Chem model simulation is conducted at 0.5 ∘ × 0.625 ∘ resolution over the North America domain (130–55∘ W, 15–65∘ N) (Fig. 1) for the 2010–2017 period, with dynamic boundary conditions archived every 3 h from a global 2010–2017 simulation at 4 ∘ × 5 ∘ resolution using methane emissions and sinks previously optimized with GOSAT observations (Lu et al., 2021). This means that GOSAT observations over North America are used twice: once for the global inversion (along with other observations worldwide) and once for the North American inversion, but this is inconsequential because the sole purpose of the global optimization is to avoid biases in boundary conditions that would cause spurious corrections to emissions within the inversion domain (Wecht et al., 2014). Lu et al. (2021) show that their optimized simulation is unbiased in comparison to global zonal mean observations for 2010–2017, but we still find some residual biases for individual years up to 5 ppbv. We therefore optimize the mean boundary conditions for individual years on each side of the domain (north, south, west, east) as part of the North American inversion. The initial methane concentration fields on 1 January 2010 are from Lu et al. (2021), which have been adjusted to have an unbiased zonal mean relative to GOSAT observations such that model discrepancies with observations over our 2010–2017 simulation period can be attributed to model errors in emissions instead of errors in initial conditions.\n\n2.5 Inversion procedure Our state vector x to be optimized in the inversion includes spatially resolved emissions in North America and boundary conditions for each year of 2010–2017. Although we could technically optimize methane emissions for each of the 0.5 ∘ × 0.625 ∘ native model grid elements, the observations do not have sufficient coverage to constrain emissions everywhere at that resolution, and doing so would introduce large smoothing errors in the inversion (Wecht et al., 2014). Following Turner and Jacob (2015) and Maasakkers et al. (2021), we use instead a Gaussian mixture model (GMM) to determine the emission patterns that can be constrained effectively by the inversion. This is done by projecting the native-resolution methane emissions onto 600 Gaussian functions optimized to fit the location, magnitude, and distribution of methane emissions for different sectors as given by the prior estimates. Optimal construction of the GMM aggregates regions with weak or homogeneous emissions while preserving native resolution for strong localized source regions. The Gaussian functions overlap, providing additional high-resolution structure in the inverse solution on the 0.5 ∘ × 0.625 ∘ native grid. The state vector x for individual years is defined as the emission of each of the 600 Gaussians, plus the correction to the model boundary conditions as described earlier, for a total dimension n=604. The inversion finds the optimal estimate of x by minimizing the Bayesian cost function J(x) (Brasseur and Jacob, 2017): J ( x ) = x - x A T S A - 1 ( x - x A ) (1) + γ ( y - F ( x ) ) T S O - 1 ( y - F ( x ) ) , where x A is the prior estimate of x, S A denotes the prior error covariance matrix, y is the observation vector, S O denotes the observation error covariance matrix, γ is a regularization factor (see below), and F(x) represents the GEOS-Chem simulation of y. The GEOS-Chem forward model F(x) as implemented here is strictly linear (because methane sinks are not optimized) so that the model can expressed as y = K x + c , where K = ∂ y / ∂ x represents the Jacobian matrix and c is a constant. Minimizing the cost function (Eq. 1) by solving ∇ x J(x)=0 yields closed-form posterior estimates of the state vector x ^ , its error covariance matrix S ^ , and the averaging kernel matrix A (Rodgers, 2000; Brasseur and Jacob, 2017): (2) x ^ = x A + G ( y - K x A ) , (3) S ^ = ( γ K T S O - 1 K + S A - 1 ) - 1 , (4) A = ∂ x ^ ∂ x = I n - S ^ S A - 1 , where G in Eq. (2) is the gain matrix, (5) G = ∂ x ^ ∂ y = γ K T S O - 1 K + S A - 1 - 1 γ K T S O - 1 . The averaging kernel matrix A in Eq. (4) quantifies the sensitivity of the posterior estimate to changes in the true value and therefore measures the information content provided by the observing system for correcting the prior estimates and returning the true values as posterior estimates. We refer to the diagonal elements of A as the averaging kernel sensitivities and to the trace of A as the degrees of freedom for signal (DOFS) representing the number of pieces of independent information on the state vector obtained from the observing system (Rodgers, 2000). Our inversion returns the posterior estimates of mean emissions and averaging kernel sensitivities for each Gaussian, and these can be mapped additively to the 0.5 ∘ × 0.625 ∘ grid using their spatial distributions on the grid. The analytical solution to Eq. (2), and inference of error statistics and information content from Eqs. (3) and (4), requires explicit construction of the Jacobian matrix K. We construct K by conducting GEOS-Chem simulations in which each element of the state vector (methane emission and model boundary correction) is perturbed separately. This is readily done computationally as an embarrassingly parallel problem. The analytical solution has several advantages relative to the more widely used variational (numerical) approach. (1) It identifies the true minimum in the cost function. (2) It provides complete explicit forms of the posterior error covariance and averaging kernel matrices. (3) It enables a range of sensitivity analyses at no significant computational cost by modifying the inversion parameters and adding or subtracting observations. To construct the prior error covariance matrix S A , we assume a 50 % error standard deviation for individual Gaussians in the base inversion (and we test the sensitivity to that assumption, as will be described later), with no spatial error covariance so that S A is diagonal. There is necessarily some spatial covariance in the prior estimates since the Gaussians have spatial overlap, and there is also some spatial covariance in the forward model error contributing to S O , but these are difficult to quantify. The former would underestimate the information content of the observations, while the latter would overestimate it. We effectively correct for this using the regularization parameter γ as described below, and we further rely on our inversion ensemble rather than the posterior error covariance matrix to characterize the error in our posterior solution. The standard assumption of Gaussian error statistics in the cost function of Eq. (1) is required to achieve an analytical solution but may lead to unphysical negative emissions (Miller et al., 2014) and fail to capture the heavy tail of the emission distribution (Zavala-Araiza et al., 2015; Frankenberg et al., 2016; Alvarez et al., 2018). We solve this problem by optimizing for ln (x) instead of x, with the error on ln (x) following a normal Gaussian distribution, i.e., lognormal errors for x (Maasakkers et al., 2019). The forward model is then nonlinear so that the solution must be solved iteratively with a transformed Jacobian matrix K N ′ = ∂ y / ∂ ln ( x ) at each iteration N. Once the original Jacobian matrix K = ∂ y / ∂ x for the linear model has been computed, we can derive K N ′ immediately at any iteration by ∂ y i / ∂ ln ( x j ) = x j ∂ y i / ∂ x j , where i and j represent the indices of the observation and state vector elements, respectively. The iterative solution is obtained with the Levenberg–Marquardt method (Rodgers, 2000) for each iteration N: x N + 1 ′ = x N ′ + γ K ′ N T S O - 1 K N ′ + 1 + κ S ′ A - 1 - 1 (6) γ K ′ N T S O - 1 y - K x N - S ′ A - 1 x N ′ - x A ′ , where x ′ = ln ( x ) with the initial value x 0 ′ from the prior estimate, and κ=10 is a coefficient for the iterative approach to the solution (Rodgers, 2000). S A ′ (with diagonal elements denoted by s A ′ ) is the prior error covariance matrix for the inversion in log space and can be derived from the original prior error covariance matrix S A (with diagonal elements denoted by s A ) following (Maasakkers et al., 2019) (7) s A ′ = ln x A + s A x A + ln x A - s A x A 2 2 . We adopt as a convergence criterion that the maximum difference between x N + 1 ′ and x N ′ elements be smaller than 5 ‰, at which point we adopt x ^ ′ = x N + 1 ′ as our posterior solution. The posterior error covariance and averaging kernel matrices S ^ ′ and A′ on the log solution are obtained by replacing S A and K with S A ′ and K′ in Eqs. (3) and (4). Optimization of emissions in log space means that x ^ ′ is a best estimate of the median of the lognormal error distribution rather than the mean. The mean values for spatial and sectoral aggregation purposes can be inferred from the properties of the lognormal distribution as x j ( mean ) = x j ( median ) e s ^ j j ′ / 2 , where s ^ j j ′ is the corresponding diagonal element of the posterior error covariance matrix in log space, i.e., the geometric error standard deviation. The boundary conditions are still optimized with normal error distributions, assuming an error standard deviation of 10 ppb. The above describes our base inversion. We also conduct sensitivity inversions using different error assumptions. This includes (1) using the quadrature sum of error variances for all sectors contributing to a given Gaussian with a cap of 50 % following Maasakkers et al. (2021), resulting in a 43 % error on average; (2)–(4) using the normal error distributions (then with the linear Jacobian matrix) with 50 %, 95 %, and the quadrature sum of errors for individual Gaussians as error variances; and (5) assuming an error standard deviation of 5 ppb for boundary conditions. The observation error covariance matrix S O includes contributions from measurement and forward model errors. We compute it following the residual error method originally described by Heald et al. (2004) and previously used by Lu et al. (2021). A GEOS-Chem simulation with prior emission estimates yields a prior model estimate F(x A ) of concentrations at the observation points. The mean 2010–2017 discrepancy between the observations and the prior model, y - F ( x A ) ‾ , is determined for each grid cell (for GOSAT), individual observation site (surface and tower), and observation platform (shipboard and aircraft). y - F ( x A ) ‾ is taken to represent the systematic bias in the prior emissions to be corrected in the inversion. The residual term, ε O = y - F ( x A ) - y - F ( x A ) ‾ , represents the random observation error including contributions from the measurements, the forward model, and the representation of the observation points on the model grid (Heald et al., 2004). The variance of ε O provides the diagonal terms of S O . The resulting observation error standard deviations average 13 ppb for GOSAT, 26 ppb for surface sites, 39 ppb for towers, 19 ppb for ships, and 22 ppb for aircraft. The observation error is larger for in situ than for satellite observations, even though the in situ measurements are more precise, because the forward model error is larger for vertically resolved points (particularly for surface air in source regions) than for atmospheric columns (Cusworth et al., 2018). The observation error for in situ observations is dominated by the forward model error, while that for GOSAT is dominated by the measurement error. We do not have sufficient objective information to quantify the error correlation structure of S O , and we therefore assume it to be diagonal. This may underestimate S O because of correlated transport and source aggregation errors in the forward model, as noted above. We follow Zhang et al. (2018) to introduce a regularization factor γ for the observation terms in the cost function J(x) (Eq. 1) to avoid either overfits or underfits that would result from missing covariant (off-diagonal) structure in S O and S A , respectively. Lu et al. (2021) showed that the optimal value of this regularization factor can be selected such that the sum of the n prior terms in the posterior estimate of the cost function ( J A ( x ^ ) = ( x ^ - x A ) T S A - 1 ( x ^ - x A ) ) has a value ≈ n , which is the expected value from the chi-square distribution with n degrees of freedom. Here we determine the regularization factor γ separately for in situ and GOSAT data following Lu et al. (2021) and find that γ=1 is best for both. We also conduct a sensitivity inversion using γ=0.5 for the GOSAT observation terms (while keeping γ=1 for in situ data terms in the joint inversion) as adopted in Maasakkers et al. (2021). Download Print Version | Download XLSX Table 2 summarizes the settings of our base inversion (in bold) and the inversion ensemble. The ensemble comprises 33 inversions using the different combinations of settings in the table. The base inversion including GOSAT and in situ data represents our best estimate, but we will compare it prominently to the GOSAT-only and in-situ-only inversions with the same inversion parameters in order to evaluate the contributions from the different observing platforms for optimizing emissions. We will use the other ensemble members to discuss the sensitivity of inversion results to the choices of observations and inversion parameters, as well as to define the range of uncertainty in the inversion results."}, {"url": "https://www.cambridge.org/core/journals/american-journal-of-international-law/article/united-statesmexicocanada-agreement-a-glimpse-into-the-geoeconomic-world-order/055695FD26B96374402A0FFF52915F52", "page_content": "The United States-Mexico-Canada Agreement (USMCA) differs in a few important ways from prior trade deals signed by the United States but reveals a glimpse of the infrastructure for a new era in international economic governance.Footnote 1 This new “Geoeconomic World Order,” will be characterized by great power rivalry between the United States and China, the intense use of protectionist tools to achieve strategic and political goals, and the diminished role of legal adjudication.Footnote 2 This approach to trade policy will likely outlast the autocratic and/or nationalistic governments emerging around the world, including the current Trump administration. While international trade law will recover, it will look different in key respects—it will be less multilateral, predictable, justiciable, and enforceable. This more transactional view of international trade law implies a limit on the role of law and an increase in the use of power. Footnote 3 It may force a retrenchment of international interdependence and a revival of zones of influence prevalent during the Cold War era.\n\nThe Context of the Negotiation Donald Trump's campaign soundbites of “build the wall,” “make them pay,” “send them back,” and other offensive harangues against Mexicans were followed by demands to terminate a twenty-five-year-old trade deal if renegotiations were not to his liking. Given its dependency on access to U.S. markets, Mexico had to capitulate to the demands, and in so doing became the first nation to succumb to Trump's “Art of the Deal.” The resulting agreement, timed around electoral concerns and politics on both sides of the border, may well illustrate the elements of a new era in international economic governance. There should be no surprise that Mexico was the first to agree to sign a trade deal with the Trump administration. More than 80 percent of Mexican exports go to the United States. If the United States had suddenly terminated the North American Free Trade Agreement (NAFTA), it would have crippled Mexico's economy by deterring productive investment and tanking Mexico's long-term growth. This would have been particularly damaging at a time when the unilateral U.S. tariffs adopted in the name of national security on aluminum and steel had already affected Mexico. The new USMCA—which is practically, albeit not technically two bilateral deals signed by the United States—is expected to take effect January 1, 2020. Legislative bodies in the three countries will have to approve the deal, a process that may take some months and could be upended by the Democrat's takeover of the House of Representatives in the United States.Footnote 4\n\nUSMCA and the “New Normal” One way to understand the USMCA is as a small element in a changing global environment. While it is the product of a negotiation, key features of the agreement squarely reflect U.S. interests (some of which align with Mexican and Canadian interests) because the (still) biggest economy in the world enjoys considerable leverage over Canada and especially Mexico. In the differences with its direct predecessors—namely NAFTA, but also the Trans-Pacific Partnership (TPP) (which until January 2017 also involved the three countries)—the USMCA reveals some of the pillars of a new Geoeconomic World Order. This order is: characterized by great power rivalry between the United States and China and the clear use of economic tools to achieve strategic goals. This increased convergence of economic and security thinking and strategies is likely to lead to a significant restructuring of the laws and institutions that govern international trade and investment.Footnote 5 In essence, the post-WWII liberal era that drifted into the neoliberal world is rapidly evaporating and new institutions that will manage the future of economic interdependence are emerging. Many states are adapting in part by pushing decision-making towards the realm of national discretion and away from international oversight. This results in the curtailment of key features of the liberal order, primarily international legal adjudication. Especially in the United States, concerns over the security risks posed by interdependence and China's economic ambitions are enhancing state control of the economy (chiefly, the general desirability of free trade and foreign investment in key sectors), and perhaps a more isolationist version of self-sufficiency and resilience.Footnote 6 The USMCA reflects this shift. Combined, its features reduce the role of law—or, at the very least, the role of international adjudication—and increase the role of power—or, at the very least, the use of raw economic power. The ultimate goal may be to expand flexibility, policy space, or discretion to implement trade measures to protect the industrial and manufacturing base on national security grounds, to expand screening of foreign investments in critical infrastructure, and to impose new export constraints with respect to key, cutting-edge technologies—all with little risk of meaningful accountability or legal challenges on international law grounds. For instance, in the realm of trade, one of the major shortcomings of NAFTA was its incomplete state-to-state dispute settlement process, under which a dispute settlement panel could only be established with the consent of the parties. Chapter 31 of the USMCA, which addresses dispute settlement, looks similar. It requires that by the date of entry into force of the agreement “a roster shall be appointed by consensus and remain in effect for a minimum of three years or until the Parties constitute a new roster.”Footnote 7 Nothing ensures that the parties will follow through with such commitment and do more than they did under NAFTA—making the obligations of the treaty hard to enforce. In fact, the situation is worse than it was when NAFTA entered into force, given that by the time USMCA enters into force the World Trade Organization's (WTO's) dispute settlement mechanism will likely no longer be functioning and thus will not provide Canada and Mexico with a consequential alternative process. Further, the treaty mandates a review process, plus eventual automatic expiration if the review does not confirm the parties’ desire to extend the agreement. This may increase the role of power when disagreement ensues, especially if dispute settlement is unavailable.Footnote 8 Turning to foreign investment, the treaty significantly scaled back the role of investor-state dispute settlement (ISDS), an imperfect mechanism, but one whose use until recently had been a well-established policy of the U.S. government.Footnote 9 In principle, there is no more general recourse to ISDS between the United States and Canada (with some exceptions for Legacy Investment Claims and Pending Claims). The agreement maintains a limited version of ISDS between Mexico and the United States.Footnote 10 Notably, in many instances, claims alleging the failure to provide a minimum standard of treatment or an indirect expropriation are not allowed. Establishment and acquisition claims are generally barred, and exhaustion of local remedies is almost always required. As a result, it is unlikely that a government's decision to unfairly block foreign investment will ever be reviewed by USMCA arbitrators. In fact, the United States’ Better Utilization of Investments Leading to Development (BUILD) Act approved in October 2018 has increased investment surveillance and national executive discretion in this realm. Therefore, such a decision is unlikely to be significantly reviewed under U.S. domestic law either.Footnote 11 At the same time, the USMCA maintains a trend towards regulatory harmonization, the regulation of e-commerce, and free transfer of data reflected in the TPP Agreement. These areas are also interesting examples of balancing “soft” and “hard” law. This balancing is done by promoting the particular policy preferences within international law, but insulating decisions from international adjudicatory review. For example, the USMCA prevents parties from restricting “the cross-border transfer of information,” with limited exceptions.Footnote 12 Additionally, it prevents parties from requiring firms “to use or locate computing facilities in that Party's territory as a condition for conducting business.”Footnote 13 These provisions advance the interests of larger technology companies in sustaining an unregulated internet by preventing protectionist data localization requirements that inhibit the flow of data across borders. However, like the chapter on regulatory harmonization, which emphasizes science-based risk assessment, it has very limited judicial bite.Footnote 14 In fact, the treaty provides that no party to the agreement shall have recourse for dispute settlement for a matter arising under the regulatory harmonization provisions, except to address a sustained and recurring course of action or inaction.Footnote 15 Even the most “progressive” elements of the USMCA show similar geoeconomic impulses and a general distaste for legal adjudication. For instance, the much-needed anticorruption provisions are nonjusticiable, evidence that the United States will continue to rely on corruption allegations at a political level—when the Foreign Corrupt Practices Act (and its disparate effects) is inapplicable—to embarrass foreign authorities.Footnote 16 To be sure, the higher environmental standards or explicit protection of indigenous and labor rights prominently covering violence against workers, migrant workers, and sex-based discrimination should be celebrated, although these obligations will be difficult to enforce.Footnote 17 Even the much-touted automobile provisions demanding that a percentage of a vehicle be built by workers earning at least US$16 an hour may be of little help. Both countries negotiated a side letter allowing exports at a lower tariff rate to allow U.S. cars continued access to the U.S. market—including vehicles built with low wages—to avoid any dispute.Footnote 18 With unprecedented unilateral actions against China in the background (a 25 percent tariff on US$50 billion and an additional 10 percent tariff on US$200 billion of Chinese goods) and the threat of more to come, the USMCA seeks to help reconfigure supply chains.Footnote 19 In addition to reestablishing lower tariffs and regulatory harmonization in the region, U.S. policymakers are using the treaty to sketch a new approach in which production location should be subjected to higher levels of state oversight, making these measures harder to challenge before international mechanisms. In an island of optimism amidst profound uncertainty, Mexico and Canada stand to win something under this new framework, as the treaty may force the relocation of manufacturing to North America. But if there were any doubt as to the new approach behind the USMCA, two clauses aimed at China discourage partners from establishing free trade agreements with a “non-market economy” or granting similar enforceable investment benefits to that economy's investors.Footnote 20 This could also prove to be a costly constraint on economic policy for Mexico and Canada."}, {"url": "https://ivypanda.com/essays/international-banks-operating-in-usa-mexico-and-canada/", "page_content": "Introduction\n\nGlobalization has brought many revolutionary changes in every phase of human life and function. The businesses world has especially changed a lot witnessing substantial effects of globalization and the banking sector is an important part of the business operations is also going through the phase of rapid changes due to advancement in communication and information technology. At present many banks are operating at the international level and these banks offer different corporate and consumer banking services to millions of customers in different countries. This paper is intended to discuss the major international banks operating in the USA, Mexico, and Canada.\n\nAn international bank is one that owns and operates branches in more than one country and for this purpose, the bank makes the foreign direct investment in those countries. Thus the presence and operations of an international bank in the country can draw a significant impact on the banking scenario and the following discussion strives to trace these impacts of the international banks’ operations on the banking scene of the USA, Mexico, and Canada. In this regard, the paper describes the background of the banking sector of these countries to have an understanding of the international bank’s operation and their roles in the banking sectors of these countries.\n\nBanking Sector of Mexico and International Banks\n\nThe banking sector of Mexico is the second-largest banking sector of Latin America. The banking sector has commercial assets of U.S. $186 billion (Heiner Schulz, p8). After the financial crisis of the 1990s, the government of Mexico allowed foreign direct investment in the banking sector of the country after the enforcement of the North American Free Trade Agreement (NAFTA) in January 1994. This step was taken to get support for the undercapitalized domestic banks. As a result of the liberalization of the banking industry, a huge amount of FDI entered the country.\n\nFrom 1994 to 2004, there was almost U.S. $30 invested by the foreign banks in the financial sector of Mexico. The major international banks that started their operation in Mexico after the economic liberalization include two Spanish banking groups “BVB and BSCH”; the Canadian “Bank of Nova Scotia”, USA-based “Citigroup” and UK-based “HSBC”. An important move was taken by Citibank group in August 2001 when the bank took over Banamex for the U.S. $12.5 billion. This was the largest foreign acquisition in Mexico as well as the largest financial sector deal ever in entire Latin America. In this way, Citigroup became the biggest international banking group operating in the country. Citibank was the only international banking group that was operating in Mexico even before the liberalization of the Mexican economy (Heiner Schulz, p8).\n\nBy the year 2002, the FDI in the banking sector become so high that almost 80 percent of the financial assets of the country went under the control of foreign financial institutions. By 2004 there was a further increase in FDI and 82 percent of financial assets went into the hands of the international banking groups. This was a substantial and unprecedented change in the economic scenario of the country that was opposed as well as favored by the experts. The critics strongly argued that the foreign banks have no role to play in the development of the banking sector due to the non-expansion of their domestic credit facilities but still they earn a massive amount of profit from the banking sector of the country through high fees and commissions. On the other hand, the supports of foreign banks operations has a belief that the foreign banks not only bring capital to the country but also skills, technology, and managerial know-how that play a very supportive role in the stabilization of the economy after the financial crisis. As a result, the banking sector has become the engine of the economic growth of Mexico. At present four out of the five largest banks operating in Mexico are under the control of the international banking groups that show the major share of the international banks in the financial sector of Mexico (Heiner Schulz, p8).\n\nBanking Sector of Canada and International Banks\n\nThe banking sector possesses great importance in the economic scene of Canada. The stable economy of Canada is very attractive for the international financial groups that’s why at present almost all the major international banks that are operating in Canada either through their subsidiaries or representative offices. International banks are attracted to the banking sector of Canada because it is regarded as highly efficient as well as the safest and soundest financial sector in the world. The history of Canada has witnessed very few bank failures that invited the international banking groups to invest in the financial sector of the country (Department of Finance, p2)\n\nThe economy of Canada is liberalized for many years. Since the year 1980, international banks were allowed to establish their subsidiaries in the country. There were some restrictions on the operations of the international banks in Canada and most of them were removed after the “Canada US Free trade agreement, the North American Free Trade Agreement (NAFTA) and the World Trade Organization agreement on financial services”. (Department of Finance, p2)\n\nLater in June 1999, legislation was passed that allowed the international banks to open their full fledge branches in Canada and at the same time the international banks were also allowed by the government that they can draw capital from their home country to support their lending activities in Canada. International banks are operating in Canada mainly through two types of branches; lending braches and full-service branches. Both of these types of branches of international banks are permitted the power equivalent to the domestic banks. However, the lending branches of the international banks need to fulfill some regulatory requirements as they are not allowed to borrow or take a deposit from any other financial institution. 42 international banks are operating in Canada and these banks are having control over 10 percent of the financial assets of the country. (Department of Finance, p2)\n\nInternational banks are involved in a different types of banking activities and financial services in Canada. Most of the international banks operate in wholesale banking and niche financing. The Hong Kong Bank of Canada is the major international bank operating in Canada that has an extensive network of branches across the country and also contributed near to one-third of the foreign bank’s assets in Canada. (Department of Finance, p3)\n\nBanking Sector of the USA and International Banks\n\nThe banking sector of the United States of America is regarded as one of the deep and competitive financial sectors of the world. The banking sector in the USA is well supported by strong economic conditions as well as sensible supervision. The banks in the USA provide a wide range of wholesale and retail financial services to different types of customers including individuals, SMEs, and corporations.\n\nDespite the favorable financial sector conditions, the major share of the US financial sector is owned by the US banks and these banks are generating high revenues and growth through consolidations (US Department of Commerce, p1)\n\nIn the financial sector of the country, the experts see great room for the international banks and the economic liberalization further provide the international banks different opportunities to expand their networks and generate revenue from the banking sector of the USA but still, the dominant players in the USA banking sector are the domestic and US banks. (US Department of Commerce, p1)\n\nAt present, the major share of the financial sector of the country is under the control of the US banks however the role of the international banks are also gaining room in the financial sectors of the country and there was a 77 percent rise in the assets of the international banks in the US financial sector. At present 19 percent of the US banking financial sector assets is under the control of the international banks. Experts consider the role of the international banks very significant for the US economy because it has increased the FDI and at the same time skills and banking techniques also entered the US economy through the braches of the international banks and at the same time the entrance of the international banks in US financial market provides now opportunities of expanding the cross border investments to the US investors (US Department of Commerce, p1). The major international banks operating in the USA include HSBC, Bank of China, Bank of India, Deutsche Bank AG, National bank Egypt, Atlantic bank of NY, Bank of East Asia USA NA (Hong Kong). These banks provide different financial services to corporate consumers as well as individuals.\n\nDiscussion and Conclusion\n\nThe above discussion provides information about the major international banks operating in Canada, the USA, and Mexico and also explains the background of the financial sector of these countries to clarify the position and contribution of the international banks in the financial sectors of these countries. It is revealed from the above discussion that some decades ago the international banks were not having that much access to the financial markets of the USA, Mexico, and Canada, that they use to enjoy in the present time. In this regard, the international measures taken for trade liberalization have played an important role and after the enforcement of NAFTA and other agreements, the role of the international banks becomes important in these countries.\n\nAt present many major international banks are operating in the financial sectors of the USA, Mexico, and Canada including Citigroup, HCBC, etc. The involvement of the international banks in the financial operations of these countries has drawn mostly significant impact on the economies of these countries through a rise in FDI, transfer of skill, techniques, and management capabilities, etc, however, some of the experts also have reservations on the role of the international banks because they see the profit acquired by the international banks greater than their role in the development of the financial sector of these countries. However, the considerable share of the foreign banks in the financial assets of these companies shows the importance of the presence of international banks in these countries.\n\nWork Cited\n\nDepartment of Finance, the Canadian financial system (1999), “Canada’s Financial Services Sector, Canada’s Banks”, The Department of Finance, 140 O’Connor Street, Ottawa, Ontario K1A 0G5.\n\nHeiner Schulz, (2006) “Foreign Banks in Mexico: New Conquistadors or Agents of Change, University of Pennsylvania. Web.\n\nU.S. Department of Commerce (2007) the US Banking Sector 2007, the International Trade Administration. Web."}, {"url": "https://superbikenewbie.com/26-famous-motorcycle-clubs-of-california-including-1-mcs/", "page_content": "California has a rich history when it comes to motorcycle clubs. The state has great weather and scenic destinations! This makes it the home to many different clubs, including infamous ones like the Hells Angels and the Vagos, both being 1% MCs. In this post, I will cover 26 Motorcycling Clubs of California.\n\n1. Azraels MC\n\nAzraels MC\n\nAbout: It is a DOD (Department of Defense) Contractor and Active Armed Forces formed and based motorcycle club. The club supports veteran beliefs, the country, and its allies. The club has members and chapters all around the world.\n\n\n\nIt is not a 1% motorcycle club.\n\nContact information: Facebook :https://www.facebook.com/Azraels-MC-336670089688406/?ref=page_internal Instagram : https://www.instagram.com/azraels_mc/?hl=en Address : 2458 Newport Blvd Ste 182, Costa Mesa, CA 92627-1316\n\n\n\n2. Four Aces Motorcycle Club\n\nFour Aces Motorcycle Club\n\nFounded: In 1939 in California.\n\nIn 1939 in California. About: The Four Aces motorcycle club is a social and racing organization located in Southern California. The club’s main activity is motorcycle desert racing in Southern California.\n\n\n\nThey participate in AMA and District 37-sanctioned off-road motorcycling events. They include National Hare & Hound, Hare & Hound, Desert Scrambles, Enduros, European Scrambles, Grand Prix, and motocross.\n\n\n\nTheir events are located in the Mojave desert in areas such as Red Mountain, Spangler Hills, Johnson Valley, and Gorman. They also promote a National Hare & Hound event each year, named the Moose Run.\n\n\n\nIt is not a 1% motorcycle club.\n\n3. Dirt Diggers Motorcycle Club\n\nFounded: In 1945 in California.\n\nIn 1945 in California. About: The DDMC promotes and organizes Desert, Grand Prix, and Motocross events. They are a non-profit organization affiliated with the AMA, D-37, and several desert racing clubs.\n\n\n\nThe club has many “firsts” to its name. The first all-girl race, called the Petticoat scrambles, was put on by the Dirt Diggers. They were also the first club to put on night scrambles and the first to have a program for a race. DDMC was also the first club to organize an F.I.M.-sanctioned race in the United States.\n\n\n\nIt is not a 1% motorcycle club.\n\nContact information: Facebook: https://www.facebook.com/DirtDiggersMC Instagram: https://www.instagram.com/dirtdiggersmc/ Email: president@fouracesmc.org Address: Santa Monica, CA, United States\n\n\n\n4. Freedom Cruisers Riding Club\n\nFreedom Cruisers Riding Club Patch\n\nFounded: In 1999 in California.\n\nIn 1999 in California. About: The Freedom Cruisers is a cruising club, as the name implies. It is a family-friendly club. The club represents motorcycle riding, family, motorcycle safety, traveling, fun, and the camaraderie of the members. New members are always welcome.\n\n\n\nThe club now has around 81 Chapters throughout the United States.\n\n\n\nIt is not a 1% motorcycle club\n\nThe club has 5 chapters in California.\n\nChapter 1: South Placer County/ Sacramento, CA\n\nThomas Lee Dancer “Lucky”, President\n\nContact information:\n\nChapter 2: Central Valley, CA\n\nHans van Loo “Dutchman”, President\n\nContact information:\n\nChapter 3 : Ripon, CA\n\nDaniel Aguilar “Tattoo Man”, President\n\nContact information:\n\nChapter 4: West Sacramento, CA\n\nBruce Rojo “GhostRider”, President\n\nContact information:\n\nChapter 5: Oroville, CA\n\nRick Johns “Rick”, President\n\nContact information:\n\n5. Hilltoppers Motorcycle Club\n\nHilltoppers Motorcycle Club\n\nFounded: In 1945, in the City of Long Beach, California.\n\nAbout: The Hilltoppers MotorCycle club has been racing, riding, and having a good time for over 60 years. The club members are a group of motorcycle enthusiasts that love to talk about motorcycles. And about events related to the promotion of motorcycles.\n\n\n\nThe club has two races a year. The first is a grand Prix on the first weekend of April in 29 Palms, California. The race attracts over 1200 entrants and over 5000 spectators every year. The second is a Desert Race called the “Soggy Dry Lake Desert Scramble.” This race is a two-loop, 80-mile, laugh-a-minute ride through the Johnson Valley OHV, area.\n\n\n\nIf you are thinking about racing in District 37 or already do and do not belong to any other club, the Hilltoppers MC might be what you are looking for.\n\n\n\nIt is not a 1% motorcycle club.\n\nContact information: Website : http://www.hilltoppersmc.com/ Facebook : https://www.facebook.com/groups/71111046400/\n\n\n\n6. Menehunes Motorcycle Club\n\nMenehunes Motorcycle Club MC Patch\n\nAbout: Menehunes MC is based on keeping Hawaiian traditions. Although not all members are islanders, the club members value Hawaiian culture and traditions.\n\n\n\nIts brother clubs are the Men Motorcycle Club and the Sons of Hawaii (SOH) Motorcycle Club.\n\n\n\nIt is not a 1% motorcycle club.\n\n7. San Francisco Motorcycle Club (SFMC)\n\nSan Francisco Motorcycle Club\n\nFounded: In 1904 in San Francisco, California.\n\nIn 1904 in San Francisco, California. About: SFMC is the second oldest motorcycle club in the United States. It is preceded only by the Yonkers MC of Yonkers, New York, founded in 1903.\n\n\n\nThe SFMC has been a member of the American Motorcyclist Association (AMA) since 1924. Members are not limited to riding any type of bike, and members include male and female riders. It was the first motorcycle club to admit women members.\n\n\n\nIt is not a 1% motorcycle club.\n\n8. Hells Angels Motorcycle Club (MC)\n\nHells Angels MC Patch\n\nFounded: ﻿In March 1948 in Fontana, San Bernardino, California.\n\n﻿In March 1948 in Fontana, San Bernardino, California. About: Hells Angels MC is a worldwide outlaw motorcycle club whose members typically ride Harley-Davidson motorcycles. It is arguably the most famous outlaw motorcycle gang in the world.\n\n\n\nHells Angels members number between 3,000 and 3,600 worldwide. They have 467 chapters in 59 countries. This makes the HAMC the largest motorcycle club in the world. Common nicknames for the club are the “H.A.,” “Red & White,” “HAMC,” and “81”.\n\n\n\nPolice officers and international intelligence agencies consider the club an organized violent crime syndicate with real outlaws.\n\n\n\nIt is a 1 percent Motorcycle Club. Yes, Hells Angels have no comparison.\n\n\n\nThe MC has 26 charters in California. They include Sacramento, Berdoo, Frisco, Oakland, Orange County, San Jose, and Bakersfield charters.\n\nContact information: Website : https://hells-angels.com\n\n\n\nHells Angels Sacramento\n\nContact information:\n\nHells Angels Frisco\n\nContact information:\n\nHells Angels Oakland\n\nContact information:\n\nHells Angels Santa Cruz\n\nContact information:\n\nHells Angels Daly City\n\nContact information:\n\nHells Angels Sonoma County\n\nContact information:\n\nWebsite : https://sonomacountyhellsangels.com/\n\n: https://sonomacountyhellsangels.com/ Facebook: https://www.facebook.com/HellsAngelsSonomaCounty/\n\nhttps://www.facebook.com/HellsAngelsSonomaCounty/ Email: hamcsco@gmail.com\n\nhamcsco@gmail.com Address: 516 Frazier Ave Santa Rosa, CA, US 95404\n\nHells Angels San Fernando Valley\n\nContact information:\n\nHells Angels Monterey\n\nContact information:\n\nHells Angels Ventura\n\nContact information:\n\nHells Angels Orange County\n\nContact information:\n\nHells Angels Merced County\n\nContact information:\n\n9. East Bay Rats MC\n\nEast Bay MC patch\n\nFounded: ﻿In 1994 in Oakland, California.\n\n﻿In 1994 in Oakland, California. About: East Bay Rats MC is a club for motorcycle enthusiasts and the motorcycle community. The club hosts various events such as fight parties and other refined social events.\n\n\n\nThe club has a clubhouse where members can meet up. And where the public can join them for the occasional whiskey wrestling or syrup-chugging contest. It also has a permanent boxing ring.\n\n\n\nIt is not a 1 percenter Motorcycle Club.\n\nContact information: Website : http://www.eastbayrats.com/ Facebook: https://www.facebook.com/EastBayRatsMC/ Phone: (510) 830-6466 Address: 3025 San Pablo Ave, Oakland, CA 94608, United States\n\n\n\n10. Sisters of Scota Women’s Motorcycle Club\n\nSisters of Scott MC Patch\n\nFounded : 1979, by Dayna “Grumbles” Davidson in Sacramento, Ca\n\n: 1979, by Dayna “Grumbles” Davidson in Sacramento, Ca About: The Sisters of Scota Women’s Motorcycle Club is a close-knit family of bold female bikers united by their reverence for Scota, the ancient Celtic Warrior Goddess.\n\n\n\nIt was founded in 1979 as a pioneering women’s MC, and has since spread its wings across California, Nevada, Arizona, and Idaho. They are deeply involved in charity work, collaborating with the biker community and raising money to brighten the lives of foster kids.\n\n\n\nIf you’re a spirited lady who loves to ride and cares about making a difference, don’t hesitate to join.\n\n\n\nIt is not a 1% MC.\n\nContact Information Website : https://www.sistersofscotawmc.org/ Facebook : https://www.facebook.com/Sisters-of-Scota-Womens-Motorcycle-Club-363204573798389 Instagram : https://www.instagram.com/soswmc/?hl=en\n\n\n\n11. Devil Dolls MC\n\nDevil Dolls MC Patch\n\nFounded: ﻿On February 14, 1999, in San Francisco, California.\n\n﻿On February 14, 1999, in San Francisco, California. About: The Devil Dolls MC is an all-female biker sisterhood that promotes and supports women’s empowerment. This organization prides itself on having a very diverse membership. From old-school bikers, rebels, and rockers to community activists, moms, and professionals, they all share a love for riding motorcycles.\n\n\n\nThe club regularly participates in community events and donates to various benefits and fundraisers in the local communities.\n\n\n\nThe club started as a “Harley-Davidson motorcycle Only” club. But now, they welcome Triumph, BSA, BMW, Norton, and other USA or European bikes. No mopeds or scooters.\n\n\n\nIt is a 3-piece MC and is not a riding or social club. The MC has a nomad charter known as the “Wild West” with members from Washington to Southern California. They also have a sister charter in Sweden.\n\nIt is not a 1 percenter Motorcycle Club.\n\n12. Oakland Motorcycle Club\n\nOakland Motorcycle Club\n\nFounded: ﻿In 1907.\n\n﻿In 1907. About: The Oakland MC offers family-friendly fellowship and good times with a diverse group of fellow riders of all motorcycle makes and models.\n\n\n\nThey have club rides all year long. They also sponsor three popular public events each year. They include a competitive enduro, a friendly poker run, and an epic dual-sport adventure.\n\n\n\nThe club holds weekly Wednesday meetings from 8:00 p.m.\n\n\n\nIt is not a 1 percenter Motorcycle Club.\n\nContact information: Website : http://oaklandmotorcycleclub.camp9.org/ Facebook: https://www.facebook.com/groups/19740659856/ Email: Dan@oaklandmc.org Address: 742 45th Avenue, Oakland, CA.\n\n\n\n13. Vagos Motorcycle Club\n\nVagos Motorcycle Club Patch\n\nFounded: ﻿In 965 in San Bernardino, California.\n\n﻿In 965 in San Bernardino, California. About: The Vagos Motorcycle Club is also known as the Green Nation. It is one of the most notorious outlaw biker gangs in the US and internationally. The Vagos have approximately 4,000 members among 200 chapters in the US, Mexico, Europe, and more.\n\n\n\nThe Vagos have support clubs spread throughout the United States. They include Green Machine MC, Silent Ones MC, Wicked MC, Freebird MC, and others.\n\n\n\nThe club’s insignia is Loki, the Norse god of mischief, riding a motorcycle. Members typically wear green.\n\nIt is a 1 percenter Motorcycle Club. Reportedly involved in criminal activities.\n\nContact information for Vagos MC, Los Angeles: Facebook : https://www.facebook.com/profile.php?id=100069604999649\n\n\n\n14. Sacred Sons Motorcycle Club\n\nSacred Sons Motorcycle Club Patch\n\nAbout: Sacred Sons MC is a law enforcement motorcycle club (LEMC). The members are all active or retired members of law enforcement organizations.\n\n\n\nThe SSMC is different than other LEMCs as they do not look to add membership in large numbers. But rather, they look for quality members who display the traits of a true brother in life and law enforcement.\n\nIt is not a 1 percenter Motorcycle Club.\n\nThe club has three chapters in California. They are as follows:\n\nContra Costa\n\nContact information:\n\nInland Empire Chapter\n\nContact information:\n\nSan Diego 1904 Chapter\n\nContact information:\n\n15. Iron Breed Motorcycle Club\n\nIron Breed Motorcycle Club\n\nFounded: In October 2011.\n\nIn October 2011. About: ﻿The Iron Breed Law Enforcement Motorcycle Club believes in the ideals of law enforcement. They are honor, honesty, dedication, loyalty to family, loyalty to their chosen profession, and loyalty to their brothers. The club aims to serve as an example to the community, including the biker community.\n\nThe Iron Breed Motorcycle Club is only open to active or retired law enforcement officers.\n\nIt is not a 1 percenter Motorcycle Club.\n\n16. Big Bear Trail Riders Motorcycle Club\n\nBig Bear Trail Riders Motorcycle Club\n\nFounded: In 1993.\n\nIn 1993. About: The Big Bear Trail Riders is a dual-sport motorcycle club based near Big Bear Lake, in the heart of Southern California’s San Bernardino National Forest.\n\n\n\nThe members have been exploring the surrounding areas’ dirt roads and single-track trails since the 1980s.\n\n\n\nBesides having some of the best mountain off-road riding in the region, the area is only a few miles from the Mojave Desert. This also provides fabulous year-round riding opportunities.\n\n\n\nIt is not a 1 percenter Motorcycle Club.\n\nContact information: Website : https://bigbeartrailriders.com/ Instagram: https://www.instagram.com/bigbear_trailriders/?igshid=2qcfkhzvnpfu Email: jimKTM@verizon.net (President Jim Nicholson) Phone : (626) 279-5090 (Ext. 12) Address : 9711 East Rush Street, South El Monte, CA 91733\n\n\n\n17. Pasadena Motorcycle Club\n\nPasadena Motorcycle Club\n\nFounded: In 1907.\n\nIn 1907. About: The Pasadena Motorcycle Club is, first and foremost, a club of motorcycle enthusiasts. The continuing mission of the PMC is to foster a passion for motorcycling in all forms, now and in the future.\n\n\n\nThe pride of the PMC is the historically significant Greenhorn (1937-present) ride. This started as a nationally recognized, famously rough, 500+ mile enduro traversing the mountains and deserts of Southern California.\n\n\n\nToday, the ride is open to the public and takes place each year in late spring or early summer.\n\n\n\nThe club is incorporated as a non-profit corporation and is a family club, not an outlaw motorcycle club. The PMC meets every Monday at 8 p.m. to discuss club business.\n\n\n\nIt is not a 1 percenter Motorcycle Club.\n\nContact information: Website : https://www.pasadenamotorcycleclub.com/ Facebook: https://www.facebook.com/pasadenamotorcycleclub Email: PublicRelations@PasadenaMc.com Phone : +1-626-807-9268 Address : 21 E Howard St, Pasadena, CA, United States, California\n\n\n\n18. Black Sabbath Motorcycle Club\n\nBlack Sabbath Motorcycle Club\n\nFounded: In 1974 in San Diego, California.\n\nIn 1974 in San Diego, California. About: The Black Sabbath Motorcycle Club is a profit organization comprising law-abiding citizens who love to ride. BSMC was started by African Americans and its membership is primarily African American (90%).\n\n\n\nSo, it is considered to be on the “Black Biker Set” by biker clubs across America. However, it welcomes all bikers irrespective of race, creed, color, or religion.\n\n\n\nThe Black Sabbath San Diego MC clubhouse is the longest-standing clubhouse in San Diego. It has been 40+ Years, and it is still going strong. It is not a 1 percenter Motorcycle Club.\n\nContact information: Website : http://www.blacksabbathmc.com/ Facebook: https://www.facebook.com/BlackSabbathMC/ Email: blacksabbathmcnation@blacksabbathmc.com Phone : (404) 692-0336 Address : ﻿4280 Market St, San Diego, CA 92102, United States\n\n\n\nThe club has several chapters in California. They include the San Diego chapter (mother chapter), Inland Empire chapter, Riverside chapter, Los Angeles chapter, and Jurupa Valley chapter.\n\n19. Soul Brothers Motorcycle Club\n\nSoul Brothers Motorcycle Club\n\nFounded: In 1967 in East Palo Alto, California\n\nIn 1967 in East Palo Alto, California About: The Soul Brothers Motorcycle Club was a mixed-race club from the beginning, with a mix of black and white members. Considering that this was the late 1960s, this was unusual for an outlaw motorcycle club.\n\n\n\nIts Mother Chapter has shifted over time from East Palo Alto to Stockton and then Fresno. Today, it has chapters all over the US.\n\nIt is considered a 1 percenter Motorcycle Club and is seen to be involved in criminal activity. However, the club has denied this reputation.\n\n20. Hurricane Biker Girls\n\nFounded: In October 2002 in California.\n\nIn October 2002 in California. About: Hurricane Biker Girls is a club for female motorcycle riders. It is made up of riders that share a common passion for riding motorcycles. The club is a sisterhood and values their bond and love for their bikes.\n\n\n\nThe club also has chapters in Georgia, Pennsylvania, Michigan, Arizona, and North Carolina.\n\n\n\nIt is not a 1 percenter Motorcycle Club.\n\n21. Mongols Motorcycle Club\n\nMongols Motorcycle Club\n\nFounded: In 1969 in California.\n\nIn 1969 in California. About: It is sometimes called the Mongols Nation or Mongol Brotherhood. Mongols members have a long history in the illegal drug trade and other crimes. But currently, the club and its attorneys say that it has changed its code of conduct.\n\n\n\nThe Mongols’ leading presence lies in Southern California. But they also have chapters nationwide in 14 states and internationally in 11 countries. Today, most members are Hispanic or Native American.\n\nMongols MC is a “one-percenter” outlaw motorcycle club. It was formed as a Hispanic rival to the infamous Hell Angels Motorcycle Club.\n\nContact information:\n\nWebsite: mongolsmc.com\n\n22. Men of Fire Motorcycle Club\n\nMen of Fire Motorcycle Club\n\nAbout: Men of Fire MC USA is a non-profit motorcycle club comprised entirely of professional firefighters. It is not affiliated with any other clubs. To be considered for membership, you must be a professional firefighter, active or retired.\n\n\n\nThe club aims to promote the brotherhood and professionalism of all firefighters, especially those within the biker community. It also aims to help fellow firefighters and other military veterans suffering from PTSD. Over the years, the club has helped raise hundreds of thousands of dollars for firefighters’ widows and orphans. And for firefighter mental health, wellness, and military charities.\n\n\n\nMen of Fire MC is not a one-percenter motorcycle club.\n\nContact information: Website : http://mfmcusa.com/#\n\n\n\nIn California, the MC has the following chapters. They are Chapter 2 So Cal, Chapter 3 Nor Cal, Chapter 5 Laco Los Angeles County, and Chapter 8 Sacramento.\n\nChapter 3 Nor Cal\n\nThis chapter is based out of Livermore, CA. It has members spread from South San Francisco to Sacramento.\n\nContact information:\n\nChapter 5 Laco Los Angeles County\n\nThis chapter is based out of Livermore, CA. It has members spread from South San Francisco to Sacramento.\n\nContact information:\n\nChapter 8 Sacramento\n\nThis chapter is based out of Livermore, CA. It has members spread from South San Francisco to Sacramento.\n\nContact information:\n\n23. Warrior Brotherhood Motorcycle Club\n\nWarrior Brotherhood Motorcycle Club\n\nAbout: The Warrior Brotherhood Motorcycle Club is a 501(c)3 not-for-profit organization. It is a motorcycle club to promote a strong sense of pride and mutual support among military veterans and civilian brothers. It is their mission to raise awareness of the needs of veterans.\n\n\n\nThe MC is open to all active and retired veterans who have served in the military of the United States. It is also open to civilians who want to help veterans.\n\n\n\nIt is not a one-percenter motorcycle club.\n\nContact information for its California chapter: Website : https://warriorbrotherhoodmc.com/ Facebook : https://www.facebook.com/profile.php?id=100066857910133 Email : CaliforniaWBMC@gmail.com\n\n\n\n24. Bella Gypsies Women’s Motorcycle Club (WMC)\n\nBella Gypsies Patch\n\nFounded: In 2010\n\nIn 2010 About: The club’s purpose is to have a club where women can experience and be part of a true sisterhood of motorcycle riders/bikers. It is a family-oriented club that understands the responsibilities of family life while being part of a women’s motorcycle club.\n\n\n\nThe club has active members throughout Los Angeles, Tulare, and Ventura Counties.\n\n\n\nIt is not a one-percenter motorcycle club.\n\nContact information for its California chapter: Website : http://www.bellagypsieswmc.com/ Facebook :https://m.facebook.com/profile.php?id=100069749205643&eav=Afb3z5s1u4fzwjs Email : bellagypsies@bellagypsieswmc.com\n\n\n\n25. River City Beemers\n\nRiver City Beemers MC Patch\n\nFounded: In 1982.\n\nIn 1982. About : The River City Beemers BMW Motorcycle Club brings together motorcycle riders that are recognized enthusiasts of BMW motorbikes. But any vehicle with two or three wheels and an engine over 90ccs is considered an honorary BMW.\n\n\n\nIt is Northern California’s largest and most active BMW Motorcycle Club.\n\n\n\nIt is a 501(c)(7) non-profit organization. It is also a chartered Chapter (#210) of the BMW Motorcycle Owners of America (BMW MOA). And chartered Chapter (#104) of the BMW Riders Association (BMW RA).\n\n\n\nIt is not associated with BMW AG or BMW North America.\n\n\n\n: The River City Beemers BMW Motorcycle Club brings together motorcycle riders that are recognized enthusiasts of BMW motorbikes. But any vehicle with two or three wheels and an engine over 90ccs is considered an honorary BMW. It is Northern California’s largest and most active BMW Motorcycle Club. It is a 501(c)(7) non-profit organization. It is also a chartered Chapter (#210) of the BMW Motorcycle Owners of America (BMW MOA). And chartered Chapter (#104) of the BMW Riders Association (BMW RA). It is not associated with BMW AG or BMW North America. It is not a one-percenter motorcycle club.\n\n26. East Bay Dragons MC\n\nEasy Bay Dragons MC Patch\n\nFounded: In 1959 in Oakland, California.\n\nIn 1959 in Oakland, California. About: The East Bay Dragons MC is an all-black, all-male, all-Harley Davidson riding motorcycle club. It is believed to be the oldest African American motorcycle club.\n\n\n\nIt was initially founded as a car club by Tobie Gene Levingston. Later, due to constant harassment from the police, he changed it to a motorcycle club.\n\n\n\nThe East Bay Dragons have a record of service to the community and have supported many local charitable organizations. They include riding for breast cancer, AIDS awareness, and violence awareness.\n\n\n\nIt is considered a one-percenter motorcycle club with close ties to the Hells Angels.\n\nContact information for its California chapter:\n\nEmail : patjoetaylor@gmail.com Facebook : https://www.facebook.com/eastbaydragons Instagram: https://www.instagram.com/explore/locations/1821674114727786/oakland-california/east-bay-dragons-mc/ Phone: +1-510-638-9859 Address : 8731 International Blvd., Oakland, CA, United States, 94621\n\n\n\n1% club: The genesis of this phrase dates back to the famous 1947 Hollister riot. Allegedly, the AMA (American Motorcycle Association) had commented that 99% of motorcycle riders were citizens who conformed to the law and that only 1% were outlaws (not to be confused with Outlaws Motorcycle Club).\n\n\n\nMany motorcycle clubs that have been associated with organized crime, and have had run-ins with law enforcement agencies use the 1% diamond patch and are commonly referred to as the one percenter motorcycle club (also called an outlaw biker group); More about this here. Some popular 1% clubs are Outlaws MC (a very dominant club), Hells Angels (the main rival group of the outlaws), Pagan Motorcycle Club and Black Pistons MC.\n\nMC (Motorcycle Club): The term Motorcycle Club (MC) does carry a meaning outside and beyond the usual English definition of it. It is a popular term in the Outlaw and 1% motorcycling subculture, where it is often used by motorcycling clubs that have had a history in organized crime. Such clubs (MCs) often denote these by wearing colors — essentially a 3-piece patchwork.\n\n\n\nHowever, not all motorcycling clubs that use the term MC are necessarily an Outlaw motorcycle club or a 1% club. But it wouldn’t be wrong to say that all dangerous biker gangs are one percenters.\n\nHarleys: It goes without saying that most riders in various clubs swear by their Harley Davidson Motorcycle or a custom chopper. Harley-David Motorcycles enjoy a disproportionately high popularity among MC riders who, in mainstream culture, are known to promote cruiser motorcycles."}, {"url": "https://www.state.gov/the-united-states-and-canada-neighbors-friends-and-allies/", "page_content": "“Canada is one of our closest allies, and I look forward to working in partnership to advance our shared interests and confront our shared challenges.”\n\n– U.S. Secretary of State Antony J. Blinken, January 26, 2021\n\nSecretary of State Antony J. Blinken will visit Canada virtually on February 26 as part of his first virtual trip as Secretary of State. During his visit, Secretary Blinken will meet with Prime Minister Trudeau, Foreign Minister Garneau, and other Canadian cabinet members. This visit follows President Biden’s virtual bilateral meeting with Prime Minister Trudeau on February 23, during which the two leaders announced the U.S.-Canada Partnership Roadmap, a blueprint for our whole-of-government relationship. Secretary Blinken will begin the process of putting this plan into action in his meetings with Canadian leaders by discussing shared bilateral priorities and common approaches to global challenges including responding to the COVID-19 pandemic; taking bold action to combat climate change; strengthening economic ties and enhancing North American economic security through USMCA implementation; and bolstering our shared defense and security.\n\nTHE UNITED STATES AND CANADA: COMMON BORDER, VALUES, AND FUTURE\n\nThe United States and Canada have been friends, partners, and allies for more than 150 years, and our bilateral relationship is one of the closest and most comprehensive in the world.\n\nThe fact that President Biden’s first phone call to a foreign leader was to Prime Minister Trudeau, and Secretary Blinken’s first call as Secretary of State was to Foreign Minister Garneau, is a testament to our deep and abiding friendship. President Biden held his first bilateral meeting with Prime Minister Trudeau on February 23, and Secretary Blinken’s virtual visit will build on their discussions of our shared priorities and challenges.\n\nThe United States and Canada collaborate on a daily basis to secure and share the world’s longest land border –5,525 miles – and its 120 land ports-of-entry.\n\nThe $1.9 billion worth of goods and services that cross our border every day are a testament to the depth and breadth of our economic relationship.\n\nThe United States and Canada are stalwart allies, and U.S. defense arrangements with Canada are more extensive than with any other country in the world.\n\nThe U.S.-Canada Partnership Roadmap will guide our two countries as we work hand-in-hand on shared areas of concern. These concerns include combatting COVID-19; driving economic recovery; leading on climate change; advancing diversity and inclusion in both our societies; expanding our security and defense cooperation, including through NATO and NORAD; and jointly addressing shared challenges through multilateral institutions.\n\nFRIENDS IN HARD TIMES: RESPONDING TO COVID-19\n\nThe United States and Canada are collaborating closely to respond to the COVID-19 pandemic and to plan for economic recovery.\n\nThrough extraordinary communication, cooperation, and coordination at every level of our two governments, the United States and Canada have worked together to keep our shared border open to essential travel and to maintain critical supply chains. This has allowed trade to flow between our countries while prioritizing the health and safety of our citizens by restricting cross-border land entry for non-essential purposes.\n\nOur cooperation on global health security, including on vaccine technical assistance and distribution efforts, is emblematic of the strength of the U.S.-Canada relationship.\n\nDEEP ECONOMIC PARTNERSHIP\n\nThe United States and Canada enjoy the world’s most comprehensive trading relationship, which supports millions of jobs in each country.\n\nThe United States and Canada traded goods and services worth $725 billion in 2019. Canada and the United States are each other’s largest export markets, and Canada is the number one export market for more than 30 U.S. states.\n\nThe United States and Canada are also each other’s largest energy trading partners.\n\nThe United States and Canada have a shared goal of enhancing North American economic security and competitiveness. Implementation of the United States-Mexico-Canada Agreement (USMCA), our cooperation in the Arctic, and critical minerals collaboration are important means to achieving that goal together.North American climate leadership can help us develop new economic opportunities in clean energy and transportation.\n\nGLOBAL LEADERSHIP ON SHARED CHALLENGES"}, {"url": "https://www.history.co.uk/shows/outlaw-chronicles-hells-angels/articles/top-6-notorious-biker-gangs", "page_content": "Hells Angels and 6 more notorious biker gangs\n\nRiding motorcycles with your mates is the very essence of any bike club, it’s all good clean fun, so long as you don’t mix up the biking and comradeship with a spot of organised crime, then the club becomes a gang, the members’ outlaws and things get really heavy.\n\nAll the MC’s (Motorcycle Clubs) on the list were founded in the USA and although it’s acknowledged there are clubs all over the world, the true heart of the one-percenter* is very much ensconced in the American psyche.\n\nThere are thought to be over three hundred outlaw clubs operating in the US, here’s what could be considered the top of the pile - almost all riding the the one bike of choice, Harley Davidson.\n\nSons of Silence\n\nFounded in 1966 in Colorado, they may be relatively small but what they lack in size they make up for in reputation. In addition to drug/gun operations in the Midwest and South they’ve a noticeable presence in Germany. Secretive and efficient, these guys mean business.\n\nVagos\n\n1965, California, also known as the Green Nation on account of their colours. A big club with around 47 Chapters in the US and, much more recently, Australia and Sweden; they’re a natural enemy of the Hells Angles who, in the mid 60’s, were becoming established in a similar locale with comparable business interests.\n\nMongols\n\n1969, California. Not quite as big as the Vagos but steadily growing. Like many of the clubs here they’re making a name for themselves in Australia which has piqued the attention of the locals, The Comanchero and The Rebels MC, themselves rapidly expanding clubs with chapters popping up across the globe. Despite alleged links to drugs, extortion and robbery the MC claim to have excluded drug addicts and criminals from the organisation as per a new code of conduct.\n\nPagans\n\n1959, Maryland, this once Triumph-riding band of brothers were a legit bike club but by the early 1970’s they’d pitched themselves against the HA and began running guns. On the surface they’re relatively small in number but they’ve some very powerful friends, the Italian mafia and Aryan brotherhood among a few which is why they’re classed as one of the ‘Big 4’ by the Bureau of Alcohol, Tobacco, and Firearms.\n\nBandidos\n\n1966, Texas, one of the largest here, 2,500 plus members and operational in over 22 countries and counting. Over the past few years they’ve built up a fearsome reputation with much of the worst, turf, violence occurring in Canada, Scandinavia, Germany, Holland and Australia (with Rebels MC). A recent conflagration in Waco, Texas in May of this year with an assortment of rival clubs resulting in a gun battle and the deaths of nine people suggests that they’re alive and kicking at home too. Their motif ‘we are the people our parents warned us about’ isn’t ironic.\n\nOutlaws/AOA\n\nFounded way back in 1935 in Illinois this is the oldest outfit on here, their contempt of the HA is part of the modern Outlaw motto - ADIOS: Angels Die In Outlaw States - and after moving into France in 1993 became the only other club on here with a proper presence in the UK, which has resulted in at least one gang-related death. Notwithstanding various convictions for murder, theft, racketeering, drugs etc., the club maintain that they’re not a criminal organisation and learning from past indiscretions as they increase in size.\n\nHells Angels\n\nFounded 1948, California the HA gained notoriety via their close association with what could be broadly described as the hippie movement of 1960’s where they rubbed shoulders with the counterculture pioneers of the day - Allen Ginsberg, Hunter S. Thompson not to mention The Rolling Stones and The Beatles. This has set the HA apart from the other one-percenter* bike clubs, despite the alleged links to organised crime and all that it entails, they’re an established part of American culture.\n\nOn the face of it they’re a slick organisation and ferociously protective of their reputation, at best (note ‘best’) they’ll take legal action to businesses that take liberties with their brand - Disney and Alexander McQueen to name but two- but don’t be in any doubt, they’re very much the real deal in one percenter terms. With over 100 chapters spread over 29 countries the Hell Angels remain the largest, best-known, bike club in the world.\n\n* The term ‘one percenter’ derives from a comment by the American Motorcyclist Association (AMA) that ‘99% of motorcyclists were law-abiding citizens’\n\nRead more:\n\nHells Angels vs Outcasts: The UK biker gang wars"}], "The Vagos have over 2,000 members.": [{"url": "https://www.history.co.uk/shows/outlaw-chronicles-hells-angels/articles/history-of-the-vagos-mc", "page_content": "History of the Vagos MC\n\nThe year is 1965. USA are in the middle of the Vietnam War, Martin Luther King has recently marched from Selma to Montgomery and Roger Miller’s ‘King of the Road’ is number one. Thirteen bikers meet on the corner of Eighth and Davidson in San Bernardino, California to form the Vagos Motorcycle Club, beginning a history that would involve drug trafficking, clashes with the police and a violent rivalry with the Hells Angels.\n\nThe elected president was Rudy Esparza, nicknamed Puro, who led the new club in selecting their name. Other names considered included Coffin Dogers MC and Satan’s Saints MC, but Vagos MC, Spanish for vagabond, was chosen. Their new patch, a red devil on a green background, was inspired by an image of a devil in LIFE magazine entitled ‘Return from hell.’\n\nMore Outlaw Motorcycle Gangs (OMGs) were established in the 1960s than in any other decade. The outlaw status is given to groups who are not sanctioned by the American Motorcyclists Association (AMA). They are also known as 1%ers, a term which originated after the Hollister biker riot in 1947 when the AMA allegedly claimed the 99% of bikers were law abiding citizens, although the AMA have no record of issuing this as an official or public statement.\n\nBikers would often move between clubs or find their club being absorbed into a larger club. Puro had previously been with the Psychos MC and others joined from clubs including El Diablo MC. The question of whether the Vagos would absorb or be absorbed was very quickly answered as more Chapters sprang up across California. In 2014 the FBI listed the Vagos as one of the largest Outlaw Motorcycle Groups in Western America with 600 members in 24 Chapters throughout America, as well as Chapters in Canada, Mexico and Europe.\n\nThe Mafia on wheels?\n\nDescribed by Vagos infiltrator Charles Falco as “the mafia on wheels” the Vagos have more than earned their 1%er patch. Drug related arrests have been made throughout their colourful history. In 1987 the head of the South Bay Chapter and President of the Desert Hot Springs Chapter along with three others all pleaded guilty to conspiracy to distribute methamphetamines. Over 40 pounds of cocaine and eight pounds of methamphetamines (and a rocket launcher!) were seized in a 2011 raid. And in 2014 four Vagos members were arrested by the FBI for selling methamphetamines.\n\nAlongside money laundering and weapons trafficking, the Vagos are also known for their general violence, especially with rival OMGs. As the Vagos attempted to expand their territory tension erupted between them and other OMGs most notably the Hells Angels. In 2001 a bloody melee broke out between the Vagos and the Angels in the Californian city of Costa Mesa. And in 2010 an argument over which gang got to hang out in the Starbucks in Santa Cruz escalated. A brawl outside the coffee shop led to a gunfight in Chino Valley, several drive by shootings and a bitter feud.\n\nThe authorities have successfully infiltrated the Vagos a number of times. George Rowe, a street criminal whose friend had disappeared after an incident with the Vagos, volunteered to go undercover as part of Operation 22 in 2003. His evidence gathered over 3 years resulted in 42 arrests and convictions for crimes as serious as murder. Whilst Charles Falco worked his way up to number two of the Victorville Chapter and provided the ATF (Bureau of Alcohol, Tobacco and Firearms) gathering enough information to make 62 arrests for crimes including assault and murder. Fun fact, both Rowe and Falco have written books about their experiences and actually appear as characters in each other’s books.\n\nHowever the Vagos have their own weapon in their ongoing battle with the police- the lawsuit. In 1990 the Vagos sued the police and received a $2 million settlement claiming they were targets of massive police abuse in the early eighties. And in 2010 when the Vagos were blamed for a spree of homemade booby traps that targeted the police, they once again sued and received a settlement that included a public statement and the return of property seized the previous year.\n\n1%ers\n\nAs with all criminal groups the Vagos don’t advertise their more notorious crimes. Their PR website vagosmcworld.com, presents them as a club rather than a gang. Their consistent response to arrests is that it is not all of their members committing crimes, but a few bad apples. So, organised crime syndicate or a club where just 1% of the 1%ers are giving them a bad name…?"}, {"url": "https://markozen.com/2021/10/12/notorious-motorcycle-gangs-in-the-united-states-and-canada/", "page_content": "\n\n10 most infamous gangs in the United States\n\n#10 Vagos\n\nThe Vagos Motorcycle Club was started in San Bernardino, CA in the 1960’s. Members of the club often wear green and bear a patch of the Norse god Loki riding a motorcycle. The club has approximately 24 chapters spread across the western United States in states such as Arizona and Nevada and also 3 in Mexico.\n\nThe Vagos have been the subject of several investigations by the FBI and the ATF for illegal activity such as the production and distribution of methamphetamine, murder, money laundering and weapons violations. A highly coordinated investigation in March of 2006 led to the arrests of 25 Vagos members and their associates in what has been labeled as the largest investigation in Southern California’s history.\n\n#9 Free Souls\n\nThis particular motorcycle gang was started in the state of Oregon in the late 1960’s. Their patch consists of an ankh, an ancient Egyptian symbol in the shape of a cross, in the center of a motorcycle rim and tire. All of their chapters, with the exception of one in Vancouver, Canada, are located within the state of Oregon.\n\nOn May 2, 2007, three members of The Free Souls Motorcycle Club were arrested and charged with various crimes. Amongst the evidence were illegal drugs, weapons and stolen motorcycles all of which were seized as part of the investigation and arrests.\n\n#8 Bandidos\n\nFounded in San Antonio, TX in 1966 The Bandidos are among the more notorious of American Motorcycle Clubs. The gang’s patch bears a cartoon-ishly obese Mexican wearing a large sombrero and carrying a machete in one hand and a pistol in the other. The colors of gold and red were adopted as the club’s colors due to the fact that their founder was a former Vietnam Marine veteran. The Bandidos have around 90 chapters spread across the U.S. alone, but they have also branched out as far as Asia, Germany and Australia.\n\nThe Bandidos gang has a long and brutal history of illegal activity. A member of The Bandidos was arrested, tried and convicted of the 2006 murder of a well known flyweight boxer and a member of the rival Hell’s Angels Motorcycle Club was sniped while leaving a restaurant in March of that same year during The Bandidos 40th Anniversary of the clubs annual birthday celebration. Police suspect that members of The Bandidos are responsible for the murder. Other members have been arrested from anything from murder to drugs and illegal weapons possession as well as assault and racketeering charges.\n\n#7 Highwaymen\n\nThe Highwaymen were formed in Detroit, MI in 1954. Their chapters have spread across the state of Michigan as well as other U.S. states and have reached as far as Norway and England. Their club colors are black and silver and their insignia is a winged skeleton wearing a motorcycle cap and a leather jacket. The Highwaymen also have their own mottos which are: “Highwaymen Forever, Forever Highwaymen” and “Yea, though we ride the highways in the shadows of death, we fear no evil, for we are the most evil mother fuckers on the highway.”\n\nDespite being the largest motorcycle club in the city of Detroit, they are not acknowledged in the Detroit Federation of Motorcycle Clubs due to their violent and criminal reputation. In May 2007, after a two year investigation into the gang’s activities, the FBI raided homes and chapter clubhouses resulting in the arrests of 40 Highwaymen and associates. The charges included insurance and mortgage frauds, murder for hire, cocaine trafficking, police corruption and racketeering.\n\n#6 Warlocks\n\nThe Warlocks were founded in 1967 in Philadelphia, PA and gained a large number of members after the end of the Vietnam War. Consisting only of white males, The Warlocks have spread through the state of Pennsylvania and a good portion of the northeastern United States and also have chapters in the southeast United States as well as overseas in Germany and England. Their club colors are red and white and they use the Greek mythological figure of a winged Harpy as their insignia. Members often adorn themselves and their vests with white supremacy insignia as well.\n\nIn 2008, Tommy Zaroff, a former President of the Bucks County, PA chapter was arrested on suspicion of possessing 10 pounds of methamphetamine. In October of the same year four members of The Warlocks were arrested and charged with producing, transporting and distributing methamphetamine throughout Berks and Montgomery Counties in Pennsylvania. It is alleged that they sold over 500 lbs. of methamphetamine worth approximately $9 million.\n\n#5 Sons of Silence\n\nThe Sons of Silence are another “1%er” motorcycle gang that was founded in Niwot, Colorado in 1966 and featured in a 2009 episode of Gangland on The History Channel. Since 1966 The Sons of Silence have spread across the United States, with concentrations in the eastern U.S. They also have several chapters spread throughout Germany.\n\nThe Sons of Silence have adopted the motto “Donec Mors Non Seperat”, which is Latin for “Until Death Separates Us”. The club patch has been adopted from the American Eagle logo used by the Budweiser beer company and bears an eagle superimposed over the letter A with their motto underneath.\n\nIn October of 1999, 37 members of the Sons of Silence were arrested on drug trafficking and illegal weapons charges during one of Denver’s largest federal undercover operations. During the raids, The ATF seized 20 lbs. of methamphetamine, 35 firearms, four hand grenades, 2 silencers as well as cash and motorcycles.\n\n#4 Outlaws\n\nThe Outlaw Motorcycle Club is one of the more notorious and oldest clubs on this list. The gang started in Matilda’s Bar on old Route 66 in McCook, IL in 1935. Using the insignia on Marlon Brando’s leather jacket in The Wild One as inspiration, the club adopted the skull with cross pistons as their official club patch. Since the club began over 70 years ago their chapters have spread widely across the United States and have been well established in Australia, Asia, Europe and North and South America.\n\nHarry Joseph Bowman, The World Leader of The American Outlaw Association (A.O.A.), was the international president of The Outlaws Motorcycle Club and presided over 30 chapters in the U.S. and 20 chapters in 4 other countries until he was sent to prison for 3 murders in 1999 after being on the F.B.I’s Top 10 Most Wanted Fugitive list in 1998. Across the globe members of The Outlaws have been suspected, arrested, tried and convicted of countless crimes from prostitution, trafficking in narcotics and stolen goods, arms dealing, extortion and murder.\n\n#3 Pagans\n\nThe Pagans formed in Maryland in 1959 and by 1965 had expanded rapidly. Their patch depicts the Norse fire giant Surtr sitting on the sun wielding a sword with the word Pagans in red, white and blue. Members are known to wear their patches on cut-off denim jackets with accompanying white supremacist and Nazi insignia patches. The club’s members have also been seen with tattoos of ARGO (Ar Go Fuck Yourself) and NUNYA (Nun’Ya Fuckin’ Business). Their territory seems to be confined strictly to the eastern coast in the United States.\n\nAside from their history of violent rivalry with the notorious Hell’s Angels Motorcycle Club, The Pagans have been associated with numerous crimes including murder, arson, drug smuggling and have been linked to organized crime in the upper northeastern United States. In February of 2002, seventy-three members of The Pagans Motorcycle Club were arrested in Long Island, NY after violence erupted at a motorcycle and tattoo ball. The Pagans allegedly went to the ball specifically to confront members of The Hell’s Angels MC resulting in 10 wounded bikers and one murdered Pagan member. Then in 2005, members of The Pagans allegedly shot and killed the Vice-President of the Philadelphia Chapter of The Hell’s Angels.\n\n#2 Mongols\n\nThe Mongols, also known as Mongol Nation or Mongol Brotherhood, were formed in 1969 in Montebello, California from Hispanic bikers who were refused entry into The Hell’s Angels MC due to their race. Their colors are black and white and their insignia bears the name Mongols in large black letters above a pony-tail sporting man riding a motorcycle wearing a leather vest and sunglasses while carrying a scimitar or cutlass. Mongol chapters are concentrated in the western United States, but have also opened in Canada, Mexico and Italy.\n\nIn 2008, the ATF coordinated a sting against The Mongols MC where 4 agents went undercover to become fully patched members while gaining intelligence about the gang’s activities. This operation resulted in 38 arrests including the arrest of the club’s president, Ruben “Doc” Cavazos. As part of the operation 160 search warrants were served and 110 arrest warrants were carried out. As part of the operation, members of The Mongols MC are now prohibited by law from the use of the Mongol MC logo and insignia including wearing the patches on vests or any other garb.\n\n#1 Hell’s Angels\n\nProbably the most well known American biker gang, The Hell’s Angels have a long and thorough history on American highways. Much information concerning their origins is hazy due to their long-standing code of secrecy. Sometime within the 1940’s or 1950’s in California Hell’s Angels MC was formed. Their insignia is the “death’s head” logo which is copied from the insignia of the 85th Fighter Squadron and the 552nd Medium Bomber Squadron. Red lettering over white backgrounds stands for the club’s colors. With so much popularity, Hell’s Angels chapters have sprung up across the Untied States as well as Russia and New Zealand and the continents of North America, South America, Europe and Australia.\n\nThe Hell’s Angels MC have gained mass notoriety in the U.S. due to their involvement in many highly publicized run-ins with the law and rival biker gangs. The most note-worthy of publicized events happened during the Altamont Free Concert at Altamont Speedway in December of 1969 where it is alleged that The Rolling Stones hired members of The Hell’s Angels to stand-in as bodyguards for the band. Violence erupted in the crowd and also onto the performance stage and as a result one male was stabbed to death after brandishing a pistol.\n\nAnother publicized incident occurred in Laughlin, Nevada in Harrah’s Casino and Hotel. A violent confrontation in the casino between rival Mongols MC resulted in one fatally stabbed Mongol gang member and two fatally shot Hell’s Angels members.\n\nHonorable mention: The Pissed off Bastards of Bloomington\n\nThe Pissed Off Bastards of Bloomington (POBOB) is a motorcycle club that, in 1947, along with the Boozefighters and the Market Street Commandos, participated in the highly publicized Hollister riot (later immortalized on film as The Wild One).\n\nAfter the Hollister incident, a prominent Pissed Off Bastard named Otto Friedli (28 Jun 1931 – 17 Mar 2008) split with the club and formed his own group on March 17, 1948 in Fontana, just west of San Bernardino. He called it the Hells Angels Motorcycle Club. In 1954 Otto’s new club merged with the Market Street Commandos to become the Hells Angels San Francisco Chapter.\n\nCanada\n\nHells Angels\n\nCriminal Intelligence Service Canada describes the Hells Angels as the largest “outlaw motorcycle gang” in the country, with active chapters concentrated mostly in Quebec, Ontario and British Columbia.\n\nIn its 2004 report, CISC said the Angels derives “significant financial income” from criminal activities such as prostitution, fraud and extortion but primarily relied on drug trafficking for income.\n\nThe gang moved into Ontario in 2000. Before that, its only presence in the province was with a chapter of the Nomads, the club’s elite branch. The Nomads doesn’t tie itself to geographical locations and doesn’t have formal clubhouses, like other chapters.\n\nWithin a year, the Angels had absorbed members of the Para Dice Riders, Satan’s Choice and Last Chance, giving them at least 100 members in the Toronto area — the highest concentration of Hells Angels in the world.\n\nIn mid-April 2009, police targeted more than 150 people linked with the Hells Angels in early-morning raids mostly in Quebec, but also in New Brunswick, France and the Dominican Republic. They also seized four suspected Hells Angels bunkers.\n\nBandidos\n\nIt’s considered world’s second-most powerful criminal biker gang, with more than 2,000 members in 14 countries, according to NGIC’s 2009 report, which describes the Bandidos as a “growing criminal threat.”\n\nThe Bandidos was founded in the 1960s in Texas. The club’s old guard was said to be against its absorption of the Rock Machine’s Ontario branches for fear of igniting the same kind of war with the Hells Angels that gripped Quebec for much of the 1990s and left at least 150 people dead.\n\nIn April 2006, eight people — all Bandidos members or associates — were found dead in a farmer’s field near the small town of Shedden, Ont., about 30 kilometres southwest of London. Police said the killings virtually wiped out the Toronto chapter of the Bandidos.\n\nOutlaws\n\nFirst established in the United States in 1935, the gang came to Canada in 1978 when several chapters of Satan’s Choice in Montreal changed allegiance and set up shop as the Outlaws Motorcycle Club of Canada. The group is known to detest members of the Hells Angels.\n\nRock Machine\n\nSecond only to Hells Angels in Quebec. A long-running turf war with the Angels left more than 150 people dead as the two fought over the lucrative trade in illegal drugs. The war also led to the passage of anti-gang legislation by the federal government.\n\nAs the Hells Angels expanded into Ontario, so did the Rock Machine. The organization established three chapters. In 2001, it aligned itself with the Bandidos.\n\nSatan’s Choice\n\nOnce one of Ontario’s strongest motorcycle gangs, Satan’s Choice became part of the Hells Angels’ 2000-2001 expansion into Ontario. Satan’s Choice had branches in Keswick, Kitchener, Oshawa, Sudbury, Simcoe County, Thunder Bay and Toronto — but nothing outside the province.\n\nPara Dice Riders\n\nAnother group that was once among Ontario’s strongest biker gangs. Its membership was limited to the Toronto area. The group was absorbed by the Hells Angels in 2001, when the Angels moved into Ontario.\n\nLast Chance\n\nAnother small Ontario-based biker gang that agreed to switch over to the Hells Angels when the world’s most power biker gang moved into the province\n\nLobos\n\nOriginally concentrated in the Windsor, Ont., area, the Lobos motorcycle gang decided to take up the Hells Angels on its offer of merger in 2001.\n\nLoners\n\nThe Loners Motorcycle Club was founded in Ontario in 1979 with a handful of chapters, including a now-defunct one in southwestern Ontario that was headed by Wayne Kellestine. As part of its Ontario expansion drive, the Hells Angels tried to persuade the St. Thomas Loners chapter to join the Angels. Kellestine — who was injured in an assassination attempt in 1999 — resisted.\n\nThe club has expanded to the United States and Europe, but in Ontario, its highest profile in recent years was a legal fight by a Toronto chapter to keep its mascot on its property north of the city, in 2001. The neutered, declawed lion named Woody was moved to an animal sanctuary.\n\nVagabonds\n\nAnother Ontario-based motorcycle gang that was more or less absorbed by the Hells Angels when it expanded into Ontario in 2000-2001.\n\nThe Red Devils\n\nSaid to be the oldest motorcycle gang in Canada, the group is made up of a couple of dozen members concentrated in the Hamilton, Ont., area."}, {"url": "https://bettermotorcycle.com/motorcycle-gangs-facts/", "page_content": "The world of motorcycle gangs consists of diverse members with different backgrounds, but one thing that unites them is the love for riding motorcycles. Veteran motorcycle gang members enjoy getting together to ride motorcycles and maintain their bikes. They invite new riders to join them in hopes that they will find the same joy as they do. Younger members want to be part of a group where they can find friends, support, and an identity.\n\nMotorcycle gangs are notorious for their involvement in various criminal activity including drug distribution, prostitution, murder, and human trafficking. These gangs constitute an organized group of individuals who share the same interests and enjoy the fellowship of each other. Gang members often wear clothing with symbols on it to identify themselves as part of that specific gang. Each gang has its own set of rules, leaders, principles that determine how they act outside of society’s norms.\n\nWhat is a Motorcycle Gang?\n\nMotorcycle gang members have been an integral part of the motorcycle culture since the 1950s. The culture, lifestyle, and beliefs of the motorcycle gang culture are often closely linked to the larger subculture of the outlaw motorcycle gang and Hells Angels. The culture is largely defined by the use of motorcycles, and the social, physical, and ideological differences between the “moto-gang” and the “outlaw” motorcycle gangs.\n\nDifference between a ‘Motorcycle Club’ and Motorcycle Gang?\n\nMotorcycle clubs are motorcycle clubs that meet certain criteria, and typically operate in close proximity to each other, more often than not in the same city. They may have members that travel to different clubs in different cities, or they may only have members in one city. The culture is largely defined by the use of motorcycles, and the social, physical, and ideological differences between the “moto-gang” and the “outlaw” motorcycle gangs.\n\nMotorcycle gangs are a subculture of motorcycle clubs that are considered to be a criminal enterprise. They are generally organized and based in a specific geographical area, as well as having members of different clubs. They may be based in the same city, but may travel to different cities. Its members are usually young people who are mostly involved in criminal activities such as drug trafficking, robbery and extortion, prostitution, illegal gun ownership, and other illegal activities.\n\nThe History of Motorcycle Gangs\n\nMotorcycle gangs, or “biker gangs,” consist of all-male groups that have a common interest in motorcycles. They often have a code of conduct and a government structure. Gangs vary in size from small one to large groups with well organized cells that can be in constant contact with each other. As time has progressed, the original motorcycle gang has gradually become more organized and sophisticated.\n\nSome motorcycle clubs are well-known for their affiliation with gangs, such as the Hell’s Angels and Vagos Motorcycle Clubs. These groups have a long history of violence, drug trafficking, and other criminal activity. Motorcycle gangs can be traced back to the 1940s when WWII veterans returned from battle and began riding across the country in large numbers. These riders often competed against each other for parts, rides, and women which led to fights and deaths.\n\nThe First Motorcycle Gang: The Hell’s Angels\n\nA group of rebellious American WWII veterans formed a motorcycle club in 1948 called the ‘The Hell’s Angels’ in California. In the following decades, they would come to be known as an outlaw gang with a large following. What is less well-known about this popular club is their purposeful allegiance to military values and principles. They embody an old American tradition of individualism and personal freedom, but also abide by hierarchy and rule under a president.\n\nThe Hell’s Angels Motorcycle Club, founded in 1948 by a group of World War II veterans who were drawn to the camaraderie and opportunity for adventure, has grown to more than 1,000 members. The club’s motto is “When we do right nobody remembers, when we do wrong nobody forgets”. Since the formation of the Hells Angels Motorcycle Club in 1948, motorcycle gangs have been growing in popularity. Recently though, it seems that these gangs are taking a turn for the worse. Members are beginning to make headlines for their involvement in criminal activities such as murder, drug trafficking, and assault. The Hell’s Angels Motorcycle Club was founded in San Francisco by WWII veterans.\n\nGrowth and Development: The 1960s and 1970s\n\nOver the course of 60 years, there have been many changes in gang culture and motorcycle gangs. In the 60s and 70s motorcycle gangs had a different role in society. A lot of things were going on for these gangs such as an increase in recruitment and initiation events such as robberies and assaults. It is important to know the history behind this type of culture so we can understand how it has evolved.\n\nMany motorcycle gangs in the 1960s, 1970s, and 1980s were connected to other criminal activities such as drug trafficking, racketeering, and other types of organized crime. This was not always the case in the past, but during that time it became common for gangs to do everything illegal. These groups grew through recruitment and often recruited individuals who had no previous criminal history or even prior association with motorcycles.\n\nDecline: 1980s and 1990s\n\nIn the late 1970’s and early 1980’s, motorcycle gangs were a common sight in US society. With a sense of independence and freedom from societal norms, these groups became a popular form of emotional release. However, as time progressed, so did society. In 1980, motorcycle gangs seemed to have become less rebellious and more inclined towards organized crime. Motorcycle gangs now have international ties with criminal organizations such as the Hells Angels that have been known to commit violent crimes such as murder.\n\nSince the 1980s, motorcycling gangs have declined. There are many factors that contribute to this decline. One of these is that states have taken action against biker gangs by imposing tougher penalties for crimes committed by members of these groups. The other major factor is the growing popularity of off-road vehicles for recreational use, which has caused the number of people who modify their bikes for street riding to dwindle. The American Outlaw Association was founded in response to the decline in numbers and attempted to strengthen biker culture by cultivating new members. They also helped outlaw clubs reform so that they could function legally while retaining their identity.\n\nToday, motorcycle gangs in the United States are becoming less prevalent than they were only a few decades ago. Consequently, motorcycle gang-related violence has lessened. In 1980, about 1% of all murders in America was committed by members of a motorcycle gang. In 2010, that number had been reduced to 0.4%. This is primarily due to the decline in membership from over 5,000 “one percenters” in the early 1970s to a current membership of under 2000 members.\n\nModern Times: 2000s\n\nOver the past few decades, motorcycle gangs have had to adjust their tactics in order to survive. The continued enforcement of anti-gang legislation and the rise of social media has forced these groups to evolve. Their new methods are still illegal, but more subtle than before. It’s now more likely for members of these gangs to evade police detection by conducting business on public streets or having meetings in restaurants where they can’t be overheard.\n\nThe 6 Most Dangerous Motorcycle Gangs\n\nEach year, there are many motorcycle gang-related deaths in the United States. The majority of these deaths, however, are not caused by direct gang violence. Instead, much of the danger that these gangs pose is due to gang members who commit crimes such as drug trafficking and other illegal activities. As a result, motorcycle gangs are typically found in areas with high crime rates. The 10 most dangerous motorcycle gangs are listed below in order from least to most dangerous.\n\n1. Hells Angels\n\nYear Founded – 1948\n\nMembership – 2500\n\nMajor Presence – California\n\nThe Hell’s Angels is the best known and most dangerous one-percenter in America, which has a large concentration of them in California. There are 230 chapters of Hells Angels in the US with members elsewhere, too. The club is all about violence, freedom and bad reputation. Members of this gang commit activities such as all types of criminal acts. Charges that these guys faced have ranged from kidnapping, rape, racketeering, murder, assault, robbery, drug dealing, etc.\n\nThe Department of Justice indicates the biker gang to be a significant part in manufacturing and distributing LSD, methamphetamine, heroin hashish Ecstasy and PCP. As a club, Hells Angels have been in operation since the 1950’s and aren’t anything new. It may come as a surprise that Hell’s Angels have a business license and their own website. They are a fully-incorporated club that thrives on criminal activities like extortion, drug trade, etc. .\n\nThe gang recruits new members through a process of initiation. It is a mandatory process for all potential new members. This procedure includes torture and physical and mental abuse. These guys think nothing of using physical violence and their members are definitely not afraid to use guns.\n\n2. Bandidos\n\nYear Founded – 1966\n\nMembership – 5000 worldwide\n\nMajor Presence – South (Texas)\n\nThe Bandidos Motorcycle Club was founded in the year 1966. It’s stronghold lies in Texas, which has a chapter of 240 to 270 members. Being a predominantly white club, Bandidos are extremely territorial about their territory. This increased their violent reputation especially when they were at war with The Cossacks– one of their most enticing rivalries which ended with the two gangs killing 9 and injuring 37 on May 17th, 2015 as part as a feud that lasted for years all as a result of the “Texas turf”.\n\nThe gang has since been declared as Tier-2 criminal motorcycle gang by TWC’s report and identified as one of America’s many emerging gangs. After the Waco shootout, Bandidos are listed as one of the Big Four Outlaw Motorcycle Clubs by the FBI. This club involved itself in violent crime to an extreme degree. Along with other members alike, it engaged in the distribution of drugs across Mexico-US borders. They are also involved with methamphetamine distribution, marijuana trafficking, and cocaine dealings.\n\n3. Mongols\n\nYear Founded – 1969\n\nMembership – 2000\n\nMajor Presence – Southern California\n\nMongols Motorcycle Club is a one-percenter and white supremacist criminal and motorcycle gang that was formed in Montebello, California by Hispanic and Native American members to be an alternative for members of different races who were not allowed to join Hells Angels. They are mainly located in multiple states across the United States, but also have chapters in Canada, Germany, Spain, Ireland, Australia, France, the Netherlands and New Zealand (because why not?).\n\nMongols like other biker clubs earn money thru violent crime like prostitution (aka pimping), extortion & robbery. They are most known though for definitely being involved with methamphetamine aka meth; which they make & distribute to local bikers as well as club affiliates.\n\n4. Pagans\n\nYear Founded – 1957\n\nMembership – 1500\n\nMajor Presence – East Coast States of Maryland, Pennsylvania, New York, and New Jersey.\n\nThis biker gang did not start out as a crime syndicate. Formed in 1957, Pagans was originally an ordinary motorcycle club. The group became involved with criminal activity in 1965, when veterans joined the club. Veterans were often bitter towards the government in this era due to their poor treatment during military service (and still are today). Pagans dominates the East Coast of the U.S., and is known for committing drug trafficking, including meth, marijuana, and heroine; violent assaults of civilians; and has even committed random drive-by shootings of former members.\n\nThis outlaw motorcycle club has patches identifying them as, “outlaws” with slogans like “#1%er”. They also have various patches bearing coded numbers and letters because they are trying to escape the watchful eye of law enforcement. Many members of the club are on federal and state terrorism lists.\n\n5. Outlaws Motorcycle Club\n\nYear Founded– 1935\n\nMembership – 1700+\n\nMajor Presence – Florida\n\nThe Outlaws Motorcycle Club is a biker gang that was formed in the US in 1935. This group has been considered one of the largest and most prominent gangs by many. The membership grew when they changed from being a ruthless motorcycle-driven outlaw to a brotherhood in the 1950s. The club’s patch even became much more emblematic when it went from depicting an American Indian warrior wearing an hourglass to a ghost wearing a Harley Davidson gas meter two pistons ironed on his back.\n\nThe Outlaws Motorcycle Club is the oldest biker gang in the US. It is the top-most 1%er and is respected by other gangs. It reorganized in the 1950s changing its original patch from a winged motorcycle to a skull with two pistons. It is know for running support clubs like the Black Pistons Motorcycle Club which serves as a club for recruitment. This Criminal Enterprise is known for extremely rigid riding rules and brotherhood rules with no room for women whom they consider property that may be exchanged for drugs.\n\nAs one of the Big Four bike gangs in the US, this gang is notorious for the illegal activities they engage in. The members are suspects of murder, execution-style shootings, drug dealing, money laundering, extortion, shootouts and firebombs. This club has a reputation for exacting revenge against rival groups and has ongoing friction with Hells Angels gangs. They even have an acronym-ADIOS which stands for “Angels Die in Outlaw States” as a warning to other rival biker gangs.\n\nDespite their name, this gang isn’t quite considered an outlaw group anymore due to being recognized by law enforcement agencies through federal contract agreements.\n\n6. Vagos Motorcycle Club\n\nYear Founded – 1965\n\nMembership – 4000\n\nMajor Presence – Western United States\n\nThe Vagos Motorcycle Club came up originally in Southern California. Although there are over 4000 members to this club, they consider themselves a large and intricate community with bylaws and legitimate businesses. Originally the Vagos Motorcycle Club was created as an outlaw motorcycle gang but now its members are wanted for highway shootings, murder, and multiple other violations. The Vagos MC primarily deals with drug and weapon smuggling in the US and across the Mexican border. In a 2011 raid, eight pounds of methamphetamine, forty pounds of Cocaine and a rocket launcher were seized from their houses by authorities leading to the arrest of thirty Vagos members- that’s thirty too many!\n\nThe Vagos gang has created its share of tensions with the Hells Angels, but it hasn’t stopped them from getting involved in firefights. The Vagos motorcycle gang has even lost legal battles against law enforcement for defaming their reputations, even though they’ve won cases encouraging others to take down their enemies."}, {"url": "https://finance.yahoo.com/news/members-vagos-bikers-cleared-charges-015951927.html", "page_content": "Members of Vagos bikers cleared of all charges in US court\n\nFILE - In this Sept. 23, 2011, file photo, police officers keep an eye on handcuffed men at the east entrance to John Ascuaga's Nugget hotel-casino after a shooting in Sparks, Nev. Eight accused Vagos biker gang members were acquitted Monday, Feb. 24, 2020, of all charges including allegations they were part of a broad criminal racketeering enterprise that committed violent crimes including the killing of a rival Hells Angels leader in a northern Nevada casino shootout in 2011. (The Reno Gazette-Journal via AP, File)\n\nVagos Trial Casino Shooting FILE - In this Sept. 23, 2011, file photo, police officers keep an eye on handcuffed men at the east entrance to John Ascuaga's Nugget hotel-casino after a shooting in Sparks, Nev. Eight accused Vagos biker gang members were acquitted Monday, Feb. 24, 2020, of all charges including allegations they were part of a broad criminal racketeering enterprise that committed violent crimes including the killing of a rival Hells Angels leader in a northern Nevada casino shootout in 2011. (The Reno Gazette-Journal via AP, File)\n\nLAS VEGAS (AP) — Eight accused Vagos biker gang members were acquitted Monday of all charges alleging they were part of a broad criminal racketeering enterprise that committed violent crimes for more than a decade, including the killing of a rival Hells Angels leader in a casino shootout in 2011.\n\nGasps erupted in the Las Vegas courtroom as U.S. District Judge Gloria Navarro read the jury's not guilty verdicts for each man.\n\n“This is what happens when the government tries to put people away with tricks and liars,” said Daniel Hill, attorney for Pastor Fausto Palafox, former international president of the Vagos Motorcycle Club and first-named defendant in the case.\n\nThe jury deliberated the equivalent of only about two days after more than five months of contentious testimony at the troubled trial that had some witnesses stunningly recant their own stories on the witness stand.\n\nDefense attorneys lost bids during trial to have Navarro throw out the case as deeply flawed — including after prosecutors disavowed the testimony of their own star witness, former Vagos member Gary “Jabbers” Rudnick.\n\nNavarro said repeatedly it would be up to the jury to decide the facts and reach a verdict.\n\nRudnick testified and then acknowledged fabricating his account that Palafox issued a “green light” go-ahead to kill Jeffrey Pettigrew, then-president of the Hells Angels chapter from San Jose, California.\n\nPalafox, 56, watched Monday as the 10 women and two men filed out of the jury box, and he mouthed the words, “Thank you.”\n\nU.S. Attorney Nicholas Trutanich declined outside court to talk about how the prosecution unfolded and whether the government will continue to trial for 13 other accused Vagos defendants in the case.\n\n“I’m grateful for the court’s time, the jury’s consideration and the diligent work of the assistant U.S. attorneys,” Trutanich said, adding that he believed the jury reached a verdict it found “fair and just.”\n\nThe government chose to take the Vagos case to trial despite Rudnick previously recanting his testimony at a state trial that led to a murder conviction in Reno against Vagos member Ernesto Manuel Gonzalez. The Nevada Supreme Court threw out that result because of improper jury instructions. Gonzalez was awaiting a retrial when federal charges were brought.\n\nGonzalez, 61, was among the defendants acquitted Monday. Others were Albert Lopez, Albert Perez, James Gillespie, Bradley Campos, Cesar Morales and Diego Garcia. None testified at trial. All are from California. They range in age from 36 to 70.\n\nCollectively, they were accused of conspiring since 2005 to deal drugs and commit violent crimes including killings, robberies, extortion and kidnappings in California, Arizona, Hawaii, Oregon, Utah and Nevada.\n\nU.S. Justice Department attorney John Han told the jury a “war” between the Vagos and Hells Angels over territory and respect in California dates to 2005 and continues today.\n\nThe focus of the case was the shooting inside the Nugget casino in Sparks. The jury was told Rudnick argued with Pettigrew, and that Pettigrew threw a first punch before pulling a gun and firing several shots while casino patrons dived under blackjack tables and behind slot machines.\n\nThe melee continued for about two minutes before Pettigrew was shot by Gonzalez. His attorney, Michael Kennedy, maintained that his client was within his rights to defend himself and others when he shot Pettigrew.\n\nThe acquittals came in the same courtroom and before the same judge who in December 2017 found flagrant misconduct by prosecutors and dismissed criminal charges against Nevada rancher Cliven Bundy, his sons and supporters in a 2014 armed standoff with government agents. An appeal of that dismissal is pending.\n\n___\n\nThis version corrects that Gonzalez is 61, not 42."}, {"url": "https://motorcyclehabit.com/famous-motorcycle-gangs-everything-youd-like-to-know/", "page_content": "✓ SAVINGS TIP: Find out if you're overpaying for motorcycle insurance! Save money by comparing quotes. Enter your zip to get started. ZIP:\n\nI often get people asking me if I have ever met a biker gang on the road. No I haven’t, and you probably wouldn’t realize it if you did meet a motorcycle gang member unless they had their vest on. There are very few members of motorcycle gangs compared to how many people ride motorcycles.\n\nI want to point out one thing before you dive into this article. Most of these gangs or clubs have been involved in heavy criminal activity throughout their history. That does not mean that all members of these clubs are criminals. Most members are just looking for brotherhood and a group to ride with.\n\nMy advice to those people who are worried about meeting a motorcycle gang is always the same. Be respectful to them and leave them alone and you’ll be perfectly fine.\n\nIn this article I’ll outline all the famous motorcycle gangs, where they’re located, membership numbers, and some of the things they did to become famous. Some of the most famous motorcycle gangs include:\n\nHell’s Angels\n\nBandidos\n\nMongols\n\nPagan’s Motorcycle Club\n\nSons of Silence\n\nOutlaws Motorcycle Club\n\nVagos Motorcycle Club\n\nHighwaymen Motorcycle Club\n\nFree Souls Motorcycle Club\n\nRoad Knights\n\nBrother Speed\n\nNotorious\n\nRock Machine\n\nWarlocks Motorcycle Club\n\nDragons Motorcycle Club\n\nHell’s Angels\n\nCurrent Membership: 2,500 members\n\nThe Hell’s Angels Motorcycle Club was founded in 1948 in Fontana, California and originally consisted of mostly World War 2 veterans. They saw themselves as misfits and outcasts and found brotherhood by riding together with men who had also served in the war.\n\nThe first charters of the club originated in San Francisco, Gardena, Fontana, and Oakland. The club gained notoriety through famous movies that portrayed them, especially in the 1960’s.\n\nHell’s Angels members are typically white males though there are a few members from minority races. Anyone accused of child molestation or applying to become a police officer disqualifies you to become a member.\n\nThe United States Department of Justice defines Hell’s Angels as an organized crime syndicate since the club has been involved in so many illegal activities throughout the years. The club is completely banned in the Netherlands and there are individual charters (or groups) that are banned all over the world.\n\nBandido’s\n\nCurrent Membership: 5,000 members\n\nThe Bandido’s Motorcycle club was founded in 1966 in San Leon, Texas. They are also referred to as “Bandido Nation” and have the motto “We are the people our parents warned us about”. There are currently 210 chapters in 22 countries.\n\nThe club consists mainly of white and Hispanic males, but they have no rules against those of other races or genders joining. In the early days of the club it consisted of mostly Vietnam veterans who came home from the war and felt unwelcomed in their own country. They banded together to enjoy a common interest and it grew rapidly from there.\n\nThe clubs membership is concentrated in the southeast and midwest United States with many other isolated chapters around the world.\n\nThere have been countless gun and drug charges against members of the club, but club members insist that those are the problems of the individual members and not a collective whole. There is a whole laundry list of murders that have happened in Texas that led to convictions of members of the club.\n\nMongols Motorcycle Club\n\nCurrent Membership: 2,000 members\n\nThe Mongols Motorcycle Club is also referred to as “Mongol Nation” by many people and was founded in Montebello, California in 1969. Most of the club members live in southern California, but there are organized chapters in 14 states and 10 countries.\n\nThe club’s official motto is “respect few, fear none” and they seem to live by that motto whole heartedly. Members of the Mongols have been involved in heavy criminal activity since their inception. They have been heavily involved in drug trades, money laundering, robbery, extortion, gun trafficking, murder, assault, and many other felony charges.\n\nThe club insists that those are actions of individual club members and not a message from the club as a whole.\n\nIn 1998 a federal agent infiltrated the club and rose to the position of vice-president of one of the chapters. He was able to convict 54 members of the club with felony charges in a matter of two years. In 2008, four more federal agents were able to infiltrate the club and arrested 110 other members on felony charges.\n\nSeveral attempts have been made to ban the use of the Mongol’s patch, saying that it is an emblem of domestic terrorism. All attempts at banning the patch have been dismissed in court.\n\nPagan’s Motorcycle Club\n\nCurrent Membership: 1,350 members\n\nThe Pagans were founded in 1958 in Prince George’s County, Maryland. They started out as a harmless motorcycle riding club of men owning Triumphs and Nortons but quickly expanded at the end of the Vietnam War.\n\nMembership has dwindled in recent years and members are now only allowed to ride Harley Davidson motorcycles 1,000cc or bigger. Members of the club are concentrated in the northeast US and often have fights over land with members of Hells Angels.\n\nThe Pagans were the ones who originally invented the 1%er patch, which is now used widely by almost all motorcycle clubs. In the 1970’s their membership grew to 5,000 members under a man named John “Satan” Marron.\n\nThere are very few requirements to become a member of The Pagans. The only requirements I could find through my research were that members had to be 21 years or older and have a 1,000cc or greater Harley.\n\nThe Pagans have been heavily involved in drug trafficking over the years, especially in New Jersey and Pennsylvania. There have been many members convicted of murder and assault, most of which was directed at rival gang Hell’s Angels.\n\nSons of Silence\n\nCurrent Membership: 200 members\n\nThe Sons of Silence was founded in Niwot, Colorado in 1966 and quickly spread into many other states in the Midwest and Southeast US. The club spread to Europe in the early 2000’s and has been slowly growing since then.\n\nTheir logo is a copy of the Budweiser logo, a bald eagle flying through an A. Their motto is “donec mors non separate”, meaning “until death separates us”.\n\nSeveral years ago, two federal agents infiltrated the club and were active members for two years while they gathered evidence against other members. 250 law enforcement officers dismantled several of the Colorado chapters and arrested 39 members of the club, including the club president.\n\nFederal agents seized dozens of illegal automatic weapons, hand grenades, homemade bombs, drugs, stolen motorcycles, and mounds of stolen cash. According to a news report, the Sons of Silence were one of the largest meth traffickers in the country.\n\nOne of the local chapters was protected by a 1.5” thick steel door and found inside one of the closets was a shrine to Adolf Hitler with a vulgar sign and weapons hanging below it.\n\nMembership in Colorado has not grown much since the federal agent bust.\n\nOutlaws Motorcycle Club\n\nCurrent Membership: 700 members\n\nThe Outlaws Motorcycle Club or American Outlaws Association (AOA) was formed in McCook, Illinois in 1935. Making it one of the longest running motorcycle clubs in the world. Their primary rivals are members of Hells Angels motorcycle club which gave rise to their motto ADIOS, meaning “Angels Die In Outlaw States”.\n\nThe clubs membership dropped significantly during WW2 as many of the members were deployed to Europe, but grew in even greater numbers after the war. There are several international motorcycle clubs who also refer to themselves as the Outlaws, but these clubs are not affiliated with the American club.\n\nThere is a long list of indictments and convictions of members of the AOA including gun and drug trafficking, murder, assault, illegal possession of firearms, extortion, and other charges. Different AOA chapters across the country are raided by federal agents every few years which results in the seizing of guns, drugs and usually a few arrests of members.\n\nIn 2015 the AOA celebrated their 80th Anniversary with parties and rallies around the world and giving out commemorative patches to members, showing a middle finger with the letters AOA around it.\n\nVagos Motorcycle Club\n\nCurrent Membership: 4,000 members\n\nThe Vagos Motorcycle Club was founded in San Bernardino, California in 1965. The club is also known as “Green Nation” because riders typically wear green clothes or ride green motorcycles. Their insignia is a picture of Loki, the god of mischief, riding a motorcycle.\n\nThe club’s motto is “We Give What We Get”. The clubs membership is most prominent in the western US with some chapters in several countries around the world. The club wears green to pay homage to the Mexican founders of the club.\n\nThe name Vagos comes from the Spanish word Vago, meaning vagabond or wanderer. Most club members receive a patch embroidered with the letters MF, meaning motorcycle family, after a several year probationary period. Some members of Vagos also wear green swastikas with the letters SS under it.\n\nIn 2010 over 30 members of Vagos were arrested in California for creating homemade booby traps and bombs to try and hurt police officers. These arrests were followed by busts across California by law enforcement officials who later seized countless guns, large amounts of drugs, and uncovering several meth labs owned by the group.\n\nThe group has been classified as urban terrorists by several federal agencies and pose a threat to law enforcement officers. Vagos commonly has run-ins with other motorcycle clubs that end badly for both parties.\n\nHighwaymen Motorcycle Club\n\nCurrent Membership: 800 members\n\nThe Highwaymen Motorcycle Club was founded in Detroit, Michigan in 1954. The club has been involved in a lot of very publicized federal investigations and raids throughout the years. Most members live in the Eastern US and has not spread much to the western states.\n\nTheir logo is a black and silver winged skeleton wearing a cap and jacket. The Highwaymen have been banned from the Detroit Federation of Motorcycle Clubs due to violence.\n\nThe Detroit Highwaymen clubhouse in Detroit was condemned in 2010 for being a drug den and is still vacant. In 2007 the FBI arrested 40 members of the Highwaymen in Detroit under charges of racketeering, murder, assault, cocaine trafficking, vehicle theft, and a number of other felonies.\n\nThe large sting operation conducted by the FBI involved 2 undercover agents that joined the motorcycle club. One of them was eventually found and murdered for snitching on the club.\n\nFree Souls Motorcycle Club\n\nCurrent Membership: 200\n\nThe Free Souls Motorcycle Club was founded in Eugene, Oregon in 1968 by Harley Davidson motorcycle riders. The group’s clubhouse and headquarters are still in Eugene today.\n\nThe group’s motorcycle patch is the Egyptian hieroglyphic of an ankh in front of a motorcycle wheel and handlebars. The ankh is the symbol of life. The club’s colors are blue and white, which is what rival clubs refer to the Free Souls as.\n\nThere are also small chapters of the club in Australia and Europe but membership numbers are still small and not growing quickly.\n\nThe last time the group made mainstream news was in 2010 and was actually for a good reason. Several club members were at a meeting in Salem, Oregon when a neighbor’s SUV caught on fire. The Free Souls called the fire department but put out most of the fire before local firefighters got to the scene. Their quick actions saved the house from going up in flames.\n\nRoad Knights\n\nCurrent Membership: Less than 100\n\nThe Road Knights was founded in 1979 in southern New Zealand and has never seen a large number of group members. There are three other chapters in the world; the US, Netherlands, and Thailand.\n\nThe Road Knights have had an ongoing fued with the Mongrel Mob and it came to a boiling point in 2008 when the Mongrel Mob set their headquarters on fire and stole several motorcycles. Most of the former leadership are in jail or have dispersed.\n\nBrother Speed\n\nCurrent Membership: 250 Members\n\nThe Brother Speed Motorcycle Club was founded in Boise, Idaho in 1969 by a group of high school friends. The friends put an ad in the local newspaper to see if anyone in the area was interested in getting together to ride and about 20 people showed up to the first meeting. A name and logo were picked and the club was started.\n\nThe club’s patch is a black and gold winged skull with a cap, goggles, and a scarf. At this point there are only two chapters in Idaho and Oregon.\n\nIn 2009 the club was on a ride outside of Wilsonville, Oregon when many of the members were involved in a large pileup crash. 26 riders were injured and 1 rider did not survive the wreck. There has not been near as much criminal activity reported on Brother Speed as some of the other motorcycle clubs in the area.\n\nNotorious\n\nCurrent Membership: 150 Members\n\nThe Notorious Motorcycle Club was founded in Wuppertal, Germany in 2013. The club’s logo is a half-human half-skeleton face with a cap and cigar. This new club is not to be confused with the Notorious Motorcycle Club that existed in Australia which has since stopped.\n\nThree friends began the club as a way to gather likeminded people to ride together. The club has since expanded to London, England and is slowly growing in Europe. The club does not have a presence in the US or Oceania at this point.\n\nThe club is very new compared to all other motorcycle clubs and have not been involved in any government raids or large scale illegal activities to this point.\n\nRock Machine\n\nCurrent Membership: 1,200 Members\n\nRock Machine was founded in 1986 in Montreal, Canada by Salvatore Cazzetta. There are currently six chapters in Canada, six in the US, and eight in Australia. The Rock Machine Motorcycle Club has been competing with the Hells Angels club for decades for the drug trade in Montreal.\n\nRock Machine was heavily involved in the Quebec biker war from 1994-2002 which saw over 160 casualties and many more injured. The club was dissolved into the Bandidos Club in the mid-2000’s and then a new one started again in 2007.\n\nThe current Rock Machine Motorcycle Club in Canada claims to be a different organization than they used to be and does not want to be involved in any criminal activity at all.\n\nWarlocks Motorcycle Club\n\nCurrent Membership: 500\n\nThe Warlocks Motorcycle Club was founded in 1967 in Florida by several US Navy veterans who served on the aircraft carrier USS Shangri-La. There are currently chapters in the US, Canada, England and Germany. The Mother Chapter is still located in Orlando, Florida.\n\nThe club’s logo is a red and yellow flaming phoenix.\n\nIn 1991 the club was infiltrated by an undercover agent which led to several arrests on drugs and weapons charges.\n\nDragons Motorcycle Club\n\nCurrent Membership: 500\n\nThe Dragons Motorcycle Club was founded in Oakland, California in 1959 by Tobie Gene Levingston. The club is an all male, all black club for those who ride Harley Davidsons. The club was originally founded as a car club but the club was getting into so many fights with the police that people recommended they switch to being a motorcycle club. Motorcycles are less conspicuous and easier to evade officers so the switch was made.\n\nObtaining Harley Davidsons proved difficult for members of the club since there were only two Harley Dealerships in the area and Harley did not sell to black customers at that time. So all members of the club had used motorcycles that they would have to buy from previous white riders.\n\nThe Dragons is the 2nd oldest all black motorcycle club in the world but has a much larger membership than the 1st largest.\n\nThe Black Panthers and the Dragons had a lot of involvement with each other in the early days and the Dragons attended as many civil rights parades and activities as they could to show their support for black rights.\n\nToday the Dragons try to stay very involved with community service and holding fundraisers for poor families and schools in the Oakland area. The Dragons were even honored to ride alongside the Golden State Warriors in 2015 after their National Championship Title."}, {"url": "https://hollywoodvagos.com/vago-history/", "page_content": "Vago History\n\nIn the early sixties thirteen friends started a motorcycle club in Southern California. For years many have passed stories around, this is the real story of how the Vagos Motorcycle Club was originated from one of the last of the first 13 original members and founders. This is his story of the birth of our club. It is important to pass this history of our club to all our brothers in order to keep its history alive.\n\nOn May 18th on the corner of Eighth and Davidson in San Bernardino, California a motorcycle club, not gang, was originated.\n\nThe members were:\n\nPuro – President\n\nGil Carrasco – Vice President\n\nWhitey – Secretary\n\nTreasurer Lucky – Sgt. at Arms\n\nFreddy Ruiz, Harley Hog, Crazy John Estrada, Tom Tom, Moose, Squirrel, Alex Estrada, and Little John Bocanegra.\n\nOriginally two other names were considered, Coffin Dodgers MC and Satan Saints MC the name VAGOS MC was suggested by Puro and was voted on. Then the emblem had to be chosen. Lucky was browsing through LIFE magazine and found a picture of a devil coming out of the ground surrounded by smoke, the caption read “return from hell.” Animal and Lucky presented the picture to the other members for a vote, the vote passed. The colors were chosen by Whitey and Puro. The color chosen was green on green with the devil in red. After the vote, Moose was chosen to draw the center piece. The patches made for the first original 13 were made from felt by a seamstress from Muscoy named Betty. She made all the patches for the few clubs that were around at the time. She made ours till the early 90s when her sight went bad. The patches after the original 13 were made from canvas.\n\nSoon after we got started, a lot of men started to come in; the first was J.R. Garcia. That was three months after we originated. Three months after that we moved to 11th and “L” streets in Berdoo, the Mother chapter.\n\nSoon other clubs wanted to become Vagos! A brief history:\n\nThe second Vago chapter started was Victorville, the members were from the Cossacks MC.\n\nThe third Vago chapter was Los Angeles, whose members were from the Talons MC.\n\nThe forth Vago chapter was San Gorgonio Pass, made up of a few Vagos from Berdoo and a bunch of men who they knew, who rode hard and partied harder.\n\nThe fifth Vago chapter was S.G.V., these members were from the Dirty Dozen MC, a few Highwaymen MC, Verdugos MC, Vendettas MC and Ghostmen MC.\n\nThe sixth Vago chapter was Monterrey, they were from the Sabers MC, and some Dirty Dozen MC and Highwaymen MC.\n\nThe seventh Vago chapter was Pomona Valley, made up with men from the Nacoda Breed MC.\n\nThe eighth Vago chapter was Antelope Valley, it’s members were from the Brothers MC,\n\nThe Mexico chapters were started by accident, 15 years later. Lucky was in Ensenada on the 4th of July playing in a softball tournament. His wife Irene, stopped the game to show Lucky three guys on bikes going down the street. The name on their cuts was the same as ours, except the colors were different. They were black and gray with orange-yellow, with an eagle center. Lucky found out later where they were partying, so he went over and talked and partied with them. The president’s name was Tati and they were from Mexicali. With them partying was another club, the Solo Angels MC. When he came back home he got a hold of Prophet who was the national President at the time, he also went to the Berdoo chapter to talk to Lenco, Loco and Crazy Johnny. We give the credit to them for starting the Vagos MC across the border. We also credit P.C. Games for the growth of the rest of the chapters in Mexico in the early years."}, {"url": "https://www.latimes.com/archives/la-xpm-2006-mar-10-me-vagos10-story.html", "page_content": "Times Staff Writers\n\nMore than 750 law enforcement officials conducted sweeps in five counties Thursday, aimed at breaking the back of the Vagos Motorcycle Club, an organization founded in the 1960s that authorities say is tied to dealing drugs and weapons.\n\nTwenty-two people were arrested in Los Angeles, San Bernardino, Riverside, Orange and Ventura counties, culminating a three-year investigation aimed at curtailing the operations of the Vagos organization.\n\nThe bust comes two years after another long-term investigation resulted in the arrests of 57 leaders from the Vagos’ archrivals, the Hells Angels motorcycle gang.\n\nAdvertisement\n\nAlthough the two biker gangs have their roots in California’s counterculture movement, law enforcement officials say both groups are actually sophisticated criminal enterprises with a large hand in the methamphetamine trade.\n\n“Today is just the beginning,” said Orange County Sheriff Michael S. Carona. “The Hells Angels, the Vagos -- they are not clubs. The reality is that they’re supporting [street] terrorism.”\n\nLeaders of the Vagos have long denied having any ties to criminal activity. The Vagos website states that the group was formed as a “tight brotherhood to survive the wars between the rival clubs and the constant harassment of the police.”\n\nThe message goes on to say that “Vagos comes from the Spanish language meaning ‘traveling gypsy’ or ‘a streetwise person that’s always up to something.’ ” The club has about 300 members in California, Arizona, Nevada, Hawaii and Mexico.\n\nAuthorities said the Vagos investigation was among the largest coordinated law enforcement probes ever conducted in the region. Those arrested include seven chapter presidents, one vice president, one secretary, one treasurer and seven sergeants-at-arms.\n\nOfficers said they seized 95 illegal firearms; various illegal drugs, including methamphetamine; $6,000 in cash; and two stolen motorcycles.\n\nThe crimes may later be incorporated into a federal racketeering case, officials said.\n\nThe law enforcement operation was dubbed “22-Green” because Vagos gang members wear the number 22 on their vests, representing V, the 22nd letter of the alphabet, and green is the gang’s color.\n\nThe Hells Angels wear red.\n\nThe Hells Angels and Vagos motorcycle gangs have been feuding for years. In 2001, a bloody melee broke out at a Costa Mesa swap meet that authorities later said stemmed from bad blood between Hells Angels and Vagos members. A fight between the Hells Angels and another gang, the Mongols, left three people dead at a Laughlin casino in 2003.\n\nThat year, federal officials arrested Angels leaders across several Western states on suspicion of firearms violations, narcotics trafficking, possession of stolen explosives and organized criminal activity.\n\nAuthorities on Thursday alleged that the Vagos gang also has a long history of involvement in the manufacture and distribution of methamphetamine, as well as other controlled substances. They are believed to be responsible for selling drugs in parks in San Bernardino County, officials said.\n\nBecause the Vagos are classified as a criminal street gang, judges can add enhanced penalties if members are convicted.\n\nAmong those whose homes were searched Thursday was Terry Orendorff of Hesperia, the Vagos’ 23-year international president. Although he was not arrested, Orendorff and other gang leaders remain subject to future federal racketeering charges, based on the gang’s alleged involvement in a July 2004 killing in Lucerne Valley and an attempted murder in Hesperia, authorities said.\n\nThose arrested included chapter presidents Scott “Psycho” Sikoff of Apple Valley, Vincent Mariano of Victorville, Nels “Swede” Bloom of Romoland, “Big” Roy Compton III of San Jacinto, Lino “Umpire” Garcia of Oxnard, and sergeant at arms Michael “Chainsaw” Izykowski of Huntington Beach.\n\nNone of those arrested could be reached for comment Thursday.\n\n“We expect some of the gang leadership to cooperate with us,” said Thomas Mangan, spokesman for the federal Bureau of Alcohol, Tobacco, Firearms and Explosives.\n\n“This is the just the tip of the iceberg.”\n\nIn the Lucerne Valley homicide, James Gavin, 44, was fatally shot in the upper torso, and another person was injured during a home-invasion robbery.\n\nTwo alleged Vagos members were arrested Thursday on suspicion of murder: Daniel “Twist” Foreman, 28, of Apple Valley, and Vagos vice president Ryan Matteson, 29, of Victorville. They will be charged with murder, attempted murder, street terrorism, residential robbery and first-degree burglary, authorities said.\n\nForeman had previously been arrested on suspicion of the slaying in early 2005 but was released for lack of evidence. Considerably more evidence was uncovered in the latest investigation, said Britt Imes, the San Bernardino County deputy district attorney who will prosecute the case.\n\n“It was drug-related and retaliation-related, connected to the gang’s perceived disrespect of another Vagos member’s family member,” Imes said. “We’ve been anxious to resolve that murder, and we are finally able to do that.”\n\nTwo other Vagos members, whom Imes declined to identify, were arrested on suspicion of attempted murder for their roles in firing multiple gunshots at a vehicle occupied by several people on a Hesperia street.\n\n“We believe [the shooting] was a retaliation for a high-ranking member’s relative being disrespected,” Imes said.\n\nThe Vagos organization is considered much smaller and less well-known than the Hells Angels, which rose to national prominence after a deadly altercation involving a member at a 1969 concert at Altamont in Northern California featuring the Rolling Stones and Jefferson Airplane.\n\nIn addition to their green outfits, Vagos wear patches with the image of Loki, the Norse god of mischief.\n\nLast week, 10 people associated with the group -- including the leader of the Northern California Vagos -- pleaded guilty to possessing firearms and conspiracy to sell methamphetamine.\n\n*\n\nTimes staff writer Michelle Keller contributed to this report."}, {"url": "https://chapterzero.org.uk/blog/2000-members/", "page_content": "As Chapter Zero passes the 2,000-member mark, Julie Baddeley, Chair of the Chapter Zero Board, reflects on what makes Chapter Zero unique and why this moment is so significant.\n\nChapter Zero will be three years’ old in June, and the increased climate understanding and interest we have seen over that time is encouraging. But, as highlighted by the latest IPCC report, progress needs to be much faster. The business and climate landscape will be significantly different in another three years’ time – and what boards do today will help determine how that looks.\n\nWhen we created Chapter Zero, as a group of non-executive directors (NEDs) we realised we had a role in making sure our businesses were responding to the risks and opportunities created by climate change. Now our reach has grown, as have the peer experience and partner relationships that our members benefit from.\n\nReaching 2,000 members is a significant moment and reflects the influence of this growing community. Across the membership we now have the ability to reach several thousand companies – enough to have a substantial impact.\n\nWith every new member, the collective influence of the Chapter Zero community grows, along with the potential of what we can all achieve.\n\nA unique position\n\nWe are a philanthropically funded network created and led by non-executives. All our content, events and tools are designed to equip our members for important boardroom discussions.\n\nOur members have fed back to us some of the unique aspects of membership:\n\nChapter Zero offers a ‘safe space’ for board level discussion, where directors can share insights and discussion with fellow non-executives both within and across sectors and industries, and from organisations both large and small.\n\nIn a crowded landscape, we are a trusted source of information and news, expressly curated for our non-executive director members with the support of the Centre for Climate Engagement at Cambridge University.\n\nChapter Zero is built around a partnership model, in line with Goal 17 of the UN SDGs; we work with a suite of expert partner organisations bringing members relevant events and knowledge according to where they are on their climate journey.\n\nI used Chapter Zero content to trigger a conversation about where we are up to. That engagement has helped us get a clearer shared baseline of what our position is today and start considering where we aim to get to and how our plans match up. Ruth Cairnie, Chair of Babcock and Supporting Chair of Chapter Zero\n\nMaking an impact\n\nOur theory of change is clear; by building a community of non-executive directors and equipping them to lead crucial UK boardroom discussions, we are helping to drive action on climate.\n\nIn 2,807 days’ time we need to have halved global emissions to avoid the worst effects of climate change. The next few years will be critical and Chapter Zero is here to help our members navigate the changing climate and business landscape.\n\nLooking ahead\n\nWe know that each journey to net zero will look slightly different, and NEDs will be at different stages along those paths. We are striving to make sure that we offer our members what they need, at the right time.\n\nChapter Zero exists for its members. Let us know what you need so we can continue to support you in your boardroom discussions on climate action.\n\nIf you’re not already a member, sign up here, free of charge Become a Chapter Zero member\n\nMoving companies from ambition to action is complex. Having several informed members on a board, helping to drive climate ambition and ask the right questions, can make a significant difference. Strength in numbers can influence the wider board and executive team. So if your board colleagues aren’t also members, share this link with them and encourage them to register.\n\nAlternatively, if they would like to speak to a member of our team about the benefits of becoming a member, please ask them to email us at climate@chapterzero.org.uk.\n\nI am incredibly proud of how far Chapter Zero has come, and thank the partners, supporters and members that have joined, and continue to join us along the way. 2,000 members is an important milestone, and I look forward to seeing how far we can go together.\n\nJulie Baddeley, Chair of the Board, Chapter Zero"}, {"url": "https://motoringjunction.com/featured/outlaw-motorcycle-clubs/", "page_content": "Harley Davidson and biker groups represent the American spirit of valuing freedom over everything else. But when these free-spirited biker groups get involved in wrongdoings, they become an eyesore for law enforcement.\n\nSome of these outlaw bikers are just like any other mafia gang, involved in crimes like gun-running, drug peddling, contract killings, extortion, money laundering, shootouts, etc.\n\nSince reputation of the club is big deal for these bikers, we often see fights breaking out between different biker clubs. The territorial animal instinct surely runs high in an outlaw biker’s life.\n\nThey are often called “one-percenter” because American Motorcycle Association says that 99% of motorcyclists are law abiding.\n\nJust like Mafia movies, Outlaw biker movies also have huge fan following. Regular folks find their lifestyle amusing and are eager to know what goes on in the world of outlaw bikers. Let look at some of the most feared outlaw bikers gangs.\n\nBandidos\n\nDonald Eugene Chambers, a marine that served in Vietnam started riding motorcycles after returning. He found most riding clubs to mellow for his taste.\n\nIn 1966, he started Bandidos motorcycle club in San Leon, Texas. The inspiration for the name and culture came from the mexican bandits. The living by their own rules mindset was the core of everything Bandidos did. Today there are over 2500 active members in Bandidos M.C.\n\nBandidos Member at the funeral of their leader: Rodney Monk\n\nThe initial members of Bandidos were recruited from local biker bars in Texas. By 1970s, the club had over 100 bikers, many of them had served in Vietnam war.\n\nThis group is highly involved in smugling drugs across US – Mexican border. Their members are charged in multiple murder cases and accused in a lot more. According to FBI, they are one of the big four outlaw motorcycle clubs.\n\nHells Angels\n\nEven if you’ve never heard of any other motorcycle gang, I’m sure you have heard about Hells Angels. No doubt they are most popular and biggest out of all biker clubs.\n\nHells Angels started in 1948 and have become such a high-value brand that they had are incorporated in US and Canada. Through the corporation they sell merchandise and also sue movie production houses for infringing their copyright and trademarks. Wild Hogs was one of the movies that had to deal with Hells Angels in court.\n\nApart for fighting court battles, club’s 3000 plus members regularly fight battles outside court in their own way. The club members are actively involved in drug dealings, voilent crimes, and organised crimes.\n\nHells Angels have a long-standing beef with Mongols M.C. over southern California turf. Their most recent clash was at a gas station in Cleaveland, Ohio. On the Canadian border, Hells Angels don’t go along well with Outlaws M.C.\n\nOutlaws / AOA\n\nOutlaws Motorcycle Club is also called A.O.A as it’s incorporated as American Outlaws Association. This club was formed in 1935 in Matilda’s bar on the famous Route 66 McCook, Illinois. They are one of the big four outlaw motorcycle clubs in America.\n\nOutlaws MC is truly an international Biker’s Club\n\nOutlaws MC member count stands at over 1700 men, all of them ride American made motorcycles. They have great influence across the canadian border, which helps them smuggle drugs in and out of USA. Outlaws have intense beef with Hells Angels MC. In fact they often use the phrase ADIOS ( means goodbye in Spanish) as an acronym for Angels Die In Outlaws States.\n\nApart from 43 Chapters in USA, Outlaws have 20 chapters in Canada, 30 chapers in England and Wales, 33 chapters in New Zealand, 15 in Belgium, 15 in Brazil, 7 in Chile, 1 each in Ecuador and Czechia, and many more across the world.\n\nPagans\n\nPagan Motorcycle Club was formed in 1959 in Maryland. But it was not an outlaw motorcycle club until early 70s when John “Satan” Marron became incharge of the club.\n\nAfter 70s they went against Hells Angels and started gun running operations. Inspite of their small size of around 900 members, they are classed as one of the “Big 4” by Bureau of Alcohol, Tobacco, and Firearms.\n\nPagan gained notoriety over the years with support from the Italian Mafia and Aryan Brotherhood. Their activities included drug smuggling, arms dealings, bombings, etc. In 2018 their Rhode island clubhouse was busted and lots of illegal weapon were recovered, including a rocket launcher.\n\nPagans still go aggressively against Hells Angels and leave no opportunity to attack them. Pagans have around 100 chapters, mostly along the east coast of USA and Puerto Rico.\n\nCossacks\n\nCossacks M.C was formed in Tyler, Texas in 1969. This group doesn’t want to call itself an outlaw motorcycle club but their actions speak otherwise.\n\nPatches of Cossacks Motorcycle Club\n\nCossacks club came into limelight recently due to shootout with Banditos M.C in 2015 that left 9 people dead.\n\nCossacks members wear biker jackets with top rocker that mentions their club name, bottom rocker that mentions the regional chapter, with logo in the middle. This group however don’t put one percenter diamond patch that other outlaw clubs are proud to put.\n\nCossacks club members exclusively use only Harley-Davidson motorcycles as a mark of patriotism towards USA.\n\nBacchus MC Ontario\n\nBacchus motorcycle club is based out of Canada. It was started in August 1972 in Albert country, New Burnswick.\n\nThe club name Bacchus took inspiration from the Roman counterpart of the greek god, Dionysus. He is considered a god of wine, women and song. Dionysus was regarded as a protector of those who don’t belong in regular society.\n\nBacchus MC Patched Jacket\n\nBacchus has remained active mostly in the Ontario region but in 2014 they merged with Original Red Devils MC. This expanded the club and now the Bacchus riders have switched the bottom rocker on their jacket to “Canada” from “Ontario”. This club has around 100 active members spread around in 13 chapters in 5 Canadian province.\n\nThis move would also avoid any conflict with Hells Angels as they claim the right to use bottom rocker on jacket to represent the local chapter or province.\n\nUnlike American outlaw clubs, Bacchus go along well with other Canadian motorcycle groups like Highlanders MC, Para-Dice Riders, Vagabonds, etc.\n\nBacchus club members are actively involved in drug running. Drugs like Crack cocaine Hashish, and MDMA. With drug dealing there comes problems they have to deal with through violent means.\n\nPissed off bastards of Bloomington\n\nPissed off bastards of Bloomington is one of the oldest motorcycle clubs. In fact they were involved in the Hollister Riot in 1947, a significant historic event for motorcycle clubs. American Motorcycle Association organised a Gypsy Tour Motorcycle Rally in Hollister, California.\n\nPissed off bastards of Bloomington Members showing their patches\n\nOver 4000 bikers from several motorcycle clubs attended this event, including Pissed off bastards of bloomington, and caused a ruckus. Lots of booze, racing on the streets, fighting, vandalism, etc.\n\nThis gave birth to the term 1 percenter when AMA said that 99% of bikers were law abiding. The 1953 movie, “The Wild One” is based around Hollister Riot.\n\nOne of the founding members of Hells Angels, Otto Friedli attended Hollister Riot with the Pissed off bastards of bloomington.\n\nPOBOB MC still exist today but it’s a small member group that don’t come into limelight too often. Pissed off Bastards of Bloomington merged with Pissed of Bastards of Berdoo. So POBOB MC can stand for either of them.\n\nSons of Silence\n\nThe Sons of Silence MC was founded by Bruce Richardson in 1966. He served US Navy from 1958 to 1960 and then settled in Longmont, California after discharging. Ten years later, Leonard Lloyd “JR” Reed, Jr, also a Navy veteran, became the club president and held the position for the next 22 years.\n\nSons of Silence MC Riders\n\nSons of Silence have headquarters in Colorado Springs, California and have over 16 chapters across USA: Arkansas, Colorado, South Dakota, North Dakota, Florida, Idaho, Illinois, Indiana, Kansas, Kentucky, Louisiana, Minnesota, Mississippi, Missouri, Wyoming and Utah.\n\nThey have backing and protection of Hells Angels but often clash with Mongols MC.\n\nIn 1998 the club expanded to Germany by starting a chapter in Munich. They have been expanding with many more chapters in Germany since then.\n\nVagos\n\nVagos Motorcycle Club was formed in 1965 in Bernardino, California. This club is also referred to as a “Green Nation” because its members generally wear green merchandise.\n\nThe founding members of the club, all Mexicans, were initially a part of Psychos MC. But after some disagreements few members decided to start their own thing, Vagos MC. Vagos in spanish means a vagabond or gypsy.\n\nVagos MC Green Patches are quite unique\n\nTheir first chapter started in San Bernardino and was nicknamed “Berdoo Chapter”. Hells Angels is another club that started in San Bernardino.\n\nToday Vagos has around 4000 members spread over its 200 chapters. They have international presence in Mexico, Sweden and Australia. But majority of the members are Caucasian or Hispanic.\n\nMongols\n\nMongols Motorcycle Club was formed in 1969 in Montebello, California by David Satillan. It started as a regular motorcycle club by young vietnam war veterans who wanted to ride. But the club gained a bad reputation within 15 years of forming.\n\nPresently there are around 2000 members in this club. Mongols have great influence in southern California, majority of them being hispanic males from Los Angeles area. But they are spread out over USA with chapters in 14 states and have international presence in 10 countries. Moto of Mongols MC is “Respect few fear none”.\n\nThe bureau of Alcohol, Tobacco and Firearms thinks that Mongols are the “Most voilent and dangerous outlaw motorcycle gang in America”. At one point, Mongols had as many as 270 warrants issued against them at once. Mongols have had major conflicts with Hells Angels MC and Mexican Mafia.\n\nWarlocks\n\nThere are some outlaw motorcycle clubs that started out like a regular law-abiding motorcycle club but turned rogue with time. But Warlocks has been one if the most violent biker club since its inception. In fact, many outlaw bikers refuse to associate with them due to their reputation.\n\nWarlock motorcycle club started in 1967 in Florida. Its founders served in the US navy on the USS Shangri-La aircraft carrier. Even today, Warlocks are most active in Florida where they have 11 chapters. Apart from this, they have five chapters in Virginia, seven chapters in South Carolina, four chapters in West Virginia, two chapters each in Georgia and Ohio, one each in Minnesota, Tennessee, and New York.\n\nWarlocks Motorcycle Club also has an international presence with three chapters each in England and Canada, and two chapters in Germany. Warlocks also have some nomad members that are not associated with any particular chapter. In total, there are over 500 members in Warlocks Motorcycle Club.\n\nThis group members are involved in Gun and drug running. Recently in 2014, four Warlock members were arrested in guns and drugs bust in Canada.\n\nSatan’s Sidekick\n\nSatan’s Sidekick is an unique Motorcycle club that it requires its members to be black. This all black motorcycle club was formed in 1970s in Detroit, Michigan.\n\nThis is a relatively small group with three chapters in USA: Satan’s Sidekick Cleveland, Detroit, and Lousville in Kentucky.\n\nOld BF Goodricch tire shop became Satan’s Sidekick Cleaveland Clubhouse\n\nSatan’s Sidekick was in news recently where their Detroit clubhouse was raided by police and one person was killed in a shootout at the Cleveland Clubhouse.\n\nThe Highwaymen\n\nThe Highwaymen Motorcycle Club was formed cropped out of Detroit, Michigan in 1954. This is the largest motorcycle club in Detroit, having over three hundred members. Apart from this, they have chapters in Tennessee, Missouri, Ohio, Indiana, Kentucky, Florida, and Alabama.\n\nWe can understand more about this club from its two sayings: “Highwaymen Forever, Forever Highwaymen.” and “Yea, though we ride the highways in the shadows of death, we fear no evil, for we are the most evil mother f**k*rs on the highway.” The first shows their comradery, while the second one tells how they look up to being evil\n\nThis club had to face several police and FBI investigations, especially in 1973, 1987, and 2007. In the 1970s, the club members were convicted of bombings, raiding homes and clubhouses of rival gangs.\n\nThe logo of Highwaymen is a skull having wings and wearing a biker cap. This logo doesn’t have any color in it, just monotone silver and black. This insignia sure does portray a tough image.\n\nUnknown Bikers\n\nUnknown Bikers MC originated in Brooklyn, New York in 1974. Their mother chapter is Williamsburg. Unknown Bikers MC gained respect of Williamsburg as drug peddling was a big problem before mother chaper was formed.\n\nInitially, till the late 90s, most club members were Italian or Spanish. But from 1999 onwards, Polish origin member also started joining the club.\n\nUnknown Bikers members wearing patched jackets\n\nSince then, Polish members have greatly influenced the culture of the club. The Greenpoint, Brooklyn chapter formed in 2010 has a Polish president: Daniel Sadowski. Unknown Bikers MC website also has a lot of polish text. The club members can also be spotted bearing Poland flag patches on their vests.\n\nIn 2012, Unknown Bikers Club expanded to Poland. Apart from this, the club also has an international presence in Iceland and Puerto Rico.\n\nOther Biker clubs (to be discussed later)\n\nBlack Pistons, Avengers, Sin City Deciples, Invaders Motorcycle Club, The Breed, Outcast Motorcycle Club, Brother Speed, Phantom Outlaw, Devil’s Diciples, Diablos, Thundergaurds, Gypsy Joker, Rock Machine, El Forestaro, Iron Horsemen, Peckerwoods,Iron Order, Night Wolves, Rebels.\n\nBiker Gang Movies / TV Series:\n\nMovies: The Wild Angels (1966), Run, Angel, Run (1969), Angel Unchained (1970), Hell’s Belles (1969), Easy Rider (1969), Harley Davidson and the Marlboro Man (1991), Hells Angel on Wheels (1969), The Wild One (1953), Eye of the Tiger (1986), Hell Ride (2008), Stone Cold (1991), The Loveless (1981), Beyond the Law (1993).\n\nTV Series: Sons of Anarchy TV Series (2008), Mayans M.C. (2018)\n\nCheckout: best Youtube Channels for Motorcylists\n\nAlso Checkout: List of best Motorcycle Quotes and Sayings"}, {"url": "https://www.reuters.com/article/us-bikers-war-idUSTRE79P5BG20111026", "page_content": "LOS ANGELES (Reuters) - A turf war between the Hells Angels and a rival motorcycle gang that erupted outside a California Starbucks shop last year has left several men dead, wounded or missing in three states, stirring fears of more bloodshed.\n\nCesar Villagrana, 36, of Gilroy, California is seen in this booking photograph released to Reuters on October 26, 2011. Villagrana was with Jeffrey \"Jethro\" Pettigrew, leader of the Hells Angels chapter in San Jose, California, when a rival gang member shot Pettigrew to death on September 23 2011 in a casino in Sparks, Nevada. REUTERS/Washoe County Sheriff's Office\n\nRanked by law enforcement as the most severe clash of two California-based biker groups in nearly a decade, the spate of violence turned deadly last month when it spilled into Nevada with a brawl and shooting among members of the Hells Angels and Vagos motorcycle clubs.\n\nThe president of the Hells Angels’ San Jose, California, chapter, Jeffrey “Jethro” Pettigrew, 51, was shot to death, and one Vagos member was wounded in the melee at John Ascuaga’s Nugget hotel and casino in Sparks. A second Vagos member was wounded in a drive-by shooting the next day at the site of a nearby motorcycle rally in town.\n\nThe Pettigrew killing -- coming 11 months after a gunfight between the two gangs in Arizona that left five people wounded -- in turn sparked tensions within the Hells Angels’ ranks that led to yet another slaying in California, authorities say.\n\n“There have been concerns about this rivalry for some time,” said Graham Barlowe, resident agent in charge of the Sacramento office of the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives.\n\nThe last California biker feud of similar proportions grew out of a 2002 casino riot in Laughlin, Nevada, between the Hells Angels and another group known as the Mongols, Barlowe said. At least three bikers died as a result of that conflict.\n\nDEAD OR ALIVE\n\nThe latest casualty of the Hells Angels’ recent battle against Vagos actually was inflicted by one of their own.\n\nAt Pettigrew’s funeral in California weeks after he was slain in Nevada, his close friend and sergeant-at-arms of the San Jose chapter, Steven Tausan, 52, was shot and killed by a fellow Hells Angel in an apparent quarrel among club members.\n\nA police source familiar with the investigation said Tausan and others confronted the accused gunman, Steve Ruiz, over his perceived failure to have protected Pettigrew during the Nugget casino brawl, prompting Ruiz to pull a gun on Tausan.\n\nA group of bikers then pounced on Ruiz as thousands of mourners streamed out of the cemetery, preventing police officers at the funeral from making an arrest, San Jose police spokesman Jose Garcia said.\n\nIn the end, it was unclear whether the bikers who descended on Ruiz did so to subdue him, beat him or help him escape, but witnesses said he was whisked away in a car, Garcia said.\n\nSuspecting that Ruiz may have been killed at the scene and his body dumped into Pettigrew’s grave, police later obtained a search warrant to dig up the burial site, but they found no trace of Ruiz, Garcia said.\n\nLast week, San Jose police received a tip that Ruiz was alive and hiding out in the northern California city of Stockton, but he was believed to have slipped away after investigators searched a home there to no avail on Saturday.\n\nGarcia said authorities now believe Ruiz is on the run with a current or former girlfriend, noting that he has family and associates in Arizona and New York.\n\nThe recent bloodshed can all be traced to last year’s push by Vagos, founded in the 1960s in a Southern California desert community, into the northern coastal town of Santa Cruz, long claimed as Hells Angels territory, police said.\n\nCAFFEINE FOR BIKERS\n\nTensions boiled over in January 2010, when members of the rival gangs, some wielding ball-peen hammers, fought outside a Santa Cruz Starbucks before scattering as police arrived.\n\n“It was all about who would be allowed to hang out at the Starbucks downtown,” Santa Cruz Deputy Police Chief Steve Clark said. “The Vagos brazenly came in and tried to cement their presence. It was a pretty strong play on their part to establish themselves as the premiere club.”\n\nHe added: “Only in Santa Cruz would you have biker wars over who’s going to control pumpkin spice lattes.”\n\nSeven months after the Starbucks ambush, violence between the two groups flared again in a gunfight in August 2010 that left five people wounded and led to 27 arrests in the northern Arizona town of Chino Valley.\n\nThe U.S. Justice Department has classified both the Hells Angels and Vagos as outlaw gangs deeply involved in drug and weapons trafficking, as well as extortion, money laundering, theft and various violent crimes.\n\nThe Hells Angels, by far the larger and better known of the two, was founded in 1948 in Fontana, California, and has since established over 230 chapters with an estimated 2,000 to 2,500 members worldwide, the government says.\n\nThe organization denies its involvement in criminal activity and argues the club should not be blamed for the illegal actions of individual bikers.\n\nMembers insist the overwhelming majority are law-abiding citizens who share a love of powerful motorcycles, especially Harley-Davidsons and choppers, and point to their prominent role in certain charity events as evidence that their outlaw reputation is exaggerated by the media.\n\nKaren Snell, a San Francisco-based lawyer who has represented a number of Hells Angels members, said Pettigrew and Tausan, for example, were “family guys.”\n\n“They made honest livings. They worked hard and were responsible,” she told Reuters.\n\nPolice have arrested two people in connection with last month’s casino brawl, including Ernesto Manuel Gonzalez, 53, a Vagos member suspected in Pettigrew’s slaying."}]}