{"Katie Ledecky is the first woman to have won the 200-meter freestyle, 400-meter freestyle, 800-meter freestyle, and 1500-meter freestyle events at a major international competition.": [{"url": "https://www.nytimes.com/live/2021/07/27/sports/swimming-olympics", "page_content": "TOKYO — Katie Ledecky had only a little more than an hour to recover from the biggest disappointment of her storied Olympic career, a stunning fifth-place finish in the 200-meter freestyle.\n\nFew expected her to win that race, even though she was the reigning champion, not with Ariarne Titmus of Australia in the next lane, just as she had been on Monday in the 400-meter freestyle when she beat Ledecky for the gold. But fifth place is not where Ledecky, who came in targeting five gold medals, ever expected to be.\n\nImage Ledecky’s teammate, Erica Sullivan, won silver. Credit... Doug Mills/The New York Times\n\nShe stared blankly at the scoreboard after she touched the wall. She winced as she walked across the pool deck. There would be no medal ceremony before the start of her next event, the 1,500-meter freestyle.\n\nEver since the Olympic schedule came out years ago, this was the day she had circled, the day she would try to pull off a golden double by winning two vastly different races.\n\nIt would be the kind of day Michael Phelps had in 2008, when he won the 200-meter butterfly and a relay gold in the same session. Now it was going in the wrong direction, shocking her competitors.\n\n“I always thought she was going to be there,” Titmus said, regarding the 200, which gave her a second gold medal in three days.\n\nImage Credit... Doug Mills/The New York Times\n\nInstead, Ledecky headed for the warm-down pool. She conferred with her coach, Greg Meehan. He told her be angry if she wanted to, but at least she had more time to prepare for the metric mile swim.\n\nShe said she had always planned to use the adrenaline from her performance in the 200 to power her through the 1,500, the longest race in the pool and a grueling physical and mental test.\n\n“Things didn’t work out super-well there,” she said.\n\nAs she swam back and forth in the warm-up pool, she thought of her family, especially her grandparents, the toughest people she knows. And she tried to get her head around the next task.\n\nThen, just before noon, she hit the water in the 1,500, and roughly a minute or two later order in the swimming universe was restored.\n\nImage Ledecky built her typical dominating lead. Credit... Doug Mills/The New York Times\n\nLedecky, the ultimate distance freak, has loved the 1,500 since she first raced at the distance when she was 12, and has been nearly impossible to beat in it ever since.\n\nLedecky was a body-length ahead of Jianjiahe Wang of China after 200 meters and five meters ahead at the 300-meter mark. Breathing every other stroke, barely kicking, and stretching her lead on each turn, she swam in cruise control for much of the rest of the race.\n\nWomen’s 1,500-Meter Freestyle PLAY Length 0 of 30 x x x x x x\n\nErica Sullivan, her American teammate, pushed her ever so slightly at the end, getting to within seven meters of Ledecky. But even Sullivan knew the way this would end.\n\n“I could see her wake,” Sullivan, who won the silver medal, said. “Usually I just see her in the turnarounds.”\n\nImage Credit... Doug Mills/The New York Times\n\nWhen she touched the wall, Ledecky smacked the water and let out a scream.\n\nIt was her second medal of the Games, after her silver in the 400, but her first gold, the kind of medal she expects to take home. She corralled Sullivan, who did not realize she had captured the silver, a huge moment in the Tokyo pool for a woman whose mother is Japanese. Usually steely, Ledecky was close to tears — they would flow in the post-race news conferences — another superstar athlete at these games trying to manage the pressure of outsized expectations.\n\nOn Tuesday, that pressure had claimed Naomi Osaka of Japan and Simone Biles. On Wednesday, the Tokyo Games tested Ledecky in a way she had not been tested before, and she had made it through.\n\n“People maybe feel bad for me not winning everything, but I want people to be more concerned about other things going on in the world,” she said. “The most pressure I feel is the pressure I put on myself.”\n\nImage Credit... Doug Mills/The New York Times\n\nIn the day’s other finals, Kristof Milak of Hungary did what he usually does in the 200-meter butterfly: destroy the field in a race that was never in doubt.\n\nMilak, the world-record holder, won the gold medal with a breathtaking time of 1:51.25, just off his world record of 1:50.73. It was a new Olympic record. He was more than a full body and two seconds ahead of Tomoru Honda of Japan, who won the silver, and three seconds ahead of Federico Burdisso of Italy, who won the bronze.\n\nIn the 200-meter individual medley, Yui Ohashi of Japan, an emerging star for the host country, won her second gold medal of the Tokyo Games finishing in 2:08:52. Ohashi came on strong in the final 25 meters to overtake Americans Kate Douglass and Alex Walsh by seven one-hundreths of a second.\n\nImage Ledecky and her competitors inaugurated the 1,500-meter event for women at the Olympics. Credit... Doug Mills/The New York Times\n\nWalsh finished just ahead of Douglass, her University of Virginia teammate, who won the bronze in 2:09.04, setting off a celebration in Charlottesville.\n\nThe 4x200-meter men’s freestyle relay was what everyone expected it to be — a coronation for British men, who missed the world record by two one-hundreths of a second.\n\nLedecky was more than 17 seconds off her own world mark, but she’ll take it.\n\n“My times may not be my best times,” she said “but I’m still real happy to have a gold medal around my neck right now.”"}, {"url": "https://www.latimes.com/sports/olympics/story/2021-07-27/katie-ledecky-wins-gold-1500-freestyle-tokyo-olympics", "page_content": "Katie Ledecky celebrates after winning the women’s 1,500-meter freestyle at the Tokyo Olympics on Wednesday.\n\nThe week has been filled with tumult at the Summer Olympics. Big names pulled out of competition. The host city reported its highest one-day total of coronavirus cases. A typhoon buffeted the region with rain and wind. Pre-event light shows swirled through arenas devoid of fans because of the pandemic.\n\nLeave it to Katie Ledecky to provide a few minutes of normalcy.\n\nThe 24-year-old completed a grueling double by cruising to victory in the 1,500-meter freestyle at the Tokyo Aquatics Centre on Wednesday, about an hour after swimming the 200 freestyle final.\n\nAdvertisement\n\n“People maybe feel bad that I’m not winning everything, but I want people to be more concerned about other things in the world,” Ledecky said. “People are truly suffering. I’m just proud to bring home a gold medal.”\n\nNo other swimmer at the Games attempted a similar test of speed and endurance. The feat looked routine. She spent most of the race in a familiar position: all alone in the lead with the seven other competitors trailing far behind.\n\nLedecky finished in 15 minutes 37.34 seconds — the fifth individual Olympic gold of her decorated career — in a race she’s dominated like no other woman.\n\nAfter touching the wall, she pumped her arm in celebration. Then she hugged teammate Erica Sullivan, who used a strong push in the final laps to win silver, in the adjacent lane.\n\nKatie Ledecky, right, and Erica Sullivan show off their gold and silver medals after their 1-2 finish in the 1,500-meter freestyle Wednesday. (Robert Gauthier / Los Angeles Times)\n\n“She’s a legend and she’ll forever be a legend,” Sullivan said. “The fact that I get to swim in the same generation as her, it’s just so cool.”\n\nThe event joined the women’s Olympic program for the first time, though the men have competed in at the Games since 1904. That provided an opportunity for Ledecky to win gold in an event in which the outcome was as certain as, if not more certain than, any other competition.\n\nWhen Ledecky swims the 1,500, the real race is for second place. She first broke the world record in the event in 2013, her most recent record is from 2018 and, including Wednesday’s race, she owns the top 13 times in history. No one else is close.\n\nBut it wasn’t just the victory, impressive as it might have been, that stood out; it also was how Ledecky did it. The race capped an exhausting 48-hour span in which she swam 4,000 meters over six races.\n\nCompeting in the 1,500 is demanding enough. Adding a sprint like the 200 an hour beforehand doesn’t happen unless your name is Ledecky.\n\nKatie Ledecky walks away from the pool at the Tokyo Aquatics Centre after finishing fifth in the 200-meter freestyle Wednesday. (Robert Gauthier / Los Angeles Times)\n\nHowever, her morning didn’t start in characteristic fashion.\n\nThe 200 freestyle is the most competitive event in Ledecky’s program, but she entered the final as the defending Olympic champion and appeared on track to contend for a medal, if not challenge to claim gold again, after promising swims during the preliminaries and semifinals.\n\nIt quickly became apparent this wasn’t a normal race. Ledecky fell to seventh place after the first 50 meters and never challenged the leaders. The sight of the woman who has dominated freestyle swimming for more than a decade — and makes a habit of winning long-distance races by several body lengths — trailing by such a margin was jarring for the handful of athletes, officials and media in the building.\n\nAustralian sensation Ariarne Titmus, who recorded the second-best all-time mark in the event last month, won in 1:53.50. Ledecky improved her semifinal time by a tenth of a second, but still finished more than a second and a half behind in fifth place.\n\n“Bloody exhausted,” said Titmus, who will race Ledecky later this week in the 800 freestyle. “That was a hell of a tough one.”\n\nIt was the second time Titmus has gotten the better of Ledecky at the Games after edging her in the neck-and-neck 400 freestyle Monday. In that race, at least, Ledecky recorded her best time in three years and the second fastest of her career, and sounded satisfied with the accomplishment, even if it earned silver instead of gold.\n\nLedecky’s first six Olympic finals — spanning London, Rio de Janeiro and Tokyo as she transformed from a little-known teenager to one of the faces of the sport — ended on the podium.\n\nThis was the first miss.\n\n“I knew I had to turn the page very quickly and in the warm-down pool I was just thinking of my family,” Ledecky said. “Each stroke I was thinking of my grandparents. They’re the toughest four people I know and that’s what helped me get through that.”\n\nThe sting didn’t last long. The 1,500 beckoned. And so did another gold medal."}, {"url": "https://www.nytimes.com/interactive/2021/07/31/sports/olympics/katie-ledecky-swimming-free-olympics.html", "page_content": "TOKYO — Entering the Tokyo Games, Katie Ledecky had never lost an individual race at the Olympics, swimming everything from the 200-meter to the 800-meter freestyle. But a new generation of swimmers is catching up with her, and even overtaking her, especially in the shorter races.\n\nIn the 200 free, Ledecky placed fifth. Ariarne Titmus of Australia won the gold, beating Ledecky’s time by 1.71 seconds. And in the 400-meter freestyle, Ledecky took the silver, finishing 67 hundredths of a second behind Titmus.\n\n400-meter freestyle 1st Titmus 7th Madden 4th McIntosh 3rd Li 8th Fairweather 2nd Ledecky 6th Gose 5th Tang 400-meter freestyle 1st Titmus 7th Madden 4th McIntosh 3rd Li 8th Fairweather 2nd Ledecky 6th Gose 5th Tang 400-meter freestyle 1st Titmus 4th McIntosh 3rd Li 2nd Ledecky 400-meter freestyle 1st Titmus 7th Madden 4th McIntosh 3rd Li 8th Fairweather 2nd Ledecky 6th Gose 5th Tang Photograph by Joe Ward\n\nLedecky’s strength has always been in the distance races: the 800 and the 1,500, which is a new Olympic event for women this year. Ledecky claimed gold in both of those races.\n\nShe dominated in the pool five years ago at the Rio Games, winning the 800-meter race by an astonishing 11 seconds. But in Tokyo, she bested Titmus by only 1.26 seconds. The world seems to be gaining on Ledecky across all her distances.\n\nLedecky has won six gold medals in individual finals, the record among female swimmers at the Olympics.\n\nHere’s a look at her decorated career.\n\n200-Meter Freestyle\n\nRio 2016 Rank: 1st Won by 0.35 seconds Tokyo 2021 Rank: 5th Lost by 1.71 seconds\n\n7th Pellegrini 6th Seemanova 5th Ledecky 1st Titmus 2nd Haughey 4th Yang 3rd Oleksiak 8th Wilson 7th Pellegrini 6th Seemanova 5th Ledecky 1st Titmus 2nd Haughey 4th Yang 3rd Oleksiak 8th Wilson 5th Ledecky 1st Titmus 2nd Haughey 4th Yang 3rd Oleksiak 8th Wilson Photograph by Larry Buchanan\n\nThe 200 has long been Ledecky’s weakest race, and her gold medal in the event at the 2016 Olympics was a surprise -- and her narrowest margin of victory. She was considered a long shot to retain her title in the event in Tokyo, where she ended up missing the podium for the first time in an Olympic event. She finished nearly two seconds behind the winner.\n\nPLAY Length 0 of 4 x x x x x x\n\n400-Meter Freestyle\n\nRio 2016 Rank: 1st Won by 4.77 seconds Tokyo 2021 Rank: 2nd Lost by 0.67 seconds\n\n1st Titmus 7th Madden 4th McIntosh 8th Fairweather 3rd Li 2nd Ledecky 6th Gose 5th Tang 1st Titmus 7th Madden 4th McIntosh 8th Fairweather 3rd Li 2nd Ledecky 6th Gose 5th Tang 1st Titmus 7th 4th 3rd 8th 2nd Ledecky 6th 5th Photograph by Larry Buchanan\n\nLedecky raced the 400 knowing she was not the fastest swimmer in the pool. She dominated the first 250 meters, a strategy to try to shake Titmus’s confidence early on.\n\nWho was fastest at each meter Fastest Slowest 0 100 200 300 400 7th Madden 4:06.81 4th McIntosh 4:02.42 1st Titmus 3:56.69 2nd Ledecky 3:57.36 3rd Li 4:01.08 8th Fairweather 4:08.01 6th Gose 4:04.98 5th Tang 4:04.10\n\nIt worked, and then it didn’t. Titmus said she was worried at the halfway mark that Ledecky was too far ahead, but in the last 150 meters Titmus erased her deficit. In 2016, Ledecky won this race by 10 meters. This year, she was at least a half-body length behind.\n\nPLAY Length 0 of 8 x x x x x x\n\n800-Meter Freestyle\n\nLondon 2012 Rank: 1st Won by 4.13 seconds Rio 2016 Rank: 1st Won by 11.38 seconds Tokyo 2021 Rank: 1st Won by 1.26 seconds\n\n1st Ledecky 6th Melverton 8th Kirpichnikova 3rd Quadarella 4th Grimes 7th Kohler 5th Wang 2nd Titmus 1st Ledecky 6th Melverton 8th Kirpichnikova 3rd Quadarella 4th Grimes 7th Kohler 5th Wang 2nd Titmus 1st Ledecky 3rd Quadarella 4th Grimes 2nd Titmus Photograph by Joe Ward\n\nIn her final performance of the Tokyo Games, Ledecky got a measure of revenge against Titmus.\n\nFrom the start, she worked to build a lead so large that Titmus would not have gas left in the tank to chase her down over the final 200 meters.\n\nThe Ledecky who won the 800 in Tokyo would have been about 10 meters behind the Ledecky of 2016, though she would have beaten her 2012 London self by two seconds. This year, though, Titmus was three seconds closer than the second-place finisher in 2016.\n\nPLAY Length 0 of 16 x x x x x x\n\n1,500-Meter Freestyle\n\n2017 World Championships Rank: 1st Won by 19.07 seconds Tokyo 2021 Rank: 1st Won by 4.07 seconds\n\n2nd Sullivan 1st Ledecky 4th Wang 8th Gough 7th Kirpichnikova 5th Quadarella 3rd Kohler 6th Melverton 2nd Sullivan 1st Ledecky 4th Wang 8th Gough 7th Kirpichnikova 5th Quadarella 3rd Kohler 6th Melverton 2nd Sullivan 1st Ledecky 4th Wang 3rd Kohler Photograph by Joe Ward\n\nThe 1,500 has historically been Ledecky’s most dominant race. She began setting world records in the event in 2013, when at age 16 she smashed Kate Ziegler’s world record by six seconds. Ledecky has set the world record six times, and when she lowered her mark to 15 minutes 20.48 seconds in 2018, it was 22 seconds faster than the record she first broke.\n\nThose numbers made her victory in the event on Wednesday that much more interesting. She finished in 15:37.34. In other words, the record-setting Ledecky and the 2017 world champion Ledecky would have crushed the Ledecky who raced in the 1,500 in Tokyo.\n\nPLAY Length 0 of 30 x x x x x x\n\nGasping for breath after her final event on Saturday, she knew her Olympics was over. But her career, she said, was not: After the race, Ledecky, still only 24, announced that she intended to continue competing, and to qualify for the 2024 Games in Paris."}, {"url": "https://www.britannica.com/biography/Katie-Ledecky", "page_content": "Katie Ledecky, byname of Kathleen Genevieve Ledecky, (born March 17, 1997, Washington, D.C., U.S.), American swimmer who was one of the sport’s dominant freestylers in the early 21st century, breaking numerous records. She won 10 Olympic medals, 7 of which were gold.\n\nLedecky made her first splash in international swimming after her freshman year at Stone Ridge School of the Sacred Heart in Bethesda, Maryland, when she set an Olympic-trials record in the 800-metre freestyle to qualify for the 2012 London Games as the youngest member of the U.S. Olympic swimming team. At the Games she set an American record en route to the gold medal in the 800 metres. The following year Ledecky set her first world records in the 800 metres (8 minutes 13.86 seconds) and 1,500 metres (15 minutes 36.53 seconds) at the 2013 Fédération Internationale de Natation (FINA) world championships. In addition to the golds that she won in those two events, Ledecky earned a gold medal in the 400-metre freestyle and as a member of the 4 × 200-metre relay team, and she won the FINA Trophy as the highest-scoring overall female swimmer at the world championships.\n\nBritannica Quiz Sports Quiz\n\nIn June 2014 Ledecky bettered her own records in the 800 metres (8 minutes 11 seconds) and the 1,500 metres (15 minutes 34.23 seconds), and at the U.S. national championships in early August she set a global standard in the 400-metre freestyle with a time of 3 minutes 58.86 seconds, thus becoming the first female swimmer since American Janet Evans to hold simultaneous world records for the 400-, 800-, and 1,500-metre distances. At the 2014 Pan Pacific Championships, Ledecky became the first woman to capture four individual golds in that competition by winning the 200-, 400-, 800-, and 1,500-metre freestyle events, and she claimed another gold in the 4 × 200-metre relay. She also broke her own world marks in the 1,500 metres (15 minutes 28.36 seconds) and the 400 metres (3 minutes 58.37 seconds).\n\nThe 6-foot- (1.83-metre-) tall Ledecky continued her stellar performance at the 2015 FINA world championships. She captured gold medals in five events (the 200-, 400-, 800-, and 1,500-metre freestyle and the 4 × 200-metre relay) and earned a place in history as the only person to have won four individual freestyle swimming distances in a single world championship or Olympic competition. She also set a world record three times—in the 800-metre final (8 minutes 7.39 seconds) and twice in the 1,500 metres (15 minutes 27.71 seconds in the heats and then 15 minutes 25.48 seconds in the final).\n\nShe put on a dominant showing at the Rio de Janeiro 2016 Olympic Games, where she captured four gold medals (the 200-, 400-, and 800-metre freestyle and the 4 × 200-metre relay) and one silver (4 × 100-metre freestyle relay). Moreover, she set world records in the 400- and 800-metre races (3 minutes 56.46 seconds and 8 minutes 4.79 seconds, respectively), and the 800-metre final saw Ledecky take almost two seconds off the record time as she finished more than 11 seconds faster than her nearest competitor.\n\nAt the 2017 world championships, Ledecky won five gold medals (the 400-, 800-, and 1,500-metre freestyle as well as the 4 × 100- and 4 × 200-metre freestyle). However, she suffered an unexpected loss in the 200 metres, having to settle for silver. At a meet in 2018, Ledecky bettered her previous world record in the 1,500 metres, finishing in 15 minutes 20.48 seconds. Later that year she competed at the Pan Pacific Championships, winning gold medals in the 400-, 800-, and 1,500-metre races. She also captured one silver (4 × 200-metre freestyle) and one bronze (200-metre freestyle). Illness limited her participation at the 2019 world championships, though she managed to win gold in the 800-metre freestyle and silver in both the 400 metres and the 4 × 200-metre relay. She entered the 2020 Tokyo Olympics (which were actually held in 2021 due to the COVID-19 pandemic) as one of the favourites, and she won the 800- and 1,500-metre freestyle; it was the first time that women had competed in the latter event at the Olympics. However, in the 400 metres she suffered her first loss in an individual race at the Games, finishing in second place. In addition, she won a silver in the 4 × 200-metre relay. In 2021 Ledecky graduated from Stanford University."}, {"url": "https://olympics.com/en/athletes/katie-ledecky", "page_content": "Biography\n\nKatie Ledecky is the most decorated of female swimmer in history with six individual Olympic gold medals and 14 individual long course world titles to date.\n\nThe Washington athlete is also holds the 800m and 1500m freestyle world records, and owns 18 of the 20 fastest 1500m freestyle times ever.\n\nHer Olympic journey began, aged 15, with a surprise 800m free gold medal at London 2012. She went on to win four golds at the 2014 Worlds.\n\nGoing into the Rio 2016 Games expectations were high, and Ledecky didn’t disappoint. She bagged the 200m, 400m, 800m and 4x200m freestyle titles to finish as the second most-decorated athlete at Rio 2016 after Michael Phelps.\n\nIn Tokyo, she edged her closest rival Ariarne Titmus to land another 800m Olympic gold medal, before winning the inaugural women's 1500m freestyle title.\n\nIt would take a brave individual to bet against Ledecky adding more Olympic golds to her resume at Paris 2024, and given her relatively young age, from pushing through to a home Games at Los Angeles 2028."}, {"url": "https://www.espn.com/olympics/story/_/id/31647793/katie-ledecky-dominates-200-free-1500-free-us-olympic-swimming-trials", "page_content": "OMAHA, Neb. -- The long and short of it was not an issue for Katie Ledecky.\n\nOn another memorable night for the American swimming star, Ledecky won the 200-meter freestyle and the historic 1,500 free about 70 minutes apart at the U.S. Olympic trials Wednesday, locking up two more individual events for the Tokyo Games.\n\nThis was about as tough as it gets.\n\nFirst, a relative sprint over four laps -- the shortest event in Ledecky's program.\n\nThen, a grueling metric mile comprising 30 laps -- the longest race in pool swimming and one that will be making its Olympic debut for the women in Tokyo.\n\nHer short time between races was chaotically choreographed to keep Ledecky as fresh as possible for the 1,500.\n\n\"The goal was to get in the warm-down pool as quickly as I could,\" she said. \"I tried to keep moving, hydrated and swam for 15-20 minutes before they pulled me to go back to the awards [ceremony]. I ate a banana, drank chocolate milk and water, put a jacket on as I was walking.\"\n\nIt worked out just fine. The 24-year-old from the nation's capital touched the wall far ahead of everyone else with a winning time of 15 minutes, 40.50 seconds -- well off her 2018 world record (15:20.48) but fastest in the world this year.\n\nLedecky has already pondered the significance of the inaugural women's 1,500 free at the Olympics.\n\nAbout time, she said.\n\n\"The men have had the mile in the Olympics since 1908,\" Ledecky pointed out. \"It's 2021, and we finally got one.\"\n\nErica Sullivan was nearly a half-lap behind, but she knocked more than four seconds off her personal best to take the expected second Olympic berth in 15:51.18.\n\nThe 200 free was one of four gold medals that Ledecky won at the Rio Games. She'll get a chance to defend that title after winning in 1:55.11, a full body length ahead of the field.\n\nAllison Schmitt, who won the event at the 2012 London Games, is headed to her fourth Olympics at age 31 after holding off Paige Madden by one-hundredth of a second for the runner-up spot behind Ledecky.\n\nSchmitt's time was 1:56.79, which gives her a likely individual event in Tokyo as well as a spot on the 4x200 free relay. Madden and Katie McLaughlin, who was fourth in 1:57.16, will also be going to the Olympics as relay swimmers.\n\nAs Schmitt crossed the deck, her longtime teammate and good friend Michael Phelps raced down from the stands to give her a long embrace. Both swimmers have disclosed their struggles with depression even while performing brilliantly in the pool.\n\n\"I don't even know how to put it into words,\" Schmitt said. \"He's been a brother inside the pool and outside the pool. It helped me so much. Even now, when he's not swimming, he's a huge part of it.\"\n\nKatie Ledecky won the 1,500-meter freestyle in 15 minutes, 40.50 seconds, the fastest time in the world this year. AP Photo/Charlie Neibergall\n\nLedecky already won the 400 free, though she wasn't as fast as expected. She's also heavily favored in the 800 free, another race she won at Rio, which means she could swim as many as four individual events and perhaps a couple of relays at the Tokyo Games.\n\nLedecky did confirm that she has scratched the 100 free. She has already got enough on her Olympic plate.\n\n\"Katie is amazing,\" Schmitt said.\n\nIn other races on the fourth night of the trials, Zach Harting earned his first trip to the Olympics with a victory in the men's 200 butterfly, while Alex Walsh won a thrilling race in the women's 200 individual medley -- the top three were separated by just four-hundredths of a second.\n\nHarting, a 23-year-old from Huntsville, Alabama, won with a time of 1:55.06 after a restless night.\n\n\"I couldn't sleep last night, woke up before my alarm, heart pounding out of my chest, crazy adrenaline,\" he said. \"I wanted to puke all through warm-up, still kind of want to do that. I don't think I really handled it well, but I knew I was going to win so that kind of gave me a little bit of peace.\"\n\nHarting is already making plans to get the customary Olympic rings tattoo.\n\n\"Coming in here and not making the team was not an option,\" he said. \"I don't know if I could have handled it, so the easiest thing to do was make the team and that's what I did.\"\n\nGunnar Bentz, who was among the swimmers involved in Ryan Lochte's infamous night in Rio five years ago, touched after Harting in 1:55.34 and will get the expected second spot in the event.\n\nWalsh won in 2:09.30, followed by Kate Douglass at 2:09.32 and Madisyn Cox in 2:09.34.\n\nDouglass will get the expected second spot on the Olympic team, while Cox endured another heartbreak after finishing fourth in two events at the 2016 trials.\n\nWalsh and Douglass give the American team two more first-time Olympians.\n\n\"I'm in shock,\" Walsh said.\n\nEighteen-year-old Torri Huske, who already made the team in the 100 butterfly, got off to a blistering start in her signature stroke but couldn't hold on. She faded to fourth.\n\nLedecky is one of at least two swimmers the Americans are counting on to be big stars at these Olympics, the first since 1996 that won't include Phelps. He retired after Rio with a record 23 gold medals and 28 medals overall.\n\nThe other is Caeleb Dressel, who was top qualifier in the semifinals of the 100 free with a time of 47.77.\n\nNathan Adrian, an eight-time Olympic medalist who won the 100 free at the 2012 Olympics and captured a bronze in Rio, failed to even qualify for the final after finishing sixth in his heat and 13th overall at 48.92.\n\nAdrian, who overcame testicular cancer and is now married with a daughter, conceded that it was hard to maintain the sort of focus he needed at age 32.\n\n\"When I had a bad practice before, it was a little bit of a dagger in the heart. I would be very, very affected by that,\" he said. \"Now, I just want to go home and immediately give my wife and baby a hug and a kiss.\n\n\"In so many indescribable ways, this is such an all-in sport. Unfortunately, I wasn't able to stick two good swims out there.\""}, {"url": "https://www.nytimes.com/2021/07/27/sports/olympics/katie-ledecky-1500m-time.html", "page_content": "Katie Ledecky won her first gold medal of the Tokyo Games on Wednesday, dominating the 1,500-meter freestyle, just as she was expected to.\n\nFor Ledecky, the 1,500 victory in 15 minutes 37.34 seconds capped off a busy morning at the Tokyo Aquatics Center. It came a little more than an hour after she suffered the biggest disappointment of her Olympic career as she failed to get on the podium in the 200-meter freestyle race.\n\nErica Sullivan of the United States finished second in 15:41.41, more than four seconds behind Ledecky but good enough for silver. Sarah Kohler of Germany won bronze in 15:42.91.\n\nThis was the first time women have been able to race at 1,500 meters at the Olympic Games, even though men have been competing at the distance for decades."}, {"url": "https://ftw.usatoday.com/2021/07/olympics-tokyo-katie-ledecky-swiming-1500-200-freestyle", "page_content": "Katie Ledecky is officially the first-ever women’s 1,500-meter freestyle Olympic champion, and even though it was a feat the swimming world could have easily predicted based on her previous performances, it was still an exciting and historic moment.\n\nLedecky controlled the entire race and won with a time of 15:37.34 on Wednesday morning at the Tokyo Olympics (Tuesday night in the U.S.).\n\nThe 1,500 free, also known as the mile, is Ledecky’s best event, and she’s dominated it for years in international meets. Until these Olympics, the mile wasn’t offered to women, but in a massively overdue update, it was added to the Olympic lineup in 2017, and it debuted in prelims earlier this week.\n\nAnd now Ledecky is the first Olympic gold medalist in the women’s 1,500, earning her eighth Olympic medal and her sixth gold.\n\nOLYMPIC HISTORY IS MADE‼️@katieledecky wins the first-EVER Olympic gold medal in the women's 1500m free and teammate Erica Sullivan wins the silver.@TeamUSA x #TokyoOlympics #OlympicHERstory pic.twitter.com/fTLlcWFgEg — #TokyoOlympics (@NBCOlympics) July 28, 2021\n\nFellow American Erica Sullivan won silver with a time of 15:41.41 — about four seconds behind Ledecky — and Germany’s Sarah Kohler won bronze at 15:42.91. After the race, Ledecky jumped over the lane marker to hug Sullivan, who competed one lane above her.\n\nLedecky had a slim .19-second lead after the first 50 meters and never looked back. At the 750-meter halfway point, she stretched her lead to 2.87 seconds, and NBC began measuring her lead by meters instead of seconds. That’s dominance.\n\nAmazingly, Ledecky began swimming to this incredible victory about 70 minutes after racing in the 200-meter freestyle final and taking fifth.\n\nHer 1,500 free world record of 15:20.48 from 2018 still stands.\n\nIn prelims of the new event, the Olympic record was set first by Canada’s Katrina Bellio at 16:24.37 in the opening heat, and after repeatedly being lowered through the heats, Ledecky set it at 15:35.35 ahead of the final.\n\nLedecky entered this final with four of the top-5 fastest times in the world this year and 16 of the top-20 times ever in the 1,500 free. That level of dominance is unparalleled, and Ledecky reminded the world why she’s the absolute best in this event with her final in Tokyo."}, {"url": "https://mashable.com/article/katie-ledecky-800-meter-freestyle-win-gold", "page_content": "United States' Katie Ledecky holds up her gold medal in the women's 800-meter freestyle medals ceremony during the swimming competitions at the 2016 Summer Olympics.\n\nUnited States' Katie Ledecky holds up her gold medal in the women's 800-meter freestyle medals ceremony during the swimming competitions at the 2016 Summer Olympics. Credit: Rex Features via AP Images\n\nKatie Ledecky went to sleep late the night before her 800-meter freestyle final, waiting on roommate and fellow gold medal-winner Simone Manuel to get back to their room so Ledecky could congratulate her on a 100-meter freestyle win.\n\nBut the late night hardly seemed to bother the swimming star in her final gold medal race of the 2016 Olympics. She again made it clear that she is unquestionably the best 800-meter freestyler in the world.\n\nSEE ALSO: The moment we witnessed just how fast Katie Ledecky really is\n\nLedecky's third individual freestyle gold made her the first woman to win the 200-, 400- and 800-meter freestyle races since American Debbie Meyer accomplished the feat in 1968 at the Games in Mexico City.\n\nLedecky's gold medal-winning time of 8:04.79 set a new world record -- besting, of course, a world record she already owned -- and placed her more than 11 seconds ahead of runner-up Jazz Carlin of Britain.\n\nThe 800-meter Olympic gold is Ledecky's second in the event. She also notched first place in the 800-meter freestyle at the Games in London when she was just 15.\n\nShe dropped nearly 10 full seconds during those four years, though her time from 2012 would have been good for gold in Rio, too.\n\nHave something to add to this story? Share it in the comments."}, {"url": "https://fivethirtyeight.com/features/no-one-can-catch-katie-ledecky-in-the-mile/", "page_content": "This article is part of our Tokyo Olympics series.\n\nThe women’s 1,500-meter swim made its Olympic debut Wednesday in Tokyo, which meant NBC’s camera operators experienced a struggle previously known to only a few others: They had to film gold medalist Katie Ledecky’s race and make it look close. “She’s got a trail group of three swimmers below her,” announcer Dan Hicks said about halfway through the race, but about 10 seconds later, the broadcast cut to a tighter camera angle that showed Ledecky as if she were swimming in an empty pool.\n\nWhen you combine her history in the 1,500-meter and 800-meter freestyle, which she will race later this week, Ledecky’s dominance in long-distance swimming is unprecedented — to say nothing of the range that allows her to excel in the 400- and 200-meter, the relay of which she anchored to a silver medal on Thursday, and even the 100-meter events. But until this week, she hadn’t had a chance to showcase what might be her best event on an Olympic stage, because the mile race wasn’t part of the program for women. In part because Ledecky has been so captivating in that event, the Olympic committee added it for the Tokyo Games.\n\nIt’s difficult to compare Ledecky’s success in this event to any other in swimming, let alone any other sport. At the 2017 world championships, she won the 1,500-meter race by 19.07 seconds over second-place Mireia Belmonte of Spain — her most lopsided win on a world stage. That margin was wider than the gap between Belmonte and the fifth-place finisher. Ledecky bested Belmonte by 1.27 seconds per 100 meters, except she did it over and over again, 15 straight times. For comparison, the margins of victory in the women’s 100-meter freestyle race in the last four world championships were 0.39, 0.04, 0.18 and 0.55 seconds.\n\nIn 2018, when Ledecky broke her own world record at 15:20.48, the fastest time recorded by any other female swimmer in the world in the 1,500-meter was 15:51.61 by Italy’s Simona Quadarella. On the men’s side, with no swimmer of Ledecky’s caliber, such deficits are unheard of. The two fastest men’s 1,500-meter times in the world in 2018 were separated by 0.73 seconds.\n\nHow an Olympic climber manages her anxiety to get in the zone | FiveThirtyEight\n\nLedecky’s margin of victory at the Olympics, where her gold medal time of 15:37.34 was best by 4.07 seconds, wasn’t quite as large as her previous record-setting races. But though her two closest competitors in the final each finished with a time in the top 25 all-time, Ledecky’s time was still faster than any other woman who’s competed internationally in the event. She now has each of the 13 fastest 1,500-meter times in history. That Ledecky swam in the final on the same night as her appearance in the 200-meter freestyle made the feat even more impressive.\n\nLedecky swims alone most of the time Top 25 fastest times recorded in the women’s 1,500-meter freestyle swim Rk Swimmer Country Year Time 1 Katie Ledecky United States 2018 15:20.48 2 Katie Ledecky United States 2015 15:25.48 3 Katie Ledecky United States 2015 15:27.71 4 Katie Ledecky United States 2014 15:28.36 5 Katie Ledecky United States 2020 15:29.51 6 Katie Ledecky United States 2017 15:31.82 7 Katie Ledecky United States 2014 15:34.23 7 Katie Ledecky United States 2014 15:34.23 9 Katie Ledecky United States 2021 15:35.35 10 Katie Ledecky United States 2017 15:35.65 11 Katie Ledecky United States 2019 15:35.98 12 Katie Ledecky United States 2013 15:36.53 13 Katie Ledecky United States 2021 15:37.34 14 Lotte Friis Denmark 2013 15:38.88 15 Katie Ledecky United States 2018 15:38.97 16 Lauren Boyle New Zealand 2015 15:40.14 17 Katie Ledecky United States 2021 15:40.50 18 Katie Ledecky United States 2021 15:40.55 19 Simona Quadarella Italy 2019 15:40.89 20 Erica Sullivan United States 2021 15:41.41 21 Jianjiahe Wang China 2021 15:41.49 22 Katie Ledecky United States 2015 15:42.23 23 Kate Ziegler United States 2007 15:42.54 24 Sarah Köhler Germany 2021 15:42.91 25 Katie Ledecky United States 2021 15:42.92 Bolded times were set in the final at the Tokyo Olympics. Source: FINA\n\nAfter her race, Ledecky said she was thinking of the American female swimmers who came before her, who blew away the competition but weren’t allowed to swim the 1,500-meter race in the Olympics. The world record holder before Ledecky, fellow American Kate Ziegler, set it at 15:42.54 in June 2007. “I would love for it to be an Olympic event,” Ziegler said at the time, “but I don’t have control over that.”\n\nDecorated distance swimmer Janet Evans held the record before Ziegler, setting it in 1988 at 15:52.10. Evans draped the medal around Ledecky’s neck after the 1,500-meter race at the U.S. Swim Trials last month. “It’s a little bittersweet for me because it was my best race,” Evans said that night. “But I just love it.” Before Evans came Debbie Meyer, the only other woman to win the 200-meter, 400-meter and 800-meter freestyle races in one Olympics. She never had the opportunity to add the mile to that list.\n\nAs it often does, record-breaking star power has inspired an improvement in the competition. In the middle distances, Australia’s Ariarne Titmus has won gold in the 200-meter and 400-meter freestyle races in Tokyo, citing Ledecky as the swimmer who set the standard. “Without her, I would in no way possible be swimming the way that I am now,” Titmus told the Olympic Network last year. “She set this benchmark so high that people have been trying to chase.”\n\nAnd in the 1,500-meter, Ledecky had a teammate on the podium next to her after Erica Sullivan won the silver medal in 15:41.41. The two swam in adjacent lanes and celebrated afterward; Sullivan later told NBC, “Honestly, there was a point when I saw Katie ahead of me, and she was the only one, and it really gave me the energy, having someone you look up to for years and seeing them a few meters —” and then she stopped herself. “Or, several meters in front of you. And using it to get home.”\n\nHow to watch surfing like an Olympic judge | FiveThirtyEight\n\nHow to watch skateboarding like an Olympic judge | FiveThirtyEight"}]}