{"Katie Ledecky has broken 28 world records in her career.": [{"url": "https://www.britannica.com/biography/Katie-Ledecky", "page_content": "Katie Ledecky, byname of Kathleen Genevieve Ledecky, (born March 17, 1997, Washington, D.C., U.S.), American swimmer who was one of the sport’s dominant freestylers in the early 21st century, breaking numerous records. She won 10 Olympic medals, 7 of which were gold.\n\nLedecky made her first splash in international swimming after her freshman year at Stone Ridge School of the Sacred Heart in Bethesda, Maryland, when she set an Olympic-trials record in the 800-metre freestyle to qualify for the 2012 London Games as the youngest member of the U.S. Olympic swimming team. At the Games she set an American record en route to the gold medal in the 800 metres. The following year Ledecky set her first world records in the 800 metres (8 minutes 13.86 seconds) and 1,500 metres (15 minutes 36.53 seconds) at the 2013 Fédération Internationale de Natation (FINA) world championships. In addition to the golds that she won in those two events, Ledecky earned a gold medal in the 400-metre freestyle and as a member of the 4 × 200-metre relay team, and she won the FINA Trophy as the highest-scoring overall female swimmer at the world championships.\n\nBritannica Quiz Sports Quiz\n\nIn June 2014 Ledecky bettered her own records in the 800 metres (8 minutes 11 seconds) and the 1,500 metres (15 minutes 34.23 seconds), and at the U.S. national championships in early August she set a global standard in the 400-metre freestyle with a time of 3 minutes 58.86 seconds, thus becoming the first female swimmer since American Janet Evans to hold simultaneous world records for the 400-, 800-, and 1,500-metre distances. At the 2014 Pan Pacific Championships, Ledecky became the first woman to capture four individual golds in that competition by winning the 200-, 400-, 800-, and 1,500-metre freestyle events, and she claimed another gold in the 4 × 200-metre relay. She also broke her own world marks in the 1,500 metres (15 minutes 28.36 seconds) and the 400 metres (3 minutes 58.37 seconds).\n\nThe 6-foot- (1.83-metre-) tall Ledecky continued her stellar performance at the 2015 FINA world championships. She captured gold medals in five events (the 200-, 400-, 800-, and 1,500-metre freestyle and the 4 × 200-metre relay) and earned a place in history as the only person to have won four individual freestyle swimming distances in a single world championship or Olympic competition. She also set a world record three times—in the 800-metre final (8 minutes 7.39 seconds) and twice in the 1,500 metres (15 minutes 27.71 seconds in the heats and then 15 minutes 25.48 seconds in the final).\n\nShe put on a dominant showing at the Rio de Janeiro 2016 Olympic Games, where she captured four gold medals (the 200-, 400-, and 800-metre freestyle and the 4 × 200-metre relay) and one silver (4 × 100-metre freestyle relay). Moreover, she set world records in the 400- and 800-metre races (3 minutes 56.46 seconds and 8 minutes 4.79 seconds, respectively), and the 800-metre final saw Ledecky take almost two seconds off the record time as she finished more than 11 seconds faster than her nearest competitor.\n\nAt the 2017 world championships, Ledecky won five gold medals (the 400-, 800-, and 1,500-metre freestyle as well as the 4 × 100- and 4 × 200-metre freestyle). However, she suffered an unexpected loss in the 200 metres, having to settle for silver. At a meet in 2018, Ledecky bettered her previous world record in the 1,500 metres, finishing in 15 minutes 20.48 seconds. Later that year she competed at the Pan Pacific Championships, winning gold medals in the 400-, 800-, and 1,500-metre races. She also captured one silver (4 × 200-metre freestyle) and one bronze (200-metre freestyle). Illness limited her participation at the 2019 world championships, though she managed to win gold in the 800-metre freestyle and silver in both the 400 metres and the 4 × 200-metre relay. She entered the 2020 Tokyo Olympics (which were actually held in 2021 due to the COVID-19 pandemic) as one of the favourites, and she won the 800- and 1,500-metre freestyle; it was the first time that women had competed in the latter event at the Olympics. However, in the 400 metres she suffered her first loss in an individual race at the Games, finishing in second place. In addition, she won a silver in the 4 × 200-metre relay. In 2021 Ledecky graduated from Stanford University."}, {"url": "https://time.com/6086057/katie-ledecky-olympics-legacy-tokyo-records/", "page_content": "On her most challenging day of competition in a career filled with them, Katie Ledecky thought about her grandparents.\n\nThe 24-year-old American with a record haul of world championship medals had just finished a disappointing fifth in the 200 meter freestyle at the Tokyo Olympics. In about an hour, she was due to dive back into the pool for the final of the 1,500m freestyle—a grueling test of stamina and resolve. Somehow she had to wash off the loss and reset for the mile-long swim to come.\n\n“I went blank a little, and was trying to find some positive things to get me moving forward,” Ledecky said. “The easiest thing for me to think about are my grandparents; my two grandmothers are still alive, but we lost my two grandfathers quite a few years ago. It makes me really happy to think about them; they are the four toughest people I know. I knew if I was thinking about them during the race I wasn’t going to die, and that I wasn’t going to have a bad swim and they would power me through.”\n\nThey did. Behind a relentless pace, Ledecky earned the first Olympic gold in the women’s 1500m, which was making its debut in Tokyo, and was even able to share the glory with teammate Erica Sullivan, who surged to finish second for silver. And three days later, Ledecky defended her 800m freestyle title in decisive fashion, staking out an early lead and never relinquishing it even as budding rival Ariarne Titmus of Australia closed in.\n\nREAD MORE: Why Katie Ledecky Swims So Fast\n\nLedecky didn’t reach the heights in Tokyo that she did at the 2016 Games in Rio—Titmus thwarted her defense of gold in both the 200m and 400m freestyle—but her performance was spectacular nonetheless. Her final haul of four medals—gold in 1,500m and 800m, silver in the 400m and a silver medal as part of the 4x200m freestyle relay in which Ledecky swam a masterful come-from-behind anchor leg—cement her as one of the greatest and most consistent swimmers in history.\n\n“There will never be another Katie Ledecky,” says Rowdy Gaines, a three-time Olympic gold medalist who covers swimming for NBC. “She is incredibly humble, and incredibly focused and grateful for the gift that she has. She’s a once-in-a-lifetime athlete. Trust me, there will never, ever be another Katie Ledecky. Not in my lifetime.”\n\nEmbracing the pain of training for gold\n\nBorn in Washington, D.C. and raised in suburban Maryland, Ledecky made her Olympic debut at 15, at the 2012 London Games. She stunned the swim world by winning gold in the 800m, setting a fast pace that has become her trademark in distance races. In the years that followed, Ledecky continued to carve seconds off her previous personal best times, most of which were world records, and for a while, she set new records each time she dove into the pool.\n\n“I approach each race with the belief in myself that I can swim a best time, and that’s pretty darn tough,” she said in Tokyo after her gold medal swim in the 1500m. “It’s a real blessing and a curse that I have that attitude, because it’s not easy when your times are world records in some events, and you can’t just keep dropping time with every single swim. It’s what’s served me well over the years, and why I’ve broken so many world records and swum so many fast times. But it’s also a really hard attitude to maintain for nine years.”\n\nLedecky admits that her perspective has changed some, even if her ultimate goal — to swim faster each time she races — remains the same. “I’ve learned a lot over the years; my times may not be my best times, but I’m still really, really happy to have a gold medal around my neck.”\n\nLedecky said she is already looking forward to training for the next Olympics, in Paris in 2024, taking a little solace in the fact that the pandemic delay means the next Games will be in three years instead of four. She could make history there as well if she wins a fourth 800m title.\n\nREAD MORE: Katie Ledecky Adds Another Gold to Her Medal Haul\n\nDistance is a particular strength. Ledecky is able to push through longer swims, at a more rigorous pace, better than anyone else in the world. “She embraces pain,” says Gaines. “I think she embraces the monotony of it all. She pushes herself where it’s not sustainable for other swimmers.” Where most swimmers aren’t ready to commit to the time and effort it takes to swim the mile, Ledecky says she took to it almost immediately. “I was probably 12 or 13 when I swam my first mile,” she said in Tokyo. “I realized I was pretty good at it, and enjoyed it more than some of my peers. So I kind of owned it, and continued to race it and continued to enjoy it. I like the work you have to put in.”\n\nLike all swimmers, Ledecky struggled to find pool time when the world shut down due to the coronavirus pandemic. When the Olympics were postponed by a year, she was in her last year at Stanford University, so she made a pact with teammate and Stanford alum Simone Manuel to stay in California and find ways to continue training together, including getting some laps in at a backyard pool. “It bonded us,” Ledecky said of the experience.\n\nThe extra year also gave Ledecky the opportunity to finish the credits she needed to earn her degree, and she took classes in public health during which she learned more about the challenges of preparing for threats like COVID-19. Her swimming schedule prevented her from attending her own graduation in June, however, since she was in Omaha, Neb. earning a spot on the Olympic Team. She did bring her cap and gown to Trials, and donned them for pictures to celebrate at the most appropriate place for her — on the pool deck.\n\nTraining for the Olympics and managing her academic commitments hasn’t been easy, particularly over the last 18 months. Deciding to remain in California meant that Ledecky wasn’t able to see her parents since she left for school in 2019, before pandemic lockdowns began. She admits that the year has taught her to be more adaptable. “I think I’ve grown a lot, both in and out of the pool. I’m experienced now and just know how to manage both the physical and mental aspects of the sport. If I have a bad practice, I don’t let it get to me.”\n\nThat expanded perspective was on display after Ledecky failed to reach the podium in the 200m. “I don’t want anyone to feel sorry for me, or feel silver or any other medal besides gold is a disappointment or anything. I would much rather that people be concerned about people who are really truly struggling in life,” she said. “It’s a true privilege to be at the Olympics, let alone an Olympics in the middle of a pandemic. So many people in the world are going through a lot of hard things; I’m just lucky to be here.”\n\nRead more about the Tokyo Olympics:\n\nContact us at letters@time.com."}, {"url": "https://www.sportingnews.com/us/athletics/news/katie-ledeckys-olympics-medals-records/8snnvvj8uoku1p9rd7afo65vt", "page_content": "Still early in her career, Katie Ledecky has set the gold standard for female swimmers.\n\nThe 24-year-old distance freestyle swimmer has been on the international stage for nearly a decade and has dominated, winning a record amount of Olympic and world championship gold medals among women in the sport.\n\nShe'll have a chance this year to add to her legacy when she competes in five more events this year. And this year, without Michael Phelps competing on the men's side, she'll be the American swimmer most in the spotlight at the games.\n\nSporting News is taking a look at Ledecky's swimming timeline and how she became the most accomplished female swimmer of all time.\n\nHow many Olympic medals has Katie Ledecky won?\n\nWhile most kids her age were enjoying the summer break between sophomore and junior year of high school, Ledecky was off in London for her first Olympics. The then-15-year-old Ledecky took first place in the 800-meter freestyle at the Olympic trials, coming in two seconds ahead of world champion swimmer Kate Ziegler, who earned the second spot on the team. Ziegler wouldn't be the only swimmer stunned by the young phenom. At the London Olympic Games, Ledecky finished third in the 800 free heats before winning gold with a time of 8:23.84, which was the fastest in the field by 4.13 seconds and set a new American record in the event.\n\nIn the time between London and Rio, Ledecky continued her domination. She set a world record in the 1,500 freestyle at 15:36.53 in a gold-medal winning performance at the 2013 FINA World Aquatics Championships. That wasn't the end of her trip to Barcelona, Spain. Ledecky added gold medals in the 400 free, 800 free and 4x200 free relay, with a world record set in the 800 at 8:13.86. She broke world records in the 800 and 1500 the next year a few times and took down the record in the 400 to establish herself as the sports' premier distance freestyle swimmer. She added five more gold medals at the the 2015 FINA World Aquatics Championships in Kazan, Russia, and five more at the 2014 Pan Pacific Championships.\n\nNeedless to say, she was not considered a \"sleeper pick\" to win any events by the time Rio came around. And she didn't disappoint. Ledecky set Olympic and world records en route to winning the 400 and 800 frees, along with adding gold medals in the 200 free, 4x200 free relay and a silver in the 4x100 free relay.\n\nShe's kept up the pressure on the world stage since then. She added five more medals — three gold, one silver, one bronze — at the 2018 Pan Pacific Championships, took home five gold medals and a silver at the 2017 world championships and added a gold and two silver medals in the 2019 world championships.\n\nLedecky managed silver in her first attempt at a medal in the 2021 Olympics. She was beaten in the 400 freestyle by Australia's Ariarne Titmus. Ledecky later finished fifth in the 200 freestyle with Titmus claiming the gold in the race. She claimed her first gold medal of the 2021 Tokyo Games when she swam the first-ever women's 1500 freestyle at 15:37.34. She also anchored the women's 4x200 freestyle relay to a silver medal finish and won the 800 freestyle at 8:12.57.\n\nHer total international medal count after that race is 28 gold, six silver and one bronze. Her 20 Olympic and world championship gold medals are the most of any women's swimmer.\n\nKatie Ledecky's records\n\nLedecky has taken down a number of records over the years. She's at the point in her career now where the records she breaks are often her own.\n\nBetween the world stage, the Olympics, national and collegiate, Ledecky has claimed a wide range of best times.\n\nHere is a look at the records Ledecky still holds.\n\nWorld records\n\n400m freestyle (LC): 3:56.46 (2016 Rio Games)\n\n3:56.46 (2016 Rio Games) 800m freestyle (LC): 8:04.79 (2016 Rio Games)\n\n8:04.79 (2016 Rio Games) 1500m freestyle (LC): 15:20.48 (TYR Pro Swim Series)\n\nOlympic records\n\n400m freestyle (LC) : 3:56.46 (2016 Rio Games)\n\n: 3:56.46 (2016 Rio Games) 800m freestyle (LC): 8:04.79 (2016 Rio Games)\n\nAmerican records\n\n400m freestyle (LC): 3:56.46 (2016 Rio Games)\n\n3:56.46 (2016 Rio Games) 400m freestyle (SC): 3:54.06 (2019 International Swimming League)\n\n3:54.06 (2019 International Swimming League) 800m freestyle (LC): 8:04.79 (2016 Rio Games)\n\n8:04.79 (2016 Rio Games) 1500m freestyle (LC): 15:20.48 (TYR Pro Swim Series)\n\n15:20.48 (TYR Pro Swim Series) 4x200m freestyle relay (LC): 7:41.87 (2019 World Championships; Simone Manuel, Melanie Margalis, Ledecky, Katie McLaughlin)\n\n7:41.87 (2019 World Championships; Simone Manuel, Melanie Margalis, Ledecky, Katie McLaughlin) 500y (SC) freestyle: 4:24.06 (2017 NCAA Division I Championships)\n\n4:24.06 (2017 NCAA Division I Championships) 1000y (SC) freestyle: 8:59.65 (2015 Nation's Capital Swim Club Invite)\n\n8:59.65 (2015 Nation's Capital Swim Club Invite) 1650y (SC) freestyle: 15:03.31 (2017 Art Adamson Invitational)\n\n15:03.31 (2017 Art Adamson Invitational) 400y (SC) freestyle relay: 3:07.61 (2017 NCAA Division I Championships; Stanford: Manuel, Ledecky, Janet Hu, Lia Neal)\n\nNCAA records\n\n500y (SC) freestyle: 4:24.06 (2017 NCAA Division I Championships)\n\n4:24.06 (2017 NCAA Division I Championships) 1000y (SC) freestyle: 9:08.4 (2016 Ohio State Invitational)\n\n9:08.4 (2016 Ohio State Invitational) 1650y (SC) freestyle: 15:03.31 (2017 Art Adamson Invitational)\n\n15:03.31 (2017 Art Adamson Invitational) 800y (SC) freestyle relay: 6:45.91 (2017 NCAA Division I Championships; Stanford: Manuel, Neal, Ella Eastin, Ledecky)\n\nWhere did Ledecky go to school?\n\nLedecky might have been internationally renowned in high school, but that didn't mean she missed college. She attended Stanford, starting at as a freshman in 2016 after she wrapped up her trip to Rio for the 2016 Olympic Games.\n\nUnsurprisingly, the freshman swept through the college field. She was an NCAA champion in five events and broke a litany of collegiate and American records along the way.\n\nShe only spent two seasons with the Cardinal, but it was a memorable two-year stint in Stanford as she became the American record-holder in the 500-yard, 1000-yard, 1650-yard, 800-meter and 1500-meter freestyle events, claimed six Stanford school records, won eight events at the national championships, was nine times an All-American. She claimed 11 American, 15 NCAA and six NCAA meet records during her two years at Stanford.\n\nWhen is Katie Ledecky swimming?\n\nCompeting in five different events, Ledecky will be on the television often for fans hoping to catch a glimpse of her latest run at history. She will be competing in the heats for each event, which will start at 6 a.m. on their scheduled mornings. The live broadcast will be carried by the USA Network, while NBC will air replays later in the afternoon. When she swims in the finals each day, NBC will broadcast the races, starting at 9:30 p.m. each night. Only the 200 freestyle, among Ledecky's events, will have a semifinal race, which will be held during the evenings along with the finals for other events.\n\nThose interested in streaming her races can log onto NBC platforms NBCOlympics.com, NBCSports.com or Peacock, or watch them on fuboTV, which offers a 7-day free trial.\n\nHere is the full schedule for when Ledecky will be swimming.\n\nSunday, July 25\n\nEvent Time (ET) Channel Women's 400 Freestyle Heats 7:39 a.m. USA Women's 400 Freestyle Finals 10:20 p.m. NBC\n\nMonday, July 26\n\nEvent Time (ET) Channel Women's 200 Freestyle Heats 6:02 a.m. USA Women's 1500 Freestyle Heats 7:32 a.m. USA Women's 200 Freestyle Semifinals 9:30 p.m. NBC\n\nTuesday, July 27\n\nEvent Time (ET) Channel Women's 200 Freestyle Final 9:41 p.m. NBC Women's 1,500 Freestyle Final 10:54 p.m. NBC\n\nWednesday, July 28\n\nEvent Time (ET) Channel Women's 4x200 Freestyle Relay Heats 7:34 a.m. USA Women's 4x200 Freestyle Relay Finals 11:31 p.m. NBC\n\nThursday, July 29\n\nEvent Time (ET) Channel Women's 800 Freestyle Heats 6:02 a.m. USA\n\nFriday, July 30"}, {"url": "https://olympics.com/en/athletes/katie-ledecky", "page_content": "Biography\n\nKatie Ledecky is the most decorated of female swimmer in history with six individual Olympic gold medals and 14 individual long course world titles to date.\n\nThe Washington athlete is also holds the 800m and 1500m freestyle world records, and owns 18 of the 20 fastest 1500m freestyle times ever.\n\nHer Olympic journey began, aged 15, with a surprise 800m free gold medal at London 2012. She went on to win four golds at the 2014 Worlds.\n\nGoing into the Rio 2016 Games expectations were high, and Ledecky didn’t disappoint. She bagged the 200m, 400m, 800m and 4x200m freestyle titles to finish as the second most-decorated athlete at Rio 2016 after Michael Phelps.\n\nIn Tokyo, she edged her closest rival Ariarne Titmus to land another 800m Olympic gold medal, before winning the inaugural women's 1500m freestyle title.\n\nIt would take a brave individual to bet against Ledecky adding more Olympic golds to her resume at Paris 2024, and given her relatively young age, from pushing through to a home Games at Los Angeles 2028."}, {"url": "https://www.sportskeeda.com/swimming/how-many-world-records-katie-ledecky-still-have", "page_content": "While Katie Ledecky's friends were enjoying their summer vacation, she set world records. The American star has been blessed with the most decorated career for a female swimmer. Whether at the Olympics or world championships, there is no match for her.\n\nPulling off a surprise by claiming a gold medal at the 2012 London Olympics, Ledecky made it to the headlines when she was just 15. Hungry for more, the journey to excellence continued as she claimed five gold medals at the 2015 World Championships.\n\nIt's correct to say that she is a ruthless warrior who enjoys dominating the pool with speed, stamina, and caliber.\n\nKatie Ledecky, the world's most-established female swimmer, holds the world record in women's 800 and 1500-meter freestyle (long course). Moreover, she is a former world record holder in the 400-meter freestyle also.\n\nLedecky is one of the greatest athletes the world of modern sports has seen. She also holds the record for the fastest-ever time in women's 500 yards freestyle events and 1000 and 1650-yard events.\n\nThe 25-year-old has broken 14 world records. She became the youngest Olympic 800m freestyle gold medalist (female) after winning a gold medal at the age of 15 years and 139 days.\n\nShe also holds a Guinness Book world record: Most medals won at the FINA Swimming World Championships (female). Ledecky won 22 medals, leaving behind Natalie Coughlin, who won 19.\n\nKatie Ledecky's early life and professional career\n\nKatie Ledecky is the daughter of Mary and David Ledecky. It was March 17, 1997, when the legendary player was born. Even though she was born in Washington DC, the swimming prodigy moved to a suburb of Bethesda, Maryland, when she was very young.\n\nLedecky was inspired by her brother and mother and decided to pursue a career in swimming. Her mother, Mary, swam for the University of New Mexico.\n\nLedecky twice set national high school, American, and US Open records in freestyle swimming during high school.\n\nKatie Ledecky\n\nHer astonishing performance at the London Olympics gave new wings to her career. While going to Rio, fans expected medals from her, and Katie, being Katie, didn't disappoint.\n\nFollowing incredibly tough competition from Sarah Sjostrom, Ledecky stood proudly at the podium, singing her national anthem four times in a row. She bagged four gold medals, one silver, and two bronzes at the 2016 Rio Olympics.\n\nKatie Ledecky\n\nKatie Ledecky also set two world records at the event, emerging as the most decorated female athlete in the history of swimming. Ledecky has won 42 medals in international tournaments, including the Summer Olympics, Pan Pacific Championships, and World Championships.\n\nHer success earned her the title of Sportsperson of the Year in 2017, Associate Female Athlete of the Year in 2017, United States Olympic Committee Female Athlete of the year in 2013, and ESPY Best Female Athlete in 2022.\n\nEarlier this year, she won four events at Budapest's 2022 World Aquatic Championships. With her victory, she set the record for the world's first swimmer (male or female) to win five consecutive world championships (individual events).\n\nPoll : 0 votes"}, {"url": "https://www.biography.com/athletes/katie-ledecky", "page_content": "(1997-)\n\nWho Is Katie Ledecky?\n\nBorn in Maryland in 1997, Katie Ledecky began swimming competitively at age six. After earning a berth on the U.S. Olympic team at age 15, she set an American record in the 800-meter freestyle to win a gold medal at the 2012 Summer Games. Ledecky has since shattered world records across an array of freestyle events ranging from 400 to 1,500 meters. At the 2016 Olympic Games in Rio, she dominated the pool, winning gold medals in the 400-meter freestyle in world record time, the 200-meter freestyle and the 4x200 meter freestyle relay, and silver in the 4x100 meter freestyle relay. She also broke the world record, winning gold in the 800-meter freestyle.\n\nEarly Years and Competitive Career\n\nKathleen Genevieve \"Katie\" Ledecky was born on March 17, 1997, in Bethesda, Maryland. The second child of David, a lawyer, and Mary Gen, a former collegiate swimmer and hospital administrator, she began swimming competitively at the Palisades Swim & Tennis Club at age six, alongside her older brother, Michael.\n\nWith her seemingly insatiable appetite for pool activity, Ledecky became a standout at the Nation’s Capital Swim Club under coach Yuri Suguiyama. In 2011, Suguiyama began instructing Ledecky to kick more aggressively while racing, a technique commonly used by elite men's swimmers but rarely seen on the women's side. That summer, before the start of her freshman year at Stone Ridge School of the Sacred Heart, she dominated the U.S. Junior Championships with wins in the 400-, 800- and 1,500- meter freestyle events.\n\n2012 London Olympics Breakout Star\n\nLedecky made her senior debut at the 2012 United States Olympic Trials, entering the 200-, 400- and 800-meter freestyles. The lack of top-level experience proved to be no obstacle for the 15-year-old, who surged to an eye-opening win in the 800m to become the youngest member of the U.S. team.\n\nHer momentum continued through the competition at the 2012 London Games, where Ledecky paced her heat in the 800m. She then blew the competition out of the water in the final, breaking Janet Evans's 23-year-old American record with a time of 8:14.63 to win the gold medal.\n\nAfterward, Ledecky displayed the easy confidence of someone who expected to win. “I knew if I put my mind to it, I could do it,” she said. “I wasn’t intimidated at all.”\n\nContinued Swimming Success\n\nUnder the guidance of new coach Bruce Gemmell, Ledecky showed that her 2012 Olympic performance was merely the tip of the iceberg. Proving capable of winning both middle- and long-distance events, she established world records in the 800- and 1,500-meter freestyles en route to four gold medals at the 2013 FINA World Championships. She claimed another four golds at the 2014 Pan Pacific Swimming Championships, and at the 2015 FINA World Championships, she became the first woman to win the 200- 400- 800- and 1500-meter freestyles in a major competition. Her victories often coming via huge margins, Ledecky has been honored as the FINA Swimmer of the Year, the USOC's Olympic SportsWoman of the Year and a three-time Golden Goggle Female Athlete of the Year.\n\nThe champion swimmer was accepted to Stanford University prior to her graduation from Stone Ridge in 2015, but she elected to defer enrollment to focus on training for the 2016 Summer Olympics. Proving to be in peak form well before the start of Olympic competition, she set her 11th world record with a time of 8:06.68 in the 800m free at the Arena Pro Swim Series in January 2016.\n\nAdditionally, Ledecky headed into the summer as the world-record holder in the 400- and 1,500-meter freestyles. Unbeaten in all major international competition, she was expected to add to her already impressive gold medal count and become one of the American team's most celebrated Olympians by the close of the 2016 Rio Games.\n\n2016 Rio Olympic Games\n\nLedecky did not disappoint in Rio. In her first individual event, the women's 400-meter freestyle, she won gold, soaring past the competition early on and finishing with a time that was two seconds better than her own world record and four seconds more than her second place finisher. She also helped her teammates win silver in the Women's 4x100 meter freestyle relay. She went on to win gold again in the 200-meter freestyle race, edging out Swedish swimmer Sarah Sjostrom, who won silver. After the grueling race, Ledecky spoke about finding the strength to grab the gold. “I did come pretty close to throwing up during that last 50,” Ledecky said. “I knew I just needed to get my hand on the wall and be done. Everything was hurting . . .I just had to dig deep and do my own thing. I had no idea whether I touched first . . .I was done when I touched the wall. I knew I’d given it everything I had to.\n\nShe continued to dominate as the anchor in the 4x200 meter freestyle relay, winning the gold medal with teammates Allison Schmitt, Leah Smith and Maya Dirado. She also defended her 2012 world title in the 800-meter individual freestyle in a stunning victory, finishing the race at 8:04:79 and smashing the world record. With this gold win, Ledecky became the second woman to win three individual freestyle events at a single Olympic Games, a feat also accomplished by Debbie Meyer at the 1968 Olympics in Mexico City.\n\n2021 Tokyo Olympics\n\nLedecky will compete at the 2021 Tokyo Olympics, swimming in the 200-meter freestyle, 400-meter freestyle, 800-meter freestyle and 1,500-meter freestyle, as well as the 4×200-meter freestyle relay.\n\nQUICK FACTS\n\nName: Katie\n\nBirth Year: 1997\n\nBirth date: March 17, 1997\n\nBirth State: Maryland\n\nBirth City: Bethesda\n\nBirth Country: United States\n\nGender: Female\n\nBest Known For: American swimmer Katie Ledecky won a gold medal at the 2012 Olympics before shattering numerous world records. She continued her winning streak at the 2016 Summer Olympics, earning four gold medals and one silver medal.\n\nIndustries\n\nSports\n\nAstrological Sign: Pisces\n\nSchools\n\nGeorgetown University\n\n\n\nStandford University\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Katie Ledecky Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/athlete/katie-ledecky\n\nAccess Date:\n\nPublisher: A&E Television Networks\n\nLast Updated: July 22, 2021\n\nOriginal Published Date: July 1, 2016\n\nQUOTES"}, {"url": "https://www.sportskeeda.com/swimming/what-katie-ledecky-s-world-record", "page_content": "Katie Ledecky is one of the most decorated US swimmers of all time. The incredibly successful athlete from Maryland has set several world records in women's swimming. The 24-year old qualified for the Tokyo Olympics 2020 at the 2021 US Olympic Swimming Trials.\n\nThe Tokyo Olympics will be Katie Ledecky's third successive Summer Games.\n\nRead: How to watch Tokyo Olympics 2020 in USA? TV and LIVE streaming details\n\nWho is Katie Ledecky?\n\nKatie Ledecky took up swimming at the young age of six. She attended the Little Flower School until eighth grade and then shifted to Stone Ridge School of the Sacred Heart, where she finished high school. While in high school, Katie Ledecky shattered the national high school record twice in the 200m freestyle.\n\nAfter graduating from high school, Ledecky joined Stanford University on a scholarship. Here, she was part of the Standford Cardinal swimming team and trained under Greg Meehan.\n\nRepresenting Stanford Cardinal, Katie Ledecky won eight NCAA titles, in 200y Freestyle, 500y Freestyle (2), 1650y Freestyle (2), 4x400y Freestyle, and 4x800y Freestyle (2) at the NCAA Division 1 Women’s Swimming Championships.\n\nKatie Ledecky is the most successful female swimmer in the history of the World Aquatics Championships, with 15 titles.\n\nAbout 18 years ago, I started swimming year-round and I still think it’s the most enjoyable sport, and one that teaches an important life skill. Katie Ducky and I are hoping that lots of young kids learn to swim this Summer...and have fun! pic.twitter.com/H8UQfVKadK — Katie Ledecky (@katieledecky) June 1, 2021\n\nRead: Tokyo Olympics 2020: 5 swimmers to watch out for\n\nKatie Ledecky's world records\n\nKatie Ledecky holds three world records in swimming - in 400m, 800m, and 1500 freestyles. She is nicknamed 'The First Lady of Freestyle'. At the 2016 Rio Olympics, the US swimmer set new world records in 400m and 800m freestyles.\n\nIn the 400m freestyle event, Katie Ledecky swam a 3:56.46s to break the world record she set at the 2014 Pan Pacific Swimming Championships. Five days later, she broke the 800m freestyle world record with a timing of 8:04.79 seconds. Katie Ledecky has held the 800m freestyle world record four times in her career.\n\nIn the 1500m freestyle, Ledecky clocked 15:20.48 seconds in the TYR Pro Swim Series 2018, bettering another of her own records. She has broken the world record five times in the event, the most by any female swimmer.\n\nRead: Tokyo Olympics 2020: the US announces smallest captains line-up for swimming team, Caeleb Dressel and Allison Schmitt included\n\nKatie Ledecky's Olympic performances\n\nKatie Ledecky has been a successful athlete at the Games. She qualified for her debut Olympics as a 15-year-old. She was still in high school when she clinched the 800m freestyle gold at the 2012 Summer Games.\n\nAt the Rio Olympics, Katie Ledecky emerged successful with five medals. She swept the golds in 200m, 400m and 800m freestyles and 4x200m freestyle relay, and helped her team win a silver in the 4x100m Freestyle.\n\nIn Tokyo, Ledecky will look to defend her titles. Her campaign begins on 27th July 2021.\n\nRead: Katie Ledecky at Tokyo Olympics 2020: Can the US swimmer win 5 gold medals?\n\nPoll : 0 votes"}, {"url": "https://www.npr.org/2015/08/04/429386006/swimmer-katie-ledecky-breaks-her-own-record-again", "page_content": "Swimmer Katie Ledecky Breaks Her Own Record, Again\n\nThe 18-year-old blasted past the world record in the 1,500 freestyle — the one she set Monday, while hardly trying. Host Melissa Block talks to New York Times reporter Karen Crouse about the swimmer.\n\nMELISSA BLOCK, HOST:\n\nShe's broken nine world records in two years - swimmer Katie Ledecky, just 18 years old and blazing through the world championships in Kazan, Russia, this week. Get ready to hear a lot more about Ledecky in next summer's Olympics. Karen Crouse is in Kazan covering the worlds for The New York Times. And Karen, let's talk about this. Katie Ledecky smashed her own world record. It was a record she had set just one day earlier in the 1,500-meter freestyle. That's almost a mile of swimming. How did she do it?\n\nKAREN CROUSE: Melissa, it was incredible. If you can imagine this, her final 50 was her second-fastest lap, exceeded only by her first lap in which she had the benefit of the dive - just incredible. So her time was just two seconds faster than what she recorded yesterday - 15, 25, 48. And just to put that time in perspective for your listeners who aren't swimming nerds...\n\nBLOCK: (Laughter).\n\nCROUSE: That time would place her or rank her 81st in the world in the men's 1,500 this year.\n\nBLOCK: Then Katie Ledecky did another amazing thing, which is in very short order after that 1,500-meter race. She had to turn around and race in the 200-meter freestyle, a very different, I would think, kind of swimming. And yet, she's really good in both.\n\nCROUSE: Very few people would even try this double, even if they were seven days apart. You need to have a sprinter's speed to compete with the best in the world in the 200. And of course, the 1,500 is the longest event in the pool. So when she was finished with the 1,500, she hopped out of the pool, warmed down and 29 minutes later, was back on the blocks for the semifinal swim of the 200 freestyle. And somehow, she found enough energy to pass four swimmers on that final lap and record a time that was good enough to be among the top eight. So she will be swimming the 200 free final tomorrow.\n\nBLOCK: What was Katie's reaction today when she looked up, realized she had broken her own record and broke it pretty handily by more than two seconds?\n\nCROUSE: It was rather muted. She splashed the water, but I think she was actually conserving her energy. And so she didn't want to make more of a fuss than that because she had another 200 to swim. A lot of us in this press room have been racking our brains trying to think if there's anything that really compares to this. It's right up there with Michael's eight gold medals in Beijing because that was...\n\nBLOCK: You're talking about Michael Phelps.\n\nCROUSE: Michael Phelps - that was strung out over eight days - just incredible.\n\nBLOCK: Karen, you swam competitively when you were growing up and all through college. When you watch Katie Ledecky in the pool - watch her stroke and watch her kick - what is she doing that's so great?\n\nCROUSE: That's the $64,000 question because if you talk to her coach, he will tell you she's not the best kicker. She's far from the fastest puller. But when you put two together, there's something that's just magic. But for all of her natural gifts, she is a dogged competitor. I call her the smiling assassin because she's so nice. Everyone talks about how she may be the nicest person you'll ever meet. And so she kind of reels you in with her pleasantness. And then right when you think, wow, she looks harmless enough, boom - she dives into the water and, you know, leaves you in her wake.\n\nBLOCK: Karen Crouse, thanks so much for talking with us. Enjoy the rest.\n\nCROUSE: Thank you. My pleasure.\n\nBLOCK: That's reporter Karen Crouse with The New York Times. She's trying to keep up with Katie Ledecky, covering the world championships of swimming in Kazan, Russia.\n\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nNPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record."}, {"url": "https://www.espn.com/espnw/voices/article/25499475/dominant-20-katie-ledecky-swimming-origins-breaking-records-one-fear", "page_content": "Katie Ledecky is No. 5 on ESPN The Magazine's list of the most dominant athletes of the year. Click here for more on the Dominant 20. Subscribe today!\n\nStanford psychology major Katie Ledecky, 21, has 14 world records and five Olympic golds, the first coming in 2012 at just 15 years old. The world's most dominant swimmer recently turned pro but has seemed professional for decades, because of her unerringly levelheaded demeanor and because she swims so far ahead of the competition it's as if she's in her own pool. She holds the world's eight fastest times in the 1,500-meter freestyle and has shattered her own records by staggering margins. Her six-year, $7 million deal with swimwear company TYR and her 2018 cover of National Geographic, the first for a female Olympian, prove that nice girls not only finish first -- they rule.\n\nAllison Glock: Why swimming?\n\nKatie Ledecky: My mom swam in college, but she never pushed me into the sport. She wanted me to feel comfortable in the water, so she taught my brother and me how to swim from a pretty early age. When I was 6, we joined a summer-league pool. We didn't really know anybody, and my mom thought that the fastest way for us to meet people would be to join the swim team.\n\nAG: So your unrivaled swimming career started as a way to make friends?\n\nKL: [Laughs] Pretty much, yeah. I played a number of sports growing up. Basketball, soccer. I eventually realized that I was picking swimming over basketball practice. I also broke my arm playing basketball, so that may have contributed a little bit to it. [Laughs]\n\nAG: Did you have an immediate kinship with the water?\n\nKL: No. I didn't drop into the pool on day one a great swimmer. For my first summer of league swimming, my only goal was to be able to do the 25 free without stopping to wipe my nose or catch my breath. And by the end of the summer, I was able to do that.\n\nAG: When did you first recognize how good you could be?\n\nKL: Swimming wasn't something that came naturally, but I kept working at it, and by the time I was 8, I'd broken a couple of county records. Then by the time I was 10, I was breaking some Potomac Valley [Maryland] swimming records, kind of a bigger deal.\n\nAG: You haven't stopped breaking records since. What do you think makes you so dominant?\n\nKL: I've always had a knack for goal-setting. I don't really compare myself to others. For me, it's about not being afraid to set scary goals, goals that most people never even dream of, and then going out and chasing them.\n\nAG: What's an example of a scary goal to you?\n\nKL: In 2014, I set my goals for Rio in 2016 to go 3:56 or better in the 400 free and to go 8:05 or better in the 800 free. And back then, those times were 10 seconds faster than what anyone else had ever done before and seven seconds faster than what I'd done.\n\nAG: And you met those goals.\n\nKL: [Laughs] Yeah. It's kind of crazy for me even to think about. I met them right on the nose in Rio.\n\nAG: You were the youngest U.S. swimmer at the 2012 and 2016 Games. Was that an additional challenge?\n\nKL: My first time traveling internationally to swim was the 2012 Olympics! That was a little daunting. I always loved watching the Olympics on TV, so to have a front-row seat was just incredible. My race wasn't until the second-to-last day. I watched all my teammates win medals, and that inspired me.\n\nAG: Do you view yourself as wiser than your years?\n\nKL: The family that I have, the education that I've had, and being a student throughout my swimming career, I think all of that has helped me stay pretty grounded. At the same time, going through the Olympics at age 15 and coming back with a gold medal ... you do grow up a little faster than some other people. At the end of the day, I try to do things the right way in and out of the pool, and hopefully that shows.\n\nAG: What would you call your defining quality?\n\nKL: I'm driven. I'm motivated by myself and the benchmarks I set for myself and trying to be faster, better, stronger in every aspect of my life. That said, I try not to get too caught up in moments, not to be too excited about any one accomplishment. When I was younger and started breaking county records, that may have been a time when I realized I'm pretty good. But being great at age 8 doesn't mean you're going to be an Olympian. And the Olympics were never a goal of mine growing up.\n\nAG: They weren't?\n\nKL: No. It was never a dream of mine to get to that level. There are those Olympians who say that they have always dreamed of going, but that was never me. I just never pictured myself there. I only understood how to qualify for trials about a year before I did.\n\nAG: Have you changed anything significant about your technique as your career evolves?\n\nKL: My stroke probably changes every year, honestly. I made a breakthrough when I was about 14. Kinda this loping stroke. I only really breathe to one side. It's a way that I utilize my strength, which is my catch in the water, the underwater portion of my stroke. And I use my legs a lot more than most swimmers. I use the strength of my catch up front and then power behind me with my legs. After 2012, I started focusing on shorter events and expanding my range, different pacing and ways of managing energy.\n\nAG: What's the one thing that people get wrong about swimming?\n\nKL: That it's every four years. Swimming is every day, it's 10 times a week.\n\nAG: What's your most joyful memory in the pool?\n\nKL: Oh wow. Probably those first moments when I was just starting to swim summer league, honestly. When I was a kid. I clearly remember learning how to breathe, playing water polo or sharks and minnows. Those are really, really great memories.\n\nAG: It's striking that those seminal childhood memories dwarf winning golds or breaking records.\n\nKL: Certainly winning my first gold in 2012 was pretty surreal and joyful in a different way. But I keep things in perspective. It can be very easy to get wrapped up in ambition. But I think at the end of the day, it's still just a hobby for me. I got into swimming to meet people, and I feel like I've been able to do that at a level that I never imagined. Swimming is just something I try to have fun with.\n\nAG: That's a really unique point of view for any pro athlete, let alone someone of your level and skill set.\n\nKL: I'm just doing what I love and what I'm passionate about and trying to do it to the best of my ability. That's kind of the message that I have for kids. Find something that you love and pursue it to the best of your ability.\n\nAG: When are you the happiest?\n\nKL: When I'm at swim practice, surrounded by my teammates. I just love walking away from practice feeling like I've gotten better. That's been a constant in my life since I was 6 years old.\n\nAG: Nothing seems to rattle you. Are you afraid of anything?\n\nKL: Cats. [Laughs] I'm afraid of cats."}, {"url": "https://olympics.nbcsports.com/2022/11/05/katie-ledecky-world-record-swimming-800-meters-freestyle/", "page_content": "For Sydney McLaughlin-Levrone, what happens in her first outdoor race of 2023 on Friday could dictate the rest of her season. It may impact her 2024 Olympic plans, too.\n\nMcLaughlin-Levrone strays from the 400m hurdles — where she is the reigning Olympic and world champion and four times broke the world record — to race her first flat 400m in two years at a Diamond League meet in Paris.\n\nPeacock streams it live from 3-5 p.m. ET. CNBC airs coverage Saturday at 1 p.m. ET.\n\nWhat we know is this: On Friday, McLaughlin-Levrone will race against the Olympic and world silver medalist in the 400m (Marileidy Paulino of the Dominican Republic) and the 2019 World champion (Salwa Eid Naser of Bahrain).\n\nNext month, McLaughlin-Levrone will race the flat 400m at the USA Track and Field Outdoor Championships, the qualifying meet for August’s world championships. She is racing that flat 400m at USATF Outdoors at least in part because she already has a bye into the 400m hurdles at worlds as defending champion.\n\nWhat we don’t know: which race McLaughlin-Levrone will enter at worlds. Her coach, Bobby Kersee, said last month that she will choose between the 400m and 400m hurdles for worlds, should she finish top three in the 400m at USATF Outdoors to qualify in that second event. She will not try a 400m-400m hurdles double at worlds.\n\nMcLaughlin-Levrone was asked Thursday which event she would pick if given the choice.\n\n“Is it bad to say I don’t know?” she said in a press conference. “Honestly, ask me after tomorrow. I don’t know. I’ve got to run this one first and see how it feels.”\n\nMcLaughlin-Levrone also doesn’t know what she will try to race at the 2024 Paris Olympics. Next year, the 400m-400m hurdles double is more feasible given one could do both events without ever racing more than once per day.\n\n“We’re still focused on 2023,” McLaughlin-Levrone said. “One step at a time, literally. Obviously that’s something as the season comes to an end we’ll kind of start to look and figure out what our plan is for next year.”\n\nHere are the Paris entry lists. Here’s the schedule of events (all times Eastern):\n\n12:57 p.m. ET — Women’s Shot Put\n\n1:35 — Women’s High Jump\n\n2:15 — Women’s Discus\n\n2:20 — Women’s Pole Vault\n\n3:04 — Men’s 400m Hurdles\n\n3:15 — Women’s 800m\n\n3:19 — Men’s Long Jump\n\n3:24 — Women’s 5000m\n\n3:42 — Women’s Javelin\n\n3:52 — Men’s 110m Hurdles\n\n4:02 — Women’s 400m\n\n4:12 — Men’s 100m\n\n4:22 — Women’s 200m\n\n4:32 — Men’s 3000m Steeplechase\n\n4:51 — Men’s 800m\n\nHere are six events to watch:\n\nWomen’s Pole Vault — 2:20 p.m. ET\n\nOlympic and world champion Katie Moon won the first two Diamond League meets and again faces some of her biggest domestic and international challengers in Paris. That includes fellow American Sandi Morris, who won the first three Diamond League meets last year, then took silver behind Moon at worlds on count back. Plus 34-year-old Slovenian Tina Sutej, who ranks second in the world this season.\n\nWomen’s 5000m — 3:24 p.m. ET\n\nIncludes the world record holders at 1500m (Kenyan Faith Kipyegon in her first 5000m since 2015), 3000m steeplechase (Kenyan Beatrice Chepkoech) and the 5000m and 10,000m (Ethiopian Letesenbet Gidey). Plus new American 10,000m record holder Alicia Monson, who is third on the U.S. all-time 5000m list at 14:31.11. Shelby Houlihan has the American record of 14:23.92.\n\nMen’s 110m Hurdles — 3:52 p.m. ET\n\nThe three members of the U.S. Olympic team in Tokyo — Grant Holloway, Devon Allen and Daniel Roberts — could face off for the first time in nearly a year. Holloway, who has a bye into worlds as defending champion, overcame a rare defeat in the Diamond League opener in Rabat to win his last two races. He is the fastest man in the world this year at 13.01 seconds. Allen isn’t far behind at 13.12, while Roberts has yet to race the hurdles this outdoor season.\n\nWomen’s 400m — 4:02 p.m. ET\n\nCould very well determine the favorite for worlds. Reigning Olympic and world champion Shaunae Miller-Uibo of the Bahamas is on maternity leave. Paulino is the only other woman to break 49 seconds since the start of the pandemic, and she’s done it each of the last two years. Naser is the only other active woman to have broken 49 seconds, doing so in winning the 2019 World title (before she was banned for two years, through the Tokyo Olympics, for missing drug tests). McLaughlin-Levrone’s personal best from 2018 is 50.07 seconds, but she was just 18 years old then and focusing on the hurdles. Still, that time would have won the 2022 U.S. title. Last month, University of Arkansas junior Britton Wilson ran the fastest time by an American since 2009 — 49.13 — but she might bypass the flat 400m to focus on the hurdles this summer.\n\nMen’s 100m — 4:12 p.m. ET\n\nCould be a meeting between the reigning Olympic men’s 100m champion (Marcell Jacobs of Italy) and world men’s 200m champion (American Noah Lyles), which hasn’t happened since the 2009 World Championships 100m final, where Usain Bolt lowered the world record to 9.58 seconds and American Tyson Gay was second in a then-American record 9.71. Later in that meet, Bolt won his first world 200m title, a crown he held concurrently with his Olympic 100m titles through his 2017 retirement. But Jacobs, citing nerve pain, scratched out of the last two Diamond League meets, which were to be showdowns with world 100m champion Fred Kerley. Jacobs did show up for Thursday’s press conference. Lyles has a bye onto the world team in the 200m, but also wants to make the four-man U.S. team in the 100m. He ranks fifth among Americans by best time this season — 9.95.\n\nMen’s 800m — 4:51 p.m. ET\n\nThe top five from the world championships are entered, led by Olympic and world champion Emmanuel Korir of Kenya. This event was in an international doldrums for much of the time since Kenyan David Rudisha repeated as Olympic champion in 2016, then faded away from competition. But the emergence of 18-year-old Kenyan Emmanuel Wanyonyi has injected excitement this season. Wanyonyi is the world’s fastest man this year. The second-fastest, Kenyan Wycliffe Kinyamal, is also in this field.\n\nCorrection: An earlier version of this post incorrectly reported the TV window for the meet broadcast. The CNBC broadcast begins at 1 p.m. ET on Saturday, not 3.\n\nOlympicTalk is on Apple News. Favorite us!"}]}