{"Katie Ledecky holds the world records in the women's 400-meter freestyle (long course), 800-meter freestyle (long course), and 1500-meter freestyle (long course).": [{"url": "https://www.usatoday.com/story/sports/olympics/2022/06/18/katie-ledecky-wins-400-freestyle-title-world-swimming-championships/7670611001/", "page_content": "The Associated Press\n\nBUDAPEST, Hungary – Katie Ledecky started the United States’ medal collection at the world swimming championships with a gold by reclaiming her title in the women’s 400 meters on Saturday.\n\nThe Americans finished the first day of racing with two gold, one silver and three bronze.\n\nLedecky clocked 3 minutes, 58.15 seconds – nearly two seconds off the world record – for her fourth world title in the 400 freestyle after 2013, 2015 and 2017.\n\nAriarne Titmus pipped Ledecky to the title in 2019 and took her world record last month but the Australian has skipped the worlds in Budapest to focus on the Commonwealth Games next month in England.\n\n“It’s great to get the first gold medal for the U.S. team,” said Ledecky, who said she’s working on reclaiming her record, too. “I’m on the right track.”\n\nWinning the 400 gave Ledecky her 16th gold at a worlds and 18th overall. She’s just one behind Natalie Coughlin for the most all-time medals by a female swimmer in world championships history.\n\nLedecky next turns attention to a potential fifth consecutive world title in the 1500 with heats on Sunday before the final on Monday.\n\nCanadian 15-year-old Summer McIntosh clocked under 4 minutes for silver behind Ledecky.\n\n“I just wanted to have fun and race and push and hang on with the others,” McIntosh said.\n\nBoth were well ahead of the competition, with American Leah Smith 3.93 behind Ledecky in third and Australia’s Lani Pallister finishing fourth.\n\nThe American relay team of Caeleb Dressel, Ryan Held, Justin Ress and Brooks Curry won the men’s 4x100 freestyle final, clocking 3:09.34 to finish ahead of the Australians in second and Italians in third.\n\nThe Australian women responded by winning their 4x100 freestyle final, 1.20 ahead of the Canadians and 1.63 ahead of the Americans.\n\nMollie O’Callaghan, Madison Wilson, Meg Harris and Shayna Jack were all quickest and clocked 3:30.95.\n\n“Everyone did her job,” Wilson said.\n\nAustralia’s Elijah Winnington took the first gold of the evening when he powered home in the final length of the men’s 400 meters to overtake Germany’s Lukas Martens. Winnington clocked 3 minutes, 41.22 seconds, a personal best and the third fastest time at a worlds.\n\n“I try to keep up with the Australian guy but in the end he swam away,” said Martens, who finished 1.63 seconds behind.\n\nBrazil’s Guilherme Costa was third.\n\nNone of the medalists from 2019 raced in the men’s 400. Sun Yang of China is banned for a doping infringement, Australia’s Mack Horton – the 2016 Olympic champion – failed to qualify by 0.10 seconds, and Gabriele Detti did not enter.\n\nLéon Marchand won gold for France with a dominant display in the men’s 400 medley. The 20-year-old Marchand clocked 4:04.28 for a European record and the second fastest ever after Michael Phelps’ record of 4:03.84 from the 2008 Olympics in Beijing.\n\nAmericans Carson Foster and Chase Kalisz claimed silver and bronze.\n\n“I really thought I was done and I can’t be upset with this bronze,” said Kalisz, who took gold when Budapest previously hosted the worlds in 2017.\n\nBritain’s Benjamin Proud was 0.03 seconds faster than Dressel and Italy’s Thomas Ceccon in the semifinals of the men’s 50 butterfly. The final is on Sunday.\n\nAmerican Torri Huske was quickest in the women’s 100 butterfly semifinals, and Alex Walsh led an American 1-2 with Leah Hayes ahead of Australia’s Kaylee McKeown and Canada’s Mary-Sophie Harvey in the semifinals of the women’s 200 medley.\n\nThere were huge cheers for any Hungarian swimmers from spectators at Duna Arena. FINA, the sport’s governing body, appealed for fans to clap rather than cheer as a precaution against coronavirus infections. There were no other requests or restrictions.\n\nBudapest stepped in to host the event after it was twice postponed from its original dates in Fukuoka, Japan due to a clash with the Tokyo Olympics last year, then due to the pandemic this year."}, {"url": "https://www.espn.com/olympics/story/_/id/34112696/katie-ledecky-reclaims-women-400-meters-title-swimming-world-championships", "page_content": "BUDAPEST, Hungary -- Katie Ledecky has started the United States' medal collection at the world swimming championships with a gold by reclaiming her title in the women's 400 meters.\n\nLedecky clocked 3 minutes, 58.15 seconds on the first day of racing Saturday for her fourth world title in the 400 freestyle after 2013, 2015 and 2017.\n\nAriarne Titmus pipped Ledecky to the title in 2019 and took her world record last month but the Australian has skipped the worlds in Budapest to focus on the Commonwealth Games next month in England.\n\nCanada's 15-year-old Summer McIntosh finished 1.24 seconds behind Ledecky for the silver. Both were well ahead of the competition, with American Leah Smith 3.93 behind Ledecky in third and Australia's Lani Pallister finishing fourth.\n\nAustralia's Elijah Winnington took the first gold of the evening when he powered home in the final length of the men's 400 meters to overtake Germany's Lukas Martens. Winnington clocked 3 minutes, 41.22 seconds, a personal best and the third fastest time at a worlds.\n\n\"I try to keep up with the Australian guy but in the end he swam away,\" said Martens, who finished 1.63 seconds behind.\n\nBrazil's Guilherme Costa was third.\n\nNone of the medalists from 2019 raced. Sun Yang of China is banned for a doping infringement, Australia's Mack Horton -- the 2016 Olympic champion -- failed to qualify by 0.10 seconds, and Gabriele Detti did not enter.\n\nBritain's Benjamin Proud was 0.03 seconds faster than American star Caeleb Dressel and Italy's Thomas Ceccon in the semifinals of the men's 50 butterfly. The final is on Sunday.\n\nAmerican Torri Huske was quickest in the women's 100 butterfly semifinals\n\nMore finals including relays were scheduled for later Saturday."}, {"url": "https://www.npr.org/sections/tokyo-olympics-live-updates/2021/07/27/1021542376/katie-ledecky-wins-her-first-gold-of-the-tokyo-olympics", "page_content": "Katie Ledecky Wins Her 1st Gold In Tokyo And Reflects On The Pressure Athletes Face\n\nEnlarge this image toggle caption Matthias Schrader/AP Matthias Schrader/AP\n\nTOKYO — Katie Ledecky has won her first gold of the Tokyo Olympics, in the 1,500 meter freestyle race. She took silver in her first race of the Games, and then missed out on medaling in the 200 meter freestyle.\n\nAfter the race, she talked about the immense pressure she feels to meet the sky-high expectations on her — and the pressure she places on herself. Other stars such as Simone Biles and Naomi Osaka are opening up about the difficulties of being in the spotlight.\n\n\"I am always striving to be my best and to be better than I've ever been, and it's not easy when your times are world records in some events,\" Ledecky told reporters after her race. She holds world records in three freestyle distances: 400 meters, 800 meters and 1,500 meters.\n\nIn the 1,500 meter final – the first time this event has been held at the Olympics – Ledecky dominated. The long-distance swim is nearly a mile, and Ledecky was in the lead for the entire time.\n\nShe smacked the water down in celebration at the end of the arduous 15 minute swim, and hugged her teammate Erica Sullivan, who took silver.\n\nVictory after a mixed start to the Olympics\n\nThe biggest star of U.S. swimming has not had the start to these Olympics that she wanted.\n\nIn her first race, the 400 meter freestyle, she was narrowly edged out of gold by her chief rival, Australian swimmer Ariarne Titmus.\n\nTitmus beat her again on Wednesday morning Tokyo time in the 200 meter freestyle. Ledecky did not make it to the podium in that race, placing fifth. For the first time in her Olympic career, she did not win a medal.\n\n\"I don't want anyone to feel sorry for me, or feel like silver or any other medal besides gold is a disappointment or anything. I would much rather people be concerned about people who are really, truly struggling in life,\" Ledecky said. \"Just because I've won golds all the time leading into that doesn't mean the silver doesn't mean something to me.\"\n\nShe said that over the years, she has experienced the power of the gold medal in the way people react to them.\n\n\"I've gone to children's hospitals, and met wounded warriors, and their faces light up when they see the gold medal. And that means more to me than anything — the ability to put a smile on someone's face,\" Ledecky said, her voice breaking with emotion.\n\n\"I just really wanted to get a gold medal to have that opportunity again.\"\n\nLedecky supports Biles and athletes taking care of their mental health\n\nLedecky said she knows the pressure of having the world's attention on her, after U.S. star gymnast Simone Biles suddenly pulled out of the team gymnastics final on Tuesday to focus on her mental health.\n\n\"I would never want to speak for Simone or say I know what she's feeling, because none of us do,\" she said. \"But I understand it. We're at the highest level, we have the most eyes on us,\" Ledecky added, speaking about all Olympians.\n\nShe said she hopes Biles continues to do what's best for her, with the support of her teammates and coaches. \"Mental health is so important, physical health is so important, and it's no different being Olympians.\""}, {"url": "https://apnews.com/article/972b58ff20a84889acbab4e59622f2f3", "page_content": "GOLD COAST, Australia (AP) — Katie Ledecky lowered her own world record in the women’s 400-meter freestyle to win the Pan Pacific championships title in 3 minutes, 58.37 seconds on Saturday.\n\nLedecky was under world-record pace for much of the race in an outdoor pool at the Gold Coast Aquatic Centre and finished strongly to shave almost a half-second off the mark of 3:58.86 she set at the U.S. nationals on Aug. 14.\n\nThe 17-year-old Ledecky also holds the world records in the 800 and 1,500 freestyle events, and narrowly missed improving her mark in the 800 earlier at the Pan Pacs.\n\n“It’s a great feeling. It never really gets old,” Ledecky said of her run of records. “I have some long-term goals. We’re not quite there yet, but we’ll get there.”\n\nIt was her fourth gold medal of the meet, following her titles in the 200, 800 and the 4x200-meter relay.\n\nPersistent rain has overshadowed the meet since the opening day but it wasn’t raining Saturday night during the 400 — not that it would have bothered Ledecky.\n\n“It was beautiful out there tonight. I’m not really affected by the rain or anything,” she said. “there’s no rain under water, so it doesn’t really bother me.”\n\nLedecky won the 800 meters at the London Olympics and added gold medals in the 400, 800 and 1,500 at last year’s world championships, where she also lowered the world records over the two longer distance events.\n\nHer swim on Saturday gave her another first — for a world record in the new pool that will be used for the 2018 Commonwealth Games.\n\n“Oh yeah, I didn’t even think about that. I guess that is pretty neat,” she said. “It’s a nice pool. I’m loving it here in Australia — it’s been a fun week.”"}, {"url": "https://www.espn.com/olympics/story/_/id/17242699/katie-ledecky-sets-world-record-400-meter-freestyle-final", "page_content": "RIO DE JANEIRO -- Katie Ledecky was racing nothing but the clock.\n\nIt was no contest.\n\nThe unassuming teenager from suburban Washington gave the United States its first swimming gold medal of the Rio Olympics on Sunday night, crushing her own world record in the women's 400-meter freestyle.\n\nThe result was totally expected. Ledecky has dominated the longer freestyle events since winning gold in the 800 free at the London Olympics as a 15-year-old.\n\nThe only drama was whether she'd take the world record even lower.\n\nHer powerful stroke quickly made that a moot point, too.\n\nKatie Ledecky broke her own world record en route to winning gold in Saturday's 400-meter freestyle final. Rob Schumacher/USA TODAY Sports\n\nLedecky kicked off the first wall with a lead of nearly a body length and steadily pulled away from the overmatched field -- as well as the world-record line superimposed on the video screen.\n\nHer arms churning effortlessly through the water, Ledecky touched nearly five seconds ahead of her closest pursuer and quickly whipped around to look at the scoreboard.\n\nWhen Ledecky saw the time -- 3 minutes, 56.46 seconds -- she let out an uncharacteristic scream and shook her right fist. She crushed the mark of 3:58.37 that she set nearly two years ago on the Gold Coast of Australia, and had been chasing ever since.\n\n\"I was pumped,\" Ledecky said. \"That's what I wanted and I had been so close to breaking that all year, the past two years. I knew I was due for a breakthrough.\"\n\nIt was a night of world records at the Olympic Aquatics Center. Britain's Adam Peaty set his second mark in as many nights in the 100 breaststroke, while Sarah Sjostrom of Sweden eclipsed her own mark in the 100 butterfly.\n\nMichael Phelps, the most decorated athlete in Olympic history, added a 19th gold medal to his staggering haul as the United States won the men's 4x100-meter freestyle relay with Phelps swimming the second leg.\n\nAfter the powerful U.S. team was shut out Saturday and through the first two events Sunday, Ledecky was the first to get the Americans on the top step of the podium.\n\nShe's just getting warmed up.\n\nLedecky, who added gold to the silver she won in the women's 4x100 free relay, is also favored in two other individual events: the 200 and 800 free. In addition, she could pick up another gold in the 4x200 free relay.\n\nBritain's Adam Peaty was nearly as dominant in the breaststroke, winning with a world record time of 57.13 that shattered the mark of 57.55 he set in the preliminaries.\n\nPeaty cruised away from Cameron van der Burgh of South Africa, the defending Olympic champion taking silver this time in 58.69. The bronze went to Cody Miller of the United States, whose time of 58.87 held off teammate Kevin Cordes.\n\nThe crowd went into frenzy at the sight of two Brazilians in the final. But Joao Gomes finished fifth and Felipe Franca was seventh.\n\nSweden's Sarah Sjostrom led right from the start of the 100 butterfly and touched in 55.48, knocking off the world record mark of 55.64 she established at last year's world championships. She sat on the edge of the deck, pumping her arms in the air, and then appeared to be overcome by tears as she climbed to her feet.\n\nThis was her first Olympic medal. Sjostrom finished fourth in the 100 fly at the London Games four years ago, missing out on the bronze by just 23-hundredths of a second.\n\nPenny Oleksiak of Canada took the silver in 56.46, edging out defending Olympic champion Dana Vollmer. The American, who had her first child 17 months ago, settled for the bronze in 56.63.\n\nAlready, six world records have been set in Rio.\n\nInformation from The Associated Press was used in this report."}, {"url": "https://www.huffpost.com/entry/katie-ledecky-400-meter-freestyle-record_n_57a5f7cbe4b03ba6801284da", "page_content": "Katie Ledecky of the United States competes in the Women's 400m Freestyle heat on Day 2 of the Rio 2016 Olympic Games. Adam Pretty via Getty Images\n\nKatie Ledecky surprised nobody on Sunday when she once again did something we’ve never seen before.\n\nThe 19-year-old Olympic swimmer ― hailed as one of the greatest athletes alive ― absolutely destroyed the world record for the women’s 400 meter freestyle with a time of 3:56.46. The previous record was 3:58.37, which she set in 2014. Ledecky finished almost 5 seconds ahead of her closest competitor, and stayed more than a second ahead of her own record nearly the entire swim.\n\nAdvertisement\n\nLedecky was a relative unknown when, at the age of 15, she tore up the women’s 800-meter freestyle at the 2012 London Olympics and won gold. Today, she’s the dominant swimmer on the planet and the favorite to sweep her heats and win gold in the 800-meter freestyle on Aug. 11 by as many as 10 seconds.\n\nKatie Ledecky of the United States celebrates winning her Women's 400m Freestyle heat on Day 2 of the Rio 2016 Olympic Games. Julian Finney via Getty Images\n\nIt isn’t easy stepping out of the shadow of Michael Phelps, the most decorated Olympian of all time. Then again, it isn’t easy to earn this type of praise from a champion before your second run at the Olympics, either:\n\n“Katie Ledecky is the greatest athlete in the world today, any sport, either gender,” said Gary Hall, Jr., who’s won five gold medals in swimming. “Having the top 11 times in the world in an event is just unheard of. Michael Phelps doesn’t have the top 11 times in the world.”\n\nAdvertisement\n\nIndeed, Ledecky probably won’t be racing against other people this week ― instead, she’ll be battling her own 11 world records. She holds records in 400-meter, 800-meter and 1500-meter freestyle, and has never lost a final in a major international event, Slate reports.\n\nOn Sunday, she was looking to beat her previous time in the 400 free of 3:58.37, set in 2014. But in training, she turned her eyes toward categories in which she hadn’t previously dominated, namely the 200.\n\n“I wanted to swim more than just the 800 free,” she told The Washington Post. “So we started working on speed and trying to get better at the 400 and 200 over that year, and I think as I started to drop time I kind of realized, ‘Yeah I can be a player in all those events on the international stage.’ And each year, I’ve just tried to set myself up for this year. This is the year we’ve been working toward for a couple of years now.”\n\nIf she wins all three categories at the Olympics ― the 200, 400 and 800-meter freestyle ― she’ll be one of two women to sweep all three in a single competition. Debbie Meyer did it in 1968."}, {"url": "https://www.cbsnews.com/news/katie-ledecky-world-record-1500-meter-freestyle-it-hurt-a-lot/", "page_content": "Katie Ledecky is having a great time in her first competitive event of the season at the FINA Swimming World Cup. The star American swimmer set a world record in the 1,500-meter freestyle on Saturday night at the Toronto Pan Am Sports Centre.\n\n\"I knew that record was within reach just based on some things I've done in training, especially my distance stuff (as it) has felt really good this fall,\" Ledecky said. \"So I felt locked into the pace.\"\n\nThe 10-time Olympic medalist — who doesn't compete in short-course events very often — finished in 15:08.24, taking nearly 10 seconds off the previous record set by Germany's Sarah Wellbrock (15:18.01) in 2019.\n\nKatie Ledecky of the United States of America celebrates after she wins the 1,500-meter freestyle in world-record time at the World Cup short course swimming finals at the Pan Am Sports Centre in Toronto, October 29, 2022. Steve Russell/Toronto Star via Getty Images\n\nCanada's Summer McIntosh, who also set a world junior mark when she edged Ledecky in the 400 free on Friday, finished first in the 400 medley in 4:21.49 to lead a Canadian sweep.\n\n\"Throughout the entire race I felt really in control and strong so I'm really happy,\" she said.\n\nSydney Pickrem was second in 4:28.45, and Bailey Andison was third in 4:29.36.\n\nMcIntosh, a 16-year-old from Toronto, trimmed nearly two seconds off the previous world junior mark set by China's Shiwen Ye (4:23.33) in 2012.\n\nLedecky, a Maryland native, took gold ahead of Beatriz Dizotti of Brazil (15:48.82) and Laila Oravsky of Canada, who was third in 16:16.86.\n\n\"It's just so unreal to be a part of something so amazing,\" Oravsky said. \"That was the fastest 1,500 that was just swum and I was a part of that. It's crazy.\"\n\nMaggie Mac Neil of Canada improved her national record in the women's 50-meter butterfly, finishing first in 24.75 seconds. American Beata Nelson won the women's 100 backstroke, and Shaine Casas of the U.S. finished first in the men's 200-meter medley.\n\nOne of the biggest roars from the near-capacity crowd came at Ledecky's finish. She splashed the water after looking up at the scoreboard to see her world-record time.\n\n\"Honestly most of that emotion was just because it hurt a lot,\" she said. \"When something hurts that much, you want to see a great result like that. It was just mostly happiness. I felt good and I was very pleased with the outcome.\"\n\nShe returned to the pool a short time later for the 200 free and took silver in 1:52.31 behind Hong Kong's Siobhan Bernadette Haughey.\n\n\"I didn't have any super type of preparation for this meet,\" Ledecky said. \"I just wanted to come in and race some international swimmers. These meets (Toronto and next week in Indianapolis) are on North American soil so I just had fun with it.\"\n\nLedecky's feat comes a little more than a year after she claimed the first-ever gold medal in the women's 1,500-meter freestyle at the Tokyo Olympics.\n\n\"I just tried to enjoy it and soak in every moment,\" she told \"CBS Mornings\" co-host Gayle King after the Olympics.\n\nLedecky said she's already looking forward to the next Summer Games.\n\n\"I really hope I have the opportunity to represent Team USA in Paris,\" she said. \"… I'll be back with some new goals for 2024.\""}, {"url": "https://slate.com/culture/2016/08/katie-ledecky-broke-the-world-record-in-the-400-meter-freestyle-at-the-2016-olympics.html", "page_content": "Though eight swimmers dove into the pool at the start of the women’s 400-meter freestyle final on Sunday night, seven of them might as well have stayed home, for all the chance they ever had of winning. Katie Ledecky, the 19-year-old American who has justly become the face (and arms and legs and shoulders) of the Rio Games, smashed her own world record in the event, finishing in 3:56:46—almost five seconds ahead of the field. “Katie Ledecky looks like she is poised to not only win Olympic gold, but lower her own world record,” said NBC’s Dan Hicks at the outset of the race. A few seconds later, realizing he may have understated the spread between Ledecky and every other swimmer in the pool, he added: “It’s all about Ledecky, how fast she will go, because it’s a foregone conclusion she’s gonna win this race.” When she touched the wall, her entire body was ahead of the on-screen world-record line. Ledecky didn’t beat the world record. She kicked the world record.\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nLedecky didn’t win the race so much as vanquish it. And it was never, ever a race. At the 100-meter mark, she was a full body length and 1.53 seconds ahead of her closest competitor. As the race proceeded, the gap between Ledecky and her sort-of-peers grew wider, as the American teenager made some of the best swimmers in the world look like a bunch of suburbanites at an aqua aerobics class. NBC color man Rowdy Gaines got so excited during the final 50 meters that I thought he might fall into the pool: “Ahh, she may be like a rock climber, but speeded up times 10. She looks like a bird taking off the water now! Still ahead of that world record by a full second! She’s going to break it!”\n\nAdvertisement\n\nHow big was the gap between Ledecky and Great Britain’s Jazz Carlin? Hicks had enough time to utter 24 syllables—“And everybody in this arena doing the same as Katie Ledecky smashes her own …”—between when Ledecky touched the wall and Carlin touched for silver. That pretty much captures it: Ledecky broke the world record in the 400-meter freestyle by 24 syllables.\n\nAdvertisement\n\nLedecky’s dominance is wondrous and thoroughly intimidating. As Hicks noted, she has set three world records in the 400-meter freestyle and 12 world records total in the past four years. She came into the race having set a new Olympic record of 3:58.71 in Sunday afternoon’s qualifying heats, finishing a mere 0.34 seconds off world-record pace. After winning the Olympic final, Ledecky didn’t even look tired. Instead, she offered a wide smile in an interview with NBC’s Michele Tafoya as she acknowledged that she fully expected to beat the record. “I was really confident,” she said. “The 3:58 this morning felt really easy, and I knew if I could just push the back half really hard, I could … I could make it happen tonight.”\n\nMake it happen. That’s another understatement.\n\nSee more of Slate’s Olympics coverage."}, {"url": "https://www.espn.com/olympics/swimming/story/_/id/11396849/katie-ledecky-breaks-women-400-meter-freestyle-world-record", "page_content": "GOLD COAST, Australia -- Katie Ledecky lowered her own world record in the women's 400-meter freestyle to win the Pan Pacific championships title in 3 minutes, 58.37 seconds on Saturday.\n\nLedecky was under world-record pace for much of the race in an outdoor pool at the Gold Coast Aquatic Centre and finished strongly to shave almost a half-second off the mark of 3:58.86 she set at the U.S. nationals on Aug. 14.\n\nKatie Ledecky, 17, broke her own world record in the women's 400-meter freestyle Saturday, saying \"it never really gets old.\" Patrick Hamilton/AFP/Getty Images\n\nThe 17-year-old Ledecky also holds the world records in the 800 and 1,500 freestyle events, and narrowly missed improving her mark in the 800 earlier at the Pan Pacs.\n\n\"It's a great feeling. It never really gets old,\" Ledecky said of her run of records. \"I have some long-term goals. We're not quite there yet, but we'll get there.\"\n\nIt was her fourth gold medal of the meet, following her titles in the 200, 800 and the 4x200-meter relay.\n\nPersistent rain has overshadowed the meet since the opening day but it wasn't raining Saturday night during the 400 -- not that it would have bothered Ledecky.\n\n\"It was beautiful out there tonight. I'm not really affected by the rain or anything,\" she said. \"There's no rain under water, so it doesn't really bother me.\"\n\nLedecky won the 800 meters at the London Olympics and added gold medals in the 400, 800 and 1,500 at last year's world championships, where she also lowered the world records over the two longer distance events.\n\nHer swim on Saturday gave her another first -- for a world record in the new pool that will be used for the 2018 Commonwealth Games.\n\n\"Oh yeah, I didn't even think about that. I guess that is pretty neat,\" she said. \"It's a nice pool. I'm loving it here in Australia -- it's been a fun week.\""}, {"url": "https://www.espn.com/olympics/swimming/story/_/id/11332987/", "page_content": "IRVINE, Calif. -- Katie Ledecky broke the world record in the 400-meter freestyle at the U.S. national championships Saturday night, impressing a downtrodden Michael Phelps, who lost for the third time this week.\n\nLedecky, a 17-year-old from Bethesda, Maryland, won in 3 minutes, 58.86 seconds, becoming the first woman since Janet Evans to hold world marks in the 400, 800 and 1,500 freestyles at the same time.\n\n\"That is some serious speed,\" marveled Phelps, the most decorated Olympian in history.\n\nKatie Ledecky, 17, is the first woman since Janet Evans to own world marks in the 400, 800 and 1,500 freestyles at the same time. AP Photo/Mark J. Terrill\n\nLedecky bettered the old mark of 3:59.15 set by Italy's Federica Pellegrini at the 2009 world championships in Rome, when a raft of records were broken during the apex of the high-tech suit era. Those suits were banned the following year, making world records harder to achieve.\n\nPhelps had another bummer of a night, finishing sixth in the 100 backstroke behind Olympic champion Matt Grevers, who won in 52.75 seconds.\n\nPhelps was seventh at the turn and touched in 53.95.\n\n\"I hate this,\" he groused. \"Anything to be able to change this.\"\n\nPhelps' only good bit of news was that he officially qualified to swim in the Pan Pacific Championships this month in Australia by virtue of his earlier second-place finish in the 100 butterfly. He was seventh in the 100 free, having launched his comeback four months ago.\n\n\"I'm not going to use the excuse of taking off a year and a half to two years,\" he said. \"When there are workouts I need to be at every one and that's the bottom line.\"\n\nLedecky's hard work was evident.\n\nShe went under world-record pace the entire race, dropping a whopping 1.71 seconds under at 250 meters. With one lap to go, she was still 1.53 seconds under.\n\n\"Just tried to make sure I didn't rush the first 100,\" she said. \"It was probably pretty close to perfect.\"\n\nAfter hitting the wall, the normally reserved Ledecky pounded the water and smiled broadly as the crowd cheered.\n\nLedecky swam the third-fastest time ever in the morning preliminaries, clocking 3:59.82.\n\n\"I thought it was going to be really tough to get under four minutes twice,\" Phelps said. \"It's good seeing somebody who's hungry and somebody who wants it like her. She puts it all out there and she does the work.\"\n\nAs he walked off, the 29-year-old Phelps joked, \"Old man gets more tired easily.\"\n\nBruce Gemmell, Ledecky's coach, said, \"He probably forgot that when he was 17 years old he could do the same thing.\"\n\nLedecky joined Pellegrini as the only women to break 4 minutes in the event, with the American dipping under that barrier three times now.\n\n\"It was on my mind, but I didn't let it overtake me today and I think that's something that definitely helped,\" Ledecky said. \"I was very relaxed.\"\n\nEvans owned all three women's distance freestyle world records from 1988 to 2006.\n\n\"It means a lot. It's an honor to be mentioned in the same sentence as Janet,\" Ledecky said. \"She's a great person and a really great role model for all U.S. distance swimmers.\"\n\nLedecky lowered her own world marks in the 800 and 1,500 freestyles three days apart in June at a meet in Texas. The Olympic 800 free champion has amazing versatility, with the ability to swim distances ranging from 200 to 1,500 meters.\n\nIt was Ledecky's third win of the meet, having earlier claimed the 200 and 800 freestyles. She earned the chance to swim all three events at Pan Pacs. She will be a high school senior this fall, and later plans to attend Stanford.\n\nCierra Runge finished second in 4:04.67, and Leah Smith was third at 4:06.28.\n\nMichael McBroom won the men's 400 free in 3:47.19. He was in the ready room awaiting his final when Ledecky electrified the crowd.\n\n\"We were talking in there, `Oh man, she might beat some of us,\" he said.\n\nMissy Franklin powered through the final lap to win the 100 backstroke in 59.38, the world's third-fastest time. She was the only woman to break 1 minute in the race and added her third title of the meet.\n\n\"I knew the rest of the field was going to be out really fast, so I knew I had to bring it home strong,\" she said.\n\nRachel Bootsma was second at 1:00.71 and Elizabeth Pelton took third in 1:00.76, giving California swimmers a sweep of the top three spots.\n\nOlympians Jessica Hardy and Micah Lawrence tied for first in the 100 breaststroke at 1:06.51, sixth-quickest in the world this year. Hardy earlier won the non-Olympic 50 breast event, in which Lawrence was third, and Lawrence took the 200 breast title.\n\nCody Miller earned a trip Down Under by winning the men's 100 breast in 59.91, the only man to break 1 minute in the final. His time tied for ninth-quickest in the world."}]}