{"Katie Ledecky's birth date is March 17, 1997.": [{"url": "https://www.biography.com/athletes/katie-ledecky", "page_content": "(1997-)\n\nWho Is Katie Ledecky?\n\nBorn in Maryland in 1997, Katie Ledecky began swimming competitively at age six. After earning a berth on the U.S. Olympic team at age 15, she set an American record in the 800-meter freestyle to win a gold medal at the 2012 Summer Games. Ledecky has since shattered world records across an array of freestyle events ranging from 400 to 1,500 meters. At the 2016 Olympic Games in Rio, she dominated the pool, winning gold medals in the 400-meter freestyle in world record time, the 200-meter freestyle and the 4x200 meter freestyle relay, and silver in the 4x100 meter freestyle relay. She also broke the world record, winning gold in the 800-meter freestyle.\n\nEarly Years and Competitive Career\n\nKathleen Genevieve \"Katie\" Ledecky was born on March 17, 1997, in Bethesda, Maryland. The second child of David, a lawyer, and Mary Gen, a former collegiate swimmer and hospital administrator, she began swimming competitively at the Palisades Swim & Tennis Club at age six, alongside her older brother, Michael.\n\nWith her seemingly insatiable appetite for pool activity, Ledecky became a standout at the Nation’s Capital Swim Club under coach Yuri Suguiyama. In 2011, Suguiyama began instructing Ledecky to kick more aggressively while racing, a technique commonly used by elite men's swimmers but rarely seen on the women's side. That summer, before the start of her freshman year at Stone Ridge School of the Sacred Heart, she dominated the U.S. Junior Championships with wins in the 400-, 800- and 1,500- meter freestyle events.\n\n2012 London Olympics Breakout Star\n\nLedecky made her senior debut at the 2012 United States Olympic Trials, entering the 200-, 400- and 800-meter freestyles. The lack of top-level experience proved to be no obstacle for the 15-year-old, who surged to an eye-opening win in the 800m to become the youngest member of the U.S. team.\n\nHer momentum continued through the competition at the 2012 London Games, where Ledecky paced her heat in the 800m. She then blew the competition out of the water in the final, breaking Janet Evans's 23-year-old American record with a time of 8:14.63 to win the gold medal.\n\nAfterward, Ledecky displayed the easy confidence of someone who expected to win. “I knew if I put my mind to it, I could do it,” she said. “I wasn’t intimidated at all.”\n\nContinued Swimming Success\n\nUnder the guidance of new coach Bruce Gemmell, Ledecky showed that her 2012 Olympic performance was merely the tip of the iceberg. Proving capable of winning both middle- and long-distance events, she established world records in the 800- and 1,500-meter freestyles en route to four gold medals at the 2013 FINA World Championships. She claimed another four golds at the 2014 Pan Pacific Swimming Championships, and at the 2015 FINA World Championships, she became the first woman to win the 200- 400- 800- and 1500-meter freestyles in a major competition. Her victories often coming via huge margins, Ledecky has been honored as the FINA Swimmer of the Year, the USOC's Olympic SportsWoman of the Year and a three-time Golden Goggle Female Athlete of the Year.\n\nThe champion swimmer was accepted to Stanford University prior to her graduation from Stone Ridge in 2015, but she elected to defer enrollment to focus on training for the 2016 Summer Olympics. Proving to be in peak form well before the start of Olympic competition, she set her 11th world record with a time of 8:06.68 in the 800m free at the Arena Pro Swim Series in January 2016.\n\nAdditionally, Ledecky headed into the summer as the world-record holder in the 400- and 1,500-meter freestyles. Unbeaten in all major international competition, she was expected to add to her already impressive gold medal count and become one of the American team's most celebrated Olympians by the close of the 2016 Rio Games.\n\n2016 Rio Olympic Games\n\nLedecky did not disappoint in Rio. In her first individual event, the women's 400-meter freestyle, she won gold, soaring past the competition early on and finishing with a time that was two seconds better than her own world record and four seconds more than her second place finisher. She also helped her teammates win silver in the Women's 4x100 meter freestyle relay. She went on to win gold again in the 200-meter freestyle race, edging out Swedish swimmer Sarah Sjostrom, who won silver. After the grueling race, Ledecky spoke about finding the strength to grab the gold. “I did come pretty close to throwing up during that last 50,” Ledecky said. “I knew I just needed to get my hand on the wall and be done. Everything was hurting . . .I just had to dig deep and do my own thing. I had no idea whether I touched first . . .I was done when I touched the wall. I knew I’d given it everything I had to.\n\nShe continued to dominate as the anchor in the 4x200 meter freestyle relay, winning the gold medal with teammates Allison Schmitt, Leah Smith and Maya Dirado. She also defended her 2012 world title in the 800-meter individual freestyle in a stunning victory, finishing the race at 8:04:79 and smashing the world record. With this gold win, Ledecky became the second woman to win three individual freestyle events at a single Olympic Games, a feat also accomplished by Debbie Meyer at the 1968 Olympics in Mexico City.\n\n2021 Tokyo Olympics\n\nLedecky will compete at the 2021 Tokyo Olympics, swimming in the 200-meter freestyle, 400-meter freestyle, 800-meter freestyle and 1,500-meter freestyle, as well as the 4×200-meter freestyle relay.\n\nQUICK FACTS\n\nName: Katie\n\nBirth Year: 1997\n\nBirth date: March 17, 1997\n\nBirth State: Maryland\n\nBirth City: Bethesda\n\nBirth Country: United States\n\nGender: Female\n\nBest Known For: American swimmer Katie Ledecky won a gold medal at the 2012 Olympics before shattering numerous world records. She continued her winning streak at the 2016 Summer Olympics, earning four gold medals and one silver medal.\n\nIndustries\n\nSports\n\nAstrological Sign: Pisces\n\nSchools\n\nGeorgetown University\n\n\n\nStandford University\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Katie Ledecky Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/athlete/katie-ledecky\n\nAccess Date:\n\nPublisher: A&E Television Networks\n\nLast Updated: July 22, 2021\n\nOriginal Published Date: July 1, 2016\n\nQUOTES"}, {"url": "https://www.famousbirthdays.com/people/katie-ledecky.html", "page_content": "About\n\nFreestyle swimmer who won the 800m gold at the 2012 London Olympics before the age of 15, with the second fastest performance ever.\n\nBefore Fame\n\nShe learned to swim at age 6 and eventually joined the Nation's Capital Swim Club.\n\nTrivia\n\nShe broke the national record for the 800 meter freestyle at the 2012 London games.\n\nFamily Life\n\nShe has an older brother named Michael, who is also a swimmer.\n\nAssociated With\n\nShe, like Michael Phelps, won a gold medal for the United States at the 2012 London Olympics."}, {"url": "https://www.sportskeeda.com/player/katie-ledecky", "page_content": "Katie Ledecky: A Brief Biography\n\nKatie Ledecky is an American female swimmer born on 17th March 1997. She hails from Bethesda in Maryland, United States. Katie specializes in Freestyle and represents the USA in 200m, 400m, and 800m Freestyles.\n\n\n\n\n\nBackground :\n\n\n\n\n\nKatie Ledecky was born to David Ledecky and Mary Hagan. Her father is of Czech descent, whereas her mother is of Irish descent. Her mother and older brother, Michael Ledecky, competed for the University of Mexico in swimming.\n\n\n\n\n\nKatie took up swimming at the young age of 6. She attended the Little Flower School till 8th grade and then moved to Stone Ridge School of the Sacred Heart, where she completed her high school education. While at high school, she shattered the national high school record twice in 200m Freestyle.\n\n\n\n\n\nIn 2015, after graduating from high school, Katie joined Stanford University on an athletic scholarship, where she became a member of the Stanford Cardinal swimming team and trained under Greg Meehan. She had represented them at the NCAA Division 1 Swimming Championships.\n\n\n\n\n\nIn 2020, Katie Ledecky graduated from Stanford University with a BA degree in Psychology. She currently trains with Nation’s Capital Swim Club and coaches Greg Meehan and Bruce Gemmell.\n\n\n\n\n\nRise to Glory :\n\n\n\n\n\nAfter her success at high school swimming, Katie Ledekcy began to take a stride in her career by participating in the 2012 US Olympics trials, where she won 800m Freestyle and finished 3rd in 400m Freestyle and qualified for the London Olympics.\n\n\n\n\n\nIn 2013, Katie clinched the three titles in 400m, 800m, and 1500m Freestyles and a Silver medal in 200m Freestyle at the USA National Swimming Championships. The following year, she defended her national titles in 400m and 800m Freestyles and also won the 200m Freestyle title. Katie has 16 national titles in 800m Freestyle (6), 400m Freestyle (5), 200m Freestyle (4), and 1500m Freestyle (1) under her belt.\n\n\n\n\n\nAt the 2017 NCAA Division 1 Women’s Swimming Championships, Katie clinched five titles in 200y, 500y, 1650y Freestyles, 4x400y Freestyle, and 4x800y Freestyle. The following year, she defended her NCAA titles in 500y, 1650y Freestyles, and 4x800y Freestyle.\n\n\n\n\n\nKatie Ledekcy holds world records in 400m, 800m, and 1500m Freestyles.\n\n\n\n\n\nMajor Achievements :\n\n\n\n\n\nKatie Ledecky made her international debut at the 2012 London Olympics, where she won the Gold medal in 800m Freestyle. In 2013, she clinched four titles in 400m, 800, 1500m Freestyles, and 4x200m Freestyle at the World Aquatics Championships. The following year, Katie bagged five Gold medals in 200m, 400m, 800m, 1500m Freestyles, and 4x200m Freestyle at the Pan Pacific Championships.\n\n\n\n\n\nKatie had defended her World Aquatics titles twice in 400m, 1500m Freestyles and 4x200m Freestyle (2015 and 2017), and thrice in 800m Freestyle (2015, 2017, and 2019). She had also won a title in 4x100m Freestyle (2017), and three Silver medals in 200m Freestyle (2017), 400m Freestyle, and 4x200m Freestyle (2019) at the World Aquatics Championships\n\n\n\n\n\nAt the 2016 Rio Olympics, Katie swept four Gold medals in 200m, 400m, 800m Freestyles and 4x200m Freestyle, and a Silver in 4x100m Freestyle. In 2018, she defended her Gold medals in 400m, 800m, and 1500m Freestyles and also won a Silver medal in 4x200m Freestyle and a Bronze in 200m Freestyle.\n\n\n\n\n\nKatie Ledecky is eyeing to qualify for the 2021 Tokyo Olympics via US Olympic Trials and will look to defend her Olympic titles in 200m, 400m, and 800m Freestyles."}, {"url": "https://ethnicelebs.com/katie-ledecky", "page_content": "Birth Name: Kathleen Genevieve Ledecky\n\nPlace of Birth: Washington, D.C., U.S.\n\nDate of Birth: March 17, 1997\n\nEthnicity:\n\n*father – Czech, Ashkenazi Jewish\n\n*mother – Irish\n\nKatie Ledecky is an American competition swimmer. She has won five Olympic gold medals and 15 world championships. She is the daughter of Mary Gen and David Ledecky. Her father is of half Czech and half Ashkenazi Jewish descent. Her mother is of Irish ancestry. Katie was raised Catholic.\n\nKatie’s uncle is businessperson Jon Ledecky, who co-owns NHL team New York Islanders and their AHL affiliate Bridgeport Sound Tigers.\n\nKatie’s mother swam at the University of New Mexico, while Katie’s maternal grandfather was a decorated combat surgeon in World War II.\n\nKatie’s paternal grandfather was Jaromir “Jerry” Ledecky (the son of Jaroslav Ledecky and Jarmila Horčičková). Jaromir was born in Prague, Czechoslovakia. He came to the U.S. in 1947. Jaroslav was the son of Josef Ledecky and Anna Rebcová.\n\nKatie’s paternal grandmother is Berta Ruth Greenwald (the daughter of Milton Henry Greenwald and Eleanor Tecla Stoll). Berta was born in New York City, New York. She lost relatives in the Holocaust. Milton was born in New York, the son of Simon Greenwald and Bertha Deutsch, who were Hungarian Jews. Eleanor was born in New York, the daughter of Karl A. “Charles” Stoll, who was Swiss, of part German descent, and possibly not of Jewish background; and of Babette “Bertha” Wyler, who was a Swiss Jew, with partly German Jewish, French Jewish, and Alsatian Jewish ancestors. Charles and Bertha married in New York.\n\nKatie’s maternal grandfather was Edward Jordan Hagan (the son of Edward Jordan Hagan and Joan Garvey). Katie’s grandfather Edward was born in North Dakota, to Canadian parents, from Ontario. Katie’s great-grandfather Edward was the son of James Hagan, who was Irish, and of Anne Jordan. Joan was the daughter of Patrick J. Garvey and Mary Heffernan.\n\nKatie’s maternal grandmother is Kathleen Frances O’Connor (the daughter of Charles O’Connor and Mary Ellen Buckley). Kathleen was born in Montana, and is of Irish origin. Charles was the son of Daniel O’Connor and Mary MacDonald. Katie’s great-grandmother Mary Ellen was the daughter of John M. Buckley and Mary Maloney.\n\nSources: https://www.timesofisrael.com\n\nhttps://www.washingtonpost.com\n\nhttp://www.si.com\n\nGenealogy of Katie Ledecky – https://www.geni.com\n\nMarriage record of Katie’s paternal great-grandparents, Milton Henry Greenwald and Eleanor Tecla Stoll – https://www.familysearch.org\n\nMarriage record of Katie’s paternal great-great-grandparents, Karl A. “Charles” Stoll and Babette “Bertha” Wyler – https://www.familysearch.org\n\nKatie’s maternal grandfather, Edward Jordan Hagan, on the 1920 U.S. Census – https://www.familysearch.org\n\nObituary of Katie’s maternal grandfather, Edward Jordan Hagan – http://www.willistonherald.com"}, {"url": "https://www.astrotheme.com/astrology/Katie_Ledecky", "page_content": "You will find below the horoscope of Katie Ledecky with her interactive chart, an excerpt of her astrological portrait and her planetary dominants.\n\nNB This chart is arbitrarily calculated for noon. If you know the time of birth of Katie Ledecky, please send us your information with your source, at stars@astrotheme.com. To thank you, we shall be glad to send you the portrait (34 pages) of this celebrity, on demand.\n\nHoroscopes having the same aspect Sun opposite Mars (orb 0°31'): Frida Kahlo, Ludwig van Beethoven, Rita Ora, Al Capone, Judy Garland, Eva Joly, David Icke, Richard III of England, Yoann Gourcuff, Eugénie de Montijo, Marg Helgenberger, Andrés Iniesta... Find all the celebrities having this aspect.\n\nHoroscopes having the same aspect Sun sextile Neptune (orb 2°15'): Shakira, 14th Dalai Lama, Ashton Kutcher, Alain Delon, Gwyneth Paltrow, Jean-Marie Le Pen, Nicolas Cage, Tyler, The Creator, Frank Ocean, Tim Burton, Christina Ricci, Amber Rose... Find all the celebrities having this aspect.\n\nCelebrities born the same day: Grimes (musician), John Wayne Gacy, Rob Kardashian, Hozier (musician), Kurt Russell, Billy Corgan, Alexander McQueen, Rob Lowe, José Garcia, Tamar Braxton, Brittany Daniel, Rudolf Nureyev... List of all the celebrities born on March 17.\n\nHoroscopes having the Moon in 16° Cancer : Keanu Reeves, Dua Lipa, Theodore Roosevelt, LL Cool J, Léo Ferré, Bridget Fonda, Rick Levine (astrologer), Maxime Le Forestier, Syria, Werner Herzog, Yves Calvi, Caroline Flack... List of all the celebrities having the Moon in 16° Cancer.\n\nHoroscope and chart of Katie Ledecky\n\nSelect an object to display more information\n\nSelect an object to display more information\n\nAries Motto: \"I am\"\n\nMarch 21 - April 20\n\n1st Fire sign - 1st Cardinal sign (spring equinox) - Masculine In analogy with Mars, his ruler, and the 1st House Aries governs the head. His colour is red, his stone is the heliotrope, his day is Tuesday, and his professions are businessman, policeman, sportsman, surgeon... If your sign is Aries or your Ascendant is Aries: you are courageous, frank, enthusiastic, dynamic, fast, bold, expansive, warm, impulsive, adventurous, intrepid, warlike, competitive, but also naive, domineering, self-centred, impatient, rash, thoughtless, blundering, childish, quick-tempered, daring or primitive. Some traditional associations with Aries: Countries: England, France, Germany, Denmark. Cities: Marseille, Florence, Naples, Birmingham, Wroclaw, Leicester, Capua, Verona. Animals: Rams and sheeps. Food: Leeks, hops, onions, shallots, spices. Herbs and aromatics: mustard, capers, Cayenne pepper, chilli peppers. Flowers and plants: thistles, mint, bryonies, honeysuckles. Trees: hawthorns, thorny trees and bushes. Stones, Metals and Salts: diamonds, iron, potassium phosphate. For more information, see the page dedicated to the sign of Aries.\n\nTaurus Motto: \"I have\"\n\nApril 21 - May 20\n\n1st Earth sign - 1st Fixed sign - Feminine In analogy with Venus, his ruler, and the 2nd House Taurus governs the neck and the throat. Her colour is green or brown, her stone is the emerald, her day is Friday, her professions are cook, artist, estate agent, banker, singer... If your sign is Taurus or your Ascendant is Taurus: you are faithful, constant, sturdy, patient, tough, persevering, strong, focused, sensual, stable, concrete, realistic, steady, loyal, robust, constructive, tenacious. You need security, but you are also stubborn, rigid, possessive, spiteful, materialistic, fixed or slow. Some traditional associations with Taurus: Countries: Switzerland, Greek islands, Ireland, Cyprus, Iran. Cities: Dublin, Palermo, Parma, Luzern, Mantua, Leipzig, Saint Louis, Ischia, Capri. Animals: bovines. Food: apples, pears, berries, corn and other cereals, grapes, artichokes, asparagus, beans. Herbs and aromatics: sorrels, spearmint, cloves. Flowers and plants: poppies, roses, digitales, violets, primroses, aquilegia, daisies. Trees: apple trees, pear trees, fig-trees, cypresses, ash trees. Stones, Metals and Salts: copper, calcium and potassium sulphate, emeralds. For more information, see the page dedicated to the sign of Taurus.\n\nGemini Motto: \"I think\"\n\nMay 21 - June 21\n\n1st Air sign - 1st Mutable sign - Masculine In analogy with Mercury, his ruler, and the 3rd House Gemini governs the arms, the lungs and the thorax. His colour is green or silver, his stone is the crystal, his day is Wednesday, his professions are journalist, lawyer, presenter, dancer, salesman, travel agent, teacher... If your sign is Gemini or if your Ascendant is Gemini: you are expressive, lively, adaptable, quick-witted, humorous, sparkling, playful, sociable, clever, curious, whimsical, independent, polyvalent, brainy, flexible, ingenious, imaginative, charming, fanciful but also capricious, scattered, moody, shallow, inquisitive, opportunistic, unconcerned, selfish, fragile, ironical or changeable. Some traditional associations with Gemini: Countries: Belgium, Wales, United-States, Lower Egypt, Sardinia, Armenia. Cities: London, Plymouth, Cardiff, Melbourne, San Francisco, Nuremberg, Bruges, Versailles. Animals: monkeys, butterflies, parrots, budgerigars. Food: dried fruits, chestnuts, ground-level vegetables: peas, broad beans, etc. Herbs and aromatics: aniseed, marjoram, lemon balm, cumin. Flowers and plants: lilies of the valley, lavenders, myrtle, ferns, Venus-hair-ferns, bittersweets. Trees: nut trees such as chestnut trees. Stones, Metals and Salts: agates, mercury, silicas and potashes. For more information, see the page dedicated to the sign of Gemini.\n\nCancer Motto: \"I feel\"\n\nJune 22 - July 22\n\n1st Water sign - 2nd Cardinal sign (summer solstice) - Feminine In analogy with the Moon, her ruler, and the 4th House Cancer governs the stomach and the breast. Her colour is white or black, her stone is the moonstone, her day is Monday, her professions are catering, the hotel trade, property, antique dealer, archaeologist... If your sign is Cancer or your Ascendant is Cancer: you are emotional, sentimental, peaceful, imaginative, sensitive, faithful, resistant, protective, vulnerable, generous, romantic, nostalgic, tender, poetic-minded, motherly or fatherly, dreamy, indolent, greedy, devoted but also timorous, unrealistic, evasive, passive, anxious, dependent, stubborn, moody, passive, lazy, touchy, stay-at-home or inaccessible. Some traditional associations with Cancer: Countries: Holland, Scotland, North and West Africa, New-Zealand, Paraguay, Algeria. Cities: Amsterdam, Manchester, Tokyo, New York, Istanbul, Stockholm, Milan, Venice, Genoa, Cadix, Alger, Tunis, Bern, Magdeburg. Animals: crabs, animals with shells. Food: milk, fishes, watery fruits and vegetables, turnips, white and red cabbages. Herbs and aromatics: tarragon, verbena, saxifrage. Flowers and plants: geraniums, white roses and white flowers in general, water lilies, morning glory, bear's breeches, and lilies. Trees: all trees full of sap. Stones, Metals and Salts: pearls, silver, lime and calcium phosphate. For more information, see the page dedicated to the sign of Cancer.\n\nLeo Motto: \"I love\"\n\nJuly 23 - August 22\n\n2nd Fire sign - 2nd Fixed sign - Masculine In analogy with the Sun, his ruler, and the 5th House Leo governs the heart and the spine, and the eyes, according to some authors. His colour is gold or orange, his stone is the diamond, his day is Sunday, his professions are actor, manager, jeweller, fashion and arts, and action (e.g. fireman)... If your sign is Leo or your Ascendant is Leo: you are proud, determined, strong-willed, loyal, solemn, generous, ambitious, courageous, heroic, conquering, creative, confident, seductive, happy, daring, fiery, majestic, honest, magnanimous, charismatic, responsible, noble, dramatic but also domineering, vain, susceptible, bossy, stubborn, intolerant, self-centred, violent, quick-tempered, nonchalant. Some traditional associations with Leo: Countries: Italy, Romania, Sicily, Czechoslovakia, Iraq, Lebanon, Southern France. Cities: Rome, Prague, Bombay, Madrid, Philadelphia, Chicago, Los Angeles, Bath, Bristol, Portsmouth, Syracuse, Damas. Animals: lions and felines in general. Food: meat and especially red meat, rice, honey, cereals, grapes, iron-rich vegetables: watercress, spinach etc. Herbs and aromatics: saffron, mint, rosemary, common rue (Ruta graveolens). Flowers and plants: marigolds, sunflowers, celandines, passion flowers. Trees: palm trees, laurel, walnuts, olive trees, lemon and orange trees. Stones, Metals and Salts: gold, rubies, magnesium and sodium phosphate. For more information, see the page dedicated to the sign of Leo.\n\nVirgo Motto: \"I serve\"\n\nAugust 23 - September 22\n\n2nd Earth sign - 2nd Mutable sign - Feminine In analogy with Mercury, her ruler, and the 6th house Virgo governs the intestine. Her colour is green or yellow, her stone is the agate, her day is Wednesday, her professions are accountant, secretary, writer, computer scientist, nurse, doctor... If your sign is Virgo or your Ascendant is Virgo: you are brainy, perspicacious, attentive to detail and numbers, analytical, serious, competent, scrupulous, sensible, modest, logical, tidy, well-organized, clean, hard-working, provident, honest, faithful, reserved, shy, helpful, a perfectionist, but also narrow-minded, calculating, irritating, petty, anxious, cold, repressed or caustic. Some traditional associations with Virgo: Countries: Brazil, Greece, Turkey, West Indies, United-States (the same as Gemini), Yugoslavia, Crete, Mesopotamia, Lower Silesia, State of Virginia. Cities: Paris, Boston, Athens, Lyon, Corinthia, Heidelberg, spa towns in general. Animals: dogs, cats and all pets. Food: root vegetables: carrots, celeriac, kohlrabies, potatoes etc... Also dried fruits such as chestnuts. Herbs and aromatics: the same as Gemini whose ruler is Mercury too, lilies of the valley, lavenders, myrtles, ferns, Venus-hair-ferns, bittersweets, clovers. Flowers and plants: small bright-coloured flowers, especially blue and yellow, such as dandelions, buttercups, yellow dead-nettles, buglosses, forget-me-nots ; cardamoms, oak leaves, acorns. Trees: all nut trees, e.g. the hazelnut tree... Stones, Metals and Salts: sards (red agate), mercury, nickel, potassium sulphate and iron phosphate. For more information, see the page dedicated to the sign of Virgo.\n\nLibra Motto: \"we are\"\n\nSeptember 23 - October 22\n\n2nd Air sign - 3rd Cardinal sign (autumn equinox) - Masculine In analogy with Venus, his ruler and the 7th House Libra governs the kidneys and the bladder. His colour is blue or red (not too bright), his stone is the opal, his day is Friday, his professions are in the beauty, luxury or fashion industry, musician, artistic creator, lawyer, mediator... If your sign is Libra or your Ascendant is Libra: you are sentimental, charming, polite, refined, loyal, a pacifist, fair, distinguished, light-hearted, romantic, learned, ethereal, nice, well-groomed, a perfectionist, calm, sweet, tolerant, sociable, elegant, considerate, seductive, aesthetic, indulgent, but also hesitant, weak, indecisive, selfish, fragile, fearful, indolent, cool or even insensitive. Some traditional associations with Libra: Countries: Japan, Canada, Indo-China, South Pacific Islands, Burma, Argentina, Upper Egypt, Tibet. Cities: Lisbon, Vienna, Frankfurt, Leeds, Nottingham, Johannesburg, Antwerp, Fribourg. Animals: lizards and small reptiles. Food: berries, apples, pears, grapes, artichokes, asparagus, beans, spices, corn and other cereals. Herbs and aromatics: mint, Cayenne pepper. Flowers and plants: hydrangea, big roses, blue flowers and those associated with Taurus also ruled by Venus, namely, poppies, digitales, violets, primroses, aquilegia, and daisies. Trees: ash trees, poplars, apple trees, pear trees, fig-trees, cypresses. Stones, Metals and Salts: sapphires, jade, copper, potassium and sodium phosphate. For more information, see the page dedicated to the sign of Libra.\n\nScorpio Motto: \"we have\"\n\nOctober 23 - November 21\n\n2nd Water sign - 3rd Fixed sign - Feminine In analogy with Pluto, her ruler with Mars, and the 8th House Scorpio governs the sexual organs and the anus. Her colour is black or dark red, her stone is the malachite, her day is Tuesday, her professions are gynaecologist, psychiatrist, detective, the military, army, stockbroker, asset managemer... If your sign is Scorpio or your Ascendant is Scorpio: you are secretive, powerful, domineering, resistant, intuitive, asserted, charismatic, magnetic, strong-willed, perspicacious, passionate, creative, independent, vigorous, generous, loyal, hard-working, persevering, untameable, possessive, cunning, ambitious, sexual, proud, intense, competitive but also aggressive, destructive, stubborn, anxious, tyrannical, perverse, sadistic, violent, self-centred, complex, jealous. Some traditional associations with Scorpio: Countries: Morocco, Norway, Algeria, Syria, Korea, Uruguay, Transvaal. Cities: Washington, New Orleans, Valencia, Liverpool, Milwaukee, Fes, Halifax, Hull, Cincinnati. Animals: insects and other invertebrates. Food: the same strong tasting food as for Aries: red meat, garlic, onions, leeks, spices. Herbs and aromatics: aloes, witch hazels, nepeta, mustard, capers, peppers. Flowers and plants: geraniums, rhododendrons, thistles, mint, honeysuckles. Trees: blackthorns, bushes. Stones, Metals and Salts: opals, steel and iron, calcium and sodium sulphate. For more information, see the page dedicated to the sign of Scorpio.\n\nSagittarius Motto: \"we think\"\n\nNovember 22 - December 20\n\n3rd Fire sign - 3rd Mutable sign - Masculine In analogy with Jupiter, his ruler, and the 9th House Sagittarius governs the thighs and the liver. His colour is indigo, orange or red, his stone is the carbuncle, his day is Thursday, his professions are explorer, commercial traveller, pilot, philosopher, writer, clergyman... If your sign is Sagittarius or your Ascendant is Sagittarius: you are charismatic, fiery, energetic, likeable, benevolent, tidy, jovial, optimistic, extraverted, amusing, straightforward, demonstrative, charming, independent, adventurous, straightforward, bold, exuberant, freedom-loving, but also angry, egotistical, authoritarian, inconstant, unfaithful, brutal, unreliable, unconscious, tactless, or derogatory. Some traditional associations with Sagittarius: Countries: Spain, Australia, Hungary, South Africa, Arabia, Yugoslavia. Cities: Stuttgart, Toledo, Budapest, Cologne, Avignon, Sheffield, Naples, Toronto. Animals: fallow deers, hinds, and the family Cervidae. Food: grapefruits, raisins, onions, leeks, bulb vegetables. Herbs and aromatics: aniseeds, sage, bilberries, cinnamon, borage, mosses, sage, blueberry, patience, balsam. Flowers and plants: dandelions, carnations, thistles. Trees: mulberry trees, chestnut trees, ash trees, lemon trees, oaks. Stones, Metals and Salts: topaz, tin, silica, potassium chloride. For more information, see the page dedicated to the sign of Sagittarius.\n\nCapricorn Motto: \"we achieve\"\n\nDecember 21 - January 19\n\n3rd Earth sign - 4th Cardinal sign (winter solstice) - Feminine In analogy with Saturn, her ruler, and the 10th House Capricorn governs the knees, the bones and the skin. Her colour is black, or grey, green or brown, her stone is the jade, her day is Saturday, her professions are politician, researcher, jurist, scientist, engineer, administrator... If your sign is Capricorn or your Ascendant is Capricorn: you are serious, cold, disciplined, patient, focused, thoughtful, ambitious, indomitable, cautious, lucid, persistent, provident, steady, introverted, stern, wilful, hard-working, responsible, persevering, honest, realistic, loyal, reserved, resolute, moralistic, quiet, rigorous, attached and reliable. But you may also be curt, withdrawn, calculating, petty, cruel, unpleasant, ruthless, selfish, dull, rigid, slow or sceptical. Some traditional associations with Capricorn: Countries: India, Mexico, Afghanistan, Macedonia, Thrace, the Yugoslavian coast, the Orkneys and Shetland Islands, Albania, Bulgaria, Saxony. Cities: Delhi, Oxford, Brussels, Mexico, Port-Saïd, Gent, Constance, Mecklenburg, all the administrative centres of capital cities. Animals: goats, pigs and animals with split hooves. Food: meat, potatoes, barley, beets, spinach, medlars, onions, quinces, flour and starchy food in general. Herbs and aromatics: indian hemp, comfreys, centaureas, hemlocks, henbanes. Flowers and plants: ivies, wild pansies, amaranths, pansies. Trees: pines, willows, flowering ashes, aspens, poplars, alders. Stones, Metals and Salts: turquoises, amethysts, silver, lead, calcium phosphate, calcium fluorine. For more information, see the page dedicated to the sign of Capricorn.\n\nAquarius Motto: \"we love\"\n\nJanuary 20 - February 18\n\n3rd Air sign - 4th Fixed sign - Masculine In analogy with Uranus his ruler, with Saturn, and the 11th House Aquarius governs the ankles and the legs. His colour is navy blue or indigo, his stone is the sapphire, his day is Saturday, his professions are astrologer, high technologies, scientist, astronaut, psychiatrist, actor, electrician... If your sign is Aquarius or your Ascendant is Aquarius: you are idealistic, altruistic, detached, independent, original, surprising, gifted, contradictory, innovative, humanistic, likeable, friendly, self-confident, impassive, quiet, intuitive, creative, charitable, elusive, disconcerting, generous, tolerant, paradoxical, and you cannot stand any kind of constraint. But you may also be marginal, resigned, distant, utopian, maladjusted, eccentric and cold. Some traditional associations with Aquarius: Countries: Russia, Sweden, Poland, Israel, Iran, Abyssinia. Cities: Moscow, Salzburg, Bremen, Hamburg, Saint Petersburg. Animals: long distance big birds such as the albatross. Food: citrus fruits, apples, limes, dried fruits and easily preserved food. Herbs and aromatics: peppers, hot red peppers, star-fruits, and generally herbs that are spicy or with an unusual flavour. Flowers and plants: orchids, dancing ladies, polygonatum. Trees: fruit trees. Stones, Metals and Salts: aquamarines, aluminium, sodium chloride and magnesium phosphate. For more information, see the page dedicated to the sign of Aquarius.\n\nPisces Motto: \"we serve\"\n\nFebruary 19 - March 20\n\n3rd Water sign - 4th Mutable sign - Feminine In analogy with Neptune her ruler with Jupiter, and the 12th House Pisces governs the feet and the blood circulation. Her colour is green or purple or turquoise blue, her stone is the amethyst, her day is Thursday, her professions are seamanship and and faraway travels, musician, social and emergency worker, doctor, writer and jobs in remote places... If your sign is Pisces or your Ascendant is Pisces: you are emotional, sensitive, dedicated, adaptable, nice, wild, compassionate, romantic, imaginative, flexible, opportunist, intuitive, impossible to categorized, irrational, seductive, placid, secretive, introverted, pleasant, artistic, and charming. But you may also be indecisive, moody, confused, wavering, lazy, scatterbrained, vulnerable, unpredictable and gullible. Some traditional associations with Pisces: Countries: Portugal, Scandinavia, small Mediterranean islands, Gobi desert, Sahara. Cities: Jerusalem, Warsaw, Alexandria, Seville, Santiago de Compostela. Animals: fishes, aquatic mammals and all animals living in the water. Food: melons, cucumbers, lettuces, vegemite sugar, pumpkins. Herbs and aromatics: lemon, chicory, limes, mosses. Flowers and plants: water lilies, willows, aquatic plants. Trees: fig-trees, willows, aquatic trees. Stones, Metals and Salts: heliotropes, moonstone, platinum, tin, iron phosphate and potassium sulphate. For more information, see the page dedicated to the sign of Pisces.\n\n\n\nSun Aspects\n\nSun conjunction Venus orb +4°00'\n\nSun conjunction Midheaven orb +4°28'\n\nSun opposite Mars orb -0°31'\n\nSun conjunction Mercury orb +5°54'\n\nSun sextile Neptune orb -2°15'\n\nSun semi-square Jupiter orb -0°09'\n\nSun trine Pluto orb -8°25' Sun 27°09' Pisces The Sun represents vitality, individuality, will-power and creative energy and honours. For a woman, it also represents her father, and later her husband. The Sun is one of the most important symbols in the birth chart, as much as the Ascendant, then the Moon (a bit less for a man), the ruler of the Ascendant and the fast-moving planets. It's element is fire; it is hot and dry, it governs Leo, is in exaltation in Aries and is in analogy with the heart. It represents the boss, authority, beside the father and the husband ; the age of the Sun goes from 20 years old to about 40, following the Venus age when one is aware of his seductive power. Temperament: Bilious Characterology: Emotive, Active, Secondary, passionate type. For more information, see the page dedicated to the Sun. Sun in Pisces Your deep intuition and your extreme sensitivity allow you to perceive naturally what others understand through analysis. You do not follow the norms in use, societal or educational models and you prefer to create a moral for yourself. A feeling of isolation may come from your ability to live emotions that are unknown to your entourage. This strong impressionability endows you with a sixth sense and acute feelings. In some circumstances, distance and detachment are needed in order not to get bogged down in the necessities of the moment, in useless transient struggles and in barren conflicts. Pisces work wonders. Your strength: a sharp intuition of underlying stakes, a sensitivity that turns \"the spirit of the times\" into a real compass. All activities requiring stepping back are suitable for you. Before anyone else, you pick up the dangers of an adventure, the risks of defeats or of suspension... with your clear-sightedness more than due to pessimism. Therefore, you may abandon an objective that is not yet obsolete. It is important that you protect yourself against unnecessary disenchantments. Pisces hide a perceptiveness that many claim to possess. But your low-key advices are formulated in a peculiar language. The person who can understand your dazzling intuitions is very lucky. Sun Dominant If the Sun is part of your natal chart's planetary dominants, in astrology, you are said to be a Solarian: you loathe pettiness and Machiavellian manoeuvre, and you are fond of natural nobleness as well as of direct and honest attitudes. You endeavour to get out of muddled or dark situations as quickly as possible. Your need for transparency may lead you to make cut-and-dried judgments such as yes or no, and black or white. However, your honesty commands your entourage's consideration. At times, you come across as authoritarian. It is true that you never want to be thought of the notable absentee, and that you manage to make people pay attention to you, as well as to your plans and your assessments. To this end, the Solarian sometimes develops a great talent for placing himself under the spotlight without missing a single opportunity to arouse interest. Some other Solarians, although more discreet, still manage to be the focus of any debate, even in situations of exclusion. It is your way of being present even though you are actually not there... More than other people, you appreciate the esteem extended to you. It is useless to cheat with you, since in all areas you consider establishing enduring relationships only with those who love you, admire you, respect you, or express some degree of affection to you. Your will to straighten out your inter-personal relationships is your strength and sometimes, your Achilles' heel. You cannot achieve anything behind the scenes. Therefore, your comportment is marked with heroism, and your stands are devoid of ambiguity, in the sense that your commitments are unfailing, and your rebuffs, final. Interpretation of the 27° Pisces symbolic degree \"Under pouring rain, a man who is drowning in a lake calls for help. From the bank, another man tries to help.\" (Janduz version) Careful, courageous, and resilient character. One can achieve success in all occupations linked to the sea and foreign lands such as fishing, import-export trade, the exploitation of merchant ships or tankers, thalassotherapy, etc. But the most serious threats also come from the sea, and all precautions must be taken in order to face them, for instance by subscribing a comprehensive professional and family insurance policy. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports. If you wish, you can receive immediately in your mailbox your detailed astrological portrait, a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\n\n\nMoon Aspects\n\nMoon conjunction Ascendant orb +4°18'\n\nMoon trine Midheaven orb -6°14'\n\nMoon trine Venus orb -6°42'\n\nMoon square Saturn orb +7°49' Moon 16°26' Cancer The Moon represents instinctive reaction, unconscious predestination, everyday mood, sensitivity, emotions, the feminine side of the personality, intuition, imagination. For a man, she represents his mother and later his wife, and his relationship with women in general. For a woman, the Moon is almost as important as the Sun and the Ascendant. Her element is water, she is cold and moist, she rules Cancer, is in exaltation in Taurus and is in analogy with the stomach. She symbolizes the mother, wife, the crowd, the Moon is associated with birth and childhood. Tradition also matches her with the end of life, after Saturn the old age, it is thus customary to go back to one's place of birth to die: the end of life meets the very beginning. Temperament: Lymphatic Characterology: Emotive, non Active and Primary type or Non-Emotive, non Active and Primary, Nervous or Amorphous type. For more information, see the page dedicated to the Moon. Moon in Cancer On the day and at the time of your birth, the Moon was in the sign of Cancer. Your nature is contemplative. You live in a realm made of images, sensations and emotions. Your private secrets constitute a jungle full of symbols and souvenirs. You have a vivid memory of the past and a very present feeling of previous experiences and emotions. Your family roots remain omnipresent in your intimate behaviours and influence your habits. Your lunar sign belongs to the Cancer-Capricorn zodiacal axis that is particularly selective and self-protective: your close friends are handpicked and cautiously chosen for their natural suitability to your personal realm. The external world is often disturbing. Therefore, you must create an enclosed environment where your fragile sensitivity can blossom at will. The only danger may be that you confine your life rhythms in immutable rites and in a simplistic daily ceremonial. With more flexible intimate behaviours, your sensitivity can be fully expressed and the absolute harmony you dream of can be achieved. Moon Dominant If the Moon is part of your natal chart's planetary dominants, in astrology, you are said to be a Lunarian: the driving force behind your actions is mainly the pursuit of well-being and tranquillity. Your sensitive and romantic self lives on those periods of rest during which you let your imagination wander at will. This is your way of finding inspiration and balance. Nothing is allowed to disturb your feeling of fulfilment and security within a harmonious cell, be it a family or a clan. More than other people, the Lunarian is attached to those moments during which one forgets one's worries and lets oneself cast adrift aimlessly, with no other goal than to be lulled into an ambiance, a situation, or a perfect moment. Many people do not understand such absences and their meaning, which is to regain strength. These people readily describe you with such unflattering terms as apathy and nonchalance. Never mind! Some inspirations require surrendering as well as striking a balance derived from alternate action and passivity. Your qualities are expressed to the fullest in situations which demand familiarity and privacy. Your capacities to respect and blend into your environment is at least as valuable as some other people's aggressive dispositions. However, you are well-advised to avoid indolence and renunciation out of laziness or indifference. Interpretation of the 16° Cancer symbolic degree \"Dazzling flashes of lightning streak the sky at night.\" (Janduz version) Nervous, sensual, and passionate character. One is endowed with excellent pioneering and leadership skills. One achieves outstanding success in one's country and abroad. Careers in science, the arts, or religion are very favoured, as well as efforts to carry out reforms. Excessive compassion may prompt to show generosity towards people who do not deserve it. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports. If you wish, you can receive immediately in your mailbox your detailed astrological portrait, a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\n\n\nMercury Aspects\n\nSun conjunction Mercury orb +5°54'\n\nMercury conjunction Saturn orb +5°32'\n\nMercury trine Pluto orb -2°31'\n\nMercury opposite Mars orb -6°25'\n\nMercury sextile Neptune orb +3°38'\n\nMercury sextile Uranus orb -4°21'\n\nMercury conjunction Venus orb +9°55'\n\nMercury conjunction Midheaven orb +10°22 Mercury 3°03' Aries Mercury represents communication, logical and rational mind, intellectual skills. Earth is its element, it is cold and dry, and it rules Virgo and Gemini, is in exaltation in Virgo and is in analogy with the arms, hands, nervous system. It represents tradesmen, lawyers, messengers; the age of Mercury goes from 8 or 10 years old to about 15.. Temperament: Nervous Characterology: Emotive, non Active and Primary type or Non-Emotive, Active and Primary, Nervous or Sanguine type. For more information, see the page dedicated to Mercury. Mercury in Aries Mercury describes your relations, your communication skills and the way you relate to the external world. However, other astrological elements also influence these areas. The sign Mercury occupies is significant only if Mercury is part of your planetary dominantes. In your chart, Mercury is in Aries. You respond very quickly to the stimulations of your environment. Your mind is constantly on the lookout, searching for new information. Communication is a matter of spontaneity and emotions experienced day-to-day. You always have a quick retort, you are fond of debates and you are avid for novelties. The danger is that you may get carried away by an impulsiveness detrimental to your relationships. Beware of bad language! Mercury Dominant If Mercury is part of your natal chart's planetary dominants, in astrology, you are said to be a Mercurian: the tradition points out the importance of communication. From idle but enriching chatters to observation gift, such a dominant endows you with a wide range of expression. Human beings have one thousand facets and one thousand masks they wear according to circumstances and the fortunes of the game of life. You take the role of an observer who is avid for novelties, discoveries, and surprises. Everything catches your attention and becomes an opportunity for new encounters, relationships, and learning. The world amazes you, amuses you sometimes, and stimulates your curiosity. Because the most important thing is to discover, and because you consider that each new situation is packed with potentialities, you try to fill the gaps in your knowledge. Although your open-mindedness may scatter your centres of interest, it also enables you to carefully avoid sticking to only one immutable and rigid view. The slightest sign enables you to perceive the other side of the coin, as well as the infinite complexity of people and of situations. On the human plane, you seek the dialogue and the information without which you know that you are not able to fully grasp the nature of your interlocutor. This keen interest in the Unknown sharpens your inter-relational skills. All these qualities are traditionally associated with Mercury. Interpretation of the 3° Aries symbolic degree \"A man takes a walk in a forest where many plants of various species grow. Another man with shaggy hair hides behind the shrubs.\" (Janduz version) Pragmatic, modest, and unsophisticated character. In spite of a great natural wisdom, one has no inclination for studies. One is driven by the sense of honour and by genuine generosity. The man hidden in the shrubs is not necessarily ill-intentioned. He may just be an original and independent person who prefers to remain out of the mainstream. In this lifetime, one can expect at least one major encounter which brings about crucial events, the positive or negative outcomes of which depend on the natal chart. All occupations related to security such as the police, the military, or the law are highly favoured. If in the natal chart, Mars is on this degree and forms hard aspects with the Sun and the Moon, he may portend a violent death. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports. If you wish, you can receive immediately in your mailbox your detailed astrological portrait, a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\n\n\nVenus Aspects\n\nVenus conjunction Midheaven orb +0°27'\n\nSun conjunction Venus orb +4°00'\n\nVenus opposite Mars orb -3°29'\n\nMoon trine Venus orb -6°42'\n\nVenus semi-square Uranus orb +0°43'\n\nMercury conjunction Venus orb +9°55' Venus 23°08' Pisces Venus represents the way one loves, relationships, sharing, affectivity, seductive ability. For men, she also corresponds to the kind of woman he's attracted to (but not especially in marriage which is more symbolized by the Moon, Venus is the lover and not the wife). Her element is the Air, she is moist, rules Taurus and Libra, is in exaltation in Pisces and is in analogy with the kidneys, the venous system, the bladder, the neck. She represents the artists, tradesmen, occupations linked to beauty and charm; the age of Venus goes from 15 to about 25 years old. Temperament: Sanguine and Lymphatic Characterology: Emotive, non Active and Primary type or Emotive, non Active and Secondary type. For more information, see the page dedicated to Venus. Venus in Pisces Venus describes your affective life. On the day of your birth, she is found in Pisces. Your emotionalism is very strong and very unusual. You have your own manner to experience your emotions and your sensations, in an atmosphere that may be odd, you complicate your amorous life... and this is part of your charm, at the same time. On the chessboard of your sentimental life, quite strange games enfold. Your affectivity is subtle, fabulous and unusual: love reinvents everything and anything becomes possible when your heart is sincere. You dream of a complete fusion and of giving yourself totally. No rules, no moral or social code is more important than the feeling of shared passion and than living for your partner. Your affective life is complex, sometimes mysterious: you don't know why you love, or why you don't love any more... Your sentimental life obeys a different logic than that of the external world. Love is elusive and fragile. Nothing is easier than to destroy a feeling and to forget a passion. Your sensitivity responds to an unknown call, a strange signal. Therefore, you may shift from intense and absolute feelings to cruel indifference. Although you don't know why, you are being transformed. The most difficult thing is to love a real being and not a shadow. You give yourself to persons who can understand and respect the fragile realm of your affectivity. Venus Dominant If Venus is part of your natal chart's planetary dominants, in astrology, you are said to be a Venusian: you are a sensual and emotional person particularly receptive to the natural likes and dislikes aroused by your contact with people. You are prone to frequent instinctive aversions and true passions which are exclusively driven by the feeling of love. The heart has its reasons which Reason knows nothing of... Your balance is based on the richness of your affective life. Without love, the Venusian is resourceless, lost, and deprived of any reason for living. You have an obvious and strong will to charm and to arouse the attachments without which you cannot properly function. Every area of your life is thus marked by your affectivity. The danger is that you may \"be taken in\" by charm. In such cases, you would prefer to keep your emotions under better control. Thus, hyper-sensitivity has its own inconveniences. Nevertheless, better than anyone else, you know how to play with feelings and attractions. Although you are sometimes caught in the traps of an over sensitive emotionalism, feelings remain your best assets in many circumstances. There is another aspect to the Venusian dominant. According to the Tradition, this planet rules the Arts, and you are endowed with some degree of artistic dispositions, ranging from good to excellent. Interpretation of the 23° Pisces symbolic degree \"Under a dark sky enlightened by a moon crescent and a flash of lightning, two men are wrestling.\" (Janduz version) Assertive, courageous, and discerning character endowed with physical and intellectual strength. One is free to use one's personal qualities at the service or justice and the collective good, or on the contrary, in the pursuit of reprehensible goals. In both cases, many hurdles and setbacks disrupt one's happiness and success. However, thanks to one's fortitude, one can overcome ordeals with flying colours. It is in the dark hours of the night that danger lurks. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports. If you wish, you can receive immediately in your mailbox your detailed astrological portrait, a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\n\n\nMars Aspects\n\nSun opposite Mars orb -0°31'\n\nVenus opposite Mars orb -3°29'\n\nMars opposite Midheaven orb -3°56'\n\nMars trine Neptune orb +2°47'\n\nMercury opposite Mars orb -6°25'\n\nMars sesqui-quadrate Jupiter orb +0°40' Mars 26°37' Я Virgo Mars represents the desire for action and physical energy, sexuality, strength. For a woman, Mars corresponds to the kind of man she's attracted to (but not especially in marriage which is rather symbolized by the Sun, Mars is the lover, not the husband). Fire is its element, it is hot and dry, and it rules Aries and Scorpio (along with Pluto), is in exaltation with Capricorn and is in analogy with the muscles and the spleen. It represents the soldiers, sportsmen, warriors, surgeons, blacksmiths... ; the age of Mars goes from 42 to 50 years old. Temperament: Bilious Characterology: Emotive, Active, Primary type. It is a Choleric. For more information, see the page dedicated to Mars. Mars in Virgo The planet Mars indicates how you react to life concrete stimulations. It also describes your fighting spirit, your abilities to stand for yourself and to take action. With Mars in Virgo, you strive to control your emotions and to reduce your field of activity in order to keep a maximal level of efficiency in your actions. When you commit yourself into something, you display a strong ingenuity and resourcefulness and you intervene at the right time. Your actions are as efficient as they are discreet. You may not feel comfortable when the situation you face is not logical. The whims of fate are not your allies: but you analyze properly more stable situations and you handle them methodically well. You seldom take inconsiderate actions and you prefer to take the time to weigh up the pros and the cons before undertaking anything. Your entourage may see your reserve and your restraint as a lack of boldness. Mars Dominant If Mars is part of your natal chart's planetary dominants, in astrology, you are said to be a Marsian: in your hand-to-hand struggle for life, you demonstrate an acute and active sense of confrontation with the world, with other people, and with your own destiny. You need to take action and to fight for your projects and your desires. You perceive all situations with deep intensity, and you react to the here and now without bothering to step back in order to ensure that events are under your control. You take up challenges with excessive foolhardiness as a consequence of your impulsiveness. However, better than anyone else, you know how to mobilise your resources in case of crisis. You take action whenever it is necessary to do so, and you are present in a timely manner. With Mars, your attitudes are dictated by the realities of the moment, by your emotions, and by everything which proved to have worked in the past. When this dominant is not well integrated, it may bring about an aggressive or impulsive behaviour. Therefore, you must learn to control your hyper-sensitivity and your fits of temper. You are also endowed with Marsian qualities: the fighting spirit and the taste for duel without which one may find oneself overwhelmed by events. When this willpower is well channelled, its precious energy enables to cope with all sorts of contingencies. There are a thousand ways to win, and a thousand challenges to take up with the enthusiasm and the dynamism which make life so worthy. A certain idea of life which is wild, passionate, and in tune with events. Interpretation of the 26° Virgo symbolic degree \"In his workshop, a disheartened carpenter stands idle whereas his employee cheerfully pulls the workbench cluttered with badly maintained tools.\" (Janduz version) Clumsy, incompetent, and lazy character. One is handicapped by a lack of skills, and above all, by the certainty that wealth can be achieved without effort. Passivity may encourage people who are more active and hard-working to grasp all the good opportunities. However, the courageous employee of the image also stands for the person influenced by this degree. All it takes to become successful is to pull oneself together, get proper training and start practicing, straight away. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports. If you wish, you can receive immediately in your mailbox your detailed astrological portrait, a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\n\n\nJupiter Aspects\n\nJupiter conjunction Uranus orb +4°53'\n\nSun semi-square Jupiter orb -0°09'\n\nJupiter inconjunction Ascendant orb -0°10'\n\nJupiter sextile Saturn orb -3°42'\n\nMars sesqui-quadrate Jupiter orb +0°40' Jupiter 12°18' Aquarius Jupiter represents expansion and power, benevolence, large vision and generosity. Its element is Air, it is hot and moist, and it rules Sagittarius and Pisces (along with Neptune), is in exaltation with Cancer and is in analogy with the hips and endocrinal system. It represents the governors, magistrates, professors, religious men too; the age of Jupiter goes from 50 to 55 or even 70 years old. Temperament: Sanguine Characterology: Emotive, Active, Primary type; it is an extrovert Choleric. Actually the humid version of Mars, inclined to action like him. For more information, see the page dedicated to Jupiter. Jupiter in Aquarius The planet Jupiter symbolizes expansion, broadness and generosity. Jupiter is associated with the functions of synthesis, enthusiasm and optimism. In your natal chart, his house position is more important than his sign position because, like Saturn, Uranus, Neptune and Pluto, he is a slow planet. Many people born in the same period have Jupiter in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. Jupiter in Aquarius stimulates your mental activities and favours the area of collective or humanitarian projects. In these fields, you can easily assert your originality and develop your interests for new topics and unusual things in general: sciences, higher technologies, but also esoterism, astrology and occultism. Your friendship life is favoured too by this configuration. Jupiter Dominant If Jupiter is part of your natal chart's planetary dominants, in astrology, you are said to be a Jupiterian: because this planet brings about a keen interest in social and professional success, the Tradition considers it to be beneficial. Indeed, you know how to adjust to events and to jump at the chance when it arises. The members of your entourage gladly entrust you with high responsibilities because they are often impressed by your learning skills and your adaptation abilities as you deal with new structures and new languages. What is the secret of your good star? It is your self-confidence which wins public support. Now, what is the secret of your charm? Definitely, enthusiasm, euphoria, and exaltation. Exaggeration also. When this dominant is well integrated, it is a factor of affluence and optimism, and a certain degree of joviality enables you to easily fit into various spheres. It constitutes your main asset to manage your life. However, you must at times curb your desire for integration, lest your sense of opportunity turns into extreme opportunism. Here also, the key to success lies in a correct estimate of everyone's chances and possibilities. Although management is one of your forte, and you can adjust your objectives to current realities better than other people, you lack the hindsight which enables you to avoid short-term vagaries and daily fluctuations. If you strive too much to adapt, you run a risk of betraying yourself. This is the other traditional side of the coin with \"The Greater Benefic\"! Interpretation of the 12° Aquarius symbolic degree \"An infuriated lion struggles against the bars of its cage.\" (Janduz version) Ambitious, independent, and fiery character. It is indispensable to give up vengeful projects and to ensure that one's authority is not misused, lest all kinds of disastrous events and setbacks crop up. In a figurative sense, this degree indicates that one may be kept in prison by one's rebellious and anarchistic tendencies. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports. If you wish, you can receive immediately in your mailbox your detailed astrological portrait, a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\n\n\nSaturn Aspects\n\nMercury conjunction Saturn orb +5°32'\n\nSaturn sextile Uranus orb +1°11'\n\nSaturn square Ascendant orb +3°31'\n\nSaturn trine Pluto orb +3°01'\n\nJupiter sextile Saturn orb -3°42'\n\nMoon square Saturn orb +7°49' Saturn 8°36' Aries Saturn represents concentration, effort, perseverance, time, the hard reality, inevitable consequences. Earth is its element, it is cold and dry, and it rules Capricorn and Aquarius (along with Uranus), is in exaltation in Libra and is in analogy with the bones (skeleton) and the skin. It represents the grandparents, old people, scientists, knowledgeable men, Saturn corresponds to old age; it goes from 70 years old until death. Temperament: Nervous Characterology: Non-Emotive, Active and Secondary type or Emotive, non Active and Secondary type or sometimes Non-Emotive, non Active and Secondary type; it is a Phlegmatic, a Sentimental or an Empathic type For more information, see the page dedicated to Saturn. Saturn in Aries The planet Saturn symbolizes contraction, effort, time, limitation and concentration. Saturn eliminates anything that is not authentic, sooner or later. It is impossible to cheat him as he gives an irresistible desire to form a coherent whole with oneself, in responsible and wise ways. He is the great purifier. He represents our limitations but also our truth. In your natal chart, the house position where Saturn is posited is more important than his sign position because, like Jupiter, Uranus, Neptune and Pluto, he is a slow planet. Many people born in the same period have Saturn in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. Saturn in Aries decreases your impulsiveness, your primary-ness and your spontaneity. But it endows you with more patience, tolerance and reflection in the long run. Saturn Dominant If Saturn is part of your natal chart's planetary dominants, in astrology, you are said to be a Saturnian: you gladly leave to other people the decision to take life as it comes. As far as you are concerned, you prefer to take advantage of your experiences in order to discover, to grow, and to question yourself. Interpretation of the 8° Aries symbolic degree \"A man stands on a high balcony in a haughty attitude, with folded arms and upright head. He proudly looks at the city which spreads at his feet.\" (Janduz version) Courageous, self-confident, and clever character. One makes a loyal friend or a formidable foe that is to be reckoned with. One does not shirk from dangers and tackles all difficult situations with self-control and bravery. The major downside is that one is often the victim of one's own pride, and that one is reluctant to ask for help. In the professional area, one achieves success thanks to one's excellent strategy and disregard for danger. If one obtains a position of power, one demonstrates a sharp sense of justice and always acknowledges people's talents. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports. If you wish, you can receive immediately in your mailbox your detailed astrological portrait, a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\n\n\nUranus Aspects\n\nJupiter conjunction Uranus orb +4°53'\n\nSaturn sextile Uranus orb +1°11'\n\nUranus conjunction Neptune orb +7°59'\n\nUranus sextile Pluto orb +1°49'\n\nUranus semi-square Midheaven orb +0°16'\n\nVenus semi-square Uranus orb +0°43'\n\nMercury sextile Uranus orb -4°21' Uranus 7°24' Aquarius Uranus represents individual freedom, originality, independence, marginality, avant guard inspiration, ultra modernism. Fire is its element, it is dry, and it rules Aquarius, is in exaltation with Scorpio and is in analogy with the brain and the nerves. It represents inventors, odd characters, revolutionaries. Temperament: Nervous to the extreme Characterology: Emotive, Active, Secondary type; it is a Passionate type. For more information, see the page dedicated to Uranus. Uranus in Aquarius The planet Uranus symbolizes originality, independence and cerebral energy bursting suddenly. Uranus triggers the irresistible need for freedom that we have in ourselves. Uranus tends to break the constraints that have become unbearable and gives us the courage and the will to get rid of what has become a burden; when he is well aspected, he also indicates genius. In your natal chart, Uranus' house position is more important than his sign position because, like Jupiter, Saturn, Neptune and Pluto, he is a slow planet. Many people born in the same period have Uranus in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. The sign positions of Uranus, Neptune and Pluto have a collective meaning. They do not influence your personality, unless they are involved in numerous aspects or when they emphasize a personal point of your natal chart such as your Ascendant's ruler, an angular planet, i.e. a planet near the Ascendant, the Midheaven, the Nadir or the Descendant. In such cases, the activity of the slow planet is very highlighted. Uranus in Aquarius is in his own sign and, according to the Tradition, he is most potent and at his best: you are freedom-oriented and your desire to revolutionize the world in your fields of interest is irresistible. You are attracted by avant-gardist areas such as higher technologies, astrology etc... Uranus Dominant If Uranus is part of your natal chart's planetary dominants, in astrology, you are said to be a Uranian: personal values are prevailing. Inner certainties fuel an inflexible will and a desire to call attention on yourself as well as to follow your beliefs through. This planet prompts you to behave with determination, to put forward your own truth, and to start your personal revolution. More than other people, you are willing to keep some degree of autonomy in all circumstances, and you often display an individualistic nature. In order to achieve your ideal of freedom and independence, you may act like a despot as you try to convince and to impose your views, whether smoothly or forcefully. Regardless of the flexibility of your comportment, some situations demand an absolute firmness as well as uncompromising, frank and straightforward attitudes. People may criticise you for your intransigence and say that you are a hardliner. Outsider's opinions don't matter! The most important thing is that you act in all conscience and reach your primary objectives. More than anyone else, you know how to use your willpower and to focus your energy on a precise aim, relentlessly, whatever the consequences might be. In the chapter of qualities, let's mention a definite sense of responsibility, an innovative mind open to techniques and modern ideas, as well as a natural self-discipline which overcomes many an obstacle. Therefore, people are well-advised not to hound you into a corner. Interpretation of the 7° Aquarius symbolic degree \"In the middle of an open arena, a lion sits, impassive and proud, in front of a man who offers a mutton head in one hand, but holds a chain in the other hand.\" (Janduz version) Independent, wise, and courageous character. One regards freedom as a priceless treasure and pays little attention to worldly goods. This degree symbolises the dilemma between freedom with all its uncertainties and security with all its constraints. Unless the natal chart indicates otherwise, one resists the lure of money and power. Nevertheless, there is a danger of deprivation of liberty caused by political reasons. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports. If you wish, you can receive immediately in your mailbox your detailed astrological portrait, a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\n\n\nNeptune Aspects\n\nMars trine Neptune orb +2°47'\n\nSun sextile Neptune orb -2°15'\n\nUranus conjunction Neptune orb +7°59'\n\nMercury sextile Neptune orb +3°38' Neptune 29°24' Capricorn Neptune represents escapism, impressionability, daydreaming, delusions, carelessness, deception or intuition, dishonesty or inspiration, telepathy. Water is its element, it is moist, it rules Pisces, is in exaltation in Cancer, though some authors say it is Leo, and is in analogy with the vegetative system. It represents dreamers, mediums, magicians, merchants of illusion, drug addicts. Temperament: rather Lymphatic Characterology: Emotive, non Active, Primary or Secondary type; it is a Sentimental, or sometimes Amorphous type. For more information, see the page dedicated to Neptune. Neptune in Capricorn The planet Neptune symbolizes extreme receptivity, intense emotional sharpness, impressionability and inspiration; it is the planet of mediums, mystics and religious faith. In an astrological chart, it indicates dilution, vagueness, understanding one's environment through emotions and the absence of clear and determined limits and structures. In your natal chart, Neptune's house position is more important than his sign position because, like Jupiter, Saturn, Uranus and Pluto, he is a slow planet. Many people born in the same period have Neptune in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. The sign positions of Uranus, Neptune and Pluto have a collective meaning. They do not influence your personality, unless they are involved in numerous aspects or when they emphasize a personal point of your natal chart such as your Ascendant's ruler, an angular planet, i.e. a planet near the Ascendant, the Midheaven, the Nadir or the Descendant. In such cases, the activity of the slow planet is very highlighted. Neptune in Capricorn brings a touch of humanity and emotion into your ambition made of cold and calculated vision. Or, on the contrary, it may disrupt your precise and clear vision of your professional future. Neptune Dominant If Neptune is part of your natal chart's planetary dominants, in astrology, you are said to be a Neptunian: your intuition is highly developed. You are of a contemplative nature, and you are particularly receptive to ambiances, places, and people. You gladly cultivate the art of letting-go, and you allow the natural unfolding of events to construct your world. You follow your inspirations, for better or for worse. At times, you display an extraordinary clairvoyance gift. You seem to be able to read your subconscious like a book, and you track down subtle underlying mechanisms, flaws, or open breaches. This innate intuition might explain the strokes of good luck which the Neptunian is sometimes credited with. However, you may also be the victim of illusions and misleading intuitions. You are an idealist, and you let your deepest aspirations prevail over the realities of the moment. Then, you set off in quest of some quixotic objective, living like a Don Quixote who relentlessly pursues an impossible dream. You have a great talent for psychology and the mysteries of the human soul. Since you instinctively perceive people's intents and motivations, as you swim in the complexity of human nature, you feel in your element. The subtlety of your perceptiveness is the source of both special affections and irrevocable rejections. What is the danger of such a dominant? If it is not offset by other influences in your natal chart, you may not have an iron will. Your trump card is your instinct, which may be developed to the extent that it becomes clairvoyance. Interpretation of the 29° Capricorn symbolic degree \"In an aviary, a man plays the flute amid birds and shiny bubbles.\" (Janduz version) Superficial, daring, and unpredictable character endowed with strong powers of seduction. One can be successful in animal taming and training, or in prestidigitation. More often than not, wealth is acquired through a nice marriage. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports. If you wish, you can receive immediately in your mailbox your detailed astrological portrait, a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\n\n\nPluto Aspects\n\nSaturn trine Pluto orb +3°01'\n\nMercury trine Pluto orb -2°31'\n\nUranus sextile Pluto orb +1°49'\n\nPluto bi-quintile Ascendant orb -0°32'\n\nSun trine Pluto orb -8°25' Pluto 5°35' Я Sagittarius Pluto represents deep transformations, mutations and eliminations, sexuality and magnetism, power and secrets, destruction with a view to regeneration, the phoenix rising from the ashes. Its element is indefinite; burning (like lava in fusion ?), it rules Scorpio, is in exaltation in Pisces and is in analogy with the sexual organs and excretion. It represents dictators, sadistic people, violent characters, is instinctive and powerful but also mysterious with hidden strengths. Temperament: rather Bilious Characterology: Emotive or non-Emotive, Active, Primary type; it is a Passionate Choleric type. For more information, see the page dedicated to Pluto. Pluto in Sagittarius The planet Pluto symbolizes deep disruptions and upheavals, domination and sexual instincts, and the inner power we have in ourselves. Pluto destroys in order to reconstruct and he provokes painful crises that are needed in metamorphosis. Pluto is our deepest instincts' brutal force. It is the hidden and unconscious violence that can explode in us with incredible intensity before being projected in our actions; in itself, the planet is not negative: the might and the intensity of its energy are beyond the conceivable but it can be funnelled. Pluto is the only possibility we have at our disposal to overcome our inner blocks and to eliminate outgrown situations that have become inextricable. Pluto's energy is valuable because of its usefulness for the irreversible destruction of what constitutes a problem and not because of its negative side and its perversity. Pluto allows to reconstruct and to regenerate parts of our personality or whole stretches of our life, provided that we manage to funnel his wild energy and to step back. It is impossible to tame this energy, given its essence. However, it is possible to take advantage of it for a precise aim, through a temporary identification of some parts of us with this energy. In such a case, the outcome is our final evolution and even, our transformation. In your natal chart, Pluto's house position is more important than his sign position because, like Jupiter, Saturn, Uranus and Neptune, Pluto is a slow planet. Many people born in the same period have Pluto in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. The sign positions of Uranus, Neptune and Pluto have a collective meaning. They do not influence your personality and they are not to be really taken into account, unless they are involved in numerous aspects or when they emphasize a personal point of your natal chart such as your Ascendant's ruler, an angular planet, i.e. a planet near the Ascendant, the Midheaven, the Nadir or the Descendant. In such cases, the activity of the slow planet is very highlighted. Pluto in Sagittarius prompts you to discover and to conquer. Your appetite for power may be satisfied abroad. Pluto Dominant If Pluto is part of your natal chart's planetary dominants, in astrology, you are said to be a Plutonian: you sometimes feel like a foreigner who does not belong to the world, to its laws, and its concerns. The rules of life in society are not necessarily yours. You are interested in what is unknown and in the subtle laws of a hidden order. So, you take malicious pleasure in ridiculing the patterns you find too simplistic or too rigid. You also revel in underlining the limits of explanations you deem too common. There is something unconventional about the way you are, the way you think, and the way you act. What is your specificity made of? Is it an extraordinary partner? A life off the beaten path? Or do you only distance yourself from conventional morals? In any case, you have the feeling, sometimes quite vague, that you come from nowhere, and that you do not belong to any definite group... In short, it means that you cannot be simplified in order to conform to existing models. The gap between you and ordinary mortals is also an element of your strength. Your deep clear-sightedness, firstly, enables you to put things into perspective and to grant them only the attention they deserve. Your other remarkable asset is your capacity to intervene from behind the scenes, to secretly organise events, and to bring about the desirable outcome without seeming to impose or to dictate anything. However, you must still overcome one of the major difficulties of this dominant, which is to get people to accept your difference and to smoothly fit into your environment. Interpretation of the 5° Sagittarius symbolic degree \"An ox is tethered near a windmill.\" (Janduz version) Inventive, hard-working, and selfless character endowed with exceptional intellectual capacities. Many resounding successes are achieved, and one enjoys worldwide fame in medicine, scientific research, literature, or the arts. However, owing to excessive leniency and a complete lack of interest in making money, one lets other people reap the financial rewards of one's work. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports. If you wish, you can receive immediately in your mailbox your detailed astrological portrait, a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\n%DYNAMIQUE_22% Chiron is almost renowned and used everywhere. Most astrologers consider it as a kind of \"mediator\" between Saturn and outer planets. Consequently, Chiron is of Saturn's nature and at the same time is influenced by Uranus, the first slow-moving planet. Astrologically, it symbolizes wisdom, patience and the faculty to reduce others' sufferings: it is said to be the \"great healer\" of the zodiac. Like all the secondary bodies, it must be in close conjunction with planets or angles in order to fully express its action. %TEXTES_22%\n\n%DYNAMIQUE_23% Ceres, the biggest of the four minor asteroids used besides Chiron, is associated with the mythological goddess of growing plants and harvest and also symbolizes physical constitution, vitality and fertility. She's also known as Demeter, according to the astrologer Zipporah Dobyns, linked to the symbolism of the mother but in a less emotive and more physical way than the Moon. Ceres is thought to be the ruler of Virgo, in exaltation in Gemini, in exile in Pisces and in fall in Sagittarius. Keywords associated with Ceres could be order, practical sense, worry, precision, modesty, method, sobriety, motherhood, fertility, the Earth: a kind of a more cerebral Moon... %TEXTES_23%\n\n%DYNAMIQUE_24% Pallas is sometimes used in modern Astrology: she represents intelligence, abstract and global thinking talents. It is usually considered to be a determining element in political strategy. %TEXTES_24%\n\n%DYNAMIQUE_25% Juno is the asteroid corresponding to the adaptation to the marital partner and to the defence of individual rights; it is thus used in the field of marriage. %TEXTES_25%\n\n%DYNAMIQUE_26% Vesta is rarely used and brings the ability to efficiently devote oneself to a cause. %TEXTES_26%\n\nTrue North Node 28°45' Я Virgo The North Node (True Node here) represents the goals that must be achieved during life, in the karmic sense according to some traditions. Its position in house indicates in what field an effort is necessary in order to evolve. The North Node is often called the Dragon's head, it is usually considered beneficial, a bit like Jupiter with the planets. The Lunar nodes are fictional points and not actual heavenly bodies: they are the intersections of the Moon with the Ecliptic (the path made by the Sun in its orbit as seen from the Earth). The axis of the Lunar nodes moves 19 degrees each year, namely a bit more than three minutes each day. The South Node is diametrically opposed to the North Node, therefore it faces it (it's not drawn here, it's the same symbol but upside down). It symbolizes what has already been achieved or acquired, in a karmic sense: it's the past from which it's advised to move on in order to progress. The South Node is rather negative, of a Saturnian nature: the experience through suffering. Interpretation of the 28° Virgo symbolic degree \"A cardinal wearing an amethyst ring stands by the French window of a bishop's palace and watches the rain fall on the garden.\" (Janduz version) Altruistic, austere, and resilient character. One is a loner and enjoys spending long moments pondering in solitude, but one also appreciates attending formal glamorous ceremonies. Thanks to a vivid imagination, one is capable of achieving great creative works. There may be a strong religious vocation. If in the natal chart, Mars is prominent, there is a tendency towards violence. If Venus is strong, this degree indicates that intense sensuality is reined in by self-control. The constellation \u0093Argo Navis\u0094 gives a deep interest in education, favours knowledge amassed through journeys, and underlines the influence of altruism, faith, and philosophy. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nTrue Lilith 21°34' Leo Lilith or the Dark Moon (True Lilith here) represents the uncrossable threshold, taboos, the individual's provocative and fascinating side, including on a sexual level. She symbolizes violence and \"untameability\", the radical and deep-seated refusal to submit. The keywords for Lilith can be sterility, sadism, perversity, castration, sadomasochism, eroticism, orgasm, forbidden fantasies, marginality, cruelty; redemption, illumination, rebelliousness... Lilith's opposite point is called Priapus; it is the Lunar perigee, the position where the Moon is closest to the Earth. It symbolizes man's primitive nature, the horror hidden in our deepest self; masochism, extreme sensuality, impulsiveness, irrationality and excess. Physically speaking, the Dark Moon is the focal point unoccupied by the Earth: it is not a concrete body but a mathematical point. Interpretation of the 21° Leo symbolic degree \"A sparrow hawk glides above a nest of fledglings. In the nearby thatched cottage, an ailing man lies in bed.\" (Janduz version) Naive, indecisive, and weak character. Dangers and deceits crop up since childhood. They come from outsiders but also from the family circle. One tends to seek help from the very people who are envious and willing to harm. It is strongly recommended not to trust anyone, and never to talk about one's successes, even with family members, because some relatives covet the assets of the person born under the influence of this degree. Should the natal chart concur, a sudden disease such as meningitis may affect the head. N.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\n%DYNAMIQUE_29% The Part of Fortune is an ancient concept, used by Ptolemy and other astrologers before him. Firstly, it has nothing to do with fortune! In modern astrology, it is actually used to enhance a planet or angle when in close conjunction with it: it thus amplifies the meaning associated to the point affected by its presence. It is calculated in the following way: Part of Fortune = AS + Moon - Sun (it is the Moons position when the Sun rises) The classical Part of Fortune, of which the calculus method is unchanged whether in a diurnal or nocturnal chart, is usually distinguished from the diurnal/nocturnal Part of Fortune which is calculated by the formula AS + Sun - Moon for a nocturnal chart, and AS + Moon - Sun in a diurnal chart. We currently use the latter formula for our astrological programmes. For more information, see the page dedicated to the Arabian parts. %TEXTES_29%\n\n%DYNAMIQUE_30% The First House or Ascendant represents one's behaviour in the eyes of others, and also one's health. It corresponds to the way the individual acts in the world. It is the image of the personality seen by others and the person's visible behaviour expressed outwardly. The 1st House is in analogy with Aries and thus Mars too, and then the Sun. It is an angular house, the most important one with the Midheaven, maybe even more so due to its link with the body and health. %TEXTES_30%\n\n%DYNAMIQUE_31% The Tenth House still called the Midheaven, is the highest point amidst the houses, at the top of the chart, in the South, and relates to destiny in general and career (and not daily work as meant by the Sixth House). The Midheaven represents our achievements and goals in the social sphere, our social position in society, and becomes more and more important as we get older. It is in analogy with Capricorn and Saturn. The Tenth House is the most important angular house along with the Ascendant. %TEXTES_31%\n\n%DYNAMIQUE_32% The First House or Ascendant represents one's behaviour in the eyes of others and also one's health. It corresponds to the way the individual acts in the world. It is the image of the personality as seen by others and the person's visible behaviour expressed outwardly. The 1st House is in analogy with Aries and thus Mars too and then the Sun. It is an angular house, the most important one with the Midheaven, maybe even more so due to its link with the body and health; the Ascendant is as important as the Sun in a natal chart. %TEXTES_32%\n\n%DYNAMIQUE_33% The Second House is the sphere of material security, the money we earn, our possessions, also in a symbolic meaning (close people etc). It is in analogy with Taurus and Venus. It is a succedent house, quite important.\n\n%DYNAMIQUE_34% The Third House is the sphere of social and intellectual apprenticeship, studies, relationships with close people and surroundings, short trips, light-hearted and quick contacts, correspondences. It is in analogy with Gemini and Mercury. It's a cadent house, less important than the angular and succedent ones.\n\n%DYNAMIQUE_35% The Fourth House also called Immum Coeli is the sphere of inner emotions, family, the father, home and roots, but also the home one creates. It's Home Sweet Home, security and cocoon. It is in analogy with Cancer and the Moon. It's an angular and important house. %TEXTES_35%\n\n%DYNAMIQUE_36% The Fifth House is the sphere of pleasures and love affairs (but not commitment or marriage), creations and entertainments, children, arts and game. It is in analogy with Leo and the Sun. It's a succedent and quite important house.\n\n%DYNAMIQUE_37% The Sixth House is the sphere of apprenticeship and effort in the work environment, daily life, health on a daily basis and not operations or long-term diseases, relationships with co-workers or subordinates, desire for improvement, analysis and detail. It is in analogy with Virgo and Mercury. It is a cadent house, less important than the angular and succedent ones.\n\n%DYNAMIQUE_38% The Seventh House also called the Descendant (in front of the Ascendant) is the sphere of partnership, marriage, contracts, relationships with others, the outer world. It is in analogy with Libra and Venus, and Saturn to a lesser extent. It is an angular and important house. %TEXTES_38%\n\n%DYNAMIQUE_39% The Eighth House is the sphere of emotional security, the depths of the self, secrets and paranormal, transcendence, sexuality, mysteries, upheavals, surgical operations, others' money (investments, inheritances), crises, transformation after evolution, death. It is in analogy with Scorpio and Pluto, and Mars to a lesser extent. It is a succedent and quite important house.\n\n%DYNAMIQUE_40% The Ninth House is the sphere of high studies, both physical and mental journeys (philosophy, spirituality), rebelliousness, changes of scenery, desire for dealing with the unknown. It is in analogy with Sagittarius and Jupiter. It is a cadent house, less important than the angular and succedent ones.\n\n%DYNAMIQUE_41% The Tenth House still called the Midheaven, is the highest point amidst the houses, at the top of the chart, in the South, and relates to destiny in general and career (and not daily work as meant by the Sixth House). The Midheaven represents our achievements and goals in the social sphere, our social position in society, and becomes more and more important as we get older. It is in analogy with Capricorn and Saturn. The Tenth House is the most important angular house along with the Ascendant. %TEXTES_41%\n\n%DYNAMIQUE_42% The Eleventh House is the sphere of friendship and protection, projects, search for social acceptance and security, collective and humanitarian actions. It is in analogy with Aquarius and Uranus, and Saturn to a lesser extent. It's a succedent and quite important house.\n\n%DYNAMIQUE_43% The Twelfth House is the sphere of hidden things, enemies, closed or remote places (hospital, prison, convent etc.), ordeals, secrecy, solitude, long-term illnesses but also sincere devotion and genuine compassion. It is in analogy with Pisces and Neptune.\n\n%DYNAMIQUE_44% The Vertex, sometimes called counter-Ascendant, is a fictitious point which is at the intersection of two great circles, the Ecliptic and the great vertical circle (Prime Vertical) in the West of the birthplace, linking the East, the Zenith, the West, and the Nadir. It is always located in the West of the chart around the Descendant. It is the chart's fifth angle, so to speak, less important than the other angles. Its interpretation is controversial, because certain astrologers pay no attention to it. The Vertex is sometimes considered to be the second Descendant because, like the latter, it is related to communication and exchanges. It has to do with associations and fated encounters, those that are not chosen, and reveals the type of sensitivity and reactivity we have in our dealings with other people: a refined and tolerant way in Libra, straightforward and spontaneous in Aries, etc. %TEXTES_44%\n\n%DYNAMIQUE_45% The East Point is a fictitious point at the intersection of two great circles, the Ecliptic and the great vertical circle (Prime Vertical) in the East of the birthplace, linking the East, the Zenith, the West, and the Nadir. It is always located in the East of the chart, around the Ascendant. The East Point is sometimes considered to be a second Ascendant, less important, but also related to how one is seen by other people, and to how one expresses one's personality. %TEXTES_45%\n\n%DYNAMIQUE_46% Cupido is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Cupido, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points. On the upside, Cupido is related to socialisation, the arts, and marital life. On the downside, it indicates vanity, addiction to pleasures, and being strongly influenced by groups of people. %TEXTES_46%\n\n%DYNAMIQUE_47% Hades is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Hades, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points. Hades corresponds to intellectual rigour, service rendered to people, the purpose of being useful. On the downside; it leads to carelessness, indifference, apathy, and mess. %TEXTES_47%\n\n%DYNAMIQUE_48% Zeus is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Zeus, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points. Zeus is related to creativity, as well as to organisational and leadership capacities. On the downside, it may lead to aggressiveness and to excessive militancy. %TEXTES_48%\n\n%DYNAMIQUE_49% Kronos is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Kronos, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points. Kronos is related to authority and cleverness. In tough aspect, it may make the person conceited, presumptuous, or elitist. %TEXTES_49%\n\n%DYNAMIQUE_50% Apollon is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Apollon, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points. Apollon is related to the ability to synthesise, as well as to broad-mindedness, and fame. In difficult aspect, it may bring about superficiality or extravagance. %TEXTES_50%\n\n%DYNAMIQUE_51% Admetos is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Admetos, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points. Admetos is related to the deepness of the mind, asceticism, simplicity, and analytical mind. In tough aspect, it may make the person nit-picking, inflexible, and narrow-minded. %TEXTES_51%\n\n%DYNAMIQUE_52% Vulcanus is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Vulcanus, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points. Vulcanus, sometimes said to be the higher octave of Saturn, provides strength to improve collective relations, to structure things, to be efficient, and to get straight to the point. On the downside, he may bring about arrogance and scattered efforts. %TEXTES_52%\n\n%DYNAMIQUE_53% Poseidon is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Poseidon, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points. Poseidon brings about wisdom, a clear mind, and sometimes spirituality. On the downside, it may make the person dogmatic, manipulative, or out of touch with reality. %TEXTES_53%\n\n%DYNAMIQUE_54% Proserpina, sometimes referred to as Persephone, is a trans-Plutonian hypothetical planet. N.B.: numerous astrologers believe neither in the influence of Proserpina, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points. Proserpina is related to mysteries, revival and reconstruction, as well as cycles. She enriches the unconscious, and gives the possibility to combine modern life with spirituality, the East with the West, and mysticism with concrete life. %TEXTES_54%\n\nAstrology chart of Katie Ledecky Horoscope and birth chart of Katie Ledecky, born March 17, 1997 (time unknown), Washington (DC) (United States) 5° 35' 29° 24' 7° 24' 12° 18' 23° 08' 27° 09' 3° 03' 8° 36' 16° 26' 21° 34' 26° 37' 28° 45'\n\nDisplay Parameters Aspects and planets positions Display minor aspects Display Lilith and North Node aspects Display asteroids Display asteroids aspects Display hypothetical planets Calculation Parameters Tropical Chart Sidereal Chart True North Node Mean North Node True Lilith Mean Lilith Permalink URL BBCode\n\nBiography of Katie Ledecky (excerpt) Kathleen Genevieve Ledecky (born March 17, 1997) is an American distance swimmer, Olympic gold medalist, and world record holder. In her Olympic debut at the 2012 Summer Olympics as a 15-year old, Ledecky won the gold in the 800-meter freestyle with the second-fastest performance of all-time. She is the current world record holder in the 1500-meter freestyle (long course) and American record holder in the 400- and 800-meter freestyle (long course).\n\n\n\nPersonal life\n\n\n\nLedecky was born in Washington, D.C., the daughter of David and Mary Gen Ledecky. David Ledecky's father came to the United States from the Czechoslovakia in 1947. Her mother swam for the University of New Mexico.\n\nAstrological portrait of Katie Ledecky (excerpt)\n\nDisclaimer: these short excerpts of astrological charts are computer processed. They are, by no means, of a personal nature. This principle is valid for the 63,451 celebrities included in our database. These texts provide the meanings of planets, or combination of planets, in signs and in houses, as well as the interpretations of planetary dominants in line with modern Western astrology rules. Moreover, since Astrotheme is not a polemic website, no negative aspect which may damage the good reputation of a celebrity is posted here, unlike in the comprehensive astrological portrait.\n\nIntroduction\n\nHere are some character traits from Katie Ledecky's birth chart. This description is far from being comprehensive but it can shed light on his/her personality, which is still interesting for professional astrologers or astrology lovers.\n\nIn a matter of minutes, you can get at your email address your astrological portrait (approximately 32 pages), a much more comprehensive report than this portrait of Katie Ledecky.\n\n\n\n\n\nN.B.: as this celebrity's birth time is unknown, the chart is arbitrarily calculated for 12:00 PM - the legal time for his/her place of birth; since astrological houses are not taken into account, this astrological profile excerpt is less detailed than those for which the birth time is known.\n\nThe dominant planets of Katie Ledecky\n\nWhen interpreting a natal chart, the best method is to start gradually from general features to specific ones. Thus, there is usually a plan to be followed, from the overall analysis of the chart and its structure, to the description of its different character traits.\n\nIn the first part, an overall analysis of the chart enables us to figure out the personality's main features and to emphasize several points that are confirmed or not in the detailed analysis: in any case, those general traits are taken into account. Human personality is an infinitely intricate entity and describing it is a complex task. Claiming to rapidly summarize it is illusory, although it does not mean that it is an impossible challenge. It is essential to read a natal chart several times in order to absorb all its different meanings and to grasp all this complexity. But the exercise is worthwhile.\n\nIn brief, a natal chart is composed of ten planets: two luminaries, the Sun and the Moon, three fast-moving or individual planets, Mercury, Venus and Mars, two slow-moving planets, Jupiter and Saturn, and three very slow-moving planets, Uranus, Neptune and Pluto. Additional secondary elements are: the Lunar Nodes, the Dark Moon or Lilith, Chiron and other minor objects. They are all posited on the Zodiac wheel consisting of twelve signs, from Aries to Pisces, and divided into twelve astrological houses.\n\nThe first step is to evaluate the importance of each planet. This is what we call identifying the dominant planets. This process obeys rules that depend on the astrologer's sensitivity and experience but it also has precise and steady bases: thus, we can take into account the parameters of a planet's activity (the number of active aspects a planet forms, the importance of each aspect according to its nature and its exactness), angularity parameters; (proximity to the four angles, Ascendant, Midheaven, Descendant and Imum Coeli or Nadir, all of them being evaluated numerically, according to the kind of angle and the planet-angle distance) and quality parameters (rulership, exaltation, exile and fall). Finally, other criteria such as the rulership of the Ascendant and the Midheaven etc. are important.\n\nThese different criteria allow a planet to be highlighted and lead to useful conclusions when interpreting the chart.\n\nThe overall chart analysis begins with the observation of three sorts of planetary distributions in the chart: Eastern or Western hemisphere, Northern or Southern hemisphere, and quadrants (North-eastern, North-western, South-eastern and South-western). These three distributions give a general tone in terms of introversion and extraversion, willpower, sociability, and behavioural predispositions.\n\nAdvertisements\n\nThen, there are three additional distributions: elements (called triplicity since there are three groups of signs for each one) - Fire, Air, Earth and Water - corresponding to a character typology, modality (or quadruplicity with four groups of signs for each one) - Cardinal, Fixed and Mutable - and polarity (Yin and Yang).\n\nThere are three types of dominants: dominant planets, dominant signs and dominant houses. The novice thinks astrology means only \"to be Aries\" or sometimes, for example, \"to be Aries Ascendant Virgo\". It is actually far more complex. Although the Sun and the Ascendant alone may reveal a large part of the character - approximately a third or a half of your psychological signature, a person is neither \"just the Sun\" (called the sign) nor just \"the first house\" (the Ascendant). Thus, a particular planet's influence may be significantly increased; a particular sign or house may contain a group of planets that will bring nuances and sometimes weaken the role of the Ascendant, of the Sun sign etc.\n\nLastly, there are two other criteria: accentuations (angular, succedent and cadent) which are a classification of astrological houses and types of decanates that are occupied (each sign is divided into three decanates of ten degrees each). They provide some additional informations.\n\nThese general character traits must not be taken literally; they are, somehow, preparing for the chart reading. They allow to understand the second part of the analysis, which is more detailed and precise. It focuses on every area of the personality and provides a synthesis of all the above-mentioned parameters according to sound hierarchical rules.\n\nWarning: when the birth time is unknown, which is the case for Katie Ledecky, a few paragraphs become irrelevant; distributions in hemispheres and quadrants are meaningless, so are dominant houses and houses' accentuations. Therefore, some chapters are removed from this part.\n\nFor all paragraphs, the criteria for valuation are calculated without taking into account angles and rulerships of the Ascendant and of the Midheaven. The methodology retains its validity, but it is less precise without a time of birth.\n\nElements and Modes for Katie Ledecky\n\nThe predominance of Water signs indicates high sensitivity and elevation through feelings, Katie Ledecky. Your heart and your emotions are your driving forces, and you can't do anything on Earth if you don't feel a strong affective charge (as a matter of fact, the word \"feeling\" is essential in your psychology). You need to love in order to understand, and to feel in order to take action, to the detriment of a certain vulnerability against which you should learn to fight.\n\nKatie Ledecky, Fire is dominant in your natal chart and endows you with intuition, energy, courage, self-confidence, and enthusiasm! You are inclined to be passionate, you assert your willpower, you move forward, and come hell or high water, you achieve your dreams and your goals. The relative weakness of this element is the difficulty to step back or a kind of boldness that may prompt you to do foolish things.\n\nThe twelve zodiacal signs are split up into three groups or modes, called quadruplicities, a learned word meaning only that these three groups include four signs. The Cardinal, Fixed and Mutable modes are more or less represented in your natal chart, depending on planets' positions and importance, and on angles in the twelve signs.\n\nThe Mutable mode is the most emphasized one in your natal chart, Katie Ledecky, which indicates a mobile character that is curious and thirsty for new experiences and evolution. You are lively and flexible, and you like to react quickly to solicitations, but don't confuse mobility with agitation, since this is the danger with this configuration - and with you, stagnation is out of the question. Security doesn't matter as long as you are not bored. You optimize, you change things, you change yourself... all this in a speedy way.\n\nAdvertisements\n\nDominants: Planets, Signs and Houses for Katie Ledecky\n\nThe issue of dominant planets has existed since the mists of time in astrology: how nice it would be if a person could be described with a few words and one or several planets that would represent their character, without having to analyse such elements as rulerships, angularities, houses, etc!\n\nThe ten planets - the Sun throughout Pluto - are a bit like ten characters in a role-play, each one has its own personality, its own way of acting, its own strengths and weaknesses. They actually represent a classification into ten distinct personalities, and astrologers have always tried to associate one or several dominant planets to a natal chart as well as dominant signs and houses.\n\nIndeed, it is quite the same situation with signs and houses. If planets symbolize characters, signs represent hues - the mental, emotional and physical structures of an individual. The sign in which a planet is posited is like a character whose features are modified according to the place where he lives. In a chart, there are usually one, two or three highlighted signs that allow to rapidly describe its owner.\n\nRegarding astrological houses, the principle is even simpler: the twelve houses correspond to twelve fields of life, and planets tenanting any given house increase that house's importance and highlight all relevant life departments: it may be marriage, work, friendship etc.\n\nIn your natal chart, Katie Ledecky, the ten main planets are distributed as follows:\n\nThe three most important planets in your chart are Uranus, Venus and the Moon.\n\nUranus among your dominant planets: just like Neptune and Pluto, Uranian typology is less clearly defined than the so-called classical seven planets that are visible to the naked eye, from the Sun to Saturn. However, it is possible to associate your Uranian nature with a few clear characteristics: Uranus rhymes with independence, freedom, originality, or even rebelliousness and marginality, when things go wrong...\n\nUranus is Mercury's higher octave and as such, he borrows some of its traits of character; namely, a tendency to intellectualize situations and emotions with affective detachment, or at least jagged affectivity.\n\nTherefore, you are certainly a passionate woman who is on the lookout for any kind of action or revolutionary idea, and you are keen on new things. Uranians are never predictable, and it is especially when they are believed to be stable and well settled that... they change everything - their life, partner, and job! In fact, you are allergic to any kind of routine, although avoiding it must give way to many risks.\n\nWith Venus among your dominant planets, one of your first reflexes is... to please! Your look, your charm, and your seduction are omnipresent elements in your behaviour.\n\nYour approach to things is connected to your heart, and for you, no real communication can flow if your interlocutors exude no sympathy or warmth. Cold and logical reasoning, clear thoughts and good sense are not important to you: if there is no affective bond with your environment, no connection can be established with the Venusian that you are, and nothing happens.\n\nYou have a strong artistic side, and you never neglect subjective but clear concepts such as pleasure, beauty, and also sensuality. However, sometimes to the detriment of efficiency, durability, logic, and... detachment.\n\nThe Moon is one of the most important planets in your chart and endows you with a receptive, emotive, and imaginative nature. You have an innate ability to instinctively absorb atmospheres and impressions that nurture you, and as a result, you are often dreaming your life away rather than actually living it.\n\nOne of the consequences of your spontaneity may turn into popularity, or even fame: the crowd is a living and complex entity, and it always appreciates truth and sincerity rather than calculation and total self-control.\n\nAs a Lunar character, you find it difficult to control yourself, you have to deal with your moods, and you must be careful not to stay passive in front of events: nothing is handed on a plate, and although your sensitivity is rich, even richer than most people's, you must make a move and spare some of your energy for... action!\n\nIn your natal chart, the three most important signs - according to criteria mentioned above - are in decreasing order of strength Pisces, Cancer and Aries. In general, these signs are important because your Ascendant or your Sun is located there. But this is not always the case: there may be a cluster of planets, or a planet may be near an angle other than the Midheaven or Ascendant. It may also be because two or three planets are considered to be very active because they form numerous aspects from these signs.\n\nThus, you display some of the three signs' characteristics, a bit like a superposition of features on the rest of your chart, and it is all the more so if the sign is emphasized.\n\nPisces is among your dominant signs and endows your personality with unlimited sources of emotions, dreams, imagination, and sensitivity, to the extent that you literally swim in a cloudy ocean of delightful impressions. These impressions are so intense an"}, {"url": "https://wikiabio.com/katie-ledecky/", "page_content": "Katie Ledecky is a well-known Swimmer who was born on March 17, 1997 in Washington, DC, United States. With an exceptional talent and skillset, Katie Ledecky has established a successful career over the years, earning widespread recognition and acclaim. As of now, Katie Ledecky’s estimated net worth stands at around $5 million.\n\nIf you’re interested in learning more about Katie Ledecky’s life and career, you can explore their biography, which includes details such as age, height, physical stats, family, dating life, and career updates. Additionally, stick around until the end to uncover some fascinating insider information and little-known trivia about Katie Ledecky.\n\nReal Name Katie Ledecky Date of Birth March 17, 1997 Age 26 years Place of Birth Washington, DC, United States Birthday March 17, 1997 Profession Swimmer Zodiac Sign Pisces\n\nKatie Ledecky Biography Freestyle swimmer who received the 800m gold at the 2012 London Olympics earlier than the age of 15, with the second quickest efficiency ever.\n\nFamily Life of Katie Ledecky She has an older brother named Michael, who is additionally a swimmer.\n\nKatie Ledecky Net Worth Katie Ledecky is one of the wealthiest and most popular Swimmer in the industry. In accordance to several reputable sources like Forbes and Business Insider, Katie Ledecky’s estimated net worth is around $5 million. Katie Ledecky has established a successful career in Swimmer, which has become their primary source of income. Through hard work, dedication, and exceptional talent, Katie Ledecky has achieved great success and earned a reputation as one of the most skilled professionals in the industry. Their accomplishments in this field have led to significant financial gains and opened up exciting new opportunities for growth and success. While the exact salary and earnings are currently unknown, we are diligently working to obtain this information from reliable sources and will update it as soon as possible. As for Katie Ledecky’s living situation, they maintain a low-key lifestyle in a private residence. Sadly, there is currently no information available regarding Katie Ledecky’s car collection. Net Worth $5 million Salary Under Review Source of Income Swimmer Cars Unavailable House Private House\n\nKatie Ledecky Height, Weight, Measurements While Katie Ledecky is widely regarded as a person with striking looks, an attractive face, and a dynamic personality, it is their liveliness and rakish demeanor that truly set them apart. Katie Ledecky maintains a svelte physique with wonderful body proportions, and their stunning and intriguing eyes add to their unique charm. At this time, the exact measurements of Katie Ledecky’s height, weight, shoe size, and dress size are not available. Nonetheless, we are committed to providing accurate and up-to-date information and will update this section as soon as it becomes available. Height Not Available Weight Not Available Measurements Not Available Eye Color Not Available Hair color Not Available\n\nSocial Media Presence With their exceptional talent and skill set, Katie Ledecky has garnered widespread attention and admiration from fans around the world. Their immense popularity is reflected in their large following across various social media platforms, including Instagram, Twitter, and Facebook. Katie Ledecky is highly active on these popular social media sites, where they engage with fans and share updates on their latest projects and ventures. Instagram Not Available Facebook Not Available Twitter Not Available Wikipedia Not Available Imdb Not Available"}, {"url": "https://deadorkicking.com/katie-ledecky-dead-or-alive/", "page_content": "How Old Is Katie Ledecky? Katie Ledecky Birthday\n\nKatie Ledecky was born on March 17, 1997 and is 26 years old now.\n\nBirthday: March 17, 1997\n\nHow Old - Age: 26\n\nKatie Ledecky Death Fact Check\n\nKatie is alive and kicking and is currently 26 years old.\n\nPlease ignore rumors and hoaxes.\n\nIf you have any unfortunate news that this page should be update with, please let us know using this form .\n\nKatie Ledecky - Biography\n\nKathleen Genevieve Ledecky (born March 17, 1997) is an American competition swimmer, Olympic gold medalist, nine-time world champion, and current world record holder in multiple events. She is the current world record-holder in the 400-, 800-, and 1,500-meter freestyle (long course). She also holds the fastest-ever times in the 500-, 1000-, and 1,650-yard freestyle events."}, {"url": "https://biographymask.com/katie-ledecky/", "page_content": "Katie Ledecky is the most decorated female swimmer in the history of the Olympics in terms of the number of gold medals. This genius American swimmer Katie Ledecky has participated and bagged many awards and medals in international competitions around the globe. Having won 7 Olympic gold medals and 15 world championship gold medals, she is considered as greatest female swimmer of all time.\n\nEarly Life\n\nKatie Ledecky was born on March 17, 1997, in Bethesda, Maryland, United States of America. It makes her 26 years old today. Her full name is Kathleen Genevieve Ledecky. She was the second child of David Ledecky and Mary Hagan. His father David is a lawyer and his mother Mary Gen is a former collegiate swimmer and hospital administrator. She has an elder brother Michael. Astrologically, her zodiac is Pisces and she follows Christianity. She holds an American nationality and belongs to the Caucasian ethnicity.\n\nLooking toward her academic journey, she completed her schooling in a local school in her hometown. And later enrolled in Georgetown University. He even went to Stanford University.\n\nKatie Ledecky – Net Worth 2023\n\nKatie earns a good fortune and is living a luxurious life. Her main source of income is being a professional swimmer, performing at club levels in national competitions along with international tournaments as well. Apart from it, she is also active in charities, such as Catholic Charities, Shepherd’s Table, Bikes for the World, and Wounded Warriors. Her total net worth is about $4 million US Dollars as of 2021.\n\nProfessional Life\n\nAt a young age, she has been able to establish herself as a successful swimmer with a legacy. She actually started at an age of 6, following in the footsteps of her older brother Michael. She had made lots of appearances in high-profile competitions both in national and international arenas. Her first international break came in the year 2012.\n\nThe year 2012\n\nAfter competing at the local and national levels, she set the target to go among other countries around the globe. She exploded with flying colors in the 2012 Olympic trials and became one of the youngest swimmers at the meet. The 15-year-old secured her chance in the 2012 Olympic games. Quite surprisingly, despite her age, she won gold in her debut international tournament. To add to it, she even broke the long-standing national record set by Janet Evans.\n\nThe year 2013\n\nThis year saw her performing and setting world records at the 2013 FINA World Championships in Barcelona. She set records in both 800 and 1500 freestyles. Besides it, she set an American record in the 400 too. She won gold in the 4×200 freestyle relay.\n\nThe year 2014\n\nKatie broke the world record in 400 freestyle in won 200 and 800 freestyle at U.S. summer nationals. She made an appearance at the 2014 Pan Pacific Championships, where she won 5 gold medals (200 freestyle, 400 freestyle, 800 freestyle, 1500 freestyle, 800 freestyle relay) and became the first female to win four individuals.\n\nThe year 2015\n\nThe year too continued for her shattering records hither and thither. She competed at the 2015 World Championships in Kazan, Russia. She won 400 freestyle and 1500 freestyle and even set another world record in it. Along with US teammates, she won another gold medal on the 800m free relay. Further, she was victorious in 200 freestyle too.\n\nThe year 2016\n\nKatie was undoubtedly sure to start in the women’s US swimming team. She won all 200m, 400m, and 800m freestyle in trials for Rio Olympics 2016. In the Olympics, she shattered yet another record in 400m freestyle and won it. She helped her team to win 600 meters too in front of Australia.\n\nThe year 2017\n\nThis year saw her performing at the 2017 FINA World Championships. She won gold in 400m freestyle, 800m, and 1500m freestyle in the competition. She also won first silver in a major international championship in a 200m freestyle battle. The American teams strike gold again together in the 4x200m freestyle relay. The same year she appeared in Pac-12 Championships and NCAA championships too.\n\nThe year 2018\n\nKatei performed at the 2018 U.S. National Championships and Pan Pacific Championships. She won 800m freestyle and 200m freestyles in national championships. In Pan Pacific Championship, she won 200m freestyle, 400, and 800 freestyle championships. Moreover, she also bagged a silver in the competition with her team. The year also saw her being SwimSwam’s 2018 US Female Swimmer of the Year along with World Female Swimmer of the Year as well.\n\nThe year 2019-2021\n\nKatie performed in the 2019 FINA World Championships. The tournament saw her marking her first loss in the final since 2012 and settling for silver in 400 freestyle. Later in 2021, she participated in Tokyo Olympics after giving a fine performance in the trial. There she earned silver in the 400m freestyle. She also won silver 4×200 free relay, behind China. Moreover, she won gold in the 800m freestyle final making her the most decorated female swimmer in Olympic history.\n\nPersonal Life\n\nKatie Ledecky is a very ambitious and goal-orientated person. Her insatiable appetite for swimming has led her to achieve a lot more previously also and will be achieved in the coming future too. For now, talking about her personal life, she has not disclosed much about herself. She might be unmarried and single. She is straight regarding gender choices. Further, she does not have any children also. The swimming genius has never been involved in any kind of controversy too during this time.\n\nBody Measurements\n\nKatie has built a strong physique. Apart from it, she does have a beautiful appearance too. The swimmer has a height of 5 feet and 11 inches. Her weight is 55 kg. Her total body measurement is about 34-25-35 inches. The color of her hair is blonde and she has hazel green colored eyes.\n\nKatie Ledecky – Social Media\n\nKatie is also active on social media as well. Sports enthusiasts around the globe, especially swimmers follow her. She has a Facebook account under her own name with 254k followers. She further has Instagram account @katieledecky which is followed by 573k followers. Similarly, her Twitter account @katieledecky is followed by 193.1k followers."}, {"url": "https://www.sunsigns.org/famousbirthdays/profile/katie-ledecky/", "page_content": "Katie Ledecky was born on March 17, 1997. She is an American swimmer. She is famous because she is a five-time Olympic medallist. She is the record holder in the women’s 400-800 and 1500 metre freestyle.\n\nEarly life\n\nKatie Ledecky was born Kathleen Genevieve Ledecky on March 17, 1997, in Washington DC, United States of America. She was born to Mary Gen and David Ledecky. She started swimming at the age of six. She was brought up alongside her brother Michael. Her mother was also a swimmer for the University of New Mexico. She attended Little Flower School. In 2015, she graduated from Stone Ridge School of the Sacred Heart. Her swimming career officially began in high school. She set the American and US Open Record two times in the 500 yard freestyle. She also set the record twice at the national, high school record in the 200 yard freestyle.\n\nadvertisement advertisement\n\n\n\n\n\n\n\nCareer\n\nIn 2012, Katie Ledecky made her senior swimming debut at the 2012 United States Olympic Trials. She entered the 200, 400 and 800 metre freestyles. She won the 800 metre becoming the youngest member of the United States Team. In the 2012, London Games she broke the world record in the 800m winning the gold medal. She received training from her coach Bruce Gemmell. In 2013, she set world records in the 800 metre and 1500 metre freestyles winning four gold medals at the 2013 FINA World Championships. In 2014, she won four gold medals at the 2014 Pan Pacific Swimming Championships.\n\nIn 2015, Katie Ledecky was the first woman to win the 200, 400, 800 and 1500 metre freestyles in the FINA World Championships. She has been honoured as the FINA swimmer of the year. She is also the USOC’s Olympic Sports Woman of the Year. She is also a three time Golden Google Female Athlete of the Year. In 2016, she set the World Record in the 800 metre freestyle at the Arena Pro Swim Series.\n\nAt the 2016 Rio Olympics, she won gold medal in the women’s 400 metre freestyle. She also assisted her teammates in winning a silver medal in the women’s 4*100 metre freestyle relay. She also won gold in the 200 metre freestyle race. She also helped her teammates in winning the gold medal in the 4*200 metre freestyles. She also smashed the world record in the 800 metre individual freestyle.\n\nKatie Ledecky became crowned as the second woman to win three individual freestyle events at the Single Olympic Games. In 2017, she won the 200, 400 and 800 metre freestyles at the 2017 World Aquatics Championships. In the same year she won five gold medals and one silver medal in the World Aquatics Championships. She has won many international swimming competitions in her lifetime to date.\n\nadvertisement advertisement\n\nAwards and Achievements\n\nKatie Ledecky has won awards such as the Swimming World Swimmers of the Year Award, USA Swimming Athlete of the Year, Golden Goggle Female Race of the Year, Honda Sports Awards Winner for NCAA Division I Swimming and Diving, and she won the Honda Cup among other awards.\n\nadvertisement advertisement\n\nPersonal life\n\nKatie Ledecky is currently not married. She is twenty years old. She continues swimming with the help of her coaches Bruce Gemmell and Greg Meehan."}, {"url": "https://www.idolbirthdays.net/katie-ledecky", "page_content": "Does Katie Ledecky Dead or Alive?\n\nAs per our current Database, Katie Ledecky is still alive (as per Wikipedia, Last update: May 10, 2020).\n\n🎂 Katie Ledecky - Age, Bio, Faces and Birthday\n\nCurrently, Katie Ledecky is 26 years, 2 months and 25 days old. Katie Ledecky will celebrate 27rd birthday on a Sunday 17th of March 2024. Below we countdown to Katie Ledecky upcoming birthday.\n\nDays Hours Minutes Seconds\n\nPopular As Katie Ledecky Occupation Swimmer Age 26 years old Zodiac Sign Pisces Born March 17, 1997 (DC) Birthday March 17 Town/City DC Nationality DC\n\n🌙 Zodiac\n\nKatie Ledecky’s zodiac sign is Pisces. According to astrologers, Pisces are very friendly, so they often find themselves in a company of very different people. Pisces are selfless, they are always willing to help others, without hoping to get anything back. Pisces is a Water sign and as such this zodiac sign is characterized by empathy and expressed emotional capacity.\n\n🌙 Chinese Zodiac Signs\n\nKatie Ledecky was born in the Year of the Ox. Another of the powerful Chinese Zodiac signs, the Ox is steadfast, solid, a goal-oriented leader, detail-oriented, hard-working, stubborn, serious and introverted but can feel lonely and insecure. Takes comfort in friends and family and is a reliable, protective and strong companion. Compatible with Snake or Rooster.\n\nSome Katie Ledecky images\n\nAbout\n\nFreestyle Swimmer who won the 800m gold at the 2012 London Olympics before the age of 16, with the second fastest performance ever.\n\nBefore Fame\n\nShe learned to swim at age 6 and eventually joined the Nation's Capital Swim Club.\n\nTrivia\n\nShe broke the national record for the 800 meter freestyle at the 2012 London games.\n\nFamily Life\n\nShe has an older brother named Michael, who is also a Swimmer.\n\nAssociated With\n\nShe, like Michael Phelps, won a gold medal for the United States at the 2012 London Olympics.\n\nKatie Ledecky trend"}], "Katie Ledecky is an American competitive swimmer.": [{"url": "https://olympics.com/en/athletes/katie-ledecky", "page_content": "Biography\n\nKatie Ledecky is the most decorated of female swimmer in history with six individual Olympic gold medals and 14 individual long course world titles to date.\n\nThe Washington athlete is also holds the 800m and 1500m freestyle world records, and owns 18 of the 20 fastest 1500m freestyle times ever.\n\nHer Olympic journey began, aged 15, with a surprise 800m free gold medal at London 2012. She went on to win four golds at the 2014 Worlds.\n\nGoing into the Rio 2016 Games expectations were high, and Ledecky didn’t disappoint. She bagged the 200m, 400m, 800m and 4x200m freestyle titles to finish as the second most-decorated athlete at Rio 2016 after Michael Phelps.\n\nIn Tokyo, she edged her closest rival Ariarne Titmus to land another 800m Olympic gold medal, before winning the inaugural women's 1500m freestyle title.\n\nIt would take a brave individual to bet against Ledecky adding more Olympic golds to her resume at Paris 2024, and given her relatively young age, from pushing through to a home Games at Los Angeles 2028."}, {"url": "https://www.biography.com/athletes/katie-ledecky", "page_content": "(1997-)\n\nWho Is Katie Ledecky?\n\nBorn in Maryland in 1997, Katie Ledecky began swimming competitively at age six. After earning a berth on the U.S. Olympic team at age 15, she set an American record in the 800-meter freestyle to win a gold medal at the 2012 Summer Games. Ledecky has since shattered world records across an array of freestyle events ranging from 400 to 1,500 meters. At the 2016 Olympic Games in Rio, she dominated the pool, winning gold medals in the 400-meter freestyle in world record time, the 200-meter freestyle and the 4x200 meter freestyle relay, and silver in the 4x100 meter freestyle relay. She also broke the world record, winning gold in the 800-meter freestyle.\n\nEarly Years and Competitive Career\n\nKathleen Genevieve \"Katie\" Ledecky was born on March 17, 1997, in Bethesda, Maryland. The second child of David, a lawyer, and Mary Gen, a former collegiate swimmer and hospital administrator, she began swimming competitively at the Palisades Swim & Tennis Club at age six, alongside her older brother, Michael.\n\nWith her seemingly insatiable appetite for pool activity, Ledecky became a standout at the Nation’s Capital Swim Club under coach Yuri Suguiyama. In 2011, Suguiyama began instructing Ledecky to kick more aggressively while racing, a technique commonly used by elite men's swimmers but rarely seen on the women's side. That summer, before the start of her freshman year at Stone Ridge School of the Sacred Heart, she dominated the U.S. Junior Championships with wins in the 400-, 800- and 1,500- meter freestyle events.\n\n2012 London Olympics Breakout Star\n\nLedecky made her senior debut at the 2012 United States Olympic Trials, entering the 200-, 400- and 800-meter freestyles. The lack of top-level experience proved to be no obstacle for the 15-year-old, who surged to an eye-opening win in the 800m to become the youngest member of the U.S. team.\n\nHer momentum continued through the competition at the 2012 London Games, where Ledecky paced her heat in the 800m. She then blew the competition out of the water in the final, breaking Janet Evans's 23-year-old American record with a time of 8:14.63 to win the gold medal.\n\nAfterward, Ledecky displayed the easy confidence of someone who expected to win. “I knew if I put my mind to it, I could do it,” she said. “I wasn’t intimidated at all.”\n\nContinued Swimming Success\n\nUnder the guidance of new coach Bruce Gemmell, Ledecky showed that her 2012 Olympic performance was merely the tip of the iceberg. Proving capable of winning both middle- and long-distance events, she established world records in the 800- and 1,500-meter freestyles en route to four gold medals at the 2013 FINA World Championships. She claimed another four golds at the 2014 Pan Pacific Swimming Championships, and at the 2015 FINA World Championships, she became the first woman to win the 200- 400- 800- and 1500-meter freestyles in a major competition. Her victories often coming via huge margins, Ledecky has been honored as the FINA Swimmer of the Year, the USOC's Olympic SportsWoman of the Year and a three-time Golden Goggle Female Athlete of the Year.\n\nThe champion swimmer was accepted to Stanford University prior to her graduation from Stone Ridge in 2015, but she elected to defer enrollment to focus on training for the 2016 Summer Olympics. Proving to be in peak form well before the start of Olympic competition, she set her 11th world record with a time of 8:06.68 in the 800m free at the Arena Pro Swim Series in January 2016.\n\nAdditionally, Ledecky headed into the summer as the world-record holder in the 400- and 1,500-meter freestyles. Unbeaten in all major international competition, she was expected to add to her already impressive gold medal count and become one of the American team's most celebrated Olympians by the close of the 2016 Rio Games.\n\n2016 Rio Olympic Games\n\nLedecky did not disappoint in Rio. In her first individual event, the women's 400-meter freestyle, she won gold, soaring past the competition early on and finishing with a time that was two seconds better than her own world record and four seconds more than her second place finisher. She also helped her teammates win silver in the Women's 4x100 meter freestyle relay. She went on to win gold again in the 200-meter freestyle race, edging out Swedish swimmer Sarah Sjostrom, who won silver. After the grueling race, Ledecky spoke about finding the strength to grab the gold. “I did come pretty close to throwing up during that last 50,” Ledecky said. “I knew I just needed to get my hand on the wall and be done. Everything was hurting . . .I just had to dig deep and do my own thing. I had no idea whether I touched first . . .I was done when I touched the wall. I knew I’d given it everything I had to.\n\nShe continued to dominate as the anchor in the 4x200 meter freestyle relay, winning the gold medal with teammates Allison Schmitt, Leah Smith and Maya Dirado. She also defended her 2012 world title in the 800-meter individual freestyle in a stunning victory, finishing the race at 8:04:79 and smashing the world record. With this gold win, Ledecky became the second woman to win three individual freestyle events at a single Olympic Games, a feat also accomplished by Debbie Meyer at the 1968 Olympics in Mexico City.\n\n2021 Tokyo Olympics\n\nLedecky will compete at the 2021 Tokyo Olympics, swimming in the 200-meter freestyle, 400-meter freestyle, 800-meter freestyle and 1,500-meter freestyle, as well as the 4×200-meter freestyle relay.\n\nQUICK FACTS\n\nName: Katie\n\nBirth Year: 1997\n\nBirth date: March 17, 1997\n\nBirth State: Maryland\n\nBirth City: Bethesda\n\nBirth Country: United States\n\nGender: Female\n\nBest Known For: American swimmer Katie Ledecky won a gold medal at the 2012 Olympics before shattering numerous world records. She continued her winning streak at the 2016 Summer Olympics, earning four gold medals and one silver medal.\n\nIndustries\n\nSports\n\nAstrological Sign: Pisces\n\nSchools\n\nGeorgetown University\n\n\n\nStandford University\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Katie Ledecky Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/athlete/katie-ledecky\n\nAccess Date:\n\nPublisher: A&E Television Networks\n\nLast Updated: July 22, 2021\n\nOriginal Published Date: July 1, 2016\n\nQUOTES"}, {"url": "https://www.teamusa.org/usa-swimming/athletes/Katie-Ledecky", "page_content": "Name: Katie Ledecky\n\nSport: Swimming\n\nEvent(s): 200-meter freestyle, 400-meter freestyle, 800-meter freestyle, 1,500-meter freestyle\n\nHeight: 6-0\n\nDOB: 3/17/1997\n\nBirthplace: Washington, D.C.\n\nHometown: Bethesda, Md.\n\nHigh School: Stone Ridge School of the Sacred Heart (Bethesda, Md.) '15\n\nCollege: Stanford University '20, Psychology\n\nTeam/Club: Nation's Capital Swim Club/Stanford University\n\nCoach(es): Gregg Meehan\n\nOlympic Experience Three-time Olympian (2012, 2016, 2020); 10-time Olympic medalist (7 golds, 3 silvers)\n\nOlympic Games Tokyo 2020, gold (1,500-meter freestyle, 800-meter freestyle); silver (400-meter freestyle), silver (4x200-meter freestyle relay)\n\nOlympic Games Rio 2016, gold (200-meter freestyle, 400-meter freestyle, 800-meter freestyle, 4x200-meter freestyle); silver (4x100-meter freestyle)\n\nOlympic Games London 2012, gold (800-meter freestyle)\n\nWorld Championship Experience Most recent: 2019 – gold (800-meter freestyle); silver (400-meter freestyle, 800-meter freestyle relay)\n\nYears of participation: 2013, 2015, 2017, 2019\n\nMedals: 18 (15 golds, 3 silvers)\n\nGold – 2019 (800-meter freestyle); 2017 (400-meter freestyle, 800-meter freestyle, 1,500-meter freestyle, 4x100-meter freestyle, 4x200-meter freestyle); 2015 (200-meter freestyle, 400-meter freestyle, 800-meter freestyle, 1,500-meter freestyle, 4x200-meter freestyle); 2013 (400-meter freestyle, 800-meter freestyle, 1,500-meter freestyle, 4x200-meter freestyle)\n\nSilver - 2019 (400-meter freestyle, 800-meter freestyle relay); 2017 (200-meter freestyle)"}, {"url": "https://olympics.nbcsports.com/2018/12/21/tracy-caulkins-katie-ledecky-swimming/", "page_content": "Moments after Katie Ledecky disappeared from the front of the stage at last month’s Golden Goggles, her record sixth Female Swimmer of the Year trophy in tow, the woman long known as the greatest female swimmer in U.S. history approached the microphone.\n\n“Tray-cee Caul-kins, Tray-cee Caul-kins, Tray-cee Caul-kins,” crowd members chanted at USA Swimming’s annual dinner and awards event. Tracy Stockwell (née Caulkins) smiled and blew a kiss as her fellow presenter, NBC Sports swimming voice Dan Hicks, stepped to the side and bowed toward her.\n\nThey bantered before naming the next award’s candidates inside a Midtown Manhattan hotel ballroom.\n\n“For the last six years, we’ve been hearing Katie, Katie, Katie, Katie, Katie,” Stockwell said in jest. “I mean, she’s great, she’s great, but I’m just saying, will Katie ever set an American record in every stroke?”\n\n“True, but I don’t believe you ever won one of your races by more than 15 seconds,” Hicks replied.\n\n“OK, you got me there,” Stockwell said. “Only 9.5 seconds in the 400m IM in the Olympic final … but again, all four strokes.”\n\nStockwell ended the amusement there.\n\n“Katie, you know I love you,” she said. Hicks and Stockwell moved on to read the Male Swimmer of the Year candidates.\n\nIs Ledecky the greatest U.S. female swimmer in history?\n\nLongtime NBC Sports analyst Rowdy Gaines, a close friend of Stockwell’s on the 1980 and 1984 Olympic teams, introduced Stockwell as “simply the greatest” at a 2013 panel where the two iconic women met for the first time.\n\nBack then, Ledecky was just 16 years old and had competed at one Olympics (one gold medal) and one world championships (four gold medals).\n\nStockwell earned five golds and a silver at the 1978 World Championships, missed what would have been her first Olympics due to the Moscow boycott, then earned three golds at the 1984 Los Angeles Games.\n\nOther U.S. women earned more medals since, but none had the all-stroke mastery of Stockwell, who swept the medleys at the Olympics and worlds.\n\n“I love the bar-room talk of who the greatest is of any sport,” Gaines said. “It’s not a competition on the men’s side, so it’s nice to have a little battle back and forth about the greatest woman.”\n\nLedecky joined the discussion in the last Olympic cycle. She earned four titles in Rio and last year upped her biennial world championships gold-medal count to 14, most for a woman from any country.\n\nGranted, worlds were held every four years in Stockwell’s era, when swimmers rarely competed beyond college age.\n\n“I know some of the old guard might want to argue with me here, but [Ledecky] is the greatest female swimmer in history,” Gaines told the Golden Goggles crowd while helping auction a 24-by-36-inch painting of Ledecky training for $5,000. “Tracy Caulkins, I know, is like 1A.”\n\nNeither Stockwell nor Ledecky is of the public disposition to much care of owning the label. It’s for others to talk about, and the chatter is good for the sport.\n\n“It’s nice to be remembered. It’s a nice thing to include we has-beens, I guess,” Stockwell said with a laugh when asked about the debate. “I’m flattered that people would say I’m considered one of the greatest. It brings back a lot of good memories. It makes me proud of my versatility. Back then, at 21, when I finished swimming, that was considered old.”\n\nStockwell speaks with a mix of her native Nashville twang and an Australian accent from living in Queensland for nearly half of her 55 years. She met Aussie swimmer Mark Stockwell at the Los Angeles Games. She retired that year despite having one season of eligibility left at the University of Florida.\n\n“I kind of felt like I had done everything that I wanted,” she said. “I wasn’t really prepared to give it the effort that I had for so long, and I didn’t think that would be fair on me or the team.”\n\nThey married in 1991 and raised five children in Brisbane, the youngest now 15. Stockwell spent much of that time in roles championing women’s sports within Australia. She now serves on Swimming Australia’s board.\n\n“Part of the deal was, if I ever had to get back to the USA or Nashville, then I could,” said Stockwell, who also flies to Gainesville, to present a scholarship endowed in her name, and to Southern California or New York City for Golden Goggles, supporting USA Swimming. “Next year I will be half and half, 28 years in America and Australia 28 years.”\n\nStockwell realized that her allegiance was torn as she watched the famous 4x100m men’s freestyle relay at the 2000 Sydney Olympics. The air guitar-strumming Aussies handed the Americans their first defeat in the event in Olympic history.\n\n“People would ask me, who are you going to cheer for,” she said. “I was like, oh gosh, I hadn’t even thought about that. I kind of feel like I have two teams to cheer for.”\n\nOne child, son William, swims for Australia, ranking fourth in the nation in the 50m backstroke this year. It’s a different age from the complicated one that his mom dominated.\n\nShe swam against East Germans during the country’s state-sponsored doping days, missed what would have been her peak Olympics due to a boycott and then starred at the 1984 Games that those East Germans sat out.\n\n“Even though I probably had a shorter career than many swimmers, and we didn’t have the opportunity to go to the 1980 Olympics, to go to one Olympics was the highlight of my career and what I dreamed of since I was a little girl,” she said. “A lot of my friends who made the ‘80 team tried again in 1984 and didn’t make it or just missed out. I remember those Olympic Trials being quite emotional because of that. Now I see so many athletes are going to two or three or four Olympic Games, and I think isn’t that wonderful that they’ve got the support mechanisms. They’re not considered old and washed-up at 21 years of age.”\n\nWhen Gaines introduced Stockwell at that 2013 panel (titled “Swimming Through the Decades,” along with Janet Evans, Matt Biondi, Lenny Krayzelburg and Ledecky), he reeled off some of her accomplishments:\n\n63 American records, most by any swimmer in history\n\nYoungest athlete to win the Sullivan Award at age 15 in 1978\n\nOnly swimmer to have an American record in every stroke at the same time\n\nStockwell and Ledecky sat, separated by Krayzelburg, while the gold medalists compared eras and took questions from a small crowd.\n\n“I had followed her a bit and seen what she did in London,” Stockwell said of Ledecky, who at age 15 became the youngest U.S. Summer Olympic gold medalist in any sport in 16 years. “She was so young, and it kind of took me back to my career.\n\n“What really impressed me [at the panel] was how together she was for such a young athlete and how she was the whole package. Not only a great swimmer, but she spoke really well, was really well-balanced, nice, very smart. Just delightful.”\n\nStockwell caught up with Ledecky’s family at the 2014 Pan Pacific Championships in Australia.\n\nIn 2016, she flew to the States for the Honda Cup presentation to the top NCAA female athlete (another accolade: Stockwell is the only woman to win the Honda Cup twice outright).\n\nShe tacked on a trip to Omaha for the Olympic Trials. Ledecky had a dinner at the end of the event where she thanked her supporters.\n\n“I popped in to see her, congratulate her and wish her good luck [in Rio],” Stockwell said.\n\nAsked what stuns her the most about Ledecky, Stockwell says all of it. The dominance (winning the Olympic 800m free by 11 seconds), the range (world titles from 200m to 1500m) and what recently put Ledecky in the minds of many atop U.S. female swimming: the longevity.\n\nGaines noted that Ledecky’s golden streak is now at six years, matching the length of Stockwell’s elite international career from 1978 to 1984.\n\n“The ability to keep improving, because I know that’s a real challenge,” said Stockwell, who dropped to a pair of bronze medals at the 1982 Worlds. “I know that was hard for me. It’s easier on the way up, but once you get there and you’re Olympic champion and you’re world-record holder, you’re the standard and everyone’s aiming to beat you. It’s more difficult to stay motivated, to continue to improve.”\n\nIf there is still an argument that Caulkins is No. 1 and Ledecky 1A, it’s her conquering of all four strokes.\n\nIn track and field, the Olympic decathlon champion is known as the world’s greatest athlete. The 400m IM is swimming’s decathlon. Watch Caulkins’ 400m IM from the 1984 Olympics, and you will think of Ledecky as the camera pans out to fit the trailing swimmers in the frame.\n\n“Katie and Tracy are not equally versatile, but Katie is a lot more versatile than we give her credit for,” Gaines said. “I think if she concentrated on the 400m IM, she would be extremely dangerous [Ledecky briefly held the American record in the 400 IM in short-course yards while at Stanford]. The versatility also, even though it’s one stroke [freestyle], the versatility of that stroke is amazing.”\n\nThere’s another U.S. swimmer that Ledecky could try to chase in the greatest-ever debate. That’s Michael Phelps, whom Gaines can’t see being caught.\n\n“She would have to kind of repeat what she did in ‘16 at the next two Olympic Games,” he said. “She’d have to almost triple her number of world records (Ledecky has 14; Phelps 39).”\n\nVIDEO: Katie Ledecky, Elizabeth Beisel perform ‘Let it Be’ duet\n\nOlympicTalk is on Apple News. Favorite us!"}, {"url": "https://www.espn.com/olympics/story/_/id/30999141/us-swimmer-katie-ledecky-returns-competition-wins-race-texas", "page_content": "Like everyone else, Katie Ledecky was forced to shelve her plans when the coronavirus pandemic took hold. Instead of looking far into the future, the five-time Olympic champion swimmer switched to a more immediate mindset.\n\nForget that the four-year cycle leading to the 2024 Paris Olympics is already underway. Ledecky is still working toward making a big splash at this summer's delayed Tokyo Games.\n\n\"In some ways not traveling over the past year and just being able to train has been really good for me and something I hope will pay dividends,\" she said from Northern California in a recent virtual interview. \"I'm someone that really loves training. I kind of like the day-to-day of just going to work and putting in that work in the pool and eventually seeing the results.\"\n\nLedecky returned to national competition on Wednesday for the first time in a year, winning the 1,500-meter freestyle at the TYR Pro Swim Series meet in San Antonio.\n\nShe led by a half-pool length for most of the 30-lap race before touching in 15 minutes, 42.92 seconds. Ashley Twichell finished well back in second at 16:04.29.\n\n\"I didn't set too many expectations coming into this first race,\" Ledecky said afterward. \"I knew getting the first race out of the way would kind of be a milestone in this journey back into real racing.\"\n\nJordan Wilimovsky won the men's 1,500 in 15:15.28. He's already qualified for Tokyo in open-water competition.\n\nLedecky is among several big names diving back in with three months to go until the U.S. Olympic trials. Caeleb Dressel, Simone Manuel, double backstroke world-record holder Regan Smith and Ryan Lochte will swim over four days in the first single-site American meet since the pandemic began.\n\nAiming to make his fifth Olympic team, Lochte is entered in five events.\n\nLedecky is entered in her other usual events: the 200, 400 and 800 freestyle races. She's also set to swim the 50 and 100 free.\n\nHer Olympic schedule will focus on the 200, 400, 800 and 1,500, plus any relays. The 1,500 is a new women's event in Tokyo.\n\nLast March, when it was announced the Tokyo Olympics were postponed, Ledecky resumed classes at Stanford. She had planned to take the year off from school leading up to the Games; instead, she signed up for a full schedule of virtual classes in the spring and fall. She completed her psychology degree with a minor in political science.\n\n\"That was a great silver lining,\" she said.\n\nIn the early days of the pandemic, Ledecky scrambled to find a pool to train in after Stanford shut down its facilities. She and Manuel worked out in a backyard pool.\n\n\"The main focus for that period of time was just keeping a feel for the water,\" she said. \"We relied on each other and kept each other accountable and kept each other focused on our goals.\"\n\nLast fall, Stanford and rival California staged small meets that Ledecky swam in. In January, she competed against training partners in a mock meet that included preliminaries and finals to make it resemble a real competition.\n\n\"I feel like some of these experiences have built my confidence,\" she said. \"If I can swim fast in that kind of environment, I can swim fast at a big stage like Olympic trials or the Games when maybe we won't have spectators.\"\n\nLedecky isn't sure what awaits in Tokyo. She wants to know more details on how frequently the athletes will be tested for the coronavirus, where they'll be tested, and what the swimming venue will look and feel like.\n\n\"Of course, I want everyone to stay healthy,\" she said. \"I guess that would be my biggest fear, that there's a huge outbreak at the Games. I'm pretty confident in how Tokyo is managing it so far.\"\n\n\"I knew getting the first race out of the way would kind of be a milestone in this journey back into real racing,\" Katie Ledecky said on Wednesday. Maddie Meyer/Getty Images\n\nThen there's drug testing.\n\nThe U.S. resumed its usual testing procedures last fall. However, in the initial stages of the pandemic's national shutdown, Ledecky joined the U.S. Anti-Doping Agency's Project Believe 2020. It involved high-profile Olympians conducting urine and blood tests in their homes on their own while being observed virtually by USADA personnel.\n\n\"I was able to still get tested throughout last year,\" she said.\n\nBut Ledecky wonders about the rest of the world.\n\n\"I do have some concern,\" she said. \"There's some uncertainty there, in that I haven't really heard how much other countries are testing.\"\n\nLedecky is being tested for COVID-19 multiple times weekly during training. She practices social distancing and wears a mask -- all things she expects to do at a very unusual Olympics.\n\n\"Just trying to do as much as I can to prepare for those different things that may happen, the different protocols,\" she said. \"Just trying to learn what that may look like, so that come Tokyo, I'm not caught by surprise.\"\n\nWith her college degree in hand, Ledecky has spent time out of the pool visiting virtually with schools, club teams and children's hospitals. She hasn't seen most of her Maryland-based family since Christmas 2019.\n\nLedecky turns 24 later this month, putting her in the prime of her career. She doesn't feel cheated by losing precious time to a global pandemic, though.\n\n\"I don't feel like I missed out on some performances,\" she said. \"I had some good performances last year as we were leading into trials. I feel like I'm carrying that momentum to this year.\""}, {"url": "https://pantheon.world/profile/person/Katie_Ledecky", "page_content": "Katie Ledecky\n\nKathleen Genevieve Ledecky (born March 17, 1997) is an American competitive swimmer. She has won seven Olympic gold medals and 19 world championship gold medals, the most in history for a female swimmer. Ledecky's six individual gold medals at the Olympics, 14 individual gold medals at the World Aquatics Championships, and 22 overall medals at the World Aquatics Championships are records in women's swimming‌ . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Katie Ledecky has received more than 6,953,624 page views. Her biography is available in 43 different languages on Wikipedia (up from 39 in 2019) . Katie Ledecky is the 176th most popular swimmer (up from 188th in 2019), the 14,864th most popular biography from United States (down from 14,116th in 2019) and the 60th most popular American Swimmer."}, {"url": "https://www.the-sun.com/sport/3353357/how-old-is-olympic-swimmer-katie-ledecky/", "page_content": "KATIE Ledecky is known for her world records in swimming.\n\nThe multi-time Olympic gold medalist is on a quest to set new records in Tokyo.\n\n2 Ledecky has been named Swimming World’s Female World Swimmer of the Year Credit: AP\n\nWho is Katie Ledecky?\n\nKathleen Genevieve Ledecky is an American competitive swimmer, who has won five Olympic gold medals and 15 world championship gold medals, which is the most in female swimming history.\n\nLedecky has set world records in the women’s 400-, 800- and 1500-meter freestyle.\n\nShe also holds the record as the fastest women’s swimmer in the 500-, 1000- and 1650-yard freestyle events.\n\nLedecky has been named Swimming World’s Female World Swimmer of the Year for a record-breaking five times and named Female Athlete of the Year by Associated Press in 2017.\n\nIn 2012, Ledecky accepted an athletic scholarship to swim for Stanford University’s women’s team.\n\nShe graduated in June 2021 with a bachelor’s in psychology.\n\n2 Ledecky, who won her first gold medal at age 15 Credit: EPA\n\nHow old is Katie Ledecky?\n\nLedecky was born March 17, 1997 in Washington DC.\n\nThe 24-year-old is 6' and weighs 160 pounds.\n\nRead our Tokyo Olympics live blog for the latest news and updates...\n\nLedecky, who won her first gold medal at age 15, is known for her short hair and big smile.\n\nAccording to Celebrity Net Worth, Ledecky has a net worth of $4million as of 2021.\n\nWhen Ledecky competed in the NCAA representing Stanford University, athletes were unable to monetize their name, image and likeness through endorsements, which she would have made a hefty income from.\n\nLedecky now is endorsed by TYR, a swimming apparel company and has additional deals such as Got Milk.\n\nWhen will Katie Ledecky be competing at the 2021 Tokyo Olympics?\n\nSunday, July 25: 400 freestyle prelim 7.40am., 400 freestyle final 10.20pm.\n\nMonday, July 26: 200 freestyle prelim 6am., 200 freestyle semifinal 9.30pm.\n\nTuesday, July 27: 200 final 9.41pm., 1,500 final 10.54pm.\n\nWednesday, July 28: 4x200 freestyle relay prelim 7.34am., 4x200 freestyle final 11.31pm.\n\nThursday, July 29: 800 freestyle prelim 6.02am.\n\nFriday, July 30: 800 freestyle final 9.46pm.\n\nUS Olympian Katie Ledecky trains for the 2021 Tokyo Olympics\n\n[pod_component pod_component_config_id=\"BB1w9H6DA\" pod_component_config_url=\"https://www.thesun.co.uk/nu-sun-pod-component-config-prod/BB1w9H6DA.json\" pod_component_config_loader_url=\"https://www.thesun.co.uk/nu-sun-pod-loaders-prod/1.72.0/componentLoader.js?85621\" src=\"https%3A%2F%2Fiframe.thesun.co.uk%2Fnu-sun-pod-widgets-prod%2Fiframe-pod.html%3Fid%3DBB1w9H6DA%26script%3Dhttps%3A%2F%2Fwww.thesun.co.uk%2Fnu-sun-pod-loaders-prod%2F1.72.0%2FcomponentLoader.js%3F85621%26config%3Dhttps%3A%2F%2Fwww.thesun.co.uk%2Fnu-sun-pod-component-config-prod%2FBB1w9H6DA.json\"]"}, {"url": "https://sportsleo.com/news/2021/05/meet-katie-ledecky-worlds-fastest-female-swimmer-2021/", "page_content": "Katie Ledecky whose full byline is Kathleen Genevieve Ledecky is an American competitive swimmer born on 17March 1997 in Washington D.C. in the United States.\n\nHer parents are David Ledecky and Mary Gen Ledecky.\n\nThe swimming prowess in Katie has made her record an impressive performance. Many people do not know about her because she has bagged five Olympic gold medals and 15 World Championship gold medals. This is the most in history for a female swimmer.\n\nThis year, Ledecky won the 200-meter freestyle at the TYR Pro Swim Series meet with the world’s fastest time. She recorded a 1 minute 54.40 second in the outdoor pool. She was well ahead of three-time Olympian Allison Schmitt, who was second in 1:58.04.\n\nKatie’s world records include women’s 400, 800 and 1500 meter freestyle (long course). She also holds the fastest-ever times in the women’s 500, 1000 and 1650-yard freestyle events.\n\nAlso Read: Olympia Williams changes Venus William’s perception about children\n\nIn her international debut at the 2012 London Olympic Games as a 15-year-old, Ledecky unexpectedly won the gold medal in the women’s 800-metre freestyle.\n\n“Four years later, she left Rio de Janeiro as the most decorated female athlete of the 2016 Olympic Games with four gold medals, one silver medal, and two world records. In total, she has won 34 medals (28 gold medals, 5 silvers, and 1 bronze) in major international competitions, spanning the Summer Olympics, World Championships, and Pan Pacific Championships. During her career, she has broken fourteen world records.”\n\nKatie Ledecky the icon has earned titles out of her big talent which includes; Female World Swimmer of the Year, five times. She has also been named Associated Press Female Athlete of the Year in 2017, Female champion of Champions by L’Équipe in 2014 and 2017.\n\nIn the year 2013, 2016 and 2017, Katie bagged the United States Olympic Committee Female Athlete of the Year. She was also crowned Sportswoman of the Year by the Women’s Sports Foundation in 2017.\n\nLedecky’s 11 individual gold medals at the World Aquatics Championships and 15 combined individual titles at the Olympics and World Aquatics Championships are records in women’s swimming.\n\nBig talents definitely come with big tokens in terms of salary. Katie’s net worth is also mouth-watering. According to reports, she has an estimated net worth of $ 4 million.\n\n“Because she was still an NCAA student-athlete, Katie could not accept endorsement income or prize money from professional competition. However, in May 2018, Katie turned pro and signed her first major endorsement deal with swimwear company TYR. The deal will pay Katie $7 million over six years.”\n\nKatie in collaboration with Panasonic launched a STEM education program in 2020 to support needy students.\n\n“I am committed to using my platform to inspire and make a difference, and one way I believe I can make an impact is through access and exposure to STEM education,” Ledecky said. “I am thankful to my partner Panasonic, who supports this initiative and shares my vision of empowering the next generation of students to have opportunities in these important disciplines.” She said.\n\nLedecky has also offered support to several charities namely; Bikes for the World, Bring Back Our Girls, Catholic Charities, Children’s National and Ryan Seacrest Foundation.\n\nLedecky is surely a force to reckon with. She also has interests in Baseball, Basketball and Football."}, {"url": "https://www.theguardian.com/sport/2021/jul/27/katie-ledecky-1500m-freestyle-swimming-technique-olympics-tokyo", "page_content": "After Katie Ledecky versus Ariarne Titmus, prepare for Ledecky against herself.\n\nThat’s how it seems, anyway, when the American swims the 1500m freestyle: she is so superior to her rivals that only a major – and highly unlikely – technical or tactical breakdown could deny her victory.\n\nLedecky may have surrendered her Olympic 400m crown to the new Australian star on Monday morning in Tokyo, but in the evening session she cruised into the 1500m final in her third race in less than 10 hours. She finished first in her 200m freestyle heat at 7.05pm local time. Two hours later she was back in the Tokyo Aquatics Centre pool for the 1500m, reaching the final as the fastest qualifier by far in 15:35.35.\n\nAnother of her most impressive times this year? Seventy minutes. Ledecky won the 200m freestyle, her shortest event, at the US Olympic trials in Nebraska in June. Fuelled by a banana and chocolate milk, she returned to the pool a little over an hour later. Despite the short rest she easily went on to win the longest race, the 1500m freestyle.\n\nRegardless of exactly how many medals she’ll get to hang round her neck in these Olympics, she is poised to demonstrate once again not only her speed but her stamina and extraordinary range.\n\nAt Rio 2016 she won freestyle golds in the 200m, 400m, 800m and 4x200m and a silver in the 4x100m. The 1500m is a new Olympic event for women this year and Ledecky is the world record holder, with a time of 15:20.48 set in 2018.\n\n“It’s highly unusual that a swimmer would have that kind of range because you need different attributes to swim those different events. Most people don’t master the different strokes and the different energy systems it requires,” said Brett Hawke, who represented Australia at the 2000 and 2004 Olympics.\n\nLike most elite swimmers, Hawke knew at a young age that he would specialise – in his case, in sprints. A five-time national champion, he is a former Australian record-holder in the 50m freestyle. “You learn pretty quick what your skill base is,” he said.\n\nLedecky, though, defies conventional wisdom. “It’s like having a track athlete who can run the 100m all the way up to the 1500. It’s just unheard of,” added Hawke, who is now a vice-president of Fitter & Faster swim camps in the US. “You don’t have those speed-power athletes running longer distances. You don’t have those longer endurance athletes coming down to speed. And that’s kind of where she is in the swimming world, she’s an anomaly.”\n\nShane Gould held freestyle world records in the 100m, 200m, 400m, 800m and 1500m in 1971-72. The Australian won five medals in Munich in 1972 aged 15, including three golds. But Ledecky’s combination of versatility and success is unparalleled in more recent times. She has described herself as a “distance swimmer with a sprinter’s mentality.”\n\nTechnique-wise, Hawke said, “The one thing that she has that’s constant is her kick … she kicks throughout her entire races whether it be from 100 all the way up to the 1500. She’s using her legs as her engine and she’s very powerful in that respect. She manipulates the speed of her legs based on the distance but she obviously has great endurance in her legs, a lot of strength and power.\n\nI think it’s daunting for the other athletes to stand up next to her\n\n“She makes changes to her upper portion of her stroke, mainly her catch and her pull, depending on the distance. She’s obviously got power in the shorter events where she can bring her tempo up. In the 1500 she lengthens it out and she can ride her stroke a little bit longer. She’s lengthening the stroke out as she’s swimming longer distances and she’s able to maintain that feel for the water that most people would fatigue on over a longer distance.”\n\nThen there are the intangibles. In a 2013 lecture, Ledecky’s coach at the time, Bruce Gemmell, referenced her hip power and her lopsided “gallop” stroke, a style more common among male swimmers that sees her almost always breathe on the right side. But he stressed her unwavering determination.\n\n“She was very goal-driven and she was very clear,” he said, telling the audience that he asked a group of swimmers to write their main aim on the back of an index card. “I’m reading all the goals and some of them are wonderful things like ‘get better at my freestyle’. Other ones would be, you know, ‘make my high school medley relay team’. I picked Katie’s up and I turned it over and it said, ‘break the world record in the 800 free next summer’. OK!”\n\nLedecky won freestyle golds as a 16-year-old in the 2013 World Championships in the 400m, 800m, 1,500m and the 4x200m, following her first place in the 800m in London 2012. Now 24, there is no reason why the Washington DC native should not continue to thrive over shorter distances, said Dr Michael Joyner, a human performance and exercise physiology expert at the Mayo Clinic.\n\n“In track and field most athletes move up as they get older,” he said. Eliud Kipchoge and Mo Farah, for example, switched to marathons in their 30s. “Swimming is incredibly technique-driven. If you look at the velocities in which you’re moving the limbs, they’re not as fast as they are with cycling or running. So people are still going somewhat – relatively – slowly,” Joyner said.\n\n“The water’s very forgiving” compared to the risks of a sport such as cycling, he added. “You’re not going to crash… I think it’s just the grind and avoiding injuries and just being able to stay focused.”\n\nLedecky did not take up the 1500m until she was about 12 or 13, she said during the US swimming team’s pre-Tokyo training camp in Hawaii, but she liked it “right from the get-go … I enjoyed it maybe a little bit more than some of my peers.” Part of the appeal, she said, is the challenge of balancing out her naturally aggressive approach with the patience needed in order to preserve energy over a longer distance.\n\nThe 400m loss to Titmus was a slight surprise. It would be a major shock if Ledecky failed to triumph in the 1500m. Her reputation, versatility and past record may give her a mental advantage before she so much as dives into the pool, even if Titmus has shown that Ledecky is no longer invincible. Wang Jianjiahe of China pushed hard at the end of their heat but Ledecky did not flag in the closing metres of her 2,100m day.\n\n“I think it’s daunting for the other athletes to stand up next to her knowing that she has that type of range,” Hawke said. Ledecky “can go at top-end speed – and she can maintain it for a long period of time. I think that’s fairly intimidating when you stand up next to her.”"}, {"url": "https://www.latimes.com/sports/olympics/story/2021-07-15/katie-ledecky-most-dominant-olympic-swimmer", "page_content": "The girl couldn’t make it across the pool.\n\nMidway through the 25-meter journeys at the Palisades Swim and Tennis Club in Cabin John, Md., she’d grab a lane line and catch her breath like so many other 6-year-olds figuring out how to swim. Then the windmilling to the other side resumed.\n\nShe had a smile that seemed bigger than her diminutive frame, swim cap pulled over her ears and enthusiastic post-race analyses captured on home movies.\n\nEighteen years later, Katie Ledecky is the world’s most dominant freestyle swimmer. The biggest question when she knifes through the water usually isn’t whether she’s going to touch the wall first, but how many body lengths she’ll be in front of the second-place finisher.\n\n“Katie Ledecky is doing what Katie Ledecky does!” the public address announcer shouted last month as she completed another convincing victory during the U.S. Olympic swimming trials in Omaha, Neb. “Do not let it pass over you.”\n\nSubscribers get early access to this story We’re offering L.A. Times subscribers first access to our best journalism. Thank you for your support.\n\n\n\n\n\nAdvertisement\n\nThe victories, the records, the head-shaking performances in which her only competition is the clock, are so frequent that they seem as routine as her unassuming comments after each race with history. But she acknowledged having the same nerves as any other competitor at the trials and, in all sincerity, said she didn’t take making the Tokyo Games for granted.\n\nThe five-time Olympic gold medalist owns world records in the 400-, 800-, and 1,500-meter freestyles. The usual gap for a world record is as thin as an Olympic medal. But Ledecky doesn’t just beat records, she transforms them. The 800? She has the 24 fastest swims of all time. The 1,500? The top 11 times. The 400? Twelve of the top 14 times.\n\nKatie Ledecky competes in the women’s 1500-meter freestyle during the U.S. Olympic swim trials on June 16 in Omaha, Neb. (Charlie Neibergall / Associated Press)\n\nMichael Phelps, the 28-time Olympic medalist, called Ledecky “the greatest female swimmer of our time.”\n\nCoaches, teammates and competitors point to her powerful stroke, legendary training sessions, unusual blend of speed and endurance, and tenacity that is otherworldly. The traits, at least individually, aren’t uncommon in elite swimmers. And they’re ultimately suggestions straining to answer a larger question.\n\nLedecky leaves some of the most experienced people in swimming grasping for the secret to her dominance. Genetics? An iron will? Nature versus nurture? God? What transformed that girl who couldn’t make it across the pool?\n\nAdvertisement\n\nMatt Barbini, USA Swimming’s national team performance director, recalled the feeling after Ledecky’s surprise victory in the 800 at the London Olympics in 2012 introduced the little-known teenager to the world.\n\n“Oh, man, this is not exactly what we thought,” he said. “This is something really, really special.”\n\n::\n\n‘You’re going to get your head kicked in’\n\nBefore the London Olympics, Ledecky trained at the U.S. team’s camp in Knoxville, Tenn., with a small group of middle- and long-distance swimmers under legendary coach Jon Urbanchek.\n\nWhat happened took everyone by surprise. The quiet 15-year-old usually kept up with the men, who noticed fearlessness and poise that belied her youth. She didn’t hesitate to start faster than they expected and maintain the aggressive pace. Sometimes she faded. Most of the time she didn’t.\n\n“Some of the boys said, ‘Jon, get her out of our lanes. She’s swimming faster than we are,’” said Urbanchek, coach to 44 Olympians and an assistant on six Olympic teams.\n\nAdvertisement\n\nDavid Marsh, an assistant on the team who served as the women’s coach in 2016, recalled coaches gathering when Ledecky swam.\n\n“She’s swimming in full dude territory,” he said. “I don’t think she had a clue how fast she was going. She was just doing what Jon was saying.”\n\nIf any single item is responsible for her transformation, the grueling sessions away from television cameras and autograph-seeking fans might be it. She keeps logbooks chronicling most of her practices dating to 2011. There’s a decade’s worth of underwater video too. No detail is too small.\n\nLedecky sometimes texts her mother, Mary Gen, or brother, Michael, after a particularly good set. He describes them as “holy cannoli” swims that would leave almost anyone else’s jaw on the floor.\n\n“I think she loves the training more than she loves competing,” Michael said.\n\nWhile every distance swimmer grinds through thousands of monotonous yards each week, these sessions are somehow different for Ledecky.\n\nAdvertisement\n\n“It can’t be easy to go train against Katie when you know you’re going to get your head kicked in,” said Keenan Robinson, Phelps’ longtime strength and conditioning coach. “But she shows gratitude and appreciation and keeps people coming back to get their heads kicked in.”\n\nBarbini noticed the mix of intensity and care that’s as much a part of Ledecky as the blazing times.\n\n“Katie wants to win by the most massive margin possible, but I don’t think she wants to break anyone’s soul like Michael Jordan did,” Barbini said. “It’s a remarkable combination, particularly for someone to be that dominant for so long, which takes so much commitment, while at the same time being so nice and polite and kind.”\n\nKatie Ledecky hugs Erica Sullivan after winning the women’s 1500 freestyle during the second wave of the U.S. Olympic Swim Trials on June 16 in Omaha, Neb. (Jeff Roberson / Associated Press)\n\nThe same all-out approach Ledecky brought to the final 25 meters of the 200 freestyle at the Rio de Janeiro Olympics — she edged Sweden’s Sarah Sjostrom by .35 seconds for gold despite feeling queasy — happens regularly in practice with nothing at stake other than numbers on a clock.\n\nAndrew Gemmell, the coach’s son who competed at the London Olympics in the 1,500 freestyle, trained with Ledecky in the two years leading up to Rio. He good-naturedly described her competition-like intensity in practice as “really annoying.” Even years after the sessions, the words carry a mixture of awe and disbelief.\n\nAdvertisement\n\n“There were days where I wanted to tap my dad and say, ‘Hey, can I just watch?’” Gemmell said. “I’m know I’m supposed to be doing this too. But can I please just watch? This is really impressive. I promise this isn’t because I’m getting my butt kicked.”\n\nGemmell warned other men in the training camp to be ready for Ledecky to beat them. Some said it would never happen. Then it did.\n\nThat continued when Ledecky arrived at Stanford as a freshman in 2016. Twice each week, she trained against long-distance swimmers Liam Egan and True Sweetser. Since NCAA rules keep men’s and women’s swim teams that don’t use the same coach from practicing together, Ledecky used lane 12 and Sweetser lane 11. They swam identical workouts.\n\n“Katie wants to win by the most massive margin possible, but I don’t think she wants to break anyone’s soul like Michael Jordan did. It’s a remarkable combination, particularly for someone to be that dominant for so long, which takes so much commitment, while at the same time being so nice and polite and kind.” — Matt Barbini, USA Swimming’s national team performance director\n\nSome days she left him “absolutely demolished” and approached record paces in the middle of exhausting workouts.\n\n“A lot of people have the tendency to want to protect themselves in their training,” Sweetser said. “Katie just dives in headfirst and really forces you to get the most out of practice. … She’s always trying to maximize her performance so there’s nothing left in the tank. It’s a mindset that different to go out as fast as you can without being blatantly reckless.”\n\nAdvertisement\n\nShe’s not afraid to fail. Sometimes that happens.\n\n“If I have a bad practice, I don’t let it get to me,” Ledecky said. “I really haven’t had too many of those over the past couple months, so that’s a good thing.”\n\nThe words were matter-of-fact, delivered without a trace of pretense.\n\nIn the middle of a difficult practice, Sweetser noticed Ledecky staring at him. Her face was red. He thought the she was sizing him up as another opponent to defeat. Turned out a bigger foe lurked behind him: the pace clock.\n\n::\n\nChocolate milk\n\nThe stroke that’s propelled Ledecky to record after record is connected to another legend.\n\nYuri Suguiyama, her first coach, watched Phelps break Australian Ian Thorpe’s world record in the 200 freestyle during the world championships in Melbourne. That performance burned into the coach’s memory. So did Phelps’ asymmetrical stroke that’s known as “galloping” or “loping” and is common among high-level men.\n\nAbout 18 months before the London Olympics, Suguiyama suggested that Ledecky adopt the gallop. It worked.\n\nAdvertisement\n\n“She was swimming like most classic female distance swimmers,” Suguiyama later told the American Swimming Coaches Assn. “It was two big kicks and bilateral breathing. But she was always bouncing up and down, really bouncy in the water and I think you can swim better than that.”\n\nLedecky uses a short left stroke, followed by a long right one, while breathing on her right side every other stroke, and repeating the pattern.\n\n“She’s able to really lean into each arm,” Sweetser said. “That’s key to her success. Even elite women’s swimmers at the Olympics aren’t able to pull off that kind of stroke.”\n\nA swimmer needs ample strength for this approach to work. Ledecky has plenty, starting with the hip turn and core that provide much of her power.\n\n“She’s really activating her core and that allows her upper body to connect to her lower body and when you put those two together, it gives her really great timing and great catch,” said Elizabeth Nagle, an associate professor at the University of Pittsburgh who studies aquatic physiology. “That’s what’s allowing her to get such a good grab of the water … and have such good force generation per stroke.”\n\nExperts single out the way Ledecky’s palm wraps about the water and pulls it back. They can’t quantify this, but believe she hangs onto more water than other swimmers.\n\nAdvertisement\n\n“She feels water better than anyone else has ever felt water,” Barbini said. “You just watch the force that she pulls with and it’s way, way different.”\n\nHideki Takagi, a professor at the University of Tsukuba in Japan focused on the hydrodynamics and biomechanics of swimming, underlined the importance of this trait.\n\n“Even if they are fit and strong like a football player, they cannot swim fast if they do not have the skill to catch the water,” Takagi wrote in an email. “General swimmers tend to think that if they can just get their arms around faster and kick their legs faster, they can swim faster. However, elite swimmers focus on how to generate propulsion more efficiently.”\n\nThe collision of hand and water is one piece of a complex, fast-paced puzzle in which the grab and breathing and body rotation and head position and kick and proper body alignment and arms cutting into the pool at the precise angle must work in concert. For lengthy races like the 1,500 meters, this must remain constant for more than 15 minutes. Somehow she makes this look easy.\n\nIn a video posted on social media last summer, Ledecky placed a glass of chocolate milk on her head, then swam the length of the pool. Not a drop of milk spilled.\n\nAdvertisement\n\n::\n\n55.66\n\nAt the Olympic trials last month, Greg Meehan, Ledecky’s coach who leads the Stanford women’s swimming program and the women’s Olympic team, asked for a prediction. How fast would Torri Huske, the 18-year-old phenom headed to Stanford this fall, swim in the 100 butterfly final?\n\nLedecky said 55.66 seconds.\n\nHuske won the race and set an American record in the event. The time: 55.66 seconds.\n\n“I’m very proud of this,” Ledecky said.\n\nIt might be easy to brush off the prediction as a fluke, but chance doesn’t play much of a role when Ledecky is involved. She has an unnatural sense of what will happen in the pool — call it swimming intelligence — that’s as impressive to witness as it is difficult to quantify.\n\n“Because of her analytical approach to training, she knows almost exactly how the race is going to go,” Sweetser said.\n\nKatie Ledecky, left, finishes the women’s 400-meter freestyle final far ahead of silver medal winner Leah Smith, right, during the World Aquatics Championships in Budapest, Hungary, on July 23, 2017. (Michael Sohn / Associated Press)\n\nAdvertisement\n\nOne key is obsessive attention to detail.\n\n“She takes a little advantage by doing all these little things a little bit better and I think that all adds up to her being so much better than everybody else,” Barbini said.\n\nBut her career is also a two-way conversation. Each month, she sends practice video to Russell Mark, a former rocket scientist who is USA Swimming’s national team performance manager. They review the video together, as much for what he notices as her feedback.\n\nThat’s not new. When reminiscing about her pre-teen years in the pool, she told an athletic trainer that she cared more about perfecting her stroke than about winning. The process trumped everything.\n\n“Some of these things that might have come naturally and unconsciously when she was 16, now it’s conscious,” Mark said. “She has recognition of these things in the middle of a race and can make an adjustment. … That shows a mastery. That’s amazing.”\n\n::\n\n‘Kind of a freak athlete’\n\nWhen Bruce Gemmell took over as Ledecky’s coach at the Nation’s Capital Swim Club in late 2012, his young charge had an Olympic gold medal, but couldn’t do a pullup.\n\n“What stood out to me was nothing stood out physically,” he said. “Is she tall for the average person? Yes. Is she tall for an elite swimmer? No. She wasn’t a great kicker. She wasn’t a great puller. She wasn’t great at skills or drills we would try and teach her. What I found over time what she was great at, though, was her desire to get better.\n\nAdvertisement\n\n“There were many times where she was walking up for practice … and I think, ‘That’s the best female athlete in the world?’ I’d just kind of chuckle to myself because there’s nothing that said that.”\n\nOther than standing 6 feet tall, a couple of inches above the average height for female swimming finalists at the Rio Games, she could blend into a crowd outside of the pool. She doesn’t have an unusually long torso or long arms or large hands. She doesn’t have Phelps’ attention-grabbing build that included an 80-inch wingspan and size-14 feet that seemed to double as flippers.\n\nInstead, Ledecky has a gift that defies measurement.\n\n“She’s kind of a freak athlete,” said Lee Sommers, an athletic trainer in Bethesda, Md., who helped prepare Ledecky for Rio. “She doesn’t have a central governor like most athletes do, that mind-to-muscle idea that ‘I need to shut down right now.’ … There’s nothing you can throw at her that she can’t convince herself that she can do.”\n\nBefore Ledecky, Sommers had never trained a swimmer, so he approached her like other athletes reliant on overhead motion, focusing on core strength, shoulder stability, injury prevention, plus explosiveness in short distances. He can count on one hand the number of times she was floored by a workout. She’s also remained remarkably healthy, aside from occasional illnesses, in a sport in which unrelenting training exacts a toll on the body.\n\nDuring a stint at the Olympic Training Center in Colorado Springs, Colo., in early 2016, Conor Dwyer, a two-time Olympian, engaged in a friendly contest with Ledecky jumping onto flat surfaces at increasing heights. Dwyer topped out at 40 inches. Ledecky, who could reach only 21 inches a few years earlier, reached a personal-best 39 inches. During their next training session, he recalled, she said, “We’ve got to get our 40.” She did.\n\n“She’s kind of a freak athlete. She doesn’t have a central governor like most athletes do, that mind-to-muscle idea that ‘I need to shut down right now.’ … There’s nothing you can throw at her that she can’t convince herself that she can do.” — Lee Sommers, an athletic trainer in Bethesda, Md., who helped prepare Ledecky for Rio\n\nAdvertisement\n\nThen there’s the sheer efficiency of how her body works.\n\n“I’m willing to bet she has a V02 max that’s better than anybody else on the face of the earth,” Robinson said, referring to the maximum amount of oxygen a person uses while exercising. “Her strength-to-body mass ratio is probably in the top 98%.”\n\nAll of this feeds Ledecky’s ability to do things in the pool that aren’t normal. On the fourth day of the Olympic trials, for example, she won the 200 freestyle by a full body length after pulling away in the final 50 meters. About an hour later, she returned to the pool for the 1,500 freestyle final. This is a completely different kind of race, 30 laps of endurance that is part of the women’s Olympic program in Tokyo for the first time. To no surprise, Ledecky, who first broke the world record in the event in 2013, recorded the world’s top time in the event this year on the way to another victory.\n\nCompeting in both events is rare enough. But within an hour of each other? Winning both? And not even appearing winded?\n\nThere are technical explanations: her aerobic system using oxygen with extraordinary efficiency, while her anaerobic system generates explosive bursts of energy. Or perhaps the answer is more basic.\n\n“Are you willing to push yourself beyond all comprehension or are you not?” Nagle said. “She certainly is.”\n\n::\n\nShe’d race in a cardboard box\n\nA 58-foot-wide picture of Ledecky adorned the outside of the CHI Health Center in Omaha during the Olympic trials in 2016. A similar picture covered the front of the building as the trials took place last month, another reminder that she is the face of the sport.\n\nAdvertisement\n\nLedecky’s world records in the 800 freestyle and 1,500 freestyle are 1.95% faster than the second-best women. The world record margin for the 12 other individual events in the Olympic program is 0.44%.\n\nThe history-making has become so common, so many would-be competitors left so far behind, that expectations, just like the pictures, are larger than life.\n\n“The standards for her externally, I think, are just tough sometimes,” Meehan said. “We don’t talk about it. But everybody feels that.”\n\nTake the 400 freestyle final at the trials. Ledecky won easily in 4 minutes 1.27 seconds, the 43rd-fastest swim ever by a woman. But the time was almost five seconds off Ledecky’s world record set in Rio. And Ariarne Titmus, the 20-year-old sensation nicknamed “The Terminator,” posted the second-best time in history a day earlier at the Australian trials.\n\nKatie Ledecky reacts after winning her heat in the Women’s 200 Freestyle during the second wave of the U.S. Olympic Swim Trials on June 15 in Omaha, Neb. (Jeff Roberson / Associated Press)\n\nLedecky, who has broken the 4-minute barrier in the distance 20 times, thought she had been faster. The time that would be a career-making moment for almost any other swimmer surprised her. But she addressed it and moved forward.\n\nAdvertisement\n\n“The most important expectations are the ones that I have for myself,” said Ledecky, who graduated from Stanford with a psychology degree last month. “I think I do a pretty good job of sticking to those and not seeing what kinds of medal counts or times that people are throwing out about what I could accomplish if everything goes perfectly.”\n\nThat’s why Bruce Gemmell quips that Ledecky would be content to race in a cardboard box.\n\n“She’s not doing it for the adulation, she’s not doing it for the title of the world’s greatest swimmer,” the coach said. “It’s just her commitment and desire for getting better.”\n\nShe has an uncanny ability to remain herself, not flinch in the face of scrutiny and focus on the task at hand.\n\n“There’s a lot of noise,” said Janet Evans, the four-time Olympic gold medalist who is considered one of the greatest distance swimmers in history and now works as the chief athlete officer for the Los Angeles 2028 Olympic Committee. “There’s a lot more pressure when you’re 24 and going to the Olympics for your third Games as a heavy favorite versus being 15 and going to the Olympics with barely anyone knowing your name. The most impressive thing for me is blocking out the noise and not feeling the pressure.”\n\nUrbanchek put it bluntly: “Nothing distracts her.”\n\n“There’s no special sauce. Trust me. She’s not doing some special strength program that nobody else knows about. She’s doing what everybody else does. She’s just doing it better than everybody else.” — Bruce Gemmell, Katie Ledecky’s coach at the Nation’s Capital Swim Club\n\nAdvertisement\n\nSome of this immunity to pressure comes from her knack to set goals, internalize them, then turn them into reality. This started as a child. Mary Gen Ledecky, who swam in college, encouraged her daughter to write down goals. They were called “watch times.”\n\nYears later, Gemmell read two items on Ledecky’s goal card: break the world record in the 800 freestyle by the following summer and swim 8:10 in the event in Rio. She set the record in the event nine months later in 8:13.36.\n\nThey realized the goals, lofty as they might seem for a teenager, were too pedestrian. The goals were adjusted to pursue times that felt a little scary, a little unreasonable, more than a little exciting: 3:56 in the 400 freestyle and 8:05 in the 800 freestyle. In keeping with Ledecky’s low-key personality, the goals stayed between them. She met both.\n\n::\n\nThe mystery\n\nThe stories pile up. Ledecky breaking an arm in fourth grade, but jumping back into the pool with a cast. Or Mark finding Ledecky eating alone in the dining hall at the London Olympics the day of her 800 freestyle final, appearing as calm as a seasoned veteran. Or Gemmell calling other coaches for ideas on how to challenge this once-in-a-lifetime teenager doing “crazy stuff” in practice.\n\nThe questions pile up too. Is it her training? Her physiology? We don’t clamor for such answers while admiring a soprano’s voice or an actor’s ability to make us weep. We’re content to enjoy the gift. Sports, however, bring a desire for answers, for numbers, for specifics, especially for someone whose accomplishments almost have become disorienting. We want to know what transformed that girl who couldn’t make it across the pool?\n\nBut the more coaches and trainers and competitors grasp for answers, the more the reality comes into focus. Maybe the explanation is unknowable. Maybe there isn’t a secret. Maybe the history Ledecky is making is as remarkable as how she’s doing it.\n\n“There’s no special sauce. Trust me,” Gemmell said. “She’s not doing some special strength program that nobody else knows about. She’s doing what everybody else does. She’s just doing it better than everybody else.”\n\nAdvertisement\n\nAnd perhaps that’s the greatest mystery of all.\n\nComing Sunday: Home subscribers will receive the Los Angeles Times’ 24-page Olympic preview section, your guide to the upcoming Games. The section also will be available for purchase at latimes.com/store. Visit latimes.com/olympics now and throughout the Games for the latest Olympic news and analysis."}]}