{"Michael Savage is an author.": [{"url": "https://www.goodreads.com/author/list/14086.Michael_Savage", "page_content": "Showing 30 distinct works.\n\nsort by popularity original publication year title average rating number of pages\n\nThe Death of the White Male: The Case Against Affirmative Action\n\nThe Essential Michael Savage: The Savage Nation; the Enemy Within; Liberalism Is a Mental Disorder\n\nDiseases without Borders: Boosting Your Immunity Against Infectious Diseases from the Flu and Measles to Tuberculosis\n\nStop Mass Hysteria: America's Insanity from the Salem Witch Trials to the Trump Witch Hunt\n\nTrickle Down Tyranny: Crushing Obama's Dream of the Socialist States of America\n\nGovernment Zero: No Borders, No Language, No Culture\n\nTrickle Up Poverty: Stopping Obama's Attack on Our Borders, Economy, and Security\n\nThe Savage Nation: Saving America from the Liberal Assault on Our Borders, Language, and Culture\n\nThe Enemy Within: Saving America from the Liberal Assault on Our Schools, Faith, and Military\n\n* Note: these are all the books on Goodreads for this author. To add more books, click here"}, {"url": "https://us.macmillan.com/author/michaelsavage", "page_content": "Dr. Michael Savage is a multimedia icon in the conservative movement. The Telegraph in the U.K. ranked him as one of the most influential conservatives in the United States, and with 10 million weekly listeners, the Berkeley Ph.D. is the third most listened-to conservative talk-show host. Recently featured in The New Yorker and Playboy, Dr. Savage is the author of more than two dozen books, including the New York Times bestsellers, The Savage Nation and The Political Zoo, as well as Abuse of Power and A Time for War. His media presence and profile earned him the coveted Freedom of Speech Award from Talkers magazine in 2007.\n\n\n\nDr. Savage holds a master’s degree in medical botany and a second in medical anthropology. Additionally, he earned his Ph.D. from the University of California at Berkeley in epidemiology and nutrition sciences. He is an ardent conservationist, is dedicated to his family, and is a proud patriot of his country."}, {"url": "https://www.bookseriesinorder.com/michael-savage/", "page_content": "Publication Order of Jack Hatfield Books\n\nAbuse of Power (2011) Hardcover Paperback Kindle A Time for War (2013) Hardcover Paperback Kindle Countdown to Mecca (2015) Hardcover Paperback Kindle\n\nPublication Order of Short Stories/Novellas\n\nThe Survivor (2016) Hardcover Paperback Kindle Xenon (2018) Hardcover Paperback Kindle\n\nPublication Order of Short Story Collections\n\nTrain Tracks (2012) Hardcover Paperback Kindle\n\nPublication Order of Non-Fiction Books\n\nThe Death of the White Male (1991) Hardcover Paperback Kindle Compassionate Conservative Speaks (1995) Hardcover Paperback Kindle The Savage Nation (2000) Hardcover Paperback Kindle The Enemy Within (2004) Hardcover Paperback Kindle Liberalism is a Mental Disorder (2005) Hardcover Paperback Kindle The Political Zoo (2006) Hardcover Paperback Kindle Psychological Nudity (2008) Hardcover Paperback Kindle Trickle Up Poverty (2010) Hardcover Paperback Kindle Trickle Down Tyranny (2012) Hardcover Paperback Kindle Stop the Coming Civil War (2014) Hardcover Paperback Kindle Government Zero (2015) Hardcover Paperback Kindle Diseases without Borders (2015) Hardcover Paperback Kindle Teddy and Me (2016) Hardcover Paperback Kindle Scorched Earth (2016) Hardcover Paperback Kindle Trump's War (2017) Hardcover Paperback Kindle God, Faith, and Reason (2017) Hardcover Paperback Kindle Stop Mass Hysteria (2018) Hardcover Paperback Kindle A Savage Life (2019) Hardcover Paperback Kindle Our Fight for America (2020) Hardcover Paperback Kindle\n\nBook links take you to Amazon. As an Amazon Associate I earn money from qualifying purchases.\n\nMichael Alan Weiner (better known by his stage name Michael Savage) hosts a radio show, is an author, a nutritionist, activist, conservative political commentator, and host of a radio show (called The Savage Nation). He won a Freedom of Speech by Talkers Magazine, and the speech he delivered was pre-recorded.\n\nHis radio show came about after a manuscript about illegal immigration was rejected led him to make a demo that was a mock radio talk show. He sent the recording to 250 stations to try and become a radio talk show host. He got a job on KGO, which is a station in San Francisco that is news and talk radio; at first, he was filling in for a liberal host and later worked the weekends as host.\n\nHe got his own show in 1995 for KSFO during the drive time hours. By 2009, his show was aired on four hundred stations in America and listened to by around eight to ten million people, making it the second most listened to show in the country.\n\nHe was born March 31, 1942 in The Bronx, New York, and was one of three children his parents had. One of his brothers, Jerome, was unable to hear or talk after being born with developmental disabilities and died in 1969. He has four degrees, one a PhD. Savage has been married twice, once in 1964, that ended in 1967. His second began in the year 1967. He has two kids with his second wife, one is Russell Weiner, who founded the company that makes Rockstar energy drink. His mother was the CFO of the company for a time.\n\n“Abuse of Power” is the first “Jack Hatfield” novel, which was released in the year 2011. Jack Hatfield was a war correspondent, making a name for himself for his provocative and insightful commentary. He loses his job after his name is wrecked when he gets called an extremist and bigot by a group that is leftist media watchdog. He has to start over in obscurity, while working as a news producer, in a freelance capacity, in the city of San Francisco.\n\nHatfield is doing a ride along with the bomb squad of the San Franscisco police, and what appears to be a routine carjacking ends up deadly. This happens when the cops find many pounds worth of military grade explosives in the vehicle that was stolen. Hatfield is urged by the FBI to keep out of it, and it is a sign, he knows that he is on to something huge.\n\nThis is the start of a shadowy trail that takes Hatfield all over the world and back. From Tel Aviv, Paris, and London. He works with a Green Beret vet and an agent of Yemeni intelligence so they can expose a group of terrorists called Hand of Allah. They will expose a plot, hidden in power’s highest corridors that is going to make 9/11 look tiny in comparison.\n\nFans of the novel found this to be a stellar first work of fiction. It was a good and quick read. The writing is better than expected, not to mention a fun time.\n\n“A Time for War” is the second “Jack Hatfield” novel, which was released in the year 2013. A Chinook chopper full of Navy Seals plummets to earth all of a sudden in Afghanistan. A car of FBI agents, who trail a suspicious vehicle is rendered immobile somehow in San Francisco. A Chinese agents body is discovered floating just miles away from the Golden Gate Bridge, after he got fed to some sharks. America is under a secret attack and it is up to Jack Hatfield to keep it from happening, as he is the only one that is able to sense it is even happening.\n\nDover Griffith (who is a young woman that is a staffer at Office of Naval Intelligence and is idealistic) helps him as he investigates. The case leads him to a billionaire who sold his own country out, with some American officials at the highest level of the government.\n\nEnemy operatives are planning on a two pronged attack that is going to cripple the American military and kill thousands of citizens with a deadly toxin. Hatfield and Dover are trying to find the ground zero and save the country, which suspects nothing.\n\nFans of the novel found this pulls off something tough by having a political television show host filling the role of a thriller hero with Jack. The story moves along at a nice pace, and the plot is quite interesting. The dialogue engages and the characters are quite realistic.\n\n“Countdown to Mecca” is the third second “Jack Hatfield” novel, which was released in the year 2015. A plane goes down in the Caspian Sea, its destination was Amman, Jordan. There are no survivors except for the Russian mercenary that was the one that hijacked the plane. There is also a cask that has an agent that could be highly destructive. This is a carefully planned out terrorist attack, and the chaos that comes with it might just be enough to push America into another expensive war.\n\nJack may be able to stop this attack. He made a politically incorrect statement that was about Islamic extremists and got discredited, which forced him to try to fix what was left of his career. Sammy (Jack’s half brother) calls him up and says that his neighbor heard something she was not supposed to, making both of their lives in danger. Jack finds that he has found a conspiracy to ruin Mecca. He, with a like minded bunch of friends who are on the law’s fringes, have to find out who is behind the plot and keep them from succeeding. If they don’t, they will witness the world’s collapse into a war where global destruction is assured.\n\nFans of the novel found this to be quite a nail biter of a novel. This is a great fictional thriller that uses current events very well to tell its story. Here is a great writer, able to spin a superb tale."}, {"url": "https://factsbuddy.com/michael-savage/", "page_content": "Michael Savage Bio | Wiki\n\nMichael Savage (Full name: Michael Alan Weiner) is an American conservative author, conspiracy theorist, political commentator, activist, and former radio host. He is best known as the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2021.\n\nIn 2009 was the second most-listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States. From October 23, 2012, to January 1, 2021, Savage had been syndicated by Cumulus Media and Westwood One.\n\nMoreover, he has written several political books that have reached The New York Times Best Seller list. Although his radio delivery is mainly characterized as politically themed, Savage also often covers topics such as medicine, nutrition, music, literature, philosophy, sports, business, economics, and culture, and tells personal anecdotes.\n\nMichael Savage Age\n\nSavage was born on March 31, 1942, in New York, New York, United States. He is 80 years old.\n\nMichael Savage Height\n\nHe is a man of small stature and stands at a height of 5 ft 4 in (Approx. 1.62 m).\n\nMichael Savage Family\n\nHe was born and raised in the Bronx, New York by his parents Benjamin Weiner and Rae. Savage’s father was a Jewish immigrant from Russia whereas his mother was from Montreal, Canada. He has two siblings including Jerome who died in 1969. Savage’s father owned an antique shop and died of a heart attack at age 57 in 1970, and his mother died in 2003.\n\nMichael Savage Wife\n\nSavage’s first marriage in 1964 to Carol Ely ended in divorce, and he remarried in 1967 after meeting his current wife, Janet. Savage and Janet have two children, a daughter Rebecca Lin Weiner Yops, and a son Russell Weiner. Janet served as CFO of his company until July 2009. Russell is the founder of the company that produces the Rockstar energy drink.\n\nIn 1974, Savage and his family moved to Fairfax, California, after he completed his master’s degree at the University of Hawaii. He owns homes in Larkspur and Tiburon in Marin County, California, an apartment in San Francisco, as well as residences in Beverly Hills, California, and West Palm Beach, Florida.\n\nMichael Savage Son\n\nSavage’s son Russell is the founder of the company that produces the Rockstar energy drink.\n\nMichael Savage Education\n\nHe graduated from Jamaica High School in 1958. Later, Savage attended Queens College, where he earned a bachelor’s degree in biology in 1963. He then studied at the University of Hawaii at Manoa, earning a Master of Science in botany in 1970 and a Master of Arts in anthropology in 1972.\n\nSavage obtained a Ph.D. in 1978 from the University of California, Berkeley, in nutritional ethnomedicine. His thesis was titled Nutritional Ethnomedicine in Fiji.\n\nMichael Savage Podcast\n\nIn 2019 Savage launched The Savage Nation podcast with episodes posted on Tuesdays and Fridays. He collaborated with Westwood One and introduced a podcast format with a mixture of live-broadcast and studio material.\n\nMichael Savage Streaming Live | Live Stream\n\nSavage started an occasional series of video webcasts via Ustream on September 30, 2012. On October 17, 2012, he and his new syndicator Cumulus Media Networks announced that they had made a deal and the program, after several weeks off the air, would be returning as of October 23, 2012.\n\nBy April 2013, according to the radio industry’s Talkers Magazine, Savage had 3.5+ million weekly listeners, putting him in a six-way tie for sixth place, and six talk show hosts getting 7.5+ million weekly listeners.\n\nMichael Savage The Savage Nation\n\nOn January 2, 1995, the first day of KSFO’s new format, Savage started as host of the afternoon drive time show The Savage Nation. By 2000, he was the most popular afternoon drive host among all adults in San Francisco Arbitron ratings. In 1999, Talk Radio Network began syndicating part of The Savage Nation nationally.\n\nStarting September 21, 2000, The Savage Nation became an entirely national show distributed by TRN. In January 2015, it became announced that Savage and Westwood One had reached an agreement on a long-term contract renewal for The Savage Nation.\n\nIn January 2019, he in collaboration with Westwood One introduced a podcast format with a mixture of live-broadcast and studio material. On March 24, 2019, Savage celebrated the 25th Anniversary of the radio show. On January 1, 2021, The Savage Nation was discontinued by Cumulus Media and Westwood One.\n\nMichael Savage Books\n\nSome of the books he wrote include:\n\nDiseases without Borders: Boosting Your Immunity Against Infectious Diseases from the Flu and Measles to Tuberculosis,\n\nTeddy and Me: Confessions of a Service Human,\n\nScorched Earth: Restoring the Country after Obama\n\nTrump’s War: His Battle for America\n\nGod, Faith, and Reason\n\nXenon\n\nStop Mass Hysteria: America’s Insanity from the Salem Witch Trials to the Trump Witch Hunt, from the Red Scare to Russian Collusion,\n\nA Savage Life\n\nMichael Savage Net Worth\n\nHe earns his wealth from his career, therefore, he has amassed a fortune over the years. Savage’s estimated net worth is $2 million.\n\nWhat Happened To Michael Savage\n\nIn December 2019, Savage notably suffered a heart attack, but subsequently recovered and returned on air.\n\nMichael Savage Twitter"}, {"url": "https://articlebio.com/michael-savage", "page_content": "Michael Savage is a well-known figure in the radio fraternity. A radio-host, celebrated the author, political commentator, nutritionist and activist, Savage is best known for his former show The Savage Nation which aired on Talk Radio Network.\n\nMichael Savage has been syndicated by Cumulus Media Networks since 2012. He holds master's degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine. As Michael Weiner, he has written books on nutrition, herbal medicine, and homeopathy; as Michael Savage, he has written four political books that have reached The New York Times Best Seller list.\n\nEarly Life And Education Of Michael Savage\n\nSavage was born as Michael Alan Weiner on 31st March 1942 on the Bronx, New York. He was one of the three children of father Benjamin and mother Rae and considers his childhood to have been a difficult one.\n\nMichael’s education consisted of graduating from Jamaica High School after which he attended Queens College and graduated with a Bachelor’s Degree in Biology. He went on the graduate with a Bachelor’s degree in Botany from the University of Hawaii in Manoa in 1970 and Master of Arts in Anthropology from the same college.\n\nFrom the University of California, Berkeley, he obtained his Ph.D. in 1978 in nutritional ethnomedicine. This versatile personality thus has a respectable education qualification.\n\nMichael changed his last name to Savage after being highly inspired by Charles Savage, a 19th-century sailor who presumably was the first man to bring firearms to Fiji.\n\nMichael Savage's Career\n\nMichael was the host of the show The Savage Nation which aired on the Talk Radio Network and was the second most-listened-to radio talk show in the US in 2009.\n\nHe hosted the show from 2009 to 2012. Prior to obtaining his first show, Savage was a stone gatehouse keeper of the Hitchc* * k Cattle Company. Since 2009, Cumulus Media Networks has syndicated him.\n\nAlong with a radio host, Savage is an author who has written several books. His books, under his real name Michael Weiner, range from homeopathy to herbal medicine and nutrition. Four of the political books that he has written under his pseudonym Michael Savage have been New York Times Bestsellers.\n\nHis ideologies are considered by himself to be of conservative nationalism while critics think that he fosters hatred. Savage is a supporter of the English only movement and highly criticizes illegal immigration to the United States and the philosophies of progressivism and liberalism. For his provoking thoughts, he has been barred from entering the United Kingdom since 2009.\n\nMichael Savage's Net Worth And Salary\n\nMichael is a well-known and highly respected person with a net worth of $50 million at present. He has homes in Tiburon, Larkspur, California and Marin County and an apartment in San Francisco.\n\nFrom a troubled childhood to having a huge net worth and fan following, Michael has surely worked hard to reach this point and shall always be respected for doing so.\n\nMichael Savage's Personal Life\n\nSavage married Carol Ely on 1964. The relationship however ended in divorce. He met his current wife Janet and married her in 1967. They have two children; son Russell Weiner and daughter Rebeccas Lin Yops.\n\nTheir son founded the company that produces the energy drink Rockstar and Janet served as the CFO of the company until 2009. He and his family currently live in Fairfax, California.\n\nAge, Body Measurements and Other Facts"}, {"url": "https://wealthygorilla.com/michael-savage-net-worth/", "page_content": "What is Jenna Bush Hager’s net worth?\n\nIntroduction\n\nJenna Welch Bush is an author, journalist, and news correspondent who has made her fortune on the Today show.\n\nAlthough she is best known as the daughter of former president George W. Bush, Jenna has created her own legacy as a talented television presenter.\n\nWhile she started her television career in 2009, she has no plans to leave the Today show, and we can expect to see her active for many more seasons.\n\nAs of June 2023, Jenna Bush Hager’s net worth is estimated to be $14 million.\n\nJenna Bush Hager Facts\n\nJenna Bush worked as a teacher’s aide in Washington, D.C., in 2006.\n\nThe following year, she published her first book based on her experiences with UNICEF, with the proceeds from sales going to charity.\n\nShe became the editor-at-large of Southern Living magazine in 2012.\n\nIn 2009, she started working as a correspondent for NBC News.\n\nSince 2019, Jenna has been a co-anchor on Today with Hoda & Jenna.\n\nEarly Life\n\nJenna Welch Bush was born November 25, 1981, in Dallas, Texas, to Laura and George W. Bush, and she was named after her maternal grandmother, Jenna Hawkins Welch.\n\nWhile living in Dallas, she attended Preston Hollow Elementary School and The Hockaday School until her father was elected Governor of Texas, and they moved to Austin.\n\nShe then attended St. Andrew’s Episcopal School and Austin High School from 1996 until her graduation in 2000.\n\nWhen her father became president in 2001, she started attending the University of Texas while also taking summer classes at New York University.\n\nIn New York, she was a legacy member of her mother’s sorority, Kappa Alpha Theta, but Jenna and her sister quickly made headlines when they were both arrested on alcohol-related charges in April of 2001.\n\nAfter graduating from the University of Texas at Austin in 2004 with a degree in English, she started making media appearances on behalf of her father’s re-election campaign.\n\nCareer\n\nBefore leaving Washington in 2006, Jenna Bush worked at Elsie Whitlow Stokes Community Freedom Charter School as a teacher’s aide.\n\nHowever, after taking a leave of absence to work on an internship for UNICEF in Latin America, she came back and decided to write a book while also working as a part-time reading coordinator at the SEED Public Charter School in Baltimore.\n\nThe following year she published her first book, Ana’s Story: A Journey of Hope, which chronicles her work with UNICEF in Latin America.\n\nIn 2008, she published another book, Read All About It!, which was written and designed in collaboration with her mother to encourage children to read.\n\nJenna joined NBC News in 2009, first as a correspondent and then as a Today show contributor and anchor. In the early days of her tenure at Today, she quickly worked her way up to filling in for veteran anchors Kathie Lee Gifford and Hoda Kotb.\n\nShe was able to interview Michelle Obama in 2018, discussing the former First Lady’s challenges of raising her daughters in the White House and the political atmosphere since her husband left office.\n\nIn 2019, she started Read with Jenna, a monthly book club hosted on the Today show, and a month later took over as a co-anchor for the fourth hour after Kathie Lee Gifford resigned.\n\nJenna also reacted very strongly on-air while reporting on the United States Capitol insurrection following Donald Trump’s defeat by Joe Biden in the 2020 election. She denounced the actions in real-time while also reminiscing on her time spent in the building.\n\nJenna Bush Hager’s Career Earnings\n\nWhile Jenna Bush isn’t one of the richest authors in the world, she has amassed a large fortune all her own.\n\nAlthough we don’t know everything about her earnings, we do know that she has earned roughly $7 million as a journalist and published author.\n\nHer average monthly salary is estimated to be upwards of $80k, earning her around $1 million every year.\n\nWith her next book slated to be released in 2023, we expect to see an increase in her earnings as she experiences an uptick in sales.\n\nPersonal Life\n\nJenna Bush met her husband, Chase Hager, during the 2004 presidential campaign, and they eventually became engaged in 2007.\n\nThe couple married in 2008 during a private ceremony at her parents’ Prairie Chapel Ranch in Crawford, Texas. Together they have three children; Mila, Hal, and Poppy Hager.\n\nDespite being the daughter of a Republican president, Jenna is registered as an Independent, though she usually identifies herself as nonpartisan.\n\nOn social media, she is active on her official Instagram account, where she posts about her family, her career, and her latest books.\n\nShe can also be found on her official Twitter account, which she uses to interact with fans and promote her work to a larger audience.\n\nHow Does Jenna Bush Hager Spend Her Money?\n\nJenna Bush listed her New York City condo in early 2022 with an asking price of $5.4 million.\n\nShe initially purchased the property in 2015 with her husband, Henry Hager, for $4.5 million, and they have lived there since with their three children.\n\nHowever, while Jenna could have moved to any of the most expensive cities in the US, she opted to stay close to New York and set up shop on Long Island.\n\nWhile we don’t know how much she paid for her new home, the lavish cottage boasts numerous bedrooms, bathrooms, multiple living areas, and a large backyard pool.\n\nHighlights\n\nJenna Bush has accomplished a lot during her life and career, both as the daughter of a president and as a dedicated journalist.\n\nWhile she has reached many impressive milestones, some stand out more than others for their impact on her overall success.\n\nHere are some of the best highlights of Jenna Bush Hager’s career:\n\nJenna Bush published Ana’s Story: A Journey of Hope in 2007, chronicling her experiences working with UNICEF in Latin America.\n\nIn 2012, Bush became the editor-at-large of Southern Living magazine after the success of her book.\n\nShe started working as a correspondent for NBC News on the Today show in 2009.\n\nJenna was able to interview Barack Obama’s wife and former First Lady, Michelle, in 2018.\n\nIn 2020, she published her fifth book, Everything Beautiful in Its Time: Seasons of Love and Loss.\n\nLike Tim Gunn, Jenna Bush has a lot of accomplishments to be proud of, and her work as an author and journalist has earned her a lot of praise.\n\nSince she has no plans of retiring any time soon, we can expect to see much more from her in the future as she continues her career.\n\nFavorite Jenna Bush HagerQuotes\n\nJenna Bush has built a successful career on her passions, and she has accomplished a lot as an author and journalist.\n\nIt is evident that she puts her heart and soul into everything she does, and this dedication has paid off greatly for her.\n\nHere are our favorite quotes from Jenna Bush Hager:\n\n“The world is such a big place, and there’s so much that goes on, but a lot of the media really just cover the same thing over and over again.” – Jenna Bush Hager\n\n“I hope to focus on what I’m passionate about because I think I’d do the best job on them – education, urban education, women and children’s issues, and literacy.” – Jenna Bush Hager\n\n“People ask me if I ever see my father and I say yes because he puts in the effort. He calls all the time to tell us he’s proud of us.” – Jenna Bush Hager\n\n“I think I’ve become more like my mom just because of what we’re both interested in, children and teaching and writing.” – Jenna Bush Hager\n\n“You have to give kids things they’re interested in reading. That’s what teachers who are engaged in what their students want.” – Jenna Bush Hager\n\n3 Amazing Lessons From Jenna Bush Hager\n\nThere is a lot we can learn from Jenna Bush and her successful career as an author and television journalist.\n\nNow that you know all about Jenna Bush Hager’s net worth,\n\nHere are some of the best success lessons to learn from Jenna Bush Hager:\n\n1. Follow Your Passions\n\nIf you want to become successful, sometimes the best thing you can do is follow your passion.\n\nIf you are dedicated enough to something, you will be willing to put in the hard work necessary to find success.\n\n2. Never Stop Learning\n\nKnowledge is powerful, and it is something you need if you want to get ahead of the competition.\n\nWhile spending time learning may not seem like fun, it is vital if you want to become the best you can be.\n\n3. Be Proud Of Your Accomplishments\n\nNo matter how small your accomplishments may seem, you should always be proud of what you’ve achieved.\n\nEven the smallest victories can have big impacts on your success, and they can be great motivation.\n\nSummary\n\nJenna Bush may have become well-known thanks to her father, George, but her success since 2000 has been all her own.\n\nWhile she has worked on the Today show since 2009, she remains a co-anchor today, and she seems to have no plans to leave anytime soon.\n\nMake sure to check back often so that you don’t miss any updates on Jenna Bush’s life, career, and wealth!\n\nAs of June 2023, Jenna Bush Hager’s net worth is estimated to be $14 million.\n\nWhat do you think about Jenna Bush Hager’s net worth? Leave a comment below."}, {"url": "https://freshfiction.com/author.php?id=30397", "page_content": "\n\nGreat Summer reading - June releases\n\nSince your web browser does not support JavaScript, here is a non-JavaScript version of the image slideshow:\n\nWhat if her perfect life wasn't so perfect after all?\n\n\"Brims with vivid imagery.\"�Jen Turano, bestselling author\n\nThe marriage is fake, but the passion is real.\n\nA charity collection of 22, never-before-published, brand-new stories featuring and benefiting love and Happily Ever Afters across the gender and sexual identity spectrums.\n\nA husband-and-wife disguise�His only hope for survival.\n\nWho knew patrolling a National Park could be this hazardous?\n\nBrave heroes who rise up to take down a treacherous gang bent on robbery and destruction, to keep their homes, and the women they love safe�\n\nMichael Savage\n\nDr. Michael Savage is a multimedia icon in the conservative movement, heard by 10 million listeners a week on “The Michael Savage Show” and syndicated across the U.S. in more than 300 markets. He is also the author of 25 books, including four New York Times best-sellers. In 2007, his media presence and profile earned him the coveted “Freedom of Speech Award” from Talkers Magazine. His passion to unearth the truth about liberalism, borders, language and culture, and his unparalleled stand for America’s families, has made him the most important figure in the fight for free speech and ideals in America today. He is the only member of the U.S. media ever blacklisted and banned from a Western nation. His ban from visiting Britain in June 2009 has made him the “poster child” for free speech, not only for Americans concerned about the cultural shift towards totalitarianism and their rights to freedom of expression, but for people around the globe. In mid-2009, this worldwide media attention concerning the ban resulted in a New Yorker magazine profile of him. Savage’s first novel, “Abuse of Power,” became a New York Times best-seller in September. The thriller is a fictionalized account of being banned from Britain and hunted by overbearing governments. Dr. Savage holds a master’s degree in medical botany and a second in medical anthropology. Additionally, he earned his PhD. from the University of California at Berkeley in epidemiology and nutrition sciences. He is an ardent conservationist, is dedicated to his family and is a proud patriot of his country. Log In to see more information about Michael Savage\n\nLog in or register now! Series Books: Countdown to Mecca, May 2015\n\nHardcover / e-Book\n\nA Time For War, February 2013\n\nHardcover / e-Book\n\n"}, {"url": "https://www.orderofbooks.com/authors/michael-savage/", "page_content": "Michael Savage is an American author and conservative voice. He’s also a radio host, activist, and nutritionist, among other things. Michael Savage is actually just his professional name as he was born Michael Alan Weiner.\n\nSavage was born in The Bronx, New York and went on to attend Queens College where he earned a bachelor’s degree in biology. He would later go on to continue his education, and he holds master’s degrees from the University of Hawaii in medical botany and medical anthropology, as well as a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine. While Savage has written numerous bestsellers in non-fiction, this article only refers to his work as a fiction author.\n\nPublication Order of Jack Hatfield Books\n\nPublication Order of Short Stories/Novellas\n\nPublication Order of Short Story Collections\n\nPublication Order of Non-Fiction Books\n\nIf You Like Michael Savage Books, You’ll Love…\n\nAbuse of Power is the first book in the Jack Hatfield series. Hatfield is a former war correspondent who rose to prominence for his solid reputation and commentary. However, he has recently been smeared by a radical leftist media group and he loses his job. He’s now working as a freelance news producer in San Francisco and goes on a ride-along with the SFPD bomb squad. A routine carjacking turns into something much more and several pounds of military-grade explosives are found. The FBI wants him to stay out of it, but Hatfield won’t be stopped so easily and begins an investigation into something that may be bigger than 9/11.\n\nThe second book in the series is called A Time for War. This book sees a series of seemingly unrelated events – a helicopter filled with Navy Seals crashing, a FBI car is mysteriously rendered immobile, a Chinese agent is found floating in the bay of San Francisco – that only Jack Hatfield sees as the conspiracy that it is. Hatfield will pursue a trail of clues that could save the United States from catastrophe."}, {"url": "https://www.nytimes.com/2020/04/16/us/politics/michael-savage-trump-coronavirus.html", "page_content": "Much of the time, Mr. Savage still sounds like any other right-wing shock jock — making fun of Nancy Pelosi and doubting the validity of the #MeToo movement. But on the subject of the coronavirus, Mr. Savage has become one of the loudest voices of dissent on the right.\n\nHis views are a striking departure from the accepted version of events among Mr. Trump’s loyalists in the media, who have made a concerted effort to deny that they downplayed the epidemic. Mr. Savage has attacked the credibility of the conservative media, accused its biggest stars of being too rote and unthinking in their defense of the president, and demanded that they be held accountable for misleading millions of Americans.\n\n“We’re living in a terrible time in America where truth has died,” Mr. Savage, who was one of the first conservative media stars to urge Mr. Trump to run for president, told his audience. “This is crazy,” he added, pointing to the way the president’s defenders always accuse the left of spreading “fake news.”\n\n“How can we not let our side be called on the carpet when they lie to the people?”\n\nThat was Feb. 24.\n\nAt the time, coronavirus outbreaks were largely limited to a handful of countries like China, South Korea and Italy. Only a few dozen cases had been reported in the United States. The same day, Rush Limbaugh likened the coronavirus to the common cold on his radio program. But it spread aggressively in America just as Mr. Savage had warned it would — a prediction that earned him the ire of people who called him a hysteric and a sellout.\n\nHis contempt for hosts like Mr. Limbaugh and Sean Hannity, whose top-rated radio shows draw more than 30 million listeners each week, is especially searing. He mocks them as “Dr. Hannity” and “Rush Limbaugh, M.D., Ph.D.,” belittles their lack of education compared with his, and berates people who took their claims seriously."}, {"url": "https://www.audible.com/author/Michael-Savage/B001HCV63K", "page_content": "Dr. Michael Savage is a multimedia icon in the conservative movement. The Telegraph in the U.K. ranked Michael Savage as one of the most influential conservatives in the United States, and with ten million weekly listeners, the Berkeley Ph.D. is the third most listened-to conservative talk-show host. Recently featured in The New Yorker and Playboy, Dr. Savage is the author of twenty-five books, including four New York Times bestsellers. His media presence and profile earned him the coveted Freedom of Speech Award from Talkers magazine in 2007. Dr. Savage holds a master's degree in medical botany and a second in medical anthropology. Additionally, he earned his Ph.D. from the University of California at Berkeley in epidemiology and nutrition sciences. He is an ardent conservationist, is dedicated to his family, and is a proud patriot of his country.\n\nRead more\n\nRead less"}], "Michael Savage is an activist.": [{"url": "https://www.wikiwand.com/en/Michael_Savage", "page_content": "Michael Alan Weiner (born March 31, 1942), known by his professional name Michael Savage, is an American right-wing author, political commentator, activist, and former radio host.[1][2] Savage is best known as the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2021, and in 2009 was the second most listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States.[3][4] From October 23, 2012, to January 1, 2021, Michael Savage had been syndicated by Cumulus Media and Westwood One. He holds master's degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine. As Michael Weiner, he has written books on nutrition, herbal medicine, and homeopathy; as Michael Savage, he has written several political books that have reached The New York Times Best Seller list.\n\nU.S. radio talk show host and author\n\nQuick facts: Michael Savage, Born, Alma mater, Occupa... ▼\n\nSavage has summarized his political philosophy in three words: borders, language, and culture. He has characterized his views as conservative nationalism, while critics have characterized them as \"fostering extremism.\"[5] He supports the English-only movement and argues that liberalism and progressivism are degrading American culture. Although his radio delivery is mainly characterized as politically themed, he also often covers topics such as medicine, nutrition, music, literature, history, theology, philosophy, sports, business, economics, and culture, and tells personal anecdotes.\n\nIn 2009, Savage was placed on a list of people permanently banned from entering the United Kingdom by British Home Secretary for \"seeking to provoke others to serious criminal acts and fostering hatred.\"[5][6][7]"}, {"url": "https://www.splcenter.org/hatewatch/2014/11/05/savage%E2%80%99s-new-book-not-about-averting-fomenting-civil-war", "page_content": "\n\nGiven the title, you might think that Michael Savage’s Stop the Coming Civil War: My Savage Truth would be about preventing and healing the nation’s cultural rift before it erupts into violence. Instead, what he delivers is a manifesto accusing the Obama administration of fomenting just such a war—a war only far-right ideologues like himself can prevent.\n\nNone of this is really a surprise given Savage’s long history of incendiary right-wing extremism and hateful rhetoric. In recent months, though, Savage has been ratcheting up attacks to extraordinary levels, claiming that President Obama is trying to wipe out Americans by allowing migrant children to bring disease and culture across the border; that he is trying to bring an Ebola epidemic to the United States; and that soldiers with post-traumatic stress disorder—who he called “a bunch of losers”—are weaklings symptomatic of the forces he believes are destroying the country. He also wants the new Republican Congress to promptly arrest the president.\n\nTrue to form, Stop the Coming Civil War is replete with the usual right-wing attacks on Obama, who he claims is “a metrosexual”intent on destroying the nation and placing it under a dictatorship. True patriots, he claims, will rise up to resist this.\n\nIndeed, the book is an endless parade of classic far-right conspiracy theories and vicious, factually groundless fear mongering. From the idea that “cultural Marxism”is a force hellbent on ruining the world, to attacks on Obama as a “socialist”president, Savage covers the gamut of far-right conspiracy theories in fine fashion.Perhaps most notable among Savage’s claims is that the Obama administration is preparing to wage a “war on white people”that will give the government a pretext for imposing a dictatorship with global players, including the Roman Catholic Church and Pope Francis.\n\nIn the opening chapter, Savage intones:\n\nRight now the nation is a tinderbox that can easily go up in flames, because we’re increasingly under the thumb of an administration that is destroying our two-hundred-year-old tradition of defending our borders, language, and culture and replacing it with a culture of statelessness and corruption.\n\nSavage writes that “we’re living in a nation more divided than any since Lincoln’s presidency, and we’ve entered a time and place that may be as dangerous as it was during the Lincoln years. I worry, though, that as happened in Lincoln’s time, we’re moving not toward expanded freedom but toward civil war.”\n\nKeeping true to that antigovernment line of logic, Savage claims the administration wants to spark such a civil war in order for “this crony government to consolidate the power it has already granted itself through the broad use of executive orders, the power granted to Cabinet secretaries and other political appointees, and the unwillingness of our lawmakers to step in and put a halt to this takeover.”\n\nWith our nation divided, the government could marshal all of those on its side—the Transportation Security Administration (TSA), street gangs, the National Guard, a military now purged of patriotic generals and without a command structure loyal to the Constitution--against those who would stand up to the oppression.\n\nWhile promoting the book, Savage has been more explicit about just who the government will be waging this civil war against: white Americans. “It’s very important to understand this. This entire federal government is geared up to fight a war against white people,” Savage told his listeners recently. He also warned them that the administration is “planning to mow down all you white crackers.”\n\nAlong with his fellow conspiracy theorists such as Alex Jones, Savage believes that the global economy is on the verge of a massive collapse that will bring about social chaos and violence, leaving ordinary people with no choice but to submit to a globalist “New World Order” government.\n\n“The United States,” Savage writes, “may well be in the midst of a military, economic, and cultural collapse that is turning us into a country in danger of catastrophic failure and leading to the nightmarish scenario of a civil war.”\n\nSavage claims that the entire Obama presidency is the product of a massive conspiracy: “The financial crash of 2008 was engineered by an elite group of financial professionals in order to help ensure the election of Barack Obama and guarantee the continued complicity of the U.S. government and its cadre of economic advisors,” he writes.\n\nSavage contends that the nefarious driver behind this “takeover” is “cultural Marxism,” a concept that has enjoyed favor on the extremist right for over a decade as an umbrella for conspiracist beliefs that liberals intend to destroy America from within. Anders Behring Breivik, the Norwegian terrorist who slaughtered 77 people during a 2011 rampage, devoted much of his manifesto explaining his actions to his obsession with “cultural Marxism.” Savage, unsurprisingly, claimed that Breivik’s rampage actually was the result of a left-wing conspiracy.\n\nBut unlike many of his fellow civil war enthusiasts on the right, Savage only hints at offering any kind of armed resistance to the Obama administration. At one point he says: “We need a national group of Green Mountain Boys,”referring to a “militia group headed by Ethan Allen” he describes.\n\nMostly, he enthusiastically foments the idea of a modern civil war by claiming that it is liberals and the left who are attempting to force such a conflict on Americans:\n\nThe Savage Truth of the matter is that our government is preparing for nothing less than the next civil war. It’s marshaling forces to be used against the American people, but the very divisions that the government is creating are causing many Americans to think about what we must do to resist this government takeover.\n\nThere is no small irony in this, given that up to this point, Americans have been hearing in from a variety of conservative and far-right ideologues that a civil war is needed from the right in order to resist the democratically elected Obama administration and its policies.\n\nIndeed, far-right hero Cliven Bundy—the Nevada rancher whose standoff in April with federal agents nearly resulted in a shootout—claimed afterwards to his fellow “Patriots” that the Lord told him that he needed to face down the agents, or the nation would need to “face these arms in a civil war”with the federal government. A speaker at Bundy’s ranch, militia figure Mike Vanderboegh, ranted that “we are still staring a civil war in its bloody face.”\n\nLike his fellow right-wing extremists, Savage makes clear in his book that he too is an enthusiast about the idea of a civil war as a form of political resistance to a democratically elected president. His book’s half-clever conceit—that it’s about heading off a civil war, so that Savage can’t be accused of fomenting civil unrest—rests entirely on the risible contention that Obama administration policy is intended to inflame tensions and drive angry Americans to violence.\n\nThere is a well-known psychological term for this: projection."}, {"url": "https://wiki.alquds.edu/?query=Michael_Savage", "page_content": "U.S. radio talk show host and author\n\nFor other people named Michael Savage, see Michael Savage (disambiguation)\n\nMichael Alan Weiner (born March 31, 1942), known by his professional name Michael Savage, is an American right-wing author, political commentator, activist, and former radio host.[1][2] Savage is best known as the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2021, and in 2009 was the second most listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States.[3][4] From October 23, 2012, to January 1, 2021, Michael Savage had been syndicated by Cumulus Media and Westwood One. He holds master's degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine. As Michael Weiner, he has written books on nutrition, herbal medicine, and homeopathy; as Michael Savage, he has written several political books that have reached The New York Times Best Seller list.\n\nSavage has summarized his political philosophy in three words: borders, language, and culture. He has characterized his views as conservative nationalism, while critics have characterized them as \"fostering extremism.\"[5] He supports the English-only movement and argues that liberalism and progressivism are degrading American culture. Although his radio delivery is mainly characterized as politically themed, he also often covers topics such as medicine, nutrition, music, literature, history, theology, philosophy, sports, business, economics, and culture, and tells personal anecdotes.\n\nIn 2009, Savage was placed on a list of people permanently banned from entering the United Kingdom by British Home Secretary for \"seeking to provoke others to serious criminal acts and fostering hatred.\"[5][6][7]\n\nEarly life and education [ edit ]\n\nSavage was born Michael Alan Weiner[8] in the Bronx, New York, one of three children of Benjamin Weiner, a Jewish immigrant from Russia.[9][10][8][11] His mother, Rae, was from Montreal, Canada.[12]\n\nHe described his childhood as difficult, with a \"gruff, profane\" father who would frequently criticize and belittle him.[10] His younger brother, Jerome, was born with developmental disabilities and was unable to hear or speak. Jerome died in 1969. His father, the owner of an antiques shop, died of a heart attack at age 57 in 1970, and his mother died in 2003.[9][8]\n\nAfter graduating from Jamaica High School in 1958,[13][14] Savage attended Queens College, where he earned a bachelor's degree in biology in 1963.[8] After college, Savage taught high school for several years in New York City. His first marriage in 1964 to Carol Ely ended in divorce, and he remarried in 1967 after meeting his current wife, Janet. During this time, Savage also worked for famous psychedelic drug advocate Timothy Leary as keeper of the stone gatehouse on the Hitchcock Cattle Company estate in Millbrook, New York, to which Leary had been given access. Leary hired him to the post because Savage did not use LSD.[10] Savage then studied at the University of Hawaii at Manoa, earning a Master of Science in botany in 1970 and a Master of Arts in anthropology in 1972.[15][16] He obtained a PhD in 1978 from the University of California, Berkeley, in nutritional ethnomedicine.[17][18] His thesis was titled Nutritional Ethnomedicine in Fiji.[19]\n\nShift in political opinions [ edit ]\n\nSavage introduced himself to certain writers in the North Beach neighborhood of San Francisco in the 1970s.[20] He befriended and traveled with Beat poets Allen Ginsberg and Lawrence Ferlinghetti. Savage maintained a correspondence with Ginsberg consisting of ten letters and three postcards across four years, which is maintained with Ginsberg's papers at Stanford University.[10][21] One letter asked for Ginsberg and Ferlinghetti to come do a poetry reading, so others could \"hear and see and know why I adore your public image.\"[11] Another acquaintance was poet and author Neeli Cherkovski, who says that Savage dreamed of becoming a stand-up comic in the mold of Lenny Bruce.[10]\n\nAcquaintance Robert Cathcart says that by 1980, in his private conversations with Savage, he knew him to have conservative political views.[20] Schwartz[who?] stated Savage became alienated from the North Beach scene in the early 1980s. Savage had intense arguments with his liberal friends.[20] When asked about his shift in politics and other views, Savage replied, \"I was once a child; I am now a man.\"[11] Savage has cited many occurrences in his life that helped shape his conservative views. Savage states that his opinions on welfare were partly shaped by his first job out of college as a social worker.[22] He described one incident in which his supervisor had him deliver a check to a welfare client to furnish their apartment, while his own apartment was furnished with cardboard boxes.[23] Another turning point occurred for him as a writer of health and nutrition books in the 1980s, when he experienced what he saw as \"political opposition\" after making the suggestion that the closure of homosexual bathhouses might be necessary in response to the emerging HIV/AIDS epidemic.[24] In 1994 his final health and nutrition manuscript, Immigrants and Epidemics, was rejected by publishers for being inflammatory.[25] In 1996, Savage applied to become the Dean of the Graduate School of Journalism at the University of California, Berkeley. The university instead selected award-winning journalist and China scholar Orville Schell. Savage sued the university, contending discrimination for being conservative.[20] Savage later dropped the lawsuit.[26]\n\nRadio [ edit ]\n\nThe rejection by publishers of his 1994 manuscript about illegal immigration and epidemics prompted Savage to record a demo tape with a mock radio talk show about the contents of the work. He mailed this tape to 250 radio stations in an attempt to change careers and become a radio talk show host.[20] On March 21, 1994, Savage began his radio career on KGO (a San Francisco news/talk radio station) as a fill-in host for liberal Ray Taliaferro's overnight show and later as a weekend host. At the time, his slogan was \"To the right of Rush and to the left of God.\" The show quickly became a local hit.\n\nLater in 1994, KGO parent company Capital Cities/ABC Inc. purchased the station KSFO and changed it to a conservative talk format.[27] On January 2, 1995, the first day of KSFO's new format, Savage debuted as host of afternoon drive time show The Savage Nation.[27][28] By 2000, Savage was the most popular afternoon drive host among all adults in San Francisco Arbitron ratings.[29]\n\nIn 1999, Talk Radio Network began syndicating part of The Savage Nation nationally.[30] Starting September 21, 2000, The Savage Nation became an entirely national show distributed by TRN.[31]\n\nIn mid-2006, Savage had 8–10 million listeners per week,[32] which made his show the third most widely heard broadcast in the United States at that time. Savage has described his listeners as \"literate callers with intelligence, wit, and energy.\" He has described his show's production as one with a \"... hard edge combined with humor and education ... Those who listen to me say they hear a bit of Plato, Henry Miller, Jack Kerouac, Moses, Jesus, and Frankenstein.\"[33] Mark de la Viña of the San Jose Mercury News wrote of Savage: \"In contrast to Rush Limbaugh, Sean Hannity and Laura Schlessinger, Bay Area-based Savage mixes conservative diatribe and blunt observations with acerbic humor and the gift of gab.\"[11]\n\nBy 2009, The Savage Nation had an audience of 8 to 10 million listeners on 400 stations across the United States, making it the second most listened-to radio talk show in the country at the time.[3][4] Around that time, Savage asked his audience for their opinion prior to consenting to a profile interview by Kelefa Sanneh of The New Yorker; Savage eventually accepted that offer and the New Yorker profile, titled \"Party of One\", was published in the August 3, 2009, issue, which covered Savage's life and personality in great detail.[8][34]\n\nOn September 10, 2009, KNEW (910 kHz) in Savage's home market of San Francisco announced that it was dropping his program and replacing him with John and Ken from sister station KFI (640 kHz)—Los Angeles.[35] John Scott, program director of KNEW said in an email that the station was headed \"... in a different philosophical and ideological direction, featuring more contemporary content and more local information.\"[36] According to Arbitron monthly ratings, KNEW dropped in the ratings since Savage was let go. San Francisco station KTRB picked up the program for the San Francisco market, and saw a ratings boost in the afternoon drive. However, the program was among the first casualties when KTRB went into receivership in September 2010.[37]\n\nOn January 22, 2010, Savage revealed to his audience that a writer for Playboy had contacted him via email to do a lengthy interview, and again asked his listeners if he should accept the offer. During the show, Savage read from personal emails between the Playboy writer and himself. The writer admitted to being a listener of the Savage Nation but a critic of the profile done by The New Yorker. The writer also stated that the purpose of the interview was to \"rattle\" Playboy's readers. On May 12, 2010, Savage revealed that he had granted the interview at his home. Playboy published the interview in June 2010.[23] He read from a pre-publication copy of the 8,000-word Playboy interview, in which the writer expressed animosity for Savage and his views. Savage said that he was disappointed at the lack of journalistic objectivity, but did not harbor hatred for the writer. He referred back to the New Yorker interview by Kelefa Sanneh, and praised Sanneh as a \"real writer\" who had understood his subject.\n\nOn September 27, 2012, Savage's talk show left the airwaves after he won a legal battle with Talk Radio Network, his longtime employer, and his attorney said discussions with new networks were underway.[38] Savage began an occasional series of video webcasts via Ustream on September 30, 2012. On October 17, 2012, Savage and his new syndicator Cumulus Media Networks announced that they had made a deal and the program, after several weeks off the air, would be returning as of October 23, 2012.[39] By April 2013, according to the radio industry's Talkers Magazine, Savage had 3.5+ million weekly listeners, putting him in a six-way tie for sixth place, and six talk show hosts getting 7.5+ million weekly listeners.[40] On September 26, 2013, Cumulus Media Networks announced that Michael Savage's radio show, The Savage Nation, would move to the 3p-6p ET time-slot beginning in January 2014. This time slot had been occupied by Sean Hannity.[41]\n\nIn January 2015, it was announced that Savage and Westwood One had reached agreement on a long-term contract renewal for The Savage Nation.[42]\n\nIn January 2019, Savage in collaboration with Westwood One introduced a podcast format with a mixture of live-broadcast and studio material.[43]\n\nOn March 24, 2019, Savage celebrated the 25th Anniversary of the radio show.[44]\n\nOn January 1, 2021, The Savage Nation was discontinued by Cumulus Media and Westwood One.\n\nTV [ edit ]\n\nSavage had a brief political talk show on MSNBC beginning March 8, 2003, and ending July 7, 2003. Savage was hired by MSNBC president Erik Sorenson to do the one-hour show despite Savage's previous criticism of the network in his book The Savage Nation and the objections of NBC employees. Sorenson called Savage \"brash, passionate and smart,\" and promised that he would provide \"compelling opinion and analysis with an edge.\"[45] After four months, Savage was fired from the show after remarks made in response to a caller, later identified as prank caller Bob Foster, caused controversy in the gay community.\n\nSavage is a regular guest on Newsmax television with appearances on \"Stinchfield\" and \"The Count.\"\n\nPodcast [ edit ]\n\nIn 2019 Savage launched a podcast.[46] The Savage Nation Podcast posted episodes on Tuesdays, Thursdays, and Fridays.[47][48]\n\nPolitical views [ edit ]\n\nMichael Savage calls himself an \"independent-minded individualist\" and says that he \"fits no stereotype.\"[33] In a 2006 interview, Savage cited Barry Goldwater as an influence, saying “I’m a Goldwater conservative…. If [another] Goldwater appeared, I’d work for him, I’d give money to him\"[49]\n\nSavage criticizes big government as well as liberalism and liberal activism, and accuses the mainstream news media of liberal bias. He considers the three aspects that define a nation as borders, language, and culture;[17] those aspects inspired the motto of the Paul Revere Society.[50]\n\nWildlife conservation [ edit ]\n\nSavage is a longtime advocate of wildlife conservation, and often points out that \"conservative\" and \"conservation\" have the same root, meaning \"to conserve\". He argues that conservatives should \"own\" environmental protection and conservation of wildlife resources. A December 2017 Huffington Post article quotes Savage regarding President Trump's revoking of an Obama-era trophy hunting ban: \"... long-time animal activist Michael Savage ... implored the president to reconsider:\n\n'Not all Obama legislation was bad,” said Savage. 'Some of it (like this) was grand.' \"\n\nThe article continues ... \"Savage also addressed the (biblical) aspects of killing an elephant, lion or giraffe, animals that we don’t normally hunt.\n\n'Dominion over animals doesn’t mean destroying or terrorizing them,' he said.\"[51]\n\nA March 2018 article at The Hill quotes him at greater length: \"Conservative radio host Michael Savage has also spoken out against the Fish & Wildlife Service proposed policy this week, writing in a blog post Wednesday that he 'felt betrayed' by the administration’s secret decision after having previously spoken in person with Trump on the issue.\n\n'I had spent a dinner talking to the President about environmental issues, and especially this, and this is what happened anyway,' Savage wrote. 'I made it clear that this was a red line that could not be crossed, that now elephants, lions and other big game had a target painted on them. I explained that the root of ‘conservative’ is the same as ‘conservation’ and the two do not need to be diametrically opposed. I explained what was meant by dominion, as I carefully spelled out in God Faith and Reason.' 'We hope that the president will step in here and overrule this order,' he added.'[52]\n\nThe private meeting with President Donald Trump at Mar-a-Lago[53] followed a series of pleas on his radio show for Trump to support legislation that protected wildlife.[54] In August 2019, following the Trump administration's reauthorization of the use of cyanide bombs against wild animals,[55] Savage called on the White House and the US Environmental Protection Agency to reverse approval.[56]\n\nImmigration [ edit ]\n\nSavage opposes immigration, citing the black tar heroin epidemic, large percentage of immigrant prisoners, illegal use of public services, and diminishing American nationalism.[57] in a tweet on May 17, 2019, Michael said, \"Read my lips: no new immigrants.\"[17] He frequently warns that migrants carry diseases.[17] On March 28, 2006, following pro-immigration rallies in California, he encouraged his listeners to burn Mexican flags as an act of American nationalism to protest illegal immigration from Mexico.[58][59]\n\nEuropean Union [ edit ]\n\nSavage describes the European Union as \"Hitler's dream of a united Europe under German control.\" He equates Britain's vote to leave the Union with the Second World War, saying it was \"in many ways the Battle of Britain all over again.\" Savage foresees that, after Brexit, the E.U. risks igniting a civil war to gain total control of the population for their plans of \"a new Soviet-style superstate, which have been long on the drawing books.\"[60]\n\nIn 2003, Savage said that he voted in 2000 for George W. Bush \"quite reluctantly, incidentally.\"[61] In 2004, Savage and the Revere Society hosted a party at Schroeder's Cafe in San Francisco celebrating the re-election of Bush.[50] Savage donated $5,600 to the campaign of Democratic candidate Jerry Brown in the 2006 California Attorney General election.[62]\n\nSavage strongly supported Donald Trump, a regular guest on his talk show, since Trump's June 2015 announcement of his candidacy in the United States 2016 presidential election.[citation needed] Trump has claimed to be a listener and a fan of Savage's show, and an April 2016 Salon article described Savage as having been a major influence on Trump's campaign.[63]\n\nSavage has disagreed strongly with some of Trump's actions and policies, including the appointment of John Bolton as National Security Advisor, the bombings of Syria, what Savage describes as a failure to get illegal immigration to the United States under control, and failure to protect endangered and vulnerable wild animals. Nevertheless, he has endorsed Trump for president in the 2020 United States presidential election.[64]\n\nDubai Ports World controversy [ edit ]\n\nIn early 2006, the administration of President George W. Bush approved sale of a port security contract to a company, Dubai Ports World (DP World), headquartered in The United Arab Emirates (UAE).\n\nMichael Savage was highly influential in the defeat of the deal. On February 13, the first day it was reported in the news, “Savage used his radio show to attack the transfer of American homeland assets to a company owned by an Arab state.”[65] Savage's concerns were based in part on the fact that “two of the 9/11 suicide hijackers came from the United Arab Emirates, and much of the funding for the attacks flowed through United Arab Emirates banks.”[66] On his February 17 radio show, Savage interviewed Democratic Senator Chuck Schumer of New York, a longtime nemesis with whom Savage otherwise agreed on the Dubai ports issue.[67]\n\nThe White House was listening to Savage: “Though the deal had received some newspaper attention before then, Mr. Savage's angry message raised early concerns inside the Bush White House about trouble ahead.\"[65] Savage and other opponents of the deal “generated a wave of anger from Americans across the country that left lawmakers in Washington -- by their own admission -- following their constituents much more than leading them.” Lawmakers said the negative response from constituents was overwhelming. Congressional offices on Capitol Hill were deluged by phone calls and emails protesting the deal, and congressmen told of being pulled aside wherever they went in their districts. Rep. Don Manzullo, a Republican from Illinois who is chairman of the House subcommittee on small business, said \"I got stopped all over the place,\" he said. \"People are big-time upset.\"[65]\n\nAccording to the Southern Poverty Law Center, Savage subscribes to the white genocide conspiracy theory,[68] a white nationalist belief, which claims that white people are becoming extinct through forced assimilation or violent genocide. Savage blames Barack Obama[69] and the Democratic Party for promoting the concept within the United States.[70] He has claimed there is a \"cultural genocide being promulgated against Caucasians\".[71]\n\nCOVID-19 pandemic and positions on vaccines [ edit ]\n\nA January 31, 2020, article in Stat News quoted Savage's call for a stop to flights from China: “QUARANTINE! STOP TRAVELERS FROM CHINA NOW!\"[72] Two months later, an April 16, 2020 New York Times feature article credited Savage for being one of the first in the media, especially the conservative media, to take the COVID-19 epidemic seriously. On his radio show Savage used his credentials—a PhD with training in epidemiology—to speak to his fans on coronavirus research: How the virus is transmitted; which treatments were proving effective; and the difference between morbidity and mortality rates. \"Savage's views were a departure from those of other conservative commentators, who made a concerted effort to deny that they downplayed the epidemic. Savage attacked their credibility and demanded that they be held accountable for misleading millions of Americans.\"[73] As early as February 24, 2020, Savage was saying of Limbaugh and Hannity: “How can we not let our side be called on the carpet when they lie to the people?”[73] Savage is also sharply critical of the Director of the NIAID, Dr. Anthony Fauci, dismissing him as “a grandstander” who mishandled the AIDS epidemic by refusing to close down the gay bathhouses. Savage believes that one-size-fits-all lockdowns are a threat to individual liberty, and calls instead for selective quarantine of at-risk populations.[73]\n\nIn a May 4, 2020, article in the Washington Examiner, Savage is quoted as saying he will refuse to take a coronavirus vaccine, saying that it will likely be \"ineffective and dangerous.\"[74] Savage has a history of opposing the flu vaccine, for reasons he outlined in a January 15, 2013, interview. Savage argued that the Centers for Disease Control authorities have to guess what the vaccine should be made of. “So they choose five strains out of 250-plus strains of Influenza A, and if they don’t choose the right one, you’re going to get sick,” he said. “So you’re putting your faith in the CDC’s ability to guess the one that might be a pandemic.\" He said that \"this year\" (2013), the CDC guessed right on two of the strains and wrong on one of them.[75]\n\nIn contrast to his views on the flu vaccine, Savage supports vaccines, such as for polio, that last for many years because they address an infectious agent with a low mutation rate. A 2013 Ethics Alarms article recounts Savage saying that \"...one of his heroes growing up was Jonas Salk, not because he invented the first effective polio vaccine, but because he refused to patent it, and gave it to the world for the benefit of humanity. A bit later, Savage noted that Albert Sabin, Salk’s bitter rival who later invented the oral vaccine, also declined to profit from his invention. Could all this be true, I wondered? If it is true, why did I not know about it? Why doesn’t everybody know about it? It is true. Asked why he didn’t patent his vaccine, Salk famously answered, “Can you patent the sun?”[76][77]\n\nSavage opposes wearing masks to slow the spread of COVID-19 in both indoor and outdoor settings.[citation needed] Recently, he accepted wearing masks in indoor public places.[78]\n\nActivism [ edit ]\n\nLegal defense contributions [ edit ]\n\nSavage has regularly donated money toward the legal defense of the U.S. Marines accused of murdering civilians in Haditha, Iraq; occasionally, Savage will offer proceeds from any sales through his website. Savage had regular contact with the attorneys of the accused and criticizes their treatment at Camp Pendleton.[79] Most recently, Savage has donated over $10,000 to the U.S. Marines Charity Defense Fund at the Thomas More Law Center[80] On April 25, 2007, he pledged $1 for each copy of Healing Children Naturally and Reducing the Risk of Alzheimer's purchased from his website to be donated to the U.S. Marines Defense Fund.[81] The Marines were ultimately found not guilty.\n\nAwards [ edit ]\n\nOn November 17, 2016, Savage was inducted into the National Radio Hall of Fame.[82] Savage describes this event as \"The capstone of my career.\"\n\nOn March 26, 2020, Savage was named by President Trump to serve on the Board of Directors of The Presidio Trust, which teams with the National Park Service to manage the Presidio of San Francisco, the former military fort that is part of the Golden Gate National Recreation Area. Savage stated that he hopes \"to help save this great legacy while also reminding the public of the military significance of this land.”[83] Once on the board, he regularly protested what he believed to be the museum's overemphasis on the facility's use as a Japanese American internment camp during World War II, an action he insisted was not motivated by racism but military necessity. He also did not get along with other board members, often writing them angry ALL CAPS emails about small things that greatly angered him; in turn, the rest of the board felt he could have lobbied the administration for additional funding far more intensively than he ever did, given his connections.[84] On May 20, 2021, he was ordered to resign from the Board of Directors of The Presidio Trust or he would be fired by the end of the workday. The current website for the Presidio Trust Board of Directors no longer shows him as a board member.\n\nCriticism and controversies [ edit ]\n\nIn July 2005, former CBS reporter Bernard Goldberg ranked Savage as number 61 in his book 100 People Who Are Screwing Up America. Goldberg wrote that \"Savage's brand of over-the-top bile ... puts him right in there with the angriest haters of the Left.\"[85] David Klinghoffer, a National Review columnist, speculated that The Savage Nation \"is an act, a put-on.\"[49] Various progressive advocacy groups such as GLAAD and FAIR accuse Savage of racism, homophobia, transphobia, and Islamophobia because of his controversial statements about homosexuality, Islam, feminism, sex education, and immigration.[86][87][88]\n\nOn April 17, 2006, Savage said on the topic of Muslims, \"They say, 'Oh, there's a billion of them.' I said, 'So, kill 100 million of them, then there'll be 900 million of them.' I mean, would you rather die—would you rather us die than them?\"[89] The remarks made by Savage were seriously criticized worldwide and was taken from an argument dealing with the possibility of a nuclear conflict in that region. This was repeated in the media after Savage was barred from entering the UK.[90]\n\nIn the wake of the actor Robin Williams' suicide, Savage said that suicide is an \"aggressive act\" that shows no consideration for loved ones left behind.[91] The assertion prompted criticism.[91]\n\nControversial MSNBC exchange [ edit ]\n\nSavage was hired by MSNBC to do a one-hour show which began in March 2003. Controversy arose four months later over remarks made in response to a caller who insulted Savage's teeth. Savage responded by asking if the caller was a \"sodomite\", and when the caller replied that he was, Savage said:\n\n\"Oh, so you're one of those sodomites. You should only get AIDS and die, you pig. How's that? Why don't you see if you can sue me, you pig. You got nothing better to do than to put me down, you piece of garbage. You got nothing to do today? Go eat a sausage and choke on it. Get trichinosis. Now, do we have another nice caller here who's busy because he didn't have a nice night in the bathhouse who's angry at me today? Put another- put another sodomite on ... no more calls? I don't care about these bums, they mean nothing to me. They're all sausages.\"[87]\n\nThe interchange created a firestorm of protest including calls for his firing by the LGBT group GLAAD.[87] Savage apologized on his radio program and on his website. He explained that he believed that MSNBC had gone to commercial to cover the gaffe of the attempted sabotage by a prank caller and that he was off the air at the time of the offensive comments, despite the fact that clips of the segment show Savage going to commercial after he made the comments. He also said his remarks were meant only to insult the caller, not all people with AIDS. Nevertheless, MSNBC fired him within days of the event.[92]\n\nCatholic Church and immigration [ edit ]\n\nIn March 2006, Savage criticised Roman Catholic assistance to illegal immigrants (in response to statements by Cardinal Roger Mahony of Los Angeles calling it \"pastoral support\"). Bill Donohue of the Catholic League canceled an appearance on the show, saying \"what is not fine is Savage's diatribe about the 'greedy pigs' in the Catholic Church and how 'the institution is rotten from the top to the bottom.[93]\n\nC-SPAN broadcast of Talkers Award [ edit ]\n\nWhen Talkers Magazine awarded Savage with the publication's annual \"Freedom of Speech Award,\" C-SPAN opted not to broadcast a pre-recorded speech that had been sent by Savage. Although the award ceremony had received coverage in previous years, C-SPAN did not televise it due to its policy of televising such speeches only when delivered in person. Savage told his listeners to express their ire to C-SPAN through calls and e-mails to the organization.[94]\n\nDispute with CAIR [ edit ]\n\nIn early November 2007, the Council on American–Islamic Relations (CAIR) called on radio listeners to contact companies that advertise on Savage's program to express their concerns about his comments concerning Muslims. Savage was quoted as saying Muslims \"need deportation\", and that adherents of Islam would do well to \"take your religion and shove it up your behind\" because \"I'm sick of you.\"[95] On his show and website, Savage answered by accusing CAIR of supporting Hamas.\n\nOn November 5, 2007, following a campaign by CAIR meant to get Savage off the air by alerting his sponsors to the nature of his comments, Citrix Systems, Inc. pulled its advertisements from his show.[96]\n\nSavage sued CAIR for copyright infringement for using excerpts from his show on CAIR's website.[97] The suit alleged that CAIR's repackaging of Savage's comments was \"deliberately designed to obscure the specific message conveyed by Michael Savage\". The excerpts included Savage's characterization of the Qur'an as \"a throwback document\" and a \"book of hate\". CAIR called the suit \"bizarre, sloppy and baseless\".[98] On July 25, 2008, United States district court Judge Susan Illston dismissed Savage's suit against CAIR, holding that the posting of the audio clip was protected under fair use.[99] The court gave Savage the opportunity to file an amended complaint if he wanted to try to cure the defects in his suit. That amended complaint alleged that CAIR was a RICO conspirator in support of terror, including the 9/11 terror attack on the World Trade Center. Permission was granted to allow that filing but on August 14, 2008, however, Savage's lawyer, Daniel Horowitz, announced that Savage would not file an amended complaint and would drop the case.[100] CAIR then sought attorneys fees against Savage; Judge Illston denied that request.[101]\n\nAutism [ edit ]\n\nIn July 2008, Savage said that the increasing rate of autism diagnoses was the result of \"a racket\" designed to get disability payments for \"poorer families who have found a new way to be parasites on the government.\"[102] He returned to the subject on his July 16, 2008, show with the following remarks:\n\nNow, the illness du jour is autism. You know what autism is? I'll tell you what autism is. In 99 percent of the cases, it's a brat who hasn't been told to cut the act out. That's what autism is. What do you mean they scream and they're silent? They don't have a father around to tell them, \"Don't act like a moron. You'll get nowhere in life. Stop acting like a putz. Straighten up. Act like a man. Don't sit there crying and screaming, idiot.\"[103]\n\nIn July 2008 the progressive pressure group Media Matters for America picketed the studios of WOR in New York, along with parents of autistic children.[103][104] WOR issued a statement saying, \"We regret any consternation that his remarks may have caused to our listeners.\"[102] Also that day, the insurance company Aflac pulled its advertising,[105] and the Supertalk Mississippi radio network dropped Savage's program, replacing it with The Dennis Miller Show.[106] Later that evening, Savage devoted his entire three-hour program to the subject, taking calls from parents who took issue with his comments. On that show Savage stated that his remarks had been \"ripped out of context\" by \"far left Stalinists\" who want him off of the air. He appeared on Larry King Live with Glenn Beck as the substitute host for Larry King, and said that the real issue he was commenting on was the overdiagnosis of children due to pharmaceutical companies' drive to drug children for higher profits.[102] On July 25, 2008, Autism United advocates gathered to announce that several advertisers, including RadioShack, Sears, The Home Depot, and DirectBuy, would discontinue their support for Savage's show.[107]\n\nSavage's syndicator, Talk Radio Network, responded by releasing a lengthy statement, along with a selection of 20 audio clips drawn from Savage's discussions of autism, to show that the comments were taken out of context.[108]\n\nPermanently banned from entering the United Kingdom [ edit ]\n\nOn May 5, 2009, it was announced by then-Home Secretary Jacqui Smith of the Labour party that Savage was on a list of people banned from entering the United Kingdom as he is \"considered to be engaging in unacceptable behaviour by seeking to provoke others to serious criminal acts and fostering hatred which might lead to inter-community violence\".[109][110][111][112] During his radio broadcast on that same day, Savage declared that he would sue Smith personally for defamation, calling her a \"lunatic\".[113]\n\nDuring a subsequent NPR talk show, Savage said that he has never advocated violence and repeatedly invoked the United States Constitution's First Amendment. After host Neal Conan pointed out that the U.S. Constitution does not apply to the United Kingdom, Savage replied, \"No. Thank God I'm an American. But for this lunatic ... to link me up with Nazi skinheads who are killing people in Russia ... to put me in league with Hamas murderers who killed Jews on buses, is astonishing\".[114] Savage also called on his listeners to support him by canceling travel and business in Britain as well as by boycotting British-made goods, commenting, \"If they want to play hardball, we'll play hardball.\"[115] When a caller challenged Savage about his talk show rhetoric, Savage called him a \"foaming lunatic ... someone in pajamas in a mental asylum ... You're nobody and I'm not going to talk to you!\" At that point, Neal Conan invited him to leave.[114]\n\nOf the banning, the former Mayor of London, Boris Johnson, wrote: \"America still has a constitutional protection of free speech, and I have been amazed ... to see how few people in this country are willing to stick up for that elementary principle ... a country once famous for free speech is now hysterically and expensively sensitive to anything that could be taken as a slight.\"[116] After Johnson became Prime Minister in 2019, Savage's attorney requested the ban be overturned, however no action has been taken by the Conservative government as of 2020.[117][118] In The Guardian, Catherine Bennett wrote: \"The ban on Savage is so far from being a comprehensible act, so staggeringly capricious and stupid, as to defy evaluation.\"[119] Sam Leith wrote: \"Barring this shock-jock from Britain risks turning a rabid blabbermouth into a beacon for free speech.\"[90]\n\nVeteran PTSD [ edit ]\n\nOn October 14, 2014, Savage criticized veteran sufferers of posttraumatic stress disorder, accusing them of \"weakness\". According to Savage, \"Everyone has depression in their life. But if the whole nation is told, 'boo-hoo-hoo, come and get a medication, come and get treatment, talk about mental illness.' You know what you wind up with? You wind up with Obama in the White House and liars in every phase of the government. That's what you wind up with. It's a weak, sick, nation. A weak, sick, broken nation. And you need men like me to save the country. You need men to stand up and say stop crying like a baby over everything ... No wonder we're being laughed at around the world. No wonder ISIS can defeat our military.\"[120]\n\nPersonal life [ edit ]\n\nWhile in the South Pacific, he became fascinated with the 19th-century sailor Charles Savage, who was believed to have been the first man to bring firearms to Fiji.[26] That fascination led to Weiner's name change to Savage.\n\nSavage and his second wife, Janet, have two children, a daughter Rebecca Lin Weiner Yops born on March 2, 1967, and a son; his son, Russell Weiner, born on February 15, 1970, is the founder of the company that produces the Rockstar energy drink.[121] Russell's mother, Janet, served as CFO of his company until July 2009.[10] In 1974, Savage and his family moved to Fairfax, California, after Savage completed his master's degree at the University of Hawaii.[20] Savage has homes in Larkspur and Tiburon in Marin County, California, an apartment in San Francisco, as well as residences in Beverly Hills, California, and West Palm Beach, Florida.[20][122][123]\n\nDuring the 1980s, Savage attended Friday night services at a Jewish Synagogue Chabad house in Berkeley.[8] In a 2003 interview on The O'Reilly Factor, Savage has said that although he believes in God, he attends houses of worship only once or twice a year.[124] In his 2012 book Trickle Down Tyranny, Savage wrote: \"... I'm not religious. Do I believe in God? Sometimes I do, sometimes I don't.\"[125] In his podcast aired 25 November 2020, Savage stated: \"Trust in God. God leads my footsteps. God has determined that I will be on podcast come January. God determines a lot of things in our lives and you have to trust in God and just say its fate at a certain point. Now, I've always believed that we make our own fate. I've not been one of these leaves-in-a-stream type of personalities...\"[126]\n\nIn December 2019, Savage notably suffered a heart attack, but subsequently recovered and returned on air.[127]\n\nSavage has had many pet dogs throughout his life. His beloved toy poodle Teddy died in late 2021.[128]\n\nBooks [ edit ]\n\nIn total, Savage has written 44 books, twenty under his real name of Michael Weiner, and twenty-four under the pseudonym of Michael Savage. As Michael Savage, his works include two #1 New York Times Best Sellers and three additional books which made The New York Times Best Seller list.[129][130][131] have also been reprinted under his alias of Michael Savage.\n\nHis earlier books as Michael A. Weiner, Ph.D., draw on his doctoral expertise in the field of nutritional ethnomedicine. In them, he advocates nutritional, herbal, and homeopathic options to approach the prevention and treatment of diseases such as poor diet, aging, arthritis, Alzheimer's disease, cancer, allergies, cocaine addiction, the common cold, and HIV/AIDS.[132] He has also written about tree planting, beer-tasting, and nutritional cooking.[132]\n\nHis more recent books as Michael Savage are political in nature and published by a variety of different companies. His recent works also include holiday family stories and thrillers.\n\nIn 1991, Savage self-published The Death of the White Male, an argument against affirmative action, through Quantum Books.[133] In the book, Savage, calls affirmative action \"reverse discrimination\", and demonstrates his emerging philosophy. This eventually led to his starting the Paul Revere Society and he continues to sell the book to raise money for this group.[134]\n\nIn January 2003, Savage published The Savage Nation: Saving America from the Liberal Assault on Our Borders, Language and Culture, his first major book under the pseudonym Michael Savage. The book directs attacks at \"liberal media bias\", the \"dominating culture of 'she-ocracy'\", gay activists, and liberals.\n\nIn January 2004, Savage published his second political book The Enemy Within: Saving America from the Liberal Assault on Our Schools, Faith, and Military. His next book, Liberalism Is a Mental Disorder, was released on April 12, 2005. Unlike The Savage Nation, both of these books cited sources for some of the more controversial claims made.[citation needed]\n\nIn April 2006, Savage released The Political Zoo. The book contains satirical profiles and cartoons of different public figures, most of whom are liberal political figures and celebrities, depicted in caricature as animals in the \"Political Zoo\", with Savage portrayed as the zoo keeper.\n\nIn October 2010, Savage released Trickle Up Poverty: Stopping Obama's Attack on Our Borders, Economy, and Security. Released through the HarperCollins imprint of William Morrow and Company, Savage argues in the book that \"Americans are boiling mad over the way Congress and this Marxist/Leninist-oriented President are manipulating the current economic crisis to nationalize businesses.\"[135]\n\nIn November 2010, it was confirmed that Savage had signed a deal to write two thrillers for publisher St. Martin's Press. The first political thriller, Abuse of Power, was released on September 13, 2011. The novel is based on \"My fictionalized account of being banned from Britain and hunted by overbearing governments is set in the San Francisco only I know\", said Savage. It is set in San Francisco, mainly in North Beach, as well as London, and Tel Aviv. It tells the story of a failed carjacking that reveals a government cover-up. A dark plot involving British officials and a terrorist group known as \"the Hand of Allah\". The publisher has described the novel by saying, \"will make 9/11 look like child's play\".[136]\n\nIn 2014, Savage released Stop the Coming Civil War: My Savage Truth, in which Savage writes in part, \"We are under assault from both inside and out as our government moves to consolidate its domestic power, while at the same time weakening our defenses against the growing power of our enemies.\"[137]\n\nIn 2015, Savage released another a book titled Government Zero: No Borders, No Language, No Culture. In it he writes that the country has been left without the founding principles of his radio show, \"borders, language and culture,\" and describes what he calls the destruction that the Presidency of Barack Obama brought to the country. He offers several solutions to rebuild the nation.[138]\n\nIn 2016, Savage's book Scorched Earth: Restoring The Country After Obama. This work was a blueprint for how then candidate Donald Trump could help get the country back on the right track should he win the election.[139]\n\nIn March 2017, Savage released what he said would be his last political book, Trump's War: His Battle For America. The book debuted at number one on The New York Times Best Seller List.[140]\n\nIn November 2017, Savage released a non-political book on his search for spiritual truth, God, Faith, and Reason.[141]\n\nIn October 2018, Savage published a book on American psychology, Stop Mass Hysteria: America's Insanity from the Salem Witch Trials to the Trump Witch Hunt. [142] In it he discusses what he calls the many \"loud flashpoints\" that he believes have engulfed American thought over the nation's history, and relates those phenomena to what he describes as a current obsession with Trump hatred.\n\nIn June 2019, Savage published a new book of stories and anecdotes entitled A Savage Life.\n\nBibliography [ edit ]\n\nLiterature as Michael A. Weiner [ edit ]\n\nLiterature as Michael Savage [ edit ]"}, {"url": "https://www.netinfluencer.com/michael-savage/", "page_content": "What is Michael Savage all about? His podcast, The Michael Savage Show, is a top-ranked news commentary podcast with new episodes weekly. Keep reading to learn everything about the podcast and Michael Savage’s background in the podcasting and news world.\n\nMichael Savage is a media personality with an extensive background in medicine, right-wing politics, health, and much more. His show, The Michael Savage Show, is among the most popular shows nationwide on Apple Podcasts and Chartable.\n\nInterested in listening to The Michael Savage Show? Keep reading for everything you need to know about the world of podcasting with Michael Savage, his background, common topics and guests on the show, and much more.\n\nWho is Michael Savage?\n\nMichael Alan Weiner, otherwise known as Michael Savage, was born on March 31, 1942. He is a right-wing author, political commentator, activist, conspiracy theorist, and former radio host best known for hosting The Savage Nation, a widely acclaimed talk show that aired on Talk Radio Network until 2021.\n\nIn 2008, The Savage Nation was the second most listened-to radio talk show, with over 20 million listeners on over 400 stations nationwide. In 2021, this radio talk show was taken off the air, and Michael now runs The Savage Nation podcast.\n\nMichael has extensive education, with master’s degrees from the University of Hawaii in medical anthropology and botany. He also holds a Ph.D. from Berkeley in nutritional ethnomedicine. His books have tackled similar nutrition, homeopathy, and herbal medicine topics. He has also written several right-wing political books under the name Michael Savage, which were listed on The New York Times Best Seller list.\n\nIn addition to his political beliefs, Michael is well-known for being a huge animal activist and frequently supports legislation protecting wildlife.\n\nWhat is The Michael Savage Show?\n\nSavage launched The Savage Nation Podcast in 2019 and posts episodes multiple times a week. His show was rebranded as The Michael Savage Show and is described as ‘not your father’s conservative show!’\n\nListeners can opt for a premium version of the show to listen without ads or listen on any major podcast app with ads.\n\nThemes and Topics Covered\n\nMichael discusses politics, mysticism, nutrition, cooking, news, cars, animal rights, films, sciences, and more on his show. He gives updates on the news and reviews many different aspects of American culture and life.\n\nThe most popular topics and themes covered on The Michael Savage Show are right-wing politics, typically with topics about democrats, the radical left, the government, or why America is still worth fighting for.\n\nNews clip\n\nThe Format of the Podcast\n\nThe Michael Savage Show typically features one primary topic per podcast episode. However, he will include an hourly breakdown of the podcast episode by topic for episodes where he discusses multiple topics so listeners can jump ahead to the sections they are most interested in listening to.\n\nMichael’s titles are often sensational, with many even appearing in all capital letters for dramatic effect. These titles are eye-catching, and likely help attract more listeners to the show.\n\nFamous Guests\n\nMichael regularly features experts on his podcast. For example, for a podcast episode on the war in Russia and Ukraine, he featured guest speaker Daniel L. Davis, a retired Lt. Col. from the US Army.\n\nMilitary members and members of the medical community, such as widely acclaimed doctors, are frequent choices of guest speakers for his show. Savage frequently breaks down medical news, such as the pandemic using his extensive medical background and often features other medical experts to discuss the many claims and launches in these topics.\n\nHis most famous guest was Donald Trump, who was a regular guest on Savage’s talk show. However, he hasn’t appeared on the podcast specifically, though Savage regularly talks about Trump’s actions and policies and has endorsed him for the presidency in the past.\n\nPodcast clip\n\nReception and Impact\n\nThe Michael Savage Show is widely acclaimed, with strong star ratings on many platforms.\n\nOn Apple Podcasts, it has a 4.5-star rating with over 10,6000 raters, and over 9,000 ratings on the Podcast App with an average 4.4-star rating.\n\nOn Chartable, The Michael Savage Show received a 262nd rating for Podcasts: Global: All and #188 for all podcasts in the United States.\n\nThis podcast’s rating of #128 on Apple Podcasts for the United States of America: News and #29 ranking on Apple Podcasts for the United States of America: News Commentary is even more impressive. Interestingly, this podcast also has high rankings of less than 200 in Great Britain, Australia, and Canada for news commentary despite focusing heavily on American politics.\n\nOverview of the podcast’s audience and reach\n\nWith nearly 1,400 episodes, The Michael Savage Show is a clear favorite among conservative news commentary listeners. Most of his fan base listens on podcast streaming services.\n\nHowever, Michael does have nearly 30,000 subscribers on his YouTube channel, which shares clips from his podcast.\n\nHis the_real_savage_nation Instagram account has nearly 38,000 followers. While these are strong numbers, his social media presence really shines on Facebook and Twitter.\n\nHis Twitter account has 216,000 followers, and he frequently posts about his podcast and gives fast updates on the ever-changing news. On Facebook, he shares similar content and embeds all his podcasts, gaining him an impressive following of nearly 220,000 followers.\n\nAll in all, Michael has a massive listening base on podcast apps alone. However, his social media presence should not be overlooked, as his massive Twitter and Facebook following, along with his growing Instagram and YouTube audience, are significant accounts in their own right.\n\nSomething else to note is the variety of listeners that Michael Savage has earned over the years. Despite being based in American politics, this podcast show has garnered large audiences of listeners in Canada, England, and Australia, demonstrating its massive popularity and reach.\n\nConclusion\n\nThe Michael Savage Show is a ‘no-fluff’ news commentary podcast featuring hard-hitting topics and questions. As such, it’s no surprise that it’s built up a massive and loyal audience over the years. Some of the biggest praise surrounding the show is Michael Savage’s consistent beliefs over the years, which listeners claim are unwavering and unchanging.\n\nWhether or not the host is politically aligned with your beliefs, news commentary podcasts are a great way to explore different sides of news stories and ideologies.\n\nInterested in listening to The Michael Savage Show? It can be found on all major streaming platforms. Listen to The Michael Savage Show on Audible, the Podcast App, Apple Podcasts, and Google Podcasts."}, {"url": "https://articlebio.com/michael-savage", "page_content": "Michael Savage is a well-known figure in the radio fraternity. A radio-host, celebrated the author, political commentator, nutritionist and activist, Savage is best known for his former show The Savage Nation which aired on Talk Radio Network.\n\nMichael Savage has been syndicated by Cumulus Media Networks since 2012. He holds master's degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine. As Michael Weiner, he has written books on nutrition, herbal medicine, and homeopathy; as Michael Savage, he has written four political books that have reached The New York Times Best Seller list.\n\nEarly Life And Education Of Michael Savage\n\nSavage was born as Michael Alan Weiner on 31st March 1942 on the Bronx, New York. He was one of the three children of father Benjamin and mother Rae and considers his childhood to have been a difficult one.\n\nMichael’s education consisted of graduating from Jamaica High School after which he attended Queens College and graduated with a Bachelor’s Degree in Biology. He went on the graduate with a Bachelor’s degree in Botany from the University of Hawaii in Manoa in 1970 and Master of Arts in Anthropology from the same college.\n\nFrom the University of California, Berkeley, he obtained his Ph.D. in 1978 in nutritional ethnomedicine. This versatile personality thus has a respectable education qualification.\n\nMichael changed his last name to Savage after being highly inspired by Charles Savage, a 19th-century sailor who presumably was the first man to bring firearms to Fiji.\n\nMichael Savage's Career\n\nMichael was the host of the show The Savage Nation which aired on the Talk Radio Network and was the second most-listened-to radio talk show in the US in 2009.\n\nHe hosted the show from 2009 to 2012. Prior to obtaining his first show, Savage was a stone gatehouse keeper of the Hitchc* * k Cattle Company. Since 2009, Cumulus Media Networks has syndicated him.\n\nAlong with a radio host, Savage is an author who has written several books. His books, under his real name Michael Weiner, range from homeopathy to herbal medicine and nutrition. Four of the political books that he has written under his pseudonym Michael Savage have been New York Times Bestsellers.\n\nHis ideologies are considered by himself to be of conservative nationalism while critics think that he fosters hatred. Savage is a supporter of the English only movement and highly criticizes illegal immigration to the United States and the philosophies of progressivism and liberalism. For his provoking thoughts, he has been barred from entering the United Kingdom since 2009.\n\nMichael Savage's Net Worth And Salary\n\nMichael is a well-known and highly respected person with a net worth of $50 million at present. He has homes in Tiburon, Larkspur, California and Marin County and an apartment in San Francisco.\n\nFrom a troubled childhood to having a huge net worth and fan following, Michael has surely worked hard to reach this point and shall always be respected for doing so.\n\nMichael Savage's Personal Life\n\nSavage married Carol Ely on 1964. The relationship however ended in divorce. He met his current wife Janet and married her in 1967. They have two children; son Russell Weiner and daughter Rebeccas Lin Yops.\n\nTheir son founded the company that produces the energy drink Rockstar and Janet served as the CFO of the company until 2009. He and his family currently live in Fairfax, California.\n\nAge, Body Measurements and Other Facts"}, {"url": "https://www.splcenter.org/hatewatch/2018/02/01/michael-savage-promotes-white-nationalist-conspiracy-his-radio-show-wins-praise-racist", "page_content": "If so, he claimed, it would be nationally syndicated conservative radio host Michael Savage.\n\nSavage, a pundit known for his extreme rhetoric, won this praise by devoting significant airtime in the past week to what he called, “cultural genocide being promulgated against Caucasians” — the racist conspiracy theory otherwise known as “white genocide.” On Monday, Savage spent his entire show on the topic, as he railed against a comment from U.S. House of Representatives Minority Leader Nancy Pelosi criticizing President Donald Trump’s immigration plan, which she said was an attempt to “Make America White Again.”\n\n“Do you have any idea how sick and vile this racist statement is?” Savage asked his viewers. He went on, “She’s basically unhitched herself from her own people, her own culture, her own heritage in order to appease the masses who keep her in power.”\n\nThe conspiracy of white genocide contends that there is a deliberate scheme underway to exterminate white people, or white culture, by overwhelming Western populations with non-whites. White supremacists typically accuse Jewish people of engineering this plot. Savage, who is Jewish, blamed Democrats.\n\n“Unless we stand up to the racists and the genocidal maniacs who are attacking, attacking, attacking,” Savage said, “there will be nothing left to protect, there will be nothing left to save. Everything of our culture will be gone.”\n\nThe irony of a self-described “student of the Holocaust” deploying a traditionally antisemitic talking point may have been lost on Savage, but it wasn’t lost on Vandal, a racist ex-Marine who, along with his twin brother Vanzetti Vandal, runs a blog advocating that whites return to the “barbarity” of their past and “rape, pillage and plunder” like their ancestors.\n\n“Right now, the most outspoken and ardent opponents of White Genocide…generally reserve their most scathing ire for the people-race-nation-church seemingly most responsible for perpetuating White Genocide: Jews,” Vandal wrote on his blog, VandalVoid. “But here we have Michael Savage, a Jew, leading the charge against these anti-Whites—the sole national figure, with the exception of maybe Alex Jones (albeit Savage goes even further than Jones), to do so.”\n\nVandal is perhaps best known for originating the misogynist meme “white sharia,” proponents of which argue that white women should be subjected to the same kind of brutality perpetrated by the Taliban.\n\n“The Muslim world is the only civilization left on Earth today where an extreme and rigidly codified patriarchy still exists,” Vandal wrote. “Sharia law, though practiced today by some of the world’s most despicable races, is the only living example of anything that even remotely approximates the patriarchal society that Western man once had himself.”\n\nThis is not the first time Savage has discussed white genocide on his show. He talked about it multiple times when President Barack Obama was in office. In those days, he said Obama was behind it. Once, he even attributed his claim to a Mayan prophecy.\n\nSavage is no stranger to bigoted rhetoric. In 2003, he lost his job at MSNBC after only a few months when he told a prank caller, “Oh, so you're one of those sodomites. You should only get AIDS and die, you pig; how's that?” In 2014, he targeted U.S. veterans with PTSD, saying they were giving into “weakness” and being allowed “to cry like a little baby in bed.”\n\nHe reaches as many as 10 million listeners through his radio show, nationally syndicated by Cumulus Media, Inc."}, {"url": "https://deadorkicking.com/michael-savage-dead-or-alive-2/", "page_content": "How Old Is Michael Savage? Michael Savage Birthday\n\nMichael Savage was born on March 31, 1942 and is 81 years old now.\n\nBirthday: March 31, 1942\n\nHow Old - Age: 81\n\nMichael Savage Death Fact Check\n\nMichael is alive and kicking and is currently 81 years old.\n\nPlease ignore rumors and hoaxes.\n\nIf you have any unfortunate news that this page should be update with, please let us know using this form .\n\nMichael Savage - Biography\n\nMichael Alan Weiner (born March 31, 1942), better known by his professional name Michael Savage, is an American radio host, author, activist, nutritionist, and political commentator. He is the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2012, and in 2009 was the second most listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States. Since October 23, 2012, Michael Savage has been syndicated by Cumulus Media Networks. He holds master's degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine. As Michael Weiner, he has written books on nutrition, herbal medicine, and homeopathy; as Michael Savage, he has written four political books that have reached The New York Times Best Seller List."}, {"url": "https://www.nytimes.com/2020/04/16/us/politics/michael-savage-trump-coronavirus.html", "page_content": "Much of the time, Mr. Savage still sounds like any other right-wing shock jock — making fun of Nancy Pelosi and doubting the validity of the #MeToo movement. But on the subject of the coronavirus, Mr. Savage has become one of the loudest voices of dissent on the right.\n\nHis views are a striking departure from the accepted version of events among Mr. Trump’s loyalists in the media, who have made a concerted effort to deny that they downplayed the epidemic. Mr. Savage has attacked the credibility of the conservative media, accused its biggest stars of being too rote and unthinking in their defense of the president, and demanded that they be held accountable for misleading millions of Americans.\n\n“We’re living in a terrible time in America where truth has died,” Mr. Savage, who was one of the first conservative media stars to urge Mr. Trump to run for president, told his audience. “This is crazy,” he added, pointing to the way the president’s defenders always accuse the left of spreading “fake news.”\n\n“How can we not let our side be called on the carpet when they lie to the people?”\n\nThat was Feb. 24.\n\nAt the time, coronavirus outbreaks were largely limited to a handful of countries like China, South Korea and Italy. Only a few dozen cases had been reported in the United States. The same day, Rush Limbaugh likened the coronavirus to the common cold on his radio program. But it spread aggressively in America just as Mr. Savage had warned it would — a prediction that earned him the ire of people who called him a hysteric and a sellout.\n\nHis contempt for hosts like Mr. Limbaugh and Sean Hannity, whose top-rated radio shows draw more than 30 million listeners each week, is especially searing. He mocks them as “Dr. Hannity” and “Rush Limbaugh, M.D., Ph.D.,” belittles their lack of education compared with his, and berates people who took their claims seriously."}, {"url": "https://bijog.com/biography/michael-savage", "page_content": "Michael Savage had spent the whole life in the field of the Journalism and there is no doubt that he is among the best. His real name is Michael Alan Wiener and he is well known as Michael Savage who is a conservative political commentator, a nutritionist, an activist, author and radio host. He is the host of national syndicated talk show called The Savage Nation and it aired on the Talk Radio Network around the United States up to the year 2012. In the year 2009, it became the most listened to radio talk show around the country with the audience that it is more than 20 million listeners on over 400 stations around the US.\n\nIn addition of being the journalist, he is a commentator and a radio host. He is a great author and also activist. He tried the hands on many things and he is expected to be recorded in the books as a great man. He was born in the year 1942 and this means that he is over 73 years old at this moment. By his age, he has been able to achieve many things that he had dreamed about.\n\nMichael Savage was born in the city of Bronx in the area of New York in USA. Because of his birth place, he is American by nationality. His ethnicity is of white and he got the degree in the University of New York. He appeared in different TV shows for the entire life and the one that became the most known is the Larry King Live and he hosted it together with Glenn Beck.\n\nAfter the death of actor Robin Williams, Michael Savage made a video to his tribute and it was uploaded on the Youtube. He had different videos at the Youtube and they were all great and everyone liked it. He has amazing podcast and they may be bought on the iTunes and they are worth to be paid for.\n\nMichael Savage dated Carol Ely for a long period and they decided that they should get married and to live happy as a wife and a husband. However, after sometime there were problems in her relationship and they decided to get a divorce. The two divorced in 1967 and this means that the marriage only lasted for 3 years because they were married in 1964.\n\nAfter his divorce, Michael Savage had affair together with Janet Weiner and they were married in 1967. With his second wife, they have two children who are named Rebecca Lin Yops and Russell Weiner. When it comes to his finances, Michael Savage is financial sound and his net worth increases on daily basis. He has a net worth counted to be over 18 million dollars. He is not too tall because his height is 5 feet with 4 inches. Some of the books he has written are the Savage Nation, The Death of the White Male, Plant a Tree and Earth Medicine."}, {"url": "https://www.splcenter.org/fighting-hate/intelligence-report/2004/michael-savage-brings-bigotry-and-anti-semitism-airwaves", "page_content": "MSNBC learned the hard way.\n\nResisting a lengthy campaign by human rights groups that asked that it not hire radio talk show host Michael Savage, well known for his bigoted on-air vitriol, then-MSNBC President Erik Sorenson gave Savage a major television talk show last March, saying Savage hadn't said anything hateful on MSNBC's air — at least not yet.\n\nThen, in July, Savage described a caller to his new show as a \"sodomite\" and a \"pig,\" and told him to \"get AIDS and die\" and to \"go eat a sausage and choke on it.\" The cable news network fired him within hours.\n\nMSNBC had reached its limit. But to others, Savage's astounding bigotry was simply money in the bank. Savage had lost his shot at big-time television, but all was not over for the man whose bestselling 2003 book, The Savage Nation, was still bringing in sizable royalty checks.\n\nOriginating station KNEW-AM 910 in San Francisco, station owner Clear Channel Communications, and the Talk Radio Network syndication group chose to keep Savage's immensely popular radio show, also called \"The Savage Nation,\" on the air. After all, KNEW had just lured Savage away from local rival KSFO-AM a month before his firing.\n\nAnd Savage was, as knew understood, a cash cow. His drive-time program, aired for four hours a day, five days a week from a station in what is arguably America's most liberal metropolitan area, is ranked No. 4 among the nation's radio talk shows.\n\nAs many as 7 million people around the country — most of them white men aged 35 to 55, according to the industry-watching Talkers Magazine — listen to \"The Savage Nation\" through some 330 affiliated stations. To them, Savage is a celebrity.\n\nThat Savage is also a bigot is well known. He has called inner-city victims of gunfire \"ghetto slime.\" He refers to non-white nations as \"Turd World\" countries. Latinos, he says, \"breed like rabbits.\" He regularly bashes gays and liberals.\n\nBut there is one type of group hatred that Savage, who claims to have coined the phrase \"compassionate conservative\" in 1994, long held in relative check.\n\nAlthough he called Jewish talk show host Jerry Springer \"hook-nosed,\" attacked a fictional ACLU lawyer named \"Mark Nobodyberg,\" and referred to Sen. Joseph Lieberman as \"throwing his bagel into the ring\" of the presidential campaign, Savage avoided sustained, on-air expressions of anti-Semitism.\n\nNot any more.\n\n'Jews From New York'\n\nLast November, Savage went after the Southern Poverty Law Center's president, Richard Cohen. Savage's ire came in response to the Center's lawsuit against former Alabama Chief Justice Roy Moore for installing a Ten Commandments monument in the state's judicial building. After vowing to defy a federal appeals court, Moore was removed from office by fellow Supreme Court justices despite protests from some Christian Right activists and others.\n\nOn Nov. 13, during one of many furious tirades that month about the Southern Poverty Law Center, Savage responded to a caller who seemed to agree with him about the case, but who questioned what appeared to be Savage's Jew-baiting.\n\n\"What do you mean I am trying to stir it up?\" Savage demanded. \"A guy like Cohen, who is obviously a Jew from New York, is going after a decent Christian man. What am I supposed to do? Sit here and take crap from him? I think he is a vile human being who ought to be arrested for a hate crime.\n\n\"And I am not going to mince words. And I guarantee you that he says 'goy' behind the scenes.\" (\"Goy\" is a Hebrew word for a non-Jew that, depending on its usage, can be derogatory. Savage also uses the plural \"goyim.\")\n\nAt one point in the exchange, Savage seemed ready to advocate violence against Jews. But he stopped short of spelling it out.\n\n\"I'll tell you the truth, it's enough to break your heart to see what this country has become,\" he said. \"And I have a lot of things that I really want to say today, that I'm going to have to control myself and not say, because there are things that need to be done that I can't say. But the country's at a terrible, terrible balancing point.\"\n\nSavage's self-control didn't last long. Later in the same broadcast he mocked Jews in a fake Brooklyn accent and laid out a justification for anti-Semitism.\n\n\"That's next isn't it?\" Savage asked. \"From these verminous Brooklyn College lawyers, isn't it? Go down South and have a tee-hee over the goyim. Laugh at the goyim. Go down there and take away the crosses and they can't touch you, huh Mr. Cohen? [Mock laughter.]\n\n\"Mr. Cohen, and you wonder where anti-Semitism comes from. Let me strip the mask off it for you today, because if you think I'm going to mince words you are mistaken. It comes from situations like this, when you have a New York Jew like Cohen going down South into the heartland of Christianity and stealing the religious symbol from Christians.\"\n\nThe Wiener Nation\n\nThere's just one thing. Savage is himself \"a New York Jew,\" a man who was born — and legally remains — Michael Alan Wiener. According to the liberal media watchdog Fairness and Accuracy in Reporting (FAIR), Savage is the son of Jewish parents in the Bronx. He adopted his pseudonym in 1994, with his first major radio show.\n\nDespite that, Savage frequently talks about Christianity as \"our\" religion and bitterly criticizes those he characterizes as \"Christophobes.\" Now, with his attacks on Cohen, FAIR's Steve Rendall says Savage has crossed a new line.\n\n\"Savage's anti-Semitism is nothing new,\" said Rendall, a long-time analyst of Savage's show. \"But this takes him a step beyond, into the company of neo-Nazi conspiracists like [hate group leader] Matt Hale and [former Klansman] Don Black.\n\n\"What's most remarkable, though, is how Savage has put the blatant racism and anti-Semitism of the shortwave dial onto commercially sponsored am stations.\"\n\nThat doesn't seem to bother his backers.\n\n\"It's hard for us to comment on anything other than Michael is just wildly popular,\" KNEW-AM spokesman Ken Kohl told the Report. \"You don't achieve this kind of success in markets like New York and San Francisco unless you are wildly entertaining to huge numbers of people.\"\n\nFor their part, officials at Clear Channel Communications, after reviewing Savage's remarks about Cohen, limited themselves to a simple statement. \"Clear Channel's radio stations,\" it said, \"are operated and programmed locally based on extensive audience research.\"\n\nTalk Radio Network (TRN), a radio syndicator based in Central Point, Ore., and featuring an array of hard-right hosts, did not respond to requests for comment. But it has defended Savage from the start. Last May, it went to federal court to sue the operators of three small Web sites critical of their leading host in a bid to shut them down.\n\nAfter the public interest group Public Citizen stepped in to help defend the case, however, TRN seemed to crumble. On the December day that they were to respond to a defense motion to dismiss the case, TRN's attorneys instead asked the judge for permission to drop their own case. It was granted.\n\nNone of this has turned off Savage's publisher at WND Books, a new publishing house that is a partnership between the far-right World Net Daily Web site and Thomas Nelson Inc., a Nashville-based publisher of Christian books. WND Books also published Savage's latest book, The Enemy Within, which debuted this January at No. 8 on The New York Times' bestseller list.\n\n\"I can only say that I am a bit mystified by your assertion that Dr. Savage is anti-Semitic,\" David Dunham, who identified himself as WND Books publisher and a senior vice president at Thomas Nelson, Inc., said after reading transcripts of Savage's rhetoric.\n\n\"I would suppose that you are extrapolating this from his repeated comments that, 'Mr. Cohen is a Jew from New York.' That's no more anti-Semitic than if he said, 'David Dunham (me) is a Christian from Nashville.'\"\n\nExcept for one thing. Cohen was born and raised in Virginia."}], "Michael Savage is a conservative political commentator.": [{"url": "https://en.metapedia.org/wiki/Michael_Savage", "page_content": "Michael Alan Weiner (born 31 March 1942), better known by his professional name Michael Savage, is a Jewish American radio host, writer, nutritionist, and conservative political commentator. In 2009, his was the second most listened-to radio talk show in the United States with an audience of over 20 million listeners on 400 stations across the country. He has sometimes been described as a \"shock jock\".\n\nSavage has stated some politically incorrect views, such as criticisms of mass immigration, affirmative action, and Islamization, but apparently not more controversial views such as race and intelligence views.\n\nHe has stated that there is a \"“cultural genocide being promulgated against Caucasians”. Politically correct sources have alleged that this is support for a \"White genocide conspiracy theory\".\n\nIn 2003, Savage was fired from his MSNBC television show after anti-homosexual remarks made in response to a caller, identified as prank caller, who insulted Savage's teeth. Savage stated that he thought he was off the air and had intended to insult only the prank caller.\n\nIn 2009, Savage was banned from entering the United Kingdom as he was \"considered to be engaging in unacceptable behaviour by seeking to provoke others to serious criminal acts and fostering hatred which might lead to inter-community violence\". Savage said that he has never advocated violence.\n\nSee also\n\nPart of this article consists of modified text from Wikipedia, and the article is therefore licensed under GFDL."}, {"url": "https://wiki.alquds.edu/?query=Michael_Savage", "page_content": "U.S. radio talk show host and author\n\nFor other people named Michael Savage, see Michael Savage (disambiguation)\n\nMichael Alan Weiner (born March 31, 1942), known by his professional name Michael Savage, is an American right-wing author, political commentator, activist, and former radio host.[1][2] Savage is best known as the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2021, and in 2009 was the second most listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States.[3][4] From October 23, 2012, to January 1, 2021, Michael Savage had been syndicated by Cumulus Media and Westwood One. He holds master's degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine. As Michael Weiner, he has written books on nutrition, herbal medicine, and homeopathy; as Michael Savage, he has written several political books that have reached The New York Times Best Seller list.\n\nSavage has summarized his political philosophy in three words: borders, language, and culture. He has characterized his views as conservative nationalism, while critics have characterized them as \"fostering extremism.\"[5] He supports the English-only movement and argues that liberalism and progressivism are degrading American culture. Although his radio delivery is mainly characterized as politically themed, he also often covers topics such as medicine, nutrition, music, literature, history, theology, philosophy, sports, business, economics, and culture, and tells personal anecdotes.\n\nIn 2009, Savage was placed on a list of people permanently banned from entering the United Kingdom by British Home Secretary for \"seeking to provoke others to serious criminal acts and fostering hatred.\"[5][6][7]\n\nEarly life and education [ edit ]\n\nSavage was born Michael Alan Weiner[8] in the Bronx, New York, one of three children of Benjamin Weiner, a Jewish immigrant from Russia.[9][10][8][11] His mother, Rae, was from Montreal, Canada.[12]\n\nHe described his childhood as difficult, with a \"gruff, profane\" father who would frequently criticize and belittle him.[10] His younger brother, Jerome, was born with developmental disabilities and was unable to hear or speak. Jerome died in 1969. His father, the owner of an antiques shop, died of a heart attack at age 57 in 1970, and his mother died in 2003.[9][8]\n\nAfter graduating from Jamaica High School in 1958,[13][14] Savage attended Queens College, where he earned a bachelor's degree in biology in 1963.[8] After college, Savage taught high school for several years in New York City. His first marriage in 1964 to Carol Ely ended in divorce, and he remarried in 1967 after meeting his current wife, Janet. During this time, Savage also worked for famous psychedelic drug advocate Timothy Leary as keeper of the stone gatehouse on the Hitchcock Cattle Company estate in Millbrook, New York, to which Leary had been given access. Leary hired him to the post because Savage did not use LSD.[10] Savage then studied at the University of Hawaii at Manoa, earning a Master of Science in botany in 1970 and a Master of Arts in anthropology in 1972.[15][16] He obtained a PhD in 1978 from the University of California, Berkeley, in nutritional ethnomedicine.[17][18] His thesis was titled Nutritional Ethnomedicine in Fiji.[19]\n\nShift in political opinions [ edit ]\n\nSavage introduced himself to certain writers in the North Beach neighborhood of San Francisco in the 1970s.[20] He befriended and traveled with Beat poets Allen Ginsberg and Lawrence Ferlinghetti. Savage maintained a correspondence with Ginsberg consisting of ten letters and three postcards across four years, which is maintained with Ginsberg's papers at Stanford University.[10][21] One letter asked for Ginsberg and Ferlinghetti to come do a poetry reading, so others could \"hear and see and know why I adore your public image.\"[11] Another acquaintance was poet and author Neeli Cherkovski, who says that Savage dreamed of becoming a stand-up comic in the mold of Lenny Bruce.[10]\n\nAcquaintance Robert Cathcart says that by 1980, in his private conversations with Savage, he knew him to have conservative political views.[20] Schwartz[who?] stated Savage became alienated from the North Beach scene in the early 1980s. Savage had intense arguments with his liberal friends.[20] When asked about his shift in politics and other views, Savage replied, \"I was once a child; I am now a man.\"[11] Savage has cited many occurrences in his life that helped shape his conservative views. Savage states that his opinions on welfare were partly shaped by his first job out of college as a social worker.[22] He described one incident in which his supervisor had him deliver a check to a welfare client to furnish their apartment, while his own apartment was furnished with cardboard boxes.[23] Another turning point occurred for him as a writer of health and nutrition books in the 1980s, when he experienced what he saw as \"political opposition\" after making the suggestion that the closure of homosexual bathhouses might be necessary in response to the emerging HIV/AIDS epidemic.[24] In 1994 his final health and nutrition manuscript, Immigrants and Epidemics, was rejected by publishers for being inflammatory.[25] In 1996, Savage applied to become the Dean of the Graduate School of Journalism at the University of California, Berkeley. The university instead selected award-winning journalist and China scholar Orville Schell. Savage sued the university, contending discrimination for being conservative.[20] Savage later dropped the lawsuit.[26]\n\nRadio [ edit ]\n\nThe rejection by publishers of his 1994 manuscript about illegal immigration and epidemics prompted Savage to record a demo tape with a mock radio talk show about the contents of the work. He mailed this tape to 250 radio stations in an attempt to change careers and become a radio talk show host.[20] On March 21, 1994, Savage began his radio career on KGO (a San Francisco news/talk radio station) as a fill-in host for liberal Ray Taliaferro's overnight show and later as a weekend host. At the time, his slogan was \"To the right of Rush and to the left of God.\" The show quickly became a local hit.\n\nLater in 1994, KGO parent company Capital Cities/ABC Inc. purchased the station KSFO and changed it to a conservative talk format.[27] On January 2, 1995, the first day of KSFO's new format, Savage debuted as host of afternoon drive time show The Savage Nation.[27][28] By 2000, Savage was the most popular afternoon drive host among all adults in San Francisco Arbitron ratings.[29]\n\nIn 1999, Talk Radio Network began syndicating part of The Savage Nation nationally.[30] Starting September 21, 2000, The Savage Nation became an entirely national show distributed by TRN.[31]\n\nIn mid-2006, Savage had 8–10 million listeners per week,[32] which made his show the third most widely heard broadcast in the United States at that time. Savage has described his listeners as \"literate callers with intelligence, wit, and energy.\" He has described his show's production as one with a \"... hard edge combined with humor and education ... Those who listen to me say they hear a bit of Plato, Henry Miller, Jack Kerouac, Moses, Jesus, and Frankenstein.\"[33] Mark de la Viña of the San Jose Mercury News wrote of Savage: \"In contrast to Rush Limbaugh, Sean Hannity and Laura Schlessinger, Bay Area-based Savage mixes conservative diatribe and blunt observations with acerbic humor and the gift of gab.\"[11]\n\nBy 2009, The Savage Nation had an audience of 8 to 10 million listeners on 400 stations across the United States, making it the second most listened-to radio talk show in the country at the time.[3][4] Around that time, Savage asked his audience for their opinion prior to consenting to a profile interview by Kelefa Sanneh of The New Yorker; Savage eventually accepted that offer and the New Yorker profile, titled \"Party of One\", was published in the August 3, 2009, issue, which covered Savage's life and personality in great detail.[8][34]\n\nOn September 10, 2009, KNEW (910 kHz) in Savage's home market of San Francisco announced that it was dropping his program and replacing him with John and Ken from sister station KFI (640 kHz)—Los Angeles.[35] John Scott, program director of KNEW said in an email that the station was headed \"... in a different philosophical and ideological direction, featuring more contemporary content and more local information.\"[36] According to Arbitron monthly ratings, KNEW dropped in the ratings since Savage was let go. San Francisco station KTRB picked up the program for the San Francisco market, and saw a ratings boost in the afternoon drive. However, the program was among the first casualties when KTRB went into receivership in September 2010.[37]\n\nOn January 22, 2010, Savage revealed to his audience that a writer for Playboy had contacted him via email to do a lengthy interview, and again asked his listeners if he should accept the offer. During the show, Savage read from personal emails between the Playboy writer and himself. The writer admitted to being a listener of the Savage Nation but a critic of the profile done by The New Yorker. The writer also stated that the purpose of the interview was to \"rattle\" Playboy's readers. On May 12, 2010, Savage revealed that he had granted the interview at his home. Playboy published the interview in June 2010.[23] He read from a pre-publication copy of the 8,000-word Playboy interview, in which the writer expressed animosity for Savage and his views. Savage said that he was disappointed at the lack of journalistic objectivity, but did not harbor hatred for the writer. He referred back to the New Yorker interview by Kelefa Sanneh, and praised Sanneh as a \"real writer\" who had understood his subject.\n\nOn September 27, 2012, Savage's talk show left the airwaves after he won a legal battle with Talk Radio Network, his longtime employer, and his attorney said discussions with new networks were underway.[38] Savage began an occasional series of video webcasts via Ustream on September 30, 2012. On October 17, 2012, Savage and his new syndicator Cumulus Media Networks announced that they had made a deal and the program, after several weeks off the air, would be returning as of October 23, 2012.[39] By April 2013, according to the radio industry's Talkers Magazine, Savage had 3.5+ million weekly listeners, putting him in a six-way tie for sixth place, and six talk show hosts getting 7.5+ million weekly listeners.[40] On September 26, 2013, Cumulus Media Networks announced that Michael Savage's radio show, The Savage Nation, would move to the 3p-6p ET time-slot beginning in January 2014. This time slot had been occupied by Sean Hannity.[41]\n\nIn January 2015, it was announced that Savage and Westwood One had reached agreement on a long-term contract renewal for The Savage Nation.[42]\n\nIn January 2019, Savage in collaboration with Westwood One introduced a podcast format with a mixture of live-broadcast and studio material.[43]\n\nOn March 24, 2019, Savage celebrated the 25th Anniversary of the radio show.[44]\n\nOn January 1, 2021, The Savage Nation was discontinued by Cumulus Media and Westwood One.\n\nTV [ edit ]\n\nSavage had a brief political talk show on MSNBC beginning March 8, 2003, and ending July 7, 2003. Savage was hired by MSNBC president Erik Sorenson to do the one-hour show despite Savage's previous criticism of the network in his book The Savage Nation and the objections of NBC employees. Sorenson called Savage \"brash, passionate and smart,\" and promised that he would provide \"compelling opinion and analysis with an edge.\"[45] After four months, Savage was fired from the show after remarks made in response to a caller, later identified as prank caller Bob Foster, caused controversy in the gay community.\n\nSavage is a regular guest on Newsmax television with appearances on \"Stinchfield\" and \"The Count.\"\n\nPodcast [ edit ]\n\nIn 2019 Savage launched a podcast.[46] The Savage Nation Podcast posted episodes on Tuesdays, Thursdays, and Fridays.[47][48]\n\nPolitical views [ edit ]\n\nMichael Savage calls himself an \"independent-minded individualist\" and says that he \"fits no stereotype.\"[33] In a 2006 interview, Savage cited Barry Goldwater as an influence, saying “I’m a Goldwater conservative…. If [another] Goldwater appeared, I’d work for him, I’d give money to him\"[49]\n\nSavage criticizes big government as well as liberalism and liberal activism, and accuses the mainstream news media of liberal bias. He considers the three aspects that define a nation as borders, language, and culture;[17] those aspects inspired the motto of the Paul Revere Society.[50]\n\nWildlife conservation [ edit ]\n\nSavage is a longtime advocate of wildlife conservation, and often points out that \"conservative\" and \"conservation\" have the same root, meaning \"to conserve\". He argues that conservatives should \"own\" environmental protection and conservation of wildlife resources. A December 2017 Huffington Post article quotes Savage regarding President Trump's revoking of an Obama-era trophy hunting ban: \"... long-time animal activist Michael Savage ... implored the president to reconsider:\n\n'Not all Obama legislation was bad,” said Savage. 'Some of it (like this) was grand.' \"\n\nThe article continues ... \"Savage also addressed the (biblical) aspects of killing an elephant, lion or giraffe, animals that we don’t normally hunt.\n\n'Dominion over animals doesn’t mean destroying or terrorizing them,' he said.\"[51]\n\nA March 2018 article at The Hill quotes him at greater length: \"Conservative radio host Michael Savage has also spoken out against the Fish & Wildlife Service proposed policy this week, writing in a blog post Wednesday that he 'felt betrayed' by the administration’s secret decision after having previously spoken in person with Trump on the issue.\n\n'I had spent a dinner talking to the President about environmental issues, and especially this, and this is what happened anyway,' Savage wrote. 'I made it clear that this was a red line that could not be crossed, that now elephants, lions and other big game had a target painted on them. I explained that the root of ‘conservative’ is the same as ‘conservation’ and the two do not need to be diametrically opposed. I explained what was meant by dominion, as I carefully spelled out in God Faith and Reason.' 'We hope that the president will step in here and overrule this order,' he added.'[52]\n\nThe private meeting with President Donald Trump at Mar-a-Lago[53] followed a series of pleas on his radio show for Trump to support legislation that protected wildlife.[54] In August 2019, following the Trump administration's reauthorization of the use of cyanide bombs against wild animals,[55] Savage called on the White House and the US Environmental Protection Agency to reverse approval.[56]\n\nImmigration [ edit ]\n\nSavage opposes immigration, citing the black tar heroin epidemic, large percentage of immigrant prisoners, illegal use of public services, and diminishing American nationalism.[57] in a tweet on May 17, 2019, Michael said, \"Read my lips: no new immigrants.\"[17] He frequently warns that migrants carry diseases.[17] On March 28, 2006, following pro-immigration rallies in California, he encouraged his listeners to burn Mexican flags as an act of American nationalism to protest illegal immigration from Mexico.[58][59]\n\nEuropean Union [ edit ]\n\nSavage describes the European Union as \"Hitler's dream of a united Europe under German control.\" He equates Britain's vote to leave the Union with the Second World War, saying it was \"in many ways the Battle of Britain all over again.\" Savage foresees that, after Brexit, the E.U. risks igniting a civil war to gain total control of the population for their plans of \"a new Soviet-style superstate, which have been long on the drawing books.\"[60]\n\nIn 2003, Savage said that he voted in 2000 for George W. Bush \"quite reluctantly, incidentally.\"[61] In 2004, Savage and the Revere Society hosted a party at Schroeder's Cafe in San Francisco celebrating the re-election of Bush.[50] Savage donated $5,600 to the campaign of Democratic candidate Jerry Brown in the 2006 California Attorney General election.[62]\n\nSavage strongly supported Donald Trump, a regular guest on his talk show, since Trump's June 2015 announcement of his candidacy in the United States 2016 presidential election.[citation needed] Trump has claimed to be a listener and a fan of Savage's show, and an April 2016 Salon article described Savage as having been a major influence on Trump's campaign.[63]\n\nSavage has disagreed strongly with some of Trump's actions and policies, including the appointment of John Bolton as National Security Advisor, the bombings of Syria, what Savage describes as a failure to get illegal immigration to the United States under control, and failure to protect endangered and vulnerable wild animals. Nevertheless, he has endorsed Trump for president in the 2020 United States presidential election.[64]\n\nDubai Ports World controversy [ edit ]\n\nIn early 2006, the administration of President George W. Bush approved sale of a port security contract to a company, Dubai Ports World (DP World), headquartered in The United Arab Emirates (UAE).\n\nMichael Savage was highly influential in the defeat of the deal. On February 13, the first day it was reported in the news, “Savage used his radio show to attack the transfer of American homeland assets to a company owned by an Arab state.”[65] Savage's concerns were based in part on the fact that “two of the 9/11 suicide hijackers came from the United Arab Emirates, and much of the funding for the attacks flowed through United Arab Emirates banks.”[66] On his February 17 radio show, Savage interviewed Democratic Senator Chuck Schumer of New York, a longtime nemesis with whom Savage otherwise agreed on the Dubai ports issue.[67]\n\nThe White House was listening to Savage: “Though the deal had received some newspaper attention before then, Mr. Savage's angry message raised early concerns inside the Bush White House about trouble ahead.\"[65] Savage and other opponents of the deal “generated a wave of anger from Americans across the country that left lawmakers in Washington -- by their own admission -- following their constituents much more than leading them.” Lawmakers said the negative response from constituents was overwhelming. Congressional offices on Capitol Hill were deluged by phone calls and emails protesting the deal, and congressmen told of being pulled aside wherever they went in their districts. Rep. Don Manzullo, a Republican from Illinois who is chairman of the House subcommittee on small business, said \"I got stopped all over the place,\" he said. \"People are big-time upset.\"[65]\n\nAccording to the Southern Poverty Law Center, Savage subscribes to the white genocide conspiracy theory,[68] a white nationalist belief, which claims that white people are becoming extinct through forced assimilation or violent genocide. Savage blames Barack Obama[69] and the Democratic Party for promoting the concept within the United States.[70] He has claimed there is a \"cultural genocide being promulgated against Caucasians\".[71]\n\nCOVID-19 pandemic and positions on vaccines [ edit ]\n\nA January 31, 2020, article in Stat News quoted Savage's call for a stop to flights from China: “QUARANTINE! STOP TRAVELERS FROM CHINA NOW!\"[72] Two months later, an April 16, 2020 New York Times feature article credited Savage for being one of the first in the media, especially the conservative media, to take the COVID-19 epidemic seriously. On his radio show Savage used his credentials—a PhD with training in epidemiology—to speak to his fans on coronavirus research: How the virus is transmitted; which treatments were proving effective; and the difference between morbidity and mortality rates. \"Savage's views were a departure from those of other conservative commentators, who made a concerted effort to deny that they downplayed the epidemic. Savage attacked their credibility and demanded that they be held accountable for misleading millions of Americans.\"[73] As early as February 24, 2020, Savage was saying of Limbaugh and Hannity: “How can we not let our side be called on the carpet when they lie to the people?”[73] Savage is also sharply critical of the Director of the NIAID, Dr. Anthony Fauci, dismissing him as “a grandstander” who mishandled the AIDS epidemic by refusing to close down the gay bathhouses. Savage believes that one-size-fits-all lockdowns are a threat to individual liberty, and calls instead for selective quarantine of at-risk populations.[73]\n\nIn a May 4, 2020, article in the Washington Examiner, Savage is quoted as saying he will refuse to take a coronavirus vaccine, saying that it will likely be \"ineffective and dangerous.\"[74] Savage has a history of opposing the flu vaccine, for reasons he outlined in a January 15, 2013, interview. Savage argued that the Centers for Disease Control authorities have to guess what the vaccine should be made of. “So they choose five strains out of 250-plus strains of Influenza A, and if they don’t choose the right one, you’re going to get sick,” he said. “So you’re putting your faith in the CDC’s ability to guess the one that might be a pandemic.\" He said that \"this year\" (2013), the CDC guessed right on two of the strains and wrong on one of them.[75]\n\nIn contrast to his views on the flu vaccine, Savage supports vaccines, such as for polio, that last for many years because they address an infectious agent with a low mutation rate. A 2013 Ethics Alarms article recounts Savage saying that \"...one of his heroes growing up was Jonas Salk, not because he invented the first effective polio vaccine, but because he refused to patent it, and gave it to the world for the benefit of humanity. A bit later, Savage noted that Albert Sabin, Salk’s bitter rival who later invented the oral vaccine, also declined to profit from his invention. Could all this be true, I wondered? If it is true, why did I not know about it? Why doesn’t everybody know about it? It is true. Asked why he didn’t patent his vaccine, Salk famously answered, “Can you patent the sun?”[76][77]\n\nSavage opposes wearing masks to slow the spread of COVID-19 in both indoor and outdoor settings.[citation needed] Recently, he accepted wearing masks in indoor public places.[78]\n\nActivism [ edit ]\n\nLegal defense contributions [ edit ]\n\nSavage has regularly donated money toward the legal defense of the U.S. Marines accused of murdering civilians in Haditha, Iraq; occasionally, Savage will offer proceeds from any sales through his website. Savage had regular contact with the attorneys of the accused and criticizes their treatment at Camp Pendleton.[79] Most recently, Savage has donated over $10,000 to the U.S. Marines Charity Defense Fund at the Thomas More Law Center[80] On April 25, 2007, he pledged $1 for each copy of Healing Children Naturally and Reducing the Risk of Alzheimer's purchased from his website to be donated to the U.S. Marines Defense Fund.[81] The Marines were ultimately found not guilty.\n\nAwards [ edit ]\n\nOn November 17, 2016, Savage was inducted into the National Radio Hall of Fame.[82] Savage describes this event as \"The capstone of my career.\"\n\nOn March 26, 2020, Savage was named by President Trump to serve on the Board of Directors of The Presidio Trust, which teams with the National Park Service to manage the Presidio of San Francisco, the former military fort that is part of the Golden Gate National Recreation Area. Savage stated that he hopes \"to help save this great legacy while also reminding the public of the military significance of this land.”[83] Once on the board, he regularly protested what he believed to be the museum's overemphasis on the facility's use as a Japanese American internment camp during World War II, an action he insisted was not motivated by racism but military necessity. He also did not get along with other board members, often writing them angry ALL CAPS emails about small things that greatly angered him; in turn, the rest of the board felt he could have lobbied the administration for additional funding far more intensively than he ever did, given his connections.[84] On May 20, 2021, he was ordered to resign from the Board of Directors of The Presidio Trust or he would be fired by the end of the workday. The current website for the Presidio Trust Board of Directors no longer shows him as a board member.\n\nCriticism and controversies [ edit ]\n\nIn July 2005, former CBS reporter Bernard Goldberg ranked Savage as number 61 in his book 100 People Who Are Screwing Up America. Goldberg wrote that \"Savage's brand of over-the-top bile ... puts him right in there with the angriest haters of the Left.\"[85] David Klinghoffer, a National Review columnist, speculated that The Savage Nation \"is an act, a put-on.\"[49] Various progressive advocacy groups such as GLAAD and FAIR accuse Savage of racism, homophobia, transphobia, and Islamophobia because of his controversial statements about homosexuality, Islam, feminism, sex education, and immigration.[86][87][88]\n\nOn April 17, 2006, Savage said on the topic of Muslims, \"They say, 'Oh, there's a billion of them.' I said, 'So, kill 100 million of them, then there'll be 900 million of them.' I mean, would you rather die—would you rather us die than them?\"[89] The remarks made by Savage were seriously criticized worldwide and was taken from an argument dealing with the possibility of a nuclear conflict in that region. This was repeated in the media after Savage was barred from entering the UK.[90]\n\nIn the wake of the actor Robin Williams' suicide, Savage said that suicide is an \"aggressive act\" that shows no consideration for loved ones left behind.[91] The assertion prompted criticism.[91]\n\nControversial MSNBC exchange [ edit ]\n\nSavage was hired by MSNBC to do a one-hour show which began in March 2003. Controversy arose four months later over remarks made in response to a caller who insulted Savage's teeth. Savage responded by asking if the caller was a \"sodomite\", and when the caller replied that he was, Savage said:\n\n\"Oh, so you're one of those sodomites. You should only get AIDS and die, you pig. How's that? Why don't you see if you can sue me, you pig. You got nothing better to do than to put me down, you piece of garbage. You got nothing to do today? Go eat a sausage and choke on it. Get trichinosis. Now, do we have another nice caller here who's busy because he didn't have a nice night in the bathhouse who's angry at me today? Put another- put another sodomite on ... no more calls? I don't care about these bums, they mean nothing to me. They're all sausages.\"[87]\n\nThe interchange created a firestorm of protest including calls for his firing by the LGBT group GLAAD.[87] Savage apologized on his radio program and on his website. He explained that he believed that MSNBC had gone to commercial to cover the gaffe of the attempted sabotage by a prank caller and that he was off the air at the time of the offensive comments, despite the fact that clips of the segment show Savage going to commercial after he made the comments. He also said his remarks were meant only to insult the caller, not all people with AIDS. Nevertheless, MSNBC fired him within days of the event.[92]\n\nCatholic Church and immigration [ edit ]\n\nIn March 2006, Savage criticised Roman Catholic assistance to illegal immigrants (in response to statements by Cardinal Roger Mahony of Los Angeles calling it \"pastoral support\"). Bill Donohue of the Catholic League canceled an appearance on the show, saying \"what is not fine is Savage's diatribe about the 'greedy pigs' in the Catholic Church and how 'the institution is rotten from the top to the bottom.[93]\n\nC-SPAN broadcast of Talkers Award [ edit ]\n\nWhen Talkers Magazine awarded Savage with the publication's annual \"Freedom of Speech Award,\" C-SPAN opted not to broadcast a pre-recorded speech that had been sent by Savage. Although the award ceremony had received coverage in previous years, C-SPAN did not televise it due to its policy of televising such speeches only when delivered in person. Savage told his listeners to express their ire to C-SPAN through calls and e-mails to the organization.[94]\n\nDispute with CAIR [ edit ]\n\nIn early November 2007, the Council on American–Islamic Relations (CAIR) called on radio listeners to contact companies that advertise on Savage's program to express their concerns about his comments concerning Muslims. Savage was quoted as saying Muslims \"need deportation\", and that adherents of Islam would do well to \"take your religion and shove it up your behind\" because \"I'm sick of you.\"[95] On his show and website, Savage answered by accusing CAIR of supporting Hamas.\n\nOn November 5, 2007, following a campaign by CAIR meant to get Savage off the air by alerting his sponsors to the nature of his comments, Citrix Systems, Inc. pulled its advertisements from his show.[96]\n\nSavage sued CAIR for copyright infringement for using excerpts from his show on CAIR's website.[97] The suit alleged that CAIR's repackaging of Savage's comments was \"deliberately designed to obscure the specific message conveyed by Michael Savage\". The excerpts included Savage's characterization of the Qur'an as \"a throwback document\" and a \"book of hate\". CAIR called the suit \"bizarre, sloppy and baseless\".[98] On July 25, 2008, United States district court Judge Susan Illston dismissed Savage's suit against CAIR, holding that the posting of the audio clip was protected under fair use.[99] The court gave Savage the opportunity to file an amended complaint if he wanted to try to cure the defects in his suit. That amended complaint alleged that CAIR was a RICO conspirator in support of terror, including the 9/11 terror attack on the World Trade Center. Permission was granted to allow that filing but on August 14, 2008, however, Savage's lawyer, Daniel Horowitz, announced that Savage would not file an amended complaint and would drop the case.[100] CAIR then sought attorneys fees against Savage; Judge Illston denied that request.[101]\n\nAutism [ edit ]\n\nIn July 2008, Savage said that the increasing rate of autism diagnoses was the result of \"a racket\" designed to get disability payments for \"poorer families who have found a new way to be parasites on the government.\"[102] He returned to the subject on his July 16, 2008, show with the following remarks:\n\nNow, the illness du jour is autism. You know what autism is? I'll tell you what autism is. In 99 percent of the cases, it's a brat who hasn't been told to cut the act out. That's what autism is. What do you mean they scream and they're silent? They don't have a father around to tell them, \"Don't act like a moron. You'll get nowhere in life. Stop acting like a putz. Straighten up. Act like a man. Don't sit there crying and screaming, idiot.\"[103]\n\nIn July 2008 the progressive pressure group Media Matters for America picketed the studios of WOR in New York, along with parents of autistic children.[103][104] WOR issued a statement saying, \"We regret any consternation that his remarks may have caused to our listeners.\"[102] Also that day, the insurance company Aflac pulled its advertising,[105] and the Supertalk Mississippi radio network dropped Savage's program, replacing it with The Dennis Miller Show.[106] Later that evening, Savage devoted his entire three-hour program to the subject, taking calls from parents who took issue with his comments. On that show Savage stated that his remarks had been \"ripped out of context\" by \"far left Stalinists\" who want him off of the air. He appeared on Larry King Live with Glenn Beck as the substitute host for Larry King, and said that the real issue he was commenting on was the overdiagnosis of children due to pharmaceutical companies' drive to drug children for higher profits.[102] On July 25, 2008, Autism United advocates gathered to announce that several advertisers, including RadioShack, Sears, The Home Depot, and DirectBuy, would discontinue their support for Savage's show.[107]\n\nSavage's syndicator, Talk Radio Network, responded by releasing a lengthy statement, along with a selection of 20 audio clips drawn from Savage's discussions of autism, to show that the comments were taken out of context.[108]\n\nPermanently banned from entering the United Kingdom [ edit ]\n\nOn May 5, 2009, it was announced by then-Home Secretary Jacqui Smith of the Labour party that Savage was on a list of people banned from entering the United Kingdom as he is \"considered to be engaging in unacceptable behaviour by seeking to provoke others to serious criminal acts and fostering hatred which might lead to inter-community violence\".[109][110][111][112] During his radio broadcast on that same day, Savage declared that he would sue Smith personally for defamation, calling her a \"lunatic\".[113]\n\nDuring a subsequent NPR talk show, Savage said that he has never advocated violence and repeatedly invoked the United States Constitution's First Amendment. After host Neal Conan pointed out that the U.S. Constitution does not apply to the United Kingdom, Savage replied, \"No. Thank God I'm an American. But for this lunatic ... to link me up with Nazi skinheads who are killing people in Russia ... to put me in league with Hamas murderers who killed Jews on buses, is astonishing\".[114] Savage also called on his listeners to support him by canceling travel and business in Britain as well as by boycotting British-made goods, commenting, \"If they want to play hardball, we'll play hardball.\"[115] When a caller challenged Savage about his talk show rhetoric, Savage called him a \"foaming lunatic ... someone in pajamas in a mental asylum ... You're nobody and I'm not going to talk to you!\" At that point, Neal Conan invited him to leave.[114]\n\nOf the banning, the former Mayor of London, Boris Johnson, wrote: \"America still has a constitutional protection of free speech, and I have been amazed ... to see how few people in this country are willing to stick up for that elementary principle ... a country once famous for free speech is now hysterically and expensively sensitive to anything that could be taken as a slight.\"[116] After Johnson became Prime Minister in 2019, Savage's attorney requested the ban be overturned, however no action has been taken by the Conservative government as of 2020.[117][118] In The Guardian, Catherine Bennett wrote: \"The ban on Savage is so far from being a comprehensible act, so staggeringly capricious and stupid, as to defy evaluation.\"[119] Sam Leith wrote: \"Barring this shock-jock from Britain risks turning a rabid blabbermouth into a beacon for free speech.\"[90]\n\nVeteran PTSD [ edit ]\n\nOn October 14, 2014, Savage criticized veteran sufferers of posttraumatic stress disorder, accusing them of \"weakness\". According to Savage, \"Everyone has depression in their life. But if the whole nation is told, 'boo-hoo-hoo, come and get a medication, come and get treatment, talk about mental illness.' You know what you wind up with? You wind up with Obama in the White House and liars in every phase of the government. That's what you wind up with. It's a weak, sick, nation. A weak, sick, broken nation. And you need men like me to save the country. You need men to stand up and say stop crying like a baby over everything ... No wonder we're being laughed at around the world. No wonder ISIS can defeat our military.\"[120]\n\nPersonal life [ edit ]\n\nWhile in the South Pacific, he became fascinated with the 19th-century sailor Charles Savage, who was believed to have been the first man to bring firearms to Fiji.[26] That fascination led to Weiner's name change to Savage.\n\nSavage and his second wife, Janet, have two children, a daughter Rebecca Lin Weiner Yops born on March 2, 1967, and a son; his son, Russell Weiner, born on February 15, 1970, is the founder of the company that produces the Rockstar energy drink.[121] Russell's mother, Janet, served as CFO of his company until July 2009.[10] In 1974, Savage and his family moved to Fairfax, California, after Savage completed his master's degree at the University of Hawaii.[20] Savage has homes in Larkspur and Tiburon in Marin County, California, an apartment in San Francisco, as well as residences in Beverly Hills, California, and West Palm Beach, Florida.[20][122][123]\n\nDuring the 1980s, Savage attended Friday night services at a Jewish Synagogue Chabad house in Berkeley.[8] In a 2003 interview on The O'Reilly Factor, Savage has said that although he believes in God, he attends houses of worship only once or twice a year.[124] In his 2012 book Trickle Down Tyranny, Savage wrote: \"... I'm not religious. Do I believe in God? Sometimes I do, sometimes I don't.\"[125] In his podcast aired 25 November 2020, Savage stated: \"Trust in God. God leads my footsteps. God has determined that I will be on podcast come January. God determines a lot of things in our lives and you have to trust in God and just say its fate at a certain point. Now, I've always believed that we make our own fate. I've not been one of these leaves-in-a-stream type of personalities...\"[126]\n\nIn December 2019, Savage notably suffered a heart attack, but subsequently recovered and returned on air.[127]\n\nSavage has had many pet dogs throughout his life. His beloved toy poodle Teddy died in late 2021.[128]\n\nBooks [ edit ]\n\nIn total, Savage has written 44 books, twenty under his real name of Michael Weiner, and twenty-four under the pseudonym of Michael Savage. As Michael Savage, his works include two #1 New York Times Best Sellers and three additional books which made The New York Times Best Seller list.[129][130][131] have also been reprinted under his alias of Michael Savage.\n\nHis earlier books as Michael A. Weiner, Ph.D., draw on his doctoral expertise in the field of nutritional ethnomedicine. In them, he advocates nutritional, herbal, and homeopathic options to approach the prevention and treatment of diseases such as poor diet, aging, arthritis, Alzheimer's disease, cancer, allergies, cocaine addiction, the common cold, and HIV/AIDS.[132] He has also written about tree planting, beer-tasting, and nutritional cooking.[132]\n\nHis more recent books as Michael Savage are political in nature and published by a variety of different companies. His recent works also include holiday family stories and thrillers.\n\nIn 1991, Savage self-published The Death of the White Male, an argument against affirmative action, through Quantum Books.[133] In the book, Savage, calls affirmative action \"reverse discrimination\", and demonstrates his emerging philosophy. This eventually led to his starting the Paul Revere Society and he continues to sell the book to raise money for this group.[134]\n\nIn January 2003, Savage published The Savage Nation: Saving America from the Liberal Assault on Our Borders, Language and Culture, his first major book under the pseudonym Michael Savage. The book directs attacks at \"liberal media bias\", the \"dominating culture of 'she-ocracy'\", gay activists, and liberals.\n\nIn January 2004, Savage published his second political book The Enemy Within: Saving America from the Liberal Assault on Our Schools, Faith, and Military. His next book, Liberalism Is a Mental Disorder, was released on April 12, 2005. Unlike The Savage Nation, both of these books cited sources for some of the more controversial claims made.[citation needed]\n\nIn April 2006, Savage released The Political Zoo. The book contains satirical profiles and cartoons of different public figures, most of whom are liberal political figures and celebrities, depicted in caricature as animals in the \"Political Zoo\", with Savage portrayed as the zoo keeper.\n\nIn October 2010, Savage released Trickle Up Poverty: Stopping Obama's Attack on Our Borders, Economy, and Security. Released through the HarperCollins imprint of William Morrow and Company, Savage argues in the book that \"Americans are boiling mad over the way Congress and this Marxist/Leninist-oriented President are manipulating the current economic crisis to nationalize businesses.\"[135]\n\nIn November 2010, it was confirmed that Savage had signed a deal to write two thrillers for publisher St. Martin's Press. The first political thriller, Abuse of Power, was released on September 13, 2011. The novel is based on \"My fictionalized account of being banned from Britain and hunted by overbearing governments is set in the San Francisco only I know\", said Savage. It is set in San Francisco, mainly in North Beach, as well as London, and Tel Aviv. It tells the story of a failed carjacking that reveals a government cover-up. A dark plot involving British officials and a terrorist group known as \"the Hand of Allah\". The publisher has described the novel by saying, \"will make 9/11 look like child's play\".[136]\n\nIn 2014, Savage released Stop the Coming Civil War: My Savage Truth, in which Savage writes in part, \"We are under assault from both inside and out as our government moves to consolidate its domestic power, while at the same time weakening our defenses against the growing power of our enemies.\"[137]\n\nIn 2015, Savage released another a book titled Government Zero: No Borders, No Language, No Culture. In it he writes that the country has been left without the founding principles of his radio show, \"borders, language and culture,\" and describes what he calls the destruction that the Presidency of Barack Obama brought to the country. He offers several solutions to rebuild the nation.[138]\n\nIn 2016, Savage's book Scorched Earth: Restoring The Country After Obama. This work was a blueprint for how then candidate Donald Trump could help get the country back on the right track should he win the election.[139]\n\nIn March 2017, Savage released what he said would be his last political book, Trump's War: His Battle For America. The book debuted at number one on The New York Times Best Seller List.[140]\n\nIn November 2017, Savage released a non-political book on his search for spiritual truth, God, Faith, and Reason.[141]\n\nIn October 2018, Savage published a book on American psychology, Stop Mass Hysteria: America's Insanity from the Salem Witch Trials to the Trump Witch Hunt. [142] In it he discusses what he calls the many \"loud flashpoints\" that he believes have engulfed American thought over the nation's history, and relates those phenomena to what he describes as a current obsession with Trump hatred.\n\nIn June 2019, Savage published a new book of stories and anecdotes entitled A Savage Life.\n\nBibliography [ edit ]\n\nLiterature as Michael A. Weiner [ edit ]\n\nLiterature as Michael Savage [ edit ]"}, {"url": "https://factualideas.com/michael-savage/", "page_content": "Michael Savage Bio, Age, Live, Podcast, Radio, Website, Livestream\n\nWho Is Michael Savage?\n\nMichael Savage (real name: Michael Alan Weiner) is an American radio host, author, activist, nutritionist, and a conservative political commentator. He is the host of a nationally syndicated talk show The Savage Nation.\n\nThe show aired on Talk Radio Network across the United States until 2012. Savage has been syndicated by Cumulus Media Networks since October 23, 2012. The Savage Nation was the second most-listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States.\n\nMichael Savage Education\n\nSavage attended Jamaica High School from where he graduated in 1958. He then joined Queens College where he earned a bachelor’s degree in biology in 1963. After college, Savage taught high school for several years in New York City. He then studied at the University of Hawaii at Manoa, earning a Master of Science in botany in 1970 and also a Master of Arts in anthropology in 1972. In 1978, Savage obtained a Ph.D. from the University of California, Berkeley, in nutritional ethnomedicine. Michael’s thesis was titled Nutritional Ethnomedicine in Fiji.\n\nHow Old Is Michael Savage?\n\nMichael Alan Weiner was born on March 31, 1942, in The Bronx, New York, U.S. He is 77 years old as of 2019.\n\nMichael Savage Wife\n\nSavage first married Carol Ely in 1964 but ended up in divorce. He remarried in 1967 after meeting Janet, his second wife. Janet served as CFO of his son’s company until July 2009.\n\nMichael Savage Daughter\n\nSavage and Janet have two children, a daughter Rebecca Lin Weiner Yops, and a son Russell Weiner.\n\nMichael Savage Son\n\nHis son Russell Weiner, is the founder of the company that produces the Rockstar energy drink. Michael and his family moved to Fairfax in 1974, California after Savage completed his master’s degree at the University of Hawaii.\n\nMichael Savage Radio Show\n\nThe rejection by publishers of Michael’s 1994 manuscript about illegal immigration and epidemics prompted him to record a demo tape with a mock radio talk show about the contents of the work. He then mailed the tape to 250 radio stations in his attempt to change careers and be a radio talk show host. He began his radio career on March 21, 1994, on KGO (a San Francisco news/talk radio station) as a fill-in host for the liberal Ray Taliaferro and he was later a weekend host.\n\nSavage was given his own show On January 1, 1995, during the drive-time hours on sister station KSFO. The Savage Nation quickly became a local hit. He reached #1 in Arbitron ratings among both adult men and women over 18 during his time at KSFO during afternoon drive-time in San Francisco and also became the top talk host in his time slot.\n\nHe had 8–10 million listeners per week in mid-2006, and this made his show the third most widely heard broadcast in the United States at that time. It had an audience of 8 to 10 million listeners on 400 stations across the United States, making it the second most-listened-to radio talk show in the country at the time of 2009.\n\nKNEW-AM (910 kHz) in Savage’s home market of San Francisco announced on September 10, 2009, that it was dropping his program and replacing him with John and Ken from sister station KFI-AM (640 kHz)/Los Angeles. KNEW-AM dropped in the ratings since Savage was let go according to Arbitron. KTRB then picked up the program which saw ratings boost in the afternoon drive.\n\nThe talk show left the airwaves on September 27, 2012, after Savage won a legal battle with Talk Radio Network, his longtime employer. Savage’s attorney said discussions with new networks were underway. On September 30, 2012, he began an occasional series of video webcasts via Ustream. Michael and his new syndicator Cumulus Media Networks announced on October 17, 2012, that they had made a deal and the program, after several weeks off the air, would be returning as of October 23, 2012. Cumulus Media Networks announced on September 26, 2013, that The Savage Nation, would move to the 3p-6p ET time slot beginning in January 2014 which Sean Hannity occupied. It was then announced in January 2015 that Savage and Westwood One had reached an agreement on a long-term contract renewal for The Savage Nation.\n\nMichael Savage MSNBC\n\nHe was hired by MSNBC president Erik Sorenson to do a one-hour show beginning March 8, 2003. Despite his previous criticism of the network in his book The Savage Nation and also the objections of NBC employees including news anchor Tom Brokaw, who asked NBC executives.\n\nOn July 7, he was fired from his MSNBC television show after remarks made in response to a caller, later identified as prank caller Bob Foster, who insulted Savage’s teeth. A day later after being fired, he apologized on his radio program and on his website. He also explained that he believed that MSNBC had gone to commercial to cover the gaffe of the attempted sabotage by a prank caller and that he was off the air at the time of the offensive comments.\n\nMichael Savage Website\n\nTo know more about Savage and his podcasts, click here.\n\nMichael Savage Trump\n\nMichael has met President Donald Trump on numerous occasions and was also formally invited to the White House to meet with the President and Vice President Mike Pence. Savage had not been in Washington D.C. for three decades prior to this visit.\n\nMichael Savage’s New Book\n\nA Savage Life – 2019\n\nMichael Savage Books\n\nAmong Savage’s books include;\n\nGod, Faith, and Reason – 2017\n\nStop Mass Hysteria: America’s Insanity from the Salem Witch Trials to the Trump Witch Hunt – 2018\n\nLiberalism Is a Mental Disorder – 2005\n\nGovernment Zero: No Borders, No Language, No Culture – 2015\n\nThe Savage Nation (book) – 2002\n\nStop the Coming Civil War: My Savage Truth – 2014\n\nAbuse of Power: A Thriller – 2011\n\nThe Political Zoo – 2006\n\nA Time for War: A Thriller – 2013\n\nCountdown to Mecca: A Thriller – 2015\n\nTrickle Down Tyranny: Crushing Obama’s Dream of the Socialist States of America – 2012\n\nScorched Earth: Restoring the Country After Obama – 2016\n\nTrain Tracks: Family Stories for the Holidays – 2012\n\nThe Enemy Within (Savage book) – 2003\n\nTeddy and Me: Confessions of a Service Human – 2016\n\nTrickle Up Poverty: Stopping Obama’s Attack on Our Borders, Economy, and Securit – 2010\n\nDiseases Without Borders: Boosting Your Immunity Against Infectious Diseases from the Flu and Measles to\n\nTuberculosis – 2016\n\nHealing Children Naturally – 1993\n\nBanned in Britain – 2009\n\nA Savage Life – 2019\n\nMaximum immunity – 1986\n\nReducing the risk of Alzheimer’s- 1987\n\nEarth medicine–earth food – 1972\n\nMichael Savage’s Net Worth\n\nThrough his radio broadcasting career, Savage has acquired an estimated net worth of $18 million."}, {"url": "https://marriedwiki.com/wiki/michael-savage", "page_content": "Michael Savage Personal Life\n\nMichael Savage is happily married to his girlfriend turned wife, Janet in 1967. The duo shares two children, a son Russell Weiner and daughter Rebeccas Lin Yops.\n\nPreviously, he was married to Carol Ely in 1964 and they divorced later. This legendary host has also been rumored to be dating a guy and has been surrounded with rumors of being gay.\n\nMichael Savage Net Worth\n\nMichael Savage holds an estimated net worth of $50 million.\n\nMichael Savage Wiki-Bio\n\nMichael Savage was born as Michael Alan Weiner on March 31, 1942, in Bronx, New York to parents Benjamin and Rae.\n\nSavage attended Jamaica High School in 1958. She graduated from the Queens College in 1963 in biology."}, {"url": "https://peoplepeople.org/michael-savage/", "page_content": "Net Worth $80 Million Date Of Birth 1942-03-31 Place Of Birth The Bronx Gender Male Height 5 ft 8 in (1.73 m) Nationality United States of America Profession Writer, Author, Commentator, Radio personality\n\nMichael Savage is a well-known American radio host, author, and political commentator with a net worth of $80 million. He is most popular for his radio show, “Savage Nation,” and the related books he has authored promoting “conservative nationalism.” Michael Savage has gained a huge following over the years due to his outspoken nature and controversial views. In this article, we will delve deeper into Michael Savage's life and career, exploring his early years, radio career, political views, controversies, and personal life.\n\nEarly Life\n\nMichael Savage, born Michael Alan Weiner, was born on March 31, 1942, in The Bronx, New York. He was born into a Jewish family and was one of three children of Rae and Benjamin Weiner, who were both Russian immigrants. Michael had a difficult upbringing due to his father's gruff and profane nature, which often left him feeling criticized and belittled. In 1969, Michael's younger brother Jerome died; he was born deaf and could not speak.\n\nAfter graduating from Jamaica High School, Michael attended Queens College, where he earned his Bachelor's degree in Biology in 1963. Following college, Michael Savage taught high school for several years in New York before pursuing his passion for radio.\n\nRadio Career\n\nIn 1994, Michael Savage recorded his demo tape with a mock radio talk host about his work contents, and he mailed the tape to 250 radio stations across the country. The same year, he began his radio career on San Francisco’s KGO as a fill-in host for liberal Ray Taliaferro’s overnight show.\n\nThe following year, Michael debuted as the host of “The Savage Nation,” which was played on 400 stations across the U.S. The show gained enormous popularity and quickly became the second most-listened-to radio talk show in the nation. At the peak of “Savage Nation,” the show had an audience of nearly 10 million people per day and was broadcast on 400 radio stations in the United States.\n\nThroughout his career, Michael Savage has written 40 books, including two New York Times bestsellers. In 2017, he released the book “Trump’s War: His Battle For America.” Michael Savage is also known for co-founding the Paul Revere Society in 2005, which was a group of conservative activists seeking \"to rescue the nation from the grips of the globalist cabal.\"\n\nPolitical Views\n\nMichael Savage likes to describe his political views as conservative nationalism. He is an ardent supporter of President Donald Trump and has been credited with helping him to become President of the United States. Michael Savage characterizes his political philosophy in three words: borders, language, and culture. He supports the English-only movement and opposes illegal immigration to the U.S.\n\nMichael Savage claims that progressivism and liberalism are degrading American culture. He also has an outspoken nature when it comes to his opinion on various social issues. In 2006, Michael Savage was banned from entering the United Kingdom because of his controversial views on Islam. Throughout his career, he has often been under fire from LGBT groups for various insulting statements.\n\nAccording to the Southern Poverty Law Center, Michael Savage subscribes to the white genocide conspiracy theory, which is a white nationalist belief. This political philosophy maintains that immigration policies in Europe and North America will lead to the replacement of white populations with non-white populations.\n\nControversies\n\nMichael Savage has been involved in several controversies throughout his career. In 2014, he aroused tremendous controversy by setting his sights on sufferers of post-traumatic stress disorder, calling sufferers of that condition \"weak\" and drawing parallels between their plight and the Obama administration. In 2020, Michael Savage vehemently opposed wearing masks in public to slow the spread of COVID-19 in both indoor and outdoor settings.\n\nThroughout his career, Michael Savage has been under the spotlight for his controversial statements. He has been criticized by many organizations, including the Southern Poverty Law Center, for his divisive political rhetoric. His statements have led to widespread protests and calls for boycotts of his radio show.\n\nPersonal Life\n\nMichael Savage was married to Carol Ely in 1964, but they divorced later on. He remarried in 1967 after meeting his current wife, Janet. He and Janet have two children, a daughter and a son. Interestingly, Michael's son Russ Weiner is the billionaire founder of Rockstar Energy Drink. Michael's ex-wife Janet was Russ' earliest investor and served as the company's CFO. When Pepsi acquired Rockstar for $3.85 billion in March 2020, Russ was left with a net worth of $4 billion while Janet was left with a net worth of at least $200 million.\n\nMichael Savage has been a controversial figure in the media, with his outspoken nature and divisive political views. His radio show, “Savage Nation,” has been a huge success over the years, attracting millions of listeners from all around the world. Despite the controversies surrounding him, Michael Savage remains a prominent figure in American politics and media."}, {"url": "https://www.bookseriesinorder.com/michael-savage/", "page_content": "Publication Order of Jack Hatfield Books\n\nAbuse of Power (2011) Hardcover Paperback Kindle A Time for War (2013) Hardcover Paperback Kindle Countdown to Mecca (2015) Hardcover Paperback Kindle\n\nPublication Order of Short Stories/Novellas\n\nThe Survivor (2016) Hardcover Paperback Kindle Xenon (2018) Hardcover Paperback Kindle\n\nPublication Order of Short Story Collections\n\nTrain Tracks (2012) Hardcover Paperback Kindle\n\nPublication Order of Non-Fiction Books\n\nThe Death of the White Male (1991) Hardcover Paperback Kindle Compassionate Conservative Speaks (1995) Hardcover Paperback Kindle The Savage Nation (2000) Hardcover Paperback Kindle The Enemy Within (2004) Hardcover Paperback Kindle Liberalism is a Mental Disorder (2005) Hardcover Paperback Kindle The Political Zoo (2006) Hardcover Paperback Kindle Psychological Nudity (2008) Hardcover Paperback Kindle Trickle Up Poverty (2010) Hardcover Paperback Kindle Trickle Down Tyranny (2012) Hardcover Paperback Kindle Stop the Coming Civil War (2014) Hardcover Paperback Kindle Government Zero (2015) Hardcover Paperback Kindle Diseases without Borders (2015) Hardcover Paperback Kindle Teddy and Me (2016) Hardcover Paperback Kindle Scorched Earth (2016) Hardcover Paperback Kindle Trump's War (2017) Hardcover Paperback Kindle God, Faith, and Reason (2017) Hardcover Paperback Kindle Stop Mass Hysteria (2018) Hardcover Paperback Kindle A Savage Life (2019) Hardcover Paperback Kindle Our Fight for America (2020) Hardcover Paperback Kindle\n\nBook links take you to Amazon. As an Amazon Associate I earn money from qualifying purchases.\n\nMichael Alan Weiner (better known by his stage name Michael Savage) hosts a radio show, is an author, a nutritionist, activist, conservative political commentator, and host of a radio show (called The Savage Nation). He won a Freedom of Speech by Talkers Magazine, and the speech he delivered was pre-recorded.\n\nHis radio show came about after a manuscript about illegal immigration was rejected led him to make a demo that was a mock radio talk show. He sent the recording to 250 stations to try and become a radio talk show host. He got a job on KGO, which is a station in San Francisco that is news and talk radio; at first, he was filling in for a liberal host and later worked the weekends as host.\n\nHe got his own show in 1995 for KSFO during the drive time hours. By 2009, his show was aired on four hundred stations in America and listened to by around eight to ten million people, making it the second most listened to show in the country.\n\nHe was born March 31, 1942 in The Bronx, New York, and was one of three children his parents had. One of his brothers, Jerome, was unable to hear or talk after being born with developmental disabilities and died in 1969. He has four degrees, one a PhD. Savage has been married twice, once in 1964, that ended in 1967. His second began in the year 1967. He has two kids with his second wife, one is Russell Weiner, who founded the company that makes Rockstar energy drink. His mother was the CFO of the company for a time.\n\n“Abuse of Power” is the first “Jack Hatfield” novel, which was released in the year 2011. Jack Hatfield was a war correspondent, making a name for himself for his provocative and insightful commentary. He loses his job after his name is wrecked when he gets called an extremist and bigot by a group that is leftist media watchdog. He has to start over in obscurity, while working as a news producer, in a freelance capacity, in the city of San Francisco.\n\nHatfield is doing a ride along with the bomb squad of the San Franscisco police, and what appears to be a routine carjacking ends up deadly. This happens when the cops find many pounds worth of military grade explosives in the vehicle that was stolen. Hatfield is urged by the FBI to keep out of it, and it is a sign, he knows that he is on to something huge.\n\nThis is the start of a shadowy trail that takes Hatfield all over the world and back. From Tel Aviv, Paris, and London. He works with a Green Beret vet and an agent of Yemeni intelligence so they can expose a group of terrorists called Hand of Allah. They will expose a plot, hidden in power’s highest corridors that is going to make 9/11 look tiny in comparison.\n\nFans of the novel found this to be a stellar first work of fiction. It was a good and quick read. The writing is better than expected, not to mention a fun time.\n\n“A Time for War” is the second “Jack Hatfield” novel, which was released in the year 2013. A Chinook chopper full of Navy Seals plummets to earth all of a sudden in Afghanistan. A car of FBI agents, who trail a suspicious vehicle is rendered immobile somehow in San Francisco. A Chinese agents body is discovered floating just miles away from the Golden Gate Bridge, after he got fed to some sharks. America is under a secret attack and it is up to Jack Hatfield to keep it from happening, as he is the only one that is able to sense it is even happening.\n\nDover Griffith (who is a young woman that is a staffer at Office of Naval Intelligence and is idealistic) helps him as he investigates. The case leads him to a billionaire who sold his own country out, with some American officials at the highest level of the government.\n\nEnemy operatives are planning on a two pronged attack that is going to cripple the American military and kill thousands of citizens with a deadly toxin. Hatfield and Dover are trying to find the ground zero and save the country, which suspects nothing.\n\nFans of the novel found this pulls off something tough by having a political television show host filling the role of a thriller hero with Jack. The story moves along at a nice pace, and the plot is quite interesting. The dialogue engages and the characters are quite realistic.\n\n“Countdown to Mecca” is the third second “Jack Hatfield” novel, which was released in the year 2015. A plane goes down in the Caspian Sea, its destination was Amman, Jordan. There are no survivors except for the Russian mercenary that was the one that hijacked the plane. There is also a cask that has an agent that could be highly destructive. This is a carefully planned out terrorist attack, and the chaos that comes with it might just be enough to push America into another expensive war.\n\nJack may be able to stop this attack. He made a politically incorrect statement that was about Islamic extremists and got discredited, which forced him to try to fix what was left of his career. Sammy (Jack’s half brother) calls him up and says that his neighbor heard something she was not supposed to, making both of their lives in danger. Jack finds that he has found a conspiracy to ruin Mecca. He, with a like minded bunch of friends who are on the law’s fringes, have to find out who is behind the plot and keep them from succeeding. If they don’t, they will witness the world’s collapse into a war where global destruction is assured.\n\nFans of the novel found this to be quite a nail biter of a novel. This is a great fictional thriller that uses current events very well to tell its story. Here is a great writer, able to spin a superb tale."}, {"url": "https://realconservativebooks.com/michael-savage-books/", "page_content": "Born Michael Alan Weiner, he adopted the pen name Michael Savage as a persona for his political books. And Savage has been prolific with 24 titles under that name as well as 20 as Weiner.\n\nUnlike many Conservative authors with a background in law, Savage has a Master of Science in botany and a Master of Arts in anthropology as well as a PhD in nutrionalethnomedicine. His 20 books under his legal name Weiner all focus on topics related to nutrition, herbal medicine and homeopathy.\n\nSavage’s political views turned Conservative in the 1980s and his rise to fame as a commentator came after numerous publishers rejected one of his works. In response he decided to branch out into talk radio and in 1994 landed his first job at a San Francisco AM radio station. From there his success ballooned and by 2009 he had over 20 million daily listeners, as Conservative talk radio grew in popularity along with the likes of Rush Limbaugh and Sean Hannity.\n\nSavage describes himself as a Goldwater conservative and is a firm believer in borders, language and culture as the foundation of a country. He’s strongly opposed to big government and the monolithic corporate media.\n\nHe differs from many on the Right in his views on the environment. A proponent of wildlife conservation, he believes environmental protection should be a primary tenant of the Conservative agenda.\n\nIn addition to his works of non-fiction, Savage has also written a three-part political thriller series staring protagonist Jack Hatfield: Abuse of Power, A Time for War and Countdown to Mecca.\n\nMichael Savage Books\n\nA Savage Life – 2019\n\nStop Mass Hysteria: America’s Insanity from the Salem Witch Trials to the Trump Witch Hunt, from the Red Scare to Russian Collusion – 2018\n\nGod, Faith, and Reason – 2017\n\nTrump’s War: His Battle for America – 2017\n\nScorched Earth: Restoring the Country after Obama – 2016\n\nTeddy and Me: Confessions of a Service Human – 2016\n\nDiseases without Borders: Boosting Your Immunity Against Infectious Diseases from the Flu and Measles to Tuberculosis – 2016\n\nGovernment Zero: No Borders, No Language, No Culture – 2015\n\nCountdown to Mecca – 2015\n\nStop the Coming Civil War: My Savage Truth – 2014\n\nA Time for War – 2013\n\nTrain Tracks: Family Stories of the Holidays – 2012\n\nTrickle Down Tyranny – 2012\n\nAbuse of Power – 2011\n\nTrickle Up Poverty: Stopping Obama’s Attack on Our Borders, Economy, and Security – 2010\n\nBanned in Britain: Beating the Liberal Blacklist – 2009\n\nPsychological Nudity: Savage Radio Stories – 2008\n\nThe Political Zoo – 2006\n\nLiberalism Is a Mental Disorder: Savage Solutions – 2005\n\nThe Enemy Within: Saving America from the Liberal Assault on Our Churches, Schools, and Military – 2003\n\nThe Savage Nation: Saving America from the Liberal Assault on Our Borders, Language, and Culture – 2002\n\nThe Compassionate Conservative Speaks – 1995\n\nThe Death of the White Male: The Case Against Affirmative Action – 1991"}, {"url": "https://peoplepill.com/people/michael-savage-1/", "page_content": "Michael Alan Weiner (born March 31, 1942), better known by his professional name Michael Savage, is an American radio host, author, activist, nutritionist, and conservative political commentator. He is the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2012, and in 2009 was the second most listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States. Since October 23, 2012, Michael Savage has been syndicated by Cumulus Media Networks. He holds master's degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine. As Michael Weiner, he has written books on nutrition, herbal medicine, and homeopathy; as Michael Savage, he has written four political books that have reached The New York Times Best Seller List.\n\nSavage has summarized his political philosophy in three words: borders, language, and culture. Savage has characterized his views as conservative nationalism, while critics have characterized them as \"fostering extremism.\" He opposes illegal immigration to the United States, supports the English-only movement and argues that liberalism and progressivism are degrading American culture. Although his radio delivery is mainly characterized as politically themed, he also often covers topics such as medicine, nutrition, music, literature, history, theology, philosophy, sports, business, economics, and culture, and tells personal anecdotes.\n\nSince 2009, Savage has been barred from entering the United Kingdom, for \"seeking to provoke others to serious criminal acts and fostering hatred.\"\n\nEarly life and education\n\nSavage was born Michael Alan Weiner in the Bronx, New York, one of three children of Benjamin and Rae Weiner, Jewish emigrants from Russia. He described his childhood as difficult. His father, the owner of an antiques shop, died of a heart attack at age 57 in 1970, and his mother died in 2003.\n\nAfter graduating from Jamaica High School in 1958, Savage attended Queens College, where he earned a bachelor's degree in biology in 1963. After college Savage taught high school for several years in New York City. His first marriage in 1964 to Carol Ely ended in divorce, and he remarried in 1967 after meeting his current wife, Janet. During this time Savage also worked for famous psychedelic drug advocate Timothy Leary as keeper of the stone gatehouse on the Hitchcock Cattle Company estate at Millbrook NY, to which Leary had been given access. Leary hired him to the post because Savage did not use LSD himself. Savage then studied at the University of Hawaii at Mānoa, earning a Master of Science in botany in 1970 and a Master of Arts in anthropology in 1972. He obtained a PhD in 1978 from the University of California, Berkeley, in nutritional ethnomedicine. His thesis was titled Nutritional Ethnomedicine in Fiji.\n\nShift in political opinions\n\nSavage introduced himself to certain writers in the North Beach area of San Francisco in the 1970s. He befriended and traveled with Beat poets Allen Ginsberg and Lawrence Ferlinghetti. Stephen Schwartz, also an acquaintance of Savage from this time, reported Savage possessed a photograph of himself and Ginsberg swimming naked in Hawaii and used the photograph as sort of a \"calling card.\" Savage maintained a correspondence with Ginsberg consisting of ten letters and a trio of postcards across four years, which is maintained with Ginsberg's papers at Stanford University. One letter asked for Ginsberg and Ferlinghetti to come do a poetry reading, so others could \"hear and see and know why I adore your public image.\" Another acquaintance was poet and author Neeli Cherkovski, who says that Savage dreamed of becoming a stand-up comic in the mold of Lenny Bruce.\n\nAcquaintance Robert Cathcart says that by 1980, in his private conversations with Savage, he knew him to have conservative political views. Schwartz stated Savage became alienated from the North Beach scene in the early 1980s. Savage had intense arguments with his liberal friends. When asked about his shift in politics and other views, Savage replied, \"I was once a child; I am now a man.\" Savage has cited many occurrences in his life that helped shape his conservative views. Savage states that his opinions on welfare were partly shaped by his first job out of college as a social worker. He described one incident in which his supervisor had him deliver a check to a welfare client to furnish their apartment, while his own apartment was furnished with cardboard boxes. Another turning point occurred for him as a writer of health and nutrition books in the 1980s, when he experienced what he saw as \"political opposition\" after making the suggestion that the closure of homosexual bathhouses might be necessary in response to the emerging AIDS epidemic. In 1994 his final health and nutrition manuscript, Immigrants and Epidemics, was rejected by publishers for being inflammatory. In 1996, Savage applied to become the Dean of the Graduate School of Journalism at the University of California, Berkeley. The University instead selected award-winning journalist and China scholar Orville Schell. Savage sued the University, contending discrimination for being conservative. Savage later dropped the lawsuit.\n\nRadio\n\nThe rejection by publishers of his 1994 manuscript about illegal aliens and epidemics prompted Savage to record a demo tape with a mock radio talk show about the contents of the work. He mailed this tape to 250 radio stations in an attempt to change careers and become a radio talk show host. On March 21, 1994, Savage began his radio career on KGO (a San Francisco news/talk radio station) as a fill-in host for the liberal Ray Taliaferro. At the time, his slogan was \"To the right of Rush and to the left of God.\" On January 1, 1995, he was given his own show during the drive-time hours. The show quickly became a local hit. During his time at KSFO, Savage reached #1 in Arbitron ratings among both adult men and women over 18 during afternoon drive-time in San Francisco and became top talk host in his time-slot.\n\nIn mid 2006, Savage had 8–10 million listeners per week, which made his show the third most widely heard broadcast in the United States at that time. Savage has described his listeners as \"literate callers with intelligence, wit, and energy.\" He has described his show's production as one with a \"... hard edge combined with humor and education ... Those who listen to me say they hear a bit of Plato, Henry Miller, Jack Kerouac, Moses, Jesus, and Frankenstein.\" Mark de la Viña of the San Jose Mercury News wrote of Savage: \"In contrast to Rush Limbaugh, Sean Hannity and Laura Schlessinger, Bay Area-based Savage mixes conservative diatribe and blunt observations with acerbic humor and the gift of gab.\"\n\nBy 2009, The Savage Nation had an audience of 8 to 10 million listeners on 400 stations across the United States, making it the second most listened-to radio talk show in the country at the time. Around that time, Savage asked his audience for their opinion prior to consenting to a profile interview by Kelefa Sanneh of The New Yorker; Savage eventually accepted that offer and the New Yorker profile, titled \"Party of One\", was published in the August 3, 2009, issue, which covered Savage's life and personality in great detail.\n\nOn September 10, 2009, KNEW-AM (910 kHz) in Savage's home market of San Francisco announced that it was dropping his program and replacing him with John and Ken from sister station KFI-AM (640 kHz)/Los Angeles. John Scott, program director of KNEW said in an e-mail that the station was headed \"... in a different philosophical and ideological direction, featuring more contemporary content and more local information.\" According to Arbitron monthly ratings, KNEW-AM dropped in the ratings since Savage was let go. San Francisco station KTRB picked up the program for the San Francisco market, and saw a ratings boost in the afternoon drive. However, the program was among the first casualties when KTRB went into receivership in September 2010.\n\nOn January 22, 2010, Savage revealed to his audience that a writer for Playboy had contacted him via email to do a lengthy interview, and again asked his listeners if he should accept the offer. During the show, Savage read from personal emails between the Playboy writer and himself. The writer admitted to being a listener of the Savage Nation but a critic of the profile done by The New Yorker. The writer also stated that the purpose of the interview was to \"rattle\" Playboy's readers. On May 12, 2010, Savage revealed that he had granted the interview at his home. Playboy published the interview in June 2010. He read from a pre-publication copy of the 8,000-word Playboy interview, in which the writer expressed animosity for Savage and his views. Savage said that he was disappointed at the lack of journalistic objectivity, but did not harbor hatred for the writer. He referred back to the New Yorker interview by Kelefa Sanneh, and praised Sanneh as a \"real writer\" who had understood his subject.\n\nOn September 27, 2012, Savage's talk show left the airwaves after he won a legal battle with Talk Radio Network, his longtime employer, and his attorney said discussions with new networks were under way. Savage began an occasional series of video webcasts via Ustream on September 30, 2012. On October 17, 2012, Savage and his new syndicator Cumulus Media Networks announced that they had made a deal and the program, after several weeks off the air, would be returning as of October 23, 2012. By April 2013, according to the radio industry's Talkers Magazine, Savage had 3.5+ million weekly listeners, putting him in a six-way tie for sixth place, and six talk show hosts getting 7.5+ million weekly listeners. On September 26, 2013 Cumulus Media Networks announced that Michael Savage's radio show, The Savage Nation, would move to the 3p-6p ET time-slot beginning in January 2014. This time slot had been occupied by Sean Hannity.\n\nIn January 2015, it was announced that Savage and Westwood One had reached agreement on a long-term contract renewal for The Savage Nation.\n\nMSNBC television show\n\nSavage was hired by MSNBC president Erik Sorenson to do a one-hour show beginning March 8, 2003, despite Savage's previous criticism of the network in his book The Savage Nation and the objections of NBC employees including news anchor Tom Brokaw, who asked NBC executives, \"Is this the sort of man who embodies the values of NBC?\" Sorenson, at the time, called Savage \"brash, passionate and smart,\" and promised that he would provide \"compelling opinion and analysis with an edge.\"\n\nFour months later, on July 7, Savage was fired from his MSNBC television show after remarks made in response to a caller, later identified as prank caller Bob Foster, who insulted Savage's teeth. Savage then asked if Foster was a \"sodomite\", to which the caller answered, \"Yes, I am.\" Savage then said to the caller,\n\nOh, so you're one of those sodomites. You should only get AIDS and die, you pig; how's that? Why don't you see if you can sue me, you pig? You got nothing better to do than to put me down, you piece of garbage? You got nothing to do today? Go eat a sausage, and choke on it. Get trichinosis. Now do we have another nice caller here who's busy because he didn't have a nice night in the bathhouse who's angry at me today? Put another, put another sodomite on ... no more calls? ... I don't care about these bums; they mean nothing to me. They're all sausages.\n\nThe day after being fired, Savage apologized on his radio program and on his website. He explained that he believed that MSNBC had gone to commercial to cover the gaffe of the attempted sabotage by a prank caller and that he was off the air at the time of the offensive comments, despite the fact that clips of the segment show Savage going to commercial after he made the comments. He also said his remarks were meant only to insult the caller, not all people with AIDS.\n\nPolitical views\n\nMichael Savage calls himself an \"independent-minded individualist\" and says that he \"fits no stereotype.\" He has also cited Barry Goldwater as an influence. Savage criticizes big government as well as liberalism and liberal activism, and accuses the mainstream news media of liberal bias. He considers the three aspects that define a nation as borders, language, and culture; those aspects inspired the motto of the Paul Revere Society.\n\nIn 2003, Savage said that he voted in 2000 for George W. Bush \"quite reluctantly, incidentally.\" In 2004, Savage and the Revere Society hosted a party at Schroeder's Cafe in San Francisco celebrating the re-election of Bush. Savage donated $5,600 to the campaign of Democratic candidate Jerry Brown in the 2006 California Attorney General election.\n\nRegarding candidates for the 2012 Republican primaries, Savage said that Ron Paul had \"great ideas\" but expressed hope that Rick Perry would be the nominee. On December 12, 2011, he offered Newt Gingrich \"1 million dollars\" to withdraw from the United States Presidential contest. He stated that only Mitt Romney had a chance to beat Barack Obama, a man he had previously described as a \"quasi-pseudo-crypto Marxist\" and a possible foreign usurper, in the 2012 election.\n\nSavage strongly supported Donald Trump, a regular guest on his talk show, since Trump's June 2015 announcement of his candidacy in the United States 2016 presidential election. Trump has claimed to be a listener and a fan of Savage's show, and an April 2016 Salon article described Savage as having been a major influence on Trump's campaign.\n\nActivism\n\nLegal defense contributions\n\nSavage has regularly donated money toward the legal defense of the Marines accused of murdering civilians in Haditha, Iraq; occasionally, Savage will offer proceeds from any sales through his website. Savage had regular contact with the attorneys of the accused and criticizes their treatment at Camp Pendleton. Most recently, Savage has donated over $10,000 to the U.S. Marines Charity Defense Fund at the Thomas More Law Center On April 25, 2007, he pledged $1 for each copy of Healing Children Naturally and Reducing the Risk of Alzheimer's purchased from his website to be donated to the U.S. Marines Defense Fund. The Marines were ultimately found not guilty.\n\nIn November 2014, Dr. Savage helped reunite a wounded soldier with his K-9 partner as well as donating money to purchase an SUV.\n\nLieutenant Michael Behenna\n\nOn his nationally syndicated talk radio program, Michael Savage announced that he had sent another $50,000 to aid in the defense of First Lieutenant Michael Behenna, who has been sentenced to 15 years in prison for murdering alleged terrorist Ali Mansur Mohammed while serving in Iraq with the 101st Airborne Division in 2008. Savage has previously given $50,000 to Behenna's defense from the Savage Legal Defense Fund and his own personal contributions. According to Vicki Behenna, the lieutenant's mother, additional contributions from listeners since Savage brought up this topic on his program have amounted to over $40,000. This brings the total contributions from Savage and his listeners to nearly $150,000.\n\nMichael Savage Scholarship\n\nIn July 2015, Savage announced the five winners of his essay contest based on the question \"What Does It Mean to Be an American?\" The college students will each receive a $20,000 scholarship over a two-year period. The winners, announced on The Savage Nation radio show, were selected from approximately 1,700 entries. Savage launched the $100,000 scholarship fund in early 2015 with the intention of promoting traditional American values among conservative college students.\n\nAwards and criticism\n\nAwards\n\nOn June 9, 2007, Talkers Magazine awarded Savage with the publication's annual \"Freedom of Speech Award,\" and he accepted it with a pre-recorded speech.\n\nNational Radio Hall of Fame\n\nIn 2016 Michael Savage was named as an inductee to the National Radio Hall of Fame in the category of Spoken Word On-Air Personality. He was selected over other nominees Sean Hannity, Diane Rehm and Mike Francesa. [1]\n\nCriticism\n\nIn July 2005, former CBS reporter Bernard Goldberg ranked Savage as number 61 in his book 100 People Who Are Screwing Up America. Goldberg wrote that \"Savage's brand of over-the-top bile ... puts him right in there with the angriest haters of the Left.\" David Klinghoffer, a National Review columnist, speculated that The Savage Nation \"is an act, a put-on.\" Various progressive advocacy groups such as GLAAD and FAIR accuse Savage of racism, homophobia, transphobia, and Islamophobia because of his controversial statements about homosexuality, Islam, feminism, sex education, and immigration.\n\nOn April 17, 2006, he said on the topic of Muslims, \"They say, 'Oh, there's a billion of them.' I said, 'So, kill 100 million of them, then there'll be 900 million of them.' I mean, would you rather die—would you rather us die than them?\" This was taken from an argument dealing with the possibility of a nuclear conflict in that region. This was repeated in the media after Savage was barred from entering the UK.\n\nIn the wake of the actor Robin Williams' suicide, Savage said that suicide is an \"aggressive act\" that shows no consideration for loved ones left behind. The assertion prompted criticism, but a caller to The Savage Nation said the radio host's frank talk about the subject helped him decide to not take his own life. A caller who identified himself as Joe told Savage he had been contemplating suicide for the past several months, and especially in the most recent week previous to the call. After Savage discovered that Joe was suffering financially, he asked his audience to join in helping Joe get through the rest of the month by donating through the Savage Legal Defense Fund. The Fund raised over $10,000 in just a few days. Another caller from Detroit had given Savage a jolt by referring to his days as a phone line crisis counselor as being predominantly dealing with suicide calls. The advice that the Detroit caller had given - \"you are taking a permanent solution for a temporary problem\" encouraged Savage to reach out to the suicidal caller he had.\n\nCatholic Church and Immigration\n\nIn March 2006, Savage criticised Roman Catholic assistance to illegal immigrants (in response to statements by Cardinal Roger Mahony of Los Angeles calling it \"pastoral support\"). Bill Donohue of the Catholic League canceled an appearance on the show, saying \"what is not fine is Savage's diatribe about the 'greedy pigs' in the Catholic Church and how 'the institution is rotten from the top to the bottom.' He owes all Catholics an apology.\"\n\nOn March 28, 2006, Savage encouraged his listeners to burn Mexican flags to counter pro-immigration rallies in California\n\nC-SPAN broadcast of Talkers Award\n\nWhen Talkers Magazine awarded Savage with the publication's annual \"Freedom of Speech Award,\" C-SPAN opted not to broadcast a pre-recorded speech that had been sent by Michael Savage. Although the award ceremony had received coverage in previous years, C-SPAN did not televise it due to its policy of televising such speeches only when delivered in person. Savage stated that C-SPAN's decision was \"censorship\" and he told his listeners to express their ire to C-SPAN through calls and e-mails to the organization.\n\nDispute with CAIR\n\nIn early November 2007, the Council on American-Islamic Relations (CAIR) called on radio listeners to contact companies that advertise on Savage's program to express their concerns about his comments concerning Muslims. Savage was quoted as saying Muslims \"need deportation\", and that adherents of Islam would do well to \"take your religion and shove it up your behind\" because \"I'm sick of you.\" On his show and website, Savage answered by accusing CAIR of supporting Hamas.\n\nOn November 8, 2007, following a campaign by CAIR meant to get Savage off the air by alerting his sponsors to the nature of his comments, Citrix Systems, Inc. pulled its advertisements from his show.\n\nSavage sued CAIR for copyright infringement for using excerpts from his show on CAIR's website. The suit alleged that CAIR's repackaging of Savage's comments was \"deliberately designed to obscure the specific message conveyed by Michael Savage\". The excerpts included Savage's characterization of the Qur'an as \"a throwback document\" and a \"book of hate\". CAIR called the suit \"bizarre, sloppy and baseless\". On July 25, 2008, the United States district court dismissed Savage's suit against CAIR, holding that the posting of the audio clip was protected under the First Amendment doctrine of fair use, as it was used to \"comment on and rebut derogatory statements regarding their organization and their religious affiliations.\" The court gave Savage the opportunity to file an amended complaint if he wanted to try to cure the defects in his suit. That amended complaint alleged that CAIR was a RICO conspirator in support of terror, including the 9/11 terror attack on the World Trade Center. Permission was granted to allow that filing but on August 14, 2008, however, Savage's lawyer, Daniel Horowitz, announced that Savage would not file an amended complaint and would drop the case. CAIR then sought attorneys fees against Savage but U.S. District Court judge Susan Illston denied that request.\n\nAutism\n\nIn July 2008, Savage said that the increasing rate of autism diagnoses was the result of \"a racket\" designed to get disability payments for \"poorer families who have found a new way to be parasites on the government.\" He returned to the subject on his July 16, 2008, show with the following remarks:\n\nNow, the illness du jour is autism. You know what autism is? I'll tell you what autism is. In 99 percent of the cases, it's a brat who hasn't been told to cut the act out. That's what autism is. What do you mean they scream and they're silent? They don't have a father around to tell them, \"Don't act like a moron. You'll get nowhere in life. Stop acting like a putz. Straighten up. Act like a man. Don't sit there crying and screaming, idiot.\"\n\nIn July 2008 the progressive pressure group Media Matters for America picketed the studios of WOR in New York, along with parents of autistic children. WOR issued a statement saying, \"We regret any consternation that his remarks may have caused to our listeners.\" Also that day, the insurance company Aflac pulled its advertising, and the Supertalk Mississippi radio network dropped Savage's program, replacing it with The Dennis Miller Show. Later that evening, Savage devoted his entire three-hour program to the subject, taking calls from parents who took issue with his comments. On that show Savage stated that his remarks had been \"ripped out of context\" by \"far left Stalinists\" who want him off of the air. He appeared on Larry King Live with Glenn Beck as the substitute host for Larry King, and said that the real issue he was commenting on was the overdiagnosis of children due to pharmaceutical companies' drive to drug children for higher profits. On July 25, 2008, Autism United advocates gathered to announce that several advertisers, including RadioShack, Sears, Home Depot, and DirectBuy, will discontinue their support for Savage's show.\n\nSavage's syndicator, Talk Radio Network, has responded by releasing a lengthy statement, along with a selection of 20 audio clips drawn from Savage's discussions of autism, to show that the comments were taken out of context.\n\nBanned from entering the United Kingdom\n\nOn May 5, 2009, it was announced by then-Home Secretary Jacqui Smith that Savage was on a list of individuals banned from entering the United Kingdom as he is \"considered to be engaging in unacceptable behaviour by seeking to provoke others to serious criminal acts and fostering hatred which might lead to inter-community violence\". During his radio broadcast on that same day, Savage declared that he would sue Smith personally for defamation, calling her a \"lunatic\".\n\nDuring a subsequent NPR talk show, Savage said that he has never advocated violence and repeatedly invoked the United States Constitution's First Amendment. After host Neal Conan pointed out that the U.S. Constitution does not apply to the United Kingdom, Savage replied, \"No. Thank God I'm an American. But for this lunatic ... to link me up with Nazi skinheads who are killing people in Russia ... to put me in league with Hamas murderers who killed Jews on buses, is astonishing\". Savage also called on his listeners to support him by canceling travel and business in Britain as well as by boycotting British-made goods, commenting, \"If they want to play hardball, we'll play hardball.\" When a caller challenged Savage about his talk show rhetoric, Savage called him a \"foaming lunatic ... someone in pajamas in a mental asylum ... You're nobody and I'm not going to talk to you!\" At that point, Neal Conan invited him to leave.\n\nOf the banning, the Mayor of London, Boris Johnson, wrote: \"America still has a constitutional protection of free speech, and I have been amazed ... to see how few people in this country are willing to stick up for that elementary principle ... a country once famous for free speech is now hysterically and expensively sensitive to anything that could be taken as a slight.\" In The Guardian, Catherine Bennett wrote: \"The ban on Savage is so far from being a comprehensible act, so staggeringly capricious and stupid, as to defy evaluation.\" While Sam Leith wrote: \"Barring this shock-jock from Britain risks turning a rabid blabbermouth into a beacon for free speech.\"\n\nOn July 12, 2010, the new Coalition government, of which the Conservative Party's David Cameron was Prime Minister, announced that it will continue to ban Savage from entering the UK.\n\nVeteran PTSD\n\nOn October 14, 2014, Savage criticized veteran sufferers of post traumatic stress disorder, accusing them of \"weakness\". According to Savage, \"Everyone has depression in their life. But if the whole nation is told, 'boo-hoo-hoo, come and get a medication, come and get treatment, talk about mental illness.' You know what you wind up with? You wind up with Obama in the White House and liars in every phase of the government. That's what you wind up with. It's a weak, sick, nation. A weak, sick, broken nation. And you need men like me to save the country. You need men to stand up and say stop crying like a baby over everything ... No wonder we're being laughed at around the world. No wonder ISIS can defeat our military.\"\n\nPersonal life\n\nWhile in the South Pacific, he became fascinated with the 19th-century sailor Charles Savage, who was believed to have been the first man to bring firearms to Fiji. That fascination led to Weiner's name change to Savage.\n\nSavage and his second wife Janet have two children, a daughter and a son; his son, Russell Weiner, is the founder of the company that produces the Rockstar energy drink. Russell's mother, Janet, served as CFO of his company until July 2009. Daughter Rebecca Lin Yops has worked as an elementary school teacher. In 1974, Savage and his family moved to Fairfax, California after Savage completed his master's degree at the University of Hawaii. Savage has homes in Larkspur and Tiburon in Marin County, California, an apartment in San Francisco, as well as residences in Beverly Hills and West Palm Beach, Florida.\n\nDuring the 1980s, Savage attended Friday night services at a Chabad house in Berkeley. In a 2003 interview on The O'Reilly Factor, Savage has said that although he believes in God, he attends houses of worship only once or twice a year. In his 2012 book Trickle Down Tyranny, Savage wrote: \"... I'm not religious. Do I believe in God? Sometimes I do, sometimes I don't.\"\n\nLiterary works\n\nIn total, Savage has written 36 works, twenty-one under his real name of Michael Weiner, and fifteen under his pseudonym of Michael Savage. As Michael Savage, his works include a #1 New York Times bestseller and three additional books which made the New York Times bestseller list. Two of his books as Michael Weiner, Reducing the Risk of Alzheimer's and Healing Children Naturally have also been reprinted under his alias of Michael Savage.\n\nHis earlier books as Michael A. Weiner, Ph.D., are focused around his doctoral expertise in the field of nutritional ethnomedicine. In them, he advocates nutritional, herbal, and homeopathic options to approach the prevention and treatment of diseases such as poor diet, aging, arthritis, Alzheimer's disease, cancer, allergies, cocaine addiction, the common cold, and AIDS. He has also written about tree planting, beer-tasting, and nutritional cooking.\n\nHis more recent books as Michael Savage are political in nature and published by a variety of different companies. His recent works also include holiday family stories and thrillers.\n\nIn 1991, Savage self-published The Death of the White Male, an argument against affirmative action, through Quantum Books. In the book, Savage, calls affirmative action \"reverse discrimination\", and demonstrates his emerging philosophy. This eventually led to his starting the Paul Revere Society and he continues to sell the book to raise money for this group.\n\nIn January 2003, Savage published The Savage Nation: Saving America from the Liberal Assault on Our Borders, Language and Culture, his first major book under the pseudonym Michael Savage. The book quickly reached the top of the New York Times Best Seller list, earning Savage, as noted above, a commentary show on MSNBC. The book directs attacks at \"liberal media bias\", the \"dominating culture of 'she-ocracy'\", gay activists, and liberals.\n\nIn January 2004, Savage published his second political book The Enemy Within: Saving America from the Liberal Assault on Our Schools, Faith, and Military. His next book, Liberalism Is a Mental Disorder, was released on April 12, 2005. Unlike The Savage Nation, both of these books cited sources for some of the more controversial claims made.\n\nIn April 2006, Savage released The Political Zoo. The book contains satirical profiles and cartoons of different public figures, most of whom are liberal political figures and celebrities, who are depicted in caricature as animals in the \"Political Zoo\", with Savage himself portrayed as the zoo keeper.\n\nIn October 2010, Savage released Trickle Up Poverty: Stopping Obama's Attack on Our Borders, Economy, and Security. Released through the HarperCollins imprint of William Morrow and Company, Savage argues in the book that \"Americans are boiling mad over the way Congress and this Marxist/Leninist-oriented President are manipulating the current economic crisis to nationalize businesses.\"\n\nIn November 2010, it was confirmed that Savage had signed a deal to write two thrillers for publisher St. Martin's Press. The first political thriller, Abuse of Power, was released on September 13, 2011. The novel is based on \"My fictionalized account of being banned from Britain and hunted by overbearing governments is set in the San Francisco only I know\", said Savage. It is set in San Francisco, mainly in North Beach, as well as London, and Tel Aviv. It tells the story of a failed carjacking that reveals a government cover-up. A dark plot involving British officials and a terrorist group known as \"the Hand of Allah\". The publisher has described the novel by saying, \"will make 9/11 look like child's play\".\n\nIn October 2014, Savage released Stop the Coming Civil War, in which he comments \"[The United States] is in real trouble and the seeds of a second conflagration have been sown. Not between the states - but between true patriots who believe in our nation's founding principles and those he believes are working every day to undermine them and change the very nature of the country.\" It was listed on the NY Times Bestseller List for six weeks.\n\nSavage's latest political book is entitled Government Zero - a critique of the Obama Administration's foreign and domestic policies including Hillary Clinton's tenure as Secretary of State."}, {"url": "https://www.nytimes.com/2020/04/16/us/politics/michael-savage-trump-coronavirus.html", "page_content": "Much of the time, Mr. Savage still sounds like any other right-wing shock jock — making fun of Nancy Pelosi and doubting the validity of the #MeToo movement. But on the subject of the coronavirus, Mr. Savage has become one of the loudest voices of dissent on the right.\n\nHis views are a striking departure from the accepted version of events among Mr. Trump’s loyalists in the media, who have made a concerted effort to deny that they downplayed the epidemic. Mr. Savage has attacked the credibility of the conservative media, accused its biggest stars of being too rote and unthinking in their defense of the president, and demanded that they be held accountable for misleading millions of Americans.\n\n“We’re living in a terrible time in America where truth has died,” Mr. Savage, who was one of the first conservative media stars to urge Mr. Trump to run for president, told his audience. “This is crazy,” he added, pointing to the way the president’s defenders always accuse the left of spreading “fake news.”\n\n“How can we not let our side be called on the carpet when they lie to the people?”\n\nThat was Feb. 24.\n\nAt the time, coronavirus outbreaks were largely limited to a handful of countries like China, South Korea and Italy. Only a few dozen cases had been reported in the United States. The same day, Rush Limbaugh likened the coronavirus to the common cold on his radio program. But it spread aggressively in America just as Mr. Savage had warned it would — a prediction that earned him the ire of people who called him a hysteric and a sellout.\n\nHis contempt for hosts like Mr. Limbaugh and Sean Hannity, whose top-rated radio shows draw more than 30 million listeners each week, is especially searing. He mocks them as “Dr. Hannity” and “Rush Limbaugh, M.D., Ph.D.,” belittles their lack of education compared with his, and berates people who took their claims seriously."}, {"url": "https://books.google.com/books/about/The_Political_Zoo.html?id=fZ4iAAAACAAJ", "page_content": "Ladies and gentlemen, welcome to the real national zoo!\n\nAs Aristotle said, \"Man is a political animal.\" Talk radio sensation and New York Times best-selling author Michael Savage is afraid that the ancient philosopher was all too right, and in ways he never could have imagined. In Savage's funniest, most biting book yet, the nation's fiercest independent thinker invites you to take a riotous tour through The Political Zoo--an outrageous look at today's most prominent politicos and pundits as the reptiles, rats, and birds of prey they most resemble.\n\nAnimal by animal and cage by cage, Savage brandishes his irreverent wit to keep these beasts in check. Serving as resident biologist and zookeeper, Dr. Savage asks that you watch your step when approaching the widemouth copperhead Ted Turner (also known as Mouthus desouthus), do not feed the ego of stuffed turkey Alec Baldwin (Notalentus anti-americanus), and please keep your children with you at all times around wolf boy Bill Clinton (Fondlem undgropeum).\n\n\"The world of politics is filled with uncivilized, snarling, rapacious beasts that, like untrained mutts, raise their legs and urinate on everything we hold dear,\" says Savage. And this sensational book is your guide for navigating the jungle of today's animal-political kingdom.\n\n"}], "Michael Alan Weiner is born in March 31, 1942.": [{"url": "https://www.calendarz.com/on-this-day/march/31/michael-savage", "page_content": "Birth\n\nMar, 31\n\nMichael Savage\n\nMichael Savage, American radio host and author\n\nMichael Alan Weiner (born March 31, 1942), known by his professional name Michael Savage, is an American conservative author, conspiracy theorist, political commentator, activist, and former radio host. Savage is best known as the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2021, and in 2009 was the second most listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States. From October 23, 2012 to January 1, 2021, Michael Savage had been syndicated by Cumulus Media and Westwood One. He holds master's degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine. As Michael Weiner, he has written books on nutrition, herbal medicine, and homeopathy; as Michael Savage, he has written several political books that have reached The New York Times Best Seller list.\n\n\n\nSavage has summarized his political philosophy in three words: borders, language, and culture. He has characterized his views as conservative nationalism, while critics have characterized them as \"fostering extremism.\" He supports the English-only movement and argues that liberalism and progressivism are degrading American culture. Although his radio delivery is mainly characterized as politically themed, he also often covers topics such as medicine, nutrition, music, literature, history, theology, philosophy, sports, business, economics, and culture, and tells personal anecdotes.\n\n\n\nIn 2009, Savage was placed on a list of people permanently banned from entering the United Kingdom by British Home Secretary for \"seeking to provoke others to serious criminal acts and fostering hatred.\""}, {"url": "https://www.celebsagewiki.com/michael-savage", "page_content": "Age, Biography and Wiki\n\nMichael Savage (Michael Alan Weiner) was born on 31 March, 1942 in Bronx, New York, USA, is an Actor. Discover Michael Savage's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 79 years old?\n\nPopular As Michael Alan Weiner Occupation actor Age 81 years old Zodiac Sign Aries Born 31 March 1942 Birthday 31 March Birthplace Bronx, New York, USA Nationality USA\n\nWe recommend you to check the complete list of Famous People born on 31 March. He is a member of famous Actor with the age 81 years old group.\n\nMichael Savage Height, Weight & Measurements\n\nAt 81 years old, Michael Savage height is 5' 7\" (1.7 m) .\n\nPhysical Status Height 5' 7\" (1.7 m) Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Michael Savage's Wife?\n\nHis wife is Janet Weiner (1967 - present) ( 2 children), Carol Ely (1964 - 1967) ( divorced)\n\nFamily Parents Not Available Wife Janet Weiner (1967 - present) ( 2 children), Carol Ely (1964 - 1967) ( divorced) Sibling Not Available Children Not Available\n\nMichael Savage Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Michael Savage worth at the age of 81 years old? Michael Savage’s income source is mostly from being a successful Actor. He is from USA. We have estimated Michael Savage's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nMichael Savage Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.celebritynetworth.com/richest-politicians/republicans/michael-savage-net-worth/", "page_content": "Info Category: Richest Politicians › Republicans Net Worth: $80 Million Salary: $10 Million Date of Birth: Mar 31, 1942 (81 years old) Place of Birth: The Bronx Gender: Male Height: 5 ft 8 in (1.73 m) Profession: Writer, Author, Commentator, Radio personality Nationality: United States of America 💰 Compare Michael Savage's Net Worth\n\nWhat is Michael Savage's net worth and salary?\n\nMichael Savage is an American radio host, author, and political commentator who has a net worth of $80 million. Michael Savage is most widely recognized for his radio show, \"Savage Nation\", and the related series of books he has released promoting \"conservative nationalism\".\n\nEarly Life\n\nSavage was born Michael Alan Weiner in The Bronx, New York on March 31, 1942. He is one of three children of Benjamin and Rae Weiner, Jewish emigrants from Russia. Savage has described his childhood as difficult with a \"gruff, profane\" father who would often criticize him. His younger brother Jerome was born unable to hear or speak and died in 1969. His father died of a heart attack at age 57 in 1970.\n\nHe graduated from Jamaica High School in 1958 and attended Queens College, earning a bachelor's degree in biology in 1963. After earning his B.S., he taught high school for several years in New York City. During this time, he worked for famous psychedelic drug advocate Timothy Leary as a keeper of the stone gatehouse on the Hitchcock Cattle Company estate, to which Leary had been given access. He hired him to the post specifically because Savage did not use LSD. Savage holds a Ph. D. from the University of California, Berkeley in nutritional ethnomedicine and master's degrees in medical botany and medical anthropology from the University of Hawaii.\n\nRadio Career\n\nIn 1994, Savage's manuscript about illegal immigration was rejected by publishers. This prompted him to record a demo tape with a mock radio talk host about the contents of his work. He mailed the tape to 250 radio stations across the country in an attempt to change the course of his career and become a radio talk show host. In March 1994, Savage began his radio career on San Francisco's KGO as a fill-in host for liberal Ray Taliaferro's overnight show. At the time, Savage's slogan was \"To the right of Rush and to the left of God.\" The show quickly became a local hit.\n\nLater that year, KGO's parent company purchased the station and changed it to a conservative talk format. On January 2, 1995, Savage debuted as host of afternoon drive time show The Savage Nation. In 1999, Talk Radio Network began syndicating the show nationally. In September 2000, The Savage Nation became an entirely national show. By mid-2006, Savage had 8-10 million listeners per week, making his show the third most widely heard broadcast in the country at that time. By 2009, the show was being played on 400 stations across the United States, making it the second most listened to radio talk show in the nation.\n\nIn September 2009, Savage's home market of San Francisco announced it was dropping his program and replacing him with John and Ken from sister station KFI-AM in Los Angeles. John Scott, program director of KNEW said in an email that the station was headed \"… in a different philosophical and ideological direction, featuring more contemporary content and more local information.\" However, Savage filed a lawsuit in an attempt to break from his contract and won the lawsuit the morning of September 27, 2012, which led to the immediate cancellation of the show and forcing Talk Radio Network to hire a replacement in short order. Savage also won the rights to his entire archive but was required to agree to a four-week non compete clause, which prevented Savage Nation from being picked up by another network in that time frame.\n\nThe show was revived on Cumulus Media Networks on October 23, 2012. It aired a new time slot, 9:00 P.M. to Midnight ET. The following year, Savage changed back to afternoon drive hours, replacing Sean Hannity for Cumulus Media Networks, thus inciting a feud between the two talk show hosts. In 2016, Savage was widely credited with helping Donald Trump become the President of the United States. He is known as \"The Godfather of Trumpmania.\"\n\nIn January 2019, Savage Nation was cut to two hours, only one of which is carried on terrestrial radio, with the second hour exclusively carried as a podcast. In September 2020, Savage announced that he would Westwood One would be withdrawing the radio show from syndication at the end of the year, leaving only the podcast, and that Savage was under a gag order as to why the change was being made\n\nAt the peak of \"Savage Nation\", his show had an audience of nearly 10 million per day and was broadcast on 400 radio stations in the United States. Michael Savage has written 40 books including two #1 New York Times bestsellers. In March of 2017, Savage released what he professed would be his last book in the political sphere: Trump's War: His Battle For America.\n\nPolitical Views\n\nHe characterizes his views as conservative nationalism and has said he can describe his political philosophy in three words: borders, language, and culture. He supports the English-only movement, opposes illegal immigration to the U.S., and says that progressivism and liberalism are degrading our American culture.\n\nControversies\n\nIn 2009 Savage was banned from entering the United Kingdom. In 2014, Savage aroused even further controversy by setting his sights on sufferers of post-traumatic stress disorder, calling sufferers of that condition \"weak\" and drawing parallels between their plight and the Obama administration. As of 2020, Savage vehemently opposes wearing masks in public to slow the spread of COVID-19 in both indoor and outdoor settings. According to the Southern Poverty Law Center, Savage subscribes to the white genocide conspiracy theory, a white national belief. Throughout his career, he has often been under fire from LGBT groups for various insulting statements.\n\nPersonal Life\n\nHis first marriage in 1964 to Carol Ely ended in divorce, and he remarried in 1967 after meeting his current wife, Janet. He and Janet have two children, a daughter and a son. Interestingly. Michael's son Russ Weiner is the billionaire founder of Rockstar Energy Drink. Michael's ex-wife Janet Russ' earliest investor and served as the company's CFO. When Pepsi acquired Rockstar for $3.85 billion in March 2020, Russ was left with a net worth of $4 billion while Janet was left with a net worth of at least $200 million.\n\nReal Estate: Michael owns several mansions around the country. In the Bay Area he owns at least three properties, two in Marin County and a condo in San Francisco. He also owns a home in Palm Beach, Florida and Beverly Hills, California."}, {"url": "https://www.celebsfacts.com/michael-savage/", "page_content": "Michael Savage is a conservative radio host and commentator, best known as the host of The Savage Nation, a nationally syndicated talk show. As an author, he has written several books on herbal medicine. Born Michael Alan Weiner on March 31, 1942 in Bronx, New York, to parents Benjamin and Rae Weiner, he is of Russian-Jewish heritage. He graduated from Jamaica High School in 1958. He earned his master’s degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. in nutrition ethnomedicine from U.C. Berkeley. In 1967, he married Janet Weiner with whom he has two children: son Russell, and daughter Rebecca. He was previously married to Carol Ely from 1964 to 1967.\n\nMichael Savage Personal Details:\n\nDate Of Birth: 31 March 1942\n\nBirth Place: Bronx, New York, USA\n\nBirth Name: Michael Alan Weiner\n\nNickname: Dr. Savage\n\nZodiac Sign: Aries\n\nOccupation: Radio talk show host, Author, Political and social commentator\n\nNationality: American\n\nRace/Ethnicity: White (Russian-Jewish)\n\nReligion: Unknown\n\nHair Color: Light Brown\n\nEye Color: Dark Brown\n\nSexual Orientation: Straight\n\nMichael Savage Body Statistics:\n\nWeight in Pounds: N/A\n\nWeight in Kilogram: N/A\n\nHeight in Feet: 5′ 3¾”\n\nHeight in Meters: 1.62 m\n\nShoe Size: N/A\n\nMichael Savage Family Details:\n\nFather: Benjamin Weiner (Died: 1970)\n\nMother: Rae Weiner (Died: 2003)\n\nSpouse/Wife: Janet Weiner (m. 1967), Carol Ely (m. 1964–1967)\n\nChildren: Russell Weiner (Son), Rebecca Lin Weiner Yops (Daughter)\n\nSiblings: Sheila Weiner-Rozzo (Sister), Jerome Weiner (Brother)\n\nMichael Savage Education:\n\nJamaica High School (1958)\n\nQueens College\n\nUniversity of California\n\nBerkeley, University of Hawai’i at Mānoa\n\nMichael Savage Facts:\n\n*He was born in Bronx, New York, USA on March 31, 1942.\n\n*His father, Benjamin Weiner, who ran an antiques store, died of a heart attack in 1970 at age 57.\n\n*He is a 1958 graduate of Jamaica High School.\n\n*Former political leftist.\n\n*He was ranked #61 in Bernard Goldberg’s “100 People Who Are Screwing Up America”.\n\n*Playboy published Savage’s interview in their April 2010 edition.\n\n*He was friends with Allen Ginsberg.\n\n*He is close friends with Jerry Doyle.\n\n*He loves Chinese food and fish tacos.\n\n*His son Russell Weiner is the founder and CEO of the company that created the Rock Star energy drink.\n\n*Visit Savage’s official website: www.michaelsavage.com\n\n*Follow Savage on Twitter and Facebook.\n\nShare this: Twitter\n\nFacebook\n\nLinkedIn\n\nTumblr\n\nTelegram\n\nWhatsApp\n\n"}, {"url": "https://books.google.com/books/about/Liberalism_is_a_Mental_Disorder.html?id=HD2XDAEACAAJ", "page_content": "Dr. Savage, sage prophet of the airwaves, has been diagnosing liberal mental illness for more than a decade. Now, in his third and most insightful book, he strikes at the root of today's most desperate issues, providing a hefty dose of his unique conservative medicine, including:\n\nHomeland security: \"We need more Patton and less patent leather. . .Real homeland security begins when we arrest, interrogate, jail, or deport known operatives within our own borders. . .One dirty bomb can ruin your whole day.\" The ACLU, National Lawyers Guild, and MoveOn.org: \"I believe it's time for the heads of . . . left-wing agitation groups who are using the courts to impose their will on the sheeple to be prosecuted under the federal RICO statutes.\" Illegal immigration: \"I envision an Oil for Illegals program. . .The president should demand one barrel of oil from Mexico for every illegal alien that sneaks into our country.\"\n\nThe Doctor is in and the diagnosis is clear. Read \"Liberalism is a Mental Disorder\" and find out what you can do to treat it."}, {"url": "https://deadorkicking.com/michael-savage-dead-or-alive-2/", "page_content": "How Old Is Michael Savage? Michael Savage Birthday\n\nMichael Savage was born on March 31, 1942 and is 81 years old now.\n\nBirthday: March 31, 1942\n\nHow Old - Age: 81\n\nMichael Savage Death Fact Check\n\nMichael is alive and kicking and is currently 81 years old.\n\nPlease ignore rumors and hoaxes.\n\nIf you have any unfortunate news that this page should be update with, please let us know using this form .\n\nMichael Savage - Biography\n\nMichael Alan Weiner (born March 31, 1942), better known by his professional name Michael Savage, is an American radio host, author, activist, nutritionist, and political commentator. He is the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2012, and in 2009 was the second most listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States. Since October 23, 2012, Michael Savage has been syndicated by Cumulus Media Networks. He holds master's degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine. As Michael Weiner, he has written books on nutrition, herbal medicine, and homeopathy; as Michael Savage, he has written four political books that have reached The New York Times Best Seller List."}, {"url": "https://www.wealthypersons.com/michael-savage-net-worth-2020-2021/", "page_content": "Celebrated Name: Michael Savage Real Name/Full Name: Michael Alan Weiner Gender: Male Age: 81 years old Birth Date: 31 March 1942 Birth Place: The Bronx, New York, United States Nationality: American Height: 1.62 m Weight: 85 kg Sexual Orientation: Straight Marital Status: Married Wife/Spouse (Name): Janet Weiner (m. 1967), Carol Ely (m. 1964–1967) Children: Yes (Russell Weiner, Rebecca Lin Weiner Yops) Dating/Girlfriend\n\n(Name): N/A Profession: Radio host, author, activist, nutritionist, conservative political commentator, and conspiracy theorist Net Worth in 2023: $60 million Last Updated: June 2023\n\nMichael Savage is the professional name of Michael Alan Weiner, who is an American author, nutritionist, activist, and radio host. He has a role as a commentator who deals with conservative politics. He is famous for being the host of nationally syndicated talk on Talk Radio Network.\n\nMaybe you know about Michael Savage very well But do you know how old and tall is he, and what is his net worth in 2023? If you do not know, We have prepared this article about details of Michael Savage’s short biography-wiki, career, professional life, personal life, today’s net worth, age, height, weight, and more facts. Well, if you’re ready, let’s start.\n\nEarly Life\n\nMichael Alan Weiner was born in 1942, 31st March. He was born in The Bronx, Newyork. His father was Benjamin Weiner, while his mother was Rae Weiner. His parents were Jewish, whose home of origin was Russia and had traveled to settle in America.\n\nAccording to Michael, he had many hardships at an early age. His family was composed of three members exclusive of father and mother to make five. His youngest brother was born with disabilities hence could not speak or hear called Jerome. He passed on in 1969. Michael’s father possessed an antique business, but at the age of fifty-seven years, he received a heart attack that killed him. Allan’s father died in 1970, leaving behind a widow Rae Weiner to continue her life alone. Thirteen years later, she followed his husband to the grave.\n\nMichael attended Jamaica High school and completed his studies there in 1958. From high school, he was enrolled at Queens’ College and studied to receive his bachelor’s degree in biology by 1963. Having received the recommended qualification from his education, Michael got an opportunity of working in several high schools around New York City as a teacher.\n\nIn 1964, Michael got his first wife, who was known as Carol Ely. Their marriage, however, ended. Three years later, Michael decided to remarry and chose Janet, who is today’s wife.\n\nSavage also afterward attended the University of Hawaii. He obtained a Master of Science in botany degree in 1970. Michael continued to study Masters of Arts in Anthropology and graduated in1972 in the same university. He also attended California University, where he earned a Ph.D.\n\nAge, Height, and Weight\n\nBeing born on 31 March 1942, Michael Savage is 81 years old as of today’s date 9th June 2023. His height is 1.62 m tall, and his weight is 85 kg.\n\nCareer\n\nMichael Savage’s career started as a teacher in New York City, high school. He later went to work for Timothy Leary in Millbrook, New York, as a housekeeper. Timothy Leary is a famous advocate of psychedelic drugs\n\nMichael Savage made himself known to some brilliant writers around the North Beach area of San Francisco by the 1980s. He established friendships with poet Allen Ginsberg and Stephen Schwartz from the beat. Lawrence Ferlinghetti was among the poets who traveled together with Michael and even talked through letters and postcards.\n\nMichael could tell these friends about his future career as elaborated by Neeli Cherkovski, who spoke of Michael’s dream of becoming a stand-up comic of Lenny Bruce Nature. Michael Savage began his radio career on KGO, which was a talk radio station and had many programs. Savage joined MSNBC television station for a part-time job.\n\nAwards & Achievements\n\nMichael Savage received Freedom of Speech Award by Talkers Magazine. That was with its annual publications. The ceremony occurred on 9th June 2007. He was also named in the National Radio Hall of fame as an inductee in 2016.\n\nNet Worth & Salary of Michael Savage in 2023\n\nAs of June 2023, Michael Savage has an estimated net worth of around $60 million. He has worked for his wealth through teaching in high schools and also working for Timothy Leary. He has also authored books for sale. He has been employed in radio and television stations to earn some of his wealth.\n\nMichael Savage started a confusing life in her childhood by living with his brother, who was disabled. Savage was left by his parents and even the said brother through death. All these did not stop him from becoming what he is today. He stands tall to criticize the government when oppressing its citizens and has been recognized well in politics."}, {"url": "https://www.celebsinsights.com/dating/michael-savages-wife-list/", "page_content": "Michael Savage\n\nRadio Host\n\nBorn in The Bronx, New York City, USA, Michael Savage is best known for being a radio host. Michael is turning 82 years old in ; he was born on March 31, 1942. He earned a Ph.D. in nutrition ethnomedicine from U.C. Berkeley.\n\nThere are usually many dating news and scandals surrounding exciting celebrities. The most frequently asked questions are, is Michael Savage single or dating, and who is Michael Savage’s wife? We are here to clear up and debunk dating rumors surrounding Michael’s love life and wifes.\n\nEverything you need to know about Michael Savage and a view at Michael Savage’s relationships, dating timeline, affairs, exes, biography, and more. ⤵\n\nReal Name Michael Alan Weiner Date of Birth March 31, 1942 Age 81 Birthplace The Bronx, New York City, USA Dating Status Married Wife Height 5' 4\" (1.63 m) Weight 187 lb (85 kg) Ethnicity White Nationality American Hair Color Salt and Pepper Eye Color N/A\n\nMichael Savage biography\n\nMichael Savage was born on Tuesday, March 31, 1942, in The Bronx, New York City, USA. His given name is Michael Alan Weiner, friends just call his Michael. Currently, He is 81 years old and his 82nd birthday is in . You can learn more interesting insights about this date, as well as your own birthday, at BirthdayDetails.\n\nMichael was born in the Silent Generation, his zodiac animal is a Horse, and his spirit animal is a Hawk. People born in the Year of the Horse are never willing to give up. They are constantly upbeat and enthusiastic, pushing themselves ahead. Their greatest ambition is to be free to do anything they want and to express themselves. They do, however, have a number of unfavorable characteristics. Horses are terrible at maintaining secrets and quickly lose interest.\n\n\n\nPeople born on March 31 have a zodiac sign of Aries. Aries, the first sign in the zodiac, likes being number one. Naturally, this powerful fire sign is not without rivalry. Aries, the bold and ambitious sign, pushes straight into even the most difficult situations—and they always come out on top!\n\nConservative radio host who was syndicated to over 10 million listeners across 400 stations each week. He married Janet Weiner in 1967. His son Russell Weiner founded the company that created the Rock Star energy drink.\n\nThere are many celebrity romances that blossom every year. Let us take a look at Michael’s dating past below.\n\n, Michael Savage’s wife\n\nThe American 81-year-old radio host is married to now, according to our records. Michael Savage remains relatively quiet when it comes to sharing his personal life and makes it a point to stay out of the public eye.\n\nThe details about Michael Savages’s wifes and past relationships vary, so we can never be 100% sure. We use multiple online sources such as DatingRumor.com, and other publicly available data to ensure that our dating info and facts are accurate.\n\nOur goal is to make our dating information precise and updated. This page was updated in June 2023 with new dating information and news. If you have new details about who Michael Savage is dating today, please email us.\n\nWho has Michael Savage dated\n\nMichael Savage had at least 2 relationships. Not everything is known about Michael Savage’s past relationships and partners. While it’s usually simple to find out who is Michael dating, it is harder to keep track of all his hookups, flings, and breakups. Even in 2023, celebrities manage to astonish us with the ways they keep their lives private.\n\nMichael Savage has not been previously engaged. Michael Savage has been in a relationship with Allen Ginsberg (1969). Surveys show that around 40% of men say “I love you” to their partner for the first time within the first month of a relationship, but men wait 90 days on average, and women take an average of 134 days. Michael Savage was previously married to Janet Weiner. He has no children. The information about previous dates and hookups is constantly updated."}, {"url": "https://www.thefamousbirthdays.com/people/michael-savage", "page_content": "About Michael Savage\n\nMichael Savage is the professional alias of Michael Alan Weiner, an American political and social commentator, author, activist and retired radio personality.\n\nHe rose to fame as the host of the nationally syndicated conservative talk radio show “The Savage Nation”, which he started in 1994 and wrapped up in 2012.\n\nWith advanced degrees in botany, nutritional ethnomedicine and medical anthropology, he has also established himself as an author of books on herbal medicine, homeopathy and nutrition.\n\nFamily Life\n\nHis Russian Jewish immigrant parents’ names were Ray and Benjamin Weiner. He had two siblings. He has been married twice: first to Carol Ely (1964-1967) and then to Janet Roll in 1967. He has two children, including businessman and political fundraiser Russell Weiner.\n\nAchievements\n\nHe became a National Radio Hall of Fame inductee in 2016.\n\nTrivia\n\nHis best-known books include “The Savage Nation: Saving America from the Liberal Assault on Our Borders, Language, and Culture”, “The Political Zoo” and “Liberalism is a Mental Disorder”."}, {"url": "https://books.google.com/books/about/The_Political_Zoo.html?id=fZ4iAAAACAAJ", "page_content": "Ladies and gentlemen, welcome to the real national zoo!\n\nAs Aristotle said, \"Man is a political animal.\" Talk radio sensation and New York Times best-selling author Michael Savage is afraid that the ancient philosopher was all too right, and in ways he never could have imagined. In Savage's funniest, most biting book yet, the nation's fiercest independent thinker invites you to take a riotous tour through The Political Zoo--an outrageous look at today's most prominent politicos and pundits as the reptiles, rats, and birds of prey they most resemble.\n\nAnimal by animal and cage by cage, Savage brandishes his irreverent wit to keep these beasts in check. Serving as resident biologist and zookeeper, Dr. Savage asks that you watch your step when approaching the widemouth copperhead Ted Turner (also known as Mouthus desouthus), do not feed the ego of stuffed turkey Alec Baldwin (Notalentus anti-americanus), and please keep your children with you at all times around wolf boy Bill Clinton (Fondlem undgropeum).\n\n\"The world of politics is filled with uncivilized, snarling, rapacious beasts that, like untrained mutts, raise their legs and urinate on everything we hold dear,\" says Savage. And this sensational book is your guide for navigating the jungle of today's animal-political kingdom.\n\n"}]}