{"John Howe is an illustrator and conceptual designer.": [{"url": "https://www.wikiwand.com/en/John_Howe_(illustrator)", "page_content": "John Howe (born August 21, 1957) is a Canadian book illustrator and conceptual designer, best-known for his artwork of J. R. R. Tolkien's Middle-earth.[1] One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\nCanadian illustrator, best known for his artwork of J. R. R. Tolkien's Middle-earth\n\nQuick facts: John Howe, Born, Nationality, Education, Know... ▼\n\nHowe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy. Howe illustrated the Lord of the Rings board game created by Reiner Knizia, and re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work includes images of mythological material such as the Old English epic poem Beowulf (including Knizia's board game Beowulf: The Legend). Howe illustrated many books in the fantasy genre, such as those by Robin Hobb. He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis, The Chronicles of Narnia.[1] In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, with numerous illustrations by Howe.\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.[2]\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson consulted with both Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\nHowe is a member of the living history group the Company of Saynt George, and has expertise in ancient and medieval armour and armaments.\n\nHowe also served as a conceptual designer for Amazon's The Lord of the Rings: The Rings of Power, which premiered on Prime Video on September 2, 2022.[3]"}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Creator/JohnHowe", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Creator/JohnHowe\n\nGo To\n\nJohn Howe (born August 21, 1957) is a Canadian book illustrator and conceptual designer.\n\nIn his youth, he was influenced by the works Frank Frazetta and Brothers Hildebrandt, which helped him discover his own style of artwork. As a teen, he like to read what Tolkien wrote and started to create works based on Tolkien's Legendarium. Howe achieved much of his fame for his Fantasy Art by working as a chief conceptual designer along with Alan Lee for Peter Jackson's The Lord of the Rings. He has expertise in ancient and medieval armour and armaments, which influenced the way he portrays the medieval world in fantasy. Howe is also serving as a conceptual designer for Amazon's The Lord of the Rings: The Rings of Power.\n\nFroud's homepage can be found here .\n\nNotable Projects:"}, {"url": "https://www.arenaillustration.com/artists/john-howe/", "page_content": "John Howe\n\nJohn Howe is a Canadian illustrator, after obtaining an illustration degree in France, he settled in Switzerland. He has travelled extensively in imaginary worlds: Robin Hobb, Robert Holdstock, and especially J. R. R. Tolkien’s Middle Earth, spending the better part of a decade in New Zealand in the company of hobbits, elves and dwarves for Peter Jackson’s trilogies the Lord of the Rings and the Hobbit.\n\nJohn is especially fascinated by history, art and architecture. When he is not roaming through the pages of his extensive library of old volumes of folklore, myth and legend, he is out wandering in the mountains and forests where he lives. This rich tapestry of interwoven threads of history and imagination is an enduring source of inspiration.\n\nHe has an abiding fascination with dragons, and is the narrator of a four-part mini-series produced by Arte Television, which saw John and his film crew follow their tracks through Europe and China. “Dragons!” has been broadcast worldwide.\n\nBesides exploring Middle Earth, John has illustrated many children’s books, created how-to books on fantasy art, and has illustrated Beowulf, Arthurian legend and many other sagas. He teaches drawing one day a week at a local school and has given master classes as far away as Beijing."}, {"url": "https://pantheon.world/profile/person/John_Howe_(illustrator)", "page_content": "John Howe\n\nJohn Howe (born August 21, 1957) is a Canadian book illustrator and conceptual designer, best-known for his artwork of J. R. R. Tolkien's Middle-earth. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town. Howe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of John Howe has received more than 27,871 page views. His biography is available in 19 different languages on Wikipedia . John Howe is the 2,385th most popular religious figure (down from 2,083rd in 2019), the 439th most popular biography from Canada (down from 400th in 2019) and the 6th most popular Canadian Religious Figure."}, {"url": "https://www.wiki3.en-us.nina.az/John_Howe_(illustrator).html", "page_content": "For other people with the same name, see John Howe\n\nJohn Howe (born August 21, 1957) is a Canadian book illustrator and conceptual designer, best-known for his artwork of J. R. R. Tolkien's Middle-earth.[1] One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\nHowe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy. Howe illustrated the Lord of the Rings board game created by Reiner Knizia, and re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work includes images of mythological material such as the Old English epic poem Beowulf (including Knizia's board game Beowulf: The Legend). Howe illustrated many books in the fantasy genre, such as those by Robin Hobb. He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis, The Chronicles of Narnia.[1] In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, with numerous illustrations by Howe.\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.[2]\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson consulted with both Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\nHowe is a member of the living history group the Company of Saynt George, and has expertise in ancient and medieval armour and armaments.\n\nHowe also served as a conceptual designer for Amazon's The Lord of the Rings: The Rings of Power, which premiered on Prime Video on September 2, 2022.[3]"}, {"url": "https://www.news24.com/channel/tv/news/the-rings-of-power-concept-artist-john-howe-its-a-window-on-a-middle-earth-we-havent-seen-20220930-2", "page_content": "INTERVIEW: John Howe, concept artist, The Lord of the Rings: Rings of Power.\n\nThe entire fantasy landscape of Middle-earth during its Second Age – everything you see from buildings and creatures to objects and clothing – was dreamed up and designed on paper first. With over 17 000 pieces of concept art created to be replicated and brought to life for Prime Video's The Lord of the Rings: The Rings of Power fantasy drama series.\n\nNews24 sat down with the iconic book illustrator John Howe to discuss his work. He served as a chief conceptual designer for Peter Jackson's The Lord of the Rings movie trilogy and returned to work on The Hobbit films.\n\nAs the concept artist for The Lord of the Rings: The Rings of Power, the illustrator says that Prime Video's latest visual venture into Middle-earth brings viewers \"another glimpse of an absolutely vast world\".\n\nWith The Rings of Power, set thousands of years before the events depicted in The Lord of the Rings, you and we as viewers get to go back to a re-envisioned Middle-earth where most of the civilisations are actually in their prime. The statues are whole; cities are gleaming and inhabited. How was it to work backwards to create concept designs to fill out what came before the remnants of what's left?\n\nThat's one of the most exciting parts of this excursion into the Second Age. We're no longer in the end of the Third Age where magic is leaving the world, and the Elves are leaving and everything.\n\nIt's like being at the end of autumn by the time we reach The Lord of the Rings, and for The Rings of Power, we're in spring and summer. As you just said, I think there's a vibrancy to this world that will go through some incredible events that are just on the horizon. That atmosphere that sentiment is what I hope The Rings of Power manages to capture.\n\nHow big and broad could you go? Were there limitations beforehand of what you could dream up, or what were the parameters you got from the producers, or did they tell you, \"John, go for it\"?\n\nThe best directors are the kind who say, \"don't worry about practicalities. Practicalities will come later on\".\n\nI think it's important to have a certain amount of freedom, especially at the beginning. It's really important to somehow create imagery which encompasses not only the scope but also the atmosphere of any universe. Whether that atmosphere is slightly melancholic or vibrant – whatever is in the air – is what you need to capture, and there are no limits when you start. The beginning of pre-production is a wonderful time because you can just dream up anything.\n\nPhoto: Courtesy Prime Video\n\nNúmenor on an island as a kingdom of men is a setting we've never seen before. In The Rings of Power, it is majestic, but it's destined to be destroyed like Atlantis. What inspired that fabled setting and its design?\n\nIt's been a wonderful privilege to spend some time near the ocean in Middle-earth because, obviously, The Hobbit takes us nowhere near the sea, The Lord of the Rings only briefly, and here we're dealing with an island-nation, a maritime nation which is sending ships to the mainland. It's exciting and quite a different dynamic. The first season was filmed in New Zealand, and New Zealand has some of the most wonderful coastlines in the world. For me, it was a personal privilege to experience another glimpse of that and take that into the work.\n\nThey're both beautiful to me in their own right – the post-apocalyptic worlds where you see shards of what's left and try to imagine what used to be there in its splendour. Which one do you enjoy dreaming up and creating the most?\n\nOh, I'm a true romantic at heart, I'm afraid. I enjoy the whole notion of ruins, things that have disappeared, and civilisations that have passed. But I'm also very appreciative of every form of architecture, every form of decorative art, and every form of culture the world has to offer.\n\nOne of the things which I've tried to help bring in is this diversity of approach, this diversity of materials and textures and techniques. All of that hopefully contribute to a believable universe because we're really somewhere else. We're nowhere on Earth, and it's important that it in some form has credibility that we can relate to.\n\nPhoto: Courtesy Prime Video\n\nHaving worked on all the other films, you didn't come in cold, and everything that came before informs what comes after. How did working on the films help you to envision the look of this next chapter of the story?\n\nIt's always a complex situation to deal with a point in time in a universe and then to go back in time in the same universe.\n\nI'm not a great believer in retro-design – in taking what was done and then trying to imagine what it was before. I prefer very much to go back to the original material, to go back to the sources that were the inspiration for the first excursion into this world, and then try to reimagine from those sources what it might have been like many thousands of years earlier. If my intuition is in any way correct, then, in theory, it will match. I really don't like taking what's been done before and working back. I'm not really a fan of that. I think it's better to, in a way, I shouldn't say \"abandon\", but to leave that where it is and try and imagine, reimagine, the same universe in an earlier time without \"owing\" anything to what was done before.\n\nThere are obviously, clearly, references and do need to be respected. That's obviously very important, but I think it would be an unwelcome restraint.\n\nDo you have a favourite – what do you enjoy more between drawing fantasy settings, cultural objects or creatures?\n\nI like them all! I really enjoy them all because they're all such different propositions. I love doing weapons and armour very much. I love drawing creatures. I like it all; I really do.\n\nI enjoy trying to create the visual details of a credible, non-existent culture from another time and another world. It's very exciting. What makes it work? What makes it fail? Those are things that are hard to define, but I've always found that if I can find half a dozen design elements for any culture I'm approaching and trying to imagine, then you can build a world from that.\n\nIt's very much that process I've been following since I've been designing for film. I like to do it; I shouldn't say \"slowly\" because everything needs to be done at a certain speed and a certain pace in the movies. But it is done with a lot of thought. It's almost like you could imagine being on a pilgrimage to a city where you can see it from far away. So you draw what you see. Then as you walk a bit closer, you draw what you see now, and you keep walking a bit closer. Each time you gain more detail and knowledge of where you're going. Then, when you're actually inside, you just look around, and you can draw it all!\n\nPhoto: Courtesy Prime Video\n\nWhat do you think will surprise viewers when they enter this visual world of Rings of Power for those who read the book and those who haven't?\n\nI don't know if I can even answer that! I hope that people will take this for what it is – it's another glimpse, I shouldn't say \"a modest glimpse\", but another glimpse of an absolutely vast world. After having worked on two trilogies – they barely scratched the surface of Middle-earth. There's still a huge amount to explore. This, to me, is an opportunity to open a window on a period of Middle-earth we haven't seen yet.\n\nSeason 1 of The Lord of the Rings: The Rings of Power is available to stream on Prime Video, with a new episode released every Friday.\n\n\n\n"}, {"url": "https://quillandpad.com/2020/09/10/how-to-train-a-dragon-jaquet-droz-collaborates-with-john-howe-lord-of-the-rings-and-the-hobbit-illustrator-and-conceptual-artist/", "page_content": "Quill & Pad’s Joshua Munchow would say that watchmaking and sci-fi/fantasy easily appeal to the same kind of person. But Joshua is not the only member of the Quill & Pad team to find joy in two such seemingly disparate subjects: I too am a nerd at heart.\n\nWhich is why the announcement of Jaquet Droz collaborating with John Howe both pleased me and made me realize that the two fit together far better than I imagined. Starting with Jaquet Droz’s past in making androids – perhaps the science fiction items par excellence of their day – this brand is about as creative as it gets in our traditionally minded world of horology.\n\nWho is John Howe?\n\nJohn Howe, the Canadian-born book illustrator and conceptual artist, is best known as one of two chief conceptual designers for the Lord of the Rings film trilogy by Peter Jackson and The Hobbit trilogy. He has also illustrated other items based on the timeless story by J.R.R. Tolkien and other well-known genre classics like Game of Thrones and The Chronicles of Narnia: The Lion, The Witch, and the Wardrobe.\n\nA conceptual artist is responsible for the style and look of a film. His or her sketches aid producers, programmers, and 3D artists in understanding how sets should look and the vibe should feel. The conceptual artist’s sketches are vital to the cohesive development of a feature-length film.\n\nBorn in Vancouver, 63-year-old Howe has lived in Neuchâtel for 30 years. He moved to Europe after graduating from high school, beginning with a university experience in Strasbourg.\n\nHowe is currently busy working on the upcoming Lord of the Rings television series for Amazon Studios – according to reports, set to become the most expensive TV series ever – which began shooting in New Zealand in February 2020. It is expected to stream in 2021.\n\nHowe keeps a rather low profile, so this collaboration with the imaginative La Chaux-de-Fonds-based brand is one that I find eminently exciting.\n\nThe Jaquet Droz dials, as we’ve shown before, do lend themselves very well to artistic endeavors outside “usual” watchmaking. This turn toward the fantasy world could be an immensely exciting collaboration, and not just for nerds like me.\n\nJaquet Droz collaboration with John Howe\n\nHowe’s collaboration with Jaquet Droz marks the first time that he has been approached by a fine watch brand. From reports, Howe worked alongside the brand’s own artisans in the creation of an as-yet not-disclosed timepiece or timepieces.\n\nIt will be exciting to discover what magical, mysterious ideas pop up on the dial of the next Petite Heure Minute or Ateliers d’Art models, which constitute my guesses as to the canvas of the future Howe masterpiece(s). I just hope we don’t have to wait too terribly long to see them!\n\n“The craftsmen and designers at Jaquet Droz strive to bring together precision, poetry, and light in their meticulous work when it comes to materials and movements, something I particularly appreciate,” Howe said. “The technical constraints further stimulated reflection and creativity. Collaborating with Jaquet Droz, renowned for its great creativity, proved to be challenging – but most of all, a real pleasure.”\n\nFor more on John Howe, please visit www.john-howe.com.\n\nYou may also enjoy:\n\nJaquet Droz Petite Heure Minute Tiger: So Lifelike You Expect It To Leap From The Dial\n\nJaquet Droz Loving Butterfly Automaton: Millions Of Years In The Making\n\nJaquet Droz Magic Lotus Automaton: Zen Serenity On The Wrist\n\nAll About Automata: Mechanical Magic (With Action Videos)\n\nJaquet Droz’s Charming Bird Deconstruction By The Naked Watchmaker (Plus Video)"}, {"url": "https://boingboing.net/2014/05/26/meet-the-man-who-remade-middle.html", "page_content": "You may not know John Howe, but you have probably visited his worlds.\n\nHowe is among the best-known illustrators of J.R.R. Tolkien's works. Since the 1990s, Howe has helped visualize Middle-earth by creating art for various bound editions of The Lord of the Rings, The Hobbit and other works. He also provided artwork for more obscure Tolkienania, such as calendars, posters, postcards, jacket art for the covers of audio editions and games and trading cards. Not only that, he's the man behind the pen for a variety of other fantasy art projects: Beowulf board games, Anne McCaffery book jackets, Magic: The Gathering cards, children's books, and folk tales such as Rip Van Winkle and Jack and the Beanstalk. Howe has also illustrated books on dragons, knights and \"how to\" instructional manuals for how to draw your own fantasy art.\n\nBut Howe's stature as a fantasy artist catapulted to new heights when Peter Jackson tapped him and Alan Lee, another prominent Tolkien illustrator, to serve as conceptual designers for his Lord of the Rings trilogy. Jackson has said that even before he hired Howe, the illustrations that Howe drew of Gandalf (see banner image above), Bag End, the Balrog and the Nazgûl's flying beasts helped guide his vision for Middle-earth.\n\nToday, given the millions who have seen Jackson's films, Howe can be credited with irrevocably shaping how we see Tolkien's world on the screen, and in our imaginations. Someone had to design every dwarf axe, evil tower, hobbit mug, and orc prosthetic, and Howe had his hand in nearly every decision about Middle-earth's \"look and feel.\"\n\nPlus, thanks to the seemingly infinite production documentaries found in the Rings trilogy's Extended Edition DVDs, Howe has become somewhat of a celebrity—at least among the ranks of those who care about the behind-the-scene scribblers, sword-forgers and model makers who work for the special effects house Weta Workshop and Jackson's fantasy empire down in Wellington, New Zealand. (Howe actually works for 3 Foot 7 Ltd., the New Zealand production company created by Warner Bros.) With his colleagues, Howe has brought new levels of fastidiousness to movie production design.\n\n\"John is highly productive,\" said Alan Lee about his office mate and artistic collaborator, \"producing brilliant drawings in the brief periods when his turbo-charged metabolism allows him to sit still.\"\n\nThe tag-team of Howe and Lee moved back to Wellington when Jackson decided to adapt The Hobbit trilogy. The first installment, The Hobbit: An Unexpected Journey, came out Christmas of 2012; film two, The Desolation of Smaug, hit theaters a year after that. When the \"Extended Edition\" of An Unexpected Journey was released last year, fans got an extra taste of Howe's magic touch. Expect the same sneak peeks into Howe's process when the extra dance mix version of film two comes likely comes out in October or November. Of course, there's also the final installment of the trilogy, now with the new title The Hobbit: The Battle of the Five Armies, which arrives just over half a year from now, in December.\n\nHow Howe got into this field of fantasy is not the most surprising story. Born in 1957 in Vancouver, he grew up in British Columbia, and at a young age, began steeling himself to the artistic temperament. On his website, Howe recalls \"bursting into tears of frustration\" when he \"failed to draw a cow the way I wanted.\"\n\nThen, as a teen in the late 60s and early 70s, he discovered The Lord of the Rings and began devouring paperback fantasy novels, collecting them \"for the covers.\" He was drawn to artists like Frank Frazetta (\"demigod status\"), Barry Smith (Conan) and Bemi Wrightson (Swamp Thing). Curiously, his seeing the Hildebrandt Tolkien calendars (1976-1978) showed Howe that Middle-earth \"could be illustrated.\" He analyzed the calendars, drawing his own versions of the same scenes the Hildebrandt brothers had done. In 1976, Howe moved to France to attend art school in Strasbourg. He then moved to Switzerland and has been there ever since.\n\nOver his career, his art has taken on many forms—political cartoons, magazine illustrations, comic books, advertisements and animated films. He exhibits his art extensively. He's also made the transition from charcoal and graphite to the digital pen. Today, when he's not in New Zealand working on a film—and get this, he spent two years total working on Rings and, thus far, nearly four and a half years on The Hobbit—Howe lives in Neuchâtel, working as a freelance illustrator.\n\nI had a chance to interview John on two occasions. I first spoke with him via Skype from his home in Switzerland, in January, 2013, just after The Hobbit: An Unexpected Journey, was released. Then things got busy, and he was back in New Zealand to continue work on the next two Hobbit movies. John and I reconnected in July of last year to complete the interview. (The gap in the interview is noted below.) We also caught up over email several times over the interceding months.\n\nI found Howe to be smart and articulate, as well as gentle and patient, and reflective about his life. In our conversations, we talked about the differences between working on Rings versus The Hobbit, how evolving digital technology has impacted his art career, and whether he ever burns out on Tolkien, among other topics.\n\n\"A concept artist's work is never done\"\n\nJanuary, 2013\n\nEthan: Thank you so much for agreeing to talk with me. It's so funny, I feel like—and you probably get this line a lot—but I feel like I sort of already know you because I've seen so much video of you on the various \"making of\" DVDs.\n\nJohn: I'm sure I've talked my head off. I've never listened to them though.\n\nEthan: So you're back in Switzerland, right?\n\nJohn: That's right. Yes, I just got back yesterday, actually.\n\nEthan: How long had you been in New Zealand, or have you been going back and forth relatively recently?\n\nJohn: A good deal of back and forth, but never more than three weeks or a month here for the last three and a half years. Most of my time has been spent down in New Zealand.\n\nEthan: So you must have a home down there, you spend so much time there.\n\nJohn: Well, it's not quite a home away from home! We live in a furnished house, so I'm trying to resist my natural inclination to keep buying books and to try and keep our presence there as light as we can – not always successfully – it's become kind of a long term temporary arrangement. Home is definitely back here.\n\nEthan: And will you be heading back? I know the principal photography in the first film was done but there's probably more work for you to do, back in New Zealand.\n\nJohn: There seems to be more work right until the last shots are delivered. It's quite a change, actually, from back in the day when you'd do concept art and they'd move into production, and you weren't really even needed after that. Now it seems to be right down until the very end. A concept artist's work is never done, it seems.\n\nEthan: It was a bit unclear to me at the point when plan was announced back in July to make The Hobbit three films, whether that meant envisioning new stuff and coming up with new material for the third film, or was it simply shifting what had already been shot and conceptualized into three films? Or do you have quite a bit more to be putting together, particularly for that last film?\n\nJohn: We don't really know yet. I believe it's more of a question of having a little more time to develop the same episodes that were going to be in two films anyway. Therefore, it doesn't really change a huge amount for us as far as I can tell. Unless, of course, Peter and his co-writers are busily writing new material that they hadn't been able to include New episodes and new locations might need well new artwork, and possibly we might have spent a bit more time developing more detailed views of the environments we'll be going to, but I don't think it will change a huge amount.\n\nEthan: So there could be some surprises, and it sounds like some of the actors will have to come back to do some more pick up shooting?\n\nJohn: Well, until everything is delivered, Peter is capable of all kinds of surprises! It's only when the film has been torn from his hands to be delivered, to come out, he can't do anything anymore. He has this amazing capacity to keep everything developing and changing as he goes, and some kind of miraculous grasp of the movie as a whole that lets him achieve these changes.\n\nEthan: To me it sounds like an amazing process, and I wondered if you and Alan Lee felt at any point—because you've been visualizing Tolkien's works for so long, both independently in the movies and since the movies—do you at some point just sort of throw your hands up and say, \"Enough Tolkien! I need to, well, maybe not draw anything at all, but if I'm going to draw something, I'm going to draw something in the 21st century?\"\n\nJohn: Well that's the odd part about it. We were actually talking about that the other day, that it's actually quite a surprise that we haven't become jaded and tired of it all, but it seems that everything we draw is just another opportunity to explore something else. And I don't think that we'll get to the end of it with these movies, or to the end of our enthusiasm and interest, as conventional as that sounds. I think that the amount of work required in pure illustrative terms to flesh out a universe like that in 3D, in the way that Peter likes to develop his scenes, just means that you keep facing new—I shouldn't say challenges—but just new things to do all the time. So it never really is a question of, \"Oh, here we go again.\" It's really, \"Oh my goodness, how about that. Of course, let's have a shot at that.\" So it remains as much fun as it did right in the beginning, although the actual use of the work is now very different because we're working to shot and filling in holes and replacing green screens, completing things that we'd sketched out literally a couple of years ago.\n\nVisualizing The Hobbit vs. The Lord of the Rings\n\nEthan: I know that there are many new characters and places in The Hobbit, but the basic elements and locations are already there. I can imagine that because the bigger work—the general parameters of the visual look of this world, Middle-earth—were established in Lord of the Rings—you're not going to go and redesign Hobbiton or go redesign the Rivendell. You build to it, maybe.\n\nJohn: But once we've left Rivendell, it's brand new territory and a very different part of Middle-earth than we've visited before, much father north and much farther to the east. So there's an element of exoticism in there that's very, very different. It's kind of like heading toward St. Petersburg rather than heading to Rome, if you like. Although it's a very, very different universe, but nonetheless it still needs to feel like it would plausibly sit with all the rest. That's something that was very instinctive with us. We don't get out spreadsheets and checklists. It's just really a question of how it feels.\n\nEthan: And knowing that The Hobbit itself is a different tale in the sense of its tone and its scope, is it in some ways harder to visualize because Tolkien doesn't have as much description of what things look like? Or do you not feel that's the case?\n\nJohn: No, I don't feel that's a constraint. I think the feel of Tolkien's Middle-earth is very, very strong, and instinctively that provides guidelines for what feels \"right\" and what doesn't. I know that's a very hard thing to qualify and to quantify, but it's very instinctive, and you quickly reach a point where you feel \"That's not quite right.\" Beyond that point you don't even pursue because it simply doesn't feel like it fits. On the other hand, we always seem to know how things should look (that's another exercise that is quite hard to explain). When we need to draw the architectural style of Dale, we don't rush out and research right and left and copy-paste a patchwork of diverse elements together. Building on Peter's brief, and using knowledge of architectural history, combined with the materials we imagine being used, and working up those design traits that define an architectural style, albeit a fictitious one in this instance, you quite quickly settle on a \"feel\" for a place. Everyone who visited the Dale set, for example, said that it reminded them of somewhere they had visited, but no two people gave the same location.\n\nEthan: Right. I was thinking of the more whimsical touches. And having seen the film, my sense is that Peter and screenwriters Philippa Boyens and Fran Walsh didn't make it a jolly children's tale so much as really connecting the themes that are in The Hobbit to Lord of the Rings. There's some dark material there for sure. It wasn't as if suddenly you arrive at, let's just say, a new place we haven't seen yet, a wild, surreal place in The Hobbit, and you're suddenly going to have a circus-like atmosphere that's not in keeping with the way things already look. How does Beorn's house differ from Edoras, let's say? They would be related in some way. Barn structures and so on and so forth, are not made out of gingerbread in The Hobbit, simply because it's more whimsical in tone.\n\nJohn: No, no I think that was quite an early decision on everyone's part to actually try and weave these two universes into one. I think that treating The Hobbit as a different universe, a lighter, more whimsical children's book kind of universe, would have actually been to stray from what Tolkien might have intended had he not written The Hobbit first. Because when he wrote the book, he was sort of feeling his way in something that was brand new at the time. And the inclusion of all the fairy tale elements was what he carried into his first stroll in Middle-earth if you like, and I'm not sure that those would've actually been kept had he had the opportunity or even the desire to go back and revisit The Hobbit. He might have wished for something less storybook like, something that was more in keeping with what he came to write for The Lord of the Rings. Of course, it's obviously making an assumption that you can't make, but to treat that first foray, which was quite a naïve storybook version into this world, as something totally different, I think wouldn't have really made sense in the long term. That was a pretty roundabout way of saying that I think it just makes better storytelling to actually fit it all into the same universe. His elves, for example, gathered depth and gravitas as Middle-earth evolved. The Hobbit offers us a child's-eye view of the world, complete with merry, almost fairy-like elves. People would have been quite dismayed to go to Rivendell and see the elves as Tolkien described them in The Hobbit.\n\nEthan: Right, right. Singing songs and that kind of thing.\n\nJohn: Indeed, I think it made perfect sense without even really, really considering it very, very, very deeply to want to expand that universe of The Lord of the Rings into The Hobbit and not the opposite.\n\nEthan: And knowing how Tolkien worked over time, one gets the impression that, could he have lived another fifty years, he would have spent the rest of those fifty years going back and continually tinkering with the entire work, to make them all match – to make The Silmarillion match with The Hobbit match with The Lord of the Rings.\n\nJohn: The style of The Hobbit is like a bright dust jacket on a solemn book. The Hobbit is full of serious themes. It's not a cheery fairy-tale world, even if whimsy and light fantasy are present, at least nominally. There's nothing particularly whimsical about Beorn, who goes directly back to Viking themes. One of the ancestors of Smaug is possibly the dragon in Beowulf, and that's a very serious tale. Thranduil and his elves, although they're presented in quite a lighthearted way, are nonetheless the elves that decided not to leave Middle-earth. And that's actually quite a deep question that's raised as to why they don't; who are these elves, and what are their relations with the other ones. And the whole back story with the dwarves, which is only lightly touched upon in The Hobbit, appears in the appendices to Lord of the Rings as far more serious material than just a bedtime story for grandchildren. So everything is there, but when told in that grandfatherly way, makes it seem like a very different story. It's hard to avoid mistaking narration for content at times.\n\nEthan: I was particularly impressed with the prologue in the film of the dwarf story and the battle and what the dwarf city looks like. I'm getting the name wrong, Erebor, right? The Lonely Mountain? I had to go back to The Hobbit recently to see how many words Tolkien uses to describe what that city was like, but it sounds like it wasn't a lot. And from that you and Alan extrapolated this whole space and kingdom that certainly has echoes of Mines of Moria, but also is its own thing.\n\nJohn: Tolkien describes Erebor as the greatest kingdom in Middle-earth. (Or at least that's what it is in the script; I haven't been back to read The Hobbit for a long time.) One of the challenges was to make Erebor something once again reminiscent of Moria, to make it akin yet different. We both had our hands in that, although Alan spent, I think, three months working on the prologue doing dozens of pieces of artwork while I was underneath the Misty Mountains with the goblins trying to draw my way, along with the dwarves out the other side. It was a pretty busy time. We have often joked about being in a tight spot as concept artists, but when you've drawn yourself into a corner, you can just draw a door in the wall, open it and go through.\n\nDigital effects: \"Now pretty much anything is possible\"\n\nEthan: Did you feel like the volume and pace of the art, and design, and what you needed to produce for The Hobbit was on par with Lord of the Rings, or was the time shorter and did you have to produce more?\n\nJohn: The whole nature of what you can do has changed so profoundly now. Ten years ago, digital effects were good but they weren't anywhere near what they are now. And now pretty much anything is possible. So there were shots that were being created a month before the film was due to come out, fully digital shots or shots that had only a small portion of a plate remaining in them with the rest being green screen. This requires a huge amount of what is intrinsically concept art, but in post-production. The whole nature of production has changed, largely blurring the lines between pre- production, production and post-production. Of course, production still means when actors are present, sets dressed and lit and cameras rolling, but the rest is in a permanent state of creativity. It seems pre-production continues right up until the film is delivered.\n\nEthan: Which probably is exciting. But I can imagine that the opportunity to change things at the last minute could be frustrating.\n\nJohn: Not really. It's honestly quite exciting because obviously when you get down to a rough cut you're working to shot cameras, you're establishing new scenes which have to really fit with others which have already been shot and at least partially finalized. It's quite a juggling act to make it all function from every angle. But it's true, there's a fair amount of pressure involved, mainly because you're painfully conscious that the artwork you're doing today is going to give work to a few hundred people over the next couple of weeks. You really need to be very focused to get that artwork out and to provide them with the information they require to carry on with the scene. So it means thinking ahead in terms of the lighting, the 3D space, the animation and all the rest, so yes, it's quite exciting, and good fun.\n\nEthan: Does it seem with the way technology is progressing—to take an example like the Rivendell set—that less and less will have to be created as a full scale set for the actors to walk around on? A set could have just a few \"real\" signposts to give it a sense of three dimensionality, and the rest of the set, a single piece of art, could be projected or inserted digitally on the green screen later.\n\nJohn: Well, theoretically you could do the whole thing just with actors wandering around in a green set, but I don't think it would be very satisfying for them. I know it's incredibly hard for them to imagine their roles in an environment that is a non-environment. So I think that actually building sets is not going to change. There will be possibly a more expert division between the sets and the digital extensions because the whole nature of what can be done digitally is changing so fast. Nevertheless, the actors remain the focus of the movie, and I think that they're needed more than ever even if they don't always appear on the screen. And it's quite striking how much of each actor who plays a digital character is clearly discernible, even when he's been totally changed physically. Gollum, for example, is so much Andy Serkis that it would be impossible to imagine Gollum without him. It's kind of a question of deciding at the outset how far the digital needs to intrude into the environment that the actors require. Set building is going to change radically in the near future, I'm sure. The physical presence of the movie's particular world is primordial, to actually be in a convincing set and to actually be able to act in a believable environment. But on the other hand, the scope of things now is so grand that it makes no sense to do it other than digitally, so there's a lot of creative thinking on the part of the actors who are peering at a great big flat wall of green and saying how beautiful the sunset is.\n\nEthan: Right, right. It has to affect how they approach the art of acting.\n\nJohn: I'm sure it's quite hard for them at times, but then again, they are consummate professionals so they can do it if required, but it's true that the whole scene comes together in a much more complicated fashion now than it did a decade or two ago.\n\nEthan: I got the impression from one of the many interviews that was published that Ian McKellen (\"Gandalf\") was somewhat frustrated, maybe less by the green screen itself, but by the new way \"scale\" problems—that a hobbit needs to be shorter than a human—were solved. Peter Jackson was directing two different sets simultaneously, and the actors did not directly interact with each other. McKellen was talking to nobody and Martin Freeman (\"Bilbo Baggins\") was talking to nobody in another room, and the two performances were later merged together, digtially.\n\nJohn: Yes, that must be very hard for the actors to accomplish. It's all about line of sight and all of these wonderful things that happen between two people when they're doing a scene together, which must be very difficult to reproduce when you're staring at a green ball the size of somebody's head in a totally green set just right next door to where the other actors are. And once again, it's tribute to the talent of people like Ian McKellen to actually pull that off convincingly. It must be terribly hard. But then again, it's probably the best way of actually doing those scenes because the scale problem is quite a crucial one. We watched the crew shooting that scene where they're running down the hillside before they get cornered in the pine trees, and the dwarves are running down the set and Ian McKellen was running down a green incline just facing that set, and on the screen you could see them all together in real time. It was extraordinary. It was still quite rough, it was still a bit messy with the silhouettes and all, but it does allow Peter to actually direct everybody at once. And they're doing the same with the motion capture. You used to have to do the motion capture separately, but this time around they were actually able to do the \"mocap\" of Gollum (Andy Serkis) on the set, with Martin Freeman acting in front of him, although how Andy ever acts with a camera fixed to his face, which is covered in white dots, I don't know. But they're capable of quite extraordinary things. And everything is done to help the actors through it because it's not an easy job.\n\nEthan: And what about for you, for your process? I did see on one of the production videos, it was either you or Alan, drawing on a digital tablet, and I assumed that artwork was going directly into some animator's hard drive and then he or she would work on it from there. How has digital technology changed the process of making art for you? Are you doing less drawing with a pencil on a piece of paper, now that so much of this is getting converted to digital material later?\n\nJohn: It really depends to a large degree on at what stage we find ourselves. Quite often, initial concept art is more efficiently done with pencil and paper in order to quickly convey the idea. And then as it goes farther down in production, farther down the line, more information is required and eventually it's necessary, or rather it's more efficient and much more productive, to produce full color artwork with the textures and lighting and all the rest. Although, once again, Weta Digital is full of very talented people, and there are times when we provided a really quick pencil sketch and some layout artist has gone away and come back a day later with a full 3D environment blocked out. So it's really a question of the information that's required, so we try and work in relation to that. So that does mean a lot of digital work, a lot of Photoshop, because it's the quickest way to actually get the maximum amount of information to the next stage in production.\n\nEthan: Have you become comfortable with these digital tools? Or, given a choice, would you always want to use a pencil?\n\nJohn: The tools really don't matter, honestly. They're really there to help you produce the best piece of work for the purpose that it's needed for. And it certainly is quick—to actually physically paint the things that take you a day or a day and a half in Photoshop would take you literally weeks to do with a brush, at least to the level that's needed for a movie. I started using Photoshop about a year and a half ago. I'd never really used it before—or certainly not to paint with. But, once again, the programs are so well geared towards instinctive use that even people like me can catch on quite quickly.\n\nJohn Howe vs. Alan Lee: \"You'd think we'd be drawing blades at every turn\"\n\nEthan: What are the areas of Tolkien's world that you were mostly responsible for, versus what Alan Lee did? Did that change since designing Lord of the Rings?\n\nJohn: We did inherit a certain amount of environments from The Lord of the Rings. I fleshed out Bag End and did a few extra hobbit holes for Hobbiton. Alan reworked Rivendell, and then from that point on everything was really pretty much up for grabs. And we both contributed to some degree in pretty much every environment, although we ended up, because of time constraints, taking over certain ones. Dale was something that I had a huge part in designing, but Alan finished it up for the prologue. The same went for Erebor. He and I both worked on the Goblin Kingdom, but I ended up taking that to its final form. Radagast's house was probably mostly my work, but Alan had a big hand in the development of it. (In fact, I think we must have done several versions of Radagast's before finding just the right one. Beorn's house was very much the same, though of course we halted work on that when two films became three and it was moved from film one to film two.) It can be quite hard to decide in the end who exactly did what.\n\nEthan: Did you guys ever fight over who should do what? Did you two have territory issues?\n\nJohn: Curiously enough, you'd think we'd be drawing blades at every turn. Initially we would both do concept work for all of the environments, and Peter would choose what he liked out of that. And then once we'd found our theme it was really more of a question of who was available to work on what, because there was such a lot to do. So we were quite rational in how we ended up finalizing everything. And I think all told, we've probably done between five and six thousand pieces of artwork. That may seem like quite a lot, though it did vary from quick sketches done in a quarter of an hour to completely rendered full-color final artwork.\n\nEthan: How do you organize all that? I'd imagine that after a while it's hard to keep track of what you created. \"Jeez, I've drawn 100 goblin. Which is the goblin I really liked and where is it?\"\n\nJohn: Absolutely! You go back through the server and you look at your work and you think, \"Oh my god, where'd that come from?\" Is it something you actually drew, and you'd just totally forgotten about it? Everything is quite well organized thanks to the servers and diligent coordinators, so we're able to access artwork quite easily. All of the physical artwork has been photographed and digitalized so it's all at our fingertips (if we can just remember in which category it's been put).\n\nEthan: I'm curious a little bit about your relationship with Alan and how it's developed. Obviously, you must like each other since you've spent, from what I can tell, quite a bit of time together working together. How many years has it been now total, between The Lord of the Rings and The Hobbit?\n\nJohn: I guess about over five years, yes.\n\nEthan: And you didn't know him all that well before this whole thing started, right?\n\nJohn: No I didn't. We actually met on the airplane between Singapore and Auckland.\n\nEthan: Oh, right. I remember that story.\n\nJohn: Yeah, we'd been in touch before, very vaguely. And we were in touch just before when the whole project started. But I've always admired his work. So we knew each other's work fairly well but we hadn't really ever met. But I don't think it'd be satisfying to work with somebody whose work you didn't appreciate. And although it is quite a challenge to think that the other designer is coming up with brilliant ideas all the time, it's far, far better to have that then to work with somebody whose work you don't appreciate. There was a huge degree of mutual respect and the knowledge that if you didn't get the concept nailed down yourself, somebody else has done it just as well and probably even better. In the end, the important thing is the collective look of the movie, and the fact that we're able to function as a tandem in that environment is essential. And people will come into the office and say, \"Which of you did this drawing?\" And although our color work is quite different, a lot of the pencil work can be actually quite similar. It's a very, very harmonious working relationship.\n\nThe Hobbit: The Desolation of Smaug sets: \"I think there'll be a lot of surprises\"\n\nEthan: Have there been any major creative breakthroughs this time around or something in particular that you're proud of for your work on The Hobbit?\n\nJohn: Indeed! It's always the same story, you're always hoping for a really novel idea to appear. We were very very happy with the sets that were done for Dol Guldur, for example, and Beorn's, which was my favorite set; neither of which you've seen much of yet.\n\nEthan: That's right. I can't wait to see them.\n\nJohn: Just got a little taste of it in the first movie, but we were happy with how those came together. I was very, very pleased with Radagast's house, inside and out, although we didn't see too much of it on the screen. It was the first set built which was not somewhere already visited during The Lord of the Rings. (The sets built prior to that were Hobbiton, Bag End and Rivendell.) Radagast's house was the first step into brand new territory, but it's not even in the book. Curiously enough, it felt very, very, VERY Hobbit-like, as opposed to Lord of the Rings. It felt whimsical and light, a bit odd and a bit strange, with an odd shamanistic quality to it. Radagast is very much a shamanistic figure himself, so that environment ended up reflecting his quirky personality. And then we moved on. For Goblin world, Peter was very intent to make it something other than just a black hole in the ground with creepy goblins scuttling about. That's were the idea of having everything jerry-rigged out on these platforms appeared, creating a really much more interesting universe than something at the bottom of a cave. And we just went on in that light.\n\nEthan: What's it like finally seeing the movie after all these years of work?\n\nJohn: I found it hard. We saw the movie at the world premiere in Wellington, but I'm waiting for a few weeks to go by before I go back and see it again. It was so close I couldn't tell how it all was. I kept asking other people, \"What did you think of the movie?\" of people who hadn't really been involved. It would just be such a treat to become briefly amnesiac for two and a half hours and go see this movie as if I'd never seen even a trailer before. So I'm a little bit envious of the people who haven't worked on it. I hope that the public when they go see it will feel themselves in a place that they know very well, but suddenly heading off in a bit of an adventure to other parts of Middle-earth that they haven't seen yet.\n\nEthan: And it's been nearly 10 years since audiences saw the The Return of the King, which came out in 2003.\n\nJohn: Yeah, I'm really anticipating this film finally coming out; I really want it to be a big hit. Fingers crossed. But I think, once again, it's everybody who came back ten years on to head back into Middle-earth did so with their enthusiasm very, very much intact. Although it's a bit of a different proposition to be doing the 48 frames per second, and the 3D, it's still all about trying to translate a really well loved book into hopefully what will become a classic of fantasy cinema. We all worked extremely diligently to make all that happen. So fingers crossed, and we'll see how it goes.\n\n\"The entire nature of post-production has changed\"\n\nJuly, 2013\n\nEthan: Six months have passed since I last spoke with you in January. Are you still in New Zealand?\n\nJohn: Yes, still in the Antipodes, busily working! In fact, it's never been busier.\n\nEthan: How is the atmosphere in the production offices these days? Are you and Alan still working on films two and three?\n\nJohn: We have switched over to Weta Digital, to work principally in post-production, something I'm enjoying very much. \"Digi,\" as it's called, is quite a marvelous place, full of talented people from literally the world over, all putting in long busy hours. I regret not being closer to the pick-ups. Although Stone Street Studios is only a stone's throw away, it seems there's so much to do, it's impossible to go hang around set. But they are VERY focused and incredibly busy, so they hardly need tourists loitering about! I do go and try to make a tour of the sets to take photos I know will be useful later on in blog post, but it's best to do that during lunch break.\n\nEthan: What have you been mostly working on?\n\nJohn: While filming is drawing to a close very soon, post-production has been in full swing for months, with of course the delivery dates fast approaching. It can be quite demanding remaining creative, knowing that there is little time to waste. Basically, though, we are still doing exactly the same thing we've been doing since the beginning, though now it is very much more focused on the cut.\n\nEthan: Describe how your job as a conceptual designer changes now that films are in post-production and pick-up shooting phase.\n\nJohn: I really enjoy taking sequences and working to the shots, creating the backdrop around the action as a series of sketches that captures the look and feel of the environment. It then does off into the digital pipeline (of which I have only really a layman's grasp) and gets built, in much the same way as the sets, although this time, the sky's the limit, rather than the sound stage grid. It's quite exciting, and I think I've learned a lot more about the whole process in the last year than in the three preceding. The entire nature of post-production has changed in the last few years, so it's been an admittedly steep learning curve.\n\nEthan: Did the mixed critical and fan reception to the first Hobbit movie affect any new approach or change to the second and third films—in terms of focus or emphasis or changed design on any particular aspect? I wonder if Peter Jackson ever said, \"Well, people seemed to think there was too much action in An Unexpected Journey, so give me something different for the barrel sequence or Elvenking hall footage,\" or anything lie that. How did the decision to make what was originally two films into three affect you?\n\nJohn: We're still basically doing the same job we've done for the past four (four?!) years: bringing the visuals Peter is searching for to life. We are following the design leads we developed in pre-production through production, and augmenting those as we go. We've also been designing sets for the pick-ups, though that was part of a big push a few months ago, as well as developing, as best we can with all the other work, ideas for new sequences and scenes. As I'm sure you can imagine, Peter and this co-writers have been busy remodeling the scripts for films two and three, so while the story still goes from A to B, or rather There and Back Again, they have more latitude to work with.\n\nEthan: What can you tell us about film number two, The Desolation of Smaug, in terms of your work on the screen, and new environments?\n\nJohn: You'll have to wait for the film, too, to see Beorn's, but once again, I think we found something with that set which was very different. And then on to Mirkwood, Thranduil's woodland realm and everything else. I think there'll be a lot of surprises. I think that the spectators will find themselves in the universe they expect but bound for somewhere they just haven't imagined.\n\nEthan: Do you ever have time for other projects?\n\nJohn: I confess I'm eager to get back to my natural habitat. I really do wonder if anyone will remember me! We've been so busy working, I haven't worked in ages on what I normally do. Additionally, as everything is digital, with the (unbeatable) exception of pencils and sketchbooks, it remains to be seen if I can actually recall how to paint for real. I've not managed to do much work outside the film work, but do have a few projects slowly progressing, but they are really advancing at a snail's pace.\n\nEthan: Well, it's been a pleasure, and from a geeky, Tolkien, Peter Jackson nerd's perspective, just personally very exciting to finally meet you in this way. Just a personal thrill to finally chat with you, as a big fan of your work. Perhaps some day our paths will cross. I was actually at the Neuchâtel Fantastic Film Festival two summers ago. I was a guest there to talk about my book Fantasy Freaks and Gaming Geeks. So I figured I might've run into you there, or you probably attended before. Are you actually in the main part of Neuchâtel,?\n\nJohn: We are, just on the edge of town. It's a very lovely city, relaxed and quite small and attractive. But two summers ago I would've been in New Zealand.\n\nEthan: Yeah, probably working hard on The Hobbit.\n\nJohn: Absolutely.\n\n[Note: This interview has been edited. Thanks to Cathleen Miles for her transcription help.]"}, {"url": "https://www.wikiart.org/en/alan-lee", "page_content": "Alan Lee was born and raised in London, where he studied graphic art and design. Enchanted by myth and folklore from an early age, he gravitated toward the field of book illustration — following in the footsteps of Arthur Rackham and Edmund Dulac, master illustrators of the nineteenth century. Alan worked as an illustrator in London until the mid-1970s, when he moved to Dartmoor with fellow-artists Marja Lee Kruyt (to whom he was married for many years) and Brian Froud. At the urging of Ian Ballantine (the legendary American publisher), Alan and Brian created the book Faeries, inspired by the Dartmoor countryside. It went on to become a bestseller, published to acclaim all around the world. Since that time, Alan has established himself as one of England's preeminent book artists, creating exquisite watercolor paintings for, among other works, The Mabinogion, Castles, Merlin Dreams, and Black Ships Before Troy: The Story of the Illiad (winner of the pretigious Kate Greenaway Award), and for the lavish anniversary edition of J.R.R. Tolkien's The Lord of the Rings. For the last few years, however, book projects have been set aside while he labors on the New Zealand set of Peter Jackson's film trilogy, The Lord of the Rings. As conceptual designer for the films, it is Alan's job to create the distinctive \"look\" of Middle Earth. A comparison of the films to Alan's prior illustrations for The Lord of the Rings gives a clear idea just how influential Alan's vision has been to the project. He has also designed for other films, including Legend, Erik the Viking, and Merlin. When not working on film locations, Alan still makes his home on Dartmoor in southwest England, where his studio takes up two floors of an ancient, rose-covered stone barn. In the same small village as mythic artists Brian & Wendy Froud, William Todd-Jones, Terri Windling, and others. He was one of the founders of the annual Mythic Garden exhibition of outdoor sculpture at the Stone Lane Gardens arboretum; and is involved in the creation of a woodland non denominational spiritual retreat building along with Diana Marriott and the internationally known local sculptor Peter Randall Page. His interests include myth and folklore, literature, poetry, music (particularly jazz, blues, and the singing of June Tabor), archaeology, history, international travel, and long walks through Devon woodland. He has two children, Virginia (also a sculptor) and Owen. Their mother, Marja, from the Netherlands, is a talented painter herself, as well as a Celtic harpist.\n\nAlan Lee (born 20 August 1947) is an English book illustrator and movie conceptual designer. He was born in Middlesex, England, and studied at the Ealing School of Art.\n\n\n\n\n\nAlan has illustrated dozens of fantasy books, including some nonfiction, and many more covers. Several works by J.R.R. Tolkien are among his most notable interiors: the Tolkien centenary edition of The Lord of the Rings (1992), a 1999 edition of The Hobbit that has been boxed with it, and Narn i Chîn Húrin: The Children of Húrin (2007). The latter, a first edition, is his work most widely held in WorldCat participating libraries.\n\nOther books he has illustrated include Faeries (with Brian Froud), Lavondyss by Robert Holdstock (as well as the cover of an early print of this book), The Mabinogion (two versions), Castles and Tolkien's Ring (both nonfiction by David Day), The Mirrorstone by Michael Palin, The Moon's Revenge by Joan Aiken, and Merlin Dreams by Peter Dickinson.\n\n\n\n\n\nHe has also illustrated retellings of classics for young people. Two were Rosemary Sutcliff's versions of the Iliad and the Odyssey—namely, Black Ships Before Troy (Oxford, 1993) and The Wanderings of Odysseus (Frances Lincoln, 1995). Another was Adrian Mitchell's version of Ovid's Metamorphoses—namely, Shapeshifters (Frances Lincoln, 2009).\n\n\n\n\n\nLee did cover paintings for the 1983 Penguin edition of Mervyn Peake's Gormenghast trilogy. He also did the artwork for Alive!, a CD by the Dutch band Omnia, released on 3 August 2007 during the Castlefest festival.\n\n\n\n\n\nWatercolour painting and pencil sketches are two of Lee's common media.\n\n\n\n\n\nLee and John Howe were the lead concept artists of Peter Jackson's Lord of the Rings films and were recruited by director Guillermo del Toro in 2008 for continuity of design in the subsequent The Hobbit films, before joining Jackson when he took over the Hobbit films project. Jackson has explained how he originally recruited the reclusive Lee. By courier to Lee's home in the south of England, he sent two of his previous films, Forgotten Silver and Heavenly Creatures, with a note from himself and Fran Walsh that piqued Lee's interest enough to become involved. Lee went on to illustrate and even to help construct many of the scenarios for the movies, including objects and weapons for the actors. He also made two cameo appearances, in the opening sequence of The Fellowship as one of the nine kings of men who became the Nazgûl, and in The Two Towers as a Rohan soldier in the armory (over the shoulder of Viggo Mortensen as Aragorn and Legolas talk in Elvish).\n\n\n\n\n\nLee has also worked as a conceptual designer on the films Legend, Erik the Viking, King Kong and the television mini-series Merlin. The art book Faeries, produced in collaboration with Brian Froud, was the basis of a 1981 animated feature of the same name.\n\n\n\n\n\nTwo years after completion of The Lord of the Rings film trilogy, Lee released a 192-page collection of his conceptual artwork for the project, entitled The Lord of the Rings Sketchbook (HarperCollins, 2005). Film director Peter Jackson said, \"His art captured what I hoped to capture with the films.\"\n\n\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://wblog.wiki/ce/John_Howe_(illustrator)", "page_content": "John Howe (born August 21, 1957) is a Canadian book illustrator and conceptual designer, best-known for his artwork of J. R. R. Tolkien's Middle-earth.[1] One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\nHowe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy. Howe illustrated the Lord of the Rings board game created by Reiner Knizia, and re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work includes images of mythological material such as the Old English epic poem Beowulf (including Knizia's board game Beowulf: The Legend). Howe illustrated many books in the fantasy genre, such as those by Robin Hobb. He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis, The Chronicles of Narnia.[1] In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, with numerous illustrations by Howe.\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson consulted with both Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\nHowe is a member of the living history group the Company of Saynt George, and has expertise in ancient and medieval armour and armaments.\n\nHowe also served as a conceptual designer for Amazon's The Lord of the Rings: The Rings of Power, which premiered on Prime Video on September 2, 2022.[3]\n\nJohn Howe was born in Vancouver, British Columbia. He was drawing from pre-school age, with his mother's help. Around primary school age he found his mother's ability no longer living up to his expectations, and even got frustrated once at both his mother and himself at not being able to draw a cow to his expectations. Howe's school years were complicated by moves which took place with a timing that left the art classes full, and left him in classes like power mechanics. He did find his ability as a draughtsman to be profitable in biology class though, where he and a friend would produce renderings of microscopic organisms for classmates at fifty cents each. As a child, he collected the covers of paperbacks. His collection included items from Frank Frazetta, Barry Smith, and Bernie Wrightson. In his adolescence, Howe read The Lord of the Rings trilogy by J. R. R. Tolkien. He said he got \"a real spark\" from the Hildebrandt calendars, which showed him that the books could be illustrated. Howe made drawings of his own versions of the scenes depicted in the calendar. These drawings, according to Howe, may not have survived.[4]"}], "John Howe has worked on notable films such as The Lord of the Rings film trilogy, The Chronicles of Narnia: The Lion, the Witch and the Wardrobe, and The Golden Compass.": [{"url": "https://www.vanityfair.com/hollywood/2022/02/10-burning-questions-about-amazons-the-rings-of-power", "page_content": "Last week Vanity Fair exclusively unveiled the first look at a number of characters and locations for Prime Video’s The Lord of the Rings: The Rings of Power series. J.R.R. Tolkien fans got another good look at this new Middle-earth story when the first teaser debuted during the Super Bowl this Sunday. Now showrunners Patrick McKay and J.D. Payne offer up even more details and insights, and answer some of the more urgent questions Tolkien fans have been asking about the series set in Middle-earth’s Second Age, long before Bilbo and Frodo Baggins went adventuring.\n\nA battle scene in The Rings of Power. Courtesy of Amazon Studios.\n\nWill It Look Like The Lord of the Rings?\n\nIn creating this new story, McKay and Payne’s goal was, in McKay’s words, “different but familiar.” While the series is not a precise continuation of Peter Jackson’s The Lord of the Rings, it shouldn’t clash with the cinematic world fans have come to know and love. Actors like Morfydd Clark (Galadriel) and Robert Aramayo (Elrond) were cast, in part, because they could age into the older versions played respectively by Cate Blanchett and Hugo Weaving in Jackson’s films. Even Benjamin Walker, who plays Gil-galad, bears a striking resemblance to Mark Ferguson, who appeared as the elven king in a nonspeaking cameo in The Fellowship of the Ring’s prologue.\n\nIt’s worth remembering, if only for legal reasons, that this is not the exact same world. The production design, though similar, is not trying to match the Jackson films. For example, King Elendil’s legendary broken sword, Narsil, which debuted on one of Prime Video’s promotional posters, does not look identical to the one eventually reforged and used by Viggo Mortenson’s Aragorn in The Return of the King.\n\nThe Amazon show has an advantage in that its prime locations—like Númenor, the Elven cities of Lindon and Eregion, and the intact dwarven city of Khazad-dûm—didn’t play into Jackson’s films. In The Rings of Power, one of the most identifiable Middle-earth landmarks, the great tower of Barad-dûr, where Sauron’s flaming eyeball sits, hasn’t been built yet. Nor has the Black Gate of Mordor or the Doors of Durin. The Rings of Power costume designer Kate Hawley, who worked on Jackson’s Hobbit films as well as Guillermo del Toro’s lavish Crimson Peak, is creating Middle-earth fashions that existed thousands of years before Liv Tyler’s Arwen draped herself in endless velvet.\n\nHawley isn’t the only overlap between the Jackson era and this one. John Howe, a beloved conceptual designer who worked on the films, lent his talents to The Rings of Power. “We were very lucky to have some alums that had experience in Middle-earth come back in,” Payne says. “We were the beneficiaries of their experience of having worked in Middle-earth before. We reached out to Peter [Jackson], but between COVID and his schedules and our schedules, didn’t manage to actually ever get together for coffee, but certainly would love to at some point.”\n\nMcKay adds, “Our only relationship is as big fans and admirers.”\n\nThe pair were quick to point out that the Jackson films were not their only inspiration. “The universe that this show wants to be in is Tolkien’s—and that’s an umbrella over Peter’s films—and Led Zeppelin, John Howe’s paintings, and The Hobbit cartoon,” McKay says."}, {"url": "https://www.news24.com/channel/tv/news/the-rings-of-power-concept-artist-john-howe-its-a-window-on-a-middle-earth-we-havent-seen-20220930-2", "page_content": "INTERVIEW: John Howe, concept artist, The Lord of the Rings: Rings of Power.\n\nThe entire fantasy landscape of Middle-earth during its Second Age – everything you see from buildings and creatures to objects and clothing – was dreamed up and designed on paper first. With over 17 000 pieces of concept art created to be replicated and brought to life for Prime Video's The Lord of the Rings: The Rings of Power fantasy drama series.\n\nNews24 sat down with the iconic book illustrator John Howe to discuss his work. He served as a chief conceptual designer for Peter Jackson's The Lord of the Rings movie trilogy and returned to work on The Hobbit films.\n\nAs the concept artist for The Lord of the Rings: The Rings of Power, the illustrator says that Prime Video's latest visual venture into Middle-earth brings viewers \"another glimpse of an absolutely vast world\".\n\nWith The Rings of Power, set thousands of years before the events depicted in The Lord of the Rings, you and we as viewers get to go back to a re-envisioned Middle-earth where most of the civilisations are actually in their prime. The statues are whole; cities are gleaming and inhabited. How was it to work backwards to create concept designs to fill out what came before the remnants of what's left?\n\nThat's one of the most exciting parts of this excursion into the Second Age. We're no longer in the end of the Third Age where magic is leaving the world, and the Elves are leaving and everything.\n\nIt's like being at the end of autumn by the time we reach The Lord of the Rings, and for The Rings of Power, we're in spring and summer. As you just said, I think there's a vibrancy to this world that will go through some incredible events that are just on the horizon. That atmosphere that sentiment is what I hope The Rings of Power manages to capture.\n\nHow big and broad could you go? Were there limitations beforehand of what you could dream up, or what were the parameters you got from the producers, or did they tell you, \"John, go for it\"?\n\nThe best directors are the kind who say, \"don't worry about practicalities. Practicalities will come later on\".\n\nI think it's important to have a certain amount of freedom, especially at the beginning. It's really important to somehow create imagery which encompasses not only the scope but also the atmosphere of any universe. Whether that atmosphere is slightly melancholic or vibrant – whatever is in the air – is what you need to capture, and there are no limits when you start. The beginning of pre-production is a wonderful time because you can just dream up anything.\n\nPhoto: Courtesy Prime Video\n\nNúmenor on an island as a kingdom of men is a setting we've never seen before. In The Rings of Power, it is majestic, but it's destined to be destroyed like Atlantis. What inspired that fabled setting and its design?\n\nIt's been a wonderful privilege to spend some time near the ocean in Middle-earth because, obviously, The Hobbit takes us nowhere near the sea, The Lord of the Rings only briefly, and here we're dealing with an island-nation, a maritime nation which is sending ships to the mainland. It's exciting and quite a different dynamic. The first season was filmed in New Zealand, and New Zealand has some of the most wonderful coastlines in the world. For me, it was a personal privilege to experience another glimpse of that and take that into the work.\n\nThey're both beautiful to me in their own right – the post-apocalyptic worlds where you see shards of what's left and try to imagine what used to be there in its splendour. Which one do you enjoy dreaming up and creating the most?\n\nOh, I'm a true romantic at heart, I'm afraid. I enjoy the whole notion of ruins, things that have disappeared, and civilisations that have passed. But I'm also very appreciative of every form of architecture, every form of decorative art, and every form of culture the world has to offer.\n\nOne of the things which I've tried to help bring in is this diversity of approach, this diversity of materials and textures and techniques. All of that hopefully contribute to a believable universe because we're really somewhere else. We're nowhere on Earth, and it's important that it in some form has credibility that we can relate to.\n\nPhoto: Courtesy Prime Video\n\nHaving worked on all the other films, you didn't come in cold, and everything that came before informs what comes after. How did working on the films help you to envision the look of this next chapter of the story?\n\nIt's always a complex situation to deal with a point in time in a universe and then to go back in time in the same universe.\n\nI'm not a great believer in retro-design – in taking what was done and then trying to imagine what it was before. I prefer very much to go back to the original material, to go back to the sources that were the inspiration for the first excursion into this world, and then try to reimagine from those sources what it might have been like many thousands of years earlier. If my intuition is in any way correct, then, in theory, it will match. I really don't like taking what's been done before and working back. I'm not really a fan of that. I think it's better to, in a way, I shouldn't say \"abandon\", but to leave that where it is and try and imagine, reimagine, the same universe in an earlier time without \"owing\" anything to what was done before.\n\nThere are obviously, clearly, references and do need to be respected. That's obviously very important, but I think it would be an unwelcome restraint.\n\nDo you have a favourite – what do you enjoy more between drawing fantasy settings, cultural objects or creatures?\n\nI like them all! I really enjoy them all because they're all such different propositions. I love doing weapons and armour very much. I love drawing creatures. I like it all; I really do.\n\nI enjoy trying to create the visual details of a credible, non-existent culture from another time and another world. It's very exciting. What makes it work? What makes it fail? Those are things that are hard to define, but I've always found that if I can find half a dozen design elements for any culture I'm approaching and trying to imagine, then you can build a world from that.\n\nIt's very much that process I've been following since I've been designing for film. I like to do it; I shouldn't say \"slowly\" because everything needs to be done at a certain speed and a certain pace in the movies. But it is done with a lot of thought. It's almost like you could imagine being on a pilgrimage to a city where you can see it from far away. So you draw what you see. Then as you walk a bit closer, you draw what you see now, and you keep walking a bit closer. Each time you gain more detail and knowledge of where you're going. Then, when you're actually inside, you just look around, and you can draw it all!\n\nPhoto: Courtesy Prime Video\n\nWhat do you think will surprise viewers when they enter this visual world of Rings of Power for those who read the book and those who haven't?\n\nI don't know if I can even answer that! I hope that people will take this for what it is – it's another glimpse, I shouldn't say \"a modest glimpse\", but another glimpse of an absolutely vast world. After having worked on two trilogies – they barely scratched the surface of Middle-earth. There's still a huge amount to explore. This, to me, is an opportunity to open a window on a period of Middle-earth we haven't seen yet.\n\nSeason 1 of The Lord of the Rings: The Rings of Power is available to stream on Prime Video, with a new episode released every Friday.\n\n\n\n"}, {"url": "https://tolkiengateway.net/wiki/John_Howe", "page_content": "\"I shan't call it the end, till we've cleared up the mess.\" — Sam\n\nThis article or section needs to be cleaned up to conform to a higher standard of article quality.\n\nJohn Howe Biographical information Born 21 August, 1957 Location Switzerland Website John-Howe.com\n\nJohn Howe is a Canadian illustrator most known for illustrating many works of J.R.R. Tolkien as well as working on both The Lord of the Rings and The Hobbit film series. Most recently he has worked as a concept artist for The Lord of the Rings: The Rings of Power television series. [1]\n\nJohn Howe was born in Vancouver, Canada.[2] He graduated from the École des Arts Dècoratifs of Strasbourg[2] in 1981, having obtained a Diploma in Illustration.[3] He now lives in Neuchatel with his wife Fataneh and his son Dana.[2]\n\nHowe first read The Lord of the Rings in high school, borrowing them from his school library. He started with The Two Towers, because \"everyone who started the first volume never got any further\" and The Fellowship of the Ring was rarely available to borrow.[4] He was inspired by artwork from The Brothers Hildebrandt to start creating illustration of Tolkien's works.[4]\n\nHowe's version of Boromir is based on his own face.[5]\n\nInvolvement in Peter Jackson's Middle-earth film series [ edit | edit source ]\n\nJohn Howe and Alan Lee worked as the chief conceptual designers on The Lord of the Rings trilogy.[6] Howe is also credited as a carpenter in the first two films.[6] [7] He has a cameo as one of the nine Kings of Men in the Prologue of The Lord of the Rings: The Fellowship of the Ring. Howe and Lee returned to work as conceptual designers for The Hobbit film series. They both make an uncredited appearance as a men-musicians of Laketown in The Desolation of Smaug.[8]\n\nArtwork theft [ edit | edit source ]\n\nIn the night of 18 May 1997, 11 of Howe's originals were stolen from the Médiathèque of Sedan in Belgium. The thief's father contacted the Médiathèque a couple weeks later promising to try to retrieve the stolen works from his son. 8 originals were finally returned, one (Minas Tirith) was damaged beyond repair. Éowyn and the Nazgûl, Gandalf the Grey, and The Uruk-hai were never recovered.[9]\n\nPublished Artwork [ edit | edit source ]\n\nHowe is one of HarperCollins' most used artists, and his cover art is frequently featured on translations as well.\n\nMultiple editions [ edit | edit source ]\n\nCalendars and books [ edit | edit source ]\n\n\"Illustrating Tolkien means treading warily, dipping one's brush in shadow and rinsing them in light. Battle and balance, down the impossible path between the clear and the obscure.\" ― John Howe on painting Middle-earth, Tolkien's World.\n\n\"It was this place in North Island, and we wandered round these fields saying, well, Bag End can go here, that can be our party tree; it was very exciting. It's almost even more fun to have a location imposed upon you, because you really have to get down to brass tacks and figure it out, imagine it on paper. It's a real illustrator's job.\" ― John Howe on working for Weta, Interview.\n\nSee also [ edit | edit source ]"}, {"url": "https://www.swissinfo.ch/eng/culture/the-lord-of-the-illustrations_how-john-howe-turns-tolkien-s-words-into-film/41253038", "page_content": "John Howe created the concept art for the films 2012 Warner Bros. Entertainment Inc. and Metro-Goldwyn-Mayer Pictures Inc.\n\nImages we all have of Middle-earth are largely the creation of two men; illustrators Alan Lee and John Howe. A very down-to-earth Howe invited swissinfo.chExternal link into his home where he talked about his inspiration and how he brought J.R.R. Tolkien's words to life.\n\nThis content was published on February 5, 2015\n\nJo Fahy\n\n\n\nA British multimedia journalist who moved to Switzerland in 2010, Jo has worked in TV, radio and online. She leads a team of video journalists, picture editors, a graphic designer, data journalist and community developer, and specialises in social media. Initials: jf swissinfo.ch\n\nOther language: 1 ( en original) 中文 (zh) 他如何\"画\"出了指环王\n\n“His face looks a little bit like mine I think,” says Howe as he shows me a Gandalf sculpture that sits on a small table in his lounge. It’s one of just a few, carefully selected objects on display in his home that show the connection between the illustrator and his most famous work, drawing the concept art and designs for the film adaptations of Tolkien’s books.\n\nTo call Howe down to earth despite his integral involvement in the multi-award winning, global blockbusters would be an understatement. However, as he settles down on his sofa, dressed in jeans, a plain grey jumper and socks, there’s no hint of a Hollywood-sized ego here.\n\nNow that the final film version of The Hobbit film has come out in cinemas, Canadian-born Howe has come to the end of a long journey that took him from Switzerland to New Zealand and back, over the course of many years.\n\nJohn Howe Jo Fahy\n\n“I always knew that I wanted to draw…I didn’t know it was actually a profession until I finished high school,” Howe told swissinfo.ch. He’s talking about a time that, in his words, is “practically pre-history in terms of the media we know today”.\n\n“Any kid in high school who can draw can put it up on the internet now,” he muses. For him however, starting out was about getting feedback from family and friends, putting a portfolio together and trying to get in to art school.\n\nHe studied near Strasbourg in France before he and his wife were offered jobs in the 1980s on an animated feature film in Lausanne.\n\nFirst images\n\nWhen the Lord of the Rings movie was in its very early stages, the filmmakers came across work by Howe as they begun to shape the look and feel of the film.\n\n“They basically covered the walls of their office with artwork they’d found,” said Howe. “A majority must have been by Alan Lee and myself, so I think we got them by default in a sense.”\n\nHe had illustrated a number of Tolkien calendars in the 1980s and 90s.\n\n“I had no idea who Peter Jackson [the films’ director] was, I’d never seen any of his films,” Howe confessed. He describes setting off to work on the film in New Zealand - in his understated style - as “a bit of an adventure”.\n\nOn set\n\nHowe and Lee used Tolkien’s novels and the script to create the concept art for designers and others in the production team to construct costumes, sets and props.\n\n“Instinctively I knew what I thought things should look like, but there was also a lot of revision,” said Howe. He and Lee would draw the images and then redraw after consulting with Jackson.\n\n2012 Warner Bros. Entertainment Inc. and Metro-Goldwyn-Mayer Pictures Inc.\n\n“Sometimes one drawing can be enough to inform an entire team,” said Howe. He blends the mythical names and vocabulary from The Lord of the Rings and The Hobbit stories into his speech as he talks, so familiar are the concepts to him, they no longer warrant clarification.\n\nIn The Hobbit, Beorn, a warrior who can change into a bear, gives a king, Thorin Oakenshield, and his company of dwarves, shelter in his home.\n\n“For a set like Beorn’s, there would be the initial drawings which would outline the style and the culture behind it. From then on in I think I did possibly a good hundred drawings of each of the carvings, because they’re all different,” recalls Howe.\n\nHowe had to redesign the outside of Beorn's house even though everything had been built and shot, when Jackson decided it wasn’t “quite grand enough” after seeing the finished construction.\n\nDespite events like this, Howe describes the director as “quite amazing” but “easy going”. Overall, Howe and Lee created 6,000-7,000 pieces of artwork for The Lord of the Rings and more for The Hobbit films.\n\nInspiration\n\nEnchanting audiences from the hardcore Tolkien fans to the casual cinema-goer was a task that required extensive research on Howe’s behalf.\n\nIt was an undertaking that seemed to click with Howe, as he showed me his study. Rather than a room filled with paintbrushes and sketches, his workspace consists of a computer on a neat desk, surrounded by walls lined floor to ceiling with books, many of them on mythology, ancient iconography and fantasy creatures.\n\n“You’re not simply illustrating the text as it is, you’re also trying to bring back in some of the author’s sources … and the fascinations the author had,” said Howe, looking around at the books.\n\nHe sees Tolkien’s tales as “an open door” into the world of myth and saga, such as the ‘Nibelunglied’ or the Song of the Nibelungs, an epic poem written in Middle High German or medieval narratives of the legend of King Arthur.\n\nTo have done anything less than thoroughly delve into Tolkien’s way of thinking, would have been “ultimately quite disappointing” he said thoughtfully.\n\n\n\nThe Swiss connection\n\nIn 1911, when J.R.R.Tolkien was 19 years old he came on a walking tour to Switzerland. Numerous Tolkien experts believe various scenes and locations in the books were based on sights he saw during his time in the country, as does Howe.\n\n“I believe the lonely mountain was inspired by his view over the Matterhorn, and that’s very officially noted in the annotated version of The Hobbit,” said Howe.\n\nHe also lists the alpine resort of Grindelwald as “surely” being his inspiration for Rivendell, and Lake-town as being based on the now disproved concept of Swiss Lake dwellers.\n\nWhen asked if he is someone who goes to visit these places to look for the similarities himself, he admits, referring to himself and his wife “we’ve never been to Grindelwald actually, which is really shameful isn’t it! So we must go”.\n\nHe pauses in his characteristic style.\n\n“It’s all about taking the time and trouble to place yourself in a certain perspective. There is great value in making a little personal pilgrimage to these places,” said Howe.\n\n“Just imagine this 19-year-old, doing his walking tour of Switzerland before the war … which he might not have survived, because most of his companions didn’t.”\n\nAfter five years away working on the film projects, Howe is now looking forward to getting back to his pencils and paint, and perhaps even visiting some of the Swiss locations he’s become more familiar with than he may realise, through his illustrations.\n\nIn compliance with the JTI standards\n\nMore: SWI swissinfo.ch certified by the Journalism Trust Initiative"}, {"url": "https://blog.flametreepublishing.com/fantasy-gothic/john-howe", "page_content": "Dragons don't exist.\n\nThat's a shame, of course. Instead we have to rely on the brilliant work of artists to render these fantastic worlds for us. One hugely important figure in the fantasy art world is the artist John Howe. With a much-loved body of work and perhaps best known for his concept art work on The Lord of the Rings and The Hobbit film series, Howe's career is marked with an array of interesting experiences that have resulted in some truly astonishing fantasy art pieces.\n\nImage source\n\n\"Illustration is a proposition, a spontaneous exploration not only of the theme to hand, but also the deeper currents that make imagery necessary.\"\n\nHowe was born isbut educated in France, and after completing his degree in Strasbourg he then went on to study at the\n\nWhilst grateful for the opportunity to study at excellent schools, Howe concedes that his understanding was at odds with his limited language ability. Regardless, he was always drawing. After learning to sketch with his mother's help, a young Howe quickly grew frustrated by what he considered to be his limited ability. He had always endeavoured to be better and had seemingly harnessed this impulse to constantly improve his illustrations. After being muscled out of over-booked art classes in school, Howe instead found ways to apply his artistic talents in other places. In biology class he would draw images of microscopic creatures – renderings that his classmates struggled with – and would give these drawings to them, for a small fee that is. However, now because of his success, fifty cents for an original John Howe is a steal!\n\nThat said, Howe says that anything that was not passed on to others is not likely to have survived up to today. Constantly looking to improve his sketches, he says that he would go over them so many times that eventually there would be nothing left at all, forcing him to start something new. Howe paints a picture of a boy who feels pressure and concern that he is not good enough to succeed. One form of solace Howe did find, however, was in books. Most notably was his reading of J.R.R. Tolkien's The Lord of the Rings series, a work that would have a profound influence on the rest of his life and career.\n\nHowe has a confession regarding these titles though. Due to The Fellowship of the Ring being constantly checked out of the library, he instead opted to skip it and start with the perennially available The Two Towers instead. He naturally followed that with The Return of the King, before finally circling back and reading the first instalment last.\n\nHe admits this may not have been the best choice but makes it clear that he has since re-read the series, this time in the correct sequence. This was probably essential, especially since his appointment (alongside Alan Lee) as a concept artist for Peter Jackson's film trilogy.\n\nThis is Howe's most high-profile appointment to date, allowing him to work on a fictional world he had been enamoured with since boyhood. When the production for The Hobbit film trilogy began, Howe was once again brought on board to detail Tolkien's Middle Earth.\n\nHe has also worked on other big series, such as the movie adaptation of The Lion, the Witch and the Wardrobe; a limited edition cover for George R. R. Martin's A Clash of Kings; as well as illustrations for the hugely popular card game Magic: The Gathering.\n\nBut like any artist, Howe should not be reduced simply to his work on pre-established franchises. Drawing from a wide range of influences across world mythology, Howe has steadily built up an impressive portfolio of images. His work has involved interpreting tales from classics such as Beowulf, as well as creating jaw-dropping worlds built purely from his powerful imagination. Click here to browse all 2478 images in his online portfolio.\n\nA recurring point of interest for Howe has always been dragons. Appearing across a wide selection of canons and subject to a vast array of interpretation, dragon art is something that Howe has long expressed a love for.\n\n\"They span the spectrum from devilry to divinity, from blackest evil to boundless good. They come in all configurations, they speak or they make our minds reel with the power of their thoughts, they squat athwart hoards of treasure untold. They are story. They are dragons.\"\n\n\n\nWe were over the moon when Howe agreed to write the foreword for our book Dragon Art. Covering the appearance of dragons through the course of time and how their representation differs across cultures, there is no better expert to speak on the subject than Howe. Building upon his stellar introduction we were able to craft a book packed with curated images of the highest quality, depicting all sorts of incredible dragon images. Available in print or as an iBook, we're proud to have made a book that Howe himself approves of. To take a closer look at the title, click here.\n\nLinks"}, {"url": "https://quillandpad.com/2020/09/10/how-to-train-a-dragon-jaquet-droz-collaborates-with-john-howe-lord-of-the-rings-and-the-hobbit-illustrator-and-conceptual-artist/", "page_content": "Quill & Pad’s Joshua Munchow would say that watchmaking and sci-fi/fantasy easily appeal to the same kind of person. But Joshua is not the only member of the Quill & Pad team to find joy in two such seemingly disparate subjects: I too am a nerd at heart.\n\nWhich is why the announcement of Jaquet Droz collaborating with John Howe both pleased me and made me realize that the two fit together far better than I imagined. Starting with Jaquet Droz’s past in making androids – perhaps the science fiction items par excellence of their day – this brand is about as creative as it gets in our traditionally minded world of horology.\n\nWho is John Howe?\n\nJohn Howe, the Canadian-born book illustrator and conceptual artist, is best known as one of two chief conceptual designers for the Lord of the Rings film trilogy by Peter Jackson and The Hobbit trilogy. He has also illustrated other items based on the timeless story by J.R.R. Tolkien and other well-known genre classics like Game of Thrones and The Chronicles of Narnia: The Lion, The Witch, and the Wardrobe.\n\nA conceptual artist is responsible for the style and look of a film. His or her sketches aid producers, programmers, and 3D artists in understanding how sets should look and the vibe should feel. The conceptual artist’s sketches are vital to the cohesive development of a feature-length film.\n\nBorn in Vancouver, 63-year-old Howe has lived in Neuchâtel for 30 years. He moved to Europe after graduating from high school, beginning with a university experience in Strasbourg.\n\nHowe is currently busy working on the upcoming Lord of the Rings television series for Amazon Studios – according to reports, set to become the most expensive TV series ever – which began shooting in New Zealand in February 2020. It is expected to stream in 2021.\n\nHowe keeps a rather low profile, so this collaboration with the imaginative La Chaux-de-Fonds-based brand is one that I find eminently exciting.\n\nThe Jaquet Droz dials, as we’ve shown before, do lend themselves very well to artistic endeavors outside “usual” watchmaking. This turn toward the fantasy world could be an immensely exciting collaboration, and not just for nerds like me.\n\nJaquet Droz collaboration with John Howe\n\nHowe’s collaboration with Jaquet Droz marks the first time that he has been approached by a fine watch brand. From reports, Howe worked alongside the brand’s own artisans in the creation of an as-yet not-disclosed timepiece or timepieces.\n\nIt will be exciting to discover what magical, mysterious ideas pop up on the dial of the next Petite Heure Minute or Ateliers d’Art models, which constitute my guesses as to the canvas of the future Howe masterpiece(s). I just hope we don’t have to wait too terribly long to see them!\n\n“The craftsmen and designers at Jaquet Droz strive to bring together precision, poetry, and light in their meticulous work when it comes to materials and movements, something I particularly appreciate,” Howe said. “The technical constraints further stimulated reflection and creativity. Collaborating with Jaquet Droz, renowned for its great creativity, proved to be challenging – but most of all, a real pleasure.”\n\nFor more on John Howe, please visit www.john-howe.com.\n\nYou may also enjoy:\n\nJaquet Droz Petite Heure Minute Tiger: So Lifelike You Expect It To Leap From The Dial\n\nJaquet Droz Loving Butterfly Automaton: Millions Of Years In The Making\n\nJaquet Droz Magic Lotus Automaton: Zen Serenity On The Wrist\n\nAll About Automata: Mechanical Magic (With Action Videos)\n\nJaquet Droz’s Charming Bird Deconstruction By The Naked Watchmaker (Plus Video)"}, {"url": "https://sf-encyclopedia.com/entry/howe_john", "page_content": "Howe, John\n\nEntry updated 12 September 2022. Tagged: Artist, Author.\n\n(1957- ) Canadian artist, now a resident of Switzerland. After formal training in France, he moved to Switzerland to work on an animated film and decided to remain there. He took on a variety of projects, but an invitation to join other artists in contributing to the 1987 and 1988 J R R Tolkien calendars changed his life. Admiring his approach to Tolkien, publishers then assigned Howe to illustrate books by Tolkien, as well as four additional Tolkien calendars (in 1991, 1995, 1997, and 2001). In 1997, when Peter Jackson began working on his three-part film version of The Lord of the Rings (1954-1955 3vols), Howe was hired to serve as the films' conceptual designer, also working as a carpenter on the films; he is now performing similar duties for Jackson's upcoming film trilogy based on The Hobbit (1937; rev 1951; rev 1966). His Tolkien artwork is not unlike that of his most famous predecessor, the Brothers Hildebrandt, though he is noted for his obsessive attention to detail in rendering medieval weaponry, contributing to the generally darker and more mature ambience of his paintings.\n\nOutside of his Tolkien-related work, Howe has done other book covers, almost exclusively for works of Fantasy, including books by Robin Hobb, Guy Gavriel Kay, and David A Gemmell. However, he did paint impressive covers for two paperback volumes of Robert Silverberg's collected stories, Pluto in the Morning Light (coll 1992) and The Secret Sharer (coll 1993), interestingly juxtaposing imagery from sf and fantasy and suggesting that he might have enjoyed equal success had he specialized in sf. [GW]\n\nJohn Howe\n\nborn Vancouver, British Columbia: 21 August 1957\n\nworks\n\nlinks\n\nprevious versions of this entry"}, {"url": "https://www.theonering.net/torwp/2022/06/10/113318-showrunners-and-john-howe-reveal-more-of-rings-of-power/", "page_content": "As September 2nd draws ever closer, we’re seeing more and more glimpses of what is in store in Prime Video’s The Lord of the Rings: The Rings of Power. Most fans will already have seen the amazing images, and read the interviews, from the latest edition of EMPIRE magazine – including artist John Howe’s incredible snow troll sketch, which features on the cover of the special subscriber’s edition.\n\nBack in early May, when staffers Justin and greendragon were invited by Amazon to join a group in London, to see footage from The Rings of Power and to talk with showrunners JD Payne and Patrick McKay, John Howe was also part of the gathering. There were gasps of delight from many in the audience when he was introduced; all were thrilled to have a chance to talk with such a legend. It was also reassuring to hear, from his own mouth, that Howe is actively involved in the design and creation of this new Middle-earth adaptation.\n\nThat same day, Prime Video also treated us to a closer look at three costumes from the show. Stay tuned for more from greendragon on what we saw and heard that day; we’ll also share posts from other sites, YouTubers, tiktokers and fans who were there. To start us off, here are Justin’s reflections:\n\n[Continuing the high levels of secrecy around this show, there were no phones or recording devices allowed; therefore all quotations are paraphrased from notes & recollections.]\n\nAs the lights came up from the very first sneak peek at The Rings of Power footage (some of which we expect in the first proper trailer releasing at SDCC) the nervousness in the air was thick; not only from the thirty or so fans assembled, but also from showrunners Payne and McKay. Will we like them? Are they two of us?\n\n“We were with you all refreshing TheOneRing.net every day for the latest news on Peter Jackson’s films!” McKay told us. These lifelong fans, Ivy League Yale educated, committed to their church, might be closer in disposition to JRR Tolkien than any filmmaker that has come before. They study every book, revision, note, letter, and interview Tolkien ever shared, to understand his motivations and inspirations. It is this thorough knowledge of the context of Tolkien that has inspired confidence from so many Tolkien influencers.\n\nAs the showrunners wrapped up the open-ended Q&A, the biggest surprise of the London trip occurred – artist John Howe walked out with a sketchbook in hand. He explained how he got involved, how much work has been put toward The Rings of Power, and took questions from an awestruck group of scholars, fans and podcasters.\n\n“They just kept asking me to sketch things they were considering. There are 40 sketchbooks full of drawings for this show.” Howe then opened up his sketchbook to the original drawing of the ice troll. I find it very curious that our very first leak from the ROP set were photos of an icy mountain set, then leaks of a snow troll (instead of a cave troll), which carried through to the Super Bowl teaser featuring the troll, and now John Howe’s sketch. Did Amazon leak the icy set pics in the first place, as part of a long marketing game? Or is Prime Video responding to uncontrollable leaks and only revealing what’s already been hinted at? Howe did not turn the page to show any more drawings.\n\nWhen asked how he keeps this new work separate from the award winning (and trademark protected) work with Peter Jackson, John Howe responded with incredible awareness and insight. “We are all professionals here in the room. You all understand running your business. Whether I’m designing for movies, or book covers, or a streaming show, there are creative briefs to respond to. But the people in charge also know what they are getting from all my previous work.” Howe went on to explain that the true creative separation from Jackson’s films is actually INSPIRATION in the new locations this show visits. “We’ve never seen the oceanic areas of Middle-earth, and it is incredibly exciting for me to discover the great seas and areas that haven’t been explored. That is the true departure from what has come before.”\n\nWhile John Howe had a plane to catch, showrunners Payne and McKay hung around with fans for some social conversations in the lobby, where three actual costumes were on display. The two guys held their own in deep lore conversations with several Ph.D.s, such as ‘The Tolkien Professor’ Corey Olsen and Dr. Una McCormack. At any fan event full of world-leading-expert-podcasters, there is a tendency to weed out inauthentic creators with deep lore questions. Again, Payne and McKay held their own. There is a reason the reaction a few weeks ago was unanimously supportive of the showrunners: they know their Tolkien, and they know the lore.\n\nThe Rings of Power showrunner Patrick McKay suddenly confronted me in the lobby, as his conversation circle moved to catch up. Matt (Nerd of the Rings) was shocked at some of the things we talked about – secret things I’m still hesitant to reveal. McKay wanted to know how I felt about the footage. He was extremely interested in my honest opinion. He cares what we think, what our response is to the hard-earned work over the last three years, if we feel he’s doing right by Tolkien and by fans. My direct response was the footage “looked like it should”, as I wrote a few weeks ago. It wasn’t the overwhelming enthusiasm I think he wanted, but that’s the legacy this entire show is up against: the most awarded films in entertainment history make for a high bar set by New Line Cinema.\n\nTo close, here’s one exclusive comment I will share today: McKay was adamant that this sword (below) is NOT Narsil, despite our early spy reports from people who have laid eyes on scenes featuring this sword. We will find out what’s true September 2nd; but I can’t help but remember how adamant JJ Abrams was that Cumberbatch was NOT Kahn. The only job these showrunners had in Hollywood was working for JJ Abrams, before landing this dream gig in Middle-earth…"}, {"url": "https://www.slashfilm.com/858687/lord-of-the-rings-the-rings-of-power-concept-artist-teases-a-very-different-middle-earth/", "page_content": "\"The dwarven kingdom of Moria is not an abandoned mine and the Grey Havens is not yet an abandoned city,\" Howe continued, before adding, \"I loved having the opportunity to explore that unseen history.\" Essentially, this sounds like a version of Middle-earth that's a lot more like the idyllic Shire in which the original trilogy starts, and less like the empty and war-torn landscapes the hobbits explore throughout the \"Lord of the Rings\" series. We'll get to see what that still-developing Middle-earth landscape looks like, and so far, it looks pretty great. In contrast, another upcoming \"Lord of the Rings\" project, the Warner Bros. animated film \"The War Of The Rohirrim,\" will tell a more battle-centric story set in Helm's Deep.\n\nHowe also promises that the new series will explore a part of Middle-earth neither Jackson's original trilogy nor the more recent \"Hobbit\" films have covered: The sea. How describes a crew of ocean-traveling elves as \"daunting and enterprising and almost colonising the world.\" I don't love the colonization of it all, but this sounds like it could be the elven equivalent to pirates, which I'm sure audiences will love.\n\n\"The Lord of the Rings: The Rings of Power\" was made in collaboration with the author's estate, and earlier this year showrunners Patrick McKay and J.D. Payne noted to Vanity Fair that the series has the rights to the \"Rings\" book trilogy, its appendices, and \"The Hobbit.\" The story will have to sidestep anything mentioned in \"The Silmarillion\" or the author's unfinished texts, as those apparently weren't part of the adaptation deal.\n\n\"The Lord of the Rings: The Rings of Power\" will premiere on Prime Video on September 2, 2022."}, {"url": "https://variety.com/2016/film/news/lord-of-the-rings-making-of-backstory-business-1201936646/", "page_content": "When “Lord of the Rings: The Fellowship of the Ring” opened on Dec. 19, 2001, it was the culmination of one of the most audacious and successful bets ever made in the movie business. The three films in the series were shot back to back and grossed $2.9 billion dollars — not bad for a trilogy that very nearly didn’t get made.\n\nWhy did it take so long after the J.R.R. Tolkien books were published to see a “Lord of the Rings” film? And how did Peter Jackson, who wasn’t a well-known director at the time, end up directing all three? Here are some of the steps it took to put “Lord of the Rings” onscreen.\n\nHippies helped the Hobbits: The books were published starting in 1954 in England, but didn’t become popular in the U.S. until the mid-1960s, at the height of the Vietnam War, when war protesters and back-to-the-earth hippies ruled the cultural airwaves. The books became counter-cultural touchstones thanks to their themes of environmental protection and battles against forces of war and corruption.\n\nTolkien was flattered by the success and amazed by the profits. But he was born in 1892, and couldn’t get his head around fans whose idea of a great trip was to ingest “The Lord of the Rings” and LSD simultaneously. Plus, over-enthusiastic readers were invading his privacy, gawking at his house and calling him at all hours with obscure questions.\n\nThe influence grew: Themes from the book were reflected in music by groups such as Led Zeppelin with their song “Ramble On,” and writers including Clive Barker and Stephen King were strongly influenced by Tolkien. George Lucas has often cited the books as an important influence on “Star Wars.”\n\nAn animated attempt: After “One Flew Over the Cuckoo’s Nest” producer Saul Zaentz acquired rights to the books, animator Ralph Bakshi made a feature-length animated film, “J.R.R. Tolkien’s Lord of the Rings.” But until the mid-1990s, when digital special effects started to become more widespread, it was thought the vast mythological universe of elves, Hobbits, wizards and monsters would be too daunting and expensive to reproduce on film. Filmmakers including George Lucas, Steven Spielberg and John Boorman considered trying to adapt the books but ultimately didn’t follow through.\n\nEnter Peter Jackson: While Jackson, a longtime Tolkien fan, was filming his first studio film “The Frighteners,” for Universal, he began considering whether the many recent advances in visual effects might finally make it possible to adapt “The Lord of the Rings” trilogy on film for a reasonable amount of money.\n\nJackson was obligated to bring any project he was considering to Disney-owned Miramax first. It was rumored that Tolkien had included a clause when he sold the rights to the books that any films were not to be made by Disney. Jackson said that he has heard that this was because Tolkien disliked Disney’s 1937 “Snow White and the Seven Dwarfs” — but in the end, Harvey Weinstein-run Miramax ended up making the deal anyway.\n\nIt almost wasn’t Jackson: Jackson thought one way to handle the trilogy would be to make “The Hobbit,” the prequel to the trilogy, first, and then make two films of the next three books. But rights issues meant that Saul Zaentz could only license “Lord of the Rings” to Harvey Weinstein, and not “The Hobbit.” When production costs started to rise, Harvey Weinstein tried to persuade Jackson to make a single “Lord of the Rings” film. Weinstein gave Jackson an ultimatum: “We had to either agree to do it or walk away,” Jackson recalled, “He already had John Madden lined up to direct, and Hossein Amini to write the script.”\n\nBut nobody was interested: Jackson returned to New Zealand to start working on a 35 minute “making of the making of” sample footage video, which would be shown to studios that expressed interest. But no major studios got the chance to see the footage — they all turned Jackson down. It came down to appointments with Polygram — the British independent studio whose Working Title label made “Four Weddings and a Funeral” — and New Line, on the same day Jackson was scheduled to fly back to New Zealand. New Line came through, after Weinstein negotiated an expensive buyout including an executive producer credit.\n\nA whole new scale: It was a production of unprecedented scope: no filmmaker had ever made three films back to back before, or had as large a cast of crew and extras, or made every single prop from scratch. A production team of over 2,400 and 26,000 extras worked on the films for five years. The crew built 64 miniature sets, some so detailed that the larger ones were known as “bigatures.” Jackson decided that every single item in Middle-earth should be made from scratch. “I had to create the most believable world I could. The decision was to make it feel very historical, with the levels of detail creating the illusion that the viewers were immersing themselves in a real world,” said Jackson.\n\nBreaking records: Some of the sets and props were among the most detailed ever made for any film — the walled white castle city of Minas Tirith was the largest set ever built in the Southern Hemisphere, and functioned as a working small city. The huge, elephant-like Mumakil, was the largest prop ever built, and had to be transported to the set in pieces in more than a dozen trucks.\n\nHobbit habitats: In Hobbiton, a vegetable garden was planted a year before filming, to make the domestically gifted Hobbits look at home. Props included more than 900 suits of hand-made armor, more than 20,000 household and everyday items and more than 1,600 pairs of individually-sized prosthetic feet and ears.\n\nGroundbreaking effects: For the first time on any film, a massive computer database stored every single frame shot in a digital library that could instantly access, analyze and cross-reference any single item appearing in the film. Every element in the trilogy could be subject to digitally manipulated, from landscapes to Hobbits and horses.\n\nBattle crowds: Weta’s proprietary crowd behavioral simulation software, dubbed Massive, helped to build the huge battle scenes in The Fellowship of the Ring. Every individual character in the crowd moves in response to the its environment and the actions of other characters.\n\nThe search for Gandalf: New Line encouraged Jackson to cast Sean Connery as Gandalf, and though Jackson, a fan of Connery’s agreed, Connery turned them down. Ian McKellen was the next choice for the role of the wise wizard. But McKellan had committed to appear in “X-Men.” Bob Shaye ran into him at a London restaurant and told him “I was sorry to hear he was busy, because we had really wanted him. I went back to my table, and then a few minutes later, I decided to go back and ask, ‘Just for the record, what is the scheduling conflict?’ He said, ’Well, you’re starting ’Lord of the Rings’ three days before I finish ’X-Men.’ We did fix it of course, and that’s how he got in the movie.”\n\nNot the right fit for Aragorn : The actor cast for the role of Aragorn, Stuart Townsend, was replaced after the first film was already three or four weeks into shooting. He was in nearly every scene, and they all needed to be re-shot. Producers felt the actor needed a little more gravitas, and decided to replace Townsend with Viggo Mortensen. “We had five days in which to find and cast the right person, make the deal and get him on a plane for New Zealand — for 15 months!” said executive producer Mark Ordesky. Mortensen, who is 14 years older than Townsend, seemed born to shoulder the role of the mysterious human warrior — it was even said he was living in the forest in Aragorn’s mud-stained clothes.\n\nAn unknown quantity: No one knew how the film would be received until 26 minutes was shown at the Cannes Film Festival in May 2001. “Media reaction ranged from upbeat to wildly enthusiastic,” reported Variety. The party, too, was one of the festival’s best: “It‘s hard to remember a pic with a splashier launch here,” Variety wrote. Party guests marveled at the walk-through Hobbit house, the swan boat floating in the misty swimming pool, and performers dressed as Middle Earthlings distributed throughout the castle’s expansive grounds.\n\nNo testing necessary: When “The Fellowship of the Ring” was released on Dec. 19, 2001, September 11 was fresh in viewers’ minds. Films mentioning terrorism, the World Trade Center and airplanes were put on hold. Filmgoers were in the mood for pure escapism, preferably stories with strong heroes. The film was never pre-previewed or tested with audiences, Jackson noted.\n\nFans were key: “During our whole process of production on the film, we would stay in touch with the core fans all around the world through these Internet sites, even involve them in the process as casting ideas arose, getting feedback from them,” said New Line’s Michael Lynne. “Peter was one of those crazy, goofy fans, so he understood that.” To the delight of hundreds of devoted fans, Jackson and several cast members showed up at the Oscar night fan celebration down the street from the Oscars at the parties for both “Fellowship” and “Return.”"}]}