{"John Howe was born on August 21, 1957.": [{"url": "https://sf-encyclopedia.com/entry/howe_john", "page_content": "Howe, John\n\nEntry updated 12 September 2022. Tagged: Artist, Author.\n\n(1957- ) Canadian artist, now a resident of Switzerland. After formal training in France, he moved to Switzerland to work on an animated film and decided to remain there. He took on a variety of projects, but an invitation to join other artists in contributing to the 1987 and 1988 J R R Tolkien calendars changed his life. Admiring his approach to Tolkien, publishers then assigned Howe to illustrate books by Tolkien, as well as four additional Tolkien calendars (in 1991, 1995, 1997, and 2001). In 1997, when Peter Jackson began working on his three-part film version of The Lord of the Rings (1954-1955 3vols), Howe was hired to serve as the films' conceptual designer, also working as a carpenter on the films; he is now performing similar duties for Jackson's upcoming film trilogy based on The Hobbit (1937; rev 1951; rev 1966). His Tolkien artwork is not unlike that of his most famous predecessor, the Brothers Hildebrandt, though he is noted for his obsessive attention to detail in rendering medieval weaponry, contributing to the generally darker and more mature ambience of his paintings.\n\nOutside of his Tolkien-related work, Howe has done other book covers, almost exclusively for works of Fantasy, including books by Robin Hobb, Guy Gavriel Kay, and David A Gemmell. However, he did paint impressive covers for two paperback volumes of Robert Silverberg's collected stories, Pluto in the Morning Light (coll 1992) and The Secret Sharer (coll 1993), interestingly juxtaposing imagery from sf and fantasy and suggesting that he might have enjoyed equal success had he specialized in sf. [GW]\n\nJohn Howe\n\nborn Vancouver, British Columbia: 21 August 1957\n\nworks\n\nlinks\n\nprevious versions of this entry"}, {"url": "https://www.celebsagewiki.com/john-howe-illustrator", "page_content": "Age, Biography and Wiki\n\nJohn Howe was born on 21 August, 1957 in Vancouver, Canada, is a Canadian illustrator, best known for his work based on J. R. R. Tolkien's worlds. Discover John Howe's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 65 years old?\n\nPopular As N/A Occupation N/A Age 65 years old Zodiac Sign Leo Born 21 August 1957 Birthday 21 August Birthplace Vancouver, Canada Nationality Canadian\n\nWe recommend you to check the complete list of Famous People born on 21 August. He is a member of famous with the age 65 years old group.\n\nJohn Howe Height, Weight & Measurements\n\nAt 65 years old, John Howe height not available right now. We will update John Howe's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is John Howe's Wife?\n\nHis wife is Fataneh\n\nFamily Parents Not Available Wife Fataneh Sibling Not Available Children Not Available\n\nJohn Howe Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is John Howe worth at the age of 65 years old? John Howe’s income source is mostly from being a successful . He is from Canadian. We have estimated John Howe's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nJohn Howe Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia John Howe Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.celebsagewiki.com/john-howe", "page_content": "Age, Biography and Wiki\n\nJohn Howe was born on 21 August, 1957 in Vancouver, British Columbia, Canada, is an Art Department, Actor, Art Director. Discover John Howe's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 64 years old?\n\nPopular As N/A Occupation art_department,actor,art_director Age 65 years old Zodiac Sign Leo Born 21 August 1957 Birthday 21 August Birthplace Vancouver, British Columbia, Canada Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 21 August. He is a member of famous Art Department with the age 65 years old group.\n\nJohn Howe Height, Weight & Measurements\n\nAt 65 years old, John Howe height not available right now. We will update John Howe's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is John Howe's Wife?\n\nHis wife is Fataneh (? - present) ( 1 child)\n\nFamily Parents Not Available Wife Fataneh (? - present) ( 1 child) Sibling Not Available Children Not Available\n\nJohn Howe Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is John Howe worth at the age of 65 years old? John Howe’s income source is mostly from being a successful Art Department. He is from Canada. We have estimated John Howe's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Art Department\n\nJohn Howe Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://deadorkicking.com/john-howe-dead-or-alive-2/", "page_content": "How Old Is John Howe? John Howe Birthday\n\nJohn Howe was born on August 21, 1957 and is 65 years old now.\n\nBirthday: August 21, 1957\n\nHow Old - Age: 65\n\nJohn Howe Death Fact Check\n\nJohn is alive and kicking and is currently 65 years old.\n\nPlease ignore rumors and hoaxes.\n\nIf you have any unfortunate news that this page should be update with, please let us know using this form .\n\nJohn Howe - Biography\n\nJohn Howe was born on August 21, 1957 in Vancouver, British Columbia, Canada. He is known for his work on The Lord of the Rings: The Fellowship of the Ring (2001), The Lord of the Rings: The Two Towers (2002) and The Lord of the Rings: The Return of the King (2003). He is married to Fataneh. They have one child."}, {"url": "https://tolkiengateway.net/wiki/John_Howe", "page_content": "\"I shan't call it the end, till we've cleared up the mess.\" — Sam\n\nThis article or section needs to be cleaned up to conform to a higher standard of article quality.\n\nJohn Howe Biographical information Born 21 August, 1957 Location Switzerland Website John-Howe.com\n\nJohn Howe is a Canadian illustrator most known for illustrating many works of J.R.R. Tolkien as well as working on both The Lord of the Rings and The Hobbit film series. Most recently he has worked as a concept artist for The Lord of the Rings: The Rings of Power television series. [1]\n\nJohn Howe was born in Vancouver, Canada.[2] He graduated from the École des Arts Dècoratifs of Strasbourg[2] in 1981, having obtained a Diploma in Illustration.[3] He now lives in Neuchatel with his wife Fataneh and his son Dana.[2]\n\nHowe first read The Lord of the Rings in high school, borrowing them from his school library. He started with The Two Towers, because \"everyone who started the first volume never got any further\" and The Fellowship of the Ring was rarely available to borrow.[4] He was inspired by artwork from The Brothers Hildebrandt to start creating illustration of Tolkien's works.[4]\n\nHowe's version of Boromir is based on his own face.[5]\n\nInvolvement in Peter Jackson's Middle-earth film series [ edit | edit source ]\n\nJohn Howe and Alan Lee worked as the chief conceptual designers on The Lord of the Rings trilogy.[6] Howe is also credited as a carpenter in the first two films.[6] [7] He has a cameo as one of the nine Kings of Men in the Prologue of The Lord of the Rings: The Fellowship of the Ring. Howe and Lee returned to work as conceptual designers for The Hobbit film series. They both make an uncredited appearance as a men-musicians of Laketown in The Desolation of Smaug.[8]\n\nArtwork theft [ edit | edit source ]\n\nIn the night of 18 May 1997, 11 of Howe's originals were stolen from the Médiathèque of Sedan in Belgium. The thief's father contacted the Médiathèque a couple weeks later promising to try to retrieve the stolen works from his son. 8 originals were finally returned, one (Minas Tirith) was damaged beyond repair. Éowyn and the Nazgûl, Gandalf the Grey, and The Uruk-hai were never recovered.[9]\n\nPublished Artwork [ edit | edit source ]\n\nHowe is one of HarperCollins' most used artists, and his cover art is frequently featured on translations as well.\n\nMultiple editions [ edit | edit source ]\n\nCalendars and books [ edit | edit source ]\n\n\"Illustrating Tolkien means treading warily, dipping one's brush in shadow and rinsing them in light. Battle and balance, down the impossible path between the clear and the obscure.\" ― John Howe on painting Middle-earth, Tolkien's World.\n\n\"It was this place in North Island, and we wandered round these fields saying, well, Bag End can go here, that can be our party tree; it was very exciting. It's almost even more fun to have a location imposed upon you, because you really have to get down to brass tacks and figure it out, imagine it on paper. It's a real illustrator's job.\" ― John Howe on working for Weta, Interview.\n\nSee also [ edit | edit source ]"}, {"url": "https://pantheon.world/profile/person/John_Howe_(illustrator)", "page_content": "John Howe\n\nJohn Howe (born August 21, 1957) is a Canadian book illustrator and conceptual designer, best-known for his artwork of J. R. R. Tolkien's Middle-earth. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town. Howe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of John Howe has received more than 27,871 page views. His biography is available in 19 different languages on Wikipedia . John Howe is the 2,385th most popular religious figure (down from 2,083rd in 2019), the 439th most popular biography from Canada (down from 400th in 2019) and the 6th most popular Canadian Religious Figure."}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Creator/JohnHowe", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Creator/JohnHowe\n\nGo To\n\nJohn Howe (born August 21, 1957) is a Canadian book illustrator and conceptual designer.\n\nIn his youth, he was influenced by the works Frank Frazetta and Brothers Hildebrandt, which helped him discover his own style of artwork. As a teen, he like to read what Tolkien wrote and started to create works based on Tolkien's Legendarium. Howe achieved much of his fame for his Fantasy Art by working as a chief conceptual designer along with Alan Lee for Peter Jackson's The Lord of the Rings. He has expertise in ancient and medieval armour and armaments, which influenced the way he portrays the medieval world in fantasy. Howe is also serving as a conceptual designer for Amazon's The Lord of the Rings: The Rings of Power.\n\nFroud's homepage can be found here .\n\nNotable Projects:"}, {"url": "https://fixquotes.com/authors/john-howe.htm", "page_content": "Facts about John Howe\n\nSummary\n\nZodiac:\n\nJohn Howe is a famous Artist from Canada, he/she is 65 years old and still alive, born August 21, 1957.He/she is born under the zodiac leo, who is known for Ruling, Warmth, Generosity, Faithful, Initiative. Our collection contains 2 quotes who is written / told by John."}, {"url": "https://alchetron.com/John-Howe-(illustrator)", "page_content": "John Howe (born August 21, 1957) is a Canadian book illustrator, living in Neuchâtel, Switzerland. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\nHe is best known for his work based on J. R. R. Tolkien's worlds. Howe and noted Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy, and Howe also did the illustration for the Lord of the Rings board game created by Reiner Knizia. Howe also re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work is however not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf (he also illustrated Knizia's board game Beowulf: The Legend). Howe illustrated many other books, amongst which many belong to the fantasy genre (Robin Hobb's books for instance.) He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis. In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, complete with numerous illustrations by Howe.\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson both consulted with Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\nHowe is a member of the living history group the Company of Saynt George, and has considerable expertise in ancient and medieval armour and armaments.\n\nBiography\n\nJohn Howe was born in Vancouver, British Columbia. He was drawing from pre-school age, with his mother's help for his \"more ambitious renderings\". Around primary school age he found his mother's ability no longer living up to his expectations, and even got frustrated once at both his mother and himself at not being able to draw a cow to his expectations. Howe's school years were complicated by moves which took place with a timing that left the art classes full, and left him in classes like power mechanics. He did find his ability as a draughtsman to be profitable in biology class though, where he and a friend would produce renderings of microscopic organisms for classmates at fifty cents each. As a child, he collected the covers of paperbacks. His collection included items from Frank Frazetta, Barry Smith, and Bernie Wrightson. In his adolescence, Howe read The Lord of the Rings trilogy by J. R. R. Tolkien. He said he got \"a real spark\" from the Hildebrandt calendars, which showed him that the books could be illustrated. Howe made drawings of his own versions of the scenes depicted in the calendar. These drawings, according to Howe, may not have survived.\n\nA year after his high school graduation, Howe found himself in Strasbourg, France attending college. The following year, he enrolled into the École des arts décoratifs. He cites his experience of this period as follows:\n\n\"The first year was spent not understanding much, the second at odds with what I did manage to understand, and the third eager to get out, although in retrospect I certainly owe whatever clarity of thought I possess to the patience of the professor of Illustration.\"\n\nThroughout his first years in Europe, Howe was taking in as much as he could in the way of art, architecture and everything that was \"simultaneously ancient and novel.\" He says the only piece of his art work that survived from this period is his \"The Lieutenant of the Black Tower of Barad-dûr\", a piece inspired by Tolkien's, The Lord of the Rings. He says if this is not his first published piece, it must certainly be the earliest. Howe's earliest commissions included political cartoons, magazine illustrations, comics, animated films, advertising, of which he says were nightmares. He said that he would end up redoing sketches so many times that there was nothing left of \"his\" in them. This frustrated him, and he wondered how he would ever make it in the profession.\n\nSince the earlier days of his career, Howe has managed to find his place in the profession of art. Working on such well-known projects as: The Lord of the Rings, J.R.R. Tolkien's Books and Merchandise, Beowulf, Robin Hobb's books, The Lion, The Witch, and The Wardrobe, Cards for Magic: The Gathering, The Hobbit, Pan's Labyrinth. Howe has also written and illustrated children's books.\n\nSelected works\n\nThe Fisherman & His Wife, transl. from Brothers Grimm (Mankato MN: Creative Education, 1983). ISBN 0871919370 — picture book\n\nThe Enchanted World: Night Creatures (Time Life, 1985)\n\nThe Enchanted World: Water Spirits (Time Life, 1985)\n\nThe Enchanted World: Dwarfs (Time Life, 1985)\n\nThe Enchanted World: Giants and Ogres (Time Life, 1985)\n\nRip Van Winkle by Washington Irving, retold by John Howe (Little, Brown and Co., 1988) ISBN 0316375780\n\nJack and the Beanstalk, retold by John Howe (Little, Brown and Co., 1989) ISBN 0316375799\n\nKnights: A 3-Dimensional Exploration (Tango Books, 1995) ISBN 978-1-85707-071-2\n\nThe Knight With the Lion: The Story of Yvain (Little, Brown and Co., 1996) ISBN 978-0-316-37583-2\n\nA Diversity of Dragon by Anne McCaffrey with Richard Woods (Atheneum Books for Young Readers, 1997) ISBN 978-0-689-31868-9\n\nImages of Middle-Earth (HarperCollins, 2000) ISBN 978-0-261-10310-8\n\nThe King of Winter's Daughter (Little, Brown and Co., 2005) ISBN 978-0-316-88837-0\n\nFantasy Encyclopedia (Kingfisher, 2005)\n\nMyth and Magic: The Art of John Howe (Barnes & Noble, 2006) ISBN 978-0-7607-8686-4\n\nFantasy Art Workshop (Impact Books, 2007) ISBN 978-1-60061-009-7\n\nForging Dragons: Inspirations, Approaches and Techniques for Drawing and Painting Dragons (David and Charles, 2008) ISBN 978-1-60061-323-4\n\nFantasy Drawing Workshop (Impact Books, 2009) ISBN 978-1-60061-773-7\n\nLost Worlds (Kingfisher, 2009) ISBN 978-0-7534-6107-5\n\nExhibitions\n\nGalerie Librairie La Marge, Lausanne, (Switzerland) December 1983\n\nThe Pendragon Gallery, Annapolis, Maryland, August 1991\n\nFestival de la Bande Dessinée de Sierre, Sierre (Switzerland) June 1995\n\nLa Bibliothèque des Jeunes, Le Locle (Switzerland) Oct/Nov 1995\n\nLibrairie-Galerie Repères et Merveilles, Bienne (Switzerland) 1995\n\nFestival du Livre de la Jeunesse, Troyes, (France) September 1996\n\nGalerie Ziggourat, Brussels, 1997\n\nMusee des Beaux-Arts du Locle, Le Locle (Switzerland) May 3 to June 22, 1997\n\nJohn Howe/Images de Tolkien:\n\nNovember 7 to December 30, 1995 - Médiathèque de Saint-Herblain (Nantes)\n\nJanuary 17 to March 9, 1996 - Les Silos, Chaumont\n\nMarch 22 to April 21, 1996 - Maison du Boulanger, Troyes\n\nSeptember 19 to October 26, 1996 - Médiathèque d'Épernay\n\nJanuary 9 to February 7, 1997 - École des Arts Décoratifs de Strasbourg\n\nFebruary 25 to March 22, 1997 - Médiathèque de Sedan\n\nApril 1 to 13,1997 - Revin (Association Lire Malgré Tout)\n\nApril 30 to May 4, 1997 - Salon International du Livre et de la Presse, Geneva\n\nSeptember 20 to October 19 and November 19 to December 28, 1997 - La Maison d'Ailleurs, Yverdon-les- Bains (Switzerland)\n\nOctober 24 to November 16, 1997- L'Épée d'Eowyn/Rencontres Tolkien, Sierrre (Switzerland)\n\nEcailles, Ailes, Griffes et Feu/Illustrations for A Diversity of Dragons - La Maison d'Ailleurs, Yverdon-les- Bains (Switzerland), October 21 to November 16, 1997\n\nLibrarie La Bulle - Fribourg (Switzerland) November 24 to December 15, 2000\n\nLes Etonnants Voyageurs - Saint-Malo (France) May 2001\n\nLucca Comics and Games - Lucca (Italy) 2001\n\nJohn HOWE/ Sur les Terres de Tolkien\n\nSeptember 27 to October 2002 - Médiathèque le l'Agglomeration Troyenne, Troyes\n\nOctober 30 to November 3, 2002 - Utopiales (Festival International de Sciènce-Fiction de Nantes), Nantes\n\nNovember 29 to December 1, 2002 - Festival Rifl Act Fiction, Lyon\n\nDecember 10, 2002 to January 11, 2003 - Canadian Cultural Center, Paris\n\nMarch 29 to April 5, 2003 - Rencontres Tolkien, Bibliothèque de l'Université Rennes 2, Campus Villejean, Rennes, Franc\n\nMay 6 to 31, 2003 - Bibliothèque Municipale, Charleville-Mézières, France\n\nJuly 1 to 7, 2003 - Neuchâtel International Fantasy Film Festival, (Theatre du Passage), Neuchâtel, Switzerland\n\nSeptember 29 to November 9, 2003 - Gruyères, (Gruyères Castle), Switzerland\n\nJanuary 3 to 25, 2004 - Médiatheque, Annecy, France\n\nFebruary 7 to 28, 2004 - Médiatheque, Châlons-en-Champagne, France\n\nMarch 9 to 27, 2004 - Médiatheque, Saint-Nazaire, France\n\nBibliothèque nationale de France, Paris, 14.12.2003-15.02.2004 (120 drawings by Alan Lee & John Howe).\n\nJohn Howe: Lord of the Brush / Le Seigneur des Pinceaux\n\nEmbassy of Canada Prince Takamado Gallery, Tokyo - February 27 to March 31, 2006\n\nJohn Howe: Périples en Terre du Milieu, Médiathèque de Bourgoin-Jallieu, Bourgoin-Jallieu, France - April 17 to May 12, 2007\n\nJohn Howe 2007: Saint-Ursanne La Fantastique, Saint-Ursanne, Switzerland - June 23 to September 2, 2007 (Exhibitions, concerts, conferences by Vincent Ferré, installations, etc.)"}], "John Howe is Canadian illustrator.": [{"url": "https://www.wikiwand.com/en/John_Howe_(illustrator)", "page_content": "John Howe (born August 21, 1957) is a Canadian book illustrator and conceptual designer, best-known for his artwork of J. R. R. Tolkien's Middle-earth.[1] One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\nCanadian illustrator, best known for his artwork of J. R. R. Tolkien's Middle-earth\n\nQuick facts: John Howe, Born, Nationality, Education, Know... ▼\n\nHowe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy. Howe illustrated the Lord of the Rings board game created by Reiner Knizia, and re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work includes images of mythological material such as the Old English epic poem Beowulf (including Knizia's board game Beowulf: The Legend). Howe illustrated many books in the fantasy genre, such as those by Robin Hobb. He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis, The Chronicles of Narnia.[1] In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, with numerous illustrations by Howe.\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.[2]\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson consulted with both Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\nHowe is a member of the living history group the Company of Saynt George, and has expertise in ancient and medieval armour and armaments.\n\nHowe also served as a conceptual designer for Amazon's The Lord of the Rings: The Rings of Power, which premiered on Prime Video on September 2, 2022.[3]"}, {"url": "https://www.arenaillustration.com/artists/john-howe/", "page_content": "John Howe\n\nJohn Howe is a Canadian illustrator, after obtaining an illustration degree in France, he settled in Switzerland. He has travelled extensively in imaginary worlds: Robin Hobb, Robert Holdstock, and especially J. R. R. Tolkien’s Middle Earth, spending the better part of a decade in New Zealand in the company of hobbits, elves and dwarves for Peter Jackson’s trilogies the Lord of the Rings and the Hobbit.\n\nJohn is especially fascinated by history, art and architecture. When he is not roaming through the pages of his extensive library of old volumes of folklore, myth and legend, he is out wandering in the mountains and forests where he lives. This rich tapestry of interwoven threads of history and imagination is an enduring source of inspiration.\n\nHe has an abiding fascination with dragons, and is the narrator of a four-part mini-series produced by Arte Television, which saw John and his film crew follow their tracks through Europe and China. “Dragons!” has been broadcast worldwide.\n\nBesides exploring Middle Earth, John has illustrated many children’s books, created how-to books on fantasy art, and has illustrated Beowulf, Arthurian legend and many other sagas. He teaches drawing one day a week at a local school and has given master classes as far away as Beijing."}, {"url": "https://www.goodreads.com/author/show/34748.John_Howe", "page_content": "John Howe\n\nBorn\n\nAugust 21, 1957\n\nWebsite\n\nGenre\n\nJohn Howe is a Canadian book illustrator, living in Neuchâtel, Switzerland. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\n\n\nHe is best known for his work based on J. R. R. Tolkien's worlds. Howe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy, and Howe also did the illustration for the Lord of the Rings board game created by Reiner Knizia. Howe also re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work is not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf (he also illustrated Knizi\n\nJohn Howe is a Canadian book illustrator, living in Neuchâtel, Switzerland. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\n\n\nHe is best known for his work based on J. R. R. Tolkien's worlds. Howe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy, and Howe also did the illustration for the Lord of the Rings board game created by Reiner Knizia. Howe also re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work is not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf (he also illustrated Knizia's board game Beowulf: The Legend). Howe illustrated many other books, amongst which many belong to the fantasy genre (Robin Hobb's books for instance.) He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis. In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, complete with numerous illustrations by Howe.\n\n\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.\n\n\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson both consulted with Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\n\n\nHowe is a member of the living history group the Company of Saynt George, and has considerable expertise in ancient and medieval armour and armaments.\n\n\n\nLibrarian note: There is more than one author in the Goodreads database with this name.\n\n\n\nJohn^^Howe"}, {"url": "https://tolkiengateway.net/wiki/John_Howe", "page_content": "\"I shan't call it the end, till we've cleared up the mess.\" — Sam\n\nThis article or section needs to be cleaned up to conform to a higher standard of article quality.\n\nJohn Howe Biographical information Born 21 August, 1957 Location Switzerland Website John-Howe.com\n\nJohn Howe is a Canadian illustrator most known for illustrating many works of J.R.R. Tolkien as well as working on both The Lord of the Rings and The Hobbit film series. Most recently he has worked as a concept artist for The Lord of the Rings: The Rings of Power television series. [1]\n\nJohn Howe was born in Vancouver, Canada.[2] He graduated from the École des Arts Dècoratifs of Strasbourg[2] in 1981, having obtained a Diploma in Illustration.[3] He now lives in Neuchatel with his wife Fataneh and his son Dana.[2]\n\nHowe first read The Lord of the Rings in high school, borrowing them from his school library. He started with The Two Towers, because \"everyone who started the first volume never got any further\" and The Fellowship of the Ring was rarely available to borrow.[4] He was inspired by artwork from The Brothers Hildebrandt to start creating illustration of Tolkien's works.[4]\n\nHowe's version of Boromir is based on his own face.[5]\n\nInvolvement in Peter Jackson's Middle-earth film series [ edit | edit source ]\n\nJohn Howe and Alan Lee worked as the chief conceptual designers on The Lord of the Rings trilogy.[6] Howe is also credited as a carpenter in the first two films.[6] [7] He has a cameo as one of the nine Kings of Men in the Prologue of The Lord of the Rings: The Fellowship of the Ring. Howe and Lee returned to work as conceptual designers for The Hobbit film series. They both make an uncredited appearance as a men-musicians of Laketown in The Desolation of Smaug.[8]\n\nArtwork theft [ edit | edit source ]\n\nIn the night of 18 May 1997, 11 of Howe's originals were stolen from the Médiathèque of Sedan in Belgium. The thief's father contacted the Médiathèque a couple weeks later promising to try to retrieve the stolen works from his son. 8 originals were finally returned, one (Minas Tirith) was damaged beyond repair. Éowyn and the Nazgûl, Gandalf the Grey, and The Uruk-hai were never recovered.[9]\n\nPublished Artwork [ edit | edit source ]\n\nHowe is one of HarperCollins' most used artists, and his cover art is frequently featured on translations as well.\n\nMultiple editions [ edit | edit source ]\n\nCalendars and books [ edit | edit source ]\n\n\"Illustrating Tolkien means treading warily, dipping one's brush in shadow and rinsing them in light. Battle and balance, down the impossible path between the clear and the obscure.\" ― John Howe on painting Middle-earth, Tolkien's World.\n\n\"It was this place in North Island, and we wandered round these fields saying, well, Bag End can go here, that can be our party tree; it was very exciting. It's almost even more fun to have a location imposed upon you, because you really have to get down to brass tacks and figure it out, imagine it on paper. It's a real illustrator's job.\" ― John Howe on working for Weta, Interview.\n\nSee also [ edit | edit source ]"}, {"url": "https://www.celebsagewiki.com/john-howe-illustrator", "page_content": "Age, Biography and Wiki\n\nJohn Howe was born on 21 August, 1957 in Vancouver, Canada, is a Canadian illustrator, best known for his work based on J. R. R. Tolkien's worlds. Discover John Howe's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 65 years old?\n\nPopular As N/A Occupation N/A Age 65 years old Zodiac Sign Leo Born 21 August 1957 Birthday 21 August Birthplace Vancouver, Canada Nationality Canadian\n\nWe recommend you to check the complete list of Famous People born on 21 August. He is a member of famous with the age 65 years old group.\n\nJohn Howe Height, Weight & Measurements\n\nAt 65 years old, John Howe height not available right now. We will update John Howe's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is John Howe's Wife?\n\nHis wife is Fataneh\n\nFamily Parents Not Available Wife Fataneh Sibling Not Available Children Not Available\n\nJohn Howe Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is John Howe worth at the age of 65 years old? John Howe’s income source is mostly from being a successful . He is from Canadian. We have estimated John Howe's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nJohn Howe Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia John Howe Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.representing-sir-gawain-and-the-green-knight.com/john-howe", "page_content": "John Howe (1957 to present) is a Canadian illustrator (currently living in Switzerland). Howe grew up in British Columbia and moved to France to study illustration at the Ecoles des Arts Décoratifs de Strasbourg. Howe has been influential on fantasy visual language generally through his work on the Tolkien Mythos.\n\n\n\nThe most enduringly popular Middle-earth artist...his work has appeared in numerous books and calendars…and earned him a role as a conceptual artist for Peter Jackson’s The Hobbit and The Lord of the Rings movies (Sisto and Marchese, 2022).\n\n\n\nThe image shown here was also created for a Tolkien work, his translation of Sir Gawain and the Green Knight, an edition published by HarperCollins (1995) which features Howe’s landscape as the jacket cover. Howe’s image which depicts the confrontation at the Green Chapel; the place in the wilderness that Gawain has journeyed to in order to receive the return blow from the Green Knight’s axe, emphasises the link between the Green Knight and nature. The figures are situated in verdant undulating land, the Green Knight is shown as a giant, seemingly an outcrop of the landscape as much as the large standing stones that define the mid-ground. For Gentile (2014) writing in Storytelling, Self, Society, Howe’s image has resonance with the trope of the wild man generally, the description below fitting well with the broad, hirsute figure confronting Gawain in Howe’s painting.\n\n\n\nThe idea of the Wild Man has also inspired artists’ working images of the Green Knight, such as John Howe, whose illustration of the Wild Man/Green Knight appears on the cover of an edition of J. R. R. Tolkein’s translation of the poem…“The ‘classic’ Wild Man of the later Middle Ages,” writes Malcolm Jones in Medieval Folklore, “is covered in shaggy hair (except for face, hands, and feet), frequently wears a wreath of leaves around his head, and wields a club, usually a branch” (433). Clearly, this description resonates significantly with the Green Knight, whose beard and long hair as well as his holly cluster all show some connection to the image of the medieval Wild Man (Gentile, 2014:234).\n\n\n\nThe diminished scale of Gawain in Howe's image compared to the Green Knight and the landscape combined with the atmospheric sky overhead reference deep time and the ways that nature at large dwarfs the constructed world of Arthur’s court, symbolised in the pentangle on Gawain’s shield, a geometric symbol for chivalric authority and moral standing.\n\n​\n\nReferences\n\n\n\nGentile, J (2014) Shape-Shifter in the Green: Performing Sir Gawain and the Green Knight. Storytelling, Self, Society, 10(2):220–243. https://doi.org/10.13110/storselfsoci.10.2.0220.\n\n\n\nSisto, A. and Marchese, S. (2022) 229 – Always Reaching: An Interview with John Howe. [online] The Prancing Pony Podcast. Available at: https://theprancingponypodcast.com/2021/11/14/229-always-reaching-an-interview-with-john-howe [Accessed 23 May 2022].\n\n\n\nTolkien, J. (1995) Sir Gawain and the Green Knight. London: HarperCollins.\n\n"}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Creator/JohnHowe", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Creator/JohnHowe\n\nGo To\n\nJohn Howe (born August 21, 1957) is a Canadian book illustrator and conceptual designer.\n\nIn his youth, he was influenced by the works Frank Frazetta and Brothers Hildebrandt, which helped him discover his own style of artwork. As a teen, he like to read what Tolkien wrote and started to create works based on Tolkien's Legendarium. Howe achieved much of his fame for his Fantasy Art by working as a chief conceptual designer along with Alan Lee for Peter Jackson's The Lord of the Rings. He has expertise in ancient and medieval armour and armaments, which influenced the way he portrays the medieval world in fantasy. Howe is also serving as a conceptual designer for Amazon's The Lord of the Rings: The Rings of Power.\n\nFroud's homepage can be found here .\n\nNotable Projects:"}, {"url": "https://quillandpad.com/2020/09/10/how-to-train-a-dragon-jaquet-droz-collaborates-with-john-howe-lord-of-the-rings-and-the-hobbit-illustrator-and-conceptual-artist/", "page_content": "Quill & Pad’s Joshua Munchow would say that watchmaking and sci-fi/fantasy easily appeal to the same kind of person. But Joshua is not the only member of the Quill & Pad team to find joy in two such seemingly disparate subjects: I too am a nerd at heart.\n\nWhich is why the announcement of Jaquet Droz collaborating with John Howe both pleased me and made me realize that the two fit together far better than I imagined. Starting with Jaquet Droz’s past in making androids – perhaps the science fiction items par excellence of their day – this brand is about as creative as it gets in our traditionally minded world of horology.\n\nWho is John Howe?\n\nJohn Howe, the Canadian-born book illustrator and conceptual artist, is best known as one of two chief conceptual designers for the Lord of the Rings film trilogy by Peter Jackson and The Hobbit trilogy. He has also illustrated other items based on the timeless story by J.R.R. Tolkien and other well-known genre classics like Game of Thrones and The Chronicles of Narnia: The Lion, The Witch, and the Wardrobe.\n\nA conceptual artist is responsible for the style and look of a film. His or her sketches aid producers, programmers, and 3D artists in understanding how sets should look and the vibe should feel. The conceptual artist’s sketches are vital to the cohesive development of a feature-length film.\n\nBorn in Vancouver, 63-year-old Howe has lived in Neuchâtel for 30 years. He moved to Europe after graduating from high school, beginning with a university experience in Strasbourg.\n\nHowe is currently busy working on the upcoming Lord of the Rings television series for Amazon Studios – according to reports, set to become the most expensive TV series ever – which began shooting in New Zealand in February 2020. It is expected to stream in 2021.\n\nHowe keeps a rather low profile, so this collaboration with the imaginative La Chaux-de-Fonds-based brand is one that I find eminently exciting.\n\nThe Jaquet Droz dials, as we’ve shown before, do lend themselves very well to artistic endeavors outside “usual” watchmaking. This turn toward the fantasy world could be an immensely exciting collaboration, and not just for nerds like me.\n\nJaquet Droz collaboration with John Howe\n\nHowe’s collaboration with Jaquet Droz marks the first time that he has been approached by a fine watch brand. From reports, Howe worked alongside the brand’s own artisans in the creation of an as-yet not-disclosed timepiece or timepieces.\n\nIt will be exciting to discover what magical, mysterious ideas pop up on the dial of the next Petite Heure Minute or Ateliers d’Art models, which constitute my guesses as to the canvas of the future Howe masterpiece(s). I just hope we don’t have to wait too terribly long to see them!\n\n“The craftsmen and designers at Jaquet Droz strive to bring together precision, poetry, and light in their meticulous work when it comes to materials and movements, something I particularly appreciate,” Howe said. “The technical constraints further stimulated reflection and creativity. Collaborating with Jaquet Droz, renowned for its great creativity, proved to be challenging – but most of all, a real pleasure.”\n\nFor more on John Howe, please visit www.john-howe.com.\n\nYou may also enjoy:\n\nJaquet Droz Petite Heure Minute Tiger: So Lifelike You Expect It To Leap From The Dial\n\nJaquet Droz Loving Butterfly Automaton: Millions Of Years In The Making\n\nJaquet Droz Magic Lotus Automaton: Zen Serenity On The Wrist\n\nAll About Automata: Mechanical Magic (With Action Videos)\n\nJaquet Droz’s Charming Bird Deconstruction By The Naked Watchmaker (Plus Video)"}, {"url": "https://www.howold.co/person/john-howe-illustrator", "page_content": "John Howe Canadian illustrator\n\nJohn Howe is a 65 years old Canadian illustrator from . John Howe was born on August 21, 1957 in .\n\nAbout\n\nBiography\n\nJohn Howe is a Canadian book illustrator living in Neuchâtel Switzerland. Template:When? One year after graduating from high school he studied in a college in Strasbourg France then at the Ecole des Arts Décoratifs. He is best known for his work based on J. R. R. Tolkien's worlds.\n\nRead full biography\n\nYes, John Howe is still alive Last check: 2 years ago\n\nJohn Howe zodiac sign is leo.\n\nWhen is Howe's next birthday?\n\nJohn Howe was born on the 21th of August 1957 , which was a Wednesday. John Howe will be turning 66 in only 73 days from today (09 June, 2023).\n\nOther facts about John Howe"}, {"url": "https://www.wiki3.en-us.nina.az/John_Howe_(illustrator).html", "page_content": "For other people with the same name, see John Howe\n\nJohn Howe (born August 21, 1957) is a Canadian book illustrator and conceptual designer, best-known for his artwork of J. R. R. Tolkien's Middle-earth.[1] One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\nHowe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy. Howe illustrated the Lord of the Rings board game created by Reiner Knizia, and re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work includes images of mythological material such as the Old English epic poem Beowulf (including Knizia's board game Beowulf: The Legend). Howe illustrated many books in the fantasy genre, such as those by Robin Hobb. He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis, The Chronicles of Narnia.[1] In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, with numerous illustrations by Howe.\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.[2]\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson consulted with both Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\nHowe is a member of the living history group the Company of Saynt George, and has expertise in ancient and medieval armour and armaments.\n\nHowe also served as a conceptual designer for Amazon's The Lord of the Rings: The Rings of Power, which premiered on Prime Video on September 2, 2022.[3]"}], "John Howe lives in Neuchâtel, Switzerland.": [{"url": "https://www.goodreads.com/author/show/34748.John_Howe", "page_content": "John Howe\n\nBorn\n\nAugust 21, 1957\n\nWebsite\n\nGenre\n\nJohn Howe is a Canadian book illustrator, living in Neuchâtel, Switzerland. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\n\n\nHe is best known for his work based on J. R. R. Tolkien's worlds. Howe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy, and Howe also did the illustration for the Lord of the Rings board game created by Reiner Knizia. Howe also re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work is not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf (he also illustrated Knizi\n\nJohn Howe is a Canadian book illustrator, living in Neuchâtel, Switzerland. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\n\n\nHe is best known for his work based on J. R. R. Tolkien's worlds. Howe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy, and Howe also did the illustration for the Lord of the Rings board game created by Reiner Knizia. Howe also re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work is not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf (he also illustrated Knizia's board game Beowulf: The Legend). Howe illustrated many other books, amongst which many belong to the fantasy genre (Robin Hobb's books for instance.) He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis. In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, complete with numerous illustrations by Howe.\n\n\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.\n\n\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson both consulted with Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\n\n\nHowe is a member of the living history group the Company of Saynt George, and has considerable expertise in ancient and medieval armour and armaments.\n\n\n\nLibrarian note: There is more than one author in the Goodreads database with this name.\n\n\n\nJohn^^Howe"}, {"url": "https://www.zombicide.com/en/pg/special-guest-box-john-howe/", "page_content": "John Howe (born in 1957) is a Canadian book illustrator, living in Neuchâtel, Switzerland. Best known for his work based on J. R. R. Tolkien’s Middle-Earth, Howe was one of the two chief conceptual designers for Peter Jackson’s movie trilogies The Lord of the Rings and The Hobbit.\n\nHis work is however not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf. He has illustrated many books and games, amongst which many belong to the fantasy genre.\n\nBox contents"}, {"url": "https://www.john-howe.com/blog/biography/exhibitions/", "page_content": "Formation | Bio | Exibitions | Aftwewords\n\nShowing off\n\nPersonal exhibitions\n\nAny gallery show means going out on a limb, sometimes with confidence, sometimes with trepidation.\n\nFor an illustrator, it is a way of bypassing the otherwise mandatory transition through publishing, restoring a geographical sense to the work, adding motivation. (Which means basically, that you have to get out of the house and go see it…) All in all, it puts people back in the picture, and no longer the largely abstract public that one devines behind sales figures and royalty statements.\n\nIt’s the pleasure of chance encounters, the satisfaction of actually seeing one’s own work in a frame on a wall. It’s a privileged moment.\n\nGalerie Librairie La Marge, Lausanne, (Switzerland) December 1983\n\nThe Pendragon Gallery, Annapolis, Maryland, August 1991\n\nFestival de la Bande Dessinée de Sierre, Sierre (Switzerland) June 1995\n\nLa Bibliothèque des Jeunes, Le Locle (Switzerland) Oct/Nov 1995\n\nLibrairie-Galerie Repères et Merveilles, Bienne (Switzerland) 1995\n\nFestival du Livre de la Jeunesse, Troyes, (France) September 1996\n\nGalerie Ziggourat, Brussels, 1997\n\nMusee des Beaux-Arts du Locle, Le Locle (Switzerland) May 3 to June 22, 1997\n\nJohn Howe/Images de Tolkien:\n\nNovember 7 to December 30, 1995 – Médiathèque de Saint-Herblain (Nantes) January 17 to March 9, 1996 – Les Silos, Chaumont March 22 to April 21, 1996 – Maison du Boulanger, Troyes September 19 to October 26, 1996 – Médiathèque d’Epernay January 9 to February 7, 1997 – École des Arts Décoratifs de Strasbourg February 25 to March 22, 1997 – Médiathèque de Sedan April 1 to 13,1997 – Revin (Association Lire Malgré Tout) April 30 to May 4, 1997 – Salon International du Livre et de la Presse, Geneva September 20 to October 19 and November 19 to December 28, 1997 – La Maison d’Ailleurs, Yverdon-les- Bains (Switzerland) October 24 to November 16 1997- L’Epée d’Eowyn/Rencontres Tolkien, Sierrre (Switzerland)\n\nEcailles, Ailes, Griffes et Feu/Illustrations for A Diversity of Dragons – La Maison d’Ailleurs, Yverdon-les- Bains (Switzerland) October 21 to November 16, 1997\n\nLibrarie La Bulle – Fribourg (Switzerland) November 24 to December 15, 2000\n\nLes Etonnants Voyageurs – Saint-Malo (France) May 2001\n\nLucca Comics and Games – Lucca (Italy) 2001\n\nJohn HOWE/ Sur les Terres de Tolkien\n\nSeptember 27 to October 2002 – Médiathèque le l’Agglomeration Troyenne, Troyes October 30 to November 3, 2002 – Utopiales (Festival International de Sciènce-Fiction de Nantes), Nantes November 29 to December 1, 2002 – Festival Rifl Act Fiction, Lyon December 10, 2002 to January 11, 2003 – Canadian Cultural Center, Paris March 29 to April 5, 2003 – Rencontres Tolkien, Bibliothèque de l’Université Rennes 2, Campus Villejean, Rennes, France May 6 to 31, 2003 – Bibliothèque Municipale, Charleville-Mézières, France July 1 to 7, 2003 – Neuchâtel International Fantasy Film Festival, (Theatre du Passage), Neuchâtel, Switzerland September 29 to November 9, 2003 – Gruyères, (Gruyères Castle), Switzerland January 3 to 25, 2004 – Médiatheque, Annecy, France February 7 to 28, 2004 – Médiatheque, Châlons-en-Champagne, France March 9 to 27, 2004 – Médiatheque, Saint-Nazaire, France\n\nJohn Howe: Lord of the Brush / Le Seigneur des Pinceaux\n\nEmbassy of Canada Prince Takamado Gallery, Tokyo – February 27 to March 31, 2006\n\nJohn Howe: Périples en Terre du Milieu, Médiathèque de Bourgoin-Jallieu, Bourgoin-Jallieu, France – April 17 to May 12, 2007\n\nJohn Howe 2007: Saint-Ursanne La Fantastique, Saint-Ursanne, Switzerland – June 23 to September 2, 2007 (Exhibitions, concerts, conferences, installations, etc.)"}, {"url": "https://www.goodreads.com/book/show/33808490-a-middle-earth-traveller", "page_content": "John Howe is a Canadian book illustrator, living in Neuchâtel, Switzerland. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\n\n\nHe is best known for his work based on J. R. R. Tolkien's worlds. Howe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy, and Howe also did the illustration for the Lord of the Rings board game created by Reiner Knizia. Howe also re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work is not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf (he also illustrated Knizia's board game Beowulf: The Legend). Howe illustrated many other books, amongst which many belong to the fantasy genre (Robin Hobb's books for instance.) He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis. In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, complete with numerous illustrations by Howe.\n\n\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.\n\n\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson both consulted with Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\n\n\nHowe is a member of the living history group the Company of Saynt George, and has considerable expertise in ancient and medieval armour and armaments.\n\n\n\nLibrarian note: There is more than one author in the Goodreads database with this name.\n\n\n\nJohn^^Howe"}, {"url": "http://www.fhs.swiss/eng/2006-01-24_434.html", "page_content": "On 16 December last year, at the Hotel Palafitte in Neuchâtel, watch designer Rodolphe Cattin and Jacky Epitaux, CEO of the Rodolphe company, welcomed to the Rodolphe club John Howe, book illustrator and cinematic artist, who worked notably on Peter Jackson’s \"Lord of the Rings\" trilogy.\n\n\n\nThe club, founded in the summer of 2000 under the impetus of Rodolphe Cattin, brings together personalities from the world of the arts, culture and industry and seeks to provide the company with genuine artistic input through the personal contributions of its members. It serves as a meeting place where society’s movers and opinion-makers can speak a shared language of change. In addition, members are able to have a say regarding future collections.\n\n\n\nA discreet, even secretive man, very much the artist and dreamer, John Howe draws his spellbinding talents from a mysterious wellspring of imagination. To celebrate the arrival of the fourth member of his club, Rodolphe Cattin had the pleasure of presenting him with a personalised engraving and a steel \"Le Semainier\" watch with quintuple date, a trademark piece of the Jura based manufacturer.\n\n\n\nThe pen of John Howe thus crosses that of Rodolphe, for his part a specialist in the world of watchmaking, who last year was responsible for the design of around seven million timepieces sold across the globe."}, {"url": "https://alchetron.com/John-Howe-(illustrator)", "page_content": "John Howe (born August 21, 1957) is a Canadian book illustrator, living in Neuchâtel, Switzerland. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\nHe is best known for his work based on J. R. R. Tolkien's worlds. Howe and noted Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy, and Howe also did the illustration for the Lord of the Rings board game created by Reiner Knizia. Howe also re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work is however not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf (he also illustrated Knizia's board game Beowulf: The Legend). Howe illustrated many other books, amongst which many belong to the fantasy genre (Robin Hobb's books for instance.) He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis. In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, complete with numerous illustrations by Howe.\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson both consulted with Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\nHowe is a member of the living history group the Company of Saynt George, and has considerable expertise in ancient and medieval armour and armaments.\n\nBiography\n\nJohn Howe was born in Vancouver, British Columbia. He was drawing from pre-school age, with his mother's help for his \"more ambitious renderings\". Around primary school age he found his mother's ability no longer living up to his expectations, and even got frustrated once at both his mother and himself at not being able to draw a cow to his expectations. Howe's school years were complicated by moves which took place with a timing that left the art classes full, and left him in classes like power mechanics. He did find his ability as a draughtsman to be profitable in biology class though, where he and a friend would produce renderings of microscopic organisms for classmates at fifty cents each. As a child, he collected the covers of paperbacks. His collection included items from Frank Frazetta, Barry Smith, and Bernie Wrightson. In his adolescence, Howe read The Lord of the Rings trilogy by J. R. R. Tolkien. He said he got \"a real spark\" from the Hildebrandt calendars, which showed him that the books could be illustrated. Howe made drawings of his own versions of the scenes depicted in the calendar. These drawings, according to Howe, may not have survived.\n\nA year after his high school graduation, Howe found himself in Strasbourg, France attending college. The following year, he enrolled into the École des arts décoratifs. He cites his experience of this period as follows:\n\n\"The first year was spent not understanding much, the second at odds with what I did manage to understand, and the third eager to get out, although in retrospect I certainly owe whatever clarity of thought I possess to the patience of the professor of Illustration.\"\n\nThroughout his first years in Europe, Howe was taking in as much as he could in the way of art, architecture and everything that was \"simultaneously ancient and novel.\" He says the only piece of his art work that survived from this period is his \"The Lieutenant of the Black Tower of Barad-dûr\", a piece inspired by Tolkien's, The Lord of the Rings. He says if this is not his first published piece, it must certainly be the earliest. Howe's earliest commissions included political cartoons, magazine illustrations, comics, animated films, advertising, of which he says were nightmares. He said that he would end up redoing sketches so many times that there was nothing left of \"his\" in them. This frustrated him, and he wondered how he would ever make it in the profession.\n\nSince the earlier days of his career, Howe has managed to find his place in the profession of art. Working on such well-known projects as: The Lord of the Rings, J.R.R. Tolkien's Books and Merchandise, Beowulf, Robin Hobb's books, The Lion, The Witch, and The Wardrobe, Cards for Magic: The Gathering, The Hobbit, Pan's Labyrinth. Howe has also written and illustrated children's books.\n\nSelected works\n\nThe Fisherman & His Wife, transl. from Brothers Grimm (Mankato MN: Creative Education, 1983). ISBN 0871919370 — picture book\n\nThe Enchanted World: Night Creatures (Time Life, 1985)\n\nThe Enchanted World: Water Spirits (Time Life, 1985)\n\nThe Enchanted World: Dwarfs (Time Life, 1985)\n\nThe Enchanted World: Giants and Ogres (Time Life, 1985)\n\nRip Van Winkle by Washington Irving, retold by John Howe (Little, Brown and Co., 1988) ISBN 0316375780\n\nJack and the Beanstalk, retold by John Howe (Little, Brown and Co., 1989) ISBN 0316375799\n\nKnights: A 3-Dimensional Exploration (Tango Books, 1995) ISBN 978-1-85707-071-2\n\nThe Knight With the Lion: The Story of Yvain (Little, Brown and Co., 1996) ISBN 978-0-316-37583-2\n\nA Diversity of Dragon by Anne McCaffrey with Richard Woods (Atheneum Books for Young Readers, 1997) ISBN 978-0-689-31868-9\n\nImages of Middle-Earth (HarperCollins, 2000) ISBN 978-0-261-10310-8\n\nThe King of Winter's Daughter (Little, Brown and Co., 2005) ISBN 978-0-316-88837-0\n\nFantasy Encyclopedia (Kingfisher, 2005)\n\nMyth and Magic: The Art of John Howe (Barnes & Noble, 2006) ISBN 978-0-7607-8686-4\n\nFantasy Art Workshop (Impact Books, 2007) ISBN 978-1-60061-009-7\n\nForging Dragons: Inspirations, Approaches and Techniques for Drawing and Painting Dragons (David and Charles, 2008) ISBN 978-1-60061-323-4\n\nFantasy Drawing Workshop (Impact Books, 2009) ISBN 978-1-60061-773-7\n\nLost Worlds (Kingfisher, 2009) ISBN 978-0-7534-6107-5\n\nExhibitions\n\nGalerie Librairie La Marge, Lausanne, (Switzerland) December 1983\n\nThe Pendragon Gallery, Annapolis, Maryland, August 1991\n\nFestival de la Bande Dessinée de Sierre, Sierre (Switzerland) June 1995\n\nLa Bibliothèque des Jeunes, Le Locle (Switzerland) Oct/Nov 1995\n\nLibrairie-Galerie Repères et Merveilles, Bienne (Switzerland) 1995\n\nFestival du Livre de la Jeunesse, Troyes, (France) September 1996\n\nGalerie Ziggourat, Brussels, 1997\n\nMusee des Beaux-Arts du Locle, Le Locle (Switzerland) May 3 to June 22, 1997\n\nJohn Howe/Images de Tolkien:\n\nNovember 7 to December 30, 1995 - Médiathèque de Saint-Herblain (Nantes)\n\nJanuary 17 to March 9, 1996 - Les Silos, Chaumont\n\nMarch 22 to April 21, 1996 - Maison du Boulanger, Troyes\n\nSeptember 19 to October 26, 1996 - Médiathèque d'Épernay\n\nJanuary 9 to February 7, 1997 - École des Arts Décoratifs de Strasbourg\n\nFebruary 25 to March 22, 1997 - Médiathèque de Sedan\n\nApril 1 to 13,1997 - Revin (Association Lire Malgré Tout)\n\nApril 30 to May 4, 1997 - Salon International du Livre et de la Presse, Geneva\n\nSeptember 20 to October 19 and November 19 to December 28, 1997 - La Maison d'Ailleurs, Yverdon-les- Bains (Switzerland)\n\nOctober 24 to November 16, 1997- L'Épée d'Eowyn/Rencontres Tolkien, Sierrre (Switzerland)\n\nEcailles, Ailes, Griffes et Feu/Illustrations for A Diversity of Dragons - La Maison d'Ailleurs, Yverdon-les- Bains (Switzerland), October 21 to November 16, 1997\n\nLibrarie La Bulle - Fribourg (Switzerland) November 24 to December 15, 2000\n\nLes Etonnants Voyageurs - Saint-Malo (France) May 2001\n\nLucca Comics and Games - Lucca (Italy) 2001\n\nJohn HOWE/ Sur les Terres de Tolkien\n\nSeptember 27 to October 2002 - Médiathèque le l'Agglomeration Troyenne, Troyes\n\nOctober 30 to November 3, 2002 - Utopiales (Festival International de Sciènce-Fiction de Nantes), Nantes\n\nNovember 29 to December 1, 2002 - Festival Rifl Act Fiction, Lyon\n\nDecember 10, 2002 to January 11, 2003 - Canadian Cultural Center, Paris\n\nMarch 29 to April 5, 2003 - Rencontres Tolkien, Bibliothèque de l'Université Rennes 2, Campus Villejean, Rennes, Franc\n\nMay 6 to 31, 2003 - Bibliothèque Municipale, Charleville-Mézières, France\n\nJuly 1 to 7, 2003 - Neuchâtel International Fantasy Film Festival, (Theatre du Passage), Neuchâtel, Switzerland\n\nSeptember 29 to November 9, 2003 - Gruyères, (Gruyères Castle), Switzerland\n\nJanuary 3 to 25, 2004 - Médiatheque, Annecy, France\n\nFebruary 7 to 28, 2004 - Médiatheque, Châlons-en-Champagne, France\n\nMarch 9 to 27, 2004 - Médiatheque, Saint-Nazaire, France\n\nBibliothèque nationale de France, Paris, 14.12.2003-15.02.2004 (120 drawings by Alan Lee & John Howe).\n\nJohn Howe: Lord of the Brush / Le Seigneur des Pinceaux\n\nEmbassy of Canada Prince Takamado Gallery, Tokyo - February 27 to March 31, 2006\n\nJohn Howe: Périples en Terre du Milieu, Médiathèque de Bourgoin-Jallieu, Bourgoin-Jallieu, France - April 17 to May 12, 2007\n\nJohn Howe 2007: Saint-Ursanne La Fantastique, Saint-Ursanne, Switzerland - June 23 to September 2, 2007 (Exhibitions, concerts, conferences by Vincent Ferré, installations, etc.)"}, {"url": "https://foreignaffairs.co.nz/2023/06/05/mil-osi-translation-the-canton-and-the-city-of-neuchatel-the-nifff-and-john-howe-will-create-a-place-of-reference-dedicated-to-fantasy-art-and-innovation/", "page_content": "MIL OSI Translation. Government of the Republic of France statements from French to English –\n\nSource: Canton of Neuchatel Switzerland\n\nA new space for exhibition, creation and innovation around the works of John Howe and fantastic imaginations will see the light of day in Neuchâtel in 2025. This project will materialize on the exceptional site of the former prisons in the heart of the old town. . The cantonal and municipal authorities, as well as the NIFFF and John Howe have come together to design an ambitious and unifying project.\n\nAt the crossroads of art, science and innovation, the “La Tour dufantastique” project was unveiled today to the media in the heart of the disused prisons of the old town of Neuchâtel, a stone’s throw from the Château.\n\n“Bringing together the Canton and the City of Neuchâtel, the NIFFF and the artist John Howe, La Tour brings life back to a place belonging to the canton and left unassigned for several years, serving a vision that brings together history and imagination, past and future, creation and innovation, dream and magic”, indicated Laurent Kurth, State Councillor, Head of the Buildings Department, on behalf of the State which will make the building available to the project. This is the result of an exciting collaboration between the City and the Canton, united to develop contemporary creation and innovation. It will have taken several years to see this project mature, led by four partners and involving many actors.\n\nFor local, national and international audiences\n\nBringing together past, future and imagination, La Tour intends to break down barriers and bring together creation, economy and innovation in a space with high heritage value. The medieval tower, whose origins date back to the 10th century – one of the oldest buildings in Neuchâtel – will be linked by a footbridge to the prison corps, a building operated until 1996 with cells still visible, forming a place of evolving and technological exhibition devoted to the works of John Howe. “The project strengthens the place of the fantastic in Neuchâtel. The Tower targets a local, national but also international audience,” explained Thomas Facchinetti, municipal councilor of the City of Neuchâtel, responsible for culture.\n\nJohn Howe, Neuchâtelois of Canadian origin, is an international reference in terms of illustration of the work of JRR Tolkien. He was the general and artistic director of the screen adaptations of The Lord of the Rings and The Hobbit, as well as, most recently, of the series The Rings of Power, whose second season is in the process of being created. Very committed to the project, the artist also sees it as a place of incubation for young talents: “These former prisons can no longer serve their original designation, but can accommodate reflection, the marvelous journey, the escape ; become a place of meeting, emulation and creation, to take advantage of all the skills present in the region. »\n\nArtistic incubation and innovation\n\nBecause a third building, attached to the former prison spaces, enters the scene, the one partly occupied by the administration of the NIFFF, and which will soon house, in addition to the administration of La Tour, artists’ studios of “concept art – a register in which the artists illustrate an idea in a creative way for a realization on the screen. “Neuchâtel already hosts one of the most important European festivals dedicated to the fantastic, it will soon host a plural space with, at its center, the work of John Howe, a major artist in the field of ‘concept art'”, declared to his tour Pierre-Yves Walder, artistic and general director of the festival. The NIFFF plans to create a point of contact between artists, screenwriters and authors. A concrete project will already see the light of day this summer, with a “worldbuilding” workshop which brings together French and Swiss artists on the premises of La Villa (la Petite Rochette) during the 22nd edition of the festival in July, and a presentation of the projects from this workshop in the fall.\n\nAnother major point of the project, innovation: to the creative abundance of La Tour will be added the potential of the regional ecosystem with universities and institutes as well as the impulses given by the “smart city” strategy of the City of Neuchâtel . “Inputs” that can feed both innovative museography and technological projects, through exchanges between the private sector and the world of culture. “Through the networking of actors of culture, innovation and the economy, La Tour will be much more than an exhibition space”, noted for his part the municipal councilor Didier Boillat, in charge of technological development, which will present a report on the “smart” strategy this year.\n\nGovernance by a foundation\n\nNext steps towards the realization of the project: the creation, by the four partners, of a foundation involving the world of innovation, which will be called upon to manage La Tour in a self-financed way thanks to admissions, but also in particular to sponsorship, rentals , shop and cafe. The latter, moreover, will enjoy a terrace with a view of the rooftops and the lake. The set-up phase will start in the second half of the year, with an opening scheduled for 2025.\n\nA year to remember for enthusiasts and the curious all over the world: “I see La Tour as a new beginning, an opportunity to share passions for the fantastic, a gateway to the worlds of the marvelous, worlds that have always accompanied humanity,” concluded John Howe.\n\nIllustration: The Tower and the Dragon (credit: John Howe).\n\nEDITOR’S NOTE: This article is a translation. Apologies should the grammar and/or sentence structure not be perfect.\n\nMIL Translation OSI"}, {"url": "https://www.britannica.com/place/Neuchatel-canton-Switzerland", "page_content": "Neuchâtel, (French), German Neuenburg, canton, western Switzerland, bordering France to the northwest and Lake Neuchâtel to the southeast and bounded by the cantons of Bern on the northeast and Vaud on the southwest. It lies in the central Jura Mountains and is drained by Lake Neuchâtel (leading to the Rhine) and Le Doubs River (leading to the Rhône). Its three regions are a low-lying strip along the lake called Le Vignoble (from its vineyards); an intermediate region, Les Vallées, comprising the two principal valleys of the canton (the Ruz Valley, watered by the Seyon, and the Travers Valley, watered by L’Areuse), which lie at an elevation of 2,300 feet (700 metres); and the highest region, the Neuchâteloises Mountains (3,000–3,500 feet [915–1,065 metres]), mainly composed of a long valley in which stand the industrial centres of La Chaux-de-Fonds, Le Locle, La Sagne, Les Ponts-de-Martel, and La Brévine. Neuchâtel is the capital.\n\nNovum Castellum (Neuchâtel) was first mentioned in the will of Rudolf III, the last king of Burgundy, who died in 1032. About 1034 the town and its territories were granted in fief to Count Ulrich von Fenis, whose dynasty gradually increased its dominion, until by 1373 it held practically all the area of the present canton. In 1406 Neuchâtel entered into union with Bern. It passed in the early 15th century to the lords of Freiburg im Breisgau in the German Rhineland and in 1504 to the French ducal house of Orléans-Longueville. The Reformation was introduced there in 1530 by Guillaume Farel, the French preacher, and Neuchâtel became a principality in 1648. With the extinction of the house of Orléans-Longueville in 1707, the area passed to Frederick I, the first king of Prussia. The nominal role of the Prussian king lasted until 1848, with a brief interval from 1806 to 1814 when the principality was granted by Napoleon to his marshal, Louis-Alexandre Berthier. It was admitted to the Swiss Confederation in 1815 as the 21st canton and the only nonrepublican member, its hereditary rulers the last to maintain their position in Switzerland. A republican form of government was established by a peaceful revolution in 1848, and after long negotiations and several attempts at counter-revolution, including the so-called Neuchâtel crisis (1856), the king of Prussia renounced his claims to sovereignty in 1857.\n\nThe population is mainly French speaking and has a Protestant majority. In addition to excellent wineries, some fruit is grown in Le Vignoble, and horses are raised. There are pastures for cattle in the valleys, and some cheese is made. The most valuable mineral product is asphalt, concentrated in the Travers Valley. The most characteristic industry is watchmaking, which has been prominent since the early 18th century in the highland valleys of La Chaux-de-Fonds, Le Locle, and Fleurier; in 2009 La Chaux-de-Fonds and Le Locle together were designated a UNESCO World Heritage site. Other important manufactures include metal products, machines, and tobacco products. An oil refinery is located at Cressier. Road and rail communications are highly developed. Area 310 square miles (803 square km). Pop. (2007 est.) 168,912."}, {"url": "https://alchetron.com/John-Howe-(illustrator)", "page_content": "John Howe (born August 21, 1957) is a Canadian book illustrator, living in Neuchâtel, Switzerland. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\nHe is best known for his work based on J. R. R. Tolkien's worlds. Howe and noted Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy, and Howe also did the illustration for the Lord of the Rings board game created by Reiner Knizia. Howe also re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work is however not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf (he also illustrated Knizia's board game Beowulf: The Legend). Howe illustrated many other books, amongst which many belong to the fantasy genre (Robin Hobb's books for instance.) He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis. In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, complete with numerous illustrations by Howe.\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson both consulted with Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\nHowe is a member of the living history group the Company of Saynt George, and has considerable expertise in ancient and medieval armour and armaments.\n\nBiography\n\nJohn Howe was born in Vancouver, British Columbia. He was drawing from pre-school age, with his mother's help for his \"more ambitious renderings\". Around primary school age he found his mother's ability no longer living up to his expectations, and even got frustrated once at both his mother and himself at not being able to draw a cow to his expectations. Howe's school years were complicated by moves which took place with a timing that left the art classes full, and left him in classes like power mechanics. He did find his ability as a draughtsman to be profitable in biology class though, where he and a friend would produce renderings of microscopic organisms for classmates at fifty cents each. As a child, he collected the covers of paperbacks. His collection included items from Frank Frazetta, Barry Smith, and Bernie Wrightson. In his adolescence, Howe read The Lord of the Rings trilogy by J. R. R. Tolkien. He said he got \"a real spark\" from the Hildebrandt calendars, which showed him that the books could be illustrated. Howe made drawings of his own versions of the scenes depicted in the calendar. These drawings, according to Howe, may not have survived.\n\nA year after his high school graduation, Howe found himself in Strasbourg, France attending college. The following year, he enrolled into the École des arts décoratifs. He cites his experience of this period as follows:\n\n\"The first year was spent not understanding much, the second at odds with what I did manage to understand, and the third eager to get out, although in retrospect I certainly owe whatever clarity of thought I possess to the patience of the professor of Illustration.\"\n\nThroughout his first years in Europe, Howe was taking in as much as he could in the way of art, architecture and everything that was \"simultaneously ancient and novel.\" He says the only piece of his art work that survived from this period is his \"The Lieutenant of the Black Tower of Barad-dûr\", a piece inspired by Tolkien's, The Lord of the Rings. He says if this is not his first published piece, it must certainly be the earliest. Howe's earliest commissions included political cartoons, magazine illustrations, comics, animated films, advertising, of which he says were nightmares. He said that he would end up redoing sketches so many times that there was nothing left of \"his\" in them. This frustrated him, and he wondered how he would ever make it in the profession.\n\nSince the earlier days of his career, Howe has managed to find his place in the profession of art. Working on such well-known projects as: The Lord of the Rings, J.R.R. Tolkien's Books and Merchandise, Beowulf, Robin Hobb's books, The Lion, The Witch, and The Wardrobe, Cards for Magic: The Gathering, The Hobbit, Pan's Labyrinth. Howe has also written and illustrated children's books.\n\nSelected works\n\nThe Fisherman & His Wife, transl. from Brothers Grimm (Mankato MN: Creative Education, 1983). ISBN 0871919370 — picture book\n\nThe Enchanted World: Night Creatures (Time Life, 1985)\n\nThe Enchanted World: Water Spirits (Time Life, 1985)\n\nThe Enchanted World: Dwarfs (Time Life, 1985)\n\nThe Enchanted World: Giants and Ogres (Time Life, 1985)\n\nRip Van Winkle by Washington Irving, retold by John Howe (Little, Brown and Co., 1988) ISBN 0316375780\n\nJack and the Beanstalk, retold by John Howe (Little, Brown and Co., 1989) ISBN 0316375799\n\nKnights: A 3-Dimensional Exploration (Tango Books, 1995) ISBN 978-1-85707-071-2\n\nThe Knight With the Lion: The Story of Yvain (Little, Brown and Co., 1996) ISBN 978-0-316-37583-2\n\nA Diversity of Dragon by Anne McCaffrey with Richard Woods (Atheneum Books for Young Readers, 1997) ISBN 978-0-689-31868-9\n\nImages of Middle-Earth (HarperCollins, 2000) ISBN 978-0-261-10310-8\n\nThe King of Winter's Daughter (Little, Brown and Co., 2005) ISBN 978-0-316-88837-0\n\nFantasy Encyclopedia (Kingfisher, 2005)\n\nMyth and Magic: The Art of John Howe (Barnes & Noble, 2006) ISBN 978-0-7607-8686-4\n\nFantasy Art Workshop (Impact Books, 2007) ISBN 978-1-60061-009-7\n\nForging Dragons: Inspirations, Approaches and Techniques for Drawing and Painting Dragons (David and Charles, 2008) ISBN 978-1-60061-323-4\n\nFantasy Drawing Workshop (Impact Books, 2009) ISBN 978-1-60061-773-7\n\nLost Worlds (Kingfisher, 2009) ISBN 978-0-7534-6107-5\n\nExhibitions\n\nGalerie Librairie La Marge, Lausanne, (Switzerland) December 1983\n\nThe Pendragon Gallery, Annapolis, Maryland, August 1991\n\nFestival de la Bande Dessinée de Sierre, Sierre (Switzerland) June 1995\n\nLa Bibliothèque des Jeunes, Le Locle (Switzerland) Oct/Nov 1995\n\nLibrairie-Galerie Repères et Merveilles, Bienne (Switzerland) 1995\n\nFestival du Livre de la Jeunesse, Troyes, (France) September 1996\n\nGalerie Ziggourat, Brussels, 1997\n\nMusee des Beaux-Arts du Locle, Le Locle (Switzerland) May 3 to June 22, 1997\n\nJohn Howe/Images de Tolkien:\n\nNovember 7 to December 30, 1995 - Médiathèque de Saint-Herblain (Nantes)\n\nJanuary 17 to March 9, 1996 - Les Silos, Chaumont\n\nMarch 22 to April 21, 1996 - Maison du Boulanger, Troyes\n\nSeptember 19 to October 26, 1996 - Médiathèque d'Épernay\n\nJanuary 9 to February 7, 1997 - École des Arts Décoratifs de Strasbourg\n\nFebruary 25 to March 22, 1997 - Médiathèque de Sedan\n\nApril 1 to 13,1997 - Revin (Association Lire Malgré Tout)\n\nApril 30 to May 4, 1997 - Salon International du Livre et de la Presse, Geneva\n\nSeptember 20 to October 19 and November 19 to December 28, 1997 - La Maison d'Ailleurs, Yverdon-les- Bains (Switzerland)\n\nOctober 24 to November 16, 1997- L'Épée d'Eowyn/Rencontres Tolkien, Sierrre (Switzerland)\n\nEcailles, Ailes, Griffes et Feu/Illustrations for A Diversity of Dragons - La Maison d'Ailleurs, Yverdon-les- Bains (Switzerland), October 21 to November 16, 1997\n\nLibrarie La Bulle - Fribourg (Switzerland) November 24 to December 15, 2000\n\nLes Etonnants Voyageurs - Saint-Malo (France) May 2001\n\nLucca Comics and Games - Lucca (Italy) 2001\n\nJohn HOWE/ Sur les Terres de Tolkien\n\nSeptember 27 to October 2002 - Médiathèque le l'Agglomeration Troyenne, Troyes\n\nOctober 30 to November 3, 2002 - Utopiales (Festival International de Sciènce-Fiction de Nantes), Nantes\n\nNovember 29 to December 1, 2002 - Festival Rifl Act Fiction, Lyon\n\nDecember 10, 2002 to January 11, 2003 - Canadian Cultural Center, Paris\n\nMarch 29 to April 5, 2003 - Rencontres Tolkien, Bibliothèque de l'Université Rennes 2, Campus Villejean, Rennes, Franc\n\nMay 6 to 31, 2003 - Bibliothèque Municipale, Charleville-Mézières, France\n\nJuly 1 to 7, 2003 - Neuchâtel International Fantasy Film Festival, (Theatre du Passage), Neuchâtel, Switzerland\n\nSeptember 29 to November 9, 2003 - Gruyères, (Gruyères Castle), Switzerland\n\nJanuary 3 to 25, 2004 - Médiatheque, Annecy, France\n\nFebruary 7 to 28, 2004 - Médiatheque, Châlons-en-Champagne, France\n\nMarch 9 to 27, 2004 - Médiatheque, Saint-Nazaire, France\n\nBibliothèque nationale de France, Paris, 14.12.2003-15.02.2004 (120 drawings by Alan Lee & John Howe).\n\nJohn Howe: Lord of the Brush / Le Seigneur des Pinceaux\n\nEmbassy of Canada Prince Takamado Gallery, Tokyo - February 27 to March 31, 2006\n\nJohn Howe: Périples en Terre du Milieu, Médiathèque de Bourgoin-Jallieu, Bourgoin-Jallieu, France - April 17 to May 12, 2007\n\nJohn Howe 2007: Saint-Ursanne La Fantastique, Saint-Ursanne, Switzerland - June 23 to September 2, 2007 (Exhibitions, concerts, conferences by Vincent Ferré, installations, etc.)"}, {"url": "http://www.fhs.swiss/eng/2006-01-24_434.html", "page_content": "On 16 December last year, at the Hotel Palafitte in Neuchâtel, watch designer Rodolphe Cattin and Jacky Epitaux, CEO of the Rodolphe company, welcomed to the Rodolphe club John Howe, book illustrator and cinematic artist, who worked notably on Peter Jackson’s \"Lord of the Rings\" trilogy.\n\n\n\nThe club, founded in the summer of 2000 under the impetus of Rodolphe Cattin, brings together personalities from the world of the arts, culture and industry and seeks to provide the company with genuine artistic input through the personal contributions of its members. It serves as a meeting place where society’s movers and opinion-makers can speak a shared language of change. In addition, members are able to have a say regarding future collections.\n\n\n\nA discreet, even secretive man, very much the artist and dreamer, John Howe draws his spellbinding talents from a mysterious wellspring of imagination. To celebrate the arrival of the fourth member of his club, Rodolphe Cattin had the pleasure of presenting him with a personalised engraving and a steel \"Le Semainier\" watch with quintuple date, a trademark piece of the Jura based manufacturer.\n\n\n\nThe pen of John Howe thus crosses that of Rodolphe, for his part a specialist in the world of watchmaking, who last year was responsible for the design of around seven million timepieces sold across the globe."}]}