{"John Howe has won numerous awards, including the Hugo Award for Best Professional Artist in 2003 and the World Fantasy Award for Best Artist in 2004.": [{"url": "https://www.tor.com/2022/09/04/2022-hugo-award-winners/", "page_content": "The winners of the 2022 Hugo Awards, Lodestar Award for Best Young Adult Book, and Astounding Award for Best New Writer have been announced! You can read the full list below; winners appear in bold.\n\nThe awards were presented September 4, 2022, at the 80th WorldCon—called ChiCon 8—in Chicago, IL, in a ceremony hosted by Charlie Jane Anders and Annalee Newitz.\n\nCongratulations to the finalists and winners!\n\n2022 Hugo Award Finalists\n\nBest Novel\n\nWINNER: A Desolation Called Peace by Arkady Martine (Tor Books)\n\n(Tor Books) The Galaxy, and the Ground Within by Becky Chambers (Harper Voyager / Hodder & Stoughton)\n\nLight From Uncommon Stars by Ryka Aoki (Tor Books)\n\nA Master of Djinn by P. Djèlí Clark (Tordotcom Publishing / Orbit UK)\n\nProject Hail Mary by Andy Weir (Ballantine / Del Rey Books)\n\nShe Who Became the Sun by Shelley Parker-Chan (Tor Books / Mantle)\n\nBest Novella\n\nAcross the Green Grass Fields by Seanan McGuire (Tordotcom Publishing)\n\nElder Race by Adrian Tchaikovsky (Tordotcom Publishing)\n\nFireheart Tiger by Aliette de Bodard (Tordotcom Publishing)\n\nThe Past Is Red by Catherynne M. Valente (Tordotcom Publishing)\n\nWINNER: A Psalm for the Wild-Built by Becky Chambers (Tordotcom Publishing)\n\n(Tordotcom Publishing) A Spindle Splintered by Alix E. Harrow (Tordotcom Publishing)\n\nBest Novelette\n\nWINNER: “Bots of the Lost Ark” by Suzanne Palmer (Clarkesworld, Jun 2021)\n\n(Clarkesworld, Jun 2021) “Colors of the Immortal Palette” by Caroline M. Yoachim (Uncanny Magazine, Mar/Apr 2021)\n\nL’Esprit de L’Escalier by Catherynne M. Valente (Tor.com)\n\n“O2 Arena” by Oghenechovwe Donald Ekpeki (Galaxy’s Edge, Nov 2021)\n\n“That Story Isn’t the Story” by John Wiswell (Uncanny Magazine, Nov/Dec 2021)\n\n“Unseelie Brothers, Ltd.” by Fran Wilde (Uncanny Magazine, May/Jun 2021)\n\nBest Short Story\n\n“Mr. Death” by Alix E. Harrow (Apex Magazine, Feb 2021)\n\n“Proof by Induction” by José Pablo Iriarte (Uncanny Magazine, May/Jun 2021)\n\n“The Sin of America” by Catherynne M. Valente (Uncanny Magazine, Mar/Apr 2021)\n\n“Tangles” by Seanan McGuire (Magicthegathering.com: Magic Story, Sep 2021)\n\n“Unknown Number” by Blue Neustifter (Twitter, Jul 2021)\n\nWINNER: “Where Oaken Hearts Do Gather” by Sarah Pinsker (Uncanny Magazine, Mar/Apr 2021)\n\nBest Series\n\nThe Green Bone Saga by Fonda Lee (Orbit)\n\nThe Kingston Cycle by C. L. Polk (Tordotcom Publishing)\n\nMerchant Princes by Charles Stross (Tor Books/Tor UK)\n\nTerra Ignota by Ada Palmer (Tor Books)\n\nWINNER: Wayward Children by Seanan McGuire (Tordotcom Publishing)\n\n(Tordotcom Publishing) The World of the White Rat by T. Kingfisher (Ursula Vernon) (Argyll Productions)\n\nBest Graphic Story or Comic\n\nDIE, vol. 4: Bleed, written by Kieron Gillen, art by Stephanie Hans, lettering by Clayton Cowles (Image Comics)\n\nWINNER: Far Sector, written by N.K. Jemisin, art by Jamal Campbell (DC Comics)\n\n(DC Comics) Lore Olympus, vol. 1 by Rachel Smythe (Del Rey Books)\n\nMonstress, vol. 6: The Vow, written by Marjorie Liu, art by Sana Takeda (Image Comics)\n\nOnce & Future, vol. 3: The Parliament of Magpies, written by Kieron Gillen, illustrated by Dan Mora, colored by Tamra Bonvillain (BOOM! Studios)\n\nStrange Adventures, written by Tom King, art by Mitch Gerads and Evan “Doc” Shaner (DC Comics)\n\nBest Related Work\n\nBeing Seen: One Deafblind Woman’s Fight to End Ableism by Elsa Sjunneson (Tiller Press)\n\nThe Complete Debarkle: Saga of a Culture War by Camestros Felapton (Camestros Felapton)\n\nDangerous Visions and New Worlds: Radical Science Fiction, 1950 to 1985 edited by Andrew Nette and Iain McIntyre (PM Press)\n\n“How Twitter can ruin a life” by Emily St. James (Vox, Jun 2021)\n\nWINNER: Never Say You Can’t Survive by Charlie Jane Anders (Tordotcom Publishing)\n\n(Tordotcom Publishing) True Believer: The Rise and Fall of Stan Lee by Abraham Riesman (Crown)\n\nBest Dramatic Presentation, Long Form\n\nWINNER: Dune, screenplay by Jon Spaihts, Denis Villeneuve, and Eric Roth; directed by Denis Villeneuve; based on the novel Dune by Frank Herbert (Warner Bros / Legendary Entertainment)\n\n(Warner Bros / Legendary Entertainment) Encanto, screenplay by Charise Castro Smith and Jared Bush; directed by Jared Bush, Byron Howard, and Charise Castro Smith (Walt Disney Studios Motion Pictures)\n\nThe Green Knight, written and directed by David Lowery (BRON Studios/A24)\n\nShang-Chi and the Legend of the Ten Rings, screenplay by Dave Callaham, Destin Daniel Cretton, Andrew Lanham; directed by Destin Daniel Cretton (Walt Disney Studios Motion Pictures)\n\nSpace Sweepers, written and directed by Jo Sung-hee (Bidangil Pictures)\n\nWandaVision, screenplay by Peter Cameron, Mackenzie Dohr, Laura Donney, Bobak Esfarjani, Megan McDonnell, Jac Schaeffer (created by and head writer), Cameron Squires, Gretchen Enders, Chuck Hayward; directed by Matt Shakman (Disney+)\n\nBest Dramatic Presentation, Short Form\n\nThe Wheel of Time: “The Flame of Tar Valon,” written by Justine Juel Gillmer, directed by Salli Richardson-Whitfield, based on The Wheel of Time series by Robert Jordan (Amazon Studios)\n\nFor All Mankind: “The Grey,” written by Matt Wolpert and Ben Nedivi; directed by Sergio Mimica-Gezzan (Tall Ship Productions/Sony Pictures Television)\n\nArcane: “The Monster You Created,” written by Christian Linke and Alex Yee; story by Christian Linke, Alex Yee, Conor Sheehy, and Ash Brannon; directed by Pascal Charrue and Arnaud Delord (Netflix)\n\nWINNER: The Expanse: “Nemesis Games,” written by Daniel Abraham, Ty Franck, and Naren Shankar; directed by Breck Eisner (Amazon Studios)\n\n(Amazon Studios) Loki: “The Nexus Event,” written by Eric Martin, directed by Kate Herron, created for television by Michael Waldron (Disney+)\n\nStar Trek: Lower Decks: “wej Duj,” written by Kathryn Lyn, directed by Bob Suarez (CBS Eye Animation Productions)\n\nBest Editor, Short Form\n\nWINNER: Neil Clarke\n\nOghenechovwe Donald Ekpeki\n\nMur Lafferty & S.B. Divya\n\nJonathan Strahan\n\nSheree Renée Thomas\n\nSheila Williams\n\nBest Editor, Long Form\n\nWINNER: Ruoxi Chen\n\nNivia Evans\n\nSarah T. Guan\n\nBrit Hvide\n\nPatrick Nielsen Hayden\n\nNavah Wolfe\n\nBest Professional Artist\n\nTommy Arnold\n\nWINNER: Rovina Cai\n\nAshley Mackenzie\n\nMaurizio Manzieri\n\nWill Staehle\n\nAlyssa Winans\n\nBest Semiprozine\n\nBeneath Ceaseless Skies, editor Scott H. Andrews\n\nEscape Pod, editors S.B. Divya, Mur Lafferty, and Valerie Valdes; assistant editors Benjamin C. Kinney and Premee Mohamed; guest editor Brent C. Lambert; hosts Tina Connolly and Alasdair Stuart; audio producers Summer Brooks and Adam Pracht; and the entire Escape Pod team\n\nFIYAH Magazine of Black Speculative Fiction, publisher Troy L Wiggins; executive editor DaVaun Sanders; managing editor Eboni Dunbar; poetry editor B. Sharise Moore; reviews editor and social media manager Brent Lambert; art director L. D. Lewis; web editor Chavonne Brown; non-fiction editor Margeaux Weston; guest editors Summer Farah and Nadia Shammas; acquiring editors Kaleb Russell, Rebecca McGee, Kerine Wint, Joshua Morley, Emmalia Harrington, Genine Tyson, Tonya R. Moore, Danny Lore; technical assistant Nelson Rolon\n\nPodCastle, co-editors Jen R. Albert, C. L. Clark, Shingai Njeri Kagunda, and Eleanor R. Wood; assistant editors Summer Fletcher and Sofía Barker; audio producer Peter Adrian Behravesh; host Matt Dovey; and the entire PodCastle team\n\nStrange Horizons, Vanessa Aguirre, Joseph Aitken, Kwan-Ann Tan, Rachel Ayers, M H Ayinde, Tierney Bailey, Scott Beggs, Drew Matthew Beyer, Gautam Bhatia, Tom Borger, S. K. Campbell, Emma Celi, Zhui Ning Chang, Rita Chen, Tania Chen, Liz Christman, Emma-Grace Clarke, Linda H. Codega, Kristian Wilson Colyard, Bruhad Dave, Sarah Davidson, Tahlia Day, Arinn Dembo, Belen Edwards, Rebecca Evans, Ciro Faienza, Courtney Floyd, Lila Garrott, Guananí Gómez-Van Cortright, Colette Grecco, Julia Gunnison, Dan Hartland, Sydney Hilton, Angela Hinck, Amanda Jean, Jamie Johnson, Sean Joyce-Farley, Erika Kanda, Kat Kourbeti, Catherine Krahe, Anna Krepinsky, Clayton Kroh, Natasha Leullier, Dante Luiz, Gui Machiavelli, Cameron Mack, Samantha Manaktola, Marisa Manuel, Jean McConnell, Heather McDougal, Maria Morabe, Amelia Moriarty, Sarah Noakes, Aidan Oatway, AJ Odasso, Joel Oliver-Cormier, Kristina Palmer, Karintha Parker, Anjali Patel, Juliana Pinho, Nicasio Reed, Belicia Rhea, Abbey Schlanz, Elijah Rain Smith, Alyn Spector, Hebe Stanton, Melody Steiner, Romie Stott, Yejin Suh, Sonia Sulaiman, Ben Tyrrell, Renee Van Siclen, Kathryn Weaver, Liza Wemakor, Aigner Loren Wilson, E.M. Wright, Vicki Xu, and The Strange Horizons Editorial Collective\n\nWINNER: Uncanny Magazine, publishers and editors-in-chief Lynne M. Thomas and Michael Damian Thomas; managing/poetry editor Chimedum Ohaegbu; nonfiction editor Elsa Sjunneson; podcast producers Erika Ensign & Steven Schapansky\n\nBest Fanzine\n\nThe Full Lid, by Alasdair Stuart and Marguerite Kenner\n\nGalactic Journey, founder Gideon Marcus; editor Janice L. Newman; associate writers Gwyn Conaway, Jason Sacks, and John Boston\n\nJourney Planet, edited by Erin Underwood, Jean Martin, Sara Felix, Vanessa Applegate, Chuck Serface, Errick Nunnally, Evan Reeves, Steven H Silver, James Bacon, and Christopher J Garcia\n\nQuick Sip Reviews, editor Charles Payseur\n\nWINNER: Small Gods, Lee Moyer (icon) and Seanan McGuire (story)\n\nUnofficial Hugo Book Club Blog, editors Amanda Wakaruk and Olav Rokne\n\nBest Fancast\n\nBe The Serpent, presented by Alexandra Rowland, Freya Marske, and Jennifer Mace\n\nThe Coode Street Podcast, presented by Jonathan Strahan and Gary K. Wolfe, Jonathan Strahan producer\n\nHugo, Girl!, hosts Haley Zapal, Amy Salley, and Lori Anderson; producer/editor Kevin Anderson\n\nOctothorpe, by John Coxon, Alison Scott, and Liz Batty\n\nWINNER: Our Opinions Are Correct, presented by Annalee Newitz and Charlie Jane Anders, produced by Veronica Simonetti\n\nWorldbuilding for Masochists, presented by Cass Morris, Rowenna Miller, and Marshall Ryan Maresca\n\nBest Fan Writer\n\nChris M. Barkley\n\nBitter Karella\n\nAlex Brown\n\nWINNER: Cora Buhlert\n\nJason Sanford\n\nPaul Weimer\n\nBest Fan Artist\n\nIain J. Clark\n\nLorelei Esther\n\nSara Felix\n\nAriela Housman\n\nNilah Magruder\n\nWINNER: Lee Moyer\n\nLodestar Award for Best Young Adult Book (not a Hugo)\n\nChaos on CatNet by Naomi Kritzer (Tor Teen)\n\nIron Widow by Xiran Jay Zhao (Penguin Teen / Rock the Boat)\n\nWINNER: The Last Graduate by Naomi Novik (Del Rey Books)\n\n(Del Rey Books) Redemptor by Jordan Ifueko (Amulet Books / Hot Key Books)\n\nA Snake Falls to Earth by Darcie Little Badger (Levine Querido)\n\nVictories Greater Than Death by Charlie Jane Anders (Tor Teen / Titan)\n\nAstounding Award for Best New Writer, sponsored by Dell Magazines (not a Hugo)"}, {"url": "https://www.tor.com/2020/07/31/announcing-the-2020-hugo-award-winners/", "page_content": "The winners of the 2020 Hugo Awards have been announced at CoNZealand! You can read the full list below. Winners for the 2020 Hugo Awards and the 1945 Retrospective Hugo Awards appear in bold.\n\nThe Awards were presented on August 1, 2020 at a ceremony at the 78th World Science Fiction Convention in New Zealand, which was entirely virtual due to the ongoing COVID-19 pandemic.\n\nNominations for the 2020 and 1945 Hugo Awards were submitted by the members of CoNZealand, the 78th Worldcon, and Dublin 2019: An Irish Worldcon. 1,584 people submitted 27,033 nominations for the 2020 Hugo Awards, and 120 people submitted 1,677 nominations for the 1945 Retrospective Hugo Awards.\n\nCongrats to the finalists and winners!\n\n2020 Hugo Award Finalists\n\nBest Novel\n\nA Memory Called Empire, by Arkady Martine (Tor; Tor UK)\n\nThe City in the Middle of the Night, by Charlie Jane Anders (Tor; Titan)\n\nGideon the Ninth, by Tamsyn Muir (Tor.com Publishing)\n\nThe Light Brigade, by Kameron Hurley (Saga; Angry Robot UK)\n\nMiddlegame, by Seanan McGuire (Tor.com Publishing)\n\nThe Ten Thousand Doors of January, by Alix E. Harrow (Redhook; Orbit UK)\n\nBest Novella\n\nThis Is How You Lose the Time War, by Amal El-Mohtar and Max Gladstone (Saga Press; Jo Fletcher Books)\n\n“Anxiety Is the Dizziness of Freedom”, by Ted Chiang (Exhalation (Borzoi/Alfred A. Knopf; Picador)\n\nThe Deep, by Rivers Solomon, with Daveed Diggs, William Hutson & Jonathan Snipes (Saga Press/Gallery)\n\nThe Haunting of Tram Car 015, by P. Djèlí Clark (Tor.com Publishing)\n\nIn an Absent Dream, by Seanan McGuire (Tor.com Publishing)\n\nTo Be Taught, If Fortunate, by Becky Chambers (Harper Voyager; Hodder & Stoughton)\n\nBest Novelette\n\nEmergency Skin, by N.K. Jemisin (Forward Collection (Amazon))\n\n“The Archronology of Love”, by Caroline M. Yoachim (Lightspeed, April 2019)\n\n“Away With the Wolves”, by Sarah Gailey (Uncanny Magazine: Disabled People Destroy Fantasy Special Issue, September/October 2019)\n\n“The Blur in the Corner of Your Eye”, by Sarah Pinsker (Uncanny Magazine, July-August 2019)\n\n“For He Can Creep”, by Siobhan Carroll (Tor.com, 10 July 2019)\n\n“Omphalos”, by Ted Chiang (Exhalation (Borzoi/Alfred A. Knopf; Picador))\n\nBest Short Story\n\n“As the Last I May Know”, by S.L. Huang (Tor.com, 23 October 2019)\n\n“And Now His Lordship Is Laughing”, by Shiv Ramdas (Strange Horizons, 9 September 2019)\n\n“Blood Is Another Word for Hunger”, by Rivers Solomon (Tor.com, 24 July 2019)\n\n“A Catalog of Storms”, by Fran Wilde (Uncanny Magazine, January/February 2019)\n\n“Do Not Look Back, My Lion”, by Alix E. Harrow (Beneath Ceaseless Skies, January 2019)\n\n“Ten Excerpts from an Annotated Bibliography on the Cannibal Women of Ratnabar Island”, by Nibedita Sen (Nightmare Magazine, May 2019)\n\nBest Series\n\nThe Expanse, by James S. A. Corey (Orbit US; Orbit UK)\n\nInCryptid, by Seanan McGuire (DAW)\n\nLuna, by Ian McDonald (Tor; Gollancz)\n\nPlanetfall series, by Emma Newman (Ace; Gollancz)\n\nWinternight Trilogy, by Katherine Arden (Del Rey; Del Rey UK)\n\nThe Wormwood Trilogy, by Tade Thompson (Orbit US; Orbit UK)\n\nBest Related Work\n\n“2019 John W. Campbell Award Acceptance Speech”, by Jeannette Ng\n\nBecoming Superman: My Journey from Poverty to Hollywood, by J. Michael Straczynski (Harper Voyager US)\n\nJoanna Russ, by Gwyneth Jones (University of Illinois Press (Modern Masters of Science Fiction))\n\nThe Lady from the Black Lagoon: Hollywood Monsters and the Lost Legacy of Milicent Patrick, by Mallory O’Meara (Hanover Square)\n\nThe Pleasant Profession of Robert A. Heinlein, by Farah Mendlesohn (Unbound)\n\nWorlds of Ursula K. Le Guin, produced and directed by Arwen Curry\n\nBest Graphic Story or Comic\n\nLaGuardia, written by Nnedi Okorafor, art by Tana Ford, colours by James Devlin (Berger Books; Dark Horse)\n\nDie, Volume 1: Fantasy Heartbreaker, by Kieron Gillen and Stephanie Hans, letters by Clayton Cowles (Image)\n\nMonstress, Volume 4: The Chosen, written by Marjorie Liu, art by Sana Takeda (Image)\n\nMooncakes, by Wendy Xu and Suzanne Walker, letters by Joamette Gil (Oni Press; Lion Forge)\n\nPaper Girls, Volume 6, written by Brian K. Vaughan, drawn by Cliff Chiang, colours by Matt Wilson, letters by Jared K. Fletcher (Image)\n\nThe Wicked + The Divine, Volume 9: “Okay”, by Kieron Gillen and Jamie McKelvie, colours by Matt Wilson, letters by Clayton Cowles (Image)\n\nBest Dramatic Presentation, Long Form\n\nGood Omens, written by Neil Gaiman, directed by Douglas Mackinnon (Amazon Studios/BBC Studios/Narrativia/The Blank Corporation)\n\nAvengers: Endgame, screenplay by Christopher Markus and Stephen McFeely, directed by Anthony Russo and Joe Russo (Marvel Studios)\n\nCaptain Marvel, screenplay by Anna Boden, Ryan Fleck and Geneva Robertson-Dworet, directed by Anna Boden and Ryan Fleck (Walt Disney Pictures/Marvel Studios/Animal Logic (Australia))\n\nRussian Doll (Season One), created by Natasha Lyonne, Leslye Headland and Amy Poehler, directed by Leslye Headland, Jamie Babbit and Natasha Lyonne (3 Arts Entertainment/Jax Media/Netflix/Paper Kite Productions/Universal Television)\n\nStar Wars: The Rise of Skywalker, screenplay by Chris Terrio and J.J. Abrams, directed by J.J. Abrams (Walt Disney Pictures/Lucasfilm/Bad Robot)\n\nUs, written and directed by Jordan Peele (Monkeypaw Productions/Universal Pictures)\n\nBest Dramatic Presentation, Short Form\n\nThe Good Place: “The Answer”, written by Daniel Schofield, directed by Valeria Migliassi Collins (Fremulon/3 Arts Entertainment/Universal Television)\n\nThe Expanse: “Cibola Burn”, written by Daniel Abraham & Ty Franck and Naren Shankar, directed by Breck Eisner (Amazon Prime Video)\n\nWatchmen: “A God Walks into Abar”, written by Jeff Jensen and Damon Lindelof, directed by Nicole Kassell (HBO)\n\nThe Mandalorian: “Redemption”, written by Jon Favreau, directed by Taika Waititi (Disney+)\n\nDoctor Who: “Resolution”, written by Chris Chibnall, directed by Wayne Yip (BBC)\n\nWatchmen: “This Extraordinary Being”, written by Damon Lindelof and Cord Jefferson, directed by Stephen Williams (HBO)\n\nBest Editor, Short Form\n\nEllen Datlow\n\nNeil Clarke\n\nC.C. Finlay\n\nJonathan Strahan\n\nLynne M. Thomas and Michael Damian Thomas\n\nSheila Williams\n\nBest Editor, Long Form\n\nNavah Wolfe\n\nSheila E. Gilbert\n\nBrit Hvide\n\nDiana M. Pho\n\nDevi Pillai\n\nMiriam Weinberg\n\nBest Professional Artist\n\nJohn Picacio\n\nTommy Arnold\n\nRovina Cai\n\nGalen Dara\n\nYuko Shimizu\n\nAlyssa Winans\n\nBest Semiprozine\n\nUncanny Magazine, editors-in-chief Lynne M. Thomas and Michael Damian Thomas, nonfiction/managing editor Michi Trota, managing editor Chimedum Ohaegbu, podcast producers Erika Ensign and Steven Schapansky\n\nBeneath Ceaseless Skies, editor Scott H. Andrews\n\nEscape Pod, editors Mur Lafferty and S.B. Divya, assistant editor Benjamin C. Kinney, audio producers Adam Pracht and Summer Brooks, hosts Tina Connolly and Alasdair Stuart\n\nFireside Magazine, editor Julia Rios, managing editor Elsa Sjunneson, copyeditor Chelle Parker, social coordinator Meg Frank, publisher & art director Pablo Defendini, founding editor Brian White\n\nFIYAH Magazine of Black Speculative Fiction, executive editor Troy L. Wiggins, editors Eboni Dunbar, Brent Lambert, L.D. Lewis, Danny Lore, Brandon O’Brien and Kaleb Russell\n\nStrange Horizons, Vanessa Rose Phin, Catherine Krahe, AJ Odasso, Dan Hartland, Joyce Chng, Dante Luiz and the Strange Horizons staff\n\nBest Fanzine\n\nThe Book Smugglers, editors Ana Grilo and Thea James\n\nGalactic Journey, founder Gideon Marcus, editor Janice Marcus, senior writers Rosemary Benton, Lorelei Marcus and Victoria Silverwolf\n\nJourney Planet, editors James Bacon, Christopher J Garcia, Alissa McKersie, Ann Gry, Chuck Serface, John Coxon and Steven H Silver\n\nnerds of a feather, flock together, editors Adri Joy, Joe Sherry, Vance Kotrla, and The G\n\nQuick Sip Reviews, editor Charles Payseur\n\nThe Rec Center, editors Elizabeth Minkel and Gavia Baker-Whitelaw\n\nBest Fancast\n\nOur Opinions Are Correct, presented by Annalee Newitz and Charlie Jane Anders\n\nBe The Serpent, presented by Alexandra Rowland, Freya Marske and Jennifer Mace\n\nClaire Rousseau’s YouTube channel, produced & presented by Claire Rousseau\n\nThe Coode Street Podcast, presented by Jonathan Strahan and Gary K. Wolfe\n\nGalactic Suburbia, presented by Alisa Krasnostein, Alexandra Pierce and Tansy Rayner Roberts, producer Andrew Finch\n\nThe Skiffy and Fanty Show, presented by Jen Zink and Shaun Duke\n\nBest Fan Writer\n\nBogi Takács\n\nCora Buhlert\n\nJames Davis Nicoll\n\nAlasdair Stuart\n\nPaul Weimer\n\nAdam Whitehead\n\nBest Fan Artist\n\nElise Matthesen\n\nIain Clark\n\nSara Felix\n\nGrace P. Fong\n\nMeg Frank\n\nAriela Housman\n\nLodestar Award for Best Young Adult Book\n\nCatfishing on CatNet, by Naomi Kritzer (Tor Teen)\n\nDeeplight, by Frances Hardinge (Macmillan)\n\nDragon Pearl, by Yoon Ha Lee (Disney/Hyperion)\n\nMinor Mage, by T. Kingfisher (Argyll)\n\nRiverland, by Fran Wilde (Amulet)\n\nThe Wicked King, by Holly Black (Little, Brown; Hot Key)\n\nAstounding Award for the Best New Science Fiction Writer, sponsored by Dell Magazines\n\nR.F. Kuang (2nd year of eligibility)\n\nSam Hawke (2nd year of eligibility)\n\nJenn Lyons (1st year of eligibility)\n\nNibedita Sen (2nd year of eligibility)\n\nTasha Suri (2nd year of eligibility)\n\nEmily Tesh (1st year of eligibility)\n\n1945 Retro Hugo Award Finalists\n\nBest Novel\n\n“Shadow Over Mars” (The Nemesis from Terra), by Leigh Brackett (Startling Stories, Fall 1944)\n\nThe Golden Fleece, by Robert Graves (Cassell)\n\nLand of Terror, by Edgar Rice Burroughs (Edgar Rice Burroughs, Inc.)\n\nSirius: A Fantasy of Love and Discord, by Olaf Stapledon (Secker & Warburg)\n\nThe Wind on the Moon, by Eric Linklater (Macmillan)\n\n“The Winged Man”, by A.E. van Vogt and E. Mayne Hull (Astounding Science Fiction, May-June 1944)\n\nBest Novella\n\n“Killdozer!”, by Theodore Sturgeon (Astounding Science Fiction, November 1944)\n\n“The Changeling”, by A.E. van Vogt (Astounding Science Fiction, April 1944)\n\n“A God Named Kroo”, by Henry Kuttner (Thrilling Wonder Stories, Winter 1944)\n\n“Intruders from the Stars”, by Ross Rocklynne (Amazing Stories, January 1944)\n\n“The Jewel of Bas”, by Leigh Brackett (Planet Stories, Spring 1944)\n\n“Trog”, by Murray Leinster (Astounding Science Fiction, June 1944)\n\nBest Novelette\n\n“City”, by Clifford D. Simak (Astounding Science Fiction, May 1944)\n\n“Arena”, by Fredric Brown (Astounding Science Fiction, June 1944)\n\n“The Big and the Little” (“The Merchant Princes”), by Isaac Asimov (Astounding Science Fiction, August 1944)\n\n“The Children’s Hour”, by Lawrence O’Donnell (C.L. Moore and Henry Kuttner) (Astounding Science Fiction, March 1944)\n\n“No Woman Born”, by C.L. Moore (Astounding Science Fiction, December 1944)\n\n“When the Bough Breaks”, by Lewis Padgett (C.L. Moore and Henry Kuttner) (Astounding Science Fiction, November 1944)\n\nBest Short Story\n\n“I, Rocket”, by Ray Bradbury (Amazing Stories, May 1944)\n\n“And the Gods Laughed”, by Fredric Brown (Planet Stories, Spring 1944)\n\n“Desertion”, by Clifford D. Simak (Astounding Science Fiction, November 1944)\n\n“Far Centaurus”, by A. E. van Vogt (Astounding Science Fiction, January 1944)\n\n“Huddling Place”, by Clifford D. Simak (Astounding Science Fiction, July 1944)\n\n“The Wedge” (“The Traders”), by Isaac Asimov (Astounding Science Fiction, October 1944)\n\nBest Series\n\nThe Cthulhu Mythos, by H. P. Lovecraft, August Derleth, and others\n\nCaptain Future, by Brett Sterling\n\nDoc Savage, by Kenneth Robeson/Lester Dent\n\nJules de Grandin, by Seabury Quinn\n\nPellucidar, by Edgar Rice Burroughs\n\nThe Shadow, by Maxwell Grant (Walter B. Gibson)\n\nBest Related Work\n\n“The Science-Fiction Field”, by Leigh Brackett (Writer’s Digest, July 1944)\n\nFancyclopedia, by Jack Speer (Forrest J. Ackerman)\n\n’42 To ’44: A Contemporary Memoir Upon Human Behavior During the Crisis of the World Revolution, by H.G. Wells (Secker & Warburg)\n\nMr. Tompkins Explores the Atom, by George Gamow (Cambridge University Press)\n\nRockets: The Future of Travel Beyond the Stratosphere, by Willy Ley (Viking Press)\n\n“The Works of H.P. Lovecraft: Suggestions for a Critical Appraisal”, by Fritz Leiber (The Acolyte, Fall 1944)\n\nBest Graphic Story or Comic\n\nSuperman: “The Mysterious Mr. Mxyztplk” by Jerry Siegel, Ira Yarbrough and Joe Shuster (Detective Comics, Inc.)\n\nBuck Rogers: “Hollow Planetoid”, by Dick Calkins (National Newspaper Service)\n\nDonald Duck: “The Mad Chemist”, by Carl Barks (Dell Comics)\n\nFlash Gordon: “Battle for Tropica”, by Alex Raymond (King Features Syndicate)\n\nFlash Gordon: “Triumph in Tropica”, by Alex Raymond (King Features Syndicate)\n\nThe Spirit: “For the Love of Clara Defoe”, by Manly Wade Wellman, Lou Fine and Don Komisarow (Register and Tribune Syndicate)\n\nBest Dramatic Presentation, Short Form\n\nThe Canterville Ghost, screenplay by Edwin Harvey Blum from a story by Oscar Wilde, directed by Jules Dassin (Metro-Goldwyn-Mayer (MGM))\n\nThe Curse of the Cat People, written by DeWitt Bodeen, directed by Gunther V. Fritsch and Robert Wise (RKO Radio Pictures)\n\nDonovan’s Brain, adapted by Robert L. Richards from a story by Curt Siodmak, producer, director and editor William Spier (CBS Radio Network)\n\nHouse of Frankenstein, screenplay by Edward T. Lowe, Jr. from a story by Curt Siodmak, directed by Erle C. Kenton (Universal Pictures)\n\nThe Invisible Man’s Revenge, written by Bertram Millhauser, directed by Ford Beebe (Universal Pictures)\n\nIt Happened Tomorrow, screenplay and adaptation by Dudley Nichols and René Clair, directed by René Clair (Arnold Pressburger Films)\n\nBest Editor, Short Form\n\nJohn W. Campbell, Jr.\n\nOscar J. Friend\n\nMary Gnaedinger\n\nDorothy McIlwraith\n\nRaymond A. Palmer\n\nW. Scott Peacock\n\nBest Professional Artist\n\nMargaret Brundage\n\nEarle Bergey\n\nBoris Dolgov\n\nMatt Fox\n\nPaul Orban\n\nWilliam Timmins\n\nBest Fanzine\n\nVoice of the Imagi-Nation, edited by Forrest J. Ackerman and Myrtle R. Douglas\n\nThe Acolyte, edited by Francis T. Laney and Samuel D. Russell\n\nDiablerie, edited by Bill Watson\n\nFuturian War Digest, edited by J. Michael Rosenblum\n\nShangri L’Affaires, edited by Charles Burbee\n\nLe Zombie, edited by Bob Tucker and E.E. Evans\n\nBest Fan Writer"}, {"url": "https://www.tor.com/2019/08/18/announcing-the-2019-hugo-award-winners/", "page_content": "The winners of the 2019 Hugo Awards have been announced! You can read the full list below.\n\nThe Awards were presented on the evening of Sunday August 18th, 2019 at a ceremony at the 77th World Science Fiction Convention in Dublin, Ireland, hosted by Afua Richardson and Michael Scott.\n\nWinners for the 2019 Hugo Awards and the 1944 Retrospective Hugo Awards appear in bold. The awards were presented at Dublin 2019 – An Irish Worldcon, the 77th World Science Fiction Convention. Members of the convention cast a total of 3097 votes, all online except for eight paper ballots.\n\nCongrats to the finalists and winners!\n\n2019 HUGO AWARD FINALISTS\n\nBest Novel\n\nThe Calculating Stars, by Mary Robinette Kowal (Tor)\n\nRecord of a Spaceborn Few, by Becky Chambers (Hodder & Stoughton / Harper Voyager)\n\nRevenant Gun, by Yoon Ha Lee (Solaris)\n\nSpace Opera, by Catherynne M. Valente (Saga)\n\nSpinning Silver, by Naomi Novik (Del Rey / Macmillan)\n\nTrail of Lightning, by Rebecca Roanhorse (Saga)\n\nBest Novella\n\nArtificial Condition, by Martha Wells (Tor.com Publishing)\n\nBeneath the Sugar Sky, by Seanan McGuire (Tor.com Publishing)\n\nBinti: The Night Masquerade, by Nnedi Okorafor (Tor.com Publishing)\n\nThe Black God’s Drums, by P. Djèlí Clark (Tor.com Publishing)\n\nGods, Monsters, and the Lucky Peach, by Kelly Robson (Tor.com Publishing)\n\nThe Tea Master and the Detective, by Aliette de Bodard (Subterranean Press / JABberwocky Literary Agency)\n\nBest Novelette\n\n“If at First You Don’t Succeed, Try, Try Again,” by Zen Cho (B&N Sci-Fi and Fantasy Blog, 29 November 2018)\n\n“The Last Banquet of Temporal Confections,” by Tina Connolly (Tor.com, 11 July 2018)\n\n“Nine Last Days on Planet Earth,” by Daryl Gregory (Tor.com, 19 September 2018)\n\nThe Only Harmless Great Thing, by Brooke Bolander (Tor.com Publishing)\n\n“The Thing About Ghost Stories,” by Naomi Kritzer (Uncanny Magazine 25, November- December 2018)\n\n“When We Were Starless,” by Simone Heller (Clarkesworld 145, October 2018)\n\nBest Short Story\n\n“A Witch’s Guide to Escape: A Practical Compendium of Portal Fantasies,” by Alix E. Harrow (Apex Magazine, February 2018)\n\n“The Court Magician,” by Sarah Pinsker (Lightspeed, January 2018)\n\n“The Rose MacGregor Drinking and Admiration Society,” by T. Kingfisher (Uncanny Magazine 25, November-December 2018)\n\n“The Secret Lives of the Nine Negro Teeth of George Washington,” by P. Djèlí Clark (Fireside Magazine, February 2018)\n\n“STET,” by Sarah Gailey (Fireside Magazine, October 2018)\n\n“The Tale of the Three Beautiful Raptor Sisters, and the Prince Who Was Made of Meat,” by Brooke Bolander (Uncanny Magazine 23, July-August 2018)\n\nBest Series\n\nWayfarers, by Becky Chambers (Hodder & Stoughton / Harper Voyager)\n\nThe Centenal Cycle, by Malka Older (Tor.com Publishing)\n\nThe Laundry Files, by Charles Stross (most recently Tor.com Publishing/Orbit)\n\nMachineries of Empire, by Yoon Ha Lee (Solaris)\n\nThe October Daye Series, by Seanan McGuire (most recently DAW)\n\nThe Universe of Xuya, by Aliette de Bodard (most recently Subterranean Press)\n\nBest Related Work\n\nArchive of Our Own, a project of the Organization for Transformative Works\n\nAstounding: John W. Campbell, Isaac Asimov, Robert A. Heinlein, L. Ron Hubbard, and the Golden Age of Science Fiction, by Alec Nevala-Lee (Dey Street Books)\n\nThe Hobbit Duology (documentary in three parts), written and edited by Lindsay Ellis and Angelina Meehan (YouTube)\n\nAn Informal History of the Hugos: A Personal Look Back at the Hugo Awards, 1953- 2000, by Jo Walton (Tor)\n\nwww.mexicanxinitiative.com: The Mexicanx Initiative Experience at Worldcon 76 (Julia Rios, Libia Brenda, Pablo Defendini, John Picacio)\n\nUrsula K. Le Guin: Conversations on Writing, by Ursula K. Le Guin with David Naimon (Tin House Books)\n\nBest Graphic Story\n\nMonstress, Volume 3: Haven, written by Marjorie Liu, art by Sana Takeda (Image Comics)\n\nAbbott, written by Saladin Ahmed, art by Sami Kivelä, colours by Jason Wordie, letters by Jim Campbell (BOOM! Studios)\n\nBlack Panther: Long Live the King, written by Nnedi Okorafor and Aaron Covington, art by André Lima Araújo, Mario Del Pennino and Tana Ford (Marvel)\n\nOn a Sunbeam, by Tillie Walden (First Second)\n\nPaper Girls, Volume 4, written by Brian K. Vaughan, art by Cliff Chiang, colours by Matt Wilson, letters by Jared K. Fletcher (Image Comics)\n\nSaga, Volume 9, written by Brian K. Vaughan, art by Fiona Staples (Image Comics)\n\nBest Dramatic Presentation, Long Form\n\nSpider-Man: Into the Spider-Verse, screenplay by Phil Lord and Rodney Rothman, directed by Bob Persichetti, Peter Ramsey and Rodney Rothman (Sony)\n\nAnnihilation, directed and written for the screen by Alex Garland, based on the novel by Jeff VanderMeer (Paramount Pictures / Skydance)\n\nAvengers: Infinity War, screenplay by Christopher Markus and Stephen McFeely, directed by Anthony Russo and Joe Russo (Marvel Studios)\n\nBlack Panther, written by Ryan Coogler and Joe Robert Cole, directed by Ryan Coogler (Marvel Studios)\n\nA Quiet Place, screenplay by Scott Beck, John Krasinski and Bryan Woods, directed by John Krasinski (Platinum Dunes / Sunday Night)\n\nSorry to Bother You, written and directed by Boots Riley (Annapurna Pictures)\n\nBest Dramatic Presentation, Short Form\n\nThe Good Place: “Janet(s),” written by Josh Siegal & Dylan Morgan, directed by Morgan Sackett (NBC)\n\nThe Expanse: “Abaddon’s Gate,” written by Daniel Abraham, Ty Franck and Naren Shankar, directed by Simon Cellan Jones (Penguin in a Parka / Alcon Entertainment)\n\nDoctor Who: “Demons of the Punjab,” written by Vinay Patel, directed by Jamie Childs (BBC)\n\nDirty Computer, written by Janelle Monáe, directed by Andrew Donoho and Chuck Lightning (Wondaland Arts Society / Bad Boy Records / Atlantic Records)\n\nThe Good Place: “Jeremy Bearimy,” written by Megan Amram, directed by Trent O’Donnell (NBC)\n\nDoctor Who: “Rosa,” written by Malorie Blackman and Chris Chibnall, directed by Mark Tonderai (BBC)\n\nBest Professional Editor, Long Form\n\nNavah Wolfe\n\nSheila E. Gilbert\n\nAnne Lesley Groell\n\nBeth Meacham\n\nDiana Pho\n\nGillian Redfearn\n\nBest Professional Editor, Short Form\n\nGardner Dozois\n\nNeil Clarke\n\nLee Harris\n\nJulia Rios\n\nLynne M. Thomas and Michael Damian Thomas\n\nE. Catherine Tobler\n\nBest Professional Artist\n\nCharles Vess\n\nGalen Dara\n\nJaime Jones\n\nVicto Ngai\n\nJohn Picacio\n\nYuko Shimizu\n\nBest Art Book\n\nThe Books of Earthsea: The Complete Illustrated Edition, illustrated by Charles Vess, written by Ursula K. Le Guin (Saga Press /Gollancz)\n\nDaydreamer’s Journey: The Art of Julie Dillon, by Julie Dillon (self-published)\n\nDungeons & Dragons Art & Arcana: A Visual History, by Michael Witwer, Kyle Newman, Jon Peterson, Sam Witwer (Ten Speed Press)\n\nSpectrum 25: The Best in Contemporary Fantastic Art, ed. John Fleskes (Flesk Publications)\n\nSpider-Man: Into the Spider-Verse – The Art of the Movie, by Ramin Zahed (Titan Books)\n\nTolkien: Maker of Middle-earth, ed. Catherine McIlwaine (Bodleian Library)\n\nBest Semiprozine\n\nUncanny Magazine, publishers/editors-in-chief Lynne M. Thomas and Michael Damian Thomas, managing editor Michi Trota, podcast producers Erika Ensign and Steven Schapansky, Disabled People Destroy Science Fiction Special Issue editors-in-chief Elsa Sjunneson-Henry and Dominik Parisien\n\nBeneath Ceaseless Skies, editor-in-chief and publisher Scott H. Andrews\n\nFireside Magazine, edited by Julia Rios, managing editor Elsa Sjunneson-Henry, copyeditor Chelle Parker; social coordinator Meg Frank, special features editor Tanya DePass, founding editor Brian White, publisher and art director Pablo Defendini\n\nFIYAH Magazine of Black Speculative Fiction, executive editors Troy L. Wiggins and DaVaun Sanders, editors L.D. Lewis, Brandon O’Brien, Kaleb Russell, Danny Lore, and Brent Lambert\n\nShimmer, publisher Beth Wodzinski, senior editor E. Catherine Tobler\n\nStrange Horizons, edited by Jane Crowley, Kate Dollarhyde, Vanessa Rose Phin, Vajra Chandrasekera, Romie Stott, Maureen Kincaid Speller, and the Strange Horizons Staff\n\nBest Fanzine\n\nLady Business, editors Ira, Jodie, KJ, Renay & Susan\n\nGalactic Journey, founder Gideon Marcus, editor Janice Marcus\n\nJourney Planet, edited by Team Journey Planet\n\nnerds of a feather, flock together, editors Joe Sherry, Vance Kotrla and The G\n\nQuick Sip Reviews, editor Charles Payseur\n\nRocket Stack Rank, editors Greg Hullender and Eric Wong\n\nBest Fancast\n\nOur Opinions Are Correct, hosted by Annalee Newitz and Charlie Jane Anders\n\nBe the Serpent, presented by Alexandra Rowland, Freya Marske and Jennifer Mace\n\nThe Coode Street Podcast, presented by Jonathan Strahan and Gary K. Wolfe\n\nFangirl Happy Hour, hosted by Ana Grilo and Renay Williams\n\nGalactic Suburbia, hosted by Alisa Krasnostein, Alexandra Pierce, and Tansy Rayner Roberts, produced by Andrew Finch\n\nThe Skiffy and Fanty Show, produced by Jen Zink and Shaun Duke, hosted by the Skiffy and Fanty Crew\n\nBest Fan Writer\n\nFoz Meadows\n\nJames Davis Nicoll\n\nCharles Payseur\n\nElsa Sjunneson-Henry\n\nAlasdair Stuart\n\nBogi Takács\n\nBest Fan Artist\n\nLikhain (Mia Sereno)\n\nSara Felix\n\nGrace P. Fong\n\nMeg Frank\n\nAriela Housman\n\nSpring Schoenhuth\n\nJohn W. Campbell Award for Best New Writer\n\nJeannette Ng (2nd year of eligibility)\n\nKatherine Arden (2nd year of eligibility)\n\nS.A. Chakraborty (2nd year of eligibility)\n\nR.F. Kuang (1st year of eligibility)\n\nVina Jie-Min Prasad (2nd year of eligibility)\n\nRivers Solomon (2nd year of eligibility)\n\nLodestar Award for Best Young Adult Book\n\nChildren of Blood and Bone, by Tomi Adeyemi (Henry Holt / Macmillan Children’s Books)\n\nThe Belles, by Dhonielle Clayton (Freeform / Gollancz)\n\nThe Cruel Prince, by Holly Black (Little, Brown / Hot Key Books)\n\nDread Nation, by Justina Ireland (Balzer + Bray)\n\nThe Invasion, by Peadar O’Guilin (David Fickling Books / Scholastic)\n\nTess of the Road, by Rachel Hartman (Random House / Penguin Teen)\n\n1944 RETROSPECTIVE HUGO AWARD FINALISTS\n\nBest Novel\n\nConjure Wife, by Fritz Leiber, Jr. (Unknown Worlds, April 1943)\n\nEarth’s Last Citadel, by C.L. Moore and Henry Kuttner (Argosy, April 1943)\n\nGather, Darkness! by Fritz Leiber, Jr. (Astounding Science-Fiction, May-July 1943)\n\nDas Glasperlenspiel [The Glass Bead Game], by Hermann Hesse (Fretz & Wasmuth)\n\nPerelandra, by C.S. Lewis (John Lane, The Bodley Head)\n\nThe Weapon Makers, by A.E. van Vogt (Astounding Science-Fiction, February-April 1943)\n\nBest Novella\n\nThe Little Prince, by Antoine de Saint-Exupéry (Reynal & Hitchcock)\n\n“Attitude,” by Hal Clement (Astounding Science-Fiction, September 1943)\n\n“Clash by Night,” by Lawrence O’Donnell (Henry Kuttner & C.L. Moore) (Astounding Science-Fiction, March 1943)\n\n“The Dream-Quest of Unknown Kadath,” by H.P. Lovecraft, (Beyond the Wall of Sleep, Arkham House)\n\nThe Magic Bed-Knob; or, How to Become a Witch in Ten Easy Lessons, by Mary Norton (Hyperion Press)\n\n“We Print the Truth,” by Anthony Boucher (Astounding Science-Fiction, December 1943)\n\nBest Novelette\n\n“Mimsy Were the Borogoves,” by Lewis Padgett (C.L. Moore & Henry Kuttner) (Astounding Science-Fiction, February 1943)\n\n“Citadel of Lost Ships,” by Leigh Brackett (Planet Stories, March 1943)\n\n“The Halfling,” by Leigh Brackett (Astonishing Stories, February 1943)\n\n“The Proud Robot,” by Lewis Padgett (Henry Kuttner) (Astounding Science-Fiction, February 1943)\n\n“Symbiotica,” by Eric Frank Russell (Astounding Science-Fiction, October 1943)\n\n“Thieves’ House,” by Fritz Leiber, Jr (Unknown Worlds, February 1943)\n\nBest Short Story\n\n“King of the Gray Spaces” (“R is for Rocket”), by Ray Bradbury (Famous Fantastic Mysteries, December 1943)\n\n“Death Sentence,” by Isaac Asimov (Astounding Science Fiction, November 1943)\n\n“Doorway into Time,” by C.L. Moore (Famous Fantastic Mysteries, September 1943)\n\n“Exile,” by Edmond Hamilton (Super Science Stories, May 1943)\n\n“Q.U.R.,” by H.H. Holmes (Anthony Boucher) (Astounding Science-Fiction, March 1943)\n\n“Yours Truly – Jack the Ripper,” by Robert Bloch (Weird Tales, July 1943)\n\nBest Graphic Story\n\nWonder Woman #5: Battle for Womanhood, written by William Moulton Marston, art by Harry G. Peter (DC Comics)\n\nBuck Rogers: Martians Invade Jupiter, by Philip Nowlan and Dick Calkins (National Newspaper Service)\n\nFlash Gordon: Fiery Desert of Mongo, by Alex Raymond (King Features Syndicate)\n\nGarth, by Steve Dowling (Daily Mirror)\n\nPlastic Man #1: The Game of Death, by Jack Cole (Vital Publications)\n\nLe Secret de la Licorne [The Secret of the Unicorn], by Hergé (Le Soir)\n\nBest Dramatic Presentation, Long Form\n\nHeaven Can Wait, written by Samson Raphaelson, directed by Ernst Lubitsch (20th Century Fox)\n\nBatman, written by Victor McLeod, Leslie Swabacker and Harry L. Fraser, directed by Lambert Hillyer (Columbia Pictures)\n\nCabin in the Sky, written by Joseph Schrank, directed by Vincente Minnelli and Busby Berkeley (uncredited) (MGM)\n\nA Guy Named Joe, written by Frederick Hazlitt Brennan and Dalton Trumbo, directed by Victor Fleming (MGM)\n\nMünchhausen, written by Erich Kästner and Rudolph Erich Raspe, directed by Josef von Báky (UFA)\n\nPhantom of the Opera, written by Eric Taylor, Samuel Hoffenstein and Hans Jacoby, directed by Arthur Lubin (Universal Pictures)\n\nBest Dramatic Presentation, Short Form\n\nFrankenstein Meets the Wolfman, written by Curt Siodmak, directed by Roy William Neill (Universal Pictures)\n\nThe Ape Man, written by Barney A. Sarecky, directed by William Beaudine (Banner Productions)\n\nDer Fuehrer’s Face, story by Joe Grant and Dick Huemer, directed by Jack Kinney (Disney)\n\nI Walked With a Zombie, written by Curt Siodmak and Ardel Wray, directed by Jacques Tourneur (RKO Radio Pictures)\n\nThe Seventh Victim, written by Charles O’Neal and DeWitt Bodeen, directed by Mark Robson (RKO Radio Pictures)\n\nSuper-Rabbit, written by Tedd Pierce, directed by Charles M. Jones (Warner Bros)\n\nBest Professional Editor, Short Form\n\nJohn W. Campbell\n\nOscar J. Friend\n\nMary Gnaedinger\n\nDorothy McIlwraith\n\nRaymond A. Palmer\n\nDonald A. Wollheim\n\nBest Professional Artist\n\nVirgil Finlay\n\nHannes Bok\n\nMargaret Brundage\n\nAntoine de Saint-Exupéry\n\nJ. Allen St. John\n\nWilliam Timmins\n\nBest Fanzine\n\nLe Zombie, editor Wilson “Bob” Tucker\n\nGuteto, edited by Morojo (Myrtle R. Douglas)\n\nFuturian War Digest, editor J. Michael Rosenblum\n\nThe Phantagraph, editor Donald A. Wollheim\n\nVoice of the Imagi-Nation, editors Jack Erman (Forrest J Ackerman) & Morojo (Myrtle Douglas)\n\nYHOS, editor Art Widner\n\nNote: An error in the original vote tally for the 1944 Retro Hugo Awards placed Fantasy News by editor William S. Sykora on the finalist ballot instead of Guteto, edited by Morojo (Myrtle R. Douglas). Write-in votes for Guteto on previously printed hard copy versions of the ballot will be accepted.\n\nBest Fan Writer\n\nForrest J. Ackerman\n\nMorojo (Myrtle Douglas)\n\nJack Speer\n\nWilson “Bob” Tucker\n\nArt Widner\n\nDonald A. Wollheim\n\nFull voting results can be found here.\n\nThe Hugo Awards are the premier award in the science fiction genre, honouring science fiction literature and media as well as the genre’s fans. The Awards were first presented at the 1953 World Science Fiction Convention in Philadelphia (Philcon II), and they have continued to honour science fiction and fantasy notables for more than 60 years.\n\n“Dublin 2019 – An Irish Worldcon” will take place in and around the Convention Centre Dublin from 15 to 19 August. More than 5600 people have already signed up as members, including more than 4580 attending members.\n\nOnly Dublin 2019 members will be able to vote on the final ballot and choose the winners. The 1944 Retro Hugo Awards will be presented on Thursday, 15 August, the opening night of Dublin 2019, and the 2019 Hugo Awards, and the Lodestar and Campbell Awards, will be presented on Sunday, 18 August as part of the main Hugo Awards ceremony. The 2019 Hugo base will be designed by Dublin artist Jim Fitzpatrick. The 1944 Retro Hugo base will be designed by Eleanor Wheeler, a ceramicist in County Down. The 2019 Lodestar Award will be designed by Sara Felix, the Austin, Texas-based president of the Association of Science Fiction and Fantasy Artists.\n\nMore information about the Hugo Awards, including details about how to submit a nominating ballot. More information and membership registration for Dublin 2019 are available here. Follow Dublin 2019 on Twitter."}, {"url": "https://www.comicsbeat.com/2021-hugo-award-winners/", "page_content": "The 2021 Hugo Awards were held at the 79th World Science Fiction Convention this past weekend. Among the winners were Damian Duffy and John Jennings‘ graphic novel adaptation of Octavia E. Butler‘s The Parable of the Sower, which won the 2021 Hugo Award for Best Graphic Story or Comic.\n\nThe 2020-released adaptation of Butler’s 1993 dystopian science fiction novel beat – amongst others – Marjorie Liu and Sana Takeda‘s already three-time award winning series Monstress, and two Kieron Gillen-written series on the ballot (the second volume of Die, with Stephanie Hans; and the first volume of Once & Future, with Dan Mora).\n\nDuffy, accepting the 2021 Hugo on behalf of himself and Jennings, first read out a statement from the Octavia Butler Estate:\n\n“First and foremost, it is most important to say that Octavia Butler has Treasured The Two previous coveted Hugo awards she has received during the coUrse of her lifetime, and today, On behalf of The Octavia Butler Estate and Octavia E. Butler Enterprises, we are deeply honored and proud that this adaptation of PARABLE OF THE SOWER has been nominated for “Best Graphic Novel”, which now makes for a Third Hugo Award for Octavia Butler. Again we are most appreciative for receiving this award on Behalf of Octavia Butler… Thank you.\n\nDuffy continued,\n\n“From John and I both: Thank you to, obviously, Octavia E. Butler – because she’s a genius and awesome and why we do anything. And thank you to the Butler Estate…for letting us work with them to do these adaptations. Thank you to our editor, Charlotte Greenbaum and our editorial consultant the great Tananarive Due. Thank you to Nalo Hopkinson for writing our introduction, and to our many colour flatters who – I don’t have a list of names but you know who you are and thank you. And thank you to Charlie Kochman and maya Bradford, and to everyone at Abrams ComicArts. On behalf of John, thank you to his wife Tawana and their son Jaxon, who was born during the creation of this book. So, of course, I have to thank my family now: thank you to my parents, my mom Sharon, my wife Jen, my son Simon, my daughter Gwen. Thank you also to Chris and Jeff for giving me a space to drink beer and not have a nervous breakdown waiting for the announcement of this award. While such an honour and a privilege to collaborate with Octavia’s words, and to win this award and to be part of all of this, I wish even more that the Earthseed books, their dystopian warning of a capitalistic hellscape were not so prescient, and I hope that Octavia’s advice for hope and resistance for the future is more carefully attended. Thank you so much. Thank you to everyone I forgot. Thank you.\n\nJohn Jennings later posted on Facebook,\n\n“I’ve been a fan of science fiction as long as I can remember. My mom got me hooked on speculative fiction at a young age and I’ve never looked back. However, when I read WILD SEED by Octavia E. Butler, I saw something that I’d never seen before in those stories. I saw people who looked like me. The novel had a connection to the African diaspora and Black people were central and vital to the narrative. WILD SEED changed everything about what I was doing with my own attempts at writing. Octavia Butler shifted the paradigm for me. Today, my friend and collaborator Dr. Damian Duffy won The Hugo Award for the adaptation we did of one of Butler’s most beloved and prescient works: THE PARABLE OF THE SOWER. It’s an honor that I am incredibly moved by and I hope that we truly have added to her legacy. Feeling very grateful.”\n\nPublisher Abrams tweeted:\n\nAmazing news! The graphic novel adaptation of PARABLE OF THE SOWER has won the 2021 @thehugoawards for Best Graphic Story or Comic. A huge congratulations to @JIJennings and Damian Duffy! https://t.co/PaOfV3YupA pic.twitter.com/5gGLF3jIsh — ABRAMS Books (@ABRAMSbooks) December 20, 2021\n\nDuffy and Jennings are already at work on adapting Butler’s 1998 sequel Parable of the Talents.\n\nParable of the Sower is the pair’s second Butler adaptation. In 2017 they released Kindred. A New York Times bestseller, the book also earned the pair a Bram Stoker Award that same year.\n\nAlso comics-related, the movie adaptation of Greg Rucka and Leandro Fernández’ 2017 Image series The Old Guard won the 2021 Hugo for Best Dramatic Presentation, Long Form. Rucka himself wrote the screenplay for the Netflix-released movie, directed by Gina Prince-Bythwood and starring Charlize Theron.\n\nIn other news, the widely lauded Supergiant Games’ Hades won the one-off special Video Game Hugo, and the series finale of The Good Place won Best Dramatic Presentation, Short Form.\n\nBelow are the winners and nominees of the 2021 Hugo Awards in full.\n\nBest Novel\n\nWINNER: Network Effect, Martha Wells (Tor.com)\n\nBlack Sun, Rebecca Roanhorse (Gallery / Saga Press)\n\nThe City We Became, N.K. Jemisin (Orbit)\n\nHarrow The Ninth, Tamsyn Muir (Tor.com)\n\nPiranesi, Susanna Clarke (Bloomsbury)\n\nThe Relentless Moon, Mary Robinette Kowal (Tor Books)\n\nBest Novella\n\nWINNER: The Empress of Salt and Fortune, Nghi Vo (Tor.com)\n\nCome Tumbling Down, Seanan McGuire (Tor.com)\n\nFinna, Nino Cipri (Tor.com)\n\nRing Shout, P. Djèlí Clark (Tor.com)\n\nRiot Baby, Tochi Onyebuchi (Tor.com)\n\nUpright Women Wanted, Sarah Gailey (Tor.com)\n\nBest Novelette\n\nWINNER: Two Truths and a Lie, Sarah Pinsker (Tor.com)\n\n“Burn, or the Episodic Life of Sam Wells as a Super”, A.T. Greenblatt (Uncanny Magazine, May/June 2020)\n\n“Helicopter Story”, Isabel Fall (Clarkesworld, January 2020)\n\n“The Inaccessibility of Heaven”, Aliette de Bodard (Uncanny Magazine, July/August 2020)\n\n“Monster”, Naomi Kritzer (Clarkesworld, January 2020)\n\n“The Pill”, Meg Elison (from Big Girl, (PM Press))\n\nBest Short Story\n\nWINNER: “Metal Like Blood in the Dark”, T. Kingfisher (Uncanny Magazine, September/October 2020)\n\n“Badass Moms in the Zombie Apocalypse”, Rae Carson (Uncanny Magazine, January/February 2020)\n\n“A Guide for Working Breeds”, Vina Jie-Min Prasad (Made to Order: Robots and Revolution, ed. Jonathan Strahan (Solaris))\n\nLittle Free Library, Naomi Kritzer (Tor.com)\n\n“The Mermaid Astronaut”, Yoon Ha Lee (Beneath Ceaseless Skies, February 2020)\n\n“Open House on Haunted Hill”, John Wiswell (Diabolical Plots – 2020, ed. David Steffen)\n\nBest Series\n\nWINNER: The Murderbot Diaries, Martha Wells (Tor.com)\n\nThe Daevabad Trilogy, S.A. Chakraborty (Harper Voyager)\n\nThe Interdependency, John Scalzi (Tor Books)\n\nThe Lady Astronaut Universe, Mary Robinette Kowal (Tor Books/Audible/Magazine of Fantasy and Science Fiction)\n\nOctober Daye, Seanan McGuire (DAW)\n\nThe Poppy War, R.F. Kuang (Harper Voyager)\n\nBest Related Work\n\nWINNER: Beowulf: A New Translation, Maria Dahvana Headley (FSG)\n\nCoNZealand Fringe, Claire Rousseau, C, Cassie Hart, Adri Joy, Marguerite Kenner, Cheryl Morgan, Alasdair Stuart.\n\nFIYAHCON, L.D. Lewis–Director, Brent Lambert–Senior Programming Coordinator, Iori Kusano–FIYAHCON Fringe Co-Director, Vida Cruz–FIYAHCON Fringe Co-Director, and the Incredible FIYAHCON team\n\n“George R.R. Martin Can Fuck Off Into the Sun, Or: The 2020 Hugo Awards Ceremony (Rageblog Edition)”, Natalie Luhrs (Pretty Terrible, August 2020)\n\nA Handful of Earth, A Handful of Sky: The World of Octavia E. Butler, Lynell George (Angel City Press)\n\nThe Last Bronycon: a fandom autopsy, Jenny Nicholson (YouTube)\n\nBest Graphic Story or Comic\n\nWINNER: Parable of the Sower: A Graphic Novel Adaptation, written by Octavia Butler, adapted by Damian Duffy, illustrated by John Jennings (Harry N. Abrams)\n\nDIE, Volume 2: Split the Party, written by Kieron Gillen and Stephanie Hans, letters by Clayton Cowles (Image Comics)\n\nGhost-Spider vol. 1: Dog Days Are Over, Author: Seanan McGuire, Artist: Takeshi Miyazawa and Rosie Kämpe (Marvel)\n\nInvisible Kingdom, vol 2: Edge of Everything, Author: G. Willow Wilson, Artist: Christian Ward (Dark Horse Comics)\n\nMonstress, vol. 5: Warchild, Author: Marjorie Liu, Artist: Sana Takeda (Image Comics)\n\nOnce & Future vol. 1: The King Is Undead, written by Kieron Gillen, iIllustrated by Dan Mora, colored by Tamra Bonvillain, lettered by Ed Dukeshire (BOOM! Studios)\n\nBest Dramatic Presentation, Long Form\n\nWINNER: The Old Guard, written by Greg Rucka, directed by Gina Prince-Bythewood (Netflix / Skydance Media)\n\nBirds of Prey (and the Fantabulous Emancipation of One Harley Quinn), written by Christina Hodson, directed by Cathy Yan (Warner Bros.)\n\nEurovision Song Contest: The Story of Fire Saga, written by Will Ferrell, Andrew Steele, directed by David Dobkin (European Broadcasting Union/Netflix)\n\nPalm Springs, written by Andy Siara, directed by Max Barbakow (Limelight / Sun Entertainment Culture / The Lonely Island / Culmination Productions / Neon / Hulu / Amazon Prime)\n\nSoul, screenplay by Pete Docter, Mike Jones and Kemp Powers, directed by Pete Docter, co-directed by Kemp Powers, produced by Dana Murray (Pixar Animation Studios/ Walt Disney Pictures)\n\nTenet, written and directed by Christopher Nolan (Warner Bros./Syncopy)\n\nBest Dramatic Presentation, Short Form\n\nWINNER: The Good Place: Whenever You’re Ready, written and directed by Michael Schur (Fremulon / 3 Arts Entertainment / Universal Television, a division of Universal Studio Group)\n\nDoctor Who: Fugitive of the Judoon, written by Vinay Patel and Chris Chibnall, directed by Nida Manzoor (BBC)\n\nThe Expanse: Gaugamela, written by Dan Nowak, directed by Nick Gomez (Alcon Entertainment / Alcon Television Group / Amazon Studios / Hivemind / Just So)\n\nShe-Ra and the Princesses of Power: Heart (parts 1 and 2), written by Josie Campbell and Noelle Stevenson, directed by Jen Bennett and Kiki Manrique (DreamWorks Animation Television / Netflix)\n\nThe Mandalorian: Chapter 13: The Jedi, written and directed by Dave Filoni (Golem Creations / Lucasfilm / Disney+)\n\nThe Mandalorian: Chapter 16: The Rescue, written by Jon Favreau, directed by Peyton Reed (Golem Creations / Lucasfilm / Disney+)\n\nBest Editor, Short Form\n\nWINNER: Ellen Datlow\n\nNeil Clarke\n\nC.C. Finlay\n\nMur Lafferty and S.B. Divya\n\nJonathan Strahan\n\nSheila Williams\n\nBest Editor, Long Form\n\nWINNER: Diana M. Pho\n\nNivia Evans\n\nSheila E. Gilbert\n\nSarah Guan\n\nBrit Hvide\n\nNavah Wolfe\n\nBest Professional Artist\n\nWINNER: Rovina Cai\n\nTommy Arnold\n\nGalen Dara\n\nMaurizio Manzieri\n\nJohn Picacio\n\nAlyssa Winans\n\nBest Semiprozine\n\nWINNER: FIYAH Magazine of Black Speculative Fiction, publisher Troy L. Wiggins, executive editor DaVaun Sanders, managing editor Eboni Dunbar, poetry editor Brandon O’Brien, reviews and social media Brent Lambert, art director L. D. Lewis, and the FIYAH Team.\n\nBeneath Ceaseless Skies, ed. Scott H. Andrews\n\nEscape Pod, editors Mur Lafferty and S.B. Divya, assistant editor Benjamin C. Kinney, hosts Tina Connolly and Alasdair Stuart, audio producers Summer Brooks and Adam Pracht and the entire Escape Pod team.\n\nPodCastle, editors, C.L. Clark and Jen R. Albert, assistant editor and host, Setsu Uzumé, producer Peter Adrian Behravesh, and the entire PodCastle team.\n\nUncanny Magazine, editors in chief: Lynne M. Thomas and Michael Damian Thomas, managing editor: Chimedum Ohaegbu, non-fiction editor: Elsa Sjunneson, podcast producers: Erika Ensign and Steven Schapansky\n\nStrange Horizons, Vanessa Aguirre, Joseph Aitken, Rachel Ayers, M H Ayinde, Tierney Bailey, Scott Beggs, Drew Matthew Beyer, Gautam Bhatia, S. K. Campbell, Zhui Ning Chang, Rita Chen, Tania Chen, Joyce Chng, Liz Christman, Linda H. Codega, Kristian Wilson Colyard, Yelena Crane, Bruhad Dave, Sarah Davidson, Tahlia Day, Arinn Dembo, Nathaniel Eakman, Belen Edwards, George Tom Elavathingal, Rebecca Evans, Ciro Faienza, Courtney Floyd, Lila Garrott, Colette Grecco, Guananí Gómez-Van Cortright, Julia Gunnison, Dan Hartland, Sydney Hilton, Angela Hinck, Stephen Ira, Amanda Jean, Ai Jiang, Sean Joyce-Farley, Erika Kanda, Anna Krepinsky, Kat Kourbeti, Clayton Kroh, Maureen Kincaid Speller, Catherine Krahe, Natasha Leullier, A.Z. Louise, Dante Luiz, Gui Machiavelli, Cameron Mack, Samantha Manaktola, Marisa Manuel, Jean McConnell, Heather McDougal, Maria Morabe, Amelia Moriarty, Emory Noakes, Sarah Noakes, Aidan Oatway, AJ Odasso, Joel Oliver-Cormier, Kristina Palmer, Karintha Parker, Anjali Patel, Vanessa Rose Phin, Nicasio Reed, Belicia Rhea, Endria Richardson, Natalie Ritter, Abbey Schlanz, Clark Seanor, Elijah Rain Smith, Hebe Stanton, Melody Steiner, Romie Stott, Yejin Suh, Kwan-Ann Tan, Luke Tolvaj, Ben Tyrrell, Renee Van Siclen, Kathryn Weaver, Liza Wemakor, Aigner Loren Wilson, E.M. Wright, Vicki Xu, Fred G. Yost, staff members who prefer not to be named, and guest editor Libia Brenda with guest first reader Raquel González-Franco Alva for the Mexicanx special issue\n\nBest Fanzine\n\nWINNER: nerds of a feather, flock together, ed. Adri Joy, Joe Sherry, The G, and Vance Kotrla\n\nThe Full Lid, written by Alasdair Stuart, edited by Marguerite Kenner\n\nJourney Planet, edited by Michael Carroll, John Coxon, Sara Felix, Ann Gry, Sarah Gulde, Alissa McKersie, Errick Nunnally, Pádraig Ó Méalóid, Chuck Serface, Steven H. Silver, Paul Trimble, Erin Underwood, James Bacon, and Chris Garcia.\n\nLady Business, editors. Ira, Jodie, KJ, Renay, and Susan.\n\nnerds of a feather, flock together, ed. Adri Joy, Joe Sherry, The G, and Vance Kotrla\n\nnerds of a feather, flock together, ed. Adri Joy, Joe Sherry, The G, and Vance Kotrla Quick Sip Reviews, editor, Charles Payseur\n\nUnofficial Hugo Book Club Blog, ed. Amanda Wakaruk and Olav Rokne\n\nBest Fancast\n\nWINNER: The Coode Street Podcast, presented by Jonathan Strahan and Gary K. Wolfe, Jonathan Strahan, producer\n\nBe The Serpent, presented by Alexandra Rowland, Freya Marske and Jennifer Mace\n\nClaire Rousseau’s YouTube channel, produced by Claire Rousseau\n\nKalanadi, produced and presented by Rachel\n\nThe Skiffy and Fanty show, produced by Shaun Duke and Jen Zink, presented by Shaun Duke, Jen Zink, Alex Acks, Paul Weimer, and David Annandale.\n\nWorldbuilding for Masochists, presented by Rowenna Miller, Marshall Ryan Maresca and Cass Morris\n\nBest Fan Writer\n\nWINNER: Elsa Sjunneson\n\nCora Buhlert\n\nCharles Payseur\n\nJason Sanford\n\nAlasdair Stuart\n\nPaul Weimer\n\nBest Fan Artist\n\nWINNER: Sara Felix\n\nIain J. Clark\n\nCyan Daly\n\nGrace P. Fong\n\nMaya Hahto\n\nLaya Rose\n\nBest Video Game [One-time Special Hugo Award Category]\n\nWINNER: Hades (Publisher and Developer: Supergiant Games)\n\nAnimal Crossing: New Horizons (Publisher and Developer: Nintendo)\n\nBlaseball (Publisher and Developer: The Game Band)\n\nFinal Fantasy VII Remake (Publisher Square Enix)\n\nThe Last of Us: Part II (Publisher: Sony Interactive Entertainment / Developer: Naughty Dog)\n\nSpiritfarer (Publisher and Developer: Thunder Lotus)\n\nLike this: Like Loading..."}, {"url": "https://www.tor.com/2019/04/02/2019-hugo-award-finalists-announced/", "page_content": "The finalists for the 2019 Hugo Awards, John W. Campbell Award for Best New Writer, the World Science Fiction Society (WSFS) Award for Best Young Adult Book, and the 1944 Retrospective Hugo Awards have been announced! You can read the full list below.\n\nThere were 1800 valid nominating ballots (1797 electronic and 3 paper) received and counted from the members of the 2018 and 2019 World Science Fiction Conventions for the 2019 Hugo Awards. For the 1944 Retro Hugo Awards, 217 valid nominating ballots (214 electronic and 3 paper) were received. Voting on the final ballot will open later in April.\n\nThe webcast announcing the finalists is available for viewing on the Dublin 2019 YouTube channel.\n\n2019 HUGO AWARD FINALISTS\n\nBest Novel\n\nThe Calculating Stars , by Mary Robinette Kowal (Tor)\n\n, by Mary Robinette Kowal (Tor) Record of a Spaceborn Few , by Becky Chambers (Hodder & Stoughton / Harper Voyager)\n\n, by Becky Chambers (Hodder & Stoughton / Harper Voyager) Revenant Gun , by Yoon Ha Lee (Solaris)\n\n, by Yoon Ha Lee (Solaris) Space Opera , by Catherynne M. Valente (Saga)\n\n, by Catherynne M. Valente (Saga) Spinning Silver , by Naomi Novik (Del Rey / Macmillan)\n\n, by Naomi Novik (Del Rey / Macmillan) Trail of Lightning, by Rebecca Roanhorse (Saga)\n\nBest Novella\n\nArtificial Condition , by Martha Wells (Tor.com Publishing)\n\n, by Martha Wells (Tor.com Publishing) Beneath the Sugar Sky , by Seanan McGuire (Tor.com Publishing)\n\n, by Seanan McGuire (Tor.com Publishing) Binti: The Night Masquerade , by Nnedi Okorafor (Tor.com Publishing)\n\n, by Nnedi Okorafor (Tor.com Publishing) The Black God’s Drums , by P. Djèlí Clark (Tor.com Publishing)\n\n, by P. Djèlí Clark (Tor.com Publishing) Gods, Monsters, and the Lucky Peach , by Kelly Robson (Tor.com Publishing)\n\n, by Kelly Robson (Tor.com Publishing) The Tea Master and the Detective, by Aliette de Bodard (Subterranean Press / JABberwocky Literary Agency)\n\nBest Novelette\n\n“If at First You Don’t Succeed, Try, Try Again,” by Zen Cho (B&N Sci-Fi and Fantasy Blog, 29 November 2018)\n\n“The Last Banquet of Temporal Confections,” by Tina Connolly (Tor.com, 11 July 2018)\n\n“Nine Last Days on Planet Earth,” by Daryl Gregory (Tor.com, 19 September 2018)\n\nThe Only Harmless Great Thing , by Brooke Bolander (Tor.com Publishing)\n\n, by Brooke Bolander (Tor.com Publishing) “The Thing About Ghost Stories,” by Naomi Kritzer ( Uncanny Magazine 25, November- December 2018)\n\n25, November- December 2018) “When We Were Starless,” by Simone Heller (Clarkesworld 145, October 2018)\n\nBest Short Story\n\n“The Court Magician,” by Sarah Pinsker ( Lightspeed , January 2018)\n\n, January 2018) “The Rose MacGregor Drinking and Admiration Society,” by T. Kingfisher ( Uncanny Magazine 25, November-December 2018)\n\n25, November-December 2018) “The Secret Lives of the Nine Negro Teeth of George Washington,” by P. Djèlí Clark ( Fireside Magazine , February 2018)\n\n, February 2018) “STET,” by Sarah Gailey ( Fireside Magazine , October 2018)\n\n, October 2018) “The Tale of the Three Beautiful Raptor Sisters, and the Prince Who Was Made of Meat,” by Brooke Bolander ( Uncanny Magazine 23, July-August 2018)\n\n23, July-August 2018) “A Witch’s Guide to Escape: A Practical Compendium of Portal Fantasies,” by Alix E. Harrow (Apex Magazine, February 2018)\n\nBest Series\n\nThe Centenal Cycle , by Malka Older (Tor.com Publishing)\n\n, by Malka Older (Tor.com Publishing) The Laundry Files , by Charles Stross (most recently Tor.com Publishing/Orbit)\n\n, by Charles Stross (most recently Tor.com Publishing/Orbit) Machineries of Empire , by Yoon Ha Lee (Solaris)\n\n, by Yoon Ha Lee (Solaris) The October Daye Series, by Seanan McGuire (most recently DAW)\n\nSeries, by Seanan McGuire (most recently DAW) The Universe of Xuya , by Aliette de Bodard (most recently Subterranean Press)\n\n, by Aliette de Bodard (most recently Subterranean Press) Wayfarers, by Becky Chambers (Hodder & Stoughton / Harper Voyager)\n\nBest Related Work\n\nArchive of Our Own , a project of the Organization for Transformative Works\n\n, a project of the Organization for Transformative Works Astounding: John W. Campbell, Isaac Asimov, Robert A. Heinlein, L. Ron Hubbard, and the Golden Age of Science Fiction , by Alec Nevala-Lee (Dey Street Books)\n\n, by Alec Nevala-Lee (Dey Street Books) The Hobbit Duology (documentary in three parts), written and edited by Lindsay Ellis and Angelina Meehan (YouTube)\n\n(documentary in three parts), written and edited by Lindsay Ellis and Angelina Meehan (YouTube) An Informal History of the Hugos: A Personal Look Back at the Hugo Awards, 1953- 2000 , by Jo Walton (Tor)\n\n, by Jo Walton (Tor) www.mexicanxinitiative.com: The Mexicanx Initiative Experience at Worldcon 76 (Julia Rios, Libia Brenda, Pablo Defendini, John Picacio)\n\n(Julia Rios, Libia Brenda, Pablo Defendini, John Picacio) Ursula K. Le Guin: Conversations on Writing, by Ursula K. Le Guin with David Naimon (Tin House Books)\n\nBest Graphic Story\n\nAbbott , written by Saladin Ahmed, art by Sami Kivelä, colours by Jason Wordie, letters by Jim Campbell (BOOM! Studios)\n\n, written by Saladin Ahmed, art by Sami Kivelä, colours by Jason Wordie, letters by Jim Campbell (BOOM! Studios) Black Panther: Long Live the King , written by Nnedi Okorafor and Aaron Covington, art by André Lima Araújo, Mario Del Pennino and Tana Ford (Marvel)\n\n, written by Nnedi Okorafor and Aaron Covington, art by André Lima Araújo, Mario Del Pennino and Tana Ford (Marvel) Monstress , Volume 3: Haven, written by Marjorie Liu, art by Sana Takeda (Image Comics)\n\n, Volume 3: Haven, written by Marjorie Liu, art by Sana Takeda (Image Comics) On a Sunbeam , by Tillie Walden (First Second)\n\n, by Tillie Walden (First Second) Paper Girls , Volume 4, written by Brian K. Vaughan, art by Cliff Chiang, colours by Matt Wilson, letters by Jared K. Fletcher (Image Comics)\n\n, Volume 4, written by Brian K. Vaughan, art by Cliff Chiang, colours by Matt Wilson, letters by Jared K. Fletcher (Image Comics) Saga, Volume 9, written by Brian K. Vaughan, art by Fiona Staples (Image Comics)\n\nBest Dramatic Presentation, Long Form\n\nAnnihilation , directed and written for the screen by Alex Garland, based on the novel by Jeff VanderMeer (Paramount Pictures / Skydance)\n\n, directed and written for the screen by Alex Garland, based on the novel by Jeff VanderMeer (Paramount Pictures / Skydance) Avengers: Infinity War , screenplay by Christopher Markus and Stephen McFeely, directed by Anthony Russo and Joe Russo (Marvel Studios)\n\n, screenplay by Christopher Markus and Stephen McFeely, directed by Anthony Russo and Joe Russo (Marvel Studios) Black Panther , written by Ryan Coogler and Joe Robert Cole, directed by Ryan Coogler (Marvel Studios)\n\n, written by Ryan Coogler and Joe Robert Cole, directed by Ryan Coogler (Marvel Studios) A Quiet Place , screenplay by Scott Beck, John Krasinski and Bryan Woods, directed by John Krasinski (Platinum Dunes / Sunday Night)\n\n, screenplay by Scott Beck, John Krasinski and Bryan Woods, directed by John Krasinski (Platinum Dunes / Sunday Night) Sorry to Bother You , written and directed by Boots Riley (Annapurna Pictures)\n\n, written and directed by Boots Riley (Annapurna Pictures) Spider-Man: Into the Spider-Verse, screenplay by Phil Lord and Rodney Rothman, directed by Bob Persichetti, Peter Ramsey and Rodney Rothman (Sony)\n\nBest Dramatic Presentation, Short Form\n\nThe Expanse : “Abaddon’s Gate,” written by Daniel Abraham, Ty Franck and Naren Shankar, directed by Simon Cellan Jones (Penguin in a Parka / Alcon Entertainment)\n\n: “Abaddon’s Gate,” written by Daniel Abraham, Ty Franck and Naren Shankar, directed by Simon Cellan Jones (Penguin in a Parka / Alcon Entertainment) Doctor Who : “Demons of the Punjab,” written by Vinay Patel, directed by Jamie Childs (BBC)\n\n: “Demons of the Punjab,” written by Vinay Patel, directed by Jamie Childs (BBC) Dirty Computer , written by Janelle Monáe, directed by Andrew Donoho and Chuck Lightning (Wondaland Arts Society / Bad Boy Records / Atlantic Records)\n\n, written by Janelle Monáe, directed by Andrew Donoho and Chuck Lightning (Wondaland Arts Society / Bad Boy Records / Atlantic Records) The Good Place : “Janet(s),” written by Josh Siegal & Dylan Morgan, directed by Morgan Sackett (NBC)\n\n: “Janet(s),” written by Josh Siegal & Dylan Morgan, directed by Morgan Sackett (NBC) The Good Place : “Jeremy Bearimy,” written by Megan Amram, directed by Trent O’Donnell (NBC)\n\n: “Jeremy Bearimy,” written by Megan Amram, directed by Trent O’Donnell (NBC) Doctor Who: “Rosa,” written by Malorie Blackman and Chris Chibnall, directed by Mark Tonderai (BBC)\n\nBest Professional Editor, Short Form\n\nNeil Clarke\n\nGardner Dozois\n\nLee Harris\n\nJulia Rios\n\nLynne M. Thomas and Michael Damian Thomas\n\nE. Catherine Tobler\n\nBest Professional Editor, Long Form\n\nSheila E. Gilbert\n\nAnne Lesley Groell\n\nBeth Meacham\n\nDiana Pho\n\nGillian Redfearn\n\nNavah Wolfe\n\nBest Professional Artist\n\nGalen Dara\n\nJaime Jones\n\nVicto Ngai\n\nJohn Picacio\n\nYuko Shimizu\n\nCharles Vess\n\nBest Semiprozine\n\nBeneath Ceaseless Skies , editor-in-chief and publisher Scott H. Andrews\n\n, editor-in-chief and publisher Scott H. Andrews Fireside Magazine , edited by Julia Rios, managing editor Elsa Sjunneson-Henry, copyeditor Chelle Parker; social coordinator Meg Frank, special features editor Tanya DePass, founding editor Brian White, publisher and art director Pablo Defendini\n\n, edited by Julia Rios, managing editor Elsa Sjunneson-Henry, copyeditor Chelle Parker; social coordinator Meg Frank, special features editor Tanya DePass, founding editor Brian White, publisher and art director Pablo Defendini FIYAH Magazine of Black Speculative Fiction, executive editors Troy L. Wiggins and DaVaun Sanders, editors L.D. Lewis, Brandon O’Brien, Kaleb Russell, Danny Lore, and Brent Lambert\n\nMagazine of Black Speculative Fiction, executive editors Troy L. Wiggins and DaVaun Sanders, editors L.D. Lewis, Brandon O’Brien, Kaleb Russell, Danny Lore, and Brent Lambert Shimmer , publisher Beth Wodzinski, senior editor E. Catherine Tobler\n\n, publisher Beth Wodzinski, senior editor E. Catherine Tobler Strange Horizons , edited by Jane Crowley, Kate Dollarhyde, Vanessa Rose Phin, Vajra Chandrasekera, Romie Stott, Maureen Kincaid Speller, and the Strange Horizons Staff\n\n, edited by Jane Crowley, Kate Dollarhyde, Vanessa Rose Phin, Vajra Chandrasekera, Romie Stott, Maureen Kincaid Speller, and the Staff Uncanny Magazine, publishers/editors-in-chief Lynne M. Thomas and Michael Damian Thomas, managing editor Michi Trota, podcast producers Erika Ensign and Steven Schapansky, Disabled People Destroy Science Fiction Special Issue editors-in-chief Elsa Sjunneson-Henry and Dominik Parisien\n\nBest Fanzine\n\nGalactic Journey , founder Gideon Marcus, editor Janice Marcus\n\n, founder Gideon Marcus, editor Janice Marcus Journey Planet , edited by Team Journey Planet\n\n, edited by Team Journey Planet Lady Business , editors Ira, Jodie, KJ, Renay & Susan\n\n, editors Ira, Jodie, KJ, Renay & Susan nerds of a feather, flock together , editors Joe Sherry, Vance Kotrla and The G\n\n, editors Joe Sherry, Vance Kotrla and The G Quick Sip Reviews , editor Charles Payseur\n\n, editor Charles Payseur Rocket Stack Rank, editors Greg Hullender and Eric Wong\n\nBest Fancast\n\nBe the Serpent , presented by Alexandra Rowland, Freya Marske and Jennifer Mace\n\n, presented by Alexandra Rowland, Freya Marske and Jennifer Mace The Coode Street Podcast , presented by Jonathan Strahan and Gary K. Wolfe\n\n, presented by Jonathan Strahan and Gary K. Wolfe Fangirl Happy Hour , hosted by Ana Grilo and Renay Williams\n\n, hosted by Ana Grilo and Renay Williams Galactic Suburbia , hosted by Alisa Krasnostein, Alexandra Pierce, and Tansy Rayner Roberts, produced by Andrew Finch\n\n, hosted by Alisa Krasnostein, Alexandra Pierce, and Tansy Rayner Roberts, produced by Andrew Finch Our Opinions Are Correct , hosted by Annalee Newitz and Charlie Jane Anders\n\n, hosted by Annalee Newitz and Charlie Jane Anders The Skiffy and Fanty Show, produced by Jen Zink and Shaun Duke, hosted by the Skiffy and Fanty Crew\n\nBest Fan Writer\n\nFoz Meadows\n\nJames Davis Nicoll\n\nCharles Payseur\n\nElsa Sjunneson-Henry\n\nAlasdair Stuart\n\nBogi Takács\n\nBest Fan Artist\n\nSara Felix\n\nGrace P. Fong\n\nMeg Frank\n\nAriela Housman\n\nLikhain (Mia Sereno)\n\nSpring Schoenhuth\n\nBest Art Book\n\nThe Books of Earthsea: The Complete Illustrated Edition , illustrated by Charles Vess, written by Ursula K. Le Guin (Saga Press /Gollancz)\n\n, illustrated by Charles Vess, written by Ursula K. Le Guin (Saga Press /Gollancz) Daydreamer’s Journey: The Art of Julie Dillon , by Julie Dillon (self-published)\n\n, by Julie Dillon (self-published) Dungeons & Dragons Art & Arcana: A Visual History , by Michael Witwer, Kyle Newman, Jon Peterson, Sam Witwer (Ten Speed Press)\n\n, by Michael Witwer, Kyle Newman, Jon Peterson, Sam Witwer (Ten Speed Press) Spectrum 25: The Best in Contemporary Fantastic Art , ed. John Fleskes (Flesk Publications)\n\n, ed. John Fleskes (Flesk Publications) Spider-Man: Into the Spider-Verse – The Art of the Movie , by Ramin Zahed (Titan Books)\n\n, by Ramin Zahed (Titan Books) Tolkien: Maker of Middle-earth, ed. Catherine McIlwaine (Bodleian Library)\n\nJohn W. Campbell Award for Best New Writer\n\nKatherine Arden (2nd year of eligibility)\n\nS.A. Chakraborty (2nd year of eligibility)\n\nR.F. Kuang (1st year of eligibility)\n\nJeannette Ng (2nd year of eligibility)\n\nVina Jie-Min Prasad (2nd year of eligibility)\n\nRivers Solomon (2nd year of eligibility)\n\nLodestar Award for Best Young Adult Book\n\nThe Belles , by Dhonielle Clayton (Freeform / Gollancz)\n\n, by Dhonielle Clayton (Freeform / Gollancz) Children of Blood and Bone , by Tomi Adeyemi (Henry Holt / Macmillan Children’s Books)\n\n, by Tomi Adeyemi (Henry Holt / Macmillan Children’s Books) The Cruel Prince , by Holly Black (Little, Brown / Hot Key Books)\n\n, by Holly Black (Little, Brown / Hot Key Books) Dread Nation , by Justina Ireland (Balzer + Bray)\n\n, by Justina Ireland (Balzer + Bray) The Invasion , by Peadar O’Guilin (David Fickling Books / Scholastic)\n\n, by Peadar O’Guilin (David Fickling Books / Scholastic) Tess of the Road, by Rachel Hartman (Random House / Penguin Teen)\n\n1944 RETROSPECTIVE HUGO AWARD FINALISTS\n\nBest Novel\n\nConjure Wife , by Fritz Leiber, Jr. ( Unknown Worlds , April 1943)\n\n, by Fritz Leiber, Jr. ( , April 1943) Earth’s Last Citadel , by C.L. Moore and Henry Kuttner ( Argosy , April 1943)\n\n, by C.L. Moore and Henry Kuttner ( , April 1943) Gather, Darkness! by Fritz Leiber, Jr. ( Astounding Science-Fiction , May-July 1943)\n\nby Fritz Leiber, Jr. ( , May-July 1943) Das Glasperlenspiel [The Glass Bead Game], by Hermann Hesse (Fretz & Wasmuth)\n\n[The Glass Bead Game], by Hermann Hesse (Fretz & Wasmuth) Perelandra , by C.S. Lewis (John Lane, The Bodley Head)\n\n, by C.S. Lewis (John Lane, The Bodley Head) The Weapon Makers, by A.E. van Vogt (Astounding Science-Fiction, February-April 1943)\n\nBest Novella\n\n“Attitude,” by Hal Clement ( Astounding Science-Fiction , September 1943)\n\n, September 1943) “Clash by Night,” by Lawrence O’Donnell (Henry Kuttner & C.L. Moore) ( Astounding Science-Fiction , March 1943)\n\n, March 1943) “The Dream-Quest of Unknown Kadath,” by H.P. Lovecraft, (Beyond the Wall of Sleep, Arkham House)\n\nThe Little Prince , by Antoine de Saint-Exupéry (Reynal & Hitchcock)\n\n, by Antoine de Saint-Exupéry (Reynal & Hitchcock) The Magic Bed-Knob; or, How to Become a Witch in Ten Easy Lessons , by Mary Norton (Hyperion Press)\n\n, by Mary Norton (Hyperion Press) “We Print the Truth,” by Anthony Boucher (Astounding Science-Fiction, December 1943)\n\nBest Novelette\n\n“Citadel of Lost Ships,” by Leigh Brackett ( Planet Stories , March 1943)\n\n, March 1943) “The Halfling,” by Leigh Brackett ( Astonishing Stories , February 1943)\n\n, February 1943) “Mimsy Were the Borogoves,” by Lewis Padgett (C.L. Moore & Henry Kuttner) ( Astounding Science-Fiction , February 1943)\n\n, February 1943) “The Proud Robot,” by Lewis Padgett (Henry Kuttner) ( Astounding Science-Fiction , February 1943)\n\n, February 1943) “Symbiotica,” by Eric Frank Russell ( Astounding Science-Fiction , October 1943)\n\n, October 1943) “Thieves’ House,” by Fritz Leiber, Jr (Unknown Worlds, February 1943)\n\nBest Short Story\n\n“Death Sentence,” by Isaac Asimov ( Astounding Science Fiction , November 1943)\n\n, November 1943) “Doorway into Time,” by C.L. Moore ( Famous Fantastic Mysteries , September 1943)\n\n, September 1943) “Exile,” by Edmond Hamilton ( Super Science Stories , May 1943)\n\n, May 1943) “King of the Gray Spaces” (“R is for Rocket”), by Ray Bradbury ( Famous Fantastic Mysteries , December 1943)\n\n, December 1943) “Q.U.R.,” by H.H. Holmes (Anthony Boucher) ( Astounding Science-Fiction , March 1943)\n\n, March 1943) “Yours Truly – Jack the Ripper,” by Robert Bloch (Weird Tales, July 1943)\n\nBest Graphic Story\n\nBuck Rogers: Martians Invade Jupiter , by Philip Nowlan and Dick Calkins (National Newspaper Service)\n\n, by Philip Nowlan and Dick Calkins (National Newspaper Service) Flash Gordon: Fiery Desert of Mongo , by Alex Raymond (King Features Syndicate)\n\n, by Alex Raymond (King Features Syndicate) Garth , by Steve Dowling (Daily Mirror)\n\n, by Steve Dowling (Daily Mirror) Plastic Man #1: The Game of Death , by Jack Cole (Vital Publications)\n\n, by Jack Cole (Vital Publications) Le Secret de la Licorne [The Secret of the Unicorn], by Hergé ( Le Soir )\n\n[The Secret of the Unicorn], by Hergé ( ) Wonder Woman #5: Battle for Womanhood, written by William Moulton Marsden, art by Harry G. Peter (DC Comics)\n\nBest Dramatic Presentation, Long Form\n\nBatman , written by Victor McLeod, Leslie Swabacker and Harry L. Fraser, directed by Lambert Hillyer (Columbia Pictures)\n\n, written by Victor McLeod, Leslie Swabacker and Harry L. Fraser, directed by Lambert Hillyer (Columbia Pictures) Cabin in the Sky , written by Joseph Schrank, directed by Vincente Minnelli and Busby Berkeley (uncredited) (MGM)\n\n, written by Joseph Schrank, directed by Vincente Minnelli and Busby Berkeley (uncredited) (MGM) A Guy Named Joe , written by Frederick Hazlitt Brennan and Dalton Trumbo, directed by Victor Fleming (MGM)\n\n, written by Frederick Hazlitt Brennan and Dalton Trumbo, directed by Victor Fleming (MGM) Heaven Can Wait , written by Samson Raphaelson, directed by Ernst Lubitsch (20th Century Fox)\n\n, written by Samson Raphaelson, directed by Ernst Lubitsch (20th Century Fox) Münchhausen , written by Erich Kästner and Rudolph Erich Raspe, directed by Josef von Báky (UFA)\n\n, written by Erich Kästner and Rudolph Erich Raspe, directed by Josef von Báky (UFA) Phantom of the Opera, written by Eric Taylor, Samuel Hoffenstein and Hans Jacoby, directed by Arthur Lubin (Universal Pictures)\n\nBest Dramatic Presentation, Short Form\n\nThe Ape Man , written by Barney A. Sarecky, directed by William Beaudine (Banner Productions)\n\n, written by Barney A. Sarecky, directed by William Beaudine (Banner Productions) Frankenstein Meets the Wolfman , written by Curt Siodmak, directed by Roy William Neill (Universal Pictures)\n\n, written by Curt Siodmak, directed by Roy William Neill (Universal Pictures) Der Fuehrer’s Face , story by Joe Grant and Dick Huemer, directed by Jack Kinney (Disney)\n\n, story by Joe Grant and Dick Huemer, directed by Jack Kinney (Disney) I Walked With a Zombie , written by Curt Siodmak and Ardel Wray, directed by Jacques Tourneur (RKO Radio Pictures)\n\n, written by Curt Siodmak and Ardel Wray, directed by Jacques Tourneur (RKO Radio Pictures) The Seventh Victim , written by Charles O’Neal and DeWitt Bodeen, directed by Mark Robson (RKO Radio Pictures)\n\n, written by Charles O’Neal and DeWitt Bodeen, directed by Mark Robson (RKO Radio Pictures) Super-Rabbit, written by Tedd Pierce, directed by Charles M. Jones (Warner Bros)\n\nBest Professional Editor, Short Form\n\nJohn W. Campbell\n\nOscar J. Friend\n\nMary Gnaedinger\n\nDorothy McIlwraith\n\nRaymond A. Palmer\n\nDonald A. Wollheim\n\nBest Professional Artist\n\nHannes Bok\n\nMargaret Brundage\n\nVirgil Finlay\n\nAntoine de Saint-Exupéry\n\nJ. Allen St. John\n\nWilliam Timmins\n\nBest Fanzine\n\nGuteto , edited by Morojo (Myrtle R. Douglas)\n\n, edited by Morojo (Myrtle R. Douglas) Futurian War Digest , editor J. Michael Rosenblum\n\n, editor J. Michael Rosenblum The Phantagraph , editor Donald A. Wollheim\n\n, editor Donald A. Wollheim Voice of the Imagi-Nation , editors Jack Erman (Forrest J Ackerman) & Morojo (Myrtle Douglas)\n\n, editors Jack Erman (Forrest J Ackerman) & Morojo (Myrtle Douglas) YHOS , editor Art Widner\n\n, editor Art Widner Le Zombie, editor Wilson “Bob” Tucker\n\nNote: An error in the original vote tally for the 1944 Retro Hugo Awards placed Fantasy News by editor William S. Sykora on the finalist ballot instead of Guteto, edited by Morojo (Myrtle R. Douglas). Write-in votes for Guteto on previously printed hard copy versions of the ballot will be accepted.\n\nBest Fan Writer\n\nForrest J. Ackerman\n\nMorojo (Myrtle Douglas)\n\nJack Speer\n\nWilson “Bob” Tucker\n\nArt Widner\n\nDonald A. Wollheim\n\nThe Hugo Awards are the premier award in the science fiction genre, honouring science fiction literature and media as well as the genre’s fans. The Awards were first presented at the 1953 World Science Fiction Convention in Philadelphia (Philcon II), and they have continued to honour science fiction and fantasy notables for more than 60 years.\n\n“Dublin 2019 – An Irish Worldcon” will take place in and around the Convention Centre Dublin from 15 to 19 August. More than 5600 people have already signed up as members, including more than 4580 attending members.\n\nOnly Dublin 2019 members will be able to vote on the final ballot and choose the winners. The 1944 Retro Hugo Awards will be presented on Thursday, 15 August, the opening night of Dublin 2019, and the 2019 Hugo Awards, and the Lodestar and Campbell Awards, will be presented on Sunday, 18 August as part of the main Hugo Awards ceremony. The 2019 Hugo base will be designed by Dublin artist Jim Fitzpatrick. The 1944 Retro Hugo base will be designed by Eleanor Wheeler, a ceramicist in County Down. The 2019 Lodestar Award will be designed by Sara Felix, the Austin, Texas-based president of the Association of Science Fiction and Fantasy Artists.\n\nMore information about the Hugo Awards, including details about how to submit a nominating ballot. More information and membership registration for Dublin 2019 are available here. Follow Dublin 2019 on Twitter."}, {"url": "https://www.thehugoawards.org/hugo-history/2019-hugo-awards/", "page_content": "Presented at: Dublin 2019: An Irish Worldcon, Dublin, Ireland, August 18, 2019\n\nHosts: Afua Richardson and Michael Scott\n\nBase design: Jim Fitzpatrick\n\nAwards Administration: Nicholas Whyte, Sanna Lopperi-Vihinen\n\n\n\n\n\nThe 2019 Hugo Awards were presented on the evening of Sunday, August 18, 2019 at a ceremony at Dublin 2019, An Irish Worldcon, the 77th World Science Fiction Convention in Dublin, Ireland.\n\nDublin 2019 received 3,097 votes on the final ballot (3,089 online and 8 paper) from the members of Dublin 2019.\n\nThe finalists for the 2019 Hugo Awards, the Lodestar Award for Best Young Adult Book, and the John W. Campbell Award for Best New Writer were announced at Dublin 2019: An Irish Worldcon on April 2, 2019.\n\nDublin 2019 received and counted 1,800 valid nominating ballots (1,797 electronic and 3 paper) from the members of Worldcon 76 and Dublin 2019. Because of a change to WSFS rules ratified in 2018 that took effect in 2019, only members of the current and previous Worldcons (not including members of the following year’s Worldcon) were eligible to nominate for the 2019 Hugo Awards. Members nominated up to five works/people in each category, and the top six works/people in each category were shortlisted as finalists.\n\nFull Nominating and Final Ballot Voting Details (PDF)\n\nVideo of the 2019 Hugo Awards Ceremony\n\nVideo of the announcement of the 2019 Hugo Award and 1944 Retrospective Hugo Award Finalists\n\nBest Novel\n\nThe Calculating Stars, by Mary Robinette Kowal (Tor)\n\nSpinning Silver, by Naomi Novik (Del Rey / Macmillan)\n\nRecord of a Spaceborn Few, by Becky Chambers (Hodder & Stoughton / Harper Voyager)\n\nTrail of Lightning, by Rebecca Roanhorse (Saga)\n\nRevenant Gun, by Yoon Ha Lee (Solaris)\n\nSpace Opera, by Catherynne M. Valente (Saga/Corsair)\n\nBest Novella\n\nArtificial Condition, by Martha Wells (Tor.com publishing)\n\nThe Tea Master and the Detective, by Aliette de Bodard (Subterranean Press / JABberwocky Literary Agency)\n\nBeneath the Sugar Sky, by Seanan McGuire (Tor.com publishing)\n\nThe Black God’s Drums, by P. Djèlí Clark (Tor.com publishing)\n\nBinti: The Night Masquerade, by Nnedi Okorafor (Tor.com publishing)\n\nGods, Monsters, and the Lucky Peach, by Kelly Robson (Tor.com publishing)\n\nBest Novelette\n\n“If at First You Don’t Succeed, Try, Try Again,” by Zen Cho (B&N Sci-Fi and Fantasy Blog, 29 November 2018)\n\n“The Last Banquet of Temporal Confections,” by Tina Connolly (Tor.com, 11 July 2018)\n\n“The Thing About Ghost Stories,” by Naomi Kritzer (Uncanny Magazine 25, November-December 2018)\n\n“Nine Last Days on Planet Earth,” by Daryl Gregory (Tor.com, 19 September 2018)\n\nThe Only Harmless Great Thing, by Brooke Bolander (Tor.com publishing)\n\n“When We Were Starless,” by Simone Heller (Clarkesworld 145, October 2018)\n\nBest Short Story\n\n“A Witch’s Guide to Escape: A Practical Compendium of Portal Fantasies,” by Alix E. Harrow (Apex Magazine, February 2018)\n\n“The Secret Lives of the Nine Negro Teeth of George Washington,” by P. Djèlí Clark (Fireside Magazine, February 2018)\n\n“The Rose MacGregor Drinking and Admiration Society,” by T. Kingfisher (Uncanny Magazine 25, November-December 2018)\n\n“STET,” by Sarah Gailey (Fireside Magazine, October 2018)\n\n“The Court Magician,” by Sarah Pinsker (Lightspeed, January 2018)\n\n“The Tale of the Three Beautiful Raptor Sisters, and the Prince Who Was Made of Meat,” by Brooke Bolander (Uncanny Magazine 23, July-August 2018)\n\nBest Series\n\nWayfarers, by Becky Chambers (Hodder & Stoughton / Harper Voyager)\n\nThe Laundry Files, by Charles Stross (most recently Orbit/Tor and Tor.com publishing)\n\nMachineries of Empire, by Yoon Ha Lee (Solaris)\n\nThe October Daye Series, by Seanan McGuire (most recently DAW)\n\nThe Universe of Xuya, by Aliette de Bodard (most recently Subterranean Press)\n\nThe Centenal Cycle, by Malka Older (Tor.com publishing)\n\nBest Related Work\n\nArchive of Our Own, a project of the Organization for Transformative Works [see clarification]\n\nUrsula K. Le Guin: Conversations on Writing, by Ursula K. Le Guin with David Naimon (Tin House Books)\n\nAn Informal History of the Hugos: A Personal Look Back at the Hugo Awards, 1953-2000, by Jo Walton (Tor)\n\nwww.mexicanxinitiative.com: The Mexicanx Initiative Experience at Worldcon 76 (Julia Rios, Libia Brenda, Pablo Defendini, John Picacio)\n\nThe Hobbit Duology (documentary in three parts), written and edited by Lindsay Ellis and Angelina Meehan (YouTube)\n\nAstounding: John W. Campbell, Isaac Asimov, Robert A. Heinlein, L. Ron Hubbard, and the Golden Age of Science Fiction, by Alec Nevala-Lee (Dey Street Books)\n\nBest Graphic Story\n\nMonstress, Volume 3: Haven, written by Marjorie Liu, art by Sana Takeda (Image Comics)\n\nBlack Panther: Long Live the King, written by Nnedi Okorafor and Aaron Covington, art by André Lima Araújo, Mario Del Pennino and Tana Ford (Marvel)\n\nAbbott, written by Saladin Ahmed, art by Sami Kivelä, colours by Jason Wordie, letters by Jim Campbell (BOOM! Studios)\n\nSaga, Volume 9, written by Brian K. Vaughan, art by Fiona Staples (Image Comics)\n\nPaper Girls, Volume 4, written by Brian K. Vaughan, art by Cliff Chiang, colours by Matt Wilson, letters by Jared K. Fletcher (Image Comics)\n\nOn a Sunbeam, by Tillie Walden (First Second)\n\nBest Dramatic Presentation, Long Form\n\nSpider-Man: Into the Spider-Verse, screenplay by Phil Lord and Rodney Rothman, directed by Bob Persichetti, Peter Ramsey and Rodney Rothman (Sony)\n\nBlack Panther, written by Ryan Coogler and Joe Robert Cole, directed by Ryan Coogler (Marvel Studios)\n\nAvengers: Infinity War, screenplay by Christopher Markus and Stephen McFeely, directed by Anthony Russo and Joe Russo (Marvel Studios)\n\nAnnihilation, directed and written for the screen by Alex Garland, based on the novel by Jeff VanderMeer (Paramount Pictures / Skydance)\n\nA Quiet Place, screenplay by Scott Beck, John Krasinski and Bryan Woods, directed by John Krasinski (Platinum Dunes / Sunday Night)\n\nSorry to Bother You, written and directed by Boots Riley (Annapurna Pictures)\n\nBest Dramatic Presentation, Short Form\n\nThe Good Place: “Janet(s),” written by Josh Siegal & Dylan Morgan, directed by Morgan Sackett (NBC)\n\nThe Expanse: “Abaddon’s Gate,” written by Daniel Abraham, Ty Franck and Naren Shankar, directed by Simon Cellan Jones (Penguin in a Parka / Alcon Entertainment)\n\nDoctor Who: “Demons of the Punjab,” written by Vinay Patel, directed by Jamie Childs (BBC)\n\nDoctor Who: “Rosa,” written by Malorie Blackman and Chris Chibnall, directed by Mark Tonderai (BBC)\n\nThe Good Place: “Jeremy Bearimy,” written by Megan Amram, directed by Trent O’Donnell (NBC)\n\nDirty Computer, written by Janelle Monáe and Chuck Lightning, directed by Andrew Donoho and Chuck Lightning (Wondaland Arts Society / Bad Boy Records / Atlantic Records)\n\nBest Editor, Short Form\n\nGardner Dozois\n\nNeil Clarke\n\nLynne M. Thomas and Michael Damian Thomas\n\nJulia Rios\n\nLee Harris\n\nE. Catherine Tobler\n\nBest Editor, Long Form\n\nNavah Wolfe\n\nSheila E. Gilbert\n\nBeth Meacham\n\nDiana Pho\n\nGillian Redfearn\n\nAnne Lesley Groell\n\nBest Professional Artist\n\nCharles Vess\n\nGalen Dara\n\nYuko Shimizu\n\nVicto Ngai\n\nJohn Picacio\n\nJaime Jones\n\nBest Semiprozine\n\nUncanny Magazine, publishers/editors-in-chief Lynne M. Thomas and Michael Damian Thomas, managing editor Michi Trota, podcast producers Erika Ensign and Steven Schapansky, Disabled People Destroy Science Fiction Special Issue editors-in-chief Elsa Sjunneson-Henry and Dominik Parisien\n\nStrange Horizons, edited by Jane Crowley, Kate Dollarhyde, Vanessa Rose Phin, Vajra Chandrasekera, Romie Stott, Maureen Kincaid Speller, and the Strange Horizons Staff\n\nFireside Magazine, edited by Julia Rios, managing editor Elsa Sjunneson-Henry, copyeditor Chelle Parker, social coordinator Meg Frank, special features editor Tanya DePass, founding editor Brian White, publisher and art director Pablo Defendini\n\nBeneath Ceaseless Skies, editor-in-chief and publisher Scott H. Andrews\n\nFIYAH Magazine of Black Speculative Fiction, executive editors Troy L. Wiggins and DaVaun Sanders, editors L.D. Lewis, Brandon O’Brien, Kaleb Russell, Danny Lore, and Brent Lambert\n\nShimmer, publisher Beth Wodzinski, senior editor E. Catherine Tobler\n\nBest Fanzine\n\nLady Business, editors Ira, Jodie, KJ, Renay & Susan\n\nnerds of a feather, flock together, editors Joe Sherry, Vance Kotrla and The G\n\nJourney Planet, edited by Team Journey Planet\n\nGalactic Journey, founder Gideon Marcus, editor Janice Marcus\n\nQuick Sip Reviews, editor Charles Payseur\n\nRocket Stack Rank, editors Greg Hullender and Eric Wong\n\nBest Fancast\n\nOur Opinions Are Correct, hosted by Annalee Newitz and Charlie Jane Anders\n\nFangirl Happy Hour, hosted by Ana Grilo and Renay Williams\n\nBe the Serpent, presented by Alexandra Rowland, Freya Marske and Jennifer Mace\n\nGalactic Suburbia, hosted by Alisa Krasnostein, Alexandra Pierce, and Tansy Rayner Roberts, produced by Andrew Finch\n\nThe Skiffy and Fanty Show, produced by Jen Zink and Shaun Duke, hosted by Jen Zink, Shaun Duke, Paul Weimer, Alex Acks, Elizabeth Fitzgerald, Trish Matson, and team\n\nThe Coode Street Podcast, presented by Jonathan Strahan and Gary K. Wolfe\n\nBest Fan Writer\n\nFoz Meadows\n\nBogi Takács\n\nElsa Sjunneson-Henry\n\nJames Davis Nicoll\n\nAlasdair Stuart\n\nCharles Payseur\n\nBest Fan Artist\n\nLikhain (Mia Sereno)\n\nGrace P. Fong\n\nSara Felix\n\nMeg Frank\n\nSpring Schoenhuth\n\nAriela Housman\n\nBest Art Book\n\nUnder the WSFS Constitution every Worldcon has the right to add one category to the Hugo Awards for that year only. Dublin 2019 has chosen to use this right to create an award for an art book.\n\nThe Books of Earthsea: The Complete Illustrated Edition, illustrated by Charles Vess, written by Ursula K. Le Guin (Saga Press /Gollancz)\n\nSpider-Man: Into the Spider-Verse – The Art of the Movie, by Ramin Zahed (Titan Books)\n\nDungeons & Dragons Art & Arcana: A Visual History, by Michael Witwer, Kyle Newman, Jon Peterson, Sam Witwer (Ten Speed Press)\n\nTolkien: Maker of Middle-earth, ed. Catherine McIlwaine (Bodleian Library)\n\nDaydreamer’s Journey: The Art of Julie Dillon, by Julie Dillon (self-published)\n\nSpectrum 25: The Best in Contemporary Fantastic Art, ed. John Fleskes (Flesk Publications)\n\nThere are two other Awards administered by Worldcon 76 that are not Hugo Awards:\n\nLodestar Award for Best Young Adult Book\n\nTrophy Design: Sara Felix\n\nChildren of Blood and Bone, by Tomi Adeyemi (Henry Holt / Macmillan Children’s Books)\n\nDread Nation, by Justina Ireland (Balzer + Bray)\n\nTess of the Road, by Rachel Hartman (Random House / Penguin Teen)\n\nThe Cruel Prince, by Holly Black (Little, Brown / Hot Key Books)\n\nThe Invasion, by Peadar O’Guilin (David Fickling Books / Scholastic)\n\nThe Belles, by Dhonielle Clayton (Freeform / Gollancz)\n\nJohn W. Campbell Award for Best New Writer\n\nJeannette Ng*\n\nRivers Solomon*\n\nS.A. Chakraborty*\n\nKatherine Arden*\n\nR.F. Kuang\n\nVina Jie-Min Prasad*\n\n*Finalist in their 2nd year of eligibility\n\nThe 2019 Hugo Awards are generally for work first published or appearing in 2018, or first published in the USA in 2018 (if previously published elsewhere), or first published in English in 2018 (if previously published in another language). The detailed rules are in Article 3 of the WSFS Constitution."}, {"url": "https://www.thehugoawards.org/", "page_content": "The nominating period for the 2023 Hugo Awards, Lodestar Award for Best Young Adult Book, and Astounding Award for Best New Writer opened on March 1 and will remain open until 11:59 p.m. Hawaii Standard Time (HST; UTC – 10) on April 30, 2023.\n\nThe 2023 Hugo Awards are administered by the 2023 Chengdu Worldcon. Submit nominations through the convention’s website at https://hugo.chengduworldcon.com/hugo-awards/.\n\nThe 2023 Chengdu Worldcon Hugo Awards web page has instructions for accessing the online nominating ballot for the 2023 Hugo Awards. The 2023 Chengdu Worldcon must receive your ballot by 11:59 p.m. Hawaii Standard Time (HST; UTC – 10) on April 30, 2023.\n\n2023 Chengdu, the 2023 World Science Fiction Convention, will present the 2023 Hugo Awards, which are generally for works first published or appearing in 2022. Any person who was a WSFS member of at least one of the 2022 or 2023 World Science Fiction Conventions before February 1, 2023 may cast a nominating ballot for the 2023 Awards.\n\nThe ballot will also include voting on two other awards administered by the Worldcon. These are the Lodestar Award for Best Young Adult Book, presented by the World Science Fiction Society, and the Astounding Award for Best New Writer, presented by Dell Magazines.\n\nEligible members of the 2022 and 2023 Worldcons can make up to five nominations in each category. You are not required to nominate in all categories or to fill every nomination blank on the ballot. We recommend that you nominate whatever works and creators you have personally read or seen that were your favorites from 2022.\n\nBecause the Hugo Awards rules measure prose fiction based on word count in English and other languages written in the Latin alphabet, the 2023 Hugo Administrators have ruled that they will use a factor of 1.6 when converting from English words to Chinese characters. See their announcement on their website to see how this affects the categories in question.\n\nThose people/works with sufficient nominations will move on the the final ballot for the 2023 Hugo Awards, which will be announced later this year after the close of nominations. While members of both the 2022 and 2023 Worldcons can nominate for the 2023 Awards, only members of the 2023 Worldcon are eligible to vote on the final ballot. If you are not yet a member of the 2023 Worldcon, see the 2023 Chengdu Website, then select “Login or Purchase Membership” for information about joining the convention.\n\nThere are no Retrospective Hugo Awards being presented this year. 2023 Chengdu has also elected to not present a special Hugo Award category in 2023.\n\nPlease direct any questions about the administration of the 2023 Hugo Awards to the 2023 Chengdu Hugo Award Administrators, not to the Hugo Awards web site. The Hugo Awards web site team does not administer the elections for the Hugo Awards, nor do we make eligibility rulings. The Hugo Awards web site is the “journal of record” for the Hugo Awards and acts as a central source of information about the Awards, but we do not actually administer or present the Awards. The 2023 Hugo Awards are administered by the Hugo Awards Administration Subcommittee of 2023 Chengdu, the 2023 Worldcon, and all decisions regarding the eligibility of works and the administration of nominations are exclusively the committee’s responsibility, per the provisions of Section 3.13 of the World Science Fiction Society constitution."}, {"url": "https://business.missouri.edu/departments-faculty/people-directory/john-s-howe", "page_content": "John Howe is a Professor of Finance and Missouri Bankers Chair in the Finance Department at the Robert J. Trulaske, Sr. College of Business, University of Missouri. He has been at MU more than 25 years, serving as and Chair of the Finance Department until 2019, and with prior appointments at Louisiana State University and the University of Kansas.\n\nHe earned his undergraduate degree (B.A.) from Colorado College and his graduate degrees (M.S., Ph.D.) from Purdue University. He is a Chartered Financial Analyst (CFA), and has served on the boards of directors of several for-profit companies along with having extensive non-profit board experience.\n\nHowe's research interests including banking, corporate governance, household finance, and behavioral economics. He has published extensively in the major journals in finance and accounting, and has more than 70 publications in peer-reviewed journals. He has been a visiting scholar at the University of Cambridge (U.K.) and Queensland University of Technology (Australia), and has taught courses for the banking group UBS (Switzerland).\n\nHowe has won numerous teaching awards, including the William T. Kemper Fellow for Excellence in Teaching. He has taught at all levels including the executive MBA."}, {"url": "https://www.thehugoawards.org/hugo-history/2021-hugo-awards/", "page_content": "Presented at: DisCon III, Washington, DC, USA\n\nHosts: Andrea Hairston, Sheree Renée Thomas\n\nBase design: Sebastian Martorana\n\nAwards Administration: Linda Deneroff, Fred Bauer, Kevin Standlee, Sharon Sbarsky, Kathy Bond, Kat Jones, Cassidy Riddlebarger, Marguerite Smith, Nicholas Whyte\n\n\n\n\n\nThe 2021 Hugo Awards were presented on the evening of Saturday, December 18, 2021 at a ceremony at DisCon III, the 79th World Science Fiction Convention in Washington, DC, USA.\n\nDisCon III received 2,362 final award ballots from the members of DisCon III.\n\nFinal Ballot Voting Details (PDF)\n\nNominations Voting Details (PDF)\n\nVideo of the 2021 Hugo Awards Ceremony\n\nThe finalists for the 2021 Hugo Awards/Lodestar Award/Astounding Award were announced by DisCon III on April 13, 2021 in a YouTube video. (Link is to a corrected version posted April 27.)\n\nNominations for the 2021 Awards opened on January 25, 2021 and closed on March 19. Anyone who was a member of the 2020 or 2021 Worldcons as of the end of 2020 was eligible to nominate up to five people/works in each category. There were 1249 valid nominating ballots (1246 electronic and 3 paper) received and counted from the members of the 2020 and 2021 World Science Fiction Conventions for the 2021 Hugo Awards. Those nominees that received sufficient nominations and met the eligibility requirements went on to a final ballot, where members of DisCon III, the 2021 Worldcon, will vote among them.\n\nPlease direct all questions about the administration of the 2021 Hugo Awards/Lodestar Award/Astounding Award to the 2021 Hugo Award Administrators, not to the Hugo Awards web site. The Hugo Awards web site does not administer the Hugo Awards. All questions about the administration of the current Awards should go to the administrators.\n\nBest Novel\n\n2040 final ballots cast (86.4%)\n\n1093 nominating ballots for 441 nominees, finalist range 309-132\n\nNetwork Effect, Martha Wells (Tor.com)\n\nThe City We Became, N.K. Jemisin (Orbit)\n\nPiranesi, Susanna Clarke (Bloomsbury)\n\nBlack Sun, Rebecca Roanhorse (Gallery / Saga Press / Solaris)\n\nThe Relentless Moon, Mary Robinette Kowal (Tor Books / Solaris)\n\nHarrow The Ninth, Tamsyn Muir (Tor.com)\n\nBest Novella\n\n1691 final ballots cast (71.6%)\n\n778 nominating ballots for 157 nominees, finalist range 219-124\n\nThe Empress of Salt and Fortune, Nghi Vo (Tor.com)\n\nRing Shout, P. Djèlí Clark (Tor.com)\n\nCome Tumbling Down, Seanan McGuire (Tor.com)\n\nUpright Women Wanted, Sarah Gailey (Tor.com)\n\nFinna, Nino Cipri (Tor.com)\n\nRiot Baby, Tochi Onyebuchi (Tor.com)\n\nBest Novelette\n\n1499 final ballots cast (63.5%)\n\n465 nominating ballots for 197 nominees, finalist range 108-33\n\nTwo Truths and a Lie, Sarah Pinsker (Tor.com)\n\n“The Inaccessibility of Heaven”, Aliette de Bodard (Uncanny Magazine, July/August 2020)\n\n“Monster”, Naomi Kritzer (Clarkesworld, January 2020)\n\n“The Pill”, Meg Elison (from Big Girl, (PM Press))\n\n“Helicopter Story”, Isabel Fall (Clarkesworld, January 2020)\n\n“Burn, or the Episodic Life of Sam Wells as a Super”, A.T. Greenblatt (Uncanny Magazine, May/June 2020)\n\nBest Short Story\n\n1574 final ballots cast (66.6%)\n\n586 nominating ballots for 634 nominees, finalist range 65-35\n\n“Metal Like Blood in the Dark”, T. Kingfisher (Uncanny Magazine, September/October 2020)\n\nLittle Free Library, Naomi Kritzer (Tor.com)\n\n“A Guide for Working Breeds”, Vina Jie-Min Prasad (Made to Order: Robots and Revolution, ed. Jonathan Strahan (Solaris))\n\n“Open House on Haunted Hill”, John Wiswell (Diabolical Plots – 2020, ed. David Steffen)\n\n“The Mermaid Astronaut”, Yoon Ha Lee (Beneath Ceaseless Skies, February 2020)\n\n“Badass Moms in the Zombie Apocalypse”, Rae Carson (Uncanny Magazine, January/February 2020)\n\nBest Series\n\n1872 final ballots cast (79.3%)\n\n727 nominating ballots for 180 nominees, finalist range 300-87\n\nThe Murderbot Diaries, Martha Wells (Tor.com)\n\nThe Lady Astronaut Universe, Mary Robinette Kowal (Tor Books/Audible/Magazine of Fantasy and Science Fiction/Solaris)\n\nOctober Daye, Seanan McGuire (DAW)\n\nThe Interdependency, John Scalzi (Tor Books)\n\nThe Poppy War, R.F. Kuang (Harper Voyager)\n\nThe Daevabad Trilogy, S.A. Chakraborty (Harper Voyager)\n\nBest Related Work\n\n1423 final ballots cast (60.2%)\n\n456 nominating ballots for 277 nominees, finalist range 74-31\n\nBeowulf: A New Translation, Maria Dahvana Headley (FSG)\n\nA Handful of Earth, A Handful of Sky: The World of Octavia E. Butler, Lynell George (Angel City Press)\n\nFIYAHCON, L.D. Lewis–Director, Brent Lambert–Senior Programming Coordinator, Iori Kusano–FIYAHCON Fringe Co-Director, Vida Cruz–FIYAHCON Fringe Co-Director, and the Incredible FIYAHCON team\n\n“George R.R. Martin Can Fuck Off Into the Sun, Or: The 2020 Hugo Awards Ceremony (Rageblog Edition)”, Natalie Luhrs (Pretty Terrible, August 2020)\n\nThe Last Bronycon: a fandom autopsy, Jenny Nicholson (YouTube)\n\nCoNZealand Fringe, Claire Rousseau, C, Cassie Hart, Adri Joy, Marguerite Kenner, Cheryl Morgan, Alasdair Stuart.\n\nBest Graphic Story or Comic\n\n1048 final ballots cast (44.4%)\n\n303 nominating ballots for 254 nominees, finalist range 43-24\n\nParable of the Sower: A Graphic Novel Adaptation, written by Octavia Butler, adapted by Damian Duffy, illustrated by John Jennings (Harry N. Abrams)\n\nGhost-Spider vol. 1: Dog Days Are Over, Author: Seanan McGuire, Artist: Takeshi Miyazawa and Rosi Kämpe (Marvel)\n\nMonstress, vol. 5: Warchild, Author: Marjorie Liu, Artist: Sana Takeda (Image Comics)\n\nOnce & Future vol. 1: The King Is Undead, written by Kieron Gillen, iIllustrated by Dan Mora, colored by Tamra Bonvillain, lettered by Ed Dukeshire (BOOM! Studios)\n\nInvisible Kingdom, vol 2: Edge of Everything, Author: G. Willow Wilson, Artist: Christian Ward (Dark Horse Comics)\n\nDIE, Volume 2: Split the Party, written by Kieron Gillen and Stephanie Hans, letters by Clayton Cowles (Image Comics)\n\nBest Dramatic Presentation, Long Form\n\n1551 final ballots cast (64.7%)\n\n574 nominating ballot for 192 nominees, finalist range 164-56\n\nThe Old Guard, written by Greg Rucka, directed by Gina Prince-Bythewood (Netflix / Skydance Media)\n\nBirds of Prey (and the Fantabulous Emancipation of One Harley Quinn), written by Christina Hodson, directed by Cathy Yan (Warner Bros.)\n\nSoul, screenplay by Pete Docter, Mike Jones and Kemp Powers, directed by Pete Docter, co-directed by Kemp Powers, produced by Dana Murray (Pixar Animation Studios/ Walt Disney Pictures)\n\nPalm Springs, written by Andy Siara, directed by Max Barbakow (Limelight / Sun Entertainment Culture / The Lonely Island / Culmination Productions / Neon / Hulu / Amazon Prime)\n\nEurovision Song Contest: The Story of Fire Saga, written by Will Ferrell, Andrew Steele, directed by David Dobkin (European Broadcasting Union/Netflix)\n\nTenet, written and directed by Christopher Nolan (Warner Bros./Syncopy)\n\nBest Dramatic Presentation, Short Form\n\n1667 final ballots cast (70.6%)\n\n454 nominating ballot for 321 nominees, finalist range 130-30\n\nThe Good Place: Whenever You’re Ready, written and directed by Michael Schur (Fremulon / 3 Arts Entertainment / Universal Television, a division of Universal Studio Group)\n\nThe Expanse: Gaugamela, written by Dan Nowak, directed by Nick Gomez (Alcon Entertainment / Alcon Television Group / Amazon Studios / Hivemind / Just So)\n\nThe Mandalorian: Chapter 16: The Rescue, written by Jon Favreau, directed by Peyton Reed (Golem Creations / Lucasfilm / Disney+)\n\nThe Mandalorian: Chapter 13: The Jedi, written and directed by Dave Filoni (Golem Creations / Lucasfilm / Disney+)\n\nShe-Ra and the Princesses of Power: Heart (parts 1 and 2), written by Josie Campbell and ND Stevenson, directed by Jen Bennett and Kiki Manrique (DreamWorks Animation Television / Netflix)\n\nDoctor Who: Fugitive of the Judoon, written by Vinay Patel and Chris Chibnall, directed by Nida Manzoor (BBC)\n\nBest Editor, Short Form\n\n951 final ballots cast (40.3%)\n\n370 nominating ballot for 162 nominees, finalist range 79-38\n\nEllen Datlow\n\nMur Lafferty and S.B. Divya\n\nNeil Clarke\n\nSheila Williams\n\nJonathan Strahan\n\nC.C. Finlay\n\nBest Editor, Long Form\n\n667 final ballots cast (28.2%)\n\n310 nominating ballots for 82 nominees, finalist range 83-52\n\nDiana M. Pho\n\nNavah Wolfe\n\nSheila E. Gilbert\n\nSarah Guan\n\nBrit Hvide\n\nNivia Evans\n\nBest Professional Artist\n\n924 final ballots cast (39.1%)\n\n331 nominating ballots for 179 nominees, finalist range 91-37\n\nRovina Cai\n\nJohn Picacio\n\nGalen Dara\n\nTommy Arnold\n\nMaurizio Manzieri\n\nAlyssa Winans\n\nBest Semiprozine\n\n1063 final ballots cast (45.0%)\n\n331 nominating ballots for 77 nominees, finalist range 174-39\n\nFIYAH Magazine of Black Speculative Fiction, publisher Troy L. Wiggins, executive editor DaVaun Sanders, managing editor Eboni Dunbar, poetry editor Brandon O’Brien, reviews and social media Brent Lambert, art director L. D. Lewis, and the FIYAH Team.\n\nUncanny Magazine, editors in chief: Lynne M. Thomas and Michael Damian Thomas, managing editor: Chimedum Ohaegbu, non-fiction editor: Elsa Sjunneson, podcast producers: Erika Ensign and Steven Schapansky\n\nStrange Horizons, Vanessa Aguirre, Joseph Aitken, Rachel Ayers, M H Ayinde, Tierney Bailey, Scott Beggs, Drew Matthew Beyer, Gautam Bhatia, S. K. Campbell, Zhui Ning Chang, Rita Chen, Tania Chen, Joyce Chng, Liz Christman, Linda H. Codega, Kristian Wilson Colyard, Yelena Crane, Bruhad Dave, Sarah Davidson, Tahlia Day, Arinn Dembo, Nathaniel Eakman, Belen Edwards, George Tom Elavathingal, Rebecca Evans, Ciro Faienza, Courtney Floyd, Lila Garrott, Colette Grecco, Guananí Gómez-Van Cortright, Julia Gunnison, Dan Hartland, Sydney Hilton, Angela Hinck, Stephen Ira, Amanda Jean, Ai Jiang, Sean Joyce-Farley, Erika Kanda, Anna Krepinsky, Kat Kourbeti, Clayton Kroh, Maureen Kincaid Speller, Catherine Krahe, Natasha Leullier, A.Z. Louise, Dante Luiz, Gui Machiavelli, Cameron Mack, Samantha Manaktola, Marisa Manuel, Jean McConnell, Heather McDougal, Maria Morabe, Amelia Moriarty, Emory Noakes, Sara Noakes, Aidan Oatway, AJ Odasso, Joel Oliver-Cormier, Kristina Palmer, Karintha Parker, Anjali Patel, Vanessa Rose Phin, Nicasio Reed, Belicia Rhea, Endria Richardson, Natalie Ritter, Abbey Schlanz, Clark Seanor, Elijah Rain Smith, Hebe Stanton, Melody Steiner, Romie Stott, Yejin Suh, Kwan-Ann Tan, Luke Tolvaj, Ben Tyrrell, Renee Van Siclen, Kathryn Weaver, Liza Wemakor, Aigner Loren Wilson, E.M. Wright, Vicki Xu, Fred G. Yost, staff members who prefer not to be named, and guest editor Libia Brenda with guest first reader Raquel González-Franco Alva for the Mexicanx special issue\n\nEscape Pod, editors Mur Lafferty and S.B. Divya, assistant editor Benjamin C. Kinney, hosts Tina Connolly and Alasdair Stuart, audio producers Summer Brooks and Adam Pracht and the entire Escape Pod team.\n\nBeneath Ceaseless Skies, ed. Scott H. Andrews\n\nPodCastle, editors, C.L. Clark and Jen R. Albert, assistant editor and host, Setsu Uzumé, producer Peter Adrian Behravesh, and the entire PodCastle team.\n\nBest Fanzine\n\n643 final ballots cast (27.2%)\n\n271 nominating ballots for 94 nominees, finalist range 79-38\n\nnerds of a feather, flock together, ed. Adri Joy, Joe Sherry, The G, and Vance Kotrla\n\nLady Business, editors. Ira, Jodie, KJ, Renay, and Susan.\n\nJourney Planet, edited by Michael Carroll, John Coxon, Sara Felix, Ann Gry, Sarah Gulde, Alissa McKersie, Errick Nunnally, Pádraig Ó Méalóid, Chuck Serface, Steven H Silver, Paul Trimble, Erin Underwood, James Bacon, and Chris Garcia.\n\nUnofficial Hugo Book Club Blog, ed. Amanda Wakaruk and Olav Rokne\n\nThe Full Lid, written by Alasdair Stuart, edited by Marguerite Kenner\n\nQuick Sip Reviews, editor, Charles Payseur\n\nBest Fancast\n\n632 final ballots cast (26.8%)\n\n376 nominating ballots for 230 nominees, finalist range 72-28\n\nThe Coode Street Podcast, presented by Jonathan Strahan and Gary K. Wolfe, Jonathan Strahan, producer\n\nWorldbuilding for Masochists, presented by Rowenna Miller, Marshall Ryan Maresca and Cass Morris\n\nThe Skiffy and Fanty show, produced by Shaun Duke and Jen Zink, presented by Shaun Duke, Jen Zink, Alex Acks, Paul Weimer, and David Annandale.\n\nBe The Serpent, presented by Alexandra Rowland, Freya Marske and Jennifer Mace\n\nClaire Rousseau’s YouTube channel, produced by Claire Rousseau\n\nKalanadi, produced and presented by Rachel\n\nBest Fan Writer\n\n680 final ballots cast (28.8%)\n\n365 nominating ballots for 185 nominees, finalist range 89-42\n\nElsa Sjunneson\n\nCora Buhlert\n\nJason Sanford\n\nAlasdair Stuart\n\nPaul Weimer\n\nCharles Payseur\n\nBest Fan Artist\n\n732 final ballots cast (31.0%)\n\n221 nominating ballots for 158 nominees, finalist range 54-10\n\nSara Felix\n\nLaya Rose\n\nGrace P. Fong\n\nIain J. Clark\n\nMaya Hahto\n\nCyan Daly\n\nBest Video Game\n\nDisCon III used their authority under the WSFS constitution to create a one-time Special Hugo Award Category for Best Video Game. See this announcement for further details.\n\n956 final ballots cast (40.5%)\n\n341 nominating ballots for 145 nominees, finalist range 183-30\n\nHades (Publisher and Developer: Supergiant Games)\n\nAnimal Crossing: New Horizons (Publisher and Developer: Nintendo)\n\nSpiritfarer (Publisher and Developer: Thunder Lotus)\n\nFinal Fantasy VII Remake (Publisher Square Enix)\n\nThe Last of Us: Part II (Publisher: Sony Interactive Entertainment / Developer: Naughty Dog)\n\nBlaseball (Publisher and Developer: The Game Band)\n\nLodestar Award for Best Young Adult Book (presented by the World Science Fiction Society)\n\nThe Lodestar Award is not a Hugo Award, but is an Award established by the World Science Fiction Society and administered in the same manner and in parallel with the Hugo Awards. This means that works that are finalists for the Lodestar Award are also eligible for a Hugo Award in the appropriate category based on the length of the work.\n\n1330 final ballots cast (56.3%)\n\n507 nominating ballots for 172 nominees, finalist range 201-55\n\nA Wizard’s Guide to Defensive Baking, T. Kingfisher (Argyll Productions)\n\nA Deadly Education, Naomi Novik (Del Rey)\n\nElatsoe, Darcie Little Badger (Levine Querido)\n\nLegendborn, Tracy Deonn (Margaret K. McElderry/ Simon & Schuster Children’s Publishing)\n\nCemetery Boys, Aiden Thomas (Swoon Reads)\n\nRaybearer, Jordan Ifueko (Amulet / Hot Key)\n\nAstounding Award for Best New Writer (presented by Dell Magazines)\n\nThe Astounding Award is not a Hugo Award, but is administered in a similar manner and in parallel with the Hugo Awards. The eligibility rules are specified by the sponsor of the Award. See Hugo Award Categories for additional details about how this category works.\n\n1330 final ballots cast (41.1%)\n\n973 nominating ballots for 181 nominees, finalist range 99-54"}, {"url": "https://www.thehugoawards.org/hugo-history/2004-hugo-awards/", "page_content": "Presented at: Noreascon 4, Boston, Massachusetts, September 2-6, 2004\n\nHost: Neil Gaiman\n\nBase design: Scott Lefton\n\nAwards Administration: Deb Geisler, Rick Katze & Mark Olson\n\n\n\nA total of 567 nomination forms (201 paper and 366 on-line forms) were received. The Novelette category had six finalists due to a tie for fifth place. 1,121 final ballots were cast by the members of Noreascon 4, of which 28 were invalid, for a total of 1,093 valid final ballots.\n\n2004 Hugo Awards Nominating Details\n\n2004 Hugo Awards Final Ballot Voting Details\n\nBest Novel\n\nPaladin of Souls by Lois McMaster Bujold [Eos, 2003]\n\nIlium by Dan Simmons [Subterranean, 2003; Eos, 2003; Gollancz, 2003]\n\nSingularity Sky by Charles Stross [Ace, 2003]\n\nBlind Lake by Robert Charles Wilson [Tor, 2003]\n\nHumans by Robert J. Sawyer [Tor, 2003]\n\nBest Novella\n\n“The Cookie Monster” by Vernor Vinge [Analog Oct 2003]\n\n“The Empress of Mars” by Kage Baker [Asimov’s Jul 2003]\n\n“Just Like the Ones We Used to Know” by Connie Willis [Asimov’s Dec 2003]\n\n“The Green Leopard Plague” by Walter Jon Williams [Asimov’s Oct/Nov 2003]\n\n“Walk in Silence” by Catherine Asaro [Analog Apr 2003]\n\nBest Novelette\n\n“Legions in Time” by Michael Swanwick [Asimov’s Apr 2003]\n\n“The Empire of Ice Cream” by Jeffrey Ford [Sci Fiction, scifi.com 2003-02-26]\n\n“Nightfall” by Charles Stross [Asimov’s Apr 2003]\n\n“Into the Gardens of Sweet Night” by Jay Lake [Writers of the Future XIX, ed. by Algis Budrys (Galaxy Press), 2003]\n\n“Bernardo’s House” by James Patrick Kelly [Asimov’s Jun 2003]\n\n“Hexagons” by Robert Reed [Asimov’s Jul 2003]\n\nBest Short Story\n\n“A Study in Emerald” by Neil Gaiman [Shadows Over Baker Street, ed. by Michael Reaves & John Pelan (Del Rey), 2003]\n\n“Paying It Forward” by Michael A. Burstein [Analog Sep 2003]\n\n“Robots Don’t Cry” by Mike Resnick [Asimov’s Jul 2003]\n\n“Four Short Novels” by Joe Haldeman [F&SF Oct/Nov 2003]\n\n“The Tale of the Golden Eagle” by David D. Levine [F&SF Jun 2003]\n\nBest Related Non-Fiction Book\n\nThe Chesley Awards for Science Fiction and Fantasy Art: A Retrospective by John Grant, Elizabeth L. Humphrey and Pamela D. Scoville [Artist’s and Photographer’s Press Ltd., 2003]\n\nThe Thackery T. Lambshead Pocket Guide to Eccentric & Discredited Diseases by Jeff VanderMeer and Mark Roberts [Night Shade Books, 2003]\n\nSpectrum 10: The Best in Contemporary Fantastic Art by Cathy Fenner and Arnie Fenner [Underwood Books, 2003]\n\nDreamer of Dune: The Biography of Frank Herbert by Brian Herbert [Tor, 2003]\n\nScores: Reviews 1993&endash;2003 by John Clute [Beccon Publications, 2003]\n\nMaster Storyteller: An Illustrated Tour of the Fiction of L. Ron Hubbard by William J. Widder [Galaxy Press, 2003]\n\nBest Dramatic Presentation, Long Form\n\nThe Lord of the Rings: The Return of the King (2003) [New Line Cinema] Directed by Peter Jackson; Screenplay by Fran Walsh & Philippa Boyens & Peter Jackson; based on the book The Return of the King by J. R. R. Tolkien\n\nPirates of the Caribbean: The Curse of the Black Pearl (2003) [Disney] Directed by Gore Verbinski; Screenplay by Ted Elliott & Terry Rossio; Screen Story by Ted Elliott & Terry Rossio and Stuart Beattie and Jay Wolpert\n\nX2: X-Men United (2003) [20th Century Fox/Marvel] Directed by Bryan Singer; Screenplay by Michael Dougherty & Dan Harris and David Hayter; Story by Zak Penn and David Hayter & Bryan Singer\n\nFinding Nemo (2003) [Pixar Animation/Disney] Directed by Andrew Stanton & Lee Unkrich; Screenplay by Andrew Stanton & Bob Peterson & David Reynolds; Story by Andrew Stanton\n\n28 Days Later… (2003) [DNA Films/Fox Searchlight] Directed by Danny Boyle; Written by Alex Garland\n\nBest Dramatic Presentation, Short Form\n\n“Gollum’s Acceptance Speech at the 2003 MTV Movie Awards” (2003) [Wingnut Films/New Line] Written and directed by Fran Walsh & Philippa Boyens & Peter Jackson\n\nFirefly – “The Message” (2003) [Mutant Enemy Inc./20th Century Fox] Directed by Tim Minear; Written by Joss Whedon & Tim Minear\n\nBuffy the Vampire Slayer – “Chosen” (2003) [Mutant Enemy Inc./20th Century Fox] Written and directed by Joss Whedon\n\nFirefly – “Heart of Gold” (2003) [Mutant Enemy Inc./20th Century Fox] Directed by Thomas J. Wright; Written by Brett Matthews\n\nSmallville – “Rosetta” (2003) [Tollin/Robbins Productions/Warner Brothers] Directed by James Marshall; Written by Al Gough & Miles Millar\n\nBest Professional Editor\n\nGardner Dozois\n\nEllen Datlow\n\nDavid G. Hartwell\n\nStanley Schmidt\n\nGordon Van Gelder\n\nBest Professional Artist\n\nBob Eggleton\n\nDonato Giancola\n\nFrank Kelly Freas\n\nFrank Frazetta\n\nJim Burns\n\nBest Semiprozine\n\nLocus ed. by Charles N. Brown, Jennifer A. Hall and Kirsten Gong-Wong\n\nThe New York Review of Science Fiction ed. by Kathryn Cramer, David G. Hartwell and Kevin J. Maroney\n\nInterzone ed. by David Pringle\n\nAnsible ed. by Dave Langford\n\nThe Third Alternative ed. by Andy Cox\n\nBest Fanzine\n\nEmerald City ed. by Cheryl Morgan\n\nMimosa ed. by Rich Lynch and Nicki Lynch\n\nPlokta ed. by Alison Scott, Steve Davies and Mike Scott\n\nFile 770 ed. by Mike Glyer\n\nChallenger ed. by Guy H. Lillian III\n\nBest Fan Writer\n\nDave Langford\n\nCheryl Morgan\n\nBob Devney\n\nJohn L. Flynn\n\nJeff Berkwits\n\nBest Fan Artist"}], "John Howe was inducted into the Science Fiction and Fantasy Hall of Fame in 2011.": [{"url": "https://www.mopop.org/exhibitions-plus-events/exhibitions/science-fiction-and-fantasy-hall-of-fame/", "page_content": "The gates of history are open. A new class of legends will rise. Who dares speak the name of this legendary place? Be brave and say it clear: SFFHOF!\n\nFor nearly twenty years MoPOP has been the proud custodian of the Science Fiction and Fantasy Hall of Fame, preserving and sharing this essential pillar of pop culture history. Once a year we usher in a new class of inductees, each reshaping the whole with their art and perspectives, and we can’t choose that class without you.\n\nVote for SFFHOF 2023 Inductees\n\nCheck out our most recent Hall of Fame class\n\nView full list of Hall of Fame members\n\nScience Fiction & Fantasy Hall of Fame is included with museum admission and is free for MoPOP Members.\n\nPhoto by Anita Woo."}, {"url": "https://geekfrontiers.com/science-fiction-exhibits/the-science-fiction-and-fantasy-hall-of-fame/", "page_content": "What do David Bowie and Philip K. Dick have in common? What about John Williams and Dungeons & Dragons? Jack Kirby and Steven Spielberg? Star Trek and Wonder Woman? George Lucas and Myst? Harlan Ellison and The Princess Bride? Although an eclectic group of writers, directors, games, films and artists, each of these iconic mainstays of Geek Culture share one significant honor – induction into into the Science Fiction and Fantasy Hall of Fame located at the Museum of Pop Culture in Seattle, Washington.\n\nScience Fiction and fantasy have been literary genres for centuries, dating back to the publication of Mary Shelley’s Frankenstein in 1818 and the emergence of twin talents Jules Verne and H.G. Wells later that same century. The collection of stories known as The Arabian Nights and even Sir Francis Bacon’s New Atlantis have elements of sci-fi within them, and date back even further. Fantasy has a much longer tradition, meanwhile, with the works of Homer from Ancient Greece and the legend of King Arthur from Medieval Britain all falling within the genre.\n\nBecause of the timeless nature of science fiction and fantasy, its influence on human history, and its growth in popularity during the twentieth century, the Kansas City Science Fiction and Fantasy Society teamed with the Center for the Study of Science Fiction at the University of Kansas to launch the Science Fiction and Fantasy Hall of Fame in 1996. During its nine years in Kansas City, the Hall inducted eighteen members – all of whom were either writers or editors – including the aforementioned Mary Shelley, Jules Verne and H.G. Wells, as well as Edgar Rice Burroughs, Ursula K. Le Guin, Arthur C. Clarke, and Ray Bradbury.\n\nHugo Gernsback – often considered the “father of science fiction” – was also an initial inductee. Although not a writer, it was Gernsback who published the first science fiction pulp magazine, Amazing Stories, in 1926. Not only did the pulps of the 1920s and 1930s embed an interest in science fiction in the minds of multiple generations, they likewise directly led to modern day Geek Culture and such staples as fan conventions and cosplay.\n\nIn 2004, the Science Fiction and Fantasy Hall of Fame moved from Kansas City to Seattle, where Microsoft co-founder Paul Allen had already established the Experience Music Project. The Hall was merged into that venue and jointly became known as Experience Music Project and Science Fiction Hall of Fame, which was later shortened to simply EMP. The museum underwent an additional name change in 2016 – becoming the Museum of Pop Culture, or MoPOP for short – to better reflect its diverse nature.\n\nThe Science Fiction and Fantasy Hall of Fame also went through changes, with “fantasy” initially being dropped from its title before being restored in 2013, and a wider scope that included film, television and video games. Creations as well as creators likewise became eligible, and twenty additional inductees were added in 2016 to commemorate the twentieth anniversary of the Hall of Fame’s founding. While those changes went beyond the original scope established by the Kansas City-based partnership that established the Hall in 1996, they provided a broader perspective to the genres while making the Science Fiction and Fantasy Hall of Fame more inclusive.\n\n“From early on, we thought we’d have to tell the whole story,” Greg Bear, former chairman of the Experience Music Project’s advisory board, told NBC News in 2004. “That means you take key artifacts – those you could get – and put them on display, everything from books and magazines to films. You interview authors, filmmakers, the creative minds and talk about what inspired them. And you put scientists into the mix. Put all that together and you’ve got a fabulous story, one that hasn’t been told before.”\n\nAlthough it took a while, the Museum of Pop Culture eventually found ways to fulfill Greg Bear’s vision with exhibits on Avatar and Star Trek, as well as the museum’s involvement with the 2018 AMC miniseries James Cameron’s Story of Science Fiction. “Early in development we gave feedback on the overall structure of the show – how to organize the sprawling topic that is science fiction into episodes and acts,” MoPop curator Brooks Peck explained to AMC regarding the documentary. “Once that was established, I helped connect the producers to authors, critics, and other experts who could speak to the topics. I gave feedback on what science fiction creations to cover, especially in classic literature. We did a fair bit of wrangling over what to include and where, hashing out questions like, is Battlestar Galactica more appropriate in the Space section, or Intelligent Machines?”\n\nIn addition to its involvement with James Cameron’s Story of Science Fiction, the Museum of Pop Culture likewise launched a permanent Science Fiction and Fantasy Hall of Fame exhibit that not only honors each of the inductees but also spotlights their achievements through props from the creations that made them famous. The leather jacket and fedora worn by Harrison Ford in Indiana Jones and the Last Crusade, for instance, compliments the Steven Spielberg display, while a lightsaber from the original 1977 Star Wars corresponds with George Lucas. Other highlights include a spacesuit from Lost in Space, a manuscript notebook from Ursula K. Le Guin, an IBM Selectric typewriter owned by Isaac Asimov, and the costume worn by Maurice Evans as Dr. Zaius in The Planet of the Apes.\n\n“Science fiction and fantasy are two of the most important kinds of storytelling because they show us realities beyond our own,” the exhibit explains. “Science fiction offers reflections on our social structures and the technologies we use. Fantasy examines our spiritual values and the nature of good and evil. Both stimulate our imaginations, show us new possibilities, and take us away from our everyday lives.”\n\nIn 1996, the Kansas City Science Fiction and Fantasy Society teamed with the Center for the Study of Science Fiction at the University of Kansas to launch the Science Fiction and Fantasy Hall of Fame. Today, that endeavor continues at the Museum of Pop Culture in Seattle. The location, however, is irrelevant as those inducted have already achieved a lasting legacy that goes beyond space and time while leaving an indelible mark on the history of the human race as well.\n\nAs the Museum of Pop Culture puts it, they “are the game-changers, the visionaries, the people and ideas who, each in their day, expanded the borders of imagination.”\n\nAnthony Letizia"}, {"url": "https://www.geekwire.com/2014/5-geeky-inductees-science-fiction-fantasy-hall-fame/", "page_content": "Geek Life: Fun stories, memes, humor and other random items at the intersection of tech, science, business and culture. SEE MORE\n\nA cutting-edge film maker who stunned audiences with A Clockwork Orange and 2001: A Space Odyssey. A comic book artist who created covers for Flash Gordon and Buck Rogers. And a Japanese animator whose Princess Mononoke fantasy adventure film is one of the most celebrated of all time.\n\nThose are among some of the 2014 inductees into the Science Fiction and Fantasy Hall of Fame, which is housed in Seattle at the EMP Museum. Inductees include author and screenwriter Leigh Brackett, artist Frank Frazetta, film director Stanley Kubrick, writer and animator Hayao Miyazaki, and author Olaf Stapledon.\n\nThey were nominated by EMP members, with final inductees chosen by a panel of award-winning authors, artists, editors, publishers, and film professionals. Other Hall of Fame members include musician David Bowie, author J.R.R. Tolkien and filmmaker George Lucas. The Hall of Fame was established in 1994, and moved to Seattle in 2004 from the University of Kansas.\n\nHere’s more on each of the inductees, courtesy of EMP.\n\nLeigh Brackett, December 7, 1915 – March 17, 1978\n\nLeigh Brackett has been hailed as the “Queen of the Space Opera”—a master of richly detailed stories of planetary romance. She began writing during the early years of the Golden Age of science fiction, quickly gaining prominence as a novelist and screenwriter.\n\nA native of Los Angeles, Brackett joined the Los Angeles Science Fiction Society in 1939 where she met other emerging science fiction authors including Ray Bradbury and Robert Heinlein. They would remain close personal friends for years to come. In 1940, her first published science fiction story, “Martian Quest” appeared in Astounding Science Fiction. She worked in many genres—not only science fiction, but also crime, mystery, and westerns. Most of her science fiction falls into the planetary romance style (also called science fantasy)—sagas of adventure and struggle across a fantastical solar system that included desert barbarians on Mars, jungles on Venus, and deadly storms on Mercury.\n\nEven at the time these stories were written it was known that these planets couldn’t harbor such wonders, hence the term science fantasy. She embraced the escapist nature of the genre, saying, “These stories served to stretch our little minds, to draw us out beyond our narrow skies into the vast glooms of interstellar space, where the great suns ride in splendor and the bright nebulae fling their veils of fire parsecs-long across the universe…. Escape fiction? Yes, indeed!” Notable works include Shadow Over Mars (1951), The Long Tomorrow (1955), and Alpha Centauri or Die! (1963).\n\nSimultaneously, Brackett built a career as a screenwriter, notably with The Big Sleep (1946), Rio Bravo (1959), El Dorado (1966), and The Long Goodbye (1973). She contributed episodes to various TV series including The Alfred Hitchcock Hour and The Rockford Files. In 1977, director George Lucas hired Brackett to write the screenplay for Star Wars: Episode V – The Empire Strikes Back, bridging her space opera and screenwriting talents. She completed the first draft in 1978, just a few weeks before her death.\n\nFrank Frazetta, February 9, 1928 – May 20, 2010\n\nFrank Frazetta’s prolific art graced the pages of comic books, the covers of paperback adventure novels, and the sleeves of record albums with a distinctively rugged style that strongly influenced future generations of illustrators.\n\nHis work is immediately recognizable and larger than life. The men in his illustrations flex their rippling musculature as scantily clad Amazon women flaunt improbable proportions—both fighting off grotesque monsters conjured from Frazetta’s imagination.\n\nA precocious child with preternatural artistic abilities, Frazetta enrolled at the Brooklyn Academy of Fine Arts at age 8 and by age 16 was working in Bernard Baily’s studio as an assistant. In 1947, Graham Ingels gave Frazetta his big break with a job at Standard Comics. Frazetta drew comics across many genres: fantasy, westerns, and mysteries among them. Throughout the 1950s he worked at EC Comics and National Comics, as well as created covers for Buck Rogers and daily Flash Gordon strips. While his experiences in the comic book industry helped Frazetta hone his craft, he found the work to be stifling to his emerging personal style and vision.\n\nFrazetta hit his stride with painted covers for paperback adventure books. His covers for the Conan the Adventurer collection by Robert E. Howard redefined the sword and sorcery illustration completely—many new readers bought the book based on the cover alone.\n\nThroughout his career, Frazetta accumulated many accolades, including a 1966 Hugo Award for Best Professional Artist and a Life Achievement Award in 2001 from the World Fantasy Convention. Frazetta was inducted into the Will Eisner Comic Book Hall of Fame in 1995 and the Jack Kirby Hall of Fame in 1999.\n\nFrazetta is cited as an influence by a diverse group of artists including Yusuke Nakano (Nintendo’s The Legend of Zelda), Roger Sweet (He-Man creator), and fantasy artist Joseph Vargo.\n\nStanley Kubrick, July 26, 1928 – March 7, 1999\n\nStanley Kubrick’s impact on science fiction filmmaking cannot be underestimated. He brought otherworldly concepts to wide audiences and mainstream acceptance, and his film 2001: A Space Odyssey continues to influence the genre to this day.\n\nStarting in high school, Kubrick worked as a freelance photographer for Look magazine, and later became an employee. He began to hone his visual storytelling skills by creating stories told in series of still images. Soon he moved into documentary filmmaking, tackling diverse subjects such as boxers, sailors, and priests. His first feature film, a war story titled Fear and Desire (1953), had only two crew—Kubrick and his wife Toba Metz. Seven years later he directed Spartacus (1960), the highest budget American film to date. With the apocalyptic satire Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964), Kubrick adapted a serious novel about nuclear destruction into a comedy—to controversial effect.\n\nHis next project, 2001: A Space Odyssey (1968), changed science fiction film forever. Based on Arthur C. Clarke’s short story “The Sentinel” and written in collaboration with him, the film is an ambitious portrayal of the evolution of humanity as assisted by extraterrestrials. It features bold special effects and a highly realistic portrayal of spaceflight. Many directors cite 2001 as a key influence, and the film set the stage for the coming era of the science fiction blockbuster.\n\nKubrick went on to write and direct A Clockwork Orange (1971), based on Anthony Burgess’ novel about a sociopathic teen who is brainwashed into docility. He also worked for many years on an adaptation of Brian Aldiss’ short story “Super-Toys Last All Summer Long,” but died before he could realize the film. Steven Spielberg took over the project, which became A.I. Artificial Intelligence (2001).\n\nHayao Miyazaki, January 5, 1941 –\n\nWriter, animator, and film director Hayao Miyazaki has spent his career creating fantastic and wondrous worlds for a global audience. His films depict pastoral, sometimes utopian landscapes and celebrate nature, flight, imagination, and the simple joys of childhood.\n\nHe began his animation career in 1963 working as a concept artist, in-between artist, and storyboard artist, working his way up to directing for television. He directed his first feature film Lupin III: The Castle of Cagliostro, in 1979. In 1984 he founded Studio Ghibli, proceeding to produce a string of successful films such as Castle in the Sky (1986), Princess Mononoke (1997), and Spirited Away (2001).\n\nBetween 1982 and 1994, Miyazaki wrote and drew the manga Nausicaä of the Valley of the Wind, an epic story set approximately one thousand years in the future, in a time when the Earth is recovering from a war that left the landscape ravaged and strangely altered. The heroine, Princess Nausicaä, is a brave young woman called upon to lead her small nation. She is the first of a series of strong heroines created by Miyazaki such as Satsuki in My Neighbor Totoro (1988), Kiki in Kiki’s Delivery Service (1989), Sophie in Howl’s Moving Castle (2004), and others.\n\nMiyazaki garnered international acclaim with Princess Mononoke, which won the Picture of the Year Japanese Academy Award, a Nebula Award for Best Script, and numerous others. Spirited Away claimed the Best Animated Film Academy Award in the United States. In 2005 the Venice Film Festival awarded him a lifetime achievement award.\n\nOlaf Stapledon, May 10, 1886 – September 6, 1950\n\nOlaf Stapledon was many things: philosopher, educator, veteran of WWI, and pacifist activist—but he is remembered most fondly as the author of ambitious, prescient, and seminal works of science fiction.\n\nA graduate of Oxford, Stapledon worked in a variety of jobs before taking up social work and tutoring for the Workers’ Educational Association teaching philosophy, history, and poetry. During World War I he served as a conscientious objector with the Friends’ Ambulance Unit in France and Belgium. He later attended the University of Liverpool and was awarded a PhD in Philosophy in 1925. His first novel, Last and First Men, was published in 1930 and with its success, Stapledon devoted himself to writing full time.\n\nSet two billion years in the future, Last and First Men describes an epic journey of human evolution through the rise and fall of 18 human races. In 1937, Stapledon published Star Maker—a story spanning 100 billion years of human and alien evolution. Odd John (1935) concerns a precocious young boy who discovers that he is one of a number of mutant geniuses. The mutants create an isolated colony and ask only to be left alone, but find that simple request too great for their fellow humans to respect.\n\nStapledon’s works collectively explore the capacity of human intelligence, compassion, and the ability to comprehend our place in the universe. He is credited with first describing phenomena that have moved from fiction to science including genetic engineering and terraforming. He frequently lectured throughout Europe, was an outspoken agnostic and advocate for peace, and was involved in the anti-apartheid movement. Stapledon Wood, near his home in Caldy, is named after him. In 2001, he was awarded the first annual Cordwainer Smith “Rediscovery” Award."}, {"url": "http://www.midamericon.org/halloffame/", "page_content": "The Science Fiction and Fantasy Hall of Fame was founded in 1996 by the Kansas City Science Fiction and Fantasy Society and the J. Wayne and Elsie M. Gunn Center for the Study of Science Fiction at the University of Kansas. Each year from 1996-2004, the Hall of Fame honored four individuals on the basis of their continued excellence and long-time contribution to the science fiction and fantasy field. The final year of indications was 2004 , when Brian Aldiss and Harry Harrison were inducted into the Hall of Fame with Mary Shelley, and E. E. \"Doc\" Smith being inducted posthumously. Following that year, inductions were made into the renamed Science Fiction Museum and Hall of Fame in Seattle, Washington. The new Hall of Fame emphasized only science fiction and expanded the Hall of Fame to recognize artists and motion picture professionals while reducing the emphasis on authors. Following the closing of that museum in 2011, the once again named Science Fiction and Fantasy Hall of Fame is part of the Museum of Pop Culture. Each year's inductions in the Science Fiction and Fantasy Hall of Fame took place in Lawrence, Kansas during the Campbell Conference at the University of Kansas in early July. The annual Campbell Conference and its presentations of the the John Campbell Award for best SF novel of the year, and the Theodore Sturgeon Award for best short science fiction of the year continues. Details of the current Campbell weekend are available at http://www.sfcenter.ku.edu/campbell-conference.htm. 2004 Inductees\n\nphotos from the 2004 induction Brian Aldiss ' (1925-2017) first publication was short story \"Criminal Record\" in Science Fantasy in 1954. He went on to write over forty novels and over 300 short stories. He also wrote poetry and highly acclaimed critical works. A resident of the United Kingdom, Mr. Aldiss won the Hugo Award, Nebula Award, British Science Fiction Award, and John W. Campbell Memorial Award. He was honored as SFWA Grand Master in 1999 and was three times Guest of Honor or Toastmaster of the World Science Fiction Convention. Harry Harrison's (1925-1912) professional writing career spanned fifty years. His career began as an artist & writer of comics in the 1940s. His first novel Deathworld and its sequels were and still are very popular. His most popular series featured The Stainless Steel Rat. In the 1990s the West of Eden trilogy marked a new phase in Harrison's career. Along the way, he edited dozens of science fiction anthologies. With Brian Aldiss he founded the John W. Campbell Award. Mary Shelley 's (1797-1851) Frankenstein, or The Modern Prometheus is considered by some to be the first science fiction novel. Her other early science fiction includes several short stories and the novel The Last Man. Merry Shelly and her work have appeared in countless books, graphic novels, movies and television shows. E. E. \"Doc\" Smith (1890-1965) was one of the most popular authors of \"space opera.\" His two most successful series were the Skylark series which began with Skylark of Space and the Lensman series which began with Triplanetary. He wrote nearly 30 novels, mostly in the 1930s and 1940s, though his writing continued until his death in 1965.\n\n2003 Inductees\n\nphotos from the 2003 induction Wilson Tucker (1914-2006) contributed to many aspects of genre Science Fiction. He was the author of 60 short stories and novels, including the Campbell Award winning The Year of the Quiet Sun. The Science Fiction and Fantasy Writer's Marcia selected him as the second person to honor as Author Emeritus. He was a convention runner, and as \"Bob\" Tucker was well loved as a convention guest and fanzine writer. Kate Wilhelm (1928-2018) began publishing science fiction in 1956. Her Hugo Award winning Where Late the Sweet Birds Sang brought attention to her and the genre from outside the science fiction field and helped to raise a generation's consciousness. A writing educator, she founded the Milford Science Fiction Writers\u0092 Conference and the Clarion Science Fiction Writers\u0092 Workshop, with her husband Damon Knight. Damon Knight (1922-2002) was an fan, writer, editor, critic and writing teacher. His writing career spanned over 60 years, with his most famous work being the short story \"To Serve Man.\" In addition to co-founding Milford and Clarion, he founded the Science Fiction and Fantasy Writers of America (SFWA) and was its first president. Edgar Rice Burroughs (1875-1950) was a prolific author of fantasy, science fiction and crime novels. He is best known as the creator of Tarzan of the Apes, who appeared in 26 novels, and John Carter of Mars, who appeared in 11 novels.\n\n2002 Inductees\n\nphotos from the 2002 induction Samuel R Delany (1942) has influenced many of the current generation of science fiction and fantasy writers, both directly thorough his teaching and indirectly though his writing. He has received 6 Hugo and Nebula Awards. He is presently a professor of English and Creative Writing at Temple University in Philadelphia. His most recent science fiction novel is Through the Valley of the Nest of Spiders. Science Fiction Writers of America named him SFWA Grand Master in 2013. Michael Moorcock (1939) was a magazine editor at the age of 15. He has been a pioneer in both writing and editing. His novels have won the Guardian Fiction Prize, the Nebula Award, the World Fantasy Award, and the British Fantasy Award. He wrote lyrics for multiple songs by the rock bands Hawkwind and Blue Oyster Cult. Moorcock's most successful work has been the Elric of Melniboné stories. James Blish (1921-1975) was one of the founders of genre science fiction, first as a member of the Futurians and following many years of writing, as one of the founders of Science Fiction & Fantasy Writers of America (SFWA). He received 2 Nebula Awards and 2 Hugos, as well as other awards. The James Blish award for criticism was created after his death. Donald A. Wollheim (1914-1990) was an active early science fiction fan who began writing, but quickly moved into editing. He created the Ace double books and edited the first US science fiction anthology. After working as an editor for other publishing houses, he was cofounder of DAW books in 1971\n\n2001 Inductees\n\nphotos from the 2001 induction Jack Vance (1916-2013) published nearly 90 novels and collections. His work was first published in 1945 and he is still active in the field. He has received every major genre award, including the Edgar Award, Hugo Award, Nebula Award World Fantasy Award, and SFWA Grand Master Award Ursula K. Le Guin (1929-2018) published over eighty short stories, two collections of essays, ten books for children, several volumes of poetry, and nineteen novels Her many awards included the Boston Globe-Hornbook Award for juvenile fiction and the National Book Award for The Farthest Shore. She was named a SFWA Grand Master in 2002 Alfred Bester (1913-1987) received the first Hugo Award best novel for The Demolished Man. It and The Stars my Destination are his best known works. In 1987 Science Fiction Writers of America honored him with their Grand Master Award. Fritz Leiber (1910-1992) was a fine writer of supernatural horror fiction. He published 11 novels and nearly 200 short stories. He is best known for the adventures of Fafhrd and the Gray Mouser, a series which has been continued after his death, by Robin Wayne Bailey. Leiber was the second recipient of the World Fantasy Convention's Life Achievement Award.\n\n2000 Inductees\n\nphotos from the 2000 induction Poul Anderson (1926-2001) published well over 100 novels over the last 50 years. He received seven Hugo Awards, three Nebula Awards and was the 1997 SFWA Grand Master recipient. His novella The Queen of Air and Darkness received the Hugo, Nebula and Locus Awards. Gordon R. Dickson (1923-2001) published over 80 novels and many short stories. His best known work is the Childe Cycle series of novels about the Dorsai. He was the recipient three Hugo Awards and the 1967 Nebula Award for the novelette \"Call Him Lord.\" Theodore Sturgeon (1918-1985) was one of America's best loved short story writers. He wrote over 200 stories, several novels, and film and TV plays. His many literary awards include the Hugo, the Nebula, and the International Fantasy Award. The juried award for best short science fiction of the year is named in his honor. Eric Frank Russell's (1905-1978) impact on the science fiction genre goes far beyond the relatively small volume of work (14 novels and 17 short works). Called \"The Forgotten Master his humor and insight touched readers in a way that few have matched. His short story \"Allamagoosa\" won the Hugo Award in 1955. 1999 Inductees Ray Douglas Bradbury (1920-2012) author, fan, poet, screenwriter and playwright, was one of the best known figures in the science fiction genre. Bradbury\u0092s work is as diverse as the novel Fahrenheit 451, the novel & play Dandelion Wine, and the screenplay to the movie Moby Dick. Bradbury has the rare ability to appeal equally to critics and fans. Robert Silverberg (1935) has authored over 100 novels and edited over 70 anthologies. He published his first novel, Revolt on Alpha C, at age 19 and received the Hugo award for \"most promising new author\" two year later. This highly prolific author has contributed much the science fiction genre. Jules Gabriel Verne (1825-1905) helped shape and found modern science fiction. This French author wrote 64 novels including such classics as Voyage au centre de la tere (Journey to the Center of the Earth), Vingt mille lieues sous les mers (Twenty Thousand Leagues Under the Sea) and L'Île mystérieuse (The Mysterious Island). Abraham Merritt (1884-1943), author and editor, influenced many writers with his romantic adventure fantasies. His novels included The Moon Pool and People of the Pit. His most popular story, The Ship of Ishtar, was serialized in Argosy in 1924.\n\n1998 Inductees\n\nphotos from the 1998 induction Hal Clement (1922-2003) is the pen name of Harry Clement Stubbs. He held degrees in astronomy, chemistry and education, and was a high school science teacher for many years. His first publication was \"Proof\" in Astounding Science Fiction in 1942. His first novel, Needle was published in 1950, but his best known work is Mission of Gravity. Hal's works include particularly believable and carefully thought out alien races. He received a retro-Hugo award for his short story \"Uncommon Sense\" (ASF, 1945). Frederik Pohl (1919-2013) writer, editor and SF literary agent was a pivotal figure in the science fiction field, His many novels include GATEWAY (co-authored with C. M. Kornbluth, the John W. Campbell Memorial Award winning The Years of the City and Gateway, winner of the Hugo, Nebula and Campbell awards. Frederik was president of the Science Fiction Writers of America from 1974-1976 and received the SFWA Grand Master Award in 1992. He was one of the founders and the second President of World SF, the international association of science fiction professionals. Catherine Lucille Moore (1911-1987) established her place in the SF field with her first work, \"Shambleau\" (Weird Tales, 1933), which introduced one of her most popular heroes, Northwest Smith. She wrote under many pseudonyms including Lewis Padgett, Lawrence O'Donnell and many of the works that appeared under the name of her husband, Henry Kuttner. She was a superior writer and a pioneer in the field of fantasy and science fiction. Her work has not received the attention that is deserves. Robert Anson Heinlein (1907-1988) was arguably the most influential writer in the science fiction genre. He received 4 Hugo awards and the first SFWA Grand Master Award. His 31 novels are rarely out of print and include Starship Troopers, Stranger in a Strange Land and The Moon is a Harsh Mistress. Heinlein grew up in Kansas City, Missouri and was honored as the Guest of Honor at the Kansas City World Science Fiction Convention in 1976 (MidAmericon) and two other World Science Fiction Conventions.\n\n1997 Inductees\n\nphotos from the 1997 induction Andre Norton (1912-2005) entered the field through children's science fiction and fantasy. Although much of her work has been marketed to children and young adults, its themes and complexity appeal to a larger adult market. In 1984 she became the first woman to be honored with the Nebula Grand Master Award. Arthur C. Clarke (1917-2008) has been honored with the Nebula Grand Master Award and several Hugo awards. The award for the best science fiction novel in the United Kingdom is named the Arthur C. Clarke Award in his honor. His most famous work, 2001, is based on his earlier short story, \"The Sentinel.\" Herbert George Wells (1866-1946) was one of the founding fathers of science fiction. His best known work is The Time Machine. He published over 60 books and wrote the screen plays for many of the movies based on his work. Isaac Asimov (1920-1992) was one of the most influential writers of science fiction's \"Golden Age.\" He published 400 books including science fiction and mysteries, and subjects from science to the bible. Asimov won every major award in the science fiction genre.\n\n1996 Inductees\n\nphotos from the 1996 induction Jack Williamson (1908-2006) was continuously active in the genre from 1928 to 2006. Although best known for his fiction, his autobiographical Wonder's Child: My Life in Science Fiction won a Hugo award in 1985. He received the SFWA Grand Master award in 1976, the Pilgrim Award of Science Fiction Research Association in 1973, and served as SFWA President in 1978-80. John Clute says of Williamson, \"In his work and in his life, he has encompassed the field.\" A. E. van Vogt's (1912-2000) science fiction career began with the short story, \"Black Destroyer\" published in Astounding Science Fiction in 1939. He was one of the creators of John W. Campbell Jr.'s Golden Age of Science Fiction. Earlier in 1996, van Vogt received the Grand Master Award from the Science Fiction and Fantasy Writers of America. His best known novels are Slan and The World of Null-A. John W. Campbell Jr. (1910-1971) began his writing career in the early 1930s. His most popular work was \"Who Goes There?\" which was filmed as The Thing in 1951, 1982 and 2011. Campbell's greatest contribution to the field was as a magazine editor, where he discovered writers such as Isaac Asimov, Lester Del Rey, Robert A. Heinlein, Theodore Sturgeon and A. E. van Vogt. During his tenure as editor, Astounding Science Fiction received seven Hugo awards. Hugo Gernsback (1884-1967) founded many magazines about science and/or science fiction and has been called \"The Father of Magazine Science Fiction.\" His first magazine was Modern Electrics, where he published his novel 124C 41+ in 1911. Gernsback founded the magazine Amazing Stories in 1926 and Science Wonder Stories and Air Wonder Stories in 1929, which he combined into Wonder Stories. Copyright 1997-2018 by Keith Stokes"}, {"url": "https://locusmag.com/2017/01/2016-sff-hall-of-fame-inductees/", "page_content": "The Museum of Pop Culture (MoPOP) announced the 2016 inductees to the Science Fiction and Fantasy Hall of Fame. Eligibility has been expanded “to recognize the genre’s most impactful creations,” and the 2016 inductees are authors Terry Pratchett and Douglas Adams, along with Star Trek and Blade Runner.\n\nIn honor of the museum’s 20th anniversary, 20 additional creators and works were inducted as well:\n\nCreators\n\nMargaret Atwood\n\nKeith David\n\nGuillermo del Toro\n\nTerry Gilliam\n\nJim Henson\n\nJack Kirby\n\nMadeleine L’Engle\n\nC.S. Lewis\n\nH.P. Lovecraft\n\nLeonard Nimoy\n\nGeorge Orwell\n\nRumiko Takahashi\n\nJohn Williams\n\nWorks\n\n2001: A Space Odyssey\n\nDungeons & Dragons\n\n\n\nThe Matrix\n\nMyst\n\nThe Princess Bride\n\nWonder Woman\n\nThe X-Files\n\nNominations are submitted by MoPOP members and the final inductees are chosen by a panel of award-winning authors, artists, editors, publishers, and film professionals. A new Hall of Fame exhibit at MoPOP will celebrate current and past inductees in an opening event March 4, 2017.\n\nThe Science Fiction Hall of Fame was founded in 1996 and then relocated from the Gunn Center for the Study of Science Fiction and Fantasy at the University of Kansas to its permanent home at MoPOP (formerly EMP) in 2004."}, {"url": "https://www.geni.com/projects/Science-Fiction-and-Fantasy-Hall-of-Fame/23781", "page_content": "Science Fiction and Fantasy Hall of Fame\n\nThe Science Fiction and Fantasy Hall of Fame was founded in 1996 by the Kansas City Science Fiction and Fantasy Society (Kansas City, Missouri) and the Center for the Study of Science Fiction (CSSF) at the University of Kansas (KU). The Chairmen were Keith Stokes (1996–2001) and Robin Wayne Bailey (2002–2004). Only writers and editors were eligible for recognition and four were inducted annually, two deceased and two living. Each class of four was announced at Kansas City's annual science fiction convention, ConQuesT, and inducted at the Campbell Conference hosted by CSSF.\n\nThe Hall of Fame stopped inducting fantasy writers after 2004, when it became part of the Science Fiction Museum affiliated with EMP, under the name \"Science Fiction Hall of Fame\". Having inducted 36 writers in nine years, in 2005 it began to recognize non-literary media. It retained the quota of four new members and thus reduced the annual number of writers. The 2005 and 2006 press releases placed new members in \"Literature\", \"Art\", and \"Film, Television and Media\", and \"Open\" categories, one each. In 2007 and 2008 the fourth inductee was placed in one of the three substantial categories.\n\nEMP de-installed the Science Fiction Museum in March 2011. When the exhibition \"Icons of Science Fiction\" opened in June 2012, a new Hall of Fame display was unveiled and the class of 2012 inducted.\n\nNominations are submitted by EMP Museum members but the selections are made by \"award-winning science fiction authors, artists, editors, publishers, and film professionals.\"\n\nEMP restored the original name online during June 2013 and announced five new members, one daily, beginning June 17. The first four were cited largely or wholly for science fiction but the last was J. R. R. Tolkien, \"hailed as the father of modern fantasy literature\".\n\nThe class of 2014 brings the number of members to 79, four annually except five in 2008 and 2013–2014.\n\nScience Fiction and Fantasy Hall of Fame inductions\n\nhttp://en.wikipedia.org/wiki/EMP_Museum#Science_Fiction_and_Fantasy..."}, {"url": "https://geekireland.com/science-fiction-fantasy-hall-of-fame-jk-rowling-stan-lee/", "page_content": "The Science Fiction and Fantasy Hall of Fame was set up in 1996 and was originally created to honour writers and editors of Science Fiction and Fantasy literature. In recent years, the Hall of Fame has gone through a number of changes. and not only inducted people other that literary contributors, including late David Bowie in 2013 for his contributions to Science Fiction and Fantasy, but has also works and franchises, like Star Trek and Dungeons & Dragons.\n\nIt was recently announced that both Stan Lee and J.K. Rowling would be inducted into the Science Fiction and Fantasy Hall of Fame. These two writers and creators have brought Science Fiction and Fantasy into the mainstream in a way few could imagine.\n\nStan Lee started his career as an assistant at Timely Comics in the late 1930s, which would evolve into Marvel Comics in the 1960s, and has written, edited and published comics for Marvel over many decades. Stan has also served as an executive producer on nearly every Marvel film & TV production, as well as cameoing in most of them. Stan Lee has co-created some of the greatest Marvel heroes that we love today, such as Spider-Man, Hulk, Iron Man and the X-Men, among many more.\n\nJ.K. Rowling was stuck waiting for a train when the inspiration for a story about a boy attending a school of wizardry came to her. Five years later, she finished Harry Potter and the Philosopher’s Stone and the rest is history. She wrote seven books in the Harry Potter series, which were in turn made into hugely successful film series. She has also written other novels from that same universe, like Fantastic Beasts and Where to Find Them, which was also turned into a film and its sequel, The Crimes of Grindelwald is due out this year.\n\nAs well as the two amazing creators above, there will be two other inductees into the Science Fiction and Fantasy Hall of Fame this year. The Legend of Zelda video game series will also be inducted along with the Buffy the Vampire Slayer franchise."}, {"url": "http://sf-encyclopedia.com/entry/sf_hall_of_fame", "page_content": "Science Fiction Hall of Fame\n\nEntry updated 26 February 2021. Tagged: Award.\n\nA life achievement honour (see Awards) inaugurated in 1996 by the Kansas City SF and Fantasy Society and the J Wayne and Elsie M Gunn Center for the Study of Science Fiction at the University of Kansas, as the Science Fiction and Fantasy Hall of Fame, with both sf and fantasy authors eligible. Initially four authors were inducted each year, two posthumously. After the 2004 inductions the Hall of Fame was transferred to the Seattle-based Science Fiction Museum and Hall of Fame, now a part of the EMP Museum of popular culture and (in particular) popular music. Since 2004 the four inductees have been drawn from the wider categories Film, Literature, Media and Open; also from 2004, the name changed to Science Fiction Hall of Fame and fantasy authors were for a time ineligible but were welcomed back into the fold in and after 2013, when J R R Tolkien was honoured and the initial award title Science Fiction and Fantasy Hall of Fame restored. To preserve continuity the headword of this entry retains the name applicable at the time of its creation.\n\nIn 2016 the scope was changed again to include not only creators but creations (examples of genre Cinema, Television and Games), with two examples of each being honoured. Also in this twentieth anniversary year a total of twenty additional inductees in both categories were announced, perhaps as a catching-up exercise.\n\nFor the unrelated Science Fiction Hall of Fame anthology sequence whose contents are voted by members of Science Fiction and Fantasy Writers of America, see Nebula Anthologies. [DRL]\n\nsee also: First Fandom Hall of Fame.\n\nCreators\n\nCreations\n\nlinks\n\nprevious versions of this entry"}, {"url": "https://www.tor.com/2014/06/27/science-fiction-fantasy-hall-of-fame-announce-2014-inductees/", "page_content": "The Science Fiction and Fantasy Hall of Fame has announced the 2014 roster of inductees into the Hall of Fame, showing their commitment to celebrating the breadth and depth of the SFF community. Animation master Hayao Miyazaki will join classic painter Frank Frazetta, space opera queen Leigh Brackett, philosopher and writer Olaf Stapledon, and god-of-iconoclastic-directors Stanley Kubrick!\n\nThe inductees include:\n\nFrank Frazetta, an artist who not only spent many years in the comics trenches but also breathed new life into Robert E. Howard’s Conan stories with his highly-detailed paintings.\n\nHayao Miyazaki, one of the greatest figures in animation, whose films Princess Mononoke, Spirited Away, Nausicaä of the Valley of the Wind, My Neighbor Totoro and Kiki’s Delivery Service only scratch the surface of a rich career.\n\nLeigh Brackett, “Queen of the Space Opera” had two careers: in one she wrote pulp masterpieces across genres, including Shadow Over Mars, The Long Tomorrow, and Alpha Centauri or Die! In the other, she was the screenwriter for classic films like The Big Sleep, Rio Bravo, El Dorado, and The Long Goodbye. As if all of that wasn’t enough, she also wrote a draft of the screenplay for Star Wars: Episode V – The Empire Strikes Back, in which she introduced the idea that Luke Skywalker needed a twin, and it needed to be a sister.\n\nOlaf Stapledon was a prescient thinker and writer who used his work to explore the greatest possibilities of humanity. His novels, including Last and First Men, Star Maker, and Odd John track human evolution, mutation, and the limits of human intelligence. Stapledon was the first science fiction writer to deal seriously with genetic engineering and terraforming, and also toured the world advocating for peace and protesting apartheid.\n\nAnd finally, Stanley Kubrick, who is one of the greatest filmmakers in the history of the medium, with classics including 2001: A Space Odyssey, A Clockwork Orange, and The Shining.\n\nThe Science Fiction and Fantasy Hall of Fame was founded in 1996, and later relocated from the Gunn Center for the Study of Science Fiction at the University of Kansas to its permanent home at EMP in 2004. The final inductees are chosen by a panel of award-winning science fiction and fantasy authors, artists, editors, publishers, and film professionals. Check out EMP’s website for more information on the inductees!"}, {"url": "https://www.mopop.org/about-mopop/the-mopop-blog/posts/2022/january/mopop-announces-science-fiction-plus-fantasy-hall-of-fame-class-of-2021/", "page_content": "MoPOP's 'Science Fiction + Fantasy Hall of Fame' Class of 2021, from left to right, includes Georges Méliès’ 'A Trip to the Moon' (1902), Godzilla, Nichelle Nichols, and Sigourney Weaver.\n\nYour ballots have been tallied, and the Science Fiction + Fantasy Hall of Fame Class of 2021 has been decided!\n\nSelected by fan vote on social media from a list of 10 nominees, the Museum of Pop Culture's Science Fiction + Fantasy Hall of Fame Class of 2021 includes:\n\nNichelle Nichols\n\nSigourney Weaver\n\nGodzilla\n\nGeorges Méliès’ A Trip to the Moon (1902)\n\nThe four inductees join 120+ science fiction and fantasy creators and creations celebrated inside the MoPOP exhibition that invites visitors to explore the lives and legacies of those most influential to popular culture. Other Class of 2021 nominees included creators N.K. Jemisin, Margaret Cavendish, and Rick Baker, as well as creations Akira (1988), Naruto (1999), and Final Fantasy.\n\nLet's take a closer look at the Science Fiction + Fantasy Hall of Fame Class of 2021:\n\nNichelle Nichols\n\nBest known for her groundbreaking role on Star Trek as Lt. Uhura, Nichelle Nichols inspired generations of women and people of color to take their rightful place in the sciences, engineering, and astronautics.\n\nSigourney Weaver\n\nSigourney Weaver has played many landmark roles in science fiction and fantasy film, starting with Ripley in the Alien franchise, an important female protagonist at the time. But her credits also include Ghostbusters, Galaxy Quest, WALL-E, and the Avatar franchise.\n\nGodzilla\n\n“King of the Monsters.” Need we say more? Since this atomic-blast-awakened creature first waded ashore in 1954 to wreak terrible destruction, it has become a pop culture legend across more than 35 films as well as TV shows, comics, games, and novels.\n\nGeorges Méliès’ A Trip to the Moon (1902)\n\nConsidered the very first science fiction film, it was the culmination of years of film innovation by Georges Méliès. The movie, inspired by Jules Verne’s From the Earth to the Moon and Around the Moon, remains an icon to this day.\n\nThank you to our Science Fiction + Fantasy Hall of Fame exhibition sponsor, Pacific Office Automation.\n\nLearn more about MoPOP's 'Science Fiction + Fantasy Hall of Fame' and for contests, the latest news, and behind-the-scenes content, be sure to follow us on YouTube, Facebook, Instagram, and Twitter.\n\nIf you like what you see, support our work by making a donation or planning a visit to MoPOP today!"}]}