{"John Howe has also illustrated books for other authors, such as The King of Elfland's Daughter by Lord Dunsany, The Worm Ouroboros by E. R. Eddison, and The Mabinogion Tetralogy by Evangeline Walton.": [{"url": "https://www.goodreads.com/author/show/34748.John_Howe", "page_content": "John Howe\n\nBorn\n\nAugust 21, 1957\n\nWebsite\n\nGenre\n\nJohn Howe is a Canadian book illustrator, living in Neuchâtel, Switzerland. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\n\n\nHe is best known for his work based on J. R. R. Tolkien's worlds. Howe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy, and Howe also did the illustration for the Lord of the Rings board game created by Reiner Knizia. Howe also re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work is not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf (he also illustrated Knizi\n\nJohn Howe is a Canadian book illustrator, living in Neuchâtel, Switzerland. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\n\n\nHe is best known for his work based on J. R. R. Tolkien's worlds. Howe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy, and Howe also did the illustration for the Lord of the Rings board game created by Reiner Knizia. Howe also re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work is not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf (he also illustrated Knizia's board game Beowulf: The Legend). Howe illustrated many other books, amongst which many belong to the fantasy genre (Robin Hobb's books for instance.) He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis. In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, complete with numerous illustrations by Howe.\n\n\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.\n\n\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson both consulted with Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\n\n\nHowe is a member of the living history group the Company of Saynt George, and has considerable expertise in ancient and medieval armour and armaments.\n\n\n\nLibrarian note: There is more than one author in the Goodreads database with this name.\n\n\n\nJohn^^Howe"}, {"url": "https://www.arenaillustration.com/artists/john-howe/", "page_content": "John Howe\n\nJohn Howe is a Canadian illustrator, after obtaining an illustration degree in France, he settled in Switzerland. He has travelled extensively in imaginary worlds: Robin Hobb, Robert Holdstock, and especially J. R. R. Tolkien’s Middle Earth, spending the better part of a decade in New Zealand in the company of hobbits, elves and dwarves for Peter Jackson’s trilogies the Lord of the Rings and the Hobbit.\n\nJohn is especially fascinated by history, art and architecture. When he is not roaming through the pages of his extensive library of old volumes of folklore, myth and legend, he is out wandering in the mountains and forests where he lives. This rich tapestry of interwoven threads of history and imagination is an enduring source of inspiration.\n\nHe has an abiding fascination with dragons, and is the narrator of a four-part mini-series produced by Arte Television, which saw John and his film crew follow their tracks through Europe and China. “Dragons!” has been broadcast worldwide.\n\nBesides exploring Middle Earth, John has illustrated many children’s books, created how-to books on fantasy art, and has illustrated Beowulf, Arthurian legend and many other sagas. He teaches drawing one day a week at a local school and has given master classes as far away as Beijing."}, {"url": "https://www.theonering.net/torwp/2014/06/01/89718-meet-the-man-whose-illustrations-have-helped-define-middle%E2%80%91earth/", "page_content": "Check out this interview with interview that Ethan Gilsdorf conducted with John Howe over two sessions in January and July last year. It’s a corker.\n\nHowe is, of course, a long-time Tolkien illustrator and is currently working with Alan Lee as Conceptual Designer for The Hobbit movie trilogy.\n\nMeet the man who remade Middle‑earth\n\nby Ethan Gilsdorf\n\nYou may not know John Howe, but you have probably visited his worlds.\n\nHowe is among the best-known illustrators of J.R.R. Tolkien’s works. Since the 1990s, Howe has helped visualize Middle-earth by creating art for various bound editions of The Lord of the Rings, The Hobbit and other works. He also provided artwork for more obscure Tolkienania, such as calendars, posters, postcards, jacket art for the covers of audio editions and games and trading cards. Not only that, he’s the man behind the pen for a variety of other fantasy art projects: Beowulf board games, Anne McCaffery book jackets, Magic: The Gathering cards, children’s books, and folk tales such as Rip Van Winkle and Jack and the Beanstalk. Howe has also illustrated books on dragons, knights and “how to” instructional manuals for how to draw your own fantasy art.\n\nBut Howe’s stature as a fantasy artist catapulted to new heights when Peter Jackson tapped him and Alan Lee, another prominent Tolkien illustrator, to serve as conceptual designers for his Lord of the Rings trilogy. Jackson has said that even before he hired Howe, the illustrations that Howe drew of Gandalf (see banner image above), Bag End, the Balrog and the Nazgûl’s flying beasts helped guide his vision for Middle-earth.\n\nToday, given the millions who have seen Jackson’s films, Howe can be credited with irrevocably shaping how we see Tolkien’s world on the screen, and in our imaginations. Someone had to design every dwarf axe, evil tower, hobbit mug, and orc prosthetic, and Howe had his hand in nearly every decision about Middle-earth’s “look and feel.”\n\nPlus, thanks to the seemingly infinite production documentaries found in the Rings trilogy’s Extended Edition DVDs, Howe has become somewhat of a celebrity—at least among the ranks of those who care about the behind-the-scene scribblers, sword-forgers and model makers who work for the special effects house Weta Workshop and Jackson’s fantasy empire down in Wellington, New Zealand. (Howe actually works for 3 Foot 7 Ltd., the New Zealand production company created by Warner Bros.) With his colleagues, Howe has brought new levels of fastidiousness to movie production design.\n\n“John is highly productive,” said Alan Lee about his office mate and artistic collaborator, “producing brilliant drawings in the brief periods when his turbo-charged metabolism allows him to sit still.”\n\nThe tag-team of Howe and Lee moved back to Wellington when Jackson decided to adapt The Hobbit trilogy. The first installment, The Hobbit: An Unexpected Journey, came out Christmas of 2012; film two, The Desolation of Smaug, hit theaters a year after that. When the “Extended Edition” of An Unexpected Journey was released last year, fans got an extra taste of Howe’s magic touch. Expect the same sneak peeks into Howe’s process when the extra dance mix version of film two comes likely comes out in October or November. Of course, there’s also the final installment of the trilogy, now with the new title The Hobbit: The Battle of the Five Armies, which arrives just over half a year from now, in December.\n\n[Read More]"}, {"url": "https://www.upress.umn.edu/book-division/books/john-h-howe-architect", "page_content": "In 1932 nineteen-year-old John H. Howe arrived at Taliesin as a charter member of Frank Lloyd Wright’s Taliesin Fellowship. There he would remain for the next thirty-two years, earning a reputation as “the pencil in Wright’s hand” before establishing his own architectural practice in Minnesota.\n\nThis is the first book to tell Howe’s story and also the first full account of his place in the history of modern architecture—as chief draftsman and valued interpreter of Wright’s designs and as a prolific architect in his own right. Illustrated throughout with Howe’s sublime drawings, this biography is a testament to the underappreciated architect’s extraordinary design and rendering skills.\n\nInfluenced by Wright’s principles of organic architecture, Howe operated under the conviction that “the land is the beginning of architecture.” Architectural historians Jane King Hession and Tim Quigley show how this belief worked especially well for Howe in Minnesota, where his buildings appear to have grown naturally and organically from the landscape. Also remarkable are the visionary architectural schemes Howe created while serving time in prison during World War II as a conscientious objector—futuristic visions that anticipated Eero Saarinen’s later designs for airports and Victor Gruen’s plans for America’s first indoor shopping mall.\n\nAn enlightening look at an exemplary life in architecture, this book finally brings the accomplishment—and significance—of John Howe to the fore and at the same time illuminates a fascinating chapter in American architectural history.\n\n"}, {"url": "https://www.goodreads.com/author/list/34748.John_Howe", "page_content": "* Note: these are all the books on Goodreads for this author. To add more books, click here\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nWhole Works of the Rev. John Howe, M.A. with a Memoir of the Author. Vol. VIII\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nThe Knight With the Lion: The Story of Yvain\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nreally liked it\n\nreally liked it\n\nreally liked it 4.00 avg rating — 162 ratings\n\nError rating book. Refresh and try again.\n\nMyth and Magic: The Art of John Howe\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nA Clash of Kings (A Song of Ice and Fire, #2)\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nWelcome back. Just a moment while we sign you in to your Goodreads account."}, {"url": "https://www.howold.co/person/john-howe-illustrator/biography", "page_content": "John Howe Biography\n\nCanadian illustrator, best known for his artwork of J. R. R. Tolkien's Middle-earthFor other people with the same name, see John Howe.\n\nJohn Howe (born August 21, 1957) is a Canadian book illustrator and conceptual designer, best-known for his artwork of J. R. R. Tolkien's Middle-earth. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\nHowe and Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy. Howe illustrated the Lord of the Rings board game created by Reiner Knizia, and re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work includes images of mythological material such as the Old English epic poem Beowulf (including Knizia's board game Beowulf: The Legend). Howe illustrated many books in the fantasy genre, such as those by Robin Hobb. He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis, The Chronicles of Narnia. In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, with numerous illustrations by Howe.\n\nHowe has illustrated cards for the Magic: The Gathering collectible card game.\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson consulted with both Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\nHowe is a member of the living history group the Company of Saynt George, and has expertise in ancient and medieval armour and armaments.\n\nHowe also served as a conceptual designer for Amazon's The Lord of the Rings: The Rings of Power, which premiered on Prime Video on September 2, 2022.\n\nBiography\n\nJohn Howe was born in Vancouver, British Columbia. He was drawing from pre-school age, with his mother's help. Around primary school age he found his mother's ability no longer living up to his expectations, and even got frustrated once at both his mother and himself at not being able to draw a cow to his expectations. Howe's school years were complicated by moves which took place with a timing that left the art cl*es full, and left him in cl*es like power mechanics. He did find his ability as a draughtsman to be profitable in biology cl* though, where he and a friend would produce renderings of microscopic organisms for cl*mates at fifty cents each. As a child, he collected the covers of paperbacks. His collection included items from Frank Frazetta, Barry Smith, and Bernie Wrightson. In his adolescence, Howe read The Lord of the Rings trilogy by J. R. R. Tolkien. He said he got \"a real spark\" from the Hildebrandt calendars, which showed him that the books could be illustrated. Howe made drawings of his own versions of the scenes depicted in the calendar. These drawings, according to Howe, may not have survived.\n\nWith Alexis Metzinger during filming John Howe in Strasbourg\n\nA year after his high school graduation, Howe moved to Strasbourg, France to attend college. The following year, he enrolled into the École des arts décoratifs. He cites his experience of this period as follows:\n\nThe first year was spent not understanding much, the second at odds with what I did manage to understand, and the third eager to get out, although in retrospect I certainly owe whatever clarity of thought I possess to the patience of the professor of Illustration.\n\nThroughout his first years in Europe, Howe was taking in as much as he could in the way of art, architecture and everything that was \"simultaneously ancient and novel.\" He says the only piece of his art work that survived from this period is his \"The Lieutenant of the Black Tower of Barad-dûr\", a piece inspired by Tolkien's The Lord of the Rings. He says if this is not his first published piece, it must certainly be the earliest. Howe's earliest commissions included political cartoons, magazine illustrations, comics, animated films, advertising, of which he says were nightmares. He said that he would end up redoing sketches so many times that there was nothing left of \"his\" in them. This frustrated him, and he wondered how he would ever make it in the profession.\n\nProjects in which Howe worked include The Lord of the Rings, J.R.R. Tolkien's Books and Merchandise, Beowulf, Robin Hobb's books, The Lion, The Witch, and The Wardrobe, Cards for Magic: The Gathering, The Hobbit, Pan's Labyrinth. Howe has also written and illustrated children's books.\n\nSelected works\n\nThe Fisherman & His Wife , transl. from Brothers Grimm (Mankato, Minnesota: Creative Education, 1983). ISBN:0871919370 — picture book\n\n, transl. from Brothers Grimm (Mankato, Minnesota: Creative Education, 1983). ISBN:0871919370 — picture book The Enchanted World: Night Creatures (Time Life, 1985)\n\n(Time Life, 1985) The Enchanted World: Water Spirits (Time Life, 1985)\n\n(Time Life, 1985) The Enchanted World: Dwarfs (Time Life, 1985)\n\n(Time Life, 1985) The Enchanted World: Giants and Ogres (Time Life, 1985)\n\n(Time Life, 1985) Rip Van Winkle by Washington Irving, retold by John Howe (Little, Brown & Company, 1988) ISBN:0316375780\n\nby Washington Irving, retold by John Howe (Little, Brown & Company, 1988) ISBN:0316375780 Jack and the Beanstalk , retold by John Howe (Little, Brown & Company, 1989) ISBN:0316375799\n\n, retold by John Howe (Little, Brown & Company, 1989) ISBN:0316375799 Knights: A 3-Dimensional Exploration (Tango Books, 1995) ISBN:978-1-85707-071-2\n\n(Tango Books, 1995) ISBN:978-1-85707-071-2 The Knight With the Lion: The Story of Yvain (Little, Brown & Company, 1996) ISBN:978-0-316-37583-2\n\n(Little, Brown & Company, 1996) ISBN:978-0-316-37583-2 A Diversity of Dragon by Anne McCaffrey with Richard Woods (Atheneum Books, 1997) ISBN:978-0-689-31868-9\n\nby Anne McCaffrey with Richard Woods (Atheneum Books, 1997) ISBN:978-0-689-31868-9 Images of Middle-Earth (HarperCollins, 2000) ISBN:978-0-261-10310-8\n\n(HarperCollins, 2000) ISBN:978-0-261-10310-8 The Maps of Tolkien's Middle-earth by Brian Sibley (Houghton Mifflin Harcourt, 2003) ISBN:978-0-618-39110-3\n\nby Brian Sibley (Houghton Mifflin Harcourt, 2003) ISBN:978-0-618-39110-3 The King of Winter's Daughter (Little, Brown & Company, 2005) ISBN:978-0-316-88837-0\n\n(Little, Brown & Company, 2005) ISBN:978-0-316-88837-0 Fantasy Encyclopedia (Kingfisher, 2005)\n\n(Kingfisher, 2005) Wizardology: The Book of the Secrets of Merlin (Candlewick Press, 2005)\n\n(Candlewick Press, 2005) Myth and Magic: The Art of John Howe (Barnes & Noble, 2006) ISBN:978-0-7607-8686-4\n\n(Barnes & Noble, 2006) ISBN:978-0-7607-8686-4 Fantasy Art Workshop (Impact Books, 2007) ISBN:978-1-60061-009-7\n\n(Impact Books, 2007) ISBN:978-1-60061-009-7 Forging Dragons: Inspirations, Approaches and Techniques for Drawing and Painting Dragons (David & Charles, 2008) ISBN:978-1-60061-323-4\n\n(David & Charles, 2008) ISBN:978-1-60061-323-4 Fantasy Drawing Workshop (Impact Books, 2009) ISBN:978-1-60061-773-7\n\n(Impact Books, 2009) ISBN:978-1-60061-773-7 Lost Worlds (Kingfisher, 2009) ISBN:978-0-7534-6107-5\n\nSee also\n\nWorks inspired by J. R. R. Tolkien\n\nReferences\n\nExternal links\n\nOfficial website\n\nJohn Howe at the Internet Speculative Fiction Database\n\nJohn Howe at IMDb\n\nJohn Howe at Library of Congress, with 20 library catalog records\n\n:Visual arts\n\n:Speculative fiction\n\n:Film\n\nThe Atlas of Middle-earth\n\nJourneys of Frodo\n\nA Map of Middle-earth\n\nThe Complete Guide to Middle-earth\n\nA Companion to J. R. R. Tolkien\n\nMaster of Middle-Earth\n\nPicturing Tolkien\n\nJ. R. R. Tolkien: Author of the Century\n\nThe J. R. R. Tolkien Companion and Guide\n\nThe J. R. R. Tolkien Encyclopedia\n\nThe Lord of the Rings: A Reader's Companion\n\nPerilous Realms\n\nThe Road to Middle-Earth\n\nSplintered Light\n\nTolkien's Art: 'A Mythology for England'\n\nTolkien: A Look Behind \"The Lord of the Rings\"\n\nA Tolkien Comp*\n\nTolkien: Maker of Middle-earth\n\nTolkien's Legendarium\n\nTolkien and the Great War\n\nThe Worlds of J. R. R. Tolkien\n\nThe Ring of Words: Tolkien and the Oxford English Dictionary\n\nWikiquote has quotations related toPortals:Adaptations,legacyMapsLiterarycriticism"}, {"url": "https://books.google.com/books/about/The_Whole_Works_of_the_Rev_John_Howe_M_A.html?id=6kwxtQEACAAJ", "page_content": "This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most important libraries around the world), and other notations in the work.\n\nThis work is in the public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work.\n\nAs a reproduction of a historical artifact, this work may contain missing or blurred pages, poor pictures, errant marks, etc. Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant."}, {"url": "https://events.unifr.ch/gff2018/en/programme-and-registration/keynotes/john-howe.html", "page_content": "John Howe (born August 21, 1957) is a Canadian book illustrator, living in Neuchâtel, Switzerland. One year after graduating from high school, he studied in a college in Strasbourg, France, then at the École des arts décoratifs in the same town.\n\nHe is best known for his work based on J. R. R. Tolkien's worlds. Howe and noted Tolkien artist Alan Lee served as chief conceptual designers for Peter Jackson's The Lord of the Rings movie trilogy, and Howe also did the illustration for the Lord of the Rings board game created by Reiner Knizia. Howe also re-illustrated the maps of The Lord of the Rings, The Hobbit, and The Silmarillion in 1996–2003. His work is however not limited to this, and includes images of myths such as the Anglo Saxon legend of Beowulf (he also illustrated Knizia's board game Beowulf: The Legend). Howe illustrated many other books, amongst which many belong to the fantasy genre (Robin Hobb's books for instance.) He also contributed to the film adaptation of The Lion, the Witch, and the Wardrobe by C. S. Lewis. In 2005 a limited edition of George R. R. Martin's novel A Clash of Kings was released by Meisha Merlin, complete with numerous illustrations by Howe. Howe has illustrated cards for the Magic: The Gathering collectible card game.[1]\n\nFor The Hobbit films, original director Guillermo del Toro and replacement director Peter Jackson both consulted with Howe and fellow conceptual artist Alan Lee to ensure continuity of design.\n\nHowe is a member of the living history group the Company of Saynt George, and has considerable expertise in ancient and medieval armour and armaments."}]}