{"Arthur Sewall served in the Maine House of Representatives from 1871 to 1872 and in the Maine Senate from 1873 to 1874.": [{"url": "https://maineanencyclopedia.com/sewall-arthur/", "page_content": "(1896-1900) was born in Bath, son of one of the City’s first shipbuilders, in whose shipyards he worked learning the trade. In 1854, he and his brother Edward formed E. & A. Sewall continuing their father’s business. It became Arthur Sewall & Co. when his brother died.\n\nArthur Sewall’s firm built 80 ships over 50 years. During the Civil War his ship Vigilant was captured by the Sumter, a Confederate blockade raider. In 1892 his company built the largest wooden sailing ship in the United States, the Roanoke. In 1894 he launched the first American-built, steel-hulled, square-rigger, the Dirigo.\n\nSewall was president (1884-1893) of the Maine Central Railroad, president of the Eastern Railroad, the Boston and Maine Railroad and others. He was also president of the Bath National Bank from 1871 to 1900.\n\nHe was a leader of the Democratic Party in Maine, serving on the Democratic National Committee. In 1893, he was a candidate for the U.S. Senate, losing the election in the Republican-dominated state legislature. The national Democratic Party nominated him as their vice-presidential candidate, along with presidential candidate William Jennings Bryan, in 1896.\n\nArthur Sewall died at his summer home at Small Point in Phippsburg September 5, 1900.\n\nAdditional resources\n\n“Biographies: Arthur Sewall.” Harpweek. http://elections.harpweek.com/1896/bio-1896-Full.asp?UniqueID=4&Year=1896 (accessed April 17, 2015)\n\nBunting, William Henry. Live Yankees: the Sewalls and their Ships. Gardiner, Me. Tilbury House. Bath, Me. Maine Maritime Museum. 2009.\n\nYakowicz, Susie. Steel Glory: The Life of Shipbuilder Arthur Sewall, 1835-1900. Eagan, Minn. S. Yakowicz. c1996."}, {"url": "https://www.ancestoryarchives.com/2014/12/arthur-sewall-of-bath-maine.html", "page_content": "During the greater part of Mr. Cleveland's first administration Mr. Sewall was on terms of close intimacy with the President, and every appointment which he recommended was made. But the free silver views of Mr. Sewall had at that time caused him to be classed by many of his friends in the East as a man who had gone wild on money questions. As a result of Mr. Cleveland's opposition to silver, Mr. Sewall fought against his renomination. He worked unceasingly for Cleveland's defeat at Chicago, standing for David B. Hill to the end but then came into line and helped elect the nominee. He never ceased to be an active member of the party. He was the unanimous choice of his party in Maine for United States Senator in 1892, and the attempt to turn him down at the State Convention by a resolution denouncing his free silver views failed.\n\nMr. Sewell was a delegate to the National Democratic Convention at Baltimore in 1872; at Cincinnati in 1880 and 1884; at St. Louis in 1888; and at Chicago in 1892 and 1896. At Chicago in July, 1896, he was one of the few advocates from New England of the free and unlimited coinage of silver. He was selected by the convention as their candidate for the office of Vice-president of the United States, and in an interview at the time voiced his sentiments on the platform as follows:\n\n\"There are thousands of business men in the East who are turning away from the single gold standard. It is not a class issue. In my opinion there is not a legitimate business in this country but that would be benefited by the restoration of silver to its rightful place in our national currency.\n\n\"I have been an advocate of silver ever since Congress\n\ndemonetized that metal in 1873. I held at the time that a mistake had been made, and have had no reason since to change my mind. \"There are two sides to every question, and as an individual banker I have a perfect right to take a position opposite to those who constitute the majority in the banking business. As I said before, this is not a technical question nor a class issue.\" Upon his return to his home in Bath he received an ovation from his fellow citizens long to be remembered by the staid people of that maritime town. The mayor warmly welcomed the nominee, and Mr. Sewall in the course of his reply to the warm welcome, said: \"It was a great convention, yet it did not seem to me to be a partisan one. It seemed more like the uprising of the people, and they seemed to be controlled by one idea, and that idea has filled me for years. They knew that this country is in deep distress, that it has been in distress for years, and that the great trouble is with our monetary system; and they believe as I believe, that there is only one remedy. They entertain no dishonest or dishonorable idea, but they demand that we be carried back to the money of our fathers, to that monetary system under which this government flourished for so many years, and they believe that is the only road to prosperity.\" \"The keynote of the Chicago platform is found in the Declaration of Independence. It simply implies that wherever the Government comes in contact with the citizen, wherever the citizen touches the Government, that all stand upon a common level, and there shall be equal rights to all and special privileges to no one. \"—William J. Bryan.\n\nSan Francisco Call, Volume 80, Number 42, 12 July 1896 — ARTHUR SEWALL\n\nArticle from The Forecaster Newspaper 2006 Author launches book on Bath shipbuilding family\n\n\n\nThursday, April 16, 2009\n\nBATH — While the Sewall family has been in the news recently after its fuel and convenience store company filed for bankruptcy, a new book looks at the family from a different perspective, telling the warts-and-all tale of its heyday as a builder and manager of a vast fleet of merchant ships."}, {"url": "https://www.geni.com/people/Arthur-Sewall/6000000004565891749", "page_content": "About Arthur Sewall\n\nhttps://www.wikitree.com/wiki/Sewall-171\n\nhttps://www.findagrave.com/memorial/7232538\n\nWilliam J. Bryan's running mate of the Presidency in 1896.\n\nPolitician. Served as a Member of the Democratic National Committee from Maine from 1888-1896, and Democratic Candidate for Vice President of the United States in 1896.\n\nUpon his brother's death the company became Arthur Sewall & Co (shipbuilders) built largest wooden ship Roanoke in 1894 launched the Dirigo first steel sailing ship built in America. President of the Eastern railway,Director of the Boston &Maine,New York & New England,and Mexican Centrail railroads.\n\nhttp://en.wikipedia.org/wiki/Arthur_Sewall\n\nArthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. As the Populist Party nominee, Bryan had another running mate as well, Thomas E. Watson. Sewall never held elective office, although he was a member of the Democratic National Committee from 1888 to 1896.\n\nArthur Sewall's main claim to fame had been as an exceptionally successful, wealthy shipbuilder and New England industrialist. He was a director of the Maine Central railroad and President of the Bath National Bank for years. His selection is believed to have been an effort to win votes among conservative and New England members of the party who were disturbed by the populist aspects of William Jennings Bryan. Arthur Sewall is also one of the few politicians to be an adherent of Swedenborgianism, a religion based on the writings of Swedish theologian Emanuel Swedenborg.\n\nHis main vice-presidential opponent, Garret A. Hobart (Rep), was also an Eastern banker and industrialist who had served on his party's national committee.\n\nSewall was Bryan's running mate for the first of Bryan's three times as the Democratic presidential nominee. He died not long after Bryan was nominated for the second time in 1900.\n\nSewall's grandson, Sumner Sewall, served as Governor of Maine from 1941 to 1945, as a Republican.\n\nLegacy\n\nIn 2008, the St. Louis Post-Dispatch referenced Sewall in an article criticizing Senator John McCain's selection of Gov. Sarah Palin as his vice presidential candidate in the 2008 presidential election, saying he had picked \"the least qualified running mate since the Swedenborgian shipbuilder Arthur Sewall ran as William Jennings Bryan's No. 2 in 1896.\""}, {"url": "https://www.findagrave.com/memorial/7232538/arthur-sewall", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.mainememory.net/artifact/99338", "page_content": "Contributed by Maine Historical Society\n\nDescription\n\nArthur Sewall, the youngest of Kiah B. and Lucretia Day Sewall's 10 children, was born in Mobile, Alabama in November 1860. His parents were both from Maine. His father was a lawyer in Mobile when Arthur was born.\n\n\n\nHe married Cynthia Pope Yeatman in 1893 in Philadelphia. In 1920, he was working as an asphalt contractor.\n\n\n\nHe and his wife both died in 1939 and are buried in New Hampshire.\n\n\n\nThe photo is dated July 1895 and was taken by a Chicago photographer.\n\nView/Add Comments\n\nAbout This Item\n\nTitle: Arthur W. Sewall, Chicago, 1895\n\nArthur W. Sewall, Chicago, 1895 Creator: Cosy, Chicago\n\nCosy, Chicago Creation Date: 1895\n\n1895 Subject Date: 1895\n\n1895 Location: Chicago, IL\n\nChicago, IL Media: Photographic print\n\nPhotographic print Dimensions: 15 cm x 10 cm\n\n15 cm x 10 cm Local Code: Coll. 105, Box 4/1\n\nColl. 105, Box 4/1 Collection: Sewall family papers\n\nSewall family papers Object Type: Image\n\nCross Reference Searches\n\nStandardized Subject Headings\n\nPeople\n\nFor more information about this item, contact:\n\nMaine Historical Society\n\n485 Congress Street, Portland, ME 04101\n\n(207) 774-1822 x230\n\nWebsite\n\nMore Info Use of this Item is not restricted by copyright and/or related rights, but the holding organization is contractually obligated to limit use. For more information, please contact the contributing organization. However, watermarked Maine Memory Network images may be used for educational purposes. How to cite content on this site\n\nPlease post your comment below to share with others. If you'd like to privately share a comment or correction with MMN staff, please send us a message with this link.\n\nPlease enable JavaScript to view the comments powered by Disqus."}, {"url": "https://maineanencyclopedia.com/sewall-sumner/", "page_content": "Sumner Sewall was born in Bath on June 17, 1897, the son of a wealthy Bath banker and shipbuilder, and grandson of Arthur Sewall, was educated at Bath public schools before attending Harvard University in 1916.\n\nIn the middle of his freshman year, he joined the American Ambulance Field Service and served for six months at the front on World War I as an ambulance driver before enlisting in the aviation section of the Army Signal Corps in 1917.\n\nA Second Lieutenant in the 95th Squadron of the 1st Pursuit Group, Sewall had become an ace by October 1918, having officially shot down seven German planes and two observation balloons.\n\nFor his service in the war, he won the Distinguished Service Cross with Oak Leaf Cluster, the French Legion of Honor, the Croix de Guerre and the Order of the Crown of Belgium.\n\nAfter the war he attended Yale University for a year and then worked with a rigging crew in the Mexican oil fields, in a bank in Spain, on a sugar plantation in Cuba and as a riveter in the Ford Airplane Factory in Dearborn, Michigan.\n\nThe man who would manage Maine’s war effort from 1941-1945 was well-prepared for the task in managerial background as well as military experience. From 1922 to 1924 he engaged in banking in New York City and in 1926 he helped organize and operate Colonial Air Transport, which held the first air mail contract in the country. In 1934 he became a director of United Air Lines.\n\nSewall’s political career began in 1933 as an Alderman in Bath. He was a State Representative from 1934 to 1936, a State Senator from 1936 to 1940, serving as President for the 1939-40 term and Governor of Maine from 1941 to 1945.\n\nGovernor Sewall left office on January 3, 1945 and soon became President of American Overseas Airlines. In 1946 he went to Germany as the Military Governor of Wurtemberg Baden.\n\nSewall died in Bath, Maine on January 25, 1965.\n\nAdditional resources\n\nFriends of the Blaine House at http://blainehouse.org/governors(accessed April 25, 2011) (accessed April 25, 2011)\n\nMaine. Governor, 1941-1944 (Sumner Sewall)\n\nAddress by Sumner Sewall, governor of Maine, to the ninety-first legislature of the state of Maine in special session, April 17, 1944. 1944 [Bangor Public Library; Maine State Library]\n\nMaine. Governor (1941-1945: Sewall) War Message of Gov. Sumner Sewall to Special Session of Maine Legislature: Monday, January Twelve, 1942. Augusta, Me. Office of the Governor. 1942. [University of Maine, Raymond H. Fogler Library, Special Collections; Maine State Library]\n\nState of Maine World War II Materials. Augusta, Me. State of Maine. 1943-1944. (Cataloger Note: This is a collection of executive orders, and address by Governor Sumner Sewall, a legislative document, and a report to the Maine state legislature, all pertaining to Maine’s war preparations during World War II. ) [University of Maine at Fort Kent. Blake Library]"}, {"url": "https://www.howold.co/person/harold-m-sewall/biography", "page_content": "Harold M. Sewall Biography\n\nAmerican politician and diplomat\n\nHarold Marsh Sewall (January 3, 1860 – October 28, 1924) was an American politician and diplomat.\n\nSewall was born in Bath, Sagadahoc County, Maine. He was the son of Arthur Sewall. Sewall served in the Maine House of Representatives, 1896, and from 1903 to 1907; he was a delegate to Republican National Convention from Maine, 1896. He was the last United States Minister to Hawaii, arriving in 1897 to the Republic of Hawaii after the death of Albert Sydney Willis, and returning in 1898 after annexation formed the Territory of Hawaii.He was a member of the Maine State Senate, from 1907 to 1909 and was a candidate for the United States representative from Maine 2nd district, 1914; member of Republican National Committee from Maine, 1924. He died in a hospital at New York City. His interment was at Oak Grove Cemetery, Bath, Maine.\n\nReferences\n\nExternal links\n\nWorks by or about Harold M. Sewall at Internet Archive\n\n\n\n"}, {"url": "https://www.med.uscourts.gov/court-history", "page_content": "UNITED STATES DISTRICT COURT\n\nDISTRICT OF MAINE\n\nThe District of Maine was one of the original thirteen district courts established by the Judiciary Act of 1789. A district court was created in each of the eleven states that had ratified the Constitution by September, 1789, as well as in Maine (then part of Massachusetts) and Kentucky (then still part of Virginia). Although the Court sat primarily in Portland, sessions were also held in Pownalborough and Wiscasset during the first half of the nineteenth century. In 1843, a term of court was first authorized to be held in Bangor. There was only one judge in the District of Maine until an additional judgeship was authorized in 1978. A third judgeship was authorized in 1990.\n\n---------------------\n\nDavid Sewall was the first District Court Judge for Maine, appointed by President George Washington on September 26, 1789. A graduate of Harvard College and an experienced judge, Judge Sewall, who was born in York, Maine, previously served as an associate justice on the Supreme Court of Massachusetts. He resigned from the District Court on January 9, 1818. Albion Keith Parris, from Hebron, Maine, was appointed the second District Judge in Maine on Januray 28, 1818. He was only 30 years old and was serving as a member of Congress. After only three years, he resigned from the Court and served six terms as Governor of the State of Maine. He later served as Comptroller of the Treasury through the administrations of Presidents Van Buren, Harrison, Tyler and Polk. He was a graduate of Dartmouth College, class of 1806. Ashur Ware was appointed to the U.S. District Court by President Monroe on February 15,1822 and served with distinction, particularly in the field of admiralty law, for 44 years, until 1866. Born in Sherborn, Massachusetts, and a graduate of Harvard College, Judge Ware practiced law in Portland and was among the most active “Maine Separatists” during the second decade of the 1800’s. The fourth District Judge, Edward Fox, a native of Portland, served from May 31, 1866 until his death in 1881. He was a graduate of Harvard College and Harvard Law School. A pre-eminent trial lawyer with an extensive practice, Judge Fox had served as City Solicitor for Portland and as a state legislator prior to his appointment to the Court. Nathan Webb, a lifelong resident of Portland, served in the Maine State Legislature, as the Cumberland County Attorney, and as the United States Attorney prior to his appointment on January 24, 1882 to the federal bench by President Arthur. Judge Webb served for more than twenty years, resigning in 1902. He was a member of the class of 1846 at Harvard College. Clarence Hale was born in Turner in 1848, was educated at Bowdoin College, and came to Portland in 1871 to begin his legal career. He served as the City Solicitor for Portland for three years and in the Maine House of Representatives prior to his appointment as District Judge by President Theodore Roosevelt on May 19, 1902. He served for 20 years. President Harding appointed John Andrew Peters, a lifelong resident of Ellsworth, to the District Court on November 14, 1922. A graduate of Bowdoin College, he studied law at the office of his cousin, Andrew Wiswell, who would later become chief justice of the Maine Supreme Judicial Court. A former Speaker of the Maine House of Representatives, Judge Peters served five terms in Congress prior to his appointment to the Court. He retired in 1947 after 25 years of service. John D. Clifford, Jr. was appointed to the District Court by President Truman on March 24, 1947 and served until his death in 1956. Born in Lewiston and educated at Bowdoin College and Georgetown Law School, he practiced law in Lewiston for twenty years prior to serving as the United States Attorney for Maine from 1933 to 1947. The ninth District Court Judge was Edward Thaxter Gignoux, who was appointed by President Eisenhower on August 26, 1957 and who served in active status until 1982 and in senior status until his death in 1988. Born in Cape Elizabeth, he graduated from Harvard College and Harvard Law School. Judge Gignoux had a national reputation and a celebrated career. The federal courthouse in Portland bears his name.\n\nEdward T. Gignoux Dedication\n\nIn 1979, Congress authorized a second judgeship for the District of Maine, which was filled by George J. Mitchell, on October 5, 1979. A Waterville native, graduate of Bowdoin College and Georgetown Law School, and United States Attorney from 1977 to 1979. Judge Mitchell served for only six months and resigned in 1980 to accept an appointment to the United States Senate to fill the unexpired term of Senator Edmund Muskie, who had become Secretary of State. Conrad K. Cyr served with distinction as the United States Bankruptcy Judge in Bangor from 1973 to 1981. In 1981, President Reagan appointed Judge Cyr to the District Court to succeed Judge Mitchell. In 1989, Judge Cyr was appointed to the United States Court of Appeals for the First Circuit. Born in Limestone, Judge Cyr was a graduate of Holy Cross College and Yale Law School. President Reagan appointed Gene Carter as the District of Maine’s twelfth judge on June 23, 1983 when Judge Gignoux assumed senior status. Born in Milbridge, Judge Carter was educated at the University of Maine and the New York University School of Law. Prior to his appointment, Judge Carter had a law practice in Bangor and also served as an Associate Justice of the Maine Supreme Judicial Court. Born in Canada, D. Brock Hornby is a graduate of the University of Western Ontario and the Harvard Law School. A naturalized American citizen, Judge Hornby was appointed District Judge by President George H. W. Bush on April 30, 1990. Prior to his appointment, he practiced law in Portland and had served as the District of Maine’s first full-time United States Magistrate and as an Associate Justice of the Maine Supreme Judicial Court. When a third judgeship was authorized, Morton A. Brody, who like his two immediate predecessors had previously served as an Associate Justice of the Maine Supreme Judicial Court, was appointed District Judge by President George H.W. Bush on July 25, 1991. He also previously served as a Justice of the Maine Superior Court. Born in Lewiston, Judge Brody was a graduate of Bates College and the University of Chicago Law School. Judge Brody died in 2000. George Z. Singal was appointed to the United States District Court by President Clinton on July 11, 2000 to fill the vacancy created by the death of Judge Brody. Born in an Italian refugee camp in 1945, Judge Singal is a naturalized American citizen. His family emigrated to Bangor in 1949, where he lived and practiced law until his appointment to the Court. He is a graduate of the University of Maine and the Harvard Law School. Bangor native John A. Woodcock, Jr. a graduate of Bowdoin College, the University of Maine School of Law and the London School of Economics was appointed District Judge by President George W. Bush on June 16, 2003 after Judge Carter assumed senior status. A longtime civil litigator, Judge Woodcock practiced law in Bangor prior to his appointment to the bench. President Barack Obama appointed Nancy Torresen as Maine’s seventeenth United States District Court Judge on October 4, 2011. Born in Ridgewood, New Jersey and raised in Michigan, Judge Torresen graduated from Hope College and the University of Michigan Law School. Prior to her appointment, Judge Torresen served as an Assistant United States Attorney, an Assistant Attorney General for Maine and a private practitioner. Judge Jon David Levy is the Court’s eighteenth federal district judge in the District of Maine. Before joining the federal bench, Judge Levy was an Associate Justice of the Maine Supreme Judicial Court from 2002 to 2014. He served as a Maine District Court Judge from 1995 to 2002. Prior to joining the state bench, Judge Levy worked in private practice in York, Maine from 1983 to 1995. He is a graduate of Syracuse University and the West Virginia University College of Law. Judge Lance E. Walker is the Court’s nineteenth federal district judge in the District of Maine. With deep roots in Maine, Judge Walker attended the University of Maine as an undergrad and then went on to the University of Maine School of Law. Judge Walker served as a law clerk to the Maine Superior Court and worked in the Portland law firm of Norman Hanson DeTroy. Judge Walker was appointed to the Maine District Court in 2014, and in 2015 he became a Justice on the Maine Superior Court.\n\nOne Hundred Years ~ Edward T. Gignoux U.S. Courthouse ~ 1911- 2011\n\nConstruction of the United States Courthouse, now known as the Edward T. Gignoux U.S. Courthouse (dedicated in 1988), began in November, 1908. The building was completed in February, 1911, and dedicated on July 20, 1911.\n\nThe Thursday, July 20, 1911, edition of the Portland Evening Express reported:\n\n“ Distinguished Attendance at Dedication of New Building, Impressive Exercises at Fine Federal Courts Building This Afternoon . Judge William I. Putnam of the U.S. Circuit Court, Judge Clarence Hale of the U.S. District Court, the Right Rev. Robert Codman, Bishop of the Diocese of Maine of the Protestant Episcopal Church, entered the court room. Judges Putnam and Hale occupied their positions on the bench. The dedicatory exercises were presided over by Judge Putnam and were opened with prayer by Bishop Codman. Judge Putnam, without preamble, introduced U.S. District Attorney Robert Treat Whitehouse, who delivered the opening address.”\n\nJames Knox Taylor (1857-1929), the Supervising Architect of the United States Treasury from 1897 to 1912, designed the building in the Second Renaissance Revival style. F.W. Cunningham & Sons, Portland contractors, constructed the courthouse, as well as other notable Portland landmarks, such as the Cumberland County Courthouse, Portland High School, Nathan Clifford School, additions to Union Station, Evergreen Cemetery, and the Chapel at St. Luke’s Church, to name a few. The U.S. Courthouse is one of several government buildings which form a distinguished group near Lincoln Park in the center of the city, which includes the U.S. Custom House (1872), Cumberland County Courthouse (1910), and Portland City Hall (1912). The U.S. Courthouse was listed in the National Register of Historic Places in 1974.\n\n\n\nWhen constructed in 1911, the Courthouse occupied the southwestern half of the lot bounded on the northwest by Federal Street, on the northeast by Pearl Street, on the southeast by Newbury Street, and on the southwest by Market Street. The main entrance was at the western corner, facing the junction of Market and Federal Streets. The building was a “u” shape, open toward Pearl Street.\n\nThe cornerstone for an addition was laid in September, 1931. The addition was a “u” shaped wing added to the existing building on the northeastern end. The United States Courthouse became a trapezoid, enclosing a courtyard, which filled the entire block. Construction was completed by November, 1932.\n\nIn 1932, the original section of the Courthouse was used by the United States Courts, including the U.S. Courtroom, the Grand Jury Room, the U.S. Bankruptcy Courtroom, offices for the officials connected with the courts and a GSA office. The addition housed the Pearl Street Station branch of the U.S. Postal Service and the offices of various federal agencies. The Pearl Street Station branch was removed in 1976.\n\nThe Courthouse is two stories high with a hip roof which encloses a third story. The roof slopes back to reveal dormer windows with arched pediments. Windows on the first two stories are elaborately treated with balustrade segments below them. They are surmounted by raised triangular or arched pediments. At the roof line a continuous frieze and dentil cornice and balustrade of open balusters and solid panels runs around the entire building. The exterior of the original building is granite which came from North Jay, Maine; and the granite for the addition came from Vermont. Many of the original finishes in the interior of the Courthouse are intact: marble and terrazzo flooring, molded wood trim, marble trim, molded plaster cornices. Of special interest is the building’s formal entrance. The entrance leads into the elliptical rotunda, an elegant and open two-story foyer with refined classical detailing. The rotunda features a curving marble staircase with a balustrade of thin cast-iron balusters, rising to the second floor along the perimeter of the room.\n\nIn 1992, a major renovation project began to modernize and renovate the historic fabric of the building. Designs were prepared by Leers, Weinzapfel of Boston. The improvements included two full-sized district courtrooms and a magistrate judge’s hearing room. A wholly new courtroom was constructed inside the old building. A wall painting, The Virtues of Good Government, is a frieze located just below the courtroom’s skylight. The mural by Dorothea Rockburne is “a modern contemplation on the virtues of prudence, faith, common good, hope and magnanimity, using pure geometry and vibrant color as meditative devices.” The original Courtroom One was carefully restored to its original design including arched casement windows, period light fixtures, its original color palette, and replicated plaster moldings for the ceiling. Copies of the original chandeliers and wall sconces were crafted and installed in the original locations.\n\nThe Reopening Ceremony was held June 26, 1996. As a result of the project, the Edward T. Gignoux U.S. Courthouse was awarded an Institutional Preservation Award from Greater Portland Landmarks in 1999.\n\nIn 2012, in its 100th year, the Edward T. Gignoux U.S. Courthouse underwent an extensive exterior building envelope improvement to restore the roof and granite façade, as well as some associated interior repairs. This work was completed in the summer of 2013"}, {"url": "https://snaccooperative.org/view/70090964", "page_content": "Joseph Sewall (1795-1851) was the son of Joseph Sewall (1770-1852) and Lydia Marsh Sewall (1773-1805) of Bath, Me. The younger Sewall graduated from Bowdoin College in 1812 and practiced law in Bath. He served as Collector of Customs for the port of Bath, was active in civic affairs of his hometown, and was appointed adjutant general for the state of Maine, 1833-1834. He was the uncle of Arthur Sewall (1835-1900), the famous shipbuilder, and of Frank Sewall (1837-1915), the Swedenborgian clergyman. He was also a distant relative of Joseph Sewall (1688-1769), William Bartlett Sewall (1782-1869), and Edmund Quincy Sewall (1828-1908).\n\nFrom the description of Papers, 1762-1907. (American Antiquarian Society). WorldCat record id: 191276162\n\nAdjutant general of Maine and collector of customs for the District of Bath.\n\nFrom the description of Papers of Joseph Sewall, 1832-1907 (bulk 1832-1842). (Unknown). WorldCat record id: 79448842\n\nBiographical Note\n\nJoseph Sewall was born in 1795, in Bath, Maine, graduated from Bowdoin College in 1812, and practiced law in Bath, where he was collector of customs, 1842-1842, and adjutant general for the state of Maine, 1833-1834. Sewall died in 1851. His birth and death dates were obtained from the Library of Congress catalog that cites a lecture read by Sewall before the Lyceum (1833), entitled “the History of Bath,” Collections of the Maine Historical Society, vol. 2, 1847, pp. 189-228. Genealogical information was obtained from Louis Clinton Hatch, Maine: A History (New York, American Historical Society, 1919). vol. 4, pp. 383-385.\n\nFrom the guide to the Joseph Sewall Papers, 1832-1907, (bulk 1832-1842), (Manuscript Division Library of Congress)"}, {"url": "https://legislature.maine.gov/housedems/bella/index.html", "page_content": "Representing - Yarmouth\n\nDistrict #103\n\nRep. Art Bell is serving his second term in the Maine House of Representatives, where he sits on the Environment and Natural Resources Committee. He believes we must balance the issues of a changing climate, affordable housing, economic development and an aging population. Prior to serving in the Legislature, he worked for 30 years in corporate finance. At the local level, Rep. Bell has served on Yarmouth's Comprehensive Plan Implementation Committee, where he listened to residents and helped reconsider the way the community interacts with local businesses, cultivating a safe and thoughtful village. Rep. Bell has also served on the Yarmouth History Society Board and the Bike and Pedestrian Committee. He is a founding member of the Royal River Alliance, working to restore the Royal River watershed. Rep. Bell was also previously elected to two, three-year terms on the school board, six years on the Yarmouth Senior Housing Board and was the longtime treasurer of Yarmouth Cares About Neighbors (YCAN). Rep. Bell has lived on Cousins Island for the past 26 years. He is a graduate of Colby College and earned an MBA from the Wharton School at the University of Pennsylvania. He and his wife, Robin Hodgskin, raised three kids who proudly graduated from Yarmouth High School. To view a high resolution photo of Rep. Bell click here .\n\nMy Latest News\n\nView all news from Rep. Bell or Search all news items from the House Democratic Office\n\nCommittee Rep. Bell is a member of the Joint Standing Committee on Environment and Natural Resources. Brief description of the subject matter handled by the committee : Air and water quality; natural resource protection; site location of development laws, shoreland zoning, subdivisions and growth management; management and disposal of solid, hazardous, biomedical and special wastes; hydropower and dams; waste-to-energy facilities; mining; general environmental policy, including oversight of the Department of Environmental Protection; and returnable containers. For more information about the schedule of committee hearings or to sign up for advance notice of public hearings click here .\n\nLegislation Click on the button below to see all bills, joint resolutions and orders I sponsored or cosponsored this session, as well as legislative sentiments that honor and recognize people from our district and throughout the state.\n\nTo do a general bill search, click here .\n\nContact Me Thank you for taking time to contact me. You may use the online contact form to reach me. You can also contact me at my home: 14 Altantic Reach\n\nYarmouth, ME 04096\n\narthur.bell@legislature.maine.gov When the Legislature is in session, you can leave a message for me by calling the State House Message Phone: (800) 423-2900 or the State House TDD Line: Relay 711."}]}