{"Arthur Sewall was born in Bath, Maine.": [{"url": "https://maineanencyclopedia.com/sewall-arthur/", "page_content": "(1896-1900) was born in Bath, son of one of the City’s first shipbuilders, in whose shipyards he worked learning the trade. In 1854, he and his brother Edward formed E. & A. Sewall continuing their father’s business. It became Arthur Sewall & Co. when his brother died.\n\nArthur Sewall’s firm built 80 ships over 50 years. During the Civil War his ship Vigilant was captured by the Sumter, a Confederate blockade raider. In 1892 his company built the largest wooden sailing ship in the United States, the Roanoke. In 1894 he launched the first American-built, steel-hulled, square-rigger, the Dirigo.\n\nSewall was president (1884-1893) of the Maine Central Railroad, president of the Eastern Railroad, the Boston and Maine Railroad and others. He was also president of the Bath National Bank from 1871 to 1900.\n\nHe was a leader of the Democratic Party in Maine, serving on the Democratic National Committee. In 1893, he was a candidate for the U.S. Senate, losing the election in the Republican-dominated state legislature. The national Democratic Party nominated him as their vice-presidential candidate, along with presidential candidate William Jennings Bryan, in 1896.\n\nArthur Sewall died at his summer home at Small Point in Phippsburg September 5, 1900.\n\nAdditional resources\n\n“Biographies: Arthur Sewall.” Harpweek. http://elections.harpweek.com/1896/bio-1896-Full.asp?UniqueID=4&Year=1896 (accessed April 17, 2015)\n\nBunting, William Henry. Live Yankees: the Sewalls and their Ships. Gardiner, Me. Tilbury House. Bath, Me. Maine Maritime Museum. 2009.\n\nYakowicz, Susie. Steel Glory: The Life of Shipbuilder Arthur Sewall, 1835-1900. Eagan, Minn. S. Yakowicz. c1996."}, {"url": "https://maineanencyclopedia.com/sewall-sumner/", "page_content": "Sumner Sewall was born in Bath on June 17, 1897, the son of a wealthy Bath banker and shipbuilder, and grandson of Arthur Sewall, was educated at Bath public schools before attending Harvard University in 1916.\n\nIn the middle of his freshman year, he joined the American Ambulance Field Service and served for six months at the front on World War I as an ambulance driver before enlisting in the aviation section of the Army Signal Corps in 1917.\n\nA Second Lieutenant in the 95th Squadron of the 1st Pursuit Group, Sewall had become an ace by October 1918, having officially shot down seven German planes and two observation balloons.\n\nFor his service in the war, he won the Distinguished Service Cross with Oak Leaf Cluster, the French Legion of Honor, the Croix de Guerre and the Order of the Crown of Belgium.\n\nAfter the war he attended Yale University for a year and then worked with a rigging crew in the Mexican oil fields, in a bank in Spain, on a sugar plantation in Cuba and as a riveter in the Ford Airplane Factory in Dearborn, Michigan.\n\nThe man who would manage Maine’s war effort from 1941-1945 was well-prepared for the task in managerial background as well as military experience. From 1922 to 1924 he engaged in banking in New York City and in 1926 he helped organize and operate Colonial Air Transport, which held the first air mail contract in the country. In 1934 he became a director of United Air Lines.\n\nSewall’s political career began in 1933 as an Alderman in Bath. He was a State Representative from 1934 to 1936, a State Senator from 1936 to 1940, serving as President for the 1939-40 term and Governor of Maine from 1941 to 1945.\n\nGovernor Sewall left office on January 3, 1945 and soon became President of American Overseas Airlines. In 1946 he went to Germany as the Military Governor of Wurtemberg Baden.\n\nSewall died in Bath, Maine on January 25, 1965.\n\nAdditional resources\n\nFriends of the Blaine House at http://blainehouse.org/governors(accessed April 25, 2011) (accessed April 25, 2011)\n\nMaine. Governor, 1941-1944 (Sumner Sewall)\n\nAddress by Sumner Sewall, governor of Maine, to the ninety-first legislature of the state of Maine in special session, April 17, 1944. 1944 [Bangor Public Library; Maine State Library]\n\nMaine. Governor (1941-1945: Sewall) War Message of Gov. Sumner Sewall to Special Session of Maine Legislature: Monday, January Twelve, 1942. Augusta, Me. Office of the Governor. 1942. [University of Maine, Raymond H. Fogler Library, Special Collections; Maine State Library]\n\nState of Maine World War II Materials. Augusta, Me. State of Maine. 1943-1944. (Cataloger Note: This is a collection of executive orders, and address by Governor Sumner Sewall, a legislative document, and a report to the Maine state legislature, all pertaining to Maine’s war preparations during World War II. ) [University of Maine at Fort Kent. Blake Library]"}, {"url": "https://www.ancestoryarchives.com/2014/12/arthur-sewall-of-bath-maine.html", "page_content": "During the greater part of Mr. Cleveland's first administration Mr. Sewall was on terms of close intimacy with the President, and every appointment which he recommended was made. But the free silver views of Mr. Sewall had at that time caused him to be classed by many of his friends in the East as a man who had gone wild on money questions. As a result of Mr. Cleveland's opposition to silver, Mr. Sewall fought against his renomination. He worked unceasingly for Cleveland's defeat at Chicago, standing for David B. Hill to the end but then came into line and helped elect the nominee. He never ceased to be an active member of the party. He was the unanimous choice of his party in Maine for United States Senator in 1892, and the attempt to turn him down at the State Convention by a resolution denouncing his free silver views failed.\n\nMr. Sewell was a delegate to the National Democratic Convention at Baltimore in 1872; at Cincinnati in 1880 and 1884; at St. Louis in 1888; and at Chicago in 1892 and 1896. At Chicago in July, 1896, he was one of the few advocates from New England of the free and unlimited coinage of silver. He was selected by the convention as their candidate for the office of Vice-president of the United States, and in an interview at the time voiced his sentiments on the platform as follows:\n\n\"There are thousands of business men in the East who are turning away from the single gold standard. It is not a class issue. In my opinion there is not a legitimate business in this country but that would be benefited by the restoration of silver to its rightful place in our national currency.\n\n\"I have been an advocate of silver ever since Congress\n\ndemonetized that metal in 1873. I held at the time that a mistake had been made, and have had no reason since to change my mind. \"There are two sides to every question, and as an individual banker I have a perfect right to take a position opposite to those who constitute the majority in the banking business. As I said before, this is not a technical question nor a class issue.\" Upon his return to his home in Bath he received an ovation from his fellow citizens long to be remembered by the staid people of that maritime town. The mayor warmly welcomed the nominee, and Mr. Sewall in the course of his reply to the warm welcome, said: \"It was a great convention, yet it did not seem to me to be a partisan one. It seemed more like the uprising of the people, and they seemed to be controlled by one idea, and that idea has filled me for years. They knew that this country is in deep distress, that it has been in distress for years, and that the great trouble is with our monetary system; and they believe as I believe, that there is only one remedy. They entertain no dishonest or dishonorable idea, but they demand that we be carried back to the money of our fathers, to that monetary system under which this government flourished for so many years, and they believe that is the only road to prosperity.\" \"The keynote of the Chicago platform is found in the Declaration of Independence. It simply implies that wherever the Government comes in contact with the citizen, wherever the citizen touches the Government, that all stand upon a common level, and there shall be equal rights to all and special privileges to no one. \"—William J. Bryan.\n\nSan Francisco Call, Volume 80, Number 42, 12 July 1896 — ARTHUR SEWALL\n\nArticle from The Forecaster Newspaper 2006 Author launches book on Bath shipbuilding family\n\n\n\nThursday, April 16, 2009\n\nBATH — While the Sewall family has been in the news recently after its fuel and convenience store company filed for bankruptcy, a new book looks at the family from a different perspective, telling the warts-and-all tale of its heyday as a builder and manager of a vast fleet of merchant ships."}, {"url": "https://www.nndb.com/people/274/000206653/", "page_content": "Arthur Sewall\n\nBorn: 25-Nov-1835\n\nBirthplace: Bath, ME\n\nDied: 5-Sep-1900\n\nLocation of death: Small Point, ME\n\nCause of death: Stroke\n\nRemains: Buried, Oak Grove Cemetery, Bath, ME\n\n\n\nGender: Male\n\nRace or Ethnicity: White\n\nSexual orientation: Straight\n\nOccupation: Business, Politician\n\nParty Affiliation: Democratic\n\nNationality: United States\n\nExecutive summary: Shipbuilder, 1896 Democratic VP Nominee\n\nFather: William Dunning Sewall (shipbuilder)\n\nMother: Rachel Trufant\n\nBrother: Edward Sewall (d. 1879)\n\nWife: Emma Duncan Crooker (m. 20-Mar-1859, three sons)\n\nSon: Harold Marsh Sewall\n\nSon: William Dunning Sewall\n\nSon: Dumner (d. in infancy)\n\n\n\nBath National Bank President\n\nMaine Central Railroad President\n\nBath Iron Works Part Owner\n\nArthur Sewall & Co. Founder (1879)\n\nE. & A. Sewall Partner (1854-79)\n\nDemocratic National Committee Maine (1888-96)\n\n\n\n\n\n\n\nRequires Flash 7+ and Javascript.\n\nDo you know something we don't?\n\nSubmit a correction or make a comment about this profile\n\n\n\n\n\n\n\n"}, {"url": "https://www.findagrave.com/memorial/45852216/arthur-sewall", "page_content": "Mayor of Bath. Arthur Sewall was born on 21 July 1887 in Bath, Maine. He was the son of William Dunning Sewall and Mary Loke Sumner. Arthur Sewall graduated in 1910 from Yale. He married Laura A. Barler on 18 November 1916 in Chicago, Cook County, Illinois. Arthur Sewall died on 31 July 1961 at the Peter Bent Brigham Hospital, Boston, at the age of 74 and is buried in Oak Grove Cemetery, Bath, Maine.\n\n\n\n\n\nChildren of Arthur Sewall and Laura A. Barler\n\n\n\n\n\nMary Sewall b. 24 Sep 1917, d. 30 May 1990\n\n\n\n\n\nWilliam Dunning Sewall b. 21 Jan 1921, d. 26 Apr 2003\n\n\n\n\n\nBATH, Me. - Funeral arrangements were being completed today for Arthur Sewall, 74, onetime mayor of Bath and retired president of the Bath National Bank. Sewall died in a Boston hospital after a long illness.\n\n\n\nA native of Bath, where his family founded a shipyard in 1823, Sewall served as mayor from 1933 through 1937 and again in 1939. He succeeded his father as president of the bank in 1930 and retired several years later to be succeeded in turn by his brother, former Maine Gov. Sumner Sewall.\n\n\n\nTuesday, August 1, 1961, Boston American (Boston, Massachusetts), page 9.\n\n\n\n\n\n\n\nMayor of Bath. Arthur Sewall was born on 21 July 1887 in Bath, Maine. He was the son of William Dunning Sewall and Mary Loke Sumner. Arthur Sewall graduated in 1910 from Yale. He married Laura A. Barler on 18 November 1916 in Chicago, Cook County, Illinois. Arthur Sewall died on 31 July 1961 at the Peter Bent Brigham Hospital, Boston, at the age of 74 and is buried in Oak Grove Cemetery, Bath, Maine.\n\n\n\n\n\nChildren of Arthur Sewall and Laura A. Barler\n\n\n\n\n\nMary Sewall b. 24 Sep 1917, d. 30 May 1990\n\n\n\n\n\nWilliam Dunning Sewall b. 21 Jan 1921, d. 26 Apr 2003\n\n\n\n\n\nBATH, Me. - Funeral arrangements were being completed today for Arthur Sewall, 74, onetime mayor of Bath and retired president of the Bath National Bank. Sewall died in a Boston hospital after a long illness.\n\n\n\nA native of Bath, where his family founded a shipyard in 1823, Sewall served as mayor from 1933 through 1937 and again in 1939. He succeeded his father as president of the bank in 1930 and retired several years later to be succeeded in turn by his brother, former Maine Gov. Sumner Sewall.\n\n\n\nTuesday, August 1, 1961, Boston American (Boston, Massachusetts), page 9.\n\n\n\n\n\n"}, {"url": "https://www.geni.com/people/Arthur-Sewall/6000000004565891749", "page_content": "About Arthur Sewall\n\nhttps://www.wikitree.com/wiki/Sewall-171\n\nhttps://www.findagrave.com/memorial/7232538\n\nWilliam J. Bryan's running mate of the Presidency in 1896.\n\nPolitician. Served as a Member of the Democratic National Committee from Maine from 1888-1896, and Democratic Candidate for Vice President of the United States in 1896.\n\nUpon his brother's death the company became Arthur Sewall & Co (shipbuilders) built largest wooden ship Roanoke in 1894 launched the Dirigo first steel sailing ship built in America. President of the Eastern railway,Director of the Boston &Maine,New York & New England,and Mexican Centrail railroads.\n\nhttp://en.wikipedia.org/wiki/Arthur_Sewall\n\nArthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. As the Populist Party nominee, Bryan had another running mate as well, Thomas E. Watson. Sewall never held elective office, although he was a member of the Democratic National Committee from 1888 to 1896.\n\nArthur Sewall's main claim to fame had been as an exceptionally successful, wealthy shipbuilder and New England industrialist. He was a director of the Maine Central railroad and President of the Bath National Bank for years. His selection is believed to have been an effort to win votes among conservative and New England members of the party who were disturbed by the populist aspects of William Jennings Bryan. Arthur Sewall is also one of the few politicians to be an adherent of Swedenborgianism, a religion based on the writings of Swedish theologian Emanuel Swedenborg.\n\nHis main vice-presidential opponent, Garret A. Hobart (Rep), was also an Eastern banker and industrialist who had served on his party's national committee.\n\nSewall was Bryan's running mate for the first of Bryan's three times as the Democratic presidential nominee. He died not long after Bryan was nominated for the second time in 1900.\n\nSewall's grandson, Sumner Sewall, served as Governor of Maine from 1941 to 1945, as a Republican.\n\nLegacy\n\nIn 2008, the St. Louis Post-Dispatch referenced Sewall in an article criticizing Senator John McCain's selection of Gov. Sarah Palin as his vice presidential candidate in the 2008 presidential election, saying he had picked \"the least qualified running mate since the Swedenborgian shipbuilder Arthur Sewall ran as William Jennings Bryan's No. 2 in 1896.\""}, {"url": "https://bathhistorical.com/", "page_content": "Welcome to the Bath Historical Society\n\nBHS is a nonprofit organization dedicated to promoting interest in the history and heritage of Bath, Maine: The City of Ships. Our headquarters are in the Sagadahoc History and Genealogy Room on the second floor of the Patten Free Library at 33 Summer Street in Bath. We provide financial and volunteer support to the History Room, collect photographs, documents and ephemera related to Bath, and present programs about people, places and events in Bath history. We invite you to join us in exploring our rich heritage on this website, at our programs and in the History Room.\n\nBath Historical Society Mission Statement\n\n“To support the Sagadahoc History and Genealogy Room of the Patten Free Library and conduct historical research and educational programs which help preserve the history of Bath, Maine.”\n\n_________________________________________________________________________\n\nAnnual Meeting: Saturday, April 15th, 2023, 10:30am at the Patten Free Library\n\nAll BHS members and the general public were invited to attend the Annual Meeting of the Bath Historical Society on Saturday, April 15th, 2023 at the Patten Free Library.\n\nThe program included a fascinating presentation from Dr. James Wilberg, the author of, “Sumner Sewall: Maine’s First World War Fighter Ace.” His book takes us through Sewall’s experience as he joined the Army Signal Corps and then flew with the 95th Aero Squadron, where he survived the harrowing experience of being shot down in flames to then achieve acedom.\n\nSumner Sewall was born and raised, lived and died in Bath. He was a grandson of Arthur Sewall, the head of the prolific Sewall shipbuilding firm in Bath. After serving in World War I, Sumner Sewall went on to have a career in aviation business, and served as Governor of Maine during World War II.\n\nJim Wilberg (pictured at right) has been interested in the history of aviation for as long as he can remember. He focuses on early aviation history through the First\n\nWorld War, with an additional interest in aviation art. At present, he has had 12 books published; 3 are now sold out of their initial printing. After approximately 4,000 babies and 38 years of clinical practice, Jim recently retired from his practice in obstetrics and gynecology.\n\nAnnual Meeting Slate of Trustees and Officers\n\nAs part of the business meeting you will be asked to approve the following slate of new trustees and officers :\n\nTrustees: Joseph Minott, Maggie Edwards, and Lorena Coffin.\n\nOfficers : President – Nathan Lipfert, Vice President – Jack Martin, Secretary – Mary Small, and Treasurer – Hector Casas\n\nDo you have additional questions about the BHS Annual Meeting – reach out to us at info@bathhistorical.org\n\n_________________________________________________________________________\n\nBHS Products!\n\nLimited copies of the 2023 Bath Historical Society calendar are available! Look for it at the Patten Free Library’s Sagadahoc History and Genealogy Roo and the Cemetery Office. Or follow the “Purchase 2023 Calendar” link below to order online.\n\nBath Customs Book – Order Now!\n\nOver 180 pages of information on the Bath Customs District and the various Custom Houses and officers of Bath. Containing a wealth of information and stories of interest to local historians, Maritime enthusiast, or those interested in the history of maritime trade. Written by Nathan R. Lipfert"}, {"url": "https://faculty.nps.edu/bneta/Sewall-arthur.html", "page_content": "Sewall, Arthur\n\n(source: The National Cyclopaedia of American Biography)\n\n<![if !supportEmptyParas]> <![endif]>\n\nShipbuilder and politician, was born at Bath, ME, Nov. 25, 1835, third son of William Dunning and Rachel (Trufant) Sewall. He was a lineal descendant of Henry Sewall, mayor of Coventry, England, one of whose grandsons was married to Jane Dummer, and emigrated to Newbury, MA, in 1634. Samuel Sewall, who settled at York, ME, in 1708, had two sons: David, first U.S. judge for the district of Maine, appointed by Washington, and Dummer Sewall, a distinguished soldier and the great grandfather of Arthur Sewall. The latter obtained a lieutenancy under Amherst in the Canada campaign, and in 1775 joined the revolutionary army as a lieutenant colonel. After the adoption of the constitution of Massachusetts, he was elected a senator from the state; he was also a memebr of the state convention which ratified the Constitution of the United States. The father of Arthur Sewall was one of the earliest and most prominent shipbuilder of Bath. He built his first ship, the Diana, a vessel of 199 tons burden, in 1823, and in 1841 launched the ship Rappahannock, which though of little over 1,000 tons burden, was at that time the largest ship afloat. He also held large interest in railroad and other important corporations. As his sons completed their education they joined their father in business, and Arthur on leaving shchool was sent in the interests of the firm to Prince Edward Island to buy timber for the shipyard at Bath. Returning, he entered the employs of his father's firm in 1853, and in 1854 formed, with his elder brother, the firm of E. & A. Sewall, which took over the business of the old firm of William D. Sewall and Clark & Sewall. On the death of the elder brother, in 1879, the name of the firm was changed to Arthur Sewall & Co., being made up of the senior partner, with his nephew, Samuel S. Sewall, and his second son, William D. Sewall. Since January, 1855, when the brothers launched their first ship, the Holyhead, a vessel of over 1,100 tons, one ship a year, on an average, has been built in the sewall shipyard. The largest and the best built wooden ships in the world are the product of this yad. With the giant Roanoke this era of ship-building was closed, and the firm turned its attention to building steel vessels, the ship Dirigo, launched in 1894, being the first of its class followed in quick succession by others of the largest size. Mr. Sewall had supreme faith in the ultimate maritime supremacy of the United States, and lost no opportunity, by public and private effort, to forward this end. He was prominent in other fields of commercial and industrial enterprise; was a director in the Maine Central railroad, and its president for nine years, 1884-93; was also president of the Eastern railroad, and the Boston and Maine, and director in the Mexican Central and other roads. He was president of the Bath National Bank, holding the office for 29 years, to the time of his death. He was the leader of the Democratic party in Maine, but held only minor political offices; was a delegate to the national Democratic convention at Baltimore in 1872; to that at Cincinnati in 1880, and delegate-at-large to that which nominated Cleveland in 1884. In 1888 he attended the convention at St. Louis, where he was elected a member of the Democratic national committee, and was a member of its executive committee for the campaign of that year. At the Chicago convention of 1892 he was elected to the same office. In 1896 he was nominated for the vice-presidency on the ticket with William J. Bryan. He was also a delegate to the national convention of 1900, and there elected again a member of the national committee. He was married in 1859, to Emma Duncan, daughter of Charles Crooker, a ship-builder and merchant, of Bath, ME, and, like her husband, a descendant of Samuel Sewall, of York. They had three sons, two of whom are living: Harold, consul-general at Samoa under Cleveland and Harrison; attached to the Berlin commission for the settlement of the Samoan affairs, and minister to Hawaii, under McKinley, to the time of its annexation, and William D. Sewall, a member of the firm. Arthur Sewall sied at Smallpoint, ME, Sept. 5, 1900."}], "Arthur Sewall was the son of Hannah and Samuel Sewall.": [{"url": "https://www.britannica.com/biography/Samuel-Sewall", "page_content": "Samuel Sewall, (born March 28, 1652, Bishopstoke, Hampshire, Eng.—died Jan. 1, 1730, Boston), British-American colonial merchant and a judge in the Salem witchcraft trials, best remembered for his Diary (Massachusetts Historical Society; 3 vol., 1878–82), which provides a rewarding insight into the mind and life of the late New England Puritan.\n\nA graduate of Harvard College (1671), Sewall began his public career in 1679, when he was made a “freeman”—a landowner with the right to participate in the government of the colony. He was manager of the colonial printing press (1681–84), member of the Council (1684–1725), and chief justice of the Superior Court (1718–28). He was also a commissioner of the Society for the Propagation of the Gospel in New England, an overseer of Harvard College, and captain of the Ancient and Honorable Artillery Company. In 1692 he was named by Gov. William Phips as one of the special commissioners appointed to try the Salem witchcraft cases, in which 19 persons were condemned to death. Sewall was the only judge to admit the error of these decisions, standing silently in the Old South Church in Boston in 1697 while his confession of error and guilt was read aloud.\n\nSewall’s writings include an early anti-slavery appeal, The Selling of Joseph (1700), A Memorial Relating to the Kennebeck Indians (1721), an argument for humane treatment of Indians, and unpublished verses and political and religious tracts."}, {"url": "https://historyofmassachusetts.org/samuel-sewall-judge/", "page_content": "Samuel Sewall was a judge in the Salem Witch Trials and the only judge to apologize for his role in the trials.\n\nSewall was born in Bishopstoke, England on March 28, 1652. His family had previously lived in the settlement of Newbury in the Massachusetts Bay Colony but temporarily returned to England, where Sewall was born. The Sewall family returned to Newbury in Massachusetts in 1661.\n\nSewall was well educated and attended Harvard University, where he was classmates with Reverend George Burroughs. He graduated in 1671 and then received his master of arts in 1674.\n\nIn February of 1676, Sewall married Hannah Hull and joined her father in his silversmith and minting businesses, becoming the mintmaster of the Massachusetts Bay Colony.\n\nSewall and Hannah Hull had 14 children but only six survived infancy:\n\nJohn Sewall, born April 2, 1677, died September 11, 1678\n\nSamuel Sewall, born June 11, 1678\n\nHannah Sewals, born February 3, 1679/80\n\nElizabeth Sewall, born December 29, 1681\n\nHull Sewall, born July 8, 1684, died June 18, 1686\n\nHenry Sewall, born December 7, 1685, died December 22, 1685\n\nStephen Sewall, born January 30, 1686/7, died July 26, 1687\n\nJoseph Sewall, born August 15, 1688\n\nJudith Sewall, born August 13, 1690, died September 21, 1690\n\nMary Sewall, born October 28, 1691\n\nJane Sewall, born August 7, 1693, died September 13, 1693\n\nSarah Sewall, born November 21, 1694, died December 23, 1696\n\nStillborn son, birthed May 21, 1696\n\nJudith Sewall, born January 2, 1701/2\n\nIn 1679, Sewall became a constable and was appointed to the Massachusetts General Court in 1681. He was also appointed by the General Council to run the colony’s printing press, which he did so until 1684.\n\nPortrait of Samuel Sewall by John Smibert circa 1739\n\nWhen Sewall’s father-in-law died in 1683, his wife inherited her father’s fortune which permitted Sewall to shift from business to civic service.\n\nIn 1684, Sewall was elected to the Court of Assistants and in 1685 became captain of the South Company of Militia in Boston.\n\nIn 1688, Sewall traveled to England with Increase Mather to assist in his efforts to restore the Massachusetts Bay charter of 1629 and to attend to some private business in England.\n\nSewall returned from England in 1690 and was formally named to the Governor’s Council in 1691.\n\nSamuel Sewall in the Salem Witch Trials:\n\nSewall was an avid diary keeper but only writes about the Salem Witch Trials a few times in his diary.\n\nThe few mentions that he does make though are useful in understanding what it was like to live through them.\n\nSewall first mentioned the Salem Witch Trials in his diary on April 11, 1692:\n\n“Went to Salem, where, in the meeting-house, was a very great assembly; ’twas awful to see how the afflicted persons were agitated. Mr Noyes prayed at the beginning, and Mr. Higginson concluded” Sewall 358.)\n\nOn May 9, 1692, Sewall presided over the examination of his fellow Harvard classmate Reverend George Burroughs but makes no mention of it in his diary.\n\nOn May 27, 1692, Governor Phips established the Court of Oyer and Terminer to hear the witchcraft cases and appointed Samuel Sewall as one of the judges on the court.\n\nOn August 19, 1692, five convicted witches were hanged in Salem, which Sewall made note of in his diary:\n\n“This day [written in the margin: Doleful Witchcraft] George Burroughs, John Willard, Jn Proctor, Martha Carrier and George Jacobs were executed at Salem, a very great number of spectators being present. Mr. Cotton Mather was there, Mr. Sims, Hale, Noyes, Chiever, & C. Mr. Mather says they all died by a righteous sentence. Mr Burrough by his speech, prayer, protestation of his innocence, did much move unthinking persons, which occasions their speaking hardly concerning his being executed” (Sewall 353.)\n\nA month later, on September 19, 1692, Giles Corey was pressed to death in a field in Salem, which Sewall also noted in his diary:\n\n“Monday, Sept. 19, 1692, About noon, at Salem, Giles Corey was pressed to death for standing mute, much pains was used with him two days, one after another, by the court and Capt. Gardner of Nantucket who had been of his acquaintance: but all in vain.” (Sewall 364.)\n\nSewall discussed Giles Corey in his diary again the following day:\n\n“Sept. 20. Now I hear from Salem that about 18 years ago, he was suspected to have stamped and pressed a man to death but was cleared. Twas not remembered till Anne Putnam was told of it by said Corey’s spectre the Sabbath day night before the execution” (Sewall 364.)\n\nAbout a month later in October of 1692, the Court of Oyer and Terminer was dissolved by Governor Phipps which Sewall also noted in his diary:\n\n“Oct. 29. Mr Russell asked whether the Court of Oyer and Terminer should sit, expressing some fear of inconvenience by its fall. Governour said it must fall” (Sewall 368.)\n\nIn November of 1692, Sewall was appointed to the Superior Court of Judicature.\n\nSamuel Sewall After the Salem Witch Trials:\n\nOn January 14, 1697, the Massachusetts Bay Colony held a day of fasting in honor of the innocent people who were hanged during the Salem Witch Trials.\n\nOn that day, Sewall stood in front of the congregation at the South Church in Boston while Reverend Samuel Willard read Sewall’s public apology for his role in the Salem Witch Trials.\n\nThe apology read:\n\n“Samuel Sewall, sensible of the reiterated strokes of God upon himself and family, and being sensible, that as to the guilt contracted, upon the opening of the late commission of Oyer and Terminer at Salem (to which the order for this day relates) he is, upon many accounts, more concerned than any that he knows of, desires to take the blame and shame of it, asking pardon of men, and especially desiring prayers that God, who has unlimited authority, would pardon that sin and all his other sins, personal and relative: and according to his infinite benignity, and soveraignty, not visit the sin of him, or any other, upon himself or any of his, nor upon the land: But that he would powerfully defend him against all temptations to sin, for the future, and vouchsafe him the efficacious saving conduct of his word and spirit” (Graham 45.)\n\nSewall was the only Salem Witch Trials judge to apologize. Many of the people involved in the trials acknowledged that mistakes were made and innocent people were hanged. What prompted Sewall to apologize and not the other judges is not exactly known.\n\nSewall also published his first book in 1697, which was titled Phaenomena Quaedam Apocalyptica ad Aspectum Novi Orbis Configurata.\n\nSamuel Sewall, illustration, published in The Border Wars of New England, circa 1897\n\nIn 1700, Sewall published The Selling of Joseph, which was an essay criticizing slavery and was one of the first of its kind.\n\nDuring his career, Sewall also presided over the trial of several pirates in Boston, such as Jack Quelch, whom he tried and sentenced to death in 1704.\n\nQuelch’s piracy case was considered controversial at the time because Quelch was tried under admiralty law and thus without a jury, which many colonists considered illegal.\n\nSewall became of a Judge of Probate for Suffolk County in 1715.\n\nIn October of 1717, Sewall’s wife Hannah died after a brief illness after which Sewall wrote in his diary:\n\n“God is teaching me a new lesson; to live a widower’s life. Lord help me to learn; and be a sun and shield to me, now so much of my comfort and defense are taken away” (Graham 32.)\n\nIn 1718, Sewall became a Chief Justice of the Superior Court of Judicature.\n\nSewall unsuccessfully courted Katherine Winthrop in 1719 and then remarried later that year, to Abigail Woodmansey Tilley but she died less than six months later in 1720.\n\nIn 1721, Sewall published A Memorial Relating to the Kennebeck Indians, which argued in favor of the humane treatment of Native Americans.\n\nSewall remarried again in 1722, to Mary Gibbs, but still mourned his first wife, Hannah, each year on the anniversary of her death.\n\nIn 1725, Sewall declined re-election to the Governor’s Council.\n\nOn January 1, 1730, Samuel Sewall died in Boston, Massachusetts at the age of 78 years old.\n\nSources:\n\nGraham, Judith S. Puritan Family Life: The Diary of Samuel Sewall. Northeastern University Press, 2003.\n\nSewall, Samuel. The Diary of Samuel Sewall. Vol 2, Massachusetts Historical Society, 1973.\n\n“Samuel Sewall Diaries.” Massachusetts Historical Society, masshist.org/collection-guides/view/fa0243\n\n“Samuel Sewall Takes the Blame and Shame for the Salem Witchcraft Trials.” New England Historical Society, newenglandhistoricalsociety.com/samuel-sewall-takes-blame-shame-salem-witchcraft-trial/"}, {"url": "https://en.geneastar.org/genealogy/sewallsamue/samuel-sewall", "page_content": "Samuel Sewall (; March 28, 1652 – January 1, 1730) was a judge, businessman, and printer in the Province of Massachusetts Bay, best known for his involvement in the Salem witch trials, for which he later apologized, and his essay The Selling of Joseph (1700), which criticized slavery. He served for many years as the chief justice of the Massachusetts Superior Court of Judicature, the province's high court.\n\n\n\n\n\n...\n\nSamuel Sewall (; March 28, 1652 – January 1, 1730) was a judge, businessman, and printer in the Province of Massachusetts Bay, best known for his involvement in the Salem witch trials, for which he later apologized, and his essay The Selling of Joseph (1700), which criticized slavery. He served for many years as the chief justice of the Massachusetts Superior Court of Judicature, the province's high court.BiographySewall was born in Bishopstoke, Hampshire, England, on March 28, 1652, the son of Henry and Jane (Dummer) Sewall. His father, son of the mayor of Coventry, had come to the English North American Massachusetts Bay Colony in 1635, where he married Sewall's mother and returned to England in the 1640s.Following the Restoration of Charles II to the English throne, the Sewalls again crossed the Atlantic in 1661, settling in Newbury, Massachusetts. It is there the young Samuel \"Sam\" grew up along the Parker River and Plum Island Sound.Like other local boys, he attended school at the home of James Noyes, whose cousin, Reverend Thomas Parker, was the principal instructor. From Parker, Sewall acquired a lifelong love of verse, which he wrote in both English and Latin. In 1667 Sewall entered Harvard College, where his classmates included Edward Taylor and Daniel Gookin, with whom he formed enduring friendships. Sewall received his first degree, a BA, in 1671, and his MA in 1674. In 1674 he served as librarian of Harvard for nine months, the second person to hold that post. That year he began keeping a journal, which he maintained for most of his life; it is one of the major historical documents of the time. In 1679 he became a member of the Military Company of Massachusetts.Sewall's involvement in the political affairs of the colony began when he became a freeman of the colony, giving him the right to vote. In 1681 he was appointed the official printer of the colony. One of the first works he published was John Bunyan's The Pilgrim's Progress. After John Hull died in 1683, Sewall was elected to replace him on the colony's council of assistants, a body that functioned both as the upper house of the legislature and as a court of appeals. He also became a member of Harvard's Board of Overseers.Sewall's oral examination for the MA was a public affair and was witnessed by Hannah Hull, daughter of colonial merchant and mintmaster, John Hull. She was apparently taken by the young man's charms and pursued him. They were married in February 1676. Her father, whose work as mintmaster had made him quite wealthy, gave the couple £500 in colonial currency as a wedding gift. Biographer Richard Francis notes that the weight of this amount of specie, 125 pounds (57 kg), may have approximated the bride's weight, giving rise to Nathaniel Hawthorne's legend that the gift was her weight in coins. Sewall moved into his in-laws' mansion in Boston and was soon involved in that family's business and political affairs. He and Hannah had fourteen children before her death in 1717, although only a few survived to adulthood.He also entered local politics and was elevated to the position of assistant magistrate in the judiciary. In 1692 he was one of the nine judges appointed to the court of Oyer and Terminer in Salem, charged with trying those from Salem Town and elsewhere who were accused of witchcraft. His diary recounts many of the more famous episodes of the trials, such as the agonizing death under torture of Giles Corey, and reflects the growing public unease about the guilt of many of the accused. Sewall's brother Stephen had meanwhile opened up his home to one of the initially afflicted children, Betty Parris, daughter of Salem Village's minister, Samuel Parris, and shortly afterward Betty's \"afflictions\" appear to have subsided.Sewall was perhaps most remarkable among the justices involved in the trials in that he later regretted his role, going so far as to call for a public day of prayer, fasting, and reparations. Following the dissolution of the court, the Sewall family was blighted by what Sewall thought to be punishments from God. In the five years after the Trials, two of Sewall's daughters and Hannah's mother died, and Hannah gave birth to a stillborn child. What convinced Sewall of his need for public repentance was a recitation of Matthew 12:7, \"If ye had known what this meaneth, I will have mercy and not sacrifice, ye would not have condemned the guiltless\". Not only had Sewall's home life been shaken, but in the years after the Trials, the people of Massachusetts came to see them as the culmination of a generation-long series of setbacks and ordeals, notably the Navigation Acts, the declaration of the New England Dominion, and King Philip's War. He saw this as a sign not that witchcraft did not exist, but that he had ruled on insubstantial evidence. He records in his diary that on 14 January 1697, he stood up in the meeting house he attended while his minister read out his confession of guilt.In 1693 Sewall was appointed an associate justice of the Superior Court of Judicature, the province's high court, by Governor Sir William Phips. In 1717, he was appointed its chief justice by Governor Samuel Shute.Sewall died in Boston, Massachusetts, on January 1, 1730, aged 77, and was interred in the family tomb at Boston's Granary Burying Ground.Sewall married three times. Hannah Hull, his first wife, died in 1717; two years later, in 1719, Sewall married Abigail (Melyen) Woodmansey Tilley, who died seven months later. In 1722, he married Mary (Shrimpton) Gibbs, who survived him. His nephew, Stephen, also served as a Massachusetts Chief Justice, as did his great-grandson Samuel.Views and writingsApart from his involvement in the Salem witch trials, Sewall was liberal in his views for the time. In 1700, he wrote and published The Selling of Joseph, a tract which argued a biblically-based case that slavery was unjustified and sinful. It was the first anti-slavery document ever published in New England and in North America broadly. Written like a sermon, Selling argued that \"Liberty is in real value next unto Life: None ought to part with it themselves, or deprive others of it, but upon the most mature Consideration.\" Enslaving people of Black African descent was contrary to God's design for the world because according to scripture, all humankind were \"the sons of Adam\" and \"of One Blood\" and had the same right to freedom. Freedom, including for Black Americans, Sewall wrote, should be valued more than profit. His title referred to the biblical story of Joseph, son of Israel, whose brothers unjustly sold him into slavery, comparing the enslavement of Black Americans to Joseph's own unjustified bondage. Selling still propagated a segregationist perspective, and Sewall claimed that Black Africans could not peacefully live among white New Englanders. Nevertheless, his argument against slavery was, at least according to one historian, a \"courageous… public stand\".Sewall had published Selling in response to learning that Boston judge John Saffin had refused to release a Black indentured servant named Adam and intended to perpetually enslave Adam. After Selling was released, Saffin issued a rebuttal arguing that social hierarchies were necessary and that enslaving Black Americans was divinely ordained. Adam was set free after a lengthy trial, but Saffin's rebuttal held greater sway among Bostonians, and chattel slavery persisted in Massachusetts. Selling was only reprinted twice (one in the 1700s and again in 1863), and it became an obscure document. Sewall's own nephew, also named Samuel Sewall, rejected his uncle's arguments against chattel slavery and continued participating in it as a business.His essay Talitha Cumi, first published in 1725, refers to the \"right of women.\" When the periwig became fashionable in New England, Sewall condemned the fashion vehemently, in contrast to Cotton Mather, who saw no reason why a Puritan should not wear a wig. Sewall's Journal, kept from 1673 to 1729, describes his life as a Puritan against the changing tide of colonial life as the devoutly religious community of Massachusetts gradually adopted more secular attitudes and emerged as a liberal, cosmopolitan-minded community.Cultural influenceThe Crucible (1996 film): Judge Samuel Sewall was played by actor George Gaynes. Notably, he is the first judge to begin doubting the circumstances, and by the end of the film, he is asking his superior, Judge Danforth, to end the trials as he and the townspeople have tired of the deaths and executions brought on by the court.BibliographyWorks written by Sewall include:The Revolution in New England Justified, 1691Phaenomena quaedam Apolyptica, 1697 online text (PDF version)The Selling of Joseph, 1700Proposals Touching the Accomplishment of Prophecies, 1713Diary of Samuel Sewall, 1674–1729. Edited M. Halsey Thomas in two volumes, Farrar, Straus and Giroux, New York, 1973.Talitha Cumi, or Damsel, Arise, 1725. Reprinted in Eve LaPlante, Salem Witch Judge,' 2007, 2008.ReferencesSourcesBridgeman, Thomas (1856). The Pilgrims of Boston and their Descendants. New York: D. Appleton and Company. Retrieved 29 April 2009.Kendi, Ibram X. (2016). Stamped from the Beginning: The Definitive History of Racist Ideas in America. New York: Nation Books. ISBN 9781568584638.Richard Francis, Judge Sewall's Apology: The Salem Witch Trials and the Forming of a Conscience, Fourth Estate, London, 2005; HarperCollins, New York, 2005; HarperPerennial, London & New York, 2006Eve LaPlante, Salem Witch Judge: The Life and Repentance of Samuel Sewall, HarperOne, 2007, 2008.Ola Elizabeth Winslow, Samuel Sewall of Boston, Macmillan, New York, 1964.Mel Yazawa, The Diary and Life of Samuel Sewall, Bedford Books, Boston and New York, 1998.Archives and recordsSamuel Sewall journal at Baker Library Special Collections, Harvard Business School.External linksWorks by or about Samuel Sewall at WikisourceMedia related to Samuel Sewall at Wikimedia Commons100 Parish Cemetery, York, Maine. Descendants buried here.Reading by Eve LaPlante from her biography of Sewall, courtesy of the Maine Humanities CouncilThe Family of Dummer of British OriginThe Selling of Joseph: A Memorial (1700) essay\n\n\n\nBiography from Wikipedia (see original) under licence CC BY-SA 3.0"}, {"url": "https://courses.lumenlearning.com/suny-empire-amliterature/chapter/samuel-sewall-the-selling-of-joseph/", "page_content": "Samuel Sewall was born in England to a wealthy family that had property in Massachusetts. Upon the Restoration of the Monarchy with Charles II’s accession to the throne, the Sewall family emigrated to New England. There, Sewall continued his education and graduated from Harvard in 1674 with an MA. Soon thereafter, he married Hannah Hull (d. 1717), daughter of the wealthy John Hull (1624–1683), Master of the Mint of Massachusetts Bay Colony. Sewall remained in Boston, where he took his place as one of its wealthiest citizens. Despite his wealth, Sewall devoted much of his life to public service, a life he recorded in his now famous Diary.\n\nSewall managed Boston’s printing press and served as deputy of the General Court in 1683 and as member of the Council from 1684 to 1686. He helped negotiate a restoration of the Massachusetts Charter, causing him to stay in England almost a full year. A new Charter was granted in 1692; it named Sewall as member of the Council, a position he held for thirty-three years. Also in 1692, he was appointed justice of the Superior Court; he eventually rose to be chief justice of Massachusetts (1718–1728).\n\nSir William Phips (1651–1695), the new governor of Massachusetts, placed Sewall as one of the three judges at the Salem witch trials (1692–1693) that condemned twelve people to death, eleven by hanging and one by pressing. Four years later, Sewall became the only one of these three judges to recant his judgment.\n\nIn 1700, he published what is thought to be the first American antislavery tract: The Selling of Joseph: A Memorial. Its title derives from the Biblical account of Joseph being sold into slavery in Egypt by his own brothers. The title speaks to Sewall’s view that God’s covenant with Adam and Eve gave all their “heirs” liberty. He countered arguments claiming blacks’ descent from Noah’s cursed son Ham— condemned to be slave to his brothers—and pointed to the Bible’s prohibition against kidnapping, an act by which most blacks were enslaved. Sewall maintained his views against slavery in the Boston News-Letter (June 12, 1706) and expanded upon them in his Diary. This Diary, which he kept from 1673 to 1729, was not published until 1787.\n\nForasmuch as Liberty is in real value next unto Life: None ought to part with it themselves, or deprive others of it, but upon most mature Consideration.\n\nThe Numerousness of Slaves at this day in the Province, and the Uneasiness of them under their Slavery, hath put many upon thinking whether the Foundation of it be firmly and well laid; so as to sustain the Vast Weight that is built upon it. It is most certain that all Men, as they are the Sons of Adam, are Coheirs; and have equal Right unto Liberty, and all other outward Comforts of Life. GOD hath given the Earth [with all its Commodities] unto the Sons of Adam, Psal 115. 16. And hath made of One Blood, all Nations of Men, for to dwell on all the face of the Earth; and hath determined the Times before appointed, and the bounds of their habitation: That they should seek the Lord. Forasmuch then as we are the Offspring of GOD &c. Act 17.26, 27, 29. Now although the Title given by the last ADAM, doth infinitely better Mens Estates, respecting GOD and themselves; and grants them a most beneficial and inviolable Lease under the Broad Seal of Heaven, who were before only Tenants at Will: Yet through the Indulgence of GOD to our First Parents after the Fall, the outward Estate of all and every of the Children, remains the same, as to one another. So that Originally, and Naturally, there is no such thing as Slavery. Joseph was rightfully no more a Slave to his Brethren, then they were to him: and they had no more Authority to Sell him, than they had to Slay him. And if they had nothing to do to Sell him; the Ishmaelites bargaining with them, and paying down Twenty pieces of Silver, could not make a Title. Neither could Potiphar have any better Interest in him than the Ishmaelites had. Gen. 37. 20, 27, 28. For he that shall in this case plead Alteration of Property, seems to have forfeited a great part of his own claim to Humanity. There is no proportion between Twenty Pieces of Silver, and LIBERTY. The Commodity it self is the Claimer. If Arabian Gold be imported in any quantities, most are afraid to meddle with it, though they might have it at easy rates; lest if it should have been wrongfully taken from the Owners, it should kindle a fire to the Consumption of their whole Estate. ’Tis pity there should be more Caution used in buying a Horse, or a little lifeless dust; than there is in purchasing Men and Women: Whenas they are the Offspring of GOD, and their Liberty is,\n\n—————-Auro pretiosior Omni.\n\nAnd seeing GOD hath said, He that Stealeth a Man and Selleth him, or if he be found in his hand, he shall surely be put to Death. Exod. 12.16. This Law being of Everlasting Equity, wherein Man Stealing is ranked amongst the most atrocious of Capital Crimes: What louder Cry can there be made of the Celebrated Warning,\n\nCaveat Emptor!\n\nAnd all thing considered, it would conduce more to the Welfare of the Province, to have White Servants for a Term of Years, than to have Slaves for Life. Few can endure to hear of a Negro’s being made free; and indeed they can seldom use their freedom well; yet their continual aspiring after their forbidden Liberty, renders them Unwilling Servants. And there is such a disparity in their Conditions, Color & Hair, that they can never embody with us, and grow up into orderly Families, to the Peopling of the Land: but still remain in our Body Politick as a kind of extravasat Blood. As many Negro men as there are among us, so many empty places there are in our Train Bands, and the places taken up of Men that might make Husbands for our Daughters. And the Sons and Daughters of New England would become more like Jacob, and Rachel, if this Slavery were thrust quite out of doors. Moreover it is too well known what Temptations Masters are under, to connive at the Fornification of their Slaves; lest they should be obliged to find them Wives, or pay their Fines. It seems to be practically pleaded that they might be Lawless; ’tis thought much of, that the Law should have Satisfaction for their Thefts, and other Immoralities; by which means, Holiness to the Lord, is more rarely engraven upon this sort of Servitude. It is likewise most lamentable to think, how in taking Negros out of Africa, and Selling of them here, That which GOD ha’s joyned together men do boldly rend asunder; Men from their Country, Husbands from their Wives, Parents from their Children. How horrible is the Uncleanness, Mortality, if not Murder, that the Ships are guilty of that bring great Crouds of these miserable Men, and Women. Methinks, when we are bemoaning the barbarous Usage of our Friends and Kinsfolk in Africa: it might not be unseasonable to inquire whether we are not culpable in forcing the Africans to become Slaves amongst our selves. And it may be a question whether all the Benefit received by Negro Slaves, will balance the Accompt of Cash laid out upon them; and for the Redemption of our own enslaved Friends out of Africa. Besides all the Persons and Estates that have perished there.\n\nObj. 1. These Blackamores are of the Posterity of Cham, and therefore are under the Curse of Slavery. Gen. 9.25, 26, 27.\n\nAnsw. Of all Offices, one would not begg this; viz. Uncall’d for, to be an Executioner of the Vindictive Wrath of God; the extent and duration of which is to us uncertain. If this ever was a Commission; How do we know but that it is long since out of date? Many have found it to their Cost, that a Prophetical Denunciation of Judgment against a Person or People, would not warrant them to inflict that evil. If it would, Hazael might justify himself in all he did against his Master, and the Israelites, from 2 Kings 8. 10, 12.\n\nBut it is possible that by cursory reading, this Text may have been mistaken. For Canaan is the Person Cursed three times over, without the mentioning of Cham. Good Expositors suppose the Curse entailed on him, and that this Prophesie was accomplished in the Extirpation of the Canaanites, and in the Servitude of the Gibeonites, Vide Pareum. Whereas the Blackmores are not descended of Canaan, but of Cush. Psal. 68. 31. Princes shall come out of Egypt [Mizraim] Ethopia [Cush] shall soon stretch out her hands unto God. Under which Names, all Africa may be comprehended; and the Promised Conversion ought to be prayed for. Jer. 13, 23. Can the Ethiopian change his skin? This shews that Black Men are the Posterity of Cush: Who time out of mind have been distinguished by their Colour. And for want of the true, Ovid assigns a fabulous cause of it.\n\nSanguine tum credunt in corpora summa vocato Æthiopum populos nigrum traxisse colorem. Metamorph. lib.2.\n\nObj. 2. The Nigers are brought out of a Pagan Country, into places where the Gospel is Preached.\n\nAnsw. Evil must not be done, that good may come of it. The extraordinary and comprehensive Benefit accruing to the Church of God, and to Joseph personally, did not rectify his brethrens Sale of him.\n\nObj. 3. The Africans have Wars with one another: our Ships bring lawful Captives taken in those Wars.\n\nAnsw. For ought is known, their Wars are much such as were between Jacob’s Sons and their Brother Joseph. If they be between Town and Town; Provincial, or National: Every War is upon one side Unjust. An Unlawful War can’t make lawful Captives. And by Receiving, we are in danger to promote, and partake in their Barbarous Cruelties. I am sure, if some Gentlemen should go down to the Brewsters to take the Air, and Fish: And a stronger party from Hull should Surprise them, and Sell them for Slaves to a Ship outward bound: they would think themselves unjustly dealt with; both by Sellers and Buyers. And yet ‘tis to be feared, we have no other kind of Title to our Nigers. Therefore all things whatsoever ye would that men should do to you, do ye even so to them: for this is the Law and the Prophets. Matt. 7. 12.\n\nObj. 4. Abraham had servants bought with his Money, and born in his House.\n\nAnsw. Until the Circumstances of Abraham’s purchase be recorded, no Argument can be drawn from it. In the mean time, Charity obliges us to conclude, that He knew it was lawful and good.\n\nIt is Observable that the Israelites were strictly forbidden the buying, or selling one another for Slaves. Levit. 25. 39, 46. Jer. 34. 8——22. And GOD gaged His Blessing in lieu of any loss they might conceipt they suffered thereby. Deut. 15. 18. And since the partition Wall is broken down, inordinate Self love should likewise be demolished. GOD expects that Christians should be of a more Ingenuous and benign frame of spirit. Christians should carry it to all the World, as the Israelites were to carry it one towards another. And for men obstinately to persist in holding their Neighbours and Brethren under the Rigor of perpetual Bondage, seems to be no proper way of gaining Assurance that God ha’s given them Spiritual Freedom. Our Blessed Saviour ha’s altered the Measures of the Ancient Love-Song, and set it to a most Excellent New Tune, which all ought to be ambitious of Learning. Matt. 5. 43, 44. John 13. 34. These Ethiopians, as black as they are; seeing they are the Sons and Daughters of the First Adam, the Brethren and Sister of the Last ADAM, and the Offspring of GOD; They ought to be treated with a Respect agreeable.\n\nServitus perfecta voluntaria, inter Christianum & Christiainum, ex parte servi patientis saepe est licita, quia est necessaria: sed ex parte domini agentis, & procurando & exercendo, vix potest esse licita: quia non convenit regulae illi generali:\n\nQuaecunque volueritis ut faciant vobis homines, ita & vos facite eis. Matt. 7.12.\n\nPerfecta servitus poenae, non potest jure locum habere, nisi ex delicto gravi quod ultimum supplicum aliquo modo meretur: quia Libertas ex naturali aestimatione proxime accedit ad vitam ipsam, & eidem a multis proeferri solet.\n\nAmes. Cas. Consc. Lib. 5. Cap. 23. Thes. 2, 3."}, {"url": "https://www.encyclopedia.com/people/history/us-history-biographies/samuel-sewall", "page_content": "Sewall, Samuel\n\nMarch 28, 1652\n\nHampshire, England\n\nJanuary 1, 1730\n\nBoston, Massachusetts\n\nMassachusetts businessman and judge\n\n\"Tis pity there should be more caution used in buying a horse, or a little lifeless dust, than there is in purchasing men and women. . . . \"\n\nSamuel Sewall.\n\nS amuel Sewall was a prominent businessman and judge in Boston during a time of social and political upheaval in the Massachusetts colony. He is perhaps best known for making a dramatic public apology for the role he played as a judge in the Salem witch trials, which resulted in the executions of nineteen people. Sewall is also famous for his diary, a remarkable work that spans more than fifty years and provides modern historians with a vivid picture of life in Puritan New England. (The Puritans were a Christian group who observed strict moral and spiritual codes; they controlled social and political life in Massachusetts.) Sewall also was one of the first colonists to speak out against the keeping of African slaves.\n\nBegins long public career\n\nSamuel Sewall was born in Hampshire, England, on March 28, 1652, the son of Henry and Jane (Dummer) Sewall. When he was nine years old, his parents emigrated (moved from one country to another) to Newbury, Massachusetts, where he was educated at a private school. In 1671 he graduated from Harvard College with a bachelor's degree and three years later earned a master's degree from the same institution. Sewall was then ordained a minister, but he left the church to go into business when he married Hannah Hull in 1675. Sewall's father-in-law, John Hull, was the master of the mint (a government agency that prints money) for the Massachusetts Bay Colony and therefore had extensive connections in the business community. At Hull's urging, Sewall moved to Boston in 1681 to take over management of the colony's printing press. By the early 1690s he was a prominent figure in Boston business and political circles. He was a banker, publisher, international trader, and member of the colonial court. Although Sewall had no formal legal training, he also served as a judge (at that time a law degree was not required).\n\nSewall began his long career as a government official in 1683, when he was appointed to the general court. The following year he was elected to the Massachusetts council (governing body). While visiting England on business in 1684, he became involved in unsuccessful efforts to convince British officials to maintain the Massachusetts Bay Colony charter in its present form. Massachusetts Bay was the only self-governing English colony in America (see John Winthrop entry). However, Britain revoked the charter because Massachusetts Bay officials were illegally operating a mint. They were also basing voting rights on religious affiliation instead of property ownership and discriminating against Anglicans (members of the Church of England, the official religion of the country); the majority of the Massachusetts colonists were Puritans.\n\nThe Salem witch trials\n\nIn 1691 Britain forced the Massachusetts Bay Colony to accept a charter that united it with Plymouth (see William Bradford entry) and Maine (see Ferdinando Gorges box in Thomas Morton entry) to form the Massachusetts colony. Under the new charter, church membership could no longer be a requirement for voting, although Congregationalism (a branch of Puritanism organized according to independent church congregations) remained the established (official) church. Sewall was named a councilor (advisor) in the new royal government, a position he held until 1725, when he decided not to seek reelection.\n\nHistorians note that the loss of the original charter led to widespread anxiety in Massachusetts, which may be one of the main reasons for the infamous witchcraft hysteria that followed. Puritan officials believed the colony was under an evil spell cast by witches (people, usually women, with supernatural powers), who had signed a compact with the Devil, the ultimate evil force. Witches were supposedly seeking revenge on particular members of the community. According to the Puritans, the compact empowered a witch to perform such acts as causing a child's death, making crops fail, preventing cream from being churned into butter, or producing sterility (inability to conceive offspring) in cattle. They also believed witches entered the bodies of animals and became beings called \"familiars\" who prowled around undetected. Yet the witches could be discovered through other forms of witchcraft. The prominent Puritan leader Increase Mather (see box in Cotton Mather entry) wrote Remarkable Providence, a handbook on how to identify a witch. He actively supported holding trials to rid the colony of witches.\n\n\"the blame and shame of it\"\n\nSamuel Sewall regretted his participation as a judge in the Salem witch trials of 1692–93. On January 14, 1697—a special day of atonement set aside by the Massachusetts legislature—Sewall stood and faced the congregation in the Old South Church at Boston. The Reverend Samuel Willard then read aloud this statement Sewall had written:\n\nSamuel Sewall, sensible of the reiterated [repeated] strokes of God upon himself and his family; and being sensible, that as to the guilt contracted, upon the opening of the late Commission of Oyer and Terminator [the court that conducted the witchcraft trials] at Salem (to which the order for this day relates), he is, upon many accounts, more concerned than any that he knows of, desires to take the blame and shame of it, asking pardon of men, and especially desiring prayers that God, who has an unlimited authority, would pardon that sin and all his other sins; personal and relative: And according to his infinite benignity [kindness], and sovereignty [supreme power], not visit the sin of him, or of any other, upon himself or any of his, nor upon the land: But that He [God] would powerfully defend him against all temptations to sin, for the future; and vouchsafe him the efficacious [having the power to produce a desired effect], saving conduct of his word and spirit.\n\nReprinted in: Gunn, Giles, ed. Early American Writing. New York: Penguin Books, 1994, pp. 246–47.\n\nIn June 1692, when the Puritans decided to hold formal witch trials in Salem, Massachusetts governor William Phips appointed Sewall as a special commissioner (judge) on the court. Meeting in July and August, Sewall and the other judges interrogated suspected witches and gave them a chance to reject the validity of their compact with the Devil. A suspected witch was usually falsely accused by other members of the community, and soon widespread accusations paralyzed the area. If the suspects opened themselves to God, they would be reaccepted into the community. But many did not repent. The court ultimately sentenced nineteen people, most of whom were women, to death. The executions were carried out in September: eighteen were hanged and a man was crushed to death. Almost immediately Sewall began to regret the role he played in this tragedy, and the guilt weighed increasingly upon his conscience. In fact, he felt he had greater responsibility in the matter than any of the other judges.\n\nRecants role in trials\n\nBy 1697 Massachusetts officials realized that witchcraft hysteria was out of control and that the trials had been a terrible mistake, so the legislature designated January 14 as a special day of atonement (expression of regret and request for forgiveness). Taking this opportunity to make a public confession of his sins, Sewall wrote an admission of error and guilt. Then he stood and faced the congregation in the Old South Church at Boston as the Reverend Samuel Willard read the statement aloud. Sewall was the only judge who publicly admitted his own guilt. Increase Mather and his son Cotton, who were a motivating force behind the witch hunts, eventually were instrumental in bringing the trials to an end. Yet the Mathers expressed their doubts only in published written works.\n\nOpposes slavery\n\nAfter Sewall made his public apology he continued to be a part of governmental affairs and held various judicial offices. He also became involved in abolitionist (antislavery) efforts. In 1700 he published The Selling of Joseph, an essay in which he argued against the keeping of African slaves. Now considered one of the earliest antislavery statements, it is frequently reprinted in American history and literature texts. (Quaker minister John Woolman (see entry) is credited with organizing the first successful abolitionist movement, in 1743.) Sewall also advocated that Native Americans be placed on reservations and taught the English language and social customs. Colonial governments had been adopting this policy since the mid-1600s. The reservation system eventually resulted in the total extinction of the Native American way of life by the early nineteenth century.\n\nWrites famous diary\n\nSewall wrote numerous historical and religious works as well as unpublished poetry during his lifetime. He is best known, however, for his diary, in which he gave a vivid picture of Puritan life in seventeenth- and eighteenth-century New England. (The diary spans the period from 1674 to 1729; there were no entries from 1677 to 1685.) Sewall was married three times. Hannah Sewall, with whom he had fourteen children, died in 1717. In 1719 he wed Abigail Melyen, who died the following year. One of the most amusing passages in Sewall's diary is his account of courting (seeking to marry) Katherine Winthrop. He wrote that he gave her such gifts as sermons, gingerbread, and sugared almonds. Yet she would not be won over unless he promised to wear a wig and buy a coach. Finally unable to reach a marriage agreement with Winthrop, Sewall turned his affections elsewhere and, at age seventy, took Mary Gibbs as his third wife. He died eight years later, in 1730.\n\nfrom The Selling of Joseph\n\nSamuel Sewall had long been troubled by the practice of slavery in the American colonies, but he had never acted on his views. Then, while he was serving as a judge in the Massachusetts General Court, he had to make a decision on a petition to free an African couple who were being held in bondage. Sewall therefore resolved to issue a public statement against the holding of African slaves. The result was The Selling of Joseph (1700), which is considered one of the earliest expressions of the abolitionist cause. The Joseph in the title is one of the heroes in the Book of Genesis in the Old Testament of the Bible. The favorite son of Jacob and Rachel, Joseph was sold into slavery by his brothers. They were jealous of his ambitions and the coat of many colors that Jacob had given to him.\n\nIn the opening of The Selling of Joseph Sewall argued that \"originally, and naturally, there is no such thing as slavery. Joseph was rightfully no more a slave to [his brothers] than they were to him; and they had no more authority to sell him than they had to slay him. . . . 'Tis pity there should be more caution used in buying a horse, or a little lifeless dust, than there is in purchasing men and women. . . .\" Sewall went on to compare Joseph's situation with that of African slaves: \"It is likewise most lamentable to think how, in taking negroes out of Africa and selling of them here, that which God has joined together men do boldly rend asunder; men from their country, husbands from their wives, parents from their children. How horrible is the uncleanness, immorality, if not murder, that the [slave] ships are guilty of that bring great crowds of these miserable men and women [to America]. . . . \"\n\nReprinted in: Gunn, Giles, ed. Early American Writing. New York: Penguin Books, 1994, pp. 254–57.\n\nFor further research\n\nElliott, Emory, and others, eds. American Literature: A Prentice Hall Anthology. Englewood Cliffs, N.J., 1991, pp. 215–17.\n\nGunn, Giles, ed. Early American Writing. New York: Penguin Books, 1994, pp. 246–47, 254–57.\n\nImages from the Salem Witchcraft Trails.http://www.law.umkc.edu/faculty/projects/ftrials/salem/SA Available July 13, 1999.\n\nJohnson, Allen, and others, eds. Dictionary of American Biography. New York: Scribner, 1946–1958, pp. 610–12.\n\nStephen, Leslie, and Sidney Lee, eds. The Dictionary of National Biography. London, England: Oxford University Press, 1917, pp. 1217–18.\n\nWinslow, Ola Elizabeth. Samuel Sewall of Boston. New York: Macmillan, 1964."}, {"url": "https://faculty.nps.edu/bneta/Sewall-arthur.html", "page_content": "Sewall, Arthur\n\n(source: The National Cyclopaedia of American Biography)\n\n<![if !supportEmptyParas]> <![endif]>\n\nShipbuilder and politician, was born at Bath, ME, Nov. 25, 1835, third son of William Dunning and Rachel (Trufant) Sewall. He was a lineal descendant of Henry Sewall, mayor of Coventry, England, one of whose grandsons was married to Jane Dummer, and emigrated to Newbury, MA, in 1634. Samuel Sewall, who settled at York, ME, in 1708, had two sons: David, first U.S. judge for the district of Maine, appointed by Washington, and Dummer Sewall, a distinguished soldier and the great grandfather of Arthur Sewall. The latter obtained a lieutenancy under Amherst in the Canada campaign, and in 1775 joined the revolutionary army as a lieutenant colonel. After the adoption of the constitution of Massachusetts, he was elected a senator from the state; he was also a memebr of the state convention which ratified the Constitution of the United States. The father of Arthur Sewall was one of the earliest and most prominent shipbuilder of Bath. He built his first ship, the Diana, a vessel of 199 tons burden, in 1823, and in 1841 launched the ship Rappahannock, which though of little over 1,000 tons burden, was at that time the largest ship afloat. He also held large interest in railroad and other important corporations. As his sons completed their education they joined their father in business, and Arthur on leaving shchool was sent in the interests of the firm to Prince Edward Island to buy timber for the shipyard at Bath. Returning, he entered the employs of his father's firm in 1853, and in 1854 formed, with his elder brother, the firm of E. & A. Sewall, which took over the business of the old firm of William D. Sewall and Clark & Sewall. On the death of the elder brother, in 1879, the name of the firm was changed to Arthur Sewall & Co., being made up of the senior partner, with his nephew, Samuel S. Sewall, and his second son, William D. Sewall. Since January, 1855, when the brothers launched their first ship, the Holyhead, a vessel of over 1,100 tons, one ship a year, on an average, has been built in the sewall shipyard. The largest and the best built wooden ships in the world are the product of this yad. With the giant Roanoke this era of ship-building was closed, and the firm turned its attention to building steel vessels, the ship Dirigo, launched in 1894, being the first of its class followed in quick succession by others of the largest size. Mr. Sewall had supreme faith in the ultimate maritime supremacy of the United States, and lost no opportunity, by public and private effort, to forward this end. He was prominent in other fields of commercial and industrial enterprise; was a director in the Maine Central railroad, and its president for nine years, 1884-93; was also president of the Eastern railroad, and the Boston and Maine, and director in the Mexican Central and other roads. He was president of the Bath National Bank, holding the office for 29 years, to the time of his death. He was the leader of the Democratic party in Maine, but held only minor political offices; was a delegate to the national Democratic convention at Baltimore in 1872; to that at Cincinnati in 1880, and delegate-at-large to that which nominated Cleveland in 1884. In 1888 he attended the convention at St. Louis, where he was elected a member of the Democratic national committee, and was a member of its executive committee for the campaign of that year. At the Chicago convention of 1892 he was elected to the same office. In 1896 he was nominated for the vice-presidency on the ticket with William J. Bryan. He was also a delegate to the national convention of 1900, and there elected again a member of the national committee. He was married in 1859, to Emma Duncan, daughter of Charles Crooker, a ship-builder and merchant, of Bath, ME, and, like her husband, a descendant of Samuel Sewall, of York. They had three sons, two of whom are living: Harold, consul-general at Samoa under Cleveland and Harrison; attached to the Berlin commission for the settlement of the Samoan affairs, and minister to Hawaii, under McKinley, to the time of its annexation, and William D. Sewall, a member of the firm. Arthur Sewall sied at Smallpoint, ME, Sept. 5, 1900."}, {"url": "https://www.wikitree.com/wiki/Sewall-120", "page_content": "Samuel Sewall aka Sewell aka\n\n28 Mar 1652 in Bishopstoke, Hampshire, England Bornin\n\nAncestors\n\nHannah Quincy (Hull) Sewall Husband of— married 28 Feb 1676 [location unknown]\n\nDescendants\n\n1 Jan 1730 at age 77 in Boston, Massachusetts Diedin\n\nProfile last modified 18 Jan 2023 | Created 19 Jan 2014\n\nThis page has been accessed 4,233 times.\n\nBiography\n\nSamuel Sewall was involved in the Salem Witch Trials\n\nSamuel Sewall married three times.[1]\n\nHe married in 1676 to Hannah Hull, daughter of John Hull (1624-1683); they were married for 41 years and had 14 children together. [1]\n\nHe married in 1719, as his 2nd, to Abigail (Melyen) Woodmansey Tilley, and she died suddenly in 1720. [1]\n\nHe married in 1722, as his 3rd, to Mary (Shrimpton) Gibbs.[1]\n\nSamuel Sewall was a judge, businessman, and printer in the Province of Massachusetts Bay, best known for his involvement in the Salem witch trials, for which he later apologized, and his essay The Selling of Joseph (1700), which criticized slavery. He served for many years as the chief justice of the Massachusetts Superior Court of Judicature, the province's high court.\n\nSamuel Sewall was born in Bishopstoke, Hampshire, England, on March 28, 1652, the son of Henry and Jane (Dummer) Sewall. His father, son of the mayor of Coventry, had come to the English North American Massachusetts Bay Colony in 1635, where he married Sewall's mother, and returned to England in the 1640s. Following the restoration of Charles II to the English throne, the Sewalls again crossed the Atlantic in 1661, settling in Newbury, Massachusetts. It is there the young Samuel \"Sam\" grew up along the Parker River and Plum Island Sound. Like other local boys he attended school at the home of James Noyes, whose cousin, Reverend Thomas Parker, was the principal instructor. From Parker Sewall acquired a lifelong love of verse, which he wrote in both English and Latin.\n\nIn 1667 Sewall entered Harvard College, where his classmates included Edward Taylor and Daniel Gookin, both of whom he formed enduring friendships with. Sewall received his first degree, a BA, in 1671, and his MA in 1674. In 1674 he began keeping a journal, which he maintained for most of his life; it is one of the major historical documents of the time.\n\nSewall's involvement in the political affairs of the colony began when he became a freeman of the colony, giving him the right to vote. In 1681 he was appointed the official printer of the colony; one of the first works he published was John Bunyan's The Pilgrim's Progress. After John Hull died in 1683, Sewall was elected to replace him on the colony's council of assistants, a body that functioned both as the upper house of the legislature and as a court of appeals. He also became a member of Harvard's Board of Overseers.\n\nSewall's oral examination for the MA was a public affair, and was witnessed by Hannah Hull, daughter of colonial merchant and mintmaster John Hull. She was apparently taken by the young man's charms, and pursued him; they were married in February 1676. Her father, whose work as mintmaster had made him quite wealthy, gave the couple £500 in colonial currency as a wedding gift. (Biographer Richard Francis notes that the weight of this amount of specie, 125 pounds (57 kg), may have approximated the bride's weight, giving rise to Nathaniel Hawthorne's legend that the gift was her weight in coins.) Sewall moved into his in-laws' mansion in Boston, and was soon involved in that family's business and political affairs. He and Hannah would have fourteen children before her death in 1717, although only a few survived to adulthood.\n\nHe also entered local politics, and was elevated to the position of assistant magistrate in the judiciary that in 1692 judged the people in Salem accused of witchcraft. His diary recounts many of the more famous episodes of the Trials, such as the agonizing death under torture of Giles Corey, and reflects the growing public unease about the guilt of many of the accused. Sewall was perhaps most remarkable among the magistrates involved in the trials in that he was the only magistrate who, some years later, publicly regretted his role, going so far as to call for a public day of prayer, fasting, and reparations. In Salem, Sewall's brother Stephen had opened up his home to one of the initially afflicted children, Betty Parris, daughter of Salem Village's Reverend Samuel Parris, and shortly afterward Betty's 'afflictions' appear to have subsided.\n\nIn 1693 Sewall was appointed an associate justice of the Superior Court of Judicature, the province's high court, by Governor Sir William Phips. In 1717, he was appointed its chief justice by Governor Samuel Shute. Poem by Nehemiah Hobart in Latin, printed by Samuel Sewall, Boston, 1712\n\nSewall died in Boston, Massachusetts, on January 1, 1730 at age 77 and was interred in the family tomb at Boston's Granary Burying Ground.\n\nSewall married three times. Hannah Hull, his first wife, died in 1717; two years later, in 1719, Sewall married Abigail (Melyen) Woodmansey Tilley, who died seven months later. In 1722, he married Mary (Shrimpton) Gibbs, who survived him. His nephew Stephen also served as a Massachusetts chief justice, as did his great grandson Samuel.\n\nApart from his involvement in the Salem witch trials, Sewall was somewhat liberal in his views for the time. In The Selling of Joseph (1700), for instance, he came out strongly against slavery, making him one of the earliest colonial abolitionists. There he argued, \"Liberty is in real value next unto Life: None ought to part with it themselves, or deprive others of it, but upon the most mature Consideration.\" He regarded \"man-stealing as an atrocious crime which would introduce among the English settlers people who would remain forever restive and alien,\" but he also believed that \"There is such a disparity in their Conditions, Colour, Hair, that they can never embody with us, and grow up into orderly Families, to the Peopling of the Land.\" Although holding such segregationist views, he maintained that \"These Ethiopians, as black as they are; seeing they are the Sons and Daughters of the First Adam, the Brethren and Sisters of the Last ADAM, and the Offspring of God; They ought to be treated with a Respect agreeable.\"\n\nHis essay \"Talitha Cumi\", first published in 1725, refers to the \"right of women.\" When the periwig became fashionable in New England, Sewall condemned the fashion vehemently, in contrast to Cotton Mather, who saw no reason why a Puritan should not wear a wig.\n\nHis Journal, kept from 1673 to 1729, describes his life as a Puritan against the changing tide of colonial life, as the devoutly religious community of Massachusetts gradually adopted more secular attitudes and emerged as a liberal, cosmopolitan-minded community. As such, the diary is an important work for understanding the transformation of the colony in the decades before the American Revolutio\n\nSamuel Sewall (/ˈsuːəl/; March 28, 1652 – January 1, 1730) was a judge, businessman, and printer in the Province of Massachusetts Bay, best known for his involvement in the Salem witch trials,[1] for which he later apologized, and his essay The Selling of Joseph (1700), which criticized slavery.[2] He served for many years as the chief justice of the Massachusetts Superior Court of Judicature, the province's high court.\n\nSources\n\nSee also:"}, {"url": "https://thehistoryjunkie.com/samuel-sewell-and-the-salem-witch-trials/", "page_content": "Samuel Sewall was a judge during the Salem Witch Trials that took place in Massachusetts Bay Colony in 1692. He would become one of the judges that would come out later and apologize for his participation in the trials.\n\nAfter the trials, he would become known as one of Colonial America’s first abolitionists.\n\nEarly Years\n\nSamuel Sewall was born in England to Henry and Jane Sewall. His father, son of the Mayor of Coventry, had come to the English North American Massachusetts Bay Colony in 1635, where he married Sewall’s mother and returned to England in the 1640s.\n\nAfter Charles II took back the throne of England, the Sewall family migrated over to the colonies for good.\n\nLike other local boys, he attended school at the home of James Noyes, whose cousin, Reverend Thomas Parker, was the principal instructor. From Parker, Sewall acquired a lifelong love of verse, which he wrote in both English and Latin.\n\nIn 1667 Sewall entered Harvard College, where his classmates included Edward Taylor and Daniel Gookin, with whom he formed enduring friendships. Sewall received his first degree, a BA, in 1671, and his MA in 1674.\n\nIn 1674 he served as librarian of Harvard for nine months, the second person to hold that post. That year he began keeping a journal, which he maintained for most of his life; it is one of the major historical documents of the time.\n\nIn 1679 he became a member of the Military Company of Massachusetts.\n\nSewall’s involvement in the political affairs of the colony began when he became a freeman of the colony, giving him the right to vote. In 1681 he was appointed the official printer of the colony. One of the first works he published was John Bunyan’s The Pilgrim’s Progress.\n\nAfter John Hull died in 1683, Sewall was elected to replace him on the colony’s council of assistants, a body that functioned both as the upper house of the legislature and as a court of appeals. He also became a member of Harvard’s Board of Overseers.\n\nSewall’s oral examination for the MA was a public affair and was witnessed by Hannah Hull, daughter of colonial merchant and mintmaster, John Hull. She was apparently taken by the young man’s charms and pursued him. They were married in February 1676.\n\nHer father, whose work as mintmaster had made him quite wealthy, gave the couple a large sum of money to begin their married life.\n\nSewall moved into his in-laws’ mansion in Boston and was soon involved in that family’s business and political affairs.\n\nHe and Hannah had fourteen children before her death in 1717, although only a few survived to adulthood.\n\nSalem Witch Trials\n\nSamuel had held a position of an assistant magistrate for a bit of time before 1692 when the Salem Witch Trials broke out. Due to his experience, he became one of the nine judges appointed to the Court of Oyer and Terminer by Governor Phips.\n\nHe participated and documented some of the trials. One of those that he documented was the death of Giles Corey by pressing.\n\nIn his diary, he also speaks about the public’s feelings about the guilt of many that were accused. He seems to say that the public was uncomfortable with the growing list of those that were executed.\n\nSewall’s brother Stephen had meanwhile opened up his home to one of the initially afflicted children, Elizabeth Parris, daughter of Salem Village’s minister, Samuel Parris, and shortly afterward Betty’s “afflictions” appear to have gone away.\n\nHe deeply regretted his role in the trials and called for a day of public prayer and fasting.\n\nAfter the trials ended Sewall and his family endured much tragedy with the death of two of his daughters and his mother-in-law. His wife then gave birth to a stillborn baby. These tragedies led to Sewall believing that he had caused this and it was a punishment from God.\n\nHe then repented publicly for his actions.\n\nNot only had Sewall’s home life been rough, but in the years after the trials, the people of Massachusetts came to see them as the culmination of a generation-long series of setbacks and ordeals, notably the Navigation Acts, the declaration of the New England Dominion, and King Philip’s War.\n\nHe saw this as a sign not that witchcraft did not exist, but that he had ruled on insubstantial evidence known as spectral evidence.\n\nHe records in his diary that on January 14, 1697, he stood up in the meeting house he attended while his minister read out his confession of guilt.\n\nHis response was much different than that of Nathaniel Hathorne, Jonathan Corwin, William Stoughton, and even Cotton Mather who seemed to not care or even defend their positions\n\nSamuel Sewall the Abolitionist\n\nSlavery was not as common in New England as it would be in the south, but it still existed evidenced by three slaves being accused of witchcraft: Tituba, Candy, and Mary Black.\n\nIn his writing, The Selling of Joseph Sewell argued, “Liberty is in real value next unto Life: None ought to part with it themselves or deprive others of it but upon the most mature Consideration.” He regarded “man-stealing as an atrocious crime which would introduce among the English settlers people who would remain forever restive and alien”, but also believed that “There is such a disparity in their Conditions, Colour, Hair, that they can never embody with us, and grow up into orderly Families, to the Peopling of the Land.” Although holding such segregationist views, he maintained that “These Ethiopians, as black as they are; seeing they are the Sons and Daughters of the First Adam, the Brethren and Sisters of the Last ADAM [meaning Jesus Christ], and the Offspring of God; They ought to be treated with a Respect agreeable.”\n\nHe was prophetic for his time as the introduction of slavery to the United States would create a dependence on forced labor, especially in the Southern Colonies. His ideas were forward-thinking because he leaned on the scripture and how God intended for Christians to treat one another and others.\n\nJesus said that others would know Christians by how they “Loved one another.”\n\nThe Bible account of creation, which Sewall references, says that mankind comes from one person and that race is a social construct that has been created by individuals.\n\nSamuel Sewall died on January 1, 1730."}, {"url": "https://maineanencyclopedia.com/sewall-arthur/", "page_content": "(1896-1900) was born in Bath, son of one of the City’s first shipbuilders, in whose shipyards he worked learning the trade. In 1854, he and his brother Edward formed E. & A. Sewall continuing their father’s business. It became Arthur Sewall & Co. when his brother died.\n\nArthur Sewall’s firm built 80 ships over 50 years. During the Civil War his ship Vigilant was captured by the Sumter, a Confederate blockade raider. In 1892 his company built the largest wooden sailing ship in the United States, the Roanoke. In 1894 he launched the first American-built, steel-hulled, square-rigger, the Dirigo.\n\nSewall was president (1884-1893) of the Maine Central Railroad, president of the Eastern Railroad, the Boston and Maine Railroad and others. He was also president of the Bath National Bank from 1871 to 1900.\n\nHe was a leader of the Democratic Party in Maine, serving on the Democratic National Committee. In 1893, he was a candidate for the U.S. Senate, losing the election in the Republican-dominated state legislature. The national Democratic Party nominated him as their vice-presidential candidate, along with presidential candidate William Jennings Bryan, in 1896.\n\nArthur Sewall died at his summer home at Small Point in Phippsburg September 5, 1900.\n\nAdditional resources\n\n“Biographies: Arthur Sewall.” Harpweek. http://elections.harpweek.com/1896/bio-1896-Full.asp?UniqueID=4&Year=1896 (accessed April 17, 2015)\n\nBunting, William Henry. Live Yankees: the Sewalls and their Ships. Gardiner, Me. Tilbury House. Bath, Me. Maine Maritime Museum. 2009.\n\nYakowicz, Susie. Steel Glory: The Life of Shipbuilder Arthur Sewall, 1835-1900. Eagan, Minn. S. Yakowicz. c1996."}, {"url": "https://www.geni.com/people/Arthur-Sewall/6000000004565891749", "page_content": "About Arthur Sewall\n\nhttps://www.wikitree.com/wiki/Sewall-171\n\nhttps://www.findagrave.com/memorial/7232538\n\nWilliam J. Bryan's running mate of the Presidency in 1896.\n\nPolitician. Served as a Member of the Democratic National Committee from Maine from 1888-1896, and Democratic Candidate for Vice President of the United States in 1896.\n\nUpon his brother's death the company became Arthur Sewall & Co (shipbuilders) built largest wooden ship Roanoke in 1894 launched the Dirigo first steel sailing ship built in America. President of the Eastern railway,Director of the Boston &Maine,New York & New England,and Mexican Centrail railroads.\n\nhttp://en.wikipedia.org/wiki/Arthur_Sewall\n\nArthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. As the Populist Party nominee, Bryan had another running mate as well, Thomas E. Watson. Sewall never held elective office, although he was a member of the Democratic National Committee from 1888 to 1896.\n\nArthur Sewall's main claim to fame had been as an exceptionally successful, wealthy shipbuilder and New England industrialist. He was a director of the Maine Central railroad and President of the Bath National Bank for years. His selection is believed to have been an effort to win votes among conservative and New England members of the party who were disturbed by the populist aspects of William Jennings Bryan. Arthur Sewall is also one of the few politicians to be an adherent of Swedenborgianism, a religion based on the writings of Swedish theologian Emanuel Swedenborg.\n\nHis main vice-presidential opponent, Garret A. Hobart (Rep), was also an Eastern banker and industrialist who had served on his party's national committee.\n\nSewall was Bryan's running mate for the first of Bryan's three times as the Democratic presidential nominee. He died not long after Bryan was nominated for the second time in 1900.\n\nSewall's grandson, Sumner Sewall, served as Governor of Maine from 1941 to 1945, as a Republican.\n\nLegacy\n\nIn 2008, the St. Louis Post-Dispatch referenced Sewall in an article criticizing Senator John McCain's selection of Gov. Sarah Palin as his vice presidential candidate in the 2008 presidential election, saying he had picked \"the least qualified running mate since the Swedenborgian shipbuilder Arthur Sewall ran as William Jennings Bryan's No. 2 in 1896.\""}]}