{"Arthur Sewall was a delegate to the Democratic National Convention in 1876 and 1880.": [{"url": "https://faculty.nps.edu/bneta/Sewall-arthur.html", "page_content": "Sewall, Arthur\n\n(source: The National Cyclopaedia of American Biography)\n\n<![if !supportEmptyParas]> <![endif]>\n\nShipbuilder and politician, was born at Bath, ME, Nov. 25, 1835, third son of William Dunning and Rachel (Trufant) Sewall. He was a lineal descendant of Henry Sewall, mayor of Coventry, England, one of whose grandsons was married to Jane Dummer, and emigrated to Newbury, MA, in 1634. Samuel Sewall, who settled at York, ME, in 1708, had two sons: David, first U.S. judge for the district of Maine, appointed by Washington, and Dummer Sewall, a distinguished soldier and the great grandfather of Arthur Sewall. The latter obtained a lieutenancy under Amherst in the Canada campaign, and in 1775 joined the revolutionary army as a lieutenant colonel. After the adoption of the constitution of Massachusetts, he was elected a senator from the state; he was also a memebr of the state convention which ratified the Constitution of the United States. The father of Arthur Sewall was one of the earliest and most prominent shipbuilder of Bath. He built his first ship, the Diana, a vessel of 199 tons burden, in 1823, and in 1841 launched the ship Rappahannock, which though of little over 1,000 tons burden, was at that time the largest ship afloat. He also held large interest in railroad and other important corporations. As his sons completed their education they joined their father in business, and Arthur on leaving shchool was sent in the interests of the firm to Prince Edward Island to buy timber for the shipyard at Bath. Returning, he entered the employs of his father's firm in 1853, and in 1854 formed, with his elder brother, the firm of E. & A. Sewall, which took over the business of the old firm of William D. Sewall and Clark & Sewall. On the death of the elder brother, in 1879, the name of the firm was changed to Arthur Sewall & Co., being made up of the senior partner, with his nephew, Samuel S. Sewall, and his second son, William D. Sewall. Since January, 1855, when the brothers launched their first ship, the Holyhead, a vessel of over 1,100 tons, one ship a year, on an average, has been built in the sewall shipyard. The largest and the best built wooden ships in the world are the product of this yad. With the giant Roanoke this era of ship-building was closed, and the firm turned its attention to building steel vessels, the ship Dirigo, launched in 1894, being the first of its class followed in quick succession by others of the largest size. Mr. Sewall had supreme faith in the ultimate maritime supremacy of the United States, and lost no opportunity, by public and private effort, to forward this end. He was prominent in other fields of commercial and industrial enterprise; was a director in the Maine Central railroad, and its president for nine years, 1884-93; was also president of the Eastern railroad, and the Boston and Maine, and director in the Mexican Central and other roads. He was president of the Bath National Bank, holding the office for 29 years, to the time of his death. He was the leader of the Democratic party in Maine, but held only minor political offices; was a delegate to the national Democratic convention at Baltimore in 1872; to that at Cincinnati in 1880, and delegate-at-large to that which nominated Cleveland in 1884. In 1888 he attended the convention at St. Louis, where he was elected a member of the Democratic national committee, and was a member of its executive committee for the campaign of that year. At the Chicago convention of 1892 he was elected to the same office. In 1896 he was nominated for the vice-presidency on the ticket with William J. Bryan. He was also a delegate to the national convention of 1900, and there elected again a member of the national committee. He was married in 1859, to Emma Duncan, daughter of Charles Crooker, a ship-builder and merchant, of Bath, ME, and, like her husband, a descendant of Samuel Sewall, of York. They had three sons, two of whom are living: Harold, consul-general at Samoa under Cleveland and Harrison; attached to the Berlin commission for the settlement of the Samoan affairs, and minister to Hawaii, under McKinley, to the time of its annexation, and William D. Sewall, a member of the firm. Arthur Sewall sied at Smallpoint, ME, Sept. 5, 1900."}, {"url": "https://maineanencyclopedia.com/sewall-arthur/", "page_content": "(1896-1900) was born in Bath, son of one of the City’s first shipbuilders, in whose shipyards he worked learning the trade. In 1854, he and his brother Edward formed E. & A. Sewall continuing their father’s business. It became Arthur Sewall & Co. when his brother died.\n\nArthur Sewall’s firm built 80 ships over 50 years. During the Civil War his ship Vigilant was captured by the Sumter, a Confederate blockade raider. In 1892 his company built the largest wooden sailing ship in the United States, the Roanoke. In 1894 he launched the first American-built, steel-hulled, square-rigger, the Dirigo.\n\nSewall was president (1884-1893) of the Maine Central Railroad, president of the Eastern Railroad, the Boston and Maine Railroad and others. He was also president of the Bath National Bank from 1871 to 1900.\n\nHe was a leader of the Democratic Party in Maine, serving on the Democratic National Committee. In 1893, he was a candidate for the U.S. Senate, losing the election in the Republican-dominated state legislature. The national Democratic Party nominated him as their vice-presidential candidate, along with presidential candidate William Jennings Bryan, in 1896.\n\nArthur Sewall died at his summer home at Small Point in Phippsburg September 5, 1900.\n\nAdditional resources\n\n“Biographies: Arthur Sewall.” Harpweek. http://elections.harpweek.com/1896/bio-1896-Full.asp?UniqueID=4&Year=1896 (accessed April 17, 2015)\n\nBunting, William Henry. Live Yankees: the Sewalls and their Ships. Gardiner, Me. Tilbury House. Bath, Me. Maine Maritime Museum. 2009.\n\nYakowicz, Susie. Steel Glory: The Life of Shipbuilder Arthur Sewall, 1835-1900. Eagan, Minn. S. Yakowicz. c1996."}, {"url": "https://www.loc.gov/rr/main/polcon/democraticindex.html", "page_content": "Democratic National Political Conventions 1832-2008 * The information gathered within these pages is pulled from the Convention Summaries Bibliography.\n\n1832 DEMOCRATIC CONVENTION The Democratic convention of 1832, held on May 21 - 22 in Baltimore, is notable as the convention where the Democratic Party formally adopted its present name. The party had previously been known as “Republican Delegates from the Several States.” The convention nominated President Andrew Jackson for a second term and nominated Martin Van Buren of New York for vice president.\n\n\n\nDelegates to the 1832 Democratic convention refused to renominate John C. Calhoun as vice president. Many Democrats opposed Calhoun because of his tariff policy and his defense of the doctrine of nullification, which claimed that a state had a right to nullify federal laws within its own borders. South Carolina, with Calhoun’s backing, supported the nullification doctrine. The nullification debate foreshadowed the slavery controversy that would become the most divisive national political issue in U.S. history.\n\n\n\nThe 1832 conventions played a crucial role in making organized parties a fixture of the U.S. political system. The Democratic convention adopted rules that succeeding conventions retained well into the 20th century. One rule based each state’s convention vote on its electoral vote, an apportionment method that remained unchanged until 1940. The 1832 convention also adopted the procedure of having one person from each delegation announce the vote of his state. Top of Page Home\n\n1835 DEMOCRATIC CONVENTION\n\n\n\nThe second Democratic National Convention was held in Baltimore on May 20 - 23. It was held a year and a half before the election in order to prevent the emergence of opposition to President Andrew Jackson’s hand-picked successor, Vice President Martin Van Buren. There were 265 delegates from twenty-two states and two territories. Alabama, Illinois, and South Carolina were unrepresented at the convention. The nomination of Van Buren was unanimous on the first ballot. However, Jackson’s favorite for Vice President, Richard M. Johnson, barely reached the necessary two-thirds majority on the first ballot, receiving 178 votes, just one over the required minimum.\n\n\n\nNo platform was passed at the convention. The convention debated the issues that were most pressing in 1835; slavery and states rights were major ones. There was a consensus for a moderate position on slavery. In order to maintain the support of southern states, a majority of the delegates felt that the decision to keep or abolish slavery should be made by the states and not the federal government. In a letter accepting the nomination Van Buren wrote that he would generally continue the political policies of the Jackson administration. Top of Page\n\nHome\n\n1840 DEMOCRATIC CONVENTION\n\nThe Democratic National Convention was held in Baltimore on May 5 - 6. President Martin Van Buren was renominated by acclamation. However, the convention refused to nominate a vice president in response to controversy regarding Vice President Richard M. Johnson. He had been a weak candidate in the general election of 1836 which had led to his distinction as the only vice president elected by the U. S. Senate under the provisions of the Twelfth Amendment. A large contingent of delegates was opposed to renominating him because of growing dissatisfaction regarding his personal life. Johnson had lived for many years with Julia Chinn (deceased in 1833), a slave he inherited from his father. They had lived together with their two daughters whom Johnson educated. This relationship was unacceptable to southern Democrats; at the same time, Johnson continued to own slaves which led to a loss of support for Johnson in the North. The convention decision was to allow state Democratic leaders to select the vice-presidential candidates for their states.\n\n\n\nThe 1840 convention is notable for being the first in which a party platform was adopted. The delegates clearly stated their belief that the Constitution represented the primary guide for political affairs in all of the states. Where the Constitution did not define a role for the federal government, the delegates determined that states should take the lead. For example, the platform stated that the federal government should not become involved in subsidizing the building of roads and canals. The delegates adopted a moderate stand on slavery. Once again slavery was said to be an issue which should be decided by the states. Regarding taxes the platform stated that no more should be raised than was necessary to defray the necessary expenses of the government. Once again the Democrats opposed the establishment of a national bank. The platform said that such an institution would concentrate monetary power in Washington in such a way that would be harmful to the best interests of the people. Top of Page Home\n\n1844 DEMOCRATIC CONVENTION\n\nDelegates from every state except South Carolina assembled in Baltimore on May 27 - 29 for the Democratic convention. The frontrunner for the presidential nomination was former president Martin Van Buren, whose status was threatened on the eve of the convention by his statement against the annexation of Texas. Van Buren’s position jeopardized his support in the South, and with a two-thirds majority apparently necessary, diminished his chances of obtaining the presidential nomination.\n\n\n\nVan Buren led the early presidential balloting, but on succeeding roll calls, his principal opponent, Lewis Cass of Michigan, gained strength and took the lead. Neither candidate, however, approached the 178 votes needed for the nomination. With a deadlock developing, delegates began to look for a compromise candidate. James K. Polk, former speaker of the Tennessee House and former governor of Tennessee, emerged as an acceptable choice and won the nomination on the ninth ballot. This marked the first time in U.S. history that a dark-horse candidate had won a presidential nomination.\n\n\n\nSen. Silas Wright of New York, a friend of Martin Van Buren, was the nearly unanimous nominee of the convention for vice president. But Wright refused the nomination, quickly notifying the delegates by way of Samuel Morse’s new invention, the telegraph. George M. Dallas of Pennsylvania was then chosen as Polk’s running mate. The 1844 Democratic convention was the first to be reported by telegraph. Top of Page Home\n\n1848 DEMOCRATIC CONVENTION\n\nThe Democratic Party’s fifth national convention welcomed all 30 states of the union to Baltimore, Maryland on May 22 - 25, 1848. The front runner for the nomination was Lewis Cass, a former Michigan senator, with a respected career in the military, cabinet and international diplomacy. A full field of contenders arose after Polk declined to run for a second term, but the numbers thinned by early 1848. Running against Cass were Secretary of State, James Buchanan of Pennsylvania and U.S. Supreme Court Justice, Levi Woodbury of New Hampshire. Cass won the nomination on the fourth ballot. Two ballots assured William O. Butler of Kentucky of the vice-presidential nomination.\n\n\n\nThe most contentious issue of the 1848 convention and campaign was slavery. A Democrat had introduced the controversial Wilmot Proviso into Congress, which, if passed, would have prevented the introduction of slavery into the western territories acquired from Mexico. Cass had favored the Wilmot Proviso, but later realized its divisiveness for the northern and southern states. His nomination may, in part, have been due to his choice to support the ambiguous position of Congressional and government nonintervention or “popular sovereignty” - leaving the choice for or against slavery to the territories themselves.\n\n\n\nThe Democratic platform set limits on federal power over commerce, internal improvements, and slavery, noting that “States are the sole and proper judges of everything appertaining to their own affairs.” The platform decried the concept of a national bank and applauded the Mexican war as “just and necessary.” The 1848 convention is noteworthy for the formation of a national committee which would attend to party business between conventions. Top of Page Home\n\n1852 DEMOCRATIC CONVENTION\n\nBenjamin F. Hallett of Massachusetts, the first national chairman, called the Democratic Party to order on June 1 - 5, 1852, again in Baltimore, Maryland. Procedural matters, including the retention of the two-thirds rule, were quickly handled. The balloting for the nomination, however, took two long days and 49 ballots. The major contenders were Lewis Cass of Michigan who had won the 1848 nomination along with James Buchanan of Pennsylvania, William L. Marcy of New York and the much younger Stephen A. Douglas of Illinois. Each candidate represented the views of a section of the fractionalized democratic party and traded front-runner status as the balloting continued, none gaining enough votes to meet the two thirds needed to win the nomination.\n\n\n\nIn pre-conference discussions New England Democrats had persuaded dark-horse candidate Franklin Pierce to consider running for the nomination. Pierce, an affable, undistinguished party follower with two terms in the House and one in the Senate, agreed - against his wife’s wishes to run for the nomination if a stalemate occurred. His name was entered on the thirty-fifth ballot as a compromise choice. He gained support in subsequent ballots and won on the forty-ninth vote. Senator William R. King from Alabama was chosen as the vice-presidential nominee.\n\n\n\nThe Democratic platform reiterated many of the party’s resolutions from the previous convention, including limits to the power of the federal government, the right of states to manage their own affairs and opposition to a national bank. Exhausted by years of wrangling over the economic, political and emotional issues of slavery, they resolved “That the democratic party will resist all attempts at renewing, in congress or out of it, the agitation of the slavery question, under whatever shape or color the attempt may be made.” Top of Page Home\n\n1856 DEMOCRATIC CONVENTION\n\nOn June 2 - 6, the delegates to the 1856 Democratic convention gathered in Cincinnati, Ohio. This was the first Democratic convention to be held outside of Baltimore. Three men were in contention for the party’s presidential nomination: President Franklin Pierce of New Hampshire, James Buchanan of Pennsylvania and Senator Stephen A. Douglas of Illinois. The Democratic Party platform consisted of two segments, with the domestic and foreign policy sections debated separately. Dominating the domestic section was the Democrats’ concept of a limited federal government and the slavery question. The foreign policy section expressed a nationalistic and expansionist spirit that was absent from previous Democratic platforms.\n\n\n\nAfter 15 ballots, none of the three candidates had received the number of votes necessary to win the nomination. On the 16th ballot, Stephen Douglas withdrew, and on the 17th roll call, James Buchanan received all 296 votes, securing the nomination. Buchanan was popularly known as “Old Buck.”\n\n\n\nOn the first ballot for the vice presidency, 11 individuals received votes. Representative John A. Quitman, Mississippi, led with 59 votes, followed by Representative John C. Breckinridge of Kentucky, with 50. Early in the second ballot, the New England delegations voted overwhelmingly for Breckinridge, resulting in his nomination for the vice presidency. Breckinridge was in the convention hall and announced his acceptance of the nomination. His presence for both of these events was unusual during the early conventions. Top of Page Home\n\n1860 DEMOCRATIC CONVENTION\n\nRarely in U.S. history has a convention been as tumultuous as the Democratic Party convention of 1860. It was clear that the explosive question of slavery would be the dominant issue. Delegates to the national Democratic convention met in Charleston, South Carolina on April 23 May 3. A bitter dispute between Northern and Southern delegates over the wording of the platform’s slavery plank resulted in a walkout by several dozen Southern delegates. The remaining delegates, led by Senator Stephen A. Douglas of Illinois, supported the Supreme Court decision in the 1857 Dred Scott case, which nullified the Missouri Compromise’s provisions giving Congress the authority to prohibit slavery in the territories. The convention adjourned on May 3 without making any nominations.\n\n\n\nOn June 18 - 23, the Democratic convention reconvened in Baltimore with less than two-thirds of the delegates to the original convention present. The delegates nominated Senator Douglas for president and Herschel V. Johnson, the former governor of Georgia, for vice president. The platform adopted acknowledged the difference of opinion on slavery among delegates to the Democratic Party and underscored that the party would abide by the decision of the Supreme Court regarding the question of congressional authority over the issue of slavery within the territories.\n\n\n\nThe Southern Democrats who had walked out of the convention in Charleston met later that June in Richmond, Virginia. Vice President John C. Breckinridge of Kentucky won the presidential nomination, and Senator Joseph Lane of Oregon was chosen as his running mate. Their platform supported slavery in the territories. The failure to reach agreement on the slavery question was the most disruptive sectional split in the history of U.S. political parties. Top of Page Home\n\n1864 DEMOCRATIC CONVENTION\n\nThe 1864 Democratic national convention was held in the Amphitheatre, Chicago, Illinois on August 29 - 31. George B. McClellan and George H. Pendleton were nominated as the presidential and vice presidential candidates.\n\n\n\nThe Democratic Party was splintered by opposing views of the ongoing Civil War. There had been no clear leader of the party since Stephen A. Douglas had died in 1861. Those party members wishing to see the Union preserved, even at the expense of war, allied themselves with the Republicans as War Democrats or Unionists. Other Democrats (anti-war, often called Copperheads) were willing to allow Southern independence including a return to antebellum conditions. The lack of success in local elections by the anti-war Democrats weakened their standing and the more moderate Democrats had a greater voice at the 1864 convention. These moderates were willing to allow Southern independence but realized this was an unpopular idea among the public and instead tried to play upon Northern discomfort with wartime restrictions and changes. They appealed to Northern white social and economic fears regarding emancipated African Americans.\n\n\n\nEven with the party being divided, Democrats attending the 1864 convention had high hopes of winning the upcoming election. The Republican Party was badly fractured along ideological lines as well and faced a restless northern populace and an increasingly unpopular war.\n\n\n\nGeorge B. McClellan, former commander of Union armies, was nominated on the first ballot. McClellan had not thought the war unwinnable, but believed Republican interference had cost the North victory in the field. Democrats could now offer McClellan as a patriot who had tried to win the war but now would end it by any means, even if it meant allowing the South its independence. George H. Pendleton, an anti-war Democrat, was chosen as McClellan’s running mate.\n\n\n\nThe party platform focused on the failure of the war, Republican excesses in the curtailing of individual and state’s rights, and called for an immediate armistice with the South. The platform decried the altering of pre-war racial balances through emancipation of slaves. McClellan would later disavow the peace before reunion platform plank, and instead called for reunion to be a condition of peace, in hopes of appealing to public sentiment. Top of Page Home\n\n1868 DEMOCRATIC CONVENTION\n\nThe 1868 Democratic national convention was held in Tammany Hall, New York, NY on July 4-9, 1868. Horatio Seymour and Francis P. Blair, Jr. were nominated as the presidential and voice presidential candidates.\n\n\n\nThe Democratic Party suffered from remaining internal fractures that did not split the party but caused party disharmony. The party’s depiction as the party of wartime disloyalty was an image rightly or wrongly reinforced by the fact it was more popular and stronger in the South. President Andrew Johnson, a War Democrat and Abraham Lincoln’s successor, sought to unify with other Democrats and was at odds with Republicans, who eventually impeached him. Reconstruction of the South and African American civil rights were important issues in 1868.\n\n\n\nAt the convention, Democrats emphasized their party’s stand for constitutional conservatism and advocacy of limited government. A petition presented by the Women’s Suffrage Association asking for the party’s support in gaining women the right to vote was not seriously considered. Economic issues in the 1868 platform such as lower taxes, a low tariff, and a plan to pay off the public debt were considered more important by the party. Slavery and secession were considered closed matters. Immediate restoration of Southern states to the Union, amnesty for political offenses, state regulation of suffrage, a reduction in the size of the military, and equal protections for native and foreign-born U.S. citizens were other platform planks. Convention attendees included William M. “Boss” Tweed, Clement L. Vallandigham, and former general Nathan Bedford Forrest, a founder of the Ku Klux Klan.\n\n\n\nEight nominees were considered for the presidential slot, including Horatio Seymour, Andrew Johnson, General Winfield Scott Hancock and Supreme Court Chief Justice Salmon P. Chase.\n\n\n\nAfter twenty-three ballots a reluctant Seymour won the nomination. Seymour was seen as an acceptable alternative for each faction rather than having to acquiesce to another’s candidate. Francis P. Blair, Jr., a close associate of President Johnson was quickly chosen as Seymour’s running mate. Top of Page Home\n\n1872 DEMOCRATIC CONVENTION\n\nDemocrats convened on July 9 - 10 in Baltimore, Maryland, for one of the strangest political conventions in history. In truth, the Democrats did not offer a candidate as the party was in deep disarray. Instead, the Democrats endorsed the presidential and vice presidential candidates representing the Liberal Republican Party, demonstrating their belief that this was the only way to defeat a second presidential term for Ulysses S. Grant. The Liberal Republican Party, which was short-lived, was created by members of the Republican Party who were disgusted with the corruption and policies of the Grant administration. In particular, the Liberal Republican Party objected to the “carpetbag” governments established in the South following the Civil War, advocating the restoration of home rule in the southern states.\n\n\n\nThe presidential candidate selected by the Liberal Republican Party and endorsed by the Democratic Party was Horace Greeley, who founded the New Yorker in 1834, and in 1841, the New York Tribune, which became one of the most influential dailies of the nineteenth century. Through editorials in his publications, Greeley advocated the rights of workingmen, promoted a protective tariff, encouraged development of the frontier, and opposed slavery. At the Democratic convention nominating speeches were forbidden and Greeley won on the first ballot with 686 votes of the allotted 732. Governor B. Gratz Brown of Missouri, again the Liberal Republican nominee for vice president, was the unanimous choice of the Democrats with 713 votes.\n\n\n\nDebate on the Democratic platform was limited to one hour, and once again the delegates endorsed the same platform approved by the Liberal Republic Party. Key elements of the platform included a call for the end of reconstruction and complete amnesty for citizens of the South, a limit on the powers of the federal government, civil service reform, adoption of a hard-money policy, and bringing to an end the policy of giving grants of public land to railroads and corporations. The platform was adopted by a vote of 671 to 62. In all, the delegates to the 1872 Democratic convention met, voted, and completed their work in a total of six hours. Top of Page Home\n\n1876 DEMOCRATIC CONVENTION\n\nThe 1876 Democratic Convention was held on June 27 - 29 in St. Louis, Missouri. This marked the first time that a national convention was held west of the Mississippi River. Reconstruction, the corruption of the Grant administration and the lingering sectional animosity between the North and the South following the Civil War were dominant themes at the convention.\n\n\n\nTwo governors, Samuel J. Tilden of New York and Thomas A. Hendricks of Indiana, were the principal contenders for the presidential nomination. Tilden, a proven reformer and enemy of corruption, was elected on the second ballot. Hendricks, the runner-up, was the nearly unanimous choice of the delegates for the vice presidency.\n\n\n\nDemocratic platform issues included a call for the repeal of the Resumption Act of 1875, a hard-money measure that called for the payment of Civil War bonds in coin rather than paper money, and extensive civil service reform. In addition, the platform called for restrictions on Chinese immigration and a new policy on the distribution of public land that would benefit homesteaders and not the railroads. Top of Page Home\n\n1880 DEMOCRATIC CONVENTION\n\nCincinnati, Ohio was the setting for the 1880 Democratic convention, which was held June 22 June 24 in the modernized Gothic Music Hall. As delegates walked into the hall’s auditorium, they were greeted with a gigantic blue and white streamer which read “OHIO GREETS THE NATION.” No one candidate stood out to the generally apathetic delegates. The decision of Samuel J. Tilden, the Democratic presidential candidate in 1876, not to seek renomination allowed new prospective candidates to emerge.\n\n\n\nOn the first ballot, General Winfield Scott Hancock, from Pennsylvania, took the lead in delegate votes. General Hancock had earned his reputation during the Civil War, earning the nickname “Superb” Hancock for his valiant stands in battle. Other nominees were Senator Thomas F. Bayard of Delaware, and former Representative Henry G. Payne of Ohio. General Hancock won on the second ballot, when the Wisconsin delegation spearheaded a series of vote switches that provided him with the votes needed for the nomination. The vice-presidential nomination had only one candidate, former Representative William H. English of Indiana, who was elected by acclamation.\n\n\n\nThe Democratic platform was approved without debate or opposition. It called for decentralization of the federal government with increased local government, currency based on hard money, a revenue only tariff, civil service reform, and an end to Chinese immigration.\n\n\n\nThe most severe language in the platform concerned the presidential election of 1876, which the Democrats had labeled “the great fraud.” In that election, the Democratic candidate Samuel J. Tilden had beaten Republican candidate Rutherford B. Hayes in the popular vote. Republican leaders challenged the vote results from Florida, Louisiana, and South Carolina on the grounds that African-Americans had been intimidated from going to the polls. Southern Republican election officials from the three states disqualified votes from Democratic precincts, thus providing a victory for Hayes. The turmoil and accusations of fraud resulting from the Hayes victory ultimately forced the Congress to determine the election outcome. A deal was made whereby Democratic Members of Congress agreed to the formation of an election commission that favored the Republicans in return for private assurances that federal troops would be withdrawn from the South. Hayes was officially declared president by the election commission on March 4, 1877. Top of Page Home\n\n1884 DEMOCRATIC CONVENTION\n\nChicago, Illinois, was the setting for the 1884 Democratic convention, which was held on July 8 11. A highlight of this convention was the extension of delegate voting rights to the District of Columbia and the U.S. territories. On the first day of the gathering, delegates from Tammany Hall, the New York political machine, attempted to break the unit rule which bound all delegates to their state convention and mandated that they vote as a unit. The Tammany Hall delegates were in the minority in the New York delegation. Their attempt to break the unit rule was defeated by the convention as a whole, thus limiting their powers and assuring the nomination of the Governor of New York, Grover Cleveland, a Tammany Hall enemy.\n\n\n\nGovernor Cleveland was the front runner for the presidential nomination after the first ballot. His opposition consisted of Senator Thomas F. Bayard of Delaware and former Senator Allen G. Thurman of Ohio. On the second ballot, a shift by the North Carolina delegation to Cleveland gave him the two-thirds majority needed to secure the nomination. Senator Thomas A. Hendricks of Indiana was nominated for the vice presidential half of the ticket, winning by an almost unanimous vote.\n\n\n\nThe platform produced by the Democrats in 1884 was one of the longest adopted by the Party during the nineteenth century, with a substantial portion containing a list of alleged Republican failures and misdeeds. The main issue in the Democratic platform concerned tariff revisions that would provide revenue for the federal government, but also protect and promote domestic industries. One of the tariff revisions called for taxes “bearing heaviest on articles of luxury, and bearing lightest on articles of necessity.” Other issues addressed in the platform expressed support for the rights of organized labor, and the continuation of restrictions on Chinese immigration into the United States. Top of Page Home\n\n1888 DEMOCRATIC CONVENTION\n\nThe Democratic convention assembled in St. Louis on June 5 - 7. The Democratic Party, in control of the White House for the first time since the beginning of the Civil War, renominated by acclamation the incumbent President Grover Cleveland. The country had been without a vice president since the death of Thomas A. Hendricks in 1885. Former senator Allen G. Thurman of Ohio was the favorite for the vice presidential nomination and won easily on the first ballot.\n\n\n\nTariff reduction was the predominant issue on the Democratic platform, along with tax reform. Growing divisions between conservative and populist wings of the Democratic Party threatened party unity. The conservative wing sought to place states rights at the top of the agenda, while the populist wing proclaimed that the free coinage of silver was the main issue.\n\n\n\nWhile president, Cleveland had also angered many Democratic partisans who believed that he had not made full use of his patronage powers to reward his Democratic supporters. Tammany Hall, the Democratic Party political machine that greatly controlled New York City politics, was a bitter foe of the reform-minded Cleveland. Its influence undermined his campaign in his home state of New York, denying him the state’s 36 electoral votes that would have assured his reelection. Top of Page Home\n\n1892 DEMOCRATIC CONVENTION\n\nThe 1892 Democratic convention met in Chicago, Illinois on June 21 - June 23 with frequent interruptions from storms and a leaky roof. Delegates all received special invitations to visit the Jackson Park fairgrounds of the World’s Columbian Exposition, the Chicago World’s Fair, to be dedicated in October of that same year.\n\n\n\nGrover Cleveland, having served as the 22nd President of the United States from 1885 to 1889, won a narrow first ballot victory over Governor David B. Hill of New York and Governor Horace Boies of Iowa, a former Republican and populist. Cleveland was vehemently opposed by his own New York delegation which was packed with Tammany Hall men, the New York political machine, supporting Governor Hill. Adlai E. Stevenson of Illinois, a former representative and assistant postmaster general, was the convention favorite for vice president, winning over Isaac P. Gray of Indiana who was favored by the Cleveland supporters.\n\n\n\nThe Democratic platform of 1892 called for the construction of a Central American canal through Nicaragua; opposed sumptuary laws (prohibition) as interference with individuals’ rights; supported antitrust laws, federal aid to education, improvement of the Mississippi River, and statehood for New Mexico and Arizona; demanded the rigid enforcement of the laws against Chinese immigration while denouncing attempts to restrict the immigration of the “industrious and worthy of foreign lands;” and straddled the currency debate with a policy favoring stable money and the coinage of both gold and silver equally. The sharpest platform debate focused on the tariff plank, ultimately calling for a tariff for revenue only and “denouncing Republican protection as a fraud, a robbery of the great majority of the American people for the benefit of the few. ... a fundamental principle of the Democratic party that the Federal Government has no constitutional power to impose and collect tariff duties, except for the purpose of revenue only, and we demand that the collection of such taxes shall be limited to the necessities of the Government when honestly and economically administered.” Top of Page Home\n\n1896 DEMOCRATIC CONVENTION\n\nChicago was the setting for the July 7 - 11,1896 Democratic convention. The issue of currency dominated the proceedings. The party was split along regional lines, with Eastern delegations favoring a hard-money policy with maintenance of the gold standard and most Southern and Western delegations supporting a soft-money policy with the unlimited coinage of silver. As a delegate to the convention, 36-year-old William Jennings Bryan of Nebraska was determined to write a free-silver plank into the party platform.\n\n\n\nIn perhaps the most memorable address ever delivered before a political convention, Bryan captivated the delegates with a blistering attack on the gold standard, stating, “You shall not press down upon the brow of labor this crown of thorns, you shall not crucify mankind upon a cross of gold.” Bryan’s speech moved him into the front ranks of candidates for the nomination. The other leading contender was Rep. Richard “Silver Dick” Bland of Missouri. William Jennings Bryan received enough votes to secure the nomination on the fifth ballot. With Bryan declining to indicate a preference for vice president, 16 candidates received votes for the office on the first ballot. On the fifth ballot, Arthur Sewell of Maine prevailed. Top of Page Home\n\n1900 DEMOCRATIC CONVENTION\n\nThe Democratic Convention of 1900 was held in Kansas City, Missouri. Although the meeting hall was destroyed by a fire on April 4, 1900, it was rebuilt in 90 days time to house the convention delegates and candidates on July 4 - 6. King David Kawananakoa, heir to the throne in Hawaii, was the first member of royalty to attend a political convention as a delegate at this event.\n\n\n\nWilliam Jennings Bryan received the presidential nomination unopposed, and allowed the delegates at the convention to choose his running mate. Seven names for vice-president were placed in nomination and two candidates withdrew prior to the balloting. Adlai E. Stevenson, who had served as Vice President under Grover Cleveland, led on the first roll-call vote and was selected as the vice-presidential nominee after a series of vote switches.\n\n\n\nThe Democratic Party platform of 1900 named anti-imperialism as the most important issue. The platform also denounced colonial policies enacted by the current Republican administration after the Spanish-American War and condemned post-war expansionism. During the 1896 campaign silver coinage and adoption of the gold standard were divisive issues. By 1900 discovery of additional gold deposits and an increase in currency diminished the silver issue. Although there was some controversy about the mention of silver coinage, Bryan threatened to withdraw his candidacy unless a silver plank was included in the platform. The silver plank was accepted without protest by the delegates. Top of Page Home\n\n1904 DEMOCRATIC CONVENTION\n\nThe Democratic convention convened in St. Louis on July 6 - 9, with the currency question still a major issue. Eight candidates were nominated for president. Alton B. Parker, chief justice of the New York Court of Appeals, was the conservative front-runner but was not supported by the still-influential William Jennings Bryan. Parker, who had not actively worked for the nomination, was supported by conservatives and the top officials of Tammany Hall. He was elected on the first ballot.\n\n\n\nFormer senator Henry G. Davis of West Virginia was nominated for vice president. At 81 years of age, he was the oldest major party candidate ever nominated for national office. Davis was a man of great wealth, and the Democrats hoped that he would give freely to their campaign.\n\n\n\nThe Democratic platform deliberately omitted reference to the currency issue; however, to make his position clear, Alton Parker, after his nomination, informed the convention by letter that he supported the gold standard. Additionally, the platform called for a reduction in government expenditures, a congressional investigation of corruption in the executive departments, construction of a Panama Canal, statehood for the Western territories and the direct election of senators. The convention ended July 9. Top of Page Home\n\n1908 DEMOCRATIC CONVENTION\n\nThe Democratic convention of 1908 was held July 7 - 10 in Denver. This was the first convention held by a major party in a Western state and the first national political convention to accredit women, with five women credentialed as delegates or alternate delegates. For a third time, the Democrats turned to William Jennings Bryan as their nominee. He was easily elected on the first ballot.\n\n\n\nBryan had learned a lesson from his stubborn silver fixation and advocacy against the gold standard during the campaign of 1900. He now advocated a more balanced and varied set of reforms reflecting the prevailing progressive mood. Bryan focused on his dedication to a social agenda, which insisted that material prosperity should be pursued and gained but accompanied by charitable programs for the poor. He insisted on only “necessary” taxation, advocated nationalization of the railroads and denounced U.S. imperialism by calling for independence for the Philippines.\n\n\n\nJohn W. Kern, a former gubernatorial candidate from Indiana, was chosen by acclamation to be Bryan’s running mate. The New York Times sarcastically described the compatibility of the Democratic ticket as follows: “For a man twice defeated for the presidency was at the head of it, and a man twice defeated for governor of his state was at the tail of it.” Top of Page Home\n\n1912 DEMOCRATIC CONVENTION\n\nThe 1912 Democratic Convention was held on June 25 - July 2 in Baltimore, returning to that city for the first time since 1872. There were a number of presidential candidates, including House Speaker Champ Clark of Missouri, Rep. Oscar W. Underwood of Alabama, Gov. Judson Harmon of Ohio and Gov. Woodrow Wilson of New Jersey. William Jennings Bryan was not a candidate himself, but as the titular head of the Democratic Party he was the key to the\n\nnomination. Six names were placed in nomination for the presidency. After 10 ballots, Champ Clark had the most votes, but when Bryan learned of Clark’s collaboration with the New York political machine Tammany Hall and Wall Street forces, he addressed the convention announcing that he was switching his support to Woodrow Wilson. On the 46th ballot, Wilson finally received enough votes to secure the nomination. The 46 roll call votes represented the highest number of presidential ballots taken at any convention, Republican or Democratic, since 1860.\n\n\n\nWilson preferred Oscar Underwood for vice president; however, the Alabama congressman was not interested in second place on the ticket. Wilson then agreed to accept the convention favorite, Gov. Thomas R. Marshall of Indiana.\n\n\n\nThe Democratic platform called for a lower, revenue-only tariff, as Democrats felt that the high cost of living was a result of the existing protective tariff. Passage of stronger antitrust legislation, regulation of the railroads, a constitutional amendment providing for a federal income tax, a workmen’s compensation law, stricter pure food and public health laws, extension of the presidential primary system, and a call for a single presidential term were all issues included in the 1912 platform. Top of Page Home\n\n1916 DEMOCRATIC CONVENTION\n\n\n\nSt. Louis was the setting for the 1916 Democratic convention, held June 14 - 16. Support for the renomination of President Woodrow Wilson was nearly unanimous. Wilson won on the first ballot with a vote of 1,092 ayes to 1 nay – the lone dissenting vote coming from an Illinois delegate who disapproved of a motion to nominate Wilson by acclamation. With Wilson’s approval, Vice President Thomas R. Marshall was renominated by acclamation.\n\n\n\nWilson had planned to showcase the theme of Americanism and national unity at the convention. Americanism was Wilson’s approach to the future role of the United States as a key world power. However, it was pacifism and Wilson’s commitment to keeping the United States out of the raging conflict in Europe that dominated the convention. By the second day, Wilson’s determined neutrality regarding the war became the theme of the convention, and the slogan “He kept us out of the war” became the battle cry of the delegates.\n\n\n\nThe Democratic platform included a call for military preparedness and the progressive reforms made by the Wilson administration, particularly with respect to tariffs, banking, labor and agriculture. The only section of the platform brought to a floor vote was the plank on women’s suffrage. The majority plank favored extending the vote to women, while a minority plank advocated leaving the matter to the individual states. The minority plank was defeated by a vote of 888 ½ to 181 ½. The Democratic position on women’s suffrage contrasted with that of the Republicans, who proposed leaving the matter up to the individual states. Top of Page\n\nHome\n\n1920 DEMOCRATIC CONVENTION\n\nSan Francisco hosted the 1920 convention on June 28 - July 6, the first time a convention of one of the major parties was held west of the Rockies. The November 1920 election would also be notable as the first election allowing women to vote for president. For the first time in a generation the party had no recognized leader such as Grover Cleveland, William Jennings Bryan or Woodrow Wilson. Retiring President Wilson’s refusal to endorse a candidate prevented the emergence of any one candidate as the front-runner.\n\n\n\nTwenty-four candidates received votes on the first presidential roll call, with no candidate reaching the 729 votes needed for the nomination. After several ballots, four candidates emerged as the leaders: William Gibbs McAdoo, Wilson’s son-in-law and former treasury secretary; Attorney General A. Mitchell Palmer; Gov. Alfred E. Smith of New York; and Gov. James M. Cox of Ohio. On the 44th ballot Governor Cox received 699 ½ votes, and with victory assured a motion was adopted to declare the Ohio governor the unanimous nominee. Cox’s choice for the vice presidential nomination, Franklin D. Roosevelt of New York, the 38-year old assistant secretary of the Navy, was nominated by acclamation.\n\n\n\nThe 1920 Democratic platform’s major plank expressed the party’s endorsement of the League of Nations as the “surest, if not the only, practicable means of maintaining the permanent peace of the world.” Additionally, the plank called for supporting President Wilson’s call for U.S. membership in the League. Enforcement of prohibition under the Volstead Act, the continuation of progressive reforms on labor, government regulation of industry and transportation, conservation and reclamation of natural resources and immigration were issues also included in the platform; however, praise of Wilson’s leadership and legislative accomplishments was the central theme. Top of Page Home\n\n1924 DEMOCRATIC CONVENTION\n\nNew York City’s old Madison Square Garden was the site of the 1924 Democratic convention. The convention convened on June 24th and adjourned on July 9th, a total of sixteen days making it the longest in American history. The prolonged brawl for the presidential nomination was the result of the conflict between the Party’s rural and urban factions. Candidate Governor Alfred E. Smith of New York represented the urban faction of the Democratic Party, which opposed Prohibition and the Klu Klux Klan. Former Treasury secretary William Gibbs McAdoo of California was the candidate of the rural faction, which supported Prohibition and tolerated the Klu Klux Klan. Fourteen other candidates were also nominated.\n\n\n\nOn Monday, June 30th, balloting for the presidential nominee began. After 69 ballots, William Gibbs McAdoo had the most votes, but not enough to secure the nomination. Negotiation began on compromise proposals to break the deadlock, but continuous balloting still could not produce a winner. Finally, after nine days and 103 ballots, a winner emerged, John W. Davis of West Virginia, a former Member of Congress and U.S. Ambassador to Great Britain. Davis’s core support came from rural delegates, but it was the votes of urban delegates that provided his margin of victory.\n\n\n\nThe vice presidential nomination was won by Governor Charles W. Bryan of Nebraska, the younger brother of William Jennings Bryan. One of the vice presidential nominees was Mrs. Lena Springs, a South Carolina delegate-at-large and chairman of the credentials committee, who would be the first woman to be proposed for vice-president of the United States. Mrs. Springs’ name was placed on the ballot by her fellow South Carolina delegates as a way to pay tribute to her service to the state of South Carolina as well as to the national Democratic Party.\n\n\n\nThe battle for the 1924 Democratic platform was almost as intense as the presidential nomination marathon conflict. The first subject of debate focused on American entry into the League of Nations, with the majority report favoring that entry be determined by a national referendum, and the minority report supporting American entry without reservation into the League of Nations and the World Court. After vigorous debate, the minority report was defeated by a vote of 742 ½ to 353 ½. The second contentious issue was the controversial religious liberties plank. Debate focused on the Klu Klux Klan, not mentioned in the majority report, but opposed by name in the minority report. Voting on this plank produced one of the closest votes in convention history, with the rural delegates supporting the majority report (thus supporting the Klu Klux Klan) and urban delegates supporting the minority plank. The minority report was defeated literally by a fraction of a vote, 543 7/20 to 543 3/20. Top of Page Home\n\n1928 DEMOCRATIC CONVENTION\n\nHouston, Texas was the site for the June 26 - 29, 1928 Democratic national convention marking the first time since 1860 the party met in a southern city. Four term Governor of New York, Alfred E. Smith, was the frontrunner for the presidential nomination. William Gibbs McAdoo, Smith’s main competitor, dropped out of the race in the interest of promoting party unity. On the first ballot Governor Smith came within ten votes of the required two thirds needed to win the nomination. Ohio then switched its forty-four votes to Smith making him the nominee and the first Roman Catholic nominated for President. Senate Minority Leader Joseph T. Robinson of Arkansas was nominated on the first ballot for vice president.\n\n\n\nThe Democratic platform focused on agriculture more than any other issue. Agriculture was the most depressed part of the economy in 1928. The Democrats called for the establishment of a Federal Farm Board to oversee loans to farmers. On foreign policy the platform favored keeping the United States out of entangling political alliances, including the League of Nations, and mentioned specifically Latin America. The Republicans were criticized for their ineffective sponsoring of weak disarmament agreements. The Democrats proposed the establishment of major public works programs to help resolve the unemployment problem. Flood control projects were specifically mentioned as being a priority in a Democratic administration. Top of Page\n\nHome\n\n1932 DEMOCRATIC CONVENTION\n\nThe Democrats came to the 1932 convention in Chicago hopeful that their presidential candidate would have a very good chance of unseating President Herbert Hoover. The convention, held June 27 - July 2 began with Franklin D. Roosevelt controlling a majority of the delegates. The Roosevelt forces argued for abandonment of the rule that required two-thirds of the delegates to vote for a candidate in order for him to become the nominee. However, Roosevelt dropped this demand when it became clear that he risked losing the support of Southern states. The first ballot, held in the early morning of July 1, showed Roosevelt ahead of Alfred E. Smith and John Nance Garner with 666 delegate votes; 777 votes were needed for nomination. On the evening of July 1, during the fourth ballot, Garner released his delegates and quickly there was a movement to make Roosevelt the nominee. He won on that ballot with 945 votes. Garner was the unanimous choice for vice president.\n\n\n\nRoosevelt broke a tradition by coming to Chicago to appear before the convention and accept the nomination. His speech promised Americans a “New Deal” that would change political institutions in Washington forever to better serve the people. The platform included proposals for federal unemployment relief for the needy and new public works projects to provide jobs. There was also a plank calling for the repeal of Prohibition. Top of Page Home\n\n1936 DEMOCRATIC CONVENTION\n\nThe 1936 Democratic convention was held in Philadelphia June 23 - 27. President Franklin D. Roosevelt and Vice President John Nance Garner were renominated by acclamation. The major issue at the convention, initiated by President Roosevelt, was the elimination of the rule requiring a candidate for President to receive votes from two-thirds of the delegates. Starting in 1936 a nominee only needed the support of a majority of the delegates. President Roosevelt appeared in person to accept the party’s nomination. In his acceptance speech Roosevelt declared that this generation of Americans has a rendezvous with destiny.\n\n\n\nThe Democratic platform in 1936 emphasized the success of expanded federal public works programs to help resolve unemployment. It stated that the federal government should continue to stimulate private industry, resolve labor disputes, and oppose monopolies through the vigorous enforcement of anti-trust laws. The agricultural policies of the Roosevelt administration were credited with doubling the net income of farmers. It vowed that programs to reduce the indebtedness of farmers would be maintained. National defense was not specifically mentioned in the platform. The foreign policy of the United States was based on neutrality in foreign disputes and the continued expansion of foreign trade. Top of Page Home\n\n1940 DEMOCRATIC CONVENTION\n\nWhen the delegates to the Democratic Convention of 1940 met in Chicago on July 15 -18, the prospect of U.S. involvement in the conflict in Europe was the major influence upon presidential politics. Franklin Delano Roosevelt had already served two terms as president and had indicated ambivalence about seeking a third term. As the threat to U.S. security increased and the party appeared to be unable to find an adequate New Deal proponent as a successor to Roosevelt, the president began to indicate that he would accept the nomination for a third term in office. This would break the precedent set by the first president, George Washington, to serve only two terms.\n\n\n\nOn the third day of the convention, Roosevelt won easily on the first ballot. Although the delegates, who included seven African-Americans, were pleased to have President Roosevelt at the top of the ticket, they did not want his choice for vice president, Agriculture Secretary Henry A. Wallace of Iowa. A former Republican and a leading liberal, Wallace was unacceptable to conservative Democrats. Delegates felt that the vice presidential nomination should be decided by the convention. A personal appearance at the convention by the first lady Eleanor Roosevelt and a threat by the president that he would not accept the nomination for president, persuaded delegates to vote for Henry Wallace. With so many of the delegates unhappy with the vice presidential nominee, Wallace was asked not to address the convention.\n\n\n\nThe party platform, adopted without a roll call vote, was divided into three sections. The first addressed U.S. military preparedness and foreign policy; the second outlined the benefits of the New Deal for the agricultural, labor and business segments of the economy; and the third enumerated New Deal welfare measures. The convention closed with the delegates listening to a radio address by Roosevelt, who stated that he had not wanted the nomination but accepted it because the existing world crisis called for personal sacrifice. Top of Page Home\n\n1944 DEMOCRATIC CONVENTION\n\nThe Democratic convention was held in Chicago July 19 - 21 and renominated President Roosevelt for an unprecedented fourth term. However, Vice President Henry A. Wallace was not renominated for his office. Acknowledging there was dissent in the party concerning Wallace, Roosevelt refused to publicly support anyone. Wallace received the most votes on the first ballot, but Missouri Senator Harry S. Truman was a strong second. On the second ballot Truman passed Wallace, but he did not receive a majority. However, Alabama shifted its votes to Truman and this started a bandwagon of support for his candidacy. Roosevelt stated that he was happy to have Truman as his running mate.\n\n\n\nThe platform of the Democratic Party pledged the successful completion of the great crusade to end tyranny in the world and proposed the establishment of a United Nations organization to provide a forum for the peaceful resolution of conflicts between nations in the future. It acknowledged that the United States had built the best trained and equipped army in the world, the most powerful navy in the world, and the greatest air force in the world. It called for legislation to assist the transition of ex-servicemen and women to civilian life with special consideration for the disabled. It favored unrestricted Jewish immigration to Palestine and the establishment there of a free and democratic Jewish state. It called for maximum self government in Alaska, Hawaii, and Puerto Rico and for the extension of the right of suffrage to the people of the District of Columbia. Top of Page Home\n\n1948 DEMOCRATIC CONVENTION\n\nDelegates attending the 1948 Democratic convention, which met July 12 - 14 in Philadelphia, were in a somber mood. Franklin D. Roosevelt had died in office in 1945; the Republicans had regained control of Congress in 1947; and Harry S. Truman, who succeeded to the presidency after less than two months as vice president, had not been able to stop the loss of massive numbers of liberals and Southern conservatives from the New Deal coalition. The displeasure of Southern delegates with the national policies of the Democratic Party intensified at the convention, with the civil rights issue becoming the source of heated debate among the delegates.\n\n\n\nWhen the presidential balloting began, 13 members of the Alabama delegation and the entire Mississippi delegation withdrew from the convention in opposition to the party’s stand on civil rights. This did not prevent President Truman from winning a clear majority on the first ballot, defeating Georgia Senator Richard B. Russell, who received the votes of more than 90 percent of the remaining Southern delegates. Kentucky Senator Alben W. Barkley, the keynote speaker at the convention, was nominated for vice president by acclamation.\n\n\n\nThe fight over the civil rights issue in the Democratic Party platform brought national attention to the young mayor of Minneapolis, Hubert Humphrey. He led the successful fight for a civil rights plank, which asserted that “racial and religious minorities must have the right to live, the right to work, the right to vote, the full and equal protection of the laws on a basis of equality with all citizens as guaranteed by the Constitution.” The Southern delegates who had walked out of the convention met three days later in Birmingham, Alabama, along with other invited Southern Democrats. They formed the States’ Rights Party, known as the Dixiecrats, and elected Gov. J. Strom Thurmond of South Carolina as their candidate for president. Top of Page Home\n\n1952 DEMOCRATIC CONVENTION\n\nThe 1952 Democratic convention in Chicago on July 21 - 26 was marked by a sitting president who, constitutionally, could have run for reelection but instead chose retirement. A fractious floor fight over both the seating of alternative delegations and a requirement that all delegations take an oath of allegiance to the party and its platform were highlights of the convention. There was much behind-the-scenes maneuvering of party leaders to select a candidate who would be acceptable to both the Northern liberal and Southern conservative factions, thereby avoiding a schism similar to 1948, when a splinter group of Democrats nominated Governor Strom Thurmond of South Carolina to run as the States’ Rights (Dixiecrat) Party’s nominee.\n\n\n\nPresident Truman declined to make an early endorsement, and 11 candidates were nominated, including Governor Adlai Stevenson, who was drafted as the compromise candidate. Senator Estes Kefauver of Tennessee, who had great success in the primaries but was running without party support, and Senator Richard Russell of Georgia were also on the ballot. After placing second to Kefauver on the first two ballots, Stevenson was nominated on the third. He chose Senator John Sparkman of Alabama as his vice presidential running-mate, who was nominated by acclamation.\n\n\n\nThe platform included planks on continuing agricultural price supports, repeal of the Taft-Hartley Act, which greatly restricted labor union activities, and the eradication of discrimination -- basically, a continuation of the programs of Roosevelt and Truman. There were also speeches vigorously defending the Korean War. Top of Page Home\n\n1956 DEMOCRATIC CONVENTION\n\nThe Democratic National Convention was held in Chicago on August 13 - 17, 1956. Adlai E. Stevenson, the unsuccessful 1952 Democratic candidate, easily won nomination on the first ballot. In an unusual move, Stevenson decided not to choose a running mate, but to leave the selection to the convention. The major candidates for Vice President on the first ballot were Tennessee Senator Estes Kefauver, Massachusetts Senator John F. Kennedy, Tennessee Senator Albert A. Gore, New York City Mayor John F. Wagner, and Minnesota Senator Hubert H. Humphrey. Kefauver won the first ballot but fell short of the 687 votes needed to nominate. Kennedy won the second ballot with 618 votes. Following the second ballot Gore withdrew and gave his support to Kefauver. This started a bandwagon movement for Kefauver that led to his winning the nomination.\n\nThe Democratic platform in 1956 criticized the Republicans for destabilizing world peace by reducing the strength of U.S. armed forces. It stated that the survival of democracy worldwide required stronger leadership by the United States and better coordination in defense relationships with U.S. allies. The problems mentioned included aggressive actions by the Soviet Union, the tragedy of Cyprus, French forces in North Africa, Israeli-Palestinian relations, and the growth of anti-Americanism in Asia. Although the United States was the most prosperous nation in the world, the Democrats argued that the economic growth rate was less under the Republicans than under the Roosevelt and Truman administrations. Top of Page Home\n\n1960 DEMOCRATIC CONVENTION\n\nThe 1960 Democratic convention met on July 11 - 15 in Los Angeles -- the first time that a national political convention was held there. The front-runner for the presidential nomination was Massachusetts Senator John F. Kennedy, having won each of the seven primaries he entered and whose support from Democratic Party urban leaders was strong. Kennedy’s principal rival was Senate Majority Leader Lyndon B. Johnson of Texas, but also in the running was Adlai E. Stevenson, the party’s presidential nominee in 1952 and 1956. Kennedy won on the first ballot. This was the first time since 1920 that a senator had been nominated for the presidency by either the Democrats or the Republicans and the first time since 1928 that a Roman Catholic was chosen to lead a national ticket for one of the two major parties.\n\n\n\nSenator Kennedy’s choice for a running mate was Lyndon Johnson, whose nomination was approved by acclamation. This choice was a surprise to many liberals, but Kennedy chose Johnson to improve his prospects in the South, particularly in Texas, which would be a key state in the election. It was also said that Kennedy wanted to get Johnson out of the Senate so that he would be unable to hinder or undermine Kennedy’s legislative agenda.\n\n\n\nIssues on the Democratic platform included national defense, disarmament, civil rights, immigration, foreign aid, the economy, labor and tax reform. It was the longest platform yet written by the party. The greatest controversy was caused by the civil rights plank. Senator Sam J. Ervin Jr. of North Carolina introduced motions to delete several portions including ones to set 1963 as the deadline for the initiation of school desegregation plans, to make the Civil Rights Commission a permanent agency, and to grant the attorney general the power to file civil injunction suits to prevent discrimination. Speaking in favor of the civil rights plank was delegate and future member of Congress Patsy Mink of Hawaii, who gave an impassioned speech before 10,000 delegates and a national television audience. Senator Ervin’s motions were defeated by voice vote and the entire plank was approved by a vote of 66-to-24. Top of Page Home\n\n1964 DEMOCRATIC CONVENTION\n\nThe 1964 Democratic National Convention met in Atlantic City, New Jersey on August 24 - 27. In attendance were 5,260 delegates and alternates. The nomination of the incumbent Lyndon B. Johnson, who had assumed the presidency after the assassination of President John F. Kennedy the previous year, was not in question. Johnson and his vice-presidential choice, Minnesota senator Hubert H. Humphrey, were nominated by acclamation, without roll call votes (previously only the 1936 Democratic convention had used this approach). The lengthy platform document was designed for broad appeal and was moderate in tone, condemning extremism of both right and left and praising the accomplishments of the Kennedy-Johnson administrations. A convention highlight was Attorney General Robert F. Kennedy’s speech introducing a documentary film about his late brother’s achievements as president.\n\n\n\nA contentious issue at the convention was the seating of the delegation from Mississippi. The recently formed Mississippi Freedom Democratic Party sent a racially integrated delegation to the convention, contesting the legitimacy of Mississippi’s all-white delegates chosen in the regular Democratic primary since African Americans had been prevented from registering to vote. The credentials committee of the convention listened to eloquent testimony (notably from civil rights activist Fannie Lou Hamer) concerning racial discrimination in the electoral process and stipulated that future conventions would not accept delegates chosen through discriminatory procedures. As a compromise, the credentials committee offered two at-large seats to the Mississippi Freedom Democratic Party delegation. Top of Page Home\n\n1968 DEMOCRATIC CONVENTION\n\nThe 1968 Democratic convention met on August 26 - 29 in Chicago, with protestors and police clashing in the streets over the Johnson administration’s policies concerning the Vietnam War and unprecedented security precautions instituted at the International Amphitheater. The 1968 assassinations of Rev. Martin Luther King Jr. and Sen. Robert F. Kennedy and the race riots in more than 100 hundred cities following the King assassination all combined with the protest over the Vietnam War to make this the most divisive and contentious Democratic convention since the Civil War.\n\n\n\nWith the decision by President Lyndon B. Johnson not to seek reelection, the three major candidates were Vice President Hubert H. Humphrey, Sens. Eugene J. McCarthy of Minnesota and George McGovern of South Dakota. Humphrey won on the first ballot by winning the votes of party moderates, Northern big-city political organizations and Southern conservatives. Also receiving votes on the first ballot was the Rev. Channing E. Phillips of the District of Columbia, who became the first African-American ever nominated for the top of the ticket at a national convention.\n\n\n\nHumphrey chose Maine Sen. Edmund S. Muskie as his running mate, whose nomination was approved by acclamation before the balloting was complete. A film tribute to Robert Kennedy was shown to the delegates prior to the vice presidential nomination, sparking a prolonged standing ovation and the singing of “The Battle Hymn of the Republic.”\n\n\n\nPrior to the heated debate over the platform and the nomination process, the convention committee had fought over what was known as the “unit rule.” This rule allowed some states to instruct that the entire vote of their delegation be cast as determined by the majority of the delegates. For more than a century this rule had been enforced at national Democratic conventions, but the supporters of McCarthy attacked the rule as a device for denying representation of minority viewpoints. Humphrey had indicated his support for reform of this rule, and ultimately the convention approved a motion to abolish it at the 1968 convention, and forbidding its use in future years. The defeat of the rule allowed the seating of a number of disputed Southern delegations that had faced credentials challenges, in particular a new Mississippi Democratic loyalist group, whose membership included the American voting rights activist and civil rights leader Fannie Lou Hamer.\n\n\n\nThe 1968 Democratic platform, which contained planks on many issues, including crime, gun control, housing, welfare reform and foreign policy, was not contested by the delegates on any issue except the U.S. policy in Vietnam. The administration plank did not support a halt to the U.S. bombing of North Vietnam or a withdrawal of U.S. troops before the end of the war. A minority plank, drafted by McCarthy and McGovern, called for an immediate halt to the bombing and a negotiated troop withdrawal. The bitter debate on these two proposals raged over two days, with the final roll call vote defeating the minority plank by a vote of 1, 567 ¾ to 1,041 ¼. Top of Page Home\n\n1972 DEMOCRATIC CONVENTION\n\nThe Democratic national convention was held in Miami Beach, Florida on July 10 - 13, 1972, with 3,203 delegates attending. Rules changes dramatically increased the participation of women, youth, and blacks. In the primaries the major candidates were South Dakota Senator George McGovern, former Vice President Hubert Humphrey, and Maine Senator Edmund Muskie. On the first day of the convention challenges to the seating of McGovern delegates won in the primary were settled in favor of McGovern. The next day Humphrey and Muskie withdrew from the race which assured McGovern the nomination. McGovern won the nomination on the first ballot with the support of 1,865 delegates. McGovern chose Missouri Senator Thomas Eagleton as his running mate. Eagleton won the nomination for Vice President with 1,742 votes on the first ballot. Ten days after the convention Eagleton disclosed that he voluntarily had hospitalized himself three times between 1960 and 1966 for nervous exhaustion and fatigue. The controversy caused by this disclosure led to Eagleton’s withdrawal from the ticket. McGovern then chose R. Sargent Shriver to be his Vice Presidential running mate.\n\n\n\nThe 1972 platform of the Democratic Party called for the unconditional withdrawal of all U.S. forces from Vietnam. It stated that the war had cost the lives of 50,000 soldiers, drained more than $150 billion in resources, and inflicted untold damage to the national will. It called for the overhaul of the current welfare system to guarantee each family receiving federal support had an income substantially above the poverty level. The platform called for handgun legislation to include a ban on Saturday night specials; favored the passing of an Equal Rights Amendment, and called for the elimination of the electoral college in order to give every voter a direct and equal voice in Presidential elections. Top of Page Home\n\n1976 DEMOCRATIC CONVENTION\n\nOn July 12 - 15 the Democratic convention met in New York City with delegates showing a unity that had not been present during the turbulent and conflict-ridden conventions of 1968 and 1972. Former Georgia governor Jimmy Carter, a dark-horse candidate who had surprised everyone by winning the Iowa and New Hampshire primaries, came to the convention with more than the 1,054 delegates needed to win the presidential nomination. Carter, a moderate, pledged to restore honesty and integrity in government. This appealed to the delegates in the aftermath of the Watergate scandal, which had resulted in the resignation of President Richard Nixon in 1974. Carter won on the first ballot with 2,238½ votes. His closest rivals were Representative Morris Udall of Arizona and Governor Jerry Brown of California. Carter’s perception as a unity candidate was cemented with the image, broadcast on national television, of Carter, George Wallace, Coretta Scott King and other prominent African-Americans joining him on the victory platform.\n\n\n\nJimmy Carter’s choice for a running mate was Senator Walter F. Mondale of Minnesota, who had impressed Carter with his experience and political philosophy. Mondale won overwhelmingly on the first ballot, but two other individuals received votes: House Speaker Carl Albert of Oklahoma and Representative Barbara C. Jordan of Texas, an African-American who had given a memorable keynote speech.\n\n\n\nThe platform was designed to be noncontroversial and consisted of wide-raging Democratic goals, as opposed to specific legislative initiatives and hard-line stands on issues. Democrats were determined to avoid the platform fights on divisive issues that had crippled the party in the two previous elections. Specific goals in the platform called for a comprehensive national health insurance system with universal and mandatory coverage, welfare reform, a commitment to the environment, energy conservation, the exploration and development of new energy sources and support for ratification of the Equal Rights Amendment. Top of Page Home\n\n1980 DEMOCRATIC CONVENTION\n\nThe 1980 Democratic Convention met in New York City on August 11 - 14, with President Jimmy Carter facing a strong challenge from Senator Edward M. Kennedy of Massachusetts for the presidential nomination. Runaway inflation, high interest rates and slow economic growth, coupled with the continuing Iranian hostage crisis and the Soviet Union’s invasion of Afghanistan, were issues and events that had dominated Carter’s presidency. Carter’s preoccupation with both foreign and domestic crises had resulted in his presidential campaign being conducted from the White House instead of on the road. Although Kennedy had not won the required number of delegates in the primaries and caucuses, he attempted to take the nomination from Carter by working to defeat a rule adopted by the Democratic National Committee in 1978 and on the agenda for adoption at the 1980 convention.\n\n\n\nThe proposed rule bound delegates to vote on the first ballot for the candidates to whom they were pledged during the primaries and caucuses. After much debate and behind-the-scenes maneuvering, the rule finally came to a vote. The attempt to overturn the proposed rule was defeated, resulting in Kennedy’s announcement that his name would not be placed in nomination. President Carter won renomination on August 13, with Senator Kennedy making an awkward and brief appearance on the platform with Carter to give the appearance of party unity. Walter Mondale was renominated for vice president with no opposition.\n\n\n\nConflict between the Carter and Kennedy camps over the 1980 Democratic platform was as intense as the struggle for the presidential nomination. The battle over the platform was one of the longest in convention history, filling 17 hours of debate and roll call votes that stretched over two days. Senator Kennedy succeeded in crafting the party platform to reflect his liberal ideology in the platform planks, particularly with respect to economic policy. Kennedy’s rousing speech to the delegates on behalf of his economic minority plank provided the most exciting moments of the convention, prompting a 40-minute emotional demonstration on the convention floor. Top of Page Home\n\n1984 DEMOCRATIC CONVENTION\n\nThe 1984 Democratic convention met in San Francisco on July 16 - 19 with 3,933 delegates in attendance. A difficult and contentious primary season had ended only on June 5, when a final round of primaries gave the victory to Walter Mondale, Jimmy Carter’s former vice president. Among the strong competitors had been Gary Hart, former Colorado senator, and Jesse Jackson, a civil rights leader from Chicago who hoped to build a “rainbow coalition” of diverse supporters.\n\n\n\nFor the first time, as a result of reforms completed in 1982 by the Hunt Commission, the Democrats admitted to the 1984 convention a new group of “superdelegates,” Democratic Party leaders and elected officials who attended the convention as uncommitted delegates and controlled about 14 percent of the ballots. The Hunt Commission was named for its chairman, Gov. Jim Hunt of North Carolina. The commission was formed to address the bitter fight over the nomination in 1980, when Sen. Edward Kennedy challenged President Jimmy Carter.\n\n\n\nMondale selected as his vice president New York Rep. Geraldine A. Ferraro, the first woman to run on the presidential ticket of a major party. New York Gov. Mario Cuomo delivered the keynote address. The lengthy platform document pledged to reduce the budget deficit, particularly that portion resulting from increased military spending sponsored by incumbent President Ronald Reagan, to make the tax system fairer to disadvantaged and middle-class socioeconomic groups and to control health care costs. The platform opposed passage of a balanced budget amendment to the Constitution and supported the Equal Rights Amendment and abortion rights for women. Top of Page Home\n\n1988 DEMOCRATIC CONVENTION\n\nIn 1988 the Democratic National Convention was held in Atlanta, Georgia on July 18 -21. Massachusetts Governor Michael Dukakis had won enough delegates in the primaries to guarantee his nomination for President. The only controversy at the convention concerned Jesse Jackson’s bid for the Vice Presidential nomination. Dukakis had chosen Texas Senator Lloyd Bentsen for a running mate. Jackson, however, had won the second largest number of delegates in the primaries. In a meeting with Dukakis and Bentsen on July 18, Jackson agreed to support the ticket in the interest of party unity. It was also agreed that Jackson’s name would be placed in nomination. The vote on the first ballot was 2,876 for Dukakis and 1,219 for Jackson.\n\n\n\nThe Democratic platform emphasized the need for a national health care program which would provide federal coordination to restrain rising health care costs while insuring quality care for all Americans. It pledged to better balance national priorities to increase federal funding for education. It called for the establishment of a national office to coordinate federal, state, and local efforts to control illegal drugs. It criticized the Republicans for wasting money on unnecessary weapons and advocated investing more money in training the armed forces for various types of conflicts. It called for a stronger national policy to promote peace in the Middle East. Top of Page Home\n\n1992 DEMOCRATIC CONVENTION\n\nDemocrats meeting in New York City on July 13 - 16 sought to nominate a candidate who would reverse their presidential fortunes after 12 years of Republican control of the White House. Delegates felt that the way to win the presidency was to nominate a party moderate and adopt a platform largely influenced by the centrist ideas of the Democratic Leadership Council. The DLC had been established almost a decade earlier in an effort to move the party from the left to a more centrist viewpoint. Arkansas Governor Bill Clinton, who had taken a leading role in building the DLC and used it to become a key player in the party, came to the convention as the leading candidate for the nomination. Other candidates on the ballot were former California Governor Edmund G. “Jerry” Brown Jr. and former Massachusetts Senator Paul E. Tsongas.\n\n\n\nBill Clinton was formally nominated by New York Governor Mario M. Cuomo, who saluted him as the “comeback kid,” a reference to his comeback after the loss of the New Hampshire primary and media attention on allegations of infidelity and his lack of service in the Vietnam War. Clinton won by a vote of 3,372 votes, and subsequently the nomination was approved by acclamation. He surprised the delegates by selecting as his running mate another Southerner, Tennessee Senator Albert Gore Jr. The Clinton-Gore ticket was the youngest in the 20th century, with Clinton, age 45, and Gore, age 44.\n\n\n\nDemocratic women played a major role at the convention, with the opening program highlighting leading female Senate candidates and the discussion of issues of concern to women from the podium. In a change from the usual single keynote speaker, the delegates heard three keynote addresses: Senator Bill Bradley of New Jersey, Governor Zell Miller of Georgia and former Texas representative Barbara Jordan. The Democratic platform reflected the new centrist philosophy emphasizing the need for economic growth, use of military force overseas when necessary, a cutoff of welfare benefits after two years and support for the right of states to enact death penalty statutes. Top of Page Home\n\n1996 DEMOCRATIC CONVENTION\n\nThe 1996 Democratic national convention was held in Chicago on August 26 - 29. The highlight of the convention was the renomination of President Bill Clinton and Vice President Al Gore.\n\n\n\nFormer Reagan press secretary James Brady and actor Christopher Reeve appeared on the first night of the convention. Brady, paralyzed by a bullet in a 1981 assassination attempt on Reagan, praised Clinton’s gun control legislation and called for increased action to reduce gun violence. Reeve, paralyzed by a horse riding accident in 1995, spoke for expanded research into diseases such as multiple sclerosis, Parkinson’s disease, spinal cord injuries, and AIDS. The second night of the convention featured an emphasis on families. It ended with a speech by First Lady Hillary Clinton on family values. On the third night Vice President Al Gore spoke about the Democratic Party leading the nation into the 21st Century. The voting for President that night resulted in Clinton receiving the unanimous support of the convention’s delegates. On the fourth night President Clinton addressed the convention and highlighted his first administration’s achievements.\n\n\n\nThe Democratic platform in 1996 proposed ending deficit spending by the U.S. government and balancing the federal budget. This proposal was accompanied by a pledge to maintain Social Security and Medicare at the levels needed by the public. In education, the federal government should promote national standards for primary and secondary schools to guarantee students have learned the skills required to advance to the next grade. In welfare, attempts should be made to get people into respectable jobs and reduce the number in need of public funds. Environmental protection was also advocated, especially protection of the National Parks and opposition to new offshore drilling in environmentally critical areas. Top of Page Home\n\n2000 DEMOCRATIC CONVENTION\n\nThe 2000 Democratic convention convened in Los Angeles, California, August 14 - 17, to nominate Vice President Albert \"Al\" Gore, Jr., as the Democratic presidential candidate. Gore had served two terms with President Bill Clinton as his vice president (1993-2000), and had represented the state of Tennessee as both a member of the House of Representatives and the Senate from 1976 through 1992. During the presidential campaign of 2000, Gore had secured the presidential nomination by defeating former New Jersey senator Bill Bradley in the Democratic primaries. Gore's name was the only one placed in nomination and on the ballot at the convention, and he won by a total of 4,339 votes. Gore's name was placed in nomination by his friend, Harvard roommate and Hollywood actor Tommy Lee Jones, and Gore was introduced by his wife, Tipper, before making his acceptance speech.\n\n\n\nGore had chosen Senator Joseph Lieberman of Connecticut as his vice presidential running mate. Lieberman was the first Jewish American to run on a major party's national ticket. Serving in the Senate since 1988, Lieberman had earned a reputation as a centrist who worked well with both Democratic and Republican members of Congress. Senator Lieberman was unanimously approved by the convention delegates by voice vote.\n\n\n\nThe 2000 Democratic platform included planks on fiscal discipline, education, health care, campaign finance reform, support for a woman's right to choose, protecting and strengthening Medicare, fighting crime, transforming the military, and valuing families. No floor fights occurred over any of the platform planks; however, outside the convention hall protestors demonstrated, sometimes violently, during all four days of the convention. Protest groups included pro-life supporters, homeless activists, anti-globalization protestors, and anarchists. Top of Page Home\n\n2004 DEMOCRATIC CONVENTION\n\nThe 2004 Democratic national convention was held at the Fleet Center in Boston, Massachusetts, July 26 - 29, amid concerns about terrorism, protests, and impossibly snarled traffic, the latter due to the closure of major traffic arteries near the convention center. Enhanced security and a designated area for protesters, at some distance from the convention proceedings and surrounded by a fence topped with razor wire, added to the controversy.\n\n\n\nThe opening address was delivered by former President Bill Clinton and the keynote address by Barack Obama, at the time a candidate for the United States Senate in Illinois. Other notable speakers included former President Jimmy Carter, Senator Hilary Clinton of New York, former Vice President and 2000 Democratic nominee Al Gore, Reverend Al Sharpton, and retired General John Shalikashvili, former chairman of the Joint Chiefs of Staff. The speeches addressed the foremost topics of terrorism and the war in Iraq, health care, taxes, and economic revival. Perhaps the most poignant speech was given by Ron Reagan, son of former President Ronald Reagan who had died a month earlier of Alzheimer’s disease. Reagan urged the delegates to support increased funding for stem cell research.\n\n\n\nThe Democratic nominee for President was Senator John Kerry of Massachusetts, who had fought an uphill battle to win the Party’s nomination against a large field of candidates. Senator John Edwards of North Carolina was Kerry’s choice for the vice presidential half of the ticket. Major planks in the Democratic Party platform (which was accepted unanimously) included energy independence, environmental protection, strengthening the military, and homeland security. Top of Page Home\n\n2008 DEMOCRATIC CONVENTION\n\nDenver, Colorado, was the site of the 2008 Democratic Convention, held on August 25-28. The last time that Denver had hosted a national political convention was in 1908, when the Democratic Party nominated William Jennings Bryan as their candidate for president. The 2008 Democratic Convention was historic for two reasons – Senator Barak Obama of Illinois, an African-American, won the nomination for president, and New York Senator Hillary Clinton’s name was placed in nomination in recognition of her momentous achievement in winning 1,896 delegate votes and over 18,000,000 popular votes in the state presidential primaries and caucuses. Senator Obama had secured the nomination prior to the convention by winning 2,201 of the 2,118 delegate votes needed to win. During the roll call of the states on Wednesday, August 27th, Senator Clinton stood among the New York State delegation on the convention floor and asked that the convention suspend the rules and nominate Senator Obama by acclamation.\n\n\n\nSenator Obama selected Senator Joseph “Joe” Biden from Delaware as his vice presidential running mate. Senator Biden was first elected to the Senate in 1972 and is a past chairman of the Senate Judiciary Committee and the current chairman of the Senate Foreign Relations Committee. Initially a candidate for president in the 2008 campaign, Biden ended his run for the presidency in January of 2008. Senator Biden’s nomination for vice president was also approved by acclamation by the convention delegates.\n\n\n\nHighlights of the 2008 Democratic Convention included speeches by former President Bill Clinton, Senator Hillary Clinton, and Michelle Obama, wife of Senator Barak Obama. The most poignant moment of the convention occurred when Massachusetts Senator Edward “Ted” Kennedy made an appearance and gave a short speech before the delegates. Senator Kennedy, who was undergoing treatment for a malignant brain tumor, paraphrased both his brother’s 1961 inaugural address and his own 1980 convention speech, with the statement:\n\n\n\nThis November, the torch will be passed again to a new generation of Americans, so with Barack Obama and for you and me, our country will be committed to his cause. The work begins anew. The hope rises again. And the dream lives on.\n\n\n\nIssues in the Democratic platform for 2008 included the redeployment of American troops serving in Iraq, support for a woman’s right to choose, a promise of “tough and practical” immigration reform, affordable access to health care, and the development of alternative energy technologies. Planks also called for the United States to assume a leadership role in the fight against global warming, amending NAFTA (North American Free Trade Agreement) to reflect concerns about labor and the environment, and a call for more service through an expansion of the AmeriCorps and Peace Corps programs.\n\nTop of Page Home"}, {"url": "https://www.ancestoryarchives.com/2014/12/arthur-sewall-of-bath-maine.html", "page_content": "During the greater part of Mr. Cleveland's first administration Mr. Sewall was on terms of close intimacy with the President, and every appointment which he recommended was made. But the free silver views of Mr. Sewall had at that time caused him to be classed by many of his friends in the East as a man who had gone wild on money questions. As a result of Mr. Cleveland's opposition to silver, Mr. Sewall fought against his renomination. He worked unceasingly for Cleveland's defeat at Chicago, standing for David B. Hill to the end but then came into line and helped elect the nominee. He never ceased to be an active member of the party. He was the unanimous choice of his party in Maine for United States Senator in 1892, and the attempt to turn him down at the State Convention by a resolution denouncing his free silver views failed.\n\nMr. Sewell was a delegate to the National Democratic Convention at Baltimore in 1872; at Cincinnati in 1880 and 1884; at St. Louis in 1888; and at Chicago in 1892 and 1896. At Chicago in July, 1896, he was one of the few advocates from New England of the free and unlimited coinage of silver. He was selected by the convention as their candidate for the office of Vice-president of the United States, and in an interview at the time voiced his sentiments on the platform as follows:\n\n\"There are thousands of business men in the East who are turning away from the single gold standard. It is not a class issue. In my opinion there is not a legitimate business in this country but that would be benefited by the restoration of silver to its rightful place in our national currency.\n\n\"I have been an advocate of silver ever since Congress\n\ndemonetized that metal in 1873. I held at the time that a mistake had been made, and have had no reason since to change my mind. \"There are two sides to every question, and as an individual banker I have a perfect right to take a position opposite to those who constitute the majority in the banking business. As I said before, this is not a technical question nor a class issue.\" Upon his return to his home in Bath he received an ovation from his fellow citizens long to be remembered by the staid people of that maritime town. The mayor warmly welcomed the nominee, and Mr. Sewall in the course of his reply to the warm welcome, said: \"It was a great convention, yet it did not seem to me to be a partisan one. It seemed more like the uprising of the people, and they seemed to be controlled by one idea, and that idea has filled me for years. They knew that this country is in deep distress, that it has been in distress for years, and that the great trouble is with our monetary system; and they believe as I believe, that there is only one remedy. They entertain no dishonest or dishonorable idea, but they demand that we be carried back to the money of our fathers, to that monetary system under which this government flourished for so many years, and they believe that is the only road to prosperity.\" \"The keynote of the Chicago platform is found in the Declaration of Independence. It simply implies that wherever the Government comes in contact with the citizen, wherever the citizen touches the Government, that all stand upon a common level, and there shall be equal rights to all and special privileges to no one. \"—William J. Bryan.\n\nSan Francisco Call, Volume 80, Number 42, 12 July 1896 — ARTHUR SEWALL\n\nArticle from The Forecaster Newspaper 2006 Author launches book on Bath shipbuilding family\n\n\n\nThursday, April 16, 2009\n\nBATH — While the Sewall family has been in the news recently after its fuel and convenience store company filed for bankruptcy, a new book looks at the family from a different perspective, telling the warts-and-all tale of its heyday as a builder and manager of a vast fleet of merchant ships."}, {"url": "https://www.geni.com/people/Arthur-Sewall/6000000004565891749", "page_content": "About Arthur Sewall\n\nhttps://www.wikitree.com/wiki/Sewall-171\n\nhttps://www.findagrave.com/memorial/7232538\n\nWilliam J. Bryan's running mate of the Presidency in 1896.\n\nPolitician. Served as a Member of the Democratic National Committee from Maine from 1888-1896, and Democratic Candidate for Vice President of the United States in 1896.\n\nUpon his brother's death the company became Arthur Sewall & Co (shipbuilders) built largest wooden ship Roanoke in 1894 launched the Dirigo first steel sailing ship built in America. President of the Eastern railway,Director of the Boston &Maine,New York & New England,and Mexican Centrail railroads.\n\nhttp://en.wikipedia.org/wiki/Arthur_Sewall\n\nArthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. As the Populist Party nominee, Bryan had another running mate as well, Thomas E. Watson. Sewall never held elective office, although he was a member of the Democratic National Committee from 1888 to 1896.\n\nArthur Sewall's main claim to fame had been as an exceptionally successful, wealthy shipbuilder and New England industrialist. He was a director of the Maine Central railroad and President of the Bath National Bank for years. His selection is believed to have been an effort to win votes among conservative and New England members of the party who were disturbed by the populist aspects of William Jennings Bryan. Arthur Sewall is also one of the few politicians to be an adherent of Swedenborgianism, a religion based on the writings of Swedish theologian Emanuel Swedenborg.\n\nHis main vice-presidential opponent, Garret A. Hobart (Rep), was also an Eastern banker and industrialist who had served on his party's national committee.\n\nSewall was Bryan's running mate for the first of Bryan's three times as the Democratic presidential nominee. He died not long after Bryan was nominated for the second time in 1900.\n\nSewall's grandson, Sumner Sewall, served as Governor of Maine from 1941 to 1945, as a Republican.\n\nLegacy\n\nIn 2008, the St. Louis Post-Dispatch referenced Sewall in an article criticizing Senator John McCain's selection of Gov. Sarah Palin as his vice presidential candidate in the 2008 presidential election, saying he had picked \"the least qualified running mate since the Swedenborgian shipbuilder Arthur Sewall ran as William Jennings Bryan's No. 2 in 1896.\""}, {"url": "https://www.ourcampaigns.com/CandidateDetail.html?CandidateID=19902", "page_content": "CANDIDATE DETAILS Affiliation Democratic Name Arthur Sewall Address\n\nSmallpoint, Maine , United States Email None Website None Born November 25, 1835 Died September 05, 1900 (64 years) Contributor U Ole Polecat Last Modifed Chronicler\n\nAug 19, 2020 03:46pm Tags Info Shipbuilder and politician, was born at Bath, ME, Nov. 25, 1835, third son of William Dunning and Rachel (Trufant) Sewall. He was a lineal descendant of Henry Sewall, mayor of Coventry, England, one of whose grandsons was married to Jane Dummer, and emigrated to Newbury, MA, in 1634. Samuel Sewall, who settled at York, ME, in 1708, had two sons: David, first U.S. judge for the district of Maine, appointed by Washington, and Dummer Sewall, a distinguished soldier and the great grandfather of Arthur Sewall. The latter obtained a lieutenancy under Amherst in the Canada campaign, and in 1775 joined the revolutionary army as a lieutenant colonel. After the adoption of the constitution of Massachusetts, he was elected a senator from the state; he was also a memebr of the state convention which ratified the Constitution of the United States. The father of Arthur Sewall was one of the earliest and most prominent shipbuilder of Bath. He built his first ship, the Diana, a vessel of 199 tons burden, in 1823, and in 1841 launched the ship Rappahannock, which though of little over 1,000 tons burden, was at that time the largest ship afloat. He also held large interest in railroad and other important corporations. As his sons completed their education they joined their father in business, and Arthur on leaving shchool was sent in the interests of the firm to Prince Edward Island to buy timber for the shipyard at Bath. Returning, he entered the employs of his father's firm in 1853, and in 1854 formed, with his elder brother, the firm of E. & A. Sewall, which took over the business of the old firm of William D. Sewall and Clark & Sewall. On the death of the elder brother, in 1879, the name of the firm was changed to Arthur Sewall & Co., being made up of the senior partner, with his nephew, Samuel S. Sewall, and his second son, William D. Sewall. Since January, 1855, when the brothers launched their first ship, the Holyhead, a vessel of over 1,100 tons, one ship a year, on an average, has been built in the sewall shipyard. The largest and the best built wooden ships in the world are the product of this yad. With the giant Roanoke this era of ship-building was closed, and the firm turned its attention to building steel vessels, the ship Dirigo, launched in 1894, being the first of its class followed in quick succession by others of the largest size. Mr. Sewall had supreme faith in the ultimate maritime supremacy of the United States, and lost no opportunity, by public and private effort, to forward this end. He was prominent in other fields of commercial and industrial enterprise; was a director in the Maine Central railroad, and its president for nine years, 1884-93; was also president of the Eastern railroad, and the Boston and Maine, and director in the Mexican Central and other roads. He was president of the Bath National Bank, holding the office for 29 years, to the time of his death. He was the leader of the Democratic party in Maine, but held only minor political offices; was a delegate to the national Democratic convention at Baltimore in 1872; to that at Cincinnati in 1880, and delegate-at-large to that which nominated Cleveland in 1884. In 1888 he attended the convention at St. Louis, where he was elected a member of the Democratic national committee, and was a member of its executive committee for the campaign of that year. At the Chicago convention of 1892 he was elected to the same office. In 1896 he was nominated for the vice-presidency on the ticket with William J. Bryan. He was also a delegate to the national convention of 1900, and there elected again a member of the national committee. He was married in 1859, to Emma Duncan, daughter of Charles Crooker, a ship-builder and merchant, of Bath, ME, and, like her husband, a descendant of Samuel Sewall, of York. They had three sons, two of whom are living: Harold, consul-general at Samoa under Cleveland and Harrison; attached to the Berlin commission for the settlement of the Samoan affairs, and minister to Hawaii, under McKinley, to the time of its annexation, and William D. Sewall, a member of the firm. Arthur Sewall died at Smallpoint, ME, Sept. 5, 1900.\n\n\n\n[Link]\n\nJOB APPROVAL POLLS\n\nBOOKS Title Purchase Contributor\n\nEVENTS Start Date End Date Type Title Contributor\n\nNEWS Date Category Headline Article Contributor\n\nAdd Your 2¢\n\nAgree\n\nDisagree\n\nLaugh\n\nGroan\n\nTroll\n\nBefuddled\n\nWork Complete\n\nPrediction\n\n[close]\n\nDISCUSSION"}, {"url": "https://en.unionpedia.org/Arthur_Sewall", "page_content": "Arthur Sewall Arthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. [1]\n\n27 relations: Adlai Stevenson I, Bath, Maine, Democratic National Committee, Democratic Party (United States), Emanuel Swedenborg, Garret Hobart, Harold M. Sewall, John McCain, List of United States Democratic Party presidential tickets, Maine, Maine Central Railroad Company, People's Party (United States), Phippsburg, Maine, Republican Party (United States), Sarah Palin, St. Louis Post-Dispatch, Sumner Sewall, Sweden, The New Church (Swedenborgian), Thomas E. Watson, United States, United States presidential election, 1896, United States presidential election, 1900, United States presidential election, 2008, Vice President of the United States, William Jennings Bryan, William Jennings Bryan presidential campaign, 1896.\n\nAdlai Ewing Stevenson (October 23, 1835 – June 14, 1914) served as the 23rd Vice President of the United States (1893–97).\n\nNew!!: Arthur Sewall and Adlai Stevenson I · See more »\n\nBath is a city in Sagadahoc County, Maine, in the United States.\n\nNew!!: Arthur Sewall and Bath, Maine · See more »\n\nThe Democratic National Committee (DNC) is the formal governing body for the United States Democratic Party.\n\nNew!!: Arthur Sewall and Democratic National Committee · See more »\n\nThe Democratic Party is one of the two major contemporary political parties in the United States, along with the Republican Party (nicknamed the GOP for Grand Old Party).\n\nNew!!: Arthur Sewall and Democratic Party (United States) · See more »\n\nEmanuel Swedenborg ((born Emanuel Swedberg; 29 January 1688 – 29 March 1772) was a Swedish Lutheran theologian, scientist, philosopher, revelator and mystic who inspired Swedenborgianism. He is best known for his book on the afterlife, Heaven and Hell (1758). Swedenborg had a prolific career as an inventor and scientist. In 1741, at 53, he entered into a spiritual phase in which he began to experience dreams and visions, beginning on Easter Weekend, on 6 April 1744. It culminated in a 'spiritual awakening' in which he received a revelation that he was appointed by the Lord Jesus Christ to write The Heavenly Doctrine to reform Christianity. According to The Heavenly Doctrine, the Lord had opened Swedenborg's spiritual eyes so that from then on, he could freely visit heaven and hell and talk with angels, demons and other spirits and the Last Judgment had already occurred the year before, in 1757. For the last 28 years of his life, Swedenborg wrote 18 published theological works—and several more that were unpublished. He termed himself a \"Servant of the Lord Jesus Christ\" in True Christian Religion, which he published himself. Some followers of The Heavenly Doctrine believe that of his theological works, only those that were published by Swedenborg himself are fully divinely inspired.\n\nNew!!: Arthur Sewall and Emanuel Swedenborg · See more »\n\nGarret Augustus Hobart (June 3, 1844 – November 21, 1899) was the 24th Vice President of the United States, serving from 1897 until his death in 1899.\n\nNew!!: Arthur Sewall and Garret Hobart · See more »\n\nHarold Marsh Sewall (January 3, 1860 – October 28, 1924) was an American politician and diplomat.\n\nNew!!: Arthur Sewall and Harold M. Sewall · See more »\n\nJohn Sidney McCain III (born August 29, 1936) is an American politician serving as the senior United States Senator from Arizona, a seat he was first elected to in 1986.\n\nNew!!: Arthur Sewall and John McCain · See more »\n\nThis is a list of the candidates for the offices of President of the United States and Vice President of the United States of the modern Democratic Party of the United States.\n\nNew!!: Arthur Sewall and List of United States Democratic Party presidential tickets · See more »\n\nMaine is a U.S. state in the New England region of the northeastern United States.\n\nNew!!: Arthur Sewall and Maine · See more »\n\nThe Maine Central Railroad Company was a former U. S. Class I railroad in central and southern Maine.\n\nNew!!: Arthur Sewall and Maine Central Railroad Company · See more »\n\nThe People's Party, also known as the Populist Party or the Populists, was an agrarian-populist political party in the United States.\n\nNew!!: Arthur Sewall and People's Party (United States) · See more »\n\nPhippsburg is a town in Sagadahoc County, Maine, United States, on the west side of the mouth of the Kennebec River.\n\nNew!!: Arthur Sewall and Phippsburg, Maine · See more »\n\nThe Republican Party, also referred to as the GOP (abbreviation for Grand Old Party), is one of the two major political parties in the United States, the other being its historic rival, the Democratic Party.\n\nNew!!: Arthur Sewall and Republican Party (United States) · See more »\n\nSarah Louise Palin (née Heath; born February 11, 1964) is an American politician, commentator, author, and reality television personality, who served as the ninth Governor of Alaska from 2006 until her resignation in 2009.\n\nNew!!: Arthur Sewall and Sarah Palin · See more »\n\nThe St.\n\nNew!!: Arthur Sewall and St. Louis Post-Dispatch · See more »\n\nSumner Sewall (June 17, 1897January 25, 1965) was a U.S. Republican politician and airline executive who served as the 58th Governor of Maine from 1941 to 1945.\n\nNew!!: Arthur Sewall and Sumner Sewall · See more »\n\nSweden (Sverige), officially the Kingdom of Sweden (Swedish), is a Scandinavian country in Northern Europe.\n\nNew!!: Arthur Sewall and Sweden · See more »\n\nThe New Church (or Swedenborgianism) is the name for several historically related Christian denominations that developed as a new religious movement, informed by the writings of scientist and Swedish Lutheran theologian Emanuel Swedenborg (1688–1772).\n\nNew!!: Arthur Sewall and The New Church (Swedenborgian) · See more »\n\nThomas Edward \"Tom\" Watson (September 5, 1856 – September 26, 1922) was an American politician, attorney, newspaper editor and writer from Georgia.\n\nNew!!: Arthur Sewall and Thomas E. Watson · See more »\n\nThe United States of America (USA), commonly known as the United States (U.S.) or America, is a federal republic composed of 50 states, a federal district, five major self-governing territories, and various possessions.\n\nNew!!: Arthur Sewall and United States · See more »\n\nThe United States presidential election of 1896 was the 28th quadrennial presidential election, held on Tuesday, November 3, 1896.\n\nNew!!: Arthur Sewall and United States presidential election, 1896 · See more »\n\nThe United States presidential election of 1900 was the 29th quadrennial presidential election, held on Tuesday, November 6, 1900.\n\nNew!!: Arthur Sewall and United States presidential election, 1900 · See more »\n\nThe United States presidential election of 2008 was the 56th quadrennial presidential election.\n\nNew!!: Arthur Sewall and United States presidential election, 2008 · See more »\n\nThe Vice President of the United States (informally referred to as VPOTUS, or Veep) is a constitutional officer in the legislative branch of the federal government of the United States as the President of the Senate under Article I, Section 3, Clause 4, of the United States Constitution, as well as the second highest executive branch officer, after the President of the United States.\n\nNew!!: Arthur Sewall and Vice President of the United States · See more »\n\nWilliam Jennings Bryan (March 19, 1860 – July 26, 1925) was an American orator and politician from Nebraska.\n\nNew!!: Arthur Sewall and William Jennings Bryan · See more »\n\nIn 1896, William Jennings Bryan ran unsuccessfully for President of the United States.\n\nNew!!: Arthur Sewall and William Jennings Bryan presidential campaign, 1896 · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Arthur_Sewall"}, {"url": "http://projects.vassar.edu/1896/democrats.html", "page_content": "\n\n\n\nThe Democratic Party\n\nGrover Cleveland's Administration\n\nThe Democrats entered their convention deeply divided. The severe depression had made their sitting president, Grover Cleveland, wildly unpopular (the biography link here is to the White House history pages). Cleveland, the first Democratic president since the Civil War, had served two terms (1885-1889 and 1893-1897). In the early years he was popular as a reformer who opposed the corruption of big-spending Republicans in the capital, but the economic shock of 1893 eclipsed this issue.\n\n\n\nA fiscal conservative, Cleveland sealed his fate among free silver advocates in the South and West when, in the face of economic hardship, he called a special session of Congress to further tighten the money supply. \"Pitchfork\" Ben Tillman won his nickname when he threatened to \"poke old Grover with a pitchfork.\"\n\n\n\nThe Democratic National Convention at Chicago\n\n7-11 July 1896\n\nArriving in Chicago, Eastern Democrats who opposed free silver were stunned by the strength of that cause. William C. Whitney, a millionaire, a close friend of Grover Cleveland, and his former Secretary of the Navy, rushed to the convention to organize the pro-gold forces, but found that delegates who shared his sentiments were in the minority. Cleveland's Secretary of the Treasury, John G. Carlisle, remained in Washington and denounced the silverites from there. To some Americans' shock and others' joy, emerging candidates for the nomination were all Southern and Western free silver men.\n\n\n\nThe hopefuls included Richard Bland of Kentucky, a stalwart pro-silver voice in the House of Representatives from 1873 to 1894; Horace Boies, former governor of Illinois, also strongly pro-silver; and young William Jennings Bryan of Nebraska. The convention debated the currency question before moving to the nominations. With a dramatic address that became famous as the \"Cross of Gold\" speech, Bryan prompted an hour of cheering and demonstrations, followed by the convention's adoption of a free silver plank by 628 votes to 301.\n\n\n\nNew York Senator David B. Hill, a loyal Cleveland man, moved that the convention express its support for the current Democratic administration. The motion failed miserably, and free-silver men wildly celebrated their victory. In addition, the convention passed an indignant resolution protesting Cleveland's intervention to squelch Chicago's Pullman strike. Republicans dubbed this the \"anarchy plank,\" linking it to the Civil War doctrine of states' rights and to fears of labor unrest.\n\n\n\n\n\nThe \"Cross of Gold\" speech is often credited with winning Bryan the nomination, in part because the convention's actions seemed impulsive to Easterners unaware of sentiment in other regions. It was also unheard of for a convention to nominate a man in his presence; presidential hopefuls were supposed to wait modestly at home for the results. Bryan and his friends had, however, worked hard in advance, and several delegations came to Chicago already pledged to his support.\n\n\n\nGold Democrats faced a difficult choice. Some, like David Hill, sat quietly through the campaign, awaiting another year when they hoped economic conservatives would regain control of the party. Hill, when asked about his party affiliations, allegedly said he was \"still a Democrat--very still.\"\n\n\n\nOthers walked out, especially those who had lost their state and local power to free-silver men, and had little more to lose. Neither faction worked for Bryan, and some publicly instructed Democrats to vote for McKinley. Bryan and the Silver Democrats ran their campaign without the support of some of the party's key contributors and leaders, including a hostile administration in Washington.\n\n\n\nBryan's Democratic Running Mate\n\nDemocrats further complicated the campaign by nominating Arthur Sewall of Maine for the Vice-Presidency. Sewall, a Maine shipbuilding owner, seemed a good choice to attract Eastern votes and balance the Nebraskan presidential nominee. After the convention, however, Democrats discovered to their chagrin that Sewall had a poor reputation as an employer. His anti-labor record and great wealth made him anathema to the Populist convention, which endorsed Bryan but rejected Sewall, choosing Tom Watson of Georgia.\n\n\n\n\n\nThe \"Chicago Platform\"\n\nGold Democrats and Republicans used this term contemptously, to emphasize that the radical proposals adopted in 1896 did not represent the \"real,\" traditional views of the Democratic party. Silver Democrats and fusion Populists celebrated the \"Chicago platform\" as a new departure that promised aid to those hit hard by the depression and more equal distribution of wealth. The most controversial planks were free silver and the proposed federal income tax.\n\n\n\nCampaign Strategy Bryan's campaign manager was Senator James K. Jones of Arkansas; he proved ruthless in his dealings with the Populists, but not so effective in besting the Republicans. The silver Democrats were poor in comparison to McKinley's forces. Toward the end of the campaign they unsuccessfully sought $350,000 from William Randolph Hearst and silver mine operators; even this amount paled in comparison with the hundreds of thousands raised by Republican Mark Hanna. In the end, silver Democrats failed to cover their debts. Bryan was the first presidential candidate to go on nationwide speaking tours. Focusing much of his energy on the hotly contested Midwestern states, Bryan criss-crossed the U.S. by railroad, speaking from the back of his train at all hours of day and night. Bryan's imposing voice and height made a deep impression on many who thronged to hear him. In many parts of the South and West Bryan supporters welcomed him with parades, speeches, and wild demonstrations of support.\n\n\n\nOther Americans criticized Bryan as self-aggrandizing and loud, criticizing his innovative campaign tactics as much as his ideas. Republicans like Theodore Roosevelt took note, however, and by the early 1900s the idea of \"barnstorming\" by railroad became widely practiced by candidates in all parties.\n\n\n\nBryan consistently hammered on the theme of \"the American people versus the special interests,\" targetting Wall Street bankers and the trusts and monopolies they financed. Even when speaking in New York, he refused to apologize for the Chicago plank that called for a progressive income tax, despite intense criticism from the Republicans.\n\n\n\nIn the South, Bryan supporters emphasized states' rights and white supremacy; John Altgeld and other advocates of labor also pointed to the plank that defended states' rights, but for different reasons, stemming from Grover Cleveland's intervention to suppress the Pullman strike of 1894.\n\n\n\nToward the end of the campaign, some businessmen began warning workers that a Bryan victory would mean the end of their employment--businesses would be forced to shut down after election day. Republican leaders scoffed at Bryan's charge that this was \"coercion\"--a veiled or not-so-veiled threat against employees who might vote Democratic. Silver Democrats' belief that such threats were widespread, combined with a perception that McKinley won by taking enormous sums from \"trusts,\" lent special bitterness to their defeat. It also raised new issues about politics and corporate power that the country would begin to debate as the new century dawned.\n\n\n\nHOW THE NOMINATION WAS RECEIVED.\n\nOmaha, Neb., July 10--All Nebraska is excited tonight over Bryan's nomination, and informal celebrations, with bands playing, horns tooting and excited Democrats yelling in a most enthusiastic manner, are common throughout Nebraska. The excitement is most intense in Omaha, though no formal steps have yet been taken toward a proper celebration. It came as too much of a surprise.\n\n--Denver News, 11 July 1896\n\n\n\nA gifted friend of mine said on the first day of the convention that it was a battle between Rothschilds and Bland, and that if Bland were beaten Rothschilds would win. When the nomination was made he leaned over my shoulder and said the Rothschilds are beaten.\n\n--John Russell Young in St. Louis Globe-Dispatch, 12 July 1896\n\n\n\n\n\nTAIL STRONGER THAN HEAD.\n\nMillionaire Arthur Sewall of Maine Placed at the Rear of the Ticket.\n\nThe Last Mad Cry of the Moon Worshipers Has Died Away Among the Rafters of the Coliseum.\n\nFROM EVERY POINT COMES NEWS OF BOLTING DEMOCRATS.\n\n--Los Angeles Times, 12 July 1896\n\n\n\nThe middle-of-the-road Populists have played their party into the hands of the McKinley syndicate. But Mr. Bryan is not defeated. His manly conduct in refusing to throw aside his running mate will commend him to the people. He has shown himself to be a man of honor. He is in very truth, another Lincoln.\n\n--Tacoma Daily News in Public Opinion, 6 August 1896\n\n\n\nJuly 27, 1896\n\nTerre Haute, Indiana\n\n\n\nMy dear Mr. Bryan,\n\nWith millions of others of your countrymen I congratulate you most heartily upon being the People's standard bearer in the great uprising of the masses against the classes. You are at this hour the hope of the Republic--the central figure of the civilized world. In the arduous campaign before you the millions will rally to your standard and you will lead them to a glorious victory. The people love and trust you--they believe in you as you believe in them, and under your administration the rule of the money power will be broken and the gold barons of Europe will no longer run the American government.\n\nWill all good wishes\n\nbelieve me always\n\nYour faithfully\n\nEugene V. Debs\n\nBryan Manuscripts, Library of Congress, reprinted in J. Robert Constantine, ed., Letters of Eugene V. Debs, Volume I (1874-1912), ed. J. Robert Constantine (Urbana: University of Illinois Press, 1990)\n\n\n\n\n\nThe same thing afflicts Mr. Bryan, it seems, that led the parrot of story into serious trouble. He talks too much.\n\n--National Reflector, Wichita, 31 October 1896\n\n\n\nSenator Tillman would seem to have brought into politics the methods of an old-time plantation overseer, dealing with politicians as the overseer was wont to deal with the negroes.\n\n--St. Louis Globe-Democrat, 12 July 1896\n\n\n\nNew Haven, Conn., Sept. 24--Five hundred students, assisted by a band of the First regiment of the National guard of Connecticut broke up the address by William J. Bryan at this place this afternoon. . . . There were cheers for the nominee, but from the right of the stand the students repeatedly broke forth with their yell, and it was impossible for Mr. Bryan to make himself heard. . . . In vain did Mr. Bryan attempt to restore order, but it was many minutes before anything like quiet was obtained. Then the crowd began to surge again, and the police to fight those in front. Women fainted and several persons were taken from the crowd, overcome by the crush.\n\n--Rocky Mountain News, 25 September 1896\n\n\n\n\n\n\n\n"}, {"url": "https://www.cambridge.org/core/journals/studies-in-american-political-development/article/southern-delegates-and-republican-national-convention-politics-18801928/540F518E6A0CC59C52FFE7D002474F97", "page_content": "More generally, we enhance scholarly understanding of the relationships among internal Republican politics, presidential elections, and Southern strategies, by showing that these Southern strategies have been more persistent and developmentally significant than previously assumed. Footnote 6 The term Southern strategy was first used to describe the electoral strategies of post–World War II presidential hopefuls Barry Goldwater, Richard Nixon, and Ronald Reagan—but in fact, as we illustrate, Southern strategies have been of constant importance to the Republican Party since its founding. Footnote 7 In the post-Reconstruction decades, the Southern strategy sometimes had internal organizational logics, vote-getting logics, and party-building logics all working simultaneously, while at other times the strategy just had nomination and party-building logics. We also show that group and minority representation—usually associated with the contemporary Democratic Party—played a key role in the evolution of the Republican Party and shaped the candidate nomination processes. In all these ways, we believe that this article highlights and illuminates the evolution of the party system and presidential politics.\n\nIn laying out this history, we add significantly to the literature on national party organization in the late nineteenth and early twentieth centuries. Many of the details we present here were previously recorded only in historical case studies, focusing on specific election years or individual political actors, and thus a coherent story of how Republican leaders dealt with Southern delegations in the aftermath of Reconstruction has never been told. In presenting such a story, we consider how leadership incentives changed, as the likelihood of a viable Southern wing of the GOP waned over time (even as the party grew in strength in other parts of the country) and Southern delegates were increasingly seen as votes to be purchased by the highest bidder.\n\nIn short, in the first two decades after Reconstruction, concerns about Southern representation at the National Convention were raised occasionally, but they never generated much support. Hope still existed that a Southern wing of the party could be rebuilt, and the link to the past (as the “Party of Lincoln”) along with basic concerns of fairness were enough to stymie the desire for a meaningful change. With Republican electoral ascendancy at the turn of the century, a new focus on Southern representation at the convention was established. Soon, the “appropriate” size of the Southern delegations became a bargaining chip in intraparty power struggles. While several meaningful changes were discussed, only one significant alteration in representation was made—in December 1913, in advance of the 1916 Republican National Convention. Here, in response to progressive complaints following the heated Taft–Roosevelt campaign in 1912, representation for former Confederate delegations was finally reduced—which had the effect of dampening Southern strength at the GOP convention by nearly 6 percentage points. A further reduction was adopted by the Republican National Committee (RNC) in 1923, but was quickly rescinded and never went into effect.\n\nAs the twentieth century dawned, however, the Republicans began to think with one mind (electorally speaking) with regard to the South. McKinley's smashing presidential victory (and electoral coattails) in 1896, and his reelection four years later, cemented the GOP's dominance in most regions of the country. Footnote 4 Under the “System of 1896,” Republicans could easily win presidential elections and congressional majorities without Southern support, even as their vote total in the former Confederacy decreased even further. Consequently, any remaining Stalwart considerations melted away, as the South could be comfortably ignored without damage to the GOP's national fortunes. Footnote 5 This new reality helped frame how Republican delegations from the South would be viewed by various elements in the party.\n\nThere is sometimes a danger in reading back in history, such that we (as scholars) impart a complete knowledge of the future to the political actors in question. In this case, for many Republican politicians in the late nineteenth century, it wasn't clear that the Democratic resurgence in the South was unassailable. True Jim Crow restrictions would not start to be implemented until the 1890s, and Republicans continued to have some success at various levels of government (often through fusion arrangements with third parties) in states like Virginia and North Carolina through the end of the century. Indeed, the Stalwart faction of the GOP continued to pursue a Reconstruction policy through 1890, when a new Enforcement Act (which would have placed voting rights' enforcement power in the federal courts) was passed in the House but went down to defeat (narrowly) in the Senate. This victory for white Southerners hastened the adoption of Jim Crow and encouraged the remaining vestiges of Reconstruction to be eliminated—for example, the Enforcement Acts of the early 1870s were formally repealed in 1894, when the Democrats enjoyed unified control of the federal government for the first time since the antebellum era.\n\nAs the apportionment of states' delegations to Republican National Conventions had traditionally been determined by the size of their congressional delegations (regardless of party distribution), it is perhaps tempting to claim that “path dependence” overrode the growing disconnect between convention delegation size and electoral performance. However, we argue that two other (related) explanations better capture the historical reality: (1) the ongoing hope in the late nineteenth century for a resurgence of the Republican Party in the South and (2) the continuous incentive for Republican presidents and other ambitious party leaders to treat Southern convention delegations as “rotten boroughs,” that is, as sizable voting blocs that could be bought (controlled) via patronage and bribery.\n\nWith the South once again closed off to the GOP, Republican Party leaders had to figure out how to deal with the former Confederate states. Footnote 3 Answers varied by context and took many forms. In this article, we examine how the Republicans dealt with the South in terms of GOP National Convention politics in the decades following the end of Reconstruction. The role of Southern delegations at Republican conventions in the late nineteenth and early twentieth centuries presents something of a puzzle: while the probability of any Southern states having a hand in the election of a Republican to the presidency declined (and approached zero) in the years after Reconstruction, these same states were consistently allotted sizable delegations to the Republican convention. Indeed, we show that Southern delegates in several election years represented the deciding votes in ballots selecting the presidential and vice presidential candidates for the Republican ticket. This raises the question of why Republican Party leaders from other parts of the country would allow a region in which the GOP was increasingly nonexistent to continue to have a strong say in the selection of presidential candidates and other major decisions made during national conventions.\n\nIn the aftermath of the Civil War, during the period in U.S. history known as Reconstruction, the Republican Party successfully established a wing in the former Confederate states, a portion of the nation that had been effectively closed off to the party in its early years. Footnote 1 With various voting restrictions placed on much of the Southern white population, the Grand Old Party's (GOP's) “Dixie wing” flourished through 1870, as state governments were firmly in Republican hands and the party controlled a majority of seats in the U.S. Congress. In the early 1870s, however, things changed: the onset of violent repression of African American voting, the resurgence of white voting in the South (by 1871), and the elimination of the ban on office holding for most ex-Confederates (via the Amnesty Act of 1872) combined with a severe economic depression following the Panic of 1873 to foster a Democratic revival. Footnote 2 The Democrats regained majority control of the U.S. House in the midterm elections of 1874, and by 1876 had taken back most of the Southern state governments. With the Compromise of 1877, and the eventual election of Rutherford Hayes to the presidency, the Democrats' consolidation of the former Confederacy was complete—in historical parlance, and in the minds of whites in the region, the South had been “redeemed.”\n\nWe will recount the political details surrounding the various reapportionment motions in the next few sections. For now, though, it is helpful to get a sense of what was at stake in the reapportionment conflicts, and the extent to which the Republican Party found itself marginalized electorally in the South. Figure 1 details the percentage of the two-party vote that GOP presidential candidates received both nationally and regionally (South vs. non-South) for elections from 1880 through 1928, while Table 1 lays out the state delegation totals at the Republican National Convention from 1880 through 1928. Throughout this period, Republican presidential candidates won landslide national victories (especially from 1896 onwards), despite dramatically underperforming in the South. Yet, for most of these years, the former Confederate states constituted around one-quarter of the GOP convention delegates, a substantial total for a region that provided the party with nothing on Election Day. (This percentage declined slightly until 1912, thanks mostly to the South losing House seats in a relative sense after each congressional reapportionment.) Beginning in 1916, the GOP's new delegate reapportionment scheme went into effect, and the South saw its representation at the National Convention drop by nearly 6 percentage points. The region would lose an additional half percentage point (roughly) in the three succeeding conventions (1920, 1924, and 1928).\n\nDuring a June 1921 meeting, the RNC agreed to another reapportionment scheme, which provided states with one delegate for each congressional district that maintained a Republican organization and had cast at least 2,500 votes for any Republican in the most recent presidential election plus one additional delegate for each district that cast at least 10,000 such votes. If implemented, this plan would have resulted in a further reduction in Southern delegates, drawing the total down by 40 percent since 1912. Footnote 17 During an RNC meeting in December 1923, however, the previously agreed-upon reapportionment was abandoned and the system of one delegate for each congressional district was reinstated, while the representation of the thirty-seven states that voted Republican in 1920 was increased by three at-large delegates each. Footnote 18\n\nAs a result, motions began to be offered at the Republican National Convention to tie states' delegate allotment in part to party strength, as measured by state votes cast for the most recent Republican presidential nominee. The first motion, made in 1900, would have provided each state with four at-large delegates and one additional delegate for each 10,000 votes (or majority fraction thereof) cast for the Republican nominee at the last presidential election. (Note that the 1900 motion was based on a similar motion first introduced in 1884, at a time when the Republicans were not yet ready to give up on a Southern wing.) The 1900 motion was quickly dropped, but it surfaced again in the same form in 1908 and generated a close roll-call vote (failing 471–506). A similar motion was offered four years later, in 1912, which would have provided one delegate for each congressional district within a state, along with one additional delegate for each 10,000 votes (or majority fraction thereof) cast for the Republican nominee at the last presidential election. Footnote 14 While this motion was tabled at the convention, a breakthrough finally occurred in December 1913, when the RNC agreed to adopt the 1912 proposal. Footnote 15 This rules change was subsequently ratified by Republican organizations in states that produced GOP electoral majorities in 1908, and at the 1916 Republican National Convention—and went into effect at that time. Footnote 16\n\nBy the end of the nineteenth century, opponents of the pro-Southern status quo began to gain some traction. Arguments about a Republican resurgence below the Mason-Dixon line had lost credibility, as GOP electoral gains in the South—which had produced some successes in the late 1870s and early 1880s, through fusion arrangements with various independent movements—were largely stymied by the mid-1880s. The Republicans' last statutory stand occurred in 1890, during the Harrison Administration, when the party controlled both chambers of Congress and Rep. Henry Cabot Lodge (R-MA) pushed a new enforcement bill that sought to resuscitate black voting rights in the South by granting new oversight powers to the federal judiciary. The Lodge Bill passed in the House, but was stopped in the Senate when “silver” Republicans in the West defected from the party position. Footnote 10 The Democrats responded to this GOP near miss by adopting state-level constitutional restrictions on African American voting rights in the South (Jim Crow laws) and repealing the existing Reconstruction-era Enforcement Acts at the federal level that were still on the books. Footnote 11 In addition, while the Democrats were consolidating their hold on the South, Republicans made popular vote gains in every other region of the country in the 1894–1896 elections; Footnote 12 once these initial gains were seen as stable, following McKinley's reelection in 1900, the GOP leadership was comfortable in asserting the party's national dominance. As a result, fewer and fewer Northern Republicans had any instrumental reason for working to maintain a foothold in the South and, perhaps more importantly, for honoring the decades-old status quo arrangement that disproportionately benefited the South at the National Convention. Footnote 13\n\nEven as the political reality changed in the post-Reconstruction years, the status quo arrangement proved impervious to change. Basic beliefs regarding fairness and inclusion continued to hold strong appeal, in part because a sizable segment of the GOP—the Stalwart wing, predominantly, which was the keeper of the radical flame on Reconstruction policy and black civil rights—held out hope that the Democratic resurgence in the South could be reversed. Southern Republicans themselves also lobbied to maintain their position in the GOP governing hierarchy. And, of course, Northern Republican politicians who benefited from a sizable and stable Southern delegation at the convention also opposed a change in the status quo arrangement.\n\nThus, in subsequent years, these two sets of decisions—(1) equality/size driving a state's delegation allocation and (2) convention inclusivity, regardless of a state's receptivity to Republican tenets—would steer Republican National Convention politics down a certain path. With each new convention, and the readoption (tacit or otherwise) of the two aforementioned sets of decisions, precedents were set that would be hard to alter later. For example, an apportionment rule divorced from party strength and a general policy of fairness and inclusion were not problematic during the Civil War and early Reconstruction years, when the Republican Party was present and dominant in every region of the country. In this case, real influence in the convention was in keeping with real influence in presidential selection (in the Electoral College). With the declining fortunes of the GOP in the South following the end of Reconstruction, a fissure opened between the two modes of influence—Southern delegations retained their ability to affect Republican presidential nominations even as they lost all ability to affect outcomes on Election Day.\n\nWhile the decision to adopt an equality/size model was straightforward, the decision to provide representation to every state in the Union was not. Some states, primarily in the South, were effectively closed off to the Republican Party—the question then was, should a party built consciously on free soil principles afford slave states representation at its National Convention? This issue was brought to the forefront in 1860, when the convention's Committee on Credentials proposed a delegate count that included several slave states and territories. Amendments were quickly offered that would have recommitted (i.e., eliminated) several slave-state delegations (Texas, Maryland, Kentucky, Virginia, the Nebraska and Kansas Territories, and the District of Columbia). A spirited debate then ensued, with those seeking to exclude the slave-state delegations expressing concerns about the Republican mission being (potentially) undermined by their inclusion (per the belief that members from pro-slavery regions might work to destroy the party from the inside) and those seeking to seat the slave-state delegates stressing fairness and the need for the party to be truly national in scope (and not just a sectional party, as many had claimed). In the end, the pro-inclusion position won out, as the convention adopted a report advocating the seating of all the delegations, including the slave states and territories. The allocation changed slightly from 1856, with each state given four at-large delegates and two for every congressional district it possessed—which was equal to twice its number of votes in the Electoral College. Footnote 9\n\nTo understand the problem of Southern representation at the Republican National Convention in the post-Reconstruction era requires a comprehension of how the GOP apportioned delegates. From the Republican Party's inception, representation was based on a dual equality/size model, where all states would be provided with a baseline delegate level that was then enhanced in proportion to the number of congressional districts each state possessed. Footnote 8 In 1856, for example, the rule chosen at the first Republican convention was that each state would receive six at-large delegates plus three for every one of its congressional districts. Incorporating such an equality/size model was pragmatic, as the Republicans in 1856 were a brand new party, so there was no obvious measure of party strength that could be used in the delegate allocation process.\n\nREPUBLICAN NATIONAL CONVENTION POLITICS AND SOUTHERN REPRESENTATION, 1880–1928\n\nWith the South “redeemed” by white Democrats, the Republicans' approach to the region changed over time. In the early years after the collapse of Reconstruction, hope for a revitalized Southern GOP lingered—and this limited the degree to which Republican leaders viewed the former Confederate South as a collection of rotten boroughs. As a result, only one serious effort to reduce Southern representation at the National Convention was made in the pre-1900 period—in 1884—and it was defeated quickly. That said, attempts to buy Southern convention delegations clearly originated in these early years, before becoming standard practice as the century turned. Indeed, by 1900, GOP leaders had given up on a Southern wing of the party, and pragmatic vote buying of Southern state delegates—and attempts by Republican factions to limit Southern representation at the National Convention, as both a ploy in a larger intrapartisan bargaining game and a sincere institutional strategy—had become commonplace.\n\nThe 1880–1896 Period The 1880 presidential election was the first after the disputed outcome of 1876–1877, and the first after the South as a whole had fallen back into Democratic hands. Yet, in the wake of Reconstruction's demise, Republicans still believed that a Southern wing of the party could be maintained. President Hayes endeavored to construct a “New Departure” in the South, by reaching out to white, conservative Southern Democrats on economic grounds.Footnote 19 As a result, his vision of maintaining a Southern wing meant reconfiguring it to reflect the political realities of the day. The Stalwart wing of the party rejected the Hayes plan and sought instead to keep the traditional Republican organizations alive. As the end of Hayes's term neared—he announced early on that he would not seek reelection—recurrent press stories of violence and intimidation toward black voters largely discredited his New Departure strategy and helped to solidify the need for stronger voting rights protections in the South. As the 1880 Republican National Convention approached, John Sherman had the upper hand vis-à-vis the South. Thanks to his position as Treasury Secretary under Hayes, Sherman controlled a massive patronage operation—an enterprise that could keep a Southern wing of the GOP alive generally and tied to his presidential aspirations specifically.Footnote 20 As Kenneth D. Ackerman notes: “Sherman … had used Treasury Department employees—all political appointees under his thumb—to pack local caucuses across the South and guarantee a harvest of friendly delegates.”Footnote 21 Unfortunately for Sherman, his chief opponents at the convention—Senator James Blaine (ME) and former President Ulysses S. Grant—commanded the support of a considerably larger group of delegates. Sherman hoped that if he could stay in the race, he would emerge as a compromise candidate. That did not come to pass, as his Ohio colleague Rep. James Garfield would eventually become the convention dark horse. Still, Sherman's Southern delegates stuck by him to the end, rather than backing Grant (who, as leader of the Stalwarts, was quite popular in the South), which had been a significant concern among the non-Grant party managers.Footnote 22 Part of this loyalty was related to Sherman's reputation as a strong civil rights advocate and, before that, a strong antislavery advocate. The results of the 1880 election kept the White House in Republican hands, as Garfield defeated the Democratic nominee, Winfield Scott Hancock. But Republican leaders' fears were realized when the entirety of the former Confederate South broke for Hancock—not a single electoral vote was cast for the GOP below the Mason-Dixon line. As a result, some party members called for a reconsideration of electoral apportionment rules that governed GOP representation at the National Convention. If the South was lost to the Republicans, these individuals argued, shouldn't those states that could support the party on Election Day have a stronger hand in nominee selection and platform design? The first major challenge to the fairness and inclusion status quo arrangement at the Republican National Convention occurred in 1883–1884, as a move was made to tie a portion of a state's delegate allotment to its GOP presidential vote total from the previous election. The new initiative was introduced by Senator William P. Frye (ME) at an RNC meeting in December 1883. Frye's plan would provide each state with four at-large delegates, one delegate for each congressional district and one additional delegate for each 10,000 votes (or majority fraction thereof) cast for the Republican nominee at the last presidential election. If implemented, Frye's plan would have had an immediate negative impact on the former Confederate South's level of representation at the 1884 convention, reducing its delegate percentage from 26.1 percent (214 of 820) to 18.4 percent (160 of 870).Footnote 23 After some discussion, the RNC members voted 25–18 to refer the decision to the convention—which, for the time being, forestalled any change.Footnote 24 The sitting president, Chester A. Arthur, was opposed to such a change. Arthur was seeking the nomination in 1884, after ascending to the presidency following Garfield's assassination in 1881. Arthur was a machine politician, rather than an ideological or inspirational leader, who believed that his best chance at retaining the office was to establish a clear following among some element of the GOP. He considered the South to be his best bet and invested considerable time trying to build (or perhaps rebuild) a Southern wing of the party. His strategy was to back various independent movements in the Southern states, in the hope that a combined Independent–Republican coalition would be sufficient to defeat the Democrats.Footnote 25 He also believed that the attention he showed Southern Republican leaders would yield direct benefits at the convention. His choice of adding William E. Chandler of New Hampshire—a favorite of Southern Republicans for his condemnation of white Democrats' actions in the South—to his cabinet was a fundamental part of this strategy. As Vincent P. De Santis notes, Chandler was chosen in part “to conduct the 1882 congressional elections in the South,” but perhaps more importantly, Chandler was also given the job of rounding up southern delegates for Arthur at the 1884 national convention. The Washington correspondent of the New York Age reported that it was an open secret that Arthur had taken Chandler into the cabinet for this express purpose. … Chandler had the full authority to barter away federal patronage and to use southern offices where they would do the most good in picking up delegates for the President.Footnote 26 While Frye's motion resonated with many in the party, it would not in the end be implemented. Arthur and Chandler saw to that. As noted, important segments within the GOP still believed that Republican electoral success in the South was possible. They merely had to look at the victories achieved by William Mahone in 1879 and 1881 in Virginia for evidence; his “Readjuster” organization—in alliance with state Republicans—successfully defeated the Democrats in the Old Dominion. Arthur and Chandler used Mahone's victory and highlighted their own (somewhat successful) efforts to back fusion tickets in other states in 1882, to counter Frye's challenge.Footnote 27 When Frye's initiative was proposed once again in June 1884 at the Republican National Convention, it elicited sharp debate. The issue of fairness was raised on both sides, by those who believed that state representation at the convention should better mirror state influence on Election Day as well as by those who sought to avoid blaming Southern Republicans for the disfranchisement efforts of Southern Democrats. John Lynch (R-MS), a black delegate and temporary chairman of the convention, spoke passionately about maintaining the South's level of representation in the GOP convention and suggested instead that Southern representation in Congress should be reduced because of disfranchisement, in accordance with the provisions of the 14th Amendment. In the end, the proponents of the Frye plan sensed that they lacked a majority and dropped their challenge, and the status quo arrangement was maintained.Footnote 28 With state apportionment reform defeated, Arthur could focus on retaining his hold on the presidency in 1884. Thanks to his and Chandler's strategic use of patronage appointments, he entered the convention with a solid foundation of Southern support.Footnote 29 Unfortunately, Arthur could not muster much of an additional following, and the nomination eventually went to James Blaine on the fourth ballot.Footnote 30 Nevertheless, Arthur's support among Southern delegates largely held throughout the balloting. As Charles W. Calhoun notes: “From the first to the fourth and last ballot, 82 percent of Arthur's supporters from the states of the old Confederacy stuck by the president.”Footnote 31 As the 1888 presidential election approached, the Republicans found themselves in a different situation—being the “out” presidential party for the first time in three decades. Grover Cleveland bested Blaine in 1884, and the GOP's efforts in the South had trailed off after their moderate success in 1882. By 1888, while the protection of civil and voting rights continued to be mentioned by Republican politicians, the basis of national party politics had inevitably turned to substantive differences on major economic policy (for example, the tariff would be the critical issue in the 1888 general election campaign).Footnote 32 The front-runner for the Republican nomination in 1888 was once again John Sherman of Ohio (now back in the U.S. Senate). His long history of support for black civil rights once again gave him an edge in the South.Footnote 33 However, Southern Republicans had been denied executive patronage since 1885, when Cleveland entered the White House; as a result, they were a beleaguered group, and some worried that they would sacrifice long-term loyalty for short-term benefit (in keeping with the shifting currents of nomination politics). And this is what seems to have occurred: while Sherman led the field for the first six ballots, he could not get much beyond the halfway mark in terms of winning the nomination. Moreover, he saw the Southern share of his delegate total decline, to the benefit of Russell A. Alger, lumber baron, former Union general, and former governor of Michigan, who possessed an “ample wealth [that] gave him the wherewithal to court delegates outside of Michigan, especially in the South.”Footnote 34 That Alger “bought” Southern delegates who had previously been committed to Sherman became the narrative that emerged from the convention. As James A. Kehl recounts, In explaining Sherman's decline in the South, a subordinate complained that Alger ‘bought our Negro delegates like sheep.’ Under the guise of purchasing gallery tickets from southern blacks who desperately needed expense money, Alger literally purchased the delegates who transferred their allegiance from Sherman.Footnote 35 Sherman himself also subscribed to this narrative. In his memoirs, published in 1895, Sherman made clear that he felt Alger and his lieutenants were corrupt: “I believe and had, as I thought, conclusive proof that the friends of General Alger substantially purchased the votes of many of the delegates of the Southern states who had been instructed by their conventions to vote for me.”Footnote 36 Alger responded by saying such charges had “no foundation” and indicated that Sherman's brother, General William T. Sherman, harbored no ill will toward him.Footnote 37 Prior to 1888, there had been a general belief that Southern delegates could be plied with patronage appointments, and that established loyalties would be honored during the nomination balloting. Beginning in 1888, a more base belief about Southern delegates emerged, that is, that they were available continuously to the highest bidder. More generally, as the viability of the Southern wing of the GOP declined, the degree to which the Southern state organizations became rotten boroughs increased significantly. Benjamin Harrison, Senator from Indiana, eventually won the 1888 GOP nomination and went on to defeat President Grover Cleveland (and lead the Republicans' recapture of the House and Senate) in November.Footnote 38 All else equal, Harrison, as a sitting president, should have considered renomination in 1892 to be little more than a formality. However, he presided at a time when the party was in a state of disarray, as the Republicans were slaughtered in the 1890 midterms and lost majority control of the House. In addition, Harrison's cold, impersonal style and unwillingness to play ball with GOP party bosses like Tom Platt of New York and Matt Quay of Pennsylvania on matters of patronage created significant dissension within the Republican ranks. Finally, Harrison became estranged from James Blaine, his Secretary of State, who resigned days before the Republican National Convention. As a result, a movement—led by Quay—to replace Harrison at the top of the ticket gained momentum. And Blaine appeared ready to accept the nomination, if it came to him.Footnote 39 In the end, Harrison was saved by the South. His ability to control Southern delegates with patronage was something Platt, Quay, and others could not overcome. The first hint of Harrison's convention strength came on a contest regarding the seating of delegates from Alabama, which Harrison's side won.Footnote 40 This led Quay to remark, “The Harrison people have bought up the colored fellows, and we must try to get them back.”Footnote 41 Quay then frantically tried to convince enough delegates to back Blaine or William McKinley, then a Senator from Ohio, to prevent a Harrison first-ballot majority; his hope was to extend the contest, and by doing so, steadily build a coalition against Harrison. And while he was able to whittle away at some of Harrison's strength, Quay was ultimately unsuccessful—Harrison received a 59 percent majority on the first ballot and captured the nomination. Table 2 provides a breakdown of the balloting by region. As the numbers make clear, Harrison dominated the South, winning 164.16 of 224 delegate votes, or 73.3 percent. Moreover, those 164.16 votes constituted just under 31 percent of his entire delegate total. Given that 454 votes were necessary for a convention majority, Harrison's Southern support was crucial—as he was able to manage only 371 votes outside of the former Confederacy. As James Kehl notes, “Harrison's patronage power, particularly in the South, was the decisive factor. … In the South, Blaine could attract only 10 percent of the delegate support necessary to acquire the nomination and had no asset comparable to patronage when he went forth to corner the other 90 percent.” Summing things up, with an assist from Quay himself, Kehl states, “With the Republican electoral potential of the South almost nonexistent, Quay commented that ‘the President has been renominated by the powers which cannot give him an electoral vote.’”Footnote 42 The divisive nature of Harrison's renomination would work against the Republicans in the 1892 general election, as GOP party bosses provided only tepid support in mobilizing voters. The result was that Cleveland would regain the presidency in his rematch with Harrison. This left the Republicans looking ahead to 1896 as the “out party” once again. The GOP frontrunner in 1896 would be William McKinley, who had been a (reluctant) candidate for the nomination in both 1888 and 1892. His campaign manager, Mark Hanna, had been positioning McKinley for the presidency for some time, and Hanna set out to build a majority coalition for McKinley well in advance of the convention. And having witnessed Harrison defeat a renomination challenge in 1892, and watching how he accomplished it, Hanna understood that “cultivating a strong relationship with southern Republicans [needed to be] a large part of his plan.”Footnote 43 As a result, he decided to “hunt where the ducks were” (more than a half-century before Barry Goldwater would make such a quip) and rented a house in Thomasville, Georgia, so that he and McKinley over several weeks in the winter of 1895 could host Southern GOP delegates—both black and white—and “discuss patronage and other political possibilities in a relaxed atmosphere.”Footnote 44 Hanna and McKinley had hoped to keep their Thomasville strategy as inconspicuous as possible, but word eventually leaked out, and other Republican nomination hopefuls attempted to countermobilize. But such efforts were in vain, as Hanna and McKinley's first-mover advantage paid off—McKinley went on to control the votes of 196.5 of the former Confederacy's 224 votes on his way to a landslide victory at the 1896 convention. New York GOP party boss Tom Platt showed Hanna some grudging respect in the aftermath, saying: “He had the South practically solid before some of us awakened.”Footnote 45\n\nThe 1900–1908 Period The presidential elections of 1896 and 1900 established the Republicans as the majority party across most of the United States for the better part of the next three decades. While the Republicans expanded their dominance in the Northeast, Midwest, and West, however, the South remained almost exclusively Democratic throughout this period. As a result, the traditional argument that a GOP revival in the solid South remained a possibility—which, in part, validated the sizable Southern presence at Republican conventions—increasingly lost its value. As Richard M. Valelly argues, the Republican Party's ability after 1897 to win the presidency and Congress without achieving electoral success in the South produced an “abrupt change in the costs and benefits of the party's historical southern policy.”Footnote 46 That is, Republican leaders concluded that the cost of maintaining a party organization in the South fit to contest elections in the face of an unbeatable (and very hostile)Footnote 47 Democratic majority outweighed the increasingly slim chances at Republican electoral success there.Footnote 48 In this context, the intra-Republican struggle over the South increased after the 1896 election, and the party saw a series of clashes between camps, some of which benefited from the presence of Southern delegates. Republican administrations continued to use their control of patronage in the South to produce a reliable and sizable voting bloc that played a significant role in the selection of presidential candidates in 1908, 1912, 1924, and 1928. However, in the same period, several moves were made by competing party factions to reduce the size of Southern delegations. Not all of these moves were entirely genuine; rather, some represented attempts to use the threat of reapportionment against Southern delegates to force compliance on other issues. Additionally, Republican leaders were far from consistent in their support of or opposition to Southern delegates, and were prone to changing their positions depending on whether they controlled federal patronage or not. After the 1896 election, McKinley and Hanna increased their control over the Southern GOP through the use of federal patronage. While McKinley's renomination was never in doubt, the 1900 convention, and the period leading up to it, saw two major public attempts to reduce Southern representation at the Republican National Convention. The first came in December 1899, during a two-day RNC meeting at which the convention city of 1900 was to be selected. Henry Clay Payne, RNC member from Wisconsin and an important actor in McKinley's 1896 campaign, proposed to replace the existing division of delegates (in which states received two delegates for each senator and representative they had in Congress, regardless of partisan affiliation) with a new scheme in which each state would receive four at-large delegates and one additional delegate for each 10,000 votes that it had contributed to the Republican presidential ticket in the most recent election. If passed, the plan would have significantly reduced Southern representation at the 1900 convention—from 224 delegates (25 percent of the total), under the existing rules, to 126 delegates (14 percent of the total), based on the 1896 presidential vote totals.Footnote 49 ,Footnote 50 From Payne's perspective (at least as stated publicly), this decrease in Southern representation was simply a case of fairness. He argued the necessity of such a change by asking “why the states of Alabama, Arkansas, Florida, Georgia, Louisiana, Mississippi, South Carolina, casting 200,076 Republican votes at the last Presidential election, should have 124 delegates in the National Convention, while New Jersey, casting 221,367 Republican votes, should have but twenty delegates?”Footnote 51 Unsurprisingly, Southern Republicans were not enthused with Payne's proposal; black Southern GOP members, in particular, charged Payne with attempting to drive out black delegates from the party entirely.Footnote 52 Nonetheless, Payne's proposal was considered reasonable by non-Southern party leaders given that, as the Charlotte Daily Observer noted, “the counsels of white Southern Republican delegates are lightly esteemed in the national conventions of their party and the colored delegates are regarded as so many chattels to be purchased by the highest bidder.”Footnote 53 While black Southern Republican leaders had “little hope of success”Footnote 54 in opposing Payne's proposal, it in fact never came to a vote during the RNC meeting. Instead, the selection of the 1900 convention city and the decision on Payne's delegate plan (the two crucial issues of the meeting) were settled as part of a logroll between the different regional camps. The committee members from Pennsylvania were willing to oppose the Payne plan if Philadelphia were chosen as the 1900 convention city. Meanwhile, Southern members of the RNC decided to vote as one unit on the selection of a convention city and planned to decide their preferences as to the “subject of the selection of the place of meeting in such a way as will win for them most support in their fight against reapportionment.”Footnote 55 ,Footnote 56 These negotiations were concluded successfully, as Philadelphia was selected over Chicago. The Southern bloc played a crucial role in this process—without unanimous Southern support, Pennsylvania would have lost its bid to Illinois, as the outcome was decided by a single vote. After the selection of Philadelphia, Payne was shuttled to the White House for late night meetings with McKinley and Hanna, during which he came to understand that “committeemen who had favored [the reapportionment plan] in private correspondence, had been stormed into opposition by letters and telegrams from every source.”Footnote 57 As a result, Payne withdrew his proposal the following day, stating that while he had not “in the slightest degree changed [his] conviction as to its justice,”Footnote 58 the opposition to the plan had convinced him not to offer it to a committee vote. Whether Payne himself understood the proposal to be a mere bargaining chip (all along) remains unclear, but by the end of the two-day RNC meeting, Philadelphia had been named the host of the 1900 convention with Southern support and Payne's plan for reducing Southern representation had been abandoned. During the 1900 GOP convention, Pennsylvania's Boss Matt Quay resuscitated the Payne plan, but here too the size of future Southern delegations was used as a bargaining chip to achieve a different goal—to influence the choice of the Republican vice presidential candidate. That is, with McKinley's renomination assured, the only major issue before the convention was who would become the vice presidential candidate after Garret Hobart's death in 1899. Among the most discussed options was New York Governor Theodore Roosevelt, although he was on record as having no interest in the nomination. Nonetheless, Roosevelt's candidacy was pushed by members of the New York Machine, as they sought to rid themselves of their increasingly powerful and independent governor.Footnote 59 While McKinley and Hanna had expressed no interest in having Roosevelt on the ticket, New York's Boss Platt sought Quay's help to ensure that Roosevelt would be nominated.Footnote 60 Quay believed Roosevelt's selection was possible—but only if he could win over Western and Southern delegates. The latter, however, were firmly under Hanna's control. During the second day of the convention, Quay introduced the Payne proposal to reapportion delegates but, admitting that it “involves a very radical change in the base of representation,”Footnote 61 called for a vote on the proposal to be postponed until the next day. This delay, according to Quay, would give delegates time to educate themselves on the specifics of the plan. With black Southern Republicans already frustrated at the seating of several rival “lily-white” slates (reportedly due to pressure from Quay and PayneFootnote 62 ), the Quay proposal was met with “manifest uneasiness” and the belief that its passage would result in the “death of Republicanism in the South” altogether.Footnote 63 With only hours before a scheduled vote on the matter, Southern delegates lobbied other regional delegations in an attempt to prevent the proposal's passage. Quay's introduction of the Payne delegation plan can be understood as something of a hostage situation: By proposing a change but immediately postponing further debate, Quay successfully stirred discontent among Northern delegates vis-à-vis the South, while simultaneously threatening Southern delegates with a loss of influence in the future. With Southern desperation rising, “Quay quietly leaked to Southern delegates the idea that he was prepared to withdraw the resolution if they swung their support to the New York governor.”Footnote 64 The move worked as planned: Southern delegates traded their votes for vice president in exchange for Quay dropping his reapportionment proposal.Footnote 65 Sensing imminent defeat, Hanna and McKinley accepted Roosevelt as the vice presidential nominee. At the beginning of the third day of proceedings, Quay withdrew the delegate proposal without further comment and Theodore Roosevelt was selected as McKinley's running mate. After McKinley's assassination in September 1901, Roosevelt was elevated to the presidency and, while maintaining a cordial relationship with Hanna, understood that he faced a likely challenge to the Republican nomination from the Ohio senator in 1904.Footnote 66 To build majority support at the convention, Roosevelt sought to gain control over Southern delegates through federal patronage, mostly by distributing postmaster positions. While Roosevelt (like Hayes before him) attempted to improve the standing of the GOP in the South through his willingness “to appoint Democrats rather than some of the old party hacks,”Footnote 67 he simultaneously frustrated white Southerners in both parties by appointing several black officeholders. In trying to manage the Republican Party in the South, Roosevelt therefore found himself ensnared in the expanding conflict between lily whites, who sought to make the Southern GOP a “white man's party,” and black & tans, who sought to maintain an active role for African Americans, over the control of these organizations.Footnote 68 As a result, Hanna, while no longer in direct control of patronage, remained popular in the South and a potential challenger to Roosevelt.Footnote 69 However, Hanna's sudden death in February 1904 changed things. Roosevelt's personal popularity left no credible challengers, and he was nominated unanimously during the 1904 convention. In the four years that followed, Roosevelt expanded his control of Southern GOP organizations and, during the run-up to the 1908 convention, pushed Southern delegates to support William Howard Taft's candidacy. The Roosevelt administration's use of (Southern) patronage was one of the key factors that would lead to Taft's successful nomination. Postmaster General George von Lengerke Meyer in particular played an important role in this regard: recipients of postmaster positions in the South were “selected with Mr. Taft's nomination in mind,” and while postmasters were “discouraged from being officers of the conventions or of the committees, … they could work behind the scenes and could also attend, as delegates, the national convention.”Footnote 70 Indeed, a congressional investigation of the Roosevelt administration in 1909 concluded that “the officeholders in the South practically control the Republican Party organization in their respective states” and that “nearly one in three [Southern delegates], and of some Southern states more than half” at the 1908 Republican convention were federal officeholders.Footnote 71 While Taft himself had been critical of the Southern rotten boroughs and held that votes at the Republican convention should be proportional to the party's vote share,Footnote 72 the Southern delegates proved to be a reliable base for him—of the 240 Southern delegates at the 1908 convention, 223 (an impressive 93 percent) voted for Taft on the first (and only) presidential ballot. Meanwhile, delegates from other regions that Roosevelt controlled defended the South against an attempt by anti-Taft forces to reduce Southern representation. This was done with long-term rather than short-term consequences in mind—Taft could have been nominated without this Southern support on the first ballot—as Roosevelt “was not prepared to see his successor deprived of so useful a political device”Footnote 73 as a reliable Southern voting bloc. This would have dramatic consequences for Roosevelt himself: While the outcome of the 1908 convention was one of party unity behind its new leader, the 1912 convention would see Southern delegates play a crucial role in preventing Roosevelt from regaining the leadership of the GOP.\n\nStanding at Armageddon: The South and the 1912 Republican National Convention The 1912 convention presented a crucial test of a Republican administration's ability to control Southern delegates and use them to produce a majority. With President Taft up for reelection but facing a challenge from the progressive wing of the party, his lieutenants began organizing the Republican old guard conservatives in 1911. By early 1912, Taft's reelection came to face an even bigger hurdle when Roosevelt announced that he would challenge him for the nomination. While Roosevelt had anointed Taft as his chosen successor in 1908, their relationship had soured during that campaign and Taft's subsequent presidency. Roosevelt, increasingly restless and frustrated in his exile from power, began in 1911 to consider challenging Taft's reelection.Footnote 74 On the urging of his supporters, Roosevelt in February 1912 finally decided to insert himself into the race, stating that he would not be “unresponsive to a plain public duty.”Footnote 75 Roosevelt's ability to prevent Taft's renomination was limited, however, because of the relatively low number of primaries held in 1912. Only thirteen states held a primary, and the New York election was controlled by the local Republican machine, which was hostile to Roosevelt.Footnote 76 Additionally, Roosevelt struggled to unite Republican progressives due to a clash with Senator Robert La Follette (R-WI), who claimed that Roosevelt had encouraged him to challenge Taft before Roosevelt himself jumped in. This clash made a coherent progressive coalition unlikely during the delegate selection period and the subsequent Republican National Convention. Nonetheless, Taft's ability to survive the progressive challenge would rest, at least in part, on his capacity to produce a reliable Southern bloc. As these party organizations “were kept alive on a diet of federal patronage in order to secure favorable delegates at national conventions,”Footnote 77 and because Roosevelt posed such a serious threat to Taft's renomination, near unanimous Southern support for Taft would be necessary. Charles D. Hilles, Taft's private secretary and campaign manager, was tasked with securing the South and sought to forestall the Roosevelt campaign by compelling the state committees to select their delegates as early in the election year as possible. Hilles's endeavor proved successful, with eight Southern committees choosing to select their delegates in February and March 1912, and two others selecting theirs in early April. In contrast, only four non-Southern committees held their state conventions before April.Footnote 78 This approach resulted in a predominantly pro-Taft Southern delegation: The New York Times reported that (prior to both the convention and the RNC's decisions on contested delegates) 569 delegates had been pledged to Taft or had been instructed to support him, of which 214 came from Southern states. Based on these numbers, Taft had received the support of 85 percent of all Southern GOP delegates.Footnote 79 Taft's domination of Southern delegates appears to have followed mainly from the distribution of federal patronage.Footnote 80 Indeed, evidence that the South's support for Taft was closely linked to the federal government's provision of employment is suggested by Wilensky's study of 884 Taft supporters (defined as “men and women who gave their time and money to the regular Republican cause”Footnote 81 ) in the contest for the Republican nomination. While Taft supporters who held federal offices in other regions of the country made up no more than 12 percent of his support in the sample, 44 percent of Southern supporters were federal officials (see Table 3).Footnote 82 Roosevelt, in advance of the convention, decried the role Southern delegates would play for exactly this reason. Writing in the progressive publication Outlook, Roosevelt argued that the Southern delegates “represent nothing but Mr. Taft's own officeholders and the survivors of the carpetbag regime.”Footnote 83 In the same vein, historian William Garrott Brown, a native of Alabama and a strong advocate of a competitive Republican Party in the South, asserted in an article in Harper's Weekly that “the mass of Southern Republican delegates chosen this year are not merely products of the same old methods employed in 1908” but represented a scandal that “has been flagrant for decades, but this year it is so very flagrant that one cannot help hoping something will at last be done about it.”Footnote 84 With Taft seemingly controlling more delegates than the 540 needed for a majority, the Roosevelt campaign attempted to forestall defeat by challenging a large number of Taft's pledged Southern delegates. Additionally, the Roosevelt camp proposed a cut in the total number of Southern delegates that would be admitted to the convention. Both approaches failed: with Taft in control of the RNC, only nineteen of the 254 contested delegates were awarded to Roosevelt in advance of the convention, while the proposal to decrease Southern representation was voted down 39–14.Footnote 85 The next crucial test of Taft's strength was the selection of a temporary chair at the beginning of the convention. On a close vote (570–501), conservative Senator Elihu Root (R-NY) was elected. Taft's control of the South was crucial to this success: 199 of the delegates who voted for Root were from former Confederate states (comprising 79 percent of all Southern delegates).Footnote 86 On a subsequent vote to refer all debate regarding contested delegates to the convention's Credentials Committee, the South again largely aligned with Taft: 78 percent of Southern delegates voted in favor of tabling discussion on the contested delegates.Footnote 87 Root's selection was consequential: In his role as temporary chairman, he helped the Taft camp by deciding that contested delegates had the right to vote on all of the convention's decisions, even those confirming the RNC's prior decisions on contested delegates (except those that concerned themselves).Footnote 88 This decision resulted in a majority approving the national committee's support for the Southern Taft delegates.Footnote 89 With Taft's victory now all but assured, Roosevelt called upon his delegates to bolt the convention and leave the Republican Party for a new, progressive alternative. As a result, Taft was easily renominated on the first convention ballot, while many of Roosevelt's supporters (who were still in attendance) voted “present” in protest.Footnote 90 While Taft succeeded in winning the GOP nomination, thanks in part to his solid Southern delegate bloc, the contentious 1912 convention would trigger the long-debated reapportionment of delegates. With Roosevelt running on a third-party ticket, the Republican vote in the 1912 presidential election was split, which provided Democratic candidate Woodrow Wilson with a landslide victory in the Electoral College. Taft ran third behind Wilson and Roosevelt, receiving only eight electoral votes and a mere 23.2 percent of the national vote. In the aftermath of the election, both conservatives and many of the progressives who had bolted the GOP for Roosevelt realized that some form of unification between the two camps was needed to prevent a permanent Democratic majority. Shortly after Wilson's inauguration, Republican members of Congress gathered to discuss reorganization of the party and, in the words of Senator Lawrence Sherman (R-IL), “agreed that Southern representation in the convention should be cut down according to the strength of the party in each Southern state.”Footnote 91 ,Footnote 92 In December 1913, the RNC followed the Republican congressional recommendation and voted unanimously to reduce Southern representation by adopting a new apportionment scheme, wherein each state would receive two at-large delegates, but congressional districts would only receive a delegate if the GOP vote in the 1914 midterms was 7,500 or higher. The committee's decision would require ratification by those states that voted Republican in the 1908 election (of which two-thirds would be required to support the proposed reapportionment).Footnote 93 Without a Republican president in the White House to protect Southern delegates against the proposal, RNC Chairman Hilles announced in October 1914 that the plan had been ratified, and thus the division of delegates at the 1916 convention would be based upon the new apportionment scheme.Footnote 94 As a result, Southern representation at the 1916 convention declined relative to 1912: Every former Confederate state lost delegates (a total of seventy-eight for the South as a whole), and the South's proportion of convention delegates decreased from 23.4 percent to 17.6 percent."}, {"url": "https://prabook.com/web/arthur.sewall/3762372", "page_content": "Arthur Sewall\n\npolitician shipbuilder statesman\n\nJanuary 25, 1835 (age 65) Bath, Maine, United States\n\nHe began his active shipbuilding career in 1854 as the American merchant marine reached its zenith. With his elder brother, Edward, he formed the firm of E. & A. Sewall and commenced work in the family yard on the Kennebec. The Holyhead, of some 1100 tons, launched in 1855, was the first of his eighty vessels. Upon Edward's death he took a son and a nephew as partners, and the firm in 1879 became A. Sewall & Company. Though English vessels, utilizing iron, steel, and steam, were driving the wooden American sailing vessels out of competition, the Sewalls specialized in the latter type, doing much to keep it alive in the period of decline. They generally retained ownership of the ships they built and at one time owned a fleet of more than twenty-five. Their shipwrights and captains were usually natives of the Kennebec valley. During the Civil War he refused to have his ships take advantage of British registry, and his Vigilant was captured on her maiden voyage by the Confederate raider, Sumter. In the decade following the war, the Sewalls turned out a number of celebrated ships, including the Undaunted, Eric the Red, El Capitan, Occidental, Oriental, Continental, Harvester, Reaper, Thrasher, and Granger. Then came a depression without even the usual \"ship a year, \" but in the early nineties they built their \"Big Four, \" the Rappahannock, Shenandoah, Susquehanna, and Roanoke, averaging more than 3000 tons. The next step was iron. Sewall was interested in Gen. Thomas W. Hyde's Bath Iron Works, organized in 1889, which built the Machias, Castine, and Katahdin for the new navy. After visiting England to study the latest methods he began to build steel sailing vessels, and in 1894 the steel Dirigo was launched. His last ship, launched a month after his death, was the William P. Frye, sunk January 28, 1915, the first American vessel sunk by the Germans in the World War. He was at various times president of the Eastern Railroad and of the Central Railroad, and a director of the Boston and Maine Railroad. From 1871 until his death he was president of the Bath National Bank. He was the most prominent of the Maine Democrats, those constant supporters of forlorn hopes in that Republican stronghold, but the only elective offices he ever received were as councilman and alderman in Bath. He was a delegate to the national conventions in 1876, 1880, and 1888; in the next two campaigns he served on the executive committee of the Democratic national committee, and in 1896 he was nominated for vice-president on the fifth ballot and took an active part in the campaign. In 1900 he was stricken with apoplexy at his summer home at Small Point, just below Bath, where he died."}]}