{"Arthur Sewall was born on August 9, 1835.": [{"url": "https://www.geni.com/people/Arthur-Sewall/6000000004565891749", "page_content": "About Arthur Sewall\n\nhttps://www.wikitree.com/wiki/Sewall-171\n\nhttps://www.findagrave.com/memorial/7232538\n\nWilliam J. Bryan's running mate of the Presidency in 1896.\n\nPolitician. Served as a Member of the Democratic National Committee from Maine from 1888-1896, and Democratic Candidate for Vice President of the United States in 1896.\n\nUpon his brother's death the company became Arthur Sewall & Co (shipbuilders) built largest wooden ship Roanoke in 1894 launched the Dirigo first steel sailing ship built in America. President of the Eastern railway,Director of the Boston &Maine,New York & New England,and Mexican Centrail railroads.\n\nhttp://en.wikipedia.org/wiki/Arthur_Sewall\n\nArthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. As the Populist Party nominee, Bryan had another running mate as well, Thomas E. Watson. Sewall never held elective office, although he was a member of the Democratic National Committee from 1888 to 1896.\n\nArthur Sewall's main claim to fame had been as an exceptionally successful, wealthy shipbuilder and New England industrialist. He was a director of the Maine Central railroad and President of the Bath National Bank for years. His selection is believed to have been an effort to win votes among conservative and New England members of the party who were disturbed by the populist aspects of William Jennings Bryan. Arthur Sewall is also one of the few politicians to be an adherent of Swedenborgianism, a religion based on the writings of Swedish theologian Emanuel Swedenborg.\n\nHis main vice-presidential opponent, Garret A. Hobart (Rep), was also an Eastern banker and industrialist who had served on his party's national committee.\n\nSewall was Bryan's running mate for the first of Bryan's three times as the Democratic presidential nominee. He died not long after Bryan was nominated for the second time in 1900.\n\nSewall's grandson, Sumner Sewall, served as Governor of Maine from 1941 to 1945, as a Republican.\n\nLegacy\n\nIn 2008, the St. Louis Post-Dispatch referenced Sewall in an article criticizing Senator John McCain's selection of Gov. Sarah Palin as his vice presidential candidate in the 2008 presidential election, saying he had picked \"the least qualified running mate since the Swedenborgian shipbuilder Arthur Sewall ran as William Jennings Bryan's No. 2 in 1896.\""}, {"url": "https://www.findagrave.com/memorial/7232538/arthur-sewall", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://maineanencyclopedia.com/sewall-arthur/", "page_content": "(1896-1900) was born in Bath, son of one of the City’s first shipbuilders, in whose shipyards he worked learning the trade. In 1854, he and his brother Edward formed E. & A. Sewall continuing their father’s business. It became Arthur Sewall & Co. when his brother died.\n\nArthur Sewall’s firm built 80 ships over 50 years. During the Civil War his ship Vigilant was captured by the Sumter, a Confederate blockade raider. In 1892 his company built the largest wooden sailing ship in the United States, the Roanoke. In 1894 he launched the first American-built, steel-hulled, square-rigger, the Dirigo.\n\nSewall was president (1884-1893) of the Maine Central Railroad, president of the Eastern Railroad, the Boston and Maine Railroad and others. He was also president of the Bath National Bank from 1871 to 1900.\n\nHe was a leader of the Democratic Party in Maine, serving on the Democratic National Committee. In 1893, he was a candidate for the U.S. Senate, losing the election in the Republican-dominated state legislature. The national Democratic Party nominated him as their vice-presidential candidate, along with presidential candidate William Jennings Bryan, in 1896.\n\nArthur Sewall died at his summer home at Small Point in Phippsburg September 5, 1900.\n\nAdditional resources\n\n“Biographies: Arthur Sewall.” Harpweek. http://elections.harpweek.com/1896/bio-1896-Full.asp?UniqueID=4&Year=1896 (accessed April 17, 2015)\n\nBunting, William Henry. Live Yankees: the Sewalls and their Ships. Gardiner, Me. Tilbury House. Bath, Me. Maine Maritime Museum. 2009.\n\nYakowicz, Susie. Steel Glory: The Life of Shipbuilder Arthur Sewall, 1835-1900. Eagan, Minn. S. Yakowicz. c1996."}, {"url": "https://uspresidentialhistory.com/arthur-sewall/", "page_content": "OVERVIEW:\n\nBORN:\n\nNovember 25, 1835\n\nBath, Maine\n\nDIED:\n\nSeptember 5, 1900 (age 64)\n\nSmall Point, Maine\n\nPOLITICAL PARTY:\n\nDemocrat\n\nHIGHLIGHTS:\n\n1884-1893:\n\nPresident of the Maine Central Railroad\n\n1896:\n\nDemocratic Nominee for Vice President\n\n\n\nRESOURCES:\n\nMaine Historical Society\n\nMaine Encyclopedia\n\nWikipedia"}, {"url": "https://faculty.nps.edu/bneta/Sewall-arthur.html", "page_content": "Sewall, Arthur\n\n(source: The National Cyclopaedia of American Biography)\n\n<![if !supportEmptyParas]> <![endif]>\n\nShipbuilder and politician, was born at Bath, ME, Nov. 25, 1835, third son of William Dunning and Rachel (Trufant) Sewall. He was a lineal descendant of Henry Sewall, mayor of Coventry, England, one of whose grandsons was married to Jane Dummer, and emigrated to Newbury, MA, in 1634. Samuel Sewall, who settled at York, ME, in 1708, had two sons: David, first U.S. judge for the district of Maine, appointed by Washington, and Dummer Sewall, a distinguished soldier and the great grandfather of Arthur Sewall. The latter obtained a lieutenancy under Amherst in the Canada campaign, and in 1775 joined the revolutionary army as a lieutenant colonel. After the adoption of the constitution of Massachusetts, he was elected a senator from the state; he was also a memebr of the state convention which ratified the Constitution of the United States. The father of Arthur Sewall was one of the earliest and most prominent shipbuilder of Bath. He built his first ship, the Diana, a vessel of 199 tons burden, in 1823, and in 1841 launched the ship Rappahannock, which though of little over 1,000 tons burden, was at that time the largest ship afloat. He also held large interest in railroad and other important corporations. As his sons completed their education they joined their father in business, and Arthur on leaving shchool was sent in the interests of the firm to Prince Edward Island to buy timber for the shipyard at Bath. Returning, he entered the employs of his father's firm in 1853, and in 1854 formed, with his elder brother, the firm of E. & A. Sewall, which took over the business of the old firm of William D. Sewall and Clark & Sewall. On the death of the elder brother, in 1879, the name of the firm was changed to Arthur Sewall & Co., being made up of the senior partner, with his nephew, Samuel S. Sewall, and his second son, William D. Sewall. Since January, 1855, when the brothers launched their first ship, the Holyhead, a vessel of over 1,100 tons, one ship a year, on an average, has been built in the sewall shipyard. The largest and the best built wooden ships in the world are the product of this yad. With the giant Roanoke this era of ship-building was closed, and the firm turned its attention to building steel vessels, the ship Dirigo, launched in 1894, being the first of its class followed in quick succession by others of the largest size. Mr. Sewall had supreme faith in the ultimate maritime supremacy of the United States, and lost no opportunity, by public and private effort, to forward this end. He was prominent in other fields of commercial and industrial enterprise; was a director in the Maine Central railroad, and its president for nine years, 1884-93; was also president of the Eastern railroad, and the Boston and Maine, and director in the Mexican Central and other roads. He was president of the Bath National Bank, holding the office for 29 years, to the time of his death. He was the leader of the Democratic party in Maine, but held only minor political offices; was a delegate to the national Democratic convention at Baltimore in 1872; to that at Cincinnati in 1880, and delegate-at-large to that which nominated Cleveland in 1884. In 1888 he attended the convention at St. Louis, where he was elected a member of the Democratic national committee, and was a member of its executive committee for the campaign of that year. At the Chicago convention of 1892 he was elected to the same office. In 1896 he was nominated for the vice-presidency on the ticket with William J. Bryan. He was also a delegate to the national convention of 1900, and there elected again a member of the national committee. He was married in 1859, to Emma Duncan, daughter of Charles Crooker, a ship-builder and merchant, of Bath, ME, and, like her husband, a descendant of Samuel Sewall, of York. They had three sons, two of whom are living: Harold, consul-general at Samoa under Cleveland and Harrison; attached to the Berlin commission for the settlement of the Samoan affairs, and minister to Hawaii, under McKinley, to the time of its annexation, and William D. Sewall, a member of the firm. Arthur Sewall sied at Smallpoint, ME, Sept. 5, 1900."}, {"url": "https://en.unionpedia.org/Arthur_Sewall", "page_content": "Arthur Sewall Arthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. [1]\n\n27 relations: Adlai Stevenson I, Bath, Maine, Democratic National Committee, Democratic Party (United States), Emanuel Swedenborg, Garret Hobart, Harold M. Sewall, John McCain, List of United States Democratic Party presidential tickets, Maine, Maine Central Railroad Company, People's Party (United States), Phippsburg, Maine, Republican Party (United States), Sarah Palin, St. Louis Post-Dispatch, Sumner Sewall, Sweden, The New Church (Swedenborgian), Thomas E. Watson, United States, United States presidential election, 1896, United States presidential election, 1900, United States presidential election, 2008, Vice President of the United States, William Jennings Bryan, William Jennings Bryan presidential campaign, 1896.\n\nAdlai Ewing Stevenson (October 23, 1835 – June 14, 1914) served as the 23rd Vice President of the United States (1893–97).\n\nNew!!: Arthur Sewall and Adlai Stevenson I · See more »\n\nBath is a city in Sagadahoc County, Maine, in the United States.\n\nNew!!: Arthur Sewall and Bath, Maine · See more »\n\nThe Democratic National Committee (DNC) is the formal governing body for the United States Democratic Party.\n\nNew!!: Arthur Sewall and Democratic National Committee · See more »\n\nThe Democratic Party is one of the two major contemporary political parties in the United States, along with the Republican Party (nicknamed the GOP for Grand Old Party).\n\nNew!!: Arthur Sewall and Democratic Party (United States) · See more »\n\nEmanuel Swedenborg ((born Emanuel Swedberg; 29 January 1688 – 29 March 1772) was a Swedish Lutheran theologian, scientist, philosopher, revelator and mystic who inspired Swedenborgianism. He is best known for his book on the afterlife, Heaven and Hell (1758). Swedenborg had a prolific career as an inventor and scientist. In 1741, at 53, he entered into a spiritual phase in which he began to experience dreams and visions, beginning on Easter Weekend, on 6 April 1744. It culminated in a 'spiritual awakening' in which he received a revelation that he was appointed by the Lord Jesus Christ to write The Heavenly Doctrine to reform Christianity. According to The Heavenly Doctrine, the Lord had opened Swedenborg's spiritual eyes so that from then on, he could freely visit heaven and hell and talk with angels, demons and other spirits and the Last Judgment had already occurred the year before, in 1757. For the last 28 years of his life, Swedenborg wrote 18 published theological works—and several more that were unpublished. He termed himself a \"Servant of the Lord Jesus Christ\" in True Christian Religion, which he published himself. Some followers of The Heavenly Doctrine believe that of his theological works, only those that were published by Swedenborg himself are fully divinely inspired.\n\nNew!!: Arthur Sewall and Emanuel Swedenborg · See more »\n\nGarret Augustus Hobart (June 3, 1844 – November 21, 1899) was the 24th Vice President of the United States, serving from 1897 until his death in 1899.\n\nNew!!: Arthur Sewall and Garret Hobart · See more »\n\nHarold Marsh Sewall (January 3, 1860 – October 28, 1924) was an American politician and diplomat.\n\nNew!!: Arthur Sewall and Harold M. Sewall · See more »\n\nJohn Sidney McCain III (born August 29, 1936) is an American politician serving as the senior United States Senator from Arizona, a seat he was first elected to in 1986.\n\nNew!!: Arthur Sewall and John McCain · See more »\n\nThis is a list of the candidates for the offices of President of the United States and Vice President of the United States of the modern Democratic Party of the United States.\n\nNew!!: Arthur Sewall and List of United States Democratic Party presidential tickets · See more »\n\nMaine is a U.S. state in the New England region of the northeastern United States.\n\nNew!!: Arthur Sewall and Maine · See more »\n\nThe Maine Central Railroad Company was a former U. S. Class I railroad in central and southern Maine.\n\nNew!!: Arthur Sewall and Maine Central Railroad Company · See more »\n\nThe People's Party, also known as the Populist Party or the Populists, was an agrarian-populist political party in the United States.\n\nNew!!: Arthur Sewall and People's Party (United States) · See more »\n\nPhippsburg is a town in Sagadahoc County, Maine, United States, on the west side of the mouth of the Kennebec River.\n\nNew!!: Arthur Sewall and Phippsburg, Maine · See more »\n\nThe Republican Party, also referred to as the GOP (abbreviation for Grand Old Party), is one of the two major political parties in the United States, the other being its historic rival, the Democratic Party.\n\nNew!!: Arthur Sewall and Republican Party (United States) · See more »\n\nSarah Louise Palin (née Heath; born February 11, 1964) is an American politician, commentator, author, and reality television personality, who served as the ninth Governor of Alaska from 2006 until her resignation in 2009.\n\nNew!!: Arthur Sewall and Sarah Palin · See more »\n\nThe St.\n\nNew!!: Arthur Sewall and St. Louis Post-Dispatch · See more »\n\nSumner Sewall (June 17, 1897January 25, 1965) was a U.S. Republican politician and airline executive who served as the 58th Governor of Maine from 1941 to 1945.\n\nNew!!: Arthur Sewall and Sumner Sewall · See more »\n\nSweden (Sverige), officially the Kingdom of Sweden (Swedish), is a Scandinavian country in Northern Europe.\n\nNew!!: Arthur Sewall and Sweden · See more »\n\nThe New Church (or Swedenborgianism) is the name for several historically related Christian denominations that developed as a new religious movement, informed by the writings of scientist and Swedish Lutheran theologian Emanuel Swedenborg (1688–1772).\n\nNew!!: Arthur Sewall and The New Church (Swedenborgian) · See more »\n\nThomas Edward \"Tom\" Watson (September 5, 1856 – September 26, 1922) was an American politician, attorney, newspaper editor and writer from Georgia.\n\nNew!!: Arthur Sewall and Thomas E. Watson · See more »\n\nThe United States of America (USA), commonly known as the United States (U.S.) or America, is a federal republic composed of 50 states, a federal district, five major self-governing territories, and various possessions.\n\nNew!!: Arthur Sewall and United States · See more »\n\nThe United States presidential election of 1896 was the 28th quadrennial presidential election, held on Tuesday, November 3, 1896.\n\nNew!!: Arthur Sewall and United States presidential election, 1896 · See more »\n\nThe United States presidential election of 1900 was the 29th quadrennial presidential election, held on Tuesday, November 6, 1900.\n\nNew!!: Arthur Sewall and United States presidential election, 1900 · See more »\n\nThe United States presidential election of 2008 was the 56th quadrennial presidential election.\n\nNew!!: Arthur Sewall and United States presidential election, 2008 · See more »\n\nThe Vice President of the United States (informally referred to as VPOTUS, or Veep) is a constitutional officer in the legislative branch of the federal government of the United States as the President of the Senate under Article I, Section 3, Clause 4, of the United States Constitution, as well as the second highest executive branch officer, after the President of the United States.\n\nNew!!: Arthur Sewall and Vice President of the United States · See more »\n\nWilliam Jennings Bryan (March 19, 1860 – July 26, 1925) was an American orator and politician from Nebraska.\n\nNew!!: Arthur Sewall and William Jennings Bryan · See more »\n\nIn 1896, William Jennings Bryan ran unsuccessfully for President of the United States.\n\nNew!!: Arthur Sewall and William Jennings Bryan presidential campaign, 1896 · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Arthur_Sewall"}, {"url": "https://www.sewallgenealogy.com/p35.htm", "page_content": "Barlow\n\nSewall\n\nMarjorie Barlow Ackerman, 76, was bom on September 7, 1921, in Lake Township, Pa., to Arthur and Rose Barlow and died October 10, 1997, in a local nursing home following a brief illness.She moved to Pensacola in 1988 from West Palm Beach. She was preceded in death by her husband, Harold Ackerman, her parents and brother, Arthur James Barlow.She is survived by her daughters, Karen (James) Bennington of Mercer, Pa., and Kathy Sewall of Pittsburgh, Pa; her sister. Irene (Richard) Benfield of Pensacola; sister-in-law, Ruth Ackerman of Ellis Grove, III; and stepdaughter, Helen Michell of Zephryhills.She is also survived by three grandchildren and five great-grandchildren.She was a member of the Olive Baptist Church in PensacolaFuneral services will be at 11a.m. Tuesday, October 14. 1997 in Eastern Gate Memorial Funeral Home with the Rev. Hoyt Swann officiating.Friends may call at the funeral home one hour before the serviceBurial will be in Lake Worth Memory Gardens in Lake Worth."}, {"url": "https://commons.wikimedia.org/wiki/Category:Arthur_Sewall", "page_content": "This category has only the following subcategory.\n\nMedia in category \"Arthur Sewall\"\n\nThe following 9 files are in this category, out of 9 total."}, {"url": "https://prabook.com/web/arthur.sewall/3762372", "page_content": "Arthur Sewall\n\npolitician shipbuilder statesman\n\nJanuary 25, 1835 (age 65) Bath, Maine, United States\n\nHe began his active shipbuilding career in 1854 as the American merchant marine reached its zenith. With his elder brother, Edward, he formed the firm of E. & A. Sewall and commenced work in the family yard on the Kennebec. The Holyhead, of some 1100 tons, launched in 1855, was the first of his eighty vessels. Upon Edward's death he took a son and a nephew as partners, and the firm in 1879 became A. Sewall & Company. Though English vessels, utilizing iron, steel, and steam, were driving the wooden American sailing vessels out of competition, the Sewalls specialized in the latter type, doing much to keep it alive in the period of decline. They generally retained ownership of the ships they built and at one time owned a fleet of more than twenty-five. Their shipwrights and captains were usually natives of the Kennebec valley. During the Civil War he refused to have his ships take advantage of British registry, and his Vigilant was captured on her maiden voyage by the Confederate raider, Sumter. In the decade following the war, the Sewalls turned out a number of celebrated ships, including the Undaunted, Eric the Red, El Capitan, Occidental, Oriental, Continental, Harvester, Reaper, Thrasher, and Granger. Then came a depression without even the usual \"ship a year, \" but in the early nineties they built their \"Big Four, \" the Rappahannock, Shenandoah, Susquehanna, and Roanoke, averaging more than 3000 tons. The next step was iron. Sewall was interested in Gen. Thomas W. Hyde's Bath Iron Works, organized in 1889, which built the Machias, Castine, and Katahdin for the new navy. After visiting England to study the latest methods he began to build steel sailing vessels, and in 1894 the steel Dirigo was launched. His last ship, launched a month after his death, was the William P. Frye, sunk January 28, 1915, the first American vessel sunk by the Germans in the World War. He was at various times president of the Eastern Railroad and of the Central Railroad, and a director of the Boston and Maine Railroad. From 1871 until his death he was president of the Bath National Bank. He was the most prominent of the Maine Democrats, those constant supporters of forlorn hopes in that Republican stronghold, but the only elective offices he ever received were as councilman and alderman in Bath. He was a delegate to the national conventions in 1876, 1880, and 1888; in the next two campaigns he served on the executive committee of the Democratic national committee, and in 1896 he was nominated for vice-president on the fifth ballot and took an active part in the campaign. In 1900 he was stricken with apoplexy at his summer home at Small Point, just below Bath, where he died."}, {"url": "https://snaccooperative.org/view/70090964", "page_content": "Joseph Sewall (1795-1851) was the son of Joseph Sewall (1770-1852) and Lydia Marsh Sewall (1773-1805) of Bath, Me. The younger Sewall graduated from Bowdoin College in 1812 and practiced law in Bath. He served as Collector of Customs for the port of Bath, was active in civic affairs of his hometown, and was appointed adjutant general for the state of Maine, 1833-1834. He was the uncle of Arthur Sewall (1835-1900), the famous shipbuilder, and of Frank Sewall (1837-1915), the Swedenborgian clergyman. He was also a distant relative of Joseph Sewall (1688-1769), William Bartlett Sewall (1782-1869), and Edmund Quincy Sewall (1828-1908).\n\nFrom the description of Papers, 1762-1907. (American Antiquarian Society). WorldCat record id: 191276162\n\nAdjutant general of Maine and collector of customs for the District of Bath.\n\nFrom the description of Papers of Joseph Sewall, 1832-1907 (bulk 1832-1842). (Unknown). WorldCat record id: 79448842\n\nBiographical Note\n\nJoseph Sewall was born in 1795, in Bath, Maine, graduated from Bowdoin College in 1812, and practiced law in Bath, where he was collector of customs, 1842-1842, and adjutant general for the state of Maine, 1833-1834. Sewall died in 1851. His birth and death dates were obtained from the Library of Congress catalog that cites a lecture read by Sewall before the Lyceum (1833), entitled “the History of Bath,” Collections of the Maine Historical Society, vol. 2, 1847, pp. 189-228. Genealogical information was obtained from Louis Clinton Hatch, Maine: A History (New York, American Historical Society, 1919). vol. 4, pp. 383-385.\n\nFrom the guide to the Joseph Sewall Papers, 1832-1907, (bulk 1832-1842), (Manuscript Division Library of Congress)"}], "Arthur Sewall died on April 14, 1900.": [{"url": "https://www.geni.com/people/Arthur-Sewall/6000000004565891749", "page_content": "About Arthur Sewall\n\nhttps://www.wikitree.com/wiki/Sewall-171\n\nhttps://www.findagrave.com/memorial/7232538\n\nWilliam J. Bryan's running mate of the Presidency in 1896.\n\nPolitician. Served as a Member of the Democratic National Committee from Maine from 1888-1896, and Democratic Candidate for Vice President of the United States in 1896.\n\nUpon his brother's death the company became Arthur Sewall & Co (shipbuilders) built largest wooden ship Roanoke in 1894 launched the Dirigo first steel sailing ship built in America. President of the Eastern railway,Director of the Boston &Maine,New York & New England,and Mexican Centrail railroads.\n\nhttp://en.wikipedia.org/wiki/Arthur_Sewall\n\nArthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. As the Populist Party nominee, Bryan had another running mate as well, Thomas E. Watson. Sewall never held elective office, although he was a member of the Democratic National Committee from 1888 to 1896.\n\nArthur Sewall's main claim to fame had been as an exceptionally successful, wealthy shipbuilder and New England industrialist. He was a director of the Maine Central railroad and President of the Bath National Bank for years. His selection is believed to have been an effort to win votes among conservative and New England members of the party who were disturbed by the populist aspects of William Jennings Bryan. Arthur Sewall is also one of the few politicians to be an adherent of Swedenborgianism, a religion based on the writings of Swedish theologian Emanuel Swedenborg.\n\nHis main vice-presidential opponent, Garret A. Hobart (Rep), was also an Eastern banker and industrialist who had served on his party's national committee.\n\nSewall was Bryan's running mate for the first of Bryan's three times as the Democratic presidential nominee. He died not long after Bryan was nominated for the second time in 1900.\n\nSewall's grandson, Sumner Sewall, served as Governor of Maine from 1941 to 1945, as a Republican.\n\nLegacy\n\nIn 2008, the St. Louis Post-Dispatch referenced Sewall in an article criticizing Senator John McCain's selection of Gov. Sarah Palin as his vice presidential candidate in the 2008 presidential election, saying he had picked \"the least qualified running mate since the Swedenborgian shipbuilder Arthur Sewall ran as William Jennings Bryan's No. 2 in 1896.\""}, {"url": "https://maineanencyclopedia.com/sewall-arthur/", "page_content": "(1896-1900) was born in Bath, son of one of the City’s first shipbuilders, in whose shipyards he worked learning the trade. In 1854, he and his brother Edward formed E. & A. Sewall continuing their father’s business. It became Arthur Sewall & Co. when his brother died.\n\nArthur Sewall’s firm built 80 ships over 50 years. During the Civil War his ship Vigilant was captured by the Sumter, a Confederate blockade raider. In 1892 his company built the largest wooden sailing ship in the United States, the Roanoke. In 1894 he launched the first American-built, steel-hulled, square-rigger, the Dirigo.\n\nSewall was president (1884-1893) of the Maine Central Railroad, president of the Eastern Railroad, the Boston and Maine Railroad and others. He was also president of the Bath National Bank from 1871 to 1900.\n\nHe was a leader of the Democratic Party in Maine, serving on the Democratic National Committee. In 1893, he was a candidate for the U.S. Senate, losing the election in the Republican-dominated state legislature. The national Democratic Party nominated him as their vice-presidential candidate, along with presidential candidate William Jennings Bryan, in 1896.\n\nArthur Sewall died at his summer home at Small Point in Phippsburg September 5, 1900.\n\nAdditional resources\n\n“Biographies: Arthur Sewall.” Harpweek. http://elections.harpweek.com/1896/bio-1896-Full.asp?UniqueID=4&Year=1896 (accessed April 17, 2015)\n\nBunting, William Henry. Live Yankees: the Sewalls and their Ships. Gardiner, Me. Tilbury House. Bath, Me. Maine Maritime Museum. 2009.\n\nYakowicz, Susie. Steel Glory: The Life of Shipbuilder Arthur Sewall, 1835-1900. Eagan, Minn. S. Yakowicz. c1996."}, {"url": "https://www.nytimes.com/1900/09/09/archives/funeral-of-arthur-sewall.html", "page_content": "Credit... The New York Times Archives\n\nSeptember 9, 1900 , Page 15 Buy Reprints See the article in its original context fromSeptember 9, 1900 , Page 15 View on timesmachine TimesMachine is an exclusive benefit for home delivery and digital subscribers.\n\nFull text is unavailable for this digitized archive article. Subscribers may view the full text of this article in its original form through TimesMachine."}, {"url": "https://www.wikitree.com/wiki/Sewall-171", "page_content": "Arthur Sewall\n\n25 Nov 1835 in Bath, Maine Bornin\n\nAncestors\n\nHarriet Hyde (Sewall) Cutler Brother of\n\nEmma Duncan Crooker Husband of— married [date unknown] [location unknown]\n\nDescendants\n\n5 Sep 1900 at age 64 in Small Point, Maine Diedin\n\nProfile last modified 8 Jan 2023 | Created 5 Dec 2015\n\nThis page has been accessed 506 times.\n\nBiography\n\nOn November 25, 1835 Arthur Sewall was born to William and Rachel Sewall in Small Point, Maine.\n\nHe was an American Democratic politician and shipbuilder from Maine, best known as the Democratic nominee for Vice President of the United States in 1896. From 1888 to 1896 he served as a member of the Democratic National Committee and unsuccessful ran for Maine's Senate seat against Eugene Hale. The only elective offices Sewall held were as councilman and alderman in the town of Bath, Maine.\n\nOn September 5, 1900 Sewall died in Small Point, Maine from apoplexy and at the time of his death he was worth $5,000,000 ($152,282,302 with inflation).\n\nSewall's grandson, Sumner Sewall, served as Governor of Maine from 1941 to 1945, as a Republican.\n\nSources\n\n\n\n"}, {"url": "https://www.findagrave.com/memorial/7232538/arthur-sewall", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://en-academic.com/dic.nsf/enwiki/491754", "page_content": "Infobox Politician\n\nname = Arthur Sewall\n\n\n\n\n\nwidth =\n\ncaption =\n\nsmall_\n\n\n\nbirth_date = November 25 , 1835\n\nbirth_place =\n\ndeath_date = September 5 , 1900 (aged 64)\n\ndeath_place =\n\nparty = Democratic\n\notherparty =\n\nrelations =\n\nspouse =\n\ncivil partner =\n\nchildren =\n\nresidence =\n\noccupation =\n\nreligion =\n\n\n\n\n\nwebsite =\n\nfootnotes =\n\nArthur Sewall ( November 25 , 1835 – September 5 , 1900 ) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. As the Populist Party nominee, Bryan had another running mate as well, Thomas E. Watson . Sewall never held elective office, although he was a member of the Democratic National Committee from 1888 to 1896] . Arthur Sewall's main claim to fame had been as a wealthy shipbuilder and New England industrialist. He was a director in the Maine Central railroad and President of the Bath National Bank for years. His selection is believed to have been an effort to win votes among conservative and New England members of the party who were disturbed by the populist aspects of William Jennings Bryan. Arthur Sewall is also one of the few politicians to be an adherent of Swedenborgianism [ http://politicalgraveyard.com/group/swedenborgian.html ] .\n\nTrivia\n\nHis main vice-presidential opponent, Garret A. Hobart (Rep), was also an eastern banker and industrialist who had served in his party's national committee. The two also wore large mustaches.\n\nExternal links"}, {"url": "https://en.unionpedia.org/Arthur_Sewall", "page_content": "Arthur Sewall Arthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. [1]\n\n27 relations: Adlai Stevenson I, Bath, Maine, Democratic National Committee, Democratic Party (United States), Emanuel Swedenborg, Garret Hobart, Harold M. Sewall, John McCain, List of United States Democratic Party presidential tickets, Maine, Maine Central Railroad Company, People's Party (United States), Phippsburg, Maine, Republican Party (United States), Sarah Palin, St. Louis Post-Dispatch, Sumner Sewall, Sweden, The New Church (Swedenborgian), Thomas E. Watson, United States, United States presidential election, 1896, United States presidential election, 1900, United States presidential election, 2008, Vice President of the United States, William Jennings Bryan, William Jennings Bryan presidential campaign, 1896.\n\nAdlai Ewing Stevenson (October 23, 1835 – June 14, 1914) served as the 23rd Vice President of the United States (1893–97).\n\nNew!!: Arthur Sewall and Adlai Stevenson I · See more »\n\nBath is a city in Sagadahoc County, Maine, in the United States.\n\nNew!!: Arthur Sewall and Bath, Maine · See more »\n\nThe Democratic National Committee (DNC) is the formal governing body for the United States Democratic Party.\n\nNew!!: Arthur Sewall and Democratic National Committee · See more »\n\nThe Democratic Party is one of the two major contemporary political parties in the United States, along with the Republican Party (nicknamed the GOP for Grand Old Party).\n\nNew!!: Arthur Sewall and Democratic Party (United States) · See more »\n\nEmanuel Swedenborg ((born Emanuel Swedberg; 29 January 1688 – 29 March 1772) was a Swedish Lutheran theologian, scientist, philosopher, revelator and mystic who inspired Swedenborgianism. He is best known for his book on the afterlife, Heaven and Hell (1758). Swedenborg had a prolific career as an inventor and scientist. In 1741, at 53, he entered into a spiritual phase in which he began to experience dreams and visions, beginning on Easter Weekend, on 6 April 1744. It culminated in a 'spiritual awakening' in which he received a revelation that he was appointed by the Lord Jesus Christ to write The Heavenly Doctrine to reform Christianity. According to The Heavenly Doctrine, the Lord had opened Swedenborg's spiritual eyes so that from then on, he could freely visit heaven and hell and talk with angels, demons and other spirits and the Last Judgment had already occurred the year before, in 1757. For the last 28 years of his life, Swedenborg wrote 18 published theological works—and several more that were unpublished. He termed himself a \"Servant of the Lord Jesus Christ\" in True Christian Religion, which he published himself. Some followers of The Heavenly Doctrine believe that of his theological works, only those that were published by Swedenborg himself are fully divinely inspired.\n\nNew!!: Arthur Sewall and Emanuel Swedenborg · See more »\n\nGarret Augustus Hobart (June 3, 1844 – November 21, 1899) was the 24th Vice President of the United States, serving from 1897 until his death in 1899.\n\nNew!!: Arthur Sewall and Garret Hobart · See more »\n\nHarold Marsh Sewall (January 3, 1860 – October 28, 1924) was an American politician and diplomat.\n\nNew!!: Arthur Sewall and Harold M. Sewall · See more »\n\nJohn Sidney McCain III (born August 29, 1936) is an American politician serving as the senior United States Senator from Arizona, a seat he was first elected to in 1986.\n\nNew!!: Arthur Sewall and John McCain · See more »\n\nThis is a list of the candidates for the offices of President of the United States and Vice President of the United States of the modern Democratic Party of the United States.\n\nNew!!: Arthur Sewall and List of United States Democratic Party presidential tickets · See more »\n\nMaine is a U.S. state in the New England region of the northeastern United States.\n\nNew!!: Arthur Sewall and Maine · See more »\n\nThe Maine Central Railroad Company was a former U. S. Class I railroad in central and southern Maine.\n\nNew!!: Arthur Sewall and Maine Central Railroad Company · See more »\n\nThe People's Party, also known as the Populist Party or the Populists, was an agrarian-populist political party in the United States.\n\nNew!!: Arthur Sewall and People's Party (United States) · See more »\n\nPhippsburg is a town in Sagadahoc County, Maine, United States, on the west side of the mouth of the Kennebec River.\n\nNew!!: Arthur Sewall and Phippsburg, Maine · See more »\n\nThe Republican Party, also referred to as the GOP (abbreviation for Grand Old Party), is one of the two major political parties in the United States, the other being its historic rival, the Democratic Party.\n\nNew!!: Arthur Sewall and Republican Party (United States) · See more »\n\nSarah Louise Palin (née Heath; born February 11, 1964) is an American politician, commentator, author, and reality television personality, who served as the ninth Governor of Alaska from 2006 until her resignation in 2009.\n\nNew!!: Arthur Sewall and Sarah Palin · See more »\n\nThe St.\n\nNew!!: Arthur Sewall and St. Louis Post-Dispatch · See more »\n\nSumner Sewall (June 17, 1897January 25, 1965) was a U.S. Republican politician and airline executive who served as the 58th Governor of Maine from 1941 to 1945.\n\nNew!!: Arthur Sewall and Sumner Sewall · See more »\n\nSweden (Sverige), officially the Kingdom of Sweden (Swedish), is a Scandinavian country in Northern Europe.\n\nNew!!: Arthur Sewall and Sweden · See more »\n\nThe New Church (or Swedenborgianism) is the name for several historically related Christian denominations that developed as a new religious movement, informed by the writings of scientist and Swedish Lutheran theologian Emanuel Swedenborg (1688–1772).\n\nNew!!: Arthur Sewall and The New Church (Swedenborgian) · See more »\n\nThomas Edward \"Tom\" Watson (September 5, 1856 – September 26, 1922) was an American politician, attorney, newspaper editor and writer from Georgia.\n\nNew!!: Arthur Sewall and Thomas E. Watson · See more »\n\nThe United States of America (USA), commonly known as the United States (U.S.) or America, is a federal republic composed of 50 states, a federal district, five major self-governing territories, and various possessions.\n\nNew!!: Arthur Sewall and United States · See more »\n\nThe United States presidential election of 1896 was the 28th quadrennial presidential election, held on Tuesday, November 3, 1896.\n\nNew!!: Arthur Sewall and United States presidential election, 1896 · See more »\n\nThe United States presidential election of 1900 was the 29th quadrennial presidential election, held on Tuesday, November 6, 1900.\n\nNew!!: Arthur Sewall and United States presidential election, 1900 · See more »\n\nThe United States presidential election of 2008 was the 56th quadrennial presidential election.\n\nNew!!: Arthur Sewall and United States presidential election, 2008 · See more »\n\nThe Vice President of the United States (informally referred to as VPOTUS, or Veep) is a constitutional officer in the legislative branch of the federal government of the United States as the President of the Senate under Article I, Section 3, Clause 4, of the United States Constitution, as well as the second highest executive branch officer, after the President of the United States.\n\nNew!!: Arthur Sewall and Vice President of the United States · See more »\n\nWilliam Jennings Bryan (March 19, 1860 – July 26, 1925) was an American orator and politician from Nebraska.\n\nNew!!: Arthur Sewall and William Jennings Bryan · See more »\n\nIn 1896, William Jennings Bryan ran unsuccessfully for President of the United States.\n\nNew!!: Arthur Sewall and William Jennings Bryan presidential campaign, 1896 · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Arthur_Sewall"}, {"url": "https://faculty.nps.edu/bneta/Sewall-arthur.html", "page_content": "Sewall, Arthur\n\n(source: The National Cyclopaedia of American Biography)\n\n<![if !supportEmptyParas]> <![endif]>\n\nShipbuilder and politician, was born at Bath, ME, Nov. 25, 1835, third son of William Dunning and Rachel (Trufant) Sewall. He was a lineal descendant of Henry Sewall, mayor of Coventry, England, one of whose grandsons was married to Jane Dummer, and emigrated to Newbury, MA, in 1634. Samuel Sewall, who settled at York, ME, in 1708, had two sons: David, first U.S. judge for the district of Maine, appointed by Washington, and Dummer Sewall, a distinguished soldier and the great grandfather of Arthur Sewall. The latter obtained a lieutenancy under Amherst in the Canada campaign, and in 1775 joined the revolutionary army as a lieutenant colonel. After the adoption of the constitution of Massachusetts, he was elected a senator from the state; he was also a memebr of the state convention which ratified the Constitution of the United States. The father of Arthur Sewall was one of the earliest and most prominent shipbuilder of Bath. He built his first ship, the Diana, a vessel of 199 tons burden, in 1823, and in 1841 launched the ship Rappahannock, which though of little over 1,000 tons burden, was at that time the largest ship afloat. He also held large interest in railroad and other important corporations. As his sons completed their education they joined their father in business, and Arthur on leaving shchool was sent in the interests of the firm to Prince Edward Island to buy timber for the shipyard at Bath. Returning, he entered the employs of his father's firm in 1853, and in 1854 formed, with his elder brother, the firm of E. & A. Sewall, which took over the business of the old firm of William D. Sewall and Clark & Sewall. On the death of the elder brother, in 1879, the name of the firm was changed to Arthur Sewall & Co., being made up of the senior partner, with his nephew, Samuel S. Sewall, and his second son, William D. Sewall. Since January, 1855, when the brothers launched their first ship, the Holyhead, a vessel of over 1,100 tons, one ship a year, on an average, has been built in the sewall shipyard. The largest and the best built wooden ships in the world are the product of this yad. With the giant Roanoke this era of ship-building was closed, and the firm turned its attention to building steel vessels, the ship Dirigo, launched in 1894, being the first of its class followed in quick succession by others of the largest size. Mr. Sewall had supreme faith in the ultimate maritime supremacy of the United States, and lost no opportunity, by public and private effort, to forward this end. He was prominent in other fields of commercial and industrial enterprise; was a director in the Maine Central railroad, and its president for nine years, 1884-93; was also president of the Eastern railroad, and the Boston and Maine, and director in the Mexican Central and other roads. He was president of the Bath National Bank, holding the office for 29 years, to the time of his death. He was the leader of the Democratic party in Maine, but held only minor political offices; was a delegate to the national Democratic convention at Baltimore in 1872; to that at Cincinnati in 1880, and delegate-at-large to that which nominated Cleveland in 1884. In 1888 he attended the convention at St. Louis, where he was elected a member of the Democratic national committee, and was a member of its executive committee for the campaign of that year. At the Chicago convention of 1892 he was elected to the same office. In 1896 he was nominated for the vice-presidency on the ticket with William J. Bryan. He was also a delegate to the national convention of 1900, and there elected again a member of the national committee. He was married in 1859, to Emma Duncan, daughter of Charles Crooker, a ship-builder and merchant, of Bath, ME, and, like her husband, a descendant of Samuel Sewall, of York. They had three sons, two of whom are living: Harold, consul-general at Samoa under Cleveland and Harrison; attached to the Berlin commission for the settlement of the Samoan affairs, and minister to Hawaii, under McKinley, to the time of its annexation, and William D. Sewall, a member of the firm. Arthur Sewall sied at Smallpoint, ME, Sept. 5, 1900."}, {"url": "https://www.sewallgenealogy.com/p556.htm", "page_content": "M, #12534, b. circa 8 March 1863, d. 7 July 1926\n\nSewall\n\nBaker\n\n\n\n\n\nGRANTED A DIVORCE FOR DESERTION\n\nMrs. Susan Sewall Secures Liberation From Her Husband.\n\n\n\nDissolute Habits of Arthur Sewall's Nephew Cause Him to Lose His Ship and His Wife.\n\n\n\nBOSTON, Jan. 3 — The January session of the divorce court, Judge Blodgett, began this morning. There were forty-three cases on the uncontested docket. Several divorces were granted for desertion. Among these was that of Mrs. Susan Sewall against E. R. Sewall. Mr. Sewall is the nephew of Arthur Sewall, the famous shipbuilder of Bath, Me., and late candidate for Vice-President of the United States.\n\n\n\nMrs. Sewall, whose maiden name was Baker, was married in San Francisco in 1856. Sewall was a shipmaster, and his wife accompanied him for four years on his voyages in different parts of the world. Mrs. Sewall testified that her husband's habits of drinking lost him command of his vessel in 1892. In that year Mrs. Sewall visited her parents in Harwich in this State, and afterward she went with her husband to his home in Bath. They returned to Harwich and soon after Mr. Sewall went away professedly on business. Since that time his wife has seen him but once, and that was at the Adams House in this city in October, 1892. She heard of him in New Jersey and in San Francisco, where he had associations with other women. During this time Mrs. Sewall has lived at 212 Columbus avenue in this city and has supported herself by dressmaking. San Francisco Call, 4 January 1898.5\n\n\n\nGRANTED A DIVORCE FOR DESERTIONMrs. Susan Sewall Secures Liberation From Her Husband.Dissolute Habits of Arthur Sewall's Nephew Cause Him to Lose His Ship and His Wife.BOSTON, Jan. 3 — The January session of the divorce court, Judge Blodgett, began this morning. There were forty-three cases on the uncontested docket. Several divorces were granted for desertion. Among these was that of Mrs. Susan Sewall against E. R. Sewall. Mr. Sewall is the nephew of Arthur Sewall, the famous shipbuilder of Bath, Me., and late candidate for Vice-President of the United States.Mrs. Sewall, whose maiden name was Baker, was married in San Francisco in 1856. Sewall was a shipmaster, and his wife accompanied him for four years on his voyages in different parts of the world. Mrs. Sewall testified that her husband's habits of drinking lost him command of his vessel in 1892. In that year Mrs. Sewall visited her parents in Harwich in this State, and afterward she went with her husband to his home in Bath. They returned to Harwich and soon after Mr. Sewall went away professedly on business. Since that time his wife has seen him but once, and that was at the Adams House in this city in October, 1892. She heard of him in New Jersey and in San Francisco, where he had associations with other women. During this time Mrs. Sewall has lived at 212 Columbus avenue in this city and has supported herself by dressmaking. San Francisco Call, 4 January 1898."}, {"url": "https://www.nndb.com/people/274/000206653/", "page_content": "Arthur Sewall\n\nBorn: 25-Nov-1835\n\nBirthplace: Bath, ME\n\nDied: 5-Sep-1900\n\nLocation of death: Small Point, ME\n\nCause of death: Stroke\n\nRemains: Buried, Oak Grove Cemetery, Bath, ME\n\n\n\nGender: Male\n\nRace or Ethnicity: White\n\nSexual orientation: Straight\n\nOccupation: Business, Politician\n\nParty Affiliation: Democratic\n\nNationality: United States\n\nExecutive summary: Shipbuilder, 1896 Democratic VP Nominee\n\nFather: William Dunning Sewall (shipbuilder)\n\nMother: Rachel Trufant\n\nBrother: Edward Sewall (d. 1879)\n\nWife: Emma Duncan Crooker (m. 20-Mar-1859, three sons)\n\nSon: Harold Marsh Sewall\n\nSon: William Dunning Sewall\n\nSon: Dumner (d. in infancy)\n\n\n\nBath National Bank President\n\nMaine Central Railroad President\n\nBath Iron Works Part Owner\n\nArthur Sewall & Co. Founder (1879)\n\nE. & A. Sewall Partner (1854-79)\n\nDemocratic National Committee Maine (1888-96)\n\n\n\n\n\n\n\nRequires Flash 7+ and Javascript.\n\nDo you know something we don't?\n\nSubmit a correction or make a comment about this profile\n\n\n\n\n\n\n\n"}], "Arthur Sewall was an American businessman and politician.": [{"url": "https://faculty.nps.edu/bneta/Sewall-arthur.html", "page_content": "Sewall, Arthur\n\n(source: The National Cyclopaedia of American Biography)\n\n<![if !supportEmptyParas]> <![endif]>\n\nShipbuilder and politician, was born at Bath, ME, Nov. 25, 1835, third son of William Dunning and Rachel (Trufant) Sewall. He was a lineal descendant of Henry Sewall, mayor of Coventry, England, one of whose grandsons was married to Jane Dummer, and emigrated to Newbury, MA, in 1634. Samuel Sewall, who settled at York, ME, in 1708, had two sons: David, first U.S. judge for the district of Maine, appointed by Washington, and Dummer Sewall, a distinguished soldier and the great grandfather of Arthur Sewall. The latter obtained a lieutenancy under Amherst in the Canada campaign, and in 1775 joined the revolutionary army as a lieutenant colonel. After the adoption of the constitution of Massachusetts, he was elected a senator from the state; he was also a memebr of the state convention which ratified the Constitution of the United States. The father of Arthur Sewall was one of the earliest and most prominent shipbuilder of Bath. He built his first ship, the Diana, a vessel of 199 tons burden, in 1823, and in 1841 launched the ship Rappahannock, which though of little over 1,000 tons burden, was at that time the largest ship afloat. He also held large interest in railroad and other important corporations. As his sons completed their education they joined their father in business, and Arthur on leaving shchool was sent in the interests of the firm to Prince Edward Island to buy timber for the shipyard at Bath. Returning, he entered the employs of his father's firm in 1853, and in 1854 formed, with his elder brother, the firm of E. & A. Sewall, which took over the business of the old firm of William D. Sewall and Clark & Sewall. On the death of the elder brother, in 1879, the name of the firm was changed to Arthur Sewall & Co., being made up of the senior partner, with his nephew, Samuel S. Sewall, and his second son, William D. Sewall. Since January, 1855, when the brothers launched their first ship, the Holyhead, a vessel of over 1,100 tons, one ship a year, on an average, has been built in the sewall shipyard. The largest and the best built wooden ships in the world are the product of this yad. With the giant Roanoke this era of ship-building was closed, and the firm turned its attention to building steel vessels, the ship Dirigo, launched in 1894, being the first of its class followed in quick succession by others of the largest size. Mr. Sewall had supreme faith in the ultimate maritime supremacy of the United States, and lost no opportunity, by public and private effort, to forward this end. He was prominent in other fields of commercial and industrial enterprise; was a director in the Maine Central railroad, and its president for nine years, 1884-93; was also president of the Eastern railroad, and the Boston and Maine, and director in the Mexican Central and other roads. He was president of the Bath National Bank, holding the office for 29 years, to the time of his death. He was the leader of the Democratic party in Maine, but held only minor political offices; was a delegate to the national Democratic convention at Baltimore in 1872; to that at Cincinnati in 1880, and delegate-at-large to that which nominated Cleveland in 1884. In 1888 he attended the convention at St. Louis, where he was elected a member of the Democratic national committee, and was a member of its executive committee for the campaign of that year. At the Chicago convention of 1892 he was elected to the same office. In 1896 he was nominated for the vice-presidency on the ticket with William J. Bryan. He was also a delegate to the national convention of 1900, and there elected again a member of the national committee. He was married in 1859, to Emma Duncan, daughter of Charles Crooker, a ship-builder and merchant, of Bath, ME, and, like her husband, a descendant of Samuel Sewall, of York. They had three sons, two of whom are living: Harold, consul-general at Samoa under Cleveland and Harrison; attached to the Berlin commission for the settlement of the Samoan affairs, and minister to Hawaii, under McKinley, to the time of its annexation, and William D. Sewall, a member of the firm. Arthur Sewall sied at Smallpoint, ME, Sept. 5, 1900."}, {"url": "https://www.geni.com/people/Arthur-Sewall/6000000004565891749", "page_content": "About Arthur Sewall\n\nhttps://www.wikitree.com/wiki/Sewall-171\n\nhttps://www.findagrave.com/memorial/7232538\n\nWilliam J. Bryan's running mate of the Presidency in 1896.\n\nPolitician. Served as a Member of the Democratic National Committee from Maine from 1888-1896, and Democratic Candidate for Vice President of the United States in 1896.\n\nUpon his brother's death the company became Arthur Sewall & Co (shipbuilders) built largest wooden ship Roanoke in 1894 launched the Dirigo first steel sailing ship built in America. President of the Eastern railway,Director of the Boston &Maine,New York & New England,and Mexican Centrail railroads.\n\nhttp://en.wikipedia.org/wiki/Arthur_Sewall\n\nArthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. As the Populist Party nominee, Bryan had another running mate as well, Thomas E. Watson. Sewall never held elective office, although he was a member of the Democratic National Committee from 1888 to 1896.\n\nArthur Sewall's main claim to fame had been as an exceptionally successful, wealthy shipbuilder and New England industrialist. He was a director of the Maine Central railroad and President of the Bath National Bank for years. His selection is believed to have been an effort to win votes among conservative and New England members of the party who were disturbed by the populist aspects of William Jennings Bryan. Arthur Sewall is also one of the few politicians to be an adherent of Swedenborgianism, a religion based on the writings of Swedish theologian Emanuel Swedenborg.\n\nHis main vice-presidential opponent, Garret A. Hobart (Rep), was also an Eastern banker and industrialist who had served on his party's national committee.\n\nSewall was Bryan's running mate for the first of Bryan's three times as the Democratic presidential nominee. He died not long after Bryan was nominated for the second time in 1900.\n\nSewall's grandson, Sumner Sewall, served as Governor of Maine from 1941 to 1945, as a Republican.\n\nLegacy\n\nIn 2008, the St. Louis Post-Dispatch referenced Sewall in an article criticizing Senator John McCain's selection of Gov. Sarah Palin as his vice presidential candidate in the 2008 presidential election, saying he had picked \"the least qualified running mate since the Swedenborgian shipbuilder Arthur Sewall ran as William Jennings Bryan's No. 2 in 1896.\""}, {"url": "https://peoplepill.com/people/arthur-sewall/", "page_content": "Arthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. As the Populist Party nominee, Bryan had another running mate as well, Thomas E. Watson. Sewall never held elective office, although he was a member of the Democratic National Committee from 1888 to 1896.\n\nArthur Sewall's main claim to fame had been as an exceptionally successful, wealthy shipbuilder and New England industrialist. He was a director of the Maine Central railroad and President of the Bath National Bank for years. His selection is believed to have been an effort to win votes among conservative and New England members of the party who were disturbed by the populist aspects of William Jennings Bryan. Arthur Sewall is also one of the few politicians to be an adherent of Swedenborgianism, a religion based on the writings of Swedish theologian Emanuel Swedenborg.\n\nHis main vice-presidential opponent, Garret A. Hobart (Rep), was also an Eastern banker and industrialist who had served on his party's national committee.\n\nSewall was Bryan's running mate for the first of Bryan's three times as the Democratic presidential nominee. He died not long after Bryan was nominated for the second time in 1900.\n\nSewall's grandson, Sumner Sewall, served as Governor of Maine from 1941 to 1945, as a Republican.\n\nLegacy\n\nIn 2008, the St. Louis Post-Dispatch referenced Sewall in an article criticizing Senator John McCain's selection of Gov. Sarah Palin as his vice presidential candidate in the 2008 presidential election, saying he had picked \"the least qualified running mate since the Swedenborgian shipbuilder Arthur Sewall ran as William Jennings Bryan's No. 2 in 1896.\""}, {"url": "https://pg.miraheze.org/wiki/Arthur_Sewall", "page_content": "Arthur Sewall (November 25, 1835 – September 5, 1900) was an American politician and shipbuilder from Maine who served as the 26th vice president of the United States from 1897 to 1900. Prior to his candidacy, he was a member of the Democratic National Committee and unsuccessfully ran for Maine's Senate seat against Eugene Hale in 1892. The only successful elections Sewall had prior to 1896 were as a councilman and alderman in the town of Bath, Maine.\n\nEarly life\n\nWIP\n\nCareer\n\nWIP\n\nVice Presidency\n\n1896 election\n\nWIP\n\nDeath\n\nWIP"}, {"url": "https://prabook.com/web/arthur.sewall/3762372", "page_content": "Arthur Sewall\n\npolitician shipbuilder statesman\n\nJanuary 25, 1835 (age 65) Bath, Maine, United States\n\nHe began his active shipbuilding career in 1854 as the American merchant marine reached its zenith. With his elder brother, Edward, he formed the firm of E. & A. Sewall and commenced work in the family yard on the Kennebec. The Holyhead, of some 1100 tons, launched in 1855, was the first of his eighty vessels. Upon Edward's death he took a son and a nephew as partners, and the firm in 1879 became A. Sewall & Company. Though English vessels, utilizing iron, steel, and steam, were driving the wooden American sailing vessels out of competition, the Sewalls specialized in the latter type, doing much to keep it alive in the period of decline. They generally retained ownership of the ships they built and at one time owned a fleet of more than twenty-five. Their shipwrights and captains were usually natives of the Kennebec valley. During the Civil War he refused to have his ships take advantage of British registry, and his Vigilant was captured on her maiden voyage by the Confederate raider, Sumter. In the decade following the war, the Sewalls turned out a number of celebrated ships, including the Undaunted, Eric the Red, El Capitan, Occidental, Oriental, Continental, Harvester, Reaper, Thrasher, and Granger. Then came a depression without even the usual \"ship a year, \" but in the early nineties they built their \"Big Four, \" the Rappahannock, Shenandoah, Susquehanna, and Roanoke, averaging more than 3000 tons. The next step was iron. Sewall was interested in Gen. Thomas W. Hyde's Bath Iron Works, organized in 1889, which built the Machias, Castine, and Katahdin for the new navy. After visiting England to study the latest methods he began to build steel sailing vessels, and in 1894 the steel Dirigo was launched. His last ship, launched a month after his death, was the William P. Frye, sunk January 28, 1915, the first American vessel sunk by the Germans in the World War. He was at various times president of the Eastern Railroad and of the Central Railroad, and a director of the Boston and Maine Railroad. From 1871 until his death he was president of the Bath National Bank. He was the most prominent of the Maine Democrats, those constant supporters of forlorn hopes in that Republican stronghold, but the only elective offices he ever received were as councilman and alderman in Bath. He was a delegate to the national conventions in 1876, 1880, and 1888; in the next two campaigns he served on the executive committee of the Democratic national committee, and in 1896 he was nominated for vice-president on the fifth ballot and took an active part in the campaign. In 1900 he was stricken with apoplexy at his summer home at Small Point, just below Bath, where he died."}, {"url": "https://en.unionpedia.org/Arthur_Sewall", "page_content": "Arthur Sewall Arthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. [1]\n\n27 relations: Adlai Stevenson I, Bath, Maine, Democratic National Committee, Democratic Party (United States), Emanuel Swedenborg, Garret Hobart, Harold M. Sewall, John McCain, List of United States Democratic Party presidential tickets, Maine, Maine Central Railroad Company, People's Party (United States), Phippsburg, Maine, Republican Party (United States), Sarah Palin, St. Louis Post-Dispatch, Sumner Sewall, Sweden, The New Church (Swedenborgian), Thomas E. Watson, United States, United States presidential election, 1896, United States presidential election, 1900, United States presidential election, 2008, Vice President of the United States, William Jennings Bryan, William Jennings Bryan presidential campaign, 1896.\n\nAdlai Ewing Stevenson (October 23, 1835 – June 14, 1914) served as the 23rd Vice President of the United States (1893–97).\n\nNew!!: Arthur Sewall and Adlai Stevenson I · See more »\n\nBath is a city in Sagadahoc County, Maine, in the United States.\n\nNew!!: Arthur Sewall and Bath, Maine · See more »\n\nThe Democratic National Committee (DNC) is the formal governing body for the United States Democratic Party.\n\nNew!!: Arthur Sewall and Democratic National Committee · See more »\n\nThe Democratic Party is one of the two major contemporary political parties in the United States, along with the Republican Party (nicknamed the GOP for Grand Old Party).\n\nNew!!: Arthur Sewall and Democratic Party (United States) · See more »\n\nEmanuel Swedenborg ((born Emanuel Swedberg; 29 January 1688 – 29 March 1772) was a Swedish Lutheran theologian, scientist, philosopher, revelator and mystic who inspired Swedenborgianism. He is best known for his book on the afterlife, Heaven and Hell (1758). Swedenborg had a prolific career as an inventor and scientist. In 1741, at 53, he entered into a spiritual phase in which he began to experience dreams and visions, beginning on Easter Weekend, on 6 April 1744. It culminated in a 'spiritual awakening' in which he received a revelation that he was appointed by the Lord Jesus Christ to write The Heavenly Doctrine to reform Christianity. According to The Heavenly Doctrine, the Lord had opened Swedenborg's spiritual eyes so that from then on, he could freely visit heaven and hell and talk with angels, demons and other spirits and the Last Judgment had already occurred the year before, in 1757. For the last 28 years of his life, Swedenborg wrote 18 published theological works—and several more that were unpublished. He termed himself a \"Servant of the Lord Jesus Christ\" in True Christian Religion, which he published himself. Some followers of The Heavenly Doctrine believe that of his theological works, only those that were published by Swedenborg himself are fully divinely inspired.\n\nNew!!: Arthur Sewall and Emanuel Swedenborg · See more »\n\nGarret Augustus Hobart (June 3, 1844 – November 21, 1899) was the 24th Vice President of the United States, serving from 1897 until his death in 1899.\n\nNew!!: Arthur Sewall and Garret Hobart · See more »\n\nHarold Marsh Sewall (January 3, 1860 – October 28, 1924) was an American politician and diplomat.\n\nNew!!: Arthur Sewall and Harold M. Sewall · See more »\n\nJohn Sidney McCain III (born August 29, 1936) is an American politician serving as the senior United States Senator from Arizona, a seat he was first elected to in 1986.\n\nNew!!: Arthur Sewall and John McCain · See more »\n\nThis is a list of the candidates for the offices of President of the United States and Vice President of the United States of the modern Democratic Party of the United States.\n\nNew!!: Arthur Sewall and List of United States Democratic Party presidential tickets · See more »\n\nMaine is a U.S. state in the New England region of the northeastern United States.\n\nNew!!: Arthur Sewall and Maine · See more »\n\nThe Maine Central Railroad Company was a former U. S. Class I railroad in central and southern Maine.\n\nNew!!: Arthur Sewall and Maine Central Railroad Company · See more »\n\nThe People's Party, also known as the Populist Party or the Populists, was an agrarian-populist political party in the United States.\n\nNew!!: Arthur Sewall and People's Party (United States) · See more »\n\nPhippsburg is a town in Sagadahoc County, Maine, United States, on the west side of the mouth of the Kennebec River.\n\nNew!!: Arthur Sewall and Phippsburg, Maine · See more »\n\nThe Republican Party, also referred to as the GOP (abbreviation for Grand Old Party), is one of the two major political parties in the United States, the other being its historic rival, the Democratic Party.\n\nNew!!: Arthur Sewall and Republican Party (United States) · See more »\n\nSarah Louise Palin (née Heath; born February 11, 1964) is an American politician, commentator, author, and reality television personality, who served as the ninth Governor of Alaska from 2006 until her resignation in 2009.\n\nNew!!: Arthur Sewall and Sarah Palin · See more »\n\nThe St.\n\nNew!!: Arthur Sewall and St. Louis Post-Dispatch · See more »\n\nSumner Sewall (June 17, 1897January 25, 1965) was a U.S. Republican politician and airline executive who served as the 58th Governor of Maine from 1941 to 1945.\n\nNew!!: Arthur Sewall and Sumner Sewall · See more »\n\nSweden (Sverige), officially the Kingdom of Sweden (Swedish), is a Scandinavian country in Northern Europe.\n\nNew!!: Arthur Sewall and Sweden · See more »\n\nThe New Church (or Swedenborgianism) is the name for several historically related Christian denominations that developed as a new religious movement, informed by the writings of scientist and Swedish Lutheran theologian Emanuel Swedenborg (1688–1772).\n\nNew!!: Arthur Sewall and The New Church (Swedenborgian) · See more »\n\nThomas Edward \"Tom\" Watson (September 5, 1856 – September 26, 1922) was an American politician, attorney, newspaper editor and writer from Georgia.\n\nNew!!: Arthur Sewall and Thomas E. Watson · See more »\n\nThe United States of America (USA), commonly known as the United States (U.S.) or America, is a federal republic composed of 50 states, a federal district, five major self-governing territories, and various possessions.\n\nNew!!: Arthur Sewall and United States · See more »\n\nThe United States presidential election of 1896 was the 28th quadrennial presidential election, held on Tuesday, November 3, 1896.\n\nNew!!: Arthur Sewall and United States presidential election, 1896 · See more »\n\nThe United States presidential election of 1900 was the 29th quadrennial presidential election, held on Tuesday, November 6, 1900.\n\nNew!!: Arthur Sewall and United States presidential election, 1900 · See more »\n\nThe United States presidential election of 2008 was the 56th quadrennial presidential election.\n\nNew!!: Arthur Sewall and United States presidential election, 2008 · See more »\n\nThe Vice President of the United States (informally referred to as VPOTUS, or Veep) is a constitutional officer in the legislative branch of the federal government of the United States as the President of the Senate under Article I, Section 3, Clause 4, of the United States Constitution, as well as the second highest executive branch officer, after the President of the United States.\n\nNew!!: Arthur Sewall and Vice President of the United States · See more »\n\nWilliam Jennings Bryan (March 19, 1860 – July 26, 1925) was an American orator and politician from Nebraska.\n\nNew!!: Arthur Sewall and William Jennings Bryan · See more »\n\nIn 1896, William Jennings Bryan ran unsuccessfully for President of the United States.\n\nNew!!: Arthur Sewall and William Jennings Bryan presidential campaign, 1896 · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Arthur_Sewall"}, {"url": "https://commons.wikimedia.org/wiki/Category:Arthur_Sewall", "page_content": "This category has only the following subcategory.\n\nMedia in category \"Arthur Sewall\"\n\nThe following 9 files are in this category, out of 9 total."}, {"url": "https://prabook.com/web/sumner.sewall/1875863", "page_content": "Sumner Sewall\n\ngovernor pilot politician\n\nJune 17, 1897 (age 67) Bath, Sagadahoc County, United States of America\n\nHe began his aviation career during World War I as a fighter ace. He enlisted in the USAAS in Paris, underwent training, and reported to the 95th Aeronautical Squadron in February 1918. Sewall then became a balloon buster, shooting down an observation balloon each on 4 and 5 November. After the war, he worked in a variety of jobs, including being an executive with Colonial Air Transport and a director of United Air Lincolnshire. His political career began when he became an alderman in Bath in 1933. He was elected to the Maine state legislature as a representative in 1934, then as a senator in 1936 and 1938. After the latter election, he was named President of the State Senate. In 1940, he was elected governor, and served two terms. Sewall\"s administration was notable for cleaning up scandals in state government and passing a minimum wage law for state teachers. After stepping down as governor, Sewall became president of American Overseas Airlines for a year, then served as the military governor of Württemberg-Baden from 1946 to 1947. In 1948, Sewall finished a distant third in the Republican primary for Maine\"s open United States Senate seat, which ended his political career. Sewall became president of the Bath National Bank in the 1960s. He died on 26 January 1965. Sewall married Helen Ellena Evans in 1929. Sewall\"s grandfather, Arthur Sewall, was the Democratic candidate for vice president in 1896."}, {"url": "https://www.howold.co/person/sumner-sewall/biography", "page_content": "Sumner Sewall Biography\n\nAmerican politician, 58th Governor of Maine (1897–1965)\n\nSumner Sewall (June 17, 1897:– January 25, 1965) was an American Republican politician and airline executive who served as the 58th Governor of Maine from 1941 to 1945. He began his aviation career during World War I as a fighter ace.\n\nLife and career\n\nA native of Bath, Maine, Sewall dropped out of Harvard College in 1917 to go to Europe to aid the Allies during World War I. Sewall served first in the American Ambulance Field Service from February through August 1917, then in the U.S. Army Signal Corps, then finally as a fighter pilot in the U.S. Army Air Service, becoming an ace by scoring seven victories.\n\nHe enlisted in the USAAS in Paris, underwent training, and reported to the 95th Aero Squadron in February 1918. He was promoted to Flight Commander, and went on to score five victories over enemy planes between 3 June and 18 September 1918, sharing a couple of them with future general James Knowles and Edward Peck Curtis. Sewall then became a balloon buster, shooting down an observation balloon each on 4 and 5 November. The only victory he did not receive credit for came when German pilot Leutnant Heinz Freiherr von Beaulieu-Marconnay mistakenly landed on the 95th Aero Squadron's airfield, and Sewall and a couple of other American pilots captured him at gunpoint.\n\nSewall returned home with the Distinguished Service Cross with oak leaf cluster, the French Legion of Honor, the Croix de Guerre and the Order of the Crown of Belgium.\n\nAfter the war, he worked in a variety of jobs, including being an executive with Colonial Air Transport and a director of United Air Lines.\n\nHis political career began when he became an alderman in Bath in 1933. He was elected to the Maine state legislature as a representative in 1934, then as a senator in 1936 and 1938. After the latter election, he was named President of the State Senate. In 1940, he was elected governor, and served two terms. Sewall's administration was notable for cleaning up scandals in state government and p*ing a minimum wage law for state teachers.\n\nAfter stepping down as governor, Sewall became president of American Overseas Airlines for a year, then served as the military governor of Württemberg-Baden from 1946 to 1947. In 1948, Sewall finished a distant third in the Republican primary for Maine's open United States Senate seat, which ended his political career.\n\nSewall became president of the Bath National Bank in the 1960s. He died on 25 January 1965.\n\nFamily\n\nSewall's parents were William Dunning Sewall and Mary Locke Sumner of Shrewsbury, M*achusetts. Mary was the daughter of George Sumner and Sarah E. Richardson, and she was great-granddaughter of the Reverend Joseph Sumner of the First Congregational Church in Shrewsbury. William D. Sewall and Mary Locke Sumner lived at the Sewall Family Home in Bath, ME known as York Hall.\n\nSewall's grandfather, Arthur Sewall, was the Democratic candidate for vice president in 1896.\n\nSewall married Helen Ellena Evans in 1929. They had two sons, David and Nick, and a daughter Alexandria\n\nSee also\n\nWorld War I portal\n\nBiography portal\n\nList of World War I flying aces from the United States\n\nReferences\n\nBibliography\n\nAmerican Aces of World War I. Norman Franks, Harry Dempsey. Osprey Publishing, 2001. ISBN:1-84176-375-6, ISBN:978-1-84176-375-0.\n\nNorman Franks, Harry Dempsey. Osprey Publishing, 2001. ISBN:1-84176-375-6, ISBN:978-1-84176-375-0. Gunther, John. Inside U.S.A. New York:: Curtis, 1947. 487-489.\n\nNew York:: Curtis, 1947. 487-489. Leviero, Anthony. \"Low Salary Bars La Follette Job.\" New York Times 8 October 1947: 17.\n\n8 October 1947: 17. \"Mrs. Smith wins in Maine race for Senate; Gov. Hildreth concedes.\" New York Times 22 June 1948: 1.\n\n22 June 1948: 1. \"Past President: Sumner Sewall, Republican, 1939-1940\"\n\nExternal links"}, {"url": "https://alchetron.com/Arthur-Sewall", "page_content": "Arthur Sewall (November 25, 1835 – September 5, 1900) was a U.S. Democratic politician from Maine most notable as William Jennings Bryan's first running mate in 1896. As the Populist Party nominee, Bryan had another running mate as well, Thomas E. Watson. Sewall never held elective office, although he was a member of the Democratic National Committee from 1888 to 1896.\n\nContents\n\nArthur Sewall's main claim to fame had been as an exceptionally successful, wealthy shipbuilder and New England industrialist. He was a director of the Maine Central railroad and President of the Bath National Bank for years. His selection is believed to have been an effort to win votes among conservative and New England members of the party who were disturbed by the populist aspects of William Jennings Bryan. Arthur Sewall is also one of the few politicians to be an adherent of Swedenborgianism, a religion based on the writings of Swedish theologian Emanuel Swedenborg.\n\nHis main vice-presidential opponent, Garret A. Hobart (Rep), was also an Eastern banker and industrialist who had served on his party's national committee.\n\nSewall was Bryan's running mate for the first of Bryan's three times as the Democratic presidential nominee. He died not long after Bryan was nominated for the second time in 1900.\n\nSewall's grandson, Sumner Sewall, served as Governor of Maine from 1941 to 1945, as a Republican."}]}