{"Gia Marie Carangi was born on January 29, 1960.": [{"url": "https://allthatsinteresting.com/gia-carangi", "page_content": "After moving to New York in 1977, Gia Carangi became one of the most sought-after models in fashion and a fixture of Studio 54 — but her life quickly unraveled.\n\nOn the surface, Gia Carangi seemed to have it all. In the late 70s and 80s, Carangi owned the spotlight and had droves of adoring fans.\n\nIt’s said that she added the “super” in supermodel to describe how exponentially successful she had been in her career. Known for an edgy personality and a smoldering stare, the world was Carangi’s catwalk.\n\nBut the very attitude and wild side of America’s first supermodel which made Gia Carangi so desirable also made her a great danger to herself. This would be her undoing.\n\nGia Carangi’s Early Life\n\nGia Marie Carangi was born on January 29, 1960, in Philadelphia to an Italian-American father, Joseph, who owned a tiny restaurant called Hoagie City. Her mother, Kathleen Carangi, was a homemaker.\n\nCarangi’s parents separated in 1971. Those close to Carangi, including herself, have admitted that this divorce had a lasting impact on her attitude.\n\nHer two brothers, both older than her, moved out and lived with their mom while Carangi stayed with her father. She spent her summers behind his counter, attending concerts like your run-of-the-mill high schooler.\n\nIt was in the summer of 1978 that a local photographer and hairdresser, Maurice Tannenbaum, asked the dark-haired beauty to pose on the dance floor after spotting her at a local nightclub. Carangi’s dark, tomboyish looks, 34-24-35 measurements, and perfect face were an ideal match for the fashion world which at the time was overrun with willowy blondes.\n\nTannenbaum passed on Carangi’s photos to legendary New York department store Bloomingdale’s photographer, Arthur Elgort. Before Carangi knew it, she was the talk of New York.\n\n“I started working with very good people,” Gia Carangi confided in a 1983 interview. “I mean all the time, very fast. I didn’t build into a model. I just sort of became one.”\n\nA Meteoric Rise To Fame\n\nGia Carangi’s first photoshoot at the Philadelphia nightclub, back when she was just 16, was the beginning of her meteoric rise to stardom, and life only moved faster once she moved to New York.\n\nCarangi signed with Wilhelmina Cooper, a legendary fashion agent and owner of her own modeling agency. Wilhelmina became a kind of mother figure to Carangi.\n\nFrancesco Scavullo, a leading fashion photographer of the day and who would become a personal friend of Carangi’s, gushed of her:\n\n“There was something she had… no other girl has got it. I’ve never met a girl who had it. She had the perfect body for modeling: perfect eyes, mouth, hair. And, to me, the perfect attitude: ‘I don’t give a damn.'”\n\nThat attitude proved to be both what was so enticing and dangerous about Carangi.\n\nHer androgynous look was in part due to her sexuality. Described in some instances as aggressive and others as vulnerable, Carangi seemed to have a need to be loved — and mostly by women.\n\nThose who had worked with her said it wasn’t uncommon for her to fall in love with the models she shot with. On a shoot for photographer Chris von Wangenheim, which would become wildly popular, Carangi posed nude up against a fence with makeup artist and model Sandy Linter.\n\nThe two would embark on a passionate though unrequited love affair.\n\nIndeed, Gia Carangi appeared insatiable both in her love life and in her recreational drug use. As a teen, she was already hooked on marijuana, cocaine, and quaaludes.\n\nCarangi went on to model for Christian Dior, Giorgio Armani, Versace, Diane Von Furstenberg, Cutex, Lancetti, Levi’s, Maybelline, Vidal-Sassoon, and Yves Saint Laurent — to name a few. At the age of 18, Carangi was making $100,000 a year. It was more than any other model at the time, leading many fashion historians to dub her the world’s first supermodel.\n\nShe then landed on the covers of Vogue and Cosmo starting in 1979.\n\n“A model has to create moods,” Carangi said of her talent, “You have to be careful not to get stuck in a mood – emotions have trends just like fashion … I become what ever your eye wants to see. It’s my job.”\n\nBut Gia Carangi remained hard to control. Though it was her edgy attitude that drew people to her, Carangi was also tough to work with. A diva by age 18, she would walk off shoots if she wasn’t feeling it, or would cancel weeks of work if she didn’t like her haircut.\n\nCarangi would chow down on barbecue chicken while wearing a dress worth thousands of dollars. She was also transparent about her drug use, discussing it openly in interviews and partying often with other stars and socialites at Studio 54.\n\nBut there was also a deep loneliness in her, returning to her apartment alone after work, and constantly searching for love. “I am finally really starting to dig being different. Maybe I am discovering who I am. Or maybe I’m just stoned again,” she admitted.\n\nGia Carangi Backslides Into Drugs\n\nThe supermodel would go from a $10,000 photo shoot to a “shooting gallery”, or seedy locale where one can shoot up heroin, on Manhattan’s Lower East Side.\n\nIn 1980, Wilhelmina died and sent Carangi into a spiral. Already using heroin, the supermodel delved deeper into her habit. During a shoot that year for Vogue with famed portrait photographer Richard Avedon, Carangi escaped through a window. Though incensed, the magazine gave her a second chance at the shoot, but when the pictures came back they revealed track marks and red bumps all over the model’s arms.\n\nIn 1981, she was arrested for driving under the influence of a narcotic.\n\nIn May of that same year, 21-year-old Carangi needed to get hand surgery because “she had injected herself in the same place so many times that there was an open infected tunnel leading into her vein,” her biographer Stephen Fried documented.\n\nFor her final Cosmo cover photo in early 1982, fashion photographer Scavullo covered up the track marks on her arms by having her put her hands behind her back. The dress she wore was poofy enough to cover up the scars of her habit. The model also angled her face to cover up the bloating.\n\nHer brother, Michael, recalled his little sister’s behavior and laments: “The biggest mistake we made was that nobody went up there with her. She could’ve used a friend.”\n\nGia Carangi left her modeling agency, tried to stay afloat at another, but wound up returning home to Philadelphia to live with her mother at a final grasp at finding sobriety.\n\nAn Untimely Demise\n\nGia Carangi was blackballed from New York’s agencies and although magazines gave her several last chances, the model could not pull herself together. One of her final shoots appeared in Vogue in 1982 and was photographed by Andrea Blanch.\n\nBy the end of that year, Carangi had become so volatile that she couldn’t get booked for jobs. No one wanted to work with the wild child any longer.\n\nShe had a successful go at rehab for about a year following in Philadelphia. By this time she was broke and receiving rehabilitation from welfare.\n\nhttps://www.youtube.com/watch?v=9npRKUAeQZI\n\nMeanwhile, model Cindy Crawford came on the scene as a newer, more put together version of Gia. Crawford admitted to Playboy that many of her jobs came from those who loved Carangi and were hoping to replace her.\n\nIn the fall of 1986, Carangi was hospitalized. It became apparent that she had been sleeping outside in the rain and had been badly beaten up and raped. Blood tests showed she was suffering from AIDS-related complications.\n\nOn November 26, 1986, America’s first supermodel died of those complications, though her mother was by her side.\n\nCarangi’s meteoric and tumultuous career were immortalized in the HBO movie Gia that starred Angelina Jolie nearly a decade later in 1998. Jolie said of the model herself after portraying her, “You think, ‘God, she didn’t need drugs — she was a drug.'”\n\nCarangi seemed to be somewhat cognizant of her brilliant, though short, career. She said forebodingly in an interview before her demise: “Modeling is a short gig.”\n\nAfter this look at Gia Carangi, read about who some believe was America’s first “it” girl, Audrey Munson. Then, take a look at the strange and sad story of the French fitness model who was killed by an exploding whipped cream can."}, {"url": "https://people.com/movies/angelina-jolie-gia-25th-anniversary-about-death-of-model-who-inspired-movie-gia-carangi/", "page_content": "It's been 25 years since Angelina Jolie starred as Gia Carangi in Gia.\n\nThe 1998 HBO television film featured a then-22-year-old Jolie as the real-life Carangi, who was considered by many the world's first supermodel. She died in 1986 at age 26 of AIDS-related complications, at just 26 years old.\n\nMila Kunis also appeared in Gia as a younger version of Carangi, in one of her first-ever film roles, while additional cast members included Faye Dunaway, Mercedes Ruehl, Elizabeth Mitchell and Scott Cohen.\n\nDirected by Michael Cristofer (Mr. Robot) and co-written by Cristofer, 78, and Jay McInerney, Gia is about \"the life of Gia Carangi, a top fashion model from the late 1970s, from her meteoric rise to the forefront of the modeling industry, to her untimely death,\" according to a synopsis from IMDb.\n\nRead on to learn more about Carangi, from her early life to her tragic death.\n\nNever miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human-interest stories.\n\nGia Carangi. Andrea Blanch/Getty\n\nCarangi was born Gia Marie Carangi in Philadelphia on Jan. 29, 1960, into a working-class family that included two older brothers. Her father Joseph Carangi, who was Italian, owned a restaurant, while her mother, Kathleen Carangi (née Adams), was a homemaker.\n\nIn the late 1970s, Carangi was discovered on the dance floor by a local photographer. Her first modeling gig for a major advertisement was with Versace, and she had become a well-known figure at Wilhelmina Models in New York City by 1980, according to The New York Times.\n\nBut throughout her catapult to fame, Carangi — who was one of the first openly gay models, Dazed reported — struggled with addiction and substance abuse, including of cocaine and heroin.\n\nBack in 2020, makeup artist Sandy Linter recalled to The Hollywood Reporter that she and Carangi had a romance in the late 1970s that \"was never a torrid sexual affair but we did love each other.\"\n\n\"I was just as shocked as anybody that she became an addict,\" Linter said. \"She thought she was stronger than the drugs. One morning, as she was getting dressed to leave my apartment she asked, 'What happened to my natural energy?' She didn't have the energy to get dressed at 20 years old. The drugs took everything.\"\n\nGia Carangi. Dustin Pittman/WWD/Penske Media via Getty\n\nAccording to Dazed, Carangi attempted several times to get clean, including going to rehab, but it never stuck. She was diagnosed with AIDS in December 1985, and died of related complications the following November.\n\nLinter told THR that the last time she saw Carangi was in 1983 or 1984, when the model rang her doorbell, then \"sat down on my couch with me, put her head on my shoulder and cried.\"\n\n\"It was the end of our 'romance.' I knew it and she knew it. Because she looked so good, I had been tricked into thinking that she was on the road to recovery,\" Linter said. \"I never knew she had AIDS until later. After maybe 30 minutes, she looked out the window, nodded to someone in the street and left. I would never see her again.\"\n\nMore than 35 years after Carangi's death, Gia is still beloved by fans, holding a Rotten Tomatoes score of 93%, with an Audience Score of 82%.\n\nAhead of the movie's release, Jolie, now 47, told The New York Times in 1997 that she initially \"hated\" Carangi while doing research about her, based on a 20/20 interview the model once did — but eventually changed her tune and thought, \"I'd like to date Gia. I'd want to be her lover.''\n\nAngelina Jolie (center) in Gia (1998). Larry Watson/Citadel Ent/Kobal/Shutterstock\n\nThe actress also told Entertainment Weekly at the time of her role that she \"definitely needed to learn the lessons Gia needed to learn.\"\n\n\"Especially feeling that the physical is more important than anything else, or that you're only as smart and good as somebody thinks you are,\" she said. \"It's been really important for me to look at myself in the mirror, and realize that I can't let myself go down like she did.\"\n\nJolie — who went on to win an Oscar for her performances in the following year's Girl, Interrupted alongside Winona Ryder — also said she wanted the audience \"to identify with Gia and see her as being just a regular girl.\"\n\n\"No matter how together or perfect some people may appear, they have their share of pain and a deep-down need for love — the same as everyone else,\" the actress added."}, {"url": "https://giacarangilivedhere.org/family/", "page_content": "When Gia Marie Carangi was born on January 29, 1960, in Philadelphia, Pennsylvania, her father, Joseph, was 35, and her mother, Kathleen, was 24.\n\nBaby girl Gia joined her brothers Joe Jr and Michael in the Carangi household at 4027 Fitler Street, Philly.\n\nGia had four siblings. An older half brother William, from her Dad’s first marriage, and a younger half brother Jonathan, from her Dad’s 3rd marriage.\n\nGia’s heritage is Italian from her Father’s side of the family, and Irish-Welsh from her Mother’s side.\n\nGia was named by her father Joe, who remembered hearing the unusual name while stationed in Italy during the war.\n\nGia died on November 18, 1986, in her hometown at the age of 26, and was buried in Feasterville, Pennsylvania.\n\nBelow is Gia’s family tree deconstructed, with photos. Starting with Gia’s Grandfather John Carangi from Italy.\n\nJohn (Giovanni) Carangi was born on December 8, 1882, in Castelpizzuto, Isernia, Molise, Italy. John’s family left Italy when John was 15, and worked their way to America by way of Canada. Officially arriving in America, December 6, 1900.\n\nJohn was a jeweler. He owned jewelry stores on Frankford & Oxford Avenues, under the de-ethnicized name of “Crane”. Primarily known for diamonds, which earned him the nickname “Diamond Jake”. John had a large diamond for a front tooth. Very successful businesses and his legacy in Philly proceeded him long after his death. Devoted to his family, he helped his family & friends during financial hardships in the depression. (~danette)\n\nJohn had four children (all sons) with Lucy (Lucia) Menichella of Philadelphia. John died on January 28, 1952, at the age of 69, of Guillain-Barre Syndrome.\n\nJohn (Giovanni) Carangi was buried in Philadelphia, Pennsylvania with his mother Antonia DiDonato.\n\nLucy (Lucia) Menichella of Philadelphia, wife of John (Giovanni) Carangi of Italy, was born September 12, 1895, in Roseto, Pennsylvania. Lucy passed March 27, 1965 at the age of 70. Gia was 5.\n\nThis photo is Lucy with Gia, and the other little girl is a cousin.\n\nJohn and Lucy’s boys\n\nAnthony Carangi, 2nd to the oldest. (No photos of the oldest, Andrew, were found)\n\nThe twins Joseph and Daniel Joe on the left Dan on the right 5 years old\n\nJoe Carangi Sr’s Family tree\n\nGia’s father’s FIRST marriage\n\nJoe Carangi Sr’s SECOND marriage to Kathleen\n\nKathleen had 3 children in 3 years.\n\nNew born Baby Gia Marie Carangi Kathleen and baby Gia Michael and Gia Michael and Gia Joe and young Gia Gia and her Dad Joe Carangi Sr with his children, Joe Jr, Gia and Michael\n\nJoe Carangi Sr’s THIRD marriage\n\nThis was all I could find on Joe Sr’s third marriage and youngest son. It was his last marriage.\n\nJoe Carangi was born a fraternal twin with his brother Daniel, May 18, 1924. They both served in WWII, US ARMY. Joe built a little culinary empire for himself starting with the Hoagie City in Philadelphia. Joe kept many family members employed. The twins and their two older brothers Andrew and Anthony were second-generation Italian Catholic’s, whose father John owned jewelry stores under the de-ethnicized name “Crane”.\n\nJoey Carangi Jr’s family tree\n\nJoe Carangi Jr’s 1st child is Michelle Carangi. Michelle was the teenage granddaughter who lived with Kathleen and Henry when Gia died. She was Gia’s first niece. I couldn’t find a date of birth for her, but she is still living.\n\nJoe Jr and 2nd wife Linda’s first child, is Jacki (Jacquelyn). Jacki is the sweet little girl in these photos.\n\nMichael Carangi wrote to me and respectfully requested that his story be removed and remain private. I’m more than happy to comply.\n\nKathleen Adams Carangi Sperr\n\nKathleen and Henry Sperr. Young blonde girl next to Henry is Jessica, Joe Jr’s youngest daughter.\n\nDaniel Carangi’s family\n\nDaniel Carangi, Joe’s twin brother. Both twins were WWII Army Vets. Photo 1944\n\nDan’s first wife, Mildred Terzyk passed away April 7, 1957 at age 30. They had one child, son John.\n\nDan marries second wife Rosyln Goldstein. Roslyn had daughter Linda Savino from her first marriage to Thomas Savino.\n\nDaniel’s first child, John S., was born Oct 13, 1948, passed away 1988 age 40.\n\nDaniel and wife Roslyn at daughter Danette’s wedding March 7, 1987\n\nDaniel outlived his parents and all his siblings and passed away at age 82, June 3rd, 2006, in Atlantic City, NJ.\n\nOBITUARIES\n\n~source: Ancestry.com, Findagrave.com, Facebook, google.com and “Thing of Beauty”."}, {"url": "https://giacarangilivedhere.org/about-gia-carangi/", "page_content": "Gia Marie Carangi was born January 29, 1960. She lived here on Earth until November 18, 1986.\n\nThere are some people who’s lights shine a bit brighter than most, Gia was one of those people. Her light has not faded even after she left this Earth. She left behind so many people who loved her… family, friends and fans.\n\nGia was an American model during the late 1970s and early 1980s. She was considered by many to be the first “Supermodel”. She left behind a huge portfolio of work for someone who worked for a relative short time in the fashion model business.\n\nGia was featured on the covers of many fashion magazines, including multiple editions of Vogue and Cosmopolitan. She appeared in top advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.\n\nGia experimented recreationally with drugs as a youth which was not unusual for the free-range youth of the 60s/70s. She became addicted to heroin at the height of her modeling career then it rapidly declined.\n\nGia died of AIDS-related complications at the age of 26, becoming one of the first famous women to die of the disease.\n\n“Gia died clean and sober”\n\nThis website is dedicated to Gia’s life on Earth.\n\nGia is dancing in heaven to the song “Don’t you (Forget About Me)” by Simple Minds. Love on ya Rob!\n\n… no one has forgotten about you Gia… that would be impossible. You are completely unforgettable. As a matter of fact there are THOUSANDS of people all over the world who know you, your story, your light and they LOVE you. New people, young people, discover you and fall for you every day. You truly live on, just not on Earth."}, {"url": "https://www.geni.com/people/Gia-Carangi/6000000182703070844", "page_content": "About Gia Carangi\n\nhttps://en.wikipedia.org/wiki/Gia_Carangi\n\nGia Marie Carangi (January 29, 1960 – November 18, 1986) was an American model, considered by many to be the first woman to be titled as supermodel. She was featured on the cover of fashion magazines, including multiple editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.\n\nAfter she became addicted to heroin, Carangi's modeling career rapidly declined. At age 26 she died of AIDS-related complications, believed to have contracted the disease from a contaminated needle, becoming one of the first famous women to die of the disease. Her life was dramatized in the television film Gia, starring Angelina Jolie, which debuted on HBO in 1998."}, {"url": "https://movie.douban.com/celebrity/1213248/", "page_content": "影人简介 · · · · · ·\n\n吉雅卡兰芝（GIA）, 70年代末，80年代初期世界超级名模。如今，国际超级名模中同性恋或双性恋的女子，私下称她们自己为“吉雅的女孩子们”。吉雅卡兰芝（Gia Carangi）世界第一超级名模。\n\n今天大概只有辛迪克劳馥的名气能和她媲美。吉雅卡兰芝什么都有，美貌，魅力，名利和无数的追求者。数不尽的男人对她着迷，她却对男人没有兴趣，而是勇于追求同性恋爱情。杰克尼克松曾经把自己酒店房间的钥匙给了吉雅，但是吉雅从未用过。\n\n吉雅原本是成长在费城中下阶层的平凡女孩,那个充满迷幻文化的苍白年代,她因为热情勇敢的形象,十八岁那年已经频繁出现在\"哈波时尚\"\"柯梦、波丹\"等杂志封面。\"超级名模\"这个称号,就是因为吉雅而开始被广为使用。\n\n然而来得太快太巨大的声名总是足以冲散一个豆蔻年华女孩的自由与梦想，摧毁还没有准备好的年轻生命，吉雅很快就开始嗑药，不断残害别人和自己，在勇敢追同性恋爱情的同时，却无法抵当严重的不安全感。二十六岁那年，吉雅死于艾滋病。1998年HBO推出的自制电视电影”霓裳情挑'以迷乱和令人心碎的风格来描绘了吉雅的一生。"}, {"url": "https://www.astro.com/astro-databank/Carangi,_Gia", "page_content": "Name Carangi, Gia Gender: F Birthname Carangi, Gia Marie born on 29 January 1960 at 22:14 (= 10:14 PM ) Place Philadelphia, Pennsylvania, 39n57, 75w10 Timezone EST h5w (is standard time) Data source Orig source not known Rodden Rating C Collector: Starkman Astrology data 09°14' 04°17 Asc. 09°21'\n\n\n\n\n\n\n\n\n\n\n\n(to view image author and license, click here) Gia Carangi\n\nBiography\n\nAmerican model during the late 1970s and early 1980s. Considered by some to be the first supermodel, she was featured on the cover of fashion magazines, including multiple editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.\n\nAfter she became addicted to heroin, Carangi's modeling career rapidly declined. She died of AIDS-related complications on 18 November 1986 at the age of 26, becoming one of the first famous women to die of the disease. Her life was dramatized in the television film Gia, starring Angelina Jolie, which debuted on HBO in 1998.\n\nLink to Wikipedia biography\n\nSource Notes\n\nStarkman quotes astro-seek [1], source unknown.\n\nStarkman rectified to 22.14.40 EST Asc 0Lib29\n\nCategories\n\nDiagnoses : Major Diseases : AIDS/ HIV\n\nPersonal : Death : Illness/ Disease\n\nVocation : Beauty : Model"}, {"url": "https://rgnn.org/2020/11/24/the-story-of-gia-carangi-the-worlds-first-supermodel/", "page_content": "Gia Marie Carangi, better known as “Gia Carangi”, is the name of world’s first supermodel. Born on the January 29, 1960 in Pennsylvania, she tragically died at the young age of 26 due to the ongoing HIV/AIDS crisis in the United States.\n\nGia Carangi Vogue Paris cover | @Sondra Hughes from Pinterest\n\nThis God-gifted fashion icon has appeared on the cover of Vogue Paris in April 1979; Vogue America in August 1980; Vogue Italia in January 1981; and many issues of Cosmopolitan between 1979-1982. Moreover, she also appeared in advertising campaigns for such fashion houses as Armani, Versace, Christian Dior, and Yves Saint Laurent.\n\nGia Carangi gloriously presented herself in the modeling industry during the 1970’s. She was undoubtedly a successful model, even when compared to other famous models like Janice Dickinson and bachelorarbeit schreiben lassen Jean Shrimpton. Gia Marie Carangi was the queen of the American modeling industry from 1970 to 1980. She had a great career until she unfortunately developed an addiction to illicit drugs.\n\nCarangi was greatly influenced by the music and fashion icon, David Bowie. She and many of her friends emulated his epicene style. It was a style that would continue to define Carangi’s personal look for the rest of ghostwriting agentur her life. She was also drawn to him as a symbol of rebellion and countercultural values.\n\nHer addiction to drugs and alcohol eventually led to the downfall of her career. Gia Carangi later became infected with HIV/AIDS and this bold icon of the fashion world passed away due to ghostwriter hausarbeit complications related to her condition on November 18, 1986.\n\nHer mother took care of her during her last days, and her death wasn’t given much publicity. Even her funeral wasn’t really recognized. Most of her friends and colleagues were not even in attendance.\n\nShe was remembered by many and even today it’s hard for people to forget her face. In her memory, a biographical movie was made on her life called Gia, where Angelina Jolie played her role. The movie was a hit and gohstwriter tried to increase awareness about drug abuse and HIV/AIDS by featuring someone as well-known as Angelina Jolie."}, {"url": "https://www.celebsagewiki.com/gia-carangi", "page_content": "Age, Biography and Wiki\n\nGia Carangi (Gia Marie Carangi) was born on 29 January, 1960 in Philadelphia, Pennsylvania, United States, is an American model. Discover Gia Carangi's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 26 years old?\n\nPopular As Gia Marie Carangi Occupation Model Age 26 years old Zodiac Sign Aquarius Born 29 January 1960 Birthday 29 January Birthplace Philadelphia, Pennsylvania, United States Date of death November 18, 1986, Died Place Philadelphia, Pennsylvania, United States Nationality American\n\nWe recommend you to check the complete list of Famous People born on 29 January. She is a member of famous Model with the age 26 years old group.\n\nGia Carangi Height, Weight & Measurements\n\nAt 26 years old, Gia Carangi height is 173 cm .\n\nPhysical Status Height 173 cm Weight Not Available Body Measurements Not Available Eye Color Brown Hair Color Brown\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nGia Carangi Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Gia Carangi worth at the age of 26 years old? Gia Carangi’s income source is mostly from being a successful Model. She is from American. We have estimated Gia Carangi's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Model\n\nGia Carangi Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Gia Carangi Wikipedia Imdb\n\nTimeline"}, {"url": "https://metaunfolded.com/gia-carangi/", "page_content": "Gia Carangi was among the very first American supermodels. Due to her substance abuse and personal issues, her very promising career was cut short. In only six years as a professional model, she had accomplished a great deal. Carangi had appeared on the covers of prestigious fashion magazines such as Cosmopolitan and Vogue. She was once the go-to model for major designers such as ‘Giorgio Armani’, ‘Gianni Versace’, ‘Maybelline’, ‘Christian Dior’, ‘Chanel’, ‘Yves Saint Laurent’, and ‘Levi Strauss & Co.’ In the early 1980s, her life took an unfortunate turn when she became addicted to cocaine, and her career quickly declined. She attempted to get sober and maintain her career but failed woefully at doing so. Later, she was diagnosed with complications related to AIDS and became one of the very first famous women to pass away from the disease. In her life, numerous television programs, documentaries, and films have been produced. A biopic titled ‘Gia’ starring Angelina Jolie was broadcast on HBO. Jolie earned an award for her performance in the biopic.\n\nGia Carangi’s Career\n\nGia Carangi had a brief but glittering career. She was able to secure advertisements in several Philadelphia publications. This gave her optimism for a successful career in the fashion industry. Thus, she departed Philadelphia at the age of seventeen for New York City.\n\nAfter relocating to New York, she joined Wilhelmina Models immediately. Within a few months, she secured her first significant photo shoot with renowned fashion photographer Chris von Wangenheim. Carangi posed without clothing for Wangenheim behind a chain-link fence. The photoshoot also included Sandy Linter, with whom Carangi later developed a romantic relationship.\n\nHer first major photo shoot garnered her widespread recognition in the fashion industry, and she went on to collaborate with a number of renowned fashion photographers, including Arthur Elgort, Richard Avedon, Denis Piel, and Francesco Scavullo. Carangi quickly became the “go-to girl” for the leading fashion magazine Vogue. From April 1979 to August 1980, she was featured in ‘Vogue UK’, ‘Vogue Paris’, ‘American Vogue’, and ‘Vogue Italia’.\n\nIn addition, she posed for ‘Cosmopolitan’ on multiple occasions between 1979 and 1982, and she represented top apparel brands. She represented ‘Armani’, ‘Christian Dior’, ‘Versace’, ‘Yves Saint Laurent’, ‘Levi Strauss & Co.’, and ‘Calvin Klein’.\n\nDuring the peak of her career, Carangi began living a lavish and reckless lifestyle. Her frequent visits to nightclubs resulted in her consistent cocaine use. She fell victim to the substance after becoming addicted to it. Soon after, she began experiencing difficulties at work, as she frequently abandoned photo sessions and lost control of herself.\n\nDuring her shoots, she would beg for drugs, making it difficult for others to control her. Carangi was discovered with needle marks in one of the issues of ‘American Vogue’ despite extensive airbrushing. Several prominent brands severed ties with her, and she struggled to find employment. She attempted rehabilitation and a revival, but neither was successful because she was unable to overcome her addiction.\n\nGia’s Personal Life\n\nGia Marie Carangi was born on January 29, 1960, in Philadelphia, Pennsylvania, to Joseph and Kathleen Carangi. Her father, Joseph, owned a restaurant, and her mother, Kathleen, used to take care of the family. Carangi’s ancestry included Italian, Welsh, and Irish ancestry. She was raised alongside two older siblings.\n\nHer parents’ marriage was tumultuous and they fought frequently. Gia’s mother finally abandoned the family when she was eleven years old. Numerous close relatives and childhood acquaintances have stated that her drug abuse and erratic lifestyle stemmed from her troubled upbringing.\n\nShe attempted to form relationships with other teenage females when she was a teenager. She also formed relationships with a group of adolescent boys and girls who were David Bowie fans. Carangi was greatly influenced by both Bowie’s fashion statements and his outspoken stance on bisexuality when the group used to chill out together.\n\nShe attended Abraham Lincoln High School, where she developed a ‘tom-boyish’ personality. She was homosexual, but she never identified herself as a lesbian.\n\nGia Carangi’s Death\n\nGia Carangi had a difficult childhood and subsequently developed a cocaine addiction. Not only did her substance abuse destroy her career, but it also forced her into a life in which she had no control over herself. Between 1984 and 1986, she had sexual relationships with a number of her “friends and lovers.” On October 18, 1986, she was diagnosed with complications related to AIDS and confined to Hahnemann University Hospital.\n\nExactly one month later, she perished of AIDS-related complications, becoming one of the very first female celebrities to succumb to the disease. On November 23, none of her professional associates and colleagues were promptly notified of her passing, and she had a small funeral service in Philadelphia.\n\nEstimated Net Worth\n\nGia Carangi was an American fashion model who, at the time of her demise, had a net worth of $10,000. Born in Philadelphia, Pennsylvania in January 1960, Gia Carangi passed away in November 1986. Some considered her the first supermodel, and she appeared on the covers of Cosmopolitan and Vogue, as well as in advertising campaigns for Christian Dior, Armani, Yves Saint Laurent, and Versace."}], "Gia Marie Carangi was a model.": [{"url": "https://people.com/movies/angelina-jolie-gia-25th-anniversary-about-death-of-model-who-inspired-movie-gia-carangi/", "page_content": "It's been 25 years since Angelina Jolie starred as Gia Carangi in Gia.\n\nThe 1998 HBO television film featured a then-22-year-old Jolie as the real-life Carangi, who was considered by many the world's first supermodel. She died in 1986 at age 26 of AIDS-related complications, at just 26 years old.\n\nMila Kunis also appeared in Gia as a younger version of Carangi, in one of her first-ever film roles, while additional cast members included Faye Dunaway, Mercedes Ruehl, Elizabeth Mitchell and Scott Cohen.\n\nDirected by Michael Cristofer (Mr. Robot) and co-written by Cristofer, 78, and Jay McInerney, Gia is about \"the life of Gia Carangi, a top fashion model from the late 1970s, from her meteoric rise to the forefront of the modeling industry, to her untimely death,\" according to a synopsis from IMDb.\n\nRead on to learn more about Carangi, from her early life to her tragic death.\n\nNever miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human-interest stories.\n\nGia Carangi. Andrea Blanch/Getty\n\nCarangi was born Gia Marie Carangi in Philadelphia on Jan. 29, 1960, into a working-class family that included two older brothers. Her father Joseph Carangi, who was Italian, owned a restaurant, while her mother, Kathleen Carangi (née Adams), was a homemaker.\n\nIn the late 1970s, Carangi was discovered on the dance floor by a local photographer. Her first modeling gig for a major advertisement was with Versace, and she had become a well-known figure at Wilhelmina Models in New York City by 1980, according to The New York Times.\n\nBut throughout her catapult to fame, Carangi — who was one of the first openly gay models, Dazed reported — struggled with addiction and substance abuse, including of cocaine and heroin.\n\nBack in 2020, makeup artist Sandy Linter recalled to The Hollywood Reporter that she and Carangi had a romance in the late 1970s that \"was never a torrid sexual affair but we did love each other.\"\n\n\"I was just as shocked as anybody that she became an addict,\" Linter said. \"She thought she was stronger than the drugs. One morning, as she was getting dressed to leave my apartment she asked, 'What happened to my natural energy?' She didn't have the energy to get dressed at 20 years old. The drugs took everything.\"\n\nGia Carangi. Dustin Pittman/WWD/Penske Media via Getty\n\nAccording to Dazed, Carangi attempted several times to get clean, including going to rehab, but it never stuck. She was diagnosed with AIDS in December 1985, and died of related complications the following November.\n\nLinter told THR that the last time she saw Carangi was in 1983 or 1984, when the model rang her doorbell, then \"sat down on my couch with me, put her head on my shoulder and cried.\"\n\n\"It was the end of our 'romance.' I knew it and she knew it. Because she looked so good, I had been tricked into thinking that she was on the road to recovery,\" Linter said. \"I never knew she had AIDS until later. After maybe 30 minutes, she looked out the window, nodded to someone in the street and left. I would never see her again.\"\n\nMore than 35 years after Carangi's death, Gia is still beloved by fans, holding a Rotten Tomatoes score of 93%, with an Audience Score of 82%.\n\nAhead of the movie's release, Jolie, now 47, told The New York Times in 1997 that she initially \"hated\" Carangi while doing research about her, based on a 20/20 interview the model once did — but eventually changed her tune and thought, \"I'd like to date Gia. I'd want to be her lover.''\n\nAngelina Jolie (center) in Gia (1998). Larry Watson/Citadel Ent/Kobal/Shutterstock\n\nThe actress also told Entertainment Weekly at the time of her role that she \"definitely needed to learn the lessons Gia needed to learn.\"\n\n\"Especially feeling that the physical is more important than anything else, or that you're only as smart and good as somebody thinks you are,\" she said. \"It's been really important for me to look at myself in the mirror, and realize that I can't let myself go down like she did.\"\n\nJolie — who went on to win an Oscar for her performances in the following year's Girl, Interrupted alongside Winona Ryder — also said she wanted the audience \"to identify with Gia and see her as being just a regular girl.\"\n\n\"No matter how together or perfect some people may appear, they have their share of pain and a deep-down need for love — the same as everyone else,\" the actress added."}, {"url": "https://allthatsinteresting.com/gia-carangi", "page_content": "After moving to New York in 1977, Gia Carangi became one of the most sought-after models in fashion and a fixture of Studio 54 — but her life quickly unraveled.\n\nOn the surface, Gia Carangi seemed to have it all. In the late 70s and 80s, Carangi owned the spotlight and had droves of adoring fans.\n\nIt’s said that she added the “super” in supermodel to describe how exponentially successful she had been in her career. Known for an edgy personality and a smoldering stare, the world was Carangi’s catwalk.\n\nBut the very attitude and wild side of America’s first supermodel which made Gia Carangi so desirable also made her a great danger to herself. This would be her undoing.\n\nGia Carangi’s Early Life\n\nGia Marie Carangi was born on January 29, 1960, in Philadelphia to an Italian-American father, Joseph, who owned a tiny restaurant called Hoagie City. Her mother, Kathleen Carangi, was a homemaker.\n\nCarangi’s parents separated in 1971. Those close to Carangi, including herself, have admitted that this divorce had a lasting impact on her attitude.\n\nHer two brothers, both older than her, moved out and lived with their mom while Carangi stayed with her father. She spent her summers behind his counter, attending concerts like your run-of-the-mill high schooler.\n\nIt was in the summer of 1978 that a local photographer and hairdresser, Maurice Tannenbaum, asked the dark-haired beauty to pose on the dance floor after spotting her at a local nightclub. Carangi’s dark, tomboyish looks, 34-24-35 measurements, and perfect face were an ideal match for the fashion world which at the time was overrun with willowy blondes.\n\nTannenbaum passed on Carangi’s photos to legendary New York department store Bloomingdale’s photographer, Arthur Elgort. Before Carangi knew it, she was the talk of New York.\n\n“I started working with very good people,” Gia Carangi confided in a 1983 interview. “I mean all the time, very fast. I didn’t build into a model. I just sort of became one.”\n\nA Meteoric Rise To Fame\n\nGia Carangi’s first photoshoot at the Philadelphia nightclub, back when she was just 16, was the beginning of her meteoric rise to stardom, and life only moved faster once she moved to New York.\n\nCarangi signed with Wilhelmina Cooper, a legendary fashion agent and owner of her own modeling agency. Wilhelmina became a kind of mother figure to Carangi.\n\nFrancesco Scavullo, a leading fashion photographer of the day and who would become a personal friend of Carangi’s, gushed of her:\n\n“There was something she had… no other girl has got it. I’ve never met a girl who had it. She had the perfect body for modeling: perfect eyes, mouth, hair. And, to me, the perfect attitude: ‘I don’t give a damn.'”\n\nThat attitude proved to be both what was so enticing and dangerous about Carangi.\n\nHer androgynous look was in part due to her sexuality. Described in some instances as aggressive and others as vulnerable, Carangi seemed to have a need to be loved — and mostly by women.\n\nThose who had worked with her said it wasn’t uncommon for her to fall in love with the models she shot with. On a shoot for photographer Chris von Wangenheim, which would become wildly popular, Carangi posed nude up against a fence with makeup artist and model Sandy Linter.\n\nThe two would embark on a passionate though unrequited love affair.\n\nIndeed, Gia Carangi appeared insatiable both in her love life and in her recreational drug use. As a teen, she was already hooked on marijuana, cocaine, and quaaludes.\n\nCarangi went on to model for Christian Dior, Giorgio Armani, Versace, Diane Von Furstenberg, Cutex, Lancetti, Levi’s, Maybelline, Vidal-Sassoon, and Yves Saint Laurent — to name a few. At the age of 18, Carangi was making $100,000 a year. It was more than any other model at the time, leading many fashion historians to dub her the world’s first supermodel.\n\nShe then landed on the covers of Vogue and Cosmo starting in 1979.\n\n“A model has to create moods,” Carangi said of her talent, “You have to be careful not to get stuck in a mood – emotions have trends just like fashion … I become what ever your eye wants to see. It’s my job.”\n\nBut Gia Carangi remained hard to control. Though it was her edgy attitude that drew people to her, Carangi was also tough to work with. A diva by age 18, she would walk off shoots if she wasn’t feeling it, or would cancel weeks of work if she didn’t like her haircut.\n\nCarangi would chow down on barbecue chicken while wearing a dress worth thousands of dollars. She was also transparent about her drug use, discussing it openly in interviews and partying often with other stars and socialites at Studio 54.\n\nBut there was also a deep loneliness in her, returning to her apartment alone after work, and constantly searching for love. “I am finally really starting to dig being different. Maybe I am discovering who I am. Or maybe I’m just stoned again,” she admitted.\n\nGia Carangi Backslides Into Drugs\n\nThe supermodel would go from a $10,000 photo shoot to a “shooting gallery”, or seedy locale where one can shoot up heroin, on Manhattan’s Lower East Side.\n\nIn 1980, Wilhelmina died and sent Carangi into a spiral. Already using heroin, the supermodel delved deeper into her habit. During a shoot that year for Vogue with famed portrait photographer Richard Avedon, Carangi escaped through a window. Though incensed, the magazine gave her a second chance at the shoot, but when the pictures came back they revealed track marks and red bumps all over the model’s arms.\n\nIn 1981, she was arrested for driving under the influence of a narcotic.\n\nIn May of that same year, 21-year-old Carangi needed to get hand surgery because “she had injected herself in the same place so many times that there was an open infected tunnel leading into her vein,” her biographer Stephen Fried documented.\n\nFor her final Cosmo cover photo in early 1982, fashion photographer Scavullo covered up the track marks on her arms by having her put her hands behind her back. The dress she wore was poofy enough to cover up the scars of her habit. The model also angled her face to cover up the bloating.\n\nHer brother, Michael, recalled his little sister’s behavior and laments: “The biggest mistake we made was that nobody went up there with her. She could’ve used a friend.”\n\nGia Carangi left her modeling agency, tried to stay afloat at another, but wound up returning home to Philadelphia to live with her mother at a final grasp at finding sobriety.\n\nAn Untimely Demise\n\nGia Carangi was blackballed from New York’s agencies and although magazines gave her several last chances, the model could not pull herself together. One of her final shoots appeared in Vogue in 1982 and was photographed by Andrea Blanch.\n\nBy the end of that year, Carangi had become so volatile that she couldn’t get booked for jobs. No one wanted to work with the wild child any longer.\n\nShe had a successful go at rehab for about a year following in Philadelphia. By this time she was broke and receiving rehabilitation from welfare.\n\nhttps://www.youtube.com/watch?v=9npRKUAeQZI\n\nMeanwhile, model Cindy Crawford came on the scene as a newer, more put together version of Gia. Crawford admitted to Playboy that many of her jobs came from those who loved Carangi and were hoping to replace her.\n\nIn the fall of 1986, Carangi was hospitalized. It became apparent that she had been sleeping outside in the rain and had been badly beaten up and raped. Blood tests showed she was suffering from AIDS-related complications.\n\nOn November 26, 1986, America’s first supermodel died of those complications, though her mother was by her side.\n\nCarangi’s meteoric and tumultuous career were immortalized in the HBO movie Gia that starred Angelina Jolie nearly a decade later in 1998. Jolie said of the model herself after portraying her, “You think, ‘God, she didn’t need drugs — she was a drug.'”\n\nCarangi seemed to be somewhat cognizant of her brilliant, though short, career. She said forebodingly in an interview before her demise: “Modeling is a short gig.”\n\nAfter this look at Gia Carangi, read about who some believe was America’s first “it” girl, Audrey Munson. Then, take a look at the strange and sad story of the French fitness model who was killed by an exploding whipped cream can."}, {"url": "https://www.factinate.com/people/facts-gia-carangi/", "page_content": "Gia Carangi took the modelling industry by storm with her fearless, androgynous look and risk-taking sensibilities. Although she is widely considered to be the first supermodel, her early exposure to substances derailed her career right at the peak of her success. Gia’s story is a cautionary tale—one of heartbreak and regret—and it only ends in tragedy.\n\n1. She Came From A Broken Family\n\nAdvertisement\n\nBorn January 29, 1960, Gia Carangi had it rough right from the get-go. Her home life was violent and unstable, and when she was only 11 years old, her mother walked out on the family. After that, Gia didn’t see her mother for years. She spent her youth in Philadelphia, working at her father’s small restaurant and trying to forget her yearning for a maternal figure.\n\nBut this sense of loss never went away.\n\n2. She Marched To The Beat Of Her Own Drum\n\nGia found other meaningful connections in her friendships and was shamelessly open with her feelings. She often declared intentions of friendship with floral bouquets. No flowers for the boys though! Gia was all about the ladies. In high school, she pivoted from platonic girl crushes and began frequenting gay clubs, subverting gender norms every chance she got.\n\nHowever, Gia did have time for one man, and one man only—her idol, David Bowie.\n\n3. She Looked Up To A Legend\n\nGia and her friends obsessed over Bowie’s glam style, bisexuality, and playful gender subversion. Taking cues from the legendary musician, Gia adopted an androgynous style. She wore men’s clothes—army pants and combat boots–and kept her hair cropped short and brightly dyed. But that wan’t all. Gia was a barefaced beauty all the way through and never wore a stitch of makeup.\n\nWhile out at the clubs, she definitely stood out from the crowd.\n\n4. She Stood Out From The Crowd\n\nEveryone noticed Gia—it was hard not to. She was a hip vision in her thrifted vintage wardrobe of men’s castoffs, and her signature style was a striking contrast to her unadorned natural beauty. Instantly captivated by Gia at a club she frequented, a local shutterbug, Maurice Tannenbaum, asked to take her photograph on the dance floor. Before long, bold, confident, and self-assured Gia began to model in local advertisements.\n\nBut that wasn’t all the nightclubs had to offer.\n\nAdvertisement\n\n5. She Was Gay and Proud\n\nWhen she was only 15 years old, Gia partied at the gay club DCA and set her eyes on a short and beautiful blonde girl named Sharon Beverly. She’d actually briefly dated Beverly’s brother, but in the end, her overwhelming attraction to Beverly won out. However, there was one caveat—Beverly was quite a bit older than Gia and it was about to get her in a lot of trouble.\n\n6. She Was Too Young\n\nAlthough Kathleen Sperr wasn’t especially close to her daughter Gia, it didn’t stop her from laying down the law. After finding out about Gia’s lesbian romance with Sharon, she immediately called up Sharon’s parents and warned them that their daughter was far too old to be hanging out with Gia. Of course, this never stopped Gia from pursuing what she wanted—whether it be a woman or a career or a bad decision.\n\n6. She Took A Chance\n\nWith some exposure and experience, Gia decided to see how far she could get with modelling. Like many before her, Gia’s dreams and aspirations were bigger than the confines of her hometown. The bright lights and endless possibilities of New York City drew Gia to the pulsing metropolis. Only 17, and all on her own in an unfamiliar and strange city, Gia didn’t have to wait long before being discovered.\n\nShe soon met a woman who would not only be her agent, and mentor, but also a dear friend. This was the maternal figure she had been searching for all along.\n\n7. She Was A Hit\n\nWhen Gia met Wilhelmina Cooper, one of the most successful models of the 1960s, everything changed. Although Cooper’s career had been based on her icy, aristocratic look, she immediately recognized the edgy, blue-collar Gia as a new breed of model. After signing her on, Cooper took Gia under her wing, and before long, Gia herself had become a one-name wonder.\n\n8. She Got Her First Big Break\n\nThe first major shoot Gia booked was so chaotic and iconic it’s still talked about to this day. In it, Gia climbed and posed against a chain link fence. And then she amped up the drama. She started shrugging out of her clothes, eventually shedding them all together. When another model joined her on set, the two of them took it to the next level.\n\nSign up to our newsletter. History’s most fascinating stories and darkest secrets, delivered to your inbox daily. Making distraction rewarding since 2017.\n\n9. She Was Obsessed With Her Makeup Artist\n\nOn the day of her infamous photoshoot, Gia had two costars. The first round of shots were taken with Lisa Vales, but for the second round, the photographer wanted to do something more personal and asked the makeup artist, Sandy Linter, to step in. That’s when the magic really started happening. She and Gia had unbelievable chemistry.\n\nAdvertisement\n\n10. She Bared All\n\nTogether, Gia and Vales turned up the heat, sharing steamy smouldering gazes through the wire, with only the fence between them. It was risky and fearless, and absolutely successful. The pictures are now part of fashion history and still have tongues wagging to this day. More than that, the snaps launched Gia’s career into the stratosphere.\n\n11. She Became The First Supermodel\n\nThe photos caused a sensation, and in a short time Gia established herself within the modelling world. She began working with top fashion houses including haute couture heavyweights Versace, Armani, and Saint Laurent. But that wasn’t all. She also booked coveted jobs as a cover girl for Paris and American Vogue. As Gia’s star rapidly rose, there was one person she just couldn’t get out of her head.\n\n12. She Shot Her Shot\n\nThe day after their steamy photoshoot, Gia put the moves on Linter, and asked her if she wanted a ride in her bright red sports car. Linter went along with it and soon after, things started getting serious. After her busy work days, 19-year-old Gia didn’t want to spend the rest of her night alone in an empty apartment. With Linter, she found companionship—a balm to her ever growing sense of isolation.\n\n13. She Fell In Love\n\nGia and Linter loved one another deeply and while Linter has since admitted that it wasn’t a “torrid love affair,” these two girls certainly shared a special connection. They spent most of their time together. There were flowers, restaurants, and wild nights out at the clubs, but most importantly, there was the mutual feeling of being understood.\n\nBut this comfortable relationship was never destined for “happily ever after.”\n\n14. She Was Intensely Lonely\n\nPeople described Gina as a loner, but those closest to her claimed the opposite was true. When it came to her relationship with Linter, Gia always wanted more—more stability, more affection, and more time. Unfortunately, Linter just wasn’t able to give her any of this, and was hesitant to put labels on their relationship. Slowly but surely, Gia’s constant need for attention doused any hope of a long-term commitment.\n\nWithout Linter and with the constant pressures of the modelling industry, Gia sought out other—more dangerous—coping mechanisms.\n\n15. She Was A Casual User\n\nPartygoers of the decadent disco era were nose candy enthusiasts, and the powder was ubiquitous in the night club culture that Gia adored. The hotspot club Studio 54 was a notorious place for using substances, and bumping lines off the closest mirror was commonplace with the party people crowd Gia ran with. This was a slippery slope, and Gia dove down it—head first.\n\nAdvertisement\n\n16. She Was Oblivious\n\nOf course, this underworld had sinister consequences. It was almost too easy for an unsuspecting user to snort a different substance by mistake…like say, if the substance was a white powder. Gia, like many others at the time, was sorely misinformed about it and believed that you couldn’t get addicted unless under certain circumstances. As she soon learned, it was far more dangerous than she ever expected.\n\n14. She Hit Her Peak\n\nAmid the temptations of New York’s nightlife, Gia was at the top of her game. To her delight, she participated in a rite of passage for A-list models, making a guest appearance in a music video. The band was Blondie, and as a huge fan, Gia cut across the dance floor, bobbing her head to the song “Atomic.” With the music video and her unparalleled success, everything was going according to plan…\n\n…But just as she was taking off, a tragedy struck.\n\n15. She Lost Her Mentor\n\nWhen Gia learned that her mentor Wilhelmina had been diagnosed with lung cancer, she felt her world crumbling around her. This powerful woman had acted as her center—her maternal figure and guiding light. At the tragically young age of 40, Wilhelmina succumbed to her illness, leaving Gia all alone. Devastated and grieving, the young model made a terrible mistake.\n\n16. She Couldn’t Keep It Together\n\nWith only two years of industry experience, Gia immediately began to falter without Wilhelmina’s strong guidance and encouragement. Her depression drove her to self-medicate with the many subtances available to her and it wasn’t long before she disappeared into the grip of addiction. Of course, this self-destructive behavior didn’t bode well for her blossoming career.\n\n17. She Was A Diva\n\nEven before her troubles with addiction began to have an impact on her work, Gia was a total diva. Her high-maintenance behavior was part and parcel of her edgy style that made her unique. But there was only so much people were willing to tolerate. She was notoriously hard to work with. And as her use only escalated, so did her difficult antics…\n\n18. She Lost Control\n\nBefore substances, it wasn’t uncommon for Gia to wander off and ghost a set, or cancel work over a bad haircut, but under the influence, it only got worse. While on set, she started pulling vicious temper tantrums, and sometimes, she’d even abandon a job just to seek out a score.At an extremely low point, her overwhelming exhaustion had her falling asleep in front of the cameras. But that wasn’t all.\n\nAdvertisement\n\n19. She Became An Addict\n\nGia’s addiction became so bad that in one of her datebooks she made it a top priority, scrawling the words, “Get heroine.” Ugh! The grim misspelling is so multilayered. Gia, instead of continuing to be the hero of her own story became hopelessly enthralled by the narcotic that would doom her. As her addiction spiralled out of control, her peers and few friends began to see that Gia was on a crash course for disaster.\n\n20. She Didn’t Have A Lot Of Friends\n\nDuring this time, one of the few friends Gia had left was her ex-girlfriend Sandy Linter. Linter herself was no stranger to using in nightclubs, and at the time, had no idea how destructive it could be. But witnessing Gia’s descent into addiction changed all that. She was shocked to discover that, at the vibrant age of 20, Gia had so little energy she could barely dress herself.\n\nBut the side effects of addiction didn’t end there…\n\n21. She Had Surgery\n\nIt’s fair to say that a model’s face and body is their brand and their product, and Gia certainly wasn’t careful with the merchandise. As she constantly shot up in the same spot, her habit caused an abscess and infection that damaged a vein and required her to undergo surgery. Still, the surgery didn’t fix the problem, and soon, the constant injections became an even bigger issue.\n\n22. She Had One Supporter\n\nTo her dismay, Gia’s track marks soon became too noticeable to ignore. The scars and bruises marred her photos, and soon barely anybody wanted to work with her. Only one fashion photographer kept coming back to Gia. Francesco Scavullo, who had met Gia when she was just a teenager, stood by her. He had seen her potential from the get-go and supported her every step of the way.\n\nBut during a photoshoot in the Caribbean, even Scavullo couldn’t deny that Gia needed some serious help.\n\n23. She Needed Help\n\nWhile shooting with Scavullo on location, Gia had a total breakdown. She couldn’t find any scores, and became tearful and unstable. Luckily, Scavullo stepped in like a guardian angel and calmed her down, forcing her to go to bed for some much-needed rest. Gia was circling the drain—rock bottom was just around the corner.\n\n24. She Became A Terrible Client\n\nDuring one of her last shoots for American Vogue, Gia’s track marks were highly noticeable. So visible, in fact, that they can be seen in the final pictures. No amount of airbrushing could conceal the unsightly scars and bruises. This damage coupled with her lax professionalism endangered her career, and Gia was steps away from being blacklisted.\n\n25. She Jumped Ship\n\nWilhelmina as a company meant nothing to Gia without Cooper at the helm, and she left the agency to sign with competitor Ford Models. But her plan went horribly wrong. Ford Models dropped her almost immediately, and from there, Gia’s career quickly went downhill. But the fashion companies weren’t the only ones to steer clear of Gia, and soon she found herself more alone than ever.\n\n26. She Had Nobody\n\nAs her work dried up, her fashion industry “friends” scattered like rats from a sinking ship, and even by some accounts her old bestie Sandy Linter wouldn’t talk to her anymore. She became so toxic that no one wanted her rep to rub off on them by association. Jobless, friendless, and completely consumed by her addiction—Gia knew it was time for a change.\n\n27. She Upped And Left\n\nGia desperately needed a break to find some clarity and came up with a strategy to get her life back on track. She made a drastic decision and abandoned the temptations of New York, returning home to Philadelphia to stay with her mother and stepfather. More than anything, she wanted to get clean, and decided to try a 21-day detox program. Perhaps this was the answer to all her problems…\n\n28. She Tried To Get Clean\n\nAfter the detox program, Gia’s sobriety seemed hopeful. But to everyone’s dismay, the detox program didn’t yield any long-lasting results. Not long after finishing the program, she relapsed…and relapsed hard. In fact, she landed in some serious trouble. On one memorable occasion she incited a car chase with the authorities where she sped recklessly through the suburbs.\n\n29. She Crashed And Burned\n\nJust like her attempt at rehabilitation, her car chase antics ended in disappointment. She crashed into a fence and was taken into custody. There, they determined that she was indeed, extremely intoxicated and high as a kite. Resigned to her own dependencies, Gia tried to look for more work. But more than anything, she just wanted her old life back.\n\n30. She Put On A Brave Face\n\nIn 1981, Gia had her first and only television appearance. Her 20/20 interview on ABC highlighted the darker side of the modelling world, but also gave Gia the chance to set the record straight. She hoped to show the world that she’d overcome her many demons, and was ready for a comeback. Nothing could be further from the truth.\n\n31. She Lied On Television\n\nThroughout the interview, Gia claimed that her life of using was over, and that she was completely clean. But her glazed look throughout the segment only proved that she was still using. Her empty claims had her lying through her teeth—so desperate was she for the industry to give her another chance. Then, later that year, something promising happened.\n\n32. She Attempted A Comeback\n\nIn late 1981, Elite Model Management decided to give Gia the benefit of the doubt and signed her. But even then, finding work was a struggle. Because of her tarnished reputation, many companies refused to even consider working with her. No matter how hard she tried to leverage her past status, her comeback soon proved futile.\n\nTo add insult to injury, her very last photoshoot sadly mirrored the success of her first one—they were both infamous–but for very different reasons…\n\n33. Her Photoshoot Was A Disaster\n\nGia’s last magazine cover shoot was for Cosmopolitan in 1982. Behind the camera was none other than her tried and true friend—Francesco Scavullo. But not even his comforting presence could make this last project a success. One of Scavullo’s assistants later reflected on Gia’s dwindling health: “I could see the change in her beauty. There was an emptiness in her eyes.”\n\nUnsurprisingly, the photoshoot was a disaster.\n\n34. She Hid Her Scars\n\nThe Cosmopolitan cover featured Gia with both her arms hidden by the full skirt of her dress. The awkward pose was the only solution to cover up how disfigured Gia’s arms had become from her continued use of needles. After this disastrous shoot, Gia had no choice but to resort to modelling for department stores and catalogs. But even then, fate offered her another shot at redemption…\n\n35. She Had One Last Chance\n\nDespite her notoriously bad behavior, Gia was given one last miraculous chance. While doing mostly catalog work, she landed a gig with famed fashion photographer, Richard Avedon. But this wasn’t just any gig—it was a campaign for the fashion house of Versace. For once in her life, this was one gig Gia couldn’t afford to mess up.\n\n36. She Played Hooky\n\nAfter a hard night of partying, Sandy Linter remembers Gia in the morning light, sitting in the kitchen with the phone pressed to her ear. When Gia asked her whether she should go into work or not, Linter immediately responded with “Not if you feel the way I do!” In retrospect this was a huge mistake. When she found out what it cost Gia to skip out on work, she wished she could take it all back.\n\n37. She Missed Out\n\nAs a supermodel, missing one day of work means sacrificing a lot. When Gia took Lister’s advice and played hooky, she missed out on a $5000 payoff and so much more. When she didn’t show, the model Rosie Vela took her coveted position. She had effectively blown her very last chance in the modelling industry—and it was a very high price to pay.\n\n38. She Hit Rock Bottom\n\nAfter this debacle, Gia was effectively blacklisted: She was no longer able to book work with any major agency, and went at whiplash speed from a hot commodity to a pariah. Her job prospects dwindled down to nothing, and it was about to get very, very desperate. In her darkest hour, she had no choice but to scrape the very bottom of the barrel.\n\n39. She Couldn’t Keep A Job\n\nGia began her illustrious career posing for ads in her hometown paper, and things came full circle when she found herself doing catalog work for an obscure German mail-order company. But even that job was too much for her to manage. Gia used on set and, unwilling to tolerate this behavior, the company fired Gia and sent her home. But while this seemed like the end, the nightmare was only just beginning.\n\n40. She Was Destitute\n\nGia’s glamorous life in New York had come to an end, and having spent all her money, she was essentially homeless. She began dividing her time between her hometown of Philadelphia and Atlantic City, New Jersey while couch surfing among a handful of lovers, friends, and family members. After one last stab at rehab, she swallowed her pride and tried to find employment.\n\n41. She Took A Job In The Real World\n\nGia tried her hand at a number of jobs. First she tried retail, and when that didn’t work, she became a checkout clerk. She even tried working at a nursing home cafeteria. But none of these occupations ever stuck. By 1985, Gia started using again, but this time she had no safety net—no second chances. With nowhere to go, her life took a dark and dangerous turn.\n\n42. She Became A Night Worker\n\nIn lieu of unemployment, Gia resorted to selling more than just her image, but also her body. Compounded with her spiralling addiction, this was a recipe for disaster. In December 1985, she was admitted to a hospital in Pennsylvania. She was extremely ill and doctors diagnosed her with bilateral pneumonia. But little did Gia know, she wasn’t out of the woods yet.\n\n43. She Had A Devastating Diagnosis\n\nA few days later, doctors revealed another, more terrifying diagnosis: Gia had AIDS-related complex. Gia was diagnosed with AIDS at a time when doctors knew very little about the disease, and there was precious little that could be done to save her. In the fall of the next year, Gia was in hospital once again—and this time, she was in much worse condition.\n\n44. She Was One Of The First\n\nIn 1986, Gia faced a horrific ordeal—she was beaten and raped and left out on the street. On October 18, her health took a severe nosedive, and she found herself hospitalized for the final time. With so little known about her disease, doctors treated her as though she was highly infectious. They rigorously wiped down every surface she touched, and anyone attending her wore full protective gear.\n\n45. She Had Regrets\n\nAlthough the end was near, Gia didn’t find much solace in her brief life or career path. Shortly before her passing, Gia had a casual conversation with one of her nurses. Oblivious to Gia’s past, the nurse told her about a photographer who wanted to take pictures of her daughter. Gia’s response was absolutely tragic: “Don’t do it. Even if she wants it, don’t let her do it. I used to be a model. You don’t want your kid to be a model.”\n\n46. She Had A Tragic End\n\nOn November 18, 1986, Gia Carangi passed away from AIDS-related complications. She was only 26 years old. In fact, she was one of the first famous women to ever succumb to the disease. Her family held a small service in her hometown of Philadelphia. Having been such an icon in the modelling world, one might expect Gia’s funeral to be attended by a great number of old coworkers and friends…But this just wasn’t the case…\n\n47. They Forgot Her\n\nWhen her long-time supporter and collaborator, Francesco Scavullo, heard the tragic news, he sent his sympathies and a Catholic Prayer card to her family. However, not one single person or any of her so-called friends from the fashion world attended the service. The world had already moved on from Gia Carangi, and her replacement was rearing to go.\n\n48. They Replaced Her\n\nAfter Gia stepped onto the modelling scene, her signature tomboy look became highly sought after. After she disappeared from the scene, agents worked quickly to find a new model to carry the torch and fill the void left in Gia’s wake. Fashion experts soon shopped around a new young model and even dubbed her “Baby Gia.” Who was this young model? None other than Cindy Crawford.\n\n49. She Has A Biopic\n\nIn 1998, Angelina Jolie starred in the HBO made-for-TV biopic, Gia. Jolie had really interesting, albeit bizarre things to say about portraying Gia. Among the least weird was, “I’d like to date Gia. I’d want to be her lover.” Which is one thing, until you remember Jolie was playing her. But no matter her comments, it’s safe to say that this film keeps people coming back to Gia’s story time and time again.\n\n50. She Lives On\n\nOne fitting and sombre tribute to Gia is her square on the AIDS Memorial quilt. The NAMES Project created the folk-art quilt that weighs over 50 tons, and in 1989 they were nominated for the Nobel Peace Prize. Gia’s square reads, “You know what I think? I think there’s a reason for everything. God has a big plan for me. Just not in this life.”\n\nSources: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12,"}, {"url": "https://www.hollywoodreporter.com/news/general-news/makeup-artist-sandy-linter-recalls-gia-carangi-romance-we-did-love-1297324/#!", "page_content": "Gia Carangi, often referred to as one of the world’s first supermodels, is perhaps best known simply as Gia. She burst onto the scene in the late 1970s, traveled the world, posed for famous photographers, landed on the covers of Vogue and Cosmopolitan, and fronted campaigns for Dior, Versace and Yves Saint Laurent. While her life had all the elements one would expect of a fashion darling in New York, how it ended serves as the most cautionary of tales. Carangi died of AIDS in 1986 at the age of 26 after battling a heroin addiction that derailed her once white-hot career. Her story — told in HBO’s Gia starring Angelina Jolie — continues to inspire headlines and an Instagram account with 11,500 followers. In honor of Pride month and in a year that would’ve marked Carangi’s 60th birthday, legendary makeup artist Sandy Linter opens up to The Hollywood Reporter about their surprise romance, a St. Barts getaway and the final time she saw her.\n\nI got booked for a photo shoot for Harper’s Bazaar Italia in 1978 with one of the coolest photographers ever — Chris von Wangenheim — at the Citicorp Building, a new building at the time, which worked very well for Chris, who was into modern design. A few models walked in and there was Gia Carangi.\n\nShe sat down in the chair and immediately put her feet up on the makeup table. She picked up my punk sunglasses, put them on and lit up a cigarette. I could see all this out of the corner of my eye and I remember thinking, Oh, she’s trouble. She’s going to be trouble. That was the first time I saw her.\n\nWhen it came time to do Gia’s makeup, I walked over to look at her face. She already had foundation on but it was applied very badly. I said, “What’s this? I’ll have to take this off.” She told me her agency said to come makeup ready because there would be a few girls on the shoot. It was a nice gesture but looked horrible. I’ve actually heard over the years that she could do her own makeup and the truth is, no. Gia introduced herself and I couldn’t pronounce her name at first. She laughed. I respected her charm and her edge.\n\nI stood behind Chris as I watched them both work. At one point, he gives Gia a nod and she drops the side of her dress from one shoulder to expose one of her breasts. He took the shot and it’s fabulous. You could just see that she’s a star. She had power. This was 1978 and that was not a move fashion models were doing back then. Nudity was allowed in European magazines but not in America, really. Still, Gia and Chris obviously had worked something out and she was going for it. She had a saying that she was always ready to go for the “gusto.”\n\nI was booked to do a shoot for American Vogue with Chris and with Gia and another model named Lisa Vale. Chris was married to a drop-dead gorgeous model named Regine Jaffry. When I approached the building of CVW’s studio, Regine was outside. She asked me a weird question: “How much do you weigh?” I told her 99 lbs. and went inside, not thinking much of it. I did Gia and Lisa Vales’ makeup. It was a nice shoot. Chris photographed them against a wire fence, similar to one you would see in a playground.\n\nAfter the shoot, I was packing up my makeup, ready to leave and Chris came back into the room. He said, “I’m doing a personal photo, will you do it?” I agreed and he came back and said, “With Gia?” I said OK again, he left the room only to come right back with another question: “Nude?” I was freaking out a bit. What did I get myself into? I had just come back from a summer at Fire Island Pines, where we were all mostly nude or topless. It was 1978!\n\nI just told him I would keep my boots on because I was so short and that would make me feel better. When I walked on set, the stylist yelled, “She has her boots on!” Chris didn’t care. I figured I would just be a prop — someone in the shadows, never really seen and only there so Gia would have someone to respond to. When Gia walked out on set, she climbed the fence and was doing some very punk rock moves. I had a vision in my mind of the very glamour photos that Helmut Newton would do featuring two women. That’s what I started doing and Gia followed my lead.\n\nI have a feeling that Regine was supposed to do the shoot but backed out last minute, so they asked me. These are just my thoughts after so many years. These photos that can never be duplicated, not in movies or photos, and I am proud to be a part of history as, unfortunately, I am the only one now living. Chris died in a car crash in 1981. Before his death, he gave me two autographed prints that I treasure.\n\nThe day after the shoot, late in the afternoon, my phone rang and it was Gia. She had a very different tone of voice. She sounded like she was coming on to me. I can’t imitate it now but it was sexy. She said she was driving around in this hot red car and asked if I wanted to go for a ride. I mean what do you say? Who drives a car in Manhattan? She picked me up and we drove around, stopping in front of Fiorucci. She ran inside and got one ear pierced and I was just along for the ride.\n\nOne thing I quickly discovered about Gia is that she did not want to be alone. There’s a lot of people out there who think they know her better than I did and so they say she was a loner. They are wrong. During the day, she worked with the best people in the business, but let’s face it, at the end of the day, everybody went their separate ways. At night she did not want to be alone and she was just 19 years old alone in New York. She had her own apartment but she ended up staying with me a lot because she liked me and because she wanted the closeness of having a girlfriend. She would bring me flowers and she phoned me often. It was never a torrid sexual affair but we did love each other. This never happened again with a woman in my lifetime. So it’s a difficult relationship to label. We spent a lot of time together, going to clubs, restaurants, just out all the time. We had chemistry. I got her. I didn’t pry. I got her moods, and she felt safe with me.\n\nI was just as shocked as anybody that she became an addict. She thought she was stronger than the drugs. One morning, as she was getting dressed to leave my apartment she asked, “What happened to my natural energy?” She didn’t have the energy to get dressed at 20 years old. The drugs took everything. She thought she could go home to her mother’s house on weekends to clean up and then come back to the city but that never worked.\n\nI want all the guys and girls out there, her fans, to know that Gia finally knew that drugs are not the answer. But it was too late. I’m not saying that I avoided drugs completely, but there was something unappealing about shooting up. It was the ’80’s and people were always offering me something to snort and it was like, “OK, fine.” They were party drugs back then. We partied, we snorted, we went to the Mudd Club and Hurrah. I always thought I was given cocaine and a couple of times it wasn’t — it was heroin. That was a different high and I liked it but it wasn’t worth the headache I had the next morning.\n\nOne morning after going out to a club, I heard Gia on the phone in the kitchen. I was surprised that she was up because she didn’t like to get up in the morning. She asked me if she should go to work that day. I said, “Not if you feel the way I do!” It wasn’t until years later that I learned she had stood up a TV crew with Richard Avedon as director. What a stupid thing to tell her. Gia was a supermodel and it was not a rational thing to say to her because she had a job to do. The job paid $5,000 and beautiful model Rosie Vela took her place. That’s what happens when you do drugs, bad things. They happened so often for Gia; soon she had fewer and fewer bookings.\n\nWe had good times, too. We went to St. Barts together, which was not yet the place to be, like it is today. I mean, she was adorable. She took a teddy bear on the flight, flirting with the female flight attendants. When we landed, I wasn’t feeling well. I was “on the rag” with severe cramps. She immediately sprung into action, renting a Jeep and driving us over the hilly terrain of the small island. We stopped once to ask for directions from a guy in his backyard. He was visibly moved when he saw Gia, who was wearing men’s shorts and an undershirt. She had that effect on everyone. I’m sure he never forgot her.\n\nIt must’ve been like that all her life. No makeup, just a natural beauty. It didn’t matter what she wore. The fact that she loved women was just a part of that. Thinking about where she would be in her life today with the LGBTQ community, her pride would have evolved. Gia was always proud. She never apologized to anyone for who she loved or who she had sex with. I think back to how she died of AIDS and how, at that time, there was such a stigma to it. I didn’t know her when she was sick or dying. I didn’t even know she was sick.\n\nSometime around 1983 or ’84, my doorbell rang. It was Gia, just standing there and smiling. She had on a yellow cashmere sweater — her favorite. She sat down on my couch with me, put her head on my shoulder and cried. My shirt was dripping wet with tears. I kept telling her how well she looked and wondered why she was crying. It was the end of our “romance.” I knew it and she knew it. Because she looked so good, I had been tricked into thinking that she was on the road to recovery. I never knew she had AIDS until later. After maybe 30 minutes, she looked out the window, nodded to someone in the street and left. I would never see her again.\n\nTowards the end, I connected with her on the phone a few times because we had drifted apart. Once I read an article in the New York Times and I tried to tell her to be careful because it said that IV drug users, including women, were getting sick. She was very quiet. “You’ve got to stop this. This is real. This is a plague,” I told her. She only wanted to talk about lively things, but I was taking a tough-love stance. I had to let her know that I had terms and I was worried that AIDS was going to kill her. Maybe a part of her felt it was already too late. I don’t know. There is so much I will never know.\n\nThe most important thing now is that she left a legacy. Millions of people are captivated by her and I understand that. She was a one-of-kind. Just a proud kid I will always remember for sitting down at my makeup table, putting her feet up and grabbing my sunglasses. She was that kind of girl — so secure and confident."}, {"url": "https://www.independent.co.uk/news/world/americas/gia-the-tragic-tale-of-the-world-s-first-supermodel-311535.html", "page_content": "Sign up to our Evening Headlines email for your daily guide to the latest news Sign up to our free US Evening Headlines email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nAnd these represent only a fraction of the hundreds of thousands of young women who hope to add their name to those of Kate Moss, Jodie Kidd, Heidi Klum, Tyra Banks, Karen Mulder, Linda Evangelista, Claudia Schiffer, Helena Christensen, Noami Campbell, Cindy Crawford, Christy Turlington, Elle Macpherson, Eva Herzigova, Jerry Hall, Gia Carangi, Ingrid Boulting, Marie Helvin, Lauren Hutton, Verushka, Twiggy and Jean Shrimpton in the litany of modern modelling fame. But, hang on. Did you catch the name in the middle there: Gia Carangi?\n\nYounger readers, unless they have seen the eponymous 1998 film Gia in which Angelina Jolie played Carangi, may need some introduction to the woman who was once called \"the world's first supermodel\" and \"the hottest cover girl\" of the late Seventies and early Eighties. For the life of Gia tells a story of modelling which is not one of fame, fortune and a glamorous land where the sun always shines and the party never stops, where dreams perforce come true and everyone is officially beautiful.\n\nGia, in the days before the term supermodel had been coined, appeared on the cover of Cosmo and Vogue in America, Britain, France and Italy. Her first major modelling job was with Versace when she was 18. She was the favourite model of many top fashion photographers, including Arthur Elgort, Helmut Newton and Francesco Scavullo, who was for 30 years Cosmo's cover photographer. Scavullo's subjects included Grace Kelly, Elizabeth Taylor, Andy Warhol, Janis Joplin, Gore Vidal, Mikhail Baryshnikov, Diana Ross, Kim Basinger, Calvin Klein, Mick Jagger, David Bowie, Debbie Harry, Madonna and Brad Pitt. But Gia was his favourite subject.\n\nYet hers is a cautionary tale. At the age of 17, Gia Carangi was a pretty high-school student - height 5ft 8in, stats 34-24-35, dress size 8-10 - working behind the counter at her father's little restaurant in Philadelphia, Hoagie City, and doing her best never to miss a David Bowie concert. It was 1978.\n\nThen a local photographer asked her to pose on the dance floor and the pictures were seen by Elgort, who photographed for the New York department store Bloomingdale's. Her dark melancholic Italian beauty stood in contrast to the typical blonde hair-blue eyed model then the normative. Her career soared like a star shooting in the night sky. Within a year she was the hottest new thing in New York, partying at Studio 54, and the darling of rockers and royalty, moguls and movie stars, alike.\n\nIt was not just her beauty. She was a new kind of wild child. She posed nude. She dressed in men's clothes. She wore no make-up. She had attitude and \"took no shit\" from the dignitaries of the fashion industry. She was a lesbian, or some said, bisexual. She would walk out of photo shoots if she wasn't in the mood. She was, even at the age of 18, a diva who would cancel two whole weeks' worth of bookings because she didn't like the way her hair was cut.\n\nShe would say things like: \"I'm not impressed by somebody who's got a Lear jet and who's going to take me to Florida every weekend. I just want a body, like a nice hot body and some big lips. Forget everything else.\"\n\nAnd she did not take too much trouble to hide her use of recreational drugs. \"I am finally really starting to dig being different. Maybe I am discovering who I am. Or maybe I'm just stoned again, hahahaha!\"\n\nYet there was behind the wanton lifestyle a deep unhappiness. At the age of five she was sexually abused by a man. The abuse occurred only once, but she was traumatised by the incident. So was she when her mother left her husband, home and children for another man. Though, later in life, her mother returned to her, Gia never got over her sense of abandonment. \"Gia did a lot of things just to get her mother's attention,\" one friend later said. \"The one person Gia always wanted something from was her mother - and she just never felt like she got it.\"\n\nHer public wildness was underpinned by a private loneliness. For even at the height of her fame much of the time, Gia was alone. She had friends in the profession, often make-up artists. But her schedule didn't allow her the time for other activities. At the end of a day's shooting she often went back to her empty New York apartment. \"The biggest mistake we made was that nobody went up there with her,\" her brother, Michael, told her biographer, Stephen Fried, later. \"She could've used a friend.\" Instead she turned to the drugs that others in the fashion world used only at parties.\n\n\"Gia and I were like lion cubs having fun,\" one contemporary said. \"We got a reputation because we didn't hide anything. We did a lot of drugs and went to a lot of parties. So many! We were both constantly on trips, which I think saved my life, because you don't do drugs when you travel. Except when I travelled with Gia. We brought a whole medicine kit.\"\n\nGia's appointment book from 1980 contains a misspelt reminder to \"Get Heroine\". In 1981 she was arrested - for driving under the influence of a narcotic. In May that year, at just 21, Gia required surgery on her hand because, according to Stephen Fried, \"she had injected herself in the same place so many times that there was an open infected tunnel leading into her vein\".\n\nThings were starting, just two years in, to fall apart. Her moods were swinging wildly. She walked out on shoots or fell asleep during jobs. Her drug use was preventing her from working at anything close to her full capacity as a model.\n\nIn those days using heroin was rather glamorous. And Gia was in demand as the look of the moment. Fashion editors knew about all the drugs but did not care. At one major magazine shoot an editor supplied Gia with a bag of cocaine and some heroin on the set. \"The problem was that people were more interested in hiding the marks than helping her,\" said Gia's former lover, Elyssa Stewart, who says the problem persists in the industry but that models now shoot heroin under their toenails or tongue, where track marks cannot be detected.\n\nWhat changed was that Gia started going directly from $10,000-a-day fashion shoots to the heroin shooting galleries on New York's Lower East Side.\n\nOne top photographer called her \"a trashy little street kid\". She made several comebacks, but each time relapsed. And then word leaked out that she might be HIV positive. It was that which led to her finally being blackballed by those who only months before could not get enough.\n\nBy the end of 1984 Gia had entered a vastly different world. After pressure from her family she entered a rehab programme - and declared herself penniless to enter treatment on public welfare. But when she left treatment six months later she went back on the heroin, and in increasing amounts. A year later she was in hospital. She had been sleeping outside in the rain. Bruises on her body suggested she had been badly beaten up. And she had been raped. Her symptoms were those of pneumonia, but blood tests showed she had Aids related complex (ARC), a precursor to Aids. It was the early days of the virus and nurses and orderlies donned rubber gloves or \"space suits\" before entering her room, and wiped the phone every time she used it.\n\nOne nurse, not knowing who she was, chatted about how a local photographer wanted to take some photos of her daughter. Stephen Fried's biography, Thing of Beauty: The Tragedy of Supermodel Gia, records the patient's response: \"Don't do it. Even if she wants it, don't let her do it. I used to be a model. You don't want your kid to be a model.\"\n\nOn 18 November 1986 Gia Carangi died, of Aids. She was 26. Looking back, what did it all add up to? For a moment Gia - with her pale skin, limpid brown eyes and dark brown mane of coarse cuts and waves - redefined the fashion industry's standard of beauty. She had, said her agent, Wilhelmina Cooper, \"a fantastically pliable face\"; she could be really sophisticated in one shooting and be a real Lolita type in another\".\n\nScavullo, the photographer, who died last year, wrote of her: \"Gia is my darling - old, young, decadent, innocent, volatile, vulnerable, and more tough-spirited than she looks.\n\n\"She is all nuance and suggestion, like a series of images by Bertolucci ... I never think of her as a model, though she's one of the best. She doesn't give you the Hot Look, the Cool Look, the Cute Look; she strikes sparks, not poses. Out of doors, especially, I have never known anyone so excitingly free and spontaneous, constantly changing, moving (which drove me crazy until I got smart and learnt to focus the camera faster) - she's like photographing a stream of consciousness.\"\n\nThis was not artless. \"A model has to create moods,\" Gia said at the height of her fame.\n\n\"You have to be careful not to get stuck in a mood - emotions have trends just like fashion ... I become what ever your eye wants to see. It's my job.\"\n\nAs a result \"a disproportionate number of the beauty and fashion shots she appears in\", says Stephen Fried, \"transcend the accepted level of artful commerce and approach the realm of actual photographic art\".\n\nHer life only added to the allure with which her photographs are often now viewed. As the Angelina Jolie film showed, it is possible to project on to Gia's story so many of the dreams of contemporary culture. It is a rags-to-riches tale. It is a lesbian love story. It a harrowing look at the effects of long-term drug abuse. It is the story of a poor-little-rich-girl. It is a chilling commentary on the heartlessness and fear of the first days of the Aids epidemic. It is story of a girl who spent her whole life trying to find something to fill the hole left by her mother's departure.\n\n\"I think God has a plan for me,\" Gia said, with all the unconscious pomposity that modern celebrity can muster. It was, it turned out, that she was to become the first famous woman to be diagnosed with, and die of, Aids. \"Modelling,\" she said on another occasion, \"is a short gig.\""}, {"url": "https://rgnn.org/2020/11/24/the-story-of-gia-carangi-the-worlds-first-supermodel/", "page_content": "Gia Marie Carangi, better known as “Gia Carangi”, is the name of world’s first supermodel. Born on the January 29, 1960 in Pennsylvania, she tragically died at the young age of 26 due to the ongoing HIV/AIDS crisis in the United States.\n\nGia Carangi Vogue Paris cover | @Sondra Hughes from Pinterest\n\nThis God-gifted fashion icon has appeared on the cover of Vogue Paris in April 1979; Vogue America in August 1980; Vogue Italia in January 1981; and many issues of Cosmopolitan between 1979-1982. Moreover, she also appeared in advertising campaigns for such fashion houses as Armani, Versace, Christian Dior, and Yves Saint Laurent.\n\nGia Carangi gloriously presented herself in the modeling industry during the 1970’s. She was undoubtedly a successful model, even when compared to other famous models like Janice Dickinson and bachelorarbeit schreiben lassen Jean Shrimpton. Gia Marie Carangi was the queen of the American modeling industry from 1970 to 1980. She had a great career until she unfortunately developed an addiction to illicit drugs.\n\nCarangi was greatly influenced by the music and fashion icon, David Bowie. She and many of her friends emulated his epicene style. It was a style that would continue to define Carangi’s personal look for the rest of ghostwriting agentur her life. She was also drawn to him as a symbol of rebellion and countercultural values.\n\nHer addiction to drugs and alcohol eventually led to the downfall of her career. Gia Carangi later became infected with HIV/AIDS and this bold icon of the fashion world passed away due to ghostwriter hausarbeit complications related to her condition on November 18, 1986.\n\nHer mother took care of her during her last days, and her death wasn’t given much publicity. Even her funeral wasn’t really recognized. Most of her friends and colleagues were not even in attendance.\n\nShe was remembered by many and even today it’s hard for people to forget her face. In her memory, a biographical movie was made on her life called Gia, where Angelina Jolie played her role. The movie was a hit and gohstwriter tried to increase awareness about drug abuse and HIV/AIDS by featuring someone as well-known as Angelina Jolie."}, {"url": "https://timenote.info/en/Gia-Carangi", "page_content": "Gia Marie Carangi (January 29, 1960 – November 18, 1986) was an American fashion model during the late 1970s and early 1980s. Carangi is considered by some to be the first supermodel, although that title has been applied to others, including Janice Dickinson, Dorian Leigh, and Jean Shrimpton. Model Cindy Crawford was later referred to as \"Baby Gia\" due to her resemblance to Carangi.\n\nCarangi was featured on the cover of fashion magazines, including the April 1979 edition of British Vogue, the April 1979 and August 1980 editions of Vogue Paris, the August 1980 edition of American Vogue, the January 1981 edition of Vogue Italia, and several issues of Cosmopolitan between 1979 and 1982.\n\nAfter she became addicted to heroin, Carangi's modeling career rapidly declined. She later contracted HIV, which suddenly claimed her life at the age of 26. Her death was not widely publicized and few people in the fashion industry knew of it. Carangi is thought to be one of the first famous women to die of AIDS. Gia, a biographical film starring Angelina Jolie, debuted on HBO in 1998.\n\nEarly life\n\nCarangi was born in Philadelphia, Pennsylvania. She was the third and youngest child of Joseph, a restaurant owner, and Kathleen (née Adams) Carangi, a homemaker. She had two older brothers. Her father is Italian, and her mother is of Irish and Welsh ancestry. Joseph and Kathleen had an unstable, violent marriage leading Kathleen to ultimately abandoning the family when Carangi was eleven years old. Those who knew her blamed her \"fractured childhood\" for the instability and drug-dependence that plagued her adult life. She was described as \"needy and manipulative\" by relatives who recalled her as spoiled and shy as a child and a \"mommy’s girl\" who did not receive the motherly attention that she desired.\n\nIn her adolescent years, Carangi found the attention she sought from other teenage girls, befriending them by sending flowers. While attending Abraham Lincoln High School, Carangi bonded with \"the Bowie kids\", a group of obsessive David Bowie fans who emulated Bowie's \"defiantly weird, high-glam\" style. Carangi was drawn to Bowie for his fashion preferences and his ambiguous gender play and outspoken bisexuality. A friend of Carangi described her \"tomboy persona,\" describing her relaxed openness about her sexuality as reminiscent of the character Cay in the 1985 film Desert Hearts. Carangi and her \"bi-try Bowie-mad\" friends hung out in Philadelphia’s gay clubs and bars. Though she associated with the lesbian community, she did not want to take up \"the accepted lesbian style\".\n\nCareer\n\nSuccess\n\nCarangi was most known in modeling circles by only her first name. After being featured in Philadelphia newspaper ads, Carangi moved to New York City at the age of 17, where she quickly rose to prominence. She was a favorite model of various fashion photographers, including Francesco Scavullo, Arthur Elgort, Joseph Petrellis, Richard Avedon, Denis Piel, Marco Glaviano, and Chris von Wangenheim.\n\nWell-integrated within the fashion world, Carangi had the selection of several photographers, most notably Scavullo. By the end of 1978, Carangi was already a well-established model. In a 20/20 interview, she said her rise was \"very fast\" and \"I started working with well-known people in the industry, very quickly. I didn't build into a model. I just sort of became one.\"\n\nCarangi was a regular at Studio 54 and the Mudd Club. She usually used cocaine in clubs, but later developed a heroin addiction.\n\nIn October 1978, Carangi did her first major shoot with top fashion photographer Chris von Wangenheim. Wangenheim had her pose nude behind a chain-link fence with makeup assistant Sandy Linter. Carangi immediately became infatuated with Linter and started to pursue her, though the relationship never became stable.\n\nDrug abuse and career decline\n\nOn March 1, 1980, Carangi's agent and mentor, Wilhelmina Cooper, died of lung cancer. Devastated, Carangi started abusing drugs. Scavullo recalled a fashion shoot in the Caribbean when \"She was crying, she couldn't find her drugs. I literally had to lay her down on her bed until she fell asleep.\" Her addiction soon began to affect her work. Carangi began having violent temper tantrums, walking out of photo shoots to buy drugs, and began falling asleep in front of the camera. During one of her final location shoots for Vogue, Carangi had visible red bumps in the crooks of her elbows where she had injected heroin. The photos were airbrushed and eventually ran in the November 1980 issue of Vogue, but some photos reportedly still showed visible needle marks.\n\nBy November 1980, Carangi's career was in a steep decline. Modeling offers soon ceased and her fashion industry friends, including Sandy Linter, refused to speak to her fearing their association with her would harm their careers. She briefly signed with Ford Models \"for a couple of weeks\", but was soon dropped. In an attempt to quit drugs, she moved back to Philadelphia with her mother and step-father in February 1981.\n\nRetirement and attempted comeback\n\nAfter moving to Philadelphia, Carnagi went through a 21-day detox program. Her sobriety however was short-lived and she was arrested in March 1981 after she drove into a fence in a suburban neighborhood and took off. After a chase with police, she was taken into custody where it was later determined she was under the influence of alcohol and cocaine. After her release, Carangi briefly signed with a new agency, Legends. She worked sporadically, mainly in Europe.\n\nIn fall 1981, Carangi was in the throes of drug abuse. Despite this, she was still determined to make a comeback in the fashion industry and signed with Elite Model Management. While some clients were refused to work with her, other clients were willing to take a chance because of her past status as a top model. One of her first jobs was for Francesco Scavullo who photographed her for Cosmopolitan. Scavullo convinced the magazine's editors to use the shot for its April 1982 cover. Sean Byrnes, Scavullo's long-time assistant later said, \"What she was doing to herself finally became apparent in her pictures. [...] I could see the change in her beauty. There was an emptiness in her eyes.\" The Cosmo cover would be her last.\n\nDuring this time, Carangi mainly worked with photographer Albert Watson and got jobs modeling for department stores and catalogs. In April 1982, Richard Avedon hired her for the 1982 Versace campaign which lead to her being hired for the Spring 1983 campaign. She then modeled for German mail-order clothing company Otto Versand. Around this time, Carangi enrolled in an outpatient methadone program but soon began using heroin again. During a photo shoot for the Spring 1983 Versace campaign shot in the fall of 1982, Carangi became uncomfortable and left the shoot before any usable shots of her were taken. By the end of 1982, she had only a few clients that were willing to hire her. Carangi's final photo shoot was for Otto Versand in Tunisia. She was sent home during the shoot for using heroin. She left New York for the final time in Spring 1983.\n\nLater years\n\nCarangi spent her remaining years living with various lovers, friends and family members in Philadelphia and Atlantic City. She was admitted to an intense drug treatment program at Eageville Hospital in December 1984. After treatment, she got a job in a clothing store which she eventually quit. She later got a job as a checkout clerk and then worked in the cafeteria of a nursing home. By the winter of 1985, Carangi began using drugs again. In June 1986, she was admitted to Warminster General Hospital in Warminster, Pennsylvania with bilateral pneumonia. A few days later, she was diagnosed with AIDS-related complex.\n\nDeath\n\nOn October 18, 1986, Carangi was admitted to Hahnemann University Hospital. She died of AIDS-related complications on November 18, 1986. Her funeral was held on November 23 at a small funeral home in Philadelphia. No one from the fashion world attended, mainly because no one knew about her death until months after she had died. However, weeks later, Francesco Scavullo, Carangi's friend and confidant, sent a Mass card when he heard the news.\n\nLegacy\n\nA biography of Carangi by Stephen Fried called Thing of Beauty (the title of John Keats' famous poem) was published in 1993. A biographical film, Gia, debuted on HBO in 1998. Angelina Jolie starred in the title role, garnering a Golden Globe award for the role.\n\nIn 1996, actress-screenwriter Zoë Tamerlis, herself a heroin addict who died of drug-related causes in 1999, was commissioned to write a screenplay based upon Carangi's life. This version of Gia was not produced, but after Tamerlis' death, footage of Carangi, Tamerlis, photographers, Carangi's family, and Sandy Linter discussing her life was incorporated into a 2003 documentary entitled The Self-Destruction of Gia.\n\nCarangi's sexual orientation has been disputed after her death; LGBT outlets label her lesbian, and other times as bisexual due to her sexual relationships with men. In the film Gia, Jolie also portrayed her as being sexually intimate with men and women. Since Carangi's death, she has been considered a lesbian supermodel and icon.\n\nDesigners and cosmetic firms represented"}, {"url": "https://www.ranker.com/list/life-of-gia-carangi/katia-kleyman", "page_content": "Gia Carangi was considered \"the world’s first supermodel,” preceding the crop of supermodels who would shift the modeling industry in the 1990s. Gia Carangi images adorned the covers of the world’s top magazines during her short-lived career in the late ‘70s and early ‘80s. In fact, at the start of her career she was featured on the cover of Cosmopolitan twice in the span of five months, and made the covers of the French, British and American Vogue. Her androgynous, borderline tomboy look and olive complexion favorably contrasted against the blonde-haired blue-eyed models that had been popular up until that time, and she was once described as a “beautiful punk, a butch pin-up girl.”\n\nGia was in high demand, and if it weren’t for her drug addiction and other self-destructive habits, her career would have cemented her legacy alongside famous supermodels like Naomi Campbell, Linda Evangelista, and Cindy Crawford. But what Gia is perhaps best known for is her rapid self-destruction, which ultimately led to her untimely death.\n\nHow did Gia Marie Carangi die? She contracted a virus that was ravaging the world at the time, and one which the medical community knew little about — HIV, which soon had fully blown into AIDS. Stricken with the disease, ravaged by drug abuse, penniless, abandoned by all her friends, Gia passed away quietly in a hospital bed in 1986 with only her mother at her side. She was 26.\n\nIn 1998, HBO produced a film about the brief, beautiful, and reckless life of Gia Carangi, starring Angelina Jolie. But for most who haven't seen the film, Gia is little-known: a dark, quiet, but important figure from the history of modeling industry and the rise of the supermodel."}, {"url": "https://www.geni.com/people/Gia-Carangi/6000000182703070844", "page_content": "About Gia Carangi\n\nhttps://en.wikipedia.org/wiki/Gia_Carangi\n\nGia Marie Carangi (January 29, 1960 – November 18, 1986) was an American model, considered by many to be the first woman to be titled as supermodel. She was featured on the cover of fashion magazines, including multiple editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.\n\nAfter she became addicted to heroin, Carangi's modeling career rapidly declined. At age 26 she died of AIDS-related complications, believed to have contracted the disease from a contaminated needle, becoming one of the first famous women to die of the disease. Her life was dramatized in the television film Gia, starring Angelina Jolie, which debuted on HBO in 1998."}, {"url": "https://www.fashionmodeldirectory.com/models/gia+marie_carangi/", "page_content": "- Gia was a girl in pain, desperate for her mother's approval and a drug addict on a tragic slide toward oblivion, who started going directly from $10,000-a-day fashion shoots to the heroin shooting galleries on New York's Lower East Side. In 1982 she attempted a comeback after her battle with heroin addiction.\n\n- She was in Blondie's 'Atomic' music video.\n\n- At twenty-six on November 18 1986, she became one of the first women in America to die of AIDS.\n\n- There is a biography \"Thing of Beauty\" written by Stephen Fried and a biographical film named 'Gia' (1998), with Angelina Jolie playing Gia."}], "Gia Marie Carangi was active during the late 1970s and early 1980s.": [{"url": "https://simple.wikipedia.org/wiki/Gia_Carangi", "page_content": "Gia Carangi (January 29, 1960 – November 18, 1986) was an American fashion model during the late 1970s and early 1980s. Many people believe she was the first supermodel.[1][2]\n\nModeling career [ change | change source ]\n\nCarangi was on the cover of fashion magazines, including many editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.[3]\n\nIllness and death [ change | change source ]\n\nCarangi, a heroin addict, died of AIDS-related complications at the age of 26. She was one of the first famous women to die of the disease.[1]\n\n\n\n"}, {"url": "https://people.com/movies/angelina-jolie-gia-25th-anniversary-about-death-of-model-who-inspired-movie-gia-carangi/", "page_content": "It's been 25 years since Angelina Jolie starred as Gia Carangi in Gia.\n\nThe 1998 HBO television film featured a then-22-year-old Jolie as the real-life Carangi, who was considered by many the world's first supermodel. She died in 1986 at age 26 of AIDS-related complications, at just 26 years old.\n\nMila Kunis also appeared in Gia as a younger version of Carangi, in one of her first-ever film roles, while additional cast members included Faye Dunaway, Mercedes Ruehl, Elizabeth Mitchell and Scott Cohen.\n\nDirected by Michael Cristofer (Mr. Robot) and co-written by Cristofer, 78, and Jay McInerney, Gia is about \"the life of Gia Carangi, a top fashion model from the late 1970s, from her meteoric rise to the forefront of the modeling industry, to her untimely death,\" according to a synopsis from IMDb.\n\nRead on to learn more about Carangi, from her early life to her tragic death.\n\nNever miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human-interest stories.\n\nGia Carangi. Andrea Blanch/Getty\n\nCarangi was born Gia Marie Carangi in Philadelphia on Jan. 29, 1960, into a working-class family that included two older brothers. Her father Joseph Carangi, who was Italian, owned a restaurant, while her mother, Kathleen Carangi (née Adams), was a homemaker.\n\nIn the late 1970s, Carangi was discovered on the dance floor by a local photographer. Her first modeling gig for a major advertisement was with Versace, and she had become a well-known figure at Wilhelmina Models in New York City by 1980, according to The New York Times.\n\nBut throughout her catapult to fame, Carangi — who was one of the first openly gay models, Dazed reported — struggled with addiction and substance abuse, including of cocaine and heroin.\n\nBack in 2020, makeup artist Sandy Linter recalled to The Hollywood Reporter that she and Carangi had a romance in the late 1970s that \"was never a torrid sexual affair but we did love each other.\"\n\n\"I was just as shocked as anybody that she became an addict,\" Linter said. \"She thought she was stronger than the drugs. One morning, as she was getting dressed to leave my apartment she asked, 'What happened to my natural energy?' She didn't have the energy to get dressed at 20 years old. The drugs took everything.\"\n\nGia Carangi. Dustin Pittman/WWD/Penske Media via Getty\n\nAccording to Dazed, Carangi attempted several times to get clean, including going to rehab, but it never stuck. She was diagnosed with AIDS in December 1985, and died of related complications the following November.\n\nLinter told THR that the last time she saw Carangi was in 1983 or 1984, when the model rang her doorbell, then \"sat down on my couch with me, put her head on my shoulder and cried.\"\n\n\"It was the end of our 'romance.' I knew it and she knew it. Because she looked so good, I had been tricked into thinking that she was on the road to recovery,\" Linter said. \"I never knew she had AIDS until later. After maybe 30 minutes, she looked out the window, nodded to someone in the street and left. I would never see her again.\"\n\nMore than 35 years after Carangi's death, Gia is still beloved by fans, holding a Rotten Tomatoes score of 93%, with an Audience Score of 82%.\n\nAhead of the movie's release, Jolie, now 47, told The New York Times in 1997 that she initially \"hated\" Carangi while doing research about her, based on a 20/20 interview the model once did — but eventually changed her tune and thought, \"I'd like to date Gia. I'd want to be her lover.''\n\nAngelina Jolie (center) in Gia (1998). Larry Watson/Citadel Ent/Kobal/Shutterstock\n\nThe actress also told Entertainment Weekly at the time of her role that she \"definitely needed to learn the lessons Gia needed to learn.\"\n\n\"Especially feeling that the physical is more important than anything else, or that you're only as smart and good as somebody thinks you are,\" she said. \"It's been really important for me to look at myself in the mirror, and realize that I can't let myself go down like she did.\"\n\nJolie — who went on to win an Oscar for her performances in the following year's Girl, Interrupted alongside Winona Ryder — also said she wanted the audience \"to identify with Gia and see her as being just a regular girl.\"\n\n\"No matter how together or perfect some people may appear, they have their share of pain and a deep-down need for love — the same as everyone else,\" the actress added."}, {"url": "https://allthatsinteresting.com/gia-carangi", "page_content": "After moving to New York in 1977, Gia Carangi became one of the most sought-after models in fashion and a fixture of Studio 54 — but her life quickly unraveled.\n\nOn the surface, Gia Carangi seemed to have it all. In the late 70s and 80s, Carangi owned the spotlight and had droves of adoring fans.\n\nIt’s said that she added the “super” in supermodel to describe how exponentially successful she had been in her career. Known for an edgy personality and a smoldering stare, the world was Carangi’s catwalk.\n\nBut the very attitude and wild side of America’s first supermodel which made Gia Carangi so desirable also made her a great danger to herself. This would be her undoing.\n\nGia Carangi’s Early Life\n\nGia Marie Carangi was born on January 29, 1960, in Philadelphia to an Italian-American father, Joseph, who owned a tiny restaurant called Hoagie City. Her mother, Kathleen Carangi, was a homemaker.\n\nCarangi’s parents separated in 1971. Those close to Carangi, including herself, have admitted that this divorce had a lasting impact on her attitude.\n\nHer two brothers, both older than her, moved out and lived with their mom while Carangi stayed with her father. She spent her summers behind his counter, attending concerts like your run-of-the-mill high schooler.\n\nIt was in the summer of 1978 that a local photographer and hairdresser, Maurice Tannenbaum, asked the dark-haired beauty to pose on the dance floor after spotting her at a local nightclub. Carangi’s dark, tomboyish looks, 34-24-35 measurements, and perfect face were an ideal match for the fashion world which at the time was overrun with willowy blondes.\n\nTannenbaum passed on Carangi’s photos to legendary New York department store Bloomingdale’s photographer, Arthur Elgort. Before Carangi knew it, she was the talk of New York.\n\n“I started working with very good people,” Gia Carangi confided in a 1983 interview. “I mean all the time, very fast. I didn’t build into a model. I just sort of became one.”\n\nA Meteoric Rise To Fame\n\nGia Carangi’s first photoshoot at the Philadelphia nightclub, back when she was just 16, was the beginning of her meteoric rise to stardom, and life only moved faster once she moved to New York.\n\nCarangi signed with Wilhelmina Cooper, a legendary fashion agent and owner of her own modeling agency. Wilhelmina became a kind of mother figure to Carangi.\n\nFrancesco Scavullo, a leading fashion photographer of the day and who would become a personal friend of Carangi’s, gushed of her:\n\n“There was something she had… no other girl has got it. I’ve never met a girl who had it. She had the perfect body for modeling: perfect eyes, mouth, hair. And, to me, the perfect attitude: ‘I don’t give a damn.'”\n\nThat attitude proved to be both what was so enticing and dangerous about Carangi.\n\nHer androgynous look was in part due to her sexuality. Described in some instances as aggressive and others as vulnerable, Carangi seemed to have a need to be loved — and mostly by women.\n\nThose who had worked with her said it wasn’t uncommon for her to fall in love with the models she shot with. On a shoot for photographer Chris von Wangenheim, which would become wildly popular, Carangi posed nude up against a fence with makeup artist and model Sandy Linter.\n\nThe two would embark on a passionate though unrequited love affair.\n\nIndeed, Gia Carangi appeared insatiable both in her love life and in her recreational drug use. As a teen, she was already hooked on marijuana, cocaine, and quaaludes.\n\nCarangi went on to model for Christian Dior, Giorgio Armani, Versace, Diane Von Furstenberg, Cutex, Lancetti, Levi’s, Maybelline, Vidal-Sassoon, and Yves Saint Laurent — to name a few. At the age of 18, Carangi was making $100,000 a year. It was more than any other model at the time, leading many fashion historians to dub her the world’s first supermodel.\n\nShe then landed on the covers of Vogue and Cosmo starting in 1979.\n\n“A model has to create moods,” Carangi said of her talent, “You have to be careful not to get stuck in a mood – emotions have trends just like fashion … I become what ever your eye wants to see. It’s my job.”\n\nBut Gia Carangi remained hard to control. Though it was her edgy attitude that drew people to her, Carangi was also tough to work with. A diva by age 18, she would walk off shoots if she wasn’t feeling it, or would cancel weeks of work if she didn’t like her haircut.\n\nCarangi would chow down on barbecue chicken while wearing a dress worth thousands of dollars. She was also transparent about her drug use, discussing it openly in interviews and partying often with other stars and socialites at Studio 54.\n\nBut there was also a deep loneliness in her, returning to her apartment alone after work, and constantly searching for love. “I am finally really starting to dig being different. Maybe I am discovering who I am. Or maybe I’m just stoned again,” she admitted.\n\nGia Carangi Backslides Into Drugs\n\nThe supermodel would go from a $10,000 photo shoot to a “shooting gallery”, or seedy locale where one can shoot up heroin, on Manhattan’s Lower East Side.\n\nIn 1980, Wilhelmina died and sent Carangi into a spiral. Already using heroin, the supermodel delved deeper into her habit. During a shoot that year for Vogue with famed portrait photographer Richard Avedon, Carangi escaped through a window. Though incensed, the magazine gave her a second chance at the shoot, but when the pictures came back they revealed track marks and red bumps all over the model’s arms.\n\nIn 1981, she was arrested for driving under the influence of a narcotic.\n\nIn May of that same year, 21-year-old Carangi needed to get hand surgery because “she had injected herself in the same place so many times that there was an open infected tunnel leading into her vein,” her biographer Stephen Fried documented.\n\nFor her final Cosmo cover photo in early 1982, fashion photographer Scavullo covered up the track marks on her arms by having her put her hands behind her back. The dress she wore was poofy enough to cover up the scars of her habit. The model also angled her face to cover up the bloating.\n\nHer brother, Michael, recalled his little sister’s behavior and laments: “The biggest mistake we made was that nobody went up there with her. She could’ve used a friend.”\n\nGia Carangi left her modeling agency, tried to stay afloat at another, but wound up returning home to Philadelphia to live with her mother at a final grasp at finding sobriety.\n\nAn Untimely Demise\n\nGia Carangi was blackballed from New York’s agencies and although magazines gave her several last chances, the model could not pull herself together. One of her final shoots appeared in Vogue in 1982 and was photographed by Andrea Blanch.\n\nBy the end of that year, Carangi had become so volatile that she couldn’t get booked for jobs. No one wanted to work with the wild child any longer.\n\nShe had a successful go at rehab for about a year following in Philadelphia. By this time she was broke and receiving rehabilitation from welfare.\n\nhttps://www.youtube.com/watch?v=9npRKUAeQZI\n\nMeanwhile, model Cindy Crawford came on the scene as a newer, more put together version of Gia. Crawford admitted to Playboy that many of her jobs came from those who loved Carangi and were hoping to replace her.\n\nIn the fall of 1986, Carangi was hospitalized. It became apparent that she had been sleeping outside in the rain and had been badly beaten up and raped. Blood tests showed she was suffering from AIDS-related complications.\n\nOn November 26, 1986, America’s first supermodel died of those complications, though her mother was by her side.\n\nCarangi’s meteoric and tumultuous career were immortalized in the HBO movie Gia that starred Angelina Jolie nearly a decade later in 1998. Jolie said of the model herself after portraying her, “You think, ‘God, she didn’t need drugs — she was a drug.'”\n\nCarangi seemed to be somewhat cognizant of her brilliant, though short, career. She said forebodingly in an interview before her demise: “Modeling is a short gig.”\n\nAfter this look at Gia Carangi, read about who some believe was America’s first “it” girl, Audrey Munson. Then, take a look at the strange and sad story of the French fitness model who was killed by an exploding whipped cream can."}, {"url": "https://timenote.info/en/Gia-Carangi", "page_content": "Gia Marie Carangi (January 29, 1960 – November 18, 1986) was an American fashion model during the late 1970s and early 1980s. Carangi is considered by some to be the first supermodel, although that title has been applied to others, including Janice Dickinson, Dorian Leigh, and Jean Shrimpton. Model Cindy Crawford was later referred to as \"Baby Gia\" due to her resemblance to Carangi.\n\nCarangi was featured on the cover of fashion magazines, including the April 1979 edition of British Vogue, the April 1979 and August 1980 editions of Vogue Paris, the August 1980 edition of American Vogue, the January 1981 edition of Vogue Italia, and several issues of Cosmopolitan between 1979 and 1982.\n\nAfter she became addicted to heroin, Carangi's modeling career rapidly declined. She later contracted HIV, which suddenly claimed her life at the age of 26. Her death was not widely publicized and few people in the fashion industry knew of it. Carangi is thought to be one of the first famous women to die of AIDS. Gia, a biographical film starring Angelina Jolie, debuted on HBO in 1998.\n\nEarly life\n\nCarangi was born in Philadelphia, Pennsylvania. She was the third and youngest child of Joseph, a restaurant owner, and Kathleen (née Adams) Carangi, a homemaker. She had two older brothers. Her father is Italian, and her mother is of Irish and Welsh ancestry. Joseph and Kathleen had an unstable, violent marriage leading Kathleen to ultimately abandoning the family when Carangi was eleven years old. Those who knew her blamed her \"fractured childhood\" for the instability and drug-dependence that plagued her adult life. She was described as \"needy and manipulative\" by relatives who recalled her as spoiled and shy as a child and a \"mommy’s girl\" who did not receive the motherly attention that she desired.\n\nIn her adolescent years, Carangi found the attention she sought from other teenage girls, befriending them by sending flowers. While attending Abraham Lincoln High School, Carangi bonded with \"the Bowie kids\", a group of obsessive David Bowie fans who emulated Bowie's \"defiantly weird, high-glam\" style. Carangi was drawn to Bowie for his fashion preferences and his ambiguous gender play and outspoken bisexuality. A friend of Carangi described her \"tomboy persona,\" describing her relaxed openness about her sexuality as reminiscent of the character Cay in the 1985 film Desert Hearts. Carangi and her \"bi-try Bowie-mad\" friends hung out in Philadelphia’s gay clubs and bars. Though she associated with the lesbian community, she did not want to take up \"the accepted lesbian style\".\n\nCareer\n\nSuccess\n\nCarangi was most known in modeling circles by only her first name. After being featured in Philadelphia newspaper ads, Carangi moved to New York City at the age of 17, where she quickly rose to prominence. She was a favorite model of various fashion photographers, including Francesco Scavullo, Arthur Elgort, Joseph Petrellis, Richard Avedon, Denis Piel, Marco Glaviano, and Chris von Wangenheim.\n\nWell-integrated within the fashion world, Carangi had the selection of several photographers, most notably Scavullo. By the end of 1978, Carangi was already a well-established model. In a 20/20 interview, she said her rise was \"very fast\" and \"I started working with well-known people in the industry, very quickly. I didn't build into a model. I just sort of became one.\"\n\nCarangi was a regular at Studio 54 and the Mudd Club. She usually used cocaine in clubs, but later developed a heroin addiction.\n\nIn October 1978, Carangi did her first major shoot with top fashion photographer Chris von Wangenheim. Wangenheim had her pose nude behind a chain-link fence with makeup assistant Sandy Linter. Carangi immediately became infatuated with Linter and started to pursue her, though the relationship never became stable.\n\nDrug abuse and career decline\n\nOn March 1, 1980, Carangi's agent and mentor, Wilhelmina Cooper, died of lung cancer. Devastated, Carangi started abusing drugs. Scavullo recalled a fashion shoot in the Caribbean when \"She was crying, she couldn't find her drugs. I literally had to lay her down on her bed until she fell asleep.\" Her addiction soon began to affect her work. Carangi began having violent temper tantrums, walking out of photo shoots to buy drugs, and began falling asleep in front of the camera. During one of her final location shoots for Vogue, Carangi had visible red bumps in the crooks of her elbows where she had injected heroin. The photos were airbrushed and eventually ran in the November 1980 issue of Vogue, but some photos reportedly still showed visible needle marks.\n\nBy November 1980, Carangi's career was in a steep decline. Modeling offers soon ceased and her fashion industry friends, including Sandy Linter, refused to speak to her fearing their association with her would harm their careers. She briefly signed with Ford Models \"for a couple of weeks\", but was soon dropped. In an attempt to quit drugs, she moved back to Philadelphia with her mother and step-father in February 1981.\n\nRetirement and attempted comeback\n\nAfter moving to Philadelphia, Carnagi went through a 21-day detox program. Her sobriety however was short-lived and she was arrested in March 1981 after she drove into a fence in a suburban neighborhood and took off. After a chase with police, she was taken into custody where it was later determined she was under the influence of alcohol and cocaine. After her release, Carangi briefly signed with a new agency, Legends. She worked sporadically, mainly in Europe.\n\nIn fall 1981, Carangi was in the throes of drug abuse. Despite this, she was still determined to make a comeback in the fashion industry and signed with Elite Model Management. While some clients were refused to work with her, other clients were willing to take a chance because of her past status as a top model. One of her first jobs was for Francesco Scavullo who photographed her for Cosmopolitan. Scavullo convinced the magazine's editors to use the shot for its April 1982 cover. Sean Byrnes, Scavullo's long-time assistant later said, \"What she was doing to herself finally became apparent in her pictures. [...] I could see the change in her beauty. There was an emptiness in her eyes.\" The Cosmo cover would be her last.\n\nDuring this time, Carangi mainly worked with photographer Albert Watson and got jobs modeling for department stores and catalogs. In April 1982, Richard Avedon hired her for the 1982 Versace campaign which lead to her being hired for the Spring 1983 campaign. She then modeled for German mail-order clothing company Otto Versand. Around this time, Carangi enrolled in an outpatient methadone program but soon began using heroin again. During a photo shoot for the Spring 1983 Versace campaign shot in the fall of 1982, Carangi became uncomfortable and left the shoot before any usable shots of her were taken. By the end of 1982, she had only a few clients that were willing to hire her. Carangi's final photo shoot was for Otto Versand in Tunisia. She was sent home during the shoot for using heroin. She left New York for the final time in Spring 1983.\n\nLater years\n\nCarangi spent her remaining years living with various lovers, friends and family members in Philadelphia and Atlantic City. She was admitted to an intense drug treatment program at Eageville Hospital in December 1984. After treatment, she got a job in a clothing store which she eventually quit. She later got a job as a checkout clerk and then worked in the cafeteria of a nursing home. By the winter of 1985, Carangi began using drugs again. In June 1986, she was admitted to Warminster General Hospital in Warminster, Pennsylvania with bilateral pneumonia. A few days later, she was diagnosed with AIDS-related complex.\n\nDeath\n\nOn October 18, 1986, Carangi was admitted to Hahnemann University Hospital. She died of AIDS-related complications on November 18, 1986. Her funeral was held on November 23 at a small funeral home in Philadelphia. No one from the fashion world attended, mainly because no one knew about her death until months after she had died. However, weeks later, Francesco Scavullo, Carangi's friend and confidant, sent a Mass card when he heard the news.\n\nLegacy\n\nA biography of Carangi by Stephen Fried called Thing of Beauty (the title of John Keats' famous poem) was published in 1993. A biographical film, Gia, debuted on HBO in 1998. Angelina Jolie starred in the title role, garnering a Golden Globe award for the role.\n\nIn 1996, actress-screenwriter Zoë Tamerlis, herself a heroin addict who died of drug-related causes in 1999, was commissioned to write a screenplay based upon Carangi's life. This version of Gia was not produced, but after Tamerlis' death, footage of Carangi, Tamerlis, photographers, Carangi's family, and Sandy Linter discussing her life was incorporated into a 2003 documentary entitled The Self-Destruction of Gia.\n\nCarangi's sexual orientation has been disputed after her death; LGBT outlets label her lesbian, and other times as bisexual due to her sexual relationships with men. In the film Gia, Jolie also portrayed her as being sexually intimate with men and women. Since Carangi's death, she has been considered a lesbian supermodel and icon.\n\nDesigners and cosmetic firms represented"}, {"url": "https://giacarangilivedhere.org/about-gia-carangi/", "page_content": "Gia Marie Carangi was born January 29, 1960. She lived here on Earth until November 18, 1986.\n\nThere are some people who’s lights shine a bit brighter than most, Gia was one of those people. Her light has not faded even after she left this Earth. She left behind so many people who loved her… family, friends and fans.\n\nGia was an American model during the late 1970s and early 1980s. She was considered by many to be the first “Supermodel”. She left behind a huge portfolio of work for someone who worked for a relative short time in the fashion model business.\n\nGia was featured on the covers of many fashion magazines, including multiple editions of Vogue and Cosmopolitan. She appeared in top advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.\n\nGia experimented recreationally with drugs as a youth which was not unusual for the free-range youth of the 60s/70s. She became addicted to heroin at the height of her modeling career then it rapidly declined.\n\nGia died of AIDS-related complications at the age of 26, becoming one of the first famous women to die of the disease.\n\n“Gia died clean and sober”\n\nThis website is dedicated to Gia’s life on Earth.\n\nGia is dancing in heaven to the song “Don’t you (Forget About Me)” by Simple Minds. Love on ya Rob!\n\n… no one has forgotten about you Gia… that would be impossible. You are completely unforgettable. As a matter of fact there are THOUSANDS of people all over the world who know you, your story, your light and they LOVE you. New people, young people, discover you and fall for you every day. You truly live on, just not on Earth."}, {"url": "https://vintagenewsdaily.com/the-worlds-first-supermodel-50-stunning-photos-of-gia-carangi-in-the-1970s-and-1980s/", "page_content": "2 SHARES Share Tweet\n\nBefore Cindy Crawford, Naomi Campbell and Linda Evangelista, there was Gia.\n\nBorn 1960, Gia Marie Carangi was an American fashion model during the late 1970s and early 1980s. Considered by some to be the first supermodel, she was featured on the cover of fashion magazines, including multiple editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.\n\nGia Carangi in the late 1970s and early 1980s\n\nAfter being addicted to heroin, Carangi’s modeling career rapidly declined. She died of AIDS-related complications in 1986 at the age of 26, becoming one of the first famous women to die of the disease. Her life was dramatized in the television film Gia, starring Angelina Jolie, which debuted on HBO in 1998.\n\nTake a look at these stunning photos to see the unique looks of Gia Carangi in the 1970s and 1980s.\n\nGia Carangi for Harper’s Bazaar, Italia, November 1978\n\nGia Carangi for Harper’s Bazaar, Italia, September 1978\n\nGia Carangi for Harper’s Bazaar, Italia, September 1978\n\nGia Carangi for Harper’s Bazaar, Italia, September 1978\n\nGia Carangi for Harper’s Bazaar, Italia, September 1978\n\nSee more »"}, {"url": "https://bodysize.org/en/gia-carangi/", "page_content": "Gia Marie Carangi (January 29, 1960 – November 18, 1986) was an American fashion model during the late 1970s and early 1980s. Considered by some to be the first supermodel, she was featured on the cover of fashion magazines, including multiple editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Chanel, Christian Dior, Versace, and Yves Saint Laurent.\n\nAfter she became addicted to heroin, Carangi's modeling career rapidly declined. She died of AIDS-related complications at the age of 26, becoming one of the first famous women to die of the disease. Her life was dramatized in the television film Gia, starring Angelina Jolie, which debuted on HBO in 1998.\n\nCarangi was born in Philadelphia, the third and youngest child of Joseph Carangi, a restaurant owner, and Kathleen Carangi (née Adams), a homemaker. She had two older brothers. Her father was Italian, and her mother was of Irish and Welsh ancestry. Joseph and Kathleen had an unstable, violent marriage, ultimately leading Kathleen to abandon the family when Carangi was eleven years old. Those who knew her blamed her \"fractured childhood\" for the instability and drug dependence that plagued her adult life. She was described as \"needy and manipulative\" by relatives who recalled her as spoiled and shy as a child and a \"mommy's girl\" who did not receive the motherly attention that she desired."}, {"url": "https://www.vintag.es/2018/08/gia-carangi-1970s-and-1980s.html", "page_content": "Gia Carangi in the late 1970s and early 1980s\n\n\n\n\n\nGia, starring Angelina Jolie, which debuted on HBO in 1998.\n\n\n\nTake a look at these stunning photos to see the unique looks of Gia Carangi in the 1970s and 1980s.\n\n\n\nGia Carangi for Harper's Bazaar, Italia, November 1978\n\nGia Carangi for Harper's Bazaar, Italia, September 1978\n\nGia Carangi for Harper's Bazaar, Italia, September 1978\n\nGia Carangi for Harper's Bazaar, Italia, September 1978\n\nGia Carangi for Harper's Bazaar, Italia, September 1978\n\nGia Carangi for Harper's Bazaar, Italia, September 1978\n\nGia Carangi for Harper's Bazaar, Italia, September 1978\n\nGia Carangi for Harper's Bazaar, Italia, September 1978\n\nGia photographed by Chris von Wangenheim wearing Calvin Klein for Harper's Bazaar Italia, June 1978\n\nGia Carangi photographed by Stan Malinowski, June 1978\n\nGia Carangi for Vogue, October 1979\n\nGia Carangi photographed by Arthur Elgort for Vogue, October 1979\n\nGia Carangi photographed by Chris Von Wangenheim for Vogue, January 1979\n\nGia Carangi photographed by Chris von Wangenheim, 1979\n\nGia Carangi photographed by Chris Von Wangenheim, hair by John Sahag, makeup by Ariella for Vogue, February 1979\n\nGia Carangi photographed by Irving Penn, hair by Garren, makeup by Way Bandy for Vogue, July 1979\n\nGia Carangi photographed by Michael Reinhardt for Vogue, May 1979\n\nGia Carangi photographed by Patrick Demarchelier, 1979\n\nGia Carangi photographed by Stan Malinowski for Vogue Australia, June 1979\n\nGia Carangi photographed by Stan Malinowski for Vogue, December 1979\n\nGia Carangi photographed by Stan Malinowski for Vogue, December 1979\n\nGia Carangi photographed by Stan Malinowski for Vogue, December 1979\n\nGia Carangi photographed by Stan Malinowski for Vogue, December 1979\n\nGia Carangi for Vogue, April 1980\n\nGia Carangi for Vogue, April 1980\n\nGia Carangi for Vogue, April 1980\n\nGia Carangi for Vogue, April 1980\n\nGia Carangi for Vogue, April 1980\n\nGia Carangi for Vogue, April 1980\n\nGia Carangi for Vogue, April 1980\n\nGia Carangi for Vogue, April 1980\n\nGia Carangi for Vogue, January 1980\n\nGia Carangi photographed by Denis Piel for New York Magazine, 1980\n\nGia Carangi photographed by Denis Piel for Vogue, November 1980\n\nGia Carangi photographed by Patrick Demarchelier for Vogue, hair by Harry King, makeup by Kerry Warn, August 1980\n\nGia Carangi photographed by Scavullo for Vogue, July 1980\n\nGia Carangi photographed by Scavullo for Vogue, November 1980\n\nGia Carangi photographed by Scavullo for Vogue, November 1980\n\nGia Carangi photographed by Scavullo for Vogue, November 1980\n\nGia Carangi photographed by Scavullo in St. Bart's Island in the Caribbean for Vogue, hair by Harry King, makeup by Way Bandy, May 1980\n\nGia Carangi photographed by Scavullo in St. Bart's Island in the Caribbean for Vogue, hair by Harry King, makeup by Way Bandy, May 1980\n\nGia Carangi for Vogue Italia, June 1981\n\nGia Carangi photographed by Andrea Blanch for Harper's Bazaar, Italia, April 1982\n\nGia Carangi photographed by Andrea Blanch for Harper's Bazaar, Italia, April 1982\n\nGia Carangi photographed by Andrea Blanch for Harper's Bazaar, Italia, April 1982\n\nGia Carangi photographed by Andrea Blanch for Harper's Bazaar, Italia, April 1982\n\nGia Carangi photographed by Andrea Blanch for Vogue, July 1982\n\nGia Carangi photographed by Scavullo, 1982\n\nGia Carangi by Linda Fence, circa 1983\n\nOne of the last photoshoot of Gia Carangi in 1986 After being addicted to heroin, Carangi’s modeling career rapidly declined. She died of AIDS-related complications in 1986 at the age of 26, becoming one of the first famous women to die of the disease. Her life was dramatized in the television film, starring Angelina Jolie, which debuted on HBO in 1998.Take a look at these stunning photos to see the unique looks of Gia Carangi in the 1970s and 1980s.\n\nBefore Cindy Crawford, Naomi Campbell and Linda Evangelista, there was Gia.Born 1960, Gia Marie Carangi was an American fashion model during the late 1970s and early 1980s. Considered by some to be the first supermodel, she was featured on the cover of fashion magazines, including multiple editions ofand, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent."}, {"url": "https://fampeople.com/cat-gia-carangi", "page_content": "Gia Carangi : biography\n\nGia Marie Carangi (January 29, 1960 – November 18, 1986) was an American fashion model during the late 1970s and early 1980s. Carangi is considered by some to be the first supermodel, although that title has been applied to others, including Janice Dickinson, Dorian Leigh, and Jean Shrimpton. Model Cindy Crawford was later referred to as \"Baby Gia\" due to her resemblance to Carangi.\n\nCarangi was featured on the cover of fashion magazines, including the April 1979 edition of British Vogue, the April 1979 and August 1980 editions of Vogue Paris, the August 1980 edition of American Vogue, the February 1981 edition of Vogue Italia, and multiple issues of Cosmopolitan between 1979 and 1982. During these years, she also appeared in various promotional campaigns for high profile fashion houses including, among others, Armani, Christian Dior, Versace and Yves Saint Laurent.\n\nAfter she became addicted to heroin, Carangi’s modeling career rapidly declined. She later contracted HIV, which claimed her life at the age of 26. Her death was not widely publicized and few people in the fashion industry knew of it. Carangi is thought to be one of the first famous women to die of AIDS. Gia, a biographical film starring Angelina Jolie, debuted on HBO in 1998.\n\nEarly life\n\nCarangi was born in Philadelphia, Pennsylvania. She was the third and youngest child of Joseph, a restaurant owner, and Kathleen (née Adams) Carangi, a homemaker. She had two older brothers. Her father is Italian, and her mother is of Irish and Welsh ancestry. Joseph and Kathleen had an unstable, violent marriage leading Kathleen to ultimately abandon the family when Carangi was eleven years old. Those who knew her blamed her \"fractured childhood\" for the instability and drug-dependence that plagued her adult life. She was described as \"needy and manipulative\" by relatives who recalled her as spoiled and shy as a child and a \"mommy’s girl\" who did not receive the motherly attention that she desired.\n\nIn her adolescent years, Carangi found the attention she sought from other teenage girls, befriending them by sending flowers. While attending Abraham Lincoln High School, Carangi bonded with \"the Bowie kids\", a group of obsessive David Bowie fans who emulated Bowie’s \"defiantly weird, high-glam\" style. Carangi was drawn to Bowie for his fashion preferences and his ambiguous gender play and outspoken bisexuality. One of Carangi’s friends spoke of her \"tomboy persona,\" describing her relaxed openness about her sexuality as reminiscent of the character Cay in the 1985 film Desert Hearts. Carangi and her \"bi-try Bowie-mad\" friends hung out in Philadelphia’s gay clubs and bars. Though she associated with the lesbian community, she did not want to take up \"the accepted lesbian style\".\n\nCareer\n\nSuccess\n\nCarangi was most known in modeling circles by only her first name. After being featured in Philadelphia newspaper ads, Carangi moved to New York City at the age of 17, where she quickly rose to prominence. She was a favorite model of various fashion photographers, including Francesco Scavullo, Arthur Elgort, Joseph Petrellis, Richard Avedon, Denis Piel, Marco Glaviano, and Chris von Wangenheim.\n\nWell-integrated within the fashion world, Carangi had the selection of several photographers, most notably Scavullo. By the end of 1978, Carangi was already a well-established model. In an interview with 20/20, Carangi noted that, \"I started working with very good people…I mean all the time, very fast. I didn’t build into a model, I just sort of became one.\"\n\nCarangi was a regular at Studio 54 and the Mudd Club. She usually used cocaine in clubs, but later developed a heroin addiction.\n\nIn October 1978, Carangi did her first major shoot with top fashion photographer Chris von Wangenheim. Wangenheim had her pose nude behind a chain-link fence with makeup assistant Sandy Linter. Carangi immediately became infatuated with Linter and started to pursue her, though the relationship never became stable."}, {"url": "https://www.thefamousbirthdays.com/people/gia-carangi", "page_content": "About Gia Carangi\n\nGia Carangi was an American model widely regarded as the first supermodel. She was one of the most sought-after models of the late 1970s and early 1980s, appearing on the covers of numerous fashion magazines such as Vogue and Cosmopolitan. She represented famous designers and brands, including Perry Ellis, Armani, Versace, and Christian Dior. Her career and life were cut short after becoming a drug addict. She contracted HIV and died of AIDS at the age of 26.\n\nFamily Life\n\nShe was the youngest of the three children born to Kathleen and Joseph Carangi.\n\nTrivia\n\nShe is widely regarded as one of the first famous women to die of AIDS."}]}