{"Gia Marie Carangi was one of the first famous women to die of AIDS.": [{"url": "https://www.dazeddigital.com/fashion/article/41317/1/the-story-of-gia-the-world-s-first-supermodel-who-died-of-aids-at-26", "page_content": "Starring Angelina Jolie in the title role, the movie documenting Gia Carangi’s tragic life turns 20 this year\n\nText Sabrina Cooper\n\nBefore Peter Lindbergh immortalised Naomi, Cindy, Claudia, Linda, Christy, and Tatjana on the cover of Vogue in 1990, and launched them in their ascension to icon status, there was Gia. Arguably the world’s first supermodel, Gia Carangi paved the way for Campbell, Turlington, and Crawford – with the latter billed ‘Baby Gia’ when she made her runway debut. Gia’s life echoed the classic rags-to-riches story, only, eventually, the riches made way for rags again. While her blue-collar background gave her an edge in the world of high fashion, and appearances on the runways of Dior, Yves Saint Laurent, Calvin Klein, and Armani saw her experience a meteoric rise to fame, behind the scenes all was not well. Struggling to cope with the pressures of her new career, Gia turned to heroin, and, despite kicking the habit a number of times and staging multiple comebacks, in 1986 she died of Aids-related complications at just 26. Twelve years after her death, Gia’s tragic story was committed to a film, with a young, almost unknown Angelina Jolie taking on the role of the troubled model. Her portrayal won her a Golden Globe, as she appeared alongside Hollywood heavyweights Faye Dunaway, who played modelling mogul Wilhelmina Cooper, and Mercedes Ruehl who played her mum, Kathleen. Jolie played Gia with raw emotion throughout, exploring her drug addiction, childhood issues, and relationships with unfaltering sensitivity – having spent hours studying Gia’s TV appearances before filming began. In one, Gia was interviewed on an evening news show about the dark side of modelling and its ties to drugs. She was supposed to be the ‘bad model turned good’, but shortly before her slot, Gia snorted heroin backstage. Jolie admitted that she despised Gia at first, but in the end, confessed to The New York Times in 1997: “I’d like to date Gia. I’d want to be her lover.” Now, as the film turns 20, we look back at Gia’s dramatic and ultimately tragic life.\n\nSHE WAS ONE OF THE FIRST OPENLY GAY MODELS Growing up working class in Philadelphia, Gia was a member of the ‘Bowie Kids’ in high school – a group of die hard fans who went to his concerts and adopted his unique blend of androgynous dressing as their own. Gia cut her hair short and dyed it bold colours, and shopped at vintage and second hand clothing stores, where she picked up men’s button-down shirts, distressed Levi’s 501s, and beaten-up leather boots. As one of the first openly gay models, she often visited DCA, a gay club in the city where, she met one of her first long-term partners: Sharon Beverley. Though Gia had a few trysts with men, she identified as a lesbian. In the film, one of her friends asks if she’s ever had sex with a man before. The model responds: “Yeah once. And I could have done that with a German Shepherd.”\n\nSHE WAS THE ANTITHESIS OF OTHER MODELS OF THE ERA Gia initially got her start with a local photographer in Philadelphia who saw her dancing, and began appearing in local newspaper advertisements, before heading to New York at 17. When she arrived in the city, Gia met with Wilhelmina Cooper, who was floored and signed her immediately. Gia embodied the contrast that the fashion industry craved during that era – in a sea of blonde, blue-eyed, beautiful women, Gia had no filter, wore no make-up and took risks. One of her first shoots saw her pose nude behind a chain-link fence with make-up artist Sandy Linter for photographer Chris von Wangenheim. The shoot was her breakout moment, and led to her modelling for labels including Versace and Dior, and legendary photographers like Helmut Newton and Arthur Elgort. She also starred in an iconic music video, for Blondie’s 1980 hit “Atomic”. “When she was free and just being herself, Gia was unbelievable. That’s the tragedy of her story. You think, God, she didn't need drugs – she was a drug” – Angelina Jolie WHEN WILHELMINA DIED, SHE WENT OFF THE RAILS Cooper became a mother figure to Gia, whose own mum abandoned her when she was just 11, so when she died in 1980 the model was devastated. Though she often did cocaine in the bathroom stalls of Studio 54 and CBGB, Gia’s drug habit began spiralling. The drug trend at that time shifted to heroin, which brought coke users down when they were too high. Usually Gia snorted heroin, with the common understanding that people could only get addicted through needles – which was false. A generation of accidental junkies was born, of which Gia was a part. Anita Sarka, a DJ from former downtown NYC institution Mudd Club and friend of Gia told Vanity Fair: “In those days, everyone had this idea that being a junkie was very glamorous.”\n\n...AND WAS SOON OUT OF WORK Gia eventually started injecting and her habit became so bad that in one of her appointment books, she wrote (and misspelt) ‘Get Heroine’. Soon after, the track marks on her arms started showing in photos and only one photographer, Francesco Scavullo, requested her for work. During a particularly painful scene in Gia, Scavullo’s stylist says out loud, “What about that awful thing on her hand? It looks like a volcano,” while pointing at an abscess. Unsurprisingly, Gia’s career tanked. She garnered notoriety for scandalous stories like shooting up heroin in bathrooms during breaks, and on a Versace shoot with Richard Avedon she told everyone she was going out for cigarettes and never returned."}, {"url": "https://people.com/movies/angelina-jolie-gia-25th-anniversary-about-death-of-model-who-inspired-movie-gia-carangi/", "page_content": "It's been 25 years since Angelina Jolie starred as Gia Carangi in Gia.\n\nThe 1998 HBO television film featured a then-22-year-old Jolie as the real-life Carangi, who was considered by many the world's first supermodel. She died in 1986 at age 26 of AIDS-related complications, at just 26 years old.\n\nMila Kunis also appeared in Gia as a younger version of Carangi, in one of her first-ever film roles, while additional cast members included Faye Dunaway, Mercedes Ruehl, Elizabeth Mitchell and Scott Cohen.\n\nDirected by Michael Cristofer (Mr. Robot) and co-written by Cristofer, 78, and Jay McInerney, Gia is about \"the life of Gia Carangi, a top fashion model from the late 1970s, from her meteoric rise to the forefront of the modeling industry, to her untimely death,\" according to a synopsis from IMDb.\n\nRead on to learn more about Carangi, from her early life to her tragic death.\n\nNever miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human-interest stories.\n\nGia Carangi. Andrea Blanch/Getty\n\nCarangi was born Gia Marie Carangi in Philadelphia on Jan. 29, 1960, into a working-class family that included two older brothers. Her father Joseph Carangi, who was Italian, owned a restaurant, while her mother, Kathleen Carangi (née Adams), was a homemaker.\n\nIn the late 1970s, Carangi was discovered on the dance floor by a local photographer. Her first modeling gig for a major advertisement was with Versace, and she had become a well-known figure at Wilhelmina Models in New York City by 1980, according to The New York Times.\n\nBut throughout her catapult to fame, Carangi — who was one of the first openly gay models, Dazed reported — struggled with addiction and substance abuse, including of cocaine and heroin.\n\nBack in 2020, makeup artist Sandy Linter recalled to The Hollywood Reporter that she and Carangi had a romance in the late 1970s that \"was never a torrid sexual affair but we did love each other.\"\n\n\"I was just as shocked as anybody that she became an addict,\" Linter said. \"She thought she was stronger than the drugs. One morning, as she was getting dressed to leave my apartment she asked, 'What happened to my natural energy?' She didn't have the energy to get dressed at 20 years old. The drugs took everything.\"\n\nGia Carangi. Dustin Pittman/WWD/Penske Media via Getty\n\nAccording to Dazed, Carangi attempted several times to get clean, including going to rehab, but it never stuck. She was diagnosed with AIDS in December 1985, and died of related complications the following November.\n\nLinter told THR that the last time she saw Carangi was in 1983 or 1984, when the model rang her doorbell, then \"sat down on my couch with me, put her head on my shoulder and cried.\"\n\n\"It was the end of our 'romance.' I knew it and she knew it. Because she looked so good, I had been tricked into thinking that she was on the road to recovery,\" Linter said. \"I never knew she had AIDS until later. After maybe 30 minutes, she looked out the window, nodded to someone in the street and left. I would never see her again.\"\n\nMore than 35 years after Carangi's death, Gia is still beloved by fans, holding a Rotten Tomatoes score of 93%, with an Audience Score of 82%.\n\nAhead of the movie's release, Jolie, now 47, told The New York Times in 1997 that she initially \"hated\" Carangi while doing research about her, based on a 20/20 interview the model once did — but eventually changed her tune and thought, \"I'd like to date Gia. I'd want to be her lover.''\n\nAngelina Jolie (center) in Gia (1998). Larry Watson/Citadel Ent/Kobal/Shutterstock\n\nThe actress also told Entertainment Weekly at the time of her role that she \"definitely needed to learn the lessons Gia needed to learn.\"\n\n\"Especially feeling that the physical is more important than anything else, or that you're only as smart and good as somebody thinks you are,\" she said. \"It's been really important for me to look at myself in the mirror, and realize that I can't let myself go down like she did.\"\n\nJolie — who went on to win an Oscar for her performances in the following year's Girl, Interrupted alongside Winona Ryder — also said she wanted the audience \"to identify with Gia and see her as being just a regular girl.\"\n\n\"No matter how together or perfect some people may appear, they have their share of pain and a deep-down need for love — the same as everyone else,\" the actress added."}, {"url": "https://www.factinate.com/people/facts-gia-carangi/", "page_content": "Gia Carangi took the modelling industry by storm with her fearless, androgynous look and risk-taking sensibilities. Although she is widely considered to be the first supermodel, her early exposure to substances derailed her career right at the peak of her success. Gia’s story is a cautionary tale—one of heartbreak and regret—and it only ends in tragedy.\n\n1. She Came From A Broken Family\n\nAdvertisement\n\nBorn January 29, 1960, Gia Carangi had it rough right from the get-go. Her home life was violent and unstable, and when she was only 11 years old, her mother walked out on the family. After that, Gia didn’t see her mother for years. She spent her youth in Philadelphia, working at her father’s small restaurant and trying to forget her yearning for a maternal figure.\n\nBut this sense of loss never went away.\n\n2. She Marched To The Beat Of Her Own Drum\n\nGia found other meaningful connections in her friendships and was shamelessly open with her feelings. She often declared intentions of friendship with floral bouquets. No flowers for the boys though! Gia was all about the ladies. In high school, she pivoted from platonic girl crushes and began frequenting gay clubs, subverting gender norms every chance she got.\n\nHowever, Gia did have time for one man, and one man only—her idol, David Bowie.\n\n3. She Looked Up To A Legend\n\nGia and her friends obsessed over Bowie’s glam style, bisexuality, and playful gender subversion. Taking cues from the legendary musician, Gia adopted an androgynous style. She wore men’s clothes—army pants and combat boots–and kept her hair cropped short and brightly dyed. But that wan’t all. Gia was a barefaced beauty all the way through and never wore a stitch of makeup.\n\nWhile out at the clubs, she definitely stood out from the crowd.\n\n4. She Stood Out From The Crowd\n\nEveryone noticed Gia—it was hard not to. She was a hip vision in her thrifted vintage wardrobe of men’s castoffs, and her signature style was a striking contrast to her unadorned natural beauty. Instantly captivated by Gia at a club she frequented, a local shutterbug, Maurice Tannenbaum, asked to take her photograph on the dance floor. Before long, bold, confident, and self-assured Gia began to model in local advertisements.\n\nBut that wasn’t all the nightclubs had to offer.\n\nAdvertisement\n\n5. She Was Gay and Proud\n\nWhen she was only 15 years old, Gia partied at the gay club DCA and set her eyes on a short and beautiful blonde girl named Sharon Beverly. She’d actually briefly dated Beverly’s brother, but in the end, her overwhelming attraction to Beverly won out. However, there was one caveat—Beverly was quite a bit older than Gia and it was about to get her in a lot of trouble.\n\n6. She Was Too Young\n\nAlthough Kathleen Sperr wasn’t especially close to her daughter Gia, it didn’t stop her from laying down the law. After finding out about Gia’s lesbian romance with Sharon, she immediately called up Sharon’s parents and warned them that their daughter was far too old to be hanging out with Gia. Of course, this never stopped Gia from pursuing what she wanted—whether it be a woman or a career or a bad decision.\n\n6. She Took A Chance\n\nWith some exposure and experience, Gia decided to see how far she could get with modelling. Like many before her, Gia’s dreams and aspirations were bigger than the confines of her hometown. The bright lights and endless possibilities of New York City drew Gia to the pulsing metropolis. Only 17, and all on her own in an unfamiliar and strange city, Gia didn’t have to wait long before being discovered.\n\nShe soon met a woman who would not only be her agent, and mentor, but also a dear friend. This was the maternal figure she had been searching for all along.\n\n7. She Was A Hit\n\nWhen Gia met Wilhelmina Cooper, one of the most successful models of the 1960s, everything changed. Although Cooper’s career had been based on her icy, aristocratic look, she immediately recognized the edgy, blue-collar Gia as a new breed of model. After signing her on, Cooper took Gia under her wing, and before long, Gia herself had become a one-name wonder.\n\n8. She Got Her First Big Break\n\nThe first major shoot Gia booked was so chaotic and iconic it’s still talked about to this day. In it, Gia climbed and posed against a chain link fence. And then she amped up the drama. She started shrugging out of her clothes, eventually shedding them all together. When another model joined her on set, the two of them took it to the next level.\n\nSign up to our newsletter. History’s most fascinating stories and darkest secrets, delivered to your inbox daily. Making distraction rewarding since 2017.\n\n9. She Was Obsessed With Her Makeup Artist\n\nOn the day of her infamous photoshoot, Gia had two costars. The first round of shots were taken with Lisa Vales, but for the second round, the photographer wanted to do something more personal and asked the makeup artist, Sandy Linter, to step in. That’s when the magic really started happening. She and Gia had unbelievable chemistry.\n\nAdvertisement\n\n10. She Bared All\n\nTogether, Gia and Vales turned up the heat, sharing steamy smouldering gazes through the wire, with only the fence between them. It was risky and fearless, and absolutely successful. The pictures are now part of fashion history and still have tongues wagging to this day. More than that, the snaps launched Gia’s career into the stratosphere.\n\n11. She Became The First Supermodel\n\nThe photos caused a sensation, and in a short time Gia established herself within the modelling world. She began working with top fashion houses including haute couture heavyweights Versace, Armani, and Saint Laurent. But that wasn’t all. She also booked coveted jobs as a cover girl for Paris and American Vogue. As Gia’s star rapidly rose, there was one person she just couldn’t get out of her head.\n\n12. She Shot Her Shot\n\nThe day after their steamy photoshoot, Gia put the moves on Linter, and asked her if she wanted a ride in her bright red sports car. Linter went along with it and soon after, things started getting serious. After her busy work days, 19-year-old Gia didn’t want to spend the rest of her night alone in an empty apartment. With Linter, she found companionship—a balm to her ever growing sense of isolation.\n\n13. She Fell In Love\n\nGia and Linter loved one another deeply and while Linter has since admitted that it wasn’t a “torrid love affair,” these two girls certainly shared a special connection. They spent most of their time together. There were flowers, restaurants, and wild nights out at the clubs, but most importantly, there was the mutual feeling of being understood.\n\nBut this comfortable relationship was never destined for “happily ever after.”\n\n14. She Was Intensely Lonely\n\nPeople described Gina as a loner, but those closest to her claimed the opposite was true. When it came to her relationship with Linter, Gia always wanted more—more stability, more affection, and more time. Unfortunately, Linter just wasn’t able to give her any of this, and was hesitant to put labels on their relationship. Slowly but surely, Gia’s constant need for attention doused any hope of a long-term commitment.\n\nWithout Linter and with the constant pressures of the modelling industry, Gia sought out other—more dangerous—coping mechanisms.\n\n15. She Was A Casual User\n\nPartygoers of the decadent disco era were nose candy enthusiasts, and the powder was ubiquitous in the night club culture that Gia adored. The hotspot club Studio 54 was a notorious place for using substances, and bumping lines off the closest mirror was commonplace with the party people crowd Gia ran with. This was a slippery slope, and Gia dove down it—head first.\n\nAdvertisement\n\n16. She Was Oblivious\n\nOf course, this underworld had sinister consequences. It was almost too easy for an unsuspecting user to snort a different substance by mistake…like say, if the substance was a white powder. Gia, like many others at the time, was sorely misinformed about it and believed that you couldn’t get addicted unless under certain circumstances. As she soon learned, it was far more dangerous than she ever expected.\n\n14. She Hit Her Peak\n\nAmid the temptations of New York’s nightlife, Gia was at the top of her game. To her delight, she participated in a rite of passage for A-list models, making a guest appearance in a music video. The band was Blondie, and as a huge fan, Gia cut across the dance floor, bobbing her head to the song “Atomic.” With the music video and her unparalleled success, everything was going according to plan…\n\n…But just as she was taking off, a tragedy struck.\n\n15. She Lost Her Mentor\n\nWhen Gia learned that her mentor Wilhelmina had been diagnosed with lung cancer, she felt her world crumbling around her. This powerful woman had acted as her center—her maternal figure and guiding light. At the tragically young age of 40, Wilhelmina succumbed to her illness, leaving Gia all alone. Devastated and grieving, the young model made a terrible mistake.\n\n16. She Couldn’t Keep It Together\n\nWith only two years of industry experience, Gia immediately began to falter without Wilhelmina’s strong guidance and encouragement. Her depression drove her to self-medicate with the many subtances available to her and it wasn’t long before she disappeared into the grip of addiction. Of course, this self-destructive behavior didn’t bode well for her blossoming career.\n\n17. She Was A Diva\n\nEven before her troubles with addiction began to have an impact on her work, Gia was a total diva. Her high-maintenance behavior was part and parcel of her edgy style that made her unique. But there was only so much people were willing to tolerate. She was notoriously hard to work with. And as her use only escalated, so did her difficult antics…\n\n18. She Lost Control\n\nBefore substances, it wasn’t uncommon for Gia to wander off and ghost a set, or cancel work over a bad haircut, but under the influence, it only got worse. While on set, she started pulling vicious temper tantrums, and sometimes, she’d even abandon a job just to seek out a score.At an extremely low point, her overwhelming exhaustion had her falling asleep in front of the cameras. But that wasn’t all.\n\nAdvertisement\n\n19. She Became An Addict\n\nGia’s addiction became so bad that in one of her datebooks she made it a top priority, scrawling the words, “Get heroine.” Ugh! The grim misspelling is so multilayered. Gia, instead of continuing to be the hero of her own story became hopelessly enthralled by the narcotic that would doom her. As her addiction spiralled out of control, her peers and few friends began to see that Gia was on a crash course for disaster.\n\n20. She Didn’t Have A Lot Of Friends\n\nDuring this time, one of the few friends Gia had left was her ex-girlfriend Sandy Linter. Linter herself was no stranger to using in nightclubs, and at the time, had no idea how destructive it could be. But witnessing Gia’s descent into addiction changed all that. She was shocked to discover that, at the vibrant age of 20, Gia had so little energy she could barely dress herself.\n\nBut the side effects of addiction didn’t end there…\n\n21. She Had Surgery\n\nIt’s fair to say that a model’s face and body is their brand and their product, and Gia certainly wasn’t careful with the merchandise. As she constantly shot up in the same spot, her habit caused an abscess and infection that damaged a vein and required her to undergo surgery. Still, the surgery didn’t fix the problem, and soon, the constant injections became an even bigger issue.\n\n22. She Had One Supporter\n\nTo her dismay, Gia’s track marks soon became too noticeable to ignore. The scars and bruises marred her photos, and soon barely anybody wanted to work with her. Only one fashion photographer kept coming back to Gia. Francesco Scavullo, who had met Gia when she was just a teenager, stood by her. He had seen her potential from the get-go and supported her every step of the way.\n\nBut during a photoshoot in the Caribbean, even Scavullo couldn’t deny that Gia needed some serious help.\n\n23. She Needed Help\n\nWhile shooting with Scavullo on location, Gia had a total breakdown. She couldn’t find any scores, and became tearful and unstable. Luckily, Scavullo stepped in like a guardian angel and calmed her down, forcing her to go to bed for some much-needed rest. Gia was circling the drain—rock bottom was just around the corner.\n\n24. She Became A Terrible Client\n\nDuring one of her last shoots for American Vogue, Gia’s track marks were highly noticeable. So visible, in fact, that they can be seen in the final pictures. No amount of airbrushing could conceal the unsightly scars and bruises. This damage coupled with her lax professionalism endangered her career, and Gia was steps away from being blacklisted.\n\n25. She Jumped Ship\n\nWilhelmina as a company meant nothing to Gia without Cooper at the helm, and she left the agency to sign with competitor Ford Models. But her plan went horribly wrong. Ford Models dropped her almost immediately, and from there, Gia’s career quickly went downhill. But the fashion companies weren’t the only ones to steer clear of Gia, and soon she found herself more alone than ever.\n\n26. She Had Nobody\n\nAs her work dried up, her fashion industry “friends” scattered like rats from a sinking ship, and even by some accounts her old bestie Sandy Linter wouldn’t talk to her anymore. She became so toxic that no one wanted her rep to rub off on them by association. Jobless, friendless, and completely consumed by her addiction—Gia knew it was time for a change.\n\n27. She Upped And Left\n\nGia desperately needed a break to find some clarity and came up with a strategy to get her life back on track. She made a drastic decision and abandoned the temptations of New York, returning home to Philadelphia to stay with her mother and stepfather. More than anything, she wanted to get clean, and decided to try a 21-day detox program. Perhaps this was the answer to all her problems…\n\n28. She Tried To Get Clean\n\nAfter the detox program, Gia’s sobriety seemed hopeful. But to everyone’s dismay, the detox program didn’t yield any long-lasting results. Not long after finishing the program, she relapsed…and relapsed hard. In fact, she landed in some serious trouble. On one memorable occasion she incited a car chase with the authorities where she sped recklessly through the suburbs.\n\n29. She Crashed And Burned\n\nJust like her attempt at rehabilitation, her car chase antics ended in disappointment. She crashed into a fence and was taken into custody. There, they determined that she was indeed, extremely intoxicated and high as a kite. Resigned to her own dependencies, Gia tried to look for more work. But more than anything, she just wanted her old life back.\n\n30. She Put On A Brave Face\n\nIn 1981, Gia had her first and only television appearance. Her 20/20 interview on ABC highlighted the darker side of the modelling world, but also gave Gia the chance to set the record straight. She hoped to show the world that she’d overcome her many demons, and was ready for a comeback. Nothing could be further from the truth.\n\n31. She Lied On Television\n\nThroughout the interview, Gia claimed that her life of using was over, and that she was completely clean. But her glazed look throughout the segment only proved that she was still using. Her empty claims had her lying through her teeth—so desperate was she for the industry to give her another chance. Then, later that year, something promising happened.\n\n32. She Attempted A Comeback\n\nIn late 1981, Elite Model Management decided to give Gia the benefit of the doubt and signed her. But even then, finding work was a struggle. Because of her tarnished reputation, many companies refused to even consider working with her. No matter how hard she tried to leverage her past status, her comeback soon proved futile.\n\nTo add insult to injury, her very last photoshoot sadly mirrored the success of her first one—they were both infamous–but for very different reasons…\n\n33. Her Photoshoot Was A Disaster\n\nGia’s last magazine cover shoot was for Cosmopolitan in 1982. Behind the camera was none other than her tried and true friend—Francesco Scavullo. But not even his comforting presence could make this last project a success. One of Scavullo’s assistants later reflected on Gia’s dwindling health: “I could see the change in her beauty. There was an emptiness in her eyes.”\n\nUnsurprisingly, the photoshoot was a disaster.\n\n34. She Hid Her Scars\n\nThe Cosmopolitan cover featured Gia with both her arms hidden by the full skirt of her dress. The awkward pose was the only solution to cover up how disfigured Gia’s arms had become from her continued use of needles. After this disastrous shoot, Gia had no choice but to resort to modelling for department stores and catalogs. But even then, fate offered her another shot at redemption…\n\n35. She Had One Last Chance\n\nDespite her notoriously bad behavior, Gia was given one last miraculous chance. While doing mostly catalog work, she landed a gig with famed fashion photographer, Richard Avedon. But this wasn’t just any gig—it was a campaign for the fashion house of Versace. For once in her life, this was one gig Gia couldn’t afford to mess up.\n\n36. She Played Hooky\n\nAfter a hard night of partying, Sandy Linter remembers Gia in the morning light, sitting in the kitchen with the phone pressed to her ear. When Gia asked her whether she should go into work or not, Linter immediately responded with “Not if you feel the way I do!” In retrospect this was a huge mistake. When she found out what it cost Gia to skip out on work, she wished she could take it all back.\n\n37. She Missed Out\n\nAs a supermodel, missing one day of work means sacrificing a lot. When Gia took Lister’s advice and played hooky, she missed out on a $5000 payoff and so much more. When she didn’t show, the model Rosie Vela took her coveted position. She had effectively blown her very last chance in the modelling industry—and it was a very high price to pay.\n\n38. She Hit Rock Bottom\n\nAfter this debacle, Gia was effectively blacklisted: She was no longer able to book work with any major agency, and went at whiplash speed from a hot commodity to a pariah. Her job prospects dwindled down to nothing, and it was about to get very, very desperate. In her darkest hour, she had no choice but to scrape the very bottom of the barrel.\n\n39. She Couldn’t Keep A Job\n\nGia began her illustrious career posing for ads in her hometown paper, and things came full circle when she found herself doing catalog work for an obscure German mail-order company. But even that job was too much for her to manage. Gia used on set and, unwilling to tolerate this behavior, the company fired Gia and sent her home. But while this seemed like the end, the nightmare was only just beginning.\n\n40. She Was Destitute\n\nGia’s glamorous life in New York had come to an end, and having spent all her money, she was essentially homeless. She began dividing her time between her hometown of Philadelphia and Atlantic City, New Jersey while couch surfing among a handful of lovers, friends, and family members. After one last stab at rehab, she swallowed her pride and tried to find employment.\n\n41. She Took A Job In The Real World\n\nGia tried her hand at a number of jobs. First she tried retail, and when that didn’t work, she became a checkout clerk. She even tried working at a nursing home cafeteria. But none of these occupations ever stuck. By 1985, Gia started using again, but this time she had no safety net—no second chances. With nowhere to go, her life took a dark and dangerous turn.\n\n42. She Became A Night Worker\n\nIn lieu of unemployment, Gia resorted to selling more than just her image, but also her body. Compounded with her spiralling addiction, this was a recipe for disaster. In December 1985, she was admitted to a hospital in Pennsylvania. She was extremely ill and doctors diagnosed her with bilateral pneumonia. But little did Gia know, she wasn’t out of the woods yet.\n\n43. She Had A Devastating Diagnosis\n\nA few days later, doctors revealed another, more terrifying diagnosis: Gia had AIDS-related complex. Gia was diagnosed with AIDS at a time when doctors knew very little about the disease, and there was precious little that could be done to save her. In the fall of the next year, Gia was in hospital once again—and this time, she was in much worse condition.\n\n44. She Was One Of The First\n\nIn 1986, Gia faced a horrific ordeal—she was beaten and raped and left out on the street. On October 18, her health took a severe nosedive, and she found herself hospitalized for the final time. With so little known about her disease, doctors treated her as though she was highly infectious. They rigorously wiped down every surface she touched, and anyone attending her wore full protective gear.\n\n45. She Had Regrets\n\nAlthough the end was near, Gia didn’t find much solace in her brief life or career path. Shortly before her passing, Gia had a casual conversation with one of her nurses. Oblivious to Gia’s past, the nurse told her about a photographer who wanted to take pictures of her daughter. Gia’s response was absolutely tragic: “Don’t do it. Even if she wants it, don’t let her do it. I used to be a model. You don’t want your kid to be a model.”\n\n46. She Had A Tragic End\n\nOn November 18, 1986, Gia Carangi passed away from AIDS-related complications. She was only 26 years old. In fact, she was one of the first famous women to ever succumb to the disease. Her family held a small service in her hometown of Philadelphia. Having been such an icon in the modelling world, one might expect Gia’s funeral to be attended by a great number of old coworkers and friends…But this just wasn’t the case…\n\n47. They Forgot Her\n\nWhen her long-time supporter and collaborator, Francesco Scavullo, heard the tragic news, he sent his sympathies and a Catholic Prayer card to her family. However, not one single person or any of her so-called friends from the fashion world attended the service. The world had already moved on from Gia Carangi, and her replacement was rearing to go.\n\n48. They Replaced Her\n\nAfter Gia stepped onto the modelling scene, her signature tomboy look became highly sought after. After she disappeared from the scene, agents worked quickly to find a new model to carry the torch and fill the void left in Gia’s wake. Fashion experts soon shopped around a new young model and even dubbed her “Baby Gia.” Who was this young model? None other than Cindy Crawford.\n\n49. She Has A Biopic\n\nIn 1998, Angelina Jolie starred in the HBO made-for-TV biopic, Gia. Jolie had really interesting, albeit bizarre things to say about portraying Gia. Among the least weird was, “I’d like to date Gia. I’d want to be her lover.” Which is one thing, until you remember Jolie was playing her. But no matter her comments, it’s safe to say that this film keeps people coming back to Gia’s story time and time again.\n\n50. She Lives On\n\nOne fitting and sombre tribute to Gia is her square on the AIDS Memorial quilt. The NAMES Project created the folk-art quilt that weighs over 50 tons, and in 1989 they were nominated for the Nobel Peace Prize. Gia’s square reads, “You know what I think? I think there’s a reason for everything. God has a big plan for me. Just not in this life.”\n\nSources: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12,"}, {"url": "https://simple.wikipedia.org/wiki/Gia_Carangi", "page_content": "Gia Carangi (January 29, 1960 – November 18, 1986) was an American fashion model during the late 1970s and early 1980s. Many people believe she was the first supermodel.[1][2]\n\nModeling career [ change | change source ]\n\nCarangi was on the cover of fashion magazines, including many editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.[3]\n\nIllness and death [ change | change source ]\n\nCarangi, a heroin addict, died of AIDS-related complications at the age of 26. She was one of the first famous women to die of the disease.[1]\n\n\n\n"}, {"url": "https://www.nytimes.com/1997/09/07/arts/the-model-who-invented-heroin-chic.html", "page_content": "''Drugs are a manifestation of the problem, but the real problem is the wound,'' says Mercedes Ruehl, who plays Kathleen, Gia's emotionally distant and clueless mother. ''In the screenplay, we have a mother with a narcissistic wound and a daughter who is narcissistically wounded herself, from a kind of heartbreaking neglect. They're both having to get through the day with massive tricks of denial.''\n\nThe result of that short-circuited relationship between Gia and Kathleen, who abandoned her daughter for a time when Gia was 11, is at the heart of the film.\n\nIn the late 70's, as the dark-haired, dark-eyed teen-age daughter of a South Philadelphia hoagie shop owner, Gia began modeling almost by accident. A local photographer saw her on the dance floor and asked her to pose. Soon she was sought out as a startling alternative to the blond, blue-eyed standard of the day, and by the time she was 18, when she landed her first major advertisement, for Gianni Versace, she was earning $100,000 a year. In 1980, after she had become the ''top girl'' at Wilhelmina Models in New York, she was expected to earn five times that much.\n\nBut inside, haute couture's reigning ideal of feminine beauty felt like a fraud. Away from the camera, she dressed in black leather motorcycle jackets and men's apparel from vintage clothing stores. She was an aggressive lesbian, coming on to models who roomed with her on faraway photo shoots. And once her drug problem got out of hand, she funneled her anger into frightening macho behavior, jumping through a car windshield when she found a female lover with a male friend, and pulling a knife on anyone she thought had slighted her.\n\nWhen the track marks on her arms started showing up in pictures (other models called her Sister Morphine), only Mr. Scavullo continued to use her. Toward the end of her life, she was reduced to selling jeans in a Pennsylvania shopping mall and finally to living on the streets of New York.\n\nIn her prime, Gia sparked a rough-and-tumble reputation for walking out of sessions when a photographer kept her waiting, or when the hypocrisy of an assignment ticked her off. But to some, her free-spirited attitude was symptomatic of her search for truth, and every bit as seductive as her beauty. It's that attitude that Ms. Jolie, the 22-year-old daughter of Jon Voight, hoped to get on film."}, {"url": "https://www.ranker.com/list/life-of-gia-carangi/katia-kleyman", "page_content": "Gia Carangi was considered \"the world’s first supermodel,” preceding the crop of supermodels who would shift the modeling industry in the 1990s. Gia Carangi images adorned the covers of the world’s top magazines during her short-lived career in the late ‘70s and early ‘80s. In fact, at the start of her career she was featured on the cover of Cosmopolitan twice in the span of five months, and made the covers of the French, British and American Vogue. Her androgynous, borderline tomboy look and olive complexion favorably contrasted against the blonde-haired blue-eyed models that had been popular up until that time, and she was once described as a “beautiful punk, a butch pin-up girl.”\n\nGia was in high demand, and if it weren’t for her drug addiction and other self-destructive habits, her career would have cemented her legacy alongside famous supermodels like Naomi Campbell, Linda Evangelista, and Cindy Crawford. But what Gia is perhaps best known for is her rapid self-destruction, which ultimately led to her untimely death.\n\nHow did Gia Marie Carangi die? She contracted a virus that was ravaging the world at the time, and one which the medical community knew little about — HIV, which soon had fully blown into AIDS. Stricken with the disease, ravaged by drug abuse, penniless, abandoned by all her friends, Gia passed away quietly in a hospital bed in 1986 with only her mother at her side. She was 26.\n\nIn 1998, HBO produced a film about the brief, beautiful, and reckless life of Gia Carangi, starring Angelina Jolie. But for most who haven't seen the film, Gia is little-known: a dark, quiet, but important figure from the history of modeling industry and the rise of the supermodel."}, {"url": "https://giacarangilivedhere.org/about-gia-carangi/", "page_content": "Gia Marie Carangi was born January 29, 1960. She lived here on Earth until November 18, 1986.\n\nThere are some people who’s lights shine a bit brighter than most, Gia was one of those people. Her light has not faded even after she left this Earth. She left behind so many people who loved her… family, friends and fans.\n\nGia was an American model during the late 1970s and early 1980s. She was considered by many to be the first “Supermodel”. She left behind a huge portfolio of work for someone who worked for a relative short time in the fashion model business.\n\nGia was featured on the covers of many fashion magazines, including multiple editions of Vogue and Cosmopolitan. She appeared in top advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.\n\nGia experimented recreationally with drugs as a youth which was not unusual for the free-range youth of the 60s/70s. She became addicted to heroin at the height of her modeling career then it rapidly declined.\n\nGia died of AIDS-related complications at the age of 26, becoming one of the first famous women to die of the disease.\n\n“Gia died clean and sober”\n\nThis website is dedicated to Gia’s life on Earth.\n\nGia is dancing in heaven to the song “Don’t you (Forget About Me)” by Simple Minds. Love on ya Rob!\n\n… no one has forgotten about you Gia… that would be impossible. You are completely unforgettable. As a matter of fact there are THOUSANDS of people all over the world who know you, your story, your light and they LOVE you. New people, young people, discover you and fall for you every day. You truly live on, just not on Earth."}, {"url": "https://www.independent.co.uk/news/world/americas/gia-the-tragic-tale-of-the-world-s-first-supermodel-311535.html", "page_content": "Sign up to our Evening Headlines email for your daily guide to the latest news Sign up to our free US Evening Headlines email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nAnd these represent only a fraction of the hundreds of thousands of young women who hope to add their name to those of Kate Moss, Jodie Kidd, Heidi Klum, Tyra Banks, Karen Mulder, Linda Evangelista, Claudia Schiffer, Helena Christensen, Noami Campbell, Cindy Crawford, Christy Turlington, Elle Macpherson, Eva Herzigova, Jerry Hall, Gia Carangi, Ingrid Boulting, Marie Helvin, Lauren Hutton, Verushka, Twiggy and Jean Shrimpton in the litany of modern modelling fame. But, hang on. Did you catch the name in the middle there: Gia Carangi?\n\nYounger readers, unless they have seen the eponymous 1998 film Gia in which Angelina Jolie played Carangi, may need some introduction to the woman who was once called \"the world's first supermodel\" and \"the hottest cover girl\" of the late Seventies and early Eighties. For the life of Gia tells a story of modelling which is not one of fame, fortune and a glamorous land where the sun always shines and the party never stops, where dreams perforce come true and everyone is officially beautiful.\n\nGia, in the days before the term supermodel had been coined, appeared on the cover of Cosmo and Vogue in America, Britain, France and Italy. Her first major modelling job was with Versace when she was 18. She was the favourite model of many top fashion photographers, including Arthur Elgort, Helmut Newton and Francesco Scavullo, who was for 30 years Cosmo's cover photographer. Scavullo's subjects included Grace Kelly, Elizabeth Taylor, Andy Warhol, Janis Joplin, Gore Vidal, Mikhail Baryshnikov, Diana Ross, Kim Basinger, Calvin Klein, Mick Jagger, David Bowie, Debbie Harry, Madonna and Brad Pitt. But Gia was his favourite subject.\n\nYet hers is a cautionary tale. At the age of 17, Gia Carangi was a pretty high-school student - height 5ft 8in, stats 34-24-35, dress size 8-10 - working behind the counter at her father's little restaurant in Philadelphia, Hoagie City, and doing her best never to miss a David Bowie concert. It was 1978.\n\nThen a local photographer asked her to pose on the dance floor and the pictures were seen by Elgort, who photographed for the New York department store Bloomingdale's. Her dark melancholic Italian beauty stood in contrast to the typical blonde hair-blue eyed model then the normative. Her career soared like a star shooting in the night sky. Within a year she was the hottest new thing in New York, partying at Studio 54, and the darling of rockers and royalty, moguls and movie stars, alike.\n\nIt was not just her beauty. She was a new kind of wild child. She posed nude. She dressed in men's clothes. She wore no make-up. She had attitude and \"took no shit\" from the dignitaries of the fashion industry. She was a lesbian, or some said, bisexual. She would walk out of photo shoots if she wasn't in the mood. She was, even at the age of 18, a diva who would cancel two whole weeks' worth of bookings because she didn't like the way her hair was cut.\n\nShe would say things like: \"I'm not impressed by somebody who's got a Lear jet and who's going to take me to Florida every weekend. I just want a body, like a nice hot body and some big lips. Forget everything else.\"\n\nAnd she did not take too much trouble to hide her use of recreational drugs. \"I am finally really starting to dig being different. Maybe I am discovering who I am. Or maybe I'm just stoned again, hahahaha!\"\n\nYet there was behind the wanton lifestyle a deep unhappiness. At the age of five she was sexually abused by a man. The abuse occurred only once, but she was traumatised by the incident. So was she when her mother left her husband, home and children for another man. Though, later in life, her mother returned to her, Gia never got over her sense of abandonment. \"Gia did a lot of things just to get her mother's attention,\" one friend later said. \"The one person Gia always wanted something from was her mother - and she just never felt like she got it.\"\n\nHer public wildness was underpinned by a private loneliness. For even at the height of her fame much of the time, Gia was alone. She had friends in the profession, often make-up artists. But her schedule didn't allow her the time for other activities. At the end of a day's shooting she often went back to her empty New York apartment. \"The biggest mistake we made was that nobody went up there with her,\" her brother, Michael, told her biographer, Stephen Fried, later. \"She could've used a friend.\" Instead she turned to the drugs that others in the fashion world used only at parties.\n\n\"Gia and I were like lion cubs having fun,\" one contemporary said. \"We got a reputation because we didn't hide anything. We did a lot of drugs and went to a lot of parties. So many! We were both constantly on trips, which I think saved my life, because you don't do drugs when you travel. Except when I travelled with Gia. We brought a whole medicine kit.\"\n\nGia's appointment book from 1980 contains a misspelt reminder to \"Get Heroine\". In 1981 she was arrested - for driving under the influence of a narcotic. In May that year, at just 21, Gia required surgery on her hand because, according to Stephen Fried, \"she had injected herself in the same place so many times that there was an open infected tunnel leading into her vein\".\n\nThings were starting, just two years in, to fall apart. Her moods were swinging wildly. She walked out on shoots or fell asleep during jobs. Her drug use was preventing her from working at anything close to her full capacity as a model.\n\nIn those days using heroin was rather glamorous. And Gia was in demand as the look of the moment. Fashion editors knew about all the drugs but did not care. At one major magazine shoot an editor supplied Gia with a bag of cocaine and some heroin on the set. \"The problem was that people were more interested in hiding the marks than helping her,\" said Gia's former lover, Elyssa Stewart, who says the problem persists in the industry but that models now shoot heroin under their toenails or tongue, where track marks cannot be detected.\n\nWhat changed was that Gia started going directly from $10,000-a-day fashion shoots to the heroin shooting galleries on New York's Lower East Side.\n\nOne top photographer called her \"a trashy little street kid\". She made several comebacks, but each time relapsed. And then word leaked out that she might be HIV positive. It was that which led to her finally being blackballed by those who only months before could not get enough.\n\nBy the end of 1984 Gia had entered a vastly different world. After pressure from her family she entered a rehab programme - and declared herself penniless to enter treatment on public welfare. But when she left treatment six months later she went back on the heroin, and in increasing amounts. A year later she was in hospital. She had been sleeping outside in the rain. Bruises on her body suggested she had been badly beaten up. And she had been raped. Her symptoms were those of pneumonia, but blood tests showed she had Aids related complex (ARC), a precursor to Aids. It was the early days of the virus and nurses and orderlies donned rubber gloves or \"space suits\" before entering her room, and wiped the phone every time she used it.\n\nOne nurse, not knowing who she was, chatted about how a local photographer wanted to take some photos of her daughter. Stephen Fried's biography, Thing of Beauty: The Tragedy of Supermodel Gia, records the patient's response: \"Don't do it. Even if she wants it, don't let her do it. I used to be a model. You don't want your kid to be a model.\"\n\nOn 18 November 1986 Gia Carangi died, of Aids. She was 26. Looking back, what did it all add up to? For a moment Gia - with her pale skin, limpid brown eyes and dark brown mane of coarse cuts and waves - redefined the fashion industry's standard of beauty. She had, said her agent, Wilhelmina Cooper, \"a fantastically pliable face\"; she could be really sophisticated in one shooting and be a real Lolita type in another\".\n\nScavullo, the photographer, who died last year, wrote of her: \"Gia is my darling - old, young, decadent, innocent, volatile, vulnerable, and more tough-spirited than she looks.\n\n\"She is all nuance and suggestion, like a series of images by Bertolucci ... I never think of her as a model, though she's one of the best. She doesn't give you the Hot Look, the Cool Look, the Cute Look; she strikes sparks, not poses. Out of doors, especially, I have never known anyone so excitingly free and spontaneous, constantly changing, moving (which drove me crazy until I got smart and learnt to focus the camera faster) - she's like photographing a stream of consciousness.\"\n\nThis was not artless. \"A model has to create moods,\" Gia said at the height of her fame.\n\n\"You have to be careful not to get stuck in a mood - emotions have trends just like fashion ... I become what ever your eye wants to see. It's my job.\"\n\nAs a result \"a disproportionate number of the beauty and fashion shots she appears in\", says Stephen Fried, \"transcend the accepted level of artful commerce and approach the realm of actual photographic art\".\n\nHer life only added to the allure with which her photographs are often now viewed. As the Angelina Jolie film showed, it is possible to project on to Gia's story so many of the dreams of contemporary culture. It is a rags-to-riches tale. It is a lesbian love story. It a harrowing look at the effects of long-term drug abuse. It is the story of a poor-little-rich-girl. It is a chilling commentary on the heartlessness and fear of the first days of the Aids epidemic. It is story of a girl who spent her whole life trying to find something to fill the hole left by her mother's departure.\n\n\"I think God has a plan for me,\" Gia said, with all the unconscious pomposity that modern celebrity can muster. It was, it turned out, that she was to become the first famous woman to be diagnosed with, and die of, Aids. \"Modelling,\" she said on another occasion, \"is a short gig.\""}, {"url": "https://www.geni.com/people/Gia-Carangi/6000000182703070844", "page_content": "About Gia Carangi\n\nhttps://en.wikipedia.org/wiki/Gia_Carangi\n\nGia Marie Carangi (January 29, 1960 – November 18, 1986) was an American model, considered by many to be the first woman to be titled as supermodel. She was featured on the cover of fashion magazines, including multiple editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.\n\nAfter she became addicted to heroin, Carangi's modeling career rapidly declined. At age 26 she died of AIDS-related complications, believed to have contracted the disease from a contaminated needle, becoming one of the first famous women to die of the disease. Her life was dramatized in the television film Gia, starring Angelina Jolie, which debuted on HBO in 1998."}, {"url": "https://www.ranker.com/list/famous-people-who-died-of-aids/reference", "page_content": "When the AIDS epidemic first gained notice, the world was terrified. A gruesome and deadly disease, it even managed to infect some of the most famous actors, musicians, and other celebrities in the world. Here are also famous people who died of HIV infection and celebrities who kept their illness secret. This is a list of famous people who died of AIDS, including pictures, birth dates, professions, and other information. This list is made up of many different people, including Robert Chesley and Marlon Riggs. These notable AIDS deaths include modern and long-gone famous men and women, from politicians to religious leaders to writers.\n\nAlthough AIDS treatment has made many strides in the past few years, that doesn't it mean that people are immune from the disease if they aren't careful. Legendary Queen singer Freddie Mercury fell victim to it, as did tennis great Arthur Ashe, yet both contracted it in entirely different ways. Other Hollywood movie stars who lost their battle with aids include Rock Hudson and Anthony Perkins.\n\nEveryone on this list has has AIDS as a cause of death somewhere in their public records, even if it was just one contributing factor for their death."}]}