{"The biographical film Gia, starring Angelina Jolie, was about Gia Marie Carangi's life.": [{"url": "https://people.com/movies/angelina-jolie-gia-25th-anniversary-about-death-of-model-who-inspired-movie-gia-carangi/", "page_content": "It's been 25 years since Angelina Jolie starred as Gia Carangi in Gia.\n\nThe 1998 HBO television film featured a then-22-year-old Jolie as the real-life Carangi, who was considered by many the world's first supermodel. She died in 1986 at age 26 of AIDS-related complications, at just 26 years old.\n\nMila Kunis also appeared in Gia as a younger version of Carangi, in one of her first-ever film roles, while additional cast members included Faye Dunaway, Mercedes Ruehl, Elizabeth Mitchell and Scott Cohen.\n\nDirected by Michael Cristofer (Mr. Robot) and co-written by Cristofer, 78, and Jay McInerney, Gia is about \"the life of Gia Carangi, a top fashion model from the late 1970s, from her meteoric rise to the forefront of the modeling industry, to her untimely death,\" according to a synopsis from IMDb.\n\nRead on to learn more about Carangi, from her early life to her tragic death.\n\nNever miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human-interest stories.\n\nGia Carangi. Andrea Blanch/Getty\n\nCarangi was born Gia Marie Carangi in Philadelphia on Jan. 29, 1960, into a working-class family that included two older brothers. Her father Joseph Carangi, who was Italian, owned a restaurant, while her mother, Kathleen Carangi (née Adams), was a homemaker.\n\nIn the late 1970s, Carangi was discovered on the dance floor by a local photographer. Her first modeling gig for a major advertisement was with Versace, and she had become a well-known figure at Wilhelmina Models in New York City by 1980, according to The New York Times.\n\nBut throughout her catapult to fame, Carangi — who was one of the first openly gay models, Dazed reported — struggled with addiction and substance abuse, including of cocaine and heroin.\n\nBack in 2020, makeup artist Sandy Linter recalled to The Hollywood Reporter that she and Carangi had a romance in the late 1970s that \"was never a torrid sexual affair but we did love each other.\"\n\n\"I was just as shocked as anybody that she became an addict,\" Linter said. \"She thought she was stronger than the drugs. One morning, as she was getting dressed to leave my apartment she asked, 'What happened to my natural energy?' She didn't have the energy to get dressed at 20 years old. The drugs took everything.\"\n\nGia Carangi. Dustin Pittman/WWD/Penske Media via Getty\n\nAccording to Dazed, Carangi attempted several times to get clean, including going to rehab, but it never stuck. She was diagnosed with AIDS in December 1985, and died of related complications the following November.\n\nLinter told THR that the last time she saw Carangi was in 1983 or 1984, when the model rang her doorbell, then \"sat down on my couch with me, put her head on my shoulder and cried.\"\n\n\"It was the end of our 'romance.' I knew it and she knew it. Because she looked so good, I had been tricked into thinking that she was on the road to recovery,\" Linter said. \"I never knew she had AIDS until later. After maybe 30 minutes, she looked out the window, nodded to someone in the street and left. I would never see her again.\"\n\nMore than 35 years after Carangi's death, Gia is still beloved by fans, holding a Rotten Tomatoes score of 93%, with an Audience Score of 82%.\n\nAhead of the movie's release, Jolie, now 47, told The New York Times in 1997 that she initially \"hated\" Carangi while doing research about her, based on a 20/20 interview the model once did — but eventually changed her tune and thought, \"I'd like to date Gia. I'd want to be her lover.''\n\nAngelina Jolie (center) in Gia (1998). Larry Watson/Citadel Ent/Kobal/Shutterstock\n\nThe actress also told Entertainment Weekly at the time of her role that she \"definitely needed to learn the lessons Gia needed to learn.\"\n\n\"Especially feeling that the physical is more important than anything else, or that you're only as smart and good as somebody thinks you are,\" she said. \"It's been really important for me to look at myself in the mirror, and realize that I can't let myself go down like she did.\"\n\nJolie — who went on to win an Oscar for her performances in the following year's Girl, Interrupted alongside Winona Ryder — also said she wanted the audience \"to identify with Gia and see her as being just a regular girl.\"\n\n\"No matter how together or perfect some people may appear, they have their share of pain and a deep-down need for love — the same as everyone else,\" the actress added."}, {"url": "https://www.dazeddigital.com/fashion/article/41317/1/the-story-of-gia-the-world-s-first-supermodel-who-died-of-aids-at-26", "page_content": "Starring Angelina Jolie in the title role, the movie documenting Gia Carangi’s tragic life turns 20 this year\n\nText Sabrina Cooper\n\nBefore Peter Lindbergh immortalised Naomi, Cindy, Claudia, Linda, Christy, and Tatjana on the cover of Vogue in 1990, and launched them in their ascension to icon status, there was Gia. Arguably the world’s first supermodel, Gia Carangi paved the way for Campbell, Turlington, and Crawford – with the latter billed ‘Baby Gia’ when she made her runway debut. Gia’s life echoed the classic rags-to-riches story, only, eventually, the riches made way for rags again. While her blue-collar background gave her an edge in the world of high fashion, and appearances on the runways of Dior, Yves Saint Laurent, Calvin Klein, and Armani saw her experience a meteoric rise to fame, behind the scenes all was not well. Struggling to cope with the pressures of her new career, Gia turned to heroin, and, despite kicking the habit a number of times and staging multiple comebacks, in 1986 she died of Aids-related complications at just 26. Twelve years after her death, Gia’s tragic story was committed to a film, with a young, almost unknown Angelina Jolie taking on the role of the troubled model. Her portrayal won her a Golden Globe, as she appeared alongside Hollywood heavyweights Faye Dunaway, who played modelling mogul Wilhelmina Cooper, and Mercedes Ruehl who played her mum, Kathleen. Jolie played Gia with raw emotion throughout, exploring her drug addiction, childhood issues, and relationships with unfaltering sensitivity – having spent hours studying Gia’s TV appearances before filming began. In one, Gia was interviewed on an evening news show about the dark side of modelling and its ties to drugs. She was supposed to be the ‘bad model turned good’, but shortly before her slot, Gia snorted heroin backstage. Jolie admitted that she despised Gia at first, but in the end, confessed to The New York Times in 1997: “I’d like to date Gia. I’d want to be her lover.” Now, as the film turns 20, we look back at Gia’s dramatic and ultimately tragic life.\n\nSHE WAS ONE OF THE FIRST OPENLY GAY MODELS Growing up working class in Philadelphia, Gia was a member of the ‘Bowie Kids’ in high school – a group of die hard fans who went to his concerts and adopted his unique blend of androgynous dressing as their own. Gia cut her hair short and dyed it bold colours, and shopped at vintage and second hand clothing stores, where she picked up men’s button-down shirts, distressed Levi’s 501s, and beaten-up leather boots. As one of the first openly gay models, she often visited DCA, a gay club in the city where, she met one of her first long-term partners: Sharon Beverley. Though Gia had a few trysts with men, she identified as a lesbian. In the film, one of her friends asks if she’s ever had sex with a man before. The model responds: “Yeah once. And I could have done that with a German Shepherd.”\n\nSHE WAS THE ANTITHESIS OF OTHER MODELS OF THE ERA Gia initially got her start with a local photographer in Philadelphia who saw her dancing, and began appearing in local newspaper advertisements, before heading to New York at 17. When she arrived in the city, Gia met with Wilhelmina Cooper, who was floored and signed her immediately. Gia embodied the contrast that the fashion industry craved during that era – in a sea of blonde, blue-eyed, beautiful women, Gia had no filter, wore no make-up and took risks. One of her first shoots saw her pose nude behind a chain-link fence with make-up artist Sandy Linter for photographer Chris von Wangenheim. The shoot was her breakout moment, and led to her modelling for labels including Versace and Dior, and legendary photographers like Helmut Newton and Arthur Elgort. She also starred in an iconic music video, for Blondie’s 1980 hit “Atomic”. “When she was free and just being herself, Gia was unbelievable. That’s the tragedy of her story. You think, God, she didn't need drugs – she was a drug” – Angelina Jolie WHEN WILHELMINA DIED, SHE WENT OFF THE RAILS Cooper became a mother figure to Gia, whose own mum abandoned her when she was just 11, so when she died in 1980 the model was devastated. Though she often did cocaine in the bathroom stalls of Studio 54 and CBGB, Gia’s drug habit began spiralling. The drug trend at that time shifted to heroin, which brought coke users down when they were too high. Usually Gia snorted heroin, with the common understanding that people could only get addicted through needles – which was false. A generation of accidental junkies was born, of which Gia was a part. Anita Sarka, a DJ from former downtown NYC institution Mudd Club and friend of Gia told Vanity Fair: “In those days, everyone had this idea that being a junkie was very glamorous.”\n\n...AND WAS SOON OUT OF WORK Gia eventually started injecting and her habit became so bad that in one of her appointment books, she wrote (and misspelt) ‘Get Heroine’. Soon after, the track marks on her arms started showing in photos and only one photographer, Francesco Scavullo, requested her for work. During a particularly painful scene in Gia, Scavullo’s stylist says out loud, “What about that awful thing on her hand? It looks like a volcano,” while pointing at an abscess. Unsurprisingly, Gia’s career tanked. She garnered notoriety for scandalous stories like shooting up heroin in bathrooms during breaks, and on a Versace shoot with Richard Avedon she told everyone she was going out for cigarettes and never returned."}, {"url": "https://www.imdb.com/title/tt0123865/reviews", "page_content": "4 /10\n\nWarning: Spoilers\n\nThis film draws on an extreme true-life story that seems sure to make a person feel and think. In 1979, a rough, wild, pretty 19-year-old from a broken home leaves Philadelphia, where she works behind the counter at her father's Italian diner and hangs out in seedy nightclubs, for New York City. She becomes a phenomenal success almost overnight as an elite, new-wave, jet-set fashion model with \"attitude.\" She parties on the wild side, has a close, on-again-off-again lesbian relationship with a makeup artist, suddenly loses her agent/mentor to cancer, and heavily abuses harder and harder drugs, frequenting \"needle parks.\" Quickly, she burns out her body, relationships, and career. Reduced to trading sex for money, she is beaten up and raped. She is arrested for reckless driving and resisting arrest. She tries to make a career come-back and to go home. She sells jeans in a local shop. After repeated tries at rehabilitation, she either relapses or attempts a massive overdose. In seclusion in a hospital indigent ward, she dies in 1986 at 26 of the newly discovered AIDS.\n\n\n\nAngelina Jolie gives a raw, emotional performance, combining child-like and hard qualities. The generally well-acted main supporting characters are thin (especially the idealized, \"sweetness and light\" Elizabeth Mitchell character), at times hammy (Mercedes Ruehl), but have some basic believability and traits that play into the drama (Faye Dunaway, Ruehl coddling and pushing; Ruehl and Mitchell withdrawing for various reasons; Eric Cole as a decent but dim hometown pal). There are glimmers of poignancy in some interactions and details of the experiences. Probably the most effective moments are the model's relationship with the makeup artist and destructive drug use. The movie conveys (partly by fictionalizing and tightly limiting its snapshots of her life) a sense of frenzy, loneliness, and emptiness -- life in a dead zone.\n\n\n\nYet, the movie is startlingly unsatisfying on any but the most basic emotional level of watching the vivid, photogenic Jolie act out the fateful events, with flashes of striking visuals in recreated settings and with perhaps the invitation to viewers to project onto the screen whatever trite, preconceived notions they might want to see about emotional problems, exploitation, or addiction. The film seems to lack any point of view. It narrates through sketchy, spotty vignettes rather than thoughtfully examines. The movie lacks detail, context, depth, substance, and insight, the characters and events little more than a blur. It barely scratches the surface of her \"demons,\" how and why they came about, what was special about them, why they hit her so hard, and why drug abuse was her answer. (Regarding technique, scenes shift arbitrarily from color to black-and-white and back again, sometimes accented by heavy-handed music; they alternate with awkward, glib documentary-style \"interviews\"; and the long, distinctive chain-link-fence photo shoot and shower scenes, intended to be candid and uninhibited, are hampered by the stagey effort to avoid full frontal nudity, even in the extended, uncut version.)\n\n\n\nConsistent with statements in the film that \"No one knew Gia\" (including her), its treatment of her background, emotional problems, promiscuity (among a flurry of quick, slick throwaway lines at the start we are told, but never shown, that she \"slept around\" but sex \"was not the goal,\" \"was not an issue\"), overall relationships, lesbianism, drug addiction, and (strangely and especially) her modeling talent and career is vague, minimalist, and simplistic. Particularly weak or artificial are the statements mouthed by actors playing her contemporaries in the retrospectives; by the Italian photographer who spouts drivel as pious philosophy (\"This is life....\"); by the scornful, speechifying woman in the stilted, scripted rehab scene; and most disappointingly by the model herself and her \"journal\" (presented as poetic gems of meaning but falling far short of any such thing, even the message she wanted to send from her deathbed oddly off and easy, given her experiences: \"she wanted to tell kids, you can handle it, you can handle anything that comes your way\"). The movie does painfully little to delve beneath surface notions and manifestations and to illuminate any real understanding of this woman's situation, even less why she was a human being worthy of all of this special attention.\n\n\n\nAs a result, those reviews that claim to find profound meaning in this film are left to string together fuzzy, lofty-sounding clichés and platitudes (\"tragic\" \"lost soul\" or \"free spirit\" who \"lived in the moment\" and \"followed her instincts\"; \"too beautiful to die, too wild to live\"; \"America's first supermodel\") and to coast on the extreme, sensationalistic events of the model's life. Some make vast pretensions for the movie (that it itself does not make, much less deliver on), building up a heroine or martyr and sketching a morality play that blames everyone and everything else for what happened to her, while asking no hard questions about her own willful qualities and responsibility for her own behavior. The claims of deep meaning come across as shallow glorification of physical beauty, of tempestuousness, or of a glamorous, sensuous image for their own sake or as sheer sentimentality for a supposedly pathetic, helpless victim.\n\n\n\nIronically, all of the mindless emoting, adulation, even idolatry by those claiming to know, admire, or adore this woman through this essentially superficial movie -- just as surely as her supposed exploitation in her chosen career -- risks again reducing her, now in death, to a flat, one-dimensional, token figure being grabbed at by the masses (as fallen physical beauty, force of nature, glossy image, or victim). And if that does not diminish her, it may merely lavish undeserved attention and acclaim on a person of little or no substance (mired in what is presented as near-total confusion about who she was, what she wanted, and what she cared about, combined with non-stop destructive, thrill-seeking, instant-gratification behavior). The hollowness at the core of this film, of its subject, and of so much of this site's commentary about it is as troubling as the events depicted."}, {"url": "https://www.nytimes.com/1998/01/25/tv/cover-story-a-chic-heroine-but-not-a-pretty-story.html", "page_content": "John Matoian, the president of HBO Pictures and HBO NYC Productions, said he was not worried about hiring a first-time director. ''Michael's work has always been deeply thoughtful,'' said Mr. Matoian. ''I had the sense, when I met him, that he understood what we wanted to do, and he had no intent of glamorizing or homogenizing it. He kept the edge, and the darkness.''\n\nThough Gia's story has been told before, in a book, ''Thing of Beauty: The Tragedy of Supermodel Gia,'' by Stephen Fried, HBO did not acquire the rights. Instead, the HBO film is based upon news accounts of her life, recent interviews with people who knew her and the journals Gia kept as a girl and a young woman.\n\n''The story is perfect for HBO in every way,'' said Mr. Matoian, who once led the film development department at CBS. ''Network television could never have touched it, because it is so fraught with taboo subjects the networks can't handle. And theatrical motion pictures, while they do attempt to do these subjects, they might wonder, with such a tragic ending, if the story is commercially viable.''\n\nIf HBO was not nervous about Gia, the actress who played her was, at least at first. Ms. Jolie had already made six films and two television mini-series, including TNT's ''George Wallace,'' for which she won a Golden Globe award and a Cable ACE nomination. ''When I read the script I had lots of reasons for not wanting to do it,'' said Ms. Jolie. ''I didn't trust that they would deal with drugs and AIDS in the right way. I was worried that they were going to make it a pretty story.''\n\nHer hesitation also came from her own experience with the modeling industry. ''I tried modeling when I was 14 and failed miserably,'' she said. ''Like Gia, I was a bit of a dirty punk, but it was interesting to clean up and start feeling like a girl. I was told I had all these problems I needed to fix. I was told to lose weight, and I was thin already. They actually put me in a room in a bathing suit and measured every part of me. I felt terrible.''\n\nBut a five hour-meeting with Mr. Cristofer in which they discussed ''every aspect of the script'' eased her fears, Ms. Jolie said. Working with Mercedes Ruehl, who plays Gia's mother, Kathleen, and Faye Dunaway, who plays Wilhelmina, the head of a leading modeling agency, was another attraction. ''I felt we were coming from the same place,'' she said. ''The more we read about Gia, the more we felt for her, and fell in love with her. I think she needed so much, and was so full of life, of fire, so emotional, brave and crazy, that she didn't, in her heart, mean to upset and hurt people.''\n\nAfter filming was completed, both Mr. Cristofer and Ms. Jolie found themselves changed. Ms. Jolie decided to give up acting for a few months to enroll in directing and screenwriting courses at New York University. ''It was such a heavy story,'' she said, adding, ''Knowing what I know now, I would not do heroin now.'' Mr. Cristofer has decided to pursue more work behind the camera. ''Screenwriters can make a good living working on projects that will ultimately never get made,'' he said. ''Years go by and you start to feel like you are running out of time.'' His next job, pending final approval from Warner Brothers, is to direct Michelle Pfeiffer in his adaptation of a Cornell Woolrich novel. ''One thing I've learned making Gia is people are always walking around taking pictures of you at work,'' he said, laughing. ''I always wondered why directors looked so terrible on the set until I became one. Next time I'm wearing a hat and black clothes.''"}, {"url": "https://www.goodreads.com/book/show/471486.Thing_of_Beauty", "page_content": "Now most of us know\n\nlate\n\nSupermodel Gia Marie Carangi's life was a Rollercoaster ride full\n\nof sensuality and beauty. But that was only half of it and\n\nit's\n\nShocking how it\n\nended in such terribly horrific circumstances, Gia being one of the first woman on record to die of the AID's virus at on twenty six years old.\n\n\n\nThe Author Stephen Fried clearly\n\ndid his\n\nhomework to put this Autobiography together to give the reader an inside look at the trials and tribulations of this very special and beautiful woman, who endured such unfairness from this world and saw nothing beautiful in herself, yet touched the lives of so many people. The only complaint I have about this book is that it was about a hundred pages too long. But despite that Fried wrote Gia very honestly and for the person she really was and not what everybody made her out to be. She wasn't this \"big ole lesbian junkie\" she was just a girl looking for love in all the wrong places. Fried not only takes us into the life of Gia Marie Carangi...but\n\nthe\n\nlifestyle, people and\n\nworld that surrounded her and shows us the best and worst parts of her flamboyant existence.\n\n\n\nWe will get a\n\nchance to see things not through Gia's perspective\n\nbut through the people who knew Gia or at least knew of her. Other models, makeup Artist, hairdressers, photographers and fashion designers. As well as co workers, friends, family\n\nmembers in interviews and articles ect. The ones who crossed paths with Gia in life and can recall her and her Career in one of the most shallow, narcissistic and\n\ncut throat, dog eat dog industries on the planet...high fashion modelling! Stepping into a huge pot of luck, Gia changed the standard of what was considered beautiful for that time and era when the Blonde haired and blue eyed Barbie doll image that mostly dominated the industry.\n\n\n\n\n\nHer dark Italian and melancholy look is what set her apart from the rest and made her stand out. This gave her the title \"Supermodel\" and\n\nalso the nickname \"Shooting Star\" as Gia was gracing the covers of Vogue and Cosmopolitan. And once you make\n\nit big, you become a member of an exclusive\n\ninternational club, where the sun always shines, the parties are forever glowing; a land where there’s no\n\nugliness, no sickness, no\n\npoverty; where all you're wildest dreams will come true and\n\neveryone is certified \"BEAUTIFUL!\", Gia could have had it all....she certainly had the talent that required for it. Gia had a free ride to the high life.\n\n\n\n\n\nAnd she f*cking blew it as she let her inner Demons consume her.\n\nThe fast\n\nlane wasn't enough....she loved the Herione needle\n\nmore.\n\n\n\nI strongly believe all of the Drugs and even Alcohol abuse was a substitute for her\n\nmother's\n\nlove, attention and overall acceptance she so deeply craved...but was only given to\n\nher in\n\nsmall amounts throughout her life. Gia's mother Kathleen was a very selfish woman. Who neglected her own children and was ultimately cold blooded and uncaring. And what Gia didn't\n\nknow\n\nabout that glittering\n\nworld of the wealthy and trendy she got herself\n\ninto was\n\nwhen it came down to it...they didn't care\n\nabout you and what troubles you had or what you\n\nwere going through emotionally. They only loved\n\nyou\n\nwhen you\n\nwere smiling.\n\nGia was all alone in that world...that was her\n\nreality.\n\n\n\nNow rather one chooses to feel\n\nsorry\n\nfor\n\nGia or not she brought most of her problems and demise\n\nupon\n\nherself due to the poor and\n\nstupid decisions she made...her reckless behavior got so bad and out of control to the point she finally got herself Blacklisted from the fashion world entirely. And when Gia tried to straighten up her act and make a comeback, fate had another plan for her as Gia's chance to reach and grab the shooting star of her dreams was lost. There was no fairy tale ending for her. Having her last photo shoot for Cosmopolitan in 1983 and dying of AID's related complications in 1986. And with absolutely no one from the fashion industry attending the funeral, showing just how insignificant a model can become no matter how \"Super\".\n\n\n\nBeauty, money, glamour and fame can't buy true happiness in the long run, Gia's definitely couldn't. And you certainly won't find any of the answers to your problems in life through all of the Drugs and partying....and for Gia she tragically found that out the hard way as it cost her her very own life. Which was hot, wild and short...like the flame of a burning fuse. That's how she lived it. And despite her self destructive ways...she was and is a legend. For Cindy Crawford was called \"Baby Gia\" when she first began working in the same industry. So to all you Crawford fans out there: Cindy wouldn't be were she is today if it wasn't for Gia.\n\n\n\n'Thing of Beauty' was a Cinderella fairytale that ended in a total tragic nightmare. But definitely was worth the read and definitely worth the ride. In the end it didn't matter how beautiful Gia was because her beauty was her curse. When I finished the book I felt haunted and couldn't get Gia off my mind for days. I still think about her sometimes and all of the potential that sadly died with her. 5 STARS!"}, {"url": "https://timenote.info/en/Gia-Carangi", "page_content": "Gia Marie Carangi (January 29, 1960 – November 18, 1986) was an American fashion model during the late 1970s and early 1980s. Carangi is considered by some to be the first supermodel, although that title has been applied to others, including Janice Dickinson, Dorian Leigh, and Jean Shrimpton. Model Cindy Crawford was later referred to as \"Baby Gia\" due to her resemblance to Carangi.\n\nCarangi was featured on the cover of fashion magazines, including the April 1979 edition of British Vogue, the April 1979 and August 1980 editions of Vogue Paris, the August 1980 edition of American Vogue, the January 1981 edition of Vogue Italia, and several issues of Cosmopolitan between 1979 and 1982.\n\nAfter she became addicted to heroin, Carangi's modeling career rapidly declined. She later contracted HIV, which suddenly claimed her life at the age of 26. Her death was not widely publicized and few people in the fashion industry knew of it. Carangi is thought to be one of the first famous women to die of AIDS. Gia, a biographical film starring Angelina Jolie, debuted on HBO in 1998.\n\nEarly life\n\nCarangi was born in Philadelphia, Pennsylvania. She was the third and youngest child of Joseph, a restaurant owner, and Kathleen (née Adams) Carangi, a homemaker. She had two older brothers. Her father is Italian, and her mother is of Irish and Welsh ancestry. Joseph and Kathleen had an unstable, violent marriage leading Kathleen to ultimately abandoning the family when Carangi was eleven years old. Those who knew her blamed her \"fractured childhood\" for the instability and drug-dependence that plagued her adult life. She was described as \"needy and manipulative\" by relatives who recalled her as spoiled and shy as a child and a \"mommy’s girl\" who did not receive the motherly attention that she desired.\n\nIn her adolescent years, Carangi found the attention she sought from other teenage girls, befriending them by sending flowers. While attending Abraham Lincoln High School, Carangi bonded with \"the Bowie kids\", a group of obsessive David Bowie fans who emulated Bowie's \"defiantly weird, high-glam\" style. Carangi was drawn to Bowie for his fashion preferences and his ambiguous gender play and outspoken bisexuality. A friend of Carangi described her \"tomboy persona,\" describing her relaxed openness about her sexuality as reminiscent of the character Cay in the 1985 film Desert Hearts. Carangi and her \"bi-try Bowie-mad\" friends hung out in Philadelphia’s gay clubs and bars. Though she associated with the lesbian community, she did not want to take up \"the accepted lesbian style\".\n\nCareer\n\nSuccess\n\nCarangi was most known in modeling circles by only her first name. After being featured in Philadelphia newspaper ads, Carangi moved to New York City at the age of 17, where she quickly rose to prominence. She was a favorite model of various fashion photographers, including Francesco Scavullo, Arthur Elgort, Joseph Petrellis, Richard Avedon, Denis Piel, Marco Glaviano, and Chris von Wangenheim.\n\nWell-integrated within the fashion world, Carangi had the selection of several photographers, most notably Scavullo. By the end of 1978, Carangi was already a well-established model. In a 20/20 interview, she said her rise was \"very fast\" and \"I started working with well-known people in the industry, very quickly. I didn't build into a model. I just sort of became one.\"\n\nCarangi was a regular at Studio 54 and the Mudd Club. She usually used cocaine in clubs, but later developed a heroin addiction.\n\nIn October 1978, Carangi did her first major shoot with top fashion photographer Chris von Wangenheim. Wangenheim had her pose nude behind a chain-link fence with makeup assistant Sandy Linter. Carangi immediately became infatuated with Linter and started to pursue her, though the relationship never became stable.\n\nDrug abuse and career decline\n\nOn March 1, 1980, Carangi's agent and mentor, Wilhelmina Cooper, died of lung cancer. Devastated, Carangi started abusing drugs. Scavullo recalled a fashion shoot in the Caribbean when \"She was crying, she couldn't find her drugs. I literally had to lay her down on her bed until she fell asleep.\" Her addiction soon began to affect her work. Carangi began having violent temper tantrums, walking out of photo shoots to buy drugs, and began falling asleep in front of the camera. During one of her final location shoots for Vogue, Carangi had visible red bumps in the crooks of her elbows where she had injected heroin. The photos were airbrushed and eventually ran in the November 1980 issue of Vogue, but some photos reportedly still showed visible needle marks.\n\nBy November 1980, Carangi's career was in a steep decline. Modeling offers soon ceased and her fashion industry friends, including Sandy Linter, refused to speak to her fearing their association with her would harm their careers. She briefly signed with Ford Models \"for a couple of weeks\", but was soon dropped. In an attempt to quit drugs, she moved back to Philadelphia with her mother and step-father in February 1981.\n\nRetirement and attempted comeback\n\nAfter moving to Philadelphia, Carnagi went through a 21-day detox program. Her sobriety however was short-lived and she was arrested in March 1981 after she drove into a fence in a suburban neighborhood and took off. After a chase with police, she was taken into custody where it was later determined she was under the influence of alcohol and cocaine. After her release, Carangi briefly signed with a new agency, Legends. She worked sporadically, mainly in Europe.\n\nIn fall 1981, Carangi was in the throes of drug abuse. Despite this, she was still determined to make a comeback in the fashion industry and signed with Elite Model Management. While some clients were refused to work with her, other clients were willing to take a chance because of her past status as a top model. One of her first jobs was for Francesco Scavullo who photographed her for Cosmopolitan. Scavullo convinced the magazine's editors to use the shot for its April 1982 cover. Sean Byrnes, Scavullo's long-time assistant later said, \"What she was doing to herself finally became apparent in her pictures. [...] I could see the change in her beauty. There was an emptiness in her eyes.\" The Cosmo cover would be her last.\n\nDuring this time, Carangi mainly worked with photographer Albert Watson and got jobs modeling for department stores and catalogs. In April 1982, Richard Avedon hired her for the 1982 Versace campaign which lead to her being hired for the Spring 1983 campaign. She then modeled for German mail-order clothing company Otto Versand. Around this time, Carangi enrolled in an outpatient methadone program but soon began using heroin again. During a photo shoot for the Spring 1983 Versace campaign shot in the fall of 1982, Carangi became uncomfortable and left the shoot before any usable shots of her were taken. By the end of 1982, she had only a few clients that were willing to hire her. Carangi's final photo shoot was for Otto Versand in Tunisia. She was sent home during the shoot for using heroin. She left New York for the final time in Spring 1983.\n\nLater years\n\nCarangi spent her remaining years living with various lovers, friends and family members in Philadelphia and Atlantic City. She was admitted to an intense drug treatment program at Eageville Hospital in December 1984. After treatment, she got a job in a clothing store which she eventually quit. She later got a job as a checkout clerk and then worked in the cafeteria of a nursing home. By the winter of 1985, Carangi began using drugs again. In June 1986, she was admitted to Warminster General Hospital in Warminster, Pennsylvania with bilateral pneumonia. A few days later, she was diagnosed with AIDS-related complex.\n\nDeath\n\nOn October 18, 1986, Carangi was admitted to Hahnemann University Hospital. She died of AIDS-related complications on November 18, 1986. Her funeral was held on November 23 at a small funeral home in Philadelphia. No one from the fashion world attended, mainly because no one knew about her death until months after she had died. However, weeks later, Francesco Scavullo, Carangi's friend and confidant, sent a Mass card when he heard the news.\n\nLegacy\n\nA biography of Carangi by Stephen Fried called Thing of Beauty (the title of John Keats' famous poem) was published in 1993. A biographical film, Gia, debuted on HBO in 1998. Angelina Jolie starred in the title role, garnering a Golden Globe award for the role.\n\nIn 1996, actress-screenwriter Zoë Tamerlis, herself a heroin addict who died of drug-related causes in 1999, was commissioned to write a screenplay based upon Carangi's life. This version of Gia was not produced, but after Tamerlis' death, footage of Carangi, Tamerlis, photographers, Carangi's family, and Sandy Linter discussing her life was incorporated into a 2003 documentary entitled The Self-Destruction of Gia.\n\nCarangi's sexual orientation has been disputed after her death; LGBT outlets label her lesbian, and other times as bisexual due to her sexual relationships with men. In the film Gia, Jolie also portrayed her as being sexually intimate with men and women. Since Carangi's death, she has been considered a lesbian supermodel and icon.\n\nDesigners and cosmetic firms represented"}, {"url": "https://ew.com/article/1998/01/16/hbos-gia-starring-angelina-jolie-breaks-taboos-about-drugs-and-sex/", "page_content": "Gia Show More About Gia type TV Show\n\nHeroin addiction. Lesbianism. Bad ’80s fashion. If ever a life was primed for deconstruction in the latter half of the ’90s, it’s that of Gia, the gay supermodel whose bad girl beauty, sexual bravado, and scandalous behavior provided the blueprint for Heroin Chic before her death of AIDS in 1986. And if ever a network was tailor-made to tackle it, it’s HBO, the envelope-pushing capital of the small screen.\n\nThen again, it is still TV, and we are talking explicit male and female nudity, intravenous drug use, and same-sex lovemaking. ”I’m a little surprised that HBO is doing it,” says executive producer Marvin Worth—no stranger to provocative material (Lenny, The Rose, Malcolm X). ”But at the same time, the love scenes are really tender and not gratuitous.”\n\nHBO Pictures president John Matoian credits this sort of high-quality raciness for helping to separate his Emmy-glomming channel from the rest of the rapidly expanding cable universe. ”There’s no secret to the fact that we need to be distinctive,” he says. ”But what I love about Gia is that it’s tackling an edgy subject matter that’s also slightly more female skewing, which has not necessarily been the traditional HBO audience or movie.”\n\nThe cable channel isn’t the only media outlet banking on Gia and ’80s nostalgia. Paramount Pictures has purchased the rights to Stephen Fried’s 1993 biography Thing of Beauty: The Tragedy of Supermodel Gia (Robin Swicord, screenwriter of Little Women, has been mentioned to possibly write and direct). HBO chose Bright Lights, Big City author Jay McInerney—no stranger to the excesses of the last decade—to develop its story, which is based on interviews with Gia’s former friends and associates, in addition to portions of the model’s journals.\n\nWhere Gia differs from recent HBO shock-fests (the gritty prison series Oz; the raucously brilliant Don King: Only in America) is in its more cautionary approach. HBO okayed the $8 million project around the same time President Clinton and antidrug groups went after the fashion industry for selling products to teenagers via glassy-eyed, emaciated models (dubbed Heroin Chic by the press). The challenge—which fell to director Michael Cristofer, the Pulitzer Prize- and Tony award-winning author of The Shadow Box—was in telling the story without turning it into a heavy-handed morality play.\n\nCristofer (who rewrote McInerney’s original script) believes the problem was solved by refusing to make Gia a victim; rather, she is presented as both complex and contradictory. ”I don’t think that happens anymore in film, or theater, or even in books,” he says. ”Everybody wants simple stories with obvious rights and wrongs. But people are inexplicable, and even a Shakespeare would have a difficult time with [Gia].”\n\nImagine, though, what the Bard would have made of her life. Born Gia Marie Carangi in a working-class section of Philadelphia, she was discovered as a teenager in the late ’70s, eventually moving to New York City and signing with the Wilhelmina modeling agency (Faye Dunaway costars as the agency founder and namesake). Her exotic looks and brash sexuality—a stark contrast to the wholesome blonds then stalking runways—quickly made her the darling of top photographers like Francesco Scavullo and Chris von Wangenheim. With Gia, says one character in the HBO movie, ”it was always about sex—every look, every move, every minute, every day.”"}, {"url": "https://www.fanpop.com/clubs/gia-carangi/videos/5280272/title/gia-carangi-story-part-2", "page_content": "3\n\nSELF DESTRUCTION OF TWO added by oneshyguy46\n\nSELF DESTRUCTION OF TWO"}, {"url": "https://www.geni.com/people/Gia-Carangi/6000000182703070844", "page_content": "About Gia Carangi\n\nhttps://en.wikipedia.org/wiki/Gia_Carangi\n\nGia Marie Carangi (January 29, 1960 – November 18, 1986) was an American model, considered by many to be the first woman to be titled as supermodel. She was featured on the cover of fashion magazines, including multiple editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.\n\nAfter she became addicted to heroin, Carangi's modeling career rapidly declined. At age 26 she died of AIDS-related complications, believed to have contracted the disease from a contaminated needle, becoming one of the first famous women to die of the disease. Her life was dramatized in the television film Gia, starring Angelina Jolie, which debuted on HBO in 1998."}, {"url": "https://www.celebsagewiki.com/gia-carangi", "page_content": "Age, Biography and Wiki\n\nGia Carangi (Gia Marie Carangi) was born on 29 January, 1960 in Philadelphia, Pennsylvania, United States, is an American model. Discover Gia Carangi's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 26 years old?\n\nPopular As Gia Marie Carangi Occupation Model Age 26 years old Zodiac Sign Aquarius Born 29 January 1960 Birthday 29 January Birthplace Philadelphia, Pennsylvania, United States Date of death November 18, 1986, Died Place Philadelphia, Pennsylvania, United States Nationality American\n\nWe recommend you to check the complete list of Famous People born on 29 January. She is a member of famous Model with the age 26 years old group.\n\nGia Carangi Height, Weight & Measurements\n\nAt 26 years old, Gia Carangi height is 173 cm .\n\nPhysical Status Height 173 cm Weight Not Available Body Measurements Not Available Eye Color Brown Hair Color Brown\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nGia Carangi Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Gia Carangi worth at the age of 26 years old? Gia Carangi’s income source is mostly from being a successful Model. She is from American. We have estimated Gia Carangi's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Model\n\nGia Carangi Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Gia Carangi Wikipedia Imdb\n\nTimeline"}]}