{"After retiring from the NBA, Stan Heal coached the Detroit Pistons for two seasons.": [{"url": "https://www.clickondetroit.com/sports/2021/02/05/where-are-they-now-2004-detroit-pistons-championship-team/", "page_content": "AUBURN HILLS, MI - JUNE 15: Ben Wallace #3 (C) of the Detroit Pistons holds up the Larry O'Brien NBA Championship trophy as he celebrates with teammatesafter defeating the Los Angeles Lakers 100-87 in game five of the 2004 NBA Finals on June 15, 2004 at The Palace of Auburn Hills in Auburn Hills, Michigan. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Tom Pidgeon/Getty Images)\n\nThis article first appeared in the Pistons Pivot Newsletter, a periodical newsletter for Pistons fans with breaking news, analysis and more. Sign up for it here, or by using the form below.\n\nWelcome to the Pistons Pivot Newsletter, our newest ClickOnDetroit offering for Pistons fans!\n\nI’m Ken. I write a bunch of newsletters here at ClickOnDetroit, but I’m an avid basketball fan. So this will be a little extra special for me. We’ll send this periodically with some breaking news, analysis -- maybe a rant or two. If this is something you’d enjoy, welcome aboard! If not, you can manage your subscription right here.\n\n🏆 Catching up with 2004 Pistons\n\nFor me, my biggest Detroit Pistons team is the 2004 championship squad. I know, the Bad Boys were amazing and I know all about them -- don’t you worry. But I didn’t get to watch them as they were winning.\n\nSo, the nostalgia takes me to the Ben Wallace, Chauncey Billups, Richard Hamilton era of Pistons basketball, commonly known as the “Going to Work” era, a product of the Bad Boys Pistons era.\n\nI often end up going down a rabbit hole with athletes, wondering what happened to them, where they ended up, and so on. So, I figured, let’s take a look: Where are key members of the 2004 Pistons team now?"}, {"url": "https://www.espn.com/nba/story/_/id/23433859/detroit-pistons-stan-van-gundy-part-ways-four-seasons", "page_content": "ESPN's Adrian Wojnarowski reports that the Pistons are looking to split the dual coach and front-office roles former coach Stan Van Gundy had. (1:02)\n\nThe Detroit Pistons and Stan Van Gundy, their president of basketball operations and head coach, have parted ways after the team failed to make the playoffs for the second consecutive season.\n\nVan Gundy met with Pistons officials on Monday afternoon, league sources said.\n\n\"We have decided that this change is necessary to take our basketball organization to the next level,\" Pistons owner Tom Gores said in a statement. \"This was a very difficult decision and we did not come to it lightly. I am grateful to Stan for everything he's done for the Pistons and for the City of Detroit. He rebuilt the culture of our basketball team, re-instilled a winning attitude and work ethic, and took us to the playoffs two years ago. He went all-in from day one to positively impact this franchise and this community.\"\n\nVan Gundy had full authority on player personnel and staffing, but Gores had suggested changes -- including ones related to general manager Jeff Bower -- that Van Gundy resisted, sources said.\n\nBower will continue to operate as the GM, league sources said. He is expected to lead Detroit's contingent at the draft combine in Chicago next week and oversee the team's individual draft workouts and draft planning. The rest of the front-office staff is expected to continue, too -- until further notice. Most of Detroit's front-office contracts expire this summer.\n\nOne candidate expected to be strongly considered for a role in a revamped Pistons front office is Brent Barry, sources told ESPN.\n\nThe Golden State Warriors attempted to hire Barry in a scouting position last summer but ran into complications because of his ongoing TV commitments, league sources told ESPN's Zach Lowe. The two sides even discussed a potential part-time arrangement that would have allowed Barry to fulfill his TNT duties, with the understanding he would come to Golden State full time upon the expiration of his TV contract, but the talks fell through, sources told Lowe.\n\nBarry isn't expected to be a candidate to oversee the Pistons' basketball operations but rather play a complementary role in learning the front-office business, league sources said. Gores and chairman Arn Tellem are expected to try to hire an experienced league executive to oversee the front office.\n\nTellem, a longtime agent in the NBA, will not become the president of basketball operations or general manager, but he could have an expanded role beyond the business side, sources said.\n\nVan Gundy and Gores had been talking about a way to move forward together for two weeks, and much of that discussion had centered on the future role of Bower, league sources said.\n\nBower, whom Van Gundy hired and trusted to run the day-to-day operations of his front office, met separately with Gores last week, league sources said. Bower is in the final year of his contract.\n\nVan Gundy had one year and $7 million left on his original five-year deal, but most of his front-office and coaching staff were in the final year of their contracts.\n\n\"Stan is a competitor and he wanted to finish the job,\" Gores said. \"He retooled a roster that we think can be very competitive in the East. I know he's disappointed, and that he cares deeply about his players, his staff, this organization and this city. He's also a professional who will make sure this is a seamless transition, and someone I hope will be a friend and adviser to me long after this transition is completed.\"\n\nVan Gundy and Bower engineered the Blake Griffin trade in January, but the Pistons played without starting point guard Reggie Jackson and Griffin because of injury for much of the final stretch of a 39-43 season. Together, Griffin and Jackson were 8-4. With Jackson in the lineup, the Pistons were 27-18 on the season.\n\nThe Pistons missed the playoffs for the second consecutive season after earning the eighth seed and losing to the Cleveland Cavaliers in the opening round of the 2015-16 Eastern Conference playoffs, Van Gundy's second year on the job.\n\nVan Gundy and Bower had inherited a floundering franchise in need of an overhaul, and the Pistons improved from 32 to 44 victories and a playoff berth that year.\n\nVan Gundy has missed the postseason in three of his four years on the job, although the franchise could be positioned for a return to the playoffs with a healthy roster next season.\n\nHe has also coached Miami and Orlando, posting a 523-384 career record."}, {"url": "https://www.espn.com.au/nba/story/_/id/23433859/detroit-pistons-stan-van-gundy-part-ways-four-seasons", "page_content": "ESPN's Adrian Wojnarowski reports that the Pistons are looking to split the dual coach and front-office roles former coach Stan Van Gundy had. (1:02)\n\nThe Detroit Pistons and Stan Van Gundy, their president of basketball operations and head coach, have parted ways after the team failed to make the playoffs for the second consecutive season.\n\nVan Gundy met with Pistons officials on Monday afternoon, league sources said.\n\n\"We have decided that this change is necessary to take our basketball organization to the next level,\" Pistons owner Tom Gores said in a statement. \"This was a very difficult decision and we did not come to it lightly. I am grateful to Stan for everything he's done for the Pistons and for the City of Detroit. He rebuilt the culture of our basketball team, re-instilled a winning attitude and work ethic, and took us to the playoffs two years ago. He went all-in from day one to positively impact this franchise and this community.\"\n\nVan Gundy had full authority on player personnel and staffing, but Gores had suggested changes -- including ones related to general manager Jeff Bower -- that Van Gundy resisted, sources said.\n\nBower will continue to operate as the GM, league sources said. He is expected to lead Detroit's contingent at the draft combine in Chicago next week and oversee the team's individual draft workouts and draft planning. The rest of the front-office staff is expected to continue, too -- until further notice. Most of Detroit's front-office contracts expire this summer.\n\nOne candidate expected to be strongly considered for a role in a revamped Pistons front office is Brent Barry, sources told ESPN.\n\nThe Golden State Warriors attempted to hire Barry in a scouting position last summer but ran into complications because of his ongoing TV commitments, league sources told ESPN's Zach Lowe. The two sides even discussed a potential part-time arrangement that would have allowed Barry to fulfill his TNT duties, with the understanding he would come to Golden State full time upon the expiration of his TV contract, but the talks fell through, sources told Lowe.\n\nBarry isn't expected to be a candidate to oversee the Pistons' basketball operations but rather play a complementary role in learning the front-office business, league sources said. Gores and chairman Arn Tellem are expected to try to hire an experienced league executive to oversee the front office.\n\nTellem, a longtime agent in the NBA, will not become the president of basketball operations or general manager, but he could have an expanded role beyond the business side, sources said.\n\nVan Gundy and Gores had been talking about a way to move forward together for two weeks, and much of that discussion had centered on the future role of Bower, league sources said.\n\nBower, whom Van Gundy hired and trusted to run the day-to-day operations of his front office, met separately with Gores last week, league sources said. Bower is in the final year of his contract.\n\nVan Gundy had one year and $7 million left on his original five-year deal, but most of his front-office and coaching staff were in the final year of their contracts.\n\n\"Stan is a competitor and he wanted to finish the job,\" Gores said. \"He retooled a roster that we think can be very competitive in the East. I know he's disappointed, and that he cares deeply about his players, his staff, this organization and this city. He's also a professional who will make sure this is a seamless transition, and someone I hope will be a friend and adviser to me long after this transition is completed.\"\n\nVan Gundy and Bower engineered the Blake Griffin trade in January, but the Pistons played without starting point guard Reggie Jackson and Griffin because of injury for much of the final stretch of a 39-43 season. Together, Griffin and Jackson were 8-4. With Jackson in the lineup, the Pistons were 27-18 on the season.\n\nThe Pistons missed the playoffs for the second consecutive season after earning the eighth seed and losing to the Cleveland Cavaliers in the opening round of the 2015-16 Eastern Conference playoffs, Van Gundy's second year on the job.\n\nVan Gundy and Bower had inherited a floundering franchise in need of an overhaul, and the Pistons improved from 32 to 44 victories and a playoff berth that year.\n\nVan Gundy has missed the postseason in three of his four years on the job, although the franchise could be positioned for a return to the playoffs with a healthy roster next season.\n\nHe has also coached Miami and Orlando, posting a 523-384 career record."}, {"url": "https://theathletic.com/3393127/2022/07/03/pistons-summer-league-brink/", "page_content": "The duties bound with life in the shadows of an NBA organization were starting to wear on Jordan Brink.\n\nSunset was transitioning into sunrise before Brink’s head could touch his pillow. The stimulation from hours of staring at a computer screen, clipping various sets, actions and tendencies of rival teams wouldn’t allow his mind to shut basketball off. The anxiety that comes with pleasing your superiors — which, in this case, are NBA coaches with a lot on the line — regularly bubbled.\n\nAdvertisement\n\nLast year, Brink, who has been part of the Detroit Pistons organization in various roles since 2014, needed to take a step back. He was burnt out. Family events often took place with him tuning in via FaceTime. He had to hear about the memories his friends created secondhand. It’s often the cost of choosing such a profession, which comes with a 24/7 lifestyle that outsiders struggle to comprehend.\n\nOne day, Brink enjoyed what he was doing. Loved it. The next, he wondered if it was time to finally put his business degree to use. The light at the end of the tunnel constantly fluttered.\n\nBrink had a decision to make.\n\n“I think anytime you’re pursuing a dream there are high and lows, as well as moments of clarity where you feel like this is what you should be doing and moments when you have doubt and realize you’re sacrificing so much and not seeing the light at the end of the tunnel,” Brink told The Athletic. “I have a unique route because, last season, my last season of being a head video guy, I reached burnout. I hit the wall. I thought I was going to get out of basketball.”\n\nAfter years in the Pistons’ video room, working for two different Detroit head coaches, the 30-year-old Brink has spent the last year in his new role as player-development coach, a job he cherishes. He’s tasked with preparing the Pistons’ young core for success on and off the court. This summer, Casey added an additional role for Brink: coach of Detroit’s Summer League team.\n\nThe Pistons aren’t taking their stint in Las Vegas lightly. Last year’s No. 1 pick Cade Cunningham is on the roster. Third-year players Saddiq Bey, Isaiah Stewart and Killian Hayes, too. Potentially three starters once the NBA regular season begins will be taking part in NBA Summer League. The rebuilding franchise is in the midst of, arguably, its most critical summer in recent history. The development of its young talent will determine the organization’s success over the next decade. Casey enlisted Brink to help set the tone for the next year, a season resembling a college-like atmosphere for the Pistons’ young core, filled with an emphasis on individual development and team bonding as the organization tries to climb its way back to relevancy.\n\nAdvertisement\n\nFor Brink, this opportunity is a far cry from where he was just a year ago.\n\n“It definitely was special to me (to be named Summer League coach) because of where I was a year and a half ago,” Brink said. “I was at a very low point. For me, it’s more a culmination of all my experiences and relationships I’ve made over the last six, seven years in the NBA. It’s a full-circle moment. Honestly, for me, it’s a big honor because of the people, players and coaches we have with the Pistons … they’re all hard-working and high character. To be able to represent our organization and this group of people, it’s special to me. We have high-character people and players. To be asked to represent that, it’s the biggest honor.”\n\nThe role of player-development coach is what Brink always envisioned himself doing if he were to ever get into coaching.\n\nThroughout high school, the South Holland, Ill., native would make the 30-minute trek north to Chicago every day in the summers to volunteer at ATTACK Athletics, a gym founded by famous basketball trainer Tim Grover, who trained the likes of Michael Jordan and Kobe Bryant. There, Brink helped work out NBA and college players all while still focusing on his goal of playing college basketball. Even at this time, though, despite being surrounded by numerous current NBA assistant coaches and other basketball big shots, Brink still didn’t aspire to be a coach. Basketball was just what he loved to do. He consumed it. The opportunity with Grover not only allowed him to be around some of the game’s greatest minds, but also enabled him to use the gym in the mornings to get a workout in himself. A win-win situation.\n\nJordan Brink (standing up) during a Pistons’ road game this season. (Photo courtesy of the Detroit Pistons)\n\nAfter high school, Brink went on to play collegiately at Calvin University (2010-15), a Division III school in Grand Rapids, Mich. It was at Calvin that he started to consider getting into coaching. During his senior year, Brink took 12 credits in the fall and just one credit in the spring to remain eligible to play. That same year, the Springfield Armor of the NBA G League had been purchased by the SSJ Group and was relocated to Grand Rapids and re-branded as the Grand Rapids Drive. The Pistons made the Drive their minor-league affiliate. The pro basketball team was practicing at Calvin University that first season while Brink was finishing up his collegiate career. While doing that, Brink volunteered to help out for the Drive during practices. His duties were things like running the shot clock, scrubbing sweat off the floor and being an extra body in drills.\n\nAdvertisement\n\nThe gruntiest of grunt work.\n\n“I treated it as a job,” Brink said.\n\nHe did not escape the Pistons’ notice. Front office members at the time — Pat Garrity, Andrew Loomis and Jeff Bower — regularly visited Grand Rapids to keep an eye on some of the young prospects in Detroit’s organization. Brink’s hard work and playing background caught their eye on these visits. After graduating, Brink was offered a summer internship in the Pistons’ front office by Garrity.\n\n“He’s never been afraid of putting the work in, even if there’s no glory,” Brink’s college coach, Kevin Vande Streek, told The Athletic. “And he got plenty of glory. He was a great player in college, an All-American. He hit many game-winning shots that people will never forget. However, he put the work in when people weren’t there. No one saw it. All the behind-the-scenes stuff with his teammates. Him embracing the grind isn’t surprising to me. If he has a goal in mind, he’s willing to do what it takes to get there.”\n\nBy the end of the summer of 2015, after months of helping the Pistons prepare for the draft, participating in workouts and taking on other responsibilities, Brink was presented another opportunity by Detroit. Head coach and team president Stan Van Gundy took a liking to the 23-year-old’s work ethic and offered him a position as a video intern for the following NBA season. Brink had a decision to make, as he was also sitting on an offer to go to Michigan State’s basketball program to work as a graduate assistant under Tom Izzo. The appeal of the NBA game interested Brink more.\n\nIn the NBA world, life as a video intern is as grueling as it gets. It comes with enormous responsibility, late nights and early hours. There’s seclusion. Attention to detail must be sharp. Imposter’s Syndrome, naturally, kicks in. Miami Heat head coach Erik Spoelstra is the most famous NBA head coach to rise from the lowly ranks of the video room. Sacramento Kings head coach Mike Brown and Milwaukee Bucks head coach Mike Budenholzer are two other current head coaches who took this route. There aren’t many. It takes a certain type of dedication to see a journey with this starting point through.\n\nAs video intern, Brink had duties such as chopping up opposing teams’ game film for coaches to scout. While the Pistons were playing at home, Brink was somewhere in the hallways of an NBA arena watching a different team on Detroit’s upcoming schedule in preparation. When Detroit was on the road, he was back at the offices doing the same duties. If the opponent was playing on the west coast or was a Western Conference team, Brink wouldn’t get done gathering his clips until about 2 a.m. or 3 a.m. At 8 a.m., he had to be back at Detroit’s practice facility to give the coaching staff his findings.\n\nAdvertisement\n\n“You’re working the night shift, but you’re also responsible for the day shift,” Brink said.\n\nJordan Brink (right) working out with former Piston Derrick Rose at a Detroit practice. (Photo courtesy of the Pistons)\n\nAt the end of the 2016 season, Brink was bumped up to assistant video coordinator. The duties are similarly grueling to his previous title, but now he was asked to travel with the team. Brink held that role for two seasons, and it was at the end of the 2017-18 campaign when he experienced his first scare in the business. After Detroit missed the playoffs and finished with a 39-43 record, Van Gundy and the Pistons parted ways. Brink assumed that meant he needed to find another job. The guy who brought him in was heading out of town.\n\n“I was very nervous,” Brink said. “When you get into this business, you always hear about how the job security is a concern. When a new coach came in, I assumed I wouldn’t be brought back because he’d just bring in people that he knew already.”\n\nBrink began to job search. He called around with every intention of leaving. He eventually got an offer from another NBA team to be in their video room and was preparing to move. Then, shortly after Casey was hired in 2018, the two sat down to discuss Brink’s future.\n\n“I talked to a lot of people on Stan’s staff, which is what you normally do,” Casey said. “Jordan was very impressive in that. He’s grown as a coach each year. He’s gone from video coordinator to development coach. Now, he’s doing a good job with the X’s and O’s. He’s growing as a coach. He’s got a really bright future.”\n\nAs is the case in most professions, and for those chasing the dream, whatever it may be, doubt met Brink on his journey. Even with a new role and a new coach believing in him, Brink started to question what the future held.\n\nFour years after joining Detroit’s organization, Brink had yet to make it out of the video room, the initiation space for many NBA outsiders trying to break into the prestigious club. He couldn’t picture an exit, either. Brink wasn’t even sure what it exactly was that he wanted next. He just knew that those responsibilities, long nights and stagnation were starting to overwhelm him.\n\nAdvertisement\n\n“I had started to look into other opportunities, career-wise,” Brink said. “I’ve got a degree in business.”\n\nBrink said he was grateful for every opportunity given to him up to that point, but that he would be lying if he said it all didn’t start to weigh on him.\n\n“If you count the G League season, which I was grinding like crazy, working late nights, from 2014-15 all the way until 2021, it took a toll,” Brink said. “I was missing a wedding for a friend, family events. I had a period in my life where I wondered if it was worth it. There were times I didn’t see the light at the end of the tunnel.”\n\nThe head video coordinator is, essentially, the head coach’s right-hand man. Brink had to make sure Casey had everything he needed on his computer, from a preparation standpoint and from a practice organization standpoint. His job was to make sure that film was precise, the details were nuanced and that the coaching staff could come right in and begin working without any hiccups.\n\nIt’s a lot of responsibility. A screw-up can cause a practice to be delayed; a game to be lost. Instructions need to be precise.\n\nFor two seasons (from 2018-20), Brink held this role. At the end of the 2020 season, Brink had officially reached his breaking point. He sat down with Casey and told him he needed to briefly figure out what he wanted.\n\n“I had to take a step away and take care of myself,” Brink said. “I expressed that to (Dwane Casey), that I was going through things off the court. He was receptive to that. I ended up being able to stay with Detroit and he promoted me after that season.”\n\nRodney McGruder (right) seeking advice from Jordan Brink (middle) during a timeout last season. (Photo courtesy of the Detroit Pistons)\n\nBrink is entering Year 2 as a player development coach, and his passion for the game has come back. He works night and day with the Pistons’ young players, putting them through workouts, studying film with them and, most importantly, forming relationships that he hopes leads to their future success. Brink has worked closely with No. 5 pick Jaden Ivey since his arrival in Detroit. They have spent the last two weeks working out on the court, and Brink is helping him get acclimated to life in Detroit.\n\n“He’s taken me in,” Ivey, the No. 5 pick, said. “He’s picking me up from my hotel at 7 a.m. in the morning and working out with me. I thank him for getting up early and helping me work on my game.\n\nBrink, finally, is living his dream.\n\n“I didn’t grow up wanting to be a coach from an X’s and O’s standpoint,” Brink said. “The thing about coaching, for me, is the relationship aspect, getting players to buy in and work together for a common goal. I love this part of the job, the player development one. It’s relationship based. The better relationship you have with a player, the more he’s likely to let you coach him hard and take advice when you have teaching points for him.”\n\nBrink is out of the shadows and, in Las Vegas, will be at the forefront. He doesn’t care about that, though. The opportunity to represent an organization that has continuously believed in him even when he didn’t is where the excitement for this opportunity stems from.\n\nBeing hands-on is important to Brink. Aiding in making players better to serve the common collective is what he lives for. It’s something that’s always been in him. It took him a little bit to find it, but those close to him always knew he would.\n\n“Jordan is what I would call a ‘behind the scenes’ leader,” Vande Streek said. “He’s not General Patton, out there screaming at people. He gets to know people, so when he asks something of people, they don’t want to let him down because they appreciate him so much. I thought he would end up going the general manager route. Maybe he still will. To me, evaluation, getting to know people … that’s what he likes. He’s grown a lot in his time with the Pistons. He’s smart, a bright guy. He can do anything he wants.”\n\n(Top photo credit of Jordan Brink: Photo courtesy of the Pistons)"}, {"url": "https://www.britannica.com/topic/Detroit-Pistons", "page_content": "Detroit Pistons, American professional basketball team based in Auburn Hills, Michigan, outside Detroit. The Pistons have won three National Basketball Association (NBA) championships (1989, 1990, 2004).\n\nEstablished in 1941 as the Zollner Pistons (named for team owner and auto parts manufacturer Fred Zollner) and based in Fort Wayne, Indiana, the Pistons originally played in the National Basketball League (NBL), in which they won two league championships (1944–45). The Pistons joined the Basketball Association of America (BAA) for the 1948–49 season—dropping “Zollner” from their name—and they became part of the NBA in 1949 when the league was created from the merger of the BAA and the NBL. The Pistons advanced to the NBA finals in 1955 and 1956 but lost on each occasion.\n\nBritannica Quiz NBA Postseason 2021 Quiz\n\nThe franchise was moved to Detroit in 1957 in order to capitalize on the financial benefits of a larger market. Despite the presence of such stars as Bailey Howell, Jimmy Walker, Dave DeBusschere, and Dave Bing, the Pistons posted losing records in each of their first 13 seasons in Detroit (though they did occasionally qualify for the postseason, owing to the small size of the NBA at the time). Detroit chose future Hall of Fame centre Bob Lanier with the first selection of the 1970 NBA draft, but the team’s mediocrity continued as they had only three winning seasons in Lanier’s 10 years with the Pistons.\n\nThe Pistons’ ascent to the upper echelon of the NBA began with the drafting of point guard Isiah Thomas in 1981. Thomas was joined by Bill Laimbeer, Joe Dumars, Dennis Rodman, and Vinnie Johnson to form teams that made three consecutive trips to the NBA finals. In 1988 the Pistons lost the finals to the Los Angeles Lakers in a dramatic seven-game series, but the Pistons swept a rematch between the two teams in 1989 to capture the franchise’s first title since its move to Detroit 32 years earlier. The Pistons successfully defended their championship in the 1990 finals against the Portland Trail Blazers. Under the guidance of head coach Chuck Daly, these Detroit teams were characterized by their extremely physical—some would say dirty—style of play, which earned them the nickname “Bad Boys.” After another trip to the conference finals in 1991 (a loss to Michael Jordan and the ascendant Chicago Bulls), Detroit regressed and did not field a team that advanced past the first round of the playoffs for the remainder of the decade, despite the presence of such stars as Dumars and Grant Hill in the mid- to late 1990s.\n\nUnder the guidance of new general manager Dumars, the Pistons overhauled their roster in the early 2000s, adding Ben Wallace, Chauncey Billups, Richard Hamilton, and Rasheed Wallace. These players soon helped Detroit return to the NBA elite, securing the team an NBA championship over the Lakers in 2004 and a finals appearance in 2005, when they lost to the San Antonio Spurs in seven games. All told, the Pistons of that era reached the Eastern Conference finals in six consecutive seasons (from 2002–03 to 2007–08). Most of the key players from this run had left the team by the 2009–10 season, and the Pistons then entered into a rebuilding period. However, the process moved slowly, and Dumars stepped down from his front-office position following the 2013–14 season after the Pistons’ streak of missing the playoffs reached five seasons. Led by young star centre Andre Drummond, the Pistons returned to the postseason in 2015–16, where the team was swept in the opening round. The excitement among Detroit fans that that playoff berth had created was quickly snuffed out the following season as the team struggled to a losing record. The Pistons traded for star forward Blake Griffin during the 2017–18 season, and Detroit again qualified for the postseason in 2018–19. That turnaround proved to be an aberration, and the Pistons won just 20 games in each of the following two seasons."}, {"url": "https://www.freep.com/story/sports/nba/pistons/2021/02/22/ray-scott-detroit-pistons-black-nba-coach-year-earl-lloyd/6783699002/", "page_content": "Former Detroit Pistons big man and head coach Ray Scott has long prided himself as a historian. As a child in the 1940s, he idolized the Harlem Globetrotters, who he credits for introducing him to the sport during an era where professional basketball was a predominantly white spectator sport.\n\nWhen Scott was drafted by the Pistons in 1961, he was already deeply familiar with the Black heroes of the game — figures such as Nat “Sweetwater” Clifton and Chuck Cooper, former Globetrotters who became the first Black basketball players to be drafted into the NBA, and ex-Piston Earl Lloyd, the first Black man to play in an NBA game, and Scott’s “big brother” and mentor.\n\nScott, now 82, is writing a book that will reflect on his own career, the history of Black prominent figures in professional basketball and how that platform has impacted societal change.\n\nHe said he’s still actively living his life and fears that he will publish the book too soon.\n\n“I had to wait until I was 82 to shake my head yes, to go with the affirmative because I put it off, put it off, put it off,” Scott said during a phone interview. “I just felt like I just had so much more life to live and I want to make sure I don’t leave anything out of the book.”\n\nWhile he may be an NBA historian, Scott’s name is also in the annals of NBA history. He was the league’s first Black Coach of the Year in 1974, when he guided the Pistons to a then-franchise best 50-32 record. He inherited the head coaching job from Lloyd, who was fired seven games into his second season in 1972-73. Scott said it was “never in his wildest dreams” that he would one day become a coach.\n\n“I think people prefer that we keep our mouths shut,” Scott said. “That’s where the saying ‘Shut up and dribble’ came from. People see that we’re educated men, we’re men that can decipher and discern, and I see that in the NBA and it makes me very proud when I see kids now that are educated and speaking up and doing good things with their money, helping people.”\n\nScott has called Detroit home for six decades, but was born and raised in South Philadelphia. After a year at the University of Portland, he spent three years playing for the Allentown Jets in the Eastern Professional Basketball League, later known as the Continental Basketball Association.\n\nHe eventually crossed paths with Lloyd, who was the reason why the Pistons drafted Scott in 1961. Lloyd, inducted into the Basketball Hall of Fame in 2003, broke several barriers for Black basketball players. Lloyd, Clifton and Cooper were all selected in the 1950 NBA draft, and Lloyd was the first of the three to play. After six seasons with the Syracuse Nationals, Lloyd played for the Pistons from 1958-60, and the franchise made him the NBA’s first Black assistant coach after he retired.\n\n“Syracuse was a great stop professionally, but Detroit was really something special,\" Lloyd said in an interview with the Free Press in 2004. \"I had a real love affair with the town. Over the next 42 years, I forged some great relationships there, made lifelong friends and was given many opportunities.\"\n\nOne of Lloyd’s responsibilities with the Pistons was scouting. He’s credited with discovering two of the greatest players of the era, Willis Reed and Earl Monroe, and later expressed frustration that the Pistons didn’t always follow his recommendations. But they did listen to him when he recommended they draft Scott, a 6-foot-9 power forward and center who could fill a defensive and rebounding void for a roster that had plenty of scoring punch.\n\nLloyd flew out to Philadelphia, about an hour south of Allentown, and spent a day with Scott. They went back to Scott’s home in Philadelphia, and Lloyd told Scott’s mother that the Pistons were going to draft him in the first round. Scott didn’t believe him, because he’d previously had interest from the New York Knicks, Cincinnati Royals and Chicago Packers. None had committed to drafting him.\n\nInstead, Scott accepted an opportunity to play basketball in the Bronx. He took the train from Philadelphia to New York City in March of 1961, and then hopped on a subway. He picked up a copy of the evening newspaper to check the results of the NBA draft. The Packers selected Walt Bellamy first overall, the Knicks took Tom Stith and the Royals went with Larry Siegfried with the third pick. Scott then saw that the Pistons selected him with the fourth overall pick.\n\n“My chin hit the floor,” Scott said. “I let out a scream on the subway, I think people thought I was nuts. But I was just like, ‘Wow.’ And so what Earl Lloyd had told me as a college dropout playing in the Eastern Basketball League, what he had told me was true. He was a man of his word. So coming to Detroit, I was very impressed by that, that what this man said to me was pure truth.”\n\nScott played for the Pistons from 1961-67 and averaged 16.0 points and 10.7 rebounds per game in that span. Lloyd took Scott under his wing, and Scott credits Lloyd and former Pistons coach Dick McGuire as the reasons why he had a successful 11-year pro career. Scott averaged 33 points per game during his final season in Allentown. The Pistons needed him to embrace a new role as a defensive anchor, and Lloyd helped him buy in.\n\n“He was my mentor,” he said of Lloyd. “I was probably with Earl almost every weekend, and sometimes during the week I was in Earl’s home, and he just became like my big brother. I don’t think I would’ve made the NBA had it not been for Earl, because on the Pistons team, they had three scorers — Don Ohl, Bailey Howell and Gene Shue. They weren’t looking for another scorer, they were looking for a solid big man.”\n\nScott retired in 1972 after two seasons with the ABA's Virginia Squires. His contract with the Squires included a clause stating he would work for their front office after he retired. And he did just that — until he got a phone call from Lloyd that August. Lloyd was hired as the Pistons’ head coach in 1971. The Pistons made Lloyd the NBA’s first non-playing Black coach. Bill Russell, Al Attles and Lenny Wilkins were all previously Black player-coaches.\n\nLloyd wanted Scott to be his assistant. Scott couldn’t say no.\n\n“I said, ‘Well sure, of course Earl, I can’t turn you down,’” Scott said. “‘You’ve been my big brother, my mentor, very very strong in my life.’”\n\nThree months later, after the Pistons lost five of their first seven games, and team owner Fred Zollner and general manager Ed Coil decided that it was time for a change. Lloyd was fired and Scott worried about his future. To his surprise, the Pistons’ leadership thought Scott, with just one full season as an assistant, was the right man for the job.\n\n“I was in shock for about 2 minutes,” Scott said. “When you talk about my coaching dream, it began right there. It was a big thing because I was taking over a team that had Bob Lanier and Dave Bing, two future Hall of Famers, and I had an All American from UCLA in Curtis Rowe and I had Chris Ford, who played on the top team in Villanova. We had Stu Lantz, who was nursing an injury, but we had a decent team.\n\n\"But we just weren’t hitting on all cylinders, and I never went back and asked Mr. Zollner and Mr. Coil why Earl was let go, but I did ask him why they hired me, and they just said that you could bring something to the team we needed. I was never given a clear answer. It was interesting. That was my coaching resume put together in 2 minutes.”\n\nThe Pistons went 38-37 in 1972-73 after Scott took over as head coach. That momentum carried into the following season, when they won a then-franchise best 52 games and he became the league’s first Black Coach of the Year. Scott said his lessons learned from his former coaches — Alfred Bianchi in Virginia and Shue, who coached him with the Baltimore Bullets from 1967-70 — helped him. He leaned on Lloyd, who taught him how to scout talent. He also credits his players and Coil, who he said was receptive to his ideas and gave him room to grow as a young coach.\n\n“I think it was a changing time in the '70s and I think (Zollner) was just going with the times, going with what he thought,” Scott said. “My first reaction was ‘Earl, I can’t take this job. I’m with you! And Earl said, ‘Well you gotta take it.’ He was very emphatic. You have to take this job. I said ‘OK, I listened to you up until now. I’m not going to stop now.’ But why Mr. Zollner would look at Earl Lloyd and say ‘I’m going to give this job to Ray Scott,’ only God in his heaven knows.”\n\nAfter Scott won the NBA's top coaching honor in 1974, another Black coach wasn't named Coach of the Year until Don Chaney in 1991. The only others: Wilkens in 1994; Doc Rivers in 2000; Avery Johnson in 2006; Sam Mitchell in 2007; Byron Scott in 2008; Mike Brown in 2009 and Dwane Casey in 2018.\n\nThis season, the league has seven Black head coaches (23%); about 80% of the players are Black.\n\nStill, Scott believes the NBA has always been at the forefront in American sports in creating opportunities for Black people. And he’s encouraged by what he’s seen in today’s game, naming LeBron James’ various philanthropic efforts as an example of the positive impact athletes can make with their platform.\n\n“We’ve led this nation in terms of bringing a harmonious attitude,” Scott said. “You may not want to be our friend, you may not want us around, but we don’t come with offense. We come with an open hand. And you decide how you want to treat us and how it’s going to be by the way that you treat us. I think as an industry, the NBA is one of the finest organizations that you have in this country, and they have certainly proved that in times of tribulation, with the George Floyd situation, Breanna Taylor, our kids have stepped up to the floor and showed the world we don’t shut up and dribble, we know what’s going on, as Marvin Gaye would say.”\n\nContact Omari Sankofa II at osankofa@freepress.com. Follow him on Twitter @omarisankofa."}, {"url": "https://www.freep.com/story/sports/nba/pistons/2020/05/24/chucky-atkins-detroit-pistons-nba/5196335002/", "page_content": "After retiring from the NBA in 2011, it didn’t take long for Chucky Atkins to get involved with coaching.\n\nHe returned to Orlando, his hometown, and took over his alma mater’s boy’s basketball program at Evans High School in 2012. The team saw immediate success during his two seasons, as he led the Trojans to a 44-16 record with two state runner-up finishes.\n\nThen, the former Detroit Piston's coaching career came to an abrupt end. Two arrests — for reckless driving in August 2014, and a DIU two months later on Halloween — led to Atkins stepping down shortly before the start of the 2014-15 season.\n\n[ Want more Detroit Pistons news? Download our free mobile app on iPhone and Android! ]\n\nWhen Atkins retired after 11 seasons in the NBA, he found himself directionless. He was accustomed to the regimented schedule that comes with being a professional athlete, jostling nonstop between games, practices, workouts, flights and other engagements.\n\nWith more time on his hands than he knew what to do with, he found himself playing golf and drinking every day in retirement. Eventually, his drinking became problematic.\n\n\"I decided the best thing for me to do at that particular time was to step away from it and get myself together, because at the end of the day I did realize I was a role model, and that I was doing the wrong thing,\" Atkins said.\n\n[ Pistons get shot at draft redemption with LaMelo Ball at No. 2 overall in mock ]\n\nAfter paying his legal fees, finishing his DUI classes and completing his community service, Atkins landed a new head coaching job in the AAU ranks. Now, he's hoping to climb the coaching ladder once again.\n\nAtkins, who played for the Pistons from 2000-04 and in 2009-10, is one of 14 members in the NBA’s Assistant Coaches Program. Since 1988, the program has assisted former players in developing the tools to enter the NBA, G League and college coaching ranks.\n\nHis goal is to \"go to the top,\" and become a head coach.\n\n\"Everyone deserves a second chance, and I can tell a lot of these kids a lot of things that’ll help them, that’ll benefit them that a lot of other people can’t tell them, and they’ll listen to them,\" he said. \"Because I’ve been where they want to go.\"\n\nAs part of his community service, the judge required Atkins to share his story with local high school basketball players. That experience, along with his classes, helped him come to grips with his alcohol struggle.\n\n\"There are a lot of things that they may be going through that they may not think that they’re going through at the particular time because stress and things like that, it just happens, man,\" Atkins said. \"You have to learn to deal with it and cope with it the best that you know how. If you need help, not to be afraid to ask for it.\"\n\nAtkins' son, Joel, got him into coaching. When Joel expressed an interest in following his dad’s footsteps as a basketball player, Chucky figured no one would be a better AAU coach for him than himself.\n\n[ ESPN got it totally wrong with Isiah Thomas in NBA all-time player ranking ]\n\nAtkins began his AAU coaching career shortly before joining Evans. He eventually became head coach of the E1T1 Rebels, an Orlando-based basketball team sponsored by former NBA All-Star Amar'e Stoudemire. Last September, he joined CP25, an AAU team sponsored by NBA forward Chandler Parsons.\n\nAtkins credits Detroit native and former WNBA forward Stacey Lovelace for his admission into the program. Lovelace, who is now the G League’s player development program officer, is a longtime friend of Atkins and reached out to him after seeing his Instagram announcement joining CP25.\n\nThe NBA program has had success in producing head coaches. Past graduates include former Pelicans GM Dell Demps, Suns head coach Monty Williams and Vanderbilt head coach and former Piston Jerry Stackhouse.\n\nMembers of the program, which started in December and will finish in August, are trained in professional development, leadership and player development. There’s also a technical training aspect, and participants are trained to become familiar with various scouting and video editing tools — Synergy, Fast Draw, Fast Scout, SportsCode and JustPlay.\n\nMembers of the program are also mentored by current and former G League coaches.\n\n“We want you to be able to identify talent,” NBA senior vice president of player development Greg Taylor said. “We want you to be able to game plan and develop strategies that maximizes that talent. So there’s a whole series of skills on the scouting side where we want guys to understand the software, be familiar with what teams are using and really be adept from that standpoint. We know with the push toward being more analytical as a coaching technique, we want our guys to know analytics.”\n\nThanks to the coronavirus pandemic, the program has fully embraced being virtual by relying on Zoom and Webex to conduct lessons and guest lectures.\n\nAs a former player, Atkins considers himself a player’s coach. He bounced around the league with stops in Orlando, Boston, the L.A. Lakers, Washington, Memphis, Denver and Oklahoma City.\n\nHope:One game explains why Luke Kennard makes sense in Pistons' future\n\nAtkins played for several coaches who have reputations as being among the best in the NBA — Doc Rivers, Mike Fratello and former Pistons coaches Rick Carlisle and Larry Brown. His goal is to take a little bit from each and mix it with his own style.\n\n“Ultimately, a coach is only as good as the guys on his team,” Atkins said. “It would be my job to guide and direct them. But ultimately, each guy would have to be a personal contractor to get themselves as good as they can possibly be, but also put it in a team concept. … I would take a little bit from all of those guys’ style and come up with my own formula that would be successful.”\n\nHe started 155 games during his time in Detroit and helped the Pistons emerge as an Eastern Conference power in the early 2000s. He bookended two eras, as he arrived alongside Ben Wallace in 2000 when the Pistons traded Grant Hill to Orlando. In 2004, the Pistons traded Atkins to Boston in a three-team deal to land Rasheed Wallace from Atlanta.\n\nIf Atkins could give a piece of advice to players who are nearing the end of their careers, it would be: Prepare for life without basketball while you're still in the league, use time wisely and help others.\n\n\"Everyone has had help, and the greatest thing that they can possibly do is to help someone else, because there’s going to be more basketball players coming up,\" Atkins said. \"There's going to be other young guys that have the dream, that have the same vision that I had, and they’re going to need help. They’re going to need good help. You could either be a good influence or a bad influence. Think about what it is you want to do after life in basketball.\"\n\nContact Omari Sankofa II at osankofa@freepress.com. Follow him on Twitter @omarisankofa. Read more on the Detroit Pistons and sign up for our free Pistons newsletter."}, {"url": "https://www.xintiku.com/timu/556504101.html", "page_content": "阅读下面材料，在空白处填入适当的内容（一个单词）或括号内单词的正确形式。\n\n阅读下面材料，在空白处填入适当的内容（1个单词）或括号内单词的正确形式。\n\nWhen we talked about NBA, many people will think of Yao Ming. There is no doubt that Yao Ming is a Chinese hero. On October 16, 2013, Yao Ming announcedhe1.open the NBA Yao School. This was really2.（excite）news!\n\n3.（look）at the name of the school, many people would think that the school is going to train NBA4.（talent）. But the truth is not like5.they expected. The NBA Yao School provides after-school basketball training and health programs. Its students include boys and girls over 16 years old 6. are very good at playing basketball. The school aims 7.（teach） the importance of teamwork, leadership(领导素养) and communication in a fun basketball environment.\n\nYao is quite glad to be a part of the school, because it has always been his dream to8.（positive）influence young people’s life through sports.\n\nNow, basketball fans in China are looking forward to getting basketball training, and the NBA Yao School is a great choice. In the school, students have chances to meet NBA stars. The stars can offer 9.（suggest）on how10.（play） basketball well."}, {"url": "https://www.espn.com/nba/story/_/id/10926335/detroit-pistons-pursuing-stan-van-gundy-coach-head-basketball-operations", "page_content": "The Detroit Pistons are progressing toward a deal with Stan Van Gundy that would make him their coach and president of basketball operations, according to sources with knowledge of the talks.\n\nSources told ESPN.com that Van Gundy is leaning toward accepting Detroit's aggressive pitch, despite strong interest from the Golden State Warriors regarding their coaching job.\n\nThe Pistons are hoping their unique offer of personnel control on top of the coaching duties -- something Van Gundy never had in his previous coaching stops with the Miami Heat and Orlando Magic -- will convince him to bypass the opportunity to coach his hometown Warriors.\n\nStan Van Gundy's job with the Pistons, if accepted, would give him Pat Riley-level control of the franchise. AP Photo/Nick Wass\n\nSources indicated Tuesday afternoon that the Warriors increasingly expect Van Gundy to accept Detroit's substantial offer, with a final decision expected within the next 24 to 48 hours.\n\nYahoo! Sports first reported Detroit's interest in Van Gundy.\n\nThe Pistons are looking for a new face of basketball operations for the first time in more than a decade after Detroit legend Joe Dumars left his post in April. And they've offered final say over basketball decisions to Van Gundy to trump the lure of going back to his native Northern California to coach the Warriors, who won 51 games during the regular season and sport a more polished roster.\n\nIf Van Gundy signs with the Pistons, as Golden State now fears -- and if Steve Kerr completes his widely expected deal to coach the New York Knicks -- Golden State will have missed out on the top two candidates on its list to replace the ousted Mark Jackson. ESPN.com reported shortly after Golden State's first-round playoff loss to the Los Angeles Clippers that Kerr and Van Gundy were their two preferred targets."}, {"url": "https://www.freep.com/story/sports/nba/pistons/2023/04/27/detroit-pistons-coach-search-jarron-collins-defensive-mindset/70153958007/", "page_content": "The Detroit Pistons are still in the early stages of finding their next head coach. But two weeks into the process, strong candidates have emerged.\n\nMilwaukee Bucks assistant coach Charles Lee, New Orleans Pelicans assistant Jarron Collins and former UConn head coach Kevin Ollie have stood out and are expected to make the team’s second round of interviews, league sources confirmed to the Free Press. The team held Zoom interviews last week, and will meet with more candidates this week. Lee, Collins and Ollie will likely meet with the team again for an in-person interview round.\n\nThe Pistons are angling toward hiring a younger, more unproven coach compared to their previous two — Dwane Casey, who was 61 at the time of his hire, and then 54-year-old Stan Van Gundy. Both had held multiple NBA head coaching jobs prior. Lee, Collins and Ollie would all be first-time head coaches in the NBA. Ollie is the oldest of the bunch at 50, while Collins and Lee are 44 and 38, respectively.\n\nPISTONS COACHING TRACKER:Candidates, interviews, updates\n\nA BUSY SUMMER:What Pistons need to do to crush 2023 offseason, Troy Weaver's most pivotal yet\n\nLet’s break down the backgrounds of each known candidate. We took a look at Lee on Wednesday. Next up: Jarron Collins.\n\nHe and his twin brother were longtime NBA players\n\nCollins and his identical twin brother, Jason, were both drafted in 2001 after standout careers at Stanford. Jason was drafted 18th by the Houston Rockets before being traded to the New Jersey Nets, and Jarron went 52nd to the Utah Jazz. They both enjoyed long playing careers — Jason played 13 seasons for six franchises, and Jarron played 10 seasons for four teams.\n\nIn 2013, Jason became the first active male athlete in from one of the United States' four major professional leagues to come out as gay. He played his first game after coming out in February 2014, signing a 10-day contract with the Nets.\n\n“Believe it or not, my family has had bigger shocks,” Jason wrote in his first-person Sports Illustrated cover story. \"Strange as it seems today, my parents expected only one child in 1978. Me. When I came out (for the first time) the doctors congratulated my mother on her healthy, 7-pound, 1-ounce baby boy.\n\n\" 'Wait!' said a nurse. 'Here comes another one!' The other one, who arrived eight minutes later and three ounces heavier, was Jarron. He's followed me ever since, to Stanford and to the NBA, and as the ever-so-slightly older brother I've looked out for him.\n\n“I didn't come out to my brother until last summer,” Jason later continued. “His reaction to my breakfast revelation was radically different from Aunt Teri's. He was downright astounded. He never suspected. So much for twin telepathy. But by dinner that night, he was full of brotherly love. For the first time in our lives, he wanted to step in and protect me.”\n\nMORE ON THE FUTURE:Isaiah Stewart's growth as shooter will dictate his upside with Pistons\n\nHe won three championships as a coach with the Warriors\n\nAfter retiring as a player in 2011, Jarron Collins’ next job was as a scout for the Los Angeles Clippers in 2013. A year later, Steve Kerr hired him as a player development coach with the Golden State Warriors, who went on to defeat the Cleveland Cavaliers in the NBA Finals that season.\n\nCollins was promoted to an assistant coach in 2015 and was present for Golden State’s following two championships in 2017 and 2018. He left the Warriors in 2021, after two seasons coordinating their defense, to prioritize becoming a head coach or lead assistant elsewhere.\n\n“This is about myself and my own personal growth,\" Collins told ESPN at the time. “I had a conversation with (head coach) Steve (Kerr) and the Warriors. I've been there seven years and coached Hall of Fame players. We've won championships. I learned so much. For me, this is about taking the next journey and next step in my career.\n\n“Obviously, Steve Kerr is the head coach and Mike Brown is the lead assistant. It's time for me to step out and see whatever opportunities are out there for me.”\n\nCollins was an integral part of Golden State’s success, but he was transparent about his desire to get to the next level. He has interviewed for multiple head coaching jobs over the last five years, including with the Memphis Grizzlies and Chicago Bulls. Pelicans head coach (and Detroit native and former Detroit Mercy standout) Willie Green, himself a former assistant under Kerr, hired Collins as an assistant in 2021.\n\n\"I'm going to really miss Jarron, both personally and professionally,\" Kerr told ESPN. \"He's an excellent coach and a wonderful human being. It's going to be different without him around, but he deserves the chance to continue his growth with the goal of ultimately becoming a head coach in the NBA. Jarron has all the skills necessary. He's a great teacher and communicator, he's smart and funny, and he knows the game.\"\n\nA defensive mind\n\nIn December 2019, the San Francisco Chronicle profiled Collins as he brought life to Golden State’s languishing defense. The Warriors, who finished with 15 wins that season, were without three of their most proven defenders — Andre Iguodala, Shaun Livingston and Klay Thompson — and Draymond Green and Kevon Looney had both missed significant time.\n\nThey were also without Stephen Curry, who suffered a hand injury after five games and missed the rest of the season. Collins leaned on the lessons learned during his 10-year playing career, where he wasn’t the most skilled player on the floor but was an impactful defender.\n\n“For a player like myself, I had no choice: I had to think the game out there,” Collins said. “I didn’t have the level of athleticism that other guys had, but I could execute a game plan and do what my coaches asked me to do.”\n\nThe Warriors were ascending up the defensive rankings and upset the Houston Rockets on Christmas, 116-104, largely thanks to an aggressive defensive scheme that kept James Harden off of the free throw line by double-teaming him at the top of the key.\n\nTheir starting five? Green, D’Angelo Russell, Damion Lee, Glenn Robinson III and Willie Cauley-Stein. Green applauded Collins’ “(expletive) phenomenal game plan” afterward.\n\nListen to \"The Pistons Pulse\" every Tuesday morning and on demand on freep.com or wherever you listen to podcasts. Catch all of our podcasts and daily voice briefing at freep.com/podcasts.\n\nContact Omari Sankofa II at osankofa@freepress.com. Follow him on Twitter @omarisankofa."}]}