{"Stan Heal attended the University of Minnesota and was drafted by the Minneapolis Lakers in the 1954 NBA draft.": [{"url": "https://chinacenter.umn.edu/about/history", "page_content": "The University of Minnesota was one of the first U.S. universities to resume exchanges with China following the normalization of U.S.-China relations. By the late 1970s, the University resumed exchanges that had been interrupted for nearly 30 years. These exchanges were made possible through committed partnerships with universities in the Greater China area, strong academic exchange programs, and cutting-edge research collaborations. In 1979, the University established the “China Desk” (precursor to the China Center) to manage the University of Minnesota's exchanges with Greater China.\n\nThe China Center launched its Mingda Institute for Leadership Training in 2001 to conduct training programs for Chinese professionals. Until 2021, the Institute implemented the mission of building U.S.-China bridges through training Chinese talent and developing partnerships with Chinese organizations and the Minnesota community.\n\nIn 2008, the University of Minnesota opened an office in Beijing, China, under the leadership of the China Center. The mission of the China Office is to provide support for prospective and current students, facilitate educational collaboration, and engage alumni living in China.\n\nChina 100 Celebration\n\nIn 2014, the University of Minnesota celebrated \"China 100,\" a yearlong celebration honoring the first students from China and the wealth of connections that have come since. This celebration honored the past and took a look forward at the engagement between the University of Minnesota and China. Several events were planned to honor Chinese alumni, feature University research and connections with China, and share the stories of Chinese students and U.S. students who traveled to China.\n\nThe celebration kicked-off in the summer of 2013 when University President Eric Kaler traveled to China, hosting receptions for more than 550 alumni and prospective students in Hong Kong, Shanghai, Beijing, and Taipei.\n\nBack on campus, more than 100 Chinese visiting scholars and their advisers joined in the celebration along with more than 250 people from the general campus community for a series of lectures and receptions.\n\nBeginning in January 2014, the popular China 100 History Exhibit traveled around Minnesota and China, sharing with visitors the rich history between the University and China. The exhibit focused on topics such as faculty exchanges, strategic partnerships, study abroad, arts and culture, and sports. An estimated 4,000 people viewed the exhibit during its run.\n\nThe China Center proudly hosted the \"China 100 Symposium: U, Minnesota, and China looking forward to the next century\" on April 22, 2014, at the McNamara Alumni Center. 250 people helped to make the event a success and Minnesota state Governor Mark Dayton honored the event with the \"Minnesota China Education Exchange Day\" proclamation. The audience had the special opportunity to hear from Lawrence Pan, the grandson of the first Chinese student Wen Ping Pan to attend the University, and view a short video documentary of the first University delegation to China in 1979, led by Regent Wenda Moore.\n\nIn October and December 2014, the University’s China Center hosted closing receptions for the celebration. Distinguished Chinese Alumni were honored in Minneapolis, Beijing, and Taipei, honoring those who had been nominated and selected as part the China 100 celebration.\n\nChina Center Past Directors"}, {"url": "https://www.nbcnews.com/specials/minneapolis-re-segregated-schools-set-the-stage-national-crisis/", "page_content": "By Erin Einhorn and Nigel Chiwaya\n\nAug. 31, 2020\n\nThis article is Part 2 of the “American dream while Black,” a series about the obstacles Black people face in achieving equity. Part 1 showed how homeownership is the prime driver of the wealth gap between Blacks and whites.\n\nThe death of George Floyd this spring turned Minneapolis into a symbol of America’s racial divide — a place where, as in many American cities, people of color feel sidelined, disrespected and cut off from opportunities.\n\nBut Minneapolis hasn’t always had that reputation.\n\nIn the last decades of the 20th century, the Twin Cities were seen as a model of racial and economic integration, celebrated as a place where state laws and local initiatives created some of the most far-reaching school and neighborhood integration programs in the nation.\n\nThose efforts didn’t stamp out racism, said Helen Bassett, 70, a Black school board member in the suburban Robbinsdale Area school district near Minneapolis. But they gave people a way to better understand one another, “to relate to them on the basis of human decency.”\n\nToday, however, the programs are mostly gone.\n\nLike many U.S. cities that dismantled school integration programs in the wake of federal court decisions and shifting local politics, the Twin Cities have largely walked away from their once-touted initiatives, replacing them with a school choice system that was supposed to integrate schools by letting parents choose where to send their children, but has largely exacerbated segregation.\n\nBus routes that once transported students to intentionally integrated schools have stopped running. Magnet schools that once drew students from different neighborhoods have closed. And in the absence of those efforts, Black and white students have become increasingly isolated.\n\nIn the 1993-94 school year, less than one percent of Black students in the Minneapolis region attended highly segregated public schools — where 90 percent or more of the student body was not white, according to an NBC News analysis of data from the National Center for Education Statistics. Almost three decades later, in 2018, a quarter of the region's Black students were attending such schools.\n\nNBC News found a similar rise in school racial segregation in 74 of the 100 most populous metro areas in the United States. Across the country, nearly 40 percent of Black students were in highly segregated schools in 2018, up from 33 percent in 1993. And in places like Minneapolis; Charlotte, North Carolina; Milwaukee; and Tampa Bay, Florida, the increases were even sharper.\n\nThe consequences of that resegregation have been painful, said Rucker Johnson, an economist and public policy professor at the University of California, Berkeley.\n\n“We must think of racism as an infectious disease and silence leaves the disease untreated,” said Johnson, the author of “Children of the Dream: Why School Integration Works.”\n\nWhen communities resegregated schools, he said, they halted progress in bridging academic and economic gaps that had long existed between Blacks and whites. Johnson’s book documents his research following thousands of students from the heyday of school integration in the 1970s and ʼ80s. He found that when Black students attended integrated schools from kindergarten to 12th grade, they went further in high school and college, essentially eliminating differences in educational attainment between Black and white students. They earned higher wages compared to Black students who attended segregated schools, had more stable marriages, were more likely to avoid the criminal justice system and experienced health benefits later in life on par with being seven years younger.\n\n“We see a pretty transformative impact,” said Johnson, who is African American and grew up in Minneapolis, where his mother was the superintendent of schools from 1997 to 2003. When schools began to resegregate, Black and Latino students increasingly landed in schools with fewer resources and less experienced teachers. That’s led to lower graduation rates, lower rates of college attendance and ultimately lower wages compared with their white peers.\n\nMembers of the Minneapolis school board are surrounded by protesters unhappy with school board policy regarding segregation in 1998. (Marlin Levison / Star Tribune via Getty Images) Members of the Minneapolis school board are surrounded by protesters unhappy with school board policy regarding segregation in 1998. (Marlin Levison / Star Tribune via Getty Images)\n\nWhite students who attend predominantly white schools, meanwhile, are more likely to bring racial biases into adulthood, Johnson said, meaning that when cities like Minneapolis resegregated their schools they set themselves up for a future of housing and employment discrimination, racial bias in classrooms, unequal treatment for patients in hospitals, and — ultimately — incidents like the killing of Floyd, a Black man who died with his neck under the knee of a white Minneapolis police officer.\n\n“When law enforcement assumes guilt over innocence, when educators perpetuate a culture of low expectations and when health care is not preventative and accessible care,” Johnson said, “the consequences are tragic and destroy our opportunities.”\n\nAfter Brown\n\nThe U.S. Supreme Court abolished school segregation in its Brown v. Board of Education decision in 1954. The Civil Rights Act a decade later made the ruling more enforceable. And by the 1970s, lawsuits filed on behalf of Black students had begun to desegregate schools.\n\nIn Charlotte, an ambitious effort to use busing to racially balance schools in Mecklenburg County was unanimously upheld by the U.S. Supreme Court in 1971. The ruling paved the way for court-ordered busing programs around the country and turned the Charlotte-Mecklenburg school district into a national model for school integration for 25 years.\n\nA cheerful busload of West Charlotte High School pupils on May 15, 1972. \"We don't have any serious problems,\" says Kevin Barris, a blond junior at the window above, about the city's busing, \"and if we did we would work them out.\" (AP file) A cheerful busload of West Charlotte High School pupils on May 15, 1972. \"We don't have any serious problems,\" says Kevin Barris, a blond junior at the window above, about the city's busing, \"and if we did we would work them out.\" (AP file)\n\nSoon, hundreds of school districts were under court orders that redrew enrollment boundaries or put students on buses to take them to integrated schools.\n\nAs a result, the percent of Black students in highly segregated schools across the country was cut in half from 1968 to 1988, according to a 2019 report.\n\n“It wasn’t perfect,” said Erica Frankenberg, an education professor at Pennsylvania State University and one of the report’s authors. Many technically integrated schools steered white students to advanced classes that excluded Black students. Others subjected Black students to racist discipline policies that made it harder for them to succeed. Private schools sprang up, particularly in the South, to serve white students whose parents wanted segregated schools.\n\nIn the North, as the suburbs expanded, some areas, like Boston and Detroit, saw integration efforts thwarted by a 1974 Supreme Court ruling that barred judges from forcing suburbs to participate. That meant white families could avoid integration by moving to the suburbs, which many did.\n\nPolice were on hand to provide protection as buses carrying Black students arrived at South Boston High School on Jan. 8, 1975. (AP file) Police were on hand to provide protection as buses carrying Black students arrived at South Boston High School on Jan. 8, 1975. (AP file)\n\nDespite those challenges, Frankenberg said, it was a start. “We brought kids and teachers of different races together in the same building, which particularly in the South had not been done before, and the significance of that undertaking alone cannot be understated.”\n\n“But then,” Frankenberg added, “we took our foot off the gas pedal for desegregation.”\n\nA Supreme Court ruling in 1991 gave judges broad leeway to end integration programs if they believed a district had already complied in good faith. And, one by one, desegregation court orders began to fall.\n\nA white parent’s lawsuit toppled Charlotte’s integration program in 1999 despite objections from the district, which tried to defend it. Today, Charlotte has the most segregated schools in North Carolina, as well as significant achievement gaps between Black and white students.\n\nWhile Black students represented just under a third of all students enrolled in public schools in the Charlotte metro area in 2018, an NBC News analysis found that a typical Black student attended a school that was disproportionately Black. This is a sharp change from 1988, when the average Black student attended a school that mirrored the demographics of the metro area.\n\nOther rollbacks had a similar impact. In Tuscaloosa, Alabama, two integrated high schools created by a 1979 desegregation order were replaced by smaller, more segregated schools in 2000 when that order was thrown out. Since 1993, the percent of Black students in highly segregated Tuscaloosa-area schools has grown from 39 percent to 53 percent.\n\nIn the Milwaukee metropolitan area, over the same time period, the percent of Black students in highly segregated schools has tripled. Kenosha, Wisc., the latest city to land in the national spotlight after the shooting of a Black man by police, has a relatively small Black population but the percentage of students in highly segregated schools is inching up. A city that did not have a single highly segregated school in 1993 had two such schools last year.\n\nAnd across the country, Black and brown children have been increasingly concentrated in schools with high teacher turnover, aging textbooks, fewer advanced courses, and, ultimately, lower test scores. Blacks have continued to lag behind white peers on many economic measures. They’re less likely to attend and graduate from college, more likely to be unemployed, less likely to own their home and more likely to live in poverty.\n\n‘We outlawed de facto segregation’\n\nThe story of school integration in Minneapolis is somewhat different from the rest of the country since it was state and regional policy — not a federal court order — that made the Twin Cities an integration success story, said Myron Orfield, a law professor at the University of Minnesota who has spent his career documenting the resegregation of schools and neighborhoods in the Twin Cities.\n\nThough Minneapolis schools were under a desegregation court order from 1972 to 1983, two local policies from that time had a bigger impact, Orfield said. One was a program that required municipalities in the region to develop affordable housing. That essentially prevented the suburbs from excluding low-income families that were more likely to be families of color.\n\nThe other was a state law that barred districts from concentrating too many students of any one race in any one school. If any school had significantly more Black or white or Latino students than the district as a whole, the district could lose state funding, Orfield said.\n\n“We outlawed de facto segregation,” he said. “We forbid it and didn't allow it to occur in any form.”\n\nThen the politics of integration began to shift. The housing policy fell victim to changes in federal funding and local priorities in the 1980s. The school desegregation law lasted into the 1990s, when the state’s governor and Legislature were on the verge of expanding it to include more of the suburbs. Then, in 1998, the state’s attorney general issued an opinion that largely gutted it, Orfield said.\n\nThe attorney general, Hubert H. “Skip” Humphrey III, was running for governor at the time. His opinion asserted, among other things, that existing desegregation programs were illegal.\n\n“He just wiped it out,” Orfield said. “He changed our civil rights law by 180 degrees.”\n\nHumphrey, who lost that race for governor, did not respond to requests for comment.\n\nAfter that, Orfield said, desegregation efforts became largely optional — school districts that wanted to integrate could qualify for extra state funding, but districts could opt out without consequences, or use the funding ineffectively. At the same time, the rise of a new school choice system further hampered integration efforts.\n\nMinnesota had been a national leader in school choice in the 1990s. It was the first state to allow privately run, publicly funded charter schools and it created programs allowing students to attend schools in neighboring districts.\n\nSupporters believed choice would help integrate schools by giving low-income families of color a way out of low-performing schools. But in practice, some white families used choice to avoid integration.\n\n“If families did not want to send their kids to a school with, quote, ‘those kids,’ they could escape, and a number did,” said Bill Green, who was the superintendent of Minneapolis schools from 2006 to 2010.\n\nChoice programs also hurt Minneapolis schools financially, Green said. As suburban schools recruited city students — sometimes using desegregation dollars to do so — city enrollment declined, as did state funding. And Green, who is Black and now a history professor at Augsburg University in Minneapolis, questioned whether students of color were getting a better education in schools that didn’t necessarily have racially diverse teachers or curriculums.\n\nAs the choice system grew more popular, districts faced financial pressure and began pulling out of the multidistrict integration consortiums that, decades earlier, had created diverse magnet schools to comply with the law when it had more teeth. Most of those schools have closed.\n\nThe magnet schools had offered a “real, visible, tangible” way for the region to work toward “a common goal of equity and inclusion,” said Bassett, who served on the board of a regional integration consortium.\n\nWhen districts walked away, “they dismantled something that was unique, that really set us apart,\" Bassett said. The region's integration programs “gave such hope,\" she added, \"and then slowly, over time, it got chipped away and chipped away.”\n\n‘They can do it everywhere’\n\nSchools across the country have become more diverse in recent years as Hispanic and Asian populations have grown; white children are no longer a majority in public schools. But Black and Latino students in U.S. cities remain highly isolated. While 16 percent of U.S. public school students were Black in 2018, NBC News' analysis found that a typical Black student attended a school that was 48 percent Black.\n\nAddressing this problem will require different solutions than those tried in the past, experts say. Recent Supreme Court rulings have largely barred the use of race in student enrollment, so districts would need to use other criteria, such as family income or ZIP code. Plus, suburban sprawl has spread students over larger areas, making busing to magnet schools more complicated.\n\nSome experts, like Johnson, the Berkeley economist, say the solution includes housing policy changes aimed at integrating both neighborhoods and schools, as well as changes to school funding systems to prevent isolating needier children in financially strapped schools.\n\nOthers, like Frankenberg, from Penn State, said new technology such as computer models that could identify effective changes to school attendance zones could be deployed to help schools desegregate.\n\nAnd in Minneapolis, Dan Shulman is using the tool that worked back in the 20th century: a lawsuit.\n\nA suit Shulman filed on behalf of Minneapolis and St. Paul students in 2015 — Cruz-Guzman v. State of Minnesota — won the backing of the state Supreme Court on a key argument and is now in mediation.\n\nShulman, a staff attorney for the Minnesota ACLU, said he’s been working on a settlement with Attorney General Keith Ellison. The two are developing integration strategies that could withstand legal challenges, including adding magnet schools and hiring and retaining teachers who are highly qualified and diverse, Shulman said.\n\nJust as protests on the streets in Minneapolis this spring inspired similar demonstrations in cities across the country, Shulman hopes his desegregation lawsuit can inspire efforts elsewhere.\n\n“Now we have a national black eye, which is well deserved and long overdue,” he said, citing statistics that show large academic and economic gaps between Black and white residents of the region.\n\nBut he hopes his lawsuit can change that.\n\n“If we can do it here in one of the worst areas, with the greatest gaps and the most segregation,” he said, “they can do it everywhere.”"}, {"url": "https://australianfootball.com/players/player/stan%2Bheal/6702", "page_content": "AFL: 4,954th player to appear, 8,721st most games played, 6,214th most goals kickedMelbourne: 592nd player to appear, 838th most games played, 571st most goals kicked\n\nPacy, courageous and highly skilled, Stan 'Pops' Heal was one of Australia's finest wingmen of the 1940s. His WANFL career with West Perth comprised 180 games between 1939 and 1953, with a break for the war.\n\nIn 1941 he accomplished the rare feat of playing in two premiership sides in different states in the same season. Whilst temporarily stationed in Victoria, Heal lined up with Melbourne, and was on a wing as the Redlegs defeated Essendon in that year's VFL Grand Final. A week later he was back home in Perth completing the second half of an exceptional double as West Perth accounted for East Fremantle in the WANFL Grand Final. This time Heal played as a rover, but it was as a wingman that he achieved his greatest notoriety.\n\nThe West Perth teams of the half decade or so following World War II were among the finest in the club's history, and Heal was very much a lynch-pin, both as player and coach. He played in two premiership sides for the Cardinals, and won their fairest and best award in 1947. He coached the victorious Grand Final teams of 1949 against Perth and 1951 versus South Fremantle. Heal was also a regular interstate representative (18 appearances) winning a Simpson Medal against South Australia in 1949 and leading the Sandgropers at the Brisbane carnival the following year. In October 2000 he was named (more or less inevitably one ventures to presume) on a wing in West Perth official 'Team of the Century'.\n\nAuthor - John Devaney"}, {"url": "https://www.society19.com/famous-alumni-from-the-university-of-minnesota-twin-cities/", "page_content": "Have you ever been curious about the notable alumni that have walked the campus long before you have? Well, here you go. From actors and musicians to professional athletes and presidents, there are plenty of famous alumni from The University of Minnesota Twin Cities. Will you be on this list one day?\n\n1. Erick Decker\n\nAfter four seasons as a Denver Bronco, Eric Decker is currently a wide receiver for the New York Jets. Not only did he succeed in football at Minnesota, but he also played on the baseball team and was eventually drafted by both the NFL and MLB.\n\nAdvertisement\n\n2. T.R. Knight\n\nT. R. Knight is well-known for his previous role on ABC’s hit television show Grey’s Anatomy as Dr. George O’Malley. Knight briefly attended Minnesota before dropping out to focus on his acting career.\n\n3. Bob Dylan\n\nIt depends on who you ask, but singer and musician Bob Dylan reportedly enrolled at the University of Minnesota in the fall of 1959 but dropped out after one year. He was a part of the Jewish-centric fraternity Sigma Alpha Mu and quickly became involved in the Dinkytown folk music circuit.\n\nAdvertisement\n\n4. Lindsay Whalen\n\nProfessional women’s basketball player Lindsay Whalen attended the University of Minnesota from 2000 to 2004 and was soon known as one of the best players to have ever come out of the program. In 2004, she became Minnesota’s all-time leading scorer. Whalen’s jersey number 13 was retired in 2005 at Williams Arena. When it comes to athletes, she’s one of the most famous alumni at the University of Minnesota Twin Cities.\n\nAdvertisement\n\n5. Herb Brooks\n\nWho would’ve known that hockey legend Herb Brooks went to the University of Minnesota? Well, it probably wasn’t hard to guess considering Minnesota is the state of hockey. Many years after playing hockey at Minnesota from 1955 to 1959, Brooks went on to lead the 1980 U.S. Olympic team to a gold medal in Lake Placid against the Soviet Union.\n\nAdvertisement\n\n6. Hubert Humphrey\n\nHubert Humphrey served as the 38th Vice President of the United States years after graduating from the U of M in 1939 with a Bachelor of Arts degree. He went on to earn a master’s degree from Louisiana State University in 1940. In addition to his time at Minnesota, he was a member of the Phi Delta Chi Fraternity.\n\n7. Jessica Lange\n\nOscar Award and Golden Globe Award winning actress Jessica Lange received an art scholarship to study art and photography at the University of Minnesota in 1967. After her marriage in 1971, Lange left Minnesota to travel the United States and Mexico with her husband.\n\nAdvertisement\n\n8. Marion Barber III\n\nFormer Dallas Cowboy and Chicago Bear Marion Barber III played football for\n\nThe University of Minnesota Golden Gophers before he was drafted into the NFL. At\n\nAdvertisement\n\nMinnesota, Barber was an All-Big Ten selection in 2003.\n\n9. Cheryl Strayed\n\nCheryl Strayed is an author known for writing memoirs, fiction, and personal essays. Strayed transferred to the University of Minnesota after her freshman year at the University of St. Thomas. She received a Bachelor of Arts degree while graduating magna cum laude with a double major in English and Women’s studies. One of Strayed’s greatest works was her novel Wild which was adapted onscreen in 2014.\n\nAdvertisement\n\n10. Tony Dungy\n\nTony Dungy went from being a University of Minnesota football quarterback to playing in the NFL. He went on to coach multiple professional football teams including his most recent stint coaching the Indianapolis Colts from 2002-2008. In his football career, he was a 2x Super Bowl champion.\n\nAdvertisement\n\n11. Walter Mondale\n\nWalter Mondale served as the 42nd Vice President of the United States from 1977-1981 under President Jimmy Carter. Many years before serving as VP, Mondale graduated from the University of Minnesota Law School in 1956 after previously earning a B.A. in political science in 1951.\n\nAdvertisement\n\n12. Nick Clegg\n\nFrom 2010 to 2015, Nick Clegg served as the Deputy Prime Minister of the United Kingdom and the Lord President of the Council in the UK. Clegg, a Liberal Democrat politician, studied at the University of Minnesota for one school year on a scholarship after he completed school at Cambridge University.\n\nAdvertisement\n\n13. Kris Humphries\n\nKris Humphries may be a professional basketball player, but his 72-day marriage to reality television star Kim Kardashian West can’t be forgotten. Humphries played basketball for the Gophers and was named the 2004 Big Ten Freshman of the year. He only played one season for Minnesota before declaring for the NBA draft.\n\n14. Brock Lesnar\n\nAfter attending his freshman and sophomore years at Bismarck State College, Brock Lesnar transferred to the University of Minnesota on a wrestling scholarship. At Minnesota, he won the 2000 NCAA Division 1 heavyweight wrestling championship during his senior year. Later, he went on to become a professional wrestler and WWE champion.\n\nAdvertisement\n\n15. Roy Wilkins\n\nRoy Wilkins was an activist in the Civil Rights Movement and was the executive direction of the National Associated for the Advancement of Colored People from 1955-1977. During his time at the University of Minnesota, Wilkins worked for The Minnesota Daily as a journalist and then the editor of The Appeal.\n\nAdvertisement\n\nWho are your favorite famous alumni from the University of Minnesota Twin Cities? Comment below!\n\nFeatured photo source: ibtimes.com"}, {"url": "https://www.btpowerhouse.com/2015/6/23/8697327/the-minnesota-gophers-in-nba-draft-history", "page_content": "Leading up to the NBA draft, BT Powerhouse is taking a look back at how Big Ten programs have fared in past drafts. The Minnesota Golden Gophers have had some great players in their history that have gone on to have success in the NBA, but unfortunately right now, they're in the midst of a 10 year NBA Draft drought.\n\nSince Kris Humphries was selected 14th overall by the Utah Jazz in 2004, no Minnesota player has been drafted. In the Big Ten, only Nebraska, Northwestern, and Penn State have longer current droughts. Andre Hollins and Maurice Walker are hoping to hear their names called on draft day, but the drought is likely to extend to an 11th year. After two seasons in Minnesota, coach Richard Pitino is working on changing that.\n\nIt hasn't always been this way for the Gophers. They've had 18 players drafted in the first round and 51 overall. In fact, Humphries was the sixth first-rounder from Minnesota in eight years at the time he was drafted. Before '04, the Gophers had never gone more than three years without someone being drafted.\n\nGolden Gophers Currently in the NBA\n\nPlayer Draft Year NBA Team GP PPG Kris Humphries 2004 Wizards 691 6.9\n\nIt's a short list of Gophers in the league right now. On the bright side, former Minnesota women's basketball player Amanda Zahui B. was taken second overall in this year's WNBA draft by the Tulsa Shock!\n\nSince the recent history hasn't been so glamorous, let's take a minute to reminisce on the glory days of Minnesota men's basketball's past.\n\n1950s\n\nDon Smith was selected in the first draft in '47, then 10 players were drafted from Minnesota in the '50s. Amazingly, eight of them went to the hometown Minneapolis Lakers.\n\nThe first of them was Bud Grant. Grant was a three-sport star in basketball, football and baseball and was drafted in the 4th round of the 1950 NBA draft by Minneapolis. He was also drafted in the first round of the NFL Draft that same year by the Philadelphia Eagles, and to this date remains the only person to ever play in both the NBA and NFL. A member of the Pro Football Hall of Fame, Grant is best known for his 18 years as head coach of the NFL's Minnesota Vikings from 1967-1985.\n\nDick Garmaker was drafted twice by Minneapolis -- once in '54 and again in '55 -- before he began his career and became a 4-time all-star for the Lakers.\n\n1960s\n\nNine Gophers were selected in the drafts of the 1960s. However, when the Lakers moved to Los Angeles in the 1960 off-season, the steady pipeline of University of Minnesota players ended.\n\nLou Hudson was the 4th overall pick in 1966 by the St. Louis Hawks. \"Sweet Lou\" was a six-time NBA all-star and his No. 24 jersey was retired by the Hawks.\n\nArchie Clark was drafted the same year and played 10 seasons for five teams. Clark is known as one of the first players to perfect the crossover dribble, earning him the nickname \"Shake and Bake\".\n\n1970s\n\n13 more Golden Gophers were picked in the '70s. Larry Mikan, son of the Hall of Fame Minneapolis Lakers great George Mikan, was taken in '70 by the Los Angeles Lakers, but played his only NBA season for the Cleveland Cavaliers.\n\nThe baseball Hall of Famer Dave Winfield was another of Minnesota's talented multi-sport stars. In 1973, Winfield was the fourth overall pick in the MLB Draft and was also selected in the NBA and ABA drafts. Despite never playing college football, the NFL's Minnesota Vikings said \"why the heck not?\" and drafted him too. He's one of three players ever drafted by three different professional sports leagues (Mickey McCarty and Dave Logan).\n\nBefore he became just Klay's dad to the younger generation, Mychal Thompson was a great basketball player in his own right and is the only player from the U to ever be taken with the No. 1 overall selection. He won two NBA titles with the \"showtime\" Lakers in the latter stages of his career.\n\n1980s\n\nThe first of eight Gophers drafted in the '80s was Kevin McHale. He started the decade strong for Minnesota by being drafted third overall in '80 by the Celtics. Currently the head coach of the Houston Rockets, the Hall-of-Famer is considered by many to be the greatest power forward the game has ever seen. Part of the NBA's 50 Greatest Players list, McHale won three titles alongside frontcourt mates Larry Bird and Robert Parrish in Boston.\n\n1990s\n\nThe Gophers kept rolling in the '90s with seven more basketball players drafted by NBA teams, including five first-rounders. Willie Burton was the ninth overall pick in '90 and had a long professional career. In '94 as a member of the Philadelphia 76ers, he once exploded for 53 points against his former team the Miami Heat.\n\n2004 NBA Three-Point Shootout champion Voshon Lenard was drafted in '94 out of Minneapolis, followed by Bobby Jackson in '97. Jackson is best remembered for his role as the spark plug backup point guard for the Sacramento Kings during their playoff runs of the early 2000s.\n\n2000s\n\nThis is where it begins to slow down for Minnesota. The 2000s started out unsuspectingly, like it would be another decade filled with pros and first round picks from Minnesota. Joel Przybilla was taken ninth overall by Houston in 2000 and had a solid NBA career with several teams.\n\nRick Rickert was a late second round pick in '03 who never caught on in the NBA, but the Golden Gophers followed that up with Kris Humphries in '04. Humphries left Minnesota following his freshman year, after becoming only the sixth player in Big Ten history to lead the conference in scoring and rebounding, and first to do it as a freshman. He was drafted 14th overall by the Utah Jazz and is now with his seventh NBA team, the Washington Wizards.\n\n2010 - present\n\nThey've had some players with potential, but now halfway through the '10s, we're still waiting on the first Minnesota Golden Gopher to be drafted. During Tubby Smith's entire tenure as head coach from 2007-2013, not a single one of his players played a game in the NBA.\n\nGood luck to Hollins and Walker this year. Even if not drafted, they'll have a chance to catch on with a team as a free agent or play elsewhere professionally."}, {"url": "https://nursing.umn.edu/news-events/university-minnesota-and-minneapolis-va-begin-new-chapter-long-history-nursing", "page_content": "University of Minnesota and Minneapolis VA begin new chapter in long history with Nursing Collaboratory agreement\n\nOctober 5, 2021\n\n\n\nThe Minneapolis VA Health Care System (VAHCS) and University of Minnesota celebrated their 75 years of academic affiliation with the announcement of a new Collaboratory aimed at improving nursing practice, education and patient outcomes.\n\nThe collaboration between the University’s School of Nursing and the VA’s Department of Nursing created a nursing think tank, which serves as an incubator for creativity and innovation and will engage nursing faculty, nursing staff and nursing students to focus on three areas:\n\nFostering innovative undergraduate, graduate and post-graduate education experiences at the Minneapolis VAHCS and supporting veteran-centered care in the curriculum\n\nAdvancing nursing knowledge to improve and support the health of veterans and their families through research and evidence-based practice\n\nAddressing nursing workforce needs for the Minneapolis VAHCS and other VA centers throughout the U.S. and supporting a smooth transition of graduates into practice\n\n“I am so honored to be involved in the first Collaboratory in the history of nursing at the Minneapolis VA Healthcare System,” says Teresa Tungseth, MN, RN, NEA-BC, associate director for patient care services/nurse executive at the Minneapolis VAHCS. “This Collaboratory between our VA and the School of Nursing is essential to the development of our future nursing workforce.”\n\n“This Collaboratory between our VA and the School of Nursing is essential to the development of our future nursing workforce.” Teresa Tungseth, MN, RN, NEA-BC, associate director for patient care services/nurse executive at the Minneapolis VAHCS\n\nShe says the partnership will help foster innovative research and evidence-based practice experiences for undergraduate and graduate students from the School of Nursing.\n\n“These partnerships help to strengthen nursing practice and prepare current and future nurses to lead change and advance the health of our Veterans. Our Collaboratory goal is to transform nursing practice for our Veterans by ensuring nurses are prepared to provide the best possible care to Veterans and their families, whether here at the VA or in the community,” adds Tungseth.\n\n“The vibrancy of this celebration of 75 years of collaboration between our institutions extends to an even greater commitment to veterans care through this Collaboratory,” says Connie White Delaney, PhD, RN, FAAN, FACMI, FNAP, dean of the School of Nursing. “The School of Nursing welcomes our partnership with the Minneapolis Veterans Administration Health Care System to impact care, education and innovation with exceptional nursing leaders.”\n\nAs part of the agreement, key nursing leaders at the Minneapolis Veterans Administration Health Care System will hold affiliate faculty status in the School of Nursing and University nursing leadership will hold Without Compensation Appointments at the Minneapolis VA.\n\nA history of collaboration, innovation\n\nThe Collaboratory is the latest example of the Minneapolis VAHCS and School of Nursing working together to serve the public. The two began educating nurse anesthetists together in 1996, which led to the first Doctor of Nursing Practice program in nurse anesthesia in the United States.\n\nOther collaborations included the VA Nursing Academic Partnership that allowed the School of Nursing to increase the number of students it prepares to become registered nurses while providing specialized training about veterans’ health. As part of that program, health topics like PTSD, chemical exposure, amputation, traumatic brain injury and substance use disorder as they are experienced by veterans were integrated into the education that the school’s BSN students receive.\n\nThe most recent partnership between with the two was the Minneapolis VAHCS being selected as one of 11 sites nationally to educate leaders and scholars in health care improvement to lead change nationally and internationally, as part of the VA Quality Scholars Program. The two-year doctoral fellowship, with an emphasis on interprofessional, veteran-focused health care improvement, includes dedicated School of Nursing faculty time at the VA."}, {"url": "https://www.montanasports.com/high-school-sports/boys-basketball/mttop50-no-4-anacondas-ed-kalafat-teamed-with-george-mikan-on-minneapolis-lakers", "page_content": "(Editor's note: While we're faced with a sports-less world during the coronavirus pandemic, MTN Sports is going to re-publish the original stories from the #MTTop50, which launched in 2016 to profile some of the great boys basketball players in Montana history. The first six weeks of the series separated players by decade, beginning with athletes from 2010-present that first week. The sixth week, athletes from the 1960s, ‘50s and earlier were profiled. The weeks between featured five players each from the 2000s, 1990s, 1980s and 1970s. Players like Tres Tinkle, who graduated from Missoula Hellgate in 2015 and is currently playing at Oregon State, and Wayne Estes, who starred at Anaconda and Utah State in the 1960s, were not featured in their respective decades. Those players will be profiled in the top 20, regardless of era, which MTN Sports began with Reece Gliko. You can find a full rundown of the 30 players featured the first six weeks by clicking here. Our intention is not to revise history, so we're not going to change the order in which the players were featured. However, some articles will include updates to reflect the latest developments in a player's career. This story was originally published on Aug. 16, 2016.)\n\nTop 20 rankings: No. 20 – Reece Gliko; No. 19 – Brent Wilson; No. 18 – Mike Chavez; No. 17 – Shawn Samuelson; No. 16 – JR Camel; No. 15 – Tom Storm; No. 14 – Daren and Kevin Engellant; No. 13 – Bill Pilgeram; No. 12 – Kral and Shann Ferch; No. 11 – Don Wetzel Sr.; No. 10 – Jonathan Takes Enemy. No. 9 – Robin Selvig; No. 8 – Jack Gillespie; No. 7 – Josh Huestis and Tres Tinkle; No. 6 – Larry Pretty Weasel; No. 5 – Elvis Old Bull. … No. 1 – Aug. 19.\n\nNo. 4 – Ed Kalafat, Anaconda\n\nFrom guys like the polarizing – but unquestionably effective – Reece Gliko, who began MTN Sports’ top 20 countdown of the best players in Montana history, to the larger-than-life Elvis Old Bull, who checked in at No. 5, the #MTTop50 has featured some of the most talked about figures in the state’s basketball lore. Ed Kalafat is not frequently mentioned when fans discuss Montana’s best players. But he should be.\n\nEd Kalafat stat sheet\n\nKalafat has the distinction of being Montana’s highest-drafted player in the NBA or ABA. He was selected with the ninth overall pick in the 1954 ABA draft by the Minneapolis Lakers after stellar careers at Anaconda and the University of Minnesota.\n\nKalafat was an all-state football and basketball player at Anaconda, accumulating 1,561 career points – even more than the late great Wayne Estes, who will be featured in the #MTTop50’s top three players of all-time. Kalafat helped lead the Copperheads to the 1948 state championship – the last in program history – and helped Anaconda break in ‘The Snake Pit,’ scoring the first-ever points in the now legendary gymnasium.\n\nAgainst Kalafat’s wishes, his father – with an assist from Hall of Famer George Mikan – convinced Kalafat to attend the University of Minnesota, where he starred for the Gophers for three seasons. He started at center all three years, appearing in 66 career games, scoring 954 career points, and earning all-Big 10 honors in 1952, 1953 and 1954. Kalafat averaged 15.9 points and 9.2 rebounds per game as a sophomore to lead the team in both categories during the 1951-52 season. His scoring average dropped the next two years – to 15.5 ppg as a junior and 12.0 as a senior – but he was named the team MVP as a senior. Kalafat led the team in rebounding all three years, averaging 10.3 boards per game as a junior and 9.7 as a senior. He was a National Association of Basketball Coaches all-district choice each season. Minnesota finished third in the Big 10 all three years.\n\nKalafat played only three seasons with the Lakers, appearing in 209 games alongside Mikan. Kalafat averaged 4.8 points and 4.4 rebounds per game as a rookie. He upped those marks each of the next two seasons to 8.0 points and 6.1 rebounds per game his second year and 8.5 points and 6.5 rebounds in his third season.\n\nKalafat joined the military after his playing days and had a long career in banking. He still lives in Saint Paul, Minn., with his wife of 62 years.\n\n(UPDATE: Kalafat passed away in October 2019. He was 86.)\n\nKalafat on Kalafat:\n\n“I look back. Somebody says, ‘What’s your best time?’ When I was a sophomore we played Kentucky, and it was my first game. Kentucky was the defending national champion, and I ended up getting 38 points. That was a highlight. There was another game that we played Butte High School. I ended up with more points than Butte’s team totally. I think I got something like 42 points. The best game I had against Kentucky was 38. But there was another game in Billings where at halftime – and you could do zone defense at the time – but we were ahead 27-13 and all of a sudden Billings went into a stall. And I had all 27 points and ended up with about 32. You can go back and reminisce about a lot of things.\n\n“We had a coach by the name of Mike O’Leary (at Anaconda). … Mike was a type of guy that was a no-nonsense guy. He treated you good. Every once in a while, we would play zone defense. But he didn’t like the zone defense, he thought everybody ought to play man-to-man. And bring the ball down and set up the play. When he had the fast break, he took advantage of it. He had four or five plays we ran quite often, but he’s a great guy. Best coach I ever had. If I had to pick a coach – I played for John Kundla with the Lakers, Ozzie Cowles with the Gophers. I was fortunate enough to play two East-West games where one was the Kentucky coach (Adolph Rupp), the Cats. In my mind, there wasn’t a coach equal to Mike O’Leary.\n\n“I’m a Croatian, it’s a nationality. And George Mikan is a Croatian. I visited with Minnesota twice – they brought me back for two different visits. But St. Paul-Minneapolis was a big city, I was so lost and I really wasn’t anxious to go there. And Mikan wrote a letter to my dad in Croatian. And my dad was 6-(foot)-3 and about 245 (pounds) and just solid muscle, and he said, ‘You’re going to Minnesota.’ I said, ‘I don’t want to go to Minnesota.’ He said, ‘I didn’t ask if you wanted to go there.’ He said, ‘George is there. You’re going to go there.’ And so that’s how I ended up in Minnesota.\n\n“You couldn’t dunk (in the ABA). At one time, the basket was only eight feet high, and they raised it to 10 feet. And we were part of that. We got involved with it – I guess it was my last year, we played in the first game that they put the 24-second rule in. We played against the Knicks in Madison Square Garden. And at that time, too, the Lakers were a dominant team. They won the championship the last three years (1952, 1953 and 1954) or something like that. But it was a lot of fun.”"}, {"url": "https://twin-cities.umn.edu/news-events/two-university-minnesota-students-named-2021-astronaut-scholars", "page_content": "Two students in the College of Science and Engineering at the University of Minnesota Twin Cities campus are among 60 students nationally who have been awarded scholarships for the 2021-22 academic year by the Astronaut Scholarship Foundation.\n\nThe prestigious Astronaut Scholarship, initiated by the Mercury-7 astronauts, is awarded annually to outstanding sophomores and juniors who intend to pursue research-oriented careers in mathematics, engineering, and the natural and applied sciences. The scholarship awards up to $15,000 for a year of undergraduate study. In addition, recipients will receive mentoring and professional development support, attend the Astronaut Foundation’s Innovators Gala in Orlando, Fla., and have the opportunity to participate in other Astronaut Foundation events.\n\n\n\nSauviz Alaei, a Math and Physics major from Eagan, has been working for two years in the condensed matter physics lab of Professor Dan Dahlberg. In his first project there, Alaei created an apparatus to measure the frequency response of a new magnetostrictive material developed in the lab. The resulting data revealed some surprising qualities of the new material, which behaved in unexpected ways at low frequencies. Alaei presented his findings at the American Physical Society’s 2021 meeting and will publish it in a forthcoming issue of the Journal of Applied Physics. He has now begun a new project testing the predictions of the Wolfarth model for magnetic remanence in a ferrofluid containing magnetite nanoparticles. In the future, he would like to apply his research experience to creating and assessing materials for quantum computing.\n\n\n\nHe is the vice president of the U of M Society of Physics Students, where he has helped to implement a new mentoring program and other pandemic-related initiatives that have helped to triple the membership. As a member of the University Honors Program he has served as tutor for Honors Physics courses.\n\n\n\nNathan Pharis, an Aerospace Engineering major from Chanhassan, has been active in several projects in aerospace research, primarily working with Professors Graham Candler and James Flaten on employing high-altitude balloons to measure particulates in the stratosphere. As project lead creating a payload for NASA’s High Altitude Student Platform, he assessed innovative techniques for collecting samples from the low-density air in the upper atmosphere, and he has been the primary developer of the control systems to maneuver balloons and execute data gathering. Pharis is also the leader of the Space Systems Design Competition team and a member of the Small Satellite Attitude Determination and Control Systems group. In both groups, he designs software to solve complex control challenges in extreme environments.\n\n\n\nOn-campus, Pharis is vice president of the American Institute for Aeronautics and Astronautics group, a member of the University Rocket Team, and does community science outreach with Energy and U. He plans to complete a PhD in Aerospace Control Systems and would like to help develop interplanetary navigation systems.\n\n\n\n-30-\n\n\n\nThe Astronaut Scholarship Foundation was founded in 1985 by the Mercury 7 astronauts, one of whom, Donald “Deke” Slayton, graduated from the University of Minnesota with a B.S. in Aeronautical Engineering in 1949. Prevented from piloting the second U.S. manned orbital space flight by an irregular heart rhythm, Slayton served as NASA’s Director of Flight Crew Operations and later was cleared to pilot the docking module in the Apollo-Soyuz mission of 1975. The Astronaut Scholarships are awarded to students at 44 universities with historic ties to the U.S. space program who demonstrate leadership, imagination, and academic excellence in the study of mathematics, science or engineering. 37 students from the University of Minnesota have been recognized as Astronaut Scholars.\n\n\n\nUniversity of Minnesota, Twin Cities students who are interested in applying for the scholarship in the future may consult with the Office of National and International Scholarships by contacting Timothy Jones at [email protected].\n\n\n\nFor more information on the Astronaut Scholarship, visit astronautscholarship.org.\n\n"}, {"url": "https://archive.org/details/universityofminn00stan", "page_content": "Includes bibliographical references (p. 339-387) and index\n\n\n\nThe university at the end of World War II, 1945-1959 -- Years of growth and years of protest, 1960-1974 -- Planning in a time of austerity, 1974-1984 -- Finding focus, 1985-1997 -- The university at the end of the century\n\nAccess-restricted-item true Addeddate 2011-11-17 21:49:20 Bookplateleaf 0010 Boxid IA174101 Boxid_2 BWB220140929 Camera Canon EOS 5D Mark II City Minneapolis, Minn. [u.a.] Date-raw January 15, 2000 Donor friendsofthesanfranciscopubliclibrary Edition [Online-Ausg.] External-identifier urn:oclc:record:1036910948\n\nurn:lcp:universityofminn00stan:lcpdf:5e36f866-e950-4327-95c0-ece30402d30b\n\nurn:lcp:universityofminn00stan:epub:d1b58c1c-ae0d-4364-b86f-87d0cc5b9a0e Extramarc University of Alberta Libraries Foldoutcount 0 Identifier universityofminn00stan Identifier-ark ark:/13960/t89g6r564 Isbn 0816632553\n\n0816632561 Lccn 00012206 Ocr_converted abbyy-to-hocr 1.1.20 Ocr_module_version 0.0.17 Openlibrary OL8070318M Openlibrary_edition OL8070318M Openlibrary_work OL15030644W Page-progression lr Page_number_confidence 90.52 Pages 498 Ppi 514 Related-external-id urn:isbn:0816632561\n\nurn:lccn:00012206\n\nurn:oclc:704565998\n\nurn:oclc:248545797\n\nurn:oclc:45276738\n\nurn:oclc:874482613\n\nurn:oclc:290518809\n\nurn:isbn:0816689806\n\nurn:oclc:476095016 Republisher_date 20120323103506 Republisher_operator scanner-shenzhen-wu@archive.org Scandate 20120322202025 Scanner scribe5.shenzhen.archive.org Scanningcenter shenzhen Source removedNEL Worldcat (source edition) 248545797 Show More Show Less\n\nFull catalog record MARCXML"}, {"url": "https://www.britannica.com/biography/Kevin-Durant", "page_content": "Kevin Durant attended the University of Texas, where he was a first-team All-American and the first freshman to earn consensus for national College Player of the Year honors. He quit college after just one season and was selected by the Seattle SuperSonics with the second overall pick of the 2007 National Basketball Association (NBA) draft.\n\nKevin Durant is an American professional basketball player who won the 2013–14 National Basketball Association (NBA) Most Valuable Player (MVP) award, establishing himself as one of the best players of his generation while only in his early 20s. Durant was a basketball prodigy, becoming one of the best prospects by his early years in high school.\n\nKevin Durant, in full Kevin Wayne Durant, (born September 29, 1988, Washington, D.C., U.S.), American professional basketball player who won the 2013–14 National Basketball Association (NBA) Most Valuable Player (MVP) award and established himself as one of the best players of his generation while only in his early 20s.\n\nDurant was a basketball prodigy as a youth, becoming one of the best prospects in the thriving Washington, D.C.-area basketball scene by his early years in high school and an All-American in his senior season. He attended the University of Texas, where as a freshman he led the Big 12 Conference in scoring average (25.8 points per game), rebounding average (11.1 rebounds per game), and blocked shots (67). He was also a first-team All-American and the first freshman to earn consensus national College Player of the Year honours. He elected to end his college career after just one season and was selected by the Seattle SuperSonics with the second overall pick of the 2007 NBA draft.\n\nBritannica Quiz Basketball Quiz\n\nDurant was the lone bright spot in Seattle during his rookie campaign, as the team’s new owners demanded a publicly funded arena that the city refused to finance, and the team’s threat to relocate to another city kept fans away in droves. Durant averaged 20.3 points per game that season and was the runaway winner of the NBA Rookie of the Year award. His dynamic play could not heal the rift between the team and the city, however, and at season’s end the Sonics moved to Oklahoma City and became the Thunder. The relocation had no noticeable effect on Durant as he increased his scoring, rebounding, assists, and steals averages in his second season. He began a streak of five straight All-Star Game appearances and first-team All-NBA honours during the 2009–10 season, when he also led the Thunder to the franchise’s first playoff appearance in its new home. In 2011–12 the Thunder—behind Durant’s 28.5 points per game in the postseason—advanced to the NBA finals, where the team lost to the Miami Heat in a five-game series.\n\nThe 6-foot 9-inch (2.06-metre) forward proved to be an increasingly difficult matchup as he honed his outside game—Durant could shoot over or run past plodding post defenders and tower over smaller guards. Beginning with the 2009–10 season, the dynamic Durant led the NBA in total points for five straight seasons and in scoring average four times (he finished second in 2012–13). In his dominant 2013–14 MVP season, he set career highs of 32 points and 5.5 assists per game (along with 7.4 rebounds per contest). The following season saw Durant play in just 27 games because of a fracture in his right foot and a troubled recovery process. He returned to form in 2015–16, averaging 28.2 points per game and a career-high 8.2 rebounds per contest that season. In the playoffs, Durant led the Thunder to a 3–1 series lead in the conference finals over the Golden State Warriors, who had set an NBA record during the regular season by amassing 73 victories, but Oklahoma City ultimately lost the series in seven games. During the following off-season, Durant shocked the NBA by leaving the Thunder in free agency to sign with the Warriors.\n\nIn 2016–17, playing on the most talent-laden team of his career, Durant continued to thrive with the Warriors, scoring 25.1 points per game while helping Golden State post the most wins in the league (67). The Warriors then set an NBA record by opening the postseason with 12 straight victories en route to a Western Conference title. The team’s dominance continued in the NBA finals, as the Warriors lost just one game to the Cleveland Cavaliers en route to capturing the league championship. Durant averaged 35.2 points per game in the finals and was named finals MVP for his performance.\n\nDurant averaged 26.4 points and a career-high 1.8 blocks per game during the 2017–18 regular season. He once again excelled in the playoffs, leading the Warriors to another NBA title with a sweep of the Cavaliers. His stellar play in the finals—he averaged 28.7 points per game—earned Durant his second finals MVP award.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nDurant had another dominant regular season in 2018–19, averaging 26 points per game and earning his 10th consecutive All-Star honours. He strained his calf during the Western Conference semifinals, but the Warriors managed to advance to the NBA finals without him. Golden State went down 3–1 to the Toronto Raptors in the series before Durant returned to attempt to rally his team to victory. In the second quarter of his first game back, he suffered a devastating tear to the Achilles tendon in the same leg of his previous calf strain, an injury that kept Durant off the court for more than a calendar year. (The Warriors ultimately lost the finals in six games.)\n\nDuring the off-season in 2019, Durant signed with the Brooklyn Nets but was unable to play until the start of the 2020–21 season (which was shortened due to the COVID-19 pandemic). Shortly thereafter the team signed James Harden, and he joined a star-studded lineup that, in addition to Durant, included Kyrie Irving. Many predicted that the Nets would win multiple NBA championships. Although a hamstring injury forced Durant to miss more than 20 games, the Nets finished the regular season in 2021 as the number two seed in the Eastern Conference. Backed by his strong play, the team advanced to the conference semifinals, where it lost to the Milwaukee Bucks, the eventual champions. In the 2021–22 season Durant missed nearly two months because of a knee injury. Although Brooklyn made the playoffs, the team was defeated in the first round. During the off-season, Durant requested a trade. In addition to disappointments on the court, the team endured controversy off it. In 2021 Durant was fined by the NBA for “using offensive and derogatory language on social media” in a feud with actor Michael Rapaport. And Irving was at the centre of various scandals, including accusations that he was anti-Semitic. Midway through the 2022–23 season, Durant was traded to the Phoenix Suns.\n\nIn addition to his professional exploits, Durant was a member of the U.S. men’s national basketball team that captured a gold medal at the 2016 Rio de Janeiro Olympics and at the 2020 Tokyo Games (which were held in 2021 due to the COVID-19 pandemic)."}]}