{"Stan Heal was a member of the Lakers' 1959 NBA championship team and the St. Louis Hawks' 1958 NBA championship team.": [{"url": "https://retrosimba.com/2018/05/01/the-story-of-why-hawks-took-flight-from-st-louis/", "page_content": "The St. Louis Hawks were a first-place NBA team in 1968, but they were also-rans in the hearts of hometown sports fans.\n\nOn May 3, 1968, club owner Ben Kerner sold the Hawks to a group that moved them to Atlanta. The departure occurred 10 years after the franchise won its only NBA championship in 1958.\n\nThough the Hawks were Western Division champions in 1968, finishing the regular season with a 56-26 record, their average home attendance was 6,288. Struggling to attract customers to St. Louis’ Kiel Auditorium, the Hawks played six of their home games in Miami during the 1967-68 season.\n\nIn 1955, when the Hawks relocated from Milwaukee, the baseball Cardinals were the only other major professional sports franchise in St. Louis. By 1968, the Cardinals and Hawks had been joined in St. Louis by the NFL Cardinals, the NHL Blues and the Stars of the North American Soccer League.\n\nThe baseball Cardinals were longtime kings in St. Louis, and the football Cardinals, as well as the Blues, who joined the NHL in 1967, surpassed the Hawks in popularity.\n\n“Things have been going downhill slowly,” Kerner said to the Associated Press. “Since 1960, when the football Cardinals came here, people instead of buying eight season tickets from us split it four and four. The same thing happened again with hockey.”\n\nMoney ball\n\nAfter beating the Boston Celtics in the 1958 NBA Finals, the Hawks had their peak home attendance years in the next three seasons, averaging 8,548 in 1958-59, 8,409 in 1959-60 and 8,561 in 1960-61, according to the Association for Professional Basketball Research.\n\nThe baseball Cardinals and the football Cardinals benefitted from the 1966 opening of Busch Memorial Stadium in downtown St. Louis. The Blues, who reached the Stanley Cup Finals in their debut season, played at St. Louis Arena.\n\n“The Hawks, it developed, could stand everything except competition for the sports buck,” Bob Broeg wrote in the St. Louis Post-Dispatch.\n\nCoached by Richie Guerin and bolstered by standout players such as Zelmo Beatty, Lenny Wilkens, Joe Caldwell, Bill Bridges, Paul Silas and Lou Hudson, the Hawks opened the 1967-68 season by winning 16 of their first 17 games, but ticket sales remained flat.\n\n“When your team starts off with a 16-1 record and you have a hard time drawing crowds at home, you have to wonder,” Kerner said.\n\nFacing the San Francisco Warriors in the first round of the playoffs, the Hawks played the first two games at St. Louis, drawing crowds of 5,018 and 5,810 to Kiel Auditorium, according to the Post-Dispatch. With the best-of-seven series tied at 2-2, Game 5 was played at St. Louis’ Washington University and attracted slightly more than 4,000.\n\n“The crowds at the playoff games were very discouraging,” Kerner said. “This certainly was a factor in my decision to sell the club.”\n\nFast break\n\nThe Warriors, featuring players such as Rudy LaRusso, Nate Thurmond and Jeff Mullins, upset the favored Hawks, winning four of six games in their playoff series. Soon after, Kerner was approached by an Atlanta group, led by real estate developer Thomas Cousins and former Georgia governor Carl Sanders.\n\n“Negotiations progressed rapidly,” Kerner said.\n\nCousins told the Atlanta Constitution a deal was reached quickly “because there were other cities who would have jumped in had we sat back.”\n\nKerner sold the Hawks for about $3.5 million, the Post-Dispatch reported.\n\n“The attendance for the last four or five years has not been good,” Kerner said. “It appears that the interest is not there. If you have a product that people don’t want, you can’t make them buy it.”\n\nKerner said he tried to find a St. Louis group to purchase the Hawks, but didn’t find any.\n\nWrote Broeg: “Public apathy was apparent. The man was justified in selling, though it’s too bad he couldn’t have given St. Louisans one more chance or, because he’d become wealthy here, been willing to take a little less to keep it here.”\n\nNew South\n\nGuerin told the Atlanta Constitution he was eager to coach in Atlanta because the city was “very progressive, fast-growing and, equally, fast-developing.”\n\n“The only thing about the sale that I’m a little down about is the fact I’m parting company with such a fine man as Mr. Kerner,” Guerin said. “It has been more than just a coach-owner relationship between the two of us. Mr. Kerner is a man for whom I have the greatest respect.”\n\nThe Hawks became the third major professional sports franchise to come to Atlanta since 1965, joining the baseball Braves and the NFL Falcons.\n\nIn 1968-69, their first season in Atlanta, the Hawks played at Alexander Memorial Coliseum on the Georgia Tech campus and averaged 4,474 per home game.\n\nThe Hawks never have won a NBA championship since moving to Atlanta. St. Louis never has gotten a NBA franchise since the Hawks departed, though they did have the Spirits of the American Basketball Association from 1974-76."}, {"url": "https://www.archyde.com/st-louis-hawks-the-forgotten-team-that-brought-down-bill-russell-and-boston/", "page_content": "Bill Russell is a living legend. In each of his public appearances, the most successful player in the history of American basketball is celebrated and praised. The city of Boston has dedicated a statue to him, and any self-respecting fan has heard of the great stakes dominance over the NBA in the 1950s and 1960s: 11 league titles, mind-boggling individual statistics and a profound cultural impact.\n\nBetween 1957 and 1966, the Celtics won 9 titles including 8 in a row with the only anomaly in 1958. A team, now forgotten, brought down the myth that year: the St. Louis Hawks . Since moving to Atlanta, the Hawks have been the scratching hair of a unique dynasty. A team which, more or less, could have carved out the lion’s share in the collective memory.\n\nNow deprived of basketball and forced to be content with the Blues in hockey and the Rams in football, St. Louis has been a stronghold of the NBA for … less than 10 years. Time for Bob Pettit, 89 years old today, and his gang to play four Finals and win a title against the untouchable Celtics, before the Lakers of Jerry West and Elgin Baylor in their turn come up against the Massachusetts wall repeatedly.\n\nThe Hawks’ success is closely linked to that of Pettit, rarely cited spontaneously as one of the best players of all time. And yet …\n\nProof that Bill Russell is the ultimate winner, more than Jordan or LeBron\n\n“Playing against Bob Pettit was at least as hard as playing against Wilt Chamberlain,” Bill Russell once told the Boston Globe.\n\nPosition 4 of 2m06, Pettit was an exceptional rebounder (16.2 career average) and an exceptional striker capable of driving any seasoned defender crazy. First MVP in history in 1956 and All-Star 11 times, the Louisiana native is a phenomenon just like his rival from Boston. Few can boast of having scored 50 points against Russell in a Finals game. Pettit succeeded in this crucial game 6 of 1958, traumatizing the “Father of Defense”, somewhat diminished by an ankle injury.\n\nAt the time, the local media are also happy to praise the merits of “white” Pettit against the African-American Russell. They are careful not to remind a public not yet flooded with continuous information this frightening anecdote: it was the Hawks who drafted Bill Russell two years earlier before giving up his rights to Boston against two players. Without the insistence of the great Red Auerbach, St Louis could have found himself in the place of the Celtics and crushed the NBA thanks to this terrifying duo …\n\nRacism plagues the Hawks\n\nLiving in Missouri in the 1950s or 1960s when you are not of the Caucasian type can be overwhelming. Lenny Wilkens, the Hall of Famer, says in his biography:\n\n“When I arrived in St Louis in 1960, I understood that things were different here. In the city center, I was not served in restaurants. I received despicable letters and my neighbors did everything to avoid me. come across or look at me “.\n\nWithin the team, executives like Pettit are passive and do not, at first, do much to protect their comrades who are victims of the prevailing racism. The climate deteriorated a little more in 1962, when coach Paul Seymour was instructed to reduce the role of Cleo Hill, an African-American, whose talent risks eclipsing Pettit, Cliff Hagan and Clyde Lovellette, the three white stars of the team. Seymour refuses and is sacked on the spot.\n\nThe hapless Hill, victim of a smear campaign across the entire league, will never tread a basketball court again. It’s the beginning of the end for the Hawks in St. Louis. As a symbol, it is in 1968, the year of the assassination of Martin Luther King, that they move to Atlanta, the birthplace of the pastor, to create a new identity.\n\nBob Pettit is now extremely rare in the media, much more in any case than the other myths of the league still alive. In 2010, in an interview with NBA.com, however, he explained:"}, {"url": "https://www.stltoday.com/sports/other/the-day-the-hawks-made-their-st-louis-debut-and-an-nba-legend-emerged/article_04ee3304-1f6a-11eb-9bcd-53d371eb3b20.html", "page_content": "St. Louis has lost major league teams before. After the 1953 season, the American League Browns departed for Baltimore. For those who loved little pinch-hitters (Eddie Gaedel), promotions like “Grandstand Manager's Day” and the \"Streetcar Series\" of 1944, it was tough to swallow.\n\nAfter the 1987 season, the NFL St. Louis Cardinals split for Phoenix. For those who watched Hall of Famers like Larry Wilson, Dan Dierdorf, Roger Wehrli and Jackie Smith, who lived and died with Don Coryell's “Cardiac Cards,” it was sad. The Rams moved here from Los Angeles and filled the NFL void from 1995-2015, when Stan Kroenke moved the team back to LA, spitting upon St. Louis on his way out.\n\nAnd after just one season (1934-35), the NHL St. Louis Eagles disappeared - who can forget Fido Purpur and Syd Howe?\n\nBut those departures have a postscript. The Browns are a memory, but major league baseball remained and has flourished with the National League Cardinals. The Eagles were short-lived, but the NHL Blues have been back since 1967-68. The Football Cardinals never hosted a playoff game here, but they were replaced by the Rams who won Super Bowl XXXIV.\n\nNo, the wound that hurts the most is one that never healed. From 1955-56 to 1967-68, St. Louis was a vibrant piece of the emerging NBA. The Hawks played in the NBA Finals four times from '57 to '61, winning the title in 1958. Their star, Bob Pettit, is among the handful of greatest sports figures in the city's history. And eight other NBA Hall of Famers played for the St. Louis Hawks.\n\nBut after the 1967-68 season - the best record (56-26) in franchise history, owner Ben Kerner sold the team and it moved to Atlanta. Forty-five years later, it seems likely there will be a Starbucks on the moon before there is another NBA team in St. Louis.\n\nThe ABA Spirits (1974-75) brought professional hoops back briefly, but all that survives is their play-by-play announcer, Bob Costas. Oh, and a Post-Dispatch sportswriter who covered the Spirits but made his name writing about a different sport — Baseball Hall of Famer Rick Hummel."}, {"url": "https://ftw.usatoday.com/2019/12/nba-finals-winners-by-team", "page_content": "The National Basketball Association as we know it fully came together in 1949, with many of its franchises consolidating and moving in the mid-1950s before expansion.\n\nThe 1950 Finals were won by the then-Minneapolis Lakers, led by future Hall of Famer George Mikan, and they won three of the next four. Since then, we’ve seen other franchises — the Boston Celtics, Los Angeles Lakers, Chicago Bulls, San Antonio Spurs and Golden State Warriors, to name a few — build dynasties and win multiple titles. Some others are still trying to get that elusive first championship.\n\nHere’s a complete list (through the 2019-20 season) of Finals wins by franchise:\n\nAtlanta Hawks: 1 (1958, as the St. Louis Hawks)\n\nBoston Celtics: 17 (1957, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1968, 1969, 1974, 1976, 1981, 1984, 1986, 2008)\n\nBrooklyn Nets: 0 (They won two in the ABA in 1974 and 1976)\n\nCharlotte Hornets: 0\n\nChicago Bulls: 6 (1991, 1992, 1993, 1996, 1997, 1998)\n\nCleveland Cavaliers: 1 (2016)\n\nDallas Mavericks: 1 (2011)\n\nDenver Nuggets: 0\n\nDetroit Pistons: 3 (1989, 1990, 2004)\n\nGolden State Warriors: 6 (They won one in the BAA in 1947, 1956 as the Philadelphia Warriors, 1975, 2015, 2017, 2018)\n\nHouston Rockets: 2 (1994, 1995)\n\nIndiana Pacers: 0 (They won three in the ABA in 1970, 1972 and 1973)\n\nLos Angeles Clippers: 0\n\nLos Angeles Lakers: 16 (They won one in the BAA in 1949, 1950, 1952, 1953, 1954 all as Minnesota Lakers; 1972, 1980, 1982, 1985, 1987, 1988, 2000, 2001, 2002, 2009, 2010)\n\nMemphis Grizzlies: 0\n\nMilwaukee Bucks: 1 (1971)\n\nMinnesota Timberwolves: 0\n\nNew Orleans Pelicans: 0\n\nNew York Knicks: 2 (1970, 1973)\n\nOklahoma City Thunder: 1 (1979 as the Seattle Supersonics)\n\nOrlando Magic: 0\n\nPhiladelphia 76ers: 3 (1955 as the Syracuse Nationals, 1967, 1983)\n\nPhoenix Suns: 0\n\nPortland Trail Blazers: 1 (1977)\n\nSacramento Kings: 1 (1951 as Rochester Royals)\n\nSan Antonio Spurs: 5 (1999, 2003, 2005, 2007, 2014)\n\nToronto Raptors: 1 (2019)\n\nUtah Jazz: 0\n\nWashington Wizards: 1 (1978 as the Washington Bullets)\n\n[jwplayer FSUJXoNr-q2aasYxh]"}, {"url": "https://www.sportscasting.com/hawks-often-forgotten-team-first-celtics-lakers-era-were-only-squad-beat-bill-russell-boston-dynasty-nba-finals/", "page_content": "While most usually only mention the Celtics and Lakers when discussing the NBA from the 1950s and 1960s, the Hawks played a major role in that era as well and did something the Lakers never could.\n\nSince their move to the Eastern Conference in 1970, the Atlanta Hawks haven’t had many realistic chances to win an NBA championship. Yes, there’s this current run by Trae Young & Co. and the highly underrated 2014-15 team that won 60 games and two playoff series before running into LeBron James and the Cleveland Cavaliers. But those are the only two times the Hawks have come close to reaching the NBA Finals since moving to the ATL in 1968.\n\nHowever, when the franchise was a member of the Western Conference as the St. Louis Hawks (and the first two years in Atlanta), the team was a consistent contender for the NBA title in the 1950s and 1960s. But that often gets overlooked as the two teams from that era that still receive the most attention to this day are the Los Angeles Lakers and Boston Celtics, who met seven times in the NBA Finals over those two decades.\n\nWhat most fail to remember is that the Hawks squared off with the Celtics in the NBA Finals four times in a five-season span back then. And in three of those seasons, the Hawks defeated the Lakers in the Western Conference Finals to reach the title series. And we certainly can’t forget to mention the Hawks did something the Lakers never could as they were the only team to beat 11-time champ Bill Russell in the NBA Finals.\n\nOf course, it has to be addressed that matching up with Russell and the Celtics wouldn’t have even been a thing had the Hawks not traded him to Boston on draft day in 1956. But the focus today isn’t a “what if” alternate timeline that has Russell playing his entire career with the Hawks. No, this is just a simple reminder that there were more than two teams truly competing for an NBA championship back in the day and that the Hawks were right in the thick of things for a solid 15 years.\n\nThe Hawks matched up with the Celtics in the NBA Finals four times in five years and beat the Lakers in the Western Conference Finals in three of those seasons\n\nAhead of the 1954-55 season, their final campaign in Milwaukee, the Hawks used the second overall pick in the NBA draft to select LSU All-American power forward/center Bob Pettit, who won Rookie of the Year and went on to become the greatest player in franchise history (sorry, Dominique, it’s true).\n\nPettit won the first of his two NBA MVP awards in his second season (the team’s first in St. Louis), averaging a league-best 25.7 points per game and 16.2 rebounds, and led the Hawks to their first playoff berth in six years. After beating the Lakers in the conference semis, St. Louis lost in the conference finals to the Detroit Pistons. But despite the loss, the Hawks proved they were going to be a force to be reckoned with for the foreseeable future, which is exactly what they became.\n\nOver the next five seasons, the Hawks reached the Western Conference Finals every year and only lost once, that defeat coming at the hands of the Lakers in 1959. However, on the other three occasions in which the Hawks and Lakers squared off to decide the NBA Finals representative from the West (1957, 1960, 1961), St. Louis came out on top, winning the first in a three-game sweep while the other two meetings went seven games. As for that fifth appearance, the Hawks defeated the Pistons in five games to reach the Finals in 1958.\n\nAs for those four meetings with the Celtics in the NBA Finals, yes, Boston won three of them. But it’s not as if the Hawks weren’t competitive, at least in two of the losses anyway. In their first meeting in 1957, the series went the distance with Game 7 going to double overtime, which Boston won by two. In 1960, the series again went seven games, although Game 7 wasn’t nearly as close as the Celtics won by 19 behind a 22-point, 35-rebound performance from Russell. The 1961 Finals weren’t nearly as competitive as Boston easily won the series in five games.\n\nBut let’s now switch focus to the series the Hawks won.\n\nThe Hawks were the only team to beat Bill Russell’s Celtics in the NBA Finals\n\nFollowing that dramatic seven-game loss to Russell and the Celtics in the 1957 NBA Finals, the Hawks came back strong the following season and, as mentioned, defeated the Pistons in five games in the Western Conference Finals to set up a rematch with Boston.\n\nWhile Pettit was still the leader of the team, small forward Cliff Hagan, whom the Hawks had acquired from Boston in the Russell trade, had become a star in his own right and earned the first of five consecutive All-Star selections in 1958, averaging 19.9 points and 10.1 rebounds in the regular season. And he showed out in Game 1 of the 1958 Finals, scoring a team-high 33 points as the Hawks stole the series opener in Boston Garden, 104-102. However, Boston evened the series with a 24-point win in Game 2, at which point the series shifted to St. Louis.\n\nGame 3 proved to be the most crucial contest of the series as not only did the Celtics lose the game, 111-108, but they also lost Russell to a severely sprained ankle, limiting him for the remainder of the series. And the Hawks took full advantage.\n\nBoston was able to even the series at 2-2 with a victory in Game 4, but Pettit took over from there. During Game 5 in Boston, he scored 33 points and pulled down 21 rebounds to lead the Hawks to a 102-100 win, and then he posted 50 points and 19 rebounds during a one-point victory in Game 6 to close out the series.\n\nMany still believe the Celtics would have won the series had Russell not gotten hurt, and that’s certainly a valid argument. But it’s not as if the Hawks hadn’t proved over two seasons that they could beat Boston with Russell on the floor, so that needs to be taken into account, as well.\n\nRussell and the Celtics went on to win the next eight NBA titles and 10 of the next 11. Their only series defeat during that stretch came at the hands of the Philadelphia 76ers in the 1967 Eastern Conference Finals, leaving the Hawks as the only team to beat Boston in the NBA Finals during its historic run of 11 championships in 13 seasons.\n\nDespite never getting back to the title series, the team made six more trips to the Western Conference Finals over the next decade\n\nSt. Louis Hawks superstar Bob Pettit | Getty Images\n\nWhile the Hawks never again reached the NBA Finals after losing to the Celtics in 1961, it’s not as if they just went away.\n\nYes, they had a terrible season in 1961-62, going 29-51 to miss out on the postseason for the first time since moving to St. Louis. But over their final eight seasons in the Western Conference (six in St. Louis, two in Atlanta), the Hawks made the playoffs every year and appeared in the Western Conference Finals six more times, four of those appearances coming against the Lakers, all of which they lost. But again, the Lakers could never get past Russell and the Celtics in the NBA Finals, losing seven times in seven tries from 1959 to 1969, perhaps because they had to expend so much energy to get past the Hawks in the West.\n\nSo the next time you find yourself in a conversation about the Celtics-Lakers rivalry of the ’50s and ’60s, try not to forget that the Hawks played a major part in the NBA’s original golden era.\n\nStats courtesy of Basketball Reference"}, {"url": "https://www.nytimes.com/2012/10/19/sports/basketball/slater-martin-hall-of-fame-lakers-guard-dies-at-86.html", "page_content": "Slater Martin, the Hall of Fame guard whose playmaking and defensive brilliance helped take the Minneapolis Lakers to four N.B.A. championships in the league’s first decade, died Thursday in Houston. He was 86.\n\nHis death was announced by the University of Texas, for whom he starred in the 1940s.\n\nIn the era before the 24-second shot clock, the Lakers dominated pro basketball behind the N.B.A.’s biggest attraction, center George Mikan. Their front line also featured the rugged Vern Mikkelsen and the agile Jim Pollard.\n\nThe Laker player who put everything in motion was the 5-foot-10-inch Martin, a sparkling passer and a quick and pesky defender, the archetype of today’s point guard.\n\nMartin played for Laker teams that captured the N.B.A. championship in 1950 and then won three consecutive titles, from 1952 to 1954. He played on his fifth N.B.A. championship team with the St. Louis Hawks in 1958."}, {"url": "https://www.archyde.com/st-louis-hawks-the-forgotten-team-that-brought-down-bill-russell-and-boston/", "page_content": "Bill Russell is a living legend. In each of his public appearances, the most successful player in the history of American basketball is celebrated and praised. The city of Boston has dedicated a statue to him, and any self-respecting fan has heard of the great stakes dominance over the NBA in the 1950s and 1960s: 11 league titles, mind-boggling individual statistics and a profound cultural impact.\n\nBetween 1957 and 1966, the Celtics won 9 titles including 8 in a row with the only anomaly in 1958. A team, now forgotten, brought down the myth that year: the St. Louis Hawks . Since moving to Atlanta, the Hawks have been the scratching hair of a unique dynasty. A team which, more or less, could have carved out the lion’s share in the collective memory.\n\nNow deprived of basketball and forced to be content with the Blues in hockey and the Rams in football, St. Louis has been a stronghold of the NBA for … less than 10 years. Time for Bob Pettit, 89 years old today, and his gang to play four Finals and win a title against the untouchable Celtics, before the Lakers of Jerry West and Elgin Baylor in their turn come up against the Massachusetts wall repeatedly.\n\nThe Hawks’ success is closely linked to that of Pettit, rarely cited spontaneously as one of the best players of all time. And yet …\n\nProof that Bill Russell is the ultimate winner, more than Jordan or LeBron\n\n“Playing against Bob Pettit was at least as hard as playing against Wilt Chamberlain,” Bill Russell once told the Boston Globe.\n\nPosition 4 of 2m06, Pettit was an exceptional rebounder (16.2 career average) and an exceptional striker capable of driving any seasoned defender crazy. First MVP in history in 1956 and All-Star 11 times, the Louisiana native is a phenomenon just like his rival from Boston. Few can boast of having scored 50 points against Russell in a Finals game. Pettit succeeded in this crucial game 6 of 1958, traumatizing the “Father of Defense”, somewhat diminished by an ankle injury.\n\nAt the time, the local media are also happy to praise the merits of “white” Pettit against the African-American Russell. They are careful not to remind a public not yet flooded with continuous information this frightening anecdote: it was the Hawks who drafted Bill Russell two years earlier before giving up his rights to Boston against two players. Without the insistence of the great Red Auerbach, St Louis could have found himself in the place of the Celtics and crushed the NBA thanks to this terrifying duo …\n\nRacism plagues the Hawks\n\nLiving in Missouri in the 1950s or 1960s when you are not of the Caucasian type can be overwhelming. Lenny Wilkens, the Hall of Famer, says in his biography:\n\n“When I arrived in St Louis in 1960, I understood that things were different here. In the city center, I was not served in restaurants. I received despicable letters and my neighbors did everything to avoid me. come across or look at me “.\n\nWithin the team, executives like Pettit are passive and do not, at first, do much to protect their comrades who are victims of the prevailing racism. The climate deteriorated a little more in 1962, when coach Paul Seymour was instructed to reduce the role of Cleo Hill, an African-American, whose talent risks eclipsing Pettit, Cliff Hagan and Clyde Lovellette, the three white stars of the team. Seymour refuses and is sacked on the spot.\n\nThe hapless Hill, victim of a smear campaign across the entire league, will never tread a basketball court again. It’s the beginning of the end for the Hawks in St. Louis. As a symbol, it is in 1968, the year of the assassination of Martin Luther King, that they move to Atlanta, the birthplace of the pastor, to create a new identity.\n\nBob Pettit is now extremely rare in the media, much more in any case than the other myths of the league still alive. In 2010, in an interview with NBA.com, however, he explained:"}, {"url": "https://basketball.realgm.com/nba/teams/St-Louis-Hawks/45/Rosters/Current/1959", "page_content": "Al Ferrari was selected as the #1 pick in the 3 Round of the 1955 NBA Draft by the Milwaukee Hawks. Al Ferrari signed a contract with the St. Louis Hawks on July 8, 1955. Al Ferrari re-signed to a multi-year contract as a free agent with the St. Louis Hawks on September 1, 1958.\n\nDave Gambee was selected as the #6 pick in the First Round of the 1958 NBA Draft by the St. Louis Hawks. Dave Gambee signed a multi-year contract with the St. Louis Hawks on September 1, 1958.\n\nBob Pettit was selected as the #2 pick in the First Round of the 1954 NBA Draft by the Milwaukee Hawks. Bob Pettit signed a multi-year contract with the Milwaukee Hawks on July 17, 1954.\n\nHub Reed was selected as the #7 pick in the Second Round of the 1958 NBA Draft by the St. Louis Hawks. Hub Reed signed a multi-year contract with the St. Louis Hawks on September 1, 1958.\n\nWin Wilfong was selected as the #4 pick in the First Round of the 1957 NBA Draft by the St. Louis Hawks. Win Wilfong signed a multi-year contract with the St. Louis Hawks on September 1, 1957."}, {"url": "https://ftw.usatoday.com/2019/12/nba-finals-winners-by-team", "page_content": "The National Basketball Association as we know it fully came together in 1949, with many of its franchises consolidating and moving in the mid-1950s before expansion.\n\nThe 1950 Finals were won by the then-Minneapolis Lakers, led by future Hall of Famer George Mikan, and they won three of the next four. Since then, we’ve seen other franchises — the Boston Celtics, Los Angeles Lakers, Chicago Bulls, San Antonio Spurs and Golden State Warriors, to name a few — build dynasties and win multiple titles. Some others are still trying to get that elusive first championship.\n\nHere’s a complete list (through the 2019-20 season) of Finals wins by franchise:\n\nAtlanta Hawks: 1 (1958, as the St. Louis Hawks)\n\nBoston Celtics: 17 (1957, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1968, 1969, 1974, 1976, 1981, 1984, 1986, 2008)\n\nBrooklyn Nets: 0 (They won two in the ABA in 1974 and 1976)\n\nCharlotte Hornets: 0\n\nChicago Bulls: 6 (1991, 1992, 1993, 1996, 1997, 1998)\n\nCleveland Cavaliers: 1 (2016)\n\nDallas Mavericks: 1 (2011)\n\nDenver Nuggets: 0\n\nDetroit Pistons: 3 (1989, 1990, 2004)\n\nGolden State Warriors: 6 (They won one in the BAA in 1947, 1956 as the Philadelphia Warriors, 1975, 2015, 2017, 2018)\n\nHouston Rockets: 2 (1994, 1995)\n\nIndiana Pacers: 0 (They won three in the ABA in 1970, 1972 and 1973)\n\nLos Angeles Clippers: 0\n\nLos Angeles Lakers: 16 (They won one in the BAA in 1949, 1950, 1952, 1953, 1954 all as Minnesota Lakers; 1972, 1980, 1982, 1985, 1987, 1988, 2000, 2001, 2002, 2009, 2010)\n\nMemphis Grizzlies: 0\n\nMilwaukee Bucks: 1 (1971)\n\nMinnesota Timberwolves: 0\n\nNew Orleans Pelicans: 0\n\nNew York Knicks: 2 (1970, 1973)\n\nOklahoma City Thunder: 1 (1979 as the Seattle Supersonics)\n\nOrlando Magic: 0\n\nPhiladelphia 76ers: 3 (1955 as the Syracuse Nationals, 1967, 1983)\n\nPhoenix Suns: 0\n\nPortland Trail Blazers: 1 (1977)\n\nSacramento Kings: 1 (1951 as Rochester Royals)\n\nSan Antonio Spurs: 5 (1999, 2003, 2005, 2007, 2014)\n\nToronto Raptors: 1 (2019)\n\nUtah Jazz: 0\n\nWashington Wizards: 1 (1978 as the Washington Bullets)\n\n[jwplayer FSUJXoNr-q2aasYxh]"}, {"url": "https://www.sportscasting.com/hawks-often-forgotten-team-first-celtics-lakers-era-were-only-squad-beat-bill-russell-boston-dynasty-nba-finals/", "page_content": "While most usually only mention the Celtics and Lakers when discussing the NBA from the 1950s and 1960s, the Hawks played a major role in that era as well and did something the Lakers never could.\n\nSince their move to the Eastern Conference in 1970, the Atlanta Hawks haven’t had many realistic chances to win an NBA championship. Yes, there’s this current run by Trae Young & Co. and the highly underrated 2014-15 team that won 60 games and two playoff series before running into LeBron James and the Cleveland Cavaliers. But those are the only two times the Hawks have come close to reaching the NBA Finals since moving to the ATL in 1968.\n\nHowever, when the franchise was a member of the Western Conference as the St. Louis Hawks (and the first two years in Atlanta), the team was a consistent contender for the NBA title in the 1950s and 1960s. But that often gets overlooked as the two teams from that era that still receive the most attention to this day are the Los Angeles Lakers and Boston Celtics, who met seven times in the NBA Finals over those two decades.\n\nWhat most fail to remember is that the Hawks squared off with the Celtics in the NBA Finals four times in a five-season span back then. And in three of those seasons, the Hawks defeated the Lakers in the Western Conference Finals to reach the title series. And we certainly can’t forget to mention the Hawks did something the Lakers never could as they were the only team to beat 11-time champ Bill Russell in the NBA Finals.\n\nOf course, it has to be addressed that matching up with Russell and the Celtics wouldn’t have even been a thing had the Hawks not traded him to Boston on draft day in 1956. But the focus today isn’t a “what if” alternate timeline that has Russell playing his entire career with the Hawks. No, this is just a simple reminder that there were more than two teams truly competing for an NBA championship back in the day and that the Hawks were right in the thick of things for a solid 15 years.\n\nThe Hawks matched up with the Celtics in the NBA Finals four times in five years and beat the Lakers in the Western Conference Finals in three of those seasons\n\nAhead of the 1954-55 season, their final campaign in Milwaukee, the Hawks used the second overall pick in the NBA draft to select LSU All-American power forward/center Bob Pettit, who won Rookie of the Year and went on to become the greatest player in franchise history (sorry, Dominique, it’s true).\n\nPettit won the first of his two NBA MVP awards in his second season (the team’s first in St. Louis), averaging a league-best 25.7 points per game and 16.2 rebounds, and led the Hawks to their first playoff berth in six years. After beating the Lakers in the conference semis, St. Louis lost in the conference finals to the Detroit Pistons. But despite the loss, the Hawks proved they were going to be a force to be reckoned with for the foreseeable future, which is exactly what they became.\n\nOver the next five seasons, the Hawks reached the Western Conference Finals every year and only lost once, that defeat coming at the hands of the Lakers in 1959. However, on the other three occasions in which the Hawks and Lakers squared off to decide the NBA Finals representative from the West (1957, 1960, 1961), St. Louis came out on top, winning the first in a three-game sweep while the other two meetings went seven games. As for that fifth appearance, the Hawks defeated the Pistons in five games to reach the Finals in 1958.\n\nAs for those four meetings with the Celtics in the NBA Finals, yes, Boston won three of them. But it’s not as if the Hawks weren’t competitive, at least in two of the losses anyway. In their first meeting in 1957, the series went the distance with Game 7 going to double overtime, which Boston won by two. In 1960, the series again went seven games, although Game 7 wasn’t nearly as close as the Celtics won by 19 behind a 22-point, 35-rebound performance from Russell. The 1961 Finals weren’t nearly as competitive as Boston easily won the series in five games.\n\nBut let’s now switch focus to the series the Hawks won.\n\nThe Hawks were the only team to beat Bill Russell’s Celtics in the NBA Finals\n\nFollowing that dramatic seven-game loss to Russell and the Celtics in the 1957 NBA Finals, the Hawks came back strong the following season and, as mentioned, defeated the Pistons in five games in the Western Conference Finals to set up a rematch with Boston.\n\nWhile Pettit was still the leader of the team, small forward Cliff Hagan, whom the Hawks had acquired from Boston in the Russell trade, had become a star in his own right and earned the first of five consecutive All-Star selections in 1958, averaging 19.9 points and 10.1 rebounds in the regular season. And he showed out in Game 1 of the 1958 Finals, scoring a team-high 33 points as the Hawks stole the series opener in Boston Garden, 104-102. However, Boston evened the series with a 24-point win in Game 2, at which point the series shifted to St. Louis.\n\nGame 3 proved to be the most crucial contest of the series as not only did the Celtics lose the game, 111-108, but they also lost Russell to a severely sprained ankle, limiting him for the remainder of the series. And the Hawks took full advantage.\n\nBoston was able to even the series at 2-2 with a victory in Game 4, but Pettit took over from there. During Game 5 in Boston, he scored 33 points and pulled down 21 rebounds to lead the Hawks to a 102-100 win, and then he posted 50 points and 19 rebounds during a one-point victory in Game 6 to close out the series.\n\nMany still believe the Celtics would have won the series had Russell not gotten hurt, and that’s certainly a valid argument. But it’s not as if the Hawks hadn’t proved over two seasons that they could beat Boston with Russell on the floor, so that needs to be taken into account, as well.\n\nRussell and the Celtics went on to win the next eight NBA titles and 10 of the next 11. Their only series defeat during that stretch came at the hands of the Philadelphia 76ers in the 1967 Eastern Conference Finals, leaving the Hawks as the only team to beat Boston in the NBA Finals during its historic run of 11 championships in 13 seasons.\n\nDespite never getting back to the title series, the team made six more trips to the Western Conference Finals over the next decade\n\nSt. Louis Hawks superstar Bob Pettit | Getty Images\n\nWhile the Hawks never again reached the NBA Finals after losing to the Celtics in 1961, it’s not as if they just went away.\n\nYes, they had a terrible season in 1961-62, going 29-51 to miss out on the postseason for the first time since moving to St. Louis. But over their final eight seasons in the Western Conference (six in St. Louis, two in Atlanta), the Hawks made the playoffs every year and appeared in the Western Conference Finals six more times, four of those appearances coming against the Lakers, all of which they lost. But again, the Lakers could never get past Russell and the Celtics in the NBA Finals, losing seven times in seven tries from 1959 to 1969, perhaps because they had to expend so much energy to get past the Hawks in the West.\n\nSo the next time you find yourself in a conversation about the Celtics-Lakers rivalry of the ’50s and ’60s, try not to forget that the Hawks played a major part in the NBA’s original golden era.\n\nStats courtesy of Basketball Reference"}]}