{"Stan Heal played as a guard and was 6'3\" tall.": [{"url": "https://australianfootball.com/players/player/_/6702", "page_content": "AFL: 4,954th player to appear, 8,721st most games played, 6,214th most goals kickedMelbourne: 592nd player to appear, 838th most games played, 571st most goals kicked\n\nPacy, courageous and highly skilled, Stan 'Pops' Heal was one of Australia's finest wingmen of the 1940s. His WANFL career with West Perth comprised 180 games between 1939 and 1953, with a break for the war.\n\nIn 1941 he accomplished the rare feat of playing in two premiership sides in different states in the same season. Whilst temporarily stationed in Victoria, Heal lined up with Melbourne, and was on a wing as the Redlegs defeated Essendon in that year's VFL Grand Final. A week later he was back home in Perth completing the second half of an exceptional double as West Perth accounted for East Fremantle in the WANFL Grand Final. This time Heal played as a rover, but it was as a wingman that he achieved his greatest notoriety.\n\nThe West Perth teams of the half decade or so following World War II were among the finest in the club's history, and Heal was very much a lynch-pin, both as player and coach. He played in two premiership sides for the Cardinals, and won their fairest and best award in 1947. He coached the victorious Grand Final teams of 1949 against Perth and 1951 versus South Fremantle. Heal was also a regular interstate representative (18 appearances) winning a Simpson Medal against South Australia in 1949 and leading the Sandgropers at the Brisbane carnival the following year. In October 2000 he was named (more or less inevitably one ventures to presume) on a wing in West Perth official 'Team of the Century'.\n\nAuthor - John Devaney"}, {"url": "https://www.perthnow.com.au/news/wa/west-perth-wingman-stan-heal-inducted-into-afl-hall-of-fame-ng-addad495e4df9d61c3b92415fc743c1e", "page_content": "STAN \"Pops'' Heal will be remembered for his unique feat in 1941, when he played in two premiership teams in different states as a 21-year-old.\n\nThe dashing and fearless West Perth wingman, now 89, was last night inducted into the AFL Hall of Fame.\n\nHeal joined the navy in 1941 and was stationed in Fremantle until July and getting weekends off he was able to continue playing for West Perth.\n\nA transfer to Flinders Naval Depot in Melbourne made him a sought-after VFL recruit and Heal signed for Melbourne where he played eight games to bolster a side that had been ravaged by the war.\n\nHeal played in the Demons' 29-point Grand Final win over Essendon to complete Melbourne's hat-trick before fate ensured he would claim another premiership cup in the WANFL for West Perth over East Fremantle a week later.\n\n\"My course finished on the Friday and I played in the Grand Final on the Saturday with Melbourne, and then I was transferred back to Fremantle on the Monday,'' he said.\n\n\"I arrived back on the Thursday and West Perth happened to be playing in the Grand Final the following weekend. They had a few injuries so they asked me would I like a game and I said `yeah'.''\n\nThe war cost Heal four seasons of what would have been his prime, but he returned to West Perth in 1946 and became a legend of the club and of WA football.\n\nHe played 180 games for West Perth during the club's golden era and captain-coached the club to five Grand Finals and two flags.\n\nThe WA Football Hall of Fame legend also excelled for his state, playing 18 games for WA, winning the Simpson Medal in 1949 and leading his state in the 1950 carnival.\n\nAlong with his dream double-premiership week, Heal rates WA's win over Victoria in 1947 in Hobart and West Perth's surprise 1951 Grand Final triumph as major highlights.\n\nHeal said his induction gave some recognition to an era of WA football that had been largely overlooked and he was proud to accept it on behalf of a group of teammates who included fellow champions Ray Schofield, John Loughridge and Ray Scott.\n\n\"I'm very honoured. It's good for WA football and good for the West Perth club to get people nominated into any Hall of Fame,'' he said.\n\n\"WA has got a great history. It defeated Victoria a few times and most of the WA footballers who have gone to Victoria have always done very well.\n\n\"Every footballer's ambition was to play club football and get selected for your state. That was the highest honour you could have.\n\n\"I think they should have kept it going, and maybe kept the carnivals going. They were the highlights, the carnivals.''\n\nHeal said he still enjoyed modern football but preferred the game-style of his era.\n\n\"It will always always be a great game, but for me I'd rather see the old style. The longer-kicking and less handball and more position play,'' he said.\n\n\"All the players are up in one half of the ground. I try to work out the game plans but it's beyond me. Football has made more change than other sports in that regard.''\n\nSubscribe to our Email Newsletter"}, {"url": "https://thewest.com.au/news/wa/heal-story-really-was-the-stuff-of-legend-ng-ya-187598", "page_content": "Football romantics, hard-core statisticians, historians and icon worshippers paid tributes on both sides of Australia yesterday after the passing of a man known universally as Pops.\n\nStan \"Pops\" Heal, who died early yesterday aged 90, was all things to the game from when he first played for West Perth at senior level four months before the outbreak of World War II until 1952, when he retired as captain-coach of the club.\n\nThose times bookend an extraordinary career, intertwined with naval service during the war, which incorporated the remarkable feat of winning two premierships in a week in 1941 - with Melbourne in the then VFL and West Perth, where he played 180 games.\n\nIn Victoria to continue his naval training in 1941, the gifted wingman walked into a Melbourne team which had won the previous two flags, playing every second week before the grand final in which he was listed as one of the Demons' best.\n\nHe played only eight games for the club, but his unique story prompted Melbourne CEO Cameron Schwab to fly Heal to Victoria this year for a special Foundations Hero night when the Demons' new emblem was revealed.\n\nHeal's history was included as one of six players who helped define the club, along with the paths taken by Robbie Flower, Ron Barassi, Jim Stynes, Liam Jurrah and David Neitz, the first and only Demon to notch 300 games.\n\n\"It was fitting for Melbourne to get Pops to play because the club lost 21 players to wars, and this time the war brought one to us,\" Schwab said. \"I found him a totally engaging and charismatic man, and very, very modest.\"\n\nNoted WA and West Perth historian Brian Atkinson said football's production line no longer churned out players or men such as Heal, who this year joined the AFL's Hall of Fame after already being inducted as one of only 12 legends in the WA Football Hall of Fame.\n\n\"There is no doubt at all that Popsie was the greatest name in the history of the West Perth footy club,\" Atkinson said. \"Nobody could ever mount an argument that there's been a greater name in the club's history.\"\n\nWest Perth CEO Gerry O'Dea, who engineered the naming of the Stan Pops Heal Coaches' Box at the club's ground at Joondalup this year, said the club had lost a legend.\n\n\"The word is bandied about a bit these days but Pops was an absolute hero of this football club and had the respect of everybody. He was a completely revered figure,\" O'Dea said. \"He continued to support the club and knew the players and while he couldn't get to a lot of games, Pops still studied the game from the papers and television.\"\n\nHeal, whose sons Graham, Stephen and Laurie all played in the WAFL, was involved in three premierships at West Perth - as a player in 1941, captain-coach in 1949 and coach in 1951, when injury prevented him from playing.\n\nBecause State matches were abolished during the war, Heal made his first of 18 appearances for WA at 26 years of age.\n\nHe won the 1949 Simpson Medal against South Australia and was WA's captain-coach in 1950 at the Brisbane carnival.\n\nAs a wingman, and occasional rover, Heal was quick and smart with delightful skills, but he also made his mark as a coach, recording an astonishing 71 per cent win-loss record from 1947-52.\n\nHe is survived by wife, Glad, and his sons."}, {"url": "https://en-academic.com/dic.nsf/enwiki/10029379", "page_content": "Infobox afl player | firstname = Stan\n\nlastname = Heal\n\n\n\n\n\n\n\n\n\nbirthdate = 30 July 1920\n\nbirthplace =\n\noriginalteam = West Perth\n\nheightweight = 170 cm / 70 kg\n\ndead =\n\ndeathdate =\n\ndeathplace =\n\ndebutdate = 1941\n\ndebutteam = Melbourne\n\ndebutopponent =\n\ndebutstadium =\n\nplayingteams = Melbourne (1941)\n\n* 8 games, 5 goals\n\ncoach = notcoach\n\ncoachingteams =\n\nstatsend = 1941\n\ncareerhighlights =\n\n\n\nStan 'Pops' Heal (born 30 July 1920) was an Australian rules football er who played for Melbourne in the VFL as well as West Perth in the WANFL during the 1940s and early 1950s.\n\nHeal played his best football as a wingman but was also used on occasions as a rover. The Western Australian spent just one season at Melbourne, who had acquired his services while he was temporarily stationed in Victoria. Despite playing just eight games he was a member of Melbourne's 1941 premiership team. The following week he played in another premiership, back home in Western Australia with West Perth.\n\nHe was also regular interstate representative for Western Australia, winning a Simpson Medal for his performance in a game against South Australia in 1949 and captaining his state at the 1950 Brisbane Carnival.\n\nAs coach of West Perth from 1947 to 1952 he steered his club to two premierships, in 1949 and 1951.\n\nReferences"}, {"url": "https://afltables.com/afl/stats/players/S/Stan_Heal.html", "page_content": "Abbreviations key #=Jumper\n\nGM=Games played\n\nKI=Kicks\n\nMK=Marks\n\nHB=Handballs\n\nDI=Disposals\n\nDA=Disposal average\n\nGL=Goals\n\nBH=Behinds\n\nHO=Hit outs\n\nTK=Tackles\n\nRB=Rebound 50s\n\nIF=Inside 50s\n\nCL=Clearances\n\nCG=Clangers\n\nFF=Free kicks for\n\nFA=Free kicks against\n\nBR=Brownlow votes\n\nCP=Contested possessions\n\nUP=Uncontested possessions\n\nCM=Contested marks\n\nMI=Marks inside 50\n\n1%=One percenters\n\nBO=Bounces\n\nGA=Goal assist\n\n%P=Percentage of game played\n\nSU=Sub (On/Off)\n\n↑=subbed on\n\n↓=subbed off"}, {"url": "https://prabook.com/web/stan.heal/1865422", "page_content": "Stan Heal\n\nAustralian-rules footballer\n\nJuly 30, 1920 (age 90)\n\nHeal played his best football as a wingman but was also used on occasions as a rover. The Western Australian spent just one season at Melbourne, who had acquired his services while he was temporarily stationed in Victoria. The following week he played in another premiership, back home in Western Australia with West Perth. He was also regular interstate representative for Western Australia, winning a Simpson Medal for his performance in a game against South Australia in 1949 and captaining his state at the 1950 Brisbane Carnival. As coach of West Perth from 1947 to 1952 he steered his club to two premierships, in 1949 and 1951. Heal was inducted into the Australian Football Hall of Fame in 2010. He died on 15 December 2010."}, {"url": "https://criticalbody.com/6-3-nba-players/", "page_content": "This list of 6’3 NBA players shows that being shorter than average (for a basketball player) is no barrier to NBA success if you’re a master of your craft.\n\nWe’ll also debate whether or not 6’3 basketball players are at a disadvantage compared to their taller teammates and opponents.\n\nRelated Articles:\n\nWho are the best 6’3 NBA players?\n\nHere is an extensive list of the best 6’3 NBA players:\n\nJa Morant\n\nJamal Murray\n\nCole Anthony\n\nJrue Holiday\n\nDe’Aaron Fox\n\nAnfernee Simons\n\nC.J. McCollum\n\nRussell Westbrook\n\nImmanuel Quickley\n\nGoran Dragic\n\nGabe Vincent\n\nPat Spencer\n\nLuca Vildoza\n\nEric Gordon\n\nNorman Powell\n\nMalik Monk\n\nTre Mann\n\nCory Joseph\n\nJosh Cristopher\n\nLuguentz Dort\n\nJD Davison\n\nJason Preston\n\nTyTy Washington\n\nMatthew Dellavedova\n\nFrank Jackson\n\nThere are obviously a few more 6 3 NBA players than this, but the list should give you a good idea of the 6 foot 3 talent in the NBA.\n\nMost of these players are point guards and shooting guards, but some have also been known to play small forward.\n\nWhile 6 foot 3 is on the smaller side for a professional basketball player, there are countless 6’3 guards who’ve found lasting success in the NBA.\n\nAfter all, basketball is about skill. Sure, being tall is advantageous in many situations, but size alone doesn’t make someone an elite player.\n\nList of NBA guards that are 6’3\n\nHere is a big list of some of the best NBA guards that are 6’3 in alphabetical order:\n\nAnfernee Simons\n\nC.J. McCollum\n\nCole Anthony\n\nCory Joseph\n\nDavion Mintz\n\nDe’Aaron Fox\n\nEric Gordon\n\nFrank Jackson\n\nGabe Vincent\n\nGoran Dragic\n\nImmanuel Quickley\n\nJa Morant\n\nJamal Murray\n\nJason Preston\n\nJD Davison\n\nJordan Goodwin\n\nJosh Cristopher\n\nJrue Holiday\n\nLuca Vildoza\n\nLuguentz Dort\n\nMalik Monk\n\nMatthew Dellavedova\n\nNorman Powell\n\nPat Spencer\n\nRussell Westbrook\n\nTre Mann\n\nTyTy Washington\n\nWhile there have been some guards who are taller than 6’3, many of the top PG performers are 6’3 or even less.\n\nThere are plenty of 6’3 guards in the Eastern Conference as well as the Western Conference, meaning that prospects have numerous athletes to look up to.\n\nAs with any height, there are many decent to good players, but there are also some superstars as well.\n\nSo it just goes to show that, ultimately, it’s skill rather than height that NBA players are remembered and revered for (unless they’re incredibly tall or famous for other reasons).\n\nIs 6’3 short for the NBA?\n\nIs 6’3 short for the NBA? Yes, although a pretty tall height in general, 6’3 is short for the NBA because it’s around 3 inches below the average height.\n\nThe majority of NBA players are taller than 6 foot 3, but some of the best players are 6’3 and under, so it’s not like being tall automatically makes you more skillful.\n\nAdditionally, 6 foot 3 NBA players tend to be guards and have excellent ball handling abilities. So in this sense, if they’re great at getting their team into offense, it’s not like they need to be really tall.\n\nObviously, some coaches and fans are still stuck on the mindset that only tall guys can play basketball.\n\nIf you encounter a person who thinks this way, simply show them the extensive list of 6 3 NBA players to prove that height isn’t necessarily a barrier to NBA success and stardom.\n\nHow disadvantaged are 6’3 NBA players?\n\nWhile the sport of basketball in general and the NBA in particular naturally attracts a lot of tall athletes, you don’t need to be tall to find sporting success in the NBA.\n\nImagine if the best 6’3 NBA players had said to themselves that they were too short to play basketball; they would never have gotten off the ground!\n\nOn the contrary, some of the best NBA players of all time, irrespective of their height, are those who believed in themselves and their abilities and had positive influences around them.\n\nObviously, if you’re a 6’3 basketball player who’s still in high school, then you might get taller, meaning that you may end up playing a different position or changing your game to fit your developing physique.\n\nAnother good tip for shorter players is to put in more gym time. By having more muscle mass than your taller opponents, you won’t get out muscled as often, and you’ll have a bigger physical presence on the court, allowing you to be more explosive.\n\nThe verdict: What do the best 6’3 basketball players have in common?\n\nThe best 6 3 NBA players all share a common belief in their own skill set. This intrinsic self-motivation allows them to train with confidence that their efforts won’t be in vain just because they’re 6 foot 3.\n\nAs with any height, there are obviously plenty of 6 foot 3 basketball players who don’t make the NBA. Yet, the most skillful ones do. So don’t let your height dictate your basketball career.\n\nReferences"}, {"url": "https://www.wafootballhalloffame.com.au/inductees/6ecd5a20-4be1-11e9-abed-e964c3fd662e_stanley-heal", "page_content": "PLAYER: 1939-53\n\nGAMES: 206: West Perth 180; WA 18; Melbourne 8\n\nPREMIERSHIPS: West Perth 1941, captain-coach 49, 51; Melbourne 1941\n\nHONOURS: Coach of West Perth from 1947-52; Simpson Medal 1949; WA captain 1946, 51; WA captain-coach 1950; West Perth fairest and best 1947;\n\nLike many great players of this era, Stan Heal’s record would have been even better but for World War II which restricted him to 28 games in six seasons. However, the war did enable Heal to achieve what was then a unique football milestone.\n\nIn 1941 he became a VFL and WAFL premiership player seven days apart. Heal played with Melbourne during military training and was brought back to play in the grand final for West Perth. At his peak, regarded as the finest wingman in Australia and was selected in that position in The West Australian’s team of the Century. He finished second in the Sandover Medal in 1940, third in 1948 and 1950, and fifth in 1947.\n\nA great coach, he led West Perth for six seasons from 1947 to 1952, making five grand finals and winning two. Three sons – Stephen, Graham and Laurie – all played more than 100 league games each and were also fine footballers."}, {"url": "https://ballarelife.com/best-nba-players-who-are-6-3/", "page_content": "Best NBA Players Who Are 6’3″\n\nThe NBA is, perhaps, most famously known for its players and their above-averaged size and length. With many NBA players towering over the general populace, NBA players are generally not lacking in height.\n\nAnd while some NBA players, particularly those who play the center position, are as tall as 7-feet, most NBA players, generally, stand in at over 6-feet.\n\nBut just who are the best NBA players who are 6’3″?\n\nBelow, we are going to review the absolute best NBA players who are 6-foot 2-inches and how these players utilize their above-average height to dominate their positions on the court.\n\nLooking to see the best NBA players by height? Check out our following reviews:\n\nSteve Nash\n\nSteve Nash, born on February 7, 1974, is a Canadian basketball coach and former NBA player. Standing in at 6’3″, Nash is currently the head coach of the Brooklyn Nets.\n\nSteve Nash played in the NBA for 18 seasons during which time he was an eight-time NBA All-Star and a seven-time All-NBA selection. In addition, Nash won the NBA Most Valuable Player award twice, both times while playing for the Phoenix Suns.\n\nHaving had a successful high school basketball career in British Columbia, Nash earned a scholarship to Santa Clara University in California. In his four seasons at Santa Clara, the team made three NCAA Tournament appearances, and he was twice named the West Coast Conference Player of the Year.\n\nNash graduated from Santa Clara as the team’s all-time leader in assists and was taken as the 15th pick in the 1996 NBA draft by the Phoenix Suns.\n\nIn addition to his impressive basketball and NBA resume, Steve Nash has been honored for his various philanthropic efforts.\n\nIn 2006, he was named by Time Magazine as one of the 100 most influential people in the world. Nash was appointed to the Order of Canada in 2007 and invested to the order in 2016, and was awarded an Honorary Doctor of Laws from the University of Victoria in 2008. Nash has been a co-owner of the Vancouver Whitecaps FC of Major League Soccer (MLS) since 2011.\n\nJa Morant\n\nTemetrius Jamel Morant, or better known simply as “Ja” Morant, is one of the most electric, quick, and adept NBA players in the league. Standing in at 6’3″, he currently plays for the Memphis Grizzlies and has helped to lead the team deeper into the playoffs.\n\nBorn on August 10, 1999, Ja Morant played college basketball for the Murray State Racers where he was a consensus first-team All-American as a sophomore.\n\nMorant, though having been named All-Region Most Valuable Player three times and earning All-State honors at Crestwood High School in Sumter, South Carolina, was not heavily recruited out of high school and was unranked by the various recruiting services.\n\nHowever, he made an immediate impact at Murray State University and won the OVC Player of the Year and led the NCAA in assists in his sophomore year.\n\nSelected by the Memphis Grizzlies with the second overall pick in the 2019 NBA draft, he would go on to win the NBA Rookie of the Year award in 2020 and would be named to his first NBA All Star Game in 2022.\n\nRussell Westbrook\n\nAlthough Russell Westbrook’s recent struggles have been well-documented, he remains one of the best NBA players who are 6’3″. A current member of the Los Angeles Lakers, Westbrook is also one of the highest paid NBA players currently in the league.\n\nBorn on November 12, 1988, Westbrook played college basketball for the UCLA Bruins and earned third-team all-conference honors in the Pac-10. He was drafted with the fourth overall pick in the 2008 NBA draft by the Seattle SuperSonics.\n\nAn impressive basketball and NBA resume, Westbrook has been named the NBA Most Valuable Player in 2017 and is a 9-time NBA All-Star, a 2-time NBA All-Star Game MVP, and was named to the NBA 75th Anniversary Team.\n\nCJ McCollum\n\nChristian James McCollum, or simply CJ McCollum, was born on September 19, 1991 and currently plays for the New Orleans Pelicans. Having played college basketball for the Lehigh Mountain Haws, he was named the Patriot League Player of the Year in both 2010 and 2012.\n\nMcCollum was selected by the Portland Trail Blazers with the tenth overall pick in the 2013 NBA draft. Although he was a reserve his first two years in the league, he became a full-starter for the Trail Blazers in his third season after moving to the shooting guard position.\n\nAnd during his third season in the league, he was named the NBA Most Improved Player.\n\nJamal Murray\n\nJamal Murray was born on February 23, 1997, and is another Canadian NBA player. Having played just one year of college basketball for the Kentucky Wildcats, he was drafted by the Denver Nuggets with the seventh overall pick in the 2016 NBA draft.\n\nJohn Wall\n\nBorn on September 6, 1990, Johnathan Hildred Wall Jr., or simply John Wall, is a native from Raleigh, North Carolina and was chosen with the first overall pick by the Washington Wizards in the 2010 NBA draft.\n\nAnd similar to Jamal Murray, John Wall played just one year of college basketball for the Kentucky Wildcats.\n\nA five-time NBA All-Star, Wall was named to the All-NBA Team in 2017. However, multiple injuries in 2019 sidelines his career for more than two years and led to Wall becoming a free agent."}, {"url": "https://wiki2.org/en/Stan_Heal", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAustralian rules footballer and coach\n\nAustralian rules footballer\n\nStanley \"Pops\" Heal (30 July 1920 – 15 December 2010) was an Australian rules footballer who played for Melbourne in the Victorian Football League (VFL) as well as West Perth in the West Australian National Football League (WANFL) during the 1940s and early 1950s.\n\nHeal played his best football as a wingman but was also used on occasions as a rover. The Western Australian spent just one season at Melbourne, who had acquired his services while he was temporarily stationed in Victoria. Despite playing just eight games he was a member of Melbourne's 1941 premiership team. The following week he played in another premiership, back home in Western Australia with West Perth.[1]\n\nHe was also regular interstate representative for Western Australia, winning a Simpson Medal for his performance in a game against South Australia in 1949 and captaining his state at the 1950 Brisbane Carnival.[2]\n\nAs coach of West Perth from 1947 to 1952 he steered his club to two premierships, in 1949 and 1951.\n\nFrom 1953 to 1965 he was a Labor member of the Western Australian Legislative Assembly, representing the seat of West Perth until 1962 and Perth thereafter.[3]\n\nHeal was inducted into the Australian Football Hall of Fame in 2010.[4] He died on 15 December 2010.[5]\n\nYouTube Encyclopedic\n\n1 / 5 Views: 513 843 2 339 535 617 300 70 942 259 999\n\nEric Cantona kung-fu kick on Crystal Palace fan\n\nBlack Magic In Football\n\nManchester United legend crazy moment Roy Keane horror tackle that ended Alf-Inge Haaland's career\n\nArsenal - March 2011, Down But Not Out\n\n18 year old Sonny Bill Williams Humiliates Souths Player Transcription\n\nReferences"}]}