{"Stan Heal was inducted into the Minnesota Basketball Hall of Fame in 1994.": [{"url": "https://www.espn.com/espn/story/_/id/33654923/manu-ginobili-tim-hardaway-swin-cash-lindsay-whalen-13-member-hall-fame-class", "page_content": "Four-time NBA champion Manu Ginobili, five-time NBA All-Star Tim Hardaway, three-time WNBA champion and two-time gold medalist Swin Cash, and five-time WNBA All-Star and four-time WNBA champion Lindsay Whalen highlighted the 13-member Naismith Memorial Basketball Hall of Fame Class of 2022 that was announced Saturday.\n\nOther honorees included two-time NCAA Coach of the Year Bob Huggins, longtime NBA coach George Karl, longtime NBA referee Hugh Evans and former NCAA champion and WNBA Coach of the Year Marianne Stanley.\n\nAlong with those eight, six-time NBA All-Star Lou Hudson was elected by the Veterans Committee, six-time NBA All-Star and former coach Larry Costello and former coach Del Harris were elected by the Contributor Committee, former AIAW three-time All-American Theresa Shank-Grentz was selected by the Women's Veterans Committee, and Radivoj Korac, who once scored 99 points in a EuroLeague game, was chosen by the International Committee.\n\n2022 Hall of Fame Class The Naismith Memorial Basketball Hall of Fame Class of 2022, broken down by committee: North American Committee\n\nHugh Evans\n\nManu Ginobili\n\nTim Hardaway\n\nBob Huggins\n\nGeorge Karl Women's Committee\n\nSwin Cash\n\nMarianne Stanley\n\nLindsay Whalen Veterans Direct Elect Committee\n\nLou Hudson Direct Elect Contributor Committee\n\nLarry Costello\n\nDel Harris Women's Veterans Direct Elect Committee\n\nTheresa Shank-Grentz International Direct Elect Committee\n\nRadivoj Korac\n\n\"The Class of 2022 is ripe with individuals who have had a significant historical impact on the game we love,\" Hall of Fame president and CEO John L. Doleva said in a statement. \"We congratulate and thank them for everything they've done to better the sport and look forward to honoring them during Enshrinement this fall.\"\n\nThe enshrinement ceremony is set for Sept. 10 in Springfield, Massachusetts.\n\nGinobili is one of two players, along with Bill Bradley, to win a EuroLeague title, an NBA championship and an Olympic gold medal. Ginobili was a two-time All-Star, two-time All-NBA selection and the 2007-08 Sixth Man of the Year during his 16-year career with the San Antonio Spurs. He led his native Argentina to the gold medal at the 2004 Olympics.\n\n\"I was a part of two incredible teams; if it wasn't for being part of those two teams, I wouldn't be here,'' Ginobili said. \"It's not just about individual accomplishments. I never won a scoring championship, an MVP or even [All-NBA] first team. I'm here because of my surroundings, of the players I played with, of the coaches I was coached [by] and the organizations. I know I've been very lucky.''\n\nBut Ginobili did leave his mark on the game in the way he employed lateral movement after picking up his dribble to get up shots in the paint. It became known as the \"Eurostep,\" because Ginobili had played for a EuroLeague championship-winning team in Bologna, Italy, before coming to the NBA.\n\n\"I never saw that I created anything or brought anything new. I just played the only way I thought possible,\" Ginobili explained, bringing up the challenge of trying to score against 7-footer Shaquille O'Neal early in his career.\n\n\"I was not going to go over Shaq and dunk, I had to go around people,'' Ginobili said. \"That's the way my skill set and physical abilities found to get to the rim. I've done it since I can remember.\"\n\nHardaway, who won gold at the 2000 Olympics, was a five-time All-NBA selection, earning first-team honors in 1996-97 and second-team honors on three occasions. He ranks in the top 20 all time in assists and 12th in assists per game.\n\nCash was a four-time WNBA All-Star. In addition to her WNBA titles and Olympic gold medals, she was a two-time NCAA champion at UConn, where she helped lead the Huskies to a perfect 39-0 mark in 2001-02. Cash was inducted into the Women's Basketball Hall of Fame last year and currently serves as vice president of basketball operations for the New Orleans Pelicans.\n\nWhalen, a two-time Olympic gold medalist, was named to the WNBA first team in 2008, 2011 and 2013. She ranks third all-time in the WNBA in assists and led the league in the category five times. As a player at Minnesota, where she currently serves as head coach, Whalen led the Golden Gophers to the Final Four in 2004 and was named an All-American three times.\n\nWest Virginia coach Huggins has spent 39 seasons as a head coach with more than 900 career wins. He has led his teams to two Final Fours, once at Cincinnati and once with the Mountaineers.\n\nKarl was an NBA head coach for 27 seasons and is sixth in career victories with 1,175. He led Seattle to the NBA Finals in 1996 and was named the NBA Coach of the Year in 2013 with the Denver Nuggets.\n\nEvans officiated more than 1,900 regular-season games, 170 playoff games and 35 NBA Finals games over a 28-year career before stepping away from the court in 2001.\n\nStanley, currently the coach of the Indiana Fever, coached Old Dominion to an NCAA championship in 1984-85 and back-to-back AIAW titles in 1979 and 1980. She was named the WNBA Coach of the Year in 2002 with the Washington Mystics.\n\nHudson and Costello will both be inducted posthumously. Hudson played 11 seasons with the Hawks franchise and averaged 20.2 points over his 13-year NBA career. Costello was known as the last two-handed set shooter and led the NBA in free throw percentage twice.\n\nHarris was the NBA Coach of the Year with the Los Angeles Lakers in 1994-95 as part of a coaching career that spanned more than 50 years. Shank-Grentz was a member of three consecutive AIAW national champions at Immaculata University from 1972 to '74.\n\nKorac led Yugoslavia to a silver medal in the 1968 Olympics and FIBA World Cup silvers in 1963 and 1967. He holds the EuroLeague's single-game scoring mark with 99 points and was enshrined in the FIBA Hall of Fame in 2007. Korac died after a car crash in 1969.\n\nThe Associated Press contributed to this story."}, {"url": "https://www.espn.com/nba/story/_/id/31455606/paul-pierce-chris-bosh-chris-webber-ben-wallace-headline-2021-class-basketball-hall-fame", "page_content": "A day after watching his longtime friend and teammate Kevin Garnett enter the Naismith Memorial Basketball Hall of Fame, longtime Boston Celtics star Paul Pierce joined him in Springfield, Massachusetts.\n\nPierce, along with two-time champion and 11-time All-Star selection Chris Bosh, five-time All-NBA selection Chris Webber and four-time Defensive Player of the Year Ben Wallace, headlined the 2021 Hall of Fame class. The honor was announced the day after Garnett, Tim Duncan and the late Kobe Bryant officially were inducted as part of the 2020 class, which saw its entry delayed because of the COVID-19 pandemic.\n\nThe 2021 class will be enshrined on Sept. 11.\n\nWebber had been a finalist in each of the past five years before finally breaking through. Bosh and Pierce were among those who made it in their first year of eligibility.\n\nThe other members of the 2021 class:\n\nRick Adelman, longtime NBA coach\n\nJay Wright, two-time NCAA champion head coach\n\nBill Russell, who won two championships as a coach, for his time on the sideline\n\nYolanda Griffith, seven-time WNBA All-Star\n\nLauren Jackson, seven-time WNBA All-Star and three-time MVP\n\nBob Dandridge, by the veterans committee\n\nToni Kukoc, by the international committee\n\nPearl Moore, four-time AIAW Small College All-American, by the women's veterans committee\n\nClarence Jenkins, elected as an Early African-American Pioneer\n\nVal Ackerman, former WNBA president\n\nCotton Fitzsimmons, longtime NBA coach\n\nHoward Garfinkel, creator of the Five-Star summer camp\n\nPierce, alongside Garnett and Ray Allen, led the Celtics to the 2008 NBA title, along with winning Finals MVP that same year. He finished with 10 All-Star appearances, four All-NBA team selections and scored more than 26,000 points across his 19 seasons with the Celtics, Brooklyn Nets, Washington Wizards and LA Clippers.\n\nPaul Pierce was among those announced to be inducted into the 2021 Naismith Memorial Basketball Hall of Fame class on Sunday, a day after his former Celtics teammate Kevin Garnett was enshrined. AP Photo/Charles Krupa\n\nBosh, who was drafted fourth overall by the Toronto Raptors in 2003, spent seven years with Toronto before joining the Miami Heat as a free agent in 2010, teaming up with LeBron James and Dwyane Wade to advance to four straight NBA Finals, winning two of them (2012 and 2013). He also won a gold medal with Team USA in 2008, though his career was cut short by blood-clot issues that caused him to have to retire in 2017 while still in his prime.\n\n\"It was short-lived, in my opinion,\" Bosh said about his career. \"I wanted to play a lot longer; unfortunately it came to an abrupt end. But just looking back on everything I was able to accomplish, all the friends I was able to make, the connections I made, all the memories we were able to make together, that's what's most important.\"\n\nAfter being part of one of college basketball's most iconic teams as the top recruit of the Fab Five to attend the University of Michigan, Webber, the No. 1 pick in the 1993 NBA draft, was a five-time All-Star, five-time All-NBA selection and the NBA Rookie of the Year in 1994. His best years came playing for Adelman with the Sacramento Kings from 1998 to 2005, when he helped lead the Kings to seven of the 10 playoff appearances they've made in their 36 years in Sacramento -- and he was there all four times they won a playoff series.\n\n\"I'm just thankful man, thankful ... I'm just in shock, I really don't know what to say,\" Webber told his friend and former Michigan teammate Jalen Rose when asked for his reaction to the news.\n\nWallace, who went undrafted out of Virginia Union in 1996, developed into one of the best defensive players of all time and was the anchor of the great Detroit Pistons teams of the 2000s that won the title in 2004 and made it to six consecutive Eastern Conference finals. Wallace, who also played for the Wizards, Orlando Magic, Chicago Bulls and Cleveland Cavaliers, is tied with Dikembe Mutombo for the most Defensive Player of the Year honors (four) in a career, and he made four All-Star teams, five All-NBA teams and five All-Defensive teams.\n\nAdelman made it to two NBA Finals and won more than 1,000 games as a coach with the Portland Trail Blazers, Sacramento Kings, Houston Rockets and Minnesota Timberwolves, while Wright lifted Villanova back to the top of the college basketball world, winning titles in 2016 and 2018 and making three Final Fours during his time in Philadelphia.\n\n\"It's pretty amazing,\" Wright said. \"You showed the picture of all those guys -- Bill Russell, KG, Chris Webber -- and just to be hanging with these guys right now and listening to their stories and being part of the Hall with them, and this class, it's nothing you'd ever even dream of. It's pretty cool.\"\n\nRussell, one of the greatest players of all time and the NBA's first Black head coach, won a pair of titles as the Celtics' coach in the late '60s. He had previously been enshrined as a player in 1975. He becomes the fifth Hall of Famer who'll be inducted as both a player and a coach, joining John Wooden, Lenny Wilkens, Bill Sharman and Tommy Heinsohn.\n\nJackson was a three-time MVP and won two championships with the Seattle Storm, while Yolanda Griffith was the 1999 WNBA MVP and led the Sacramento Monarchs to the title in 2005.\n\n\"I'm very, very proud just to be given an opportunity,\" Griffith said of her time in the WNBA. \"I got drafted in '99, No. 2 pick to the Sacramento Monarchs, and it was a joy because that gave me an opportunity to be back home from playing over in Europe. It gave my family a chance to see me play, finally, on the professional level, and just enjoy playing at that level on the highest level, basically. I enjoyed the ride with the Sacramento Monarchs.\"\n\nAlso Sunday, the Hall said ESPN vice president of women's sports programming Carol Stiff is this year's recipient of the John W. Bunn Lifetime Achievement Award. She will be honored during Hall of Fame weekend.\n\nThe Associated Press contributed to this report."}, {"url": "https://www.espn.com/nba/insider/insider/story/_/id/34464189/basketball-hall-fame-2022-most-clandestine-hall-fame-voting-process-all-sports", "page_content": "BOB COUSY TURNED 94 years old last month, and the Boston Celtics legend believes nearly half of his life has been spent affiliated with the Naismith Memorial Basketball Hall of Fame.\n\n\"I've served in just about every capacity on every committee,\" the \"Houdini of the Hardwood\" says with pride one summer morning, calling from his home in Worcester, Massachusetts, about an hour's drive east from the hall in Springfield. The 13-time All-Star, six-time champion and 1957 NBA MVP was inducted as a player in 1971. Nearly two decades later, in 1989, Cousy became the first Hall of Famer to be named president of the hall itself -- a short stint that he says was more honorary than hands-on.\n\nFor all his involvement, Cousy admits that he has one notable blind spot: how someone becomes a Hall of Famer.\n\n\"Because of my reasons or someone else's,\" he says, \"I've never taken time to inform myself on the voting process.\"\n\nThere's a primer on the hall's website, but it doesn't provide identities of the voters themselves, a sharp contrast from the respective halls for professional hockey, football and baseball. So who are the voters? Who picks them? And why is the whole procedure shrouded in mystery?\n\nThese are among Cousy's queries, and when details -- provided to ESPN by those who have voted (and who largely wanted to remain anonymous) along with top executives at the hall -- are shared with Cousy, he pauses, then offers a long \"hmmmmmm.\"\n\n\"It sounds byzantine,\" Cousy says. \"It probably wouldn't pass a Supreme Court muster.\"\n\nThe hall's latest class, a 13-member group that features Manu Ginobili, Tim Hardaway, Bob Huggins, Swin Cash and Lindsay Whalen, among others, will be enshrined in basketball's birthplace this weekend. How that class came about, exactly, is unclear, because the Basketball Hall of Fame is the least transparent among the halls in perhaps all of sports.\n\nThe election process for the Basketball Hall of Fame is so secretive, in fact, that its final ballots are destroyed.\n\nEACH OF THE four major Halls of Fame has similar procedures for inducting members. There are requirements for eligibility, largely based on years removed from the league itself, and then committees that screen nominees and another for the final vote. The bar for induction is high in all four: nominees must receive either 75% or 80% of possible votes for enshrinement. Some halls, such as hockey and basketball, have limited voting terms for committee members who vote; others are open-ended.\n\nBut the Basketball Hall of Fame is different from its brethren in two striking ways. The first is that the other halls focus only on inducting members from their sports' professional ranks in North America, whereas Naismith encompasses all levels and genders of the entire sport globally: the NBA, WNBA, college, high school, international, men's, women's -- you name it. This is the case despite the fact that there are halls of fame for college basketball (in Kansas City), women's basketball (in Knoxville, Tennessee) and international basketball (the FIBA hall in Madrid).\n\n\"I think that sets us apart,\" says Jerry Colangelo, the hall's chairman since 2009. \"We represent the game of basketball, on all levels. And whether there are other hall of fames within basketball doesn't matter. That's fine.\"\n\nThen there's the voting.\n\nFor both the hockey and football halls, the identities of the voters are listed online. And in baseball, where only writers vote, all 394 members of the Baseball Writers' Association of America who voted in the 2022 Hall of Fame election are also listed online. (Ballots from BBWAA voters who want theirs to be public will be listed online at a later date, too.)\n\nWith the Basketball Hall of Fame, the only online description of the anonymous voters' identities is an in-house mention that the two 24-person honors committees (one for North American men and one for women) are comprised of \"Hall of Famers, basketball executives and administrators, members of the media, and other experts in the game of basketball.\"\n\n\"There's not any major reason why we're different from anyone else,\" Colangelo says. \"It's just that it's always been that way, because we want to protect the people who are voting, who are involved in the process, and that eliminates a lot of things that do happen, conceivably, in the other sports, in terms of influencing those people who are voters. There's potentially an integrity issue if names are out there in the public. We have active coaches, we have active general managers, we have media people who are all involved. We have Hall of Famers who are involved. And so there's no requirement to disclose those names.\n\n\"What does that accomplish?\"\n\nBoth Colangelo and John Doleva, the hall's president and CEO since 2001, say that anonymity -- which Doleva says has been part of the voting process for as long as he can remember -- serves a greater purpose than transparency.\n\nJerry Colangelo, the current chairman of the Naismith Memorial Basketball Hall of Fame, was inducted into the Hall in 2004. Andrew D. Bernstein/NBA/Getty Images\n\n\"All the halls of fame are flawed in a way because it's like in any voting. There's bias,\" says one former voter. \"The one thing is that it's not corrupt. No one -- Jerry or anybody in the NBA -- have ever leaned on me in any of those situations.\"\n\nGranting anonymity also allows the hall to tap into a deeper pool of voters with significant experience in the game -- voters who wouldn't participate if their vote were made public.\n\n\"If I could show you the list, you would nod your head and go, 'Wow,'\" Doleva says.\n\nDoleva continues, \"Why is there confidentiality? It's not because we want to be secretive. It is to protect you, the voter, and give you the reassurance that your vote and your comments are not going to be circulated so you find yourself in an uncomfortable situation.\"\n\nAn uncomfortable situation like a legendary player on a screening committee who said an eligible teammate wasn't Hall of Fame worthy and thus didn't vote for them. This particular instance, several voters say, has happened multiple times.\n\n\"It really gave me an added measure of respect that they valued the game that much,\" one former voter says, recalling witnessing just such an incident.\n\nColangelo and some former voters note that the pool of voting expertise that the hall draws from is deeper than some other halls of fame, with participants all taking part not just on the final voting committees but on the screening committees, too (the North American screening committee has nine members and the women's screening committee has seven members).\n\nBaseball, in comparison, relies only on media members to vote.\n\n\"I don't like the baseball thing, because it's just writers,\" the former voter says. \"They don't know enough about the game. They're not involved in baseball.\"\n\nHowever, hockey's voting body is made up of former players, executives, coaches and media, and their identities are all public.\n\nStill, Basketball Hall of Fame voters are reminded not to publicly reveal their identity as a voter or to discuss how they ultimately voted. The penalty for doing otherwise? Doleva says he's not sure.\n\n\"To be honest, we have never had any violations of it that has come back to me in terms of media,\" he says.\n\nLongtime NBA journalist Peter Vecsey, a former voter, would like a word.\n\n\"I want everything I say to be on the record,\" he begins.\n\nLIKE OTHER VOTERS, Vecsey was sworn to secrecy about his role as a voter.\n\n\"I never told anybody, except you,\" he says. \"So I played it pretty close to the vest.\"\n\nWhat Vecsey -- and others who have voted -- recall is first receiving a booklet in the mail containing the names and biographies of nominated individuals eligible for induction that year. In a typical year, that booklet contains anywhere from 40 to 50 names.\n\nIn early February, the nine-member North American screening committee gathers in its Manhattan headquarters (though the COVID-19 pandemic forced those meetings onto a Zoom call) to debate and discuss the names in the booklet and, ultimately, whittle that list of players, coaches and referees down to no more than 10.\n\nEach candidate must receive at least seven votes to make the final cut, which is then mailed out to the 24-member honors committee in the second week in March; members receive that list, mark yes or no on each candidate, then mail their ballots back to the hall. Those final ballots are then tallied by a lawyer and eventually shredded \"so that there is not a paper trail to go back and somehow find that some individuals voted in some way -- again, to protect the process,\" Doleva says.\n\nESPN Daily podcast Monday through Friday, host Pablo Torre brings you an inside look at the most interesting stories at ESPN, as told by the top reporters and insiders on the planet. Listen\n\nElectees are announced at the NCAA Men's Final Four in April, when anxious hopefuls wait by the phone, but the real tension of the entire Hall of Fame induction process comes in that room where the screening committee gathers. The meetings can last several hours and the level of debate on each individual candidate can be intense. For some attendees, this meeting marks the best part of being a voter: to hear the game's greats discussing teammates and colleagues in an unfiltered manner.\n\n\"It gets really, really spirited and heavily debated -- but in a good way, where it's not disrespectful,\" says one former voter.\n\nSays another former voter, \"You know you're either denying somebody or promoting somebody to go to the next level and get into the Hall of Fame and how serious that is. A lot of times, it's just a thin thread separating one person from another person.\"\n\nSome enter the room campaigning for those they played with, coached, worked alongside or covered as a member of the media. Vecsey says when he was a voter in the immediate years after receiving the Hall's Curt Gowdy Media Award in 2009, he campaigned for Dennis Rodman, who was inducted in 2011. Other voters say they, too, campaigned for certain eligible members.\n\n\"Sometimes you feel very strongly about a person that you might not even know that well, but you just know their impact on the game,\" says another former voter. \"And it doesn't go your way. But you respect why it didn't.\"\n\nSome attendees -- which include Colangelo and Doleva -- are talkative, others less so. But there are plenty of stories, as players will share what it was like playing against eligible players, or coaches will share what it was like coaching that player, and on and on.\n\n\"There's a lot of room for mischief,\" a tongue-in-cheek Vecsey says. But Vecsey and all former voters who spoke with ESPN say they believe that, despite any criticisms of their own or beliefs that there should be transparency, the vote, ultimately, is fair.\n\n\"I think the vote is fair,\" Vecsey says. \"Jerry has a say like everybody else in the room. But he doesn't have more to say.\"\n\n\"It sounds byzantine. It probably wouldn't pass a Supreme Court muster.\"\n\nDoleva and Matt Zeysing, a historian and curator at the hall, help create lists of potential voters for all the committees, then the list is presented to Colangelo for final approval. Voters serve staggered three-year terms, so the voting committees turn over regularly.\n\n\"We always try to keep up the appropriate representation -- male, female, Hall of Famers, coaches, etc.,\" Colangelo says. \"We like how we balance this thing off so that each segment of the basketball world is represented.\"\n\nAfter the screening committee finishes its vote, the finalists are then reviewed by the Hall's board of trustees, and according to the hall's site, \"At this time, should it be determined by the Board of Trustees that a Finalist has damaged the integrity of the game of basketball, he/she shall be deemed not worthy of Enshrinement and removed from consideration.\"\n\nThe topic of off-court issues does come up, several voters say.\n\n\"To the best of my recollection, or the time I've been involved, there's only been a few cases where that's even been a conversation,\" Colangelo says. \"We don't have a lot of individuals who have checkered pasts as it relates to personal conduct and things like that. But everything is always discussed.\"\n\nThere is always a question of what qualifies one to be a Hall of Famer: What is the criteria? To Colangelo, the answer is simply their \"body of work,\" which leaves room for interpretation.\n\n\"That becomes sort of a discussion point -- of what he would think as a Hall of Famer might not be what somebody else might not think as a Hall of Famer,\" says one former voter.\n\nSays another former voter, \"I look at who's in the hall. You use that as your bar.\"\n\nSome voters say the ambition to represent the entire sport can make it challenging when, say, a high school coach they're unaware of becomes eligible. Others say the votes at times are more representative of NBA success.\n\n\"Everything was basically being judged on your NBA career,\" one former voter says.\n\nWith voting, several who spoke to ESPN say the biggest dilemma is that some years are so stacked with obvious choices -- such as two years ago, when Kobe Bryant, Tim Duncan and Kevin Garnett were all up for election for the first time -- that it blocks out other deserving candidates. (In the case of 2020, that was Chris Bosh, another first-year-eligible player who had to wait until 2021 to get the call.)\n\nVoters told ESPN that some Hall of Famers -- like Michael Jordan -- are no brainers, while others generate hours of debate among the voting committee. Jim Rogash/Getty Images\n\n\"There's always some of you out there that some people will say, 'Well, how could he not get in the Hall of Fame?'\" Colangelo says. \"My response is, well, thus far, that's true. That doesn't mean it's not going to happen.\"\n\nThe committee also walks a fine line on the urgency to induct deserving members before they die or become compromised by health issues that prevent them from even speaking during their induction process.\n\n\"Why not sooner than later?\" says one official affiliated with the hall. \"Why drag it out? Some of these guys get in after they die. Why not let them enjoy it now?\"\n\nSays Vecsey, \"There's nothing worse to me than getting an award posthumously.\"\n\nLarry Costello, an NBA champion as a player (1967) and a coach (1971), is being inducted this year as a contributor after he died in 2001. Vecsey plans to attend the ceremony in honor of Costello, who will be represented by family.\n\n\"That is a sad thing,\" Colangelo says of those being inducted posthumously. \"I don't know of any solution. You can't just say, 'Well this guy may die in three years, so we've got to get him in.'\"\n\nIT WAS A Monday morning in Denver when George Karl got the call this year. He was told it would come whether he was inducted or not. Karl says he hadn't wondered too much about going into the hall during his 27-season NBA coaching career, but when he crossed the 1,000-win mark -- something only 10 NBA coaches have done -- he started to hear from friends, family and colleagues that he might be next in line. But he didn't want to think about it too much or even look into how it all worked too carefully.\n\n\"I thought if I studied the process, I would jinx it,\" Karl says.\n\nGeorge Karl will be enshrined as part of the Basketball Hall of Fame's Class of 2022. AP Photo/Seth Wenig\n\nHe did find himself asking some questions about the process to former NBA head coach Don Nelson, who was inducted in 2012, when the two would golf together.\n\nThis year, the call came from Doleva, who told Karl he was one of the members of the Class of 2022. Karl, who is 71, was elated, quiet, reflective. He called friends and family, and he says he later found out that Gary Payton, whom Karl coached in Seattle, was a voter this year and \"was really prominent in getting me elected,\" Karl says. (Colangelo and Doleva declined comment regarding whether Payton was or has been a voter.)\n\nKarl last coached in the NBA in 2016. His Hall of Fame wait was seven years, which is nothing compared to Spencer Haywood, a 1980 NBA champion, four-time NBA All-Star, 1970 ABA MVP and Olympic gold medalist.\n\n\"My waiting process was 27 years,\" says Haywood, who was inducted in 2015 after retiring in 1983. \"I was a finalist three times. Each time I didn't get in, I was hurt, crushed, feeling bad and not knowing why. But I stayed the course.\"\n\nHaywood, who averaged 20.3 points and 10.3 rebounds in an NBA and ABA career that spanned from 1969 to 1983, says he never got an explanation of what took so long, and he figured, at one point, that if it didn't happen, so be it, because his career had always been unusual anyway. Maybe it was payback, in a way?\n\n\"Because when you sue the NBA and the NCAA all the way to the Supreme Court\" -- as Haywood did in 1970, winning a case that challenged eligibility rules and changed the course of the NBA -- \"you're gonna catch some hell,\" Haywood says.\n\nIt's your league. Run it how you want. Choose your league size, customize the scoring and set the rules you want to follow in order to create the fantasy basketball league you want to play in. Create your custom league for free!\n\nDuring his wait, Haywood says he didn't lose hope, as he looked to former South Africa president Nelson Mandela, who was imprisoned from 1962 until 1990.\n\n\"He had 27 years in the hole,\" Haywood says, \"and he never lost hope.\"\n\nOn the other side of the waiting spectrum is Dick Barnett, a two-time NBA champion with the New York Knicks in 1970 and 1973, two-time NBA All-Star and a three-time NAIA champion at Tennessee A&I (now Tennessee State University).\n\nBarnett, who will turn 86 on Oct. 2, has been inducted into the NAIA Hall of Fame, the Indiana Basketball Hall of Fame, the Tennessee Sports Hall of Fame, the National Collegiate Basketball Hall of Fame and the Small College Basketball Hall of Fame. In 2019, the Naismith Hall of Fame inducted Barnett's Tennessee A&I teams of 1957, 1958 and 1959.\n\nBut he is still waiting for a call as a player.\n\n\"I think that whole process has been tremendously compromised,\" says Barnett, whose No. 12 was retired by the Knicks in 1990. \"Are they going by players' abilities and records and accomplishments? Because Dick Barnett should've been in the Hall of Fame 50 years ago.\"\n\nAt this point, Barnett has lost several teammates, and time isn't on his side. Does he think he'll live to see the day when the hall might induct him?\n\n\"I'm not really concerned about that,\" Barnett says. \"Looking at my accomplishments, I really feel that whatever that hall of fame is, I should've been inducted. I've been inducted into five or six halls of fame. At this point. I'm not even concerned about that. I know what kind of player I was.\""}, {"url": "https://www.cbsnews.com/minnesota/news/2nd-class-inducted-into-minnesota-basketball-hall-of-fame/", "page_content": "MINNEAPOLIS (WCCO) -- The Minnesota Basketball Hall of Fame is only in its second year of existence.\n\nThe concept is to honor the rich heritage of the sport in this state. And what they are finding is a whole lot of rich heritage for basketball in the state.\n\nFormer Gopher Athletic Director Joel Maturi has been instrumental in starting it.\n\nThere is an eight time champion coach in this class -- Ken Novak Jr. from Hopkins.\n\nAnd one of the players, Kris Humphries, moved on, drafted in the first round on his way to 13 NBA seasons – but he learned much in high school.\n\nSo they made it a day, induced at halftime of the Minnesota Timberwolves game. And it is the Wolves and Minnesota Lynx that are leading the way to help celebrate basketball at all levels, and pay respects to what has been.\n\nWhat it's in part about is understanding what the sport should be about, and whether you win a title or make the hall of fame.\n\nAnd on these nights there are so many stories to support just that, and so many people to support the memories.\n\nFrom every era, and to honor the spirit of a sport that is still thriving today."}, {"url": "https://www.espn.com/nba/story/_/id/28220366/basketball-hall-fame-class-2023-news-schedule-more", "page_content": "The Naismith Memorial Basketball Hall of Fame will enshrine a new class of legends in Springfield, Massachusetts, this summer. The full list of nominees from the North American and women's committees were unveiled in December. Finalists for enshrinement were announced ahead of NBA All-Star Weekend in Salt Lake City, and the full class was announced as part of the NCAA men's basketball Final Four weekend in Houston.\n\nThe Class of 2023 will be officially enshrined in the Hall of Fame on Saturday, Aug. 12. The new summer date reflects an effort for enshrinement weekend to be more accessible to fans and guests -- a change of date from recent celebrations that were held the week after Labor Day.\n\nEnshrinement weekend will begin at Mohegan Sun in Connecticut on Friday, Aug. 11, with the tip-off celebration and awards gala, inclusive of the Class of 2023 jacket and ring presentation and the annual Hall of Fame Awards. The enshrinement ceremony will take place the following day in Springfield's historic Symphony Hall.\n\nMORE: Inside the most clandestine hall of fame voting process in all of sports\n\nClass of 2023: North American Committee\n\nGene Bess (coach)\n\nAll-time winningest college basketball coach across all levels\n\n1,300 wins in 50 seasons at Three Rivers Community College\n\nGary Blair (coach)\n\n852-348 in 37 seasons at Stephen F. Austin, Arkansas and Texas A&M\n\nWon 2011 women's NCAA tournament title at Texas A&M\n\nPau Gasol (player)\n\n17.0 PPG, 9.2 RPG, 3.2 APG in 18 seasons with Grizzlies, Lakers, Spurs, Bulls and Bucks\n\nSix-time All-Star, four-time All-NBA selection\n\nWon NBA titles in 2009 and 2010 with Lakers\n\nBecky Hammon (player)\n\n13.9 PPG, 3.8 APG in 16 seasons with Liberty and Stars\n\nSix-time All-Star\n\nNamed to WNBA's 15th, 20th and 25th anniversary teams\n\nDavid Hixon (coach)\n\nLed Amherst College to 826 wins in 42 seasons\n\nNamed Division III Coach of the Year in 2007 and 2013\n\nGene Keady (coach)\n\nWon 550 games in 27 seasons at Western Kentucky and Purdue\n\nWon National Coach of the Year six times (1984, 1988, 1994, 1995, 1996, 2000)\n\nDirk Nowitzki (player)\n\n20.7 PPG, 7.5 RPG, 2.4 APG in 21 seasons with Mavericks\n\n14-time All-Star, 12-time All-NBA selection; 2007 NBA MVP\n\nWon 2011 NBA championship with Mavericks\n\nTony Parker (player)\n\n15.5 PPG, 5.6 APG in 18 seasons with Spurs and Hornets\n\nSix-time All-Star, four-time All-NBA selection\n\nWon NBA titles with Spurs in 2003, 2005, 2007 and 2014\n\nGregg Popovich (coach)\n\nNBA's all-time winningest coach with more than 1,360 wins with Spurs\n\nWon NBA titles in 1999, 2003, 2005, 2007 and 2014\n\nDwyane Wade (player)\n\n22.0 PPG, 4.7 RPG, 5.4 APG in 16 seasons with Heat, Bulls and Cavaliers\n\n13-time All-Star, eight-time All-NBA selection\n\nWon NBA titles in 2006, 2012 and 2013 with Heat\n\nClass of 2023: Direct Elect Committees\n\nWomen's Veterans Committee Enshrinee\n\n1976 U.S. Olympic Team (team)\n\nContributor Committee Enshrinee\n\nJim Valvano\n\nInternational Committee Finalists\n\nJackie Chazalon\n\nMirza Delibasic\n\nDusan Ivkovic\n\nSemen Khalipski\n\nVladimir Kondrashin\n\nEduardo Lamas\n\nMarcos Leite\n\nShimon Mirrahi\n\nAmaury Pasos\n\nManuel Sainz\n\nTogo Soares\n\nRanko Zeravica\n\nVeterans Committee Finalists\n\n1936 U.S. Olympic Team (team)\n\n1972 U.S. Olympic Team (team)\n\nDick Barnett (player)\n\nTom Blackburn (coach)\n\nSid Borgia (referee)\n\nCharles Brown (player)*\n\nFreddie Brown (player)*\n\nJack Coleman (player)\n\nCharles Eckman (referee)\n\nLeroy Edwards (player)\n\nLeo Ferris (contributor)\n\nHy Gotkin (player)\n\nTravis Grant (player)\n\nJack Hartman (coach)*\n\nCam Henderson (coach)\n\nRobert Hopkins (player)\n\nCharles Keinath (player)\n\nGreg Kelser (player)*\n\nKentucky Wesleyan 1966, 1968, 1969 (team)\n\nBob Love (player)\n\nLoyola of Chicago (team)\n\nBilly Markward (contributor)\n\nEd McCluskey (coach)\n\nJack McKinney (contributor)\n\nBill Melchionni (player)*\n\nFrancis Meehan (player)\n\nLucias Mitchell (coach)\n\nDonald \"Dudey\" Moore (coach)\n\nJoe Mullaney (coach)\n\nWillie Naulls (player)\n\nNorth Catholic High School Junior Varsity (Philadelphia, PA) (team)\n\nDon Otten (player)*\n\nPhiladelphia SPHAS (team)\n\nKevin Porter (player)*\n\nGlenn Roberts (player)\n\nLennie Rosenbluth (player)\n\nKenny Sailors (player)\n\nFred Schaus (contributor)\n\nSam Schulman (contributor)\n\nPaul Silas (player)\n\nDick Van Arsdale (player)\n\nTom Van Arsdale (player)\n\nLambert Will (contributor)*\n\nMax Zaslofsky (player)\n\n* First-time nominee\n\nRecent Hall of Fame classes\n\n2022: Sonny Boswell, Swin Cash, Larry Costello, Hugh Evans, Manu Ginobili, Tim Hardaway, Del Harris, Lou Hudson, Bob Huggins, Inman Jackson, George Karl, Radivoj Korac, Albert Pullins, Theresa Shank-Grentz, Marianne Stanley, Lindsay Whalen\n\n2021: Val Ackerman, Rick Adelman, Chris Bosh, Bob Dandridge, Lowell Fitzsimmons, Howard Garfinkel, Yolanda Griffith, Lauren Jackson, Clarence Jenkins, Toni Kukoc, Pearl Moore, Paul Pierce, Bill Russell, Ben Wallace, Chris Webber, Jay Wright\n\n2020: Patrick Baumann, Kobe Bryant, Tamika Catchings, Tim Duncan, Kevin Garnett, Kim Mulkey, Barbara Stevens, Eddie Sutton, Rudy Tomjanovich\n\n2019: Al Attles, Carl Braun, Charles \"Chuck\" Cooper, Vlade Divac, Bill Fitch, Bobby Jones, Sidney Moncrief, Jack Sikma, Tennessee A&I teams from 1957 to 1959, Wayland Baptist University teams of 1982-84, Teresa Weatherspoon, Paul Westphal\n\n2018: Ray Allen, Maurice Cheeks, Charles \"Lefty\" Driesell, Grant Hill, Jason Kidd, Steve Nash, Tina Thompson, Dino Radja, Charlie Scott, Ora Mae Washington, Rod Thorn, Rick Welts, Katie Smith\n\n2017: Robert Hughes, Tracy McGrady, Bill Self, Rebecca Lobo, Muffet McGraw, Mannie Jackson, Tom Jernstedt, Jerry Krause, Zack Clayton, Nick Galis, George McGinnis\n\n2016: Zelmo Beaty, Darell Garretson, Allen Iverson, Tom Izzo, John McClendon, Yao Ming, Shaquille O'Neal, Cumberland Posey, Jerry Reinsdorf, Sheryl Swoopes"}, {"url": "https://www.mnbasketballhub.com/news_article/show/1220188", "page_content": "Ziggy Kauls never really believed he’d have a reunion with Mark Landsberger, who helped Mounds View to the Class 2A boys’ basketball state championship in 1973, but he hoped.\n\nThey got close Thursday. Both were inducted into the Minnesota High School Basketball Hall of Fame in a ceremony at the Lumber Exchange Building in downtown Minneapolis.\n\nKauls, 81, who retired in 2015 with 739 victories in a 45-year career at Mounds View High School, would have loved a chance to catch up with his 6-8 bruising forward, but the reality is that Landsberger, who played professionally for 16 years, has kept a low profile since retiring from basketball in 1993.\n\n“He lives in St. Cloud, taking care of his parents,” said Kauls, who walks with a cane but remains sharp.\n\nLandsberger, who played one season for the Gophers before transferring to Arizona State, carved out a lengthy professional career thanks to his willingness to chase rebounds. He won two NBA titles, in 1980 and 1982, with the Los Angeles Lakers. In his seven seasons in the NBA, Landsberger had more rebounds (2,681) than points (2,468).\n\nRecently, Landsberger’s profile became elevated through the HBO Series “Winning Time,” which chronicles the rise of the Lakers in the 1980s. Landsberger is seen often, albeit in a non-speaking role, on the series.\n\nKauls remembers Landsberger as a relentless rebounder who used his strength to his advantage. “Larry Brown used to talk about his 26 rebounds at McNichols Arena in Denver,” Kauls said. “That was an arena record.”\n\nTayler Hill stood out among the inductees in the 2022 class, and not just because the former Minneapolis South star, at 31, was significantly younger than the others.\n\nWhile others were reflecting about long-past days, Hill is just beginning the second stage in her basketball life. She has a position with Nike at its corporate headquarters in Oregon — although recently she has worked from home in Minneapolis — and made twice-weekly appearances on the Big Ten Network as a studio analyst for women’s basketball.\n\n“I really liked it,” said Hill, referring to being on BTN. “It was nice to be back in the conference that I played in.”\n\nHill scored 3,888 points in her high school career and led Minneapolis South to its only state title, in 2009, before starring at Ohio State.\n\nTo this day, Hill cherishes that 2009 state championship experience.\n\n“The Minneapolis South students that came to those games, if I think about high school basketball, I think about those student sections and the crazy support we had,” Hill said.\n\nOthers inducted in the Class of 2022 — the Hall of Fame’s third — were longtime Hopkins girls’ coach Brian Cosgriff, pioneering girls’ referee and administrator Vicki Davis, Moose Lake’s Annie Adamczak-Glavan, Park of Cottage Grove star Sam Jacobson, Duluth Central’s Terry Kunze, Bloomington Jefferson’s Kevin Lynch, Minneapolis North coach Larry McKenzie, Minneapolis Roosevelt’s Tom Nordland, groundbreaking official Jim Robinson, Hopkins’ Dave Tschimperle, Little Falls’ Frank Wachlarowicz and Bird Island-Lake Lillian’s Barry Wohler."}, {"url": "https://www.startribune.com/meet-the-minnesota-high-school-basketball-hall-of-fame-class-of-2020/566640221/", "page_content": "Fifteen people have been named as inductees to the Minnesota High School Basketball Hall of Fame. It’s the third class of inductees to the hall of fame, which was started in 2018. A formal ceremony is set for April 5.\n\nThe inductees:\n\nAnnie Adamczak Glavan: Named 1982 Miss Basketball as a senior at Moose Lake, where her basketball, volleyball and softball teams all went undefeated in winning state championships in 1981-82. Played in 10 state tournaments overall, winning five state titles.\n\nBrian Cosgriff: In his 21st season as Hopkins girls’ basketball coach. Has won seven state titles in 14 tournament appearances. Began the year with a 539-67 record. Inducted into the Minnesota Girls’ Basketball Coaches Association Hall of Fame in 2015.\n\nVicki Davis: Graduated from high school (St. Peter) in 1967 when there were no girls’ sports. Became a two-year captain in volleyball and basketball at Mankato State University. Served 45 years in pioneering girls’ sports at Hastings, including starting programs for basketball, track and field, volleyball and tennis. Davis, a member of the MSHSL Hall of Fame, was an official in 21 state tournaments (14 basketball and seven volleyball).\n\nTayler Hill: Led Minneapolis South to a state title in 2009. Her 106 points in the state tournament and 3,888 career points were state records at the time. Played at Ohio State, was fourth overall pick in the 2013 WNBA draft by the Washington Mystics. Averaging nine points per game in seven pro seasons.\n\nSam Jacobson: Scored 2,461 points and averaged a double-double for his high school career at Park of Cottage Grove. Mr. Basketball in 1994. Played for the Gophers in the 1997 Final Four and played professionally in the NBA, including with the Timberwolves, and in Europe.\n\nZiggy Kauls: Began coaching at Mounds View in 1967 and retired after 45 seasons. His teams made 12 state tournament appearances, won championships in 1972 and 1999. Compiled a 739-357 career record, third-most wins all-time. Already inducted into six halls of fame.\n\nTerry Kunze: Led Duluth Central to the 1961 state championship with a 27-0 record. He averaged double figures in each of three seasons with the Gophers. He was an assistant coach with Jim Dutcher’s Gophers and was head coach for the Minnesota Fillies of the WPBL.\n\nMark Landsberger: Led Mounds View to state tournaments in 1972 and 1973, winning the 1972 Class AA championship and scoring 26 points per game as a senior. Played professionally for 16 years, including championship seasons with the L.A. Lakers in 1980 and 1982.\n\nKevin Lynch: Led Bloomington Jefferson to state championships in 1986 and 1987. Helped lead the Gophers to the NCAA Sweet Sixteen and Elite Eight in separate seasons. Drafted by Charlotte in the NBA, later played overseas.\n\nLarry McKenzie: First coach to four-peat as state champion in 2000-2003 with Minneapolis Henry. Also coached at Holy Angels, currently at Minneapolis North, winning state titles in 2016 and 2017. Has a 20-2 record in eight state tournament appearances.\n\nTom Nordland: A 1957 graduate of Minneapolis Roosevelt who was regarded as the state’s greatest jump shooter. Roosevelt won state titles in 1956 and 1957. Norland, who averaged 27.8 points per game as a senior, is known for his “Swish” shooting-method videos.\n\nJimmy Robinson: Began his career as an official in 1956, worked his way from high school games to Division II and III and eventually to the Big Ten Conference, where he was an official from 1971 to 1987. The first black man to officiate in the Minnesota state tournament.\n\nDave Tschimperle: Led Hopkins to three consecutive state tournaments and back-to-back state titles in 1952 and 1953. Led the 1951 and 1953 tournaments in scoring. The 6-3 center, who played college basketball at Hamline, is regarded by some as the best player in state history.\n\nFrank Wachlarowicz: The Flyers won the 1975 AA state title with Wachlarowicz leading all scorers with 22 points per game. Four-year starter at St. John’s, scoring an MIAC record 2,357 points en route to two conference titles.\n\nBarry Wohler: Led Bird Island-Lake Lillian, coached by his dad, Jerry, to state titles in 1980 and 1981, making three buzzer-beaters in six tournament games. Played baseball and basketball for the Gophers. Won a third state basketball title as coach at Orono High School in 2011."}, {"url": "https://www.sportingnews.com/us/nba/news/hall-of-fame-eligible-players-2023-2024-full-list/cifevvjoxkmqlswkmfg0rsrt", "page_content": "The Naismith Memorial Basketball Hall of Fame recognizes some of the biggest names in NBA history on an annual basis.\n\n2020 was one of the most loaded classes ever. 2021 saw Chris Bosh, Paul Pierce, Ben Wallace and Chris Webber earn the prestigious honor. In 2022, Manu Ginobili headlines a group that includes Tim Hardaway, owner of one of the meanest crossovers we've ever seen.\n\nWho's up next? There is no shortage of players still waiting for the Hall of Fame call, but new players become eligible for the first time every year.\n\nWhat is the nomination process for the Basketball Hall of Fame?\n\nPlayers need to be fully retired for four full seasons to be inducted into the Naismith Memorial Basketball Hall of Fame. They can be considered for enshrinement in their fifth year of retirement.\n\nFor example, Ginobili last played in the NBA in the 2017-18 season. Having not played in 2018-19, 2019-20, 2020-21 and 2021-22, he was eligible to be inducted into the Hall of Fame in 2022.\n\nA committee reviews and votes on each individual nominee. You can read more about the voting process here.\n\n2023 Hall of Fame candidates\n\nOn Dec. 21, the Naismith Basketball Hall of Fame announced an impressive list of first-time nominees as players and coaches.\n\nFirst-time player nominees:\n\nPau Gasol\n\nDirk Nowitzki\n\nTony Parker\n\nDwyane Wade\n\nFirst-time coach nominees:\n\nJohn Beilein\n\nJim Larranaga\n\nGregg Popovich\n\nBasketball Reference's model gives both Wade and Nowitzki a 100 percent probability of being inducted into the Hall of Fame. It gives Parker 93.9 percent and Gasol 93.4 percent.\n\nClick here for a full list of players whose final season in the NBA was 2018-19.\n\n2024 Hall of Fame candidates\n\nThe 2024 Basketball Hall of Fame class isn't as star-studded, but it features one of the most exciting players in NBA history and two Defensive Player of the Year winners:\n\nVince Carter (Raptors, Nets, Magic, Suns, Mavericks, Grizzlies, Kings, Hawks)\n\nJoakim Noah (Bulls, Knicks, Grizzlies, Clippers)\n\nTyson Chandler (Bulls, Hornets, Bobcats, Mavericks, Knicks, Suns, Lakers, Rockets)\n\nJamal Crawford (Bulls, Knicks, Warriors, Hawks, Trail Blazers, Clippers, Timberwolves, Suns, Nets)\n\nKyle Korver (76ers, Jazz, Bulls, Hawks, Cavaliers, Bucks)\n\nBasketball Reference's model gives Carter a 94.6 percent probability of being inducted into the Hall of Fame. The site's model gives Noah, Chandler, Crawford and Korver each less than a 1 percent chance, potentially paving the way for someone who is already eligible to get the call.\n\nClick here for a full list of players whose final season in the NBA was 2019-20.\n\nBest players not in the Hall of Fame\n\nEach of the next two years provides good opportunities for players already eligible to get their long-awaited Hall of Fame nod.\n\nTom Chambers holds the distinction of the highest all-time scorer among players eligible yet not in the Hall. Chambers (20,049) and Antawn Jamison (20,042) are the only eligible 20,000-point scorers not currently inducted in Springfield.\n\nHere are the top players with the best chance of getting in according to the Basketball-Reference Hall of Fame model:"}, {"url": "https://www.startribune.com/barry-wohler-minnesota-high-school-basketball-hall-of-fame-2022-class/600162204/", "page_content": "Barry Wohler's bright smile was as big as they come, overshadowed only by his perfectly feathered hair. He personified the GQ look of an All-American kid.\n\nThat was the Barry Wohler of 1980 and 1981, when he led Bird Island-Lake Lillian to two Class A boys' basketball championships. Expect that same look to be displayed again Thursday, when Wohler joins 14 others in the third class to be inducted into the Minnesota High School Basketball Hall of Fame.\n\n\"I was kind of surprised when I was notified, honored,\" Wohler said. \"I wasn't expecting it. It's going to be pretty cool.\"\n\nThe ceremony will be held Thursday at the Lumber Exchange Event Center in Minneapolis starting at 3 p.m. Tickets ($25) will be available at the door.\n\nBird Island-Lake Lillian won each of those titles in double overtime, defeating Lake of the Woods 78-74 in the final in 1980 and Winona Cotter 49-47 in 1981.\n\n\"It was really kind of storybook,\" Wohler said.\n\nWohler, a point guard and lefthanded shooter, made a 23-footer with five seconds remaining to beat Winona Cotter for the second title. He finished with 28 points.\n\n\"It's amazing how many people remember our run and still bring it up 40 years later,\" he said. \"All our games were close.\"\n\nWohler, a native of Bird Island, didn't just celebrate those championships with his childhood friends but also with his coach and father, Jerry. Barry Wohler has compiled a 363-209 record as a high school coach himself, currently at Orono. He also won a state championship (Class 3A) with his son, Brady, in 2011.\n\n\"I had a great opportunity playing for my dad and the excitement we shared together winning those two state titles,\" Wohler said. \"I really have great memories from my playing days.\n\n\"It was a group of kids that grew up together and had a dream. It's a bond that never breaks. The camaraderie is still there 40 years later.\"\n\nHe'll be inducted alongside basketball standouts ranging from a woman who dominated as a girl in the '80s to a coach fresh off a state championship game only days ago to a game official who made a difference in high school and then took his skills to college.\n\n\"When I saw the names, I was like, 'My goodness,'\" Wohler said. \"I am fortunate to be going in with these people.\"\n\nAlso to be inducted Thursday:\n\n• Annie Adamczak-Glavan: Adamczak was named 1982 Miss Basketball. As a senior she led the 1981-82 Moose Lake basketball, volleyball and softball teams to state titles with a combined record of 79-0. She played in four Class 1A basketball tournaments while scoring 1,535 career points.\n\n• Brian Cosgriff: In his 21 seasons as Hopkins girls' coach, Cosgriff compiled a 569-67 record. He won seven state titles in 14 tournament appearances. Cosgriff posted a 35-6 record in state tournament play, the second-highest winning percentage (.854) for coaches with a minimum of four state tournament appearances.\n\n• Vicki Davis: The 1967 St. Peter graduate — before there were organized high school sports for girls in the state — was a pioneering official and administrator of girls' and women's basketball. She served 45 years at Hastings and was an official in 21 state tournaments, 14 in basketball.\n\n• Tayler Hill: Hill guided Minneapolis South to the Class 4A title in 2009. Her 106 points in the state tournament and 3,888 career points were state records at the time. She went on to play at Ohio State and was the fourth overall pick in the 2013 WNBA draft by the Washington Mystics. She played five seasons with the Mystics before being traded to the Dallas Wings.\n\n• Sam Jacobson: Jacobson scored 2,461 points and grabbed 1,013 rebounds (averaging a double-double) in his career at Park of Cottage Grove. He played for the Gophers in the 1997 Final Four and was selected in the first round of the 1998 NBA draft by the Los Angeles Lakers. He also spent time with the Timberwolves and Golden State Warriors.\n\n• Ziggy Kauls: Kauls has the fifth-most basketball victories among boys' coaches. He compiled a 739-357 record that included 12 state tournament appearances during his 45-year career at Mounds View. He directed the Mustangs to the Class AA title in 1972 and the Class 4A crown in 1999.\n\n• Terry Kunze: He led Duluth Central to the 1961 state championship and played for the Gophers and Minnesota Muskies in the ABA. Kunze averaged double figures in each of three seasons with the Gophers. He served as an assistant coach with the Gophers under Jim Dutcher and was head coach of the Minnesota Fillies of the WPBL.\n\n• Mark Landsberger: The power forward led Mounds View to state tournament appearances in 1972 and 1973, winning the Class AA championship in 1972. He averaged 26.1 points per game in 1973 and finished his career with 1,290 points and 910 rebounds. He played for the Gophers and Arizona State in college and was selected by the Chicago Bulls in the 1977 NBA draft. He played professionally for 16 years, including championship seasons with the Los Angeles Lakers in 1980 and 1982.\n\n• Kevin Lynch: Lynch led Bloomington Jefferson to back-to-back AA titles in 1986 and 1987. He had an outstanding career with the Gophers and helped them to the Sweet 16 and Elite Eight in separate seasons. He played for the Charlotte Hornets in the NBA.\n\n• Larry McKenzie: McKenzie coached Minneapolis Henry and North boys' teams to six state titles in 10 tournament appearances. He's the only coach to pull off a four-peat, from 2000-2003 at Henry. He owns a 23-4 record in state tournament play, a winning percentage of 85.2. His career record is 481-167.\n\n• Tom Nordland: Nordland was regarded as the greatest jump shooter in Minnesota history when he led Minneapolis Roosevelt to back-to-back state championships in 1956 and 1957. It landed him a scholarship to Stanford.\n\n• Jimmy Robinson: Robinson was a longtime high school and college official and was supervisor of officials for the Minnesota State High School League. He began his career as an official in 1956, working his way from high school to Division II, Division III and eventually the Big Ten Conference, where he was an official from 1971 to 1987. He became the first black man to officiate in the Minnesota state tournament.\n\n• Dave Tschimperle: The 6-3 center led Hopkins to three consecutive state tournament appearances and back-to-back titles in 1952 (averaging 19 points per game) and 1953 (23 points per game).\n\n• Frank Wachlarowicz: Known as \"Frankie Alphabet,\" the 6-6 forward led Little Falls to the 1975 AA state title, averaging 22 points per game. He was a four-year starter at St. John's, scoring a MIAC-record 2,357 points en route to two conference championships."}, {"url": "https://www.canishoopus.com/2022/4/1/23006304/report-lindsay-whalen-to-be-inducted-into-naismith-memorial-basketball-hall-of-fame-wnba", "page_content": "Share All sharing options for: Report: Lindsay Whalen To Be Inducted Into Naismith Memorial Basketball Hall of Fame\n\nOne of Minnesota’s own has received the call and earned the highest honor in basketball.\n\nLindsay Whalen, a Hutchinson, Minnesota native and four-time WNBA champion with the Minnesota Lynx, will be inducted into the Naismith Memorial Basketball Hall of Fame as a member of the Class of 2022, according to The Athletic’s Jon Krawczynski.\n\nThe current head coach of the University of Minnesota women’s basketball team retired from the WNBA following the 2018 season as one of the greatest players to ever step foot on a WNBA court. Her legacy in the W was honored this past summer, when she was named to the W25 list, honoring the greatest 25 players in the league history, along with four other Lynx.\n\nWhalen joins the legendary Katie Smith — who is currently the associate head coach of the Lynx — as the only two Lynx players in the Naismith Memorial Hall of Fame.\n\nOver her WNBA career, Whalen was selected to five All-Star teams, five All-WNBA teams, and etched her name in the record books of several important categories.\n\nThe University of Minnesota legend has won more games in the WNBA (307) than any other player in league history, is third all-time in career assists with 2,345, and holds top 10 marks in free throws made (1,407 — ninth all-time), games played (480 — sixth), win shares (59.8 — seventh).\n\nWhere Whalen truly sets herself apart is in her playoff performance. Whalen’s 341 assists are most in WNBA playoff history, while her 953 points rank fifth all-time, and her playoff record of 40-16 (71.4%) with the Lynx speaks for itself. No player in the history of the league has played more playoff basketball than Wheezy, either. Her 82 playoff games played is one more than fellow Lynx, and current Lynx assistant coach, Rebekkah Brunson.\n\nWhile a member of the Minnesota Lynx, Whalen won four championships (2011, 2013, 2015, and 2017) and was an integral part of stamping the Lynx as one of the greatest dynasties in WNBA history and the franchise as the league-wide standard other teams aspire to reach.\n\nWhalen’s No. 13 jersey hangs in the rafters, right where it belongs, at the Target Center and at Mohegan Sun Arena, where she was a standout player for the Connecticut Sun prior to joining the Lynx in 2010.\n\nIn addition to her tremendous accomplishments as a WNBA player, Whalen was named a EuroLeague All-Star in 2008, 2009, and 2010 for her play overseas during the W’s offseason, and won the EuroCup championship in 2013-14 as a member of Dynamo Moscow.\n\nThe trusted floor general also took to the court for her country. Whalen was a core member of the 2012 and 2016 United States Olympic teams, which both captured gold medals. Prior to that, she won gold medals at the 2010 and 2014 FIBA World Championship for USA Basketball, and captured golds at the 2002 FIBA U20 World Championship and 2003 FIBA U21 World Championships.\n\nBefore Whalen went pro, she but Minnesota basketball on the map. A four-year standout at the University of Minnesota, Whalen helped the Golden Gophers to a 80-43 record over her stellar career. She fueled Minnesota to three NCAA tournaments, culminating with a Sweet 16 appearance in 2003 and the program’s first trip to the Final Four in 2004.\n\nWhalen was the Big Ten Player of the Year in 2002, a three-time All-American, and first-team All-Big Ten in her sophomore, junior and senior years. She held the program’s scoring record with 2,285 for nearly two decades before current Lynx guard Rachel Banham broke it in 2018.\n\nOn April 13, 2018, Whalen was introduced as the head coach of her alma mater, a position she still holds.\n\nLater that year, Whalen announced her retirement from professional basketball. This photo says it all. Standing beside the coach she credits as one of her greatest influences, her indelible mark on the franchise she helped Cheryl Reeve build comes in the form of four WNBA championship trophies behind her.\n\nWhalen walked away as one of the game’s greatest players.\n\nShe left behind an iconic, homegrown winning legacy that will never, ever be matched, and inspired a generation of young girls and boys who grew up dreaming they could achieve anything on the basketball court.\n\nFrom the moment the four-time all-state player from Hutchinson stepped on the floor at Williams Arena as a Gopher in 2000, all the way to her walking off that raised floor for the final time as player a four-time WNBA champion in 2017, and everywhere in between, Lindsay Whalen has taken Minnesota on the basketball ride of a lifetime.\n\nThat ride now includes a stop in Springfield, Massachusetts at the Naismith Memorial Basketball Hall of Fame, an honor Whalen so richly deserves.\n\nWe’re all witnesses to the greatest athlete in the history of this proud state.\n\nFor giving us Minnesota kids the opportunity to grow up knowing what it’s like to look up to homegrown greatness, thank you, Whay. The game is forever changed.\n\nCongratulations, Hall of Famer!"}]}