{"Ithamara Koorax has been praised for her ability to combine Brazilian rhythms with jazz, and for her powerful and emotive vocal style.": [{"url": "https://www.allmusic.com/album/brazilian-butterfly-mw0001483151", "page_content": "It took three long years to record Brazilian Butterfly, by Rio de Janeiro vocalist Ithamara Koorax. It was worth the wait. A look at the cast on this enigmatic set reveals a cast of all-stars. That said, the treasure is bittersweet on at least one level. Three of Brazil's greatest musicians -- and integral parts of this album -- all passed away after these sessions were recorded: the inimitable drummer and percussionist Dom Um Romão, bassist Manuel Gusmão, and percussionist Eloir de Moraes. The core band on most of these sides includes Romão, electric pianist and keyboardist Paula Faour, and other electric bassist Jorge Pescara and/or acoustic and arco bassist Gusmão. That said, there are a slew of guests on the record as well, including Azymuth, Gonzalo Rubalcaba, Ron Carter, Nelson Ângelo, Raul de Souza, Thiago de Mello, José Carlos \"Bigorna\" Ramos, the Francesco Gazzara Group on one cut, and numerous others. Produced by Arnaldo DeSouteiro, who also did many of the album's arrangements and played percussion on some tracks, the set was recorded live in Brazil with the exception of \"Butterfly,\" which was cut in Italy with Gazzara's group. According to DeSouteiro, Dom Um Romão did the only overdubs, layering percussion on the tracks where he also played drums, and on the title track where Koorax fronted Gazzara's band in Italy.\n\nMusically, this is the showcase for Koorax's voice that fans have been waiting for, and it awaits a wider audience who need only to hear this once to be enthralled and entranced by its sophistication and heart. She is a diverse, adventurous, and utterly gifted vocalist who cannot be reined in by the stereotypical categorization of what the current generation calls a \"female jazz singer.\" Here she digs deep into Brazilian and Latin and even African and Cuban folk forms, modern and classic samba, electric jazz, vocalese, and more -- anything to allow the song itself to come through. Does that make Brazilian Butterfly a fusion record? Yes, but not any kind of fusion outing you've ever heard. People who need categories will call this \"world fusion\". But in truth, this set creates something new and should perhaps be called \"organic jazz fusion\", or \"new Brazil.\" There are so many elements woven into a tapestry so colorful, so brilliantly melodic, harmonically adventurous and multi-textured, it cannot be contained in any preset box. That said it has a very classic feel to it. One can hear traces of the early CTI sound here, but that is in the elegance, grace, and soulfulness of the grooves rather than in the musical style, for which there is no equivalent. The production and sound quality of this disc are simply gorgeous. From the opening track, the mysterious ambience that is Dorival Caymmi's \"O Vento\" beckons. Ramos' flute and Romão's shimmering cymbals introduce it, along with percussion by DeSouteiro and de Moraes; the listener can hear the spacious tantalizing strangeness in this mix. Koorax begins singing languidly, as if from a distance, seamlessly bridging the instruments and a creating certain lushness even before the rest of the band enters. Over eight minutes in length, there are fine solos by Faour and Ramos before Koorax and Romão trade up call-and-response vocal improvisation. (Romão is not a singer, but he was such a genius that his voice was as skilled a percussive instrument as his hands and feet.) Koorax engages him in this solo and even gets guttural; it is startling and entrancing, and could have gone on for another five minutes it's so inventive. It is followed by \"Escravos de Jó,\" with de Moraes doing his own vocal improvisation and rap as Koorax digs deep into a modally constructed, almost droning samba melody. Carlos Fuchs adds his acoustic piano to the electric one by Faour, and the layered percussion by Koorax, de Moraes, Romão, and DeSouteiro give it an almost hallucinatory feel. The funky fretless bassline and hi hat work with de Souza's trombone on Romão's \"Amor em Jacumã\" makes it an utterly contemporary and forward-looking jazz tune. Here is where DeSouteiro evokes the beautiful arrangements of the early CTI groove tunes. Rubalcaba's taut piano solo offers a knotty and funky groove even in counterpoint with the bassline and Ângelo's shimmering, acoustic guitar work as Romão lays down breaks against a spacious yet kinetic four-piece percussion section! Koorax's voice rises and glides above that intimidating group with ease. Her voice is as rhythmic as Romão's kit. She phrases to suit the song: her chameleon-like quality is what gives her a unique identity. She doesn't play the fragile beauty on these tracks, she gets into the vamps and grooves as much as the players do: check her wailing soprano solo near the end of this cut for evidence of her ability to solo with any instrumentalist. The band pushes a steady, funky, airy, Latin-cum-samba groove behind her.\n\nEach track on Brazilian Butterfly uncovers a new mystery, reveals a hidden treasure, proving, of course, that Koorax is virtually limitless in her abilities. The interplay between Romão and Faour's keyboards and Pescara's bass on \"Lamento Negro\" puts it all in high gear. Romão gives voice to his approval and Koorax is so heavy and deep in the cut that she's downright funky, but Brazilian funky, which means of course that it isn't only about chop, it's about chops in the song. Her reading of Herbie Hancock's \"Butterfly\" is a completely new interpretation. Arranged by and co-produced by Gazzara in Italy, his utterly haunting nylon string guitar and Rhodes and acoustic piano work present this beautiful jazz tune in an almost ethereal way. His manner of adorning Koorax's voice is not as strident as what is heard on the rest of the recording, but that said it serves a wonderful purpose in showcasing her voice in a context she is very familiar with as a wonderful singer of ballads. The Italian, Spanish, and soul touches he and his band play underneath her interpreting of those lyrics allows her to inhabit the song fully and, perhaps even Hancock would agree, make it her own. This is only the first half of the recording and it's already better than any vocal record issued in 2006.\n\nThe latter half is the same wondrous, seamless, classy yet gritty amalgam of seemingly disparate elements that work marvelously as a whole: there are fine solos by many performers on this set, as Koorax and DeSouteiro allow plenty of room for improvisation as long as it fits the songs like a glove. But the real treasure here -- and one that unfortunately not many Americans have had the real pleasure of encountering -- is her voice. Her confidence is legion. If all you ever heard from this disc was Geraldo Vandré's \"Fica Mal com Deus,\" with its driving rhythms and her voice punching right through them to add yet another layer to them, you'd be left dumbstruck. The song is outstanding. Her chant-like vocal, which introduces \"Noite de Temporal,\" another of the three tunes here by Caymmi, offers more of that \"world music\" vibe to the mix, but in the best possible manner: the fretless and arco basses playing off one another, the tribal drums and double percussion of DeSouteiro and Sidinho Moreira in the extended intro are deceptive, because as Faour's keyboards enter, this sounds like an ancient song being brought into the new world, Killer reggae piano, funk electric bass, bowed classical folk lines, and Koorax's voice coming out of the ether of antiquity and into the flesh in the present is worth the price of admission alone. The album's final track, \"Frenético,\" is very special since it is a duet. Koorax and de Moraes engage in a work of pure improvisation with only their voices and percussion instruments. De Moraes does his own awesome and effective take on scat as Koorax uses her voice as an effect, a percussion instrument with chatters, skitters, swoops, and washes of guttural onomatopoeia. It's almost nine minutes long and goes by in a flash; it's a hell of a way to close what is already your greatest recording, stamping it so individually it becomes almost iconoclastic. It cannot be touched. On Brazilian Butterfly, Koorax has set a new bar for jazz vocalists who come after her. As she does, they will need to embody many traditions and musical histories, root them in the tradition, and be able to comfortably combine as well improvise seamlessly with and between them. Thus far, Brazilian Butterfly is the jewel in Koorax's crown and a watermark in the 21st century, not only for Brazilian jazz, but for jazz and world music as a whole."}, {"url": "https://www.allaboutjazz.com/brazilian-butterfly-ithamara-koorax-irma-molto-jazz-review-by-chris-m-slawecki", "page_content": "Album Review\n\nExcept for two ballads\u0097the cosmopolitan \"Carinhoso with her Brazilian jazz fusion compatriots Azymuth, and Herbie Hancock's title track\u0097Ithamara Koorax's ninth album is her most adventurous release. It seems constructed to honor legendary Brazilian vocalist Flora Purim and her husband/bandleader/percussionist Airto. This Brazilian Butterfly soars and flutters while multiple percussionists (often as many as four on the same song, most often led by the late and legendary Dom Um Romão, with Koorax frequently flailing away among them) knit together, pull apart, then reweave hot thick blankets of Brazilian rhythm.\n\nRomão's \"Amor Em Jacuma occasions an international jazz jam as Ron Carter's thoroughly upright acoustic bass and Cuban pianist Gonzalo Rubalcaba's roiling piano set table for a solo helping of meaty trombone from Raul de Souza of Brazil. Pianist Francesco Gazzara lovingly renders Hancock's title tune, especially in his solo, which builds up chords then reconsiders their construction in equal parts musical architecture and alchemy. Koorax breathes her most romantic vocal, and it's hard to imagine that many mortals can resist her languid invitation to \"Stay awhile... which just seems to float throughout the air forever, like... a Brazilian butterfly.\n\n\n\n\n\nThe remaining material seems specifically composed and arranged to stress test Koorax's four-octave range. She swings joyously from the framework of Milton Nascimento's \"Escravos de Jo, a melodic abstraction airy and inscrutable\u0097not packed full but no less complex\u0097as Joni Mitchell's Shadows & Light collaborations with Pat Metheny and Jaco Pastorius. Her voice soars above the Afro-macumba chant \"Lamento Negro and streams bright as dawn to open \"Fica Mal Com Deus, then completely changes tone and color by digging into the low notes with the growling fury of a blasting trumpet.\n\n\n\n\n\nThe opening \"O Vento and closing \"Frenetico drive Koorax's Brazilian journey further into outer space: Her voice intricately navigates the thorny, shimmering thicket of electric piano and four percussionists in \"O Vento and hangs in \"Frenetico, where the background frame of congas, bass drum and cymbal (not her voice) emerges as the lead instruments. Each is an excellent vehicle for discovering, then remembering, that Brazilian Butterfly is Koorax's most fertile adventure in exploring the boundaries of contemporary Brazilian vocal music."}, {"url": "https://jazztimes.com/archives/ithamara-koorax-brazilian-butterfly/", "page_content": "Jonathan Butler’s optimistic music belies a dirt-poor childhood growing up in a South Africa segregated by apartheid. Live in South Africa, a new CD and DVD package, presents a sense of the resulting inner turmoil, mixed with dogged resolve, that paved the way to his status as an icon in his country and successful musician outside of it. Looking back, the 46-year-old Butler says today, the driving forces that led to his overcoming apartheid-the formal policy of racial separation and economic discrimination finally dismantled in 1993-were family, faith and abundant talent.\n\n“When we were kids, our parents never talked about the ANC [African National Congress] or Nelson Mandela,” he says. Butler was raised as the youngest child in a large family. They lived in a house patched together by corrugated tin and cardboard, in the “coloreds only” township of Athlone near Cape Town. “They never talked about struggles so we never knew what was happening.”\n\n\n\nStart Your Free Trial to Continue Reading Start my Free Trial Become a JazzTimes member to explore our complete archive of interviews, profiles, columns, and reviews written by music’s best journalists and critics.\n\n\n\n"}, {"url": "https://www.allaboutjazz.com/album/brazilian-butterfly-ithamara-koorax__11068", "page_content": "× Welcome to All About Jazz!\n\nWe sent a confirmation message to . Look for it, then click the link to activate your account. If you don’t see the email in your inbox, check your spam, bulk or promotions folder.\n\n\n\nThanks for joining the All About Jazz community!"}, {"url": "https://www.allaboutjazz.com/album/brazilian-butterfly-ithamara-koorax", "page_content": "× Welcome to All About Jazz!\n\nWe sent a confirmation message to . Look for it, then click the link to activate your account. If you don’t see the email in your inbox, check your spam, bulk or promotions folder.\n\n\n\nThanks for joining the All About Jazz community!"}, {"url": "https://news.koolearn.com/20190615/1179686.html", "page_content": "新东方在线英语六级频道整理了《2019年6月英语六级阅读真题46—50题答案--新东方在线》，供同学们和老师参考。\n\n六级阅读Passage One答案及解析\n\n新东方在线\n\nQuestions 46 to 50 are based on the following passage\n\nProfessor Stephen Hawking has warned that the creation of powerful artificial intelligence (AI) will be “either the best, or the worst thing, ever to happen to humanity”, and praised the creation of an academic institute dedicated to researching the future of intelligence as “crucial to the future of our civilization and our species.”\n\nHawking was speaking at the opening of the Leverhulme Centre for the Future of Intelligence (LCFI) at Cambridge University, a multi-disciplinary institute that will attempt to tackle some of the open-ended questions raised by the rapid pace of development in AI research. “We spend a great deal of time studying history,” Hawking said, “which, let’s face it, is mostly the history of stupidity. So it’s a welcome change that people are studying instead the future of intelligence.”\n\nWhile the world-renowned physicist has often been cautious about AI, raising concerns that humanity could be the architect of its own destruction if it creates a super-intelligence with a will of its own, he was also quick to highlight the positives that AI research can bring. “The potential benefits of creating intelligence are huge,” he said. “We cannot predict what we might achieve when our own minds are amplified by AI. Perhaps with the tools of this new technological revolution, we will be able to undo some of the damage done to the natural world by the last one – industrialization. And surely we will aim to finally eradicate disease and poverty. And every aspect of our lives will be transformed. In short, success in creating AI could be the biggest event in the history of our civilization.”\n\nHuw Price, the centre’s academic director and the Bertrand Russell professor of philosophy at Cambridge University, where Hawking is also an academic, said that the centre came about partially as a result of the university’s Centre for Existential Risk. That institute examined a wider range of potential problems or humanity, while the LCFI has a narrow focus.\n\nAI pioneer Margaret Boden, professor of cognitive science at the University of Sussex, praised the progress of such discussions. As recently as 2009, she said, the topic wasn’t taken seriously, even among AI researchers. “AI is hugely exciting,” she said, “but it has limitations, which present grace dangers given uncritical use.”\n\nThe academic community is not alone in warning about the potential dangers of AI as well as the potential benefits. A number of pioneers from the technology industry, most famously the entrepreneur Elon Musk, have also expressed their concerns about the damage that a super-intelligent AI could do to humanity.\n\n46. What did Stephen Hawking think of artificial intelligence?\n\nA) It would be vital to the progress of human civilization.\n\nB) It might be a blessing or a disaster in the making.\n\nC) It might present challenges as well as opportunities.\n\nD) It would be a significant expansion of human intelligence.\n\n46. B. It might be a blessing or a disaster in the making.\n\n【定位】根据题干Stephen Hawking think of artificial intelligence定位到第一段第一句\n\n【解析】“either the best, or the worst thing…”，要么是最好的，要么是最坏的，与选项B对应。选项A不是本文主旨所在。选项C偷换逻辑，文中是说人工智能可能有益也可能有害，不是在说机遇与挑战并存。选项D在原文并未直接提及，也与主旨无关。\n\n47. What did Hawking say about the creation of the LCFI?\n\nA) It would accelerate the process of AI research.\n\nB) It would mark a step forward in the AI industry.\n\nC) It was extremely important to the destiny of humankind.\n\nD) It was an achievement of multi-disciplinary collaboration.\n\n47. C. It was extremely important to the destiny of humankind.\n\n【定位】根据关键词the creation of the LCFI定位到第一段第二句\n\n【解析】“crucial to the future of our civilization and our species” 对我们文明和我们物种的未来至关重要，与选项C对应。本题较为简单，选项A、选项B与选项D均没有在原文中提及，而且文章是在说LEFI的重要性。\n\n48. What did Hawking say was a welcome change in AI research?\n\nA) The shift of research focus from the past to the future.\n\nB) The shift of research from theory to implementation.\n\nC) The greater emphasis on the negative impact of AI.\n\nD) The increasing awareness of mankind’s past stupidity.\n\n48. A. The shift of research focus from the past to the future.\n\n【定位】根据关键词a welcome change定位到第二段末尾句\n\n【解析】it’s a welcome change that people are studying instead the future of intelligence. 人们研究的是智慧的未来，这是一个令人欢迎的变化。根据前文的We spend a great deal of time studying history…is mostly the history of stupidity可知，我们花了很多时间研究愚蠢的历史，可以选出选项A。选项B与选项C在原文没有提及。选项D偏离了重点，题干是在问令人欢迎的变化是什么，对应原文“从研究历史到研究未来的转换”。\n\n49. What concerns did Hawking raise about AI?\n\nA) It may exceed human intelligence sooner or later.\n\nB) It may ultimately over-amplify the human mind.\n\nC) Super-intelligence may cause its own destruction.\n\nD) Super—intelligence may eventually ruin mankind.\n\n49. D. Super—intelligence may eventually ruin mankind.\n\n【定位】根据题干concerns和Hawking raise about AI定位到原文第三段第一句\n\n【解析】…raising concerns that humanity could be the architect of its own destruction if it creates a super-intelligence…：如果人类有自己的意愿创造出一种超级智能，那么人类可能是自身毁灭的建筑师。对应选项D。选项A与选项B没有在原文提及。选项D与选项C的差异在于，选项D是说人工智能毁灭人类，选项C是说人工智能毁灭人工智能自身。这是题目陷阱——原文中的its own destruction，its指代前文的humanity人类。\n\n50. What do we learn about some entrepreneurs from the technology industry?\n\nA) They are much influenced by the academic community.\n\nB) They are most likely to benefit from AI development.\n\nC) They share the same concerns about AI as academic.\n\nD) They believe they can keep AI under human control.\n\n50. C. They share the same concerns about AI as academic.\n\n【定位】根据关键词some entrepreneurs定位到原文最后一段第二句\n\n【解析】most famously the entrepreneur Elon Musk, have also expressed their concerns about the damage that a super-intelligent AI could do to humanity. 最著名的企业家埃隆·马斯克，也表达了他们对超级智能人工智能可能对人类造成的损害的担忧。这种担忧正是前文的学术界表达的。所以选项C为正确答案。选项A、选项B与选项D均没有在原文中提及。\n\n新东方实力师资团队将对英语六级真题答案做权威解析，免费领取【大学英语六级真题解析】课程。更多2019年6月英语六级听力真题答案、英语六级作文真题范文、英语六级阅读真题答案、英语六级翻译真题答案，请查看【2019年6月英语六级真题答案解析】专题。预祝大家高分通过大学英语六级考试!\n\n更多内容请查看【2019年6月英语六级真题答案解析】专题\n\n扫码关注新东方在线服务号\n\n>>六级答案这里最全"}, {"url": "https://cn.linguee.com/%E8%8B%B1%E8%AF%AD-%E4%B8%AD%E6%96%87/%E7%BF%BB%E8%AD%AF/has+been+praised.html", "page_content": "The quality of the conservation work of [...] Hanyuan hall of the Daming Palace is [...] completed to 75% and has been praised both by the experts [...] committee and the authorities. unesdoc.unesco.org unesdoc.unesco.org completed to 75%by the experts 受到了专家委员会和该国当 局的赞许。 unesdoc.unesco.org unesdoc.unesco.org 大明宫含元殿保护工程优质率达 75%，专家委员会和该国\n\n(a) Colombia has been praised as one of the [...] most advanced States in terms of the recognition of the collective rights of indigenous peoples. daccess-ods.un.org daccess-ods.un.org (a) Colone of the (a) 关于法律和公共政策，哥伦比亚一直 被 赞扬 为 最 早承 认土著人民集体权 利的国家之一。 daccess-ods.un.org daccess-ods.un.org (a) 关于法律和公共政策，哥伦比亚认土著人民集体权 利的国家之一。\n\nWhen it comes to economizing on electricity, [...] the Government has been praised by many for its [...] smart idea of offering an electricity subsidy of $1,800. legco.gov.hk legco.gov.hk the Governany for its 人稱讚政 府很聰 明，提出補 貼 1,800 元的電 費 。 legco.gov.hk legco.gov.hk 談 到 節約用 電 ， 很 多聰 明，提出補 貼 1,800 元的電 費 。\n\nIt would enable either party to paralyze the process, thus preventing the [...] Dispute Tribunal from the speedy and costefficient disposal of cases [...] for which it has been praised by the General [...] Assembly. daccess-ods.un.org daccess-ods.un.org for whiche General 它将使得双方 [...] 都能够造成程序的瘫痪，因而阻止争议法 庭 如 大 会 赞 赏 的 那样 迅速 和 具 有成 本效 益地审理案件。 daccess-ods.un.org daccess-ods.un.org 都能够造成程序的瘫痪，因而阻止争议法益地审理案件。\n\nment has been praised by the authorities. legco.gov.hk legco.gov.hk However, Mr Jasper TSANG's amendhe authorities. legco.gov.hk legco.gov.hk 然而，當局卻說曾鈺成議員的修正案好，但其實那只是還原基本步，重 新再做一次而已。\n\nThe Company has been praised by the White House as well as members of the House and Senate for executing [...] an extremely successful [...] balance sheet restructuring without any Government assistance. blackstone.com blackstone.com The Comhe White House as well as members of the House and Senate for executing 该公司在没有任何政 府援助的情况下非常成功地完成了资 产 负债 表重 组， 为此 一直深受白宫及众议院和参议院的赞誉。 china.blackstone.com china.blackstone.com 该公司在府援助的情况下非常成功地完成了资一直深受白宫及众议院和参议院的赞誉。\n\nThe Council has been keen to foster academic [...] interest in the new system of the United Nations — and in this regard it notes that [...] the new system has been praised by the daccess-ods.un.org daccess-ods.un.org the new syhe 理事会一直热衷于促进对联合国这一新系统的 [...] 学术兴趣(在这方面，理事会注意到新系统得到了《经济学人》和《华尔 街 日报》 的赞扬)。 daccess-ods.un.org daccess-ods.un.org 学术兴趣(在这方面，理事会注意到新系统得到了《经济学人》和《华尔\n\n64. In the context of the country-led process in [...] [...] Rwanda, efforts to achieve food security are intensifying, and the country has been praised for its success in engaging all partners in discussions around a central policy [...] [...] document; establishing a sector-wide approach; designing and implementing successful programmes; and increasing the budget for agriculture from 3 to 6 per cent, and soon to 9 per cent, in accordance with the Maputo Declaration.33 A new investment plan, developed late in 2009, informs Government partners on plans and programmes for food security, including on what has been financed and what remains to be financed and supported.34 In June 2010, the Global Agriculture and Food Security Programme invested $50 million to transform hillside agriculture by reducing erosion and bolstering productivity in an environmentally sustainable manner. daccess-ods.un.org daccess-ods.un.org Rwanda, efforts to achieve food security are intensifying, and the couits success in engaging all partners in discussions around a central policy 34 2010 年 6 月，《全球农业和粮食 安全 方案》投资 5 000 万美元通过减少水土流失和支持以环保方式进行生产，改造山 区农业。 daccess-ods.un.org daccess-ods.un.org 34 2010 年 6 月，《全球安全 方案》投资 5 000 万美元通过减少水土流失和支持以环保方式进行生产，改造山 区农业。\n\nAnnie’ has been praised for her unique [...] indie style of electropop and synthpop music. norway.cn norway.cn Anniher unique 安妮因其特立独行的电子 合成流行音乐风 格 而广 受 赞 誉。 norway.org.cn norway.org.cn 安妮因其特立独行合成流行音乐风\n\nSince then she has spent countless hours painting [...] abstract shapes in bright colors to create stunning canvases that have been praised around the world. wipo.int wipo.int abstract shapes in bright colors to create stunning canvasesnd the world. 她的作品图案抽象，色彩鲜艳，给人很强 的冲击力，在世界各地深受美誉。 wipo.int wipo.int 她的作品图案抽象，色彩鲜艳，给人很强 的冲击力，在世界各地深\n\nHong Kong has been praised for its vision [...] and its commitment to primary health care. legco.gov.hk legco.gov.hk Hongits vision 他們讚揚本港高瞻遠 矚和對發展基層健康 服 務作出 的承擔。 legco.gov.hk legco.gov.hk 矚和對發展基層健康的承擔。\n\nThey crave [...] long-lasting attention and praises. They may have been praised so much during the past decade or so, so [...] much that they do not know where they should stand. legco.gov.hk legco.gov.hk long-lasting attention and praises. Theyuch during the past decade or so, so 他們渴望持久的關注 和讚美 ⎯⎯ 他們在過去十多年可能被讚美得 太多了，以致自己也不知 道自己的位置。 legco.gov.hk legco.gov.hk 他們渴望持久的關注⎯ 他們在過去十多年可能被太多了，以致自己也不知 道自己的位置。\n\nInstead of criticizing them I would have thought [...] they ought to have been praised for their frankness [...] and courage. legco.gov.hk legco.gov.hk they oughtheir frankness 為 應 該 讚 許 他們 的坦 率及勇氣。 legco.gov.hk legco.gov.hk 我不會批評這班商界㆟士，反而我認率及勇氣。\n\ntion had been praised by partners and he commended the division for its excellent work in supply management, in shaping markets and reducing prices for [...] the benefit of children. daccess-ods.un.org daccess-ods.un.org On supply, he noted how often the supply funcartners and he commended the division for its excellent work in supply management, in shaping markets and reducing prices for 表 扬。他 赞扬 该部 门在供应管理、影 响市场以及降低价格使儿童受益方面做出了卓越工作。 daccess-ods.un.org daccess-ods.un.org 在供应问题 上，他指出，供应职能多次得到合作伙伴的门在供应管理、影 响市场以及降低价格使儿童受益方面做出了卓越工作。\n\nIn June 2009, the Centre had reported to the Security Council on [...] its work, and had been praised for its efforts. daccess-ods.un.org daccess-ods.un.org its work,its efforts. 2009 年 6 月，该中心向安理会汇报了其工作，并 获得赞赏。 daccess-ods.un.org daccess-ods.un.org 2009 年 6 月，该中心向安理会汇报了其工作，\n\nThe provision of function-expansion [...] firmware, which has been highly praised from the GR DIGITAL [...] to the GR DIGITAL III models, [...] will continue with the GR DIGITAL IV. ricoh.com ricoh.com firmware, wthe GR DIGITAL 从GR DIGITAL到GR DIGITAL [...] III机型，我们提供的功能增强固件一 直倍 受 赞誉 ， 这 些增 强固件将继续为GR DIGITAL IV提供。 ricoh.com ricoh.com III机型，我们提供的功能增强固件一强固件将继续为GR DIGITAL IV提供。\n\nShould AI be a way to praise [...] quality programmes, then \"Stories from Afar\" produced by ATV must have been thoroughly praised by the audience. hkupop.hku.hk hkupop.hku.hk quality programmes, then \"Stories from Afar\" produced by ATVouhe audience. 種表揚 方式 ，則由亞視製作的「尋找他鄉的故事」便徹底受 到 觀 眾表揚 了。 hkupop.hku.hk hkupop.hku.hk 如果欣賞指數是對節目的一，則由亞視製作的「尋找他鄉的故事」便徹底受\n\nThe Board of Health’s initiative has been widely praised as exemplifying the application of classical communicable-disease surveillance-and-control tools to a chronic disease. project-syndicate.org project-syndicate.org The Board of Health’s initiaxemplifying the application of classical communicable-disease surveillance-and-control tools to a chronic disease. 与NCD有关的大 部分健康问题——慢性病痛、睡眠不规律、压抑、残疾和过早死亡——大多与晚期或复杂病症，而不是早期和非复 杂病症有关。 project-syndicate.org project-syndicate.org 部分健康问题——慢性病痛、睡眠不规律、压抑、残疾和过早死亡——大多与晚期或复杂病症，而不是早期和非复 杂病症有关。\n\nSuch a mode has been highly praised by people in different parts [...] of the world, and different cities in the world all hope [...] to learn from our experience in this regard. legco.gov.hk legco.gov.hk Such aeople in different parts 這個模式備受全世界贊許，各地也希 望借鏡。 legco.gov.hk legco.gov.hk 贊許，各地也希 望借鏡。\n\nanes have been praised for giving people ‘freeways [...] for the price of a footpath’, and even though the relative affordability [...] of bicycle networks is beneficial for encouraging their development and maintenance, there are other long term economic benefits. thisbigcity.net thisbigcity.net Bike lgiving people ‘freeways 人們常 稱單 車道 是「 用人 行 道價 格享受高速公路的快感」，除了成本很吸引人，便於建置及維護，還有其他長期經濟優點。 thisbigcity.net thisbigcity.net 單車網的興建費用明顯較低，用人格享受高速公路的快感」，除了成本很吸引人，便於建置及維護，還有其他長期經濟優點。\n\nArtists with a quieter sound include St. Thomas, Thomas Dybdahl and Ane Brun, as well as groups such as Washington, Minor [...] Majority, Salvatore and The White [...] Birch, all of which have been praised by foreign music critics [...] for their expressiveness. norway.cn norway.cn Birch, all of woreign music critics Thomas）”、”托马斯•蒂伯达尔(Thomas Dybdahl)” 和 [...] “按内•布伦(Ane Brun)” 以及 ”华盛顿(Washington)”、 “小多数(Minor Majority)”、 [...] “萨尔瓦托多（Salvatore）”和”白桦树(The White Birch)”等组合的表现能力都得 到国外音乐评论 家的 赞扬。 norway.org.cn norway.org.cn “萨尔瓦托多（Salvatore）”和”白桦树(The White Birch)”等组合的表到国外音乐评论\n\nThe report (S/2011/30, annex) of the SecretaryGeneral’s Special Adviser on Legal Issues Related to [...] Piracy off the Coast of Somalia, [...] Mr. Jack Lang, has been highly praised for comprehensively [...] addressing the operational, [...] security, jurisdictional and economic aspects of piracy off the coast of Somalia, and for setting out an emergency plan focused on Somalia. daccess-ods.un.org daccess-ods.un.org Mr. Jack Lcomprehensively 秘书长索马里沿海海盗活动所涉法律问题特别 [...] 顾问杰克·兰先生的报告(S/2011/30，附件)受到了 高度赞扬，因为它 全面地谈到了索马里沿海海盗问题 所涉及的行动、安全、管辖权和经济问题，并因为它 [...] 制定了重点针对索马里的应急计划。 daccess-ods.un.org daccess-ods.un.org 顾问杰克·兰先生的报告(S/2011/30，附件)受到全面地谈到了索马里沿海海盗问题 所涉及的行动、安全、管辖权和经济问题，并因为它\n\nThe NH4000 DCG equipped with our original technologies, [...] [...] DCG (Driven at the Center of Gravity) and DDM (Direct Drive Motor), for example, has been highly praised by customers for its high speed and high precision machining ability since its [...] release in September, 2003. moriseiki.com moriseiki.com DCG (Driven at the Center of Gravity) and DDM (Direct Drive Motor), for examustomers for its high speed and high precision machining ability since its moriseiki.com moriseiki.com 在 2003 年 9 月份上市的 NH4000 DCG 装载了森精机的独创技术 DCG(重心驱动)和 DDM(直接驱动马达)，其高速和高 精度的加工能力广受用户赞赏。\n\nRecalling the debate at the 32nd session of the General Conference and the call for an overall increase in the human and financial [...] resources allocated to the Culture Sector, whose action to [...] protect heritage has been unanimously acknowledged and praised unesdoc.unesco.org unesdoc.unesco.org protect heriimously acknowledged 忆及大会第三十二届会议的辩论情况及其呼吁全面增加对文化部门人力和资金的 投入，该部门开展的保护遗产行动得 到 了 一致 的认可 和 赞扬 unesdoc.unesco.org unesdoc.unesco.org 忆及大会第三十二届会议的辩论情况及其呼吁全面增加对文化部门人力和资金的 投入，该部门开展的保护遗产行动得\n\nMay I ask the Secretary how the Government can make the public accept the fact that the replacement of the incumbent Chairperson made by the Chief Executive is not due to her boldness in challenging [...] the Government, as a result, [...] the Government has praised her superficially but in fact it is pleased to see [...] her departure? legco.gov.hk legco.gov.hk the Governsuperficially but in facsed to see 府表面上 予 以 讚 揚 ，但 實際 上卻是要換之而後快 呢？ legco.gov.hk legco.gov.hk 請問局長，政府如何使公眾接受，行政長官不是因為現任主席 以往膽敢挑戰政府，所以政上卻是要換之而後快 呢？\n\nment has praised mediation for being so great and impartial, [...] but why did it refuse to make use of mediation and arbitration? legco.gov.hk legco.gov.hk The Governationreat and impartial, 府說得這麼偉大和公正，把調解說 得這 麼好 ，為何政府不肯利 用調解和仲裁呢？ legco.gov.hk legco.gov.hk 和公正，把調解，為何政府不肯利 用調解和仲裁呢？\n\nDuring 12 years of teaching in Metro Education, Dr. Patrick Ng has accumulated rich teaching experience, set up and perfected a set [...] of advanced and rational [...] teaching system; he has also been unanimously praised by fellow teachers [...] and students and has played [...] a leading role in academic researches in Metro Education. metro-education.com metro-education.com teaching systemimoellow teachers 在12年的授课过程中，Dr.Patrick [...] Ng积累了相当丰富的教学经验，建立及完善了一套先进、合理的教学制度，并受到老师、学生的 一致 好评 ， 并在 美都 教育 的学术研究中起到了带头作用。 metro-education.com metro-education.com Ng积累了相当丰富的教学经验，建立及完善了一套先进、合理的教学制度，并受到老师、学生的的学术研究中起到了带头作用。\n\nThe airport at Chek Lap Kok has all the necessary facilities and been praised worldwide. Although [...] there was chaos at the early stage of its opening, it has now got onto the right track [...] and it is an opportune moment for us to consider how we can quickly enhance Hong Kong's status as an international and regional aviation centre in accordance with Article 128 of the Basic Law. legco.gov.hk legco.gov.hk The airport at Chek Lapthe necessary facilitiesdwide. Although 我們 現時的 赤 角 機場設 施 齊 備 ， 並 得 到 世 界 誇 獎 ； 赤 角 機場在由 啟 用初期曾 產 生 各 種 混亂， 至現在各運 作 已 經 上 了 軌道， 所以現在是 [...] 一個好 的 時機， 可 考慮如 何 加 快 按 照 《 基本法》 第 一 百 二 十 八 條的規定，使 香港的國際 和 區 域 航 空 中 心 的地位 得 以 提高，對 此 [...] ， 香港本身 是 有 需 要 採取有關措施和 研 究 一 定的策 略 的 。 legco.gov.hk legco.gov.hk 我們 現時的 赤 角 機場設 施 齊 備 ，界 誇 獎 ； 赤 角 機場在由 啟 用各 種 混亂， 至現在各運 作上 了 軌道， 所以現在是\n\nThe S, P content control at a [...] lower level, has a good weldability, uniform and stable performance was praised by domestic steel companies, has for Baosteel, [...] TISCO, Anshan Iron [...] and Steel and other major domestic blast furnace to provide a large number of high-quality heavy plate, has accumulated for cargo of 13 tons, for the metallurgical industry has contributed to the development. hnlphy.com hnlphy.com lower leod weldability, uniform and stable performomestic steel companBaosteel, 其S、P含量控制在较低水平，具有 良好 的焊接性，性能均匀稳定，被国内钢铁企业所推 崇， 先后 为 宝钢 、太钢、鞍钢等国内大型高炉提供了大量优质宽厚板，已累计供货达13万吨，为冶金行业的发展做出了贡献。 hnlphy.com hnlphy.com 其S、P含量控制在较低水平，具的焊接性，性能均匀稳定，被国内钢铁企业所推、太钢、鞍钢等国内大型高炉提供了大量优质宽厚板，已累计供货达13万吨，为冶金行业的发展做出了贡献。"}, {"url": "https://cn.linguee.com/%E8%8B%B1%E8%AF%AD-%E4%B8%AD%E6%96%87/%E7%BF%BB%E8%AD%AF/to+be+praised.html", "page_content": "will be praised on our Weibo and rewarded with prizes. thirst4water.org thirst4water.org If the work of one Campus Club is particularly good itur Weibo and rewarded with prizes. 做得特 别好 ，我们会在微博上发布它，并给予奖品 奖励。 thirst4water.org thirst4water.org 如果这个校园俱乐部的工作，我们会在微博上发布它，并给予奖品 奖励。\n\nAll initiatives to expedite the proceedings, while fully respecting the rights of the [...] accused, should be praised. daccess-ods.un.org daccess-ods.un.org accused, sh 都值得赞扬。 daccess-ods.un.org daccess-ods.un.org 所有旨在加速程序并 充分尊重被告权利的倡议\n\nIt is my opinion that the [...] Government should be praised for its public [...] and Home Ownership Scheme housing policy which has [...] achieved praiseworthy results over the past 20 years. legco.gov.hk legco.gov.hk Government shits public 該備受讚賞 的， 因為這 20 年來政府實在創造了值得慶賀的成 績。 legco.gov.hk legco.gov.hk 我 認為香 港的公屋和居屋政策是應這 20 年來政府實在創造了值得慶賀的成 績。\n\nGenerally, people think this story demonstrates that Lord Meng Chang should be praised, for he could select talents without sticking only to one pattern; but some other scholars [...] [...] hold a opposite view that Lord Meng Chang should be blamed for recruiting followers without stressing qualifications. chinesestoryonline.com chinesestoryonline.com Generally, people think this story demonstrates that Lord Meng Chang shhe could select talents without sticking only to one pattern; but some other scholars 一般认为，这故事反映了孟尝君能够不拘一格招揽人才，但一些学者认为，这个故事恰恰显示了孟尝君在招揽人上 面不重视质量。 chinesestoryonline.com chinesestoryonline.com 一般认为，这故事反映了孟尝君能够不拘一格招揽人才，但一些学者认为，这个故事恰恰显示了孟尝君在招揽人上 面不重视质量。\n\nould be praised by your friends, who are us, and your newly acquired friends, that we can see the sky of blue and cloud of white every day and can [...] breathe clean air. legco.gov.hk legco.gov.hk Similarly, I also wish you cour friends, who are us, and your newly acquired friends, that we can see the sky of blue and cloud of white every day and can 為他的朋友，也希望 他可 以因 為我們每天也能看到藍天 白雲，也能呼吸新鮮空氣，而贏得我們和他的新朋友的稱許。 legco.gov.hk legco.gov.hk 同樣地，我們作，也希為我們每天也能看到藍天 白雲，也能呼吸新鮮空氣，而贏得我們和他的新朋友的稱許。\n\nThe broad recognition by the Member States of the United Nations of the role of the dialogue among civilizations, and [...] specifically of inter-cultural and inter-religious harmony in maintaining international peace and [...] security, can only be praised. daccess-ods.un.org daccess-ods.un.org security, can 必须赞扬联合国 [...] 会员国广泛认识到不同文明间对话和特别是文化间 和宗教间的和谐对于维护国际和平与安全 的作用。 daccess-ods.un.org daccess-ods.un.org 会员国广泛认识到不同文明间对话和特别是文化间 和宗教间的和谐对于维护国际和平与安全\n\nPresident, the Donald TSANG Administration has left a handsome amount of reserves to the people of Hong [...] Kong and this must be praised. legco.gov.hk legco.gov.hk Kong and this 主席，我很想讚揚曾蔭權的政府留下 很 可 觀的 儲備 給香港市民。 legco.gov.hk legco.gov.hk 主席，我很想讚揚曾蔭權的政府留給香港市民。\n\nI have never seen democrats from anywhere in the world like the Democratic Party which would be praised so highly by the autocrats and their minions. legco.gov.hk legco.gov.hk I have never seen democrats from anywhere in the world like the Democratic Party which wighly by the autocrats and their minions. 我 從未見過世界上有任何地方的民主派，會像民主黨般受到極權主義者及 其奴才的揄揚備至、高度評價。 legco.gov.hk legco.gov.hk 我 從未見過世界上有任何地方的民主派，會像民主黨般受到極權主義者及 其奴才的揄揚備至、高度評價。\n\nIf the Chief [...] Executive is to be praised, then it can [...] be said that on this occasion he has written this Policy Address with [...] his heart and that the Policy Address has been written for the well-being of the people. legco.gov.hk legco.gov.hk Executive in it can 如果要稱讚特首，可以 說他今次是以心來撰寫報告，是為市民的福祉撰寫報告的。 legco.gov.hk legco.gov.hk 說他今次是以心來撰寫報告，是為市民的福祉撰寫報告的。\n\nThe Government should be praised for its green [...] energy initiatives in the policy address. legco.gov.hk legco.gov.hk The Government shits green 政府在施政報告中提出的環保能源措施，實 在 值得 讚許。 legco.gov.hk legco.gov.hk 政府在施政報告中提出的環保能源措施，實\n\nZheng Sheng College provides youngsters with a [...] road of rehabilitation, which should be praised for having such a lofty mission and performing [...] such important responsibilities. legco.gov.hk legco.gov.hk road of rehabilitation, which shhaving such a lofty mission and performing 正生書院提供青少年戒毒自新之路，理念崇高，任重道遠，應該予 以表揚，而 其遷校之舉亦出於實際需要，實在是值 得 我們 的支持。 legco.gov.hk legco.gov.hk 正生書院提供青少年戒毒自新之路，理念崇高，任重道遠，應該予其遷校之舉亦出於實際需要，實在是值的支持。\n\nhad been praised by partners and he commended the division for its excellent work in supply management, in shaping markets and reducing prices for [...] the benefit of children. daccess-ods.un.org daccess-ods.un.org On supply, he noted how often the supply functionartners and he commended the division for its excellent work in supply management, in shaping markets and reducing prices for 表 扬。他 赞扬 该部 门在供应管理、影 响市场以及降低价格使儿童受益方面做出了卓越工作。 daccess-ods.un.org daccess-ods.un.org 在供应问题 上，他指出，供应职能多次得到合作伙伴的门在供应管理、影 响市场以及降低价格使儿童受益方面做出了卓越工作。\n\nThe quality of the conservation work of [...] Hanyuan hall of the Daming Palace is completed [...] to 75% and has been praised both by the experts [...] committee and the authorities. unesdoc.unesco.org unesdoc.unesco.org to 75% andby the experts 受到了专家委员会和该国当 局的赞许。 unesdoc.unesco.org unesdoc.unesco.org 大明宫含元殿保护工程优质率达 75%，专家委员会和该国\n\nIn view of his integrity and professional spirit, I [...] think he should be praised. legco.gov.hk legco.gov.hk think he sh 對於他這種君子之風及 專業精神，我覺得是應該讚賞的。 legco.gov.hk legco.gov.hk 對於他這種君子之風及 專業精神，我覺\n\nThe Financial [...] Secretary should be praised as well on his [...] prudence in dispensing tax cuts. legco.gov.hk legco.gov.hk Secretary shell on his 財政司在分配減稅方面所表現的精 明謹 慎，亦足 稱 許。 legco.gov.hk legco.gov.hk 財政司在分配減稅慎，亦足\n\nInstead of criticizing them I would have thought they [...] ought to have been praised for their frankness [...] and courage. legco.gov.hk legco.gov.hk ought totheir frankness 為 應 該 讚 許 他們 的坦 率及勇氣。 legco.gov.hk legco.gov.hk 我不會批評這班商界㆟士，反而我認率及勇氣。\n\nHowever, I still think that the Government should be praised for one thing ― its support for the development of leisure fishery. legco.gov.hk legco.gov.hk However, I still think that the Government shone thing ― its support for the development of leisure fishery. 當局對漁業的態度，就是有興趣時便幫一 把，沒有興趣時便任由它倒下來，我 覺 得這 是不 合理的做法。 legco.gov.hk legco.gov.hk 當局對漁業的態度，就是有興趣時便幫一 把，沒有興趣時便任由它倒下來，我合理的做法。\n\nGod be praised and Bach is rescued [...] by composing this song our Lady mother of the Lamb of God. cantorion.org cantorion.org Bach is rescued 上帝会称赞巴赫是由创 作这首歌我们的上帝的羔羊的那位女士母亲救出。 zh.cantorion.org zh.cantorion.org 作这首歌我们的上帝的羔羊的那位女士母亲救出。\n\nThe record set by [...] this project was praised by the Indian [...] President. voith.com voith.com this prohe Indian 统 的 称 赞。 voith.com voith.com 该工程所创下的记录受到了印度总\n\nSamuel Daniell sketched animals from life in their natural habitats, [...] and his work was praised for its accuracy [...] and attention to detail. wdl.org wdl.org and hisits accuracy 塞缪尔·丹尼尔速写在其自然栖息生活的动物，他的作品因其准确和关注细节而 受到 称 赞。 wdl.org wdl.org 塞缪尔·丹尼尔速写在其自然栖息生活的动物，他的作品因其准确和关注细节而\n\nThe project operated stably during the period of Olympic Games, and provided good service bearing network for office organizations of the Organizing Committee of the Olympic Games, Olympic event rebroadcasting organizations, provider for information systems for the Olympic Games (ATOS), media villages, athletes village, venues, agreement hotels of Olympic Games, and other members for the Olympic Games, accordingly it guaranteed network access quality for Olympic VIP users, [...] ensured successful completion for communication tasks during the period of [...] Olympic Games, thus being praised by all circles. surekam.com surekam.com Olympic Games,ll circles. 了各 界 的 赞誉。 surekam.com surekam.com 本项目在奥运期间运行稳定，为奥组委办公机构、奥运赛事转播机构、奥运会信息系统的提供商ATOS、媒体 村、运动员村、各场馆、奥运协议酒店、其他奥运大家庭成员提供了优质的业务承载网络，保证了奥运VIP用户 的网络访问质量，保障了奥运会通信任务的圆满完成，受到\n\nICEF was praised for its efforts [...] to integrate gender equality throughout its work, including in the hiring and assessment of staff. daccess-ods.un.org daccess-ods.un.org UNits efforts 有人赞扬儿基会努力 将性别平等纳入其全部 工作，包括工作人员的雇用和评估。 daccess-ods.un.org daccess-ods.un.org 将性别平等纳入其全部 工作，包括工作人员的雇用和评估。\n\nhile being praised for his integrity by [...] his neighbors, Horton forgives the Kangaroo, and she accepts his friendship, finally [...] believing that there are people on the speck. seekcartoon.com seekcartoon.com his integrity by 管被称赞为他的正直，他的 邻居，霍顿原谅的袋鼠，她接受了他的友谊，终于相信，有斑点的人。 zh-cn.seekcartoon.com zh-cn.seekcartoon.com 邻居，霍顿原谅的袋鼠，她接受了他的友谊，终于相信，有斑点的人。\n\nd AI be a way to praise quality programmes, then \"Stories from Afar\" produced by ATV must have been thoroughly praised by the audience. hkupop.hku.hk hkupop.hku.hk Shouly to praise quality programmes, then \"Stories from Afar\" produced by ATV mustouhe audience. 種表揚 方式 ，則由亞視製作的「尋找他鄉的故事」便徹底受 到 觀 眾表揚 了。 hkupop.hku.hk hkupop.hku.hk 如果欣賞指數是對節目的一，則由亞視製作的「尋找他鄉的故事」便徹底受\n\nhave been praised for giving people ‘freeways [...] for the price of a footpath’, and even though the relative affordability [...] of bicycle networks is beneficial for encouraging their development and maintenance, there are other long term economic benefits. thisbigcity.net thisbigcity.net Bike lanesgiving people ‘freeways 人們常 稱單 車道 是「 用人行道價格享受高速公路的快感」，除了成本很吸引人，便於建置及維護，還有其他長期經濟優點。 thisbigcity.net thisbigcity.net 單車網的興建費用明顯較低，用人行道價格享受高速公路的快感」，除了成本很吸引人，便於建置及維護，還有其他長期經濟優點。\n\nThe courage and commitment of those civil [...] servants deserve to be highlighted and praised. daccess-ods.un.org daccess-ods.un.org servants deservlighted 肯定和赞扬。 daccess-ods.un.org daccess-ods.un.org 这些公务员的勇气和敬业精 神值得\n\nThe report (S/2011/30, annex) of the SecretaryGeneral’s Special Adviser on Legal Issues Related to [...] Piracy off the Coast of Somalia, Mr. [...] Jack Lang, has been highly praised for comprehensively [...] addressing the operational, security, [...] jurisdictional and economic aspects of piracy off the coast of Somalia, and for setting out an emergency plan focused on Somalia. daccess-ods.un.org daccess-ods.un.org Jack Lang,comprehensively 秘书长索马里沿海海盗活动所涉法律问题特别 [...] 顾问杰克·兰先生的报告(S/2011/30，附件)受到了 高度赞扬，因为它 全面地谈到了索马里沿海海盗问题 [...] 所涉及的行动、安全、管辖权和经济问题，并因为它 制定了重点针对索马里的应急计划。 daccess-ods.un.org daccess-ods.un.org 顾问杰克·兰先生的报告(S/2011/30，附件)受到全面地谈到了索马里沿海海盗问题\n\nucts are well praised by clients and have won gold medal in International Industry Fair and National Key New Products Title. en.lvd.cc en.lvd.cc The lamp is put into operation in tens of thousands of key engineering projects worldwide such as Shanghai Nanpu Bridge, Korea Seoul Airport, etc. The prodlients and have won gold medal in International Industry Fair and National Key New Products Title. 项 目中 投入使用，客户反响非常好，荣获国际工业博览会金奖和国家重点新产品等称号。 cn.lvd.cc cn.lvd.cc LVD无极灯自2003年研制成功、2004年投放市场以来，至今已拥有100多项专利，在上海南浦大桥、 韩国首尔机场等全球数万个重大工程投入使用，客户反响非常好，荣获国际工业博览会金奖和国家重点新产品等称号。\n\nThe NH4000 DCG equipped with our original technologies, DCG [...] [...] (Driven at the Center of Gravity) and DDM (Direct Drive Motor), for example, has been highly praised by customers for its high speed and high precision machining ability since its release [...] in September, 2003. moriseiki.com moriseiki.com (Driven at the Center of Gravity) and DDM (Direct Drive Motor), for example,ustomers for its high speed and high precision machining ability since its release moriseiki.com moriseiki.com 在 2003 年 9 月份上市的 NH4000 DCG 装载了森精机的独创技术 DCG(重心驱动)和 DDM(直接驱动马达)，其高速和高 精度的加工能力广受用户赞赏。"}, {"url": "https://cn.linguee.com/%E8%8B%B1%E8%AF%AD-%E4%B8%AD%E6%96%87/%E7%BF%BB%E8%AD%AF/has+been+praised+for.html", "page_content": "64. In the context of the country-led process in Rwanda, efforts to [...] achieve food security are intensifying, [...] and the country has been praised for its success in [...] engaging all partners in discussions [...] around a central policy document; establishing a sector-wide approach; designing and implementing successful programmes; and increasing the budget for agriculture from 3 to 6 per cent, and soon to 9 per cent, in accordance with the Maputo Declaration.33 A new investment plan, developed late in 2009, informs Government partners on plans and programmes for food security, including on what has been financed and what remains to be financed and supported.34 In June 2010, the Global Agriculture and Food Security Programme invested $50 million to transform hillside agriculture by reducing erosion and bolstering productivity in an environmentally sustainable manner. daccess-ods.un.org daccess-ods.un.org and the cousuccess in 34 2010 年 6 月，《全球农业和粮食安 全 方案》投资 5 000 万美元通过减少水土流失和支持以环保方式进行生产，改造山 [...] 区农业。 daccess-ods.un.org daccess-ods.un.org 34 2010 年 6 月，《全球全 方案》投资 5 000 万美元通过减少水土流失和支持以环保方式进行生产，改造山\n\nAnnie’ has been praised for her unique indie [...] style of electropop and synthpop music. norway.cn norway.cn Anniunique indie 安妮因其特立独行的电子 合成流行音乐风 格 而广 受 赞 誉。 norway.org.cn norway.org.cn 安妮因其特立独行合成流行音乐风\n\nHong Kong has been praised for its vision and [...] its commitment to primary health care. legco.gov.hk legco.gov.hk Hongvision and 他們讚揚本港高瞻遠 矚和對發展基層健康 服 務作出 的承擔。 legco.gov.hk legco.gov.hk 矚和對發展基層健康的承擔。\n\nInstead of criticizing them I would have thought [...] they ought to have been praised for their frankness [...] and courage. legco.gov.hk legco.gov.hk they oughr frankness 為 應 該 讚 許 他們 的坦 率及勇氣。 legco.gov.hk legco.gov.hk 我不會批評這班商界㆟士，反而我認率及勇氣。\n\nIn June 2009, the Centre had reported to the Security Council on [...] its work, and had been praised for its efforts. daccess-ods.un.org daccess-ods.un.org its work,efforts. 2009 年 6 月，该中心向安理会汇报了其工作，并 获得赞赏。 daccess-ods.un.org daccess-ods.un.org 2009 年 6 月，该中心向安理会汇报了其工作，\n\nanes have been praised for giving people ‘freeways [...] for the price of a footpath’, and even though the relative affordability [...] of bicycle networks is beneficial for encouraging their development and maintenance, there are other long term economic benefits. thisbigcity.net thisbigcity.net Bike lng people ‘freeways 人們常 稱單 車道 是「 用人 行 道價 格享受高速公路的快感」，除了成本很吸引人，便於建置及維護，還有其他長期經濟優點。 thisbigcity.net thisbigcity.net 單車網的興建費用明顯較低，用人格享受高速公路的快感」，除了成本很吸引人，便於建置及維護，還有其他長期經濟優點。\n\nThe report (S/2011/30, annex) of the SecretaryGeneral’s Special Adviser on Legal Issues Related to [...] Piracy off the Coast of Somalia, [...] Mr. Jack Lang, has been highly praised for comprehensively [...] addressing the operational, security, [...] jurisdictional and economic aspects of piracy off the coast of Somalia, and for setting out an emergency plan focused on Somalia. daccess-ods.un.org daccess-ods.un.org Mr. Jack Lrehensively 秘书长索马里沿海海盗活动所涉法律问题特别 [...] 顾问杰克·兰先生的报告(S/2011/30，附件)受到了 高度赞扬，因为它全面地 谈到了索马里沿海海盗问题 所涉及的行动、安全、管辖权和经济问题，并因为它 [...] 制定了重点针对索马里的应急计划。 daccess-ods.un.org daccess-ods.un.org 顾问杰克·兰先生的报告(S/2011/30，附件)受到谈到了索马里沿海海盗问题 所涉及的行动、安全、管辖权和经济问题，并因为它\n\nWhen it comes to economizing on electricity, [...] the Government has been praised by many for its smart idea [...] of offering an electricity subsidy of $1,800. legco.gov.hk legco.gov.hk the Governsmart idea 人稱讚政 府很聰 明，提出補 貼 1,800 元的電 費 。 legco.gov.hk legco.gov.hk 談 到 節約用 電 ， 很 多聰 明，提出補 貼 1,800 元的電 費 。\n\nThe NH4000 DCG equipped with our original [...] [...] technologies, DCG (Driven at the Center of Gravity) and DDM (Direct Drive Motor), for example, has been highly praised by customers for its high speed and high precision machining ability since [...] [...] its release in September, 2003. moriseiki.com moriseiki.com technologies, DCG (Driven at the Center of Gravity) and DDM (Direct Drive Motustomers for its high speed and high precision machining ability since moriseiki.com moriseiki.com 在 2003 年 9 月份上市的 NH4000 DCG 装载了森精机的独创技术 DCG(重心驱动)和 DDM(直接驱动马达)，其高速和高 精度的加工能力广受用户赞赏。\n\nThe quality of the conservation work of [...] Hanyuan hall of the Daming Palace is [...] completed to 75% and has been praised both by the experts [...] committee and the authorities. unesdoc.unesco.org unesdoc.unesco.org completed to 75%by the experts 受到了专家委员会和该国当 局的赞许。 unesdoc.unesco.org unesdoc.unesco.org 大明宫含元殿保护工程优质率达 75%，专家委员会和该国\n\nIt would enable either party to paralyze the process, thus preventing the [...] Dispute Tribunal from the speedy and costefficient [...] disposal of cases for which it has been praised by the General [...] Assembly. daccess-ods.un.org daccess-ods.un.org disposal of che General 庭 如 大 会 赞 赏 的 那样 迅速 和 具 有成 本效 益地审理案件。 daccess-ods.un.org daccess-ods.un.org 它将使得双方 都能够造成程序的瘫痪，因而阻止争议法益地审理案件。\n\ntion had been praised by partners and he commended the division for its excellent work in supply management, in shaping markets and reducing prices for [...] the benefit of children. daccess-ods.un.org daccess-ods.un.org On supply, he noted how often the supply funcartners and he commended the diviexcellent work in supply management, in shaping markets and reducing prices for 表 扬。他 赞扬 该部 门在 供应 管理、影 响市场以及降低价格使儿童受益方面做出了卓越工作。 daccess-ods.un.org daccess-ods.un.org 在供应问题 上，他指出，供应职能多次得到合作伙伴的管理、影 响市场以及降低价格使儿童受益方面做出了卓越工作。\n\n(a) Colombia has been praised as one of the [...] most advanced States in terms of the recognition of the collective rights of indigenous peoples. daccess-ods.un.org daccess-ods.un.org (a) Colone of the (a) 关于法律和公共政策，哥伦比亚一直 被 赞扬 为 最 早承 认土著人民集体权 利的国家之一。 daccess-ods.un.org daccess-ods.un.org (a) 关于法律和公共政策，哥伦比亚认土著人民集体权 利的国家之一。\n\nArtists with a quieter sound include St. Thomas, Thomas Dybdahl and Ane Brun, as well as groups such as Washington, Minor [...] Majority, Salvatore and The White Birch, [...] all of which have been praised by foreign music critics for their expressiveness. norway.cn norway.cn all of woreign music crir expressiveness. Thomas）”、”托马斯•蒂伯达尔(Thomas Dybdahl)” 和 [...] “按内•布伦(Ane Brun)” 以及 ”华盛顿(Washington)”、 “小多数(Minor [...] Majority)”、 “萨尔瓦托多（Salvatore）”和”白桦树(The White Birch)”等组合的表现能力都得 到国外音乐评论 家的 赞扬。 norway.org.cn norway.org.cn Majority)”、 “萨尔瓦托多（Salvatore）”和”白桦树(The White Birch)”等组合的表到国外音乐评论\n\nHong Kong’s [...] Chief Secretary for Administration, Mrs Carrie Lam GBS, JP, has praised Australia’s large expatriate community for their contribution [...] to the city’s vibrancy, [...] cultural diversity and prosperity. hongkong.china.embassy.gov.au hongkong.china.embassy.gov.au Chief Secrenistration, Mrs Carrie Lam GBS,ralia’s large expatriate commur contribution ， 昨晚 出席 澳洲國慶 酒 會， 讚揚 在港 的澳 洲社 群 對香 港這個大都會的活力、多樣文化及繁榮所作出的貢獻。 hongkong.china.embassy.gov.au hongkong.china.embassy.gov.au 香港政務司司長林鄭月娥女士GBS，JP澳洲國慶洲社港這個大都會的活力、多樣文化及繁榮所作出的貢獻。\n\nRecalling the debate at the 32nd session of [...] the General Conference [...] and the call for an overall increase in the human and financial resources allocated to the Culture Sector, whose action to protect heritage has been unanimously acknowledged and praised unesdoc.unesco.org unesdoc.unesco.org and theverall increase in the human and financial resources allocated to the Culture Sector, whose action to protect heriimously acknowledged 忆及大会第三十二届会议的辩论情况及其呼吁全面增加对文化部门人力和资金的 投入，该部门开展的保护遗产行动得 到 了 一致 的认可 和 赞扬 unesdoc.unesco.org unesdoc.unesco.org 忆及大会第三十二届会议的辩论情况及其呼吁全面增加对文化部门人力和资金的 投入，该部门开展的保护遗产行动得\n\nment has praised mediation for being so great and impartial, [...] but why did it refuse to make use of mediation and arbitration? legco.gov.hk legco.gov.hk The Governreat and impartial, 府說得這麼偉大和公正，把調解說 得這 麼好 ，為何政府不肯利 用調解和仲裁呢？ legco.gov.hk legco.gov.hk 和公正，把調解，為何政府不肯利 用調解和仲裁呢？\n\nowey praised the Government of Nauru's determination in bringing world-class mobile telecommunications to the people of Nauru and added, \"We have been working alongside the Government of Nauru for the last six [...] months in ensuring that [...] this investment will transform the lives of all NauruansWe have been enormously encouraged by the sheer drive and enthusiasm of the entire team from Nauru who have worked tirelessly and diligently on this projectDigicel is totally committed to building a hugely successful business with the Government of Nauru and ensuring that everybody in Nauru has access to the service. tipschina.gov.cn tipschina.gov.cn MsSlGovernment of Nauru's determination in bringing world-class mobile telecommunications to the people of Nauru and added,ing alongside the Government of Nlast six 移 动通 信服 务非 常赞 赏并补充说：“我们在过去的六个月里一直在同瑙鲁政府合作，确保这次的投资可以改善所有瑙鲁人民的生活。 tipschina.gov.cn tipschina.gov.cn Slowey女士对瑙鲁政府决心为瑙鲁人民提供世界级赏并补充说：“我们在过去的六个月里一直在同瑙鲁政府合作，确保这次的投资可以改善所有瑙鲁人民的生活。\n\nSuch a mode has been highly praised by people in different parts [...] of the world, and different cities in the world all hope [...] to learn from our experience in this regard. legco.gov.hk legco.gov.hk Such aeople in different parts 這個模式備受全世界贊許，各地也希 望借鏡。 legco.gov.hk legco.gov.hk 贊許，各地也希 望借鏡。\n\n(iv) the dividend (or that part of the dividend in [...] respect of which a [...] right of election has been accorded) shall not be payable in cash on shares in respect whereof the share election has been duly exercised (“the elected shares”) and in lieu thereof shares of the relevant class shall be allotted credited as fully paid up to the holders of the elected shares on the basis of allotment determined as aforesaid and for such purpose the Board shall capitalise and apply out of any part of the undivided profits of the Company (including profits carried and standing to the credit of any reserves or other special account other than the Subscription Rights Reserve) as the Board may determine, such sum as may be required to pay up in full the appropriate number of shares of the relevant class for allotment and distribution [...] to and amongst [...] the holders of the elected shares on such basis. mainland.com.hk mainland.com.hk right of elecrded) shall not be payable in cash on shares in respect whereof the share elecexercised (“the elected shares”) and in lieu thereof shares of the relevant class shall be allotted credited as fully paid up to the holders of the elected shares on the basis of allotment determined as aforesaidpurpose the Board shall capitalise and apply out of any part of the undivided profits of the Company (including profits carried and standing to the credit of any reserves or other special account other than the Subscription Rights Reserve) as the Board may determine, such sum as may be required to pay up in full the appropriate number of shares of the relevant ctment and distribution 擇權已獲正式行使 的股份（「選擇股份」）而言，股息（或 獲賦選擇權的該部分股息）不得以股 份派付，而代以按上述釐定的 配發基準配發入賬列作繳足的相關類別股份予選擇股份持有人的 方式償付，為達致此目的，董事會須自本公司未分派溢利（包括累 計溢利及認購權儲備以外的任何儲備或其他特別賬的進賬項）的任 何部分（由董事會釐定），撥出款項用於繳足按有關基準向選擇股 份的持有人配發及分派適當數目的相關類別股份。 mainland.com.hk mainland.com.hk (iv) 就股份選的股份（「選擇股份」）而言，股息（的該部分股息份派付，而代以按上述釐定的 配發基準配發入賬列作繳足的相關類別股份予選擇股份持有人的 方式償付，為達致此目的，董事會須自本公司未分派溢利（包括累 計溢利及認購權儲備以外的任何儲備或其他特別賬的進賬項）的任 何部分（由董事會釐定），撥出款項用於繳足按有關基準向選擇股 份的持有人配發及分派適當數目的相關類別股份。\n\nThe Working Group recommended that the Committee: (a) refrain from setting up a permanent follow-up mechanism for the time being and instead, in conformity with rule 73 of its rules of procedure, continue to undertake follow-up on an ad hoc basis; (b) entrust the [...] Working Group with [...] follow-up activities for the time being; (c) continue to appoint two rapporteurs on follow-up to views, preferably the Case Rapporteur, when feasible, and a member of the Working Group; and (d) once it has deemed that satisfactory follow-up information has been received from [...] the State party concerned, [...] and in accordance with article 7, paragraph 5, of the Optional Protocol, invite that State party to submit further information about any measures taken in its subsequent reports under article 18 of the Convention, and relieve the follow-up rapporteurs of their duties and reflect such action in its annual report. daccess-ods.un.org daccess-ods.un.org follow-up activitime being; (c) continue to appoint two rapporteurs on follow-up to views, preferably the Case Rapporteur, when feasible, and a member of the Working Group; and (d) once it has deemed that satisfactory follow-up informaived from 活动付托给工作 组；(c) 继续任命两名负责落实意见的后续行动报告员，有可 能的话最好能任命案件报告员，此外任命工作组一名成员；(d) 一旦它认为有关 缔约国提交的后 续行动资料令人满意，即按照《任择议定书》第 7 条第 5 款的规 定，邀请该缔约国提交有关其后来报告中按照《公约》第 18 条采取的任何措施 的进一步资料，解除后续行动报告员的任务，并在其年度报告中反映此项行动。 daccess-ods.un.org daccess-ods.un.org 工作组建议委员会：(a) 避免在目前阶段建立常设后续行动机 制，而应依照其议事规则第 73 条，继续临时性地采取后续行动；(b) 暂时把后 续组；(c) 继续任命两名负责落实意见的后续行动报告员，有可 能的话最好能任命案件报告员，此外任命工作组一名成员；(d) 一旦它认为缔约续行动资料令人满意，即按照《任择议定书》第 7 条第 5 款的规 定，邀请该缔约国提交有关其后来报告中按照《公约》第 18 条采取的任何措施 的进一步资料，解除后续行动报告员的任务，并在其年度报告中反映此项行动。\n\nRegarding the project proposal, [...] several members praised the innovative design of the project, but sought clarification on a number of issues, including how sustainability would be achieved, how the information on the various outcomes would be disseminated to relevant facilities in China, the eligibility of some of the proposed supporting activities under a pilot project, the high costs of destruction compared to similar projects approved for other countries, and how the destruction and waste management approaches used in the pilot demonstration projects would be extended to sectors [...] other than domestic refrigeration. multilateralfund.org multilateralfund.org several meminnovative design of the project, but sought clarification on a number of issues, including how sustainability weved, how the information on the various outcomes weminated to relevant facilities in China, the eligibility of some of the proposed supporting activities under a pilot project, the high costs of destruction compared to similar projects apprr countries, and how the destruction and waste management approaches used in the pilot demonstration projects wnded to sectors 几位成员赞扬项目 设 计新 颖，但是要求澄清几个问题，包括如何 实现可持续性， 各种成果的信息如何传播给中国的相关设施，试点项目下拟议的一些支助 活动是否符合供资条件，销毁成本高于核准的其他国家的类似项目，还有试点示范项目的 销毁和废物管理办法如何扩大到家用制 冷 以外 的行 业。 multilateralfund.org multilateralfund.org 至于项目提案，好颖，但是要求澄清几个问题，包括如何各种成果的信息如何传播给中国的相关设施，试点项目下拟议的一些支助 活动是否符合供资条件，销毁成本高于核准的其他国家的类似项目，还有试点示范项目的 销毁和废物管理办法如何扩大到家用制业。\n\nWith deep understanding of significant meaning of the project for the Evaluation Center on Information Security Level Protection of the Ministry of Public Security, Surekam has provided it with good quality implementation schemes and services by utilizing its advantages in scheme design, [...] [...] system integration, service guarantee, etc. Users from the Information Security Level Protection Evaluation Center of the Ministry of Public Security have well praised Surekam for completing the project construction immediately according to specified quantity and with good quality. surekam.com surekam.com system integration, service guarantee, etc. Users from the Information Security Level Protection Evaluation Center of the Ministry of Public Seculeting the project construction immediately according to specified quantity and with good quality. 优 势， 为公 安部信息安全等级保护评估中心提供优质的实施方案和服务。 surekam.com surekam.com 联信永益公司深刻理解本项目对于公安部信息安全等级保护评估中心的重要意义，并充分发挥在方案设计、系统集 成、服务保障等各方面的安部信息安全等级保护评估中心提供优质的实施方案和服务。\n\nIn determining whether the existing [...] pension scheme for permanent judges should be extended to cover ad litem judges who have served continuously for more than three years, the General Assembly may wish to consider whether, given the changed circumstances of the Tribunals’ operations (namely that the number of ad litem judges has been temporarily increased; several ad litem judges have been authorized by the Security Council to serve beyond the three-year maximum; and some Trial Chambers have been split into sections [...] which may consist [...] only of ad litem judges), the differences in the conditions of service of the two categories of judge continue to be justified. daccess-ods.un.org daccess-ods.un.org pension scanent judges should be extended to cover ad litem judgesed continuothan three years, the General Assembly may wish to consider whether, given the changed circumstances of the Tribunals’ operations (namely that the number of ad litem juorarily increased; several ad litem judgesorized by the Security Council to serve beyond the three-year maximum; and some Trial Chamberst into sections 用于常任法官 的养恤金办法扩及连续服务 3 年以上的审案法官时，大会似可 考虑由于 两法庭业务的变化(即审案法官的数量 已临 时增 加；若干审案法官被安全 理事会授权在 3 年上限后继续服务；以及一些审判分 庭 被分 成若 干部 分，其中只包括审案法官)，两类法官服务条件上的差异是否仍有理由继 续存在。 daccess-ods.un.org daccess-ods.un.org 在决定是否应将现官 的养恤金办法扩及连续3 年以上的审案法官时考虑由于 两法庭业务的变化(即审案法官的数加；若干审案法官被安全 理事会授权在 3 年上限后继续服务；以及一些审判分干部 分，其中只包括审案法官)，两类法官服务条件上的差异是否仍有理由继 续存在。\n\nThe Committee reiterates its previous recommendation (CAT/C/FRA/CO/3, para. 20) whereby compliance with the provisions of article 12 of the Convention requires a derogation from the system of discretionary prosecution, so as to oblige the competent authorities to launch impartial inquiries systematically and on their own initiative [...] wherever there are [...] reasonable grounds for believing that an act of torture has been committed in any [...] territory under its [...] jurisdiction, in order to effectively ensure that the perpetrators of such crimes do not remain unpunished. daccess-ods.un.org daccess-ods.un.org reasonable groeving that an act of toritted in any 委员会重申它建议 (CAT/C/FRA/CO/3,第20段) [...] 缔约国为遵守《公约》第12条， 需要废除酌情起诉制度，这样主管当局只要有合理的 理 由 相 信在 其管 辖境内的任 何地方发生了酷刑行为，就有义务主动开展系统的公正调查，以便有效确保此类 罪行的犯罪者不能免于处罚。 daccess-ods.un.org daccess-ods.un.org 缔约国为遵守《公约》第12条， 需要废除酌情起诉制度，这样主管当局只要有合理的辖境内的任 何地方发生了酷刑行为，就有义务主动开展系统的公正调查，以便有效确保此类 罪行的犯罪者不能免于处罚。\n\n(G) Whenever the Conversion Price is adjusted as herein provided, the Company shall give notice to the CP [...] Shareholders that the [...] Conversion Price has been adjusted (setting forth the event giving rise to the adjustment, the Conversion Price in effect prior to such adjustment, the adjusted Conversion Price and the effective date thereof) and shall at all times thereafter so long as any of the Conversion Rights remains exercisable make available for inspection at the principal place of business for the time being [...] of the Company and [...] the Registrar's Office prior to the Conversion Date a signed copy of the said certificate of the auditors or (as the case may be) of the relevant approved merchant bank and a certificate signed by a Director of the Company setting out the brief particulars of the event giving rise to the adjustment, the Conversion Price in effect prior to such adjustment, the adjusted Conversion Price end this effective date thereof. wuling.com.hk wuling.com.hk Conversion Psted (setting forth the event giving rise to the adjustment, the Conversion Price in effect prior to such adjustment, the adjusted Conversion Price and the effective date thereof) and shall at all times thereafter so long as any of the Conversion Rights remains exercisable make available for inspection at the principal place of busitime being 時 ，本 公司須向可換股優 先股股東發出換股價經已調整的通 知（其中載列導致調整 的事項、有關調整前生效的換股價、經調整換股價及其生 效日期），此後，只要任何換股權仍可行使，本公司須於 兌換日期前在當時主要營業地點及股份過戶登記處存置上 述經簽署的核數師或（視情況而定）相關認可商人銀行的 證書副本，以及本公司董事簽署的載列導致調整的事項、 有關調整前生效的換股價、經調整換股價及其生效日期等 簡明資料證書，以供可換股優先股股東查閱。 wuling.com.hk wuling.com.hk (G) 每當根據本文規定者調整換股價公司須向可換股優 先股股東發出換股知（其中載列導致調整 的事項、有關調整前生效的換股價、經調整換股價及其生 效日期），此後，只要任何換股權仍可行使，本公司須於 兌換日期前在當時主要營業地點及股份過戶登記處存置上 述經簽署的核數師或（視情況而定）相關認可商人銀行的 證書副本，以及本公司董事簽署的載列導致調整的事項、 有關調整前生效的換股價、經調整換股價及其生效日期等 簡明資料證書，以供可換股優先股股東查閱。\n\n(3) The Board shall, as soon as [...] [...] reasonably practicable after any further information is given to it to supplement any representation under subsection (1), make the further information available for public inspection at reasonable hours, and shall continue to do so until the further information has been considered as part of the representation at a meeting under section 6D(1). legco.gov.hk legco.gov.hk reasonably practicable after any further information is given to it to supplement any representation under subsection (1), make the further information availic inspection at reasonable hours, and shall continue to do so until the further informaidered as part of the representation at a meeting under section 6D(1). 料已作為該申述的一部分而根據第 6D(1)條在會議上被考慮為 止。 legco.gov.hk legco.gov.hk (3) 規劃委員會須於任何進一步資料根據第(1)款向它提 供以補充任何申述後，在合理地切實可行的範圍內盡快將該等進一 步資料供公眾於合理時間查閱，並須持續如此行事，直至該等進一 步資申述的一部分而根據第 6D(1)條在會議上被考慮為 止。"}, {"url": "https://www.jazznblues.club/viewtopic.php?t=9398", "page_content": "jazznblues.club\n\nDownload jazz, blues & country music of your favorite aritsts in high quality\n\nSkip to content"}]}