{"Thomas Clayton Wolfe is considered a major American modernist writer.": [{"url": "https://www.britannica.com/biography/Thomas-Wolfe", "page_content": "Thomas Wolfe, in full Thomas Clayton Wolfe, (born Oct. 3, 1900, Asheville, N.C., U.S.—died Sept. 15, 1938, Baltimore, Md.), American writer best known for his first book, Look Homeward, Angel (1929), and his other autobiographical novels.\n\nHis father, William Oliver Wolfe, the Oliver Gant of his novels, was a stonecutter, while his mother, Julia Elizabeth Westall Wolfe, the Eliza of the early novels, owned a successful boardinghouse in Asheville, N.C., where Wolfe grew up. He was educated privately and in 1916 entered the University of North Carolina, where he wrote and acted in several one-act plays. In 1920 he enrolled in George Pierce Baker’s 47 Workshop at Harvard University, intending to become a playwright. Several of his plays were produced at Harvard, including Welcome to Our City (1923), in which the town of Altamont (Asheville) first appeared.\n\nIn 1923 Wolfe left Harvard for New York City, where he resided for the rest of his life. Still intending to be a playwright, he taught at Washington Square College of New York University. In 1926, while abroad, he began work on what eventually became Look Homeward, Angel, in which he recounted the growth of an autobiographical protagonist, Eugene Gant, in the mountain town of Altamont. The book was a success, though its publication caused a great furor in Asheville.\n\nDuring the late 1920s Wolfe entered into a relationship with the theatrical designer Aline Bernstein, who appeared as Esther Jack in his last two novels and who wrote of their friendship in the novel The Journey Down (1938). After the publication of Look Homeward, Angel, Wolfe quit teaching to write full-time. His second novel, Of Time and the River (1935), takes up the story of Eugene Gant from his leaving home to attend Harvard until his meeting with Esther Jack. Wolfe’s memoir of his life in the 1930s, The Story of a Novel (1936), describes his close working relationship with the editor Maxwell Perkins (q.v.), who helped him reduce the enormous manuscripts of his first two works down to manageable novelistic proportions.\n\nWolfe did not publish another novel during his lifetime, though at his death he left a prodigious quantity of manuscript, from which the editor Edward Aswell extracted two more novels, The Web and the Rock (1939) and You Can’t Go Home Again (1940). These books depict the struggles of a young writer to become established in New York City and his first experiences with literary fame. A collection of Wolfe’s shorter pieces and chapters of an uncompleted novel, The Hills Beyond (1941), and his Letters to His Mother (1943) were also published, as well as his Selected Letters (1956).\n\nWolfe was gifted with the faculty of almost total recall, and his fiction is characterized by an intense consciousness of scene and place, together with what is often an extraordinary lyric power. In Look Homeward, Angel and Of Time and the River, Wolfe was able to imbue his life story and the figures of his parents with a lofty romantic quality that has epic and mythopoeic overtones. Powerful emotional evocation and literal reporting are combined in his fiction, and he often alternates between dramatically effective episodes of recollection and highly charged passages of rhetoric. Though The Web and the Rock and You Can’t Go Home Again contain episodes of great vividness, they are too often uncontrolled in their form and fail to sustain the epic tone of Look Homeward, Angel, which has become an American classic."}, {"url": "https://www.encyclopedia.com/people/literature-and-arts/american-literature-biographies/thomas-clayton-wolfe", "page_content": "Thomas Clayton Wolfe\n\nThomas Clayton Wolfe (1900-1938) was an American novelist of prodigious talent and equally formidable failings. His highly autobiographical novels are notable for fervent energy, uninhibited emotion, and grandly rhetorical language.\n\nThomas Wolfe achieved critical acclaim for his unabashed romanticism and visionary faith in the inherent greatness of America and the heroism of its people. He possessed an extraordinary ability for portraiture and a gift for visual detail and sensory impressions, but his brilliance is often diminished in a diffuse sea of inflated irrelevancies and ranting incantations and exhortations. Modern critics have grown less infatuated with his prose and become more aware of the lack of thematic focus, structural cohesion, and controlling artistic intelligence in even his most disciplined work.\n\nThe most striking irony in Wolfe's work is that despite his spontaneous emotionalism there is an absence of compassion for any character other than his self-identifying protagonist, and despite his mystic exaltation of sex there is little credible sexuality and even less love.\n\nLonely Childhood\n\nWolfe was born on Oct. 3, 1900, in Asheville, N.C. His mother had been a schoolteacher before marrying William O. Wolfe, a stonecutter and a man of towering assertiveness and drive. After the parents split up, Wolfe's lonely childhood was spent shuttling between the two. The death of his older brother Ben, whom he idolized, left an emotional scar from which he never recovered.\n\nAfter an outstanding scholastic record, at the age of 15 Wolfe was admitted to the University of North Carolina, where he became active in various publications and theater groups. Two plays were produced: The Return of Buck Gavin (published 1924) and The Third Night (1938). Upon graduation the embryonic author continued at Harvard University, eventually earning a master of arts degree. His involvement with the famous Playwright Workshop led to Welcome to Our City (produced at Harvard, 1923) and to work on Mannerhouse (published 1948), concerning the disintegration of a southern family. His professors' enthusiasm encouraged Wolfe to move to New York in 1923 to seek success in the theater. Failure forced him to accept a position as English instructor at New York University. In 1924 in Europe he met Aline Bernstein, a married mother of two, 16 years his senior, with whom he had a brief but intense love affair.\n\nLook Homeward, Angel\n\nIn 1926 Wolfe began work on an enormous novel which would explore and explain \"the strange and bitter magic of life.\" After some 20 months of furious writing, Wolfe left the huge, sprawling manuscript with Maxwell Perkins, editor of Scribner's. Though impressed with the author's genius, Perkins would not publish the novel until it was considerably revised and drastically cut. After a great deal of reworking and editing, Look Homeward, Angel appeared in 1929. Opening with a 90-page account of the early lives of his father and mother, the novel is a thinly disguised autobiographical record of the author's early years in the person of Eugene Gant.\n\nIn contrast to the critics' instant praise, Wolfe earned the hostility of many relatives and friends who easily recognized themselves in the novel. Though recent critical judgment of the work has been tempered by the recognition of its romantic and at times adolescent pretentiousness, Look Homeward, Angel contains vigorous prose and sequences of unquestionable power, such as the chilling conversation between Eugene and the ghost of his brother Ben, and the graphic description of his father's struggle against cancer. It is Wolfe's major contribution to American literature.\n\nWolfe resigned from New York University in 1930 and returned to Europe for a year on a fellowship. He had in mind a vast novel of several volumes which would range in time from the Civil War to the present and would replace Eugene Gant with a less autobiographical protagonist. After nearly five years of grappling with this conception—while living in extreme loneliness and near poverty in Brooklyn Heights, New York City—Wolfe recognized his inability to achieve a structural unity for the work.\n\nOf Time and the River\n\nPerkins insisted that Wolfe return to his previous autobiographical mode. Despite Wolfe's bitter protestations, a mammoth, haphazardly organized novel, Of Time and the River, appeared in 1935. Here the story of Eugene Gant continues, from his journey to Harvard University, through his period of personal turmoil in Europe, including an unhappy love affair, concluding with his return to the United States. The work's two outstanding sections are a vivid description of Eugene's ride to Boston and the horrifyingly effective account of the death of Gant's father.\n\nAlternating between hysterical affirmation and maudlin self-pity, the novel's young protagonist is a rather unpleasant individual whose heroic conception of himself is never sustained by objective facts. Most of the other characters are sketchily drawn, with the exception of the friend Starwick, who, like Eugene, is endowed with a tragic dimension, whose basis is never made clear. Eugene's relationship with Starwick and his horror at discovering his friend's homosexuality are psychologically ambiguous and absurdly melodramatic. The study maintains a strange effectiveness, however, because of its frequent insights into the abyss of human loneliness and the sterility of self-love.\n\nSeveral months after publication of Of Time and the River, Perkins collected several short stories and sketches extracted from Wolfe's earlier uncompleted novel. Under the title From Death to Morning, the uneven work was severely attacked by critics, although it included two of Wolfe's finest pieces of controlled narration—\"Only the Dead Know Brooklyn\" and \"Death the Proud Brother.\" In 1936 Wolfe terminated his association with Perkins, largely to quell the rumor that the editor had acted as a near collaborator in the creation of his fiction, and signed with Edward C. Aswell, editor of Harper and Brothers.\n\nPosthumous Publications\n\nForgiven by his family and friends in North Carolina, for the first time in many years Wolfe returned home, where he spent several months writing and discovering that \"you can't go home again.\" He presented a voluminous manuscript to Aswell, the working outlines for a new series of novels. On vacation in the West, Wolfe suddenly contracted pneumonia, which activated a tubercular condition. He died on Sept. 15, 1938, in Baltimore.\n\nFrom the eight-foot pile of manuscript left him, Aswell compiled two novels, The Web and the Rock (1939) and You Can't Go Home Again (1940), and a volume of short stories, The Hills Beyond (1941). The novels are no less autobiographical than Wolfe's earlier ones, and despite some impressive prose in The Web and the Rock, there is no indication that Wolfe had begun to achieve mastery of his medium or to discover fresh thematic material. Wolfe's other posthumous writings include Letters to His Mother (1943), Western Journal (1951), and Letters (1956).\n\nFurther Reading\n\nThe only biography of Wolfe is Andrew Turnbull, Thomas Wolfe (1968). An intimate but adulatory view emerges from the reminiscences of Robert Raynolds, Thomas Wolfe: Memoir of a Friendship (1965). Critical studies are Pamela Hansford Johnson, Thomas Wolfe (1947); Herbert J. Muller, Thomas Wolfe (1947); Louis D. Rubin, Thomas Wolfe: The Weather of His Youth (1953); Richard G. Walser, Thomas Wolfe (1961); and Bruce R. McElderry, Thomas Wolfe (1964).\n\nCollections of critical opinion on Wolfe are Richard G. Walser, ed., The Enigma of Thomas Wolfe: Biographical and Critical Selections (1953), and Thomas Clark Pollock and Oscar Cargill, eds., Thomas Wolfe at Washington Square (1954). For briefer discussions see the relevant sections in Joseph Warren Beach, American Fiction, 1920-1940 (1941); Maxwell Geismar, Writers in Crisis: The American Novel between Two Wars (1942); Alfred Kazin, On Native Grounds: An Interpretation of Modern American Prose Literature (1942); Edwin B. Burgum, The Novel and the World's Dilemma (1947); and Frederick J. Hoffman, The Modern Novel in America, 1900-1950 (1951). □"}, {"url": "https://www.biography.com/authors-writers/thomas-wolfe", "page_content": "(1900-1938)\n\nWho Was Thomas Wolfe?\n\nThomas Wolfe was a notable American novelist from the early 20th century. He first attended the University of North Carolina and then Harvard University before moving to New York City in 1923. It was there that he wrote his most popular work, Look Homeward, Angel (1929), an autobiographical piece centering on his alter ego, Eugene Gant. Wolfe followed with four novels over the following eight years and had more than 10 works published after his untimely death in 1938.\n\nEarly Years\n\nThomas Wolfe was born on October 3, 1900, in Asheville, North Carolina, to a stonecutter father and a mother who owned a boardinghouse. After attending a private prep school, Wolfe enrolled in the University of North Carolina in 1916. There he began his writing career, penning and acting in several one-act plays. Wolfe also edited The Tar Heel, UNC's student newspaper, and won the Worth Prize for Philosophy for his essay \"The Crisis in Industry.\" Wolfe graduated in 1920, and in the fall he entered the Graduate School for Arts and Sciences at Harvard University, where he set his sights on becoming a professional playwright as a part of Harvard's 47 Workshop.\n\nIn 1923, Wolfe left Boston for New York, the city he called home for the rest of his life. He taught at Washington Square College of New York University and continued to write. Three years later, while abroad, he began work on what eventually became the novel Look Homeward, Angel.\n\n'Look Homeward, Angel'\n\nIn early 1928, Wolfe completed the manuscript for Look Homeward, Angel, and by summer he learned that Scribner was interested in the work. The book was officially accepted for publication in January 1929, and Wolfe began his long, close and tumultuous relationship with editor Maxwell Perkins (who was also famously the editor of Ernest Hemingway and F. Scott Fitzgerald). Perkins edited the manuscript down into a more manageable form (a process that would eventually mark the beginning of the end of the pair's working relationship), and it was published in October 1929 to great critical reception, placing Wolfe on the literary map as one of America's most promising young novelists.\n\nAnother consequence of publication was the furor caused in Wolfe's hometown of Asheville, as the cast of characters in the autobiographical book hit close to home for many of Asheville's residents.\n\nThe Road to Success\n\nThe following year, Wolfe received a Guggenheim Fellowship and published a second short novel, Web of Earth, and soon began preparations for several other works: K-19, No Door (a short novel) and a collection of three short novels. Wolfe's publication plan conflicted with that of Perkins, who wanted Wolfe to write a follow-up to the story of Eugene Gant, the protagonist of Look Homeward, Angel. Perkins began working with Wolfe daily in 1933 on this proposed book, and in the summer of 1934, ignoring Wolfe's objections, Perkins sent the manuscript of Of Time and the River to Scribner. The book was generally well-received upon publication, but Wolfe was bitterly displeased with it, blaming Perkins for the unsatisfactory form of the final product.\n\nAn Early Death\n\nIn 1936, Wolfe's dissatisfaction with Perkins led to a larger conflict with Scribner, and Wolfe left Scribner for Harper & Brothers. Two years after leaving Scribner, Wolfe left New York to travel to the American West. In July 1938, he became sick in Seattle, and two months later he was sent to the Johns Hopkins University Hospital. Wolfe could not recover his health, and he died at Johns Hopkins of tuberculosis of the brain shortly before his 38th birthday.\n\nAfter Wolfe's death, Edward Aswell, Wolfe's Harper editor, assembled from the manuscripts left behind the novels The Web and the Rock (1939) and You Can't Go Home Again (1940). Several other collections and uncompleted works also appeared posthumously, and Wolfe's legacy is that of one of America's strongest writers whose potential was cut tragically short.\n\nQUICK FACTS\n\nName: Thomas Wolfe\n\nBirth Year: 1900\n\nBirth date: October 3, 1900\n\nBirth State: North Carolina\n\nBirth City: Asheville\n\nBirth Country: United States\n\nGender: Male\n\nBest Known For: Thomas Wolfe was a major American novelist of the early 20th century, notable for his first book, 1929's 'Look Homeward, Angel.'\n\nIndustries\n\nEducation and Academia\n\n\n\nTheater and Dance\n\n\n\nFiction and Poetry\n\nAstrological Sign: Libra\n\nSchools\n\nUniversity of North Carolina\n\n\n\nHarvard University\n\nDeath Year: 1938\n\nDeath date: September 15, 1938\n\nDeath State: Maryland\n\nDeath City: Baltimore\n\nDeath Country: United States\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Thomas Wolfe Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/authors-writers/thomas-wolfe\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: September 6, 2019\n\nOriginal Published Date: April 2, 2014\n\nQUOTES"}, {"url": "https://www.thefamouspeople.com/profiles/thomas-clayton-wolfe-3037.php", "page_content": "In June 1922, Wolfe’s father passed away in Asheville. He studied for one more year under Baker. In May 1923, his 10-scene play, ‘Welcome to Our City,’ was staged by ‘47 Workshop.’\n\nIn June 1920, Wolfe graduated with a BA degree. He joined the ‘Graduate School for Arts and Sciences’ at ‘Harvard University’ in September 1920. He studied playwriting under George Pierce Baker at his ‘47 Workshop.’ In 1921, two versions of Wolfe’s play ‘The Mountains’ were performed by the ‘47 Workshop.’ In 1922, he obtained his MA degree from ‘Harvard.’\n\nWolfe volunteered as a civilian war worker in Norfolk during the summer of 1918. Later, he joined Prof. Frederick Koch’s playwriting course at the university. In March 1919, the university’s theater company, ‘Carolina Playmakers,’ performed his one-act play, ‘The Return of Buck Gavin.’ The play witnessed Wolfe playing the title role. The group also staged his ‘The Third Night’ in December 1919.\n\nIn 1916, Wolfe joined the ‘University of North Carolina,’ where he was the editor of the student newspaper ‘The Tar Heel.’ His essay ‘The Crisis in Industry’ won him the ‘Worth Prize for Philosophy.’ He was a member of the ‘Dialectic Society’ and the ‘Pi Kappa Phi’ fraternity. He was an inductee of the ‘Golden Fleece’ honor society.\n\nWolfe’s mother bought a boarding house named the ‘Old Kentucky Home’ on 48, Spruce Street of Asheville, where she moved in with Thomas. Though it was situated close to the family home on 92 Woodfin Street, where Thomas often went to meet his siblings, he mostly spent a lonely childhood. His older brother, Ben, died in 1918. This left a deep emotional impact on Wolfe, as he was quite close to Ben.\n\nWolfe was youngest of the eight siblings in the family. The first-born child of his parents, Leslie, died in infancy. His other siblings were Eddie Nelson, Frank Cecil, Mabel Elizabeth, twins Grover Cleveland and Benjamin Harrison, and Frederick William. In 1904, during the ‘World Fair,’ he accompanied his family to St. Louis, where his mother ran a boarding house. One of his brothers, Grover, died of typhoid in St. Louis.\n\nWolfe was born on October 3, 1900, in Asheville, North Carolina, to William Oliver Wolfe and Julia Elizabeth Westall-Wolfe. His father was a stone carver, while his mother owned a boarding house and dealt in real estate.\n\nRecommended Lists:\n\nCareer\n\nIn November 1923, Wolfe went to New York City to raise funds for the ‘University of North Carolina’ and with an aim to see his plays on ‘Broadway.’ However, even after 3 years, he did not succeed, as the plays were lengthy and unsuitable for stage. In 1924, he joined the ‘Washington Square College’ of ‘New York University’ as an instructor for English. He continued to teach from time to time, until January 1930.\n\nWolfe went to Europe for the first time in October 1924. There, he visited France, Italy, and Switzerland. While returning in 1925, he met Mrs. Aline Bernstein, wife of a stockbroker and a mother of two. She was a scene designer for ‘Theater Guild.’ In October 1925, he got romantically involved with Aline, who was 18 years his senior. The two had an intense, stormy affair for the next 5 years. She proved to be a powerful influence and muse of his life.\n\nOn his second European trip in 1926, Wolfe commenced work on his first novel, initially titled, ‘O Lost.’ After 20 months of writing, he completed it in March 1928 and submitted the manuscript to ‘Scribner’s,’ who showed immense interest in it. The lengthy manuscript was edited by well-known editor Maxwell Perkins. The two had a long and close association.\n\nPerkins edited the long autobiographical fiction to a manageable proportion. It was named ‘Look Homeward, Angel.’ The novel was about the protagonist ‘Eugene Gant,’ Wolfe’s alter ego, who lived in the town of ‘Altamont,’ which stood for Asheville. It was published on October 8, 1929, and was well-received. Wolfe was considered one of the most promising American novelists of the time. However, his family and the residents of Asheville, who could easily recognize their references in the novel, did not take it well. Wolfe stayed away from the town for nearly 8 years. Soon after, he ended his relationship with Bernstein.\n\nin 1930, Wolfe went to Europe for a year on a ‘Guggenheim Fellowship.’ Later, he stayed in Brooklyn and continued to write. He withdrew his second novel, ‘K-19,’ after submitting it for publication. He published the short novels ‘A Portrait of Bascom Hawk’ and ‘Web of Earth.’ The former co-won the ‘Scribner’s Short Novel Prize.’\n\nBy 1935, Wolfe had completed a short novel named ‘No Door’ and a collection of three more novellas. On Perkins’s suggestion, in 1933, he began his second lengthy autobiographical novel, ‘Of Time and the River.’ Wolfe had reservations about the final edited product, though it sold better than his first novel.\n\nNot too happy with Perkins’s severe editing, Wolfe signed with ‘Harper & Brothers.’ He made a speech at the 1935 ‘Writer’s Conference,’ Colorado, (later published as ‘The Story of a Novel’), stating his struggle with his second novel. A collection of short stories and novels, ‘From Death to Morning,’ was published in November 1935.\n\nWolfe’s writing was popular in Europe, especially in Germany. On his last two visits, he witnessed the treatment given to Jews in Germany, which culminated in his short novel ‘I Have a Thing to Tell You.’ After it was published, he was prohibited from entering that country.\n\nIn 1936–1937, Wolfe released his short writings through several publications. In 1937, he visited Asheville after nearly 8 years.\n\nIn 1938, he submitted a volume of his writings to Edward Aswell of ‘Harper & Brothers.’ He then began a tour of Western United States. He delivered a guest lecture at the ‘Purdue University’ and then visited 11 national parks. While in Seattle, he fell sick with pneumonia, which later developed in tuberculosis that spread to his brain. He was sent to the ‘John Hopkins Hospital,’ Baltimore, but died on September 15, 1938."}, {"url": "https://www.ncpedia.org/biography/wolfe-thomas-clayton", "page_content": "Wolfe, Thomas Clayton\n\nby C. Hugh Holman, 1996\n\n3 Oct. 1900–15 Sept. 1938\n\nThomas Clayton Wolfe, novelist and short story writer, was born in Asheville, the eighth child of William Oliver, a stonecutter from Pennsylvania, and Julia Elizabeth Westall Wolfe, a native North Carolinian. In 1904 he went with his mother and some of the other children to St. Louis, where his mother kept a boardinghouse during the World's Fair and where his brother Grover died, an event that he was to use with distinction in his fiction. In 1905 he began attending public school in Asheville and in 1912 moved to a private school operated by Mr. and Mrs. J. M. Roberts. Margaret Roberts was a major influence on his life and work.\n\nIn 1916 Wolfe entered The University of North Carolina as a freshman. In the summer of 1918 he was a civilian war worker in Norfolk; that fall he enrolled in Professor Frederick H. Koch's playwriting course at The University of North Carolina. On 14 and 15 Mar. 1919 his one-act play, The Return of Buck Gavin, was performed with Wolfe in the title role on the first bill of the Carolina Playmakers. Wolfe edited The Tar Heel, The University of North Carolina student newspaper, and won the Worth Prize for Philosophy for an essay, \"The Crisis in Industry.\" Another of his plays, The Third Night, was performed by the Playmakers in December 1919.\n\nIn June 1920 he was graduated from the university with a B.A. degree and in September entered the Graduate School for Arts and Sciences at Harvard University to earn an M.A. degree in English and to study playwriting under George Pierce Baker. Two versions of his play The Mountains were performed by the 47 Workshop at Harvard in 1921. In 1922 he completed the requirements for the M.A. degree, and in June of that year his father died in Asheville, another event of great importance in his fiction. Wolfe continued to study with Baker in the 47 Workshop, which in May 1923 produced his ten-scene play Welcome to Our City. In November 1923 he went to New York City, where he solicited funds for The University of North Carolina. In February 1924 he began teaching English as an instructor at the Washington Square College of New York University, a task that he continued to perform intermittently until January 1930. According to student reports, he was a conscientious and successful teacher.\n\nIn October 1924 he sailed for England on the first of what proved to be seven European trips. He traveled in France, Italy, and Switzerland, and on his return voyage in 1925, he met Mrs. Aline Bernstein, who was eighteen years his senior, a scene designer for the Theater Guild and the wife of a successful stockbroker. In October 1925 she became his mistress. Their affair was stormy, but Aline Bernstein was one of the powerful influences on his life. In the summer of 1926 he returned to Europe and there began work on the first version of his novel Look Homeward, Angel. In the summer of 1927 he made his third European journey, traveling in France, Austria, and Germany.\n\nOn 31 Mar. 1928 he completed the manuscript for the novel Look Homeward, Angel. That summer he made his fourth European trip, was injured in a fight at the Oktoberfest in Munich, and received news of Scribner's interest in Look Homeward, Angel, which was accepted for publication in January, beginning his long, close, and sometimes painful association with the editor Maxwell Perkins. The amount of editing done on the manuscript by Perkins has been greatly exaggerated. The novel, when published on 8 Oct. 1929, was of all Wolfe's long works the one closest to his original plan. It sold only moderately well, but it was a great critical success, and Wolfe was hailed as the most promising young American novelist.\n\nIn 1930 he received a Guggenheim Fellowship and made his fifth European tour. On his return in the late spring of 1931, he began living in Brooklyn. The following year his tempestuous affair with Mrs. Bernstein ended. Perkins, after first putting it into production, withdrew his second novel, K-19, which remained unpublished. His short novel, A Portrait of Bascom Hawke, appeared in Scribner's Magazine, and it was co-winner of the $5,000 Scribner's Short Novel Prize. In July he published a second short novel, Web of Earth, one of his best works.\n\nDuring the period between 1932 and 1935 Wolfe prepared three books for publication, K-19, No Door, a short novel, and a collection of three short novels. Perkins, however, insisted that Wolfe must come forward with a long work continuing his saga of Eugene Gant, the protagonist of Look Homeward, Angel. Wolfe was having difficulty with the large book although he was publishing excellent short stories and short novels. In 1933 Perkins began to work with him daily on the \"big book\" and finally, in July 1934, over Wolfe's protests, sent the manuscript of Of Time and the River to the publishers. On its publication Wolfe was bitter about the shape of the book, declaring that had he been allowed to, he would have made it much better. The critics, although generally approving, did find the work to be sprawling and ill organized.\n\nIn 1935 he participated in the Writer's Conference at Boulder, Colo., and his speech made there was published as a serial in the Saturday Review of Literature and as a book, The Story of a Novel. This work recounts his struggle to produce Of Time and the River. In November 1935 From Death to Morning, a collection of short novels and short stories, was published.\n\nIn 1935 and 1936 Wolfe made his sixth and seventh European trips, spending much time in Germany, where translations of his works had made him a very popular figure. In 1936, leaving Berlin on a train, an incident with a Jew trying to escape Germany forced him to recognize the cruel nature of the Nazi state, and on returning home he wrote one of his most powerful short novels, \"I Have a Thing To Tell You,\" a strong indictment of Germany, which was serialized in the New Republic. Like many of his short novels, it was later incorporated in expanded form in one of his novels, in this case You Can't Go Home Again.\n\nIn 1936 his quarrel with his publisher, Charles Scribner's Sons, began; it grew out of his sense that Perkins was preventing him from writing what he truly wished to write, and it was exacerbated by what he felt was Scribner's unwillingness to defend him in a libel suit and by his unhappiness about the reputation that Of Time and the River and The Story of a Novel gave him of being a prodigious but formless writer whose works were shaped by his editor. This struggle with Scribner's continued throughout 1937, until in December he signed a contract with Edward C. Aswell, of Harper and Brothers, for the publication of his later work. However turbulent this period was emotionally, it was one of the most fruitful for Wolfe in terms of short publications in such journals as the New Republic, the New Yorker, Scribner's, American Mercury, Harpers Bazaar, the Yale Review, and the Saturday Evening Post.\n\nIn 1938 he left New York for a western tour, depositing the large body of manuscript materials that he had with his new editor, Edward C. Aswell. On the way west, he stopped by Purdue University and gave a lecture, \"Writing and Living\" (published in 1964). In July 1938 he became ill in Seattle, and on 6 September he was sent to the Johns Hopkins University Hospital, where he died of tuberculosis of the brain, eighteen days before his thirty-eighth birthday.\n\nAfter Wolfe's death, Edward Aswell assembled from the manuscripts the novels The Web and the Rock and You Can't Go Home Again, which were published in 1939 and 1940. A collection of short stories and sketches and fragments of a novel were published as The Hills Beyond in 1941. In assembling these works, Aswell worked from Wolfe's outline and organized the material in the huge but incomplete collection of manuscripts that Wolfe had left. The Web and the Rock, which deals with a new protagonist George Webber, is pretty much the novel that Wolfe would have produced, although the latter two-thirds would certainly have been greatly revised. You Can't Go Home Again, also about Webber, is largely a collection of materials, with narrative links written by Aswell to bridge the gaps. Thus only in his short stories, short novels, and Look Homeward, Angel does Wolfe's work survive in a form in which he himself was the principal agent of organization. Of Time and the River carries too much of Maxwell Perkins's intention rather than Wolfe's, even to being in the third person when Wolfe had written most of it in the first person. The last two novels had to be given their present shape by Aswell with only Wolfe's outline to assist him.\n\nIn 1991 The University of North Carolina Press and Paul Gitlin, administrator of the estate of Thomas Wolfe, brought out The Good Child's River, an unfinished novel \"based loosely on the early life of\" Aline Bernstein, edited and with an introduction by Suzanne Stutman. According to the jacket, \"Some sections of this work were heavily edited and published after Wolfe's death. Here for the first time is The Good Child's River, as Wolfe wrote it, along with some fragments, contained in two appendixes, that Wolfe may have intended to include in the finished work.\"\n\nThomas Wolfe was a writer of enormous energy and imaginative force, marked by a richly rhetorical style and powerful command of language. The subject of the bulk of his writing was his own experience as an American. He was in the tradition of Walt Whitman, attempting through the record of himself to explain and to define what it meant to be an American. His work is marred by excesses and exuberance, and of his novels, only Look Homeward, Angel has the firm shape that he himself gave it. Out of these facts has grown the legend that Wolfe was an uncontrolled and excessive writer, blessed with the gift of language but unable to control the structure of his works. But his thirty-two short stories and his seven short novels indicate quite clearly that this was not true. In the short length of the story and the intermediate length of the short novel, he was able to write tightly organized, powerful, and convincing stories, and it was only when he began to assemble these works into large structures, such as those that Perkins imposed on him in the early 1930s, that his lack of artistic control became apparent.\n\nWolfe's subject was always himself and his experiences, transmuted by the imagination and elevated by the power of his rhetoric. His effort to put a person, himself, fully \"on record\" through the guise of fiction was a major and masterful accomplishment in the American novel, and at the time of his death he was ranked among the top three or four twentieth-century American novelists. His critical stock has fallen severely since his death in 1938, yet his command of language, the strength of his characterizations, and the power with which he could describe the experiences and feelings of youth were all such that his place as a permanent figure in American writing seems assured."}, {"url": "https://worldsbeststory.com/blog/the-enduring-legacy-of-thomas-wolfe-an-exploration-of-his-novels-writing-style-and-impact-on-popular-culture/", "page_content": "Thomas Clayton Wolfe (October 3, 1900 – September 15, 1938) was an American novelist and short story writer of the early 20th century.\n\nHe is considered one of the most important figures in American literature of his time.\n\nWolfe was born in Asheville, North Carolina, the youngest of eight children. His father, William Oliver Wolfe, was a stonecutter, while his mother, Julia Elizabeth Westall Wolfe, was a schoolteacher.\n\nWolfe was raised in a boarding house run by his mother, where he was exposed to a diverse group of people, which would later influence his writing.\n\nHe attended the University of North Carolina at Chapel Hill, where he studied playwriting and graduated with a degree in history in 1920.\n\nAfter graduation, he worked as a journalist and a playwright before moving to New York City to pursue a career in writing.\n\nHe is best known for his novels “Look Homeward, Angel” (1929) and “Of Time and the River” (1935).\n\nLook Homeward, Angel\n\n“Look Homeward, Angel” is considered to be Wolfe’s masterpiece and is based on his own life growing up in North Carolina. The novel is a semi-autobiographical coming-of-age story that follows the life of Eugene Gant, a young man who is trying to escape the small town of Altamont and find his place in the world.\n\nThe novel explores themes of family, love, and the search for identity.\n\nOf Time and the River\n\n“Of Time and the River” is a sequel to “Look Homeward, Angel” and continues the story of Eugene Gant’s journey as he goes to college and begins his career as a writer.\n\nThe novel is known for its vivid descriptions of New York City and its exploration of the themes of loss and the passage of time.\n\nWolfe’s other novels include “The Web and the Rock” (1939) and “You Can’t Go Home Again” (1940).\n\nThese novels continue the theme of the search for identity and the passage of time, and are known for their vivid descriptions of the places and people that the characters encounter.\n\nWolfe’s writing style is characterized by its use of long, flowing sentences and its focus on the inner thoughts and feelings of the characters.\n\nHe was known for his use of stream-of-consciousness technique and for his ability to convey a sense of time and place in his writing.\n\nWolfe’s works have been praised for their emotional depth and their ability to capture the complexity of human experience.\n\nDespite being a prolific writer, his books were not always well-received during his lifetime, however, his influence on American literature is widely acknowledged today.\n\nWolfe’s books are considered to be some of the most important works of American literature from the 20th century, and continue to be widely read and studied today.\n\nThe books give readers a glimpse into the human experience, and his vivid and detailed descriptions of the places and people he wrote about are still considered masterful today.\n\nMovies And Television\n\nThomas Wolfe’s novels have been adapted into movies and television shows several times.\n\n“Look Homeward, Angel” was adapted into a film in 1958, directed by David Miller and starring Anthony Perkins as Eugene Gant.\n\nThe film received mixed reviews, but Perkins’ performance was praised.\n\n“Of Time and the River” was adapted into a film in 1935, directed by John Cromwell and starring Matthew Garber as Eugene Gant.\n\nThe film was not a commercial success, but it received positive reviews.\n\n“You Can’t Go Home Again” was adapted into a television series in 1979, directed by George Schaefer and starring Richard Thomas as George Webber. The series was not well-received and was cancelled after one season.\n\nWolfe’s novels have also been adapted into stage plays and musicals, most notably “Look Homeward, Angel” was adapted into a stage play in 1957, directed by Elia Kazan and starring Anthony Perkins as Eugene Gant. The play was a critical success and ran for over 500 performances on Broadway.\n\nIn general, the adaptations of Thomas Wolfe’s novels have been met with mixed reviews, and the novels are often considered to be better works than the adaptations.\n\nHowever, the adaptations do provide an opportunity for a wider audience to discover and appreciate Wolfe’s writing, and they also showcase different interpretations of the novels.\n\nPop Culture\n\nThomas Wolfe’s novels and writing have had a significant impact on popular culture.\n\nIn literature, Wolfe’s writing style and themes have influenced many writers, particularly those in the southern literary tradition. His use of stream-of-consciousness technique and focus on the inner thoughts and feelings of characters have been widely imitated.\n\nIn music, several songs have been inspired by or make reference to Thomas Wolfe’s works. For example, the song “Look Homeward, Angel” by the band Big Star is named after Wolfe’s novel. Also, The song “Of Time and River” by the band The Head and the Heart also references the title of his novel\n\nIn film and television, Wolfe’s novels have been adapted several times as mentioned before, and his writing has also been referenced in various shows and movies, such as in the TV series “The West Wing” and in the movie “The Notebook”.\n\nIn general, Thomas Wolfe’s novels and writing continue to be studied and celebrated for their vivid descriptions, emotional depth, and exploration of timeless themes. His works continue to be an important part of American literary and cultural heritage."}, {"url": "https://www.persee.fr/doc/dha_0755-7256_2015_num_41_1_4136", "page_content": "DHA 41/ 1-2015 Dialogues d’histoire ancienne 41/ 1-2015\n\nModernist Concerns and Greek and Latin Culture: Thomas S. Eliot’ s Mythical Method in Thomas C. Wolfe’ s Novels\n\nPierre Jamet Université de Franche-Comté – ISTA-EA 4011 pierre. jamet@ univ-fcomte. fr\n\nIn the early 20th century, artistic and literary avant-gardes were intent upon renewing forms in a transgressive, progressist or liberating atmosphere of exhilaration. Movements and manifestos blossomed, from Dadaism to Futurism via Cubism, geometric abstraction, atonality or Surrealism. Yet the global conflagration of World War I put an end to many hopes and brought back everyone to a common concern for (re) construction, solidity, order, structure or even tradition in aesthetics. Modernism, that international movement in the arts which can be said to start after the Great War, wavers between a taunting desire to rebuild everything, a wilful aspiration to a future based on new values, and some degree of scepticism towards this very aspiration – which was also perceived as having somehow accompanied the global suicidal movement. Not long before the Modernists, Arthur Rimbaud could declare that one must be resolutely modern in art (“ il faut être absolument moderne”), but shortly after Michel Leiris claimed, provocatively enough, that modern times were but a pit of mire (“ modernité, merdonité”).\n\nIndeed, 20th century artists and intellectuals now seem to have looked both back to an enchanted past and forward to an uncertain future. The American poet and critic Thomas Stearns Eliot (1888-1965) comes to the fore in this context. He is a most prominent figure of literary Modernism, like his compatriot Thomas Clayton Wolfe (1900-1838), though the latter is much less well known. Both perfectly illustrate a divide in American literature which concerns its independence, or lack thereof, from European literature. Is there an American literary specificity or will American literature forever depend on the glorious past of Old Europe? Such a question is already present in Whitman, Melville or Henry James but Eliot and Wolfe seem particularly interesting cases insofar as they give radical yet diverging answers. Eliot demonstrates how the most ancient and diverse myths are relevant to the present"}, {"url": "https://samplius.com/free-essay-examples/a-research-paper-on-thom-wolfe-one-of-the-most-influential-writers/", "page_content": "Thomas Clayton Wolfe was an extremely talented author and individual. He wrote about his experiences as an American with such power, energy, and passion. He was uncontrollably talented and wrote often. He was blessed with the ability to express himself so beautifully through his writing. Thomas Clayton Wolfe was born on October 3, 1900 in Asheville, North Carolina. His parents were William Oliver and Julia Elizabeth Westall Wolfe. His father was originally from Pennsylvania while his mother was from North Carolina. His father was a stonecutter. In 1904, his brother Grover Cleveland Wolfe died. Grover was not the first of the Wolfe children to die. When he was five years old, he began attending public school in Asheville. He continued to go to public school for seven years. In 1912 he transferred to a private school. There a woman named “Margaret Roberts was a major influence on his life and work”. She encouraged him to study poetry and classical literature. The private school was operated by Mr. and Mrs. J.M. Roberts. After that he continued his studies by enrolling in The University of North Carolina. There he began his studies as a freshman in the year 1916. Two years later Wolfe became a civilian worker in Norfolk during the summer of 1918. That fall, he took a playwright class at The University of North Carolina. His instructor was a man named Professor Frederick H. Koch. Wolfe performed a one-act play called ‘The Return of Buck Gavin’. He performed this play on March 14-15, 1919. Thomas Wolfe, like any other person, had struggles in his life. It is safe to say that Wolfe may have struggled as a child growing up, especially with the occurrence of the death of his siblings and family members. That had to be somewhat traumatic for him, everyone dying so early in his life. His family members could’ve possibly died from Tuberculosis, which would explain his fear of the disease. His mother also created a home to help aid those dying from the dreadful disease, that may have also encouraged this fear of death so early into his life. Thomas Wolfe had many great achievements throughout his life, but there are three that stand out against all his other accomplishments and milestones. His experiences helped to create passionate and beautiful literature that inspired many young authors. Thomas Wolfe began on what would be the first of his trips to Europe. He travelled to many places throughout Europe such as England, France, Italy, Germany, and Switzerland.\n\nWant to receive an original paper on this topic? Just send us a “Write my paper” request. It’s quick and easy! Write my paper\n\nIt was on these trips that he met a young woman named Aline Bernstein. She would later become his mistress in the year 1925. Aline Bernstein was very important to Wolfe and played a very influential role in his life. “In 1930 he received a Guggenheim Fellowship and made his fifth European tour”. He returned from this trip in 1931 and began living in Brooklyn. Thomas Wolfe took the last of his European trips in the years 1935 and 1936. He spent most of his time on European trips in Germany, where he was most popular. “In 1936, leaving Berlin on a train, an incident with a Jew trying to escape Germany forced him to recognize the cruel nature of the Nazi state.” When Wolfe returned home, he wrote I Have a Thing to Tell You, which portrayed the disgusting behavior of the Nazis. “Like many of his short novels, it was later incorporated in expanded form in one of his novels, in this case You Can’t Go Home Again.” In 1936, Wolfe got into a fight with his publisher Charles Scribner’s Sons. The quarrel began because Wolfe felt that Perkins, Thomas Wolfe’s editor, was preventing him from writing what he truly wanted to write and that Charles was not defending him or his works as he should. This struggle was continued until 1937, when Wolfe signed with Edward C. Aswell, of Harper and Brothers. It was during this time that his last works were published. It was a very emotional time, but t’was the most fruitful. Wolfe had never been more successful with his writing. He wrote mainly short stories during this time. Thomas Wolfe’s greatest literacy work is Look Homeward, Angel. This book was “published on October 8, 1929”. The novel was dedicated to one of his teachers who helped to shape him into a great author, Margaret Roberts. “It sold only moderately well, but it was a great critical success, and Wolfe was hailed as the most promising young American novelist”. Thomas Wolfe was a very influential man. He and his works inspired other authors such as “Hunter Thompson, Ray Bradbury, Jack Kerouac, and others” (Brian Hoey.) “Whatever the reasons, however, Wolfe’s impact on the twentieth century, though increasingly invisible, proved extremely robust. His distinct blend of epic, autobiography, and modernist style seemed to exist at a uniquely American intersection, comprising the ornate stream of consciousness of William Faulkner with the sustained, close observations of Herman Melvilleand Nathaniel Hawthorne. As such, his influence can be seen in the works of such writers as Betty Smith, Philip Roth, and Pat Conroy.”\n\nThomas Wolfe belonged to the twentieth century American novelists’ era. He wrote four long novels as well as many short stories. Thomas Wolfe did not have much of influence during the 20th century. He did not become popular until near the time of his death and after. Thomas Wolfe died on September 15, 1938. Wolfe died from tuberculosis of the brain. It is believed that Wolfe had a fear of Tuberculosis, he wrote about the disease often as well as many others. In one of his many letters to his mom he describes what seems to be symptoms of Tuberculosis that he was experiencing. This letter was sent and read many years before his diagnosis of Tuberculosis. “In 1900, the year of Wolfe’s birth, TB was the most dreaded disease throughout the world and was the leading cause of death in the United States. The “climatic theory” of treating lung disease, which originated in Germany and Switzerland, proposed that altitude, atmosphere, and the climate of cool mountain air would help cure the disease of TB, also called the White Plague. Wolfe’s hometown of Asheville, North Carolina — which offered the best combination of altitude, atmosphere, and climate — had become a world center for the treatment of TB. Because of this, thousands of TB victims came to Asheville, including George Vanderbilt and E. W. Grove, who contributed to the building of the Biltmore House and the Grove Park Inn, respectively. At the end of the 19th century, it was reported that there were 25 TB specialists in Asheville; many came first as patients to be treated for TB. Between 1900 and 1930, over 25 TB sanitariums were established, but most patients stayed in boarding houses with lower rates of $5 to $15 per week. The houses, which had open air sleeping porches as a necessity, were operated solely for the care of TB patients. The number of boarding houses rose from 55 in 1900 to 137 in 1910. Thomas Wolfe’s mother, Julia, had a keen business sense and in 1906 purchased a 29-room boarding house in downtown Asheville called the Old Kentucky Home located near the family home. Young Tom eventually moved into the boarding house permanently for about 10 years. Thus, Tom was probably exposed to TB in his mother’s boarding house while growing up” (Robert E. Lathan). In conclusion, Thomas Clayton Wolfe was an amazing author as well as a very influential man. Though his death was saddening for the community, what he brought to the world was beautiful. He was very smart and extremely talented. Thomas Wolfe is known and loved; he inspired many young authors to create."}, {"url": "https://www.factmonster.com/encyclopedia/arts/bios/american-lit/wolfe-thomas-clayton", "page_content": "Esther Jack\n\n1900–1938, American novelist, b. Asheville, N.C., grad. Univ. of North Carolina, 1920, M.A. Harvard, 1922. An important 20th-century American novelist, Wolfe wrote four mammoth novels, which, while highly autobiographical, present a sweeping picture of American life. He was the son of William Oliver Wolfe, a stonecutter, and Julia Westall Wolfe, a boardinghouse keeper and speculator in real estate. Wolfe's early, insistent efforts to become a playwright met with frustration and failure. In 1924 he became an instructor at New York Univ., teaching there until 1930; thereafter he wrote mostly in New York City or abroad. During the late 1920s he was closely associated with Aline Bernstein (theof his novels), a noted theatrical designer, who was a major influence in his adult life.\n\nIn 1929, under the rigorous editorial guidance of Maxwell Perkins, he published his first novel, Look Homeward, Angel. After the appearance of its sequel, Of Time and the River (1935), he broke with Perkins and signed a contract with Harper & Brothers, with Edward Aswell as his editor. After Wolfe died at 38 from complications following pneumonia, Aswell arranged from the material left at Wolfe's death two novels—The Web and the Rock (1939) and You Can't Go Home Again (1940)—and a volume of stories and fragments, The Hills Beyond (1941). Wolfe's other publications include From Death to Morning (1935), a collection of short stories; and The Story of a Novel (1936), a record of how he wrote his second book.\n\nWolfe's works compose a picture, left somewhat incomplete by his premature death. They describe the life of a youth from the rural South through his education to his career in New York City as a teacher and writer. Wolfe's major theme was almost always himself—his own inner and outer existence—his gropings, his pain, his self-discovery, and his endless search for an enduring faith. He was obsessed by memory, time, and location, and his novels convey a brilliant sense of place. His writing is characterized by a lyrical and dramatic intensity, by the weaving and reweaving of a web of sensuous images, and by rhapsodic incantations.\n\nSee his letters, ed. by E. Nowell (1956); his letters to A. Bernstein, ed. by S. Stutman (1983); To Loot My Life Clean: The Thomas Wolfe–Maxwell Perkins Correspondence (2000), ed. by M. J. Bruccoli and P. Bucker; O Lost: A Story of the Buried Life (2000), a restored version of Look Homeward Angel, ed. by A. and M. J. Bruccoli; biographies by A. Turnbull (1967), N. F. Austin (1968), and D. H. Donald (1987); studies by R. S. Kennedy (1962), L. Field (1988), and J. L. Idol, Jr. (1987).\n\nThe Columbia Electronic Encyclopedia, 6th ed. Copyright © 2023, Columbia University Press. All rights reserved.\n\nSee more Encyclopedia articles on: American Literature: Biographies"}, {"url": "https://www.infoplease.com/encyclopedia/arts/bios/american-lit/wolfe-thomas-clayton", "page_content": "Esther Jack\n\n1900–1938, American novelist, b. Asheville, N.C., grad. Univ. of North Carolina, 1920, M.A. Harvard, 1922. An important 20th-century American novelist, Wolfe wrote four mammoth novels, which, while highly autobiographical, present a sweeping picture of American life. He was the son of William Oliver Wolfe, a stonecutter, and Julia Westall Wolfe, a boardinghouse keeper and speculator in real estate. Wolfe's early, insistent efforts to become a playwright met with frustration and failure. In 1924 he became an instructor at New York Univ., teaching there until 1930; thereafter he wrote mostly in New York City or abroad. During the late 1920s he was closely associated with Aline Bernstein (theof his novels), a noted theatrical designer, who was a major influence in his adult life.\n\nIn 1929, under the rigorous editorial guidance of Maxwell Perkins, he published his first novel, Look Homeward, Angel. After the appearance of its sequel, Of Time and the River (1935), he broke with Perkins and signed a contract with Harper & Brothers, with Edward Aswell as his editor. After Wolfe died at 38 from complications following pneumonia, Aswell arranged from the material left at Wolfe's death two novels—The Web and the Rock (1939) and You Can't Go Home Again (1940)—and a volume of stories and fragments, The Hills Beyond (1941). Wolfe's other publications include From Death to Morning (1935), a collection of short stories; and The Story of a Novel (1936), a record of how he wrote his second book.\n\nWolfe's works compose a picture, left somewhat incomplete by his premature death. They describe the life of a youth from the rural South through his education to his career in New York City as a teacher and writer. Wolfe's major theme was almost always himself—his own inner and outer existence—his gropings, his pain, his self-discovery, and his endless search for an enduring faith. He was obsessed by memory, time, and location, and his novels convey a brilliant sense of place. His writing is characterized by a lyrical and dramatic intensity, by the weaving and reweaving of a web of sensuous images, and by rhapsodic incantations.\n\nSee his letters, ed. by E. Nowell (1956); his letters to A. Bernstein, ed. by S. Stutman (1983); To Loot My Life Clean: The Thomas Wolfe–Maxwell Perkins Correspondence (2000), ed. by M. J. Bruccoli and P. Bucker; O Lost: A Story of the Buried Life (2000), a restored version of Look Homeward Angel, ed. by A. and M. J. Bruccoli; biographies by A. Turnbull (1967), N. F. Austin (1968), and D. H. Donald (1987); studies by R. S. Kennedy (1962), L. Field (1988), and J. L. Idol, Jr. (1987).\n\nThe Columbia Electronic Encyclopedia, 6th ed. Copyright © 2023, Columbia University Press. All rights reserved.\n\nSee more Encyclopedia articles on: American Literature: Biographies"}]}