{"The Victoria Cross awarded to John Russell is displayed at the National Army Museum, Chelsea, London.": [{"url": "https://www.nam.ac.uk/explore/victoria-cross", "page_content": "Open to all\n\nThe VC is Britain's joint-highest award for gallantry. It was only equalled in status in 1940, when the George Cross (GC) was instituted for acts of conspicuous bravery not in the enemy's presence.\n\nThere is no barrier of colour, creed, sex or rank. Indeed, VC recipients have come from all social backgrounds and from all over the British Empire and Commonwealth.\n\nSince its inception in 1856, there have been 1,358 VCs awarded. This total includes three bars granted to soldiers who won a second VC and the cross awarded to the Unknown American soldier. During the First World War (1914-18), 626 VCs were awarded and in the Second World War (1939-45) 181.\n\nThe most recent was awarded to Lance Corporal Joshua Leakey of 1st Battalion The Parachute Regiment, whose VC was gazetted in February 2015, following an action in Afghanistan on 22 August 2013."}, {"url": "https://www.nam.ac.uk/subjects/medals", "page_content": "Sign up to the National Army Museum newsletter\n\nBe the first to hear about our latest events, exhibitions and offers. Simply enter your email address below to start receiving our monthly email newsletter.\n\nTo find out more about how we collect, store and use your personal information, read our Privacy Policy."}, {"url": "https://www.nam.ac.uk/explore/thames-vc-mystery", "page_content": "Later life\n\nAfter the Crimean War, both Byrne and McDermond continued to serve with the Army.\n\nByrne was awarded the Distinguished Conduct Medal in 1864 at the Battle of Te Ranga, during the Second Taranaki War (1863-66) in New Zealand. He was eventually discharged with the rank of sergeant in 1872. He then briefly served with the 2nd North Durham Militia, but was discharged for improper conduct.\n\nMcDermond was invalided out of the Army due to injury in 1864, and registered as a Chelsea Out Pensioner.\n\nBoth men seem to have suffered a significant decline in fortunes and health after their service. Little is known of McDermond after he left the Army. All that can be said for certain is that he died from typhus in 1866 and was buried in Glasgow.\n\nByrne had a rather more dramatic end, having suffered with mental health issues after his service. Reports from 1879 suggest that he was working for the Ordnance Survey in Newport, when he got into an argument with a fellow workman. Believing his colleague had insulted his VC, Byrne shot him and later killed himself at his lodgings. He was buried in Newport."}, {"url": "https://www.nationalarchives.gov.uk/help-with-your-research/research-guides/british-army-medal-index-cards-1914-1920/", "page_content": "Visit us in Kew to see original documents or view online records for free\n\nWe do not provide copies of online records – please download to view\n\nWhat are these records?\n\nThese records are index cards created by the Army Medal Office towards the end of the First World War. They record the medals that men and women who served in the First World War were entitled to claim.\n\nThere are over 5 million cards, held in series WO 372. Most of the cards are for soldiers in the British Army. The collection also includes:\n\nsome British Army officers (officers had to apply for their campaign medals and may not have)\n\nIndian Army personnel\n\nBritish Army nurses\n\nRoyal Flying Corps personnel\n\nRoyal Naval Division personnel\n\nsome civilians\n\nMost of the cards contain information about campaign medals, which were generally awarded to all those who served overseas. However, some of the cards record entitlement to gallantry and long service awards.\n\nIt is Ministry of Defence policy to not issue medal replacements for service before 1920, irrespective of entitlement. You may be able to obtain duplicate medals from a coin or medal dealer. Alternatively, replica medals can be purchased from The National Archives bookshop.\n\nHow do I search the records?\n\nYou can search for an individual medal index card using the form below. You do not need to fill out every field to search these records; using only the last name and regiment number often works. Your search results will be displayed in Discovery, our catalogue. From search results you can select an individual record (by clicking on the title) and download it (£).\n\nDetails of individual: First name Last name Regimental number Corps Rank/unit\n\nYour download will actually contain the images of six medal cards (with the exception of the Indian Army medal cards, which download individually), usually for six different individuals with similar or even identical names. Given this, if you are looking for the medal cards of two different people with the same surname it may only be necessary to download one image. In your search results, look for the Reference code. If the reference is the same for two separate individuals, you will only need to download one image for both cards.\n\nPlease note you can also search for, download and view these records on Ancestry.co.uk (£) and Findmypast.co.uk (£).\n\nWhat information do the records contain?\n\nIt’s important to note that the cards do not contain much personal information. You may be able to find out more from the person’s service record, if it survives.\n\nCampaign medal index cards\n\nFor each person the cards record:\n\nname\n\nrank(s)\n\nunit(s)\n\nregimental number\n\nmedal entitlement\n\noften a roll reference that refers to a medal roll entry in series WO 329 which may reveal the specific battalion, brigade or battery in which the individual served\n\noften the first theatre of war in which they served and when they entered that theatre (if this part of the card is blank it usually means that the individual went to France in 1916 or later)\n\nThe card may mention the theatre of war entered, such as (1) France, but occasionally they only give the code number, or nothing if the date of entry is after 1916.\n\nWestern Europe Balkans Egyptian African Asiatic Australasian\n\nA complete list of the codes used on the medal index cards can be found on the LongLongTrail\n\nWhere additional remarks are recorded on a card, you may find information on:\n\ndate of death\n\ndate of discharge\n\nother remarks concerning the career or fate of the person\n\nThe original medal issue and medal receipt may also be noted. However, most of the cards record medal entitlement rather than the awarding of medals. If you want to check whether a person received a medal, you can consult the medal rolls (WO 329) which should be annotated with pencil ticks. These campaign medal rolls are available online via Ancestry £.\n\nOccasionally, the medal card will confirm that the individual did not receive any medals, including many soldiers who went to France after 11 November 1918. They thought they were entitled and applied, but had their application refused.\n\nOthers failed to meet the required criteria for certain awards, had not served abroad, or forfeited their campaign medals due to a disciplinary infringement.\n\n1914 Star\n\nThe 1914 Star was instituted in 1917 for service ashore in France and Flanders between 5 August and 22 November 1914. In 1919 a clasp bearing the above dates was authorised and given to personnel who had actually been under fire between the prescribed dates.\n\n1914/15 Star\n\nAuthorised in 1918, the 1914/15 Star was awarded to personnel who saw service in France and Flanders from 23 November 1914 to 31 December 1915, and to personnel who saw service in any other operational theatre from 5 August 1914 to 31 December 1915.\n\nBritish War Medal\n\nThe British War Medal 1914-1920, authorised in 1919, was awarded to eligible service personnel and civilians. Qualifications for the award varied slightly according to service. The basic requirement for army personnel and civilians was that they either entered a theatre of war, or rendered approved service overseas between 5 August 1914 and 11 November 1918. Service in Russia in 1919 and 1920 also qualified for the award.\n\nVictory Medal\n\nThe Victory Medal 1914-1919 was also authorised in 1919 and was awarded to all eligible personnel who served on the establishment of a unit in an operational theatre.\n\nTerritorial Force Medal\n\nThe Territorial Force War Medal 1914-1919 was awarded to members of the Territorial Force only. To qualify, the recipient had to have been a member of the Territorial Force on or prior to 30 September 1914, and to have served in an operational theatre outside of the United Kingdom between 5 August 1914 and 11 November 1918.\n\nSilver War Badge\n\nThe Silver War Badge, sometimes erroneously called the Silver Wound Badge, was authorised in September 1916 and takes the form of a circular badge with the legend ‘For King and Empire-Services Rendered’ surrounding the George V cypher. The badge was awarded to all of those military personnel who were discharged as a result of sickness or wounds contracted or received during the war, either at home or overseas.\n\nGallantry award medal index cards\n\nThe gallantry award medal index cards are all in WO 372/23 or WO 372/24. They cover awards granted between about 1909 and 1931.\n\nEach card provides:\n\nfirst initial and surname (the full first name is usually not given)\n\nrank(s)\n\nunit(s)\n\nregimental number\n\nmedal entitlement\n\ndate and page number of the London Gazette where the award was announced – search for this on The Gazette website\n\nArmy Order number – Army Orders are preserved at The National Archives in the series WO 123\n\nMost of the DCM, MM and MSM card indexes note in which operational theatre the award was won.\n\nThe card will not give the reasons for the award, but you might find a citation in the Gazette.\n\nSome of the award dates are given as a numerical code – use the table below to interpret the codes.\n\nGazettes codes table\n\nGazette code number Date(s) 59 11 February or 13 March 1919 60 18 or 24 or 30 January or 22 February 1919 61 29 March 1919 62 14 May 1919 63 17 June 1919 64 3 July 1919 65 23 July 1919 66 20 August 1919 67 20 August 1919 68 22 September 1919 69 16 October 1919 Peace Gazette 3 June 1919 Prisoner of War 30 January or 19 June 1920\n\nTypes of gallantry award\n\nThere were various gallantry awards, with different qualifications for each type:\n\nDistinguished Conduct Medal\n\nThe Distinguished Conduct Medal (DCM), second only to the Victoria Cross, was awarded to all other ranks for exceptional bravery.\n\nMilitary Medal\n\nThe Military Medal (MM) was awarded to warrant officers, non-commissioned officers and other ranks for gallantry in action against the enemy. It ranked below the Distinguished Conduct Medal.\n\nMeritorious Service Medal\n\nThe Meritorious Service Medal (MSM) could be awarded for services in connection with the war or for gallantry but not in face of the enemy.\n\nMention in Despatches\n\nCommanders-in-Chief in the field submitted periodical lists of officers and soldiers who were ‘mentioned in despatches’. Award of a Mention ranked below MC or MM and could be for gallantry in action or for a wide range of services on and off the battlefield.\n\nTypes of long service medals\n\nThe Territorial Force Efficiency Medal (TFEM)\n\nThe Territorial Force Efficiency Medal (TFEM) was instituted in 1908 as a long service award for other ranks in the Territorial Force. Qualification for the award was 12 years’ service, with war service counting double.\n\nTerritorial Efficiency Medal (TEM)\n\nThe TFEM was renamed the Territorial Efficiency Medal in 1921 when the TF became the Territorial Army. The name and design of the award was changed again in 1930, becoming the Efficiency Medal (Territorial), sometimes noted as EM(T).\n\nWhat do the records look like? The medal index cards are displayed in sets of six (with the exception of the Indian Army medal cards, which download individually), usually for six different individuals with similar or even identical names. Several different designs of medal cards were used but the most common type was the following: Design 1 The left hand side of the card contains a printed list of the campaign medals. A note in the ‘roll’ and ‘page’ column meant the soldier was awarded that medal. You may also see ‘do’, which meant ‘ditto’.\n\nDesign 2\n\nThe essential difference with this design is that the medal entitlement is at the top right hand corner and the entire lower half of the card is left free for any remarks.\n\nDesign 3: the Silver War Badge\n\nThis type of card was used for individuals who received the Silver War Badge only. The card contains information about an individual and often gives the date of enlistment, date of discharge and reason for discharge.\n\nAbbreviations\n\nMedal cards often contain abbreviations and alphanumeric codes and we have listed some common ones below. The codes for those who saw their first operational service from 1 January 1916 onwards differ slightly from those who saw operational service before 1916.\n\nFor a more detailed list of abbreviations for rank and unit, you might find it useful to refer to the PDFs below or alternatively The Collector and Researcher’s Guide to the Great War by Howard Williamson.\n\nAbbreviations table\n\nUp to 31 December 1915 From 1 January 1916 1 1 Western Europe a France and Belgium b Italy 2 2 Balkans a Greek Macedonia, Serbia, Bulgaria and European Turkey b Gallipoli (Dardanelles) 3 Russia (4-5 August 1914 to 1-2 July 1920) 3 4 Egypt a 4-5 November 1914 to 18-19 March 1916 b 18-19 March 1916 to 31 October – 1 November 1918 4 5 Africa a East Africa, Nyasaland and Northern Rhodesia b South West Africa c Cameroon d Nigeria e Togoland 5 6 Asia a Hedjaz b Mesopotamia c Persia d Trans Caspia e South West Arabia f Aden g Frontier regions of India h Tsingtau 6 7 Australasia a New Britain b New Ireland c Kaiser Wilhelmland d Admiralty Islands e Nauru f German Samoa\n\nOther abbreviations table\n\nAbbreviation Meaning ARZ Class Z Army Reserve. In December 1918 soldiers being demobilised were first posted to Class Z. They could return to civilian life but knew they were obliged to return if necessary. The Z Reserve was abolished on 31 March 1920 Cl An individual had been sent a dated clasp. This clasp would go on the ribbon of the 1914 Star, or a silver rosette would go on the ribbon when only medal ribbons were being worn Comm Commissioned EMB or Emblems An individual had been ‘Mentioned in Despatches’ (MID) and at least two ‘oak leaf’ MID emblems had been sent to the recipient KiA or Killed If a soldier died in action, it is often marked on the card. Sometimes it will just say ‘Dead’ but occasionally it will not be noted at all KR 392 King’s Regulation 392 which covered causes of early discharge whether through ill health, misconduct or other reasons Rep Replaced. This is an unusual comment implying that the index card was replaced at some point Retd or Rtd (sometimes ‘Retd undisposed of’) Returned. If there was an error in the inscription, the medals would have to be returned to the Medals Office. Another reason for return was if the individual had moved house and the parcel was not deliverable TE or T/E or T of E Time Expired. This is when the soldier had reached the end of his agreed period of military service. It applies only to pre-war soldiers of the regular army or Territorial Force. These men were allowed to go home but from 1916 many TE men returned to active service as conscripted soldiers.\n\nRank abbreviations used in the medal index cards (PDF, 0.62MB)\n\nUnit abbreviations used in the medal index cards (PDF, 1.06MB)\n\nWhy can’t I find what I’m looking for?\n\nOccasionally there is no regimental number recorded on the card, which may be the case if the person was an officer. In this case try searching by name and regiment only.\n\nIf members of the Royal Flying Corps did not see service overseas until 1916 or later, you will not find a medal card here. The Air Ministry maintained these medal records and they have not been transferred to The National Archives.\n\nYou may need to change the spelling of the words you are searching with; this is most commonly the case when searching for a sergeant, which was more commonly spelt as ‘serjeant’ at the time the cards were produced.\n\nOfficers had to apply for their campaign medal, so if they did not apply, there will not be a medal card."}, {"url": "https://www.guidelondon.org.uk/blog/the-victoria-cross-and-the-george-cross/", "page_content": "The Victoria Cross and the George Cross are the highest medals awarded in the United Kingdom to military personnel and civilians for acts of bravery in wartime or peacetime. Many of them are displayed at the Imperial War Museum in Lambeth, South London. Below are 10 facts about the Victoria Cross and the George Cross.\n\nThe Victoria Cross\n\n1. The Victoria Cross was created on 29 January 1856. It recognises acts of bravery carried out under enemy fire. It is often referred to by its initials ‘VC’.\n\n2. 1,354 people have been awarded the Victoria Cross since its inception.\n\n3. The Cross is hand-made, traditionally using bronze taken from a gun captured in the Crimean War. It was deliberately intended to have little monetary value.\n\n4. The inscription on the Victoria Cross is ‘For Valour’. Queen Victoria turned down the first suggestion, ‘For the Brave’, explaining that all her soldiers were brave.\n\n5. An act that leads to someone being awarded the Victoria Cross has to be seen by several witnesses. The award is then sent for approval by the monarch.\n\n6. The two youngest recipients of the Victoria Cross were Thomas Flinn in 1857 and Andrew Fitzgibbon in 1860. Both were fifteen years and three months old. The oldest recipient of the VC was sixty-nine-year-old William Raynor who defended an ammunition store in Delhi for five hours in 1857.\n\n7. Three fathers and sons have earned the VC, including Charles Gough in 1857 and his son John Gough in 1903. Four pairs of brothers have also earned VCs, including Major Charles Gough and Lieutenant Hugh Gough in 1858. One set of brothers has each received both a Victoria Cross and a George Cross: Captain Derek Seagrim was awarded the VC in 1943 and Major Hugh Seagrim was given a George Cross in 1944.\n\n8. Only three people have received the Victoria Cross twice: Surgeon Captain Arthur Martin-Leake in 1902 and 1914, Captain Noel Chavasse in 1916 and 1917, and Captain Charles Upham in 1941 and 1942. The medals of Charles Upham form part of the Imperial War Museum collection but are on long-term display in New Zealand.\n\n9. Since 1902, when it was first awarded posthumously, the Victoria Cross has been awarded to 295 people who died while performing acts of bravery.\n\n10. The Victoria Cross has been awarded to three soldiers for bravery in Afghanistan: posthumously to Corporal Bryan Budd of the Parachute Regiment, also to Corporal Willia Apiata of the New Zealand SAS, and Trooper Mark Donaldson of the Australian SAS.\n\nThe George Cross\n\n1. The George Cross was created on 24 September 1940. It recognises acts of extreme bravery carried out in peacetime when facing the perils of ordinary life and in wartime away from the heat of battle.\n\n2. The George Cross is made from silver by the Royal Mint. The inscription on the George Cross is ‘For Gallantry’. The words surround an image of St George slaying the dragon. Many details on the George Cross were personally designed by King George VI, after whom it was named.\n\n3. 406 people have received George Crosses (86 posthumously). Collective medals were awarded to Malta and to the Royal Ulster Constabulary.\n\n4. 143 George Crosses have been awarded to civilians (excluding police officers). This represents 35% of all the George Crosses awarded.\n\n5. There are fourteen living George Cross holders, with seven residing overseas.\n\n6. The youngest recipient of the George Cross was fifteen-year-old John Bamford who rescued his brothers from a house fire in 1952. The oldest was John Axon, a British Rail engine driver aged fifty-seven who died trying to stop a runaway train in 1957.\n\n7. The Albert Medal was created in 1866 and named after Queen Victoria’s husband, Prince Albert, it was awarded for great bravery while saving someone else’s life either at sea or on land. 570 Albert Medals had been awarded by 1971 when it was decided to change (or ‘translate’) them into George Crosses.\n\n8. The Edward Medal was created in 1907 and named after King Edward VII, it was awarded to people who risked their lives to help or save others caught in industrial accidents, particularly in coal mines. 584 Edward Medals had been awarded by 1971 when they were translated into George Crosses.\n\n9. Eleven women have received the George Cross. The most recent was Barbara Harrison, an air stewardess who died rescuing people after an air crash at Heathrow in 1968.\n\n10. The George Cross has been awarded to four soldiers for bravery in Afghanistan: posthumously to Corporal Mark Wright of the Parachute Regiment and to Sergeant Olaf Schmid, Logistic Corps. It was also given to Lance Corporal Matthew Croucher of the Royal Marines and Staff Sergeant Kim Hughes of the Royal Logistic Corps."}, {"url": "https://www.nam.ac.uk/explore/malcolmson-vc", "page_content": "Battle of Khoosh-ab\n\nMalcolmson was involved in the capture of the Persian port of Reshire in December 1856. But it was at Khoosh-ab, the largest battle of the war, that he demonstrated the greatest bravery.\n\nOn 8 February 1857, the 3rd Bombay Light Cavalry was faced by a square of well-trained infantry. The cavalry charged, led by Lieutenant Moore who spurred on his horse to crash through the Persian bayonets. The infantry square was broken - an impressive and rare feat in itself - but Moore was thrown from his horse and surrounded by the enemy.\n\nLieutenant Malcolmson gallantly fought his way to his fallen comrade, offered Moore his stirrup, and carried him away to safety.\n\nFor his cool determination and instinctive actions, Malcolmson was awarded the VC. He was presented with his cross by Queen Victoria on 9 November 1860 at Home Park, Windsor Castle. His was one of only three VCs awarded during the Persian War."}, {"url": "https://www.armymuseum.co.nz/visit/exhibitions/orders-decorations-and-medals/", "page_content": "Medal Repository\n\nThe museum provides a medal repository for all medals awarded to servicemen and women within the New Zealand military as well as some overseas military memorabilia. The museum’s primary focus is medals, honours and awards associated with the New Zealand Army, but it also includes medals and medal groups from other forces.\n\nOn display within the museum is a collection of over 10,000 individual medals, the majority donated from the descendants of the original recipients. As well as the high gallantry awards like the New Zealand Cross, the Victoria Cross, the Albert Medal and the more-recent George Cross, the museum is home to specimen, foreign and miniature medals, plus assorted military badges and awards.\n\nThe medals held are categorised into various temporary and permanent displays including but not limited to:\n\nNew Zealand Gallantry and Bravery awards\n\nBritish Campaign and General Service medals\n\nCampaign and General Service medals awarded to New Zealanders\n\nUnited Nations and Commemorative medals\n\nForeign medals (a selection only)\n\nMeritorious Service, Long Service, Efficient Service orders, decorations and medals\n\nThe medals are stored and displayed in a vault-like medal repository that enables visitors and families of soldiers to look up and view the medals up-close.\n\nFor more information about medals and medal ribbons, wearing medals, medal posters and the medals awarded to New Zealand military personnel since the New Zealand Wars of the 1840s and 1860s, please visit the New Zealand Defence Force Medals page.\n\nAs a Registered Charitable Trust, the National Army Museum Te Mata Toa acknowledges its responsibilities as holders, trustees and kaitiaki/guardians of these unique medal collections on behalf of the people of New Zealand. We depend on the generosity of the public to continue to preserve and develop this nationally significant collection. For information, medal donations, or to show your support for the New Zealand National Army Museum Te Mata Toa please contact us.\n\nOther Resources\n\nVictoria Cross (VC): The VC is the British Commonwealth’s highest award for bravery in the face of the enemy and is made of bronze from the poorest-quality gunmetal. It is cast in sand, hand-chiselled and engraved. Each medal is unique in some respect, making no two alike. It is perhaps fitting then that this award be hung from a plain crimson ribbon commemorating a unique act of heroism.\n\nNew Zealand Cross (NZC): The NZC was an award for outstanding acts of gallantry by New Zealand volunteers. The award had become necessary as it was almost impossible for locally raised troops to be awarded the Empire’s highest award for gallantry, the Victoria Cross. 23 awards of the New Zealand Cross had been made, before the entitlement to the Victoria Cross was changed and New Zealanders became eligible for that award, making it one of the rarest gallantry decorations in the world.\n\nAlbert Medal (AM) and George Cross (GC): The AM was to be awarded for daring and heroic actions in saving life at sea. In 1877 it was further expanded to include actions on land. The Medal was then discontinued in 1971. At this time, all living recipients were to exchange their awards for the George Cross, which was now deemed, would supersede the Albert Medal. Randolph Ridling requested that he be permitted to retain his medal as it had great sentimental value and the Queen approved his request. His medal is displayed in this alcove. The GC was an award for civilians “only for acts of the greatest heroism or the most conspicuous courage in circumstances of extreme danger”. Further, the standard for the award was as high as – and its status equal to – the Victoria Cross. It was also to be awarded to members of the services whose acts of gallantry were not in the face of the enemy.\n\nExplore our New Zealand war displays from past and present at the National Army Museum, Waiouru."}, {"url": "https://collection.nam.ac.uk/detail.php?acc=1960-07-4-1", "page_content": "Victoria Cross awarded to Sergeant J Danagher (or Danaher), 2nd Battalion, The Connaught Rangers (formerly Trooper, Nourse's Horse), 1881\n\nOn 16 January 1881 during the Transvaal War (1880-1881), at Elandsfontein, near Pretoria, Trooper Danagher of Nourse's Horse and Lance Corporal Murray of the Connaught Rangers, advanced for 500 yards under fire to rescue two men, Davis and Byrne of the 21st Foot (2nd Royal Scots Fusiliers), who had both been badly wounded. The two rescuers reached the men together and on stooping to lift Byrne's head, Murray was shot through the body. Realising the seriousness of his wound, Murray ordered Danagher to escape. Lance Corporal Murray remained with Byrne, who died shortly afterwards. Murray and Davis were subsequently taken prisoner by the Boers but released soon after. Murray also received the Victoria Cross for his part in the action.\n\nSergeant Danagher was also awarded a Long Service and Good Conduct Medal (also displayed here). He was born on 25 June 1860 in Limerick, Ireland. He joined the Connaught Rangers in 1881. At the end of his military career he was discharged on pension and died in Ireland on 9 January 1919."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/victoria-cross", "page_content": "The Victoria Cross, instituted 1856 by Queen Victoria, is the Commonwealth's premier military decoration for gallantry. It is awarded in recognition of the most exceptional bravery displayed in the presence of the enemy. Private Michael J. O`Rourke,7th Canadian Infantry Battalion, was awarded the Victoria Cross while serving as a stretcher-bearer during the fighting for Hill 70 in 1917. He had been already received the Military Medal for heroism during the Battle of the Somme in 1916. Here he is wearing the ribbons for both medals. Born in Horton Bluff, NS, Hall won the Victoria Cross Major David Currie (second from right, pistol in hand) oversees the surrender of German soldiers in Saint Lambert-sur-Dives, 19 August 1944. Currie was awarded the Victoria Cross for his actions that day. The awarding of the original Victoria Cross was suspended in Canada in 1972, but on 2 February 1993 Queen Elizabeth II approved the creation of a Canadian VC. In design it resembles the original except for the Latin inscription. PreviousNext\n\nThe first recipients of the Victoria Cross (VC) saw action in the Crimean War. Among them was a Canadian lieutenant, Alexander Roberts Dunn, who was awarded the VC for heroism during the charge of the Light Brigade at the Battle of Balaclava. Another early recipient was William Hall, who in 1859 became the first Black and the first Canadian naval recipient of the Victoria Cross.\n\nOver the years, there have been 99 Canadian recipients (living and posthumous) of the Victoria Cross. This includes Canadians who were attached to the forces of other Commonwealth countries and some non-Canadians serving in Canadian units. The decoration is in the form of a bronze cross patée bearing the royal crest and the words \"For Valour.\" The ribbon is dark crimson.\n\nThe awarding of the medal was dropped in 1972 when the Canadian Decorations for Bravery were created (Cross of Valour, Star of Courage, Medal of Bravery). However, in April 1987, Brian Mulroney's Conservative government asked the deputy director of the Chancellory of Canadian Orders and Decorations to consider its reinstatement.\n\nIn 1993, Queen Elizabeth II approved the creation of a Canadian VC. The award has the same criteria as the original British decoration. The Canadian VC resembles the original VC except that the Latin inscription Pro Valore replaces the equivalent English inscription \"For Valour.\" No Canadian VCs have yet been awarded.\n\nSee also Honours.\n\nCanadian Victoria Cross Recipients"}, {"url": "https://www.awm.gov.au/articles/encyclopedia/vic_cross", "page_content": "The Victoria Cross is the highest award for acts of bravery in wartime. It was instituted in 1856 by Queen Victoria and made retrospective to 1854 to cover the period of the Crimean War. It is possible for any serving member of the armed forces to obtain this award.\n\nThe Victoria Cross was designed, according to the original warrant for the award, to be in the form of the “Maltese Cross”. Its shape, however, more closely resembles a cross pattée. In the centre of the medal is a lion guardant standing upon the Royal Crown. The words \"For valour\" are inscribed below. The Victoria Cross is suspended from a crimson ribbon. On the reverse of the cross the date of the act of bravery is inscribed, along with the name, rank, and unit of the recipient.\n\nThe Hall of Valour at the Australian War Memorial honours the one hundred and one Australians who have received the Victoria Cross and the nine Australian Defence personnel who have directly received the George Cross.\n\nA comprehensive list of Victoria Cross Recipients is available on the Anzac Portal of the Department of Veterans’ Affairs.\n\nVictoria Crosses held at the Memorial"}]}