{"John Russell served in the 2nd Battalion, The Rifle Brigade (Prince Consort's Own), British Army.": [{"url": "https://www.nam.ac.uk/explore/rifle-brigade-prince-consorts-own", "page_content": "Origins\n\nIn January 1800, the British Army formed a corps of 40 officers and men to experiment with the use of the newly developed Baker rifle.\n\nAlthough slower to load than the musket (the standard British infantry weapon of the time), the Baker rifle offered much greater accuracy and range. It was also shorter than the musket, but had a similar overall reach when fixed with its longer sword bayonet.\n\nThe new corps was made up of volunteers from existing line infantry regiments and was led by Coote Manningham and William Stewart. An early adopter of camouflage, its troops wore green jackets instead of redcoats. They were also taught to operate in pairs on their own initiative rather than in line formation under strict orders."}, {"url": "https://discovery.nationalarchives.gov.uk/details/c/F128721", "page_content": "This website uses cookies\n\nWe place some essential cookies on your device to make this website work.\n\n\n\nWe'd like to use additional cookies to remember your settings and understand how you use our services.\n\n\n\nThis information will help us make improvements to the website."}, {"url": "https://infogalactic.com/info/Rifle_Brigade_(Prince_Consort%27s_Own)", "page_content": "From Infogalactic: the planetary knowledge core\n\n\"95th Rifles\" redirects here. For the Soviet division, see 95th Rifle Division\n\nRifle Brigade (Prince Consort's Own) File:Rifle Brigade Cap Badge.jpg Cap badge of the Rifle Brigade Active 1802–1816 as 95th Rifle Regiment, 1816–1966 as Rifle Brigade Country United Kingdom Branch British Army Type Infantry Role Light infantry Size 4 Battalions in Peacetime (28 during the Great War) Garrison/HQ Peninsula Barracks, Winchester Nickname(s) The Rifles\n\nThe Grasshoppers\n\nThe Sweeps March I'm Ninety-Five Insignia Identification\n\nsymbol In 1958 the Rifle Brigade was absorbed into the Green Jackets Brigade as 3rd Green Jackets, the Rifle Brigade. Though the brigade wore a Green Jackets shoulder flash each individual unit wore its own epaulette badge, the Rifle Brigade wore a black RB, the 2nd wore KRRC, and the 1st wore 43/52. Each regiment kept its own coloured NCO's stripes and marksmanship badges. The rifle regiments serving under Wellington who were attached to the Prince of Orange's staff wore an orange ribbon on their shakos so they wouldn't be shot at from the Prince of Orange's men on the day.\n\nThe Rifle Brigade (Prince Consort's Own) was an infantry rifle regiment of the British Army. Formed in January 1800 as the \"Experimental Corps of Riflemen\" to provide sharpshooters, scouts and skirmishers, they were soon renamed the \"Rifle Corps\". In January 1803 they became an established regular regiment and were titled the 95th Regiment of Foot (Rifles). In 1816, at the end of the Napoleonic Wars, they were again renamed, this time as the \"Rifle Brigade\".\n\nThe unit was distinguished by its use of green uniforms as standard in place of the traditional redcoat, as well as being armed with the first British-made rifle accepted by the British Army, in place of smooth-bore muskets — the first regular infantry corps in the British Army to be so.\n\nAfter distinguished service in both World War I and World War II, the regiment was amalgamated with the Oxfordshire and Buckinghamshire Light Infantry and the King's Royal Rifle Corps to form the Royal Green Jackets on 1 January 1966. The Royal Green Jackets was further amalgamated, in 2007, with the Devonshire and Dorset Regiment, the Royal Gloucestershire, Berkshire and Wiltshire Regiment and The Light Infantry to form the present large regiment, known as The Rifles.\n\nFormation\n\nIn 1800, an \"Experimental Corps of Riflemen\", was raised by Colonel Coote Manningham and Lieutenant-Colonel the Hon. William Stewart, drawn from officers and other ranks from drafts of a variety of British regiments. The Corps differed in several regards from the Line infantry of the British Army. Most significantly, the Rifles were armed with the formidable Baker rifle, which was more accurate and of longer range than the musket, although it took longer to load. As the rifle was shorter than the musket, it was issued with a 21-inch sword bayonet.\n\nRiflemen wore dark green jackets rather than the bright red coats of the British line infantry regiments of that time; close-fitting pantaloons, rather than breeches; black facings and black belts rather than white; a green plume on their \"stovepipe shakoes\" which the light infantry also wore, as well as other accoutrements unique to Rifles regiments.\n\n95th Rifles reenactors firing whilst kneeling and in the Plunkett position\n\nTraining and tactics\n\nThe riflemen were trained to work in open order and to be able to think for themselves. They were to operate in pairs ahead of the main infantry, which were bunched in close formations. They were taught to make best use of natural cover and to harass the enemy with aimed shots. These tactics, which had originated in campaigns in North America, were unorthodox for the time. It was generally considered impractical for individual soldiers to aim at specific targets [1] and conventional tactics favoured the mass volley from a close formation and the bayonet.\n\nThe treatment of soldiers in the new Rifle Corps was markedly different from that which prevailed in the line infantry. Although flogging existed as a means of enforcing military discipline, it was seldom used. The unit held regular shooting and sporting competitions, and men were rewarded for their achievements. Officers would regularly dine with their men and so became familiar with each man in their respective companies, an unusual practice at the time.\n\n<templatestyles src=\"Template:Quote_box/styles.css\" />\n\nthe black and the green,\n\nthe finest colours ever seen. A play on the word colours. [2]\n\nTo aid speed and mobility, the Rifles used bugles to transmit commands rather than the drums used by Line infantry and for the same reason did not carry Colours.\n\nBaker rifle\n\nThe new regiment was armed with the Baker rifle which, though it generally took twice as long to load due to the rifled barrel and required a separate calibre of ball (leading to supply problems), was considerably more accurate and effective at a longer range than the standard issue Brown Bess musket of the line regiments and regular light infantry companies.\n\nThis rifle was an accurate weapon for its day, with reported kills being taken at 100 to 300 yards (91 to 274 m) away. During the Peninsular War, Rifleman Thomas Plunket of the 1st Battalion, 95th Rifles, shot the French General Auguste-Marie-François Colbert at a range that may have been even greater.[5] He then shot a second French officer who rode to the general's aid, proving that this was not just a lucky shot. By comparison, a standard issue Brown Bess musket was unlikely to hit a man-sized target at ranges beyond 80 yards (73 m).\n\nMilitary operations\n\nAs the Rifle Corps\n\nFour months after its formation, the Rifle Corps was judged ready for its first operation. On 25 August 1800, three companies, under the command of Lieutenant-Colonel William Stewart, spearheaded a British amphibious landing at Ferrol, Spain, where the Rifles helped to dislodge the Spanish defenders on the heights. Despite the Rifles acting in a valiant manner, the expedition was defeated and withdrew on 26 August. In 1801, one company of the Experimental Corps of Riflemen, under the command of Captain Sidney Beckwith, took part in the British victory at the Battle of Copenhagen, as marksmen aboard Royal Navy ships that were under the command of the legendary Vice-Admiral Horatio Nelson. In 1847 the Admiralty awarded the Naval General Service Medal with clasp \"Copenhagen 1801\" to all surviving claimants from the action; two members of the Rifle Corps were among the claimants. During the battle, the Rifle Corps suffered one lieutenant killed, its first officer to fall, and two other ranks killed and six wounded, some of whom died later.\n\nAs the 95th Regiment\n\nIn 1802, the Rifle Corps was brought into the line of the British Army as the 95th Regiment of Foot, the 95th Rifles. In 1803, the 95th moved to Shorncliffe Army Camp, Kent, where it underwent light infantry training, along with the 43rd and 52nd Regiments of Foot, under the tutelage of Colonel Coote-Manningham and Sir John Moore; the latter, like the 95th, would gain fame during the Peninsular War. In 1805, a 2nd Battalion was raised at Canterbury, Kent, and later in the year the 1st/95th deployed to Germany as part of a British expedition, under the command of Lord Cathcart, designed to liberate Hanover from occupation by France. The 95th subsequently formed the advance guard on the way to Bremen. In February 1806, the 95th formed the rearguard for the withdrawal to Cuxhaven and subsequently returned home to the UK.\n\nFile:UK-Nap-95th.jpg A depiction of a Rifleman of the 95th, 1815\n\nSouth American expedition\n\nIn October 1806, five companies of the 1st/95th and three companies of the 2nd/95th departed for Spanish-controlled South America, Spain then being allied with France. It was part of a second invasion force that was designed as reinforcements for the first invasion against Buenos Aires, launched earlier in 1806 by Sir Home Popham without the Government's knowledge. The first invasion had already failed, although Brigadier-General Sir Samuel Auchmuty, commander of the second invasion force, was unaware of this failure.\n\nThe 2nd/95th, as part of Auchmuty's force, took part in the siege and subsequent storming of Montevideo, in what is now Uruguay, and which saw Montevideo captured on the 3 February 1807, after clearing the surrounding area of Spanish troops in January. The 95th subsequently saw action at Colonia against a Spanish force that had crossed from Buenos Aires; the Rifles held off the force until it could be repulsed, with the 95th gaining much praise from Auchmuty for their part in the defeat of the Spanish force. The 95th subsequently saw action in June at San Pedro where they, the 40th and light companies, fought against the Spanish force that had crossed from Buenos Aires and defeated them.\n\nLieutenant-General John Whitelocke, the newly arrived overall commander, subsequently launched an ill-advised and mismanaged assault on Buenos Aires in which the companies of both battalions of the 95th were involved as part of the Light Brigade, commanded by Robert Craufurd. During the assault on Buenos Aires on 5 July, the 95th and the rest of the British force suffered heavy casualties in bitter fighting to capture the city. The Light Brigade had suffered so heavily that they had to take refuge in a church and were surrendered soon after. Whitelocke eventually surrendered his force. After Whitelocke negotiated the withdrawal of British forces, the men were released and they returned home later that year. The 95th would go on to fight for near the entirety of the Peninsular War in Spain. In the aftermath of the disastrous expedition, Popham and Whitelocke were court-martialed, with Popham reprimanded and Whitelocke dismissed from the Army. (The Light Brigade of the Crimean War made famous in Tennyson's poem, was an unrelated cavalry unit.)\n\nThe Baltic 1807–1808\n\nCopenhagen on fire, 1807\n\nThe remaining companies of the 95th were involved in the expedition to Denmark that year. They took part in the Battle of Copenhagen in 1807 as part of Arthur Wellesley's brigade. The expedition, commanded by Lord Cathcart, was intended to capture the Danish Fleet to prevent it falling into the hands of France. The expedition proved to be a thorough success with the Danish Fleet being captured at which point the British withdrew. In 1808 the 1st/95th took part in an expedition to another Scandinavian country, Sweden, an expedition that was commanded by Sir John Moore and designed to help Sweden during their war with Russia. However, once they had reached Gothenburg in May, the troops remained aboard the anchored ships for two months due to a misunderstanding between the British and Swedish governments and returned to Britain before being redirected to Portugal to take part in the Peninsular War, a war designed to help Portugal and Spain in their fight against the French, and where the 95th Rifles would gain their fame.\n\nPeninsular War\n\nIn August 1808 the 2nd/95th was part of the immediate forces sent in the Portuguese expedition initially commanded by Sir Arthur Wellesley and covered the landings at Montego Bay. On 15 August they had the distinction of firing the first shots of the Peninsular War during a skirmish at Óbidos against the French, but also unfortunately suffered the first British officer fatality of the war, a Lieutenant Ralph Bunbury.\n\nOn 17 August 1808 the 95th, as part of 6th Brigade which included the rifle armed 5th/60th Foot, took part in the Battle of Roliça, the first pitched battle of the war, which saw the 95th distinguish themselves greatly.\n\nThe 1st battalion was part of John Moore's 1808/1809 campaign which ended with evacuation after defeating the French at the Battle of Corunna. The majority of the 1st battalion was rested and refitted in the UK, though a few small detachments of the 95th were stranded behind which then formed up with other detachments as part of a defence force (1st Battalion of Detachments) in Portugal.[6] The 1st returned to the peninsula a few months later in May 1809 and in July was force marched in an attempt to arrive with the main force for the Battle of Talavera but despite covering a notable distance they arrived on the 29 July 1809, just after the battle. The Battalion would go on to participate in most of the major battles in the Peninsular War.\n\nAfter the depletion suffered at Corruna, the two battalions of the 95th based at Hythe in Kent were made up to a strength of 1,000 men each. However, so many volunteers came forward to join the regiment that permission was granted to raise a third battalion in 1809.[8]\n\n\"The regiment had already become so famous and popular, that not only were the deficiencies filled up in a very short time, but more than a thousand volunteers presented themselves beyond the numbers required. It was therefore resolved by the Authorities to add a 3rd Battalion to the regiment.\" -Sir William Cope[9]\n\nThe third battalion joined the Peninsular Army in 1810. Thereafter the three battalions of the 95th fought in numerous major battles and skirmishes during the Peninsular War as part of the elite Light Division, including the battles of Bussaco, Vittoria and Nivelle as well as the sieges of Ciudad Rodrigo and Badajoz 1812.\n\nAn example of the ability of the Rifles was at the Battle of San Marcial when a company of the 95th Rifles under the command of Captain Daniel Cadoux held off an entire French division at Vera before withdrawing, inflicting 231 casualties and suffering just 14 killed including Cadoux.\n\nC.S. Forester's novel Death to the French gives a fictional account of a rifleman of the 95th during this campaign.\n\nWaterloo campaign\n\nThe three battalions had been dispersed to various locations with the abdication of Napoleon and the total French defeat in 1814. The majority of the regiment's companies were sent back to England for rest and refitting while several companies had been retained in north-east France at Leuze, Aisne under General Thomas Graham. Five companies of the 3rd battalion were in North America, having been sent in late 1814 to participate in the final stages of the War of 1812. With the return of Napoleon from exile, all of the companies in England crossed the channel and landed in Belgium in May 1815, joining with those already present, so that the entire regiment, bar the five companies still in America, became part of Wellington's Anglo-Dutch army. The first battalion went onto fight at the Battle of Quatre Bras, while all three battalions would fight at the Battle of Waterloo.[10]\n\nAs the Rifle Brigade\n\nAt the end of the Napoleonic Wars, the size of the British Army was reduced; in line with precedent the more recently formed regiments were disbanded first. The unique skills of the 95th were considered too valuable to lose so the 95th, having seen distinguished service in the Napoleonic Wars, was taken out of line of the British Army and became the \"Rifle Brigade\" on 23 February 1816 (the number was reassigned in 1823 to the newly formed county regiment of the 95th (Derbyshire) Regiment of Foot). To this day Rifle regiment's place in the British Army order of precedence is after the infantry regiments and before the SAS (which is another more modern regiment with special skills which was taken out of the line for similar reasons).\n\nPrince Albert\n\nThe Duke of Wellington served as Colonel-in-Chief of the brigade from 1820 until his death in 1852. It was granted the title the \"Prince Consort's Own Rifle Brigade\" in honour of HRH Prince Albert, the Prince Consort, the Rifle Brigade's former Colonel-in-Chief.\n\nCrimean War\n\nWhen the Crimean War broke out in 1853 the Rifle Brigade sent two battalions which fought at the Alma, where one of the battalions led the advance across the Alma River, Inkerman and at the Siege of Sevastopol. The regiment won eight Victoria Crosses during the Crimean War, more than any other regiment.\n\nTimothy O'Hea's Victoria Cross\n\nIn 1866, Private Timothy O'Hea of the 1st Battalion, was awarded the Victoria Cross for an act of bravery in peacetime, while his unit was stationed in Canada. On 9 June 1866, at Danville, Quebec, on the main railway between Montreal and Quebec City, a fire broke out in a car containing 2,000 lb (900 kg) of ammunition. Despite the extreme danger, O'Hea took charge of extinguishing the fire and saved many lives.\n\nFirst World War\n\nThe Rifle Brigade fielded 28 battalions during the Great War, from its original complement of 4 regular and 2 reserve, seeing service primarily on the Western Front, but also in Macedonia. The regiment lost 11,575 killed during the course of the war. They were awarded 52 battle honours, 10 Victoria Crosses and numerous other decorations.\n\nThe 8th Battalion of the Rifle Brigade (together with the 7th and 9th battalions) was part of the 41st Brigade of the 14th (Light) Division of XV Corps. They were mainly made up of volunteers from Kitchener's Army. The battalion saw action including at the Ypres Salient and the Somme. Notably the action they were in at Hooge, Belgium (30–31 July 1915) saw the first use of flamethrowers by the Germans and 2nd Lieutenant Sidney Woodroffe, of the 8th Battalion, was awarded the Victoria Cross for his actions in this battle.\n\nCorporal Alfred George Drake, also in the 8th Battalion, was also posthumously awarded the Victoria Cross for his actions on 23 November 1915, near La Brique, Belgium.\n\nThe regiment also participated in the Battle of Flers-Courcelette (15 September 1916) during the Somme Offensive which saw the first ever deployment of the tank in battle.\n\nSecond World War\n\nThe Rifle Brigade raised numerous battalions to fight in the Second World War but only a few of them would actually see active service. In 1937, before the war, the regiment formed the first motor battalions, a role that would allow the Rifle Brigade freedom of movement which fit their tradition of speed and initiative. The 1st Battalion of the regiment was forced to surrender during the Battle of France in 1940 with the survivors of the 2nd Battalion, King's Royal Rifle Corps (KRRC) and the now embodied Territorial Army battalion of the Queen Victoria's Rifles (KRRC), all part of the 30th Infantry Brigade. After a four-day epic battle to hold Calais during the siege, only 30 men escaped by Royal Navy launch just at the point of surrender, late afternoon 26 May, but not before they had fought a gallant last stand using up the last of their ammunition as they pulled back into the port.\n\nThe 1st Battalion was reformed in the United Kingdom and took part with the 2nd Battalion in many battles in the North African Campaign. The 1st Battalion's four 6-pounders were credited with destroying 19 tanks from the 21st Panzer Division at the Battle of Alam el Halfa on the 31 August 1942. The 2nd Battalion, Rifle Brigade fought with distinction in the Western Desert Campaign, especially in the \"Snipe\" action during the Second Battle of El Alamein, where the four 6-pounders of that battalion, supported by a 6-pounder Anti-Tank battery of the Royal Artillery, destroyed fifty-one German and Italian tanks in a battle that lasted sixteen hours. Lieutenant Colonel Victor Buller Turner received the Victoria Cross for his actions fighting with the guns.\n\nFour battalions of the regiment fought in the Italian Campaign, the 1st Battalion returning to Britain in December 1943 to prepare for the invasion of North West Europe with the 22nd Armoured Brigade, part of 7th Armoured Division. The remaining three battalions were formed into 61st Infantry Brigade, but continued their accustomed role of co-operating with armour when conditions allowed. Their capture of the hills of Perugia involved four successive night attacks. The 1st and 8th battalions landed in Normandy as part of the invasion in June 1944, and fought their way through France, Belgium and the Netherlands to end the war in the vicinity of Hamburg. The 8th Battalion was serving with the 29th Armoured Brigade, part of the excellent 11th Armoured Division. The regiment was awarded 57 battle honours for the Second World War.\n\nPost-Second World War\n\nFrom spring 1946 a number of surplus Rifle Brigade subalterns were transferred to No1 T-Force, a British Army unit which was active in the Ruhr. Their role was to carry out reparations work, evacuating military and industrial equipment needed to rebuild British industry. The 1st Battalion went on to serve in the Mau Mau Rebellion in Kenya and the Malayan Emergency.\n\nAmalgamations\n\nIn 1958 the 1st Battalion was the last surviving battalion that traced its lineage back to the 95th. It was renamed the 3rd Green Jackets Regiment of the Green Jackets Brigade. When the brigade was amalgamated into the Royal Green Jackets in 1966, it became its 3rd Battalion. In 1970 it was reduced to company strength before being reconstituted at Shoeburyness in 1972 under the command of Lieutenant Colonel Robin Evelegh. In 1992 the 1st battalion was disbanded and the 2nd and 3rd battalions were renumbered as the 1st and 2nd respectively. On 1 February 2007 the 2nd battalion were ceremonially rebadged at Kiwi Barracks in Bulford to become the 4th Battalion of the newly formed regiment – The Rifles.\n\nBattle honours\n\nFile:Rifle Brigade Memorial-Grosvenor Gardens.jpg The Rifle Brigade Memorial in London\n\nThe Regiment was awarded the following battle honours:\n\nCopenhagen, Monte Video, Rolica, Vimiera, Corunna, Busaco, Barrosa, Fuentes d'Onor, Ciudad Rodrigo, Badajoz, Salamanca, Vittoria, Pyrenees, Nivelle, Nive, Orthes, Toulouse, Peninsula, Waterloo, South Africa 1846-47, South Africa 1851-2-3, Alma, Inkerman, Sevastopol, Lucknow, Ashantee 1873-74, Ali Masjid, Afghanistan 1878-79, Burma 1885-87, Khartoum, Defence of Ladysmith, Relief of Ladysmith, South Africa 1899-1902\n\nSee also\n\nPeninsula Barracks in Winchester, the home of the Rifle Brigade\n\nNotes\n\n↑ Nosworthy, Brent(1997), \"Battle tactics of Napoleon and his enemies\", Constable ↑ \"This book is a history and study of the spirit, philosophy and character of a Regiment of the British Army, the Rifles Brigade ... 'And when a great Regiment salutes its Colours it is expressing this truth. Its members are commemorating their predecessors who suffered, endured and died in its service, and are dedicating themselves to do likewise.' (Bryant (1969). The Lion and the Unicorn pp. 315–316 ) ... The Regiment I have chosen had no Colours; it had only a silver badge worn by all its members, bearing the names of almost every famous victory in more than a century and a half of British history. In the hour of crisis its Riflemen could not rally, like others round the colour, for they fought in extended order, every man depending for courage on the invisible colours carried in his heart — 'the black and the green, the finest colours ever seen.'\" Bryant 1972 , p. 11) ↑ The shots were at a sufficiently long distance to impress others in the 95th Rifles, whose marksmanship (with the Baker rifle) was far better than the ordinary British soldiers. However no eyewitnesses give the range of Plunket's shot, and the descriptions of Plunket's and Colbert's positions are too vague to allow any measurement. People writing much later made unlikely claims of 400 to 800 yards (370 to 730 m), but did not provide any supporting evidence ( Hadaway 2000 ). ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found.\n\nReferences\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nFurther reading\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nHistorical Re-enactment Groups (UK)"}, {"url": "https://www.northeastmedals.co.uk/british_regiment/rifle_brigade.htm", "page_content": "The Prince Consort's Own (Rifle Brigade) 1800 - 1966\n\n\n\nSome Titles..... 95th Regiment of Foot 1802 The Rifle Brigade 1816 The Prince Consort's Own Rifle Brigade 1862 The Rifle Brigade (Prince Consort's Own) 1921 3rd Green Jackets, The Rifle Brigade 1958 Earliest recognised formation: 1800, as an experimental corps of riflemen. Experiment successful and incorporated into the establishment within months. Motto: ? Regimental Journal: The Rifle Brigade Chronicle WWI: Battle Honours; 52 Victoria Crosses; 10 Died; 11580 WWII: Battle Honours; 57 Victoria Crosses; 1 Died; ??? Amalgamated: 1966, with the 1st Green Jackets, 43rd and 52nd, and the 2nd Green Jackets, The King's Royal Rifle Corps , to form; The Royal Green Jackets.\n\nTwo battalions from 1805, with a third operational 1809-1819.\n\nPeninsula War 1808 - 1814. 1st 2nd and 3rd Battalions Military General Service Medal. 1793 - 1814 clasps: Roleia Vimiera Corunna Talavera Busaco Barrosa Fuentes d' Onor Ciudad Rodrigo Badajos Salamanca Vittoria Pyrenees St Sebastian Nivelle Nive Orthes Toulouse Battle Honours: Roleia; Vimiera; Corunna; Busaco; Barrosa; Fuentes d' Onor; Ciudad Rodrigo; Badajos; Salamanca; Vittoria; Pyrenees; Nivelle; Nive; Toulouse; Orthes; Peninsula.\n\nBattle of Waterloo 1815; 1st and 2nd Battalions, with a detachment of the 3rd Battalion attached to the 2nd. Waterloo Medal 1815 Battalion: 1st 2nd 3rd Number: 570 632 205 Casualties 16th, 17th & 18th June 1815 (extracted London Gazette 8/7/1815 & \"Medals of the British Army: And how they were won\" T. Carter 1861*) 1st Battalion Officers: 2 Lieutenants killed; 1 Lieutenant-Colonel, 1 Major, 2 Captains, 10 Lieutenants and 1 Ensign wounded. 2nd Battalion Officers: 2 Majors, 2 Captains and 10 Lieutenants wounded. 3rd Battalion Officers: 1 Major, 1 Captain and 2 Lieutenants wounded. *Sergeants, Trumpeters, Drummers, Farriers and Rank and File: 1st/2nd/3rd Battalions Killed Wounded Missing Died of wounds Suffered amputation Discharged Transferred to Veteran or Garrison Battalions Rejoined the Regiment Remaining in hospitals in April 1816 Total Rejoined the Regiment Not since heard of, supposed dead. 31/27/3 21/22/4 -/16/1 -/15/- 3/3/- 111/87/23 12/22/10 147/165/38 -/3/- 12/-/- *Carter's figures are in turn extracted from the return prepared by the Adjutant-Generals office, 13th April 1816. Battle Honour; Waterloo.\n\n1816; Removed from the line list nomenclature and given the title \"The Rifle Brigade\"; 1819: 3rd battalion disbanded.\n\n7th & 8th Kaffir Wars 1846 - 1853 1st Battalion (arrived Nov 1846) South Africa Medal 1834-53 number: 765* *161 of these recipients served in both the 1846-47 and 1850-53 campaigns. Battle Honours: South Africa 1846-7, South Africa 1851-1852-1853.\n\nCrimean War 1854 - 1856 1st and 2nd Battalions Crimea Medal 1854 -56 1st Battalion Clasp: → ..none... Alma Balaklava Inkermann Sebastopol Total Medals Number: → ? ? 608 ? ? ? 2nd Battalion Clasp: → ..none... Alma Balaklava Inkermann Sebastopol Total Medals Number: → ? ? ? ? ? ? Battle Casualties; (1st/2nd ) Action. Killed \"Wounded\" Dangerously\n\nWounded Severely\n\nWounded Slightly\n\nWounded Missing Battle of the Alma -/1 1/39 -/- -/- -/- -/- First bombardment of Sebastopol, first battle of Inkermann and minor actions 2/6* 3/13 -/- -/- 4/8 -/- The Battle of Inkermann 23/12 80/23 -/- 1/- 2/1 -/- The Assault on the Quarries -/1 -/- 1/- 1/3 -/9 -/ The First Attack on the Redan 6/24 -/- -/7 6/36 7/38 1/- The Final Attack on the Redan 3/28 -/- 1/9 -/67 5/60 -/- 2nd, 3rd, 4th, 5th, and final bombardments of Sebastopol and minor actions 34/24** -/- 9/17 48/69 61/117 -/- The Magazine Explosion at the French Siege Train -/1 -/- -/- 1/2 1/4 -/- Grand Totals: 303/619 * = (5 killed +1 mortally wounded) **23 Killed, 1 DOW Men who served in the Crimea also eligible for: Turkish Crimea Medal 1855\n\nVCs: 8; Wheatley, Clifford, Cunninghame, Bourchier, Knox, Bradshaw, Humpston, McGregor see the R.Bde. VC page Battle Honours: Alma; Inkermann; Sevastopol.\n\nThe 3rd Battalion of regulars reformed 1855 and a 4th Battalion formed 1857. Both these battalions now carry on with continuous service until the 1922 reductions.\n\nIndian Mutiny 1857 2nd and 3rd Battalions Indian Mutiny Medal. 1857 -59 clasp: Lucknow ....none.... battalion: 2nd 3rd 2nd 3rd number: 722 840 353 65 VCs: 4; Hawkes, Nash, Shaw, Wilmot. see the R.Bde. VC page Battle Honour: Lucknow\n\nOperations against the Mohmands, Shabkadar. 1863-64 3rd Battalion India General Service Medal 1854 - 95 clasp: North West Frontier number : ???\n\nFenian Raids Canada 1866-1870 1st and 4th Battalion Canada General Service Medal 1866-70 clasp: Fenian Raid 1866 Fenian Raid 1870 Red River 1870 battalion: 1st 4th 1st 4th 1st 4th number: 92 175 74 69 - 1* *In combination with Fenian Raid 1866 VCs:1 O`Hea see the R.Bde. VC page\n\nAshanti War 1873-74 2nd Battalion Ashanti Medal 1873-74 clasp: ...none.... Coomassie numbers : 700 621 Battle Honour: Ashantee 1873-4\n\nOperations against the Jowaki Afridis, NWF 1877-78 4th Battalion India General Service Medal 1854 - 95 clasp: Jowaki 1877-78 number: ?\n\nAfghan War 1878-80 4th Battalion Afghanistan Medal 1878 -1880 clasp: ...none... Ali Musjid Charasia Kabul Kandahar total number: 356* 600* 1 2 3 957* *these figures could be several higher due to some illegible page edges on the original roll. General Roberts' March, Kabul to Kandahar 9-31 August 1880 Kabul to Kandahar Star 1880 number: 4** **Capt. W.W Hammond; Lt. J. Sherston (also shown as Sherstone); 1950 Pte. David Chilton and 2254 Pte. William Gill. Battle Honours: Ali Musjid, Afghanistan 1878-9\n\nThird Anglo-Burmese War 1885-87, and aftermath. 1st and 4th Battalion India General Service Medal 1854 - 95 clasp: Burma 1885-7 Burma 1887-89 Burma 1889-92 battalion: 1st 1st 4th 4th number: ? ? ? ? Battle Honour: Burma 1885-7\n\nAshanti Expedition 1895-96 Detachment of the 2nd Battalion Ashanti Star 1895-96 number: 26\n\nReconquest of the Sudan 1896 - 98. 2nd Battalion Queen's Sudan Medal 1896 - 98 number: ? Khedive's Sudan Medal 1896 - 1908 clasp : Atbara Khartoum ...none... number: ? ? ? Battle Honour: Khartoum\n\nNorth West Frontier Operations 1897-98 3rd Battalion India Medal 1895 clasp: Punjab Frontier 1897-98 Tirah 1897-98 number: ? ?\n\nSouth African War 1899 - 1902 or \"Boer War\" 1st Battalion (Nov 1899- end), 2nd Battalion (Oct 1899-end) and the 4th Battalion arrived Jan. 1902. Detachments also served as Mounted Infantry. Queen's South Africa Medal 1899-1902, with or without the King's South Africa Medal 1901 - 1902 (no KSAs to 4th Battalion) QSAs Common clasps: Cape Colony, Orange Free State, Transvaal, South Africa 1901, South Africa 1902; also: 2nd MI clasp: Natal Defence of Ladysmith Relief of Ladysmith Tugela Heights Paardeberg number: ? ? ? ? ? MI MI MI clasp: Driefontein Johannesburg Laing's Nek Diamond Hill Belfast number: ? ? ? ? ? Casualties: Officers NCOs and Men KIA & DOW Wounded Disease KIA & DOW Death from disease Wounded Missing / POW 1st Battalion 5 9 1 46 62 291 - 2nd Battalion 7 14 1 68 80 165 - 4th Battalion 2 - 1 3 16 8 - VCs: 2; Congreve; Durrant Battle Honours: Defence of Ladysmith, Relief of Ladysmith, South Africa 1899-1902\n\nSomaliland Operations 1902-04 Composite detachment formed from the 3rd and 4th battalions served as a single section of No. 2 Company, British Mounted Infantry (Bengal Company). Africa General Service 1899-1956 clasp: Somaliland 1902-04 Jidballi number: 33 2 ? VCs: 1; Gough see the R.Bde. VC page\n\nThe Great War 1914 - 1918 (total of 28 battalions; 19 served overseas:- ) Generally awarded the British War Medal & Victory Medal, men overseas prior to 1/1/1916 also a 1914 or 1914-15 Star. Battalion → 1 2 * 3 4* 7 8 9 10 11 date of first overseas service.\n\n(first theatre red x ) 23/8\n\n1914 6/11\n\n1914 12/9\n\n1914 21/12\n\n1914 ?/5\n\n1915 ?/5\n\n1915 ?/5\n\n1915 21/7\n\n1915 21/7\n\n1915 France & Flanders x x x x x x x x x Gallipoli Egypt & Palestine Macedonia x Italy Star\n\npossible ? 1914 or 1914-15 x x x or 1914-15 only x x x x x x VCs at a glance: died\n\nExtracted from : \"Soldiers / Officers Died in the Great War\" (consider approximate - in addition the regiment as a whole lost an additional 219 officers who are recorded with 'battalion not shown' or with battalions not shown here, or who we have not yet allocated a battalion.) 1622 1574 921 397 708 881 923 580 649\n\nVCs: 10: Woodall 1st, Noble 2nd, Cates 2nd, Daniels 2nd, Drake 8th, Woodroffe 8th, Gregg 13th, Beesley 13th, Burman 16th, Congreve (?), see the R.Bde. VC page Territorial Force War Medal 1914-19\n\n66 officers and men of the Rifle Brigade also qualified for this medal. * The 2nd and 4th battalions were in India when war broke out and returned first to the UK\n\nRegular Territorial Force New Armies Garrison. Battle Honours: Le Cateau; Marne 1914; Neuve Chapelle; Ypres 1915, 1917; Somme 1916, 1918; Arras 1917, 1918; Messines 1917; Cambrai 1917, 1918; Hindenburg Line; Macedonia 1915-18. Retreat from Mons; Aisne 1914, 1918; Armentières 1914; Gravenstafel; St Julien; Frezenberg; Bellewaarde; Aubers; Hooge 1915; Albert 1916, 1918; Bazentin; Delville Wood; Guillemont; Flers-Courcelette; Morval; Le Transloy; Ancre Heights; Ancre 1916; Vimy 1917; Scarpe 1917, 1918; Arleux; Pilckem; Langemarck 1917; Menin Road; Polygon Wood; Broodseinde; Poelcapelle; Passchendaele; St Quentin; Rosières; Avre; VillersBretonneux; Lys; Hazebrouck; Béthune; Drocourt-Quéant; Havrincourt; Canal du Nord; Selle; Valenciennes; Sambre; France and Flanders 1914-18.\n\nThe Great War 1914 - 1918 continued......... Battalion → 12 13 16 18 19 20 21 22 23 24 London Western Northern Midland Wessex & Welsh North Western Home Counties All designated garrison duty. date of first overseas service.\n\n(first theatre red x ) 22/7\n\n1915 31/7\n\n1915 8/3\n\n1916 1916 ?/1\n\n1916 ?/1\n\n1916 ?/1\n\n1916 1916 1916 1916 France & Flanders x x x Gallipoli Egypt & Palestine x x x x Macedonia x Burma x India x x x x Star\n\npossible ? 1914 or 1914-15 or 1914-15 only x x VCs at a glance: died\n\nExtracted from : \"Soldiers / Officers Died in the Great War\" (consider approximate - in addition the regiment as a whole lost an additional 219 officers who are recorded with 'battalion not shown' or with battalions not shown here, or who we have not yet allocated a battalion.) 786 812 727 21 44 34 15 38 28 34\n\nMesopotamia & Persia 1919 - 20 1st Battalion General Service Medal 1918 -62 clasp: Iraq N.W. Persia numbers: ? ?\n\n3rd and 4th Battalions of regulars disbanded 1922\n\nJewish / Arab unrest, Palestine 1936 - 39 2nd Battalion General Service Medal 1918 -62 clasp: Palestine number:\n\nWW2 1939 - 1945 Battalion → 1st 2nd 7th 8th 9th 10th campaign ↓ France and\n\nBelgium 1940.\n\n(Dunkirk ) x\n\nNorth Africa & Middle East x x x x x Far East Sicily / Italy x x x x N.W. Europe x x Notes. All the battalions spent most of their service as lorried infantry or \"motor battalions\", generally in support of armour. 1st Support Group, F&B 1940 Campaign. Heavy losses Defence of Calais 24-26th May. Remainder captured. Reformed UK. 2nd Armoured Brigade 31/10/40 - 19/6/42 then 22nd Armoured Brigade 19/6/42-31/8/45 Landed NW Europe, D-Day +2 serving 1st, 6th, 7th, 10th, Armoured Divisions, North Africa and Italy. Previously designated 1st London Rifle Brigade.\n\n\n\nBecame 7th Rifle Brigade 19/1/41 Previously designated 2nd London Rifle Brigade.\n\n\n\nBecame 8th Rifle Brigade 18/1/41 Landed NW Europe, D-Day +9 with 29th Armoured Brigade. Previously designated 1st Tower Hamlets Rifles. Became 9th Rifle Brigade\n\n?/?/41 Disbanded in North Africa. Aug 1942\n\nPreviously designated 2nd Tower Hamlets Rifles. Became 10thRifle Brigade 15/1/41 26th Armoured Brigade 15/1/41-29/5/44 Disbanded Italy WW2 Stars common to the Battalion. (excluding 39-45 star )\n\nKey: A = Africa, P = Pacific, B = Burma, I = Italy, F&G = France and Germany A, I, F&G A, I. A, I. F&G A A, I. VCs: 1; Turner see the R.Bde. VC page Most also entitled to the 1939-45 War Medal and many the Defence Medal Battle Honours: Calais 1940; North-West Europe 1940, 1944-5; Beda Fomm; Sidi Rezegh 1941; Alem el Halfa; El Alamein; North Africa 1940-3; Cassino II; Capture of Perugia; Italy 1943-5. Villers Bocage; Odon; Bourguébus Ridge; Mont Pinçon; Le Perier Ridge; Falaise; Antwerp; Hechtel; Nederrijn; Lower Maas; Roer; Leese; Aller; Egyptian Frontier 1940; Mersa el Brega; Agedabia; Derna Aerodrome; Tobruk 1941; Chor es Sufan; Saunnu; Gazala; Knightsbridge; Defence of Alamein Line; Ruweisat; Tebaga Gap; Medjez el Bab; Kasserine; Thala; Fondouk; Fondouk Pass; El Kourzia; Djebel Kournine; Tunis; Hammam Lif; Cardito; Liri Valley; Melfa Crossing; Monte Rotondo; Monte Malbe; Arezzo; Advance to Florance; Gothic Line; Orsara; Tossignano; Argenta Gap; Fossa Cembalina.\n\n2nd Battalion Disbanded 1948\n\nMau Mau Rebellion, Kenya. 1953 1st Battalion Africa General Service Medal 1902 - 56 clasp: Kenya number: ?\n\nThe Malaya Emergency: Operations against Communist insurgents. 1948-60 1st Battalion General Service Medal 1918 - 62 clasp: Malaya number: ?\n\n1958: 1st Battalion now designated 3rd Green Jackets (The Rifle Brigade)"}, {"url": "https://www.angloboerwar.com/unit-information/imperial-units/644-rifle-brigade", "page_content": "Imperial units\n\nRifle Brigade (Prince Consort's Own)\n\nPage 1 of 2\n\n1st Battalion\n\nThe 1st Battalion sailed on the German on 28th October 1899, arrived at the Cape on 20th November, and was sent on to Durban. Along with the 2nd Scottish Rifles, 3rd King's Royal Rifles, and 1st Durham Light Infantry, they formed the 4th Brigade under Major General Honourable N G Lyttelton. The work of the brigade is sketched under the 2nd Scottish Rifles, and of the Natal relief army generally under the 2nd Queen's.\n\nThe losses of the 1st Rifle Brigade at Colenso were trifling. At Vaal Krantz on 5th and 6th February their casualties were 5 men killed and 5 officers and 76 men wounded. For that engagement 4 officers and 4 non-commissioned officers and men were mentioned in General Buller's despatch of 8th February 1900.\n\nThe battalion took part in the heavy work between 13th and 27th February, and won the commendation of General Buller. In his telegram of 20th February the general mentioned 3 infantry battalions, one of which was the 1st Rifle Brigade.\n\nOn 18th February there fell to the Durham Light Infantry and 1st Rifle Brigade the task of attacking the nek between Greenhill and Monte Cristo. They wasted no time, and were soon in the laager behind the nek. On the 23rd these two battalions crossed the river, and in the forenoon received orders to support Hart's attack on Inniskilling Hill, but the attack was over before they arrived at the hill-foot. During the next four days, except on the 25th, the battalion was constantly fighting, being the leading battalion on the left of the line in the final assault on the 27th. In the fourteen days' fighting the Rifle Brigade's losses, including those of officers and men in the Composite Rifle Battalion, were approximately 14 men killed, 8 officers and 117 men wounded.\n\nFive officers and 10 non-commissioned officers and men were mentioned in General Buller's despatch of 30th March 1900, 3 of the latter being awarded the distinguished conduct medal, another man of the Mounted Infantry company getting that medal at Alleman's Nek. Captain H N Congreve brought a VC to the regiment, if not to the 1st Battalion, by his conspicuous gallantry in assisting to rescue the guns at Colenso on 15th December 1899.\n\nThe 4th Brigade took part in the turning movement via Helpmakaar in the first half of May 1900, and while the 2nd, 10th, and 11th Brigades turned the Laing's Nek position via Botha's Pass, the 4th sat in front of it. After Alleman's Nek, 11th June, the 4th Brigade was sent along the Pretoria Railway. On 28th July Major General Cooper with the Rifle Brigade and 3rd King's Royal Rifles took over Heidelberg from Hart. About that town the 1st Rifle Brigade was stationed for a long period.\n\nOn 9th October 1900 a disastrous incident occurred. The railway had been cut south of Heidelberg, and the same day Captain Paget, 2 other officers, a colour sergeant, and 14 riflemen went down the line on an engine to reconnoitre. 200 Boers were lying in wait, and had the little party completely at their mercy. Two officers and 1 man were killed, the others were wounded.\n\nIn General Buller's despatch of 9th November 1900 4 officers and 4 non-commissioned officers and men of the 1st Battalion were mentioned, and several officers of the regiment were also mentioned for good staff work. Twenty officers and 38 non-commissioned officers and men were mentioned in Lord Roberts' final despatch. These commendations embraced both 1st and 2nd Battalions.\n\nOn 26th December 1900 a part of the battalion had very severe fighting near the Oceana Mine, the company guarding the baggage being attacked while the others were out clearing farms. That day 10 men were killed and 2 officers and 40 men wounded.\n\nThroughout 1901 the battalion was generally in the neighbourhood of the Transvaal - Natal Railway. In January and February a lot of marching was done, sometimes with a column, sometimes taking convoys to Ermelo and other places for other columns. After February they were chiefly engaged in watching the railway, having latterly about forty miles in safe keeping.\n\nIn Lord Kitchener's despatches during the war 8 officers and 7 non-commissioned officers and men of the Rifle Brigade were mentioned, but in the case of some of these the battalion is not stated. In the final despatch 14 officers and 14 non-commissioned officers and men were mentioned.\n\nThe Rifle Brigade furnished many sections of Mounted Infantry, to follow whose doings would require a volume, as they had fighting all over the country. For a great part of 1901 one company did excellent work under Major M'Micking and Colonel Greenfell in the Nylstroom - Zand River Poort district, when substantial successes were scored. A party was with Major Gough when he had his disaster on the Blood River, 17th September 1901. On that occasion Lieutenant Blewitt and 1 rifleman were killed and 4 men wounded. The party did well, and an officer and man gained mention. Some of the Rifle Brigade were in the 13th Battalion Mounted Infantry and some in the 14th, both of which did splendid work under Bullock, Spens, and other commanders, chiefly in the Eastern Transvaal and the north-east of the Orange River Colony. A good idea of the services of these two battalions is to be had from Lieutenant Moeller's 'Two Years at the Front.'\n\n2nd Battalion\n\nThe 2nd Battalion sailed from Crete on the Jelunga on 2nd October 1899, and reached Durban on the 26th. At 3 am on the 30th the battalion got into Ladysmith by rail, and after a hasty meal set out to join the 1st Devon, 1st Manchester, and 2nd Gordons under Ian Hamilton at Limit Hill, north of the town, where Sir George's centre was that day (see 1st Liverpool). The brigade did not have much to do beyond sending help to Colonel Grimwood's brigade on the right or east. During the forenoon the battalion and the 2nd Gordons deployed and lined the crest of Limit Hill, from which they covered the retreat of Grimwood's brigade, they themselves eventually retiring about 3 pm.\n\nFrom the commencement of the siege the battalion held King's Post and Leicester Post on the north of the town, and, unlike some other battalions, they strained every nerve for weeks to make these posts absolutely unassailable. The rocky nature of the ground, the want of suitable tools, and the fact that many of the diggers had to be on duty in the trenches all night, made the task superlatively difficult Observation Post, about a mile in advance of King's Post, was till 9th November held by a weak detachment of the 5th Lancers, who were attacked on that day, and the Rifle Brigade had to reinforce them. The attack was repulsed. The battalion's losses were 1 officer and 1 man mortally wounded and 4 men wounded. They had now to garrison this post and to set about making it impregnable. One very remarkable piece of work done by the battalion was the keeping down by the Lee-Metford fire of 'sharpshooters, many of whom were officers', of the Boer artillery-fire at ranges between 2000 and 2800 yards. On the morning of 8th December it became known that General Hunter with 600 men of the Imperial Light Horse and Natal Carabiniers had blown up two big guns on Lombard's Kop and captured a maxim. This fired Colonel Metcalfe to do something similar, and he got Sir George's sanction to endeavour to destroy the howitzer on Surprise Hill. On the night of the 9th he reconnoitred the route, and on the 10th at 10 pm started with five companies 2nd Rifle Brigade and a few Engineers under the ever-ready Lieutenant Digby-Jones. The hill-top was reached; after some delay the howitzer was found, not in its emplacement; the explosive was inserted; a fuse was lit, but no explosion happened; another had to be set. This time the gun was destroyed; but meanwhile the Boers had gathered in force on the hillside, and our men had to charge with fixed bayonets, never firing a shot. Many Boers were bayoneted. Colonel Metcalfe lost 1 officer and 11 men killed, 36 wounded, and 10 prisoners or missing, but a bit of good work had been boldly and skilfully executed. Sir George White in his despatch of 23rd March 1900 remarks that \"the companies were, on the way back, admirably handled by their captains ... The affair reflects great credit on Lieutenant Colonel C T E Metcalfe and his battalion\".\n\nAt three on the morning of 6th January the battalion heard the furious rattle of musketry round the southern defences, and about 5.30 they were ordered to send six companies to Caesar's Camp, four miles off, arriving there about seven. Five companies were pushed into the firing line, which was distant from the enemy only 80 yards. \"For nearly the whole day the fight raged fiercely, first one side then the other gaining a slight advantage, but we could not succeed in dislodging the Boers\" from the south-east of the hill. At 3.30 the enemy tried to rush forward, but were driven back, and shortly afterwards retreated under a heavy fire, \"some companies firing their last round\". The battalion this day lost 1 officer killed and 1 mortally wounded, and 20 men killed, 5 officers and 32 men wounded. That night officers and men lay on the stricken field soaked and physically wretched, but knowing that another big bit of work had been done. Five officers and 8 non-commissioned officers and men were mentioned in Sir George White's despatch of 23rd March 1900.\n\nOn 7th January the battalion was ordered to take over Waggon Hill from the 1st King's Royal Rifles. The Honourable A Dawnay, adjutant of the 2nd battalion, in the account which he gives of the siege, already quoted from, says: \"On arriving at Waggon Hill we were not best pleased at our change of quarters; we found none of those snug burrows or palatial residences that we had built with so much care in our old habitation, and the defensive works were few and far between. All the weary digging had to be started afresh, only under more trying conditions, as it all had to be done by night, it being quite impossible to attempt anything of the sort by day, since we were continually exposed to shrapnel at the convenient range of 3200 yards. Quite two miles of front had to be fortified, but in a very short time a complete set of works made their appearance, continuous sangars occupied a large portion of our front, wire entanglements were laid down all round the front of our position, and abattis made in places\".\n\nPerhaps the King's Royal Rifles thought that they did all the digging desirable, but various writers support the statements contained in the quotation. General Ian Hamilton has almost a faultless record in the campaign. He added to his reputation on the 6th January, but it does seem almost a fault that he allowed the battalions occupying Waggon Hill and Caesar's Camp to sit there without working at their defences as their brethren on the north side of Ladysmith were doing.\n\nAfter the relief of Ladysmith the garrison was given a period to rest and recuperate, and never did men deserve that more. They were ready to go forward when General Buller moved north, and the 2nd Rifle Brigade were brigaded under General Walter Kitchener with the 1st Devon, 1st Manchester, and 2nd Gordons. In the fighting at Rooi Kopjes, 24th July, and Amersfoort, 7th August, the battalion took no prominent part, but they were to get a great opportunity in good time. When the force arrived at Geluk, 23rd August, it was evident the Boers were about to make a stand. On the 26th, at a conference between Lord Roberts and General Buller, it was arranged that the troops of the latter, being the old Ladysmith garrison, should attack the enemy's position on the 27th.\n\nThe position was an extremely strong one, stretching for miles on either side of the Belfast-Koomati Poort Railway. Bergendal, by which name the battle has become known, is the name of a farm, the house and buildings of which are situated on, or rather a little to the east of, a kopje. This kopje and the buildings, which were seen to be strongly held, lie to the south of the railway and to the west of a long ridge or series of kopjes running roughly north and south. These ridges seem to have been the Boer main position. They had guns on these as well as on the hills north of the railway. Sir Redvers decided that Bergendal kopje must be the first point attacked. It was slightly isolated, and formed a definite objective. He placed the Manchester Regiment, four naval 12-pounders, two 4'7 guns, two 5-inch guns, the 61st Howitzer Battery, and the 21st Battery on a ridge lying south of, and roughly parallel to, a line drawn from Bergendal to the Boer main positions. The 42nd Battery was farther to the right of the Manchesters. A Battery RHA and the 53rd RFA fired from a point about one and a half mile north of the other artillery and close to the railway. For three hours these guns kept up a furious fire on the buildings and kopje, but the Boers would not shift. The infantry were then ordered to assault, the 2nd Rifle Brigade to attack from near where the A Battery was—that is, from the west—the 1st Royal Inniskilling Fusiliers from near the main artillery position, or the south. Between these battalions were the 1st Bevon and 2nd Gordons in support. The Rifle Brigade being extended to about ten paces, had reached a point 800 yards west of the kopje when there opened a terrific rifle-fire both from the kopje and from hills north of the railway. The attackers lay down, then after a great effort by our artillery the Rifle Brigade again advanced by rushes, and \"there never was a waver from start to finish\". The Boers of course bolted, but a pom-pom complete and 19 prisoners were taken: 14 of their dead were found. The Rifle Brigade lost 3 officers killed or mortally wounded, and 21 riflemen killed or died of wounds; 7 officers and 63 men were wounded. The losses of the other battalions were very slight. Many heroic deeds were done in the assault. Rifleman Durrant for carrying Corporal Weller a distance of 200 yards under a very heavy fire got the VC.\n\nGeneral Buller said: \"The honours of the assault belong to the Rifle Brigade, as they had to attack that part of the kopje which had been most protected from our artillery-fire; but all the troops did splendidly, and the carrying of such a position, held as it was by resolute men (the famous Johannesburg Zarps), will always remain present to the minds of those who witnessed it as a most gallant feat of arms\". After referring to the excellent way the maxims were handled and other dispositions made, Sir Redvers remarks: \"The loss of the post at Bergendal led to the enemy abandoning in great haste the whole of their immensely strong position about Dalmanutha, and forced them to withdraw in great confusion beyond Machadodorp. In fact the capture of Bergendal by the Rifle Brigade and Inniskilling Fusiliers cleared the whole of the high veldt of the enemy\".\n\nSix officers and 8 non-commissioned officers and men of the 2nd Rifle Brigade were mentioned in General Buller's despatch of 13th September. Four officers and 3 non-commissioned officers were also mentioned in his final despatch.\n\nThe battalion crossed the railway along with General Buller and moved north towards Lydenburg, which, after some fighting, they reached on 7th September, and in that district they remained for a considerable time. Henceforth they were to have plenty of work and a fair amount of hardship, but they were to see no fighting to be compared with Bergendal. During the remainder of the campaign they were employed in the Eastern Transvaal. In March 1901 three companies accompanied Colonel Park on a night raid on Kruger's Post, which was entirely successful. In April the battalion was put into a column under General W Kitchener, and for the next three months did much hard marching, chiefly north of the Delagoa Railway. About the end of July 1901 the battalion took over a number of posts about Middelburg and garrisoned these for a long period.\n\nFor notes as to commendations by Lord Roberts, and also those earned under Lord Kitchener, see 1st Battalion.\n\n4th Battalion\n\nThe 4th Battalion sailed from England about 15th December 1901, and after their arrival in South Africa took part in the closing scenes in the Orange River Colony, when the infantry held the lines and the mounted men did the driving.\n\nComposite Rifle Battalion\n\nTowards the close of 1899 there arrived in Natal various drafts, among whom were the reservists for the 2nd Rifle Brigade, which had sailed from Crete before war was declared, and for the 1st and 2nd King's Royal Rifles, which had both been in South Africa before that date. These men were formed into a battalion commanded by Major Montagu-Stuart-Wortley of the King's Royal Rifles. During the time General Buller was at Spion Kop and Vaal Krantz the battalion was at Frere and afterwards at Chieveley, assisting Major General Barton in guarding the line and rail-head and in making demonstrations.\n\nIn the last and successful endeavour to relieve Ladysmith the battalion was put into the 11th (Lancashire) Brigade under Major General Wynne and had an honourable share in the fourteen days' fighting. They were the first troops to enter Colenso on 20th February. Next day they crossed the river, and on the 22nd had heavy fighting, gaining various positions, which were, however, as difficult to hold as to seize. On the night of the 22nd the Boers attacked the positions, coming up very close. Captain Baker-Carr's company rushed out with fixed bayonets, killed several of the enemy, and drove them off. On the 23rd it was necessary to relieve two companies holding two kopjes in advance.\n\nThe relief had to be effected by men and officers rushing out singly. In this movement 3 officers were wounded. On the 27th the battalion was posted on the slopes south of the river, and along with the Border Regiment was employed all day in long-range firing on the Boer positions.\n\nThree officers of the battalion were mentioned in General Buller's despatch of 30th March and 3 men recommended for the distinguished conduct medal. Seven additional officers were mentioned in the general's final despatch. After marching into Lady-smith the men joined their regiments. An account of the battalion's work is given in the Rifle Brigade Chronicle of 1900.\n\nGeneral Buller, in his despatch of 30th March 1900, referring to Major Montagu-Stuart-Wortley, said, \"I was much struck by the way in which a battalion made up of the drafts of three regiments, and officered chiefly by second lieutenants, worked under his command\"."}, {"url": "https://wartimememoriesproject.com/ww2/allied/regiment.php?pid=1522", "page_content": "\n\n\n\nThe Wartime Memories Project is the original WW1 and WW2 commemoration website. Announcements\n\n\n\nThe Wartime Memories Project has been running for 23 years. If you would like to support us, a donation, no matter how small, would be much appreciated, annually we need to raise enough funds to pay for our web hosting and admin or this site will vanish from the web.\n\n\n\nIf you would like to support us, a donation, no matter how small, would be much appreciated, annually we need to raise enough funds to pay for our web hosting and admin or this site will vanish from the web. Looking for help with Family History Research? Please read our Family History FAQ's\n\nPlease read our The Wartime Memories Project is run by volunteers and the free to access part of the website is funded by donations from our visitors. If the information here has been helpful or you have enjoyed reaching the stories please conside making a donation, no matter how small, would be much appreciated, annually we need to raise enough funds to pay for our web hosting or this site will vanish from the web. If you enjoy this site please consider making a donation.\n\nWant to find out more about your relative's service? Want to know what life was like during the War? Our Library contains an ever growing number diary entries, personal letters and other documents, most transcribed into plain text.\n\n\n\n25th May 2023 - Please note we currently have a huge backlog of submitted material, our volunteers are working through this as quickly as possible and all names, stories and photos will be added to the site. If you have already submitted a story to the site and your UID reference number is higher than 261814 your information is still in the queue, please do not resubmit, we are working through them as quickly as possible. We are now on Facebook. Like this page to receive our updates. If you have a general question please post it on our Facebook page.\n\nWanted: Digital copies of Group photographs, Scrapbooks, Autograph books, photo albums, newspaper clippings, letters, postcards and ephemera relating to WW2. We would like to obtain digital copies of any documents or photographs relating to WW2 you may have at home. If you have any unwanted photographs, documents or items from the First or Second World War, please do not destroy them. The Wartime Memories Project will give them a good home and ensure that they are used for educational purposes. Please get in touch for the postal address, do not sent them to our PO Box as packages are not accepted. World War 1 One ww1 wwII second 1939 1945\n\nDid you know? We also have a section on The Great War. and a Timecapsule to preserve stories from other conflicts for future generations.\n\n"}, {"url": "https://www.iwm.org.uk/collections/item/object/30076447", "page_content": "Description\n\nPhysical description\n\nA white metal Maltese cross on which a circlet inscribed RIFLE BRIGADE, enclosing a strung bugle surmounted by an Imperial (King's) crown. The cross in enclosed by a laurel wreath entwined with seven scrolls on each side, all inscribed with battle honours. Battle honours are also inscribed on each arm of the cross. Above the top arm of the cross and joining the ends of the wreath is a tablet embossed WATERLOO, itself surmounted by an Imperial (King's) crown. Below the bottom arm of the cross is a tablet inscribed PENINSULA. Slider to reverse.\n\nHistory note\n\nBadge of pattern worn from 1910 until 1937. The predecessor Regiment was raised in 1800 as The Experimental Corps of Riflemen, also known as the Rifle Corps or Manningham's Sharpshooters, after Colonel Coote Manningham who had raised the unit. The Regiment's personnel were recruited from across the Army and their weapon was the Baker Rifle. As its name suggests, this was an experimental body that aimed to develop skirmish and scouting tactics, allied with highly accurate shooting skills where individual targets were selected rather than relying on mass volley fire. Such a skill-set had been identified as desirable following experience in North America. In 1803 the Regiment joined the 43rd and 52nd Regiments, recently designated as light infantry, at Shorncliffe and trained in appropriate tactics under their own Colonel and under Sir John Moore of Light Infantry fame. In 1803 the unit was re-designated 95th Regiment of Foot, and again in 1812 as 95th Regiment of Foot (Riflemen). By 1816 the Regiment had grown to three battalions and it became a Brigade, specifically The Rifle Brigade, discarding its Regimental number. In 1862 the name was changed to The Prince Consort's Own Rifle Brigade, commemorating the fact that he had been the Regiment's Colonel for nine years at the time of his death the previous year. Thereafter there were numerous minor changes to the name, for reasons that are obscure, largely to do with the use or otherwise of the definite article in the title. In 1868 the Regiment became Rifle Brigade (Prince Consort's Own) and in July 1881 (although not affected by the Cardwell/Childers reforms of that year) the name changed to Prince Consort's Own (Rifle Brigade). In 1882 it changed to The Rifle Brigade (Prince Consort's Own) and in 1920 it settled on Rifle Brigade (Prince Consort's Own). The badge had a similarly disturbed history. The first version of the cap badge seems to have been adopted around 1868, the principal element being a Maltese Cross with a central circlet bearing the Regiment's name, in the centre of which was a crowned bugle. The cross was surrounded by a laurel wreath, with a crown above all. Battle honours from the Peninsula War were embossed on the arms of the cross and other honours on scrolls in various positions. The details of how these elements were displayed, however, changed over time. The crown at the top of the badge was originally a Guelphic crown, this being the design of crown forming part of the Royal Guelphic Order, instituted in 1815 by the Prince Regent but from 1837 becoming a Hanoverian Order. Its connection with the Regiment is said to originate with the fact that the Duke of Wellington, Colonel of the Regiment from 1820 to 1852, had been admitted to the Guelphic Order in 1816. This crown became a badge of the Regiment in 1820 and was later adopted into the cap badge. The Guelphic crown has also become associated with the Prince Consort, and with British Regiments considered the \"Prince Consort's Own\". Between 1903 and 1956 the crown changed to an Imperial (King's) crown before reverting very briefly to the Guelphic pattern. The laurel wreath of the badge up to 1910 carried two scrolls on each side, bearing battle honours from the Crimea. After 1910 fourteen such scrolls were carried. In 1937 the number of scrolls remained the same but with some changes to the honours named. 1937 saw other changes. Two First World War honours displaced the honour PENINSULA that had hitherto been carried at the foot of the cross, the latter being transferred to the top arm of the cross. A new scroll was added to the foot of the badge, carrying PRINCE CONSORT'S OWN, and the name of the Regiment carried on the circlet at the centre of the cross became THE RIFLE BRIGADE rather than just RIFLE BRIGADE as hitherto. The final changes came in 1956 when, in addition to the re-adoption of the Guelphic crown at the top of the badge, all battle honour scrolls were removed from the laurel wreath and the Regimental name on the central circlet reverted to RIFLE BRIGADE. A Naval crown superscribed \"COPENHAGEN 2 April 1801\" was added below the cross, commemorating the services of the Regiment aboard the fleet at that battle. In 1958 the Regiment became part of the Green Jacket Brigade and adopted the Brigade badge. Though the brigade wore a Greenjackets shoulder flash, each individual unit wore its own epaulette badge, the Rifle Brigade with a black RB, the 2nd a KRRC, and the 1st wore a 43/52. Each regiment kept its own coloured NCO's stripes and marksmanship badges. In 1966 the Brigade became the Royal Green Jackets Regiment, the Rifle Brigade becoming \"3rd Battalion The Royal Green Jackets (The Rifle Brigade)\". In 1968 the Rifle Brigade reference was dropped. In 1992 they became 2nd Battalion with the disbandment of 1st Battalion, the old Ox & Bucks. In 2007 a new regiment, The Rifles, was formed from former units of the Light Infantry, Green Jacket and Wessex Brigades. The 2nd Battalion Royal Green Jackets became 4th Battalion The Rifles."}, {"url": "https://books.google.com/books/about/The_Rifle_Brigade_Chronicle.html?id=3BN-5WV8tLEC", "page_content": "Shop for Books on Google Play\n\nBrowse the world's largest eBookstore and start reading today on the web, tablet, phone, or ereader.\n\nGo to Google Play Now »"}, {"url": "https://books.google.com/books/about/The_Rifle_Brigade_Chronicle.html?id=rHDxTU_CaJIC", "page_content": "Shop for Books on Google Play\n\nBrowse the world's largest eBookstore and start reading today on the web, tablet, phone, or ereader.\n\nGo to Google Play Now »"}, {"url": "https://discovery.nationalarchives.gov.uk/details/c/F267766", "page_content": "This website uses cookies\n\nWe place some essential cookies on your device to make this website work.\n\n\n\nWe'd like to use additional cookies to remember your settings and understand how you use our services.\n\n\n\nThis information will help us make improvements to the website."}], "John Russell participated in the Indian Mutiny.": [{"url": "https://www.britannica.com/event/Indian-Mutiny", "page_content": "Indian Mutiny , also called Sepoy Mutiny or First War of Independence , widespread but unsuccessful rebellion against British rule in India in 1857–59. Begun in Meerut by Indian troops ( sepoys ) in the service of the British East India Company , it spread to Delhi , Agra , Kanpur , and Lucknow . In India it is often called the First War of Independence and other similar names.\n\nBackground\n\nTo regard the rebellion merely as a sepoy mutiny is to underestimate the root causes leading to it. British paramountcy—i.e., the belief in British dominance in Indian political, economic, and cultural life—had been introduced in India about 1820. The British increasingly used a variety of tactics to usurp control of the Hindu princely states that were under what were called subsidiary alliances with the British. Everywhere the old Indian aristocracy was being replaced by British officials. One notable British technique was called the doctrine of lapse, first perpetrated by Lord Dalhousie in the late 1840s. It involved the British prohibiting a Hindu ruler without a natural heir from adopting a successor and, after the ruler died or abdicated, annexing his land. To those problems may be added the growing discontent of the Brahmans, many of whom had been dispossessed of their revenues or had lost lucrative positions.\n\nAnother serious concern was the increasing pace of Westernization, by which Hindu society was being affected by the introduction of Western ideas. Missionaries were challenging the religious beliefs of the Hindus. The humanitarian movement led to reforms that went deeper than the political superstructure. During his tenure as governor-general of India (1848–56), Lord Dalhousie made efforts toward emancipating women and had introduced a bill to remove all legal obstacles to the remarriage of Hindu widows. Converts to Christianity were to share with their Hindu relatives in the property of the family estate. There was a widespread belief that the British aimed at breaking down the caste system. The introduction of Western methods of education was a direct challenge to orthodoxy, both Hindu and Muslim.\n\nThe mutiny broke out in the Bengal army because it was only in the military sphere that Indians were organized. The pretext for revolt was the introduction of the new Enfield rifle. To load it, the sepoys had to bite off the ends of lubricated cartridges. A rumour spread among the sepoys that the grease used to lubricate the cartridges was a mixture of pigs’ and cows’ lard; thus, to have oral contact with it was an insult to both Muslims and Hindus. There is no conclusive evidence that either of these materials was actually used on any of the cartridges in question. However, the perception that the cartridges were tainted added to the larger suspicion that the British were trying to undermine Indian traditional society. For their part, the British did not pay enough attention to the growing level of sepoy discontent."}, {"url": "https://link.springer.com/referenceworkentry/10.1007/978-3-319-91206-6_228-1", "page_content": "This essay examines the Indian Rebellion, or ‘Sepoy Mutiny’ of 1857, a major uprising in India in 1857–58 against the rule of the British East India Company in the country. Rather than viewing the Indian National Rebellion of 1857 as a momentary outburst, and so limiting its significance within a short historical time frame, the essay locates the ways in which the rebellion was preceded by and influenced other anti-colonial protest movements. It is suggested that in order to have a ‘holistic’ reading of the Rebellion, it is necessary to explore the period from the 1830s to the 1870s, one which witnessed colonialist expansion and also the challenges posed to British rule by a number of peasant and tribal movements in the context of exploitative and oppressive British land settlement policy. The 1857 Mutiny carried different meanings for different social classes and communities. In fact, it represented many mutinies, and any one homogeneous characterisation is grossly inadequate in capturing its multiple meanings. The essay anticipates that future historians will unearth other hidden meanings of the Mutiny by exploring new archival materials and asking different sets of questions.\n\nMichel Foucault’s journey in Discipline and Punish started with a vivid description of a spectacular case of torture near the Church of Paris in 1757. Among so many legal changes in Europe and the US, Foucault noted ‘the disappearance of torture as a public spectacle’ by the end of the 18th and the beginning of the nineteenth century (Foucault 1995: 3–8). However, British colonial rule in India signified a different trajectory of power. It enjoyed a ‘monopoly of violence’. In fact, ‘the infliction of pain as a mode of punishment was an insignia of power for the British in India’. In the context of the aforesaid modalities of British power in India, one eminent historian of the 1857 Mutiny, Rudrangshu Mukherjee, noted in his discourse multiple instances of unprecedented insurgent violence and counter-insurgency violence during and after the rebellion. The Mutiny witnessed looting, killing, and destruction by the insurgents. The targets included the British, their property, and government buildings. The punishment for the rebellion was ‘exemplary’ and ‘spectacular’ (see Mukherjee 2007: xvi, xx, 23, 36, 39). The revolt was ruthlessly suppressed as the British army moved into the rebel territories. Sepoys (native Indian soldiers) were blown off from canons, even on the mere suspicion of being involved in the Mutiny. The counterinsurgency measures included public execution of the rebels and indiscriminate burning of native villages (Bandyopadhyay 2004: 169; Metcalf 1998: 43).\n\nIt is pertinent to prepare a broad chronological catalogue of the course and extent of the rebellion before analysing its character. As the sepoys of a regiment at Meerut refused to load the new Enfield rifle in the early summer of 1857, they were sentenced to imprisonment and sent off to jail in fetters. The sight of their compatriots’ humiliation led the XI Native Cavalry, based in Meerut, to mutiny on the night of 10–11 May 1857. The mutineers then marched to Delhi where the reluctant and ageing Mughal emperor, Bahadur Shah Zafar, was installed as the symbolic head of the revolt. The revolt soon spread to the areas north and west of Delhi (Bose and Jalal 1998: 90–92). By the end of May, the rebellion had spread to Ferozepur, Muzaffarnagar, Aligarh, Naushera, Etawah, Mainpuri, Roorkee, Etah, Nasirabad, Mathura, Lucknow, Bareilly and Shahjahanpur. Between 1 and 13 June, Moradabad, Badaun, Azamgarh, Sitapur, Neemuch, Banaras, Kanpur, Jhansi, Dariabad, Fatehpur, Nowgong, Gwalior, and Fatehgarh had witnessed uprisings. There were uprisings in Hathras and Indore on 1 July (Joshi 1957: 379–380).\n\nThe spectacular subversive events connected with the 1857 Mutiny include: the rebels’ taking possession of Kanpur under the leadership of Nana Saheb; capture of Jhansi Fort, restoring power to Rani Lakshmi Bai; the rebels’ siege of the Lucknow Residency, the citadel of British power; Tatya Tope dislodging the British from Kanpur and recapturing it; Kunwar Singh capturing Arrah and Azamgarh. The tragic events in the Mutiny include: Bahadur Shah Zafar’s surrender to the British, the deaths of Kunwar Singh and Lakshmi Bai; and the hanging of Tatya Tope (Joshi 1957: 379–382).\n\nIn the aftermath of the Mutiny, the British colonial rulers gave it specific meanings through their technologies of power such as photography, memorials, and history writing. The most authoritative ‘prose of counterinsurgency’ that appeared after the revolt was the massive three-volume History of the Sepoy War in India by Sir John William Kaye. ‘Kaye’s history was not so much about the Black Man’s rising as about the White Man’s suppression of that rising’ (Amin 2007).\n\nThe Mutiny of 1857 had many dimensions. It started with the sepoys of the Bengal Army rising in revolt against the British Raj in northern India from 10 May 1857 onwards. Diverse social classes (landlords and peasants, princes and merchants) and religious communities (Hindus and Muslims) participated in the revolt, each for their own reasons. Large areas of the region remained out of British control for a year and more (Metcalf 1998: 43).\n\nThe land settlement policy introduced by the British in northern India immediately before the Mutiny adversely affected both the peasants and the landlords. British annexation of Awadh in 1856 had antagonised the sepoys of the Bengal Army, of whom several thousand recruits originated there. The revolt was preceded by around 14,000 petitions from the sepoys about the declining conditions of the peasantry and the hardships faced by them due to the summary settlements in 1856 which followed the annexation of Awadh. The landlords (taluqdars) also were adversely affected by the settlements, which led to the dispossession of a number of powerful taluqdars (Bandyopadhyay 2004: 171–173).\n\nThe Mutiny had religious dimensions. Rumours were circulated in the summer of 1857 about the cartridges of the new Enfield rifle being coated with the fat of cows and pigs, about forced conversions to Christianity, and about British intentions to disarm the sepoys. These rumours spread from village to village, from bazaar to bazaar, and from one sepoy line to another (Mukherjee 2007: 46). This testifies to the deep-rooted suspicions that prevailed between the Hindu and Muslim communities about the intentions of the British. It should be mentioned in this connection that in the post-Mutiny period the British administrators felt the urgent need to understand the minds of their native subjects. This is evident in the statement of W.W. Hunter, an eminent member of the Indian Civil Service: ‘The chronic peril which environs the British power in India is the gap between the Rulers and the Ruled’ (Hunter 2002/1871: Dedication).\n\nThe discursive field of the 1857 Mutiny is highly contested. Karl Marx, on the basis of observations made by Disraeli, characterised the Mutiny as a ‘national revolt’ (Marx and Engels 1978: 142). The nationalist historians of India have tried to appropriate it as an organic part of India’s nationalist movement. However, in the centenary year of the Mutiny, P.C. Joshi, the general secretary (1935–48) of the undivided Communist Party of India, noted large-scale peasant participation in the major sites of rebellion around Meerut and Delhi in northern India (Joshi 1957: 295). It may be mentioned in this connection that the posthumously published book of Eric Stokes, the eminent British historian of colonial India, was titled: The Peasant Armed: The Indian Rebellion of 1857 (Stokes 1986).\n\nThe question of the Mutiny’s leadership has been much debated by historians. Stokes coined the phrase ‘peasants in uniform’ to characterise the sepoys (Joshi n.d.). He argued that coming from the small land-owning families of Awadh, the allegiance of the sepoys was to the land. Consequently, the distinction between the sepoys and the peasants got blurred. Stokes identified ‘elites’ or ‘magnates’ such as taluqdars/zaminders (landlords), who had been marginalised and squeezed by the British, as leaders of the rebellion. Rudrangshu Mukherjee did not accept this interpretation. Stoke’s emphasis on magnates suggests that peasants were subordinate to or manipulated by the elites. On the contrary, Mukherjee argued, ‘peasants and clansmen could and often did act outside magnates’ initiative’ (for the debate, see Priti Joshi n.d.).\n\nNationalist leaders of diverse shades supported the 1857 rebellion. V.D. Savarkar, ‘intellectual guide to Hindu chauvinistic politics’, wrote the first full-length Indian version of the story of 1857 in his book The Indian War of Independence of 1857. He found to his ‘great surprise the brilliance of a War of Independence shining’ in the Mutiny (Savarkar 1909: vii). The great Indian revolutionary, Bhagat Singh and his comrades also regarded 1857 as a war for independence. The prominent leader of the nationalist movement and the first prime minister of independent India, Jawaharlal Nehru, wrote about the place of the rebellion in the history of British rule in India, while in Ahmednagar Fort jail (1944). He did not subscribe to the path taken by the Mutiny, but he did not deny that it ‘assumed the character of a popular rebellion and a war of independence’. It may be mentioned in this connection that the government of India led by Nehru commissioned Dr. Surendranath Sen to write a definitive history of the Mutiny on the occasion of its centenary (for diverse nationalist assessments of the rebellion, see Singh 2007: 44–66). All of this goes to show that the 1857 rebellion created an anti-imperialist spirit which touched the minds of the proponents of Hindu nationalism, liberal nationalism, as well as the revolutionary tradition of nationalism in British India.\n\nOn the occasion of the 1857 Mutiny’s 150th anniversary, historians have opened up fresh dimensions by exploring further archival materials, asking new questions and doing ethnographic research. The special issue of the Economic and Political Weekly (EPW) bears testimony to this work. In his theoretical intervention, Dipesh Chakrabarty has enlightened us about two different kinds of recall of 1857: as incitement for popular politics, and as a festive time on the national calendar. In this context, he mentioned the fact that the Forum for Democratic Initiatives in Delhi held a conference at the Gandhi Peace Foundation on 20 March 2007 on ‘1857 and the Legacy of Peasant Resistance’ with the subtitle, ‘Tebhaga, Telangana, Naxalbari and Now, Singur’. Chakrabarty argued that this is an instance of looking on 1857 as the precursor of many other rebellions to come (Chakrabarty 2007: 1695). Recent ethnographic research shows that the memory of the 1857 Mutiny has been carried in the oral folk-tale and folklore traditions of the Dalit (lower castes) in northern India. Other than establishing their own heroes and heroines, such narratives have contested the monopoly of the elite icons of the Mutiny such as Kunwar Singh, Tatya Tope, and Nana Saheb. Rani (queen) of Jhansi is the dominant woman icon in the elite discourse of the Mutiny. Ethnographic research has located stories about brave women martyrs of 1857 in the Dalit narratives, such as Jhalkaribai, Avantibai, Udadevi, and Mahaviridevi. The martyrs of Dalit communities have often been deified and are found to be worshipped by the villagers in different regions of northern India. Moreover, many Dalit icons have been incorporated in contemporary Dalit political discourses to glorify their traditions (see Tiwari 2007: 1734–1738).\n\nWilliam Dalrymple, in his presentation in December 2006, argued that earlier generations ‘have, perhaps, underplayed the power of faith and religion’ as a motive force behind the 1857 Mutiny. He drew our attention to ‘the huge weight of emphasis on this factor given in the rebels’ own documents’ (Dalrymple 2007: 37–38).\n\nThe historians of the Mutiny mostly concentrated their attentions on regions situated in the ‘Gangetic heartland’ of northern India. On the occasion of the Mutiny’s 150th anniversary, some researchers (L.N. Rana, Sanjukta Das Gupta, and Shashank Sinha) have drawn our attention to the participation of Jharkhand tribal communities in eastern India (Bhattacharya 2007: 69–142).\n\nRather than viewing the Indian National Rebellion of 1857 as a momentary outburst, and so limiting its significance within a short historical time frame, one should locate the ways in which the rebellion was preceded by and influenced other anti-colonial protest movements. It is suggested that in order to have a ‘holistic’ reading of the Rebellion, one needs to explore the period from the 1830s to the 1870s, the period which witnessed imperialist expansion and also challenges posed to the British rule by a host of peasant and tribal movements (Pati 2010: 4).\n\nThe rebellion in 1857 created a crisis of authority in the British Empire. Within weeks of its outbreak, the government of India sent a dispatch to the Cape Colony requesting an urgent transfer of troops. In addition to providing military support, the governor of the Cape Colony, Sir George Grey, assisted officials by providing financial assistance for those in India affected by the violence. In fact, the rebellion provided an opportunity for Britons throughout the world to show their loyalty to the Empire. In the wake of the uprising, colonial officials throughout the Empire expressed fears of native rebellion and justified the greater use of force to maintain British control and hegemony (Bender 2013, pp. 1–23).\n\nThe 1857 Mutiny carried different meanings for different social classes and communities. In fact, it represented many mutinies, and any one homogeneous characterisation is grossly inadequate in capturing its multiple meanings (for diverse interpretations and the historiography, see Ray and Chaudhuri (n.d.)). It is expected that future historians will unearth other hidden meanings of the Mutiny by exploring new archival materials and asking different sets of questions."}, {"url": "https://www.nam.ac.uk/subjects/indian-mutiny", "page_content": "Sign up to the National Army Museum newsletter\n\nBe the first to hear about our latest events, exhibitions and offers. Simply enter your email address below to start receiving our monthly email newsletter.\n\nTo find out more about how we collect, store and use your personal information, read our Privacy Policy."}, {"url": "https://www.cambridge.org/core/books/1857-indian-uprising-and-the-british-empire/introduction/218060F5B244D7EFD2B829A169FD41CC", "page_content": "In the early morning hours of August 6, 1857, the governor of the Cape Colony and high commissioner of South Africa, Sir George Grey, awoke to find that a ship had arrived with urgent news from India. The sepoys, Grey was informed, had mutinied. But the dire news did not end there. Not only had the Indian soldiers mutinied, but they had marched to Delhi, seized control of the town, and were “daily receiving large reinforcements” from the surrounding country. Much of northern India, it seemed, was up in arms against British power, and the governor of Bombay sought assistance before the situation worsened. Twenty-five years later, Grey could still recall his initial alarm that the rebellion posed “a great danger” to the British Empire as a whole, and that the proper response would necessitate “instantaneous changes in every part of South Africa.” Grey, the most senior colonial official in southern Africa, recognized that the impact of the 1857 uprising would not be confined to India.\n\nGrey was not alone. Ireland's Nation reported in July 1857: “The latest intelligence from India has struck terror throughout the length and breadth of the British dominions.” From Ireland to New Zealand, the revolt unnerved colonial officialdom. The commanding military officer of New Zealand's imperial forces argued that the “onslaught” would affect not only India, but also “the interest of the nation at large.” It was a revolt that “every British subject” had “an individual interest in suppressing.” And, local difficulties aside, New Zealand had a “bounden duty” to respond.\n\nIn England, the MP for Hertfordshire (and future Colonial Secretary), E. B. Lytton, sought to capture the severity of the situation by comparing it to the recent Crimean War. The “war” in India, he explained to his constituents, “is not, like the Russian war, for the assertion of an abstract principle of justice, for the defence of a foreign throne, or for protection against a danger that did not threaten ourselves, more than the rest of Europe.” Instead, he argued, “it is for the maintenance of the British Empire. It is a struggle of life and death for our rank among the rulers of the earth.” Britons throughout the empire did not dismiss the 1857 Indian rebellion as a distant crisis, with no immediate implications. Rather, they recognized the uprising as an imperial crisis, with widespread repercussions.\n\nThis book, too, acknowledges the 1857 Indian uprising as a conflict with empire-wide consequences, and traces its ramifications across Ireland, New Zealand, Jamaica, and southern Africa. In doing so, this study seeks to “decenter” the empire, demonstrating that London, although important, was not always at the center of activity. In response to the uprising, Britons throughout the empire debated colonial responsibility, methods of counter-insurrection, military recruiting practices, and colonial governance. Even after the rebellion had been suppressed, the violence of 1857 continued to have lasting effect. The fears generated by the uprising transformed how the British understood their relationship with the “colonized” and shaped their own expectations of themselves as “colonizer.” Placing the 1857 Indian uprising within an imperial context reminds us that methods of colonial rule were developed neither in one location nor by one individual, and the flows of information from one colony to another played a crucial role in shaping imperial practice.\n\nOver the following pages, my use of terminology is intentional and designed to highlight the significance of the 1857 uprising for Britons throughout the empire. For example, I frequently refer to the events of 1857–1858 as an uprising or a rebellion in order to acknowledge that they were more than a military mutiny. At times, I also refer to the uprising as simply “1857.” Certainly, the uprising, its suppression, and its impact lasted well beyond a year. Boiling the event down to one year, however, emphasizes the shock of the uprising and stresses the lasting impact of the violence on colonial attitudes. As Rudyard Kipling wrote nearly fifty years later, “They called it the Black Year” when “All earth knew, and trembled.” Finally, at times I also refer to the uprising as the “Mutiny” in order to reveal the collective ways in which colonial authorities understood and remembered the rebellion. Historians have accepted that the Indian uprising was not an aberration ; contemporaries, however, often understood 1857 as a watershed moment – a seminal event that changed their perceptions of their own imperial strength. While there were many mutinies in the history of the British Empire, there was only one “Mutiny.”\n\nThese studies and others have provided a fascinating glimpse into the widespread suspicion surrounding Indians in the wake of the uprising. Furthermore, as Kim Wagner and D. K. Lahiri Choudhury have demonstrated, fear continued to shape colonial practices in India during the second half of the nineteenth century and into the twentieth. All of these studies examine British fears surrounding Indians, specifically. This book, however, acknowledges that colonial authorities and settlers often transposed their fear of Indian rebels on to other colonized peoples. In the wake of 1857, Britons scattered throughout the colonies recognized the uprising as a colonial resistance movement, one that could be replicated most anywhere under British rule. Drawing from official documents, the correspondence of key administrators posted throughout the empire, and the publications of the colonial press, this study demonstrates that 1857 was a significant moment for the empire, unleashing lasting fear throughout the colonies.\n\nOther scholars have begun to consider the uprising's reverberations in multiple colonial sites. In particular, studies of Indian migration and transportation have provided insight into the rebellion's widespread social and economic repercussions. For example, Clare Anderson has turned to the uprising as a window into “the nature and meaning of incarceration in colonial north India.” Although her primary focus is penal practices on the subcontinent, she also examines the outcry that arose among Singapore's European population in response to proposals to transport convict-rebels to the Straits Settlements . Ultimately, Anderson concludes, colonial authorities opted to establish a penal colony in the Andaman Islands . Similarly, Marina Carter and Crispin Bates have revealed a variety of responses to the proposal to disperse the suspected mutineers throughout the British Empire. The 1857 uprising, they point out, coincided with an increase in global sugar prices and colonial authorities were as likely to view the convict-rebels as cheap labor than to see them as a threat to colonial security. The resulting debates and diverse responses, Carter and Bates argue, demonstrate the “influence of local interests over empire-wide concerns .”\n\nMuch of this research has revealed the diversity of those involved and shaped by the events of 1857–1858. With the renewed interest in imperial history, scholars have also begun to explore the colonial and global dimensions of the uprising. In various articles, chapters, and collected volumes, they have assessed the response to 1857 in Ireland, southern Africa, Australia , New Zealand , Russia , Singapore , the Caribbean, and continental Europe. Most recently, drawing inspiration from the Subaltern Studies project, the multi-volume Mutiny at the Margins has sought to invoke marginality historiographically, geographically, and socially. Of the series’ seven volumes, the second engages the most directly with the intentions of the “new imperial history ,” especially the assertion that Britain and its colonies be studied within one analytical frame. Although the chapters define marginality in a variety of ways (including, class, religion, national identity, and race), most focus on Britons, Indians, or Eurasians in Britain and India. As a result, the volume effectively reveals the “bidirectional impact and dialogic nature” of imperialism, but misses the multi-directional connections so crucial to the mid-nineteenth-century British imperial project .\n\nFollowing the event's centenary, the 1857 uprising became a subject of sustained academic attention. Historians shifted their focus from narrative accounts of the uprising to its impact, examining the lasting implications for British rule in India. Furthermore, with the development of the Subaltern Studies project, scholars moved our understanding of the rebellion from a story told through the filter of Company and military archives to one that includes local sources such as land revenue and judicial records, vernacular sources, and newspapers. The subject also captured the attention of literary and cultural studies scholars, who have addressed the cultural impact of the rebellion, recognizing its implications for notions of gender, race, popular culture, and British identity.\n\nConventionally , the historiography of 1857 coalesced around questions of causation. Britons – often with ties to either the Company's civil or military administration – began to pen histories of the uprising before the fighting had even come to an end. These first interpretations reflected existing debates regarding methods of colonial rule in India: many of the Company's civil administrators insisted that the uprising had been a mutiny, while military authorities often argued that the insurrection reflected widespread discontent. According to Gautam Chakravarty , the first Indian histories of the uprising veered little from these early British accounts and provided the authors with a means to express their loyalty to the colonial government. With the growth of Indian nationalism during the late nineteenth century, this changed. In particular, in 1909, V. D. Savarkar published his controversial work, The Indian War of Independence, 1857, which depicted the uprising as an organized, nationalist movement. Although banned in India almost until independence, Savarkar's book sparked additional nationalist accounts, and the “mutiny or war” debate continued to define histories of the uprising well into the twentieth century.\n\nOn the ground in India, South Asians became increasingly eligible for low-level government positions, allowing them to be involved in the functioning of the state – particularly at the local level. It was thought that having Indian input into policies would minimize future chances of rebellion. Economically, the British moved toward a system of direct taxation and land policies favorable to landlords and cultivators. Militarily, the Crown assumed control of the Company's regiments and established a new Indian Army , officered entirely by Europeans. Furthermore, the British took control of the artillery, increased the number of European regiments, decreased the number of Indians in the army, and shifted their recruiting efforts to regions that had remained loyal to the British. Socially, the changes reflected British distrust of the Indians and an effort both to improve surveillance of and avoid intervention in Indian cultural practices. Many of these changes were announced throughout India via the Queen's Proclamation (1858) , in which the British also assured their South Asian subjects that they were not looking to enlarge their territorial holdings and would uphold the rights and customs of India's traditional leaders when administering the law .\n\nWhether one pointed to the cartridges, the military, the East India Company, or the missionaries to explain the uprising, many concluded that the British knew little about their Indian subjects. These interpretations revealed a “gap in knowledge” between the Company and Indian society. As Tony Ballantyne has argued, it quickly became “clear to most British that the rebellion represented a failure to understand the native mind .” In response, authorities introduced a series of political, economic, and military changes designed to strengthen British control and diminish the possibility of another uprising. Politically, the Government of India Act (1858) abolished the East India Company and consolidated control in the hands of the Crown . After 1857, a Crown viceroy took the leadership position once held by a governor-general. Additionally, a member of the British cabinet acted as secretary of state for India and exercised control over Indian affairs, effectively replacing the Company's board of directors.\n\nIn the aftermath of the rebellion, colonial authorities expressed concern that the Enfield rifle was only one demonstration of the Company's lack of cultural awareness. Beginning in the 1820s, the Company had introduced legislative measures designed to reform Indian economic and social practices and introduce policies of Anglicization ; the reform impulse increased under the leadership of Lord Dalhousie during the 1840s and 1850s. Following the uprising, these reform measures were subjected to significant criticism as colonial authorities argued that Company interference in Indian social practices and customs had encouraged unrest. Similarly , support for Christian missionaries also waned. Initially, the Company had discouraged efforts to proselytize directly to the Indians, arguing that such practices would disrupt or damage commercial interests and trade relations. Revisions to the East India Company charter in 1813 and again in 1833 relaxed Company policy, however, and ended many of the restrictions on missionary activities. By 1857, missionaries and the colonial state had begun to collaborate on reform projects. As a result, when the uprising erupted in 1857, European missionaries found themselves subject to blame. For those skeptical of the missionary enterprise and reform impulse, the 1857 Indian uprising appeared an inevitable rejection of Christianity. Indians were cast as religious fanatics, who missionaries had pushed toward a conversion for which they were not yet prepared. In doing so, the missionaries had destroyed the trust established between the British and their Indian subjects. As James Graham , a member of the Commissariat, explained to his sister in July 1857: “Yes, my dear Sarah, know yourself and let all your friends know that by your subscriptions to missionaries you are purchasing the murders of your friends and relations .”\n\nThe cartridge affair provided a convenient explanation for the rebellion, one that did not openly challenge the legitimacy of British colonial control or validate Indian unrest. Still, questions emerged regarding the East India Company, and its military practices and methods of administration came under scrutiny. The Company, critics argued, had become so complacent in its rule that military authorities had taken the sepoys for granted and failed to maintain a disciplined military or civil base. As a result, by 1857, the Indian Army was rumored to consist of discontented sepoys under the incompetent leadership of “gout-ridden invalids of seventy.” Similarly, the Company's administrative rule in India had become increasingly “impersonal and remote.” According to Frederick Sleigh Roberts , Company officials rarely left the boundaries of Calcutta and lacked any knowledge of those individuals under their control. The very decision to issue the Enfield rifle in an environment ripe with unrest showed little awareness of the Indians’ beliefs or their growing discontent.\n\nAfter the rebellion had been suppressed, many Britons were consumed by questions of what had gone wrong in India. The realization that the sepoys, “all thought so faithful and true,” had rebelled against their European officers shocked many and elicited widespread discussion and debate on why the uprising had occurred and how future rebellions might be avoided. Initially, many blamed the unrest on British plans to distribute the Enfield rifle among Indian regiments. First manufactured in 1853, the Enfield rifle represented a technological improvement. To simplify the loading process, the bullet and powder had been combined into a single paper cartridge , one end of which was coated with grease to protect the cartridges from the elements and improve the loading process. To load the gun, a soldier had to bite off one end of the cartridge, pour the powder into the muzzle, and then push the bullet down into the barrel. As the manufacturers reportedly used beef or pork tallow to grease the cartridges, this loading process posed a problem for both Hindu and Muslim soldiers. For Hindus, any contact with beef fat would result in pollution; Muslims, on the other hand, were strictly forbidden to eat pork. The uprising, many authorities argued, began in response to these religious insults and any civil revolt that followed was nothing more than the effect of mob mentality.\n\nWith the fall of Delhi in September 1857, the tides began to turn in Britain's favor. During the following months, British authorities took Bahadur Shah Zafar captive and hanged twenty-one of his sons for their involvement in the uprising. Following the recapture of Delhi , the British were free to focus their efforts on regaining control of Lucknow , where Europeans and loyal Indians were under siege in the British Residency. Although assistance arrived in September, British troops did not successfully evacuate the Residency until November, and the city itself remained in rebel hands until March 1858. Regardless, the November relief of Lucknow persuaded the British that they had regained the upper hand and they shifted their attention from suppressing the uprising to rebuilding British control. Officially, the British declared the fighting over in July 1858; sporadic guerrilla warfare, however, continued to challenge their power .\n\nThe 1857 Indian rebellion was recognized at the time (and remembered) as an extraordinarily violent conflict during which both sides committed horrific atrocities. For the British, the Cawnpore massacre was often at the center of these memories, as many argued that it exemplified the cruel tendencies of the sepoys – illustrating “all that an Indian imagination could conceive of horrible bestiality.” The British, for their part, destroyed entire villages rumored to have ties to the rebels. They hanged Muslims with pork stuffed into their mouths and forced Hindus to lick the bloodstains from various sites, including the Bibighur at Cawnpore. Additionally, British troops blew mutineer-rebels from guns – a method of punishment that not only made identification difficult and decent burial nearly impossible, but also demonstrated British control over Indian bodies. As Frederick Sleigh Roberts , a young subaltern at the time of the uprising, noted: “The death that seems to have the most effect is being blown from a gun. It is rather a horrible sight, but in these times we cannot be particular.” Indeed, British officials would require other Indians to watch the execution by cannon. Sprayed with the blood and bone of the killed individual, the message was not lost on observers. According to the memoirs of Esther Anne Nicholson, the practice “seemed at the time a somewhat cruelly severe sentence, but probably those in authority were even then aware that a dangerous spirit of disaffection was wide-spread among the native troops throughout India and considered it necessary to make an example to overawe others.” While the atrocities committed at the hands of the Indians allegedly reflected the barbaric nature of the colonized, those committed by the British were explained as purely reactive and the only legitimate way to reestablish control.\n\nThe rebels, who often outnumbered the small British garrisons, experienced considerable success during the early months of the uprising. Most famously, in June 1857, the European garrison at Cawnpore surrendered to their Indian opponents with the understanding that all survivors would be permitted safe passage to Allahabad via the Ganges. The rebel commander, Nana Sahib , and his followers ambushed the Europeans as they were boarding the boats, however, killing nearly all of the men and taking approximately two hundred women and children captive. Two weeks later, as British troops approached, the rebels killed the women and children and deposited their remains in a nearby well. The events at Cawnpore immediately went down in the annals of the British Empire as a striking example of Indian barbarity. For example, Surgeon A. D. Home was still en route to India when he received word of the killings. On board ship, anchored off the coast of India, he reported that the massacre was “uppermost in everyones [sic] mind.” Two months later, he had the opportunity to visit the scene, concluding that “Altogether, it had a most saddening effect on one to think that our shame was still unavenged.” Throughout the empire, the Cawnpore massacre provided the British the impetus for retribution and seemingly justified the already growing use of brutal force.\n\nUnrest among the sepoys of northern India, which had been apparent for months, erupted in rebellion on May 10, 1857, when troops stationed at Meerut turned against their European officers. Within twenty-four hours, the mutineers had marched the thirty-six miles to Delhi, taken control of the city, and secured the support of additional regiments. The mutineers’ capture of the former capital of the Mughal Empire was as much a symbolic success as a military victory. Upon their arrival in the city, the mutineers declared the aged heir to the Mughal throne, Bahadur Shah Zafar , to be the emblematic leader of the uprising. The rebellion spread from Delhi – both demographically and geographically – as peasants, artisans, laborers, and others joined the fighting.\n\nThe British Empire and 1857: networks, people, and places\n\nBy the mid-nineteenth-century, Britain's imperial holdings were extensive and growing. Furthermore, these territories were home to a large number of people. There was no one response across this vast space to the Indian uprising. Even in India, many Indians did not rebel and there were reports of Europeans assisting those who did. The responses to 1857 were similarly varied throughout the colonies. This study does not pretend, or even seek, to uncover all of the individual reactions to the violence in India in 1857. Instead, I focus on the response of colonial officials, located in particular colonial sites, for insight into the impact of the 1857 Indian uprising on notions of colonial rule and imperial power. What follows is an explanation of my methodology, designed to capture a cross-section of the mid-nineteenth-century British Empire.\n\nIn recent years, scholars have turned to the study of webs, networks, and systems to understand the interconnected nature of the British Empire. Such studies have much to offer, allowing historians to move beyond the binary model of metropole and periphery to examine, instead, multiple sites across the empire. Furthermore, these studies have revealed the multiplicity of forces involved in the construction and maintenance of Britain's empire. A host of economic, political, and cultural networks permitted people, ideas, and resources to flow from one disparate location to another. These links existed at a variety of levels – from kinship networks to trade organizations – and often united the empire as an imagined community or multiple communities. As Zoë Laidlaw, Alan Lester, and David Lambert have reminded us, however, these networks began and ended with people. For example, individuals followed career opportunities from one colony to another and, as they did so, they carried with them ideas shaped by previous colonial experiences. As a result, ideas regarding race and colonial governance “were not simply exported from the imperial centre” nor were they “imported from the periphery.” Instead, as individuals moved across colonial boundaries, they regularly compared colonial sites and situations, and in doing so they developed transimperial ideas.\n\nMuch of my research has focused on three key individuals in the nineteenth-century empire: Sir George Grey, Edward John Eyre, and Sir Hugh Rose (Lord Strathnairn). All three individuals were active in colonial administrations in 1857 and afterwards, and, as they moved from one colonial site to another, they drew conclusions regarding imperial subjects and proposed methods and policies designed to respond to disaffected populations. Grey has already appeared in this study. Having received a military education at Sandhurst, his first appointment was to Ireland during the 1830s. He is predominantly remembered, however, as one of the most prominent colonial governors of the nineteenth century. In 1857, as governor of the Cape Colony and high commissioner of South Africa, he contributed regiments, horses, and artillery to British efforts in India. Following his success in the Cape Colony, he was reappointed governor of New Zealand, where he was renowned for his response to the wars of the 1860s. Edward John Eyre was born in England, but, as a young man, migrated to Australia where he achieved distinction as an explorer during the 1830s. Soon after, he began his career in the colonial service as Grey's lieutenant-governor in New Zealand; at the time of the 1857 uprising, he was lieutenant-governor of the island of St. Vincent. Eyre is most widely known for his controversial handling of the 1865 Morant Bay rebellion while governor of Jamaica. The event became a cause célèbre in Britain, and ultimately ended Eyre's colonial career. Finally, Sir Hugh Rose served in the British Army during the 1857 uprising, and quickly made a name for himself as an effective leader. He was appointed commander-in-chief of the Bombay Army in 1860, then commander-in-chief of the Indian Army three months later. As the rumbles of Fenian unrest grew louder, Rose was named commander-in-chief of Ireland – a position he held until he retired in 1870.\n\nTracking these men through archives in the United Kingdom, Ireland, South Africa, and New Zealand has uncovered a wealth of material on the colonial response to the 1857 Indian uprising. The Colonial Office records at the National Archives in the United Kingdom revealed that colonial officials in distant colonies were not only aware of the 1857 uprising, but were contacting London to offer assistance to British efforts in India. Research trips to Ireland, South Africa, and New Zealand provided insight into the ways in which the uprising was understood outside of Britain and India and the widespread fear that the rebellion might encourage unrest in other colonial regions. The correspondence in these archives revealed that colonial officials communicated directly with one another regarding India, and did not always contact London first. Finally, this project also draws from the colonial press, which has provided insight into the ways in which the rebellion was reported in each of the colonies in 1857, and the ways in which it was recalled during later crises.\n\nIn addition to the individuals, the locations examined in this study are equally important to my argument. This book focuses on the repercussions of the uprising in four different colonial sites: Ireland, Jamaica, southern Africa, and New Zealand. Each of these locations represented a significant British colonial possession in the nineteenth century. They were sites that were on Britain's formal imperial map. At the same time, however, they were also sites of significant unrest. Each of these colonies experienced its own colonial crisis in 1857 or during the following decade. The political and cultural variations of the four colonial sites, thus, provide an interesting cross-section of the British Empire. The shared colonial crises offer insight into the ways in which the Indian rebellion penetrated and informed colonial experiences elsewhere in the empire. Below, I have provided a very brief history of each colony in the years before and after 1857. In particular, I have highlighted the European arrival, the British political presence, and the often strained relationship between colonizer and colonized.\n\nIreland Ireland's very status as a colony has received significant academic attention. Historians appear to readily accept Jamaica, the Cape Colony, and New Zealand as historical sites of British conquest. Ireland's engagement with the British Empire has sat uneasily with many scholars, however. Initially, much of this academic discomfort stemmed from Ireland's changing political relationship with Britain. By the close of the seventeenth century, English, Scottish, and Welsh settlers had spread across much of the island and English legal, political, and administrative norms were in place. Similarly, “all landed and commercial transactions were now recognizably English.” During the eighteenth century, Ireland had its own parliament, suggesting a degree of autonomy. Yet, as Thomas Bartlett has pointed out, this was not unique to Ireland; at the time, representative institutions also existed elsewhere in the British Empire. The Irish Parliament met infrequently and, with the exception of a brief period during the 1780s and 1790s, exercised little power and was frequently dismissed by English politicians as a subordinate assembly. The Act of Union (1801) changed this political arrangement. Passed by both the Irish and British parliaments, the legislation abolished the 300-member Irish Parliament and, instead, allotted approximately 100 seats at Westminster for Irish MPs. As a result, throughout the nineteenth century and into the twentieth, Ireland appeared to be a part of the United Kingdom. The Act of Union, however, did not ensure that Ireland would become Britain's equal partner. Economic and administrative integration failed to accompany the political change, and questions regarding control over trade, currency, and taxation remained. Furthermore, the island continued to be administered by a chief secretary and a lord lieutenant based in Dublin, an executive arrangement that later influenced British rule in post-1857 India. Although subject to British colonial rule, the Irish played a prominent role in the expansion of Britain's empire. From the eighteenth century onward, Irish soldiers, administrators, medical doctors, policemen, clergy, missionaries, lawyers, and settlers surfaced throughout the empire in disproportionately high numbers. They assisted in the administration, defense, population, and spiritual upkeep of Britain's imperial territories and constructed economic, political, and cultural networks of their own. Initially, many scholars considered the history of the Irish as both a conquered and conquering people to be problematic, and deemed Ireland's position within the British Empire to be paradoxical or contradictory. Kevin Kenny has dismissed these claims, commenting: “Colonized by their more powerful neighbour, the Irish lived at the heart of the world's greatest Empire; most Irish people saw themselves as part of that Empire in some way; many participated, at a variety of levels, in its workings overseas. There is no contradiction here, merely a fact of imperial history.” Indeed, the same can be said of most people within the British Empire, whether they were born in London, Dublin, Meerut, or Dunedin. More recently, scholars of Irish studies have largely accepted Ireland's history as that of a colony; or, as Michael de Nie has concluded, they have acknowledged that “Ireland's relationship with Britain shared at least some features with those of the dominions and colonies.” At the same time, however, scholars of the new imperial history have not been as inclined to incorporate Ireland into comparative studies of imperialism. This book recognizes Ireland as an integral part of the nineteenth-century British Empire – with individuals who supported as well as resisted the imperial connection. Indeed, Ireland reminds us that the very concepts of “colonizer” and “colonized” were not always obvious; instead, they were constructed and reconstructed, often during moments of conflict. When the uprising erupted in India, the situation in Ireland appeared similarly volatile to many observers. Less than ten years earlier, Ireland had suffered a prolonged series of famines, during which the island's population had been nearly halved at the hands of death and emigration. Britain's maladministration of Ireland during the famine years famously fueled Irish nationalist efforts. One decade later, these nationalist movements continued to flourish as individuals adopted the Indian struggle as evidence of widespread opposition to British imperial rule. At the same time, exhausted by the famine years and facing dwindling land prospects, many Irish continued to turn to British imperial service for financial opportunities and social advancement. For example, although Ireland's population accounted for 20 percent of the United Kingdom in 1857, approximately 40 percent of Britain's European regiments in India were Irish. Similarly, that same year, Irish universities were responsible for 33 percent of the Indian civil service recruits. Questions regarding Ireland's relationship to Britain and the empire were not resolved with the suppression of the Indian uprising. Instead, the decade following 1857 was a busy one for Irish nationalists and, consequently, also for their opponents. Throughout the late nineteenth century and into the twentieth, Irish nationalist movements (republican and parliamentarian) continued to grow in strength and numbers, and many Irish nationalists looked to India for collaborative support and further evidence of British misrule.\n\nJamaica Like Ireland, Jamaica had long felt the British presence. The British seized the island from Spanish control during the mid-seventeenth century as a part of Oliver Cromwell's “Western Design.” Shortly after, in 1662, the island's governor established an elected House of Assembly and nominated Legislative Council. Under the political arrangement, the governor continued to represent the Crown, but the Assembly exercised significant control over legislation and taxation. Jamaica's House of Assembly remained the “operative premise” of the island's government for the following two hundred years. Throughout the eighteenth century, Jamaica was among the most lucrative colonies of the expanding British Empire. Together, the West Indies accounted for approximately 40 percent of the transatlantic sugar shipments to Europe in 1700, 30 percent during the mid-eighteenth century, and 60 percent in 1815. Such numbers were not inconsequential; sugar represented Britain's single largest import from the 1750s to the 1820s. Jamaica's most prosperous years were 1740 to 1775, during which the total value of the island's economy increased by more than 300 percent and its slave and sugar plantations more than doubled in number. Indeed, with the island's increasing economic dependence on sugar came a corresponding labor dependence on slavery. As a result, the “black” to “white” ratio was approximately twelve to one, and, by 1815, another segment of the population, “free people of colour,” had also grown significantly in number and in influence. Despite the island's demographics, throughout the eighteenth and nineteenth centuries, Jamaica continued to be politically dominated by local and absent “white” planters. If the eighteenth century represented Jamaica's heyday, the nineteenth century represented the colony's decline. The Napoleonic Wars resulted in a post-war economic slump and, from 1816, the price of sugar steadily decreased. In the 1840s, once protective tariffs on sugar had been repealed, sugar prices collapsed completely. Alongside the economic crisis was a corresponding labor crisis. Following the abolition of slavery during the 1830s, planters actively sought to recruit European laborers, both to replace the former slaves and also to offset the colony's racial imbalance. Despite these efforts, more often than not indentured laborers were drawn from distant locations within the British Empire – especially India. When sugar prices not only rebounded, but escalated in 1857–1858, colonial producers increased cane production and heightened recruiting efforts. In particular, colonial officials throughout the empire debated transporting suspected mutineers and disbanded sepoys from India to the sugar colonies. Although authorities ultimately decided against the proposal, opting instead to develop a penal settlement on the Andaman Islands, Indians continued to represent a significant portion of the indentured laborers destined for the West Indies during the latter half of the nineteenth century. Furthermore, Europeans remained the minority in Jamaica – a reality that generated considerable concern among the “white” population. The economic difficulties, island demographics, and political atmosphere led to significant unrest. Riots and rebellions were not uncommon in the West Indies, nor were they restricted to the pre-emancipation era. This unrest informed British notions of identity and influenced their expectations of the racialized “other.” As Elizabeth Kolsky has posited, the “lawless” response to slave resistance in the Caribbean set a precedent for “how slaves and ‘niggers’ could and should be treated,” permitting a similar resort to “white” violence in India. Kolsky's study focuses on the use of “everyday” violence in India – the micromoments, she explains, when “the violence central to the workings of empire” was most evident. Yet, as this study demonstrates, macromoments, such as the 1857 Indian uprising, also dramatically shaped the accepted use of force in the colonies. In the following chapters, particularly Chapter 5, I examine the lessons of violence absorbed by the British during the 1857 uprising and applied to later colonial conflicts, including the Morant Bay rebellion in Jamaica.\n\nSouthern Africa The British did not begin to establish themselves in southern Africa in any significant numbers until 1820, when a government-sponsored emigration scheme recruited some four thousand settlers to the colony. Even then, over the following decades, southern Africa's European population increased only gradually and sporadically. The colony's territorial holdings, however, grew extensively over the same period – doubling between the mid-1830s and the mid-1850s. The British presence, as a result, increasingly stretched beyond the formal boundaries of the Cape Colony and encroached upon Xhosa ancestral lands. The outcome was one of constant conflict. From 1779 to 1879, the Xhosa fought nine wars with the European settlers, Dutch as well as British. In 1847, following their success in the War of the Axe, the British established British Kaffraria as a “security buffer” between the settlers and the Xhosa – an answer that likely created more problems than it solved. Indeed, the majority of the Xhosa communities were placed under the control of the newly annexed region, and only the Gcaleka Xhosa remained independent. War erupted again on the eastern frontier in 1850. The imperial scorched-earth policy devastated the region; many Xhosa were forced into migrant labor by the dire economic situation, and the power of the chiefs continued to decline. Colonial policy further weakened Xhosa power. In 1856, the colonial governor, George Grey, introduced his “native policy” and magistrate system, in which a special European magistrate was appointed to each of the Xhosa chiefs. The system, Grey explained, was designed to introduce British norms and laws to southern Africa, and to guide the Xhosa toward “advancement.” Or, as one colonial official later recalled, it provided a method to depose the chiefs, “who by their wars had done so much harm to the whole country, and had cost England such large sums of money.” Grey's magistrate system effectively removed judicial authority from Xhosa hands, undermining the chiefs’ power and control. The Xhosa responded to these economic and political pressures with a millenarian movement, during which they slaughtered 400,000 cattle in preparation for a prophesied ancestral resurrection. The Cattle-Killing of 1856–1857 is among the most tragic stories of colonial history in southern Africa, and it will be further discussed in later chapters. For now, it is sufficient to say that approximately 40,000 Xhosa died from the resulting famine, and those who survived began to enter the Cape Colony in search of relief. The influx of Xhosa, however, only heightened the tensions between the colonists and the Africans. These tensions, in turn, surfaced in the political arena. In 1853, the colony had adopted representative political institutions, but not full responsible government. While both the House of Assembly and the Legislative Council consisted of elected members, Crown officials were also permitted to participate in parliamentary debates (although they could not vote). Despite the representative institutions, the colonists occasionally expressed concerns regarding the seemingly endless power of the governor. The constitutional status of British Kaffraria, in particular, raised concern. The Cape Colony governor exercised relatively unlimited and certainly undefined power as the high commissioner of South Africa. He answered only to the British government and, as most colonial governors knew, “they were thousands of miles and many months away.” Furthermore, the high commissioner was not required to attend to the concerns of the settlers on the eastern frontier of the colony, where the British were most likely to come into contact with the Xhosa. Owing to their distance from Cape Town, settlers in places like Grahamstown and elsewhere on the Eastern Cape frequently felt disconnected from the colony's political institutions. And, when the high commissioner ignored their concerns, they also felt at a loss in local affairs. The result was considerable tension – between the governor and the colonists, between the colonists in Cape Town and those on the Eastern Cape, and between the colonists and the Xhosa. By the mid-nineteenth century, in other words, the Cape Colony stood in a position of significant unrest and colonial officials often looked to the larger empire to make sense of local events or disorder. This was particularly true of Grey, who – as will be explored in later chapters – frequently pointed to 1857 to explain and “justify” his response to colonial conflicts in southern Africa.\n\nNew Zealand Although several stories suggest there were earlier European visits to New Zealand, the first documented expedition occurred in 1642 under the leadership of the Dutchman, Abel Tasman. The expedition was short and, from the perspective of the Dutch, it was also a failure. Local Maori attacked one boat, killing three individuals and fatally wounding another. In response, the Dutch quickly left without establishing any presence or trade relations – although, as one historian has noted, they did not leave before naming the bay “Murderers” and declaring the Maori “enemies.” Following Tasman's departure in January 1643, Europeans did not reappear for more than a century. In 1769, British interest in the region was piqued by the scientific voyages of James Cook of the British Royal Navy who circumnavigated and mapped the islands. The late eighteenth-century expeditions incorporated New Zealand into the commercial and cultural networks of Britain's growing empire. Over the following half-century, British whaling, sealing, and missionary communities established stations on both the North and South islands. In 1840, Britain formally annexed New Zealand as a colony of the British Empire. British settlement of New Zealand began in earnest during the 1830s, although there was some debate regarding the appropriate nature of this expansion. Missionary communities initially resisted a formal British presence, fearing it would prove fatal to Maori, but later advocated the development of a Protestant protectorate designed to resist French encroachment. Others, most notably Edward Gibbon Wakefield, advocated a method of “systematic colonization.” According to Wakefield, the colony's social structure needed to recreate that of Britain, without the highest and lowest stratums. Adherents of the plan argued that it would benefit both Britain and New Zealand, relieving the metropole of its excess population and surplus capital and providing the colony with much-needed labor and resources. In 1837, Wakefield and his supporters established the New Zealand Association (which quickly became the New Zealand Company) and proposed that land be purchased cheaply from Maori and sold at a profit to immigrants and investors. Starting in 1840, the New Zealand Company founded numerous settlements according to Wakefield's design. That year also witnessed a significant growth in the Pakeha (European) population. In 1830, approximately 300 Pakeha called New Zealand “home”; by 1840, that number was closer to 2,000. Within twenty years, the Pakeha population had increased to 59,000, and outnumbered that of the Maori by nearly 3,000 individuals. The population explosion did not slow down. Instead, scholars have estimated that the non-Maori population reached more than 250,000 during the gold rush years of the mid-nineteenth century. This massive growth in the colony's European population facilitated British control, and also fueled conflict between Pakeha and Maori communities. In 1840, both Maori and Pakeha notables had signed the Treaty of Waitangi, designed to clarify future relations in the colony. Unfortunately, there was no one copy of the document. Instead, the leaders presented, discussed, and approved multiple versions – in both the English and Maori languages. As a result, while many now recognize the treaty as “the founding document of New Zealand as a bi-cultural society,” the various translations and interpretations of the document have been and continue to be heavily debated. Much of this discussion has focused on the definition and conception of “sovereignty.” The English text, many have argued, acknowledges a complete “transfer of power.” The Maori text, on the other hand, “predicates a sharing of power and authority in the governance of the country between Crown and Māori.” The very introduction of the treaty reveals a British effort to obtain Maori consent or acceptance of the settler presence. This effort is understandable given that in 1840 the Maori continued to outnumber the non-Maori in the colony. The British effort to gain approval, however, should not be confused with an effort to establish complete equality between the colony's two main communities. In 1840, the British assumption that European norms were superior to Maori customs remained intact. As Alan Ward has explained, “though a superior kind of barbarian the Maori was a barbarian nevertheless, not capable, without tutelage at least, of exercising actual command, co-equally with settlers, of British-style governmental and legal institutions.” As a result, throughout the early nineteenth century, settlers welcomed Maori leaders into only the most menial positions in colonial society. In particular, some argued that military service provided the ideal means to secure settler respect for the Maori and Maori loyalty to British institutions. As one individual reportedly commented in 1840, only months after the Treaty of Waitangi had been signed, “I suppose that they [the Maori] might be trained to act with the same fidelity as so many Seapoys [sic].” Yet, as in India, military service did not guarantee devotion to British norms. Like the sepoys and the British, the Maori and the British came to odds with each other. Violent clashes and large-scale conflicts characterized much of the 1840s. And, although 1847 to 1860 was relatively peaceful, Maori resistance adopted a more organized, pan-tribal form with the establishment of the Maori King Movement in the 1850s. Fighting again erupted in March 1860 and continued with relative consistency until 1872. Initially, the wars of the 1860s were fought between imperial troops and the Maori of the North Island. Following the withdrawal of imperial troops in 1865–1866, the fighting continued between Pakeha and Maori. As is true in most conflicts, however, the sides were never entirely black and white. Throughout every stage of the New Zealand wars, the imperial troops and Pakeha benefited from the assistance of kupapa, or “loyal” Maori. Indeed, as the conflict drew to a close, New Zealand settlers and officials sought to reward the states’ “native” allies and, simultaneously, anchor traditional leaders to the colonial government – policies likely shaped by those introduced in post-1857 India. As this study will demonstrate, the Indian uprising informed methods of both conciliation and coercion adopted in the final years of the New Zealand conflict."}, {"url": "https://www.nam.ac.uk/explore/decisive-events-indian-mutiny", "page_content": "Centres of revolt\n\nFollowing the outbreak of the Indian Mutiny at Meerut in May 1857, uprisings occurred across northern and central India. The main centres of revolt were Delhi, Cawnpore, Lucknow, Jhansi and Gwalior.\n\nFor over a year the British struggled to retain their rule during a bloody and often cruel campaign that witnessed atrocities by both sides."}, {"url": "https://www.nam.ac.uk/explore/why-did-indian-mutiny-happen", "page_content": "East India Company\n\nIn the mid-19th century, India was very different from the nation state we know today. It didn't exist as a country, but instead consisted of different territories controlled by a variety of rulers. The greatest of these was the British East India Company which governed two thirds of the subcontinent.\n\nOriginally formed in 1600 purely to trade with the Mughal Empire, the Company needed to secure its commercial posts at Calcutta, Bombay and Madras. It purchased land from Indian rulers to build its settlements on, and recruited native armed forces to protect them. Eventually, these evolved into the Bengal, Bombay and Madras Armies."}, {"url": "http://www.southasianist.ed.ac.uk/article/view/230", "page_content": "The 1857-59 Indian Uprising was a cataclysmic event in the history of the British Empire in India and would witness monumental and shocking scenes of violence on both sides of the conflict. The Uprising has become something much debated and discussed within Indian and British history, and an exploration of the fundamental brutality of the conflict, albeit in this case on the British side, is an important element of better understanding such an important historical event. This article therefore explores the British Army's use of violence against Indian Sepoys and ordinary civilians during the Uprising and works to explore as to whether this approached something akin to a genocide, as has previously been suggested.\n\nReferences\n\nPrimary Sources:\n\n\n\nCharles Griffiths, A Narrative of the Siege of Delhi (London: John Murray) 1910\n\n\n\nField-Marshal Earl Roberts, Letters Written During the Indian Mutiny (London: Macmillan) 1924\n\n\n\nHenry Metcalfe, The Chronicle of Private Henry Metcalfe (London: Cassell) 1953\n\n\n\nGeneral Neill’s orders to Major Renaud in John William Kaye, Lives of Indian Officers: illustrative of the history of the civil and military services of India (London: A. Strahan) 1867\n\n\n\nGeneral Neill’s personal letter dated August 1st 1857 in The London Times, Monday, Sep 28, 1857; pg. 8; Issue 22797 from The Times Digital Archive Online\n\n\n\nField-Marshal Earl Roberts, Letters Written During the Indian Mutiny (London: Macmillan) 1924\n\n\n\nJulia Haldane, The Story of Our Escape from Delhi in 1857 (Agra: Brown and Sons)\n\n\n\nReginald Wilberforce, Unrecorded Chapter of the Indian Mutiny: being personal reminisces of Reginald G. Wilberforce compiled from a diary and letters written on the spot, with illustrations (London: John Murray) 1894\n\n\n\nSelections from the letters, despatches and other state papers from the Government of India, 1857-58 (Calcutta: Military Dept. Press) 1893\n\n\n\nThomas Lowe, Central India During the Rebellion of 1857 and 1858 (London: Longman, Green & Co.) 1860\n\n\n\nThomas Marshman, Memoirs of Major General Sir Henry Havelock (London: Longman, Green & Co.) 1860\n\n\n\nTorture Commission Report in Investigation of Tortures in India in On Colonialism (Moscow: Foreign Languages Publishing House) 1960\n\n\n\nThe Times, Thursday, Sep 17, 1857; pg. 9; Issue 22788 from The Times Digital Archive Online\n\n\n\nGeneral Neill’s personal letter dated August 1st 1857 in The London Times, Monday, Sep 28, 1857; pg. 8; Issue 22797\n\n\n\nWilliam Forbes Mitchell, Reminisces of the Great Mutiny, 1857-59 (New Delhi: Asian Education Services) 2002\n\n\n\nWilliam Russell, My Indian Mutiny Diary (New York: Klaus Reprint Co) 1957\n\n\n\n\n\nSecondary Sources:\n\n\n\nAdam Jones, Genocide: A Comprehensive Introduction (London: Routledge) 2006\n\n\n\nAmaresh Misra in The Guardian, Friday 24 August 2007 http://www.guardian.co.uk/world/2007/aug/24/india.randeepramesh\n\n\n\nAnna Bourke, An Intimate History of Killing: face to face killing in twentieth century warfare (London: Granta Books) 1999\n\n\n\nBernard S. Cohn, ‘Representing Authority in Victorian India’ in The Invention of Tradition, Eric Hobsbawm and Terence Ranger (eds.) (Cambridge: Cambridge University Press) 1992\n\n\n\nCaroline Elkins, Britain’s Gulag: The brutal end of Empire (London: Jonathon Cape) 2005\n\n\n\nCrispin Bates, Subalterns and Raj: South Asia Since 1600 (London: Routledge) 2007\n\n\n\nCrispin Bates and Gavin Rand, Mutiny at the Margins: New Perspectives on the Indian Uprising of 1857: Volume 4: Military Aspects of the Indian Uprising (Sage Publications: 2013)\n\n\n\nDavid Andersen, Histories of the Hanged: Britain’s dirty war in Kenya and the end of empire (London: Weidenfeld and Nicholson) 2005\n\n\n\nDenis Judd, The British Imperial Experience, from 1765 to the present (London: Harper Collins) 1996\n\n\n\nDonald Bloxham, The Final Solution: A Genocide (Oxford; New York: Oxford University Press) 2009\n\n\n\nElizabeth Kolsky, Colonial Justice in British India (Cambridge: Cambridge University Press) 2010\n\n\n\nGavin Rand ‘Martial races’ and ‘imperial subjects’: violence and governance in colonial India, 1857–1914. European Review of History 2006, 13 (1), pp. 1-20\n\n\n\nHannah Arendt, The Origins of Totalitarianism (London: World Publishing Company) 1961\n\n\n\nHannah Arendt, On Violence (New York: Harcourt, Brace Jovanovich) 1970\n\n\n\nJohn William Kaye, Lives of Indian Officers: illustrative of the history of the civil and military services of India (London: A. Strahan) 1867\n\n\n\nJohn Newsinger, The Blood Never Dried: A People’s History of the British Empire (London: Bookmarks) 2006\n\n\n\nKarl Marx & Friedrich Engels, Investigation of Tortures in India in On Colonialism (Moscow: Foreign Languages Publishing House) 1960\n\n\n\nMartin Shaw, What is Genocide? (Cambridge: Polity Press) 2007\n\n\n\nMichel Foucault, Discipline and Punish (London: Allen Lane) 1977\n\n\n\nNigel Collett, The Butcher of Amritsar: General Reginald Dyer (London: Hambledon & London) 2005\n\n\n\nOtto Triffterer (2001). ‘Genocide, Its Particular Intent to Destroy in Whole or in Part the Group as Such’ Leiden Journal of International Law, 14, pp. 399­408\n\n\n\nRichard Gott, Britain’s Empire: Resistance, Repression and Revolt (London: Verso Books)\n\n\n\nRudrangshu Mukherjee, “Satan Let Loose Upon the Earth” The Kanpur Massacres in India in the Revolt of 1857’ Past and Present (1990) 128(1): 92-116\n\n\n\nSamuel Totten & Paul R. Bartrop (eds.), The Genocide Studies Reader (London: Routledge) 2009\n\n\n\nSashi Bhusan Chaudhuri, Theories of the Indian Mutiny, 1857-59: a study of the views of an eminent historian on the subject (Calcutta: World Press) 1965\n\n\n\nSabyasachi Bhattacharya (eds.) Rethinking 1857 (New Delhi: Orient Longman) 2007\n\n\n\nWilliam A. Schabas (2001). ‘The Jelisic Case and the Mens Rea of the Crime of Genocide’ Leiden Journal of International Law, 14, pp. 125­139"}, {"url": "https://www.bbc.co.uk/history/british/victorians/indian_rebellion_01.shtml", "page_content": "Imperial authority examined In May 1857 soldiers of the Bengal army shot their British officers, and marched on Delhi. Their mutiny encouraged rebellion by considerable numbers of Indian civilians in a broad belt of northern and central India - roughly from Delhi in the west to Benares in the east. For some months the British presence in this area was reduced to beleaguered garrisons, until forces were able to launch offensives that had restored imperial authority by 1858. Shock inevitably stimulated much self-examination... British public opinion was profoundly shocked by the scale of the uprising and by the loss of life on both sides - involving the massacre by the rebels of captured Europeans, including women and children, and the indiscriminate killing of Indian soldiers and civilians by the avenging British armies. Shock inevitably stimulated much self-examination, out of which emerged an explanation of these terrible events; this explanation has exercised a powerful influence over opinion in Britain ever since. Indians were assumed to have been a deeply conservative people whose traditions and ways of life had been disregarded by their British rulers. Reforms, new laws, new technology, even Christianity, had been forced upon them. They found these deeply offensive and were driven to resist them with violence. Top\n\nA history in two halves The lesson that the British drew from 1857 was that caution must prevail: Indian traditions must be respected and the assumed guardians of these traditions - priests, princes or landholders - were to be conciliated under firm authoritarian British rule. Thus British Indian history in the 19th century is often divided into two halves, separated by the great watershed of 1857: an age of ill-considered reform, followed by an age of iron conservatism. Conservatism was eventually to provoke a different form of reaction, the nationalism out of which modern India was to be born. ...what the British intended and what they were able to achieve were often very different things. There are, however, serious difficulties in any interpretation of 19th-century Indian history that divides it into an age of reform that gave way under the shock of rebellion to an age of conservatism. This may in a very rough sense reflect the intentions of India's British rulers, but what the British intended and what they were able to achieve were often very different things. Outcomes depended as much on the inclinations and efforts of Indian people as on the initiatives of their rulers. Top\n\nBefore the rebellion In the first half of the 19th century, when the East India Company still ruled India on Britain's behalf, there was a heady rhetoric of reform and improvement in some British circles. The aspiration of Thomas Macaulay - a member of the Company's ruling council in 1835, as well as a historian - to foster 'a class of persons, Indian in blood and colour, but English in taste, in opinions in morals and in intellect' is often quoted. Less often quoted is his preceding sentence, in which he admitted that 'it is impossible for us, with our limited means, to attempt to educate the body of the people'. The means of the Company's government were indeed limited. The greater part of its resources went on its armed forces, not on schemes for improvement. An insecure government of necessity moved cautiously, in spite of its rhetoric, and at the time the Indian economy was generally stagnant. The authority of Brahmins and of doctrines of caste separation grew stronger, not weaker. European influences were strongest in the towns of India. This was especially true in the old bases of British trade, such as Calcutta, Madras or Bombay, where a new Indian intelligentsia had begun to take root. Whatever the British may have intended, their early rule seems generally to have consolidated the hold of what they regarded as 'traditional' intellectuals, rather than displacing them by new ones, and the authority of Brahmins and of doctrines of caste separation grew stronger, not weaker. In the countryside the vital issues were the control of the land, the amount of tax the peasant farmers had to pay, and the opportunities they had to find outlets for their surplus crops. Early British occupation was disruptive: aristocracies lost power and influence to the new rulers, the conditions under which land was held could be changed, and taxation was more rigorously enforced. It took time for winners to emerge in this situation, people who had been able to extract gains from the new order, and who would compensate for those who had lost out. Top\n\nDisaffection Any attempt to explain the revolt of 1857 as traditional India's rejection of modern reform is far too crude. Impulses towards change before then had been weak and uneven. In Bengal and in the south, which had long been under British rule, there were no revolts. In the areas that did rebel in 1857, the British seem to have succeeded in creating disaffection, and deposed noble Indians from their thrones, without as yet attracting significant support. To be a soldier in the Bengal army had become an occupation to which high status was attached. In the most recent British acquisition of all, the kingdom of Awadh (Oudh), annexed in 1856, not only had the ruler been deposed but many landowners had lost control over what they regarded as their estates. Taxes were high throughout the region, and there were few opportunities for the enterprising to make a profit. Western influences were limited in the towns, but the first Christian missions had appeared there, and new colleges had opened, which seemed to be an unwelcome intrusion to many devout Hindus and Muslims. They also fed fears of a Christian offensive and of forced conversions. Northern India had a long tradition of spasmodic disorder and resistance to government. These upheavals would probably have become more intense in the mid 19th century, but could have been contained if the British had not alienated a group of people on whom their security depended. These people were the soldiers, or sepoys, of the Bengal army, whose mutiny eventually set off the 1857 rebellion. The Bengal army was recruited not from Bengal itself but from northern India, especially from Awadh. To be a soldier in the Bengal army had become an occupation to which high status was attached. The sepoys saw themselves as an élite. Over many years the Bengal army had fought faithfully for the British, but on their own terms. They would not go overseas and they required an elaborate train of camp followers, and by 1857 the British high command was losing patience with this. Supplies of more flexible soldiers who would not stand on their privileges were becoming available in Nepal and the Punjab, and the Bengal army was told it must modernise - by accepting obligations to serve outside India, and by using a new rifle. The spark that ignited the soldiers' great fear - that their cherished status was to be undermined - was the rumour concerning the use of pig and cow fat, forbidden in the Muslim and Hindu religions respectively, as lubricant on the cartridges for the new rifles. Cantonment after cantonment rebelled. When the soldiers refused to acknowledge British authority, the way was left open for disaffected princes and aristocrats, and for village and town people with grievances, to revolt alongside the soldiers. Top\n\nA new royal government After the rebellion had been put down, the new royal government of India that replaced that of the East India Company promised that it had no intention of imposing 'our convictions on any of our subjects'. It distanced itself further from the Christian missionaries. A stop was put to the deposing of princes, and greater care was shown to the rights of landlords. The major part of the army was in future to be drawn from so-called 'martial races'. The huge parades, or durbars, at which the new empress of India received the allegiance of the hierarchies of traditional India through her viceroy, seemed to symbolise the new conservatism of the regime. To be a soldier in the Bengal army had become an occupation to which high status was attached. Yet beneath the trappings of conservatism, Indian society changed much more rapidly in the second half of the 19th century than it had done in the first. The British had much more to offer Indians. Imports of Western technology had been limited before the 1850s. Thereafter a great railway system was constructed - 28,000 miles of track being laid by 1904 - and major canal schemes were instituted that more than doubled the area under irrigation in the last 20 years of the century. The railways, the vastly increased capacity of steamships, and the opening of the Suez Canal linked Indian farmers with world markets to a much greater degree. A small, but significant, minority of them could profit from such opportunities to sell surplus crops and acquire additional land. Some industries developed, notably Indian-owned textile manufacturing in western India. The horrific scale of the famines of the 1880s and 1890s showed how limited any economic growth had been, but the stagnation of the early 19th century had been broken. Universities, colleges and schools proliferated in the towns and cities, most of them opened by Indian initiative. They did not produce replica English men and women, as Macaulay had hoped, but Indians who were able to use English in addition to their own languages, to master imported technologies and methods of organisation and who were willing to adopt what they found attractive in British culture. The dominant intellectual movements cannot be called Westernisation. They were revival or reform movements in Hinduism and Islam, and were the development of cultures that found expression in Indian languages. Within the constraints of a colonial order, a modern India was emerging by the end of the 19th century. British rule of course had an important role in this process, but the country that was emerging fulfilled the aspirations of Indians, rather than colonial designs of what a modern India ought to be. Top\n\nFind out more Books Aftermath of the Revolt: India 1857-1870 by Thomas R. Metcalf (Princeton, 1964) Awadh in Revolt, 1857-1858: A Study of Popular Resistance by Rudrangshu Mukherjee (Delhi, 1984) 'India 1818-1860: The Two Faces of Colonialism' by D. A. Washbrook, published in Andrew Porter, ed., The Oxford History of the British Empire, III, The Nineteenth Century (Oxford, 1999) Modern South Asia: History, Culture, Political Economy by Sugata Bose and Ayesha Jalal (London, 1998) The New Cambridge History of India, II. 1, Indian Society and the Making of the British Empire by C. A. Bayly (Cambridge, 1988) The Peasant Armed: The Indian Revolt of 1857 edited by C. A. Bayly (Oxford, 1986) Links The Oriental and India Office Collections in the British Library provides access to material relating to all the cultures of Asia and North Africa and the European interaction with them. The National Army Museum, Chelsea has information specifically about the Indian mutiny. The Royal Military Academy, Sandhurst, has a permanent exhibition on the Indian army. Places to visit The British Empire and Commonwealth Museum, Clock Tower Yard, Temple Meads, Bristol, BS1 6QH, will open its galleries on 26 September 2002. There will be a temporary exhibition, called 'India: Pioneering Photographs, 1850-1900' during 2002. Meanwhile, inquiries to see the collections of photographs and documentary archives or to use the oral history archive are welcome (telephone: 0117 925 4980). Top"}, {"url": "https://spartacus-educational.com/Jrussell.htm", "page_content": "William Howard Russell\n\nWilliam Howard Russell was born in Tallaght, Ireland, on 28th March 1820. His father, John Russell (1796–1867) was a Protestant and his mother, Mary Kelly (1803–1840), a Roman Catholic. In the early years of William's life his father's business failed and he moved to Liverpool.\n\nRussell was educated at private schools in Dublin. As a fifteen year old he attempted unsuccessfully to join the army. In October 1838 he entered Trinity College. Although an able student he left in 1841 without a degree in order to work for his cousin, Robert Russell, a journalist reporting on the Irish General Election. Later that year he moved to London.\n\nIn 1842 Russell became a teacher of mathematics at Kensington Grammar School. He also did some freelance writing for The Times. The editor, John Thadeus Delane, was impressed by his work that by 1843 he was employed full-time by the newspaper. This included reporting the trial of Daniel O'Connell for sedition. He also covered the subject of Railway Mania.\n\nIn 1845 he joined the staff of The Morning Chronicle. Russell held conservative political views and in April 1848, he enrolled as a special constable against the Chartists. Later that year he rejoined The Times. According to his biographer, Roger T. Stearn: \"In June 1850 he was called to the bar at the Middle Temple, but never applied himself enough to succeed, though it was some years before he ceased to take an occasional brief. In 1850 he accompanied the Schleswig-Holstein forces in their campaign against the Danes and was present at the decisive Danish victory of Idstedt (25 July). Convivial and amusing company, Billy Russell spent much time at clubs, especially the Garrick, and enjoyed brandy, billiards, and whist.\" He also became friends with Charles Dickens, William Makepeace Thackeray and Douglas Jerrold.\n\nJohn Thadeus Delane, sent Russell to cover the Crimean War. He left London on 23rd February 1854. After spending time with the army in Gallipoli and Varna, he reported the battles and the Siege of Sevastopol. He found Lord Raglan uncooperative and wrote to Delane alleging unfairly that \"Lord Raglan is utterly incompetent to lead an army\".\n\nRoger T. Stearn has argued: \"Unwelcomed and obstructed by Lord Raglan, senior officers (except de Lacy Evans), and staff, yet neither banned, controlled, nor censored, Russell made friends with junior officers, and from them and other ranks, and by observation, gained his information. He wore quasi-military clothes and was armed, but did not fight. He was not a great writer but his reports were vivid, dramatic, interesting, and convincing.... His reports identified with the British forces and praised British heroism. He exposed logistic and medical bungling and failure, and the suffering of the troops.\"\n\nHis reports revealled the sufferings of the British Army during the winter of 1854-1855. These accounts upset Queen Victoria who described them as these \"infamous attacks against the army which have disgraced our newspapers\". Prince Albert , who took a keen interest in military matters, commented that \"the pen and ink of one miserable scribbler is despoiling the country.\" Lord Raglan complained that Russell had revealed military information potentially useful to the enemy.\n\nRussell reported that British soldiers began going down with cholera and malaria. Within a few weeks an estimated 8,000 men were suffering from these two diseases. When Mary Seacole heard about the cholera epidemic she travelled to London to offer her services to the British Army. There was considerable prejudice against women's involvement in medicine and her offer was rejected. When Russell publicised the fact that a large number of soldiers were dying of cholera there was a public outcry, and the government was forced to change its mind. Florence Nightingale volunteered her services and was eventually given permission to take a group of thirty-eight nurses to Turkey.\n\nRussell's reports led to attacks on the government by the the Liberal M.P. John Roebuck. He claimed that the British contingent had 23,000 men unfit for duty due to ill health and only 9,000 fit for duty. When Roebuck proposal for an inquiry into the condition of the British Army, the government was passed by 305 to 148. As a result the Earl of Aberdeen, resigned in January 1855. The Duke of Newcastle told Russell \" It was you who turned out the government\".\n\nWhen he arrived back in England he was treated like a national hero. In 1856 Trinity College awarded him an honorary degree. On the advice of Charles Dickens he went on a very financially successful lecture tour on the Crimean War. It is estimated that during this period he received £1,600 for his talks. Russell also published The War: from the Landing at Gallipoli to the Death of Lord Raglan (1856). This was followed by a series of books on military matters.\n\nIn December 1857 John Thadeus Delane sent Russell to report on the Indian Mutiny and to investigate rebel atrocities. Roger T. Stearn points out: \"Russell... accompanied Sir Colin Campbell (Lord Clyde), who welcomed and assisted him, on the 1858 campaign, and narrowly escaped being killed by a rebel. Russell criticized British snobbery as well as attitudes to and treatment of Indians, and advocated leniency and conciliation. His Times articles were attacked by the Anglo-Indian press. Delane attributed the cessation of indiscriminate executions to Russell's first report from Cawnpore.\"\n\nIn 1861, The Times sent Russell to cover the American Civil War. He was paid the amazing sum of £1,200 a year and expenses. He opposed slavery and supported the Union Army. However, his criticism of their tactics at Bull Run he was forbidden to accompany the army. He returned to England in April 1862. He retired in 1863 and received a pension of £300 a year from the newspaper. However he continued to work for them on a freelance basis. This included the Franco-Prussian War (1870-71). As private secretary to Prince of Wales (later George V), he went to South Africa in 1879.\n\nThroughout this period he edited and owned the Army and Navy Gazette. In the newspaper he advocated army reforms, breech-loading artillery, and conscription. He also worked as a freelance writer for the Daily Telegraph. He was considered the best reporter in England and could command very high fees for his work. On the recommendation of Lord Rosebery he was knighted in 1895.\n\nRoger T. Stearn has argued: \"He was about 5 feet 7 inches, portly, with blue eyes. He had a pleasant baritone and retained his Irish brogue. In the Crimea and India he was bearded, later only moustached. Latterly he was overweight. Sociable, affectionate, charming, lively, amusing, and a raconteur... He was brave, impulsive, moved by indignation and pity, and sometimes outspoken. However, he was sometimes careless, unfair, and - as apparently with Raglan - motivated by a personal grudge. He continued to spend much time at his clubs, which included the Carlton and the Marlborough, and he ate and drank much. Despite his post-Crimea substantial income, he spent extravagantly and was repeatedly in debt.\"\n\nStearn adds: \"Though only a small minority of his working life was spent reporting wars, Russell's greatest achievement was as a war correspondent, a term he disliked. Though not the first person to report a war for a newspaper, in the Crimea he established the concept and credibility of the war correspondent and strong public support for the role. Largely because of him war correspondence emerged as a new branch of journalism, and he largely set the pattern for British war correspondents.\"\n\nWilliam Howard Russell died at his home, 202 Cromwell Road, Kensington, on 10th February, 1907."}, {"url": "https://www.britannica.com/event/Indian-Mutiny/Aftermath", "page_content": "Aftermath\n\nThe immediate result of the mutiny was a general housecleaning of the Indian administration. The East India Company was abolished in favour of the direct rule of India by the British government. In concrete terms, this did not mean much, but it introduced a more personal note into the government and removed the unimaginative commercialism that had lingered in the Court of Directors. The financial crisis caused by the mutiny led to a reorganization of the Indian administration’s finances on a modern basis. The Indian army was also extensively reorganized.\n\nAnother significant result of the mutiny was the beginning of the policy of consultation with Indians. The Legislative Council of 1853 had contained only Europeans and had arrogantly behaved as if it were a full-fledged parliament. It was widely felt that a lack of communication with Indian opinion had helped to precipitate the crisis. Accordingly, the new council of 1861 was given an Indian-nominated element. The educational and public works programs (roads, railways, telegraphs, and irrigation) continued with little interruption; in fact, some were stimulated by the thought of their value for the transport of troops in a crisis. But insensitive British-imposed social measures that affected Hindu society came to an abrupt end.\n\nFinally, there was the effect of the mutiny on the people of India themselves. Traditional society had made its protest against the incoming alien influences, and it had failed. The princes and other natural leaders had either held aloof from the mutiny or had proved, for the most part, incompetent. From this time all serious hope of a revival of the past or an exclusion of the West diminished. The traditional structure of Indian society began to break down and was eventually superseded by a Westernized class system, from which emerged a strong middle class with a heightened sense of Indian nationalism."}], "John Russell was approximately 30 years old": [{"url": "https://kids.britannica.com/students/article/John-Russell/276818", "page_content": "Courtesy of the National Portrait Gallery, London\n\n(1792–1878). The English statesman and Whig leader Lord John Russell entered politics at an early age. He was 21 years old when he became a member of Parliament. He became prime minister at 54.\n\nRussell, son of the duke of Bedford, was born on Aug. 18, 1792, in London, England. He was educated at the University of Edinburgh in Scotland. Russell is remembered primarily for the part he played in the passage of the Great Reform Act of 1832. The Tory duke of Wellington had been forced to resign as prime minister because he was opposed to the reform of Parliament. The Whigs (later called the Liberals) then came into power with Earl Grey as prime minister. Russell was given the task of championing the reform bill, which did away with the “rotten boroughs” (where few or no people lived) and gave representatives to the new manufacturing cities, which had not been represented in Parliament. The House of Lords rejected it. Elections were held, and excited mobs demanded that the bill be passed in its entirety. Finally the Lords were forced to yield because of the threat that enough Whig peers would be created to give the Whigs a majority.\n\nRussell’s share in the great political and humanitarian reforms that followed was unimportant. No great laws were passed in his first term as prime minister (1846–52), and his second term (October 1865–June 1866) was too short to allow him to accomplish anything. By this time he had lost much of his popularity. The mismanagement that marked Great Britain’s entrance into the Crimean War (1854–56) was blamed on him. He retired in 1866, and William Gladstone became Liberal party leader.\n\nRussell had a great interest in literature and spent much of his time after his retirement writing. He died at Pembroke Lodge, in Surrey, on May 28, 1878."}, {"url": "https://www.britannica.com/biography/John-Russell-1st-Earl-Russell", "page_content": "John Russell, 1st Earl Russell, also called (until 1861) Lord John Russell, (born Aug. 18, 1792, London, Eng.—died May 28, 1878, Pembroke Lodge, Richmond Park, Surrey), prime minister of Great Britain (1846–52, 1865–66), an aristocratic liberal and leader of the fight for passage of the Reform Bill of 1832.\n\nRussell was the third son of John Russell, 6th Duke of Bedford. (As the younger son of a peer, he was known for most of his life as Lord John Russell; he himself was created earl in 1861.) He thus came of a family that had long demonstrated its public spirit. The depth of his liberalism probably owed much to an untypical education. Poor health forbade the rigours of an English public school, and later, his father, who was critical of the Universities of Oxford and Cambridge, sent him to the University of Edinburgh, where he drank deeply of Scottish philosophy.\n\nIn 1813 he became a member of Parliament and four years later made his first important speech—characteristically, an attack on the government’s suspension of the Habeas Corpus Act. In December 1819 Russell took up the cause of parliamentary reform, making it in the early 1820s not only his own cause but also that of the Whig Party. When the Whigs came to power in 1830, he joined the small ministerial committee that was to draft a reform bill, and on March 31, 1831, he presented it to the House of Commons. Overnight, he had won a national reputation.\n\nIn the 1830s and ’40s, Russell remained the chief promoter of liberal reform in the Whig Party—although never again, perhaps, was this role so glorious as in the protracted but successful conflict over the passing of the first Reform Bill. As paymaster general under Charles Grey, 2nd Earl Grey, during roughly the first half of the 1830s, Russell championed the cause of religious freedom for both English Dissenters and Irish Roman Catholics. Indeed, he pursued these aims so zealously that, in seeking to divert some of the wealth of the established Church of Ireland (which was Protestant) to the Roman Catholics (who formed the bulk of the population), he frightened such leading Whigs as Lord Stanley (later Earl of Derby) out of the party. In the second half of the 1830s, as home secretary under Lord Melbourne, Russell, among other things, democratized the government of large towns (with the exception of London). He also reduced the number of criminal offenses liable to capital punishment and began the system of state inspection and support of public education.\n\nEven out of office from 1841 to 1846, when he stood in opposition to Sir Robert Peel, Russell left his mark. In 1845, in advance of his party, he came out in favour of total free trade, a crucial step in forcing Peel to follow him. As a result Peel split his party, the Whigs came to power, and Russell became prime minister.\n\nThis administration (1846–52) demonstrated that, although Russell’s penchant for advanced ideas was as strong as ever, his ability to implement them was now seriously reduced. He was able to establish the 10-hour day in factory labour (1847) and to found a national board of public health (1848). But, largely because of party disunity and weak leadership, he was unable to end the civil disabilities of the Jews, extend the franchise to the workers in the cities, or guarantee security of tenure to the Irish farmers.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn the remaining years of his public career, Russell’s difficulties increased. Party disunity continued and brought down his second administration (1865–66) when he made his last attempt to extend the franchise. But more significant, in the 1850s the national temper had changed. An age of reform had given way to a mood of self-complacency, even of belligerence. This was already evident in the Ecclesiastical Titles Act of 1851, which Russell’s government had passed and which in effect was England’s defiance of the papacy.\n\nThis mood deepened, transformed, on the one hand, into an appetite for foreign conquest and, on the other, into boredom with social and political reform. In such an atmosphere Russell was inevitably overshadowed by the forceful and popular Lord Palmerston, who seized the forefront of the national stage in the Crimean War (1854–56). Indeed, for four years, from 1855 to 1859, Russell retired from public life and devoted more and more of his time to literature. Private life had always beckoned to him, as had the life of a litterateur. Among the English prime ministers, few wrote so copiously—biography, history, poetry—as Russell. He accepted an earldom in 1861, and he died at Pembroke Lodge, Richmond Park, in 1878."}, {"url": "https://www.theartstory.org/critic/russell-john/", "page_content": "Summary of John Russell\n\nKey Ideas / Information\n\nRussell did not believe that genius was an innate quality; rather it was a quality that was nurtured and educated. All great works of art may only come about once the artist has studied and evolved over time.\n\nWhen new art forms arrive, many consider them replacements for the old, but for Russell, this simply was not the case. Any new worthwhile artwork is directly influenced by its predecessors, and it was new art, more than anything else, that kept the Old Masters alive and relevant.\n\nWhen it came to art criticism, Russell believed that every artist, no matter what their medium or technique, is worthy of receiving the same degree of attention and diligence in a review. While some work is naturally better than others, Russell was never mean-spirited in any of his writings, even if a work of art wasn't in his favor.\n\nChildhood\n\nEarly years\n\nMiddle years\n\nLater years and death\n\nLegacy\n\nTHEORY:\n\nIntro to Russell's Art Theory\n\nRussell on America and New York City\n\nRussell on Action Painting\n\nRussell on Abstraction and the \"New York School\"\n\nRussell on post-Abstract art\n\nWriting style\n\nARTISTIC INFLUENCES\n\nBelow are Canaday's major influences, and the people and ideas that he influenced in turn.\n\n\n\nARTISTS J.M.W. Turner Georges Seurat Edward Hopper Stuart Davis Wassily Kandinsky CRITICS/FRIENDS Honore de Balzac Henry James Charles Dickens Clement Greenberg Harold Rosenberg MOVEMENTS Impressionism Post-Impressionism Art Nouveau Cubism Surrealism John Russell Years Worked: 1950 - 2006 ARTISTS David Hockney Howard Hodgkin Anselm Kiefer Philip Guston Jeff Koons CRITICS/FRIENDS John Richardson Lewis Hyde T.J. Clark Robert Rosenblum MOVEMENTS Conceptual Art Minimalism\n\nBelow are Canaday's major influences, and the people and ideas that he influenced in turn.\n\nQuotes\n\n\n\nJustin Wolf Content written by:\n\n\n\nJohn Russell was an art historian and critic who wrote for thefrom 1950-1974, then for thefrom 1974-1990, coming on board immediately after the departure of John Canaday. Although seldom cited in the annals of Abstract Expressionist history, Russell's work as a critic was crucial to the continued enthusiasm for modern art well into the 1970s and 80s. Known paradoxically as a tough-minded critic who was nevertheless, perhaps a little too lenient when it came to newer movements in art, Russell wore two masks as an art critic: He was a champion of newer, younger artists like David Hockney and Howard Hodgkin, and was also an accomplished scholar of the Impressionists and subsequent modern movements.Raised by his grandparents in London, Russell attended St. Paul's School and then moved on to study philosophy and economics at Magdalen College at Oxford, where he earned his B.A. in 1940.Russell was interning at the Tate Gallery when the Germans bombed London during the Blitzkrieg of 1940. He was then evacuated to the country town of Worcestershire.Between 1942 and 1945, Russell served in the British Admiralty for the Naval Division. While serving, Russell met the author and journalist Ian Fleming (famous for creating the James Bond novels), who recommended Russell to theas a book reviewer. Now with the, Russell began his career as a professional critic, covering not only books but also art, theater and music.In 1950, the art critic for thewas fired for writing a negative review of an exhibition at the British Royal Academy, and Russell was subsequently promoted to chief art critic. That same year, he also became a corresponding art critic for theDuring the 1950s, Russell took on a diverse and vast amount of writing assignments, and published several books, including a travel book on Switzerland in '50, a biography of the classical Austrian conductor Erich Kleiber in '56, and a history of the city of Paris in 1960.Between 1958 and 1968, Russell sat on the art panel of the Arts Council of Great Britain. During this time, the critic played an integral role in curating several exhibitions, including three at the Tate in London (Modigliani, Rouault, and Balthus), and one at the Hayward Gallery in London ().In 1965, Russell wrote a book on Seurat, which many consider to be his best work. A few years later, in 1971, Russell oversaw a traveling exhibition devoted to Vuillard that went from Toronto to Chicago and ended in San Francisco.In 1974, Russell was recruited by thechief art critic Hilton Kramer (who had replaced John Canaday) to move to the U.S. and become a resident art critic. Russell would later become the chief art critic in 1982, a position he held until 1990.In 1975, Russell got married (for a third time) to Rosamond Bernier, an art critic and editor for the Paris magazine, who had recruited Russell to write for the magazine back in the mid-50s. They were married in Philip Johnson's famous Glass House in New Canaan, CT. Pierre Matisse (Henri's son) was the best man, and Leonard Bernstein wrote the wedding march.Russell may have left his chief critic post at thein 1990, but this was no retirement. He continued writing for the, as well as several guest reviews for theBetween 1981 and 2006 Russell edited theon behalf of The Century Association, a New York organization of some two-thousand authors and artists.He died in a Bronx nursing home in 2008 at the age of 89.Russell was not well-known for his prowess as an art historian or scholar, but his work as a critic and author suggest a vast catalogue of knowledge, not to mention an undying appreciation for art in all its forms. He had the unique ability to look at something and instantly know who and what inspired the artist. As a writer, he was quick-witted, elegant and extremely learned, and above all, he communicated the message that all great art is connected by its ability to give generation after generation a sense of who they are.Russell was remembered by artists and other art writers as someone who paid very close attention to the smallest of details and the grandest of visions and, according to the artist Howard Hodgkin, he \"was very determined to make his own criticism as valuable as possible, which meant never selling an artist short by conferring easy or less than deserved praise on his work.\"Much like Baudelaire in 1840, Russell recognized that in his time, new art was being produced at an ever-accelerating rate. As the modern world continued racing ahead, people discovered new needs, and many turned to art to meet those needs. Russell wrote: \"In art, equally, we had needs which could not be satisfied by the Old Masters, because those needs did not exist when the Old Masters were around.\" While there are critics who inevitably reach an end-point where all new art ceases to appear relevant or even good, as was the case with Harold Rosenberg and arguably Robert Hughes, Russell was quite different. For all the greatness of the Old Masters, he felt obliged to appreciate new art because, as history had taught him, when there's a need that can only be satisfied by the beauty of a Munch or Kandinsky, looking at a Manet simply will not do.Like the rest of the art world, Russell clearly saw that no uniquely American art movement had been able to sustain itself prior to 1945. But what fascinated the critic was justAmerica redefined itself in terms of the arts and modernism after World War II. Russell looked deep into American cultural and literary lore to find the roots of modern art, citing Thoreau's, Whitman's, Eliot's, and the various writings of Poe, all as chief precursors to the modern visual revolution that came about in the mid-20th century.In the section of his bookentitled, Russell wrote: \"It would have been difficult, in any case, for American painters to rival the epical assurance with which both Whitman and Melville addressed themselves to an expanding America.\" What changed all of this, in Russell's view, was New York City's arrival as the capital of modern art production, for both native-born Americans and people like himself; emigrants who flocked to New York to become part of the burgeoning art world. \"There are,\" wrote Russell, \"as many New Yorks as there are New Yorkers. New York is a self-devouring, self-renewing city, with which we come to terms as best we can. It is one of the supreme subjects of our century: one for which we would wish Balzac, Dickens and Proust to have been born again.\"Russell didn't believe that Action Painting's arrival as a leading American art form was merely a coincidence, nor did he completely share Harold Rosenberg's view that it was the product of improvised action from the artist's unconscious (a belief that led many to conclude Action Painting was melodramatic and self-indulgent). Russell looked further back in time to pinpoint Action Painting's relevance. \"It arose from an intelligent examination,\" wrote Russell, \"on the part of people who had been serious artists for nearly half a lifetime, as to just why so much of European painting had run itself into the ground. And it stood for an idea current in public life also: that human nature had not said its last word.\"In the paintings of de Kooning, Rauschenberg, Still, and others, Russell shared Rosenberg's view of Action Painting's evolution. These images were \"generated by the very act of applying the paint, without conscious reference to anything in the world outside the studio and with concessions to the divide which once separated painting from drawing, foreground from background and light from shadow.\" But Russell firmly believed there was something learned and psychologically profound in these images; an expressive force that had sprung out of years and years of studying Kandinsky, Klee and Léger.Russell wrote of the Abstract Expressionists: \"To speak of them as 'a school' is a matter more of convenience than of historical truth. Yet one thing was common to all of them, and common to most thinking people in the late 1940s: a feeling of 'either/or.' In art, as in so many other departments of life, humanity was being given a fresh start. It was time to stand up and be counted; the question at issue was (or seemed to be)a decisive shift in sensibilitya genteel continuance.\"Russell was not content to group artists like Johns and Rauschenberg with others like Pollock and de Kooning. He saw greatness in all their works, but believed it inaccurate to place them in the same movement or \"school.\" Whereas the so-called Action Painters (Pollock and de Kooning) had supposedly blocked out the world outside the studio in order to work their canvases, there were others who welcomed the world into their work. In writing about Rauschenberg, Russell said: \"He saw it as the function of the artist to work with what is given; and in paintings .. he sieved the dredged filth of New York City as a prospector sieves the sand of the riverbed: for gold.\"As Pop art made its way onto the scene in the late 1950s, Russell saw yet another new occasion for optimism in American modern art. In his writings on Warhol, Lichtenstein and Rosenquist, Russell said, \"There was in Pop art an element of exorcism. It was made to banish evil memories, or to hoist them to a level on which they would lose their power to degrade.\"But Russell's optimism stretched far beyond the boundaries of Pop or Op art. He was always excited by how modern art constantly reinvented itself, and found new ways to draw from historical influences, yet avoided becoming tired and repetitive. New experiments in the application of space and color (found in the works of Morris Louis and Kenneth Noland), and the use of new instruments in art (installation, landscapes, found objects, etc.) were all things that motivated the critic to keep writing and praising art as modernism faded and postmodernism arose, long after the writings of critics like Greenberg and Rosenberg had ceased being relevant.In particular, Russell was a huge champion of David Smith, who the critic claimed \"may have been the last major artist to have an absolutely explicit, constructive and sanguine conception of the future of art.\" While it's true that Russell appeared to have loved just about everyone (in reality this is an overstatement), he reserved his greatest praise for those select few who represented the complete artist; one who embodied the past, present and future of Modern art.Russell was revered for his talent as a natural writer. He wrote in a very persuasive, witty tone that his readers found comforting and relatable. Unlike hispredecessor, John Canaday, Russell was not a controversial writer. In fact, some have criticized Russell for being too accepting of most forms of Modern art, and not being critical enough. (There are moments while reading Russell when one may get the impression that he liked just about every work of art he came in contact with.) But the supposed mystery behind Russell's ubiquitous praise was his very keen eye, and a mind that seemed to be its own reference library. Whenever he looked at something, it seemed as though he accessed a dozen or so other works of art. He saw influences right away; nothing was without precedent.Writing in a rhythmic and elegant style that is reminiscent of Gertrude Stein or his fellow countryman Roger Fry, Russell's primary objective in his writing wasn't to promote the arts that were already popular, but to draw well-deserved attention to some of the lesser-known artists in whose work he saw great potential.\"Art in New York was one of the driving, generative forces in the city's cultural life.\"\"It is the highest function of art to tell us who we are.\"\"Modernism is not something that can be learned step by step, like bookkeeping.\"\"I think that art should be allowed to go private. It should be a matter of one-on-one. In the last few years, the public has only heard of art when it makes record prices at auction, or is stolen, or allegedly withheld from its rightful owners. We need to concentrate more on art that sits still some place and minds its own business.\"\"It is difficult in the United States of America to make a mystique of something that has neither social status nor academic status and doesn't make any money.\""}, {"url": "https://www.wikiart.org/en/john-peter-russell/", "page_content": "John Peter Russell (16 June 1858 – 30 April 1930) was an Australian impressionist painter. Born and raised in Sydney, Russell moved to Europe in his late teenage years to attend art school. A \"man's man\", popular with other students, Russell befriended fellow pupil Vincent van Gogh, and painted the first portrait of the future world-famous artist, now held at the Van Gogh Museum. Van Gogh maintained correspondence with Russell throughout his life. Russell's work was also admired by the French Impressionists, with whom he often painted. Russell returned to Sydney in old age, where he died. His works are held in major galleries in his home country and in Europe.\n\nJohn Peter Russell (16 June 1858 – 30 April 1930) was an Australian impressionist painter. Born and raised in Sydney, Russell moved to Europe in his late teenage years to attend art school. A \"man's man\", popular with other students, Russell befriended fellow pupil Vincent Van Gogh, and painted the first portrait of the future world-famous artist, now held at the Van Gogh Museum. Van Gogh maintained correspondence with Russell throughout his life. Russell's work was also admired by the French Impressionists, with whom he often painted. Russell returned to Sydney in old age, where he died. His works are held in major galleries in his home country and in Europe.\n\n\n\nJohn Peter Russell was born at the Sydney suburb of Darlinghurst, the eldest of four children of John Russell, a Scottish engineer, his wife Charlotte Elizabeth, née Nicholl, from London. J. P. Russell was a nephew of Sir Peter Nicol Russell. After his father's death J. P. Russell enrolled at the Slade School of Fine Art, University College London, on 5 January 1881 and studied under Alphonse Legros for three years. Russell then went to Paris to study painting under Fernand Cormon. His fellow students there included Henri de Toulouse-Lautrec and Émile Bernard. Russell was a man of means and, having married a beautiful Italian, Marianna Antonietta Mattiocco, he settled at Belle Île off the coast of Brittany, where he established an artists' colony. He would have 11 children with Mattiocco, of whom six survived.\n\n\n\nRussell had met Vincent van Gogh in Paris and formed a friendship with him. Van Gogh spoke highly of Russell's work, and after his first summer in Arles in 1888 he sent twelve drawings of his paintings to Russell, to inform him about the progress of his work. Claude Monet often worked with Russell at Belle Île and influenced his style, though it has been said that Monet preferred some of Russell's Belle Île seascapes to his own. Due to his substantial private income Russell did not attempt to make his pictures well known.\n\n\n\nIn 1897 and 1898 Henri Matisse visited Belle Île. Russell introduced him to impressionism and to the work of van Gogh (who was relatively unknown at the time). Matisse's style changed radically, and he would later say \"Russell was my teacher, and Russell explained colour theory to me.\"\n\n\n\nRussell's daughter, Madame Jeanne Jouve, known in Paris as a singer, has stated that he had built up a collection of impressionist works – van Gogh, Gauguin, Bernard, Guillaumin – which he intended to give to Australia, but none is known to have survived beyond his death. In 1907, Marianna Russell died in Paris. Grief-stricken, Russell buried her next to his home and destroyed 400 of his oils and watercolours. Auguste Rodin despaired at the destruction of \"those marvels\", and in one of his final letters to Russell, said \"Your works will live, I am certain. One day you will be placed on the same level with our friends Monet, Renoir, and Van Gogh.\" Russell returned to Sydney, where he later suffered a heart attack and died in 1930.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://www.wikiart.org/en/john-russell/", "page_content": "John Russell RA (29 March 1745 – 20 April 1806) was an English painter renowned for his portrait work in oils and pastels, and as a writer and teacher of painting techniques.\n\n\n\nRussell was born in Guildford, Surrey, the son of John Russell Snr., book and print seller and five times mayor of the town; his father was something of an artist, and drew and published two views of Guildford. Russell was educated at the Royal Grammar School, Guildford, and soon showed a strong inclination for art. He trained under Francis Cotes RA (of Cavendish Square, London), one of the pioneers of English pastel painting, and, like Cotes, was an admirer of the pastel drawings of Rosalba Carriera whose methods influenced his technique of \"sweetening\". At the age of 19 he converted to Methodism, which was the cause of tension with his family and with his teacher; he made no secret of his strong evangelical leanings and would attempt to preach and convert at every opportunity.\n\n\n\nRussell set up his own studio, in London, in 1767. He made the acquaintance of the notorious Dr. William Dodd, whose portrait he painted in 1768. He was introduced to Selina, Countess of Huntingdon, who unsuccessfully attempted to persuade him to give up painting and attend her Methodist ministers' training college at Trevecca in Wales. On 5 February 1770, he married Hannah Faden, daughter of a Charing Cross print and map seller, whom he had converted. They lived at No. 7 Mortimer Street, Cavendish Square, where he had moved in 1770.\n\n\n\nRussell's work caused him to travel extensively around Britain. In 1772, he wrote Elements of Painting with Crayons, by which time he had won premiums for his drawings from the Society of Arts in 1759 and 1760, and entered the Royal Academy school of art in 1770, winning its gold medal for figure drawing the same year. He exhibited at the Society of Artists of Great Britain in 1768 and showed 330 works at the Academy between 1769 until and his death.\n\n\n\nIn 1770, Russell painted Methodist minister, George Whitefield (engraved by James Watson) and the future philanthropist, William Wilberforce, then only eleven years old. In 1771, he exhibited a portrait in oils of Charles Wesley at the Royal Academy and, in 1772, painted Selina, Countess of Huntingdon in pastel. This was a symbolic picture, and was lost on its voyage out; but it was engraved, and he later also painted her in oils. Also in that year he was elected an associate of the Royal Academy. The following year, 1773, he painted John Wesley (engraved by Bland).\n\n\n\nIn 1788, after a long wait, Russell was elected a royal academician, in the same year painting a portrait of the naturalist Sir Joseph Banks. In 1789, he was commissioned to portray the royal physician Francis Willis. The results obviously pleased the monarch as, in 1790, he was appointed Crayon (pastel) Painter to King George III, Queen Charlotte, the Prince of Wales (both of whom Russell also painted) and the Duke of York. With such royal patronage, he developed a large and fashionable clientele.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://www.celebsagewiki.com/john-russell", "page_content": "Age, Biography and Wiki\n\nJohn Russell (John Robert Russell) was born on 24 May, 1917 in London, England, UK, is an Actor. Discover John Russell's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of John Russell networth?\n\nPopular As John Robert Russell Occupation actor Age 85 years old Zodiac Sign Gemini Born 24 May 1917 Birthday 24 May Birthplace London, England, UK Date of death 25 October, 2002 Died Place Santa Fe, New Mexico, USA Nationality UK\n\nWe recommend you to check the complete list of Famous People born on 24 May. He is a member of famous Actor with the age 85 years old group.\n\nJohn Russell Height, Weight & Measurements\n\nAt 85 years old, John Russell height not available right now. We will update John Russell's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is John Russell's Wife?\n\nHis wife is Nicole Milinaire (2 September 1960 - 25 October 2002) ( his death), Hon. Lydia Yarde-Buller (12 February 1947 - 1960) ( divorced) ( 1 child), Clare Hollway (1939 - 1945) ( her death) ( 2 children)\n\nFamily Parents Not Available Wife Nicole Milinaire (2 September 1960 - 25 October 2002) ( his death), Hon. Lydia Yarde-Buller (12 February 1947 - 1960) ( divorced) ( 1 child), Clare Hollway (1939 - 1945) ( her death) ( 2 children) Sibling Not Available Children Not Available\n\nJohn Russell Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is John Russell worth at the age of 85 years old? John Russell’s income source is mostly from being a successful Actor. He is from UK. We have estimated John Russell's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nJohn Russell Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.howold.co/person/john-russell", "page_content": "John Russell Actor\n\nJohn Russell is a 70 years old Actor from . John Russell was born on January 03, 1921 (died on January 19, 1991, he was 70 years old) in .\n\nAbout\n\nBiography\n\n. John Russell was an American actor, and World War II veteran, most noted for playing Marshal Dan Troop in the successful ABC western television series Lawman from 1958 to 1962. Description above from the Wikipedia article John Russell, licensed under CC-BY-SA, full list of contributors on Wikipedia. ​\n\nRead full biography\n\nNo, he died on 01/19/1991, 32 years ago. He was 70 years old when he died.\n\nFamily\n\nWives\n\nJohn Russell had five marriages.\n\nEdith Unton Russell married with Edith Unton on Saturday, January 11th, 1519. John was 401 years old. Married for 504 years, 4 months.\n\nJudy Violet Ella Showers He married with Judy Violet Ella Showers in 2010. John was 88 and Judy Violet Ella Showers was 61 years old. Married for 13 years, 5 months.\n\nSusanna Helen Merriam He married with Susanna Helen Merriam on Saturday, October 9th, 1976. John Russell was 55 years old. Married for 46 years, 8 months.\n\nChildren\n\nHe had ten children, Sallyanne , Sydney , Isabel , Charlotte (81) , Sir (66) , Edward (53) , Katherine (85) , Mary (84) , Alexander (72, American organist) and Lavinia (77) .\n\nWorks\n\nJohn Russell Movies (55)\n\nThere are 55 movies of John Russell.\n\nHis first feature film was The Outlaw Josey Wales (1976, as Bloody Bill Anderson). He was 55 when he starred in this movie. Since 1976, he has appeared in 55 feature films. The last one is If He Hollers, Let Him Go! (1968). In this movie, we watched him in the Sheriff character .\n\nJohn Russell movie characters\n\nView all John Russell movies\n\nThe names of the characters/jobs in the films he starred in are as follows:\n\nJohn Russell TV Shows (14)\n\nHis first TV Show was Studio 57 (1954).\n\nView all John Russell TV shows\n\nJohn Russell zodiac sign was capricorn.\n\nOther facts about John Russell"}, {"url": "https://prabook.com/web/john.russell/3742479", "page_content": "John Russell\n\npainter\n\nJune 16, 1858 (age 71) Sydney, Australia\n\nJohn Peter Russell settled at Belle Île off the coast of Brittany, where he designed his own home and established an artists' colony. Russell had met Vincent van Gogh in Paris and formed a close friendship with him. They particularly bonded over being foreigners in the Parisian avant-garde scene. Claude Monet often worked with Russell at Belle Île and influenced his style, though it has been said that Monet preferred some of Russell's Belle Île seascapes to his own. In 1890, Russell left Belle Île and traveled to Antibes in a horse-drawn cart, where he rented a house for the winter and produced some of his most acclaimed work. Due to his substantial private income Russell did not attempt to make his pictures well known. In the 1880s and 1890s, Russell hewed closely to pure French impressionist style. Russell destroyed 400 of his oils and watercolours after the death of his wife in 1907. After 1912, he moved between Italy, Switzerland, and the United Kingdom. In 1921, Russell returned to the Sydney area, where he lived in a fisherman's cottage in suburb of Watsons Bay and had a small wooden studio on Sydney Harbour. In 1922, he briefly lived in New Zealand where he helped one of his sons start a citrus farm. Russell suffered a fatal heart attack on April 30, 1930 in Sydney, Australia while lifting rocks to build a wall outside his cottage."}, {"url": "https://www.ancientfaces.com/person/john-russell-birth-1937-death-1985/15929148", "page_content": "Refresh this page to see various historical events that occurred during John's lifetime.\n\nIn 1937, in the year that John Russell was born, on May 28th, the San Francisco Golden Gate Bridge opened to cars. Taking 5 years to build, the 4,200-foot-long suspension bridge was an engineering marvel of its time - 11 men died during construction. The \"international orange\" color was chosen because it resisted rust and fading. To the present, it is the symbol of the City that is known throughout the world.\n\nIn 1942, John was just 5 years old when from January 7th through April 9th, the Battle of Bataan was fought in the Philippines. At the end of the battle, the U.S. and Filipino forces surrendered and a three-year occupation of the Philippines by Japan began. Between 60,000 and 80,000 American and Filipino soldiers surrendered and were marched around 60 to 69 miles - most were beaten, abused, or killed. Named the Bataan Death March, it was later declared to be a war crime.\n\nIn 1956, John was 19 years old when this was the year that the King of Rock and Roll, Elvis Presley, became an international sensation. He began the year as a regional favorite and ended the year with 17 recordings having been on the Billboard’s Top 100 singles chart, 11 TV appearances, and a movie. Elvis scandalized adults and thrilled teens.\n\nIn 1960, at the age of 23 years old, John was alive when on September 26th, the first televised debate for a Presidential campaign in the United States - Kennedy vs Nixon - was held. Seventy million people watched the debate on TV. The debate pre-empted the very popular Andy Griffith Show.\n\nIn 1985, in the year of John Russell's passing, on March 15th, the first internet domain name was registered - Symbolics.com. Symbolics, Inc., a spinoff of the MIT AI Lab, was a computer manufacturer headquartered in Massachusetts. The company no longer exists and the domain name was sold 25 years later."}, {"url": "https://www.ancientfaces.com/person/john-c-russell-birth-1941-death-1999/53215194", "page_content": "Refresh this page to see various historical events that occurred during John's lifetime.\n\nIn 1941, in the year that John C Russell was born, on June 25th, President Roosevelt signed Executive Order 8802, prohibiting racial discrimination in the defense industry. EO 8802 was the first federal action to prohibit employment discrimination - without prejudice as to \"race, creed, color, or national origin\" - in the U.S. Civil Rights groups had planned a march on Washington D.C. to protest for equal rights but with the signing of the Order, they canceled the March.\n\nIn 1965, he was 24 years old when on March 8th, the first US combat troops arrived in Vietnam. The 3500 Marines joined 23,000 \"advisors\" already in South Vietnam. By the end of the year, 190,000 American soldiers were in the country.\n\nIn 1971, by the time he was 30 years old, in March, Intel shipped the first microprocessor to Busicom, a Japanese manufacturer of calculators. The microprocessor has since allowed computers to become smaller and faster, leading to smaller and more versatile handheld devices, home computers, and supercomputers.\n\nIn 1983, he was 42 years old when on August 30th, the Soviet Union claimed that a South Korean Boeing 747 jetliner (Flight 007), bound for Seoul from New York City, had strayed into Soviet airspace. Saying that they believed it to be a U.S. spy plane, the passenger jet was shot down by a Soviet SU-15 fighter - after it had tracked the airliner for two hours. All 269 passengers (including a U.S. Representative from Georgia) and crew were killed.\n\nIn 1995, John was 54 years old when on October 16th, the Million Man March took place on the National Mall in Washington DC. The March was organized to address \"the ills of black communities and call for unity and revitalization of African American communities\". An estimated 850,000 people attended."}]}