{"Cicero Hunt Lewis died in 1904 in New York City.": [{"url": "https://pcad.lib.washington.edu/person/5357/", "page_content": "Male, born 1867-11-21, died 1918-04-03\n\nAssociated with the firms network\n\nCutter and Lewis, Associated Architects; Lewis and Beckwith, Architects; Lewis, David Chambers, Architect\n\nLewis worked in association with Frank P. Allen, Jr., (1880-1943), Architect, on the European Exhibits Building at the Lewis and Clark Exposition of 1905. Allen also worked as Director of Works for Seattle's Alaska-Yukon-Pacific Exposition (AYPE) in 1909.\n\nThe Oregonian newspaper stated in its obituary for Lewis: \"More than a year ago Mr. Lewis was compelled to relinquish his business activities. Despite every precaution his condition grew steadily worse.\" (See \"David C. Lewis Is Dead – Prominent Portland Architect Passes In California,\" The Oregonian, 04/05/1918, p. 23.)\n\nRelocation\n\nDavid C. Lewis was born to a prosperous, pioneer family in Portland, OR. His father, Cicero Hunt Lewis, Sr., arrived in Portland in 1851, when it was little more than a hamlet. Cicero married Clementine F. Couch, daughter of another early mercantile family, on 01/18/1857. During the 1850s and 1860s, the Couch and Lewis Families grew dramatically in size and wealth. In 1870, when David was three, his immediate family had six brothers and sisters and three domestic servants. The US Census of 1870 recorded that Cicero, controlled real estate worth $15,000 and had $10,000 in his personal estate. (See Ancestry.com, Source Citation Year: 1870; Census Place: Portland, Multnomah, Oregon; Roll: M593_1287; Page: 192A; Image: 152458; Family History Library Film: 552786, accessed 05/30/2017.) By the late 1870s, David would have ten siblings.\n\nDavid left Portland to attend Princeton University and Columbia University for undergraduate and graduate study, respectively. Between stints in school, Lewis returned to Portland c. 1890 to work; he visited Europe after Columbia, and then resettled in Portland. In 1900, he lived with his mother, six siblings and one sister-in-law at 125 19th Street in Portland, OR. This must have been a capacious mansion able to board that many family members and six servants including three household staff, two gardeners and a coachman. (See Ancestry.com, Source Citation Year: 1900; Census Place: Portland Ward 2, Multnomah, Oregon; Roll: 1348; Page: 5B; Enumeration District: 0043; FHL microfilm: 1241349, accessed 05/30/2017.)\n\nAccording to the US Census of 1910, he lived in both Portland, OR (on 04/21-22/1910) and New York, NY (05/07/1910). His Portland address was 285 21st Street, where he lived with his wife and two maids. (See Ancestry.com, Source Citation Year: 1910; Census Place: Portland Ward 2, Multnomah, Oregon; Roll: T624_1285; Page: 10B; Enumeration District: 0131; FHL microfilm: 1375298, accessed 05/30/2017.) His temporary New York address was 276 5th Avenue, the Holland House Apartment Building. (See Ancestry.com, Source Citation Year: 1910; Census Place: Manhattan Ward 21, New York, New York; Roll: T624_1037; Page: 8A; Enumeration District: 1270; FHL microfilm: 1375050, accessed 05/30/2017.)\n\nDue to ill health, he relocated to the California Sanatorium in Belmont, CA, c. 1917; he died here on 04/03/1918. His death certificate listed his place of residence as 285 North 21st Street in Portland, OR, and it indicated that Lewis had lived in the California Sanitorium for four months before his death. (The Portland, Oregon, City Directory, 1917, [p. 695] also listed his permanent address as 285 North 21st Street.) He was laid to rest in Riverview Cemetery in Portland, CA.\n\nParents\n\nHis father was Cicero Horatius Lewis, (born 1826 in Cranbury, NJ-d. 01/04/1897), who worked in 1880 as a wholesale grocer and was a prominent benefactor of the local Episcopalian church. His maternal grandfather was the early Portland, OR, businessman, Captain John Heard Couch (1811-1870), his maternal grandmother, Caroline E. Flanders Couch. His mother was Clementine Freeman Couch (born 10/1838 in Newburyport, MA-d. 1914), who had 11 children, all of whom survived into adulthood. David had a brother, Lucius Allen Lewis (1863-1935), for whom he designed a residence in 1901. Other siblings were: Mary Emma Lewis Bingham (1857-1944), John Couch Lewis (1859-1939), Elizabeth Lewis Good (1863-1928), Evelyn Scott Lewis Mills (1865-1936), Sarah Heard Lewis (01/1870-1964), Robert W. (born 12/1872), Cicero Hunt Lewis (07/24/1875-1952), Clementine Lewis Hall (09/1877-1965) and Francis (born 08/1880 in OR).\n\nSpouse\n\nLewis married Etta Jane Honeyman (b. 01/25/1884 in Portland, OR-d. 03/07/1932 in Phoenix, AZ) on 06/20/1906 in Portland. (See Ancestry.com, Source Citation Oregon State Library; Salem, Oregon; Oregon Marriage Indexes, 1906-2006; Reel: 1, accessed 05/30/2017.) her parents were William Honeyman (1840-1899) and Jane C. Dawson. They married 01/27/1864.\n\nShe subsequently married Jordan V. Zan (1876-1966). Etta Zan died in Phoenix, AZ, following a traffic accident at the age of 47.\n\nBiographical Notes\n\nRichard Ellison Ritz in his Architects of Oregon (Portland: Lair Hill Publishing, 2002), indicated incorrectly on p. 251 that his date of birth was December 21, 1867, not November 21, 1867. The correct date of birth is in David C. Chambers's own hand in an application to the Sons of the American Revolution, of 03/07/1900. See Ancestry.com \"U.S., Sons of the American Revolution Membership Applications, 1889-1970 Record for David Chambers Lewis.\" Accessed 03/25/2013. The application stated that Lewis was descended from David Chambers born 09/25/1768 in Trenton, NJ, who served as a NJ Militia Colonel during the Revolutionary War from 1776-1779. He fought at the Battle of Trenton, 12/26/1776."}, {"url": "https://www.ancestry.com/genealogy/records/cicero-hunt-lewis-24-hy7gm0", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://www.findagrave.com/memorial/6625436/cicero-hunt-lewis", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.findagrave.com/memorial/149414263/Cicero-Hunt-Lewis", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://es.findagrave.com/memorial/6625436/cicero-hunt-lewis", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.findagrave.com/memorial/149522445/cicero-hunt-lewis", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.britannica.com/biography/Cicero", "page_content": "In the months following Julius Caesar ’s assassination in 44 BCE, Marcus Tullius Cicero delivered several speeches that urged the Senate to support Octavian in his struggle against Mark Antony . When Octavian and Antony reconciled, a centurion murdered Cicero on Antony’s order. Cicero’s head and hands were nailed to the rostra in the Roman Forum.\n\nIn his youth, Marcus Tullius Cicero was instructed by the famed rhetorician Molon of Rhodes. Molon did not stick to any one style, instead drifting between florid and concise language. Cicero perfected this methodology, relying on cadence, emotion, and the energy of his audience and interweaving references to literature, philosophy, and history.\n\nMarcus Tullius Cicero resented the political machinations of Julius Caesar , Pompey , and Marcus Licinius Crassus and initially refused to ally himself with them, even attempting to isolate Pompey from Caesar. However, he later committed himself publicly—if not personally—to their advancement before diminishing his political involvement during the civil war between Caesar and Pompey.\n\nIn 63 BCE Marcus Tullius Cicero gave an impassioned oration to his fellow senators that charged Catiline with plotting to stage a violent coup. This so moved the Senate that they voted to implement martial law and execute the conspirators. Cicero was named pater patriae—“father of the country”—for his service to the republic.\n\nMarcus Tullius Cicero was a masterful orator known for his ability to evoke a wide range of emotions in plebeians and patricians alike. Cicero’s political career saw him as quaestor , praetor , consul , and proconsul , providing him with several opportunities to influence the trajectory of Rome and the Senate in the waning days of the republic.\n\nCicero , in full Marcus Tullius Cicero , (born 106 bce, Arpinum, Latium [now Arpino, Italy]—died December 7, 43 bce, Formiae , Latium [now Formia]), Roman statesman, lawyer, scholar, and writer who vainly tried to uphold republican principles in the final civil wars that destroyed the Roman Republic . His writings include books of rhetoric , orations, philosophical and political treatises , and letters. He is remembered in modern times as the greatest Roman orator and the innovator of what became known as Ciceronian rhetoric.\n\nIn the first of his consular speeches, he opposed the agrarian bill of Servilius Rullus, in the interest of the absent Pompey; but his chief concern was to discover and make public the seditious intentions of Catiline, who, defeated in 64, appeared again at the consular elections in 63 (over which Cicero presided, wearing armour beneath his toga). Catiline lost and planned to carry out armed uprisings in Italy and arson in Rome. Cicero had difficulty in persuading the Senate of the danger, but the “last decree” (Senatus consultum ultimum), something like a proclamation of martial law , was passed on October 22. On November 8, after escaping an attempt on his life, Cicero delivered the first speech against Catiline in the Senate, and Catiline left Rome that night. Evidence incriminating the conspirators was secured and, after a senatorial debate in which Cato the Younger spoke for execution and Julius Caesar against, they were executed on Cicero’s responsibility. Cicero, announcing their death to the crowd with the single word vixerunt (“they are dead”), received a tremendous ovation from all classes, which inspired his subsequent appeal in politics to concordia ordinum, “concord between the classes.” He was hailed by Catulus as “father of his country.” This was the climax of his career.\n\nCicero was the son of a wealthy family of Arpinum . Admirably educated in Rome and in Greece , he did military service in 89 under Pompeius Strabo (the father of the statesman and general Pompey ) and made his first appearance in the courts defending Publius Quinctius in 81. His brilliant defense, in 80 or early 79, of Sextus Roscius against a fabricated charge of parricide established his reputation at the bar, and he started his public career as quaestor (an office of financial administration) in western Sicily in 75.\n\nAlliance with the First Triumvirate\n\nAt the end of 60, Cicero declined Caesar’s invitation to join the political alliance of Caesar, Crassus, and Pompey, the so-called First Triumvirate, which he considered unconstitutional, and also Caesar’s offer in 59 of a place on his staff in Gaul. When Publius Clodius, whom Cicero had antagonized by speaking and giving evidence against him when he was tried for profanity early in 61, became tribune in 58, Cicero was in danger, and in March, disappointed by Pompey’s refusal to help him, he fled Rome. On the following day Clodius carried a bill forbidding the execution of a Roman citizen without trial. Clodius then carried through a second law, of doubtful legality, declaring Cicero an exile. Cicero went first to Thessalonica, in Macedonia, and then to Illyricum. In 57, thanks to the activity of Pompey and particularly the tribune Titus Annius Milo, he was recalled on August 4. Cicero landed at Brundisium (Brindisi) on that day and was acclaimed all along his route to Rome, where he arrived a month later.\n\nIn winter 57–56 Cicero attempted unsuccessfully to estrange Pompey from Caesar. Pompey disregarded Cicero’s advice and renewed his compact with Caesar and Crassus at Luca in April 56. Cicero then agreed, under pressure from Pompey, to align himself with the three in politics, and he committed himself in writing to this effect (the “palinode”). The speech De provinciis consularibus (On the Consular Provinces) marked his new alliance. He was obliged to accept a number of distasteful defenses, and he abandoned public life. In the next few years he completed the De oratore (55; On the Orator) and De republica (52; On the Republic) and began the De legibus (52; On Laws). In 52 he was delighted when Milo killed Clodius but failed disastrously in his defense of Milo (later written for publication, the Pro Milone, or For Milo).\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn 51 he was persuaded to leave Rome to govern the province of Cilicia, in southern Anatolia, for a year. The province had been expecting a Parthian invasion, but it never materialized, although Cicero did suppress some brigands on Mt. Amanus. The Senate granted a supplicatio (a period of public thanksgiving), although Cicero had hoped for a triumph, a processional return through the city, on his return to Rome. All admitted that he governed Cilicia with integrity.\n\nBy the time Cicero returned to Rome, Pompey and Caesar were struggling against each other for complete power. He was on the outskirts of Rome when Caesar crossed the Rubicon and invaded Italy in January 49. Cicero met Pompey outside Rome on January 17 and accepted a commission to supervise recruiting in Campania. He did not leave Italy with Pompey on March 17, however. His indecision was not discreditable, though his criticism of Pompey’s strategy was inexpert. In an interview with Caesar on March 28, Cicero showed great courage in stating his own terms—his intention of proposing in the Senate that Caesar should not pursue the war against Pompey any further—though they were terms that Caesar could not possibly accept. Cicero disapproved of Caesar’s dictatorship; yet he realized that in the succession of battles (which continued until 45) he would have been one of the first victims of Caesar’s enemies, had they triumphed. This was his second period of intensive literary production, works of this period including the Brutus, Paradoxa Stoicorum (Paradoxes of the Stoics), and Orator (The Orator) in 46; De finibus (On the Supreme Good) in 45; and Tusculanae disputationes (Tusculan Disputations), De natura deorum (On the Nature of the Gods), and De officiis (On Duties), finished after Caesar’s murder, in 44."}, {"url": "https://www.geni.com/people/Mary-Bingham/6000000043857184000", "page_content": "About Mary Emma Bingham\n\nThe Oregonian, November 15, 1944\n\nDeath Takes Life Resident\n\nLast rites will be held at Trinity chapel, N. W. 17th and Everett street, at 11 A. M., Wednesday, for Emma Lewis Bingham, daughter of Portland pioneers, who died here Monday following many years' illness.\n\nMrs. Bingham was born in Portland on November 2, 1857, to C. H. Lewis, who operated a wholesale grocery business, and the former Clementine Couch, daughter of Capt. John H. Couch. The Lewises established themselves here in 1849.\n\nEducation at St. Helens\n\nSt. Helens Hall was the scene of Mrs. Bingham's complete education. She was a member of one of its earliest graduating classes.\n\nIn 1896 she married the late Dr. John E. Bingham of Walla Walla.\n\nSurviving her are one son, Mason L. Bingham, of 2433 N. W. Kearney street; three sisters, Miss Sally Lewis and Sherman R. Hall of Portland and Mrs. Henry P. Fairbanks of New York City; a brother, C. Hunt Lewis of Portland, and one granddaughter.\n\nFriends are invited to attend the services, which are under auspices of J. P. Finley & Son.\n\nFuneral Notice: Portland Crematorium and Mortuary"}, {"url": "https://www.geni.com/people/Clementine-Lewis/6000000027341643841", "page_content": "About Clementine Freeman Lewis\n\nMorning Oregonian, May 31, 1914\n\nAfter an illness of three months, Mrs. Cicero Hunt Lewis, widow of the founder of the wholesale grocery firm of Allen & Lewis, died shortly before 2 P.M. yesterday in the family home, Nineteenth and Glisan streets. She was nearly 76 years old, having been born in Newburyport, Mass., October 14, 1838.\n\nThe funeral arrangements will not be made until today, but it was announced last night that the services will be held from Trinity Episcopal Church, Nineteenth and Everett streets, of which Mrs. Lewis was an active member for many years.\n\nMrs. Lewis is survived by three sisters, Mrs. Caroline E. Wilson, Mrs. Elizabeth R. Glisan, of Portland, and Miss Mary H. Couch, who is now traveling abroad, and by 11 children, ten of whom are residents of Portland.\n\nHer sons are L. Allen Lewis, president of Allen & Lewis, John C. Lewis, Robert W. Lewis, David C. Lewis and C. Hunt Lewis. Her daughters are Mrs. J. E. Bingham, Mrs. George Good, Mrs. A. L. Mills, Mrs. Sherman R. Hall and Miss Sarah H. Lewis all of Portland, and Mrs. Henry P. Fairbanks, of New York City.\n\nPanama Route Taken.\n\nAs Miss Clementine Freeman Couch, daughter of Captain John H. Couch, a prominent pioneer, Mrs. Lewis came to Oregon in 1852 by way of the Isthmus of Panama. They took a train part of the distance across the Isthmus, crossing the Chagres River in a boat. In striking contrast to the present-day method, they climbed over the mountains where Culebra Cut is now located by muleback.\n\nPortland was a primitive town of only 1000 persons when they arrived here. There were then but two streets, the forest extending down to what is now First street, which then had stumps on it.\n\nCaptain Couch, who had preceded his family on voyages to the Pacific Coast in the early forties, took up a land claim, known as the Couch donation land claim, adjoining the original Portland claim established by Pettygrove and others. With him was associated his brother-in-law, George H. Flanders, another of Oregon's pioneers. Their tract extended from the Willamette River to a point a mile back, embracing most of the land between Ankeny and Washington streets, the river and Thurman street. This tract was later subdivided and sold, but the name of Couch is perpetuated in Couch street, Couch Addition and Couch School, while Flanders street was named after the other owner.\n\nEarly History Recalled.\n\nThe beautiful residence property bounded by Nineteenth, Twentieth, Glisan and Hoyt streets, has remained intact all these years, and it was in the home on this site that Mrs. Lewis died yesterday after living in Portland continuously for 62 years, a large share of them passed on that original property.\n\nThe Couch family settled at First and Ankeny streets, where the Leonard building now stands, later moving to a part of the homestead at Fourth and Hoyt streets in the midst of a great grove of oak trees on the shores of Couch Lake. The former bed of the lake has long since been filled in. The Hill-Northern Pacific terminals are now located there.\n\nIn that early day debates were frequent as to which would be the ultimate metropolis of this section, Portland or St. Helens.\n\nOn January 18, 1857, Miss Clementine Freeman Couch married Cicero Hunt Lewis, a pioneer of 1851, who lived to be one of Oregon's greatest merchants and citizens. The marriage took place in the first Episcopal Church building erected in Oregon, a small edifice at Second and Oak streets, where the City Jail now stands. The church later was moved to the corner of Fifth and Oak streets, where the Commercial Club building now stands. The Sunday school of Trinity Church was conducted in this building for many years.\n\nBenefactions Are Told.\n\nMrs. Lewis, kind an modest in her disposition, was beloved by all who knew her or who came in contact with her. In a quiet way she was a generous philanthropist, not interested in any one particular movement, but in all. The greatest enjoyment of her fortune seemed to be in doing something for others.\n\nAt the time of the San Francisco fire she donated $20,000 to the relief fund. She also gave liberally to the Good Samaritan Hospital and Trinity Episcopal Church. The addition to the Good Samaritan Hospital was built by her as a memorial to her husband."}, {"url": "https://en-academic.com/dic.nsf/enwiki/11544653", "page_content": "Cicero Hunt Lewis (1826–1897) was a prominent merchant and investor in Portland in the U.S. state of Oregon during the second half of the 19th century. Born in New Jersey, Lewis and a friend, Lucius Allen, traveled across the continent in 1851 to open a dry goods and grocery store in what was then a frontier town of about 800 people living along the west bank of the Willamette River. By 1880, their firm, Allen & Lewis, had become one of the leading wholesale grocery companies on the West Coast.\n\nSupporting transportation projects that affected his business, he was a member of the Portland River Channel Improvement Committee in the 1860s, invested in the Oregon Railway and Navigation Company in the 1870s, and was appointed to the original Port of Portland Commission in the 1890s. He helped form a local subscription library in the 1860s, and he was named to the city's first water board in the 1880s.\n\nMarried to Clementine Couch, daughter of another prominent Portland pioneer, Lewis fathered 11 children and after 1881 lived in a large, elegantly furnished house within walking distance of his office. He spent most of his time at work or at home, and had few other interests aside from church and charitable donations. He died in 1897 while walking to work on a Saturday afternoon.\n\nEarly life\n\nBorn in 1826 in Cranbury, New Jersey, Lewis moved with his parents at age 13 to Newburgh, New York. At age 20, he went to New York City to work in the dry-goods business of Chambers, Heiser & Company.[1]\n\nMerchant-entrepreneur\n\nJohn DeWitt, a New York merchant, hired Lewis in 1851 to assist DeWitt's son-in-law, Lucius Allen, in running a wholesale supply house in Portland, a frontier settlement on the West Coast.[2] Portland, with a population of about 800, was in good position to trade via the Willamette and Columbia rivers and the Pacific Ocean with San Francisco and other ports and by land with an increasing number of pioneer farmers in the Willamette Valley.[3] Allen, a friend of Lewis, had tried and failed in 1850 to establish a Portland branch store, and DeWitt thought that the more experienced Lewis would be able to help. In 1883 after several setbacks, the two men opened their own business (independent of New York) in a rented store at Front and \"B\" (Burnside) streets. They specialized in dry goods and groceries, building customer loyalty by selling at a fixed price, extending credit to reliable customers, and offering free space in their safe for storage of their customers' gold.[2]\n\nBy 1860, Allen had moved to San Francisco, a seaport city about 600 miles (970 km) south of Portland, where the company bought most of its supplies. He became a silent partner, uninvolved in day-to-day management. By then the firm of Allen & Lewis had begun to focus on wholesale markets, and by 1880, it was one of the leading wholesale grocery firms on the West Coast.[2] Lewis and three contemporaries, Henry W. Corbett, William S. Ladd, and Henry Failing, who arrived in Portland in 1851 and set up businesses along Front Street,[4] became \"merchant princes of the Northwest\".[5]\n\nWithin 10 years, this group of dedicated Front Street merchants and their families would dominate the economic, political and social life of Portland. All became warm and lasting friends with Ladd, the former teacher and railroad agent, first among equals... With Benjamin Stark and John H. Couch, who became Lewis's father-in-law, they formed Portland's earliest Establishment, one of merchant-entrepreneurs.[4]\n\nIn 1864, these four merchants and others formed the Portland River Channel Improvement Committee, to raise money to make the Willamette shipping channel more easily navigable. This led to a federally-funded project by the United States Army Corps of Engineers, which dredged the channel in 1866.[6] In 1891, Lewis was named to the original Port of Portland Commission, established by the Oregon Legislative Assembly to oversee the maritime commercial and shipping interests of the city.[7]\n\nWhen railroads began replacing steamships as a shipping method in the 1870s, Lewis, Ladd, Corbett, Failing, and Simeon Reed (a Portland transportation executive), became the five largest stockholders, aside from Henry Villard, in Villard's Oregon Railway and Navigation Company (OR&N).[8] In 1888, Lewis was part of a group that visited Villard in New York to negotiate favorable shipping rates on the Union Pacific and the Northern Pacific railroads, with which Villard and the OR&N had contracts affecting Portland.[9] Lewis's interest in Portland railroads extended to the Portland & Willamette Valley Railroad, of which he became a local director in 1885, and which was controlled and formally taken over by the Southern Pacific Railroad in 1890.[10]\n\nLewis and the other three pioneer merchants were among those in 1864 who formed the Mercantile Library Association (later renamed the Library Association of Portland) to establish a local subscription library. Roughly 30 years later, after a public library opened in Portland in 1891, members of the Cicero Lewis family were among its largest donors.[11] In 1885, Lewis was one of 15 men named to the Portland Water Committee, empowered by the state legislature to acquire and operate a municipal water system for the city.[12]\n\nFamily, other interests, death\n\nIn 1857 Lewis married Clementine Couch, daughter of John H. Couch, a sea captain and early Portland settler. Unlike many of his friends, Lewis developed few interests beyond his business. His only form of recreation was walking to work, and although he was a charter member of the Arlington Club and could have dined there, he usually walked home for lunch. Historian E. Kimbark MacColl writes that Lewis \"spent his life at his desk and never went out in the evening for entertainment or the theater... He was never known to have taken a pleasure trip, spending what remaining leisure time he had with his wife and 11 children.\"[13] Lewis died of a stroke in 1897 while walking back to work on a Saturday afternoon.[13]\n\nLewis was a member of the Episcopal Church[14] and a Mason.[15] He was one of the largest supporters of Good Samaritan Hospital and Trinity Episcopal Church in Portland.[13] After Lewis died, his wife funded a hospital addition named in his honor at Good Samaritan.[1]\n\nThe Lewis family lived in a house on Fourth and Everett streets until 1881, when they built a large house on a lot in the Couch tract in northwest Portland. The tract, consisting of half of the block between 19th and 20th streets and Everett and Flanders streets, was owned by Mary Couch, Clementine's sister, and was developed by other members of the Couch family.[n 1] The project consisted of four houses, each on a lot 100 feet (30 m) wide and 100 feet (30 m) long.[5] The Lewis property, facing 19th Street, included stables, a greenhouse, and a sweeping drive leading to a carriage porch. Their very large house was built in a stick style that was \"rather simple for its period\", but its interior featured tall windows, a massive staircase, front and rear parlors, a reception room with a marble fireplace, and tall mirrors in elaborate frames, as well as \"rare woods, marble mantels, brocaded walls [and] fine lighting fixtures\" throughout.[5] The four houses on the Couch tract were demolished in the 1960s.[5]\n\nNotes and references\n\nNotes\n\n^ Central Portland lies on the west side of a bend in the north-flowing Willamette River. With few exceptions, its north–south streets (called avenues in the 21st century) are numbered in ascending order beginning west of Front Street (later named Naito Parkway), which runs along the river. In the northwest quadrant of the city, the east–west street names are alphabetical in ascending order beginning with Burnside Street. The first Lewis residence was roughly four blocks west of the river and three blocks north of Burnside, and their second residence was about 20 blocks west of the river and four blocks north of Burnside. [ 16 ]\n\nReferences\n\nWorks cited"}]}