{"Cicero Hunt Lewis was born in New York City.": [{"url": "https://www.wikiwand.com/en/Cicero_Hunt_Lewis", "page_content": "Cicero Hunt Lewis (1826–1897) was a prominent merchant and investor in Portland in the U.S. state of Oregon during the second half of the 19th century. Born in New Jersey, Lewis and a friend, Lucius Allen, traveled across the continent in 1851 to open a dry goods and grocery store in what was then a frontier town of about 800 people living along the west bank of the Willamette River. By 1880, their firm, Allen & Lewis, had become one of the leading wholesale grocery companies on the West Coast.\n\nMerchant and investor\n\nQuick facts: Cicero Hunt Lewis, Born, Died, Nationality, O... ▼\n\nSupporting transportation projects that affected his business, he was a member of the Portland River Channel Improvement Committee in the 1860s, invested in the Oregon Railway and Navigation Company in the 1870s, and was appointed to the original Port of Portland Commission in the 1890s. He helped form a local subscription library in the 1860s, and he was named to the city's first water board in the 1880s.\n\nMarried to Clementine Couch, daughter of another prominent Portland pioneer, Lewis fathered 11 children and after 1881 lived in a large, elegantly furnished house within walking distance of his office. He spent most of his time at work or at home, and had few other interests aside from church and charitable donations. He died in 1897 while walking to work on a Saturday afternoon."}, {"url": "https://archiveswest.orbiscascade.org/ark:80444/xv13369", "page_content": "Overview of the Collection\n\nTitle Cicero Hunt Lewis residence photographic collection Dates circa 1890-1910 (inclusive) 1890 1910 Quantity 0.1 cubic feet , (1 folder in shared box) Collection Number Org. Lot 552 Summary Small collection of black and photographs and one drawing of the exterior and interior of the Cicero Hunt Lewis house at NW 19th and Glisan St. in Portland, Oregon. Lewis (1826-1897) emigrated to Portland, Oregon, in 1851. He founded a mercantile firm, Allen and Lewis, with Lucius H. Allen. Repository Oregon Historical Society Research Library\n\n1200 SW Park Avenue\n\nPortland, OR\n\n97205\n\nTelephone: 503-306-5240\n\nFax: 503-219-2040\n\nlibreference@ohs.org Access Restrictions Collection is open for research. Languages English\n\nCicero Hunt Lewis (1826-1897), also known as Cicero Horatius Lewis, was a pioneer Portland merchant. He was born in New Jersey and arrived in Portland in 1851. He founded a mercantile firm, Allen and Lewis, with Lucius H. Allen. He married Clementine Couch in 1857. He was active in many civic and promotional enterprises, and helped incorporate Oregon Central Railroad. He was a promoter of the Willamette Bridge Company and city water works.\n\nFifteen black and white photographs and one black and white drawing, circa 1890-1910, of the exterior and interior of the Cicero Hunt Lewis house at NW 19th and Glisan St. in Portland, Oregon.\n\nPreferred Citation Cicero Hunt Lewis residence photographic collection, Org. Lot 552, Oregon Historical Society Research Library. Restrictions on Use The Oregon Historical Society owns the materials in the Research Library and makes available reproductions for research, publication, and other uses. The Society does not necessarily hold copyright to all materials in the collections. In some cases, permission for use may require seeking additional authorization from copyright owners.\n\nAcquisition Information Drawing gift of Mrs. Sherman Hall, November 1961 (Lib. Acc. 9441). Processing Note Material in the collection was previously part of Photo File #1825. Collection was titled \"Cicero Horatius Lewis residence photographs\" prior to December 2022. Related Materials Cicero Horatius Lewis papers, Mss 787, Oregon Historical Society Research Library."}, {"url": "https://www.ancestry.com/genealogy/records/cicero-hunt-lewis-24-hy7gm0", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://researchworks.oclc.org/archivegrid/collection/data/774893374", "page_content": "Details\n\n.08 cubic ft. (16 photographs in 1 folder)\n\n15 black and white photographs and 1 black and white drawing, ca. 1890-1910, of the exterior and interior of the Cicero Horatius Lewis house at NW 19th and Glisan St. in Portland, Oregon\n\nCicero Hunt Lewis (1826-1897) was a pioneer Portland merchant, born in New Jersey and arrived in Portland in 1851 -- He opened a general store with Lucius H. Allen. He married Clementine Couch in 1857. He was active in many civic and promotional enterprises. He helped incorporate Oregon Central Railroad. He was a promoter of the Willamette Bridge Company, city water works etc\n\nMaterial in the collection formerly designated Photo File #1825\n\nCollection is open to the public\n\nCicero Horatius Lewis Residence Photographic Collection, Org. Lot 552, Oregon Historical Society Research Library\n\nThe Oregon Historical Society is the owner of the materials in the Research Library and makes available reproductions for research, publication, and other uses. Written permission must be obtained from the Research Library before any reproduction use. The Society does not necessarily hold copyright to all of the materials in the collections. In some cases, permission for use may require seeking additional authorization from the copyright owners\n\nCicero Horatius Lewis papers, Mss 787, Oregon Historical Society Research Library, Portland, Or\n\nRelated Resources"}, {"url": "https://www.findagrave.com/memorial/6625436/cicero-hunt-lewis", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.findagrave.com/memorial/149414263/Cicero-Hunt-Lewis", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.findagrave.com/memorial/149522445/cicero-hunt-lewis", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://wiki2.org/en/Cicero_Hunt_Lewis", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nMerchant and investor\n\nCicero Hunt Lewis (1826–1897) was a prominent merchant and investor in Portland in the U.S. state of Oregon during the second half of the 19th century. Born in New Jersey, Lewis and a friend, Lucius Allen, traveled across the continent in 1851 to open a dry goods and grocery store in what was then a frontier town of about 800 people living along the west bank of the Willamette River. By 1880, their firm, Allen & Lewis, had become one of the leading wholesale grocery companies on the West Coast.\n\nSupporting transportation projects that affected his business, he was a member of the Portland River Channel Improvement Committee in the 1860s, invested in the Oregon Railway and Navigation Company in the 1870s, and was appointed to the original Port of Portland Commission in the 1890s. He helped form a local subscription library in the 1860s, and he was named to the city's first water board in the 1880s.\n\nMarried to Clementine Couch, daughter of another prominent Portland pioneer, Lewis fathered 11 children and after 1881 lived in a large, elegantly furnished house within walking distance of his office. He spent most of his time at work or at home, and had few other interests aside from church and charitable donations. He died in 1897 while walking to work on a Saturday afternoon.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 2 870 330 375\n\nCafeneaua filosofică online: Episodul 2. Seneca și Epicur în carantină\n\nDo Kings Have Friends? - Prof Glenn Richardson Inaugural Lecture\n\nDe Officiis II, 75 80 Cicerone. Gli uomini di stato devono essere disinteressati Transcription\n\nEarly life\n\nBorn in 1826 in Cranbury, New Jersey, Lewis moved with his parents at age 13 to Newburgh, New York. At age 20, he went to New York City to work in the dry-goods business of Chambers, Heiser & Company.[1]\n\nMerchant-entrepreneur\n\nJohn DeWitt, a New York merchant, hired Lewis in 1851 to assist DeWitt's son-in-law, Lucius Allen, in running a wholesale supply house in Portland, a frontier settlement on the West Coast.[2] Portland, with a population of about 800, was in good position to trade via the Willamette and Columbia rivers and the Pacific Ocean with San Francisco and other ports and by land with an increasing number of pioneer farmers in the Willamette Valley.[3] Allen, a friend of Lewis, had tried and failed in 1850 to establish a Portland branch store, and DeWitt thought that the more experienced Lewis would be able to help. In 1883 after several setbacks, the two men opened their own business (independent of New York) in a rented store at Front and \"B\" (Burnside) streets. They specialized in dry goods and groceries, building customer loyalty by selling at a fixed price, extending credit to reliable customers, and offering free space in their safe for storage of their customers' gold.[2]\n\nBy 1860, Allen had moved to San Francisco, a seaport city about 600 miles (970 km) south of Portland, where the company bought most of its supplies. He became a silent partner, uninvolved in day-to-day management. By then the firm of Allen & Lewis had begun to focus on wholesale markets, and by 1880, it was one of the leading wholesale grocery firms on the West Coast.[2] Lewis and three contemporaries, Henry W. Corbett, William S. Ladd, and Henry Failing, who arrived in Portland in 1851 and set up businesses along Front Street,[4] became \"merchant princes of the Northwest\".[5]\n\nWithin 10 years, this group of dedicated Front Street merchants and their families would dominate the economic, political and social life of Portland. All became warm and lasting friends with Ladd, the former teacher and railroad agent, first among equals... With Benjamin Stark and John H. Couch, who became Lewis's father-in-law, they formed Portland's earliest Establishment, one of merchant-entrepreneurs.[4]\n\nIn 1864, these four merchants and others formed the Portland River Channel Improvement Committee, to raise money to make the Willamette shipping channel more easily navigable. This led to a federally funded project by the United States Army Corps of Engineers, which dredged the channel in 1866.[6] In 1891, Lewis was named to the original Port of Portland Commission, established by the Oregon Legislative Assembly to oversee the maritime commercial and shipping interests of the city.[7]\n\nWhen railroads began replacing steamships as a shipping method in the 1870s, Lewis, Ladd, Corbett, Failing, and Simeon Reed (a Portland transportation executive), became the five largest stockholders, aside from Henry Villard, in Villard's Oregon Railway and Navigation Company (OR&N).[8] In 1888, Lewis was part of a group that visited Villard in New York to negotiate favorable shipping rates on the Union Pacific and the Northern Pacific railroads, with which Villard and the OR&N had contracts affecting Portland.[9] Lewis's interest in Portland railroads extended to the Portland & Willamette Valley Railroad, of which he became a local director in 1885, and which was controlled and formally taken over by the Southern Pacific Railroad in 1890.[10]\n\nLewis and the other three pioneer merchants were among those in 1864 who formed the Mercantile Library Association (later renamed the Library Association of Portland) to establish a local subscription library. Roughly 30 years later, after a public library opened in Portland in 1891, members of the Cicero Lewis family were among its largest donors.[11] In 1885, Lewis was one of 15 men named to the Portland Water Committee, empowered by the state legislature to acquire and operate a municipal water system for the city.[12]\n\nFamily, other interests, death\n\nIn 1857 Lewis married Clementine Couch, daughter of John H. Couch, a sea captain and early Portland settler. Unlike many of his friends, Lewis developed few interests beyond his business. His only form of recreation was walking to work, and although he was a charter member of the Arlington Club and could have dined there, he usually walked home for lunch. Historian E. Kimbark MacColl writes that Lewis \"spent his life at his desk and never went out in the evening for entertainment or the theater... He was never known to have taken a pleasure trip, spending what remaining leisure time he had with his wife and 11 children.\"[13] Lewis died of a stroke in 1897 while walking back to work on a Saturday afternoon.[13]\n\nLewis was a member of the Episcopal Church[14] and a Mason.[15] He was one of the largest supporters of Good Samaritan Hospital and Trinity Episcopal Church in Portland.[13] After Lewis died, his wife funded a hospital addition named in his honor at Good Samaritan.[1]\n\nThe Lewis family lived in a house on Fourth and Everett streets until 1881, when they built a large house on a lot in the Couch tract in northwest Portland. The tract, consisting of half of the block between 19th and 20th streets and Everett and Flanders streets, was owned by Mary Couch, Clementine's sister, and was developed by other members of the Couch family.[n 1] The project consisted of four houses, each on a lot 100 feet (30 m) wide and 100 feet (30 m) long.[5] The Lewis property, facing 19th Street, included stables, a greenhouse, and a sweeping drive leading to a carriage porch. Their very large house was built in a stick style that was \"rather simple for its period\", but its interior featured tall windows, a massive staircase, front and rear parlors, a reception room with a marble fireplace, and tall mirrors in elaborate frames, as well as \"rare woods, marble mantels, brocaded walls [and] fine lighting fixtures\" throughout.[5] The four houses on the Couch tract were demolished in the 1960s.[5]\n\nNotes and references\n\nNotes\n\n^ avenues in the 21st century) are numbered in ascending order beginning west of Front Street (later named [16] Central Portland lies on the west side of a bend in the north-flowing Willamette River . With few exceptions, its north–south streets (calledin the 21st century) are numbered in ascending order beginning west of Front Street (later named Naito Parkway ), which runs along the river. In the northwest quadrant of the city, the east–west street names are alphabetical in ascending order beginning with Burnside Street. The first Lewis residence was roughly four blocks west of the river and three blocks north of Burnside, and their second residence was about 20 blocks west of the river and four blocks north of Burnside.\n\nReferences\n\nWorks cited"}, {"url": "https://alchetron.com/Cicero-Hunt-Lewis", "page_content": "Cicero Hunt Lewis (1826–1897) was a prominent merchant and investor in Portland in the U.S. state of Oregon during the second half of the 19th century. Born in New Jersey, Lewis and a friend, Lucius Allen, traveled across the continent in 1851 to open a dry goods and grocery store in what was then a frontier town of about 800 people living along the west bank of the Willamette River. By 1880, their firm, Allen & Lewis, had become one of the leading wholesale grocery companies on the West Coast.\n\nSupporting transportation projects that affected his business, he was a member of the Portland River Channel Improvement Committee in the 1860s, invested in the Oregon Railway and Navigation Company in the 1870s, and was appointed to the original Port of Portland Commission in the 1890s. He helped form a local subscription library in the 1860s, and he was named to the city's first water board in the 1880s.\n\nMarried to Clementine Couch, daughter of another prominent Portland pioneer, Lewis fathered 11 children and after 1881 lived in a large, elegantly furnished house within walking distance of his office. He spent most of his time at work or at home, and had few other interests aside from church and charitable donations. He died in 1897 while walking to work on a Saturday afternoon.\n\nEarly life\n\nBorn in 1826 in Cranbury, New Jersey, Lewis moved with his parents at age 13 to Newburgh, New York. At age 20, he went to New York City to work in the dry-goods business of Chambers, Heiser & Company.\n\nMerchant-entrepreneur\n\nJohn DeWitt, a New York merchant, hired Lewis in 1851 to assist DeWitt's son-in-law, Lucius Allen, in running a wholesale supply house in Portland, a frontier settlement on the West Coast. Portland, with a population of about 800, was in good position to trade via the Willamette and Columbia rivers and the Pacific Ocean with San Francisco and other ports and by land with an increasing number of pioneer farmers in the Willamette Valley. Allen, a friend of Lewis, had tried and failed in 1850 to establish a Portland branch store, and DeWitt thought that the more experienced Lewis would be able to help. In 1883 after several setbacks, the two men opened their own business (independent of New York) in a rented store at Front and \"B\" (Burnside) streets. They specialized in dry goods and groceries, building customer loyalty by selling at a fixed price, extending credit to reliable customers, and offering free space in their safe for storage of their customers' gold.\n\nBy 1860, Allen had moved to San Francisco, a seaport city about 600 miles (970 km) south of Portland, where the company bought most of its supplies. He became a silent partner, uninvolved in day-to-day management. By then the firm of Allen & Lewis had begun to focus on wholesale markets, and by 1880, it was one of the leading wholesale grocery firms on the West Coast. Lewis and three contemporaries, Henry W. Corbett, William S. Ladd, and Henry Failing, who arrived in Portland in 1851 and set up businesses along Front Street, became \"merchant princes of the Northwest\".\n\nWithin 10 years, this group of dedicated Front Street merchants and their families would dominate the economic, political and social life of Portland. All became warm and lasting friends with Ladd, the former teacher and railroad agent, first among equals... With Benjamin Stark and John H. Couch, who became Lewis's father-in-law, they formed Portland's earliest Establishment, one of merchant-entrepreneurs.\n\nIn 1864, these four merchants and others formed the Portland River Channel Improvement Committee, to raise money to make the Willamette shipping channel more easily navigable. This led to a federally funded project by the United States Army Corps of Engineers, which dredged the channel in 1866. In 1891, Lewis was named to the original Port of Portland Commission, established by the Oregon Legislative Assembly to oversee the maritime commercial and shipping interests of the city.\n\nWhen railroads began replacing steamships as a shipping method in the 1870s, Lewis, Ladd, Corbett, Failing, and Simeon Reed (a Portland transportation executive), became the five largest stockholders, aside from Henry Villard, in Villard's Oregon Railway and Navigation Company (OR&N). In 1888, Lewis was part of a group that visited Villard in New York to negotiate favorable shipping rates on the Union Pacific and the Northern Pacific railroads, with which Villard and the OR&N had contracts affecting Portland. Lewis's interest in Portland railroads extended to the Portland & Willamette Valley Railroad, of which he became a local director in 1885, and which was controlled and formally taken over by the Southern Pacific Railroad in 1890.\n\nLewis and the other three pioneer merchants were among those in 1864 who formed the Mercantile Library Association (later renamed the Library Association of Portland) to establish a local subscription library. Roughly 30 years later, after a public library opened in Portland in 1891, members of the Cicero Lewis family were among its largest donors. In 1885, Lewis was one of 15 men named to the Portland Water Committee, empowered by the state legislature to acquire and operate a municipal water system for the city.\n\nFamily, other interests, death\n\nIn 1857 Lewis married Clementine Couch, daughter of John H. Couch, a sea captain and early Portland settler. Unlike many of his friends, Lewis developed few interests beyond his business. His only form of recreation was walking to work, and although he was a charter member of the Arlington Club and could have dined there, he usually walked home for lunch. Historian E. Kimbark MacColl writes that Lewis \"spent his life at his desk and never went out in the evening for entertainment or the theater... He was never known to have taken a pleasure trip, spending what remaining leisure time he had with his wife and 11 children.\" Lewis died of a stroke in 1897 while walking back to work on a Saturday afternoon.\n\nLewis was a member of the Episcopal Church and a Mason. He was one of the largest supporters of Good Samaritan Hospital and Trinity Episcopal Church in Portland. After Lewis died, his wife funded a hospital addition named in his honor at Good Samaritan.\n\nThe Lewis family lived in a house on Fourth and Everett streets until 1881, when they built a large house on a lot in the Couch tract in northwest Portland. The tract, consisting of half of the block between 19th and 20th streets and Everett and Flanders streets, was owned by Mary Couch, Clementine's sister, and was developed by other members of the Couch family. The project consisted of four houses, each on a lot 100 feet (30 m) wide and 100 feet (30 m) long. The Lewis property, facing 19th Street, included stables, a greenhouse, and a sweeping drive leading to a carriage porch. Their very large house was built in a stick style that was \"rather simple for its period\", but its interior featured tall windows, a massive staircase, front and rear parlors, a reception room with a marble fireplace, and tall mirrors in elaborate frames, as well as \"rare woods, marble mantels, brocaded walls [and] fine lighting fixtures\" throughout. The four houses on the Couch tract were demolished in the 1960s.\n\nWorks cited\n\nGaston, Joseph (1911). Portland, Oregon, its history and builders: in connection with the Antecedent Explorations, Discoveries, and Movements of the Pioneers That Selected the Site for the Great City of the Pacific, vol. 2. Chicago, Illinois: The S.J. Clarke Publishing Company.OCLC 1183569. Retrieved March 6, 2010.\n\nMarlitt, Richard. (1978) [1968]. Seventeenth Street, revised ed. Portland, Oregon: Oregon Historical Society. ISBN 0-87595-000-0.\n\nMacColl, E. Kimbark; Stein, Harry H. (1988). Merchants, Money, and Power: The Portland Establishment 1843–1913. Portland, Oregon: The Georgian Press. ISBN 0-9603408-4-X.\n\nMacColl, E. Kimbark. (1976). The Shaping of a City: Business and Politics in Portland, Oregon, 1885 to 1915. Portland, Oregon: The Georgian Press. OCLC 2645815."}, {"url": "https://researchworks.oclc.org/archivegrid/archiveComponent/774893374", "page_content": "Details\n\n.08 cubic ft. (16 photographs in 1 folder)\n\n15 black and white photographs and 1 black and white drawing, ca. 1890-1910, of the exterior and interior of the Cicero Horatius Lewis house at NW 19th and Glisan St. in Portland, Oregon\n\nCicero Hunt Lewis (1826-1897) was a pioneer Portland merchant, born in New Jersey and arrived in Portland in 1851 -- He opened a general store with Lucius H. Allen. He married Clementine Couch in 1857. He was active in many civic and promotional enterprises. He helped incorporate Oregon Central Railroad. He was a promoter of the Willamette Bridge Company, city water works etc\n\nMaterial in the collection formerly designated Photo File #1825\n\nCollection is open to the public\n\nCicero Horatius Lewis Residence Photographic Collection, Org. Lot 552, Oregon Historical Society Research Library\n\nThe Oregon Historical Society is the owner of the materials in the Research Library and makes available reproductions for research, publication, and other uses. Written permission must be obtained from the Research Library before any reproduction use. The Society does not necessarily hold copyright to all of the materials in the collections. In some cases, permission for use may require seeking additional authorization from the copyright owners\n\nCicero Horatius Lewis papers, Mss 787, Oregon Historical Society Research Library, Portland, Or\n\nRelated Resources"}], "Cicero Hunt Lewis graduated from Columbia College in 1845.": [{"url": "https://researchworks.oclc.org/archivegrid/collection/data/323807141", "page_content": "Details\n\n.55 cubic feet (1 document case, 1 oversize folder)\n\nThe collection consists primarily of letters written by Portland, Oregon pioneer merchant Cicero Horatius (or Hunt) Lewis, founder of Allen and Lewis, to his brother David Lewis, who lived in South Amboy, New Jersey. Includes details of business activities, family news, and general information about Portland and Oregon. Also includes letter of May 2, 1852, from Cicero Lewis's wife Clementine (Couch) Lewis; letters regarding the death of Cicero Lewis; and legal documents\n\nOversize folder -- Contains: resolution of Trinity Episcopal Church, Portland, Or., upon the death of Cicero Horatius Lewis, January 11, 1897; certificate of appointment to Lewis from President Rutherford B. Hayes; and page from the hotel register of Seaside House, with names of Lewis family and other prominent Portlanders\n\nThe collection is open to the public\n\nCollection includes photocopies of most of the letters\n\nThe Oregon Historical Society is the owner of the materials in the Research Library and makes available reproductions for research, publication, and other uses. Written permission must be obtained from the Research Library prior to any use of reproductions. The Society does not necessarily hold copyright to all the materials in the collections. In some cases, permission for use of reproductions may require seeking additional authorization from the copyright holders\n\nRelated Resources"}, {"url": "https://archiveswest.orbiscascade.org/ark:/80444/xv45465", "page_content": "Collection is open to the public. Collection must be used in Special Collections and University Archives Reading Room. Collection or parts of collection may be stored offsite. Please contact Special Collections and University Archives in advance of your visit to allow for transportation time.\n\nCicero Hunt Lewis (1826-1897) (also known as Cicero Horatius Lewis) and Lucius H. Allen created the Allen and Lewis mercantile company in Portland, Oregon in 1851. The company was one of the first general mercantile stores in Portland.\n\nThe collection contains five ledgers of sales, cash, consignments and account records, 1851-1868.\n\nThe cash ledger is from 1851-1857.\n\nThe sales ledger is from 1858-1859.\n\nThe general sales ledger is from 1857-1862.\n\nThe Consignments ledger is from 1857-1868.\n\nThere is one oversize account book that is organized by name and includes a name index inside."}, {"url": "https://archiveswest.orbiscascade.org/ark:80444/xv13369", "page_content": "Overview of the Collection\n\nTitle Cicero Hunt Lewis residence photographic collection Dates circa 1890-1910 (inclusive) 1890 1910 Quantity 0.1 cubic feet , (1 folder in shared box) Collection Number Org. Lot 552 Summary Small collection of black and photographs and one drawing of the exterior and interior of the Cicero Hunt Lewis house at NW 19th and Glisan St. in Portland, Oregon. Lewis (1826-1897) emigrated to Portland, Oregon, in 1851. He founded a mercantile firm, Allen and Lewis, with Lucius H. Allen. Repository Oregon Historical Society Research Library\n\n1200 SW Park Avenue\n\nPortland, OR\n\n97205\n\nTelephone: 503-306-5240\n\nFax: 503-219-2040\n\nlibreference@ohs.org Access Restrictions Collection is open for research. Languages English\n\nCicero Hunt Lewis (1826-1897), also known as Cicero Horatius Lewis, was a pioneer Portland merchant. He was born in New Jersey and arrived in Portland in 1851. He founded a mercantile firm, Allen and Lewis, with Lucius H. Allen. He married Clementine Couch in 1857. He was active in many civic and promotional enterprises, and helped incorporate Oregon Central Railroad. He was a promoter of the Willamette Bridge Company and city water works.\n\nFifteen black and white photographs and one black and white drawing, circa 1890-1910, of the exterior and interior of the Cicero Hunt Lewis house at NW 19th and Glisan St. in Portland, Oregon.\n\nPreferred Citation Cicero Hunt Lewis residence photographic collection, Org. Lot 552, Oregon Historical Society Research Library. Restrictions on Use The Oregon Historical Society owns the materials in the Research Library and makes available reproductions for research, publication, and other uses. The Society does not necessarily hold copyright to all materials in the collections. In some cases, permission for use may require seeking additional authorization from copyright owners.\n\nAcquisition Information Drawing gift of Mrs. Sherman Hall, November 1961 (Lib. Acc. 9441). Processing Note Material in the collection was previously part of Photo File #1825. Collection was titled \"Cicero Horatius Lewis residence photographs\" prior to December 2022. Related Materials Cicero Horatius Lewis papers, Mss 787, Oregon Historical Society Research Library."}, {"url": "https://researchworks.oclc.org/archivegrid/collection/data/774893374", "page_content": "Details\n\n.08 cubic ft. (16 photographs in 1 folder)\n\n15 black and white photographs and 1 black and white drawing, ca. 1890-1910, of the exterior and interior of the Cicero Horatius Lewis house at NW 19th and Glisan St. in Portland, Oregon\n\nCicero Hunt Lewis (1826-1897) was a pioneer Portland merchant, born in New Jersey and arrived in Portland in 1851 -- He opened a general store with Lucius H. Allen. He married Clementine Couch in 1857. He was active in many civic and promotional enterprises. He helped incorporate Oregon Central Railroad. He was a promoter of the Willamette Bridge Company, city water works etc\n\nMaterial in the collection formerly designated Photo File #1825\n\nCollection is open to the public\n\nCicero Horatius Lewis Residence Photographic Collection, Org. Lot 552, Oregon Historical Society Research Library\n\nThe Oregon Historical Society is the owner of the materials in the Research Library and makes available reproductions for research, publication, and other uses. Written permission must be obtained from the Research Library before any reproduction use. The Society does not necessarily hold copyright to all of the materials in the collections. In some cases, permission for use may require seeking additional authorization from the copyright owners\n\nCicero Horatius Lewis papers, Mss 787, Oregon Historical Society Research Library, Portland, Or\n\nRelated Resources"}, {"url": "https://www.findagrave.com/memorial/149414263/Cicero-Hunt-Lewis", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.findagrave.com/memorial/6625436/cicero-hunt-lewis", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.ancestry.com/genealogy/records/cicero-hunt-lewis-24-81b31p", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://www.findagrave.com/memorial/149522445/cicero-hunt-lewis", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://researchworks.oclc.org/archivegrid/collection/data/1000_sarchiveswestorbiscascadeorgreposoregon_historical_society_davies_family_research_libraryeadsohy_orglot552xml", "page_content": "Details\n\nSmall collection of black and photographs and one drawing of the exterior and interior of the Cicero Hunt Lewis house at NW 19th and Glisan St. in Portland, Oregon. Lewis (1826-1897) emigrated to Portland, Oregon, in 1851. He founded a mercantile firm, Allen and Lewis, with Lucius H. Allen.\n\nRelated Resources"}, {"url": "https://archiveswest.orbiscascade.org/ark:/80444/xv98844", "page_content": "John Ainsworth (Jack) Mills, Portland banker and civic leader, was born in Portland, Or., on September 25, 1930, the son of Abbot Low Mills, Jr. (1898-1986) and Katherine Ainsworth Mills (1903-1993). He is the descendent of many prominent families in Portland and in the New York City area, including the Mills, Low, Smith, Couch, Lewis, and Ainsworth families.\n\nThe Low family first gained prominence as merchant seamen and ship owners in 18th century New England. Many family members settled in Salem, Mass. Around 1830, as the Salem harbor became difficult to navigate, Seth Low (1782-1853) moved with his wife Mary Porter Low (1786-1872) and their children to Brooklyn, N.Y. There the family achieved great success in shipping and overseas trade. Their activities extended as far as China, and they became leaders in the silk and tea trade, among other commodities. Their ships included the well-known clippers, Houqua and N.B. Palmer. Seth Low's children included Abiel Abbot Low (1811-1893), who served as the head of the firm of A. A. Low & Brothers; the ship captain Charles Porter Low (1824-1913), who later became a prominent land developer in Santa Barbara, Calif., after 1873; Edward Allen Low (1817-1898); and Josiah Orne Low (1821-1895). A daughter, Ellen Porter Low (1827-1898), married Ethelbert Smith Mills, scion of a wealthy land-owning Long Island family. A son of Abiel Abbot Low, Seth Low (1850-1916) was a well-regarded political figure who served as mayor of Brooklyn, president of Columbia University, and reform mayor of the consolidated New York City.\n\nThe Mills Family was connected to the Lows, as noted above, through the marriage of Ellen Porter Low to Ethelbert Smith Mills (1815-1873), but also through the marriage of Josiah Orne Low to Martha Elizabeth Mills (1819-1884). The Mills family came to America from England in 1630, when they settled in Jamaica, Long Island. In 1683 Timothy Mills purchased extensive properties near Smithtown, Long Island, including what is now Mills Pond. The family later intermarried with the Smith, Helme, and Low families. One son of Ethelbert Smith Mills and Ellen Porter Low Mills was Abbot Low Mills (1858-1927), who came to Oregon around 1883 and eventually settled in Portland.\n\nIn the east, Abbot Low Mills pursued a somewhat independent career, starting a tea business as a teenager in Richmond, Va. He later graduated from Harvard University (1881) and entered the family business in New York City. After moving to Oregon around 1882 with a Harvard classmate, William Addison Howe, he tried chicken farming in Yamhill County, then opened a bank in Colfax, Wash., with Charles F. Adams in 1885. Mills helped to found the town of Pullman, Wash., and may have served in the Washington territorial legislature. In 1889 he and Adams organized the Security Savings and Trust Company in Portland. In 1899 Mills became vice preisdent of Portland's First National Bank and in 1903 was elected its president. He was active in numerous political and civic organizations throughout the state. Elected to the Oregon House of Representatives in 1903, he became Speaker of the House in 1904.\n\nIn 1891 Abbot Low Mills married Evelyn Scott Lewis (1865-1936), the daughter of prominent Portland merchant Cicero Hunt Lewis and granddaughter of pioneer John Heard Couch, who had developed the original city center. Among the couple's children were Abbot Low Mills, Jr. (1898-1986), who followed his father into a banking career. In 1924 the younger Mills married Katherine Ainsworth, daughter of banker John Churchill Ainsworth (1870-1943), himself the son of a leading Portland businessman John Commingers Ainsworth (1822-1893). Mills, Jr. worked first as vice president of the First National Bank, then moved in the late 1900s to the U.S. National Bank, which had been founded by the Ainsworths and was headed by Mills's father-in-law. In 1952 Abbot Low Mills, Jr., was appointed a governor of the Federal Reserve Bank in Washington, D.C. by President Harry Truman. He was re-appointed under succeeding presidents and served until 1965. His wife, Katherine Ainsworth Mills, served as the head of volunteers for the American Red Cross.\n\nThe Ainsworth Family began in Oregon with John Commingers Ainsworth (1822-1893), who was one of the most important business and civic leaders in late 19th century Portland. Born into a poor family in Ohio, Ainsworth began working on river steamboats in his teens, eventually becoming a captain on the Mississippi River. He came to California during the 1849 gold rush, moved to Oregon the following year, and took command of the Willamette River steamboat Lot Whitcomb. He went on to build and operate a fleet of steamboats on the Columbia River and founded the Oregon Steam Navigation Company in 1860, and later the Oregon Portage Railroad. Ainsworth's dominance of transportation on the Columbia River was a boon to the development of Portland, which came to be a nexus of inland waterways and ocean-going shipping. Eventually he founded the Ainsworth National Bank, which became the United States National Bank in 1902.\n\nLeadership of the bank passed to Ainsworth's son, John Churchill Ainsworth (1870-1943), whose daughter Katherine married Abbot Low Mills, Jr., in 1924. Their children included John (Jack) Ainsworth Mills (1930- ), who was educated at Cornell University and became vice president of the U. S. National Bank. In 1952 he married Katherine Leadbetter (1932- ), member of another prominent Portland family. It was Jack Mills who preserved the present collection of family papers and presented them to the Oregon Historical Society in 2002."}]}