{"Philip of France was a great builder.": [{"url": "https://www.britannica.com/biography/Philip-II-king-of-France", "page_content": "Philip II , byname Philip Augustus, French Philippe Auguste , (born August 21, 1165, Paris , France—died July 14, 1223, Mantes), the first of the great Capetian kings of medieval France (reigned 1180–1223), who gradually reconquered the French territories held by the kings of England and also furthered the royal domains northward into Flanders and southward into Languedoc. He was a major figure in the Third Crusade to the Holy Land in 1191.\n\nWhen the count of Flanders allied himself with the Champagne faction , there followed a serious revolt against the king. In the Peace of Boves, in July 1185 (confirmed by the Treaty of Gisors in May 1186), the king and the count of Flanders composed their differences (which had been chiefly over possession of Vermandois, in Picardy) so that the disputed territory was partitioned, Amiens and numerous other places passing to the king and the remainder, with the county of Vermandois proper, being left provisionally to Philip of Alsace. Thenceforward the king was free to run against Henry II of England.\n\nWhen Henry II of England arrived in Normandy, perhaps with the intention of responding to an appeal by the house of Champagne, Philip II entered into negotiations with him and, at Gisors on June 28, 1180, renewed an understanding that Louis VII had reached with him in 1177. As a result, the house of Champagne was politically isolated, and Philip II was making all decisions for himself and acting as he saw fit when his father died, on September 18, 1180, leaving him sole king in name as well as in fact.\n\nPhilip was the son of Louis VII of France and Adela of Champagne. In order to be associated as king with his father, who had fallen mortally ill, he was crowned at Reims on November 1, 1179. His uncles of the house of Champagne—Henry I, count of Champagne; Guillaume, archbishop of Reims; and Thibaut V, count of Blois and Chartres—hoped to use the youthful king to control France. To escape from their tutelage , Philip on April 28, 1180, married Isabella, the daughter of Baldwin V of Hainaut and the niece (through her mother) of Philip of Alsace, the count of Flanders, who promised to give the king the territory of Artois as her dowry.\n\nTerritorial expansion\n\nHenry’s French possessions—the so-called Angevin empire, consisting of Normandy, Maine, Anjou, and Touraine, with Aquitaine in the hands of his son, the future Richard I the Lion-Heart of England, and Brittany ruled by another son, Geoffrey (died 1186)—all were a constant menace to the French royal domain. Furthermore, there were long-standing disputes over the Vexin (between Normandy and the Île-de-France), Berry, and Auvergne.\n\nPhilip II launched an attack on Berry in the summer of 1187 but then in June made a truce with Henry, which left Issoudun in his hands and also granted him Fréteval, in Vendômois. Though the truce was for two years, Philip found grounds for resuming hostilities in the summer of 1188. He skillfully exploited the estrangement between Henry and Richard, and Richard did homage to him voluntarily at Bonmoulins in November 1188. Finally, by the Treaty of Azay-le-Rideau, or of Colombières (July 4, 1189), Henry was forced to renew his own homage, to confirm the cession of Issoudun, with Graçay also, to Philip, and to renounce his claim to suzerainty over Auvergne. Henry died two days later.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nRichard, who succeeded Henry as king of England, had already undertaken to go on Crusade against Saladin in the Holy Land (the Third Crusade), and Philip now did likewise. Before his departure, he made the so-called Testament of 1190 to provide for the government of his kingdom in his absence. On his way to Palestine, he met Richard in Sicily, where they promptly found themselves at variance, though they made a treaty at Messina in March 1191. Arriving in Palestine, they cooperated against the Muslims at Acre, until Philip fell ill and made his illness a pretext for returning to France, quite determined to settle the succession to Flanders (Philip of Alsace had just died on the Crusade) while Richard was still absent. Thus, by the end of 1191, Philip II was back in France.\n\nIn spite of promises he had made in the Holy Land, Philip at once prepared to attack the Plantagenet possessions in France. Informed of this, Richard also left the Crusade but was taken prisoner while on his way back by the duke of Austria, Leopold V of Babenberg. Philip did everything he could to prolong his rival’s captivity, but Richard was at last set free (1194) and went to war against Philip. The French king suffered a number of defeats (from that at Fréteval in July 1194 to that at Courcelles in September 1198) in a series of campaigns that were occasionally punctuated by negotiations. It was fortuitous for Philip, however, when Richard was killed in April 1199.\n\nRichard’s brother John was by no means as formidable a fighter. Moreover, his right to Richard’s succession could be contested by Arthur of Brittany, whose father had been senior to John. To secure the succession, therefore, John came to terms with Philip: by the Treaty of Le Goulet (May 22, 1200), in return for Philip’s recognition of him as Richard’s heir, he ceded Évreux and the Norman Vexin to Philip; agreed that Issoudun and Graçay should be the dowry of his niece Blanche of Castile, who was to marry the future Louis VIII (Philip’s son by Isabella of Hainaut); and renounced any claim to suzerainty over Berry and Auvergne.\n\nShortly afterward, however, John entered into conflict with the Lusignan family of Poitou (in Aquitaine), who appealed to Philip as overlord. When he was summoned to appear before the royal court as a vassal of the French crown, John did not present himself, and Philip, in April 1202, pronounced John’s French fiefs forfeit and undertook to carry out the sentence himself. He invaded Normandy, overran the northeast, and laid siege to Arques, while Arthur of Brittany, the son of Geoffrey, who died some years before, campaigned against John’s supporters in Poitou; but John, marching south from Maine, captured Arthur at Mirebeau (August 1). In fury, Philip abandoned the siege of Arques and marched southwestward to Tours, ravaging John’s territory on his way before returning to Paris. Guillaume des Roches, the powerful seneschal of Anjou, who had taken John’s side, came to terms with Philip in March 1203.\n\nResuming operations against Normandy, Philip occupied the towns around the great fortress of Château-Gaillard, to which he laid siege in September 1203, having overruled Pope Innocent III’s attempts to mediate. John, who is reported to have murdered Arthur of Brittany in April, retired to England in December, and Château-Gaillard fell to Philip in March 1204. Rouen, the Norman capital, surrendered in June, after 40 days’ resistance.\n\nAfter his conquest of Normandy, Philip subdued Maine, Touraine, Anjou, and most of Poitou with less difficulty (1204–05), though the castles of Loches and Chinon held out for a year. He sought to secure his conquests by lavishing privileges on the towns and on the religious houses but otherwise left the local barons in power. Unrest, however, was endemic in Poitou, and in June 1206 John landed at La Rochelle. After a campaign in the south, he turned north toward the Loire. At Thouars in October 1206, he and Philip made a two-year truce, leaving John in possession of the reconquered Poitevin lands. In the following year, however, Philip invaded Poitou again; and, after a further campaign in 1208, only the south and part of the west of Poitou remained loyal to John (with Saintonge, Guyenne, and Gascony).\n\nPhilip next hoped to exploit the dispute between John and Pope Innocent III. While Innocent was threatening to declare John unfit to reign (1212), plans were being made for a French landing in England and for the accession of Philip’s son Louis to the English throne. The plans had to be dropped when John made his submission to the pope (1213). Throwing himself into schemes for revenge, John formed a coalition against France: the Holy Roman emperor Otto IV, the count of Flanders (Ferrand, or Ferdinand, of Portugal), and the count of Boulogne (Raynald, or Renaud, of Dammartin) were to invade the Capetian territory from the northeast while John attacked from the west, with the help of his Poitevin barons.\n\nJohn landed at La Rochelle in February 1214 and advanced into Anjou but was put to flight by Louis at La Roche-aux-Moines on July 2; his confederates were completely defeated by Philip in the decisive Battle of Bouvines on July 27. The Anglo-Angevin power in France and the coalition had both been broken in one month. Thus Philip, who, in 1213, had transferred Brittany to his cousin Peter of Dreux, was left without any significant opposition to his rule in France.\n\nIt was not only at the Plantagenets’ expense that Philip enlarged the royal domain. His claim to Artois through his first marriage and his gains by the settlement of 1185–86 have been mentioned above, and he subsequently proceeded, step by step, to acquire the rest of Vermandois and Valois. His insistence on his suzerainty over vacant fiefs and on his tutelage over minors and heiresses was particularly effective with regard to Flanders, where two successive Flemish counts, Philip of Alsace (died 1191) and Baldwin IX (died c. 1205) had left no male issue.\n\nThough he did not personally take part in the Crusade proclaimed by Pope Innocent III against a Cathari religious sect in Languedoc, Philip allowed his vassals and knights to carry it out. Simon de Montfort’s capture of Béziers and Carcassonne (1209) and his victory at Muret over Raymond VI of Toulouse and Peter II of Aragon (1213) prepared the way for the eventual annexation of eastern Languedoc to the royal domain six years after Philip’s death and for the union of northern and southern France under Capetian rule."}, {"url": "https://en.chateauversailles.fr/discover/history/great-characters/philippe-i-duke-orleans", "page_content": "Philippe de France was initially known as “Petit Monsieur”, a title used under the Ancien Régime to refer to the younger brother of the king, and to avoid confusion with the brother of Louis XIII, Gaston, Duke of Orléans, known as “Grand Monsieur”. Upon the death of the latter in 1660 Philippe’s title was revised to simply “Monsieur” and he became, at the age of 20, the head of the Orléans dynasty.\n\nEleven years later, in 1671, after the death of his first wife Henrietta of England, Louis XIV forced his brother to marry Princess Elisabeth Charlotte, Madame Palatine. They had three children, including future regent Philippe II, Duke of Orleans and Mademoiselle de Chartres.\n\nA great fan of effeminate clothing and extravagant outfits, surrounded by male favourites and given to what was euphemistically termed the “Italian vice”, Philippe de France was kept at a safe distance from political matters by the king, who did not approve of his behaviour.\n\nHe nonetheless scored a brilliant victory over William of Orange at the Battle of Cassel on 11th April 1677, one of the defining engagements of the Franco-Dutch War.\n\nMore at home in Paris than at Versailles, Monsieur divided his time between his château in Saint-Cloud and Palais-Royal in the heart of the capital, eschewing the royal court – but not before he had introduced Molière and his theatre company. His château was considered an “alternative Versailles”. The gardens, designed by Le Nôtre, and the state apartments, painted by Mignard, rivalled those of Louis XIV. Philippe died at Saint-Cloud in 1701. His relationship with his brother had always been a complex one, but they shared a deep fraternal affection."}, {"url": "https://www.britannica.com/biography/Philip-IV-king-of-France", "page_content": "Early years\n\nBorn at Fontainebleau while his grandfather was still ruling, Philip, the second son of Philip III (the Bold) and grandson of St. Louis (Louis IX), was not yet three when his mother, Isabella of Aragon, died on her return from the Crusade on which Louis IX had perished. The motherless Philip and his three brothers saw little of their father, who, stricken by Isabella’s death, threw himself into campaigning and administrative affairs. His troubled childhood and the series of blows he suffered explain in some measure the conflicting elements in his adult personality. In 1274 his father married Marie de Brabant, a beautiful and cultivated woman, and, with her arrival at court, intrigue began to flourish. In the same year, the two-year-old Joan, heiress of Champagne and Navarre, was welcomed as a refugee. Reared with the royal children, she would, when she was 12, become the bride of Philip the Fair.\n\nIn 1276 Philip’s elder brother, Louis, died, and the shock of this event, which suddenly made Philip heir to the kingdom, was compounded by persistent rumours of poisoning and suspicions that Philip’s stepmother intended to see Isabella’s remaining sons destroyed. Vague allegations were circulated that Louis’s death was linked with certain unspecified “unnatural acts” of his father. These rumours, never satisfactorily put to rest, together with the unexpected change in Philip’s fortunes, apparently served to arouse in him feelings of insecurity and mistrust.\n\nConsequently, Philip turned elsewhere in search of a model for his own conduct. He found it in Louis IX, whose memory was increasingly venerated as the number of miracles attributed to him mounted. Reports of Louis’s exacting standards of rulership and his saintly virtues were reinforced by the precepts of the religious advisers who surrounded the adolescent Philip. A more self-confident person might have been able to discriminate realistically among the sometimes artificially exaggerated stories and the utopian ideals. Philip, however, became convinced that it was his God-given duty to attain the lofty goals of his grandfather.\n\nBritannica Quiz Kings, Queens, and More Quiz\n\nWhen Philip was 16, he was knighted and married to Joan of Navarre. In 1285 he accompanied his father to the south on a campaign to install Philip’s brother Charles on the throne of Aragon. He had no sympathy with the enterprise, however, which was backed by his stepmother and aimed against the king of Aragon, his late mother’s brother. When his father died in October 1285, Philip immediately abandoned the venture."}, {"url": "https://www.medievalists.net/2021/07/count-philip-i-flanders/", "page_content": "By David W. Vahey\n\nPhilip I Count of Flanders was one of the most controversial nobles in twelfth-century France. His choleric temperament was equaled only by his reputation in many historical and literary works. Where he went, trouble and greatness followed.\n\nPhilip of Alsace, as he was commonly known, was born in 1143, the eldest son of Thierry of Flanders and Sibylla of Anjou. As John W. Baldwin notes, Philip was born into “one of the two richest and best-governed principalities in the kingdom (Normandy was its chief competitor),” with Flanders having a prosperous economy from agriculture and textile manufacturing, and boasting one of the first chanceries in the Low Countries.\n\nAdvertisement\n\nBy the age of 14, Philip was already co-ruler and regent of Flanders, since his father was in the Near East taking part in the crusades. But he could also be found on the tournament circuit. One of the earliest stories told of Philip can be found in The History of William Marshal. The author accuses the Count of hanging on the coattails of Henry the Young King and William Marshal at tournaments: “to vie with the Young King that the good count of Flanders, so valiant and wise, set out to prove his prowess to the world.” Over the course of the tournament Philip and his men put the Young King and his retinue to shame teaching them a lesson in humility.\n\nCount Philip was remembered as a competitor to be reckoned with at the early tournaments. He was renowned for his tactic of preying on the weaknesses of his opponents: “the count of Flanders would bide his time, joining the tourney only when all were flagging and had lost their shape! Then, seeing his advantage, the count, shrewd as well as valiant, would charge in from the flank…that was his tactic every time!” Many opponents would pay dearly for underestimating the Flemish. His ruthless strategy at the tournaments would reward him well with plenty of booty and ransom payments.\n\nAdvertisement\n\nLetter to Hildegard\n\nA lesser-known story tells how Philip wrote to Hildegard of Bingen, a respected German Benedictine abbess and mystic. Miriam Rita Tessera shares this anecdote about how on the eve of taking the cross for his first crusading foray, Count Philip was having doubts. In his letter he asks Hildegard: “[W]hat I ought to do to exalt the name of Christianity in these days and to bring low the terrible savagery of the Saracens, and if it would be useful to me to stay in that land or to return.”\n\nHildegard responded by preaching about the way of administering justice by law and punishment. She reminded him of the common sentiment of per veram penitentian, that is, the first step to true penitence was to acknowledge one’s own guilt. The Count of Flanders was rumored among his peers to have taken his crusading vow to abolish the guilt of recent affairs.\n\nThe letter points to a well-known fact that Philip was prone to bouts of extreme cruelty and violence. Those who are known to have incurred his wrath suffered at the hands of an intemperate man. It is one of the recurring themes in the anecdotes of his life. Historian John D. Hosler shares a salacious episode from after the Count’s participation in the rebellion of King Henry’s heirs in his book Henry II: A Medieval Soldier at War, 1147-1189:\n\nIronically, it was now his old rivals who found themselves engulfed by rebellion. In August, Philip of Flanders, in some ways the cruelest rebel of them all, was rewarded with an uprising of his own. After accusing Walter de Fontaines of having relations with his countess, Philip ordered him beaten with clubs, hung upside down in a sewer, and suffocated to death. In response, the sons of Walter fortified their castles in rebellion and ravaged the Count’s lands, a fitting repercussion of Philip’s role in the uprisings of 1173 and 1174.\n\nAdvertisement\n\nPhilip of Flanders was not a man to be crossed. However, his letters to Hildegard of Bingen bring to light the toll of the Count’s private spiritual concerns as a Christian knight. He would designate his brother-in-law, Baldwin V of Hainaut and his sister, Countess Margaret, as heirs before departing on his pilgrimage for Acre in the Near East.\n\nOn Crusade\n\nPhilip arrived with great promise (and a considerable military force) at Acre in the Holy Land in August of 1177. The Count had been prepared “to subject himself to divine service” as reported by William of Tyre. With “more resources than any other French baron and perhaps even than the monarchy” a great armed force was able to travel with the Count of Flanders, according to historian Malcolm Barber. His arrival seemed to betoken a change in fortune for the wavering Crusader States. Barber elaborates on the great hope that came with Philip’s arrival:\n\nThey would have been encouraged in that belief by the Latin leaders in Jerusalem, for King Baldwin had become very ill, and Philip of Flanders was an obvious replacement, even if only temporarily. Accordingly, the count was offered what William of Tyre calls ‘the rule and general administration of the entire kingdom.’\n\nAdvertisement\n\nThey would be disappointed when he refused to accept the dominion offered by his cousin Baldwin. He would also disappoint them after he refused to join the invasion of Egypt with the Byzantines. Philip would be sufficiently coaxed to help Raymond of Tripoli to attack Hama, and Bohemond of Antioch to besiege Harim. There were complaints, according to Barber, “blaming Philip and his entourage for continually returning to the city to indulge in drinking and the pleasures of the flesh. Morale was not helped by Philip’s frequent references to his desire to return home.” His indulgent imbibing was matched by his fervent devotion to attend religious services. The Count insisted on abandoning a military campaign to return and celebrate Easter service at Jerusalem. Eventually, Philip returned home from the Holy Land to Flanders. Two years after his arrival in the Holy Land he had fulfilled the commitments of his crusader vow.\n\nGreatest Tale Ever Told\n\nCount Philip of Flanders was as respected as he was reviled by his contemporaries. Perhaps what can be considered the most enduring depiction of Philip is found in the dedication of Chretien de Troyes’ Story of the Grail.\n\nChretien had written a poem for the royal courts as entertainment about knights for knights. The Story of the Grail follows the escapades of a young, naïve Welsh country boy who gets caught up in a series of chivalric adventures connected with King Arthur. His poem, according to Richard Barber in The Holy Grail: Imagination and Belief, “was immediately popular … [w]ithin twenty years of the date at which Chretien broke off his work on The Story of the Grail, there were two attempts to continue his story, as well as two new and almost totally different versions of the Grail history.” The date of composition is believed to be sometime in the 1180s.\n\nThe dedication opens with a paraphrased proverb that harkened back to Paul’s Second Epistle to the Corinthians. Chretien is quick to use the conceit and draw a parallel between the success or ‘bounty’ of his story and the prosperity of his patron Philip and his County of Flanders. He celebrates the fact that he “sows it in so good a place that he is bound to reap reward: his work is for the worthiest man in the empire of Rome – Count Philip of Flanders, who is of even greater worth than Alexander.”\n\nAdvertisement\n\nWhat follows is a list extolling the spiritual virtues of Count Philip compared with the vices of Alexander the Great. Alexander III of Macedon was also a very popular figure in the romances of French royal courts. Walter of Chatillon had composed an acclaimed epic poem written in the Latin style of Virgil’s Aeneid about Alexander called The Alexandreis. His poem had been dedicated to William of the White Hands, uncle of Philip II Augustus and Archbishop of Reims.\n\nChretien concludes his checklist of the Count’s virtues in the style of a verse from the First Epistle of John. He invokes the logic of this verse to ask the audience: “the gifts bestowed by good Count Philip are given in charity, prompted only by his kind, fair heart which bids him do good. So is he not of greater worth than Alexander, who gave no thought to charity or other good deeds?” His follow-up to this acclamation draws the pandering verse to a conclusion. All credit should fall to the Count of Flanders: “Chretien’s labor will not be in vain as he strives by the count’s command to put into rhyme the finest tale ever tale told in a royal court.”\n\nA final victory\n\nPhilip’s main adversary in the 1180s was King Philip II of France, so it was somewhat surprising to find them going together to the Near East for the Third Crusade. When Philip, Count of Flanders succumbed to illness on the day before Pentecost at Acre in 1191, news of his death spread quickly. Rumors spread, too, of King Philip II of France abandoning the Third Crusade at the same time to return home back to France. Gilbert of Mons, who was provost of Philip’s brother-in-law, Count Baldwin V of Hainaut, first heard the news at the Imperial court of Rome. The provost records in his Chronicle of Hainaut:\n\nTherefore it is said that King Philip of France returned quickly from those regions to his own land on account of his death, as he would succeed him in his greater properties, having taken this other opportunity both because of the king of England’s hatred and because of his own bodily illness.\n\nKing Philip was expecting to have the element of surprise on his side. Gilbert caught wind of news in Borgo San Donnino that the king of France had dispatched “certain knights (namely, Pierre of Mesnil, and Robert of Wavrin, brother of Hellin the steward, and some others, some of whom died in Italy, but Pierre and Robert came to France and Flanders) from overseas regions to occupy all of the count of Flanders’ land to the count of Hainaut’s detriment.” Wasting no time he quickly dispatched a courier to warn the count of Hainaut of imminent danger.\n\nGilbert of Mons’ courier arrived eight days before the French knights to inform the count of Hainaut. Baldwin V and his vassals raced to secure the regions of Flemish land due (by hereditary right) to be inherited by his wife, countess Marguerite, sister of Count Philip.\n\nThe name of Philip Count of Flanders would indeed live on in infamy.\n\nDavid W. Vahey is an independent scholar. He holds a B.A. with Honours in English from York University. His research focuses on religion, medieval history, and popular literature.\n\nTop Image: Count Philip I of Flanders with a coat of arms showing a black lion. From Rhyming Chronicle of Flanders, created in 1401. Cod.poet.et.phil.fol.22. fol. 282r"}, {"url": "https://www.silverhawkauthor.com/post/castles-in-france-medieval-fortresses-and-chateaux", "page_content": "Medieval Castles, Fortresses and Châteaux in France\n\n(Roman Geber Photo)\n\nChâteau Gaillard is a medieval castle ruin overlooking the River Seine above the commune of Les Andelys, in\n\nthe French department of Eure, in Normandy. It is located some 95 kilometres (59 mi) north-west of Paris and 40\n\nkilometres (25 mi) from Rouen. Construction began in 1196 under the auspices of Richard the Lionheart, who was simultaneously King of England and feudal Duke of Normandy. The castle was expensive to build, but the majority\n\nof the work was done in an unusually short period of time. It took just two years and, at the same time, the town\n\nof Petit Andely was built. Château Gaillard has a complex and advanced design, and uses early principles of\n\nconcentric fortification; it was also one of the earliest European castles to use machicolations (mâchicoulis).\n\n(These are floor openings between the supporting corbels of a battlement, through which stones or other material,\n\nsuch as boiling water or boiling cooking oil, could be dropped on attackers at the base of a defensive wall). The\n\ncastle consists of three enclosures separated by dry moats, with a keep in the inner enclosure.\n\nChâteau Gaillard was captured in 1204 by the king of France, Philip II, after a lengthy siege. In the mid-14th\n\ncentury, the castle was the residence of the exiled David II of Scotland. The castle changed hands several times\n\nin the Hundred Years' War, but in 1449 the French king captured Château Gaillard from the English king\n\ndefinitively, and from then on it remained in French ownership. Henry IV of France ordered the demolition of\n\nChâteau Gaillard in 1599. Although it was in ruins at the time, it was felt to be a threat to the security of the local\n\npopulation. The castle ruins are listed as a monument historique by the French Ministry of Culture. The inner\n\nbailey is open to the public from March to November, and the outer baileys are open all year.\n\nRichard the Lionheart inherited Normandy from his father, Henry II, in 1189 when he ascended to the throne of\n\nEngland. There was a rivalry between the Capetians and the Plantagenêts. Richard as the Plantagenêt king of\n\nEngland was more powerful than the Capetian king of France, despite the fact that Richard was a vassal of the\n\nFrench king and paid homage for his lands in the country. From 1190 to 1192, Richard the Lionheart took part\n\nin the Third Crusade. He was joined by Philip II of France, as each was wary that the other might invade his\n\nterritory in his absence. Richard was captured and imprisoned on the return journey to England, and he was not\n\nreleased until 4 February 1194. In Richard's absence, his brother John revolted with the aid of Philip; amongst\n\nPhilip's conquests in the period of Richard's imprisonment was the Norman Vexin (an historical county of\n\nnorthwestern France), and a few towns nearby, including Le Vaudreuil, Verneuil and Évreux. It took Richard\n\nuntil 1198 to reconquer a part of it.\n\nChâteau Gaillard stands high above the River Seine, an important transport route and on the site of a naturally\n\ndefendable position. The town of Grand Andely rests in the valley below the site. Under the terms of the Treaty\n\nof Louviers (January 1196) between Richard and Philip II, neither king was allowed to fortify the site. In spite\n\nof this treaty, Richard decided to build a castle at Andeli. Its purpose was to protect the duchy of Normandy from\n\nPhilip II, and it helped fill a gap in the Norman defences left by the fall of Château Gisors, and above all Château\n\nde Gaillon, a castle which belonged to Philip and used as an advanced French fortification to block the Seine valley.\n\nChâteau Gaillard also served as a base from which Richard could launch his campaign to take back the Norman\n\nVexin from French control. Les Andelys is located just in front of Gaillon on the other side of the Seine valley.\n\nRichard tried to obtain the manor through negotiation. Walter de Coutances, Archbisho of Rouen, was reluctant\n\nto sell the manor as it was one of the diocese's most profitable, and other lands belonging to the diocese had\n\nrecently been damaged by war. When Philip besieged Aumale in northern Normandy, on the border with Picardy,\n\nRichard grew tired of waiting and seized the manor, although the act was opposed by the Church.\n\nIn an attempt to get Pope Celestine III to intercede, Walter de Coutances left for Rome in November 1196.\n\nRichard sent a delegation to represent him in Rome. One of the party, Richard's, Lord Chancellor William\n\nLongchamp (who was also Bishop of Ely), died during the journey, although the rest, including Philip of Poitou,\n\nBishop of Durham, and Guillaume de Ruffière, Bishop of Lisieux, arrived in Rome. Walter de Coutances\n\nmeanwhile issued an interdict against the Duchy of Normandy, which prohibited church services from being\n\nperformed in the region. Roger of Howden detailed \"the unburied bodies of the dead lying in the streets and\n\nsquare of the cities of Normandy\". Construction began with the interdict hanging over Normandy, but it was later\n\nrepealed in April 1197 by Celestine, after Richard made gifts of land to Walter de Coutances and the diocese of\n\nRouen, including two manors and the prosperous port of Dieppe. The site of Château Gaillard had not been fortified\n\nbefore, and the town of Petit Andely was constructed at the same time; together with the historical Grand Andely,\n\nthe two are known as Les Andelys. The castle sits on a high limestone promontory, 90 m above Les Andelys and\n\noverlooking a bend in the River Seine. The castle was connected with Les Andelys through a series of\n\ncontemporary outworks.\n\nDuring King Richard's reign, the Crown's expenditure on castles declined from the levels spent by Henry II,\n\nRichard's father, although this has been attributed to a concentration of resources on Richard's war with the king\n\nof France. The work at Château Gaillard cost an estimated £12,000 between 1196 and 1198. Richard only spent a\n\nn estimated £7,000 on castles in England during his reign, similar as his father Henry II. The Pipe rolls (a\n\ncollection of financial records maintained by the English Exchequer), for the construction of Château Gaillard\n\ncontain the earliest details of how work was organised in castle building and what activities were involved.\n\nAmong those workmen mentioned in the rolls are miners, stone cutters, quarrymen, masons, lime-workers,\n\ncarpenters, smiths, hodmen, water carriers, soldiers to guard the workers, diggers who cut the ditch surrounding\n\nthe castle, and carters who transported the raw materials to the castle. A master-mason is omitted, and military\n\nhistorian Allen Brown has suggested that it may be because Richard himself was the overall architect; this is\n\nsupported by the interest Richard showed in the work through his frequent presence.\n\nNot only was the castle built at considerable expense, but it was built relatively rapidly. Construction of large\n\nstone castles often took the better part of a decade. The work at Dover castle, for example, took place between\n\n1179 and 1191 (at a cost of £7,000). Richard was present during part of the construction to ensure work proceeded\n\nat a rate he was happy with. According to William of Newburgh, in May 1198 Richard and the labourers working\n\non the castle were drenched in a \"rain of blood\". While some of his advisers thought the rain was an evil omen,\n\nRichard was undeterred: \"the king was not moved by this to slacken one whit the pace of work, in which he took s\n\nuch keen pleasure that, unless I am mistaken, even if an angel had descended from heaven to urge its abandonment\n\nhe would have been roundly cursed\".\n\nAfter just a year, Château Gaillard was approaching completion and Richard remarked \"Behold, how fair is this\n\nyear-old daughter of mine!\" Richard later boasted that he could hold the castle \"were the walls made of butter\".\n\nBy 1198, the castle was largely completed. At one point, the castle was the site of the execution of three soldiers\n\nof the king of France in retaliation for a massacre of Welsh mercenaries ambushed by the French. The three were\n\nthrown to their deaths from the castle's position high above the surrounding landscape. In his final years, the\n\ncastle became Richard's favourite residence, and writs and charters were written at Château Gaillard, bearing\n\n\"apud Bellum Castrum de Rupe\" (at the Fair Castle of the Rock). Richard did not enjoy the benefits of the castle\n\nfor long, however, as he died in Limousin on 6 April 1199, from an infected arrow wound to his shoulder, sustained\n\nwhile besieging Châlus.\n\nAfter Richard's death, King John of England failed to effectively defend Normandy against Philip's ongoing\n\ncampaigns between 1202 and 1204. Château de Falaise fell to Philip's forces, as well as castles from Mortain to\n\nPontorson, while Philip simultaneously besieged Rouen,which capitulated to French forces on 24 June 1204,\n\neffectively ending Norman independence. Philip laid siege to Château Gaillard, which was captured after a long\n\nsiege from September 1203 to March 1204. As Philip continued the siege throughout the winter and King John\n\nmade no attempt to relieve the castle, it was only a matter of time before the castellan was forced to capitulate.\n\nThe main source for the siege is Philippidos, a poem by William the Breton, Philip's chaplain. As a result, modern\n\nscholars have paid little attention to the fate of the civilians of Les Andelys during the siege.\n\nThe local Norman population sought refuge in the castle to escape from the French soldiers who ravaged the town.\n\nThe castle was well supplied for a siege, but the extra mouths to feed rapidly diminished the stores. Between\n\n1,400 and 2,200 non-combatants were allowed inside, increasing the number of people in the castle at least\n\nfive-fold. In an effort to alleviate the pressure on the castle's supplies, Roger de Lacy, the castellan, evicted 500\n\ncivilians. This first group was allowed to pass through the French lines unhindered, and a second group of similar\n\nsize did the same a few days later. Philip was not present, and when he learned of the safe passage of the civilians,\n\nhe forbade further people being allowed through the siege-lines. The idea was to keep as many people as possible\n\nwithin Château Gaillard to drain its resources. Roger de Lacy evicted the remaining civilians from the castle, at\n\nleast 400 people, and possibly as many as 1,200. The group was not allowed through, and the French opened fire\n\non the civilians, who turned back to the castle for safety, but found the gates locked. They sought refuge at the\n\nbase of the castle walls for three months; over the winter, more than half their number died from exposure and\n\nstarvation. Philip arrived at Château Gaillard in February 1204, and ordered that the survivors should be fed and\n\nreleased. Such treatment of civilians in sieges was not uncommon, and such scenes were repeated much later at\n\nthe sieges of Calais in 1346 and Rouen in 1418–1419, both in the Hundred Years' War.\n\nThe French gained access to the outermost ward by undermining its advanced main tower. Following this, Philip\n\nordered a group of his men to look for a weak point in the castle. They gained access to the next ward when a\n\nsoldier named Ralph found a latrine chute in use through which the French could clamber into the chapel. After\n\nambushing several unsuspecting guards, and setting fire to the buildings, Philip's men then lowered the movable\n\nbridge and allowed the rest of their army into the castle. The Anglo-Norman troops retreated to the inner ward.\n\nAfter a short time the French successfully breached the gate of the inner ward, and the garrison retreated finally\n\nto the keep. With supplies running low Roger de Lacy and his garrison of 20 and 120 other soldiers surrendered\n\nto the French army, bringing the siege to an end on 6 March 1204. In drawn-out medieval sieges, contemporary\n\nwriters often emphasised the importance of dwindling supplies in the capitulation of the garrison, as was the case\n\nwith the Siege of Château Gaillard. With the castle under French control, the main obstacle to the French entering\n\nthe Seine valley was removed. They were able to enter the valley unmolested and take Normandy. Thus, for the\n\nfirst time since it had been given as a duchy to Rollo in 911, Normandy was directly ruled by the French king.\n\nThe city of Rouen surrendered to Philip II on 23 June 1204. After that, the rest of Normandy was easily conquered\n\nby the French.\n\nAn impression by Eugène Viollet-le-Duc, a 19th-century architect experienced in renovating castles, of how the\n\nSiege of Château Gaillard would have looked.\n\nIn 1314, Château Gaillard was the prison of Margaret and Blanche of Burgundy, future queens of France. They\n\nhad been convicted of adultery in the Tour de Nesle Affair, and after having their heads shaved they were locked\n\naway in the fortress. Following the Scottish defeat at the Battle of Halidon Hill in 1333 during the Second War of\n\nScottish Independence, the child-king David II and certain of his court were forced to flee to France for safety.\n\nAt the time, southern Scotland was occupied by the forces of King Edward III of England. David, then nine years\n\nold, and his bride Joan of the Tower, the twelve-year-old daughter of Edward II, were granted the use of Château\n\nGaillard by Philip VI. It remained their residence until David's return to Scotland in 1341. David did not stay\n\nout of English hands for long after his return; he was captured after the Battle of Neville's Cross in 1346 and\n\nendured an eleven-year captivity in the Tower of London.\n\nDuring the Hundred Years' War between the English and French crowns, possession of the castle switched several\n\ntimes. Château Gaillard, along with Château de Gisors, Ivry-la-Bataille and Mont Saint-Michel, was one of four\n\ncastles in the Normandy which offered resistance to Henry V of England in 1419, after the capitulation of Rouen\n\nand much of the rest of the Duchy. Château Gaillard was besieged for a year before it was surrendered to the\n\nEnglish in December 1419. All the resisting castles except Mont Saint-Michel eventually fell, and Normandy\n\nwas temporarily returned to English control. Étienne de Vignolles, a mercenary (routier) known as La Hire, then\n\nre-captured Château Gaillard for the French in 1430. However, the English were revived by the capture and\n\nexecution of Joan of Arc, and although by then the war was turning against them, a month later they captured\n\nChâteau Gaillard again. When the French gained ascendancy again between 1449 and 1453 the English were\n\nforced out of the region, and in 1449 the castle was taken by the French for the last time.\n\nBy 1573, Château Gaillard was uninhabited and in a ruinous state, but it was still believed that the castle posed a\n\nthreat to the local population if it was repaired. Therefore, at the request of the French States-General, King Henry IV\n\nordered the demolition of Château Gaillard in 1599. Some of the building material was reused by Capuchin monks\n\nwho were granted permission to use the stone for maintaining their monasteries. In 1611, the demolition of\n\nChâteau Gaillard came to an end. The site was left as a ruin, and in 1862 was classified as a monument historique.\n\nIn 1962, a conference on the contributions of the Normans to medieval military architecture was held at Les Andelys.\n\nAllen Brown attended the conference and remarked that the castle was \"in satisfying receipt of skilful care and\n\nattention\". The journal Château Gaillard: Études de Castellogie Médiévale, which was published as a result of\n\nthe conference, has since run to 23 volumes, based on international conferences on the subject of castles. In the 1990s, archaeological excavations were carried out at Château Gaillard. The excavations investigated the north\n\nof the fortress, searching for an entrance postulated by architect Eugène Viollet-le-Duc, but no such entrance was\n\nfound. However, the excavation did reveal that there was an addition to the north of the castle to enable the use\n\nof guns. Typologically, the structure has been dated to the 16th century.\n\nThe conclusion of the excavations was that the site had \"enormous archaeological potential\", but that there were\n\nstill unanswered questions about the castle. After Philip II took Chateau Gaillard, he repaired the collapsed tower\n\nof the outer bailey that had been used to gain access to the castle. The archaeological investigation examined the\n\ntower generally thought to be the one collapsed by Philip, and although it did not recover any dating evidence, the\n\nconsensus is that he completely rebuilt the tower. In conjunction with the archaeological work, efforts were made\n\nto preserve the remaining structures. Today, Château Gaillard's inner bailey is open to the public from March to\n\nNovember, while the outer baileys are open all year round.\n\nChâteau Gaillard consists of three baileys, an inner, a middle, and an outer with the main entrance to the castle,\n\nand a keep, also called a donjon, in the inner-bailey. The baileys, which were separated by rock-cut ditches,\n\nhoused the castle's stables, workshops, and storage facilities. It is common for extant castles to be the result of\n\nseveral phases of construction, and to be adapted and added to over the period of their use. Château Gaillard,\n\nhowever, is essentially the result of one period of building. The division into three wards bears similarities with\n\nthe design of Château de Chinon, built by Henry II in the mid-12th century on a promontory overlooking a town.\n\nThe outer bailey is the southernmost feature of the castle. It is pentagon shaped, and there are five towers spaced\n\nalong the wall, three of which are at corners. North of the outer bailey is the middle bailey which is an irregular\n\npolygon. Like the outer bailey, the wall of the middle bailey is studded with towers. The towers allowed the\n\ngarrison to provide enfilading fire. In the fashion of the time. Most of the towers in the curtain walls of the\n\nmiddle and outer baileys were cylindrical. Château Gaillard was one of the first castles in Europe to use\n\nmachicolations, stone projections on top of a wall with openings that allowed objects to be dropped on an enemy\n\nat the base of the wall. Machicolations were introduced to Western architecture as a result of the Crusades. Until\n\nthe 13th century, the tops of towers in European castles had usually been surrounded by wooden galleries, which\n\nserved the same purpose as machicolations. An Eastern innovation, they may have originated in the first half of\n\nthe 8th century.\n\nWithin the middle bailey was the inner bailey. The gatehouse from the middle to the inner-bailey was one of the\n\nearliest examples of towers flanking the entrance to remove the blind-spot immediately in front of the gate. This\n\nwas part of a wider trend from around the late 12th or 13th century onwards for castle gateways to be strongly\n\ndefended. The design of the inner bailey, with its wall studded with semi-circular projections, is unparalleled.\n\nThis innovation had two advantages: firstly, the rounded wall absorbed the damage from siege engines much\n\nbetter as it did not provide a perfect angle to aim at; secondly, the arrowslits in the curved wall allowed arrows\n\nto be fired at all angles. The inner bailey, which contained the main residential buildings, used the principles of\n\nconcentric defence. This and the unusual design of the inner bailey's curtain wall meant that castle was advanced\n\nfor its age, since it was built before concentric fortification was fully developed in Crusader castles such as Krak\n\ndes Chevaliers. Concentric castles were widely copied across Europe. When Edward I of England, who had himself\n\nbeen on Crusade, built castles in Wales in the late 13th century, four of the eight he founded were concentric.\n\nThe keep was inside the inner bailey and contained the king's accommodation. It had two rooms: an antechamber\n\nand an audience room. While Allen Brown interpreted the audience room as the king's chamber, historian Liddiard\n\nbelieves it is probably a throne room. A throne room emphasises the political importance of the castle. In England\n\nthere is nothing similar to Château Gaillard's keep, but there are buildings with a similar design in France in the 12th\n\nand 13th centuries.\n\nAllen Brown described Château Gaillard as \"one of the finest castles in Europe\" and the military historian Sir\n\nCharles Oman wrote in 1924 that: \"Château Gaillard, as we have already had occasion to mention, was\n\nconsidered the masterpiece of its time. The reputation of its builder, Coeur de Lion, as a great military engineer\n\nmight stand firm on this single structure. He was no mere copyist of the models he had seen in the East, but\n\nintroduced many original details of his own invention into the stronghold\".\n\nDespite Château Gaillard's reputation as a great fortress, Liddiard highlights the absence of a well in the keep as\n\na peculiar weakness, and the castle was built on soft chalk, which would have allowed the walls to be undermined.\n\nBut other sources evoke the presence of three wells in the three different baileys and the soft chalk does not really\n\nweaken the very thick walls. Its weakness is more the result of its location (higher hill behind), its extension (more\n\nthan 200 metres (660 ft)) on a long narrow ridge and the difficulties in linking up the different baileys to allow a\n\ngood communication and to secure an efficient defence without a large garrison.\n\nChâteau Gaillard was important not solely as a military structure, but as a salient symbol of the power of Richard\n\nthe Lionheart. It was a statement of dominance by Richard, having reconquered the lands Philip II had taken.\n\nCastles such as Château Gaillard in France, and Dover in England, were amongst the most advanced of their age,\n\nbut were surpassed in both sophistication and cost by the works of Edward I of England in the latter half of the\n\n13th century. (Friar, Stephen (2003), The Sutton Companion to Castles, Stroud: Sutton Publishing), (Liddiard, Robert\n\n(2005), Castles in Context: Power, Symbolism and Landscape, 1066 to 1500, Macclesfield: Windgather Press Ltd)\n\n(Urban Photo)\n\nThe keep of Château Gaillard.\n\n(Philippe Alès Photo)\n\nChâteau Gaillard.\n\n(Olivier Cambus Photo)\n\nAerial view of Château Gaillard.\n\n(Sylvan Verlaine Photo)\n\nAerial view of Château Gaillard.\n\n(Michel Cheron Photo)\n\nChâteau Gaillard.\n\n(Casper Moller Photo)\n\nChâteau Gaillard.\n\n(ignis Photo)\n\nChâteau de Foix (Castèl de Fois) is a castle which dominates the town of Foix in the French départment of Ariège.\n\nAn important tourist site, it is known as a centre of the Cathars. It has been listed since 1840 as a monument\n\nhistorique by the French Ministry of Culture.\n\nBuilt In the style of 7th-century fortification, the castle is known from 987. In 1002, it was mentioned in the will\n\nof Roger I, Count of Carcassone, who bequeathed the fortress to his youngest child, Bernard. In effect, the family\n\nruling over the region were installed here which allowed them to control access to the upper Ariège valley and to\n\nkeep surveillance from this strategic point over the lower land, protected behind impregnable walls. In 1034, the\n\ncastle became the capital of the County of Foix, and played a decisive role in medieval military history. During\n\nthe two following centuries, the castle was home to Counts with shining personalities who became the soul of the\n\nOccitan resistance during the crusade against the Albigensians. The county became a privileged refuge for\n\npersecuted Cathars.\n\nThe castle, often besieged (notably by Simon de Montfort in 1211 and 1212), resisted assault and was only taken\n\nonce, in 1486, thanks to treachery during the war between two branches of the Foix family. From the 14th century,\n\nthe Counts of Foix spent less and less time in the uncomfortable castle, preferring the Governors' Palace (Palais\n\ndes gouverneurs). From 1479, the Counts of Foix became Kings of Navarre and the last of them, Henri IV of\n\nFrance, annexed his Pyrrenean lands to France. As seat of the Governor of the Foix region from the 15th century,\n\nthe castle continued to ensure the defence of the area, notably during the Wars of Religion. Alone of all the castles\n\nin the region, it was exempted from the destruction orders of Richelieu (1632-1638).\n\nUntil the Revolution, the fortress remained a garrison. Its life was brightened with grand receptions for its\n\ngovernors, including the Count of Tréville, captain of musketeers under Louis XIII and Marshal Philippe Henri\n\nde Ségur, one of Louis XVI's ministers. The Round Tower, built in the 15th century, is the most recent, the two\n\nsquare towers having been built before the 11th century. They served as a political and civil prison for four\n\ncenturies until 1862.\n\nSince 1930, the castle has housed the collections of the Ariège départemental museum. Sections on prehistory,\n\nGallo-Roman and mediaeval archaeology tell the history of Ariège from ancient times. Currently, the museum is\n\nrearranging exhibits to concentrate on the history of the castle site so as to recreate the life of Foix at the time of\n\nthe Counts. (AUÉ, Michèle (1992). Discover Cathar Country. Pleasance, Simon (trans.). Vic-en-Bigorre, France: MSM)\n\n(Jean Louis Venet Photo)\n\nChâteau de Foix.\n\n(Patrick Castay Photo)\n\nChâteau de Foix.\n\n(BLUMJ Photo)\n\nChâteau de Foix.\n\n(Krzysztof Golik Photo)\n\nChâteau de Foix.\n\n(Nitot Photo)\n\nChâteau de Falaise is a castle located in the south of the commune of Falaise (cliff) in the department of Calvados,\n\nin the region of Normandy, France. William the Conqueror, the son of Duke Robert of Normandy, was born in an\n\nearlier castle on the same site in about 1028. William went on to conquer England and become king, and possession\n\nof the castle descended through his heirs until the 13th century when it was captured by King Philip II of France.\n\nPossession of the castle changed hands several times during the Hundred Years' War. The castle was abandoned\n\nduring the 17th century. Since 1840 it has been protected as a monument historique.\n\nOn the death of Richard II, Duke of Normandy, in August 1026 his son (also called Richard) succeeded to the duchy.\n\nThe inheritance however was disputed by Richard III's younger brother, Robert. Not content with his inheritance\n\nof the town of Exmes and its surrounding area, Robert rebelled and took up arms against his brother and he captured\n\nthe castle of Falaise. Richard besieged the castle and forced Robert to submit to him, however the duke died from\n\nunknown causes in 1027 and was succeeded by his brother. Robert fathered an illegitimate son by a woman named\n\nHerleva, who was from the town of Falaise and the daughter of a chamberlain. The child, William, was born in\n\nabout 1028.\n\nThe castle (12th–13th century), which overlooks the town from a high crag, was formerly the seat of the Dukes of\n\nNormandy. The construction was started on the site of an earlier castle in 1123 by Henry I of England, with the\n\nlarge keep (grand donjon). Later was added the \"small keep\" (petit donjon). The tower built in the first quarter\n\nof the 12th century contained a hall, chapel, and a room for the lord, but no small rooms for a complicated household\n\narrangement; in this way, it was similar to towers in England at Corfe, Norwich and Portchester.\n\nArthur I, Duke of Brittany, was King John of England's teenage nephew, and a rival claimant to the throne of\n\nEngland. With the support of King Philip II of France, Arthur embarked on a campaign in Normandy against\n\nJohn in 1202, and Poitou revolted in support of Arthur. The Duke of Brittany besieged his grandmother, Eleanor\n\nof Aquitaine, in the Château de Mirebeau. John marched on Mirebeau, taking Arthur by surprise and capturing\n\nhim on 1 August. From there Arthur was conveyed to Falaise where he was imprisoned in the castle's keep.\n\nAccording to contemporaneous chronicler Ralph of Coggeshall, John ordered two of his servants to mutilate the\n\nduke. Hugh de Burgh was in charge of guarding Arthur and refused to let him be mutilated, but to demoralise\n\nArthur's supporters, announced his death. The circumstances of Arthur's death are unclear, though he probably died in 1203.\n\nIn about 1207, after having conquered Normandy, Philip II Augustus ordered the building of a new cylindrical keep.\n\nIt was later named the Talbot Tower (Tour Talbot) after the English commander responsible for its repair during the\n\nHundred Years' War. It is a tall round tower, similar design to the towers built at Gisors and the medieval Louvre.\n\nPossession of the castle changed hands several times during the Hundred Years' War. The castle was deserted\n\nduring the 17th century.\n\nA programme of restoration was carried out between 1870 and 1874. The castle was damaged during a\n\nbombardment during the Second World War in the battle for the Falaise pocket in 1944, but the three keeps were\n\nunscathed.\n\n(Ollamh Photo)\n\nChâteau de Falaise.\n\n(rene boulay Photo)\n\nChâteau de Falaise.\n\n(rene boulay Photo)\n\nChâteau de Falaise.\n\nGround plan of Château de Falaise.\n\n(Brady Benot Photo)\n\nChâteau de Falaise.\n\n(Brady Benot Photo)\n\nChâteau de Falaise.\n\n(Viault Photo)\n\nAerial view of Château de Falaise.\n\n(Nitot Photo)\n\nChateau-de-Gisors, Eure, Normandy, France. The castle was a key fortress of the Dukes of Normandy in the 11th\n\nand 12th centuries. It was intended to defend the Anglo-Norman Vexin territory from the pretensions of the King\n\nof France. In 1193, while King Richard I of Enlgand (also Duke of Normandy) was imprisoned in Germany, the\n\ncastle fell into the hands of King Philip II of France. After Richard's death in 1199, Philip conquered much of the\n\nrest of Normandy and Gisors thereafter lost a good part of its importance as a frontier castle. The castle is also\n\nknown for its links with the Templars. Put into their charge by the French king between 1158 and 1160, it became\n\nthe final prison of the Grand Master of the Order, Jacques de Molay, in 1314. Although it has been estimated that\n\nthe bailey could have housed 1,000 soldiers, in 1438 (during the Hundred Years' War) the English garrison\n\nnumbered just 90. By 1448, this had decreased to 43.\n\nThe first building work is dated to about 1095, and consisted of a motte, which was enclosed in a spacious\n\ncourtyard or bailey. Henry I of England, Duke of Normandy, added an octagonal stone keep to the motte. After\n\n1161, important reinforcement work saw this keep raised and augmented; the wooden palisade of the motte\n\nconverted to stone, thus forming a chemise; and the outer wall of the bailey was completed in stone with flanking\n\ntowers. The octagonal keep is considered one of the best preserved examples of a shell keep. A second keep,\n\ncylindrical in shape, called the Prisoner's Tower (tour du prisonnier), was added to the outer wall of the castle at\n\nthe start of the 13th century, following the French conquest of Normandy. Further reinforcement was added\n\nduring the Hundred Years' War. In the 16th century, earthen ramparts were built.\n\n(Gi.bareau Photo)\n\nChateau-de-Gisors.\n\n(Pierre Poschadel Photo)\n\nChateau-de-Gisors.\n\n(CJ DUB Photo)\n\nChateau-de-Gisors.\n\n(Patrick Rock Photo)\n\nChateau-de-Gisors, the keep, Eure, Normandy, France.\n\n(Marc Ryckaert Photo)\n\nThe Château d'Angers is acastle in the city of Angers in the Loire Valley, in the département of Maine-et-Loire,\n\nin France. Founded in the 9th century by the Counts of Amjour, it was expanded to its current size in the 13th\n\ncentury. It is located overlooking the river Maine. It has been listed as a historical monument since 1875. Now\n\nopen to the public, the Château d'Angers is home of the Apocalypse Tapestry.\n\nOriginally, the Château d'Angers was built as a fortress at a site inhabited by the Romans because of its strategic\n\ndefensive location. In the 9th century, the Bishop of Angers gave the Counts of Anjou permission to build a castle\n\nin Angers. The construction of the first castle began under Count Fulk III (970–1040), who was celebrated for his\n\nconstruction of dozens of castles. He built Château d'Angers to protect Anjou from the Normans. It became part\n\nof the Angevin Empire of the Plantagenet Kings of England during the 12th century. In 1204, the region was\n\nconquered by Philip II, and the new castle was constructed during the minority of his grandson, Louis IX (Saint\n\nLouis) in the early part of the 13th century. Louis IX rebuilt the castle in whitestone and black slate, with 17\n\nsemicircular towers. The construction undertaken in 1234 cost 4,422 livres, roughly one per cent of the estimated\n\nroyal revenue at the time. Louis gave the castle to his brother, Charles in 1246.\n\nIn 1352, King John II le Bon, gave the castle to his second son, Louis, who later became the Count of Anjou. He\n\nmarried the daughter of the wealthy Duke of Brittany, and with her wealth, Louis had the castle modified. In 1373,\n\nhe commissioned the famous Apocalypse Tapestry, from from a work of art the painted by Hennequin de Bruges,\n\nand the Parisian tapestry-weaver Nicolas Bataille. Louis II (Louis I's son) and Yolande d'Aragon, added a chapel\n\n(1405–12) and royal apartments to the complex. The chapel is a sainte chapelle, the name given to churches which\n\nenshrined a relic of the Passion. The relic at Angers was a splinter of the fragment of the True Cross which had\n\nbeen acquired by Louis IX.\n\nIn the early 15th century, the hapless dauphin who, with the assistance of Joan of Arc would become King\n\nCharles VII, had to flee Paris and was given sanctuary at the Château d' Angers.\n\nIn 1562, Catherine de Medici, had the castle restored as a powerful fortress, but her son, Henry III, reduced the\n\nheight of the towers and had the towers and walls stripped of their embattlements. Henry III then used the castle\n\nstones to build streets and develop the village of Angers. Because of the threat of attacks from the Hugenots,\n\nhowever, the king maintained the castle's defensive capabilities by making it a military outpost and by installing\n\nartillery on the château's upper terraces. At the end of the 18th century, as a military garrison, it showed its worth\n\nwhen its thick walls withstood a massive bombardment by cannons from the Vendean army. Unable to do defeat\n\nthe walls, the invaders withdrew.\n\nA military academy was established in the castle to train young officers in the strategies of war. Arthur Wellesley,\n\n1st Duke of Wellington, best known for taking part in the defeat of Napoleon Bonaparte at the Battle of Waterloo\n\nin 1815, was trained at the Military Academy of Angers. The academy was later moved to Saumur and the castle\n\nwas used for the rest of the 19th century as a prison, powder magazine and barracks.\n\nThe castle continued to be used as an armory through the First and Second World Wars. It was severely damaged\n\nduring the Second World War by the Nazis, when an ammunition storage dump inside the castle exploded.\n\nOn 10 January 2009, the castle suffered severe damage from an accidental fire due to electrical wires short-circuiting.\n\nThe Royal Logis, which contains old tomes and administrative offices, was the most heavily damaged part of the\n\nchateau, resulting in 400 square metres (4,300 sq ft) of the roof being completely burnt. The Tapestries of the\n\nApocalypse were not damaged. Total damages have been estimated at 2 million Euros. The City of Angers now\n\nowns the massive, austere castle, and it has been converted to a museum housing the oldest and largest collection\n\nof medieval tapestries in the world. It maintains the 14th-century \"Apocalypse Tapestry\" as one of its priceless\n\ntreasures. As a tribute to its fortitude, the castle has never been taken by any invading force in history.\n\nThe outer wall is 3 metres (9.8 ft) thick, extends for about 660 m (2,170 ft) and is protected by seventeen massive\n\ntowers. Each of the perimeter towers measures 18 m (59 ft) in diameter. The château covers an area of 20,000\n\nsquare metres (220,000 sq ft). Two pairs of towers form the city and landward entrances of the château. Each of\n\nthe towers was once 40 metres (130 ft) in height, but they were later cut down for the use of artillery pieces. The\n\nTour du Moulin is the only tower which conserves the original elevation.\n\n(Delbos, Claire (2010), La France fortifiée: Châteaux, citadelles et forteresses (in French), Petit Futé)\n\n(Chatsam Photo)\n\nChâteau d'Angers.\n\n(Chatsam Photo)\n\nChâteau d'Angers, entrance.\n\n(Denis Jarvis Photo)\n\nChâteau d'Angers.\n\nGround plan of Château d'Angers: A: gate to the medieval town; B: south gate; C: Tour de moulin; D: royal\n\nlodgings; E: chatelet (a type of gatehouse); F: gallery of the Apocalypse Tapestry; G: great hall; H: chapel; I:\n\ngovernor's lodgings; J: inner court; K: gardens; L: terraced gardens.\n\n(Kauczuk Photo)\n\nChâteau d'Angers keep.\n\n(Nataloche Photo)\n\nChâteau d'Angers.\n\n(Kimon Berlin Photo)\n\nThe Apocalypse Tapestry at Château d'Angers.\n\n(Wrtalya Photo)\n\nChâteau du Haut-Kœnigsbourg is a medieval castle located in the commune of Orschwiller in the Bas-Rhin\n\ndépartment of Alsace. It is located in the Vosges mountains just west of Sélestat, situated in a strategic area on a\n\nrocky spur overlooking the Upper Rhine Plain. It was used by successive powers from the Middle Ages until the\n\nThirty Years' War, when it was abandoned. From 1900 to 1908 it was rebuilt at the behest of the German Kaiser\n\nWilhelm II. Today it is a major tourist site, attracting more than 500,000 visitors a year.\n\nThe Buntsandstein cliff was first mentioned as Stofenberk (Staufenberg) in a 774 deed issued by the Frankish\n\nking Charlemagne. Mentioned again in 854, it was at that time a possession of the French Basilica of St. Denis,\n\nand the site of a monastery. It is not known when the first castle was built on this site, but a Burg Staufen (Castrum\n\nEstufin) is documented in 1147, when the monks complained to King Louis VII of France about its unlawful\n\nconstruction by the Hohenstaufen Duke Frederick of Swabia. Frederick's younger brother Conrad III, had been\n\nelected King of the Romans in 1138. He was succeeded by Frederick's son Frederick Barbarossa in 1152, and by\n\n1192 the castle was called Kinzburg (Königsburg, \"King's Castle\").\n\nIn the early thirteenth century, the fortification passed from the Hohenstaufen family to the dukes of Lorraine,\n\nwho entrusted it to the local Rathsamhausen knightly family and the Lords of Hohenstein, who held the castle\n\nuntil the fifteenth century. As the Hohensteins allowed some robber barons to use the castle as a hideout, and\n\ntheir behaviour began to exasperate the neighbouring rulers, in 1454 it was occupied by Elector Palatine Frederick I.\n\nIn 1462, the castle was set ablaze by the unified forces of the cities of Colmar, Strasbourg and Basel.\n\nIn 1479, the Habsburg Emperor Frederick III granted the castle ruins in fief to the Counts of Thierstein, who\n\nrebuilt them with a defensive system suited to the new artillery of the time. When in 1517 the last Thierstein died,\n\nthe castle became a reverted fief and again came into the possession of the Habsburg emperor of the day,\n\nMaximilian I. In 1633, during the Thirty Years' War, in which Catholics forces fought Protestants, the Imperial\n\ncastle was besieged by Protestant Swedish forces. After a 52-day siege, the castle was burned and looted by the\n\nSwedish troops. For several hundred years it was left unused, and the ruins became overgrown by the forest.\n\nVarious romantic poets and artists were inspired by the castle during this time.\n\nThe ruins had been listed as a \"monument historique\" of the Second French Empire since 1862 and were purchased\n\nby the township of Sélestat (or Schlettstadt) three years later. After the Franco-Prussian War of 1870 to 1871, the\n\nregion was incorporated into the German Imperial Territory of Alsace-Lorraine, and in 1899 the citizens granted\n\nwhat was left of the castle to the German Emperor Wilhelm II. Wilhelm wished to create a castle lauding the\n\nqualities of Alsace in the Middle Ages and more generally of German civilization stretching from Hohkönigsburg\n\nin the west to (likewise restored) Marienburg Castle in the east. He also hoped the restoration would reinforce the\n\nbond of Alsatians with Germany, as they had only recently been incorporated into the newly established German\n\nEmpire. The management of the restoration of the fortifications was entrusted to the architect Bodo Ebhart, a\n\nproven expert on the reconstruction of medieval castles. Work proceeded from 1900 to 1908. On 13 May 1908,\n\nthe restored Hohkönigsburg was inaugurated in the presence of the Emperor. In an elaborate re-enactment c\n\neremony, a historic cortege entered the castle, under a torrential downpour.\n\nEbhart's aim was to rebuild it, as near as possible, to the way it was on the eve of the Thirty Years' War. He relied\n\nheavily on historical accounts but, occasionally lacking information, he had to improvise some parts of the\n\nstronghold. For example, the Keep tower is now reckoned to be about 14 metres too tall. Wilhelm II, who\n\nregularly visited the construction site via a specially built train station in nearby Saint-Hippolyte, also encouraged\n\ncertain modifications that emphasised a Romantic nostalgia for Germanic civilization. For example, the main\n\ndining hall has a higher roof than it did at the time, and links between the Hohenzollern family and the Habsburg\n\nrulers of the Holy Roman Empire are emphasized. The Emperor wanted to legitimise the House of Hohenzollern\n\nat the head of the Second Empire, and to assure himself as worthy heir of the Hohenstaufens and the Habsburgs.\n\nAfter the end of the First World War, the French state confiscated the castle in accordance with the 1919 Treaty of\n\nVersailles. It has been listed since 1862 and classified since 1993 as a \"monument historique\", by the French\n\nMinistry of Culture. In 2007, ownership was transferred to the Bas-Rhin département.Today, it is one of the most\n\nfamous tourist attractions in the region. Bodo Ebhardt restored the castle following a close study of the remaining\n\nwalls, archives and other fortified castles built at the same period.\n\nEngraving of Château du Haut-Kœnigsbourg ruins, 1889, by T. Taylor.\n\nPlan view of Château du Haut-Kœnigsbourg.\n\n(Gzen92 Photo)\n\nChâteau du Haut-Kœnigsbourg, view from the village of Orschwiller.\n\n(Meffo Photo)\n\nChâteau du Haut-Kœnigsbourg, main entrance.\n\n(Gregorini Demetrio Photo)\n\nChâteau du Haut-Kœnigsbourg, main entrance.\n\n(Zairon Photo)\n\nReliefs over the top of the main entrance to the Château du Haut-Kœnigsbourg.\n\n(Fr Antunes Photo)\n\nChâteau du Haut-Kœnigsbourg, view looking East.\n\n(Michael Schmalenstroer Photo)\n\nChâteau du Haut-Kœnigsbourg, Grand Bastion.\n\n(Bernard Chenal Photo)\n\nChâteau du Haut-Kœnigsbourg, view from the village of Orschwiller.\n\n(Alsace Destination Tourisme, Aerial Photo)\n\nChâteau fort de Fleckenstein is a ruined castle in the commune of Lembach, in the Bas-Rhin département of\n\nFrance. This fortress, built in the shape of 52 m long boat, stands on a dramatic rock face and has a long history.\n\nThe castle was built on a sandstone summit in the Middle Ages. An ingenious system for collecting rainwater fed\n\na cistern and a hoist allowed water and other loads to be moved to the upper floors.\n\n\n\nA castle is known to have existed on the site in 1165. It is named after the Fleckenstein family, owners until 1720\n\nwhen it passed to the Vitzthum d'Egersberg family. The family had had a lordship that consisted of four separate\n\nsmall territories in the Bas-Rhin département. In 1807, it passed to J.-L. Apffel and in 1812 to General Harty,\n\nbaron of Pierrebourg (French word for Fleckenstein: stone town). In 1919, it became the property of the French state.\n\nThe rock and the castle have been modified and modernised many times. Of the Romanesque castle, remains\n\ninclude steps cut into the length of the rock, troglodyte rooms and a cistern. The lower part of the well tower\n\ndates from the 13th or 14th century, the rest from the 15th and 16th. The inner door in the lower courtyard carries\n\nthe faded inscription 1407 (or 1423); the outer door 1429 (or 1428). The stairwell tower is decorated with the\n\narms of Friedrich von Fleckenstein (died 1559) and those of his second wife, Catherine von Cronberg (married 1537).\n\nThe 16th-century castle, modernised between 1541 and 1570, was shared between the two branches of the\n\nFleckenstein family. Documents from the 16th century describe the castle and a watercolour copy of a 1562 tapestry\n\nillustrated its appearance in this period. Towards the end of the 17th-century Fleckenstein was captured twice by\n\nFrench troops. In 1674 the capture was achieved by forces under Marshall Vauban, who encountered no resistance\n\nfrom the defenders. The castle was nevertheless completely destroyed in 1689 by General Melac. Major restoration\n\nwork was carried out after 1870, around 1908 and again since 1958.\n\nThe castle is located between Lembach to the south and Hirschtal to the north, only about 200 meters to the\n\nsoutheast of the present French frontier with Germany, at a height of about 370 meters above mean sea level.\n\nThe nearest more substantial town is Wissembourg, approximately 20 km / 12 miles to the east. The castle, is\n\naccessible by road or via (well established) hiking trails. (Ministère français de la Culture. Château fort de Fleckenstein)\n\n(Merian)\n\nChâteau fort de Fleckenstein, Matthaus Merian illustration, c1663.\n\n(Made in Alsace Photo)\n\nChâteau fort de Fleckenstein, view from Hohenburg castle.\n\n(Rob124 Photo)\n\nChâteau fort de Fleckenstein.\n\n(Pinterest Photo)\n\nChâteau fort de Fleckenstein, aerial view.\n\n(Stardsen Photo)\n\nChâteau de Coucy is a French castle in the commune of Coucy-le-Château-Affrique, in Picardy, built in the 13th\n\ncentury and renovated by Eugè Viollet-le-Duc in the 19th century. During its heyday, it was famous for the size\n\nof its central tower and the pride of its lords, who adopted the staunchly independent rhyme: roi ne suis, ne prince\n\nne duc ne comte aussi; Je suis le sire de Coucy (\"I am not king, nor prince nor duke nor count; I am the Lord of Coucy\").\n\nThe castle was constructed in the 1220s by Enguerrand III, Lord of Coucy. The castle proper occupies the tip of a\n\nbluff or falaise. It forms an irregular trapezoid of 92 x 35 x 50 x 80 m. At the four corners are cylindrical towers\n\n20 m in diameter (originally 40 m in height). Between two towers on the line of approach was the massive donjon\n\n(keep). The donjon was the largest in Europe, measuring 35 meters wide and 55 meters tall. The smaller towers\n\nsurrounding the court were as big as the donjons being built at that time by the French monarchy. The rest of the\n\nbluff is covered by the lower court of the castle, and the small town.\n\nCoucy was occupied in September 1914 by German troops during the First World War. It became a military\n\noutpost and was frequented by German dignitaries, including Emperor Wilhelm II. In April 1917, the German\n\narmy dynamited the keep and the four towers using 28 tons of explosives to prevent their use by enemy artillery\n\nspotters as the Germans fell back in the region.\n\nThe demolition was done on order of General Erich Ludendortt, destroying the keep and the 4 towers. The\n\ndestruction caused so much public outrage that in April 1917 the ruins were declared \"a memorial to barbarity\". War reparations were used to clear the towers and to consolidate the walls but the ruins of the keep were left in place.\n\nChâteau de Coucy has been listed as a monument historique by the French Ministry of Culture since 1862.\n\n(Laurent, Jean-Marc. Le château féodal de Coucy. La Vague verte, 2001)\n\n(Shep Photo)\n\nModel of Château de Coucy.\n\nAerial view of Château de Coucy before its destruction in 1917.\n\n(Siaux Romuald Photo)\n\nChâteau de Coucy.\n\n(Siaux Romuald Photo)\n\nChâteau de Coucy.\n\n(Szeder László Photo)\n\nChâteau de Coucy.\n\nChâteau de Coucy illustration by Viollet-le-Duc\n\n(Rolf Kranz Photo)\n\nChâteau de Coucy.\n\nIf you would like to learn more about castles and sieges have a look here:\n\nIt has been said that the taking of a fortress depends primarily on the making of a good plan to take it, and the\n\nproper implementation and application of the resources to make the plan work. Long before a fortress has been\n\nbesieged and conquered, it has to have been outthought before it can be outfought. This book outlines some of the\n\nmore successfully thought out sieges, and demonstrates why it is that no fortress is impregnable.\n\nA siege can be described as an assault on an opposing force attempting to defend itself from behind a position of\n\nsome strength. Whenever the pendulum of technology swings against the \"status quo,\" the defenders of a fortification\n\nhave usually been compelled to surrender. We must stay ahead of the pendulum, and not be out-thought long before\n\nwe are out-fought, for, as it will be shown in this book, \"no fortress is impregnable.\"\n\nOrder book, soft cover or hard cover: http://bookstore.iuniverse.com/Products/SKU-000018310/Siegecraft--No-Fortress-Impregnable.aspx\n\nOrder in Canada: paperback http://www.chapters.indigo.ca/books/Siegecraft-No-Fortress-Impregnable-Harold-A-Skaarup/9780595275212-item.html?ikwid=harold+skaarup&ikwsec=Books\n\nE-book: http://www.kobobooks.com/ebook/Siegecraft---No-Fortress/book-XPscrt6nJUqjLcNZ14j9GQ/page1.html?utm_source=indigo&utm_medium=web&utm_campaign=retailer&ikwid=harold+skaarup&ikwsec=Books\n\nHardcover: http://www.chapters.indigo.ca/books/Siegecraft-No-Fortress-Impregnable-Harold-A-Skaarup/9780595656851-item.html?ikwid=harold+skaarup&ikwsec=Books\n\nhttp://www.amazon.ca/Siegecraft-Fortress-Impregnable-Harold-Skaarup/dp/0595656854/ref=sr_1_45?s=books&ie=UTF8&qid=1322341951&sr=1-45\n\nNook book: http://www.barnesandnoble.com/w/siegecraft-no-fortress-impregnable-skaarup-harold/1109600163?ean=9781462047505&itm=79&USRI=Harold+Skaarup\n\n‍"}, {"url": "https://www.britannica.com/biography/Philip-king-of-Judaea", "page_content": "Philip, also called Philip the Tetrarch or Herod Philip, (born 20 bce—died 34 ce), son of Herod I the Great and Cleopatra of Jerusalem (not to be confused with another Herod Philip, son of Herod I the Great by Mariamne II). He ruled ably as tetrarch over the former northeastern quarter of his father’s kingdom of Judaea.\n\nWhen the Roman emperor Augustus adjusted Herod’s will, Philip was assigned to the region east of the Sea of Galilee, in modern northern Israel, Lebanon, and southern Syria. In 6 ce he may have joined in charging his half brother with misgoverning Judaea, but with little benefit to himself, for Judaea then became a Roman province.\n\nOf his father’s inheritance, his was the poorest share, but he ruled it well. Because he had few Jewish subjects, he pursued a policy of Hellenization. His coins bore the emperor’s image, and he rebuilt a town, Bethsaida (on the northern shore of the Sea of Galilee), and renamed it Julias in honour of the emperor’s daughter. Near the source of the Jordan River, he founded another town and allowed it a large degree of self-government, on the Greek pattern.\n\nPhilip was less extravagant a ruler than any of his brothers. He avoided prolonged trips to Rome, instead traveling extensively in his territory and devoting his time to his subjects. Late in his reign he married Salome, the daughter of Herodias, who was her mother’s tool in securing from Herod Antipas the execution of John the Baptist."}, {"url": "https://homepages.rpi.edu/~holmes/Hobbies/Genealogy2/ps18/ps18_036.htm", "page_content": "Misc. Notes\n\nByname PHILIP AUGUSTUS, French PHILIPPE AUGUSTE, the first of the great Capetian kings of medieval France (reigned 1179-1223), who gradually reconquered the French territories held by the kings of England and also furthered the royal domains northward into Flanders and southward into Languedoc. He was a major figure in the Third Crusade to the Holy Land in 1191.\n\n\n\n\n\nEarly life and kingship\n\n\n\n\n\nPhilip was the son of Louis VII of France and Adela of Champagne. In order to be associated as king with his father, who had fallen mortally ill, he was crowned at Reims on Nov. 1, 1179. His uncles of the House of Champagne--Henry I, count of Champagne; Guillaume, archbishop of Reims; and Thibaut V, count of Blois and Chartres--hoped to use the youthful king to control France. To escape from their tutelage, Philip, on April 28, 1180, married Isabella, the daughter of Baldwin V of Hainaut and the niece (through her mother) of Philip of Alsace, the count of Flanders, who promised to give the King the territory of Artois as her dowry.\n\n\n\nWhen Henry II of England arrived in Normandy, perhaps with the intention of responding to an appeal by the House of Champagne, Philip II entered into negotiations with him and, at Gisors on June 28, 1180, renewed an understanding that Louis VII had reached with him in 1177. As a result, the House of Champagne was politically isolated, and Philip II was making all decisions for himself and acting as he saw fit when his father died, on Sept. 18, 1180, leaving him sole king in name as well as in fact.\n\n\n\nWhen the Count of Flanders allied himself with the Champagne faction, there followed a serious revolt against the King. In the Peace of Boves, in July 1185 (confirmed by the Treaty of Gisors in May 1186), the King and the Count of Flanders composed their differences (which had been chiefly over possession of Vermandois, in Picardy), so that the disputed territory was partitioned, Amiens and numerous other places passing to the King and the remainder, with the county of Vermandois proper, being left provisionally to Philip of Alsace. Thenceforward the King was free to run against Henry II of England.\n\n\n\nTerritorial expansion\n\n\n\n\n\nHenry's French possessions--the so-called Angevin Empire, consisting of Normandy, Maine, Anjou, and Touraine, with Aquitaine in the hands of his son, the future Richard I the Lion-Heart of England, and Brittany ruled by another son, Geoffrey (died 1186)--all were a constant menace to the French royal domain. Furthermore, there were long-standing disputes over the Vexin (between Normandy and the Île-de-France), Berry, and Auvergne. (See Plantagenet, House of.)\n\n\n\nPhilip II launched an attack on Berry in the summer of 1187 but then in June made a truce with Henry, which left Issoudun in his hands and also granted him Fréteval, in Vendômois. Though the truce was for two years, Philip found grounds for resuming hostilities in the summer of 1188. He skillfully exploited the estrangement between Henry and Richard, and Richard did homage to him voluntarily at Bonmoulins in November 1188. Finally, by the Treaty of Azay-le-Rideau, or of Colombières (July 4, 1189), Henry was forced to renew his own homage, to confirm the cession of Issoudun, with Graçay also, to Philip, and to renounce his claim to suzerainty over Auvergne. Henry died two days later.\n\n\n\nRichard, who succeeded Henry as king of England, had already undertaken to go on crusade (the Third Crusade) against Saladin in the Holy Land, and Philip now did likewise. Before his departure, he made the so-called Testament of 1190 to provide for the government of his kingdom in his absence. On his way to Palestine, he met Richard in Sicily, where they promptly found themselves at variance, though they made a treaty at Messina in March 1191. Arriving in Palestine, they cooperated against the Muslims at Acre, until Philip fell ill and made his illness a pretext for returning to France, quite determined to settle the succession to Flanders (Philip of Alsace had just died on the crusade) while Richard was still absent. Thus, by the end of 1191, Philip II was back in France.\n\n\n\nIn spite of promises he had made in the Holy Land, Philip at once prepared to attack the Plantagenet possessions in France. Informed of this, Richard also left the crusade but was taken prisoner while on his way back by the duke of Austria, Leopold V of Babenberg. Philip did everything he could to prolong his rival's captivity, but Richard was at last set free (1194) and went to war against Philip. The French king suffered a number of defeats (from that at Fréteval in July 1194 to that at Courcelles in September 1198) in a series of campaigns that were occasionally punctuated by negotiations. It was fortuitous for Philip, however, when Richard was killed in April 1199.\n\n\n\nRichard's brother John was by no means as formidable a fighter. Moreover, his right to Richard's succession could be contested by Arthur of Brittany, whose father had been senior to John. To secure the succession, therefore, John came to terms with Philip: by the Treaty of Le Goulet (May 22, 1200), in return for Philip's recognition of him as Richard's heir, he ceded Évreux and the Norman Vexin to Philip; agreed that Issoudun and Graçay should be the dowry of his niece Blanche of Castile, who was to marry the future Louis VIII (Philip's son by Isabella of Hainaut); and renounced any claim to suzerainty over Berry and Auvergne.\n\n\n\nShortly afterward, however, John entered into conflict with the Lusignan family of Poitou (in Aquitaine), who appealed to Philip as overlord. When he was summoned to appear before the royal court as a vassal of the French crown, John did not present himself, and Philip, in April 1202, pronounced John's French fiefs forfeit and undertook to carry out the sentence himself. He invaded Normandy, overran the northeast, and laid siege to Arques, while Arthur of Brittany, the son of Geoffrey, who died some years before, campaigned against John's supporters in Poitou; but John, marching south from Maine, captured Arthur at Mirebeau (August 1). In fury, Philip abandoned the siege of Arques and marched southwestward to Tours, ravaging John's territory on his way before returning to Paris. Guillaume des Roches, the powerful seneschal of Anjou, who had taken John's side, came to terms with Philip in March 1203.\n\n\n\nResuming operations against Normandy, Philip occupied the towns around the great fortress of Château-Gaillard, to which he laid siege in September 1203, having overruled Pope Innocent III's attempts to mediate. John, who is reported to have murdered Arthur of Brittany in April, retired to England in December, and Château-Gaillard fell to Philip in March 1204. Rouen, the Norman capital, surrendered in June, after 40 days' resistance.\n\n\n\nAfter his conquest of Normandy, Philip subdued Maine, Touraine, Anjou, and most of Poitou with less difficulty (1204-05), though the castles of Loches and Chinon held out for a year. He sought to secure his conquests by lavishing privileges on the towns and on the religious houses but otherwise left the local barons in power. Unrest, however, was endemic in Poitou, and in June 1206 John landed at La Rochelle. After a campaign in the south, he turned north toward the Loire. At Thouars in October 1206, he and Philip made a two-year truce, leaving John in possession of the reconquered Poitevin lands. In the following year, however, Philip invaded Poitou again; and, after a further campaign in 1208, only the south and part of the west of Poitou remained loyal to John (with Saintonge, Guyenne, and Gascony).\n\n\n\nPhilip next hoped to exploit the dispute between John and Pope Innocent III. While Innocent was threatening to declare John unfit to reign (1212), plans were being made for a French landing in England and for the accession of Philip's son Louis to the English throne. The plans had to be dropped when John made his submission to the Pope (1213). Throwing himself into schemes for revenge, John formed a coalition against France: the Holy Roman emperor Otto IV, the Count of Flanders (Ferrand, or Ferdinand, of Portugal), and the Count of Boulogne (Raynald, or Renaud, of Dammartin) were to invade the Capetian territory from the northeast while John attacked from the west, with the help of his Poitevin barons.\n\n\n\nJohn landed at La Rochelle in February 1214 and advanced into Anjou but was put to flight by Louis at La Roche-aux-Moines on July 2; his confederates were completely defeated by Philip in the decisive Battle of Bouvines on July 27. The Anglo-Angevin power in France and the coalition had both been broken in one month. Thus Philip, who, in 1213, had transferred Brittany to his cousin Peter of Dreux, was left without any significant opposition to his rule in France.\n\n\n\nIt was not only at the Plantagenets' expense that Philip enlarged the royal domain. His claim to Artois through his first marriage and his gains by the settlement of 1185-86 have been mentioned above, and he subsequently proceeded, step by step, to acquire the rest of Vermandois and Valois. His insistence on his suzerainty over vacant fiefs and on his tutelage over minors and heiresses was particularly effective with regard to Flanders, where two successive Flemish counts, Philip of Alsace (died 1191) and Baldwin IX (died c. 1205) had left no male issue.\n\n\n\nThough he did not personally take part in the crusade proclaimed by Pope Innocent III against a Cathari religious sect in Languedoc, Philip allowed his vassals and knights to carry it out. Simon de Montfort's capture of Béziers and Carcassonne (1209) and his victory at Muret over Raymond VI of Toulouse and Peter II of Aragon (1213) prepared the way for the eventual annexation of eastern Languedoc to the royal domain six years after Philip's death and for the union of northern and southern France under Capetian rule.\n\n\n\n\n\nInternal affairs\n\n\n\n\n\nSeveral years before he tried to take advantage of the papacy's quarrel with John of England, Philip had himself been in dispute with Rome. After the death (1190) of Isabella of Hainaut, he had married Ingeborg, sister of the Danish king Canute IV, on Aug. 14, 1193, and on the next day, for a private reason, had resolved to separate from her. Having procured the annulment of his marriage by an assembly of bishops in November 1193, he took a Tirolese lady, Agnes, daughter of Bertold IV of Meran, as his wife in June 1196. Denmark, meanwhile, had complained to Rome about the repudiation of Ingeborg, and Pope Celestine III had countermanded it in 1195; but Celestine died (1198) before he could resort to coercion against Philip. The next pope, Innocent III, was sterner: in January 1200 he imposed an interdict on France. Philip, therefore, in September 1200, had to submit, pretending to be reconciled with Ingeborg. In fact, he refused to cohabit with her and kept her in semicaptivity until 1213, when he accepted her beside him--not as his wife but at least as his queen. Agnes had died in 1201, after bearing two children to Philip: Marie, countess of Namur (1211) and duchess of Brabant (1213), by successive marriages; and Philip, called Hurepel, count of Clermont.\n\n\n\nThroughout his reign, Philip kept a close watch over the French nobility, which he brought effectively to heel. He maintained excellent relations with the French clergy, leaving the canons of the cathedral chapters free to elect their bishops and favouring the monastic orders. He knew, too, how to win the support of the towns, granting privileges and liberties to merchants and frequently aiding their struggles to free themselves from the seignorial authority of the nobles. In return, the communes helped financially and militarily. Most of all, Philip gave his attention to Paris, not only fortifying it with a great rampart but also having its streets and thoroughfares put in order. For the countryside, he multiplied the number of villes neuves (\"new towns\"), or enfranchised communities.\n\n\n\nThe Capetian monarchy's hold on the huge royal domain as well as on the kingdom as a whole was considerably strengthened by Philip's institution of a new class of administrative officers, the royal baillis and the seneschals for the provinces, who were appointed by the king to supervise the conduct of the local prévôts (\"provosts\"), to give justice in his name, to collect the revenues of the domain for him, and to call up the armed forces, in addition to other duties.\n\n\n\n\n\nConclusion.\n\n\n\nPhilip II died on July 14, 1223. Knowing his own strength, he was the first of the Capetians not to have his eldest son crowned and associated with him during his lifetime; in fact, his conquests and strong government made him the richest and most powerful king in Europe and prepared the way for France's greatness in the 13th century."}, {"url": "https://www.britannica.com/biography/Philip-I-king-of-France", "page_content": "Philip I, (born 1052—died July 29/30, 1108, Melun, France), king of France (1059–1108) who came to the throne at a time when the Capetian monarchy was extremely weak but who succeeded in enlarging the royal estates and treasury by a policy of devious alliances, the sale of his neutrality in the quarrels of powerful vassals, and the practice of simony on a huge scale.\n\nPhilip was the elder son of Henry I of France by his second wife, Anne of Kiev. Crowned at Reims in May 1059, he became sole king on his father’s death in 1060; Baldwin V, count of Flanders, exercised the regency. Two years after he came of age in 1066, he obtained the county of Gâtinais as the price of his neutrality in a family struggle over Anjou and thereby linked the royal possessions in Sens with those around Paris, Melun, and Orléans. His major efforts, however, were directed toward Normandy, in which from 1076 he supported Robert II Curthose, its ineffectual duke, first against Robert’s father, King William I of England, then against Robert’s brother, William II. Philip’s true goal was to prevent emergence of a rival power in Normandy, for he was willing to abandon Robert whenever it seemed possible he might become dangerous.\n\nBecause of his firm determination to retain control over all appointments to ecclesiastical posts, which he blatantly sold, Philip was eventually drawn into conflict with the papacy, which nonetheless did not assume the disastrous proportions of the similar struggle over investitures in the Holy Roman Empire. This conflict was exacerbated by his matrimonial affairs; his scandalous “marriage” with Bertrada de Montfort, wife of a vassal, brought him repeated excommunication. By 1107, when the French monarchy’s struggle with the papacy was finally ended, Louis VI, Philip’s son by his legitimate wife, Bertha, had taken over the administration of the kingdom, Philip having been rendered inactive by his extreme obesity."}, {"url": "https://prabook.com/web/philip_ii.of_france/1344246", "page_content": "Philip II of France\n\nking\n\nAugust 21, 1165 (age 57) Gonesse, Val-d'Oise, Paris\n\nPhilip inherited from his father the difficult problem of trying to defend the small royal domain centering on Paris and Orléans against the much more extensive holdings of Henry II of England. By inheritance, marriage, and war, Henry had acquired lands extending from Normandy on the English Channel through Maine, Anjou, and Aquitaine to the Pyrenees. Although young Philip faced seemingly hopeless odds, he exploited the jealousy of Henry's sons, and when Henry invested his favored youngest son, John, with all the King's Continental holdings except Normandy, John's older brother Richard became an ally of Philip and fought his aging father. In 1189 Henry was forced to recognize Richard as heir to all his lands and Philip as his feudal lord for his lands in France. Shortly afterward, Henry II died. The power struggle had been interrupted by the preparations for the Third Crusade following the fall of Jerusalem in 1187. Now Philip reluctantly joined Frederick I (Frederick Barbarossa) and Richard I, who had become king of England on the death of Henry II. Philip and Richard went to the East together but soon began to quarrel. When the Anglo-French forces recaptured Acre, Philip felt that he had done enough crusading and returned to France to take advantage of Richard's absence in the East. Richard, unable to capture Jerusalem from Saladin, returned home through Austria but was taken prisoner there and held for ransom. He did not reach the West until May 1194, and in his absence Philip had joined forces with John to recover Normandy. The ensuing warfare between Philip and Richard ended when Richard was killed (1199) in a minor skirmish in central France and John became king of England. Philip now became John's enemy and used feudal law to dispossess him of his Continental holdings. In 1202 he summoned John to his court to answer a charge made against him, but John refused to come, and Philip therefore declared John's holdings in France forfeit, occupying Normandy and all English lands north of the Loire River. With the occupation of Normandy, the Capetians now had access to the English Channel and deprived John of easy access to his Continental fiefs. Although preoccupied with defending his kingdom against England, Philip was not unmindful of the opportunities for acquisitions in southern France. In 1207 Pope Innocent III invited Philip to lead a crusade there against the spread of heresy, but Philip declined to take part unless the Pope made John stop fighting in Poitou—something Innocent III could not do. A decade later Philip was still avoiding direct participation in the crusade, but he did permit his son, Louis of France, to lead a French army into Toulouse. In January 1213, John was excommunicated and deposed for his spoliation of the Church. His troubles with his own English barons encouraged Pope Innocent III to urge Philip to invade England, seize John, and put Louis of France, now married to a niece of John's, on the English throne. But when John turned over England to the Pope and received it back as a papal fief, Innocent ordered Philip to give up the invasion. John, restored to power with papal protection, then organized an Anglo-Flemish-German coalition to recover his French fiefs. In 1214 Philip met the challenge by sending his son Louis of France as leader of a French army against John, who had led an attack from southwestern France. But John fled rather than fight. Meanwhile, Philip led another French army northeastward from Paris to meet John's ally, Otto IV of Germany, who was about to invade France with an army of English, German, and Flemish knights. Philip crushed this army at Bouvines on July 27, 1214. The students in Paris celebrated the French victory for 7 days and 7 nights. Bouvines was one of the decisive battles of European history because it led to the ruin of John, upset the balance of power in Europe in favor of France for over a century, and marked the end of the German Empire as the dominant political power in the Christian West. After Bouvines, John returned to England, where he died in 1216. Philip was able to live out his life in peace, certain of Capetian ascendancy."}, {"url": "https://www.britannica.com/biography/Philip-V-king-of-Spain", "page_content": "Philip V, also called (until 1700) Philippe, duc d’Anjou, (born December 19, 1683, Versailles, France—died July 9, 1746, Madrid, Spain), king of Spain from 1700 (except for a brief period from January to August 1724) and founder of the Bourbon dynasty in Spain. During his reign Spain regained much of its former influence in international affairs.\n\nPhilip was a son of the dauphin Louis (son of Louis XIV of France) and of Marie Anne, daughter of Ferdinand, elector of Bavaria. Philip’s whole career was influenced by the fact that he was a grandson of Louis XIV of France and a great grandson of Philip IV, king of Spain. Philip held the title of duc d’Anjou until 1700, when he emerged as a person of political importance. In that year Charles II, the last Habsburg king of Spain, who died without issue, left Philip all his possessions (Spain, Spanish America, the Spanish Netherlands, and parts of Italy). The refusal of Louis XIV to exclude Philip from the line of succession to the French throne resulted in the War of the Spanish Succession. The Treaty of Utrecht, signed in 1713, deprived Philip of the Spanish Netherlands and of the Italian possessions of the Spanish Habsburgs, but left him the throne of Spain and Spanish America.\n\nDuring the first 13 years of Philip’s reign France had a dominant influence on the Spanish court, and the French ambassador had a place on the inmost council of state. After the death of his first wife (María Luisa of Savoy) in 1714, Philip came under the influence of his second wife, Princess Isabella Farnese, who was the niece and stepdaughter of the duke of Parma. Because of Isabella’s desire to secure territories in Italy for her sons, Spain became embroiled in conflict with Austria, Great Britain, France, and the United Provinces but managed to secure the succession of Philip and Isabella’s oldest son, Don Carlos (later Charles III of Spain), to the duchy of Parma. Philip abdicated from the Spanish throne in January 1724 in favour of his oldest son, Luis, but was persuaded to become king again after Luis died of smallpox in August 1724. Philip’s reign is noted primarily for the governmental and economic reforms instituted by his French and Italian advisers.\n\nPhilip had few intimate friends; his chief interests were religion, hunting, and music. During the last years of his reign he often lapsed into periods of insanity, and his wife largely controlled public affairs."}], "Philip of France constructed many castles and churches throughout France.": [{"url": "https://www.britannica.com/biography/Philip-II-king-of-France", "page_content": "Philip II , byname Philip Augustus, French Philippe Auguste , (born August 21, 1165, Paris , France—died July 14, 1223, Mantes), the first of the great Capetian kings of medieval France (reigned 1180–1223), who gradually reconquered the French territories held by the kings of England and also furthered the royal domains northward into Flanders and southward into Languedoc. He was a major figure in the Third Crusade to the Holy Land in 1191.\n\nWhen the count of Flanders allied himself with the Champagne faction , there followed a serious revolt against the king. In the Peace of Boves, in July 1185 (confirmed by the Treaty of Gisors in May 1186), the king and the count of Flanders composed their differences (which had been chiefly over possession of Vermandois, in Picardy) so that the disputed territory was partitioned, Amiens and numerous other places passing to the king and the remainder, with the county of Vermandois proper, being left provisionally to Philip of Alsace. Thenceforward the king was free to run against Henry II of England.\n\nWhen Henry II of England arrived in Normandy, perhaps with the intention of responding to an appeal by the house of Champagne, Philip II entered into negotiations with him and, at Gisors on June 28, 1180, renewed an understanding that Louis VII had reached with him in 1177. As a result, the house of Champagne was politically isolated, and Philip II was making all decisions for himself and acting as he saw fit when his father died, on September 18, 1180, leaving him sole king in name as well as in fact.\n\nPhilip was the son of Louis VII of France and Adela of Champagne. In order to be associated as king with his father, who had fallen mortally ill, he was crowned at Reims on November 1, 1179. His uncles of the house of Champagne—Henry I, count of Champagne; Guillaume, archbishop of Reims; and Thibaut V, count of Blois and Chartres—hoped to use the youthful king to control France. To escape from their tutelage , Philip on April 28, 1180, married Isabella, the daughter of Baldwin V of Hainaut and the niece (through her mother) of Philip of Alsace, the count of Flanders, who promised to give the king the territory of Artois as her dowry.\n\nTerritorial expansion\n\nHenry’s French possessions—the so-called Angevin empire, consisting of Normandy, Maine, Anjou, and Touraine, with Aquitaine in the hands of his son, the future Richard I the Lion-Heart of England, and Brittany ruled by another son, Geoffrey (died 1186)—all were a constant menace to the French royal domain. Furthermore, there were long-standing disputes over the Vexin (between Normandy and the Île-de-France), Berry, and Auvergne.\n\nPhilip II launched an attack on Berry in the summer of 1187 but then in June made a truce with Henry, which left Issoudun in his hands and also granted him Fréteval, in Vendômois. Though the truce was for two years, Philip found grounds for resuming hostilities in the summer of 1188. He skillfully exploited the estrangement between Henry and Richard, and Richard did homage to him voluntarily at Bonmoulins in November 1188. Finally, by the Treaty of Azay-le-Rideau, or of Colombières (July 4, 1189), Henry was forced to renew his own homage, to confirm the cession of Issoudun, with Graçay also, to Philip, and to renounce his claim to suzerainty over Auvergne. Henry died two days later.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nRichard, who succeeded Henry as king of England, had already undertaken to go on Crusade against Saladin in the Holy Land (the Third Crusade), and Philip now did likewise. Before his departure, he made the so-called Testament of 1190 to provide for the government of his kingdom in his absence. On his way to Palestine, he met Richard in Sicily, where they promptly found themselves at variance, though they made a treaty at Messina in March 1191. Arriving in Palestine, they cooperated against the Muslims at Acre, until Philip fell ill and made his illness a pretext for returning to France, quite determined to settle the succession to Flanders (Philip of Alsace had just died on the Crusade) while Richard was still absent. Thus, by the end of 1191, Philip II was back in France.\n\nIn spite of promises he had made in the Holy Land, Philip at once prepared to attack the Plantagenet possessions in France. Informed of this, Richard also left the Crusade but was taken prisoner while on his way back by the duke of Austria, Leopold V of Babenberg. Philip did everything he could to prolong his rival’s captivity, but Richard was at last set free (1194) and went to war against Philip. The French king suffered a number of defeats (from that at Fréteval in July 1194 to that at Courcelles in September 1198) in a series of campaigns that were occasionally punctuated by negotiations. It was fortuitous for Philip, however, when Richard was killed in April 1199.\n\nRichard’s brother John was by no means as formidable a fighter. Moreover, his right to Richard’s succession could be contested by Arthur of Brittany, whose father had been senior to John. To secure the succession, therefore, John came to terms with Philip: by the Treaty of Le Goulet (May 22, 1200), in return for Philip’s recognition of him as Richard’s heir, he ceded Évreux and the Norman Vexin to Philip; agreed that Issoudun and Graçay should be the dowry of his niece Blanche of Castile, who was to marry the future Louis VIII (Philip’s son by Isabella of Hainaut); and renounced any claim to suzerainty over Berry and Auvergne.\n\nShortly afterward, however, John entered into conflict with the Lusignan family of Poitou (in Aquitaine), who appealed to Philip as overlord. When he was summoned to appear before the royal court as a vassal of the French crown, John did not present himself, and Philip, in April 1202, pronounced John’s French fiefs forfeit and undertook to carry out the sentence himself. He invaded Normandy, overran the northeast, and laid siege to Arques, while Arthur of Brittany, the son of Geoffrey, who died some years before, campaigned against John’s supporters in Poitou; but John, marching south from Maine, captured Arthur at Mirebeau (August 1). In fury, Philip abandoned the siege of Arques and marched southwestward to Tours, ravaging John’s territory on his way before returning to Paris. Guillaume des Roches, the powerful seneschal of Anjou, who had taken John’s side, came to terms with Philip in March 1203.\n\nResuming operations against Normandy, Philip occupied the towns around the great fortress of Château-Gaillard, to which he laid siege in September 1203, having overruled Pope Innocent III’s attempts to mediate. John, who is reported to have murdered Arthur of Brittany in April, retired to England in December, and Château-Gaillard fell to Philip in March 1204. Rouen, the Norman capital, surrendered in June, after 40 days’ resistance.\n\nAfter his conquest of Normandy, Philip subdued Maine, Touraine, Anjou, and most of Poitou with less difficulty (1204–05), though the castles of Loches and Chinon held out for a year. He sought to secure his conquests by lavishing privileges on the towns and on the religious houses but otherwise left the local barons in power. Unrest, however, was endemic in Poitou, and in June 1206 John landed at La Rochelle. After a campaign in the south, he turned north toward the Loire. At Thouars in October 1206, he and Philip made a two-year truce, leaving John in possession of the reconquered Poitevin lands. In the following year, however, Philip invaded Poitou again; and, after a further campaign in 1208, only the south and part of the west of Poitou remained loyal to John (with Saintonge, Guyenne, and Gascony).\n\nPhilip next hoped to exploit the dispute between John and Pope Innocent III. While Innocent was threatening to declare John unfit to reign (1212), plans were being made for a French landing in England and for the accession of Philip’s son Louis to the English throne. The plans had to be dropped when John made his submission to the pope (1213). Throwing himself into schemes for revenge, John formed a coalition against France: the Holy Roman emperor Otto IV, the count of Flanders (Ferrand, or Ferdinand, of Portugal), and the count of Boulogne (Raynald, or Renaud, of Dammartin) were to invade the Capetian territory from the northeast while John attacked from the west, with the help of his Poitevin barons.\n\nJohn landed at La Rochelle in February 1214 and advanced into Anjou but was put to flight by Louis at La Roche-aux-Moines on July 2; his confederates were completely defeated by Philip in the decisive Battle of Bouvines on July 27. The Anglo-Angevin power in France and the coalition had both been broken in one month. Thus Philip, who, in 1213, had transferred Brittany to his cousin Peter of Dreux, was left without any significant opposition to his rule in France.\n\nIt was not only at the Plantagenets’ expense that Philip enlarged the royal domain. His claim to Artois through his first marriage and his gains by the settlement of 1185–86 have been mentioned above, and he subsequently proceeded, step by step, to acquire the rest of Vermandois and Valois. His insistence on his suzerainty over vacant fiefs and on his tutelage over minors and heiresses was particularly effective with regard to Flanders, where two successive Flemish counts, Philip of Alsace (died 1191) and Baldwin IX (died c. 1205) had left no male issue.\n\nThough he did not personally take part in the Crusade proclaimed by Pope Innocent III against a Cathari religious sect in Languedoc, Philip allowed his vassals and knights to carry it out. Simon de Montfort’s capture of Béziers and Carcassonne (1209) and his victory at Muret over Raymond VI of Toulouse and Peter II of Aragon (1213) prepared the way for the eventual annexation of eastern Languedoc to the royal domain six years after Philip’s death and for the union of northern and southern France under Capetian rule."}, {"url": "https://www.britannica.com/place/France/France-1180-to-c-1490", "page_content": "The age of Gothic cathedrals and Scholastic theology was also an age of splendour for the French monarchy. Royal authority was greatly strengthened by Louis VII’s successor, Philip II (Augustus; reigned 1180–1223), who could claim descent from Charlemagne through his mother. Philip proved to be the ablest Capetian yet to reign. He was practical and clear-sighted in his political objectives; the extension of territorial power and the improvement of mechanisms with which to govern an expanded realm were his consistent policies. Perhaps it was not accidental that royal documents began to refer to the “king of France” (rex Franciae) instead of using the customary formula “king of the Franks” (rex Francorum) within a year or two of Philip’s accession.\n\nPhilip Augustus\n\nPhilip’s outstanding achievement was to wrest control from the Plantagenets of most of the domains they held in France. Intervening in struggles between Henry II of England and his sons, Philip won preliminary concessions in 1187 and 1189. He acquired strategic lands on the Norman borders following wars with Henry’s sons, King Richard and King John (1196 and 1200). And, when in 1202 John failed to answer a summons to the vassalic court of his lord, Philip Augustus confiscated his fiefs. Normandy fell to the Capetian in 1204. Maine, Anjou, and Touraine fell rapidly (1204–06), leaving only Aquitaine and a few peripheral domains in the contested possession of England. By the Truce of Chinon (September 18, 1214), John recognized the conquests of Philip Augustus and renounced the suzerainty of Brittany, although the complete submission of Poitou and Saintonge was to take another generation.\n\nPhilip’s other acquisitions of territory, if less spectacular, were no less important for consolidating the realm. In the north he pressed the royal authority to the border of Flanders. Artois, which came under his control as a dowry with his first wife, was fully secured in 1212. Vermandois and Valois (1213) and the counties of Beaumont-sur-Oise and Clermont-en-Beauvais were annexed during his last years. On the southern limits of the Île-de-France Philip rounded out prior possessions in Gâtinais and Berry. Much of Auvergne, whose suzerainty had been ceded by Henry II in 1189, passed to royal control in 1214, while in the more distant south Philip extended his influence by gaining lordship over Tournon, Cahors, Gourdon, and Montlaur in Vivarais. As the reign ended, only Brittany, Flanders, Champagne, Burgundy, and Toulouse, among principalities later annexed, lay outside the royal domain. At the end of Philip’s reign, rising concern about the heretical stance of the Albigenses set the stage for the Albigensian Crusade and later conquest of southern lands.\n\nBecause the territorial expansion was accomplished through traditional means—dynastic, feudal, and military—the curial administration was, outwardly, little changed. Household officers such as the butler and the constable continued to function as in the past. But Philip Augustus was even more suspicious of the seneschalship and chancellorship than his father had been; he allowed both offices to fall vacant early in his reign, entrusting their operations to lesser nobles or to clerics of the entourage. Although their activity is obscure, some of these men were beginning to specialize in justice or finance. The curia as such, however, remained undifferentiated; characteristically, the committee of regents, appointed in 1190 to hold three courts yearly while the king was absent on Crusade, was expected to concern itself with both justice and the administration of the kingdom on those occasions. Prelates and nobles of the curia also served as counselors; enlarged councils convened, at the king’s summons, on festivals or when major political or military issues were contemplated.\n\nPhilip Augustus acted vigorously to improve the efficiency of his lordship. He was, indeed, practically the founder of royal administration in France. His chancery began to keep better records of royal activities. Documents were copied into registers before being sent out, and lists of churches, vassals, and towns were drawn up to inform the king of his military and fiscal rights. These lists replaced others lost on the battlefield of Fréteval (1194), a disaster that may have hastened the adoption of a new form of fiscal accountancy. One may draw this conclusion because it is unlikely that the Capetians had previously troubled to record the balances of revenues and expenses in the form first revealed by a record of the year 1202. Its central audit was connected with other efforts to improve control of the domains dominated directly by the king. From early in his reign Philip appointed members of his court to hold periodic local sessions, to collect extraordinary revenues, to lead military contingents, and to supervise the provosts. The new officers, called bailiffs (baillis), at first had no determined districts in which to serve (they resembled the circuit commissioners of Angevin government, whose office may have been the model for the Capetian institution). From the outset the bailiffs were paid salaries; they were more reliable than the provosts, who by the later 12th century generally farmed the revenues. In the newly acquired lands of the west and south, Philip and his successors instituted seneschals—functionaries similar to the bailiffs but with recognized territorial jurisdiction from the start.\n\nPhilip Augustus’s policy toward his conquered domains was shrewd. He retained the deep-rooted customs and administrative institutions of such flourishing provinces as Anjou and Normandy; indeed, the superior fiscal procedures of Normandy soon exercised perceptible influence on Capetian accounting elsewhere. On the other hand, to secure the loyal operation of provincial institutions, Philip appointed men of his own court, typically natives of the Île-de-France. It was a compromise that was to work well for generations to come.\n\nThe character of Philip’s rule may likewise be deduced from his relations with the main classes of the population. A devoted son of the church, if not unswervingly faithful, he favoured the higher clergy in many of their interests. He opposed the infidels, heretics, and blasphemers; he supported the bishops of Laon, Beauvais, Sens, and Le Puy (among others) in their disputes with townspeople; and he granted and confirmed charters to monasteries and churches. Yet he was more insistent on his rights over the clergy than his predecessors had been. He required professions of fidelity and military service from bishops and abbots, summoned prelates to his court, and sought to limit the jurisdiction of ecclesiastical courts. He supported papal policies or submitted to papal directives only to the extent that these were consistent with his temporal interests. Cases in point were his reserved support of Crusades and his notorious rejection of Queen Ingeborg, whom he married, abandoned, and then, in response to the pope’s censure, feigned to reconcile.\n\nToward the lay aristocracy, Philip Augustus acted energetically as suzerain and protector. Indeed, no Capetian was more fully the “feudal monarch.” His war with John resulted from John’s refusal to appear at court as a vassal of the French king to answer for his mistreatment of the count of La Marche. He regarded Flanders and Toulouse as well as Normandy as fiefs held by the crown. As with ecclesiastical vassals, Philip insisted upon the service due from fiefs, and he required his vassals to reserve their fealty for him alone. He extended his influence by entering into treaties (pariages) with minor lords, often distant ones; and, by confirming the acts of nobles in unprecedented numbers, he recovered the force of the royal guarantee.\n\nThe policy toward the lesser rural and urban populations was to increase their loyalty and contribution to the crown without significantly reducing their dependence on the king and other lords. Philip offered his protection to exploited villages, and, especially during his early years, he confirmed existing “new towns,” extended their privileges to other villages, and otherwise favoured peasant communities. Townsmen, notably those in semiautonomous communes, gained confirmation of their charters; and the king created some new communes. Most of the latter were located in strategic proximity to the northern frontiers of the expanded royal domain; this fact, together with the obligations of service and payment specified in the charters, suggests that military motives were paramount in these foundations. More generally evident in these charters, as in others, was the desire to gain the political fidelity of a prospering class. At Paris Philip Augustus acted as did no other local lord to promote the civic interest, improving sanitation, paving streets, and building a new wall. Parisian burghers financed and administered these projects; they were associated in the fiscal supervision of the realm when the king went on Crusade, but they were not favoured with a communal charter."}, {"url": "https://www.metmuseum.org/toah/ht/07/euwf.html", "page_content": "11th century So many building campaigns are underway that one writer, Radulfus Glaber, speaks of a Europe “clothing itself with a white mantle of churches.” Among the major monuments are the churches of Saint-Benoît-sur-Loire, Saint-Philibert at Tournus, and Notre-Dame at Jumièges. The introduction of a choir with ambulatory and radiating chapels, which defines church plans for the next four centuries, is found at the Church of Sainte-Foy at Conques, built between 1039 and 1065 and the contemporary Church of Notre–Dame at Paray–le–Monial.\n\n1095 At Clermont, Pope Urban II calls for a holy war, later known as the First Crusade. Spurred by appeals from the Byzantine emperor Alexios Komnenos and reports of difficulties from Christian pilgrims in the Holy Land, the West launches a military campaign to wrest the holy city of Jerusalem from Muslim control. While armies are assembled, a “People’s Crusade” sets out, terrorizing Jews on their route. Poorly armed and disorganized, most never reach enemy territory; those who do, perish at the hands of a superior Muslim force. On July 15, 1099, the main Crusader forces led by the nobility take Jerusalem.\n\nfrom 1100 Extensive programs of architectural sculpture are initiated throughout the country. The earliest capitals with narrative decoration appear in Chauvigny around 1080, bearing the signature of their sculptor Gofridus, and at Cluny and Saint-Benoît-sur-Loire around 1100. Imposing sculptural reliefs decorate the tympana set over doors of churches such as Vézelay (ca. 1120) and Autun (ca. 1120–35) in Burgundy, Moissac (ca. 1115–30) in the south, and Chartres (ca. 1150) just west of Paris. The first jamb statues flanking doors adorn the west facades—the principal church entrances—of the royal abbey of Saint-Denis by 1140 and of Chartres Cathedral by 1150.\n\n1112 Saint Bernard (1090–1153) joins the abbey of Cîteaux, founded in 1098 near Dijon in an effort to adhere more strictly to Benedictine rule and to restore monastic rigor. Bernard founds the abbey of Clairvaux in 1115. Under his leadership, the Cistercian order flourishes, with 350 houses at his death in 1153. Concerned with maintaining orthodoxy, Bernard becomes involved in the fight against heresy in southwestern France and, in 1146 at Vézelay, calls for the Second Crusade. In a famous diatribe, he criticizes sculpture in churches and monasteries as distracting both for the clergy and the faithful.\n\nJuly 1137 Eleanor of Aquitaine marries the man who, two months later, becomes King Louis VII of France. She brings to the marriage the duchy of Aquitaine—a far larger domain than that possessed by the French kings. Their marriage is annulled in 1152, and Eleanor immediately marries Henry Plantagenet, who becomes Henry II, king of England, in 1154. This marriage brings Aquitaine, Normandy, and England under one rule, marking the beginning of English presence in France. Eleanor’s court at Poitiers becomes a great center for poetry and culture.\n\n1140–1150 Abbot Suger (ca. 1081–ca. 1151), advisor to Louis VI and Louis VII, begins to remodel the royal abbey church of Saint-Denis outside Paris, the burial site of French rulers since Carolingian times. In 1144, Louis VII and Eleanor of Aquitaine attend the consecration of the choir, remarkable for its open, light-filled spaces. Suger’s architectural innovations spell out the basic principles of Gothic architecture. The abbot also commissions precious objects to furnish the abbey, believing, as he explains in his own written account of the building and refurbishment of Saint-Denis, that only the finest materials are worthy of God.\n\n12th century Paris nurtures a considerable community of scholars, including Peter Abelard, Peter Lombard, and John of Salisbury. It becomes the leading center in Europe for the study of theology and the liberal arts. The university of Paris is founded between 1150 and 1170.\n\nca. 1150–1300 Bishops and architects around Paris experiment with architectural forms as they compete to create ever larger and taller churches, such as the Cathedral of Saint-Stephen, Bourges. The collapse in 1284 of the 64-meter-high vault of the Cathedral of Saint-Pierre Beauvais marks the technical limits of Gothic architecture.\n\n1180 Philip Augustus (d. 1223) ascends to the French throne. During his reign, official documents begin to speak of “a king of France” rather than “the king of the Franks.” Philip augments the royal domain through marriage and conquest, extending his territorial influence to much of what is modern-day France. He reforms his administration, increases the royal treasury, and builds extensive defenses. In establishing the court permanently at Paris in 1194, he secures its place as the capital.\n\n13th century Spreading the weight of vaults over a series of ribs, columns, and pilasters, Gothic architecture allows the dissolution of the wall. Windows in cathedrals and churches are filled with stained glass; the shimmering colored light transfigures the vast interiors. Depicting biblical stories, scenes from the lives of the saints, or single figures, stained-glass windows complement the sculptures on the exterior and the rites and ceremonies observed within.\n\n1209 The Albigensian Crusade is launched by Pope Innocent III with the help of Cistercian monks. While the original spark for this war springs from papal desire to extinguish the growing problem of heresy in the region surrounding Toulouse, the political struggle between the independent southern territories and lords from northern France, joined after 1226 by Louis VIII, plays itself out in a war. In 1229, Count Raymond VII of Toulouse, who had been Louis VIII’s main adversary, is compelled to cede territory to the king’s control.\n\nca. 1210–1250 Artists at Chartres install an elaborate and extensive program of stained-glass windows in the cathedral under construction there. In addition to religious and historical subjects, the intensely colored windows depict numerous scenes of tradespeople at work, including bakers, furriers, wheelwrights, and weavers. These tradespeople were likely contributors—through hefty taxes—to the construction of the church.\n\n1226 Louis IX (d. 1270), grandson of Philip Augustus, becomes king. A pious man involved in works of charity and with a strong sense of his responsibilities, he exemplifies the virtues of the Christian knight. A protector both of the university and the arts, Louis IX makes Paris a thriving cultural center. Having bought the Crown of Thorns from the Byzantine emperor in 1237, Louis IX commissions the Sainte-Chapelle, his royal chapel on the Île de la Cité in Paris, as its reliquary. During his long reign, the capital becomes a center for the production of all precious arts: manuscript illumination, ivory carving, and goldsmiths’ work. Louis is canonized in 1297, less than thirty years after his death.\n\n1274 The Capetian kings foster national unity through the use of one language. The monk Primat translates the Grandes chroniques de France, a manuscript written at Saint-Denis celebrating the Capetian dynasty, from Latin into French.\n\n1300s With 20 million inhabitants, France is reputed the most powerful nation in Europe, as compared to Germany with a population of 14 million and England with 4 million.\n\n1309–1367 Due in part to political insecurity in Italy, the French pope Clement V takes up residence in Avignon, which at the time belongs to the count of Provence, a vassal of the king of France. The papal court at Avignon attracts intellectuals and artists from France and Italy, among them Petrarch and Simone Martini.\n\n1320s Endemic wars and the development of sea trade contribute to the decline of the annual fairs held in the county of Champagne east of Paris. Diverse wares such as Flemish cloth and tapestry work, Chinese silk, Egyptian satin, Eastern spices, furs from the North, and even wax from Russia had been available at these fairs, which made the region a crucial center of international commerce and banking since the late eleventh century.\n\n1328 Philip VI, the first French king from the Valois branch of the Capetian dynasty, ascends to the French throne.\n\n1348 The Black Death reaches France, killing, according to chronicler Jean Froissart, a third of the population."}, {"url": "https://www.britannica.com/biography/Philip-IV-king-of-France", "page_content": "Early years\n\nBorn at Fontainebleau while his grandfather was still ruling, Philip, the second son of Philip III (the Bold) and grandson of St. Louis (Louis IX), was not yet three when his mother, Isabella of Aragon, died on her return from the Crusade on which Louis IX had perished. The motherless Philip and his three brothers saw little of their father, who, stricken by Isabella’s death, threw himself into campaigning and administrative affairs. His troubled childhood and the series of blows he suffered explain in some measure the conflicting elements in his adult personality. In 1274 his father married Marie de Brabant, a beautiful and cultivated woman, and, with her arrival at court, intrigue began to flourish. In the same year, the two-year-old Joan, heiress of Champagne and Navarre, was welcomed as a refugee. Reared with the royal children, she would, when she was 12, become the bride of Philip the Fair.\n\nIn 1276 Philip’s elder brother, Louis, died, and the shock of this event, which suddenly made Philip heir to the kingdom, was compounded by persistent rumours of poisoning and suspicions that Philip’s stepmother intended to see Isabella’s remaining sons destroyed. Vague allegations were circulated that Louis’s death was linked with certain unspecified “unnatural acts” of his father. These rumours, never satisfactorily put to rest, together with the unexpected change in Philip’s fortunes, apparently served to arouse in him feelings of insecurity and mistrust.\n\nConsequently, Philip turned elsewhere in search of a model for his own conduct. He found it in Louis IX, whose memory was increasingly venerated as the number of miracles attributed to him mounted. Reports of Louis’s exacting standards of rulership and his saintly virtues were reinforced by the precepts of the religious advisers who surrounded the adolescent Philip. A more self-confident person might have been able to discriminate realistically among the sometimes artificially exaggerated stories and the utopian ideals. Philip, however, became convinced that it was his God-given duty to attain the lofty goals of his grandfather.\n\nBritannica Quiz Religion, Violence, and War Quiz\n\nWhen Philip was 16, he was knighted and married to Joan of Navarre. In 1285 he accompanied his father to the south on a campaign to install Philip’s brother Charles on the throne of Aragon. He had no sympathy with the enterprise, however, which was backed by his stepmother and aimed against the king of Aragon, his late mother’s brother. When his father died in October 1285, Philip immediately abandoned the venture."}, {"url": "https://www.silverhawkauthor.com/post/castles-in-france-medieval-fortresses-and-chateaux", "page_content": "Medieval Castles, Fortresses and Châteaux in France\n\n(Roman Geber Photo)\n\nChâteau Gaillard is a medieval castle ruin overlooking the River Seine above the commune of Les Andelys, in\n\nthe French department of Eure, in Normandy. It is located some 95 kilometres (59 mi) north-west of Paris and 40\n\nkilometres (25 mi) from Rouen. Construction began in 1196 under the auspices of Richard the Lionheart, who was simultaneously King of England and feudal Duke of Normandy. The castle was expensive to build, but the majority\n\nof the work was done in an unusually short period of time. It took just two years and, at the same time, the town\n\nof Petit Andely was built. Château Gaillard has a complex and advanced design, and uses early principles of\n\nconcentric fortification; it was also one of the earliest European castles to use machicolations (mâchicoulis).\n\n(These are floor openings between the supporting corbels of a battlement, through which stones or other material,\n\nsuch as boiling water or boiling cooking oil, could be dropped on attackers at the base of a defensive wall). The\n\ncastle consists of three enclosures separated by dry moats, with a keep in the inner enclosure.\n\nChâteau Gaillard was captured in 1204 by the king of France, Philip II, after a lengthy siege. In the mid-14th\n\ncentury, the castle was the residence of the exiled David II of Scotland. The castle changed hands several times\n\nin the Hundred Years' War, but in 1449 the French king captured Château Gaillard from the English king\n\ndefinitively, and from then on it remained in French ownership. Henry IV of France ordered the demolition of\n\nChâteau Gaillard in 1599. Although it was in ruins at the time, it was felt to be a threat to the security of the local\n\npopulation. The castle ruins are listed as a monument historique by the French Ministry of Culture. The inner\n\nbailey is open to the public from March to November, and the outer baileys are open all year.\n\nRichard the Lionheart inherited Normandy from his father, Henry II, in 1189 when he ascended to the throne of\n\nEngland. There was a rivalry between the Capetians and the Plantagenêts. Richard as the Plantagenêt king of\n\nEngland was more powerful than the Capetian king of France, despite the fact that Richard was a vassal of the\n\nFrench king and paid homage for his lands in the country. From 1190 to 1192, Richard the Lionheart took part\n\nin the Third Crusade. He was joined by Philip II of France, as each was wary that the other might invade his\n\nterritory in his absence. Richard was captured and imprisoned on the return journey to England, and he was not\n\nreleased until 4 February 1194. In Richard's absence, his brother John revolted with the aid of Philip; amongst\n\nPhilip's conquests in the period of Richard's imprisonment was the Norman Vexin (an historical county of\n\nnorthwestern France), and a few towns nearby, including Le Vaudreuil, Verneuil and Évreux. It took Richard\n\nuntil 1198 to reconquer a part of it.\n\nChâteau Gaillard stands high above the River Seine, an important transport route and on the site of a naturally\n\ndefendable position. The town of Grand Andely rests in the valley below the site. Under the terms of the Treaty\n\nof Louviers (January 1196) between Richard and Philip II, neither king was allowed to fortify the site. In spite\n\nof this treaty, Richard decided to build a castle at Andeli. Its purpose was to protect the duchy of Normandy from\n\nPhilip II, and it helped fill a gap in the Norman defences left by the fall of Château Gisors, and above all Château\n\nde Gaillon, a castle which belonged to Philip and used as an advanced French fortification to block the Seine valley.\n\nChâteau Gaillard also served as a base from which Richard could launch his campaign to take back the Norman\n\nVexin from French control. Les Andelys is located just in front of Gaillon on the other side of the Seine valley.\n\nRichard tried to obtain the manor through negotiation. Walter de Coutances, Archbisho of Rouen, was reluctant\n\nto sell the manor as it was one of the diocese's most profitable, and other lands belonging to the diocese had\n\nrecently been damaged by war. When Philip besieged Aumale in northern Normandy, on the border with Picardy,\n\nRichard grew tired of waiting and seized the manor, although the act was opposed by the Church.\n\nIn an attempt to get Pope Celestine III to intercede, Walter de Coutances left for Rome in November 1196.\n\nRichard sent a delegation to represent him in Rome. One of the party, Richard's, Lord Chancellor William\n\nLongchamp (who was also Bishop of Ely), died during the journey, although the rest, including Philip of Poitou,\n\nBishop of Durham, and Guillaume de Ruffière, Bishop of Lisieux, arrived in Rome. Walter de Coutances\n\nmeanwhile issued an interdict against the Duchy of Normandy, which prohibited church services from being\n\nperformed in the region. Roger of Howden detailed \"the unburied bodies of the dead lying in the streets and\n\nsquare of the cities of Normandy\". Construction began with the interdict hanging over Normandy, but it was later\n\nrepealed in April 1197 by Celestine, after Richard made gifts of land to Walter de Coutances and the diocese of\n\nRouen, including two manors and the prosperous port of Dieppe. The site of Château Gaillard had not been fortified\n\nbefore, and the town of Petit Andely was constructed at the same time; together with the historical Grand Andely,\n\nthe two are known as Les Andelys. The castle sits on a high limestone promontory, 90 m above Les Andelys and\n\noverlooking a bend in the River Seine. The castle was connected with Les Andelys through a series of\n\ncontemporary outworks.\n\nDuring King Richard's reign, the Crown's expenditure on castles declined from the levels spent by Henry II,\n\nRichard's father, although this has been attributed to a concentration of resources on Richard's war with the king\n\nof France. The work at Château Gaillard cost an estimated £12,000 between 1196 and 1198. Richard only spent a\n\nn estimated £7,000 on castles in England during his reign, similar as his father Henry II. The Pipe rolls (a\n\ncollection of financial records maintained by the English Exchequer), for the construction of Château Gaillard\n\ncontain the earliest details of how work was organised in castle building and what activities were involved.\n\nAmong those workmen mentioned in the rolls are miners, stone cutters, quarrymen, masons, lime-workers,\n\ncarpenters, smiths, hodmen, water carriers, soldiers to guard the workers, diggers who cut the ditch surrounding\n\nthe castle, and carters who transported the raw materials to the castle. A master-mason is omitted, and military\n\nhistorian Allen Brown has suggested that it may be because Richard himself was the overall architect; this is\n\nsupported by the interest Richard showed in the work through his frequent presence.\n\nNot only was the castle built at considerable expense, but it was built relatively rapidly. Construction of large\n\nstone castles often took the better part of a decade. The work at Dover castle, for example, took place between\n\n1179 and 1191 (at a cost of £7,000). Richard was present during part of the construction to ensure work proceeded\n\nat a rate he was happy with. According to William of Newburgh, in May 1198 Richard and the labourers working\n\non the castle were drenched in a \"rain of blood\". While some of his advisers thought the rain was an evil omen,\n\nRichard was undeterred: \"the king was not moved by this to slacken one whit the pace of work, in which he took s\n\nuch keen pleasure that, unless I am mistaken, even if an angel had descended from heaven to urge its abandonment\n\nhe would have been roundly cursed\".\n\nAfter just a year, Château Gaillard was approaching completion and Richard remarked \"Behold, how fair is this\n\nyear-old daughter of mine!\" Richard later boasted that he could hold the castle \"were the walls made of butter\".\n\nBy 1198, the castle was largely completed. At one point, the castle was the site of the execution of three soldiers\n\nof the king of France in retaliation for a massacre of Welsh mercenaries ambushed by the French. The three were\n\nthrown to their deaths from the castle's position high above the surrounding landscape. In his final years, the\n\ncastle became Richard's favourite residence, and writs and charters were written at Château Gaillard, bearing\n\n\"apud Bellum Castrum de Rupe\" (at the Fair Castle of the Rock). Richard did not enjoy the benefits of the castle\n\nfor long, however, as he died in Limousin on 6 April 1199, from an infected arrow wound to his shoulder, sustained\n\nwhile besieging Châlus.\n\nAfter Richard's death, King John of England failed to effectively defend Normandy against Philip's ongoing\n\ncampaigns between 1202 and 1204. Château de Falaise fell to Philip's forces, as well as castles from Mortain to\n\nPontorson, while Philip simultaneously besieged Rouen,which capitulated to French forces on 24 June 1204,\n\neffectively ending Norman independence. Philip laid siege to Château Gaillard, which was captured after a long\n\nsiege from September 1203 to March 1204. As Philip continued the siege throughout the winter and King John\n\nmade no attempt to relieve the castle, it was only a matter of time before the castellan was forced to capitulate.\n\nThe main source for the siege is Philippidos, a poem by William the Breton, Philip's chaplain. As a result, modern\n\nscholars have paid little attention to the fate of the civilians of Les Andelys during the siege.\n\nThe local Norman population sought refuge in the castle to escape from the French soldiers who ravaged the town.\n\nThe castle was well supplied for a siege, but the extra mouths to feed rapidly diminished the stores. Between\n\n1,400 and 2,200 non-combatants were allowed inside, increasing the number of people in the castle at least\n\nfive-fold. In an effort to alleviate the pressure on the castle's supplies, Roger de Lacy, the castellan, evicted 500\n\ncivilians. This first group was allowed to pass through the French lines unhindered, and a second group of similar\n\nsize did the same a few days later. Philip was not present, and when he learned of the safe passage of the civilians,\n\nhe forbade further people being allowed through the siege-lines. The idea was to keep as many people as possible\n\nwithin Château Gaillard to drain its resources. Roger de Lacy evicted the remaining civilians from the castle, at\n\nleast 400 people, and possibly as many as 1,200. The group was not allowed through, and the French opened fire\n\non the civilians, who turned back to the castle for safety, but found the gates locked. They sought refuge at the\n\nbase of the castle walls for three months; over the winter, more than half their number died from exposure and\n\nstarvation. Philip arrived at Château Gaillard in February 1204, and ordered that the survivors should be fed and\n\nreleased. Such treatment of civilians in sieges was not uncommon, and such scenes were repeated much later at\n\nthe sieges of Calais in 1346 and Rouen in 1418–1419, both in the Hundred Years' War.\n\nThe French gained access to the outermost ward by undermining its advanced main tower. Following this, Philip\n\nordered a group of his men to look for a weak point in the castle. They gained access to the next ward when a\n\nsoldier named Ralph found a latrine chute in use through which the French could clamber into the chapel. After\n\nambushing several unsuspecting guards, and setting fire to the buildings, Philip's men then lowered the movable\n\nbridge and allowed the rest of their army into the castle. The Anglo-Norman troops retreated to the inner ward.\n\nAfter a short time the French successfully breached the gate of the inner ward, and the garrison retreated finally\n\nto the keep. With supplies running low Roger de Lacy and his garrison of 20 and 120 other soldiers surrendered\n\nto the French army, bringing the siege to an end on 6 March 1204. In drawn-out medieval sieges, contemporary\n\nwriters often emphasised the importance of dwindling supplies in the capitulation of the garrison, as was the case\n\nwith the Siege of Château Gaillard. With the castle under French control, the main obstacle to the French entering\n\nthe Seine valley was removed. They were able to enter the valley unmolested and take Normandy. Thus, for the\n\nfirst time since it had been given as a duchy to Rollo in 911, Normandy was directly ruled by the French king.\n\nThe city of Rouen surrendered to Philip II on 23 June 1204. After that, the rest of Normandy was easily conquered\n\nby the French.\n\nAn impression by Eugène Viollet-le-Duc, a 19th-century architect experienced in renovating castles, of how the\n\nSiege of Château Gaillard would have looked.\n\nIn 1314, Château Gaillard was the prison of Margaret and Blanche of Burgundy, future queens of France. They\n\nhad been convicted of adultery in the Tour de Nesle Affair, and after having their heads shaved they were locked\n\naway in the fortress. Following the Scottish defeat at the Battle of Halidon Hill in 1333 during the Second War of\n\nScottish Independence, the child-king David II and certain of his court were forced to flee to France for safety.\n\nAt the time, southern Scotland was occupied by the forces of King Edward III of England. David, then nine years\n\nold, and his bride Joan of the Tower, the twelve-year-old daughter of Edward II, were granted the use of Château\n\nGaillard by Philip VI. It remained their residence until David's return to Scotland in 1341. David did not stay\n\nout of English hands for long after his return; he was captured after the Battle of Neville's Cross in 1346 and\n\nendured an eleven-year captivity in the Tower of London.\n\nDuring the Hundred Years' War between the English and French crowns, possession of the castle switched several\n\ntimes. Château Gaillard, along with Château de Gisors, Ivry-la-Bataille and Mont Saint-Michel, was one of four\n\ncastles in the Normandy which offered resistance to Henry V of England in 1419, after the capitulation of Rouen\n\nand much of the rest of the Duchy. Château Gaillard was besieged for a year before it was surrendered to the\n\nEnglish in December 1419. All the resisting castles except Mont Saint-Michel eventually fell, and Normandy\n\nwas temporarily returned to English control. Étienne de Vignolles, a mercenary (routier) known as La Hire, then\n\nre-captured Château Gaillard for the French in 1430. However, the English were revived by the capture and\n\nexecution of Joan of Arc, and although by then the war was turning against them, a month later they captured\n\nChâteau Gaillard again. When the French gained ascendancy again between 1449 and 1453 the English were\n\nforced out of the region, and in 1449 the castle was taken by the French for the last time.\n\nBy 1573, Château Gaillard was uninhabited and in a ruinous state, but it was still believed that the castle posed a\n\nthreat to the local population if it was repaired. Therefore, at the request of the French States-General, King Henry IV\n\nordered the demolition of Château Gaillard in 1599. Some of the building material was reused by Capuchin monks\n\nwho were granted permission to use the stone for maintaining their monasteries. In 1611, the demolition of\n\nChâteau Gaillard came to an end. The site was left as a ruin, and in 1862 was classified as a monument historique.\n\nIn 1962, a conference on the contributions of the Normans to medieval military architecture was held at Les Andelys.\n\nAllen Brown attended the conference and remarked that the castle was \"in satisfying receipt of skilful care and\n\nattention\". The journal Château Gaillard: Études de Castellogie Médiévale, which was published as a result of\n\nthe conference, has since run to 23 volumes, based on international conferences on the subject of castles. In the 1990s, archaeological excavations were carried out at Château Gaillard. The excavations investigated the north\n\nof the fortress, searching for an entrance postulated by architect Eugène Viollet-le-Duc, but no such entrance was\n\nfound. However, the excavation did reveal that there was an addition to the north of the castle to enable the use\n\nof guns. Typologically, the structure has been dated to the 16th century.\n\nThe conclusion of the excavations was that the site had \"enormous archaeological potential\", but that there were\n\nstill unanswered questions about the castle. After Philip II took Chateau Gaillard, he repaired the collapsed tower\n\nof the outer bailey that had been used to gain access to the castle. The archaeological investigation examined the\n\ntower generally thought to be the one collapsed by Philip, and although it did not recover any dating evidence, the\n\nconsensus is that he completely rebuilt the tower. In conjunction with the archaeological work, efforts were made\n\nto preserve the remaining structures. Today, Château Gaillard's inner bailey is open to the public from March to\n\nNovember, while the outer baileys are open all year round.\n\nChâteau Gaillard consists of three baileys, an inner, a middle, and an outer with the main entrance to the castle,\n\nand a keep, also called a donjon, in the inner-bailey. The baileys, which were separated by rock-cut ditches,\n\nhoused the castle's stables, workshops, and storage facilities. It is common for extant castles to be the result of\n\nseveral phases of construction, and to be adapted and added to over the period of their use. Château Gaillard,\n\nhowever, is essentially the result of one period of building. The division into three wards bears similarities with\n\nthe design of Château de Chinon, built by Henry II in the mid-12th century on a promontory overlooking a town.\n\nThe outer bailey is the southernmost feature of the castle. It is pentagon shaped, and there are five towers spaced\n\nalong the wall, three of which are at corners. North of the outer bailey is the middle bailey which is an irregular\n\npolygon. Like the outer bailey, the wall of the middle bailey is studded with towers. The towers allowed the\n\ngarrison to provide enfilading fire. In the fashion of the time. Most of the towers in the curtain walls of the\n\nmiddle and outer baileys were cylindrical. Château Gaillard was one of the first castles in Europe to use\n\nmachicolations, stone projections on top of a wall with openings that allowed objects to be dropped on an enemy\n\nat the base of the wall. Machicolations were introduced to Western architecture as a result of the Crusades. Until\n\nthe 13th century, the tops of towers in European castles had usually been surrounded by wooden galleries, which\n\nserved the same purpose as machicolations. An Eastern innovation, they may have originated in the first half of\n\nthe 8th century.\n\nWithin the middle bailey was the inner bailey. The gatehouse from the middle to the inner-bailey was one of the\n\nearliest examples of towers flanking the entrance to remove the blind-spot immediately in front of the gate. This\n\nwas part of a wider trend from around the late 12th or 13th century onwards for castle gateways to be strongly\n\ndefended. The design of the inner bailey, with its wall studded with semi-circular projections, is unparalleled.\n\nThis innovation had two advantages: firstly, the rounded wall absorbed the damage from siege engines much\n\nbetter as it did not provide a perfect angle to aim at; secondly, the arrowslits in the curved wall allowed arrows\n\nto be fired at all angles. The inner bailey, which contained the main residential buildings, used the principles of\n\nconcentric defence. This and the unusual design of the inner bailey's curtain wall meant that castle was advanced\n\nfor its age, since it was built before concentric fortification was fully developed in Crusader castles such as Krak\n\ndes Chevaliers. Concentric castles were widely copied across Europe. When Edward I of England, who had himself\n\nbeen on Crusade, built castles in Wales in the late 13th century, four of the eight he founded were concentric.\n\nThe keep was inside the inner bailey and contained the king's accommodation. It had two rooms: an antechamber\n\nand an audience room. While Allen Brown interpreted the audience room as the king's chamber, historian Liddiard\n\nbelieves it is probably a throne room. A throne room emphasises the political importance of the castle. In England\n\nthere is nothing similar to Château Gaillard's keep, but there are buildings with a similar design in France in the 12th\n\nand 13th centuries.\n\nAllen Brown described Château Gaillard as \"one of the finest castles in Europe\" and the military historian Sir\n\nCharles Oman wrote in 1924 that: \"Château Gaillard, as we have already had occasion to mention, was\n\nconsidered the masterpiece of its time. The reputation of its builder, Coeur de Lion, as a great military engineer\n\nmight stand firm on this single structure. He was no mere copyist of the models he had seen in the East, but\n\nintroduced many original details of his own invention into the stronghold\".\n\nDespite Château Gaillard's reputation as a great fortress, Liddiard highlights the absence of a well in the keep as\n\na peculiar weakness, and the castle was built on soft chalk, which would have allowed the walls to be undermined.\n\nBut other sources evoke the presence of three wells in the three different baileys and the soft chalk does not really\n\nweaken the very thick walls. Its weakness is more the result of its location (higher hill behind), its extension (more\n\nthan 200 metres (660 ft)) on a long narrow ridge and the difficulties in linking up the different baileys to allow a\n\ngood communication and to secure an efficient defence without a large garrison.\n\nChâteau Gaillard was important not solely as a military structure, but as a salient symbol of the power of Richard\n\nthe Lionheart. It was a statement of dominance by Richard, having reconquered the lands Philip II had taken.\n\nCastles such as Château Gaillard in France, and Dover in England, were amongst the most advanced of their age,\n\nbut were surpassed in both sophistication and cost by the works of Edward I of England in the latter half of the\n\n13th century. (Friar, Stephen (2003), The Sutton Companion to Castles, Stroud: Sutton Publishing), (Liddiard, Robert\n\n(2005), Castles in Context: Power, Symbolism and Landscape, 1066 to 1500, Macclesfield: Windgather Press Ltd)\n\n(Urban Photo)\n\nThe keep of Château Gaillard.\n\n(Philippe Alès Photo)\n\nChâteau Gaillard.\n\n(Olivier Cambus Photo)\n\nAerial view of Château Gaillard.\n\n(Sylvan Verlaine Photo)\n\nAerial view of Château Gaillard.\n\n(Michel Cheron Photo)\n\nChâteau Gaillard.\n\n(Casper Moller Photo)\n\nChâteau Gaillard.\n\n(ignis Photo)\n\nChâteau de Foix (Castèl de Fois) is a castle which dominates the town of Foix in the French départment of Ariège.\n\nAn important tourist site, it is known as a centre of the Cathars. It has been listed since 1840 as a monument\n\nhistorique by the French Ministry of Culture.\n\nBuilt In the style of 7th-century fortification, the castle is known from 987. In 1002, it was mentioned in the will\n\nof Roger I, Count of Carcassone, who bequeathed the fortress to his youngest child, Bernard. In effect, the family\n\nruling over the region were installed here which allowed them to control access to the upper Ariège valley and to\n\nkeep surveillance from this strategic point over the lower land, protected behind impregnable walls. In 1034, the\n\ncastle became the capital of the County of Foix, and played a decisive role in medieval military history. During\n\nthe two following centuries, the castle was home to Counts with shining personalities who became the soul of the\n\nOccitan resistance during the crusade against the Albigensians. The county became a privileged refuge for\n\npersecuted Cathars.\n\nThe castle, often besieged (notably by Simon de Montfort in 1211 and 1212), resisted assault and was only taken\n\nonce, in 1486, thanks to treachery during the war between two branches of the Foix family. From the 14th century,\n\nthe Counts of Foix spent less and less time in the uncomfortable castle, preferring the Governors' Palace (Palais\n\ndes gouverneurs). From 1479, the Counts of Foix became Kings of Navarre and the last of them, Henri IV of\n\nFrance, annexed his Pyrrenean lands to France. As seat of the Governor of the Foix region from the 15th century,\n\nthe castle continued to ensure the defence of the area, notably during the Wars of Religion. Alone of all the castles\n\nin the region, it was exempted from the destruction orders of Richelieu (1632-1638).\n\nUntil the Revolution, the fortress remained a garrison. Its life was brightened with grand receptions for its\n\ngovernors, including the Count of Tréville, captain of musketeers under Louis XIII and Marshal Philippe Henri\n\nde Ségur, one of Louis XVI's ministers. The Round Tower, built in the 15th century, is the most recent, the two\n\nsquare towers having been built before the 11th century. They served as a political and civil prison for four\n\ncenturies until 1862.\n\nSince 1930, the castle has housed the collections of the Ariège départemental museum. Sections on prehistory,\n\nGallo-Roman and mediaeval archaeology tell the history of Ariège from ancient times. Currently, the museum is\n\nrearranging exhibits to concentrate on the history of the castle site so as to recreate the life of Foix at the time of\n\nthe Counts. (AUÉ, Michèle (1992). Discover Cathar Country. Pleasance, Simon (trans.). Vic-en-Bigorre, France: MSM)\n\n(Jean Louis Venet Photo)\n\nChâteau de Foix.\n\n(Patrick Castay Photo)\n\nChâteau de Foix.\n\n(BLUMJ Photo)\n\nChâteau de Foix.\n\n(Krzysztof Golik Photo)\n\nChâteau de Foix.\n\n(Nitot Photo)\n\nChâteau de Falaise is a castle located in the south of the commune of Falaise (cliff) in the department of Calvados,\n\nin the region of Normandy, France. William the Conqueror, the son of Duke Robert of Normandy, was born in an\n\nearlier castle on the same site in about 1028. William went on to conquer England and become king, and possession\n\nof the castle descended through his heirs until the 13th century when it was captured by King Philip II of France.\n\nPossession of the castle changed hands several times during the Hundred Years' War. The castle was abandoned\n\nduring the 17th century. Since 1840 it has been protected as a monument historique.\n\nOn the death of Richard II, Duke of Normandy, in August 1026 his son (also called Richard) succeeded to the duchy.\n\nThe inheritance however was disputed by Richard III's younger brother, Robert. Not content with his inheritance\n\nof the town of Exmes and its surrounding area, Robert rebelled and took up arms against his brother and he captured\n\nthe castle of Falaise. Richard besieged the castle and forced Robert to submit to him, however the duke died from\n\nunknown causes in 1027 and was succeeded by his brother. Robert fathered an illegitimate son by a woman named\n\nHerleva, who was from the town of Falaise and the daughter of a chamberlain. The child, William, was born in\n\nabout 1028.\n\nThe castle (12th–13th century), which overlooks the town from a high crag, was formerly the seat of the Dukes of\n\nNormandy. The construction was started on the site of an earlier castle in 1123 by Henry I of England, with the\n\nlarge keep (grand donjon). Later was added the \"small keep\" (petit donjon). The tower built in the first quarter\n\nof the 12th century contained a hall, chapel, and a room for the lord, but no small rooms for a complicated household\n\narrangement; in this way, it was similar to towers in England at Corfe, Norwich and Portchester.\n\nArthur I, Duke of Brittany, was King John of England's teenage nephew, and a rival claimant to the throne of\n\nEngland. With the support of King Philip II of France, Arthur embarked on a campaign in Normandy against\n\nJohn in 1202, and Poitou revolted in support of Arthur. The Duke of Brittany besieged his grandmother, Eleanor\n\nof Aquitaine, in the Château de Mirebeau. John marched on Mirebeau, taking Arthur by surprise and capturing\n\nhim on 1 August. From there Arthur was conveyed to Falaise where he was imprisoned in the castle's keep.\n\nAccording to contemporaneous chronicler Ralph of Coggeshall, John ordered two of his servants to mutilate the\n\nduke. Hugh de Burgh was in charge of guarding Arthur and refused to let him be mutilated, but to demoralise\n\nArthur's supporters, announced his death. The circumstances of Arthur's death are unclear, though he probably died in 1203.\n\nIn about 1207, after having conquered Normandy, Philip II Augustus ordered the building of a new cylindrical keep.\n\nIt was later named the Talbot Tower (Tour Talbot) after the English commander responsible for its repair during the\n\nHundred Years' War. It is a tall round tower, similar design to the towers built at Gisors and the medieval Louvre.\n\nPossession of the castle changed hands several times during the Hundred Years' War. The castle was deserted\n\nduring the 17th century.\n\nA programme of restoration was carried out between 1870 and 1874. The castle was damaged during a\n\nbombardment during the Second World War in the battle for the Falaise pocket in 1944, but the three keeps were\n\nunscathed.\n\n(Ollamh Photo)\n\nChâteau de Falaise.\n\n(rene boulay Photo)\n\nChâteau de Falaise.\n\n(rene boulay Photo)\n\nChâteau de Falaise.\n\nGround plan of Château de Falaise.\n\n(Brady Benot Photo)\n\nChâteau de Falaise.\n\n(Brady Benot Photo)\n\nChâteau de Falaise.\n\n(Viault Photo)\n\nAerial view of Château de Falaise.\n\n(Nitot Photo)\n\nChateau-de-Gisors, Eure, Normandy, France. The castle was a key fortress of the Dukes of Normandy in the 11th\n\nand 12th centuries. It was intended to defend the Anglo-Norman Vexin territory from the pretensions of the King\n\nof France. In 1193, while King Richard I of Enlgand (also Duke of Normandy) was imprisoned in Germany, the\n\ncastle fell into the hands of King Philip II of France. After Richard's death in 1199, Philip conquered much of the\n\nrest of Normandy and Gisors thereafter lost a good part of its importance as a frontier castle. The castle is also\n\nknown for its links with the Templars. Put into their charge by the French king between 1158 and 1160, it became\n\nthe final prison of the Grand Master of the Order, Jacques de Molay, in 1314. Although it has been estimated that\n\nthe bailey could have housed 1,000 soldiers, in 1438 (during the Hundred Years' War) the English garrison\n\nnumbered just 90. By 1448, this had decreased to 43.\n\nThe first building work is dated to about 1095, and consisted of a motte, which was enclosed in a spacious\n\ncourtyard or bailey. Henry I of England, Duke of Normandy, added an octagonal stone keep to the motte. After\n\n1161, important reinforcement work saw this keep raised and augmented; the wooden palisade of the motte\n\nconverted to stone, thus forming a chemise; and the outer wall of the bailey was completed in stone with flanking\n\ntowers. The octagonal keep is considered one of the best preserved examples of a shell keep. A second keep,\n\ncylindrical in shape, called the Prisoner's Tower (tour du prisonnier), was added to the outer wall of the castle at\n\nthe start of the 13th century, following the French conquest of Normandy. Further reinforcement was added\n\nduring the Hundred Years' War. In the 16th century, earthen ramparts were built.\n\n(Gi.bareau Photo)\n\nChateau-de-Gisors.\n\n(Pierre Poschadel Photo)\n\nChateau-de-Gisors.\n\n(CJ DUB Photo)\n\nChateau-de-Gisors.\n\n(Patrick Rock Photo)\n\nChateau-de-Gisors, the keep, Eure, Normandy, France.\n\n(Marc Ryckaert Photo)\n\nThe Château d'Angers is acastle in the city of Angers in the Loire Valley, in the département of Maine-et-Loire,\n\nin France. Founded in the 9th century by the Counts of Amjour, it was expanded to its current size in the 13th\n\ncentury. It is located overlooking the river Maine. It has been listed as a historical monument since 1875. Now\n\nopen to the public, the Château d'Angers is home of the Apocalypse Tapestry.\n\nOriginally, the Château d'Angers was built as a fortress at a site inhabited by the Romans because of its strategic\n\ndefensive location. In the 9th century, the Bishop of Angers gave the Counts of Anjou permission to build a castle\n\nin Angers. The construction of the first castle began under Count Fulk III (970–1040), who was celebrated for his\n\nconstruction of dozens of castles. He built Château d'Angers to protect Anjou from the Normans. It became part\n\nof the Angevin Empire of the Plantagenet Kings of England during the 12th century. In 1204, the region was\n\nconquered by Philip II, and the new castle was constructed during the minority of his grandson, Louis IX (Saint\n\nLouis) in the early part of the 13th century. Louis IX rebuilt the castle in whitestone and black slate, with 17\n\nsemicircular towers. The construction undertaken in 1234 cost 4,422 livres, roughly one per cent of the estimated\n\nroyal revenue at the time. Louis gave the castle to his brother, Charles in 1246.\n\nIn 1352, King John II le Bon, gave the castle to his second son, Louis, who later became the Count of Anjou. He\n\nmarried the daughter of the wealthy Duke of Brittany, and with her wealth, Louis had the castle modified. In 1373,\n\nhe commissioned the famous Apocalypse Tapestry, from from a work of art the painted by Hennequin de Bruges,\n\nand the Parisian tapestry-weaver Nicolas Bataille. Louis II (Louis I's son) and Yolande d'Aragon, added a chapel\n\n(1405–12) and royal apartments to the complex. The chapel is a sainte chapelle, the name given to churches which\n\nenshrined a relic of the Passion. The relic at Angers was a splinter of the fragment of the True Cross which had\n\nbeen acquired by Louis IX.\n\nIn the early 15th century, the hapless dauphin who, with the assistance of Joan of Arc would become King\n\nCharles VII, had to flee Paris and was given sanctuary at the Château d' Angers.\n\nIn 1562, Catherine de Medici, had the castle restored as a powerful fortress, but her son, Henry III, reduced the\n\nheight of the towers and had the towers and walls stripped of their embattlements. Henry III then used the castle\n\nstones to build streets and develop the village of Angers. Because of the threat of attacks from the Hugenots,\n\nhowever, the king maintained the castle's defensive capabilities by making it a military outpost and by installing\n\nartillery on the château's upper terraces. At the end of the 18th century, as a military garrison, it showed its worth\n\nwhen its thick walls withstood a massive bombardment by cannons from the Vendean army. Unable to do defeat\n\nthe walls, the invaders withdrew.\n\nA military academy was established in the castle to train young officers in the strategies of war. Arthur Wellesley,\n\n1st Duke of Wellington, best known for taking part in the defeat of Napoleon Bonaparte at the Battle of Waterloo\n\nin 1815, was trained at the Military Academy of Angers. The academy was later moved to Saumur and the castle\n\nwas used for the rest of the 19th century as a prison, powder magazine and barracks.\n\nThe castle continued to be used as an armory through the First and Second World Wars. It was severely damaged\n\nduring the Second World War by the Nazis, when an ammunition storage dump inside the castle exploded.\n\nOn 10 January 2009, the castle suffered severe damage from an accidental fire due to electrical wires short-circuiting.\n\nThe Royal Logis, which contains old tomes and administrative offices, was the most heavily damaged part of the\n\nchateau, resulting in 400 square metres (4,300 sq ft) of the roof being completely burnt. The Tapestries of the\n\nApocalypse were not damaged. Total damages have been estimated at 2 million Euros. The City of Angers now\n\nowns the massive, austere castle, and it has been converted to a museum housing the oldest and largest collection\n\nof medieval tapestries in the world. It maintains the 14th-century \"Apocalypse Tapestry\" as one of its priceless\n\ntreasures. As a tribute to its fortitude, the castle has never been taken by any invading force in history.\n\nThe outer wall is 3 metres (9.8 ft) thick, extends for about 660 m (2,170 ft) and is protected by seventeen massive\n\ntowers. Each of the perimeter towers measures 18 m (59 ft) in diameter. The château covers an area of 20,000\n\nsquare metres (220,000 sq ft). Two pairs of towers form the city and landward entrances of the château. Each of\n\nthe towers was once 40 metres (130 ft) in height, but they were later cut down for the use of artillery pieces. The\n\nTour du Moulin is the only tower which conserves the original elevation.\n\n(Delbos, Claire (2010), La France fortifiée: Châteaux, citadelles et forteresses (in French), Petit Futé)\n\n(Chatsam Photo)\n\nChâteau d'Angers.\n\n(Chatsam Photo)\n\nChâteau d'Angers, entrance.\n\n(Denis Jarvis Photo)\n\nChâteau d'Angers.\n\nGround plan of Château d'Angers: A: gate to the medieval town; B: south gate; C: Tour de moulin; D: royal\n\nlodgings; E: chatelet (a type of gatehouse); F: gallery of the Apocalypse Tapestry; G: great hall; H: chapel; I:\n\ngovernor's lodgings; J: inner court; K: gardens; L: terraced gardens.\n\n(Kauczuk Photo)\n\nChâteau d'Angers keep.\n\n(Nataloche Photo)\n\nChâteau d'Angers.\n\n(Kimon Berlin Photo)\n\nThe Apocalypse Tapestry at Château d'Angers.\n\n(Wrtalya Photo)\n\nChâteau du Haut-Kœnigsbourg is a medieval castle located in the commune of Orschwiller in the Bas-Rhin\n\ndépartment of Alsace. It is located in the Vosges mountains just west of Sélestat, situated in a strategic area on a\n\nrocky spur overlooking the Upper Rhine Plain. It was used by successive powers from the Middle Ages until the\n\nThirty Years' War, when it was abandoned. From 1900 to 1908 it was rebuilt at the behest of the German Kaiser\n\nWilhelm II. Today it is a major tourist site, attracting more than 500,000 visitors a year.\n\nThe Buntsandstein cliff was first mentioned as Stofenberk (Staufenberg) in a 774 deed issued by the Frankish\n\nking Charlemagne. Mentioned again in 854, it was at that time a possession of the French Basilica of St. Denis,\n\nand the site of a monastery. It is not known when the first castle was built on this site, but a Burg Staufen (Castrum\n\nEstufin) is documented in 1147, when the monks complained to King Louis VII of France about its unlawful\n\nconstruction by the Hohenstaufen Duke Frederick of Swabia. Frederick's younger brother Conrad III, had been\n\nelected King of the Romans in 1138. He was succeeded by Frederick's son Frederick Barbarossa in 1152, and by\n\n1192 the castle was called Kinzburg (Königsburg, \"King's Castle\").\n\nIn the early thirteenth century, the fortification passed from the Hohenstaufen family to the dukes of Lorraine,\n\nwho entrusted it to the local Rathsamhausen knightly family and the Lords of Hohenstein, who held the castle\n\nuntil the fifteenth century. As the Hohensteins allowed some robber barons to use the castle as a hideout, and\n\ntheir behaviour began to exasperate the neighbouring rulers, in 1454 it was occupied by Elector Palatine Frederick I.\n\nIn 1462, the castle was set ablaze by the unified forces of the cities of Colmar, Strasbourg and Basel.\n\nIn 1479, the Habsburg Emperor Frederick III granted the castle ruins in fief to the Counts of Thierstein, who\n\nrebuilt them with a defensive system suited to the new artillery of the time. When in 1517 the last Thierstein died,\n\nthe castle became a reverted fief and again came into the possession of the Habsburg emperor of the day,\n\nMaximilian I. In 1633, during the Thirty Years' War, in which Catholics forces fought Protestants, the Imperial\n\ncastle was besieged by Protestant Swedish forces. After a 52-day siege, the castle was burned and looted by the\n\nSwedish troops. For several hundred years it was left unused, and the ruins became overgrown by the forest.\n\nVarious romantic poets and artists were inspired by the castle during this time.\n\nThe ruins had been listed as a \"monument historique\" of the Second French Empire since 1862 and were purchased\n\nby the township of Sélestat (or Schlettstadt) three years later. After the Franco-Prussian War of 1870 to 1871, the\n\nregion was incorporated into the German Imperial Territory of Alsace-Lorraine, and in 1899 the citizens granted\n\nwhat was left of the castle to the German Emperor Wilhelm II. Wilhelm wished to create a castle lauding the\n\nqualities of Alsace in the Middle Ages and more generally of German civilization stretching from Hohkönigsburg\n\nin the west to (likewise restored) Marienburg Castle in the east. He also hoped the restoration would reinforce the\n\nbond of Alsatians with Germany, as they had only recently been incorporated into the newly established German\n\nEmpire. The management of the restoration of the fortifications was entrusted to the architect Bodo Ebhart, a\n\nproven expert on the reconstruction of medieval castles. Work proceeded from 1900 to 1908. On 13 May 1908,\n\nthe restored Hohkönigsburg was inaugurated in the presence of the Emperor. In an elaborate re-enactment c\n\neremony, a historic cortege entered the castle, under a torrential downpour.\n\nEbhart's aim was to rebuild it, as near as possible, to the way it was on the eve of the Thirty Years' War. He relied\n\nheavily on historical accounts but, occasionally lacking information, he had to improvise some parts of the\n\nstronghold. For example, the Keep tower is now reckoned to be about 14 metres too tall. Wilhelm II, who\n\nregularly visited the construction site via a specially built train station in nearby Saint-Hippolyte, also encouraged\n\ncertain modifications that emphasised a Romantic nostalgia for Germanic civilization. For example, the main\n\ndining hall has a higher roof than it did at the time, and links between the Hohenzollern family and the Habsburg\n\nrulers of the Holy Roman Empire are emphasized. The Emperor wanted to legitimise the House of Hohenzollern\n\nat the head of the Second Empire, and to assure himself as worthy heir of the Hohenstaufens and the Habsburgs.\n\nAfter the end of the First World War, the French state confiscated the castle in accordance with the 1919 Treaty of\n\nVersailles. It has been listed since 1862 and classified since 1993 as a \"monument historique\", by the French\n\nMinistry of Culture. In 2007, ownership was transferred to the Bas-Rhin département.Today, it is one of the most\n\nfamous tourist attractions in the region. Bodo Ebhardt restored the castle following a close study of the remaining\n\nwalls, archives and other fortified castles built at the same period.\n\nEngraving of Château du Haut-Kœnigsbourg ruins, 1889, by T. Taylor.\n\nPlan view of Château du Haut-Kœnigsbourg.\n\n(Gzen92 Photo)\n\nChâteau du Haut-Kœnigsbourg, view from the village of Orschwiller.\n\n(Meffo Photo)\n\nChâteau du Haut-Kœnigsbourg, main entrance.\n\n(Gregorini Demetrio Photo)\n\nChâteau du Haut-Kœnigsbourg, main entrance.\n\n(Zairon Photo)\n\nReliefs over the top of the main entrance to the Château du Haut-Kœnigsbourg.\n\n(Fr Antunes Photo)\n\nChâteau du Haut-Kœnigsbourg, view looking East.\n\n(Michael Schmalenstroer Photo)\n\nChâteau du Haut-Kœnigsbourg, Grand Bastion.\n\n(Bernard Chenal Photo)\n\nChâteau du Haut-Kœnigsbourg, view from the village of Orschwiller.\n\n(Alsace Destination Tourisme, Aerial Photo)\n\nChâteau fort de Fleckenstein is a ruined castle in the commune of Lembach, in the Bas-Rhin département of\n\nFrance. This fortress, built in the shape of 52 m long boat, stands on a dramatic rock face and has a long history.\n\nThe castle was built on a sandstone summit in the Middle Ages. An ingenious system for collecting rainwater fed\n\na cistern and a hoist allowed water and other loads to be moved to the upper floors.\n\n\n\nA castle is known to have existed on the site in 1165. It is named after the Fleckenstein family, owners until 1720\n\nwhen it passed to the Vitzthum d'Egersberg family. The family had had a lordship that consisted of four separate\n\nsmall territories in the Bas-Rhin département. In 1807, it passed to J.-L. Apffel and in 1812 to General Harty,\n\nbaron of Pierrebourg (French word for Fleckenstein: stone town). In 1919, it became the property of the French state.\n\nThe rock and the castle have been modified and modernised many times. Of the Romanesque castle, remains\n\ninclude steps cut into the length of the rock, troglodyte rooms and a cistern. The lower part of the well tower\n\ndates from the 13th or 14th century, the rest from the 15th and 16th. The inner door in the lower courtyard carries\n\nthe faded inscription 1407 (or 1423); the outer door 1429 (or 1428). The stairwell tower is decorated with the\n\narms of Friedrich von Fleckenstein (died 1559) and those of his second wife, Catherine von Cronberg (married 1537).\n\nThe 16th-century castle, modernised between 1541 and 1570, was shared between the two branches of the\n\nFleckenstein family. Documents from the 16th century describe the castle and a watercolour copy of a 1562 tapestry\n\nillustrated its appearance in this period. Towards the end of the 17th-century Fleckenstein was captured twice by\n\nFrench troops. In 1674 the capture was achieved by forces under Marshall Vauban, who encountered no resistance\n\nfrom the defenders. The castle was nevertheless completely destroyed in 1689 by General Melac. Major restoration\n\nwork was carried out after 1870, around 1908 and again since 1958.\n\nThe castle is located between Lembach to the south and Hirschtal to the north, only about 200 meters to the\n\nsoutheast of the present French frontier with Germany, at a height of about 370 meters above mean sea level.\n\nThe nearest more substantial town is Wissembourg, approximately 20 km / 12 miles to the east. The castle, is\n\naccessible by road or via (well established) hiking trails. (Ministère français de la Culture. Château fort de Fleckenstein)\n\n(Merian)\n\nChâteau fort de Fleckenstein, Matthaus Merian illustration, c1663.\n\n(Made in Alsace Photo)\n\nChâteau fort de Fleckenstein, view from Hohenburg castle.\n\n(Rob124 Photo)\n\nChâteau fort de Fleckenstein.\n\n(Pinterest Photo)\n\nChâteau fort de Fleckenstein, aerial view.\n\n(Stardsen Photo)\n\nChâteau de Coucy is a French castle in the commune of Coucy-le-Château-Affrique, in Picardy, built in the 13th\n\ncentury and renovated by Eugè Viollet-le-Duc in the 19th century. During its heyday, it was famous for the size\n\nof its central tower and the pride of its lords, who adopted the staunchly independent rhyme: roi ne suis, ne prince\n\nne duc ne comte aussi; Je suis le sire de Coucy (\"I am not king, nor prince nor duke nor count; I am the Lord of Coucy\").\n\nThe castle was constructed in the 1220s by Enguerrand III, Lord of Coucy. The castle proper occupies the tip of a\n\nbluff or falaise. It forms an irregular trapezoid of 92 x 35 x 50 x 80 m. At the four corners are cylindrical towers\n\n20 m in diameter (originally 40 m in height). Between two towers on the line of approach was the massive donjon\n\n(keep). The donjon was the largest in Europe, measuring 35 meters wide and 55 meters tall. The smaller towers\n\nsurrounding the court were as big as the donjons being built at that time by the French monarchy. The rest of the\n\nbluff is covered by the lower court of the castle, and the small town.\n\nCoucy was occupied in September 1914 by German troops during the First World War. It became a military\n\noutpost and was frequented by German dignitaries, including Emperor Wilhelm II. In April 1917, the German\n\narmy dynamited the keep and the four towers using 28 tons of explosives to prevent their use by enemy artillery\n\nspotters as the Germans fell back in the region.\n\nThe demolition was done on order of General Erich Ludendortt, destroying the keep and the 4 towers. The\n\ndestruction caused so much public outrage that in April 1917 the ruins were declared \"a memorial to barbarity\". War reparations were used to clear the towers and to consolidate the walls but the ruins of the keep were left in place.\n\nChâteau de Coucy has been listed as a monument historique by the French Ministry of Culture since 1862.\n\n(Laurent, Jean-Marc. Le château féodal de Coucy. La Vague verte, 2001)\n\n(Shep Photo)\n\nModel of Château de Coucy.\n\nAerial view of Château de Coucy before its destruction in 1917.\n\n(Siaux Romuald Photo)\n\nChâteau de Coucy.\n\n(Siaux Romuald Photo)\n\nChâteau de Coucy.\n\n(Szeder László Photo)\n\nChâteau de Coucy.\n\nChâteau de Coucy illustration by Viollet-le-Duc\n\n(Rolf Kranz Photo)\n\nChâteau de Coucy.\n\nIf you would like to learn more about castles and sieges have a look here:\n\nIt has been said that the taking of a fortress depends primarily on the making of a good plan to take it, and the\n\nproper implementation and application of the resources to make the plan work. Long before a fortress has been\n\nbesieged and conquered, it has to have been outthought before it can be outfought. This book outlines some of the\n\nmore successfully thought out sieges, and demonstrates why it is that no fortress is impregnable.\n\nA siege can be described as an assault on an opposing force attempting to defend itself from behind a position of\n\nsome strength. Whenever the pendulum of technology swings against the \"status quo,\" the defenders of a fortification\n\nhave usually been compelled to surrender. We must stay ahead of the pendulum, and not be out-thought long before\n\nwe are out-fought, for, as it will be shown in this book, \"no fortress is impregnable.\"\n\nOrder book, soft cover or hard cover: http://bookstore.iuniverse.com/Products/SKU-000018310/Siegecraft--No-Fortress-Impregnable.aspx\n\nOrder in Canada: paperback http://www.chapters.indigo.ca/books/Siegecraft-No-Fortress-Impregnable-Harold-A-Skaarup/9780595275212-item.html?ikwid=harold+skaarup&ikwsec=Books\n\nE-book: http://www.kobobooks.com/ebook/Siegecraft---No-Fortress/book-XPscrt6nJUqjLcNZ14j9GQ/page1.html?utm_source=indigo&utm_medium=web&utm_campaign=retailer&ikwid=harold+skaarup&ikwsec=Books\n\nHardcover: http://www.chapters.indigo.ca/books/Siegecraft-No-Fortress-Impregnable-Harold-A-Skaarup/9780595656851-item.html?ikwid=harold+skaarup&ikwsec=Books\n\nhttp://www.amazon.ca/Siegecraft-Fortress-Impregnable-Harold-Skaarup/dp/0595656854/ref=sr_1_45?s=books&ie=UTF8&qid=1322341951&sr=1-45\n\nNook book: http://www.barnesandnoble.com/w/siegecraft-no-fortress-impregnable-skaarup-harold/1109600163?ean=9781462047505&itm=79&USRI=Harold+Skaarup\n\n‍"}, {"url": "https://www.britannica.com/biography/Philip-V-king-of-France", "page_content": "Philip V, byname Philip The Tall, French Philippe Le Long, (born c. 1293—died Jan. 3, 1322), king of France (from 1316) and king of Navarre (as Philip II, from 1314), who largely succeeded in restoring the royal power to what it had been under his father, Philip IV.\n\nPhilip was the second son of Philip IV, who made him count of Poitiers in 1311. When his elder brother, King Louis X, died in 1316, leaving an infant daughter Joan by his adulterous first wife, and a pregnant widow, Philip won recognition as regent for the unborn child and then, upon its death in November 1316, five days after birth, declared himself king. Anointed at Reims in January 1317, Philip quickly moved to consolidate his position, and on February 2 an assembly of barons, prelates, Parisian bourgeois, and doctors of the University of Paris recognized him as king, enunciating the principle that Joan, as a woman, could not succeed to the throne of France.\n\nAnxious to ensure peace and order as a means to the prosperity of the kingdom, Philip established a system of local militias under officers responsible to the crown; he also increased the efficiency of government machinery at all levels and checked the abuses of local officials. He was succeeded by his brother, Charles IV."}, {"url": "https://www.touropia.com/castles-in-france/", "page_content": "In France, every castle is a château, but not every château is a castle. The French word can be used to describe most of the thousands of castles, palaces and stately homes scattered around the country. Many France’s best-loved castles are nestled in the verdant Loire Valley, but there are great examples of medieval fortresses and fairytale castles in every part of the country. From the romantic ruins of Château de Loches to the nearly fully restored Cité de Carcassonne, no visit to France is complete without exploring the best castles in France.\n\n10. Chateau de Vitre [SEE MAP]\n\nA medieval castle located in the town of Vitré in Brittany, the Château de Vitré was built at the end of the 11th century after a wood fortress on the site suffered a series of fires. The castle was expanded during the 15th century with the addition of a gatehouse, a drawbridge and an imposing tower. The fortified citadel was nevertheless surrendered without a fight in 1487. In 1820, the town bought the castle for 8,500 francs and restored its outer structure. Today, the château houses a small museum and a town hall.\n\n9. Chateau de Fougeres [SEE MAP]\n\nLocated near the city of Rennes in Brittany, the Château de Fougères was built in the 11th century on a rock surrounded by the Nançon River. The original wood structure was destroyed when the fortress was taken by Henry II of England, and a second castle was built by Henri II Plantangenet from stone. Two massive towers were added to the fortress in the 13th century. One of the largest medieval fortresses in Europe, the château is today owned by the city of Fougères and is operated as a tourist attraction. Audio guides lead visitors through the fortress with music and sound effects that help recreate the feeling of castle life during the Medieval Era.\n\nBuilt on the site of an abandoned Roman settlement in the 9th century, the Château d’Angers is one of the most visited castles in France. Located in the Loire Valley in the city of Angers, the château is home to the world-famous Tapestry of the Apocalypse, a set of beautiful tapestries woven between 1373 and 1382. Commissioned by Louis I, Duke of Anjou, the tapestry illustrates events from the Bible’s Book of Revelation in astonishing detail and color. With its 17 watchtowers and forbidding black-stone construction, the castle is impressive as well. Guided tours of the château are free and self-guided audio guides are available for a small fee.\n\nPerched on a hill overlooking the Seine and the city of Les Andelys, the Château Gaillard is one of the prettiest sights in picturesque Upper Normandy. Richard the Lionheart built the castle between 1196 and 1198, but despite its concentric fortification and deadly machicolations, the fortress was taken by Philip II of France just six years later. Château Gaillard continued to change hands between the English and French until it was ordered destroyed by Henry IV of France in 1599. The thick castle walls resisted destruction, however, and the citadel remains an impressive sight. Most of the castle’s ruins are open to the public year round. The inner keep, which contained the king’s accommodations are open from March to November.\n\n6. Chateau de Vincennes [SEE MAP]\n\nLocated in the Paris suburb of Vincennes, the Château de Vincennes began life as a hunting lodge for Louis VII. The site was improved during the 14th century with a heavily fortified keep, and a rectangular-shaped outer wall was added in the 15th century. A wide moat and two drawbridges helped secure the keep, which served as a royal residence until the mid 1600s. In 1860, Napoleon III gave the château and the nearby Bois de Vincennes to Paris for use as a public park. Today, the keep and the 16th-century royal chapel are open to visitors.\n\nThe château du Haut-Kœnigsbourg is nestled at a strategic location on a high hill overlooking the Alsatian plain in the Vosges mountains, France. It was used by successive powers from the Middle Ages until the Thirty Years’ War when the castle was burned and pillaged by Swedish troops after a 52-day siege. After this the Château was left unused for a few hundred years and became overgrown by forest. In 1899 it was given to the German emperor Wilhelm II and rebuilt as it was on the eve of the Thirty Years’ War. When the French confiscated the castle after WWI it was considered fashionable to sneer at the castle because of its links to the emperor but today its one of the most popular castles in France, attracting more than 500,000 visitors a year.\n\n4. Chateau de Loches [SEE MAP]\n\nBuilt about 500 meters (1,600 feet) from the banks of the Indre River in the Loire Valley, the Château de Loches is as famous for its mammoth square-shaped central keep as it is for its connections to French and English royalty. Constructed in the 11th century, the castle was held by Henry II and Richard the Lionheart in the 12th century and later became a favorite residence of Charles VII of France. It was in the great hall of the castle that Joan of Arc convinced Charles that he should be crowned at Reims. While older sections of the château now lie in ruins, the 16th-century royal lodgings have been fully restored.\n\n3. Chateau de Saumur [SEE MAP]\n\nStanding tall on a fortified hill overlooking the city and river below, the Château de Saumur is one of the most beautiful of the castles situated along France’s longest river, the Loire. With its octagonal corner towers and mullion windows, the château looks as if it’s been lifted out of a fairytale, making it an ideal destination for families. Originally built as a fortress in the 10th century, the château achieved its light and elegant look in the late 12th century when it was rebuilt by Henry II of England. Now owned by the town, the castle is home to several museums, including the family-friendly Musée de la Figurine-Jouet, which features a collection of antique figurines and toys.\n\n2. Palais des Papes [SEE MAP]\n\nLocated in Avignon in Southern France, the Palace of the Popes is considered one of the most important medieval structures in Europe. Construction of a convent began on the site in 1252, and in 1309, it became the seat of the Papacy when Rome rebelled against the election on Pope Clement V. The Palais remained the center of Western Christianity throughout the 14th century. Attracting around 650,000 visitors a year, the fortress is Europe’s biggest Gothic building and is one of France’s top ten tourist attractions. Tour highlights include 14th-century frescoes painted by Matteo Giovannetti and secret chambers hidden in the palace’s 3 meter (10 foot) thick walls.\n\n1. Cite de Carcassonne [SEE MAP]\n\nPerhaps more of a fortified town rather than a castle, the Cité de Carcassonne is one of the country’s oldest and most impressive fortifications. Due to its position on the historical routes across southern France the location has been occupied for more than 5,000 years. Sections of the citadel’s walls date back to the heyday of the Roman Empire, and Visigoths occupied the structure during the 5th century. The castle’s successive rulers continued to improve the fortress until the 17th century when it began to fall into decay. A 19th-century restoration project of the Cité turned Carcassonne into a popular tourist destination. Guided tours take visitors into the citadel’s innermost chambers."}, {"url": "https://www.britannica.com/technology/castle-architecture", "page_content": "castle, medieval stronghold, generally the residence of the king or lord of the territory in which it stands. Strongholds designed with the same functionality have been built throughout the world, including in Japan, India, and other countries. The word castle is sometimes applied to prehistoric earthworks, such as Maiden Castle in England, and is also applied, in various linguistic forms (e.g., château, castello, and Burg), to princely mansions or country seats.\n\nIn western Europe the castle developed rapidly from the 9th century. Fortifications built in France in the 10th century often included a high mound encircled by a ditch and surmounted by the leader’s particular stronghold, as in the castles at Blois and Saumur. Later, one or more baileys or wards (grounds between encircling walls) were enclosed at the foot of the mound. During the 11th century this type of private fortress, known as the “motte [mound] and bailey” castle, spread throughout western Europe.\n\nThe thickness of castle walls varied according to the natural strength of the sites they occupied, often diverging greatly at different points of the site. The defense of the enceinte, or outer wall, of the castle was generally by means of one or more lines of moats, which were crossed in front of the gateways by drawbridges—i.e., bridges that could be drawn back or raised from the inner side in order to prevent the moats from being crossed. The gateway was often protected by a barbican—a walled outwork in front of the gate—and the passage through the gateway was defended by portcullises, doors, and machicolations. Portcullises were generally made of oak, were plated and shod with iron, and were moved up and down in stone grooves, clearing or blocking the passage. Machicolations were of two kinds: some were openings in the roof of the passage through which missiles were thrown on encroaching enemies, and others were openings between the corbels of the parapets of walls and gates through which lethal missiles could be shot or dropped on the enemy below.\n\nThe baileys at the foot of the mound were enclosed by palisades and later by walls and towers of masonry. Almost at the same time that the shell keep was being erected in western Europe, the rectangular keep, a more compact form of citadel, was also being built. Examples are the donjon at Loches, France (c. 1020), and the keep at Rochester, England (c. 1130).\n\nThe keep, or donjon, was the focal point of the castle, to which, in time of siege, the whole garrison retired when the outer works had fallen; it was therefore the strongest and most carefully fortified part of the defenses. It had a well, contained the private apartments, offices, and service rooms, and held all the appointments necessary to sustain a long siege. Often the keep stood in line with the outer line of defenses, so that while one side looked toward the bailey (or succession of baileys) commanding the operations of the defense there, the other side commanded the field and the approaches to the castle. The side of the keep exposed to the field also presented a line of escape.\n\nAfter the Third Crusade (1189–92) the site chosen for a new castle, where such choice was possible, was the summit of a precipitous hill, the citadel being backed against the cliff. The main defense was concentrated in the direction of approach, where there were often two or three lines of advance fortifications. The living quarters—with the hall, domestic offices, and chapel—were then built in the court of the inner bailey. The keep (often no longer the residence but still the last line of defense) was smaller than those built previously but was of more powerful design.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nDevelopment in the use of firearms was so rapid during the 15th and 16th centuries as to require a radical change in military architecture. French troops marched through Italy in 1494 and, with their guns, reduced castle after castle with astonishing rapidity. The age of the medieval castle came to an end, and the era of modern military fortification opened. The principle governing the design of the new forts constructed all over Europe was that the whole building should be concentrated in one compact block. Its low walls could then be defended all around by artillery, the guns being mounted on bastions and redans.\n\nAlthough the break with the past did not occur suddenly but extended over many years, there came to be from the time of the Renaissance a complete separation between military and domestic architecture, the former being a fort under military control of the monarch and the latter an unfortified palace, mansion, manor house, or hôtel. The notion of the castle held an enduring romantic appeal, and the castle-style royal residence remained a model for country houses of the wealthy in the 18th and 19th centuries."}, {"url": "https://www.beyond.fr/history/templars.html", "page_content": "Creation of the Templars\n\nThe order of the Knights Templars was created a few years after the Knights Hospitalers, in roughly the same place and for similar reasons. The Templars rose to higher glory and power, ended in a more spectacular fashion, and their remains were passed on to the Hospitalers.\n\nThe Templars were called the Knights of the Red Cross, with their symbol of a red cross on a white field. In 1128, when the Order was confirmed by Pope Honorius II, the Knights received the white vestment as a symbol of the purity of their life. In 1146 Pope Eugenius added \"the red cross with two bars\", so the many illustrations we see of the double-barred cross are no doubt appropriate.\n\nAlthough similar to the goals of the Hospitalers, French knights Godfrey de Saint Omer and Huguens des Payens (Hugh) created the Knights Templars specifically as a military order, with no pretensions of charity or aid to the sick. When the papal sanction for the order was given, at the Council of Troyes in 1128, Spartan rules were established similar to those of the Cistercian Monks.\n\nThe hierarchy of the order was the grand master, knights, chaplains and sergeants. Only the knights wore the white cloaks with the red cross.\n\nKnights Templars Warriors\n\nThe Templars gained a reputation as great warriors in battles defending the Holy Land. But Jerusalem fell to the Muslims in 1187, and the Templars retreated, first to Antioch, then to Acre (the port city of Akko). The Knights Templars were based in Acre for a century: in 1291, Acre fell to the Muslims, with Grand Master William de Beaujue dying in the battle. The surviving Templars were the last to leave, departing to Caesarea, and then to Cyprus.\n\nIn Cyprus, the Templars were based at Limmasol, but their headquarters were established in the Temple Monastery in Paris.\n\nKnights Templars as Bankers\n\nMembers joining the Knights Templars took oaths of poverty, and donated all their cash, valuables and property to the Order. Between these extensive \"gifts\", treasures from battles, and the the massive grants from the Pope, the Templars ammased a true fortune.\n\nThe Templars quite naturally developed an extensive banking system as a result of transporting money and treasures between Palestine and Europe, and from lending money to Spanish pilgrims travelling to the Holy Land.\n\nThe Templars' Downfall\n\nThe enormous wealth and power of the Knights Templars aroused both greed and envy. With their huge reserves of cash and their banking system, France's King Philip the Fair had gone to the Templars for loans to finance his wars. Beyond has read different accounts, some where the Templars refused Philip IV's request for money, and some where the King wanted to avoid repaying the loans he already had from them.\n\nThe First Friday the 13th\n\nOn Friday the 13th in the year 1307, the month of October [thanks, Jonathan Curtis], all of the Templars in France were rounded up and emprisoned - \"Friday the 13th\" has been an unlucky day since that event.\n\n\n\nAlleged Crimes and Real Punishments\n\nThe Templars were charged with Satanism and many other \"unnatural\" acts and practices. Many of the charges may have been complete fabrications, but some could have been distortions of secret rites of the Templars. There were torture-encouraged confessions in the style of the Spanish Inquisition, and many were found guilty for refusing to \"confess\".\n\nMany of the Templars in France were terminally punished, à la Joan of Arc, including the Grand Master, Jacques de Molay [graphic, left], who was burnt at the stake in 1314, near Paris' Notre Dame Cathedral.\n\n\n\nDisbanding the Order\n\nAt the beginning of the purge, Philip the Fair began coercing the Popes to excommunicate the Templars. He attempted to have Pope Boniface VIII kidnaped. The king was excommunicated, but Boniface died as a result of the kidnapping attempt. Pope Benedict XI lifted the excommunication of King Philip, but it was his successor, Pope Clement V, who finally went along with the King and, in 1312, had the Templars dsibanded worldwide. It was Pope Clement V who established the Popes in Avignon.\n\nThe now-ownerless wealth and property of the Templars was officially assigned to the Knights Hospitalers. But, in France, King Philip had confiscated all of the Templars possessions at the beginning, in 1307, and didn't pass on much of it to the Hospitalers. In England, King Edward II seized the Templars lands and possessions, including the Temple in London, and didn't pass on anything to the Hospitalers.\n\n\n\nBeyond the End\n\nFollowing the declared end of the Templars in 1312, the Order continued in secret, with Jean-Marc Larmenius the first Grand Master of the now-secret organization, and the Order continued with an uninterrupted line of Grand Masters. In 1705, a convention of Templars at Versailles elected Philip, Duke of Orleans, as Grand Master. This Philip (le Régent) became Regent of France in 1715. With a combined Regent and Grand Master, the Order of the Temple was renewed and legitimized as a Secular Military Order of Chivalry.\n\nFollowing the death of le Régent in December, 1723, Grand Masters continued, through the three Princes of Bourbon (until 1776), the Duke de Cosse Brissac (until his execution during the French Revolution in 1782), and Radix de Chevillon. In the early 19th century, the Order expanded, with over 20 Convents in France and Priories set up across Europe.\n\n\n\nLegacy and Remnants\n\nThe Templars brought back craft and custom from the East and left a legacy of fortresses and shrines. Their architecture is well noted for its skilled stonework, and their masonry expertise later helped Europeans build the great castles and churches of the Middle Ages.\n\nIn the Larzac region of the South of France (10-20 km south of Millau, 100 km NW of Montpellier) are five fortified Templars villages that still retain their defensive walls and medieval buildings.\n\n\n\nTemplars Sites Southeast France\n\nHere are some of the places in Provence and France where the Knights Templars were established:\n\nBiot - the Counts of Provence gave Biot to the Templars in 1209.\n\nCairanne - Templars ruled here, before passing it to the Hospitalers.\n\nLe Fugeret - the Templars cleared the land here for farming.\n\nGreoux-les-Bains - the Templars' castle dominates the town.\n\nLapalud - Co-ruled by the Templars until the 11th century.\n\nLorgues - the Templars Commanderie du Riou built here in 1156.\n\nRicherenches - the Templars first Commanderie here.\n\nSenez - once a Templars establishment in this tiny village.\n\nTrigance - Legends of a Templars treasure hidden in the castle.\n\nVacqueyras - Templars rule.\n\nElancourt - a Templars Commanderie here, between Maurepas and Trapes\n\nIn the Alpes-Maritimes, the Templars were installed in the old Roman emplacements, including Vence, Broc, Gattières, La Gaude, Tourrettes-sur-Loup and Saint-Laurent-de-Var, northwest of Nice.\n\nThe Vence location was Templars Commanderie at Saint-Martin-de-Vence, just north of the town. (Today the site is a classy hotel-restaurant). The Commandeur of Saint-Martin-de-Vence was arrested at 5 on Friday 13 October 1307 by the vigan of Saint Paul. There's a legend that Saint-Martin-de-Vence contains a lost treasure of the Templars, and the German chancellor Adenauer was a frequent visitor searching for the treasure.\n\nSaint-Martin-de-Vence controlled the route north of Vence, and was itself protected by the camp at the top of the Baou des Blancs, the tall cliff overlooking the town. The Baou des Blancs was an oval wall at the top of the cliff, re-occupied by the \"Pénitents Blancs\" (hence the name of the baou) and then fortified by the Templars.\n\nThe La Gaude site was the old Castro de Gauda, also called \"Puget Treize Dames\", and more recently the great Templar Chateau de La Gaude. La Gaude, between Saint Jeannet and Gattières, was at a strategic location overlooking the Var and controlling an important route to the sea. At the fall of the Templars, it became the property of the Villeneuves.\n\n"}, {"url": "https://www.britannica.com/place/France/The-church", "page_content": "The church of France\n\nThe episcopate and the diocese were practically the only institutions to survive the collapse of Roman imperial power largely unchanged. Many bishops played important roles in defending the population during the German conquest. During the Frankish era, bishops and abbots occupied a socially prominent position because of both their great prestige among the people and their landed wealth.\n\nInstitutions The organization of the secular church took its final form under the Merovingian and Carolingian kings. The administrative bodies and the hierarchy of the early Christian church were derived from institutions existing during the late Roman Empire. In principle, a bishop was responsible for the clergy and faithful in each district (civitas). The bishop whose seat was in the metropolitan city had preeminence and was archbishop over the other bishops in his archdiocese. The monarchy dominated the church. Kings most often appointed bishops from among their followers without regard for religious qualifications; the metropolitan see was often fragmented in the course of territorial partitions and tended to lose its importance, and the church in Francia increasingly withdrew from papal control despite papal attempts to reestablish ties. The first Carolingians reestablished the ecclesiastical hierarchy. They restored the authority of the archbishops and established cathedral chapters so that the clergy living around a bishop were drawn into a communal life. They also maintained the right to nominate bishops, whom they considered agents of the monarchy. During the 4th and 5th centuries success at converting the countryside made it necessary for the bishops to divide the dioceses into parish churches. Initially there was a limit of between 15 and 40 of these per diocese. In the Carolingian era they were replaced by small parish churches better suited to the conditions of rural life.\n\nMonasticism Monasticism originated in the East. It was introduced in the West during the 4th century and was developed in Gaul, mainly in the west (St. Martin of Tours) and southeast (St. Honoratus and St. John Cassian). In the 6th century the number of monasteries throughout Gaul increased, as did the number of rules regulating them. Introduced by St. Columban (c. 543–615), Irish monasticism was influential in the 7th century, but it was later superseded by the Benedictine rule, which originated in Italy. The monasteries suffered from the upheavals affecting the church in the 8th century, and the Carolingians attempted to reform them. Louis the Pious, acting on the advice of St. Benedict of Aniane, imposed the Benedictine rule, which became a characteristic feature of Western monasticism. The Carolingians, however, continued the practice of having lay abbots.\n\nEducation In the 6th century, especially in southern Gaul, the aristocracy and, consequently, the bishops drawn from it preserved an interest in traditional Classical culture. Beginning in the 7th century, the Columbanian monasteries insisted on the study of the Bible and the celebration of the liturgy. In the Carolingian era these innovations shared the focus of education with works of Classical antiquity.\n\nReligious discipline and piety Characteristic of the church in the 6th century were frequent councils to settle questions of doctrine and discipline. In time, however, the conciliar institution declined, leading to liturgical anarchy and a moral and intellectual crisis among the clergy. Charlemagne and Louis the Pious attempted to impose a uniform liturgy, inspired by the one used at Rome. They also took measures to raise the standard of education of both clerics and the faithful. The cults of saints and relics were an important part of religion during late antiquity and the Middle Ages. Relics, the remains of the holy dead, were thought to have miraculous powers that could convert pagans and cure the sick. Consequently, the great desire to obtain relics led to the commercial exchange and even theft of them. Rome, with its numerous catacombs filled with the remains of the earliest Christians, was one of the key centres of the relic trade. It also became the most prominent Western pilgrimage site at a time when pilgrimage, at first to local shrines and then to international ones, became increasingly important. The desire on the part of the faithful to be buried near relics changed funeral practices. Ancient cemeteries were abandoned, and burials in or near churches (burials ad sanctos) increased."}]}