{"Brian Hughes was born in Toronto, Ontario, Canada.": [{"url": "https://www.celebsagewiki.com/brian-hughes-musician", "page_content": "Age, Biography and Wiki\n\nBrian Hughes was born on 5 May, 1955 in Vegreville, Canada, is a Musician, composer, producer. Discover Brian Hughes's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 68 years old?\n\nPopular As N/A Occupation Musician, composer, producer Age 68 years old Zodiac Sign Taurus Born 5 May 1955 Birthday 5 May Birthplace Vegreville, Canada Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 5 May. He is a member of famous Musician with the age 68 years old group.\n\nBrian Hughes Height, Weight & Measurements\n\nAt 68 years old, Brian Hughes height not available right now. We will update Brian Hughes's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nBrian Hughes Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Brian Hughes worth at the age of 68 years old? Brian Hughes’s income source is mostly from being a successful Musician. He is from Canada. We have estimated Brian Hughes's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Musician\n\nBrian Hughes Social Network\n\nTimeline"}, {"url": "https://www.bac-lac.gc.ca/eng/discover/vital-statistics-births-marriages-deaths/births-marriages-deaths-recorded/Pages/search.aspx", "page_content": "Important notice This database only includes references from the collections described in The records. For information about where to search for other records, please see Other resources.\n\n​Enter one or more search terms. You don't need to fill in all the boxes.\n\n\n\nWildcard character: * (e.g. John* for Johns, Johnsen, Johnson, Johnston, etc.)"}, {"url": "https://www.eliteprospects.com/player/45586/brian-hughes", "page_content": "Edit Mode\n\nGo Premium to enter Edit Mode\n\nTake control of your EliteProspects profile! Sign up for EP Premium and verify your profile to access these benefits.\n\n- Ability to add additional data to your career profile: Videos, Images, Social Media, Referrals, Fitness Testing Results and much more!\n\n- Improve your search rank\n\n- Connect directly with players, coaches, teams, scouts and agents (optional)\n\n- Premium Design on your profile page (optional)\n\n- EP Contact Book listing of your profile (optional)\n\n- Verification Badge on your profile\n\nSign up for premium"}, {"url": "https://www.echovita.com/ca/obituaries/on/toronto/brian-hughes-11628537", "page_content": "Brian Hughes Obituary\n\nWe are sad to announce that on October 20, 2020 we had to say goodbye to Brian Hughes of Toronto, Ontario. Leave a sympathy message to the family in the guestbook on this memorial page of Brian Hughes to show support.\n\nHe is survived by : his wife Elizabeth (Patsy); his children, Margaret (Robert), John (Julie) and Marion (Patrick); his grandchildren, William (Gabriella), Ryan (Laura), Kathryn, Jennifer (Christopher), Marie (Sean), Andrew and Clare; his great grandchildren, Zoe and Charlie; and also Ireland.\n\nIn lieu of flowers, donations can be made to the Heart & Stroke Foundation."}, {"url": "https://biogossipy.com/brian-hughes/", "page_content": "Brian Hughes net worth, birthday, age, height, weight, wiki, fact 2020, 2021! In this article, we will discover how old is Brian Hughes? Who is Brian Hughes dating now & how much money does Brian Hughes have?\n\nSHORT PROFILE Father Not Available Mother Not Available Siblings Not Available Spouse Not Known Children(s) Not Available\n\nBrian Hughes Biography\n\nBrian Hughes is a famous Musician, who was born on May 5, 1955 in Canada. According to Astrologers, zodiac sign is Taurus.\n\nBrian Hughes (born 5 May 1955) is a Canadian guitarist whose work draws from smooth jazz and Latin music. Hughes also plays oud, bouzouki, and balalaika. For over twenty years, he has worked in the studio with singer songwriter Loreena McKennitt. He co produced many of her recordings and leads her touring band.\n\nHughes grew up in Alberta, Canada and studied at Grant MacEwan College (now MacEwan University) in Edmonton and the Banff School of Fine Arts with jazz guitarists Ed Bickert and Gene Bertoncini. In 1981 he moved temporarily to Los Angeles where he studied at the Guitar Institute with Pat Martino, Joe Diorio, and Robben Ford.\n\nEthnicity, religion & political views\n\nMany peoples want to know what is Brian Hughes ethnicity, nationality, Ancestry & Race? Let’s check it out! As per public resource, IMDb & Wikipedia, Brian Hughes’s ethnicity is Not Known. We will update Brian Hughes’s religion & political views in this article. Please check the article again after few days.\n\nIn 1987 Hughes moved to Toronto where he began working with harpist Loreena McKennitt. In 1991 he recorded Between Dusk…and Dreaming, his first album as a leader, for Justin Time Records, followed by Under One Sky the next year. He started his label, Sylvan House Music, which was distributed by Warner Music Canada and licensed to Higher Octave Music/EMI in the U.S. and abroad. He recorded three more albums (Straight to You, One 2 One, and Shakin’ Not Stirred) under this arrangement before releasing Along the Way with A440 Music Group in 2003. He returned to his Sylvan House Music imprint for the release of Live (2007), No Reservations (concert DVD, 2009), and Fast Train to a Quiet Place in 2011. He moved to Los Angeles in 2000. Many of his works can be heard on The Weather Channel’s Local on the 8’s and on Sirius XM’s Watercolors channel.\n\nBrian Hughes Net Worth\n\nBrian Hughes is one of the richest Musician & listed on most popular Musician. According to our analysis, Wikipedia, Forbes & Business Insider, Brian Hughes net worth is approximately $1.5 Million.\n\nBrian Hughes Net Worth & Salary Net Worth $1.5 Million Salary Under Review Source of Income Musician Cars Not Available House Living in own house.\n\nIn 1987 Hughes moved to Toronto where he began working with harpist Loreena McKennitt. In 1991 he recorded Between Dusk…and Dreaming, his first album as a leader, for Justin Time Records, followed by Under One Sky the next year. He started his label, Sylvan House Music, which was distributed by Warner Music Canada and licensed to Higher Octave Music/EMI in the U.S. and abroad. He recorded three more albums (Straight to You, One 2 One, and Shakin’ Not Stirred) under this arrangement before releasing Along the Way with A440 Music Group in 2003. He returned to his Sylvan House Music imprint for the release of Live (2007), No Reservations (concert DVD, 2009), and Fast Train to a Quiet Place in 2011. He moved to Los Angeles in 2000. Many of his works can be heard on The Weather Channel’s Local on the 8’s and on Sirius XM’s Watercolors channel.\n\nHughes received the Society of Canadian Authors and Composers (SOCAN) Jazz and Instrumental Composer of the Year award from 1997–2001 and in 2006 and 2008. He was nominated for a Juno Award as Producer of the Year in 1991 for Loreena McKennitt’s album The Visit.\n\nBrian Hughes Height\n\nBrian Hughes’s height Not available right now. weight Not Known & body measurements will update soon.\n\nBrian Hughes Height & Body Stats Height Unknown Weight Not Known Body Measurements Under Review Eye Color Not Available Hair Color Not Available Feet/Shoe Size Not Available\n\nWho is Brian Hughes dating?\n\nAccording to our records, Brian Hughes is possibily single & has not been previously engaged. As of June 2021, Brian Hughes’s is not dating anyone.\n\nRelationships Record: We have no records of past relationships for Brian Hughes. You may help us to build the dating records for Brian Hughes!\n\nFacts & Trivia\n\nRanked on the list of most popular Musician. Also ranked in the elit list of famous celebrity born in Canada. Brian Hughes celebrates birthday on May 5 of every year.\n\n[X] .AFB_P { width: 320px; height: 100px; } @media(min width: 350px) { .AFB_P { width: 300px; height: 250px; } } @media(min width: 500px) { .AFB_P { width: 336px; height: 280px; } } You may read full biography about Brian Hughes from Wikipedia."}, {"url": "https://canadianobituaries.com/toronto/134740-brian-hughes-october-20-2020.html", "page_content": "HUGHES, Brian Hughes\n\nHUGHES, Brian - Born in Castleblayney, Co. Monaghan Ireland on February 17, 1936 and passed away peacefully at home in Toronto on October 20, 2020.\n\nBeloved husband of Elizabeth (Patsy).\n\nLoving father of Margaret (Robert), John (Julie) and Marion (Patrick).\n\nProud grandfather of William (Gabriella), Ryan (Laura), Kathryn, Jennifer (Christopher), Marie (Sean), Andrew, Clare and great grandfather of Zoe and Charlie.\n\nWill be greatly missed by his siblings and extended family in Canada, Ireland and the United Kingdom.\n\nBrian was a longtime member of the Iron Workers Union Local 721 and The Royal Canadian Legion.\n\nVisitation (RESPECTING COVID RESTRICTIONS) will be held at the Paul O’Connor Funeral Home, 1939 Lawrence Avenue East, (just west of Warden Ave.), Scarborough on Sunday, October 25th from 2-5 p.m. Funeral Mass will be held at St. Lawrence the Martyr Church 2210 Lawrence Avenue East on Monday, October 26th at 12:30 p.m. Private Family Interment to follow.\n\nIn lieu of flowers, donations can be made to the Heart & Stroke Foundation.\n\nTorontoObituaries.com\n\n{fastsocialshare"}, {"url": "https://www.echovita.com/ca/obituaries/on/mount-albert/brian-hughes-13990567", "page_content": "Brian Hughes Obituary\n\nIt is with deep sorrow that we announce the death of Brian Hughes (Mount Albert, Ontario), who passed away on January 9, 2022, leaving to mourn family and friends. You can send your sympathy in the guestbook provided and share it with the family.\n\nHe was predeceased by : his parents, Orville Hughes and Jean Hughes; and his brother Jim Hughes. He is survived by : his wife Cathy; his daughters, Tiffany Beeston (Dan) and Kristen Marven (Scott); his grandchildren, Evan, Ella, Emily, Isla, Lily and Allie; and his sisters, Marjorie Jean Hughes (Chris Graham) and Edie Barley (Phil). He is also survived by his family and friends.\n\nIn Brian's memory, donations may be made to the Gord Downie Fund for Brain Cancer Research https://donate.sunnybrook.ca or Matthew's House Hospice https://www.matthewshousehospice.ca ."}, {"url": "https://www.eliteprospects.com/player/45586/brian-hughes", "page_content": "Edit Mode\n\nGo Premium to enter Edit Mode\n\nTake control of your EliteProspects profile! Sign up for EP Premium and verify your profile to access these benefits.\n\n- Ability to add additional data to your career profile: Videos, Images, Social Media, Referrals, Fitness Testing Results and much more!\n\n- Improve your search rank\n\n- Connect directly with players, coaches, teams, scouts and agents (optional)\n\n- Premium Design on your profile page (optional)\n\n- EP Contact Book listing of your profile (optional)\n\n- Verification Badge on your profile\n\nSign up for premium"}, {"url": "https://www.celebsagewiki.com/brian-hughes-musician", "page_content": "Age, Biography and Wiki\n\nBrian Hughes was born on 5 May, 1955 in Vegreville, Canada, is a Musician, composer, producer. Discover Brian Hughes's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 68 years old?\n\nPopular As N/A Occupation Musician, composer, producer Age 68 years old Zodiac Sign Taurus Born 5 May 1955 Birthday 5 May Birthplace Vegreville, Canada Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 5 May. He is a member of famous Musician with the age 68 years old group.\n\nBrian Hughes Height, Weight & Measurements\n\nAt 68 years old, Brian Hughes height not available right now. We will update Brian Hughes's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nBrian Hughes Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Brian Hughes worth at the age of 68 years old? Brian Hughes’s income source is mostly from being a successful Musician. He is from Canada. We have estimated Brian Hughes's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Musician\n\nBrian Hughes Social Network\n\nTimeline"}, {"url": "https://www.letssingit.com/brian-hughes-mcb73", "page_content": "Artist info:\n\nAlso known as\n\nVerified yes\n\nGenre Jazz, Rap\n\nAlbums 11\n\nSongs 10"}]}