{"Kenny Rankin is a music artist.": [{"url": "https://www.laphil.com/musicdb/artists/4390/kenny-rankin", "page_content": "About this Artist\n\nIn a remarkable recording career that spans three and a half decades, KENNY RANKIN has established an impressive set of creative credentials, as an insightful songwriter, a distinctive guitarist and, above all, a world-class singer possessing an uncanny ability to cut straight to a song's emotional heart.\n\nWhile his supple, pristine tenor has earned him status as a singer's singer, Rankin's songwriting talents have been widely recognized by his peers. For example, his \"In the Name of Love\" inspired a memorable version by Peggy Lee, while his \"Haven't We Met\" has been cut by a number of jazz and pop artists including Carmen McRae and Mel Torme. Other Rankin compositions have been covered by a diverse assortment of artists.\n\nGrowing up in the multicultural hotbed of New York's Washington Heights neighborhood, he absorbed a broad array of musical influences, from AfroCuban to Top 40 to Jazz to Brazilian. But he traces his emergence as a performer to a specific childhood epiphany. \"I was in the fourth grade and sang 'O Holy Night' in a Christmas play,\" he recalls. \"My teacher, Miss Isabel Pringle, came over to me and patted me on the head and said 'Kenneth, that was lovely.' She set me on the path in music that I find myself on today.\"\n\nAs a teenager, the budding artist signed with Decca Records and released a handful of singles. A few years later, he signed with Columbia Records, and found himself playing guitar on Bob Dylan's landmark 1965 album Bringing It All Back Home. Not long after, he performed on The Tonight Show, whose host Johnny Carson became such a fan that Kenny was ultimately invited to appear on the show more than 20 times. Carson even contributed liner notes to Rankin's 1967 debut LP Mind Dusters, which introduced his much-covered pop standard \"Peaceful.\" That album's mix of original tunes and outside material would continue to yield rewarding results on such subsequent releases as Family, Like a Seed, and Inside.\n\nRankin's 1975 album Silver Morning featured a popular reworking of The Beatles' \"Blackbird\" that so impressed Paul McCartney that he asked Rankin to represent himself and John Lennon when they were inducted into the Songwriters Hall Of Fame. 1976's much-acclaimed The Kenny Rankin Album was recorded live in the studio, and teamed the singer with a 60-piece orchestra arranged and conducted by the legendary Don Costa to create what many now consider the first contemporary \"torch\" album; Rankin and Costa continued their collaboration on 1980's After the Roses.\n\nThrough much of the 1980s, Rankin largely concentrated on the live stage, increasingly emphasizing pop and jazz standards using jazz accompaniment. He ended a long break from recording in 1995 with a pair of albums: Professional Dreamer, a collection of standards, and the Brazilian-flavored Here In My Heart, both for the Private Music label.\n\nHowever one may attempt to pigeonhole Kenny Rankin-as jazz vocalist, pop artist or introspective singer/songwriter-the openhearted emotional forthrightness of his singing renders such classifications irrelevant. \"My interpretation of the songs is purely emotional,\" he explains. \"We've all experienced disappointment and heartache, and that's what I draw upon. When I sing 'A Song for You' and 'Where Do You Start?' or 'She Was Too Good to Me,' I'm really hurting for the people in the song. I never change lyrics, because when I select a song it's usually because of how the lyric impacts me. I've been accused of straying from the melody, but when I sing I'm feeling, not thinking.\"\n\n\"When I started, I was very young and felt like I was the center of the universe. But over the years I've come to understand that it's not about me, it's about the work, and about having the opportunity to do good work. If you do anything for any length of time, it's inevitable that you're gonna have ups and downs.\n\nYou make mistakes, but you learn from that. \"I just feel privileged that I've been allowed to continue in my craft, and I've been encouraged by all the positive feedback I've gotten from people over the years,\" he concludes. \"When someone tells you a song changed their life, or inspired them to look at things in a slightly different way, well, you can't ask for a better reward than that.\"\n\nMiss Pringle would be proud."}, {"url": "https://www.allaboutjazz.com/musicians/kenny-rankin", "page_content": "In a remarkable recording career that spans three and a half decades, Kenny Rankin has established an impressive set of creative credentials, as an insightful songwriter, a distinctive guitarist and, above all, a world-class singer possessing an uncanny ability to cut straight to a song's emotional heart.\n\nWhile his supple, pristine tenor has earned him status as a singer's singer, Rankin's songwriting talents have been widely recognized by his peers. For example, his \"In the Name of Love\" inspired a memorable version by Peggy Lee, while his \"Haven't We Met\" has been cut by a number of jazz and pop artists including Carmen McRae and Mel Torme. Other Rankin compositions have been covered by a diverse assortment of artists.\n\nGrowing up in the multicultural hotbed of New York's Washington Heights neighborhood, he absorbed a broad array of musical influences, from AfroCuban to Top 40 to Jazz to Brazilian. But he traces his emergence as a performer to a specific childhood epiphany. \"I was in the fourth grade and sang 'O Holy Night' in a Christmas play,\" he recalls. \"My teacher, Miss Isabel Pringle, came over to me and patted me on the head and said 'Kenneth, that was lovely.' She set me on the path in music that I find myself on today.\"\n\nAs a teenager, the budding artist signed with Decca Records and released a handful of singles. A few years later, he signed with Columbia Records, and found himself playing guitar on Bob Dylan's landmark 1965 album Bringing It All Back Home. Not long after, he performed on The Tonight Show, whose host Johnny Carson became such a fan that Kenny was ultimately invited to appear on the show more than 20 times. Carson even contributed liner notes to Rankin's 1967 debut LP Mind Dusters, which introduced his much-covered pop standard \"Peaceful.\" That album's mix of original tunes and outside material would continue to yield rewarding results on such subsequent releases as Family, Like a Seed, and Inside.\n\nRankin's 1975 album Silver Morning featured a popular reworking of The Beatles' \"Blackbird\" that so impressed Paul McCartney that he asked Rankin to represent himself and John Lennon when they were inducted into the Songwriters Hall Of Fame. 1976's much-acclaimed The Kenny Rankin Album was recorded live in the studio, and teamed the singer with a 60-piece orchestra arranged and conducted by the legendary Don Costa to create what many now consider the first contemporary \"torch\" album; Rankin and Costa continued their collaboration on 1980's After the Roses."}, {"url": "https://simple.wikipedia.org/wiki/Kenny_Rankin", "page_content": "Kenny Rankin (February 10, 1940 - June 7, 2009) was an American pop and jazz singer and songwriter. He was originally from the Washington Heights neighborhood of New York City, New York.\n\nRankin was raised in New York and was introduced to music by his mother, who sang at home and for friends. The area of Washington Heights, Manhattan was becoming heavily Latino during his youth, and exposure to street music may have played a part. He began recording at age 17 (1957), eventually working as a songwriter contracted to Columbia Records. Rankin's earliest composition, \"My Carousel\" was written for Carmen McRae, followed by \"A Happy Guy\" for teen idol Rick Nelson. He had already developed a serious amphetamine problem by that time.\n\nHe taught himself classical guitar, at age 24, inspired by the playing of Don Costa, who had started on that instrument before becoming one of the most important arrangers in popular music. He played rhythm guitar on some tracks on Bob Dylan's album Bringing It All Back Home (1965). Rankin developed a considerable following during the 1970s with a steady flow of albums, three of which broke into the Top 100 of the Billboard Album Chart. His liking for jazz was evident from an early age, but the times were such that in order to survive his career had to take a more pop-oriented course, and he cited singer-songwriter Laura Nyro consistently as a major influence.\n\nRankin appeared on The Tonight Show with Johnny Carson more than twenty times. Carson was so impressed by him that he wrote the liner notes to Rankin's 1967 debut album Mind Dusters, which featured the single \"Peaceful.\" Rankin's friend Helen Reddy would reach #2 Adult Contemporary and #12 Pop in 1973 with a cover of it, released as her follow-up single to \"I Am Woman\". Georgie Fame also had a hit with this song in 1969, his only songwriting credit to hit the British charts reaching number sixteen and spending 9 weeks on the chart.\n\nRankin's original song \"In the Name of Love\" frequently featured wordless improvisational singing and showed his range and command of articulating lyrics at a blistering waltz tempo, but performed more slowly it had a distinctly Brazilian flavor. Similar to later singer Mandy Patinkin, Rankin's speaking voice was a rich baritone, but his tessitura was an octave higher, with an occasional start at near his speaking timbre, as in \"What Matters Most.\" The timbre of his singing voice most frequently resembled that of a clarinet. His remarkably quick mastery of the guitar allowed him to appear, along with Randy Newman and Joni Mitchell, as one of the few self-sufficient solo acts conveying original material with harmonic richness beyond that of folk and early rock music.\n\nHe was extremely private in his early televised interviews, once stating that personal information distracted from musical performance, and thus even his date of birth was considered anecdotal information. Later, he became more open and stated in interviews that in the 1960s and 1970s he had suffered from serious addictions which affected his career, and he credited his family, and a period of spiritual study while undergoing rehabilitation sessions, for helping him to overcome his drug and alcohol problems by the early 1980s. Some recorded songs on the Little David record label (a subsidiary of Atlantic Records) featured his wife Yvonne and his daughters singing background, as the Rankin Family Band. His album Family featured cover art of Rankin holding his two young daughters. The Rankins also had a son.\n\nOccasionally criticised for poor choice of material, considering his talents, by the 1990s, he was able to angle his repertoire to accommodate his own musical preferences and to please a new audience while still keeping faith with the faithful. Rankin's warm singing style and his soft, nylon-stringed guitar sound might suggest an artist more attuned to the supper-club circuit than the jazz arena, but his work contains many touches that appeal to the jazz audience, especially as he introduced more \"standards\" from the 1930s and 1940s into his performances. Reviews in the periodical Down Beat and later print media increasingly reinforced his jazz credentials.\n\nRankin's song \"Haven't We Met\" was performed by Mel Tormé and Carmen McRae, while Stan Getz said of him that he was \"a horn with a heartbeat\". Rankin's accompanists have from time to time included pianists Alan Broadbent, Mike Wofford and trombonist Bill Watrous, and on such occasions the mood slips easily into a jazz groove. But Don Costa's full orchestral arrangements were used to back his voice to critical acclaim, following a trend in the wake of Harry Nilsson with Gordon Jenkins and Linda Ronstadt with Nelson Riddle, to emulate the lush soundscape that some say reached its apogee with Frank Sinatra's Capitol recordings. Rankin was also deeply interested in Brazilian music and his Here In My Heart, on which he used jazz guests including Michael Brecker and Ernie Watts, was recorded mostly in Rio de Janeiro. More contemporary songs were given an airing following his move to Verve Records, including the Beatles' \"I've Just Seen A Face\" and Leon Russell's \"A Song For You.\"\n\nRankin's own unique gift for reworking classic songs such as The Beatles' \"Blackbird,\" which he recorded for his Silver Morning album, so impressed Paul McCartney that he asked Rankin to perform his interpretation of the song when McCartney and John Lennon were inducted into the Songwriters Hall of Fame.\n\nRankin was diagnosed with terminal lung cancer in May 2009. He died in Los Angeles, California - where he had resided for many years - from the disease on June 7, 2009. He was 69 years old.\n\nStudio albums [ change | change source ]\n\nMind-Dusters (1967)\n\n(1967) Family (1970)\n\n(1970) Like a Seed (1972)\n\n(1972) Inside (1975)\n\n(1975) Silver Morning (1975)\n\n(1975) The Kenny Rankin Album (1976)\n\n(1976) After the Roses (1980)\n\n(1980) Hiding in Myself (1990)\n\n(1990) Because of You (1991)\n\n(1991) Professional Dreamer (1994)\n\n(1994) Here in My Heart (1997)\n\n(1997) A Christmas Album (1999)\n\n(1999) A Song for You (2002)\n\nPeaceful: The Best of Kenny Rankin (1996)\n\nYanow, Scott, The Jazz Singers: The Ultimate Guide, Backbeat Books, 2008.\n\nKort, Michael, Soul Picnic: The Music and Passion of Laura Nyro, Thomas Dunne Books / St. Martin's Press, 2002."}, {"url": "https://www.latimes.com/local/obituaries/la-me-kenny-rankin9-2009jun09-story.html", "page_content": "Kenny Rankin, a singer-songwriter and musician whose song “Peaceful” was a hit for Helen Reddy and who had popular covers himself of a pair of Beatles hits, has died. He was 69.\n\nRankin died Sunday at Cedars-Sinai Medical Center in Los Angeles. The cause of death, according to his management company, was lung cancer, which was diagnosed three weeks ago.\n\nHis career, which spanned more than five decades, almost defied categorization. A well-regarded guitarist, he played in Bob Dylan’s backup band on the influential 1965 album “Bringing It All Back Home.” He also spent several years on the road opening for comedian George Carlin.\n\nAdvertisement\n\nRankin appeared on “The Tonight Show” with Johnny Carson more than 25 times. Carson was such a fan that he wrote the liner notes for Rankin’s 1967 debut LP, “Mind Dusters.”\n\nAs a singer with a velveteen tenor voice, he had highly successful covers of the Beatles’ “Blackbird” and “Penny Lane” in the mid-1970s and in 1976 recorded an LP of standards, “The Kenny Rankin Album,” with a large orchestra conducted by Don Costa.\n\nIn a review of a 2000 Rankin performance at a San Fernando Valley jazz club, critic Don Heckman wrote in The Times: “Rankin has been -- for a decade or more -- a singer whose unusual improvisational skills and innate capacity to deliver a melody with a strong sense of swing stamp him as a consistently appealing jazz artist.”\n\nIn addition to Reddy’s version of “Peaceful,” jazz singers Carmen McRae and Mel Torme recorded versions of Rankin’s and Ruth Batchelor’s “Haven’t We Met.”\n\nRankin was born Feb. 10, 1940, and grew up in the Washington Heights section of New York City. He was signed to Decca Records as a teenager and released a few singles. He later signed with Columbia Records.\n\nOne of his major influences was Laura Nyro, the late songwriter who wrote “Wedding Bell Blues” and “Stoned Soul Picnic,” whom he met in Greenwich Village in 1960.\n\n“She profoundly changed my musical life and affected it to this day, more than anyone or anything else,” Rankin told the Globe and Mail newspaper in Toronto in 2007. “She was deep, dark and light, the spectrum of passion.”\n\nHis peak recording years were in the 1970s, when he released the LPs “Silver Morning,” “Inside” and “The Kenny Rankin Album.”\n\nPaul McCartney was so pleased with Rankin’s covers of the Beatles hits, he asked him to sing a medley of them when McCartney was inducted into the Songwriters Hall of Fame in 1987.\n\nRankin is survived by his son, Chris; daughters Gena and Chanda; and a granddaughter.\n\nA memorial service is being planned in Los Angeles.\n\njon.thurber@latimes.com"}, {"url": "https://www.nytimes.com/2009/06/09/arts/music/09rankin.html", "page_content": "Kenny Rankin, a singer, songwriter and guitarist whose easygoing style straddled the worlds of pop, jazz and folk, died on Sunday in Los Angeles. He was 69 and lived in Los Angeles.\n\nThe cause was complications of lung cancer, his family said.\n\nSinging in a soft, lilting voice and accompanying himself on acoustic guitar, Mr. Rankin was often categorized as an introspective singer-songwriter in the James Taylor mold. But he drew inspiration from a wide range of sources: the Brazilian singer João Gilberto was an acknowledged influence, as were Frank Sinatra and Johnny Mathis. And though he wrote a number of memorable songs \u0097 his “Peaceful” was a Top 20 hit for Helen Reddy in 1973, and other songs of his were recorded by the likes of Peggy Lee and Mel Tormé \u0097 he was best known as an interpreter of other people’s.\n\nMr. Rankin’s albums tended to include a handful of original compositions but consisted mostly of his own distinctly laid-back, gently swinging spin on the Beatles, Bob Dylan and others. In recent years he devoted increasing attention to Cole Porter, Rodgers and Hart and other songwriters of an earlier era.\n\nMr. Rankin was particularly partial to the Beatles. He recorded a number of their songs, including “Blackbird,” “With a Little Help From My Friends” and “While My Guitar Gently Weeps.” When John Lennon and Paul McCartney were inducted into the Songwriters Hall of Fame in 1987, Mr. McCartney asked Mr. Rankin to represent them at the induction ceremony."}, {"url": "https://www.billboard.com/music/music-news/kenny-rankin-dies-at-69-268431/", "page_content": "Kenny Rankin, a brilliant pop vocalist and highly regarded musician-songwriter whose stylings ranged from jazz to pop to the world music influences he picked up as a child in New York, has died of complications related to lung cancer, his record company announced Monday. He was 69.\n\nRankin died Sunday at Cedars-Sinai Medical Center, Mack Avenue Records spokesman Don Lucoff said.\n\nThe musician, who first gained acclaim as one of the guitarists on Bob Dylan’s landmark 1965 album, “Bringing it all Back Home,” had been preparing to record an album of new material when he became ill a few weeks ago. Recording sessions scheduled with producer Phil Ramone were canceled as his health began to deteriorate.\n\n“That he was still at the top of his game is one of the saddest parts of his passing for me,” Denny Stilwell, president of Mack Avenue Records, said in a statement. “He performed the new material in our office over the last few months and his voice was still in its finest form — he sounded absolutely amazing. Our hearts and prayers are with his family.”\n\nRankin wrote and recorded the pop standard “Peaceful” and also wrote “In The Name of Love,” which was recorded by Peggy Lee, and “Haven’t We Met,” performed by Carmen McRae and Mel Torme.\n\nHis own “The Kenny Rankin Album” was recorded live in 1976 with a 60-piece orchestra.\n\nRankin, who signed with Decca Records while still in his teens, once said his music career really began in the fourth grade when he sang “O Holy Night” in a school Christmas play and his teacher walked up to him afterward, patted him on the head and said, “Kenneth, that was lovely.”\n\n“She set me on the path in music that I find myself on today,” he said.\n\nAfter signing with Decca in the late 1950s he released a handful of singles before moving on to Columbia Records, also the home of Dylan. There, he took part in the recording of “Bringing it All Back Home,” the album in which Dylan moved firmly from an all-acoustic folk music sound to an electric mixture of pop and rock ‘n’ roll.\n\nSoon after, he made his first appearance on “The Tonight Show,” where he impressed host Johnny Carson so much that Carson contributed liner notes to Rankin’s first album, 1967’s “Mind Dusters.” Other albums included “Family,” “Like a Seed” and “Inside.”\n\nHe would go on to appear as Carson’s “Tonight Show” guest more than 20 times.\n\nRankin’s supple tenor voice on such recordings as “Spanish Harlem,” “‘Round Midnight” and a cover of the Beatles’ “Blackbird” also won him the respect of fellow musicians as a singer’s singer.\n\nMack Records said he so impressed the Beatles’ Paul McCartney that McCartney asked him to perform “Blackbird” when he and songwriting partner John Lennon were inducted into the Songwriters Hall Of Fame.\n\nCopyright 2009 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"url": "https://www.latimes.com/archives/la-xpm-2009-jun-09-me-kenny-rankin9-story.html", "page_content": "Kenny Rankin, a singer-songwriter and musician whose song “Peaceful” was a hit for Helen Reddy and who had popular covers himself of a pair of Beatles hits, has died. He was 69.\n\nRankin died Sunday at Cedars-Sinai Medical Center in Los Angeles. The cause of death, according to his management company, was lung cancer, which was diagnosed three weeks ago.\n\nHis career, which spanned more than five decades, almost defied categorization. A well-regarded guitarist, he played in Bob Dylan’s backup band on the influential 1965 album “Bringing It All Back Home.” He also spent several years on the road opening for comedian George Carlin.\n\nAdvertisement\n\nRankin appeared on “The Tonight Show” with Johnny Carson more than 25 times. Carson was such a fan that he wrote the liner notes for Rankin’s 1967 debut LP, “Mind Dusters.”\n\nAs a singer with a velveteen tenor voice, he had highly successful covers of the Beatles’ “Blackbird” and “Penny Lane” in the mid-1970s and in 1976 recorded an LP of standards, “The Kenny Rankin Album,” with a large orchestra conducted by Don Costa.\n\nIn a review of a 2000 Rankin performance at a San Fernando Valley jazz club, critic Don Heckman wrote in The Times: “Rankin has been -- for a decade or more -- a singer whose unusual improvisational skills and innate capacity to deliver a melody with a strong sense of swing stamp him as a consistently appealing jazz artist.”\n\nIn addition to Reddy’s version of “Peaceful,” jazz singers Carmen McRae and Mel Torme recorded versions of Rankin’s and Ruth Batchelor’s “Haven’t We Met.”\n\nRankin was born Feb. 10, 1940, and grew up in the Washington Heights section of New York City. He was signed to Decca Records as a teenager and released a few singles. He later signed with Columbia Records.\n\nOne of his major influences was Laura Nyro, the late songwriter who wrote “Wedding Bell Blues” and “Stoned Soul Picnic,” whom he met in Greenwich Village in 1960.\n\n“She profoundly changed my musical life and affected it to this day, more than anyone or anything else,” Rankin told the Globe and Mail newspaper in Toronto in 2007. “She was deep, dark and light, the spectrum of passion.”\n\nHis peak recording years were in the 1970s, when he released the LPs “Silver Morning,” “Inside” and “The Kenny Rankin Album.”\n\nPaul McCartney was so pleased with Rankin’s covers of the Beatles hits, he asked him to sing a medley of them when McCartney was inducted into the Songwriters Hall of Fame in 1987.\n\nRankin is survived by his son, Chris; daughters Gena and Chanda; and a granddaughter.\n\nA memorial service is being planned in Los Angeles.\n\n--\n\njon.thurber@latimes.com"}, {"url": "https://www.theford.com/musicdb/artists/4390/kenny-rankin", "page_content": "About this Artist\n\nIn a remarkable recording career that spans three and a half decades, KENNY RANKIN has established an impressive set of creative credentials, as an insightful songwriter, a distinctive guitarist and, above all, a world-class singer possessing an uncanny ability to cut straight to a song's emotional heart.\n\nWhile his supple, pristine tenor has earned him status as a singer's singer, Rankin's songwriting talents have been widely recognized by his peers. For example, his \"In the Name of Love\" inspired a memorable version by Peggy Lee, while his \"Haven't We Met\" has been cut by a number of jazz and pop artists including Carmen McRae and Mel Torme. Other Rankin compositions have been covered by a diverse assortment of artists.\n\nGrowing up in the multicultural hotbed of New York's Washington Heights neighborhood, he absorbed a broad array of musical influences, from AfroCuban to Top 40 to Jazz to Brazilian. But he traces his emergence as a performer to a specific childhood epiphany. \"I was in the fourth grade and sang 'O Holy Night' in a Christmas play,\" he recalls. \"My teacher, Miss Isabel Pringle, came over to me and patted me on the head and said 'Kenneth, that was lovely.' She set me on the path in music that I find myself on today.\"\n\nAs a teenager, the budding artist signed with Decca Records and released a handful of singles. A few years later, he signed with Columbia Records, and found himself playing guitar on Bob Dylan's landmark 1965 album Bringing It All Back Home. Not long after, he performed on The Tonight Show, whose host Johnny Carson became such a fan that Kenny was ultimately invited to appear on the show more than 20 times. Carson even contributed liner notes to Rankin's 1967 debut LP Mind Dusters, which introduced his much-covered pop standard \"Peaceful.\" That album's mix of original tunes and outside material would continue to yield rewarding results on such subsequent releases as Family, Like a Seed, and Inside.\n\nRankin's 1975 album Silver Morning featured a popular reworking of The Beatles' \"Blackbird\" that so impressed Paul McCartney that he asked Rankin to represent himself and John Lennon when they were inducted into the Songwriters Hall Of Fame. 1976's much-acclaimed The Kenny Rankin Album was recorded live in the studio, and teamed the singer with a 60-piece orchestra arranged and conducted by the legendary Don Costa to create what many now consider the first contemporary \"torch\" album; Rankin and Costa continued their collaboration on 1980's After the Roses.\n\nThrough much of the 1980s, Rankin largely concentrated on the live stage, increasingly emphasizing pop and jazz standards using jazz accompaniment. He ended a long break from recording in 1995 with a pair of albums: Professional Dreamer, a collection of standards, and the Brazilian-flavored Here In My Heart, both for the Private Music label.\n\nHowever one may attempt to pigeonhole Kenny Rankin-as jazz vocalist, pop artist or introspective singer/songwriter-the openhearted emotional forthrightness of his singing renders such classifications irrelevant. \"My interpretation of the songs is purely emotional,\" he explains. \"We've all experienced disappointment and heartache, and that's what I draw upon. When I sing 'A Song for You' and 'Where Do You Start?' or 'She Was Too Good to Me,' I'm really hurting for the people in the song. I never change lyrics, because when I select a song it's usually because of how the lyric impacts me. I've been accused of straying from the melody, but when I sing I'm feeling, not thinking.\"\n\n\"When I started, I was very young and felt like I was the center of the universe. But over the years I've come to understand that it's not about me, it's about the work, and about having the opportunity to do good work. If you do anything for any length of time, it's inevitable that you're gonna have ups and downs.\n\nYou make mistakes, but you learn from that. \"I just feel privileged that I've been allowed to continue in my craft, and I've been encouraged by all the positive feedback I've gotten from people over the years,\" he concludes. \"When someone tells you a song changed their life, or inspired them to look at things in a slightly different way, well, you can't ask for a better reward than that.\"\n\nMiss Pringle would be proud."}], "Gino Vannelli is a music artist.": [{"url": "https://ginov.com/bio/", "page_content": "\n\nBorn in Montreal, Vannelli grew up in a family headed by his cabaret-singing father and a ‘keen-eared’ mother. Instinctively drawn to jazz, drummers in particular, such as Gene Krupa, Buddy Rich, Joe Morello, Ed Thigpen and Elvin Jones, as a child Vannelli studied drums and music theory for five years. Gino’s first foray into pop music came one afternoon as a group of young drummers stood in line, waiting to take turns to audition for a Montreal East group called the Cobras. The rite of passage involved playing a tune called “Wipeout” by the Ventures. Having never heard the song before, Gino made sure he waited to the very last, studying the parts every aspiring drummer played, or was trying to play. That afternoon, Gino came home a little later than usual from school, but as the official drummer for the Cobras. A year later, with his brother Joe holding down the keyboard chair, Vannelli headed up the Motown-influenced Jacksonville 5 (note, this is five years before the Jackson 5 recorded their first record). Along the way there were guitar and piano lessons. The urge to compose words and music followed not long after. At fourteen, Gino began his official singing career when the singer in the band fortuitously couldn’t make the high water mark in a then popular tune by a gritty Welshman, Tom Jones, called \"It’s Not Unusual\".\n\nTo add complication as well as interest to his musical affinities, Gino had fallen in love with classical music—French Impressionism, Italian Opera, and 20th century Russian composers in particular. Attending concerts given by the Montreal Symphony every last Thursday of the month for one semester, had proven to be life-changing (his 2000 release of Canto being testament). \"I seemed to have had a double standard, or at least torn between a few distinct sounds and styles,\" reflects Vannelli. \"I used to defend Charlie Watts and Ringo Starr, insisting they were part of something new and exciting to my purist, jazz-head friends. Yet, when I’d listen to Dave Brubeck’s Time Out, or Miles Davis’s Birth of the Cool, pop would suddenly plead no contest—well, at least for that moment. One Thursday afternoon at Place Des Arts, I remember hearing the Montreal Symphony playing “Daphne and Chloe” by Maurice Ravel. I walked away shaking my head, muttering to myself, ‘What was that!? I was so deeply moved—bewildered by the sounds I had just heard. It was the moment I discovered to what heights music could draw a man’s soul.\"\n\nBefore his seventeenth birthday, Vannelli had signed with RCA Records of Canada, releasing a single called “Gina Bold” under the pseudonym Van-Elli. Ambitious and now bitten by the music industry bug, Gino lived on and off in New York City, making the record company and publisher’s rounds, finally ending up at the foot of the gates of A&M Records in Hollywood three years later. Gino, accompanied by his brother Joe, and down to their last five-dollar bill, made one last ditch effort to get signed before having to trek back to Montreal. Early one morning, Gino headed out to the offices of A&M Records where he waited outside the gates for any sign of company co-owner Herb Alpert. As Alpert was walking through the parking lot hours later, Vannelli ran past the gates, racing by a startled and furious security guard. Before he could be accosted he begged a slightly apprehensive Alpert for a chance to audition. Acting on a hunch, (and much to the guard’s annoyance) Herb was sympathetic, telling the young hopeful to return later that afternoon. Gino proceeded to play songs on his acoustic guitar he had recently written, including “People Gotta Move,” “Crazy Life,” “Mama Coco,” “Powerful People” and “Lady”—songs that would end up on the six albums Vannelli would record for A&M between 1974 and 1978. That very day, Gino was welcomed as a new member of the A&M family.\n\nBillboard & Juno Awards, Gold & Platinum\n\nFive of those six albums made the top 100 Billboard album charts, culminating with Brother to Brother (co-produced by brothers Joe, and Ross) which achieved a coveted Top 10 position in the fall of 1978. “I Just Wanna Stop” made it to the 4th spot on the Billboard singles chart. Forever the impassioned artist, Vannelli’s A&M albums consisted of a range of material: from experimental synthesizer arrangements, live orchestral pieces, jazz inflected tunes, to contemporary R&B inspired songs. Having toured with Stevie Wonder, (which led to Gino’s notable appearance on Soul Train—a first for a white artist) Gino soon became a headlining artist, selling out concerts halls and arenas in Canada and the US by twenty-three years of age. Earning a handful of Grammy nominations, and numerous Juno Awards in his native Canada, Gino had arrived.\n\nIn 1980, Vannelli signed with Arista Records. His sole Arista album, Nightwalker, provided him with a top-ten pop hit, “Living Inside Myself.” When Vannelli opted to follow it up with a stripped-down, edgier album called Twisted Heart, for the first time in his career he found himself with a less than enthusiastic label, unwilling to release an album. For the next three years, in a move reminiscent to episodes in the careers of George Michael and Prince, Vannelli and his record company engaged in a long battle of creative wills—songs being the sum and substance of the contention. Vannelli comments \"There comes a day when an artist has to make a hard choice between two roads that lie ahead, knowing full well even the one he knows to be right will lead to a dark forest, leastways for the foreseeable future... comes a time when success must be measured by a different yardstick.”\n\nAfter a four-year hiatus, Vannelli had finally come through the dark forest and was released from his Arista contract and in 1985 he released the successful Black Cars album and landmark video in Europe. It soon became Vannelli’s most successful international work to that date. Two years later, he recorded Big Dreamers Never Sleep for CBS, whose single, \"Wild Horses,\" stormed its way to the Top 10 in several countries. A successful North American artist, through some strange twist of fate, had suddenly landed feet first on the world stage. To this day, he continues to have a large, international following, giving concerts from Chicago to Cape Town. By 1990, Vannelli had grown skeptical and weary of the music industry status quo, and the Hollywood mindset. After throwing himself headlong into the study of the humanities, a careful examination of world religions, philosophies, both Eastern and Western, he decided it was time to move his family north to Oregon. \"I decided to pull myself out of the mainstream,\" he explains, \"and roam the banks.\"\n\nSigning with Verve Records, both Vannelli’s commercial outlook and output took a radical swing with the largely acoustic-jazz albums Yonder Tree and Slow Love, released in 1995 and 1997 respectively. Vannelli notes, \"I had finally rounded some of my enduring and obsessive visions of the jazz-pop idiom in these two recordings. To his day I listen to those recordings with a sense of satisfaction, at least as much as the ongoing urge to move forward allows\".\n\nBy the end of the decade his muse was taking him still further afield, toward one of his earliest loves, classical music. Having just produced a CD, called Hitek Hiku for Danish jazz pianist Niels Landoky, Gino had included a song called “Parole Per Mio Padre” (A Word to My Father), dedicated to his late father, in the style and tradition of Schubert. It seemed good fortune caught up with Vannelli once more, as one day out of the clear blue, the Vatican called Gino personally, asking him to perform the song for Pope John Paul. Soon after the show had been televised in Europe, the head of BMG Records asked Vannelli to record a contemporary classical CD in the same mode as “Parole per Mio Padre”; thus the birth of what many say is one of Gino’s finest musical accomplishments, Canto, released by BMG in 2003. The CD features songs sung in English, Italian, Spanish and French. Singing music from Canto remains one of the highlights of Gino’s present-day live performances.\n\nIn 2005 Gino released These Are the Days under the Universal label. It was a compilation that combined seven of his earlier classic hits with seven new songs, marking the debut of yet another phase of Vannelli’s continually fascinating career and a return to the pop genre that made him an icon. In 2007, forever pursuing new sound images and poetic themes, Gino spent long periods in the Netherlands, taking in the culture, listening to Dutch musicians and forming new associations. It culminated in the 2009 release of a CD/poetry book entitled, A Good Thing. \"It began by doing nothing other than watching and listening, which eventually ended in the urge to lay my thoughts to poetry. By the time I got to fifty or so poems, the instinct to put music to the verse led to A Good Thing. New methods bring new music.\"\n\nIn late 2009, amidst a very busy touring schedule, Gino managed to find the time to re-record many of his better known songs for a CD entitled, The Best & Beyond. \"True, some may consider The Best & Beyond simply a modernization or update of my older material, but I feel it is much more a statement of my present-day musical mindset, not to mention some incredible musicianship by a few Portland musicians\".\n\nGino’s First Published Book\n\nWhen Gino was asked to write liner notes for The Best & Beyond, he found himself more eager to share personal information than what was originally needed. The notes grew into his first published book called, Stardust in the Sand—a historical and candid account of life and times culminating into the songs on The Best & Beyond included in the back flap. The last chapter entitled, Godlings and Feet of Clay is a humorous telling of chance encounters with famous musicians, including Sting, Billy Joel, Stevie Wonder, and Marvin Gaye, to name a few.\n\nWhether performing piano-voice concerts in theaters, singing before symphony orchestras in concert halls, big bands or a pop ensemble to throngs of enthusiastic fans, Gino remains impassioned and true to his art as ever. Gino Vannelli’s standing as a powerful and innovative live performer, his well hewn musical skills as composer, poet, producer and arranger, his engaging persona notwithstanding, keep his career rising to greater heights. \"The best works lie in the wake of reaching.\""}, {"url": "https://www.allmusic.com/artist/gino-vannelli-mn0000948061/biography", "page_content": "While it's indisputable that Gino Vannelli was truly prominent within a specific 12-year period, there is also no doubt that he has been one of the most dynamic and enduring artists since his 1970 debut. The singer, songwriter, arranger, and producer is in what must be a small class of musicians who have scaled the upper reaches of Billboard's pop, rock, adult contemporary, R&B, club, jazz, and classical charts. He hit his stride in the mid '70s with a succession of bold albums appealing to all of those audiences and more, as they integrated a multitude of styles in a way that exemplified fusion in the truest sense, and centered his lithe, soaring, and virtuosic vocals with total conviction. A hot streak of gold records in Vannelli's native Canada culminated in Brother to Brother (1978), a platinum album featuring the Canadian number one hit \"I Just Wanna Stop,\" also a Grammy-nominated Top Ten U.S. hit. Since the '80s, during which he scored a second Canadian platinum album with Black Cars (1984), Vannelli has moved steadily from one unpredictable project the next. Among these are Yonder Tree (1995), a primarily acoustic jazz date; Canto (2002), a classical pop recording with lyrics in four languages; and Wilderness Road (2019), his third album to land on the jazz chart.\n\nGino Vannelli started on drums as a young jazz enthusiast in his hometown of Montreal. Well before his teens, he successfully auditioned for a local band called the Cobras, having learned the Ventures' \"Wipeout\" on the spot by listening to the hopefuls before him. Shortly thereafter, he formed the Motown-inspired Jacksonville Five -- years before the emergence of the Jackson 5 -- starting on drums and moving to lead vocals when Tom Jones' \"It's Not Unusual\" proved too much a challenge for the band's singer. In 1970, still a teenager, Vannelli debuted under the name Vann-Elli with a one-off RCA Victor single consisting of \"Gina Bold\" and \"Never Cry Again,\" songs he wrote and co-arranged that flitted between bubblegum pop and blue-eyed soul. The A-side registered on the Canadian pop chart at number 92.\n\nFurther pursuance of a music career in New York was unfruitful. However, during a West Coast trip with his brother Joe -- who had played keyboards in the Jacksonville Five -- Vannelli approached trumpeter and A&M co-founder Herb Alpert in the A&M Records parking lot, performed a few songs for the label boss later that day, and secured a contract. Enriched by his musical theory studies at McGill University and possessing a cache of original material, Vannelli was primed for artistic and commercial breakthroughs but didn't achieve them until the follow-up to his Alpert-produced 1973 LP debut Crazy Life. Driven by the lead single \"People Gotta Move\" (number 21 pop in Canada, number 22 U.S.), 1974's Powerful People was Vannelli's first gold seller in his native country. That year, Vannelli toured with Stevie Wonder and became one of the first white acts on Soul Train, two years behind Dennis Coffey and months ahead of Elton John and David Bowie.\n\nThrough 1978, Vannelli continued to release ambitious and eclectic studio albums for A&M, all with extensive help from Joe Vannelli, and most with younger brother Ross, on an annual basis. With one exception, Storm at Sunup, The Gist of the Gemini, A Pauper in Paradise, and Brother to Brother each earned gold or platinum certifications in Canada. The last of those went platinum in Canada and the U.S. Altogether, these LPs spawned six charting singles highlighted by the Brother to Brother ballad \"I Just Wanna Stop,\" which sent Vannelli to the top of the Canadian pop chart (number four in the U.S.) and prompted another Soul Train visit. Moreover, \"I Just Wanna Stop\" was nominated for a Grammy in the category of Best Pop Vocal Performance. Vannelli twice won the Juno Award for Best Male Artist during this run.\n\nVannelli moved to the Arista label and collected another gold disc with Nightwalker, a 1981 arrival featuring another big ballad, the number 13 hit (number six U.S.) \"Living Inside Myself.\" Vannelli and siblings Joe and Ross were Grammy-nominated together for Best Instrumental Arrangement Accompanying Vocals. Arista refused to release Vannelli's divergent follow-up, Twisted Heart, resulting in a protracted battle between the artist and label. After he was released from his contract, Vannelli returned in 1984 with Black Cars, issued on Polydor in Canada and CBS Associated in the States. Vannelli's eighth album, it produced the rocking number four Canadian hit title song, the number 14 ballad \"Hurts to Be in Love,\" and went platinum. Vannelli kept to a triennial release schedule with Big Dreamers Never Sleep in 1987 and Inconsolable Man in 1990. A hometown concert in 1990 was documented the next year with Live in Montreal.\n\nOpting to no longer concern himself with commercial demands, Vannelli retreated from the music industry for a few years before resurfacing during the latter half of the '90s. Yonder Tree and Slow Love, released on Verve Forecast respectively in 1995 and 1998, shifted Vannelli's focus to understated ballads with primarily acoustic backing. They were his first two albums to enter Billboard's jazz chart. He then dove headlong into another early and longstanding love, classical music. Among his contributions to pianist Niels Lan Doky's 2001 album was the Schubert-inspired piece \"Parole Per Mio Padre,\" which he subsequently performed for Pope John Paul. This led to a deal with BMG that resulted in Canto, a 2002 recording that reached Billboard's classical and classical crossover charts. Throughout the remainder of the decade, Vannelli revisited his back catalog and simultaneously looked forward. These Are the Days was split between new songs and a selection of hits dating back to the mid '70s. That 2005 release was followed four years later by A Good Thing, an album and poetry book facilitated by time spent in the Netherlands. Also in 2009, Vannelli revisited his back catalog with The Best and Beyond, which covered hits and deeper cuts alike, from \"I Just Wanna Stop\" to \"Wheels of Life,\" with support from musicians based in Vannelli's adoptive Oregon. The album was also bundled with Vannelli's 2010 memoir Stardust in the Sand.\n\nDuring the 2010s and into the next decade, Vannelli performed in a wide variety of settings that enabled him to continue showcasing his versatility and eagerness to keep moving forward. He also worked as a music educator. He released Live in LA in 2015, and followed it four years later by Wilderness Road, his first album of original material in over ten years. An expanded edition of A Good Thing, titled (More Of) A Good Thing, landed two years later. These three later works, all co-produced by Gino and Ross Vannelli, were issued by SoNo Recording Group."}, {"url": "https://www.last.fm/music/Gino+Vannelli/+wiki", "page_content": "Gino Vannelli (born 16 June 1952 in Montreal, Quebec, Canada) is a Canadian singer/songwriter of Italian ancestry.\n\nFrom a musical family, his father was a big band musician. Gino Vannelli played drums at a young age and after finishing high school studied musical theory at McGill University.\n\nHe eventually went to Los Angeles, California where he signed with Herb Alpert's A&M Records, releasing his first album with that record label in 1973. Gino's brother, Joe, served as arranger and keyboardist for most of his recording career. At a time when polyphonic synthesizers were non-existent, Joe overdubbed multiple parts to create a texture of sound that was largely progressive for the early 1970s. Gino's 1978 song, \"I Just Wanna Stop,\" earned him an American Grammy Award nomination. He won Canada's Juno Award for Best Male Artist in 1976 and 1979. Also, Gino and Joe Vannelli shared the Juno Award for Recording Engineer of the Year three times: in 1986 for \"Black Cars,\" in 1987 for \"Wild Horses\"/\"Young Lover,\" and in 1991 for \"The Time of Day\"/\"Sunset on L.A.\".\n\nVannelli's other hits include \"Living Inside Myself\" (1980) and \"Wild Horses\" (1987).\n\nIn 1990 Gino recorded the album 'Inconsolable man' and toured extensively for the first time in well over a decade. His 'Live in Montreal' album was released in 1991.\n\nIn 1993, Québécoise singer Martine St. Clair recorded \"Wheels of Life\" as a duet with Vanelli as well as a French-language version called \"L'Amour Est Loi\".\n\nIt was some 4 years since his last 'Live' album before Gino released one of his best albums ever, the heavily jazz influenced album 'Yonder Tree'. Issued in 1995 the album received rave reviews from critics and fans alike.\n\nNever one to stand still in terms of style, Gino subsequently released his 'Slow Love' album in 1998. A collection of beautifully crafted romantic songs, slightly more MOR than his previous album.\n\nWe had to wait until 2003 for the release of Gino's 'Canto' album. A collection of classical and operatic songs which exemplified his compositional skills as well as his incredible voice. With a symphonic Orchestra he sings in English, Spanish, Italian and French. This album reflected an artist freed from the shackles of commerciality and one able to concentrate on just the music. The result was acclaimed around the world and proved particulary successful in Europe.\n\nIn 2006 Gino released a best of album but again not one to follow the norm, this album entitled 'These are the Days' contained many of his previously best known songs together with 7 completely new pop songs.\n\nFollowing major concert and festival success in the late 90's and well into the new millenium, Gino who had a solid fan base in Europe, set up home in The Netherlands where he spends many months of the year recording, performing and teaching. His new album written, performed and produced in collaboration with Dutch jazz pianist Michiel Borstlap, is due out early 2008.\n\nGino Vannelli's official website\n\nWikipedia entry on Gino Vannelli"}, {"url": "https://ginov.com/", "page_content": "(More Of) A Good Thing\n\nNow Available from SRG Records\n\nStream or Download:\n\nSRG Records | iTunes | Apple Music | Amazon Music | Spotify"}, {"url": "https://www.allmusic.com/artist/gino-vannelli-mn0000948061", "page_content": "Gino Vannelli Follow Artist +\n\nVirtuosic singer with an increasingly dynamic career since his commercial peak with hits such as \"I Just Wanna Stop\" and \"Living Inside Myself.\"\n\nRead Full Biography"}, {"url": "https://www.allmusic.com/artist/gino-vannelli-mn0000948061/discography", "page_content": "Discography Gino Vannelli Follow Artist +\n\nVirtuosic singer with an increasingly dynamic career since his commercial peak with hits such as \"I Just Wanna Stop\" and \"Living Inside Myself.\"\n\nRead Full Biography"}, {"url": "https://jazzrocksoul.com/artists/gino-vannelli/", "page_content": "Gino Vannelli is an Italian-Canadian vocalist and songwriter who released six albums on A&M between 1973 and 1978, followed by three albums on Arista and Polydor during the 1980s.\n\nGino Vannelli was born to an Italian family on June 16, 1952, in Montreal, Quebec. His older brother, Joe (b. 1950), is also a musician and producer who has worked with Gino on many recordings. Their younger brother, Ross (b. 1956), is a film composer. Their father, Russ Vannelli, was a singer in the local backing bands of jazz trumpeters Maynard Ferguson and Bix Belair.\n\nGino originally took up drums in emulation of his idols Gene Krupa and Buddy Rich. As a teenager, he drummed in the local garage-rock band The Cobras. In 1969, the 17-year-old Vannelli signed a contract with RCA under the pseudonym Vann Elli.[1]\n\nIn 1972, Gino and Joe made a pilgrimage to Los Angeles in search of recording opportunities. Near penniless, they lied in wait at the A&M Records parking lot. The moment label co-founder Herb Alpert arrived, Gino jumped out and sang to the mogul just as security closed in. Impressed by what he heard, Alpert invited Gino into the studio and signed him to the label.\n\nCrazy Life\n\n\n\nGino Vannelli released his debut album, Crazy Life, in October 1973 on A&M.\n\n\n\nPowerful People\n\n\n\nGino Vannelli released his second album, Powerful People, in September 1974 on A&M.\n\nStorm at Sunup\n\n\n\nGino Vannelli released his third album, Storm at Sunup , in July 1975 on A&M.\n\nThe Gist of the Gemini\n\n\n\nGino Vannelli released his fourth album, The Gist of the Gemini, on September 21, 1976, on A&M.\n\n\n\nA Pauper in Paradise\n\nGino Vannelli released his fifth album, A Pauper in Paradise, in October 1977 on A&M.\n\n\n\nBrother to Brother\n\n\n\nGino Vannelli released his sixth album, Brother to Brother, in September 1978 on A&M.\n\nNightwalker\n\n\n\nGino Vannelli released his seventh album, Nightwalker, in March 1981 on Arista.\n\nBlack Cars\n\n\n\nGino Vannelli released his eighth album, Black Cars, on November 30, 1984, on HME (US) and Polydor (Canada, Germany).\n\n\n\nBig Dreamers Never Sleep\n\nGino Vannelli released his ninth album, Big Dreamers Never Sleep, in February 1987 on CBS.\n\n\n\nDiscography:\n\nSources:\n\nReferences:"}, {"url": "https://www.billboard.com/artist/gino-vannelli/", "page_content": "I Just Wanna Stop Gino Vannelli\n\nLiving Inside Myself Gino Vannelli\n\nHurts To Be In Love Gino Vannelli"}, {"url": "https://www.aaemusic.com/artist/gino-vannelli/", "page_content": "Gino Vannelli (born 16 June 1952 in Montreal, Quebec, Canada) is a Canadian singer/songwriter of Italian ancestry.From a musical family, his father was a big band musician. Gino Vannelli played drums at a young age and after finishing high school studied musical theory at McGill University.\n\nHe eventually went to Los Angeles, California where he signed with Herb Alpert's A&M Records, releasing his first album with that record label in 1973. Gino's brother, Joe, served as arranger and keyboardist for most of his recording career.\n\nAt a time when polyphonic synthesizers were non-existent, Joe overdubbed multiple parts to create a texture of sound that was largely progressive for the early 1970s. Gino's 1978 song, \"I Just Wanna Stop,\" earned him an American Grammy Award nomination.\n\nHe won Canada's Juno Award for Best Male Artist in 1976 and 1979. Also, Gino and Joe Vannelli shared the Juno Award for Recording Engineer of the Year three times: in 1986 for \"Black Cars,\" in 1987 for \"Wild Horses\"/\"Young Lover,\" and in 1991 for \"The Time of Day\"/\"Sunset on L.\n\nA.\".Vannelli's other hits include \"Living Inside Myself\" (1980) and \"Wild Horses\" (1987).In 1990 Gino recorded the album 'Inconsolable man' and toured extensively for the first time in well over a decade.\n\nHis 'Live in Montreal' album was released in 1991. In 1993, Québécoise singer Martine St. Clair recorded \"Wheels of Life\" as a duet with Vanelli as well as a French-language version called \"L'Amour Est Loi\".\n\nIt was some 4 years since his last 'Live' album before Gino released one of his best albums ever, the heavily jazz influenced album 'Yonder Tree'. Issued in 1995 the album received rave reviews from critics and fans alike.\n\nNever one to stand still in terms of style, Gino subsequently released his 'Slow Love' album in 1998. A collection of beautifully crafted romantic songs, slightly more MOR than his previous album. We had to wait until 2003 for the release of Gino's 'Canto' album.\n\nA collection of classical and operatic songs which exemplified his compositional skills as well as his incredible voice. With a symphonic Orchestra he sings in English, Spanish, Italian and French. This album reflected an artist freed from the shackles of commerciality and one able to concentrate on just the music.\n\nThe result was acclaimed around the world and proved particulary successful in Europe.In 2006 Gino released a best of album but again not one to follow the norm, this album entitled 'These are the Days' contained many of his previously best known songs together with 7 completely new pop songs.\n\nFollowing major concert and festival success in the late 90's and well into the new millenium, Gino who had a solid fan base in Europe, set up home in The Netherlands where he spends many months of the year recording, performing and teaching.\n\nHis new album written, performed and produced in collaboration with Dutch jazz pianist Michiel Borstlap, is due out early 2008.Gino Vannelli's official websiteWikipedia entry on Gino Vannelli"}, {"url": "https://www.bandnext.com/bands-like/gino-vannelli", "page_content": "Looking for bands that sound like Gino Vannelli? You’ve come to the right place.\n\nThe band Gino Vannelli was founded in 1952. Before coming to fame, the band got it’s start in Montreal. Generally, music journalists would define Gino Vannelli’s style within the genre/s of pop music, and other rock music.\n\nOur algorythm analyzed all bands in our database and below you find the top results."}], "Joni Mitchell is a music artist.": [{"url": "https://www.britannica.com/biography/Joni-Mitchell", "page_content": "Joni Mitchell, original name Roberta Joan Anderson, (born November 7, 1943, Fort McLeod, Alberta, Canada), Canadian experimental singer-songwriter whose greatest popularity was in the 1970s. Once described as the “Yang to Bob Dylan’s Yin, equaling him in richness and profusion of imagery,” Mitchell, like her 1960s contemporary, turned pop music into an art form.\n\nMitchell studied commercial art in her native Alberta before moving to Toronto in 1964 and performing at local folk clubs and coffeehouses. After a brief marriage to folksinger Chuck Mitchell, she relocated to New York City, where in 1967 she made her eponymous debut album (also known as Songs to a Seagull). Produced by David Crosby, this concept album was acclaimed for the maturity of its lyrics.\n\nBritannica Quiz Who Said It? Women Musicians, Artists, and Writers\n\nWith each successive release, Mitchell gained a larger following, from Clouds (which in 1969 won a Grammy Award for best folk performance) to the mischievous euphoria of Ladies of the Canyon (1970) to Blue (1971), which was her first million-selling album. By the early 1970s Mitchell had branched out from her acoustic base to experiment with pop, rock, and jazz, notably on Court and Spark (1974), which ultimately became her best-selling album. The Hissing of Summer Lawns (1975) further indicated a transition to a more complex, layered sound. Whereas earlier albums were more confessional in their subject matter, The Hissing of Summer Lawns, on which she satirized the role of the 1970s housewife, showed Mitchell’s movement toward social observation. Although she had a number of pop hits, especially in 1970 with “Big Yellow Taxi” and “Woodstock” (this song about the famous festival spawned three hit cover versions by other artists), Mitchell’s impact was as a long-term “album artist.” With its carefully precise yet improvisational feel, her music is at times difficult to listen to. She does not opt for straight melody or satisfying conclusions. “My music is not designed to grab instantly. It’s designed to wear for a lifetime, to hold up like a fine cloth,” she once said.\n\nWith Hejira (1976) and Don Juan’s Reckless Daughter (1977), she continued to disregard commercial considerations, while Mingus (1979) was considered by many as beyond the pale. An album that began as a collaboration with the jazz bassist Charles Mingus ended up as a treatment of his themes after his death. Mitchell moved ever further beyond her own experience, delving not only deeper into jazz but also into Black history; the album was as much a voice for the dispossessed as it was a biography of Mingus. Though fans were confused, Mingus remains a brave homage that does not fit neatly into either the rock or jazz genre.\n\nHaving proved that she could make commercially successful albums and win critical acclaim, Mitchell became a prestige artist. Moreover, because her songs had become hits for others, she was a source of considerable publishing revenue for her record companies. As a result, they went along with her musical experiments. After Mingus, however, Mitchell stood back a little from the pop world. From the beginning of her career she had illustrated her own album covers, so it was not surprising that in the 1980s she began to develop her visual art, undecided about whether to concentrate more on painting or music.\n\nAlthough not as prolific as in the 1960s and ’70s, Mitchell continued to create penetrating imaginative music, from the Thomas Dolby-produced Dog Eat Dog (1985) to the more reflective Night Ride Home (1991) and the Grammy Award-winning Turbulent Indigo (1994). Having dealt with international political and social issues such as Ethiopian famine on Dog Eat Dog, she returned by the early 1990s to more personal subject matter—singing about true love, for instance, on Turbulent Indigo. Though unworried about pop chart trends, in 1997 she enjoyed major success with a new, younger audience when Janet Jackson sampled from Mitchell’s “Big Yellow Taxi” for the massive hit “Got ’Til It’s Gone.” In 1997 she published a new collection of her work, Joni Mitchell: The Complete Poems and Lyrics.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nTaming the Tiger (1998) further mined her personal life for inspiration, notably on the track “Stay in Touch,” a nod to the daughter she gave up for adoption in 1965 and with whom she reunited in 1997. She covered standards on Both Sides Now (2000) and reworked a wide-ranging selection of her oeuvre on Travelogue (2002). On Shine (2007), her first album recorded for the Starbucks coffee chain’s music label, she returned to themes of environmental and social justice. Mitchell also issued several retrospective compilations, including The Beginning of Survival (2004), Dreamland (2004), Songs of a Prairie Girl (2005), and the 53-song omnibus Love Has Many Faces: A Quartet, A Ballet, Waiting to Be Danced (2014). Her continuing influence was shown by the release of the tribute album Joni 75: A Birthday Celebration (2019), on which such artists as Chaka Khan, Diana Krall, Rufus Wainwright, Norah Jones, James Taylor, and Emmylou Harris performed Mitchell’s songs.\n\nOne of the first women in modern rock to achieve enviable longevity and critical recognition, Mitchell was a major inspiration to everyone from Bob Dylan and Prince to a later generation of female artists such as Suzanne Vega and Alanis Morissette. Although she regularly collaborated with producers and arrangers—such as Jaco Pastorius, Mike Gibbs, and Larry Klein—Mitchell maintained coproducer credit and always had control over her material. Her songs were covered by a range of stars, including Dylan, Fairport Convention, Judy Collins, Johnny Cash, and Crosby, Stills and Nash. Mitchell was awarded the Polar Music Prize by the Royal Swedish Academy of Music in 1996, and she was inducted into the Rock and Roll Hall of Fame in 1997. In 2002 she won a Grammy Award for lifetime achievement, and two years later she was made a Companion of the Order of Canada. In 2021 Mitchell received a Kennedy Center Honor, and two years later she was named the recipient of the Gershwin Prize for Popular Song."}, {"url": "https://www.biography.com/musicians/joni-mitchell", "page_content": "(1943-)\n\nWho Is Joni Mitchell?\n\nIn 1968, Joni Mitchell recorded her first, self-titled album. Other highly successful albums followed. Mitchell won her first Grammy Award (best folk performance) for her 1969 album, Clouds. She has won seven more Grammy Awards since then, in several different categories, including traditional pop, pop music and lifetime achievement.\n\nEarly Life and Music Career\n\nSinger-songwriter Joni Mitchell was born Roberta Joan Anderson on November 7, 1943, in Fort Macleod, Canada. At the age of 9, Mitchell contracted polio, and it was during her recovery in the hospital that she began performing and singing to patients. After teaching herself how to play the guitar, she went off to art college and quickly emerged as one of the leading folk performers of the late 1960s and '70s.\n\nAt the beginning of her career, Mitchell's compositions were highly original and personal in their lyrical imagery. It was this style that first attracted attention among folk-music audiences in Toronto while she was still in her teens. She moved to the United States in the mid-1960s, and in 1968, she recorded her first album, Joni Mitchell, produced by David Crosby.\n\nSongs and Albums\n\nOther highly successful albums followed. Joni Mitchell won her first Grammy Award (best folk performance) in 1969, for her sophomore album, Clouds. Her third album, Ladies of the Canyon, was a mainstream success for the folk singer, becoming her first gold album, which included the hits \"The Circle Game\" and \"Big Yellow Taxi.\" It was during this time she was already starting to experiment with pop and rock genres.\n\nHer album Court and Spark (1974) signaled her foray into jazz and jazz fusion and was lauded by critics; it ended up becoming her most commercially successful project to date and was nominated for four Grammy Awards, of which Mitchell won for best instrumental arrangement accompanying vocalist(s).\n\nOver the past four decades, Mitchell has garnered several Grammys in various categories, including traditional pop, pop music and lifetime achievement. Her other notable successful recordings include Blue (1971), The Hissing of Summer Lawns (1975), the highly experimental Hejira (1976) and Turbulent Indigo (1994).\n\nMitchell wasn’t the only one making hits with the songs she wrote. Other musicians have recorded successful covers of her songs, including Judy Collins; the Counting Crows; and Crosby, Stills, Nash and Young.\n\nREAD MORE: The Heartbreak and Vulnerability Behind Joni Mitchell's Iconic 'Blue' Album\n\nLater Work\n\nMitchell's later albums include Taming the Tiger (1998), Both Sides Now (2000) and the compilation albums Dreamland (2004) and Songs of a Prairie Girl (2005). In addition to her own extensive body of work, she has been an enormous influence on several other artists with her unique guitar styling and expressive lyrics.\n\nMitchell was inducted into the Rock and Roll Hall of Fame in 1997 and the Canadian Songwriters Hall of Fame in 2007.\n\nRetirement and Health Issues\n\nIn an interview with Rolling Stone in 2002, Mitchell announced she was retiring due to her frustration with the music industry, referring to it as a \"cesspool.\" However, she didn't adhere to her statement, as she became busier than ever with the release of various compilations consisting of her earlier works.\n\nIn 2007 she released Shine, her first album of new songs in almost a decade. Politically charged and environmentally conscious, the album was a Billboard success and was Mitchell's nineteenth and final studio album.\n\nBesides claiming her voice has faltered from complications due to polio and a compressed larynx, Mitchell then dealt with other health issues. She sought treatment for Morgellons disease, which is described as “an uncommon, unexplained skin disorder characterized by sores, crawling sensations on and under the skin, and fiber-like filaments emerging from the sores,” according to the Mayo Clinic.\n\nIn 2015, Mitchell experienced another health crisis. News broke in late March that the singer had been hospitalized. Some reports later indicated that she was in a coma, but a spokesperson for the singer corrected that error. Leslie Morris, a friend of Mitchell's, was appointed her conservator by a California judge in May.\n\nThat June, singer David Crosby claimed that Mitchell was unable to talk in an interview with the Huffington Post. Morris, through JoniMitchell.com, released a statement to clarify Mitchell's condition. She acknowledged that the singer had suffered an aneurysm, but was expected to make a \"full recovery.\" Morris also addressed Crosby's comment, saying that \"Joni is speaking, and she's speaking well. She is not walking yet, but she will be in the near future as she is undergoing daily therapies. She is resting comfortably in her own home and she's getting better each day.\"\n\nPersonal Life\n\nWhile an art student in college, Mitchell got pregnant and gave birth to Kelly Dale (renamed Kilauren) Anderson in 1965. The birth father refused to marry Mitchell, and she felt she had no choice but to give her daughter up for adoption. The adoptive parents renamed the baby girl Kilaruen Gibb. After keeping her daughter a secret and being separated from her for over 30 years, Mitchell reunited with her in 1997.\n\nA few weeks after giving birth to Kilaruen, Mitchell met American folk singer Chuck Mitchell and married him 36 hours after meeting him. The couple left for Michigan where they had an official ceremony in June 1965 and she took his last name. They divorced two years later.\n\nIn 1982, Mitchell married bassist Larry Klein, who worked on her album Wild Things Run Fast. Klein soon became an established music producer and worked on a number of Mitchell's albums throughout the late '80s and early '90s. While the couple worked on Turbulent Indigo, they eventually divorced in 1994. The following year Turbulent Indigo won a Grammy for best pop album.\n\nQUICK FACTS\n\nName: Joni Mitchell\n\nBirth Year: 1943\n\nBirth date: November 7, 1943\n\nBirth City: Fort Macleod\n\nBirth Country: Canada\n\nGender: Female\n\nBest Known For: Singer-songwriter Joni Mitchell, responsible for hits such as 'Both Sides Now' and 'Big Yellow Taxi,' is widely considered 1960s and '70s folk royalty.\n\nIndustries\n\nPop\n\nAstrological Sign: Scorpio\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Joni Mitchell Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/musician/joni-mitchell\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: December 14, 2020\n\nOriginal Published Date: April 3, 2014\n\nQUOTES"}, {"url": "https://jonimitchell.com/", "page_content": "When Joni mesmerized the Newport Folk Festival audience last summer with a surprise performance, she 'breathed new meaning into some of her most famous lyrics' (New York Times). Today, the powerful live recording of her beloved hit 'A Case Of You' is available digitally now. Originally released in 1971 on Blue, this new live recording features vocals by Marcus Mumford and Brandi Carlile.\n\nListen to “A Case Of You,” available digitally today on your preferred platform.\n\nThe entire At Newport live album will be available on July 28 - Newport Folk Festival 2023 weekend - via Rhino."}, {"url": "https://www.udiscovermusic.com/artist/joni-mitchell/", "page_content": "Photo by Michael Ochs Archives/Getty Images\n\nJoni Mitchell came from the open prairie and changed the way we think about the singer-songwriter; indeed, Painting With Words And Music is the apt title for her concert film. That’s what she does. Never in a hurry, it seems, she still manages to inhabit the persona of the ultimate troubadour.\n\nShe has been a muse for many – Graham Nash, James Taylor, Stephen Stills, Bob Dylan and Robert Plant spring to mind – but she doesn’t owe them. Her key albums are dotted across six decades, from 1968’s Song To A Seagull to 2007’s Shine, which she said would be her last foray into a business with which she shares a love-hate relationship.\n\nIf so, she has gifted us enough classic songs: ‘Chelsea Morning’, ‘Both Sides, Now’, ‘Big Yellow Taxi’, ‘You Turn Me On, I’m A Radio’, ‘Free Man in Paris’ – all tell a story, and Mitchell’s narrative skills are as famous for their grace as the artist herself. Leaving Canada for New York – and, later, the West Coast – she developed from a coffeehouse hopeful into a musician who has worked with Jackson Browne, Stephen Stills, David Crosby, Larry Carlton, Willie Nelson, and the jazz giant who inform her later work, notably Herbie Hancock, Pat Metheny, Charles Mingus, and Weather Report’s Wayne Shorter and Jaco Pastorius. Mitchell’s albums have won her nine Grammy Awards, Companion Of The Order Of Canada and induction into the Rock And Roll Hall of Fame (she didn’t attend). When she was given the Grammy Lifetime Achievement Award, in 2002, the citation pointed out she is “one of the most important female recording artists of the rock era” and “a powerful influence on all artists who embrace diversity, imagination and integrity”. She, however, describes herself as “a painter derailed by circumstance”.\n\nADVERTISEMENT\n\nRoberta Joan Anderson comes from Norwegian and Celtic stock but was born in Alberta, in 1943 – though she claimed Saskatoon as her hometown. Mixing passions for music and art, she dropped out of college to pursue a folk career. Seeing Buffy Sainte-Marie in 1964 convinced her to follow the folk path to Toronto, then Detroit, New York City and, eventually, California – travels that informed her first album, 1968’s Song To A Seagull.\n\nProduced by David Crosby, the album made some surprising omissions of songs Mitchell had already written, notably ‘Both Sides, Now’ and ‘Chelsea Morning’ (hits for Judy Collins and Dave Van Ronk), ‘The Circle Game’ (Tom Rush) and ‘Eastern Rain’ (Fairport Convention). The following year’s Clouds was a more assured affair, with Doors producer Paul A Rothchild at the board and Stephen Stills playing bass and guitar. This time the immaculate ‘Both Sides, Now’ and her paean to New York City, ‘Chelsea Morning’, were included, and helped develop a cult following that turned Joni into a star once Ladies Of The Canyon emerged. One of the most important albums of 1970, if only for ‘Big Yellow Taxi’ and ‘Woodstock’, this is where the rock and jazz crowd began to take notice.\n\n1971’s Blue was the turning point. Ever-expanding her palette, Mitchell used an Appalachian dulcimer and was backed by Stills (again), James Taylor, “Sneaky Pete” Kleinow and Russ Kunkel. This time around her lyrics became more personal and intense, and she experimented with alternative tuning – and detuning – on her acoustic as a means of forcing her vocals to fly into territory not usually associated with standard pop. The most poignant example is ‘Little Green’, about the daughter she gave up for adoption in 1965.\n\nThe following year’s For The Roses gave Mitchell the first hit in ‘You Turn Me On, I’m A Radio’, a backhanded allusion to a company request to write more commercial material, but it’s ‘See You Sometime’ that nails the wars of love on the head. Elsewhere, love songs and social commentary abound.\n\nReleased in 1974, Court And Spark remain her most successful album. With Joni backed by The Crusaders, Robbie Robertson, Cheech And Chong, Wayne Perkins and Jose Feliciano, it elevated her to the status of a West Coast jazz-folk-pop goddess. ‘Help Me’, ‘Free Man In Paris’ and the meandering melodic structure of ‘Down To You’ stood out and helped the album go double platinum.\n\nThe live 2LP Miles Of Aisles was further evidence of her moving closer to jazz, performing live with Tom Scott and Robben Ford from LA Express, and then she went further out for The Hissing Of Summer Lawns, an album that has been compared to Blood On The Tracks for its importance, and been widely praised. Prince was such a fan of the album that he sent Mitchell love letters (and he would go on to reference ‘Help Me’ in ‘The Ballad Of Dorothy Parker’ and cover ‘A Case Of You’ many times on stage throughout his career). The masterpieces on … Summer Lawns are ‘In France They Kiss On Main Street’ and ‘Shades Of Scarlett Conquering’, but everything has a widescreen cinematic impact with resonations and ruminations on art, the drug world, the music business and the modern metropolis.\n\nHejira, featuring Jaco Pastorius, Larry Carlton and Neil Young, repeats the trick and includes the wry ‘Coyote’, on which Bob Dylan’s 1975’s Rolling Thunder Revue (which, for a brief moment, picked Mitchell up) gets a none-too-favourable mention.\n\nDon Juan’s Reckless Daughter and Mingus are where Mitchell really parts company with the mainstream world of rock. While the former features JD Souther, Glenn Frey and Chaka Khan, it can’t disguise Mitchell’s diva status. Mingus, meanwhile, was a collaboration with the great composer and jazz musician, recorded shortly before his death. Taking on ‘Goodbye Pork Pie Hat’, ‘A Chair In The Sky’ and ‘The Dry Cleaner From Des Moines’, it sees Joni become something of a grande dame in waiting, but sales were better than expected.\n\nMoving to Geffen for her next four albums – Wild Things Run Fast, Dog Eat Dog, Chalk Mark In A Rain Storm and Night Ride Home – she worked up more pop-orientated material which featured her producer and soon-to-be-husband and producer Larry Klein. Nodding to the likes of Talking Heads, The Police and Steely Dan, Mitchell began to concentrate on her rhythm section but also hung with a different crowd. Guests in this era include Willie Nelson, Tom Petty and Peter Gabriel.\n\nReturning to Reprise for Turbulent Indigo (marked by its artwork, a self-portrait homage to Van Gogh), Mitchell’s fortunes enjoyed an upturn which the compilations Hits And Misses capitalised upon. Though towards the end of the 90s she would start hinting at retirement, Taming The Tiger emerged in 1998 and Mitchell set out on a co-headlining tour with Dylan and Van Morrison. It reignited her love for performance and, in 2000, she released the ambitious concept disc Both Sides Now. Featuring orchestral reinterpretations of evergreen classics from Rube Bloom, Rodgers and Hart, Harold Arlen and Sidney Clare (‘You’re My Thrill’ set the standard), it won her two Grammy Awards and glowing praise.\n\nIn a similar vein, 2002’s Travelogue reworked her catalogue to great effect and even includes a newly minted ‘The Last Time I Saw Richard’, a song which originally featured on Blue and was about her brief marriage to Richard Mitchell.\n\nA series of compilations of Mitchell’s latter-day career – The Beginning Of Survival, Dreamland and Songs Of A Prairie Girl – coincided with an onset of bad health. In 2006, she announced that her next album, the following year’s Shine, would be her last. She’s in fine form on it, however, and the song ‘One Week Last Summer’ won her the 2008 Grammy Awards for Best Pop Instrumental Performance.\n\nIn 2015, Mitchell suffered a brain aneurysm but appears to be on the mend. Allaying fans’ fears, her old friend, peer and ally Judy Collins, reported, “Joni is walking, talking, painting some, doing much rehab every day.”\n\nMany singer-songwriters have been said to have changed the music business, but few with the impact that Joni Mitchell has had. She’s lived an epic life. The 4CD box set she compiled, Love Has Many Faces: A Quartet, A Ballet, Waiting To Be Danced, pays testimony to a remarkable person. Her hejira – her journey – is not yet over.\n\nMax Bell\n\nUK English Format:UK English"}, {"url": "https://www.cbc.ca/music/read/joni-mitchell-20-things-you-didn-t-know-about-one-of-canada-s-greatest-musicians-1.5060897", "page_content": "For over half a century, Joni Mitchell has stood out as one of the most distinctive voices in Canadian music, and one that Rolling Stone called \"one of the greatest songwriters ever.\"\n\nShe has been showered with honours and awards from Grammys to the Order of Canada to a spot in the Rock and Roll Hall of Fame, and her songs have been covered by dozens of musicians, among them Sarah MacLachlan, Tori Amos, k.d. lang, Cee Lo Green and Herbie Hancock. In 2007, Canada Post even featured her on a postage stamp. To celebrate the one and only Joni, here are 20 things you might not know about the beloved Canadian musician.\n\n1. Joni Mitchell was born Roberta Joan Anderson in Fort Macleod, Alta., on Nov. 7, 1943. Her father was a former Royal Canadian Air Force officer who managed a grocery store; her mother was a school teacher. \"My mother was a romantic woman,\" Mitchell told the Washington Post in 1969. \"She raised me on Shakespeare as other parents quoted from the Bible. She encouraged me in old-fashioned things. I kept pressed-flower scrapbooks.\"\n\n2. Mitchell was particularly close to her maternal grandmother, Sadie McKee, and she dedicated her first album to McKee, whom Mitchell described as a lady who \"loved Robbie Burns and minor-key music and married a farmer who didn't understand.\"\n\n3. In 1951, when she was eight years old, Mitchell contracted polio during an epidemic in Canada — the same one that struck Neil Young. Mitchell was bedridden for weeks and faced the very real threat of having to live in an iron lung for the rest of her life.\n\n4. Mitchell later said it was during that winter in hospital that she became interested in singing. \"They said I might not walk again, and that I would not be able to go home for Christmas. I wouldn't go for it. So I started to sing Christmas carols and I used to sing them real loud.... The boy in the bed next to me, you know, used to complain. And I discovered I was a ham.\"\n\n5. From early on, Mitchell had a love of trains. As a child, growing up in what she called the \"two-block, one-church, one-hotel town\" of Maidstone, Sask., she would sit in bed and watch the morning train go by. \"The weird thing is that years later my parents met the conductor of that train at a party,\" remembered Mitchell in an interview. \"He said, 'All I remember of your town is a house with Christmas decorations and a kid that used to wave at me.'\"\n\n6. Mitchell's first paid gig was on Halloween night in 1962 at the Louis Riel coffee house at 725 Broadway Ave. in Saskatoon. She was just shy of her 19th birthday. The building is currently a restaurant called Calories.\n\n7. From a young age, Mitchell was interested in music. She took piano lessons for a few years and taught herself to play the guitar with the help of a Pete Seeger instruction book. She later studied commercial art at the Alberta College of Art and Design in Calgary, but became disillusioned by \"meaningless\" and \"not particularly creative\" courses, and left at the end of her first year to try her luck as a folk singer in Toronto. During the three-day trip from Calgary to Toronto on the Canadian Pacific Railroad, she wrote her first song, \"Day After Day\", a ballad set to the clacking of the train wheels.\n\n8. Mitchell couldn't afford the requisite membership in the musicians' union, so she worked as a salesgirl at a Toronto Simpsons–Sears department store until she scraped together enough for the $140 entrance fee. She eventually started singing at small folk clubs such as the Riverboat in Yorkville, then a bohemian neighbourhood.\n\n9. In fall of 1964, Mitchell became pregnant by her ex-boyfriend Brad MacMath, and was forced to give her daughter up for adoption because she was too poor to raise her. Writing about her song, \"Moon at the Window\", Mitchell said, \"My daughter's father left me three months pregnant in an attic room with no money and winter coming on and only a fireplace for heat. The spindles of the banister were gap-toothed fuel for last winter's occupants. He left behind a doodle of a pregnant woman seated at a window, looking at a crescent moon and on it he wrote, 'The thief left it behind, the moon at the window.' The song, other than this Zen saying, has nothing to do with that incident.\"\n\n10. In 1967, Jimi Hendrix attended one of Mitchell's concerts at Le Hibou in Ottawa after playing a concert at the Capitol Theatre. With Mitchell's permission, Hendrix recorded her performance. Unfortunately, both Jimi's recorder and the tapes were stolen several days later.\n\n11. Mitchell got her name when she married Chuck Mitchell, a singer and cabaret performer from Detroit who was another regular on the Toronto folk circuit. They married in June, 1965, reportedly just 36 hours after they met. The pair moved to Detroit, where they often performed together.\n\n12. After a year, the marriage ended, and Joni Mitchell moved to New York, where she continued her career as a solo artist. She later said she did not plan to remarry. \"I feel like I'm married to this guy named Art,\" she said in an interview. \"I'm responsible to my Art above all else ... my family consists of pieces of work that go out into the world. Instead of hanging around for nineteen years they leave the nest early.\"\n\n13. And while Mitchell's primary love was art, she did find romance with other high-profile musicians, among them David Crosby, James Taylor, Graham Nash, Leonard Cohen and Jackson Browne. \"The rock 'n' roll industry is very incestuous,\" she told MacLean's. \"We have all been close at one time or another, and I think that a lot of beautiful music came from it. A lot of beautiful times came from it, too, through that mutual understanding. A lot of pain, too, because, inevitably, different relationships broke up.\"\n\n14. A lifelong collaborator, Mitchell has performed and recorded with a host of artists — but not all of them made the cut. Recounting the recording of her song \"Ladies Man\", Mitchell said, \"I invited Don Henley to come and sing with me on this one. After he left, when I was playing it back, I was amazed at how similar our voices sounded. It took a while to even notice that a new singer had been introduced. So I went across the hall to where Lionel Richie was recording and I conscripted him. There was the contrast I wanted, so I replaced Don with Lionel. The old cutting room floor routine.\"\n\n15. Mitchell's musical styles and themes have shifted dramatically over time. As she told the LA Times, \"My first four albums covered the usual youth problems — looking for love in all the wrong places — while the next five are basically about being in your 30s. Things start losing their profundity; in middle-late age, you enter a tragedian period, realizing that the human animal isn't changing for the better. In a way, I think I entered straight into my tragedian period, as my work is set against the stupid, destructive way we live on this planet. Americans have decided to be stupid and shallow since 1980. Madonna is like Nero; she marks the turning point.\"\n\n16. Although she has always been best known for her music, Mitchell is also a gifted visual artist, and many of her works were featured on her album covers. \"All through this,\" she told the Globe and Mail, \"I have always thought of myself as a painter derailed by circumstance.\"\n\n17. In 2002, Mitchell was appointed a companion of the Order of Canada. \"It's a beautiful award,\" she later told Reader's Digest. \"But my two highest honours came from black people. In the green room at the Grammys, the door flew open and in came this black girl. She threw her arms out at said, 'Girl, you make me see pictures in my head. Give me a hug.' Now that's an honour. The other one was a blind black piano player named Henry Butler who said to me, 'You make raceless, genderless music.'\"\n\nJoni Mitchell is appointed the Order of Canada. (Chris Wattie/Reuters)\n\n18. Mitchell has never been shy about expressing her opinions about politics, religion and even fellow musicians. In a particularly outspoken interview with the LA Times in 2010, Mitchell stirred controversy with some unexpected remarks about artists from Madonna to Bob Dylan. \"Bob is not authentic at all,\" she said. \"He's a plagiarist, and his name and voice are fake. Everything about Bob is a deception.\"\n\n19. Mitchell released her last album of original material, Shine, in 2007, and quit touring. The album entered the charts at number 14, the highest position since Hejira, which she had released 30 years earlier.\n\n20. When asked in an interview how she could retire from something that was such a primary part of her life, Mitchell replied, \"Easy. It's just like a wind that blew through me, that stopped blowing. It's gone.\""}, {"url": "https://www.thisisdig.com/feature/joni-mitchell-songwriter-life-and-legacy/", "page_content": "If you’d seen Joni Mitchell in the early 60s, playing in small coffeehouses and nightclubs in Saskatoon, Saskatchewan, Canada, you may have assumed she was one of many other wannabe folk singers, with her delicate voice and gentle guitar numbers. Would it have been possible to imagine just how rich and varied a career she would have as a songwriter?\n\nCertainly, there were some people present in the early years who recognised the promise Roberta Joan Anderson had – not least other folk musicians – including Judy Collins, Fairport Convention and Tom Rush – who heard her self-penned songs, including Chelsea Morning, The Circle Game and Both Sides, Now, and knew the value of what they heard. Mitchell’s songwriting talent alone would draw intrigue, and lead to her signing to Reprise for her debut album, Song To A Seagull.\n\nA love for words: setting the bar\n\nIt wasn’t a perfect start. The album, produced by The Byrds’ David Crosby, suffered from tape hiss, the poor audio quality underselling Joni’s talent and taking some of the shine off the pearls within. Reprise didn’t realise that the birds on the album cover spelt out the title, Song To A Seagull, and cut the sleeves too small, leaving first pressings reading “Son To A Seagu”.\n\nStill, it didn’t Joni hold back. The beautiful sleeve design – one of the best 60s album covers – would set the bar for all Mitchell’s subsequent records. And if there’s one thing fans should note, it’s the credit she gives on the album to her English teacher: “… dedicated to Mr Kratzmen, who taught me to love words”. Because by 1968, we had barely seen Joni’s love of words.\n\nLady of the canyon: a flourishing songwriter\n\nWith a work ethic like no other, Joni Mitchell managed to find the words for almost an album a year from the late 60s and throughout the 70s, her songwriting flourishing across 1969’s Clouds and 1970’s Ladies Of The Canyon – the latter of which brought about some of Mitchell’s first great songs, including Rainy Night House, Ladies Of The Canyon and Morning Morgantown, as well as Big Yellow Taxi."}, {"url": "https://www.thisdayinmusic.com/artists/joni-mitchell/", "page_content": "Photo: Joel Bernstein\n\nJoni Mitchell, (Roberta Anderson), was born on 7th Nov, 1943. Mitchell is one of the most important and influential female recording artists of the late 20th century. Ask any female singer from Tori Amos, to Sheryl Crow and newbies like Adel who their favorite female singer songwriter is and all will say Joni. Led Zeppelin sang about her in “Going To California” so did Prince in “The Ballad Of Dorothy Parker”. Even Madonna cited Mitchell as the first female artist that really spoke to her as a teenager.\n\nPlenty have covered her songs, some better than others, and here’s why so many fail – she plays the guitar and sings like no other artist, so to ‘cover’ a Joni song and do it justice is a difficult task. Judy Collins’s 1967 recording of “Both Sides Now” became a top 10 hit, Matthews Southern Comfort did a great job with their version of “Woodstock”, Counting Crows succeeded with their version of “Big Yellow Taxi”, but many have failed.\n\nJoni Mitchell is Neil Young playing folk music on weird guitar tunings who got drunk at a jazz club. And like her fellow countryman Young, Joni has played it her way, never looking for hit records (she’s only ever had one US top 10 hit). Her early albums have become timeless classics; just listen to Ladies Of The Canyon, Blue and Court And Spark.\n\nSo, what do we know about Joni? She was stricken with polio at the age of eight and while recovering in a children’s hospital, she began her performing career by singing to the other patients. She later taught herself to play guitar with the aid of a Pete Seeger instruction book, she went off to art college, and became a fixture on the folk music scene around Alberta, Canada. After relocating to Toronto, she married folksinger Chuck Mitchell in 1965, and began performing under the name Joni Mitchell.\n\nAfter performing in Coffee Houses and clubs in Ontario, Joni spread her wings and ventured south. One night when she was performing at a club in Coconut Grove, Florida, David Crosby walked in and was immediately struck by her ability and her appeal as an artist. He took her back to Los Angeles, where he set about introducing her and her music to his friends. Crosby convinced a record company to agree to let Mitchell record a solo acoustic album without all the folk-rock overdubs that were in vogue at the time, and his clout earned him a producer’s credit in March 1968, when Reprise Records released her debut album, alternately known as Joni Mitchell or Song To A Seagull.\n\nMitchell announced in October 2002 that she had made her last ever record; she’d grown tired of the industry. She told W magazine that she intended to retire. She also claimed she would never sign another corporate label deal and in Rolling Stone magazine blasted the recording industry for being “a cesspool.”\n\nShe has received eight Grammy Awards during her career, with the first coming in 1969 and the most recent in 2008. She received a Grammy Lifetime Achievement Award in 2002, with the citation describing her as “one of the most important female recording artists of the rock era” and “a powerful influence on all artists who embrace diversity, imagination and integrity.”\n\nOn March 31, 2015, Joni Mitchell was found unconscious in her Los Angeles home. She regained consciousness in an ambulance on her way to hospital, but was taken to intensive care for tests. On May 29, 2015, it was confirmed that Mitchell had suffered a brain aneurysm and that while speech was difficult, Mitchell had been communicating with others.\n\nSince 2015 Mitchell has made several recent public appearances as she recovers, according to some reports she is still learning to walk again, and she has not spoken in public. She appeared on stage on 7 November 2018 at the conclusion of Joni 75, a benefit performance in honor of her birthday at LA’s flagship performing arts destination, the Music Center."}, {"url": "https://pitchfork.com/features/lists-and-guides/joni-mitchell-her-art-and-life-in-33-songs/", "page_content": "Joni Mitchell Shifts the Weather\n\nWhen Joni Mitchell first appears in Martin Scorsese’s 1976 concert film The Last Waltz, she’s in silhouette offstage, adding vocals to Neil Young’s “Helpless.” Young stands in the spotlight with the Band’s Robbie Robertson and Rick Danko; grinning like fools, they look like they’re in on some off-topic joke. Mitchell, on the other hand, is serious, listening intently. Her features are obscured in shadow, the clean lines of her long neck and strong chin reinforcing the posture that always makes her seem to be bound skyward, like an egret.\n\nLike Young, Mitchell grew up in a chilly part of Canada, and the stark dreaminess of “Helpless,” its evocation of a place where creativity grows from lonely ground, is hers, too. When Mitchell enters the song with her high, nearly wild yet perfectly modulated wail, it doesn’t blend; instead, her voice hits the others like a weather event, an intangible and irresistible current. Kept out of the spotlight, she still claims it—yet she also charts her own path, beyond anyone else’s grasp.\n\nI often think about this moment when trying to comprehend Mitchell’s central, singular role in rock’s evolution. When she began her career in the mid-1960s as part of the folk revival, rock was a game dominated by roguish white boys competing with each other for girls, glamour, and, eventually, social significance. Leading a new cohort of more openly poetic and introspective peers—Young, James Taylor, Jackson Browne, Carole King—Mitchell turned rock into an adult pursuit, and folk into a personal one. From breakthrough ballads like “Both Sides, Now” to irreducible epics like “Coyote” and “Paprika Plains,” she showed that songs in the rock and soul era could be both deeply idiosyncratic and vastly observational. They could move through blues tunings, jazz changes, Latin and African rhythms, torch-song intimacies, and prophetic declarations.\n\nMitchell is a painter, and she creates in shades and planes of perception; she is a cinematic thinker perfecting every detail in her mise en scène. In the 1970s, when she defined the singer-songwriter position, plenty of people were mining their love affairs for lyrics, or trying new guitar tunings, or blending plain conversation with high-flying metaphor; they might’ve also been thinking, however casually, about how their songs might add up to something bigger than just radio jingles. But no one—except, perhaps, in nearby worlds, Nina Simone or Stevie Wonder or David Bowie—did all of these things with such depth and commitment and inventiveness."}, {"url": "https://www.wikiwand.com/en/Joni_Mitchell", "page_content": "Roberta Joan \"Joni\" Mitchell (née Anderson; born November 7, 1943) is a Canadian-American musician, producer, and painter. As one of the most influential singer-songwriters to emerge from the 1960s folk music circuit, Mitchell became known for her starkly personal lyrics and unconventional compositions which grew to incorporate pop and jazz elements.[1] She has received many accolades, including ten Grammy Awards and induction into the Rock and Roll Hall of Fame in 1997. Rolling Stone called her \"one of the greatest songwriters ever\",[2] and AllMusic has stated, \"When the dust settles, Joni Mitchell may stand as the most important and influential female recording artist of the late 20th century\".[1]\n\nCanadian-American singer-songwriter (born 1943)\n\nQuick facts: Joni Mitchell CC, Born, Other names, Cit... ▼\n\nMitchell began singing in small nightclubs in Saskatoon and throughout western Canada, before moving on to the nightclubs of Toronto. She moved to the United States and began touring in 1965. Some of her original songs (\"Urge for Going\", \"Chelsea Morning\", \"Both Sides, Now\", \"The Circle Game\") were recorded by other folk singers, allowing her to sign with Reprise Records and record her debut album, Song to a Seagull, in 1968.[3] Settling in Southern California, Mitchell helped define an era and a generation with popular songs like \"Big Yellow Taxi\" and \"Woodstock\". Her 1971 album Blue is often cited as one of the best albums of all time; it was rated the 30th best album ever made in Rolling Stone's 2003 list of the \"500 Greatest Albums of All Time\",[4] rising to number 3 in the 2020 edition.[5] In 2000, The New York Times chose Blue as one of the 25 albums that represented \"turning points and pinnacles in 20th-century popular music\".[6] NPR ranked Blue number 1 on a 2017 list of Greatest Albums Made By Women.[7]\n\nMitchell began exploring more jazz-influenced ideas on 1974's Court and Spark, which featured the radio hits \"Help Me\" and \"Free Man in Paris\"[8] and became her best-selling album. Mitchell's vocal range began to shift from mezzo-soprano to that of a wide-ranging contralto around 1975.[9][10][11] Her distinctive piano and open-tuned guitar compositions also grew more harmonically and rhythmically complex as she melded jazz with rock and roll, R&B, classical music and non-Western beats. Starting in the mid-1970s, she began working with noted jazz musicians including Jaco Pastorius, Tom Scott, Wayne Shorter, Herbie Hancock, and Pat Metheny as well as Charles Mingus, who asked her to collaborate on his final recordings.[12] She later turned to pop and electronic music and engaged in political protest. She was awarded a Lifetime Achievement Award at the 44th Annual Grammy Awards in 2002.[13]\n\nMitchell produced or co-produced most of her albums and designed most of her own album covers, describing herself as a \"painter derailed by circumstance\".[14] A critic of the music industry, she quit touring and released her 17th and last album of original songs in 2007. She would give occasional interviews and make appearances to speak on various causes over the next two decades, though the rupture of a brain aneurysm in 2015 led to a long period of recovery and therapy. A series of retrospective compilations were released over the time period, culminating in the Joni Mitchell Archives, a project to publish much of Joni's unreleased material from her long career. She returned to public appearances in 2021, accepting several awards in person, including a Kennedy Center Honor in 2021.[15] She performed live for the first time in 9 years, with an unannounced appearance at the June 2022 Newport Folk Festival, and is scheduled to perform a headline show on June 10, 2023."}, {"url": "https://www.encyclopedia.com/people/literature-and-arts/music-popular-and-jazz-biographies/joni-mitchell", "page_content": "Singer, songwriter, guitarist\n\nStruck Down by Polio\n\nBanging on Stardom’s Door\n\nRecognition in the 1990s\n\nPolio Returns\n\nSelected discography\n\nSources\n\nThe pop arena is a harsh world, really, “mused Joni Mitchell in an interview with Nicholas Jennings for Maclean’s. ” It moves you up and down arbitrarily, regardless of the quality of your work. “Mitchell’s comments reflect the sometimes bittersweet nature of her long and varied musical career. Hailed by the New Rolling Stone Record Guide as” the most significant of the confessional singer/songwriters”after the release of her first few albums, Mitchell saw her critical and popular audience trickle away during the mid-1970s and 1980s. Yet by the mid-1990s she had come full circle, boosted by the strength of two new albums and a critical reevaluation of much of her ’70s output.\n\nMitchell was born Roberta Joan Anderson on November 7, 1943, in a remote town on the cold, windswept plains of northwestern Canada. The artist remembers where her family lived in the hardscrabble hamlets of Alberta, bereft of creature comforts. “Every house was weathered-out and derelict-looking with no paint on it,” she told Billboard contributor Timothy White. “Drinking water was delivered, and bathing water was captured off the eaves of the houses. The only recreation I had was waving from our living-room picture window in Maidstone to the steam locomotive that blew its whistle at the bend in the track as it entered town—but at least that gave me a curiosity about going places.”\n\nMitchell’s childhood, though, was a troubled one, for she was beset by a series of ailments that battered her small body. “At three my appendix burst, and they rushed me to the hospital,” she told White. “Then I had German measles and red measles, one of which nearly killed me. At eight I had chicken pox and scarlet fever, plus the arbitrary tonsillitis.” The darkest shadowthatfell over her childhood, though, was polio, and as she indicated to Vogue writer Charles Gandee in 1995, the specter of that disease continues to haunt her. “I had polio at the age of nine. My spine was twisted up like a train wreck. I couldn’t walk. I was paralyzed. Forty years later it comes back with a vengeance. It’s like multiple sclerosis. It means your electrical system burns out and your muscles begin to atrophy. It means impending paraplegia.”\n\nAfter an excruciatingly painful recovery, Mitchell attended high school. Her mediocre academic performance was offset to some degree by her blossoming passion for music, painting, and art. “I was always the school artist,” she told People contributor Michael Small. “I did the backdrops for plays [and] illustrated the yearbook and the school newspaper.” After graduating from high school, she enrolled at the Alberta College of Art in\n\nFor the Record …\n\nBorn Roberta Joan Anderson, November 7, 1943, in Fort Macleod, Alberta, Canada; daughter of William A. (a grocery store manager) and Myrtle M. (a teacher; maiden name, McKee) Anderson; married Chuck Mitchell (a musician), June 1965 (divorced c. 1967); married Larry Klein (a musician and producer), 1982 (divorced 1992); children: one daughter. Education: Attended Alberta College of Art, Calgary, Alberta.\n\nWorked as a singer in folk clubs while living in Toronto, Detroit, and New York City, 1964-69; released first album, Joni Mitchell, 1968; first chart single, “Big Yellow Taxi,” released in 1970 on Ladies of the Canyon; released Blue, 1971; turned increasingly to jazz-influenced work, late 1970s; returned to public performance after six years, 1994.\n\nSelected awards Grammy Award for best folk performance, 1970, for Clouds; two Grammy Awards (including best pop album), 1995, for Turbulent Indigo; Orville H. Gibson Award, 1995; Billboard Century Award, 1995; Polar Music Prize, 1996.\n\nAddresses: Record company —Reprise Records, 3300 Warner Blvd., Burbank, CA 91510.\n\nCalgary. She left Calgary a year later and headed east, eventually landing in Toronto. Shortly after Mitchell made her first tentative appearances on the city’s fledgling folk music circuit, an unplanned pregnancy proved to be a jarring interruption in her life. “I was twenty,” she told White, “and it was a crush with a fellow painter, and I got pregnant immediately. To be pregnant and unmarried in 1964 was like you killed somebody.” She subsequently met Chuck Mitchell, an older folksinger, who said he would “take us on,” she said in her interview with Gandee. “I was kind of railroaded…. We were never suitable. I went down the aisle saying, ‘I can get out of this.’”\n\nThe couple, who married a month after they met, subsequently took up residence in Detroit, but the marriage disintegrated within about two years. Emotionally drained and financially bare, Mitchell also gave up her daughter for adoption. “I’ve never seen the child since, although I’ve always thought of her,” she later told White. “For years I didn’t talk about this because of my parents, although I did leak little things, little messages into my songs for the child, just to let her know I was thinking about her.”\n\nMitchell moved to Manhattan, where she threw herself into establishing a place on the local music scene. Her reputation grew, but work was still sometimes elusive. “The year Dylan went electric (1965) the folk clubs started closing all over the country,” she told Susan Gordon Lydon in the New York Times. “It was like an epidemic.…In those days, if you only played acoustical guitar, club owners treated you as though you were a dinosaur.”\n\nShe persevered, though, and with the help of Byrds vocalist David Crosby she eventually signed with Reprise Records. Her debut album, 1968’s Joni Mitchell, was produced by Crosby, although Mitchell concedes that his influence was actually fairly minimal. The album, a simple affair that featured Mitchell’s soaring singing voice and skillful acoustic guitar work, garnered immediate attention. Clouds, her second album, explored the same terrain as her first work: romanticism, emotional confusion, and other affairs of the heart.\n\n“A major impetus for Mitchell’s work at this time,” contended Dave Laing and Phil Hardy in the Encyclopedia of Rock, “was the struggle to make sense of a personal failure to find lasting satisfaction in any of her well-publicized relationships.” Mitchell’s 1970 release, Ladies of the Canyon, showed that she was continuing to develop musically. While her daring vocals and crisp acoustic guitar playing continued to anchor her sound, additional instrumentation effectively complemented several of the album’s songs.\n\nWith 1971’s Blue, Mitchell’s already shining critical reputation took another giant step forward. The album featured such classics as “The Last Time I Saw Richard,” “California,” “This Flight Tonight,” and the title track, and stunned reviewers marveled at the honesty, longing, and intelligence that underpinned the entire effort. Rolling Stone reviewer Timothy Crouse wrote that on Blue, Mitchell has “matched her popular music skills with the purity and honesty of what was once called folk music and through the blend she has given us some of the most beautiful moments in recent popular music.” White later commented that “the resoundingly intimate Blue stretched the tape measure for unfathomed personal inquiry until it snapped free of the spool. The deeper Mitchell delved, the higher her untethered singing flew, trembling with tortured liberty.”\n\nThe subject matter of Mitchell’s songs, though—and their inevitable coupling to her romantic relationships with such well-known artists as Jackson Browne, James Taylor, and Graham Nash—led some magazines to pay greater attention to her personal life than her musical output. Mitchell began to explore different musical directions and less introspective subjects for her songs, only to find her visibility in the entertainment world slowly ebb away. Albums such as For the Roses (197’2), which featured the hit “Turn Me On, I’m a Radio” ; Court and Spark (1974), which included “Help Me” and “Free Man in Paris” ; and Hejira (1976) received hearty words of appreciation, but others were treated less kindly. Rolling Stone even called Mitchell’s 1975 release, The Hissing of Summer Lawns, the worst record of the year.\n\nBold and creative experiments, such as her tribute to dying jazz great Charles Mingus on Mingus (1979), met with indifference or critical barbs from many quarters, and by the early 1980s Mitchell’s popularity had fallen significantly. “I lost some people when I went from singing / to singing you. I lost some people when I added a band,” she explained to Gandee. “Another thing was that in the eighties we moved into a particularly unromantic period in music. Videos had just begun, and they had a tendency to feature cold women with dark lipstick and stilettos grinding men’s hands into the ground. It was an antilove period, and my work—Wild Things Run Fast, in particular—was a joyous celebration of love, which basically made people sick.” Ironically, though, her fading in the public eye served to liberate Mitchell. “Once I realized that I had fallen from favor, I decided to stretch out…. I can’t pander to public opinion. Besides, the fact is no matter how talented you are, you fall out of favor.” Indeed, Mitchell never appeared to question the value of her output; as she told Gandee, Bob Dylan and Leonard Cohen are “my real peers. We’re the poets of that generation.”\n\nIn 1982 Mitchell married record producer Larry Klein, and over the course of the decade she released three fine albums on Geffen Records— Wild Things Run Fast, Dog Eat Dog, and Chalk Mark in a Rain Storm— that were largely ignored. Undeterred by the tepid reception of each album, Mitchell continued to explore new musical avenues while also indulging her lifelong passion for painting. (A number of Mitchell’s albums feature her own artwork on covers or inner sleeves.) Night Ride Home, Mitchell’s 1991 release, received warm reviews. The album seemed to spark a slow stir in the music community as some people questioned the songwriter’s long exile in the musical wilderness. Three years later, Mitchell unveiled Turbulent Indigo, the seventeenth album in her long and varied career. Entertainment Weekly contributor Linda Sanders echoed the sentiments of many when she called the album “the distilled essence of everything she’s done before.” As critics raved about the musical and lyrical depth of the album, Mitchell assumed a visibility in the industry she had not seen since the mid-1970s.\n\nIn retrospect, critics returned to Mitchell’s earlier albums, and some began to give greater thought to her place in pop music history. Sanders, for example, conceded that “all she’s really managed to deliver in the course of sixteen albums is one of the most vivid and delicious chronicles of a woman’s life that’s ever been produced in any medium anytime, anyplace.” In Guitar Player, Martin Simpson called her “perhaps the most influential female guitarist of the century,” and a huge influx of young female singer/songwriters cited the impact of Mitchell’s music on their lives. When asked about many of these artists, though, Mitchell is blunt. “There are dozens of them, but I don’t hear much there, frankly,” she remarked to Simpson. “When it comes to knowing where to put the chords, how to tell a story, and how to build to a chorus, most of them can’t touch me.”\n\nThe early 1990s were transitional years for Mitchell in many ways. While recognition of her talent ascended once again, her personal life was rocked by several blows. She divorced Klein in 1992, though she noted in her interview with Gandee that their relationship endures, albeit in a different form. “We’ve come through this thing. It’s poignant sometimes. We went out the other night. He was playing with Shawn Colvin, and they invited me to come down and sit in. You have to readjust. I imagine that it will be a lifetime friendship.”\n\nMitchell’s childhood bout with polio also returned to haunt her. She admitted to White in 1995 that she suffers from post-polio syndrome, a malady wherein “the wiring in my central nervous system is overtaxed, and when I don’t conserve my energy, the disease manifests itself in loss of animation. Last year and the year before I was experiencing a lot of muscle aches, joint aches, and extreme sensitivity to temperature changes.”\n\nDespite her physical difficulties, however, Mitchell has launched a cautious return to concert performing. In 1994 she performed at the Edmonton Folk Festival, playing her first full-length set in six years before an appreciative audience of fans and relatives. “It had a homecoming kind of feeling,” remarked Mitchell in Guitar Player. She has turned to a variety of medical treatments to stave off her illness, and she remained defiant about her chances in the mid-1990s. “The polio survivor is a stubborn creature. I’m in good spirits, and high spirits is how I beat it before,” she told Gandee.\n\nIn the mid-1990s Mitchell received several notable awards, further indication that she had come full circle in the eyes of the music community. She won two Grammys (including one for best pop album) for Turbulent Indigo and the 1996 Royal Swedish Academy of Music’s Polar Music Prize. Late in 1995, Mitchell was named the recipient of Billboard magazine’s Century Award. The magazine cited Mitchell as particularly deserving of the honor, a sentiment echoed by award presenter Peter Gabriel. In his introduction of Mitchell during the award ceremony, Gabriel noted: “This writer’s work has been a regular inspiration…. With her melodies, harmonies, guitar tunings, lyrics, extraordinary voice, and arrangements, she has continuously and courageously experimented, putting substance before style, passion before packaging, and all the time creating wonderful pictures with her songs…. When I think of her music, I think of imagination, invention, intelligence, and most important, a lot of soul.”\n\nJoni Mitchell, Reprise, 1968.\n\nClouds, Reprise, 1969.\n\nLadies of the Canyon, Reprise, 1970.\n\nBlue, Reprise, 1971.\n\nFor the Roses, Asylum, 1972.\n\nCourt and Spark, Asylum, 1974.\n\nMiles of Aisles, Asylum, 1974.\n\nThe Hissing of Summer Lawns, Asylum, 1975.\n\nHejira, Asylum, 1976.\n\nDon Juan’s Reckless Daughter, Asylum, 1977.\n\nMingus, Asylum, 1979.\n\nShadows and Light, Asylum, 1980.\n\nWild Things Run Fast, Geffen, 1982.\n\nDog Eat Dog, Geffen, 1985.\n\nChalk Mark in a Rain Storm, Geffen, 1988.\n\nNight Ride Home, Geffen, 1991.\n\nTurbulent Indigo, Reprise, 1994.\n\nHits, Reprise, 1996.\n\nMisses, Reprise, 1996.\n\nBooks\n\nHardy, Phil, and Dave Laing, Encyclopedia of Rock, Schirmer Books, 1988.\n\nMarsh, Dave, and John Swenson, New Rolling Stone Record Guide, Random House, 1983.\n\nPeriodicals\n\nBillboard, December 9, 1995; December 16, 1995.\n\nEntertainment Weekly, March 1, 1991.\n\nGuitar Player, February 1995, p. 55.\n\nMaclean’s, June 1974; October 31, 1994.\n\nNew York Times, April 20, 1969; November 7, 1982.\n\nPeople, December 16, 1985.\n\nRecord World, March 6, 1976.\n\nRolling Stone, August 5, 1971; October 15, 1992; December 15, 1994.\n\nTime, November 28, 1994.\n\nVogue, April 1995, p. 191.\n\n—Kevin Hillstrom"}], "Chaka Khan is a music artist.": [{"url": "https://www.biography.com/musicians/chaka-khan", "page_content": "(1953-)\n\nWho Is Chaka Khan?\n\nBorn on March 23, 1953, in Great Lakes, Illinois, singer Chaka Khan achieved great success as part of the soul-funk band Rufus, delivering hits like \"Tell Me Something Good,\" \"Sweet Thing\" and \"Hollywood.\" She embarked on a solo career in the late '70s and made waves on the charts again with tunes like \"I'm Every Woman,\" \"I Feel for You,\" \"This Is My Night\" and \"Through the Fire.\" A phenomenal vocalist, Khan has won numerous Grammy Awards.\n\nEarly Singing Career\n\nChaka Khan was born Yvette Marie Stevens on March 23, 1953, in Chicago, Illinois. Known for her powerful voice, her great volume of curly hair and her charismatic stage presence, Khan first exploded on to the music scene in the 1970s. She formed her first group, the Crystalettes, with her sister Yvonne when she was only 11 years old. Some of Khan's early musical heroines include Billie Holiday and Gladys Knight. The sisters later became involved in the Afro-Arts Theater and started another musical group known as the Shades of Black.\n\nIn 1969, Khan became active in the Black power movement, joining the Black Panther Party and working with the organization's free breakfast program for children. Around this time, she took on a new name: Chaka Adunne Aduffe Yemoja Hodarhi Karifi. She also said goodbye to her formal education, dropping out from high school.\n\nBig Hits With Rufus\n\n'Rufus'\n\nIn the early 1970s, after performing with a few other groups, Khan joined the band Rufus, which had a strong R&B and funk sound. The world got its first taste of Khan’s powerhouse vocals when the group released its eponymous debut album in 1973, which spawned such modest hits as \"Whoever's Thrilling You\" and \"Feel Good.\"\n\n'Rags to Rufus,' 'Tell Me Something Good'\n\nThe follow-up album, Rags to Rufus (1974), was a smash commercially and critically. Stevie Wonder penned for the band the hit single \"Tell Me Something Good,\" which sold more than a million copies. The group also scored a Grammy Award for best R&B Vocal Performance by a Duo, Group or Chorus for the song.\n\n'Sweet Thing,' 'Ain't Nobody'\n\nRufus, which was renamed Rufus featuring Chaka Khan and then Rufus & Chaka Khan, continued to have a number of successes over the coming years. The band scored a Top 10 pop hit with the zestful \"Once You Get Started,\" and Khan helped write the single \"Sweet Thing,\" which climbed to the top of the R&B charts and was also a Top 5 pop hit. Later hits included the introspective ballad \"Hollywood,\" about the pitfalls of the famed locale, as well as the gleeful \"Do You Love What You Feel\" and the no-nonsense \"Ain't Nobody.\"\n\nSolo Albums and Songs\n\n'Chaka,' 'Naughty'\n\nWhile she recorded with Rufus until the early 1980s, Khan debuted as a solo artist in the late 1970s. In 1978 she released Chaka, which featured the No. 1 R&B hit and empowerment anthem \"I'm Every Woman,\" written by Nicholas Ashford and Valerie Simpson. Khan's second solo album, 1980's Naughty, offered the popular singles \"Clouds,\" also penned by Ashford and Simpson, and \"Papillon (aka Hot Butterfly).\" And in a twist of synchronicity, she won two Grammy Awards as a solo artist and one as a member of Rufus in 1983.\n\n'I Feel for You,' 'Through the Fire'\n\nThe next year, however, Chaka the solo artist reigned supreme. Covering a Prince song, she made major moves on the charts with \"I Feel for You,\" a Top 5 smash. Featuring one of the most famous rap cameos of all time by Melle Mel, the infectious track incorporated elements of rap, R&B and electronic dance music. It also won Khan another Grammy Award in 1984. Other hits from the album include \"This Is My Night\" and \"Through the Fire.\"\n\n'What Cha' Gonna Do for Me'\n\nDuring the 1980s and early '90s, Khan established herself as a steady presence on the R&B charts with Top 20 hits like \"What Cha' Gonna Do for Me,\" \"Got to Be There,\" \"(Krush Groove) Can't Stop the Street,\" \"It's My Party,\" \"Love You All My Lifetime\" and \"You Can Make the Story Right.\"\n\n'I'll Be Good to You,' 'The Woman I Am'\n\nThough the popularity of Khan's albums eventually declined with shifting musical trends, she still put forth critically acclaimed music. She won another Grammy in 1990 for her duet with the legendary Ray Charles on \"I'll Be Good to You,\" from Quincy Jones' 1989 Back on the Block album, and another one in 1992 for The Woman I Am. Khan also became known for her contributions to the soundtracks for the films Clockers and Waiting to Exhale, both from 1995. Later in the decade, she released the well-received Prince-produced set Come 2 My House (1998).\n\n'What's Going On,' 'ClassiKhan'\n\nIn 2002, Chaka Khan scored her eighth Grammy Award—this time for her cover of Marvin Gaye's \"What's Going On\" with the Funk Brothers. Experimenting with different musical styles, she released an album of standards with the London Symphony Orchestra, entitled ClassiKhan, in 2004.\n\n'Funk This'\n\nMaking her first original recording in years, Khan returned to the studio to create Funk This (2007), a diverse mix of songs and guests. The ballad \"Angel\" came from a poem she wrote while high years earlier, while the uptempo \"Disrespectful\" paired Khan with one of her musical protégées, Mary J. Blige. And on the cover of \"You Belong to Me,\" she sang with Michael McDonald, a former member of the Doobie Brothers. She also included a few more remakes on the album, including tracks by Prince, Jimi Hendrix and Joni Mitchell.\n\n'Hello Happiness'\n\nKhan returned to the airwaves in 2016 with the single \"I Love Myself,\" with portions of sales going to the domestic abuse organization Face Forward as well as STOMP Out Bullying. She also sang with two of her siblings on that year's dance track \"House of Love,\" by FOMO. In 2018, Khan released \"Like Sugar,\" which became the first single from her 2019 album, Hello Happiness.\n\nTheater and Book\n\nWhile living in London in the 1990s, Khan branched out into acting, appearing as Sister Carrie in the musical Mama, I Want to Sing.\n\nIn 2003, the artist shared her life story with the world in her autobiography, Chaka! Through the Fire. In it, she detailed her career as well as her years of substance abuse. Chaka described the loneliness she felt while touring. She was often away from her two children, which only compounded her sadness and guilt. Chaka told JET magazine, \"I think a big part of my drug thing was escaping from those feelings.\" She also revealed that she had a history of bad luck when it came to relationships.\n\nIn 2008, Chaka Khan made her Broadway debut and appeared as the character Sofia in the musical The Color Purple, based on the book by Alice Walker.\n\nPersonal Life and Rehab\n\nTwice married and divorced, Khan gave birth to daughter Milini in 1973 and son Damien in 1979.\n\nToward the end of the 1990s, she established the Chaka Khan Foundation, which provides education programs to at-risk children and helps low-income families with autistic children.\n\nIn 2004, Khan faced a personal tragedy when Damien was arrested and charged with murder. He and a friend had been fighting in her home when Damien accidentally shot the other man. Rallying her family together, Khan attended the trial and testified on her son's behalf. He was found not guilty in 2006.\n\nIn July 2016, Khan announced that she and her sister Yvonne (aka Taka Boom) would be entering rehab due to prescription drug addictions, having been moved to do so after the overdose-related death of Prince.\n\n\"The tragic death of Prince has had us both rethinking and reevaluating our lives and priorities,\" Khan said in an official statement. \"We knew it was time to take action to save our lives. My sister and I would like to thank everyone for their support, love and prayers.\"\n\nQUICK FACTS\n\nName: Chaka Khan\n\nBirth Year: 1953\n\nBirth date: March 23, 1953\n\nBirth State: Illinois\n\nBirth City: Chicago\n\nBirth Country: United States\n\nGender: Female\n\nBest Known For: Grammy Award-winning singer Chaka Khan, formerly with the band Rufus, has an array of hit songs like \"I'm Every Woman,\" \"Ain't Nobody\" and \"Through the Fire.\"\n\nIndustries\n\nMusic\n\n\n\nFilm\n\n\n\nCivil Rights\n\n\n\nPop\n\n\n\nTheater and Dance\n\nAstrological Sign: Aries\n\nOccupations\n\nSongwriter\n\n\n\nSinger\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION"}, {"url": "https://singersroom.com/artist/chaka-khan/", "page_content": "Chaka Khan is an icon of modern music and one of the most influential artists in history. Her unique voice, style and sound have evolved over decades while still remaining true to her musical roots. Chaka Khan’s discography features some of the greatest hits in R&B, funk and soul – spanning generations with its timelessness.\n\nThe Queen of Funk has seen massive success throughout her career, ranging from multiple Grammy awards to Billboard chart-topping singles like “Ain’t Nobody” and “I Feel For You.” Despite being born into a world that was often hostile towards women making their own way in music, Chaka persevered to become one of the most notable female vocalists ever.\n\nIn this article we explore the incredible story behind Chaka Khan’s illustrious career: From early beginnings as lead singer for the group Rufus to becoming an international superstar who continues to influence many genres today. So let us dive deeper into her journey – from Chicago streets all the way up to worldwide fame!\n\nBackground\n\nChaka Khan is a legendary singer, songwriter, and producer whose career has spanned over four decades. Born Yvette Marie Stevens in 1953 in Chicago, Illinois to Charles Stevens and Sandra Coleman, Chaka Khan’s musical journey began when she joined her first group at the age of 11.\n\nKhan released her debut album “Chaka” in 1978 which included hits like “I’m Every Woman,” “We Got Each Other,” and “Fate.” The success of this album helped launch her solo career with numerous Grammy-winning albums and singles throughout the 1980s. Her music was heavily influenced by funk and soul genres as well as jazz fusion elements from artists such as Miles Davis. She continued to record and perform into the 1990s and 2000s including collaborations with other popular musicians.\n\nAside from singing, Chaka Khan also founded two charities: the Chakakhan Foundation for Youth Education & Music (CFFYEM)in 1991, an organization dedicated to providing music education opportunities for young people; and Home Sweet Home International (HSHI), which works to provide housing assistance for families struggling with homelessness or poverty.\n\nThroughout her impressive career, Chaka Khan has remained one of the most influential voices in contemporary R&B music. With nearly 50 years under her belt, she shows no signs of slowing down anytime soon. As always true to herself musically, Chaka Khan continues to inspire generations all around the world through her iconic voice and timeless legacy.\n\nEarly Career\n\nAs her career in music began to take off, Chaka Khan quickly became one of the most successful artists in contemporary R&B. Her unique blend of soul, funk, and jazz fusion gained international attention and she soon established herself as a force to be reckoned with. From 1978-1980 she released four studio albums which included hits like ‘I’m Every Woman,’ ‘Ain’t Nobody’ and many more. These songs allowed her to begin touring around the world while also earning multiple Grammy awards along the way.\n\nKhan’s success during this period was due in part to her ability to craft powerful messages through her lyrics and delivery. She had an amazing range that could go from deep rich tones all the way up into higher notes for some of her ballads. This vocal prowess allowed her to tackle complex musical arrangements while still maintaining a strong sense of emotion throughout each song. Furthermore, it made Khan stand out amongst other singers on the radio at that time who were mainly focused on pop production instead of storytelling content within their music.\n\nIn addition to writing and producing hit singles, Chaka Khan also found ways to give back by founding two charities: CFFYEM (Chakakhan Foundation for Youth Education & Music) in 1991 and HSHI (Home Sweet Home International) in 2003. Both organizations offer support services such as education programs or housing assistance for those struggling with poverty or homelessness respectively. By providing people with resources they may not have access too otherwise, Khan has been able to make a positive impact on communities across the country and beyond.\n\nOverall, Chaka Khan is truly remarkable artist whose influence goes far beyond just music alone – she uses her fame & platform to help others achieve greatness as well. With nearly half a century behind her belt, there’s no telling what else we can expect from this legendary icon!\n\nAlbums And Singles\n\nThroughout her career, Chaka Khan has released a vast assortment of albums and singles that cemented her place in music history. Spanning from 1978 up until now, the variety of genres she’s explored is truly remarkable. From classic R&B numbers to funk-infused tunes, there’s something for everyone on any one of her records.\n\nChaka Khan began with solo releases like ‘I’m Every Woman’ and ‘Ain’t Nobody,’ but as time went on she collaborated with other artists on projects such as Heaven Must Be Like This (1981) with The Peech Boys or I Feel For You (1984) featuring Melle Mel & Grandmaster Caz. With each new release it was evident just how versatile and talented an artist she really was; Khan continued to push boundaries by experimenting with different sounds while still maintaining her signature style throughout.\n\nIn recent years, Chaka Khan hasn’t slowed down either – releasing several studio albums including Hello Happiness (2019) which features production work from some of today’s hottest producers. Not only that, but she also continues to tour across the globe performing fan favorites alongside new tracks off her latest album. She even won a Grammy award in 2019 for Best Traditional R&B Performance! It goes without saying that Khan remains a major influence within contemporary music today.\n\nFrom humble beginnings right here in Chicago all the way up to international fame & success, this musical icon shows no signs of stopping anytime soon. Her discography stands out as a testament to her longevity and commitment towards creating quality music for fans around the world – proving once again why Chaka Khan will always be remembered as one of the greatest musicians ever known!\n\nMusical Style And Influences\n\nChaka Khan’s musical style is one that has been described as having a soulful essence, while also being heavily rooted in funk and disco. She often blends elements of these genres with jazz, gospel, classical music, and hip-hop to create her signature sound. Her vocal range allows for an impressive amount of flexibility when it comes to performing various styles of songs – ranging from soft ballads to energetic dance numbers. Additionally, she’s renowned for her improvisational skills which really help bring any track to life!\n\nWhen it comes to musical influences, Chaka Khan cites the likes of Aretha Franklin and Stevie Wonder among others as major inspirations. But interestingly enough, she mentions that some lesser known artists actually had more influence on her than those bigger names: “The first artist I was ever influenced by was James Brown…[I]t wasn’t until later on that people like Aretha or Marvin Gaye started popping up into my headspace”. This goes to show just how much variety there is within her music; she takes inspiration from all sorts of sources and fuses them together in order to make something truly special.\n\nKhan has always strived towards creating meaningful works that push boundaries whilst still staying true to herself. Despite facing adversity throughout the years (particularly during the early days of her career), she never let this deter her ambition – instead using it as motivation to continue doing what she loves most – making amazing music!\n\nAwards And Recognition\n\nThroughout her career, Chaka Khan has been the recipient of many awards and accolades. Her standout achievements include 10 Grammy Awards (including a Lifetime Achievement Award) and multiple American Music Awards. She’s also won numerous other awards such as Soul Train Music Awards, NAACP Image Awards, MOBOs, ASCAP Pop Music Awards and BMI Urban Awards. These accomplishments speak to how much she is respected by both peers in the music industry as well as fans across the world.\n\nKhan has earned an impressive reputation for her boundary-breaking work that defies genre conventions while simultaneously honoring them with respect. This is why artists like Madonna have cited her as one of their biggest influences – they recognize that not only does she create chart-topping hits but also sets trends musically that others can follow suit on. It’s this kind of influence that really attests to just how successful Chaka Khan truly is!\n\nThe recognition she’s received over the years isn’t limited to just awards – it spans from being inducted into the Rock & Roll Hall of Fame to having a street named after her in Los Angeles. There are countless tributes throughout the world to commemorate what she has achieved in her lifetime; from documentaries about her life story to tribute concerts celebrating her legacy. In short, Chaka Khan’s impact on music will continue long after we’re gone!\n\nCollaborations\n\nChaka Khan’s influence in the music industry doesn’t just extend to her solo work, but also to the many collaborations she has been part of over the years. From Michael Jackson to Aretha Franklin and more recently, Mary J Blige, Chaka Khan has worked with some of the greatest names in pop and R&B. Every collaboration offered a unique sound that resulted in hit songs like ‘I’m Every Woman’ and ‘Disrespectful’.\n\nKhan’s ability to combine different genres such as funk, soul, jazz, disco, rock and hip-hop into one cohesive sound is what makes these collaborations so special. By working with other artists outside of her own traditional boundaries, it allowed her sound to reach new audiences while still maintaining its signature style. This fluidity between different styles was something only an artist of her caliber could pull off successfully!\n\nNot only did working on collaborative projects help grow Chaka Khan’s fan base across diverse communities – it also had a positive impact on those same people. Her willingness to take risks and push musical boundaries inspired creativity among aspiring musicians who wanted their voices heard too. In essence, every time Khan collaborated with another artist, it opened up doors for others looking to break into the industry.\n\nThis speaks volumes about both Chaka Khan’s artistry as well as her compassion for future generations. She recognized how crucial it was for all kinds of talent from various backgrounds be given the opportunity to thrive in music; something which she ultimately helped make possible through her boundary-pushing collaborations!\n\nActing Career\n\nBeyond her music career, Chaka Khan also had a successful acting career. She demonstrated her range and versatility with roles in various film and television projects throughout the years. From appearing as herself on sitcoms such as ‘Living Single’ to playing an influential role in the movie The Color Purple, Khan proved that she was more than just an artist – she was an actress too!\n\nHer ability to move between genres allowed her to participate in a wide variety of projects from both big-budget productions like Eddie Murphy’s Coming To America to smaller indie films like Lemonade Joe. Whether it was drama or comedy, Chaka always found a way to make every part unique and memorable.\n\nKhan also ventured into voice work by providing the vocals for characters in popular animated shows like ‘The Proud Family’. Her distinctive style added something special to each project which is why audiences loved hearing her take on different roles. This further showed how multi-talented she really was!\n\nNo matter what kind of project she took on, one thing remained constant: Chaka Khan’s passion for artistry shone through everything she did. It didn’t matter if it was singing, dancing, or performing; when she put all of these elements together, it made for some truly magical moments on screen – ones we still get to enjoy today!\n\nActivism And Philanthropy\n\nChaka Khan is not only known for her incredible music and acting career, but she has also made a name for herself as an activist and philanthropist. Her passion for justice led her to become involved in various causes that focus on racial equality, education reform, and raising awareness of social issues. She was even appointed by President Obama to serve on the Advisory Council on Historic Preservation!\n\nKhan’s activism work isn’t just limited to politics – it extends into her philanthropy too. Along with being an ambassador for UNICEF, she founded the Chaka Khan Foundation which helps empower children through educational programs. The foundation provides scholarships to students from underserved communities so they can pursue higher education opportunities without facing financial barriers.\n\nIn addition to these initiatives, Khan also uses her platform to promote healthy living habits among young people. Through workshops and health seminars, she encourages kids to lead an active lifestyle while teaching them about nutrition and exercise. This further demonstrates how committed she is towards making sure everyone has access to resources that will help them reach their full potential.\n\nIt’s clear that Chaka Khan puts other people first no matter what project or cause she takes part in. With so many years of hard work dedicated to improving the lives of those around her, it’s easy to see why she continues to inspire generations today.\n\nPublic Image\n\nChaka Khan has been an iconic figure in the music industry for decades. She is known for her powerful voice, her passionate performances, and her larger-than-life personality. Over the years, she has developed a strong public image that reflects her fun-loving nature and bold fashion sense.\n\nKhan’s love of life shines through in most of her work. Her music often celebrates joyous occasions like weddings or birthdays while also touching on more serious topics such as relationships or politics. This fusion of lightheartedness and seriousness helps to create a unique sound that fans gravitate towards when they listen to her songs.\n\nWhen it comes to style, Chaka Khan sets trends rather than follows them. From sequined gowns with feathered headdresses to modern looks featuring leather jackets and statement jewelry – there is no limit to what she can pull off! Her willingness to take risks shows how confident she is in herself which makes it easier for others to express their own individualism too.\n\nOverall, Chaka Khan’s public persona is one that encourages people to be themselves without apology. Whether it’s through music, activism, philanthropy or fashion – she stands up for self-expression and living life on your own terms. With this message at its core, it’s no wonder why so many are drawn to her artistry and spirit today.\n\nPersonal Life\n\nDespite her larger-than-life public image, Chaka Khan is a person just like everyone else. Away from the spotlight, she has faced struggles and had to overcome obstacles in order to continue living life on her own terms. Through it all, she’s remained resilient and committed to creating music that speaks directly to people’s hearts.\n\nKhan was born Yvette Marie Stevens in 1953 in Great Lakes, Illinois. She began singing at an early age and eventually joined a group called “The Baby Huey Show” which allowed her to develop her vocal talent. Over time, the group went through many lineup changes before finally changing their name to Rufus & Chaka Khan. Under this banner, they released several hit songs such as “Tell Me Something Good” and “Sweet Thing” – making them one of the most successful acts of the 1970s funk scene.\n\nChaka Khan has been married twice; first to Hassan Khan from 1970–1971 and then later with Richard Holland from 1976–1982. In between these marriages, she also adopted two children who are now grown adults. This experience gave her insight into motherhood while also providing an opportunity for growth by stepping outside of what society expected of women during that time period.\n\nIn addition to being a singer/songwriter, Chaka Khan is also passionate about philanthropy and activism work – particularly when it comes to advocating for marginalized groups or those affected by poverty or civil injustice. Her message of love continues to resonate with listeners around the world today as she encourages us all to stay strong no matter our circumstances.\n\nRecent Projects\n\nThroughout her career, Chaka Khan has continued to make a lasting impression on the music industry. In recent years, she’s explored different avenues of creativity by collaborating with various artists and producers on new projects that reflect her unique style and sound. From her critically-acclaimed 2019 album Hello Happiness to her 2020 single “Like Sugar” which was featured in an Apple commercial – it’s clear that Chaka Khan is still making waves in the world of music today.\n\nKhan also continues to use her platform for good beyond just creating art. She recently partnered with organizations such as Feeding America and UNICEF USA to help those in need during these difficult times. Additionally, she can be seen speaking out against injustices or simply spreading positivity on social media platforms like Twitter and Instagram.\n\nNot only does Chaka Khan stay active musically but she also had the opportunity to appear onstage at several high profile events over the past few years including The Academy Awards, Global Citizen Festival, and BET Awards; demonstrating how much influence she has within pop culture circles today.\n\nNo matter what project she takes part in, one thing remains true: Chaka Khan will always have something worthwhile to share with us all. Whether through her powerful lyrics, uplifting messages online, or charitable contributions – we are lucky to have this icon remind us each day that love really does conquer all.\n\nLegacy\n\nChaka Khan’s influence on the music industry is undeniable. She has been a prominent figure for decades and continues to be an inspiration to many. As one of the most successful female artists of all time, Chaka Khan’s career speaks volumes about her talent, resilience, and dedication to her craft.\n\nHer songs have impacted people around the world in countless ways – from providing comfort during tough times, to celebrating happy moments with those close by. Her sound is iconic and still manages to stay relevant today despite being decades old. It’s clear that this legend will continue to shape the landscape of popular music for generations to come.\n\nIn addition to her musical success, Chaka Khan also stands out as a powerful advocate for social change and justice. Through partnering with organizations such as Feeding America and UNICEF USA, she demonstrates her commitment to helping others while raising awareness of important issues facing society today. Moreover, she uses her platform online as an opportunity to spread positivity and inspire us all when it matters most.\n\nThe legacy of Chaka Khan lives on through the hearts she’s touched over the years – both musically and personally – leaving behind a deep imprint that won’t soon be forgotten.\n\nDiscography\n\nAs a testament to her talent, Chaka Khan has released dozens of albums and singles throughout the years. From funk-pop bangers to soulful ballads, she has created an impressive discography that spans multiple genres. Let’s take a look at some of the highlights from this musical journey.\n\nIn 1978, she made waves with her debut album ‘Chaka’ which featured hits like ‘I’m Every Woman’ and ‘Life Is A Dance’. Her follow up album in 1981, ‘What Cha Gonna Do For Me’, was equally successful – boasting chart topping tunes such as ‘Ain’t Nobody’ and ‘Fate’. The late 80s saw her collaborate with Rufus on their iconic joint album ‘Masterjam’ before releasing solo efforts such as 1992’s ‘The Woman I Am’.\n\nThroughout the 90s and 2000s Chaka Khan continued to churn out hit after hit while inspiring many other artists along the way. She showed no signs of slowing down either, most recently dropping two new studio albums in 2011 – one being a collaboration with singer/songwriter Dave Koz called ‘The Best Of The Jazzmasters Series Volume 3 ft. Chaka Khan’.\n\nAt every stage of her career, Chaka Khan has crafted music that resonates deeply with listeners around the world. With so much timeless material under her belt it’s clear why she is still regarded among today’s greatest musicians.\n\nTours & Concerts\n\nChaka Khan has been performing live shows and concerts for decades. Her electrifying stage presence and passionate vocals have made her one of the most sought-after performers in music today. As a result, she’s gone on numerous tours over the years – both as part of Rufus and as a solo artist.\n\nIn 2019, Chaka Khan hit the road with ‘The Funk Fest Tour’. This critically acclaimed show saw her team up with some powerful acts like Bootsy Collins, Morris Day & The Time, Kool & The Gang and more. She also performed an incredible 4 night stint at Hollywood Bowl that year alongside MC Hammer and Patti LaBelle.\n\nBut it wasn’t just in 2019 that Chaka Khan showed off her superstar status – she continues to bring crowds together all around the world every chance she gets! From Las Vegas residencies to opening for big names like Stevie Wonder, Chaka never disappoints when it comes to giving fans unforgettable performances.\n\nWhether through her albums or live shows, it is clear why Chaka Khan remains a beloved musical icon even today: she always puts on an amazing performance no matter where or when!\n\nTrivia & Interesting Facts\n\nChaka Khan has accomplished a lot throughout her illustrious career in music, and there is so much more to learn about this musical powerhouse. Here are some interesting facts that will give you an even deeper appreciation for all she’s done:\n\nFirst, Chaka Khan was the first female artist ever to have three platinum albums, proving her commercial success and staying power within the music industry. Additionally, she holds the record for most Grammys won by a female R&B singer with 10 awards under her belt!\n\nSecond, Chaka Khan has earned numerous honorary titles over the years such as ‘Queen of Funk’ and ‘Empress of Soul’ – both attesting to her immense talent and influence on modern soul music. She also holds an impressive seven-octave vocal range – making her one of the best singers alive today.\n\nFinally, it’s not just in professional arenas where Chaka Khan dominates; she is also an active philanthropist who works tirelessly to help those in need through various charities. A true humanitarian at heart, Chaka never fails to inspire us with her good deeds and passionate performances alike.\n\nFrequently Asked Questions\n\nWhat Is Chaka Khan’s Net Worth?\n\nChaka Khan is an icon of music, having achieved unparalleled success over the course of her career. Her net worth is estimated to be around $30 million and she continues to make new fans with each passing year. But how did Chaka become so successful?\n\nChaka’s rise to fame began in the 1970s when she was a member of Rufus, the funk band that had several Top 10 hits on the Billboard charts during its heyday. From there, she went solo and released multiple hit albums throughout the 1980s and 1990s, such as I Feel For You (1984) and Destiny (1986). She also collaborated with other artists like Miles Davis and Prince on some memorable duets.\n\nKhan has received many awards for her work including eight Grammys, four American Music Awards, two MTV Video Music Awards, three Soul Train Music Awards and one BET Lifetime Achievement Award. In addition to these accolades, she was also inducted into The Rock & Roll Hall Of Fame in 2013 along with Nirvana and Peter Gabriel.\n\nThe combination of her talent plus hard work have paid off well for Khan who has been able to maintain her high net worth despite being out of the spotlight for extended periods throughout her career. It’s obvious why this singer-songwriter remains one of the most beloved figures in modern music today; even after all these years, people can still appreciate Chaka’s unique style which makes every performance feel fresh yet familiar at the same time.\n\nWhat Are Chaka Khan’s Upcoming Tour Dates?\n\nChaka Khan is an iconic singer who has been performing for decades. She continues to tour, and fans are eagerly awaiting her upcoming dates. So what’s on the horizon for Chaka?\n\nKhan recently announced a series of shows in Europe, where she will perform some of her classic hits as well as new material from her latest album. Fans across the continent have already begun booking their tickets for these highly anticipated events. In addition to the concerts, there may be other appearances by the artist throughout 2020.\n\nThe North American leg of Chaka Khan’s tour is also expected to kick off later this year. This will bring even more opportunities for those living in America and Canada to experience one of music’s all-time greats live in concert. It’ll be a chance to hear fan favorites like “Ain’t Nobody” with fresh arrangements and energy that can only come from a live show.\n\nChaka Khan’s touring schedule promises to keep her busy over the course of 2020, so make sure you don’t miss out! Keep an eye out for announcements about venues and ticket availability closer to the time – it’ll be worth it if you can catch one of these legendary performances!\n\nWhat Charities Does Chaka Khan Support?\n\nWhen it comes to giving back and making the world a better place, Chaka Khan is no stranger. The Grammy-winning artist has long been dedicated to numerous charities that help those in need. From fighting poverty to supporting education initiatives, Chaka Khan puts her heart into helping others through various charitable organizations.\n\nAs one of the most influential women in music, she uses her influence for good by devoting time and resources to causes close to her heart. She has worked with many non-profits over the years such as Feeding America, UNICEF USA, and Habitat for Humanity International. These are just some of the ways she gives back to society on both local and global levels.\n\nIn addition to these major non-profit efforts, Chaka Khan donates money directly from her income to fund educational scholarships for students who might not otherwise have access higher education opportunities. She also supports important social justice movements like Black Lives Matter and Me Too which address systemic issues within our societies today.\n\nWith so much passion invested in improving people’s lives around the world, Chaka Khan shows us how we can all make an impact when we dedicate ourselves wholeheartedly towards something bigger than ourselves. It’s clear that she cares deeply about creating positive change in this world – one worthy cause at a time.\n\nHow Has Chaka Khan’s Sound Changed Over The Years?\n\nHow has Chaka Khan’s sound changed over the years? This question is one many music fans are interested in and it’s an interesting journey to consider. While her style is rooted in R&B, she has explored a number of different genres throughout her career.\n\nSince her debut album released back in 1978, Chaka Khan has experimented with jazz and funk elements along with soulful vocals. Her sound was further shaped by the 1980s when dance-pop production started to take hold. She embraced this new approach as well as emerging technologies such as synthesizers and drum machines. As a result, she had some of her biggest hits during this time period including “Ain’t Nobody” and “I Feel for You” which showcased her alternative edge.\n\nIn the 1990s, Chaka Khan shifted from pop sounds towards more traditional soul music that featured prominent horns and keyboards. She also began collaborating with hip hop artists such as Guru on their 1993 single “Watch What You Say” which pushed the boundaries of both genres at the time. Furthermore, she incorporated worldbeat influences into some of her songs such as “Papillon (Hot Butterfly)” off of 1992’s The Woman I Am album.\n\nThe 2000s saw Chaka Khan return to a more organic approach where live instrumentation was used instead of samples or synthesized beats. This allowed her voice to really shine through while still keeping up with modern trends such as neo-soul and electronica. In recent years, she has collaborated with EDM producers like Diplo on his 2016 EP California , embracing yet another genre change that proves just how diverse an artist she remains today.\n\nWhat Was Chaka Khan’s First Hit Single?\n\nChaka Khan is an iconic artist whose music has spanned generations. Her sound has changed and evolved over the years, but one thing remains – she’s always made great music. One of her most popular songs was her first hit single: “I’m Every Woman”.\n\nReleased in 1978, “I’m Every Woman” was a huge success for Chaka Khan and propelled her career forward into superstardom. It became an anthem for women all around the world, providing them with a sense of empowerment and strength. The song peaked at number-one on Billboard’s Hot Soul Singles Chart that year and also earned Chaka a Grammy nomination for Best R&B Vocal Performance by a Female Artist.\n\nChaka Kahn’s influence can still be felt today in modern music as many artists have covered her hit single including Whitney Houston and Christina Aguilera. Both versions were released to critical acclaim and reached the top 10 of Billboard’s Hot 100 chart; however neither could match up to Chaka Khan original version which is often regarded as the definitive version of this classic track.\n\nSince its release, “I’m Every Woman” continues to serve as an inspiration for female singers everywhere who want to make empowering statements through their lyrics. To this day it stands out among her other works, showcasing why Chaka Khan will remain one of the greatest vocalists ever heard in pop culture history.\n\nConclusion\n\nTo conclude, Chaka Khan has been a powerful force in the music industry for decades. Her net worth is estimated to be around $30 million and she continues to tour regularly, with her next performance taking place in October 2021. She also supports various charities that are important to her personally, such as The American Red Cross and UNICEF.\n\nThroughout her career, Chaka Khan’s sound has evolved from funk-oriented soul tracks like “Ain’t Nobody” to more contemporary R&B pieces. Despite this change, she still delivers amazing performances every time. From her first single “I’m Every Woman” back in 1978 to recent hits like “Like Sugar” released in 2018, Chaka Khan has shown no signs of slowing down anytime soon.\n\nChaka Khan is an icon who will continue inspiring generations of musicians long into the future. With each new song or performance she releases, we get another glimpse at why her legacy remains strong after all these years – it’s because there simply isn’t anyone else quite like Chaka Khan!\n\nNews & Headlines\n\n[rssinpage rssfeed=’https://singersroom.com/artist/chaka-khan-news/feed’ rssitems=’20’ rssdescriptionlength=”125″ rsscss=’myclassname’ rssformat=’Y:, z’]"}, {"url": "https://www.bandwagon.asia/artists/chaka-khan", "page_content": "Upcoming gigs Latest articles\n\nLinks\n\nGet artist news & updates"}, {"url": "https://www.aaemusic.com/artist/chaka-khan/", "page_content": "Chaka Khan (born Yvette Marie Stevens; 23 March 1953 - Chicago, Illinois, USA), frequently known as the \"Queen of Funk\", is a 10-time Grammy Award winning American singer-songwriter who gained fame in the 1970s as the frontwoman and focal point of the funk band Rufus.\n\nIn 1964 at the age of 11 she formed her first group, the Crystalettes. While still in high school, she joined the Afro-Arts Theater, a group which toured with Motown great Mary Wells; a few years later, she adopted the African name Chaka Khan while working on the Black Panthers' breakfast program.\n\nAfter quitting high school in 1969, Khan joined the group Lyfe, soon exiting to join another dance band, the Babysitters; neither was on the fast track to success, but her fortunes changed when she teamed with ex-American Breed member Kevin Murphy and Andre Fisher to form Rufus.\n\nDebuting in 1973 with a self-titled effort on the ABC label, Rufus was among the preeminent funk groups of the decade; distinguished by Khan's dynamic vocals, the group earned half a dozen gold or platinum albums.\n\nWhile still a member of the group in 1978, Khan embarked on a successful solo career. Her signature hits, both with Rufus and solo, include \"Tell Me Something Good\", \"Sweet Thing\", \"Ain't Nobody\", \"I'm Every Woman\", \"I Feel for You\" and \"Through the Fire\"."}, {"url": "https://www.rockhall.com/chaka-khan", "page_content": "Funk queen, rock goddess, jazz singer, disco diva – Chaka Khan embodies and transcends these. With a voice of seductive fire and sweet smoke, Khan came to prominence with the innovative funk/rock group Rufus in the 1970s. Equally ferocious and feminine, she was Rufus’ secret weapon. At a time when audiences for rock and soul were splitting into different camps, Khan’s voice and presence represented the racial and social integration at the heart of rock & roll.\n\nWith her incredible vocal range and mastery of dynamics, Chaka Khan has recorded long-lasting, powerful music for close to five decades. After Rufus’ long run of hits, Khan broke out on her own in 1978 with Ashford & Simpson’s “I’m Every Woman,” a successful mix of rock and disco. Throughout her career, Khan mastered the rhythms of every era, from funk to rock to hip-hop; she also showcased her jazz roots on albums like Echoes of an Era (1982) and ClassiKhan (2004). Her landmark solo album, 1984’s I Feel for You, featured the creative and exciting mix of funk, synth dance rhythms, and hip-hop of the Prince-penned title track and the stunning ballad “Through the Fire.” Khan continues to be one of the most prolific and eclectic singers around, covering songbook standards and soul classics to equal acclaim, and earning the 2008 Grammy for best R&B album with Funk This, her tenth Grammy win. Khan’s most recent album, Hello Happiness, was released in 2019.\n\nInspired by pioneering female artists like Aretha Franklin and Joni Mitchell, Chaka Khan remains one of the mightiest and most influential voices in music. It is impossible to imagine today’s streetwise but sensual hip-hop-soul divas without Khan’s influence paving the way for other formidable women like Mary J. Blige, Erykah Badu, and Janelle Monáe, as well as versatile, powerhouse vocalists like Sam Smith. Khan’s work has endured for decades and continues to inspire fellow artists and fans alike."}, {"url": "https://www.billboard.com/artist/chaka-khan/", "page_content": "I Feel For You Chaka Khan 3 12 Wks 26\n\nSweet Thing Rufus Featuring Chaka Khan 5 12 Wks 21\n\nMissing You (From \"Set It Off\") Brandy, Tamia, Gladys Knight & Chaka Khan 25 12 Wks 20\n\nThrough the Fire Chaka Khan 60 12 Wks 19\n\nAin't Nobody Chaka Khan 22 12 Wks 19\n\nTell Me Something Good Rufus Featuring Chaka Khan 3 12 Wks 17\n\nI'm Every Woman Chaka Khan 21 12 Wks 16\n\nI'll Be Good To You Quincy Jones Featuring Ray Charles & Chaka Khan 18 12 Wks 16\n\nYou Got The Love Rufus Featuring Chaka Khan 11 12 Wks 16"}, {"url": "https://www.laphil.com/musicdb/artists/2812/chaka-khan", "page_content": "Chaka Khan is a pop culture icon. Her distinctive voice and style have influenced generations all over the world. The 10-time GRAMMY Award-winning superstar has defined pop, soul, jazz, and funk music. For Chaka, her empowering anthem “I’m Every Woman” is more than just a song; it’s a way of life.\n\n2023 marks a milestone. Commemorating her 50th anniversary in the music industry, this golden celebration will be an experience filled with surprises and once-in-a-lifetime moments that will add to the tapestry of a groundbreaking career.\n\nIt launches with a Rock and Roll Hall of Fame Celebration that features a memorabilia installation of an extraordinary ride through Chaka’s musical journey.\n\nFor five decades Chaka has made a profound impact in the lives of millions of people around the world. With music sales and streams exceeding 70 million, Aretha Franklin proclaimed Chaka as a “one-of-a-kind, premier vocalist.” Prince, Whitney Houston, Erykah Badu, and Lizzo are just a handful of superstars who have called Chaka a major influence. She’s released 21 studio albums, 10 of which were certified gold and platinum by the Recording Industry Association of America (RIAA).On the Billboard charts, Chaka has racked up an impressive 10 #1 singles. “Woman Like Me” released in 2022, promoted self-respect for all women and encouraged them to live in their own truth.\n\n“Someone needs to be a voice that they can listen to and maybe see life differently and see themselves differently,” Chaka says.\n\nGrowing up in Chicago, Chaka learned to trust her instincts and follow her dreams. Early on, she caught the attention of music icon Stevie Wonder, who penned her first hit single with the band Rufus, “Tell Me Something Good.” Featured on the band’s second album Rags to Rufus, the song earned Chaka her first GRAMMY Award and became a Top 5 hit on Billboard’s Hot 100chart, as well as its R&B Songs chart.\n\nRufus, fronted by Chaka, was one of the biggest acts of the 1970’s and early 1980’s. They electrified audiences and critics with their sold-out shows. Their catalog of songs including “Ain’t Nobody, “Once You Get Started,” “Sweet Thing,” “Do You Love What You Feel,” and “You Got the Love,” co-written by Chaka, have stood the test of time. As a solo artist, Chaka continued to achieve hit after hit. “Clouds,” “What’Cha Gonna Do for Me,” “Through the Fire,” and “I’m Every Woman” have become classics in pop and soul music.\n\nIn 1982, Chaka’s acclaimed jazz album Echoes of an Era featured greats Joe Henderson, Freddie Hubbard, Chick Corea, Stanley Clarke, and Lenny White. With songs from the Great American Songbook, it was a hit on Billboard’s Jazz Album chart, further displaying Chaka’s versatility and cementing her legendary status.\n\nBut it was Chaka’s rendition of Prince’s “I Feel for You” that launched her into the stratosphere. As one of the most iconic songs of the 1980’s, the chart-topping smash made history becoming the first R&B song to feature a rap, which was performed by Grandmaster Melle Mel. Chaka also lent her voice to two of the biggest GRAMMY-winning hits of 1986, Steve Winwood’s “Higher Love” and Robert Palmer’s “Addicted to Love.” Additional collaborations include George Benson, Mary J. Blige, Dizzy Gillespie, Quincy Jones, Stevie Wonder, and Miles Davis, who said of Chaka, “She sings like my horn.“\n\nIn 1995, she made her theater debut on London’s esteemed West End, starring in Mama I Want to Sing. In 2002, Chaka headlined Signed, Sealed Delivered, the critically acclaimed musical based on the music of Stevie Wonder. She then came to Broadway in 2008 in the leading role of Sophia in Oprah Winfrey’s Tony-nominated musical The Color Purple.\n\nOffstage, Chaka is a successful entrepreneur. Her line of gourmet chocolates, called Chakalates, were sold in Neiman Marcus. Her Khan Sutra, a unisex home fragrance collection, features candles and room and linen sprays.\n\nChaka has been the recipient of many accolades. Achievements include a star on the Hollywood Walk of Fame, induction into the Hollywood Bowl’s Hall of Fame, Soul Train’s Legend Award, BET’s Lifetime Achievement Award and Triumph Award, the World Music Awards Lifetime Achievement Award, the United Negro College Fund’s An Evening of Stars Tribute, and a GRAMMY Honors Award from the NARAS Chicago Chapter. In 2004, Chaka received an Honorary Doctorate of Music from the prestigious Berklee College of Music.\n\n“I’m just the sum of all of those amazing experiences,” says Chaka. “My father gave me the best advice, ‘stay humble.’ I live with that.\"\n\nHer deep commitment to humanity led her to establish the Chaka Khan Foundation. For close to 25 years, the foundation has implemented initiatives that have empowered and brought awareness to women and children at risk, particularly children with autism. Her leadership was acknowledged by the McDonald’s 365Black Awards, given to outstanding individuals who are making positive contributions that strengthen the community.\n\nChaka’s compassion comes from her own experiences. In her 2003 memoir “Through the Fire,” Chaka shared her ups and downs. Writing candidly about her substance use, she offered hope and encouragement for all. As Chaka says, “Walking through life is really walking through fire.”\n\nChaka Khan is a maverick trailblazer. A survivor. Dedicated to inspire, create art, and share her loving and radiant and spirit with the world. “Every personal experience of my life impacts my music and my art,” Chaka says. “You’ve just got to follow your own path. You have to trust your heart.”"}, {"url": "https://theminorityconnection.com/themcnxtv-blog/artist-spotlight-chaka-khan", "page_content": "Chaka Khan is an American singer, songwriter, and musician who has been entertaining audiences for over four decades. She is known for her powerful voice and unique style, which has helped to shape the landscape of music over the years. In this post, we will take a closer look at her career and the impact she has had on the industry.\n\nEarly Career:\n\nBorn on March 23, 1953, in Chicago, Illinois, Khan began her career as a member of the funk band Rufus in the 1970s. The band had a number of hits, including \"Tell Me Something Good,\" which won a Grammy Award for Best R&B Performance by a Duo or Group with Vocal.\n\nSolo Career:\n\nKhan launched her solo career in the late 1970s and went on to release a number of successful albums over the years. Her first solo album, \"Chaka,\" was released in 1978 and included the hit single \"I'm Every Woman.\" She continued to release chart-topping albums throughout the 1980s, including \"Naughty\" and \"What Cha' Gonna Do for Me.\"\n\nAlbum Discography:\n\nOver the course of her career, Chaka Khan has released 13 studio albums and a number of compilation albums. Some of her most notable albums include:\n\n\"Chaka\" (1978)\n\n\"Naughty\" (1980)\n\n\"What Cha' Gonna Do for Me\" (1981)\n\n\"Chaka Khan\" (1982)\n\n\"I Feel for You\" (1984)\n\n\"Destiny\" (1986)\n\n\"Life Is a Dance: The Remix Project\" (1989)\n\n\"Funk This\" (2007)\n\nNotable Accomplishments:\n\nChaka Khan has been recognized for her contributions to the music industry with numerous awards and honors over the years. She has won 10 Grammy Awards, including Best R&B Vocal Performance, Female, for her hit single \"I Feel for You.\" In 2019, she was inducted into the Rock and Roll Hall of Fame as a member of Rufus.\n\nLegacy:\n\nChaka Khan's impact on the music industry cannot be overstated. Her powerful voice and unique style have helped to shape the sound of R&B and funk over the years. Her contributions to the world of music have been recognized and celebrated, and her legacy will continue to inspire and influence future generations of musicians.\n\nIn conclusion, Chaka Khan's career is a testament to her talent and dedication as a musician. From her early beginnings as a member of Rufus to her iconic solo albums and hits, she has left an indelible mark on the music industry. Her legacy will continue to entertain and inspire audiences for years to come."}, {"url": "https://www.spiritmusicgroup.com/clients/chaka-khan/", "page_content": "Chaka Khan is one of the world’s most gifted and celebrated music icons. A singer, songwriter, actor, author, philanthropist, entrepreneur and activist, Chaka has influenced generations of music creators during her four decades as an artist. A 10-time GRAMMY ® Award winner, she has the rare ability to sing in a number of musical genres, including R&B, pop, rock, gospel, country, world music and classical.\n\nDuring her legendary career, Chaka has released 22 albums and racked up ten Number One songs on the Billboard charts, seven RIAA-certified gold singles and ten RIA-certified gold and platinum albums. Chaka’s recordings have resulted in more than 2,000 catalog song placements.\n\nA native of Chicago, Chaka began singing in local groups as a teen before being invited to join the group Rufus. Her fiery vocals on the group’s debut album caught the attention of music icon Stevie Wonder, who penned her first smash hit with Rufus, “Tell Me Something Good” The single from the group’s 1974 platinum-selling album, Rags to Rufus, earned Chaka her first GRAMMY ® Award. Together, Rufus and Chaka Khan racked up five RIAA-certified gold and platinum albums. In 1978, Chaka blazed onto the music scene as a solo artist with the release of the smash hit “I’m Every Woman,” written by Ashford & Simpson.\n\nChaka Khan’s steady stream of accolades include the Soul Train Legend Award (2009), the BET Lifetime Achievement Award (2006), the GRAMMY ® Honors Award from the NARAS Chicago Chapter (2006) and the World Music Award Lifetime Achievement Award (2003). Previously nominated for the Rock & Roll Hall of Fame four times – twice as a solo artist and twice with Rufus – she has been nominated again as a 2019 inductee candidate. In 2011, Chaka received a star on the Hollywood Walk of Fame and was honored with the United Negro College Fund’s An Evening of Stars Tribute.\n\nChaka’s latest body of work, Hello Happiness, a 7-track album executive produced by English production powerhouse Switch, was released on February 15th, 2019 under Diary Records/Island Records."}, {"url": "https://news.yahoo.com/chaka-khan-chuck-d-d-141643008.html", "page_content": "The entertainer’s estate announced the full lineup for the event honoring Prince, which starts Thursday at Paisley Park in Minnesota, featuring performances, panels and unreleased music.\n\nPrince’s estate has announced the full lineup and schedule for Celebration 2023, an annual convention honoring the late musician-singer-songwriter. Chaka Khan, Chuck D and D-Nice are among the acts slated to appear.\n\nThe four-day celebration, from Thursday, June 8 to Sunday, June 11, will feature performances, panel discussions, lectures and dance parties in celebration of the enduring legacy of Prince. The event takes place at Paisley Park, the Minneapolis facility where the superstar lived and recorded.\n\nL. Londell McMillan, Prince’s friend and former lawyer who is involved in the planning for Celebration 2023, said he is thrilled that the “When Doves Cry” singer’s legacy is continuing.\n\nPrince performs in 2007 at the Super Bowl XLI halftime show in Miami Gardens, Florida. The late music superstar’s estate has announced the full lineup and schedule for Celebration 2023, an annual convention honoring him. (Photo by Doug Pensinger/Getty Images)\n\n“Prince was and remains the greatest artist of all time,” McMillan said. “We are honored to gather yet again to celebrate Prince and his legacy at Paisley Park this year with many who knew him up close or adored him from afar.”\n\nKhan, a longtime friend and collaborator with Prince, is scheduled for a one-on-one conversation on Friday about her Rock and Roll Hall of Fame induction, as well the 25th anniversary of her album, “Come 2 My House,” which was recorded at Paisley Park.\n\nOn that same day, Chuck D, frontman of Public Enemy, is set to join DJ D-Nice and Doug E. Fresh to discuss Prince’s complex, multi-layered relationship with hip-hop. The Source magazine is co-presenting this panel with Paisley Park.\n\nD-Nice, known best lately for his Club Quarantine, is scheduled to host a dance party later Friday evening. Former Prince collaborator DJ Rashida is slated to lead a dance party in tribute to Prince and recently deceased Tina Turner at Club 3121 on Saturday. Also on Saturday, Stokley, lead singer of Mint Condition, and Sounds of Blackness are slated to give live performances.\n\nThroughout the entire weekend, exclusive unreleased music and video performances of Prince will be played for attendees.\n\nThe full schedule for Celebration 2023 is available on the event’s website, as are general admission tickets and VIP passes. Links and information on hotel lodging are also available at the site.\n\nTheGrio is FREE on your TV via Apple TV, Amazon Fire, Roku, and Android TV. Please download theGrio mobile apps today!\n\nThe post Chaka Khan, Chuck D and D-Nice to appear at annual Prince convention, Celebration 2023 appeared first on TheGrio."}], "Canadian Brass is a music artist.": [{"url": "https://www.thecanadianencyclopedia.ca/en/article/canadian-brass-emc", "page_content": "Canadian Brass\n\nCanadian Brass. Quintet formed in 1970 as the Canadian Brass Ensemble. Hon D MUS (Hartwick College) 1993, hon D MUS (New England Conservatory of Music) 1993, hon D LITT (McMaster) 2000.\n\nThe original members of the Canadian Brass Ensemble were Stuart Laughton (b St Catharines 19 Aug 1951) and William Phillips, trumpets; Graeme Page, french horn (b Toronto 8 Sep 1947), Eugene Watts, trombone (b Warrensburg, Mo, 22 Feb 1936, former principal trombone with the Toronto Symphony), and Charles Daellenbach, tuba (b Rhinelander, Wisc, 12 Jul 1945; PH D Eastman School of Music, Rochester 1970, former teacher at the University of Toronto). The ensemble's name was abbreviated to Canadian Brass in 1971.\n\nPersonnel Changes\n\nRonald Romm (b New York 4 Dec 1946, Juilliard School of Music graduate and former member of the Los Angeles Philharmonic) took over from Laughton at trumpet 1971-2000. In 1972 Fredric Mills (b Guelph 15 Mar 1935, Juilliard graduate and former member of the Houston and American Symphony Orchestras under Leopold Stokowski and of the National Arts Centre Orchestra) replaced Phillips, remaining until 1996. In 1983 Martin Hackleman (former member of the Calgary Philharmonic and the CBC Vancouver Orchestra, and former principal french horn with the Vancouver Symphony Orchestra) replaced Graeme Page. In 1986 David Ohanian (former member of the Boston Symphony Orchestra) replaced Hackleman, remaining until 1998.\n\nPersonnel changes continued in the trumpet and french horn positions. Later first trumpets were Ryan Anthony (2000-3) and Stuart Laughton (founding member, returned in 2003); second trumpets were Jens Lindeman (1996-2001), Joe Burgstaller (2001-4) and Charles Lazarus (joined 2005). Beginning in 2006, several individuals shared the trumpet positions, including Manon Lafrance, the first female member. Later french hornists were Chris Cooper (1998-2000), Jeff Nelsen (2000-4) and Bernhard Scully (joined 2005).\n\n1970-7\n\nCanadian Brass toured Ontario for Prologue to the Performing Arts in 1970 and became artists-in-residence with the Hamilton Philharmonic Orchestra in 1971. Though the players moved to Toronto in 1976 they continued to be members of the Hamilton orchestra until 1977. They were artists-in-residence in 1975 and 1976 at the Banff School of Fine Arts and participated in many summer programs there. The quintet performed in 1972 with the Festival Singers at the Harrogate Festival in Britain and at the Lucerne Festival in Switzerland on its first tour of Europe. It first toured Canada in 1975 and the USA in 1976. It also performed under the auspices of the Department of External Affairs at the 1974 Festival estival in Paris, at the Kennedy Center in Washington in 1976, and on tour in China (the first Western ensemble so honoured), where in 1977 it gave 10 concerts before a total of 15,000 people and played in six broadcasts over Radio Peking. Later that year it performed in England, France, Germany, Italy, and (with the Toronto Mendelssohn Choir) the USSR. It performed on CBC TV in the children's show 'Canadian Brass' (29 Mar 1976), the special 'Brass-A-Ma-Tazz' (28 Nov 1976), and the popular children's program 'Sesame Street' (1979), and it also appeared on 'The Muppet Show,' 'The Tonight Show,' and in other TV specials of its own. In the summer of 1976 it opened the Jeunesses Musicales of Canada Orford Art Centre festival.\n\n1978-86\n\nFor its Toronto Symphony debut in 1978, Canadian Brass performed Gary Kulesha's transcription of Handel's Organ Concerto in F, Opus 4, no. 4. For its New York debut, 6 Feb 1979 at the Alice Tully Hall, Lincoln Center, it premiered Flashbacks by Michael Colgrass. On other occasions it premiered works written for it by Peter Schickele (Hornsmoke, 1976; Five of a Kind, 1979). In 1976 it gave a performance before the Governor General at Rideau Hall, Ottawa. In the summer of 1980 it made its first appearances at the Edinburgh Festival. In the course of the 1980s Canadian Brass toured Japan (1980, 1982) and Europe (1985), toured throughout North America (including Alaska) and in Australia, and became the first Canadian ensemble to perform in Saudi Arabia. In 1982 it began to perform in Christmas concerts with the New Swingle Singers at Roy Thomson Hall. In 1985 it performed at tricentennial Bach festivals in Toronto and Edmonton and presented some 75 concerts in the USA, including four appearances at Carnegie Hall. Also in 1985 it performed in the film All That Bach (Rhombus Media). In 1986 it appeared at Expo '86 in Vancouver and toured Canada and the Far East, including performances in Singapore, Australia, Indonesia, and Hong Kong.\n\n1990s - Present\n\nIn 1990 Canadian Brass teamed up with the comedy troupe Royal Canadian Air Farce for a successful Canadian tour.\n\nAs of 1991 the ensemble was based in the US (its home base later reverted to Canada.) Its US and European engagements greatly outnumbered those at home. In the mid-1990s, it was performing typically 90 concerts annually in the US and 35 in Europe.\n\nCanadian Brass continue to devote time to educating young musicians. It has been resident ensemble at the University of Toronto (1998-2003) and the Music Academy of the West (California) 2001-5. In the 1990s it began publishing method books and brass quintet repertoire through the Hal Leonard Corporation.\n\nThe matched gold-plated instruments on which Canadian Brass plays were made by Renold Schilke.\n\nRepertoire and Recordings\n\nCombining disciplined performance and informal deportment with a lively and engaging sense of humour, and a repertoire encompassing several centuries and styles as disparate as renaissance and ragtime, Canadian Brass quickly established itself as one of Canada's (and indeed the world's) most popular touring groups. Its trademark stage footwear is running shoes; the members often appear in wigs and costumes for comedic effect, to aid in their stated aim: to demystify the concert experience.\n\nOver the years, Canadian Brass has pioneered the expansion of repertoire for brass quintet by creating its own arrangements of orchestral music, music for solo instruments, jazz and pop standards, and many arrangements of a surprising or experimental nature. Although the members remain first-class classical instrumentalists, they toss aside assumptions about musical boundaries, and are equally at home playing Dixieland jazz and Lennon-McCartney pop tunes. Arrangers whose work the ensemble has performed include Gary Kulesha, Howard Cable, Chris Dedrick, Luther Henderson and Don Sebesky. The cross-genre appeal of Canadian Brass has led to the establishment of many other brass ensembles.\n\nCommissioned Compositions for Brass Quintet\n\nCanadian Brass has commissioned dozens of classical and jazz works. Some of the composers it has recently commissioned works from include Malcolm Forsyth, Bramwell Tovey, William Bolcom, and Michael Kamen.\n\nThe following list shows the titles it commissioned from Canadian composers (all covered in EMC) between 1971-8 alone. The year shown indicates the year the work was premiered.\n\nBeckwith Taking a Stand 1972\n\nBeecroft 11 and 7 for 5 plus 1975\n\nBuczynski Olympics C2 1976\n\nColgrass Flashbacks 1979\n\nCrosley Variations on a French Canadian Theme 1975\n\nForsyth, M. Sagittarius 1975, Quinquefid 1977\n\nFreedman Five Rings 1977\n\nGlick Deborah 1972\n\nHayes Convolutions 1975\n\nMcCauley Miniature Overture 1973, Concerto Grosso 1973\n\nMorawetz Improvisations 1977\n\nRathburn Nomadic V 1974, Three Ironies 1975\n\nSymonds A Diversion 1971\n\nWeinzweig Pieces of Five 1976\n\nRecordings\n\nCanadian Brass has recorded prolifically since 1977. That year, as the Pucker and Valve Society Band, it extended its range with an LP of novelty compositions and arrangements by Ben McPeek. After making recordings for Boot and the CBC, it signed in 1980 with RCA, in 1982 with the CBS Masterworks label, and in 1989 with Philips. It has also recorded with Sony Classical and other labels. By 2004, Canadian Brass had released over 50 recordings (see Discography). That year, it began working with Opening Day Recordings.\n\nCanadian Brass received a Juno award in 1985 as instrumental artists of the year. Its video Home Movies was nominated for a Grammy award, as was the recording Take the \"A\" Train. Its recordings have been listed on Canadian pop radio charts (\"Very Merry Christmas\") and jazz charts (Swingtime) in addition to classical and crossover charts.\n\nRecognition and Tributes\n\nThe quintet was selected in 1981 as the ensemble of the year by the Canadian Music Council; a year earlier it received an achievement award from the Broadcast Executives Society. It delivered the SOCAN MacMillan Lecture at the University of Toronto in 1996. Canadian Brass has been recognized with awards from the US Music Educators National Conference, Switzerland's Golden Rose Festival, the Global Classical Music Poll, and other bodies eg in the US and Germany."}, {"url": "https://www.allaboutjazz.com/musicians/canadian-brass", "page_content": "Five tremendous brass musicians--each a virtuoso in his own right--form the legendary Canadian Brass. With an international reputation as one of the most popular brass ensembles today, Canadian Brass has truly earned the distinction of “the world’s most famous brass group.”\n\nFriends Chuck Daellenbach and Gene Watts first came together in 1970 to form a brass quintet--a chamber music setting not entirely new, but never before having garnered the success and storied career Canadian Brass would achieve over the next 40 years. Initially, Gene took on the role of developing new repertoire while Chuck was the moving force in marketing, publishing and managing the group. Three empty chairs were quickly filled and together, the group’s imagination and consummate musicianship elevated the art of the brass quintet to what it is today. Here was not only an opportunity to explore the possibilities of an all-brass chamber group but a challenge to bring the sound and the excitement of brass music to new audiences.\n\nThe varied Canadian Brass repertoire features brass standards as well as a wide-ranging library of original arrangements created especially for them. These include the works of Renaissance and Baroque masters, Classical works, marches, holiday favorites, ragtime, Dixieland, Latin, jazz, big band, Broadway and Christian music as well as popular songs and standards. Having started with a very limited base, Canadian Brass has created their own musical world by transcribing, arranging and commissioning more than 200 works, including critically acclaimed compositions from Michael Kamen, Luther Henderson, Bramwell Tovey, Don Gillis and more. They have transformed a previously neglected group of instruments with a limited repertoire into a versatile and vital ensemble that can play everything from Gabrieli to Gershwin! Canadian Brass is especially noted for their famous Holiday Concerts at Christmastime and was at the forefront of re-establishing Scott Joplin with today’s audiences through their research, arrangements and recordings of his “rags” and other works.\n\nWith a discography of over 90 albums and an extensive world-wide touring schedule, Canadian Brass is an important pioneer in bringing brass music to mass audiences everywhere. They have sold well over 2 million albums worldwide, with 1.2 million sold in the Nielsen Soundscan era alone (since 1991). They continue to score Billboard chart positions--most recently with their rousing recording of patriotic songs and marches, Stars & Stripes: Canadian Brass Salute America, which spent 8 weeks in the Top 25 on the Billboard Classical Chart during the summer of 2010, peaking at #2! Touring legends with an enthusiastic fan base, the Canadian Brass play to packed houses everywhere throughout the USA, Canada, Japan and Europe. They were the first brass ensemble from the West to perform in the People’s Republic of China (where they returned for a 5-city tour to great acclaim in the spring of 2010) as well as the first brass group to take the stage at the venerable Carnegie Hall. They have also performed in Australia, the Middle East, the Soviet Union and South America. On numerous occasions Canadian Brass has been invited by the Canadian Government to play for visiting heads of states, becoming one of Canada’s greatest resources and musical ambassadors."}, {"url": "https://canadianbrass.com/about/", "page_content": "With an international reputation as one of the most popular brass ensembles today, Canadian Brass has truly earned the distinction of “the world’s most famous brass group.\n\nFriends Chuck Daellenbach and Gene Watts first came together in 1970 to form a brass quintet — a chamber music setting not entirely new, but never before having garnered the success and storied career Canadian Brass would achieve over the next 40 years. Initially, Gene took on the role of developing new repertoire while Chuck was the moving force in marketing, publishing and managing the business. Three empty chairs were quickly filled and together, the group’s imagination and consummate musicianship elevated the art of the brass quintet to what it is today. Here was not only an opportunity to explore the possibilities of an all-brass chamber group but a challenge to bring the sound and the excitement of brass music to new audiences.\n\nMasters of concert presentations, Canadian Brass has developed a uniquely engaging stage presence and rapport with audiences. Each of their concerts will show the full range from trademark Baroque and Dixieland tunes to new compositions and arrangements created especially for them – from formal classical presentation to music served up with lively dialogue and theatrical effects. The hallmark of any Canadian Brass performance is entertainment, spontaneity, virtuosity and, most of all, fun – but never at the expense of the music:\n\nWhatever the style, the music is central and performed with utmost dedication, skill and excellence.\n\nWith a discography of over 130 albums and an extensive world-wide touring schedule, Canadian Brass is an important pioneer in bringing brass music to mass audiences everywhere. They have sold well over 2 million albums worldwide, with 1.2 million sold in the Nielsen Soundscan era alone (since 1991). They continue to score Billboard chart positions — like with their rousing recording of patriotic songs and marches, Stars & Stripes: Canadian Brass Salute America, which spent 8 weeks in the Top 25 on the Billboard Classical Chart, peaking at #2! Touring legends with an enthusiastic fan base, the Canadian Brass play to packed houses everywhere throughout the USA, Canada, Japan and Europe.\n\nThey have also toured Australia, the Middle East, the Soviet Union and South America. They were the first brass ensemble from the West to perform in the People’s Republic of China (where they returned for a 5-city tour to great acclaim in the spring of 2010 and several visits after this, including an appearance on Hunan TV for Chinese New Year) as well as the first brass group to take the main stage at the venerable Carnegie Hall. On numerous occasions Canadian Brass has been invited by the Canadian Government to play for visiting heads of states, becoming one of Canada’s greatest resources and musical ambassadors.\n\nMillions of television viewers have had Canadian Brass in their homes with appearances on The Tonight Show, Today and Entertainment Tonight and recently to more than 1/2 a billion viewers for Chinese New Year on China’s most popular station. They have appeared as guest artists on Evening at Pops with John Williams and the Boston Pops, Beverly Sills’ Music Around the World, numerous PBS specials, including a celebrated appearance on Sesame Street, and are frequent guests of many major symphony orchestras. Canadian Brass were the featured artists on the soundtrack to the 1988 film The Couch Trip, starring Dan Aykroyd and Walter Matthau. Consummate artists, the quintet has also created unique and interactive videos that have gained an international audience including a series of DVDs featuring the brass in concert and teaching. They are on the cutting edge of technology offering their fans multimedia airplay, downloads and youtube videos and streaming opportunities as well as digital applications with iPhone and other smartphone carriers. You can find them twittering and on Facebook with their fanbase growing daily!\n\nThe varied Canadian Brass repertoire features brass standards as well as a wide-ranging library of original arrangements. These include the works of Renaissance and Baroque masters, Classical works, marches, holiday favourites, ragtime, Dixieland, Latin, jazz, big band, Broadway and Christian music as well as popular songs and standards. Having started with a very limited base, Canadian Brass has created their own musical world by transcribing, arranging and commissioning more than 600 works, including critically acclaimed compositions from Michael Kamen, Luther Henderson, Bramwell Tovey, Don Gillis and more. They have transformed a previously neglected group of instruments with a limited repertoire into a versatile and vital ensemble that can play everything from Gabrieli to Gershwin! Canadian Brass is especially noted for their famous Holiday Concerts at Christmas time and was at the forefront of re-establishing Scott Joplin with today’s audiences through their research, arrangements and recordings of his “rags” and other works.\n\nEducation plays a key role in the story of Canadian Brass and each member is uniquely attuned to training the next generation of players. On their travels around the world, they often pause for masterclasses and are more than happy to work with students and young audiences. Canadian Brass was Chamber Quintet-in-Residence for many years at the Music Academy of the West in Santa Barbara, California, and has created an innovative brass summer course at the Eastman School of Music. Their support of education is also clearly viewed in their outreach and interaction with El Sistema, the acclaimed global music education program in Venezuela.\n\nIn conjunction with the Hal Leonard Corporation, the Canadian Brass have made available their extensive library of brass music for performers of all levels as well as learning tools. Since 1998 Canadian Brass has been a recording artist at Opening Day Entertainment Group (ODEG) (distributed by IDLA) releasing over 25 CDs on the imprint to date. Opening Day is owned and run by Chuck's wife, MB Daellenbach. Canadian Brass sheet music and recordings are available in their online store.\n\nWith four decades under their belts, Canadian Brass continues to thrill audiences around the world – and they don’t look like they are letting up anytime soon!\n\nCanadian Brass is: founding member Chuck Daellenbach (tuba), Caleb Hudson and Fabio Brum (trumpets), Achilles Liarmakopoulos (trombone) and Jeff Nelsen (horn). The Canadian Brass is represented by Opus 3 Artists and MuenchenMusik in Europe."}, {"url": "https://www.opus3artists.com/artists/canadian-brass/", "page_content": "Chuck Daellenbach Tuba\n\nFabio Brum Trumpet\n\nJoe Burgstaller Trumpet\n\nAchilles Liarmakopoulos Trombone\n\nJeff Nelsen Horn\n\nRecipe for 50 Years of Successes\n\nThe original challenge was to develop an audience for an ensemble of brass players that, at the time, had no standing in the concert world. What set Canadian Brass apart from all other performing artists in 1970 was the relentless search for repertoire that was both loved by its performers and embraced by a growing brass audience.\n\nThe musical experiences of the members along with the interests and wishes of audiences informed the programs that the group created ranging from Bach, Handel, Vivaldi, Joplin, Gershwin and Ellington, to ballet, opera and Schickele. The ensemble never ignored an opportunity to relate to its audience which brought the Brass to international attention. They were at first criticized for talking to audiences and now take pride in seeing the entire concert world embracing engagement as a fundamental element of performance.\n\nThe Brass has averaged two and a half full length recordings per year of its 52 years of existence for a total of 138 recordings. They have received a combined total of 24 Grammy and Juno nominations and won the German Echo Award for Goldberg Variations. A North American group taking Bach back to Europe and winning approval at the highest level was a crowning achievement! Most recently during the Covid era the Brass created another award-winning recording, Canadiana. The album features unique arrangements of many Canadian superstars including Joni Mitchell, k.d. lang, Bruce Cockburn, Drake and DeadMau5.\n\nEducation continues to be at the forefront of Canadian Brass’ yearly activities. There are over one million Canadian Brass quintet repertoire books in the hands of students in every country with a strong brass tradition. Between Hal Leonard Music Publishing distributing its 800 unique individual brass titles and SmartMusic now making available some 76 titles for mixed ensemble use, the Brass continues to shape the future of chamber music ventures.\n\nFor a comprehensive Canadian Brass biography, blend together the complete history of any random five musician ensemble and it will yield a year in the world of Canadian Brass. “We’ve created ballets, played Carnegie Hall, toured China during its 1977 reopening, and performed in front of five prime ministers, but most importantly performed for more than ten million friends, family and audiences worldwide so far. We did all this so we could play Bach,” says tubaist & founder Chuck Daellenbach.\n\nMay 2022"}, {"url": "https://jazztimes.com/artists/canadian-brass/", "page_content": "Five tremendous brass musicians – each a virtuoso in his own right – form the legendary Canadian Brass. Friends Chuck Daellenbach and Gene Watts first came together in 1970 to form a brass quintet – a chamber music setting not entirely new, but never before having garnered the success and storied career Canadian Brass would achieve over the next 40 years. With a vast repertoire from Baroque masters to marches, holiday favorites to Dixieland, and jazz to Broadway, Canadian Brass has created their own musical world by transcribing, arranging and commissioning more than 200 works.\n\n\n\nWith a discography of over 90 albums and an extensive world-wide touring schedule, Canadian Brass is an important pioneer in bringing brass music to mass audiences everywhere. They have sold over one million albums worldwide and continue to score Billboard chart positions while playing to packed houses throughout the USA, Canada, Japan and Europe. They were the first brass ensemble from the West to perform in the People’s Republic of China (where they returned for a 5-city tour to great acclaim in the spring of 2010) as well as the first brass group to take the stage at the venerable Carnegie Hall. They have also performed in Australia, the Middle East, the Soviet Union and South America. Millions of television viewers have had Canadian Brass come into their homes with appearances on The Tonight Show, Today and Entertainment Tonight and numerous PBS specials.\n\n\n\nFrequent guests of many major symphony orchestras, they are on the cutting edge of technology offering their fans multimedia opportunities including an iPhone app. Education plays a key role in the story of the Canadian Brass; a vital part of their outreach is their role as clinicians for Conn-Selmer, as well as their support and interaction with El Sistema, the acclaimed global music education program.\n\n\n\nSince 1998, Canadian Brass has been an exclusive artist at Opening Day Entertainment Group. Canadian Brass is Chuck Daellenbach (tuba), Christopher Coletti and Brandon Ridenour (trumpets), Achilles Liarmakopoulos (trombone) and Eric Reed (horn)."}, {"url": "https://www.prestomusic.com/classical/artists/3896--canadian-brass", "page_content": "The Canadian Brass is a Canadian brass quintet formed in 1970 in Toronto, Ontario, by Charles Daellenbach (tuba) and Gene Watts (trombone), with horn player Graeme Page and trumpeters Stuart Laughton and Bill Phillips completing the quintet. As of 2018, Daellenbach is the sole original member in the group, with the other members being trumpeters Caleb Hudson and Fabio Brum, hornist Jeff Nelsen, and trombonist Achilles Liarmakopoulos.\n\nThe group is known for the use of humor in their live performances and an irreverent attitude that includes their signature attire of formal black suits with white running shoes. They have performed internationally and have recorded more than 130 CDs and DVDs. They have commissioned, performed, and recorded hundreds of transcriptions and original works for brass quintet.\n\nRead more at https://en.wikipedia.org/wiki/Canadian_Brass"}, {"url": "https://www.bandnext.com/bands-like/canadian-brass", "page_content": "Looking for bands that sound like Canadian Brass? You’ve come to the right place.\n\nThe band Canadian Brass was founded in 1970. Before coming to fame, the band got it’s start in Toronto. Generally, music journalists would define Canadian Brass’s style within the genre/s of and other rock music.\n\nOur algorythm analyzed all bands in our database and below you find the top results."}, {"url": "https://www.yourclassical.org/story/2021/12/02/canadian-brass-goes-all-canadian-on-new-recording", "page_content": "The Canadian Brass is living up to its name on its latest recording, Canadiana. Founding member Chuck Daellenbach (tuba) and Jeff Nelsen (horn) talk about why and how the world’s most well-known brass ensemble created this all-Canadian album.\n\nHow does this album reflect the transformation of the Canadian Brass throughout the years?\n\nDaellenbach: “We realize this is the first recording that was entirely Canadian and Canadian Brass. We've been playing German, South American and American music. This is the first 100 percent Canadian album. That is the evolution of the group, and it seems that the quality of playing is sky high.”\n\nHow are these popular works arranged?\n\nNelsen: “We have a genius arranger in the group, composer Brandon Ridenour. We were discussing what our favorite Canadian songs were for longer than a year or two, and we thought we should do these tunes. We finally found a space to do it. We collected a list of our top 200 tunes and started passing them to Ridenour who started sending charts.\n\n“He would disappear after concerts and then, all of a sudden, have a new chart to try. The album is an amazing weaving of Canadian Brass style and ideas with well-known Canadian music. The music also had to survive the test of the lack of lyrics. The pieces have incredible lyrics and an amazing story, but the music's pretty good, too, with the lyrics that worked.”\n\nWhich pieces did each of you contribute to the album?\n\nThe Canadian Brass has been recording and performing music since 1970. Courtesy of artist\n\nDaellenbach: “I'd go one step further. We picked our favorite music artists. I'm really enjoying deadmau5. He is a unique artist who created a place for electronic music. They even created an award at the Grammys because of his success. Everybody would expect when you see deadmau5, you're going to hear something pretty pointless and electronic sounding. But it's probably the most smooth and beautiful brass piece. The underlying music is so strong, and I think we display deadmau5 in a different perspective than people would normally think of him. We're hoping that he agrees that this really shows the sensitive and creative side of his wonderful artistry.”\n\nNelsen: “We get to perform it with double quintet. It's just an amazing brass choir piece. I chose k.d. lang because I'm from Alberta, like her. She studied with someone who sang with my parents and that connection goes way back, which is why we are playing ‘Constant Craving.’ It's just such an amazing song, and there's an accordion!”\n\nWhy did it take so long to celebrate Canadian artists as the Canadian Brass?\n\nDaellenbach: “From my point of view, I started realizing that we grew up as a group. We grew up with these artists in our environment. We certainly weren't collaborating directly with them, but we were always doing similar things, and we really felt that they were a part of our soundscape as we were growing. We wanted to highlight the lifetime of our ensemble, which is why there are current artists like Drake and deadmau5 alongside earlier artists like Joni Mitchell.\n\n“This is our heritage, as well. You can take a piece by Bach that's very wonderful and dress it up with new clothes. We can do the same thing with pop music that people are aware of and might be slipping out of the domain. Classical has an opportunity to really preserve music and, in a way, give it a new function. Canadian people might not know that it's Canadian music until we mention it.”\n\nWhat was the most difficult piece to perform?\n\nDaellenbach: “The piece by Rush. The notes we put in that are rushed. We're playing it faster than Rush as a challenge. It's quite amazing and our guitarist friend Sean Kelley, who can play about everything a guitarist can, helped us out. He was really our connection to get the feeling and sounds in order to bring the mood of the piece alive. We were just playing the notes. That was a challenge for me.”\n\nNelsen: “Our first track, ‘Je Me Souviens,’ by Laura Fabian, which we have been playing on our tour in Europe, is the most difficult. It's such a gorgeous lyrical piece, and the way Ridenour has us weaving in and out of each other's sounds is beautiful. Everything is such a wonderful challenge as a classical musician. To bring that French style in with the pacing of that tune at the climax is just a really nice challenge. We were pleasantly surprised by the response from the European audience. They just loved the piece.”\n\nResources\n\nCanadian Brass — Canadiana (Amazon)\n\nCanadian Brass — Canadiana (Linus Store)\n\nCanadian Brass (official site)"}, {"url": "https://canadianbrass.com/about/awards/", "page_content": "The Canadian Brass were presented the Tri-M Music Award at the MENC National Convention in Phoenix, Arizona, in April 1998.\n\nThe following is the presentation speech given by Donna Stark Fox, National Chair.\n\n“It is an honor to stand before you today to introduce you to the Tri-M Music Honor Society. Tri-M, known as Modern Music Masters, is a society with more than 2,900 chartered chapters worldwide. It was founded to recognize the musical excellence and achievement of its members. These students (present at ceremony) represent New York and Pennsylvania. They are not only members, but true advocates for music education and they are proud to be delegates to this MENC National Convention. At this time they will share the honor of Tri-M Membership with these five gentlemen who have inspired with their musicianship, their leadership, and with their service to the musical profession, to music education and to children through their partnership with MENC. We welcome the Canadian Brass as honorary members of the Tri-M Music Honor Society.”"}]}