{"Brian Hughes was born on October 28, 1956.": [{"url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/brian-hughes-legendary-godfather-manchester-22875510", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nSign up for our daily newsletter to get the day's biggest stories sent direct to your inbox\n\nTributes are flooding in for legendary boxing trainer Brian Hughes following his death aged 82.\n\nKnown as the 'Godfather of Manchester boxing', Hughes dedicated his life to the sport.\n\nBorn and raised in Collyhurst, he formed Collyhurst Lads Club in 1964 at a community centre on Willert Street using Army kit bags stuffed with old clothing as punch bags.\n\nScores of youngsters joined and football teams and a boxing squad were set up.\n\nREAD MORE: Pupils excluded from Manchester schools do GCSEs at a boxing club - while champions train and keep watch\n\nWithin a couple of years the club had won the first of dozens of national schoolboy and national junior ABA titles and began producing a long line of national and international fighters\n\nIn the 1970s, when the old club was demolished, Hughes kept the boxing section going and he opened up a gym above the Co-op on Lightbowne Road in Moston.\n\nThere, Hughes went on to achieve even greater success, producing several British, European and World boxing champions, working with the likes of Tyson Fury, Scott Quigg and Robin Reid.\n\nThe trainer retired from boxing in 2011 after more than four decades in the sport.\n\nSpeaking at the time he said: \"For the past 50 years I have devoted my life to the club and unfortunately it has had to end for me.\n\n\"But I wish those lads every good wish and pray they become a credit to their families and themselves.\"\n\nFigures from across boxing have been paying tribute to Hughes' life and legacy.\n\nPromoter Frank Warren tweeted: \"Frank Warren and everyone at Queensberry are saddened to hear of the passing of dear friend Brian Hughes.\n\n\"Between us we made many champions, Manchester legends and shared many good times along the journey that goes back many decades.\n\n\"As well as a great trainer, master tactician and mentor to many youngsters, Brian was a talented author of many books as well as being a renowned boxing and Manchester United historian as well as a father figure to many in his local area.\n\n\"His legacy will live on at Collyhurst and Moston with many of his former charges continuing his life’s work. Manchester has lost a great Ambassador and Boxing an irreplaceable character. Rest in Peace and God bless.\"\n\nFormer light middleweight champion Tommy McDonagh, who now runs Collyhurst and Moston ABC alongside another of Hughes' former fighters Pat Barrett, tweeted: \"Rest in peace Brian thanks for everything.\"\n\nManchester trainer Joe Gallagher said: \"Such Sad news to hear the passing of Brian Hughes a coach and mentor to so many that passed though his gym door . Thoughts and prayers to his family ,loved ones & the team @CollyhurstABC.\"\n\nThe World Boxing Foundation tweeted: \"We at the WBF have been so saddened to hear about the death of Brian Hughes.\n\n\"A true boxing man & a gentleman. The sport was so much better due to Brian’s involvement. How many lives did he genuinely change in Manchester.\"\n\nFormer super middleweight world title contender Paul Smith said: \"Thoughts and condolences to the family and friends of Brian Hughes.\n\n\"Massive influence on the fight game in Manchester & beyond. Helped mould many champions and even more good, decent people. \"Rest in peace x.\"\n\nNigel Travis, coach at Moss Side Fire Station ASBC, tweeted: \"Very sad to hear the news that Brian Hughes from the great gym @CollyhurstABC has passed away. A true boxing man.\"\n\nAway from the gym, Hughes married Rosemarie and had four children.\n\nA life-long Manchester United fan, he was encouraged to write a book about Tommy Taylor, who died at Munich, then went to write 11 other sports titles on various stars of the ring and football pitch.\n\nIn the Millennium honours list, Hughes was awarded an MBE for services to the community.\n\nAnd in 2018 a street in Collyhurst was named in honour of his achievements."}, {"url": "http://www.brianhughescomposer.co.uk/?page_id=2", "page_content": "Brian Hughes was born in Ponciau, North Wales and graduated from Cardiff University. He is well known as a composer, conductor, accompanist and vocal consultant he was for many years Chorus Master and Head of Opera Music Staff at the Royal Northern College of Music and has been awarded a Fellowship from his own college and from the Royal College of Music and Drama, Cardiff.\n\nAmong the many well known choruses he has conducted are those of the:-\n\nBuxton International\n\nThe Gothenburg Opera\n\nCheltenham Festival\n\nThe Britten Singers\n\nHe relinquished his full-time post at the RNCM in 1992 to pursue his many other musical commitments. During his time at the college he directed many memorable performances including\n\nBritten’s Spring Symphony and his own opera Stars and Shadows which was also performed in London and Birmingham.\n\nIn 1993 he was engaged as\n\nMusic director for the Australian premiere of Britten’s Billy Budd at the Queensland Conservatorium of Music\n\nHis many professional engagement as conductor range from\n\nBach’s St John Passion and Christmas Oratorio\n\nto contemporary Operas such as\n\nStephen Oliver’s The Waiter’s Revenge\n\nPeter Maxwell Davis’ The two fiddlers\n\nThe Little Sweep by Britten\n\nIn 1990 the work ‘Dadl Dau’ was commissioned by the BBC Welsh Symphony Orchestra and performed in St. David’s Hall, Cardiff; ‘Strata’ for very large orchestra (inspired by Strata Florida) was performed by the RNCM Symphony Orchestra in Manchester and Kendal in 1991 whilst the Clwyd Youth Orchestra gave performances of “What’s Next?” in 1994\n\nAmong his larger scale choral works is It is for Man, for massed -children’s voices and two pianos,\n\npremiered at Chester Cathedral in 1993. His flute Sonatina won a competition sponsored by the Guild for the Promotion of Welsh Music, and ‘Quando!’, for clarinet and piano was commissioned in 1994 by the Rhyl Festival.\n\nHe has written choral an orchestral works for:-\n\nThe Royal National Eisteddfod of Wales\n\nThe BBC\n\nHTV\n\nThe National Youth Choir of Wales\n\nHis Three Shakespearean Songs for soprano and piano were first performed at the Purcell Room, London in 1992. He wrote songs for S4C television’s A Century of Song in 1995, and in 1996 his Japanese Nursery Songs were premiered at the Chester National Youth Choir Festival. Te Deum, a large scale work for soloists, chorus and orchestra was first performed at Ripon Cathedral in 1998 and Pren Plandedig, for soprano soloist, male voice choir and orchestra was performed three times under his direction in 2002, and was given a further performance at Royal National Eisteddfod of Wales in 2003. In July 2003 the first performance of Tanau, for brass and orchestra was given by the Liverpool Philharmonic Orchestra and Cory Brass Band at the Welsh Proms in St. David’s Hall, Cardiff. The premiere of his Requiem took place in Trawsfynydd, North Wales in April 2005 – the unusual scoring for this work is: tenor soloist, mixed and male voice chorus, violin solo, percussion and piano and there have been further performances in St. Asaph and Carmarthen.\n\nThe premiére of his Dylan Thomas songs “Darkness Comes Psalming” was given at the Dylan Thomas Centre, Swansea on 25th October 2006 as part of the Swansea Festival of Music and the Arts.\n\nIn 2008 he was commissioned to write a piece for Symphonia Cymru, a work for three flutes, percussion and strings. In 2009 his work for orchestra, “Troad” was given five performances at various locations in Wales by the National Youth Orchestra of Wales. In 2010 his “Nunc Dimittis” and “Beatus Vir” was given its first performance by the cathedral chorus at Westminster, London. In 2016 he was commissioned to write a Grace for Peterhouse College, Cambridge – the text had long been associated with the college but had never been set to music; “Benedic nos, Domine, et dona tua.”\n\nIn 2017 he was commissioned to write “Marw’r Ehedydd” for St Asaph Music Festival, a work for flute, percussion and strings, and in 2018 his large scale work “The Sorrows of the Somme” was performed at BBC Hoddinott Hall by the National Youth Chorus and National Youth Orchestra of Wales.\n\nHe studied piano with Patrick Piggott and has served as accompanist to singers in Masterclasses with Joan Hammond, Joan Sutherland and Sherrill Milnes.\n\nHe is a specialist Vocal Consultant and works regularly with leading amateur and professional singers."}, {"url": "http://www.locateancestors.com/hughes-born-in-1956/", "page_content": "Look up relatives and ancestors and explore family trees:\n\nBrowse by surnames starting with:\n\nA\n\nB\n\nC\n\nD\n\nE\n\nF\n\nG\n\nH\n\nI\n\nJ\n\nK\n\nL\n\nM\n\nN\n\nO\n\nP\n\nQ\n\nR\n\nS\n\nT\n\nU\n\nV\n\nW\n\nX\n\nY\n\nZ\n\nDeath statistics by year for last name HUGHES\n\nAverage age at death for last name HUGHES\n\nIs any person on this list your grandfather, grandmother, father, mother, uncle, aunt, other family member, or a friend? Click on the \"Add information\" button next to this person's name to connect with his or her family, friends, add an obituary or other information.\n\n\"Add information\" button next to this person's name to connect with his or her family, friends, add an obituary or other information. Click on the \"Add photo\" button to add this person's photograph or picture of the gravestone.\n\nDeath statistics by state for last name HUGHES\n\nLast name popularity statistics for persons named HUGHES per 10,000 residents in every state\n\nFirst name popularity statistics for year 1990\n\nPopularity of last name HUGHES decreased from 0.092% in 1990 to 0.085% (229390 people) in year 2000. Last name HUGHES moved from 88th to 83rd place on the most common names list in the USA\n\nOther free people search examples:\n\nEMERY\n\nLEMIEUX\n\nSOULIOS\n\nBased on public records. Inadvertent errors are possible.\n\nLocateAncestors.com does not guarantee the accuracy or timeliness of any information on this site. Use at your own risk."}, {"url": "https://www.ancientfaces.com/person/brian-hughes-birth-1958-death-1987/88015480", "page_content": "We All Deserve to be Remembered: AncientFaces - 20 years in 2020\n\nHow in the world is it that when our loved ones die we have only their social media accounts to remember them by? Why is it all that’s left online is a memorial page consisting of a tombstone and an obituary, and if you’re fortunate enough to have a writer in the family, MAYBE there is an obituary consisting of three paragraphs about who the person was? People are important in life and in death. How our loved ones and ancestors lived their lives, what they did with their time, and who they impacted - is important.\n\nWe all Deserve to be Remembered, and it is up to us, the people that knew them, to show & tell their stories before our memories get lost in history. AncientFaces is Where We Remember Over the last 20 years we've seen tens of millions of people show that they agree that Everyone Deserves to be Remembered (EDtbR). It is up to each and every one of us to share our memories & family stories of those people important to us. Through storytelling & sharing who these people really were, we unlock meaningful connections with people today, and the potential of new discoveries tomorrow. In 2020, to celebrate our 20 year milestone & to share this mission with the world we've released our first video. If you live in our neighborhood in Silicon Valley you might have noticed the spot on your favorite television channels ;) Thank you - each and every one of you - for your role in making AncientFaces a family-friendly community and the place to remember & celebrate the lives of people who matter to us."}, {"url": "https://www.ancientfaces.com/person/brian-t-hughes-birth-1957-death-2004/76439990", "page_content": "Refresh this page to see various historical events that occurred during Brian's lifetime.\n\nIn 1957, in the year that Brian T Hughes was born, on October 4th, the Soviet Union launched Sputnik I, the first man made earth-orbiting satellite - and triggered the Space Race. Sputnik I was only 23 inches in diameter and had no tracking equipment, only 4 antennas, but it had a big impact.\n\nIn 1960, when he was only 3 years old, on May 1st, an American CIA U-2 spy plane, piloted by Francis Gary Powers, was shot down by a surface-to-air missile over the Soviet Union. Powers ejected and survived but was captured. The U.S. claimed that the U-2 was a \"weather plane\" but Powers was convicted in the Soviet Union of espionage. He was released in 1962 after 1 year, 9 months and 10 days in prison.\n\nIn 1979, when he was 22 years old, on November 4th, Iranian militant students seized the US embassy in Teheran and held 52 American citizens and diplomats hostage for 444 days. They were released at the end of the inauguration speech of the newly elected Ronald Reagan.\n\nIn 1983, when he was 26 years old, physicist Sally K. Ride, 32, became the first US woman astronaut in space as a crew member aboard space shuttle Challenger on June 18th. She was also the youngest (32) astronaut to go into space. Soviet cosmonaut Valentina Tereshkova was the first woman in space in 1963.\n\nIn 1991, at the age of 34 years old, Brian was alive when on January 16th, Allied forces began the first phase of Operation Desert Storm. Saddam Hussein's forces had previously invaded the sovereign state of Kuwait and the focus of the operation was to remove his Iraqi troops from Kuwait. On February 24th, the ground war began. Within 100 hours, American ground troops declared Kuwait liberated."}, {"url": "https://www.celebsagewiki.com/brian-hughes-musician", "page_content": "Age, Biography and Wiki\n\nBrian Hughes was born on 5 May, 1955 in Vegreville, Canada, is a Musician, composer, producer. Discover Brian Hughes's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 68 years old?\n\nPopular As N/A Occupation Musician, composer, producer Age 68 years old Zodiac Sign Taurus Born 5 May 1955 Birthday 5 May Birthplace Vegreville, Canada Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 5 May. He is a member of famous Musician with the age 68 years old group.\n\nBrian Hughes Height, Weight & Measurements\n\nAt 68 years old, Brian Hughes height not available right now. We will update Brian Hughes's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nBrian Hughes Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Brian Hughes worth at the age of 68 years old? Brian Hughes’s income source is mostly from being a successful Musician. He is from Canada. We have estimated Brian Hughes's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Musician\n\nBrian Hughes Social Network\n\nTimeline"}, {"url": "https://www.ancientfaces.com/person/thomas-brian-hughes-birth-1939-death-2005/14173036", "page_content": "Refresh this page to see various historical events that occurred during Thomas' lifetime.\n\nIn 1939, in the year that Thomas Brian Hughes was born, on the 1st of September, Nazi Germany invaded Poland. On September 17th, the Soviet Union invaded Poland as well. Poland expected help from France and the United Kingdom, since they had a pact with both. But no help came. By October 6th, the Soviet Union and Nazi Germany held full control of the previously Polish lands. Eventually, the invasion of Poland lead to World War II.\n\nIn 1953, Thomas was merely 14 years old when actress and comedian Lucille Ball gave birth to Desi Arnaz, Jr on January 19th. On the same day on \"I Love Lucy\", the fictional Little Ricky was born as well. Baby Desi graced the cover of the first TV Guide magazine with a headline that read \"\"Lucy's $50,000,000 baby\" - because the commercial revenue from his birth was expected to be that amount.\n\nIn 1969, he was 30 years old when on January 20th, Richard M. Nixon became the 37th President of the United States. Previously the Vice President to President Eisenhower, Nixon was the only President to resign in office - in his second term.\n\nIn 1974, when he was 35 years old, on August 9th, Gerald R. Ford became the 38th President of the United States. He had been Vice President for 8 months when he became President due to the resignation of President Nixon.\n\nIn 1992, by the time he was 53 years old, on April 29th, riots began in Los Angeles after the \"Rodney King\" verdict was issued. Four LAPD officers had been accused of using excessive force (assault) on African-American Rodney King, who had been stopped for drunk driving. The beating had been videotaped. Their acquittal sparked a 6 day riot in Los Angeles."}, {"url": "https://www.echovita.com/us/obituaries/ny/adams/brian-hughes-9842760", "page_content": "Brian Hughes Obituary\n\nIt is with great sadness that we announce the death of Brian Hughes (Adams, New York), born in Watertown, New York, who passed away on October 14, 2019, at the age of 62, leaving to mourn family and friends. Family and friends can send flowers and condolences in memory of the loved one. Leave a sympathy message to the family on the memorial page of Brian Hughes to pay them a last tribute.\n\nHe was predeceased by : his parents, Roy Hughes and Daphne Hughes (Baynes); and his wife Katherine Griffin. He is survived by : his children, Dustin Griffin (Renee), Alan Hughes, Shannon Connell (Jason), Brie Anderson (Ken), Katie Edmonds (Dan), Brian Hughes, Jr (Jessica), Dezirae Clay (Kalib) and Mackenzie Griffin."}], "Brian Hughes is Canadian.": [{"url": "https://www.wikiwand.com/en/Brian_Hughes_(musician)", "page_content": "Brian Hughes (born 5 May 1955) is a Canadian guitarist whose work draws from smooth jazz and Latin music. Hughes also plays oud, bouzouki, and balalaika. For over twenty years, he has worked in the studio with singer-songwriter Loreena McKennitt.[1] He co-produced many of her recordings and leads her touring band.\n\nCanadian guitarist (born 1955)\n\nQuick facts: Brian Hughes, Born, Genres, Occupation(s), In... ▼\n\nMusical artist"}, {"url": "https://www.celebsagewiki.com/brian-hughes-musician", "page_content": "Age, Biography and Wiki\n\nBrian Hughes was born on 5 May, 1955 in Vegreville, Canada, is a Musician, composer, producer. Discover Brian Hughes's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 68 years old?\n\nPopular As N/A Occupation Musician, composer, producer Age 68 years old Zodiac Sign Taurus Born 5 May 1955 Birthday 5 May Birthplace Vegreville, Canada Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 5 May. He is a member of famous Musician with the age 68 years old group.\n\nBrian Hughes Height, Weight & Measurements\n\nAt 68 years old, Brian Hughes height not available right now. We will update Brian Hughes's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nBrian Hughes Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Brian Hughes worth at the age of 68 years old? Brian Hughes’s income source is mostly from being a successful Musician. He is from Canada. We have estimated Brian Hughes's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Musician\n\nBrian Hughes Social Network\n\nTimeline"}, {"url": "https://jazztimes.com/archives/brian-hughes-live/", "page_content": "Jonathan Butler’s optimistic music belies a dirt-poor childhood growing up in a South Africa segregated by apartheid. Live in South Africa, a new CD and DVD package, presents a sense of the resulting inner turmoil, mixed with dogged resolve, that paved the way to his status as an icon in his country and successful musician outside of it. Looking back, the 46-year-old Butler says today, the driving forces that led to his overcoming apartheid-the formal policy of racial separation and economic discrimination finally dismantled in 1993-were family, faith and abundant talent.\n\n“When we were kids, our parents never talked about the ANC [African National Congress] or Nelson Mandela,” he says. Butler was raised as the youngest child in a large family. They lived in a house patched together by corrugated tin and cardboard, in the “coloreds only” township of Athlone near Cape Town. “They never talked about struggles so we never knew what was happening.”\n\n\n\nStart Your Free Trial to Continue Reading Start my Free Trial Become a JazzTimes member to explore our complete archive of interviews, profiles, columns, and reviews written by music’s best journalists and critics.\n\n\n\n"}, {"url": "https://peoplepill.com/people/brian-hughes-1/", "page_content": "Brian Hughes (born 1955) is a Canadian guitarist whose work draws from smooth jazz and Latin music. Although known as a guitarist, Hughes also plays oud, bouzouki, and balalaika. For over twenty years, he has worked in the studio with singer-songwriter Loreena McKennitt, co-produced many of her recordings, and leads her touring band.\n\nMusic career\n\nHughes grew up in Alberta, Canada and studied at Grant MacEwan College (now MacEwan University) in Edmonton and the Banff School of Fine Arts with guitarists Ed Bickert and Gene Bertoncini. In 1981 he moved temporarily to Los Angeles where he studied at the Guitar Institute with Pat Martino, Joe Diorio, and Robben Ford.\n\nIn 1987 Hughes relocated to Toronto where he began working with harpist Loreena McKennitt. In 1991 he recorded Between Dusk...and Dreaming, his first album as a leader, for Justin Time Records, followed by Under One Sky the next year. He started his own label, Sylvan House Music, which was distributed by Warner Music Canada and licensed to Higher Octave Music/EMI in the U.S. and abroad. He recorded three more albums (Straight to You, One 2 One, and Shakin' Not Stirred) under this arrangement before releasing Along the Way with A440 Music Group in 2003. He returned to his Sylvan House Music imprint for the release of Live (2007), No Reservations (concert DVD, 2009), and Fast Train to a Quiet Place in 2011. He relocated to Los Angeles in 2000.\n\nMany of his works can be heard on The Weather Channel's Local on the 8's and on Sirius XM's Watercolors channel.\n\nAwards\n\nHughes received the Society of Canadian Authors and Composers (SOCAN) Jazz and Instrumental Composer of the Year award from 1997–2001 and in 2006 and 2008.\n\nHe was nominated for a Juno Award as \"Producer of the Year\" in 1991 for the Loreena McKennitt album The Visit.\n\nDiscography"}, {"url": "https://www.guitarsite.com/newsletters/021216/3.shtml", "page_content": "Contact | Contents | Privacy Policy | Forum\n\nCopyright © 1999 - 2023 , All Rights Reserved.\n\nAffiliate Notice: As an Amazon Associate we earn from qualifying purchases."}, {"url": "https://www.canadianunderwriter.ca/inspress/firstonsite-appoints-industry-veteran-brian-hughes-as-vp-of-human-resources/", "page_content": "MISSISAUGA, ON., September 10, 2019 – FirstOnSite Restoration, Canada’s leading independent disaster restoration services provider, has reinforced its employee-centric culture with the addition of Brian Hughes to its leadership team in the role of Vice President, Human Resources.\n\n“Brian’s focus on people development, strategic planning and employee engagement will help drive our commitment to providing an exceptional employee experience,” said Dave Demos, CEO, FirstOnSite Restoration. “As we continue to grow and move toward our vision of global industry leadership, it is important that we help ensure our employees are supported and continue to thrive.”\n\nBrian will lead the human resources department and business partner team, working closely with regional operations and Canadian corporate staff to provide a consistent and exceptional employee experience across Canada.\n\nBrian is an award-winning industry veteran who has more than 20 years’ experience in human resources helping companies achieve organizational improvement and operational results.\n\n“Choosing to join the FirstOnSite team was easy after experiencing firsthand the hardworking and positive atmosphere the company demonstrates and its pursuit towards creating the best employee experience possible,” said Hughes. “Our agenda is big, and our future is bright.”\n\nBrian has developed a reputation as an enthusiastic and compassionate leader who strives to support a culture that drives employee growth and fosters community. His expertise will also contribute to supporting a constructive environment that continues to attract talented individuals.\n\n-30-\n\nAbout FirstOnSite Restoration\n\nFounded in 2007 and based in Mississauga, ON, FirstOnSite Restoration Limited is one of the largest emergency restoration and reconstruction service providers in North America. FirstOnSite Restoration is a subsidiary of FirstService Corp. In 2016, FirstOnSite joined forces with Interstate Restoration, a leading disaster restoration services provider for commercial enterprises in the U.S. With approximately 1,500 employees, FirstOnSite Restoration and Interstate assist property owners and businesses in recovering from fire, flood, natural and human-caused disasters.\n\nFor more information visit: www.firstonsite.ca or call 1.877.778. 6731, and follow @firstonsite on Twitter at www.twitter.com/firstonsite.\n\nPress Contact:\n\nDana Sharman\n\nMAVERICK\n\n416-640-5525 x 242\n\nDanas@wearemaverick.com"}, {"url": "https://biogossipy.com/brian-hughes/", "page_content": "Brian Hughes net worth, birthday, age, height, weight, wiki, fact 2020, 2021! In this article, we will discover how old is Brian Hughes? Who is Brian Hughes dating now & how much money does Brian Hughes have?\n\nSHORT PROFILE Father Not Available Mother Not Available Siblings Not Available Spouse Not Known Children(s) Not Available\n\nBrian Hughes Biography\n\nBrian Hughes is a famous Musician, who was born on May 5, 1955 in Canada. According to Astrologers, zodiac sign is Taurus.\n\nBrian Hughes (born 5 May 1955) is a Canadian guitarist whose work draws from smooth jazz and Latin music. Hughes also plays oud, bouzouki, and balalaika. For over twenty years, he has worked in the studio with singer songwriter Loreena McKennitt. He co produced many of her recordings and leads her touring band.\n\nHughes grew up in Alberta, Canada and studied at Grant MacEwan College (now MacEwan University) in Edmonton and the Banff School of Fine Arts with jazz guitarists Ed Bickert and Gene Bertoncini. In 1981 he moved temporarily to Los Angeles where he studied at the Guitar Institute with Pat Martino, Joe Diorio, and Robben Ford.\n\nEthnicity, religion & political views\n\nMany peoples want to know what is Brian Hughes ethnicity, nationality, Ancestry & Race? Let’s check it out! As per public resource, IMDb & Wikipedia, Brian Hughes’s ethnicity is Not Known. We will update Brian Hughes’s religion & political views in this article. Please check the article again after few days.\n\nIn 1987 Hughes moved to Toronto where he began working with harpist Loreena McKennitt. In 1991 he recorded Between Dusk…and Dreaming, his first album as a leader, for Justin Time Records, followed by Under One Sky the next year. He started his label, Sylvan House Music, which was distributed by Warner Music Canada and licensed to Higher Octave Music/EMI in the U.S. and abroad. He recorded three more albums (Straight to You, One 2 One, and Shakin’ Not Stirred) under this arrangement before releasing Along the Way with A440 Music Group in 2003. He returned to his Sylvan House Music imprint for the release of Live (2007), No Reservations (concert DVD, 2009), and Fast Train to a Quiet Place in 2011. He moved to Los Angeles in 2000. Many of his works can be heard on The Weather Channel’s Local on the 8’s and on Sirius XM’s Watercolors channel.\n\nBrian Hughes Net Worth\n\nBrian Hughes is one of the richest Musician & listed on most popular Musician. According to our analysis, Wikipedia, Forbes & Business Insider, Brian Hughes net worth is approximately $1.5 Million.\n\nBrian Hughes Net Worth & Salary Net Worth $1.5 Million Salary Under Review Source of Income Musician Cars Not Available House Living in own house.\n\nIn 1987 Hughes moved to Toronto where he began working with harpist Loreena McKennitt. In 1991 he recorded Between Dusk…and Dreaming, his first album as a leader, for Justin Time Records, followed by Under One Sky the next year. He started his label, Sylvan House Music, which was distributed by Warner Music Canada and licensed to Higher Octave Music/EMI in the U.S. and abroad. He recorded three more albums (Straight to You, One 2 One, and Shakin’ Not Stirred) under this arrangement before releasing Along the Way with A440 Music Group in 2003. He returned to his Sylvan House Music imprint for the release of Live (2007), No Reservations (concert DVD, 2009), and Fast Train to a Quiet Place in 2011. He moved to Los Angeles in 2000. Many of his works can be heard on The Weather Channel’s Local on the 8’s and on Sirius XM’s Watercolors channel.\n\nHughes received the Society of Canadian Authors and Composers (SOCAN) Jazz and Instrumental Composer of the Year award from 1997–2001 and in 2006 and 2008. He was nominated for a Juno Award as Producer of the Year in 1991 for Loreena McKennitt’s album The Visit.\n\nBrian Hughes Height\n\nBrian Hughes’s height Not available right now. weight Not Known & body measurements will update soon.\n\nBrian Hughes Height & Body Stats Height Unknown Weight Not Known Body Measurements Under Review Eye Color Not Available Hair Color Not Available Feet/Shoe Size Not Available\n\nWho is Brian Hughes dating?\n\nAccording to our records, Brian Hughes is possibily single & has not been previously engaged. As of June 2021, Brian Hughes’s is not dating anyone.\n\nRelationships Record: We have no records of past relationships for Brian Hughes. You may help us to build the dating records for Brian Hughes!\n\nFacts & Trivia\n\nRanked on the list of most popular Musician. Also ranked in the elit list of famous celebrity born in Canada. Brian Hughes celebrates birthday on May 5 of every year.\n\n[X] .AFB_P { width: 320px; height: 100px; } @media(min width: 350px) { .AFB_P { width: 300px; height: 250px; } } @media(min width: 500px) { .AFB_P { width: 336px; height: 280px; } } You may read full biography about Brian Hughes from Wikipedia."}, {"url": "https://licensee.io/real-estate/685628-brian-hughes-tx/", "page_content": "Brian Hughes Real Estate Agent 134 Eddie St, Canadian, Texas,\n\n806-886-1005\n\nBrian Hughes is a licensed real estate sales agent in Canadian, Texas and has a total experience of 6 years in real estate business. The real estate license number 685628 was issued by TREC to Brian Hughes on 15 March, 2017. The current status of license is Expired and address listed on Brian Hughes's license document is 134 Eddie St, Canadian, Texas, . The license already expired on 31 March, 2019. You can reach out to Brian Hughes via phone number 806-886-1005.\n\n\n\nBrian Hughes has a license type of Real Estate Sales Agent which allows a real estate professional to perform services such as selling, buying, renting, auctioning, advertising of real estate properties, but only on behalf of a real estate broker (licensed broker who sponsers the sales agent). Licensed real estate professionals / entities are also commonly referred to as real estate agents or Realtors.\n\nRealtor's Profile\n\nName Brian Hughes Credentials Real Estate Sales Agent Experience 6 yrs Complete Address 134 Eddie St, Canadian, Texas, Mailing Address 134 Eddie St, Canadian, Texas, 79014 Phone Number 806-886-1005 Email Address hughebt @ gmail . com\n\nTexas Real Estate License\n\nLicense Number 685628 License Type Real Estate Sales Agent License Status Expired License Issue Date 15 March, 2017 License Expiry Date 31 March, 2019 Sales Agent Apprentice Education (SAE) Status Non-elective CE Requirements Outstanding\n\nContinuing Education\n\nReal estate license needs to be renewed every 2 years. Sales Agents and Brokers need to complete atleast 18 hours of Continuing Education to become eligible for renewal. Brian Hughes has successfully completed following courses as part of qualifying and continuing education."}, {"url": "https://govikesgo.com/news/2018/10/24/mens-soccer-obituary-longtime-vikes-soccer-coach-brian-hughes-was-ultimate-competitor.aspx", "page_content": "Former North American Soccer League and Swansea City pro Brian Hughes, who later found success on the sidelines as head coach of the University of Victoria Vikes men's soccer team, has died at age 80.\n\nHughes began coaching at UVic in 1972 and is the second-longest tenured UVic men's soccer coach. He took the Vikes through 1983, with a 39-10-17 regular-season record in 12 seasons, before handing the coaching reins to former national team player Bruce Twamley.\n\n\n\nHughes' tenure on the UVic soccer bench is surpassed only by Bruce Wilson 's current 30-season run. Hughes is one of only five coaches to have guided the Vikes in 50 years, including team founder Wally Milligan for three seasons, Twamley for four seasons and former Canadian national team player Ike MacKay for one season.\n\n\n\nHughes coached UVic to its first CIAU national men's soccer title in 1975, defeating the Alberta Golden Bears and Saskatchewan Huskies in the Canada West playoffs, before downing Dalhousie and Concordia as UVic hosted the national tournament at Centennial Stadium.\n\n\n\n\"Brian was an excellent coach and was very good at inspiring a group of young, energetic players we had at the time,\" said Robin Burrell, who played for UVic under Hughes. \"It was a learning experience from the outset, and Brian was instrumental in instilling a love for the game in all who were fortunate enough to learn from him.\"\n\n\n\nSeveral of Hughes' later UVic players went on to play in the Canadian national team program.\n\n\n\n\"Many great players emerged from UVic,\" noted Burrell.\n\n\n\nTwamley guided the Vikes to their second of five national titles in 1987. Although no longer coach, that championship was sweet for Hughes, because son John Hughes was a star player on the 1987 UVic team. Brian Hughes was especially proud to see his son graduate from Mount Douglas Secondary — where he played on a Rams team that included Yahoo co-founder Jeff Mallett and historic soccer heart-transplant pro Simon Keith — before John Hughes went on to play pro in the CSL for the Victoria Vistas and internationally for Canada U-19 and then earning five caps with the Canadian senior national team. Brian Hughes, as the inaugural head coach of the Vistas, got to coach his son in the CSL.\n\n\n\nHughes continued his respected coaching career and taught the game at several levels, including with the national team program. Hughes, with co-coach Brett Hyslop, guided the Lower Island team to the Canadian U-19 title in 1993.\n\n\n\nAs a player, Brian Hughes made the U-23 team for Wales and performed professionally for Swansea City from 1956 to 1964. He was a highly proficient defender, scoring seven goals from his rearguard position, in 231 English League appearances.\n\n\n\nHughes led Swansea to a breathless run in the 1963-64 FA Cup, beating Barrow, Sheffield United, Stoke City and Liverpool before just failing to make the final in Wembley after bowing 2-1 in a semifinal loss to Preston North End before 68,000 fans at Villa Park in Birmingham.\n\n\n\nHughes came to the fledgling NASL, playing in the league's first two season in 1967 and 1968, for the Atlanta Chiefs. He moved to Victoria in 1970, beginning his Island soccer journey as playing coach of London Boxing Club of the VISL.\n\n\n\n\"Brian was such a nice guy and also very competitive. He had played at a high level for Swansea, so he understood the game well. He understood it inside out,\" said Frank Woods, who played under Hughes at UVic, and later in the national team program.\n\n\n\nHughes' former players and others in the Island soccer community are invited to attend a celebration of his life on Nov. 3, between 2 to 5 p.m., at the Uplands Golf Club clubhouse.\n\n\n\nHughes is survived by his wife of 60 years, Lorna, son John and granddaughters Kierra, Carys, Brynna, Shelby and Abbey. Hughes was predeceased by son David.\n\n\n\nSee Brian Hughes' coaching records HERE."}, {"url": "https://jazztimes.com/archives/brian-hughes-live/", "page_content": "Jonathan Butler’s optimistic music belies a dirt-poor childhood growing up in a South Africa segregated by apartheid. Live in South Africa, a new CD and DVD package, presents a sense of the resulting inner turmoil, mixed with dogged resolve, that paved the way to his status as an icon in his country and successful musician outside of it. Looking back, the 46-year-old Butler says today, the driving forces that led to his overcoming apartheid-the formal policy of racial separation and economic discrimination finally dismantled in 1993-were family, faith and abundant talent.\n\n“When we were kids, our parents never talked about the ANC [African National Congress] or Nelson Mandela,” he says. Butler was raised as the youngest child in a large family. They lived in a house patched together by corrugated tin and cardboard, in the “coloreds only” township of Athlone near Cape Town. “They never talked about struggles so we never knew what was happening.”\n\n\n\nStart Your Free Trial to Continue Reading Start my Free Trial Become a JazzTimes member to explore our complete archive of interviews, profiles, columns, and reviews written by music’s best journalists and critics.\n\n\n\n"}], "Brian Hughes is a jazz guitarist, composer, and arranger.": [{"url": "https://www.brianhughes.com/bio", "page_content": "\n\nLos Angeles resident Brian Hughes has carved out an impressive career in the contemporary jazz arena. His first two albums, Between Dusk and Dreaming and Under One Sky, firmly established him as one of the foremost guitarists and composers in the genre, perfectly blending his fluid and emotive guitar style into an exciting, melodic mix of Latin, Jazz and World Music compositions. After being picked as a winner in JAZZIZ Magazine's \"Guitars On Fire\" competition his subsequent recordings Straight To You, One 2 One, Shakin’ Not Stirred, Along the Way, Live and Fast Train To A Quiet Place have received critical acclaim and major radio air play from coast to coast. With his sizzling fret work and infectious compositions the media are accurate in saying: \"Both a great artist and an accessible one. His passion is so obvious, intense and contagious, that his audience shares it.” Brian has received the SOCAN / BMI \"Jazz & Instrumental Composer of the Year\" award seven times from 1997 to 2011 and the title track from “Shakin’ Not Stirred” was featured on an episode of HBO’s “Sex and the City”.\n\n\n\nHughes is well known for his 35 year parallel career recording and touring with world renowned vocalist Loreena McKennitt (The Mummer’s Dance). Brian’s skills as a musician (guitars, oud, bouzouki) are in the foreground on her 2019 release \"Live at the Royal Albert Hall\" and his production & mixing talents are evident on her 2012 Grammy nominated recording “Troubadours on the Rhine”. McKennitt has sold over 15 million albums worldwide and Brian has toured the world several times with her, appearing on the \"Late Show\" with David Letterman and receiving a Juno (Canadian Grammy) nomination as \"Producer of the Year” for his work on her platinum selling, Juno award winning album “The Visit”.\n\nBrians' new side project Secret Sky brings together three of the most exciting and creative forces in Celtic/World music; Brian Hughes (guitars, oud & bouzouki), Caroline Lavelle (cello & vocals), and Hugh Marsh (fiddle). The three met over 20 years ago and have played together in Loreena McKennitt’s band since. Their eponymous debut album is produced by Brian Hughes, and is an exciting collaboration that brings thrilling power and emotional depth to both traditional and self-penned songs.\n\n\n\nHughes has also accompanied Celtic music legends, The Chieftains, on several tours and has Produced and Mixed several international platinum selling albums for Greek recording artists Alkistas Protopsalti, Evanthia Reboutsika, Yannis Kotsiras and Panayotis Kalantzopoulos, including the soundtrack for A Touch of Spice the top grossing film in Greek cinema history.\n\n"}, {"url": "https://www.radioswissjazz.ch/en/music-database/musician/150836f3b9d1feea7114ccc766012a91e5afc1/biography", "page_content": "Brian Hughes (musician)\n\nFrom Wikipedia, the free encyclopedia.\n\nBrian Hughes (born 1955) is a Canadian guitarist whose work draws from both the smooth jazz and world music genres. (Of the latter, his influences have thus far been primarily Latin.) Not restricted entirely to conventional guitars, Hughes has also been known to employ the oud, bouzouki and balalaika. He has for over twenty four years worked in the studio with singer/songwriter Loreena McKennitt,[1] co-produced many of her recordings, and leads her touring band. Hughes has many albums starting from the early 1990s. His music is contemporary jazz using the jazz guitar for his instrumental music. His latest release is the CD Fast Train To A Quiet Place released in July 2011. Many of his works can be heard on The Weather Channel's Local on the 8's and on Sirius XM's Watercolors channel.\n\nHughes grew up in Alberta, Canada and studied at Grant MacEwan College (now MacEwan University) in Edmonton and the Banff School of Fine Arts with guitarists Ed Bickert and Gene Bertoncini. In 1981 he moved temporarily to Los Angeles where he studied at the Guitar Institute with Pat Martino, Joe DiOrio and Robben Ford. In 1987 Hughes relocated to Toronto where he began working with harpist Loreena McKennitt and in 1991 recorded his first album as a leader for Justin Time Records. Hughes subsequently recorded \"Under One Sky\" for Justin Time in 1992 and then started his own label Sylvan House Music in 1995 which was distributed by Warner Music Canada and licensed to Higher Octave / EMI in the USA and abroad. Brian recorded three more albums (Straight To You, One 2 One and Shakin' Not Stirred) under this arrangement before releasing Along The Way with A440 music group in 2003. Hughes returned to his Sylvan House Music imprint for the release of LIVE (2007), No Reservations concert DVD (2009) and Fast Train to a Quiet Place in July 2011. Brian relocated to Los Angeles in 2000 where he continues to reside.\n\nAWARDS:\n\nBrian received the SOCAN (Society of Canadian Authors and Composers) Jazz and Instrumental Composer of the Year award in: 1997, 1998, 1999, 2000, 2001, 2006 and 2008. He was also nominated for a Juno Award as \"Producer of the Year\" in 1991 for the Loreena McKennitt album \"The Visit\".\n\nDiscography\n\nTitle Year of Release Current Label Between Dusk...And Dreaming 1991 Justin Time Records Under One Sky 1992 Justin Time Records Straight To You 1996 Sylvan House Music / Distribution 13 One 2 One 1998 Sylvan House Music / Distribution 13 Shakin' Not Stirred 1999 Sylvan House Music / Distribution 13 Along The Way 2003 Sylvan House Music Live 2007 Sylvan House Music / Distribution 13 No Reservations concert DVD 2009 Sylvan House Music / Distribution 13 Fast Train to a Quiet Place 2011 Sylvan House Music / Distribution 13\n\nYahoo Music - Brian Hughes Albums\n\nReferences\n\nYanow, Scott. [Brian Hughes (musician) at All Music Guide Brian Hughes]. AMG. Retrieved on 2 August 2011.\n\nThis page was last modified 03.04.2014 00:39:21\n\n\n\nThis article uses material from the article Brian Hughes (musician) from the free encyclopedia Wikipedia and it is licensed under the GNU Free Documentation License."}, {"url": "https://loreenamckennitt.com/guitarist-brian-hughes-unclassifiable/", "page_content": "Accomplished musician/producer has worked with Loreena for 34 years\n\nWhen Brian Hughes first met and performed with Loreena at a Toronto concert in 1987 little did either of them know they were embarking on a magical musical journey that would take them all over the world and into the creative depths of 13 albums.\n\nBrian has played on all Loreena’s records, except the first two, and been in supporting roles as assistant or co-producer, bringing the various musical and technical elements together to facilitate her vision for each song. In 1992, when Loreena was nominated for a Juno Award as producer on The Visit, Brian was also nominated as co-producer for his work on the album. He also mixed her 2012 Grammy-nominated Troubadours on the Rhine.\n\nThe Visit won a Juno Award for Best Roots & Traditional Album and is the recording that propelled Loreena onto the international stage.\n\nAn accomplished guitarist/composer/producer, Brian has been described as “unclassifiable” and “genre busting”. He has built a successful career of his own, recording nine jazz albums, most of them released under his own record label Sylvan House Music and available through his website. Over the years, he’s earned a string of accolades, including winning SOCAN’s Jazz and Instrumental Composer of the Year Award seven times. “It’s really great when you get acknowledged – it’s a little notch in your belt, but then you move on,” he says.\n\nSo where did it all start?\n\n“I was around 14 or 15 and I was only dabbling in guitar really. I’d be walking home from school having these fantasies about being on stage in Edmonton or Vancouver playing for 20,000 people. I guess it kinda worked out,” he laughs.\n\nBorn in Alberta, Canada, Brian moved to Los Angeles in 2000 to pursue opportunities in the robust jazz community there. Through the decades his music has been influenced by everyone from Bob Dylan, Eric Clapton and Jimi Hendrix to Talking Heads and jazz great Wes Montgomery. When he was a teenager, his friend’s sister was into Celtic music and that’s where he heard it first. “When I did that 15-minute section of the Toronto concert with Loreena in 1987 as soon as she started playing I knew all the parts would come together, that I could move my jazz and rock sensibility into the music.”\n\nBrian’s main instrument is guitar, but he also plays the oud, bouzouki and the balalaika. He has toured with The Chieftains, produced and mixed international platinum-selling albums for several prominent Greek recording artists, appeared with Loreena on The Late Show with David Letterman, and the title track from his album Shakin’ Not Stirred was featured in an episode of the popular television series Sex and the City.\n\nBrian has also joined creative forces with two other long-standing members of Loreena’s band: cellist/singer Caroline Lavelle and violinist Hugh Marsh in a project dubbed Secret Sky. Four years ago, they released their first CD by the same name. Despite living in three different countries, they were able to stitch together the music remotely thanks to Brian’s production skills, the advancements in home recording technology and as Brian puts it, “with a lot of back and forthing”. He describes the album as having “the passionate feel reminiscent of some of the expansive, filmic albums of the ‘70s”. To the layperson, it may seem like a strange way to make a record, but it’s become increasingly common and easier to produce.\n\n“With Loreena’s albums we had the luxury of all being in the same room. That way, you have the opportunity to pick up on the vibes of other musicians and work off each other,” says Brian. “But both ways have their benefits.”\n\nNow, with The Visit: The Definitive Edition, Brian is looking back 30 years to the time of the original recording in 1991. Three decades is a long time and he admits his brain is “a bit fuzzy”, but there are some things that are etched in his memory.\n\nHis girlfriend at the time, Pamela (now his wife of 27 years), had an apartment in Toronto back then where her brother’s balalaika hung on the wall. He’d won it as a prize for best costume on a cruise when he was 12 (dressed as a chicken). One day while working on The Visit, Brian took the balalaika off the wall and started playing. When Loreena heard the instrument, she felt it belonged in the musical imagery of “The Lady of Shalott”, and so it made its way into the recording.\n\n“They were pretty intense studio sessions and we were at it every day,” recalls Brian. “Loreena’s more of a morning person and I’m more of an evening person, but it all worked out. The sessions were a lot of fun. We were big on textures and ambient sounds and we had these wonderful tribal drum sounds, Middle Eastern percussion and great fiddling.”\n\nLoreena has her own special memories from the time and of working with Brian. “It’s been great to have Brian’s support all these years, in the studio and on the road. In addition to being able to travel the world while performing, we’ve also had some great times, great meals and some really great laughs. I remember one time when we were recording at Real World Studios and I was auditioning musicians. Out of fun, I put little coloured dots on my forehead and I would add to them as the day went on. Before each of the musicians would come in to play for me, Brian would mention to them that I had this odd fascination with putting dots on my forehead. But he cautioned them to please, whatever they do, don’t say anything when they met me. The musician would politely come into the studio and we’d work with them playing a few tracks, all the while suspecting how whacky they must have thought I was. When the day was over, we had a great laugh over how considerate and respectful everyone had been, though likely privately wondering ‘what was up with her’!”\n\nBrian too has some funny memories from The Visit. “I can remember Loreena saying to me, ‘Brian, give me a drag of your cigarette’, then it would go to her head and she’d have to lie down on the sofa for 20 minutes.”\n\nThese days, Brian and his wife Pamela divide their time between L.A. and their hacienda in Mexico. Since the pandemic put the kibosh on live performances of all kinds, they’ve been working on their place in Mexico and “doing a lot of dog walking”.\n\nAnd of course, he’s dreaming again of performing in front of thousands of people someday soon.\n\nBrian Hughes on Spotify\n\nBrian Hughes Best Of on Spotify\n\nBrian Hughes on AppleMusic\n\nwww.brianhughes.com\n\nSecret Sky on Spotify\n\nSecret Sky on AppleMusic\n\nwww.secretskymusic.com\n\nWritten by Diane Sewell, a career journalist for more than 30 years. In addition to working with Loreena for 20 years, she has also written for the Globe and Mail, Toronto Star and assorted consumer magazines. She is also the author of several commissioned books."}, {"url": "https://www.guitarsite.com/newsletters/021216/3.shtml", "page_content": "Contact | Contents | Privacy Policy | Forum\n\nCopyright © 1999 - 2023 , All Rights Reserved.\n\nAffiliate Notice: As an Amazon Associate we earn from qualifying purchases."}, {"url": "https://www.celebsagewiki.com/brian-hughes-musician", "page_content": "Age, Biography and Wiki\n\nBrian Hughes was born on 5 May, 1955 in Vegreville, Canada, is a Musician, composer, producer. Discover Brian Hughes's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 68 years old?\n\nPopular As N/A Occupation Musician, composer, producer Age 68 years old Zodiac Sign Taurus Born 5 May 1955 Birthday 5 May Birthplace Vegreville, Canada Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 5 May. He is a member of famous Musician with the age 68 years old group.\n\nBrian Hughes Height, Weight & Measurements\n\nAt 68 years old, Brian Hughes height not available right now. We will update Brian Hughes's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nBrian Hughes Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Brian Hughes worth at the age of 68 years old? Brian Hughes’s income source is mostly from being a successful Musician. He is from Canada. We have estimated Brian Hughes's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Musician\n\nBrian Hughes Social Network\n\nTimeline"}, {"url": "https://www.contemporaryschoolofpiano.com/about-us/brian-hughes/", "page_content": "BRIAN HUGHES HOLISTIC PIANO SPECIALIST A holistic and strategically gifted piano coach, Brian has a rare ability to empower and inspire piano students of all ages from 7 to 70, whilst solving musical problems and removing boundaries that will transform your piano playing. Brian’s teaching strategies are adaptive, effective, and applicable to all levels and ages, making him a one-of-a-kind teacher, regardless of your age and ability, Brian’s flexible yet strategic and collaborative methods will unlock your unseen musical abilities. When Brian is not playing, composing, or teaching music, he is seen on the tennis court where he displays equal talent!\n\n\n\nIrish pianist Brian Hughes recently graduated with Distinction in a Master of Performance in Collaborative Piano at the Royal College of Music, training in many areas including improvisation and composition for the screen.\n\nHe has performed across a wide variety of genres, including art song, opera, musical theatre, popular and orchestral. Venues he has performed in across London include the Royal Albert Hall (opening ceremony of the ATP Champions’ Tennis Finals), Wigmore Hall (auditioning for an Irish Heritage Bursary), Princess Alexandra Hall at the Royal Over-Seas League (Irish Heritage concert), and recitals in churches such as St Marylebone (with flutist Amy Gillen), St. James’ Sussex Gardens (with soprano Leilani Barratt) and St. George’s Hanover Square (Irish Heritage Christmas Concert).\n\nBrian has a lifetime of experience in music education working with all ages. His teaching style has a rare sensitivity to engaging and working with others, which he has developed not just through his one-to-one teaching, but also as an accompanist with choirs, singers, and instrumentalists of all ages.\n\nBrian loves to teach piano holistically by incorporating many different elements into his lessons to help students become well-rounded musicians: playing by ear, playing by imitation, improvising, reading, singing, working on technique and composing, aiming to connect all these different aspects of music with one another.\n\nAs someone who first began playing by ear and improvising, to then learning piano by reading, Brian’s teaching philosophy is that it is possible to learn both simultaneously and that it doesn’t need to be one or the other.”\n\nBrian was the musical director and arranger/composer for a new musical entitled The Ballad of the Cosmo Cafe in 2019, which was performed in Belsize Park as part of the Insiders/Outsiders festival. He was also a Leeds Lieder Young Artist in 2019 and performed at a lecture-recital at the 2019 Oxford Lieder Festival.\n\nBrian resumes his position as musical director for a new production of The Unicorn and Joe, which will take place in the Arcola Theatre in October. He will also be performing a concert of Lieder in September alongside fellow RCM graduates.”"}, {"url": "https://www.allmusic.com/artist/brian-hughes-mn0000620614/credits", "page_content": "Credits Brian Hughes Follow Artist +\n\nA versatile guitarist with a sound of his own, Brian Hughes creates unclassifiable music that is both accessible and at times adventuruous. He grew up in Alberta, Canada and studied at Grant McKewan College…\n\nRead Full Biography"}, {"url": "https://www.allmusic.com/artist/brian-hughes-mn0000620614", "page_content": "Brian Hughes Follow Artist +\n\nA versatile guitarist with a sound of his own, Brian Hughes creates unclassifiable music that is both accessible and at times adventuruous. He grew up in Alberta, Canada and studied at Grant McKewan College…\n\nRead Full Biography"}, {"url": "https://www.radioswissjazz.ch/de/musikdatenbank/musiker/150836f3b9d1feea7114ccc766012a91e5afc1", "page_content": "Leider verfügen wir zur Zeit noch über keine Biografie in deutscher Sprache.\n\nBrian Hughes (musician)\n\naus Wikipedia, der freien Enzyklopädie\n\nBrian Hughes (born 1955) is a Canadian guitarist whose work draws from both the smooth jazz and world music genres. (Of the latter, his influences have thus far been primarily Latin.) Not restricted entirely to conventional guitars, Hughes has also been known to employ the oud, bouzouki and balalaika. He has for over twenty four years worked in the studio with singer/songwriter Loreena McKennitt,[1] co-produced many of her recordings, and leads her touring band. Hughes has many albums starting from the early 1990s. His music is contemporary jazz using the jazz guitar for his instrumental music. His latest release is the CD Fast Train To A Quiet Place released in July 2011. Many of his works can be heard on The Weather Channel's Local on the 8's and on Sirius XM's Watercolors channel.\n\nHughes grew up in Alberta, Canada and studied at Grant MacEwan College (now MacEwan University) in Edmonton and the Banff School of Fine Arts with guitarists Ed Bickert and Gene Bertoncini. In 1981 he moved temporarily to Los Angeles where he studied at the Guitar Institute with Pat Martino, Joe DiOrio and Robben Ford. In 1987 Hughes relocated to Toronto where he began working with harpist Loreena McKennitt and in 1991 recorded his first album as a leader for Justin Time Records. Hughes subsequently recorded \"Under One Sky\" for Justin Time in 1992 and then started his own label Sylvan House Music in 1995 which was distributed by Warner Music Canada and licensed to Higher Octave / EMI in the USA and abroad. Brian recorded three more albums (Straight To You, One 2 One and Shakin' Not Stirred) under this arrangement before releasing Along The Way with A440 music group in 2003. Hughes returned to his Sylvan House Music imprint for the release of LIVE (2007), No Reservations concert DVD (2009) and Fast Train to a Quiet Place in July 2011. Brian relocated to Los Angeles in 2000 where he continues to reside.\n\nAWARDS:\n\nBrian received the SOCAN (Society of Canadian Authors and Composers) Jazz and Instrumental Composer of the Year award in: 1997, 1998, 1999, 2000, 2001, 2006 and 2008. He was also nominated for a Juno Award as \"Producer of the Year\" in 1991 for the Loreena McKennitt album \"The Visit\".\n\nDiscography\n\nTitle Year of Release Current Label Between Dusk...And Dreaming 1991 Justin Time Records Under One Sky 1992 Justin Time Records Straight To You 1996 Sylvan House Music / Distribution 13 One 2 One 1998 Sylvan House Music / Distribution 13 Shakin' Not Stirred 1999 Sylvan House Music / Distribution 13 Along The Way 2003 Sylvan House Music Live 2007 Sylvan House Music / Distribution 13 No Reservations concert DVD 2009 Sylvan House Music / Distribution 13 Fast Train to a Quiet Place 2011 Sylvan House Music / Distribution 13\n\nYahoo Music - Brian Hughes Albums\n\nReferences\n\nYanow, Scott. [Brian Hughes (musician) at All Music Guide Brian Hughes]. AMG. Retrieved on 2 August 2011.\n\nDiese Seite wurde zuletzt geändert am 03.04.2014 00:39:21\n\n\n\nDieser Artikel basiert auf dem Artikel Brian Hughes (musician) aus der freien Enzyklopädie Wikipedia und steht unter der GNU-Lizenz für freie Dokumentation.\n\nIn der Wikipedia ist eine Liste der Autoren verfügbar."}, {"url": "https://www.wikiwand.com/en/Brian_Hughes_(musician)", "page_content": "Brian Hughes (born 5 May 1955) is a Canadian guitarist whose work draws from smooth jazz and Latin music. Hughes also plays oud, bouzouki, and balalaika. For over twenty years, he has worked in the studio with singer-songwriter Loreena McKennitt.[1] He co-produced many of her recordings and leads her touring band.\n\nCanadian guitarist (born 1955)\n\nQuick facts: Brian Hughes, Born, Genres, Occupation(s), In... ▼\n\nMusical artist"}]}