{"Brian Hughes has released several albums as a leader, including 'First Flight' (1985), and 'One 2 One' (1995).": [{"url": "https://www.allaboutjazz.com/album/one-2-one-brian-hughes-31779", "page_content": "× Welcome to All About Jazz!\n\nWe sent a confirmation message to . Look for it, then click the link to activate your account. If you don’t see the email in your inbox, check your spam, bulk or promotions folder.\n\n\n\nThanks for joining the All About Jazz community!"}, {"url": "https://www.brianhughes.com/bio", "page_content": "\n\nLos Angeles resident Brian Hughes has carved out an impressive career in the contemporary jazz arena. His first two albums, Between Dusk and Dreaming and Under One Sky, firmly established him as one of the foremost guitarists and composers in the genre, perfectly blending his fluid and emotive guitar style into an exciting, melodic mix of Latin, Jazz and World Music compositions. After being picked as a winner in JAZZIZ Magazine's \"Guitars On Fire\" competition his subsequent recordings Straight To You, One 2 One, Shakin’ Not Stirred, Along the Way, Live and Fast Train To A Quiet Place have received critical acclaim and major radio air play from coast to coast. With his sizzling fret work and infectious compositions the media are accurate in saying: \"Both a great artist and an accessible one. His passion is so obvious, intense and contagious, that his audience shares it.” Brian has received the SOCAN / BMI \"Jazz & Instrumental Composer of the Year\" award seven times from 1997 to 2011 and the title track from “Shakin’ Not Stirred” was featured on an episode of HBO’s “Sex and the City”.\n\n\n\nHughes is well known for his 35 year parallel career recording and touring with world renowned vocalist Loreena McKennitt (The Mummer’s Dance). Brian’s skills as a musician (guitars, oud, bouzouki) are in the foreground on her 2019 release \"Live at the Royal Albert Hall\" and his production & mixing talents are evident on her 2012 Grammy nominated recording “Troubadours on the Rhine”. McKennitt has sold over 15 million albums worldwide and Brian has toured the world several times with her, appearing on the \"Late Show\" with David Letterman and receiving a Juno (Canadian Grammy) nomination as \"Producer of the Year” for his work on her platinum selling, Juno award winning album “The Visit”.\n\nBrians' new side project Secret Sky brings together three of the most exciting and creative forces in Celtic/World music; Brian Hughes (guitars, oud & bouzouki), Caroline Lavelle (cello & vocals), and Hugh Marsh (fiddle). The three met over 20 years ago and have played together in Loreena McKennitt’s band since. Their eponymous debut album is produced by Brian Hughes, and is an exciting collaboration that brings thrilling power and emotional depth to both traditional and self-penned songs.\n\n\n\nHughes has also accompanied Celtic music legends, The Chieftains, on several tours and has Produced and Mixed several international platinum selling albums for Greek recording artists Alkistas Protopsalti, Evanthia Reboutsika, Yannis Kotsiras and Panayotis Kalantzopoulos, including the soundtrack for A Touch of Spice the top grossing film in Greek cinema history.\n\n"}, {"url": "https://www.discogs.com/release/6331581-Brian-Hughes-One-2-One", "page_content": "One 2 One\n\nHere We Go\n\nWhile The World Slowly Turns\n\nNothing In This World\n\n8\n\nThe Way It Is"}, {"url": "https://www.celebsagewiki.com/brian-hughes-musician", "page_content": "Age, Biography and Wiki\n\nBrian Hughes was born on 5 May, 1955 in Vegreville, Canada, is a Musician, composer, producer. Discover Brian Hughes's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 68 years old?\n\nPopular As N/A Occupation Musician, composer, producer Age 68 years old Zodiac Sign Taurus Born 5 May 1955 Birthday 5 May Birthplace Vegreville, Canada Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 5 May. He is a member of famous Musician with the age 68 years old group.\n\nBrian Hughes Height, Weight & Measurements\n\nAt 68 years old, Brian Hughes height not available right now. We will update Brian Hughes's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nBrian Hughes Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Brian Hughes worth at the age of 68 years old? Brian Hughes’s income source is mostly from being a successful Musician. He is from Canada. We have estimated Brian Hughes's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Musician\n\nBrian Hughes Social Network\n\nTimeline"}, {"url": "https://www.allmusic.com/artist/brian-hughes-mn0000620614/discography", "page_content": "Discography Brian Hughes Follow Artist +\n\nA versatile guitarist with a sound of his own, Brian Hughes creates unclassifiable music that is both accessible and at times adventuruous. He grew up in Alberta, Canada and studied at Grant McKewan College…\n\nRead Full Biography"}, {"url": "https://www.brianhughes.com/discography", "page_content": "Albums by Brian Hughes:\n\n\n\nBetween Dusk and Dreaming: 1990: Guitars, Compositions, Producer.\n\n\n\nUnder One Sky: 1992: Guitars, Compositions, Producer.\n\n\n\nStraight To You: 1995: Guitars, Compositions, Producer.\n\n\n\nOne 2 One: 1998: Guitars, Compositions, Producer.\n\n\n\nShakin’ Not Stirred: 1999: Guitars, Compositions, Producer.\n\n\n\nAlong The Way: 2003: Guitars, Compositions, Producer.\n\n\n\nLive: 2007: Guitars, Compositions, Producer.\n\n\n\nNo Reservations (concert DVD): 2009: Guitars, Compositions, Producer.\n\n\n\nFast Train To A Quiet Place: 2011: Guitars, Compositions, Producer.\n\n\n\nAlbums with Secret Sky:\n\n\n\nSecret Sky: 2016: Guitars, Oud, Bouzouki, Synths, Arrangements and Compositions, Producer\n\nSecret Sky: Opium: 2023: Guitars, Oud, Cuatro, Synths, Arrangements and Compositions, Producer\n\n\n\nAlbums with Loreena McKennitt:\n\n\n\nParallel Dreams: 1989, Guitars, Co-Producer\n\n\n\nThe Visit: 1991, Guitars, Balaliaka, Co-Producer * Juno Award Winner Best Roots & Traditional Album, *Juno Award Nomination Producer Of The Year\n\n\n\nThe Mask and Mirror: 1994, Guitars, Oud, Co-Producer\n\n\n\nA Winter Garden: 1995, Guitars/Assistant-Producer\n\n\n\nThe Book of Secrets: 1997, Guitars, Oud/Assistant-Producer\n\n\n\nLive in Paris and Toronto: 1998, Guitars, Oud, Bouzouki, /Assistant-Producer\n\n\n\nAn Ancient Muse: 2006, Guitars, Oud, Bouzouki, /Assistant-Producer *Grammy Nominated Album\n\n\n\nA Midwinter Night’s Dream: 2008, Guitars, Oud, Bouzouki, /Assistant-Producer\n\n\n\nA Mediterranean Odyssey: 2009, Guitars, Oud, Bouzouki, /Assistant-Producer\n\n\n\nThe Wind that Shakes the Barley: 2010, Guitars, Bouzouki, /Assistant-Producer\n\n\n\nTroubadours on the Rhine: 2012, Guitars / Mixing Engineer * Grammy Nominated Album\n\n\n\nThe Journey So Far (The Best Of) & Live In Europe: 2014, Guitars, Oud, Bouzouki, Mixing Engineer (Live In Europe).\n\nLost Souls: 2018, Guitars, Bouzouki, Assistant Producer"}, {"url": "https://ukcountryradio.com/artists/brian-hughes", "page_content": "Brian Hughes is now established as one of the UK’s finest ‘Modern Country’ singer/songwriters.\n\nBorn on the shores of Loch Lomond, Scotland, Brian has been in involved in music all his life, and a chance encounter with Mary Chapin Carpenter guided him towards country music, having had no connection with it previously. With her encouragement, he decided to follow a full time career in music and was fortunate to have his songwriting talents recognised by American publishing house AMG to whom he was signed. He subsequently played several US dates including a support slot for Phil Vassar in Nashville, Tennessee.\n\nBrian has taken his band The LoneSharks out on the road for the last six years where they have converted a host of doubters as to whether country music can be ‘done properly’ here in the UK and thanks to him, more British artists are putting more of their own material in their sets.\n\nFollowing his last successful European tour, Brian felt the band had gone as far as they could, and 2011 sees him take ‘Brian Hughes and his Band’ on the road with mainstream gigs in the major Scottish cities to test the water with a wider audience. Offers to tour Europe again, and also Australia and New Zealand have been received and are being considered, although British country music fans may not see a lot of him next year, so should take the chance to do so when they can."}, {"url": "https://www.guitarsite.com/newsletters/021216/3.shtml", "page_content": "Contact | Contents | Privacy Policy | Forum\n\nCopyright © 1999 - 2023 , All Rights Reserved.\n\nAffiliate Notice: As an Amazon Associate we earn from qualifying purchases."}, {"url": "https://www.folkandhoney.co.uk/all-our-uk-gigs/brian-hughes-a3697/", "page_content": "Edit Artist\n\nFolk Bands and Artists\n\nBrian Hughes\n\nBrian Hughes began playing traditional Irish music at a very young age, in his home town of Athy Co Kildare. By the age of 14 yrs, Brian had made TV appearances and had won County, Provisional, and All Ireland Titles on Tin Whistle and Flute. It was around this time that Brian developed a keen interest in the art of Uilleann Piping, and he attended classes in the Pipers Club in Dublin for many years.\n\n\n\nOver the following years, Brian became a well-known name in the world of traditional Irish music, and in 1997 he recorded and released his debut solo album, Whistle Stop, on the Gael Linn label.\n\n\n\nBrian has also recorded on the Clo Iar Connachta label and to date has recorded 5 albums, including a beautiful Airs project with the multi-instrumentalist Garry O Briain, and also a major musical suite for Uilleann Pipes, Whistle and orchestra, which Brian composed to celebrate the 100 anniversary of Ernest Shackleton’s famous Endurance voyage.\n\n\n\nBrian Hughes has recorded with the very best in traditional Irish music over the last 20 years. He has produced the greatest body of whistle music ever recorded, and he is widely regarded as being one of the finest whistle players of his generation.\n\n\n\nBrian has been teaching for many years, both privately and at the many Summer Schools across the country each Summer.\n\n\n\nIt is now 20 yrs since Brian recorded his debut album in 1997, and to celebrate this he will release a new album this October, which will contain some of the recording highlights over this time. Tracks from all 5 albums will be included, and it should produce a definitive insight into the many styles, sounds and arrangements which were used on the different recordings, and the amazing musicians who have been involved along the way.\n\n"}, {"url": "https://www.highresaudio.com/en/album/view/tfpvyy/secret-sky-and-brian-hughes-featuring-caroline-lavelle-opium", "page_content": "Opium, the highly anticipated follow-up to Secret Sky's eponymous debut. Featuring the evocative vocals of Caroline Lavelle and the masterful guitar work of Brian Hughes, Secret Sky weaves together a tapestry of Pop and World music with exotic textures of the Middle Eastern Oud, Puerto Rican Cuatro, and the hypnotic Greek Lyra played by a contemporary master of the Lyra, Sokratis Sinopoulos. Opium takes the listener on a remarkable musical journey accompanied by an All-Star cast of musicians. Caroline Lavelle and Brian Hughes have performed together for over 20 years when Caroline joined Brian as a member of Loreena McKennitt’s recording and touring ensemble. The idea for Secret Sky was born on a shuttle ride from their hotel to the Sao Paulo airport at the end of a South American tour with Loreena in 2013. After sending numerous songs and recordings back and forth via the internet, Caroline from Cornwall, UK and Brian from Los Angeles the result was their 2016 self-titled debut album Secret Sky. Guitarist, Composer, and Producer Brian Hughes has been honored with the SOCAN / BMI Jazz & Instrumental Composer of the Year award seven times from 1997 to 2011 for his eight contemporary jazz recordings while his 36-year parallel career with Loreena McKennitt led to him receiving a Juno (Canadian Grammy) nomination as Producer of the Year for his work on her platinum-selling album, The Visit. Brian and Caroline’s skills as musicians are in the foreground on Loreena’s 2019 release \"Live at the Royal Albert Hall\" and on her 2012 Grammy-nominated trio recording “Troubadours on the Rhine”. McKennitt has sold over 15 million albums worldwide and Hughes along with Secret Sky bandmate Lavelle continue to appear together on numerous tours and recordings with Loreena. Caroline Lavelle’s first foray as a vocalist was with Massive Attack, which brought her to the attention of William Orbit, who produced her first CD Spirit which garnered critical and popular acclaim. Among others, she has sung and / or played with Radiohead, Peter Gabriel, Vangelis, De Dannan, The Chieftains, Muse and The Indigo Girls. Her two other solo CDs (Brilliant Midnight and A Distant Bell) have produced songs since used on film & TV soundtracks including Six Feet Under, Joyride (John Dahl), The Eye of the Beholder (Ewan McGregor & Ashley Judd). Caroline Lavelle, vocals, cello Brian Hughes, guitar Special guests: Hugh Marsh, violin Tal Bergman, drums, percussion Tim Landers, bass Sokratis Sinopoulos, Lyra Matt Rohde, Hammond B3 organ Clare Kenny, bass (track 8) Produced by Brian Hughes\n\n\n\nCaroline Lavelle\n\nis a British cellist, composer, and singer / songwriter. She has released three solo albums, collaborated with numerous international musicians, and is currently a member of the trio Secret Sky.\n\nHer career as a cello player started by chance: as a child, she’d been desperate to play the violin. On the day instruments were distributed, she was at the back of the queue. As luck would have it, when it was her turn, only a bassoon and a cello were left. Choosing the latter, she went on to study at the prestigious Royal College of Music in London. After graduating, she opted out of the orchestral route, preferring to perform her own compositions. “The creativity involved in writing one’s own music and having to marry lyrics and arrangements is much more challenging for me. My greatest love is writing.”\n\nCaroline Lavelle in the 1980sIn the early 80’s Caroline recorded with acts such as Siouxie And The Banshees and Fun Boy Three, and busked in London with a group called Humoresque, together with Anne Stephenson and Gini Ball. Frankie Gavin from De Dannan spotted her busking, leading to a stint with the band for several years until the early ’90s. From this period onwards, Caroline worked with a wide variety of acts (Radiohead, The Cranberries, Peter Gabriel, Nigel Kennedy, Ryuichi Sakamoto, among others), and provided vocals for artists such as Vangelis and Hector Zazou. Her vocal contribution to Massive Attack’s song Home Of The Whale in 1992 led to her work on the soundtrack to the film The Eye Of The Beholder.\n\nIt was Home Of The Whale that also brought her to the attention of William Orbit, who asked her to work on an album. The resulting album (Spirit, 1995) featured a mix of traditional songs and original material written by Caroline, featuring William Orbit’s trademark production. It garnered critical and popular acclaim and The Times reported that it had inspired Madonna’s Ray of Light album.\n\nIn 2001 she released Brilliant Midnight, an album focusing more on Caroline’s skills as a songwriter and producer of her own material, organically blending her own classically inspired instrumentation with electronic arrangements. A year later, Caroline set up her own record label Ringing Tree Records, re-releasing Brilliant Midnight in a revised edition, reflecting the vision she initially had for that album.\n\nA Distant Bell followed in 2004, and was met with positive reviews. The pastoral A Distant Bell could be described as Chamber Folk, and featured original material, traditional songs, and Caroline’s musical settings of Brian Patten’s poetry.\n\nTogether with Justin Elswick and Israel Curtis she has released several tracks for a project entitled Spythriller. A full-length album is in the works. In 2015 Caroline formed the band Secret Sky with Brian Hughes and Hugh Marsh. Having met 20 years earlier in 1995, the three have been playing as a part of Loreena McKennitt’s band ever since. Their self-titled debut album was released in 2016. The band is currently working on a follow up album.\n\nBrian Hughes\n\nLos Angeles resident Brian Hughes has carved out an impressive career in the contemporary jazz arena. His first two albums, Between Dusk and Dreaming and Under One Sky, firmly established him as one of the foremost guitarists and composers in the genre, perfectly blending his fluid and emotive guitar style into an exciting, melodic mix of Latin, Jazz and World Music compositions. After being picked as a winner in JAZZIZ Magazine's \"Guitars On Fire\" competition his subsequent recordings Straight To You, One 2 One, Shakin’ Not Stirred, Along the Way, Live and Fast Train To A Quiet Place have received critical acclaim and major radio air play from coast to coast. With his sizzling fret work and infectious compositions the media are accurate in saying: \"Both a great artist and an accessible one. His passion is so obvious, intense and contagious, that his audience shares it.” Brian has received the SOCAN / BMI \"Jazz & Instrumental Composer of the Year\" award seven times from 1997 to 2011 and the title track from “Shakin’ Not Stirred” was featured on an episode of HBO’s “Sex and the City”.\n\nHughes is well known for his 35 year parallel career recording and touring with world renowned vocalist Loreena McKennitt (The Mummer’s Dance). Brian’s skills as a musician (guitars, oud, bouzouki) are in the foreground on her 2019 release \"Live at the Royal Albert Hall\" and his production & mixing talents are evident on her 2012 Grammy nominated recording “Troubadours on the Rhine”. McKennitt has sold over 15 million albums worldwide and Brian has toured the world several times with her, appearing on the \"Late Show\" with David Letterman and receiving a Juno (Canadian Grammy) nomination as \"Producer of the Year” for his work on her platinum selling, Juno award winning album “The Visit”.\n\nBrians' new side project Secret Sky brings together three of the most exciting and creative forces in Celtic/World music; Brian Hughes (guitars, oud & bouzouki), Caroline Lavelle (cello & vocals), and Hugh Marsh (fiddle). The three met over 20 years ago and have played together in Loreena McKennitt’s band since. Their eponymous debut album is produced by Brian Hughes, and is an exciting collaboration that brings thrilling power and emotional depth to both traditional and self-penned songs.\n\nHughes has also accompanied Celtic music legends, The Chieftains, on several tours and has Produced and Mixed several international platinum selling albums for Greek recording artists Alkistas Protopsalti, Evanthia Reboutsika, Yannis Kotsiras and Panayotis Kalantzopoulos, including the soundtrack for A Touch of Spice the top grossing film in Greek cinema history.\n\nBrian's new project Secret Sky brings together three of the most exciting and creative forces in Celtic/World music, Brian Hughes, (guitars, bouzouki and oud), Hugh Marsh, (fiddle), and cellist and singer Caroline Lavelle. The three met over 20 years ago and have recorded and toured together in Loreena McKennitt’s band since. Their soon to be released debut CD \"Secret Sky\", produced by Brian Hughes is an exciting collaboration, bringing thrilling power and emotional depth to both traditional and self-penned songs. Brian Hughes and Hugh Marsh are electrifying live improvisers as anyone who has been at a Loreena McKennitt concert will testify, and this album has allowed them the freedom and space to achieve the passionate feel reminiscent of some of the expansive, filmic albums of the 70s. Caroline Lavelle’s trademark sultry voice occupies a greater range than she has used to date, ranging from the intimately delicate to a powerful folk rock persona, with her emotional cello playing making up a formidable range of talents across the trio. The other player's on the CD are drummer Tal Bergman (Loreena McKennitt, Joe Bonamassa, Rod Stewart, Simple Minds, Billy Idol) and bassist Tim Landers (Loreena McKennitt, Stevie Nicks, Tori Amos, Jethro Tull, BB King).\n\n"}]}