{"Rickey Paulding played in four preseason games for the Detroit Pistons.": [{"url": "https://www.euroleaguebasketball.net/euroleague/players/rickey-paulding/profile/jfx/", "page_content": "About RICKEY PAULDING\n\nPlayed high-school basketball at Renaissance HS, Detroit.\n\nPlayed college basketball at Missouri University (2000-04).\n\nMoved to Israel for the 2004-05 season, signed by Hapoel Jerusalem.\n\nMoved to France for the 2005-06 season, signed on November '05 by ASVEL Villeurbanne.\n\nSigned for the 2006-07 season by BCM Gravelines-Dunkerque.\n\nMoved to Germany for the 2007-08 season, signed by EWE Baskets Oldenburg.\n\nHe's still playing there."}, {"url": "https://basketball.realgm.com/player/Ricky-Paulding/Summary/418", "page_content": "The Improbable, Inevitable Miami Heat by John Wilmes It was not foreseeable Miami would defeat the most talented teams in the sport, flaring an unusual ability to find and corner the frightened child within some of the NBA's biggest stars.\n\nNBA Draft Report: Cason Wallace Of Kentucky by Zachary Cohen Cason Wallace is a plus defender with an NBA ready jumper that can immediately help a lot of basketball teams, and he's going to be a chameleon in the league when it comes to fit.\n\nFor The Nuggets, Attention Isn't the Prize by John Wilmes Your life is certainly better if you don't make yourself think like a media executive, but the exercise may be useful to those acting confused about why a business-first basketball team with minimal mainstream history and no loud characters has been under-publicized."}, {"url": "https://germanhoops.com/2010/12/09/a-conversation-with-rickey-pauldingewe-baskets-oldenburg/", "page_content": "Rickey Paulding is a 28 year old 196cm guard from Detroit, Michigan. He is playing his fourth season for the EWE Baskets Oldenburg. He is an exciting wing player. His natural position is small forward. He can play the 2 spot and he excels in the transition game. His suits include a nice mid-range game and getting to the basket. He played at Missouri(NCAA) from 2000-2004. He reached the NCAA Last 8 in 2002. In 2004, he was drafted by Detroit Pistons (NBA,2rd(54)). In 2004-2005, he played for Hapoel Jerusalem (Israel-Premier L.): ULEB Cup: 10 games: 9,2ppg, 3.5rpg, 1.6spg, FGP: 64.7%, 3Pts: 25.0%; Israeli Premier League: 22 games: 12.5ppg, 4.4rpg, 1.9apg, 1.2spg, 2FGP: 58.5%, 3FGP: 51.9%. In 2005-2006, he played for ASVEL Lyon-Villeurbanne (France-ProA): ULEB Cup: 12 games: 10.8ppg, 2.7rpg, 2.3apg, 1.1spg, 2FGP: 58.5%, 3FGP: 32.7%, FT: 70.4%; French League: 24 games: 9.7ppg, 2.6rpg, 1.7apg, 1.0spg, FGP: 43.4%, 3PT: 32.3%, FT: 69.8%. In 206-2007, he played for BCM Gravelines Dunkerque Grand Littoral (France-ProA): FIBA EuroCup: 6 games: 16.3ppg, 4.0rpg, 3.0apg, 1.5spg, 2FGP: 65.8%, 3FGP: 37.5%, FT: 53.8%; French League: 33 games: 13.2ppg, 3.3rpg, 2.5apg, 1.2spg, FGP: 47.3%, 3PT: 35.5%, FT: 69.7%. He has played for The EWE Baskets Oldenburg since 2007 winning the BEKO BBL title in 2009. Last season, he played 10 games: 11.0ppg, 2.2rpg, 2.0apg, FGP: 42.0%, 3PT: 26.2%, FT: 71.4%; German League: 36 games: 13.2ppg, 3.0rpg, 2.2apg, 1.0spg, FGP: 55.5%, 3PT: 33.2%, FT: 72.6%. He spoke to German Hoops about basketball.\n\nWhat is your impression of MBC this season?\n\nThey lost some key players, but they are still a tough team. You always will hav eto give them respect because they are a good team.\n\nAre you surprised how well the EWE Baskets have played in the first two months despite so many new players?\n\nI am a little surprised, but I am very happy the way we are playing. It is never easy with a new team and everyone gelling. We will have some growing pains, but it is good that we are winning now.\n\nHow important have been the signing of Nemanja Protic and Mindaugas Lukauskis?\n\nThey have been very important. Protic has done a good job learning our system and running the team. He is a quick guard. Lukauskis gives us a lot of veteran leadership.is a great shooter, is always under control and always a threat from the bench.\n\nCoach Predrag Krunic always seems to find the right players from eastern Europe. Why does he seem to have that right feeling for the right players?\n\nI dont know, but I guess he has the expertise. He always looks for players with the right character in a player and does a good job finding those type of players.\n\nAlba Berlin and The Brose Baskets Bamberg are the two top teams and favorite to with the 2011 BEKO BBL title. When will Oldenburg be where they are?\n\nI hope that we can be where they are. They play very well, but we can´t worry about them, but take each game at a time. We are anew group, but I hope that we can be in the mix with them at the end of the season.\n\nYou are playing your fourth season with The EWE Baskets Oldenburg. What makes Oldenburg so special?\n\nI like Oldenburg. It is small, but not to small. I feel very comfortable raising my family in Oldenburg. The club takes care of me and I like what coach Krunic is doing for the club. I am happy they wanted me around another season.\n\nYou are a very versatile player, but only fourth in scoring. Has your role changed this season?\n\nI dont think my role has really changed. There are many guys scoring this season and with a new team it is a part of the growing pains. My shot isn´t falling the way it should, but I dont want to focus on scoring, but helping the team win and do my job rebounding and playing defense.\n\nWould you like to get more shots in games?\n\nEvery player always want more touches, but as long as we are winning, I am happy. We have many different guys like Campbell, Protic or Stevic that can step up on any given night. I hope that my night will come soon.\n\nYour friend Jimmy Mckinney was injured again this season. He is a real fighter. What makes him so strong that he keeps coming back from injuries?\n\nMckinney has a good staff in Frankfurt. He is young and is a good kid. He has been lucky that he hasn´t had a too serious injury where he couldn´t come back from. He has a strong focus to come back and help the team.\n\nWhat is a strength in your game that doesn´t always get noticed right away?\n\nI am known as an athletic player that can get to the basket, but I think that my defense doesn´t always get noticed.\n\nIf you could ask Allen Iverson one question what would you ask him?\n\nI would ask him he had any regrets how his career has gone the last few years since he always had had a great career.\n\nYou played against Skyliner Roger Powell. How important is he for the BEKO BBL?\n\nI remember that he and Illinois always beat us at Missouri. He is really important for the league. He will get even more fans involved. he is a great guy with a good character and is very mature.\n\nWho wins a 1-1, you or Mindaugas Lukauskis?\n\nI would win, but he is a crafty slick ball handler and can shoot the ball. I would have to stay on my feet, because you can´t give him the open shot.\n\nHow well will the Miami Heat do with Lebron James?\n\nThey will play at the top. They will begin to click more and more as season progresses. I hope they beat Boston in the east, but Boston is strong on defense.\n\nWhat was the last DVD movie that you saw?\n\nIron Man 2\n\nThanks Ricky for the chat."}, {"url": "https://www.proballers.com/basketball/player/14025/rickey-paulding", "page_content": "Rickey Paulding - Points Rickey Paulding scores a career high 39 points (2007) On May 02, 2007, Rickey Paulding set his career high in points in a France - Betclic Elite game. That day he scored 39 points in Gravelines's home win against Orléans, 99-96. He also had 4 rebounds and 1 block. He shot 7/8 from two, 6/8 from three, shooting at 81.3% from the field. He also shot 7/8 from the free-throw line.\n\nRickey Paulding - Rebounds Rickey Paulding grabs a career high 11 rebounds (2004) On October 30, 2004, Rickey Paulding tied his career high in rebounds in a Israel - Winner League game. That day he grabbed 11 rebounds in Hapoel Jerusalem's road win against Bnei Herzeliya, 77-82. He also had 16 points, 2 assists and 2 blocks.\n\nRickey Paulding - Assists Rickey Paulding gives a career high 9 assists (2004) On February 15, 2004, Rickey Paulding set his career high in assists in a NCAA game. That day he dished 9 assists in Missouri Tigers's home win against UNLV Runnin' Rebels, 94-60. He also had 12 points, 3 rebounds, 1 steal and 1 block.\n\nRickey Paulding - Steals Rickey Paulding has a career high 7 steals (2004) On February 10, 2004, Rickey Paulding set his career high in steals in a NCAA game. That day he reached 7 steals in Missouri Tigers's home win against Colorado Buffaloes, 77-65. He also had 10 points, 3 rebounds and 3 assists.\n\nRickey Paulding - Blocks Rickey Paulding blocks a career high 3 shots (2007) On February 03, 2007, Rickey Paulding tied his career high in blocks in a France - Betclic Elite game. That day he went for 3 blocks in Gravelines's home win against EBPLO, 69-60. He also had 10 points, 7 rebounds and 2 assists."}, {"url": "https://pistonpowered.com/2022/10/14/detroit-pistons-battle-back-end-rotation/", "page_content": "Keon Johnson #6 of the Portland Trail Blazers is guarded by Braxton Key #8 of the Detroit Pistons. (Photo by Ethan Miller/Getty Images)\n\nWill the Pistons be in a big hole after the first 10 games?\n\nWill the Pistons be in a big hole after the first 10 games? by Aaron Kellerstrass\n\nThe Detroit Pistons finished their perfect defeated preseason, dropping their fourth in a row to the Memphis Grizzlies last night.\n\nWins and losses aren’t important in the preseason, but the Pistons didn’t look great, though they did have some nice moments in the finale.\n\nThe team still has a ton of question marks around the starting lineup and rotation, especially after Marvin Bagley III went out with an injured knee.\n\nWith Alec Burks, Nerlens Noel and Hamidou Diallo all banged up and possibly missing the start of the season, someone is going to have to pick up those minutes in the 10-man rotation.\n\nIt may change from night to night depending on matchups, but who is currently winning the battle for the back end of the rotation?\n\nDetroit Pistons rotation: Which two-way guy will get a shot?\n\nStanley Umude, Jules Bernard and Buddy Boeheim\n\nAll three of these guys played sparingly in preseason and will not be on the roster for the start of the year unless 3-4 more guys go down with injury.\n\nAll of them need reps and will get them in the G-League. Umude was the best of the three but none of them did much in their limited run.\n\nKevin Knox\n\nKnox got his first action last night and played 18.5 minutes against the Grizzlies, scoring 13 points on 4-of-9 shooting overall.\n\nWe got a glimpse of what Knox can do for this team, which is to provide some outside shooting, as he hit 3-of-6 from long range. Knox has always been a streaky shooter, but if he can consistently knock them down, he has a chance to make this rotation even if everyone is healthy, as Detroit is desperate for shooting.\n\nBraxton Key\n\nBraxton Key played in all four preseason games and averaged 17.5 minutes off the bench. Key is not spectacular by any means, but he is solid in pretty much every area of the game and is a more versatile defender than Knox.\n\nKey averaged six points and four rebounds in the preseason and knocked down 50 percent of his 3-point attempts, though he only took 1.5 per game on average. If Key can continue to hold his own on defense and knock down shots, he’ll be the frontrunner for early minutes if all of these guys are still out.\n\nKey is a glue guy who always seems to be in the right place, though he is not great at any one thing.\n\nIf the Detroit Pistons still have several players injured in the first few games of the season, I think we’ll see both Key and Knox depending on the matchup and what they need at the moment. If Knox can hit shots though, he could work his way into the rotation even after all of the regulars get back."}, {"url": "https://www.espn.com/nba/draft/d04/tracker/player?playerId=78634", "page_content": "Summary: Rickey Paulding Notes:After having a phenomenally successful sophomore year where many NBA scouts predicted that Paulding would be a lottery pick, he suffered setbacks during his junior and senior campaigns that have made them rethink his draft stock. Upside: He's a very athletic slasher who uses his athleticism to elevate over his opponents. His vertical leap is off the charts. Has a nice mid-range jumper. A good ball handler. Good lateral quickness should allow him to be a decent defender in the pros. Has a good body. Downside: Consistency and that outside shot. Paulding took a 158 threes this season, but made just 34 percent. Last year he was much more effective from downtown. This year he was just streaky. Made four or more threes five times during the season. Missed four or more threes eleven times. Insider Projection: The biggest problem was consistency. The Tigers never knew who was going to show up. Paulding was huge in several big games this year including a 31 point performance (shooting 5-fot-7 from three) against Oklahoma State. But he also had a number of nine point stinkers against Kansas, Kansas State and Texas A&M. Scouts feel that his game is a better fit in the NBA than it was in college. However, he didn't stand out at all at the Chicago pre-draft camp. The fact that he measured at just 6-foot-4 also didn't help things. Will he even be drafted?\n\n\n\n"}, {"url": "https://www.rp23athletics.com/aboutus", "page_content": "OUR COACHES\n\nRickey Paulding is a former professional basketball player from Detroit, Michigan. He played college basketball at the University of Missouri from 2000-04. While at Mizzou he scored 1200 points and grabbed 300 rebounds, earning a spot as the 10th highest all time scorer in school history. Rickey also holds Mizzou's career record for most points scored in NCAA tournament play and is remembered by fans for scoring 36 points and making nine threes against Dwayne Wade and the Marquette Golden Eagles in the 2nd round loss of the NCAA tournament his junior year. Rickey made the decision to return to Mizzou for his senior year where he graduated with a degree in Interdisciplinary Studies.\n\n​\n\nPaulding was drafted by the Detroit Pistons, 54th overall in the second round of the 2004 NBA draft. He began his professional career in Israel with Hapoel Jerusalem (Jerusalem, 04-05 season) and then played two years in France with Asvel Lyon-Villeurbanne Basket (Lyon, 05-06 season) and BCM Gravelines Dunkerque (Gravelines, 06-07 season). In 2007, Paulding signed in Germany with EWE Baskets Oldenburg and played there for 15 seasons. He currently holds the BBL record for most consecutive years played on one team.\n\nRickey is beloved in Oldenburg where fans refer to the name of the city as “Pauldingburg” or to Rickey as “Mr. Oldenburg.” He has received many awards and honors while with EWE Baskets.\n\n​​​\n\nRickey and his wife Kara, have two sons, Tre and Sidney and a daughter Marleigh. Rickey retired from the game he loves in 2022 and currently resides in Lee's Summit, MO.\n\nAwards and Honors:"}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=5958391&lang=en", "page_content": "Rickey Paulding (born October 23, 1982) is an American former professional basketball player. He played college basketball for the University of Missouri.\n\nEarly career\n\nPaulding attended Renaissance High School in Detroit. In his senior season, he averaged 25.3 points per game, and 12 rebounds per game, and led his team to a 27-3 record. He was an honorable mention All-USA selection during that season as well.\n\nCollege career\n\nIn his collegiate career, Paulding scored 1,200 points and grabbed 300 rebounds. Paulding scored 37 points and making an astounding nine threes against Dwyane Wade, Travis Diener and the Marquette Golden Eagles in the Tigers' loss in the second round of the NCAA tournament his junior year. He opted to return for his senior season.\n\nProfessional career\n\nPaulding was drafted 54th overall in the second round of the 2004 NBA draft by the Detroit Pistons. Paulding averaged 12.2 points per game in the NBA Summer League for the Pistons.\n\nAt the end of 2021–22 season, he has decided to retire from professional basketball.\n\nCareer statistics\n\nBundesliga\n\nRegular Season\n\nPlayoffs\n\nBBL-Pokal\n\nAwards and honors\n\n2003 Wooden Award pre-season finalist\n\n2003 Second Team All Big 12\n\nScored 36 points in the NCAA Tournament against Marquette.\n\nMade 9 three-point field goals against Marquette\n\n7th Highest all time scorer at Mizzou.\n\nMost points ever scored on former NBA player Dwyane Wade in a single NCAA game.\n\nStarter for the Northern All-Star Team in the Basketball Bundesliga All-Star Games 2009-2011.\n\n2009 BBL Finals MVP after leading EWE Baskets Oldenburg to the league title.\n\nMost Likeable Player of the 2008/2009 Basketball Bundesliga Season\n\nReferences"}]}