{"Charles Melville Hays rose through the ranks of the GTR, becoming general manager in 1892 and president in 1899.": [{"url": "https://www.encyclopedia-titanica.org/titanic-victim/charles-melville-hays.html", "page_content": "Mr Charles Melville Hays, 55, was born at Rock Island, Illinois, USA, on 16 May 1856. He was educated at the public schools of Rock Island, and went to work for the Atlantic and Pacific Railway when he was 17. At 22 he was appointed secretary to the Manager of the Missouri Pacific Railway.\n\nHe married Clara Gregg in St. Louis Mo, 13 October 1881, and they had four daughters.\n\nIn 1889 he was appointed general manager of the entire Wabash Railway network. In 1896 he moved to Montreal to become general manager of the Grand Trunk Pacific Railway. It was Hays who convinced the Canadian Prime Minister, Sir Wilfrid Laurier, of the need for a second transcontinental railroad. To this extent, the Canadian government subsidized the Grand Trunk to the tune of $30-million, and in November 1902 construction of the railroad began. The company's board of directors in England, however, were more concerned with dividends than with risky expansion. Financing proved chaotic, and at the end of 1911 the railroad was 100-million in debt. Hays went to England for a directors meeting where he proposed to spend the companys way out of bankruptcy by upgrading rolling stock, double tracking and by building a chain of luxury hotels across Canada. Hays had already built the flagship hotel, the Château Laurier in Ottawa, and had plans for six others, including the Fort Garry in Winnipeg and the Macdonald Hotel in Edmonton.\n\nHe arrived in England \"looking fagged and tired,\" according to Alfred Smithers, Chairman of the Grand Trunk's board of directors. He was supposed to spend Easter in Paris with his daughter and son in law, Thornton and Orian Davidson, but in a letter to friends in Montreal on April 1, said he preferred to stay at Smithers country estate in Kent before sailing home on 10 April on the Titanic. The recipient is unknown, partly because the letter is so hard to decipher, it is possibly Lockett Gavin Coleman, asst. superintendant of the Grand Trunk Railroad but the informality of the letter suggests it was to a close friend or relative.\n\n\n\n(Courtesy and © Craig Sopin,USA / Courtesy: Alan Hustak, Canada)\n\nDear [?Marin / Mavin] I thought you would be interested in seeing the decision in the [?Flessen - a law suit of that time] case + so enclose you the synopsis of same which please keep for my scrap book after you have read. We have been most fortunate in our weather since coming They say I always bring sunshine + the facts seem\n\nto prove it. For the second time Clara + I spent the week end at Knockholt returning to London this morning. Yesterday Mrs Hubert Clara + self motored down to Brighton for lunch had an hour there to look around and got back for eight o'clock dinner A run of over 100 miles! Thornton + Orian are in Paris + expected us to join them there for Easter + then sail from Cherbourg but we have concluded\n\nwe would like Knockholt better so shall stay here + sail via SS. Titanic on our return April 10th Clara has done well in going out, only missed one dinner so far + that Mrs [?Farsonns / Faesonns]. Dined at Sir Henry Jacksons Thursday tonight [?dine] with Smithers + theatre afterwards. I am deserting her + [???] with Sir Fd. v. Schuster at Brooks. Club! We dine at Lord Welbys Wednesday. Have just being to lunch with Lord Grey. Clara is\n\nwell and I have been feeling much better, my dispepsia practically all gone- Mrs Smithers + Eva are still at [?Mentone] + will not be home in time to see us. I hardly know when this will reach you so will send your Uncle Jim my love to Cousin Jane + himself + to to rest of the folks. I hope you are feeling all right again.\n\nLovingly\n\nC.Mel. Hays\n\nWhile in England he recieved news that the third of his four daughters, Louise, was having a difficult pregnancy and might have to be delivered by Ceasearean section. ANother reason for his return was the imminent opening of the Château Laurier Hotel on April 26. Travelling with him would be Paul Romaine Chevré, the sculptor who had done the bust of Laurier that still stands in the lobby.\n\nIn his business dealings Hays had had discussions with the White Star Line about speeding travellers from Europe to the Orient using White Star ships and his transcontinental railroad. As a result, J. Bruce Ismay invited Hays and his entourage as guests aboard Titanic. They paid £93 10s to cover incidental expenses, travelled on ticket number 12749, and occupied four cabins: B-69-71-73 and B-24. (Mr and Mrs Hays in B-69, Thornton and Orian Davidson in B-71, their maid Miss Perreault in B-73 and Hays secretary, Vivian Payne, in B-24).\n\nOne hour before the disaster, Hays relaxed with Colonel Archibald Gracie and Captain Edward Crosby in the Gentlemen's Smoking Lounge and they talked about the technological advances in transportation. At one point, Hays conceded that while Titanic was a superlative vessel, he expressed concern that \"the trend to playing fast and loose with larger and larger ships will end in tragedy.\" Twenty minutes later, Titanic struck the iceburg. Hays never believed the ship would sink quickly. As he put his wife and daughter into a lifeboat he assured them Titanic would stay \"afloat for at least 10 hours.\"\n\nHays drowned in the disaster, but the Minia recovered his body on 26 April. \"It was no trouble to identify him as he had a lot of papers on him and a watch with his name on it,\" sailor Francis Dyke wrote to his mother. His coffin was brought back to Montreal for burial aboard his private railway car, Canada. The car is still preserved and on display at the Canadian Railway Museum near Delson, Quebec.\n\nSimultaneous funerals for Hays were held on 8 May at the American Presbyterian Church in Montreal...\n\n\n\n(Courtesy: Alan Hustak, Canada)\n\nand at the Church of St. Edmund King and Martyr in London. At 11:30 a.m. on the day of the funeral, as the Montreal Herald Reported:\n\n\"From Montreal to Chicago, from New Brunswick to the Pacific coast, in all the thousands of miles of sidings and branch lines owned and operated by the Grand Trunk Railway, in every Grand Trunk Depot, at every Grand Trunk crossing, action ceased for the space of five full minutes as the Grand Trunk Railway system paid its respects to the memory of its great departed chief. For five minutes activities were suspended and the thousands of individuals who serve the great system invarious capacities bowed their heads in silent tribute. Then once more work resumed, the wheels turned, and in 30 seconds things had been as they had before.\"\n\n\n\nCourtesy: Alan Hustak, Canada\n\nHays is buried in the Pine Hill Section, (Lot 246) of Montreals' Mount Royal Cemetery. A massive monument is inscribed: \"And so he died and the example of his simple, devoted consecrated life is our priceless heritage. We are a different people, we are a better people, because this man worked and loved and died.\"\n\nCourtesy: Alan Hustak, Canada Courtesy: Diane Lapierre, Canada\n\nThe town of Melville in Saskatchewan and Hays in Alberta, Canada are named for him, and a statue in his memory was erected in Prince Rupert, B.C. which would have been the Pacific terminus city of the transcontinental railroad he had planned to build.\n\nIn 1919 the Grand Trunk Railroad was placed in recievership, and later was absorbed into Canadian National Railways.\n\nNotes\n\nIn 1907 Hays was given Japan's highest decoration, the Order of the Rising Sun by Prince Fushimi, and in 1910 was offered a knighthood but turned it down because to become Sir Charles would have meant giving up his U.S. citizenship. His Japanese decoration can be seen today at the Lyman House Memorial Museum in Hilo, Hawaii."}, {"url": "https://www.encyclopedia-titanica.org/charles-melville-hays-1.html", "page_content": "Grand Trunk President Planned Great Canadian Transcontinental\n\n---\n\nCharles Melville Hays, President of the Grand Trunk and Grand Trunk Pacific Railway Companies, has been considered one of the most brilliant and successful of railroad officials. He was born at Rock Island, Ill., May 16, 1856. His school education was completed when he was 17 years of age.\n\n\n\nHis first work in the railroad world was in the passenger department of the Atlantic & Pacific Railroad in St. Louis. He was soon promoted to an important position in the ofice [sic] of the auditor of the road, and later was transferred to the General Superintendent's office, where he remained until 1877. That year he was made Secretary to the General Manager of the Missouri Pacific Railroad. In 1886 he became Assistant General Manager of the road. One year later he was appointed General Manager of the Wabash, St. Louis & Pacific, and later became Manager of the Wabash Western.\n\n\n\nWhen the consolidation of the Wabash lines took place, Mr. Hays was made Vice President of the company and General Manager of the lines of the whole system. This position he retained until his Grand Trunk appointment. At that period he held the following directorships and important railroad positions: Director of the Chicago & Western Indiana Belt Railway of Chicago, Detroit Union Railway and Station Company, Keokuk Union Station Company, Kansas City Union Station Company, Terminal Railroad Association of St. Louis and Chairman of its Executive Committee. He also represented the Wabash Railroad at the meetings of the Central Traffic Association, Western Passenger and Trunk Line Association. On Dec. 31, 1895, he resigned from the service of the Wabash Railroad, of which he was then General Manager and Vice President, to accept the position of General Manager of the Grand Trunk Railway Company of Canada, at Montreal.\n\n\n\nIn 1897 he completed the reorganization of the Central Vermont Railway Company, a subsidiary line of the Grand Trunk, of which he was then President, and in 1908 supervised the completion of the Victoria Jubilee open span double track bridge crossing the St. Lawrence River at Montreal, replacing the old single track, tubular bridge; and the single span steel arch bridge over the Niagara River at Niagara Falls, replacing the old suspension bridge at that point. Under his regime the main line of the Grand Trunk was double-tracked all the way from Ste. Rosalle, a point thirty-eight miles east of Montreal, to Chicago, a distance of 878 miles.\n\n\n\nUpon the death of the late Collis P. Huntington, the President and a large owner in the Southern Pacific Company and steamship lines, controling upward of 10,0000 miles, Mr. Hays was the first choice for his successor, and the appointment was made Jan. 1, 1901. In the Autumn of the same year, he resigned and was recalled to take charge of the Grand Trunk Railway Company, of Canada, becoming Second Vice President and General Manager Jan. 1, 1902.\n\n\n\nThe same year, Mr. Hays conceived the project of the Grand Trunk Pacific Railway, which Sir Wilfrid Laurier and his Government made possible by the passage of the necessary legislation in 1903 and 1904. This line will he the only transcontinental railway wholly within Canadian territory. It will rum from Moncton, N. B., to Prince Rupert, B. C., about 3,600 miles.\n\n\n\nOn Jan. 1, 1910, Mr. Hays was elected a member of the Board of Directors of the Grand Trunk Central Railway Company, and on that date was made President of the company and its consolidated lines and subsidiary railroad and steamship companies.\n\n\n\nMr. Hays has been in full charge of the company's affairs in America. A year ago Sir Wilfrid Laurier, at a dinner of the Canadian Club of New York, held at the Hotel Astor, said:\n\n\n\n\"Mr. Hays is beyond question the greatest railroad genius in Canada. As an executive genius he ranks second only to the late Edward H. Harriman.\""}, {"url": "http://www.biographi.ca/en/bio.php?id_nbr=7430", "page_content": "HAYS, CHARLES MELVILLE, railway official; b. 16 May 1856 in Rock Island, Ill.; m. 13 Oct. 1881 Clara J. Gregg in St Louis, Mo., and they had four daughters; d. 15 April 1912 in the North Atlantic, and was buried in Montreal.\n\nCharles M. Hays grew up and received his early education in St Joseph, Mo. At 17 he began work in St Louis with the Atlantic and Pacific Railroad. In 1878 he was appointed secretary to the general manager of the Missouri Pacific and six years later he accepted a similar position with the larger Wabash, St Louis and Pacific. He became general manager of the Wabash Western in 1887 and of the entire Wabash system in 1889.\n\nA reorganization of the Grand Trunk Railway of Canada in 1895 resulted in Hays’s appointment as general manager of that system, effective 1 Jan. 1896, and his move with his family to Montreal. His predecessor, Lewis James Seargeant, became a special adviser to the GTR’s London-based board of directors. With one interruption, in 1901, Hays held his position until 1909, when he was appointed president; he was president as well of the railway’s western Canadian subsidiary, the Grand Trunk Pacific, from 1904 until his death.\n\nHe had arrived in Canada at a time of economic depression. The performance of railways had been disappointing for years, although the Canadian Pacific Railway had fared better than the larger, more heavily indebted GTR. Hays was brought in to make major managerial changes – specifically to introduce “American” methods which were more aggressive and less scrupulous than those of British systems. His first responsibility was to restructure the GTR’s administration and operations. Instead of relying only on the reports and recommendations of senior administrators in Britain, he sought the opinions and advice of operating staff in Canada. Traffic exchanges with other systems, the negotiation of running rights, and the modernization of accounting procedures solved many of the practical problems left unaddressed by the head office. Hays was even willing to sell important trackage between Toronto and Hamilton to the rival CPR, but only after the GTR had obtained an advantageous agreement on running rights. The improved efficiency resulting from these reforms coincided with an era of unprecedented growth and enabled him to bring the GTR from a state of near-bankruptcy to one of moderate success. In the process, Hays, a stocky man who invariably appeared well dressed with a neat beard, became known for his unwillingness to tolerate any interference in the way he ran the railway and for his implacable disdain for organized labour, especially during a dispute in Ontario in 1905 and a bitter, system-wide strike in 1910.\n\nAfter 1896 Canadian prosperity was based on the settlement of the prairies. To compete effectively with the CPR, Hays believed the GTR had to cross them. In 1900 he had advanced a grandiose plan to run the lines of an American subsidiary, the Grand Trunk Western, from Chicago to Winnipeg and thence to the Pacific. The directors in London rejected this proposal and in late 1900 Hays resigned to become president of the Southern Pacific Railroad in the United States as of 1 Jan. 1901. Unfortunately for him, it was taken over by the interests of railway magnate Edward Henry Harriman. Hays disagreed with the new owners and quit; by the end of 1901 he had returned to his old job, and a vice-presidency, at the GTR. In the meantime its board had been persuaded by president Sir Charles Rivers Wilson to adopt an aggressive policy of westward expansion. Significantly too, the federal government of Sir Wilfrid Laurier had decided to promote the building of a second transcontinental railway. On the failure of the GTR and the smaller, prairie-based Canadian Northern to unite on such a project, Ottawa threw its support behind the GTR. On 24 Nov. 1902 Hays formally announced plans to construct a transcontinental.\n\nThe Grand Trunk Pacific, Hays’s greatest and most controversial work in Canada, was to consist of two sections: a line west from Winnipeg and a government-built line between Winnipeg and Moncton, N.B., that was to connect with the old Grand Trunk system. Hays was responsible for the construction and operation policies of the new western line. His persistent demands for federal subsidization, however, contributed to bitter discord within Laurier’s cabinet [see Andrew George Blair*], which could not agree on a policy. In May 1903 Hays was joined by president Sir Charles Wilson, who was able to exert greater influence on cabinet; together they formed an effective team, one tough, the other smooth. Hays was willing to promise whatever Wilson thought diplomatically necessary, but he did so only if there were no real means for the government to enforce terms that the GTP might find inconvenient in the future. Nevertheless, his concessions were critically important in meeting specific political difficulties faced by Laurier when he was promoting the transcontinental scheme in parliament that summer and fall. In October the National Transcontinental Railway Act was passed and the GTP was incorporated.\n\nFour aspects of Hays’s GTP policies were particularly problematic. He seriously underestimated the Canadian Northern, whose owners he thought would sell out to him but who, instead, launched vigorous competition. A second, more difficult matter was the commitment of the GTR to the GTP. There were no existing traffic links between the two systems, and the board in London was not willing to give the western project its unqualified support. Nevertheless, Hays, acting without proper authorization from London, committed the parent company in 1903 to conditions which would ultimately ruin the GTP and the Grand Trunk. The selection in 1905 of the site of Prince Rupert, on Kaien Island, B.C., as the western terminal was the third controversial decision supported by Hays. There was little local traffic on the portion of the line in northern British Columbia, only 100 miles of which had been built by 1912, but Hays insisted that it would prove beneficial since it shortened the route to Asia.\n\nA final, disastrous decision involved the priority Hays gave to the construction of the GTP to the highest standards in North America, before a system of feeders had been developed on the prairies. The resulting delay in completion and the lack of competition allowed the CPR and the Canadian Northern to consolidate their holds on traffic on the prairies. Consequently, what was arguably the best main line across western Canada did not attract the volume of freight needed for profitable operation.\n\nHays did not live to see the GTP completed: he perished in the sinking of the Titanic in 1912. Sanctified by this tragic end and by his high social standing in Montreal, including membership in the American Presbyterian Church, he was eulogized as one of Canada’s greatest railwaymen. On 25 April 1912 work and movement on the GTR’s entire system stopped for five minutes in tribute. Hays’s legacy, however, was mixed. He presided over the most prosperous era in the history of the GTR, but as president of the GTP he initiated policies and programs which led in 1919 to the GTP being placed in receivership and to legislation authorizing federal acquisition of the GTR’s capital stock. During the proceedings of the board appointed to value this stock, it was alleged that Hays had deceived the London directors in 1903 and that they had never knowingly endorsed the scheme that led to the insolvency and nationalization of the entire system.\n\nTheodore D. Regehr"}, {"url": "https://www.titanic.memorial/post/memorial/charles+melville+hays+memorial+london/", "page_content": "The grief and sorrow which prevail throughout the civilized world as a sequence to the appalling disaster which befell the steamship Titanic are particularly profound and keenly emphasized in the minds and hearts of the Directors of the United States Mortgage and Trust Company, for among those lost was Charles Melville Hays, a member of this board since Aug. 31, 1905. ~ The New York Times, 28 April 1912\n\nLocated on the western wall of the interior of the Church of St Edmund the King in the City of London is a small brass plaque, behind glass, set into the dark, wooden panelling of the building. The memorial is dedicated one of the Titanic's first-class passengers, American Charles Melville Hays, who died in the sinking of the Titanic on 15 April 1912. Charles Melville Hays was a leading figure in the Canadian railway business and at the time of the sinking was President of the Grand Trunk Railway and the Grand Trunk Pacific Railway. He died in the sinking and his body was recovered from the North Atlantic and repatriated for burial in Montreal.\n\nCharles Melville Hays was born in Rock Island, Illinois in 1856. In 1873, by the age of 17, he was working in the railway industry for the Atlantic and Pacific Railroad company. He rose through lower managerial ranks at a number of railway companies before becoming General Manager of the Grand Trunk Railway of Canada in January 1896. In 1904 he was appointed President of the Grand Trunk Pacific Railway and later, by 1909, had succeeded to the presidency of the parent company, the Grand Trunk Railway.\n\nBiographies of Charles Melville Hays tell of his considerable business acumen but also of his ruthlessness in his business dealings. During his running of the Grand Trunk Railway he modernised and restructured the company, improving its efficiency and expanding the network, notably with the construction of the Grand Trunk Pacific Railway. However, he would not see its completion loosing his life in the sinking of the Titanic.\n\nThe memorial is in the form of a small brass plaque, set into a wooden panel within the church interior. The plaque has the following inscription:\n\nAMDG In memory of Charles Melville Hays. President of the Grand Trunk and Grand Trunk Pacific Railway Companies of Canada, who lost his life on April 15th 1912, by the foundering in mid-Atlantic, of the steamship \"Titanic\" through collision with an iceberg, while on her maiden voyage from Southampton to New York. A memorial service was held in this Church simultaneously with one at Montreal, on Thursday, April 25th 1912. This tablet with the kind permission of the Rector and Churchwardens was placed here by the Directors of the Grand Trunk Railway Company of Canada in recognition of Mr Hays great services to the company, and of his high character in public and private life.\n\nOn 25 April 1912 a memorial service for Charles Melville Hays was held in Montreal and at London's Church of St Edmund the King. At the same time operations on the Grand Trunk Railway paused for five minutes of remembrance. Following his death the directors of the Grand Trunk Railway commissioned a memorial plaque, which was installed in the Church of St Edmund the King in the City of London.\n\nMore information"}, {"url": "https://www.liquisearch.com/charles_melville_hays", "page_content": "Charles Melville Hays (May 16, 1856 – April 15, 1912) was the president on the Grand Trunk Railway. He began working in the railroad business as a clerk at the age of 17 and quickly rose through the ranks of management to become the General Manager of the Wabash, St. Louis and Pacific Railway. He became Vice-President of that company in 1889 and remained as such until 1896 when he became General Manager of the Grand Trunk Railway (GTR) of Canada.\n\nHays left GTR for a short time to serve as the President of the Southern Pacific Railway Company but returned to GTR after one year. As Vice-President and General Manager of GTR he is credited with keeping the company from bankruptcy. In 1909, he became the president of GTR and all its consolidated lines, subsidiary railroads, and steamship companies. He was known for his philanthropy and received the Order of the Rising Sun, third class, from the Emperor of Japan in 1907.\n\nHays is credited with the formation of the Grand Trunk Pacific Railway (GTP), a dream he had to create a second transcontinental railroad within the borders of Canada. He is also blamed for the insolvency of both the GTR and the GTP. He died before his dream was complete as he perished at sea in the sinking of the RMS Titanic. Before the ship collided with an iceberg, Hays made a statement that was prophetic of the disaster. His body was recovered and he was buried in Montreal. He was survived by his wife and four daughters."}, {"url": "http://www.canada-rail.com/ontario/railways/GTR.html", "page_content": "Grand Trunk Railway Reporting mark: GT\n\nFrom the mid to late 19th century, the British-owned Grand Trunk Railway (GTR) dominated the provinces of Ontario and Quebec. The GTR arrived in the mid 1850s with the opening of a much-needed line between Montreal and Toronto. By 1859, it stretched as far west as Sarnia, and as far east as Portland, Maine in the US.\n\nSir Henry Tyler\n\nGTR President, 1872-95\n\nNational Archives, R231-2261-5-E\n\nThe GTR was owned by a group of private British investors and operated out of London. To raise capital, the railway issued bonds which came attached with annual interest payments. Initially revenue was poor and the railway was often cash strapped. In 1861, the situation was so dire that the government lent the GTR $15 million to cover serious shortfalls.\n\nFollowing the government bailout, the bonds were converted to preferred shares and the GTR bounced right back. By 1869, according to some sources, it was the largest railway in the world.\n\nIt appears much of the GTR's planning was driven by shareholder concerns. The directors chose to play it safe by sticking with established routes that ran adjacent to major waterways. Growth was focused on immediate sources of revenue, rather than on building for the future.\n\nThe federal government had other obligations. As a condition of BC's entry into confederation, the government was committed to build a rail line between central Canada (Ontario and Quebec) and BC. The GTR was approached and turned the offer down flat. The company preferred to lay down tracks where the traffic was already flowing. To fulfill its obligations to BC, the government was forced to enact legislation that led to the creation of the Canadian Pacific Railway (CPR).\n\nSir Joseph Hickson\n\nGTR Manager, 1874-90\n\nNational Archives, R231-2272-X-E\n\nBy the late 1880s, the CPR was making major inroads into Ontario, long considered by the GTR to be their own private turf. The GTR complained repeatedly and bitterly, citing unfair treatment towards its shareholders due to the CPR's subsidies. The complaints fell on deaf ears. The government had a far greater stake in protecting the CPR than in smoothing the GTR's ruffled feathers.\n\nUnder general manager Joseph Hickson, the GTR continued to expand with further buyouts and mergers. Hickson scored his greatest triumph in 1880 by outsmarting the Vanderbilts and gaining access to Chicago. From 1881-90 the GTR solidified its hold in Ontario by adding another 15 railways to its network including its major rival, the Great Western Railway. Hickson was regarded as a shrewd negotiator however his main focus was not on Canada, but rather the United States, where he wanted more control over the Great Lakes.\n\nBy the 1890s the GTR's stature had expanded significantly. On the downside however, its infrastructure was aging and it was still not profitable. In 1896 the company decided to employ a bit of American know-how in the form of Charles Melville Hays, a US-born executive from the Wabash Railroad. Hays accepted the challenge.\n\nThe Twentieth Century\n\nUnder Hays, the GTR finally enjoyed its first taste of profitability. Hays spent money but spent wisely. He began with major upgrades to the infrastructure which included double tracking between Montreal and Toronto. Within a few short years, his efforts had translated into reduced costs and increased revenue, much to the delight of the shareholders. He followed up in 1902 by building an elegant new head office in Montreal. Determined to beat the CPR at its own game, he then began to lay plans for the construction of five lavish new hotels. The final piece called for expansion into western Canada which he believed was the only route to continued growth.\n\nCharles Melville Hays\n\nGTR Manager, 1896-1909\n\nGTR President, 1909-1912\n\nNational Archives Ref. R231-2273-1-E\n\nFinancially, the GTR was in no position to embark on such a venture. Although the railway always managed to cover its operating costs, it had not been profitable until Hays took over. After an attempted buyout of the Canadian Northern Railway (CNoR) failed, the GTR turned to the federal government and found a sympathetic ear.\n\nThe GTR, which for years had focused all its attention on Ontario and the northern US, was now being squeezed on all sides with no room to expand. Meanwhile the government wanted to expand rail service through northern Ontario and Quebec in order to drive more shipping to Quebec City and the Maritimes, home to their primary political base.\n\nIn 1903 the two parties struck a deal where the government would build the National Transcontinental Railway (NTR) and the GTR would build the Grand Trunk Pacific (GTP). The NTR would operate from the Maritimes to Winnipeg. In Winnipeg it would connect with the GTP which would run to Prince Rupert, BC. Upon completion, the NTR was to be leased back to the GTR which would operate the two railways as one. Leasing costs were to be based on a percentage of the construction costs.\n\nThe deal went sour almost from the very start. Construction began in 1905. Hays had insisted on building the railway to the highest possible standards. By 1908 the chief engineer was reporting serious cost overruns. By 1912 the GTP was running out of money.\n\nHays had blundered badly. In March 1912, accompanied by his wife, daughter, and son-in-law, he made a trip to London to meet with the board of directors. It was to be his last. Eager to return in time for the opening of the Chateau Laurier, Hays booked passage home on the ill-fated Titanic. Tragically, both Hays and his son-in-law lost their lives in the disaster.\n\nTravel brochure for Algonquin Park, 1917\n\nSource: www.archive.org\n\nHays, who left no succession planning, was followed in the presidency by another American, Edson Joseph Chamberlin, who had settled in Canada in 1886. Chamberlin lacked Hays' finesse when it came to dealing with politicians. He also had the infuriating ability to inflame an already tense situation by levelling provocative accusations of mismanagement towards the government.\n\nThe GTP was completed in 1914 and the NTR in 1915. By then the GTR was in serious financial trouble.\n\nThe GTR had never been high on the popularity list of Prime Minister Robert Borden. He mistrusted the railway and while in opposition, had argued extensively against the deal. His earlier concerns were validated when in 1915 the railway, citing costs as a factor, reneged on the agreement to run the NTR. The GTR was cooked. It was just a matter of time.\n\nA Royal Commission in 1916 slammed the absentee management in England, holding them largely responsible for the railway's precarious financial position. According to reports, Chamberlin's performance in front of the committee did nothing to enhance the GTR's badly tarnished reputation.\n\nThe inquiry revealed, among other things, that the GTR had paid out an average of $3.6 million in dividends per year to its British shareholders ($30.6 million over 10 years) rather than making much-needed improvements to its infrastructure. At the same time the railway was paying off its greedy shareholders, it was borrowing heavily from the Canadian government just to survive.\n\nThe majority opinion (two out of three) held that due to the vast amount of assistance received from the Canadian government, the people of Canada were the rightful owners and the railway should be turned over to them.\n\nIn 1919 the GTR claimed it could no longer make interest payments on the GTP. The government swooped in and placed the GTP into receivership. It was quickly nationalized.\n\nThe following year the GTR was placed under government management. The GTR was still a going concern however it couldn't possibly generate enough revenue to maintain operations and cover its massive debts to the federal government, which by then totalled over $216 million (over $4 billion today).\n\nThe British shareholders were furious and demanded compensation. Both parties agreed that the value of the GTR's stock should be determined by an arbitration panel.\n\nDuring the arbitration and valuation process, a few embarrassing facts came to light. In particular there were some notable discrepancies between the financial reports released to the shareholders and those provided to the Railway Department. It turned out that from 1912-1920 the GTR had been utilizing an \"audit office account\" to cook their books. The manipulations depended on whether they were planning to pay dividends or going after government aid.\n\nShares in the GTR skyrocketed on the London Exchange in anticipation of a favourable resolution. It didn't happen. The railway's stock was found to be worthless. Sir Thomas White, one of the arbitrators, summed it up by writing; \"It would be difficult to imagine a more misconceived project than that to which the Grand Trunk committed its credit in this unfortunate enterprise.\"\n\nThe enraged shareholders then hauled the government into court where the two parties battled it out for several years. It was to no avail. In January 1923 the GTR was absorbed into the newly formed Canadian National Railway (CN) and the shareholders walked away empty handed. It has been said that the shareholders never forgave the Canadian government for \"stealing our railway.\"\n\nThe GTR's demise was painful, protracted and likely inevitable. Absentee management, negligent planning, limited corporate vision, supreme arrogance, and a rigid financial structure all played a part.\n\nToday much of the GTR's original mainline in Ontario and Quebec remains in use by CN and also by VIA Rail. The name Grand Trunk Corporation is still under CN ownership and continues to be used as a holding company for CN's operations in the US."}, {"url": "https://alchetron.com/Charles-Melville-Hays", "page_content": "Charles Melville Hays (May 16, 1856 – April 15, 1912) was the president of the Grand Trunk Railway. He began working in the railroad business as a clerk at the age of 17 and quickly rose through the ranks of management to become the General Manager of the Wabash, St. Louis and Pacific Railway. He became Vice-President of that company in 1889 and remained as such until 1896 when he became General Manager of the Grand Trunk Railway (GTR) of Canada.\n\nHays left GTR for a short time to serve as the President of the Southern Pacific Railway Company but returned to GTR after one year. As Vice-President and General Manager of GTR he is credited with keeping the company from bankruptcy. In 1909, he became the president of GTR and all its consolidated lines, subsidiary railroads, and steamship companies. He was known for his philanthropy and received the Order of the Rising Sun, third class, from the Emperor of Japan in 1907.\n\nHays is credited with the formation of the Grand Trunk Pacific Railway (GTP), a dream he had to create a second transcontinental railroad within the borders of Canada. He is also blamed for the insolvency of both the GTR and the GTP. He died before his dream was complete as he perished at sea in the sinking of the RMS Titanic. Before the ship collided with an iceberg, Hays made a statement that was prophetic of the disaster. His body was recovered, and he was buried in Montreal. He was survived by his wife and four daughters.\n\nEarly years\n\nCharles Melville Hays was born in Rock Island, Illinois on May 16, 1856. His family moved to St. Louis, Missouri when he was a child.\n\nCareer\n\nIn 1873, at the age of 17, he began his career in the railroad business working for the Atlantic and Pacific Railroad in St. Louis. From 1877 to 1884, Hays was Secretary to the General Manager of the Missouri Pacific Railroad. Beginning in 1884, he held the same position with the Wabash, St. Louis and Pacific Railway until 1886, when he became that company's General Manager. In 1889, he became Vice-President of the Wasbash Railroad and remained as such until 1896, when he became General Manager of the Grand Trunk Railway (GTR) of Canada.\n\nIn 1901, Hays left GTR to serve as the President of the Southern Pacific Railway Company but returned to the company in January 1902 as Vice-President and General Manager. In October 1909, he was appointed president of GTR, which also gave him control of its subsidiary railroad and steamship companies. These included the Central Vermont Railway, the Grand Trunk Western Railway, the Grand Haven and Milwaukee Railway, the Detroit and Toledo Shoreline Railroad, the Toledo, Saginaw and Muskegon Railway, the Southern New England Railway Company, the Canadian Express Company, and several others. In addition, he was sought after to help manage several philanthropies. He was Governor of the Royal Victoria Hospital, Montreal, Montreal General Hospital and McGill University. He received the Order of the Rising Sun, third class, from the Emperor of Japan in 1907 for assistance he gave the Imperial Government Railways.\n\nWhen Hays became General Manager of GTR in 1896, it was near bankruptcy and under-performing its rival, the Canadian Pacific Railway(CPR). On the advice of American financier J. Pierpont Morgan, the GTR board selected Hays as General Manager to bring more aggressive, \"American\" business practices to the company. He reorganized the management of the company and successfully negotiated running rights with CPR. He also brought more efficiency to the handling of accounts, built new track and ordered more powerful locomotives. These changes produced an era of greater success for the railroad.\n\nTranscontinental Railway\n\nAt this time in Canadian history the western prairies were being rapidly settled. Hays wanted to capitalize on the trend by constructing a transcontinental railroad, within the borders of Canada, to run 3,600 miles from Moncton, New Brunswick, to Prince Rupert, British Columbia. In 1900, he introduced a proposal to extend the lines of the Grand Trunk Western, an American subsidiary, from Chicago to Winnipeg, \"and thence to the Pacific.\" However, he was turned down by the railroad's directors in London. Later that year, Hays left GTR to work for Southern Pacific, but a change in ownership there lead to his resignation. He returned to the GTR to find that the president, Sir Charles Rivers Wilson, had convinced the Board of Directors to pursue the transcontinental railway. Meanwhile, the government, under Sir Wilfrid Laurier, had also decided to back the project. Plans to construct the transcontinental line were announced on November 24, 1902.\n\nHays' plan involved the creation of a subsidiary line from Winnipeg to Prince Rupert, with the government building the line from New Brunswick to Winnipeg. The cabinet became weary of Hays' demands for subsidies, but after negotiations between the government and Hays, aided by the railroad's president Rivers Wilson, the National Transcontinental Railway Act was passed in 1903. It enabled the incorporation of the Grand Trunk Pacific Railway (GTP). The government's portion of the line would be called the National Transcontinental Railway (NTR).\n\nThere were problems with some of Hays' policies regarding the GTP.\n\nFirstly, he had planned to buy out the Canadian Northern Railway (CNoR), but the company resisted and instead provided competition.\n\nSecondly, Hays lacked support from the Board of Directors in London; he wanted to link the GTR with the GTP, but the board would not back this plan. He thus proceeded on his own authority, making commitments that would ultimately ruin both the GTP and the GTR.\n\nThirdly, Hays faced opposition to his choice of Prince Rupert, on Kaien Island, B.C., for the western terminal, because there was not much traffic there. Hays preferred the location as he believed it would provide a shorter route for transshipment to destinations in Asia.\n\nHays made the construction of the mainline his priority, failing to develop feeder lines. CNoR and CPR joined forces to gain control of the prairie traffic. The competition among the three railroads led to Canada's ending up with three transcontinental railways instead of one. This was to result in the GTP's being starved of traffic; even though it was arguably the best of the three, it ultimately failed to attract enough freight to make it profitable.\n\nAfter construction on the GTP began in 1905, Hays started the Grand Trunk Pacific Development Company in order to purchase thousands of acres of land on which he established town sites along the route of the railway, including Melville, Saskatchewan, which was named after him. Hays' vision went beyond the building of the railway. He also had plans for a fleet of ocean liners and a string of resort hotels across the Rocky Mountains. He hired the famed architect Francis Rattenbury from CPR to design a grand hotel, the Château Prince Rupert, at the westernmost stop on the railway. In 1909, only 3000 people lived in Prince Rupert, but anticipation of the railroad caused it to grow rapidly, despite the rapidly rising cost of property and the muddy environs. The city was incorporated in 1910.\n\nAfter Rivers Wilson retired as the railroad's president in 1909, Hays was appointed to fill the position. By 1910, Grand Trunk union workers were demanding wages on par with those of railroad workers in the United States. A strike put a stop to construction. Hays finally gave into the workers' demands but failed to re-hire 250 previously fired strikers, despite promising to do so. He also denied workers their pensions, causing one member of Parliament to describe him as \"heartless, cruel, and tyrannical\".\n\nBy 1912, the cost of constructing the railway was increasing, with rising wages and price increases on materials, while the government refused to allow a rate increase. Another reason for the mounting costs was Hays' insistence on \"building to the very highest standards\". Meanwhile, CNoR and CPR monopolized the traffic in the west. In addition, Grand Trunk, which would be leasing the NTR from the government, was responsible for paying back the construction cost of that line. Hays began to fear insolvency.\n\nTitanic\n\nIn April 1912, Hays was in London soliciting financial support for the GTP. He was anxious to get back to Canada for the opening of the Château Laurier in Ottawa, Ontario, named after Prime Minister Laurier. The gala opening of this hotel was set for April 25, 1912. Hays had also received news that his daughter Louise was having difficulty with her pregnancy.\n\nAdditionally, he might have had business with J. Bruce Ismay, chairman of the White Star Line; in any case, Ismay had invited Hays to join him on the RMS Titanic. Hays, his wife, Clara, his daughter, Orian (see source note), his son-in-law, Thornton Davidson, his secretary, Mr. Vivian Payne, and a maid, Miss Mary Anne Perreault, shared a deluxe suite (cabin B69) on the Promenade Deck.\n\nAt 11:40 pm on April 14, 1912, Titanic struck an iceberg. Hays helped the women in his party into one of the ship's 20 lifeboats, but he, his son-in-law, and his secretary remained and perished when the ship sank, along with 1,500 other Titanic passengers and crew. Hays was reported to have made a prophetic remark on the evening of the disaster; deploring the way the steamship lines were competing to win passengers with ever-faster vessels, he is said to have commented, \"The time will come soon when this trend will be checked by some appalling disaster.\"\n\nDeath\n\nHays' body was recovered from the waters of the North Atlantic by the Minia, and he was buried at Mount Royal Cemetery in Montreal. Two funerals were held for him on May 8 – one at the American Presbyterian Church in Montreal, the other in London at the Church of St Edmund, King and Martyr\n\nAfter his death\n\nHays died before he could see the GTP through to completion. He was eulogized as one of the greatest railwaymen in Canada, and work on the GTR was stopped for five minutes, on April 25, 1912, in his memory. During the period in which Hays led the GTR it saw its most prosperous era.\n\nHowever, his policies led to the GTP's collapse in 1919. The company was placed in receivership, and the government seized GTR's stock. It was later alleged that Hays had deceived the company's London directors in 1903 by committing them to conditions in the railway's agreements with the Canadian government for the building of the GTP that they did not agree to. That scheme was blamed for the company's collapse.\n\nThe railroad car in which his body was transported back to Montreal is preserved at the Canadian Railway Museum near Delson, Quebec. There is a statue of him in Prince Rupert, and the city of Melville, Saskatchewan, is named after him, as is the village of Haysport, British Columbia.\n\nPersonal life\n\nHe was survived by his wife, Clara Jennings (née Gregg), whom he married in St. Louis, Missouri on October 13, 1881. They had four daughters: Orian (Mrs. Thornton Davidson, Mrs. Robert N. Hickson), Clara (Mrs. Hope Scott), Marjorie (Mrs. George Hall), and Louise (Mrs. Grier).\n\nSource note\n\nOne source used here (Hacking) names the daughter with Hays on the Titanic as \"Margaret\", however, it was daughter Orian who was traveling with her husband, Thorton Davidson. That source does not mention Orian as a passenger on the ship. There was a 24-year-old woman, named Margaret Bechstein Hays on the Titanic, but she was staying in a different compartment than the C.M. Hays party, with another group of people. She escaped via lifeboat No. 7 (with her Pomeranian, Lady), while the other Hays women boarded lifeboat No. 3. Early newspaper reports said that Clara and Margaret Hays, and Mrs. Thornton [Orian] Davidson disembarked the rescue ship in New York City together and boarded a train for Montreal, while other sources say that Margaret Hays lived in New York and took care of two young child survivors (Edmond and Michael Navratil), who were unclaimed immediately following the disaster. Margaret (Hays) Easton's 1913 wedding announcement says her father, Frank Hays, walked her down the aisle. Finally, Orian's death notice lists Marjorie (Mrs. George Hall)—not Margaret Easton—as a predeceased sister."}, {"url": "https://www.melville.ca/p/charles-melville-hays", "page_content": "From May 16, 1856 to April 15, 1912\n\nCharles Melville Hays began working for the Atlantic and Pacific Railroad in St. Louis, Missouri. He became a secretary to the general manager of the Missouri Pacific Railroad in 1878. After his time as a secretary, he then was the General Manager for the Grand Trunk Railroad from 1899 – 1912. He married Clara Jennings Gregg in 1881 and together had four daughters. They then moved to Melville in 1909 and started the construction of the railway between Regina and Melville. He was a major part in the building of the City Hall Opera House because he believed it would be a great way to represent the growing community.\n\nAt the age of 55, Charles was one of the 1503 people who died on the RMS Titanic in 1912. His wife and daughters were able to make it off of the ship alive and came back to Melville to continue his legacy."}, {"url": "https://peoplepill.com/people/charles-melville-hays/", "page_content": "Charles Melville Hays (May 16, 1856 – April 15, 1912) was the president of the Grand Trunk Railway. He began working in the railroad business as a clerk at the age of 17 and quickly rose through the ranks of management to become the General Manager of the Wabash, St. Louis and Pacific Railway. He became Vice-President of that company in 1889 and remained as such until 1896 when he became General Manager of the Grand Trunk Railway (GTR) of Canada.\n\nHays left GTR for a short time to serve as the President of the Southern Pacific Railway Company but returned to GTR after one year. As Vice-President and General Manager of GTR he is credited with keeping the company from bankruptcy. In 1909, he became the president of GTR and all its consolidated lines, subsidiary railroads, and steamship companies. He was known for his philanthropy and received the Order of the Rising Sun, third class, from the Emperor of Japan in 1907.\n\nHays is credited with the formation of the Grand Trunk Pacific Railway (GTP), a dream he had to create a second transcontinental railroad within the borders of Canada. He is also blamed for the insolvency of both the GTR and the GTP. He died before his dream was complete as he perished at sea in the sinking of the RMS Titanic. Before the ship collided with an iceberg, Hays made a statement that was prophetic of the disaster. His body was recovered, and he was buried in Montreal. He was survived by his wife and four daughters.\n\nBiography\n\nEarly years\n\nCharles Melville Hays was born in Rock Island, Illinois on May 16, 1856. His family moved to St. Louis, Missouri when he was a child.\n\nCareer\n\nIn 1873, at the age of 17, he began his career in the railroad business working for the Atlantic and Pacific Railroad in St. Louis. From 1877 to 1884, Hays was Secretary to the General Manager of the Missouri Pacific Railroad. Beginning in 1884, he held the same position with the Wabash, St. Louis and Pacific Railway until 1886, when he became that company's General Manager. In 1889, he became Vice-President of the Wasbash Railroad and remained as such until 1896, when he became General Manager of the Grand Trunk Railway (GTR) of Canada.\n\nIn 1901, Hays left GTR to serve as the President of the Southern Pacific Railway Company but returned to the company in January 1902 as Vice-President and General Manager. In October 1909, he was appointed president of GTR, which also gave him control of its subsidiary railroad and steamship companies. These included the Central Vermont Railway, the Grand Trunk Western Railway, the Grand Haven and Milwaukee Railway, the Detroit and Toledo Shoreline Railroad, the Toledo, Saginaw and Muskegon Railway, the Southern New England Railway Company, the Canadian Express Company, and several others. In addition, he was sought after to help manage several philanthropies. He was Governor of the Royal Victoria Hospital, Montreal, Montreal General Hospital and McGill University. He received the Order of the Rising Sun, third class, from the Emperor of Japan in 1907 for assistance he gave the Imperial Government Railways.\n\nWhen Hays became General Manager of GTR in 1896, it was near bankruptcy and under-performing its rival, the Canadian Pacific Railway(CPR). On the advice of American financier J. Pierpont Morgan, the GTR board selected Hays as General Manager to bring more aggressive, \"American\" business practices to the company. He reorganized the management of the company and successfully negotiated running rights with CPR. He also brought more efficiency to the handling of accounts, built new track and ordered more powerful locomotives. These changes produced an era of greater success for the railroad.\n\nTranscontinental Railway\n\nCharles Melville Hays. Charles Melville Hays.\n\nAt this time in Canadian history the western prairies were being rapidly settled. Hays wanted to capitalize on the trend by constructing a transcontinental railroad, within the borders of Canada, to run 3,600 miles from Moncton, New Brunswick, to Prince Rupert, British Columbia. In 1900, he introduced a proposal to extend the lines of the Grand Trunk Western, an American subsidiary, from Chicago to Winnipeg, \"and thence to the Pacific.\" However, he was turned down by the railroad's directors in London. Later that year, Hays left GTR to work for Southern Pacific, but a change in ownership there lead to his resignation. He returned to the GTR to find that the president, Sir Charles Rivers Wilson, had convinced the Board of Directors to pursue the transcontinental railway. Meanwhile, the government, under Sir Wilfrid Laurier, had also decided to back the project. Plans to construct the transcontinental line were announced on November 24, 1902.\n\nHays' plan involved the creation of a subsidiary line from Winnipeg to Prince Rupert, with the government building the line from New Brunswick to Winnipeg. The cabinet became weary of Hays' demands for subsidies, but after negotiations between the government and Hays, aided by the railroad's president Rivers Wilson, the National Transcontinental Railway Act was passed in 1903. It enabled the incorporation of the Grand Trunk Pacific Railway (GTP). The government's portion of the line would be called the National Transcontinental Railway (NTR).\n\nThere were problems with some of Hays' policies regarding the GTP.\n\nFirstly, he had planned to buy out the Canadian Northern Railway (CNoR), but the company resisted and instead provided competition.\n\nSecondly, Hays lacked support from the Board of Directors in London; he wanted to link the GTR with the GTP, but the board would not back this plan. He thus proceeded on his own authority, making commitments that would ultimately ruin both the GTP and the GTR.\n\nThirdly, Hays faced opposition to his choice of Prince Rupert, on Kaien Island, B.C., for the western terminal, because there was not much traffic there. Hays preferred the location as he believed it would provide a shorter route for transshipment to destinations in Asia.\n\nHays made the construction of the mainline his priority, failing to develop feeder lines. CNoR and CPR joined forces to gain control of the prairie traffic. The competition among the three railroads led to Canada's ending up with three transcontinental railways instead of one. This was to result in the GTP's being starved of traffic; even though it was arguably the best of the three, it ultimately failed to attract enough freight to make it profitable.\n\nAfter construction on the GTP began in 1905, Hays started the Grand Trunk Pacific Development Company in order to purchase thousands of acres of land on which he established town sites along the route of the railway, including Melville, Saskatchewan, which was named after him. Hays' vision went beyond the building of the railway. He also had plans for a fleet of ocean liners and a string of resort hotels across the Rocky Mountains. He hired the famed architect Francis Rattenbury from CPR to design a grand hotel, the Château Prince Rupert, at the westernmost stop on the railway. In 1909, only 3000 people lived in Prince Rupert, but anticipation of the railroad caused it to grow rapidly, despite the rapidly rising cost of property and the muddy environs. The city was incorporated in 1910.\n\nAfter Rivers Wilson retired as the railroad's president in 1909, Hays was appointed to fill the position. By 1910, Grand Trunk union workers were demanding wages on par with those of railroad workers in the United States. A strike put a stop to construction. Hays finally gave into the workers' demands but failed to re-hire 250 previously fired strikers, despite promising to do so. He also denied workers their pensions, causing one member of Parliament to describe him as \"heartless, cruel, and tyrannical\".\n\nBy 1912, the cost of constructing the railway was increasing, with rising wages and price increases on materials, while the government refused to allow a rate increase. Another reason for the mounting costs was Hays' insistence on \"building to the very highest standards\". Meanwhile, CNoR and CPR monopolized the traffic in the west. In addition, Grand Trunk, which would be leasing the NTR from the government, was responsible for paying back the construction cost of that line. Hays began to fear insolvency.\n\nTitanic\n\nIn April 1912, Hays was in London soliciting financial support for the GTP. He was anxious to get back to Canada for the opening of the Château Laurier in Ottawa, Ontario, named after Prime Minister Laurier. The gala opening of this hotel was set for April 25, 1912. Hays had also received news that his daughter Louise was having difficulty with her pregnancy.\n\nAdditionally, he might have had business with J. Bruce Ismay, chairman of the White Star Line; in any case, Ismay had invited Hays to join him on the RMS Titanic. Hays, his wife, Clara, his daughter, Orian (see source note), his son-in-law, Thornton Davidson, his secretary, Mr. Vivian Payne, and a maid, Miss Mary Anne Perreault, shared a deluxe suite (cabin B69) on the Promenade Deck.\n\nAt 11:40 pm on April 14, 1912, Titanic struck an iceberg. Hays helped the women in his party into one of the ship's 20 lifeboats, but he, his son-in-law, and his secretary remained and perished when the ship sank, along with 1,500 other Titanic passengers and crew. Hays was reported to have made a prophetic remark on the evening of the disaster; deploring the way the steamship lines were competing to win passengers with ever-faster vessels, he is said to have commented, \"The time will come soon when this trend will be checked by some appalling disaster.\"\n\nDeath\n\nHays' body was recovered from the waters of the North Atlantic by the Minia, and he was buried at Mount Royal Cemetery in Montreal. Two funerals were held for him on May 8 – one at the American Presbyterian Church in Montreal, the other in London at the Church of St Edmund, King and Martyr\n\nC.M. Hays' tombstone in Montreal C.M. Hays' tombstone in Montreal\n\nAfter his death\n\nHays died before he could see the GTP through to completion. He was eulogized as one of the greatest railwaymen in Canada, and work on the GTR was stopped for five minutes, on April 25, 1912, in his memory. During the period in which Hays led the GTR it saw its most prosperous era.\n\nHowever, his policies led to the GTP's collapse in 1919. The company was placed in receivership, and the government seized GTR's stock. It was later alleged that Hays had deceived the company's London directors in 1903 by committing them to conditions in the railway's agreements with the Canadian government for the building of the GTP that they did not agree to. That scheme was blamed for the company's collapse.\n\nThe railroad car in which his body was transported back to Montreal is preserved at the Canadian Railway Museum near Delson, Quebec. There is a statue of him in Prince Rupert, and the city of Melville, Saskatchewan, is named after him, as is the village of Haysport, British Columbia.\n\nPersonal life\n\nHe was survived by his wife, Clara Jennings (née Gregg), whom he married in St. Louis, Missouri on October 13, 1881. They had four daughters: Orian (Mrs. Thornton Davidson, Mrs. Robert N. Hickson), Clara (Mrs. Hope Scott), Marjorie (Mrs. George Hall), and Louise (Mrs. Grier).\n\nSource note\n\nOne source used here (Hacking) names the daughter with Hays on the Titanic as \"Margaret\", however, it was daughter Orian who was traveling with her husband, Thorton Davidson. That source does not mention Orian as a passenger on the ship. There was a 24-year-old woman, named Margaret Bechstein Hays on the Titanic, but she was staying in a different compartment than the C.M. Hays party, with another group of people. She escaped via lifeboat No. 7 (with her Pomeranian, Lady), while the other Hays women boarded lifeboat No. 3. Early newspaper reports said that Clara and Margaret Hays, and Mrs. Thornton [Orian] Davidson disembarked the rescue ship in New York City together and boarded a train for Montreal, while other sources say that Margaret Hays lived in New York and took care of two young child survivors (Edmond and Michael Navratil), who were unclaimed immediately following the disaster. Margaret (Hays) Easton's 1913 wedding announcement says her father, Frank Hays, walked her down the aisle. Finally, Orian's death notice lists Marjorie (Mrs. George Hall)—not Margaret Easton—as a predeceased sister."}, {"url": "https://wiki.alquds.edu/?query=Charles_Melville_Hays", "page_content": "American businessman (1858–1912)\n\nNot to be confused with Charles Marshall Hays\n\nCharles Melville Hays (May 16, 1856 – April 15, 1912) was the president of the Grand Trunk Railway. He began working in the railroad business as a clerk at the age of 17 and quickly rose through the ranks of management to become the General Manager of the Wabash, St. Louis and Pacific Railway. He became Vice-President of that company in 1889 and remained as such until 1896 when he became General Manager of the Grand Trunk Railway (GTR) of Canada.\n\nHays left GTR for a short time to serve as the President of the Southern Pacific Railway Company but returned to GTR after one year. As Vice-President and General Manager of GTR he is credited with keeping the company from bankruptcy. In 1909, he became the president of GTR and all its consolidated lines, subsidiary railroads, and steamship companies. He was known for his philanthropy and received the Order of the Rising Sun, third class, from the Emperor of Japan in 1907.\n\nHays is credited with the formation of the Grand Trunk Pacific Railway (GTP), a plan he had to create a second transcontinental railroad within the borders of Canada.[1] He is also blamed for the insolvency of both the GTR and the GTP. He died in the sinking of the RMS Titanic before his plan was complete.[1] Before the ship collided with an iceberg, Hays said that in the near future there would be \"the greatest...of all disasters at sea.\"[2] His body was recovered, and he was buried in Montreal. He was survived by his wife and four daughters.\n\nEarly life [ edit ]\n\nCharles Melville Hays was born in Rock Island, Illinois, on May 16, 1856.[3] His family moved to St. Louis, Missouri, when he was a child.\n\nCareer [ edit ]\n\nIn 1873, at the age of 17, he began his career in the railroad business working for the Atlantic and Pacific Railroad in St. Louis.[4] From 1877 to 1884, Hays was Secretary to the General Manager of the Missouri Pacific Railroad. Beginning in 1884, he held the same position with the Wabash, St. Louis and Pacific Railway until 1886, when he became that company's General Manager. In 1889, he became Vice-President of the Wasbash Railroad and remained as such until 1896, when he became General Manager of the Grand Trunk Railway (GTR) of Canada.[3]\n\nIn 1901, Hays left GTR to serve as the President of the Southern Pacific Railway Company but returned to the company in January 1902 as Vice-President and General Manager. In October 1909, he was appointed president of GTR, which also gave him control of its subsidiary railroad and steamship companies.[5] These included the Central Vermont Railway, the Grand Trunk Western Railway, the Grand Haven and Milwaukee Railway, the Detroit and Toledo Shoreline Railroad, the Toledo, Saginaw and Muskegon Railway, the Southern New England Railway Company, the Canadian Express Company, and several others.[4][6] In addition, he was sought after to help manage several philanthropies. He was Governor of the Royal Victoria Hospital, Montreal, Montreal General Hospital and McGill University. He received the Order of the Rising Sun, third class, from the Emperor of Japan in 1907 for assistance he gave the Imperial Government Railways.[4]\n\nWhen Hays became General Manager of GTR in 1896, it was near bankruptcy and under-performing its rival, the Canadian Pacific Railway (CPR). On the advice of American financier J. Pierpont Morgan,[1] the GTR board selected Hays as General Manager to bring more aggressive, \"American\" business practices to the company. He reorganized the management of the company and successfully negotiated running rights with CPR. He also brought more efficiency to the handling of accounts, built new track and ordered more powerful locomotives. These changes produced an era of greater success for the railroad.[1][7]\n\nTranscontinental Railway [ edit ]\n\nCharles Melville Hays.\n\nAt the time, the western prairies were being rapidly settled. Hays wanted to capitalize on the trend by constructing a transcontinental railroad, within the borders of Canada, to run 3,600 miles from Moncton, New Brunswick, to Prince Rupert, British Columbia.[5] In 1900, he introduced a proposal to extend the lines of the Grand Trunk Western, an American subsidiary, from Chicago to Winnipeg, \"and thence to the Pacific.\" However, he was turned down by the railroad's directors in London. Later that year, Hays left GTR to work for Southern Pacific, but a change in ownership there lead to his resignation. He returned to the GTR to find that the president, Sir Charles Rivers Wilson, had convinced the board of directors to pursue the transcontinental railway. Meanwhile, the government, under Sir Wilfrid Laurier, had also decided to back the project. Plans to construct the transcontinental line were announced on November 24, 1902.[7]\n\nHays' plan involved the creation of a subsidiary line from Winnipeg to Prince Rupert, with the government building the line from New Brunswick to Winnipeg. The cabinet became weary of Hays' demands for subsidies, but after negotiations between the government and Hays, aided by the railroad's president Rivers Wilson, the National Transcontinental Railway Act was passed in 1903. It enabled the incorporation of the Grand Trunk Pacific Railway (GTP). The government's portion of the line would be called the National Transcontinental Railway (NTR).[7]\n\nThere were problems with some of Hays' policies regarding the GTP.\n\nFirstly, he had planned to buy out the Canadian Northern Railway (CNoR), but the company resisted and instead provided competition.\n\nSecondly, Hays lacked support from the board of directors in London; he wanted to link the GTR with the GTP, but the board would not back this plan. He thus proceeded on his own authority, making commitments that would ultimately ruin both the GTP and the GTR.\n\nThirdly, Hays faced opposition to his choice of Prince Rupert, on Kaien Island, B.C., for the western terminal, because there was not much traffic there. Hays preferred the location as he believed it would provide a shorter route for transshipment to destinations in Asia.[7]\n\nHays made the construction of the mainline his priority, failing to develop feeder lines. CNoR and CPR joined forces to gain control of the prairie traffic.[7] The competition among the three railroads led to Canada's ending up with three transcontinental railways instead of one.[1] This was to result in the GTP's being starved of traffic; even though it was arguably the best of the three, it ultimately failed to attract enough freight to make it profitable.[7]\n\nAfter construction on the GTP began in 1905, Hays started the Grand Trunk Pacific Development Company in order to purchase thousands of acres of land on which he established town sites along the route of the railway, including Melville, Saskatchewan, which was named after him. Hays' vision went beyond the building of the railway. He also had plans for a fleet of ocean liners and a string of resort hotels across the Rocky Mountains.[1][8] He hired the famed architect Francis Rattenbury from CPR to design a grand hotel, the Château Prince Rupert, at the westernmost stop on the railway. In 1909, only 3000 people lived in Prince Rupert, but anticipation of the railroad caused it to grow rapidly, despite the rapidly rising cost of property and the muddy environs. The city was incorporated in 1910.[8]\n\nAfter Rivers Wilson retired as the railroad's president in 1909, Hays was appointed to fill the position. By 1910, Grand Trunk union workers were demanding wages on par with those of railroad workers in the United States. A strike put a stop to construction. Hays finally gave into the workers' demands but failed to re-hire 250 previously fired strikers despite promising to do so. He also denied workers their pensions, causing one member of Parliament to describe him as \"heartless, cruel, and tyrannical.\"[1]\n\nBy 1912, the cost of constructing the railway was increasing, with rising wages and price increases on materials, while the government refused to allow a rate increase. Another reason for the mounting costs was Hays' insistence on \"building to the very highest standards\". Meanwhile, CNoR and CPR monopolized the traffic in the west. In addition, Grand Trunk, which would be leasing the NTR from the government, was responsible for paying back the construction cost of that line. Hays began to fear insolvency.[1]\n\nRMS Titanic [ edit ]\n\nIn April 1912, Hays was in London soliciting financial support for the GTP. He was anxious to get back to Canada for the opening of the Château Laurier in Ottawa, Ontario, named after Prime Minister Laurier. The gala opening of this hotel was set for April 25, 1912.[1] Hays had also received news that his daughter Louise was having difficulty with her pregnancy.\n\nAdditionally, he might have had business with J. Bruce Ismay, chairman of the White Star Line; in any case, Ismay had invited Hays to join him on the RMS Titanic. Hays, his wife, Clara, his daughter, Orian (see source note), his son-in-law, Thornton Davidson (son of Charles Peers Davidson), his secretary, Mr. Vivian Payne, and a maid, Miss Mary Anne Perreault, shared a deluxe suite (cabin B69) on B Deck, also known as the Bridge Deck.[8][9]\n\nAt 11:40 pm on April 14, 1912, Titanic struck an iceberg. Hays helped the women in his party into one of the ship's 20 lifeboats,[10] but he, his son-in-law, and his secretary remained and perished when the ship sank,[8] along with nearly 1,500 other Titanic passengers and crew.[2] Hays was reported to have made a prophetic remark on the evening of the disaster; deploring the way the steamship lines were competing to win passengers with ever-faster vessels, he is said to have commented, \"The time will come soon when this trend will be checked by some appalling disaster.\"[1]\n\nSome early sources, aware that one of the Hays daughters (Orian Davidson) was accompanying her parents, misidentified the daughter as \"Margaret Hays\", who was actually a totally unrelated young woman, traveling with two female friends. Early newspaper reports incorrectly stated that Clara and Margaret Hays, and Mrs. Thornton [Orian] Davidson disembarked the rescue ship in New York City together and boarded a train for Montreal,[11][12]\n\nDeath [ edit ]\n\nHays was a victim of the Titanic. Hays' body was recovered from the waters of the North Atlantic by the Minia, and he was buried at Mount Royal Cemetery in Montreal. Two funerals were held for him on May 8, one at the American Presbyterian Church in Montreal, the other in London at the Church of St Edmund, King and Martyr.\n\nC.M. Hays' tombstone in Montreal\n\nLegacy [ edit ]\n\nHays died before he could see the GTP completed. He was eulogized as one of the greatest railwaymen in Canada, and work on the GTR was stopped for five minutes, on April 25, 1912, in his memory. The period in which Hays led the GTR was its most prosperous era.\n\nHowever, his policies led to the GTP's collapse in 1919. The company was placed in receivership, and the government seized GTR's stock. It was later alleged that Hays had deceived the company's London directors in 1903 by committing them to conditions in the railway's agreements with the Canadian government for the building of the GTP to which they did not agree. That scheme was blamed for the company's collapse.[7]\n\nThe railroad car in which his body was transported back to Montreal is preserved at the Canadian Railway Museum, near Delson, Quebec. There is a statue of him in Prince Rupert, and the city of Melville, Saskatchewan, is named after him,[13] as is the village of Haysport, British Columbia.[citation needed] Mount Hays, south of Prince Rupert, British Columbia is named for him.[14]: 108\n\nCharles Hays Secondary School in Prince Rupert is also named in his honour.\n\nPersonal life [ edit ]\n\nHis wife was Clara Jennings (née Gregg), whom he married in St. Louis, Missouri on October 13, 1881. They had four daughters:[15] Orian (who married Thornton Davidson, and later Robert N. Hickson), Clara (who married Hope Scott), Marjorie (who married George Hall), and Louise (who married a Mr. Grier).[16]"}]}