{"The GTR's transcontinental line was constructed from Montreal to Vancouver.": [{"url": "https://www.thecanadianencyclopedia.ca/en/article/grand-trunk-railway-of-canada", "page_content": "Grand Trunk Railway, in an albumen print circa 1860 (courtesy NGC). Ottawa, 1913 (photo by W.J. Topely, courtesy Library and Archives Canada/PA-10579). Construction gang in the 1870s reducing an embankment (courtesy PAO). PreviousNext\n\nIn late 19th Century, the Grand Trunk Railway of Canada was the major railroad in the Province of Canada (Ontario and Quebec), connecting Toronto to Montreal. In the 20th Century, the British-owned railroad would stretch from the Atlantic to the Pacific. After a period of bankruptcy it would eventually become part of Canadian National Railways.\n\nFounding\n\nThe Grand Trunk Railway of Canada (GTR) is sometimes confused with its subsidiary, the Grand Trunk Pacific Railway, a 4,800 km system built in the early 20th Century from Winnipeg to Canada’s Pacific Coast. The GTR was incorporated decades earlier, in 1852, under the sponsorship of Sir Francis Hincks, to build a much needed railway from Toronto to Montréal. The English firm of Peto, Brassey, Jackson and Betts was awarded the construction contract in return for agreeing to promote the company.\n\nIn 1853, the GTR merged with five other railway companies in eastern North America, a method of operating which was to characterize the GTR's major expansion periods. Much of the financing for both construction and expansion had to be raised in Great Britain.\n\nWork proceeded vigorously from town to town. Navvies, or labourers, from England swelled the workforce – at one time 14,000 men and 2,000 horses were employed in Canada West alone. The line avoided many of the challenges that plagued the Canadian Pacific Railway in the mountains, and achieved at least one notable engineering feat with construction of the tubular Victoria Bridge across the St. Lawrence River at Montréal. The 2,009 meter- iron tube rested on two abutments and 24 piers designed to resist the crushing ice of the river; it was opened to traffic in December 1859.\n\nExpansion\n\nDespite financial difficulties, the GTR grew steadily, often leasing existing railways as a means of expansion. The takeover of the Great Western Railway in 1882 enabled the GTR to eliminate its main competitor and to add another 1,450 kilometers of track in Canada West and Michigan. Additional links to the United States rail system were established with the International Bridge across the Niagara River, and the impressive St. Clair Tunnel beneath the St. Clair River.\n\nAt Confederation the GTR was the world’s largest railway system, with 2,055 km of track. By the late 1880s it had grown to more than 700 locomotives, 578 cars, 60 post-office cars, 131 baggage cars, 18,000 freight cars and 49 snow plows. The GTR ran unbroken from the Great Lakes at Sarnia, to the Atlantic coast Portland, Maine.\n\nDebt, Disaster and Rebuilding\n\nThe cost of construction, absentee management (its head office was in London, England) and the failure to generate anticipated levels of traffic left the company debt ridden and unable to upgrade its equipment.\n\nIt also suffered bad publicity in the wake of several accidents. On 29 June 1864, a GTR train plunged off the Beloeil Bridge into the Rivière Richelieu, killing 99 people. The GTR later made headlines around the world on 15 September 1885 when Jumbo, the famous circus elephant charged one of its trains near St. Thomas, Ontario and was killed.\n\nBetween the mid-1890s and the First World War, the GTR invested in massive infrastructure improvements. These included double-tracking of the main line from Montréal to Sarnia, reducing curves and grades to improve operating efficiency, and reconstruction of bridges, buildings and yards. The scale of these investments was such that no major upgrades were needed until after the Second World War.\n\nWestward\n\nEnvious of the Canadian Pacific Railway’s thrust into the West, and eager to have its own transcontinental line, the GTR set up a subsidiary, the Grand Trunk Pacific, to finish a route to the Pacific. Completed in 1914, the railway was a financial disaster and was largely responsible for GTR’s bankruptcy in 1919.\n\nThe federal government, which had already given the GTR some $28 million in subsidies and loans, took over the railway on 10 Oct 1919. It was placed under the management of the Canadian National Railways on 30 Jan 1923. Today much of the original GTR line in Ontario and Quebec is still in use by Canadian National and Via Rail."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/railway-history", "page_content": "Early Railways\n\nIn the early 17th century, mining railways were introduced to England; powered by horses, these early railways carried ore and coal from pitheads to water. In Canada, a primitive railway of this type may have been used as early as the 1720s to haul quarried stone at the fortress of Louisbourg. In the 1820s, an incline railway of cable cars, powered by a winch driven by a steam engine, was used to hoist stone during the building of the Quebec Citadel. Another railway was used during the building of the Rideau Canal to carry stone from the quarry at Hog’s Back in Ottawa.\n\nThe Railway Age\n\nSteam locomotion, together with the low rolling friction of iron-flanged wheels on iron rails, enabled George Stephenson (the first of the great railway engineers) to design and superintend the building of the Liverpool and Manchester Railway (1830). This began the railway age in England. By 1841, there were some 2,100 km of rail in the British Isles, and by 1844 the frenetic promotion of railways aptly called “The Mania” was underway. Many of the lasting characteristics of the railway were established in this early stage: steam locomotion, the standard gauge (1.435 m), and the rolled-edge rail (which bellied out on the underside for strength).\n\nEarly Railways in British North America\n\nRailway fever came a little later to British North America; the colony had a small population and much of its capital was tied up in the expansion of its canals and inland waterways. Nevertheless, it did not take long for politicians and entrepreneurs to realize the potential benefits. The Province of Canada (1841–1867) was an enormous country. Its roads were poor and its waterways were frozen for up to five months per year.\n\nThe first true railway built in Canada was the Champlain and Saint Lawrence Railroad from La Prairie on the St. Lawrence River to St. Johns on the Richelieu River (now Saint-Jean-sur-Richelieu). Backed by John Molson and other Montreal merchants, the line opened officially on 21 July 1836. Built as a “ portage” between Montreal and Lake Champlain, in practice the railway carried little freight. (See also Canada’s First Railway.)\n\nOn 19 September 1839, the first railway in the Maritimes opened; the Albion Mines Railway was built to carry coal from Albion Mines some 9.5 km to the loading pier at Dunbar Point (near Pictou, Nova Scotia). The Montreal and Lachine Railroad (1847) was another short (12 km) line built to supplement water transportation.\n\nRailway Mania\n\nMore ambitious was the St. Lawrence and Atlantic Railroad, promoted initially by John A. Poor of Portland, Maine, and Canadian entrepreneur Alexander Tilloch Galt. The dual purpose of the line was to provide Montreal with a year-round ocean outlet and Portland with access to a hinterland. Promotion of the railway set a pattern often repeated later. In the initial enthusiasm, Montrealers subscribed £100,000 but paid only 10 per cent of that amount. Galt raised another £53,000 in England and mortgaged his land company to get the project moving.\n\nBut it was the Guarantee Act, 1849, sponsored in the Canadian legislature by Galt’s friend Francis Hincks, which ensured the railway’s completion (1853). Under the Act, railways that were longer than 75 miles (120 km) were eligible to receive a government grant that guaranteed interest of up to 6 per cent on half its bonds once half of the railway had been completed. While the Act established government assistance for railway construction, it also inspired a railway building mania in Canada, and led companies and governments to overextend themselves financially.\n\nAnother collaboration between Canadian and American interests lay behind the Great Western Railway, which began construction in October 1849 and was completed from Niagara Falls to Windsor, Canada West (Ontario), in January 1854. In this case Conservative politician and businessman Allan MacNab arranged for partners in Canada and the United States, and persuaded the legislature to proffer a loan of £200,000, profiting mightily himself.\n\nThe most ambitious pre-Confederation railway project in Canada was the Grand Trunk Railway (GTR) — a bold attempt by Montreal to capture the hinterland of Canada West and traffic from American states in the Great Lakes region. The GTR aroused great anticipation, but Canadians had neither the money nor the technicians to build it. The success of Hincks and other promoters in raising money for the GTR and other railway projects was largely due to their determination and the seemingly unbounded enthusiasm of British investors for railways.\n\nBy the time it was completed from Sarnia to Montréal in 1860, the GTR was £800,000 in debt to the British banks of Baring Bros and Glyn Mills. Edward Watkin, sent out by head office to reorganize the railway, declared the GTR “an organized mess — I might say a sink of iniquity.” The GTR relied on government assistance in order to continue operations, and in 1862 the Grand Trunk Arrangements Act provided yet more resources to the railway company. The public, which had earlier been enthusiastic about the GTR’s potential, viewed such handouts with contempt and hostility.\n\nEconomic and Industrial Impact\n\nThe financial difficulties experienced by all early railways forced massive public expenditures in the form of cash grants, guaranteed interest, land grants, rebates, and rights-of-way. In return, the railways contributed to general economic developments, and the indirect benefits for business and employment were significant. Unlike canals, railways extended into new territories and pushed the agricultural and timber frontiers westward and northward.\n\nThe effect of railways on emerging urban centres was crucial and dramatic. Toronto’s dominant position in south-central Ontario was clearly established by its rail connections. It benefited from its connections with the Great Western and its central place on the GTR, neither of which it had done much to help build. It also tapped the northern hinterland via the Ontario, Simcoe and Huron Railway (completed to Collingwood, on Georgian Bay, in 1855, with a branch line to Belle Ewart on the south shore of Lake Simcoe), the Toronto, Grey and Bruce Railway (completed to Owen Sound, on Georgian Bay, in 1873), and the Toronto and Nipissing Railway (extended to Lake Simcoe in 1877). Toronto was also home to the first locomotive built in Canada; the Toronto No. 2 of the Ontario, Simcoe and Huron line was built by James Good of Toronto in 1853.\n\nWhile railways were also constructed in sparsely populated and nonindustrial areas such as Newfoundland, they were not as profitable and tended to diminish in size and importance over time. The development of a Newfoundland Railway system is a case in point. In 1919, the Grand Trunk Railway was earning $16,000 per mile while the Newfoundland system was earning $1,500.\n\nThe railways played an integral role in the process of industrialization, tying together and opening up new markets while, at the same time creating a demand for fuel, iron and steel, locomotives, and rolling stock. The pioneer wood-burning locomotives required great amounts of fuel, and “wooding-up” stations were required at regular intervals along the line.\n\nEntrepreneurs invested in the manufacture of almost everything that went into the operation of the railway, and consequently railways had a positive effect on levels of employment. Some small towns became railway service and maintenance centres, with the bulk of the population dependent on the railway shops; for example, the Cobourg Car Works employed 300 workers in 1881. The railway also had a decisive impact on the physical characteristics of Canadian cities: hotels and industries were built around tracks, yards, and stations, making the railway a central feature of the urban landscape.\n\nThe railway greatly stimulated engineering, particularly with the demand for bridges and tunnels. Canadians contributed a few inventions, notably the first successful braking system (W.A. Robinson, 1868) and the rotary snowplough (J.W. Elliott, 1869; developed further by O. Jull), which made possible safe, regular travel in Canadian winters. The great Canadian railway engineer Sir Sandford Fleming devised his famous zone system of time to overcome the confusion of clocks varying from community to community along the rail routes (see Invention of Standard Time).\n\nThe Transcontinentals\n\nThe second phase of railway building in Canada came with Confederation in 1867. As historian George Stanley wrote in The Canadians, “Bonds of steel as well as of sentiment were needed to hold the new Confederation together. Without railways there would be and could be no Canada.” In fact, the building of the Intercolonial Railway was a condition written into the Constitution Act, 1867. Because of the grand scale of the new nation, and the fact that political considerations often overrode economic realities (e.g., in the circuitous routes the Intercolonial and other railways took to avoid American territory), government assistance was crucial in building the transcontinental railways.\n\nThe Intercolonial was owned and operated by the federal government and was largely financed with British loans backed by imperial guarantees. Despite the badgering of commissioners determined to make political advantage, Fleming built the Intercolonial to the highest standards and completed it by 1876.\n\nThe Canadian Pacific Railway\n\nIn 1871, British Columbia was lured into Confederation with the promise of a transcontinental railway within 10 years. The proposed line — 1,600 km longer than the first US transcontinental — represented an enormous expenditure for a nation of only three and a half million people. Two syndicates vied for the contract, and it was secretly promised to Sir Hugh Allan in return for financial support for the Conservatives during the closely contested 1872 election. The subsequent revelation that Allan was largely backed by American promoters, and that he had sunk $350,000 into the Conservative campaign, brought down the government (see Pacific Scandal).\n\nDid you know?\n\nTreaties 1 to 7, concluded between the Crown and First Nations from 1871 to 1877, solidified Canada’s claim to lands north of the US-Canada border. They enabled the construction of a national railway and opened the lands of the North-West Territories to agricultural settlement. In exchange for their traditional territory, government negotiators made various promises to First Nations — both orally and in the written texts of the treaties — including special rights to treaty lands and the distribution of cash payments, hunting and fishing tools, farming supplies, and the like. These terms of agreement are controversial and contested. To this day, the Numbered Treaties have ongoing legal and socioeconomic impacts on Indigenous communities.\n\nOn 21 October 1880, the government finally signed a contract with the Canadian Pacific Railway (CPR) Company, headed by George Stephen, and construction began in 1881. The “Last Spike” was driven on 7 November 1885 and the first passenger train left Montreal in June 1886, arriving in Port Moody, BC, on 4 July. Completion of the railway was one of the great engineering feats of the day and owed much to the indefatigable supervision of William Van Horne and the determination of Sir John A. Macdonald. While Macdonald’s government was criticized for the generous terms offered to the company, it considered the railway crucial to the nation.\n\nThough ostensibly a private enterprise, the CPR was generously endowed by the federal government with cash ($25 million), land grants (25 million acres), tax concessions, rights-of-way, and a 20-year prohibition on the construction of competing lines on the prairies that might provide feeder lines to US railways. Whether or not the country received adequate compensation for this largesse has been hotly debated ever since. However, the CPR was built in advance of a market and by a very expensive route through the Canadian Shield of Northern Ontario. Macdonald’s controversial decision in favour of an expensive all-Canadian route seemed to be vindicated during the North-West Rebellion; how would the American government have reacted to Canadian troops moving across American territory? The CPR also had a profound effect on the settlement of the Prairie West, and new cities, from Winnipeg to Vancouver, were heavily dependent on the railway. Other western towns were strung out along the railway like beads on a string.\n\nDid you know?\n\nThe construction of Canada’s railways created a great demand for workers. New immigrants from the British Isles, continental Europe and China made up much of the labour force on these projects. Railway construction also drew workers from local communities and the United States. Upon arriving in Canada, many immigrants encountered exploitative working conditions and poor living circumstances. This was the case for some 15,000 Chinese labourers who helped to build the Canadian Pacific Railway. Working in harsh conditions for little pay, they suffered greatly and historians estimate that at least 600 died. (See also Immigrant Labour; Working-Class History.)\n\nThe Canadian Northern Railway\n\nThe flood of immigrants to the Prairie West after 1900 and the dramatic increase in agriculture soon proved the CPR inadequate, and a third phase of railway expansion began. Numerous branches sprouted in the West, of which the most notable was the Canadian Northern Railway, owned by the two bold entrepreneurs Donald Mann and William Mackenzie. The Canadian Northern grew by leasing and absorbing other lines; it also constructed new links to Regina, Saskatoon, Prince Albert and Edmonton, and pushed on through the Yellowhead Pass. It was linked to the East, with its main eastern terminus at Montreal, and also operated mileage in eastern Quebec and the Maritimes.\n\nThough sometimes portrayed as rapacious promoters, Mackenzie and Mann built their railway to serve Western needs that were not being met by the CPR, and they invested most of their own fortunes in the enterprise. Nevertheless, the railway received public assistance of $250 million, most of it in the form of provincial and federal bond guarantees.\n\nA Third Transcontinental Railway\n\nMeanwhile, Prime Minister Wilfrid Laurier enthusiastically encouraged the development of a third transcontinental railway by the Grand Trunk company, now led by Charles M. Hays. Although it would have made sense for the GTR to co-operate with the Canadian Northern company, mutual jealousies made such co-operation difficult. Therefore, the federal government itself decided to build a line from Winnipeg to Moncton (the National Transcontinental Railway or NTR) and to lease it to the GTR on completion. The NTR was built through the expanse of northern Quebec and Ontario in hopes of encouraging development there; begun in 1905, it was completed in 1913 at a cost of $160 million. The GTR’s subsidiary, the Grand Trunk Pacific (GTP), constructed the more profitable line westward from Winnipeg. The GTP began construction in 1906 and was completed in 1914 through the Yellowhead Pass and along the spectacular Skeena River valley to Prince Rupert, BC.\n\nDid you know?\n\nIn 1912, more than 7,000 immigrant workers on the Canadian Northern Railway and the Grand Trunk Pacific Railway went on strike in British Columbia. Led by the Industrial Workers of the World, they demanded better living conditions in their work camps, including sanitation and a minimum wage. The workers’ demands were largely refused. The provincial government used violence and mass arrests to break the strikes. (See Fraser River Railway Strikes.)\n\nNationalization\n\nThe ill-planned proliferation of railways proved disastrous. Rumours of outrageous patronage in the building of the NTR were later confirmed. The Canadian Northern and GTP were constantly begging aid from the public purse. The First World War delivered the knockout blow, ending immigration and stifling the flow of British capital. In confusion and frustration, Prime Minister Robert Borden called a royal commission, headed by Sir Henry Drayton and British financier W.M. Acworth, which in May 1917 recommended the nationalization of all railways except the CPR. By the 1920s, the Canadian Northern, Intercolonial, Grand Trunk Railway and Grand Trunk Pacific were brought together to form the Canadian National Railways (CNR).\n\nDid you know?\n\nIn the first decades of the 20th century, the job of sleeping car porter was one of the few positions available to Black men in Canada. Sleeping car porters were railway employees who attended to passengers aboard sleeping cars. While the position carried respect and prestige for Black men in their communities, the work demanded long hours for little pay. Porters could be fired suddenly and were often subjected to racist treatment. Black Canadian porters formed the first Black railway union in North America (1917) and became members of the larger Brotherhood of Sleeping Car Porters in 1939. Both unions combatted racism and the many challenges that porters experienced on the job.\n\nThe North\n\nThe period after the formation of the CNR was essentially one of consolidation, although several lines were pushed into northern frontiers. The Hudson Bay Railway, beginning at a line built by Mackenzie and Mann to The Pas, Manitoba, in 1906, was finally opened to traffic in 1929. The Pacific Great Eastern began pushing slowly into the interior of BC in 1912. It was completed from Squamish to Quesnel by 1921, and finally reached Prince George and Dawson Creek in the 1950s. Northern Alberta Railways (owned jointly by CNR and CPR) ran lines from Edmonton North to Grande Prairie and to Dawson Creek by 1931.\n\nPerhaps the most successful of these ventures was the Ontario Northland Railway, which reached James Bay in 1932. Owned by the Ontario government, the railway led directly to a mining boom in the Timmins-Porcupine area as well as to the emergence of the giant pulp and paper industry. The Quebec, North Shore and Labrador Railway, completed in 1954, provided access to the massive iron-ore deposits of interior Quebec and Labrador. The Great Slave Lake Railway was opened in 1964 between Roma, Alberta, and Hay River, Northwest Territories.\n\nChallenges\n\nMore recently, railways have faced challenges from other modes of transportation. This has prompted significant changes at both the Canadian National Railway and the Canadian Pacific Railway, including the privatization of CN in 1995 and the streamlining of operations at CP. Both railways are important carriers of bulk commodities in North America, particularly coal and grain. Many finished goods are also transported by rail, using railway containers that can easily be transferred between train, ship, and truck. Due to the relatively low cost of rail transport, rail is a cost-effective option for the long-distance transport of Canadian and American goods to market.\n\nHowever, passenger travel has declined significantly. In order to compensate railways for the loss of passenger fares, the Canadian government offered direct subsidies to the railways from 1967 to 1977. This ended with the creation of VIA Rail in 1977, which became a Crown Corporation in 1978. VIA is responsible for most intercity passenger operations. In the 2000s, financial pressures led to the reduction of intercity service, although VIA still operates many passenger trains in the Quebec City–Windsor corridor.\n\nLegacy\n\nDid the railways achieve the ends expected of them? Did they repay the large infusions of public money? A final accounting can likely never be done, particularly in terms of judging the satisfaction of nationalistic and long-term economic goals. Regulation of the railways (now the responsibility of the Canadian Transportation Agency) and freight-rate agreements (notably the Crow’s Nest Pass Agreement) have been highly controversial, and very different views have been taken by western farmers and the railway companies on these issues (see Transportation Regulation).\n\nAt the same time, the railwaymen — from Fleming and Van Horne to Allan, Mann, Mackenzie, Stephen and Lord Shaughnessy — have been among the most prominent figures in Canadian history, evoking by turns admiration for their outstanding engineering feats and contempt for their perceived bleeding of the public purse."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/canadian-pacific-railway", "page_content": "This is the full-length entry about the Canadian Pacific Railway. For a plain-language summary, please see The Canadian Pacific Railway (Plain-Language Summary) .\n\nThe Canadian Pacific Railway company (CPR) was incorporated in 1881. Its original purpose was the construction of a transcontinental railway, a promise to British Columbia upon its entry into Confederation (see Railway History ). The railway — completed in 1885 — connected Eastern Canada to British Columbia and played an important role in the development of the nation. Built in dangerous conditions by thousands of labourers, including 15,000 Chinese temporary workers, the railway facilitated communication and transportation across the country. Over its long history, the Canadian Pacific Railway diversified its operations. The company established hotels , shipping lines and airlines, and developed mining and telecommunications industries (see Shipping Industry ; Air Transport Industry ). In 2001, Canadian Pacific separated into five separate and independent companies, with Canadian Pacific Railway returning to its origins as a railway company. CP, as it is branded today, has over 22,500 km of track across Canada and the United States. It is a public company and it trades on the Toronto Stock Exchange and the New York Stock Exchange under the symbol CP. In 2020, CP reported $7.71 billion in total revenues.\n\nThe Canadian Pacific Railway company (CPR) was incorporated in 1881. Its original purpose was the construction of a transcontinental railway, a promise to British Columbia upon its entry into Confederation (see Railway History). The railway — completed in 1885 — connected Eastern Canada to British Columbia and played an important role in the development of the nation. Built in dangerous conditions by thousands of labourers, including 15,000 Chinese temporary workers, the railway facilitated communication and transportation across the country. Over its long history, the Canadian Pacific Railway diversified its operations. The company established hotels, shipping lines and airlines, and developed mining and telecommunications industries (see Shipping Industry; Air Transport Industry). In 2001, Canadian Pacific separated into five separate and independent companies, with Canadian Pacific Railway returning to its origins as a railway company. CP, as it is branded today, has over 22,500 km of track across Canada and the United States. It is a public company and it trades on the Toronto Stock Exchange and the New York Stock Exchange under the symbol CP. In 2020, CP reported $7.71 billion in total revenues. This is the full-length entry about the Canadian Pacific Railway. For a plain-language summary, please see The Canadian Pacific Railway (Plain-Language Summary).\n\nDid you know?\n\nAlthough sections of the track were not quite complete, the section from Callander to Port Arthur (Thunder Bay), Ontario, was used to move troops westward during the North-West Resistance, though it was not quite complete.\n\nDeveloping Business\n\nDuring construction, the CPR became involved in the sale and settlement of land (1881), the acquisition of the Dominion Express Company (1882) and the acceptance of commercial telegraph messages (1882). The company provided its own sleeping and dining cars on trains and constructed tourist hotels (e.g., at Lake Louise, Alberta) and dining halls along the route in the western mountains. This foothold on the tourist industry benefited the CPR later in its international development of hotels, steamships and airlines (see Hotel; Tourism).\n\nDid you know?\n\nIn the first decades of the 20th century, the job of a sleeping car porter was one of the few positions available to Black men in Canada. Sleeping car porters were railway employees who attended to passengers aboard sleeping cars. While the position carried respect and prestige for Black men in their communities, the work demanded long hours for little pay. Porters could be fired suddenly and were often subjected to racist treatment.\n\nFollowing construction, the greatest challenge facing the CPR was to develop business to make the line self-sustaining. Though settlement proceeded rapidly in the wake of the rail lines, the population in western Canada was insufficient to sustain the line fully for many years. To increase business, the corporation became very active in promoting trade in the Pacific. Within days of the arrival of the first train on the west coast in 1886, sailing vessels chartered by the CPR began to arrive from Japan, bringing tea, silk and curios. By 1891, the company had secured a contract from the British government to carry the imperial mails from Hong Kong to Britain via Canada. The result was the purchase of three ocean passenger-cargo vessels, forerunners of the present-day fleet.\n\nHotels\n\nBy 1900, the mountain hotel system had expanded into the major cities, led by the Hotel Vancouver (1887), Québec's Château Frontenac (1893) and Montreal's Place Viger (1898) ( see Hotel; Tourism). Other services expanded simultaneously. A line was opened (1889) across northern Maine from Montréal to Saint John, giving the CPR direct access to an all-weather Atlantic port.\n\nRail Construction\n\nAttempts to capture traffic from the western American states were made with the construction of a line to North Dakota (1893) and the eventual consolidation of what is now the Soo Line Railroad Company in the United States. Branch lines were greatly extended to feed traffic to the East-West main line. Rapid settlement followed construction of branches in southern Manitoba, in Saskatchewan from Regina to Prince Albert (1890), and in Alberta from Calgary North to Strathcona (Edmonton) in 1891.\n\nMining\n\nExpansion into the Kootenay mining region of southern British Columbia (1898) involved the acquisition of a railway charter that included a smelter at Trail, BC. This was the nucleus of the CPR's involvement in mining and metallurgy, formalized by the formation of Cominco Limited in 1906, a CP-controlled company (in 2001, Cominco was acquired by Teck, another mining company).\n\nFleet\n\nThe CPR’s Pacific fleet was improved and, in 1903, the company purchased the Beaver Line shipping company and opened service in the North Atlantic. In 1909, CPR purchased the long-established Allan Line, and formed Canadian Pacific Ocean Services in 1914–5. After 1921, it became known as Canadian Pacific Steamships Limited.\n\nExpansion and Competition\n\nBetween 1899 and 1913, the CPR increased its trackage from approximately 11,200 km to 17,600 km. More than half of the new track was in the Prairie provinces, and it was intended both to provide branch lines into areas of need and to ensure that the CPR would remain competitive in relation to the developing transcontinental lines of the Canadian Northern Railway and the Grand Trunk Pacific Railway.\n\nThe widespread expansion of the company, much of it under the presidency of T.G. Shaughnessy (1899-1918), placed a heavy drain on company resources, but continuance of the National Policy, with its substantial tariffs, meant continuing high freight rates in the West.\n\nAttacks on these rates in 1896 helped to bring about the defeat of the Conservatives. The Liberals reduced rates with the Crow's Nest Pass Agreement in 1897 and, under the Manitoba Grain Act of 1900, required railways to provide loading platforms for farmers. Charters were also granted to the Canadian Northern Railway to develop the huge area of northern prairie left vacant by the CPR.\n\nCanadian National Railway (CNR), formed by the government of Canada between 1917 and 1923, was a major challenge for the CPR. The CNR consolidated the failing Grand Trunk Pacific, Canadian Northern, Intercolonial and Canadian Government Railways. The CNR also competed with the CPR in hotels, telegraphs, steamships and express services as well as railway services.\n\nSecond World War\n\nDespite this massive, government-supported competition, CPR survived as a commercial enterprise. During the Second World War it provided not only transportation, but also the production of armaments and materiel in its own shops. During the conflict, much of its merchant fleet was commandeered for military transport purposes, resulting in the loss of 12 vessels.\n\nAirlines\n\nCanadian Pacific Air Lines (later CP Air) was organized in 1942 with the purchase of Grant McConachie's Yukon Southern Air Transport and numerous other flying concerns. After 1947, under McConachie's leadership, CPA developed into an international carrier serving the Far East, Australasia, most of South America and several European countries (see Aviation). In 1987, CP Air was acquired by Pacific Western and the two companies began operations as Canadian Airlines International (CAI). It was later expanded with the purchase of Wardair. A rigorously competitive market and government regulation caused significant changes to the airline industry in the 1990s. CAI was taken over by Air Canada in 2000.\n\nDiversification\n\nUntil the late 1950s, CP's diverse interests were looked upon as ancillary to the rail system. Beginning around this time, management embraced a policy of full diversification by making each operation fully self-supporting. Thus, operations that had been handled by specific departments in the railway corporate structure were set up as enterprises in their own right; e.g., Marathon Realty Co Ltd (1963), which took over the administration of real estate other than that required for railway use; CP Hotels Ltd (1965); and CP Oil & Gas Ltd (1958), which later became PanCanadian Energy Corporation.\n\nNon-transportation interests were vested into a holding company called Canadian Pacific Enterprises Limited. Founded in 1962 this holding company left railway, air, ship and highway transportation fields under the jurisdiction of the parent company. In 1968, a new corporate identity program gave the names CP Rail, CP Ships, CP Transport and CP Air to the various transportation modes.\n\nIn 1967, the communications wing was integrated, along with CN's parallel organization, into a new, jointly owned company known as CNCP Telecommunications Ltd (see Telecommunications). In 1990, CNCP became Unitel Communications, which was later sold to other communications providers.\n\nIn 1971, to reflect its broader orientation, the company’s original name was altered to Canadian Pacific Limited (CPL).\n\nRestructuring\n\nIn 1996, the company was restructured, with Canadian Pacific Railway becoming a subsidiary of the company rather than a division (in effect, CPR would operate independently, with no cross-subsidies from the other divisions). The company also sold several of its enterprises, including Marathon Realty (1996) and its interest in Laidlaw Inc. (1997).\n\nIn 2001, the company separated into five independent companies: Canadian Pacific Railway, CP Ships, PanCanadian Energy Corporation, Fording Coal and Canadian Pacific Hotels (renamed Fairmont Hotels & Resorts Inc.). The restructuring meant that CPR was once again purely a rail company.\n\nPanCanadian merged with the Alberta Energy Company Limited in 2002 to become Encana, one of the world’s leading energy producers, while CP Ships was sold to a German conglomerate in 2005, becoming part of the Hapag-Lloyd shipping company. Fording Coal was purchased in 2008 by Teck Cominco."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/national-transcontinental-railway", "page_content": "Construction workers near Dryden, Ontario, in the early 20th century (courtesy PAO/S 16182).\n\nNational Transcontinental Railway\n\nThe National Transcontinental Railway (NTR) was a government-built railway from Winnipeg, via Sioux Lookout, Kapuskasing, Cochrane and Québec City, to Moncton. In October 1903 the government of Sir Wilfrid LAURIER committed itself to the construction of a third transcontinental railway, despite the existence of the CANADIAN PACIFIC RAILWAY and the CANADIAN NORTHERN RAILWAY . Its purpose was to provide western Canada with direct rail connection to Canadian Atlantic ports, and to open up and develop the northern frontiers of Ontario and Québec.\n\nThe NTR's development was rooted in the power play between railway entrepreneurs and politicians of the early twentieth century. Visions of the grain-rich West expanding with new settlers and industries prompted Prime Minister, Sir Wilfrid Laurier to commit the government to the expensive but potentially profitable enterprise. Laurier also believed that healthy competition would force the CPR to lower freight rates, thus pleasing Western shippers, who would contribute to healthy competition between railways. He persuaded the GRAND TRUNK RAILWAY (GTR), under the leadership of Charles HAYS, to take part in western railway expansion with the assistance of the Canadian Northern Railway. But mutual jealousies precluded logical co-operation between the GTR and Canadian Northern, and, realizing its importance to national development, the federal government opted to build part of the line itself. The GTR's subsidiary, the GRAND TRUNK PACIFIC RAILWAY (GTPR) Company, would build the western section (Winnipeg to the Pacific), while the government itself would build the eastern section (Winnipeg to Moncton) and eventually turn it over to the GTPR for operation.\n\nIn 1903, Laurier's government enacted the Railway Act, allowing the project's construction. The Act specified the establishment of the Board of Railway Commissioners, the precursor to the CANADIAN TRANSPORTATION AGENCY, which would oversee the project. Yet, the commissioners faced a daunting task. The significant cost overruns of the railway's construction opened Laurier's Liberals to public scrutiny, subsequently leading to their downfall in 1911. The task was left to Robert BORDEN's Tories to finish.\n\nDespite substantial problems with both administration and cost, the last spike was driven on 17 November 1913, completing the eastern section except for the QUÉBEC BRIDGE. The NTR was never incorporated and the financial problems of the GTPR prevented it from taking over the NTR as agreed. It remained under government management until 1918, when operations were entrusted to the recently nationalized Canadian Northern Railway. In 1923 it became a part of the CANADIAN NATIONAL RAILWAYS."}, {"url": "https://www.history.com/this-day-in-history/canadas-transcontinental-railway-completed", "page_content": "At a remote spot called Craigellachie in the mountains of British Columbia, the last spike is driven into Canada’s first transcontinental railway.\n\nIn 1880, the Canadian government contracted the Canadian Pacific Railroad to construct the first all-Canadian line to the West Coast. During the next five years, the company laid 4,600 kilometers of single track, uniting various smaller lines across Canada. Despite the logistical difficulties posed by areas such as the muskeg (bogs) region of northwestern Ontario and the high rugged mountains of British Columbia, the railway was completed six years ahead of schedule.\n\nThe transcontinental railway was instrumental in populating the vast western lands of Canada with settlers and providing supplies and commerce. Many of western Canada’s great cities and towns grew up around Canadian Pacific Railway stations."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/canadian-national-railways", "page_content": "\n\n\n\nCN Predecessors\n\nThe Grand Trunk was itself an amalgamation of various smaller lines, including the 23.2 km Champlain and Saint Lawrence Railroad (1836), which connected Montréal with boat traffic to Lake Champlain and the port of New York; the Great Western Railway linking Niagara, Hamilton and Toronto with Windsor and Sarnia; and the St Lawrence and Atlantic Railroad, which gave Montréal access to the year-round port facilities of Portland, Maine. The Grand Trunk became the dominant long-distance railway in central Canada, but its English shareholders would not agree to the expense of building from Québec City to Halifax over Canadian soil, nor to construction westward over the 1,600 km of the Laurentian Shield. Those challenges were faced after Confederation by the government-owned Intercolonial Railway from Halifax to Québec City and by the heavily subsidized Canadian Pacific Railway (CPR).\n\nCanadian National Railways poster depicting a strong, young farmer, circa 1924. A vintage and iconic Canadian National Railways logo on a train car outside Pier 21 on the Halifax waterfront. Photo taken 25 December 2011. PreviousNext\n\n\n\n\n\nAlthough Canada by the 1890s was traversed from sea to sea by the CPR, increased immigration and agricultural production in the West led to the developmental of new transcontinental railways, many of which were financially supported by the federal government. The Canadian Northern, founded by William Mackenzie and Donald Mann, began as an amalgamation of two small Manitoba lines in 1899 and grew into a transcontinental railway system of over 16,000 km. In 1903, Sir Wilfrid Laurier’s Liberal government authorized the building of the Grand Trunk Pacific from Winnipeg west to Prince Rupert, and of the National Transcontinental from Winnipeg east to Moncton.\n\nAll of these lines were financed by heavy borrowing, mostly from British banks. However, when the First World War began, credit was no longer available from the banks. The government called a royal commission, which in 1917 recommended nationalization of all the railways (except the CPR) and absorption of the railways’ debts.\n\nNationalization\n\nBy 1919, the Intercolonial, Canadian Northern, National Transcontinental and Grand Trunk Pacific had become part of a government railway system known as the Canadian National Railways (CN). In January 1923, the Grand Trunk Railway officially became part of this system. At around the same time, Sir Henry Thornton was appointed president of CN. Despite an inherited debt of $1.3 billion, gross earnings that barely covered operating expenses, and the difficulty of keeping the government at arm’s length, Thornton gradually established annual surpluses while drawing remarkable personal support from among the 99,000 employees of CN. He promoted community service, supporting branch lines and introducing school cars and Red Cross units to serve children and the sick in regions remote from urban centres.\n\n\n\n\n\nCanadian National Railways (CNR) sleeping car interior, circa 1929.\n\nBetween 1923 and 1932, he was responsible for using CN facilities to develop a network of radio stations, which inaugurated programs such as Hockey Night in Canada and led to the formation of the Canadian Broadcasting Corporation (see Radio and Television Broadcasting). However, partisan politics forced Thornton's resignation in 1932.\n\nThe Great Depression\n\nEconomic depression in the 1930s reduced traffic volume, leading to cuts in wages and dismissal of employees (see Great Depression ). At the same time, highway and air travel diverted traffic away from the railway. In 1937, however, under C. D. Howe as minister of transport, CN organized formation of Trans-Canada Airlines (now Air Canada), and in 1938 the federal government cancelled more than $1 billion of its inherited debt. As a result, CN was able to purchase a large number of Canadian-built steam locomotives (in particular the 4-8-4 Northern type), which were finished and serviced in the corporation’s huge shops at Pointe St-Charles, Montréal. These locomotives hauled millions of tons of freight and thousands of troops during the Second World War .\n\nModernization and Diversification\n\nIn the 1950s and 1960s, CN was modernized under the dynamic presidency of Donald Gordon, who rationalized (or reorganized) 80 subsidiary companies down to 30. Gordon also directed the conversion to diesel locomotives and electronic signalling and moved the head office to Montréal.\n\nCanadian National Railways Montreal terminals, moving scissors switch, 1930. Canadian National freight train passing through Africville, 1965. PreviousNext\n\n\n\n\n\nBy the end of the 1970s, CN had merged its own system of telecommunications with that of Canadian Pacific (creating CNCP Telecommunications) and had completed construction of the CN Tower in Toronto. CN Real Estate redeveloped company-owned downtown properties in several cities, including the Toronto Convention Centre Complex.\n\nIn 1981, CN Exploration was formed to develop CN-owned mineral rights in western Canada. On the highway, Canadian National amalgamated all its trucking subsidiaries into CNX/CN Trucking, their trailers carried over long distances on piggy-back rail cars.\n\nRefocusing on Rail\n\nIn the late 1970s, CN started to divest itself of non-rail businesses, including real estate, hotels, and CNCP Telecommunications. Around the same time, Air Canada and VIA Rail, CN’s passenger train subsidiary, became separate Crown corporations (shortly after incorporation, VIA also took over passenger rail services from Canadian Pacific). By 1989, CN was primarily a rail freight company.\n\nCN also abandoned thousands of kilometres of money-losing branch lines across the country, as well as entire track networks in Newfoundland and Prince Edward Island.\n\nPrivatization\n\nFrom the mid-1980s, there was increasing talk about privatizing CN. As a railway company, CN required significant capital investment on an ongoing basis. Politically, ownership by the federal government often influenced high-level appointments with at least as much respect for partisan interest as for “hands off” direction.\n\nIn Canada (as in Britain under Prime Minister Margaret Thatcher), the economic recession of the 1980s led to the privatization of many national companies. In the 1980s and 1990s, over two dozen Crown corporations were sold to private investors, including Air Canada (1988) and Petro-Canada (1991). In November 1995, CN was also privatized, with many of its shares bought by American investors. According to the CN Commercialization Act of 1995, the company headquarters had to remain in Montréal , which ensured that CN would remain a Canadian corporation.\n\nFollowing privatization, CN shed much of its track and staff and increased its profitability. In February 1998, it purchased US rail company Illinois Central Corporation for US$2.4 billion. The acquisition of Illinois Central expanded CN’s rail network to a third coast, the Gulf of Mexico. CN later acquired Wisconsin Central (2001), the rail and marine holdings of Great Lakes Transportation (2004), shares of BC Rail (2004), and the Elgin, Joliet & Eastern Railway (2009).\n\nThe largest rail network in Canada, CN is also the only transcontinental rail network in North America. It transports approximately $250 billion worth of goods annually, and in 2016 earned over $12 billion in revenue. That same year, the company employed over 22,000 people in Canada and the US."}, {"url": "http://www.virtualmanitoba.com/riverdale/GTP/p1.html", "page_content": "\n\n\n\n\n\n\n\nA Short History of\n\nThe Grand Trunk Pacific Railway\n\n\n\n\n\n\n\nThe busy Canadian National Railway line, which passes through the Municipality of Daly carries both freight and passengers from coast to coast. The re-introduction / or relocation of the passenger depot from Brandon North to the Town of Rivers has put that town back on the map of important railway towns. The line has its origins with the Grand Trunk Pacific, a wholly owned subsidiary of the Grand Trunk Railway, which established the Town of Rivers as a divisional point on its new line in 1908.\n\n\n\nAt that point The Grand Trunk Railway was a well-established successful company, it had completed a line between Montréal and Toronto in 1856, then expanded rapidly through takeovers and new construction. It built the Victoria Bridge over the St. Lawrence River at Montréal, a bridge over the Niagara River and a tunnel under the St. Clair River at Sarnia. By the 1880s it had lines from Chicago to the Atlantic coast, and ranked among the largest railway systems in the world.\n\n\n\nAs the twentieth century approached railway operations in western Canada were under the control of the Canadian Pacific, which in 1885 had completed its cross-country line, and by the Canadian Northern which had begun the start of a second transcontinental. The Grand Trunk had missed an opportunity to expand westward in the 1880's when the Canadian Government was actively seeking bid for the construction of a transcontinental line.\n\n\n\nThe R.M. of Daly was without any rail connection until, 1902 when the Great Northwest Central Railway built a line from Forrest to Lenore. The new villages of Bradwardine, Wheatland, Pendennis and Carnegie were established on that line. All of these names except Carnegie were already on the map as Post Offices but locations were changed.\n\n\n\nIn 1903 the Grand Trunk established a subsidiary, the Grand Trunk Pacific Railway, to build a line from Winnipeg to the Pacific. This Canadian company was incorporated by act of the Dominion Parliament, 24 Oct. 1903 (The National Transcontinental Railway Act). It was a time of seemingly endless prosperity and growth, and its creation was encouraged by the newly-elected Liberal government of Sir Wilfred Laurier at the urging of Sir Charles Rivers-Wilson, Chairman of the Grand Trunk Railway.\n\n\n\n\n\nThe line was constructed using loans provided by the Government of Canada. The company had a mandate to build west from Winnipeg, Manitoba to the Pacific coast at Prince Rupert, British Columbia. East of Winnipeg, the federal government would build the National Transcontinental Railway (NTR) across Northern Ontario and Quebec,\n\n\n\n\n\n\n\nNew York Times, Dec. 7, 1902\n\n\n\ncrossing the St. Lawrence River at Quebec City and ending at Moncton, New Brunswick. The conceptual plan was to have GTR operate both GTPR and NTR as a single transcontinental railway, competing with the Canadian Northern Railway (CNR) and Canadian Pacific Railway (CPR).\n\n\n\nThis second Canadian transcontinental rail route would feature a terminal on the Pacific that would actually be nearer to Asia than was the existing terminus of the C.P.R. at Vancouver. It was to follow one of the routes surveyed by Sandford Fleming much earlier for the first transcontinental line and rejected. The original survey ran from Winnipeg to Port Simpson at the end of the Portland Canal, which formed part of the boundary between British Columbia and Alaska.\n\n\n\nUnder Charles M. Hays, the Grand Trunk's energetic general manager who also became Grand Trunk Pacific's president, the new company pushed its line west.\n\n\n\nConstruction began on the Canadian Prairies in 1905, the year that the provinces of Alberta and Saskatchewan were established with the first sod turned near Carberry, Manitoba on August 29. Construction proceeded west to Saskatoon, Saskatchewan in 1907, Edmonton, Alberta in 1909, and through Jasper, Alberta into Yellowhead Pass crossing the Continental Divide in 1910-1911. The last spike ceremony heralding completion of the rail line across the prairies, and through the Rocky Mountains to the newly constructed seaport at Prince Rupert, British Columbia was held one mile east of Fort Fraser, British Columbia on April 7, 1914.\n\n\n\n\n\n\n\nThe Rivers/Daly area in 1915\n\n\n\n\n\nIn 1907 the Grand Trunk Pacific entered the municipality from the east with stations at Levine and Myra, and most importantly, a divisional point and major town at Rivers.\n\n\n\nThe above map, from 1915, shows the two lines crossed the municipality at the height of railway development.\n\n\n\nIn 1910, the company also built a dock in Seattle, the Grand Trunk Pacific dock, which was the largest dock on the west coast at the time it was built. On July 30, 1914, the dock was destroyed by fire.\n\n\n\n\n\n\n\nPassenger service was inaugurated in 1910.\n\n\n\nIn Manitoba villages with either sidings or stations were created in alphabetical order, starting just west of Portage la Prairie with the siding known as Arona and continues with Bloom, Caye, Deer, Exira, Firdale, Gregg, Harte, Ingelow, Justice, Knox, Levine, Myra, Norman, Oakner, Pope, Quadra, Rea and Stenberg. The next two letters are reversed, so Uno comes before Treat, while Victor concludes the sequence in Manitoba.\n\n\n\n\n\nThe Grand Trunk Pacific was a widely anticipated and vigorously debated attempt to create a new trans-continental rail line. It was optimistically pursued and for a relatively short time a very influential factor in the development of Western Canada. This vital connection to the rest of the country forever changed life in Rivers and area.\n\n\n\nRivers was just the right distance from Winnipeg to be designated as a divisional point. It would require a large station, a roundhouse and a host of storage, maintenance and house facilities.\n\n\n\n\n\n\n\nRivers Roundhouse and Yards\n\n\n\nThe GTP proved to be controversial for Hays as he was criticized for various decisions, such as choosing Prince Rupert as the Pacific terminus, underestimating Mackenzie and Mann's competing CNR system, and committing the entire Grand Trunk company to the GTP project. Hays's zeal to pursue construction of a well-engineered mainline in lieu of developing a network of branch lines for feeding local traffic proved to be a considerable hurdle as well.\n\n\n\nThe railway, although located in a more northerly latitude than any of the existing transcontinental lines, passes through elevated territory in a lower altitude, considerably lessening the cost of operation, The line crosses the extensive region of the Canadian northwest, which is enormously rich in agricultural and mineral products.\n\n\n\nAs president of the Grand Trunk, Hays committed to competing with the CPR in a number of other areas, namely shipping and hotels. In fact Hays died while returning from a visit to England to Canada where he was scheduled to attend the 26 April 1912, grand opening of the Château Laurier Hotel in Ottawa, Ontario. Hays had chosen to return from England on the maiden voyage of the ocean liner RMS Titanic, which struck an iceberg south of the Grand Banks of Newfoundland the night of 14 April and sank.\n\n\n\nNot long after Hays' death, the Grand Trunk reneged on its agreement to operate the federally owned National Transcontinental system east of Winnipeg, and the Grand Trunk soon faced financial ruin over its decision to build and operate the GTP west of Winnipeg, particularly after the First World War caused traffic on the prairies to decline precipitously.\n\n\n\nDespite some advantages the GTPR had not immediately realized the traffic potential they had predicted. The CPR occupied the more populous southern route in the prairies through Regina, Saskatchewan and Calgary, Alberta to Vancouver, British Columbia and was using land grants provided by the federal government as well as government incentives to draw immigrants and businesses to settle along its route. GTR did not have a coordinated marketing plan, and efforts at further settlement were disrupted by the First World War.\n\n\n\nBy 1919 it was obvious that the GTPR was not paying its way. The financial strain broke on March 7 when GTR defaulted on repayment of construction loans to the federal government, whereby the GTPR was nationalized and taken over by a Board of Management operating under the Department of Railways and Canals while legalities were resolved. On July 12, 1920 the GTPR was placed under the management of Crown corporation Canadian National Railways (CNR) and in 1923 was completely absorbed into the CNR.\n\n\n\nWhile the Grand Trunk Pacific may not have been successful as a National enterprise, locally it was an important stimulus to the economy, a convenience to the citizens, and an influential factor in the lifestyle of the region. The Town of Rivers owes not only its very existence to the railway, but as great deal it character and success came directly down those rails.\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/intercolonial-railway", "page_content": "Background\n\nBeginning in the 1830s, colonial leaders in what would become Canada recognized that they needed railways within and between their colonies to improve communications, grow economically and improve military defense capabilities. The first small railways were built in the 1850s. At the 1864 Confederation conferences in Charlottetown and Québec City, delegates from Nova Scotia and New Brunswick stated that their joining Canada was dependent upon the construction of intercolonial railways. Railway construction began shortly after Canada became a country in 1867 and, by 1876, rail lines linked a number of cities, resources and ports.\n\nIn the 1830s, Canada was made up of hundreds of Indigenous nations and six British colonies: Upper and Lower Canada, Nova Scotia, New Brunswick, Prince Edward Island and Newfoundland. The colonies were isolated from one another. The island colonies (PEI and Newfoundland) were separated by water and the others by thick, vast forests and rivers roiling with untamed rapids. Dirt roads were muddy in spring and dusty in summer, with most routes between towns little more than rough wagon ruts. Travel was easiest in winter, huddled beneath buffalo robes in horse-drawn sleighs. Letters were the only form of communication, and delivery could take weeks between colonies.\n\nTechnology met the need for better transportation and communications in 1825 when, in Britain, George Stephenson unveiled the Rocket. It was the world’s fastest and most powerful steam-powered locomotive, capable of moving freight and people at what was considered an unfathomable speed: 58 km per hour. This was faster than any human had ever travelled because it was faster than a horse could run.\n\nThe new and rapidly advancing train and rail technology excited British North American colonial leaders. The poor and debt-ridden colonies hoped to link their towns and reap the economic benefits of tying mines and sawmills to shipyards and ports. If rail lines could run between the colonies, then all could see greater economic opportunities through increased intercolonial trade. Canadian business people were excited by the possibility of boosting sales of their agricultural and manufacturing products by connecting to maritime markets and Britain through access to the year-round, ice-free ports of St. Andrews, Saint John and Halifax. Only a generation before, the War of 1812 had seen the United States invade the colonies. Railways would make borders more defensible by enabling the quick movement of troops and weaponry.\n\nImpetus for the Intercolonial Railway\n\nAn 1836 delegation to London was favourably received. British army engineer Captain Yule was dispatched to survey a possible rail route. Progress was halted in 1842, when the United States and Britain signed the Webster-Ashburton Treaty. Among its provisions was the establishment of the Maine-New Brunswick border. It left much of Yule’s proposed route on the American side of the new border.\n\nBritish Colonial Secretary William Ewart Gladstone surrendered to the continuing pressure from colonial leaders and sent engineers to undertake a new survey of potential rail routes. They proposed several lines, but warned that each would be expensive, involve many steep hills and numerous bridges. American railway interests proposed ignoring the intercolonial line and instead connect New Brunswick and Nova Scotia to the United States through Portland, Maine. There was a struggle between those wishing to make quick profits with the American line and those wanting to maintain British political and economic connections. By 1860, only two small rail lines had been constructed: one in Nova Scotia that joined Truro and Halifax (opened 1858); and another in New Brunswick, linking Saint John and Shediac (opened 1860).\n\nThe American Civil War began in 1861. While Britain and its North American colonies were officially neutral, the war’s effects spilled over the border. When an American ship stopped, and then took two southern American officials from Trent, a British ship, a British-American war that would begin with an invasion of the British colonies seemed imminent. The need for an intercolonial railway was emphasized when British soldiers arrived in Halifax and Saint John, but there was no way to quickly transport those assigned to the Province of Canada. The soldiers ended up plodding north in a long line of horse-drawn sleds.\n\nThe Trent Affair was peacefully resolved. Nova Scotia Premier Joseph Howe and New Brunswick Premier Samuel Leonard Tilley happened to be in London at the time. In meetings with British officials, they used the crisis and troop movement debacle to stress the need for an intercolonial railway. They also spoke of the need for a rail route to move people and goods between Canada and the Maritime colonies that avoided travelling through or even close to the United States.\n\nThe Trent Affair, and the appeals of the colonial leaders, led to the granting of a British loan guarantee to fund new research regarding possible intercolonial rail lines. In 1863, talented engineer Sandford Fleming began rail survey work in the dense forests of New Brunswick.\n\nConfederation\n\nWhile Fleming worked, it became increasingly clear to colonial leaders that Britain was becoming less willing to continue its economic and military support, and that the United States remained a threat. The economic, political and military situation for all of the colonies was dire, and drastic action was needed. Representatives from the Province of Canada, New Brunswick, Nova Scotia and Prince Edward Island met in Charlottetown in September 1864 for the first Confederation conference (see Charlottetown Conference). The Maritime colonies quickly abandoned their idea of amalgamating themselves into a single colony. Instead, they approved the notion of uniting with Canada to form a new country. The representatives discussed the manner in which the Canadian state would be constitutionally structured, but one of the main topics of conversation was railway construction.\n\nPEI was opposed to the idea of spending money on railways from which it would derive no benefit. Nova Scotia and New Brunswick delegates, on the other hand, declared that the building of intercolonial rail lines was a precondition of their joining Canada. They warned that they could take the still pending American offer or build more lines on their own without joining the Canadian project. Meanwhile, Canadian delegates, especially Montréal’s influential Alexander Galt, spoke passionately about using a railway not only to join the Maritimes to Canada but to extend the new country north and west to the prairies. A few weeks later, in Québec City, delegates finalized their plans for the new country, which included the building of rail lines ( see Québec Conference). Largely because they saw no value in railway expenditures, PEI and Newfoundland, which sent delegates only to the Québec Conference, refused to join Confederation. But the others agreed to unite.\n\nCharting the Intercolonial Railway\n\nWhile the legislatures of Canada, Nova Scotia and New Brunswick were debating and ratifying the Confederation deal, Sandford Fleming issued his report on the best intercolonial rail routes. He proposed three lines, but argued for what he called the Chaleur Bay route. He argued that it would be the most economically viable. It would join the manufacturing centres of Montréal, Kingston and Toronto to maritime towns and ports, pass through New Brunswick lumber and fishing towns, and Nova Scotia coal mining and shipbuilding communities. Plus, it would all be a safe distance from the American border. Colonial leaders were pleased with the proposal, which they approved.\n\nConstruction\n\nCanada became a country on 1 July 1867. Shortly afterwards, Fleming was appointed engineer-in-chief and assigned the task of leading the construction of his proposed railway route. It would be Canada’s first national infrastructure project. By November 1872, the first section was running between Amherst and Truro, Nova Scotia. Two years later, trains were moving along the south shore of the St. Lawrence River between Rivière-du-Loup and Mont-Joli, Québec. In July 1876, Fleming declared the line’s final section, between Mont-Joli and Campbellton, New Brunswick, to be open. This completed the line from Québec, through the rail hub at Moncton, to the Bay of Fundy and then through Truro to Halifax. The 1,100 km line was a technical marvel that used the latest technology and construction methods to keep the rail lines straight and level and with nearly all bridges made not of wood, as was the custom of the day, but the far safer and more durable iron.\n\nWith the completion of the line, Canada’s Department of Railways and Canals assumed responsibility for its operation. Work continued to tie in several branches of lines that had been constructed by the provinces. Soon, southwestern Ontario, Toronto and Ottawa were tied by rail to Montréal and Québec City, and to towns in Nova Scotia and New Brunswick. Communities along the routes thrived due to rail traffic and employment opportunities that grew with it, while those that had been passed by saw progress stall. To stimulate economic growth and interprovincial trade, federal government regulations kept rail freight rates low. In 1919, the old intercolonial railways were incorporated into the Canadian National Railways Company.\n\nSignificance\n\nRailways were as significant in the 19th century as canals were in the 18th century and highways were to the 20th century (see Railway History); they were essential to communications, transportation, defence and commerce. The Intercolonial Railway linked ports, towns and provinces, helped build the country and became an essential expression of Canada’s nationhood."}, {"url": "https://www.123dentist.com/the-history-of-canadas-transcontinental-transportation-network-pt1/", "page_content": "Some may argue that Canada wouldn’t be the nation it is today without its transcontinental railway. Yet some people may not know about the history of this important railway. Learn more about how the railway in Canada was started, the different transcontinental railways that exist, and the history behind each railway. This is part 1 of a 2-part series.\n\nPrimitive Railways\n\nSome of the earliest railways started in England during the early 17th century. At the time, horse-powered carts carried coal and ore from the mines to waterways to ship to other destinations. In Canada, a primitive form of this railway was likely used in the 1720s to carry quarried stone at the Fortress of Louisbourg.\n\nOther early forms of a railway in Canada included an incline railway powered by a steam engine in the 1820s that was used to haul stone during the construction of the Quebec Citadel and a railway used to carry stone from a quarry at Hog’s Back in Ottawa to build the Rideau Canal.\n\nCanadian Pacific Railway\n\nThe Canadian Pacific Railway (CPR) was the first transcontinental railway in Canada. Part of the reason the government was able to entice British Columbia to join the nation was based on the promise of the completion of a transcontinental railway within 10 years. The government signed a contract with CPR in 1880, and in 1881, construction started.\n\nOver the next five years, the railway company laid 4,600 kilometres of single track and helped unite various smaller railway lines across the country. Even though the company faced several logistical difficulties as it was trying to build the railway in the boggy region of northwestern Ontario and the rugged mountains of British Columbia, it was still able to complete the country’s first transcontinental railway six years ahead of schedule.\n\nWhen the railway was completed, the city of Vancouver did not yet exist, and the western terminus of the CPR was Port Moody, BC. The first transcontinental passenger train, pulled by engine No 371, arrived in Port Moody from Montreal on July 4, 1886.\n\nToday, the CPR owns approximately 20,000 kilometres of track that not only stretch across Canada, but also reach into the United States.\n\nCanadian Northern Railway\n\nWhile the CPR was the first transcontinental railway in Canada, this railway wasn’t the only one in Canada. The Canadian Northern Railway (CNoR) was another line that stretched across the country. As more immigrants started to move west in the 1900s and more agriculture needed to be transported throughout the nation, it soon became clear that the CPR couldn’t keep up with demand. At this point, the third phase of railway expansion started.\n\nMany expansion branches began in the western part of Canada, and the CNoR was the most notable of these branches. Entrepreneurs Donald Mann and William Mackenzie owned the CNoR. Although Mann and Mackenzie were sometimes portrayed as greedy promoters, they wanted to build the CNoR to meet the needs of western communities not served by the CPR. They also invested most of their own money to help the railway develop.\n\nThe CNoR was able to grow by absorbing smaller lines and leasing some of its railways. It also built new links to Edmonton, Prince Albert, Saskatoon, and Regina. However, when the last spike of the railway was driven into the ground on Jan. 23, 1915, at Basque, British Columbia, the railway was already facing financial troubles.\n\nIn 1918, the railway was unable to repay its construction costs. Mann and Mackenzie resigned, and the government nationalized the railway. Finally, in 1923, the CNoR was formally consolidated into the Canadian National Railway (CNR). The CNR still operates today as the Canadian National (CN).\n\nGrand Trunk Railway and National Transcontinental Railway\n\nAround the same time that the CNoR was being developed, Wilfrid Laurier, Canadian prime minister from 1896 to 1911, was also encouraging the development of a third transcontinental railway: the Grand Trunk Railway (GTR). The CPR operated close to the Canada and United States border. The Canadian government wanted additional transcontinental lines to operate through the central part of Canada.\n\nThe government proposed this possibility to the CNoR and GTR. Both railways initially declined the project because projected traffic volumes suggested the line wouldn’t be profitable. However, the GTR realized expansion was necessary. The railway tried to merge with the CNoR, but it was unsuccessful. At that point, the GTR negotiated with the government to build the western section of the railway while the government would build the eastern section.\n\nThe official groundbreaking ceremony for the railway occurred on Sept. 11, 1905, at Fort William, Ontario, and the last spike ceremony was held near Fort Fraser, British Columbia, on April 7, 1914. The railway operated as the Grand Trunk Pacific Railway from Winnipeg west to British Columbia and as the National Transcontinental Railway from Winnipeg east to New Brunswick. The railway operated from 1914 to 1919. In 1919, it was nationalized as part of the CNR. Today, the CN still uses the majority of the railways constructed by the GTR.\n\nThe transcontinental railways in Canada were a major part of the nation’s growth and showcased some incredible engineering feats. Thanks to this helpful guide, you now have a better understanding of the interesting history of Canada’s transcontinental railway network.\n\nRead part 2 of this series, focusing on the construction of the Trans-Canada Highway."}, {"url": "https://www.britannica.com/technology/railroad/Canadian-railroads", "page_content": "Canadian railroads\n\nIn its earliest years Canadian railroading was influenced by British rail practice, but after a decade of experience with North American economic and geographic realities, American practice began a fairly rapid rise to dominance that has remained to the present. The first transborder line was completed between Portland, Maine, and Montreal in 1852; it was known as the Atlantic and St. Lawrence Railroad in the three northern New England states and the St. Lawrence and Atlantic in Quebec. At the behest of the Maine promoters of this line, a gauge of 5 feet 6 inches (1,676 mm) was adopted to exclude Boston and its standard-gauge railroads from participation. Once the railroad opened, the international company was sold to and extended by a British company, the Grand Trunk Railway, which ultimately constructed a line from Rivière-du-Loup on the St. Lawrence estuary below Quebec city to Sarnia on the St. Clair River at the Ontario-Michigan frontier. The Grand Trunk infrastructure was much more costly than that found on any other rail line in North America following British practice but was laid out on the Maine gauge of 5 feet 6 inches, which became the first widely adopted Canadian gauge. Only later when the rail crossings of the international boundary became numerous and the generally unsatisfactory example of the Grand Trunk was fully understood were the broad Canadian lines narrowed to the standard gauge.\n\nThe Canadian Shield posed a serious obstacle to transcontinental planning. British Columbia, then a British crown colony, was concerned about the impact of an influx of gold prospectors from the United States, and it sought to join the Canadian confederation. In 1871 Prime Minister John A. Macdonald offered British Columbia a railroad connection with the Canadian network within 10 years. An agreement was reached with little knowledge of where and how such a rail line could be built. A Canadian Pacific Railway survey was begun under the direction of Sandford Fleming, former chief engineer of the Intercolonial Railway in the Maritime Provinces. There was some question as to the best route across the Canadian Shield from Callender in eastern Ontario (then the head of steel production in eastern Canada) to the edge of the prairies in eastern Manitoba, but simplicity of construction favoured the northern shore of Lake Superior. In the prairies the choice seemed to rest on which pass through the Rockies would be used. Fleming strongly favoured Yellowhead Pass near present-day Jasper, but the rail builders chose instead Kicking Horse Pass west of Calgary because it would place the railroad much closer to the 49th parallel, thus shielding business in western Canada from competition with American railroads. The final question to be resolved by the Fleming Survey was the route to be employed across the Coast Ranges of British Columbia. Five routes ranging between the Fraser River valley in the south and the Skeena River near the 54th parallel in the north were considered, but the Fraser gorge route to the mouth of that river was selected. By 1885, when the Canadian Pacific Railway was completed by a joining of tracks at Craigellachie in British Columbia, Burrard Inlet, north of the Fraser mouth, was selected as a new port and was named for George Vancouver, the British naval captain who conducted the most detailed survey of this coast.\n\nThe Canadian Pacific Railway tied the recently formed dominion together but operated on such a thin market that its charges were high and its network of lines limited. In Manitoba at the turn of the 20th century wheat farmers sought more rail lines, and the province encouraged ramification of the lines with land grants. By the end of the first decade of the century one granger road, the Canadian Northern Railway, promoted a line from Montreal to Winnipeg and then, along with its network of prairie railroads, a second rail route to the Pacific coast, using Yellowhead Pass. This second transcontinental line was finished during World War I, though wartime inflation led to bankruptcy for its promoters.\n\nIn the first decade of the 20th century a third transcontinental line was advanced rapidly through a large government subsidy. A proposal was made to construct a rail line from Moncton, New Brunswick, near the ports of Halifax and Saint John, passing through mainly timbered land to the south bank of the St. Lawrence River at Levis opposite Quebec city. From there, the National Transcontinental Railway crossed the Canadian Shield to Winnipeg. There the project was joined to a line of the Grand Trunk. The Grand Trunk Pacific Railway beginning at Winnipeg passed through the fertile belt of the prairies to Edmonton, continuing thence to Yellowhead Pass and across central British Columbia to a totally new port on Kaien Island in Canada just south of the Alaska Panhandle, which was named Prince Rupert. Unfortunately the addition of two new transcontinentals within little more than a year in a time of great inflation placed both concerns in bankruptcy and led to their reversion to public ownership as the Canadian National Railways in 1918.\n\nSince then, there have been further demands for rail lines in Canada, mostly to gain access to heavy raw materials. Manitoba shaped a new port at Churchill on Hudson Bay at the end of the 1920s. Lines from the north shore of the Gulf of St. Lawrence were pushed into Labrador to reach iron deposits in the 1950s. Access to lead-zinc deposits near Great Slave Lake brought a “railway to resources” at Hay River in the Northwest Territory. British Columbia took over an initially private company, the Pacific Great Eastern Railway, and shaped it into the British Columbia Railway. Even Canadian Pacific has reflected this increasing focus on resource flows. In 1989 it opened the Mount MacDonald Tunnel, the longest tunnel in the Western Hemisphere at just over 14.5 km (9 miles); it runs under Rogers Pass in the Selkirk Range of British Columbia. This reflects the turnabout in rail flows in Canada, where transpacific shipping has overtaken transatlantic routes. The steep grades in Rogers Pass required huge horsepower in helper (pusher) engines. By tunneling beneath Mount Macdonald, the transit of the Selkirks was flattened to just under 1 percent.\n\nDespite the fact that Canada’s railways have served for 150 years as Canada’s spine, linking the scattered former British colonies into a single transcontinental country, the system faces challenges in the 21st century. The most important concern is rail-passenger service, which fell off dramatically in the decades after World War II owing to competition from airplanes and automobiles. Much of the rolling stock became outdated, leading to inefficient and costly service. In 1978 the Canadian government established VIA Rail Canada, Inc., as a crown corporation independent of the CN and CP to assume full responsibility for managing all the country’s rail-passenger services (except for commuter lines and some small local lines). VIA was formed in the hope that it would permit an economy of scale not possible when the CN and CP railroads ran independent passenger services, thereby reducing the subsidies needed to support Canada’s rail-passenger system. Unfortunately, the new company acquired ownership of all CN and CP passenger locomotives but did not purchase any track; instead, it compensates the railroads for the cost of operating VIA trains over their tracks. This has only aggravated a perennial problem of arriving at a government subsidy sufficient to meet the service’s operating budget and also to fund fleet modernization, track improvements, and other capital developments.\n\nIf the future of rail transportation in central Canada is uncertain, Canada’s north has seen an interesting transition as railways originally built to open the frontier have turned to providing spectacularly scenic journeys for vacationers. In the west, successors to the original transcontinental routes—the Rocky Mountaineer through Banff and the Canadian through Jasper—wind among the majestic Rocky Mountains. From Winnipeg a railway passes through rugged lake and forest country to reach the ocean port of Churchill on Hudson Bay. Ontario’s two northern lines are the Algoma Central, which runs from Sault Ste. Marie through the Agawa Canyon, resplendent with hardwoods in the fall, and the Northland, which cuts through the mineral-rich Canadian Shield to Moosonee, close to an old fur-trading post on James Bay. In Quebec the line running north from the Gulf of St. Lawrence to the iron-ore deposits of Ungava and Labrador is used to take canoeists, fishermen, and hunters into the last great wilderness region of eastern North America."}], "The Grand Trunk Pacific Railway (GTPR) was constructed from Winnipeg to Prince Rupert, British Columbia.": [{"url": "https://www.spiralroad.com/grand-trunk-pacific/", "page_content": "The Grand Trunk Pacific Railway (reporting mark GTP) was a historic Canadian transcontinental railway running from Fort William, Ontario (now Thunder Bay) to Prince Rupert, British Columbia, a Pacific coast port. East of Winnipeg the line continued as the National Transcontinental Railway (NTR), running across northern Ontario and Quebec, crossing the St. Lawrence River at Quebec City and ending at Moncton, New Brunswick. The Grand Trunk Railway (GTR) managed and operated the entire line.\n\nLargely constructed 1907–14, the GTPR operated 1914–19, prior to nationalization as the Canadian National Railway (CNR). Despite poor decision-making by the various levels of government and the railway management, the GTPR established local employment opportunities, a telegraph service, and freight, passenger and mail transportation.[1]\n\nThe CNoR tracklaying through the Canadian Rockies in 1913 roughly paralleled the GTPR line of 1911 and created about 100 miles of duplication. In 1917, a contingent from the Corps of Canadian Railway Troops added several crossovers to amalgamate the tracks into a single line along the preferred grade as far west as Red Pass Junction, which is misidentified as 36 miles west of Red Pass on Google Maps. The surplus rails were lifted and the heavier grade GTPR ones shipped to France for use during World War I.\n\nIn 1915, unable to meet its debts, the GTP asked the federal government to take over the GTPR.[46] The CNoR was in worse financial shape.[53][54] The royal commission that considered the issue in 1916 released its findings in 1917.[55] In March 1919, after the GTPR has defaulted on construction loans to the federal government, the federal Department of Railways and Canals effectively took control of the GTPR[56] before it was merged into the CNR in July 1920. Noting numerous construction blunders, the 1921 arbitration on worth also ranked its significance within the naïve railway schemes of that era by this observation: “It would be difficult to imagine a more misconceived project.”[57] The GTP itself was nationalized in 1922.[58]\n\nGrand Trunk Pacific Railway stations between Jasper and Longworth\n\nGainer:\n\nIt has already been described how the importance of the Jasper area as a transcontinental route deteriorated after the decision was made to build the Canadian Pacific Railway through another pass further south. But during the last few years of the nineteenth century, once the Canadian Pacific Railway was constructed, certain businessmen and politicians became convinced of the need for an alternative trans- continental railway line, following a more northerly route across the prairies. The advantages to railroads of the Yellowhead over the other passes through the Rockies were well known, and just after the turn of the century the Grank Trunk Pacific project was begun. However, it was to be another decade before steel reached the new national park which had been established along the right-of-way.\n\nThe National Transcontinental Railway Act became law near the end of 1903, representing an agreement between the Ministry of Railways and Canals and the newly incorporated Grand Trunk Pacific Railway Company for the construction of a railway from Moncton, New Brunswick, to the Pacific Coast. The early plans for the western line, developed in 1902, were to follow the route from Edmonton to the coast through the Yellowhead Pass, along the original Sandford Fleming survey."}, {"url": "https://www.canada.ca/en/parks-canada/news/2016/02/melville-railway-station-melville-saskatchewan.html", "page_content": "Backgrounder\n\nThe Melville Railway Station, built in Melville, Saskatchewan in 1908, was a major station on the Grand Trunk Pacific Railway (GTPR) line. The expansion of the railway into the West at the beginning of the 20th century allowed an agricultural economy to flourish. It brought immigrants to newly surveyed regions where they settled on homesteads, broke the land and grew grain, which the railways in turn transported east. Thus, the GTPR and its stations played a key role in the settlement and development of western Canada.\n\nMelville and its station were named after Charles Melville Hays, the president of the GTPR. The station was constructed during a peak period of railway expansion that lasted from the early 1900s to 1914, when the Canadian Pacific Railway’s (CPR) monopoly in the West was being challenged by the creation of two new rail companies: the Canadian Northern (CNR) and the Grand Trunk Pacific (GTPR). The main line of the GTPR ran from Winnipeg through Melville and Edmonton to Prince Rupert, British Columbia, and was completed in 1914. Melville also served as an important junction point on the line connecting to Regina and the United States border to the south, and to Churchill, Manitoba, to the north.\n\nThe selection of Melville as a major divisional point on the GTPR’s transcontinental main line gave impetus and shape to the town’s early development and has contributed to its ongoing prosperity. Typical of many prairie towns purchased and laid out by the GTPR, Melville extends north from the railway tracks which form a distinct boundary at its southern edge. Situated at the head of Main Street, just south of First Avenue, the railway station was and remains the focal point of Melville. The station, a rectangular two-storey wooden structure, housed offices for the superintendent, divisional engineer and other railway officials, and communicated the importance of Melville in the expansion of the GTPR in the prairies. The station has twin half-timbered gables on both the town and track side elevations and stucco exterior surfaces. On the track side, there once was a shingled canopy, supported by wooden brackets which overhung the wooden platform. Living quarters were constructed nearby, as were a section house, roundhouse, stockyard, freight house and other railway facilities.\n\nThe GTPR relied heavily on a fairly small number of standardized station plans. In the case of Melville, the company chose a large “special” design for the station, reflecting Melville’s status as a divisional point on the railway’s main line through the West and illustrating the quality of the Grand Trunk Railway’s building program. GTPR stations in Rivers, Manitoba, Edson, Alberta, Sioux Lookout, Ontario and Redditt, Ontario, while all built after the Melville Station, are similar in design and are all examples of the rare GTPR, custom-designed, “special stations”.\n\nToday, Melville is a small city (population of about 4,600). It is located in the east-central portion of Saskatchewan, 144 kilometres northeast of the provincial capital of Regina and 43 kilometres southwest of Yorkton. The GTPR, now the Canadian National Railway, continues to be a major employer in Melville, which has remained on the railway’s main line and is still served by Via Rail’s The Canadian three times per week. The Melville Railway Station is owned by The Melville Rail Station Heritage Association Inc. which leases the land on which it sits. Many of the major components of the original setting, including the yards and functionally-related railway buildings – notably a small VIA passenger station to the east and an administrative building to the west – have been retained.\n\n- 30 -\n\n\n\nTitle of the Image: Melville Railway Station\n\nSource of the Image: Univ. of Saskatchewan Archives, Keith Ewart Photograph Collection, ca. 1910-19, In the Public Domain.\n\nFrom: http://www.canada-rail.com/saskatchewan/m/melville.html"}, {"url": "https://padwrr.com/grand-trunk-pacific-railway/", "page_content": "The parent company of the GTP was the Grand Trunk Railway (GT), which was one of the earliest railway companies in Canada. It was incorporated in 1852.\n\nGrand Trunk operated mainly in Ontario and Quebec, as well as some northeast and Midwest US states. Around the turn of the century, the company decided to expand into the western Canadian provinces to increase its profitability. It formed a partnership with the Canadian Government, whereby the government would build the eastern section of a transcontinental railway, from Winnipeg to Moncton, NB under the name National Transcontinental Railway (NTR). Grand Trunk would build the western section to Prince Rupert, BC as the Grand Trunk Pacific Railway (GTPR/GTP).\n\nThe one exception to this arrangement was the branch from NTR at Graham/Superior Junction (now Sioux Lookout, ON) to Fort William, ON. Construction on this 200-mile line, which would give Grand Trunk access to Lake Superior, began in 1905. It was completed in 1908 and became known as the GTPR-Lake Superior Branch (it also referred to as the Fort William Branch). During World War I, issues arose over the operation of the NTR, and in 1915 it and several others were consolidated into newly formed Canadian Government Railways (CGR). On July 1, 1915, the line was leased from Grand Trunk Pacific and became the CGR-Fort William Branch with two subdivisions; Fort William (Fort William to Raith 60.76 miles) and Raith (Raith to Superior Junction 131.33 miles). Numerous improvements were undertaken during these years, including the construction of concrete culverts and bridges, as well as the filling in of wood trestles with gravel, taken primarily from the Dona Pit (near Dona Station on the west bank of the Kaministiquia/Dog River).\n\nIn 1918, the CGR took over the Canadian Northern Railway (CNoR) and became the Canadian National Railways (CNR), an arrangement which was finalized in 1923. The line initially was known as the CNR-Lake Superior Subdivision, but became the CNR-Graham Subdivision circa 1923. In 1924-1925 it was split into 3 subdivisions; the Crest Subdivision ran from the junction with the Kashabowie Subdivision (MP 5) to the junction with the Raith Subdivision on the north bank of the Matawin River (MP 0.3), the Raith Subdivision ran from Conmee Junction to Graham, while the Quorn Subdivision continued from there to Sioux Lookout.\n\nThis unusual arrangement was the part of the nationalization process, whereby the 26 miles of the Crest Subdivision west from Fort William would soon be abandoned, which was a result of a duplication of lines with the former Canadian Northern Railway. To facilitate this arrangement, a new bridge was constructed across the Matawin River north of the Kashabowie Subdivison, which became Milepost 0 of the Raith Subdivision. The remaining two subdivisions were eventually remerged into the Graham Subdivision before 1933 which was abandoned in 1994.\n\nThe stations and some of the notable locations on the line are listed below (mileage shown is per the original line):\n\n*Abandoned 1925 **Relocated ***Added 1924 ****Renamed\n\nFor more information and photos, please read the following great article:\n\nThe Grand Trunk Pacific’s Lake Superior Branch by John Todd (Canadian Rail Magazine, September 1976)\n\nLink to 1929 & 1925 maps. Link to some of the timecards.\n\nMaps\n\nTimetables\n\nThere are numerous videos of the remains of the GTP in the YouTube playlist below."}, {"url": "https://www.liquisearch.com/grand_trunk_railway/bankruptcy_and_nationalization", "page_content": "Bankruptcy and Nationalization\n\nAs the dominant railway in British North America, GTR was reportedly asked by the federal government soon after Confederation to consider building a rail line to the Pacific coast at British Columbia but refused, forcing the government to enact legislation creating the Canadian Pacific Railway (CPR) to meet British Columbia's conditions for joining Confederation. By the early 20th century, GTR desired to operate in Western Canada, particularly given the virtual monopoly of service that CPR maintained and the lucrative increasing flows of immigrants west of Ontario. The federal government encouraged GTR to co-operate with a local railway company operating on the Prairies, the Canadian Northern Railway (CNoR), but an agreement was never reached.\n\nCNoR decided to build its own transcontinental system at this time, forcing GTR in 1903 to enter into an agreement with Wilfrid Laurier's government to build a third railway system from the Atlantic to the Pacific. GTR would build (with federal assistance) and operate the Grand Trunk Pacific Railway (GTPR) from Winnipeg, Manitoba to Prince Rupert, British Columbia, while the government would build and own the National Transcontinental Railway (NTR) from Winnipeg to Moncton, New Brunswick via Quebec City, which the GTR would also operate.\n\nAs part of this program, the federal government encouraged the GTR to purchase the Canada Atlantic Railway (CAR) with lines southeast from Ottawa to Vermont, and west from Ottawa to Georgian Bay. The GTR took effective control of the CAR in 1905, although the purchase was not ratified by Parliament until 1914.\n\nThe routing of these systems was extremely speculative, as GTPR's main line was located farther north than the profitable CPR main line in the Prairies, and NTR was located even farther north of populous centres in Ontario and Quebec. Construction costs on the GTPR escalated, despite having the most favourable crossing of the Continental Divide in North America at Yellowhead Pass. GTR's cost-conscious president Charles Melville Hays was one of the victims on board RMS Titanic on April 15, 1912. His death is speculated to have contributed to poor management of GTR over the ensuing decade, and also contributed to the abandonment of the uncompleted Southern New England Railway to Providence, Rhode Island, begun in 1910.\n\nConstruction started on the GTPR/NTR in 1905, and the GTPR opened to traffic in 1914, followed by the NTR in 1915. It was a transcontinental system, with the only exception being the NTR's ill-fated Quebec Bridge, which would not be completed for several more years.\n\nThe first indication the arrangement with the government was faltering came when GTR refused to operate the NTR, citing economic reasons. With the enormous cost of building the GTPR and the limited financial returns being realized, GTR defaulted on loan payments to the federal government in 1919. GTPR was nationalized on March 7 of that year, being operated under a federal government Board of Management until finally being placed under the control of the Crown corporation Canadian National Railways (CNR) on July 20, 1920.\n\nGTR underwent serious financial difficulties as a result of the GTPR, and its shareholders, primarily in the United Kingdom, were determined to prevent the company from being nationalized as well. Eventually on July 12, 1920, GTR was placed under control of another federal government Board of Management while legal battles continued for several more years. Finally, on January 20, 1923, GTR was fully absorbed into the CNR on a date when all constituent companies were merged into the Crown corporation.\n\nAt the time that the GTR was fully merged into CNR, approximately 125 smaller railway companies comprised the Grand Trunk system, totaling 12,800 kilometres (8,000 mi) in Canada and 1,873 kilometres (1,164 mi) in the United States."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/prince-rupert", "page_content": "Settlement and Development\n\nKaien Island was once a meeting place of the Tsimshian and Haida peoples. Prince Rupert (named for the first Hudson's Bay Company governor) was envisioned in the early 1900s as the western end of the Grand Trunk Pacific Railway (GTPR). Some hoped the town would rival Vancouver as Canada's outlet along the Pacific coast, but the hoped-for boom never materialized. The fishing industry became important to the city's economy after the First World War. During the Second World War, the port became a shipbuilding centre and was used by the American army as a transportation base for soldiers and materials to Alaska, the Pacific Islands and the East Asia. After the war the economy received a boost with the development of a pulp mill on Watson Island.\n\nThe port of Prince Rupert (1912) was designated a national port in 1972. Fairview, a general cargo and forest products terminal, was completed in 1977. Twenty years later, in 1997, the Prince Rupert Port Authority was established as the port’s governing body. In the early 1980s, new interest in the coalfields of northeastern British Columbia affected the city. Ridley Terminals, a coal shipment facility, opened on nearby Ridley Island in 1984. In 2019, the Ridley Island Export Terminal began to ship propane to Asia.\n\nEconomy\n\nThe Pacific Rim countries are the destination for the majority of the exports through Prince Rupert. Although the city suffered in the 1990s with the closure of the coal mines of northeastern British Columbia and of its pulp mill in 2001, trade with China and other Asian countries has since rebounded. Prince Rupert is the most important fish-landing port on the northwest coast and the terminus of the BC and Alaska ferry systems. Tourism is growing rapidly with the expansion of cruise ship traffic, and locally in terms of sportfishing.\n\nCultural Life\n\nKwinitsa Railway Station Museum, in one of the last remaining stations of the Grand Trunk Pacific Railway (built circa 1912), depicts Prince Rupert's development. The Museum of Northern British Columbia, in the award-winning Chatham Village Longhouse, provides insight into First Nations culture and history. The Lester Centre of the Arts is the city's performing arts venue. The Prince Rupert Daily News was published for 100 years, from 1910 to 2010. Prince Rupert is home to two post-secondary campuses: Coast Mountain College and University of Northern British Columbia."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/british-columbia-railway", "page_content": "British Columbia Railway\n\nThe British Columbia Railway was incorporated as the Pacific Great Eastern Railway in 1912 to build a line from North Vancouver to Prince George, where it was to link up with the Grand Trunk Pacific Railway. Initially it was privately owned, but financial difficulties developed quickly and in 1918, after only 283 km of track from the coastal port of Squamish to the head of the inland river transport at Quesnel had been built, the Pacific Great Eastern was taken over by the BC government.\n\nThe remaining track from North Vancouver to Squamish and from Quesnel to Prince George was not completed until 1956. Two major northern extensions and several branch lines were built after that date. A northeastern extension through the Peace River country reached Fort Nelson in 1971. A proposed northwestern extension to Dease Lake has been abandoned.\n\nSignificant portions of the line have been electrified to expedite the carriage of coal. The British Columbia Railway serves the resource industries of the northern interior of the province, operating over 2300 km of track, which were built at a cost of more than a billion dollars in public funds."}, {"url": "https://www.canada.ca/en/parks-canada/news/2018/09/melville-railway-station-melville-saskatchewan.html", "page_content": "The Grand Trunk Pacific Railway (GTPR) built the Melville Railway Station in 1908, during a period of expansion and competition among railway companies. Named after GTPR president Charles Melville Hays, this station was a major divisional point on the GTPR’s transcontinental line and for it, the company chose a large, “special” design. The railway and this station laid the foundations for the city, shaped its early development, and helped the prairie agricultural economy to flourish by facilitating the transport of people and grain.\n\nFrom 1900 to 1914, railways in western Canada expanded rapidly, with two new rail companies (Canadian Northern Railway Company and GTPR) challenging the Canadian Pacific Railway’s monopoly in the west. The GTPR main line, completed in 1914, ran from Winnipeg through Melville and Edmonton to Prince Rupert, British Columbia. Melville was an important junction point on the line, connecting in the south to Regina and the United States border, and in the north to Churchill, Manitoba.\n\nThe GTPR purchased and laid out the Melville townsite. Typical of many GTPR-designed prairie towns, Melville extended north from the railway tracks, which formed a distinct boundary at its southern edge. When building stations, the GTPR typically relied on a small number of standardized station plans. For Melville, a major station on the line, the company chose a more distinctive design: a rectangular two-storey wooden structure, featuring twin gables, a high hipped roof, and dormers. It housed offices for the superintendent, divisional engineer, and other railway officials. The building’s design, unique in Saskatchewan and the only one of its kind in Canada, illustrates the quality of the GTPR’s building program along its main line. Living quarters were constructed nearby, as were a section house, roundhouse, stockyard, freight house, and other railway facilities. Many of these components of the original setting remain today.\n\nToday, the GTPR’s transcontinental line is part of the Canadian National Railway (CNR) system, and the railway continues to be a major employer in the City of Melville. The historic railway station, which remains a focal point in the city, is owned by the Melville Rail Station Heritage Association Inc., and is located at the heart of the community.\n\n- 30 -"}, {"url": "https://www.academickids.com/encyclopedia/index.php/Grand_Trunk_Pacific_Railway", "page_content": "From Academic Kids\n\nTemplate:Infobox Railroad\n\nThe Grand Trunk Pacific Railway (GTPR) was a historical Canadian railway.\n\nA wholly-owned subsidiary of the Grand Trunk Railway (GTR), the GTPR was constructed by GTR using loans provided by the Government of Canada. The company was formed in 1903 with a mandate to build west from Winnipeg, Manitoba to the Pacific coast at Prince Rupert, British Columbia. East of Winnipeg, the federal government would build the National Transcontinental Railway (NTR) across Northern Ontario and Quebec, crossing the St. Lawrence River at Quebec City and ending at Moncton, New Brunswick. The conceptual plan was to have GTR operate both GTPR and NTR as a single transcontinental railway, competing with the Canadian Northern Railway (CNoR) and Canadian Pacific Railway (CPR).\n\nConstruction began on the Canadian Prairies in 1905, the year that the provinces of Alberta and Saskatchewan were established. Construction proceeded west to Saskatoon, Saskatchewan in 1907, Edmonton, Alberta in 1909, and through Jasper, Alberta into Yellowhead Pass crossing the Continental Divide in 1910-1911. The last spike ceremony heralding completion of the rail line across the prairies, and through the Rocky Mountains to the newly constructed seaport at Prince Rupert, British Columbia was held one mile east of Fort Fraser, British Columbia on April 7, 1914.\n\nMissing image\n\nGrandTrunkLastSpike.jpg The Last Spike: Fort Fraser, BC, 1914\n\nThe GTPR did not immediately realize the traffic potential GTR and the federal government had hoped. CPR occupied the more populous southern route in the prairies through Regina, Saskatchewan and Calgary, Alberta to Vancouver, British Columbia and was using land grants provided by the federal government as well as government incentives to draw immigrants and businesses to settle along its route. GTR did not have a coordinated marketing plan, and efforts at settlement were disrupted by the First World War. GTR rejected operating the NTR for cost reasons, forcing the federal government to assume that operation into Canadian Government Railways.\n\nBy 1919 it was obvious that the GTPR was not paying its way. The financial strain broke on March 7 when GTR defaulted on repayment of construction loans to the federal government, whereby the GTPR was nationalized and taken over by a Board of Management operating under the Department of Railways and Canals while legalities were resolved. On July 12, 1920 the GTPR was placed under the management of Crown corporation Canadian National Railways (CNR) and in 1923 was completely absorbed into the CNR.\n\nToday, the majority of the GTPR is still in use as CN's (name change to Canadian National or acronym CN in 1960) main line from Winnipeg to Jasper. West of Jasper, CN's main line swings south on the former Canadian Northern Railway (CNoR) to Vancouver, however the GTPR line to Prince Rupert forms an important CN secondary main line. The GTPR's high construction standards and the fact Yellowhead Pass has the lowest elevation of any railway crossing of the Continental Divide in North America gives the CN a competitive advantage in terms of fuel efficiency and the ability to haul tonnage.\n\nPrince Rupert is the primary marine-railway connection for the Alaska Railroad, and despite having languished as a poor cousin to the Port of Vancouver, there are many opportunities for this port city as a result of the GTPR's foresight a century ago."}, {"url": "https://theroadhome.ca/2014/01/30/this-week-in-history-1914-first-train-arrives-in-prince-george/", "page_content": "The first train arrived in Prince George on January 30, 1914, three days after construction teams laid the track of the Grand Trunk Pacific Railway west across the Fraser River and into town.\n\nThe Grand Trunk Pacific Railway was a government-subsidized venture, eventually connecting Winnipeg to Prince Rupert via Edmonton and the Yellowhead Pass. Construction began in the fall of 1905, but the “steel” did not reach the eastern border of British Columbia until 1912. By the end of 1913, the tracks had hit the eastern bank of the Fraser River, and residents of the newly incorporated town of Prince George waited with bated breath as delays hampered construction of a permanent rail bridge over the Fraser. Eventually a temporary bridge was erected on pilings set beside the permanent foundations. Writes Rev. F.E. Runnalls in A History of Prince George:\n\nAt last the track was laid over this temporary bridge, and on January 27th, 1914, the track-layer “Pioneer” with her train of cars moved over the bridge to terra firma and proceeded to swing the rails into position ahead of her, there to be connected and spiked so she could move forward. The steel had arrived and this day would long be remembered as a red-letter day in the history of Prince George. In spite of the bitter cold — eight below zero at two o’clock — more than 1,500 people turned out to witness the event.1\n\nLocal pioneers, dignitaries, and a ten-piece brass band huddled around a bonfire were also on hand to welcome the track-setting team. Mr. Harry G. Perry, president of the Fort George Board of Trade, summed up the local sentiment as follows:\n\nJudging by the large and enthusiastic crowd gathering here, I think we are all unanimous in the possession of a feeling of pride and satisfaction in seeing the steel right at our doors today. It means that this day marks the greatest epoch in the new history of Central British Columbia. It means the opening up of great possibilities in the development of the resources of this district.2\n\nIronically, that very night, ice jams and flooding on the Nechako and Fraser Rivers washed away five of the pilings supporting the temporary bridge and damaged another 25.3\n\nBut repairs were performed quickly. Three days later, on January 30, the first westbound train arrived in town from McBride — not a Grand Trunk Pacific train, but one operated by the railway construction company Foley, Welch and Stewart, which provided passenger and cargo service on sections of the line as construction moved westward. The first eastbound train, also run by Foley, Welch and Stewart, chugged out of town on February 3.\n\nOn April 7, 1914, railway officials drove the last spike in the Grand Trunk Pacific line into the steel just east of Fort Fraser. Regular, cross-country Grand Trunk rail service began that summer. Nine years later, in 1923, the Grand Trunk Pacific was absorbed into the newly formed Canadian National Railway.\n\nNotes:\n\n1. Rev. F.E. Runnells, A History of Prince George, 1946.\n\n2. “Towns turn out en masse to greet arrival of steel,” The Fort George Herald, 28 January 1914 (Vol. 4, No. 22), page 1.\n\n3. “Temporary bridge across Fraser is swept away,” The Fort George Herald, 28 January 1914 (Vol. 4, No. 22), page 1."}, {"url": "https://wiki2.org/en/Grand_Trunk_Pacific_Railway", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nThe Grand Trunk Pacific Railway (reporting mark GTP) was a historic Canadian transcontinental railway running from Fort William, Ontario (now Thunder Bay) to Prince Rupert, British Columbia, a Pacific coast port. East of Winnipeg the line continued as the National Transcontinental Railway (NTR), running across northern Ontario and Quebec, crossing the St. Lawrence River at Quebec City and ending at Moncton, New Brunswick. The Grand Trunk Railway (GTR) managed and operated the entire line.\n\nLargely constructed 1907–14, the GTPR operated 1914–19, prior to nationalization as the Canadian National Railway (CNR). Despite poor decision-making by the various levels of government and the railway management, the GTPR established local employment opportunities, a telegraph service, and freight, passenger and mail transportation.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 1 586 1 803 1 023\n\nThe Grand Trunk Pacific and the Boom Town of Tete Jaune\n\nGrand Trunk's Kingston Station.wmv\n\nGrand Trunk's Ernestown Station.wmv Transcription\n\nProposal\n\nMap of the GTP in BC and proposed feeder lines\n\nAfter the ouster of Edward Watkin, the GTR declined in 1870 and 1880 to build Canada's first transcontinental railway. Subsequently, the Canadian Pacific Railway (CPR) transcontinental and its feeder routes operated closer to the Canada–US border. Seeking a transcontinental to open up the central latitudes, the Canadian government made overtures to the GTR and to the Canadian Northern Railway (CNoR). The regional operators in Eastern and Central Canada initially declined because projected traffic volumes suggested an unlikely profitability. Realizing that expansion was essential, the GTR attempted to acquire the CNoR, rather than to collaborate on construction. The GTR finally negotiated to construct only the western section, and the federal government would build the eastern sections as the NTR. The respective legislation passed in 1903.\n\nNearer to Asia than Vancouver, Port Simpson was about 19 miles (30.6 km) southeast of the southern entrance to the Portland Canal, which forms part of the boundary between British Columbia and Alaska. In 1903, when friction arose in Canada over the Alaska boundary decision favouring US interests, US President Theodore Roosevelt threatened to send an occupation force to nearby territory. In response, Canadian Prime Minister Wilfrid Laurier preferred a more southerly location for the terminal, which became the more easily-defendable Kaien Island (Prince Rupert).[9]\n\nConstruction\n\nOverview\n\nThe Last Spike: Fort Fraser, BC, 1914\n\nDuring the official ceremony on September 11, 1905 at Fort William, Ontario, Laurier turned the first sod for the construction of the GTPR, but the actual first sod had occurred the previous month about 12 miles (19.3 km) south of Carberry, Manitoba. From Fort William, the GTPR built a 190-mile (310 km) section of track connecting with the NTR near Sioux Lookout. The route paralleled the CPR for 135 miles (217 km) west of Winnipeg before it veered northwest. That year, the provinces of Alberta and Saskatchewan were established. The line proceeded west to Saskatoon in 1907, Edmonton in 1909, and Wolf Creek in 1910. For contractual purposes, Winnipeg to Wolf Creek (Edson, Alberta) was the Prairie Section, and Wolf Creek to the Pacific was the Mountain Section. Foley, Welch and Stewart (FW&S) was selected as the prime contractor for the latter.\n\nThe GTPR followed the original Sandford Fleming \"Canadian Pacific Survey\" route from Jasper, Alberta through the Yellowhead Pass, and the track-laying machine crossed the BC/Alberta border in November 1911.[15] In the mountain region, costs escalated to $105,000 per mile, compared with the budgeted $60,000. Following the CNoR paralleling through the Rockies, which created 108.4 miles (174.5 km) of duplication, the GTPR rail bed largely became redundant.[18] The more northerly Pine Pass option, as specified in its charter, may have been a better choice in terms of developing traffic and in improving the current CNR network (especially if the later Pacific Great Eastern Railway route had opted for the Monkman Pass crossing). To secure concessions from the BC government, eastward construction from the Pacific Coast began in 1907. The track east of Prince Rupert reached 50 miles,[20] then 102 miles by 1910,[21] the Bulkley Valley in 1912 and Burns Lake in 1913. The line completed across the prairies, through the Rockies, and to the newly-constructed seaport at Prince Rupert. The last spike ceremony occurred one mile east of Fort Fraser, British Columbia at Stuart (Finmoore) on April 7, 1914. A 1910 prediction had correctly claimed if a line were built from Tête Jaune Cache to Vancouver, it would effectively kill Prince Rupert and relegate its route to branch line status.[25]\n\nConstruction crews\n\nClaiming labour shortages, the GTP attempted to obtain government approval to bring in unskilled immigrants from Asia.[26] By late 1912, 6,000 men had become employed east of Edmonton.[27] Although contractors prohibited liquor in camps, bootlegging was rampant. FW&S provided hospitals and medical services by charging employees one dollar per month. The articles for the Grand Canyon of the Fraser, Dome Creek, McGregor, Upper Fraser, and the BC communities within the Category:Grand Trunk Pacific Railway stations, outline construction through those specific localities.\n\nFlat-bottomed sternwheelers\n\nFW&S operated five steamboats to supply their camps advancing east from Prince Rupert on the Skeena River. Launched in 1908, the Distributor and Skeena remained until 1914, as did the Omineca, which was purchased in 1908. Launched in 1909, the Operator and Conveyor were disassembled in 1911, transported to Tête Jaune and relaunched in 1912 on the Fraser River.[30] Detailed articles cover the sternwheelers Skeena, Operator, and Conveyor and their roles on the Skeena River, and on the Fraser River.\n\nFraser River scows\n\nDuring the construction phase from Tête Jaune to Fort George thousands of tons of freight for railway construction and merchants travelled downstream from the railhead by scow.[33] In 1913, when scowing on that part of the river peaked, about 1,500 men were employed as scowmen, or \"River Hogs,\" as they were generally called. In high water, the trip from Tête Jaune took five days and in low water up to 12 days because of the shallow bars. Each vessel measured about 40 feet long and 12–16 feet wide and carried 20–30 tons. Two men crewed each end. The Goat River Rapids, Grand Canyon, and Giscome Rapids, were extremely dangerous, with wrecks and drownings common. Dismantlers purchased the scows that survived the journey, selling the used lumber primarily for house building.[35]\n\nReal estate development\n\nThe funding for railway expansion depended upon returns from the sale of land acquired by the railway. The Grand Trunk Pacific Town & Development Co. was responsible for locating and promoting strategic town sites. However, the priority of maximizing profit undermined the economic prosperity of communities and other businesses by hampering the increase in traffic volumes essential for the GTP’s own survival.[37] In 1910 at Prince Rupert, although 25 real estate agents operated, David Hayes, the brother of GTP President Charles Melville Hays, was the sole company agent.\n\nIn what would become Prince George, the company purchased the First Nations reserve for a railway yard and a new town site. The GTPR also caused the displacement and the socio-economic destruction of native communities along the route, many of which had social and economic values in conflict with those of the railway.[40]\n\nSteamships\n\nBeginning in 1910, a GTPR steamship service operated from Prince Rupert. The first ship, the SS Prince Albert (formerly the Bruno built in 1892 at Hull, England), was an 84-ton, steel-hulled vessel and travelled as far as Vancouver and Victoria. Next, the SS Prince John (formerly the Amethyst built in England in 1910), travelled to the Queen Charlotte Islands. Built in 1910, the much larger SS Prince George and SS Prince Rupert, both 3,380-ton, 18-knot vessels, could carry 1,500 passengers with staterooms for 220. The ships operated a weekly service from Seattle to Victoria, Vancouver, Prince Rupert and Anyox.[41]\n\nThe vision was for coastal shipping to mature into a trans-Pacific line. However, Prime Minister Robert Borden was uninterested in promoting Prince Rupert as a port of call for any shipping lines. Vancouver flourished, but Prince Rupert languished. From 1919, the Canadian Government Merchant Marine (CGMM),[44] in partnership with CNR, promoted the development of import/export trade with Pacific rim countries. Although the expansion benefitted Vancouver, Prince Rupert remained a backwater.\n\nAncillary facilities\n\nGTPR Oban, Sask. interlocking tower\n\nThe GTPR built the Fort Garry Hotel in Winnipeg and the Hotel Macdonald in Edmonton. Halibird and Roche of Chicago designed the hotel for Prince George, but it never left the drawing-board stage. Construction of the $2m Chateau Prince Rupert, designed by Francis Rattenbury, did not proceed beyond the foundations, laid in 1910. Its forerunner, the temporary GTP Inn, was demolished in 1962. Sometimes in conjunction with the CNoR, the GTPR built some impressive city stations.[47][49]\n\nWhen built in 1910, the Grand Trunk Pacific dock in Seattle was the largest on the West Coast. On July 30, 1914, fire destroyed the facility. The federal government provided a $2m subsidy for a dry dock at Prince Rupert to handle ships up to 20,000 tons. Completed in 1915, it catered for only much smaller local vessels prior to World War II. It was dismantled in 1954 to 1955.[50][51]\n\nOperations\n\nGrand Trunk Pacific boxcars and gondola in Lovett, Alberta, about 1915.\n\nThe CNoR tracklaying through the Canadian Rockies in 1913 roughly paralleled the GTPR line of 1911 and created about 100 miles of duplication. In 1917, a contingent from the Corps of Canadian Railway Troops added several crossovers to amalgamate the tracks into a single line along the preferred grade from Lobstick, Alberta, to Red Pass Junction, British Columbia. The surplus rails were lifted and the heavier-grade GTPR ones shipped to France for use during World War I.\n\nThrough the 1910s, several branches were built by the GTP under the Grand Trunk Pacific Branch Lines Company and the Grand Trunk Pacific Saskatchewan Railway Company, subsidiaries of GTP. These included branches to Prince Albert, Battleford, Calgary, and to the international border via Regina.[53] Further branches were projected, and many were completed under Canadian National.\n\nIn 1915, unable to meet its debts, the GTP asked the federal government to take over the GTPR. The CNoR was in worse financial shape.[55] The royal commission that considered the issue in 1916 released its findings in 1917. In March 1919, after the GTPR has defaulted on construction loans to the federal government, the federal Department of Railways and Canals effectively took control of the GTPR[57] before it was merged into the CNR in July 1920. Noting numerous construction blunders, the 1921 arbitration on worth also ranked its significance within the naïve railway schemes of that era by this observation: \"It would be difficult to imagine a more misconceived project.\" The GTP itself was nationalized in 1922.\n\nCurrent status\n\nToday, the majority of the GTPR is still in use as CN's (name change to Canadian National or acronym \"CN\" in 1960) main line from Winnipeg to Jasper. The former CNoR line, and a later connection to Tête Jaune Cache, merge north of Valemount, before continuing south to Vancouver. The former GTPR line through Tête Jaune Cache to Prince Rupert forms an important CN secondary main line. The GTPR's high construction standards, and the fact Yellowhead Pass has the best gradients of any railway crossing of the Continental Divide in North America gives the CN a competitive advantage in terms of fuel efficiency and the ability to haul tonnage.\n\nAfter a century languishing far behind Vancouver, the Port of Prince Rupert has grown in importance since the early 2000s. Ongoing redevelopment of terminal infracture, less municipal congestion than other West Coast ports, proximity to the great circle route from East Asia to North America, and a fast connection to the Midwestern United States along the former GTPR route, have reduced transportation times.[63][64]\n\nSee also\n\nReferences"}]}