{"Lee Naylor spent four years at Celtic.": [{"url": "https://www.bbc.com/sport/football/24297061", "page_content": "Last updated on .From the section Football\n\nFormer Wolves and Celtic defender Lee Naylor has described the 16 months he spent out of football before joining Accrington Stanley as \"horrific\".\n\nThe 33-year-old became a full-time dad while he was trying unsuccessfully to find another club following his\n\nNaylor, who told BBC Radio Lancashire: \"I found it very weird.\n\nThe life and times of Lee Naylor Oct 1997: Senior debut for Wolves aged 17 Feb 2000: England Under-21 debut May 2003: Promotion to Premier League with Wolves Aug 2006: Joins Celtic for £600,000 and wins SPL title in each of first two seasons Jul 2010: Joins Cardiff on free transfer May 2012: Released by Cardiff Sep 2013: Joins Accrington Stanley\n\n\"It was a new experience for me. I've never been out of contract before.\"\n\nThe left-back, who won three caps for England's Under-21 side, continued: \"It's horrific. I know there are a lot of people unemployed at the moment. I've never been without a club and to be without a club for 16 months, watching the results coming in every weekend, is not a nice feeling. I don't want it again.\"\n\nA veteran of more than 500 senior games, including 22 in the Champions League for Celtic, Naylor trained with first club Wolves in an attempt to keep fit during his long exile.\n\n\"I try and look at the positives and I got a good year of family time,\" he added. \"I had a new baby and I was a full-time dad.\n\n\"But I never stopped working hard or training, because you can join a club at the drop of a hat, so I never gave anything up.\"\n\nNaylor made his debut for Accrington against Rochdale on 20 September - his first senior game since January 2012.\n\nJames Beattie's side are bottom of League Two and have lost their last eight games in all competitions. They travel to Plymouth on Saturday in search of a first league win this season."}, {"url": "https://www.thecelticwiki.com/naylor-lee/", "page_content": "Personal\n\nFullname: Lee Naylor\n\naka: The Weasel (social media fan’s nickname for him)\n\nHeight: 5.10\n\nWeight: 12st\n\nBorn: 19 March 1980\n\nBirthplace: Walsall\n\nSigned: 25 Aug 2006\n\nLeft: 1 June 2010 (Free)\n\nPosition: Defender, Left-back\n\nSquad no.: 3\n\nDebut: Celtic 2-1 Hibernian, League, 26 Aug 2006\n\nInternationals: England (no caps)\n\nBiog\n\nWalsall-born full-back Lee Naylor was signed by Celtic for £600,000 from Wolverhampton Wanderers on 24th August 2006.\n\nThe deal which brought the 27-year-old to Glasgow also saw fellow left-back Charlie Mulgrew, 20, move from Glasgow to Molineux. It was however a transfer which was not originally met with universal approval from the Bhoys support.\n\nNaylor had spent all his career at Wolves and following soon after the dismal failure of Mo Camera, a free transfer from Burnley, the Celtic support were not pleased at the club looking once more towards the English Championship in their bid to solve the problematic left-back position.\n\nFor his part, Naylor was delighted to have secured a move to Parkhead, and his enthusiasm and obvious joy at joining Celtic was evident in his early interviews as well as his performances on the pitch. Indeed within weeks of arriving, Naylor had won over most of the Celtic support with his energetic and tenacious play.\n\nAn over-lapping full back, Naylor was an asset in both attack and defence. Eager to get forward and get a cross into the box, Naylor also ensured he didn’t neglect his primary role and worked hard in curtailing opposition attacks. Although his performances dipped by the end of that season he had done enough to be nominated as a candidate for the SPFA Player of the Year Award 2006/07.\n\nCracks had however began to appear in his play and as the new season began, Naylor appeared to be a different player from the one that impressed during his first six months at the club. His distribution was dire, good opportunities were squandered by over-hit crosses and misplaced passes. Defensively he was often caught out of position and looked uncomfortable when players ran at him with the ball\n\nLess than a year after giving hope that Celtic’s search for a quality left-back could be over, it appeared that Naylor, like many before him, was not the answer. He did however retain a regular starting spot – scoring his first goal in a vital win over Hibs (s cracker of a goal he scored v Hibs was to everyone’s surprise but more than deserving of all the plaudits that came his way after it) – as Celtic dramatically battled back to claim the 2007/08 championship and their third title in a row.\n\nSeason 2008/09 saw Celtic surrender their grip on the league title and once more Naylor’s performances were frequently criticised by the support. A seemingly likeable character off the pitch, Naylor, despite his obvious failings on the park, he never gave anything less than his all in the Hoops but the fact remained that the left-back slot remained a significant weakness within the Celtic team.\n\nThe arrival in July 2009 of the highly rated Danny Fox from Coventry – ironically another Championship team – appeared to spell the end of Naylor’s days as the first choice left-back at Parkhead. Naylor made a number of cameo appearances filling in for Fox when the ex-Sky Blues man was injured.\n\nWhen Danny Fox surprisingly exited Parkhead prematurely in the January transfer window, Bhoys boss Tony Mowbrary underlined his reluctance to use Naylor by bringing in Dutch internationalist Edson Braafheid on loan from Bayern Munich. The Dutchman disappointed, and following the departure of Mowbray the interim Celtic manager Neil Lennon recalled Naylor to the starting line-up. Patience from Naylor had paid off.\n\nTo Lee Naylor’s credit he came good, and to the surprise of most he played a strong part and put the Dutch internationalist in the shade (where notably Braafheid later played in the World Cup final at the end of the season). Admittedly no stunning performances, but he still managed to hit the jackpot and grab a goal against Rangers in the final league derby match in May 2010. Something that he will prize. It may have been a deflection from his free-kick but it was still one more goal than Danny Fox scored this season from free-kicks (and Danny Fox was meant to be a free-kick specialist). Naylor had caught the eye of sections of the support and all were happy for him.\n\nHowever, with a new manager to come, the squad had to be refreshed and Lee Naylor had been in and out for the last couple of seasons. He was released on a free in June 2010, and despite the criticisms from sections of the support, he will be fondly remembered by the majority for his time and effort. He got himself a goal v Rangers and for that invaluable moment the support will remember him very fondly. At least he was leaving after a fine final run of form.\n\nWe wished him all the best.\n\nPost-Celtic\n\nAfter Celtic, he had spells at Cardiff, Accrington and Derby, and appears to have finally hung up his boots in 2015.\n\nHe never lost his Celtic roots, and played in front of 48,000 supporters for a ‘Celtic Legends‘ select side at Anfield v their Liverpool counterparts in a charity match in March 2023, winning the chance to relive old glories.\n\nPlaying Career\n\nClub From To Fee League Scottish/FA Cup League cup Other Cardiff 01/08/2010 Free Celtic 25/08/2006 01/08/2010 £600,000 95 (5) 3 12 (0) 0 5 (0) 0 22 (3) 0 Wolves 01/08/1997 25/08/2006 Trainee Apps Goals Apps Goals Apps Goals Apps Goals\n\n2009/10 Statistics TEAM Competition GS SB G A SH SG FC FS YC RC Celtic UEFA Europa League 1 2 0 0 1 0 1 3 1 0 Celtic Scottish Premier League 11 1 1 2 9 6 7 11 1 0 Celtic Scottish Cup 2 0 0 0 0 0 0 0 0 0 2009/10 Season Totals 14 3 1 2 10 6 8 14 2 0 2008/09 Statistics TEAM Competition GS SB G A SH SG FC FS YC RC Celtic Scottish Cup 2 0 0 0 0 0 0 0 0 0 Celtic Scottish Premier League 19 4 1 1 5 3 18 21 2 0 Celtic Scottish CIS Insurance Cup 2 0 0 0 0 0 0 0 0 0 2008/09 Season Totals 23 4 1 1 5 3 18 21 2 0 2007/08 Statistics TEAM Competition GS SB G A SH SG FC FS YC RC Celtic UEFA Champions League 2 0 0 0 0 0 0 0 1 0 Celtic Scottish Premier League 33 0 1 1 12 4 41 32 4 0 Celtic Scottish Cup 1 0 0 0 0 0 0 0 0 0 2007/08 Season Totals 36 0 1 1 12 4 41 32 5 0 2006/07 Statistics TEAM Competition GS SB G A SH SG FC FS YC RC Celtic Scottish CIS Insurance Cup 1 0 0 0 0 0 0 0 0 0 Celtic Scottish Cup 5 0 0 0 0 0 0 0 0 0 Celtic Scottish Premier League 32 0 0 3 7 2 29 30 7 0 2006/07 Season Totals 38 0 0 3 7 2 29 30 7 0\n\nGS: Games Started, SB: Used as Substitute,\n\nG: Goals, A: Assists, SH: Shots, SG: Shots on goal,\n\nYC: Yellow Cards, RC: Red Cards,\n\nFC: Fouls Committed, FS: Fouls Suffered,\n\nSV: Saves, OF: Offsides, W: Wins, D: Draws, L: Losses\n\nHonours with Celtic\n\nScottish Premier League\n\nScottish Cup\n\nPictures"}, {"url": "https://www.glasgowlive.co.uk/sport/football/lee-naylor-reveals-two-celtic-20624006", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest Celtic F.C updates, transfer news and analysis from Football Scotland delivered straight to your inbox every day for free\n\nFormer Celtic left-back Lee Naylor claims Neil Lennon had his hands tied over transfers before being shown the door at Parkhead.\n\nNaylor enjoyed a four-year stint for the Hoops between 2006 and 2010, winning two Premiership titles and one Scottish Cup during his time in Glasgow, and has since became an agent since hanging up his boots.\n\nNaylor even played under Lennon during his time with the Hoops and has revealed he submitted several players for the club's hierarchy to consider during the Northern Irishman's most recent tenure.\n\nBut it seems the manager might not have had the final say on potential incomings, as Naylor told the Celtic Huddle podcast : “I put a few in at the start of the season but there was no takers.\n\n“There was a centre midfielder and striker. They would have fitted in well.\n\nCeltic F.C newsletter Get the latest Celtic F.C updates, transfer news and analysis delivered straight to your inbox every day for free by signing up for our newsletter. Subscribing to our daily Hoops newsletter couldn't be easier. All you need to do is click on this link, taking you to our newsletter preference centre. Enter your email address, select 'Celtic FC news' and we'll do the rest!\n\n“Nicky Hammond was there at the time. I don’t know if Lenny had much say, to be honest.\n\n\"It depends on what a manager has to say, if he’s ruling the roost.\n\n“But I don’t think Lenny had much say, especially this season, and I think you could tell.\n\n\"I’ll have a few lined up this summer. It will be interesting to see who takes the reins – I just need to know who to speak to.\"\n\nNaylor also went on to add how surprised he is at the length of time it's taking Celtic to appoint a new manager, adding: “I’m pretty shocked nothing is in place at the moment.\n\n“It’s a lot of work. To be at Celtic you need a certain mentality to understand what’s needed to be a Celtic player.\n\n“You need people who understand what it takes to be a winner.\n\n“You need to filter through all the rubbish to find the players who can come in and make a difference.”"}, {"url": "https://www.67hailhail.com/news/ex-celtic-man-lee-naylor-was-left-stunned-by-november-protests/", "page_content": "Ex-Celtic man Lee Naylor was left stunned by November protests\n\nBy Euan Davidson May 18, 2021\n\nThere was a point this season where Celtic managed just one win in 11 games. In all competitions, the Bhoys were floundering. Protest filled the winter air, as fans congregated [Herald] outside Paradise on two occasions.\n\nIt was an unusual sight. Admittedly, small protests against the board, via tifos and literature had become commonplace. However, an actual revolt was a sight to behold. In a decade of dominance, there were still rumblings of discontent, but this was mutiny.\n\nAnd it was quite reasonable. This season was utterly dismal, and we’ll be counting the cost of the board’s inaction for a while yet. Even if normal service resumes in 21-22, the scars of this campaign will take a while to heal. If, that is, they heal at all.\n\nReflecting on this season, Lee Naylor joined Mark Wilson and Simon Donnelly for a chat on the Celtic Huddle Podcast. What’s more, he didn’t hold back when talking about the failures of 20-21.\n\nSpeaking about the awful form and the protests outside Paradise, Naylor said [Celtic Huddle Podcast]:\n\n“That’s not Celtic. That’s not the Celtic I know, anyways. I never thought in my time that I’d see Celtic fans gathering outside the club, in that much disappointment.\n\n“It wasn’t nice to see, obviously I don’t condone bad behaviour and violence, but that was the lowest point for me, to see that.\n\nAsked about whether there were any positives to this season, Naylor curtly replied:\n\n“Knowing who to get rid of.\n\n“At least now you can rebuild, and rebuild to know who wants to be at Celtic. Clear out who wants to be there and who doesn’t, it’s as simple as that.”\n\nLee Naylor doesn’t hold back, but nor should he: Celtic let supporters down this season\n\nEssentially, just so he isn’t misconstrued, what Naylor is saying is that he didn’t expect fans to be so disappointed by the club, that they’d (rightly) protest. Just so we’re on the same page.\n\nIt’s clear Naylor took a lot from being at Celtic. Across the whole podcast, the former Wolves man drops “we” and “us” throughout. Signed by Gordon Strachan in 2006, Naylor was shortlisted for the Player of the Year honours in 2007 [BBC].\n\nOver 4 years and 100 appearances, Naylor established himself as Strachan’s first-choice left-back, before his contract expired in 2010.\n\nAnd, on this evidence, he’s clearly hurt by what the supporters have been through this season. Clearly, he counts himself in that number."}, {"url": "https://www.thescottishsun.co.uk/sport/football/5528472/celtic-naylor-brown-threatening-break-legs/", "page_content": "FORMER Celtic star Lee Naylor has revealed the shock to the system he got before his very first match in Scottish football - when future Celtic skipper Scott Brown threatened him before kick off.\n\nBrown was a feisty 20-year-old right midfielder in the colours of first club Hibs when Naylor was persuaded north by Gordon Strachan after nine years at Wolverhampton Wanderers.\n\n2 Brown and Naylor went on to become team-mates and pals Credit: Kenneth Ramsay\n\nSpeaking to Si Ferry in the latest Open Goal - Keeping the Ball on the Ground podcast, Naylor told the story of his first encounter with a man who would go on to become a team-mate at Parkhead.\n\nIt came in a 2-1 Celtic win in the East End of Glasgow back in August 2006 - in which Brown opened the scoring for the visitors within eight minutes.\n\nNaylor said: \"My first taste of Scottish football was against Browny.\n\n\"My first game was Hibs at home, he was playing right midfield and I was left back.\n\n2 Naylor had four campaigns at Celtic Credit: Kenny Ramsay - The Sun Glasgow\n\n\"This was my first meeting with Browny.\n\n\"I am walking out, we've done our warm ups and that and we are out for kick off.\n\n\"I am walking across the field and Browny comes running right next to me and says 'I am going to break your legs'.\n\n\"He must have been what, about six years younger than me, he was 20 at the time, and I was like 'Is this kid for real or what?'\n\n🎥⚽️| Lee Naylor tells us about how his first introduction to Scottish Football was getting threatened by @HibernianFC's @ScottBrown8 in the tunnel before his @CelticFC debut 🤣🤣\n\n\n\nFull Interview MONDAY @ 5PM w/ @WilliamHill pic.twitter.com/ot5uVf3Jez — Open Goal (@opengoalsport) April 24, 2020\n\n\"Obviously they went and scored, they went 1-0 up.\n\n\"He has come running up to me and said 'I am going to be on you all game, you aren't going to get anything, break you in two'\n\n\"I was thinking 'oh my Lord what have I come to here'.\n\nAsked by Ferry if his future team-mate had impressed him on the day, Naylor replied: \"Aye he was good but we got the winner with me going on down the line.\n\n\"I said alright to him after that.\n\nStrachan must have been impressed anyway, because Brown moved to Celtic at the end of that season for £4.5million.\n\nNow 34, the midfielder has led the Parkhead club to a catalogue of major honours in the 13 years since then.\n\nFerry said: \"He was a wee wideo, wasn't he?\"\n\nThe full podcast airs on Monday.\n\nKeep up to date with ALL the latest news and transfers at the Scottish Sun football page"}, {"url": "https://www.dailyrecord.co.uk/sport/football/lee-naylor-ill-be-a-celtic-player-1035257", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest Celtic news sent straight to your inbox with our daily newsletter\n\nLEE NAYLOR insists he'll fight for his place at Celtic until told he is surplus to requirements.\n\nThe left-back came on as a sub against Arsenal in midweek and many people felt that may have been his final curtain call for the club.\n\nNaylor's no longer a first pick since Tony Mowbray brought Danny Fox from Coventry for £1.5million.\n\nThe Englishman has been linked with a move away with Portsmouth apparently keen on signing him.\n\nA transfer switch could happen before Tuesday's 5pm deadline but Naylor - who is contracted until the end of the season - admits he's as much in the dark as anyone.\n\nLee (left) said: \"There's been a bit of speculation but I'm still at Celtic. It's flattering but nothing has happened yet.\n\n\"I'll keep training and hopefully win back my place. I'll be totally professional. That's the way I am.\n\n\"I've been linked with Portsmouth and it's nice to know some managers believe you could be useful to them.\n\n\"But I don't know what will happen.\n\nThe last day of the transfer window will be hectic. If I stay with Celtic, that's fine.\n\n\"I've been impressed with Tony since he came in. He's different class and a straight talker who tells you how it is.\"\n\nNaylor will turn his attention to SPL duty today and reckons the Hoops can put their Champions League sorrow behind them by dumping Hibs at Easter Road.\n\nHe said: \"We have to forget about losing to Arsenal and concentrate on the league. We are a good team and know what is needed against Hibs.\""}, {"url": "https://www.talkceltic.net/forums/threads/lee-naylor.52477/", "page_content": "If, as expected, Erik Edman leaves the club during the summer, Steve Bruce is expected to look north of the border for a replacement.\n\n\n\nWith Helsingborgs keen to attract Edman back home to Sweden, Bruce will seek cover for the Swede and he reportedly sees Celtic defender Lee Naylor as an ideal replacement.\n\n\n\nBloxwich born Lee is a former England Under 21 star and spent all of his career at Wolverhampton Wanderers before joining Celtic in August 2006 for a fee of just over half a million pounds.\n\n\n\nNaylor turned 29 years of age last month and is believed to want to finish his career in England.\n\nClick to expand..."}, {"url": "https://www.bbc.co.uk/sport/football/24297061", "page_content": "Last updated on .From the section Football\n\nFormer Wolves and Celtic defender Lee Naylor has described the 16 months he spent out of football before joining Accrington Stanley as \"horrific\".\n\nThe 33-year-old became a full-time dad while he was trying unsuccessfully to find another club following his\n\nNaylor, who told BBC Radio Lancashire: \"I found it very weird.\n\nThe life and times of Lee Naylor Oct 1997: Senior debut for Wolves aged 17 Feb 2000: England Under-21 debut May 2003: Promotion to Premier League with Wolves Aug 2006: Joins Celtic for £600,000 and wins SPL title in each of first two seasons Jul 2010: Joins Cardiff on free transfer May 2012: Released by Cardiff Sep 2013: Joins Accrington Stanley\n\n\"It was a new experience for me. I've never been out of contract before.\"\n\nThe left-back, who won three caps for England's Under-21 side, continued: \"It's horrific. I know there are a lot of people unemployed at the moment. I've never been without a club and to be without a club for 16 months, watching the results coming in every weekend, is not a nice feeling. I don't want it again.\"\n\nA veteran of more than 500 senior games, including 22 in the Champions League for Celtic, Naylor trained with first club Wolves in an attempt to keep fit during his long exile.\n\n\"I try and look at the positives and I got a good year of family time,\" he added. \"I had a new baby and I was a full-time dad.\n\n\"But I never stopped working hard or training, because you can join a club at the drop of a hat, so I never gave anything up.\"\n\nNaylor made his debut for Accrington against Rochdale on 20 September - his first senior game since January 2012.\n\nJames Beattie's side are bottom of League Two and have lost their last eight games in all competitions. They travel to Plymouth on Saturday in search of a first league win this season."}, {"url": "https://www.dailyrecord.co.uk/sport/football/lee-naylor-celtic-have-firepower-to-overtake-969948", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest Celtic news sent straight to your inbox with our daily newsletter\n\nLEE NAYLOR admits he'd rather be 17 points in front of Rangers again this year but the Celtic left-back isn't lying awake at night worrying about the fact he isn't.\n\nNot when he knows he's got the best view in the stadium every week of the young man he believes should be the Player of the Year going about his business.\n\nNaylor plays directly behind Aiden McGeady and can only watch in wonder at the tricks, flicks and finally the end product he has added to his game this season in the shape of eight goals and far more assists.\n\nThe Englishman believes the Scots-born Irishman can help Celtic overcome the four-point deficit on Rangers, starting tonight against Inverness Caledonian Thistle where a victory will be vital if their rivals slip up at Tynecastle.\n\nFormer Wolves defender Naylor insists Celtic aren't feeling the pressure of trailing in the title race but concedes while neutrals might be delighted it is not the one-horse canter it was last term he would rather it was.\n\nHe said: \"I would have preferred if the league table was the same as last year. I'm sure as a spectacle it is good to watch but as a player you want it to be more easy going. We just go into every game knowing we need to win.\n\n\"As it is playing out it looks like it is going to come down to the Old Firm games.We have two of them at home, which is to our advantage.\n\n\"I would prefer it was over well before the end of the season but we have to overcome the situation we are in and hopefully when it comes to it we can rise to the challenge.\n\n\"I wouldn't say I am feeling pressure. I am enjoying the challenge not feeling pressure. I can't see any strain on any of the boys, apart from wanting to go out and win games. It is just the usual pressure of playing for Celtic. We have to win games, it is as simple as that.\"\n\nNaylor believes Celtic will come from behind to win the title because they have attacking players he reckons can pierce any defence in the country.\n\nHe added: \"I have always had a belief since I joined Celtic that we are going to win games. No matter how long is gone I have a belief, and the team has a belief, we are going to win every game.\n\n\"It is a good habit to have and it is brilliant going into matches feeling like that.\n\n\"Confidence is high. We have a top scorer who is flying in the league (Scott McDonald) and we have our player of the year, Aiden McGeady, who is in incredible form so far.\"\n\nMore of McGeady later but before Walsall-born Naylor got on to the winger's wonderful season he paid tribute to a striker who has divided the Celtic support but who he reckons deserves as many plaudits as McDonald has received for his goalscoring exploits.\n\nHe said: \"For me Jan Vennegoor of Hesselink is top, top drawer. He is just as important as anybody else in the team.\n\n\"He has provided Scott with a lot of the ball, flick-ons and the runs he makes. They work together and their partnership is credit to both their goals.\"\n\nMany of which have been created by McGeady, a player he believes is destined for one of the big four in the Premiership at some point in his career. But Naylor hopes that will be later rather than sooner.\n\nHe added: \"Being selfish, I hope he stays here. If he keeps doing the things he is doing he is going to have big teams looking at him. That is what is happening.\n\n\"I don't think anybody could sway him away from Celtic apart from one of the big four down south.\n\n\"It might be his personal choice to go to Spain but I think he should stay at Celtic although the Premiership would suit him better than Spain. That is my view.\n\n\"Aiden is something else. He has gone up a notch this season.\n\n\"He has been top drawer and worked hard at his game and is reaping the rewards. He is scoring goals and creating them and that is all credit to him.\n\n\"He is up there with the top players in the Champions League. He is direct and I think he has become even more direct this season and that hurts defenders.\n\n\"There is nothing worse than somebody always running at you and with the pace he has it can be one of the most frightening things.\n\n\"He has found out how to hurt people and now does it.\n\n\"I tend to stay away from him in training. When you do come up against him you think please don't go running down that line.\n\n\"He has been brilliant this season. I can't say enough about him.\"\n\nMcGeady has added a work ethic to his game, tracking back to lend Naylor a hand when needed.\n\nBut the left-back prefers to see the winger's back as he hurtles away from him to create problems at the other end of the park. He said: \"I like to leave him to what he does best. That is running, attacking and taking on defenders.\n\n\"It is good when he tracks back and helps me but we have a relationship where I let him go and do what he does best and I try to give him all the confidence in the world. I don't think I can give him any more than he already has.\""}, {"url": "https://www.thescottishsun.co.uk/sport/football/7129634/celtic-lennon-didnt-say-transfer-business-naylor/", "page_content": "LEE NAYLOR reckons Neil Lennon didn't have much say in Celtic's transfer business last season.\n\nThe former Hoops star now works as an agent and offered some of his players to his old side last summer.\n\n2 Ex-Celtic boss Neil Lennon Credit: Reuters\n\nHe admits that the Parkhead club's former head of football operations, Nick Hammond, ultimately turned him down at the time.\n\nBut Naylor reckons ex-Celtic boss Lennon didn't have much say over transfers in his final season in charge regardless.\n\nSpeaking on the Celtic Huddle podcast, he said: \"I put a few in at the beginning of the season but there were no takers.\n\n\"There was a centre-midfielder and a striker. They were top and they would have fit in well.\n\n2 Former Celtic star Lee Naylor Credit: Kenny Ramsay - The Sun Glasgow\n\n\"It was Nick Hammond at the time. I don't know if Lennon had much say, if I'm honest.\n\n\"I don't think he had much say, especially this season, and I think you could tell.\"\n\nCeltic hero Simon Donnelly was disappointed to hear that was a possibility.\n\nThe former Scotland international joined the Parkhead club in 1993 and went on to spend six years there.\n\nAnd he admits knowing that the manager wanted him in the team was a great source of encouragement.\n\nHe said: \"I'm old school but I want to be playing for guys that want you in the team.\n\n\"I've been lucky enough everywhere I've went that I had the impression that the manager wanted you.\n\n\"Nowadays it might be a wee bit different.\n\n\"I find that surprising though, where a job as big as the Celtic one, the manager doesn't have a say in guys coming in.\n\n\"Back in my day, I wanted to play for Tommy Burns. Even when guys like Wim Jansen came in, they expressed that they wanted you to play.\n\n\"That's what players want. They want the belief of the manager and it enhances your game.\n\n\"Look at Pep Guardiola with Phil Foden now, the way he's went about managing that kid.\n\n\"He gave him the belief in a team full of superstars by putting him in time and time again.\"\n\nKeep up to date with ALL the latest news and transfers at the Scottish Sun football page"}], "Lee Naylor won two Scottish Premier League titles and two Scottish Cups with Celtic.": [{"url": "https://www.skysports.com/football/news/12040/12895289/scottish-premiership-every-clubs-season-assessed", "page_content": "With another dramatic Scottish Premiership season finished, Sky Sports assesses who earned top marks, who could have done more and who were the star men?\n\nAberdeen 7/10\n\nImage: Luis Lopes celebrates for Aberdeen\n\nThe wheels had threatened to come well and truly off this season for the Dons after the resumption of the Premiership following the World Cup in December, with Jim Goodwin's team picking up one point from seven games, losing their League Cup semi-final to Rangers and suffering a shock 1-0 Scottish Cup defeat to sixth-tier Darvel.\n\nBack-to-back hammerings at the hands of Hearts and Hibernian in late January may have seen Goodwin leave Pittodrie but Aberdeen have clinched third spot and a place in the group stages of Europe next season thanks to a remarkable turnaround, led by now-permanent boss Barry Robson.\n\nThe former Celtic midfielder led his team to seven straight wins, including a first victory over Rangers in the league since 2018, as Hearts capitulated, meaning there will be European football in the Granite City next season.\n\nMid-season rating 6/10\n\nImage: Barry Robson was confirmed as Aberdeen manager\n\nWhat do they need next season? Aberdeen fans crave silverware and either the League Cup or Scottish Cup remains their best bet. To be successful in either of those competitions they will need to hold on to their key men. Ross McCrorie has been linked with a move to Bristol City, while Duk has admitted that he is also eyeing a move south at some point. If they can hold on to Bojan Miovski and add a little more quality in key areas then Aberdeen will fancy their chances of being competitive in the domestic cups and securing third spot again next season.\n\nStar man: Duk\n\nCeltic 9/10\n\nPlease use Chrome browser for a more accessible video player Match highlights as Celtic lifted the Scottish Premiership trophy after easing to victory over Aberdeen.\n\nCeltic were nine points clear of Rangers going into the World Cup break and never let that lead slip. The Ibrox side dropped just two points (a draw against Celtic) in their first 15 league games under new manager Michael Beale and still could not put a dent in that deficit.\n\nAnge Postecoglou's side were relentless before the World Cup and were equally as ruthless after it until the title was clinched. Their quest to amass a record points tally was brought to a halt after a sobering 3-0 defeat at Rangers last month but the title was virtually assured since November. A 3-2 win over Rangers at Parkhead in April snuffed out any hope the visitors may have had of reigniting a title race in the closing stages of the season.\n\nA win over Inverness Caledonian Thistle at Hampden in the Scottish Cup final on Saturday clinched a fifth treble in seven years, although it may be the last time Celtic fans see their Australian boss leading their side.\n\nMid-season rating 8/10\n\nImage: Ange Postecoglou has won back-to-back titles at Celtic\n\nWhat do they need? Rumours swirled around the future of Postecoglou every time a Premier League manager got the sack during the campaign - he always dismissed any notion that he would leave mid-season and has instead spoken about building on his success so far. However, the Celtic manager has emerged as the preferred candidate for the vacant Tottenham job and, this time, the speculation is not going away. If the Australian departs after two seasons in the east end then Celtic will look to act quickly to appoint a successor to minimise disruption to their summer plans. Whoever takes charge will also need to ensure complacency does not set in, with Michael Beale already overseeing a major overhaul to a stagnant Rangers side.\n\nStar man: Kyogo Furuhashi\n\nDundee United 2/10\n\nPlease use Chrome browser for a more accessible video player Highlights of Motherwell against Dundee United in the Scottish Premiership.\n\nThere had been shoots of hope under new boss Jim Goodwin going into the split after three wins in a row towards the end of April but a damaging 3-1 defeat at home to Ross County in mid-May set United back in the battle to beat the drop. Defeats to Livingston, Kilmarnock and Motherwell on the final day sealed their fate.\n\nAfter two seasons back in the top flight, Tannadice will play host to Championship football again next term.\n\nIt had promised to be such an exciting season, one in which the club could have built on an excellent fourth-placed finish under previous boss Tam Courts but devastating defeats to AZ Alkmaar in Europa Conference League qualifying and then Celtic at Tannadice set the tone for the campaign.\n\nDamaging defeats to relegation rivals Ross County and Kilmarnock did not help Liam Fox before he was replaced by Goodwin, with the former Aberdeen boss just running out of time in order to beat the drop.\n\nTo add insult to injury, city rivals Dundee will be playing Premiership football next season after winning the Championship title this time around, meaning there will be no league derbies in the City of Discovery next term.\n\nMid-season rating 3/10\n\nImage: Dundee United have been relegated\n\nWhat do they need? United are now facing some key questions over the summer but there is certainty over their managerial position. Goodwin has been handed a two-year deal and tasked with the job of getting the club back to the top flight at the first time of asking.\n\nThere is, of course, a financial concern that comes with relegation and United may have to sell key players, including the likes of Dylan Levitt, in order to prepare for life back in the second tier. Steven Fletcher could move on as well but United have become adept at giving youth a chance and Goodwin should be able to call on some more exciting youngsters to try and get the club promoted.\n\nStar man: Steven Fletcher\n\nHeart of Midlothian 6/10\n\nImage: Hearts players celebrate Yutaro Oda's opening goal at Tynecastle\n\nA month is a long time in football - just ask Robbie Neilson. On March 8 Neilson declared that his side had played \"some of the best football you'll see from an opposition team\" as Hearts lost 3-1 at Parkhead. On April 9 he was sacked following a 2-0 defeat at home to St Mirren.\n\nHearts' campaign derailed spectacularly between February and March. After seemingly having third place sewn up for the majority of the season, Neilson's side lost six of his last eight in charge and, with Aberdeen resurgent under Barry Robson, Hearts' grip on third spot and guaranteed European football next season was decisively loosened.\n\nSteven Naismith was in the dugout until the end of the season but Ann Budge and CEO Andrew McKinlay will now have to decide on who takes over full-time next term with third spot and the financial rewards of at least Europa Conference League football absolutely vital.\n\nMid-season rating 7/10\n\nPlease use Chrome browser for a more accessible video player Hearts goalkeeper Craig Gordon believes Steven Naismith impressed during his spell in charge, insisting the players would be happy for him to be appointed permanently.\n\nWhat do they need? Naismith did his chances of taking over permanently no harm after ensuring Hearts beat Edinburgh rivals Hibernian to fourth spot and a place in Europe on the final day. The loss of skipper and No 1 Craig Gordon to a double leg break on Christmas Eve undoubtedly had an impact on Hearts' season and the club will be keen to see how his recovery is progressing ahead of the new campaign.\n\nStar man: Lawrence Shankland\n\nHibernian 6/10\n\nImage: Hibernian's Kevin Nisbet celebrates\n\nIt has been an inconsistent first season in Leith for boss Lee Johnson, with his Hibernian side showing real signs of progress before being knocked back on their heels by a couple of poor results. Such was Hibs' campaign.\n\nHowever, they have secured European qualification thanks to Celtic's Scottish Cup win, despite Johnson being adamant earlier in the campaign that this was a squad in need of rejuvenation, and they did pick up their first Edinburgh derby win since 2019 in April.\n\nBrian McDermott has been appointed as director of football with the aim of helping the club improve on recruitment over the summer - something that Johnson has been keen on.\n\nHibernian's season was also rocked by the passing of owner Ron Gordon, who died in February at the age of 68, three weeks after revealing he had been receiving treatment for cancer.\n\nMid-season rating 5/10\n\nPlease use Chrome browser for a more accessible video player Highlights of the Scottish Premiership match between Hearts and Hibernian.\n\nWhat do they need? Johnson spoke candidly about improving recruitment and the appointment of McDermott should help in that regard. A more settled and balanced squad, potentially with the return of key man Martin Boyle from long term injury, should also see Hibs make a more concerted run for third spot and European football against Aberdeen and Edinburgh rivals Hearts.\n\nStar man: Kevin Nisbet\n\nKilmarnock 6/10\n\nPlease use Chrome browser for a more accessible video player Highlights of Kilmarnock against Ross County in the Scottish Premiership.\n\nKilmarnock's first season back in the top flight was always going to be a challenging one but Derek McInnes has passed the test and the Ayrshire side will be a Premiership team next time around.\n\nIt has not been without its difficulties - Kyle Lafferty's 10-game ban deprived McInnes of a genuine goal-threat and his departure from the club, alongside Oli Shaw, in January left Killie needing goals up front.\n\nDespite being one of the lowest scoring sides in the league they managed to win the key games - Dundee United away and Ross County at home in the final two games of the season defined their campaign. Their brilliant form at Rugby Park saved this side after they picked up just two wins and scored 11 goals away from home all campaign.\n\nFor now, those figures are irrelevant but McInnes knows that the hard work of recruitment - especially finding a striker to hit double figures next time around - continues in the summer.\n\nMid-season rating 6/10\n\nImage: Kilmarnock's Kyle Vassell celebrates scoring to make it 3-1 during a Premiership match between Kilmarnock and Ross County\n\nWhat do they need? McInnes will want guarantees that Kilmarnock will build on their first season back in the top flight rather than be satisfied with it. Killie are not yet expected to reach the heights of European qualification achieved in Steve Clarke's tenure but they will be keen to ensure that they don't become a club that flirts with relegation every year.\n\nThe former Aberdeen boss will want to be backed in the summer with the idea of pushing for a top six spot as opposed to constantly looking down. McInnes signed a three-and-a-half-year extension to his contract in October and appears to be in it for the long haul.\n\nStar man: Danny Armstrong\n\nLivingston 7/10\n\nPlease use Chrome browser for a more accessible video player Highlights of St Johnstone against Livingston in the Scottish Premiership.\n\nLivingston's form since the turn of the year has been a concern. David Martindale's side finished where they realistically should have in the table but the manager has exceeded expectations plenty of times in the past and his side were in with a chance of a top-six finish again just before the split.\n\nHowever, Livi have won just six times since the start of 2023. Martindale said recently that either new players needed to be brought in or he would have to think about his position if results continue to be a concern but the club would surely focus on actioning the former. Martindale has been a revelation in West Lothian.\n\nDespite that, Livi have not been scoring enough goals - they were the lowest scoring side in the division with 36 - and have gone from having one of the tightest defences in the league to the joint-fourth worst for conceding.\n\nLivingston had reasonable aspirations of challenging for a European spot going into 2023 but the drop off is perhaps not unsurprising given budgets and squad depth. Indeed, Martindale was happy to have secured Premiership safety after top six hopes were extinguished.\n\n\"To be honest, I'd have bit your hand off to not be in a relegation battle at the start of the season,\" he said. \"I spoke to folk at Ross County who said 'keep your head up, you've had a great season' and the same at Kilmarnock. I'm going home absolutely devastated after defeats. It hurts. It really hurts, and I'll do absolutely everything within my power to turn the corner.\"\n\nMid-season rating 8/10\n\nImage: Livingston's Joel Nouble (L) celebrates with teammate Bruce Anderson\n\nWhat do they need? A trip to Almondvale used to be a real concern for both halves of the Old Firm but that trepidation has disappeared over the past 12 months or so. Livingston have become easier to play against and, while they have never been a side that scored freely under Martindale, they were always difficult to break down. The Livi boss needs to freshen the squad and quite possibly get back to being that team that no one wants to play again.\n\nStar man: Jon Nouble\n\nMotherwell 7/10\n\nImage: Motherwell's Kevin van Veen celebrates scoring to make it 1-1\n\nStuart Kettlewell's name did not appear among the nominees for the PFA Manager of the Year award - understandably so, given he was only appointed in February - but few bosses have impacted upon a side's fortunes the way he has this season.\n\nMotherwell had not won in the league since October before Kettlewell took charge on a temporary basis in February with the club slipping into the relegation battle under previous boss Stevie Hammell.\n\nKettlewell got the job full time after initial back-to-back wins and has not looked back - Motherwell have finished as best of the rest outside the top six, becoming one of only two Scottish teams to stop Celtic winning at Parkhead this season in the process, and their manager has stated his desire to start challenging for Europe as opposed to flirting with relegation.\n\nThey had the best defensive record in the league outside of the Old Firm and, with Kevin van Veen finishing with 25 goals for the season, it is no surprise in the end they secured their top flight status with plenty to spare.\n\nMid-season rating 5/10\n\nPlease use Chrome browser for a more accessible video player Highlights of the Scottish Premiership match between Celtic and Motherwell.\n\nWhat do they need? The likelihood is that the prolific Van Veen will depart North Lanarkshire in the summer and who knows where Motherwell would have been this season without his goals. He will not be easy to replace but Motherwell need to add quality throughout the squad to meet Kettlewell's ambitions of challenging for Europe. Promising right-back Max Johnston has also been linked with a host of clubs on the continent.\n\nStar man: Kevin van Veen\n\nRangers 5/10\n\nPlease use Chrome browser for a more accessible video player Rangers manager Michael Beale is looking forward to a summer reset before trying to offer a stiffer challenge to champions, Celtic.\n\nA league season that had promised so much off the back of an unbelievable European adventure had largely crumbled into dust by November. Giovanni van Bronckhorst had no luck with injuries but a disastrous Champions League campaign coupled with being booed off the pitch by their own supporters following stale domestic performances meant an exit was all but inevitable for the Dutchman.\n\nMichael Beale did steady the ship, going on an unbeaten 15-game run after taking the reins but he could not stop Celtic's march to the title, even if Rangers did secure a morale-boosting 3-0 win in the Old Firm at Ibrox in May. That will count for little as Celtic pick up another treble after two Hampden wins in the League Cup final and Scottish Cup semi-final over the Gers but Beale at least has something to work with over the summer as the likes of Ryan Kent and Alfredo Morelos bid farewell, probably a year too late.\n\nThe January additions of Nicolas Raskin and Todd Cantwell have given supporters hope that summer recruitment will be a marked improvement on what has come before but Beale has a major rebuild on his hands, with the club in transition on and off the pitch.\n\nMid-season rating 4/10\n\nPlease use Chrome browser for a more accessible video player Rangers say goodbye to departing players including Ryan Kent and Alfredo Morelos after their last home game of the season.\n\nWhat do they need? Beale has suggested that Rangers could be looking at a dozen in and a dozen out over the summer. Off the pitch it may be a similar story. Director of Football Ross Wilson has already departed for Nottingham Forest, John Bennett has replaced Douglas Park as chairman, with Stuart Robertson and academy director Craig Mulholland also leaving in the summer. James Bisgrove will take over as CEO in July, with the club going through a period of evolution off the pitch in the hope that it breeds success on it.\n\nRangers have already completed the Bosman signings of Chelsea academy graduate Dujon Sterling and Kieran Dowell from Norwich in what promises to be a very busy summer.\n\nStar man: James Tavernier\n\nRoss County 5/10\n\nImage: Ross County's George Harmon sent their Scottish Premiership play-off to extra time by completing a stunning three-goal comeback at Dingwall\n\nMalky Mackay was never really expected to improve upon Ross County's top-six finish last season but avoiding relegation this term will ultimately be viewed as a real achievement, especially given the dramatic circumstances in which they secured survival in Dingwall on Sunday.\n\nOne win from their opening nine Premiership matches saw County flirt with the relegation places early on but they always seemed to pop up in the key moments against the teams around them, with a decent track record over Kilmarnock and Dundee United throughout the campaign.\n\nIndeed, a 3-1 win over Dundee United in mid-May - building off the back of a victory over Livingston - seemingly set the Staggies up for the final three games of the season but just one point from those matches saw them dip into the relegation play-off spot.\n\nMackay's side deserve credit for overturning a 2-0 first leg loss to Partick Thistle in the play-off final but the battle against relegation this season will have been a little too close for comfort for everyone at Victoria Park.\n\nThey had the lowest number of shots and shots on target throughout the league. Jordan White bagged 11 goals and Yan Dhanda scored six, including one in the play-off final, but Owura Edwards and Alex Iacovitti were next on the list, only managing three each in the league. This is something Mackay will look to address over the summer.\n\nMid-season rating 5/10\n\nPlease use Chrome browser for a more accessible video player Highlights from the second leg of the Scottish Premiership play-off between Ross County and Partick Thistle.\n\nWhat do they need? With survival assured, thoughts may turn to Mackay's future. Another top six finish does seem unlikely given that the likes of Aberdeen and the Edinburgh sides are set to strengthen, so would the 51-year-old be content to continue at the lower end of the Premiership?\n\nMackay would not be short of offers if he decided to step back from the Highlands side but the fit between both parties seems to have been a largely positive one.\n\nStar man: Jordan White\n\nSt. Johnstone 6/10\n\nPlease use Chrome browser for a more accessible video player Highlights of the Scottish Premiership match between Ross County and St Johnstone.\n\nAt the turn of the year St Johnstone were back in the top six, had beaten Rangers in the league for the first time since 2017, and had put together a decent run of form, including going six unbeaten.\n\nBy mid-April, double cup winning manager Callum Davidson was gone after the Saints picked up just two wins from their 13 games since the turn of the year to slide right into relegation trouble they thought they had been clear of.\n\nSteven MacLean was appointed in the interim initially but has been given the job permanently after just one defeat in his six games in charge ultimately secured the club's safety but St Johnstone came a lot closer to relegation than many supporters would have cared for.\n\nThe decision to sack Davidson, the club's most successful manager, would have been a difficult one but MacLean just about managed to keep the team above water thanks to a couple of positive results after the split.\n\nNicky Clark's absence through injury would not have helped but St Johnstone simply didn't score enough goals to have that extra breathing room that Motherwell enjoyed in the final weeks of the season.\n\nMid-season rating 7/10\n\nImage: Steven MacLean has been appointed as St Johnstone boss\n\nWhat do they need? Steve MacLean will now be charged with taking the Perth side back into the top six in the Premiership. It will not be easy, given that the top six sides and Motherwell will likely strengthen over the summer, but this is a team that won the cup double not so long ago - St Johnstone fans will be keen to avoid relegation battles year in, year out.\n\nStar man: Stevie May\n\nSt. Mirren 8/10\n\nImage: St Mirren's Mark O'Hara celebrates after scoring to make it 2-0 during a Premiership match between Heart of Midlothian and St Mirren at Tynecastle\n\nStephen Robinson's difficult return to the Scottish Premiership with St Mirren in February 2022 is well documented - he lost seven of his first eight matches before ultimately guiding the club to safety.\n\nRelegation has never been a concern for the Buddies this time around. Robinson and his team have been one of the success stories of the season, with St Mirren deservingly securing their first Premiership top-six finish and the Northern Irishman nominated for the PFA Manager of the Year award.\n\nRobinson guided Motherwell to Scottish Cup and League Cup finals in the past - perhaps he has ambitions to lead St Mirren to big Hampden days in the future as well.\n\nMid-season rating 8/10\n\nPlease use Chrome browser for a more accessible video player Highlights of the Scottish Premiership match between Celtic and St Mirren.\n\nWhat do they need? Can St Mirren push on in the cups while challenging for a European spot? That is the test ahead of Robinson now. They lost Ethan Erhahon and young prospect Dylan Reid in January but Robinson will be determined to hold on to Australian World Cup star Keanu Baccus while adding quality to his squad over the summer.\n\nStar man: Mark O'Hara"}, {"url": "https://www.skysports.com/football/news/11781/12871397/queens-park-3-5-dundee-the-dee-secure-title-to-win-promotion-to-scottish-premiership-after-eight-goal-thriller", "page_content": "Dundee have won promotion to the Scottish Premiership after a thrilling 5-3 victory in a title decider with Queen's Park.\n\nA draw would have been enough for Dundee to go up as champions from the Scottish Championship and they went ahead in just the fourth minute through Alex Jakubiak, but Queen's Park roared back with two goals in two minutes from Charlie Fox and Connor Shields.\n\nYet the game swung back into Dundee's favour in the first half when Lee Ashcroft equalised in the 20th minute before Zach Robinson put the visitors 3-2 up at Ochilview Park. There was still time in the opening period, though, for Queen's Park to level again when Fox struck his second of the match in injury time.\n\nHowever, Lyall Cameron netted shortly after the break before Luke McCowan became their fifth scorer of the night, wrapping up the title late on to bounce back into the Scottish Premiership at the first attempt.\n\nHow Dundee won the title in style\n\nPlease use Chrome browser for a more accessible video player Gary Bowyer is determined to keep Dundee in the Scottish Premiership after they beat Queen's Park to secure a top-flight return.\n\nBoth sides went into the much-hyped showdown in unconvincing form, with Queen's - aiming to get back into the top flight for the first time since 1958 - having lost four of their previous six matches and Dundee on a run of one win in five.\n\nAny notion that a lack of confidence within both sides, allied to the pressure of the occasion, might lead to a cagey affair was emphatically banished by an incredible start that brought four goals within the opening 17 minutes.\n\nDundee signalled their intent in the third minute when Cameron shot just wide after being teed up by Jakubiak on the edge of the box.\n\nThe same players combined just a minute later as the visitors took the lead when Cameron took advantage of a slip by Malachi Boateng inside the box and cut the ball back for Jakubiak to slot home from eight yards out.\n\nImage: Alex Jakubiak celebrates after putting Dundee 1-0 up at Ochilview Park\n\nThe hosts tried to find a response and Dominic Thomas saw an inswinging free-kick from the right pushed behind by goalkeeper Adam Legzdins in the ninth minute.\n\nThe resulting corner led to an equaliser as centre-back Fox seized on a bouncing ball 25 yards out and unleashed a sensational dipping half-volley that looped over Legzdins and into the net.\n\nQueen's edged themselves ahead in the 12th minute when Shields fired home a superb angled volley from the edge of the six-yard box after Grant Savoury's shot had been blocked.\n\nThe frenetic start continued as Dundee levelled things up once more in the 17th minute when defender Ashcroft volleyed in from six yards after Dan Sweeney headed McCowan's cross back across goal.\n\nImage: Dundee's Lee Ashcroft (R) celebrates making it 2-2\n\nThe visitors almost struck again five minutes later when Barry Maguire crashed a shot off the crossbar.\n\nDundee restored their lead in the 34th minute when Robinson forced the ball home from close range after Queen's made a mess of trying to clear a Jakubiak ball across the box.\n\nThe first-half scoring was not finished, however, and Spiders defender Fox netted his second of the night in stoppage time when he powered home a header from another Thomas corner to make it 3-3.\n\nImage: Queen's Park's Charlie Fox celebrates scoring to make it 3-3\n\nQueen's went close to taking the lead three minutes after the interval when Shields' shot from just inside the box was brilliantly tipped behind by Legzdins.\n\nImage: Dundee's Lyall Cameron (left) celebrates scoring to make it 4-3\n\nBut it was Dundee who took control of the title race in the 54th minute when Cameron kept his cool to tuck home a low shot from 15 yards out after good work by McCowan and Jakubiak to create the opening.\n\nImage: Luke McCowan scored Dundee's fifth goal\n\nMcCowan then sealed the deal in the 81st minute when he curled in a superb shot from just outside the box to consign Queen's to the play-offs. The final whistle was greeted by a pitch invasion from jubilant Dundee fans."}, {"url": "https://olympics.com/en/athletes/lee-naylor", "page_content": "Year of Birth\n\nYear of Birth 1971\n\nFirst Olympic Games\n\nFirst Olympic Games Atlanta 1996\n\nPersonal Best: 400 – 51.35 (1998)."}, {"url": "https://www.skysports.com/football/news/30385/10267972/leicester-win-premier-league-how-they-did-it-differently", "page_content": "Leicester's Premier League win has been like no other.\n\nClaudio Ranieri's champions have done it their way - and are now celebrating one of the most unlikely title triumphs in football history.\n\nHere, we take a look at how the Foxes diverted from the norm to shock the Premier League's traditional powerhouses and win their first top-flight crown…\n\nImage: How Leicester compare to previous Premier League winners\n\nEmerged from nowhere\n\nIn the history of the Premier League, every champion - until now - had finished in the top three the previous season. On average, winners placed second before their subsequent win. In contrast, Leicester finished 2014/15 in 14th, 46 points adrift of league winners Chelsea. Their remarkable escape from relegation wasn't a traditional platform for a title challenge.\n\nRanieri's first Premier League win Claudio Ranieri has become the eighth different manager to win the Premier League title.\n\nIndeed, their much-publicised 5,000/1 title odds illustrate just how far out of the running they were expected to be. It wasn't until a 3-1 win at Manchester City in February when thoughts of a sustained Leicester title challenge began to gather credence.\n\nA last-gasp defeat to Arsenal next time out was billed as a potentially fatal blow to Leicester's unlikely hopes - but their response was one of champions, taking 23 points from the next 27 available. Leicester went on to become the first first-time winners of the English top-flight since Nottingham Forest in 1978 - a title win out of nowhere.\n\nGave up possession and passing accuracy for direct football\n\nImage: Riyad Mahrez and Jamie Vardy have 39 goals between them this season\n\nLeicester's victorious season will surely be remembered for their direct, counter-attacking football.\n\nIn a complete reverse to the traditional style employed by Premier League winners, the Foxes were happy for their opponents to have the ball for long periods before using the pace of Jamie Vardy and co to do the damage on the break.\n\nThe approach is reflected in Leicester's low possession and passing stats - the rest of the top five rank among the league's best in these criteria. But when Leicester did have the ball they made it count.\n\nLeicester's possession & passing Team Possession (PL rank) Number of passes (PL rank) Passing accuracy (PL rank) Leicester 42.34 (18th) 12,586 (18th) 70.01 (20th) Tottenham 56.82 (4th) 17, 512 (6th) 80.04 (7th) Arsenal 58.63 (1st) 20,257 (1st) 84.35 (1st) Man City 57.34 (3rd) 19,487 (2nd) 83.35 (2nd) Man Utd 57.98 (2nd) 18,341 (3rd) 82.23 (4th)\n\nNo more tinkering\n\nPlease use Chrome browser for a more accessible video player Claudio Ranieri thinks Leicester's Premier League title run cannot be replicated\n\nRanieri returned to the Premier League last summer still known as the 'Tinkerman'. The nickname stemmed from his persistent tweaking to his Chelsea line-up during his 2000-2004 Stamford Bridge tenure. But at Leicester he found - and stuck with - a settled side.\n\nThe Italian made just 27 changes to his starting XI all season - way down on the 95.4 average for Premier League champions. Even Jose Mourinho, whose Premier League-winning Chelsea team in 2014/15 seemed to pick itself, made 86 changes last season.\n\nI think he's learnt from that. When I was at Chelsea, at times [the tinkering] wasn't good.\n\nMonday Night Football guest Scott Parker was signed by Ranieri for Chelsea and experienced his tinkering first-hand. He says the manager's new methods are a clear area of improvement. \"That's where he's evolved as a manager,\" Parker said. \"I think he's learnt from that. When I was at Chelsea, at times [the tinkering] wasn't good. He's become more predictable. You can name the substitutions he makes now, at certain minutes in the games.\"\n\nEdged tight contests\n\nImage: Riyad Mahrez hit the decisive winner in a 1-0 victory over Watford\n\nLeicester's Premier League-winning season was a tale of two halves. The first part ran to the end of December and saw Leicester register the joint-most goals in the division at that point but also concede more than any other team in the top half.\n\nHowever, as the title-race pressure told, there was a clear shift from the open, expansive football of high-flying underdogs to a more solid, clinical approach which reflected Leicester's determination to capitalise on their strong start to the campaign.\n\nLeicester conceded 25 times in their first 19 matches of the season. They let in just nine in their next 17. Five 1-0 wins in six games from the end of February summed up their altered style and, with two games still to play, they have already won more matches by the odd goal (14) than the 10.9 average for previous Premier League winners.\n\nLeicester's season of two halves Up to December 31, 2015 From January 1, 2016 Total Played 19 17 36 Won 11 11 22 Drew 6 5 11 Lost 2 1 3 Goals scored 37 27 64 Goals against 25 9 34 Points 39 38 77\n\nDoing it on a budget\n\nBankrolled by a billionaire Thai owner, Leicester are hardly operating on a shoestring budget. But a comparison of the value of their typical starting XI to previous Premier League winners demonstrates Ranieri's remarkable efforts in getting the best out of a squad acquired at the fraction of the cost.\n\nLeicester's most-used starting XI this season cost them just £23m to assemble. That's almost 10 times less than Chelsea's 2014/15 winners - and Manchester City and Manchester United fielded teams worth over £150m in their recent triumphant seasons.\n\nKeeping it fun\n\nPlease use Chrome browser for a more accessible video player A collection of Leicester manager Claudio Ranieri's most amusing quotes over the season.\n\nThere were no mind games from Ranieri, just humble press conferences - and the promise of pizza for his players if they kept clean sheets. Twenty years on from Kevin Keegan's rant at Sir Alex Ferguson, neither the Leicester boss nor his Tottenham counterpart saw fit to try to wind the other up.\n\nInstead, Ranieri's focus was on getting to 40 points in the first half of the campaign - long after Leicester seemed certain of survival. Later, he insisted his team were just enjoying the ride. The mood spread through the club, with owner Vichai Srivaddhanaprabha dishing out free beer and doughnuts to celebrate his birthday before a game against Southampton.\n\nMuch has been made of the camaraderie between the Leicester players. Ranieri has helped to maintain that spirit throughout the campaign - and the club have reaped the rewards."}, {"url": "https://www.bbc.co.uk/sport/football/scottish-premiership/table", "page_content": "1 team hasn't moved Celtic 38 32 3 3 114 34 80 99 W Won 2 - 0 against Heart of Midlothian on May 7th 2023. L Lost 0 - 3 against Rangers on May 13th 2023. D Drew 2 - 2 against St Mirren on May 20th 2023. L Lost 2 - 4 against Hibernian on May 24th 2023. W Won 5 - 0 against Aberdeen on May 27th 2023.\n\n2 team hasn't moved Rangers 38 29 5 4 93 37 56 92 W Won 1 - 0 against Aberdeen on May 7th 2023. W Won 3 - 0 against Celtic on May 13th 2023. W Won 3 - 1 against Hibernian on May 21st 2023. D Drew 2 - 2 against Heart of Midlothian on May 24th 2023. W Won 3 - 0 against St Mirren on May 27th 2023.\n\n3 team hasn't moved Aberdeen 38 18 3 17 56 60 -4 57 L Lost 0 - 1 against Rangers on May 7th 2023. D Drew 0 - 0 against Hibernian on May 13th 2023. L Lost 1 - 2 against Heart of Midlothian on May 20th 2023. W Won 3 - 0 against St Mirren on May 24th 2023. L Lost 0 - 5 against Celtic on May 27th 2023.\n\n4 team hasn't moved Hearts 38 15 9 14 63 57 6 54 L Lost 0 - 2 against Celtic on May 7th 2023. D Drew 2 - 2 against St Mirren on May 13th 2023. W Won 2 - 1 against Aberdeen on May 20th 2023. D Drew 2 - 2 against Rangers on May 24th 2023. D Drew 1 - 1 against Hibernian on May 27th 2023.\n\n5 team hasn't moved Hibernian 38 15 7 16 57 59 -2 52 W Won 2 - 1 against St Mirren on May 6th 2023. D Drew 0 - 0 against Aberdeen on May 13th 2023. L Lost 1 - 3 against Rangers on May 21st 2023. W Won 4 - 2 against Celtic on May 24th 2023. D Drew 1 - 1 against Heart of Midlothian on May 27th 2023.\n\n6 team hasn't moved St Mirren 38 12 10 16 43 61 -18 46 L Lost 1 - 2 against Hibernian on May 6th 2023. D Drew 2 - 2 against Heart of Midlothian on May 13th 2023. D Drew 2 - 2 against Celtic on May 20th 2023. L Lost 0 - 3 against Aberdeen on May 24th 2023. L Lost 0 - 3 against Rangers on May 27th 2023.\n\n7 team hasn't moved Motherwell 38 14 8 16 53 51 2 50 W Won 2 - 0 against Kilmarnock on May 6th 2023. W Won 2 - 0 against St Johnstone on May 13th 2023. W Won 1 - 0 against Ross County on May 20th 2023. D Drew 1 - 1 against Livingston on May 24th 2023. W Won 3 - 2 against Dundee United on May 28th 2023.\n\n8 team hasn't moved Livingston 38 13 7 18 36 60 -24 46 L Lost 0 - 2 against Ross County on May 6th 2023. L Lost 0 - 2 against Kilmarnock on May 13th 2023. W Won 2 - 1 against Dundee United on May 20th 2023. D Drew 1 - 1 against Motherwell on May 24th 2023. L Lost 0 - 2 against St Johnstone on May 28th 2023.\n\n9 team hasn't moved St Johnstone 38 12 7 19 41 59 -18 43 W Won 1 - 0 against Dundee United on May 6th 2023. L Lost 0 - 2 against Motherwell on May 13th 2023. W Won 1 - 0 against Kilmarnock on May 20th 2023. D Drew 3 - 3 against Ross County on May 24th 2023. W Won 2 - 0 against Livingston on May 28th 2023.\n\n10 team hasn't moved Kilmarnock 38 11 7 20 37 62 -25 40 L Lost 0 - 2 against Motherwell on May 6th 2023. W Won 2 - 0 against Livingston on May 13th 2023. L Lost 0 - 1 against St Johnstone on May 20th 2023. W Won 3 - 0 against Dundee United on May 24th 2023. W Won 3 - 1 against Ross County on May 28th 2023.\n\n11 team hasn't moved Ross County 38 9 7 22 37 60 -23 34 W Won 2 - 0 against Livingston on May 6th 2023. W Won 3 - 1 against Dundee United on May 13th 2023. L Lost 0 - 1 against Motherwell on May 20th 2023. D Drew 3 - 3 against St Johnstone on May 24th 2023. L Lost 1 - 3 against Kilmarnock on May 28th 2023."}, {"url": "https://www.bbc.co.uk/news/extra/xmE66MrmQT/2019-notable-deaths", "page_content": "‘Dr John’\n\nGrammy-winning singer\n\nThe New Orleans-born, Rock and Roll Hall of Fame singer - real name Malcolm John Rebennack Jr - combined the genres of blues, pop, jazz, boogie woogie and rock and roll. After his death, the former Beatles drummer Ringo Starr wrote on Twitter: “God bless Dr John, peace and love to all his family. I love the doctor, peace and love.”\n\n‘Ranking’ Roger Charlery\n\nThe Beat singer\n\nAs vocalist with The Beat, Ranking Roger spearheaded the two-tone movement with a distinctive vocal style influenced by the Jamaican rap technique of toasting. The group enjoyed several top 10 hits, most famously Mirror in the Bathroom - the first digitally recorded single released in the UK. Their 1980 cover of Andy Williams’ Can’t Get Used To Losing You was used as the main sample on Beyonce’s 2016 hit Hold Up.\n\nLaShawn Daniels\n\nGrammy-winning songwriter\n\nHe co-wrote such hits as Destiny’s Child’s Grammy-winning Say My Name and Lady Gaga’s Telephone. Daniels, who was known as Big Shiz, also worked with artists including Whitney Houston, Michael Jackson, Brandy and Toni Braxton.\n\nJames Ingram\n\nR&B singer-songwriter\n\nThe Grammy-winner and Oscar-nominee had two US number ones, with the smooth soul ballads Baby Come To Me and I Don’t Have The Heart. He also co-wrote Michael Jackson’s PYT with Quincy Jones.\n\nNipsey Hussle\n\nRapper\n\nHis debut album Victory Lap received a nomination for best rap album at this year’s Grammy Awards. Fellow musician Drake, who won a Grammy on the same night, took to Instagram to pay tribute to the 33-year-old: “My whole energy is just at a low right now hearing this… You were having the best run and I was so happy watching from distance fam nobody ever talks down on your name you were a real one to your people and to the rest of us.”\n\nJuice Wrld\n\nRapper\n\nThe musician, real name Jarad Anthony Higgins, rose to fame in 2018 with hit singles All Girls Are the Same and Lucid Dreams. More plaudits followed the release of his first studio album, Goodbye & Good Riddance - and his second album Death Race for Love topped the Billboard chart this year.\n\nRic Ocasek\n\nLead singer of The Cars\n\nThe US band - formed in Boston in the mid-1970s by Ocasek and Benjamin Orr - helped kick-start the new wave movement. Merging guitar rock with synthesizer-based pop, their early hits included Just What I Needed, My Best Friend’s Girl and Good Times Roll. Their 1984 ballad Drive was used as background music for footage of the Ethiopian famine, and its re-release as a single after Live Aid helped raise money for the cause.\n\nEddie Money\n\nTake Me Home Tonight singer\n\nBorn Edward Joseph Mahoney in New York, Money had major US chart success in the 70s and 80s with songs such as Two Tickets to Paradise and Take Me Home Tonight. He released 11 albums and sold nearly 30 million records in a career that spanned four decades.\n\nGinger Baker\n\nCream drummer\n\nHe was one of the most innovative and influential drummers in rock music. A co-founder of Cream, Ginger Baker also played with Blind Faith, Hawkwind and Fela Kuti in a long and varied career. His style combined the lyricism of jazz with the crude power of rock. One critic said watching him was like witnessing “a human combine harvester”.\n\nHal Blaine\n\nProlific and influential drummer\n\nOver the course of his career he played on countless hits by Frank Sinatra, Elvis Presley, The Beach Boys and John Lennon, amongst others. According to the Rock and Roll Hall of Fame, which inducted him in 2000, Blaine “certainly played on more hit records than any drummer in the rock era, including 40 number one singles and 150 that made the [US] top 10”. His most recognisable riff is the “boom-ba-boom-crack” bar that opens The Ronettes’ Be My Baby.\n\nMalcolm ‘Molly’ Duncan\n\nAverage White Band saxophonist\n\nDuncan attended Dundee Art College with fellow band members Roger Ball and Alan Gorrie. He played sax on the group’s US chart-topper Pick Up The Pieces. The soul and funk band, formed in 1972, gained worldwide success including a number one album in the US.\n\nDaryl Dragon\n\nCaptain & Tenille’s Captain\n\nThe singer and pianist achieved fame as half of musical duo Captain & Tennille. Dragon and his ex-wife Toni Tennille (pictured) were best known for Love Will Keep Us Together, which topped the US charts in 1975. Tennille described him as “a brilliant musician with many friends who loved him greatly. I was at my most creative in my life, when I was with him.”\n\nMarie Fredriksson\n\nRoxette singer\n\nRoxette achieved global success in the late 1980s and 1990s with hits such as Joyride, Dressed for Success and The Look. Fredriksson and bandmate Per Gessle (both pictured) achieved their biggest success when It Must Have Been Love was re-written for inclusion on the Pretty Woman film soundtrack in 1990. The song topped the charts in more than 10 countries and gave Roxette their biggest UK hit, reaching number three.\n\nBoon Gould\n\nLevel 42 musician\n\nRoland Charles “Boon” Gould (pictured left) was one of the founding members of the 1980s pop group, playing guitar and saxophone between 1980 and 1987 - and reuniting for a one-off performance in 2012. Level 42 formed on the Isle of Wight and had a string of hits including Lessons in Love and Running in the Family.\n\nJoão Gilberto\n\nFather of bossa nova\n\nThe Brazilian musician’s versions of songs like Quiet Nights and The Girl from Ipanema became standards in world music. He created a new beat, with his unique guitar style, mixing traditional samba music with modern jazz influences. In 1964, he famously collaborated with America saxophone player Stan Getz. Their album - Getz/Gilberto - sold millions of copies and won international praise, including a US Grammy for Album of the Year.\n\nMark Hollis\n\nLead singer of Talk Talk\n\nThe 1980s band achieved mainstream success with such hits as It’s My Life and Such a Shame, but became increasingly insular and experimental over time. After releasing a solo album in 1998, Hollis removed himself from public view. Spandau Ballet’s Gary Kemp said: “His influence upon music was immense and far-reaching. A great presence in the modern era who took his bow far too early but has left us so much still to be moved by.”\n\nKeith Flint\n\nProdigy singer\n\nRecognisable by his fluorescent spiked hair and known for high-octane performances, Flint sang lead vocals on both the band’s number one singles - Breathe and Firestarter. In 1996, Flint told the BBC the Firestarter lyrics, “I’m the firestarter/Twisted firestarter”, were not about starting fires. “It was when you’re in front of 5,000 people and you can go out there - and just with the aid of the music and a visual performance, you can stir all them people up into a frenzy and that’s almost like starting a massive fire, or a riot,” he said.\n\nBarrie Masters\n\nEddie and the Hot Rods singer\n\nThe band were best known for their top 10 hit in 1977, Do Anything You Wanna Do. Formed in Canvey Island, Essex in 1975, they were part of the pub rock scene which included Dr Feelgood and Ian Dury’s band Kilburn and the High Roads. In 1976 they made headlines when they played at London’s Marquee Club while supported by The Sex Pistols, who went on to smash the Hot Rods’ gear following a chaotic set.\n\nSir Stephen Cleobury\n\nKing’s College Cambridge choir conductor\n\nThe British conductor, organist and composer presided over the world-famous Festival of Nine Lessons which is broadcast live on BBC radio on Christmas Eve. He was director of music at King’s for nearly four decades.\n\nSulli\n\nK-pop star\n\nThe actress-singer, whose real name was Choi Jin-ri, was a member of girl band f(x) until she left in 2015 to focus on her acting career. She had more than five million followers on Instagram. She came to be known for speaking out on mental health issues, cyber-bullying and women’s rights - issues that remain sensitive in conservative South Korean society.\n\nPeter Tork\n\nOne of the Monkees\n\nTork was one of the four Monkees (pictured second from right) - a made-for-TV 1960s pop group and marketed as the American answer to The Beatles. He played keyboard and bass for the group, which had a string of hits including I’m A Believer, Daydream Believer and Last Train to Clarksville.\n\nNeil Innes\n\nMonty Python songwriter\n\nThe writer, comedian and musician was dubbed “The Seventh Python”. Python founding member Sir Michael Palin described him as “the most lovely friend”, while John Cleese called him “a very sweet man, much too nice for his own good”. Innes also performed in The Bonzo Dog Doo-Dah Band - later renamed The Bonzo Dog Band - who had a hit in 1968 with I'm the Urban Spaceman. After his work with Monty Python, Innes joined fellow Python Eric Idle on a new series, Rutland Weekend Television, which gave birth to their spoof band The Rutles - a pastiche of The Beatles.\n\nDick Dale\n\n‘King of Surf Rock’\n\nHis song Misirlou played over the opening credits to Quentin Tarantino’s film Pulp Fiction. Dale was known for his blindingly-fast strumming style, which inspired acts like The Beach Boys and Jimi Hendrix. He said the sound reminded him of the rumble and crash of the waves, and the noises of marine animals, as he surfed in California.\n\nLes Reed\n\nDelilah songwriter\n\nReed (pictured right) co-wrote Tom Jones hits Delilah and It’s Not Unusual, as well as The Last Waltz by Engelbert Humperdinck (pictured left). He also served as a pianist in The John Barry Seven and conducted his own orchestra for more than 10 years.\n\nMichel Legrand\n\nWindmills of Your Mind composer and jazz pianist\n\nHe wrote more than 200 film and TV scores, as well as songs. In 1968, he won his first Oscar for the song The Windmills of Your Mind from The Thomas Crown Affair. Two more best original score Oscars followed in 1971, for the movie Summer of ’42 and in 1983 for Yentl.\n\nKarel Gott\n\n‘Sinatra of the East’\n\nGott was a Czech singer who sold millions of records. He released almost 300 albums, starting in the mid-1960s, selling tens of millions of copies around the world. He was popular behind the Iron Curtain and became known as the “golden voice of Prague”, but he also found fame in Western Europe, especially in Germany."}, {"url": "https://www.dailyrecord.co.uk/all-about/dumfries-galloway", "page_content": "All the latest news, views, sport and pictures from Dumfries and Galloway. We bring you the best coverage of local stories and events from the Dumfries & Galloway Standard and Galloway News newspapers, plus Dumfries-related content from the Daily Record and Sunday Mail.\n\nFor the latest stories sign up to our newsletter here.\n\nYou can find us on Facebook, Twitter and Instagram.\n\nGot a story you want us to cover? Get in touch with the Dumfries & Galloway Standard or the Galloway News."}, {"url": "https://www.premierleague.com/premier-league-explained", "page_content": "Find out about the format and history of the Premier League\n\nThe Premier League is the top tier of England's football pyramid, with 20 teams battling it out for the honour of being crowned English champions.\n\nHome to some of the most famous clubs, players, managers and stadiums in world football, the Premier League is the most-watched league on the planet with one billion homes watching the action in 188 countries.\n\nThe league takes place between August and May and involves the teams playing each other home and away across the season, a total of 380 matches.\n\nThree points are awarded for a win, one point for a draw and none for a defeat, with the team with the most points at the end of the season winning the Premier League title.\n\nThe teams who finish in the bottom three of the league table at the end of the campaign, are relegated to the Championship, the second tier of English football.\n\nThose teams are replaced by three clubs promoted from the Championship; the sides that finish in first and second place and the third via the end-of-season playoffs.\n\nManchester United have won the Premier League title 13 times\n\nIf any clubs finish with the same number of points, their position in the Premier League table is determined by goal difference, then the number of goals scored, then the team who collected the most points in the head-to-head matches, then who scored most away goals in the head-to-head.\n\nSince the League began in 1992, there have been seven different winners: Manchester United, Arsenal, Chelsea, Manchester City, Blackburn Rovers, Leicester City and Liverpool. Man Utd have had the most success with 13 titles in the 31 seasons so far.\n\nMan City have the Premier League record for the biggest winning margin, when they finished 19 points ahead of second-placed Manchester United in 2017/18.\n\nThe narrowest winning margin of +8 goal difference came in 2011/12 when Sergio Aguero's goal, deep into stoppage time on the final day of the season, gave Man City the title in the most dramatic of Premier League finishes.\n\nArsene Wenger's Arsenal are the only side to have gone the entire Premier League campaign unbeaten. That record season was achieved in 2003/04, when they won the title by 11 points from Chelsea. For more Premier League facts and figures, click here.\n\nThere have been four different Premier League champions in the last five years, with Leicester City capping off an incredible sporting story by winning the title in 2015/16.\n\nThe unlikely title triumph came a season after the Foxes avoided relegation by only six points.\n\nMan City are the defending champions, having retained the Premier League Trophy by narrowly beating Liverpool for the second season running.\n\nLeicester City won the Premier League in the incredible 2015/16 campaign\n\nA total of 50 clubs have played in the Premier League, with Brighton & Hove Albion and Huddersfield Town being the latest to make their debuts, in 2017/18.\n\nSix clubs are \"ever-present\", having been in the Premier League since it formed: Arsenal, Chelsea, Everton, Liverpool, Manchester United and Tottenham Hotspur.\n\nThe teams who finish in the top four of the Premier League, qualify for the next season's UEFA Champions League group stages.\n\nA fifth-place Premier League finish will put a team into the UEFA Europa League, but the next best-placed teams who have not qualified for Europe, will also enter the competition if the winners of the FA Cup and/or League Cup qualify through their league position.\n\nThe team finishing sixth or lower depending on the cup competitions will enter the UEFA Europa Conference League.\n\nPremier League champions\n\n2021/22 Manchester City\n\n2020/21 Manchester City\n\n2019/20 Liverpool\n\n2018/19 Manchester City\n\n2017/18 Manchester City\n\n2016/17 Chelsea\n\n2015/16 Leicester City\n\n2014/15 Chelsea\n\n2013/14 Manchester City\n\n2012/13 Manchester United\n\n2011/12 Manchester City\n\n2010/11 Manchester United\n\n2009/10 Chelsea\n\n2008/09 Manchester United\n\n2007/08 Manchester United\n\n2006/07 Manchester United\n\n2005/06 Chelsea\n\n2004/05 Chelsea\n\n2003/04 Arsenal\n\n2002/03 Manchester United\n\n2001/02 Arsenal\n\n2000/01 Manchester United\n\n1999/00 Manchester United\n\n1998/99 Manchester United\n\n1997/98 Arsenal\n\n1996/97 Manchester United\n\n1995/96 Manchester United\n\n1994/95 Blackburn Rovers\n\n1993/94 Manchester United\n\n1992/93 Manchester United\n\nFor more Premier League history, click here."}, {"url": "https://www.premierleague.com/", "page_content": "01:56\n\nMan City 23 v Man Utd 99: Owen and Wright-Phillips' ultimate XI\n\nCity are tying to emulate United's Treble-winning team but which of the two squads' players would go in a combined XI?"}, {"url": "https://www.bbc.co.uk/sport/football/scottish-league-two/table", "page_content": "Search Enter a team or competition Search\n\nTeam P W D L F A GD Pts Form 1 team hasn't moved Stirling 36 21 10 5 67 37 30 73 W Won 1 - 0 against Stenhousemuir on April 15th 2023. D Drew 0 - 0 against Dumbarton on April 18th 2023. W Won 3 - 1 against Annan Athletic on April 22nd 2023. W Won 2 - 1 against Forfar Athletic on April 29th 2023. L Lost 0 - 2 against Albion Rovers on May 6th 2023. 2 team hasn't moved Dumbarton 36 18 8 10 49 39 10 62 W Won 2 - 0 against Bonnyrigg Rose on April 15th 2023. D Drew 0 - 0 against Stirling Albion on April 18th 2023. W Won 1 - 0 against East Fife on April 22nd 2023. L Lost 0 - 1 against Elgin City on April 29th 2023. D Drew 1 - 1 against Stranraer on May 6th 2023. 3 team hasn't moved Annan Athletic 36 14 9 13 61 51 10 51 W Won 3 - 1 against Dumbarton on April 8th 2023. W Won 4 - 0 against Albion Rovers on April 15th 2023. L Lost 1 - 3 against Stirling Albion on April 22nd 2023. D Drew 0 - 0 against Bonnyrigg Rose on April 29th 2023. L Lost 1 - 2 against Stenhousemuir on May 6th 2023. 4 team hasn't moved East Fife 36 14 8 14 54 50 4 50 D Drew 2 - 2 against Stirling Albion on April 8th 2023. W Won 8 - 0 against Stranraer on April 15th 2023. L Lost 0 - 1 against Dumbarton on April 22nd 2023. W Won 2 - 1 against Albion Rovers on April 29th 2023. L Lost 0 - 1 against Forfar Athletic on May 6th 2023. 5 team hasn't moved Forfar 36 13 9 14 37 43 -6 48 D Drew 0 - 0 against Stranraer on April 8th 2023. L Lost 0 - 2 against Elgin City on April 15th 2023. L Lost 0 - 1 against Bonnyrigg Rose on April 22nd 2023. L Lost 1 - 2 against Stirling Albion on April 29th 2023. W Won 1 - 0 against East Fife on May 6th 2023. 6 team hasn't moved Stenhousemuir 36 12 11 13 51 55 -4 47 D Drew 1 - 1 against Elgin City on April 11th 2023. L Lost 0 - 1 against Stirling Albion on April 15th 2023. L Lost 1 - 3 against Albion Rovers on April 22nd 2023. L Lost 0 - 2 against Stranraer on April 29th 2023. W Won 2 - 1 against Annan Athletic on May 6th 2023. 7 team hasn't moved Stranraer 36 12 9 15 43 57 -14 45 D Drew 0 - 0 against Forfar Athletic on April 8th 2023. L Lost 0 - 8 against East Fife on April 15th 2023. W Won 3 - 1 against Elgin City on April 22nd 2023. W Won 2 - 0 against Stenhousemuir on April 29th 2023. D Drew 1 - 1 against Dumbarton on May 6th 2023. 8 team hasn't moved Bonnyrigg Rose 36 11 9 16 36 47 -11 42 D Drew 0 - 0 against Stenhousemuir on April 8th 2023. L Lost 0 - 2 against Dumbarton on April 15th 2023. W Won 1 - 0 against Forfar Athletic on April 22nd 2023. D Drew 0 - 0 against Annan Athletic on April 29th 2023. W Won 3 - 0 against Elgin City on May 6th 2023. 9 team hasn't moved Elgin 36 11 7 18 44 62 -18 40 D Drew 1 - 1 against Stenhousemuir on April 11th 2023. W Won 2 - 0 against Forfar Athletic on April 15th 2023. L Lost 1 - 3 against Stranraer on April 22nd 2023. W Won 1 - 0 against Dumbarton on April 29th 2023. L Lost 0 - 3 against Bonnyrigg Rose on May 6th 2023. 10 team hasn't moved Albion 36 11 6 19 47 48 -1 39 W Won 3 - 0 against Elgin City on April 8th 2023. L Lost 0 - 4 against Annan Athletic on April 15th 2023. W Won 3 - 1 against Stenhousemuir on April 22nd 2023. L Lost 1 - 2 against East Fife on April 29th 2023. W Won 2 - 0 against Stirling Albion on May 6th 2023. Last updated 8th May 2023 at 14:59\n\nPlease note: All times UK. Tables are subject to change. The BBC is not responsible for any changes that may be made."}]}